{
  "modId": 50501.0,
  "modName": "The Grim and Somber ENBS",
  "summary": "The Grim and Somber ENBs are a collection of fantasy and vintage ENB presets based on the Somber series of ENB presets by Tansarville.  The blend a variety of cinematic and vintage effects to create a unique style and appearance.",
  "descriptionHtml": "[center]\n<br />\n<br />[size=4][b][color=#c2a56b]Grim and Somber Jyggalag and Hircine by [url=https://www.nexusmods.com/skyrim/users/19825204/?]phoenixfabricio [/url][/color][/b][/size]\n<br />\n<br />[youtube]_iFSz2gVvBg[/youtube] [youtube]HLKmjR5mJDQ[/youtube][/center][color=#c4c1b4]\n<br />The Grim and Somber ENB collection of presets are fantasy and vintage based ENB's with a focus on a dramatic lighting with an intense atmosphere and mood.  Do not look for a lot of realism in these ENB's as that is not the goal or aim behind them. A short summary of each one follows the instructions.\n<br />\n<br />INSTRUCTIONS: \n<br />\n<br />1) Download the Grim and Somber ENB Preset you wish to use from the files section. \n<br />\n<br />2) Copy the contents of the presets main folder to your Skyrim directory. This will consist of the enbseries folder, enblocal.ini, and enbseries.ini files for most of them.  Sheogorath comes with SweetFX files in which case copy those files over as well.\n<br />\n<br />3) Edit the the enblocal.ini file, under the -MEMORY- section, to reflect your computers set up.  Boris often updates the binaries at random so memory settings can vary depending on the binary being used. I recommend reading the STEP guide for enblocal.ini (can google it) to help set up memory settings. Boris also provides a VRAM tool that will detect how much memory to use (it is in the download area of enbdev.com under tools). You should use this tool to determine your video memory size.  Lastly Tapioks has videos (linked in my sticky in the comments) that help explain many ENB settings and effects so if you need help you run through those as well.\n<br />\n<br />[i]Some tips from Boris on MEMORY settings: For some people reducing ReservedMemorySizeMb to 64 or 128 helps to get rid of stuttering. Also try VideoMemorySizeMb=3000 and if not helps, then try AutodetectVideoMemorySize=true. DisableDriverMemoryManager=true may help also, but this depends from drivers mostly. Make sure that texture quality in game video options set to maximum, otherwise you always have stuttering. Also you can try to play with [THREADS] category (for binary 308 or higher).[/i]\n<br />\n<br />4) Download the appropriate [b]ENB Binary version[/b] from ENBDEV: [url=http://enbdev.com/download.htm]http://enbdev.com/download.htm[/url]. The only files you want from this download are the d3d9.dll and enbhost.exe files.  Do NOT install the entire folder!  Use the ones from the wrapper folder first (if those don't work for you try the injector version - injector requires enbinjector.ini, enbhost, enbseries.dll, and ENBInjector.exe).  Copy these files to your Skyrim folder.\n<br />\n<br />5) You may need to set the enbhost.exe file to run as the administrator (right click, properties, compatibility tab, near bottom check \"run program as administrator\") and make sure it is not being blocked by an anti-virus program. \n<br />\n<br />6) Set to \"application controlled\" the Anti-Aliasing setting on your video card (or if that is not an option disable it). Then disable it for Skyrim (either by running the launcher and disabling it there or by editing your skyrimpref.ini file and setting iMultiSample=0). Failure to disable AA the setting will result in many ENB effects not being rendered. For anisotropic filtering(AF) the recommended option, per Boris, is to set the video game driver to \"application preference\" or \"application controlled\" then set the game setting (skyrimpref.ini file; if using MO change all the copies of it) to 16 and keep it enabled in ENB. Then anything not picked up by the game will be picked up by the ENB mod. Or you can disable it in the skyrim INI file and just use the ENB version. \n<br />\n<br />7) Edit your skyrimprefs.ini file (usually found in your my documents/games/skyrim folder).  You may need to add the various \"Shadow\" values manually under the -DISPLAY- section. If you use Mod Organizer be sure to edit those INI files as well.\n<br />[i]\n<br />bFloatPointRenderTarget=1 \n<br />bDoDepthOfField=0  // or set to 1 to help with transparent water issues\n<br />iBlurDeferredShadowMask=5 (for best shadow quality, no lower then 4, if seeing pixelization/grids try as high as 7)\n<br />bTreesReceiveShadows=1 \n<br />bDrawLandShadows=1\n<br />bDrawShadows=1 [/i]\n<br />\n<br />For Binary 292 or higher, per Boris, you should leave the following settings at there default in the skyrimpref.ini:\n<br />\n<br />[i]ibShadowMaskZPrepass=0\n<br />bMainZPrepass=0\n<br />bDeferredShadows=1\n<br />[/i]\n<br />\n<br />8) Finally download any of  the optional files and/or any of the recommended mods you wish to use and install those. \n<br />\n<br />9) SPECIAL NOTE for users of Jyggalag, Sheogorath, Vaermina, or Shards of Oblivion:  If using any of these presets make sure you do not have the enbhelper.dll file installed (often left over from an improper uninstall by users) which can be found either in your &#92;Skyrim folder or the enbseries folder.  These presets use old code that is incompatible with the enbhelper.dll file (which is why I don't include it in the preset download).  The enbhelper.dll file should only be used with presets that support it (my other presets - Azura, Malacath, and Hircine - do support it). What happens is the helper DLL will reverse interior lighting at certain times of the day making things pitch black inside even with light sources on.  \n<br />\n<br />Besides the the enbhelper.dll issue those presets also won't display some interior lights correctly. So if you still have dark interiors, and do not have the enbhelper.dll installed, then you will need to install the mod [url=http://www.nexusmods.com/skyrim/mods/12454/?]Original Dark Dungeons (ODD) for ENB by mindflux[/url].  This mod fixes certain dungeons (Helgen being one of them) and other interior locations in the game that use daytime settings by making those locations use night-time settings. \n<br />\n<br />10) Note that Shards of Oblivion uses binary 221 because the old binary preserves the look of this preset best and I do not recommend, nor support, any other binaries with it.\n<br />\n<br />11) Currently Sheogorath comes with SweetFX files - be sure to install those. Note that SweetFx is not compatible with Windows 10 for most people and I do not support Sheogorath on Windows 10 for this reason. I have left it available for downloading for those interested in playing around with it.\n<br />\n<br />[center][img]http://farm6.staticflickr.com/5474/11411980575_c3f76ea53b_m.jpg[/img][img]http://farm4.staticflickr.com/3811/11038173586_23b0913879_m.jpg[/img][img]http://farm8.staticflickr.com/7379/11411972386_cb8e28c214_m.jpg[/img][/center]\n<br />\n<br />[center][b][color=#c2a56b]Grim and Somber Azura and Malacath by Saran OhKay[/color][/b][/center]\n<br />\n<br />[center][youtube]LM9gqFMcd-U[/youtube] [youtube]VIU4hfCd4a0[/youtube][/center]\n<br />\n<br />[color=#c2a56b][b]Summary of Presets[/b][/color]\n<br />\n<br />[b]Azura[/b], previously known as Grim and Somber Enchanted Next Generation, is a very bright fantasy based ENB using all modern shaders and effects.  Nights are bright and tinted for a strong fantasy feel.  Days are crisp and colorful without being over-saturated.  Azura is the most current preset offered.  The name was chosen as this is the \"future\" of the presets using next generation code.  It is also bright, like a star.\n<br />\n<br />[b]Hircine[/b], previously known as Grim and Somber Main Directors Cut, has remained the same and only updated to the most current binary.  Everyone seems to like this solid and dark preset that makes me think of the dark hunter with its deeper contrast and higher black levels.  Hence I went with Hircine for the name.\n<br />\n<br />[b]Jyggalag[/b], this preset is the original Somber Antique (Beta 199) updated to the current ENB binary and tweaked by myself.  Jyggalag is the Daedric Prince of Order and the opposite of Sheogoarth, Prince of Madness and Creativity.  I choose this prince because it is somewhat the opposite of the extreme visuals of Sheogorath yet the two share much of the same code.  Somber Antique is also about bringing order out of chaos by its attempt to use extreme bloom values and bring them under control (although not always successfully).  It is the original classic preset that started the Somber series so I thought one of the original Princes would be a great choice.  Now, much like Jyggalag himself, Somber Antique has returned to roam the Void. \n<br />\n<br />[b]Malacath [/b]is a very customized Grim and Somber preset and while the shaders and palette belong to Tansarville (tali) all the tweaking has been completely done by myself and hence I consider it to be a bit of an outcast from the reset of the presets.  It has new bloom settings along with all new shader code.  It has custom weathers and is somewhat more saturated, with a touch more contrast, then the other presets (except Hircine).  \n<br />\n<br />[b]Sheogorath[/b], previously known as Somber Wintage 35mm Resurrected, has been unchanged and only updated to the most current binary.  This preset is the original Wintage 1.5 version made over a year ago by Tansarville.  I picked Sheogorath as this is a mad preset - wild colors, intense lights mixed with desaturated tones, film flares and a crazy DOF.  It is at times colorful and bright yet at others dim and dark. Note that it is no longer supported as I can't run SweetFX properly on my Windows 10 PC.\n<br />\n<br />[b]Vaermina[/b], previously known as Somber Lut Sepia, has been tweaked from ENB version 221 to be made compatible with current binaries, add some polish, and create a slightly new look.  I picked the Prince of Nightmares as this is a nightmare of a preset to balance.  It has a heavy yellow-green tint, explosively bright bloom that can look awesome in some places but creates a nova light in others. It has a rather surreal feel to it at times, much like dreams.\n<br />\n<br />[b]Shard of Oblivion[/b] is a special preset for use with the mod [url=http://www.nexusmods.com/skyrim/mods/53608/?]Shard of Oblivion WIP by Mika999[/url] and it uses ENB binary 221.  It should only be used with that ENB binary file and it is made to work with Shard of Oblivion mod to get the most out of the oblivion landscape and atmosphere.\n<br />[/color]\n<br />[center] [/center][center][img]http://farm4.staticflickr.com/3723/11214365526_0e48699772_m.jpg[/img][img]http://farm8.staticflickr.com/7316/11569521684_c88d265f14_m.jpg[/img][img]http://farm6.staticflickr.com/5496/11569597563_82e704a826_m.jpg[/img][/center]\n<br />[b][color=#c2a56b]Performance Options for Grim and Somber ENBS[/color][/b]\n<br />[color=#c4c1b4]\n<br />All presets, except Sheogorath, now come with only one default setting - a balance of performance and quality (roughly the high to medium area versus ultra or low). If you wish to tweak them for performance I suggest you check out the ENB guide with STEP for tips. Also many of the presets have comments in the enbseries.ini file with suggestions on settings for performance. I also include a few suggestions below.\n<br />\n<br />[i]Note that Temporal AA is disabled by default on all versions but if used it provides superior AA.  The main downside is TAA can create motion artifacts but they tend to be minimal if your average FPS is above 30.  It is even less noticeable in first person or when using current binaries (308 or higher).[/i]\n<br />\n<br />To improve performance you can try editing some of the quality settings using the in-game ENB GUI editor.  Start with lowering the quality of sky lighting and reflections by one degree at a time. Note very low settings can sometimes cause graphic artifacts, weird shadows, black grids, and other issues. After that try lowering any other quality settings by 1 degree and test your FPS.  I recommend lowering quality over disabling any effects but if you must DOF, Reflections, Underwater and Water would be first choices.  Do NOT disable SSAO (Ambient Occlusion), Skylighting, or IBL (image based lighting) as it will destroy much of the dramatic lighting.\n<br />\n<br />Also can try playing with memory settings. From Boris: For some people reducing ReservedMemorySizeMb to 64 or 128 helps to get rid of stuttering. Also try VideoMemorySizeMb=3000 and if not helps, then try AutodetectVideoMemorySize=true. DisableDriverMemoryManager=true may help also, but this depends from drivers mostly. Make sure that texture quality in game video options set to maximum, otherwise you always have stuttering. Also you can try to play with [THREADS] category (for binary 308 or higher).[/color]\n<br />\n<br />[b][color=#c2a56b]General Options[/color][/b]\n<br />[color=#c4c1b4]\n<br />[i]ENB GUI\n<br />[/i]To enable the ENB GUI in-game hold down the SHIFT + CONTROL buttons at the same time (this is different than many configurations that use SHIFT + ENTER).\n<br />\n<br />[i]DOF Options\n<br />[/i]Many presets come with optional DOF's you can use.  Look in the DOF options folder(s) to see what they do and how to use them.  Static gives the best FPS, Soulwynds has the most flexibility and controls, and GP and Kingeric is the most cinematic.\n<br />\n<br />[i]Data FIle[/i]\n<br />The data file is optional and can be downloaded and installed using NMM. The data folder contains a sun and sunglare texture, ENB particle and sub-surface scattering fixes by mindflux, and an updated horizon mesh by JawZ.\n<br />\n<br />[i]Letterbox Vignette (Cinematic Bars)[/i]\n<br />A letterbox vignette adds black bars to the top and bottom of the screen.  \n<br />\n<br />To enable/disable letterbox, and adjust its height, open up the in-game ENB GUI.  In the \"Shader parameters\" window click on the \"EFFECT.TXT\" window to expand it.  Near the bottom you will see the \"letterbox\" and \"letterbox bar - height\" values.  Enable/disable by checking the box.  The default height for the bars is 7% (0.07)\n<br />\n<br />Some presets may have a rounded vignette. They can usually be disabled in the EFFECT.TXT GUI in-game under the vignette section.  If using vignettes from SweetFX, edit the SweetFX settings text file and change the 1 to a 0 under the vignette option.\n<br />\n<br />[i]Film Grain Effect[/i]\n<br />Film grain adds a grainy feel to the screen by adding small moving specks (noise) to the screen. To enable/disable, and change its look, open up the in-game ENB GUI.  In the \"Shader parameters\" window expand the ENBEFFECTS section, or the EFFECT section, and check/uncheck the \"Enable Grain\" to enable/disable (located near the bottom under Film Grain).  The other variables will let you change its intensity, saturation, and motion for both interiors and exteriors.  Different presets may have them in different sections.\n<br />\n<br />[i]Palettes[/i]\n<br />[b]WARNING[/b]: With Grim and Somber Azura do not use any other palette except the one that comes with the preset.  Some of the other presets, however, come with optional palettes you may use.\n<br />\n<br />To install an optional palette copy the enbpalette.bmp file (from the options folder of your choice) into the enbseries folder you installed in the Skyrim directory.  It will replace the one already there.\n<br />\n<br />[i]Rain[/i]\n<br />If you want to disable the ENB rain effect, and use your own texture, then open up the enbseries.ini file and find the [RAIN] section.  Under the [RAIN] section change Enable=true to Enable=false.  If rain is enabled in ENB it will override any custom rain textures you might have installed.  Note: If you use ENB rain do not use it with \"Real Rain by Player Two\" as that mod distorts the raindrops and makes it look like it is only raining in front of the camera.  It works fine with the textures though.\n<br />\n<br />[i]Sun[/i]\n<br />If you want to enable/disable the ENB procedural sun effect then open up the enbseries.ini file and find the [EFFECTS] section (near the top).  Then set the EnableProceduralSun=true to EnableProceduralSun=false.  If EnableProceduralSun is enabled it will override any custom sun textures you might have installed.\n<br />\n<br />To uninstall a Grim and Somber ENB preset simply delete all the same files and folders that you added to your Skyrim folder when you installed Somber (see install directions above for a list of the files).  Also be sure to uninstall the specific data files that you installed (either via NMM or manually).  You may also want to refresh your skyrim.ini and skyrimpref.ini files to reset them to vanilla settings (or settings you saved prior to installing this ENB) to prevent future conflicts with other mods or ENBs.\n<br />\n<br />There are no required mods for these presets (although note you may need Original Darker Dungeons if using Jyggalag, Vaermina, Sheogorath, or Shards of Oblivion as they are old presets).  I do not like making an ENB dependent on any external files so I have done the best I can to remove any dependencies.  Some of the options I included in the downloads section, and some of the recommended mods, can help improve the overall quality but they are not required.\n<br />\n<br />[center][img]http://farm8.staticflickr.com/7387/10893716686_15fb64545e_m.jpg[/img][img]http://farm4.staticflickr.com/3760/10893852944_555562c28e_m.jpg[/img][img]http://farm8.staticflickr.com/7459/10893998613_608a0e7d67_m.jpg[/img][/center]\n<br />The following mods are optional but recommended as they can greatly enhance your experience.  If you are looking for a lighting MOD that works well with these presets then I recommend Relighting Skyrim by Novak Dalton.\n<br />[/color][color=#c4c1b4]\n<br />\n<br />[list][*][size=2][url=http://www.nexusmods.com/skyrim/mods/54302/?]Rustic Windows by Gamwich[/url][/size]\n<br />[*][size=2][url=http://skyrim.nexusmods.com/mods/37865/?]AmidianBorn Landscape[/url][/size] \n<br />[*][size=2][url=http://skyrim.nexusmods.com/mods/18814/?]Project Parallax[/url][/size] \n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/59809/?]Vivid Clouds[/url][/size] \n<br />[*][size=2][url=http://skyrim.nexusmods.com/mods/18916//?]Lanterns of Skyrim[/url][/size] \n<br />[*][size=2][url=http://skyrim.nexusmods.com/mods/42392//?]Candle Glow by HHaleyy[/url][/size]\n<br />[*][size=2][url=http://skyrim.nexusmods.com/mods/141//?]Skyrim Flora Overhaul[/url][/size] \n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/49344/?]Vivid Landscape - All in One[/url][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/49011/?]Quality Snow HD 4K (dark version) by Yuril[/url][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/17609/?]Relighting Skyrim by NovakDalton*[/url][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/12454/?]Dark Dungeons (DD) for ENB by mindflux**[/url][/size]\n<br />[/list][/color][color=#c4c1b4]\n<br />\n<br />* Relighting Skyrim (RLS) is the only lighting mod I support. Works best with Dark Dungeons (DD) by MindFlux and load DD after RLS. \n<br />\n<br />[/color]\n<br />[b][color=#c2a56b]Incompatible Mods[/color][/b][color=#c4c1b4]\n<br />\n<br />In general I prefer to not restrict what mods people use with these presets (in my experience people will use them anyhow).  In general avoid any mod that changes interior fog - as all the presets (except Hircine) rely heavily on interior fog for a lot of the atmosphere.  I used to say not to use revamped exterior fog but I find using it doesn't destroy the look of the preset like removing interior fog does. If you use Supreme and Volumetric Fog load that after revamped.\n<br />\n<br />If using any version of Jyggalag, Vaermina, Sheogorath, or Shards do not install the enbhelper.dll - it is not compatible with those 4 presets.\n<br />\n<br />In addition most lighting and/or weather mods (RLO, ELFX, COT, RCRN, NLA, Vivid Weathers, etc.) or any mod that can alter graphics/visuals (Imaginator, Dynovision, etc.), can come into conflict and create overly dark/bright areas, shadow problems, strange tinting, ugly fog, or other issues.  A lot depends on what you are willing to put up with, what your tastes are, and what options you use.  If you want to try using a weather/lighting/graphic mod then that is your choice - it won't make your PC blow-up. My advice is to try them for yourself and see how they look.  I will note, however, that \"Real Rain by Player Two\" will cause issues with ENB rain - it can make the rain look chunky and centered around the player.  If you use that mod do so with the textures and ENB rain disabled.\n<br />\n<br />From a support standpoint, however, I only tune this preset around vanilla lighting and Relighting Skyrim by NovakDalton.  You can use anything else you want just be aware I can't support it and don't have any idea what it will look like.\n<br />\n<br />[b]I also STRONGLY ask that if you go to the comments and make a post about how X preset looks [insert problem here] and you are using any of the problematic mods listed above, or any similar mods, then please mention them in your post. The amount of my own personal free time I have wasted trying to help someone with a problem ... only to discover its because they were using an unsupported mod ... is way more than I would like. Time is a precious commodity. I am sure you don't like your own free time wasted so have some courtesy and don't waste mine.[/b]\n<br />\n<br />\n<br />[center][img]http://farm6.staticflickr.com/5524/11411969886_1c74c72dae_m.jpg[/img][img]http://farm3.staticflickr.com/2860/11973243064_e036911364_m.jpg[/img][img]http://farm8.staticflickr.com/7336/11411963996_c6237ee65a_m.jpg[/img][/center]\n<br />[/color]\n<br />[b][color=#c2a56b]General Resources[/color][/b]\n<br />[color=#c4c1b4]\n<br />[url=http://wiki.step-project.com/Guide:ENBseries_INI]Want to tweak some of the settings? Check out the STEP ENBSeries INI Guide.[/url]\n<br />[url=http://skyrim.nexusmods.com/mods/39742//?]Guide to ENBSeries - Teaching you how to tweak ENB by --JawZ--[/url]\n<br />[url=http://enbseries.enbdev.com/forum/viewtopic.php?f=14&amp;t=3679]Wonder what Reflections, SSS, IBL, or Indirect Lighting do? See them visually in action with Tapioks Tech Videos.[/url]\n<br />\n<br />Before asking for help review the list below for basic troubleshooting issues and tips.\n<br />\n<br />[list][*] [size=2]Make sure you do not have any left over mods, in your data folder, from previous ENBS [/size]\n<br />[*][size=2] Properly uninstall any previous ENB and install the new one fresh.  Don't just overwrite files!!![/size]\n<br />[*][size=2] You may need to set enbhost.exe to run with admin access and verify it is not blocked by your virus program.[/size]\n<br />[*][size=2] Double check all files are installed and in their proper place.[/size]\n<br />[*][size=2]Verify your skyrimpref.ini file is set correctly.  Those settings can easily be reset to vanilla settings by the skyrim launcher, updates, or local file integrity checks.  Always double check those if you are having problems.  Some mod managers create their copies of these files - so check those as well.[/size]\n<br />[*][size=2]Double check your memory settings in ENBLOCAL.INI.  Improper settings can increase the odds of CTD's, infinite loading screens, sudden FPS drop rates, and freezes.[/size]\n<br />[*][size=2]Be aware that these are demanding ENB presets.  Toss in a lot of heavy scripting mods, high resolution textures, and you are bound to have some FPS loss.  Depending on your PC you could have more stuttering and sudden FPS drops when looking at objects that have HR textures.  Consider lower resolution textures or a performance preset.[/size]\n<br />[/list]\n<br />[/color]\n<br />\n<br />[b][color=#c2a56b]Common Problems and Solutions[/color][/b]\n<br />[color=#c4c1b4]\n<br />[b]No ENB GUI:[/b]\n<br />Use SHIFT + CONTROL to open the ENB GUI (not shift + enter).\n<br />\n<br />[b]Dark Interiors and/orTorches and light sources not working correctly[/b]\n<br />See step 9 of the install instructions. Older presets do not work with the enbhelper.dll file (which can reverse the lighting making things very dark) and also require Original Dark Dungeons by Mindflux which fixes flags for dungeon interiors to work with ENBs to show proper lighting.\n<br />\n<br />[b]Noisy Textures or Lines on screen[/b]:\n<br />Try setting FilterQuality=1 in [SKYLIGHTING] section of enbseries.ini\n<br />\n<br />[b]Missing Textures or walls[/b]:\n<br />Make sure you disabled Anti-aliasing settings on your video card and in Skyrim.\n<br />\n<br />[b]Sunshines through things[/b]\n<br />Make sure you have bFloatPointRenderTarget=1 in your skyrimpref.ini file.   \n<br />\n<br />[b]No blur under water[/b]\n<br />Change bDoDepthOfField=1 in skyrimprefs.ini\n<br />\n<br />[b]Time of Day reversed for interiors (day is night)[/b]\n<br />See step 9 of the install directions.\n<br />\n<br />[b]Flashing lights, TFC command changes look, or other light changes[/b]\n<br />For binaries 250 or higher the Ninghiem Race mod causes light issues.  To fix make sure you have uploaded the optional ENB script fix for that mod (on the mods site).\n<br />\n<br />[b]Weird artifacts when moving or rotating the camera[/b]\n<br />This is caused my Temporal AA which is enabled with the game playing performance preset.  Disable it by opening up the in-game ENB gui (SHIFT+ENTER) and under the ANTIALISING section look for temporal AA and disable it by unchecking it.\n<br />[/color]\n<br />\n<br />[center][img]http://farm8.staticflickr.com/7380/11593960795_a4b09881f1_m.jpg[/img][img]http://farm4.staticflickr.com/3820/11579121696_a2b6e7bea7_m.jpg[/img][img]http://farm6.staticflickr.com/5473/11695185373_6b021ba8b6_m.jpg[/img][/center]\n<br />[b][color=#c2a56b]Main Credits for this ENB[/color][/b]\n<br />[color=#c4c1b4]\n<br />The Grim and Somber ENB presets are all based off the Somber Lut Sepia ENB created by the amazingly talented Tansarville, without who these presets would have never been possible.  No words can describe how thankful I am for her support and these wonderful presets!\n<br />\n<br />She handed over management of Somber Lut Sepia when she moved on and I have been tweaking and working on them ever since.  I have released my own prests based on her original code but I want to make it clear the core of all my presets is all the work of Tansarville.  Somber Lut Sepia 221 and Somber Wintage 35mm 251 are the ones closest to her originally released presets.  In the summer of 2014 Tansarville revamped and cleaned up all my shaders and updated my Enchanted preset to use the new shaders.  It is thanks to Tans that my presets look as good as they do!\n<br />\n<br />The original Somber series, that Tansarville made, is based on Unreal Cinema ENB code and UnrealWarfare deserves a special thanks for all his work and help!\n<br />\n<br />Also a very sincere thanks to --JawZ-- who is the most helpful ENB expert I have ever met. Without his patience, expertise, help guides, and skill I never would have made it this far on my ENB training.\n<br />\n<br />If I have missed anyone above, or below, please let me know and I will add you ASAP!\n<br />\n<br />[b]Tansarville [/b]- Creator of the Somber Lut Sepia ENB (and Somber Antique) and core base of these presets.  Tansarville is also the creator for the current GSE 4.X palette, modified Somber Lut palette, the Vintage Palettes, and the Somber Crescent Lut shaders (enbeffect.fx file).  Only she can give permission for other people to use her shader files.\n<br />\n<br />Maeldun0 - For allowing me to upload my personal version of Somber Antique (GS Jyggalag and GS Jyggalag Classic) on this page, for some of the Somber 3 settings used in Jyggalag, for the SSS settings used in most of the presets, for various code settings for Wintage, and for their support and advice on many things.\n<br />Trilville - For the first original Somber palette that Tansarville then modified for her presets.  However none of the current palettes are Trilville and all permissions to use current palettes have to go through Tansarville.\n<br />WolfGrimDark - Creator and manager of the Grim and Somber ENBS\n<br />Boris Vorontsov - ENB Series developer\n<br />HeliosDoubleSix - HD6 Shader code\n<br />Matso - enblens.fx file\n<br />IndigoNeko - Film Grain code\n<br />Trilville - Palette file used on Somber series tweaked from his palette\n<br />JawZ - DNI, GUI coding, enbeffect.fx, enbsunsprite.fx, atmopshere/horizon texture, letterbox code for effect.txt version, and well eveything.\n<br />MTichenor - Grain, vanilla adaption and bloom, HSV CC, Sepia\n<br />Aiyen - letter box code\n<br />Tonaran - Author of the initial optimized DNI factor\n<br />gp65cj04 and SkyrimTuner - Static DOF\n<br />gp65cj04 and GUI &amp; tweaks by ericking1992 and some twekas by Insomnia - GP and Kingerik DOF\n<br />Soulwynd - Tweakable DoF and Bokeh Shader\n<br />Kyokushinoyama - for his vintage/cinematic DOF and Bloom code\n<br />Mindflux - Particle Patch, Flora Mod, and Dark Dungeons\n<br />Andrej Dudenhefner - Creator of SMAA injector\n<br />Christian Jensen - Creator of SweetFX\n<br />ZeroKing - Ported shaders to ENB and using his effect.txt file\n<br />Prod80 - For his advice, code, tips, help and general support\n<br />Sloth - For turning me on to Rustic Windows and his friendship and support\n<br />Insomnia - For turning me on to the letterbox code that works with TAA and his support\n<br />Kingeric1992 - For LumaSharpen Gui enable/disable code\n<br />Kingeric1992 - optional DOF file (along with gp65cj04 and Insomnia)\n<br />OtisInf - For adding DES controls to Kingeric1992's DOF file\n<br />Hodilton - For the amazing video clip of GSE!\n<br />\n<br />Credits for the ULTIMATE SHADER ADDON for ENB 1.1\n<br />Based on Post-Process Effects Addon for ENB by ZeroKing\n<br />Initial D-N-I separation code and GUI implementation by --JawZ--\n<br />Kinematic Filter code (formerly known as Old Black-White TV Filter) originally by Boris Vorontsov\n<br />Kinematic Filter code tweaked by Trillville, Midhras, Kyokushinoyama, Insomnia\n<br />LumaSharpen code by CeeJay.dk, ported from SweetFX by ZeroKing, tweaked by prod80\n<br />Blur, Sharpening, Color Shift, Vignette code by Boris Vorontsov\n<br />Contrast and Vibrance code by CeeJay.dk, ported from SweetFX by ZeroKing\n<br />Noise code by MTichenor/IndigoNeko\n<br />Dithering, Border, Splitscreen code by CeeJay.dk, ported from SweetFX by Marty McFly\n<br />Letterbox code by Matso\n<br />Combined, edited, tweaked and arranged by Miratheus\n<br />\n<br />[/color]\n<br />[b][color=#c2a56b]Special Thanks[/color][/b][color=#c4c1b4]\n<br />\n<br />MannyGT - For [url=http://skyrim.nexusmods.com/mods/18916/?]Lanterns of Skyrim[/url] and permission to use a custom preset for Grim and Somber ENBS.\n<br />Amoebae - for the dirt and lens filters\n<br />\n<br />Saran OhKay - for videos.\n<br />\n<br />ForrestHome - For all her help in testing and finding bugs.  Without her critical eye this enb preset would be far less polished than it is now.\n<br />\n<br />Also special thanks to [b]Bronze316[/b][/color][color=#c4c1b4] who got me hooked on ENBs in the first place with his Seasons of Skyrim, True Vision, and Project ENB.  He was very patient with my questions, always supportive, and I never would have made it this far if he hadn't been around to nudge me along.\n<br />\n<br />\n<br />[/color][center][color=#c4c1b4][img]http://farm4.staticflickr.com/3763/11263341036_49a89d88f2_m.jpg[/img][img]http://farm3.staticflickr.com/2825/11607323175_43cc573a1d_m.jpg[/img][img]http://farm6.staticflickr.com/5549/11441663076_0c1a25ce1a_m.jpg[/img][/color][/center][color=#c4c1b4] \n<br />This ENB is for personal/private use only.  No one is allowed to upload, share, or otherwise publish any of the Grim and Somber ENB presets without direct permission from WolfGrimDark. Thank you for respecting the wishes of not only myself but all the people who helped make these presets available.\n<br />\n<br />Special Note on Permissions:  It is important to note that the list of credits reflect any resources used, either in part or in their whole, for my presets.  However many of those files have been heavily modified by Tansarville or myself for use with Grim and Somber.  Therefore if people are seeking permission for any modified files they need not only the permission of the original author but the permission of me and/or Tansarville as well. \n<br />\n<br />[/color]",
  "categoryId": "97",
  "version": "7.9.1",
  "author": "WolfGrimDark",
  "createdUnix": "1391626147",
  "updatedUnix": "1518304479",
  "containsAdultContent": false,
  "uploadedBy": "wolfgrimdark",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123559",
      "name": "Grim and Somber Shard of Oblivion ENB 221",
      "version": "5.0.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "9256",
      "fileName": "Grim and Somber Shard of Oblivion ENB 221-50501-5-0-0.zip",
      "uploadedUnix": "1408850849",
      "modVersion": "5.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f863fed534a49931b9889fd8351ab2770fbcda3e464bf7a2530a4686351e096/analysis/1408850947/",
      "changelogHtml": " UPDATE 2014-08-25\r<br />\r<br />- Removed Hermaeus Mora (Vintage) as it just needs to much work, even for Alpha, for sharing right now. It needs to be overhauled. Once I have something more presentable will bring it back online.\r<br />\r<br />UPDATE 2014-08-24\r<br />\r<br />- Note to open the GUI you need to use SHIFT + CONTROL in most of the new versions, not the old shift + enter.\r<br />\r<br />- Was testing and realized I uploaded the WIP version of Azura and not the stable one for v5.0. So did a quick reload to fix it, sorry about that&#33; The WIP isn&#39;t bad just has some color tinting that needs more work.\r<br />\r<br />UPDATE 2014-08-23\r<br />\r<br />- Updated all presets I manage to version 262. Each has been renamed after an associated Daedric Prince as I wanted to have an organized naming structure with a fantasy aspect that reflects the nature of the presets. Descriptions of each, along with their original name, can be found on the front page as well as the downloads description. I also made everything version 5.0.0 because I am compulsive that way.\r<br />- Azura (GSE Next Generation) had a variety of small and subtle changes made to it. I consider this preset a work in process as I continue to polish and tweak it.\r<br />- Hermaeus Mora (GS Vintage) was overhauled again and still in Alpha stage. Use at your own risk (well it won&#39;t hurt anything except maybe your sense of taste).\r<br />- All the others were just updated to the current ENB without any changes to their core settings. This includes Sheogorath (Wintage), Hircine (GS Main), Sanguine (GSE Regular), and Vaermina (original Somber Lut Sepia). Sheogorath and Vaermina use old code files and are not compatible with the enbhelper.dll so do not use the two of them together.\r<br />- I am also hosting a preset for Mika999, who is working on a mod called Shard of Oblivion, and has designed the mod with this preset in mind. It is called &#34;Grim and Somber Shard of Oblivion ENB 221&#34; and it uses ENB binary v221. It is under the miscellaneous section in the downloads. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Shard%20of%20Oblivion%20ENB%20221-50501-5-0-0.zip?fid=1000123559&ttl=1535832249&ri=8192&rs=8192&setec=c9a482f6f3c3dfb7f3e137839f845d73"
    },
    {
      "fileId": "1000190420",
      "name": "Grim and Somber Sheogorath Classic ENB 290",
      "version": "7.2.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "18355",
      "fileName": "Grim and Somber Sheogorath ENB 290-50501-7-2-1.zip",
      "uploadedUnix": "1452128294",
      "modVersion": "7.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/708faaf258a18f316c7d4227cc747e7b38b50cb781665334276a8b45178e2abe/analysis/1452128368/",
      "changelogHtml": " UPDATE 2016-01-06\r<br />\r<br />- Updated all the presets with adjusted Sub-Surface Scattering (SSS) values to make them less aggressive. Credit for the settings go to Maeldun0. Also updated all non-classic versions to binary 290 (which is mainly some edits to enblocal templates). Basically just house-keeping and general maintenance.\r<br />- Added the Jyggalag Classic preset that requires binary 221 and is based on the original Somber Antique by Tansarville. High quality but there are notes in the enbseries.ini file on how to get some performance. Similar to current version of Jyggalag but slightly different look since it runs on the old binary and it doesn&#39;t have any of the tweaks needed to make it current with 290. Also minor tweaks to saturation, brightness, and contrast. Since this is an old preset you can&#39;t use the enbhelper.dll file with it and you will mostly likely need Original Dark Dungeons installed just like the other old presets (Vaermina, Jyggalag, and Sheogorath).\r<br />- Future plans? Should I find the time and energy I plan on fixing some things with Hircine, overhauling Sanguine, and tweaking Malacath. Possibly an udpate to Jyggalg 290. Who knows when, or if, that will be as right now I am busy with many other things. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Sheogorath%20ENB%20290-50501-7-2-1.zip?fid=1000190420&ttl=1535832250&ri=8192&rs=8192&setec=1e412e7fcbeea6f78015aa9df978060e"
    },
    {
      "fileId": "1000206458",
      "name": "Grim and Somber Jyggalag Classic Binary 236",
      "version": "7.2.6",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "250",
      "fileName": "Grim and Somber Jyggalag Classic Binary 236-50501-7-2-6.zip",
      "uploadedUnix": "1463234292",
      "modVersion": "7.2.6",
      "virusScanUrl": "https://www.virustotal.com/file/852a9e94ce1e0503ed311bb265c70888c102447ebdf448ba41dd6bf68943549a/analysis/1463234343/",
      "changelogHtml": " UPDATE 2016-07-15\r<br />\r<br />- After some thought I decided it was creating more work than it was worth so removed the enblocal.ini PDF template file and replaced it with the real thing for any GS preset using binary 305. Just download the file and copy it over to your Skyrim root directory along with the other ENB files. I added a lot of notes in the file to help explain the various sections (plus some reference links online) to make it easier for people to adjust it to their own computer setup. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Jyggalag%20Classic%20Binary%20236-50501-7-2-6.zip?fid=1000206458&ttl=1535832251&ri=8192&rs=8192&setec=8e8beea2ff6ca596eab2a348106fa7c8"
    },
    {
      "fileId": "1000206459",
      "name": "Grim and Somber Vaermina Classic Binary 236",
      "version": "7.2.6",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "9337",
      "fileName": "Grim and Somber Vaermina Classic Binary 236-50501-7-2-6.zip",
      "uploadedUnix": "1463234365",
      "modVersion": "7.2.6",
      "virusScanUrl": "https://www.virustotal.com/file/d4788011480e535998177ebb4ec80517037f626f76949861ca33ecc75195e837/analysis/1463234406/",
      "changelogHtml": " UPDATE 2016-07-15\r<br />\r<br />- After some thought I decided it was creating more work than it was worth so removed the enblocal.ini PDF template file and replaced it with the real thing for any GS preset using binary 305. Just download the file and copy it over to your Skyrim root directory along with the other ENB files. I added a lot of notes in the file to help explain the various sections (plus some reference links online) to make it easier for people to adjust it to their own computer setup. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Vaermina%20Classic%20Binary%20236-50501-7-2-6.zip?fid=1000206459&ttl=1535832251&ri=8192&rs=8192&setec=8a3c7c70e3262b8ce841223394adb764"
    },
    {
      "fileId": "1000249256",
      "name": "Grim and Somber ENB Data Files from Mindlfux",
      "version": "7.3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "27334",
      "fileName": "Grim and Somber ENB Data Files from Mindlfux-50501-7-3-0.zip",
      "uploadedUnix": "1499903166",
      "modVersion": "7.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/01ce60bb6d7fceb4b8ab0874101748d61ec3833f77d7553147122d965d1625b2/analysis/1499903329/",
      "changelogHtml": " UPDATE 2017-07-12\r<br />\r<br />-Updated all current versions of presets to 315 to just move DOF into the new code file for it. These updates don&#39;t change the visuals but instead make them more compatible with 315 as Boris split off the DOF code into its own shader file so that other effects could be used in the prepass shader file. For now using the default prepass shader from Boris with it disabled.\r<br />- Spent afternoon/evening testing and they seem to be good (although I have way too many presets to test them all thoroughly). Because of the work involved I deleted all the optional DOF files and switched to just using the quality preset versions. If folks want performance they can tweak the enbseries.ini settings themselves (its pretty easy). I also left the previous versions around in case some bug comes up in 315 or I need them for some reason - so people can access them in the OLD FILES section. Will leave them there for a while at least.\r<br />- The changes from Boris: &#34;Published ENBSeries 0.315 for TES Skyrim. Added external shader for depth of field, so now prepass and dof can be in different files. Added parameter to toggle on/off enbeffectprepass.fx shader. Added mask texture to prepass and depth of field shaders to use it for cell shading modification from Nexus, alpha channel of this mask is less than 1 for all skinned objects. Forgot to say that in 0.315 there is another important change - depth texture for prepass and depth of field shaders contain transparent objects.&#34;\r<br />- Updated the data files from Mindflux to the most current sets (inside the zip are 3 more zips - one for each of the sets). Use as you wish.\r<br />- Jumped ahead to 7.3.0 as this was a larger update then just a tiny tweak. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20ENB%20Data%20Files%20from%20Mindlfux-50501-7-3-0.zip?fid=1000249256&ttl=1535832252&ri=8192&rs=8192&setec=cfa1778eb35b8eb8bbf1f100ad7eb987"
    },
    {
      "fileId": "1000254324",
      "name": "Grim and Somber Azura ENB 315",
      "version": "7.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10275",
      "fileName": "Grim and Somber Azura ENB 315-50501-7-3-1.zip",
      "uploadedUnix": "1505053609",
      "modVersion": "7.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/cc0530d5a5db642e71202d48377096166dd628427419663009f04b2c18beb566/analysis/1505053959/",
      "changelogHtml": " UPDATES 2017-09-10\r<br />\r<br />- Boris has released an updated binary 315 (no version change) as of today (10:30 am EST) that fixes the black shadow bug created by certain SSS and SSAO settings on some presets (mine and others). I have tested the patch this morning and updated all my presets that use binary 315 with it. He also indicated the most current update of 315 has a better start-up time and some minor improvements. *** BE SURE YOU HAVE THE MOST CURRENT VERSION OF 315 ***\r<br />- In addition Boris gave me a tip on improving performance without losing quality so I have tweaked all the 315 based presets and you may see some performance increases on some of them (which ones, and how much, will depend on your settings).\r<br />- Lastly I have take a lot of time this weekend to edit all the enblocal.ini and enbseries.ini files to add more comments and information on how to tweak them for performance or quality, suggestions for memory settings, which effects I use, and various general tidbits and comments. If I did not add a comment to an effect with a quality setting it is either because changing that quality value has negligible impact or I don&#39;t recommend changing it.\r<br />- Enjoy&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Azura%20ENB%20315-50501-7-3-1.zip?fid=1000254324&ttl=1535832252&ri=8192&rs=8192&setec=e073fdef53aff879be9af18e7321ef6d"
    },
    {
      "fileId": "1000254325",
      "name": "Grim and Somber Hircine ENB 315",
      "version": "7.3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5315",
      "fileName": "Grim and Somber Hircine ENB 315-50501-7-3-1.zip",
      "uploadedUnix": "1505053644",
      "modVersion": "7.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/a56d87a9b44d10c59bee3b529ecc3f3b7f156e95e06b4d8dd4da7c97d09c7571/analysis/1505053978/",
      "changelogHtml": " UPDATES 2017-09-10\r<br />\r<br />- Boris has released an updated binary 315 (no version change) as of today (10:30 am EST) that fixes the black shadow bug created by certain SSS and SSAO settings on some presets (mine and others). I have tested the patch this morning and updated all my presets that use binary 315 with it. He also indicated the most current update of 315 has a better start-up time and some minor improvements. *** BE SURE YOU HAVE THE MOST CURRENT VERSION OF 315 ***\r<br />- In addition Boris gave me a tip on improving performance without losing quality so I have tweaked all the 315 based presets and you may see some performance increases on some of them (which ones, and how much, will depend on your settings).\r<br />- Lastly I have take a lot of time this weekend to edit all the enblocal.ini and enbseries.ini files to add more comments and information on how to tweak them for performance or quality, suggestions for memory settings, which effects I use, and various general tidbits and comments. If I did not add a comment to an effect with a quality setting it is either because changing that quality value has negligible impact or I don&#39;t recommend changing it.\r<br />- Enjoy&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Hircine%20ENB%20315-50501-7-3-1.zip?fid=1000254325&ttl=1535832253&ri=8192&rs=8192&setec=8292e60358835e8bc19bc89caf878edd"
    },
    {
      "fileId": "1000254326",
      "name": "Grim and Somber Malacath ENB 315",
      "version": "7.3.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "18072",
      "fileName": "Grim and Somber Malacath ENB 315-50501-7-3-1.zip",
      "uploadedUnix": "1505053676",
      "modVersion": "7.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f1d27f040aedb358ffc9a76557b571b6c30951477814c112ae378bbd3f5360d/analysis/1505054041/",
      "changelogHtml": " UPDATES 2017-09-10\r<br />\r<br />- Boris has released an updated binary 315 (no version change) as of today (10:30 am EST) that fixes the black shadow bug created by certain SSS and SSAO settings on some presets (mine and others). I have tested the patch this morning and updated all my presets that use binary 315 with it. He also indicated the most current update of 315 has a better start-up time and some minor improvements. *** BE SURE YOU HAVE THE MOST CURRENT VERSION OF 315 ***\r<br />- In addition Boris gave me a tip on improving performance without losing quality so I have tweaked all the 315 based presets and you may see some performance increases on some of them (which ones, and how much, will depend on your settings).\r<br />- Lastly I have take a lot of time this weekend to edit all the enblocal.ini and enbseries.ini files to add more comments and information on how to tweak them for performance or quality, suggestions for memory settings, which effects I use, and various general tidbits and comments. If I did not add a comment to an effect with a quality setting it is either because changing that quality value has negligible impact or I don&#39;t recommend changing it.\r<br />- Enjoy&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Malacath%20ENB%20315-50501-7-3-1.zip?fid=1000254326&ttl=1535832254&ri=8192&rs=8192&setec=2a668fc70298e736d4e8c31ab2f99740"
    },
    {
      "fileId": "1000254328",
      "name": "Grim and Somber Jyggalag ENB 315",
      "version": "7.3.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "8946",
      "fileName": "Grim and Somber Jyggalag ENB 315-50501-7-3-1.zip",
      "uploadedUnix": "1505053804",
      "modVersion": "7.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/fc91a6511bd53e809ebfb3bf106f4593cf712c10ec2ab160b1a354c90885c769/analysis/1505054172/",
      "changelogHtml": " UPDATES 2017-09-10\r<br />\r<br />- Boris has released an updated binary 315 (no version change) as of today (10:30 am EST) that fixes the black shadow bug created by certain SSS and SSAO settings on some presets (mine and others). I have tested the patch this morning and updated all my presets that use binary 315 with it. He also indicated the most current update of 315 has a better start-up time and some minor improvements. *** BE SURE YOU HAVE THE MOST CURRENT VERSION OF 315 ***\r<br />- In addition Boris gave me a tip on improving performance without losing quality so I have tweaked all the 315 based presets and you may see some performance increases on some of them (which ones, and how much, will depend on your settings).\r<br />- Lastly I have take a lot of time this weekend to edit all the enblocal.ini and enbseries.ini files to add more comments and information on how to tweak them for performance or quality, suggestions for memory settings, which effects I use, and various general tidbits and comments. If I did not add a comment to an effect with a quality setting it is either because changing that quality value has negligible impact or I don&#39;t recommend changing it.\r<br />- Enjoy&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Jyggalag%20ENB%20315-50501-7-3-1.zip?fid=1000254328&ttl=1535832255&ri=8192&rs=8192&setec=316cf183a989adf5027f9a07bffa5668"
    },
    {
      "fileId": "1000254329",
      "name": "Grim and Somber Sanguine ALPHA ENB 315",
      "version": "7.3.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "18095",
      "fileName": "Grim and Somber Sanguine ALPHA ENB 315-50501-7-3-1.zip",
      "uploadedUnix": "1505053937",
      "modVersion": "7.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/8fbd46c4c2d9f6225ba622e4e4ae63c6e0a5e9cad24a98d3b6949094bdacfe05/analysis/1505054346/",
      "changelogHtml": " UPDATES 2017-09-10\r<br />\r<br />- Boris has released an updated binary 315 (no version change) as of today (10:30 am EST) that fixes the black shadow bug created by certain SSS and SSAO settings on some presets (mine and others). I have tested the patch this morning and updated all my presets that use binary 315 with it. He also indicated the most current update of 315 has a better start-up time and some minor improvements. *** BE SURE YOU HAVE THE MOST CURRENT VERSION OF 315 ***\r<br />- In addition Boris gave me a tip on improving performance without losing quality so I have tweaked all the 315 based presets and you may see some performance increases on some of them (which ones, and how much, will depend on your settings).\r<br />- Lastly I have take a lot of time this weekend to edit all the enblocal.ini and enbseries.ini files to add more comments and information on how to tweak them for performance or quality, suggestions for memory settings, which effects I use, and various general tidbits and comments. If I did not add a comment to an effect with a quality setting it is either because changing that quality value has negligible impact or I don&#39;t recommend changing it.\r<br />- Enjoy&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Sanguine%20ALPHA%20ENB%20315-50501-7-3-1.zip?fid=1000254329&ttl=1535832255&ri=8192&rs=8192&setec=b27445f22f3501e2b1b04176f6b9774a"
    },
    {
      "fileId": "1000258340",
      "name": "Grim and Somber Vaermina ENB 319",
      "version": "7.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8953",
      "fileName": "SETUP - GS VAERMINA 319.zip-50501-7-7.zip",
      "uploadedUnix": "1509200858",
      "modVersion": "7.7",
      "virusScanUrl": "https://www.virustotal.com/file/9f0df6ae55dee5f19763a706b6b472572004104d572592a4f9a9137d3826d7b2/analysis/1509200913/",
      "changelogHtml": " STATUS 2017-10-28\n<br /><br />- Updated Vaermina to version 7.7 with binary 319. Small changes to enblocal defaults and enbseries.ini settings. I made a user version (versus what I use myself) so people should see better performance as I disabled super sampling and made a couple of small tweaks to quality. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SETUP%20-%20GS%20VAERMINA%20319.zip-50501-7-7.zip?fid=1000258340&ttl=1535832256&ri=8192&rs=8192&setec=c24ff6d5a7d82724713ab5379819a5f5"
    },
    {
      "fileId": "1000258342",
      "name": "Grim and Somber Jyggalag ENB 319",
      "version": "7.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8947",
      "fileName": "SETUP - GS JYGGALAG - 319.zip-50501-7-7.zip",
      "uploadedUnix": "1509203899",
      "modVersion": "7.7",
      "virusScanUrl": "https://www.virustotal.com/file/a12411ce112d2795934519d026a2279c4cff311c0ca5eb6c241860045a8ab760/analysis/1509203973/",
      "changelogHtml": " STATUS 2017-10-28\n<br /><br />- Updated Vaermina to version 7.7 with binary 319. Small changes to enblocal defaults and enbseries.ini settings. I made a user version (versus what I use myself) so people should see better performance as I disabled super sampling and made a couple of small tweaks to quality. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SETUP%20-%20GS%20JYGGALAG%20-%20319.zip-50501-7-7.zip?fid=1000258342&ttl=1535832257&ri=8192&rs=8192&setec=0a3625ec16c240faee497654a11786f1"
    },
    {
      "fileId": "1000262104",
      "name": "Grim and Somber Jyggalag Classic Binary 236",
      "version": "7.8",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "251",
      "fileName": "Grim and Somber Jyggalag Classic Binary 236-50501-7-8.zip",
      "uploadedUnix": "1513457568",
      "modVersion": "7.8",
      "virusScanUrl": "https://www.virustotal.com/file/0f54dc03680b8c81410eff539ff5de4958bcb02cf5bc6dca68fd9cd82405f4d8/analysis/1513457643/",
      "changelogHtml": " STATUS 2017-12-16\n<br /><br />- Small update to Jyggalag Classic on binary 236. Fixed SSS settings so more skin detail can be seen (less transparent scars, war paint, tats, freckles, etc.), improved reflection details, eyes slightly brighter, and DOF and sharpening small tweaks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Jyggalag%20Classic%20Binary%20236-50501-7-8.zip?fid=1000262104&ttl=1535832258&ri=8192&rs=8192&setec=347d4a65706186c7b53e379c47999203"
    },
    {
      "fileId": "1000266088",
      "name": "Grim and Somber Malacath ENB 319",
      "version": "7.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18066",
      "fileName": "Grim and Somber Malacath ENB 319-50501-7-8.zip",
      "uploadedUnix": "1518300795",
      "modVersion": "7.8",
      "virusScanUrl": "https://www.virustotal.com/file/28ad0bb724bf487f38ac9c0c5973e40b82bd55d82f4c41a6e477644523114d37/analysis/1518301025/",
      "changelogHtml": " STATUS 2017-12-16\n<br /><br />- Small update to Jyggalag Classic on binary 236. Fixed SSS settings so more skin detail can be seen (less transparent scars, war paint, tats, freckles, etc.), improved reflection details, eyes slightly brighter, and DOF and sharpening small tweaks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Malacath%20ENB%20319-50501-7-8.zip?fid=1000266088&ttl=1535832259&ri=8192&rs=8192&setec=cdcf04ca470810ba62e8badeb302cb36"
    },
    {
      "fileId": "1000266089",
      "name": "Grim and Somber Malacath ENB 319",
      "version": "7.9",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "18986",
      "fileName": "Grim and Somber Malacath ENB 319-50501-7-9.zip",
      "uploadedUnix": "1518300848",
      "modVersion": "7.9",
      "virusScanUrl": "https://www.virustotal.com/file/d2e00c7a5e1be5ee383522f4a4e29797bc8c319e98dcd5774c3dc2dd4dacbd61/analysis/1518301207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Malacath%20ENB%20319-50501-7-9.zip?fid=1000266089&ttl=1535832260&ri=8192&rs=8192&setec=ad346ea2e98e73c35db97977c4300e6d"
    },
    {
      "fileId": "1000266094",
      "name": "Grim and Somber Malacath ENB 319",
      "version": "7.9.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18096",
      "fileName": "Grim and Somber Malacath ENB 319-50501-7-9-1.zip",
      "uploadedUnix": "1518304479",
      "modVersion": "7.9.1",
      "virusScanUrl": "https://www.virustotal.com/file/8b1cf7886665d977a751d9a4c8f8b74023f30504024f7f4363bbf3c9fa398810/analysis/1518304866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20and%20Somber%20Malacath%20ENB%20319-50501-7-9-1.zip?fid=1000266094&ttl=1535832260&ri=8192&rs=8192&setec=ec8e5240d7c3bcdf9daadf25f9d89148"
    }
  ]
}