{
  "modId": 50511.0,
  "modName": "Placeable Rope Bridges",
  "summary": "Put a rope bridge anywhere. Best used with Frostfall.",
  "descriptionHtml": "***So, first a little disclaimer. Every time I try to add a script to anything, the Creation Kit crashes on me. So these have no scripts attached. If you can add a script to this mod to fine tune the placement of the bridges, please let me know.***\r<br />\r<br />Requires: The latest version of Skyrim\r<br />\r<br />As is, this mod gives you the ability to craft a bridge out of wood and rope that can allow you to cross rivers with ease. I&#39;ve been playing with Frostfall for quite a while now, and frankly I was terrified of rivers, and the painful freezing death that they caused. This should fix that.\r<br />\r<br />Now you may be thinking, why build a bridge when I can use Waterwalking, or Skyre&#39;s Weaken Gravity, or any other spell. I prefer hunter characters that live off the wilds, and I know many of you do as well. This method costs no magicka, and puts that extra emphasis on survivalism. Plus have you seen the trailer for ESO? Best rope bridge ever.\r<br />\r<br />The placement takes some practice. You may have to drop the bridge more than once to get it where you like it, but once you get it right, no river can stand in your way.\r<br />\r<br />Can be crafted at any tanning rack, with 5 Rope Coils (made from leather) and 10 pieces of firewood. The weight reflects the cost and I wouldn&#39;t recommend trying to  carry more than one at a time. It won&#39;t cause crashes, but they&#39;re fairly heavy. They&#39;re bridges after all. \r<br />\r<br />In the future I&#39;d like to make the use a similar placement system to the campfires in Frostfall, but we shall see..",
  "categoryId": "24",
  "version": "v1",
  "author": "CalledFireX",
  "createdUnix": "1391069491",
  "updatedUnix": "1391069462",
  "containsAdultContent": false,
  "uploadedBy": "CalledFireX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094249",
      "name": "Rope Bridges v1",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "88",
      "fileName": "Rope Bridges v1-50511-v1.7z",
      "uploadedUnix": "1391069462",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/da9f7ba50f583a64e52c78157bae8093bb9ca47dd1f920e5a1417c3a744e4b15/analysis/1407909122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rope%20Bridges%20v1-50511-v1.7z?fid=1000094249&ttl=1535832278&ri=8192&rs=8192&setec=6295bba701d4e1e8bd019f208006bbce"
    }
  ]
}