{
  "modId": 50525.0,
  "modName": "Forged in Fire and Ice - Immersive hand placed unique -weapons-armors-apparel - Perfect for Requiem",
  "summary": "Started this project recently to add interesting new artifact- weapons, armors, clothes, rings, amulets and lots of notes around the world of Skyrim. My aim is to increase immersion with those little details that I feel are quite lacking in the main game. ",
  "descriptionHtml": "[PLEASE NOTE THAT THIS PROJECT IS IN ITS EARLY STAGES&#33; \r<br />I uploaded it already unfinished, because I respect tips and feedback of anykind.]\r<br />\r<br />Started this project recently to add interesting new artifact- weapons, armors, clothes, rings, amulets and lots of notes around the world of Skyrim. My aim is to increase immersion with those little details that I feel are quite lacking in the main game. There will be a lot of ancient Nord/human-lore based items, aswell as items from Third Era Vvardenfell and Solstheim. Also adds atmosphere to Dwemer and Chimer part of Skyrim. \r<br />\r<br />100% Lorefriendly. \r<br />Adds feeling of adventure and immersion.\r<br />Handplaced unique items.\r<br />No new textures.\r<br />Compatible with everything, for example doesn&#39;t conflict with Morrowloot or such.\r<br />Optimized to be used with Requiem\r<br />DLCs not required (there will be version for DLCs later)\r<br />\r<br />\r<br />Ask me stuff if interested&#33;\r<br />\r<br />LIST OF FINISHED/BALANCED/TESTED UNIQUE ITEMS SO FAR:\r<br />\r<br />-Atmorans Ward, the Might of Men (very well hidden, powerful heavy armor shield, endgame)\r<br />\r<br />-Ritual Blade of Ristaag ( 1h-sword, easily discovered during main quest, start/middle-game)\r<br />\r<br />-Skaal Executioner (2h-sword, easily discovered during main quest, start/middle-game)\r<br />\r<br />-Skaal Dagger (1h-dagger, easily discovered during main quest, start/middle-game, nasty effect)\r<br /> \r<br />-Wise man Robes of War Magic (Enchanted Robes, easily discovered during main quest, start/middle-game. Introduces player to the ancient Atmoran/Human magic. There were mages in Skyrim during the First Era, in my mind neglected by the core game)\r<br />\r<br />-Iron Helmet of Skojr (enchanted heavy armor helmet,easily discovered during the main quest)\r<br /> \r<br />-Dreamer Gauntlets (very well hidden, belongs to a sort of easter egg story within this mod, related to Sixth House Cult and the Nerevarine Prophecies, interesting stuff)\r<br />\r<br />-Sahqo Toor (easily found during the main quest, Wise man staff, fire damage + magelight that turns red on impact)\r<br />\r<br />Handful of notes in places of significance, following the clues and riddles you will find more loot and more clues. NOTE that there is not yet much to be discovered, but there will be&#33;\r<br />\r<br />\r<br />\r<br />\r<br />All items used at the moment are from the main Skyrim master file, so this mod needs zero additions to work properly. Yet I have ensured that this mod is fully compatible with every other mod that I honestly know of. \r<br />\r<br />It is possible though that in future I will use armors and weapons from Immersive armors and Immersive weapons. Those will be added as a seperate file.\r<br />\r<br />Myself I play Skyrim with Requiem - The Roleplaying Overhaul. These items are balanced in a way, that they work perfectly with both with Requiem and without. I add items Requiem highly in mind and they are subtly placed so that they are obtained just after appropiate challenge. I will be tweaking the balance whenever needed but I place all the items reflecting my own playthrough, so they are nicely balanced but still should be just slightly superior to the common loot in the game.\r<br />\r<br />I have made some quite powerful unique items too. They are well hidden so they are most likely to be found only with the clues I have placed here and there around the world. The clues are mostly notes placed in iconic locations wich are found along the main quest/daedra quests/civil war/ common dungeons and other places very familiar to us all. (Minor spoiler: likely the first formidable uniques and notes can be found rather easily within the Bleak Falls Barrow.) I might also add Morrowind -styled book wich describes the most powerfull hidden items and their rumored whereabouts.\r<br />\r<br />It is bit of a treasure hunt, but more like you were meant to find the specific item just when you found it. I&#39;ll make sure though that finding the most powerful artifacts will be quite challenging to obtain.\r<br />\r<br />I&#39;m a huge Morrowind fan, so if you&#39;re familiar with events that took place around the Nerevarine prophecies, you&#39;ll find bits and stuff from those days of glory. I&#39;m not adding artifacts directly from Morrowind, atleast for now though.\r<br />\r<br />I again highly recommend this to those who play Requiem and I highly recommend Requiem to everyone interested in more hardcore and immersive adventure&#33; This simple mod works great without Requiem also.\r<br />\r<br />This is very early version. I would love to hear comments about anything regarding this mod or anything related to this kind of mod. Please ask questions if youre interested, I will answer them.\r<br />\r<br />INSTALLATION\r<br />\r<br />1. Simply Download with mod manager\r<br />or...\r<br />2. Download manually. It is a .zip file, extract it to Skyrim/Data\r<br />3. Check your Data files from SkyrimLauncher, Forged in Fire and Ice should be active.\r<br />\r<br />You&#39;re good to go&#33;\r<br />\r<br />UNINSTALLATION\r<br />\r<br />You can remove this plugin via your mod manager.\r<br />You can remove this plugin manually from your Skyrim/Data folder. Just delete the esp, its simply a single file.\r<br />\r<br />If you have ideas or wishes, just throw them in the comments section, I WILL be doing requests.\r<br />",
  "categoryId": "36",
  "version": "0.2.31.1",
  "author": "Asketism",
  "createdUnix": "1391126281",
  "updatedUnix": "1391187006",
  "containsAdultContent": false,
  "uploadedBy": "Asketism",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094443",
      "name": "ForgedInFireAndIceMainFile",
      "version": "0.2.31.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "ForgedInFireAndIceMainFile-50525-0-2-31-1.rar",
      "uploadedUnix": "1391187006",
      "modVersion": "0.2.31.1",
      "virusScanUrl": "https://www.virustotal.com/file/0cc25863ffb1d4ae37b2762c0d70b96c9a51b480e8c1b6af7494c91060aafa7c/analysis/1407910865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ForgedInFireAndIceMainFile-50525-0-2-31-1.rar?fid=1000094443&ttl=1535832300&ri=8192&rs=8192&setec=c2384eb797d78d35f39633be4f449660"
    }
  ]
}