{
  "modId": 50538.0,
  "modName": "The Oblivion Falcon - A Lore-Friendly Star Wars Crossover",
  "summary": "Inspired by Silof&#39;s amazing action figure re-imaginings of Star Wars characters, this mod re-imagines Star Wars characters and themes as they might appear in Elder Scrolls lore. Includes quests, followers, a seaworthy player home, and much more.",
  "descriptionHtml": "[color=yellow][b] finally got some footage of the features&#33; WAY TOO LATE&#33; But now you can see the fun stuff I made as quest rewards for this mod, whether you care about the Star Wars content or not...\r<br />\r<br />[youtube]2-b2yzjAD8A[/youtube]\r<br />\r<br />\r<br />Many thanks to George from Zero Period Productions for this playthrough of the mod&#33;[/b] Note: The lightsabers in the videos below are from a different mod.[/color]\r<br />\r<br />[youtube]GviMtQTPI2U[/youtube]\r<br />\r<br />\r<br />[color=#ffff00][b]As well as BuckaD for another playthrough&#33;[/b] Note: Once again, the lightsabers in the videos below are from a different mod.\r<br />\r<br />[/color]\r<br />[b][youtube]WGyF6TaHiPc[/youtube]I[/b]\r<br />\r<br />[b]The Oblivion Falcon: A Lore-Friendly Star Wars Crossover[/b]\r<br />\r<br />[i]Inspired by Silof&#39;s amazing action figure re-imaginings of Star Wars characters, this mod re-imagines Star Wars characters and themes as they might appear in Elder Scrolls lore. Includes quests, followers, a seaworthy player home, and much more.[/i]\r<br />\r<br />[color=yellow]There&#39;s word of a ship on the shores of Lake Ilinalta... a ship too large to have made its way so far inland by any [i]natural[/i] means. Rumor has it, it appeared out of nowhere; a strange ship, jutting all over with steam pipes and gleaming figureheads the likes of which no one has seen in a thousand years. Some say it&#39;s crewed by noble pirates, others say resistance fighters (or heretics and traitors, depending who you hear it from). What nobody can explain is just how it could be, that it was spotted in Stros M&#39;Kai one day, and Falkreath the next...\r<br />\r<br />That&#39;s up to you, the adventurer, to find out.[/color]\r<br />\r<br />============================================================================\r<br />\r<br />[color=yellow][b]SPOILER-FREE SUMMARY[/b][/color]\r<br />This mod adds an interesting new kind of location, six new followers, a player home, and some fun quest rewards including a summonable healer, tossable bombs, spring-loaded gauntlets, a grappling bow, and more. The main quest starts in Falkreath, on the shore of Lake Ilinalta near the necromancer&#39;s altar (down the hill from Lakeview Manor). It&#39;s recommended for level 8 and above, and has two alternate possible outcomes. I recommend playing through both ways&#33;\r<br />\r<br />All potential followers are geared up with decent enchanted gear which they can actually benefit from (Muffle, Health & Stamina boosts, etc). If they don&#39;t have a certain piece in their outfit, such as headgear or gauntlets, that is typically factored into their overall armor rating so as not to compromise their costumes.\r<br />\r<br />Requires Dawnguard, Hearthfire, and Dragonborn.\r<br />\r<br />[color=yellow][b]COMPATIBILITY (MINOR SPOILERS)[/b][/color]\r<br />All in all, this mod affects five small regions:\r<br />- The shore of Lake Ilinalta in Falkreath, near the necromancer&#39;s altar.\r<br />- The waterfall behind Geirmund&#39;s Hall, next to Nilheim.\r<br />- The docks of Riften.\r<br />- The southeast part of the Solitude docks.\r<br />- Northshore Landing in Solstheim.\r<br />\r<br />Any mod which affects these regions could cause compatibility issues. It also affects the AI of the Dwemer pets from Kagrumez. Any overhauls which modify existing game objects (such as followers) will not apply to anything added by this mod (though such overhauls shouldn&#39;t pose any compatibility issues). Accessing Solstheim through this mod instead of the vanilla entrance will probably cause game-breaking issues, so be sure to complete the Dragonborn introductory quests first.\r<br />\r<br />[color=yellow][b]KNOWN BUGS[/b][/color]\r<br />- Be sure to save and reload (this allows new dialogue to show up).\r<br />- Issues unequipping Khajiit Wrist-Coils; must unequip twice.\r<br />- Bound Sabers may disappear from NPCs, can be added back using the console. Add the appropriate weapon reference, not the spell reference.\r<br />\r<br />============================================================================\r<br />\r<br />[b]SPOILERS BELOW&#33;[/b]\r<br />\r<br />============================================================================\r<br />\r<br />[color=yellow][b]The [i]Oblivion Falcon[/i][/b][/color]\r<br />With its fusion of new and ancient technologies, the [i]Oblivion Falcon[/i] is a marvel. It&#39;s been refitted and tweaked over the years, but the one thing that sets it apart from the rest of the ships on the sea is a well-kept secret of the Dwemer: the Aetherdrive. It was designed to transport its passengers through the infinite Aether itself and back into Tamriel, as if in an instant. It was never heavily used by the Dwemer, a largely landlocked culture, and no one knows precisely how it came to be implemented, but some say engineers of the Almderi Dominion first put it to use at sea, and that anyone who sees these magic ships of the Thalmor doesn&#39;t live to tell about it. The captain of the [i]Oblivion Falcon[/i] had a deep enough knowledge of the black market to acquire a set of plans for himself, and that&#39;s how the old ship became what it is today.\r<br />\r<br />[i]To use the Aetherdrive, complete the first task of the quest by retrieving the Aether Navigation Codex from Riften. Go below deck, choose a destination, and place the codex in the proper receptacle. The &#34;Engage&#34; button will become active. Press it, and in an instant, you&#39;re at your destination. Any crew above deck will automatically be sent inside for transport (anyone else on deck, such as your horse, will remain at their old location). To choose a new destination, first retrieve the codex from its current receptacle.[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The Captain: Hans the Low[/b][/color]\r<br />Hans began his life as a street urchin in Cyrodiil, picking pockets and learning con tricks before joining a pirate crew. He eventually left pirate life for the Imperial Legion, but that didn&#39;t last either; he was stationed in Bravil, guarding the allied East Empire Company&#39;s docks, when one day he spotted a mighty Khajiit kept in a cage. His buried honor moved him to do the right thing, so he threw the captain overboard and released the Khajiit, who introduced himself as Jubaa’kha. The Khajiit pledged his life as a companion to Hans, and they fled for the rogue port of Stros M’Kai. There, Hans made contact with Landon Kal-Razelan, and old swashbuckler friend, and in seeking to obtain a ship and become a freelancer, Hans convinced Kal-Razelan to wager his own freighter, the [i]Oblivion Falcon.[/i] Hans claims to have won the bet fair and square, but when nobody believed him, he earned the name “Hans the Low.” Nevertheless, he took to the sea, making new Khajiit business partners through Jubaa’kha, moving moon sugar and other illicit goods from port to port. He&#39;s a wanted man for his many thefts from the East Empire Company, but after assisting his new friends in the Resistance against the Thalmor, the bounty is ten times what it once was.\r<br />\r<br />[i]Hans the Low uses a Nordic mace and bow. His personal quest requires that you make a choice, so it&#39;s recommended that you save before embarking on it. Completing his quest will earn you access to his personal chest, which includes an unenchanted set of his light armor (skinned only for males, uses Advanced Armors perk) as well as a new Grappling Bow and Grappling Spikes. To use the Grappling Bow, fire at an enemy as usual. If your arrow hits a valid target, you&#39;ll then have thirty seconds to bash with the bow. When you bash, the target will be pulled to the ground (or off a ledge) in your direction. To use Grappling Spikes, fire at a platform or a spot on the landscape. When you bash with your bow, you&#39;ll be pulled to that spot. This can cause clipping issues, so be careful. Note: the bow and spikes work equally well together or paired with different arrows/bows (though using them together can have unpredictable results). Spikes can be crafted at a forge.[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The First Mate: Jubaa&#39;kha[/b][/color]\r<br />Jubaa’kha is a strong, quiet Khajiit who once made his living as a tracker and big game hunter on the borders of Valenwood and Elsweyr. Some years ago, he was hired as a guide by a group of men who claimed to be East Empire Company traders. Deep in the jungle, however, they revealed themselves to be privateer slavers, and they saw his brute strength as a valuable commodity. On a stopover in Bravil, a young Imperial legionnaire named Hans spotted him aboard the East Empire ship and was moved to free him, even though it meant abandoning his post and killing the legion-allied guards. Jubaa’kha pledged his life to Hans, and they made for Stros M’Kai to start their careers as fugitive sailors. Once they had obtained their old freighter, Jubaa’kha (dubbed “Jubie” by Hans) introduced his new partner to Khajiit merchants all along the coasts of Tamriel. They soon accrued renown as smugglers, moving refined moon sugar, skooma, and various stolen valuables from port to port. When Hans began fitting the [i]Oblivion Falcon[/i] with the first components of the Aetherdrive, Jubaa’kha entered a new world as he began to learn principles of engineering—something entirely foreign to his people.\r<br />\r<br />[i]Jubaa&#39;kha uses a trusty crossbow and prefers his fists when enemies get close, though he can also wield a two-handed weapon proficiently. Completing his quest will earn you access to his personal chest, which includes an unenchanted set of his heavy armor (uses Steel Smithing perk), as well as new Khajiit Shield-Gauntlets and Wrist-Coils. The Shield-Gauntlets may be used independently, and occupy both the hand and shield equipment slots (and have the combined armor value), allowing the wearer to block with the gauntlets themselves. Bash attacks have an added spring-loaded impact which knocks the enemy down. The Wrist-Coils are a weapon which requires that the Shield-Gauntlets be worn (and equips them automatically, even if you aren&#39;t currently carrying any). Power attacks with the Wrist-Coils feature the same spring-loaded knockdown effect as the Shield-Gauntlets, and though they appear to be hand-to-hand enhancements, they actually utilize the Two-Handed skill. These rewards are a bit overpowered, but incredibly fun to use. Bug: To unequip, menu must be opened twice.[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The Princess: Leila Orianna[/b][/color]\r<br />Princess Leila is a long way from High Rock. She was orphaned at a young age and raised by the current royal family of Daggerfall, House Orianna, who had no natural daughter of their own. Leila has no interest in typical Breton power struggles, but instead uses her position for a higher cause: to make sympathetic contacts all over Tamriel, seeking out others who want to see the Thalmor removed from power. On the voyage home after a secret meeting with the Hammerfell resistance, the Thalmor finally called Princess Leila’s diplomatic bluff. She was abducted and taken aboard a Thalmor battleship, but fortunately, she was able to send a call for help to an old family acquaintance once associated with the Greybeards, Master Oberon Kinnoble. Before the Thalmor were able to extract the names of her allies, Master Kinnoble arrived aboard the Oblivion Falcon and gave his life so that she and the rest of the crew could escape. She’s found a strange kinship with the young student of the Voice, Lukas Snow-Walker, and though at first she despised Captain Hans, recent adversity seems to be forging an unlikely romance between them.\r<br />\r<br />[i]Princess Leila uses two Elven daggers. Completing her quest will earn you access to her personal chest, which includes an unenchanted set of her clothing (skinned for females only), as well as new Resistance Bombs and Signal Scrolls. Resistance Bombs work like exploding spiders from Dragonborn, but include Fire Bombs, Paralytic Bombs, and Frenzy Bombs. They can be crafted at a forge with empty bottles, fire salts, and other ingredients. Signal Scrolls are quite powerful. Outdoors, a Signal Artillery scroll will call for a devastating catapult attack from hidden guerrilla forces at the targeted location. A Signal Marksmen scroll will call for hidden archers to assault the targeted NPC. If your signal misses, you will be given a replacement scroll automatically, however, a Signal Marksmen scroll will not work under a low ceiling or in a very narrow area, and you will not receive a replacement under these circumstances. For more scrolls, speak to Princess Leila; as long as you&#39;re not carrying one, she&#39;ll give you a document which you can send (along with 1000 gold) by placing it in the box in her bunk and pressing the button.[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The Student: Lukas Snow-Walker[/b][/color]\r<br />Lukas was born in dull Rorikstead, a farm boy who spent years itching for adventure. He never knew his real parents, having been adopted by his aunt and uncle, but one day he received a strange message. Two strange Dwemer animunculi wandered through town bearing a note from a woman who seemed to be in trouble, and it was addressed to one Oberon Kinnoble. He knew the name only as Old Man Kinnoble, a hermit from the eastern Reach who occasionally came to the inn for supplies. He took the Dwemer machines with him and found the hermit, who revealed himself to be a master of the Greybeards who had left High Hrothgar to commune with the land. The meeting lead Lukas to join the old man on a hired ship, undertaking training with him during a journey to rescue a Princess. Though Master Kinnoble gave his life to aid their escape, Lukas still feels Master Kinnoble&#39;s guidance. He used his new knowledge of the Voice while fighting in the trenches of Hammerfell alongside the resistance against the Thalmor, scoring their first great victory against the Altmer oppressors. Now he&#39;s stuck between two lives--that of a soldier, and that of a monk--but his aura of fate will surely make an impression upon Tamriel.\r<br />\r<br />[i]Lukas uses minor Shouts (including Disarm and Elemental Fury), as well as a unique Bound Saber. Bug: His Bound Saber can sometimes disappear, but can be re-added through the console. If so, use the weapon, not the spell. Completing his quest will earn you access to his personal chest, which includes an unenchanted set of his light armor (uses Advanced Armors perk), variations on Oberon Kinnoble&#39;s robes (which fortify both the Conjuration and One-Handed skills), the Bound Saber spell tome (a slightly stronger blue variant of Bound Sword), and the Summon Oberon Kinnoble spell tome (see below).[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The Master: Oberon Kinnoble[/b][/color]\r<br />Oberon Kinnoble was once a Greybeard Master, and master to a young Nord named Anekken Snow-Walker. However, in a bid for power, his apprentice turned on him and supported the Thalmor seizure of dominion of Tamriel. Master Kinnoble&#39;s way of life came under fire, and he took to the wilderness to commune with the land and ponder his course of action, no longer governed by the indifferent Greybeards of High Hrothgar. Eventually, a call to arms came when the son of Anekken Snow-Walker, a boy named Lukas, came to him with a message. A daughter of the Resistance was in danger, and he took it as an opportunity to train a new apprentice. He aided the rescue of the Princess, but gave his life in battle against his old pupil to help them escape. Now in spirit form, he continues to aid and inspire our heroes.\r<br />\r<br />[i]When summoned, Oberon Kinnoble will attempt to heal you and cast leveled Rally spells on your allies for 30 seconds. He can also serve as a natural diversion for enemies.[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The Baron: Landon Kal-Razelan[/b][/color]\r<br />An old gambler and swashbuckler friend of Captain Hans and Jubaa&#39;kha, Landon is as smooth as it gets. He left his scoundrel&#39;s life behind (mostly, anyway) to become a foreman of a mine on Stros M&#39;Kai. It wasn&#39;t long before he struck Malachite and hit it rich. Now, as he scours southeastern Skyrim for new prospects, his aim seems true, but one can never be too sure when money is involved.\r<br />\r<br />[i]Landon uses a scimitar and shield in combat. After talking to him, he will become available as a follower, and you will gain the Baron&#39;s Charm power. Usable once per day for five minutes, you will receive improved prices as well as the Merchant, Fence, and Bribery perks. His inventory also includes unenchanted versions of his light armor (uses Advanced Armors perk).[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The Bounty Hunter: Borba Zhett[/b][/color]\r<br />No one knows much about the Orc they call Borba Zhett, but going by his armor, one thing is for sure: He&#39;s ex-Dawnguard. What a vampire hunter has to do to get kicked out of such a crew, nobody knows, but it probably wasn&#39;t a pretty sight. Now he sells his services to the highest bidder, and that often includes the Thalmor. He rides a fast, strong steed named Firespray, and he has a long-standing bone to pick with Hans the Low and Jubaa&#39;kha. With bounties on their heads from multiple sources across Tamriel, you can be certain they&#39;ll run into him sooner or later.\r<br />\r<br />[i]Borba Zhett uses a custom greatsword and bow of Dwarven quality. Spoiler&#33; In the course of Hans&#39; quest, it is possible to side with Borba Zhett and take over the Falcon. If you speak to him and tell him you want to side with him, you have the chance to change your mind, but only BEFORE you enter the Oblivion Falcon with him. Once you&#39;re inside, there&#39;s no turning back. Joining Zhett will result in one more small quest which you&#39;ll surely find quite fun. Either way, you&#39;ll get his horse and both heavy and light versions of his armor (Orcish and Glass perks, respectively), as well as Flamethrower Gauntlets. When equipped, they enable a flames spell that uses Stamina instead of Magicka. The spell may be upgraded at a forge with fire salts, but any armor improvements to the gauntlets will be lost.[/i]\r<br />\r<br />\r<br />\r<br />[color=yellow][b]The Villain: The Dark Invader[/b][/color]\r<br />Once a Nord named Anekken Snow-Walker, the Dark Invader is now a weapon of the Thalmor. Trained in the Way of the Voice, he betrayed his master gave himself to the Aldmeri Dominion. Now he seeks to make his power more absolute, but he also has a secret quest, more personal: to locate his lost son and daughter, roaming the continent as members of the Resistance. He seeks to corrupt his son the way he was corrupted.\r<br />\r<br />[i]Spoilers&#33; The final encounter (if you side against Borba Zhett) is quite difficult, but if you can&#39;t handle it, it should be manageable at lower difficulty. There is a trick to it which I won&#39;t reveal here, but I believe you&#39;ll find to be quite fun. Killing the Dark Invader will give you access to sets of his armor, as well as a new set of robes and two alternate Bound Saber spells (each slightly stronger than the last).[/i]\r<br />\r<br />\r<br />[color=yellow][b]Final Note:[/b][/color] After completing either questline, it will be possible to add a player home and observation deck to the Oblivion Falcon. With 1000 gold for the bunk in your pocket (plus 1500 for the observation deck), simply ask your chosen captain about building it. Your spouse will not be able to move in directly after the wedding, but using the &#34;I&#39;d like to move&#34; dialogue should work.",
  "categoryId": "35",
  "version": "1.0",
  "author": "rcavanah",
  "createdUnix": "1391128297",
  "updatedUnix": "1391128273",
  "containsAdultContent": false,
  "uploadedBy": "rcavanah",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094370",
      "name": "The Oblivion Falcon",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38266",
      "fileName": "The Oblivion Falcon-50538-1-0.zip",
      "uploadedUnix": "1391128273",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/15c5f160bdc9cbc5196ed50c54d978aff5e4c1f903ca4e3f4dd52fd542406e1c/analysis/1407910090/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Oblivion%20Falcon-50538-1-0.zip?fid=1000094370&ttl=1535832323&ri=8192&rs=8192&setec=52b58b22cc1a3f12d3f73c0472382a44"
    }
  ]
}