{
  "modId": 50554.0,
  "modName": "Infusion Overhaul",
  "summary": "Infuse your older weapons with better materials to make them as strong as the infused material but they will retain the same look.",
  "descriptionHtml": "UPDATE: My laptop has been Repaired completely. So expect regular updates very soon.\r<br />\r<br />Okay i&#39;m starting with the credits first. I want to thank [url=http://forums.nexusmods.com/index.php?/user/771437-darkangel13/]Darkangel13[/url] for showing me how to do this. And thanks to him for his awesome [url=[urlhttp://www.nexusmods.com/skyrim/mods/7590/?]D13 leveled items upgrade[/url] mod for inspiring this idea. \r<br />\r<br />After 6 hours of playing with his mod i got to thinking about normal weapons being upgradable. So after 1 conversation 13 straight hours of solo work and 2 12 packs of mountain dew later my mod was born.\r<br />\r<br />My mod is completely standalone and requires only the game Skyrim to work. And it works like this.\r<br />\r<br />After days of playing Skyrim you finally unlock that smithing perk you worked hard to get say orcish or dwarven. And you love the way it plays. Its damage speed and looks are amazing for now. But you later unlock a better tier such as glass or ebony. And that dwarven gear becomes clutter and essentially useless. Not anymore.\r<br />\r<br />With my mod all you need is an upgrade token and the right perk i.e: ebony smithing and you can use your master skills as a blacksmith to infuse your older gear with better materials to make it stronger then before. Want an elven sword with glass stats no problem. Want an iron sword of daedric badassery GO RIGHT AHEAD. Never loose your best looking weapon cause of low level stats again.\r<br />\r<br />Currently supported weapon tiers are as follows. Iron, Steel, Orcish, Dwarven, Elven, Glass, And Ebony. \r<br />\r<br />current heavy armors that are complete are iron, steel, and dwarven.\r<br />\r<br />Essentially you can upgrade your weapons to any tier as long as you have the right materials and the upgrade token. Which is found inside the misc section of the smithing forges. To make things Balanced a little more lore-friendly and a little harder to accomplish the token costs 50 septims to make and it is consumed upon use.that price may change upon newer updates or depending on user votes for a fixed number.\r<br />\r<br />[color=skyblue]Soon to come[/color] are gonna be all armor and Weapon tiers from the core game files and all DLC content. When i get someone else to help me with them. If you wanna help shoot me a pm asking for a tier assignment.\r<br />\r<br />UPDATE: Iron armor And dwarven armor have both been added to the infusion list. orcish will come sometime today.",
  "categoryId": "79",
  "version": "1.4",
  "author": "gierheart",
  "createdUnix": "1391185993",
  "updatedUnix": "1391451012",
  "containsAdultContent": false,
  "uploadedBy": "gierheart",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094436",
      "name": "Infusion Overhaul",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12",
      "fileName": "Infusion Overhaul-50554-1-0.rar",
      "uploadedUnix": "1391185228",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dd5845086cc29667da87867e494ee09dffc58262fc4e49ef491cf25e24a0d6cb/analysis/1407910831/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Infusion%20Overhaul-50554-1-0.rar?fid=1000094436&ttl=1535832343&ri=8192&rs=8192&setec=c39f88e65f0e1ceb52f6d237211c4974"
    },
    {
      "fileId": "1000095087",
      "name": "Infusion overhaul",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Infusion overhaul-50554-1-4.rar",
      "uploadedUnix": "1391451012",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/b078b6d69a4b81bde4c51cc67b0db4f707fffe5b4e3bb9326c558abba4fa0109/analysis/1407916744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Infusion%20overhaul-50554-1-4.rar?fid=1000095087&ttl=1535832344&ri=8192&rs=8192&setec=e8922b2352d36d9f6572343e0522fed4"
    }
  ]
}