{
  "modId": 50564.0,
  "modName": "vwr Acrobat",
  "summary": "This mod aims to make Skyrim more exciting by adding a few acrobatic features, expanding the control of your character.",
  "descriptionHtml": "[center][img]http://static-2.nexusmods.com/15/mods/110/images/50564-1-1391201159.png[/img][/center]\r<br />\r<br /> [youtube]H-bmMs3Q9xA[/youtube]\r<br />\r<br />After many attempts, I&#39;ve come up with a way to allow Sprint-Jumping with minimal lag. I&#39;ve also Incorporated the functionality of a mod that gives you a, in-place boosted jump, when you want it. This mod includes an MCM menu which allows you to configure many options, including a configurable &#39;sneak camera&#39;, which changes the position of the camera while the player is sneaking. I realize other mods do this, but for me they never worked properly so I decided to integrate it as an optional feature.\r<br />\r<br />[size=6]Requirements:[/size]\r<br />Skyrim V1.9.32.0 and above\r<br />SKSE\r<br />SkyUI\r<br />\r<br />[size=6]Install:[/size]\r<br />Just copy the files to your data folder. Then activate the mod in your launcher or NMM.\r<br />\r<br />*****************************************************************************************************************************\r<br />*****************************************************************************************************************************\r<br />\r<br />[size=6]Usage:[/size]\r<br />When you load this mod, first check your MCM menu. There should be a new menu called &#34;Acrobat&#34;. If this menu is not present, save your game, then load it and wait a few minutes. SKYUI should pop up a notification saying that a new MCM menu has been registered. Open the Acrobat menu to adjust settings and toggle features on and off.\r<br />\r<br />[size=6]Sprint Jump:[/size]\r<br />To Sprint Jump, you should first go to the Acrobat MCM menu and make sure your buttons are configured to your controls. Once you&#39;ve done so, simply sprint, then hold the jump button. Your character will jump when you LET GO of the jump button. There is a minimum time you have to hold the jump button down, but it&#39;s different for every Skyrim installation, depending on your PC specs and mods.\r<br />\r<br />[size=6]Boosted Jump:[/size]\r<br />This feature will, when active, give you a Boosted Jump, when you sprint-jump. This allows you to sprint-jump over some city walls, and secretly enter bandit camps. Take your enemy by surprise&#33; It&#39;s very useful when running from Giants and other large beasties.\r<br />\r<br />[size=6]Cat Jump:[/size]\r<br />The Cat Jump is a feature which allows you to get a boosted jump, while standing in place. To use this, your character must be sneaking first. When you un-sneak, or stand up, then press the jump button, you will get a boosted jump. Keep in mind, you only have a certain amount of time to press the jump button if you want a boosted jump. This is useful for hopping over walls, jumping up mountains, and even stabbing dragons right out of the sky.\r<br />\r<br />[size=6]Sneak Camera:[/size]\r<br />This simply re-positions the camera while your character is sneaking. I made it for the &#39;sneak-crawl&#39; animation, but you can turn it off in the MCM menu if you have no use for it.\r<br />\r<br />[size=8]Enjoy&#33;[/size]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/50564-1-1391201093.gif[/img][/center]\r<br />",
  "categoryId": "24",
  "version": "1.0",
  "author": "vwr",
  "createdUnix": "1391201969",
  "updatedUnix": "1391201713",
  "containsAdultContent": false,
  "uploadedBy": "vinniewryan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094481",
      "name": "vwr Acrobat",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "vwr Acrobat-50564-1-0.zip",
      "uploadedUnix": "1391201713",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1e5d4e43ea895c0192dedea1ec2a71c5adab396fe7788206bf6a8e26b414e0f/analysis/1407911226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/vwr%20Acrobat-50564-1-0.zip?fid=1000094481&ttl=1535832357&ri=8192&rs=8192&setec=289327a5e84d40d2c133ca989a5d9a1d"
    }
  ]
}