{
  "modId": 5057.0,
  "modName": "Rama_s Perfect Female Skin Skyrim Mod",
  "summary": "This light-weight mod (about 10.5 mb) gives all non-beast females perfect, high resolution rich glowy skin.",
  "descriptionHtml": "Rama\\'s Perfect Skin Mod\r\n\r\nThis is a very light-weight mod, of 3 files only, compressed as about 10.5 MB\r\n\r\nBut it gives all the non-beast female bodies perfect skin!\r\n\r\nI can\\'t live without this mod, now that I have it :)\r\n\r\nAll the girls\\' skin looks so clear and vibrant and happy now :)\r\n\r\n---\r\n\r\nAdding Pics of Your Own\r\n\r\nIf anyone wants to add pics of their female characters using my perfect skin mod,\r\n\r\nyou can click the two-rectangle icon below the version number near top of this page.\r\n\r\nI will verify your pics post-inspection which may take awhile depending on my schedule.\r\n\r\n==========\r\nMod Details\r\n==========\r\n\r\nInnocent Pure Beauty\r\n\r\nThis mod does not impose any of my artistic ideas about how MUCH skin the women of skyrim should be revealing.\r\n\r\nThis mod simply makes the skin that is exposed more beautiful, clear, vibrant, and young.\r\n\r\nI honor all women.\r\n\r\nThis mod is simply to make Skyrim women younger and prettier, with more vibrant skin tone.\r\n\r\n---\r\n\r\nNote on the Pictures for this Mod: \r\n\r\nColor and Hue and Brightness Settings\r\n\r\nI play Skyrim with an ultra high level of color saturation and brightness because I like the \\\"fantasy\\\" look, as if I was in a world of brilliant happy colors where everything is alive and vibrant.\r\n\r\nI found the default color settings for Skyrim to be de-saturated, so I went completely the other way.\r\n\r\nAs a result, my sense of how a Skyrim scene looks to those of you not using similar high brightness and saturation is skewed. I literally don\\'t know how the scene \\\"should\\\" look for all of you.\r\n\r\nSo if you think my pictures are oddly bright or parts of the world have unusual color intensity, those are just my own personal settings and do not affect the mod or your own personal experience with my mod.\r\n\r\n* * *\r\n\r\nSo please try my mod for yourself to see how it will look on your computer with your settings.\r\n\r\nI cannot show you pictures that will give you a completely accurate representation of how it will look on your machine.\r\n\r\nFortunately, this mod is easy to undo if you don\\'t like it.\r\n\r\nThis mod does not damage or alter any original installation files\r\n\r\n* * *\r\n\r\nGive It a Try\r\n\r\nTry this mod out before deciding how good it is based on the low-res pictures I have uploaded which you cannot even view in their entire size easily.\r\n\r\n* * *\r\n\r\nThis is the sort of mod you need to see in-motion, live, in-game!\r\n\r\n* * *\r\n\r\nWhen you see your girl in motion, \r\n\r\nrunning around blowing stuff up and looking like a Hot Goddess the whole time, you will understand why I cannot live without my mod.\r\n\r\n\r\nMy enjoyment of Skyrim went to a whole new level once I made my mod.\r\n\r\n---\r\n\r\nTo Install\r\n\r\nCopy the zipped folder series, starting with \\\"Data\\\" into the _same directory as your TESV.exe file_, probably under \r\n\r\nc:\\\\program files(x86)/steam/steamapps/common/skyrim/\r\n\r\nTo get to the location I am describing, start by going to your computer\\'s main hard drive, probably C:\\\\ using My Computer, then click on the hard drive, then go to program files and follow the above path.\r\n\r\nThere might already be a Data folder in your main Skyrim directory, if you have any other mods. \r\n\r\nWhen copying the file structure for this mod, starting with Data, select the option to overwrite any duplicate files, assuming you don\\'t have any other female skin mods installed.\r\n\r\nRemember there are only three files in all these folders in the zipped download, so selecting \\\"overwrite any duplicates\\\" will only effect a maximum of 3 files.\r\n\r\n\r\nSorry for the lack of nexus download manager support at present, you should learn to do these things directly though, it will become more important to be intimately familiar with your Skyrim file structure once the Creation Kit comes out.\r\n\r\nYou need to know how modding works yourself so you can undo anything other people\\'s mods do to your skyrim file structure, because they won\\'t always tell you how to undo the damage.\r\n\r\n---\r\n\r\nHow Modding Works\r\n\r\n* * *\r\n\r\nThis is essential information for you to know so that you are in charge of your Skyrim Reality. \r\n\r\n* * *\r\n\r\n\r\nOur friends at Bethesda were so nice to make modding so easy.\r\n\r\nBasically, any files you put into a folder called Data, in your root Skyrim folder where \\\"TESV.exe\\\" is located will be preferred by Skyrim when it launches.\r\n\r\nSkyrim dynamically checks the contents of your custom Data folder each time you load Skyrim.\r\n\r\nSo to see changes you\\'ve made to your Data folder you have to quit and re-launch Skyrim.\r\n\r\n\r\nTo undo any mods, you go into the Data file structure and delete the appropriate files.\r\n\r\n\r\nIf you don\\'t have a \\\"Data\\\" folder you can make one.\r\n\r\n\r\nMost likely you do have a Data folder if you\\'ve found this mod of mine :)\r\n\r\n\r\nThe reason mods can have conflicts is because sometimes mods modify the same files in the Data file structure, and Skyrim can only pic one version of that file to use at a time.\r\n\r\n---\r\n\r\nHow to Test a New Mod Easily, Wile Preserving Your Previous Modded Skyrim Settings\r\n\r\nIf you want to test a mod, rename existing files that you do not wish to overwrite permanently, and try the new mod that modifies those same files.\r\n\r\nIf you don\\'t like the new mod you tried, delete the files and rename the originals.\r\n\r\nFor example, if you already have a femalebody_1.dds in your Data/textures/actor/character/female folder structure, you can rename it to femalebody_1.back and then try my mod which has its own version of femalebody_1.dds\r\n\r\n---\r\n\r\nWhat Are .DDS Files?\r\n\r\nTo view/edit .dds files, download PAINT.net, it is free\r\n\r\n---\r\n\r\nHow Can I Access Skyrim\\'s Original Textures, Models/Meshes, and All other Game Data?\r\n\r\nTo extract files from Skyrim\\'s core .bsa files,\r\n\r\ngoogle search for \\\"FO3_Archive_Utility-34.zip\\\"\r\n\r\nor \\\"FO3 archive utility\\\"\r\n\r\nFO3 = FallOut 3\r\n\r\nThis is how you can view the entire file structure of all meshes, textures, and everything else for Skyrim, extract, and play with these files.\r\n\r\nThen move these files to the Data folder as I describe above to try your own mods.\r\n\r\n---\r\n\r\nCompatibility \r\n\r\nThis Mod is compatible with all Armor mesh mods that expose more female Skin.\r\n\r\nThis Mod is not compatible with any mods that modify the default female body skin textures.\r\n\r\n\r\nThis Mod is VERY compatible with Bella\\'s Prettier Female Faces mods and all other female facial mods.\r\n\r\nThis Mod is VERY compatible with all hair mods.\r\n\r\n---\r\n\r\nTo Uninstall\r\n\r\n1. Navigate to your main skyrim dir where TESV.exe is located, probably  c:\\\\program files(x86)/steam/steamapps/common/skyrim/        (no x86 for XP users)\r\n\r\n2. Navigate to Data/Textures/Actors/Character/Female\r\n\r\n3. delete these 3 files:\r\n\r\nfemalebody_1.dds\r\nfemalebody_1_msn.dds\r\nfemalehands_1.dds\r\n\r\n---\r\n\r\nKnown Issue\r\n\r\nThe border between where the hand mesh starts and the end of the arm is located is slightly obvious even in the original skyrim textures, my mod makes this border a little more obvious. \r\n\r\nSince I am always wearing hand gear this doesn\\'t ever show to me during gameplay\r\n\r\n\r\n1st person views of the hands are not affect, hands look younger and happier\r\n\r\n---\r\n\r\nOther Mods Used in the pictures:\r\n\r\nCoolsims Hair Pack\r\n\r\nBella\\'s Prettier Female Faces Mod\r\n\r\n\r\nMany thanks to both of them for enhancing my Skyrim experience!\r\n\r\n---\r\n\r\nVictory to You All!\r\n\r\nRama",
  "categoryId": "29",
  "version": "1.0",
  "author": "Rama",
  "createdUnix": "1325408133",
  "updatedUnix": "1325408862",
  "containsAdultContent": false,
  "uploadedBy": "evernewjoy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15667",
      "name": "Rama_s Perfect Female Skin Mod for Skyrim TESV",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10704",
      "fileName": "Rama_s Perfect Female Skin Mod for Skyrim TESV-5057.zip",
      "uploadedUnix": "1325408862",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/95669ae82a316d4cc2a74c0c9443514aeef7b65a87d1a75f99e7a822fdcf3677/analysis/1406574911/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rama_s%20Perfect%20Female%20Skin%20Mod%20for%20Skyrim%20TESV-5057.zip?fid=15667&ttl=1535761488&ri=8192&rs=8192&setec=445a3421ae9d57b70d4b68263e8afbcd"
    }
  ]
}