{
  "modId": 50647.0,
  "modName": "Compatibility Patch for Requiem and Height Adjusted Races with True Giants",
  "summary": "A small compatibility patch I made for myself for the complete version of Height Adjusted Races with True Giants to go with Requiem.",
  "descriptionHtml": "I love Requiem: The Role-playing Overhaul by Ogerboss. I love the immersion it brings and the difficulty that accompanies it. I also love Height Adjusted Races with True Giants by EvilDeadAsh34 since in my opinion, this mod complements Requiem rather nicely from a visual immersion perspective. But these two were not compatible; you could get the heights right but lost Requiem&#39;s stats or keep the stats and lose the heights. This patch tries to keep the stats and the height respectively from Requiem and HAR. \r<br />\r<br />Requirements:\r<br />Dawnguard\r<br />Dragonborn\r<br />Requiem\r<br />Height Adjusted Races with True Giants (the Complete Version but not the one with small giants)\r<br />\r<br />Installation:\r<br />Just copy the .esp file into the Data folder and then activate it via Skyrim Launcher, NMM or Wrye Bash.\r<br />\r<br />Uninstallation:\r<br />Simply disable the plugin.\r<br />\r<br />Remarks:\r<br />This is something that I have done for the first time. I am not a programmer, not a coder or a designer. I am a buiseness graduate with immense passion for Skyrim and respect for its community. So if I have done something wrong here, please let me know, since I would love to learn.\r<br />",
  "categoryId": "84",
  "version": "1",
  "author": "Noob",
  "createdUnix": "1391329614",
  "updatedUnix": "1391330397",
  "containsAdultContent": false,
  "uploadedBy": "noorida",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094764",
      "name": "Requiem - Height Adjusted Races with True Giants Patch",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55",
      "fileName": "Requiem - Height Adjusted Races with True Giants Patch-50647-1.rar",
      "uploadedUnix": "1391330397",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6c7e62463c170c23dbbfff031ec90489363fcc3000e9c52aefac6fbcfe988db7/analysis/1407913817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Height%20Adjusted%20Races%20with%20True%20Giants%20Patch-50647-1.rar?fid=1000094764&ttl=1535832479&ri=8192&rs=8192&setec=982feeb7fad8541800329937d0b364b6"
    }
  ]
}