{
  "modId": 50641.0,
  "modName": "copy and paste wharehouse cell",
  "summary": "Cell with cluttered items for copying into a house to save time cluttering it.",
  "descriptionHtml": "I copied a considerable amount of furniture from a few mods I have made and pasted them into 1 cell for quickly cluttering a new mod. cell is nearly maxed out for memory.\r<br />\r<br />Contains bookshelves, tables, wall shelves, hanging racks of rabbits and ducks, just about anything you would expect in a house.\r<br />\r<br />There is also a small collection of crates, barrels, and haybales and other misc items. Good for outdoors, under stairs, in a basement. Pain in the butt stacking the crates because they are setup incorrectly by Bethesda so a big time saver just grabbing a stack already made and pasting.\r<br />\r<br />The weapon racks and other items from that small room in wharehouseprefabs has been added to the cell and split up for quicker and easier copying. If you want a wall weapon rack you can just copy it without anything else being copied with it like the rack below it.\r<br />\r<br />Semi-requires all 3 DLC but you can use tes5edit to remove the dependancy and what was used from the DLC will be removed. Like baked goods from Hearthfires will be an empty plate on the table after. So if you are making a mod that doesnt require one of the DLC&#39;s be sure to remove the dependancy first otherwise you will get it in your mod.\r<br />\r<br />Some items like soulgems and baked potatoes have issues with being copied and will revert to the default position so always verify things are placed and rotated nicely otherwise they will be all over the cell when you enter.\r<br />\r<br />Hope this helps you save some time decorating.\r<br />\r<br />Used in:\r<br />[url= http://www.nexusmods.com/skyrim/mods/42258 ] The Warmstone of Windhelm by sa547 [/url]\r<br />[url= http://www.nexusmods.com/skyrim/mods/52254 ] The Lucky Skeever of Solitude by sa547 [/url]\r<br />[url= http://www.nexusmods.com/skyrim/mods/58568 ] Solitude - The Tower of the Wolf by sa547 [/url]",
  "categoryId": "82",
  "version": "1",
  "author": "jet4571",
  "createdUnix": "1391315293",
  "updatedUnix": "1391315286",
  "containsAdultContent": false,
  "uploadedBy": "jet4571",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000094739",
      "name": "Copy and paste wharehouse cell",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "102",
      "fileName": "Copy and paste wharehouse cell-50641-1.zip",
      "uploadedUnix": "1391315286",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5bbb08d25ec82fbdd75f67c29c6b5865759932f388cdf407fd9ffcee61257752/analysis/1407913563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Copy%20and%20paste%20wharehouse%20cell-50641-1.zip?fid=1000094739&ttl=1535832472&ri=8192&rs=8192&setec=7e4cca39d54a63eb82d9c441126040d3"
    }
  ]
}