{
  "modId": 50700.0,
  "modName": "Elenwen ECE-based Unique Beautification - probably",
  "summary": "A lore-friendly beautification for Elenwen the Thalmor Ambassador. Requires ECE, The Eyes of Beauty, Brows. This is the first time I make ECE beautification mod and I don&#39;t know will this work for everyone.",
  "descriptionHtml": "*****I&#39;m gathering talents to make a massive New Lands/Quests mod called DOMINION, which is about the war between Skyrim and the Aldmeri Dominion, and the dark sides of humanity. \r<br />Details are in here: http://forums.nexusmods.com/index.php?/topic/1279053-the-elder-scrolls-v-dominion-recruiting-talents/\r<br />Urgently urgently SUPER URGENTLY need Trailer Maker, Voice Actresses, CK Workers, Scripters and 3D Modellers&#33;&#33;&#33;*****\r<br />\r<br />\r<br />Mod Description:\r<br />\r<br />A small and lore-friendly face beautification for Elenwen.\r<br />\r<br />This is the first time I make ECE beautification mod and I don&#39;t know will this work for everyone, since the mechanism of ECE is kinda...... different with that of vanilla Skyrim character making.\r<br />\r<br />If it cannot work, please tell me, and I will hide the page as soon as possible, or show the data of the new Elenwen face so you can make beautification mods yourselves. I might also make a tutorial to teach you how to import ECE face to CK and make a ECE-based beautification - if anyone wants.\r<br />\r<br />\r<br />Requirements:\r<br />Skyrim 1.9.32\r<br />ECE (http://www.nexusmods.com/skyrim/mods/12951/?)\r<br />The Eyes of Beauty (http://www.nexusmods.com/skyrim/mods/13722/?)\r<br />Brows (http://www.nexusmods.com/skyrim/mods/30411/?)\r<br />\r<br />Credits\r<br />Elenwen Beautification by Anbeegod\r<br />The Eyes Of Beauty by Gabriel Mailhot\r<br />Enhanced Character Edit by ECE team\r<br />Brows by Hvergelmir\r<br />SG Female Textures Renewal by Hello Santa\r<br />Coverwomen by mrLenski\r<br />Elenwen by Bethesda\r<br />Thalmor by Bethesda\r<br />High Elf by Bethesda\r<br />Skyrim by Bethesda\r<br />Tamriel by Bethesda\r<br />Thalmor Embassy by Bethesda\r<br />Aldmeri Dominion by Bethesda \r<br />\r<br />\r<br />FAQs:\r<br />\r<br />Q: Why Elenwen?\r<br />A: Because she is Elenwen. Yes, this is the reason.\r<br />\r<br />Q: Hey you can see her for at most only twice, is that necessary to make a mod for her?\r<br />A: Hey The Elder Scrolls 6 will finally be released, is that necessary to mod Skyrim? By the way, you can see her for at most 5 times (or more...... if you&#39;re crazy enough). First time is in Helgen, second time is near Helgen (if you&#39;re lucky enough... or not?), third time is in a party, forth time is in the meeting between a barbarian and a poor general serving a dawning nation, fifth time is when you&#39;re going back to the embassy after killing Alduin.\r<br />\r<br />Q: Now you&#39;ve modified her face, can you modify her voice to a softer one too?\r<br />A: Are you going to be my voice actress? No, a voice actor for Elenwen is not a good idea.\r<br />\r<br />Q: No matter how beautiful is she, I&#39;ll finally kill her because she is a Thalmor.\r<br />A: Is this a question? Well, you can do whatever you want...... but don&#39;t tell me, I know it&#39;s full of unsuitable things for children in your mind now. \r<br />To be honest, Thalmor might not be as bad as you think. Don&#39;t argue with me, you don&#39;t even know how are the rulers of the Aldmeri Dominion like. You see, there&#39;s always good and bad people in a faction.\r<br />\r<br />Q: Hey I saw you leaving negative comments on many mods, so I&#39;m gonna attack you too.\r<br />A: I&#39;ve got a shield. And Fus Ro Dah. And Auriel. And Lydia. And Elenwen. And Elisif. And Alvor. And the couriers. And hairs. And grasses. And a bottle. And cheese. And rock. And mountains. And Siberia. And the Soviet Union. And nuclear bomb. And Empress Cixi. And Romanov. And Caesar. And Jesus. And Nexusmods. And World of Warcraft. And Barack Obama. And The Elder Scrolls 8. And your first time of something.\r<br />Wouldn&#39;t you be so dare to attack me, huh?\r<br />\r<br />Q: So what is The Elder Scrolls 8 about?\r<br />A: It&#39;s about modding.\r<br />\r<br />Q: No, I&#39;m serious.\r<br />A: And so do I. It&#39;s about modding. No more questions.\r<br />\r<br />Q: Okay, so how&#39;s the compatibility of this Elenwen Beautification?\r<br />A: I said, no more questions.\r<br />\r<br />Q: Damn you, so what&#39;s your attitude towards Ysgramor?\r<br />A: History is written by victors. Do you think he&#39;s really a hero? I don&#39;t think so. To me, he&#39;s nothing more than a cruel destroyer of an innocent race, and a victor-version of Adolf Hitler. Trust me, if Hitler won the WW, he will be described as a hero, Churchill and Truman will become devils. If the nation which dissolute in 1991 is the United States, it will become the most evil nation ever and the USSR will become the savior of humanity - in your history textbooks. So don&#39;t trust history, books and advertisements. Trust yourselves.\r<br />\r<br />Q: So how&#39;s the compatibility of this mod?\r<br />A: I said, no more questions.\r<br />\r<br />Also, I&#39;m gathering talents to make a massive New Lands/Quests mod called DOMINION, which is about the war between Skyrim and the Aldmeri Dominion, and the dark sides of humanity. \r<br />Details are in here: http://forums.nexusmods.com/index.php?/topic/1279053-the-elder-scrolls-v-dominion-recruiting-talents/\r<br />\r<br />Urgently urgently SUPER URGENTLY need Trailer Maker, Voice Actresses, CK Workers, Scripters and 3D Modellers&#33;&#33;&#33;",
  "categoryId": "33",
  "version": "Dominion",
  "author": "Anbeegod",
  "createdUnix": "1391433312",
  "updatedUnix": "1391433274",
  "containsAdultContent": false,
  "uploadedBy": "kahasana",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095050",
      "name": "Elenwen",
      "version": "Dominion",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2052",
      "fileName": "Elenwen-50700-Dominion.rar",
      "uploadedUnix": "1391433274",
      "modVersion": "Dominion",
      "virusScanUrl": "https://www.virustotal.com/file/4588708cc04ff7378004237ad0c1f5539a18696fb6763241de7fad76f0f9f7db/analysis/1407916214/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elenwen-50700-Dominion.rar?fid=1000095050&ttl=1535832557&ri=8192&rs=8192&setec=b7d2c5a5cb3448b7e027caff5b11bdb8"
    }
  ]
}