{
  "modId": 50722.0,
  "modName": "Griffins Island",
  "summary": " You have seen all there is to see in skyrim, now your adventurous soul wants to venture the ocean in search of new challenges, hire your crew and and ship so you can travel the open sea. Dreaming of new, unknown lands you find a ship in windhelm which is about to set sail, heading to a newly discovered island...",
  "descriptionHtml": "Content: \r<br />- a large new Island, landscape created by hand \r<br />- build an own colony on a newly discovered island and defend what you built&#33; \r<br />- new npcs \r<br />- dungeons \r<br />- eastereggs \r<br />- storyline & sidequests \r<br />- custom soundtrack \r<br />\r<br />\r<br />Griffin&#39;s Land adds a large new Island to the world of Tamriel. You&#39;ll get to explore lands without any traces of intelligent life, only pure and wild nature. Coming features are a storyline with various custom npcs, the creation of a colony and even a custom soundtrack (super epic&#33;). \r<br />I&#39;m aiming to create an environment without any human influence, only pure wildlife. You will explore it and you shall colonialize it. Settle down, build first a tent, a few shacks, a small village, then build a large town with an own harbour. Settling should be done with other mods like Tundra defense (in workshop and on nexus), pocket empire builder (in workshop) and RTS for skyrim (on nexus). \r<br />\r<br />Progress is running very well so far, there are almost no problems I couldn&#39;t handle. I&#39;m also almost done with the landscaping, there are only a few small areas left to be designed. Soon the dungeon interiors will follow and after finishing that I will make some quests and a storyline, as well as a few sidequests. \r<br />However, I still got great issues to handle creating Distance LOD, so right now you can only see around a hundred meters. \r<br />I&#39;m awaiting your feedback, wishes and suggestions. Tell me if you like the landscape and the atmosphere and if you found any bugs. Everything will be recognized and answered asap as I keep working. \r<br />\r<br />Current progress: \r<br />Heightmap (100%) (I still may add some new areas enlarging the island) \r<br />Landscape/Flora (90%) \r<br />Dungeons: 7 currently installed. \r<br />Animal wildlife (75%) \r<br />Quests (0%) \r<br />New NPC&#39;s: 17 \r<br />\r<br />Recommended Mods: \r<br />-Tundra Defense (allows you to build a colony) \r<br />-Pocket Empire Builder (allows you to build a colony) \r<br />-RTS for skyrim (allows you to build a colony) \r<br />-Driveable Boats \r<br />-Frostfall \r<br />-Imp&#39;s More complex needs \r<br />\r<br />Coming soon: \r<br />- finishing detailed landscape \r<br />- adding more animals and scripting them \r<br />- quests \r<br />- custom soundtrack \r<br />aaaaand more eastereggs and riddles;) \r<br />\r<br />All right, remember it&#39;s still WIP but if you want to have an influence on the future versions, try it out now and tell me what you like and what you wish to see soon. \r<br />\r<br />&#33; Need help creating the LOD for the island, any tips are appreciated&#33; \r<br />\r<br />You can get to the island by a ship laying at the harbor of windhelm. Walk on the deck and then northbound to start travelling. If you&#39;re on the ship near the island simply jump down on the boat at the left side of the ship to get to the island. \r<br />If you enjoyed it, thumbs-up, fav and you&#39;re done. Spread the word&#33; Thanks and have fun;)",
  "categoryId": "30",
  "version": "0.7",
  "author": "Viktorkurz ",
  "createdUnix": "1391466109",
  "updatedUnix": "1394295195",
  "containsAdultContent": false,
  "uploadedBy": "jadmwtpg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100354",
      "name": "Greifhorst Island",
      "version": "0.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6432",
      "fileName": "Greifhorst Island-50722-0-7.rar",
      "uploadedUnix": "1394295195",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/017ba7dd639cd66c0b0ad62e9284fce90cbdb3b5173d63cc26753486f27e0055/analysis/1407965231/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Greifhorst%20Island-50722-0-7.rar?fid=1000100354&ttl=1535832595&ri=8192&rs=8192&setec=e384edf7c9f37a29130b75f8a43e10da"
    }
  ]
}