{
  "modId": 50732.0,
  "modName": "Hunters Retreat A Simple Player Home",
  "summary": "A Simple Player home that caters to all Basic Character needs, Right outside of Whiterun",
  "descriptionHtml": "Hey Everyone, so this is the First mod that I&#39;ve ever done. I was unsatisfied with the Vanilla homes, and I just couldn&#39;t find a player home that really ever suited my playstyle or what I used my homes for. So I went a head and Created a nice simple home. nothing fancy with it. \r<br />\r<br />The home is Located just outside of Whiterun, so it&#39;s not far away from any stores at all :). It has all your basic Crafting Needs included, An Alchemy and Enchantment table inside, as well as a Bookcase and a Mannequin so you can show off a piece of your armor, or display your books as I do. \r<br />\r<br />Outside in the back we have a Forge and a Smelter, As well as  Workbench, Tanning Rack, and Grindstone all along the backside of the house. I didn&#39;t make this house for Anything Super Fancy, no special effects or anything. It is available the moment you install it, and should be compatible with everything, Unless of course the location of the house is Altered in some way. \r<br />\r<br />But as I said, it is my first Mod so any suggestions or criticism is appreciated to help improve it or otherwise. Thanks for taking a look, I was pleased with the results :)\r<br />\r<br />**I&#39;d like to thank**\r<br />Bethesda: for Skyrim\r<br />As well as the Creation Kit ",
  "categoryId": "67",
  "version": "1.0",
  "author": "RadioComm",
  "createdUnix": "1391478808",
  "updatedUnix": "1391478792",
  "containsAdultContent": false,
  "uploadedBy": "RadioComm",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095150",
      "name": "HuntersRetreatPlayerHome",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57",
      "fileName": "HuntersRetreatPlayerHome-50732-1-0.rar",
      "uploadedUnix": "1391478792",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f515c6cdc25e36256ab0744c60192415042320263422c4f29a8392f0d1344c8f/analysis/1407917290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HuntersRetreatPlayerHome-50732-1-0.rar?fid=1000095150&ttl=1535832622&ri=8192&rs=8192&setec=5006bd8d130ccb492640a0f3bb09eba3"
    }
  ]
}