{
  "modId": 5073.0,
  "modName": "MrSlackPants-MagickaTweaks",
  "summary": "Makes a few minor changes to magicka, giving a decent advantage to mage type characters.",
  "descriptionHtml": "Makes some changes to magicka in Skyrim. Don\\'t you think it\\'s odd that by default dual casting costs you 2.8x the magicka compared to a normal cast and only does 2.2x the damage? Normally i would have been ok with this but ... \r\n\r\n... you spend a perk point to be able to dual cast. To me this does not look to be a reward for investing in the skill. There should be a positive trade off to it, and to me there doesn\\'t seem to be one. Dual casting cost an rediculous amount of magicka for a minor boost in damage. Therefor this mod changes that, to make dual casting worth the perk point you put into it. So with tis mod dual casting will cost 2x the magicka for a 2.5x damage boost. So, this way you basicly spend a perk point to get a boost in damage output, which seems a lot more fair to me.\r\n\r\nI also changes magicka combat regen rate slightly. I changed it from 0.33 to 0.45, making magicka regenerate slightly faster during combat. Since most mages are physicly weak, it would be bad if they run out of magicka, which is their only strength. I think they should last a bit longer with the magicka they can have.\r\n\r\nSpells will cost slightly less the more skill you get. So, as your skill in destruction for example, increases towards 100, the same spell will cost you less magicka to cast.\r\n\r\n\r\nGame Settings the mod changes are:\r\nfCombatMagickaRegenRateMult\r\nfMagicCasterPCSkillCostBase\r\nfMagicDualCastingCostMult\r\nfMagicDualCastingEffectivenessBase",
  "categoryId": "93",
  "version": "1.0",
  "author": "Mr SlackPants",
  "createdUnix": "1325426175",
  "updatedUnix": "1325426332",
  "containsAdultContent": false,
  "uploadedBy": "mrslackpants",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15708",
      "name": "MrSlackPants-MagickaTweaks",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "MrSlackPants-MagickaTweaks-5073-1-0.zip",
      "uploadedUnix": "1325426332",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d74333c3d394a7f7f968d7f87c4080a6e9068507004b4ffc8f0664dc1ed55341/analysis/1406575266/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MrSlackPants-MagickaTweaks-5073-1-0.zip?fid=15708&ttl=1535761537&ri=8192&rs=8192&setec=f0c082663f82ef69d51dccbbed8e262e"
    }
  ]
}