{
  "modId": 50767.0,
  "modName": "Deadly Diseases",
  "summary": "Changes all vanilla diseases to be very dangerous and adds new diseases to increase variety.",
  "descriptionHtml": "[img]http://imageshack.com/a/img513/7186/xsg4.jpg[/img]\r<br />\r<br />Diseases in vanilla Skyrim are simply lame. Their effects are minimal and most of the time you don&#39;t even care if you have one. This mod aims to change that. In addition to changing every existing disease, I added 8 new diseases to increase variety. So how does this mod change the diseases?\r<br />\r<br />First of all, every disease will stop your health regeneration completely and deal small amount of damage over time, some deal damage faster than others. This means no fast traveling to the nearest Shrine to cure the disease. Instead you&#39;ll have to carry Cure Disease potions with you or be prepared for long and painful journey to get yourself cured.\r<br />\r<br />Another thing this mod changes is the magnitude of all diseases. For instance in vanilla Skyrim Brain Rot drained your magicka by 25 points, but in Deadly Diseases it drains 150 points instead. All diseases will be very dangerous and have huge effects on your character&#33; \r<br />\r<br />[b]Here is a list of all diseases, what they do and the enemies causing them:[/b]\r<br />\r<br />[color=lightblue][b]Ataxia:[/b][/color] Picking locks and pockets is 75% harder. (Source: Skeever)\r<br />[color=lightblue][b]Bone Break Fever:[/b][/color] Drains your Stamina by 150 points. (Source: Bear)\r<br />[color=lightblue][b]Brain Rot:[/b][/color]  Drains your Magicka by 150 points. (Source: Hagraven)\r<br />[color=lightblue][b]Carminibus Metus:[/b][/color] 100% Weakness to Magic. (Source: Draugr, Hagraven and Wolf)\r<br />[color=lightblue][b]Crura Rigent:[/b][/color] You move 50% slower. (Source: Wolf and Mudcrab)\r<br />[color=lightblue][b]Dracalae:[/b][/color] 100% Weakness to Magic. Armor rating is decreased by 300. You move 25% slower. Deals damage very fast. (Source: Dragon)\r<br />[color=lightblue][b]Infirmus Musculi:[/b][/color] Your armor rating is decreased by 300. (Source: Bear)\r<br />[color=lightblue][b]Irreparabiliter:[/b][/color] Stunted Magicka and Stamina. (Source: Chaurus)\r<br />[color=lightblue][b]Necuirium:[/b][/color] Your carry capacity is decreased by 250. (Source: Sabre Cat)\r<br />[color=lightblue][b]Putribilibus Febris:[/b][/color] Deals damage faster than other diseases, no other effects. (Source: Draugr, Falmer and Skeever)\r<br />[color=lightblue][b]Rattles:[/b][/color] Stunted Stamina. (Source: Chaurus)\r<br />[color=lightblue][b]Rockjoint:[/b][/color] Your one-handed and two-handed attacks deal 75% less damage. (Source: Wolf)\r<br />[color=lightblue][b]Troglodytarum:[/b][/color] One-handed and two-handed weapons and Destruction spells deal 50% less damage. You move 25% slower. (Source: Troll)\r<br />[color=lightblue][b]Witbane:[/b][/color] Stunted Magicka (Source: Sabre Cat)\r<br />\r<br />As mentioned above, all diseases stop your health regeneration and deal 0.2 points of damage per second in addition to the effects stated above. It should be noted that the amount of damage diseases deal is affected by your difficulty setting. So the higher your difficulty setting is, the more you take damage.\r<br />\r<br />Because diseases are so much stronger than in vanilla Skyrim, I decided to drop the chance of getting a disease from 5% to 3%. It just feels more balanced this way. I&#39;ve been playing with this mod enabled since I made it in 2013 and I&#39;ve found it working properly so far, but if you have any problems or find bugs please report them so I can patch them.\r<br />\r<br />One thing to be aware of is that your companions can catch a disease too. If this happens they may end up crawling on the ground for a long time because they can&#39;t regenerate their health back. There is a simple solution to this though, just wait or sleep and your companion will be back up again like nothing ever happened.\r<br />\r<br />[b]Compatibility:[/b]\r<br />This mod is compatible with any mod as long as it doesn&#39;t make any changes to the vanilla diseases or alter the attack data of races which cause diseases. No DLC required.\r<br />\r<br />[b]How To Install:[/b]\r<br />Simply download the DeadlyDiseases.esp file and copy it to your Skyrim data folder or use the Nexus Mod Manager to do it for you.\r<br />\r<br />All suggestions are welcome&#33; I&#39;ll keep updating this mod if there is a need to do so.",
  "categoryId": "24",
  "version": "1.0",
  "author": "PhazonBlaxor",
  "createdUnix": "1391562470",
  "updatedUnix": "1391562237",
  "containsAdultContent": false,
  "uploadedBy": "PhazonBlaxor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095321",
      "name": "Deadly Diseases",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Deadly Diseases-50767-1-0.rar",
      "uploadedUnix": "1391562237",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/caefbec9a0fbb640e26503d885e5494ba9984726f8c24e5372aba413881d7e9c/analysis/1407918784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deadly%20Diseases-50767-1-0.rar?fid=1000095321&ttl=1535832679&ri=8192&rs=8192&setec=3f7ca0d359e1e5c8d64e0770ac8a72c9"
    }
  ]
}