{
  "modId": 50778.0,
  "modName": "Summons of Solstheim Lurkers Werebears and more",
  "summary": "This mod makes some creatures from the Dragonborn DLC fully summonable with a bunch of new spells&#33; A must-have for the true champion of Apocrypha&#33; \r<br />It makes no major changes in the game so should be compatible with most other mods just fine.",
  "descriptionHtml": "This mod includes:\r<br />- Conjure High Seeker\r<br />- Conjure High Seeker Thrall\r<br />- Conjure Lurker Guardian\r<br />- Conjure Lurker (Vindicator) Thrall\r<br />- Conjure Werebear\r<br />- Conjure Werebear Thrall\r<br />\r<br />- Fixed Telvanni Robes + Master Telvanni Robes\r<br />- Twin Souls perk upgrade\r<br />\r<br />[b]UPDATES:[/b]\r<br />-V1.2: Fixed minor bugs with casting animations \r<br />-V1.3: All tomes are now available for sale from Neloth in Tel Mythrin if your Conjuration level is high enough (65 +) and can be found in Apocrypha inside boss-level chests without changing or removing any other item data&#33; \r<br />\r<br />[b][u]I AM NO LONGER WORKING ON THIS. THANKS TO EVERYONE WHO SUPPORTS THIS MOD&#33;[/u][/b]\r<br />\r<br />[b]DESCRIPTION:[/b]\r<br />All added regular spells are &#39;Expert&#39; level and the Thrall spells are &#39;Master&#39; level&#39;. They are all effected properly by the Conjuration Perks such as Dual Casting, Summoner and Twin Souls. The summons have similar casting costs as others in their class, and these are also properly reduced by the relevant perks.\r<br />The Twin Souls perk has been &#39;upgraded&#39; to allow up to 4 summons at a time. I did this for testing purposes so it might make your character seem a bit overpowered but it&#39;s a lot of fun as it only works when you have the lvl 100 perk activated anyway, so I kept it in&#33; I also added some Telvanni robes since the only playable one in the game is burned and damaged so now you can look like an actual decent Telvanni member.\r<br />\r<br />[b]LOCATIONS:[/b]\r<br />All spells have working spell tomes which you can acquire either from [b]Neloth&#39;s shop in Tel Mythrin[/b] if your Conjuration level is high enough (65+) or in his staff-enchanting chamber behind a box to the left. (see pictures)\r<br />They can now also be found in boss-level chests in Apocrypha just like the original &#39;Conjure: Seeker&#39; spells already in the game, for those who want to claim the tomes the lore-friendly way.\r<br />This means you can only get the spells for free if you have helped Neloth to the point when he lets you into the Staff-Enchanting room. You can also use the console command &#39;tcl&#39; to go trough the walls to get them early, or simply add the tomes directly to your inventory with the following codes:\r<br />\r<br />-High Seeker: xx0036CA \r<br />-Seeker Thrall: xx0036CD \r<br />-Lurker Guardian: xx009472 \r<br />-Lurker Thrall : xx00C33D \r<br />-Werebear: xx0036CE \r<br />-Werebear Thrall: xx00946C \r<br />\r<br />Known Problems / Changes / Bugs:\r<br />- The Thrall spells are supposed to be dual-handed but the animations looked weird and awkward so these Thrall spells are equipable in one hand. The Casting time still remains 3 seconds as all other Thrall spells.\r<br />- The Lurkers are very tall and need a wide open space to be summoned, this means summoning them indoors or in tight spaces will result in failure quite often. Since their respective spells are equiped in only one hand, you can still move around while trying to summon them so the problem is less annoying.\r<br />- The Werebear might fail to summon seemingly at random, even when the proper sounds and animations play for a succesfull cast.\r<br />- The items in the chest in Tel Mithryn show up red as if you&#39;re stealing them. However: taking them has no penalty at all, and the items are NOT marked as &#39;stolen&#39; in your inventory. So you can safely grab them without worries. Why it does this I have no idea.\r<br />- The Lurker Thrall is called &#34;(player name)&#39;s Lurker Guardian&#34; instead of &#39;Lurker Vindicator&#39;. This is not a bug, this was done for simplicity reasons but I assure you that your Lurker Thrall it&#39;s a powerfull Vindicator.\r<br />-If you&#39;re wondering why Neloth is the only one selling the spells, it&#39;s because its the only choice that would make a bit of sense lore-wise, since he is interested in the Black Books and wishes to learn their secrets. His apprentice is the one who sells all other conjuration spells and can give you trainig, but it&#39;s implied he learned everything from &#39;Master Neloth&#39;. If I knew how to make the spells available only after you gave him a Black Book, then I would do so. If you know of a way, be sure to let me know&#33;",
  "categoryId": "75",
  "version": "V1.3",
  "author": "FanmaR",
  "createdUnix": "1391607647",
  "updatedUnix": "1391784352",
  "containsAdultContent": false,
  "uploadedBy": "Fanmar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095384",
      "name": "Summons of Solstheim",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Summon of Solstheim-50778-.rar",
      "uploadedUnix": "1391607555",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2dccc112e874f8087cde03456819cabf026b7de5bacc053b8f58f5d65d559cdb/analysis/1407919271/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summon%20of%20Solstheim-50778-.rar?fid=1000095384&ttl=1535832697&ri=8192&rs=8192&setec=3f5c6dc1ff4c8355d57d4d30f34cc382"
    },
    {
      "fileId": "1000095766",
      "name": "Summons of Solstheim",
      "version": "V1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Summons of Solstheim-50778-.rar",
      "uploadedUnix": "1391784352",
      "modVersion": "V1.3",
      "virusScanUrl": "https://www.virustotal.com/file/1d22b8fad4b50cb95b94027b446b8b47fa0f29271e097b53672441acd1aac020/analysis/1407922871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summons%20of%20Solstheim-50778-.rar?fid=1000095766&ttl=1535832697&ri=8192&rs=8192&setec=5f878a0f19aa3875fd39b779d00233e0"
    }
  ]
}