{
  "modId": 50808.0,
  "modName": "Bow-Quiver-Dagger",
  "summary": "Alternative placement of the Bow, Quiver, and Dagger - with a Light Armor user in mind (but looks great for any type of character).",
  "descriptionHtml": "Version 1.1 is now live&#33;&#33;  It looks much better, and works with every (vanilla) quiver.\r<br />\r<br />This mod is a simple character skeleton replacer.  It changes nothing but the position of the Bow, Quiver, and Dagger (or just the Bow and Quiver if you are so inclined).  I tried to keep it as vanilla as possible - meaning that it should look just fine with the vanilla weapon drawing animations.\r<br />\r<br />What&#39;s the point of this Mod?\r<br />There are a few mods like this floating around, but either they didn&#39;t meet my criteria, or they were dependent upon other skeleton mods.  Some of them didn&#39;t even let you pick up and move bodies, because they were made too damn heavy - booo&#33;&#33;&#33;  So what&#39;s the aim of this mod?  Two things mainly.  One, I wanted a cooler looking, more realistic way to carry my bow and quiver.  Two, I play a light armor, thief/archer type character, and I wanted a blade that was light and fast.  Something that wasn&#39;t long enough to be a sword, but not so miniscule as to be called a dagger.  A short sword was the obvious choice.  Problem is, most short sword mods have the sword placed in the dagger position.  That&#39;s just fine and dandy ... as long as you&#39;re standing completely still.  Try to do anything else (run, jump, crouch) the your short sword would clip horribly through your leg/s.  So I changed the dagger position to where the sword normally rests.  This way, if you&#39;re using a short sword that&#39;s been placed in the dagger position, it will look no different than if you were carrying a regular sized sword, and best of all it doesn&#39;t clip through your legs.  Can&#39;t guarantee there won&#39;t be any clipping issues for all armors, but I&#39;ve tested it with most vanilla armors and it looks great.\r<br />\r<br />I&#39;ve included two options to install:\r<br />\r<br />-Bow and Quiver Only - This option changes the position of the bow so that it&#39;s slung diagonally over your shoulder, and the quiver is angled appropriately next to it.\r<br />\r<br />-Bow, Quiver, and Dagger - This option utilizes the same bow and quiver position as the first option, however, I&#39;ve also added a different position for the dagger.  Normally the dagger is positioned on the front left of your character, but I&#39;ve changed it to that of the swords resting position (I&#39;ve already explained why I&#39;ve done this).  This option may not be appealing to those who don&#39;t use short swords.\r<br />\r<br />&#33;&#33;&#33;Both skeleton options slightly modify the size of the bow and quiver.  It makes them smaller, but you&#39;ll barely notice.  Also, bodies are still very much moveable and pick-up-able, so enjoy that.\r<br />\r<br />I want to apologize to anyone who plays as a female character or uses one of the beast races.  I play as a Redgaurd male, and initially I only made this mod for myself.  I do plan, however, to make versions for females and beast races at some point - relatively soon I hope.  With those, I&#39;ll also include versions that don&#39;t shrink the bow and quiver (no matter how marginally), and versions that work with every vanilla quiver.\r<br />\r<br />As far as compatibility goes, it should be compatible with anything that DOES NOT alter character skeleton meshes.  I should also note that I&#39;m looking into making this compatible with &#34;Realistic Ragdolls and Force&#34;.  It would be a separate download option.  F.Y.I, if I do make it compatible, you would find it quite a bit more difficult to move bodies.  In order for RRaF to work, the mod author had to make bodies a lot heavier.\r<br />\r<br />Change log:\r<br />v1.0 - Original release.\r<br />v1.1 - Tweaked the position of the bow ever so slightly to look better.  Rotated quivers 180 \r<br />degrees so that they better lined up with the bow (Looks great&#33;).  Daggers remain the same as \r<br />the original release.\r<br />\r<br />Author notes\r<br />Do with this as you will, just please credit me as the original author, or at least your inspiration (just kidding).\r<br />\r<br />File credits:\r<br />-Me, Myself, and I\r<br />\r<br />-And I can&#39;t forget Ryeong (hl84) for her awesome tutorial on editing skeletons for weapon placement. Seriously, watch her video, you can do it yourself, it&#39;s so easy, lol&#33;  Check it out here: http://www.nexusmods.com/skyrim/mods/7716/?\r<br />",
  "categoryId": "78",
  "version": "1.1",
  "author": "ThroatPoka",
  "createdUnix": "1391672632",
  "updatedUnix": "1391832205",
  "containsAdultContent": false,
  "uploadedBy": "throatpoka",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095851",
      "name": "Bow Quiver Dagger v 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Bow Quiver Dagger v 1_0-50808-1-0.7z",
      "uploadedUnix": "1391830290",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/24c46d90c5fd1d5cd89d3d5fa09c5c910aadb8aac9efb1a82c275c88d6567883/analysis/1407923468/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bow%20Quiver%20Dagger%20v%201_0-50808-1-0.7z?fid=1000095851&ttl=1535832749&ri=8192&rs=8192&setec=92a284e3a50435109085fa6c4ba49c18"
    },
    {
      "fileId": "1000095853",
      "name": "Bow Quiver Dagger v 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Bow Quiver Dagger v 1_1-50808-1-1.7z",
      "uploadedUnix": "1391832205",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a060fae8e35b5063868b21410a8da8a9b40f746052d70bca90280ddb3309ba3c/analysis/1407923641/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bow%20Quiver%20Dagger%20v%201_1-50808-1-1.7z?fid=1000095853&ttl=1535832749&ri=8192&rs=8192&setec=4a8df544f084b12e5027722fbd0a64fb"
    }
  ]
}