{
  "modId": 50809.0,
  "modName": "Work Studios",
  "summary": "Work Studios is an excellent space in which to test body and outfit modifications. It is simply a set of 3 rooms composed of nothing but solid 100% white, 100% black or 100% blue color. ",
  "descriptionHtml": "[img]http://i.minus.com/iMy4CewNRqlWB.png[/img]\r<br />\r<br />[size=6][b]What is the HDT Physics Extension for Skyrim?[/b][/size]\r<br /> \r<br />The HDT-PE is a plugin for the Skyrim Script Extender (SKSE). It uses the Havok physics engine (Havok) that already exists in the game and applies it to other uses in the game.\r<br /> \r<br />When originally released, the extent of the use of the Havok physics engine was restricted to things bouncing around; whether they be dead bodies, the odd skull, or a room full of weapons. If you wanted a cape that flowed when you ran, it would have been an animation that detailed the movement. While this simulates realism, it isn&#39;t realism.\r<br /> \r<br />HDT Physics Extension alleviates the problems associated with animation by actually using the physics engine that is part of the retail game. Through some creative use of SKSE, HydrogensaysHDT (the author of the Physics Extension plugin) has provided a set of tools that create game physics objects that interact and respond to the world around them. A ponytail can bounce off a womans back, a cape can flow in any direction and boobs can bounce around and react to touch.\r<br /> \r<br />\r<br />[b][size=6]Demo Videos[/size][/b]\r<br /> \r<br />NSFW: [url=http://dai.ly/x18g0lj]DailyMotion[/url]  [url=http://dai.ly/x16i9uu]DailyMotion[/url]  [url=https://www.youtube.com/watch?v=CRBcRCWxUrs]YouTube[/url]\r<br />\r<br />https://www.youtube.com/watch?v=DWBI4NwGUf8\r<br /> \r<br /> \r<br />[color=#ffff00][b][size=6]Installation and Support[/size][/b][/color]\r<br /> \r<br />[i][size=5][color=#ffff00]All support, install instructions, customization docs and the mods skse source code are on [/color][b][url=https://code.google.com/p/hdt-pe/][u]Google Code[/u][/url][/b]. If you are having trouble with the mod in one way or the other, perform the instructions as shown on that site before posting the support thread here.[/size][/i]\r<br />\r<br />\r<br />\r<br />___________________________________________________________________________\r<br />(original credit to KahjiitRaj)\r<br />\r<br />Work Studios is an excellent space in which to test body and outfit modifications. It is simply a set of 3 rooms composed of nothing but solid 100% white, 100% black or 100% blue color. \r<br />\r<br />To access the rooms:\r<br />  1. go to console\r<br />  2. type  coc studiowhite\r<br />…or black, or blue.\r<br />\r<br />They are small spaces if you look at them in the editor, but are built to appear endless. This is accomplished with a cube of collision walls placed well inside of a cube of textured walls. Therefore, whatever you put in here appears to be suspended in space.\r<br />\r<br />The lighting is generic. Bright white upper light from the southeast, dimmer white fill light from the southwest, and a dim midnight blue light from the north. The consistency of the lighting could not really be maintained with a larger space.\r<br />\r<br />The space will load the body and outfit assets, the textures for the wall and unless you have some other mods installed, that will be it. There’s no connection to the outside world and consequently none of it’s baggage. Therefore, the rooms re/load very fast. On a modern rig, you may not even get the loading screen.\r<br />\r<br />studioblue uses the typical bluescreen color of blue so that an alternate background can be put in place if you so desire. If after effects are your thing, this is a good place to start.\r<br />\r<br />If you just want to show off or demo an outfit, these spaces are ideal for just such a thing.\r<br />\r<br />Work Studios is based off of Review Studio, thanks KahjiitRaj. http://www.nexusmods.com/skyrim/mods/11792/? \r<br />I had been using it dutifully for “a while” and it had served me well thru several demo videos. The only things from the original that remain in this mod are the blue and white wall and the spirit of that mod.",
  "categoryId": "28",
  "version": "v1",
  "author": "Monsto Brukes",
  "createdUnix": "1391674570",
  "updatedUnix": "1391674570",
  "containsAdultContent": false,
  "uploadedBy": "monsto",
  "primaryFile": null,
  "files": []
}