{
  "modId": 50836.0,
  "modName": "Ancient Dark Brotherhood Sanctuary Pre_Alpha",
  "summary": "This mod is FAR from finished, it requires all DLC(Dawnguard, Heartfires, Dragonborn).\r<br />Spacious Ancient Sanctuary, has Everything(this includes an epic Shrine of Sithis).\r<br />If it doesn&#39;t, tell me and if it&#39;s cool I will add it&#33; \r<br />This mod will be for After the main DB story.",
  "descriptionHtml": "[Pre-Alpha] \r<br />[Author&#39;s notes]\r<br />Since this is my very first mod(I like to think I&#39;m a fast learner though), it may be a while until I can throw something presentable at you guys, so I might release a few Alpha version as I progress.\r<br />(Constructive) feedback will be highly appreciated&#33;\r<br />[End of note]\r<br />Forgotten for hundreds of years, this massive sanctuary near Riften holds all a loyal Listener will ever need to appease our dread father and mother. \r<br />For this sanctuary I plan to let dear Astrid make a new appearance as &#39;Guardian Astrid&#39;. \r<br />As penance Sithis sent her back to serve the Listener and to steward this Sanctuary(to make it a bit customisable, like replace your bed with a Coffin, ...)\r<br />It will be accessible via an abandoned cellar. \r<br />\r<br />This sanctuary comprises of a Large hall (dining, ..), sleeping quarters for all (themed human, vampire, werewolf. The last 2 will also contain some beds), 4 chambers for the Speakers and a master chamber for the Listener, treasure chamber, a torture area (duh) complete with a waste pit, there&#39;s catacombs, a chamber for the Nightmother linked to a chamber for the keeper, an epic *hidden* shrine of sithis, a library, a room for magical studies, an alchemy garden with a *planned* re-introduction of a single &#39;Purgeblood&#39; node, several storage chambers, a smithy (possibly with a &#39;Void Forge&#39;), ... I also plan on adding a lot of secret passages, with a central hub for what I hope to be quick access to everything.\r<br />\r<br />I will also add a bunch of ghost guardians, some generic, some merchants (also a BS).\r<br />\r<br />Of course there will also be voice acting, a few quest to fully unlock all functions. I also aim to make this as lore-friendly as possible, please correct me when I make mistakes.\r<br />\r<br />I was also toying with the idea of adding a small dungeon to it, that may or may not contain a dragon and a new void-themed shout.\r<br />\r<br />If you, the people like this idea I will keep updating this and adding info as it comes to me :)",
  "categoryId": "67",
  "version": "0.0",
  "author": "Leafmanz",
  "createdUnix": "1391723528",
  "updatedUnix": "1391723528",
  "containsAdultContent": true,
  "uploadedBy": "leafmanz",
  "primaryFile": null,
  "files": []
}