{
  "modId": 50840.0,
  "modName": "Hearthfire Girls",
  "summary": "Makes all the Hearthfire Housecarls and Bards girls.",
  "descriptionHtml": "Hearthfires Girls by Dragonfire12\r<br />\r<br />First and foremost have you cleaned, Update.esm, Dawnguard.esm, Hearthfires.esm and Dragonborn.esm with TES5Edit by ElminsterAU [http://www.nexusmods.com/skyrim/mods/25859].  The program and instructional videos are on this page.\r<br />\r<br />This Mod requires ApachiiHairFemale_v_1_3 by Apachii [http://www.nexusmods.com/skyrim/mods/10168] the fourth file download on her site.  I have received permission from Apachii to use her mod. \r<br />\r<br />Files: Pick the Voice you want…\r<br />\r<br />Housecarl Girls  -  Install this file first.\r<br />(Voices are FemaleYougEager (Raychel and Gretchen) and FemaleEvenToned (Valerie).  They only voice Vanilla Housecarl dialog.  They will greet you properly when you meet them for the first time.  They will not voice all of the dialog options when navigating the Conversation Menus.)  \r<br />\r<br />Housecarl Girls – FemaleCommander  - Install this over Hearthfire Girls.  It is a replacement esp file.  If you only install this file you will see grey heads.  \r<br />(voices all the Hearthfire and Vanilla Housecarl Dialog but I think the FemaleCommander voice sounds terrible.)\r<br />\r<br />If you have neck gap on any of the six NPC&#39;s the fix is near the bottom of the page (I know most people wont read the whole thing).  At least read the Installation Instructions.\r<br />\r<br />This mod runs best when running Hearthfires for the first time, after a fresh install or when starting a new game.  \r<br />\r<br />If you install this file over the existing Housecarls you will have to take away their base armor for them to wear the armor I gave them (see screenshots).  Also, Raychel (Rayya) will walk like an Ape and sit with her knees two feet apart.  There is no way to fix this it is in your savegame because you met Rayya first.  If you were running the mod, Feminine Females by Nemesis The Warlock [http://www.nexusmods.com/skyrim/mods/36286] and had it installed when you met Rayya, this is a non issue.\r<br />\r<br />As with any mod, ESC-Save your game before install.  That way if you decide you don’t like it, etc., you can uninstall it and return to a save game that does not include the mod.  Best to stand in front of Redguard Rayya to save so you can identify the Save Game later.  Note that in this regard there is no such thing as a clean save.  Every mod you have ever installed and removed has leftover data in your save game.  Clean save; F5, F9, ESC-Save, is used only to reset the interface and clear the Content Flag when loading.  The only way to completely remove any mod from your system is to Start a New Game or resume from a Save Game made before you installed the mod.  Some mods can even corrupt a New Game after uninstall because they leave behind script files, etc., that confuse the game.  I don’t want to scare you, but, yeah…  If you experience Save Game Bloat, evidenced by Crash on Load, run SKYRIM Save Cleaner by seifer69er [http://www.nexusmods.com/skyrim/mods/31724].  I use this and have never lost a save game, I have a level 88 character and it runs fine.  Still, backup your saves anyway.  Everything for this mod is contained in esp and bsa files and will not leave anything behind in your data folder if uninstalled.\r<br />\r<br />ApachiiHairFemales.esm\r<br />Hearthfires.esm\r<br />\r<br />Both must be installed and most importantly activated for this mod to work.  \r<br />\r<br />Do not run my mod Hearthfires Everyone Sleeps [http://www.nexusmods.com/skyrim/mods/50402] with this mod, they overwrite each other and HES is incorporated into this mod, description below.\r<br />\r<br />The idea for this came from Migals Housecarl Beauties by Migal [http://www.nexusmods.com/skyrim/mods/15808] which prettifies the Vanilla Housecarls and makes them all girls.  It also makes them walk like girls and sit like ladies.\r<br />\r<br />So I did the same thing to the Hearthfires House Bards and Housecarls.\r<br />\r<br />Bards are Lynn, Sonir and Oriella.\r<br />Housecarls are Rayya with her name changed to Raychel (Now a Breton), Valerie (Now an Imperial) and Gretchen (Still a Nord).  See Screenshots provided, all are in Vanilla Armor and clothing.  I added their hold to the Housecarl names so that I could keep track of who was who.  For some reason I get the Housecarls mixed up.  I don&#39;t know how many times I&#39;ve dismissed one of them as a follower only to realize that they were walking cross country to get home.\r<br />\r<br />Installation Instructions.  This is important please read and follow.\r<br />\r<br />If you have met any of the housecarls.  After you install this mod they will still be wearing their original armor.  You have to take it away from them (See Screenshots).\r<br />Start a conversation with E\r<br />I need to trade some things with you.\r<br />Take away the armor they are wearing (see screenshots if this is confusing).\r<br />\r<br />They will now all wear the armor I gave them.   Their weapons should be as I assigned because they were placed in their inventory.  However, Raychel will walk like a Ape because you met Rayya first.  I don’t not know a way to change this.  If anyone does, please let me know what the fix is because it drives me crazy to watch Lydia, Jordis, Iona and Rayya all walk like Tarzan (I have looked and looked and can not find a way to get the “Opposite Gender Anims” flag out of the save game file).  If you meet Raychel for the first time with my mod installed she will walk like a girl and sit like a lady.  If you get Migals mod, Housecarl Beauties and install it before you meet Lydia; she, Jordis and Iona will walk like girls.  If for any reason you uninstall these mods and meet Lydia, Iona, Jordis or Rayya the Ape walk will be in your save game and there is noting that can change that as far as I can tell.   Re-installing the mods will not reverse the Ape walk.  Remember this.  There is an excellent mod Feminine Females by Nemesis The Warlock [http://www.nexusmods.com/skyrim/mods/36286] that makes all the women in the game walk like girls.  Again any character you have met is game with the “Opposite Gender Anims” flag set (ie. in a zone you have entered) will still walk like an Ape even after the install of this mod, its stored in your save game.  You have to start a new game to remove this.  The mod instructions say to place it at the top of your load order beneath the last esm file.  Note that if you have another mod that overwrites this and it is below any of these other mods then the women that mod alters will walk like Apes.\r<br />\r<br />Now where was I… I assembled all three original housecarls (using the EFF Follower mod) and took a screen shot of them while in the Inn in Dawnstar.  I saved, exited the Game, activated the mod and reloaded, then took another screen shot of the three Housecarl girls in their base armor sets.  Before I could take away their base armor sets for yet another screenshot, the damn Bard started to sing and all three of them ran off to drink and listen to the song.  I solved this problem by killing the Bard, and letting the three girls deal with anyone who objected.  They are all set to Any Crime in AI Data (this is the setting for all Housecarls in the game), and they didn’t mind that I had put a sudden stop to the nights entertainment.  So I finished removing their base armor and re-assembled the girls for a final screen shot to show them wearing the Armor I gave them, you may notice the bodies on the floor.  The lighting in the Inn is horrible.  For a better view of what each of the girls looks like see the screenshots I took while we were outdoors.\r<br />\r<br />With the exception of the sex change operation, all I did was to give the Bards ApachiiSkyFemales Hair, got a hose and a bar of soap and made them wash the dirt off their faces (Its amazing how pretty Adrianne Avenicci [Whiterun Blacksmith] is if you do this to her).  I gave the Housecarls Ebony Mail Armor, because I like the way it looks.  The smaller Pauldrons seem more feminine to me.  If you want to enchant the armor yourself, it is all Vanilla Ebony with the Cuirass being Ebony Mail.  Any enchanted armor you give them will probably have to be better than what they are already wearing or they won’t wear it.  I also gave them weapons.  All are enchanted (06):  Swords, Raychel-Shock, Valerie-Frost and Gretchen-Fire.  Bow-also Shock and Fire (Valerie is a combatmage and shouldn’t have a bow since she casts Ice spike left handed).  Armor-Health, Gauntlets-OneHanded, Boots-Muffle and Helmet-Marksman (Raychel and Gretchen), Helmet-Destruction (Valerie) all armor and weapon stats are Ebony Vanilla.  The shock and fire enchants on the bows make Raychel and Gretchen deadlier at range, so I created an amped up Ice Spike spell for Valerie to compensate.  Note that if you use a clothing mod to remove the default outfit, and give them new armor you also have to give them clothing with that mod or the girls will sometime appear naked when not in combat, indoors or when sleeping (this could be creepy or hot, depending on your view of the subject). \r<br />\r<br />I glitched the helmets, making them circlets, so that they don&#39;t display, the Housecarls get the benefit and stats of a helmet, but you don&#39;t have to look at it.  Raychel has two Ebony swords because she fights csmercerfreymelee (this is changed from cshumanberserker because she sometimes swings her swords while too far away to hit her target, this is a bug in the game.  You may have noticed the Forsworn do the same when attacking you).  Valerie has one sword and casts Ice Spike left handed so take away any bow if she has one.  She fights cshumanmagic (this is as the Housecarl was made in Hearthfires).  Gretchen has one sword and a shield and fights cshumanboss1h (I changed this from cshumanboss2h because I wanted her to use a shield).  This allows you to choose which Housecarl fighting style you want if using a single Follower.  \r<br />\r<br />The Falkreath Bard, Lynn, does not voice out her initial greeting to you anymore because I changed her voice to FemaleEvenToned (the same voice Lisette uses).  If you have text enabled she will introduce herself as Llewellyn.  This is a one time event and not worth trying to fix.  If you already have the Bards in your house you won&#39;t even notice.  Lynn does not sing Ragnar the Red as Llwewllyn did, singing Dragonborn instead.  The Political situation in the hold determines which Age song will be sung.  So that if you gave Dawnstar to the Empire during the Season Unending quest, Oriella will no longer sing Age of Oppression even though you request it from her with her dialog praising you as a Stromcloak, singing Age of Aggression instead (this is not a bug in my mod but is a good reason to give the Empire Riften instead).  I assume that after completing the Civil War quests the same it true of all the Bards, and while I have played the Civil War through for both Empire and Stormcloak, I have not done so with Hearthfire installed.  All three bards sing the Tongues song after you have completed the main quest.\r<br />\r<br />I have incorporated my mod, Hearthfires Everyone Sleeps [ http://www.nexusmods.com/skyrim/mods/50402 ] into this mod as they overwrite each other.  The Steward will sleep in the upstairs double bed, the Housecarl will sleep in the first upstairs single bed, the Bard will sleep in the second upstairs single bed.  If you have a spouse he/she will sleep in the downstairs bedroom double bed with the adopted children in their beds.  If you don&#39;t have a downstairs bedroom the spouse will sleep in the upstairs double bed with the Steward (this could be creepy).  I don&#39;t know if you can adopt children to a home without a downstairs bedroom and I don&#39;t know what will happen if this is the case.  You might find the Bard and Housecarl standing next to the single beds looking at the sleeping children or vice versa (could be creepy).  Good reason to put in a downstairs bedroom.  If you appointed one of the Housecarls as a Steward, I don’t know what will happen.\r<br />\r<br />IF you experience Neck Gap issues it&#39;s because your save game thinks the character weighs something different than the weight in the mod because you installed the mod after you met the original NPC’s.  I have no idea why this happens, I didn’t change the NPC’s weight in the mod.\r<br />To fix this you have to use the setnpcweight command in console.  This only happens if you installed the mod over a house bard you have already met.\r<br />Open console ~\r<br />Left Click the NPC to display the RefID\r<br />setnpcweight XX (replace XX with the number from the list below).\r<br />\r<br />Lynn        40\r<br />Sonir        60\r<br />Oriella      10\r<br />Raychel    70\r<br />Valerie      70\r<br />Gretchen   60\r<br />\r<br />These are the default weights from Hearthfires.  I did experience neck gap on Oriella and this fixed it even after zoning.  Oriella visibly shrank when I did this.\r<br />\r<br />For Screen Shots I used;\r<br />\r<br />ApachiiHairFemales_v_1_3 by Apachii [http://www.nexusmods.com/skyrim/mods/10168].  Its the fourth download on her list and is necessary for this mod to work.  I asked and obtained her permission to use her work in my mods.\r<br />Extensible Follower Framework by Expired [http://www.nexusmods.com/skyrim/mods/12933]\r<br />Convenient Horses by Alek [http://www.nexusmods.com/skyrim/mods/14950]\r<br />Covereyes by mrLenski [http://www.nexusmods.com/skyrim/mods/4869]\r<br />Better Females By Bella Natural Edition by zzjay {CBBE Red Lips Version 1 and Normalmaps New CBBE} two separated downloads.  [http://www.nexusmods.com/skyrim/mods/26113]\r<br />\r<br />All screen shots were taken in Vanilla Armor/Clothing.\r<br />\r<br />Better Females By Bella Natural Edition, EFF, Convenient Horses and Covereyes are not used in this mod, just on my system when I took the screenshots.\r<br />\r<br />If you actually read this far, pat your self on the back…\r<br />\r<br />Enjoy…",
  "categoryId": "66",
  "version": "2.0",
  "author": "Dragonfire12",
  "createdUnix": "1391746673",
  "updatedUnix": "1468917535",
  "containsAdultContent": false,
  "uploadedBy": "Dragonfire12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095705",
      "name": "Hearthfire Girls",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4542",
      "fileName": "Hearthfire Girls-50840-1-0.7z",
      "uploadedUnix": "1391745422",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f85f19e2ca703f51500d50f9cad9fbb2a794fe545f653cb1abb15b2e7a554a2/analysis/1407922181/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Girls-50840-1-0.7z?fid=1000095705&ttl=1535832811&ri=8192&rs=8192&setec=ec76504fdb58373ae2f6d3f93705bb67"
    },
    {
      "fileId": "1000095706",
      "name": "Hearthfire Girls - FemaleCommander Voice",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Hearthfire Girls - FemaleCommander Voice-50840-1-0.7z",
      "uploadedUnix": "1391745578",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c70c5cad8b2412859e973b30f7271f1e3a09ddb07859f07d5e505aeb4b24c79d/analysis/1407922182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Girls%20-%20FemaleCommander%20Voice-50840-1-0.7z?fid=1000095706&ttl=1535832812&ri=8192&rs=8192&setec=3fdb61d15a5d11ceb9ca00d67aa101d0"
    },
    {
      "fileId": "1000099149",
      "name": "Hearthfires Everyone Sleeps Unofficial Hearthfire Patch version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hearthfires Everyone Sleeps Unofficial Hearthfire Patch version-50840-1-0.7z",
      "uploadedUnix": "1393613384",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8ff1733dc54f796cc315cf33e238ce509f989f7f014036c336865fb0187cb46a/analysis/1407954005/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfires%20Everyone%20Sleeps%20Unofficial%20Hearthfire%20Patch%20version-50840-1-0.7z?fid=1000099149&ttl=1535832812&ri=8192&rs=8192&setec=c7506c423c3f336d860f343fbf738343"
    },
    {
      "fileId": "1000213712",
      "name": "Hearthfire Girls Version 2.0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4525",
      "fileName": "Hearthfire Girls Version 2.0-50840-2-0.7z",
      "uploadedUnix": "1468917535",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0705fba95910b4d7a8c12c289593ec623d44da4b84b7a3b441cdf910240bc880/analysis/1468917544/",
      "changelogHtml": " Add Player Bed Ownership to the Steward so they will sleep in the main upstairs bed when using Unofficial Patches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Girls%20Version%202.0-50840-2-0.7z?fid=1000213712&ttl=1535832813&ri=8192&rs=8192&setec=de4be17ebf6753e53dccc974dd03d7c2"
    }
  ]
}