{
  "modId": 50890.0,
  "modName": "Kynes Peace - No Friendly Vampires",
  "summary": "Prevents vampires from becoming passive when Kynes Peace or Voice of the Sky are active.  Requires Dawnguard.",
  "descriptionHtml": "NOTE:  This fix is now incorporated in the Unofficial Dawnguard Patch.  If you use the UDP, you do not need this mod.  If you do not use the UDP, you can still use this fix standalone.\r<br />\r<br />\r<br />\r<br />\r<br />Requires Dawnguard.\r<br />\r<br />Have you ever noticed that since Bethesda released Dawnguard, vampires are now friendly when Kynes Peace or the Voice of the Sky magic effects are active?\r<br />\r<br />This is a bug, as vampires are not animals and it makes no lore sense for them to be rendered passive by these magic effects.  \r<br />\r<br />This mod will make vampires still aggressive when you shout Kynes Peace or have the Voice of the Sky as an active effect.\r<br />\r<br />This mod doesn&#39;t edit Kynes Peace or Voice of the Sky in any way, so is compatible with other mods that edit these effects.\r<br />\r<br />This mod does edit the vampires (as edited by the Dawnguard DLC) by removing the Prey Faction from them so may be incompatible with other mods that edit vampires.\r<br />\r<br />The way this mod works is by removing the prey faction from vampires.  I&#39;ve been playing with this mod for a while now, and haven&#39;t noticed any issues, but it&#39;s not known why Bethesda added this faction to the vampires in the first place, and it&#39;s possible that there may be unexpected side effects in terms of how these spawns interact with other types of spawns in combat. \r<br />\r<br />Images above courtesy of UESP.net under Creative Commons Attribution-ShareAlike 2.5 License.",
  "categoryId": "95",
  "version": "0.1",
  "author": "jackstarr",
  "createdUnix": "1391862072",
  "updatedUnix": "1391865547",
  "containsAdultContent": false,
  "uploadedBy": "jackstarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095899",
      "name": "Kynes Peace - No Friendly Vampires",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Kynes Peace - No Friendly Vampires-50890-0-1.zip",
      "uploadedUnix": "1391865547",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/acc46af3caaa145f945b335dd99f4cc36b1dce04cbdb7b84604d22fbe4cbfa63/analysis/1407924017/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kynes%20Peace%20-%20No%20Friendly%20Vampires-50890-0-1.zip?fid=1000095899&ttl=1535832886&ri=8192&rs=8192&setec=25c25f37d1343f8c8207d998d5e44d21"
    }
  ]
}