{
  "modId": 5090.0,
  "modName": "Rama_s Colorful Female_Male Dragonscale Dragon Light Armor",
  "summary": "Wearing this armor will make you happy :). This is a light-weight mod to make female light dragon armor (dragonscale) much prettier, and having more colors. File size is 579 KB, less than 1 MB. ",
  "descriptionHtml": "Another Mod by me: \r\n\r\nRama\\'s Perfect Female Skin Mod\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=5057\r\n\r\ncopy-paste the above line into your web-browser address bar to see my main mod :)\r\n\r\n------\r\n\r\n=============================================\r\nDragonscale Light Dragon Armor (Craftable) Mod Info\r\n=============================================\r\n\r\nUpdated Version 1.3\r\n\r\nAdded a colorful version of the Dragonscale Shield, see pics.\r\n\r\nThis download is just the shield, download version 1.2 below from the \\\"downloads\\\" section, the female and male, extra color version, for the rest of the set.\r\n\r\nReview information below for installation instructions.\r\n\r\n------\r\n\r\nUpdated Version 1.2\r\n\r\nFemale and Male Dragonscale Light Dragon Armor (all together in one file) \r\n\r\nwith _more color_\r\n\r\n(This is the only recommend version for everyone)\r\n\r\nIf you find the colors are too intense, then try the older versions.\r\n\r\nI realized that my original mod was based on my unusual monitor settings, the latest version uses standard monitor settings.\r\n\r\nI am keeping the older versions in case people want the option for a slightly less colorful version.\r\n\r\nI suggest you try this most recent version first, and if it is too colorful, try my older versions, \r\n\r\nremember the older male depends on the first female version.\r\n\r\n\r\nAnd if you want even MORE color, well ask me in the comments section :)\r\n\r\n---\r\n\r\nUpdated Version 1.1\r\n\r\nAdded male dragonscale armor (the Light Dragon Armor that comes with Skyrim and which you can craft if you retain the dragon bones and scales from defeating dragons).\r\n\r\nYou must download the female version as well to get the full male armor set changed.\r\n\r\n\r\nThe female version is complete unto itself.\r\n\r\n\r\nThis is a very small download size, so if it seems to download instantly, that is a good thing :)\r\n\r\n---\r\n\r\nPictures\r\n\r\nclick on the Images subsection, which is a mountain with numbers below it, and click on the tab in the upper right of the subsection that appears that says \\\"from users\\\"\r\n\r\nThanks go to N.M.I. for these pics :)\r\n\r\n---\r\n\r\nAdding Pics of Your Own\r\n\r\nIf anyone else wants to add pics, \r\n\r\nits the two-rectangle icon below the version number near top of this page\r\n\r\nI will verify your pics post-inspection which may take awhile depending on my schedule.\r\n\r\n\r\n\r\n---\r\n\r\nInstall/Uninstall\r\n\r\nThis is a risk-free mod, no original game files are modified.\r\n\r\nSee the instructions for the female dragon armor install/uninstall for more details\r\n\r\n:)\r\n\r\n---\r\n\r\nVersion 1.0\r\n\r\nRama\\'s Colorful Female Dragonscale Light Dragon Armor Mod\r\n\r\nThis is a very light-weight mod, of only 4 files and 579 KB (as a download), less than 1 MB.\r\n\r\nThe recommend version (1.2), which is the top-most file in the downloads section, uses 5 files and is still very small in size.\r\n\r\nThis mod is something I made because I thought the female dragonscale, the light dragon armor, was too dull in color.\r\n\r\nThis version is MUCH more colorful!\r\n\r\nThis mod also has more green in it, reminiscent of a real dragon.\r\n\r\nThe helmet is my personal favorite, it is filled with very nice colors.\r\n\r\nPlaying with this version of the dragon armor makes me happy every time I see it!\r\n\r\nEnjoy!\r\n\r\n---\r\n\r\nNote on the Pictures for this Mod: \r\n\r\nDepending on your monitor color settings and game settings your perception of the colors of my mod will vary, if you find you need a more colorful version do let me know :)\r\n\r\nFor less colorful, try the older files\r\n\r\n* * *\r\n\r\nSo please try my mod for yourself to see how it will look on your computer with your settings.\r\n\r\nI cannot show you pictures that will give you a completely accurate representation of how it will look on your machine, so try it out :)\r\n\r\nFortunately, my mod is easy to install/uninstall.\r\n\r\n:)\r\n\r\n<3\r\n\r\nRama\r\n\r\n* * *\r\n\r\nNo-Risk Install\r\n\r\nThis mod is easy to undo if you don\\'t like it.\r\n\r\nThis mod does not damage or alter any original installation files\r\n\r\n\r\n\r\n---\r\n\r\nTo Install\r\n\r\nCopy the zipped folder series, starting with \\\"Data\\\" into the _same directory as your TESV.exe file_, probably in:\r\n\r\nc:\\\\program files(x86)\\\\steam\\\\steamapps\\\\common\\\\skyrim\r\n\r\nTo get to the location I am describing, start by going to your computer\\'s main hard drive, probably C:\\\\ using My Computer, then click on the hard drive, then go to program files and follow the above path.\r\n\r\nThere might already be a Data folder in your main Skyrim directory, if you have any other mods. \r\n\r\nWhen copying the file structure for this mod, starting with Data, select the option to overwrite any duplicate files. \r\n\r\nIf you already have a modified version of the female dragonscale armor, see below for how to test this mod without  affecting your prior modified Skyrim.\r\n\r\nRemember there are only four files inside the series of folders in the zipped download, so selecting \\\"overwrite any duplicates\\\" will only effect a maximum of 4 (or 5 for version 1.2) files.\r\n\r\n\r\nSorry for the lack of nexus download manager support at present, you should learn to do these things directly though, it will become more important to be intimately familiar with your Skyrim file structure once the Creation Kit comes out.\r\n\r\nYou need to know how modding works yourself so you can undo anything other people\\'s mods do to your skyrim file structure, because they won\\'t always tell you how to undo the damage.\r\n\r\n---\r\n\r\nHow Modding Works\r\n\r\n* * *\r\n\r\nThis is essential information for you to know so that you are in charge of your Skyrim Reality. \r\n\r\n* * *\r\n\r\n\r\nOur friends at Bethesda were so nice to make modding so easy.\r\n\r\nBasically, any files you put into a folder called Data, in your root Skyrim folder where \\\"TESV.exe\\\" is located will be preferred by Skyrim when it launches.\r\n\r\nSkyrim dynamically checks the contents of your custom Data folder each time you load Skyrim.\r\n\r\nSo to see changes you\\'ve made to your Data folder you have to quit and re-launch Skyrim.\r\n\r\n\r\nTo undo any mods, you go into the Data file structure and delete the appropriate files.\r\n\r\n\r\nIf you don\\'t have a \\\"Data\\\" folder you can make one.\r\n\r\n\r\nMost likely you do have a Data folder if you\\'ve found this mod of mine :)\r\n\r\n\r\nThe reason mods can have conflicts is because sometimes mods modify the same files in the Data file structure, and Skyrim can only pick one version of that file to use at a time.\r\n\r\n---\r\n\r\nHow to Test a New Mod Easily, Wile Preserving Your Previous Modded Skyrim Settings\r\n\r\nIf you want to test a mod, rename existing files that you do not wish to overwrite permanently, and try the new mod that modifies those same files.\r\n\r\nIf you don\\'t like the new mod you tried, delete the files and rename the originals.\r\n\r\nFor example, if you already have a hypothetical file named filename.dds in your Data folder structure, you can rename it to filename.back and then try my mod which has its own version of filename.dds\r\n\r\nThis way, you can easily undo my mod by deleting the new filename.dds and renaming the backup that you made.\r\n\r\n---\r\n\r\nWhat Are .DDS Files?\r\n\r\nTo view/edit .dds files, download PAINT.net, it is free\r\n\r\n---\r\n\r\nHow Can I Access Skyrim\\'s Original Textures, Models/Meshes, and All other Game Data?\r\n\r\nTo extract files from Skyrim\\'s core .bsa files,\r\n\r\ngoogle search for \\\"FO3_Archive_Utility-34.zip\\\"\r\n\r\nor \\\"FO3 archive utility\\\"\r\n\r\nFO3 = FallOut 3\r\n\r\nThis is how you can view the entire file structure of all meshes, textures, and everything else for Skyrim, extract, and play with these files.\r\n\r\nThen move these files to the Data folder as I describe above to try your own mods.\r\n\r\n---\r\n\r\nCompatibility \r\n\r\nThis Mod is compatible with all Armor model/mesh modifying mods that do not actually change the textures as well.\r\n\r\nThis Mod is compatible with all other mods that have nothing to do with dragonscale armor.\r\n\r\nThis Mod is not compatible with any mods that modify the female dragonscale / light dragon armor textures.\r\n\r\n---\r\n\r\nTo Uninstall\r\n\r\n1. Navigate to your main skyrim dir where TESV.exe is located, probably  c:\\\\program files(x86)/steam/steamapps/common/skyrim/        (no x86 for XP users)\r\n\r\n2. Navigate to Data/Textures/armor/dragonscale\r\n\r\n3. delete these 4 files:\r\n\r\narmorf.dds\r\nboots.dds\r\ngloves.dds\r\nhelmet.dds\r\n\r\nif you\\'re using version 1.2, which I do recommend, also delete:\r\n\r\narmor.dds \r\n\r\n(the male version)\r\n---\r\n\r\nOther Mods Used in the pictures:\r\n\r\nBella\\'s Prettier Female Faces Mod\r\n\r\nMany thanks to her for enhancing my Skyrim experience!\r\n\r\n---\r\n\r\nVictory to You All!\r\n\r\nRama",
  "categoryId": "54",
  "version": "1.3",
  "author": "Rama",
  "createdUnix": "1325445302",
  "updatedUnix": "1325702677",
  "containsAdultContent": false,
  "uploadedBy": "evernewjoy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "15791",
      "name": "Rama_s Colorful Light Female Dragonscale Armor   _Enjoy",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "580",
      "fileName": "Rama_s Colorful Light Female Dragonscale Armor   _Enjoy-5090.zip",
      "uploadedUnix": "1325448905",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/544451293bd0fa423c2438fe84bde7235553ec0c43c9e744e3263c17610200db/analysis/1406575986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rama_s%20Colorful%20Light%20Female%20Dragonscale%20Armor%20%20%20_Enjoy-5090.zip?fid=15791&ttl=1535761566&ri=8192&rs=8192&setec=88408283ffce8188ecebcc254980a4b0"
    },
    {
      "fileId": "15925",
      "name": "Rama_s Colorful Light Male Dragonscale Armor",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "347",
      "fileName": "Rama_s Colorful Light Male Dragonscale Armor-5090.rar",
      "uploadedUnix": "1325500989",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1c773200bb932f1bb50dcec8ad6ce1572370b3d836aba1a847107443f756b9b/analysis/1406577186/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rama_s%20Colorful%20Light%20Male%20Dragonscale%20Armor-5090.rar?fid=15925&ttl=1535761566&ri=8192&rs=8192&setec=89ec81253c8a7d107a3cf8e8aba33d60"
    },
    {
      "fileId": "15943",
      "name": "Rama_s Colorful Light Female and Male Dragonscale Armor _ Extra Color",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "900",
      "fileName": "Rama_s Colorful Light Female and Male Dragonscale Armor _ Extra Color-5090.rar",
      "uploadedUnix": "1325509838",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a407f7943cd6344d4b9a9d7432c682e5b65e14627fccec93c1efd5686ab0d39c/analysis/1406577307/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rama_s%20Colorful%20Light%20Female%20and%20Male%20Dragonscale%20Armor%20_%20Extra%20Color-5090.rar?fid=15943&ttl=1535761567&ri=8192&rs=8192&setec=646055479560bc59ccbb0438d36363e4"
    },
    {
      "fileId": "16596",
      "name": "Rama_s Colorful Light Dragon Armor Dragonscale Shield",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "83",
      "fileName": "Rama_s Colorful Light Dragon Armor Dragonscale Shield-5090.rar",
      "uploadedUnix": "1325702677",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f02c36bc3cfdb7c117d777672d7b2c27c2fd5bce8cf38606450b7ec5347ed61/analysis/1406582466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rama_s%20Colorful%20Light%20Dragon%20Armor%20Dragonscale%20Shield-5090.rar?fid=16596&ttl=1535761567&ri=8192&rs=8192&setec=601cac78b3ecf4088b0e8e8301da41bf"
    }
  ]
}