{
  "modId": 50909.0,
  "modName": "The Ningheim Followers Patch",
  "summary": "Tweaks to the Ningheim Followers so they match their lore, raises level caps, aligns their skills and perk selections.",
  "descriptionHtml": "*The original file I uploaded for some reason was causing a CTD. I re-zipped the file and re-uploaded it, then downloaded it and installed the version posted here. Please accept my apologies if you downloaded and got a CTD after ward, just wasted several hours of my own life before I figured out it was a corrupt zip file* \r<br />\r<br />The Ningheim Race is easily my favorite custom race. Not only are they very attractive, they have functional powers that grow with the player.\r<br />If you are like me and play with the Ningheim followers, you may have noticed that their gear, skills, etc do not match their lore. I really wanted Mandei to be what she is supposed to be, a one handed light armor chracter, but she was really a heavy armor one handed character. This started out as just trying to fix Mandei (turned out to be an excercise in work-arrounds). Since I had to create an entirely new Data folder just to get CK to deal with this, I decided to go ahead and fix all of the followers and make it public.\r<br />\r<br />This mod simply tweaks all the followers so they have the skills according to thier lore, and will improve those skills when they level, and take perks appropriate to them. It also raises their level limit to 200. See below for full details of all the changes.\r<br />\r<br />\r<br />Tested with vanilla + all expansions, USKP, UFO, Hearthfire Multiple Adoptions, SkyRe, My Home is Your Home, Candle Pond Ranch Hearthfire Edition (custom home).\r<br />Everything seemed fine, spouse merchant works after she moves into your home (SkyRe users might have to wait 6 days before spouse has gold/wares).\r<br />\r<br />--REQUIRED FILES--\r<br />Latest version of Skyrim (yes, you need this).\r<br />The Ningheim Race (and all its required files too)\r<br />The Ningheim - followers\r<br />both at http://www.nexusmods.com/skyrim/mods/35474/\r<br />\r<br />\r<br />--Installation--\r<br />----------------\r<br />\r<br />****WARNING****\r<br />THIS WILL DEACTIVATE AND RESPAWN ALL OF THE NINGHEIM FOLLOWERS (not vanilla or other custom followers)&#33; YOU WILL LOSE YOUR NINGHEIM SPOUSE (you can get him/her back) AND ALL YOUR NINGHEIM FOLLOWERS&#33; REMOVE ANY STUFF FROM YOUR FOLLOWERS BEFORE INSTALLING THIS FILE. USE THE OPTIONal MARAIAGE RESET FILE TO GET RE-MARRIED. YOU CAN RE-COLLECT YOUR FOLLOWERS FROM WHERE YOU FOUND THEM ORIGINALY.\r<br />***************\r<br />\r<br />I only suggest manual installation. NMM installation is very buggy with this patch. NMM tends to uninstall the main files (it also does this when re-installing the original follower add-on), this is caused by file name issues in the original mod and there is nothing I can do about it.\r<br />\r<br />DO FIRST&#33;\r<br />Load your game\r<br />Move to an unmodified cell, this can be anywhere that is free of mods (if using a major overhaul like Requiem you should be alright).\r<br />Save your game (not quicksave, this is your &#34;failsafe&#34; save)\r<br />Remove all your stuff from your Ningheim followers.\r<br />Dismiss all your Ningheim followers.\r<br />Save your game again\r<br />Exit skyrim\r<br />Start skyrim and load your last save.\r<br />Save one more time (this is what is called a &#34;clean save,&#34; and should be free of any follower scripts).\r<br />Exit Skyrim and proceed with &#34;Getting Remarried&#34; or mod installation.\r<br />\r<br />--GETTING REMARRIED--\r<br />***YOU MUST DO THIS BEFORE YOU INSTALL THE MOD IF YOU ARE MARRIED TO A NINGHEIM FOLLOWER&#33;***\r<br />Download the optional Marriage Reset file.\r<br />Unzip and drop RM.txt into your skyrim main folder, this is the folder that conatains TESV, the creation kit if installed, and your SKSE_loader (Neither NMM or MO can install a file here).\r<br />Load your last save (the clean save from above)\r<br />Open the console (the &#34;~&#34; key), click on your spouse, and type &#34;bat RM&#34; with no quotation marks.\r<br />Exit the console, and target your ex-spouse and make sure all the spouse dialogues are missing (no home cooked meal, shop, etc).\r<br />Save one last time.\r<br />Exit Skyrim and proceed with Installation.\r<br />Once you are done with Installation, just head back to Riften and get a new Amulet of Mara from the marriage guy and you are free to marry again.\r<br />\r<br />If you prefer not to use the bat command, just open the RM.txt file. It has all the console commands you need listed. Just enter the console, click on your spouse, and type in each command manually.\r<br />\r<br />Manual:\r<br />Unzip and drop the &#34;The Ningheim - Followers.esp into your data folder, and let it overwrite the original.\r<br />\r<br />\r<br />--Uninstallation--\r<br />\r<br />Manual:\r<br />Unzip the original add-on and drop it in your Data files, and let it overwrite the existing file.\r<br />\r<br />\r<br />Changes common to all characters:\r<br />Disposition set to 85 from 35; they will actually like you now\r<br />Speed set to 125 from 100; they will keep up a bit better (This is a minor tweak, but really helps the heavy armor ones).\r<br />Max level set to 200 from 50;\r<br />Relationship to Player changed to ally\r<br />Morality Changed to Any Crime; you can be a canabal or join the theives guild\r<br />Marked as essential\r<br />\r<br />::Note on Aggression::\r<br />Many of these followers were set to &#34;Unaggresive.&#34; This is nice for lore purposes, but for playability they will just stand arround and watch you get killed unless they are attacked personally in many situtions.\r<br />\r<br />Alexia\r<br />Class changed from Assasin to Ranger; She will now favor light armor and bows\r<br />Gave her leather armor, gloves, boots, and 500 iron arrows\r<br />\r<br />Emil\r<br />Agression changed to Aggressive from Unagressive; he will engage the enemy now\r<br />\r<br />Ezau\r<br />Created custom combat class, he will balance one-handed, two-handed, light armor, and heavy armor equally, and put slightly more emphasis on destruction.\r<br />Added Flames to his spell list \r<br />\r<br />Farrah\r<br />Agression changed to Aggressive from Unagressive; she will engage the enemy now\r<br />Replaced her light armor with steel armor and raised her arrow count to 500\r<br />\r<br />Helena\r<br />increased her Health offset to 50 from 0\r<br />gave her an Elven Dagger\r<br />gave her Icespike\r<br />\r<br />Jared\r<br />Agression changed to Aggressive from Unagressive; he will engage the enemy now\r<br />\r<br />Keniel\r<br />Agression changed to Aggressive from Unagressive; he will engage the enemy now\r<br />Gave him a pair of steel daggers\r<br />\r<br />Mandei\r<br />Agression changed to Aggressive from Unagressive; she will engage the enemy now\r<br />Changed class from 1H Warrior to Rogue, she will now favor light armor, in adition to gaining block\r<br />Upgraded her hide armor to leather\r<br />Gave her an Imperial light shield\r<br />\r<br />Rhaveniel\r<br />Agression changed to Aggressive from Unagressive; she will engage the enemy now\r<br />Replaced her scaled cuirass with steel\r<br />Gave her an Imperial Shield\r<br />\r<br />Teclis\r<br />Agression changed to Aggressive from Unagressive; he will engage the enemy now\r<br />Increased his arrow count to 500\r<br />Gave him an Imperial Sword\r<br />\r<br />\r<br />\r<br />Thanks and Credits\r<br />Special Thanks to Seren4XX, HelloSanta,Urshi, and co who made the Ningheim Race.\r<br />http://www.nexusmods.com/skyrim/mods/35474/\r<br />Thanks to Ej on Yahoo Answers (of all places&#33;) who provided another user the right console commands to get remarried.\r<br />http://answers.yahoo.com/question/index?qid=20120107214548AAMdcsR\r<br />Thanks to all the modders who right tutorials on character creation and modders who take the time to answer questions. I was able to do all this with nothing but searching for the answers.\r<br />Thanks to Bathesda for making this posible in the first place.\r<br />",
  "categoryId": "34",
  "version": "1.0",
  "author": "joshua43214",
  "createdUnix": "1391895899",
  "updatedUnix": "1391895893",
  "containsAdultContent": false,
  "uploadedBy": "joshua43214",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095959",
      "name": "Get Remarried",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Get Remarried-50909-1-0.zip",
      "uploadedUnix": "1391895893",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6670e023205f5dd34568131ad3003bbe6184c15a7b1d1304c63e00ddff76f2cc/analysis/1407924490/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Get%20Remarried-50909-1-0.zip?fid=1000095959&ttl=1535832917&ri=8192&rs=8192&setec=3579e04fe2bbf1416ce67acf3f1c4cc9"
    }
  ]
}