{
  "modId": 50917.0,
  "modName": "Brutal swords",
  "summary": "A sword mod containing two different blades: The Brutal Sword (two handed) and the Brutal Short Sword (one handed, dual wield).",
  "descriptionHtml": "This mod adds two new swords and their forging recipes to the game: \r<br />\r<br />The Brutal sword: two handed greatsword \r<br />base damage= 20 (same as skyforge steel greatsword) \r<br />weight= 17 \r<br />\r<br />The Brutal Short Sword: one handed (meant to be dual wielded) \r<br />base damage= 14 (same as skyforge steel sword) \r<br />weight= 10 \r<br />\r<br />&#39;The Brutal Sword&#39; is a great sword crafted of steel, iron, corundum, and wood. It has all the stats of a Skyforge steel great sword and then some. Not too over powered but in the hands of a skilled two hander... it is devastating&#33;&#33; \r<br />\r<br />The Brutal Sword also comes with a back mount. I didn&#39;t create a scabbard because I didn&#39;t want to cover the blade, it looks better that way I think. I never understood why Bethesda didn&#39;t put some kind of visual back mount in the game, so I tried to come up with one that would fit every body type and not be too obtrusive. Its not perfect, but at least the sword isn&#39;t just floating in mid air&#33; \r<br />\r<br />&#39;The Brutal Short Sword&#39; is really meant to be dual wielded, but one will get the job done too. It has the same forging recipe as the Brutal Sword, just less materials. its stats are that of a skyforge steel sword give or take. Again, not too over powered and with a mean inner curve to the blade. It should dice enemies nicely. \r<br />\r<br />Steel smithing perk required. Swords will be listed under steel weapons",
  "categoryId": "55",
  "version": "1",
  "author": "Modelmode",
  "createdUnix": "1391911417",
  "updatedUnix": "1391911348",
  "containsAdultContent": false,
  "uploadedBy": "modelmode",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000095989",
      "name": "Brutal Sword",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5917",
      "fileName": "Brutal Sword-50917-1.zip",
      "uploadedUnix": "1391911348",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9bd1278b910136238fb4255e84afa665d11998716b9e6e2bbb353c709468c4da/analysis/1407924860/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brutal%20Sword-50917-1.zip?fid=1000095989&ttl=1535832939&ri=8192&rs=8192&setec=f590307704a6c2d9f6d845f879800bad"
    }
  ]
}