{
  "modId": 50935.0,
  "modName": "The Glorious Alchemy Mod(Old Version)",
  "summary": "THE GLORIOUS ALCHEMY MOD (OLD VERSION)\r<br />\r<br />Ever wonder why you can&#39;t cook a skeever or powder a mammoth tusk? Ever wish you could use ores and gems in potions like in Morrowind? This mod adds a variety of new ingredients, crafting ingredients and potion effects, all while making minimal changes to van",
  "descriptionHtml": "ATTENTION:\r<br />\r<br />This link will be discontinued: no new versions of the file will be posted here. The latest versions of this file will continue to be posted as Optional Files at http://www.nexusmods.com/skyrim/mods/50995/?, with the rest of my mods. The Glorious Alchemy Mod will however remain standalone, 100% modular to the rest of my work though designed to be used alongside it.\r<br />\r<br />This link will continue to stay up for reference only.\r<br />\r<br />\r<br />THE GLORIOUS ALCHEMY MOD\r<br />\r<br />Updated version released&#33;\r<br />\r<br />Ever wonder why you can&#39;t cook a skeever or powder a mammoth tusk? Ever wish you could use ores and gems in potions like in Morrowind? This mod adds a variety of new ingredients, crafting ingredients and potion effects, all while making minimal changes to vanilla Skyrim. Dragonborn DLC required.\r<br />\r<br />Mod Features:\r<br />\r<br />You can create the following alchemy ingredient with a Cooking Pot:\r<br />-Charred Skeever Hide, requires Skeever Tail and Salt Pile\r<br />\r<br />You can create the following alchemy ingredients at a Smelter:\r<br />-6x Powdered Mammoth Tusk, requires Mammoth Tusk\r<br />-2x Powdered Horker Tusk(NEW), requires Horker Tusk\r<br />-Crushed Gem(NEW), requires a flawless gem or two regular gems\r<br />-Ore Dust(NEW), requires quality ingots. Note that certain more magical ores require elemental salts to properly break down into a dust that can used in a potion. Breaking down Stalhrim requires knowing how to craft Stalhrim and Frost Enchanting perk, since you are extracting its magical essence.\r<br />-2x Bone Meal, requires Skull\r<br />-1x Trollbone Meal(NEW), requires Troll Skull\r<br />-1x Concentrated Chaurus Acid(NEW), requires Chaurus Chitin\r<br />-1x Boiled Hopper Cuttle(NEW), requires 4x Chitin Plate(from ash hopper)\r<br />\r<br />Ingredient effects vary based on what mineral is being used, and certain Ores and Gems have very powerful or unique effects. Unusual new effects include:\r<br />-Muffle(NEW)\r<br />-Dispel(dispels spells of magicka cost x or less, where x is 5 times the potion&#39;s power)(NEW)\r<br />-Reflect(reflects x% of damage received, where x is the potion&#39;s power)(NEW)\r<br />-Waterwalking\r<br />-Cure Poison\r<br />-Night Eye(NEW)\r<br />\r<br />Since this is in Beta, note that some of these effects may not work properly yet. I&#39;ve tested them and they&#39;ve all worked for me so far: let me know if you have problems.\r<br />\r<br />Ingredient effects have been set close to what similar ingredients did in Morrowind, Bloodmoon and Tamriel Rebuilt. Ingredients that are not found in any of those games have their own abilities set for them.\r<br />\r<br />Graphics:\r<br />\r<br />No special graphics right now. Trollbone meal uses Bone Meal skin, Powdered Horker Tusk uses Powdered Mammoth Tusk skin, Crushed Gems use Spawn Ash skin, Ore Dust uses Void Salts skin. Concentrated Chaurus Acid uses Spriggan Sap skin, Boiled Hopper Cuttle uses Ectoplasm skin. \r<br />\r<br />If there is a new clutter/ingredient graphics pack you would recommend for these items, let me know in the comments and I&#39;ll take a look.\r<br />\r<br />Changelog:\r<br />\r<br />Beta v0.1 to Beta v0.2:\r<br />\r<br />-removed Turn Undead effect(bugged so that it would not work)\r<br />-added Night Eye\r<br />-altered Trollbone Meal, Crushed Garnet, Mithril Dust, Silver Dust, Malachite Dust based on these changes\r<br />-removed a probably overpowered damage health effect from the Dwarven dust ingredient\r<br />-added two new ingredients with crafting recipes\r<br />-added a new ingredient to the Raven Rock alchemist list\r<br />\r<br />Installation:\r<br />\r<br />Download the file, extract it, and add it to your data folder  Activate it in your mod manager program, and start the game.\r<br />\r<br />Compatibility:\r<br />\r<br />Should be compatible with just about everything. The only master file information that is modified is the addition of certain new ingredients to the Merchant Rare Alchemy leveled lists from vanilla and Dragonborn. If this conflicts with a mod you have installed, make a bashed patch with The Glorious Alchemy Mod set to Relev.\r<br />\r<br />About the Screenshots:\r<br />\r<br />The cloak and backpack are from Frostfall, a wilderness survival mod that I would definitely recommend.",
  "categoryId": "94",
  "version": "Beta.v0.2",
  "author": "Archiphres",
  "createdUnix": "1391969878",
  "updatedUnix": "1391989902",
  "containsAdultContent": false,
  "uploadedBy": "Archiphres",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096147",
      "name": "Lolpwnts Glorious Alchemy Mod",
      "version": "Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Lolpwnts Glorious Alchemy Mod-50935-Beta.rar",
      "uploadedUnix": "1391969870",
      "modVersion": "Beta",
      "virusScanUrl": "https://www.virustotal.com/file/e54e40a09f76e6ee7e9b6b3427eabf98c80d2577fd13cbe58ec8ca676043a7f0/analysis/1407926167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lolpwnts%20Glorious%20Alchemy%20Mod-50935-Beta.rar?fid=1000096147&ttl=1535832975&ri=8192&rs=8192&setec=2c7d8dbb5ddea8945ee59a21cf2ccae1"
    },
    {
      "fileId": "1000096216",
      "name": "The Glorious Alchemy Mod",
      "version": "Beta.v0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Lolpwnts Glorious Alchemy Mod-50935-Beta-v0-2.rar",
      "uploadedUnix": "1391989902",
      "modVersion": "Beta.v0.2",
      "virusScanUrl": "https://www.virustotal.com/file/ce7852cab8c1d5b255fb34dc154308451c60709a0f4a650e3ffe0a2e567ad6cd/analysis/1407926890/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lolpwnts%20Glorious%20Alchemy%20Mod-50935-Beta-v0-2.rar?fid=1000096216&ttl=1535832976&ri=8192&rs=8192&setec=afad59f68807eb2741cf45c7a45ffb72"
    }
  ]
}