{
  "modId": 50931.0,
  "modName": "Nightingale Mask",
  "summary": "A hoodless version of the Nightingale Hood. Making just the mask part wearable with other head gear.",
  "descriptionHtml": "This is a very simple mod of the Nightingale Helmet which rips out just the face-covering part and makes it wearable with other hoods (like the ones from Immersive Armors, as shown in some of the pics), as well as regular helmets.\r<br />\r<br />Currently the mask is only obtainable through console commands. You&#39;ll need to use the help command (Example: help &#34;Nightingale Mask&#34;), and then the player.additem command with the number that was returned from the help command (example: player.additem 31000D62 1).\r<br />\r<br />The number will be different depending on how many mods you have installed and where this particular mod is in that list.\r<br />\r<br />The mask uses the standard texture that the regular nightingale hood uses, so it should be very easy to re-texture it. If you do a re-texture and want to share let me know and I will consider adding a few re-textures to the mod with different names so people can use them.\r<br />\r<br />I&#39;m pretty sure the mask will work for both male and female characters, but I&#39;ve only tested it on males so far.\r<br />\r<br />Special thanks to Hanaisse from TESAlliance for her excellent [url=http://tesalliance.org/forums/index.php?/topic/5639-creating-skyrim-armor-in-blender-tutorial-series]tutorial here[/url], and for her help in debugging the mod and with blender/nifskope information in general. I knew nothing of modding when I started and wouldn&#39;t have been able to do even a simple mod like this without her help.\r<br />\r<br />\r<br />",
  "categoryId": "54",
  "version": "1.0",
  "author": "Alurict",
  "createdUnix": "1391975960",
  "updatedUnix": "1391975881",
  "containsAdultContent": false,
  "uploadedBy": "Alurict",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096162",
      "name": "Nightingale Mask",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "318",
      "fileName": "Nightingale Mask-50931-1-0.7z",
      "uploadedUnix": "1391975881",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/96824fa5e337f71275e8867275ff42007723c3f811c0764b3f094ded85047c4e/analysis/1407926463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nightingale%20Mask-50931-1-0.7z?fid=1000096162&ttl=1535832970&ri=8192&rs=8192&setec=83c87ee7410932bdba33ef4b816789ac"
    }
  ]
}