{
  "modId": 5094.0,
  "modName": "Skyrim Japanese Translation",
  "summary": "A Gaijin&#39;s Perspective on the Skyrim Japanese Translation Project",
  "descriptionHtml": "[u][b]A Gaijin&#39;s Perspective on the Skyrim Japanese Translation Project[/b][/u]\r<br />\r<br />[b]If you&#39;re not Japanese, learning Japanese and don&#39;t have a Japanese boy/girl friend you will probably find the following information boring and/or useless.[/b]\r<br />\r<br />What languages will the next (potential) blockbuster game be translated into? And will they do a decent job of it? I imagine that gamers who don&#39;t happen to have English as their first language get to ask themselves that question quite often.\r<br />\r<br />Lucky Japan, then, because Skyrim was not only [url=http://elderscrolls.jp/]translated into Japanese[/url] they even included full voice acting for the Japanese audience. (Oblivion didn&#39;t fare so well)  By all accounts the translation was pretty decent as well ... well, mostly[1]. So you might be surprised to know a lot of Japanese players went out of their way to get the English version of the game and there&#39;s [url=http://www18.atwiki.jp/skyrim_jp/pages/1.html]a thriving project[/url] underway to translate it so they can play in English with Japanese subtitles.\r<br />\r<br />[1] See [url=http://ssgamess.blog36.fc2.com/blog-entry-4312.html]this video[/url] at 3:00 for what happens to an English song when its mangled translated corpse is given to a Japanese voice actor. You can catch the rest of the series [url=http://topicscollector.livedoor.biz/archives/6505988.html]here[/url].\r<br />\r<br />So, why buy the English version? One big reason is MODs. The exe in the Japanese version is different, and most mods just won&#39;t work. There are also concerns about further updates. It is not uncommon for foreign language versions to be updated later, or for foreign language updates to be dropped entirely. The PC version of Japanese Skyrim [url=http://www.bethsoft.com/jpn/news/20111208.html]isn&#39;t even out quite yet[/url]. I think the other reason is the same reason that die-hard anime fans prefer Subs to Dubs - Listening to the original language is &#39;cool&#39;.\r<br />\r<br />So where do I come into this picture? Well, I don&#39;t. Not really. I&#39;d like to suggest corrections to some of the translations but the bulletin board where the translators hang out[2] is effectively &#39;Japanese only&#39;. Japanese forums, wikis, blogs and (the big one) 2ch tend towards wide-ranging IP and proxy bans. The stated reason is usually &#39;to deter spammers&#39;. \r<br />\r<br />As I have not been able to make any useful contact with the Japanese Skyrim translation community I&#39;m uploading a file with my suggestions here. Note that I am [b]not a native speaker of Japanese[/b] so I am only making suggestions where it seems that the English text may have been misunderstood. Any Japanese text I have written may [b]sound odd[/b], or just be plain [b]wrong[/b]. I would welcome suggestions and/or corrections in the comments for this page or by PM.\r<br />\r<br />[b]UPDATE: The manager of the Skyrim translation BBS[2] added me to the host whitelist so I can now post there. Thank you&#33;[/b]\r<br />\r<br />[2] http://jbbs.livedoor.jp/game/53788/\r<br />\r<br />[b]koko dewa ro-maji shika kakenai node, nihonjin no raikyaku wa [url=http://www.thenexusforums.com/index.php?showtopic=514635]kochira e douzo[/url]. (utf-8)[/b]",
  "categoryId": "28",
  "version": "0.07",
  "author": "ptbptb",
  "createdUnix": "1325449873",
  "updatedUnix": "1325933502",
  "containsAdultContent": false,
  "uploadedBy": "ptbptb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17482",
      "name": "skyrim_trans007",
      "version": "0.07",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "591",
      "fileName": "skyrim_trans007-5094-0-07.zip",
      "uploadedUnix": "1325933502",
      "modVersion": "0.07",
      "virusScanUrl": "https://www.virustotal.com/file/5d6e1adced5d7fc8825620d2d8e6f8fe0667bec04361474a69af657d797bc49c/analysis/1406590203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyrim_trans007-5094-0-07.zip?fid=17482&ttl=1535761573&ri=8192&rs=8192&setec=f3e3130421a62d63aac11aa04fbfb997"
    }
  ]
}