{
  "modId": 50940.0,
  "modName": "Dawnguard NPC and Creatures Overhaul",
  "summary": "This mod was added by request. I have adjusted the stats of many of Dawnguards NPCs and creatures. From The Reaper pf the Cairn, to Lord Harkon himself, It also adds a few conjuration spells that allows you to summon Vyrthurs Ancient Frost Atronachs, and the Boneyard Keepers from the Soul Cairn.",
  "descriptionHtml": "This mod was added by request. I have adjusted the stats of many of Dawnguard&#39;s NPCs and creatures. It also adds a few conjuration spells that allows you to summon Vyrthur&#39;s Ancient Frost Atronachs, and the Boneyard Keepers from the Soul Cairn.\r<br />\r<br />Again, I re-iterate. This mod was simply added by request of a certain user. It was originally meant only as a custom mod for myself alone, and as such, it constructed to suit my tastes. Many of Dawnguard&#39;s bosses have been buffed up. \r<br />\r<br />In short: If you want a simple mod that tweaks the stats of many of Dawnguard&#39;s new additions, then you may like this mod. I have balanced them around adept and expert, and you shouldn&#39;t really notice a big difference[as a good balanced mod should do.] No comment on Legendary as I do not play it and did not balance for it.\r<br />\r<br />If you already have an overhaul that edits the NPCs DIRECTLY, or in general have a crap-ton of mods... then this may not be for you... Because again, this mod was never intended for the public. It started as an experimentation for me, and I&#39;ve kept it since. It works perfectly fine for me. But every mod-user has different mods, so please take this into consideration.\r<br />\r<br />\r<br />And if you have constructive feedback, then of course, I am more then interested in hearing it. \r<br />\r<br />\r<br />Notable changes:\r<br />\r<br />-Harkon&#39;s NPC and VL form are more durable. His Vampire Lord form will take a big punch, so you better be damn ready to fight him.\r<br />\r<br />-Arch-Curate Vyrthur is buffed, is wearing an enchanted Ancient Falmer Crown, wields a unique and completely separate version of Chillrend with it&#39;s own enchantment called Falmer&#39;s Retribution. He has a freeze power with a cool-down of approx 2 minutes before re-cast. He also has his own unique frost spells that will destroy anything that has a minor resistance to frost let alone a weakness.\r<br />\r<br />-Durnehviir has been buffed. \r<br />\r<br />-Valerica summons Wrathmen. She also can cast Vampiric orbs from her right hand.\r<br />\r<br />-The Boneyard Keepers are very, powerful.[more powerful than Lurker Vindicators and Frost Giants]\r<br />\r<br />-The Reaper is significantly buffed to like 500% of his usual bug-tastic combat. I have given him a proper Combat AI that actually allowed him to fight properly. His poison vapor is deadly, and he has a unique Headsman&#39;s Axe called Axe of The Reaper, complete with it&#39;s own unique enchantment. He has comparable health to an Ancient Dragon. Loot his ghostly pile of remains for his axe, and the ability to summon the Boneyard Keepers for yourself&#33; You can also get a tome that allows you to Summon The Reaper for a few minutes once a day&#33;\r<br />\r<br />-Bonemen and Wrathmen[normal and summoned] now exclusively use bound weapons.[mystic] They are other-worldly undead and they deserve other-worldly weapons. And they look bad-ass and appropriate with them too&#33; \r<br />\r<br />-That a-typical Falmer Warmonger at the Forgotten Vale that wields Auri-El&#39;s sacred holy shield? Yeah, I&#39;ve made him WORTHY of wielding Auri-El&#39;s sacred and holy shield. He is now called Falmer War-Hero, and he will kick your ass. If you fight him at a low-level, you are going to have a bad time. If you fight him alone, you are going to have a bad time. If you wield Wuuthrad, you are still going to have a bad time.\r<br />\r<br />-Becoming a Vampire Lord might also allow you to have 5 summons/resurrect thralls.[I&#39;m not entirely sure on this...] With this, you also get a new spell to use in human form[because I failed miserly when I tried adding it to the Vampire Lord formlist.] It is an expensive conjuration spell that will summon 3 undead minions which are as follows: 2 schmucks, and one bad-ass Dragonbone wielding 7&#39;11 ft tall Skeletal commander.[his stats are on-par with a low-level Draugr Death Overlord.] Which goes perfectly with your Vampire Lord being able to summon 5 minions&#33;[assuming it works] If not, then you can always download one of those simple unlimited summon mods out there. If you do not want to download one of them, then I have a custom perk that you can add to yourself with console commands: player.addperk xx0e9380 - xx = your load order. So if it&#39;s the fourth in your list then it would be like 040e9380. Or you can just console command : help &#34;multiple summons&#34; and presto-bingo. The code will be listed there. Don&#39;t forget the quotes.\r<br />\r<br />\r<br />-And a few other stuff that I cannot re-call off the top of my head. Anyway, nothing really fancy here, so there should not be any conflicts other than with mods that might happen to edit any NPC I have edited directly. Again, this mod was never originally intended for mainstream use, it was originally only intended for my tastes. \r<br />\r<br />\r<br />INSTALL\r<br />\r<br />Use the Nexus Mod Manager Download feature please.\r<br />\r<br />\r<br />[i]How do I install it manually??[/i]\r<br />\r<br />I have no idea.\r<br />\r<br />\r<br />UNINSTALL\r<br />\r<br />Let Nexus Mod Manager do it&#39;s job. Simply disable the mod, and remove if you so choose.",
  "categoryId": "79",
  "version": "1",
  "author": "Velehk Sain",
  "createdUnix": "1391985244",
  "updatedUnix": "1391985176",
  "containsAdultContent": false,
  "uploadedBy": "Velehk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096197",
      "name": "Dawnguard NPC Overhaul BETA",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "105",
      "fileName": "Dawnguard NPC Overhaul BETA-50940-.7z",
      "uploadedUnix": "1391985176",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7c08eb7f982f66f6f60820c2c8a6225994aabf97106a147d2ec95b072f2a9c58/analysis/1407926836/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnguard%20NPC%20Overhaul%20BETA-50940-.7z?fid=1000096197&ttl=1535832981&ri=8192&rs=8192&setec=3346c7d1edc36fbcb68bacabe5cb95c2"
    }
  ]
}