{
  "modId": 50996.0,
  "modName": "Quality Leather Armour Addon for SkyRe",
  "summary": "I added a bunch of armours to SkyRe&#39;s Quality Leather Armour system.",
  "descriptionHtml": "NEW&#33;: I got permission from hothtrooper44 to reference assets from the Immersive Armours mod (http://www.nexusmods.com/skyrim/mods/19733), so I made an Immersive Armours addon pack for this mod, including the barbarian, barbarian hero, mercenary, primitive nord, shaman, and ranger (just the torso and head pieces, because the gloves and boots use the ordinary leather armour appearance) sets, plus the Falkreath crown (I took one look and thought it would be perfect for a shaman/druid type). I&#39;m not redistributing the assets, however, so you&#39;ll already have to have the Immersive Armours mod in order for the addon pack to work. I would like to thank hothtrooper44 for his hard work, and for allowing me to reference it for my own mod.\r<br />\r<br />This mod is for T3nd0&#39;s Skyrim Redone (at http://www.nexusmods.com/skyrim/mods/9286) and adds a few armours to his quality leather armour system. You know, that stuff you can make if you have the Leathercraft and Gatherer perks, out of quality leather and quality leather strips made from quality pelts obtained from... oh you get the idea.\r<br />\r<br />This doesn&#39;t make a lot of mechanical changes. Its primary purpose is to add new visual variations with quality leather armour stats (and requirements, and crafting costs) for players of hunters, rangers, barbarians, Forsworn wannabes, highwaymen, etc. who want to represent later into the game when the low-end sets are really losing steam. The biggest mechanical thingamajigs I got up to is that the fur and Forsworn sets use the keywords that enable Masquerade, and I also added the hide shield, meaning there is now a quality leather shield where there wasn&#39;t before. Otherwise it&#39;s just like the existing quality leather armour except for appearance. It counts as leather for things like its special effect (frost/fire resistance) and set perks.\r<br />\r<br />The sets I added in the vanilla addon are as follows: Hide (including the hide shield and the studded cuirass, for a total of six pieces), Forsworn (all four pieces), fur (including all four cuirass variants, for a total of seven pieces), and two pieces from the Stormcloak set (just the fur boots and fur gauntlets, and because I didn&#39;t port the whole set, I didn&#39;t add the Masquerade-enabling keywords). It&#39;s pretty modest, but maybe I&#39;ll get to add packs for some armours from other mods one of these days.\r<br />\r<br />This mod *does* include crafting and tempering recipes, of course, and I also tested meltdown recipes (I know there&#39;s a bug where only one variant of the fur cuirass can be melted down, but it&#39;s not my bug--it&#39;s there for the regular cuirasses as well--and you&#39;re not going to tear up an item worth 445 septims for three leather strips anyway). What I didn&#39;t do was test this with beast races, but they should work unless I managed to mess something up. Hopefully I didn&#39;t do that. If I did drop me a line and I&#39;ll see if I can&#39;t fix it.\r<br />\r<br />REQUIREMENTS: T3nd0&#39;s Skyrim Redone (http://www.nexusmods.com/skyrim/mods/9286), though I can&#39;t seem to get the required-files page to actually, like, add it. Right now I don&#39;t have anything up that directly uses DLC assets, *but* the version of SkyRe I made this to work with has Dawnguard and Dragonborn as masters, and thus so does this mod. I&#39;m not quite prepared to fool around with trying to peel those off, and if you&#39;re using SkyRe, you *probably* have the DLCs anyway. If you&#39;re using the Immersive Armours addon pack, you will *also* need the Immersive Armours mod (http://www.nexusmods.com/skyrim/mods/19733).\r<br />\r<br />INSTALLATION: \r<br />I personally recommend Mod Organizer (http://www.nexusmods.com/skyrim/mods/1334). Just download it and have Mod Organizer install it. It&#39;s just an .esp file (well, and notes), nothing else. Make sure the .esp comes after SkyRe_Main in the load order, of course. \r<br />\r<br />If you really want to install it manually, you can probably just drop the .esp into your data folder and turn it on in the Skyrim launcher (it should still come after SkyRe_Main).\r<br />\r<br />UNINSTALLATION:\r<br /> You can probably just disable/delete the .esp, but if you want to be on the safe side, you may want to make a save file in which you don&#39;t have any of the items this mod adds first.\r<br />\r<br />I would like to thank Bethesda for making TESV: Skyrim, and T3nd0 for making Skyrim Redone. Without them and their work this mod never would&#39;ve happened, either. I would also like to thank hothtrooper44 for Immersive Armours, without which my Immersive Armours addon pack here would not have been possible. I&#39;ll also thank unuroboros for making Hunterborn, since I just uploaded a Hunterborn-compatible version. (But while it says it&#39;s for Hunterborn, and I made it because someone asked about this mod&#39;s compatibility with Hunterborn, it doesn&#39;t actually use anything from Hunterborn, it just removes the Gatherer perk requirement from the crafting recipes and moves them to the tanning rack. So please don&#39;t sue me unuroboros.)",
  "categoryId": "54",
  "version": "1",
  "author": "Allison W",
  "createdUnix": "1392100549",
  "updatedUnix": "1392525480",
  "containsAdultContent": false,
  "uploadedBy": "Allison W",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096462",
      "name": "SkyRe Quality Leather Vanilla Addon",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "SkyRe Quality Leather Vanilla Addon-50996-1.zip",
      "uploadedUnix": "1392100351",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/44b94bfdec1f0a39ee86c390d83d76249bd69ef4800ee660fc0cc0c681328f31/analysis/1407928884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe%20Quality%20Leather%20Vanilla%20Addon-50996-1.zip?fid=1000096462&ttl=1535833074&ri=8192&rs=8192&setec=066aed33608d99f884e03c591352f5ba"
    },
    {
      "fileId": "1000096533",
      "name": "SkyRe Quality Leather Vanilla Addon for Hunterborn",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "SkyRe Quality Leather Vanilla Addon for Hunterborn-50996-1.zip",
      "uploadedUnix": "1392141988",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b1172d046e6187d27bbc469ca19a9a027094402a6b47778b4aff79cdfa1982c9/analysis/1407929353/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe%20Quality%20Leather%20Vanilla%20Addon%20for%20Hunterborn-50996-1.zip?fid=1000096533&ttl=1535833074&ri=8192&rs=8192&setec=f6b9cffc901f3a490f46c427467237ec"
    },
    {
      "fileId": "1000097282",
      "name": "SkyRe Quality Leather Immersive Armours Addon",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "SkyRe Quality Leather Immersive Armours Addon-50996-1.zip",
      "uploadedUnix": "1392525369",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/dd41b0e41af0c317560cfbc95de1225c7a5ee4b60713bcb0e9535c990d98d053/analysis/1407935669/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe%20Quality%20Leather%20Immersive%20Armours%20Addon-50996-1.zip?fid=1000097282&ttl=1535833075&ri=8192&rs=8192&setec=9aaf4a75348e79ede46f16adfc05c7c6"
    },
    {
      "fileId": "1000097283",
      "name": "SkyRe Quality Leather Immersive Armours Addon for Hunterborn",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "SkyRe Quality Leather Immersive Armours Addon for Hunterborn-50996-1.zip",
      "uploadedUnix": "1392525480",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/887a0dc9ea5161c76142d577a752ca222975833ae30f5f76939e2dcb70af2ef8/analysis/1407935670/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe%20Quality%20Leather%20Immersive%20Armours%20Addon%20for%20Hunterborn-50996-1.zip?fid=1000097283&ttl=1535833075&ri=8192&rs=8192&setec=a7bb14c928cbabd061a86098b51ef940"
    }
  ]
}