{
  "modId": 50995.0,
  "modName": "Unofficial Morrowloot-Skyrim Overhaul",
  "summary": "Unofficial Morrowloot-Skyrim Overhaul, an unofficial expansion for Morrowloot:<br />Greatly improves countless aspects of the game: brings Morrowloot to the expansions, creates a game world rewarding of exploration, rebalances armor, weapons, perks and ingredients without changing the feel of the game. New spells, hand placed secrets, immersive NPC",
  "descriptionHtml": "[size=3][b][color=#C00000]INTRODUCTION[/color][/b][/size]:\n<br />\n<br />Have you ever wondered what legends might be hidden beneath the snow of Skyrim? What dark secrets are contained within Herma-Mora's realm of Apocrypha? And ever found the game world you were given to be lackluster?\n<br />\n<br />The [b][color=#C00000]Unofficial Morrowloot-Skyrim Overhaul[/color][/b] changes all that. From items stats to leveled lists to strength of bosses, Skyrim is rebuilt into a world where exploration is highly dangerous, yet highly rewarded.\n<br />\n<br />Trainwiz's mod Morrowloot is the inspiration and the starting point for this Skyrim Overhaul. In fact, Morrowloot is already included in the .esp. While Morrowloot simply modifies leveled lists in the vanilla game to be more static and places artifacts, this Skyrim Overhaul changes the balance of the game to inherently encourage and reward the hunt for treasure and desire to slay dangerous enemies.\n<br />\n<br />The features of this mod are countless. They are listed by category: the main file modifies the vanilla game and Dragonborn, while the Dawnguard and Hearthfire files specifically modify those expansion.\n<br />\n<br />[size=3][b][color=#C00000]SHORT DESCRIPTION:[/color][/b][/size]\n<br />\n<br />UMSO makes Skyrim more immersive, less scaled, and a more worthwhile game experience while keeping things as vanilla as possible. It de-scales almost all loot and monsters, hand places new items, expands Skyrim with obscure lore and new unique bosses and encounters, makes npcs who should be powerful much more powerful, properly balances items, smithing, alchemy and magic, adds new lore-friendly items, smithing, alchemy and magic, fixes perks, enchanting and civil war forts(if you use the add-ons). New content is completely integrated into the world.\n<br />\n<br />UMSO's modular add-ons are completely standalone, but using them all together works just great too!\n<br />\n<br />UMSO includes Morrowloot, complete with Morrowloot's items: note that some items in Morrowloot have been moved to new locations or modified. Use Bashed Patch Leveled Lists for proper merging. Throw Frostfall and some cloak mods in there too for best gameplay experience.\n<br />\n<br />For more details, browse the TL;DR below. Or just play it and figure it out as you go.\n<br />\n<br />[size=3][b][color=#C00000]VERSION 1.73, UMSO: DRAGON EDITION HAS BEEN RELEASED![/color][/b][/size]\n<br />\n<br />TO INSTALL VERSION 1.73, REPLACE THE OLD FILES WITH THE NEW ONES IN YOUR DATA FOLDER, AND REMEMBER TO MAKE A NEW BASHED PATCH(ESPECIALLY WITH OTHER LEVELED LIST MODIFICATIONS)\n<br />\n<br />UNINSTALL MORROWLOOT OR MORROWLOOT 4E WHEN YOU INSTALL 1.72: MORROWLOOT IS NOW INCLUDED IN THE UMSO .ESP FILE, AND THE .BSA HAS BEEN BROUGHT ALONG AS WELL! UMSO IS NOW FULLY MERGED WITH MORROWLOOT, AND HAS 4E-STYLE CRAFTING!\n<br />\n<br />VERSION 1.73 HAS NEW MESHES AND TEXTURES, THANKS TO A VARIETY OF HELPFUL MODDERS: MERGE THE MESHES AND TEXTURES FOLDERS INCLUDED WITH THE FILE WITH THE MESHES AND TEXTURES FOLDERS FOUND WITHIN THE SKYRIM DATA FOLDER: FAILURE TO ADD THESE MESHES AND TEXTURES PROPERLY WILL RESULT IN CRASHES FROM MISSING ITEM MODELS\n<br />\n<br />v1.73 Changelog:\n<br />-rebalanced Dragons and Bandit Chiefs to not be as overwhelming for low level players\n<br />-assigned stronger Dragons to remote dragon lair locations\n<br />-added new types of Dragons and skins for existing unique dragons\n<br />-moved glass, daedric, stalhrim equipment to better locations\n<br />-added more high level equipment and artifacts\n<br />-rebalanced artifacts and unique items in line with standard weapons\n<br />-fixed several minor issues, such as Kodlak Whitemane having his ebony armor lootable at the wrong time\n<br />-added some generic NPCs to places untouched so far, such as herdsmen with cattle and goats\n<br />-added or updated several enemies, including Olaf One-Eye, to have more unique equipment\n<br />-added a few more immersive moments such as ship burial sites and a new book\n<br />-fixed missing tags on Dawnguard plugin and cleaned mods(added 1.71)\n<br />-removed useless facegen textures accidentally included from another mod(added 1.72)\n<br />-fixed bug where certain Damage Attribute effects would disappear without being cured(added 1.73)\n<br />-fixed several other minor bugs(added 1.73)\n<br />-added compatible version with Galandil's Holds: the City Overhaul\n<br />\n<br />[color=#C00000][b][size=3]Table of Contents[/size][/b][/color]:\n<br />[list=1]\n<br />[*]Leveled Lists\n<br />[*]Hand-Placed Items\n<br />[*]Level Scaling\n<br />[*]Boss Battles\n<br />[*]Item Crafting\n<br />[*]Magic\n<br />[*]Weapons and Armor\n<br />[*]Perks\n<br />[*]Civil War\n<br />[*]Appendices\n<br />[/list]\n<br />[color=#C00000][size=3]Leveled Lists[/size][/color]:\n<br />\n<br />This is, of course, one of the big ones. Most high level items are removed from all leveled lists. You will not find Glass, Ebony, Stalhrim, Dragonbone or Daedric loot in random chests. Such items will always appear in hand-placed locations, or carried by wealthy people or high level enemies that would realistically have access to them.\n<br />\n<br />Dwarven items are found in Dwarven ruins. Orcish items are carried by Orcs. Elven items are predominantly used by Elves. Ebony is carried by the wealthy or by powerful Draugr. Daedric items are extremely rare: there are only two sets of unenchanted Daedric armor in the entire world. Glass is also quite rare, as it is primarily found in Morrowind, and this game is set in Skyrim. High level robes are also no longer in random chests; there are lots of them scattered about, however, used by powerful wizards and vampires. These changes are the same as those found in Trainwiz's Morrowloot, except broadly encompassing almost every aspect of the game.\n<br />\n<br />Existing leveled lists are filled with a wider variety of basic equipment, however, including chainmail and round shields(generic versions of Guard equipment). There is a much wider variety of common-styled items available in random loot.\n<br />\n<br />[color=#C00000][size=3]Hand Placed Items[/size][/color]:\n<br />\n<br />UMSO has countless interesting items scattered across the world. Many of these have stories behind them the player can discover. Lots of them have unique appearances and effects, and many are artifacts of great power. Artifacts from past games include:\n<br />-Skullcrusher\n<br />-Daedric Crescent    \n<br />-Lord's Mail    \n<br />-Scourge    \n<br />-King Orgnum's Coffer    \n<br />-Fang of Haynekhtnamet    \n<br />-Fists of Randagulf       \n<br />-Dragonbone Cuirass[i]      \n<br />[/i]-Boots of Blinding Speed\n<br />-Vampiric Ring\n<br />-Eleidon's Ward\n<br />-Stendarr's Hammer\n<br />-Cyrus' Saber\n<br />-Hopesfire\n<br />-Wraithguard\n<br />-Sunder\n<br />-Seht's Legs\n<br />-Threads of the Webspinner\n<br />-Ice Blade of the Monarch\n<br />-Goldbrand\n<br />-Hrormir's Icestaff\n<br />-Apotheosis\n<br />-Shadowfang\n<br />-Mace of Aevar Stone-Singer\n<br />-Robe of Drake's Pride\n<br />-Spear of the Snow Prince\n<br />\n<br />Compared to basic Morrowloot, UMSO has somewhat higher \"rare item\" concentration. Morrowind had high level gear be slightly more common than it is in Morrowloot: of course, expansions were required to gain access to all the Daedric pieces unless you succeeded betraying one of the game's most important NPCs. A new suit's worth of unenchanted Daedric and Ebony, as well as some new Glass, is scattered across the world: all the Daedric items placed are found in the expansions only, and even then are few and far between, since Daedric is so incredibly rare. Glass items tend to be found in the possession of Dunmer nobles(Dragonborn) and very rarely in Dwemer ruins. Ebony tends to be in the possession of Draugr(ebony wielding Draugr were in the original game, but Trainwiz took them out). Nevertheless, the items are still very rare and you are only likely to find them in dangerous areas or well-locked chests. Enchanted Stalhrim and Daedric items have unique names, rather than generic ones. Additional high level robes have been added as well, since very few were to be found in the original Morrowloot.\n<br />\n<br />Lots of items in Morrowloot have been moved elsewhere, or replaced with more lore-fitting items. Many of them have been placed behind locks, or in more fitting hiding places related to where they were before: lots of items in Morrowloot are placed in the world haphazardly, and are very easy to acquire as long as you know the right spot.\n<br />\n<br />Dragonbone and Dragonscale items, being mainly a player crafting thing, are quite sparse. There is no complete unenchanted set of Dragonbone out there: you will have to make it yourself. Dragonbone weapons... well, you can figure it out if you want to acquire them. But you'll be searching for a long time. These items are all within lore-friendly places.\n<br />\n<br />\"But aren't you adding too much?\", you might say? I don't believe so. Morrowind expansions added many more opportunities for good loot, and since I'm applying Morrowloot leveling to the expansions and generally increasing difficulty in many dungeons, the rewards will still be there, you will still have to search, they will still be sparse. About as rare as in Morrowind. And you will probably never find some of the new items without cheating.\n<br />\n<br />Many items such as the Nightingale Armor and Miraak's mask, items that were leveled in the game originally, only spawn at their highest level, making them much more worthwhile, powerful, and consistent.\n<br />\n<br />Certain Holds prefer certain types of items. For example, Winterhold prefers furs and bearskin, while Eastmarch's denizens have a thing for troll skulls and mammoth tusks. The brutish-looking Ringmail is an uncommon style found occasionally in the southern parts of Skyrim.\n<br />\n<br />And remember: high quality items are usually found where you would expect to find items of that type.\n<br />\n<br />[color=#C00000][size=3]Level Scaling[/size][/color]:\n<br />\n<br />Enemies only rarely scale to your level. The \"Encounter Zone\" level of many areas has been set to a specific, unchanging value. This means that enemies and loot that scale to your level will always consider your level to be high or low whenever you are in those areas. In addition, animals out in the wild are mostly random: it is possible to encounter Sabre Cats at level 1. To counter\n<br />\n<br />By changing the Encounter Zones, this mod melds perfectly with Morrowloot and makes enemies still able to retain their \"easy\" \"hard\" \"boss\" status, compare Skyrim Scaling Stopper and you'll notice the difference.\n<br />\n<br />In general, the difficulty of areas:\n<br />\n<br />[color=#4F6128]Easy[/color]:[list][*]Whiterun and Falkreath Holds\n<br />[/list][list][*]Bandit Camps\n<br />[/list][list][*]Areas near main roads\n<br />[/list][color=#FFC000]Moderate[/color]:[list][*]Eastmarch, Rift, Haafingar Holds\n<br />[/list][list][*]Draugr dungeons without Dragon Priests\n<br />[/list][list][*]Wilderness\n<br />[/list][color=#E36C09]Hard[/color]:[list][*]Reach, Pale, Hjaalmarch Holds\n<br />[/list][list][*]Mountains\n<br />[/list][list][*]Falmer Hives\n<br />[/list][list][*]Dwarven Ruins\n<br />[/list][list][*]Forsworn Camps\n<br />[/list][color=#FF0000]Extreme[/color]:[list][*]Solstheim, Winterhold\n<br />[/list][list][*]Very remote or forgotten locations\n<br />[/list][list][*]Dragon Priest dungeons\n<br />[/list][list][*]realms of Oblivion\n<br />[/list]\n<br />Note that these will vary: quest order and combinations of factors play major roles in it. Certain unmarked bandit locations have been replaced by hunters or soldiers, simply to increase the law-abiding population of Skyrim: it is strange that outlaws outnumber civilized people in many holds. Marked and quest bandit locations still have bandits.[color=#C00000][size=3]\n<br />\n<br />Boss Battles[/size][/color]:\n<br />\n<br />Bosses are much harder. Bandit Chiefs, and many of their equivalents, always spawn at the higher leveled versions, randomly chosen. Certain Bandit Chiefs are unique, and may have unique followers. Certain enemies have new powers: Spriggans and Hagravens can unleash terrible curses upon the player. Briarhearts' \"Heart of Thorns\" passive ability grants them a stronger version of the Reflect Blows perk, despite their lack of armor. Thalmor are always high level. The list can go on and on.Of particular note are Dragons: Dragons are no longer pushovers. They generally have twice as much health and damage as before, and a variety of dragon species can spawn even at low levels. Be sure to get on Resist Frost and Resist Fire effects early on. Dragons are essentially as difficult on Adept using this mod, as on Master or Legendary in the unmodded game. There are several new species of Dragon added, working similar to vanilla but with unique appearance and abilities. If you want a truly terrifying Dragon experience, combine this mod with a Dragon Overhaul and prepare to get destroyed.Alduin and Miraak are incredibly powerful, reflecting their status in lore. Do not attempt to fight them at a low level.\n<br />\n<br />Even basic enemies are stronger: Apocrypha Daedra have higher resists and high level ones have a chance at spawning at any level, Snow versions of common enemies(wolves, trolls, etc.), have greater Frost Resist and sometimes slightly improved stats, Chaurus poison is utterly virulent, once again the list is bottomless. \n<br />\n<br />All in all, enemies that are supposed to be challenging will BE challenging (even on Adept!), but there will still also be countless easy enemies everywhere to level up on.\n<br />\n<br />There are also new unique hunters and soldiers added to the game: some of them can buy or sell items. Some of them carry unique artifacts. All of them are integrated with the game's lore, giving the Holds that weren't made very interesting a more unique atmosphere that amplifies Skyrim's more obscure lore.\n<br />\n<br />[color=#C00000][size=3]Item Crafting[/size][/color]:\n<br />\n<br />Item Crafting is an area where the Unofficial Morrowloot-Skyrim Overhaul rewards player skill and adventure. It's no longer a cheatmode of sorts, unless you really get into it.\n<br />\n<br />Ingredients are rebalanced. Common ingredients tend to be weaker when used for certain effects. Rare and powerful ingredients, especially the remains of Daedra, are made much stronger than before. There is therefore a motivation to seek out specific ingredients if you wish to craft potions.\n<br />\n<br />Even potions that can be bought at stores have been rebalanced. They use a naming system more like that of Morrowind and Oblivion, allowing a player to more quickly determine quality simply by looking at a potion's name without clicking and comparing its effects. Poisons have been rebalanced.\n<br />\n<br />Smithing is changed, based heavily on Smithing in Morrowloot 4E. You can no longer craft Daedric equipment except at the Atronach Forge. Many \n<br />other rare or race-specific armor types have special requirements as well, and require higher levels to craft if you do not meet the requirements:\n<br />\n<br />-Ebony requires 100 Smithing and can only be crafted at the Skyforge(it requires the hottest forges)\n<br />-Runesteel requires the Rune Master and Daedric Smithing perks\n<br />-Glass requires 90 Smithing\n<br />-Elven requires 50 Smithing, unless you are an Elf\n<br />-Dark Elves require 50 for Elven armor, but can craft Bonemold and Chitin at \n<br />regular levels: everyone else must be a higher level to craft those\n<br />-Orcish requires 70 Smithing, unless you are an Orc\n<br />-Nordic Carved requires 70 Smithing, unless you are a Nord\n<br />-Scimitars can be crafted, Redguards with Steel Smithing can craft them at any level\n<br />-Dwarven equipment(except Crossbows) require Ancient Knowledge to craft\n<br />\n<br />There are secret crafting recipes hinted at in several in-game books, that will require high skills and/or perks to perform, but which essentially allow the player to use old magics to create new artifacts. One of them even involves retroactively becoming the original creator of a famous Tamrielic weapon. Many special recipes require the Skyforge to use.\n<br />\n<br />[color=#00ff00]UMSO Hearthfire:[/color]\n<br />\n<br />This mod buffs food items and adds some new recipes. It's not overpowered, but it's no longer useless save for a couple recipes either.\n<br />\n<br />[color=#C00000][size=3]Magic[/size][/color]:\n<br />\n<br />Many new spells have been added. Spell effects include:\n<br />\n<br />[list][*]Elemental Shield(Alteration)\n<br />[/list][list][*]Weakness to Elements(Destruction)\n<br />[/list][list][*]Dispel(Restoration)\n<br />[*]Sound(Illusion)\n<br />[*]Silence(Illusion)\n<br />[*]Sanctuary(Illusion)\n<br />[*]Reflect(Illusion)\n<br />[/list]\n<br />...among many others. There are many other unique spells out there as well, including:[list][*]Master Level Runes\n<br />[/list][list][*]all new Master Level spells, many of which are one-handed\n<br />[/list][list][*]Master Level Staves\n<br />[/list]\n<br />...and many more. Some of these arcana are not found in leveled lists, or perhaps can only be found in specific areas. Regardless of how to find them, non-quest related Master level equipment is very rare and hard to acquire.Note that the Master Level spells you learn through the College master quests are still gated to those quests: however, some of the two-handed spells from the original game have been made slightly stronger, namely Blizzard and Firestorm, which tended to be weak and impractical compared to spamming Ice Storms or Fireballs.\n<br />\n<br />Another new type of magical effect is \"Damage Attribute/Resistance.\" These are terrible curses that the player can be placed under. Most can be cured with potions of \"Restore Attribute/Resistance\" which can be purchased at the Temple of the Divines in Solitude or at the Temple of Talos in Windhelm, as well as at other places. These potions can also be brewed with the right ingredients. Some curses are strong enough to prevent Dispel from taking effect, as they are too powerful for Dispel: you must use a potion. The very harshest of these effects must be cured by praying a shrine: mundane cures are useless.\n<br />\n<br />Certain spells are associated with certain gods or with the reality-warping nature of certain Shouts: gaining the favor of that god, or learning that Shout, will allow the spell to be used, or enhance it.\n<br />\n<br />If you wish to find the strongest of the new spells, look in places where great amounts of knowledge might be hidden away.\n<br />\n<br />I have personally tested the spell effects and added animations. This is a common area for bugs and hidden code screwing things up, so let me know if you encounter a problem.\n<br />\n<br />[color=#00ff00]UMSO Enchanting Modular Add-On:[/color]\n<br />\n<br />If you choose to install this add-on, a perk will be added to the Player actor that will adjust enchantment strengths based on item quality. Just like in Morrowind, item material will determine how easy it is to enchant. It will be easier to enchant Ebony than Glass, easier to enchant Nordic than Iron. Jewelry will be enchanted based on the power of the metals and gems with which they have been crafted. More valuable clothing will be able to hold stronger enchantments, and Robes will naturally hold strong Magicka Regeneration enchantments, keeping in theme with their general use in the vanilla game.\n<br />\n<br />To use the Modular Enchanting Add-On, download it and load it after the other files. Note that it WILL conflict with any mod that also adds/removes perks or otherwise edits the Player character's basic abilities: you will have to make a Merged Patch to make it work. For this reason, and due to the easily bugged nature of modifying the Player's perks, it is completely modular. Requires Dragonborn.\n<br />\n<br />[color=#00ff00]UMSO Ingredient Crafting Modular Add-On:[/color]\n<br />\n<br />Brought over as an optional file from its old page, the Glorious Alchemy Mod is a standalone enhancement for alchemy needs. It allows gems to be used as ingredients like in Morrowind: use the crushed gem recipes at a forge to convert gems into gem ingredients. Ore, too, can be used in potions, but this is more complicated: more magical ores must be refined using element salts. Refining Stalhrim requires finishing the appropriate Dragonborn quest. Chitin, too, can be refined into concentrated Chaurus venom or cuttle, depending on the type of insect you got it from. Certain ore and gem based alchemy effects are new and unique to those ingredients, so experiment away!\n<br />\n<br />Getting the appropriate perk unlocks better refining techniques. Ores need Smithing perks, Chitin needs Alchemy perks, and Stalhrim needs the Frost Enchanting perk to be refined with the greatest efficiency.\n<br />\n<br />Many bone materials can also be ground down: Mammoth Tusks, Horker Tusks, Troll Skulls, and Human Skulls. And you can cook Skeevers with a cooking pot, just like NPCs do.\n<br />\n<br />The Glorious Alchemy Mod tweaks alchemy and smithing to work together, and to have more options and content than is available in vanilla Skyrim without breaking the game.\n<br />\n<br />[color=#C00000][size=3]Weapons and Armor[/size][/color]:\n<br />\n<br />Weapons and Armor have been rebalanced. Much like in Morrowind, heavy armor and melee weapons can be very heavy, especially if made from certain materials. In addition to this, certain weapon materials have properties that go beyond a mere hierarchy of equipment: you may find a specific type of item preferable, depending on your playstyle.\n<br />\n<br />Orcish\n<br />[list][*]Orcish weapons are brutal, but attack slowly. Orc armor is still equivalent to Steel Plate, however.\n<br />[/list]Dwarven\n<br />[list][*]Dwarven equipment is heavy, but packs a punch.\n<br />[/list]Elven and Glass\n<br />[list][*]Elven equipment is fast and light weight.\n<br />[/list]Nordic Carved[list][*]Nordic Carved gear is heavy and staggers slightly more than average, but is still able to swing at a reasonable speed\n<br />[/list]Ebony and Daedric[list][*]These rare materials are very strong and heavy. Daedric has strong stagger effects.\n<br />[/list]Stalhrim\n<br />[list][*]Stalhrim is light, yet still strong.\n<br />[/list]Civil War/Guard equipment\n<br />[list][*]Actually decent for a low level character.\n<br />[/list]\n<br />Heavy Armor is altered in terms of weight, and a few Light Armors are as well, for rebalancing purposes: the best armor can be very, very heavy. Bows are relatively unchanged(although Elven Bows are particularly good for their rarity). Arrows have damage tweaked to be in line with the different qualities of bows. Certain vanilla artifacts are also upgraded to allow for improvement at a forge, and weak ones are given generally better stats.\n<br />\n<br />Several NEW weapon and armor types have also been added to leveled lists and outfits across Skyrim: if you have other mods that add new base equipment types, then there might be overlap, but nothing a bashed patch can't handle. These weapon and armor types are all as lore friendly as possible, expanding Skyrim's lore to include Nordic equipment inspired from previous Elder Scrolls and from the real-world Norse source material. What needs to be said is that the world NO LONGER REVOLVES AROUND EXOTIC EQUIPMENT: you are in the home province of Nords, known for their skilled blacksmiths, and it shows. Human armor and weapon styles are varied and make exploration more interesting.\n<br />\n<br />-Chainmail Jerkin, Clansman's Helm, Round Shield\n<br />This is the generic version of the armor that Hold Guards use. It is very strange that guards are the only people in the entire province to use chainmail, spectacled helms and reinforced wooden shields, despite these being the mainstay of the real-world Norse, and these being implied by the guards' use of them to be popular in Skyrim! Requires Steel Smithing to craft. Round shields are available in a large variety of patterns: some are only available on certain NPCs or in random loot!\n<br />\n<br />-Chainmail Hauberk, Steel Coif\n<br />This is Chainmail for heavy armor users.\n<br />\n<br />-Bearskin Armor\n<br />Returning from Bloodmoon, this is a very stylish type of fur armor. And the Snow Bear variant of the northern holds, like Stalhrim, lends itself to strong Resist Frost enchantments.\n<br />\n<br />-Ringmail Armor\n<br />This classic Nordic armor from Morrowind is similar to the unplayable armor worn by executioners. It is strong for Light Armor, but also heavier than most other Light Armor variants. It requires Elven Smithing to craft.\n<br />\n<br />-Trollbone Armor\n<br />This terrifying Nordic armor from Morrowind returns, around Steel Plate in quality and rarity, albeit with a few differences. It is Heavy Armor and requires Orcish Smithing to craft.\n<br />\n<br />-Runesteel Armor\n<br />These ancient suits of Nordic armor represent the pinnacle of Nordic smithing. Styled after the masked Nordic plate armor in Morrowind, it is around Nordic Carved and Ebony armor in quality, albeit perhaps lighter and less sturdy. Runesteel is very rare and powerful, and its Daedric type allows it to hold powerful enchantments with the UMSO enchanting optional file installed.\n<br />\n<br />-Shortswords and Hand Axes\n<br />These versions of swords and axes have less reach and stagger, but strike quicker. Use the Sword and War Axe perks, respectively.\n<br />\n<br />-Clubs\n<br />Spiked Horker Clubs and Steel Morning-Stars are lightweight yet have decent stagger and damage. Use the Mace perks.\n<br />\n<br />-Hand Hammers\n<br />This type of one-handed blunt weapon hits hard and strong. Use the Mace perks.\n<br />\n<br />-Long Axes\n<br />Spears are back! Or at least those of the Halberd variety are, since they can easily share animations and perks with battle axes. These Nordic-style poleaxes have the least damage but the longest reach of all two-handed weapons. Use the Battle Axe perks.\n<br />\n<br />-Expanded existing item pools\n<br />Certain items that would make sense to be carried by certain factions, but aren't in vanilla Skyrim, have items added with the appropriate appearance and stats: Forsworn and Falmer now have clubs, Draugr have blunt weapons, etc.\n<br />\n<br />All the new item types have been tested for correct animations and textures, have tempering recipes, and many can be crafted with the appropriate perks and materials!\n<br />\n<br />[color=#00ff00]UMSO Spears Add-On:[/color]\n<br />\n<br />This module adds Spears to the game and integrates them into leveled lists. The Dawnguard part of the mod comes with a couple spears, but the main mod does not have them: Spears can be immersion breakers, due to the lack of good animations, and so they are optional. Spears use the Greatsword perks.\n<br />\n<br />\n<br />[color=#C00000][size=3]Perks[/size][/color]:\n<br />\n<br />The main file no longer alters perks(although due to a bug in process of being fixed, Conditioning is a dirty reference that you will have to overwrite with whatever perk mod you use). All the perk changes have been moved to a modular perk add-on, which has both the classic lite changes and a heavier perk overhaul.\n<br />\n<br />[color=#00ff00]UMSO Modular Perk Add-On:[/color]\n<br />\n<br />Install this add-on if you wish to use UMSO's perk changes: don't install if you already have other perk mods. The LITE version of the add-on contains the minimal perk changes found in previous versions of UMSO, while the standard version has more comprehensive perk changes.\n<br />\n<br />[color=#00ff00]Lite Version changes:[/color]\n<br />\n<br />Destruction damage perks are significantly more effective: Destruction was weak in vanilla Skyrim, and this overhaul makes it stronger.\n<br />\n<br />Armor bonus perks are weaker: this again encourages players to find higher level equipment if they want to reach that 80% threshold: even then it will be difficult to reach it without Heavy Armor.\n<br />\n<br />Heavy Armor no longer becomes weightless when given a specific perk: that perk instead makes it weigh less. This makes it actually feel \"heavy\". However, with weaker smithing and high level items oftentimes well hidden, heavy armor is by no means a bad choice.\n<br />\n<br />[color=#00ff00]Standard Version changes:[/color]\n<br />\n<br /> These changes are more drastic and have made large overhauls to certain perk trees. Some perks have been renamed, and others have been tweaked or completely overhauled. The changed perks are not overpowered, they are balanced yet strong. If you already have perk points in certain trees, you will retain the perk points, but they will be in different things then you intended them to be in: you will need to fix it with the console.\n<br />\n<br />Destruction damage perks and stronger and have a third tier, allowing spells to reach double their initial damage at high skill levels.\n<br />\n<br />Armor, Alchemy and Enchanting perks are all slightly weaker, so as to make the game more balanced(as described above). Smithing is weaker and Conditioning does not straight-up remove armor weight.\n<br />\n<br />Speechcraft is massively overhauled. Sales/money related perks have been moved to the shorter side of the tree, and have been merged or given multiple tiers of effects. The longer side of the tree contains older persuasion perks, and Thu'um perks at higher levels. Persuasion and Intimidation boosting perks are available at lower levels, after all it's sort of pointless getting them late game when you already have high enough Speech and player level to succeed the checks anyway. Bribery costs more gold than before.\n<br />\n<br />Lockpicking is massively overhauled. Picking locks is now much more difficult than before, but investing in perks will give more improvement. The basic hierarchy of lockpicking perks now not only helps pick lower level locks, but also improves your lockpicking skill in general. The mostly pointless Locksmith perk has been replaced by Quick Hands(avoiding getting caught now has a higher level requirement). The previous location of Quick Hands now holds the new perk Heat Treatment, making you better at picking locks while you have a torch equipped(if you played Oblivion, you might remember this).\n<br />\n<br />The Sneak perk tree is less overpowered in terms of being able to easily overwhelm NPCs using sneak methods. Assassin's Blade is slightly nerfed, and Muffled Movement and Silence are heavily nerfed so as to avoid easy auto-muffle once you reach a certain point on the stealth perk progression.\n<br />\n<br />Two-Handed weapon type specific powers have been made stronger: for example, two-handed battleaxes now cause more bleed damage than one-handed war axes.\n<br />\n<br />The Animage perk and soul-trap related perks have been buffed, while Summoner lvl2 and Rune Master give bigger range boosts: these perks stay close to vanilla but are more worthwhile. On the flip side, Quiet Casting, extremely powerful, requires a higher level(it now requires level 70 like it appears to require on the perk tree diagram). As for Mage Armor, spellcaster-assisting Dragon Priest Masks are now clothing, rather than armor: they are not improved by armor perks, but they will allow the player to get the Mage Armor bonus while wearing them.\n<br />\n<br />Snakeblood gives less poison resist, but you can get more poison resist overall by investing in the otherwise useless Experimenter. Each level of Experimenter grants 10% poison resist, making it a worthwhile perk for those wishing to improve passive stats using perks. Concentrated Poison(now \"Poisoned Weapons\") gives 3, rather than 2, poison coatings, again making it more worthwhile.\n<br />\n<br />Fighting Stance and Backstab(now \"Deadly Strike\") have been altered to give additional help to Hand to Hand users: pugilism is improved if you take these perks.\n<br />\n<br />[color=#00ff00]UMSO Smithing Perk Description Fixer:\n<br />[/color]\n<br />This third file is included with the Perk pack download. It changes the names and descriptions of the Smithing Perks to ones that assume the player has Dawnguard, Dragonborn, and UMSO all installed: the descriptions will be made accurate. If you don't have all of these installed, then do not use this file.\n<br />\n<br />\n<br />[color=#C00000][size=3]Civil War[/size][/color]:\n<br />\n<br />Officers on both sides are protected, not essential, except those needed for quests. However, they will put up a good fight. Fort Commanders are now Officers as well, and some Fort Commanders are unique. Some forts have faction trainers occupying them, other Forts have local government(Thanes).\n<br />\n<br />Certain Civil War leaders are stronger fighters: Ulfric wears armor into battle, for instance.\n<br />\n<br />[color=#00ff00]UMSO Occupied Forts Modular Add-On:[/color]\n<br />\n<br />This optional and completely standalone add-on makes a simple tweak that it is quite surprising not many modders have already made: making the forts that the Civil War faction maps claim to be occupied, actually occupied. How it does this is by a simple reference change: the marker that sets the fort to be filled with bandits is disabled, and the one that sets it to be filled with soldiers is enabled. Fort Hraagstad is unchanged, due to the fact that bringing its bandits being part of the first Imperial Legion quest.\n<br />\n<br />Doing this will greatly increase immersion, removing the previous problem with no forts in Skyrim actually being occupied until their Hold is fought over. Now every fort marked as occupied on the general's map is already filled with soldiers from day 1. The Civil War comes to life with this very simple change.\n<br />\n<br />Note that this is still a work in progress: the forts are properly filled with soldiers, but the Civil War questline has not been completed with this installed to check for bugs. While it is highly unlikely that this tweak will cause a major bug, I will leave this as a warning out there for anyone wishing to install this mod.\n<br />\n<br />[size=3][color=#C00000][b]APPENDICES[/b][/color]:[/size]\n<br />[size=2]\n<br />1.Bugs[/size][size=2]\n<br />\n<br />2.Conflicts, Compatibility and Load Order[/size]\n<br />\n<br />3.Installation\n<br />\n<br />4.Credits and Permissions[size=2]\n<br />\n<br />5.Changelog[/size]\n<br />[color=#C00000][size=3]\n<br />\n<br />Bugs[/size][/color]:\n<br />\n<br />As you can see, the Unofficial Morrowloot-Skyrim Overhaul covers a lot of stuff. So if you have time, report bugs to me either by PM or on the discussion page for this mod.\n<br />\n<br />Known Bugs:\n<br />\n<br />-bees not spawning at Fort Greenwall apiary?\n<br />-if combined with Holds, Skald the Elder and his vanilla housecarl may not be able to enter their rooms since Holds gives them keys and UMSO changes their weapons/armor\n<br />[color=#C00000][size=3]\n<br />Conflicts, Compatibility and Load Order[/size][/color]:\n<br />\n<br />This mod will likely conflict with everything, being an overhaul. Wrye Bash is a must: I would load the mod after everything, but you don't have to. Set both .esp's to Delev and Relev on Wrye Bash when you prepare to make the bashed patch, since it makes lots of changes.\n<br />\n<br />It [size=4]WILL generally conflict[/size] with:\n<br />[list][list][*]Mods that change vanilla leveled lists, of all types(this can be fixed with a bashed patch, in many cases).\n<br />[/list][list][*]Mods that change vanilla NPC, item, ingredient, potion, or spell stats, abilities and equipment.\n<br />[/list][list][*]Mods that change vanilla perks (unless you opt not to use the modular perk changes).\n<br />[/list][/list]\n<br />It [size=4]will generally NOT conflict[/size] with:[list][list][*]Graphics Mods\n<br />[/list][list][*]Sound Mods\n<br />[/list][list][*]Follower/Waifu Mods\n<br />[/list][list][*]Mods that change Shouts or add ingredients\n<br />[/list][list][*]Mods that add new item crafting recipes\n<br />[/list][list][*]Mods that add scripts and elements of gameplay outside of vanilla\n<br />[/list][list][*]Mods that add brand-new buildings, areas, dungeons, NPCs, quests, factions, etc.\n<br />[/list][list][*]Mods that change the scripts for factions to improve questlines\n<br />[/list][/list]\n<br />Known Conflicts:    \n<br />   -Skyrim Scaling Stopper, Requiem: these mods do similar things to UMSO    \n<br />   -Morrowloot(and all other variants): UMSO is a Morrowloot variant. Using more than one Morrowloot means getting duplicates of many placed items.\n<br />\n<br />Load Order:\n<br />\n<br />Frostfall (wilderness survival mod, would recommend)\n<br />Holds(also recommended, adds similar immersive and uniqueness to parts of Skyrim to UMSO, focusing more heavily on NPCs and villages. REQUIRES COMPATIBLE VERSION, see below)\n<br />Overhaul (main/dragonborn)\n<br />OverhaulDG (dawnguard)\n<br />OverhaulHF (hearthfire)\n<br />UMSOspears\n<br />UMSOperk\n<br />UMSOsmithingPerkDescriptions\n<br />UMSOingredientCrafting\n<br />UMSOforts\n<br />UMSOenchant\n<br />Bashed Patch\n<br />\n<br />If you wish to use the UMSO Modular Perk Add-on(and or the smithing perk descriptions), load it after the main file and DG file. Use the full version if you want major changes, and the lite version if you want the small tweaks found in previous versions of UMSO.\n<br />\n<br />If you wish to use the UMSO Enchanting Modular Add-On, load it last, and remember a Merged Patch will be required if you wish to combine it with another mod that alters the Player.\n<br />\n<br />If you wish to use the UMSO Ingredient Crafting Modular Add-On, load it at any place in your load order, it doesn't particularly matter. USE THE RELEV TAG when you make a Bashed Patch, because it does add to a couple merchant leveled lists.\n<br />\n<br />The UMSO Occupied Forts Modular Add-On is very minimal in its changes, and is probably best loaded after UMSO itself: however, if you have another Civil War mod that conflicts with it, you should consider a different load order.\n<br />\n<br />All new objects in the mod are preceded by '000', both for quick reference while modding and so that you will know ahead of time if they accidentally have the same ID as objects in another mod.\n<br />\n<br />If you have a question about a specific mod conflicting or not with the Unofficial Morrowloot-Skyrim Overhaul, ask me, and I'll check that mod out and tell you if it conflicts or not. I will then add it to Known Conflicts if it's a well-known mod.\n<br />\n<br />[color=#00ff00]UMSO-Holds Compatability Version:[/color]\n<br />\n<br />Galandil's Holds: the City Overhaul is available here: https://www.nexusmods.com/skyrim/mods/74638 . It is a great mod that adds more NPCs, lore and towns, and makes the world more fleshed out. If you wish to use the compatible version, simply replace the overhaul.esp in your Data directory with the optional compatible overhaul.esp version, and load Holds.esp BEFORE overhaul.esp and the others.\n<br />\n<br />[color=#C00000][size=3]Installation[/size][/color]\n<br />\n<br />Download the .rar files, and extract them. Remember the main file requires Dragonborn, and the Dawnguard file requires Dawnguard.\n<br />\n<br />Put the files in your Data folder and activate them. Merge the Meshes and Textures folders with the Meshes and Textures folders in your data folder, and do not change their names: item models require specific filepaths, as most modders are aware. Set up the load order shown above. Merge them(make a bashed patch, manually set the core UMSO files to Delev/Relev and the Ingredient Crafting to Relev so that the leveled lists are bashed properly, and you're ready to go!\n<br />\n<br />The UMSO Perks, Occupied Forts and Ingredient Crafting Modular Add-Ons are all fully modular and can also be used as standalones, and are strongly recommended for the enhanced gameplay they offer. Use them if you want to see their changes as part of your game(described above).\n<br />\n<br />The UMSO Enchanting Modular Add-On is fully compatible with most mods, but not with any mod that alters the Player: because of this, it is fully modular, but is strongly recommended for the enhanced gameplay it offers.\n<br />\n<br />[color=#C00000][size=3]Credits and Permissions[/size][/color]:\n<br />\n<br />Ask me before publishing anything from UMSO. Heres why:\n<br />\n<br />Meshes and textures for certain armor and weapons come from resources and armor and weapon mods, some of which require permission from their authors. You MUST get permission from those authors before using those files. This, of course, includes any meshes and textures which are unimplemented leftovers in those files but are still not mine to give the permission for: all meshes and textures included with the downloads are credited below, and you must get permission from their authors individually before proceeding with re-publishing them.\n<br />\n<br />Assets modeled or coded by other authors, used with permission:\n<br />\n<br />by Trainwiz:\n<br />Morrowloot itself, with special mention to item model creators\n<br />[b]-Oriphier (Hakhnawibblewobble's Fang and Skullcrusher)\n<br />-Telthalion (Fists of Randagulf)\n<br />-TheMalfazar (Eledion's Ward and Auri-El's Shield)\n<br />-Ronniemagnum for his Eledion and Scourges\n<br />-Reaper for the Vampiric Ring\n<br />-Earrindo (Sunder)\n<br />-Insanity Sorrow and StarX (Hopesfire, Goldbrand, Ice Blade of the Monarch)\n<br />-Jured (Stendarr's Hammer)\n<br />-ArmoredThirteen (Daedric Crescent)\n<br />-Grimeleven for his animated effects overhaul, http://skyrim.nexusmods.com/mods/41875/?\n<br />-urbanshiv92 for Wraithguard\n<br />-Haishao for converting Stendarr's Hammer, Sunder and Wraithguard.\n<br />[/b]\n<br />Trainwiz personally granted me permission to incorporate and tweak his mod.\n<br />\n<br />by hothtrooper44:\n<br />Shields of Jorvasskr\n<br />Viking Chainmail Armor\n<br />Trollsbane Armor(including trollsbane weapon retexture that comes with the pack)\n<br />The Redguard Knight textures absolutely required to use the other armor meshes(the full Redguard Knight armor is not included and must be downloaded from this website separately)\n<br />\n<br />All weapons and armor created by hothtrooper44 are used via his express permission, with thanks for the compilation of countless well-made weapons and armors from many different authors in the Immersive Weapons and Immersive Armor mods.\n<br />\n<br />by THusky:\n<br />Morrowind Armor Compilation(models credited to authors other than THusky are not included in the download)\n<br />\n<br />by 747873:\n<br />Weapons of the Third Era(free to use asset)\n<br />\n<br />by PrivateEye:\n<br />Heavy Armory(free to use asset)\n<br />Mace of Aevar Stone-Singer(free to use asset)\n<br />\n<br />by Matherthebec:\n<br />Matherian Viking Shields Set(the old, free asset version)\n<br />\n<br />Matherthebec requests that I link to the Italian Medieval Total War community found at mtwitalia.freeforumzone.leonardo.it/, as a prerequisite for using his excellent viking shields.\n<br />\n<br />by Bellyache:\n<br />Bellyaches Animal and Creature Pack(free to use asset)\n<br />Bellyaches New Dragon Species(free to use asset)\n<br />\n<br />by Howiego08:\n<br />Better Bows(free to use asset)\n<br />\n<br />by InsanitySorrow:\n<br />Insanitys Shields(free to use asset)\n<br />\n<br />by Viltuska:\n<br />Gehenoth(free to use asset)\n<br />\n<br />by Nedius:\n<br />Real Wildlife - Skyrim(free to use asset)\n<br />Ingredients of Tamriel(free to use asset)\n<br />\n<br />by 530Gothic25:\n<br />Skyrim Wildlife Overhaul(free to use asset)\n<br />\n<br />by opera4ever:\n<br />New Animals and Fixes 2(free to use asset)\n<br />\n<br />Uses 530Gothic25 assets, see above.\n<br />\n<br />by Reaperix:\n<br />Elemental Destruction Magic(free to use asset)\n<br />\n<br />Reaperix requests I give a link to his great magic spell assets: http://www.nexusmods.com/skyrim/mods/69474/?\n<br />\n<br />by Elianora:\n<br />Sun Rune- a restoration spell(free to use asset)\n<br />\n<br />by Haxocron:\n<br />The Gemstone Collector(free to use asset)\n<br />\n<br />by uni_SL:\n<br />Amulets of Skyrim(free to use asset)\n<br />\n<br />I have picked and chosen weapons, armor, creatures, textures and other things from the mods and resources mentioned above, based on what I determined would be the best to create the appropriate balance and atmosphere for Skyrim, and based on what items' models and animations work properly for what I hope to use them for. Thanks to all the authors mentioned above for their time and effort spend creating new weapon and armor models for Skyrim, and for granting permission/publicizing their resources so that they would be available for UMSO.\n<br />\n<br />Special thanks, also, to:\n<br />\n<br />-Trainwiz, for making the original Morrowloot.\n<br />\n<br />-Furna of Morrowloot 4E, for the idea for a Morrowloot-friendly smithing system\n<br />\n<br />-The UESRPG team, for advice and discussion of this mod, especially of what unique things could be added to Apocrypha.\n<br />\n<br />-/vg/, for advice on the mod\n<br />\n<br />-/tg/ for their interest and their good lore discussion threads\n<br />\n<br />-LogicDragon and ZaricZhakoron, for lore writing help and artifact lore inspiration, respectively\n<br />\n<br />-The Expedition to Atmora Team, for lore discussion\n<br />\n<br />\n<br />[color=#C00000][size=3]Changelog[/size][/color]:\n<br />\n<br />v1.73\n<br />(see above for details)\n<br />\n<br />v1.60\n<br />\n<br />-merged Morrowloot with UMSO. UMSO now contains Morrowloot in its entirety\n<br />-UMSO now uses a crafting system like Morrowloot 4E, with some changes: it is\n<br /> possible to craft certain high level items, but doing so requires a \n<br />very high smithing level\n<br />-moved, removed, or tweaked the locations of several high quality items, both from Morrowloot and from previous \n<br />versions of UMSO, to make them harder to steal and/or harder to find\n<br />-fixed the Ebony Draugr issue once and for all: some Draugr can have ebony \n<br />weapons, but only specific Draugr in certain areas will ever have them\n<br />-fixed a bug where Falmer would not equip Falmer Clubs\n<br />-added new spell effects, including new elemental runes, Silence, Sound, and Sanctuary\n<br />-added a secret method for skilled blacksmiths to forge weapons of \n<br />dragonslaying, including the legendary Goldbrand, and a trail of books\n<br />-added additional NPCs, including faction trainers and merchants for the \n<br />Imperial Legion, Stormcloaks, Hold governments, the Temple of the \n<br />Divines, the Temple of Talos and the Bard's College\n<br />-further tweaked a large number of items, NPCs\n<br />-added a hidden unmarked quest involving the mantling of Ysmir, which can only\n<br /> be completed once the Civil War is done and a certain point is reached \n<br />in the Main Quest\n<br />-added new artifacts, high level recipes and more high level robes\n<br />-added vaults to many rich homes for thieves to plunder\n<br />-added new animals and monsters, and new ingredients, and tweaked locations/types of many existing animals\n<br />-updated books and letters from previous versions\n<br />-added Damage Attribute and Damage Resistance effects: these can be permanent,\n<br /> but can be cured with the correct potion or by prayer at a shrine\n<br />-added Spears add-on\n<br />-added Hearthfire add-on, and new cooking recipes\n<br />-added preset Thane reward items for certain Holds\n<br />-added some lore-enhancing terrain tweaks to a few locations, such as Stalhrim\n<br /> in Ysgramor's tomb(it was used for burials back then), beehives at \n<br />farms in the Rift, and families of Thanes in certain military forts\n<br />-Orcish weapons now are brutal and attack slowly, while Dwarven weapons and armor are no longer ridiculously slow and heavy\n<br />-fixed an issue where Ebony Boots were superior to Daedric Boots, rebalanced heavy armor in general\n<br />-many other changes!\n<br />\n<br />\n<br />v1.50\n<br />\n<br />-added new lore-friendly base weapon and armor types to the game, with new graphics, full tempering recipes and full integration into leveled \n<br />lists and NPC outfits(this will make a leveled list bashed patch with delev/relev checked 100% necessary, even moreso than before). See below for descriptions of new items.\n<br />-added new lore-friendly artifacts, including a returning artifact from TES III: Bloodmoon\n<br />-added a new unique summon spell\n<br />-added new NPCs, including more uniquely named bandits, soldiers and hunters, as well as flavorful types of bandit, hunter and other wilderness NPCs, all inspired by wealth of obscure Nord lore material only hinted at in the game: all new enemies have the correct radiant quest tag, they will \n<br />be the targets of the same quests as the generic NPCs they replaced.\n<br />-added a terrifying enemy, found in the lore, buffed tremendously from its lackluster vanilla stats, to several remote places.\n<br />-added lore books(some of which were previewed last week in lore threads on certain forums, others of which were written by Michael Kirkbride) to \n<br />the game, adding to Skyrim's atmosphere and describing new NPCs and items.\n<br />-added legal documents, new legal and religious texts, and secret correspondences between important figures all over Skyrim, creating a more immersive political atmosphere: all information is inspired by the ancient Anglo-Saxon and Icelandic law codes and by the more obscure Nord lore.\n<br />-added a few small, immersive points of interest\n<br />-upgraded a large number of vanilla NPCs from all over the game to have new equipment and backstories.\n<br />-upgraded Leveled Lists, doing for all of them what Morrowloot did for the Dwarven Lists: Falmer, Draugr and Forsworn loot all spawn items that you\n<br /> would expect to find in them. Loot in general can be considered more regional.\n<br />-tweaked several items and NPCs as usual.\n<br />-added tempering recipes for previous versions' artifacts missing them.\n<br />-Ward spells cost less magicka to make them more useful.\n<br />-non-Imperial hold guards now no longer use Imperial weapons(this led to them sometimes having crossbows despite it being an uncommon weapon in \n<br />Skyrim).\n<br />-fixed compatibility issues with Morrowloot.\n<br />-put better locks on some valuable things that were too easy to steal in Morrowloot.\n<br />-Morrowloot 4E compatible version has a couple Stalhrim loot items removed that were not removed in previous versions(due to mod author laziness).\n<br />-added the Glorious Alchemy Mod as an optional file(see below).\n<br />-buffed Master Locksmith perk considerably in the perk add-on.\n<br />-added an optional file tweaking most Civil War forts to always be occupied by soldiers(just like the war maps in cities and camps suggest).\n<br />-in an utterly desolate and frozen place, A SHIRTLESS NORD WRESTLES AN ENORMOUS BEAR. Place your bets now.\n<br />-v1.50 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />v1.40\n<br />\n<br />-moved all perk changes from the main file to a completely modular add-on(see below under Perks)\n<br />-Conditioning now reduces armor weight by a set percentage\n<br />-made a more comprehensively overhaul perk tree, previous edition's small perk changes are nevertheless still an option\n<br />-files are download in groups, choose which you want to use\n<br />-added a new unique crossbow artifact\n<br />-tweaked several NPCs\n<br />-tweaked several items\n<br />-v1.40 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />v1.32\n<br />\n<br />-made alterations to cover a bug in Trainwiz's original Morrowloot, where the Drunken Huntsman fletcher could still \n<br />sell enchanted bows of up to Ebony quality\n<br />-altered Spriggan's Paralyze to not longer use the standard Paralysis effect, using the custom one again\n<br />-Spriggans are no longer able to effortlessly stunlock players with Paralysis\n<br />-cleaned the mods for dirty references\n<br />\n<br />New Versions:\n<br />\n<br />-added a new version for SPERG and other perk overhauls, that does not change perk trees\n<br />-added a completely modular add-on that adds a perk to the Player actor to create a more hardcore Enchanting experience\n<br />-v1.32 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />\n<br />v1.30\n<br />\n<br />-made alterations to cover a bug in Trainwiz's original Morrowloot, where \n<br />Tonilia could still sell enchanted bows of up to Daedric quality\n<br />-fixed a bug where Hired Thugs would be absurdly powerful due to a level list oversight\n<br />-altered Spriggan's Paralyze to use the standard Paralyze effect\n<br />\n<br />New Features:\n<br />\n<br />-the vast majority of remaining leveled NPCs have been changed to static level, or to a narrow level margin\n<br />-(Followers and certain quest allies are still leveled, since it is intended that they level up alongside the player character)\n<br />-general tweaks to certain NPCs, including certain bosses\n<br />-buffed the strength of certain very low level enemies(bandits and wolves)\n<br />-made certain Civil War enemies and housecarls stronger in line with the rest of the content\n<br />-buffed enemies guarding a certain artifact found in the original Morrowloot\n<br />-buffed enemies throughout the Dawnguard questline\n<br />-buffed The Forgemaster tremendously\n<br />-slightly buffed Hagraven's curse to push the AI to use it\n<br />-nerfed the Ice Lake Dragons due to the insane difficulty of that singular encounter\n<br />-rebalanced dragonbone and daedric weapons\n<br />-added a new artifact, complete with a new description in the artifact lore book\n<br />-buffed two existing artifacts, one from vanilla and the other from earlier versions of this mod\n<br />-added multiple new unique items\n<br />-tweaked minor unique items to mirror their normal equivalents\n<br />-hold guard armor and other variant armors buffed to match their normal equivalents\n<br />-hold guard shields are now light armor to match the rest of their armor sets\n<br />-tweaked critical damage on items, in case of unforeseen conflict with the Unofficial Skyrim Patch series\n<br />-added an item found in the code but never implemented, with its magical effect tweaked to be powerful\n<br />-added a new spell based on an effect found in the code and buffed to be powerful\n<br />-renamed several poorly named items and NPCs added in earlier versions\n<br />-v1.30 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />v1.23\n<br />\n<br />-Fixed the Ice Lake Dragon leveled list so that it would spawn an enemy even at level 1\n<br />-Fixed the ghost leveled list so that it would spawn an enemy even at level 1\n<br />-v1.23 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />v1.2\n<br />\n<br />-fixed a game-breaking bug where items could not be improved with Smithing\n<br />-items still improve more slowly than in vanilla Skyrim, but they WILL be able to be improved\n<br />-changed the locations of some items for better looting\n<br />-changed the locations of several apocrypha items that were inaccessible either due to bugs or random level-changing events\n<br />-fixed a bug where the hammer Thundercrack was carried by the wrong person\n<br />\n<br />New Features:\n<br />-Potions given Morrowind-style naming system, making them easier to sort in inventory and have more lore-related names\n<br />-Storebought poisons of Lingering Damage are now appropriately scaled to similar direct damage potions\n<br />-homemade potions of Lingering Damage are rebalanced to match increased direct \n<br />magicka and stamina damage in terms of scaling, but you still need to \n<br />use highly toxic ingredients to make a good direct damage potion on par \n<br />with Lingering Damage\n<br />-all poisons of Lingering Damage deal their damage over a longer period of time, and are rebalanced accordingly so \n<br />as to not be overpowered\n<br />-rare potions that only spawned as dummy potions in a couple areas will be found in a few more areas or in certain rare loot\n<br />-Certain potions that were not Vendor Item - Potion in vanilla have been given that quality\n<br />-Skaal blacksmiths now only very rarely sell Stalhrim equipment, but one of \n<br />them always has ten Stalhrim arrows for sale(which are very rare in \n<br />random loot lists otherwise due to prior UMSO changes)\n<br />-the Imperial Legion fletcher now sells very basic Crossbows and Bolts, since a few \n<br />Legionnaires were tweaked to use Crossbows in an earlier version\n<br />-added two new unique Falmer warlords\n<br />-added lore-friendly armor to unique Falmer, some based off of concept ideas that didn't make it into the main game\n<br />-added a lore friendly staff artifact with a powerful effect that only works for a devotee of Kyne\n<br />-added a new, very powerful spell to one part of Apocrypha\n<br />-added health regeneration to Spriggan Earth Mothers, no longer just for lesser spriggans\n<br />-increased Miraak shout damage to be on par with increased Dragon shout damage\n<br />-Miraak spells tweaked to be stronger\n<br />-Briarheart's heart abilities also add magicka absorb\n<br />-Giants have more life, since they're, well, giant\n<br />-Frost Giants are much tougher and freeze the air around them\n<br />-other various NPCs also tweaked\n<br />-v1.2 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />v1.1\n<br />\n<br />-Elemental Shield spells of the same element no longer stack\n<br />-re-arranged several items in Apocrypha\n<br />-altered several NPCs stats, bodyguards of Jarls now are more powerful and have better equipment, Vyrthur (DG) is fixed level\n<br />-increased duration of Skin of Knives to 45 seconds\n<br />-Altered Spriggan curse to happen whenever Spriggan uses Spriggan claw, an attempt to force AI to use it\n<br />-added health regeneration to weaker types of Spriggan\n<br />-Fixed a bug where several spell tomes did not describe the spell's effects properly\n<br />-Fixed a bug causing Frost Shield's resist effect to expire before its shield effect\n<br />-Fixed a bug conflicting with Morrowloot where Kodlak Whitemane would not wear the armor Morrowloot gives him\n<br />-Fixed multiple bugs where items in Apocrypha could not be picked up\n<br />-v1.1 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />v1.0\n<br />-added file to the nexus\n<br />-v1.0 is no longer available, and many bugs have been fixed(see above)\n<br />\n<br />Note:\n<br />The Glorious Alchemy Mod mentioned here months ago is now available as an optional file on this page, enjoy!",
  "categoryId": "79",
  "version": "1.73",
  "author": "Archiphres",
  "createdUnix": "1392095533",
  "updatedUnix": "1515640670",
  "containsAdultContent": false,
  "uploadedBy": "Archiphres",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126804",
      "name": "UMSO Enchanting Modular Add-On",
      "version": "v1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "UMSO Enchanting Modular Add-On-50995-v1-00.rar",
      "uploadedUnix": "1410668526",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/871f500203b69a265e9e31d2777c4a9b8398ebbada921c6c22c92cd1e48e99f7/analysis/1410668642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Enchanting%20Modular%20Add-On-50995-v1-00.rar?fid=1000126804&ttl=1535833065&ri=8192&rs=8192&setec=9484e5bca3bf40837c5f8513aed4b3b1"
    },
    {
      "fileId": "1000134919",
      "name": "Unofficial Morrowloot-Skyrim Overhaul(previous version)",
      "version": "v1.50",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "104153",
      "fileName": "Unofficial Morrowloot-Skyrim Overhaul-50995-v1-50.rar",
      "uploadedUnix": "1415754448",
      "modVersion": "v1.50",
      "virusScanUrl": "https://www.virustotal.com/file/6f5d2705f160557dbd07e1ac324c8fa14b40f711b5e6b6a3586228935993e31c/analysis/1415754569/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Morrowloot-Skyrim%20Overhaul-50995-v1-50.rar?fid=1000134919&ttl=1535833065&ri=8192&rs=8192&setec=f2573ec420a178710226245b31a5a5ef"
    },
    {
      "fileId": "1000134923",
      "name": "UMSO Ingredient Crafting Modular Add-On",
      "version": "v1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "UMSO Ingredient Crafting Modular Add-On-50995-v1-00.rar",
      "uploadedUnix": "1415758211",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/e33d4b9f0de96dbab7c9af979532e39633ad454e0204d3b2f0f2bb588fe2f03c/analysis/1415758323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Ingredient%20Crafting%20Modular%20Add-On-50995-v1-00.rar?fid=1000134923&ttl=1535833066&ri=8192&rs=8192&setec=69f592c5b564617b0f2ee2e421e92d9e"
    },
    {
      "fileId": "1000134924",
      "name": "UMSO Perks Modular Add-On(Previous Version)",
      "version": "v1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10",
      "fileName": "UMSO Perks Modular Add-On (old version)-50995-v1-10.rar",
      "uploadedUnix": "1415758307",
      "modVersion": "v1.10",
      "virusScanUrl": "https://www.virustotal.com/file/860d31b171bd60056e24f422bf6ff6f00780a78ecae6c47cb9a709ad732facd5/analysis/1415758382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Perks%20Modular%20Add-On%20%28old%20version%29-50995-v1-10.rar?fid=1000134924&ttl=1535833066&ri=8192&rs=8192&setec=ec51b08f780c40a529b34bcb2bfda576"
    },
    {
      "fileId": "1000134925",
      "name": "UMSO Occupied Forts Modular Add-On (Test Version)",
      "version": "v0.9",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "UMSO Occupied Forts Modular Add-On (Test Version)-50995-v0-9.rar",
      "uploadedUnix": "1415758477",
      "modVersion": "v0.9",
      "virusScanUrl": "https://www.virustotal.com/file/629532b13a438b1131c9252d54b49f09cd17c22101a9f2564c4e7aae149aa9b0/analysis/1415758562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Occupied%20Forts%20Modular%20Add-On%20%28Test%20Version%29-50995-v0-9.rar?fid=1000134925&ttl=1535833067&ri=8192&rs=8192&setec=91cfb76b872acd17ed41e87afe1c611f"
    },
    {
      "fileId": "1000212605",
      "name": "Unofficial Morrowloot-Skyrim Overhaul",
      "version": "v1.60",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "298008",
      "fileName": "Unofficial Morrowloot-Skyrim Overhaul-50995-v1-60.rar",
      "uploadedUnix": "1468038133",
      "modVersion": "v1.60",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Morrowloot-Skyrim%20Overhaul-50995-v1-60.rar?fid=1000212605&ttl=1535833068&ri=8192&rs=8192&setec=17dc63a44b8403ab8f3c82f98fff1800"
    },
    {
      "fileId": "1000212606",
      "name": "UMSO Perks Modular Add-On",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "UMSO Perks Modular Add-On-50995-.rar",
      "uploadedUnix": "1468038225",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5bceaf9af85d09b82843088b1ffdca41486d9ec6d62eff4119a440f2a25d7ad1/analysis/1468038243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Perks%20Modular%20Add-On-50995-.rar?fid=1000212606&ttl=1535833068&ri=8192&rs=8192&setec=2679d64bbaab20d991aeb078c78229e1"
    },
    {
      "fileId": "1000262225",
      "name": "Unofficial Morrowloot-Skyrim Overhaul",
      "version": "1.70",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "391008",
      "fileName": "Unofficial Morrowloot-Skyrim Overhaul-50995-1-70.rar",
      "uploadedUnix": "1513629959",
      "modVersion": "1.70",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Morrowloot-Skyrim%20Overhaul-50995-1-70.rar?fid=1000262225&ttl=1535833068&ri=8192&rs=8192&setec=89bf6dd25f6e20bbbfd7b50ebbb0e0be"
    },
    {
      "fileId": "1000262226",
      "name": "UMSO Holds Compatible Version",
      "version": "1.70",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1137",
      "fileName": "UMSO Holds Compatible Version-50995-1-70.rar",
      "uploadedUnix": "1513630185",
      "modVersion": "1.70",
      "virusScanUrl": "https://www.virustotal.com/file/b398d95e3406b5d07b4f32b47fa9d70ef64995363f6f89e43aa5d3dbaeed042e/analysis/1513630206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Holds%20Compatible%20Version-50995-1-70.rar?fid=1000262226&ttl=1535833069&ri=8192&rs=8192&setec=4598c5d298db66648b05fadcf6ceb028"
    },
    {
      "fileId": "1000262237",
      "name": "Unofficial Morrowloot-Skyrim Overhaul",
      "version": "v1.70",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "390955",
      "fileName": "Unofficial Morrowloot-Skyrim Overhaul-50995-v1-70.rar",
      "uploadedUnix": "1513637701",
      "modVersion": "v1.70",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Morrowloot-Skyrim%20Overhaul-50995-v1-70.rar?fid=1000262237&ttl=1535833069&ri=8192&rs=8192&setec=839c53214b6c64766bf500e8f6208f26"
    },
    {
      "fileId": "1000262241",
      "name": "Unofficial Morrowloot-Skyrim Overhaul",
      "version": "1.71",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "390955",
      "fileName": "Unofficial Morrowloot-Skyrim Overhaul-50995-1-71.rar",
      "uploadedUnix": "1513643848",
      "modVersion": "1.71",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Morrowloot-Skyrim%20Overhaul-50995-1-71.rar?fid=1000262241&ttl=1535833070&ri=8192&rs=8192&setec=56ed10e4618076791d04b06ecde00f29"
    },
    {
      "fileId": "1000262242",
      "name": "UMSO Holds Compatible Version",
      "version": "1.71",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1137",
      "fileName": "UMSO Holds Compatible Version-50995-1-71.rar",
      "uploadedUnix": "1513644413",
      "modVersion": "1.71",
      "virusScanUrl": "https://www.virustotal.com/file/8369dd8b62edb074a72a41f21193aaed42854a2d4e873dbab23f0d28347e6361/analysis/1513644486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Holds%20Compatible%20Version-50995-1-71.rar?fid=1000262242&ttl=1535833070&ri=8192&rs=8192&setec=e62c093a2807d263c5da4b5795d4991f"
    },
    {
      "fileId": "1000262355",
      "name": "Unofficial Morrowloot-Skyrim Overhaul",
      "version": "1.72",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "390053",
      "fileName": "Unofficial Morrowloot-Skyrim Overhaul-50995-1-72.rar",
      "uploadedUnix": "1513800426",
      "modVersion": "1.72",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Morrowloot-Skyrim%20Overhaul-50995-1-72.rar?fid=1000262355&ttl=1535833071&ri=8192&rs=8192&setec=6fb3c69b99a800d80c7d99e0cb2c2acf"
    },
    {
      "fileId": "1000263739",
      "name": "Unofficial Morrowloot-Skyrim Overhaul",
      "version": "1.73",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "390055",
      "fileName": "Unofficial Morrowloot-Skyrim Overhaul-50995-1-73.rar",
      "uploadedUnix": "1515640618",
      "modVersion": "1.73",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Morrowloot-Skyrim%20Overhaul-50995-1-73.rar?fid=1000263739&ttl=1535833071&ri=8192&rs=8192&setec=dd25ebecffd2ae201bae6e9a754dfd47"
    },
    {
      "fileId": "1000263740",
      "name": "UMSO Holds Compatible Version",
      "version": "1.73",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1135",
      "fileName": "UMSO Holds Compatible Version-50995-1-73.rar",
      "uploadedUnix": "1515640670",
      "modVersion": "1.73",
      "virusScanUrl": "https://www.virustotal.com/file/0eafe61c3cd9e5c3e5af6b29b366824082a5c62d4cc66990c69ecf21407e0136/analysis/1515640925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UMSO%20Holds%20Compatible%20Version-50995-1-73.rar?fid=1000263740&ttl=1535833072&ri=8192&rs=8192&setec=96f37fe308c7d19505a533bd57557bbe"
    }
  ]
}