{
  "modId": 51019.0,
  "modName": "The Sanctum",
  "summary": "A player home alternative in the heart of Whiterun",
  "descriptionHtml": "     The Sanctum was an oasis of solace built right off the main square of Whiterun. It served as a place of peace for the citizens of Tamriel right up until the day it was mysteriously transported. A magical gateway has been established to the Sanctum&#39;s current resting place - a location of shadow and beauty.\r<br />\r<br />     Yes, I know, all this community needs is another player home, but bear with me for a moment. I, like many of you, have tried many players homes. Quite a few of them are stunning, both visually, and creatively. But aside from walking their halls like a gawking tourist, sometimes staying for awhile, I never committed to leaving Breezehome for one simple reason - PLAYABILITY. For my tastes, many of these homes are in isolated or out of the way locations, making loot drop offs or shopping trips a chore. Some were too small, making me feel cramped, others so large they didn&#39;t feel like a home (this is just my opinion of course). In many mods, crafting stations and item storage are often located in a unfriendly, scattered manner, requiring a good pair of running shoes. I wanted an alternative to Breezehome, something that not only looked amazing, but kept (and improved upon) what I liked about it so much.\r<br />\r<br />     The Sanctum was designed with this in mind. After a month of play-testing the bugs are squashed (fingers crossed), the lights are adjusted just right, and I find no reason to go back to Breezehome. Listed below are the design concepts I kept in mind while the Sanctum was under construction. If they sound appealing, give the mod a spin. If not, happy adventuring&#33;\r<br />     \r<br />     Location- Just off the main square of Whiterun with all the benefits that provides.\r<br />     Friendly Crafting- Centrally located crafting and material storage. Why make crafting a chore?\r<br />     Beautiful- A pleasure to see from the first time to the thousandth time.\r<br />     Original Design- No grid-snapping cookie cutter layout here. Meticulously hand crafted.\r<br />     Custom Travel- Activate the Sanctum&#39;s light travel system for fast travel throughout Tamriel.\r<br />     Custom Music- A couple of soundscape music tracks to enhance the mood.\r<br />     Easter Eggs- Just simple stuff like books and secret doors to create a little history.\r<br />     Size- Plenty of room for you and some followers, but not an empty castle.\r<br />     Storage- Lots of custom named storage containers for all of your organizing requirements.\r<br />     Vendors- Two vendors inside to buy and sell goods with.\r<br />     Displays- Alright, mannequins and display cases are basically expected.\r<br />     Mood- Beautiful but somber. This isn&#39;t for people who require bright lights.\r<br />     Layout- Straight forward. No mazes and winding hallways to waste time in.\r<br />     NO LOAD DOORS&#33; Just one to get in and one to get out. NONE inside. (I hate them)\r<br />     Cleaned- Mod fully cleaned with TES5V edit to delete &#34;dirty edits&#34;\r<br />\r<br />     I know full well that mods are all about personal taste. What one person loves another will disdain. I hope that anyone who feels the same way I do about wanting a PLAYABLE home alternative to Breezehome at least give this mod a test run. Comments and suggestions are welcome. Enjoy.\r<br />\r<br />Requirements:\r<br />\r<br />The included music should be installed automatically by NMM whether or not you already have a Music folder made.  If for some reason it doesn&#39;t, then inside your Skyrim&#39;s Data folder you need to make a folder called Music. The mod will work without them, but the mood will be lessened and a scripted event will seem a little confusing. The mod can manually be installed without music for a smaller download, and the music can later be manually downloaded and installed for those that change their mind.   \r<br />     \r<br /> No download content required. No other mods required (but many of them would make this one look a lot better). Just use the most up to date version of Skyrim.\r<br />\r<br />Known Issues:\r<br />\r<br />     There is a mod called &#34;Open Cities Skyrim&#34;. If you are running it and cannot find the Sanctum entrance along the city wall by the main square in Whiterun, then the OCS mod is likely preventing it from showing. There may also be a mod out there that uses the same physical location as this mod, but I tried to keep the footprint very small to limit this chance.\r<br />     \r<br />     Sometimes the mannequins shift locations when you go inside. This is not a mod bug, but a known problem with mannequins. More than likely they will return to their intended position next time you enter.\r<br />     \r<br />     Insects are meant to spawn inside for mood, but sometimes they become mischievous and knock over small items as they fly around. Blame them for the mess.\r<br />     \r<br />     For those of you who use mods that allow many followers at once, like AFT, don&#39;t leave more than 4 inside with another following you. Too many followers in one location destroys the game&#39;s memory, causing massive memory leaks and eventually crashes. I suggest storing additional followers in other nearby buildings.",
  "categoryId": "67",
  "version": "1.2",
  "author": "kallay3",
  "createdUnix": "1392171325",
  "updatedUnix": "1393208873",
  "containsAdultContent": false,
  "uploadedBy": "kallay3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096586",
      "name": "Music",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "60881",
      "fileName": "Music-51019-1-0.zip",
      "uploadedUnix": "1392171926",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/049674945993aac7fbdb54fb839dcc6bf806bd82ea606b3bcd2dbfe96d744831/analysis/1407929683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Music-51019-1-0.zip?fid=1000096586&ttl=1535833129&ri=8192&rs=8192&setec=3991634d997397a830385242a002c92e"
    },
    {
      "fileId": "1000098493",
      "name": "The Sanctum",
      "version": "1.2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "60995",
      "fileName": "The Sanctum-51019-1-2.zip",
      "uploadedUnix": "1393207867",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d7eba1efae173df4de68c8204e4259f786f3e6b12960aaa7f5260a959fa13d43/analysis/1407947662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Sanctum-51019-1-2.zip?fid=1000098493&ttl=1535833129&ri=8192&rs=8192&setec=1b2fdd2acbfe44c8395ff2a440e2d5fc"
    },
    {
      "fileId": "1000098494",
      "name": "Sanctum no music",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "114",
      "fileName": "Sanctum no music-51019-1-2.zip",
      "uploadedUnix": "1393208341",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/777cb63f286643aee2333d99ba56a0372a7ea86e7967ee3df3de49112be86025/analysis/1407947707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sanctum%20no%20music-51019-1-2.zip?fid=1000098494&ttl=1535833130&ri=8192&rs=8192&setec=82d5e93f0e2cb0d693e029e3e9eb9cc3"
    },
    {
      "fileId": "1000098497",
      "name": "Sanctum",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "60995",
      "fileName": "Sanctum-51019-1-2.zip",
      "uploadedUnix": "1393208873",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d7eba1efae173df4de68c8204e4259f786f3e6b12960aaa7f5260a959fa13d43/analysis/1407947662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sanctum-51019-1-2.zip?fid=1000098497&ttl=1535833130&ri=8192&rs=8192&setec=31fb912506402e8c72557566aeff3da4"
    }
  ]
}