{
  "modId": 51025.0,
  "modName": "Neapolitan ENB",
  "summary": "A performance-friendly ENB preset for ENB v0.251 and newer.  Respects the vanilla style, darkens nights and dungeons, and adds some color to the world.",
  "descriptionHtml": "[center][img]http://static-2.nexusmods.com/15/mods/110/images/51025-1-1392789175.jpg[/img][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5]Neapolitan[/size][/b] [i][size=3](adjective)[/i]:\r<br />\r<br />1. of, pertaining to, or characteristic of the city Naples, Italy\r<br />2. a mixture of three different flavors of ice cream, usually vanilla, chocolate, and strawberry, served side-by-side in the same container[/size]\r<br />\r<br />(Obviously, I was thinking of the latter definition when I came up with the name.)\r<br />\r<br />\r<br />\r<br />[b][size=3][color=#FDD017]--- What is Neapolitan ENB? ---[/color][/size][/b]\r<br />\r<br />&#39;Neapolitan ENB&#39; is simply a preset for the visual effect suite known as ENBSeries.  There are countless such presets for Skyrim, this one being my personal creation that I felt like sharing with the community.  Here&#39;s a breakdown of what it does:\r<br />\r<br />\r<br />[b][color=#FDE0AC]Vanilla[/color][/b]\r<br />To start, I wanted to respect the vanilla visual style, something I feel too few ENB presets do.  I actually like the way vanilla Skyrim looks (for the most part), and so I didn&#39;t want to crap on Bethesda&#39;s artistic vision by using ultra-saturated colors or a bunch of cinematic effects that give the player a completely different game experience.  My efforts to mimic the vanilla style are most noticeable on clear days and daytime interiors.\r<br />\r<br />[b][color=#C85A17]Chocolate[/color][/b]\r<br />Second, I wanted to darken the nights and dungeons.  I know I just got done yapping about how much I love vanilla Skyrim, but even I could see that the default night visuals were WAY too bright.  With Neapolitan ENB, nights will actually feel different from days, and players will be encouraged to use lighting aids (torches, lanterns, candlelight spells, night eye) when traveling at night or traversing dungeons.\r<br />\r<br />[b][color=#FAAFBA]Strawberry[/color][/b]\r<br />The last part is straightforward; I wanted more color in my game.  Not much more, mind you, but just enough to liven up the otherwise cold and drab world of Skyrim.  Neapolitan is still less colorful than most other ENB presets.\r<br />\r<br />\r<br />[b][color=#50EBEC]Other Important Notes:[/color][/b]\r<br />\r<br />[list][b][i]This ENB is (relatively) performance-friendly.[/i][/b][/list]\r<br />Naturally, I originally made this ENB for personal use.  And as I don&#39;t have a terribly powerful computer, Neapolitan is by its very nature performance-friendly (by ENB standards, at least).  I didn&#39;t go crazy with the anti-aliasing, I was conservative with the effects, and I chose medium quality settings instead of high whenever possible.  This preset does use many of the more visually apparent effects, such as ambient occlusion, detailed shadows, and water, but, for performance reasons, doesn&#39;t use some of the less noticeable effects such as subsurface scattering and image-based lighting.\r<br />\r<br />[list][b][i]This ENB is not &#34;cinematic.&#34;[/i][/b][/list]\r<br />By that, I mean Neapolitan does not use depth of field, lens, sun glare, letterbox, vignette...things like that.  I don&#39;t care for these effects, as I don&#39;t think they look realistic and seldom even look good.  I don&#39;t want my game to look like a movie, because it&#39;s not a movie.\r<br />\r<br />However, as of version 1.1, DoF is configured for anyone who would like to use it (settings can be viewed/changed in enbeffectprepass.fx).  The effect is disabled by default, and I still don&#39;t care for it, but I know how much you guys love taking screenshots of your waifus snuggled up to the camera with the background blurred to Oblivion.  Have fun.\r<br />\r<br />\r<br />-------------------------------\r<br />Of course, words can only say so much.  If you want to get a better idea of what Neapolitan is like, go check out the screenshots in the images section (or just install it and have a look for yourself).\r<br />\r<br />\r<br />\r<br />[b][size=3][color=#FDD017]--- Change Log ---[/color][/size][/b]\r<br />\r<br />[i]v1.11[/i]\r<br />- bloom decreased slightly in daytime exteriors\r<br />- interior and exterior sky settings matched up (for when you&#39;re in a dungeon with a hole in the ceiling)\r<br />- adaptation tweaks\r<br />- cloud shadows decreased further\r<br />\r<br />[i]v1.1[/i]\r<br />- DoF support added in enbeffectprepass.fx file\r<br />- more sky tweaks\r<br />- less intense cloud shadows\r<br />- slightly more bloom\r<br />\r<br />[i]v1.021[/i]\r<br />- top gradient on daytime skies slightly darker\r<br />- sun is a bit smaller, brighter\r<br />- night sky gradient intensity slightly increased\r<br />- daytime exteriors brightened a little bit\r<br />\r<br />[i]v1.02[/i]\r<br />- release version\r<br />\r<br />\r<br />\r<br />[b][size=3][color=#FDD017]--- Requirements and Recommendations ---[/color][/size][/b]\r<br />\r<br />[b][color=#50EBEC]Requirements:[/color][/b]\r<br />[list]ENB v0.251 or newer\r<br />[url=http://www.nexusmods.com/skyrim/mods/27043/?]Enhanced Lights and Effects (ELFX)[/url] - interior module only*\r<br />[url=http://www.nexusmods.com/skyrim/mods/12454/?](Further) Dark Dungeons for ENB[/url]*\r<br />ENB Helper**[/list]\r<br />* ELFX and Dark Dungeons are not, strictly speaking, [i]required[/i], but they are necessary for Neapolitan to look as intended.\r<br />** ENB Helper isn&#39;t really mandatory either, but Boris recommends it for version 0.250 and above, due to the new mist effect.  I haven&#39;t noticed any differences when using ENB Helper, but if you want to play it safe, you can download it from http://www.dev-c.com/skyrim/\r<br />\r<br />\r<br />[b][color=#50EBEC]Recommendations (i.e. what mods you should download if you want your game to look like the screenshots I uploaded):[/color][/b]\r<br />[list] [url=http://www.nexusmods.com/skyrim/mods/41076/?]RealisticWaterTwo[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49011/?]Quality Snow HD[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10383/?]Better Dynamic Snow[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/5388/?]Real Ice[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/4910/?]Dramatic Clouds[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/28642/?]Ultimate HD Fire Effects[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/8655/?]Static Mesh Improvement Mod (SMIM)[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/607/?]Skyrim HD[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24909/?]aMidianBorn Book of Silence[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/141/?]Skyrim Flora Overhaul[/url]\r<br />and any other hd texture mod you can get your hands on (I&#39;m running too many to list)[/list]\r<br />\r<br />[b][color=#50EBEC]Not Recommended (i.e. could make Neapolitan look ugly and/or not as intended):[/color][/b]\r<br />[list]ELFX enhancer module\r<br />Realistic Lighting Overhaul\r<br />Climates of Tamriel (CoT)\r<br />any other lighting mod that I didn&#39;t specifically recommend[/list]\r<br />Note: I&#39;m not saying you can&#39;t use the above mods with Neapolitan, only that I developed this ENB using ELFX interiors and have not tested it with other lighting/climate mods.  I may release a CoT-friendly version in the future, but it&#39;s not a priority.\r<br />\r<br />\r<br />\r<br />[b][size=3][color=#FDD017]--- Installation ---[/color][/size][/b]\r<br />\r<br />If you&#39;ve installed ENBs before, then you should know what to do.  Just make sure you have ENBSeries v0.251 or newer.\r<br />\r<br />If you haven&#39;t installed an ENB before, then this section is for you.  First, you want to go to enbdev.com, home site of ENBSeries.  Navigate to the Skyrim section, and look for ENBSeries v0.251 (or whatever version is the most recent).  Download the file, and extract the contents of the archive somewhere on your computer.  Next, go into the &#39;WrapperVersion&#39; folder and copy/move all of the necessary files* into your Skyrim folder (the folder with SkyrimLauncher.exe in it).  After that, download Neapolitan ENB v1.11 from this page (if you haven&#39;t already), and extract the contents of the archive.  Finally, copy/move the files (there&#39;s only 5 of them) from the Neapolitan folder into your Skyrim folder, overwriting when prompted.  That&#39;s all there is to it.\r<br />\r<br />* The &#34;necessary files&#34; are everything other than the readmes and other text files.  You don&#39;t have to copy those.\r<br />\r<br />(Boris doesn&#39;t like people hosting his files offsite, which is why it&#39;s not simply included in the Nexus download)\r<br />\r<br />\r<br />[b][color=#50EBEC]IMPORTANT NOTES:[/color][/b]\r<br />\r<br />After you&#39;ve installed Neapolitan ENB, open up enblocal.ini for customization options and instructions for correctly configuring your memory settings.\r<br />\r<br />Additionally, in order for ENBSeries to function correctly, the following settings should be set to a value of 1 in your SkyrimPrefs.ini file, under the [Display] section.\r<br />[list]bFloatPointRenderTarget=1\r<br />bTreesReceiveShadows=1\r<br />bDrawLandShadows=1\r<br />bShadowsOnGrass=1[/list]\r<br />Also, make sure your brightness setting is around medium (in the middle of the slider bar).  This isn&#39;t an ENB that forces you to turn down your brightness, and it probably won&#39;t look right if you do.\r<br />\r<br />\r<br />[b][size=3][color=#FDD017]--- Credits ---[/color][/size][/b]\r<br />\r<br />Neapolitan ENB preset created by Lazy Dreamer\r<br />\r<br />ENBSeries created by and copyrighted to Boris Vorontsov, a true modern-day hero\r<br />\r<br />Special shoutout to HeliosDoubleSix (HD6) and his fantastic [url=http://www.nexusmods.com/skyrim/mods/4142/?]Cinematic Lighting ENB (CLENB)[/url].  Neapolitan actually started out as an updated version of CLENB, but soon became different enough to be considered its own preset.  Additionally, much of HD6&#39;s color/lighting balance code is used in Neapolitan&#39;s enbeffect.fx file.  Go check out CLENB if you&#39;d like a good-looking ENB that&#39;s simple and even more lightweight than Neapolitan.\r<br />\r<br />Also, special thanks to Matso for his depth of field configuration.  Be sure to check out [url=http://www.nexusmods.com/skyrim/mods/25451/?]his ENB[/url], especially if you&#39;d like something more colorful than Neapolitan.\r<br />\r<br />\r<br />\r<br />[b][size=3][color=#FDD017]--- Other Mods by the Author ---[/color][/size][/b]\r<br />\r<br />[list][url=http://www.nexusmods.com/skyrim/mods/48657/?]Dragon Shouts Rebalanced[/url]: improves, fixes, and balances the dragon shouts\r<br />[url=http://www.nexusmods.com/skyrim/mods/52071/?]RACISM[/url]: improves and balances the racial abilities/powers\r<br />[url=http://www.nexusmods.com/skyrim/mods/48645/?]Numerical Smithing Upgrades[/url]: improves the weapon and armor improvement names\r<br />[/list]",
  "categoryId": "97",
  "version": "1.11",
  "author": "Lazy Dreamer",
  "createdUnix": "1392879116",
  "updatedUnix": "1394756438",
  "containsAdultContent": false,
  "uploadedBy": "LazyDreamer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101120",
      "name": "Neapolitan ENB",
      "version": "1.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "Neapolitan ENB-51025-1-11.7z",
      "uploadedUnix": "1394756438",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/b9b35c7c8959280e569002558c1f8f32279de4903c65688d2f3a149b08089117/analysis/1407981424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Neapolitan%20ENB-51025-1-11.7z?fid=1000101120&ttl=1535833137&ri=8192&rs=8192&setec=5ad6abf6c3aff318ec5d9ba53d68933e"
    }
  ]
}