{
  "modId": 51055.0,
  "modName": "Ugly the Cat",
  "summary": "Well it&#39;s a cat follower with a big back story",
  "descriptionHtml": "\r<br />You will find find this little guy in Windhelm by the market stalls\r<br />\r<br />\r<br />This isn&#39;t my texture. This is Pets of Skyrim texture. It&#39;s a place holder till I make my own so enjoy \r<br />http://www.nexusmods.com/skyrim/mods/17424/\r<br />\r<br />\r<br />If you want to hear the story then listen to it here\r<br />\r<br />https://www.youtube.com/watch?v=Hx7Hn90yqRs\r<br />\r<br />\r<br />The story of Ugly the Cat is sad, be prepared to cry \r<br />&#34;Everyone in the apartment complex I lived in knew who Ugly was. Ugly was the resident tomcat. Ugly loved three things in this world: fighting, eating garbage, and, shall we say, love.The combination of these things combined with a life spent outside had their effect on Ugly. To start with, he had only one eye and where the other should have been was a hole. He was also missing his ear on the same side, his left foot appeared to have been badly broken at one time, and had healed at an unnatural angle, making him look like he was always turning the corner.Ugly would have been a dark gray tabby, striped type, except for the sores covering his head, neck, and even his shoulders. Every time someone saw Ugly there was the same reaction. “That’s one UGLY cat &#33;”All the children were warned not to touch him, the adults threw rocks at him, hosed him down, squirted him when he tried to come in their homes, or shut his paws in the door when he would not leave. Ugly always had the same reaction.If you turned the hose on him, he would stand there, getting soaked until you gave up and quit. If you threw things at him, he would curl his lanky body around your feet in forgiveness.Whenever he spied children, he would come running, meowing frantically and bump his head against their hands, begging for their love.If you ever picked him up he would immediately begin suckling on your shirt, earrings, whatever he could find.One day Ugly shared his love with the neighbor’s dogs. They did not respond kindly, and Ugly was badly mauled. I tried to rush to his aid. By the time I got to where he was laying, it was apparent Ugly’s sad life was almost at an end.As I picked him up and tried to carry him home, I could hear him wheezing and gasping, and could feel him struggling. It must be hurting him terribly, I thought.Then I felt a familiar tugging, sucking sensation on my ear. Ugly, in so much pain, suffering and obviously dying, was trying to suckle my ear. I pulled him closer to me, and he bumped the palm of my hand with his head, then he turned his one golden eye towards me, and I could hear the distinct sound of purring.Even in the greatest pain, that ugly battled scarred cat was asking only for a little affection, perhaps some compassion. At that moment I thought Ugly was the most beautiful, loving creature I had ever seen. Never once did he try to bite or scratch me, try to get away from me, or struggle in any way. Ugly just looked up at me completely trusting in me to relieve his pain.Ugly died in my arms before I could get inside, but I sat and held him for a long time afterwards, thinking about how one scarred, deformed little stray could so alter my opinion about what it means to have true pureness of spirit, to love so totally and truly.Ugly taught me more about giving and compassion than a thousand books, lectures, or talk show specials ever could, and for that I will always be thankful. He had been scarred on the outside, but I was scarred on the inside, and it was time for me to move on and learn to love truly and deeply. To give my total to those I cared for.Many people want to be richer, more successful, well liked, beautiful, but for me…I will always try to be Ugly.&#34;\r<br />\r<br />",
  "categoryId": "96",
  "version": "1.0",
  "author": "LittlVienna",
  "createdUnix": "1392266397",
  "updatedUnix": "1392346554",
  "containsAdultContent": false,
  "uploadedBy": "LittleVienna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096790",
      "name": "Ugly_the_Cat",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "Ugly_the_Cat-51055-0-1.zip",
      "uploadedUnix": "1392266351",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/9d427a234442d394e3b42b197436205f811f8c9e2811ae8bbdd89e4e6680ade2/analysis/1407931344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ugly_the_Cat-51055-0-1.zip?fid=1000096790&ttl=1535833173&ri=8192&rs=8192&setec=8e77d9625fdfea7a3d2a2eea90508004"
    },
    {
      "fileId": "1000096941",
      "name": "UglyTheCat",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "UglyTheCat-51055-1-0.zip",
      "uploadedUnix": "1392346554",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ee249653745aa3ddf9de0261b776840b81cf61ef3b438b2fd7a62fa2691dcf2b/analysis/1407932623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UglyTheCat-51055-1-0.zip?fid=1000096941&ttl=1535833174&ri=8192&rs=8192&setec=2fd4d3cf00557e6f9ec0bd84136dedee"
    }
  ]
}