{
  "modId": 51052.0,
  "modName": "Skyrim Uncut",
  "summary": "This mod reintroduces a variety of items and spells that were left in the game files, but are entirely unused or were never completed by Bethesda. Also applies some small fixes to some items.",
  "descriptionHtml": "[color=Darkcyan][center][u][size=18][b]Skyrim Uncut[/b][/size][/u][/color]\r<br />Version 1.2 \r<br />See changes tab for changelog[/center]\r<br />\r<br />Requires: Unofficial Skyrim Patch and (if using the Dawnguard file) Unofficial Dawnguard Patch.\r<br />\r<br />This mod is a compilation of items and spells that were left in the game files, but are entirely unused. In most cases, they appear to have simply been left out by accident. Others were incomplete and needed a bit of polishing off to be reintroduced to the game. This mod also applies some small fixes to several items that are already obtainable in the game.\r<br />\r<br />Please note that there is a separate .esp file for Dawnguard. It needs be to used in addition to the main file for all of the changes to take effect. This mod is compatible with the unofficial patches (as it requires them) and Cutting Room Floor. If you have other mods that happen to affect one of these items, I recommend letting them override this one.\r<br />\r<br />This mod is compatible with Cutting Room Floor. It does conflict with SkyRE (the Fade Other spell tome won&#39;t appear) and possibly other overhaul mods. I am working on compatibility for selected mods, and will update when this is available.\r<br />\r<br />Here&#39;s all the content enabled or added by this mod:\r<br />\r<br />[center][u][b]Spells[/b][/u]\r<br />\r<br />[color=MediumTurquoise][b]Spectral Arrow[/b][/color]\r<br />[color=MediumTurquoise][I]Fires a Spectral Arrow at the target doing 30 points of damage and staggering the target.[/I][/color]\r<br />This was meant to be the reward for the &#34;Infiltration&#34; quest, and now you&#39;ll receive it instead of Detect Life. In addition, the tome now uses the correct mesh. If you&#39;ve already completed the quest, you can add it with the console command &#34;player.additem 000b3165 1&#34;\r<br />\r<br />[color=MediumTurquoise][b]Fade Other[/b][/color]\r<br />[color=MediumTurquoise][I]Target is invisible for 30 seconds. Activating an object or attacking will break the spell.[/I][/color]\r<br />A tome has been created for this spell, which was otherwise complete. It may be purchased from Drevis Neloren when you have reached Expert level in Illusion. NPCs have recorded reactions to being turned invisible&#33;\r<br />\r<br />[color=MediumTurquoise][b]Transmogrify[/b][/color]\r<br />[color=MediumTurquoise][I]Turns a low level enemy into a harmless creature for 30 seconds or until they take damage[/I][/color]\r<br />A tome has been created for this spell, and can be found in the Pelagius Wing of Solitude&#39;s Blue Palace. The effect is identical to the Wabbajack&#39;s transmogrify effect, although just like that item this effect does not seem to work properly with guards. This spell does not work on Dragons and Dwemer constructs. Daedra and Undead can only be affected with the Master of the Mind perk.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color] \r<br />[color=MediumTurquoise][b]Circle of Vitality[/b][/color] \r<br />[color=MediumTurquoise][I]Any allies inside the ring will regenerate 20 health per second.[/I][/color]\r<br />This is a Master level Restoration spell that functions similarly to Circle of Protection and Guardian Circle. Ever wondered why Guardian Circle doesn&#39;t heal allies? That&#39;s because this spell was intended to do just that, but Bethesda never even finished it. It was left very incomplete in the game files, but after a lot of work it&#39;s now available.  The tome for this spell may be purchased from Colette Marence once &#34;Restoration Ritual&#34; is completed. The spell restores health only to allies (and not the player) and will also restore Stamina to allies if you have the Respite perk.\r<br />\r<br />[u][b]Scrolls[/b][/u]\r<br />\r<br />[color=MediumTurquoise][b]Scroll of Dragonhide[/b][/color]\r<br />[color=MediumTurquoise][I]Caster ignores 90% of all physical damage for 30 seconds[/I][/color]\r<br />A single scroll now be found in the main chamber of High Hrothgar, although it is owned by the Greybeards.\r<br />\r<br />[color=MediumTurquoise][b]Scroll of Flame Thrall[/b][/color]\r<br />[color=MediumTurquoise][I]Summons a Flame Atronach permanently[/I][/color]\r<br />A single scroll can now be found in the Silent City area of Blackreach.\r<br />\r<br />[color=MediumTurquoise][b]Scroll of Dead Thrall[/b][/color]\r<br />[color=MediumTurquoise][I]Reanimate a dead body permanently to fight for you. Only works on people.[/I][/color]\r<br />A very powerful scroll, it&#39;s essentially a Dead Thrall freebie&#33; There is only one hidden in the world, and you&#39;ll have to hunt for this scroll yourself ;)\r<br />\r<br />[color=MediumTurquoise][b]Shalidor&#39;s Insights: Magicka[/b][/color]\r<br />[color=MediumTurquoise][I]Increases your Magicka by 100 points. Magicka regenerates 1% faster for 120 seconds.[/I][/color]\r<br />This powerful scroll is now available as a potential reward for completing &#34;Shalidor&#39;s Insights&#34; as originally intended.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color]\r<br />[color=MediumTurquoise][b]Scroll of Command Daedra[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Expel Daedra[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Fire Rune[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Flame Cloak[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Frost Cloak[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Frost Rune[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Lightning Bolt[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Lightning Cloak[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Lightning Rune[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Pacify[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Rally[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Reanimate Corpse[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Repel Lesser Undead[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Revanant[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Rout[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Turn Greater Undead[/b][/color]\r<br />[color=MediumTurquoise][b]Scroll of Waterbreathing[/b][/color]\r<br />Can now be found in random loot; this may not be the exact list. All of these scrolls are in leveled lists, but the lists themselves weren&#39;t assigned to anything or were in a chain of unused lists, hence these scrolls are normally unobtainable except for a few that are placed in static locations.\r<br />\r<br />[u][b]Weapons[/b][/u]\r<br />\r<br />[color=MediumTurquoise][b]Briarheart Geis[/b][/color] \r<br />[color=MediumTurquoise][I]5 points of extra damage to Nords[/I][/color]\r<br />Found in Lost Valley Redoubt. It&#39;s carried by the boss of this area, as originally intended. Can no longer be disenchanted.\r<br />\r<br />[color=MediumTurquoise][b]Ghorbush&#39;s Ancestral Axe[/b][/color]\r<br />Already placed in game but permanently disabled due to being related to a deleted quest. Now enabled to appear at all times in Burgak&#39;s Longhouse, for decoration&#39;s sake.\r<br />\r<br />[color=MediumTurquoise][b]Sild&#39;s Staff[/b][/color]\r<br />[color=MediumTurquoise][I]Summons a Subjugated Ghost for 60 seconds wherever the caster is pointing[/I][/color]\r<br />Now wielded by Sild the Warlock, as originally intended. The staff now uses its intended, and unique, enchantment (which itself has also been fixed). If you&#39;ve already killed Sild, you can add it with the console command &#34;player.additem 000a88c9 1&#34; \r<br />\r<br />[color=MediumTurquoise][b]Staff of the Fire Rune[/b][/color] \r<br />[color=MediumTurquoise][I]Cast on a nearby surface, it explodes for 40 points of fire damage when enemies come near.[/I][/color]\r<br />[color=MediumTurquoise][b]Staff of the Frost Rune[/b][/color]\r<br />[color=MediumTurquoise][I]Cast on a nearby surface, it explodes for 40 points of frost damage when enemies come near.[/I][/color]\r<br />[color=MediumTurquoise][b]Staff of the Shock Rune[/b][/color]\r<br />[color=MediumTurquoise][I]Cast on a nearby surface, it explodes for 40 points of shock damage when enemies come near.[/I][/color]\r<br />[color=MediumTurquoise][b]Staff of Fading[/b][/color]\r<br />[color=MediumTurquoise][I]Target is invisible for 30 seconds. Activating an object or attacking will break the spell.[/I][/color]\r<br />These four staves will cast Fire Rune, Frost Rune, Shock Rune and Fade Other respectively. They have been added to the appropriate leveled lists, so will appear as loot and also be available for sale from merchants.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color] \r<br />[color=MediumTurquoise][b]Ebony Blade[/b][/color] \r<br />[color=MediumTurquoise][I]Victim does not treat an attack with this weapon as an assault[/I][/color]\r<br />This is the &#34;real&#34; Ebony Blade, which will be silently swapped with the other blade once it has been fully powered, as originally intended. It doesn&#39;t absorb health, but instead holds a very special power that is hinted at in the Admonition Against Ebony note... anyone struck with the blade will not become hostile&#33;\r<br />\r<br />\r<br />[u][b]Armor[/b][/u]\r<br />\r<br />[color=MediumTurquoise][b]Ancient Falmer Crown[/b][/color] *[Dawnguard only]*\r<br />Now worn by Arch-Curate Vyrthur. It also now has an appropriate armor rating, and should work with Matching Set and Custom Fit perks.\r<br />\r<br />\r<br />[b]Clothing[/b]\r<br />\r<br />[color=MediumTurquoise][b]Brown Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Green Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Grey Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Red Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Hooded Red Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Hooded Brown Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Hooded Green Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Hooded Grey Robes[/b][/color]\r<br />Now all available for purchase at the Radiant Raiment in Solitude.\r<br />\r<br />[color=MediumTurquoise][b]College Boots[/b][/color] (2 variants)\r<br />[color=MediumTurquoise][b]Mage Hood[/b][/color] (2 variants)\r<br />[color=MediumTurquoise][b]College Robes[/b][/color]\r<br />[color=MediumTurquoise][b]Mantled College Robes[/b][/color] (3 variants)\r<br />Now all available for purchase from any of the College of Winterhold merchants.\r<br />\r<br />\r<br />[u][b]Potions[/b][/u]\r<br />\r<br />[color=MediumTurquoise][b]Elixir of Resist Magic[/b][/color]\r<br />[color=MediumTurquoise][I]Resist 50% of magic for 60 seconds[/I][/color]\r<br />This potion is now available in loot and from apothecaries as originally intended. Its place in leveled lists were incorrectly set to the Elixir of Resist Shock. \r<br />\r<br />[color=MediumTurquoise][b]Firebrand Wine[/b][/color] \r<br />[color=MediumTurquoise][I]Restore Stamina, 20 pts/Damage Stamina Regeneration, 30 pts for 45 secs/Resist Frost, 15 pts for 45 secs[/I][/color]\r<br />Now sold by Evette San at her stall in Solitude. This is not the crate of Firebrand Wine, it&#39;s an individual bottle.\r<br />\r<br />\r<br />[u][b]Books[/b][/u]\r<br />\r<br />[color=MediumTurquoise][b]Letter from Harkon[/b][/color] *[Dawnguard only]*\r<br />Now carried by Malkus, as originally intended. It provides a bit of background as to why he appears in Forebears&#39; Holdout.\r<br />\r<br />[color=MediumTurquoise][b]Habd&#39;s Death Letter[/b][/color]\r<br />Now found alongside his remains in the Frostflow Lighthouse, as originally intended.\r<br />\r<br />[color=MediumTurquoise][b]Letter from Jon[/b][/color]\r<br />Now carried by Olfina Grey-Mane, as originally intended. It can be used to blackmail Jon Battle-Born during &#34;Missing in Action&#34;, just like the Letter from Olfina.\r<br />\r<br />[color=MediumTurquoise][b]Letter to Vals Veran[/b][/color]\r<br />Now carried by Vals Veran in Hillgrund&#39;s Tomb, as originally intended.\r<br />\r<br />[color=MediumTurquoise][b]Mzinchaleft Guard&#39;s Note[/b][/color]\r<br />Now found in Mzinchaleft next to the door to Maluril&#39;s chamber. It was intended to be carried by the guard posted here, but this requires an unnecessary level of scripting so I decided to place it next to him.\r<br />\r<br />[color=MediumTurquoise][b]The Secrets of Ragnvald[/b][/color]\r<br />This book is now found inside Ragnvald, as originally intended. It&#39;s located on the altar in the entrance chamber.\r<br />\r<br />[u][b]Misc[/b][/u]\r<br />\r<br />[color=MediumTurquoise][b]Imperial War Horn[/b][/color]\r<br />One is now owned by General Tullius. It can be found in his quarters in Castle Dour in Solitude. It uses a unique mesh. \r<br />\r<br />[color=MediumTurquoise][b]Nord War Horn[/b][/color]\r<br />One is now owned by Ulfric Stormcloak. It can be found in his quarters in the Palace of Kings in Windhelm. It uses the same mesh as High King Torygg&#39;s war horn.\r<br />\r<br />\r<br />[u][b]Changed Items[/b][/u]\r<br />\r<br />The following items may exist and be obtainable in the game, but have been altered to correct some issues. They are NOT yet fixed in unofficial patches, and I will remove these fixes if and when they are incorporated.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color] \r<br />[color=MediumTurquoise][b]Staff of Jyrik Gauldurson[/b][/color]\r<br />Now applies Jyrik&#39;s Blessing when wielding the staff, as Bethesda intended (but forgot to attach the relevant script). The blessing will give increased Magicka and increase the rate of Magicka regeneration.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color] \r<br />[color=MediumTurquoise][b]Circle of Protection[/b][/color]\r<br />Uses correct visual effects in Active Effects menu.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color] \r<br />[color=MediumTurquoise][b]Guardian Circle[/b][/color]\r<br />Spell now restores Stamina if you have the Respite perk, just like all other healing spells. Uses correct visual effects in Active Effects menu.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color] \r<br />[color=MediumTurquoise][b]Scrolls[/b][/color]\r<br />As mentioned above, several unused scroll leveled lists are now in use. As a result, it is now possible to find more scrolls throughout the game as well as some that were practically unobtainable.\r<br />\r<br />[color=orange]*NEW in 1.2*[/color]\r<br />[color=MediumTurquoise][b]Argonian Ale\r<br />Balmora Blue\r<br />Cliff Racer\r<br />Cyrodilic Brandy\r<br />Double-Distilled Skooma\r<br />Esbern&#39;s Potion\r<br />Redwater Skooma[/b][/color] *[Dawnguard only]*\r<br />[color=MediumTurquoise][b]Skooma\r<br />Sleeping Tree Sap\r<br />Stros M&#39;Kai Rum\r<br />Velvet LeChance\r<br />White-Gold Tower[/b][/color]\r<br />These are all now classified as Food instead of Potions just like all other beverages in the game. They are identified in the Creation Kit as food, and can even be bought from/sold to Food merchants, but the flags to designate them as such were never set (thus the game automatically classifies them as potions).\r<br />\r<br />[u][b]Brief FAQ[/b][/u][/center]\r<br />\r<br />Q: X is a missing item. Why isn&#39;t X part of this mod?\r<br />A: There is some unused content that I have deliberately chosen not to bring back, as there are clear reasons for exclusion. e.g. the Polymorph Skeever spell is extremely buggy, unstable and not useful. Some items are simply duplicates, having been replaced with superior versions during development.\r<br />\r<br />Q: What about quests, NPCs, locations, etc?\r<br />A: I&#39;m only interested in bringing back items and magic. There are other mods out there that focus on bringing back that kind of content.",
  "categoryId": "24",
  "version": "1.2",
  "author": "DorsalAxe",
  "createdUnix": "1392252689",
  "updatedUnix": "1393110584",
  "containsAdultContent": false,
  "uploadedBy": "DorsalAxe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096845",
      "name": "Skyrim Uncut",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Skyrim Uncut-51052-1-1.rar",
      "uploadedUnix": "1392290082",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0494351e4aa7c50c8e8fa48f2a077911f684b3b2828af973ec4582a0123a95b2/analysis/1407931873/",
      "changelogHtml": " 2014/02/13\r<br />- Added dependencies on Unofficial Skyrim Patch and Unofficial Dawnguard Patch.\r<br />- Reverted some changes to increase compatibility with USKP and Cutting Room floor.\r<br />- Removed some erroneously used instances of Spectral Arrow tome.\r<br />- Mod has been manually cleaned with TES5Edit. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Uncut-51052-1-1.rar?fid=1000096845&ttl=1535833169&ri=8192&rs=8192&setec=d0ab32e2bc52917e2b5d1d7e40712814"
    },
    {
      "fileId": "1000098319",
      "name": "Skyrim Uncut",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "Skyrim Uncut-51052-1-2.rar",
      "uploadedUnix": "1393110584",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7ffed9508cbb1d1051099f12c2b7228b0da7411a8160283f09fc4cecf9709cae/analysis/1407945905/",
      "changelogHtml": " 2014/02/22\r<br />-Added Circle of Vitality spell\r<br />-Added real Ebony Blade\r<br />-Added Jyrik&#39;s Blessing\r<br />-Added several scrolls that are in leveled lists but cannot normally be obtained as the lists aren&#39;t assigned to anything\r<br />-Fixed several beverages that are incorrectly categorised as Potions instead of Food\r<br />-Removed Scroll of Telekinesis as it does not work correctly due to engine limitations\r<br />-Removed mesh fix for Spell Tome: Conjure Flaming Familiar as this has now been fixed in USKP\r<br />-Removed Wuuthrad fix as this has now been fixed in UDGP\r<br />-Transmogrify magicka cost has been increased to a sensible amount\r<br />-Attached correct script for Shalidor&#39;s Insights: Magicka scroll\r<br />-Further cleaning with TES5Edit. Mod should now be fully clean. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Uncut-51052-1-2.rar?fid=1000098319&ttl=1535833169&ri=8192&rs=8192&setec=91c1e7401a0b200416c385bd7c8470e1"
    }
  ]
}