{
  "modId": 51094.0,
  "modName": "The Field Lab 2",
  "summary": "A floating player home that can be summoned anywhere in the world.",
  "descriptionHtml": "[b][color=cadetblue]Für die deutsche Beschreibung bitte nach unten scrollen[/color][/b]\r<br />\r<br />[center][img]http://i.imgur.com/33c4NjQ.png[/img][/center]\r<br />[size=4][color=darkseagreen]This plug-in gives the player access to a unique, magic artifact: the field lab of Divayth Fyr – an ancient and powerful Telvanni mage from Vvardenfell. It is possible to summon this small home anywhere in the world, including cities and interiors with high ceilings such as caves or Dwemer ruins. The field lab&#39;s interior mainly contains furnishings for characters that are affiliated with magic, but might as well be used as a mobile safe house with storage possibilities.[/color][/size]\r<br />\r<br />\r<br />\r<br />[b][img]http://i.imgur.com/cKwP9vN.png[/img]\r<br />- Skyrim\r<br />- [size=4]Dragonborn DLC[/size]\r<br />[/b]\r<br />\r<br />Mod Configuration Menu requirements (optional and only needed if you want to use the new MCM options):\r<br />- SKSE (Skyrim Script Extender) version 1.6.6 or later\r<br />- SkyUI version 3.0 or later\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/untqNSE.png[/img]\r<br />– A brief introductory quest that provides the player with the key to the field lab. It starts with a letter, delivered by a messenger\r<br />(as usual it might take a while for the messenger to find the player).\r<br />\r<br />– A hovering field lab, built in the typical architectural style of the Telvanni. It features a platform for an unimpaired panoramic view and can be summoned at any place in the world, provided there is enough space for it. It can be accessed by ascending to it (included floating feature) or via the map marker.\r<br />\r<br />– The exterior (platform and the building itself) is nearly invisible from the ground, in order not stick out in cities and block the view. In its visible state, the exterior is illuminated according to day time.\r<br />\r<br />– An interior with bed (&#39;well rested&#39; bonus), safe lockers and chests, a book shelf, an alchemy lab and an enchanting station\r<br />\r<br />– A crystal basin inside the building that can be used to create empty or filled soul gems by combining eligible materials.\r<br />\r<br />– A magic pillar in the middle of the lab can cure any kind of sickness or poison and give a minor, temporary boost to the strength of destruction spells, so that you are quickly on your feet again to face the rough world outside of the lab.\r<br />\r<br />– Small bonus: a couple of items like robes and spells that already have been in the base game, but have not been accessible to the player, can be found in the lab.\r<br />\r<br />New features Version 2.0:\r<br />\r<br />- A merchant who sells some new furniture for the exterior and the interior of the Field lab e.g. armor and weapon crafting equipment, weapon racks, a mannequin and much more.(The dialogue option to buy furniture from this merchant is part of the furnishing quest, which starts directly after entering and leaving the field labs interior)\r<br />\r<br />- More storage possibilities, a cooking pot with a Frostfall compatible heatsource and a gate for the platform fence.\r<br />\r<br />- New dynamic cloaking effect for the exterior of the Field Lab, customizable through MCM options (see requirements and technical limitations if you can’t find the menu).\r<br />\r<br />- The platform lights are customizable through MCM options (Always off/Dynamic by daytime/Always on).\r<br />\r<br />- Most of the old scripts were basically revised. Consequently known minor bugs from v1.0 should be fixed.\r<br />\r<br />\r<br />\r<br />\r<br />[youtube]RLNuQZLx4jM[/youtube] [youtube]DdfEDKcgskA[/youtube]\r<br />&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Thanks for this video to Brodual &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Thanks for this video to Preykousis &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/ppVBmQ8.png[/img]\r<br />Simply copy the files Fieldlab.esp and Fieldlab.bsa into the data folder of your game directory, or let the Nexus Mod Manager install it automatically.\r<br />\r<br />[img]http://i.imgur.com/DZf3vmU.png[/img]\r<br />1. Make sure that in your latest savefile, your character is neither inside the lab, nor on the outer platform.\r<br />2. Overwrite the old Fieldlab.esp and Fieldlab.bsa in the data folder with the new files. (or let the NMM do this work for you)\r<br />3. Load your savefile and summon the field lab with your spell as usual (the new furnishing quest starts after entering and leaving the field lab interior cell).\r<br />\r<br />[img]http://i.imgur.com/Z0n81ax.png[/img]\r<br />Make sure that your latest savefile is neither inside the lab, nor on the outer platform. You can leave the key in any of the lab&#39;s containers. After that, you can deactivate or delete the plug-in.\r<br />\r<br />\r<br />[img]http://i.imgur.com/TRfsCsg.png[/img]\r<br />– To use the &#39;Summon Field Lab&#39; spell, position yourself in a way that there is enough space above the player character. The final test whether there is enough space is then done via the Havoc collision detection. Ceilings, walls or rocks are going to detected most of the time, but there is still a small chance that something like a tall tree is not going to detected asan obstruction, due to its minimal collision geometry. This might cause the treetop to peek through the outer platform.\r<br />\r<br />– The map marker is not going to be set under the following circumstances:\r<br />\t1. In interiors, since it would collide with the game&#39;s quick travel feature.\r<br />\t2. In places with their own world map (i.e. Mods that add new areas). It does, however, work in Solstheim. I put a dedicated map marker on this map\r<br />\t3. In most places that are relevant to quests and have the quick travel function disabled (i.e. the balcony of Unterstone Keep).\r<br />\r<br />– Companions of all sorts can neither use the „ascend to lab/descend from lab“ function, nor can they enter the lab&#39;s interior. This is due to the fact that the Navmeshes (NPC navigation grid) of the game cannot be generated dynamically, which would be necessary since the lab is a non-stationary object. There are few exceptions like the Dremora Servant/Merchant, but aside from those, the player is the only character to enter the lab. It would be best to order the companion to wait under the field lab, otherwise he will continue to run around below the platform.\r<br />\r<br />– In order not to destroy the balancing of the combat, it is not possible to ascend to the lab, if you are in combat or being looked for. Additionally, the projectile proof railing prevents an unfair bombardment through magic or projectiles from above.\r<br />\r<br />– The ability to reach high places will allow the player to overcome obstacles like city walls and to take shortcuts in dungeons. You will have to decide for yourself, if you want to use the feature that way, since it might give you no significant advantages throughout the game.\r<br />\r<br />– When filling empty soul gems at the crystal basin, make sure that you are not using any soulgems that have already been filled through the use of soul trap (identifiable through the low price). The game regards those soul stones as empty, since the item id stays the same, even after filling them.\r<br />\r<br />- The Bookshelf in the interior use a non vanilla script and may not compatible to other bookshelf-mods (compatible mods since v2.0: „Unlimited Bookshelves“ and „bookshelves script SKSE“).\r<br />\r<br />- The MCM maybe takes a few minutes ingame to register the new mod page after the activation/update of this mod.\r<br />\r<br />- If you lost your Field lab key due any reasons, you can get it back by speaking to the new furniture merchant.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[youtube]WWg3DZoYYQA[/youtube] [youtube]AR-X2eCxgrI[/youtube]\r<br />&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Thanks for this video to Gruntlock &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Thanks for this video to Misalen &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />If you have any problems with this mod, post a comment (please read the description first). \r<br />If you like this mod, please remember to endorse it.\r<br />\r<br />\r<br />[img]http://i.imgur.com/OAAATpN.png[/img]\r<br />Thanks for the English translation to Philzer and Stacheldrahtkuecken\r<br />\r<br />\r<br />\r<br />[center][size=4][color=olivedrab]############################ Deutsche Beschreibung / German description ############################[/color][/size][/center]\r<br />\r<br />[center][img]http://i.imgur.com/33c4NjQ.png[/img][/center]\r<br />[size=4][color=darkseagreen]Mit diesem Plugin gelangt der Spieler in den Besitz eines einmaligen magischen Artefakts: Dem Feldlabor von Divayth Fyr - einem uralten und mächtigen Telvannimagier aus Vvardenfell. Es ist möglich, diese kleine Behausung an jeden Ort in Spiel, also auch in Städten oder sehr hohen Innenräumen z.B. Höhlen oder Dwemerruinen, herbeizuzaubern. Der Innenraum des Feldlabors enthält zwar in erster Linie Einrichtungen für magiekundige Charaktere, kann aber auch einfach als mobile und sichere Unterkunft mit Stauraum verwendet werden.[/color][/size]\r<br />\r<br />\r<br />\r<br />[b][img]http://i.imgur.com/OG69Swr.png[/img]\r<br />- Skyrim\r<br />- [size=4]Dragonborn DLC[/size]\r<br />[/b]\r<br />\r<br />Voraussetzungen für das Mod Configuration Menu (Optional):\r<br />- SKSE (Skyrim Script Extender) version 1.6.6 oder neuer\r<br />- SkyUI version 3.0 oder neuer\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/untqNSE.png[/img]\r<br />- Eine einleitende kurze Quest, durch die man an den Schlüssel zum Feldlabor gelangt. Diese beginnt mit einem Brief, den ein Bote überbringt (kann wie immer etwas dauern, bis der Bote den Spieler findet).\r<br />\r<br />- Über der Landschaft schwebendes Feldlabor in Telvanni-typischer Architektur mit Plattform für ungestörten Rundumblick, das vom Spieler jederzeit an beliebige Orte, sofern genügend Platz vorhanden ist, herbeigezaubert werden kann und dann entweder durch direktes Hinaufschweben (eingebaute Schwebefunktion), oder durch den Mapmarker zu erreichen ist.\r<br />\r<br />- Der Außenbereich(Plattform und „Gebäude“) ist vom Boden aus nahezu unsichtbar damit das Konstrukt auch in Städten nicht weiter auffällt und die Aussicht nicht versperrt. Sobald man hinauf schwebt, oder sich anderweitig in die Nähe begibt, wird das Labor vollständig sichtbar. Im sichtbaren Zustand ist der Außenbereich tageszeitabhängig beleuchtet.\r<br />\r<br />- Innenraum mit Bett („Gut Ausgeruht“-Funktion), sichere Schränke und Truhen, Bücherregal, Alchemielabor, Verzauberungsaltar gehören zu Standardausstattung.\r<br />\r<br />- Ein Kristallisationsbecken im Innenbereich kann zum Erschaffen von leeren- oder gefüllten Seelensteinen aus verschiedenen geeigneten Materialien genutzt werden.\r<br />\r<br />- Eine Magische Säule in der Mitte des Labors kann bei Berührung Krankheiten heilen, anhaltende Gifteffekte entfernen und gibt für einige Zeit einen kleinen Bonus auf die Stärke von Zerstörungszaubern, damit man schnell wieder bereit für die raue Welt direkt außerhalb der Labortüre ist.\r<br />\r<br />- Kleiner Bonus: ein paar Gegenstände wie z.B. Roben und Zauber, die im Vanilla Spiel zwar bereits vorhanden waren, aber bisher dem Spieler nicht zur Verfügung standen, sind im Innenbereich zu finden.\r<br />\r<br />Neue Features in Version 2.0:\r<br />\r<br />- Ein Händler, der unter anderem mit allerlei Möbeln für den Außen- und Innenbereich des Feldlabors handelt z.B. Schmiede-Equipment für Waffen und Rüstungen, Waffenständer, eine Rüstungspuppe und vieles mehr (Die Quest zum Aufmöblieren sollte unmittelbar nach Verlassen des Feldlabor-Innenraumes starten).\r<br />\r<br />- Mehr Truhen und Behälter zum Verstauen des Gepäcks, ein Kochtopf (Frostfall kompatible Wärmequelle) und eine Tür am Plattform-Zaun (Tür öffnet und schließt automatisch beim Hinauf- und Hinunterschweben).\r<br />\r<br />- Neue Außenbereichs-Effekte (Unsichtbarkeit, Lichtbrechung, Schwebebereich am Boden), die mit Hilfe von MCM-Optionen angepasst werden können (wenn das Menu nicht auftaucht, bitte hier die Abschnitte &#34;Voraussetzungen&#34; und &#34;Hinweise zur Verwendung&#34; durchlesen)\r<br />\r<br />- Das Beleuchtungsverhalten der Plattformlichter lässt sich über das MCM-Menu einstellen (Always off/Dynamic by daytime/Always on).\r<br />\r<br />- Ein Großteil der alten Skripte wurden grundlegend überarbeitet. Infolgedessen sollten die mir bekannten kleineren Bugs von v1.0 eigentlich beseitigt sein.\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/u80dTsl.png[/img]\r<br />Wie üblich einfach die Dateien Fiedlab.esp und Fieldlab.bsa in den Data Ordner des Spielverzeichnisses kopieren, oder alles automatisch vom Nexus Mod Manager installieren lassen.\r<br />\r<br />\r<br />[img]http://i.imgur.com/q9gxDkS.png[/img]\r<br />1. Am letzten Speicherstand sollte sich der Spieler weder im Innenbereich, noch oben auf der Außenplattform des Feldlabors befinden.\r<br />2. Die alten Fiedlab.esp und Fieldlab.bsa im Data Ordner mit den neuen Dateien überschreiben, oder alles automatisch vom Nexus Mod Manager installieren/updaten lassen.\r<br />3. Damit alle Neuerungen wirksam werden können, muss das Feldlabor nach dem Laden des aktuellen Spielstandes mindestens einmal an einem beliebigen Ort neu herbeigezaubert werden.\r<br />Die Quest zum Einrichten mit neuen Möbeln startet, wenn das Labor einmal betreten und wieder verlassen wurde.\r<br />\r<br />\r<br />[img]http://i.imgur.com/LmlTw5j.png[/img]\r<br />Am letzten Speicherstand sollte sich der Spieler weder im Innenbereich, noch oben auf der Außenplattform des Feldlabors befinden. Den Schlüssel dazu wirft man vor dem Abspeichern am Besten in eine beliebige Truhe. Danach kann man das Plugin deaktivieren oder löschen.\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/qTAQksT.png[/img]\r<br />- Zum Benutzen des  „Feldlabor-Beschwören“ Zaubers sollte man sich am besten an Orten postieren, an denen augenscheinlich auch der nötige Platz oberhalb des Spielers vorhanden ist. Die endgültige Überprüfung auf genügend freien Platz funktioniert dann mit Hilfe der Havoc-Kollisionserkennung. Decken, Wände oder Felsen werden damit zu 99% erkannt, allerdings kann es sein, dass z.B. ein hoher Baum wegen seiner minimalen Kollisionsgeometrie nicht erkannt wird, woraufhin die Spitze des Baumes durch die Außenplattform ragen kann.\r<br />\r<br />- Der Mapmarker wird in folgenden Situationen nicht gesetzt (ist dann inaktiv und wird erst an anderen Orten wieder aktiviert):\r<br />1. In Innenräumen da das mit der spielinternen Schnellreisefunktion nicht richtig funktionieren würde.\r<br />2. An Orten mit komplett eigenständiger Weltkarte (z.B. bei Mods mit neuer Landschaft). In Solstheim funktioniert es, da ich auf dieser Karte einen separaten Mapmarker eingebaut habe.\r<br />3. An meist questrelevanten Orten, an denen die Schnellreisefunktion deaktiviert ist (z.B. am Balkon über Festung Unterstein).\r<br />\r<br />- Begleiter aller Art können weder die „Nach oben/unten Schweben“-Funktion nutzen, noch den Feldlabor Innenbereich betreten. Da die Navmeshes (NPC Navigationsnetz) im Spiel bisher nicht dynamisch erzeugt werden können und es sich hier um eine ortsveränderliche Einrichtung handelt, kann bis auf wenige Ausnahmen wie der Dremora Diener/Händler, ausschließlich der Spieler das Feldlabor betreten. Am besten gibt man den Begleitern die Anweisung, unten zu warten, da sie sonst unablässig unterhalb der Plattform umherlaufen.\r<br />\r<br />- Um das Balancing in Kampfsituationen nicht zu zerstören, kann man während eines Kampfes oder wenn man gesucht wird, nicht nach oben schweben. Ein unfairer Pfeil- oder Magiebeschuss von oben herab wird durch das Projektil-undurchlässige Geländer auch etwas erschwert.\r<br />\r<br />- Durch die Eigenschaft, überall nach oben zu gelangen, ist es natürlich möglich, Hindernisse wie z.B. Stadtmauern zu überspringen, oder Wege in Dungeons abzukürzen. Da man durch so etwas aber selten langfristige Vorteile im Spiel erhält, sollte man selbst entscheiden, ob man von diesem ungewollten Feature Gebrauch machen möchte.\r<br />\r<br />- Beim Füllen von leeren Seelensteinen am Kristallisationsbecken sollte man keine durch Seelenfalle selbstgefüllte Seelensteine im Inventar haben (Erkennbar am niedrigen Preis), da diese hier wegen ihrer gleichgebliebenen ID als leer erkannt und erneut gefüllt werden.\r<br />\r<br />- Das Bücherregal im Innenbereich verwendet nicht das übliche Standardscript und könnte mit manchen Bücherregal-Mods Inkompatibel sein (Kompatible Mods seit v2.0: „Unlimited Bookshelves“ and „bookshelves script SKSE“)\r<br />\r<br />- Das MCM benötigt nach Mod-Aktivierung/Update häufig ein paar Minuten Spielzeit, um die neue Menu-Seite zu erfassen und aufzulisten.\r<br />\r<br />- Sollte der Feldlabor-Schlüssel einmal aus irgendeinem Grund verloren gehen, kann man ihn seit v2.0 jederzeit erneut erhalten, indem man den &#34;Möbelhändler&#34; darauf anspricht.\r<br />",
  "categoryId": "67",
  "version": "2.0",
  "author": "Emperor11",
  "createdUnix": "1392376231",
  "updatedUnix": "1392376222",
  "containsAdultContent": false,
  "uploadedBy": "emperor11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000096988",
      "name": "FieldLab_German_2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3375",
      "fileName": "FieldLab_German_2_0-51094-2-0.zip",
      "uploadedUnix": "1392376105",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b1af73050a0461212ef19675dceba95c832de924618ae1bf390ae6d86c514161/analysis/1407933089/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FieldLab_German_2_0-51094-2-0.zip?fid=1000096988&ttl=1535833227&ri=8192&rs=8192&setec=b44a37795eb9833c70ad943334da27b8"
    },
    {
      "fileId": "1000096990",
      "name": "FieldLab_English_2_0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3374",
      "fileName": "FieldLab_English_2_0-51094-2-0.zip",
      "uploadedUnix": "1392376222",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/c2df67fb131655108b7a9081621168573a224f39112ea34a314e3152209a9a85/analysis/1407936792/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FieldLab_English_2_0-51094-2-0.zip?fid=1000096990&ttl=1535833227&ri=8192&rs=8192&setec=f02c63ae6b667b29d198ab93f625d4ed"
    }
  ]
}