{
  "modId": 51108.0,
  "modName": "Apok Castle",
  "summary": "The perfect small castle with all the amenities. Every type of crafting station, dragonpriest mask display, shrine of talos, and a vault with a unique cuirass and sword.",
  "descriptionHtml": "Don&#39;t be shy downloaders&#33; Let me know your thoughts&#33; Just be constructive&#33;Thanks&#33;\r<br />Requires Dawnguard and Dragonborn DLCS&#33;\r<br />\r<br />*Note: I might release some more unique armors in the future*\r<br />\r<br />Yeah, I know it&#39;s just another house mod. I have tried A TON of house mods and none of them worked just the way I wanted. It is not too big and not too small. It is strong enough to keep dragons out and cozy enough to keep people in. No new scripts or lag. I am not just saying this because it is my mod, but this is my favorite player house I have tried.\r<br />\r<br />The house has the following:\r<br />Anvil Forge, Alchemy Table, Enchanting Table, Enchanting Staff Table, Sharpening Wheel, Armor Table and a cooking spit. Outside-Smelter, Chopping block, and Stable.\r<br />Unique Merchant- Ibuy-ur-stuf- Buys all types of items and starts with 10,000 gold.\r<br />Six Mannequins\r<br />Weapon Rack\r<br />Dragonpriest Mask Display Altar\r<br />Shrine of Talos\r<br />Tons of storage, lost count of treasure chests and display cases. Most of the chests are uniqely named.\r<br />Vault room. Key can be stolen off of the merchant or found in a hidden spot....you have to find it yourself&#33; DO NOT POST WHERE THE &#34;HIDEY SPOT&#34; IS&#33;&#33;&#33; Unique cuirass and weapon in the vault room.\r<br />Plus, other Easter eggs...\r<br />\r<br />Like most other house mods- in order to move your spouse, children or followers in, you need to use another mod.\r<br />\r<br />*NOTE* The Konahrik mask can be put on the bust, but you have to be behind the altar- check the images. \r<br />\r<br />*Please, if you do not have anything nice to say do not post anything.*\r<br />Permissions-You can use my mod and it&#39;s resources in your mod ONLY IF YOU ASK ME AND I APPROVE&#33; (Ofcourse if you credit me as well.) But do not hesistate to ask me&#33; I want to help the modding community.\r<br />Credits- Bethesda making awesome games and modder&#39;s tools. \r<br />My friend Avatar1971 for helping me test the mod.\r<br />\r<br />My other mods: Skyrim\r<br />Cursed Camelot and Excalibur- (with my friend Avatar1971)\r<br />Ragnaroks Revenge\r<br />Acadian Race\r<br />Fallout New Vegas- New Camelot",
  "categoryId": "67",
  "version": "1.0",
  "author": "ApokKnight",
  "createdUnix": "1392402681",
  "updatedUnix": "1392402570",
  "containsAdultContent": false,
  "uploadedBy": "ApokKnight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097036",
      "name": "Apok Castle",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "83",
      "fileName": "Apok Castle-51108-1-0.zip",
      "uploadedUnix": "1392402570",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/07bf407c2220222b0ebbc2af9e318b6ac9ebdc913cb7049f1baea22964a63637/analysis/1407933486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Apok%20Castle-51108-1-0.zip?fid=1000097036&ttl=1535833249&ri=8192&rs=8192&setec=a12e429496289127ed2be6c6493b29f5"
    }
  ]
}