{
  "modId": 51161.0,
  "modName": "Children of Asaia",
  "summary": "A new race of men.",
  "descriptionHtml": "The Intention: This is not Bethesda&#39;s lore but lore that I created. I give credits to Bethesda&#39;s vanilla models. I have obtained permission by TheWolf93 to re-release his Akaviri Race mod in a different perspective. I also give credits to Apachii for he/she&#39;s wonderful hair mod, although not included in the mod. I also recommend Female Dimonized UNP body http://www.nexusmods.com/skyrim/mods/6709/? by dimon99 , and DCE - Realistic Male Face http://www.nexusmods.com/skyrim/mods/38301/? by Drumber. That&#39;s just my experimentation on them. Turned out pretty good. \r<br />\r<br />[[NOTE&#33;:]] TheWolf93 already made a master file for Akaviri Race. Akaviri Race is already included. Without it, you will not be able to play this race. You HAVE to HAVE that plugin. Please DO NOT delete&#33; Of course you will not play as the Akavirii. You also have to have the ApachiiSkyHair for it to work right&#33;\r<br />\r<br />This is my custom lore mod for a new type of race.\r<br />\r<br />The racial powers are Knowledge of Chi. All of them get to have this. It is best to use SkyUI, Race Compatibility, and Race Menu for best results&#33; \r<br />\r<br />Who are they? They are not the same kind of Akaviri, people on the Nexus or the internet who have been talking about for decades. It&#39;s a sensitive debate on who the Akaviri truly are. In this story, I provide a book that is located in Whiterun blacksmith forge sitting on the &#34;workbench.&#34; It&#39;s called the Children of Asaia. This book will give you &#34;my historical lore&#34; and a huge fictional mountain in Akavir called Chu mountain that is inhabited by the &#34;three kingdoms of Chu.&#34;\r<br />\r<br />I provide you with 3 races that look similar to each other. The only difference is their skin tone and I used Yahoo Images to make comparisons. \r<br />\r<br />The eye mesh in this mod uses Elven eyes and a few others from other races to provide an Asian look. They may not be accurate but in my opinion look very much Asian.\r<br />\r<br />Each kingdom has their own Emperor. You will not see them in this game because this takes place in Skyrim. If you want to see their homeland then you can make your own story. \r<br />\r<br />The 3 races that you can play as are:\r<br />\r<br />Chijo that are based off of the Chinese. \r<br />\r<br />Chulgee are based off of the Koreans. My wife is Korean and did her best to provide her knowledge to me of her people to make the Chulgee. \r<br />\r<br />Chusako are based off of the Japanese. They have their military generals called Shokin who occupy the government in the southern regions of Chu and protect their Emperor. The Shokin are based off the real life Shogun. I have changed the name for my custom lore.\r<br />\r<br />I also recommend the Akavir Samurai Armor found here: http://www.nexusmods.com/skyrim/mods/17779/? . The Samurai Armor is best for the Chusako. \r<br />\r<br />You can view the race status in the game at the character creation menu.\r<br />\r<br />Installation: Just use the Download Manager with the Nexus Mod Manager to easily install. \r<br />\r<br />To manually install: Copy Data within the .rar file then take Data folder and install into your installation directory.\r<br />\r<br />To uninstall: You can go into your installation directory and delete Akaviri Race.esm and Men of Chu or you can uninstall with Nexus Mod Manager. \r<br />\r<br />I give thanks to Bethesda for the vanilla art and TheWolf1993 for all of his hard work and dedication. Thank you bro for making this happen&#33; ",
  "categoryId": "34",
  "version": "V1.0",
  "author": "Valus34",
  "createdUnix": "1392534431",
  "updatedUnix": "1392534109",
  "containsAdultContent": false,
  "uploadedBy": "Valus34",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097296",
      "name": "Children of Asaia",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "Children of Asaia-51161-V1-0.rar",
      "uploadedUnix": "1392534109",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a3b09def17c56a0fbc0a02e91ce8e6416411ec6e2763ad05c8fde6030a8b2f8a/analysis/1407935823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Children%20of%20Asaia-51161-V1-0.rar?fid=1000097296&ttl=1535833341&ri=8192&rs=8192&setec=c7f2dc0827e0bc43985303da4bc9bd51"
    }
  ]
}