{
  "modId": 51176.0,
  "modName": "Little Bit More Useful Player Homes",
  "summary": "Adds a few more chests in all the vanilla player homes to make life easier.",
  "descriptionHtml": "Like the name suggests this mod doesn&#39;t do much except adding a few containers in player owned vanilla houses.  Player house upgrades don&#39;t add much in some houses. Such as Proudspire Manor, Hjerim, Vindrell Hall, Honeyside don&#39;t even have enough decent containers near the crafting stations.  You have to run all around the house to store your valuable items of various category. There are some fantastic house mods out here in nexus which solve these problems. Seriously not trying them is a waste&#33; But if you want only small modifications in all the houses without changing the vanilla looks than u can try this. All the containers, crafting station will appear when you buy house upgrades from the stewards.\r<br />Features:\r<br />a)Breezehome : Just 1 strongbox in the bedroom. No space to add anything without moving something else. Why not simply try &#34;Breezehome FullyUpgradable&#34; by Sku11M0nkey?\r<br />b) Hjerim : 1 chest & satchel in the alchemy laboratory, 2 safes under the enchanting station, 1 strongbox in bedroom, 1 chest under the weapon display.\r<br />c) Honeyside : 1 satchel & urn near the alchemy laboratory, 1 safe under enchanting station, 1 strongbox in bedroom shelf, 1 chest beside the stair. Have plans to add some weapon racks later.\r<br />d) Proudspire Manor :1 satchel & 2 urns near the alchemy station, 1 safe under enchanting station, 1 chest in a wall shelf beside basement stair, 1 strongbox in the bedroom. Have plans to add some weapon racks.\r<br />e) Vindrell Hall : 1 urn near the alchemy station, 2 chests in the enchanting laboratory, 1 strongbox in the bedroom. And no more.. this house already have too many containers&#33;\r<br />f) Arch-mage&#39;s Quarter: 1 urn near alchemy station, 1 chest near enchanting station, 1 strongbox beside the bed. Will appear after becoming Arch-mage (needs testing). Have plans to add some mannequins & weapon racks too.\r<br />\r<br />Future Plans:\r<br />\r<br />Credits:",
  "categoryId": "67",
  "version": "1.0",
  "author": "anik50",
  "createdUnix": "1392568250",
  "updatedUnix": "1392569163",
  "containsAdultContent": false,
  "uploadedBy": "anik50",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097355",
      "name": "A Liittle Bit More Useful Player Homes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "A Liittle Bit More Useful Player Homes-51176-1-0.7z",
      "uploadedUnix": "1392569163",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/26e34e71679e78095e67b8ec372a608343b17322e554615ead1665adc3e5024b/analysis/1407936392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Liittle%20Bit%20More%20Useful%20Player%20Homes-51176-1-0.7z?fid=1000097355&ttl=1535833365&ri=8192&rs=8192&setec=4c5d7a9e1fe63cc24dcb4ed366501568"
    }
  ]
}