{
  "modId": 51172.0,
  "modName": "TES-The lands of Nirn",
  "summary": "This mod will allow you to travel to all of the lands that the world of Nirn has to offer. This mod is for people who like to have the openness of all the lands without the MMO feel of ESO. [WORK IN PROGRESS]\r<br />",
  "descriptionHtml": "                                                                                \r<br />                                                               [left][/left] THE LANDS OF NIRN\r<br />THE TEAM: FalloutParker, curim2, other unnamed. \r<br />\r<br />IMPORTANT NOTICE:\r<br />This mod has been picked back up after lots of events has happened. As a result, we are looking for new members to help. Look below for specifics or message me if you are capable of voice acting.\r<br />\r<br />\r<br />NEWS:\r<br />\r<br />2/16/14(6:42 AM): Mod page created\r<br />2/16/14(7:06 PM): Official modding begins/mod compatibility testing started\r<br />2/16/14(10:34 PM): Official first PRE-ALPHA launch that is really bad\r<br />2/17/14(12:12 AM): Dungeon mod uploaded for meantime play while main files are being made\r<br />2/17/14(2:45 PM): Landscaping of Solstheim begins\r<br />2/17/14(3:15 PM): Most landscaping done\r<br />2/17/14(4:00 PM): Adding cluster to town \r<br />2/17/14(4:10 PM): Cluster finished/Adding animals/actors\r<br />2/17/14(6:00 PM): Started work on Akavir\r<br />2/17/14(6:30 PM): WARNING: Error occured in work will post when fixed\r<br />2/17/14(8:48 PM): Elsweyr patch uploaded/WARNING error occuring while in solstheim will post fix\r<br />2/17/14(10:20 PM): Solstheim work discontinued/Valenwood, Elsweyr, and Akavir started\r<br />2/18/14(1:29 AM): Added new Alpha-Deleted solstheim and added pre-alpha valenwood\r<br />2/18/14(11:59 PM): Work on Valenwood continued. Trees added, landscaping, clutter\r<br />2/18/14(5:00 PM): Thanks to mods that were abandoned and forgotten we have smashed them together to help make the maps that we need to make a more immersive Tamriel. We have two main mods that are new to the pack which remove borders around Skyrim and add more land around it. Also now included in this mod is extra updates to Skyrim that remove unnecessary cluster items around towns and such. The next release is predicted for tomorrow but I have to keep consulting the map to make sure everything is correct. The maps and lands wont be perfect for main release that will come in later updates. We plan to have the maps finished, then add locations, then add quests, then make necessary updates to the files. The final project may be split up into different files due to the size. If you are experienced in landscaping WE NEED YOU. \r<br />6/29/16(1:00 AM}: Mod is started up again\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />THIS MOD NEEDS ALL THE HELP IT CAN GET. EVEN IF YOU CAN&#39;T DO MUCH YOU CAN HELP MAKE THIS MOD SO MUCH BETTER. EVEN IF YOU CAN&#39;T MAKE LARGE LANDSCAPES UPDATES TO SKYRIM ARE ALWAYS WELCOMED. WE NEED MORE DUNGEONS AND MORE MYSTERIES TO KEEP PEOPLE INTERESTED. PLEASE PM, POST, OR EMAIL ME AT THE EMAIL PROVIDED BELOW. EMAIL pargregory@hotmail.com IF YOU ARE INTERESTED. MY TIME ZONE IS PACIFIC TIME\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />                                                                     PLEASE HELP\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />THIS MOD NEEDS YOU&#33; I NEED MODDERS WHO CAN DO:\r<br />-NavMesh\r<br />-3D Modeling\r<br />-Landscaping\r<br />-Quest Making\r<br />-Character Creating\r<br />-Item Creating\r<br />-Story line Writers\r<br />-Putting in voice for characters\r<br />-Voice Acting\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />This mod is something I have wanted to see happen for a long time but I never saw it happen. Well I have decided that now would be the time to make this huge expansion pack so that people like me can enjoy lots of gametime while not having to pay or deal with the mechanics of Elder Scrolls Online. I need lots of help so if you are able to do any of the things that i listed above please post or pm me so you can help me. I also will need help with putting together what everyone makes since I do not know how to. This means that when someone completes one part of something and someone does completes another part you will put the two together to make one.\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />This mod follows the continents of Nirn such as the lands of Tamriel including Morrowind, Cryodil, Skyrim plus all new lands such as Yokuda(Not much is known about Yokuda since it was nearly obliterated in an unknown cataclysmic event, but it seems to have a dull, rocky, hilly, desert landscape. It is known to be the original home to the Redguards before they rendered it uninhabitable), Atmora(Atmora is a barren and freezing wasteland. It is this extreme cold that caused the water of the Sea of Ghosts that borders Tamriel and Atmora to become icy. This frozen land is also where the Nords of Skyrim are originally from, although not many trips back are made.}, Akavir(Next to nothing is known about the geography of Akavir. We are aware that the continent is split into four warring kingdoms, each boasting its own race: Tang Mo, Kamal, Ka Po&#39; Tun, and Tsaesci. Akavir is known to have been a home to dragons. The Blades, originally from Akavir where they were known as the Dragonguard, but turned to serve Reman Cyrodiil in their search for a Dragonborn.}, Pyandonea(Pyandonea is the island-continent located to the far south-west of Tamriel and home to the elusive Maormer. The island consists of dense rain forests which provide shelter for the southern water spirits. Due to its populace being Merrish, there is speculation that Pyandonea may in fact be part of Tamriel.), Thras(Thras, also known as the Coral Kingdom has been a powerful, antagonizing power against the Summerset Isles since before recorded time. The Sload may at one time have even called Summerset part of Thras.), and Aldmeris(Little is known about Aldmeris (including if it still exists). The Altmer claim that this continent was the birthplace of both elves and mankind.)\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />This mod will be released when sections of the lands are completed. The mod will start with the Khajit lands, to the Argonian Black Marsh, and then on to larger land scapes. THIS MOD WILL CONSTANTLY UPDATE WITH ALL NEWS FROM PEOPLE WHO START WORKING ON IT TO THE PROGRESS OF NEW LANDSCAPES. \r<br />------------------------------------------------------------------------------------------------------------------------\r<br />                                                                        Installation\r<br />-Download the file  from the files page\r<br />-Open the Data folder\r<br />-Go to programs(x64)/steam/steamapps/common/skyrim/data and copy paste all files into the folder\r<br />-Launch Elder Scrolls launcher\r<br />-Check all of the .esm and .esp files\r<br />-When in game you can travel outside of the map/travel to solstheim/travel to khajit homeland\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />                                                                         READ THIS\r<br />UNDERSTAND THAT THE CURRENT FILE UPLOADED IS PRE-ALPHA. SO MANY THINGS ARE WRONG WITH IT AND IT IS NOT EVEN CLOSE TO DONE.\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />                                                        HOW TO TRAVEL TO THE NEW LANDS\r<br />-Elsweyr can be travel to through the Desert Carvan it is already marked on the map for fast travel\r<br />-Solstheim can be traveled to through the ship at the docks just open the door\r<br />-NO BORDERS/lots of dungeons will be added and we are already working on it feel free to explore nothingness until the next update\r<br />------------------------------------------------------------------------------------------------------------------------\r<br />                                                                            PERMS\r<br />-UNDER NO CIRCUMSTANCES MAY YOU USE ANY PART OF THIS MOD AS A WHOLE FOR YOUR OWN MOD EXCEPT FOR MODS THAT WERE CREATED FROM DIFFERENT AUTHORS. THATS UP TO THEM NOT ME\r<br />-UNDER NO CIRCUMSTANCES CAN YOU UPDATE THIS AND UPLOAD THIS AS YOUR OWN\r<br />-ALL LANDS CREATED BY FalloutParker or micu ARE NOT ALLOWED IN ANY OTHER MOD BUT THIS\r<br />-YOU MUST ASK ME BEFORE DOING ANYTHING THAT CHANGES ANYTHING IN THIS MOD \r<br />------------------------------------------------------------------------------------------------------------------------",
  "categoryId": "30",
  "version": "ALPHA1",
  "author": "FalloutParker",
  "createdUnix": "1392560448",
  "updatedUnix": "1392717003",
  "containsAdultContent": false,
  "uploadedBy": "FalloutParker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097608",
      "name": "Elsweyr Fix PRE-ALPHA",
      "version": "1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "121",
      "fileName": "Elsweyr Fix PRE-ALPHA-51172-1.zip",
      "uploadedUnix": "1392698939",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ef34220aaa432e72936df7673f5f608990eafe5878eea166c00f4b0c28c8a837/analysis/1407938709/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elsweyr%20Fix%20PRE-ALPHA-51172-1.zip?fid=1000097608&ttl=1535833354&ri=8192&rs=8192&setec=8852193633230236a180eabe28c2dfce"
    },
    {
      "fileId": "1000097633",
      "name": "LANDS OF NIRN-PRE-ALPHA ADDED LANDS",
      "version": "ALPHA1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "101003",
      "fileName": "LANDS OF NIRN-PRE-ALPHA ADDED LANDS-51172-ALPHA1.zip",
      "uploadedUnix": "1392717003",
      "modVersion": "ALPHA1",
      "virusScanUrl": "https://www.virustotal.com/file/9fab7cc62777e70fab15f895d8025ec6e9f031de759504dcffef7a6c2046a7c1/analysis/1407938962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LANDS%20OF%20NIRN-PRE-ALPHA%20ADDED%20LANDS-51172-ALPHA1.zip?fid=1000097633&ttl=1535833355&ri=8192&rs=8192&setec=a89f28bd52c2121e5dec5caae94f2dd9"
    }
  ]
}