{
  "modId": 51187.0,
  "modName": "Beckwood Manor",
  "summary": "A manor left behind by an Elder Councilman for the Dragonborn in Riverwood.",
  "descriptionHtml": "Alright, so this may be my last player home before moving on to my overdue quest mod (Should get that done before people stop playing this game). I know Riverwood is a heavily crowded place now for mods, but I hope this one is enjoyed. It doesn&#39;t offer crazy gadgets or sorters or followers or custom items. Having a poor understanding of the way Skyrim works for these things, my weapon is an over reliance on aesthetics. \r<br />\r<br />Beckwood Manor is situated on top of a grassy hill NE of Whiterun, right next to the bridge out of town. The place was an old estate owned by a member of the Elder Council, where his amulet can be found in the great room and his farewell note in the study. It serves as Riverwood&#39;s windmill for imported grain, and hosts a sizable garden and overlook. Inside sports a few interesting amenities, such as an augury mirror (for rp purposes only, really), a unique enchanting stand, a simple drop basket for weapons, and mood lighting for most of the building. There&#39;s plenty of storage, furniture, Hearthfire amenities, weapon racks and so forth, although no more or less than other vanilla homes. I attempted to make the place as lore-friendly as I could with the resources on hand in order to make it not too big nor too small for the game. The place does lack certain qualities other may enjoy in a home, such as a personal forge, but I&#39;ve omitted these in order for the player to have reason to visit the townsfolk next door. There&#39;s a single master double bed and a single child&#39;s bed should you wish to have a spouse, follower and/or child. I recommend the mods which allow &#39;take your child anywhere/ make anywhere your home&#39; options. Indoors and outdoors are navmeshed and should work properly. There should be no vanilla cell issues. \r<br />\r<br />REQUIREMENTS AND INCOMPATIBILITIES:\r<br />\r<br />Dawnguard, Hearthfire and Dragonborn are needed for the place. I&#39;d imagine the place is incompatible with any mod that uses the Riverwood3 cell. Works well with Riverwood Reborn and Skyrim Flora Overhaul. \r<br />\r<br />\r<br />Thank you for taking a gander, and I hope you have a good time with the place. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1392593424",
  "updatedUnix": "1392593413",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097397",
      "name": "Beckwood Manor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5131",
      "fileName": "Beckwood Manor-51187-1-0.zip",
      "uploadedUnix": "1392593413",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6336b9ddd414fbd1a0e28957d19d891975879a687bf850290027d8b674edec3f/analysis/1407936835/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beckwood%20Manor-51187-1-0.zip?fid=1000097397&ttl=1535833377&ri=8192&rs=8192&setec=a7dc76b1c6c9b6459471f37015e0322c"
    }
  ]
}