{
  "modId": 51192.0,
  "modName": "New Shouting Follower -- Aeridon",
  "summary": "This male nord shouting follower can use the shouts Call Storm and Unrelenting Force. Default full wolf armor.",
  "descriptionHtml": "This male nord essential follower is my first follower mod, very basic. He can use the shouts Call Storm and Unrelenting Force. he comes with a full set of wolf armor (companion armor) as a default armor, contains a few other level based items in his inventory. He has the perk Light Feet so he shouldn&#39;t be a problem triggering traps when the player is adventuring in dungeons. He prefers to use two handed weapons and the bow.\r<br />\r<br />He can be found near the Whiterun Stables, wandering about. He can also level up with the player until level 200 which is A VERY LONG TIME. \r<br />\r<br />Additionally, he uses no scripts so he is basically compatible with all mods including follower mods.\r<br />\r<br />However, i did not add relations with other followers, so his unrelenting force shout can cause some unwanted fights between him and your other followers. Be careful if you are using multi-follower mods.\r<br />\r<br />One common way to solve followers fighting each other is to enable and disable the character that is fighting, no progress shall be lost, but the relations of that character and all other npcs will be reset.\r<br />\r<br />Please, endorse and leave pictures if you can. It could help a lot&#33; Leave comments about improvements i can make&#33;",
  "categoryId": "96",
  "version": "1.0",
  "author": "liumai",
  "createdUnix": "1392609753",
  "updatedUnix": "1392609333",
  "containsAdultContent": false,
  "uploadedBy": "liumai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097423",
      "name": "Aeridon",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Aeridon-51192-1-0.zip",
      "uploadedUnix": "1392609333",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd7cf50ef7f242ee76ad6b725e8c22441910f73eeffc4ff73d10911e54899c52/analysis/1407937090/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aeridon-51192-1-0.zip?fid=1000097423&ttl=1535833383&ri=8192&rs=8192&setec=6647a41b5d06075e25251f3b01e786c3"
    }
  ]
}