{
  "modId": 51206.0,
  "modName": "Yselle Thilon",
  "summary": "A Conjuration mage for your game. ",
  "descriptionHtml": "This is a follower mod for Skyrim, made for some fun. The character is Yselle Thilon, who can be found in The Bannered Mare in Whiterun. She is equipped with all levels of Conjuration spells, (which she will use once she has the skills), as well as basic destruction and restoration spells. She is a standalone follower and requires no mods. To keep her looking like she does in the screenshots, you should have any kind of high quality textures for females. She is made with UNP, so she is UNP clothing compatible. \r<br />\r<br />DOWNLOAD LORE-FRIENDLY RELEASE UNLESS YOU HAVE OBLHAIRS. It is no longer on the Nexus, but some may still have it. Otherwise, download lore friendly version&#33;\r<br />\r<br />Not required but HIGHLY RECOMMENDED in order to make her a stronger character: \r<br />UFO- Ultimate Follower Overhaul - It will allow you to put any spell tomes in her inventory to teach her new spells that she will use as seen fit.\r<br />SPERG- Skyrim Perk Enhancements and Rebalanced Gameplay - This mod allows a more classical way of leveling, which allows her spells to level with her instead of needing perks. As each skill goes up, the magic cost goes down, summon time goes up, and healing, destruction spells increase in damage. \r<br />Midas Magic and Apocalypse Spell Package- Two mods which add a huge amount of spells to the game. I know for sure Midas Magic spells are also affected by SPERG, meaning they will dynamically level. Have not tested Apocalypse. If you have UFO, purchase any of these spell tomes and she will learn and use them. \r<br />- I have tested her in my game, containing all of these mods and she works quite well. She will often summon when a battle starts, then buff, and use destruction spells, and heal herself if necessary.\r<br />I HIGHLY RECOMMEND GIVING HER A WEAPON. If you do not give her a weapon to use when she runs out of Magicka, she is left with fists. Keep this in mind. \r<br />Her speed is slightly adjusted so she should have no issues keeping up. \r<br />\r<br />Finally- If anyone knows how to get Battle Hardened Warpaints, and NB scars working with Creation Kit, let me know. She was originally a character in game with these details, but I cannot get it working in Creation Kit. ",
  "categoryId": "96",
  "version": "1.00",
  "author": "Pewpewdie",
  "createdUnix": "1392654415",
  "updatedUnix": "1392662932",
  "containsAdultContent": false,
  "uploadedBy": "Pewpewdie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097483",
      "name": "Yselle Thilon Intital",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Yselle Thilon Intital-51206-1-00.rar",
      "uploadedUnix": "1392654407",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/74a0e60fa8fe585d49fb75189ff21386a66405c2054cd43e2c9fb0d5d632dbf3/analysis/1407937458/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yselle%20Thilon%20Intital-51206-1-00.rar?fid=1000097483&ttl=1535833404&ri=8192&rs=8192&setec=32dfab0d0d887d7259784ec551de34f6"
    },
    {
      "fileId": "1000097518",
      "name": "Yselle Lore-Friendly",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Yselle Lore-Friendly-51206-1-00.rar",
      "uploadedUnix": "1392662932",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/dc235242c28ee11e58c93f7fba6b7131e524c41601159b21ba53fa458bd4085c/analysis/1407937734/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yselle%20Lore-Friendly-51206-1-00.rar?fid=1000097518&ttl=1535833405&ri=8192&rs=8192&setec=40bee23f1339edde7adebccad120f24d"
    }
  ]
}