{
  "modId": 51226.0,
  "modName": "Hearthfire Custom Basements",
  "summary": "Build up to 3 additional wings in a new basement in your Hearthfire home.",
  "descriptionHtml": "[size=4][font=&#34;impact&#34;][u][color=#ffcc33]Mod Description[/color][/u][/font][/size]\r<br />\r<br />This mod will allow you to build up to three additional rooms in a new basement underneath any of the Hearthfire homes.  All the rooms are replicas of the original Hearthfire wings.\r<br />\r<br />\r<br />[size=4][font=&#34;impact&#34;][u][color=#ffcc33]Construction[/color][/u][/font][/size]\r<br />\r<br />You will find a new book on top of your workbench outside any of the Hearthfire homes.  This guide will tell you what materials and gold are required to build each room.\r<br />\r<br />To begin building your extra rooms you must first finish your small home / entranceway.  \r<br />Activate your external workbench and you will find the &#39;Basement Hallway&#39; under the misc. section along with the garden, animal pen etc.  You will find the trapdoor leading to your new hallway in the north-east corner of your house / entranceway.\r<br />\r<br />Once inside the hallway, you will find three workbenches.  Each workbench will allow you to construct a room on the east, west or south side of the hall.  \r<br />\r<br />When you have finished building your rooms, the workbenches can be removed using the drafting table outside your home.\r<br />\r<br />Construction of the basement hallway is completely optional.  If you don&#39;t want any extra rooms in one of your homes, you can just ignore the option when using the outside workbench.\r<br />\r<br />You cannot build individual components in each room.  Once you have created a room, every furnishing will automatically be made available.\r<br />\r<br />\r<br />[size=4][font=&#34;impact&#34;][u][color=#ffcc33]Features[/color][/u][/font][/size]\r<br />\r<br />There are a few small differences between the underground rooms and the standard Hearthfire wings...\r<br />[list]\r<br />[*]The butter churn in the kitchen can be used to turn milk into butter instead of just dispensing it.\r<br />[*]The library can hold 418 books (the original library can only hold 308 books).  This is enough space for every book in the vanilla game and every DLC.\r<br />[*]The ladders in the &#39;tower&#39; rooms that would normally lead outside are now used to move between the two levels.\r<br />[/list]\r<br />\r<br />[size=4][font=&#34;impact&#34;][u][color=#ffcc33]Installation[/color][/u][/font][/size]\r<br />\r<br />[b]NMM[/b] - Click the download with manager button\r<br />[b]Manual[/b] - Download the .rar file, extract and move the files over to your Skyrim / Data folder.\r<br />\r<br />\r<br />[size=4][font=&#34;impact&#34;][u][color=#ffcc33]Known Issues[/color][/u][/font][/size]\r<br />\r<br />There are a few issues that you should be aware of before using this mod.  \r<br />[list]\r<br />[*]Your spouse and children will not be able to enter the basement or use any of the rooms.  I am hoping to find a work-around for this to be implemented in a future update.\r<br />\r<br />[*]After creating a trophy in the trophy room, the menu options may reappear.  If this happens, just back out of the menu.  This appears to be a glitch present in the vanilla game.\r<br />\r<br />[*]Do not take books directly from a bookshelf.  Doing so may increase the capacity of the shelf.  Always make sure you click on the actual shelf and remove your books from the &#39;container&#39;.  This also seems to be a vanilla glitch.\r<br />\r<br />[*]Please note that you can only build one of each type of room.  Once you have created a room at a workbench, that option will be removed from the other two workbenches.  I have tested every build option, however in the event that you do see a room available twice, just ignore the option.  If you do create it again, you will just end up creating another door to the same room.\r<br />\r<br />[*]I have done a lot of testing on this mod and while I have made every effort to make sure that it works properly, some issues may arise.  If you do happen to spot any issues, please bring them to my attention in the discussion tab or via PM.\r<br />[/list]\r<br />\r<br />[size=4][font=&#34;impact&#34;][u][color=#ffcc33]Acknowledgements[/color][/u][/font][/size]\r<br />\r<br />Thank you to DarkFox127 for helping me with the workbench scripts and for his awesome YouTube tutorials.\r<br />\r<br />Thank you to &#39;DemongelRex&#39; for beta testing the mod.\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "Thicketford",
  "createdUnix": "1393362748",
  "updatedUnix": "1393359678",
  "containsAdultContent": false,
  "uploadedBy": "Thicketford",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098749",
      "name": "Hearthfire Custom Basements",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "240",
      "fileName": "Hearthfire Custom Basements-51226-1-0.rar",
      "uploadedUnix": "1393359678",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1f63716d7a347dbf70495e07e0852637edfa8444bd0d368dcc0737b638d0ce2c/analysis/1407949964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Custom%20Basements-51226-1-0.rar?fid=1000098749&ttl=1535833439&ri=8192&rs=8192&setec=eb88b9c96eda05b99c672b8980be166f"
    }
  ]
}