{
  "modId": 51230.0,
  "modName": "Final Fantasy XIII Blazefire Saber",
  "summary": "Lightning&#39;s Blazefire Saber from Final Fantasy XIII, totally not lore friendly. I procured the mod from Snezko, who no longer supports the mod, or mods for Skyrim anymore.",
  "descriptionHtml": "Lightning&#39;s Blazefire Saber from Final Fantasy XIII, totally not lore friendly. I procured the mod from Snezko, who no longer supports the mod, or mods for Skyrim anymore. That said, he gave me permission to edit and &#34;update&#34; the mod as I see fit, and I think I&#39;ve improved on it a little.\r<br />\r<br />Because of that, don&#39;t hesitate to endorse this mod and get the word out&#33;\r<br />\r<br />Improvements are...\r<br />\r<br />BOSS no longer finds a conflict with the mod having been created prior to the Creation Kit, and so doesn&#39;t suggest you delete it. This may solve some compatibility issues.\r<br />\r<br />Weapon no longer requires Daedric Smithing perk to create. This is so that those who are playing with another mod which I&#39;ll put under recommended mods below can &#34;roleplay&#34; a little better. As the amount of Final Fantasy weapons related to Lightning are pretty limited, obviously you want something you can use for a good period of time.\r<br />\r<br />Weapon now has a description attached to it that features two of the engravings on the sword. This means I&#39;m intending to add a little lore at some point.\r<br />\r<br />As I said before, the mod was originally made by anjinewabe, who gave it to Snezko, who gave me permission to edit it and reup it as I see fit with all the support I can possibly provide for my very first mod. Graphic resources come from cptlee. Credit will be placed where credit is due.\r<br />\r<br />For more information, see the readme included with the file. You might need SKSE, but I don&#39;t know of a scenario where you wouldn&#39;t have it. I didn&#39;t add any scripts to this (yet) but sometimes SKSE fixes small issues like missing graphics in mods.\r<br />\r<br />\r<br />\r<br />Installation:\r<br />Either use NMM or extract the file using 7zip, and place the textures, meshes, and ESP in your Skyrim/Data folder and activate the ESP.\r<br />\r<br />\r<br />\r<br />\r<br />UPDATE&#33;\r<br />\r<br />Testing/Beta versions removed, please uninstall the old files, or overwrite with the new.\r<br />\r<br />Stand-Alone version features only the sword, with it&#39;s regular base damage and such. This will not be changed unless for some reason a bug is found, or the weapon itself gets enough attention and something is requested.\r<br />\r<br />The main version of the file is an on-going mod that aims to TRY to make the weapon a little less unfriendly to Skyrim Lore. Currently all I&#39;ve done is add two books (you should start in Ivarstead), a note, and a chest with the sword in it. Now, the future plan is to make three different versions of the sword, so the current damage value on the weapon WILL change. This will allow people who want to roleplay a little upgrade the sword version to version. The versions are set. Blazefire Saber becomes Flamberge, and Flamberge will become the Omega Weapon. Unfortunately, textures for the Flamberge and Omega Weapon are unavailable so the weapon&#39;s will look the same. Remember that the damage will go up, and the description of the weapon will change too. If I can get someone to either make the textures and models for me, or I somehow find out how to do it on my own, then I can update the mod with the new textures.\r<br />\r<br />Happy gaming.",
  "categoryId": "55",
  "version": "1.1",
  "author": "Kyithios",
  "createdUnix": "1392671098",
  "updatedUnix": "1396904731",
  "containsAdultContent": false,
  "uploadedBy": "kyithios",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097861",
      "name": "Blazefire Saber Stand-Alone",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2463",
      "fileName": "Blazefire Saber-51230-0-1-4.7z",
      "uploadedUnix": "1392851574",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/354566916e2b3feb1ed39daf7f9eb76084983573ad417eafcdd84443452d33f4/analysis/1407941233/",
      "changelogHtml": " Final version of the main weapon released as a Stand-Alone version. <br/> \n Main version now includes two books, a letter, and a chest with the saber inside. <br/> \n dummy weapon removed, testing completed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blazefire%20Saber-51230-0-1-4.7z?fid=1000097861&ttl=1535833442&ri=8192&rs=8192&setec=b7035a029c958e7feecd92629f98f9eb"
    },
    {
      "fileId": "1000098447",
      "name": "Blazefire Saber",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2465",
      "fileName": "Blazefire Saber-51230-1-0.7z",
      "uploadedUnix": "1393186962",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bb7c3354fdfee0a6c1a683f7ea8c275ede24d7ce5b217a21e9aace55ce17d99/analysis/1407947052/",
      "changelogHtml": " Final version of the main weapon released as a Stand-Alone version. <br/> \n Main version now includes two books, a letter, and a chest with the saber inside. <br/> \n dummy weapon removed, testing completed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blazefire%20Saber-51230-1-0.7z?fid=1000098447&ttl=1535833443&ri=8192&rs=8192&setec=c9f1dfe3ef9ea160dffdd2fbb11191e4"
    },
    {
      "fileId": "1000104060",
      "name": "Blazefire Saber v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2465",
      "fileName": "Blazefire Saber v1_1-51230-1-1.7z",
      "uploadedUnix": "1396904731",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/29e191c089bcabf959988969b9b213d2ec2d0ca2bb5c1004d8ebacdca717935f/analysis/1408011126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blazefire%20Saber%20v1_1-51230-1-1.7z?fid=1000104060&ttl=1535833443&ri=8192&rs=8192&setec=4a1039b5b469b8962c2f1c5749fb0449"
    }
  ]
}