{
  "modId": 51252.0,
  "modName": "AutoUndies",
  "summary": "A mod that gives all UNP human women Osare wearable underwear, so they are not nude when armour is removed. Requires Osare underwear and UNP base body to be installed. ",
  "descriptionHtml": "[b][u]Overview[/u][/b]\r<br />Do you use the [url=http://www.nexusmods.com/skyrim/mods/6709/?]UNP female body replacer[/url], but feel a little uncomfortable seeing nude bodies lying around after looting armour? If so, then this simple mod may be what you are looking for.\r<br />\r<br />I noticed that there were a few other mods to achieve this same goal that swapped body textures and involved using powers or rings to activate or deactivate nudity, which seemed a bit hard. This mod achieves the goal simply by adding a piece of clothing to NPCs.\r<br />\r<br />This mod alters the standard armour tables so that the various clothing outfits that NPCs spawn with include [url=http://www.nexusmods.com/skyrim/mods/14294/?]Osare wearable underwear[/url]. You need to have the Osare underwear mod (at time of writing, version 1.0) installed before you can use this mod.\r<br />\r<br />[b][u]Things to keep in mind[/u][/b]\r<br />Skyrim armour tables apply to both male and female actors. For example, both male and female Bandit01Magic use the following armour table:\r<br />[list]\r<br />[*]BanditBoots (look up table of 3 types of boots, scaled based on player level)\r<br />[*]BanditCuirassVariants (look up table of 2 types of cuirass)\r<br />[/list]\r<br />The items in the BanditBoots are the same regardless of whether the NPC is male or female, but the items in BanditCuirassVariant have both male and female versions. So if Skyrim decides to use Cuirass 1 with a male NPC, it will look similar but a little different to if it decides to use Cuirass 1 with a female NPC. Sometimes the difference is that the male version of an armour has a bare chest, while the female one has thoughtfully placed padding etc. The reason I&#39;m mentioning all this is that I didn&#39;t make new tables so that the female bandits could use a look up table that includes  underwear while the males use the original table. Instead I just added the underwear to the base table. That means that both male and female bandits will have the underwear item in their inventory. However, as the item only includes female meshes, it will only show on females. In theory I could get a male underwear mesh and link it in so that males got some love too, but since I don&#39;t play with a male body replacer I haven&#39;t bothered with this yet\r<br />\r<br />This mod is script free, so will not mess up any of your quests etc.\r<br />\r<br />The Osare underwear at times looks a little too clean and shiny for the Skyrim world, but I&#39;m not a 3d modeller so am limited to applying the work of others. To minimise visual disparity, I used the plain black underwear for most NPCs, and the fancier underwear only for nobles, some merchants, and some magic users.\r<br />\r<br />Occasionally there could be clipping issues if normal clothes are tight fitting, causing the underwear to show through where it shouldn&#39;t.  In testing I only noticed it on the civilian in the second set of screen shots, which wasn&#39;t too bad really. However, if you notice a bad clipping problem and you are using vanilla armour, let me know in the comments and I might remove the underwear from that NPC.\r<br />\r<br />This is my first mod for Skyrim and is intended to be simple.\r<br />\r<br />Load this mod after the UNP and Osare mods. I haven&#39;t tested otherwise, but it makes sense in that order.\r<br />\r<br />If you test this mod with a saved game, you may need to move to a new location with new NPCs before it takes effect. The armour and clothing only gets added to inventory on spawn, so NPCs standing next to you which spawned before the mod was active won&#39;t be wearing undies. If you want to test it out quickly, you could use the console to spawn a merchant and killer her:\r<br />&#34;player.placeatme 000457ff 1&#34;\r<br />\r<br />I use this with:\r<br />[list]\r<br />[*]UNP Dragoinborn Armors\r<br />[*]UNP Dawnguard Armors\r<br />[*]UNP Female Armors\r<br />[*]Immersive Armors\r<br />[/list]\r<br />I&#39;m not suggesting you need those, just that using them shouldn&#39;t be a problem.\r<br />\r<br />[b][u]Incompatibilities[/u][/b]\r<br />The mod doesn&#39;t work well with some skimpy armour packs, as the underwear is worn by the NPCs at all times under their armour. For example, [url=http://www.nexusmods.com/skyrim/mods/9546/?]UNP - Ultra Skimpy Armor by Nightasy[/url] shows a lot of leg. When you put Osare underwear underneath it, some armours look a bit silly. All that hide doesn&#39;t really go well with frilly lace poking through. However, I haven&#39;t had problems with non-skimpy armour sets.\r<br />\r<br />If you use a male body replacer and want to cover up male nudity, then this mod won&#39;t help. If you got a different underwear mod to give the males underwear then running it at the same time as this mod could result in NPCs having more than one underwear item in their inventory.",
  "categoryId": "60",
  "version": "1.1",
  "author": "Sir Adelaide",
  "createdUnix": "1392729648",
  "updatedUnix": "1392899809",
  "containsAdultContent": true,
  "uploadedBy": "siradelaide",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097642",
      "name": "AutoUndies",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "AutoUndies-51252-1-0.rar",
      "uploadedUnix": "1392729525",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c3fb4179fc62c72baae7f12672da7b0912f667451bf4c8741a6b97c696422c01/analysis/1407939006/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AutoUndies-51252-1-0.rar?fid=1000097642&ttl=1535833483&ri=8192&rs=8192&setec=125f950f4c938ad4c20f0e214e7c98d8"
    },
    {
      "fileId": "1000097776",
      "name": "AutoUndies",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "AutoUndies-51252-1-01.7z",
      "uploadedUnix": "1392807954",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/c172620a9ffde42a1394ffa255fbab5fbbcf9be9aa7633979eed921b7e43d62e/analysis/1407940337/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AutoUndies-51252-1-01.7z?fid=1000097776&ttl=1535833483&ri=8192&rs=8192&setec=97081b54ce3453c53d90294909218dab"
    },
    {
      "fileId": "1000097926",
      "name": "AutoUndies",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "AutoUndies-51252-1-1.rar",
      "uploadedUnix": "1392899809",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/37e81db7a608f88f92e6e05064b1c5179118df3c4a8a3dc10b523976cc56393c/analysis/1407942007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AutoUndies-51252-1-1.rar?fid=1000097926&ttl=1535833483&ri=8192&rs=8192&setec=f905da6c8a23bb0ee28f6281bae576a8"
    }
  ]
}