{
  "modId": 51288.0,
  "modName": "Blood Magery",
  "summary": "This mod allows a mage to link their magical abilities with the expenditure of their life force. The intent is to allow for a mage who either dabbles in dark magic, or is willing to martyr themselves to keep their companions alive.",
  "descriptionHtml": "This mod adds a form of magery that allows a mage to gain power through the shedding of their own blood.\r<br />\r<br />[color=yellow][Heading]How to Start:[/Heading][/color]\r<br />When this mod loads, your character will be 1 XP away from the first level (and the first perk) of a Blood Mage. You can earn that XP (and many more as you level) by doing one of the following:\r<br />1) Cast the spell [code]Equilibrium[/code] that you earn from the Labyrinthian quest of the Mage&#39;s College.\r<br />2) Cast the vampire spell [code]Vampiric Drain[/code]. This detects from Keyword rather than specific spells, so it is compatible with vampire overhauls that include the right Keyword.\r<br />3) Have a Vampire &#34;Necks Bitten&#34; count of one or more (if you&#39;ve been a Vampire for some time, you may level up several times).\r<br />\r<br />Once you&#39;ve gained a Blood Mage level, you&#39;ll be informed of that fact by a message in the upper left corner of the screen, along with the fact that you&#39;ve gained a [Blood Mage] Perk.\r<br />\r<br />To spend your perk, look in your Powers menu and cast [code][Blood Mage] Perk Tree[/code], a lesser power that&#39;s linked to your voice. This will open up your Perk menu, which is very similar to the crafting menu.\r<br />\r<br />Initially, there will only be two options: [Blood Mage] Wisdom In Pain and [Uninstall] Blood Magery. I personally recommend selecting Wisdom in Pain.\r<br />\r<br />If you are a Vampire (global PlayerIsVampire = 1), an additional [Blood Mage] Enhanced Vampiric Drain is also available.\r<br />\r<br />[color=yellow][Heading]Paths to Power:[/Heading][/color]\r<br />There are several paths of Blood Magery, and a mage can follow all or none of them at will. Each time a Blood Mage gains a Blood Mage Level, (s)he gains a Blood Mage perk, which can be spent on the abilities below. Each level costs 100 XP more to reach than the previous level.\r<br />\r<br />[color=yellow][b]Miscellaneous Path:[/b][/color]\r<br />[color=green][b]Wisdom In Pain:[/b][/color] This allows a Blood Mage to gain 1 XP for every 100 points of damage that they take. That XP will apply to further Blood Mage levels, and unlock further perks.\r<br />[color=green][b]Equilibrium:[/b][/color] This constant-effect ability drains the mage&#39;s Health towards 50%, recharging Magicka at the same time. The rate per second is equal to the Blood Mage Level. Prerequisite: Wisdom in Pain.\r<br />[color=green][b]Enhanced Vampiric Drain:[/b][/color] Each level of this ability increases the damage of the Vampiric Drain spells by 100%, maximum of three levels (4x damage). Prerequisite: is a Vampire.\r<br />\r<br />[color=yellow][b]Daedric Path:[/b][/color]\r<br />These abilities focus on dealing damage to the Blood Mage&#39;s enemies\r<br />[color=green][b]Hemorrhage:[/b][/color] This Destruction spell allows a Blood Mage to directly damage their victim&#39;s health. The damage of this spell increases dramatically the closer the Blood Mage is to death. Prerequisite: Wisdom in Pain (Misc).\r<br />[color=green][b]Hemorrhage (+20%)[/b][/color] This perk can be selected a maximum of five times. Each time it is selected, it increases the mage&#39;s Hemorrhage damage. Prerequisite: Hemorrhage (Daedric).\r<br />[color=green][b]Resist Poison:[/b][/color] Provides the Blood Mage with 80% resistance to Poison. Prerequisite: Tolerance I (Orcish), not a Vampire.\r<br />[color=green][b]Retaliation:[/b][/color] This perk allows a Blood Mage to store a single dose of Hemorrhagic poison in his/her own veins. This poison will be released when the mage is struck in melee combat. The dose takes 5 minutes to recharge. Prerequisite: Hemorrhage (Daedric) and Resist Poison (Orcish) or is a Vampire.\r<br />[color=green][b]Retaliation Doses (+1):[/b][/color] This increases the maximum number of doses that a Blood Mage can store. Prerequisite: Retaliation (Daedric).\r<br />[color=green][b]Retaliation Time (-30 seconds):[/b][/color] This perk may be selected a maximum of eight times. Each time, it reduces the recharge time for the Mage&#39;s doses by 30 seconds. This will eventually reduce the recharge time to 60 seconds. Prerequisite: Retaliation Doses +1 (twice).\r<br />[color=green][b]Secrete:[/b][/color] This Restoration spell allows a mage to extract a dose of venom from their veins which can later be applied to a weapon. Prerequisite: Retaliation (Daedric).\r<br />[color=green][b]Shared Retaliation:[/b][/color] This perk allows the mage&#39;s Bonded Comrade to also trigger the Retaliation ability when struck. The mage and the comrade share a dose pool and recharge. Prerequsite: Shared Pain (Imperial) and Retaliation (Daedric).\r<br />[color=green][b]Toxic Blood:[/b][/color] This restoration spell allows Blood Mages to toxify their own blood, dealing irresistible damage to themselves, but recharging a dose of their Retaliation poison.\r<br />\r<br />[color=yellow][b]Elven Path:[/b][/color]\r<br />Many Elves have followers, companions or familiars with whom they share a very close bond.\r<br />[color=green][b]MP +10:[/b][/color] Increase the Mage&#39;s base Magicka by 10. Prerequisite: Wisdom in Pain (Misc).\r<br />[color=green][b]Shared Pain:[/b][/color] This perk adds a Restoration spell: [code][Blood Mage] Blood Bond[/code]. This spell, when cast on an Actor, creates a link between the mage and the Bonded comrade. Thereafter, the mage will slowly sacrifice their health at a rate of [Blood Mage Level] points per second to keep the comrade above 75% Health. This ability will not trigger when the mage is below 50% Health. Prerequisite: Equilibrium (Misc).\r<br />[color=green][b]Shared Wisdom:[/b][/color] This perk allows a Blood Mage to gain a little bit of Blood Mage XP each time their comrade is struck. Prerequisite: Shared Pain (Elven).\r<br />[color=green][b]Shared Blessings:[/b][/color] This perk allows a Blood Mage to simultaneously target their comrade whenever they cast certain beneficial spells. This includes the Illusion-buff spells, and many Restoration and Alteration buff spells. With the exception of the Illusion spells (which don&#39;t have Keywords), this is triggered by spell Keywords, so it has the potential to be compatible with other modders&#39; custom spells. Prerequisite: Shared Wisdom (Elven).\r<br />[color=green][b]Blood Brother:[/b][/color] This allows the flow of health to reverse when the Blood Mage is near to death and the Comrade is not. Prerequisite: Shared Pain (Elven).\r<br />\r<br />[color=yellow][b]Imperial Path:[/b][/color]\r<br />The Empire uses its Battle Mages to strong effect on the battlefield.\r<br />[color=green][b]Bloody Power I-III:[/b][/color] Each level increases the magnitude of spells of any school cast by the Blood Mage as (s)he nears death. Prerequisite: Wisdom In Pain (Misc).\r<br />[color=green][b]Bloody Thrift I-III:[/b][/color] Each level decreases the cost of spells of any school cast by the Blood Mage as (s)he nears death. Prerequisite: Wisdom In Pain (Misc).\r<br />[color=green][b]Sacrificial Wrath:[/b][/color] This Destruction spell allows a Blood Mage to sacrifice 50% of their health in order to increase the magnitude of their next spell by 100%. Prerequisite: Bloody Power I (Imperial).\r<br />\r<br />[color=yellow][b]Orcish Path:[/b][/color]\r<br />These abilities focus on surviving damage.\r<br />[color=green][b]HP +10:[/b][/color] Increase the Mage&#39;s base Hit Points by 10. Prerequisite: Wisdom in Pain (Misc).\r<br />[color=green][b]Tolerance I-II:[/b][/color] Gives the mage 10% or 20% resistance to incoming damage. Prerequisite: Wisdom in Pain (Misc).\r<br />[color=green][b]Bloody Regeneration I-III:[/b][/color] Each level increases the Mage&#39;s hit point gain as (s)he nears death. Prerequisite: Tolerance I (Orcish).\r<br />[color=green][b]Bloody Determination I-III:[/b][/color] Each level increases the Mage&#39;s Armor Class as (s)he nears death. Prerequisite: Wisdom In Pain (Misc)\r<br />[color=green][b]Bloody Savagery I-III:[/b][/color] Each level increases the Mage&#39;s physical damage as (s)he nears death. Prerequisite: Wisdom In Pain (Misc)\r<br />[color=green][b]Blood for Breath:[/b][/color] The Blood Mage&#39;s Equilibrium ability can also recharge Stamina. Prerequisite: Equilibrium (Misc)\r<br />\r<br />[Heading]Requirements:[/Heading]\r<br />Skyrim, Update, Dawnguard, Hearthfires, Dragonborn\r<br />\r<br />[Heading]Credits:[/Heading]\r<br />This mod was inspired by the Blood Magus class from Dungeons and Dragons v3.5 as described in the book &#34;Complete Arcane&#34;. Beyond the inspiration, the implementation of the mod is my own.",
  "categoryId": "93",
  "version": "2",
  "author": "MasterBobcat",
  "createdUnix": "1392805927",
  "updatedUnix": "1394416756",
  "containsAdultContent": false,
  "uploadedBy": "MasterBobcat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097772",
      "name": "MB_BloodMage_v1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "23",
      "fileName": "MB_BloodMage_v1-51288-1.zip",
      "uploadedUnix": "1392805920",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/70c9b1377f982a499aec6706f8f7f8b5f07de8a688dd091c12470f7d937af225/analysis/1407940332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MB_BloodMage_v1-51288-1.zip?fid=1000097772&ttl=1535833526&ri=8192&rs=8192&setec=ddadc94d5f4ca295f19bc7371b277c0b"
    },
    {
      "fileId": "1000100613",
      "name": "MB_BloodMagery_v2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30",
      "fileName": "MB_BloodMagery_v2-51288-2.zip",
      "uploadedUnix": "1394416756",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/f93a5f4573ad5bea031a17a381163ba79adaffd0dc4d5b3cded778a652f33c9a/analysis/1407975482/",
      "changelogHtml": " Bug Fix for Equilibrium <br/> \n Reversed Elven and Imperial abilities to fit closer to Lore <br/> \n Added several new abilities in all Paths <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MB_BloodMagery_v2-51288-2.zip?fid=1000100613&ttl=1535833527&ri=8192&rs=8192&setec=3d25ce1ef2f939e91fe97e0266d5f09f"
    }
  ]
}