{
  "modId": 51316.0,
  "modName": "Thalmor and Arcane Clothing Expanded",
  "summary": "Adds a whole variety of magical effects (On par with College outfits) to the otherwise boring Thalmor outfits, adds crafting recipes for unenchanted (and enchanted) versions of Thalmor, Arch Mage and College (mage) outfits, and gives the Thalmor a new learnable Fortify Destruction enchantment.",
  "descriptionHtml": "WARNING: The screenshots are crappy because my computer is crappy and I can only use a crappy resolution without crashing. Players who aren&#39;t playing on a PC-saurus may experience a better aesthetic gameplay.\r<br />\r<br />The Thalmor. Since the Oblivion crysis, they have constituted the single greatest threat to the free people of Tamriel, especially to the free thinking... Which is strange, since their most powerful agents wear cool-looking toilet paper suits. Or do they?\r<br />\r<br />Not anymore. Now, the people of Skyrim may behold true Altmer Supremacy&#33; The first thing this mod does is add a variety of enchantments to Thalmor robes as wide as that of college Robes (the double enchanted standard magical robes) of varying power depending on the player&#39;s level. Their hoods, boots and gloves will now also harbor powerful enchantments. From 4 bad outfit pieces, the Thalmor wizards can now wear four of a selection of 40 items - and since they&#39;re haughty, self-conscious elves, they&#39;ll be in matching sets&#33;\r<br />\r<br />Power&#33; Some Thalmor equipment pieces may bear the powerful &#39;&#39;Fortify Destruction Damage&#39;&#39; enchantment, a much needed addition in a game where blacksmiths get better damage reduction and damage output than mages (seriously, this mod makes a pure mage as viable - and enjoyeable - at Legendary difficulty as a pure melee fighter). This also explains the fabled &#39;&#39;Aldmeri Supremacy&#39;&#39;. But beware: to get this enchantment, you will need to kill a Thalmor agent - or get him naked, whichever you choose...\r<br />\r<br />With this mod, the Thalmor Hooded Robes are no more: A standalone hood has been added to theThalmor outfit list, so you can finally wear their cool as hell robes without being deprived of an enchantment spot. Same thing goes with the Arch-Mage Robes, who now have a standalone hood.\r<br />\r<br />Behold now the tools of creation&#33; This mod adds over 160 crafting recipes&#33; In the base game, there are 5 types of models for &#39;&#39;college robes&#39;&#39;, but every model is only used by a category of enchanted robe (Ex: one model for Novice robes, one model for expert robes, etc). This mod allows you to craft any robe of any of the 5 qualities with any of the 5 models - without counting another model for the Thalmor robes, which can be created in the same fashion with the same diversity of enchantments. \r<br />\r<br />Also, this mod allows you to craft unenchanted versions any of the above mentioned robes, plus additional hoods that Beth added to the archives but not the game. It also adds craftable Thalmor and &#39;&#39;regular mage robes&#39;&#39; equivalents of the Arch-mage&#39;s Robes, which is to say 7 more badass robes (counting the Arch-Mage&#39;s robes themselves, that can now be crafted should the player lose them) - all of which can be further empowered and improved into more powerful versions - at a great cost, however - by those few characters that have fully mastered all arcane trades.\r<br />\r<br />Afraid that you&#39;ll never be able to spot the recipe for Leather strips in the Tanning Rack menu again? Nuh-huh&#33; Most of those recipes won&#39;t even appear in your inventory if you lack the perks, skill ranks or materials to craft them. All a beginning player might create are unenchanted versions (and even then, Thalmor stuff requires the &#39;&#39;Elven Smithing perk&#39;&#39;), and only one hood and one robe recipe will show in the menu if the character lacks the appropriate materials.\r<br />\r<br />Note: All hood from my mod allow their wearer to wear circlets at the same time, this is to allow my mod to blend more easily with HeadBomb&#39;s Complete Crafting Overhaul and other mods that allow the same thing.\r<br />\r<br />Requirements for a recipe to appear are as follows:\r<br />\r<br />- For the unenchanted novice hood and robes: Nothing, they&#39;ll always be there for ye.\r<br />\r<br />- For unenchanted robes and hoods above Novice quality: Have the appropriate materials (The same materials are needed for all types of unenchanted robes).\r<br />\r<br />- For enchanted College robes of Novice quality: Have an unenchanted robe in your inventory, an Enchanting skill of 20, and a Novice perk in the desired magical skill.\r<br />\r<br />- For enchanted College robes of Apprentice quality: Have an unenchanted robe in your inventory, an Enchanting skill of 40, and an apprentice perk in the desired magical skill, etc.\r<br />\r<br />- For Unenchanted Thalmor equipment: have the Elven Smithing Perk\r<br />\r<br />- For Enchanted Thalmor Robes: Have an unenchanted Thalmor Robe + the same requirements as any College Robes\r<br />\r<br />- For the Arch-Mage&#39;s Robes, unenchanted: become the Arch-Mage.\r<br />\r<br />- For the Arch-Mage&#39;s Robes, enchanted: be the arch-mage, have an unenchanted version of the Arch-Mage&#39;s Robes along with at least the Expert perk in all magic schools, plus level 100 in Enchanting.\r<br />\r<br />- For the Arch-Mage&#39;s Robes, Empowered: Same as above, plus extrmely costly ingredients, plus Master perk in all magic schools including Enchanting.\r<br />\r<br />-You can figure out the rest.\r<br />\r<br />====================================================================================\r<br />\r<br />VERSION HISTORY:\r<br />\r<br />1.1 : Fixed recipe for the Thalmor Grand Magister Robes. It won&#39;t produce a dozen hostile arcane smoothies anymore.\r<br />\r<br />1.0 : Initial Release\r<br />\r<br />====================================================================================\r<br />\r<br />REQUIREMENTS:\r<br />\r<br />-The Latest version of Skyrim\r<br />\r<br />-Skyrim Unofficial patch. This was proven to be necessary. Without it, the game will crash on load.\r<br />\r<br />====================================================================================\r<br />\r<br />CONFLICTS\r<br />\r<br />Virtually everything that is in this ESP is an addition. My mod leaves EVERYTHING in the game untouched, EXCEPT for the ThalmorOutfit01 and ThalmorOutfitNoHood outfit groups, which means that items added through other mods to the Thalmor outfit will conflict (this does not, however, extend to their inventory, that&#39;s an entirely separate thing). SO it shouldn&#39;t create much problems, really.\r<br />\r<br />If you spot something wrong, let me know.\r<br />\r<br />====================================================================================\r<br />\r<br />INSTALLATION\r<br />\r<br />This is a simple ESP file.\r<br />\r<br />Either use NMM (recommended) or unpack the file with 7-Zip and drop the ESP file into your Data Folder.\r<br />\r<br />====================================================================================\r<br />\r<br />It would be an honour to know that another modder has used these files to further his own goals. As long as, of course, my name appears somewhere. And it&#39;s even better if I&#39;m informed beforehand...\r<br />\r<br />====================================================================================\r<br />\r<br />CREDITS\r<br />\r<br />Destruction damage enchant inspired from Bebop_Monkey_X&#39;s mod, which can be seen here: http://www.nexusmods.com/skyrim/mods/14210/?\r<br />\r<br />ALso, well, thanks to Bethesda for make such a great game with so may holes for us to fill&#33;\r<br />\r<br />====================================================================================\r<br />\r<br />PROGRAMS USED\r<br />\r<br />Skyrim Creation Kit.\r<br />\r<br />FRAPS for the screenshots.",
  "categoryId": "60",
  "version": "1.1",
  "author": "Allomerus",
  "createdUnix": "1392925306",
  "updatedUnix": "1393474971",
  "containsAdultContent": false,
  "uploadedBy": "allomerus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097910",
      "name": "Expanded Thalmor and Arcane Clothing",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Expanded Thalmor and Arcane Clothing-51316-1-0.7z",
      "uploadedUnix": "1392887009",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd26fe77f18069fc23b95a4da01317de7306f82259f489935a0246e2ab615d9f/analysis/1407941849/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Expanded%20Thalmor%20and%20Arcane%20Clothing-51316-1-0.7z?fid=1000097910&ttl=1535833576&ri=8192&rs=8192&setec=910367a85e2bad92ca3c94079b529d61"
    },
    {
      "fileId": "1000098928",
      "name": "Expanded Thalmor and Arcane Clothing",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Expanded Thalmor and Arcane Clothing-51316-1-1.7z",
      "uploadedUnix": "1393474971",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0ba18638392b8f4a63f7d3efdfacdbd8b082b247a73edc4c6b2efaf7d5bd9d9f/analysis/1407951730/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Expanded%20Thalmor%20and%20Arcane%20Clothing-51316-1-1.7z?fid=1000098928&ttl=1535833576&ri=8192&rs=8192&setec=7697bc2cd87afe8a7219a4ee8f3f6965"
    }
  ]
}