{
  "modId": 51341.0,
  "modName": "Battle Buddy Jon Battle-Born the Forlorn Lover",
  "summary": "Jon Battle-Born is a cool guy. Mellow and wise despite hailing from a family of Empire Toe-Lickers, he seems to have a well rounded view on life. \r<br />\r<br />To be both mellow and wise my friend, that there is something to strive for&#33;",
  "descriptionHtml": "[b]Jon Battle-Born[/b] is a cool guy. Mellow and wise despite hailing from a family of Empire Toe-Lickers, he seems to have a well rounded view on life. To be both mellow and wise my friend, that there is something to strive for&#33;\r<br />\r<br />All in all, a great guy to drink some mead with, maybe even go on a few dungeon crawls...a little male bonding is a good thing&#33; Sure, he has this &#34;thing&#34; for that Graymane girl, but a few drinks and some good conversation might just change his mind.\r<br />\r<br />[i]&#34;I love a good sword fight as much as the next man, but there&#39;s more to life.&#34; \r<br />\r<br />&#34;May your sword be sharp, and your tongue sharper.&#34; [/i]\r<br />\r<br />Swords, tongues..men...is it hot in here, or what?\r<br />\r<br />I always wanted there to be more going on with Jon&#39;s character. He&#39;s one of the first interesting Whiterun Residents that you will you meet and he has an interesting family along with a Montague and Capule type romantic situation going on in the background. \r<br />\r<br />So, I searched for mods that would get Jon more involved in my game, I didn&#39;t find much that appealed to me. On Steam, I ran across a mod titled: Jon Battle-Born Companion/Hearthfire Steward (DOES NOT REQUIRE HEARTHFIRE&#33;&#33;&#33;) by UniversalGameplay. ( Yeah, it rolls off the tongue, eh? ) \r<br />\r<br />After looking at UniversalGameplay&#39;s changes to Jon&#39;s record, I figured I could make my own edits for other simple changes in keeping with my own particular goals for Jon in mind.\r<br />\r<br />I didn&#39;t want to change Jon overly much, just enough to make him a reliable follower for the widest variety of play-styles, these changes are as follows:\r<br />\r<br />- Morality: He won&#39;t report you for crimes. ( I debated having him ignore everything but attacks on &#34;innocent&#34; people but to be honest that might be irritating for some players. )\r<br />\r<br />- Marriage: He is eligible for Marriage ( You need to have spoken to Maramal about marriage, and you need to wear an Amulet of Mara. )\r<br />\r<br />- Mood: Cocky :)\r<br />\r<br />- Stats: Jon Battle-Born will level with the Player, he uses the default combat package but I find him to be hugely versatile ( ranged, staffs, 2H, 1H melee, etc )\r<br />\r<br />- Level: No level cap\r<br />\r<br />- Gift: Occasionally Charitable when the mood strikes him\r<br />\r<br />- Essential: My reasoning is that if you like Jon as a Follower you won&#39;t want to have him killed off accidentally or in a big fight. \r<br />\r<br />======================================\r<br />\r<br />But, keep this in mind, if you manage to get in a fight with him prior to making him your buddy...well he won&#39;t be dying in that fight. I stress this because there is a quest where you could potentially ( if you are an especially inept pickpocketer ) cause him to attack you if caught. Obviously, there are other ways you could piss him off prior to follower-ship, but you get the point.\r<br />\r<br />Additionally, the quest involving Jon Battle-Born is an optional solution branch of the Quest Missing in Action. For best results, you should do the first steps of that quest before bringing Jon into your life. ( You can install the ESP, just don&#39;t make Jon Battle-Born a follower until you get some real information on a certain missing Greymane. ) The bonus to this is that you can give Jon his personal property ( assuming you took it ) back after you cruelly blackmail the poor lovesick, star-crossed lover Nord, ( Olfina Gray-Mane is a bit of a hussy anyways, Jon&#39;s better off with you exploring the world together )\r<br />\r<br />UPDATE: Actually, having Jon as a Follower prior to starting or advancing the Missing in Action Quest is perfectly alright. Perhaps while innocently rummaging through Jon&#39;s bag&#39;s to borrow his shaving kit, you may run into a certain letter...if you confront Jon about the letter with the MIA quest active...everything will work properly. \r<br />\r<br />[b]I highly suggest that you do this while in Whiterun&#33; Otherwise, you may have to wait while Jon travels all the way back to Whiterun from your location to retrieve the information you are asking for...[/b] Jon will do all the steps just like he would if he wasn&#39;t a follower, let it play out as normal. I always give Jon back his letter after, just to be nice. :)\r<br />\r<br />=====================================\r<br />\r<br />Additional Details:\r<br />\r<br />No requirements other than Skyrim.esm and Update.esm\r<br />Load Order: plop Jon&#39;s esp file after or among your other follower type mods.\r<br />Conflicts: well if you have another mod that alters Jon Battle-Born&#39;s records...if it is an appearance changing mod try fiddling around with your load order, see what you see.\r<br />Bugs: Well, none I am aware of, I didn&#39;t fat finger any thing while editing Jon&#39;s record. The marriage portion of the mod should work fine with Jon&#39;s default voice type, something I&#39;d be loathe to change.\r<br />\r<br />Suggestions: \r<br />\r<br />- Extensible Follower Framework by Expired ( release version ) is awesome for trouble free followers, but any other good follower management mod should be fine\r<br />\r<br />- The Return of Thorald GreyMane-Now A Fully Voiced-Standalone Male Companion by rhowington \r<br />How can you resist? Jon and Thorald battling alongside you&#33; Obviously, my simple edits are nothing compared to the exemplary and worthy work of Rhowington.\r<br />\r<br />- Better males - Beautiful nudes and faces - New hairstyles by Chris57 and FavoredSoul \r<br />Don&#39;t be afraid of beautiful men, unless that&#39;s your thing.\r<br />\r<br />Future Plans:\r<br /> I will look into polishing up some details and tid-bits. For example, currently Jon has no Assigned Bed in the whole of the Game World, poor guy&#33; \r<br />\r<br />My understanding is that without a bed ownership entry there won&#39;t be any Lover&#39;s Comfort Buff if you, umm...marry the delightful Jon. I have not verified this myself. But considering the guy is so tired from having no bed and fighting baddies with you, who can blame him if he can&#39;t &#34;comfort&#34; you. He has needs too, you know?\r<br />\r<br />Lastly, there&#39;s a certain letter Jon has written to that hussy in the Bannered Mare. The letter exists in the data files but not present in the game world. \r<br />\r<br />http://www.uesp.net/wiki/Skyrim:Letter_from_Jon\r<br />\r<br />Presumably the letter could also be a trigger for the Missing in Action portion of the quest. Maybe that letter could end up on a dead courier? Or perhaps, better yet, left momentarily forgotten in a quiet corner of the Bannered Mare? Misplaced by a busy blonde...\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "96",
  "version": "1.2",
  "author": "Kuldebar",
  "createdUnix": "1392943476",
  "updatedUnix": "1395444983",
  "containsAdultContent": false,
  "uploadedBy": "Kuldebar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000097992",
      "name": "Battle Buddy Jon Battle-Born",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Battle Buddy Jon Battle-Born-51341-1-0.7z",
      "uploadedUnix": "1392942449",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e46b2bfb0396bed03ebf60131aad2b8f51a8f35f0ea0273ed499d9a1751eb09d/analysis/1407942731/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battle%20Buddy%20Jon%20Battle-Born-51341-1-0.7z?fid=1000097992&ttl=1535833612&ri=8192&rs=8192&setec=2f1d5aa85a6efee5996bae3f3c128eef"
    },
    {
      "fileId": "1000098356",
      "name": "Battle Buddy Jon Battle-Born for NPC Overhaul",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Battle Buddy Jon Battle-Born for NPC Overhaul-51341-1-0.7z",
      "uploadedUnix": "1393127314",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cdfd079196b5dd7992825a170462f7397bf14076e4771cd8debcbf474d7f2810/analysis/1407946197/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battle%20Buddy%20Jon%20Battle-Born%20for%20NPC%20Overhaul-51341-1-0.7z?fid=1000098356&ttl=1535833613&ri=8192&rs=8192&setec=2f7f1fa95de482abcb99628e9275da14"
    },
    {
      "fileId": "1000101867",
      "name": "Battle Buddy Jon Battle-Born the Forlorn Lover for NPC Overhaul",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Battle Buddy Jon Battle-Born the Forlorn Lover for NPC Overhaul-51341-1-2.7z",
      "uploadedUnix": "1395359177",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/9734a39e2aef2a4c606a5f9ea23503d819d469ef3a6ab980d9d69c4a8c3e46fc/analysis/1407989410/",
      "changelogHtml": " I gave Jon some suitable warrior perks and also a combat style befitting him (according to his stats and gear) He is now a warrior proficient in sword and board, very tanky but he will use ranged weapons if he can&#39;t bash his foes directly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battle%20Buddy%20Jon%20Battle-Born%20the%20Forlorn%20Lover%20for%20NPC%20Overhaul-51341-1-2.7z?fid=1000101867&ttl=1535833613&ri=8192&rs=8192&setec=da7a513a1fe2756de019d2f354821382"
    },
    {
      "fileId": "1000101958",
      "name": "Battle Buddy Jon Battle-Born the Forlorn Lover",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Battle Buddy Jon Battle-Born the Forlorn Lover-51341-1-2.7z",
      "uploadedUnix": "1395444983",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/cdbc749c8bdd9efc9f88bfcb1dcf7c264728bf18a9a773166ebbfdaa9645041c/analysis/1407990403/",
      "changelogHtml": " I gave Jon some suitable warrior perks and also a combat style befitting him (according to his stats and gear) He is now a warrior proficient in sword and board, very tanky but he will use ranged weapons if he can&#39;t bash his foes directly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battle%20Buddy%20Jon%20Battle-Born%20the%20Forlorn%20Lover-51341-1-2.7z?fid=1000101958&ttl=1535833614&ri=8192&rs=8192&setec=45869caeb7472d50dc81446f1687c4d6"
    }
  ]
}