{
  "modId": 5135.0,
  "modName": "Triss Outfitt For TES V Skyrim",
  "summary": "Lets end this madnes now as it doesnt bring anything good nor for Nexus and nor for Me",
  "descriptionHtml": "TRISS OUTFITT FOR SKYRIM v1.4\r\n\r\n=========================================================================================\r\n\r\nConversion of Triss Outfitt from \\\"The Witcher 2\\\" to TESV Skyrim\r\n\r\n=========================================================================================\r\n\r\nRequiements:\r\n\r\n* TESV Skyrim offcorse, and a brain ;)\r\n\r\n=========================================================================================\r\n\r\nInstalation/usage:\r\n\r\nCopy the archive content into your x:\\\\TESV Skyrim\\\\Data folder, when asked overwrite. Activate the esp in NMM (Nexus Mod Manager).\r\n\r\nBefore updating to new version unequip the armor first.\r\n\r\n* Console code for the Robe xx0999aa\r\n* Console code for the Gloves xx0999ab\r\n* Console code for the Boots xx0999ac\r\n* Console code for the Light Armor xx0999ad\r\n* Console code for the Light Gloves xx0999af\r\n* Console code for the Light Boots xx0999ae\r\n\r\nXX is the number of your mod index/load order in Nexus Mod Manager. (I hope you know how to use NMM, you know how to use console and how to find mod index/load order if not then be smart and google as i do not provide support for such basic things)\r\n\r\nNon enchanted version can be bought from vendors:\r\n\r\n* Cloth is sold by Faralda from Mages College\r\n* Leather is sold by Rustleif, the Blacksmith from Dawnstar\r\n\r\n\r\n=========================================================================================\r\n\r\nBugs/Issues:\r\n\r\n* As within first release some might occur, specialy some minor rigging or verts wieghting issues that are at most visualy unapealling and wont corrupt your game in any way or form.\r\n* Due to limited modding tools this modyfication is also limited.\r\n\r\n=========================================================================================\r\n\r\nChangelog:\r\n\r\n* v1.4 Changed weight painting of breast area so now they shouldnt deform that much in certain Idles.\r\n* v1.3a Only small fast edit to the plugin - Added non enchanted version of those outfits to vendors : Cloth to Faralda from Mages College, and Leather one to Rustleif the Blacksmith from Dawnstar.\r\n* v1.3 Added Light Armor Variant, lowered the enchants a little bit, fixed gloves causing hole with forearms (my bad forgot to do skin partytioning ) Armors use separate meshes and textures so you can use retexture for light armor without affecting cloth textures and vice verse.\r\n* v1.2a Standalone replacer (be aware thou its OPed as i did it for an high lvl mages, tryed to add it to Collage Merchant for an huge price so low lvls wouldnt be able to afford it but the plugin crashes the game then ... sorry cant figure it out right now why it does that)\r\n* v1.2 Fixed a loot of verts weighting/rigging, fixed neck hole issue, changed size scalling to majory affect hips, bottom, breasts, rest of body will be affected minory giving the body\r\nmore well builded/athletic shape instead of fat\r\n* v1.1 Fixed Gloves clipping and added body scaling\r\n* v1.0a Updated rigging for belt bags\r\n* v1.0 Initial release\r\n\r\n=========================================================================================\r\n\r\nThanks/Credits:\r\n\r\nBethesda for TESV Skyrim\r\nCDProject RED For \\\"The Witcher 2\\\" and its assets\r\n\r\n=========================================================================================\r\n\r\nLicensing/Legal:\r\n\r\nAll models in this pack are copyrighted, and belong to theyr oryginal authors and copyright holders. This mod is not an commercial modyfication and so you cant gain any profits by releasing any parts of it for any material benefits.\r\n\r\nThe original Triss armor concept, mesh and textures are owned and copyrighted by CD Projekt and used with permission.\r\nThe Witcher is a trademark of CD Projekt. All rights reserved.\r\nhttp://www.cdprojekt.com/\r\n\r\n=========================================================================================\r\n\r\nTerms and Conditions:\r\n\r\n1. By downloading this mod, you declare that you agree to the terms and conditions stated.\r\n2. If you refuse to accept the terms and conditions, do not download the mod. If downloaded, you can waiver the terms and conditions by deleting all associated files.\r\n3. The model and textures are adapted from CD Projekt RED\\'s intellectual work \\'The Witcher 2\\'. However, weight paint or riggings are works of Fraper, and are not subject to jurisdiction by CD Projekt RED.\r\n4. Modification of this work is subject to accreditation to Fraper and CD Projekt RED.\r\n5. These terms and conditions are ultimately subject to the Nexus site\\'s Terms and Services; any conflicting directives are to be resolved with Robin Scott (aka. Dark0ne).\r\n6. The aforementioned terms and conditions are subject to change without notice.\r\n\r\n\r\n#Fraper ",
  "categoryId": "60",
  "version": "1.4",
  "author": "Fraper",
  "createdUnix": "1325496507",
  "updatedUnix": "1326394173",
  "containsAdultContent": false,
  "uploadedBy": "Fraper",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19188",
      "name": "Triss v1_4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23918",
      "fileName": "Triss v1_4-5135-1-4.rar",
      "uploadedUnix": "1326394173",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/5e0908de116783f942beb54939a2095bff110f0215baea52dbe93a61c74125a7/analysis/1406605513/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Triss%20v1_4-5135-1-4.rar?fid=19188&ttl=1535761634&ri=8192&rs=8192&setec=24cb1751b09e194c39f28040b6a0a300"
    }
  ]
}