{
  "modId": 51369.0,
  "modName": "HoT Markarth",
  "summary": "Previously known as Markarth of the Dwemer ~ MoD.\r<br />Hold of Technology: Markarth, is a modular city overhaul with much more features to come.",
  "descriptionHtml": "Previously known as Markarth of the Dwemer ~ MoD.\r<br />If you do enjoy my mod, please comment. Not for my sake, but for all others who have been wanting a new Markarth overhaul that they might enjoy as I can understand that not many people look forward to new Markarth mods as much as Riverwood or Whiterun etc. Thank you, and have fun :)\r<br />\r<br />[color=#ffff00]Index:\r<br />00. Requirements\r<br />01. Introduction\r<br />02: Mod Info\r<br />03. Known Compatibilities\r<br />04. Installation\r<br />05. Thanks To[/color]\r<br />\r<br />[color=#ff0000]00. Requirements:[/color]\r<br />- Latest version of Skyrim\r<br />\r<br />- iNeeds if you use the sinks add-on\r<br />\r<br />[color=#00ff00]Recommended mods to use with:[/color]\r<br />- Enhanced Lights and FX\r<br />- Climates of Tamriel - Darker Nights\r<br />\r<br />[color=#ff0000]01. Introduction:[/color]\r<br />Hello fellow Nexus users&#33;\r<br />\r<br />   Hold of Technology: Markarth, is my first ever created mod, but I do feel confident that my work is acceptable. Thank you all for your feedback, it appeared to me that I was indeed having the right approach on my design according to you guys, so I stayed true to it.\r<br />  \r<br />   HoT Markarth is a mod that prioritizes on enhancing the aesthetics of the hold Markarth, the mod does come with add-ons that may come modularly. The aim of the design is to have a good balance between realism and just plain good looks. The mod does add a ton of content, as I have attempted to fill in anywhere that seems to have an &#34;empty void&#34; gap, as if something should be there. \r<br />\r<br />   Stoop Over Markarth http://www.nexusmods.com/skyrim/mods/26856/? has been featured in this mod&#33; it is not exactly the same as the original as I have tweaked it quite a bit to be compatible with my mod and got rid of every single navmesh entry it previously had with TESV Edit and killed it with fire&#33; iNeeds support has been added to my sinks, you can now use the sinks to refill your empty waterskins.\r<br />\r<br />[color=#ff0000]02: Mod Info:[/color]\r<br />Curious of my mod&#39;s performance impact?\r<br />\r<br />My PC specs are: \r<br />OS: Windows 8 64-bit\r<br />Dual Core Processor i3-3240 @ 3.40GHz 4 GB RAM\r<br />Intel(R) HD Graphics 2500 1.5 GB VRAM\r<br />I play with about 75 mods\r<br />\r<br />   Yeah, I know... not very good, I only use ENBs for screen shots lol. I play on 800x600 resolution on low-medium settings and play with about 15-25 FPS, my mod does hit my performance but if you have a better system than mine, you shouldn&#39;t have to worry too much.\r<br />\r<br />[color=#00ff00]There are 6 vanilla edits that I have made in this current version:[/color]\r<br />1. Adjusted the smelter.\r<br />2. Up-scaled a dock platform.\r<br />3. Re-adjusted the hammer marker on the smelter to match\r<br />4. Disabled (NOT DELETED) the Nord corpse in the river cage.\r<br />5. Disabled some skeletons in the water.\r<br />6. Navmeshing on some additional platforms added by me.\r<br />All files have been cleaned with TESV Edit, all vanilla edits are intentional.\r<br />\r<br />[color=#00ff00]So far, this is what&#39;s pretty much added:[/color]\r<br />1. Some-what immersive scenery all over the place within the hold.\r<br />2. Sinks with iNeeds support, you may refill your empty waterskins with them.\r<br />3. Dwemer pipes-and lots of them, they serve as both a water system and safety railing&#33; Markarth has plenty of dangerous ledges.\r<br />4. Street lights&#33; Markarth is the closest thing to technology as a hold in all of Skyrim, so I decided to take advantage of that, also... it can get really dark.\r<br />5. Tons of benches, not sure why people are so fond of standing non-stop in Markarth.\r<br />6. Roof tops at the waterfall bridges, it was immersion breaking for me to have to walk by those abominations with no railing or anything to keep the nobles dry, made me wonder if the Jarl even cared about his own citizens.\r<br />7. A REAL working wood chopping block.\r<br />8. Working navmeshes on all extensions. The navmeshes has been tested and should work fine, should also be fine to use.\r<br />\r<br />[color=#00ff00]As of right now, the mod does not include:[/color]\r<br />1. Interior editing (probably wont ever happen)\r<br />2. Any additional AIs.\r<br />3. Editing of Markarth&#39;s outskirts.\r<br />\r<br />   Well, that&#39;s all I really have to write for now, I have more planned for this mod but I want a fresh perspective on what&#39;s going on. Any well-thought out feedback is appreciated, and thank you for having the patience to read this-and if you test out my mod, I hope you enjoy it. :)\r<br />\r<br />[color=#ff0000]03. Known Compatibilities:[/color]\r<br />* Stoop Over Markarth - Incompatible, the mod has it&#39;s own version. Do not use with my mod.\r<br />* Markarth+ - Not compatible, or at least it will run with my mod, just wont work good together visual-wise. I do have an alternative for a flora overhaul within my mod though.\r<br />* Civil War Overhaul - I have no idea yet, going to check how much my mod intrudes on NPC pathing someday, feel free to post your experience with the Civil War and my mod together.\r<br />* ELFX - Compatible, this mod was actually built to synergize with the ELFX Exteriors module from the start.\r<br />* I would just recommend this mod to be not used with Markarth mods that intends to aesthetically overhaul the same area as mine does, which is inside the hold.\r<br />\r<br />[color=#ff0000]04. Installation:[/color]\r<br />Just simply click on the Download With NMM button, activate the mod via NMM, and choose what add-ons you want to be downloaded in the script installer. Want to install manually? from the 00 Main file directory, extract the file as well as the meshes folder into your data directory, if you wish to have the iNeeds add-on, extract the file from 01 iNeeds, but make sure you have iNeeds.esp installed as it is required.\r<br />\r<br />[color=#ff0000]05. Thanks To:[/color]\r<br />Everyone who has endorsed this mod, kudos to you all seriously, it really means a lot to me^^\r<br />\r<br />My wife, she has helped me a bit during the alpha stages and gave some opinions during beta. You know the pink tree that I&#39;ve placed near the mines? yeah, she picked that tree to be used, I originally was going to use a dead Reach Tree lol. In v1.1 she suggested adding the water fountain and the hanging moss on the roof tops.\r<br />\r<br />marxercise for creating Stoop Over Markarth and allowing permissions http://www.nexusmods.com/skyrim/mods/26856/?\r<br />Such a great mod, and he allows Nexus users to openly use it. If you really enjoy the addition of his mod within mine, you can install his mod with NMM, uncheck the .esp in your load order, and endorse :)\r<br />\r<br />The makers and team of TESV Edit, converting some features to separate modules as well as keeping a clean mod may not of had been possible for me.\r<br />\r<br />The makers and team of Wrye Bash, saved a ton of time with the Esmify and Espify feature to create mod dependancy, and also helped me rename all the module&#39;s dependancies.\r<br />\r<br />Everyone&#39;s support from the comments section, you guys really had a big impact on my approach towards developing my mod.\r<br />\r<br />XunAmarox for writing a great FOMOD installer tutorial, I probably would not of had figured out how to make a script installer without it. http://www.nexusmods.com/skyrim/mods/39434/?\r<br />\r<br />[color=#00ff00]The mods I&#39;ve used for screen shots are:[/color]\r<br />Performance and Realistic ENB\r<br />W.A.T.E.R.\r<br />Climates of Tamriel\r<br />Enhanced Lights and FX\r<br />Immersive Hud\r<br />Static Mesh Improvement Mod",
  "categoryId": "53",
  "version": "1.1",
  "author": "Xxbtztrl",
  "createdUnix": "1393018782",
  "updatedUnix": "1394563189",
  "containsAdultContent": false,
  "uploadedBy": "Xxbtztrl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098113",
      "name": "Markarth of the Dwemer BETA",
      "version": "BETA",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17",
      "fileName": "Markarth of the Dwemer BETA-51369-BETA.rar",
      "uploadedUnix": "1393021443",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/983610fcbf34cbf81f77d93fc6130a5e693c2201ccd8e4c92f0a840006782ccb/analysis/1407944122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20of%20the%20Dwemer%20BETA-51369-BETA.rar?fid=1000098113&ttl=1535833660&ri=8192&rs=8192&setec=726c62faae78a0040bbd632fde1327eb"
    },
    {
      "fileId": "1000099092",
      "name": "HoT Markarth",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "876",
      "fileName": "HoT Markarth-51369-1-0.rar",
      "uploadedUnix": "1393586920",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f0c5852c16ecdf3d47f865ef774eebe80e7536a64d87accdc4252cde7febfc0c/analysis/1407953537/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HoT%20Markarth-51369-1-0.rar?fid=1000099092&ttl=1535833660&ri=8192&rs=8192&setec=c8049ee90b4175819b1839f25188ef03"
    },
    {
      "fileId": "1000099176",
      "name": "HoT Markarth",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "983",
      "fileName": "HoT Markarth-51369-1-0-1.rar",
      "uploadedUnix": "1393626987",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3cdfeb6fb2073f87d54b5c5386bb05baa0e7eb246a0a2a70cd55c32f028492fc/analysis/1407954246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HoT%20Markarth-51369-1-0-1.rar?fid=1000099176&ttl=1535833661&ri=8192&rs=8192&setec=7959226ce783ee74182be1a41a989c09"
    },
    {
      "fileId": "1000100844",
      "name": "HoT Markarth",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "887",
      "fileName": "HoT Markarth-51369-1-1.rar",
      "uploadedUnix": "1394563189",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/81b5f2a1e18ac31ac8e2b051cf88ec079f27a773f3e29eb87de2e871fce7b0fc/analysis/1407978496/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HoT%20Markarth-51369-1-1.rar?fid=1000100844&ttl=1535833661&ri=8192&rs=8192&setec=3a1bf1442f649502fb39676b18f0052c"
    }
  ]
}