{
  "modId": 51387.0,
  "modName": "Player Voicesets",
  "summary": "Tired of being a silent wave of murderous rage sweeping across Skyrim? Now you can be chattering away through all of your violent episodes. (Works for non-psychotics also.)",
  "descriptionHtml": "[size=6]LIKE, I JUST WISH I KNEW WHAT WAS GOING ON IN THAT HEAD OF YOURS, LOL.[/size]\r<br />\r<br />[size=3]IT NEEDS DAWNGUARD [s]RIGHT NOW[/s] FOREVER GUYS, JEEZE[/size]\r<br />\r<br />\r<br />[size=3][b]DO NOT ACTIVATE UNTIL YOUR HANDS ARE UNBOUND IN HELGEN[/b] (Not applicable to mods that bypass that scene e.g. Alternate Start by Arthmoor (Unless of course you&#39;re choosing crossing the border illegally))\r<br />\r<br />So I get comments and messages up the freaking wazoo about compatibility, this IS compatible with any start altering mods, the above statement is [i]specifically[/i] referring to the vanilla start, the Helgen scene, for whatever reason, goes bananas with my scripts, if you&#39;re using alternative start and you&#39;re not doing the vanilla option then go nuts.[/size]\r<br />\r<br />\r<br />[u][size=5]PERHAPS YOU NEED A DEMONSTRATION[/size][/u]\r<br />\r<br />[youtube]0PxatNGzANo[/youtube]\r<br />\r<br />[size=5][u]I WANNA BE BATMAN[/u][/size]\r<br />\r<br />[s]You&#39;re in LUCK&#33; As of 0.2 you don&#39;t need to ask ME to break copyright laws, because now you can add your own custom wavs to your very own &#34;Custom Voice&#34; choice, head over to the articles section to find out how. (Note, a couple of events handled by the dialogue system, heavy breathing, attack and power attacks and getting hit sometimes work sometimes they don&#39;t, this custom choice works v.differently to the others I&#39;ve implemented, I&#39;ll find a fix later on.)[/s]\r<br />[size=20]NOOOOOOOOOOOO&#33;[/size]\r<br />\r<br />\r<br />[size=5][u]Description time:[/u][/size]\r<br />\r<br />This makes your character say stuff when certain events are triggered, mostly combat related, quickly amended this in since I reread this, and not once did I summarize the functionality.\r<br />\r<br />Continuing my theme of over-reliance on SkyUI to handle my configuration menus, you will *require* that gem for this [i]potential[/i] gem, probably, maybe, possibly not, the gem part, you definitely need SkyUI, whether you download this or not, unless you&#39;re some kind of masochist.\r<br />\r<br />\r<br />[size=3]ANYWAY[/size]\r<br />\r<br />Once you&#39;re all installed (complicated steps below) and in-game, mosey on down to your brand spanking new &#34;Player Voicesets&#34; menu and treat yourself to some voice. (English words, not fiery Dragon mumbles)\r<br />\r<br />Like a light switch, you simply toggle it on to enable your new voice, next you might like to proceed over to the drop down box, here you may select one of the currently available voices. (More coming, eventually, I get bored easily sifting through the voice dumps.)\r<br />\r<br />\r<br />[size=3][b]The current list of voices and examples of their existing users are as follows:[/b][/size]\r<br />\r<br />\r<br />[b]- Female Commander[/b] - Legate Rikke, Aela the Boobtress, Uthgerd the [i]Old[/i]\r<br />\r<br />\r<br />[b]- Female Young Eager[/b] (IF YOU KNOW WHAT I MEAN (I MEAN SEX)) - Ysolda (Best first Waifu ever), Elisif the DONTREMEMBER, Muiri (think about it, you&#39;ll remember)\r<br />\r<br />\r<br />[b]- Female Commoner[/b] - Err...like every boring lady in the game? Most Redguard ladies (&#34;Commoner&#34;, racist much?) This one doesn&#39;t have combat grunts yet, so unless you want to be the silentist weapon swinger ever, dw about it.\r<br />\r<br />\r<br />[b]- Male Dunmer[/b] - Like the name says, Male Dunmer, I don&#39;t think any Male Dunmer in the vanilla game uses any other voices, until you go to Solthseim and hear that beast Neloth (Dwight Schultz FTW) and the others (Not Dwight Schultz, IDGAF)\r<br />\r<br />\r<br />[b]- Male Even Toned[/b] - Amren/Most Redguards, Marcurio the Stud Muffin\r<br />\r<br />\r<br />[b]- Male Khajiit[/b] - ALL THE CAT BROS, LIKE MY BOY KHARJO, HE&#39;S RAD, WE&#39;RE BESTIES\r<br />\r<br />\r<br />[b]- Serana[/b] - It&#39;s Serana, duh.\r<br />\r<br />\r<br />[b]- Male Sly Cynical[/b] - I&#39;D EVEN SELL MY SISTER IF YOU WERE WILLING TO BUY\r<br />\r<br />\r<br />[b]- Female Sultry[/b] - All of the sexy Skyrim wimmenz, like Vivienne Otis MREOW&#33;\r<br />\r<br />[b]- Male Orc[/b] - Grr Arg I&#39;m an Orc&#33;\r<br />\r<br />[b]- Wulfy[/b] - Dope voice provided by Nexus user and psychotic voice connoisseur Wulfy.\r<br />\r<br />\r<br />[size=3][u]Installations are like, complicated:[/u][/size]\r<br />\r<br />\r<br />Except not really, use NMM, for serious.\r<br />\r<br />\r<br />[size=3][u]I HATE THIS, MAKE IT GO AWAY:[/u][/size]\r<br />\r<br />\r<br />Then just like, deactivate it, no biggy, be smart though and turn it off in the MCM first, JUST IN CASE.\r<br />\r<br />\r<br />[size=3][u]The future is bright:[/u][/size]\r<br />\r<br />\r<br />[s]This is still quite heavy WIP, I don&#39;t have [i]every[/i] event for playing voice in place that I&#39;d like, and I&#39;m always thinking up new times your character should say stupid junk, any requests/suggestions should be placed in the comments where I can tell you how much I like them/think they&#39;re stupid.\r<br />\r<br />Eventually I plan to have the following in place in no particular order:\r<br />\r<br />-  All vanilla voice types represented, probably with a couple of unique voices being the exception unless they HAPPEN to have relevant dialogue for enough events that it&#39;s worthwhile., most don&#39;t.\r<br />\r<br />- I *might* implement some toggles and sliders for speech likelihood/frequency/specific line/event toggles, though I may simplify all of this right down into a drop down for preset frequency settings, I lean more heavily towards trying to establish a personality for your character without assuming their motivations, and a big part of personality involves you not necessarily knowing everything they&#39;re going to say all the time.[/s]\r<br />\r<br />- I LIKE STRIKE-THROUGH IT ILLUSTRATES MY CHANGES OF MIND ACCURATELY.\r<br />\r<br />[s]- A custom option in the drop down menu with preset silent wavs to replace, this one might be on the docket sooner rather than later.[/s] - Nah\r<br />\r<br />- A smaller description because this is long-winded as HELL.\r<br />\r<br />\r<br />[size=3][u]COMPATIBLITITITITIES[/u][/size]\r<br />\r<br />\r<br />Chances are this is incompatible with anything that does anything similar, dunno, haven&#39;t checked since I don&#39;t use/like any of the similar plugins out there to this, let me know I guess.\r<br />Anything else should be fine.\r<br />\r<br />\r<br />[size=4][u]FINALLY THE END[/u][/size]\r<br />\r<br />\r<br />Thanks for reading all this jibberish, this is something I&#39;ve been putting together on and off for quite a long time now.\r<br />I don&#39;t usually ask for this crap but I [i]want[/i] to take this one pretty far and it&#39;s hard to find motivation to sit through so much voicework.\r<br />\r<br />\r<br />[size=4]I FEEL LIKE I FORGOT SOMETHING...PFFT &#39;TEVS[/size]",
  "categoryId": "61",
  "version": "0.5.1",
  "author": "ChizFoShiz",
  "createdUnix": "1393062433",
  "updatedUnix": "1410638882",
  "containsAdultContent": false,
  "uploadedBy": "ChizFoShiz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101249",
      "name": "Player Voicesets - Last Version with Custom Voice",
      "version": "0.3.8HF",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4503",
      "fileName": "Player Voicesets - Main File-51387-0-3-8HF.7z",
      "uploadedUnix": "1394851049",
      "modVersion": "0.3.8HF",
      "virusScanUrl": "https://www.virustotal.com/file/3bf4700e5eb189442e5661f86f552c3319ef65c91c581be1773142b712327763/analysis/1407982812/",
      "changelogHtml": " ACTUALLY Fixed Papyrus errors, legit. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Player%20Voicesets%20-%20Main%20File-51387-0-3-8HF.7z?fid=1000101249&ttl=1535833685&ri=8192&rs=8192&setec=a7f62fe864aa8f4533f40858e258a443"
    },
    {
      "fileId": "1000126737",
      "name": "Player Voicesets - Main File - Fixed",
      "version": "0.5.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6389",
      "fileName": "Player Voicesets - Main File - Fixed-51387-0-5-1.7z",
      "uploadedUnix": "1410638882",
      "modVersion": "0.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/f3fcb71fa62e05e8bab2d7d6d1410e1f9bbdca652d00530c3cfb05e4802dfee0/analysis/1410639010/",
      "changelogHtml": " #NoBeta <br/> \n Fixed sneaky Orcs from yelling while you&#39;re trying to be Laura Bailey. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Player%20Voicesets%20-%20Main%20File%20-%20Fixed-51387-0-5-1.7z?fid=1000126737&ttl=1535833685&ri=8192&rs=8192&setec=c9e168cf5ccc2ded6cd9171875afc505"
    }
  ]
}