{
  "modId": 51402.0,
  "modName": "Faalguthar A DLC Sized land",
  "summary": "Adds a new portal to Riverwood behind the log pile infront of the lumbermill. this portal will bring you to a land known as Faalguthar.",
  "descriptionHtml": "About Faalguthar:\r<br />\r<br />A portal leading to this island from River wood, a massive player home, a alchemy island, a lumber-mill, a entrance gate, a docking area, 5 new original and uniquely designed houses, a waterfall, camp-sites, a trader, a jail house, stables, cart parking, taverns, forests, wildlife, a construction site, a archery practice range, guard patrols, 20+ new NPC&#39;s added to the game each with their own behaviour yet none of them are scripted yet, a stream that runs through the island, 6+ merchants and a couple caravans pass through. Please pay close attention to detail&#33; Incredible amounts of time was spent on very small parts of this mod. \r<br />\r<br />Lore: \r<br />\r<br />Faalguthar is a made up land by me (this3is0sparta0), it is a major stopping place for caravans and ships. It is also a big place for bartering. It is located right off the coast of morrowind and was ruled over Uriel Septim unitl he was murdered by Jagar Thorne, after that Jagar Thorne took over this isand and made it a place with out rules, yet living without rules was perfect for these people because it gave them more freedom from the rest of Tamriel and they made it their goal to make it a safe house and calming/peaceful place to live in. \r<br />\r<br />Credits/future plans:\r<br />\r<br />3+ weeks of work went into this and its still not completly finished. I still have to do questing and scripting. I am planing on adding on 3x more land than is shown/active right now. This was all made from scratch by this3is0sparta0. \r<br />Lots of work was lost by Creation kit crashing at random points because of how big the file was. This mod would be a lot bigger if it were not for those crashes. But moving on and getting past that, this land originated in my mind, i just logged on to steam and opened creation kit and started building what ever i saw in my mind. i think this is what i wanted the outcome to be like. I hope you all appreciate the mod as much as i do and i hope you enjoy playing through it. \r<br />\r<br />EXTRA KNOLEDGE THAT MAY BE HELPFUL BUT MAY NOT BE AT CERTAIN TIMES BUT WHAT EVER: \r<br />\r<br />If you want a good experience playing through this mod i suggest downloading Razor game booster to give it a little &#34;boost&#34; and bring down the wait time a bit. \r<br />This mod does not interfere with any other mod, UNLESS it changes the default landscape of Riverwood. Other than that there should be no problem with it. \r<br />There is a hidden chest full of goodies somewhere in Faalguthar. No hints, its up to you to find it. \r<br />All feedback is appreciated, leave it in the comments below, if you wish to contact me directly i can be reached at This3is0sparta0@outlook.com. Thanks for your time and download&#33;",
  "categoryId": "30",
  "version": "1.0",
  "author": "This3is0sparta0",
  "createdUnix": "1393089633",
  "updatedUnix": "1393089633",
  "containsAdultContent": false,
  "uploadedBy": "this3is0sparta0",
  "primaryFile": null,
  "files": []
}