{
  "modId": 51470.0,
  "modName": "Men of Action",
  "summary": "Adds five action heroes from television and film to the game. ",
  "descriptionHtml": "Looking at the followers section here at the nexus, around 90% percent of the mods are beautiful women. While I can appreciate this, there comes a time when I get tired of it. I want someone who looks like they could be trusted to watch my back. So one night, as I was watching some of my favorite shows, I got inspired to make a mod to fix this problem. \r<br />\r<br />Men of Action \r<br />\r<br />This mod adds some of the best followers from both the big and the small screen to the game, as close to their likeness as I could get. \r<br />\r<br />New in V1.1\r<br />\r<br />Chuck Norris\r<br />A name that needs no description. The legendary martial artist/ movie star/ internet sensation is here. He has run around the world and punched himself in the back. He can kill two stones with one bird. Chuck in his full glory would shatter the frail world of Tamriel, so he has weakened himself so you actually get a taste of the combat. \r<br />Gracing the unworthy halls of Jorrvaskr.\r<br />&#34;The fear of spiders is called arachnophobia. The fear of tight spaces is called claustrophobia. The fear of Chuck Norris is called logic.&#34;\r<br />\r<br />Based on a guide by LabCloning on youtube\r<br />\r<br />Christian Kane as Elliot Spencer\r<br />The Hitter from Leverage is here to do business. \r<br />He can currently be found casing the Jarl&#39;s Longhouse in Falkreath. \r<br />&#34;You hold a knife like this, it cuts through an onion. Hold a knife like this, and it cuts through, like, eight yakuza in four seconds.&#34;\r<br />\r<br />Andre &#34;the Giant&#34; Roussimoff\r<br />In all his 7&#39;4&#34;, 520 lb. glory, the man of fame from the classic &#34;The Princess Bride&#34; and a several year long undefeated wrestling streak is ready to lend his bulk to you. \r<br />He has gotten involved with some shady characters in Embershard Mine (in between Helgen and Riverwood)\r<br />&#34;It&#39;s not my fault I&#39;m the biggest and the strongest. I don&#39;t even exercise.&#34;\r<br />\r<br />Jason Momoa as Ronan Dex\r<br />Before he became the face of Khal Drogo, Jason played the tough, loyal Ronan in Stargate: Atlantis. After years of being hunted, he has found safety in a city of an ancient race that has been repopulated by men. \r<br />He is in one of the towers in front of the Dwarven ruins in Understone Keep, keeping watch should anything emerge.\r<br />&#34;I was just going to blow it up.&#34;\r<br />\r<br />Bruce Campbell as Sam Axe as Chuck Finley\r<br />Burn Notice&#39;s alcoholic &#34;old friend who used to inform on you&#34; is ready for any mission you can throw at him, as long as you are buying afterwards.\r<br />He can be found at his favorite bar near his latest &#34;Lady Friend&#34;&#39;s place. Just look for a rich, older, single (?) woman. \r<br />&#34;It wasn&#39;t a gift or stolen, something happened, and the guy who had it didn&#39;t need it anymore.&#34;\r<br />\r<br />Liam Neeson as Bryan Mills\r<br />Liam Neeson. Need I say more? Fine. If you ever need someone to train you, be a wise father figure, or someone who is just plain awesome, he is your man. Bothering his daughter never ends well. Based on his appearance in Taken.\r<br />Currently hiding from some wolves in the Jarl of Winterhold&#39;s place. \r<br />You know the quote.\r<br />\r<br />All are essential and can be married. In addition, everyone has the lightfoot perk so they will not set off traps and other perks to benefit their fighting style.\r<br />\r<br />Elliot uses knives and swords.\r<br /> Andre fights unarmed, buts has the fists of steel perk\r<br />Ronan uses 2h weapons\r<br />Chuck uses a sword and shield\r<br />Bryan knows several spells and can use the (unrelenting) force.\r<br />\r<br />Requirements\r<br />Dragonborn DLC (I may remove this in the future as it is not absolutely necessary)\r<br />[url=http://www.nexusmods.com/skyrim/mods/28936/?]Vanilla Hair Variety Plus [/url] by Omega99jp \r<br />\r<br />A note on Lore Friendliness:\r<br />While the names are a bit out of place, I have tried to make the characters feel at home in Skyrim. If you have an idea on how to improve this (a better name or location) please put it in the comments and if I like it I will be happy to implement it, with credit. \r<br />\r<br />Any suggestions? Who would you like to see added to Men of Action? Comment&#33; \r<br />\r<br />Disclaimer: All characters and their likenesses are the properties of their respective owners.",
  "categoryId": "96",
  "version": "1.1",
  "author": "CrossGuard",
  "createdUnix": "1393206381",
  "updatedUnix": "1394495263",
  "containsAdultContent": false,
  "uploadedBy": "CrossGuard",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098490",
      "name": "MenofAction V1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "MenofAction V1-51470-1.zip",
      "uploadedUnix": "1393206345",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d6ee55707deffd5e341957fb66f3563a319cd2d7f471c982a9482f09ffb2f34c/analysis/1407947614/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MenofAction%20V1-51470-1.zip?fid=1000098490&ttl=1535833831&ri=8192&rs=8192&setec=1580ab0512bda65cbbbdfa14ca1619b1"
    },
    {
      "fileId": "1000099210",
      "name": "MenofActionV1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "MenofActionV1_1-51470-1-1.zip",
      "uploadedUnix": "1393642673",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9a9cb45f038ef59c4a5243d19e0cb2f7da96178dec70ed028b77df3eed1785eb/analysis/1407954548/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MenofActionV1_1-51470-1-1.zip?fid=1000099210&ttl=1535833832&ri=8192&rs=8192&setec=954ff9fa9dd1c397652833aa248659f6"
    },
    {
      "fileId": "1000100743",
      "name": "Chuck B-Day Update",
      "version": "CHUCK",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "ChuckB-DayUpdate-51470-.zip",
      "uploadedUnix": "1394495263",
      "modVersion": "CHUCK",
      "virusScanUrl": "https://www.virustotal.com/file/b2c31094914a788485fc0dbd4c563d4fcadfe4756ffd29821051c637dab7ccb0/analysis/1407987663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ChuckB-DayUpdate-51470-.zip?fid=1000100743&ttl=1535833832&ri=8192&rs=8192&setec=fdcf538512404f3c14413d25031aa516"
    }
  ]
}