{
  "modId": 51478.0,
  "modName": "The Executioners Axe",
  "summary": "This axe will turn all before you into ash. ",
  "descriptionHtml": "This is my first of hopefully many weapon edition to Skyrim. Something I have been wanting to do for a long time but lacked Skyrim for PC up until a few months ago. After playing around a lot with the CK, I figured out how to make the enchantment that this weapon provides. There is still some things I would like to work out, but I shall list that below as to my plans for this little mod. \r<br />\r<br />What is included? \r<br />For starters, the Executioner&#39;s Axe is added to the game, along with the enchantment &#34;Turn them to ash.&#34; \r<br />\r<br />What does the enchantment do?\r<br />Turn them to ash does just that, when you kill an enemy they shall be turned to ash. This uses the same bounds as the disintegrate perk and so it shall not actually turn certain enemies to ash. Or at the least, it shouldn&#39;t. If you find that you are able to turn dragons to ash and such, then that technically shouldn&#39;t happen, but this is a rather strange enchantment none the less. \r<br />\r<br />How to obtain:\r<br />Is now found in the Thalmor Embassy in their dungeon above the prisoner cells. A book is located near it that will also teach you two handed. The Thalmor wouldn&#39;t want anyone to have this weapon, so they brought it there until they could destroy it. \r<br />\r<br />Goals for the mod:\r<br />I want to add a new game model for it. But with my lack of modeling experience, I can&#39;t actually make it myself. \r<br />\r<br />Final Notes: \r<br />If you find any bugs or have any questions, please feel free to ask&#33; I&#39;ll see what I can do but I&#39;m really just making this stuff up as I go along. Also, this weapon is mainly meant to be a counter to Necromancers. Since a necromancer can&#39;t raise a pile of ash, ya know? And sorry for lack of pictures, will post some when I have gotten more finished with the mod. \r<br />\r<br />Edit: As I forgot to change it when I released version 2.0, it no longer soul traps your target. While trouble shooting, sometimes a failed soul trap would also make the ash pile script fail too. So it was removed. ",
  "categoryId": "55",
  "version": "2.0",
  "author": "SeiichiSin",
  "createdUnix": "1393247598",
  "updatedUnix": "1393260429",
  "containsAdultContent": false,
  "uploadedBy": "IshaAito",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098535",
      "name": "Executioners Axe",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Executioners Axe-51478-1-0.zip",
      "uploadedUnix": "1393247463",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/72e3d8626613dbb8f6b05624db9866fccf0e3f1ba4420eda56b9d07c744a3de8/analysis/1407948133/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Executioners%20Axe-51478-1-0.zip?fid=1000098535&ttl=1535833842&ri=8192&rs=8192&setec=0c6140fe6f056bd66ee5757e57aaf4eb"
    },
    {
      "fileId": "1000098563",
      "name": "Executioners Axe",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Executioners Axe-51478-2-0.zip",
      "uploadedUnix": "1393260429",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/7821e3c05c9b7644b21f65d0ac81f5123ecca4c5223844f34894eebc473959dd/analysis/1407948428/",
      "changelogHtml": " Added The Executioner&#39;s Axe book. <br/> \n Bound enchantment to make it unable to turn dragons or daedra into ash. <br/> \n Removed Soul Trap for the time being from the enchantment. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Executioners%20Axe-51478-2-0.zip?fid=1000098563&ttl=1535833842&ri=8192&rs=8192&setec=a7a72e87f6f679d25d8179f342a30be0"
    }
  ]
}