{
  "modId": 51477.0,
  "modName": "Acrobatic Infiltrator",
  "summary": "Adds a few windows to Solitude, Whiterun, Windhelm, Riften, and Markarth, so you can have additional, often times more stealthy ways to leave cities, and more effective ways of escaping quickly, some a bit higher than others which can&#39;t be reached with just vanilla jumping abilities. Also adds a tiny home outside of Solitude.",
  "descriptionHtml": "Remember the good old days during Morrowind when you could enter cities via acrobatic prowess, basically doing parkour inside of Morrowind to get around faster, use shortcuts, and get in and out of cities faster?\r<br />\r<br />Remember how in Oblivion and Skyrim the ability to jump high felt more useless, and in spite of being an amazing Mario like acrobat, you still had to use the front door to enter the cities?... Remember how even if sewer entrances exist, you still couldn&#39;t use your epic jumping abilities to take shortcuts in and out?\r<br />\r<br />It&#39;s almost like Mario being able to jump real high, but somehow never jumping to avoid enemies- it makes no sense that skilled jumpers would always use the front door to enter cities, unless they had a total disregard for stealth, or escapes.\r<br />\r<br />Well this remedies that... Partially. By adding new windows you can enter, which are generally vertically pretty high up, to exit or enter these closed off cities. Which not only adds immersion, but is also probably helpful to stealth reliant characters, or characters who live on the other side of the law, where taking the main doors... Can... Not be the best idea.\r<br />\r<br />A few of the doors you can reach with vanilla Skyrim jumping, but some of them you will need a jump enhancing mod separate from my own to reach the windows. Some recommended mods are Vampire Superhuman Jumping Ability, or Nature Of The Beast, so that you can reach these windows.\r<br />\r<br />Another suggested mod to combine with this is Sneak Tools with it&#39;s rope arrows.\r<br />\r<br />Also adds a tiny player home outside of Solitude on a platform, complete with a cooking pot, and a few non-respawning containers, with a pleasant view from above, and a body of water which you can safely dive into without dying. \r<br />\r<br />Unsure rather to tag this Immersion or Stealth, as I see it as both, so I tagged the primary Immersion, and the secondary tag Stealth.\r<br />\r<br />Also lastly, if you want to add more additional shortcuts using my mod, you can ask for modding permissions, and I&#39;ll probably give you said permission, the activator in question the windows are called &#34;1ALectraSecretCityEntriesLever&#34; in the Creation Kit, and the script assigned to them is called ALectraCityShortCuts1.\r<br />\r<br />There may be some places in the expansions that contain similar cities that could use a similar simple extra entrance overhaul, but I don&#39;t want to spoil those expansions for me by visiting those places yet, so if you want extra windows in those places, I suggest asking for mod permission to release an updated version containing that.",
  "categoryId": "78",
  "version": "",
  "author": "Lectra",
  "createdUnix": "1393245181",
  "updatedUnix": "1393245171",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098534",
      "name": "Acrobatic Infiltrator",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Acrobatic Infiltrator-51477-.zip",
      "uploadedUnix": "1393245171",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7b700446d4cd172a74efdb1cd10bd4f094bca918796310b36c0efd56c985fefc/analysis/1407948122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Acrobatic%20Infiltrator-51477-.zip?fid=1000098534&ttl=1535833840&ri=8192&rs=8192&setec=00b79b4b8ee8bc71ae4a5afe6b9e2828"
    }
  ]
}