{
  "modId": 51490.0,
  "modName": "Badass Argonian preset - red and brown",
  "summary": "A new preset for the Argonian race which looks better than the standard presets that comes with the game. He has a brown body and red head. He&#39;s shown wearing custom armor so you can see his body colours.",
  "descriptionHtml": "I made a new preset based on one of my characters which allows you to play as the character shown in the screenshots without having to resort to using someone else&#39;s save game or similar.\r<br />\r<br />To install simply copy the smeplayable.esp to your skyrim data folder and enable it then you have two options. \r<br />\r<br />For a new game:-\r<br />Step one) start a new game and when you get to the character generation screen select Argonian, Male and move the face / body preset slider to the right once then back to the left and this will display the new custom preset. Make any more changes depending on your preference, name your character and exit. Save your game.\r<br />\r<br />Step two) quit skyrim and DELETE the smeplayable.esp file. If the preset reverts to the standard one after deleting just restore the file. It should work with the file deleted as the chargen data is saved in your save game file but I&#39;m unable to verify. It works OK on my machine if deleted.\r<br />\r<br />Step three) launch skyrim and load your save game. Ignore any error about missing content and then save your game again. Continue as normal.\r<br />\r<br />For existing games:-\r<br />The other option is if you have already progressed into the game and don&#39;t want to start anew. For this first of all you want to make a permanent save game so you can return to your original character later if need be. Make a backup of this save game but if you are used to skyrim modding you should be already aware of always making backups before installing mods.\r<br />\r<br />The next step is to open the console and type showracemenu then quit the console. Repeat steps one to three above in the section for new game. Please note however if you are currently playing as a race other than Argonian it will mess up your stats. So this mod may not be for you if you are not currently an Argonian or don&#39;t mind your stats being messed up.\r<br />\r<br />Finally, the character does not come with the armor shown in the images. This is shown for demo purposes however you can download it yourself - it&#39;s called Argonian Mercenary Armor.\r<br />\r<br />Enjoy&#33;\r<br />\r<br />PS if you want this guy as a follower please see my other files.\r<br />\r<br />",
  "categoryId": "26",
  "version": "V1.00",
  "author": "adrian-smith31",
  "createdUnix": "1393276209",
  "updatedUnix": "1393276201",
  "containsAdultContent": false,
  "uploadedBy": "adriansmith31",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098609",
      "name": "smeplayable",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "smeplayable-51490-1-00.zip",
      "uploadedUnix": "1393276201",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/139c3c4da990922517f5638dbfcbb269f628daf41fab84420331f4683cc82143/analysis/1407948804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/smeplayable-51490-1-00.zip?fid=1000098609&ttl=1535833860&ri=8192&rs=8192&setec=99c72758b7c2e105eaba513af03a1ef1"
    }
  ]
}