{
  "modId": 51502.0,
  "modName": "Torch of the Lightbringer",
  "summary": "&#34;Torch of the Lightbringer&#34; is a fun little mod I decided to make when I learned that you could light enemies on fire if you shield bash with a torch. I thought that was cool, so I expanded on the idea and made it a viable playstyle with a special torch.\r<br />\r<br />The mod was also inspired by one of my favorite &#34;A Song of Ice a",
  "descriptionHtml": "REQUIRES SKSE\r<br />ITEM LOCATED IN SKYBOUND PASS\r<br />\r<br />Today I bring you another one of my quirky combat-changing mods. This time, I decided to expand on the idea of &#34;torch bashing&#34; to make a 1h + torch playstyle very fun and viable, when you have this torch. The idea was inspired by one of my favorite characters from &#34;A Song of Ice and Fire,&#34; Stannis Baratheon. \r<br />\r<br />The playstyle this torch gives is one much like a &#34;spellsword.&#34; Playing this way will focus on Block, 1Handed, Restoration, Conjuration, and Destruction. Without further adieu.. here is what happens when you equip the Lightbringer&#39;s Torch.\r<br />\r<br />1.) Blocking attacks with the torch will cause the torch to spray flames in front of you, damaging enemies. This will use your mana, and level your destruction skill.\r<br />\r<br />2.) Blocking power attacks with the torch may summon a Flaming Stag to aid you in battle. This will not use your mana, but will level your conjuration skill.\r<br />\r<br />3.) &#34;Shield bashing&#34; with the torch will heal you, if your health is below a certain threshold. This will use your mana, and level your restoration skill.\r<br />\r<br />4.) Doing a &#34;power shield bash&#34; with the torch has a chance to knock your opponent down.\r<br />\r<br />5.) Any &#34;shield bash&#34; with the torch has a chance to trigger &#34;Duty of the Lightbringer&#34; which will cause all of your attacks to set your enemies ablaze; increase your movement speed by 150%, and increase your attack speed. Lasts 8 second.\r<br />\r<br />The Lightbringer&#39;s Torch can be found in Skybound Pass, inside Stannis&#39;s Tomb.\r<br />",
  "categoryId": "55",
  "version": "1.0",
  "author": "jonathan0068",
  "createdUnix": "1393298453",
  "updatedUnix": "1393298448",
  "containsAdultContent": false,
  "uploadedBy": "jonathan0068",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098645",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Main File-51502-1-0.zip",
      "uploadedUnix": "1393298448",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c54e80c08f0eb3b9b48ea29698ae6dd555b3a264e685fff474cae1096a94d69a/analysis/1407948970/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-51502-1-0.zip?fid=1000098645&ttl=1535833881&ri=8192&rs=8192&setec=8b44019357e58209393fcb4816040fb8"
    }
  ]
}