{
  "modId": 51519.0,
  "modName": "NAZEEM RELOADED - Follower - commentary - EFF UFO AFT",
  "summary": "Experience Nazeem as you never have before in your wildest dreams (or daedra-haunted nightmares): a snarky, conceited swordsman follower.",
  "descriptionHtml": "[b][i]05-07-2014: The B-Team follower compilation mod launches May 9th&#33; B-team includes and will supersede my Anska, Heimskr, and Nazeem mods. An upgrade is not required but Anska, Heimskr, and Nazeem will be considered &#34;finalized&#34; as they are, and any further upgrades, changes and fixes to the NPCs will come through the B-team mod.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/53831/?]70s Nazeem Reloaded[/url] by [url=http://www.nexusmods.com/skyrim/users/3967544]mkenny95[/url], a Nazeem remix using Nazeem Reloaded as a base, has been released with my blessing.[/i][/b]\r<br />[line]\r<br />More than Ulfric, more than Heimskr, even more than that bastard Snow Troll who jumps you on the way to High Hrothgar: Nazeem is the most hated NPC in all of Skyrim. There are no less than at least fifteen mods on the Steam Workshop and twelve on the Nexus (with some overlap) dedicated all or in part to shutting up Nazeem, or finding [url=http://steamcommunity.com/sharedfiles/filedetails/?id=1665257]increasingly elaborate ways[/url] to torture and/or kill him.\r<br />\r<br />Once again, this is not one of those mods. EXPERIENCE Nazeem as you never have before in your wildest dreams (or daedra-haunted nightmares): NAZEEM RELOADED.\r<br />\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/features.png[/img]\r<br />[list]\r<br />[*]Don&#39;t want to recruit Nazeem? You can still brawl him&#33;[/*]\r<br />[*]About 50-something lines of new old dialogue&#33;[/*]\r<br />[*]Comments as you travel&#33; Comments with a small degree of geographical and situational awareness&#33;[/*]\r<br />[*]Lots of the attitude you already know and despise&#33;[/*]\r<br />[*]Group-ready stats&#33;[/*]\r<br />[/list][line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/faq.png[/img]\r<br />[list]\r<br />[*]Q) This time you&#39;ve gone too far&#33; Why would you do such a thing??[/*]\r<br />[*]A) Don&#39;t blame me, blame [url=http://www.nexusmods.com/skyrim/users/4765396/?]SkepticalJoker[/url] here. It was his idea, and though I brushed it off at first, the more I thought about it the more amazing it sounded, and the more I researched putting it together, the more feasible it appeared.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) How do I get Nazeem to join me?[/*]\r<br />[*]A) First, you need to advance past the first dragon encounter (it will make sense when you get there). Then, you need to talk to Nazeem and challenge him to a standard brawl. If you are victorious, he will pay you and become an eligible follower.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) What makes this better than just using a mod like [url=http://www.nexusmods.com/skyrim/mods/41629/?]Everyone is an Adventurer[/url] to turn the vanilla NPC into a follower?[/*]\r<br />[*]A) EIAA is a fine mod, to be sure, but that mod and like functionality in other mods just kicks Nazeem into the requisite factions for following and gives him the right relationshiprank. My mod goes a step further by preserving the essence of his snarky personality as a follower, and adds a couple nifty bonuses on top of that.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Do you take requests?[/*]\r<br />[*]A) Maybe&#33; That was how I got started on Nazeem. My vanilla follower picks are selected for a variety of reasons, mainly boiling down to how technically complex it would be to pluck them out of the game as a follower, and whether or not it makes sense for them to decide to go gallivanting about Skyrim with the Dragonborn. If you know an NPC you think would be a good candidate, drop me a line or post it as a comment&#33;[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Nazeem already spawned, and has vanilla stats&#33; He is not doing too good[/*]\r<br />[*]A) Skyrim is really weird about this sort of thing; sometimes waiting 2 days elsewhere will spawn the mod&#39;s version. If all else fails, try selecting Nazeem in console and using &#39;recycleactor&#39; and &#39;disable&#39; and then &#39;enable&#39; on him. And if THAT doesn&#39;t work, use setlevel 1000 0 1 65535. He will probably retain his vanilla class but he will at least level with you.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) What is that armor Nazeem is wearing in the picture?[/*]\r<br />[*]A) He&#39;s dressed in the Dark Alchemist armor from the [url=http://www.nexusmods.com/skyrim/mods/27028/]Armonizer armor pack[/url], and is armed with a Dragonsting dagger from [url=http://www.nexusmods.com/skyrim/mods/1002/?]JaySus Swords[/url]; they are not included with the mod but have my endorsement for your build (though make sure to pick up the [url=http://www.nexusmods.com/skyrim/mods/26230/?]update patch for JaySuS by Sharlikran[/url] first).[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Nazeem doesn&#39;t follow me after he joins?? What is the deal with that[/*]\r<br />[*]A) If you&#39;re still in Whiterun, Nazeem, like [url=http://www.nexusmods.com/skyrim/mods/51162/?]Heimskr[/url], will occasionally get stuck doing one of his scenes, usually talking to the merchants in the marketplace or Ysolda. Thankfully, unlike Heimskr, the scenes are very short, so you should be able to wait a few moments for them to complete, at which point he should follow as normal. If he still isn&#39;t following, it&#39;s possibly a conflict with a follower mod, in which case you should post which one you use.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I am having a problem and use [x] follower mod&#33;[/*]\r<br />[*]A) I&#39;ll see what I can do but I can&#39;t make any promises. I used the well-regarded [url=http://deck16.net/post/22645519500/making-a-unique-voiced-follower-in-skyrim-part-1]Deck16[/url] tutorial to help guide me in the process of making Nazeem, as almost all of his follower dialogue had to be remade from existing voice acting files; he is, by all rights, a custom-voiced follower who simply uses repurposed vanilla resources. However, the Deck16 tutorial does not go into insuring compatibility with the follower mods, and my ability to specifically key Nazeem to any mod but EFF is limited; it would require me injecting the scripts into my Data folder, which could result in problems if there is a conflict with my existing scripts. Generally he should work fine with UFO and AFT, but I cannot guarantee that. If you use either of these as your primary follower mod and would like to help, please contact me.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I am having a problem with Nazeem&#39;s brawl&#33;[/*]\r<br />[*]A) First you need to make sure you&#39;re not just having brawl problems - the brawl system in Skyrim is notoriously easy for mods to unintentionally break. Brawl another NPC to make sure - if their brawl also breaks or malfunctions the same way, then the problem is unfortunately on your end. If vanilla brawls still work, then be as detailed as possible in describing your problem. Is the brawl option not showing up? Normally it doesn&#39;t show until after you find out you are dragonborn (there is a reason for this which will become clear). Is it showing up but is the brawl not starting? Make absolutely sure you installed all the scripts, in the correct place. Is the brawl starting but going awry somehow? Make sure to include any overhauls which you know or suspect could change the brawl system in your report, and how the brawl is going awry. I managed several successful tests both in a virtually clean install environment, as well as my main build with over two-hundred-twenty active .ESPs, so I am fairly confident overall in its stability.[/*]\r<br />[/list]\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/classskills.png[/img]\r<br />[list]\r<br />[*]Primary Skills: One-Handed, Sneak[/*]\r<br />[*]Secondary Skills: Light Armor, Marksman[/*]\r<br />[*]Tertiary Skill: Alteration[/*]\r<br />[/list]\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/compatibility.png[/img]\r<br />As essentially a custom-voiced follower, this mod changes very few vanilla resources. Nazeem&#39;s NPC record and the VoicesFollowersAll form list are the two major ones. Three dialog topics, where the caption already matched what Nazeem himself would say, were also edited to allow for his voicetype to respond using them, as well. Aside from that, everything else is original to Nazeem Reloaded.\r<br />\r<br />As a final note, also make sure that NAZEEM RELOADED.esp is loading *after* the plugins for EFF/UFO/AFT; it&#39;s possible he will still work but I can only guarantee he will work if his plugin is loading after those.\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/credits.png[/img]\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/users/974272/?]greantea101&#39;s[/url] [url=http://www.nexusmods.com/skyrim/mods/19242/?]Unfuzer[/url] application: made editing Heimskr&#39;s battlecries a breeze. Absolutely recommended for helping make custom-voiced NPCs&#33;[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/users/4765396]SkepticalJoke[/url] for inspiring me to do this evil deed[/*]\r<br />[*][url=http://deck16.net/post/22645519500/making-a-unique-voiced-follower-in-skyrim-part-1]Deck16&#39;s Custom-Voiced Follower Tutorial[/url]: this was an invaluable guide during the assembly process.[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/users/2950481]expired6978&#39;s[/url] [url=http://www.nexusmods.com/skyrim/mods/12933/?]Extensible Follower Framework[/url]: Recommended follower mod&#33;[/*]\r<br />[/list]\r<br />\r<br />[url=http://creativecommons.org/licenses/by-nc-sa/4.0/][img]https://i.creativecommons.org/l/by-nc-sa/4.0/88x31.png[/img][/url]\r<br />This work is licensed under a [url=http://creativecommons.org/licenses/by-nc-sa/4.0/]Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License[/url].",
  "categoryId": "96",
  "version": "0.9",
  "author": "terzaerian",
  "createdUnix": "1393370189",
  "updatedUnix": "1394319495",
  "containsAdultContent": false,
  "uploadedBy": "terzaerian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100406",
      "name": "NAZEEM RELOADED FOR EFF",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2082",
      "fileName": "NAZEEM RELOADED FOR EFF-51519-0-9.7z",
      "uploadedUnix": "1394314070",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/cbc594a4b4220f86bdd0f6752dc536e16d9010ceaf6dc6624aec3a85e4f1de24/analysis/1407965652/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NAZEEM%20RELOADED%20FOR%20EFF-51519-0-9.7z?fid=1000100406&ttl=1535833910&ri=8192&rs=8192&setec=836d8b6ded502f7c454f9bdd17764573"
    },
    {
      "fileId": "1000100415",
      "name": "NAZEEM RELOADED",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2081",
      "fileName": "NAZEEM RELOADED-51519-0-9.7z",
      "uploadedUnix": "1394319495",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/8b380620170a5aff94837d95f35b94c71dd181c7fe0cd4a8cae95474955428f2/analysis/1407965724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NAZEEM%20RELOADED-51519-0-9.7z?fid=1000100415&ttl=1535833911&ri=8192&rs=8192&setec=425c137fe915c7c4319499ffda1ce6e1"
    }
  ]
}