{
  "modId": 51513.0,
  "modName": "Vampire Weapon Package",
  "summary": "This is my BETA version. It is mostly complete and shouldn&#39;t have any bugs. Notify me if it does bug out.",
  "descriptionHtml": "This is a weapon package containing powerful weapons. Even though i say it is  A Vampire weapon package, anyone can use it and it DOES NOT require Dawnguard since i just used already existing weapons in the original game. This weapon package include 4 standalone re-textures of some swords in the game with a unique enchantment.\r<br />Mortalbane: a loathsome dagger that deals 20 pts poison damage per second for 5 seconds. also may reanimate a dead body.\r<br />Necrophage: a powerful waraxe that drains 35 pts stamina, turns undead up to level 100, causes an extra 35 pts damage to undead, and has a powerful stagger ability. almost guaranteed to stagger any humanoid for sure.\r<br />Shinso Edge: a mighty blade that absorbs 40 pts health and magicka. in addition will soul trap an enemy.\r<br />Tyrannus: a wicked sword that causes 40+ pts fire and frost damage.\r<br />\r<br />All of these weapons have unique enchantments and are craftable and temperable. Thy are listed as daedric and you will need the daedric smithing perk. All of them require a human heart to forge, and 5 vampire dust. to temper, all of them require a void salt.\r<br />for Tyrannus you must also use an Iron Sword\r<br />for Shinso Edge you must also use a Steel Sword\r<br />for Necrophage you must also use a Silver Greatsword\r<br />for Mortal bane you must also use an Iron Dagger.\r<br />\r<br />Also I would like to add, extreme Special Thanks to Ghosu. This guy is amazing and I would recommend checking out some of his mods",
  "categoryId": "55",
  "version": "",
  "author": "SammyEversong",
  "createdUnix": "1393328038",
  "updatedUnix": "1393328030",
  "containsAdultContent": false,
  "uploadedBy": "SammyEversong",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098689",
      "name": "Vampire Weapon Package",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "789",
      "fileName": "Vampire Weapon Package-51513-.zip",
      "uploadedUnix": "1393328030",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b151bb760a3a730b0d5eb9deb36921152e1649429dbaf73482ea37856e4a8a57/analysis/1407949528/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampire%20Weapon%20Package-51513-.zip?fid=1000098689&ttl=1535833901&ri=8192&rs=8192&setec=df020fccdea833f0630101f8084466c8"
    }
  ]
}