{
  "modId": 51533.0,
  "modName": "The Engineers Workshop",
  "summary": "A build-it-yourself workshop in Apocrypha. Complete a small quest to obtain a Black Book used to travel to and from the workshop. The mod contains four new crafting stations and a maze that you can complete more than once and you get new rewards for each time you complete the maze.",
  "descriptionHtml": "[color=#ff7700][center][size=5][b][u]This mod is no longer being supported and should be taken as it is. I will not be returning to this page to assist users and will ignore any personal messages regarding this mod. The fact that this mod is no longer supported does NOT give anyone the right to re-publish my work with or without credit. The rules regarding asset use still apply however the answer to all requests for permission to use my assets contained within this mod should be assumed to be NO.[/u][/b][/size][/center][/color]\r<br />\r<br />[img]http://i.imgur.com/F0gziKk.png[/img][img]http://i.imgur.com/zBw5Pps.png[/img]\r<br />\r<br />[img]http://i.imgur.com/d20xLnW.png[/img]\r<br />\r<br />This mod is a build-it-yourself workshop in Apocrypha. To gain access to the workshop you need to complete a small quest which takes you through an abandoned Dwemer maze beneath Nchardak to obtain a Black Book. The quest can be very long or relatively short depending on how good you are at mazes. The workshop contains a reward for completing the quest and four new crafting stations (See the &#34;Features&#34; section of this description for more information). The maze is repeatable with new rewards appearing each time with a maximum of five repeats. The quest starts in The Retching Netch in Raven Rock (See &#34;The Quest&#34; section of this description for more information).\r<br />\r<br />[img]http://i.imgur.com/Q56lZo9.png[/img]\r<br />\r<br /> - Small or long quest (depending on how good you are at mazes)\r<br /> - Build-it-yourself workshop in Apocrypha\r<br /> - Four new crafting stations \r<br /> 1 - Disenchanting Font: To remove player made enchantments only. This is for use when you forget to name an item or put the wrong enchantment on an item.\r<br /> 2 - Soul Gem Font: Allows you to convert your useless Soul Gem Fragments into soul gems.\r<br /> 3 - Scroll Transcriber: Used to create scrolls from a known spell. Used for high level mages that didn&#39;t spend too many points in magicka when leveling or for those who simply prefer scrolls over spells. The scroll transcriber also has recipes to create scrolls that were made by Bethesda but not implemented even knowing their main spell does exist in the game e.g. Scroll of Dragonhide was made by Bethesda but never implemented however the Dragonhide spell was.\r<br /> 4 - Tome Transcriber: Allows you to create a spell tome from its corresponding scroll. Used for those annoying spell tomes that refuse to appear in loot chests or at merchant shops.\r<br /> - Black Book used to gain access to the workshop\r<br /> - Repeatable maze with new rewards each time you complete it\r<br /> - All vanilla and DLC crafting stations are in the workshop but with a new look for most of them\r<br /> - All Hearthfire farming features are in the workshop (Hatchery, Planters, Apiary, Grinding Mill)\r<br /> - Dremora merchant for all your resource needs\r<br /> - New crafting resources used to build the workshop (Dark and Decorative Apocrypha Stone, Apocrypha Light Source). These resources can be purchased from the Dremora merchant or found in Apocrypha during other black book quests\r<br />\r<br />[img]http://i.imgur.com/r8jTOUL.png[/img]\r<br />\r<br />The quest starts in The Retching Netch in Raven Rock. A &#34;Partially Translated Dwemer Notebook&#34; will be sitting on a barrel near the bartender (See the images if you need help). Reading the book will start the quest and you simply need to follow the quest hints in your logbook or refer to the notebook for hints as to what you need to do if you get stuck.\r<br />\r<br />[img]http://i.imgur.com/5MWYShC.png[/img]\r<br />\r<br />All Skyrim DLC (Dawnguard, Dragonborn and Hearthfire) are required in order for this mod to work. \r<br />\r<br />[img]http://i.imgur.com/t64w1Mc.png[/img]\r<br />\r<br />NMM: \r<br />- Install the mod as you would any other mod through NMM\r<br />\r<br />NOTE: Installation via NMM should work by default install process however i offer no support for it in case it doesn&#39;t.\r<br />\r<br />Manual:\r<br />1 - Download the archive and extract the contents of the archive to a specific location\r<br />2 - Copy or move the files extracted from the archive to the Skyrim &#34;Data&#34; folder\r<br />3 - Run the Skyrim launcher and ensure that &#34;LrsamwaysTheEngineersWorkshop.esp&#34; is ticked\r<br />\r<br />[img]http://i.imgur.com/sWRNZkd.png[/img]\r<br />\r<br />None\r<br />\r<br />[img]http://i.imgur.com/v4xPYBZ.png[/img]\r<br />\r<br />There may be a conflict if you have a mod active that changes the Dremora Merchant&#39;s dialogue or the level lists for the Apocrypha chests\r<br />\r<br />[img]http://i.imgur.com/s1j2NN2.png[/img]\r<br />\r<br />V1 - Initial release\r<br />\r<br />[img]http://i.imgur.com/MZCAac8.png[/img]\r<br />\r<br />- [b]Q: [/b]Will you remove the maze at any point? It&#39;s too hard.\r<br />- [b]A:[/b] No \r<br />\r<br />[img]http://i.imgur.com/EGfPwd2.png[/img]\r<br />\r<br />Use of this mod or its assets is strictly forbidden\r<br />\r<br />Translations, modifications and re-uploads for this mod are strictly forbidden\r<br />\r<br />[img]http://i.imgur.com/JiA8q2g.png[/img]\r<br />\r<br />Bethesda for Skyrim and the Creation Kit\r<br />Elianora: Testing and the quest reward idea\r<br />VilniusNastavnik: Testing",
  "categoryId": "35",
  "version": "V1",
  "author": "Lrsamways",
  "createdUnix": "1393374699",
  "updatedUnix": "1480664077",
  "containsAdultContent": false,
  "uploadedBy": "Lrsamways",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000098776",
      "name": "The Engineers Workshop",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1271",
      "fileName": "The Engineers Workshop-51533-V1.rar",
      "uploadedUnix": "1393374689",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/934baaf1e7e4e88255630811493a7adacbd4cc16dc5764ec1004d3a4b5b1ba41/analysis/1407950232/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Engineers%20Workshop-51533-V1.rar?fid=1000098776&ttl=1535833932&ri=8192&rs=8192&setec=e9cf658044baf936922d27139516ab73"
    },
    {
      "fileId": "1000229722",
      "name": "The Engineers Workshop",
      "version": "SSE",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1214",
      "fileName": "The Engineers Workshop-51533-SSE.rar",
      "uploadedUnix": "1480664077",
      "modVersion": "SSE",
      "virusScanUrl": "https://www.virustotal.com/file/93a6880372b467b7e3dd837fb6be8963532b87e59a32fc3d7ba2fb268580d39a/analysis/1480664106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Engineers%20Workshop-51533-SSE.rar?fid=1000229722&ttl=1535833933&ri=8192&rs=8192&setec=62b67ac55abfc70ef1d2744cddbfb448"
    }
  ]
}