{
  "modId": 51548.0,
  "modName": "SBF All In One Stat Boosted",
  "summary": "Skyrim Beautiful Followers&#39; attributes, skills and perks boosted.\r<br />Requires SBF 2.1.",
  "descriptionHtml": "This is personal edition. NOT PERMITTED BY THE ORIGINAL AUTHOR OF SBF. Endorse SBF First please.\r<br />\r<br />\r<br />0. What is this?\r<br />This esp file slightly modifies some attributes and skills of the followers in original SBF.\r<br />\r<br />\r<br />1. Why is this born?\r<br />The vanilla followers have many defects. Some people have good assets, some others do not.\r<br />e.g. Talvas Fathryon has so many useful perks, while other followers have no perk at all.\r<br />So this motivated me to do some attunement among followers.\r<br />\r<br />2. What&#39;s the difference between vanilla and this?\r<br />Confer description below:\r<br />\r<br />\r<br />Adelasia Vendicci\r<br />Her vanilla class is Citizen, which has lower growth rate of Health, Magicka, Stamina, and also has useless skills such as Smithing or Speech as a follower.\r<br />so, revamped into a spellsword.\r<br />\r<br />Aela The Huntress\r<br />Her vanilla class and skillset is fine.\r<br />so, just added some proper perks.\r<br />\r<br />Annekke Crag-Jumper\r<br />she&#39;s also fine.\r<br />so, just added some perks.\r<br />\r<br />Aranea Ienith\r<br />Her vanilla outfit is CourtWizard. But in fact she is not that. so default outfit changed.\r<br />She is professional frost and shock mage. so, adjusted perks with her spells.\r<br />\r<br />Beleval\r<br />She and Agmaer are tied in same template of special &#39;Bandit&#39; class. so, modified the parent template.\r<br />She now uses both OneHanded and TwoHanded on your favor.\r<br />And every Dawnguard followers now have special perk &#39;Extra Damage&#39;. which was only owned by Celann and Durak in vanilla.\r<br />\r<br />Borgakh the Steel Heart\r<br />Nothing prominently changed. just added proper perks.\r<br />\r<br />Brelyna Marion\r<br />Her class Mystic had no skill-ups at Destruction. so, modified that.\r<br />Her specialty is summoning and fire-magic.\r<br />\r<br />Dark Brotherhood Initiate\r<br />Empowered her stealthiness and dual-wield.\r<br />\r<br />Eola\r<br />In vanilla she has perk &#39;Augmented Frost&#39;, but she have no frost spells. And also has Shock spells without Shock perks.\r<br />so, get rid that frost perk and added shock perk.\r<br />\r<br />Frea\r<br />Frea&#39;s vanilla class raises Light Armor skill, not Heavy Armor. So, modified the class preference to heavy armor to fit to her default gear Nordic set. This is also claimed and fixed by renowned Unofficial Patches.\r<br />and adjusted her perks.\r<br />\r<br />Illia\r<br />She is maybe the strongest mage follower, because she shares the template of Warlock Ice Boss, such as Cryomancer.\r<br />\r<br />Ingjard\r<br />Just added some perks. She is one of the best two-handed warrior.\r<br />\r<br />Iona, Jordis, and Lydia - Housecarls\r<br />These girls have same skills and perks. A typical sword-and-board warrior.\r<br />\r<br />Jenassa\r<br />Versatile ranger at any position in battle. Dual wield for melee, and Archery for ranged.\r<br />\r<br />Mjoll the Lioness\r<br />Just added and adjusted perks.\r<br />\r<br />Njada Stonearm\r<br />Her vanilla class has weird skillset such as Pickpocket and Speech. Now she is literally block master.\r<br />\r<br />Rayya\r<br />just added dual wield perks.\r<br />\r<br />Ria\r<br />The new member of Companions also knows some spells that help in battle.\r<br />added spells and perks for spellsword.\r<br />\r<br />Serana\r<br />Adjusted class, spells, and perks.\r<br />\r<br />Ugor\r<br />Her outfit is changed to light armor to fit her class preference.\r<br />\r<br />Uthgerd the Unbroken\r<br />just added some perks.\r<br />\r<br />\r<br />3. Installation\r<br />you should INSTALL Skyrim Beautiful Followers - SBF FIRST&#33;\r<br />After installed original SBF, then overwrite the esp by this esp.\r<br />\r<br />\r<br />4. Notes\r<br />The Followers already spawned before mod installation will still have vanilla stat.\r<br />if you want apply this mod to already spawned follower, some console commands will be needed.",
  "categoryId": "33",
  "version": "",
  "author": "drc",
  "createdUnix": "1393428427",
  "updatedUnix": "1422130695",
  "containsAdultContent": false,
  "uploadedBy": "diarcy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144399",
      "name": "SBF All in One DLC Stat Boosted esp",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "SBF All in One DLC Stat Boosted esp-51548-.7z",
      "uploadedUnix": "1422130695",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/9bf418a54a08c5d70c9d3fb6276e09a5561da779480f820eb41fd10f2c3193f5/analysis/1422130742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SBF%20All%20in%20One%20DLC%20Stat%20Boosted%20esp-51548-.7z?fid=1000144399&ttl=1535833954&ri=8192&rs=8192&setec=bd3df84b594829a1ad87ff90a65b3629"
    }
  ]
}