{
  "modId": 51589.0,
  "modName": "Cats in the Dark",
  "summary": "Removes the night-eye power from Khajiit and gives you a realistic, customizable, always-on Nightvision effect instead.",
  "descriptionHtml": "[center][color=#daa520][size=8][font=Chiller]Cats in the Dark[/font][/size][/color][/center]\r<br />[right][font=comic sans ms,cursive][size=1]MADE WITH SCIENCE&#33;[/size][/font][/right]\r<br />\r<br />[size=3]Khajiit are cats, right? According to Skyrim, they&#39;ve got claws. According to The Real Barenziah, they&#39;ve got feline goolies. According to several body mods down the years, they&#39;ve got four pairs of nipples. Now, with Cats in the Dark, they&#39;ve got feline eyesight as well. Sure, they have the night-eye power in the vanilla game, which is a fairly poor implementation. You have to cast it every thirty seconds and it looks cold and unspectacular.\r<br />\r<br />Cats in the Dark changes all that. There&#39;s no longer a power for you to activate; instead your cat-sight is always present. But it&#39;s a tradeoff. You&#39;ll be able to see better at night. But your daytime vision, especially at long range, will suffer. You [i]can[/i] make long-range killing shots with your bow, but you&#39;ll be more effective at close range, with knives and daggers. Leave the Robin Hood work to the Bosmer, get in close, and become a whirl of claws and bladed death.\r<br />\r<br />Ever played Dungeon Keeper? It was a strategy game, where you built a dungeon and populated it with different creatures. You could possess them, seeing the world through their eyes. And different creatures had different kinds of eyesight. Dragons had a cool smoky whirl effect, flies saw everything in hexagonal chunks, and dogs saw everything in shades of grey. It was a pretty cool feature that reinforced the idea of them being different species. Cats in the Dark brings that effect to Skyrim.[/size]\r<br />\r<br />[center][color=#daa520][size=7][font=Chiller]Requirements[/font][/size][/color][/center]\r<br />[size=3]SkyUI (or SkyUI-Away) for the config menu. Nothing else.[/size]\r<br />\r<br />[center][color=#daa520][size=7][font=Chiller]Instructions[/font][/size][/color][/center]\r<br />[size=3]Install with or without Nexus Mod Manager. In-game, you need to be playing as Khajiit or you won&#39;t see anything (no harm will be done, you just won&#39;t see anything). The effect should appear as soon as you load the game or as soon as you select your race in a new game. This is how it looks with default settings.\r<br />\r<br />Note that you need SkyUI installed to access the configuration menu. If you don&#39;t like the interface, check out SkyUI-Away to get the mod menus without any of the other changes. Either way. hit escape and pick Mod Configuration. Click on Cats in the Dark.\r<br />\r<br />OK, so you&#39;ve loaded the game and found the MCM menu. There are three options here. Use the slider to set the strength of the various effects, customize Cats in the Dark to your liking&#33;[/size]\r<br />\r<br />[u][b]A note about customization[/b][/u]\r<br />[size=3]There are a huge variety of lighting mods, playstyles, monitors, desktop colour settings, gamma values, living rooms and phenotypes out there. To see Cats in the Dark at its best, you&#39;ll need to experiment to find what works for you.\r<br />\r<br />The defaults I&#39;ve chosen [i]should[/i] be somewhere in the middle for most people. But weather and lighting mods can make for huge changes in the way your game looks. Start with the Brightness slider; try to find a value that feels right to you. The Depth of Field slider controls the amount of blur applied to distant objects. The main effect of the Ancillary slider is to remove colour from the scene. Play about with this one once you&#39;ve found the &#34;right&#34; brightness level.[/size]\r<br />\r<br />[size=4][u][b]Brightness[/b][/u][/size]\r<br />[size=3]This slider controls how much extra brightness is applied to the screen. [i]Very[/i] roughly, it ranges from 1x to 2.5x as bright as a non-Khajiit character&#39;s eyesight.\r<br />Default 50%[/size]\r<br />\r<br />\r<br />[size=4][u][b]Depth of Field[/b][/u][/size]\r<br />[size=3]Housecats can&#39;t see clearly beyond five meters or so. And now, neither can you&#33; Actually, for the sake of playability, the distance is quite a bit further than that. \r<br />DoF might clash with mods like Dynavision or various ENBs. Some people just don&#39;t like the blurriness. Therefore, I&#39;ve included an option to turn it off completely. Just set the slider to 0%.\r<br />Default 80%[/size]\r<br />\r<br />[size=4][u][b]Ancillary effects[/b][/u][/size]\r<br />[size=3]This slider controls the rest of the effect - the desaturation, the radial blur, the general lack of green. \r<br />Default 60%[/size]\r<br />\r<br />[center][color=#daa520][size=8][font=Chiller]The SCIENCE bit&#33;[/font][/size][/color][/center]\r<br />Cats&#39; eyesight is very different from ours. Better in some ways, worse in others. I&#39;ve tried to represent all the differences as close to reality as possible, without sacrificing gameplay.\r<br />[list]\r<br />[*]They have more &#34;rod&#34; cells on their retinas, as well as a reflective layer (tapetum lucidum) just behind it. Cats can pick up more light than us, and do more with it.[/*]\r<br />[*]They have fewer &#34;cone&#34; cells than we do, so they don&#39;t see colours (especially green) as well as us.[/*]\r<br />[*]They have generally poorer detail perception than primates. This is partly down to the shortage of cone cells, and partly because the tapetum lucidum blurs the image.[/*]\r<br />[*]They have a slightly wider field of view than us, but it loses detail at the edges.[/*]\r<br />[*]They are better at picking up quick movement, and less prone to being dazzled.[/*]\r<br />[*]They are short-sighted. Cats can&#39;t pick up detail at long distance.[/*]\r<br />[/list]\r<br />In game, the brightness is increased. Also, the HDR parameters have been reduced considerably - light sources are less prone to blooming over the scene. This is partly out of necessity (increasing the brightness would otherwise make campfires and torches bloom out over half the screen) and partly because rod cells are less prone to being &#34;overloaded&#34; than the cones. \r<br />\r<br />The mod also desaturates the whole image. Cone cells are necessary to see colour, and cats have fewer of them. This effect is especially pronounced for greens when you turn up the ancillary slider, you&#39;ll notice a very distinct red-blue cast to the world.\r<br />\r<br />There&#39;s a very (make that very [i]very[/i]) slight blur applied to the whole image. This is the shortage of cone cells and the tapetum lucidum working together. The corners and edges of the screen are rather more affected than the center - just like in real life.\r<br />\r<br />Rod cells work more quickly than cones. Cats, having more of them, recover their eyesight very quickly after being dazzled. Stare at the sun for a moment, then turn and look into a cave. You&#39;ll notice how quickly your vision comes back.\r<br />\r<br />Finally, cats are short-sighted by comparison with humans. Creeping through undergrowth looking for mice, you hardly ever get the chance to see anything beyond a few meters. This is partly down to the lack of cone cells and partly the shape of the cat&#39;s lens. You&#39;ll notice that distant landscapes are hard to make out, clouds are meaningless blobs and distant opponents are hard to discern. That&#39;s the price you pay.\r<br />\r<br />[size=2]Note that the effect is constant and can&#39;t be turned off. This is a deliberate feature of the mod. If you like the idea, but don&#39;t want the constant effect, then try Cats in the Dark&#39;s parent mod, [url=http://www.nexusmods.com/skyrim/mods/35281/?]Spectacular Night Eye[/url] with the SideLine effect.[/size]",
  "categoryId": "78",
  "version": "0.1",
  "author": "OfftheRails",
  "createdUnix": "1393608638",
  "updatedUnix": "1393608471",
  "containsAdultContent": false,
  "uploadedBy": "Offtherails",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099146",
      "name": "Cats in the Dark",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Cats in the Dark-51589-0-1.7z",
      "uploadedUnix": "1393608471",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/5c57ed75b2eb2a3133094cf5380dcaaa65132a21aec80ab1d65395894178007f/analysis/1407953827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cats%20in%20the%20Dark-51589-0-1.7z?fid=1000099146&ttl=1535834042&ri=8192&rs=8192&setec=b31ba1a8b84c9df005b468c1b0810135"
    }
  ]
}