{
  "modId": 51617.0,
  "modName": "Smarter Combat Music",
  "summary": "In the vanilla game, the combat music was frequently your first indication that you had been targeted by an unseen enemy. SCM does away with that, forcing you remain alert and be aware of your surroundings.  It can also play musical cues for surprise attacks, silence the normal music when enemies are nearby, and adds an optional victory fanfare aft",
  "descriptionHtml": "[color=#e8f1f1]Inspired by [url=http://www.reddit.com/r/skyrimmods/comments/1yalcd/a_mod_to_delay_combat_music_until_you_take_damage/]this Reddit thread[/url], Smarter Combat Music disables the game&#39;s own handling of the combat music and replaces it with a more nuanced, customizable system. \r<br />\r<br />[b][size=4]What it does[/size][/b]\r<br />\r<br />In the vanilla game, the combat music is often the first sign that you have been targeted by an unseen enemy. Many consider this a break in immersion, as well as conferring an unfair advantage to the player. \r<br />\r<br />SCM does away with that, forcing you remain alert and be aware of your surroundings. SCM keeps track of the player&#39;s combat state, as well as that of nearby hostile actors. When enemies detect you but you have not yet seen them, the normal music will continue playing as if all is well. Only upon hitting, being hit or spotting the opponent before they reach you will the combat music play. \r<br />\r<br />You can also use a more subtle cue: the normal background music will fade when you are spotted. This provides a gentle, more immersive warning and allows you to better hear your attacker&#39;s approach.\r<br />\r<br />If you are struck by an unseen opponent or while your weapons are sheathed, a startling musical &#34;stinger&#34; can be played before combat music begins, adding tension to the fight. \r<br />\r<br />After a particularly grueling battle with many opponents, a short musical fanfare or reward track can be played to celebrate your victory against overwhelming odds. This can be customized to one of two built-in victory tracks, or a custom track of your own choosing.\r<br />\r<br />All features are optional and can be controlled through SkyUI&#39;s MCM. SCM&#39;s features will not be applied to dragon fights, ensuring the music is played.\r<br />\r<br />[b][size=4]Updates[/size][/b]\r<br />\r<br />Version 1.12\r<br />[list]\r<br />[*]Restored a safety check that makes sure combat music halts when player is not in combat. This should resolve cases where the combat music became stuck on after the player was killed.\r<br />[/list]\r<br />\r<br />Version 1.11\r<br />[list]\r<br />[*]Fixed a bug that could cause the standard background music to continue playing underneath combat music if the player is hit by a surprise attack. Background music is now force-muted before the stinger plays.\r<br />[*]Fixed a bug that could cause the combat music to linger for a long time after a stealth kill.\r<br />[*]Restored the combat stats to their own page in MCM.\r<br />[*]Fixed a bug that could cause version upgrades to shut down combat tracking.\r<br />[/list]\r<br />\r<br />Version 1.10 (the &#34;why didn&#39;t I do it this way in the first place?&#34; release):\r<br />[list]\r<br />[*]Complete rewrite of combat detection engine to make it more efficient, reliable and almost entirely event-driven.\r<br />[*]Fixed a bug where after loading your game, sometimes the combat tracking script would not re-register its ModEvents (special thanks to Hyacathusarullistad for providing me some vital info about it&#33;)\r<br />[*]Added a simple threat-level check, to keep music from playing for enemies that are very weak compared to you. This is adjustable in the MCM as &#34;Health Check Multiplier&#34;. \r<br />[*]Added an option to allow subtle, half, or total silence\r<br />[*]Added two more tracks for selection as a fanfare: &#34;Level Up&#34; and &#34;Word of Power&#34;. They are... less subtle.\r<br />[*]Updated documentation to show correct location of custom music track. It must be placed in Data/Music/Combat, not Data/Music\r<br />[*]Changed how surprise attacks (attacks from an enemy you haven&#39;t seen yet) are detected. Should result in fewer false positives and more actual surprises.\r<br />[*]Made it much less likely to stop and restart combat music in a fight. \r<br />[*]And a TON of others, see the changelog for the complete list, it&#39;s a doozy&#33;\r<br />[/list]\r<br />\r<br />[b][size=4]Requirements[/size][/b]\r<br />\r<br />This mod [i]requires[/i] SKSE to operate. And you&#39;ll need SkyUI if you want to change any of the settings. To save some time, here are the answers to the questions I get most frequently: No, it will not work without SKSE, not even a little bit. No, I will not create a version that doesn&#39;t require SKSE. Although it would be possible to do so, it would be dramatically less efficient and a great deal more resource-intensive, less safe, and time-consuming to build. Not going to happen. You should be running SKSE anyway to fix invalid registrations caused by the vanilla game. [url=http://skse.silverlock.org/]Go get it[/url], there&#39;s even an automated installer for it now, so you have no excuse to not be using it.\r<br />\r<br />[b][size=4]Compatibility[/size][/b]\r<br />\r<br />This mod has been CONFIRMED (tested by the author) compatible with:\r<br />[list]\r<br />[*]Psyrim\r<br />[*]Fantasy Soundtrack Project (formerly Fantasy Music Overhaul) including the Dawnguard, Unique Places, and Combat add-ons, in either replacer or non-replacer mode.\r<br />[*]Audio Overhaul for Skyrim (and all addons/patches)\r<br />[/list]\r<br />\r<br />This mod has been REPORTED (tested by others) compatible with:\r<br />[list]\r<br />[*]Personalized Music.\r<br />[/list]\r<br />\r<br />This mod SHOULD be compatible with any other music mod as long as it is using the same FormID as vanilla for its combat music tracks. [url=http://i.imgur.com/ld455Z6.png]SCM [b]does not alter[/b] existing MusicType forms[/url], which is why it is compatible with pretty much any music or sound effect mod you can find. \r<br />\r<br />SCM does use duplicated versions of MUSStinger, MUSReward, MUSLevelUp, MUSReveal, and a few other tracks. That means that changes to those MusicType forms will not be applied to SCM (though they will play correctly in all the original places), but replacing the actual tracks (XWM files) will work just fine. Since there don&#39;t seem to be any mods that add tracks to those MusicTypes, it is for now a moot point.\r<br />\r<br />[b]Scripts[/b]\r<br />\r<br />SCM&#39;s scripts have been thoroughly tested and do not place an undue load on the scripting engine. While SCM does run many scripts in parallel, these are almost entirely event-driven and consume very few resources under normal circumstances. It is possible that you may encounter some slight delays in combat tracking/music updates when fighting very large groups of enemies. This problem will be more prevalent on minimum-spec machines, and will be exacerbated if you are also running other script-intensive mods. On a system that well exceeds the minimum requirements for playing Skyrim, this should not be an issue unless another mod hogs/hangs the script engine (which is of course out of my control).\r<br />\r<br />[b][size=4]Installation/Upgrades[/size][/b]\r<br />\r<br />SCM can be installed and upgraded using NMM or by extracting the 7z file into your Skyrim/Data directory.\r<br />\r<br />[b][size=4]Configuration[/size][/b]\r<br />\r<br />SCM is configured through SkyUI&#39;s MCM controls. Most options are self-explanatory and all have additional information available when highlighted. Any of the following features can be disabled entirely if you don&#39;t want to use them.\r<br />\r<br />[b][size=4]Health Check Multiplier[/size][/b]\r<br />\r<br />The short version is that the Health Check Multiplier determines when combat music plays, based on how strong enemies are compared to the player. The higher you set it, the lower the requirement for combat music to play. The check is very simple: the health of every enemy currently in combat with you is added together, and multiplied by the Health Check Multiplier. If this number is greater than your current health, combat music will play. That&#39;s it&#33; The default is 3, which will play music for most one-on-one encounters with auto-leveled enemies well into level 50 or so. Weak enemies (mudcrabs, etc) can still start combat music if there are enough of them. \r<br />\r<br />Obviously this system isn&#39;t perfect: a powerful enemy mage may have fairly low HP and not set off the music. This is rare in vanilla (as the game level-balances by inflating Health) but if you you are running a major gameplay overhaul mod, it may happen a lot. If so, just increase the value of the multiplier. Better checks are coming.\r<br />\r<br />[b][size=4]Configuring Silence[/size][/b]\r<br />\r<br />SCM can fade out the normal background music when you are spotted, or when there are enemies nearby. This is less jarring than the sudden introduction of combat music while still providing you with some gentle warning. \r<br />\r<br />There are three silence levels to choose from. The default is now &#34;Subtle&#34;, which reduces the music just a little bit to allow you to better hear your surroundings. &#34;Half&#34; is identical to the default setting in 1.0, reducing the volume noticeably. &#34;Total&#34; completely cuts out the music when you are spotted.\r<br />\r<br />&#34;Silence on Alert&#34; means that the music will get quieter when enemies have detected you but haven&#39;t actually attacked you yet. &#34;Silence on Lost&#34; means that if you are hiding and enemies are searching for you, the regular background music will not resume until they have given up or moved well away from you.\r<br />\r<br />[b][size=4]Configuring the Fanfare[/size][/b]\r<br />\r<br />You can configure an optional fanfare that will play after a battle that meets the requirements you define. The parameters are:\r<br />[i]Combat duration[/i] - How long the combat lasts in real time (not game time), measured from the moment you are hit or spotted until the moment your last foe is dead and there are no more &#34;red dots&#34;. \r<br />[i]Kill count[/i] - How many foes you killed during the battle.\r<br />[i]Kill rate[/i] - Your average kills per minute during the battle.\r<br />[i]Player hits[/i] - How many hits the player took during the battle.\r<br />\r<br />If your stats during the battle exceed all four of these values, then the selected victory fanfare will play. This can get annoying quickly, so the default values are pretty high. You can change of any them, or remove them entirely by setting them to 0.\r<br />\r<br />The available fanfare tracks are:\r<br />\r<br />[list]\r<br />[*]Reward - One of four short in-game tracks that sometimes get played when you complete a dungeon or find a large treasure.\r<br />[*]Reveal - One of four longer, more powerful tracks that the game usually plays only when you discover a special place.\r<br />[*]Word of Power - One of three fanfares that normally play when you absorb a dragon soul or learn a new Word. Pretty powerful, so you probably want to crank the fanfare requirements up.\r<br />[*]Level Up - One of three tracks played when you visit the Perks screen after gaining a level. Like &#34;Word of Power&#34;, this is a strident track, so you probably don&#39;t want it playing after every fight with a mudcrab.\r<br />[*]Custom - To use your own track for the victory fanfare, place the XWM file in [b]Skyrim/Data/Music/Combat[/b]. It must be called [b]vSCM_fanfare.xwm[/b]. Once you&#39;ve done that, choose this option to use it as the victory fanfare.\r<br />[/list]\r<br />\r<br />[b][size=4]Uninstalling[/size][/b]\r<br />\r<br />Although in theory the mod should be safe to remove without shutting it down first, it is HIGHLY recommended that you use the MCM control panel and uncheck &#34;Enable Combat Tracking&#34;. This will disable all features of the mod and shutdown all scripts. After you receive the &#34;SCM has shut down&#33;&#34; message, it is safe to save your game and remove the mod. \r<br />\r<br />[b][size=4]Troubleshooting[/size][/b]\r<br />\r<br />The problem in version 1.0 that caused combat music to rarely stay stuck on should be completely resolved. If you encounter this issue PLEASE report it.\r<br />\r<br />[i]Problem[/i]: Combat music restarts frequently during combat.\r<br />[i]Solution[/i]: By default, Combat music will end about 5 seconds after all enemies have lost sight of you. If you&#39;re primarily a stealth character and you have the &#34;Shadow Warrior&#34; perk, you may find this happening too frequently. I&#39;m working on a proper fix, but in the meantime you can disable &#34;Silence on Lost&#34; in MCM. This should largely fix the problem by keeping the combat music playing until all enemies have given up looking for you.\r<br />\r<br />[i]Problem[/i]: Opponents are attacking me during brawls.\r<br />[i]Solution[/i]: This is the &#34;brawl bug&#34;, and it affects nearly any mod that uses Cloak spells to apply scripts. I&#39;ve taken some steps to avoid it but if you&#39;re running into this you have a couple of options. You can either disable the mod temporarily by unchecking &#34;Enable Combat Tracking&#34; before the brawl, or you can install [url=http://www.nexusmods.com/skyrim/mods/24020/?]Brawl Bugs Patch[/url].\r<br />\r<br />[b][size=4]Todo[/size][/b]\r<br />\r<br />[list]\r<br />[*]Improve the threat-level checking to better estimate the actual threat posed by an enemy.\r<br />[*]Allow fanfare to be dependent on the threat level of the foes defeated, so that killing 6 wolves is never fanfare-worthy but killing 3 giants at once is.\r<br />[*]Optionally exclude certain races from ever playing combat music (mudcrabs and skeevers, for example)\r<br />[/list]\r<br />\r<br />[b][size=4]Bugs[/size][/b]\r<br />\r<br />[list]\r<br />[*]If you are fighting a regular enemy and a dragon shows up, sometimes the boss combat music will not start until the regular combat music has finished. This is actually a bug in vanilla, but I should be able to fix it.\r<br />[*]Combat music still occasionally restarts during a fight, though usually because the enemies lost detection on you for more than 5 seconds. See &#34;Troubleshooting&#34;.\r<br />[*]Rarely, an enemy that is attacking you will fail to start the combat music even though it should. This is usually caused by engaging an enemy immediately after entering a new location or using COC/COW from the console.\r<br />[*]If the killcam gets activated, very rarely the foe will not count as a player kill for the fanfare requirement tracking. I believe I have fixed this but have not thoroughly tested it yet.\r<br />[*]Combat music may stop or start during the Civil War battle sequences instead of playing continuously. \r<br />[/list]\r<br />\r<br />[b][size=4]History[/size][/b]\r<br />3/10/2014 - 1.11 - Minor bugfixes, restored combat stats to MCM\r<br />3/09/2014 - 1.10 - The &#34;why didn&#39;t I do it this way the first time?&#34; release. Huge list of bugfixes, see the changelog.\r<br />2/28/2014 - 1.00 - Initial release\r<br />\r<br />[/color]",
  "categoryId": "61",
  "version": "1.12",
  "author": "Verteiron",
  "createdUnix": "1393637034",
  "updatedUnix": "1394997758",
  "containsAdultContent": false,
  "uploadedBy": "verteiron",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099199",
      "name": "SmarterCombatMusic100",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "148",
      "fileName": "SmarterCombatMusic100-51617-1-00.7z",
      "uploadedUnix": "1393636801",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/bc0a7f85c1448852b58a758b36cc615d27f477fcff034b96a5379aca3d790bf2/analysis/1407954429/",
      "changelogHtml": " Initial release to Nexus. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmarterCombatMusic100-51617-1-00.7z?fid=1000099199&ttl=1535834093&ri=8192&rs=8192&setec=332ebef5856724e33976e6bc781e7ccc"
    },
    {
      "fileId": "1000100618",
      "name": "SmarterCombatMusic110",
      "version": "1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "155",
      "fileName": "SmarterCombatMusic110-51617-1-10.7z",
      "uploadedUnix": "1394424013",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/fd418ad01891c37f5d1c43db3088394f998aa0e063c973dba17514cfd7ad7fee/analysis/1407975783/",
      "changelogHtml": " Removed redundant musictype from list: MUSCombatBoss is unnecesary because MUSCombat includes its tracks and is already conditioned to apply them to the right fights. <br/> \n Added an option to allow partial or total silence <br/> \n Fixed a bug with combat stat tracking.  Duuhr, math is hard. <br/> \n Stopped trying to track down a bug where alt+tabbing out of the game would make the combat music play indefinitely, because it&#39;s a bug in vanilla and therefore out of my hands <br/> \n Changed some options on the Stinger and Fanfare musictypes to make them transition a bit more smoothly <br/> \n Updated documentation to show correct location of custom music track. It must be placed in Data/Music/Combat, not Data/Music <br/> \n Reduced redundancy of combat music removal <br/> \n Fixed some text in MCM that was missing in the translation file <br/> \n Added SKSE version check, which should notify anyone with an out-of-date version that they need to update <br/> \n Added a &#34;threat level&#34; check to the mod. It compares the HP of your opponents to your own and determines whether combat music should start. As with all other features, this is optional and can be disabled. <br/> \n Resolved an issue that could, in rare circumstances, cause the combat music to get stuck on even after combat ended <br/> \n Added three levels of silence to the MCM panel to make the &#34;spotted&#34; notification more subtle <br/> \n Cleared some dirty edits to unrelated forms. <br/> \n Complete rewrite of combat detection engine to make it more efficient, reliable and almost entirely event-driven.  <br/> \n Fixed a bug where after loading your game, sometimes the combat tracking script would not re-register its ModEvents <br/> \n Added a configurable timer to the combat music&#39;s tail-off. Still testing, so it&#39;s not configurable in this version but will be in the next. <br/> \n Changed how surprise attacks (attacks from an enemy you haven&#39;t seen yet) are detected. Should result in fewer false positives and more actual surprises.  <br/> \n Made it much less likely to stop and restart combat music in a fight <br/> \n Fixed logspam when the combat tracker spell was applied to enemies <br/> \n Fixed occasional logspam when a tracked enemy was killed while trying to SendModEvent <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmarterCombatMusic110-51617-1-10.7z?fid=1000100618&ttl=1535834093&ri=8192&rs=8192&setec=1882b9ea4d30e390b61e8517d7dc55f7"
    },
    {
      "fileId": "1000100738",
      "name": "SmarterCombatMusic111",
      "version": "1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "156",
      "fileName": "SmarterCombatMusic111-51617-1-11.7z",
      "uploadedUnix": "1394493653",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/cce73b2be2afaac34a1437a23bb2e040bd0544465f5de93158561ce976779c39/analysis/1407977224/",
      "changelogHtml": " Fixed a bug that could cause the standard background music to continue playing underneath combat music if the player is hit by a surprise attack. Background music is now force-muted before the stinger plays. <br/> \n Fixed a bug that could cause the combat music to linger for a long time after a stealth kill. <br/> \n Restored the combat stats to their own page in MCM. <br/> \n Fixed a bug that could cause version upgrades to shut down combat tracking. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmarterCombatMusic111-51617-1-11.7z?fid=1000100738&ttl=1535834094&ri=8192&rs=8192&setec=3bf5f11b245347330ce631c18e33bbc0"
    },
    {
      "fileId": "1000101431",
      "name": "SmarterCombatMusic112",
      "version": "1.12",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "157",
      "fileName": "SmarterCombatMusic112-51617-1-12.7z",
      "uploadedUnix": "1394997758",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/d6952886f1eeac7ab33b27d7a6a4b3c14ecc6d94466e5ac56eaa06d06bcbe89d/analysis/1407984669/",
      "changelogHtml": " Restored a safety check that makes sure combat music halts when player is not in combat. This should resolve cases where the combat music became stuck on after the player was killed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SmarterCombatMusic112-51617-1-12.7z?fid=1000101431&ttl=1535834095&ri=8192&rs=8192&setec=2eb19f7be3d2045a6151162393d0fbf7"
    }
  ]
}