{
  "modId": 51633.0,
  "modName": "LC_BecomeJarlofIvarstead",
  "summary": "This DLC will introduce the opportunity for the player to become Jarl of Ivarstead, and to enjoy all the luxuries that come with such a title – such as a magnificent castle. To obtain the title, you must first undergo an immersive, lore-friendly quest that offers several hours of new gameplay in itself. After completing the quest and becoming the",
  "descriptionHtml": "[size=4][b][url=http://www.nexusmods.com/skyrim/mods/74950/?]\n<br />[/url][color=#ffff00][size=4][b]\n<br />[/b][/size][/color][color=#f1c232][size=4]New mod to skyrim SE Link in Image[/size][/color]\n<br />\n<br />[url=https://www.nexusmods.com/skyrimspecialedition/mods/18308?tab=description][img]https://staticdelivery.nexusmods.com/mods/110/images/20614/20614-1530436736-540295821.jpeg[/img][/url]\n<br />\n<br />Need last update skyrim[/b][/size]\n<br />[size=4]\n<br />1.4 Expansion: Girls of Ivarstead![/size]\n<br />\n<br />(contains nudity and it recommended for ages 18+)\n<br />\n<br />- Adds 5 beautiful girls to the court\n<br />- All 5 girls can be followers\n<br />- Each come with custom body/hair/face\n<br />- Adds new esp file (requires main esp also)\n<br />\n<br />(Download link is in the optional file section SELECT \"NO\" to upgrade on NMM)\n<br />\n<br />\n<br />                              [center][youtube]FKs8z5XmJy0[/youtube][/center]\n<br />\n<br />[center][size=4]Walkthrough of the quest and functions of the mod.\n<br />\n<br />[center][youtube]K39umJYpz-I[/youtube][/center][/size][/center]\n<br />\n<br />\n<br />\n<br />[b][size=3]What Does This DLC Do?[/size][/b]\n<br />\n<br />This DLC will introduce the opportunity for the player to become Jarl of Ivarstead, and to enjoy all the luxuries that come with such a title – such as a magnificent castle! To obtain the title, you must first undergo an immersive, lore-friendly quest that offers several hours of new gameplay in itself. After completing the quest and becoming Jarl, the story doesn’t end… it begins! After becoming Jarl of Ivarstead, you are responsible for your hold and all its subjects – tending to day-to-day tasks, working with your nobility to protect your home, feeding your citizens and governing your city’s law’s, executing perpetrators and imprisoning criminals. Hold banquets and dances and other lavish soirées to enhance your reputation as a leader and a political figure. Will you be the benevolent ruler that Ivarstead is crying out for? Will you release the innocent, punish the guilty and defend your home, feed your citizens and home them fairly? Or will you become a bitter tyrant? Holding feasts while your populace starve, watch your town burn and its people die? The choice is yours. Do all this while expanding Ivarstead into a grand superpower, setting taxes with a whole host of other possibilities never before seen in Skyrim!\n<br />\n<br />So what are you waiting for? Download now! :-)\n<br />\n<br />\n<br />[b][size=3]Author's Note[/size][/b]\n<br />\n<br />Hello again everyone, it's been a while since the release of “Become King of Riverhelm”, now I invite you to experience “Become Jarl of Ivarstead” – my new modification in the form of a DLC.\n<br />What's new?  Lots! This is a much more professional production, and was done with much more attention to detail with factors such as language, dialogue, scripting etc. I tried to make everything as immersive as possible. The design is also superior because I made the mod entirely from scratch and with many new features all built from the ground up. I used all my experience for the construction of this mod, with over 2,500 hours experience with the Creation Kit as well as my skill and training as a Game Designer – all of this was done with the intention of giving you, the player, an experience which meshes seamlessly with the world of Skyrim, and exudes professionalism, quality and polish. All in, the project took me about 7 months to complete. I was working full time on this mod with my full, undivided attention being given to it. Fortunately my previous experience in modding and Game Design with projects such as Riverhelm made the production process a lot smoother and faster – but due to the large amount of new features and programming that had to be done – the mod was also challenging and time consuming!\n<br />I had a lot of fun making this mod – it gave me many sleepless nights and headaches over programming though. Throughout the construction of the mod, my persistence and determination were both tested endlessly – but these are essential factors for the completion of a major work, which I intend to send to Bethesda as a portfolio with the prospect of achieving my lifelong dream of working as a designer in their studio. I am now an experienced modder, with Riverhelm I thought it would be a good opportunity to use it as a folio, but I concluded that Riverhelm was not sufficient enough quality to use for this, and wanted to send only my best work, and as such decided to wait and to build a bigger, better, more ambitious mod – hence the completion of this mod! I have put in crazy hours with all my mods, all leading up to this submission and the fulfillment of a dream I have had for many years. Of course by you all also! :D\n<br />\n<br />\n<br />[b][size=4]If you want to like my page in facebook and join me :)\n<br />[/size][/b]\n<br />\n<br />[url=https://www.facebook.com/Become-King-of-Riverhelm-and-Locaster-mods-123193281131815/][img]https://staticdelivery.nexusmods.com/mods/110/images/20614-0-1509676613.jpg[/img][/url]\n<br />\n<br />[b][size=3]\n<br />Start new Patreon![/size][/b]\n<br />\n<br />[url=https://www.patreon.com/locaster][img]https://staticdelivery.nexusmods.com/mods/110/images/20614-1-1509676613.jpg[/img]\n<br />\n<br />[size=3][b][color=#efefef]\n<br />\n<br />[/color][/b][/size][/url]\n<br />[size=3][b][color=#efefef]If you would like to thank me for this mod, please read below. Otherwise, you can skip\n<br />the text, which is not related to the mod itself. (See spoiler)[/color][/b][/size]\n<br />[size=2]\n<br />\n<br />[b][color=#efefef][spoiler] [/color][/b][color=#efefef]Greetings to all my dear friends and followers! Thank you for reading this text.\n<br />If at least one of you get what I’ll be saying here and put in practice what I’m writing\n<br />about, or, if my words help you somehow, all the effort I dedicated to the creation and\n<br />development of this mod, as well as so many others, will be made worth it.\n<br />\n<br />Have you ever thought about what you have been doing to make the world a better\n<br />place? It is a hard task, isn’t it? Specially when we find ourselves immersed in personal\n<br />issues, essential/existential problems, heavy work routines, and the list goes on... I\n<br />understand it–better than you can imagine.\n<br />\n<br />Yet, one day I decided to suspend the exterior queries and get some time to look inside\n<br />myself. “To look inside oneself?”, you might ask. It can sound weird at a first, as it was\n<br />for me in the beginning of this intimate and profound journey—a search for something\n<br />superior. I started reconsidering my behavior, analyzing my right attitudes and mistakes\n<br />from the past. From then on, I began working on each one of my faults and weaknesses\n<br />by looking at myself as if I were an spectator, observing me in the third person. With\n<br />each of my faults mapped, I started observing what was leading me to commit each\n<br />error. This task takes time, the results don’t come overnight, but it will transform you\n<br />substantially, if you allow it to happen.\n<br />\n<br />I eliminated most of my anger, hate, greed, envy, and vanity, among other\n<br />imperfections. I still have a lot to learn and I hope to die learning. Hence, I try to be a\n<br />little better every single day. Scientific studies have shown that negative emotions cause\n<br />diseases such as cancer, and they have a huge negative social impact. I’m not better nor\n<br />worse than anybody else; all of us have these and other imperfections to smaller or\n<br />greater degree.\n<br />\n<br />These negative emotions are the reason why so many people are starving in the world,\n<br />or pay huge amounts of money for medicine that are in fact, cheap to produce—in such\n<br />a way that few can make fortunes. And those who need it most don’t have access to\n<br />basic necessities—while corrupt politicians steal taxpayer's money with their insatiable\n<br />and deranged greed.\n<br />\n<br />This is only a small part of the troubles caused by these character flaws, which are truly\n<br />a worldwide disease. Yet, you all know about the problems of the world. What many\n<br />people don’t know it is how to start solving these problems, how to improve the quality\n<br />of life in the world. Along the years, I listed some of my conclusions and inspirations. A\n<br />good point of departure is to start following these steps:\n<br />\n<br />1– What you do not want done to yourself, do not do onto others.\n<br />\n<br />2– At a certain point in your life you will harvest the seeds of the good and the bad you\n<br />have done. It can take many years, but one day what you have done will get back to you\n<br />(so, do good deeds, “greasy soul”! lol)\n<br />\n<br />3– Try to take something good out of the bad things that happen to you. There are\n<br />lessons to be learned.\n<br />\n<br />4– Before criticizing others, try to put yourself on their shoes and ask yourself if you\n<br />wouldn't do the same, or how would you act better under the same circumstances. Know\n<br />yourself very well before judging the others.\n<br />\n<br />5– Try to always show a positive attitude. This attracts good things (yeah, it is hard, I\n<br />get it—specially with a half dozen trolls salivating on your neck, but be faithful and you\n<br />will succeed).\n<br />\n<br />6– Don’t take things for granted. Be grateful for the good things you receive, and for the\n<br />ones you already have, by forgetting for a moment what you don’t have.\n<br />Very well then. Look at the #1: “What you do not want done to yourself, do not do to\n<br />others”– How much better the world would be if everybody followed only this thought?\n<br />Much, much better... wouldn’t it?\n<br />Folks, think about it. How can we make the world a better place if, so often, we\n<br />ourselves are sick?\n<br />\n<br />It is simple: start by improving yourself. Practice the list above. I put it in practice and I\n<br />improved a lot—personally and toward the ones around me. That is the reason why I’m\n<br />sharing it with you. Acquire knowledge by studying many books, religions, and\n<br />philosophies. Have an open mind, absorb the best of each lesson, and build your own\n<br />truth. Eventually, you will see the world and the circumstances more clearly.\n<br />Look inside yourself. It all starts with this. Question yourself, and, if feasible, follow the\n<br />six steps above. I can assure you the world would be a much better place if people\n<br />followed it. You might not be perfect, but you can be a little better at each day. It is up\n<br />to you.\n<br />\n<br />Well, that’s it. I may not be the Lord of Universal Truth, but I’m talking to you with an\n<br />open heart, sharing my two cents. I hope no one will take a wooden baton and beat my\n<br />head with it thinking I’m crazy... Or, perhaps it is the world that is?\n<br />Open your eyes and your consciousness. Thank you for reading this far. I wish the best\n<br />for each of you. The power of change is in the hands of each one of us. Don’t wait for\n<br />the change to happen—be the change!\n<br />Peace and light to everyone.\n<br />\n<br />Sincerely,\n<br />Locaster[/color][b][color=#efefef] \n<br />\n<br />[/spoiler][/color][/b][/size]\n<br />\n<br />\n<br />\n<br />[b][size=3]The Story[/size][/b]\n<br />\n<br />Upon awakening at the top of Throat of the World, the highest mountain of Tamiel, the legendary dragon Alduin gave a deafening roar. \n<br />The sonorous roar from the top of the icy mountain caused a destructive avalanche that swept everything on its path along seven thousand feet downhill reaching the imposing FalconNest fortress.\n<br />The glorious fortress deterred the advance of the avalanche saving the village of Ivarstead. Yet, its structure was destroyed and its inhabitants were killed.\n<br />Ivarstead and the FalconNest fortress were led by the Jarl Barumutt, a bastard brother of Laila Law Giver, the Jarl of Riften. They divided the land in the attempt to stop the dangerous threat of a large invasion of savages known as RedSkulls. The people in Ivarstead are suffering from the lack of a leadership and security, from their resources destroyed, and from starvation. They fell in times of darkness and gloom.\n<br />Laila now finds herself shaken and Riften is in financial crisis caused by the civil war, the population of Ivarstead has been abandoned to face their doom. Will this be the end of the tale? Or will another stand up for the hold and secure it’s future?\n<br />How Do I Start The Quest?\n<br />Go to Ivarstead, near the castle and search for Goldur in the warehouse that sits on top of the stables, he will sell you a Shed for you to rest in and store your equipment – this is when you can start main quest. (Remember in case the dialogue does not Appear: save the game and load again in front of Goldur)\n<br />\n<br />[b][size=3]How to start?[/size][/b]\n<br />\n<br />Go to Falconnest castle in Ivarstead speak with Goldur in warehouse upstairs of stable!\n<br />\n<br />If dialogues no show in Goldur save game in front of Goldur and load now work!\n<br />[size=3]\n<br />[/size][b][size=3]\n<br />Features[/size][/b]\n<br />\n<br />\n<br />[b][size=3]The Quest[/size][/b]\n<br />\n<br />The Quest was made to be as immersive as possible, the mod features over 400 lines of quest dialogue that aims to fit seamlessly into the world of Skyrim without breaking immersion or disobeying lore. It consists of rebuilding the fortress FalconNest, meeting the various demands of the population and containing the threat of RedSkulls. It should take about eight hours to complete.\n<br />\n<br />[b][size=3]The Castle[/size][/b]\n<br />\n<br />FalconNest Fortress was initially destroyed by the Avalanche. It is an imposing fortress that must be reconstructed by the player. It has everything a player home should need and some additional extras, the included areas and features are as follows:\n<br />1- Stables.\n<br />2- Goldur’s Warehouse\n<br />3- Pens and barns for animals with accompanying administration office and beginner player bedroom\n<br />4 - Smelter\n<br />5 – Forge along with the soldiers' barracks.\n<br />6 - Throne Room.\n<br />7 – Feast hall\n<br />8 – Nobles’ Hall\n<br />9 - Library\n<br />10 – Jarl’s Bed Chamber\n<br />11 – Jarl’s Bathroom\n<br />12 – Secret passage to the Jarl’s Bed Chamber\n<br />13 - Prison\n<br />14 - Dining Room.\n<br />15 - Kitchen.\n<br />16 – Servant’s Chambers\n<br />17 – Trophy Rooms\n<br />\n<br />[b][size=3]New Enemies[/size][/b]\n<br />\n<br />A new kind of enemy now haunts the forests of Riften; The Redskulls are a wild tribal cult that paint their skin for camouflage, and hide among vegetation throughout their native territory of The Rift. They travel in bands and pillage local villages and settlements in the dead of night. They are commanded by the cult’s great mentor Malathar. He is a powerful mage who hides in the vast forests of The Rift.\n<br />New Areas\n<br />Several new areas have been added by the mod, including the fort of the Redskulls, a new Alchemy shop, an Arena, new houses, a mine and more. Some are only available for construction after the completion of the mod’s main quest line.\n<br />\n<br />[b][size=3]Take Care of Your Reputation![/size][/b]\n<br />\n<br />Your actions will be judged by your citizens! If you uphold a respectable reputation, you will be adored by your populace, who will give you gifts, and you can sleep easy knowing that you will not be assassinated in the night. Or if you so wish, you can choose to be known as a cruel tyrant who exploits his or her people, hosting lavish feasts while the people starve. The choice is yours, and you must face the consequences… Because yes, there are consequences!\n<br />\n<br />[b][size=3]How Can I Build My Reputation?[/size][/b]\n<br />\n<br />You can build your reputation by meeting the everyday demands of running a hold, treating your people fairly. Everyday issues can be solved by consulting Arnold, and your decisions will influence your reputation – make kind and fair decisions, throw parties at your own expense, pay for arena events and give you’re a people a varied diet, and tax them fairly – you’ll be fine.\n<br />\n<br />[b][size=3]What Will Damage My Reputation?[/size][/b]\n<br />\n<br />When governing the hold with Arnold, cruel or unjust choices will degrade your reputation. As well as this, doing things like sending your guards to extort people, collecting bribes to release criminals, hosting feasts paid from the public purse, not feeding your citizens and high taxes will also garner you a poor reputation.\n<br />\n<br />[b][size=3]How Do I Check My Reputation?[/size][/b]\n<br />\n<br />Speak to Arnold and ask about your reputation, he will tell you your current status. It is important to remember that it is not one or two actions that will change your reputation, but the accumulation of good or bad actions over an extended period of time. Don’t expect mobs of angry, starving villagers to be cheered up by an Arena match and a Sweetroll!\n<br />\n<br />\n<br />[b][size=3]Setting Tax Rates[/size][/b]\n<br />\n<br />You can set tax rates by talking to Arnold, higher rates will generate negative reputation, and lower rates will generate a positive reputation, as well as moderate taxes not giving too much in the way of a positive or a negative reputation. Rates as well as income from your investments in gold are deposited directly into the treasury chest, near the throne.\n<br />\n<br />\n<br />[b][size=3]Food Management[/size][/b]\n<br />\n<br />Every day the inhabitants of Ivarstead consume a certain amount of food. The food is stored in a barrel in Goldur’s warehouse. The amount consumed varies depending on the variety of food that is in the barrel, the more varieties of food there are in the barrel, the happier the people will be, and subsequently your reputation will also rise. If variety of food is missing from the barrel, people will go hungry and your reputation will fall concurrently. You must replenish the barrel to stop this.\n<br />\n<br />You can import food from other cities until you establish a self-sustainable level of consumption, just talk to Goldur to establish trade connections and import food. To achieve a balanced level of consumption you need to build buildings that produce foods such as the Hunter’s Guild and Wheat Farms that produce food daily and deposit food in the barrel directly.\n<br />\n<br />Not all types of foods are consumed by the people, check the list of food added to the barrel.\n<br />\n<br />\n<br />\n<br />\n<br />[b][size=3]Management of Prison[/size][/b]\n<br />\n<br />There are a variety of actions available to perform on imprisoned citizens. You can execute, torture, collect bribes, leave prisoners trapped, put them in the cage, pardon crimes as and when desired, but depending on their crime and your attitude, this decision making can affect your reputation. If you execute serious criminals or RedSkulls nobody will oppose it, but if you execute a petty thief who stole vegetables because they were hungry this will make mobs of your populace!\n<br />\n<br />[b][size=3]Construction of New Buildings[/size][/b]\n<br />\n<br />New buildings can be built by talking to Icarus. New buildings earn extra revenue, deposited in your chest. Buildings will also enable you to produce products that can be exported, as well as food for your citizens. Any generated food or revenue will be deposited as normal in Goldur’s Barrel or the Treasury chest.\n<br />\n<br />For each new building you build, you will be able to monitor exactly which buildings produce income, food or export products. The following buildings are available for construction:\n<br />\n<br />\n<br />1 - Shed of animals (available for construction from the beginning from Goldur, its income is deposited in the office after purchase)\n<br />\n<br />The following are available from Icarus after completing the quest:\n<br />\n<br />2 - Wheat Farm.\n<br />\n<br />3 - Smelter\n<br />\n<br />4 - Arena.\n<br />\n<br />5 - Iron Mine.\n<br />\n<br />6 - Cheese House\n<br />\n<br />7 - Hunter Guild.\n<br />\n<br />\n<br />[b][size=3]Import and Export[/size][/b]\n<br />\n<br />You can import food for the people by talking to Goldur. You can also export the products produced by Ivarstead, by putting them in the export chest and talking with Goldur.\n<br />\n<br />\n<br />\n<br />[b][size=3]Feast and Events[/size][/b]\n<br />\n<br />You can organize feasts in the Feast Hall, and events in the arena, just talk to staff at the arena or around the throne. If events like feasts and arena matches are paid for by you, this will increase your reputation – if you steal from the public purse to pay for these events, this will degrade your reputation. The event lasts 12 hours and will end automatically at the end of this period.\n<br />\n<br />[b][size=3]Hire new servants[/size][/b]\n<br />\n<br />You can hire new servants by talking to Arnold; they will attend court feasts and dinners that you host. You will have the option to employ the following:\n<br />\n<br />1 – Court Mage\n<br />2 - Blacksmith.\n<br />3 - Two Cooks.\n<br />4 - Two Servants.\n<br />\n<br />[b][size=3]New Companions[/size][/b]\n<br />After completing the quest you can hire new guards and companions. Four new followers will be available in the barracks at your disposal; they are your bodyguards and are active members of your court.\n<br />\n<br />[b][size=3]New Amors[/size][/b]\n<br />\n<br />Two sets: Guard of Ivarstead armor you can forge in Iron, and Jarl armor you can take in secret passage of jarl bedroom  when you end quest.\n<br />\n<br />[b][size=3]Installation[/size][/b]\n<br />\n<br />1 - You can use nexus mod manager.\n<br />2 - Or simply download the file, extract anywhere, then cut and paste all included files to the “Data” folder in your Skyrim installation directory.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />(can cause freezes and falls, especially at parties of court you can try change the load order to try to use two mods)\n<br />\n<br />\n<br />[color=yellow][size=4][b]-Troubleshooting:[/b][/size][/color]\n<br />\n<br />[size=3][b]1. If Goldur's dialog does not show:[/b][/size]\n<br />\n<br />Save your game while standing next to Goldur.  Then load your game save that you just made and speak to him again, his dialog should now load.\n<br />\n<br />[size=3][b]2. If NPC voices sound too loud:[/b][/size]\n<br />\n<br />Go to optional files, download the \"Voices_More_Low_Volume\" file. Courtesy of Gerakus!\n<br />\n<br />[size=3][b]3. If your FPS is low or drops at \"X\" location:[/b][/size]\n<br />\n<br />I have placed many new objects in Ivarstead and around the castle. Because of this, there will be some FPS loss for some people. We like to run ENB/Flora/HD Textures/Water/Grass type mods that make our Skyrim look awesome. This is great but does come with a price, so I suggest one or both of the following mods.\n<br />\n<br />[url=http://www.hialgo.com/TechnologyBOOST.html]Try this[/url]\n<br />and/or\n<br />[url=http://www.nexusmods.com/skyrim/mods/12801/?]Try this[/url]\n<br />\n<br />Both files help with game performance and improve FPS.\n<br />\n<br />[size=3][b]4. If you're experiencing CTD'S or freezing:[/b][/size]\n<br />\n<br />Try this&gt;[url=http://www.nexusmods.com/skyrim/mods/50305/?]Very recommended[/url]\n<br />\n<br />Make sure you have the latest version of Skyrim. Try the above two mods, possible FPS or uncompressed graphics causing your machine to work overtime or all the graphic enhancing mods you're running could be the issue. You can also adjust my mod up or down in the load order as you see fit to avoid any possible conflicts with your other mods.\n<br />\n<br />[size=3][b]5. If you're wondering if this mod compatible with \"X\" mod:[/b][/size]\n<br />\n<br />Any mod that modifies Ivarstead and locations around it, there is a big chance of conflict issues. I don't have a list of all the mods that may or may not conflict, I would just use common sense when installing mods. First backup your game Data file then install my mod and test it out.\n<br />\n<br />[color=red][size=3][b]6. If you used the console and you now have \"X\" problem:[/b][/size][/color]\n<br />\n<br />First off, don't be a cheater. Secondly, this mod has a script and triggers that you need to follow. If you have found yourself somewhere and your quest is broken because you used the console, just reload a save before you used the console and read the guide for help, thank you.\n<br />\n<br />\n<br />[center][color=Yellow][b][size=3]I want to to say THANKS to all, that have endorsed, voted, donated and supported my work – you're the best! :D[/size][/b][/color][/center]\n<br />\n<br />1.3 update.\n<br />\n<br />Some of the changes may take a few days until work properly.\n<br />\n<br />1- Music bug should now be fixed.\n<br />2- Freezing during hosting a party in the castle should now be fixed.\n<br />3- Vilja the follower is now compatible.\n<br />4- I improved the removal of system music upon exiting. If you exit the arena  or castle during events, the music should now stop for that event.\n<br />5- Removed the useless lever in the treasure room.\n<br />6- Added an optional ESP file with reworked textures with lower detail to improve FPS.\n<br />\n<br />\n<br />1.2 Released\n<br />\n<br />1- Fix navmesh follower bug in when enter or exit  in Ivarstead.\n<br />2- Now disable light outside FalconNest and Ivarstead  during day (improve fps)\n<br />3- Removed witch head in fort Redskull  that start companion quest.\n<br />4- Should be better compatibility with other mods.\n<br />5- Optional file Dark lights in FalconNest castle to evil characters.\n<br />5- Other minor fix.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[b][size=3]Credits[/size][/b]\n<br />\n<br />Translation\n<br />Cristiane Bouger (translation from Portuguese to English.)\n<br />\n<br />Sr. Aarchduke  (translation my poor English to good English.)\n<br />[url=http://www.nexusmods.com/skyrim/mods/34234/?tab=1&amp;navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D34234%26preview%3D&amp;pUp=1]Your good music mod[/url]\n<br />\n<br />Music\n<br />Kevin MacLeod\n<br />\n<br />[url=http://incompetech.com/music/royalty-free/index.html?feels%5B%5D=Humorous&amp;page=1]Your site[/url]\n<br />\n<br />Voice Actors\n<br />\n<br />Sage Halo (Captain Magnus)\n<br />Randy Westbrook(Arnold the steward)\n<br />Joe Winters(farmer type01) \n<br />Harry Tinkler(Goldur) \n<br />Rilith the Rogue (Icarus &amp; Guards)\n<br />Serithi (prisoner &amp; worker)\n<br />Andre Oseguera(Worker type02) \n<br />Jonathan Pegher(alert man arena &amp; court)\n<br />Anders Jakob Sivesind (Farmer type02)\n<br />JT Decker(Main Goldur)\n<br />\n<br />Beta Testers\n<br />Ivan \"Corvius\" Leal\n<br />Amalurian\n<br />Yang Leon\n<br />Noah Bordsen\n<br />\n<br />Razvanoprisa\n<br />\n<br />Jaexxx\n<br />\n<br />GhostAgent\n<br />\n<br />Darkomen0620\n<br />\n<br />PhillipWireland\n<br />\n<br />\n<br />Support\n<br />\n<br />Luan Vecchi Ferreira\n<br />\n<br />Tomnl\n<br />\n<br />BILWIT\n<br />\n<br />OMEGARED99\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/10277/?]Omegared Armor Pack[/url]\n<br />\n<br />natilde to Girls of Ivarstead expansion.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/24495/?]to Girls[/url]\n<br />\n<br />\n<br />Donker316\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/27301/?]Donker Armor Pack[/url]",
  "categoryId": "53",
  "version": "1.4",
  "author": "Locaster",
  "createdUnix": "1393686765",
  "updatedUnix": "1509608373",
  "containsAdultContent": false,
  "uploadedBy": "Locaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099243",
      "name": "BecomeJarlOfIvarstead_1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "379576",
      "fileName": "BecomeJarlOfIvarstead_1_0-51633-1-0.rar",
      "uploadedUnix": "1393668516",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeJarlOfIvarstead_1_0-51633-1-0.rar?fid=1000099243&ttl=1535834135&ri=8192&rs=8192&setec=fb173f4d4845ea79d883d8f5a46a39f9"
    },
    {
      "fileId": "1000099472",
      "name": "BecomeJarlOfIvarstead_1_1_FixDialogs",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1334",
      "fileName": "BecomeJarlOfIvarstead_1_1_FixDialogs-51633-1-1.rar",
      "uploadedUnix": "1393776593",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3ebafa4e2efc9396218f14a76f7a5e5f051a649a71e833f1ec784da1d0422af5/analysis/1407956898/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeJarlOfIvarstead_1_1_FixDialogs-51633-1-1.rar?fid=1000099472&ttl=1535834135&ri=8192&rs=8192&setec=519cdb0235fa779f4f5a1a9f1e1b667c"
    },
    {
      "fileId": "1000099496",
      "name": "BecomeJarlOfIvarstead_1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "379575",
      "fileName": "BecomeJarlOfIvarstead_1_1-51633-1-1.rar",
      "uploadedUnix": "1393786447",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeJarlOfIvarstead_1_1-51633-1-1.rar?fid=1000099496&ttl=1535834136&ri=8192&rs=8192&setec=9c02d9697922eec3c63dc4f92bbe41c3"
    },
    {
      "fileId": "1000100009",
      "name": "GuardVoiceTest",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8537",
      "fileName": "GuardVoiceTest-51633-1-2.rar",
      "uploadedUnix": "1394068212",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a81b8670e0d515aee504b28ec6fe94c62c8fba86f3a78a49a0661b010830653c/analysis/1407961907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GuardVoiceTest-51633-1-2.rar?fid=1000100009&ttl=1535834136&ri=8192&rs=8192&setec=637378679043d74fb86199e5f8a60a4a"
    },
    {
      "fileId": "1000100218",
      "name": "BecomeJarlOfIvarstead_1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "379578",
      "fileName": "BecomeJarlOfIvarstead_1_2-51633-1-2.rar",
      "uploadedUnix": "1394205602",
      "modVersion": "1.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeJarlOfIvarstead_1_2-51633-1-2.rar?fid=1000100218&ttl=1535834137&ri=8192&rs=8192&setec=eb5137335fe05c336a200d0d762a9da1"
    },
    {
      "fileId": "1000100224",
      "name": "BecomeJarlOfIvarstead_1_2_Dark_Lights",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1340",
      "fileName": "BecomeJarlOfIvarstead_1_2_Dark_Lights-51633-.rar",
      "uploadedUnix": "1394206846",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/dda74dc825c117f38068b567ce74c0361cb197833c860eb5d89c2c1ce1e1677b/analysis/1407963791/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeJarlOfIvarstead_1_2_Dark_Lights-51633-.rar?fid=1000100224&ttl=1535834137&ri=8192&rs=8192&setec=35190be2002de989f4910474c97c4e22"
    },
    {
      "fileId": "1000100301",
      "name": "Voices_More_Low_volume",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "304028",
      "fileName": "Voices_More_Low_volume-51633-.rar",
      "uploadedUnix": "1394258719",
      "modVersion": null,
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Voices_More_Low_volume-51633-.rar?fid=1000100301&ttl=1535834138&ri=8192&rs=8192&setec=2cbee706c053e26d82aa78606c9ed43e"
    },
    {
      "fileId": "1000100882",
      "name": "BecomeJarlOfIvarstead_1_3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "379709",
      "fileName": "BecomeJarlOfIvarstead_1_3-51633-1-3.rar",
      "uploadedUnix": "1394589256",
      "modVersion": "1.3",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeJarlOfIvarstead_1_3-51633-1-3.rar?fid=1000100882&ttl=1535834138&ri=8192&rs=8192&setec=87710e7a7b3cb6befcf67bef4e1b4d8b"
    },
    {
      "fileId": "1000100883",
      "name": "BecomeJarlOfIvarstead_1_3_LOW_DETAIL_MORE_FPS",
      "version": "1.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1334",
      "fileName": "BecomeJarlOfIvarstead_1_3_Fix-51633-1-3.rar",
      "uploadedUnix": "1394590828",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/dbd0b718f4d909181619adf11a10893aa9f7961614c8bbcd25614b2dd78414ce/analysis/1407978846/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeJarlOfIvarstead_1_3_Fix-51633-1-3.rar?fid=1000100883&ttl=1535834139&ri=8192&rs=8192&setec=b1b4d94d7e935824f7c09e64179f6dd9"
    },
    {
      "fileId": "1000102888",
      "name": "GirlsOfIvarsteadExpansionV_1_4",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "115982",
      "fileName": "GirlsOfIvarsteadExpansion-51633-1-4.rar",
      "uploadedUnix": "1396121272",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/5f68d4b7d6f0bb2b5378652d1cccbd24040ece2f78dfdebae76373b6f355504f/analysis/1407999447/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GirlsOfIvarsteadExpansion-51633-1-4.rar?fid=1000102888&ttl=1535834139&ri=8192&rs=8192&setec=29ecac30bbfcc6e264fdd56bc1ba433d"
    },
    {
      "fileId": "1000258522",
      "name": "TesterFile",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "340749",
      "fileName": "TesterFile-51633-1-0.rar",
      "uploadedUnix": "1509349513",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TesterFile-51633-1-0.rar?fid=1000258522&ttl=1535834140&ri=8192&rs=8192&setec=a3eb5f35313c315b37bbcd7a39bdc46b"
    },
    {
      "fileId": "1000258727",
      "name": "TesterFile02",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51358",
      "fileName": "LC_LandLordArmorV1.0.rar-51633-1-0.rar",
      "uploadedUnix": "1509608373",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6ee4f65dcd7ad3fb052df716a6501ae1824c5495f6d845807a5b30ff2d3b58bd/analysis/1509608408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LC_LandLordArmorV1.0.rar-51633-1-0.rar?fid=1000258727&ttl=1535834140&ri=8192&rs=8192&setec=6e086ed88f9202293db86c59b96b53f5"
    }
  ]
}