{
  "modId": 51642.0,
  "modName": "ElucidatorKIRITOLEVELPOWER",
  "summary": "this is a revamp version of RafaelDeJongh&#39;s Elucidator.",
  "descriptionHtml": "Hello guys, it&#39;s SammyEversong again with my second mod.\r<br />First and foremost I want to thank RafaelDeJongh very much for allowing me to use his Elucidator mod and making this OP version ( since I do not know how to custom make meshes and textures yet, I am grateful he allowed me to create this mod). *NOTE: To make this mod work, you must download RafaelDeJongh&#39;s Elucidator mod first and then download this mod and load it after.\r<br />\r<br />Now, why would you go through all this trouble for this Elucidator version?\r<br />Well, in SAO, the Elucidator is a powerful weapon and is very heavy. Likewise, this weapon is very heavy with a weight of 100, however with a base damage of 60. Also it has a special enchantment that ignores all armor, nearly OHK all enemies. I would like to warn that is weapon is very powerful and only recommended for high level users fighting power enemies (ie: you have Deadly Dragons cranked to maximum *cough* *cough* Jarred). However, on the downside, it swings very slowly. In the near future I hope to create Dark Repulser and it will cure this problem. But in the meantime, just use Elemental Fury shout or something to increase your melee speed if it really bugs you how slow it is.\r<br />Weapon Stats;\r<br />Base Damage&#39;:60\r<br />weight:100\r<br />reach:1.0000\r<br />speed:0.8000\r<br />To Craft:\r<br />1 Ebony Sword, 3 Daedric Hearts, 3 Black Soul Gems (empty)\r<br />*NOTE: you must also have the Daedric Smithing perk, Arcane Smithing perk, have Armsman (max rank) to at least 80 skill, and have Destruction Master perk (with, well, obviously at least 100 skill).\r<br />It is the price you pay for a OP weapon.\r<br />To Temper:\r<br />1 Dragon bone, 1 Dragon scales\r<br />\r<br />If you want pictures check out RafaelDeJongh&#39;s elucidator ( you need to download it anyway), they look exactly the same.",
  "categoryId": "55",
  "version": "",
  "author": "SammyEversong",
  "createdUnix": "1393690298",
  "updatedUnix": "1393690290",
  "containsAdultContent": false,
  "uploadedBy": "SammyEversong",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099287",
      "name": "ElucidatorKIRITOLEVELPOWER",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "ElucidatorKIRITOLEVELPOWER-51642-.zip",
      "uploadedUnix": "1393690290",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/38bf489fb38317cf3afa0d3111f019d652d8fd58ebb85c58b1a0b607491b4124/analysis/1407955277/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ElucidatorKIRITOLEVELPOWER-51642-.zip?fid=1000099287&ttl=1535834178&ri=8192&rs=8192&setec=16469396168985ba9738112d645a68b9"
    }
  ]
}