{
  "modId": 51655.0,
  "modName": "Into the deep Atlantis",
  "summary": "The epic journey Into the deep Atlantis has finally been released to Skyrim Nexus. Very hard dungeon mod that contains, new environment, fast paced gameplay, new traps, enemy&#39;s, and much more. ",
  "descriptionHtml": "Into the Deep “Atlantis” \r<br />By DJ \r<br />Discover the unknown in one of the largest dungeons ever made, journey into the most dangerous place in Skyrim. A great evil lurks in the lost city; your ability will be tested. \r<br />\r<br />Start your Journey on a ship right outside the Dawnstar Sanctuary. \r<br />No DLC packs required&#33; \r<br />\r<br />From the maker of Gersonia. \r<br />\r<br />Into the deep “Atlantis features” A new type of environment and varying gameplay for each section of the city. You will be fighting new monsters such as Mermen, Goblins, Witches, Fire Demons, and even take on Hades along with his minions. \r<br />\r<br />Atlantis also has new types of trap contraptions such as \r<br />- Self-Destructing chambers \r<br />- Obstacle courses \r<br />- Resetting Boulders \r<br />- Self triggering Trap activation \r<br />- Whirlpools of death \r<br />- Magma \r<br />- And much more&#33; \r<br />\r<br />Atlantis also includes \r<br />- New AI and Bosses \r<br />- Greek architecture \r<br />- 10 Major Chambers along with a few smaller ones \r<br />- Familiar AI such as Bandits, Mages, and other creatures. \r<br />- New weapons \r<br />- Reward at the end. \r<br />- Puzzles \r<br />\r<br />This journey takes around 3-4 hours to complete, depending on the difficulty. Novice is still very hard, I would recommend it for low levels under 50. Save often as death awaits you around every corner. \r<br />\r<br />Quest background \r<br />Legends say Atlantis was one of the greatest cities in the ancient world. Atlantis consisted of moral spiritual people who lived in a highly advanced Utopian society. As time went on the citizens of Atlantis became greedy, later on, they became morally bankrupt. The gods punished the city by casting it to the bottom of the sea. Atlantis is now among one of the most cursed and dangerous places to ever venture. Hades claimed the city, and the cursed have sided with him. It is your job to wipe the city clean of evil and let the city rest in peace. \r<br />\r<br />Tips for the quest. \r<br />- use the bow to shoot pressure plates that will active traps \r<br />- make sure you pick up a question sheet before you get to the enclosed levers, match the question number with the number above the lever entrance. \r<br />- when you fight the boss make sure you sneak around and takeout all of Hades minions before your try to kill Hades. \r<br />\r<br />Update 1 - Boss is harder to kill and more aggressive \r<br />- fixed clothing glitch. \r<br />- improved nav mesh \r<br />- undead is now active. \r<br />\r<br />\r<br />\r<br />Caution: Some Conflicting mods may interfere with game play. \r<br />\r<br />For anyone who has seen Skyrim mods by MMOxReview, the creatures are not nude&#33;&#33;&#33; \r<br />He must have had a mod that made the creatures appear naked.\r<br />\r<br />\r<br />Please let me know if you have any questions, or things you want me to fix. ",
  "categoryId": "88",
  "version": "",
  "author": "David Montecalvo",
  "createdUnix": "1394990858",
  "updatedUnix": "1394988779",
  "containsAdultContent": false,
  "uploadedBy": "djmonte",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101415",
      "name": "Into the Deep Atlantis",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1120",
      "fileName": "Into the Deep Atlantis-51655-.rar",
      "uploadedUnix": "1394988779",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4f80b256a6370326e504bf8183a42c6f4a78772311ec8005dae3730c3ff6afd5/analysis/1407984523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Into%20the%20Deep%20Atlantis-51655-.rar?fid=1000101415&ttl=1535834200&ri=8192&rs=8192&setec=79689fdf445859b18604d3c78ef6454b"
    }
  ]
}