{
  "modId": 51708.0,
  "modName": "Les livres du lore ont pas de poids - Fr",
  "summary": "Ce petit mod de 2 mo met le poids des livres du lore à 0 kg. -It&#39;s a french mod-\r<br />L&#39;intérêt de ce mod est de permettre de garder les livres sur soi sans encombrement, pour ceux qui tout comme moi aiment pouvoir lire n&#39;importe où et n&#39;importe quand, et/ou pour les collectionneurs. ",
  "descriptionHtml": "[b][u]NOTE TO ENGLISH SPEAKERS[/u][/b] : It&#39;s a french mod, and what it does is to set the weight of books to 0, but if you install it all your books will get translated in french. So use the following mod if you want a similar english mod : [url=http://steamcommunity.com/sharedfiles/filedetails/?id=7583]http://steamcommunity.com/sharedfiles/filedetails/?id=7583[/url]\r<br />The mod linked above belongs to someone else, however my mod has been made by myself with the CK so it&#39;s NOT a translation of the mod above or any other mod.\r<br />\r<br />[heading]|| Présentation :[/heading]\r<br />Ce petit mod de 2 mo met le poids des livres du lore à 0 kg. \r<br />L&#39;intérêt de ce mod est de permettre de garder les livres sur soi sans encombrement, pour ceux qui tout comme moi aiment pouvoir lire n&#39;importe où et n&#39;importe quand, et/ou pour les collectionneurs. \r<br />\r<br />[b]Remarque[/b] : Ce mod est en français et mettra donc les livres en français dans le cas où joueriez dans une autre langue. Voici un mod en anglais avec la même fonction (mais qui n&#39;est pas de moi) : [url=http://steamcommunity.com/sharedfiles/filedetails/?id=7583]http://steamcommunity.com/sharedfiles/filedetails/?id=7583[/url]\r<br />\r<br />\r<br />[heading]|| Pour aller plus loin (explications optionnelles) : [/heading]\r<br />Ce petit mod met le poids des livres à 0 kg mais il y a deux exceptions : \r<br />\r<br />-D&#39;abord les livres des sorts qui restent à 1 kg (poids par défaut) pour une question de role-play étant donné que ceux-ci affectent directement le gameplay; \r<br />\r<br />-Ensuite les livres (ou cartes au trésor/notes/lettres) déclencheurs de quêtes/d&#39;évênements ainsi que les livres donnant des bonus de compétences, tout ceux-là sont à 0,1 kg afin de vous permettre de les différencier et de les reconnaître. \r<br />Tous confondus, ces manuscrits à 0,1 kg sont au nombre de 115. Soit 11,5 kg au total si vous gardez un exemple de chaque, ce qui n&#39;est pas génant pour jouer. \r<br />\r<br />Le reste est à 0 kg, étant donné que ça n&#39;affecte pas le gameplay vu que ça ne concerne en général que le background du jeu (je ne veux pas trop gêner les amateurs de role-play, étant un moi-même malgré ce mod). \r<br />\r<br />Note : Certains livres/notes/lettres de quêtes sont à 0 kg (toujours pour une question de place, mais vous n&#39;avez pas besoin de les différencier vu que ce sont des objectifs de quêtes et qu&#39;ils seront donc marqués. \r<br />\r<br />\r<br />[heading]|| Informations supplémentaires : [/heading]\r<br />J&#39;ai réalisé ce petit mod car les seuls autres mods dans le genre (par exemple [url=http://steamcommunity.com/sharedfiles/filedetails/?id=7583]Weightless Books[/url]) sont en anglais et donc les livres aussi (pas pratique pour les non-anglophones). J&#39;ai donc fait ce mod pour ma propre envie, mais je le partage ici dans le cas-où ça intéresserait quelqu&#39;un d&#39;autre &#33; \r<br />\r<br />Je conseille (ce n&#39;est pas du tout obligatoire) d&#39;utiliser en plus le mod [url=http://skyrim.nexusmods.com/mods/19008/]Deja Vu - I Already Read It[/url] qui marque les livres comme &#39;lu&#39; une fois qu&#39;ils sont ouverts (pratique pour repérez les livres que vous n&#39;avez pas encore).\r<br />\r<br />\r<br />Il ne devrait n&#39;y avoir aucun soucis de compatibilité ou de bugs vis-à-vis des autres mods, celui-ci ne touchant qu&#39;au poids des livres et rien d&#39;autre. Comme je l&#39;ai indiqué dans la remarque en début de description, le seul éventuel &#34;problème&#34; que vous pourriez rencontrer, c&#39;est que ce mod mettra vos livres en français si votre jeu est dans une autre langue. \r<br />\r<br />Il est d&#39;ailleurs compatible avec [url=http://www.nexusmods.com/skyrim/mods/4277/]Better Sorting - French[/url] puisqu&#39;il ne modifie pas les livres de sort. \r<br />\r<br />Merci d&#39;avoir lu jusqu&#39;ici et d&#39;avoir installé ce mod, bon jeu à tous &#33; \r<br />\r<br />\r<br />Lien Steam Workshop : [url=http://steamcommunity.com/sharedfiles/filedetails/?id=163830092]http://steamcommunity.com/sharedfiles/filedetails/?id=163830092[/url]\r<br />\r<br />// Tags : livres, lore, poids, 0, pas, fr, français, french, books, weightless, weight, less, null, zero, mod",
  "categoryId": "98",
  "version": "1.0",
  "author": "Lurihaut",
  "createdUnix": "1393816087",
  "updatedUnix": "1393854543",
  "containsAdultContent": false,
  "uploadedBy": "Lurihaut",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099656",
      "name": "Les livres du lore ont pas de poids",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "708",
      "fileName": "Les livres du lore ont pas de poids-51708-1-0.rar",
      "uploadedUnix": "1393854543",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/64142075386880df96cc612767300ea9bfacd9c87490a5e88bacfa6ac32f7b89/analysis/1407958389/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Les%20livres%20du%20lore%20ont%20pas%20de%20poids-51708-1-0.rar?fid=1000099656&ttl=1535834281&ri=8192&rs=8192&setec=ba0e09255b3dc9d3000f9d2cc5890371"
    }
  ]
}