{
  "modId": 51719.0,
  "modName": "Vladamares Merchandise",
  "summary": "==Vladamare&#39;s Merchandise and Living space V1.1== \r<br />\r<br />==(Location) Just below Whiterun Map markered as a Shack== \r<br />\r<br />This is a Mod for starter Characters and Advanced Characters. \r<br />The Mod contains a living space that has your own personal \r<br />storage and a perfectly good merchant that pretty much sells \r<br />everyt",
  "descriptionHtml": "==More about the Merchant== \r<br />The Merchants name is called Vladamare and he is a trader \r<br />that has spent half of his life travelling across tamriel to sell \r<br />his goods. The Merchant contains: \r<br />Enchanted armor and non enchanted armor \r<br />Enchanted Weaponry and non enchanted waeponry \r<br />ingrediants \r<br />Pelts \r<br />Enjoy the merchant now he is in your game. \r<br />\r<br />==More about the Living Space== \r<br />This will be your new home if you subscribe. The current \r<br />room contains chests for storage and an inheritance chest \r<br />that will require your lockpicking skills being put to the test \r<br />but once you open this chest of inheritance you will recieve \r<br />5000 gold pieces just waiting there for you to pick up. Also \r<br />the Living Space contains an enchantment table and alchemy \r<br />bench. In this living space there is unlimited storage for you \r<br />so your Overencumberedness will never effect you again. \r<br />\r<br />== Note to player == \r<br />\r<br />Any argumentitive,Abusive or trolling comments will be removed,i welcome all comments that are \r<br />helpful and positive to the mod but not ones that are just complaining about nothing. \r<br />\r<br />==Future== \r<br />There will be future updates for this mod as i am not done \r<br />with it. Just keep your eyes open for the next update for \r<br />this mod. \r<br />\r<br />\r<br />Please rate and favourite this mod i think everyone will enjoy it \r<br />this mod requires no DLC yet, as it may in the future. \r<br />\r<br />==Update V1.1== \r<br />The new update contains several new features like: \r<br />Redecoration of the shop inside and out \r<br />2 new merchants a blacksmith and a thief \r<br />New follower added \r<br />\r<br />The follower \r<br />the follower is a hunting archer/onehanded type of follower which will fight for \r<br />you until death. It is a Female Wood elf with level 5-50 so it can start leveling \r<br />up along side of you. \r<br />\r<br />The 2 new merchants \r<br />there has been 2 new merchants been added in this mod a blacksmith which \r<br />sells all the basic ingots and other ingots. However there is a thief in town a \r<br />merchant that sells a set of armor which have basics of stealth and weaponry \r<br />and more but with this merchant you can sell your stolen goods. \r<br />\r<br />Redecoration \r<br />The house has been completely redecorated to make sure the house dosent \r<br />look too plain added more static items and storage in the bedroom. Outside \r<br />the house it has also been decorated with static barrels, cart and more. Also \r<br />the thief merchant is sat on the chair just outside the entrance. \r<br />\r<br />No DLC is needed for this update as it may in the future. \r<br />\r<br />Credit for the update \r<br />I would like to give thanks to EvilMrPumpkins for helping with the new decorations \r<br />and the merchants. I give thanks to him for tester the update before release Check \r<br />out his mods the link is above.",
  "categoryId": "69",
  "version": "1.1",
  "author": "TESLEGEND98",
  "createdUnix": "1393844148",
  "updatedUnix": "1393844148",
  "containsAdultContent": false,
  "uploadedBy": "TESLEGEND98",
  "primaryFile": null,
  "files": []
}