{
  "modId": 51732.0,
  "modName": "Basic Argonian follower",
  "summary": "This is my very first attempt at modding so don&#39;t be too harsh. He&#39;s very basic, probably the most basic you can make.",
  "descriptionHtml": "J&#39;ram-Zaw is my Skyrim character. Because I&#39;m a massive n00b when it comes to modding, I couldn&#39;t add his modded war paint and eyes. Being the big roleplay fan I am, here&#39;s his backstory.\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;J&#39;ram-Zaw was born in Skyrim, his parents had moved there because they wanted a change of scenery from Black Marsh. As a child, he was rather aggressive and would always get into fights with the other kids, usually breaking some noses or dishing out a fair amount of bruises. When he was about to become a man, he moved out of his parent&#39;s house in Winterhold and began travelling. Despite growing up very close to the College of Winterhold, he dislikes magic a lot and instantly gained a love for heavy weaponry, specifically bladed weapons such as battleaxes and greatswords. He also trained under the smithy for a time and gained sufficient skill to craft himself some decent armour. J&#39;ram-Zaw began his travels in Skyrim and soon met a Khajiit by the name of Inigo. They quickly became friends and J&#39;ram-Zaw tried to help Inigo recover from his Skooma addiction while they both took on mercenary roles. Unfortunately, Inigo&#39;s addiction wasn&#39;t as easy to get rid of and he accidentally incapacitated J&#39;ram-Zaw, thinking he meant to kill Inigo and take all the money from their current contract. However, the Argonian survived and continued on his journey. He is currently resting at the Bee & Bard in Riften.\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;Yes, I know I added another mod to his backstory and the link to that mod will be at the bottom of this description. If the mod author for Inigo tells me to remove him, I&#39;ll do so. As I said before, I am extremely new to modding and this is something I did with the help of BestIn Slot&#39;s Creation Kit tutorial videos. I hope to become better at modding and maybe giving J&#39;ram-Zaw a custom voice. Thank you for taking the time to try out this mod and I hope you enjoy it. Personally, I saw a severe lack of Argonian followers in the game which is a shame because I love Argonians. I may make some more followers so stay tuned. \r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;RECOMMENDED MODS:\r<br />&lt;br /&gt;&lt;br /&gt;Drachis Argonian Mod: http://www.nexusmods.com/skyrim/mods/981/?\r<br />&lt;br /&gt;&lt;br /&gt;Argonian Raptor Feet: http://www.nexusmods.com/skyrim/mods/19283/?\r<br />&lt;br /&gt;&lt;br /&gt;Inigo: http://www.nexusmods.com/skyrim/mods/40960/?\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;Props to BestIn Slot for his tutorial videos: http://www.youtube.com/channel/UCWB212HLA4MyZBpn0qlBpXA\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;",
  "categoryId": "96",
  "version": "",
  "author": "xJester13x",
  "createdUnix": "1393882727",
  "updatedUnix": "1393882714",
  "containsAdultContent": false,
  "uploadedBy": "Jesterpain13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099709",
      "name": "Jram-Zaw",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Jram-Zaw-51732-.rar",
      "uploadedUnix": "1393882714",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ec4509d66872783b3203769782f5d28e7186fd8643d0a03b2ec37e090ce6c5a7/analysis/1407958993/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jram-Zaw-51732-.rar?fid=1000099709&ttl=1535834320&ri=8192&rs=8192&setec=a3594f2d574ffa74bf0bce33cb057444"
    }
  ]
}