{
  "modId": 51741.0,
  "modName": "One handed balance overhaul",
  "summary": "I don&#39;t know from wish version, but one of Skyrim&#39;s patch make in sort that your attack power double when dual wielding. See more information inside.",
  "descriptionHtml": "WARNING: The mod will work as long as you don&#39;t improve the weapon. If you improve it, the dual wield option will be as OP than without the mod at the exception of losing 3 merely attack power.\r<br />\r<br />Before downloading, note that the mod require both dawnguard and dragonborn dlc. I don&#39;t know from wish version, but one of skyrim&#39;s patch make in sort that your attack power got doubled when dual wielding with 1H weapon. Making in sort that the dual wielding option is way too overpowered and completly unbalanced versus other weapon.\r<br />\r<br />What this mod does:\r<br />It reduce the attack power of every one handed weapon to be equal as half of their version of two handed. For example, if we take the daedric Warhammer who have 27 base attack power, the original Daedric mace have 16 base damage power X2 if you dual wield for a total of 32 base attack power for a difference of 5 base attack power, and the difference can easily get tripled if you&#39;re level 100 and have every available perk in 1H skill tree. And hell, i&#39;m not even considering the fact that you can improve them with smithing and get big value if you max the possibility (like combining fortify smithing with enchant and alchemy, i&#39;ve already got a dragonbone mace of 182 damage only by improving it, without even adding fortify one handed enchant on it) making in sort that the difference really can get enormous with this taken in account. Oh and 182 damage... it&#39;s just for one mace. EH. you see the problem now?\r<br />\r<br />This mod reduce the base attack power of the daedric mace to 13.  it does the same thing with sword, waraxes to every type (from the iron, to the dragonbone). This way, a dualwielding warrior will have the same attack power than a 2H warrior at the exception that the dual wield warrior can&#39;t block and attack faster than the 2H warrior. And it work with the combinaison 1H/shield too, you will do half less damage but you will attack faster and everyone know that shield block more damage than 2H weapon. Plus the fact that with a perk, you can &#34;block&#34; 50% of elemental damage that only work with shield.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Kevin Nadeau",
  "createdUnix": "1393933210",
  "updatedUnix": "1393933204",
  "containsAdultContent": false,
  "uploadedBy": "lquebecois",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099759",
      "name": "One handed weapon balance overhaul",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "One handed weapon balance overhaul-51741-.rar",
      "uploadedUnix": "1393933204",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4ae904dad845101b570bfc6419cbd2eb22239fe81c9518eb0d30d5422f1e580f/analysis/1407959594/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/One%20handed%20weapon%20balance%20overhaul-51741-.rar?fid=1000099759&ttl=1535834333&ri=8192&rs=8192&setec=008af714f83365c02e1a247c7d3feadb"
    }
  ]
}