{
  "modId": 51765.0,
  "modName": "Charlize Angels - Bringing Justice to Tamriel",
  "summary": "Once upon a time, there were three little girls who went to the Whiterun Guard Academy. They were each assigned very hazardous duties. But I took them away from all that, and they work for me now. My name is Dovahkiin.",
  "descriptionHtml": "[i]This is a follower mod based on my character, inspired by Charlize Theron, and themed after the 70&#39;s television show. If you like this mod, please endorse it, and upload your own shots of the Angels in action. [/i]\r<br />[line]\r<br />[color=#ffffe0][i]&#34;Once upon a time, there were three little girls who went to the Whiterun Guard Academy. They were each assigned very hazardous duties. But I took them away from all that, and they work for me now. My name is Dovahkiin.&#34;[/i][/color]\r<br />\r<br />[color=#ffa500][u][i][b][size=6][font=verdana,geneva,sans-serif]Charlize[/font][/size][/b][/i][/u][/color]\r<br /> \r<br />[color=#add8e6]  Charlize is working a case undercover in the Whiterun Guardhouse. While the guards have guessed that she has stolen someone&#39;s sweetroll (Who could blame her, really. I mean, they&#39;re as big as your head&#33;), she is actually conducting an internal affairs investigation pertaining to corruption within the Guard Captain&#39;s ranks. Commander Caius has allegedly turned a blind eye to the Thieves Guild infiltration of the Guard and allowing incriminating evidence of certain prisoner&#39;s crimes to be stolen from the Steward&#39;s desk. [/color]\r<br />[color=#add8e6]  Born in Hammerfell, her father believed in teaching his daughter to master the sword. Especially curved swords. You heard me. Curved. Swords. While she can handle her own with any two-handed weapon, she prefers the 1H/shield and dual wield 1H approach to combat. Charlize knows that this is a crap assignment. She hopes that the Dragonborn will call on her to join the adventure, and embrace the dangers of Skyrim.[/color]\r<br /> \r<br />[color=#ffa500][size=6][font=verdana,geneva,sans-serif][u][i][b]Katrina[/b][/i][/u][/font][/size][/color]\r<br /> \r<br />[color=#add8e6]  Katrina&#39;s parents had hoped she would want to work the family farm, but the thought of standing around in a small field all day, waiting for someone to come along and steal their wheat to get ingredients for their healing potions just made her sick to her stomach. As a child, she had a natural ability to harness the destructive power of fire, ice and naturally occurring electricity. She fully developed her Destruction Mage abilities under Farengar after she joined the Whiterun Guard.[/color]\r<br />[color=#add8e6]  Currently, she is following up on a tip that someone is selling illegal weapons out of the Drunken Huntsman, a tavern and &#34;hunting shop&#34; that is obviously a front for a dark elf arms dealer. (Seriously, man- If you want to sell weapons in the middle of the night and not tip off the cops, hire a bard to make it look like a legitimate pub). Katrina can&#39;t wait to get out of the Huntsman and away from that obnoxious Azeem creep, who loves to pontificate about his dealings in the Cloud District, but basically lives above a bar. (Katrina has made a note that Azeem&#39;s wife Ahlam has been asking around about how to perform the Black Sacrament)[/color]\r<br /> \r<br />[color=#ffa500][u][i][b][size=6][font=verdana,geneva,sans-serif]Rachelle[/font][/size][/b][/i][/u][/color]\r<br /> \r<br />[color=#add8e6]Rachelle&#39;s father was an Imperial Archer who loved to hunt, and was credited with several kills while protecting the Emperor. During an expedition in the Reach, his unit was attacked by a group of whackjobs living in tents in the wilderness, and took a devastating hit with a Forsworn arrow in the knee, effectively ending his career as an adventurer. (It&#39;s apparently a fairly common injury). Having nothing else to do but gather mountain flowers and monarch butterfly wings for his alchemist wife, he taught his daughter to shoot with exceptional, deadly accuracy. Since then, she never goes anywhere without her father&#39;s Imperial bow and Nord Hero arrows.[/color]\r<br />[color=#add8e6]  Her assignment is in the Bannered Mare in Whiterun. The Barkeep Hulda thinks that Rachelle is there to keep a watchful eye on Whiterun&#39;s playboy &#34;Mikael&#34; so he doesn&#39;t follow Carlotta home again- But Rachelle knows that Mikael is just a milkdrinker and a horrible bard. He won&#39;t even look at Uthgerd because he&#39;s afraid she will beat him like a rented mule. He may have written the guide, but he&#39;s no gentleman. No, her real assignment is to do some reconnaissance on a suspected terrorist named Sinmir, who openly mocks the level of security in Whiterun. She can&#39;t believe that after all of her target practice, honing her skills as an archer, she&#39;s stuck working undercover as a waitress in a tavern where the only thing worse than the music is Saadia&#39;s cooking.[/color]\r<br /> \r<br />[color=#ffa500][size=6][font=verdana,geneva,sans-serif][u][i][b]The Perks and Benefits of the Angels[/b][/i][/u][/font][/size][/color]\r<br /> \r<br />[color=#add8e6]  All the girls are single and available for marriage, and they each pray to Mara not to be married to someone who just wants to stick them in Breezehome cooking all day and running a fake store out of the kitchen. They will keep up with the Dragonborn (speed set at 115) and not slow down your exploration waiting for them. They are also dedicated to your cause, so committing a few crimes on behalf of their Dovahkiin doesn&#39;t bother them at all. They are set for &#34;unaggressive&#34;, so they won&#39;t pick fights you&#39;re not ready for, and will auto-level with you. Being trained as agents, all of the &#34;Angels&#34; have extensive stealth abilities (they will not affect yours) and will not to set off traps when dungeon crawling. Finally, being elite members of the guard, Farengar himself taught them to heal themselves and others, so these girls know how to take care of themselves. They are set to essential, so even the most inexperienced Dovahkiin wont lose them in a mudcrab fight. [/color]\r<br /> \r<br />[color=#ff0000][u][b][size=6][font=verdana,geneva,sans-serif]** Important note**[/font][/size][/b][/u][/color]\r<br /> \r<br />If you want the ladies to look like my screenshots, you need to be using the following mods:\r<br />[LIST]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/24318/?][color=#0066ff]Barbarian Skin by HoneyVanity[/color][/url] - It&#39;s hidden right now while work on V2 is being done. In the meantime, you could use[url=http://www.nexusmods.com/skyrim/mods/28946/?][color=#0066ff] Sporty Sexy Sweat by xs2reality[/color][/url].[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/2812/?][color=#0066ff]Better Females by Bella[/color][/url] (version 3) - If you&#39;re not using it already, you really should give it a try. The Angels wont look good without it.[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/50814/?][color=#0066ff]Scarlet Dawn Armor by jmenaru[/color][/url] - Play around with the other colors available, too&#33;[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/6709/?][color=#0066ff]Dimonized UNP body by dimon99[/color][/url] - CBBE is fine, but I will take UNP over it every time.[/*]\r<br />[/LIST]\r<br />[center][color=#008000][size=6][font=verdana,geneva,sans-serif]ATTENTION:[/font][/size][/color]\r<br />[size=5]A very special thank you to the global Skyrim modding community. \r<br />I had no idea the amount of time and effort it takes to put a mod out there \r<br />until I did it myself. \r<br />I&#39;ve thoroughly enjoyed every minute of playing Skyrim because of all your hard work.\r<br />You people are the best. So for you:[/size]\r<br /> \r<br />[color=#ffffff][size=6][font=times new roman,times,serif]Respect.[/font][/size][/color][/center]\r<br />[center] [/center]\r<br />[center][color=#ffffff][size=6][font=times new roman,times,serif]======[/font][/size][/color][/center]\r<br />=======\r<br />CREDITS\r<br />=======\r<br />[font=&#39;trebuchet ms&#39;, helvetica, sans-serif]- Huge thanks to ZZJay for her [url=http://www.nexusmods.com/skyrim/mods/19623/?]hair packs[/url], the standalone NPC tutorial, and the really, really good advice. Go look at her mods.\r<br />- Apachii for the good advice, more good advice, some direction and a bit inspiration.[/font]\r<br />[font=&#39;trebuchet ms&#39;, helvetica, sans-serif]- Apogee777 for the patient attitude while he walks an idiot though standalone NPC creation. \r<br />- TheFigment for TESVsnip\r<br />- HelloSanta. Couldn&#39;t use your work here, but I wish I could have. Sorry that some people suck. Go download her [url=http://www.nexusmods.com/skyrim/mods/35267/?]Female Textures Renew[/url][url=www.nexusmods.com/skyrim/mods/35267/?][u]al[/u][/url] right now.\r<br />- The Nexus Network. Thanks for keeping it all going, folks.\r<br />- Bethedsa - Seriously, look what you&#39;ve started here. Best RPG ever brought to market. Congrats. Now bring me TES 6.[/font]",
  "categoryId": "96",
  "version": "1.1",
  "author": "Babaloojah",
  "createdUnix": "1394003709",
  "updatedUnix": "1394087099",
  "containsAdultContent": false,
  "uploadedBy": "Babaloojah",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100038",
      "name": "Charlize Angels v1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6305",
      "fileName": "Charlize Angels v1_1-51765-1-1.7z",
      "uploadedUnix": "1394085263",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c2723723e9ff8dce8beb27ae968ad07d7a5d0b579dc94fbb41edd3f247dafd7e/analysis/1407962245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Charlize%20Angels%20v1_1-51765-1-1.7z?fid=1000100038&ttl=1535834363&ri=8192&rs=8192&setec=acf6b00c7535d2a450cfa411ccd0b856"
    },
    {
      "fileId": "1000100040",
      "name": "Charlize Only v1_1",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2692",
      "fileName": "Charlize Only v1_1-51765-1-1.7z",
      "uploadedUnix": "1394086621",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/91e9d982e6b3465a1f4e3dd6cb9b51cdbc399d41b59b79f502904c575f0e17e9/analysis/1407962250/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Charlize%20Only%20v1_1-51765-1-1.7z?fid=1000100040&ttl=1535834364&ri=8192&rs=8192&setec=5799b89bb60b72109bde2fd6e0918949"
    },
    {
      "fileId": "1000100041",
      "name": "Katrina Only v1_1",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1510",
      "fileName": "Katrina Only v1_1-51765-1-1.7z",
      "uploadedUnix": "1394086833",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8d2547d3170e7315c6a8541d7ece38b0c145211c3e4bef6ae3685937b84e543a/analysis/1407962253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katrina%20Only%20v1_1-51765-1-1.7z?fid=1000100041&ttl=1535834364&ri=8192&rs=8192&setec=1544a385553e36a61efd89895e1d77b8"
    },
    {
      "fileId": "1000100042",
      "name": "Rachelle Only v1_1",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2160",
      "fileName": "Rachelle Only v1_1-51765-1-1.7z",
      "uploadedUnix": "1394087099",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/81d610198f109aed75bf227610a200ace0de6cb8b0e9efe6ae053c6e79597f9d/analysis/1407962286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rachelle%20Only%20v1_1-51765-1-1.7z?fid=1000100042&ttl=1535834365&ri=8192&rs=8192&setec=f6f737de9cbff205f62f26dce6f4cc6d"
    }
  ]
}