{
  "modId": 51774.0,
  "modName": "Dawnbreaker glow fix for ENB users",
  "summary": "This file is for ENB users mainly.\r<br />If your dawnbreaker sword resembles the one in the screenshot on the left, this mod will fix it somewhat. \r<br />If you don&#39;t have an ENB installed then you have bigger problems.",
  "descriptionHtml": "There a few different files -\r<br />\r<br /> One for people who have bloom=true in the enbseries.ini and use the default  darkswirls.dds texture (vanilla)\r<br />\r<br /> One for people who have bloom=true in the enbseries.ini and use the Ultimate HD Fire effects Mod (the only fire mod on nexus that uses its own darkswirls.dds texture),\r<br />\r<br />The other file is for users who have bloom=false in enbseries.ini\r<br />\r<br />Only install one of them.\r<br />\r<br />[line]\r<br />This mod has two meshes, nothing else. One for the first-person view of the sword, the other is for the third person view.\r<br />\r<br />If you are using mod organizer, just install it normally.\r<br />\r<br />If you are installing it manually, just unpack the file, and merge the contained meshes folder with the meshes folder in your Skyrim/Data folder.\r<br />\r<br />Requirements:\r<br />1. ENB v 251 & a preset installed.\r<br />2. mindflux&#39;s particle patch.\r<br />3. Your dawnbreaker looks like the one in the screenshot on the left side.\r<br />  \r<br />\r<br />\r<br />Compatibility:\r<br />These meshes utilize the vanilla dawnbreaker mesh; modified from part of mindflux&#39;s particle patch. If you use a custom or modified dawnbreaker mesh, it will be overwritten by this one.\r<br />\r<br />How to fix the first person view of a custom dawbreaker mesh - if my mod is not suitable:\r<br />***First make a backup copy of your dawnbreaker meshes****\r<br />1. Download and install nifscope 1.1.3 [url=http://niftools.sourceforge.net/wiki/NifSkope]Nifscope[/url]\r<br />2. find the 1stpersondawnbreaker.nif in your Skyrim/Data/meshes/weapons/dawnbreaker folder ***First make a backup copy of your dawnbreaker meshes before doing anything else beyond this step****\r<br />3. Open the file using Nifscope\r<br />4. In the BlockList window, Find the NiTriShapes called Dawnbreaker:0[22] \r<br />5. This shape contains properties for the mesh of the entire sword\r<br />6.  2 rows beneath the NiTriShape is the BSEffectShaderProperty\r<br />7. Select it, and navigate downwards in the Block Details window to find a property name called Emissive Multiple.\r<br />8. Doubleclick on the number in that row&#39;s VALUE column to increase or decrease the value depending on whether your blade & hilt are too bright or not bright enough. If your blade and hilt are not lit, increase the value, otherwise, decrease it if your blade and hilt are too bright.\r<br />\r<br />9. In the BlockList, there is a NitriShape called BigGLow01:2[9]. This shape controls the properties for the glow of the central orb/gem in the center of the hilt. Follow steps 6-8 and change the Emissive Multiple to the same value you did in step 8.\r<br />10. Find the NiTriShape called Wisps01:0[7] in the block list window. This controls the rotating ghostly wisps.\r<br />11. Follow steps 6 -8 to find the Emissive Multiple value in the block details window and decrease it significantly if the rotating wisps on your sword are overpowering and too bright. I usually prefer subtle wisps that are barely visible.\r<br />12. Find the NiTriShape called GlowMesh13:0 in the block list window. This shape controls the static circle or halo around the hilt. If it is too bright, you will not notice the nice beams and flashes that emanate from the hilt, instead you will see a static white circle.\r<br />13. Follow steps 6 -8 to find and modify the Emissive Multiple in the Block Details window if the GlowMesh is too bright.\r<br />14. Find the NiTriShape Flash08 [16] (directly underneath the main Dawnbreaker shape) in the block list. This shape controls the animated bright rotating flashes that occur on a plane located directly in front of the hilt. These flashes add some depth to the overall animation. \r<br />15. Follow steps 6 -8 to find and modify the Emissive Multiple Value if needed. If you dont see these flashes, increase the value. If they are too pronounced, decrease it. Some trial and error is needed.\r<br />16.  In the Block list window find the NitriShape called Flash07:1 [13]. This shape controls the main beams that emanate outward from the center. Again, modify the Emissive Multiple if needed.\r<br />17. Finally, look for the last NitriShape called rainbowFlash06:1 [15]. This shape controls the subtle rainbow colors the follow the main beams from Flash07, increasing the emissive multiple on this shape&#39;s shaderproperty will allow you to see these colors more visibly.\r<br />\r<br />After you are finished with modifying the values, click &#39;Save As&#39; in the top toolbar and over-write the existing file with the same name.\r<br />\r<br />Start your game and see how your blade looks in the first person view. If you are unsatisfied with how it looks, quit the game and modify the values again.\r<br />\r<br />Now, if the 3rd person view of the sword is also broken, you will need to follow the same procedure above for the dawnbreaker.nif. ***First make a backup copy of your dawnbreaker meshes**** The only difference is that the NitriShape name for the main blade is called Dawnbreaker3rdp:0 [21]. Remember to select the BSLightingShaderProperty underneath the shape name to modify the Emissive Multiple. You may need to use much different values by using trial and error and view the 3rd person view of the blade in game everytime you modify the mesh.\r<br />\r<br />Remember to always make bakups of your original meshes.\r<br />\r<br />[line]\r<br />\r<br />Credits:\r<br />\r<br />Boris Vorontsov for the wonderful ENB series\r<br />mindflux for the particle patch.\r<br />",
  "categoryId": "29",
  "version": "1.0a",
  "author": "nihlanth",
  "createdUnix": "1393985075",
  "updatedUnix": "1394087178",
  "containsAdultContent": false,
  "uploadedBy": "nihlanth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099966",
      "name": "Dawnbreaker Glow Fix for ENB no bloom only",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "135",
      "fileName": "Dawnbreaker Glow Fix for ENB-51774-1-1.rar",
      "uploadedUnix": "1394048679",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/24410849049bb4198c4025beaf8bffb0d0f887ffc4f18a57d4b3c2acc14639d1/analysis/1407961606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnbreaker%20Glow%20Fix%20for%20ENB-51774-1-1.rar?fid=1000099966&ttl=1535834377&ri=8192&rs=8192&setec=c345b9784f59279b77cf0908cb752795"
    },
    {
      "fileId": "1000100036",
      "name": "Dawnbreaker Glow Fix ENB bloom for vanilla",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "135",
      "fileName": "Dawnbreaker Glow Fix for ENB WITH BLOOM-51774-1-0a.rar",
      "uploadedUnix": "1394084350",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/2f13411fc5decd2858c278c4dfd4fdb9a098c8c79376578ad0cdd5a2b22cfd51/analysis/1407962240/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnbreaker%20Glow%20Fix%20for%20ENB%20WITH%20BLOOM-51774-1-0a.rar?fid=1000100036&ttl=1535834378&ri=8192&rs=8192&setec=6608ba50895baca79ac49c1d83ee9ea6"
    },
    {
      "fileId": "1000100043",
      "name": "Dawnbreaker Glow Fix ENB bloom Ultimate HD fire",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "135",
      "fileName": "Dawnbreaker Glow Fix ENB bloom Ultimate HD fire-51774-1-0a.rar",
      "uploadedUnix": "1394087178",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/615c4753db0825f6151dc57af8eef4e170d009ae164e1d11e7e508fe9ae2e6a4/analysis/1407962287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dawnbreaker%20Glow%20Fix%20ENB%20bloom%20Ultimate%20HD%20fire-51774-1-0a.rar?fid=1000100043&ttl=1535834378&ri=8192&rs=8192&setec=6584ebd098a489ef149924c470286abd"
    }
  ]
}