{
  "modId": 51780.0,
  "modName": "Salt Mining",
  "summary": "Salt Deposits added to game for mining salt. (They can be found in most mines and a few outdoors. A text list of locations is included in the archive) Also fixes mining to continue until you stop it (press E) and does the same for woodcutting.",
  "descriptionHtml": "- Mine as much salt as you need/want.\r<br />- Mining ore veins will continue until YOU interrupt it. (Press E) so feel free to go AFK while the Dohvakhiin makes some money&#33;\r<br />- Woodcutting will also continue until YOU stop it, (Press E)\r<br />- Ore veins will NOT deplete.\r<br />- Text list of salt deposit locations inside the mod archive.\r<br />\r<br />  I can hunt enough meat each day to feed the armies on both sides of the war but, I&#39;ll be damned if I can find enough salt constantly to cook my own meals&#33; Well this mod will fix that. I have added salt deposits to several of the mines and to certain areas around Skyrim.\r<br />  Also if you ever wished you could start mining or wood cutting and just go do something in real life and have it continue until you get back to the computer and stop it, well that is included in this mod. If you already have my indefinite Mining and/or Indefinite Woodcutting script mods they are the same scripts in this mod, so overwrite or don&#39;t, either way they will work fine.\r<br />\r<br />  If you would like the salt mining mod without the indefinite mining/woodcutting scripts, just delete MineOreScript.pex and resourcefurniturescript.pex from the Scripts folder after installing this mod.\r<br />\r<br />  If you have Baratan&#39;s &#34;Glowing Ore&#34; mod, (HIGHLY recommended) the salt deposits will also glow.\r<br />\r<br />  WARNING: Mining salt in the nude will mean that this mod contains adult content&#33; Since I classified it as G-Rated please don&#39;t do that&#33; ;p\r<br />\r<br />",
  "categoryId": "78",
  "version": "V1.1",
  "author": "TheONLYPantha",
  "createdUnix": "1394032274",
  "updatedUnix": "1394001748",
  "containsAdultContent": false,
  "uploadedBy": "TheONLYPantha",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000099901",
      "name": "Salt Mining",
      "version": "V1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Salt Mining-51780-V1-1.rar",
      "uploadedUnix": "1394001748",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7f3e65867ee7b50bf59c96158ce75d3ea0588d12ac68cf0e77e8d06ead487634/analysis/1407960930/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Salt%20Mining-51780-V1-1.rar?fid=1000099901&ttl=1535834386&ri=8192&rs=8192&setec=93f6096c356509c316e0274f004140a8"
    }
  ]
}