{
  "modId": 51792.0,
  "modName": "ENB Manager Utility",
  "summary": "This Mod is a easy to use utility that allows users to easily switch between ENB configurations. While there are plenty of ways for users to automatically install and uninstall standard skyrim mods, when it comes to ENB&#39;s there are few options. The goal of this program is to make it as easy to install, uninstall, and change between ENB&#39;s, a",
  "descriptionHtml": "This Mod is a easy to use utility that allows users to easily switch between ENB configurations. While there are plenty of ways for users to automatically install and uninstall standard skyrim mods, when it comes to ENB&#39;s there are few options. The goal of this program is to make it as easy to install, uninstall, and change between ENB&#39;s, as any other mod using NMM or Mod Organizer.\r<br />\r<br />\r<br />\r<br />\r<br />Features\r<br />-Supports any ENB configuration.\r<br />-Automatic changing between ENB Injector/Wrapper Versions\r<br />-Easily switch between palettes\r<br />-Files that may be overwritten by the selected configuration are automatically backed up and restored when ENB is disabled.\r<br />\r<br />Requirements\r<br />-Java, version 7 recommended\r<br />\r<br />Installation\r<br />1. Unpack the zip, and put the ENB Manager jar anywhere that is convenient\r<br />2. Uninstall any Current ENB&#39;s\r<br />3. Run the jar. If .jar files are not already associated with java, right click on ENB_Manager.jar and select &#34;open with&#34;. If there is an option for java, select that. Otherwise, click &#34;browse&#34; and navigate to java.exe, found in &#34;Program FilesJavajre7bin&#34;. If you get the &#34;Could not find main class: enb.manager.ENBManager&#34; error, try installing the newest version of Java.\r<br />4. Two folders, &#34;ENB Versions&#34; and &#34;ENB Configs&#34; will be created in the same folder as the jar. These folders are used by the program to store the ENB mods you will be installing.\r<br />5. If your skyrim directory is not in the default location, change the directory in the program\r<br />\r<br />Instructions\r<br />1. Installing the Main ENB Files\r<br />-Click the &#34;add&#34; button in the ENB Version section\r<br />-Use shift click to select all the files that you would normally place in the skyrim directory\r<br />-Name the version\r<br />\r<br />2. Installing New Configs\r<br />-Click on the &#34;new&#34; button in the configs section\r<br />-Name the Config.\r<br />-Click on the add button in the Files section\r<br />-Use shift+click to select all the files that would normally be placed in the skyrim directory\r<br />-If any palettes were found, you will be asked to name them\r<br />-Select the ENB version that this config uses\r<br />\r<br />3. Enabling and Disabling Configs\r<br />-To activate the currently selected config, simply click the activate button\r<br />-To disable any config, simply select &#34;Disable ENB&#34; under configs, and click activate\r<br />\r<br />Notes\r<br />If you experience any bugs, have any questions, or have any suggestions for improvements, please leave a comment. I&#39;d be more than happy to help out\r<br />\r<br />Change Log\r<br />1.0.2-Palettes are now installed correctly.\r<br />2.0-Coming Soon\r<br />-Optional files for each config\r<br />-Support for automatic ini editing\r<br />-Support for automatic graphics profile switching\r<br />-Favorite palettes can be shared between configs\r<br />-Automatically install new configs from zip archives\r<br />-Improvements and fixes for configs that install non-standard files (esps, textures, models, ect.)\r<br />\r<br />Thanks\r<br />-Brodual, for featuring this mod in his video.",
  "categoryId": "39",
  "version": "1.1",
  "author": "LegendAeternus",
  "createdUnix": "1394052577",
  "updatedUnix": "1394052577",
  "containsAdultContent": false,
  "uploadedBy": "andyjin87602",
  "primaryFile": null,
  "files": []
}