{
  "modId": 51808.0,
  "modName": "The Grotto",
  "summary": "A large luxurious property nestled in the Solitude Marshland.  The property contains three seperate houses, a vault, a cave, a follower, a pet and a few small Easter eggs.  Vanilla friendly&#33;",
  "descriptionHtml": "[center]------------------------------------------------------Steam Premium Mods------------------------------------------------------[/center]\r<br />(04/23/15) Just a heads up, my mods will [b]never[/b] be sold for profit on the Steam Workshop.   I&#39;m thinking of listing Pom Pom for &#036;100 and then providing links to obtain him here, on the nexus, for free.  Please, if you come across any of my files being sold (other than a one-hundred dollar crab pet...), let me know immediately. I am firmly against the sale of mods.\r<br />\r<br />This also might prompt me to actually finish my work to highlight what modding is about; the hobby, the challenge and the community.\r<br />\r<br />[center]--------------------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />A large luxurious property nestled in the Solitude Marshland.  The property contains three seperate houses, a vault, and cave.  There is also an optional human follower and [url=http://www.nexusmods.com/skyrim/mods/32332]mudcrab pet[/url].  A large selection of crafting stations are available in the main courtyard. \r<br />\r<br />Hey look, we have a sweet user video&#33; Show the creator some love and give them a like&#33;\r<br />[youtube]CcuWeJsEsjw[/youtube] \r<br />\r<br />The Grotto Villa:\r<br />My main house and the one that is nearly complete.  Features everything one would expect in a player home.  Special features include weapon display room and an archery practice range.  Access to your storage vault is through a door in the basement.\r<br />Issues: One or two flickering lights in the master bedroom.\r<br />To Be Finished: Still decorating, archery range not complete yet.\r<br />\r<br />Vault 13:  Located through a door in the basement of the Villa.  Inside you will find quite a few safes and maybe, just maybe some madness...\r<br />\r<br />The Grotto Leisure Hut:\r<br />Long day on the trails?  Well head down to your own tavern and bring some friends.  Includes a fully stocked bar like you&#39;ve never seen in Skyrim.  Also includes a basement pool.  Currently the follower is located in this house on the first floor.  There are many idle animation & interaction points in here so any followers told to &#39;relax&#39; will have lots to interact with.\r<br />Issues: NavMesh is good but not fantastic in the pool, moved pool steam while navmeshing, forgot to move it back... so you get steamy basement floors for the moment.\r<br />To Be Finished:  6-12 Random npc&#39;s to lively up the place.\r<br />\r<br />The Grotto Pool House\r<br />The problem with having the best bar in Skyrim is that you&#39;ll often find your friends are too drunk to ride their horses home... thats ok, just let them sleep it off in your guest house.  Includes direct access to The Grotto.\r<br />To Be Finished:  Library and decorating\r<br />\r<br />The Grotto\r<br />Currently its just a damp little cave... don&#39;t tell [url=http://www.nexusmods.com/skyrim/mods/32332]Pom Pom[/url] I said that. The key in here does nothing at the moment.\r<br />\r<br />The Follower: Ash Ember\r<br />Located in the Leisure hut temporarily.  Ash is one hell of a deadly follower.  She uses the Combat Assassin template, dual wields daggers, casts Ebony Flesh for defense and uses Light Foot to avoid traps.  She may not use Ebony Flesh until she is high enough level. She is an essential follower and will not die.  \r<br />Bug&#33;: Right now she can&#39;t find her way back home, so don&#39;t dismiss her unless you take her back to the leisure hut first.  She seems to stay where she is dismissed at the moment.\r<br />All options of UFO work on her. However for AFT it has been reported that setting home/relaxing outfits for her will cause a CTD.  I currently had a sleepwear clothing option set on her which is most likely the culprit causing the issue, I&#39;ll remove that in the next update as it&#39;s not something Skyrim utilizes properly anyhow.\r<br />\r<br />Note: She may look slightly different for you as I have no more blocky faces & lucious faces installed.  Also while she is built with a UNP body, to have her look like my photo&#39;s you will need to install the UNPB body.  You won&#39;t need to make any changes to the follower, just install UNP/UNPB how it is intended. The changes will affect her.  Also if you like the armor in my pictures it is available [url=http://www.nexusmods.com/skyrim/mods/26679/?] here - Tera Val Tirkai - UNPB BBP[/url]\r<br /> \r<br />Ash was made with:\r<br />[url=http://www.nexusmods.com/skyrim/mods/6709/?]Unp Body by Dimon99[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/16731/?]Fitness Body by SvarogNL[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/7403/?]Lovely Hairstyles by zn00p[/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/14322/?]Sunburn Skin by Kraken973[/url] which was customized with tattoo&#39;s by myself\r<br />\r<br />\r<br />So what&#39;s left?\r<br />-Well there are still the quests that need to be finished.  That&#39;s still a while out.  They won&#39;t be anything special, just a few small things to do to gain keys/access to the houses.\r<br />-Decorating/NPCS/Archery range\r<br />-NavMesh tweaking, mainly the outdoor area\r<br />-I will probably redo the courtyard at some point as I&#39;m not totally happy with it.\r<br />\r<br />Bugs&#33;?\r<br />-Well originally ash was part of The Grotto&#39;s mod file, she was peeled out and made semi-standalone to be an optional file.  Thing is I left some remnants of her in the main file.  So far it&#39;s not caused any issue other than that I can&#39;t place her starting location inside the Grotto Villa.  Yet. Ill figure that one out eventually.\r<br />-Riften Freeform Quest 20 (Skooma Dealer): So in my haste I buggered up that quest while duplicating something...fear not I have gone back through and corrected it.  Everything should be fine, but if you notice that quest does not work for you, remove my mod, do the quest and then reinstall if you wish.  Still, let me know if anyone has a problem because I&#39;m sure I fixed this fully.\r<br />\r<br />-NOT A BUG but worth noting that to make Ash I modified the female NordRace to be able to make use of all headparts.  So if you create a new nord female, she can use any nose/eye/mouth etc type in the game.\r<br />\r<br />While I&#39;ve had some friends test this for me, I can never be 100% sure if everything is going to work perfectly for others.  So if there are issues let me know.  One last bit of a warning: I really load up cells with objects so if you have a weak system just skip my mods all together... well except Pom Pom, he&#39;s nice and lightweight.\r<br />\r<br />\r<br />FAQ:\r<br />Where is this place?\r<br />-The fast travel is enabled automatically for the time being.  Located slightly south of Solitude.\r<br />Does this require DLC?\r<br />-Nope, it&#39;s all vanilla. \r<br />Can you put X from X DLC in there?\r<br />-Nope, I don&#39;t have any DLC and feel there aren&#39;t enough vanilla housing mods anymore.\r<br />Is this compatible with Solitude Dock&#39;s and Hill House?\r<br />-Yep and yep.  Keep in mind because of heavy asset use and proximity between Solitude Docks and The Grotto you may experience a performance hit.\r<br />Are the safe&#39;s safe?\r<br />-The safes in the vault, the lockboxes and safe in the Villa are all fine for storage.\r<br />Where is Ash?\r<br />-Leisure Hut\r<br />What level does she start using Ebony Flesh?\r<br />-Not sure, I think it&#39;s 50.  I&#39;ve only tested her at 80\r<br />Why does Ash shrink/grow when interacting with furniture?\r<br />-Shes got a pocket full of Eat Me cakes and Drink Me drinks... truthfully shes just short and grows to the correct animation size.\r<br />I yelled all the bottles off the shelf in the bar... help&#33;?\r<br />-If you pick them up, leave and then come back they should respawn.\r<br />I don&#39;t like your games, where is the %&#33;&&#036;# vault key&#33;? \r<br />-The key is hidden on the main floor of the Villa home. Look on top of things that are taller than you... start hoppin&#33;\r<br />This place looks too much like a house from Solitude&#33;\r<br />And that&#39;s not a question&#33;  Sorry, there was only one developer in the greater Solitude area so it only makes sense that they are similar.\r<br />Are there two Pom Poms?\r<br />-No, the optional file for him and his [url=http://www.nexusmods.com/skyrim/mods/32332]standalone[/url] are one and the same.  I only added him to the optional files here for convenience.  Do not install both&#33;\r<br />\r<br />One last thing&#33;\r<br />I&#39;ve put a tonne of work into this, especially over the last two months.  As such I&#39;m going to be taking a break from the CK for a bit... so while I do want to hear about encountered bugs, please don&#39;t expect a timely fix. Enjoy.",
  "categoryId": "68",
  "version": "0.86",
  "author": "Spazmok",
  "createdUnix": "1394071302",
  "updatedUnix": "1394128802",
  "containsAdultContent": false,
  "uploadedBy": "Spazmok",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100016",
      "name": "The Grotto",
      "version": "0.86",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3266",
      "fileName": "The Grotto-51808-0-86.zip",
      "uploadedUnix": "1394070198",
      "modVersion": "0.86",
      "virusScanUrl": "https://www.virustotal.com/file/be5e71ff652dded84e43f15d6c5ad1dc63d15656aa05d711e14f9a11c31a422a/analysis/1407961957/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Grotto-51808-0-86.zip?fid=1000100016&ttl=1535834431&ri=8192&rs=8192&setec=5c961037eb8286c66486bb55cda3dc4a"
    },
    {
      "fileId": "1000100017",
      "name": "Ash Ember - Follower",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "25002",
      "fileName": "Ash Ember - Follower-51808-1-0.zip",
      "uploadedUnix": "1394070409",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4664c366998bb907b3b20678256c82f0da8394f0396fb3c0f3b7c48d4a93ebc7/analysis/1407961972/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ash%20Ember%20-%20Follower-51808-1-0.zip?fid=1000100017&ttl=1535834432&ri=8192&rs=8192&setec=2e46947a037b9c2b033a15614e08e191"
    },
    {
      "fileId": "1000100087",
      "name": "Pom Pom - A Crabby Companion",
      "version": "1.13",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "15",
      "fileName": "Pom Pom - A Crabby Companion-51808-1-13.zip",
      "uploadedUnix": "1394128802",
      "modVersion": "1.13",
      "virusScanUrl": "https://www.virustotal.com/file/63f20fd8b19e4ffd51e0473f76f0b1aad00e3e775f15e30ee9610e9986e78da8/analysis/1407962598/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pom%20Pom%20-%20A%20Crabby%20Companion-51808-1-13.zip?fid=1000100087&ttl=1535834432&ri=8192&rs=8192&setec=e5dcab8de796f3a2bfe7b19915d1a61b"
    }
  ]
}