{
  "modId": 51810.0,
  "modName": "Frostfall Cottage - Family Friendly Player Home",
  "summary": "A player home near Winterhold, on the edge of town. It is Hearthfire family friendly, and very friendly to the lore friendly, immersion seeking, and simple player.",
  "descriptionHtml": "Hello, this is my first mod i will be posting, so take it easy&#33; XD well not easy, if there&#39;s a problem i want you all to tell me. \r<br />This house was built for immersive players, and players looking for a house for their family. It is completely Navmeshed, which means followers/spouses/children can go inside and wander about with no problems. In order to make it your house, you must have a mod called Hearthfire Multiable Adoption or a mod much like it. \r<br />\r<br />This house took me about four days of work to get it all correct. If you want to Immersively find the house&#33; There are now three postings to tell the player the houe is there, one is on the Jarl&#39;s building, on the left side of the door, another is in the Inn on the counter, and the last is on the first ramp to the Collage, this one [depending on the weather] is hard to miss. Otherwise you can go straight to the house, the location will show up on your map, but you can&#39;t fast travel to it until you find it for immersive reasons&#33; \r<br />\r<br />[Requirements] \r<br />Skyrim Update [fully, i don&#39;t support older versions of the game] \r<br />Hearthfire. \r<br />Dawnguard. \r<br />Dragonborn. \r<br />[Yes it requires ALL of the DLCs, im sorry but i won&#39;t make a duel version, D: it was alot of work to add in all the stuff from them immersively, and a LOT of work to get the kids and spouses to work] \r<br />\r<br />[Recommended] \r<br />Hearthfire Multiable Adoption [this is STRONGLY recommended inorder to adopt kids, have your followers see it as your house, and have your spouses live there.] - link http://www.nexusmods.com/skyrim/mods/29249/?\r<br />\r<br />[Known issues] \r<br />When telling a child to do their chore&#39;s they will run between the two sweep markers over and over, for now it is best to just let them sweep on their own without telling them to do so, because they will get in a loop until you stop them with either another command or give them something. \r<br />Horse when fast traveling in only goes to the travel marker, possibly pushing the player aside. [one time i did this and my horse ended up on the porch for some reason, if this happens just move him/her] \r<br />Mannequins can start to float off their stands, if this happens i have tested it once or twice, just replace the equipment on them or renew it, and they will reset to their stand. \r<br />\r<br />Possible reported bugs : Light flicks on some walls on the right side of the home. I can&#39;t fix this, they aren&#39;t that noticeable, and if you&#39;re running a lighting fix they go away.\r<br />\r<br />[Things to know about this house&#33;] \r<br />It has two child beds&#33; [if you&#39;re using Multi-kid please only adopt TWO it only supports that many] \r<br />One follower corner with follower owned bed and chest. \r<br />A lovely big kitchen stocked with various foods, along with an alchemy table and some restocking herbs. \r<br />Various containers [note all the containers in the house are norespown, except for the ones in the kitchen closet] \r<br />Three Weapon plaques through out the house, all work for ONE weapon purposes. \r<br />Two mannequins. \r<br />Two bookshelves, [halfish] \r<br />One Enchanting Table. \r<br />Unique child&#39;s toys [static for appearence only] \r<br />Dinning area. \r<br />Living Room. \r<br />Party/Relaxing room with bar. \r<br />\r<br />[Things i want to do in the future, and will keep working on.] \r<br />Getting the horses to spawn in or around the one horse stable. \r<br />Fixing the kid sweep markers. \r<br />-------- \r<br />[Permissions] \r<br />Please do NOT upload this to any other site. And do not claim this has your own work. \r<br />You may use this house in videos of course. \r<br />You may use it as reference&#33; or even look at the house in creation kit, and do with it as you please. Just do not upload it and claim it as your work. \r<br />\r<br />[Credits] \r<br />Thanks to TMPhoenix on the Nexus for their mod Hearthfire Multiable Adoption mod. Without this mod would be near to impossible&#33; \r<br />Thanks to the creators of Skyrim, the Elder Scroll Series have always been something great to me, and i love playing them. \r<br />--- \r<br />Thank you for downloading. \r<br />\r<br />FQ.\r<br />How do i install this?\r<br />Hit download, and follow the &#39;ReadMe&#39; instructions included. OR you should be able to use NMM just fine.\r<br />\r<br />Is there an easier way to install this mod, Nexus doesn&#39;t like me&#33;\r<br />NO WORRIES, my mod is also on Steam Workshop, which is simple press one button and you&#39;re there&#33; - Just be sure to look for Frostfall Cottage on the Workshop by Overlordnim\r<br />\r<br />[Disclaimer]\r<br />I want to make clear, i did not name this mod after the very famous Frostfall, i originally meant to name it Snowfall Cottage, but i got some things mixed up in the final naming process and now that it is known im afraid i won&#39;t be changing it. However, i did make this house with mods like Frostfall and Natural Diseases in mind.\r<br />\r<br />--\r<br />Thank you guys so much for looking at this mod :3",
  "categoryId": "67",
  "version": "1.0",
  "author": "Overlordnim",
  "createdUnix": "1394073308",
  "updatedUnix": "1394072782",
  "containsAdultContent": false,
  "uploadedBy": "OverlordNim7NimAM",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100020",
      "name": "Frostfall Cottage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2235",
      "fileName": "Frostfall Cottage-51810-1-0.zip",
      "uploadedUnix": "1394072782",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3ef576538fe1cbbf30ce1c71fb7b4e000114cb5f82be03bdbe12651f9eeacadb/analysis/1407962123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Frostfall%20Cottage-51810-1-0.zip?fid=1000100020&ttl=1535834440&ri=8192&rs=8192&setec=a019170ccf90e33d68590d4b7f369f58"
    }
  ]
}