{
  "modId": 51829.0,
  "modName": "Proudspire Manor Refurbished - ESP",
  "summary": "Este mod amplia el espacio de la Mansión Espira Orgullosa que compremos en Soledad. Además podemos mejorarla hablando con el administrador del Palacio Azul de Soledad, Falk Barba de Fuego.",
  "descriptionHtml": "[img]http://picload.org/image/apdagol/pmr_headline_pmr.png[/img]\r<br />[img]http://picload.org/image/apdagoi/pmr_headline_scr.png[/img]\r<br />\r<br />[b]AVISO[/b]\r<br />Include the BSA file from original mod.\r<br />Incluye el archivo BSA del mod original.\r<br />\r<br />[b]Descripción[/b]\r<br />Los principales cambios en Mansion Espira Orgullosa Restaurado:\r<br />• Añade una herrería completa en la antigua sala con más capacidad de almacenamiento, un maniquí y una tabla de cortar madera.\r<br />• Cambia la zona alquimia/encantadora: Mayor capacidad de almacenamiento, un estante de pociones y 2 estantes.\r<br />• Una sala de trofeos más grande con más maniquíes y placas de armas. Añade 7 vitrinas.\r<br />• Agrega una nueva habitacion en primera planta. Jordis dormirá allí desde las 23:00 hasta las 6:00 am.\r<br />• Añade una pequeña sala de almacenamiento para la comida al lado de la cocina, algunos contenedores y reaparición recursos alimenticios.\r<br />• Amplía el dormitorio del jugador, añade 4 grandes estanterías, 2 maniquíes, montajes de escudo, muebles nuevos y más capacidad de almacenamiento.\r<br />• Actualización adicional casa que añade 2 maniquíes, 2 vitrinas y 4 soportes de escudo a la sala superior.\r<br />• Mejora adicional que añade más de 40 soporte para antorchas a la mansión.\r<br />• Mejora adicional que añade una pequeña habitación.\r<br />• Porche con jardín y cascada.\r<br />\r<br />Las nuevas actualizaciones se pueden comprar al Administrador Falk Barba de Fuego, en Soledad.\r<br />\r<br />[b]Instalación[/b]\r<br />Antes de instalar (versión sin Hearthfire)\r<br />• Saca todo los objetos que hayas dejado en la casa y sal de la casa con Jordis.\r<br />• Abre la consola y usa el comando resetinterior solitudeproudspiremanor\r<br />• Guarda la partida.\r<br />• Instala el mod.\r<br />\r<br />Antes de instalar (versión Hearthfire)\r<br />• Antes de instalar traslada tu familia a otra casa y viaja con Jordis (si no tienes niños a tu cargo no hagas nada). Si no haces esto las camas se quedarán en su antigua posición.\r<br />• Guarda la partida.\r<br />• Instala el mod.\r<br />• Vuelve con tu familia a Mansión Espira Orgullosa.\r<br />\r<br />[b]Historial de Versiones[/b]\r<br />\r<br />Versión 1.8.3:\r<br />• Se ha eliminado el pequeño estante en la planta superior, agregado 2 estantes de tamaño mediano en su lugar.\r<br />• Editado algunos objetos plantador de detenerlos referencia a un script ya no se utiliza en el mod. \r<br />• Ajuste de posición de algunos objetos.\r<br />\r<br />Versión 1.8:\r<br />• Se ha añadido una estantería para colocar las máscaras de Sacerdote de Dragón y Garras de Dragón.\r<br />• Corregido un problema con el paso de la puerta cuando el jugador tenía muchos seguidores.\r<br />• Cambio de luces para hacer compatible el mod con los mods de iluminación.\r<br />• Hechos muchos pequeños ajustes.\r<br />\r<br />Versión 1.7:\r<br />• Eliminada una alfombra y una pila de heno de la habitación del jugador (Versión Herathfire).\r<br />• Se ha corregido un error por el que podría mantenerse una pared desactivada después de desinstalar el mod (Ambas versiones).\r<br />• Jardineras añadidas. (Versión Herathfire).\r<br />• Reelaboradas las jardineras personalizadas, las plantas vuelven a crecer después de 3 días. (Versión Vanilla).\r<br />• Se ha añadido un horno a la sala de almacenamiento de alimentos (Versión Herathfire).\r<br />• Añadida una habitación pequeña para 2 seguidores (Ambas versiones).\r<br />• Navmesh ajustado. (Ambas versiones).\r<br />• Se ha reducido el desorden que aparece en el suelo (Ambas versiones).\r<br />• Limpieza adicional del mod (Ambas versiones).\r<br />• Pequeños cambios adicionales (Ambas versiones).\r<br />\r<br />Versión 1.6:\r<br />• Compatibilidad con Heartfire.\r<br />• Añade una herrería con mayor capacidad de almacenamiento, un maniquí y un tronco donde puedes talar madera.\r<br />• Cambios en la zona de alquimia, incluye 1 estante, 2 estanterías y mayor capacidad de almacenamiento.\r<br />• Una sala de trofeos.\r<br />• Una habitación pequeña para ingredientes.\r<br />• Hace más grande la habitación del jugador.\r<br />• Añade soportes para antorchas.\r<br />• Casada y luces en el Porche.\r<br />\r<br />[b]Bugs y Conflictos[/b]\r<br />• Hay un bug en el juego que no permite poner los muebles de una habitación después de completar la misión del Thane, el autor ha añadido un script el cual habilita los muebles. Para colocar los muebles que faltan abre la consola y escribe e25d4.enable\r<br />• Hay otro bug que no te deja amueblar la habitación de los niños, pero sin embargo la puedes pagar, se soluciona descargando e instalando Unofficial Hearthfire Patch.\r<br />• Este mod puede tener conflictos con cualquier mod que haga cambios en la Mansión Espira Orgullosa, el autor recomienda que para solucionarlo carguéis este mod al final.\r<br />• Pueden haber conflictos con mods que interfieran a los seguidores, especialmente con Jordis la Espadachina, cargar esos mods antes que este.\r<br />\r<br />[b]Agradecimientos y Créditos[/b]\r<br />Bethesda - Por esta obra de arte.\r<br />Creation Kit - Por adaptarlo a nuestro gusto.\r<br />Ghaunadaur - Para reacondicionar la casa de nuestros sueños (jugables al estilo The Sims).",
  "categoryId": "67",
  "version": "1.8.3",
  "author": "Darkgeek",
  "createdUnix": "1394131537",
  "updatedUnix": "1394131515",
  "containsAdultContent": false,
  "uploadedBy": "Darkgeek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100092",
      "name": "Mansion Espira Orgullosa Restaurado v1_8_3",
      "version": "1.8.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4161",
      "fileName": "Mansion Espira Orgullosa Restaurado v1_8_4-51829-1-8-4.zip",
      "uploadedUnix": "1394131515",
      "modVersion": "1.8.3",
      "virusScanUrl": "https://www.virustotal.com/file/ed105ee62ed92d06838d23c42bff8893aacb54b93691e66192e2ea64680b3b0f/analysis/1407962698/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mansion%20Espira%20Orgullosa%20Restaurado%20v1_8_4-51829-1-8-4.zip?fid=1000100092&ttl=1535834477&ri=8192&rs=8192&setec=d22fb1f3fb8417400c9ef69241ce3d11"
    }
  ]
}