{
  "modId": 51845.0,
  "modName": "Nocturn Race",
  "summary": "Version 1.0, some aspects may be tweaked later on.",
  "descriptionHtml": "A long time ago there existed a powerful and divine race known as the Solar. They frolicked in their beautiful paradise known as Dawnfall. Dawnfall was a land filled with flowing milk and honey (an expression for the beauty of Dawnfall), clear skies and waters, and meadows of wondrous splendor. The Solar were especially proud of their two achievements: the Dragons, and the Daedric Lords, to whom the Solar gave birth too ( through their powerful ancient sorcery; called &#34;Powers of Creation&#34; magic). However, the Daedric Lords were scournful and resentful. They wanted the power and they wanted to destroy the Solar for treating them with condescension since the Daedric Lords fancy themselves better. So, the Daedric Lords and Molag Bal formed a council and unleashed a spell that created a gargantuan barrier around Dawnfall. The spell rendered Dawnfall in eternal darkness and ravaged the realm in a chaotic atmosphere of Fire, Frost, and Shock. The continent sunk to a dimension in-between Tamriel and Oblivion. Their name was lost to myths  and legends. But, the vengeance and betrayal felt by the Solar changed them. They resisted the chaos and evolved into a fearsome race, the Nocturn. Their world is now Nightfall, a wasteland of destruction and void where any sheer mortal will surely perish. The Nocturn have arise and they want revenge&#33;\r<br />Part 2:\r<br />Within their solitary confinement of Nightfall, the Nocturn gained impressive immunity to the destructive forces that ravished the dimension. This was all in their instincts to survive; the Nocturn population decreased to a measly 10%, but the survivors gained enormous powers. Due to their ancient sorcery and Powers of Creation; the Nocturns were able to train and further enhance their power through rigorous training and exposure to the outside. Nocturnus, male Nocturns, gained an impressive build and towers over ordinary men. Nocturna, female Nocturns, developed seductive beauty. However, even though a Nocturn is born with great power...in order to enhance their abilities they must go on fierce trials. The Trial of Eternal Darkness, The Trial of Eternal Horror, and the Trial of the Eternal Determination. These trials hone their Power of Creation which is the reason for their fierce magic and natural abilities. They hope some day their race will have the chance to destroy the Daedric Lords, whom they breathed life into.\r<br />\r<br />Hey guys this SammyEversong and I am here with my latest and biggest mod, thus far. Here is the Nocturn Race. A powerful, and playable race that is &#34;vampiric&#34;. \r<br />Read the ReadME for installation notes and uninstallation notes, as well as compatibility issues. \r<br />Requires Dawnguard absolutely.\r<br />\r<br />I also want to thank these mods and their respective authors or none of this would have been possible:\r<br />Apachii Skyhair\r<br />Better Vampire Eyes and Fangs/No Bloodshot Eyes\r<br />Better males-nudes-FavoredSoul&#39;s version\r<br />Better females by Bella version 3\r<br />Coverwoman look_1\r<br />DCE_realistic males-smooth version\r<br />Evision face-larger lips UNP\r<br />Milkdrinker Skin (texture female)\r<br />Numenume femalebrows MARO sono2\r<br />Numenume hair sono ver 7.2\r<br />Race compatibility and fixes\r<br />Sevenbase Female Body Replacer\r<br />Urishi&#39;s fine face texture male\r<br />Younger Faces for Males\r<br />Vie Male Hair Collection\r<br />...and XP32 Maxinum Skeleton.\r<br />\r<br />Please also download the required mods or else you may run into problems or issues later on.\r<br />\r<br />Nocturn Race Parameters Overview: New to Version 2\r<br />\r<br />-Nocturnal Body: Grants 100% resistance to magic and damage.\r<br />-Nocturnal Skin: Grants 75% to Frost,Fire and Shock.\r<br />-Invulnerable Body: Gives you 50% resistance to poison and disease, as well as fortifies your Health, Stamina, and Magicka by 50 points.\r<br />-Immortal&#39;s Defiance: You cannot drown in water, you walk on water, your  Magicka, and Stamina regeneration is increased by 150%.\r<br />-Nocturnal Strength: Gives you +20 unarmed damage as well as augment One-Handed damage by 25%, and Two_Handed damage by 10%.\r<br />-Lords Of The Night: Illusion spells are 25% cheaper, and Conjuration and Destruction spells are 25% stronger.\r<br />-Night Eye\r<br />-Nightmare Aura: does 8 pts of fire,frost, and shock damage per second a lesser power cloak.\r<br />New Spells:\r<br />-Call of the Night: a better raise dread zombie spell.\r<br />-Night Shroud: a better invisibility spell.\r<br />-Hellfire: a better fireball spell that drains 50 points of Health, Magicka, and Stamina.\r<br />-Chrystal Dust: a better ice storm spell that drains 50 points of Health, Magicka, and Stamina.\r<br />-Rai-Giri: a better chain lightning spell that drains 50 points Health, Magicka, and Stamina.\r<br />\r<br />That is basically all the new and awesome stuff, hope you will like and enjoy. Also I will in the very near future upload some screen shots. And please, if you like endorse and upload some pictures or videos of your awesome Nocturn character.\r<br />Also what to expect in the near future is a Nocturn (marriable) Follower, that can also act as a merchant. And a quest line and story to go with this awesome race...let&#39;s kill us some Daedric Lords&#33; ",
  "categoryId": "34",
  "version": "2.0",
  "author": "SammyEversong",
  "createdUnix": "1394191159",
  "updatedUnix": "1394820523",
  "containsAdultContent": true,
  "uploadedBy": "SammyEversong",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100154",
      "name": "NocturnRace",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "261936",
      "fileName": "NocturnRace-51845-1-0.zip",
      "uploadedUnix": "1394168758",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NocturnRace-51845-1-0.zip?fid=1000100154&ttl=1535834507&ri=8192&rs=8192&setec=c5a72e9a970cd6b5a953bbb1d39a47a2"
    },
    {
      "fileId": "1000101205",
      "name": "Nocturn Race Ver2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "420613",
      "fileName": "Nocturn Race Ver2-51845-2-0.zip",
      "uploadedUnix": "1394820523",
      "modVersion": "2.0",
      "virusScanUrl": null,
      "changelogHtml": " Improved appearances, females&#39; and males&#39; faces have improved meshing and textures. <br/> \n More Balanced skills, abilities, and powers. Still very powerful, but more akin to the original game. <br/> \n Males have erect nude bodies, so if you use Sexlab, you do not need to toggle &#34;nude suits for males&#39;. <br/> \n Males and females have new additional hairstyles. <br/> \n Fixed a bug in which your character may emit a perpetual blue glow. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nocturn%20Race%20Ver2-51845-2-0.zip?fid=1000101205&ttl=1535834507&ri=8192&rs=8192&setec=8c9c097190fa3518cabe820f27f76270"
    }
  ]
}