{
  "modId": 51843.0,
  "modName": "Mod Explorer For NMM",
  "summary": "Utility progam that aims to give mod users a total view of the mods they have installed, how the mods and their data files relate, and what aspects of the game mods change.",
  "descriptionHtml": "[heading][color=red]See New Version 3.3 Videos Below[/color][/heading]\r<br />\r<br />[heading][color=yellow]Description:[/color][/heading]\r<br />The main goal of this program is to give the mod user a total view of what mods they have, what the relationship is between the mods and the files they contain, and what aspects of the game the mods change.   It also has the more modest goal of becoming a hub for convenience utilities such as BSA extraction and quick access to the various game files.   Finally, It has a secret goal that I&#39;m not sure I can accomplish, but I am working towards :-)\r<br />\r<br />Since the program reads the same XML file that Nexus Mod Manager writes out to keep track of what mods are installed/unintstalled it will alway be in sync with your NMM setup.   It doesn&#39;t interact in any other way with NMM aside from reading the XML file and compliments rather than extends NMM.\r<br />\r<br />This program also has some of the same basic functionality as Tes5Edit, but it does not have to goal of being a replacement for that program.   Firstly, this program is currently read only.   You cannot make changes to any mods with it.   It also doesn&#39;t give you the overview that Tes5Edit does of how your mods&#39; changes override each other.   That said, it does let you browse internal plugin records within the context of all of your mods and files, not just the plugin files.   It is also much faster to load if you just want to search your mods, data files, or plugin records for something specific.    Finally, it presents that type of information to you in a more specific way by use of the various filters.   For instance, when you search, you see all of the results in a list that can be further refined instead of jumping from result to result like Tes5Edit does.\r<br />\r<br />[heading][color=yellow]Features:[/color][/heading]\r<br />* Show what data files a mod contains\r<br />* Show what mod a data file comes from (i.e. esp files whose name does not match the mod name)\r<br />* Filter mods by the types of data files they contain and the aspects of the game that they modify\r<br />* Filter data files by the aspect of the game that they modify\r<br />* Search for mods, data files, and records contained within plugins\r<br />* Quickly browse the internals of plugins\r<br />* View and extract the contents of BSA files\r<br />* View and extract the contents of uninstalled archived mods\r<br />* Active/Deactive plugins with master dependency warnings\r<br />* Temporarily disable mods\r<br />* Show master dependency outline\r<br />* Verify data files exist\r<br />* Restore missing files from original archive\r<br />* Multiple language support\r<br />\r<br />[heading][color=yellow]The types of questions this program can answer:[/color][/heading]\r<br />* Q: What mods do I have installed?\r<br />* A: Click &#34;Show All Mods&#34; button with filter set to &#34;all&#34;\r<br />\r<br />* Q: What files does this mod install?\r<br />* A: Click on a mod to see it&#39;s data files\r<br />\r<br />* Q: What mods install plugin files?\r<br />* A: Select the &#34;esp&#34; and &#34;esm&#34; filters in the mods list\r<br />\r<br />* Q: What mods have files that are overridden by other mods?\r<br />* A: Turn on the &#34;highlight overridden&#34; check box in the mods list and sort by &#34;overriden&#34; column\r<br />\r<br />* Q: Where is this data file on disk?\r<br />* A: Right click a data file and select &#34;Show in explorer&#34;\r<br />\r<br />* Q: What plugins do I have installed and what order are they loaded in?\r<br />* A: Click the &#34;only plugins&#34; filter and the data files view will show just the esm/esp files sorted by load order\r<br />\r<br />* Q: What mod is overriding this data file?\r<br />* A: Turn on &#34;highlight overridden&#34; in the data files list and show the &#34;installing mod&#34; column\r<br />\r<br />* Q: What mod did this esp come from?\r<br />* A: Click the esp and see the mod in the mods list\r<br />\r<br />* Q: Which mods add magic effects to my game?\r<br />* A: Filter the mods list by the MGEF group type\r<br />\r<br />* Q: What files are in this BSA archive?\r<br />* A: Load BSA contents then click on a mod\r<br />\r<br />* Q: What mods have something to do with Solitude?\r<br />* A: Select the search all mods checkbox and enter &#34;solitude&#34; into the records search\r<br />\r<br />* Q: What mods make cell changes to Solitude?\r<br />* A: Set the group type filter in the records view to &#34;CELL&#34; and then search records for &#34;solitude&#34;\r<br />\r<br />* Q: What plugins depend on this plugin?\r<br />* A: Right click one or more plugins and select &#34;Show Dependent Plugins(s)&#34;\r<br />\r<br />* Q: Are any of my files missing?\r<br />* A: Select the menu Data-&gt;Verify Data Files Exist\r<br />\r<br />[heading][color=yellow]Quotes:[/color][/heading]\r<br />What users are saying:\r<br />[quote]\r<br />[i]&#34;Small feature-rich program that&#39;s easy to use. Very handy for modders or anyone working with texture/meshes, scripts etc. and IMO deserves the praises of people that bring great mods/utilities to the attention of the Dovahkiin population.&#34;[/i]\r<br />      - Tikky\r<br />[/quote]\r<br />[quote]\r<br />[i]&#34;The prog becomes better and better with every new release. Especially the override column is a gem.\r<br />The problem is that the fewest people going deeper into managing and tweaking their mod collection so tools like this won&#39;t get the attention they deserve. Even TES5Edit is a mystery to many people, what I can not understand. I&#39;ts a pity. Many thanks for your hard work, I REALLY appreciate it.&#34;[/i]\r<br />    - archerarcher\r<br />[/quote]\r<br />[quote]\r<br />[i]&#34;Wow - I wish I had gotten to look at the &#39;hot files&#39; on the 3rd instead of spending my time decompressing a directory of mod archives in order to find out which one owned a rogue .pex file. Had I seen this app, it would have been a 2 minute job. Definitely endorsed. &#34;[/i]\r<br />     - chaophim\r<br />[/quote]\r<br />\r<br />[heading][color=yellow]Version 3.3 Update:[/color][/heading]\r<br />Language Features                                 \r<br />[youtube]jlE4HOG1CbY[/youtube]\r<br />Interface Updates\r<br />[youtube]MZaRsf51g30[/youtube]\r<br />Verify Data Files and Restore Missing Files Features\r<br />[youtube]LbRzCidpFuI[/youtube]\r<br />\r<br />[heading][color=yellow]Version 3.2 Update:[/color][/heading]\r<br />[youtube]doZlWzAWxTg[/youtube]\r<br />\r<br />[heading][color=yellow]Version 1.0 Features:[/color][/heading]\r<br />[youtube]NjG6fUscgQI[/youtube]\r<br />\r<br />[heading][color=yellow]Version History:[/color][/heading]\r<br />3.5\r<br />-Added search options for mods and data files.   Right click in search boxes.   Mod ones are pretty useless right now.\r<br />-Data files can now be search based on their filename, path, installing mod, bsa archive, and master files.   \r<br />-Added better &#34;Installing Mod&#34; data for game and DLC installed files so they can be searched easier with new search options.   The &#34;Installing Mod&#34; field for game installed data files is now prefixed with &#34;Game&#34; and DLC installed files with &#34;DLC&#34;.   For example, to searh for all the files that the base level Skyrim installs, set the data files search options to &#34;Installing Mod&#34; only and then search for &#34;Game Skyrim&#34;.   To search only for Dragonborn installed files, search for &#34;DLC Dragonborn&#34;.\r<br />\r<br />\r<br />3.4.1\r<br />-I wasn&#39;t sure how to handle filtering when a view is locked, so I just disable the filter gui controls when locking is enabled\r<br />-Added proper tool tip for locking buttons\r<br />\r<br />3.4\r<br />-Fixed bug where records for mods wouldn&#39;t load because of language feature\r<br />-Added view locking feature.   New lock icons next to search field lock the view.  When locked, this means that when the view is updated from searching or clicking a mod or data file that the contents will not change, but the found mod or data file will be highlighted instead.   Added a highlight color to the color scheme editor to change this color.   Also note that the lock state is saved in the config file so check the icon if you are not seeing what you expect.\r<br />-Made default color scheme the actual default\r<br />-Fixed bug where tool tips menu state was not being updated from config file\r<br />\r<br />3.3\r<br />-See new v3.3 videos above\r<br />-Added support for multiple languages\r<br />-Added feature to verify that data files exist for a mod or all mods from the main data menu.   Also added preference to verify this at startup.\r<br />-Added a data files &#34;Does Not Exist&#34; filter  which will show files that failed the verify test from above.  These files are also shown in an alternate color (red orange by default)\r<br />-Added a feature to restore missing files.   This will find the files in the original mod archive and present a gui to where each file can be selected if multiple versions of it exist in the archive.  It will then extract the entire mode to the temp directory and copy the files that are missing to their original locations.\r<br />-Added menu Data-&gt;Find FOMOD installers which will search all of the mod archives for a fomod folder and will set the mod&#39;s &#34;Has FOMOD&#34; field to true if it finds one.   This can be seen with the new &#34;Has Fomod&#34; column in the mods view.\r<br />-Added &#34;Filters&#34; and  &#34;Filter Options&#34; context menus which can be used instead of the filters panel.\r<br />-Moved the &#34;Hightlight Overridden&#34; and &#34;Hightlight BSA&#34; check boxes into the context menus to reduce clutter.\r<br />-Added a Ctrl+A hotkey in mods and data files view to select all files\r<br />-Added a Ctrl+Space hotkey to toggle the current panel to expand to the full interface/\r<br />-Added a shortcut for ModExplorerForNMM.ini to the shortcuts menu.\r<br />-Fixed bug with the &#34;Export Mods List&#34; and &#34;Export Data Files List&#34; features.\r<br />\r<br />3.2\r<br />-See v3.2 video above\r<br />-New Color Scheme menu with Color key\r<br />-Help Menu with tool tip enable/disable\r<br />-View Menu to disable any of the gui panels\r<br />-Right click panel splitters to divide horizontally or vertically\r<br />-Show plugin dependencies\r<br />[color=red]Use these features at your own risk&#33;  I won&#39;t be held responsible for a messed up game[/color]\r<br />-Disable/Enable Plugins with master dependency info and warnings\r<br />-Temporarily disable mods\r<br />\r<br />3.1\r<br />-No longer necessary to show &#34;NMM Index&#34; column\r<br />-Fixed problem with loading uninstalled data where it was not loading the data for some files\r<br />-Changed web page lookup to use &#34;skyrim&#34; in url instead of &#34;Skyrim&#34; since Nexus changed\r<br />-Record searching for a plugins now works even if load plugin information has not been run\r<br />-Fixed &#34;not installed&#34; data file checkbox not being remembered if &#34;only plugins&#34; was selected on exit/save\r<br />-Now shows formIds when searching records\r<br />\r<br />3.0\r<br />-Added ability to extract contents of uninstalled mods in the following ways:\r<br />-Right click one or more uninstalled mods and select &#34;Extract Uninstalled Mods(s)&#34; context menu\r<br />-Right click one or more uninstalled data files and select &#34;Extract Uninstalled Data File(s)&#34; context menu\r<br />-Double click an uninstalled data file to extract it to the temp dir and open it\r<br />-Right click an uninstalled data file and select show in explorer to extract it to the temp dir and then open the location\r<br />-Added new preference &#34;Extract all uninstalled mods to the same directory&#34; which, when unchecked, creates sub  directories for each mod or data file when extracting or, when checked, extracts them all to the same directory structure.\r<br />-Fixed bug when loading uninstalled data files on startup\r<br />\r<br />2.9\r<br />-Big speedups when viewing many files in list views.   Easily load over 100000 data files or records.  No more warning about loading large numbers of items.\r<br />-Also big speedups in sorting lists\r<br />-Can now extract BSA files\r<br />  -New Preference &#34;Temp Dir&#34; where BSA contents get extracted when using context open or show in explorer menus\r<br />  -Right click on one or more BSA files to extract to directory chosen in file browser\r<br />  -Can extract multiple BSA files to thier own directories or combine directory structure base on new preference &#34;Extract all BSA files to same directory&#34;\r<br />  -BSA files for base game now show up in data files view and will load when loading BSA contents\r<br />  -Most functionality now verified to work with Fallout New Vegas\r<br />\r<br />2.8\r<br />-Optimized record search for memory and speed\r<br />-Added 2 new options to preferences:\r<br />-   &#34;Save records in memory&#34; - Loads records into memory before search for small speed up\r<br />-   &#34;Show results during search&#34; - If off, then speed up search significantly\r<br />-Records only load now when a plugin file is double clicked to avoid loading if you just want to check it&#39;s mods\r<br />-Added reload groups button.   When clicking a data file, only the top groups in the filter will load.  If this filter is changed, then press reload groups to load the selected filter.\r<br />-Added expand all/collapse all context menu to groups view\r<br />\r<br />2.7\r<br />-Searching with &#34;Search all plugins&#34; off now searches only the files loaded in the groups view\r<br />-Added height adjustments fix to records view and cancel button\r<br />-To Apply height adjustment, add the following line to the ini file:\r<br />statusBarHeight=&lt;some value&gt;\r<br />-Fixed some of the tool tips\r<br />\r<br />2.6.2\r<br />-Fixed bug reading masters\r<br />\r<br />2.6.1\r<br />-Fixed bug which cause the mod record filters to not work correctly\r<br />-Removed Reset button from preferences since it was not working properly\r<br />\r<br />2.6\r<br />-Now reads .esp and .esm internals which allows for the following:\r<br />     -Add more columns to data view (masters, author, description, num records, top groups)\r<br />     -Filter by top groups (top groups are the top level modifications that mods make)\r<br />     -Type a top group filter into text box above filters to show only filters that match\r<br />     -Added groups and records views\r<br />     -Select a plugin data file to show it&#39;s groups\r<br />     -Select a group to show it&#39;s records\r<br />     -Search currently viewed records or records for all plugins\r<br />     -Limit searches by selecting a Record Top Group filter first\r<br />-Added File menus for saving, loading, and recent config files\r<br />-Added &#34;X&#34; button next to text fields to erase them\r<br />-Not all features currently included in history buffer\r<br />\r<br />2.5\r<br />-Rearranged GUI for less clutter\r<br />-Added main menu with controls that were previously other types like buttons.\r<br />-Added preferences dialog to set paths and other options\r<br />-Added editor for user color scheme\r<br />-&#34;Load Plugins&#34; button replaced with &#34;only plugins&#34; filter which has same function\r<br />\r<br />2.4\r<br />-Added BSA file contents support.  Once loaded, they can be searched and they also \r<br />appear in mods&#39; data files lists.\r<br />  -Added Load BSA Contents Button to scan all of you BSA files and ad their contents to the data files list\r<br />  -Added BSA File column to data files list to which shows the .bsa file the file came from\r<br />  -Added Highlight BSA check box to show BSA files in a different color\r<br />-Added &#34;only overridden&#34; check box filter to mods and data files lists to show only overridden mods and data files\r<br />-Added &#34;only BSA contents&#34; check box filter to show only data files that are contained within BSA files\r<br />\r<br />2.3.2\r<br />-Added &#34;Show Full Paths&#34; context menu to mods and data files lists to either show the full path or\r<br />  the path relative to the game dir\r<br />-Fixed bug with clipboard and export context menus\r<br />-Misc bug fixes\r<br />\r<br />2.3.1\r<br />-Updated code for type check box lists gui\r<br />-Added confirm messages for saving ini settings when refreshing and closing\r<br />\r<br />2.3\r<br />-Added field for 7zip executable for loading uninstalled data files\r<br />-Worked on GUI to help with issues people are having\r<br />\r<br />2.2\r<br />-Redesigned interface a little\r<br />-Added better history - Instead of buffers for each view, now there is one history list that \r<br />covers both views and more.   In addition to the back and forward buttons, now there are \r<br />history context menus for the back and forward buttons, the search box, and the filters view. \r<br />-Added stats line at bottom to show mods, data files, and plugins info\r<br />\r<br />2.1\r<br />-Added &#34;Load Uninstalled&#34; which scans all the uninstalled archives and adds their contents to the\r<br />data files list.  Then the uninstalled files can be searched, filtered, and will show up in the data\r<br />files view when an uninstalled mod is clicked.\r<br />\r<br />2.0\r<br />-Fixed columns initialization problem.   Delete your .ini file if upgrading\r<br />-Added &#34;Refresh&#34; button to refresh all files and lists\r<br />-Added &#34;Shortcuts&#34; combo box menu for folder shortcuts\r<br />-Added &#34;Show Plugins&#34; button to show only your .esp and .esm files in the data files view sorted by load order\r<br />-Changed &#34;Load Order&#34; column to be hex and &#34;Index&#34; column to be 1 based load order to match NMM\r<br />\r<br />1.9\r<br />-Refactored code for better column support - Please report errors\r<br />-More columns for mod and data files\r<br />-Enable/Disable columns\r<br />-Export to file context menus for mod and data lists\r<br />-Better handling of wrong paths\r<br />-Determines active plugins and load order by loading plugins.txt and loadorder.txt\r<br />\r<br />1.8\r<br />-Redesigned interface for better use of filters\r<br />-Added type filter check boxes for mods and data files\r<br />-Mod type filters filter mods by the types of files they contain\r<br />-Added &#34;All Checked&#34; check box to require all checked filters be present for a mod to show up\r<br />-Added &#34;Invert Results&#34; check boxes for the mods and data files lists to invert the results shown\r<br />-Added tool tip messages to most of the controls for help\r<br />-Added &#34;Copy current mod list to clipboard&#34; right click context menu for mods list\r<br />-Added &#34;Copy current data files to clipboard&#34; right click context menu for data files list\r<br />\r<br />1.7\r<br />-Better About Box with obnoxious endorse button\r<br />-Added second obnoxious endorse button\r<br />-Better error handling for install dates in xml reader\r<br />\r<br />1.6\r<br />-Added &#34;Highlight Overridden Mods&#34; check box to show mods that have files that are overridden\r<br />-Added history buffers for the mod and data files list.   Use the arrow buttons to cycle through.\r<br />-Added user defined color scheme.   Gui control categories and colors in ModExplorerforNMM.ini file\r<br />-Filtering lists now filters based on original query not what is currently in the list\r<br />-Fixed bug leaving config file open\r<br />-Added control to set flat or 3d look of gui\r<br />\r<br />1.5\r<br />-Added Color Scheme control for Default or Dark experience\r<br />-Remembers window position and size\r<br />\r<br />1.4\r<br />-Added &#34;Show Uninstalled&#34; checkbox to show uninstalled mods\r<br />-Colored installed mods green and uninstalled mods red\r<br />-Added &#34;Open&#34; right click context menus\r<br />-Added open file on double click\r<br />\r<br />1.3\r<br />-Added &#34;NMM Number&#34; column to mod list\r<br />-Added &#34;Show Web Page&#34; right click context menu for mod list which attempts to open a url based on the last part of the &#34;Game Install&#34; path  and the &#34;NMM Number&#34;.   \r<br />\r<br />1.2\r<br />-Reads plugins.txt file to determine load order\r<br />-Added &#34;Load Order&#34; column to data files view\r<br />-Added &#34;Overriden&#34; column to data files view to allow sorting by overriden\r<br />-Added &#34;esm and esp&#34; to filter list to show both esm and esp files\r<br />-Arrow keys now work for traversing lists.  They didn&#39;t load the new data before.\r<br />\r<br />1.1\r<br />-Changed default paths to C:Program Files location for better compatibility\r<br />-Added NMM Mods Dir folder to work with alternate mod folder locations\r<br />-Added &#34;Highlight Overriden Files&#34; check box to show files with multiple mods in red\r<br />\r<br />1.0\r<br />-Initial release features:\r<br />  -mod to data file and reverse data files to mod lookups\r<br />  -searchable mod and data files list using regular expressions\r<br />  -show mods and data files in windows explorer\r<br />  -writes ModExplorerForNMM.ini in same directory as exe file to store xml file and install directory\r<br />\r<br />[heading][color=yellow]Credits:[/color][/heading]\r<br />The Nexus Mod Manager Team\r<br />\r<br />ProgrammingKnowledge youtube channel for great instructional videos\r<br />http://www.youtube.com/channel/UCs6nmQViDpUw0nuIx9c_WvA\r<br />\r<br />[heading][color=yellow]My Other Mods[/color][/heading]\r<br />[url=http://www.nexusmods.com/newvegas/mods/55764]Enhanced ENB Night Vision[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50731]Enhanced ENB Night Eye[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50991]Enhanced ENB Diagnostics[/url]",
  "categoryId": "39",
  "version": "3.5",
  "author": "Scott Cegielski",
  "createdUnix": "1394161179",
  "updatedUnix": "1405979990",
  "containsAdultContent": false,
  "uploadedBy": "scegielski",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000107311",
      "name": "ModExplorerForNMM-2-7",
      "version": "2.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "133",
      "fileName": "ModExplorerForNMM-2-7-51843-2-7.7z",
      "uploadedUnix": "1398888346",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/98c4236338e8d692d364a8f677747da1a0b46361fd1fb57d770f8bc376ae64b7/analysis/1408049290/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-2-7-51843-2-7.7z?fid=1000107311&ttl=1535834499&ri=8192&rs=8192&setec=096e4f22067c3456645b2c536a0bdb45"
    },
    {
      "fileId": "1000107522",
      "name": "ModExplorerForNMM-2-8",
      "version": "2.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "134",
      "fileName": "ModExplorerForNMM-2-8-51843-2-8.7z",
      "uploadedUnix": "1399046622",
      "modVersion": "2.8",
      "virusScanUrl": "https://www.virustotal.com/file/13ea2c673816b5c937d1aa5514bef669e60a909644b0c9af4e360218fe16a510/analysis/1408051624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-2-8-51843-2-8.7z?fid=1000107522&ttl=1535834500&ri=8192&rs=8192&setec=d3443f9b7bca9bb4d24fa83f3d2d8e8a"
    },
    {
      "fileId": "1000108738",
      "name": "ModExplorerForNMM-2-9",
      "version": "2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "137",
      "fileName": "ModExplorerForNMM-2-9-51843-2-9.7z",
      "uploadedUnix": "1399826631",
      "modVersion": "2.9",
      "virusScanUrl": "https://www.virustotal.com/file/c4d7e62fea75a3d5ba7733f6864a46179d6ef5e153eccd790b01357cf58c0b4e/analysis/1408072622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-2-9-51843-2-9.7z?fid=1000108738&ttl=1535834500&ri=8192&rs=8192&setec=541310bce7209bcb390405f580b35e03"
    },
    {
      "fileId": "1000109008",
      "name": "ModExplorerForNMM-3-0",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "137",
      "fileName": "ModExplorerForNMM-3-0-51843-3-0.7z",
      "uploadedUnix": "1400023321",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/e3dfa9ec3912bec1ff8acd3a20b7ac274f70a9af10b16d68f43f04e17c42e5d9/analysis/1408075928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-3-0-51843-3-0.7z?fid=1000109008&ttl=1535834500&ri=8192&rs=8192&setec=190f92f2f2e86f2cf22e235bec5d8505"
    },
    {
      "fileId": "1000110637",
      "name": "ModExplorerForNMM-3-1",
      "version": "3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "137",
      "fileName": "ModExplorerForNMM-3-1-51843-3-1.7z",
      "uploadedUnix": "1401130504",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/a778d829a8f55ebc16acfe33a29321df053d6d34f13bf370f2f855b177eccb30/analysis/1408098304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-3-1-51843-3-1.7z?fid=1000110637&ttl=1535834501&ri=8192&rs=8192&setec=e58188e75f2fe326ca1f8be970b3e60c"
    },
    {
      "fileId": "1000112429",
      "name": "ModExplorerForNMM-3-2",
      "version": "3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "145",
      "fileName": "ModExplorerForNMM-3-2-51843-3-2.7z",
      "uploadedUnix": "1402343882",
      "modVersion": "3.2",
      "virusScanUrl": "https://www.virustotal.com/file/8637c64cd8383f6777be73d3e146358bdeb1b59f91ed5d4fdba39c53d9d98fa5/analysis/1408119787/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-3-2-51843-3-2.7z?fid=1000112429&ttl=1535834501&ri=8192&rs=8192&setec=261e4d9c4114013124e6bfd13ed9b583"
    },
    {
      "fileId": "1000113275",
      "name": "ModExplorerForNMM-3-3",
      "version": "3.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "154",
      "fileName": "ModExplorerForNMM-3-3-51843-3-3.7z",
      "uploadedUnix": "1402971836",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/0aa6dc96e29eddb14ffba331e40f0e80f8e771d407b2f9eb6fab42dc65d412a9/analysis/1408130180/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-3-3-51843-3-3.7z?fid=1000113275&ttl=1535834502&ri=8192&rs=8192&setec=2eea6e1581137898ba354130ea3f03bd"
    },
    {
      "fileId": "1000118632",
      "name": "ModExplorerForNMM-3-4",
      "version": "3.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "157",
      "fileName": "ModExplorerForNMM-3-4-51843-3-4.7z",
      "uploadedUnix": "1405969585",
      "modVersion": "3.4",
      "virusScanUrl": "https://www.virustotal.com/file/c55a82d3ca8285fe7b7f84d91aeec8b9c0f72803418a9e62e6e537138ed42ebd/analysis/1405969671/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-3-4-51843-3-4.7z?fid=1000118632&ttl=1535834502&ri=8192&rs=8192&setec=82b5132583aeaf74cd0280fdf1365548"
    },
    {
      "fileId": "1000118648",
      "name": "ModExplorerForNMM-3-5",
      "version": "3.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "158",
      "fileName": "ModExplorerForNMM-3-5-51843-3-5.7z",
      "uploadedUnix": "1405979990",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/2e36ca5389e40bc027d50ca6c86a1f002502a4e10bbbcd661f074c00433cc69e/analysis/1406010854/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModExplorerForNMM-3-5-51843-3-5.7z?fid=1000118648&ttl=1535834503&ri=8192&rs=8192&setec=e3876549da2ab884047ffec2f33ba592"
    }
  ]
}