{
  "modId": 51869.0,
  "modName": "ETHEREAL AURORAS",
  "summary": "This mod revises the default Skyrim aurora textures, doubling the dimensions and increasing the detail and variation. It is still very performance friendly, since the original texture were small.",
  "descriptionHtml": "[URL=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/Ethereal_Auroras_title.jpg.html][IMG]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/Ethereal_Auroras_title.jpg~original[/IMG][/URL]\r<br />\r<br />[b]ETHEREAL AURORAS revises the default Skyrim aurora textures, doubling the dimensions and increasing the detail and variation. Since the original textures were small, there should be little performance impact of these new textures. They are still only 700 KB each in size. Therefore, this mod should be usable  on anyone&#39;s setup.[/b]\r<br />[URL=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-title-02.jpg.html][IMG]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-title-02.jpg~original[/IMG][/URL]\r<br />Vibrant Auroras revised the aurora meshes to make them brighter, but I&#39;m not aware of any other mods that addressed the textures themselves. Though auroras by their very nature are ephemeral and not clearly defined, I felt the default textures were lower resolution than ideal. By working more detail and variation into the textures, I hope to add more beauty and visual interest to Skyrim.\r<br />\r<br />[center][youtube]PODAD4SpivM[/youtube]  [youtube]ez0j_1ZUX5U[/youtube][/center]\r<br />\r<br />This is the type of mod that can&#39;t be fully shown in a static screenshot. You need to see it in-game to appreciate it&#39;s full effect. Take a look at the videos above by Nozi87 and ShenziSixaxis to get an impression of the aurora textures in motion. Watch on YouTube to get the full effect at a larger size.\r<br />\r<br />All my screenshots were taken with the default game meshes. If you want the auroras to be even brighter, then install the Vibrant Auroras meshes.\r<br />[URL=http://s150.photobucket.com/user/Blue-Bolt/media/Skyrim/BPT-title-04.jpg.html][IMG]http://i150.photobucket.com/albums/s86/Blue-Bolt/Skyrim/BPT-title-04.jpg~original[/IMG][/URL]\r<br />Use NMM, or to do manually, merely unzip the file and install it into your Data folder in your Skyrim game folder.\r<br />\r<br />The file path is [C]Windows &gt; Programs Files or Program Files (x86) &gt; Steam &gt; SteamApps &gt; common &gt; Skyrim &gt; Data &gt; Textures &gt; Sky\r<br />\r<br />Uninstall: Deactivate with NMM, or just manually delete (or overwrite) the 3 texture files... skyrimaurorastreak01.dds, skyrimaurorastreak02.dds, and skyrimauroraswirl01.dds.\r<br />\r<br />Enjoy&#33;\r<br />\r<br />This mod may not be posted to others sites, or used for other mods without my permission.\r<br />\r<br />[heading]FREQUENTLY ASKED QUESTIONS:[/heading]\r<br />[b]Q:[/b] Is this mod incompatible with XYZ mod?\r<br />\r<br />[b]A:[/b] This mod only replaces the three aurora textures, so it should be compatible with any mod that doesn&#39;t do the same...... including Vibrant Auroras.\r<br />\r<br />[b]Q:[/b]  Is this mod better than a lava lamp?\r<br />\r<br />[b]A:[/b] It depends. Do you have one of the originals, or one of those crummy reissues?\r<br />\r<br />[b]Q:[/b]  How is this different from your Ethereal Cosmos mod?\r<br />\r<br />[b]A:[/b] The Ethereal Cosmos mod changes the stars, constellations, and galaxy textures. This mod only changes the aurora textures. They&#39;re designed to be used together, but that is strictly your choice.\r<br />\r<br />[b]Q:[/b]  How is this different than the Ethereal Elven Overhaul mod?\r<br />\r<br />[b]A:[/b] Other than not having anything to do with elves?...... not much.\r<br />\r<br />[b]Q:[/b]  What&#39;s with all the &#34;Ethereal&#34; business.... what&#39;s next, Ethereal Sweetrolls?\r<br />\r<br />[b]A:[/b] Wouldn&#39;t that be redundant?\r<br />\r<br />[b]Q:[/b]  Will this cause CTDs or my graphics card to melt?\r<br />\r<br />[b]A:[/b] Unless your system is so overtaxed that adding one minor texture mod will cause it to implode, I seriously doubt it.\r<br />\r<br />[b]Q:[/b]  What form of vile Necromancy is this?\r<br />\r<br />[b]A:[/b] I can assure you that no person, living or dead, was harmed in the creation of this mod. It required a fair bit of Alteration, and a pinch of Illusion magic, but nothing of the dark arts.\r<br />\r<br />[b]Q:[/b]  I like XYZ mod better than this.\r<br />\r<br />[b]A:[/b] That wasn&#39;t really a question, but thanks for sharing\r<br />\r<br />[b]Q:[/b]  Couldn&#39;t you be doing something better with your spare time?\r<br />\r<br />[b]A:[/b] I&#39;m beginning to wonder.",
  "categoryId": "62",
  "version": "1.0",
  "author": "Gamwich",
  "createdUnix": "1394237101",
  "updatedUnix": "1394220837",
  "containsAdultContent": false,
  "uploadedBy": "Gamwich",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100235",
      "name": "Ethereal_Auroras_1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1390",
      "fileName": "Ethereal_Auroras_1_0-51869-1-0.zip",
      "uploadedUnix": "1394220837",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dcc3bfc452164831a9ec82d3037d72764344c739fd365bab9b595d2e366a8555/analysis/1407963965/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ethereal_Auroras_1_0-51869-1-0.zip?fid=1000100235&ttl=1535834540&ri=8192&rs=8192&setec=2b56e6a17bac6e19175a582a8c46ba5b"
    }
  ]
}