{
  "modId": 51878.0,
  "modName": "The Tomb of Erald Kin-Slayer",
  "summary": "A realistic ancient tomb with no lighting and no pointless or organic clutter.",
  "descriptionHtml": "I am aware comments are broken right now.  I have full comment and discussion permissions but no one, including myself, can leave a comment.  Until I can get comments to work, there is a feedback thread stickied on the discussions tab\r<br />\r<br />Inspired by the &#34;Skyrim Logic&#34; posts about fresh produce and lit fires in old ruins, my goal for this mod is to make the player feel like they really are in an ancient tomb that has been undisturbed for decades, rather than Skyrim&#39;s usual way of having lit torches and excessive clutter in supposedly abandoned ruins. I left the tomb relatively uncluttered and dark to give an a realistic and authentic feel. I made it as dark as possible while still being vanilla Skyrim; a torch or magelight is highly recommended unless you cheat and turn your brightness up ;). I added a quest to accompany the dungeon to give it a story and context. The backstory is something I made up, but I tried to keep it as lore-friendly as possible. \r<br />\r<br />To play: \r<br />The dungeon itself can be found slightly northwest of Halted Streams Camp. I added the quest book to common book leveled list so you should have an easy time finding it. If you are eager to do the quest, the book that starts it can be found on the ground nearby. \r<br />\r<br />This is my first mod for Skyrim so it&#39;s far from perfect, but any feedback is welcomed&#33;",
  "categoryId": "88",
  "version": "1.0",
  "author": "Son of a Sailor",
  "createdUnix": "1394314521",
  "updatedUnix": "1394313733",
  "containsAdultContent": false,
  "uploadedBy": "sommerjj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100404",
      "name": "EraldsTomb-v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7588",
      "fileName": "EraldsTomb-v1-51878-1-0.zip",
      "uploadedUnix": "1394313733",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d76281fbf91cf81eae2dc7796b5975dc4438f7fffa09754f147da003876974e8/analysis/1407965649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EraldsTomb-v1-51878-1-0.zip?fid=1000100404&ttl=1535834551&ri=8192&rs=8192&setec=ff89d5da17f5182c7679e7d6e9c64ae4"
    }
  ]
}