{
  "modId": 51882.0,
  "modName": "Inhabitants of Skyrim - NPC Overhaul - French",
  "summary": "Traduction française du mod original améliorant la morphologie faciale des PNJs uniques et leur ajoutant les cheveux du mod ApachiiSkyHair. - This is a french translation of the original mod aiming to improve the facial morphology of unique NPCs and adding them the haircuts from the mod ApachiiSkyHair.",
  "descriptionHtml": "[center][color=Orangered][size=4]&#33;&#33;&#33; Important, lisez la description ainsi que la FAQ &#33;&#33;&#33;[/size][/color]\r<br />\r<br />[b][u]Note from the translator[/u][/b] : This is a french translation of the original mod aiming to improve the facial morphology of unique NPCs and adding them the haircuts from the mod ApachiiSkyHair. Original mod can be found there : [url=http://www.nexusmods.com/skyrim/mods/23755/]http://www.nexusmods.com/skyrim/mods/23755/[/url]\r<br />\r<br />[b][u]Remarque du traducteur[/u][/b] : Ceci est la traduction française du mod original améliorant la morphologie faciale des PNJs uniques et leur ajoutant les cheveux du mod ApachiiSkyHair. Le mod original se trouve ici : [url=http://www.nexusmods.com/skyrim/mods/23755/]http://www.nexusmods.com/skyrim/mods/23755/[/url]\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/23755-1-1392177302.png[/img][/center]\r<br />\r<br />[font=Algerian][size=5]Table des matières[/size][/font]\r<br />[b]Description\r<br />Installation\r<br />Désintallation\r<br />Questions fréquentes\r<br />Incompatibilités\r<br />Notes de mises à jour\r<br />Outils utilisés\r<br />Droits légaux\r<br />Crédits & Remerciements[/b]\r<br />- La traduction\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Description[/size][/font][/color]\r<br />\r<br />Ce mod vise à améliorer la morphologie faciale des PNJs uniques. Hormis quelques exceptions, leurs traits personnels ont été conservés tout en les rendant plus beaux. 80% des PNJs modifiés conservent les mêmes yeux, le même nez et la même bouche. Dans la plupart des cas, la distance entre les traits du visage a été changée et la forme générale du visage (mâchoire, le menton et les pommettes) a été modifiée. Quelques rides ont également été supprimés quand cela a semblé approprié. La saleté du visage a été modifiée en la supprimant complètement ou en l&#39;atténuant. Toutefois, les mineurs, les forgerons, les prisonniers et quelques agriculteurs ont encore de la saleté sur leurs visages. Les compagnons ne sont PAS modifiés.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/23755-1-1392512061.png[/img] [img]http://static-3.nexusmods.com/15/mods/110/images/23755-2-1392512062.png[/img][/center]\r<br />\r<br />Il existe 3 versions de ce mod :\r<br />\r<br />[b][u]Version 1[/u][/b]\r<br />Améliore la morphologie faciale des PNJs uniques hommes et femmes et ajoute leur ajoute les cheveux du mod ApahiiSkyHair. Seuls les orcs ont conservés leurs cheveux vanilla. Cette version nécessite les fichiers suivants :\r<br />-Skyrim Version 1.9.32.0\r<br />-[url=http://www.nexusmods.com/skyrim/mods/10168]ApachiiSkyHair_v_1_5_Full[/url]\r<br />-[url=http://www.nexusmods.com/skyrim/mods/10168]ApachiiSkyHairFemale_v_1_3[/url]\r<br />-[url=http://www.nexusmods.com/skyrim/mods/10168]ApachiiSkyHairMale_v_1_2[/url]\r<br />\r<br />[b][u]Version 2[/u][/b]\r<br />Améliore la morphologie faciale des PNJs uniques hommes et femmes et  ajoute les cheveux du mod ApahiiSkyHair aux femmes seulement. Les orcs ont conservés leurs cheveux vanilla. Cette version nécessite les fichiers suivants :\r<br />-Skyrim Version 1.9.32.0\r<br />-[url=http://www.nexusmods.com/skyrim/mods/10168]ApachiiSkyHair_v_1_5_Full[/url]\r<br />-[url=http://www.nexusmods.com/skyrim/mods/10168]ApachiiSkyHairFemale_v_1_3[/url]\r<br />\r<br />[b][u]Version 3[/u][/b]\r<br />Améliore la morphologie faciale des PNJs uniques hommes et femmes. Les cheveux vanilla sont conservés. Cette version nécessite uniquement Skyrim Version 1.9.32.0.\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Description[/size][/font][/color]\r<br />\r<br />[b][u]Installation manuelle[/u] :[/b]\r<br />1. Installez les fichiers d&#39;ApachiiSkyHair nécessaires en suivant les instructions sur la page du mod concerné.\r<br />2. Extrayez les fichiers dans un emplacement temporaire.\r<br />3. Copiez/collez tout les fichiers dans votre dossier Skyrim. Celui-ci se situe normalement dans : Steam/SteamApps/common/Skyrim/Data\r<br />4. Lancez Skyrim et avant de cliquer sur &#34;Jouer&#34;, cliquez sur &#34;Fichiers de données&#34; et assurez-vous que le mod est coché et qu&#39;il est en bas de la liste.\r<br />5. Jouez.\r<br />\r<br />[b][u]Avec Nexus Mod Manager[/u] :[/b]\r<br />Pour installer avec Nexus Mod Manager, cliquez simplement sur le bouton &#34;Dowload with Manager&#34; et activez le mod dans le launcher du jeu. Assurez-vous que le mod soit en bas dans la l&#39;ordre de chargement des mods et en-dessous de mods tels que UFO - Ultimate Follower Overhaul.\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Questions fréquentes[/size][/font][/color]\r<br />\r<br />Q: Beaucoup de PNJs ont l&#39;air d&#39;avoir conservé leur apparence vanilla.\r<br />R: Si vous utilisez USKP - Unofficial Skyrim Patch ou tout autre mod qui modifie les PNJs de quelque manière que ce soit, ceux-ci vont retourner à leur forme originelle. Si quelqu&#39;un peut aider l&#39;auteur du mod à créer un patch de compatibilité pour USKP, ce serait grandement apprécié. Merci de le contacter.\r<br />\r<br />Q: Pourquoi certaines coupes de cheveux d&#39;Apachii sont détachées du corps et flotent dans l&#39;air ou pourquoi sont elles rognées par les vêtements/armures que les PNJs portent ?\r<br />R: Cela dépend de quel mod vous utilisez pour le corps (CBBE, UNP etc). La taille et la forme du corps peuvent varier, ce qui peut causer ce problème.\r<br />\r<br />Q: Mon jeu crash depuis que j&#39;ai installé Inhabitants of Skyrim.\r<br />R: Ce mod est clean et est exempt de toute erreur en son sein. La seule chose qui pourrait causer ces crashs est que votre PC n&#39;est pas assez puissant pour supporter la version 1 ou 2, ou alors vous avez installé la version 1 ou 2 sans avoir installé les fichiers réquis, ou qu&#39;il y a une incompatibilité majeure avec un autre mod. Essayez la version 3 sans ApachiiSkyHair ou essayez de désinstaller les autres mods pour trouver toute éventuelle incompatibilité.\r<br />\r<br />Q: J&#39;apprécie vraiment la version 1 et 2 avec ApachiiSkyHair, mais je n&#39;aime pas certaines coupes qui ont été choisies pour certains PNJS.\r<br />R: L&#39;auteur a fait ce mod selon ses goûts et l&#39;a partagé. Malheureusement si certains PNJs ne vous plaisent pas, aucune modification ne sera faite pour répondre à chaque demande personnelle.\r<br />Vous pouvez facilement modifier vous-même les coupes de cheveux en modifiant le mod via le Creation Kit.\r<br />\r<br />Q: Ce mod est-il compatible avec Ethereal Elven Overhaol (EEO) ?\r<br />R: Depuis que les deux mods modifient les PNJs elfes, ils rentrent directement en conflit. Selon l&#39;ordre de chargement des mods, l&#39;un écrasera les modifications de l&#39;autre. Mais les deux mods sont utilisables sans problème.\r<br />\r<br />Q: Ce mod n&#39;est pas ne respecte pas l&#39;univers de Skyrim et je ne l&#39;aime pas.\r<br />R: Vous devriez essayer la version 3 qui utilisent les coupes de cheveux par défaut. Sinon, ne le l&#39;utilisez pas.\r<br />\r<br />Q: Est-ce qu&#39;une version pour les DLC sera réalisée ?\r<br />R: Une version est actuellement en cours de réalisation mais cela risque de prendre du temps selon le temps libre de l&#39;auteur du mod.\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Incompatibilités[/size][/font][/color]\r<br />\r<br />Inhabitants of Skyrim sera en conflit avec tout autre mod qui changera les mêmes PNJ de n&#39;importe quelle manière. C&#39;est-à-dire tout mod qui changera les stats, les vêtements, les scripts etc. Si Inhabitants of Skyrim est chargé avant des mods qui apportent de telles modifications, celles apportées par Inhabitants of Skyrim seront annulées et les PNJs retrouveront leur apparence originelle. Essayez de trouver quels mods modifient les PNJs et mettez Inhabitants of Skyrim après ceux-ci dans l&#39;ordre de chargement.\r<br />\r<br />Si quelqu&#39;un peut aider l&#39;auteur du mod à créer un patch de compatibilité pour USKP, ce serait grandement apprécié. Merci de le contacter.\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Problèmes connus[/size][/font][/color]\r<br />\r<br />Les versions 1 et 2 avec ApachiiSkyHair demandent énormément de ressources à votre PC. Si vous subissez des ralentissements majeurs ou des temps de chargements interminables, vous devriez utiliser la version 3 sans ApachiiSkyHair.\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Notes de mises à jour[/size][/font][/color]\r<br />\r<br />Remarque importante :\r<br />Avec les anciennes versions de ce mod, il se peut que vous ayez rencontré le problème de jointure entre le cou et le corps après la désinstallation de ce mod. Ce problème est causé par le fait que le poids des PNJ sont stockées dans vos fichiers de sauvegardes et que les données ne sont pas mises à jour lors de la désinstallation. Depuis la version 1.5 aucun poids des PNJs n&#39;a été modifié de sorte à ce que vous puissiez installer ce mod en toute sécurité. Ce mod a été nettoyé avec TES5Edit.\r<br />\r<br />Beta (09/07/2012) - Lancement du mod.\r<br />1.0 (09/11/2012) - Version buggée, certains PNJs étaient nus.\r<br />1.1 (09/16/2012) - Version corrigée, plus de PNJ nu.\r<br />1.2 (09/16/2012) - Ajout de la version 3 sans ApachiiSkyHair.\r<br />1.3 (02/25/2013) - Mise à jour de la version 1 avec de nouvelles coupes d&#39;Apachii. De nouveaux PNJs ont été modifiés dont les PNJs âgés.\r<br />1.4 (03/02/2013) - Suppresion des modifications apportées aux compagnons.\r<br />1.5 (02/12/2014) – Refonte de la version 3. Correction du bug de la césure au niveau du coup après la désinstallation du mod (les PNJs gardent leur poid vanilla).\r<br />1.5 (02/22/2014) - Mise à jour d&#39;ApachiiSkyHair pour les hommes.\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Mods utilisés dans les screenshots[/size][/font][/color]\r<br />\r<br />Si vous voulez que les PNJs ressemblent à ceux des screenshots, vous allez avoir besoin d&#39;installer les mods suivants. Cependant ces mods ne sont PAS requis pour le fonctionnement d&#39;Inhabitants of Skyrim.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/2666]Calientes Beautiful Bodies Edition -CBBE-[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12273]Calientes Vanilla Outfits for CBBE[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/3563]Coverwomen[/url] (Look 4 with no make-up)\r<br />[url=http://www.nexusmods.com/skyrim/mods/498]High Quality Eyes[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/30411]Brows[/url] and [url=http://www.nexusmods.com/skyrim/mods/28363]Beards[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/4784]High Resolution Scars[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/2488]YoungerFacesMergedWithMenByGeonox[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/2488]FavoredSoulMeshes[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24828]Bleak ENB[/url]\r<br />\r<br />Si vous utilisez ces mods, cela veut dire que vous les appréciez. N&#39;oubliez pas d&#39;endoser ces moddeurs qui ont travaillé plusieures heures pour les faire.\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Outils utilisés[/size][/font][/color]\r<br />7-Zip\r<br />Creation Kit\r<br />TES5Edit\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Droits légaux[/size][/font][/color]\r<br />\r<br />Si vous voulez utiliser ce mod, vous avez besoin de la permission de l&#39;auteur. Envoyez-lui un message ou un e-mail pour la lui demander. Un lien vers la page du mod original est aussi requis.\r<br />Lien du mod original pour contacter l&#39;auteur : [url=http://www.nexusmods.com/skyrim/mods/23755/]http://www.nexusmods.com/skyrim/mods/23755/[/url]\r<br />\r<br />\r<br />[color=Royalblue][font=Algerian][size=5]Crédits & Remerciements[/size][/font][/color]\r<br />\r<br />De l&#39;auteur : \r<br />Merci à Greyblood pour son aide et sa sympathie ... \r<br />Merci à Netherwalk pour toute son aide et sa contribution à la communauté de Nexus \r<br />Merci à Apachii pour son super mod\r<br />Merci à Bethesda pour sa série Elder Scrolls\r<br />Merci à tout les moddeurs pour leurs éfforts et leurs contributions au jeu\r<br />Merci à Nexus and la communauté de moddeurs pour l&#39;accès aux mods, aux outils et aux ressources\r<br />\r<br />Personnellement, en plus des remerciement précédents, je tiens à remercier Rops1981 pour son mod original et pour avoir permis sa traduction.\r<br />\r<br />\r<br />[font=Algerian][size=4]La traduction[/size][/font]\r<br />\r<br />Ce mod modifie les PNJs, donc même s&#39;il n&#39;est censé changer que le physique des PNJs, il met en anglais tout les noms des items, des lieux et le noms de certains PNJs génériques (tels que les cochers, les prisionniers etc) qui sont liés aux PNJs modifiés. C&#39;est donc un total de plus de 250 noms qui sont changés en anglais (noms propres des PNJs ne nécessitants pas de traduction non compris) en utilisant le mod original. C&#39;est pour corriger cela que j&#39;ai fais cette traduction. Voyez plutôt cette traduction comme une sorte de patch qui [u]restaure les noms français du jeu, ce n&#39;est donc pas une traduction approximative[/u].\r<br />J&#39;ai tenu personnellement à traduire ce mod car je l&#39;apprécie énormément. Merci à l&#39;auteur d&#39;avoir réalisé ce mod, merci à lui d&#39;avoir autorisé cette traduction, et merci à lui pour sa sympathie ainsi que pour la rapidité de ses réponses &#33; N&#39;oubliez pas de voter et d&#39;endorser le mod orginal à place de la traduction, c&#39;est grâce aux auteurs originaux que nous pouvons profiter de tout ces mods &#33; Il faut les encourager et les remercier &#33;",
  "categoryId": "79",
  "version": "1.5b",
  "author": "Rops1981",
  "createdUnix": "1394255269",
  "updatedUnix": "1394250134",
  "containsAdultContent": false,
  "uploadedBy": "Lurihaut",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100276",
      "name": "NPC Overhaul - Version 1",
      "version": "1.5b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "280664",
      "fileName": "NPC Overhaul - Version 1-51882-1-5b.rar",
      "uploadedUnix": "1394247097",
      "modVersion": "1.5b",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NPC%20Overhaul%20-%20Version%201-51882-1-5b.rar?fid=1000100276&ttl=1535834558&ri=8192&rs=8192&setec=5abcb20aadb854c95e42aefe4a6d8764"
    },
    {
      "fileId": "1000100280",
      "name": "NPC Overhaul - Version 2",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "195878",
      "fileName": "NPC Overhaul - Version 2-51882-.rar",
      "uploadedUnix": "1394248398",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/8e84f95f4ab330742df949994b93e48ab95087b526aeed6b155b54d448285ad7/analysis/1407964557/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NPC%20Overhaul%20-%20Version%202-51882-.rar?fid=1000100280&ttl=1535834559&ri=8192&rs=8192&setec=1b2d13a837a1286c914ad74e0f86ff45"
    },
    {
      "fileId": "1000100281",
      "name": "NPC Overhaul - Version 3",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "108171",
      "fileName": "NPC Overhaul - Version 3-51882-.rar",
      "uploadedUnix": "1394248833",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/736e2e57523e2d709e757b0e4cb77c909478e75192f054fe505ab7e2d5a1d422/analysis/1407964599/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NPC%20Overhaul%20-%20Version%203-51882-.rar?fid=1000100281&ttl=1535834559&ri=8192&rs=8192&setec=d695d843e732e68b22e3942f8a356e00"
    },
    {
      "fileId": "1000100283",
      "name": "Liste des PNJs",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "56",
      "fileName": "Liste des PNJs-51882-.7z",
      "uploadedUnix": "1394250134",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6285758db7d39e166693b18d39c8f7a9417a5451506c3d17d947dfde411074f0/analysis/1407964563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Liste%20des%20PNJs-51882-.7z?fid=1000100283&ttl=1535834560&ri=8192&rs=8192&setec=57362be086b880ed6fa1daf6dab1d7c5"
    }
  ]
}