{
  "modId": 51908.0,
  "modName": "Dova Arrow",
  "summary": "Ebony type specialist arrow",
  "descriptionHtml": "For those of us who like the odd &#39;God&#39; weapon. I have noticed that if you load up SkyRe or some of the other similar mods then many &#39;God-Weapons&#39; lose their value. For example a bow that has &#39;Godlike&#39; properties seems to lose this power and become just another powerful weapon. I decided that this was silly and thus produced an item that was powered to do the job and would not lose out in any other mod or configuration.\r<br />The Dova Arrow is specialist; expensive and very, very dangerous. You can get it only at the Fletchers in Solitude. It can be used with any Bow and still have the same effect (I hope). I have noticed this does not work with the Bow of Awe - rather it works but the bow itself negates the effect.\r<br />\r<br />****Warning\r<br />\r<br />If you use this arrow and subsequently search the body you used it against it should show up as Dova Arrow (on those occasions when the body does actually show the arrow which is not always as you all know). However - it is a specialist arrow and should not be used by just anyone so if yuou shoot it at an enemy and miss you will not find it marked in the ground or around. You will need to look for an Ebony Arrow with a high value. (I am working on this and will upload an update when I can find a solution).\r<br />\r<br />Finally - if this does not work or you cannot find it in Solitude will you please tell me so I can have another look. I am not an experienced modder and need all the help I can get.\r<br />\r<br />Folks - 13 of you have downloaded this and I have had only one (negative) comment. I really need more if I am to learn so could some of you let me know how you are getting on.",
  "categoryId": "55",
  "version": "0.1",
  "author": "Petray",
  "createdUnix": "1394288810",
  "updatedUnix": "1394288802",
  "containsAdultContent": false,
  "uploadedBy": "petray",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100345",
      "name": "Dova Arrow",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dova Arrow-51908-.7z",
      "uploadedUnix": "1394288802",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5e1a5a5d9a25b7f54be18b2c409d90145605afe43d25832d0c6139c258cde04b/analysis/1407965168/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dova%20Arrow-51908-.7z?fid=1000100345&ttl=1535834602&ri=8192&rs=8192&setec=b60e482fc02d64093049e3db0990bca0"
    }
  ]
}