{
  "modId": 51933.0,
  "modName": "Modified Growth",
  "summary": "A mod that tweaks leveling growth rate ",
  "descriptionHtml": "Mod for created for personal use, but figured other people may have similar issues. The simple fact is you level very quickly with certain skills, primarily weapon skills. While I appreciate the reason, Skyrim is very combat focused, it means you level off the weapon skills, and have to continue to focus the weapon skills to keep up with the enemies leveling with you.\r<br />\r<br />That being said, some skills have absurdly slow growth rates, which means they fall even further behind. So while some skills are decreased in growth, and others increased, overall you probably will still see a overall *slower* growth rate then in vanilla. I always felt you leveled way too fast for a single player game with so much content.\r<br />\r<br />Here is a list of all the skills, and why I have or haven&#39;t changed them. This is subject to change after testing, but I believe my reasons to be sound. The amount things are tweaked will likely be revised after further testing.\r<br />\r<br />Alchemy: No Change; Since this is a non-combat skill it is only leveled when you choose to increase it. The rate when leveling seems reasonable.\r<br />\r<br />Alteration: No Change; The rate Alteration levels up is fairly lengthy, but simultaneously it is more then reasonable.\r<br />\r<br />Block: No Change; as weapon skills are having their exp reduced, the relatively slow natural growth of block will feel more reasonable\r<br />\r<br />Conjuration: Slight Decrease; this skill literally levels practically every time you summon a level appropriate creature in combat. This can get out of control especially early on. \r<br />\r<br />Destruction: Significant Increase; destruction is inherently a weak skill due to its non scaling damage and the requirement of mana to use spells anyways. This combined with its extremely slow leveling speed, even early on, to make destruction pretty worthless. \r<br />\r<br />Enchanting: Since this is a non-combat skill it is only leveled when you choose to increase it. The rate when leveling seems reasonable, except at the highest level (80-100) but an increase would be absurd as the rate is slightly fast early on.\r<br />\r<br />Heavy Armor: No Change; same as block, since weapon skills are slowed down, defensive abilities naturally slow growth rate will be in line with the melee weapons.\r<br />\r<br />Illusion: No Change; this skill is easy to farm to level, but at the same time, in normal use it takes appropriately long to level up.\r<br />\r<br />Light Armor: No Change; Same situation as other defensive skills, the slower weapon rate means these are more reasonable with their slower natural rate.\r<br />\r<br />Lockpick: No Change: Essentially, lockpicking can be leveled quickly but it rarely goes up too fast unless intentional or simply picking every lock in sight. If you are just focusing on dungeons it can be extremely slow to level so it is hard to say whether it should increase or decrease.\r<br />\r<br />Marksmen: Slight Decrease; As opposed to the melee weapons, marksmen actually doesn&#39;t level unreasonably, but it still outpaces all other non-combat abilities significantly.\r<br />\r<br />One Handed: Moderate Decrease; This skill levels absurdly fast, which means if one were to multiclass their one handed skills would rapidly make their other skills useless in combat.\r<br />\r<br />Pickpocket: No Change; while I would like to decrease, the inherent risk of using pickpocket means it&#39;s high growth rate is reasonable This culminating with the fact it is rarely even useful means I just kept it the same.\r<br />\r<br />Restoration: Slight Increase; I understand the concept of healing magic leveling slowly, as most players are going to end up using it, andthey didn&#39;t want those non-focused to leveling too quickly from it. But they went way overboard and it can literally take hours to level it up.\r<br />\r<br />Smithing: No Change; Since this is a non-combat skill it is only leveled when you choose to increase it. The rate when leveling used to be extremely fast, but after they patched it, the levelling seems more reasonable now. Granted the actual damage increase from smithing is brokenly strong, but this is about leveling speed. \r<br />\r<br />Sneak: Moderate Decrease; Sneak levels unbelievably fast, not only because those who use it will be using it, but because it levels up from so many actions taken while sneaking that the growth is nearly exponential. \r<br />\r<br />Speechcraft: Slight Increase; speechcraft takes an absurd amount of time to level, and the number of times you can actually use it in conversation is already not really that high, meaning that selling things is really the only way to improve it. Problem is that they wanted to slow it down because *every* player sells things and they didn&#39;t want ever player mastering Speech craft instantly. Even so, the vanilla rate is abysmally slow.\r<br />\r<br />Two Handed: Moderate Decrease; Same has one handed, two handed skills leveled so fast that they outclassed every other skill in the game. Brought more in line with other skills.",
  "categoryId": "24",
  "version": "1",
  "author": "Ilseroth",
  "createdUnix": "1394343853",
  "updatedUnix": "1394343842",
  "containsAdultContent": false,
  "uploadedBy": "Ilseroth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100455",
      "name": "Modified Growth",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Modified Growth-51933-1.rar",
      "uploadedUnix": "1394343842",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2d02547f6e767630ddd94167079e5a3cc33604a88c44e7c3611cdcdb24448545/analysis/1407966191/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Modified%20Growth-51933-1.rar?fid=1000100455&ttl=1535834642&ri=8192&rs=8192&setec=49ad29d7e3556f4d5ffe2dfc1570689e"
    }
  ]
}