{
  "modId": 51944.0,
  "modName": "Sand Elf Race by KhaosKid",
  "summary": "Adds a new Elf race to play. I have tried to be lore friendly and have a conjuration style elf race. ",
  "descriptionHtml": "INSTALL: Preferably use NMM and just download and activate the .esp\r<br />UNINSTALL: You all know how to uninstall .esp files :p\r<br />\r<br />Name: Shenmer or Sand Elves.\r<br />Height: A bit taller than Altmer.\r<br />Skill bonuses: Conjuration +10\r<br />                    Light Armour +5\r<br />                    Enchanting +5\r<br />                    Archery +5\r<br />                    Sneak +5\r<br />                    One Handed +5\r<br />\r<br />Their racial ability (which isn&#39;t shown as an ability) is &#34;Desert survival&#34; which gives them a starting carry weight of 350.\r<br />Their racial power is &#34;Spirit Link&#34; which is essentially a summon familiar greater power. The effect lasts for 3 minutes.\r<br />\r<br />This is still very much a work in progress. Any suggestions, feedback and criticism will be noted. (I am on this site every day so you will get a prompt reply&#33;).\r<br />\r<br />REPORT ANY AND ALL BUGS&#33; This is my first ever mod but I will try to fix any bugs or problems I can. At the moment it is impossible to become a vampire. This isn&#39;t a bug, I just haven&#39;t had time to create a vampire version of the race. SO DONT TRY IT&#33;\r<br />\r<br />The boring stuff:\r<br />DO:\r<br />-Download this mod&#33;\r<br />-Endorse this mod&#33;\r<br />-ENJOY this mod&#33;\r<br />-Give me feedback on this mod&#33;\r<br />\r<br />DON&#39;T:\r<br />-Upload this mod claiming it to be your own&#33;\r<br />-Use assets in this mod in your own mod without asking me first&#33; (Including translations&#33;)\r<br />\r<br />If you want to feature this mod in any monetised/monetized YouTube video, PLEASE ask me first AND credit me as the author of the mod in the description and if possible the actual video itself.\r<br />",
  "categoryId": "34",
  "version": "0.1",
  "author": "KhaosKid",
  "createdUnix": "1394385331",
  "updatedUnix": "1394385331",
  "containsAdultContent": false,
  "uploadedBy": "KhaosKid",
  "primaryFile": null,
  "files": []
}