{
  "modId": 51955.0,
  "modName": "Arrow Recovery System Overhaul - Traduzione Italiana",
  "summary": "Traduzione Italiana per Arrow Recovery System Overhaul (ARSO) by Seb263 \r<br />Questa mod modifica completamente il funzionamento delle frecce, che non verranno semplicemente sparate e perse all&#39;interno dei corpi o disintegrate random. Questa mod, terrà traccia di tutte le frecce in gioco ed tramite una serie di parametri potrai decidere quant",
  "descriptionHtml": "[center][img]http://seb263.olympe.in/images/mods/arso/logo.png[/img][/center]\r<br />\r<br />Author : Seb263\r<br />[color=33cc00]Se vi piace questa mod, non dimenticatevi di supportarla [/color] ( ed anche la traduzione ;) )\r<br />\r<br />[center][img]http://seb263.olympe.in/images/mods/arso/introduction.png[/img][/center]\r<br />Come il suo nome indica [u]Arrow Recovery System Overhaul (A.R.S.O)[/u] ridisegna completamente il modo con cui il gioco gestisce frecce e dardi.\r<br />\r<br />Quando colpisci un bersaglio la freccia non viene più persa secondo un semplice calcolo random, ma resterà comunque una possibilità che questa si rompa.\r<br />Quando un bersaglio viene colpito la freccia resterà nel corpo della vittima, oppure potrebbe rompersi, ma sempre sulla base di un calcolo più complesso.\r<br />\r<br />All&#39;interno del menù delle opzioni infatti è possibile impostare la resistenza per ogni tipo di freccia (ferro, acciaio, daedriche ecc.) oltre a questo è possibile impostare un valore percentuale generico sulla robustezza delle frecce, ed in finite abbiamo due valori, uno che indica quante frecce il gioco deve &#34;tenere&#34; sul corpo di una vittima, e quante in giro per l&#39;ambiente.\r<br />\r<br />Oltre a questo, la mod aggiunge una funzione per la raccolta delle frecce, raccogliendo una singola freccia è possibile decidere di raccogliere tutte le frecce all&#39;interno di un raggio definito nel menù delle opzioni, puoi anche assegnare un tasto per la raccolta di tutte le frecce e delle parti di quelle rotte.\r<br />\r<br />Infatti le frecce che si romperanno, e che il gioco semplicemente distruggerebbe, adesso possono  essere raccolte e ri-aggiustate alla forgia. In oltre i mercanti venderanno parti di frecce rotte, così avrai la possibilità di ricostruire le tue frecce aumentando la tua abilità di forgiatura, o al limite rivendere le parti delle frecce rotte ai mercanti stessi.\r<br />\r<br />[i]nota:[/i] per costruire determinate frecce dovrai avere specifiche abilità, per esempio per realizzare delle frecce daedriche dovrai necessariamente avere acquisito la specialità la forgiatura daedrica.\r<br />\r<br />[b]Tutte le frecce[/b], provenienti dal gioco di base, dai DLC, e perfino dai mod (tutti i tipi) sono riconosciute da ARSO e sono [b]completamente personalizzabili[/b]\r<br />\r<br />Quindi, per configurare in modo semplice tutte queste opzioni è (pesantemente) consigliato l&#39;uso di  [url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url] in modo da poter avere accesso al MCM.\r<br />Se non hai accesso a SkyUI, puoi comunque configurare la mod tramite il menù &#34;poteri&#34;.\r<br />\r<br />** INSTALLAZIONE **\r<br />1) Scaricate la mod [url=http://www.nexusmods.com/skyrim/mods/51149/?]originale[/url]\r<br />2) Sostituite i file con quelli presenti in questa pagina.\r<br />e vi serve ",
  "categoryId": "78",
  "version": "1.0.2",
  "author": "Seb263",
  "createdUnix": "1394399846",
  "updatedUnix": "1400068247",
  "containsAdultContent": false,
  "uploadedBy": "MaximilianPs",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109075",
      "name": "ARSO_ITA_1_02",
      "version": "1.0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1098",
      "fileName": "ARSO_ITA_1_02-51955-1-0-2.zip",
      "uploadedUnix": "1400068247",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/8bfa6d5d06260a93f39be662b6ad96a6253470a6f3e06fb62f58156d59caf983/analysis/1408080428/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ARSO_ITA_1_02-51955-1-0-2.zip?fid=1000109075&ttl=1535834679&ri=8192&rs=8192&setec=2d7059c8f788e5c45546a96be697971d"
    }
  ]
}