{
  "modId": 51972.0,
  "modName": "Ziil Los Dii Du - Your Soul is Mine to Devour - Miraak",
  "summary": "Taste the power of Miraak. Consume a Dragon soul to get temporary and permanent bonuses (balanced)",
  "descriptionHtml": "[center][url=https://thethirdrace.com/games/skyrim/my-mods/ziil-los-dii-du.aspx][size=5]TheThirdRace.com[/size][/url][/center] [center][b][color=#c27ba0]Be sure to checkout my website for everything I&#39;m currently involved with[/color][/b][/center]\r<br />\r<br />[size=4][color=#ffcc33]What does it do?[/color][/size]\r<br />\r<br />[color=#ffcc33]-- In simple words --[/color]\r<br />It adds a lesser power that consume a Dragon soul to get temporary and permanent bonuses.\r<br />\r<br />I tried to mimic Miraak&#39;s power when he consumed a Dragon souls to heal himself. Since a Dragon soul is &#34;rare&#34; and fully healing you would have been equivalent to taking a &#34;cheap&#34; health potion, I decided to spin off the power a bit to make it more appealing but still balanced.\r<br />\r<br />[color=#ffcc33]-- Temporary bonuses --[/color]\r<br />[list][*][color=#cb99c9]Increase health, magicka and stamina regeneration rate by 1000%[/color]. 1000% might appear a lot, but most Heal spells will outperform this.\r<br />[*][color=#cb99c9]Reduce cooldown between shouts by 100%[/color]. Free shouting to your heart&#39;s content for a limited amount of time.\r<br />[/list]\r<br />[color=#ffcc33]-- Permanent bonuses --[/color]\r<br />[list][*][color=#cb99c9]Increase health, magicka and stamina regeneration rate by 2%/Dragon soul consumed[/color].\r<br />[*][color=#cb99c9]Reduce cooldown between shouts by 1%/Dragon soul consumed[/color].\r<br />[/list]\r<br />[color=#ffcc33]-- Limitations --[/color]\r<br />[list][*][color=#cb99c9]Temporary bonuses last for 30 seconds[/color]. Less than that and it feels like you don&#39;t have time to use it. More than that and it feels like a bit too much.\r<br />[*][color=#cb99c9]Temporary bonuses don&#39;t stack with a second cast while the power is still active[/color]. Duh&#33; It would have been way overpowered to allow such a thing... If you recast the power while it&#39;s still active, you only reset the duration to 30 seconds and consume a Dragon soul for your efforts, not your greatest deal...\r<br />[*][color=#cb99c9]Permanent bonuses top at 25 Dragon souls consumed[/color]. This means the permanent bonuses will never be greater than 50% health, magicka and stamina regeneration rate and 25% reduced cooldown between shouts.\r<br />[*][color=#cb99c9]You can&#39;t use the power if you don&#39;t have a Dragon soul[/color]. You also need those Dragon souls to unlock shouts, so be careful before spamming this power\r<br />[*][color=#cb99c9]Not as efficient at lower levels[/color]. Since the efficiency of regeneration rate is directly tied to your maximum health, magicka and stamina, you&#39;re limited by the amount you have and to a limited extent by your level. As you level up, you gain more health, magicka and stamina which in turn will make the power better (7%/second of 100 HP is much lower than 7%/second of 500 HP). The goal was to balance the power for all levels.\r<br />[/list]\r<br />\r<br />[size=4][color=#ffcc33]Installation, requirements and compatibility[/color][/size]\r<br />\r<br />[color=#ffcc33]-- Requirements --[/color]\r<br />Latest version of Skyrim (Skyrim.ESM, Update.ESM)\r<br />\r<br />[color=#ffcc33]-- Install (auto) --[/color]\r<br />For an automatic install without risk of errors, I suggest you use the [url=http://www.nexusmods.com/skyrim/mods/modmanager/][color=#7dc7ea]NexusModManager[/color][/url].\r<br />\r<br />[color=#ffcc33]-- Install (manual) --[/color]\r<br />For a manual install, extract the files from this mod and copy them to the appropriate folders.\r<br />\r<br />[color=#ffcc33]-- Uninstall --[/color]\r<br />Open the console and type: [color=#cb99c9]SetStage TTR_Ziil_Los_Dii_Du 100[/color]. Save and uninstall the mod manually or with your mod manager. I&#39;m not sure the [color=#cb99c9]SetStage[/color] is still necessary. In the past, there were some CTD when you deactivated an ESP with a spell already learned by the player. I&#39;ve tried to reproduce this on my game but wasn&#39;t able to. I&#39;m putting it here as the &#34;safest&#34; method just in case you need it.\r<br />\r<br />[color=#ffcc33]-- Compatibility --[/color]\r<br />Compatible with everything.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]F.A.Q.[/color][/size]\r<br />\r<br />[color=#ffcc33]-- Why isn&#39;t this a shout? --[/color]\r<br />I&#39;ve receive multiple requests to make this as a shout so let me explain why I didn&#39;t.\r<br />\r<br />The scene with Miraak saying those words is just a scene, there is no audio for those words. The only ressource for audio would be Miraak saying the line. Even if you put aside the fact you would hear Miraak&#39;s voice when shouting, the problem is it would be illegal from a copyright point of view to edit the original audio and repack it under a mod. Not to mention the mod would be removed from the Nexus and I could be banned. So audio is out of the picture.\r<br />\r<br />The words Ziil Los Dii Du have no art/graphic either. I could use other symbols, and I&#39;m sure I&#39;d have some lore zealot to remind me they don&#39;t match, but there&#39;s also the fact the &#34;shout&#34; is 4 words instead of 3. That means the CK cannot handle it and neither can the in-game UI. So technically, graphics are out of the picture too.\r<br />\r<br />While I agree this would have been really epic, what are we left with in reality if you don&#39;t have audio and graphics to support the idea? I&#39;d say you have to think outside the box a little. Technically speaking, a shout is 3 words. When Miraak uses his &#34;power&#34;, he uses 5 words (DragonName, Ziil Los Dii Du) and they are subtitled like any normal dialogue. It wouldn&#39;t be that far fetched to consider this more like a &#34;sentence&#34; in dragon&#39;s tongue than a shout. With that said, it open up the possibility the effect came from something else and since a lesser power only available to the Dovahkin could fit the bill, that&#39;s the way I decided to go about it. It&#39;s not perfect, but it&#39;s as good as it can be within the realm of reality.\r<br />\r<br />[color=#ffcc33]-- Known issues --[/color]\r<br />None. Although, as with any shout or spell, trying to cast the lesser power twice in a row in a very short time will not work. Technically, there&#39;s a &#34;cooldown&#34; of more or less 1 second for the animation to play even if there isn&#39;t one. It&#39;s an engine problem but I don&#39;t see why you&#39;d want to spend 2 Dragon souls to add 0.5 seconds to the spell&#39;s duration...\r<br />\r<br />[color=#ffcc33]-- Do you use scripts? --[/color]\r<br />[color=#cb99c9]There seems to be a lot of FUD about scripts so let me explain a couple things. Scripts are part of the game, without them vanilla Skyrim wouldn&#39;t work at all[/color]. All vendors and trainers are purely scripted. Most of the quests wouldn&#39;t work without scripts and there must be countless other scripted things in that game I never thought about. [color=#cb99c9]Scripts aren&#39;t inherently bad, inexperienced mod authors are[/color]. Because mod authors used badly explained functions in the past, which is the Creation Kit wiki&#39;s fault, scripts have been pointed as the cause for all the problems in the world... [color=#cb99c9]Like most things in life, clueless people will mess things up, but those that do know how to work with them can do wonders[/color]. As a professional programmer myself, I make sure to the best of my knowledge that all my scripts won&#39;t cause you any trouble. I also make sure they are upgradable and can be stopped at anytime.\r<br />\r<br />With that said, [color=#cb99c9]yes there are scripts in my mod[/color]. In fact there are 2. The first script will execute once and teach the player the lesser power. The second script manages the different permanent bonuses and the consuming a Dragon soul part when you cast the spell. [color=#cb99c9]Those scripts cannot mess your game and are extremely fast to execute[/color]. [color=#fe2e2e]I also packaged the sources[/color] in case you want to look at them and decide for yourself. Stop worrying your world&#39;s gonna implode and enjoy the mod.\r<br />\r<br />[color=#ffcc33]-- Any future plans? --[/color]\r<br />I&#39;ll fix problems (if any), offer support and answer questions when needed.\r<br />\r<br />\r<br />[size=4][color=#ffcc33]My other mods[/color][/size]\r<br />\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/50460/][color=#7dc7ea]Master Trader[/color][/url] (Merchants never run out of gold)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/35567/][color=#7dc7ea]Mod Publishing Tutorial[/color][/url] (Everything you need to know to publish your mod and make your mod page right)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/51256/][color=#7dc7ea]Oghma Infinium - A Training Station[/color][/url] (Just like training with a trainer, but without all the non-sense)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/33860/][color=#7dc7ea]TheThirdRace Skill Overhaul[/color][/url] (Minimalistic and modular skill overhaul aimed at balancing the vanilla skills while maintaining the vanilla feel)\r<br />[/list]",
  "categoryId": "75",
  "version": "1.0.2",
  "author": "TheThirdRace",
  "createdUnix": "1394633730",
  "updatedUnix": "1394803559",
  "containsAdultContent": false,
  "uploadedBy": "TheThirdRace",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101178",
      "name": "Ziil Los Dii Du",
      "version": "1.0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Ziil Los Dii Du-51972-1-0-2.7z",
      "uploadedUnix": "1394803559",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/3e6c88fe0883f3c0619be6857e312fde982a788febe38213ecd15fde994e5e01/analysis/1407982083/",
      "changelogHtml": " - Fixed the version number I forgot to change from 1.0.0 to 1.0.1 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ziil%20Los%20Dii%20Du-51972-1-0-2.7z?fid=1000101178&ttl=1535834707&ri=8192&rs=8192&setec=f9bd35b97edec1f7df8c28d0ff631b71"
    }
  ]
}