{
  "modId": 5198.0,
  "modName": "Tattoo Pack for CBBEv2 Females",
  "summary": "Full Back and Lower Back Tattoos in the style of my Full Body Tattoos for CBBEv2 Female Bodies.",
  "descriptionHtml": "I received a lot of requests for just the full back tattoos instead of a full body version, (in the same style) so I created these. There are two placements; full back and lower back/buttocks.\r\n\r\nFull Back:\r\n\r\nDragon with \\\"Dragonborn\\\" text included. (Oblivion style) \r\n\r\nSkull: Giant skull which extends down a bit lower. Suitable for the aspiring Assassin or Necromancer. \r\n\r\nBuddha: It\\'s just a design which works really well on the models.\r\n\r\nLower Back/Buttocks:\r\n\r\nButterfly: Moves very smoothly when the model is running.\r\n\r\nFairies: Very small symmetrical design which moves while running; just smaller than the butterfly.\r\n\r\nJolly Roger: Asymmetrical design for the deviant personality. Text says \\\"No Joy.\\\" (Oblivion font) The design works a bit better on the skinner models. (very mild distortion at _1)\r\n\r\nThe \\\"elven armor,\\\" in one of the jpegs, if I dare call it that, is a heavily modified version of Killer Keos\\' (sp?) versions for the CBBEv2 body. I modified it so when I\\'m running the \\\"full body tattoo\\\" version of my tattoo textures, I could actually see the majority of the designs while I\\'m playing. \r\n\r\nCredit goes to Caliente and Aknot for the body and texture design. ",
  "categoryId": "29",
  "version": "v1",
  "author": "Jammer",
  "createdUnix": "1325571189",
  "updatedUnix": "1325571424",
  "containsAdultContent": true,
  "uploadedBy": "jammer2006",
  "primaryFile": null,
  "files": [
    {
      "fileId": "16124",
      "name": "Tattoo Pack 1",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14557",
      "fileName": "Tattoo Pack 1-5198-v1.rar",
      "uploadedUnix": "1325571424",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/0414e119788a5431e6a81a831fe7ce07d29fd3a8ae6db6b54807b65a86b9b39a/analysis/1406578826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tattoo%20Pack%201-5198-v1.rar?fid=16124&ttl=1535761754&ri=8192&rs=8192&setec=c4288492ab6b9c0a003ca57cf355ce9a"
    }
  ]
}