{
  "modId": 51983.0,
  "modName": "Oghma Infinium Unlimited",
  "summary": "Return of the long lost Oghma Infinium book trick. :)\r<br />My first successful original mod, with the aim of leveling up and advancing quickly.",
  "descriptionHtml": "Oghma Infinium Unlimited\r<br />by: Ledgendary117\r<br />\r<br />Welcome to my first successful mod. :)  I&#39;m happy to introduce and bring back an old trick us gamers once used before the latest update that came with Dragonborn.\r<br />\r<br />Ever since the release of Skyrim, the creators at Bethesda had done a wonderful job of giving us an elaborate open world game to which they allowed its players on PC to make their own creations and modifications to their game and share with others for the whole world to enjoy.  In the latest update they tactically took away the otherwise popular method of using the Oghma Infinium book trick to level up your character quickly to 81.  Now that there is no level cap, they corrected this issue and can no longer use it like we once did, aww, what a pity :(\r<br />\r<br />Well, I&#39;m here to say &#34;not anymore, mwahaha lol :P&#34;  If you should so desire this trick has returned with the use of my mod with a slight difference, however.  Not only are you able to use the trick like before, it will max out 1 of the 3 classes to 100 when you read it and can be read multiple times if you wish.  So for instance if you wish to max out everything, first activate the bookshelf trigger in a player home bookshelf after getting the book, read it, select a class, then tab back, read it again, select another class, tab back, read again, and select the last remaining class, tab back then store the book in the book shelf.  You should see the book in its proper place in the bookshelf.  Now have a look at your level ups and tah dah&#33;&#33;  When taking the book back into your inventory from the bookshelf, select don&#39;t read, then you can safely repeat the process like before.\r<br />\r<br />Now you can now reach level 250 in around 15 minutes or so, and yes you can use the legendary advances to however much you feel like.  There is a note about this I&#39;d like to make you aware of however.  When you&#39;ve used the legendary mode 8 times for each skill, stop. You should have 249 perk points which is enough to max out all but 2 perks.  After those 8 times it won&#39;t give you many perk points like before and you&#39;ll spend a long time getting enough perk points to max out even one skill sometimes.  \r<br />\r<br />I&#39;ve successfully used this trick time and time again with no problems and created a unique script as to not mess with the original so if you decide not to use this mod anymore, and wish to uninstall it, your save game should be safe and will go back to its original script for the book itself.\r<br />\r<br />\r<br />Installation Instructions:\r<br />\r<br />Simply put the following files in your Skyrim/Data folder:\r<br />\r<br />Data/OghmaInfiniumUnlimited.esp\r<br />Data/OghmaInfiniumUnlimited.bsa\r<br />\r<br />Run the Skyrim Launcher (normally through Steam), and make sure the mod is activated, then exit.\r<br />\r<br />Add or write in OghmaInfiniumUnlimited.bsa to your skyrim.ini file (located in My Documents/My Games/ Skyrim) under [Archive] sResourceArchiveList2 so that the plugin will know where to get its required files.  Save, then change its file properties to read only, so that the game won&#39;t revert back to its original settings when exiting the game.  It also helps to add any bsa&#39;s from other mods in the same order just like you have listed in your load order, not sure if it really makes a difference or not, but it does help slightly in performance as far as priority goes.\r<br />\r<br />Start the game as you normally would via launcher or skse_loader, load your save, then bring up the console with the &#34; ~ &#34; key and type &#34;refreshini&#34; and enter.  Save your game or make a new save, then quit and load your save game again.\r<br />\r<br />Load order for this mod is unimportant, can be placed anywhere, however, should be at least after SkyUI which I highly recommend along with the SKSE script extensions, although they are NOT required for the use of this mod.  Should be compatible and safe with just about every mod available so long as they don&#39;t change the script for this book specifically.  As an unintended bonus, I&#39;ve also corrected the outcome of the Gildergreen tree in Whiterun so that at the end of &#34;the blessings of nature&#34; quest it shows the young sapling and not the old tree meshed into it.  It was actually really simple to do and forgot that I did that in the early development of this mod, so you&#39;re welcome :)\r<br />\r<br />\r<br />Permission Notes:\r<br />Feel free to use my works in a manner that should be looked at from a constructive point of view as I&#39;ve included the resource materials needed to observe the changes I&#39;ve made, simply extract the bsa file contents and you should find the two script files the mod uses.  They&#39;re subtle, however, should you wish to use them in your own mod do so for your own use, and credit me as the original author if you decide to publish your works based on this mod.  This will be a Nexus Mod exclusive for the time being, however, I do have plans on uploading to the Steam Workshop as well in the future due to it being small in size and are the only places which I feel are the best places suited for it.  You may not publish my work to any other site, however, you may reference it via link where available.  Thank you for your understanding.",
  "categoryId": "98",
  "version": "1.0",
  "author": "Ledgendary117",
  "createdUnix": "1394533180",
  "updatedUnix": "1394532860",
  "containsAdultContent": false,
  "uploadedBy": "Ledgendary117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100809",
      "name": "Oghma Infinium Unlimited",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Oghma Infinium Unlimited-51983-.rar",
      "uploadedUnix": "1394532860",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/41b484d601f1324a5fca21072697f607ee28718143d51c8656062d681333c093/analysis/1407978222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oghma%20Infinium%20Unlimited-51983-.rar?fid=1000100809&ttl=1535834721&ri=8192&rs=8192&setec=39988138e48d6f4fb0b877e1df2a88d8"
    }
  ]
}