{
  "modId": 52005.0,
  "modName": "Mittens The Cook",
  "summary": "Custom food merchant for The Elder Scrolls V: Skyrim",
  "descriptionHtml": "[center](Originally uploaded on the steam workshop a while ago, I finally decided to put my mod on nexus. [http://steamcommunity.com/sharedfiles/filedetails/?id=134819179])[/center]\r<br />\r<br />[b][center]DESCRIPTION:[/center][/b]\r<br />Have you ever noticed there are no real food stores in Skyrim? Well i do&#33; This mod adds a new store and NPC to the city of Whiterun. He&#39;s a Khajiit male with as name Mittens (His Childhood name). Mittens&#39;s store can be found behind Arcadia&#39;s Couldron. Mittens sells not only raw food but also cooked food like Cooked Salmon, Elsweyr Fondue and also some *drum rolls* CUSTOM FOODS&#33; Yeah thats right. This mod also adds some custom food into the game which can be bought&#33; This custom food is worth to buy because you really get some neat bonusses when eating. \r<br />\r<br />[b][center]THE STORY:[/b][/center] \r<br />Mittens was born in Elsweyr, At young age he started cooking and he loved it. His friends started to call him Mittens because in their eyes he was just a softy who cooks all the time. His real name is J&#39;Sarso. Mittens actually liked the name and kept it. When Mittens was old enough he decided to leave Elsweyr and travel all over Tamriel to look for new foreign food that he could taste and cook himself. His goal is to learn to make every meal there is in Tamriel. Mittens traveled North from Elsweyr until he arrived in Cyrodill. After visiting every city in Cyrodill and learning lots of new recipes and food he continued to travel North. After a while he passed Bruma he knew he was close to the border. It was getting colder and colder but finally he arrived in Skyrim. After some tough bandit raids he succeeded to reach Riften. He really loved Riften. He loved the wooden house styles and the architecture. He bought himself the cheapest house availeble in RIften and Settled in. Soon enough he found out the city of Riften isn&#39;t that nice. When he knew about the thiefs guild pressence in the city he quickly packed his stuff, Sold his house for half the price and continued traveling North-West until he arrived in Whiterun. But this time Mittens hated the house styles. But he saw a wonderfull opportunity to set up shop here. So he did. He hired some craftsmen to build his &#34;Riften styled log house&#34; He loved so much. When his shop/house was build he settled in right away and opened up his shop. That&#39;s Mittens&#39;s story until this present day. \r<br />\r<br />Mittens&#39;s wares are restocked everyday. So if you buy everything on him just wait 24 hours (ingame time ofcours) and his wares will be fully restocked again&#33;\r<br />\r<br />[b][center]Known Issues:[/b][/center]\r<br />- Mittens&#39;s shop never closes. So he basicly keeps selling stuff at 2 am \r<br />- Mittens never sleeps&#33;?&#33; Now idea what causes this but Mittens never goes to sleep and keeps selling stuff. ",
  "categoryId": "69",
  "version": "V1",
  "author": "Zicasius",
  "createdUnix": "1394562064",
  "updatedUnix": "1394561503",
  "containsAdultContent": false,
  "uploadedBy": "kaj121",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000100831",
      "name": "Mittens The Cook",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Mittens The Cook-52005-V1.zip",
      "uploadedUnix": "1394561503",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/8c520afb083c0249b34e22ce300c643b1c15a451f0d77db140c091d62aa9676f/analysis/1407978390/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mittens%20The%20Cook-52005-V1.zip?fid=1000100831&ttl=1535834751&ri=8192&rs=8192&setec=6cc0c2431a1a044ec3abc7f37c01f4c2"
    }
  ]
}