{
  "modId": 52019.0,
  "modName": "Follower Commentary Overhaul - FCO",
  "summary": "A mod which injects new life into the vanilla followers of Skyrim by greatly expanding their repertoire of idle, conditional commentary after the fashion of the Inigo follower, using only vanilla resources.",
  "descriptionHtml": "[img]http://i1182.photobucket.com/albums/x445/terzaerian/report.png[/img]\r<br />\r<br />[size=4][b]FCO 1.3 MCM Pre-Update released&#33; Current users: no special action should be required for this update.[/b]\r<br />[/size][line]\r<br />\r<br />Skyrim followers have a problem: they&#39;re boring. Once you&#39;ve recruited them, 99% of them turn into mute robots whose entire purpose is summed up in three directives:\r<br />\r<br />[list=1]\r<br />[*]Kill the enemy[/*]\r<br />[*]Look cool[/*]\r<br />[*]Carry my burdens[/*]\r<br />[/list]\r<br />Follower mods, such as the [url=http://www.nexusmods.com/skyrim/mods/40960/?]superlative Inigo,[/url] are an exemplar for the way things [i]should[/i] be - they react to their surroundings, to your actions, to what you&#39;re wearing or even just dragging around in your inventory, and what you do. It makes them feel more like companions with you on a journey. What these mods don&#39;t do, however, is fix vanilla followers in the same fashion.\r<br />\r<br />So that&#39;s what I set out to do.\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/videos.png[/img]\r<br />[center][youtube]LgA5tBnxnsk[/youtube] [youtube]_fPSIj6d7-g[/youtube][/center]\r<br />[center][youtube]For774YNFuY[/youtube] [youtube]SJcsvoYCX8I[/youtube][/center]\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/features.png[/img]\r<br />\r<br />Follower Commentary Overhaul does two things: first, it goes through follower commentary as originally added to the game and &#34;unlocks&#34; it for the use of the whole voicetype. My [url=http://www.nexusmods.com/skyrim/mods/51194/?]Anska mod[/url] already works the same way: it takes lines that, before, were &#34;locked&#34; on to Mjoll&#39;s NPC specifically, and made them valid commentary for any follower NPC using the FemaleNord voicetype. Follower Commentary Overhaul blows the doors off by doing the same for most of the existing idles.\r<br />\r<br />Secondly, Follower Commentary Overhaul adds new idles to all vanilla follower voicetypes who did not have their own in a fashion similar to my [url=http://www.nexusmods.com/skyrim/mods/51519/?]Nazeem mod[/url]: I comb through the audio for each voicetype and pick and cut good comments, and then attach them to the voicetype in the game when they have been picked up as followers. \r<br />\r<br />In total, over 1,000 lines of dialogue for the 18 vanilla follower voicetypes were added in; some exactly as they are found elsewhere in the game, others with minor edits, cuts or recombinations where this could be done without ruining the audio quality. This is also done in such a fashion that each voicetype in a sense becomes a personality: for example, the FemaleCommander will call out hostile archers and mages as targets in combat; MaleKhajit pines for his homeland of Elsweyr; FemaleEvenToned will notice if you&#39;re infected with a disease and exhort you to get treatment. Other idles are conditionally bound to only occur after certain points in your&#39;s or your follower&#39;s development - they&#39;ll only start talking about dragons after Mirmulnir lets the cat out of the bag, or will begin reveling in their growing mastery of the arcane, or marksmanship prowess.\r<br />\r<br />This is all accomplished completely through dialogue topics - the only script MCM employs is a single script that initializes its MCM engine; everything else is accomplished by conditions that narrow down the contexts in which a line will be considered valid. \r<br />\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/updateinstructions.png[/img]\r<br />\r<br />[size=4][b]From 0.9 to 1.0:[/b][/size] 1.0 sees FCO updated to pack its files into a BSA. If 0.9 was installed with NMM or MO, simply fully uninstall 0.9 and install 1.0 fresh - the MCM has not yet been updated so nothing should change in-game. If you installed FCO manually, remove the following directory and files:\r<br />\r<br />Data[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]sound[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]voice[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]FCO - Follower Commentary Overhaul.esp\r<br />\r<br />Data[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]SEQ[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]FCO - Follower Commentary Overhaul.seq\r<br />Data[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]Scripts[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]FCO_MCM_Config.pex\r<br />Data[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]Scripts[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]Source[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]FCO_MCM_Config.psc\r<br />Data[img]http://i1182.photobucket.com/albums/x445/terzaerian/forwardslash.png[/img]FCO - Follower Commentary Overhaul.esp\r<br />\r<br />Then add 1.0 to the Data directory.\r<br />\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/faq.png[/img]\r<br />\r<br />[list]\r<br />[*]Q) Will this work with [my favorite follower mod?][/*]\r<br />[*]A) Yes&#33; [b]Any follower mod that uses a vanilla voicetype will benefit from this mod without suffering a conflict.[/b] So this means vanilla followers as well as custom followers added by a mod, as long as that follower is still using a vanilla voicetype. It will also not conflict with followers who use a custom voice-type.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Will this work with followers from the DLCs?[/*]\r<br />[*]A) In general the same rules apply here as for custom followers - if they use a vanilla voicetype, they will benefit from FCO. That said, well-known followers like Serana, Teldryn Sero, and Neloth don&#39;t use a vanilla voicetype; however, adding an FCO module for them has been a frequent request, so it is on my radar.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Will this work with non-English versions of Skyrim?[/*]\r<br />[*]A) Currently a dedicated team is working on making translations of FCO into other languages - many of these can be found [url=http://www.nexusmods.com/skyrim/mods/52982/?]here.[/url] Translations not hosted on the Nexus will also be linked through this page.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Followers are talking while I&#39;m in dialogue, can this be disabled?[/*]\r<br />[*]A) I&#39;ve looked at this problem from a couple different angles but overall I am being lead to the same conclusion; the solutions will be worse than the problem. It is an issue the [url=https://www.youtube.com/watch?v=nsdtwYAALg4]Interesting NPCs[/url] crew has also grappled with, and the solution seems to be either to a) load up each commentary quest with dozens if not hundreds of conditions keyed to specific quests and NPCs in an attempt to pause them during quests, which is still going to not be able to account for NPCs and quests added by DLCs and mods, or b) add an always-on Papyrus script, which is even worse. My final verdict is that this is a bug that simply must be tolerated, yet another problem made by Skyrim&#39;s engine that cannot be fixed.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Followers seem to chatter before they get recruited, is this intentional?[/*]\r<br />[*]A) Partly a bug. Early in development, I tried to tie follower comments to being in CurrentFollowerFaction, which would have only turned the comments on while they were following - for whatever reason, this broke links to the audio file in the CK, but PotentialFollowerFaction did not. I have however since discovered why this bug occurs. When I do the major feature update for the MCM, I will add a toggle for whether only Current or all Potential followers should be able to say idles.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Where should this go in my load order?[/*]\r<br />[*]A) I&#39;ll be totally honest with you, I&#39;m not sure myself. The fact that it conflicts with so little and reuses resources as new dialog topics means it lacks a defined role or category to go in. My best estimation is that, seeing as its overall design is similar to [url=http://www.nexusmods.com/skyrim/mods/23390/?]Guard Dialogue Overhaul[/url], that it will go near that, and in my load order, GDO is comfortably in the middle. Hopefully the BOSS wizards will help elucidate matters on this front soon.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I find it unlikely that [x follower] from [y location] would know about [z topic].[/*]\r<br />[*]A) Trying to figure out what was too much or too little for a follower to know or say was a challenge. That said, I feel I did a good job of picking topics that would be considered the &#39;nightly news&#39; of Skyrim. People obviously travel between holds - and provinces&#33; - frequently, so I don&#39;t think it&#39;s too much of a stretch to expect news to travel (especially when your character [i]is[/i] the news).[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I think it&#39;s out of character for [x] to say [y].[/*]\r<br />[*]A) I can go either way on this one. Especially when it comes to idles playing (or not playing) on specific characters (i.e. Mjoll, Erandur, etc.), FCO ultimately boils down to how I&#39;ve interpreted the characters by examining other things they say and do in the game. What is important for me to change and fix is when the interpretation is factually flawed or nonsensical - i.e. a character like Erandur mentioning being born in Morrowind when we know he was born in Skyrim, or one of your housecarls always addressing you as &#34;my Thane&#34; even if you&#39;re married. These are oversights which I will strive to fix.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) This voicetype is saying this line way too much and it [i]bugs me[/i]&#33;[/*]\r<br />[*]A) I am absolutely dead serious when I tell you to [b]complain about this[/b]. Building this mod was time-consuming; so time-consuming I didn&#39;t have much of a chance to playtest it in the wild, mainly just functional tests to make sure conditions, lip-synchs and the MCM were working. I sincerely want to hear feedback on comment frequency so I can adjust cooldowns and tweak conditions accordingly, so by all means, leave it&#33;[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I keep an unsafe amount of followers in my house and it&#39;s a cacophony of madness&#33;&#33; How do I stop it[/*]\r<br />[*]A) Don&#39;t fret, I&#39;ve got you covered&#33; FCO includes an MCM where you can adjust the frequency at which comments are made as well as which voicetypes are able to make them&#33; 100% is the default frequency, and is balanced best for vanilla play or small groups of followers, but if you roll with a large following in combat or at home, you can slide it on all the way down to 10% frequency. If you only want particular voicetypes chiming in, or just can&#39;t stand one in particular, you can switch them on and off at will as well.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I&#39;ve turned the frequency down and it doesn&#39;t seem to have done anything&#33;[/*]\r<br />[*]A) First you need to verify whether or not the menu is working. After changing the setting, input &#34;help fco&#34; into the console, and look for a global titled &#39;FCO_Frequency.&#34; If it matches what you&#39;ve set in the MCM then the menu is functioning. If it doesn&#39;t, then something is wrong - if your build has a lot of active, constantly running scripts, then it&#39;s possible MCM is not applying settings right away, if at all. Either way, though, you STILL can change the frequency. Use the console command to alter globals to change FCO_Frequency to a level more amenable to you. ALSO, note that if you reload frequently that this probably resets the cooldowns on the various idles - I wouldn&#39;t assume that dialog cooldowns are stored as variables when you save (nor would I want that - can you say &#34;save bloat?&#34;).[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) This voicetype seems to have a lot more to say than this other voicetype.[/*]\r<br />[*]A) Unfortunately, not all voicetypes were made equal - some of them had a lot more material to work with than others. I tried to keep things fair and set a minimum of at least 50 comments for each voicetype, but some just had too much material to pass up. That said, if you come to this conclusion after just installing the mod and running it a couple minutes, please keep going - a lot of the idles are locked behind conditions that will only open up after a quest starts, while a quest is running, or after a quest ends, or after a follower crosses a skill threshold, or when you and your follower travel to different places.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) A particular NPC isn&#39;t making comments, although others with a shared voicetype are&#33;][/*]\r<br />[*]A) This is a very unusual malady which I&#39;ve dubbed Salah-ah Din&#39;s Disorder, or SaDD, after the Nexus user who was its &#34;patient zero.&#34; What I think is going on is that the NPC&#39;s AI and their dialogue stack have gotten into a head on collision and stopped cycling normally. It seems to be triggered by an NPC which is in the party but has been stuck in a cell which has been zoned out and then rejoins the party through automatic means (such as fast travel). The fix is actually easy: get that NPC into combat. Changing their AI state from idling to combat &#34;jogs&#34; their memory, and once the fight is over, they&#39;ll get back on track.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) This is a cool mod, but there is this one NPC I really wish was a follower that isn&#39;t, and it makes me sad. Could you make them into one?[/*]\r<br />[*]A) Requests are my specialty&#33; [url=http://www.nexusmods.com/skyrim/mods/51519/]Nazeem Reloaded[/url] grew out of a request made in the thread for my first mod, [url=http://www.nexusmods.com/skyrim/mods/51162/?]Heimskr Forever,[/url], and this very mod grew out of a request for an &#34;Enhanced Lydia&#34; that was made in the thread for [url=http://www.nexusmods.com/skyrim/mods/51194/?]Anska Enhanced[/url]. Just drop me a line in the main thread here or the request thread&#33;[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I made a follower with the FemaleNord/MaleDarkElf/etc. voicetype and s/he doesn&#39;t have any follower dialog, even though he has comments&#33;[/*]\r<br />[*]A) This is a shortcoming of Skyrim&#39;s design where, for whatever BONEHEADED reason, Bethesda pointed a bunch of follower dialog at NPC references instead of voicetypes in the conditions. I was considering rolling a full fix to this into FCO but decided that, for this mod at least, it was out of scope and introduced too many potential compatibility issues with EFF/UFO/AFT. The design of my mod, on the other hand, points at voicetypes, so they&#39;ll still make quips even though they can&#39;t join your group (at least, via dialog menu). That said, I&#39;m not ruling out the possibility of a future mod which fixes the defective voicetypes in the future, so stay tuned&#33; In the meantime, [url=http://www.nexusmods.com/skyrim/mods/51194/?]Anska[/url] and [url=http://www.nexusmods.com/skyrim/mods/51162/]Heimskr[/url] do fix their respective Fe/MaleNord voicetypes, so you can use those mods as a fix for those two voicetypes in the meantime.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) The followers in the title screen here look different than mine&#33; This mod won&#39;t change them, will it?[/*]\r<br />[*]A) No, this mod changes no NPC records, it merely references them. Aesthetic differences in my title screen are just how the followers appear in my personal Skyrim build.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I want to use this mod, but I don&#39;t like SkyUI&#33;][/*]\r<br />[*]A) I admit that it&#39;s a sentiment I have a hard time understanding, as SkyUI is overall a superb piece of work that at least merits a try. If you&#39;re dead set against using it, though, [url=http://www.nexusmods.com/skyrim/mods/29440/?]SkyUI-Away[/url] will give you the principle advantage of SkyUI (MCMs) while reverting your UI to vanilla normalcy. If you still don&#39;t want to install SkyUI, you&#39;re just going to have to wait until the MCM overhaul of FCO, which will make it a little more robust with regards to non-SkyUI builds.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) The posted version is [x] but the changelog says the latest version is [x+y], should I hold off installing?[/*]\r<br />[*]A) If the difference between [x] and [y] is lesser than 1 (i.e. 0.5 to 0.6, etc.) then it will be fine to install - it means the next update is incremental and just changes cooldowns and conditions applied to idles, and requires no special procedures. However, if the difference is a whole number or can get rounded up to one (i.e. 0.5 to 1.0, then most likely a major revision is in the works and it would be wise to hold off until its release.[/*]\r<br />[/list]\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/credits.png[/img]\r<br />\r<br />As I said, this mod was inspired by the great work done on the [url=http://www.nexusmods.com/skyrim/mods/40960/?]Inigo[/url] mod, but also took cues from [url=http://www.nexusmods.com/skyrim/mods/23390/?]Guard Dialogue Overhaul[/url] and the [url=http://www.nexusmods.com/skyrim/mods/49644/?]Michael Rosen in Skyrim[/url] mod - when stuck looking for a Condition Function I was often able to turn to them to find just the right one. Make no mistake, this doesn&#39;t mean I copy-pasted them whole-sale out of that mod, just that often these mods made me aware of Condition Functions that prior I had no idea existed.\r<br />\r<br />If you deal with dialogue in your mods I cannot recommend [url=http://www.nexusmods.com/skyrim/mods/19242/?]Unfuzer[/url] enough - this makes extracting and packing audio from and into .fuz files miraculously easy. Save Nexus bandwidth and your own disk space - .fuz your dialogue with Unfuzer&#33;\r<br />\r<br />Credit for the thumbnails for the voice charts goes to [url=http://www.uesp.net/wiki/Main_Page]UESP Wiki[/url], used in accordance with the [url=http://creativecommons.org/licenses/by-sa/2.5/]Attribution-ShareAlike 2.5 license.[/url]\r<br />\r<br />As usual with all my mods, I recommend [url=http://www.nexusmods.com/skyrim/mods/12933/?]Extensible Follower Framework[/url]&#33; \r<br />\r<br />A huge thanks to [url=https://www.youtube.com/user/LiveStyleGaming]LiveStyleGaming[/url], [url=https://www.youtube.com/user/NicesWalkthroughs]Nice&#39;s Walkthroughs[/url], and [url=https://www.youtube.com/user/Brodual]Brodual[/url] for making video showcases of Follower Commentary Overhaul&#33;\r<br />\r<br />Credit also goes to [url=http://www.nexusmods.com/skyrim/users/3212339/?]Dienes[/url], who helped me finish off the MCM menu with a simple, elegant solution.\r<br />\r<br />Finally, I&#39;d like to thank [url=http://www.nexusmods.com/skyrim/users/2748582/?]deane9850[/url], who sparked everything off in [url=http://www.nexusmods.com/skyrim/mods/51194/]Anska&#39;s[/url] comment section by suggesting a Lydia Overhaul mod - this entire mod spun and exploded out from that original idea.\r<br />\r<br />[url=http://creativecommons.org/licenses/by-nc-sa/4.0/][img]https://i.creativecommons.org/l/by-nc-sa/4.0/88x31.png[/img][/url]\r<br />This work is licensed under a [url=http://creativecommons.org/licenses/by-nc-sa/4.0/]Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License[/url].",
  "categoryId": "78",
  "version": "1.3",
  "author": "terzaerian",
  "createdUnix": "1396029948",
  "updatedUnix": "1401669760",
  "containsAdultContent": false,
  "uploadedBy": "terzaerian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102663",
      "name": "Follower Commentary Overhaul",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30714",
      "fileName": "Follower Commentary Overhaul-52019-0-5.7z",
      "uploadedUnix": "1395976794",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/677590e90b58f4cb1fc336a0a3665bb8d713d68dad7c854c6c650a58373d0601/analysis/1407997637/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-0-5.7z?fid=1000102663&ttl=1535834770&ri=8192&rs=8192&setec=2e0019a3586d8dbf6e9eea25eca1d7f0"
    },
    {
      "fileId": "1000102896",
      "name": "Follower Commentary Overhaul",
      "version": "0.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30714",
      "fileName": "Follower Commentary Overhaul-52019-0-6.7z",
      "uploadedUnix": "1396127416",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/a90baeb186748ddea2032c7c2eaa89e9fb3e2222176800e0521fd3ef63a027c3/analysis/1407999602/",
      "changelogHtml": " Cooldown tweaks to repetitive lines <br/> \n Sleeping followers should no longer comment in their sleep <br/> \n MaleEvenToned no longer remarks on the freshness of Skyrim air while inside Soul Cairn <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-0-6.7z?fid=1000102896&ttl=1535834771&ri=8192&rs=8192&setec=47b335048954b37e10603de4cac530df"
    },
    {
      "fileId": "1000103110",
      "name": "Follower Commentary Overhaul",
      "version": "0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30714",
      "fileName": "Follower Commentary Overhaul-52019-0-7.7z",
      "uploadedUnix": "1396231999",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/23ba99798586275ebf413c7e98d0ae07434dd244469b63f4e48cb2068d525e15/analysis/1408001614/",
      "changelogHtml": " MaleEvenToned will only pray about dragons coming at night at night or while at temple <br/> \n Cooldowns tweaked on more exasperated MaleEvenToned idles among others <br/> \n FemaleYoungEager will only request sausages if she has no food in her inventory (and you do) <br/> \n Followers should no longer mistake dragons for wizards or warriors of any sort. <br/> \n FemaleOrc will only order the enemy to lay down their weapons if they have weapons to lay down <br/> \n FemaleEvenToned will only comment about &#34;one man&#39;s trash&#34; if you are carrying trash around <br/> \n MaleYoungEager will no longer comment on the beauty of the trees around him while indoors <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-0-7.7z?fid=1000103110&ttl=1535834772&ri=8192&rs=8192&setec=97cfe5de2df11f2c9445cdadb3814295"
    },
    {
      "fileId": "1000103476",
      "name": "Follower Commentary Overhaul",
      "version": "0.8",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "30857",
      "fileName": "Follower Commentary Overhaul-52019-0-8.7z",
      "uploadedUnix": "1396484192",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/09feb1449f0554e20f2d6f9572c97aabf3bb178c8ee5f6554f840d04b0f23a4d/analysis/1408005135/",
      "changelogHtml": " Added four missing voice clips from FemaleEvenToned <br/> \n MaleDarkElf should stop comment about &#34;liking the lake here&#34; while deep underground <br/> \n MaleEvenToned will only comment on Kolskeggr mine while in the Reach <br/> \n More tweaks on cooldowns <br/> \n Global update to all voicetypes: followers will limit their topics of conversation while in temples and High Hrothgar. They will still make comments but generally should not be &#34;irreverent.&#34; <br/> \n Please note that Orcs and Khajit are, however, still unlikely to respect the mores of human society re: temples and High Hrothgar. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-0-8.7z?fid=1000103476&ttl=1535834772&ri=8192&rs=8192&setec=96d545f21f1afaa230cbd764769511e6"
    },
    {
      "fileId": "1000104199",
      "name": "Skyrim Transcript",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1313",
      "fileName": "Skyrim Transcript-52019-.zip",
      "uploadedUnix": "1397001645",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6bce3c87c34ef97298e5ec33b577dd4816148837d081242dcba6467b4d2b64fe/analysis/1408012336/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Transcript-52019-.zip?fid=1000104199&ttl=1535834773&ri=8192&rs=8192&setec=c1f5aed96184bc958807cbd3a898e0ea"
    },
    {
      "fileId": "1000105145",
      "name": "Follower Commentary Overhaul",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31527",
      "fileName": "Follower Commentary Overhaul-52019-0-9.7z",
      "uploadedUnix": "1397617827",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/e65d4aa3f1719a52fc1f0054efa6d63e7c4ed73afe3f2bf3845322a55b78deaa/analysis/1408023368/",
      "changelogHtml": " Housecarls married to the player will be less formal with the player <br/> \n Sven/Faendal will stop pining for Camilla if married to the player <br/> \n Cooldown changes to MaleYoungEager, FemaleCommander <br/> \n Followers should stop commenting on the Shrine of Azura if at the Shrine or if the Black Star has been completed <br/> \n Added Random End flags to idle pools; hopefull this will help optimize performance and repetition. <br/> \n Fixes to conditioning of MaleEvenTonedAccented idles <br/> \n MaleDarkElf residents of Whiterun should not longer talk about not having visited Whiterun before <br/> \n MaleKhajit should no longer talk abou the important of Nord ruins to &#34;you Nords&#34; if the player is not a Nord <br/> \n Added ~40 idles to MaleBrute <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-0-9.7z?fid=1000105145&ttl=1535834774&ri=8192&rs=8192&setec=cea8abeb27bedff8919a1771bbbff912"
    },
    {
      "fileId": "1000109335",
      "name": "Follower Commentary Overhaul",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31533",
      "fileName": "Follower Commentary Overhaul-52019-1-0.7z",
      "uploadedUnix": "1400290912",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1fe4f3dae696a4aead43709fe6c619b4c867fae727bbc0fb3b1723298cc951b/analysis/1408080204/",
      "changelogHtml": " KhajiitMale will not educate player about khajiit if the player is him/herself khajiit <br/> \n MaleBrute will not educate player about Wuuthrad after player joins the Circle <br/> \n MaleBrute will not continue talking about Ulfric&#39;s escape long into the Civil War questline <br/> \n MaleDarkElf will not talk about finding the Ratway if the player has joined the Thieves Guild <br/> \n MaleDarkElf will only talk about preferring daggers if he is currently using one <br/> \n FemaleCommander will not call you a tiny softgut if married to you <br/> \n FemaleCommander should only comment about trouble on the roads while on the road <br/> \n FemaleCommander should definitely stop talking about &#34;Dragonreach, up on the tall hill&#34; when in Dragonreach <br/> \n FemaleCommander will limit talk about Falkreath to the city proper <br/> \n MaleEvenToned will not exhort you to be careful if you head into the ruins while in the ruins <br/> \n Cooldowns increased on FemaleDarkElf, MaleDarkElf, MaleEvenToned, FemaleEvenToned, and FemaleCommander idles <br/> \n FemaleEvenToned will only caution you to watch out for pressure plates while inside a dungeon <br/> \n Forsworn barks keyed to ForswornFaction rekeyed to DruadachRedoubtFaction <br/> \n Changed conditions on idles that are negative about the Forsworn, not to play if the speaker is in DruadachRedoubtFaction <br/> \n Orcs will now bellow about the player&#39;s monotony less frequently <br/> \n MaleBrute tweaked to check against their own/the player&#39;s skill in twohanded/onehanded before talking about swords <br/> \n FemaleYoungEager will not talk about hearing street musicians yesterday, while on the street <br/> \n Followers should only talk about getting work while near lumber mills, smelters, and mines. <br/> \n FemaleNord will not ask if you&#39;ve been to the Blue Palace if you are currently in it <br/> \n FemaleYoungEager and FemaleDarkElf will base praise for your dragon-fighting prowess on total rather than current number of dragon souls absorbed <br/> \n Comments about the Reach will not play inside Dustman&#39;s Cairn <br/> \n [b]Files now packed into a BSA. Please refer to Update Instructions.[/b] <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-1-0.7z?fid=1000109335&ttl=1535834774&ri=8192&rs=8192&setec=b9e0bc46e5784304daa842931fba0684"
    },
    {
      "fileId": "1000109337",
      "name": "FCO Loose Files",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "31470",
      "fileName": "FCO Loose Files-52019-1-0.7z",
      "uploadedUnix": "1400292391",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/77b49ce99878d04be09428337decab8acabef185ad7b0875ed4dc2b0db2907bd/analysis/1408080233/",
      "changelogHtml": " KhajiitMale will not educate player about khajiit if the player is him/herself khajiit <br/> \n MaleBrute will not educate player about Wuuthrad after player joins the Circle <br/> \n MaleBrute will not continue talking about Ulfric&#39;s escape long into the Civil War questline <br/> \n MaleDarkElf will not talk about finding the Ratway if the player has joined the Thieves Guild <br/> \n MaleDarkElf will only talk about preferring daggers if he is currently using one <br/> \n FemaleCommander will not call you a tiny softgut if married to you <br/> \n FemaleCommander should only comment about trouble on the roads while on the road <br/> \n FemaleCommander should definitely stop talking about &#34;Dragonreach, up on the tall hill&#34; when in Dragonreach <br/> \n FemaleCommander will limit talk about Falkreath to the city proper <br/> \n MaleEvenToned will not exhort you to be careful if you head into the ruins while in the ruins <br/> \n Cooldowns increased on FemaleDarkElf, MaleDarkElf, MaleEvenToned, FemaleEvenToned, and FemaleCommander idles <br/> \n FemaleEvenToned will only caution you to watch out for pressure plates while inside a dungeon <br/> \n Forsworn barks keyed to ForswornFaction rekeyed to DruadachRedoubtFaction <br/> \n Changed conditions on idles that are negative about the Forsworn, not to play if the speaker is in DruadachRedoubtFaction <br/> \n Orcs will now bellow about the player&#39;s monotony less frequently <br/> \n MaleBrute tweaked to check against their own/the player&#39;s skill in twohanded/onehanded before talking about swords <br/> \n FemaleYoungEager will not talk about hearing street musicians yesterday, while on the street <br/> \n Followers should only talk about getting work while near lumber mills, smelters, and mines. <br/> \n FemaleNord will not ask if you&#39;ve been to the Blue Palace if you are currently in it <br/> \n FemaleYoungEager and FemaleDarkElf will base praise for your dragon-fighting prowess on total rather than current number of dragon souls absorbed <br/> \n Comments about the Reach will not play inside Dustman&#39;s Cairn <br/> \n [b]Files now packed into a BSA. Please refer to Update Instructions.[/b] <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FCO%20Loose%20Files-52019-1-0.7z?fid=1000109337&ttl=1535834775&ri=8192&rs=8192&setec=56eacf6df3dd85e2a97837fbf4026a7e"
    },
    {
      "fileId": "1000109343",
      "name": "FCO 1_0 ESP ONLY",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "81",
      "fileName": "FCO 1_0 ESP ONLY-52019-1-0.zip",
      "uploadedUnix": "1400299297",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a61492f93f48c9d9bc785c86c426244e071bebdc822eb06061de68869e2d428/analysis/1408080284/",
      "changelogHtml": " KhajiitMale will not educate player about khajiit if the player is him/herself khajiit <br/> \n MaleBrute will not educate player about Wuuthrad after player joins the Circle <br/> \n MaleBrute will not continue talking about Ulfric&#39;s escape long into the Civil War questline <br/> \n MaleDarkElf will not talk about finding the Ratway if the player has joined the Thieves Guild <br/> \n MaleDarkElf will only talk about preferring daggers if he is currently using one <br/> \n FemaleCommander will not call you a tiny softgut if married to you <br/> \n FemaleCommander should only comment about trouble on the roads while on the road <br/> \n FemaleCommander should definitely stop talking about &#34;Dragonreach, up on the tall hill&#34; when in Dragonreach <br/> \n FemaleCommander will limit talk about Falkreath to the city proper <br/> \n MaleEvenToned will not exhort you to be careful if you head into the ruins while in the ruins <br/> \n Cooldowns increased on FemaleDarkElf, MaleDarkElf, MaleEvenToned, FemaleEvenToned, and FemaleCommander idles <br/> \n FemaleEvenToned will only caution you to watch out for pressure plates while inside a dungeon <br/> \n Forsworn barks keyed to ForswornFaction rekeyed to DruadachRedoubtFaction <br/> \n Changed conditions on idles that are negative about the Forsworn, not to play if the speaker is in DruadachRedoubtFaction <br/> \n Orcs will now bellow about the player&#39;s monotony less frequently <br/> \n MaleBrute tweaked to check against their own/the player&#39;s skill in twohanded/onehanded before talking about swords <br/> \n FemaleYoungEager will not talk about hearing street musicians yesterday, while on the street <br/> \n Followers should only talk about getting work while near lumber mills, smelters, and mines. <br/> \n FemaleNord will not ask if you&#39;ve been to the Blue Palace if you are currently in it <br/> \n FemaleYoungEager and FemaleDarkElf will base praise for your dragon-fighting prowess on total rather than current number of dragon souls absorbed <br/> \n Comments about the Reach will not play inside Dustman&#39;s Cairn <br/> \n [b]Files now packed into a BSA. Please refer to Update Instructions.[/b] <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FCO%201_0%20ESP%20ONLY-52019-1-0.zip?fid=1000109343&ttl=1535834775&ri=8192&rs=8192&setec=2b844b8081179d0a422ad95cdf928c0e"
    },
    {
      "fileId": "1000110041",
      "name": "Follower Commentary Overhaul",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "31622",
      "fileName": "Follower Commentary Overhaul-52019-1-0-1.7z",
      "uploadedUnix": "1400806788",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ad4d616e3836a22edd21cb6e44bccf14f4ca3cba9ac96dfbc407f5c20ed8c4bb/analysis/1408090559/",
      "changelogHtml": " HirelingIdles locked to CurrentHireling faction have been unlocked to CurrentFollowerFaction re: recent changed implemented by the USKP <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-1-0-1.7z?fid=1000110041&ttl=1535834776&ri=8192&rs=8192&setec=b48613bec6989afa617b081112eb39e2"
    },
    {
      "fileId": "1000111479",
      "name": "Follower Commentary Overhaul",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31624",
      "fileName": "Follower Commentary Overhaul-52019-1-3.7z",
      "uploadedUnix": "1401669760",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e7bdc50839db821c106f9b2b7bcb5195915ce11eabaf3c61b99507d2a88a3c23/analysis/1408108570/",
      "changelogHtml": " MCM Pre-Update: additional settings options added via globals.  <br/> \n Option added to include Spouses as FCO-capable NPCs. <br/> \n Option added to limit FCO idles to current followers only. <br/> \n Vanilla idles assimilated into FCO system. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Commentary%20Overhaul-52019-1-3.7z?fid=1000111479&ttl=1535834776&ri=8192&rs=8192&setec=279244c54f41801f46f026231b14d15b"
    }
  ]
}