{
  "modId": 52046.0,
  "modName": "Darick Skarrs Level Overhaul",
  "summary": "This mod changes the way you level in Skyrim. Previously if you maxed out blacksmithing without leveling your combat skills you would go out into the world severely underpowered. The mod aims to make advancing non-combat skills less detrimental to your characters survival in the world.",
  "descriptionHtml": "This mod changes the way you level in Skyrim. Skills still advance at the same pace as before but leveling a skill gives you half the character experience as before. For example, a level 20 character will be able to achieve roughly the same amount of skill advancements as a level 40 might have achieved. \r<br />\r<br />The reason I created this mod was to address a problem I had with the current leveling system in Skyrim as best I could. Previously if you concentrated on maxing out blacksmithing for instance, without leveling your combat skills, you would go out into the world severly underpowered. To address this, it now takes twice as many skill advancements for your character to level. Advancing blacksmithing or alchemy will be less detrimental to your character while adventuring in the world now.\r<br />\r<br />I would have liked to have left the combat skills alone and just taken away the experience gained from advancing skills like, blacksmithing, alchemy, and enchanting but without using a script extender there doesn&#39;t seem to be a way to do this in the creation kit. While this is not the best solution it does allow you to experience the lower levels of the game more before rushing into all the maxed out level npcs of the game. \r<br />\r<br />This mod was made primarily for myself but I hope some of you enjoy it too&#33;",
  "categoryId": "73",
  "version": "1.0",
  "author": "drake_85",
  "createdUnix": "1394702987",
  "updatedUnix": "1394702640",
  "containsAdultContent": false,
  "uploadedBy": "drake_85",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101040",
      "name": "DS_LevelOverhaul",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "DS_LevelOverhaul-52046-1-0.rar",
      "uploadedUnix": "1394702640",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/25280229c47bfe37b98f9a58b79f168b25c0956a1eebd250d5638b2befd242d9/analysis/1407980582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DS_LevelOverhaul-52046-1-0.rar?fid=1000101040&ttl=1535834811&ri=8192&rs=8192&setec=426dc943c74a7d3140045ba43ca2e81c"
    }
  ]
}