{
  "modId": 52042.0,
  "modName": "Akavir - The War",
  "summary": "ATTENTION. This is not a downloadable mod, please read description for more details ",
  "descriptionHtml": "First Things First:\r<br />This is not a finished mod&#33; This modpage is for people to keep track of the development of this project. We are also treating the endorsements as a “kickstarter” for the DLC as well. What I mean when I say kickstarter is that the more endorsements the more motivation we get into making this mod and also more thing we add into the world.   example:\r<br />                            \t\t\t5:  Extra Side Quests\r<br />\t\t\t\t10: Extension of the Main Questline\r<br />\t\t\t\t20: New Unarmed (Martial Arts) Perk Tree\r<br />\t\t\t\t30: More Villages and Settlements\r<br />\t\t\t\t40: 5 New Cities\r<br />\t\t\t\t50: 20 Extra Dungeons\r<br />\t\t\t\tBeyond 50 Endorsements: TBA ;)\r<br />The download file is only a map of Akavir save it to your pictures and endorse&#33; : )\r<br />\r<br />Storyline:\r<br />The Warlord of Kamal: Sadil Mor’Lu A ruthless Tyrant who once every summer awoke his army and attacked the other countries. With his powers equal to the 9 there was no one person who could slay him. But during the Oblivion Crisis, the confusion was the perfect time for the other countries to attack and an alliance of Tang Mo, Tsaesci, Ka Po Tun and Akavir men was formed and an siege on the Kamal Capital appeared almost out of this air. The army was too much for the Warlord and he was taken in to imprisonment. And for 200 years he was locked away in the deepest prison in all of Nirn. But one day the winds were hot and the sky’s roaring and dragons awoke from there deep slumber and attacked each city after another, the Kamal warlord soon learning about this had finally found his chance and formed attacks on settlements bordering Kamal. Then a man came to the prison seeking the warden, this man is you the Dragonborn and the Warlord knows who you are and tricks you into setting him free now you must go on a journey to stop the Warlord from reaching his goal of immortality and free a land from the terror of the frost.\r<br />\r<br />What is Nirn Creations\r<br />Nirn Creations is a small modding team of 5 people at the moment if you are a modder and you are interested in joining the development of Akavir, we are currently looking for:\r<br />3D Modelers\r<br />\r<br />Landscape Modelers\r<br />\r<br />Quest Creators\r<br />\r<br />Dungeon Designers\r<br />\r<br />City/Town Designers\r<br />\r<br />Interior Designers\r<br />If you are good at any of these please leave a comment. We would love to have you.\r<br />\r<br />Credit: \r<br />Bethesda Softworks: For creating the best video game series in the world.\r<br />Stalker992 http://www.nexusmods.com/skyrim/users/1818819/?: Thanks for joining our team and sharing what you already have created for Akavir, with the team. Without you this modpage would not even be out yet&#33;\r<br />And I would like to thank You: the modding community most all. If it wasn&#39;t for you guys, gaming would probably not be as fun for me\r<br />\r<br />More to come ; )  \r<br />\r<br />\r<br />\r<br />",
  "categoryId": "30",
  "version": "TBA",
  "author": "Nirn Creations",
  "createdUnix": "1394681579",
  "updatedUnix": "1394681579",
  "containsAdultContent": false,
  "uploadedBy": "curim2",
  "primaryFile": null,
  "files": []
}