{
  "modId": 52079.0,
  "modName": "IHAH - Improved Housecarls and Hirelings v5",
  "summary": "UPDATED Feb 9th 2015: Alternate &#34;Skills-Only&#34; version without Shouting.\r<br />UPDATED Oct 5th, 2014: Bug fix for sideways dragons\r<br />UPDATED Oct 1, 2014: Changes to Shouts that reduces the risk of infighting due to late hits.\r<br />UPDATED 9-16-2014: Gives all Housecarls and Hirelings Skill perks befitting their combat style, and select ",
  "descriptionHtml": "[center][b][u][size=4]DrNewcenstein&#39;s Improved Housecarls and Hirelings for Skyrim[/size][/u][/b][/center]\r<br />************Feb 9th 2015 UPDATE*****************\r<br />\r<br />-There is now a version that only gives the Skill Perks to your followers but NOT Shouting abilities, for those who don&#39;t want their followers to Shout, but still want them to have skillz.\r<br />\r<br />Followers DO still benefit from skill-enhancing equipment (i.e. Fortify Archery, Fortify One-Handed, etc.), this version simply removes their Amulet of Jurgen Windcaller and the Shouts from their Spell List, as well as removes the Allow Shouting Perk.\r<br />\r<br />NOTE: Giving any of the affected followers a Super-Skill-Boosting item will make them one-hit wonders, so if you don&#39;t want them killing dragons in one hit or stomping Frost Trolls like they were kittens, don&#39;t overload their gear enchantments. On the other hand, give someone a high-powered version of Gloves of the Pugilist and take away their weapons, so that they can only use their fists, if you want to see them one-punch everything.\r<br />\r<br />The player&#39;s Amulet of Jurgen Windcaller is still there, on the table in Helgen Keep next to Gunjar&#39;s body.\r<br />\r<br />\r<br />\r<br />***********Oct 5th 2014 UPDATE*******************\r<br />\r<br />-Fixed (hopefully) reported issue where Dragons hit with Ice Form would go sideways t-pose.\r<br />\r<br />*************END OF UPDATE***********************\r<br />\r<br />\r<br />**10-1-14 UPDATES**\r<br />REQUIRES DAWNGUARD, HEARTHFIRES, AND DRAGONBORN. THERE WILL NOT BE A VERSION THAT DOES NOT.\r<br />\r<br />-Conditions have been added to the Magic Effects of Unrelenting Force, Fire Breath, Ice Form, and Cyclone so that late hits after combat ends *should* not trigger infighting amongst your followers. It&#39;s not 100%, but out of 3 consecutive tests, they only did it once, so like the song says - 2 out of 3 ain&#39;t bad. If it&#39;s gonna happen, Lydia and Jenassa will be the ones to do it more than anyone else.\r<br />\r<br />As well, Lydia has her own personal version of Unrelenting Force (including the individual spells that make it up) that contains those Conditions, so the Shouting enemies that Immersive Creatures adds will still blow your butt across the room (like that dooshnozzle at Hamvir&#39;s Rest).\r<br />\r<br />-Uploaded a video to my EwwTewb page [url=https://www.youtube.com/channel/UCsgSnbHvgooyrMM3yZDqF4g]https://www.youtube.com/channel/UCsgSnbHvgooyrMM3yZDqF4g[/url]\r<br />\r<br />The original video was 1080p but DerpTube derped it down to 320p, so don&#39;t hit the fullscreen option unless you like retro &#39;80s VHS Vision.\r<br />I&#39;m attempting to find some way to record a better video that doesn&#39;t cost me a lot of money, and doesn&#39;t generate a 6GB file with the lowest settings (Fraps). Right now I&#39;m using NVidia&#39;s ShadowPlay, but the options don&#39;t seem to jive with EwwTewb&#39;s demands for 1080p (I can do 10kbps, but not 8kbps bit-rate).\r<br />\r<br />-At one time, I did write down what I gave everyone, but it&#39;s a very rough sketch that I have no interest in fleshing out. If you want to have a go at deciphering them, get them from my site [url=http://newcenstein.com/SkyMods/IHAH-txts.zip]http://newcenstein.com/SkyMods/IHAH-txts.zip[/url]\r<br />\r<br />Only one missing I think is Erik, but being a farmer all he got was 2-handed stuff (chopping wood, shoveling sheep, hay bales, pushing hoes - that sorta thing). The other 39 have a text file that mentions what they got. \r<br />\r<br />Typically it reads from Traits at the top, then Stats, then Perks/Spells, so if you&#39;ve done any poking around in the CK you should be able to figure it out. Also, I started with Jordis, Rayya, Mjoll, Lydia, and Iona, so theirs are more detailed. Later, I went alphabetically down the Actors list, so &#34;Adelaisa&#34; is more detailed than &#39;Valdimar&#34;. The layout is the same, though. Everyone was set to Player Level with a cap of 85, so if you see a n/85, that&#39;s their Min and Max level.\r<br />\r<br />-Lastly, you may see a change in some of the female faces (Adelaisa and Uthgerd, I think - maybe Illia). I thought I was working with my Effable Females mod when I did that. Sorry.\r<br />\r<br />-IHAH_V2 was not updated with Conditions (the one where they only have one word of the Shout). Sorry. Maybe later.\r<br />\r<br />IHAH v4 does not include IHAH_V2, but the zip containing IHAH_V2 does contain the older version (not v4) of IHAH. If you want to use the full-Shout version, get v4 and delete any other version of IHAH_All.esp you have.\r<br />\r<br />PLEASE put this under/after any other follower mods you have. Otherwise, for some unknown reason, some followers (Jenassa and Mjoll) will not Shout, even if the other mod only changes her physical appearance. The physical change mod still works if it&#39;s above IHAH (at least mine does).\r<br />\r<br />\r<br />****************************************************End of Update News**********************************************************************************\r<br />\r<br />\r<br />This mod adds Skill Perks to all vanilla followers and hirelings, including Dawnguard, Hearthfires, and Dragonborn.\r<br />\r<br />Perks added compliment their vanilla gear (i.e. those who come with Axes or Maces get Axe and Mace perks, but not Sword perks, if they come with a 2-hander, they don&#39;t get Shield or 1-Handed Perks, etc). Most everyone got Archery Perks, except for mages.\r<br />\r<br />Some followers were given Shouts. I did this for my own personal preference.\r<br />\r<br />Spellcasters were also tweaked to remove Chain Lightning, Fireball, Summon Frost Atronach, and Ice Storm spells since they are not party-friendly (I typically run with 6 or more Followers at once).\r<br />\r<br />Those spells have been replaced with Icy Spear, Thunderbolt, Incinerate, and other Summon spells.\r<br />\r<br />Serana has been tweaked to remove these offending spells as well so that she&#39;s better with groups.\r<br />\r<br />\r<br />There are 2 versions of this mod: \r<br />\r<br />IHAH-All.esp gives all 3 words of Shouts to those who have them (not all have Shouts). \r<br />\r<br />IHAH-All_V2.esp reduces them to only the first word of Fire Breath (Jordis), Ice Form (Iona), Cyclone (Rayya), and Unrelenting Force (Lydia). All others who can Shout (Disarm and Marked For Death) still retain all 3 words of those Shouts. Pick which version you want to run.\r<br />\r<br />This mod has been tested for the past few months and has not caused any issues for me. \r<br />\r<br />Place this below UFO or they may not Shout. I have not tested it with AFT or other follower mods.\r<br />\r<br />Enjoy.\r<br />\r<br />\r<br />++++++++++++++++++++++++++++++++++++++++++\r<br />KNOWN ISSUES:\r<br />1. While the latest tweaks should eliminate the possibility, you may find that getting hit by Iona&#39;s Ice Form shout while you&#39;re in a kill cam will break the camera system entirely. You&#39;ll get a detached camera and can see yourself running around. The only way to fix this is to reload a save. As I said, the latest tweaks should have eliminated that, but just to be safe, keep Iona where you can see her.\r<br />\r<br />2. One bug you will definitely get - and I apologize for neglecting to mention this earlier - is that if you or a follower does a kill move (lifting up with both swords, or otherwise any move where they &#34;warp&#34; into position) and the victim is hit with a Shout before the paired animation ends, the victim becomes immortal until the person who was doing the kill move actually kills them. Not gamebreaking, but it straddles the line between annoying and hilarious. Good way to level up one-handed, but you&#39;re a busy Player and have more important things to do than beat down the same wolf, draugr, spider, vampire, for hours on end. I have not had the misfortune of getting a &#34;rodeo&#34; kill cam on a dragon when this occurs. I pray that no one does, especially against a really tough one.",
  "categoryId": "79",
  "version": "4.1",
  "author": "DrNewcenstein",
  "createdUnix": "1394788485",
  "updatedUnix": "1423519192",
  "containsAdultContent": false,
  "uploadedBy": "DrNewcenstein",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127084",
      "name": "Improved Housecarls and Hirelings",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "70",
      "fileName": "Improved Housecarls and Hirelings-52079-3.zip",
      "uploadedUnix": "1410849779",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/2b85005478f05128d1e90b9bb4b48d56ea1fbb0dbbeebd0adf879e1a5e101de9/analysis/1410849842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Housecarls%20and%20Hirelings-52079-3.zip?fid=1000127084&ttl=1535834860&ri=8192&rs=8192&setec=9f7e8ba8a3536c9bf9ee892407bf5164"
    },
    {
      "fileId": "1000129197",
      "name": "IHAH - Improved Housecarls and Hirelings v4",
      "version": "4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "IHAH - Improved Housecarls and Hirelings v4-52079-4.zip",
      "uploadedUnix": "1412170710",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/95e9dd94f8759b9e21fa961dec91d380209279f8506a7d27f204853227f46f10/analysis/1412170812/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IHAH%20-%20Improved%20Housecarls%20and%20Hirelings%20v4-52079-4.zip?fid=1000129197&ttl=1535834861&ri=8192&rs=8192&setec=ec441b72c82895654b7583d2caf79326"
    },
    {
      "fileId": "1000129837",
      "name": "Improved Housecarls and Hirelings - IHAH v4.1",
      "version": "4.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "37",
      "fileName": "Improved Housecarls and Hirelings - IHAH v4.1-52079-4-1.zip",
      "uploadedUnix": "1412567470",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/732701029c521d1729b7fbb551001eae83d368346b0363d54cf1a22ac464b7d6/analysis/1412567582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Housecarls%20and%20Hirelings%20-%20IHAH%20v4.1-52079-4-1.zip?fid=1000129837&ttl=1535834861&ri=8192&rs=8192&setec=18fc13ac549e631f4630e0166b83e16b"
    },
    {
      "fileId": "1000146834",
      "name": "IHAH-Improved Housecarls and Hirelings - NoShouts",
      "version": "5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "IHAH-Improved Housecarls and Hirelings - NoShouts-52079-5.7z",
      "uploadedUnix": "1423519192",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/2afcf86b20e64295f82d8ffdd9fc59e5f771b3b21991c0270ccb080d77691fe3/analysis/1423519215/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/IHAH-Improved%20Housecarls%20and%20Hirelings%20-%20NoShouts-52079-5.7z?fid=1000146834&ttl=1535834862&ri=8192&rs=8192&setec=2f8be54627110b6848a346273f12def9"
    }
  ]
}