{
  "modId": 52071.0,
  "modName": "RACISM - Racial Adjustments Concerning Imbalanced Skyrim Mechanics",
  "summary": "Improves and balances the racial abilities, with a mind to bring back many of the abilities that were present in past Elder Scrolls games.",
  "descriptionHtml": "[img]http://static-3.nexusmods.com/15/mods/110/images/52071-1-1394863668.png[/img]\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Description ---[/color][/size][/b]\r<br />\r<br />As its name (sort of) suggests, this mod improves and attempts to better balance the racial abilities/powers in Skyrim.  Additionally, effort has been made to bring back abilities present in past Elder Scrolls games.  Changes apply to both the player character and NPCs, where applicable.  In addition to powers and abilities, the race menu descriptions and relevant load screens were also edited to reflect the new racials.  This mod requires the Dragonborn DLC.\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Changes ---[/color][/size][/b]\r<br />\r<br />This section lists the changes that RACISM makes to each of the ten playable races.  These changes are in addition to the racial powers and abilities present in vanilla Skyrim - nothing was removed, only new stuff was added.  I&#39;ve also included a short paragraph with each race about my reasoning for making the changes.\r<br />\r<br />\r<br />[b][size=3][color=#AFDCEC]Altmer[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- 50 magicka, permanent bonus\r<br />- &#39;Highborn&#39; - greater power that increases magicka regeneration rate by 25x for 60 seconds\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- Resist Disease 50%\r<br />- immunity to paralysis\r<br />- Highborn daily power now increases the power of spells by 25%, in addition to the magicka regen\r<br />- Weakness to Fire 25%\r<br />- Weakness to Frost 25%\r<br />- Weakness to Shock 25%\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />Altmer (High Elves) received the most changes.  In both Morrowind and Oblivion, Altmer had 25% weaknesses to elemental magic, an important aspect of their race that I wanted to bring back.  However, I couldn&#39;t give them such glaring weaknesses without buffing them in return.  So, to compensate they&#39;re now 50% resistant to disease (again calling back to Morrowind and Oblivion) and immune to paralysis (an ability they had back in Daggerfall).  Additionally, their Highborn power has been buffed to increase the power of spells while active.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Argonians[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- Resist Disease 50%\r<br />- Waterbreathing\r<br />- &#39;Histskin&#39; - greater power that increases health regeneration by 10x for 60 seconds\r<br />- higher unarmed damage (+6 to unarmed attacks)\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- Resist Poison 100%\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />In both Morrowind and Oblivion, Argonians were immune to poison.  In Skyrim, for some reason, they didn&#39;t even have a poison resistance, so I fixed that.  Keep in mind, however, that 100% resistance does not mean immunity, at least in the player&#39;s case, since player resistance is capped at 85%.  I didn&#39;t want to remove this resistance cap, as that would have larger gameplay implications that are outside the scope of this mod.  Argonian NPCs, however, will have full immunity to poison.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Bosmer[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- Resist Disease 50%\r<br />- Resist Poison 50%\r<br />- &#39;Command Animal&#39; - greater power that makes all animals within 75ft your allies for 60 seconds\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- &#39;Call of the Hunt&#39; - passive ability that increases your damage while in werewolf or werebear form by 25%\r<br />- &#39;Natural Archer&#39; - passive ability that increases the likelihood of dealing critical hits with a bow by 15%\r<br />- &#39;Hunter&#39;s Instincts&#39; - passive ability that increases your damage and damage resistance against animals by 10%\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />Bosmer (Wood Elves) were always something of an overlooked and weak race in TES games.  Bethesda did give them some help in Skyrim by adding a poison resist to their arsenal, but I wanted to take things a bit further.  Call of the Hunt activates whenever you transform into a werewolf (or a werebear, if you have an appropriate mod to allow such a change), a reference to the Wild Hunt and the Bosmers&#39; history of shapeshifting into animals (it&#39;s lore, look it up).  Natural Archer and Hunter&#39;s Instincts are just simple little abilities to further demonstrate the Bosmeri aptitude for archery and connection to nature, respectively.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Bretons[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- 25% magic resist\r<br />- &#39;Dragonskin&#39; - greater power that absorbs 50% of incoming magic for 60 seconds\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- Dragonskin now gives you 100 points of armor rating for 60 seconds, in addition to the spell absorption\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />Although Bretons were already really good and didn&#39;t need any buffs, I wanted to at least give them something.  In Morrowind and Oblivion, Dragonskin was a 50 point shield spell (equivalent to 50% damage reduction), so in that spirit Dragonskin for Skyrim now increases armor rating by 100 points (equivalent to ~12% damage reduction).  Don&#39;t worry, it&#39;s not that strong; it&#39;s like a free Ebonyflesh spell once per day.  \r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Dunmer[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- Resist Fire 50%\r<br />- &#39;Ancestor&#39;s Wrath&#39; - greater power that cloaks the user in fire for 60 seconds that deals 8 dmg/sec to enemies that get too close\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- &#39;Summon Ancestor Guardian&#39; - greater power that lets you summon a Dunmer Ancestor Guardian to aid you in combat for 60 seconds\r<br />- Ancestor&#39;s Wrath now deals 15 dmg/sec, increased from 8\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />I really liked the ability in Oblivion that let you summon an ancestor spirit to your side in battle.  Summon Ancestor Guardian is kind of like that, except now it&#39;s a full-bodied (ethereal) Dunmer, rather than a ghost like in Oblivion.  He&#39;s a level 20 nightblade sporting chitin armor, a glass dagger, and a mohawk.  There&#39;s a pic of him in the images section above.  In addition to that, Ancestor&#39;s Wrath is more powerful to differentiate it from a regular Flame Cloak.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Imperials[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- &#39;Imperial Luck&#39; - passive ability that increases the amount of gold you find in loot\r<br />- &#39;Voice of the Emperor&#39; - greater power that calms enemies within 75ft for 60 seconds\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- &#39;Star of the West&#39; - greater power that lets you imbue your active (unenchanted) weapon(s) with a 25 point absorb stamina enchantment for 60 seconds\r<br />- &#39;Tactician&#39; - passive ability that increases the damage output of your followers by 20% and increases their damage resistance by 20%\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />Star of the West was a power in Morrowind and Oblivion that absorbed 100 points of stamina on touch.  Since there are no &#39;touch&#39; spells in Skyrim, I improvised, but I actually like this new version better.  It&#39;s based on the Elemental Fury shout, so it won&#39;t work on enchanted weapons or bows.  As for Tactician, there was always this implication throughout the lore that Imperials had strong tactical minds, and this ability is a way I thought would be both interesting and useful to implement that strength.  Imperials may still be weak (in gameplay terms), but at least they now have some unique racial bonuses and a little niche to call their own.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Khajiit[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- &#39;Eye of Night&#39; - lesser power that gives you free, unlimited night eye\r<br />- &#39;Claws&#39; - passive ability that increases unarmed damage by 15 points\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- &#39;Predator&#39;s Sense&#39; - lesser power that gives you a free detect life spell, has half the range of the normal Detect Life spell and lasts for 5 seconds until activated again\r<br />- &#39;Eye of Fear&#39; - greater power that paralyzes nearby enemies in fear, 15ft range and 3sec duration\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />Predator&#39;s Sense builds on the stealthy hunter archetype the Khajiit seem to fill, and should complement their vanilla strengths nicely.  It won&#39;t detect undead or Dwemer automatons, however.  Eye of Fear was an ability in Morrowind and Oblivion that caused enemies to flee, but since Nords have the fear power in Skyrim, I decided to reboot Eye of Fear as an AoE paralysis power.  Enemies are [i]paralyzed[/i] in fear.  Get it?  HUH?  Bad jokes aside, it&#39;s a really good power. \r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Nords[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- Resist Frost 50%\r<br />- &#39;Battlecry&#39; - greater power that causes enemies within 60 feet to flee for 30 seconds\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- &#39;Woad&#39; - greater power that shrouds the user in a defensive frost cloak, dealing 8 dmg/sec to enemies who get too close and increasing armor rating by 100 points\r<br />- Battlecry no longer scares away your followers and teammates\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />Nords had two powers in past games that were not present in Skyrim; Nordic Frost, an on-touch frost spell, and Woad, a shield spell.  I&#39;ve merged the two into the new and (sort of) improved Woad power, which is basically just a Frost Cloak with an Ebonyflesh spell slapped on top.  The Battlecry edit is merely for less annoying gameplay.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Redguards[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- Resist Poison 50%\r<br />- &#39;Adrenaline Rush&#39; - greater power that increases stamina regeneration by 10x for 60 seconds\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- Resist Disease 50%\r<br />- Adrenaline Rush now halves the stamina cost of power attacks, and also slows time for 5 seconds upon activation\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />Like most of this mod&#39;s changes, the resist disease buff was inspired by racial bonuses in past TES games.  The Adrenaline Rush changes were to make the power and its associated race stand out more from the pack.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b][size=3][color=#AFDCEC]Orcs[/color][/size][/b]\r<br />\r<br />[b][color=#F88158]Old Stuff[/color][/b]\r<br />- &#39;Berserker Rage&#39; - greater power that doubles your physical damage output while halving incoming physical damage for 60 seconds\r<br />[b][color=#59E818]New Stuff[/color][/b]\r<br />- Resist Magic 10%\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />This one&#39;s simple - Orcs used to have magic resistance, and it was always less than that of the Bretons.  Also, Berserker Rage is already a ridiculously useful ability, so Orcs didn&#39;t need much of a buff in Skyrim.\r<br />-------------------------------------------------------------------------------------------------------------------\r<br />\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/52071-1-1394864276.jpg[/img][/center]\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Change Log ---[/color][/size][/b]\r<br />\r<br />[i]v1.2:[/i]\r<br />- added &#39;Hunter&#39;s Instincts&#39; ability to the Bosmer\r<br />[i]v1.1:[/i]\r<br />- cleaned with TES5Edit\r<br />- changed name of mod\r<br />[i]v1.0:[/i]\r<br />- release version\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Installation ---[/color][/size][/b]\r<br />\r<br />Nothing too special about the installation process.  Like any other mod, just put the files in your data folder and activate the .esp.  Or if you&#39;re using a mod manager, let the manager do its thing.\r<br />\r<br />The only important note about installation is that if you want the Bosmer lycanthropy perk (Call of the Hunt) to work properly, you&#39;ll need to activate this mod [i]after[/i] you&#39;ve created a character.  This can be any time after you&#39;ve initialized the character, whether in Helgen or 50 hours later at level 25.  This is due to the way the script to apply the ability is written, which stores the player&#39;s race as soon as the mod is activated in-game.  If I think of a workaround for this, I&#39;ll release an update, but until then just be aware that Wood Elf characters have to follow this special procedure.  Every other race will work fine if you activate the mod before starting a new character.\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Uninstallation ---[/color][/size][/b]\r<br />\r<br />There&#39;s a general sentiment amongst the community that you should never uninstall a scripted mod mid-game.  However, I&#39;ve tested RACISM against this idea, and my game works just fine.  No CTDS or save bloat that I&#39;m aware of.  It&#39;s a simple script, and all the esp file does is add spells and change some numbers, so it should be safe to disable or delete this mod at any time.  However, if you really want to play it safe, make a clean save before you install RACISM to see if you like it - something you can go back to if you do decide to uninstall.\r<br />\r<br />As for the actual uninstallation process, just disable the mod and/or delete the files.\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Conflicts ---[/color][/size][/b]\r<br />\r<br />RACISM will obviously conflict with other race mods, as well as anything else that edits the playable races (NordRace, DarkElfRace, etc.).  This includes [url=http://www.nexusmods.com/skyrim/mods/9286/?]SkyRe&#39;s[/url] race module, [url=http://www.nexusmods.com/skyrim/mods/44684/?]Resplendent Racials[/url], [url=http://www.nexusmods.com/skyrim/mods/18911/?]Thats Racist[/url], and any other similar race mod out there.\r<br />\r<br />Also, RACISM makes an edit to the player alias (&#39;player&#39; object in the CK) in order to apply the Bosmer lycanthropy buff.  This is a somewhat commonly edited object in mods, and so RACISM might overwrite the player changes of another mod, or another mod might overwrite RACISM&#39;s Call of the Hunt ability, if they both edit the player alias.  If you encounter such a conflict, you can do one of two things: 1) put the mod whose player edits you want more later in your load order, or 2) make a merged mod with [url=http://www.nexusmods.com/skyrim/mods/25859/?]TES5Edit[/url].  Or I guess you could make you own patch if you know what you&#39;re doing.\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Other Recommended Race Mods ---[/color][/size][/b]\r<br />\r<br />Here are some other race and character mods that you might like:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/21587/?]Character Creation Overhaul[/url]: an amazing overhaul to character creation, bringing back the class system from previous games plus other cool stuff.  Pairs nicely with RACISM.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/18911/?]Thats Racist[/url]: the only other race overhaul mod that I like.  Simple and lore-friendly, Thats Racist inspired some of the changes I made in RACISM.  Check it out if you&#39;d like an alternative to RACISM.\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Credits ---[/color][/size][/b]\r<br />\r<br />Mod created by Lazy Dreamer.\r<br />\r<br />Also, big thanks to /tesg/ for coming up with the name.\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#FDD017]--- Other Mods by the Author ---[/color][/size][/b]\r<br />\r<br />[list][url=http://www.nexusmods.com/skyrim/mods/48657/?]Dragon Shouts Rebalanced[/url]: improves, fixes, and balances the dragon shouts\r<br />[url=http://www.nexusmods.com/skyrim/mods/48645/?]Numerical Smithing Upgrades[/url]: improves the weapon and armor improvement names\r<br />[url=http://www.nexusmods.com/skyrim/mods/51025/?]Neapolitan ENB[/url]: the best ENB preset I&#39;m willing to endorse\r<br />[/list]",
  "categoryId": "34",
  "version": "1.2",
  "author": "Lazy Dreamer",
  "createdUnix": "1394844524",
  "updatedUnix": "1394913184",
  "containsAdultContent": false,
  "uploadedBy": "LazyDreamer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101313",
      "name": "RACISM",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32",
      "fileName": "RACISM--52071-1-2.7z",
      "uploadedUnix": "1394913184",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/08a693e9cf687a1b722d48099389ddb1b82e19a6adeff57538b249de6224d39d/analysis/1407983362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RACISM--52071-1-2.7z?fid=1000101313&ttl=1535834848&ri=8192&rs=8192&setec=7f05b4cd5bf819f5b790a4fb237c7885"
    }
  ]
}