{
  "modId": 52093.0,
  "modName": "GOS - Gangs Of Skyrim",
  "summary": "Gangs Of Skyrim brings more action and fun to Skyrim. This mod adds 6 gangs to Skyrim. This mod introduces gang wars, drug wars and much more.",
  "descriptionHtml": "[size=40][color=red]Gangs Of Skyrim[/color][/size] \r<br />This mod hit hot files, within the first day of it&#39;s release&#33; \r<br />Thank you all so much for the support&#33; \r<br />The new Remastered version is coming soon&#33;\r<br />\r<br />[size=5][color=red]1.8 Has Been Released&#33;[/color][/size]\r<br />Major Adjustments&#33;\r<br />Full Compatibility with AFT&#33;\r<br />New Faction&#33; Northern Wolf Pack&#33; (North SkyBound Watch)\r<br />New Faction&#33; Mythic Shadows (Abandoned Prison)\r<br />More Gang Wars&#33; More Action&#33;\r<br />New Gang War (North of Greywater)\r<br />New Gang War (Arcwind Point)\r<br />New Gang War (Shors Watchtower)\r<br />New Gang War (West of Angas Mill)\r<br />New Gang War (Heartwood Mill)\r<br />To Unlock the Riverwood Assassins you must complete the quest from Julia a former Commander of the Mythic Shadows&#33;\r<br />\r<br />[size=5][color=red]List of Changes&#33;[/color][/size]\r<br />The Riverwood Assassins are now locked until you complete the Riverwood Quest&#33; \r<br />As Requested the road to Riverwood has been cleared&#33; you wont get harassed by the Riverwood \r<br />Assassin unless you start the quest from Julia&#33; realize if you start the quest your going up against a small army&#33; so might want to bring some companions with you&#33;.\r<br />As requested The Riverwood Assassins have been giving wooden bows, instead of glass bows to fit their nature theme&#33;\r<br />New Merchant&#33; (Abandoned Prison)\r<br />New Book and rewards once you become a Mythic Shadow Valeria will give you a special ring&#33; with a special enhancement&#33; only the elite members receive the ring&#33;\r<br />Decorated the Abandoned Prison which is the (main base) for the Mythic Shadows\r<br />New Trailer will be released soon&#33;\r<br />5 New Quests\r<br />1. Joining the Mythic Shadows - Valeria is the leader of the Mythic Shadows she is Pandora&#39;s sister&#33; to join the new association you must prove yourself (Kagrenzel) is the testing grounds in which the Mythic Shadows send outsiders and new recruits to prove themselves to the Mythic Shadows&#33; the chance of you surviving Kagrenzel is about 30%\r<br />2. Path of the Mythic Shadow - After you complete the first quest for Valeria, you are suggested to go to Angi&#39;s camp to say the oath and get accepted into the association&#33; after you complete the oath you must go to battle and help the Mythic Shadows defeat the Kings of the Rift (Arcwind Point)\r<br />3. Riverwood Assassins - The Mythic Shadows are pinned and can&#39;t get to Riverwood they have lost a few men to the Riverwood Assassins for simply passing trough their turf&#33; Julia a member of the Mythic Shadows offers you a contract to get revenge and drive out the Riverwood Assassins, takes place in (Riverwood)\r<br />4. Before The Wind blows - Julia sent some men to Solitude to get some resources and materials but they still haven&#39;t returned, some scouts say that they have been pinned down (North of Morthal) and need your help&#33;\r<br />5. Attack of the Phantoms - The Mystic Phantoms are starting a war with the Mythic Shadows, and want more land they plan an attack and try and take over the Mythic Shadow&#39;s main base, it&#39;s up to you to save the day&#33; and save Valeria and the other members of the Association&#33;  (Abandoned Prison)\r<br />\r<br />[size=5][color=red]New Trailer[/color][/size]\r<br />\r<br />[youtube]-AToCjeJx8E[/youtube]\r<br />\r<br />[size=5][color=yellow]Introduction[/color][/size] \r<br />Civil war has tainted the lives of many. Drugs are ruining the land and gangs have been formed. Orphans in the streets of Riften have turned bitter without proper leadership and values they turned to drugs and a life of crime forming the Kings of the Rift. So many have died in the Civil war leaving prominent families broken and torn apart in Solitude. Many citizens in Solitude became bitter towards the empire. Many citizens of Solitude got tired of working hard labor and quit their jobs and turned to drugs, necromancy and other crimes that&#39;s how the Mystic Phantoms were formed&#33; War Heroes and mercenaries, natives of the land have also rebelled against the empire they believe they do so much for their government and their government does nothing for them&#33; these mercenaries and war heroes got fed up with the rules of the empire and couldn&#39;t get used to the regular lifestyle they used to live before going to war that&#39;s how the Nordic Brotherhood was born. Skyrim will never be the same now that new gangs have emerged from the difficulties, and civil wars in Skyrim which has left so many torn apart. New gangs and drugs are coming into Skyrim, the corruption is growing and the murder rate is rising, Skyrim is now more dangerous than ever.\r<br />\r<br />[size=5][color=Crimson]Basic Details[/color][/size]\r<br />This mod brings more action and fun to Skyrim. This mod adds 6 gangs to Skyrim each claiming their own turf in Skyrim. This mod introduces gang wars, and drugs wars&#33; It also adds 7 new quests and NPC’s that you can speak with and tell you about their experience and challenges with the former Gangs of Skyrim. Meet Pandora in Frost Flow Lighthouse she will be your greatest source of Intel. Pandora got into some trouble with the Nordic Brotherhood, and it&#39;s up to you to save her&#33;\r<br />\r<br />\r<br />[size=5][color=yellow]Immersion[/color][/size] This mod gives you choices, the gangs and gang wars are ongoing&#33; but will you help eliminate the threat from the major cities and eliminate the main leaders to bring order and justice to Skyrim. Or will you have mercy on the leaders, Captains and associate of the gangs&#33; will you save Pandora and bring justice to her family? it&#39;s all up to you&#33; you can let them live or go to war with them. Will you try and be the hero and go into the gang&#39;s territory and try to bring them down by yourself? or will you recruit allies to help you face the new threat? The new gangs are extremely dangerous some are more organized than others and the leaders and associates in the city blend in with the crowd. In the city they try to be discreet and not attract to much attention on them since they are organized, they do most of their business in secret. But when differences and challenges are met the gangs settle their differences on the battlefield. Skyrim is not the same now, Skyrim is a great land of opportunity and gangs have been formed and are hungry for power, the Imperials are currently going to war with the Mystic Phantoms and are trying to drive them out, and the Solitude city watch has put a bounty on the Leader of the Mystic Phantoms and it&#39;s up to you to bring him down because he has the city guards under his pocket. Rival gangs are also going to war with each other will you defeat the main leaders of all the rival gangs or let them live? the choice is up to you&#33; \r<br />\r<br />[size=3][color=aqua]This mod is not required but I personally recommend this mod&#33; [/color][/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14884/?]Fuz Ro D-oh - Silent Voice[/url] \r<br />\r<br />[size=3][color=aqua]After you finish the quest if you would like to help Pandora clean up the mess in Frost Flow Lighthouse and make the house more neat and organized download this mod [/color][/size][url=http://www.nexusmods.com/skyrim/mods/39119/?]Frostflow Lighthouse Player Home[/url] \r<br />\r<br />[size=5][color=crimson]Highly Recommended Mods[/color][/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/5696/?]Arise - Chapter 1 - The Black Sacrament [/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/60/?]Enhanced Blood Textures[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36334/?]Inconsequential NPCs[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27563/?]Wet and Cold[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/37460/?]Dawn of Whiterun[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/51311/?]Superior Rorikstead[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33391/?]Face Masks of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12092/?]Cloaks of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/31264/?]OBIS - Organized Bandits In Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36166/?]Sexy Loading Screens[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/601/?]Realistic Ragdolls and Force[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17214/?]No Spinning Death Animation[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19841/?]LIAT - Lively Inns And Taverns[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27208/?]Ultra Realistic Bow Shoot Sounds[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/41724/?]Scoped Glass Bow[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/37774/?]RE - Real Estate[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19447/?]Sneak Tools[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52513/?]&#34;Lonely Shack&#34; Player Home[/url]\r<br />\r<br />\r<br />[size=5][color=red]Combat[/color][/size]\r<br />The combat you experience in this mod will be unique from other mods, If you favor the bow then you will get your archery fix with this mod&#33; this mod gives you plenty of opportunity to use your bow on multiple enemies. When going into battle or stepping into a gangs territory make sure you have a companion with you, because chances are you will not survive alone. The Nordic Brotherhood can usually be found in all areas of Skyrim since they are natives of the land, they act like everything belongs to them&#33; the Brotherhood tend to use Nordic Weapons and destruction magic. The Mystic Phantoms tend to use a lot of magic but they aren&#39;t limited to the destruction school like the Nordic Brotherhood they also use conjuration and summon creatures to fight for them. The Mystic Phantoms have the most sophisticated weapons, they often use Daedric weapons making them one of the most prominent gangs in Skyrim&#33; the Gangs are set to respawn but remember if you kill any of the main leaders, captains, advisers etc they will not re-spawn&#33; Now the Mystic Phantoms tend to stick towards the northern region of Skyrim and near Solitude. The Kings of the Rift will rarely step outside of the Rift for their own safety. They have claimed the Rift as their turf and if any other gangs steps into their territory they will be killed on sight&#33; The Kings of the Rift are currently at war with the Nordic Brotherhood who are constantly trying to take over the Rift, but the Kings keep driving them out. The Kings rarely use magic when going into battles they use swords, axes, and bows nothing too fancy, the Kings lack the resources the Mystic Phantoms and the Nordic Brotherhood have. The Riverwood Assassins tend to favor the bow and tend to use Glass bows and daggers and other sorts of weapons, the Spriggans also aid them in battle, as the Riverwood Assassins have a close connection with nature. The Riverwood Assassins rarely venture out of their land they can be found in Riverwood and also live deep in the woods South of Riverwood. The Crimson blood Assassins use destruction magic, conjuration spells and usually favor scimitars, and dwarven weapons. They are becoming wealthy selling moon dust in Skyrim and are becoming a major threat to other gangs they are currently at war with the Black Knights and the Brotherhood. The Crimson Blood Assassins can usually be found in South Skyrim, usually they don&#39;t venture deep into the North unless they have business there. The Black Knights were pushed back by the Riverwood Assassins they can also be found in South Skyrim near the border of Hammerfell, the Black Knights don&#39;t use magic at all, they use their own orcish weapons and armor. Skyrim will never be the same now that new gangs are on the rise, and constantly killing each other over drugs, gold and the land.\r<br />\r<br />[size=12][color=red]Features[/color][/size]\r<br />New Gang Wars, Drug Wars.\r<br />6 New Gangs, 7 New Quests (Gangs are set to respawn.)\r<br />New Books and letters.\r<br />More Action and Immersive gaming.\r<br />\r<br />[size=5][color=blue] New in 1.2 Mythic Shadows[/color][/size]\r<br />The Mythic Shadows is a new faction in Skyrim that you can join. The Mythic Shadows are highly trained assassins, they are masters of the blade, the best of the best. The Mythic Shadows are a secret organization and control part of the black market in Skyrim&#33; The Mythic Shadows are currently at war with the Nordic Brotherhood the, the Kings of the Rift, and the Mystic Phantoms. There is different ranks in this association a Shadow is an individual who still has much to learn and is still proving himself to become accepted and admitted into the inner circle. A Shadow Warrior has completed the oath and has proved himself to the association he is trusted and highly respected. Shadow Masters are trainers and mostly war heroes, veterans who have gained much experience in battle mostly elders, they are rarely seen and highly respected. The final rank is Mythic Shadow they are leaders, commanders and considered by many to be Master Minds, only a few, and only the best get to become a Mythic Shadow. \r<br />\r<br />[size=5][color=red]The Nordic Brotherhood[/color][/size]\r<br />The Brotherhood is one of the strongest gangs in Skyrim, they are Natives of Skyrim. Most members of the Nordic Brotherhood are war heroes and mercenaries that have rebelled against the Empire and live by their own set of rules. The Brotherhood is involved in many crimes but is most active in the drug trade business. They consider themselves the best organization in all of Tamriel and have no allies&#33; The Brotherhood is the largest and most influential Gang in Skyrim. The Nordic Brotherhood is very ambitious and have grown from a small time gang to a vicious army they want to conquer all of Skyrim and rule it with an iron fist&#33;\r<br />\r<br />[size=5][color=purple]Mystic Phantoms[/color][/size]\r<br />The Mystic Phantoms is a group of trained assassins which was formed in Solitude. They rebelled against the empire and are highly organized. The Mystic Phantoms are involved in all sorts of crimes but they are mostly involved in the drug trade business and the prostitution business. Most Mystic Phantoms are well educated and come from prominent families. They have a deep appreciation for magic and have a deep connection with the spiritual realm. They also have a deep connection with the dark spirits of Skyrim and are involved with Necromancers, Dragon Priests etc. They are constantly studying the spiritual realm and believe in the spiritual truths that are far beyond the human intellect.\r<br />\r<br />[size=5][color=yellow]Kings of the Rift[/color][/size]\r<br />The Kings are a group of organized bandits; they are very dangerous and have claimed the Rift as their turf. The gang was born in Riften&#33; The Kings of the Rift are highly active in the drug trade business and mostly deal skooma. The Kings are very hungry for power but fail to compete against the more prominent gangs in Skyrim such as the Nordic Brotherhood and the Mystic Phantoms. They lack proper leadership and discipline&#33; Most of the Kings are high drug consumers and are very reckless in nature; they will steal and kill anyone not caring about the consequence or penalties&#33; Most Kings have no remorse or sympathy and only care about themselves.\r<br />\r<br />[size=5][color=crimson]Crimson Blood Assassins[/color][/size]\r<br />The Crimson Blood Assassins are a group of trained Assassins from Hammerfell. They are one of the most strongest and talented warriors in all of Tamriel. Hammerfell is going through a financial crisis, and to receive more gold the Crimson Blood Assassins have established a large drug ring in Skyrim. The Crimson Blood Assassins are trafficking, a new drug into Skyrim called Moon Dust, which is the purified version of moon sugar. Moon Dust is one of the strongest drugs in Skyrim, it has high healing abilities, and users who have used this drug go into a trance and feel numb to pain. The Nordic Brotherhood and the Black Knights hate the Crimson Blood Assassins as they are stealing much profit from them&#33; And have failed to give them a percentage. As a result The Crimson Blood Assassins are getting hammered in Skyrim, the Black Knights and the Nordic Brotherhood have sworn to eliminate them on sight and drive them out of Skyrim.    \r<br />\r<br />[size=5][color=green]Riverwood Assassins[/color][/size]\r<br />The River wood Assassins are generally peaceful; the gang was formed in Riverwood. They mostly come from a poor background and fish and hunt for a living, most citizens consider them as Savages. The River wood Assassins have a deep appreciation for nature and most of them live deep in the forest near Riverwood. They also have a close connection with Spriggans and these creatures are known to aid them in battle. The Riverwood Assassins are peaceful but they are very jealous of their land, and have been harassed frequently by other gangs such as the Nordic Brotherhood and Black Knights. In return they have killed many of them, and now they get really paranoid and tense when outsiders come into their land, they have killed many innocent people who have invaded their land mistaking them for bandits.\r<br />\r<br />[size=5][color=black]Black Knights[/color][/size]\r<br />The Black Knights are very aggressive and repulsive; they love being in battle and are very strong. The Black Knights are active in the drug trade business&#33; They have tried to invade the Riverwood Assassins but have failed. Many Black Knights were murdered on sight, and after waves of battles, the Black Knights settled near the border of Hammerfell. The Black Knights are mostly Orcs and they are currently at war with the Crimson Blood Assassins.\r<br />\r<br />[size=12][color=red]Locations[/color][/size]\r<br />\r<br />[size=5]The Nordic Brotherhood[/size]\r<br />North of Frost Flow Lighthouse\r<br />Snow Point Beacon\r<br />West of Angas Mill\r<br />Wayward Pass\r<br />Weynon Stones\r<br />Wreck of the Winter War\r<br />West of Dawn star (Gang War) Nordic Brotherhood Vs Mystic Phantoms\r<br />Rorikstead (Gang War) Nordic Brotherhood Vs Crimson Blood Assassins\r<br />Stony Creek Cave (Gang War) Nordic Brotherhood Vs Kings of the Rift\r<br />Swindler&#39;s Den (Drug War) Nordic Brotherhood Vs Crimson Blood Assassins\r<br />\r<br />[size=5]Mystic Phantoms[/size]\r<br />Kjenstag Ruins\r<br />Hamvirs Rest\r<br />High Gate Ruins\r<br />Lord Stone\r<br />Pine Frost Tower\r<br />Solitude\r<br />Solitude Lighthouse\r<br />South of Solitude Sawmill (Gang War) Mystic Phantoms Vs Imperials\r<br />North of Morthal\r<br />North East of Abandoned Shack\r<br />Winking Skeever\r<br />West of Dawn star (Gang War) Nordic Brotherhood Vs Mystic Phantoms\r<br />\r<br />[size=5]Kings of the Rift[/size]\r<br />Riften\r<br />Haemars Shame\r<br />Heartwood Mill\r<br />Riften Ratway\r<br />Shor’s Watchtower (Gang War) Nordic Brotherhood&#33; Vs The Kings of the Rift&#33;\r<br />South Of Nilheim\r<br />Stony Creek Cave (Gang War) Nordic Brotherhood Vs Kings of the Rift\r<br />\r<br />[size=5]Riverwood Assassins[/size]\r<br />Riverwood\r<br />South of Riverwood\r<br />\r<br />[size=5]Crimson Blood Assassins[/size]\r<br />Hunters Rest\r<br />Roadside Ruins (Drug War) Crimson Blood Assassins Vs Black Knights\r<br />GlenMoril Coven ( Drug War) Black Knights Vs Crimson Blood Assassins\r<br />Swindler&#39;s Den (Drug War) Nordic Brotherhood Vs Crimson Blood Assassins\r<br />Rorikstead (Gang War) Nordic Brotherhood Vs Crimson Blood Assassins\r<br />\r<br />[size=5][color=red]Quests[/color][/size]\r<br />\r<br />1. Saving Pandora – \r<br />Pandora borrowed some gold from the Nordic Brotherhood and failed to pay them back when the pay was due. She is now hiding in Frost Flow Lighthouse. The Nordic Brotherhood is angry and has placed a bounty on Pandora. (Frost Flow Lighthouse)\r<br />\r<br />2. Mystic Phantoms – \r<br />Some members of the Mystic Phantoms have picked up the Bounty and are on their way to the Lighthouse to execute Pandora save Pandora from the Mystic Phantoms. (Frost Flow Lighthouse)\r<br />\r<br />3. Crimson Blood Assassins – \r<br />The Main Leader has picked up the bounty now and took a few men with him to the Lighthouse to execute Pandora, save Pandora from the Crimson Blood Assassins. (Frost Flow Lighthouse)\r<br />\r<br />4. Nordic Brotherhood – \r<br />The Nordic Brotherhood is fed up and has decided to take matters in their own hands and execute Pandora, save Pandora from the Nordic Barbarians. (North of Frost Flow Lighthouse)\r<br />\r<br />5. Kings Of the Rift – \r<br />Pandora is very sad there has been a death in the family, some members of the Kings of the Rift broke into her cousin’s house and stole many valuables and threatened Pandora’s nephew. Pandora’s Cousin got into a fight with the King’s which resulted in his own death; bring justice to Pandora’s family&#33; (Riften Ratway)\r<br />\r<br />6. Returning the Favor – \r<br />The main leader of the Nordic Brotherhood is in Dragon’s Reach as guest of honor, the Jarl doesn’t know it but he is spying on him, and planning a surprise attack&#33; Save Whiterun from an invasion, and execute the Main leader of the Nordic Brotherhood to bring safety to Pandora and Whiterun, the main leader is not alone and has his main bodyguard’s with him.\r<br />\r<br />7. Wanted – \r<br />The Leader of the Mystic Phantoms is a wanted man, but people fear him, and nobody has the guts to face him. He also has the guards under his pocket. Solitude needs a brave warrior to bring down the main leader of the Mystic Phantoms; Pandora proposes a contract for you to execute him&#33; (Solitude Temple)\r<br />\r<br />[size=5][color=red]People of Interest[/color][/size]\r<br />Pandora – Main Source of Intel (Frost Flow Lighthouse)\r<br />Zendra Mystic Phantom Advisor - Meet her outside of the (Winking Skeever)\r<br />Sonia Free Spirit – Wants to leave the Mystic Phantom Association (Solitude Sawmill)\r<br />Mystic Phantom Dealer – Outside of the (Winking Skeever)\r<br />Mystic Phantom Procurer– (Winking Skeever)\r<br />Mystic Phantom Hookers - (Winking Skeever)\r<br />Mystic Phantom Leader – (Temple of the Divines)\r<br />Enre – Riverwood Assassins Leader (Riverwood)\r<br />Julie – Riverwood Assasins Advisor (Outside Sleeping Giant Inn)\r<br />Karla – Riverwood Assassin Captain (Riverwood)\r<br />Leona Kings of the Rift Captain (Riften )\r<br />Phillip Kings of the Rift Advisor (Riften)\r<br />Draco Leader of the Kings of the Rift (Riften)\r<br />Paul Leader of the Nordic Brotherhood – (Dragon’s Reach)\r<br />Jenna Nordic Brotherhood Advisor – (Dragon’s Reach)\r<br />Eva Nordic Brotherhood Captain – (Dragon’s Reach)\r<br />\r<br />[size=20][color=blue]Compatibility[/color][/size]\r<br />Has been cleaned with TES5Edit\r<br />Compatible with [url=http://www.nexusmods.com/skyrim/mods/31264/?]OBIS - Organized Bandits In Skyrim[/url]\r<br />Compatible with [url=http://www.nexusmods.com/skyrim/mods/33391/?]Face Masks of Skyrim[/url], some gang members will use face masks if you have Face Masks for Skyrim installed.\r<br />Compatible with  [url=http://www.nexusmods.com/skyrim/mods/12092/?]Cloaks of Skyrim[/url] some Gangs will use cloaks&#33; Especially the Nordic Brotherhood if you have COS installed&#33;\r<br />Compatible with [url=http://www.nexusmods.com/skyrim/mods/27563/?]Wet and Cold[/url], gangs will wear hoods, backpacks, snowshoes, depending on the location and weather etc.\r<br />Has not been tested with  [url=http://www.nexusmods.com/skyrim/mods/9494/?]WARZONES - Civil Unrest [/url]\r<br />Has been tested and works great with [url=http://www.nexusmods.com/skyrim/mods/36334/?]Inconsequential NPCs[/url]\r<br />Has been tested and works fine with [url=http://www.nexusmods.com/skyrim/mods/19841/?]LIAT - Lively Inns And Taverns[/url]\r<br />Compatible with [url=http://www.nexusmods.com/skyrim/mods/35841/?]Helgen Reborn[/url]\r<br />Compatible with [url=http://www.nexusmods.com/skyrim/mods/51633/?]LC_BecomeJarlofIvarstead[/url]\r<br />\r<br />[size=20][color=red]Requirements[/color][/size]\r<br />Skyrim.esm\r<br />Latest Update 1.9\r<br />\r<br />[size=7][color=red]Author’s Note[/color][/size]\r<br />I made this mod for my own personal pleasure. After testing this mod for about a month and playing with it I have not encountered a single bug&#33; And decided to release it to the Public&#33; I have spent a long time on this mod as a full time College Student and I hope you enjoy this mod as much as I did creating it.\r<br />\r<br />[size=12][color=blue]Inspiration[/color][/size]\r<br />[youtube]AfyvHfbsQ2s[/youtube]\r<br />\r<br />[size=20][color=blue]Credits[/color][/size]\r<br />I want to thank the Skyrim Nexus Community, and the creators of the site.\r<br />I want to thank Bethesda for creating the Elders Scrolls Series, and the Creation kit.",
  "categoryId": "78",
  "version": "1.8",
  "author": "RedRayne",
  "createdUnix": "1394849412",
  "updatedUnix": "1396648381",
  "containsAdultContent": false,
  "uploadedBy": "Raynel07",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000103669",
      "name": "GangsOfSkyrim",
      "version": "1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29053",
      "fileName": "GangsOfSkyrim-52093-1-8.zip",
      "uploadedUnix": "1396648381",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/b2d4c729c261c796f240898679c4ed760dd1b49791cd5c32012a612ea56c3ba9/analysis/1408007323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GangsOfSkyrim-52093-1-8.zip?fid=1000103669&ttl=1535834887&ri=8192&rs=8192&setec=60a0c79a0bea10844f53ba0f4166fd2b"
    }
  ]
}