{
  "modId": 52097.0,
  "modName": "Die Wahl liegt bei euch - The choice is yours German",
  "summary": "Diese Mod verhindert, dass einem Quests aufgezwungen werden. Sie starten nun erst, nachdem man ihnen zugestimmt hat. Außerdem wurden bei einigen Quest alternative Lösungen und Änderungen vorgenommen. Es handelt sich um eine Übersetzung der Mod von &#34;kryptopyr&#34;.",
  "descriptionHtml": "[b][color=#daa520][u]\r<br />[size=6]Die Wahl liegt bei euch - The choice is yours German[/size][/u][/color][/b][size=6]\r<br />[/size][b]\r<br />[size=3]Version:[/size][/b][size=3] 1.4\r<br />[b]Original:[/b][url=http://www.nexusmods.com/skyrim/mods/26359/?]kryptopyr[/url]\r<br />[b]Übersetzung:[/b] Severin von Saarthal\r<br />\r<br />The Choice is Yours verändert viele Quest so, dass sie nur noch ins Tagebuch eingetragen werden, wenn der Spieler sie annimmt. Dazu wurden neue Dialogoptionen eingefügt. Manche Quests erhalten auch neue Lösungsmöglichkeiten.[/size]\r<br />\r<br />[b][color=#daa520][size=5]Warum diese Mod?[/size][/color][/b][list][*][size=3]Um nicht in den ersten zwanzig Minuten mit mehreren Dutzend Quest überschüttet zu werden[/size][/*]\r<br />[*][size=3]Um mehr Entscheidungsmöglichkeiten zu haben.[/size][/*]\r<br />[*][size=3]Um mehr Herausforderungen zu haben: Du musst nun die Augen und Ohren nach Quest offen halten, da sie nicht sofort mit dem Hören der Gerüchte beginnen.[/size][/*]\r<br />[*][size=3]Um den Rollenspielfaktor zu betonen: Wenn eine Quest den Einstellungen deines Charakter zuwiderläuft, kannst du sie ablehnen. Ein edler Ritter, der gezwungen ist, die Aufgabe eines Daedra auszuführen? Nicht mehr mit dieser Mod...[/size][/*]\r<br />[*][size=3]Oder einfach um die Quests nicht nochmal machen zu müssen[/size][/*]\r<br />[/list][b][color=#daa520]\r<br />[size=5]Was diese Mod nicht macht/ist:[/size][/color][/b][list][*][size=3]Sie ändert nicht jede Quest, nur die unten gelisteten. In Zukunft werden möglicherweise weitere folgen.[/size][/*]\r<br />[*][size=3]Es wurde nichts aus dem Spiel entfernt. Du wirst immer noch die selben Gerüchte und Grüße hören, nur starten sie die Quests nicht mehr.[/size][/*]\r<br />[*][size=3]Es werden keine Quests gebrochen. Sie können wie gewohnt gespielt werden, nur der Start wurde geändert.[/size][/*]\r<br />[*][size=3]Die Mod hat keinen Einfluss auf bereits gespielte Quest.[/size][/*]\r<br />[/list][color=#daa520][b]\r<br />[size=5]Installation:[/size][/b][/color][list][*][size=3]Am besten mit einem Modmanager (wegen der vielen scripts), ansonsten wie gewohnt alles in den „Data“-Ordner kopieren.[/size][/*]\r<br />[/list][b][color=#daa520]\r<br />[size=5]Quests mit größeren Änderungen:[/size][/color][/b][list][*][size=3]„Ruf von Boethia“ und „Ein lieblicher Brief“: Zusätzliche Möglichkeiten, die Quest zu beenden[/size][/*]\r<br />[*][size=3]„Die Verschwörung der Abgeschworenen“ und „Der Verschwundene“: Personen können nur noch bei Nacht getroffen werden[/size][/*]\r<br />[/list][b][color=#daa520]\r<br />[size=5]Liste der bearbeiteten Quests:[/size][/color][/b]\r<br />\r<br />[u][color=#daa520][size=4]Quest der Fraktionen:[/size][/color][/u][list][*][size=3][b]Barden:[/b] Gespräche mit Barden oder Gastwirten starten nicht mehr die Quest, die Bardenschule zu besuchen. Zum starten sprich mit Viarmo[/size][/*]\r<br />[*][size=3][b]Dunkle Bruderschaft:[/b] Gerüchte über Aventus zu hören startet die Quest nicht mehr. Gerüchtet über Aventus wurden von allen Wirten außerhalb Windhelms entfernt. Um die Quest zu beginnen sprich mit Aventus.[/size][/*]\r<br />[*][size=3]Akademie von Winterfeste: Kommentare über Magie werden die Quest nicht mehr starten. Sprich mit Farlda um zu beginnen.[/size][/*]\r<br />[*][size=3][b]Gefährten:[/b] Die Quest wird nicht mehr durch das Gespräch mit Aela, die vor Weißlauf den Riesen getötet hat, gestartet und auch nicht durch Gerüchte über die Gefährten. Sprich mit Kodlack.[/size][/*]\r<br />[*][size=3]Diebesgilde: Mit Maul zu reden startet nicht mehr die „Sprich mit Byrnolf“ Quest.[/size][/*]\r<br />[*][size=3][b]Bürgerkrieg:[/b] Die Questreihe startet erst, wenn du im Gespräch mit Ulfric oder Galmar einwilligst, deren Testaufgabe auszuführen. Grüße von Soldaten oder Hadvar und Ralof werden nicht mehr die Meldung „Schließe dich xy an“ auslösen.[/size][/*]\r<br />[/list][u][color=#DAA520]\r<br />[size=4]Daedrische Quests:[/size][/color][/u][list][*][size=3][b]Azura: [/b]Gerüchte über Azuras Schrein zu hören, wird die Quest nicht mehr starten, du erhältst jedoch trotzdem einen Marker auf der Karte. Der Dialog „Ich bin niemandes Champion“ wurde zu „Ich bin nicht Azuras Champion“ geändert, um besser zu bestimmten Charakteren zu passen.[/size][/*]\r<br />[*][size=3][b]Hircine:[/b] Du kannst nun mit Mathies und Sinding reden, ohne die Quest zu starten. Sie beginnt erst, wenn du zustimmst, Sinding zu helfen.[/size][/*]\r<br />[*][size=3][b]Mephala:[/b] Gerüchte über Balgruufs Kinder lassen die Quest nicht mehr beginnen, man muss erst mit Balgruuf selber reden (nach dem Hören der Gerüchte).[/size][/*]\r<br />[*][size=3][b]Clavicus Vile:[/b] Die Quest beginnt erst, wenn du mit Lod geredet und die Aufgabe angenommen hast, wozu eine alternative Antwort zum Ablehnen hinzugefügt wurde. Wenn du Barnabas gefunden hast, kannst du auch einfach die Aufgabe für Lod erledigen, ohne dem Daedrateil der Quest zu folgen. Falls du dich später anders entscheiden solltest, erhältst du eine Kartenmarkierung für den Schrein, wo Barnabas auf dich wartet.[/size][/*]\r<br />[*][size=3][b]Sanguine:[/b] Wenn Sam dich zum Wettrinken herausfordert beginnt die Quest erst, wenn du annimmst.[/size][/*]\r<br />[*][size=3][b]Sheogorath:[/b] Gerüchte über einen Mann, der durch Einsamkeit läuft lösen die Quest nicht mehr aus.[/size][/*]\r<br />[*][size=3][b]Mehrunes Dagon:[/b] Die Quest beginnt erst, wenn du zustimmst, nach den Bruchstücken zu suchen. Es gibt 2 neue Dialogoptionen um anzunehmen, und eine, um abzulehnen. Solltest du letzteres tun, kannst du später immer noch annehmen.[/size][/*]\r<br />[*][size=3][b]Molag Bal: [/b]Gerüchte über den Deadrajäger in Markarth werdendiese Quest nicht länger starten.[/size][/*]\r<br />[*][size=3][b]Namira:[/b] Die Quest wird nicht mehr durch Gerüchte über die Halle der Toten in Markarth ausgelöst. Zum Starten sprich mit Bruder Verulus.[/size][/*]\r<br />[*][size=3][b]Peryte:[/b] Mit Betroffenen zu reden startet die Quest nicht mehr. Um zu Beginnen sprich mit Kesh.[/size][/*]\r<br />[*][size=3][b]Boethia:[/b] Die Quest beginnt erst dann, wenn du zustimmst die Aufgabe der Priesterin anzunehmen. Gerücht oder das Lesen des Buches tragen den Schrein zwar auf der Karte ein, lösen die Quest aber nicht aus.\r<br />Wenn du alle Kultisten getötet hast, gibt es nun verschiedene Dialogsoptionen für verschiedene Charaktertypen, wenn du mit Boethia redest: So kannst du die Aufgabe z. B. komplett ablehnen (Meine Seele ist für Sovengarde bestimmt. Ich will mit euren niederträchtigen Gelüsten nichts zu tun haben.)[/size][/*]\r<br />[/list][u][color=#daa520]\r<br />[size=4]Sonstige:[/size][/color][/u][list][*][size=3][b]Der Segen der Natur:[/b] Nicht mehr durch Gerüchte ausgelöst, Dialogmöglichkeit zum Ablehnen ergänzt.[/size][/*]\r<br />[*][size=3][b]Erwachen im Morgengrauen:[/b] Beginnt nicht, bis du ausdrücklich zustimmst.[/size][/*]\r<br />[*][size=3][b]Soljunds Grube:[/b] Beginnt erst, wenn du annimmst. Einige zusätzliche Dialogoptionen waren im Spiel eigentlich vorhanden, werden aber nicht angezeigt. Dies wurde geändert, außerdem hat Perth nun einen eigenen Tagesablauf, damit er wenn die Mine von den Draugern befreit ist, nicht weiterhin Wache hällt.[/size][/*]\r<br />[*][size=3][b]In höchster Not:[/b] Durch die Alik&#39;r angesprochen zu werden, startet nicht mehr die Quest.[/size][/*]\r<br />[*][size=3][b]Licht aus&#33;:[/b] Neue Möglichkeiten, an- oder abzulehnen wurden ergänzt, Quest startet erst bei Zustimmung.[/size][/*]\r<br />[*][size=3][b]Moosmutterhöhle:[/b] Neue Möglichkeiten, abzulehnen, auch im weiteren Verlauf der Quest[/size][/*]\r<br />[*][size=3][b]Das weiße Fläschen:[/b] Reihenfolge des Dialogs so geändert, dass man erst alle Informationen erhält, bevor man zustimmt.[/size][/*]\r<br />[*][size=3][b]Ein lieblicher Brief:[/b] Neue Möglichkeiten im Verlauf der Quest, z. B. es Sven und Faendal zu erzählen, wenn man mit Camilla verheiratet ist. Sollte man mit einem von beiden verheiratet sein, findet die Quest nicht mehr statt. Alle Gerüchte im Zusammenhang mit der Quest wird man nicht mehr hören, wenn diese beendet oder sonstwie nicht mehr nötig ist.[/size][/*]\r<br />[*][size=3][b]Zurück zu den Wurzeln: [/b]Die Quest wird nur durch das Lesen des Tagebuches gestartet, nicht durch das Sammeln von Roter Nirnwurz[/size][/*]\r<br />[*][size=3][b]Dwemerische Artefakte:[/b] Für diese Quest gibt es keinen Tagebucheintrag mehr, da der Brief als Information ausreichen sollte. Calcelmo ist nun auch nur noch in seltene Dwemerartefakte interessiert, nicht mehr in Dinge, die es überall zu kaufen gibt.[/size][/*]\r<br />[*][size=3][b]Der Vermisste:[/b] Mit Fralia zu reden startet die Quest nicht, solltest du ablehnen, wird sie sich weiterhin wie eine Händlerin verhalten. Solltest du zustimmen, wird sie auch nicht sofort nach hause gehen, sondern du musst, wie sie es sagt, bis zur Nacht warten. Mit Avulstein zu reden kann die Quest ebenfalls starten.[/size][/*]\r<br />[*][size=3][b]Aufschwung Ost:[/b] Neue Dialogoption, um die Quest abzulehnen.[/size][/*]\r<br />[*][size=3][b]Versprochen ist Versprochen:[/b] Neue Dialogoption, um die Quest abzulehnen.[/size][/*]\r<br />[*][size=3][b]Die Legende des roten Adlers/Die verbotene Legende:[/b] Beim Lesen des Buches wird man nun gefragt, ob man Nachforschungen anstellen möchte.[/size][/*]\r<br />[*][size=3][b]Die Verschwörung der Abgeschworenen:[/b] Wenn dir der Brief zugesteckt wird, erhältst du lediglich den Auftrag, ihn zu lesen. Um die Quest zu starten, musst du mit Eltrys reden. Du wir ihn nun nur noch eine Stunde um Mitternacht am Schrein antreffen, sonst geht er seinem normalen Tagesablauf nach. In der Zeit wird er nicht mit dir reden wollen.[/size][/*]\r<br />[/list][u][color=#daa520]\r<br />[size=4]Lediglich nicht mehr durch Gerüchte ausgelöste Quests:[/size][/color][/u][list][*][size=3]Das Herz von Dibella[/size][/*]\r<br />[*][size=3]Die Wolfsschädelhöhe[/size][/*]\r<br />[*][size=3]Die letzte Ruhe[/size][/*]\r<br />[*][size=3]Das verspätete Begräbnis[/size][/*]\r<br />[/list][u][color=#daa520]\r<br />[size=4]Dawnguard:[/size][/color][/u]\r<br />[size=3](Kann alleine Benutzen werden, betrifft aber nur die aufgezählten Quests)[/size][list][*][size=3][b]Hauptquest:[/b] Durch Gerüchte oder das Gespräch mit Durak werden die Quest nicht mehr starten, es sei den, du äußerst das Interesse, beizutreten (Die Kartenmarkierung wird aber eingetragen). Auch die Festung zu Besuchen löst die Quest nicht aus, es sei den du redest mit Agmaer. Dies ist jedoch ein Bug, der Momentan nicht entfernt werden kann.[/size][/*]\r<br />[*][size=3][b]Ändert euer Aussehen:[/b] Keine „Quest“ mehr. Du kannst aber immer noch dein Aussehen ändern lassen.[/size][/*]\r<br />[/list][u][color=#daa520]\r<br />[size=4]Dragonborn:[/size][/color][/u]\r<br />[size=3](Kann alleine Benutzen werden, betrifft aber nur die aufgezählten Quests)[/size][list][*][size=3][b]Marsch der Toten: [/b]Beginnt erst, wenn du zustimmst, nicht wenn du Veleth im Kampf hilfst.[/size][/*]\r<br />[*][size=3][b]Verdammte Axt:[/b] Neue Option abzulehnen. Du kannst dir erst alle Informationen anhören und dann entscheiden.[/size][/*]\r<br />[*][size=3][b]Die letzte Einfahrt:[/b] Du musst zustimmen, bevor die Quest beginnt[/size][/*]\r<br />[*][size=3][b]Thirsk:[/b] Quest wird nicht mehr durch Gerüchte gestartet[/size][/*]\r<br />[/list]",
  "categoryId": "35",
  "version": "1.4",
  "author": "Severin von Saarthal",
  "createdUnix": "1394888402",
  "updatedUnix": "1410019455",
  "containsAdultContent": false,
  "uploadedBy": "SeverinFromSaarthal",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101274",
      "name": "Die Wahl liegt bei euch 1-3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "628",
      "fileName": "Die Wahl liegt bei euch 1-3-52097-1-3.7z",
      "uploadedUnix": "1394888336",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/0e8dddf6a8fd4095710ead90495ad561617ecd73e05ac2db2172f7ad01221ba6/analysis/1407982871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Die%20Wahl%20liegt%20bei%20euch%201-3-52097-1-3.7z?fid=1000101274&ttl=1535834894&ri=8192&rs=8192&setec=976ecb3cb99f3ad0c7b5e4035d06d3e9"
    },
    {
      "fileId": "1000125610",
      "name": "The choice is yours 1.4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "748",
      "fileName": "The choice is yours 1.4-52097-1-4.7z",
      "uploadedUnix": "1410019176",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/2ff81cac796b860e2d25f5c1544ba5c3297914e4999b856c012558115c01ab98/analysis/1410019264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20choice%20is%20yours%201.4-52097-1-4.7z?fid=1000125610&ttl=1535834895&ri=8192&rs=8192&setec=0a26cd5d36fe17c1b51073e56d242540"
    },
    {
      "fileId": "1000125612",
      "name": "The choice is yours dragonborn",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "The choice is yours dragonborn-52097-1-4.7z",
      "uploadedUnix": "1410019417",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a6095f309e96b2cdd9ead781dff761e61550cad6563b84bca410fb764c395e6a/analysis/1410019501/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20choice%20is%20yours%20dragonborn-52097-1-4.7z?fid=1000125612&ttl=1535834895&ri=8192&rs=8192&setec=b489e4aff695c99bffd0ede9519f20b5"
    },
    {
      "fileId": "1000125613",
      "name": "The choice is yours DAWNGUARD",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32",
      "fileName": "The choice is yours DAWNGUARD-52097-1-4.7z",
      "uploadedUnix": "1410019455",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/75079116e043d2b19caf77fdbb67ad69fc59abc65a2623adc00e5b73f959dfdb/analysis/1410019562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20choice%20is%20yours%20DAWNGUARD-52097-1-4.7z?fid=1000125613&ttl=1535834896&ri=8192&rs=8192&setec=af321f8d7437fdd2ca94e6dac031b4a4"
    }
  ]
}