{
  "modId": 52152.0,
  "modName": "Jedi of Skyrim V3-8",
  "summary": "A mod that takes Magicka Sabers and integrates them into a Perk system that was inspired by Knights of the Old Republic.  I was a little hesitant to upload this to Nexusmods.com being that it is not 100% original.  However, its rather popular on Steam (over 11k subs) so I&#39;ll put it up here as well.",
  "descriptionHtml": "EDIT:\r<br />\r<br />DREADOWL is my new user name on Bethesda.net.  I am uploading this mod under that username.\r<br />\r<br />Another Jedi Mod? Hardly&#33; I&#39;ve seen the other mods and, while interesting, they just don&#39;t have the flair that my mod does. I enjoyed playing &#34;Knights of the Old Repulic 1 and 2&#34; so much that I tried very hard to integrate those ideas into this skyrim mod. Granted, there&#39;s little new in this mod as far as magicka sabers and spells go but I&#39;m proud of the way I&#39;ve introduced these into the game. I really try to make the Dragonborn into a Force wielder without making the game too Star Wars immersive. \r<br />\r<br />All Jedi and Sith skills are granted through perk points in the skill trees instead of just being handed to you through books or lying around the game. This mod makes MAJOR changes to the Destruction tree and if you just HAVE to have your fire balls or ice bolts then this mod isn&#39;t going to be for you. \r<br />\r<br />I give to you &#34;Jedi of Skyrim: KotOR Edition&#34;&#33;\r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />\r<br />[b]Skill Tree Changes - ( You may choose one class per tree. Mix and match Jedi and Sith classes&#33;)[/b] \r<br />\r<br />[b]Destruction tree has been changed to Dark Side.[/b]\r<br />\r<br />Fire and Ice branches have been removed and one has been replaced with Drain Life branch. \r<br />\r<br />[b]Sith Classes[/b]: (by passive abilities, no spells listed here) \r<br />MARAUDER - a combat related class that grants combat health regen and 25% increased Saber weapon damage. \r<br />ASSASSIN - a stealth related class that grants quiet sneak attack one hand sabers. \r<br />SORCERER - a magic related class \r<br />\r<br />[b]Alteration tree has been changed to Light Side.[/b]\r<br />\r<br />[b]Jedi Classes[/b]: (by passive abilities, no spells listed here) \r<br />GUARDIAN - a combat related class that grants stamina regen and 25% increased Saber weapon damage. \r<br />SENTINEL - a stealth related class that grants quiet sneak attack sabers \r<br />CONSULAR - a magic related class that grants improved &#34;intimidate&#34; and &#34;persuade&#34; dialogue chances. \r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />Altered Spells:\r<br />\r<br />Class Specific - \r<br />Battle Presence: AoE Fear spell. Hefty Magicka Cost for balance. (Marauder and Guardian) \r<br />Jedi Mind Trick: Charm an enemy for 30 minutes, once a day. (Jedi Consular) \r<br />Force Storm: Shoot lightning and damage health. Left Hand only. (Sith Sorcerer) \r<br />Force Hide: Invisibility Power for 20 seconds, once a day. (Assassin and Sentinel) \r<br />Force Sight: See in the dark and detect life for 30 seconds. (Sentinel) \r<br />Force Grip: Grab an enemy, choke them and throw them when finished. Left Hand only (Assassin) \r<br />\r<br />Tree Specific - \r<br />Force Drain: Absorb enemy health. Left Hand only. (Dark Side Tree) \r<br />Force Push: Push an enemy. Left Hand only. (Light Side Tree) \r<br />Force Speed: Increased movement speed for 15 seconds. (Exper Jedi Perk) \r<br />Jedi Force Field: Create a force field that protects the Jedi for 20 seconds, once a day. (Light Side Tree) \r<br />Force Affliction: Lesser Power that does shock damage and stamina damage over 5 seconds. (Dark Side Sith Lord) \r<br />Battle Meditation: Lesser Power that slows time. (Light Side Jedi Master) \r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />Sabers:\r<br />(All credit to Kryptonian of Steam and Lord Haun of Nexusmods for creating this. It&#39;s amazing.) \r<br />\r<br />Blue - Guardian Class \r<br />Yellow - Sentinel Class (Strike Silently) \r<br />Green - Jedi Consular Class \r<br />Red - Sith Marauder Class \r<br />Orange - Sith Assassin Class (Strike Silently) \r<br />Violet - Sith Sorcerer Class \r<br />Cyan - Jedi Apprentice Perk \r<br />Pink - Sith Apprentice Perk \r<br />White - Saber of Jedi Master Krypto Nian \r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />Armor:\r<br />Once you&#39;ve chosen a class you gain the ability to craft class armor at the forge under Daedric. \r<br />\r<br />Jedi Guardian: Heavy Armor Set \r<br />Jedi Sentinel: Light Armor Set \r<br />Jedi Consular: Cloth Armor Set \r<br />\r<br />Sith Marauder: Heavy Armor Set \r<br />Sith Assassin: Light Armor Set \r<br />Sith Sorcerer: Cloth Armor Set \r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />Dungeon update&#33;\r<br />\r<br />\r<br />Battle your way through Sith and the spirits of lost Jedi and fight your way into the Tomb of Jedi Master Krypto Nian&#33; Be the first to wield his powerful White Magicka Saber&#33; A curior will deliver a &#34;Mysterious Note&#34; which will give you a quest to point you in the right direction. After that don&#39;t expect a helping hand, it&#39;s an exploration dungeon. \r<br />\r<br />Dungeon quest was updated to a level 30 requirement because lowbies were getting epic loots way too early in the playthrough. Level 30 guards are at the entrance for those that try to get in early. \r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />V2.0 - Added new class armor&#33; \r<br />V2.1 - Various spell updates. \r<br />V2.3 - Changed Sith Lord class to Sith Sorcerer and changed Jedi Master class to Jedi Consular. 3 spells added. \r<br />V2.4 - Hotfixes \r<br />V2.5 - Hotfixes \r<br />V3.0 - Tomb of Jedi Master Krypto Nian quest and dungeon. \r<br />V3.1 - Hotfixes \r<br />V3.2 - Hotfixes \r<br />V3.3 - Added a level 30 requirement to the dungeon quest. \r<br />V3.4 - Added 2 perks to Dark Side. Overcharge Drain and Shock for an extra 75% dmg at 90. \r<br />V3.5 - Adjusted spell dmg and &#34;mysterious woods&#34; NPCs. \r<br />V3.6 - Cleaned mod with Tes5Edit. \r<br />V3.7 - Fixed the Hood/Helm hair clipping issues with the armor (Thanks to Kryptonian) \r<br />V3.8 - Fixed Marauder combat health regen and Guardian stamina regen. Also retouched Battle Presence for those two classes. \r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />Credits and Thanks:\r<br />[url=https://steamcommunity.com/linkfilter/?url=http://www.nexusmods.com/skyrim/mods/3174/?]Lord Haun of NexusMods.com for Magicka Sabers [/url][www.nexusmods.com] \r<br />[url=https://steamcommunity.com/linkfilter/?url=http://www.nexusmods.com/skyrim/mods/441/?]Arknor1050 of NexusMods.com for Death Star Moon[/url][www.nexusmods.com] \r<br />\r<br />All copyrights owned by Disney and Lucas Arts.\r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />[b]F. A. Q.[/b] \r<br />\r<br />Q: How do I get a Magicka Saber? \r<br />A: By simply choosing a class (through perk system), a saber assigned to that class will be unlocked at the forge for smithing \r<br />\r<br />Q: How do I become a Jedi or Sith Class? \r<br />A: You can pick one of each by selecting the perk in the Dark Side and/or Light Side tree. \r<br />\r<br />Q: Do I have to chose a light or dark side? \r<br />A: No, One class from each side may be chosen. Mix and match how you like. \r<br />\r<br />Q: How do I get Jedi or Sith Armor? \r<br />A: The same way as making a saber, certain armor is unlocked at the forge with Class perks. \r<br />\r<br />Q: Why can&#39;t I pick all the classes? \r<br />A: For balance (and replay) reasons, you can only choose 1 class per tree. Go legendary reset&#33; \r<br />\r<br />Q: What happens to points I have invested in Destruction? \r<br />A: Any perk points invested in Fire or Frost will be lost. There is no way to have those points refunded to you. \r<br />\r<br />Q: What happens to points I have invested in Alteration? \r<br />A: Nothing, the Alteration tree was only added to. \r<br />\r<br />If it isn&#39;t in the description, it isn&#39;t in the mod.\r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/82802931/LegendarySeparator.png[/img] \r<br />\r<br />READ DESCRIPTION BEFORE ASKING QUESTION IN COMMENTS. Questions by lazy players that won&#39;t read will be deleted.",
  "categoryId": "75",
  "version": "3",
  "author": "Owlburgers",
  "createdUnix": "1395004995",
  "updatedUnix": "1395004935",
  "containsAdultContent": false,
  "uploadedBy": "Owlburgers",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101444",
      "name": "Jedi of Skyrim",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27266",
      "fileName": "Jedi of Skyrim-52152-3.zip",
      "uploadedUnix": "1395004935",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/7dea6debf8f3c75357e32e596fdd715081655d2a5b8e31a364f01ef9a5f47b02/analysis/1407984975/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jedi%20of%20Skyrim-52152-3.zip?fid=1000101444&ttl=1535834966&ri=8192&rs=8192&setec=22341a97bcd1752f7ba792db71475ecd"
    }
  ]
}