{
  "modId": 52150.0,
  "modName": "Khajiit Follower Kahlee",
  "summary": "Kah&#39;lee is a female Khajiit skilled with swords and light armors.  Once you rescue her from an abandoned prison, she will follow you and aid you in battle.",
  "descriptionHtml": "Kah&#39;lee is a female Khajiit skilled with swords and light armor.  She has appropriate perks for her skills and fighting style, in addition to sneaking.  She is classed for one-handed weapons and will level with you.  Thanks to Mysticentity, she will even speak with an actual female kahjiit voice.\r<br />\r<br />Before she can follow you, you must rescue Kah&#39;lee from the Abandoned Prison east of Whiterun.  She has no gear of her own, so you will have to find, buy, or craft weapons and armor for her.  Once released, she will follow you, help you, and can be married.\r<br />\r<br />Requirements:\r<br />Ponytail Hairstyles 3_0 by Azar (used with permission)\r<br />http://www.nexusmods.com/skyrim/mods/31797/?\r<br />\r<br />MFVM - More Follower Voices Mod Plus Khajiit Marriage by Mysticentity\r<br />[s]http://www.nexusmods.com/skyrim/mods/36913/?[/s]\r<br />[i]This file is no longer available on the Nexus.  The uploader has provided an archived copy here:\r<br />https://drive.google.com/open?id=0B3q61pgFsYvzcE9uYzNkR09Vcmc[/i]\r<br />\r<br />Load order:\r<br />MFVM.esm\r<br />AzarHair.esp\r<br />kahlee.esp\r<br />\r<br />Should already include all files necessary to avoid gray face bug.  Please report if you get it.\r<br />\r<br />FAQ:\r<br />Q: Can you be more specific about her location?\r<br />A:  No.  The description tells you plenty.  Go east from Whiterun and pay attention for the Abandoned Prison.  Note that this is an existing dungeon in vanilla Skyrim, not something added by this mod.  If you don&#39;t know where it is and don&#39;t feel like exploring in-game for it, feel free to Google it.\r<br />\r<br />What body type does she use?\r<br />I designed her with UNP.  However, the only mesh packed in the download is facegen data (so she has the face I designed instead of a generic gray one).  So, she should be compatible with any body replacer you use.\r<br />\r<br />Oh, and please upload pictures&#33;",
  "categoryId": "96",
  "version": "1.1",
  "author": "ArmedKevin117",
  "createdUnix": "1395000807",
  "updatedUnix": "1395000768",
  "containsAdultContent": false,
  "uploadedBy": "ArmedKevin117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101434",
      "name": "Kahlee v1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "303",
      "fileName": "Kahlee v1-1-52150-1-1.zip",
      "uploadedUnix": "1395000768",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6f2382386069a25aa295f939d12df312e2e82412a58281c175b0daeb795f0e85/analysis/1407984843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kahlee%20v1-1-52150-1-1.zip?fid=1000101434&ttl=1535834962&ri=8192&rs=8192&setec=835b3636d444f53fd3ae975cc076c3b1"
    }
  ]
}