{
  "modId": 52200.0,
  "modName": "Subtle Immersion Collection",
  "summary": "This is collection of tiny mods by me for those who can share similar senses of immersion (or reality).\r<br />Mostly focusing on experiential inconvenience and discretion in daily life. Including crafting useless items, auto door closing, a bit hardcore knapsack function, taking in-game and in-real time for crafting, torch remover for old ruins, an",
  "descriptionHtml": "This is collection of tiny mods by me for those who can share similar senses of immersion (or reality).\r<br />Not including any realistically oriented calculation, nor real-like visuals, it&#39;s mostly focusing on experiential inconvenience and discretion in daily life.\r<br />[b]See Images section for more details.[/b]\r<br />\r<br />[u][b]Version History[/b][/u]\r<br />[list]\r<br />[*]2014.3.22 - Bug fixes: \r<br />[list=1]\r<br />[*][u]Crafting Miscs[/u]/Fixed nordic goblet recipe. \r<br />[*][u]Door Observer[/u]/Added solitude jail type door and riften iron gate. \r<br />[*][u]Hardcore Carriage[/u]/[color=red]Fixed problem on transferring knapsack to other container.[/color]\r<br />To update please simply replace with newer version.\r<br />[/list]\r<br />[*]2014.3.20 - Initial version.\r<br />[/list]\r<br />\r<br />[u][b]*** Each esp has different requirements. Check [i]Requirements[/i] section for each description.[/b][/u]\r<br />\r<br />[u][b]Crafting Miscs[/b][/u]\r<br />You can forge or create misc (&#34;clutter&#34;) items at forge or tanning rack with this mod.\r<br />See what you can at forge with &#34;hammer&#34; (blacksmith&#39;s hammer), or at tanning rack with any kind of dagger equipped at your right hand.\r<br />Recipes are very simple. Commodity should be easy obtainable.\r<br />Using firewood toggles tanning rack in front of you.\r<br />\r<br />[b]Requirements:[/b]\r<br />You MUST have Dawnguard, Hearthfire, and Dragonborn.\r<br />\r<br />\r<br />[u][b]Door Observer[/b][/u]\r<br />With this mod NPCs/PC will close doors after passing them - i.e. Auto Door function. Features MCM configuration.\r<br />\r<br />[b]MCM:[/b]\r<br />[list]\r<br />[*]Enabled: specifies if the mod is enabled or disabled.\r<br />[*]Timeout: specifies how long time NPCs/PC will try to close the door.\r<br />[*]Apply to Player: specifies if the function should be applied to player character.\r<br />[/list]\r<br />\r<br />[b]Detail:[/b]\r<br />Doors of subject are vanilla doors and DLC doors. If there is another mod which have original door object newly created then they won&#39;t be supported.\r<br />Every NPCs will recognize a door in front circle of radius 2.5 meters, and try to close the door if it comes behind them and nobody stays close to the door.\r<br />This recognition will be rough if the NPC is running. And disabled when the NPC has drawn a weapon.\r<br />\r<br />[b]Requirements:[/b]\r<br />SKSE required.\r<br />\r<br />\r<br />[u][b]Hardcore Carriage[/b][/u]\r<br />Well, it&#39;s not that hardcore - with this mod equipping knapsacks will be meaningful to your exploration rather than simply increasing carry weight for 30 pts.\r<br />[list]\r<br />[*]When you are not equipped with any knapsacks (= technically you don&#39;t equip any equipments using slot 47), carry weight will be HALVED (thus you will not be able to bear anything except your armor set and weapons and basic potions in common case).\r<br />[*]Equipping a knapsack will immediately recover your carry weight.\r<br />[*]Dropping a knapsack will create a knapsack container containing the knapsack itself in front of you, and all un-favorited and unequipped items with non-zero weight in your inventory will be transferred to the knapsack container.\r<br />[*]Taking the knapsack in the knapsack container will transfer all items to your inventory (and you probably cannot run by their weight until you equip the knapsack).\r<br />[/list]\r<br />I just created this to rest at inn only with light clothing and equipments, throwing away the mass of travel stuff.\r<br />\r<br />[b]Requirements:[/b]\r<br />[list]\r<br />[*]SKSE required.\r<br />[*]You MUST have some kind of knapsack mod - because I didn&#39;t include any knapsack in this mod. I&#39;m using this mod with [url=http://www.nexusmods.com/skyrim/mods/27563]Wet and Cold[/url].\r<br />[/list]\r<br />\r<br />\r<br />[u][b]Realtime Crafting[/b][/u]\r<br />Cooking, smithing, and alchemical work will take time in-game and in-real with this mod.\r<br />\r<br />When you selected what item to be created at crafting menus, the menu will be temporarily disabled and timescale will be set to maximum rate. Just wait and see the sun goes around until your character completes production.\r<br />Amount of time depends on mostly the weight of item to be created, and how sophisticated the item is, and your related skill level.\r<br />\r<br />You can select speed and what craft menu will be the subject of this mod.\r<br />Cooking time is basically determined by total weight of ingredients.\r<br />By default, 15 minutes is necessary to cook ingredients of weight 1.0.\r<br />Crafting time is determined by weight and performance.\r<br />By default, a sunday blacksmith (Smithing level 15) needs about 7 hours to forge an iron armor, according to the formula below:\r<br />[list]\r<br />[*]For armors\r<br /> HOURS = (Speed Factor)*((Base Armor Rating)*(Weight))^0.5 / (2*(Smithing)^0.25)\r<br />[*]For weapons\r<br /> HOURS = (Speed Factor)*((Base Damage)*(Speed)*(Weight))^0.5 / (2*(Smithing)^0.25)\r<br />[*]For misc items\r<br /> HOURS = (Speed Factor)*((Weight)^0.5) / (2*(Smithing)^0.25)\r<br />[*]For potions\r<br /> HOURS = (Speed Factor)*((Total Weight of Ingredients)*((number of ingredients)^2)) / (2*(Alchemy)^0.25)\r<br />[/list]\r<br />And as an exception, upper limit is set to 18 hours while lower limit is set to 0.1 hour.\r<br />\r<br />[u]Note:[/u]\r<br />[list]\r<br />[*]Menus will be hidden but control is not locked. You can perform rapid &#39;E&#39; key firing to create numbers of the item. I left this behavior open.\r<br />[*]To erase server pot, sneak-activate it. Until then you can cook a well-known recipe by putting correct ingredients directly into the pot.\r<br />[/list]\r<br />\r<br />[b]Requirements:[/b]\r<br />[list]\r<br />[*]SKSE required.\r<br />[*]SkyUI required if you want to configure.\r<br />[/list]\r<br />\r<br />\r<br />[u][b]Salvo Teamed Bowshoot[/b][/u]\r<br />With this mod you can shoot bows to your enemy with upto 4 followers simultaneously. This will enable you a ranged sneak-attack by team.\r<br />\r<br />A lesser power &#34;Salvo Direction&#34; will be added to you.\r<br />At first aim to your enemy and use this power, then the enemy is marked as &#34;target&#34;. Followers will make line formation in front of you.\r<br />Second, shooting your bow anywhere (to that enemy, to another enemy, or nowhere) will be the sign of &#34;commence fire&#34;. Followers will start shooting at &#34;target&#34; with their ranged weapons.\r<br />If you want to cancel the target, use the power aiming nowhere.\r<br />Do not expect too much - NPCs are usually poor archers.\r<br />\r<br />[b]Requirements:[/b]\r<br />SKSE required.\r<br />\r<br />\r<br />[u][b]Torch Off[/b][/u]\r<br />Why torches in ancient ruins are turned on? Unmaintained fires (nobody living nearby) should be put out.\r<br />This mod turns off every seems-to-be-unmaintained lights when you entered old ruins.\r<br />\r<br />This process sometimes takes extra one minute to usual loading process... however, it also changes taste of dungeons a bit more immersive, and available to any dungeons.\r<br />If you are experienced player and want some change of accustomed dungeons, trying this mod might make sense.\r<br />Be warned - this mod works according to keywords set to locations. If your player home doesn&#39;t have proper location keywords like LocTypePlayerHome or LocTypeDwelling, some sort of fires might be put off.\r<br />\r<br />[b]Requirements:[/b]\r<br />[list]\r<br />[*]You MUST have Dawnguard, Hearthfires, and Dragonborn.\r<br />[*]SKSE required.\r<br />[/list]",
  "categoryId": "78",
  "version": "1.01",
  "author": "wgstein",
  "createdUnix": "1395223421",
  "updatedUnix": "1395449902",
  "containsAdultContent": false,
  "uploadedBy": "wgstein",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101975",
      "name": "SIC",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "229",
      "fileName": "SIC-52200-1-01.zip",
      "uploadedUnix": "1395449902",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/e1dee6019fe53ee861f202ec95ad6b562ed17e888cf807afc2c92a4abee0b09a/analysis/1407990483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SIC-52200-1-01.zip?fid=1000101975&ttl=1535835028&ri=8192&rs=8192&setec=916731cc81d369ecf9590beb019c2259"
    }
  ]
}