{
  "modId": 52201.0,
  "modName": "Catnip for Khajiits",
  "summary": "This mod adds dried catnip to Skyrim, purchasable from the Khajiit caravans.  It acts as a drug for Khajiit.",
  "descriptionHtml": "This mod adds dried catnip to Skyrim, purchasable from the Khajiit caravans.\r<br />\r<br />If you are a Khajiit, the effects will be like that of a drug - similar to how catnip affects cats in the real world.\r<br />\r<br />First, you&#39;ll get a hit from the initial intake - the world will seem as though it&#39;s in overdrive for a few seconds (using the Slow effect).  Once this has worn off, you&#39;ll see through a drugged haze (using the Sleeping Tree Sap effect), but your power in illusion will increase, as your perception of other realities is boosted.  You will also find that your hunting instincts are sharpened (one-handed skill fortified by 10%).\r<br />\r<br />The effects last for 15 minutes - the same average time it takes for catnip to wear off for cats in the real world.\r<br />\r<br />It&#39;ll also immediately restore health and stamina.\r<br />\r<br />\r<br />\r<br />If you are not a Khajiit, there will be no effect at all - so it&#39;ll be a waste of money&#33;\r<br />\r<br />\r<br />Catnip is rare, and only the Khajiit Caravan Vendors know where to find it and have limited quantities in stock.  Catnip is not illegal in Skyrim (or in the real world&#33;) but due to its rarity in Skyrim it is also quite expensive.\r<br />\r<br />Like real catnip, it&#39;s not addictive - so feel free to use as much as you can find and afford&#33; \r<br />\r<br />This mod was inspired by a request made by adam2013.",
  "categoryId": "94",
  "version": "0.1",
  "author": "jackstarr",
  "createdUnix": "1395155016",
  "updatedUnix": "1395154578",
  "containsAdultContent": false,
  "uploadedBy": "jackstarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101610",
      "name": "Catnip for Khajiits",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31",
      "fileName": "Catnip for Khajiits-52201-0-1.zip",
      "uploadedUnix": "1395154578",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/8f1823e08c14ab15e3dea46112c876ad5186a17175eb3d605fe0e173986f0e8c/analysis/1407986770/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Catnip%20for%20Khajiits-52201-0-1.zip?fid=1000101610&ttl=1535835030&ri=8192&rs=8192&setec=f016b28388f1ad6c52132c5f0e0a7de4"
    }
  ]
}