{
  "modId": 52214.0,
  "modName": "Lazy Player Cheat Chest Plus",
  "summary": "A cheat chest, starting spells, and stat mod. ",
  "descriptionHtml": "Hi there&#33; I basically just play the game like a tourist, looking at the pretty flowers while bounding aimlessly across the countryside, doing whatever I want, usually spending every moment with TGM toggled with various cheats installed to help me along the way, so... if you&#39;re a serious / lore-intense / forgot to feed the kids / your spouse is filing divorce papers / total immersion sort of player, then this mod is definitely not your cup of chamomile. \r<br />\r<br />I had, for a while, a set of various cheats going, but I tossed those and decided to make my own in one file.  Much more fun.\r<br />\r<br />Warning:  Because of all the perks, you won&#39;t level very quickly with this mod (...but you won&#39;t have to).\r<br />\r<br />Contents:\r<br />\r<br />* A cheat chest in Helgen hall at the beginning of the game.  I considered putting child clothes/toys in there for adopted kids to have but didn&#39;t.  Next release, perhaps.\r<br />\r<br />The cheat chest contains:  \r<br />25,000 septims\r<br />Keys...lots of keys...including the Skeleton Key.\r<br />Mark&#39;s Silver Sword (330 dmg, wt 1, value 100). Not horribly overpowered but better than the starting weapons.\r<br />\r<br />\r<br />In addition to the contents of the chest:\r<br />\r<br />* Unique destruction spells assigned to the PC at game startup based on various destruction spells. Each spell does 8000 points of damage, costs 1 pt to cast.\r<br />\r<br />* Unique summoning spells for the familiar and the dremora (both overpowered, naturally).  The wolf is set to 1.5 normal size, which I don&#39;t see as particularly huge.  Maybe next round.  The dremora lord can cast the same 8000 point damage firebolt spells as the PC.  NPCs use the regular versions of the destruction spells (that do far less damage).  Remember, if you get excited by drawn-out fights, this is a party killer.  A dragon is just in the way of the next pretty patch of flowers.  You can, because these destruction and summoning spells are separate from the default spells, choose to ignore them and just memorize the books (for the normal spells).  Do a search on *All in the creation kit for markmod and you&#39;ll see everything.\r<br />\r<br />* Bandit faction.  Yes, bandits will ignore you, even if you kill some of them that are standing right next to other bandits. I wanted to do the forsworn the same way, but that causes story issues when trying to do the ambassador quest in solitude, so I had to pull that (Lydia attacks forsworn).  Learned that the hard way.  Nothing stops you from killing bandits, and after 150 hours of game play, have not had any quests break for having bandit faction.\r<br />\r<br />* Lots of town factions.  I thought this would grease the wheels a bit, but the inclusion of these factions hasn&#39;t proven to be much of anything, not that I&#39;ve taken to ticking off guards.\r<br />\r<br />* Perks... and more perks.  Because of this, you won&#39;t level by fighting.  Craft a house, gear, etc., and boom... you&#39;ll start leveling.  There&#39;s a few other odds and ends that will get you leveled, but not many involving battle.\r<br />\r<br />* Stat changes.  Run speed = 270, which is fast (I made sure that the uniquely created spells for the summoned familiar and dremora lord also had travel set to 270).  Before I published this mod and was using it just for myself, I had it at 350 but tamped it down a bit, for I was running off cliffs, etc., which, being in TGM, wasn&#39;t fatal, but certainly proved annoying. Sliding right past High Hrothgar and into the wild blue yonder, while interesting to experience, was a bit of a let down (literally) after spending all that time getting up there.  But I digress. Your health and stamina are up a bit too, but you&#39;re not immortal. \r<br />\r<br />I think that about covers it. Enjoy.\r<br />",
  "categoryId": "40",
  "version": "1",
  "author": "xordevoreaux",
  "createdUnix": "1395176572",
  "updatedUnix": "1395176382",
  "containsAdultContent": false,
  "uploadedBy": "xordevoreaux",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101647",
      "name": "markmod_Player1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2777",
      "fileName": "markmod_Player1-52214-1.zip",
      "uploadedUnix": "1395176382",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e969d5587737a2a63503daaf404392610cfe63675e6183dadc4d3ba42bf6a676/analysis/1407987140/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/markmod_Player1-52214-1.zip?fid=1000101647&ttl=1535835050&ri=8192&rs=8192&setec=191ecc3943db1f9857404dfeba2b0d8f"
    }
  ]
}