{
  "modId": 52239.0,
  "modName": "Immersive NPC in the dark",
  "summary": "This mod makes NPC more immersive in the dark, they will use various light sources to see their enemies and they will alter their combat behaviors when they can&#39;t see their target. ",
  "descriptionHtml": "[center][size=7][color=#FFFF80][b]Immersive NPC in the dark[/b][/color][/size][/center]\r<br />[center][color=#FFFF00][b]version 0.8.2 BETA[/b][/color][/center]\r<br />\r<br />I love lighting mods that make Skyrim darker (RLO and ELFX), but i hate seeing NPC behave like they all have some sort of nightvision, they can hit me even in the dark while i struggle to spot and hit them.\r<br />\r<br />This mod will make those NPC have difficulties seeing and fighting in the dark and they will carry/use their own light sources to overcome these difficulties.\r<br />\r<br />Not all NPCs will have these behaviors, undeads and those that has nightvisions are more than happy to fight you in pitch black dungeon, you will still need to use night vision or just wield your torch to fight them\r<br />\r<br />Here is a video that shows some of features in version 0.6 (it&#39;s the older version of this mod, some features has been re-tweaked) ([i]thanks to brodual for making this awesome video[/i])\r<br />\r<br />[center][youtube]2lFchu_v9PI[/youtube][/center]\r<br />\r<br />[line]\r<br />\r<br />[center][size=6][color=#FFFF80][b]Features[/b][/color][/size][/center]\r<br />\r<br />The main purpose of this mod is to make almost every [i]humans, orcs, and elves[/i] in the game behaves differently in the dark by making them use various light sources and/or limiting their combat capabilities. Not all of them will have these behavior and limitation, you can read [url=http://www.nexusmods.com/skyrim/articles/49686/?]here[/url] for the full list of NPC that are excluded by this mod.\r<br />\r<br />[color=#FFFFC0][b][size=4]Out of combat behavior[/size][/b][/color]\r<br />[img=right]http://static-2.nexusmods.com/15/mods/110/images/52239-1-1396581253.jpg[/img]\r<br />NPC will use torch or lantern to see in the dark, most of them will prefer torch over lantern.\r<br />\r<br />NPCs will use light only when they think it&#39;s necessary, e.g: they will not use it If someone around them has already used one. \r<br />\r<br />There are a lot of other things that are taken into consideration in deciding whether to use/not use a light source, all are done in order to make them more believable and minimize light usage in a very crowded places.\r<br />\r<br />[color=#FFFFC0][b][size=4]Searching Behavior[/size][/b][/color]\r<br />\r<br />When NPC is alerted, they will search for their undetected enemy, usually by going to a certain area that draws their attention.\r<br />\r<br />While they are searching, each NPCs in different directions will usually turn their lights on so that they can see better and able to detect their enemy. Thus, each search party will usually have one \r<br />person at the front using a light source.\r<br />\r<br />Once an enemy has been detected, there is only one thing that matters to them, it is whether they can see their target or not.\r<br />\r<br />[color=#FFFFC0][b][size=4]Combat behavior[/size][/b][/color]\r<br />\r<br />NPCs prefer to not using any lights in battle, they simply don&#39;t want to be seen, so if they can see their target they will have no reason to keep their light on and charge at their enemy from the dark. \r<br />\r<br />Usually a battle ends up with one melee fighter closing in using lantern/torch, while his friends turn off their lights and attack their target from the shadow. A light bearer has a responsibility to make sure the target can be seen.\r<br />\r<br />When the light bearer dies, he will throw his torch at his target  at the last moment of his life. If the enemy still can&#39;t be seen, a new Light bearer will arise to replace his dying comrade.\r<br />\r<br />[color=#FFFFC0][b][size=4]Archers behavior[/size][/b][/color]\r<br />\r<br />After losing sight of their target, Archers (bow and crossbow users) will shoot one or maybe two arrows and then either hold their current position or just go full-melee and search their  target.\r<br />\r<br />[color=#FFFFC0][b][size=4]Mages behavior[/size][/b][/color]\r<br />\r<br />Mages usually cast candlelight in battle even if he/she has already seen the enemy, Candlelight is very bright and cover a lot of ground, it acts as a beacon for their teammates so that they don&#39;t have to use light anymore, one candlelight is enough to light up a cave.\r<br />\r<br />[color=#FFFFC0][b][size=4]Difficulties in turning torch and lantern on[/size][/b][/color]\r<br />\r<br />[img=right]http://static-3.nexusmods.com/15/mods/110/images/52239-1-1396610959.jpg[/img]\r<br />For NPC, turning on lights in combat is way harder that it is out of combat, especially when they are very close to their target, at the very least, they will have to turn the light on and reequip their weapon.\r<br />\r<br />In the heat of battle, things can happen, sometimes they forgot to reequip their weapon after turning on their light, they will punch their target once or twice before they can think straight again and use a proper weapon, some may even stay unarmed throughout the battle.\r<br />\r<br />Overly excited NPC around you may get tripped over while whipping out their lantern/torch, they may even loose grasp of their weapon which forces them to either fight bare handed, or pickup their dropped weapons. NPC will hardly ever get tripped in battle, but once it does, their opponent can usually kill them while they&#39;re trying to get up.\r<br />\r<br />[color=#FFFFC0][b][size=4]Configurable[/size][/b][/color]\r<br />\r<br />Several aspect of this mod can be configured through MCM (you need to have SkyUI installed to do this). I do not put everything in there mostly because of performance or maintenance reason, i will probably add / remove some options before version 1.0.\r<br />\r<br />[color=#FFFFC0][b][size=4]Special NPCs[/size][/b][/color]\r<br />\r<br />[b]Carriage drivers[/b] will never use torch, they only use lantern, and will keep it on most of the time.\r<br />\r<br />[b]Beggars[/b] will never use light in the city they&#39;re in, but they will use one in combat &#33; those beggars are just pretending to be poor and can&#39;t even afford a cheap torch while they can actually buy and use endless supplies of lanterns.\r<br />\r<br />[b]Assassins[/b] are the opposite of beggars, they will use torches/lanterns just like other NPCs, but once they&#39;ve entered combat, they will turn their light off and use their night vision to fight in total darkness.\r<br />\r<br />Who are these assassins ? They are [b]Dark Brotherhood[/b] members, some people in [b]Blackbriar[/b] family, and any custom NPC that has [i]CombatAssassin[/i] class.\r<br />\r<br />[line]\r<br />\r<br />[size=5][color=#FFFF80][b]Requirements[/b][/color][/size]\r<br />\r<br />[list]\r<br />[*] Skyrim version 1.9.32 or later\r<br />[*] SKSE version 1.6.16 or later\r<br />[*] [b](Optional)[/b] SkyUI 4.1 or later\r<br />[*] [b](Optional)[/b] Any mods that makes Skyrim darker\r<br />[/list]\r<br />\r<br />[size=5][color=#FFFF80][b]Installation[/b][/color][/size]\r<br />\r<br />[list]\r<br />[*] Download with NMM and install, or manually download and copy it to your Data folder\r<br />[*] Put this mod anywhere in your load-order, it doesn&#39;t matter\r<br />[*] Play the game, you should see notification on the top left corner that this mod has been installed\r<br />[/list]\r<br />\r<br />[size=5][color=#FFFF80][b]Uninstalling[/b][/color][/size]\r<br />\r<br />Use NMM to uninstall, or manually delete the two files.\r<br />\r<br />As this mod is a script mod,  [url=http://www.nexusmods.com/skyrim/mods/52363/?]Save game script cleaner[/url] is very very helpful in cleaning your save game after uninstalling this mod.\r<br />\r<br />[size=5][color=#FFFF80][b]Upgrading From 0.8.* to 0.8.2[/b][/color][/size]\r<br />\r<br />[list]\r<br />[*]Save your game in are that has no people around you (e.g: in wilderness or an empty house)\r<br />[*]Replace the old files\r<br />[*]Load your save game and you will see notification at the top left corner of your screen that the mod has been upgraded to 0.8.2\r<br />[/list]\r<br />\r<br />[size=5][color=#FFFF80][b]Upgrading From 0.7.* to latest version[/b][/color][/size]\r<br />\r<br />I do not recommend upgrading from 0.7.* to the latest version, it&#39;s better to just re-install the mod and load from a clean save game, it&#39;s because the code base are totally different while still using the same FormID from previous version. \r<br />\r<br />But if you really still want to use the save game, here are the steps (thanks to [i]looooots[/i] for testing this out)\r<br />\r<br />[list=1]\r<br />[*] Uninstall the previous version\r<br />[*] Load the save game\r<br />[*] Play the game for a while, save the game, and quit\r<br />[*] Use [url=http://www.nexusmods.com/skyrim/mods/52363/?]Save game script cleaner[/url] to clean your save game, make sure all scripts that have [i]_NUL_[/i] prefix are deleted\r<br />[*] Install latest version\r<br />[*] Load the save game, you may find some NPCs not having the behaviors from this mod, but they will regain them after sometime\r<br />[/list]\r<br />\r<br />[line]\r<br />\r<br />[size=5][color=#FFFF80][b]Compatibility[/b][/color][/size]\r<br />\r<br />Technically, this mod is compatible with any mods out there, because it doesn&#39;t modify any master data at all.\r<br />\r<br />These are some mods that the good people in the [u][i]posts[/i][/u] have tested :\r<br />\r<br />[list]\r<br />[*] Requiem\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/39759/?]Immersive Spells and light[/url]\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/9286]SkyRe[/url]\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/18436]ASIS[/url]\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/23353]Improved sneak detection[/url]\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/2700]Duel: Combat Realism[/url]\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/14019/?]Lights up the night, people use torches[/url] *\r<br />[/list]\r<br />\r<br />[i]* I do not recommend using this mod with [i]Lights up the night[/i], my mod ignores NPCs that already has torch in their inventory, and since [i]Lights up the night[/i] adds torches to bandits and villagers, my mod will have nothing left to do.[/i]\r<br />\r<br />[line]\r<br />\r<br />[size=5][color=#FFFF80][b]Changelogs For version 0.8.2[/b][/color][/size]\r<br />\r<br />[list]\r<br />[*] Fixed bug where oncelldetach function waiting for mutex to be unlocked before removing torch from NPC, which result in frequent invisible torches\r<br />[*] Fixed bug where people use torch simultaneously out of combat, it also fix fast light switching because of hasty decision in turning light on, things looks better now out of combat\r<br />[*] Fixed bug where torch user reequips weapon twice upon entering combat/searching mode\r<br />[*] Fixed bug where torch user drop 2 torches upon death\r<br />[*] Fixed bug where NPC turn off their light while running from one location to another\r<br />[*] Fixed bug where NPC still use torch/lantern after moving from exterior to interior\r<br />[/list]\r<br />\r<br />[i]You can read the full changelogs from previous version, [url=http://www.nexusmods.com/skyrim/articles/49675/?]here[/url][/i].\r<br />\r<br />[size=5][color=#FFFF80][b]Known Bugs[/b][/color][/size]\r<br />\r<br />[size=3][b]Critical Bugs[/b][/size]\r<br />\r<br />none\r<br />\r<br />[size=3][b]Non critical Bugs[/b][/size]\r<br />\r<br />[list]\r<br />[*} NPC may failed to respond to time and weather changes if the cell they&#39;re in never gets detached (e.g: the player staying in one place for too long and/or the uGrids is above normal)\r<br />[*] Archers aren&#39;t waiting anymore, they immediately switch to melee and charge the unseen target.\r<br />[/list]\r<br />\r<br />[i]This mod is still in beta and it affects almost all NPCs in the vast world of Skyrim, so there bound to be bugs here and there. If you like this mod, please help me beta-test it and report any bugs that you&#39;ve found in your test , even if it&#39;s just a small annoying things.[/i]\r<br />\r<br />[size=5][color=#FFFF80][b]Frequently Asked Question[/b][/color][/size]\r<br />\r<br />[color=#FFFF80][b]Q: How does this mod affects sneaking ?[/b][/color]\r<br />\r<br />Having more lights equals harder sneaking. Unless you are using mods that removes lights from the [url=http://www.creationkit.com/Detection]detection formula[/url].\r<br />\r<br />[color=#FFFF80][b]Q: The enemies are so nerfed they&#39;re not challenging anymore, is this intentional ?[/b][/color]\r<br />\r<br />This mod aims to make NPC more belivable in the dark, and nerfing them is one of the method that i&#39;ve chosen, so yes, they will be a bit easier to beat; But, if you&#39;re used to seeing people using torch/lantern, you&#39;ll be having a hard time fighting khajits, falmers, spiders, assasins and others who can see in the dark.\r<br />\r<br />[i]Note: If you&#39;re asking this question while still using vanilla difficulties in Skyrim, please do yourself a favor and install mods that make Skyrim a lot more challenging.[/i]\r<br />\r<br />[color=#FFFF80][b]Q: Does this mod conflicts with other mod that changes combat AI ?[/b][/color]\r<br />\r<br />NO, combat AI is not something a modder can change, we can only change its parameters, interrupts it to run an AI package, issues very limited set of commands from script to alter their behavior, or listen to events sent by the game such as when the NPC is hit or things like that.\r<br />\r<br />This mod only controls light source usage and do a bit of commands to the AI at a very specific time, place and condition. It doesn&#39;t change any master data (including AI packages) at all, so it should be compatible with other combat AI mods.\r<br />\r<br />I&#39;m developing this mod while having SkyRe intalled, SkyRe changes a lot of aspect of combat, and they both run without any problems or glitches.\r<br />\r<br />[color=#FFFF80][b]Q: How does this mod affects performance ?[/b][/color]\r<br />\r<br />This mod doesn&#39;t add excessive lights (e.g: not adding torch to all NPCs), so the strain on rendering is minimal. But this mod runs a script on every valid NPCs in your area, each will run the script until they are detached from their cell. The script behaves like a vampire, it&#39;s active in dark places (dungeons, night time, bad weathers), and hibernate in daylight or bright interiors.\r<br />\r<br />The script doesn&#39;t do extremely fast heart-beat updating, only one NPC at a time executes the heavy light distribution algorithm. It runs even faster in combat since they will rarely use the algorithm (their main concern is their combat target&#39;s light level).\r<br />\r<br />Anyway, my laptop is an outdated one, it has a medium-end graphic card and a somewhat decent CPU; And i don&#39;t experience any drop in frame rate while using this mod even in Solitude&#39;s busiest hours. \r<br />\r<br />[color=#FFFF80][b]Q: How can i make skyrim darker ?[/b][/color]\r<br />\r<br />There are plenty of mods and ENB presets on Nexus that can do this. These are some that i have tried :\r<br />\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/30450]Realistic Lighting Overhaul[/url] \r<br />[*][url=http://www.nexusmods.com/skyrim/mods/27043]Enhanced Lights and effects[/url] \r<br />[*][url=http://www.nexusmods.com/skyrim/mods/1875]RCRN AE[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/49472]Realistic Nights[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/17802]Climates of Tamriel[/url]\r<br />[/list]\r<br />\r<br />Be careful if you&#39;re using Climates of Tamriel, its darker night and dungeon modules achieves darkness by making all lights dimmer (it&#39;s like you&#39;re playing using a very dark sun glasses). But the good thing is, CoT is very compatible with other lighting mods, you should mix and match them to achieve the level of darkness that you want.\r<br />\r<br />[line]\r<br />\r<br />[size=5][color=#FFFF80][b]Troubleshooting[/b][/color][/size]\r<br />\r<br />[color=#FFFF80][b]Texture flickering in major cities[/b][/color]\r<br />\r<br />Some people (and me) experienced a certain  rectangular / triangular area in the cities that refuse to render lights from torches when they&#39;re seen at a certain camera angle. \r<br />\r<br />It&#39;s less noticeable in vanilla, but sticking out like a sore thumb in custom major cities exterior mod (e.g: RLO major city exterior). This is a very annoying thing to see  and i hope bethesda would fix this in later version.\r<br />\r<br />If you also experience this problem, please untick [i][b]Enable in major cities[/b][/i] option in MCM. If you are not using MCM, you can open the console using [b]~[/b] and enter this command:\r<br />\r<br />[code]\r<br />set _NUL_gEnableCapital to 0\r<br />[/code]\r<br />\r<br />This doesn&#39;t instantly makes NPC turn their lights off, you need to get out of the city for a little while before the changes kicks in.\r<br />\r<br />Depending on your current installed lighting/weather mod, this will make citizens walk like they can clearly see their path in pitch black night, and if you can&#39;t tolerate this, you can use either Lantern of Skyrim mod or ELFX exterior modules which adds some nice light sources in various places.\r<br />\r<br />[color=#FFFF80][b]Brawlbug patch[/b][/color]\r<br />\r<br />I added brawlbug patch scripts in my mod. There are two types of fixes to brawl bug, the one without replacing vanilla script is not feasible for this mod, so i use the other one. \r<br />\r<br />Mod organizer will mark them as conflicts with other mods that also added these scripts.\r<br />\r<br />I could have separated the brawlbug scripts in another file, or make brawlbug plugin modder resource as one of the requirements, but since i see a couple of mods adding these scripts in their mod, i thought it&#39;s a common practice so i added them too.\r<br />\r<br />You can replace these scripts from those contained in other mods, it doesn&#39;t matter as long as they fix the brawl bug.\r<br />\r<br />[line]\r<br />\r<br />[size=5][color=#FFFF80][b]Credits and Permissions[/b][/color][/size]\r<br />\r<br />[list]\r<br />[*] [url=http://www.nexusmods.com/skyrim/users/187943/?]Chesko[/url] for his cool [url=http://www.nexusmods.com/skyrim/mods/17416/?]wearable lantern[/url] meshes and effects\r<br />[*] [url=http://www.nexusmods.com/skyrim/users/1226984/?]Vixenfinder[/url] for the lantern texture\r<br />[/list]\r<br />\r<br />[size=5][color=#FFFF80][b]Special Thanks[/b][/color][/size]\r<br />\r<br />Thanks to these wonderful people who has given me support, feedback, ideas, and/or bug reports\r<br />\r<br />Chesko, MotoSxorpio, Nizuma, brodual, Dkboy24, Ripster, saqk , ArtMurder, GMulryanm kujoe, Sondermann, xpatonsonx, alantern, looooots, atlashrug, tonycubed2, filimon 666, oqhansoloqo, devondaman, shaiwan, zekafonss, DJ_Supra, sppphy, and lots of others that has helped me which i may have forgotten\r<br />\r<br />TODO: add some more beta testers, you&#39;ve all been really helpful ...\r<br />\r<br />[line]\r<br />\r<br />[size=5][color=#FFFF80][b]Disclaimer[/b][/color][/size]\r<br />\r<br />THE MOD IS PROVIDED &#34;AS IS&#34;, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE MOD.",
  "categoryId": "78",
  "version": "0.8.2",
  "author": "hacknpaint",
  "createdUnix": "1395254955",
  "updatedUnix": "1396797458",
  "containsAdultContent": false,
  "uploadedBy": "hacknpaint",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000103540",
      "name": "Immersive NPC in the dark 0-8-0",
      "version": "0.8.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1031",
      "fileName": "Immersive NPC in the dark 0-8-0-52239-0-8-0.7z",
      "uploadedUnix": "1396519786",
      "modVersion": "0.8.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bc4f9f3a47f779b1db53bbf285721f56bebdf018dd323245deaa48bcc81a4a5/analysis/1408005666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20NPC%20in%20the%20dark%200-8-0-52239-0-8-0.7z?fid=1000103540&ttl=1535835082&ri=8192&rs=8192&setec=5c51fec2da73addd9f74941464b9838b"
    },
    {
      "fileId": "1000103748",
      "name": "Immersive NPC in the dark 0-8-1",
      "version": "0.8.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1009",
      "fileName": "Immersive NPC in the dark 0-8-1-52239-0-8-1.7z",
      "uploadedUnix": "1396713468",
      "modVersion": "0.8.1",
      "virusScanUrl": "https://www.virustotal.com/file/f74d77be28ea74019c56cf5d222bf7de8d2e4fd433802a0af6999d4e146ce922/analysis/1408008007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20NPC%20in%20the%20dark%200-8-1-52239-0-8-1.7z?fid=1000103748&ttl=1535835082&ri=8192&rs=8192&setec=f123e9fcbc521b5836e746f4e65092b3"
    },
    {
      "fileId": "1000103908",
      "name": "Immersive NPC in the dark 0-8-2",
      "version": "0.8.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1009",
      "fileName": "Immersive NPC in the dark 0-8-2-52239-0-8-2.7z",
      "uploadedUnix": "1396797458",
      "modVersion": "0.8.2",
      "virusScanUrl": "https://www.virustotal.com/file/8dd73a30d1c4ab16b955dcc46a801a80a31e87dfaecd15300dc78c4647a84b54/analysis/1408009651/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20NPC%20in%20the%20dark%200-8-2-52239-0-8-2.7z?fid=1000103908&ttl=1535835083&ri=8192&rs=8192&setec=b3187373ed4b9862679d5a52b18b04cd"
    }
  ]
}