{
  "modId": 52240.0,
  "modName": "Infinity Blade",
  "summary": "The Infinity Blade from Infinity Blade By Teratronic ",
  "descriptionHtml": "This is an update to my Infinity Blade mod.\r<br />You no longer have a quest or a boss to get the infinity blade, which i found to be much easier to work with.\r<br />\r<br />\r<br />NEW DEATHLESS RACE \r<br />Added the Deathless race- Not OP as before \r<br />Stats: \r<br />Base Health: 350 \r<br />Base Magicka: 250 \r<br />Base Stamina: 250 \r<br />\r<br />INFINITYBLADE \r<br />The Infinity Blade is now in a spell, only able to be used by the Deathless race (this makes it to where it is not so overpowered) Now just like in the game, you can summon the blade like the god king does. \r<br />The spell&#39;s duration is pretty much infinite, so just sheathe it to dispel it. \r<br />its base damage is 200 just like the game, so it isn&#39;t so overpowered. \r<br />Custom enchantment which includes a mini version of Dragonrend. \r<br />(I also implemented a non spell Infinity Blade in case anyone didn&#39;t want to be the Deathless race, just get it via console.) \r<br />\r<br />HELIO ARMOR: \r<br />Now craftable, but not temperable. \r<br />Require 10 moonstone, 5 quicksilver, 5 malachite, 3 leather strips, and 2 daedra heart. \r<br />Requires Daedric Smithing, and it is under Miscellanous \r<br />I Know it is expensive but its 400 armor rating is the best in the game. \r<br />\r<br />Update: \r<br />~~~~~~~~~~~~~~~~~~~~~~~~ \r<br />Added Alternate texture for the Infinity Blade that looks more game friendly. It does the same exact damage and same exact enchantment as the darker version. \r<br />INFINITY BLADE SHOULD NOT BE INVISIBLE ANYMORE&#33; \r<br />Added a recipe and temper for the 2 blades if you didn&#39;t want to be deathless. \r<br />Added a temper for Helio armor. ",
  "categoryId": "36",
  "version": "2",
  "author": "Teratronic",
  "createdUnix": "1395253472",
  "updatedUnix": "1395253472",
  "containsAdultContent": false,
  "uploadedBy": "Shadowdeaths7",
  "primaryFile": null,
  "files": []
}