{
  "modId": 52271.0,
  "modName": "Barrels Of Fun - A Fix For Hearthfire",
  "summary": "Changes the mead barrels in Hearthfire homes (and those that use HF assets) to dispense different drinks instead of Nord mead.",
  "descriptionHtml": "[center][img]http://i.imgur.com/qqBtnl1.png[/img][/center]\r<br />[color=red][size=20][b][u]Description[/u][/b][/size][/color] \r<br />\r<br />&#34;Barrels Of Fun&#34; is a simple (and tiny) mod that changes the drinks offered by the barrels in the Hearthfire player home cellars from &#39;Nord Mead&#39; to any one of 35 different drink choices.  That&#39;s it.  No fireworks, save for maybe a sparkler.\r<br />\r<br />This mod was previously known as &#34;Honningbrew - A Fix For Hearthfire&#34;.  If you are using v. 1.0 of this mod, it is recommended that you uninstall it (no worries...no scripts) and install the update as the mod plugin name has changed and would not simply overwrite the old one.\r<br />\r<br />[color=red][size=20][b][u]Requirements:[/u][/b][/size][/color] \r<br />[list]\r<br />[*]Skyrim (updated)\r<br />[*]Hearthfire\r<br />[*]Dawnguard (Required only for certain drink options)\r<br />[*]Dragonborn (Required only for certain drink options)\r<br />[/list]\r<br />[color=red][size=20][b][u]Changelog:[/u][/b][/size][/color] \r<br />2.0: Made mods for all available drinks.  Created FOMOD installer.\r<br />1.0: Made initial Honningbrew Mead replacer.  As an optional file, made the Juniper Berry Mead replacer.\r<br />\r<br />[color=red][size=20][b][u]All (I hope) of your questions answered:[/u][/b][/size][/color] \r<br />\r<br />[color=red]Q: What drinks are available?[/color] \r<br />A: All drinks in the official game and official DLCs.\r<br />\r<br />And I do mean [b]ALL[/b] drinks.\r<br />\r<br />Well, all drinks except Nord Mead - if you want that, just don&#39;t install this mod.\r<br />\r<br />Rather than listing them all here, I took a screenshot of the installer selection list.  It shows all of the options.\r<br />\r<br />[color=red]Q: I play as a vampire.  We don&#39;t lower ourselves to drinking things made from plants.  What can this mod do for me?[/color] \r<br />A: Does a &#39;Barrel-o-blood&#39; sound tasty?  I thought of you too.\r<br />\r<br />[color=red]Q: How about Skooma?  You carry Skooma?[/color] \r<br />A: Yes, all varieties, you little junkie.  Drink away.\r<br />\r<br />[color=red]Q: All this alcohol has had a serious effect on my love life.  Got anything for that?[/color] \r<br />A: Sure do.  Other options are Milk and Falmer Blood Elixir.\r<br />\r<br />[color=red]Q: What about drinks from [i](insert mod name here)[/i]?[/color] \r<br />A: I have neither the plans nor desire to make plugins for a trillion different mod-added drinks.  This might change in the future but, for now, no.  Sorry.\r<br />\r<br />[color=red]Q: Wait a minute...  If you added all drinks, won&#39;t some of these break quests?[/color] \r<br />A: Yes - quite possibly.\r<br />\r<br />The installer contains individual ESPs for each drink by itself, so if you pick one that is &#39;quest breaking&#39;, you will see a warning in the text of the installer about it.  For those doing a manual install, a &#39;QB&#39; in the plugin name means that it is potentially quest breaking.\r<br />\r<br />Now, before you freak out, there is a workaround.  The quests don&#39;t &#39;break&#39; until the item is in your inventory.  So if you do pick a potentially quest-breaking drink, you can choose from the following options:\r<br />\r<br />[list]\r<br />[*]Don&#39;t use the barrels until after the quest is completed. (Recommended)\r<br />[*]Use the barrels, but don&#39;t have any of the drinks in inventory when the quest is given.\r<br />[*]When the quest is active, don&#39;t go to your house and use the barrels instead of actually doing the quest as it was intended.\r<br />[*]Hold off on installing this mod until after the quest is completed, should you feel that you lack the self-control for the other two options.\r<br />[/list]\r<br />\r<br />After the quest is done, drink away to your heart&#39;s content.  The drinks are, then, no longer &#39;quest items&#39; and getting them from the barrels is no different than console-adding them back in once the quest-giver takes them.\r<br />\r<br />[color=red]Q: I see Dragonborn and Dawnguard drinks in here.  Does that mean that I need all three DLCs to use this mod?[/color] \r<br />A: No.  The only really &#39;required&#39; DLC is Hearthfire.  The installer contains individual ESPs for each drink by itself, so [b]if you pick a Dawnguard or Dragonborn-dependant drink, then yes - that DLC will be required.[/b]  These mods are labeled in both the installer and in the file name (a DG or DB in the file name means that a DLC is required), so if you do not have one or both of those DLCs, then steer clear of those particular drinks.  All of the rest just require Hearthfire.\r<br />\r<br />If this mod causes a CTD after install, check to make sure you didn&#39;t pick one that required Dragonborn or Dawnguard.  Also verify that you have Hearthfire installed.\r<br />\r<br />[color=red]Q: Okay, now what about the Unofficial Patches, my sorting mods, my reweighting mods, etc., etc., etc., ad nauseum?[/color] \r<br />A: This mod does not change the drinks in the slightest.  All it does it tell the Hearthfire barrel to put out five [i](insert drink of choice here)[/i] instead of Nord Mead.  That&#39;s it.  It goes of of the item&#39;s ID, not the name, so any changes done to those drinks will be present in the ones coming out of the barrels.  \r<br />\r<br />Think of the barrels as round, silent, wooden merchants.  \r<br />\r<br />Who don&#39;t charge.\r<br />\r<br />[color=red]Q: Does this mean that this mod is also compatible with Frostfall, Imp&#39;s, and---[/color] \r<br />A: Yes.\r<br />\r<br />[color=red]Q: Okay...So, let&#39;s say that I change my mind later about what drink I want.  Or I decide that I want one less ESP in my load list.  I&#39;m screwed then, right?  Because of baked-in scripts and stuff?[/color] \r<br />A: Not at all.  In fact, this mod can be installed and uninstalled at any time without worry.  It doesn&#39;t [b]ADD[/b] any scripts whatsoever to the game.  \r<br />\r<br />It only changes the name of the barrel and the value of the already-present script.  If you change or uninstall this mod, the name and value either revert back to...ecch...Nord Mead or to whatever other drink mod you picked.  (Pick Honningbrew&#33;  Hehehehe&#33;)\r<br />\r<br />[color=red]Q: Will this effect any other mods at all?[/color] \r<br />A: Yes.  It will obviously clash with any mods that change those same values.\r<br />\r<br />It will also effect (but in a [b]good[/b] way) any player home mods that use Hearthfire resources without changing them, since the barrels all use the same script.  This means that the five hundred barrels you have in the basement of &#34;Dragonslayer&#39;s Five-Spired Fortress Of Lantern-Jawed DOOOOM&#34; will behave in the same way as the two that you have in &#34;Lakeview&#34;.\r<br />\r<br />[color=red]Q: Hmmm...  I already have 254 mods installed, but really want this one.  Can it be merged?[/color] \r<br />A: It contains no scripts, so merge away, my friend.  Just remember that you merged it in case you zap the merged file later and suddenly start getting Nord Mead again.\r<br />\r<br />[color=red]Q: I manually install, but just dumped all of the ESPs into my /Data/ folder and activated them in my load order.  Will I CTD?[/color] \r<br />A: Probably not, but you will only get whatever drink is listed last in your load order.\r<br />\r<br />[color=red]Q: Back to the drinks...  Since you carry [b]ALL[/b] of them, isn&#39;t this mod a bit lore-unfriendly?[/color] \r<br />A: That&#39;s really a role-playing answer there.  Maybe your Dovakiin found some barrels of Redwater Skooma that they toted back to their homes.  Maybe Sadri was so grateful for your saving of Raven Rock that he gave you the recipe for his special blend.  Maybe you happened across Maven Black-Briar&#39;s cookbook while stealing Frost&#39;s papers.  And so on.  If you think that a particular drink breaks lore, then don&#39;t use it.\r<br />\r<br />[color=red]Q: Okay.  Final and 50,000 Septim question.  Why did you make this mod?[/color] \r<br />A: Because of my own personal play-style and role-playing.  My character always carries a &#39;lucky&#39; bottle of Honningbrew mead, five bottles of Juniper Berry mead (that you only find in the burnt-out building in Helgen that you jumped to from the tower), and a &#39;lucky&#39; Sweetroll (stolen, of course).\r<br />\r<br />I didn&#39;t like that Nord Mead was the only option from Hearthfire&#39;s already limited template homes.\r<br />\r<br />[color=red][size=20][b][u]Installing:[/u][/b][/size][/color] \r<br />\r<br />[list]\r<br />[*]Use NMM, FOMM, Mod Organizer, Wyre. or some other mod manager or\r<br />[*]Install manually, copying only the .esp for the drink that you want into your Skyrim /data directory.  If you don&#39;t know where that is, then for the love of Ysmir, [b][u]please[/u][/b] use a mod manager. :D\r<br />[/list]\r<br />[color=red][size=20][b][u]Uninstalling:[/u][/b][/size][/color] \r<br />\r<br />Read the above directions, but pivot around 180 degrees.\r<br />\r<br />[color=red][b]My [u]Fallout: New Vegas[/u] Mods:[/b][/color]\r<br />\r<br />[url=http://www.nexusmods.com/newvegas/mods/53484]Bobblehead Location Books[/url]\r<br />This mod supplements Galahaut and LePropugnator&#39;s amazing [url=http://www.nexusmods.com/newvegas/mods/35110]Bobblehunt[/url] mod by adding notes to help you locate the elusive lil&#39; devils.\r<br />\r<br />[url=http://newvegas.nexusmods.com/mods/53110]Poppy&#39;s Stash[/url]\r<br />A gift from an old sniper.\r<br />\r<br />[url=http://newvegas.nexusmods.com/mods/53299]A Neutered Beagle[/url]\r<br />A fun little mod that pokes a bit of fun at our favorite [i](rolls eyes)[/i] deputy.\r<br />\r<br />[color=red][b]My [u]Skyrim[/u] Mods:[/b][/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/36889]Clear My Name[/url]\r<br />Batch files to clear your name in all holds (and Raven Rock) with one simple command.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/37120]Finger-Wigglers, BEGONE&#33;[/url]\r<br />Batch files to help you bypass the bulk of the College of Winterhold quest line.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/36962]Whisper - Kill Them With Kindness[/url]\r<br />Books that offer in-game hints on the Thane tasks for the different holds.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/51744]Tales Of Trash And Treasure - SPERG Edition[/url]\r<br />A stand-alone part of a renaming mod that I am making.  This particular segment is for the [url=http://www.nexusmods.com/skyrim/mods/24445]SPERG[/url] overhaul system.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/52271]Barrels Of Fun - A Fix For Hearthfire[/url]\r<br />A small mod that changes the drinks distributed from the &#39;mead&#39; barrels in the Hearthfire cellars from &#39;Nord Mead&#39; to any one of 35 different drinks.",
  "categoryId": "85",
  "version": "2.0",
  "author": "ShadowWhisper",
  "createdUnix": "1395349628",
  "updatedUnix": "1395552737",
  "containsAdultContent": false,
  "uploadedBy": "chaophim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101842",
      "name": "Honningbrew Mead Barrels",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Honningbrew Mead Barrels-52271-1-0.zip",
      "uploadedUnix": "1395349468",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b8c295ca1c0a508e134f62d727a39200d353861ff3472ae0748744da94a22f4e/analysis/1407989284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Honningbrew%20Mead%20Barrels-52271-1-0.zip?fid=1000101842&ttl=1535835149&ri=8192&rs=8192&setec=5400c383d644010612c4c77a0ba0b30e"
    },
    {
      "fileId": "1000101901",
      "name": "Juniper Berry Mead Barrels",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Juniper Berry Mead Barrels-52271-1-0.zip",
      "uploadedUnix": "1395403262",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f585d760ae1c7b6573e3a376cc870ae48fd58d5e0449065f1d69feee5e0904a/analysis/1407989864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Juniper%20Berry%20Mead%20Barrels-52271-1-0.zip?fid=1000101901&ttl=1535835149&ri=8192&rs=8192&setec=0c76167a2b4038653e3129043b859d52"
    },
    {
      "fileId": "1000102121",
      "name": "Barrels Of Fun - A Fix For Hearthfire",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Barrels Of Fun - A Fix For Hearthfire-52271-2-0.zip",
      "uploadedUnix": "1395552737",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a99a31687f23bd88053e06b2cc14ff6dc0730399315a13bef7fd32ff054d66be/analysis/1407991986/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Barrels%20Of%20Fun%20-%20A%20Fix%20For%20Hearthfire-52271-2-0.zip?fid=1000102121&ttl=1535835150&ri=8192&rs=8192&setec=6bd80bfce1bf01116589d71923e341b6"
    }
  ]
}