{
  "modId": 52299.0,
  "modName": "Tel Ascadia",
  "summary": "A Solstheim Playerhome on a small Island - a combination of a Hobbit home and Telvanni tower.",
  "descriptionHtml": "[font=Comic Sans MS][color=#00ff00][size=5]I am happy to present you with Tel Ascadia a player home on Solstheim.\r<br />\r<br />[/size][/color][/font]                                                                                  [img]http://i.imgur.com/VFlvwAI.png[/img]\r<br />\r<br />[font=Comic Sans MS][size=3][color=#ff7700]Description: \r<br />This mod offers a player home on a small Island west of Ravenrock that is in part based on my &#34;Island Hobbit Home&#34; but is not identical to it.\r<br />This home is build into a hill on the small Island, but it is also connected to a giant mushroom that looms over the Island. In essence the player gets a combination of a cozy wood paneled downstairs and a functional mushroom interior fit for a wizard. The design idea is loosely based on Tel Fyr in Morrowind, the name Tel Ascadia is in memory of my favorite area in Morrowind.\r<br />[/color]\r<br />[color=#ff0000]IMPORTANT&#33; [/color][color=#00ff00]This house comes with a teleport feature back to Skyrim&#33; It is imperative that you have visited Solstheim prior via the main quest with the cutscene at the harbor for this teleport to work&#33;\r<br />I believe that at this time this feature is not found in any other house mod.\r<br />\r<br />I will not disclose the location of the teleport portal in Skyrim, (to keep the surprise for first time useers) but should you find it by chance DO NOT activate it&#33;\r<br />Doing so before you have been to Solstheim the default way by ship will CTD your game. After your initial default trip by ship use the teleport for the first time from Solstheim to Skyrim; after that you are golden and can enjoy this unique perk for a direct return to your home on Solstheim anytime. I think you will find the receiving portal in a useful central location :)[/color]\r<br />\r<br />[color=#ff7700]Inside the home:\r<br />Downstairs consists of an entry lobby with library and large fireplace; a large kitchen and pantry with custom storage for key ingredients, all re-spawning; a master bedroom with plenty of storage and fireplace; a large bathroom with tub, sauna, and beds for followers; (I chose not to use undress scripts this time for tub and sauna). There is a cozy small study with fireplace, a writing desk, book case and many maps on display. \r<br />There is storage, weapon racks, bookshelves, mannequins, and various shrines spread throughout the downstairs and upstairs in the mushroom dome.\r<br />\r<br />The Mushroom interior is one large vaulted space and in it are all possible crafting stations for the smithing craft, and the Arcane crafts of enchanting and Alchemy; there is also another cooking pot at a fire place with food storage.\r<br />There is a cozy den where the player or followers can rest with storage and more bookshelves.\r<br />\r<br />The Parasol mushroom is connected to the downstairs via a long shaft that has levitation function to connect the two areas, and a spiral staircase climbs a short way up to a back door into the garden.\r<br />Read the journal on the desk near the enchanter, it will explain allot about the home and some of its unique features, like in-house teleportation.\r<br />You will also learn about a unique and difficult to obtain treasure by reading the journal.\r<br />[/color]\r<br />[color=#00ff00]Outside the Island: \r<br />There is a path that winds around the hill past a small waterfall and across bridges to a terraced garden.\r<br />There you will find the teleport portal to Skyrim, a fire pit, benches in various locations and some apiaries.\r<br />The garden is full of a variety of flowers and a small mushroom patch. Along a beach there is a small vegetable garden.\r<br />\r<br />The boat by the dock is just decoration; you will have to swim the first time to reach the Island, but it is a very short distance off shore and on a desk you will find a very useful ring to keep your feet dry in future :)\r<br />[/color]\r<br />[color=#ff7700]Stats:\r<br />The house has a total of 75 standing weapon racks, 16 mounted weapon racks, 10 single and 6 for shields and dual weapons.\r<br />There are 18 mannequins, 2 downstairs the rest upstairs. \r<br />There is a total of 6 tall bookshelves and 8 short bookshelves throughout the house.\r<br />\r<br />Safe storage: \r<br />The urns labeled as &#34;Foods&#34;,&#34;Ingredients&#34;,&#34;Soul Gems&#34; do not respawn. All urns labeled for specific items do respawn.\r<br />All chests, dressers, and barrels are safe for storage.\r<br />[/color]\r<br />[color=#ffff00]Special thanks goes to my friend and fellow modder RefurbMadness for her support and feedback, the beta testing and for creating the wonderful indigo window glass for the downstairs windows. \r<br />The new mesh and texture is not free for distribution at this time, so please respect that and do not upload them or any part of this mod&#33;\r<br />\r<br />Installation:\r<br />Best use NMM to download and install the file. For manual install place all files and folders in your Skyrim Data folder, make sure the meshes and texture folders get copied into their counterparts within the Data folder, check Tel Ascadia in your load order and play.\r<br />\r<br />Recommended mods:\r<br />I highly recommend and endorse &#34;Jaxonz Positioner&#34; to place any items in the home and fix havoc based items in place without loosing their functionality. (Especially useful in the kitchen) \r<br />Find it here:  [url=http://www.nexusmods.com/skyrim/mods/52583/?]http://www.nexusmods.com/skyrim/mods/52583/?[/url]\r<br />\r<br />Credit and permissions:\r<br />Thanks to ElDiabs for his great activator resource for all the weapon racks and bookshelves.\r<br />Thanks to Bethesda for a great game world.\r<br />\r<br />You may use this mod within your game as you like. \r<br />Feel free to translate this mod to another language as long as authorship is stated clearly. A link and notification would be appreciated.\r<br />Please do not upload your own version of this mod ANYWHERE&#33;\r<br />\r<br />This mod was cleaned with TES5Edit and has been tested, but I am not responsible for how well or bad it works on your machine or your particular load order.\r<br />Always make a back up of your save before testing a new mod&#33;\r<br />\r<br />[/color][/size][/font][color=#ffff00][size=5]Changelog: 1.4\r<br />[/size][/color][color=#ffff00]By request added a bathroom to the mushroom interior upstairs. At present this is not navmeshed but I will add that soon. Still not possible to bring your folowers upstairs without a third party follower managing mod. Some people actually like it that way...[/color]",
  "categoryId": "67",
  "version": "1.4",
  "author": "Kursan",
  "createdUnix": "1395455832",
  "updatedUnix": "1430863712",
  "containsAdultContent": false,
  "uploadedBy": "Kursan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101982",
      "name": "Tel Ascadia",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1076",
      "fileName": "Tel Ascadia-52299-1-4.zip",
      "uploadedUnix": "1395454898",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a61bccbaeae25eb2e7146717a8ed8303072eb58d2e6a6b37bd46ee9768aa33db/analysis/1407990560/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tel%20Ascadia-52299-1-4.zip?fid=1000101982&ttl=1535835201&ri=8192&rs=8192&setec=5684809937c8c7ad5343b0021d5b6aa4"
    },
    {
      "fileId": "1000158936",
      "name": "Tel Ascadia",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1111",
      "fileName": "Tel Ascadia-52299-1-4.zip",
      "uploadedUnix": "1430863712",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a741bc3df20cb4a54d601d7cf9a1af6671d5ec63dd56690fe303fb2585a9bb02/analysis/1430863743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tel%20Ascadia-52299-1-4.zip?fid=1000158936&ttl=1535835201&ri=8192&rs=8192&setec=4f1eb0b93782f7fe25bb11b3b486605a"
    }
  ]
}