{
  "modId": 52293.0,
  "modName": "Boxing Arniel Shade",
  "summary": "Now uses deadly unarmed attacks.",
  "descriptionHtml": "Because why shoot lightning when you can punch a dragon in the face?\r<br />\r<br />This mod changes Arniel&#39;s Shade so he uses unarmed attacks instead of magic. Because hey, that&#39;s what he used in life, right?\r<br />\r<br />I gave him a ridiculously large unarmed bonus so he does 50 damage with each punch. The living Arniel Gane also gets the bonus so he&#39;ll actually hurt those Magic Anomaly thingies during the College of Winterhold questline. I also changed the appearance of his shade so it actually looks like the real Arniel Gane.\r<br />\r<br />I also made it so you can craft a Staff of Summon Arniel&#39;s Shade at the Staff Enchanter with an unenchanted Conjuration Staff and Keening (mostly so only one can be made). This allows you to summon two shades (with the Twin Souls perk), or you can give the staff to a follower so they can summon him in combat. If you want to get Keening back you can actually use the staff along with a Dwarven Metal Ingot to craft a new one at a forge if you have the Dwarven Smithing perk.\r<br />\r<br />Requires Dragonborn DLC. May interfere with the Unofficial Skyrim Patch (since apparently it makes changes to Arniel as well) so mind your load order I guess.\r<br />\r<br />Please feel free to add images of Arniel suplexing a Dremora Lord or beating the tar out of a giant if you wish. Feedback is welcome, if something&#39;s wrong don&#39;t hesitate to let me know (this mod was mostly practice for using the CK after all).",
  "categoryId": "96",
  "version": "",
  "author": "KriegsSundayFinest",
  "createdUnix": "1395427417",
  "updatedUnix": "1395427222",
  "containsAdultContent": false,
  "uploadedBy": "KriegsSundayFinest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000101936",
      "name": "boxingarnielshade",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "boxingarnielshade-52293-.zip",
      "uploadedUnix": "1395427222",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/23df29c92a80c19c30fd54cf8eec375b20c358ad405b585ff653d7c3e195927a/analysis/1407990185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/boxingarnielshade-52293-.zip?fid=1000101936&ttl=1535835185&ri=8192&rs=8192&setec=dc221128629b4735c5c4c58e20d10e43"
    }
  ]
}