{
  "modId": 52319.0,
  "modName": "Sexy Deadly Girls Remastered",
  "summary": "",
  "descriptionHtml": "Hello guys, it is SammyEversong here again with a simple mod. This started out as just my own personal private use mod, but I grew to like it a lot more than I thought so I am here to share it with you.\r<br />\r<br />This mod is a simple mod that adds 5 cute and sexy female followers for your aid. They can be found in Whiterun Bannered Mare, so it is easy to locate. Here are the attributes and parameters of each follower; also they are Sexlab compatible and Marriable, if you so choose to marry them.\r<br />(all of them start at level 6, and will continue leveling up with you until 9999.)\r<br />Aoi:\r<br />Race: Breton Class:NInja Combat Style: Ninja\r<br />\r<br />Aoi has her unique class of ninja, she will mostly perform ranged attacks with her bow, but give her a nice dagger and she may stealth kill for you. \r<br />Ninja class gives a hefty boost upon One-Hand, Archery, Light Armor, and Stealth.\r<br />Ninja cs provides a slight preference towards bow, but that can be changed with a stronger dagger.\r<br />\r<br />Basic Equipment:\r<br />Dark Brotherhood armorset no hood\r<br />Elven Bow\r<br />Skyforge Steel Dagger\r<br />300 Steel Arrows.\r<br />\r<br />Brielle:\r<br />Race: Redguard Class:Knight Combat Style:Knight\r<br />Brielle has a unique class and combat style of Knight. She will go up close and personal with her enemies and sweep them with her two-handed weapons, she will act as a guard for you so you will not take as much hits.\r<br />Knight class gives a hefty boost for two-handed and heavy armor, as well as become a Health hog.\r<br />\r<br />Basic Equipment:\r<br />Companion&#39;s Armor no helmet\r<br />Skyforge Steel Greatsword\r<br />\r<br />Camilla:\r<br />Race: Nord Class:Spellblade Combat Style:Spelllade\r<br />Camilla has a unique class and combat style of Spellblade. Se will weild a one-handed weapon in her right hand and unleash spells in her left hand. She will stay at a small distance from you attacking enemies that come close, she will hack-and-slash and burn-crackle-and freeze at midrange to longrange\r<br />Spellblade unique class gives boosts to heavy armor, One-handed , and Destruction and Conjuration.\r<br />\r<br />Basic Equipment:\r<br />Steel Plated Armor no helmet\r<br />Skyforge Steel sword\r<br />\r<br />Duvain:\r<br />Race: Dark Elf Class:Dancer Combat Style:Dancer\r<br />Duvain has the unique class and combat style of Dancer. She will weild two weapons and dual attack enemies. She also may venture and slaughter foes at a distance by pouncing on them with her swift moves. Her unique class gives boosts to one-handed, and light armor, as well as maintaing a good stamina.\r<br />\r<br />Basic Equipment:\r<br />Elven armor no helmet\r<br />2 Skyforge steel swords\r<br />\r<br />Elena: \r<br />Race:Imperial Loli Class:Wizard Combat Style:Wizard\r<br />Elena has her own unique...well everything. Her race has the same attributes as an Imperial, with the attack data of an Imperial child and twice the regen speed of an Imperial.\r<br />being a wizard, she will only use magic attacks and will do so at long range, and even mid range. She excels in destruction and altercation, and can use illusion and conjuration as well. As an added bonus, she may heal you as she is donned with high restoration abilities and spells.\r<br />Her class gives boosts to all magic schools as well as a hefty boost for magicka.\r<br />\r<br />Basic Equipment:\r<br />Child Clothes 1\r<br />Hunter&#39;s Bow\r<br />100 Iron Arrows\r<br />\r<br />\r<br />I hope you enjoy these characters, as much as I made them. I try to go for a more natural look, so they do not look all &#34;glam-up&#34; for a more lore-friendly-ish feel, though they have unique hair colors, so I do not know how I would classify that.\r<br />\r<br />Thanks to these mods:\r<br />Envision face- larger lips UNP\r<br />Better females by Bella\r<br />Coverwoman look_1\r<br />\r<br />Sevenbase Body Replacer\r<br />Sexy Vanilla Armor Replacer\r<br />Children of the Sky Reworked 2\r<br />\r<br />Also read the ReadMEs when you download the file, they should be located in your Skyrim Data folder. Also, this mod does not replace the female bodies, so you can use your own female body replacer. However, the optional mod, to make Elena appear normal, do replace the bodies and look of all NPC children, just a heads up. And remember, If you are using Elena, download the optional file first, just to prevent any kinds of weird mismatch textures or looks, just in case.\r<br />\r<br />\r<br />\r<br />Upcoming Stuff&#33;\r<br />Hello guys, I just uploaded the optional patch file for the optional file, sounds weird when you say it out load, but any who...this file will prevent future mismatching of textures and meshes for Redguard NPCs. as some of you may have noticed and disliked, the xvisionc.esp caused some funky issues with some NPCs, this wasn&#39;t my mod and users have notified m of mismatching. I realized, it must be because of this...cause I seen it too.\r<br /> But I am getting this file uploaded so I can showcase you my new and remastered version of Sexy Deadly Girls&#33; This time they are truly sexy and even deadlier than before&#33; I spent great quality time making custom meshes and textures for their faces and improved &#34;party&#34; combat. By assigning relationships to each Sexy Deadly Girl (aka SDG), they will try to synchronize their moves and help each other out if you so choose to &#34;hire&#34; any combination of them. Their basic AI attributes are the same, as why fix something if it ain&#39;t broken,right? However I did fine-tuned their classes and combat styles making them more efficient. I also dug through the vast interweb and found some awesome armor for them (I would be uploading them sooner, but I am waiting for permissions for one of them at the moment). Now, they are completely unique and completely standalone (by that they use their own meshes and textures and therefore will not interfere or overwrite pre-existing data. I hope you guys are as excited as I am..I cannot wait to upload them and so you. I  will be uploading more pix soon and making this description page look prettier.\r<br />One last thing, if I get more than 20...no 10 endorsements,  am going to add another Sexy Deadly Girl that will be available via an optional download and obtained through a quest. Why so special?\r<br />Well...her name is Fenfen an she is a wolf-gal, she is physically the strongest one of these girls and only uses unarmed combat :). Interested, she is indeed a Thief class&#33;\r<br />\r<br />Remastered  Version Is Here:\r<br />\r<br />Hello guys, here is the long awaited Remastered Version&#33; I made some significant changes. First of all I have made this .esp completely standalone. You do not need to download Children of the Sky for Elena to appear normal anymore (though you may still download it if you like using it). \r<br />Changelog:\r<br />2.00- Remastered the looks for all the girls. Now they are prettier than before with a unique look \r<br />       to all of them.\r<br />      -Each follower comes with a custom vanilla race with starting attributes more acquired to their    \r<br />       combat style. Total bonus is 35, same as vanilla.\r<br />      - Theoretically each one of them can be turned into a vampire, if you so choose, I included   \r<br />       the keywords ActorTypeUndead, and Vampire, in addition to ActorType NPC. I, however have\r<br />       not tested it out and cannot guarantee it may bug a bit. I advise to test at your own risk, but \r<br />       it shouldn&#39;t cause CTDs. You may want to download Race Compatibilities found here:\r<br />              http://www.nexusmods.com/skyrim/mods/24168/?\r<br />        A somewhat common issue with this is that upon turning into a vampire, the NPC (or \r<br />      character, if you ever played as a custom race.) is that the actor may turn purple.\r<br />      To fix, simply cast a spell on them, such as an illusion or restoration spell. Most of these\r<br />      followers already have some vampiric abilities, and will not experience visual changes if you\r<br />      turn them into a vampire, basically the only reason is if you want them to be a Vampire Lord.\r<br />    -I slightly improved and balanced out their classes and combat styles\r<br />    - Now, all of the followers have a friend relationship with each other. This should enhance their \r<br />     &#34;party&#34; combat together if you use any combination of them.   \r<br />    -Finally, each one of them contain an unique outfit with enchantment.\r<br />   \r<br /> Elena: Zoe Clothes: armor type: Clothes\r<br />                      Total armor rating: 60\r<br />                             Total Weight:13\r<br />                    Enchantment Effect: Fortify Magicka: 100 ps\r<br />                                               Fortify Alteration: 20%\r<br />                                             Fortify Destruction: 15%\r<br />                  Fortify Conjuration,Restoration,Illusion: 10%\r<br />   \r<br /> Aoi: Hentai Void Armor UNPB: armor type: Light\r<br />                            Total Base Armor Rating:72\r<br />                                            Total Weight: 9\r<br />                          Enchantment Effects: Fortifty Sneak: 40%\r<br />                                       Fortify Stamina and Health: 50 pts   \r<br />                                 Fortify One-Hand and Archery: 15%\r<br />   \r<br />Camilla: Imperial Investigator Cuirass: armor type: Heavy\r<br />                                     Total Base Armor Rating: 91 pts\r<br />                                                     Total Weight: 56\r<br />                                          Enchantment Effects: Fortify Destruction and Conjuration: 10%\r<br />                                                                                    Fortify Stamina and Magicka: 50 pts\r<br />                                                                                               Fortify One-Handed: 15%\r<br />    \r<br />Duvain: Raven Witch Armor: armor type: Light\r<br />                         Total Base Armor Rating: 110\r<br />                                         Total Weight: 44\r<br />                              Enchantment Effects: Fortifty Stamina: 100 pts\r<br />                                                            Fortify One-Handed: 25%\r<br />  \r<br /> Brielle: Lich King Armor 7base: armor type: Heavy\r<br />                            Total Base Armor Rating: 144\r<br />                                            Total weight: 82\r<br />                                 Enchantment Effects: Fortify Health: 100 pts\r<br />                                                        Fortify Two-Handed: 25%\r<br />\r<br />Note: All of these enchantments also increase their corresponding armor type rating by 20%.\r<br />       Also none of these armor are craftable and most of them do not include the full set. If you\r<br />       want the full set and craftable, you will have to download the original mod author&#39;s armor \r<br />       mod.\r<br />       In addition, their armor enchantment is only equipped onto the main armor piece and is \r<br />       disenchantable, though you lose the armor forever. Only do this, if you plan to give them a\r<br />      new set or armor. \r<br />\r<br />Finally Let&#39;s give kudos to these mods and their authors:\r<br />         Chargen Extension ECE by expired6778.\r<br />         Apachii SkyHair by apachii\r<br />         Sevenbase Body by Sevenity and Crosscrusade\r<br />         Envison face UNP by dd2501\r<br />         Better Females by Bella\r<br />        Coverwoman by Mr. Lensky\r<br />\r<br />Extreme Special Thanks for these mods and their authors:\r<br />        Hentai Void Armor by Hentai, UNPB conversion by HaloFarm\r<br />        Arthas Lich King Amor by jojjo, Sevenbase conversions by AsianBoy\r<br />       Imperial Investigator by calyps, retextures by Dreamburrow\r<br />       Raven Witch Armor by Zerofrost and Satyr\r<br />       Zoe Clothes by Y11\r<br />\r<br />I hope you guys enjoy this mod and have fun slaying people. If you like, please endorse or send pix, and I may decide to create Fenfen, the martial artists/puglist. Also, I moved the girls to Dragonsreach, much more room than the Bannered Mare each Remastered girl will appear as a seperate, and optional, upload in the near future.\r<br />\r<br />\r<br />       \r<br />Also, for people who may need some help installing, just read the ReadME, I tried to be as thorough \r<br />and complete as possible. I also included the ReadME for how to install the updated .esp for No Sexlab. Therefore, now everyone can enjoy it and not deal with my &#34;perviness&#34; anymore :D\r<br />\r<br />Wow....haven&#39;t been on in a few months and I noticed I received hella endorsements&#33; Thanks guys....I guess I gotta keep my promise and make a Neko Girl :D\r<br />        \r<br /> \r<br />                                                         \r<br />       \r<br />",
  "categoryId": "96",
  "version": "2.00",
  "author": "SammyEversong",
  "createdUnix": "1395503092",
  "updatedUnix": "1396271829",
  "containsAdultContent": true,
  "uploadedBy": "SammyEversong",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102041",
      "name": "Sexy Deadly Girls",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20706",
      "fileName": "Sexy Deadly Girls-52319-1-00.zip",
      "uploadedUnix": "1395498233",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/8f7b7ca10563b2449a382205eed8f1285b17361a941d9caed695d34c51019979/analysis/1407991127/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Deadly%20Girls-52319-1-00.zip?fid=1000102041&ttl=1535835241&ri=8192&rs=8192&setec=fefaaaa2c7c6c59f43e98402c6d33baa"
    },
    {
      "fileId": "1000102046",
      "name": "Children of the Sky Reworked 2",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "303890",
      "fileName": "Children of the Sky Reworked 2-52319-.zip",
      "uploadedUnix": "1395502989",
      "modVersion": null,
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Children%20of%20the%20Sky%20Reworked%202-52319-.zip?fid=1000102046&ttl=1535835241&ri=8192&rs=8192&setec=bc4311c1a72fd0bc0ff6d27fb6025be4"
    },
    {
      "fileId": "1000102310",
      "name": "Sexy Deadly Girls bsa version",
      "version": "1.00b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "117625",
      "fileName": "Sexy Deadly Girls bsa version-52319-1-00b.zip",
      "uploadedUnix": "1395663105",
      "modVersion": "1.00b",
      "virusScanUrl": "https://www.virustotal.com/file/febbfee8d6a185f32ca721c472567ef22347fd5d85f125137f40918d5acf28ca/analysis/1407994000/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Deadly%20Girls%20bsa%20version-52319-1-00b.zip?fid=1000102310&ttl=1535835242&ri=8192&rs=8192&setec=5b25071dc28188f256bf6fcd7909b67f"
    },
    {
      "fileId": "1000102804",
      "name": "Patch for Children of the Sky Reworked 2",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2369",
      "fileName": "Patch for Children of the Sky Reworked 2-52319-.zip",
      "uploadedUnix": "1396061526",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/217afe85c537eadee833819a3e2085bd96e2f05232b43fed61ee6896ed04f485/analysis/1407998776/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20Children%20of%20the%20Sky%20Reworked%202-52319-.zip?fid=1000102804&ttl=1535835242&ri=8192&rs=8192&setec=b8baeca9dfa614a95086c8b1292d2544"
    },
    {
      "fileId": "1000103065",
      "name": "Sexy Deadly Girls Remastered",
      "version": "2.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "307095",
      "fileName": "Sexy Deadly Girls Remastered-52319-2-00.zip",
      "uploadedUnix": "1396213662",
      "modVersion": "2.00",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Deadly%20Girls%20Remastered-52319-2-00.zip?fid=1000103065&ttl=1535835243&ri=8192&rs=8192&setec=14e6b1a4918b72cc93a8784e717cc89a"
    },
    {
      "fileId": "1000103167",
      "name": "Sexy Deadly Girls Remastered MUST HAVE Update File",
      "version": "2.00",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "62",
      "fileName": "Sexy Deadly Girls Remastered esp No Sexlab Requirement-52319-2-00.zip",
      "uploadedUnix": "1396271829",
      "modVersion": "2.00",
      "virusScanUrl": "https://www.virustotal.com/file/a381841fe6796fb23870d74cc271a4d86b6459748243c10616f2aa43f20c2713/analysis/1408002128/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Deadly%20Girls%20Remastered%20esp%20No%20Sexlab%20Requirement-52319-2-00.zip?fid=1000103167&ttl=1535835244&ri=8192&rs=8192&setec=d75d9db53ad5bd3daeda7b76d94f0645"
    }
  ]
}