{
  "modId": 52340.0,
  "modName": "Glorious Fort Dawnguard",
  "summary": "This mod serves as both a standalone mod and a multi-step guide which re-imagines Fort Dawnguard to give it a more fortified and &#34;glorious&#34; look.  The mod itself adds additional patrols, 3 new unique followers, a stable, a sparring platform, new guard posts, new banner textures, a new torture area for vampires, a supply depot, an archery ra",
  "descriptionHtml": "[center][color=yellow] [b] GLORIOUS FORT DAWNGUARD [/b] [/color][/center]\r<br />\r<br />SSE PORT BY HOLYCOWMUNCHER -[url=http://www.nexusmods.com/skyrimspecialedition/mods/9317/?] CLICK HERE[/url]\r<br />\r<br />Ever wonder why Fort Dawnguard is so damned depressing?  You arrive and the place is empty and uninspiring.  Dark, old, worn down, tattered banners, and only a wet-behind-the-ears farmboy with &#34;pa&#39;s axe&#34; to greet you when you arrive&#33;\r<br />\r<br />Well this mod and the accompanying guide changes that&#33;\r<br />\r<br />Section 1 - My mod\r<br />Section 2 - Guide to other mods used (or suggested)\r<br />Section 3 - Compatibility and known issues\r<br />Section 4 - Acknowledgements and thanks\r<br />\r<br />\r<br />=================================================================\r<br />\r<br />\r<br />[u] 1 - FORT(IFIED) DAWNGUARD (AKA GLORIOUS DAWNGUARD) [/u]\r<br />\r<br />Cutting to the chase, this mod adds the following:\r<br />\r<br />[i]TL;DR: Adds fortifications and NPCs, on the outside of the fort especially, to give a more glorious and well-protected look to Fort Dawnguard.[/i]\r<br />\r<br />- Additional guard posts outside of the main fort, in the world space leading from Dayspring Canyon, across the path therein, up to the fort itself.\r<br />- A sparring area where NPCs duke it out to hone their skills.  \r<br />- Additional structures outside of the fort\r<br />- Improved banner textures to replace the pathetic, ragged, hole-ridden Vanilla textures (Big thanks to HXP for providing these&#33;)\r<br />- Additional banners with increased size placed on the ramparts of the main fort and throughout the environs which say &#39;BOOYA WE&#39;RE THE DAWNGUARD&#33;&#34; to anyone within 20 miles&#33;\r<br />- About a dozen generic NPCs who patrol the outside and inside of the fort\r<br />- 2 new trainers - One-handed weapons and archery\r<br />- Additional eye candy scattered here and there\r<br />- A torture area in the cave inside the fort\r<br />- 3 unique named follower NPCs, with different specializations and each with their own Shout\r<br />- a stable with 2 horses that members of the Dawnguard can use\r<br />- a stock room full of Dawnguard weapons and armour, which can be accessed if you make friends with the right people in the Dawnguard\r<br />- additional exterior lighting for the pathways leading to the fort\r<br />- A few additional easter eggs which might be stumbled upon as you explore the fort, including some new books based on a very old and well-known story from western culture.\r<br />\r<br />\r<br />=================================================================\r<br />\r<br />\r<br />[u] [b] 2 - RECOMMENDED MODS [/b] [/u]\r<br />\r<br />Most of these mods can be seen in the screenshots and video I&#39;ve provided on the mod page.  I&#39;d recommend you&#39;d check them out one by one and decide which ones are to your liking... You can tell that a lot of work went into them&#33;\r<br />\r<br />[b] Unofficial Dawnguard Patch: [/b] http://www.nexusmods.com/skyrim/mods/23491/?\r<br />\r<br />This is your starting point.  If you&#39;re going to download one mod for Dawnguard, download this.\r<br />\r<br />[b] Dawnguard Fortress Improved High Resolution 2k by HXP: [/b] http://www.nexusmods.com/skyrim/mods/32809/?\r<br />\r<br />This is the retexture mod used in my mod as well as all screenshots shown.  Fantastic work with many different options.  Choose the best look for your own taste&#33;\r<br />\r<br />[b] Dawnguard Parallax by HXP [/b] http://www.nexusmods.com/skyrim/mods/45477/? \r<br />\r<br />Parallax is a retexture method which adds fake depth and &#34;fake 3d&#34; to roads, walls, buildings etc.  Although I personally do not use it in this particular mod - I much prefer the original &#34;smooth&#34; look - This is definitely some great work, and recommended if you prefer the &#34;rough&#34; and layered look of most of Skyrim&#39;s forts.\r<br />\r<br />[b] Castle Volkihar HD Retexture by HXP: [/b] http://www.nexusmods.com/skyrim/mods/42728/?\r<br />\r<br />Another great retexture from HXP, a must&#33;\r<br />\r<br />[b]EotW Dawnguard DLC Textures Remastered by EcthelionOtW and misslexi: [/b] http://www.nexusmods.com/skyrim/mods/51947/?\r<br />\r<br />A massive texture overhaul to all of Dawnguard&#39;s weapons, armour, clothing, etc.  Masterfully done, a *must* for your Dawnguard playthrough.\r<br />\r<br />[b] ]Holmwood - house for a vampire hunter by Elianora - powerchimp1 [/b] - http://www.nexusmods.com/skyrim/mods/51791/?\r<br />\r<br />You might have already noticed this in a couple of the screenshots I posted.  This mod is fully compatible with my own and blends in nicely, as I took care to build around this fantastic and lore-friendly player home.  Highly recommended&#33;\r<br />\r<br />[b] Fort Dawnguard by Omega549 [/b] http://www.nexusmods.com/skyrim/mods/22776/?  \r<br />\r<br />Adds some additional fortifications to the immediate exterior of the fort, adds a new entrance (&#33;) to the fort itself northeast of Riften (the entrance itself is actually quite fortified as well), expands the interior of the fort, and adds some NPC guards.  Although visually appealing, users have reported issues with the Dawnguard quest, and must be disabled at certain points.  Also seems to have a couple navmesh issues/conflict when I tried it with my mod, and npcs have the &#34;grey face&#34; bug since there doesn&#39;t seem to be a .bsa archive included.  But I still recommend it for additional immersion, and it is fully compatible with my mod.\r<br />\r<br />[b]Light Up Dawnguard by thecookieninja[/b] - http://www.nexusmods.com/skyrim/mods/21880/?\r<br />\r<br />As its name suggests, provides additional lighting to the interior of the fort.  Will help ENB users with the extremely dark interior.\r<br />\r<br />[b]Improved Dawnguard Vampire Eyes - glowing and non-glowing by ViewtifulFlo [/b] - http://www.nexusmods.com/skyrim/mods/34060/?\r<br />\r<br />The title says it all.  Very nice work, with different options to choose from.\r<br />\r<br />[b] XCE - Dawnguard by Xenius - [/b] http://www.nexusmods.com/skyrim/mods/21839/?\r<br />\r<br />Improves the textures of vampires.  Much greater detail to faces.\r<br />\r<br />[b] Better Vampires by Brehanin: [/b]  http://www.nexusmods.com/skyrim/mods/9717/?\r<br />\r<br />This is a highly customizable Vampire overhaul with an MCM menu which is insanely popular here on the Nexus.  Not necessarily related to Fort Dawnguard or even the Dawnguard faction, but of course I highly recommend it for greater challenge and immersion&#33;\r<br />\r<br />\r<br />=================================================================\r<br />\r<br />\r<br />[u] [b]3. COMPATIBILITY AND KNOWN ISSUES [/b] [/u]\r<br />\r<br />1 - Anyone who has modded knows that Navmesh is a giant pain, and often buggy.  Generally speaking, my mod works; your follower will go from point &#34;a&#34; to point &#34;b&#34;.  However there are a couple places that are a bit glitchy, however they are generally obscure places most people wouldn&#39;t really go often anyways.  It won&#39;t break your game, but it may bend your immersion a bit.\r<br />\r<br />2- Sparring guards are bleeding all over the place.  Yeah I know... I couldn&#39;t figure out how to turn off combat blood for NPCs.  But hey, they are true Nords, they can take a little bleeding right?\r<br />\r<br />3 - In-game books: &#34;What the... I&#39;ve read this book before&#33; You&#39;re plagarizing&#33;&#34;  Yes and no... I adapted a well-known short story that is over 100 years old for Skyrim&#39;s Dawnguard.  I don&#39;t claim any ownership over that content, and basically there are no real &#34;rights&#34; to something this old.\r<br />\r<br />4 - If you are using Lanterns of Skyrim Dawnguard patch (http://www.nexusmods.com/skyrim/mods/26662/?) by Selyb, you should probably disable it.  Otherwise you will have too many lanterns all over the place outside.  I haven&#39;t tested myself but you don&#39;t need this anymore.\r<br />\r<br />5 - Be careful if you are using other mods to Fort Dawnguard.  As I mentioned, both Holmwood by Elianora and Fort Dawnguard by Omega549 are fully compatible, though the latter has a couple issues.\r<br />\r<br />\r<br />=================================================================\r<br />\r<br />\r<br />[b] [u] 4 - ACKNOWLEDGEMENTS AND THANKS [/u][/b]\r<br />\r<br />Of course everyone at the Nexus for this great site, Bethesda for freely sharing their various creation kits for their games thus letting even scrubs like me mod the crap out of them, and all the wonderful modders on this site who take hours, days, weeks, months or even YEARS to make so many amazing mods&#33;  Based on my own limited experience I can testify to the fact that this stuff is a LOT of hard work.\r<br />\r<br />Specifically I want to thank  HXP for making the Dawnguard Banner textures.  With the increased size the Vanilla banners looked REALLY awful, so I wouldn&#39;t have been able to use them at all without his work.  Also his work on Dawnguard retexturing is just great. Thanks&#33;",
  "categoryId": "25",
  "version": "0.1",
  "author": "Dahveed",
  "createdUnix": "1395573802",
  "updatedUnix": "1395573721",
  "containsAdultContent": false,
  "uploadedBy": "Dahveed",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102144",
      "name": "Fortified Dawngaurd - aka Glorious Dawnguard",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3292",
      "fileName": "Fortified Dawngaurd - aka Glorious Dawnguard-52340-0-1.rar",
      "uploadedUnix": "1395573721",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/e774db5617bc98a86000b05d6e226996ce6dc44f1ef0ff0206edc10a06681826/analysis/1407992229/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fortified%20Dawngaurd%20-%20aka%20Glorious%20Dawnguard-52340-0-1.rar?fid=1000102144&ttl=1535835277&ri=8192&rs=8192&setec=97e8b6df9de1a89eb4fbd6b74736666e"
    }
  ]
}