{
  "modId": 52365.0,
  "modName": "The Elder Scrolls V Daedra Unoffical DLC Preview",
  "summary": "Adds new Daedric Quests to Skyrim. ",
  "descriptionHtml": "This is the official preview of my Unofficial DLC &#34;Elder Scrolls V: Daedra&#34; comes with a wide variety of new quests, power weapons and armor, and even a set of advanced god armor and weapons, the main questline will split into two sides in which the Dragonborn can side with either the Daedra or with the Death Lords, each will provide the Dragonborn with a set of armor and a weapon of godly strength, but be warned, these come at a very difficult cost, as in most cases, these weapons will be used against the Dragonborn against a very high level opponent (The lowest that can be found is level 20, highest being 100) I will commend anyone who can in the final release, play through this entire mod on Legendary with no cheats, console commands, other mods to help, etc. In this preview you can complete one of the side quests &#34;The Daedric Knight&#34; the quest can be taken up by talking to a man named &#34;Jack The Wise&#34; in Whiterun, look for him near Skyforge. He will tell you of a man in Daedric armor who&#39;s been terrorizing all of Skyrim, he can be found in a Nordic ruin near Dragon Bridge (That&#39;s for you to find out) Defeating him will give the Dragonborn a set of Daedric armor as well as &#34;Daedric Knight&#39;s Shield&#34; and &#34;Daedric Knight&#39;s Sword&#34; substantially stronger weapons then their originals, with a high enchantment, although not close to being able to defeat the god bosses. To all who try it out, thank you, and anyone who&#39;d like to help on the team, or translate this to other languages, please, let me know, I&#39;ll gladly accredit you here. Thank you.",
  "categoryId": "35",
  "version": "BETA",
  "author": "Tobi Mikami",
  "createdUnix": "1395612603",
  "updatedUnix": "1395612596",
  "containsAdultContent": false,
  "uploadedBy": "TobiMikami",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102236",
      "name": "Daedra ESP",
      "version": "BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Daedra ESP-52365-BETA.rar",
      "uploadedUnix": "1395612596",
      "modVersion": "BETA",
      "virusScanUrl": "https://www.virustotal.com/file/2fbae190d558a16691928890c5c9197e04ef43fa8d8edac13596b68e924aff85/analysis/1407993204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedra%20ESP-52365-BETA.rar?fid=1000102236&ttl=1535835355&ri=8192&rs=8192&setec=b55d7e9164ba463508c51bb5e6146b16"
    }
  ]
}