{
  "modId": 52368.0,
  "modName": "The_Werd",
  "summary": "Map Markers of all Shout Word Wall Locations (Vanilla) and Masks.   \r<br />The Werd Book has details of all Vanilla Shouts and associated quests.",
  "descriptionHtml": "The Werd:\r<br />Map Markers of all Shout Word Wall Locations (Vanilla) and Masks.   \r<br />\r<br />DLCs:\r<br />No DLCs are required for Vanilla users. \r<br />Directions for DG DLC Shouts are given in the TheWerdReadMe for those that have DG.\r<br />\r<br />The Werd Book:\r<br />Details of all Vanilla Shouts and associated quests.  Also Mask Information. \r<br />The Werd Book is located on the Riverwood Bridge. (See image)\r<br />The Werd Book does not respawn so if you misplace it you can use the console to get another one. \r<br />Open console:\r<br />` (the tilde key above the Tab key)\r<br />Type:\r<br />Help werd \r<br />You should see the book name and the number you need. \r<br />Type:\r<br />Player.additem numberfromabove 1\r<br />The 1 at the end says you want only 1 book.\r<br />\r<br />Some Map Markers are close to combat areas so be careful when porting so you don&#39;t die a split second after landing (I love the challenge), others not so much, pan around and you will see your obvious destination. \r<br />\r<br />Note: There is only one marker at Labyrinthian, but two shouts there. Go to the Maze to get the Word Wall there (it is on the back wall). The other is in Labyrinthian dungeon during Mage Quest. \r<br />\r<br />Also, the mound close to the Maze is where you can pickup the Wooden Mask at the skelly. Equip the Wooden Mask while in the mound and you will be ported to the Mask room where you can put your Masks and other items. Once you get all the Masks and place them here you will get the final Mask. This is also a safe storage area with multiple containers if you want to use it as a storage base.  The Wooden Mask is a &#34;key&#34; that opens that Mask room, it will only work in that mound. But you can always use the Labyrinthian Map Marker to get there anytime you like. Just unequip wooden mask to leave the room. \r<br />\r<br />This small mod contains just map markers and the book. It is compatible with all mods and any load order and has been run through Tes5edit and is clean. \r<br />\r<br />The Werd has been on Steam and has been working with no errors or problems. All content is default Skyrim files.  Endorsing is uplifting and healthy :D\r<br />\r<br />******\r<br />DLC Dawnguard&#39;s 3 Shouts \r<br />Drain Vitality - once all three words have been collected - lets you drain stamina, magicka and health from your enemies. \r<br />\r<br />1st is located during the quest &#39;Awakening&#39;. \r<br />2nd is located in the middle of the frozen lake at Forgotten Vale, which you will visit as part of the quest-line. \r<br />3rd is at Arcwind Point, there is already a marker here in vanilla Skyrim. \r<br />\r<br />Summon Durnehviir Dragon Shout \r<br />\r<br />During the section inside the Soul Cairn, you will fight the dragon Durnehviir. After defeating him you will end up speaking to him later on, unlocking this Dragon Shout. This shout can be a little finicky. This is a summon similar to a spell rather than an ability to call the Dragon Odahviing. This means you need a space of open land without interruptions. To use the Shout, point the cursor at the land and use it. Note, don&#39;t direct it at your feet or in the sky. It can be a little buggy too, often only using the first word of this Shout. A potential fix is to direct the Shout at an NPC such as a follower and hope it will let you use it properly again. \r<br />\r<br />\r<br />Soul Tear Dragon Shout \r<br />Soul Tear will let you &#39;rip a soul&#39; from your opponent, turning them into ally&#39;s and having them fight alongside you. \r<br />\r<br />This Shout is dependant on the Summon Durnehviir shout. Without the ability to summon the Durnehviir, you won&#39;t be able to gain access to Soul Tear. \r<br />\r<br />Follow the instructions above on getting the Summon Durnehviir Dragon Shout to work - remember it can be a bit awkward - and then, when it appears, speak to it to unlock the first word of Soul Tear. \r<br />\r<br />The second and third words are unlocked in exactly the same way, so simply fast travel to a location (that will have enough space for the dragon to appear) and repeat the process two more times. \r<br />\r<br />DLC Dragonborn Shouts (4)\r<br />Most are quest related. Until I have time to add helpful map markers for those the Skyrim Wiki has a great page on these.\r<br />\r<br />Enjoy, \r<br />Quinn\r<br />\r<br />Updated Description: Nov. 18, 2014 ",
  "categoryId": "104",
  "version": "1.0",
  "author": "QuinnFlinders",
  "createdUnix": "1395621649",
  "updatedUnix": "1395620763",
  "containsAdultContent": false,
  "uploadedBy": "QuinnFlinders",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102253",
      "name": "The_Werd_v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "280",
      "fileName": "The_Werd_v1-52368-1-0.7z",
      "uploadedUnix": "1395620763",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/99117541266067458b3b278bc6d1ec16955038a016ccd63a6643d5a754d8bde4/analysis/1407993305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The_Werd_v1-52368-1-0.7z?fid=1000102253&ttl=1535835361&ri=8192&rs=8192&setec=29677cf8b45d8d7fde2d80eb85cd386a"
    }
  ]
}