{
  "modId": 52392.0,
  "modName": "Better Belrand",
  "summary": "This mod makes a few simple, but in my opinion much needed, changes to the hireling found in Solitude – Belrand. ",
  "descriptionHtml": "A Better Belrand\r<br />\r<br />Version: 1.1 \r<br />- Updated Belrand&#39;s level cap to 81. This is the highest level the dragonborn can achieve without using legendary skills. Swapped the conjure familiar with conjure flame atronach. Conjure familar is practically useless at later levels, while a flame atronach is still an effective distraction. \r<br />\r<br />Past Versions \r<br />Version: 1.0 \r<br />- Base version of the mod. Belrand leveled to 40 and conjured the low level familiar spell.\r<br />\r<br />Mod Requirements\r<br />Plain ol&#39; Skyrim\r<br />\r<br />What does this mod do?\r<br />This mod makes a few simple, but in my opinion much needed, fixes to the hireling found in Solitude – Belrand. \r<br />\r<br />What is the reason for making this mod?\r<br />Being my first mod, I wanted to create something I would like to use and wouldn’t be too hard of an undertaking. Enter Belrand. He’s the only spellsword for hire in the vanilla game, yet his equipment, spell list, and perks don’t work together. He’s limited potential. I wanted to fix that.  \r<br />\r<br />Plus, he looks hideous and if you’re anyone but a nord he is outright disrespectful. I enjoy lore-friendly racism as much as the next guy, but not when I just gave him 500 gold. \r<br />\r<br />What changes does this mod make?\r<br />I’ve stuck to lore-friendly changes – far from game breaking. In combat, the first spell he casts is familiar. While I liked that he added another ally in combat, it was his only offensive ability. \r<br />•\tPerks: I removed augmented frost, because he has no frost spells. I added mystic binding (bound weapons do more damage).\r<br />•\tSpells: I added the bound one-hand sword spell. \r<br />•\tArmor: I gave him light armor to start with since he is skilled with light armor\r<br />•\tWeapons: I swapped his sword with an iron war axe. This reflects his perk preference for axes.\r<br />•\tDialogue: Greeting dialogue was changed. He’ll now be friendly to the dragonborn. However he will slide back into his racist habits if he’s hacking a Khajiit (or other provincial) to death. He gets carried away. We can forgive that. E for effort.\r<br />•\tCosmetics: I gave him a moustache worthy of a man who is master of both the magical and the mundane. \r<br />\r<br />Overall, the changes are minor, but make him a more polished character for hire. With the bound sword and the conjure familiar, he now has two offensive spells. I didn’t add a destruction spell because it would completely change his attack pattern. Trust me, his new set-up works great and is wholly unique.\r<br />\r<br />How to install the mod?\r<br />Press Subscribe&#33; The big green thingy. Up top.\r<br />(Use NMM (Nexus mod manager) to download and install the mod. You can also download the file manually, unzip it, and place it in Skyrim’s data folder.) \r<br />\r<br />Any future plans for this mod?\r<br />If the mod gets love, I’m considering adding some dialogue options to Belrand – silly stuff. I’m also considering a radiant quest system like the Hoth follower has.\r<br />\r<br />Don’t forget to endorse if you enjoy the mod. Feel free to message me. Cheers&#33;\r<br />\r<br />Other Belrand related mods on nexus:\r<br />http://www.nexusmods.com/skyrim/mods/30894/\r<br />http://www.nexusmods.com/skyrim/mods/19888/\r<br />http://www.nexusmods.com/skyrim/mods/49992/\r<br />\r<br />Better Belrand on steam workshop:\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=240768979",
  "categoryId": "96",
  "version": "1.1",
  "author": "alittlesharp",
  "createdUnix": "1395683368",
  "updatedUnix": "1395683040",
  "containsAdultContent": false,
  "uploadedBy": "alittlesharp",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102339",
      "name": "betterbelrand",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "betterbelrand-52392-1-1.zip",
      "uploadedUnix": "1395683040",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/23eea4587d69895ff00eafe709c52bf4d868fd10835283c52f10fbb83a8e800a/analysis/1407994340/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/betterbelrand-52392-1-1.zip?fid=1000102339&ttl=1535835399&ri=8192&rs=8192&setec=b5f41dabfbac1978c0f2f5562c96d149"
    }
  ]
}