{
  "modId": 52412.0,
  "modName": "Vanity Armors",
  "summary": "Combine your current armor with another to change to it&#39;s appearance while keeping the current armors stats&#33; (Much like World of Warcraft&#39;s transmog.) ",
  "descriptionHtml": "PLEASE READ THE DESCRIPTION FULLY BEFORE ASKING QUESTIONS. \r<br />\r<br />Combine your current armor with another to change to it&#39;s appearance while keeping the current armors stats&#33; (Like WoW&#39;s transmog.) \r<br />\r<br />This is done by visiting an anvil with both armors in your inventory. New recipes will appear for you to choose which you wish to look like. The two items will be combined into a new armor. Want Elvish looking armor, but Scaled armor stats? Do it&#33; And don&#39;t worry, the recipes will only be visible if you have the armors to combine, so you don&#39;t have to worry about recipe clutter. \r<br />\r<br />[color=#FF0000]This Mod&#39;s continued creation is currently on hiatus.[/color] But feel free to use it as is, as some of it is done&#33; Besides, having the mod won&#39;t harm anything as it only adds recipes, and doesn&#39;t change any of the games base data. \r<br />A recipe for each armor-&gt;armor combination would take some time for me to complete, but I may return to work on this some day soon, especially if I find a better way to make a vanity armor system using scripts instead of manually making every piece compatible with every other piece. XD \r<br />\r<br />[color=#FDD017][b]- Whats Completed - [/b]\r<br />\r<br />Scaled Armor may be transformed into looking like the following armors... \r<br />~Archmage Robes, Fur(4 types), Hide, Studded, Leather, Elven, Steel, Elven Light, Elven Gilded, Steel Plate, Iron, Banded Iron, and Dwarven. \r<br />\r<br />Dragonplate Armor may be transformed into looking like the following armors... (and shields if avail) \r<br />~Elven, Ebony, Blades, Orcish, Nightingale, Stormcloak Armor \r<br />\r<br />Dragonscale Armor may be transformed into looking like the following armors... (and shields if avail) \r<br />~Elven, Glass, Forsworn, Daedric, Hide, Scaled, Nightingale, All Hold Specific Guard Armors, Stormcloak Armor \r<br />\r<br />Daedric Armor may be transformed into looking like the following armors... (and shields if avail) \r<br />~Ebony, Orcish, Nightingale \r<br />\r<br />Templates can be created to prevent the loss of rare armor sets, for the following armors... \r<br />~Nightingale\r<br />[/color]\r<br />\r<br />[b]- Whats Planned - [/b]\r<br />All armors will be transformable into looking like any other. Each type, Boots, Helmet, Cuirass, Gauntlets will all be transformable. As will shields. If you prefer the look of one type of armor, now you can feel free to always look like that. And it&#39;s not cheating or OP as you must own both pieces of armor to complete the combination. \r<br />\r<br />[b]- What happens when two items are combined - [/b]\r<br />The two items disappear, replaced with a new one. This new item has a new combined value of the two used to make it. However, one will be used for the appearance of the item, the other will give the stats and material type. So if you turn a light armor into looking like a heavy armor, you will still count as wearing light. It&#39;s just for &#39;looks&#39;. \r<br />WARNING - Enchanted items do not retain their enchant when used in a recipe. Be sure to only use un-enchanted ones, and then enchant the new combined version after. \r<br />\r<br />[b]- What about unique/rare armors? - [/b]\r<br />I added the ability to create a template from rare armors that you can use to open up the &#34;crafting recipe&#34; for the vanity version of these armors. When you visit a forge with any piece of the rare set, you will be able to craft the Template. You will only need one, ever. So you don&#39;t need one for each of the boots, helm, etc. Once you have it, you can then visit the forge again with this in your inventory, and use the normal item used to temper that armor set, and your current &#39;stat armor&#39; to make the vanity version. For example, Dragonscale Nightingale Armor, requires Dragonscale Armor, and Void Salts to craft. This was the only way I could give the armor a cost, as &#39;removing&#39; the nightingale armor when combining seemed, too steep a cost. \r<br />\r<br />[b]- Compatibility - [/b]\r<br />* This does not change any vanilla armor stats or other data. \r<br />* This adds new armors, and recipes based on the original vanilla armors. Any mods that alter the stats of the vanilla armors will not actually effect the new &#39;combined armors&#39; stats... but they have stats based on the vanilla un-modded ones so your new combined armors may or may not be better or worse than they should be after you combine them. \r<br />* This mod does not allow you to combine DLC, or other Mod added armors. \r<br />* Works with new or saved games. \r<br />\r<br />This mod is also on my Steam Workshop - http://steamcommunity.com/sharedfiles/filedetails/?id=237502949&tscn=1395760852",
  "categoryId": "54",
  "version": "0.15.0",
  "author": "Blue001",
  "createdUnix": "1395760861",
  "updatedUnix": "1399565091",
  "containsAdultContent": false,
  "uploadedBy": "Apoet001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108356",
      "name": "VanityArmor",
      "version": "0.15.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "VanityArmor-52412-0-15-0.zip",
      "uploadedUnix": "1399565091",
      "modVersion": "0.15.0",
      "virusScanUrl": "https://www.virustotal.com/file/24c3627481e55dcefd46c5aeb77f01b9c3aa84861c4c5d10cc47cb38db6b4490/analysis/1408068302/",
      "changelogHtml": " Update: May 8\r<br />\r<br />Added 11 more recipes.\r<br />These include\r<br />Daedric to Elven and Light Elven (helmetx2, cuirassx2, gauntletsx2, bootsx2, shield)\r<br />Daedric to Gilded Elven (cuirass) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VanityArmor-52412-0-15-0.zip?fid=1000108356&ttl=1535835432&ri=8192&rs=8192&setec=a9a80f5d5abd36fd196350d13314ab5a"
    }
  ]
}