{
  "modId": 52486.0,
  "modName": "Naturalist ENB For CoT",
  "summary": "Realistic lighting; proper shadows and coloration. CoT REQUIRED.",
  "descriptionHtml": "Update coming soon (within 2 weeks)&#33;\r<br />See the following for sneak peeks of the update:\r<br />[url=http://www.nexusmods.com/skyrim/Images/409417/?]Naturalist ENB Update WIP[/url] &lt;--- Out-dated, but still close to current build.\r<br />[url=http://www.nexusmods.com/skyrim/Images/409747/?]Dappled Wall[/url]\r<br />[url=http://www.nexusmods.com/skyrim/Images/409800/?]Sunset Brewery[/url]\r<br />[url=http://www.nexusmods.com/skyrim/Images/409899/?]The Equus And Equestrian[/url]\r<br />[url=http://www.nexusmods.com/skyrim/Images/409915/?]Ambient Light Is Your Friend[/url]\r<br />[url=http://www.nexusmods.com/skyrim/images/409917/?]2 Predators 1 Prey[/url]\r<br />Keep an eye on this if you liked the initial release. :)\r<br />\r<br />**********************************************************************************************************\r<br />WARNING&#33;&#33;&#33;\r<br />THIS ENB IS GRAPHICALLY INTENSIVE. ANYTHING SHORT OF AN OVERCLOCKED 4GB GTX 770 WILL STRUGGLE, OR POSSIBLY DAMAGE YOUR PC. I SIMPLY HAVE THIS HERE TO GIVE YOU A HEADS UP. IF YOU DON&#39;T HAVE ISSUES (AND YOU PROBABLY WON&#39;T) THAT&#39;S FINE, BUT STOP POSTING IDIOTIC POSTS SAYING A ENB CAN&#39;T HURT A PC. THIS IS FOR LIABILITY REASONS ONLY.\r<br />YOU HAVE BEEN WARNED.\r<br />**********************************************************************************************************\r<br />This is the first time I&#39;ve uploaded any ENB, so I&#39;m not sure if this will work.\r<br />\r<br />Are you tired of &#34;realistic&#34; ENBs that hide those HD textures in unrealistic pitch black shadows? Did you know your GPU still has to load those textures, even though you can&#39;t see them? Why are you wasting resources for inferior rendering? Are shadows pure black on a sunny day in real life? No. Do your eyes see lens glare in real life? I sure hope not. So why should your game, which is in FIRST PERSON VIEW be any different?&#33; It shouldn&#39;t. This ENB preset, when installed properly, will give you that true to life lighting you deserve. No more inappropriately dark shadows, washed-out skies, tacky lens glare, fantasy-like over-saturation, excessive bloom, or distracting heavy DOF.\r<br />\r<br />My goal for this Naturalist ENB is to simulate real world light distribution the way your EYES see light, NOT how cameras see light, as best as this engine and ENB rendering software can. This means actually venturing out into the cold everyday, and remembering what I saw, since a photo taken with my iPhone won&#39;t look even remotely close to how it really looked. This is where people get confused. The aim isn&#39;t photograph realism, it&#39;s optical realism. This makes referencing photographs a no-no, since no camera has truly captured the true to life look, especially at night. A skilled photographer with a Hasselblad can get pretty close, but how many of those photos exist for referencing, hmm? I&#39;ve spent hours upon hours tweaking the lighting to give you supreme ambient lighting, particles, subsurface scattering, reflections, and especially breath-taking sunsets. Tamriel is well lit by the heavens, and my ENB recognizes this. Nights are playable without night eye or torches, but on cloudy nights you WILL need night eye or a light source. Thanks to sky lighting being enabled, along with cloud shadows, the beautiful weather CoT provides will actually change visibility. Dungeons are on the hazardous side, but not unrealistically dark.\r<br />I hope you get this ENB to work, and good hunting.\r<br />\r<br />**********************************************************************************************************\r<br />If you for some reason beyond my comprehension like RV&#39;s look over mine, you may find it here:\r<br />http://www.nexusmods.com/skyrim/mods/30936/?\r<br />**********************************************************************************************************\r<br />\r<br />First of all, you MUST install Boris&#39; ENB v0251 or newer&#33;\r<br />\r<br />Second, you MUST install [url=http://www.nexusmods.com/skyrim/mods/50731/?]Enhanced ENB Night Eye by scegielski[/url]\r<br />\r<br />\r<br />Third, you MUST install [url=http://www.nexusmods.com/skyrim/mods/41741/?]SweetFX GT by MannyGT[/url]\r<br />HOWEVER, ONLY INSTALL THE &#34;04.Without nothing (base)&#34; FILES&#33;\r<br />IF YOU INSTALL THE SEPIA OR VIGNETTE FILES, IT WON&#39;T LOOK RIGHT.\r<br />\r<br />Fourth, for the DOF in my screenshots, please use this DOF:\r<br />[url=http://www.nexusmods.com/skyrim/download/96094]BETTER THAN REAL - DoF ak tilt-shift for any ENB - by Candy-Ray[/url]\r<br />\r<br />Fifth, YOU MUST HAVE THE LATEST COT VERSION AND COT WEATHER PATCH.\r<br />[url=http://www.nexusmods.com/skyrim/mods/17802/?]Climates Of Tamriel - Weather - Lighting - Audio by JJC71[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/39799/?]Climates Of Tamriel - Weather Patch by prod80 - Aiyen - Saerileth[/url]\r<br />\r<br />Sixth, select CoT vanilla nights Lvl 3, and make sure &#34;CoT-WeatherPatch_Snow-40.esp&#34; is the snow file you chose for the weather patch.\r<br />\r<br />Finally, install my preset files.\r<br />You may want to forego the enblocal.ini if you are not using a 4GB GPU.\r<br />\r<br />I forgot to mention this:\r<br />Set your in-game brightness to the half way point. I adjusted all the settings with game brightness set at the 50% mark so that you may adjust the slider as you see fit for your TV.\r<br />\r<br />This ENB is NOT COMPATIBLE with Shadows, RLO, and ELFX.\r<br />\r<br />Please feel free to upload screenshots using this preset, and leave feedback on issues I may have missed. I will periodically update the file as I catch and fix abnormalities, and overall keep tweaking the settings.\r<br />\r<br />If you like RV&#39;s unrealistic pitch-black shadows and lens flares, fine, but stop harassing me in the comments section. If you don&#39;t like this ENB, don&#39;t use it, and move along. Insulting me only make YOU look like a fool. If you have suggestions to improve this ENB, by all means feel free to do so in a respectful and intelligent manner.",
  "categoryId": "97",
  "version": "v01",
  "author": "ItsDolomiteBaby",
  "createdUnix": "1395997189",
  "updatedUnix": "1395997134",
  "containsAdultContent": false,
  "uploadedBy": "ItsDolomiteBaby",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102694",
      "name": "Naturalist ENB v01",
      "version": "v01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "Naturalist ENB v01-52486-v01.zip",
      "uploadedUnix": "1395997134",
      "modVersion": "v01",
      "virusScanUrl": "https://www.virustotal.com/file/324aa68e0cb4d931505792ec6bfca369841e8e0bf037130e0a17af64e4525891/analysis/1407997929/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Naturalist%20ENB%20v01-52486-v01.zip?fid=1000102694&ttl=1535835533&ri=8192&rs=8192&setec=62a5e311e961744dfd590f6fbdbde8f6"
    }
  ]
}