{
  "modId": 52487.0,
  "modName": "Epic Gameplay Overhaul",
  "summary": "This Skyrim goes to 11.",
  "descriptionHtml": "[center][b][b][center][b][center][youtube]YpTy5CbuLzI[/youtube][/center][/b]\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/37216-1-1430053788.png[/img][/center][/b]\r<br />\r<br />\r<br />\r<br />[size=15][color=grey]EPIC GAMEPLAY OVERHAUL[/color][/b][/center][color=grey][/size][/color]\r<br />\r<br />\r<br />[center][b][size=4]THIS MOD REQUIRES SKSE, SKYUI, AND THE LATEST SKYRIM UPDATE.[/size][/b][/center]\r<br />\r<br />\r<br />\r<br />[center][center][youtube]EyJKt3J3EDo[/youtube][/center][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5]INSTALLATION NOTES[/size][/b]\r<br />\r<br />DO NOTHING OTHER THAN THIS.\r<br />\r<br />Step 1: [size=3][i]Read the description.[/i][/size]  [b]THIS IS NOT OPTIONAL.[/b]  This mod package is EXTREMELY complex and if you don&#39;t know what you&#39;re getting yourself into, you will not know what this actually DOES.  Furthermore, your game will probably crash and burn.  READ THE DESCRIPTION.  READ THE DESCRIPTION.  READ THE DESCRIPTION.\r<br />\r<br />Step 2: Download the mod.\r<br />\r<br />Step 3: Install with the mod manager [b] on a new game[/b].  Select which modules you wish to install. MAKE SURE THAT NO SCRIPTS ARE EVER OVERWRITTEN BY ANY FILE, INCLUDING THE UNOFFICIAL PATCHES.  No matter what.  \r<br />\r<br />Steps 4 - 9: If you do not have any of these, install them.  If you don&#39;t know what anything on this list is, YOU NEED TO FIND OUT.  BOSS, SSME, ENBoost, SkyUI, SKSE, and the Unofficial Patches.\r<br />\r<br />Step 10: Sort your load order with BOSS.\r<br />\r<br />Step 11: YOU MUST START A NEW GAME.  THERE IS NO WAY AROUND THIS.  AT ALL.  SO DON&#39;T ASK ME.  BECAUSE YOU MUST START A NEW GAME.  [b]YOU MUST START A NEW GAME[/b].  NO, NOT AFTER YOU EXIT HELGEN THE FIRST TIME, NOT BEFORE YOU START THE CIVIL WAR, NOT [i]AFTER BREAKFAST[/i],YOU MUST USE THIS ON A NEW GAME WHERE YOU CLICK ON THE TEXT IN THE MAIN MENU THAT SAYS &#39;NEW GAME&#39;.  [b][i][size=5]YOU MUST START A NEW GAME.[/size][/i][/b]\r<br />\r<br />\r<br />IF YOU ARE USING VIOLENS\r<br />You will need the compatibility scripts from that page for CDO.\r<br />\r<br />IF YOU ARE UPGRADING BETWEEN VERSIONS AND YOU WILL BE UPGRADING CWO IN THE PROCESS:\r<br />\r<br />YOU DO NOT NEED A NEW GAME IF YOU ARE UPGRADING FROM EGO 3 TO EGO 3.0x.  THIS UPGRADE MAY BE DONE AT ANY TIME UNDER ANY CIRCUMSTANCE.  IF YOU ARE UPGRADING FROM ANY OTHER VERSION TO ANY OTHER VERSION, YOU MUST START A NEW GAME.\r<br />\r<br />IF YOU ARE UPGRADING IIO\r<br />\r<br />IIO HAS BEEN ROLLED BACK TO V2.1 DUE TO WAY TOO MANY ISSUES FOR SUCH A SMALL UPDATE.  USERS UPDATING MIDGAME SHOULD REMOVE, THEN ADD THE SPELL &#34;IIO ABILITY&#34; FROM/TO THE PLAYER IN THE CONSOLE TO RESTORE IIO.\r<br />\r<br />\r<br />IF YOU ARE UNINSTALLING\r<br />\r<br />Sweet mother of god, I can&#39;t even contemplate the ramifications of this.  If you uninstall this your save is toast.  Uninstall with the mod manager, making sure that all scripts added by CWO are removed, then start a new game.\r<br />\r<br />\r<br />\r<br />[size=3]My Swedish Chef, Sven, has also made a mod.  It&#39;s called [url=http://www.nexusmods.com/skyrim/mods/52681/?]NPC Knockout Overhaul.[/url]  You should try it.  [/size]\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5]TABLE OF CONTENTS[/size][/b]\r<br />\r<br />I.  Features\r<br />II.  I still don&#39;t understand.  What is this and what does it do?\r<br />III.  Known issues and Incompatibilities - The EGO bug tracker\r<br />IV.  Frequently Asked Questions\r<br />V.  Tips and Tricks so You Don&#39;t Die All the Time\r<br />VI.  Reviews\r<br />VII.  Recommended Mods\r<br />VIII.  Glowing Testimonials\r<br />IX.  Shameless Advertising for My Buddies\r<br />\r<br />\r<br />\r<br />[size=3]\r<br />\r<br />[i]&#34;Dear Bethesda: please consider this to be my entry into your &#34;rewrite Skyrim in 10MB or less&#34; contest.&#34;\r<br />\r<br />~ Apollo\r<br />[/i][/size]\r<br />\r<br />[center][size=8][color=green]TL;DR[/color][/SIZE][/center]\r<br />\r<br />[size=3][b][center]OG IS SPEECHLESS.[/center][/b][/size]\r<br />\r<br />\r<br />[b][size=5][color=green][url=http://skyrim.nexusmods.com/mods/32597/?]DRAGON COMBAT OVERHAUL[/url][/color][/size][/b]\r<br />Dragons are now epic destroyers of worlds(not like your ex-girlfriend, that was a different kind of epic).  DCO turns a vanilla dragon into a fearsome beast that will do anything it can to kill you, even by teaming up with other dragons.  DCO not only edits their AI, but also handles dragon deaths, soul absorption, dragon tactics, adds new &#34;limit break&#34; shouts, and does a bajillion other things all designed to make combat with dragons harder, more epic, and more fun.\r<br />\r<br />This is a very big overhaul and you just need to see it to believe it.  You are not ready for this.\r<br />\r<br />\r<br />[center][youtube]A_aGuY4FHMQ[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5][color=red][url=http://skyrim.nexusmods.com/mods/37216/?]CIVIL WAR OVERHAUL[/url][/color][/size][/b]\r<br />This mod restores a huge swath of cut content from the civil war, including a bunch of cut quests and dialogue.  You now can lose battles and the war as well, new soldier types have been added to each side, there are also new, unique rewards for quests, and the civil war is just generally better.  \r<br />\r<br />This is another big overhaul that you just have to see in action and play.\r<br />\r<br />\r<br />\r<br />[center][youtube]KfyatsDCYbc[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5][color=red][url=http://skyrim.nexusmods.com/mods/43241/?]FIRE AND ICE OVERHAUL[/url][/color][/size][/b]\r<br />This causes fires to spread dynamically and naturally from fire spells and effects, ice spells and effects to freeze into solid blocks, and shock spells and effects to start fires on a more limited basis.  Fire will react to its environment as well, so if it&#39;s raining outside, fire will spread more slowly, for example.\r<br />\r<br />\r<br />[center][youtube]v2yZ4OjXU_M[/youtube][/center]\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5][color=red][url=http://www.nexusmods.com/skyrim/mods/52474/?]COMBAT DRAMA OVERHAUL[/url][/color][/size][/b]\r<br />This mod edits the way killcams work, allowing you to choose their frequency, to &#34;do&#34; killcams even when you don&#39;t kill the target(attack cams), edits ranged killcams to suck less, allows more types of killcams, such as for firestorm, and adds in wholly new ranged killcams that are much better than what Bethesda threw at you, in my opinion.  It just makes the drama of combat more fluid, more dynamic, and just plain better.\r<br />\r<br />Another mod you have to play with to understand.\r<br />\r<br />\r<br />\r<br />[center][youtube]yOgg36fJ84Q[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5][color=red][url=http://www.nexusmods.com/skyrim/mods/53888/?]EPIC MUSIC OVERHAUL[/url][/color][/size][/b]\r<br />Epic Music Overhaul allows you to personalize your Skyrim experience with new music that you can add in to a wide variety of situations. It also makes combat music play more intelligently.  PLEASE SEE [url=http://www.nexusmods.com/skyrim/mods/53888/?]THE EPIC MUSIC OVERHAUL DESCRIPTION[/url] FOR ADDITIONAL INSTALLATION INSTRUCTIONS.\r<br />\r<br />\r<br />\r<br />[b][size=5][color=red][url=http://www.nexusmods.com/skyrim/mods/52471/?]IMPORTANT INFORMATION OVERHAUL[/url][/color][/size][/b]\r<br />As your stamina gets lower, your vision will blur.  As your magicka gets lower, the world will drain of color.  As you health gets lower, the world will turn dark red and blur.  Essentially, this gives you immersive notifications for your health, magicka, and stamina, so that even if you use another mod like Immersive Hud to get rid of the annoying bars, you&#39;ll still have a pretty good idea of how much health/magicka/stamina you have left.\r<br />\r<br />\r<br />\r<br />[b][size=5][color=red][url=http://www.nexusmods.com/skyrim/mods/58051/?]SIMPLE MAGIC OVERHAUL[/url][/color][/size][/b]\r<br />This rewrites the magic gameplay mechanics for the player in Skyrim.  Magic is now harder to use, but has dramatically increased in potential power.  SMO implements a spell &#34;SWEET SPOT&#34; system that dramatically affects the cost and power of spells and your magicka regen based on a number of factors.  SMO will punish a player for casting spells out of their league, but most often it won&#39;t even come to that because SMO will simply close off spellcasting to all but those that truly wish to learn it.  But if you work hard at being a mage, and fight as a mage would, you will become FAR more powerful than any wizard could ever hope to become.\r<br />\r<br />[b][size=5][color=red][url=http://www.nexusmods.com/skyrim/mods/60077/?]MOVEMENT AND STAMINA OVERHAUL[/url][/color][/size][/b]\r<br />This rewrites the movement and stamina gameplay mechanics for the player in Skyrim.  Movement speeds, such as sprinting, turning, walking, running backwards etc., have all been changed.  Jogging now costs Stamina, and sprinting costs more stamina than before(but is significantly faster).  Drowning is now a real danger.  You will trip if you are hurt and/or exhausted.  This mod affects all NPCs as well.  Essentially, stamina is now a more important, dynamic attribute in a fair and balanced way, and you will have to actually consider your stamina costs if you want to survive.  Also, don&#39;t drown, you will feel like an idiot.\r<br />\r<br />\r<br />\r<br />[b][size=5]MCMS EVERYWHERE[/size][/b]\r<br />Every mod in the Epic Gameplay Overhaul family has an MCM associated with it that will give you all the options you will need to tailor the game to your liking, and in the case of CWO, allow you to debug the mod as well if something goes wrong.\r<br />\r<br />\r<br />\r<br />[b][size=5]I STILL DON&#39;T UNDERSTAND - WHAT IS THIS AND WHAT DOES IT DO?[/size][/b]\r<br />\r<br />Epic Gameplay Overhaul is simply a collection of my mods all packaged into one easy download.  Each of these mods is still available for individual download, so don&#39;t worry.  This package will just make your game more epic.  Take my word for it.\r<br />\r<br />\r<br />[b][size=5]KNOWN ISSUES/INCOMPATIBILITIES: THE EGO BUG TRACKER[/size][/b]\r<br />\r<br />[Bug Severity = Vexing]\r<br />1.  You must load Dragon Combat Overhaul before The Dance of Death or your main menu will never start up.\r<br />\r<br />2.  Dragons may fly into and out of walls or the ground, or do crazy backflips, etc. etc.  This is usually just a little bit immersion-breaking, and is certainly harmless.  And there is nothing I can do about it.  That is the cost of DCO.\r<br />\r<br />3.  DCO will conflict with Requiem and &#34;requires&#34; a patch.  There is a very easy workaround for this on the DCO page(have DCO load after requiem, use Deadly Dragons as well) which I would honestly prefer to the patch.\r<br />\r<br />4.  Most of these mods will probably conflict with Audio Overhaul for Skyrim.  The conflicts should be minor, but make sure all EGO mods load after.\r<br />\r<br />5.  You may notice some small cosmetic issues with the civil war(people may forget to give speeches, just for one example).\r<br />\r<br />6.  FIO will cause a papyrus logjam when attempting to put out fires with ice.  There is nothing I can do about it, and it is completely harmless.  So disable your papyrus logs like you&#39;re supposed to.\r<br />\r<br />7.  Major sieges are having SO MUCH TROUBLE keeping a tally in your objective of the percentage of troops left.  It&#39;s probably best to ignore those kinds of objectives in V4.  This is purely cosmetic, do not worry about it.\r<br />\r<br />8.  X&#39;s Last Battle, a CWO radiant quest I added this update, has a number of issues associated, but it all boils down to this: if something goes wrong with the quest, just type &#34;setstage cwmission05 100&#34; in the console to auto-win it.  This will have zero detrimental effect on your gameplay(aside from skipping a fun quest).  Generally the predictive debugger will knock out this quest so you won&#39;t even see it.\r<br />\r<br />10.  During the Loss finale, there are a couple of cosmetic issues.  This should all be fine.\r<br />\r<br />11.  You may at times get a message box that tells you that an error occurred.  There are two types of errors that can occur, one is a &#34;SABETME3 error&#34;.  This can be ignored.  The other is a &#34;DisplayHoldObjective()&#34; error, and will likely be accompanied by further issues.  The usual causes of this error are script lag and/or attempting to run through the quest line faster than your computer will let you(It means you are moving faster through the quest line than the actual script is able to run, and produces errors).  If this occurs during the final battle it can be safely ignored.\r<br />\r<br />12.  This is not actually a bug, but I&#39;m betting you&#39;ll look for it here.  If you find that in CWO your disguises don&#39;t work, and you&#39;ve tried the console commands to remove yourself from the hostility faction, then CWO didn&#39;t cause it, because by typing in the appropriate console command you remove the ONLY mechanism by which CWO promotes such hostility.  Some players have reported having &#39;invisible bounties&#39; that they need to fix, others say that didn&#39;t help.  But whatever the issue, I can&#39;t help you beyond this advice because it is somehow your fault.  :(\r<br />\r<br />[Bug Severity = Crunch]\r<br />\r<br />1.  Sometimes when you go down in a CWO battle, you don&#39;t teleport back to camp, or you just stand back up again, or it takes a minute after you teleport to stand back up, or your body goes all wonky.  This is all harmless, though on occasion you may be stuck lying on the ground, unable to move.  If this happens, try coc&#39;ing or fast traveling somewhere and waiting for a bit for the game&#39;s scripts to catch up.  THIS IS USUALLY CAUSED BY SCRIPT LAG, SO KEEP THAT SCRIPT LAG LOW.\r<br />\r<br />3.  Sometimes during a ranged killmove, you may be stuck in first person while the projectile moves reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeaaaaaaaally slowly.  Wait it out if this happens, it usually reverts you back to normal after a while.\r<br />\r<br />4.  I&#39;ve received reports that some ENBs do not work with some parts of IIO, sometimes.  No I don&#39;t know which ENB disables what, and it appears there is nothing I can do about it.  So just try it and see if it works for you, it probably will.  If your ENB is already disabling effects like this, it&#39;s disabling other parts of your game, so it doesn&#39;t make me think highly of your ENB.\r<br />\r<br />5.  I have also received reports that IIO is not working properly with SLI/Crossfire setups.  There is nothing I can do about this.\r<br />\r<br />6.  Sometimes, especially in high lag environments, during the siege of rifted when you&#39;re on offense, the quest may not update properly when you break through the final barricade.  If this happens, simply activate the door, and in the message that says you can&#39;t open the door, there will be a button labeled &#34;CWO OVERRIDE&#34;.  Click on that.  If that button does not appear, type &#34;setstage cwsiege 50&#34; into the console.\r<br />\r<br />[Bug Severity = Computer Over.  Virus = Very Yes.  That&#39;s not a good prize.]\r<br />1.  Sometimes, CDO will just straight up soft lock you, or at least it has in the past.  I&#39;ve removed every offender I could find, but you have to understand that it&#39;s caused by a specific issue in a camerapath that I have to be on the lookout for, and I&#39;m working with hundreds of camera paths at this point, so I could certainly have missed one.  Save often.\r<br />\r<br />2.  If you have high script lag, EVERYTHING WILL GO WRONG.  YOU CANNOT USE ANY OF THESE MODS(with the exception of Important Information Overhaul) IF YOU HAVE RIDICULOUS SCRIPT LAG.  This is entirely fixable, and every machine should be able to easily handle what EGO throws at it.  IF YOU HAVE SCRIPT LAG, YOU DID SOMETHING WRONG, AND YOU NEED TO FIX IT. \r<br />\r<br />\r<br />\r<br />THE FOLLOWING BUGS ARE UNCONFIRMED.  I DO NOT KNOW HOW OR WHY THE FOLLOWING ISSUES OCCUR, BUT THEY ONLY HAPPEN TO USERS THAT I CANNOT CONFIRM IF THEY HAVE DONE EVERYTHING CORRECTLY.  THESE ISSUES MAY OR MAY NOT BE CAUSED BY CWO.\r<br />\r<br />1.  Solitude may start out owned by the Stormcloaks.  THIS BREAKS EVERYTHING.  Starting a new game again should fix the issue.\r<br />\r<br />2.  Siege battles may be over extremely quickly.  This will not break everything, but it sucks.  There is no fix for this, but it shouldn&#39;t occur on every siege.\r<br />\r<br />\r<br />\r<br />And when in doubt about other issues that may arise in the future:\r<br />&#34;If there&#39;s a problem, yo, I&#39;ll solve it.  Check out the hook while the DJ revolves it.&#34;\r<br />\r<br />\r<br />\r<br />[b][size=5]UNRELATED ISSUES: THE EGO NOT-A-BUG TRACKER[/size][/b]\r<br />\r<br />Users frequently enjoy submitting bug reports and recriminations about things that they think I did to them.  This is a list of things that EGO mods did NOT do to break your game.  Very often these are issues caused by the user, or an unknown issue caused by Bethesda somewhere in the spaghetti-code.  THIS IS BY NO MEANS A COMPLETE LIST, AS I CANNOT PREDICT WHAT WILL GO WRONG IF I DID NOT DO IT.\r<br />\r<br />ISSUES WITH DISAPPEARING SOLDIERS ARE NOT CWO&#39;S FAULT.  If soldiers do not appear at your battle, STOP WHAT YOU ARE DOING AND RELOAD YOUR GAME A WHOLE CW QUEST BACK.  This issue is caused by script lag/massive setup.  Because the sieges require so much effort for the engine to create(each siege is a good few hundred lines of code that calls thousands of lines of code from lower-level functions, and sets up over 25 actors while removing entire cities worth of actors and enabling and disabling triggers and GAWD IT DOES A LOT OF STUFF IS WHAT I&#39;M TRYING TO SAY).  If your game loads any cell wherein the siege takes place or starts before the scripts have finished working their magic, it will break everything.  I have done everything I can to prevent this, but if you are speeding through the war, or have massive script lag, or ugrids set to 13, there is a good chance you&#39;ll get hit by this.  Play the game normally, with a good setup, and you should be fine.\r<br />\r<br />IF YOU ARE UNABLE TO LOOT THE BODIES OF DEAD SOLDIERS DURING SIEGES, THAT IS AN INTENTIONAL FIX OF A VANILLA BUG.  Due to the way sieges work, reinforcements during sieges are simply resurrected and respawned versions of the enemy you killed.  If you loot a dead body, it will spawn without the items you looted.  Not only does this ruin sieges, but it will actively break them.  So I simply blocked the activation of dead soldiers during sieges.  You&#39;re welcome.\r<br />\r<br />DCO/EGO DO NOT CAUSE YOUR MAIN MENU NOT TO SHOW UP.  That means you have not properly sorted your load order.  Please use BOSS at this time.\r<br />\r<br />DCO DID NOT MAKE THE DRAGONS IGNORE YOU - KIND OF.  The dragons are smarter now, but I have next to no control over who they pick to fight.  THREAT LEVEL MIDNIGHT OSCAR has been added, but its effect is minimal if you do not trigger it(you must do enough damage to the dragon that it recognizes you as a threat, and doesn&#39;t happen often).  You can actually hear OSCAR working if you don&#39;t believe me - if you are not in combat with anything but that one dragon, when OSCAR happens, the music will switch tracks.  Told you there were limitations on this.  That being said, DCO DOES change how the dragons move and fight, and because of this they may pick targets that seem silly simply because they are using different tactics.  This experience will vary wildly, as this is controlled by random probabilities. \r<br /> \r<br />CRASHES, FREEZES(except in one very particular and unlikely case), BSOD&#39;S, AND GENERAL AWFULNESS ARE NEVER CAUSED BY EGO.  I get it, you think that because these mods do so much, they break so much, right?  Sorry to break it to you, but that&#39;s just not how it works.  The only possible case at this time that can cause a freeze is when CDO may soft-lock you, which is listed under the bug tracker and is EXTREMELY rare.  Otherwise, these issues are caused by something else, and will certainly cause errors to compound in your save file, causing more and more issues; which is how Skyrim works.  You need to fix your game, and not blame these things on me.  No matter what you think happened, it was absolutely not these mods.  NOTE 1: EGO, due to its ginoromous scope, highly conditionalized and constantly running scripting, and relatively high CPU load, is highly vulnerable to errors in your game.  So while EGO may not [b]cause[/b] unacceptable script lag, crashes, and other badness, if your game already has these things happening it will certainly affect EGO first and most drastically.  Say, for example, I have high script lag.  One of the first, most noticeable effects on DCO is to cause an issue with how landing/takeoff explosions are handled, causing the script to stack up over time, causing a dramatic increase in lag, explosions going off at wrong times, and before you know it, the dragon is flying weirdly, firing things off weirdly, sound is cutting out or going staticy, and the game crashes - IN THAT ORDER, and accelerating as each error progresses.  DCO did not CAUSE this to occur, but markedly increased its damage to your game.  This is why I&#39;m so meticulous about how you need to install this - if your game is already broken, then yes, EGO will snap it in freaking HALF.  But your game was already broken, and EGO is just making it obvious before it became obvious in a myriad of other ways.  Your game was going to break anyway.\r<br />\r<br />\r<br />[b][size=5]FREQUENTLY ASKED QUESTIONS\r<br />[/size][/b]\r<br />&#34;Hi&#33;  I really like your mods, and want to enjoy them to the fullest extent by getting banned from downloading them.  How can I get myself banned?&#34;\r<br />It&#39;s actually kind of difficult, Janice.  By the way your name is Janice for the rest of this FAQ.  In order to get banned, you need to go out of your way to talk about me instead of the mod, and you just don&#39;t know me, man.  \r<br />\r<br />Examples of things you can say that will probably get you banned:\r<br />1.  Asking me to fornicate with myself.\r<br />2.  Asking me to fornicate with anything other than yourself.\r<br />3.  Asking me to fornicate with you will be taken as a compliment.\r<br />4.  Speculating on which genetic maladies I might be suffering from.\r<br />5.  Requesting that I kindly die in a fire.\r<br />6.  In general, requests that I die anywhere will not be honored.\r<br />7.  Comparisons of my writing to the inane scrabblings of a monk encased in a closet of bugs in silence for 30 years.  Don&#39;t insult the monks.\r<br />8.  Wondering aloud if I am 5 years old.  Though I do appreciate that you think I&#39;m a child prodigy, I&#39;m not sure everybody else will understand that you meant it as a compliment.\r<br />9.  Whining about knockbacks in DCO.  You will be banished to the realm of Oblivion reserved for Nazeem and his 20 clones.  Then you&#39;ll wish you got to the Cloud District more often.\r<br />\r<br />[center][img]http://24.media.tumblr.com/207f15f942c4702a86390046733a9a39/tumblr_meuofnhd5p1rq8ga2o1_400.gif[/img][/center]In all seriousness, the question I always will ask of myself when I am considering banning a user is simply &#34;Will this user be a problem down the road?&#34;  So, things like showing a blatant disregard for the descriptions or for me, acting unreasonably, or even just having a terminal case of stupidity, while not automatic bans, will be considered when I consider a ban.  [b]I look at the totality of the circumstances to determine if you as a user will be more trouble than you are worth.\r<br />[/b]\r<br />&#34;I&#39;ve been banned, and for some reason I don&#39;t like it.  Can you unban me please?&#34;\r<br />If you have been banned, this game is over, at least for the time being.  Once I ban you, I stop paying attention to what you do, so I won&#39;t even read your pleas.  That&#39;s the bad news.  The good news is that if I go a long enough time without having to ban people, I will feel generous and remove the blocks from every blocked user.  This happens about twice a year.\r<br />\r<br />&#34;Some are massive epics while others edit FREAKING MUSIC??&#33;  Is this a product of your well known insanity, or is there some kind of rhyme or reason?&#34;\r<br />This is my checklist for creating a mod:\r<br />\r<br />a) Is the area to be modded a in a generally underserved category of mods?\r<br />b) Will it make the game unequivocally(in my opinion) better?\r<br />c) can it be done?\r<br />d) is it worth it?\r<br />\r<br />For example - I&#39;ve been kicking around the idea of SDO(wouldn&#39;t you like to know what that means) for a while now, but haven&#39;t done it yet because it would not make the game &#34;unequivocally better&#34;.  Yes, it would be epic and awesome, but it wouldn&#39;t be what I consider an across the board improvement to a certain mechanic.  Another example is - I will never write a NPC combat AI mod.  That has been done to death, and you already have a large number of flavors of combat to choose from.  My contribution here would be unnecessary.\r<br />\r<br />&#34;Why should I use all of these mods at once?&#34;\r<br />Let me paint you a picture.  You&#39;re a spellsword in the imperial army.  You are summoned to the siege of riften(CWO - RESTORATION IS A PERFECTLY VALID SCHOOL OF MAGIC), and hear an epic speech from General Tullius(CWO - LEAD BY EXAMPLE).  After the speech, the incredibly diverse army(CWO - DIVERSITY DAY) of tanks, archers, mages, buffers, and debuffers charges forward as music that you have selected for civil war battles swells(EMO - DON&#39;T GET PERSONAL).  Unfortunately, the catapults have been hitting the road ahead, and a sea of fire is between you and the objective(FIO - WE DIDN&#39;T START THE FIRE).   Arrows pour through the fire, and you fire back blindly with a fireball.  As you fire, the camera pans out and spins around your character to show you firing the fireball(CDO - DRAMA MAMA/I&#39;M READY FOR MY CLOSE UP MR. DEVILLE), the screen loses color and contrast(IIO - GETTIN&#39; HIGH ON INFORMATION), and because you aren&#39;t yet an adept destruction mage, the spell feeds back and causes your summoned familiar to attack(SMO - FEEDBACK) your nearby Imperial Protector Divini Lateris(CWO - DIVERSITY DAY) who kills it, in the process raising the stats of nearby allies(CWO).  Suddenly, without warning, you hear a dragon scream in a sound you had never heard before as it swoops down and picks the Protector Divini Lateris up, flinging her high into the air(DCO - JOE COLLEGE WAINWRIGHT, CWO - PARTY CRASHERS).  Two more swoop in in succession and carry off two more soldiers(DCO - ASSAULT 2.0).  Suddenly, you lose the battle, as your forces have been decimated by the catapults, arrows, and dragons(CWO - Q IS FOR LOSER).  The music abruptly switches to dragon combat music(EMO - INTELLIGENT COMBAT MUSIC).  Your forces try to flee, but the dragons box in all the troops(DCO - MOOSE AND SQUIRREL).  One dragon, a frost dragon, breathes on you, coating you in ice(FIO - IMMA BUILD ME AN IGLU).  Terrified, you swing your sword wildly trying to get out of the mini-igloo that&#39;s formed around you(FIO - IMMA BUILD ME AN IGLU).  You fire a fireball at a dragon as it flies away, and the camera follows the fireball, showing you missing the target wildly(CDO - DRAMA MAMA).   Suddenly, you hear &#34;RU MAAR&#34;, and all the soldiers flee in terror as the numerous dead rise and begin attacking everything in sight as two of the dragons fly away(DCO - LIMIT BREAKS).  The remaining dragon lands - it&#39;s just you and it now(DCO).  You charge up an incineration, knowing full well the likelihood it will feed back - however, you also know the spell cost is putting you right up to the edge of your magicka pool, ready to cause anywhere between three and nine times normal damage(SMO - FEEDBACK/SWEET SPOT/FEEL THE POWER, KRONK).  You fire, bringing the dragon to dangerously low health, injuring it(DCO - UNPREDICTABLE INJURIES).  As the dragon staggers, you draw a sword and a ward.  The dragon breathes a fireball at you(DCO - JOE COLLEGE WAINWRIGHT), but you reflect it back at the dragon with the ward in your left hand just in time(SMO - JAN, YOU ALWAYS DEFLECT THE CONVERSATION TO YOURSELF).  The dragon is now so close to being dead that you draw your two handed axe, charge forward, take a swing, AND......the camera pans out - time speeds up and slows down, showing every inch of your glorious finishing move.  As you ride the dragon, it bucks you up, and you use the momentum to pull up your axe for a final swing.  At the apex of your leap, time slows at just the right time, causing you to hang in the air for *just the right amount of time* before time returns to its normal speed and you slam the axe into the head of the dragon(CDO - THIS IS PRETTY AWESOME).  When the dragon dies, it screams as it watches its flesh melt off its bones and its soul drain away into you(DCO - STARBUCKS STYLE DEATH/SOULSUCK) before exploding and crumpling into a pile of bones.  The music switches away from combat immediately instead of playing forever(EMO - INTELLIGENT COMBAT MUSIC).\r<br />That story, and the many, many, MANY variations on it, can be found in EGO.  The mods are all meant to work together, so use them that way.\r<br />\r<br />&#34;Everybody says scripted mods are bad for your game.  AND WTF THERE&#39;S LIKE 900 SCRIPTS IN HERE&#33;  IS THIS A VIRUS??&#34;\r<br />Stop listening to random people on the internet.  They are wrong and are almost never 20 year old women just looking for a good time with a random stranger on the internet.  Scripts are simply an aspect of how Skyrim is coded.  The vanilla game uses thousands of scripts to do everything from fire spells to being your perks to making quests go.  Hell, even the FIREBOLT spell has 2 scripts attached to it.  The reason why people are superstitious about scripts is because they come with two drawbacks: a) removing or changing a script while it is running can cause awfulness under certain conditions and b) scripts are more powerful, and allow the modder to access lower level functions and work with them on a larger basis than they can from an esp.  If the modder breaks something in the script, it does have the potential to demolish Skyrim.  A) is not a problem if you exercise best modding practices such as using a new game when you install a new mod, or upgrade CWO, for example.  B) is not a problem if you trust the modder&#39;s skill to be above the level of complexity of what he or she is coding.  Now please, stop listening to random people on the internet.  Bad things could happen to you as a result.\r<br />\r<br />[center][youtube]g5zpFCEQw_Y[/youtube][/center]\r<br />\r<br />&#34;Your description sucks.&#34;\r<br />Why do you care so much?  Let me have my weird descriptions.  You get EGO in return, mang.\r<br />\r<br />Why are all the guards attacking me now?  WHAT HAVE YOU DONE TO ME????&#34;\r<br />That is a feature of the civil war overhaul.  After the first siege of Whiterun, the guards in holds your faction does not own will be hostile toward you. All enemy soldiers will be hostile to you as well. Let me say this again because I get a lot of questions about this: HALF OF SKYRIM WILL BE HOSTILE TO YOU. THIS INCLUDES CITY GUARDS IN HOLDS YOU DO NOT OWN. THE ONLY WAY TO STOP THEM FROM BEING HOSTILE IS TO DISGUISE YOURSELF IN THE OTHER SIDE&#39;S ARMOR, OR TO TAKE THE HOLD FOR YOURSELF. For example, if I am an imperial, I can&#39;t walk into Windhelm without causing every city guard to attack me there unless I put on stormcloak armor, or until I finish the civil war.\r<br />\r<br />&#34;Do I REALLY need to use a new game?  C&#39;mon man, my character did X and is different because X and I know what I&#39;m doing&#33;&#34;\r<br />Yes.  There is no way around this.  These mods, while very limited in scope, reach to unfathomable depths of your Skyrim and start playing with things that neither God nor Bethesda EVER intended.  You can go ahead and TRY, but TELL ME ahead of time so I know what I&#39;m working with.  I will put it to you this way, EVERY time I go through the civil war(for example to TEST what I&#39;ve done - I HAVE TO DO THIS A LOT IS WHAT I&#39;M SAYING) I start a new game.  From the very start.  As in, I click the button that says &#39;New Game&#39;.  And then I ride in the cart.  Don&#39;t complain about the new game requirement, I have done it infinitely more times than you have.\r<br />\r<br />&#34;I opened up my Papyrus log to diagnose an issue I&#39;m having, and EGO mods are all over that thing&#33;  YOU TRICKED ME.&#34;\r<br />CLOSE THE PAPYRUS LOG AND BACK AWAY.  SLOWLY.  The average user will not be able to use their papyrus log to tell them ANYTHING.  Most papyrus errors(99.9%) are completely harmless, they only become harmful if you have the game log every error, increasing your lag.  So to prevent these issues, TURN OFF PAPYRUS LOGGING.  It&#39;s not going to tell you anything I don&#39;t already know; I DO have a papyrus log of my own, and it looks the same as yours.  And I&#39;m not afraid of it.\r<br />\r<br />&#34;I have a question about something that you have already answered here in the description, or in the sticky in the forums.&#34;\r<br />I will hurt you.\r<br />\r<br />&#34;&#34;I&#39;m afraid to install all of your mods at once, won&#39;t that cause Skyrim to invert on itself because of all those scripts?&#34;\r<br />You have absolutely NOTHING to fear from these mods.  Though they are HEAVILY scripted, they are generally pretty lightweight.  CWO is the only mod that can mess up your game, and then the worst thing that could possibly happen to you is you have to end the civil war early.  It also will increase your CPU load during major sieges, but trust me, YOUR CPU CAN HANDLE IT.  THAT&#39;S IT.  DCO doesn&#39;t cause script lag - my team and I like to spawn 200 dragons at once to see if DCO can take it.  It can.  FIO will only cause framerate lag if you build a bunch of igloos, and the fre has a low impact even when a MASSIVE fire is burning(because I am awesome).  CDO and IIO entail absolutely ZERO performance hit.\r<br />\r<br />&#34;Why is it that the other side spawns infinitely in a civil war siege?  Now you&#39;re just trying to make me hate you.&#34;\r<br />The spawns are not infinite, nor should they ever be.  I explicitly removed the infinite spawn functionality from the relevant quests, so it&#39;s not even possible.  It may FEEL like they have infinite reinforcements if the other side had a high Murdermayhem score going into the battle(changing the murdermayhem score mid-battle will have no effect), but it will never be truly infinite.  That being said, if the other side has THAT many troops, take the loss, man.  If you&#39;re that hell bent on winning a battle that CWO has determined you never should have won, use a console command.  Because let&#39;s face it, you&#39;re cheating anyway.\r<br />\r<br />&#34;You keep saying you want us to mod kyrim correctly, and that if I do that I should be fine with these mods.  What can I do to run Skyrim correctly?&#34;\r<br />I will make you a checklist.  If at any time you don&#39;t know what something is, LOOK IT UP.  Do all of these things, and while I can&#39;t guarantee you won&#39;t have issues, this will solve 99% of your problems.\r<br />1. Do you have SKSE?\r<br />2. Do you have SkyUI?\r<br />3. Do you have the Unofficial Patches?\r<br />4. Do you have SSME or the latest SKSE alpha build?\r<br />5. Did you run BOSS?\r<br />6. Did you manually sort your load order after running BOSS for optimum awesome?\r<br />7. Are your ini files modified?\r<br />8. Get rid of your modified ini files if you don&#39;t know what you are doing. YES. THIS MEANS YOU. NO, NOT THE GUY BEHIND YOU. YOU. THE PERSON READING THIS RIGHT NOW. YOU ARE NOT SPECIAL.\r<br />9. SERIOUSLY, DON&#39;T MOD YOUR INI FILES IF YOU DON&#39;T KNOW WHAT YOU ARE DOING. YOU PROBABLY DON&#39;T. AGAIN, I AM VERY CLEARLY TALKING TO YOU.\r<br />10. 99% of ini &#34;tweaks&#34; posted online WILL BREAK YOUR GAME. ARE YOU SURE YOU ARE RUNNING ON UNMODIFIED INIS?\r<br />11. Are you using a framerate limiter? It&#39;s usually a good idea.\r<br />12. Did you make sure not to install so many graphical overhauls that your computer goes supernova?\r<br />13. If you have modified your uGridsToLoad, ARE YOU USING Stable UgridsToLoad?\r<br />14. ARE YOU USING A NEW GAME?\r<br />15. Are you using ENBoost?\r<br />16. Did you check your issue against the EGO bug tracker AND the FAQ?\r<br />\r<br />Do all of these things and Skyrim will run MUCH better.\r<br />\r<br />&#34;Yeah, but mods this crazy HAVE to conflict with stuff, right?  They definitely can&#39;t play well with others.&#34;\r<br />[url=http://forums.nexusmods.com/index.php?/topic/1558513-apollos-load-order/]Here is a link to my current load order.[/url]  I guarantee it works fine like wine.  Mods don&#39;t generally conflict with EGO except in extremely rare circumstances, and when they do, I post it to the bug tracker.\r<br />\r<br />&#34;I heard from a random guy on the internet that your mods are buggy and they destroy savegames, and they don&#39;t tip their waitresses, and they break hearts, and they cause cancer.&#34;\r<br />You lost me at &#39;random dude on the internet&#39;.  The mods are safe, Janice.  The worst things that EGO will do to you I have mentioned in the bug tracker.  Any other issues you have have absolutely nothing to do with these mods, and if you try to blame me for your mistakes you will just see me laugh like a little girl and skip merrily off into the sunset.\r<br />\r<br />\r<br />[img]http://s2.quickmeme.com/img/df/dfff86447aac2fe476e75922407c0cc514c5c4799ec14e6d21759a24f8c29b4b.jpg[/img]\r<br />\r<br />\r<br />&#34;Didn&#39;t you just alienate half your fanbase by calling them stupid?&#34;\r<br />They didn&#39;t read this far.\r<br />\r<br />\r<br />\r<br />[b][size=5]TIPS AND TRICKS SO YOU DON&#39;T DIE ALL THE TIME[/size][/b]\r<br />\r<br />Regarding Dragons:\r<br />Yeah, they&#39;re a lot harder now, but if you know what to expect, you know to prepare for it.  For example, now dragons won&#39;t take off predictably - sometimes they&#39;ll jump into a hover and breathe on you right then.  So be ready for that.  At some point they&#39;ll limit break, so when their health is in the limit break range, have cover or become ethereal or epic potions and scrolls ready, because YOU WILL NEED IT.  When it comes to ragdoll effects, BLOCK BLOCK BLOCK.  That will stop your ragdolling.  Dragons are still predictable on the ground, so it&#39;s pretty rare that you&#39;ll get knocked down if you have a twitchy block finger.  Also, be of the right mindset when playing this - if you get hit with the one in a million situation where you&#39;re fighting a high level dragon, it calls an ICBM for a limit break, then calls 3 reinforcements, which then each call reinforcements of their own, all limit breaking and generally killing everything in a 4 mile radius in moments....maybe you weren&#39;t supposed to win this one.  Think of it this way, you didn&#39;t kill Alduin fast enough and the world ended.  :D\r<br />\r<br />Regarding Dragon Assaults:\r<br />RUN.  GET THE F OUT OF THERE.\r<br />\r<br />Seriously?\r<br />YES.  RUN.\r<br />\r<br />Really?  C&#39;mon, I&#39;m the freaking Dovahk-\r<br />Aaaaand, you&#39;re dead.\r<br />\r<br />Regarding the Civil War:\r<br />Bad guys will try to kill you.  End of story.  And they are remarkably good at it now.  In one game I was doing great at the battle for whiterun, shooting bad guys from the wall I took down half their army.  Then one fateful moment when I pulled back my bow for another shot, a stormcloak rogue uncloaked behind me and slit my throat. \r<br />It&#39;s a war.  War is not pretty.  That&#39;s what you get with this mod - and some battles you were not meant to win.  Remember, CWO keeps track of how many storm cloak and imperial affiliated people die, who owns which holds, etc. etc.  If all of your squads keep dying horribly, or your cities get demolished by dragons, then you will get overwhelmed in a siege by seemingly infinite forces.  Because all your squads kept dying and your cities are in ruins.  \r<br />Play it like it&#39;s a real war, and you will do better.  I realize that CWO is a major change from vanilla skyrim(seriously, people REALLY hate losing, I can see why Bethesda left it out), but it&#39;s far more realistic and epic this way.  And besides, if your score is comparatively low, you can always go to the opposing town and WREAK TOTAL HAVOC(I personally prefer being a vampire and EATING THE TOWN), and hey&#33;  Your score will go up&#33;  BECAUSE THIS IS A WAR.\r<br />\r<br />Regarding Fire:\r<br />It burns.  Usually not so good to use in enclosed spaces, as you will quickly learn(unless you have enough fire resistance to completely negate the damage(50%)).  Watch out as well for fire traps and shock spells, they can get out of hand fast.\r<br />\r<br />Regarding Ice:\r<br />Use it to your tactical advantage, the same way Gauldur uses it in Saarthal(GOD I HATE HIM WITH IMMERSIVE CREATURES RUNNING).  Block pathways, create new ones, etc. etc.  With ice, the world is your oyster.\r<br />\r<br />Regarding Magic:\r<br />Role play your mage.  It&#39;s just that simple.  Don&#39;t burn yourself out, and don&#39;t cast spells out of your league, or be prepared to deal with the consequences.  Study hard, and then destroy EVERYTHING.\r<br />\r<br />\r<br />\r<br />[b][size=5]REVIEWS[/size][/b]\r<br />\r<br />\r<br />\r<br />\r<br />[youtube]on0_go6yzrM[/youtube]\r<br />\r<br />\r<br />\r<br />[b][size=5]HIGHLY RECOMMENDED MODS[/size][/b]\r<br />\r<br />These mods carry my highest recommendation.  They have been thoroughly tested in my game, and I guarantee they will work with all of my mods.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/336241/?]Anything by LifesToRock[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3959191/?]Anything by EnaiSiaion[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/1614960/?]Anything by 3jiou[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3841389/?]Anything by tktk1[/url]\r<br />[url=http://erkeilmods.altervista.org/skyrim/category/news/]Anything by Erkeil[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10168/?]ApachiiHair[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17802/?]Climates of Tamriel[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/1002/?]Jaysus Swords[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/18916/?]Lanterns of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24445/?]SPERG[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3222912/?]Any of Immersive Sounds[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/30947/?]Dead Body Collision[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12977/?]Immersive Patrols[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/18799/?]Radiant Potions and Poisons[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/26017/?]Destructible Bottles[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/22745/?]Footprints[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33482/?]MinimalHUD[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27644/?]Immersive Weapons[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10251/?]Silverlight Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40216/?]Stormlord Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25846/?]TERA Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33292/?]Unique Uniques[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40491/?]Revenge of the Enemies[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15599/?]Fortified Dawnstar[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17168/?]Skyrim Bigger Trees[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52019/?]Follower Commentary Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49036/?]Immersive First Person[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27043/?]ELFX[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/41634/?]DVA[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/9717/?]Better Vampires[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14353/?]Improved Dragon Shouts[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10906/?]Dance of Death[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15524/?]AFT[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/13268/?]WATER[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19718/?]Bloody Facials[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/60/?]Enhanced Blood[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17214/?]No Spinning Death Animation[/url]\r<br />\r<br />We will always remember our fallen brother, Cabbage in a Pot.  Rest well, sweet prince.\r<br />\r<br />\r<br />\r<br />[b][size=5]GLOWING TESTIMONIALS[/size][/b]\r<br />\r<br />&#34;You have no life.&#34; - my old roommate\r<br />\r<br />&#34;Why do you make videos for your mods?  Nobody CARES.  WHY ARE YOU STILL PLAYING SKYRIM???&#34; - my old roommate again, he&#39;s a jerk\r<br />\r<br />&#34;Is this compatible with Animated Prostitution?&#34; - Internet people who I am now convinced are INTENSELY curious about what it would look like to see my fist go through my computer screen.\r<br />\r<br />&#34;Apollo Down&#39;s mod descriptions should explain any other odd behavior. What&#39;s going on here is that while modding Skyrim he encountered Sheogorath who offered him the location of the lost civil war in return for his sanity. Apollo Down accepted on the condition that he would be an eccentric sociopath instead of a pancreas devouring psychopath. Each time the nexus files are hidden he has found another Black Book, he&#39;s down in the infinite library right now.&#34; - Nathan C., explaining my creative process\r<br />\r<br />&#34;Blatant racism.&#34; - other internet people who don&#39;t understand the concepts of tolerance or relevance.\r<br />\r<br />&#34;This isn&#39;t lore-friendly.&#34; - even more internet people who somehow know more about the game than I do when I&#39;m probably the only person on the planet who has ever read the entirety of the relevant scripts, INCLUDING THE GUYS AT BETHESDA.\r<br />\r<br />&#34;The author is a bit of a dick in the sense that he is going to let you fly his jet, but he assumes you know how to fly a Cessna already. But you actually never have flown a Cessna. So since you don&#39;t know how to fly a Cessna, he doesn&#39;t have time to baby sit you.&#34; - Papakapp, being accurate\r<br />\r<br />\r<br />\r<br />[b][size=5]SHAMELESS ADVERTISING FOR MY FRIENDS[/size][/b]\r<br />\r<br />Millions of pageviews, guys; I gotta do something with it.  Help me make these guys famous.\r<br />\r<br />\r<br />[center][i][size=6][color=red]Driver Friendly&#33;[/color][/size]\r<br />(Screaming and taking off your bra is optional, but recommended)[/i]\r<br />\r<br />[youtube]frG99Ar34zI[/youtube][/center]",
  "categoryId": "79",
  "version": "3.05",
  "author": "ApolloDown",
  "createdUnix": "1396050386",
  "updatedUnix": "1422052400",
  "containsAdultContent": false,
  "uploadedBy": "Apollodown",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144266",
      "name": "Epic Gameplay Overhaul",
      "version": "3.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6149",
      "fileName": "Epic Gameplay Overhaul-52487-3-05.7z",
      "uploadedUnix": "1422052400",
      "modVersion": "3.05",
      "virusScanUrl": "https://www.virustotal.com/file/25215833f89f8c4a85cdd493edc3d838c35b01ed25cb041851d97ef1e8d56c83/analysis/1422052446/",
      "changelogHtml": " DCO has been upgraded to FINAL.3 <br/> \n CWO has been upgraded to 4.03 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Gameplay%20Overhaul-52487-3-05.7z?fid=1000144266&ttl=1535835535&ri=8192&rs=8192&setec=8493647cd2f45cc56689e86340c0cc0b"
    }
  ]
}