{
  "modId": 52496.0,
  "modName": "Sasuke Uchiha HairStyle",
  "summary": "Sasuke Uchiha&#39;s hairstyle ",
  "descriptionHtml": "I had this hair model made privately a few years ago for a Naruto mod I was going to be making. However, I stopped production on it due to being bored of Skyrim. I recently re-installed the game and found I still had these files on my backup drive. I turned it into a seperate hair style mod and figured I&#39;d share it for others to use. The hair style does not replace any others, it is it&#39;s own entity.\r<br />\r<br />Install: \r<br />Note: I have uploaded a &#39;Nexus Mod Manager&#39; version. However, I haven&#39;t fully tested this to see if it works as I&#39;m currently pretty busy. If people that download it could confirm it&#39;s usability in the comments it would be appreciated.\r<br />\r<br /> (Apparently it installs fine via mod manager) This is not mod manager friendly, I&#39;ll probably release a mod manager version soon. As I don&#39;t use mod manager though I will have to look into how this is done (I&#39;ve forgotten). To install this manually simply extract the content of the zip file into your Skyrim&#39;s Data folder and then check the plugin in whichever way you usually activate a plugin.\r<br />\r<br />Notes:\r<br />\r<br />1) The hair should work on both male and females as I set it to Unisex (It did show on females when I tried it in character creation). All vanilla colors should be available.\r<br />\r<br />2)This has been made with the latest update which should be 1.9.32.0.8, so make sure you have that update or stuff may get fuzzed up.\r<br />\r<br />3) There will be no further updates to this mod, it comes as it is (unless there&#39;s some kind of game breaking bug, which I doubt).\r<br />\r<br />4) Don&#39;t worry about endorsing. ;)\r<br />\r<br />5) Compatibility: As this is it&#39;s own thing there shouldn&#39;t be any conflict problems.\r<br />\r<br />6) I won&#39;t be disclosing who made the hair model as it was a commissioned (paid) job, so please don&#39;t ask. I don&#39;t want to give the persons name out for them then to then get spammed with requests for private stuff. The person knows who they are and if they want me to put their name in the description feel free to message me. :)\r<br />\r<br />7) What armor am I using in the screenshots?\r<br />\r<br />The armor is called &#39;Apotheus Light Armor&#39;. You can find it on it&#39;s own from the original creator via this link: http://www.nexusmods.com/skyrim/mods/19501/?\r<br />\r<br />P.S. It&#39;s also apart of the &#39;Immersive Armor&#39; pack, found here: http://www.nexusmods.com/skyrim/mods/19733/?\r<br />\r<br />7) What Texture mod do you use for the face?\r<br />\r<br />The texture mod I use for the faces can be found here: http://www.nexusmods.com/skyrim/mods/2488/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D2488&pUp=1\r<br />\r<br />The file you want to download is called: Faces - YoungerGeonoxFacesWithoutBeard\r<br />\r<br />\r<br />Updated Information: 11/02/2015\r<br />I&#39;ve had a few messages asking if this can be used in other peoples mods. Yes it can, use it as you wish. I&#39;ve updated the permission areas. No credit is needed all I would ask is that you link to this page, so people can download it seperately if they wish. However, it&#39;s not obligatory to do so.",
  "categoryId": "26",
  "version": "1.0",
  "author": "Me",
  "createdUnix": "1396039832",
  "updatedUnix": "1397326913",
  "containsAdultContent": false,
  "uploadedBy": "Seekirus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102768",
      "name": "SasukeHair",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1757",
      "fileName": "SasukeHair-52496-1-0.zip",
      "uploadedUnix": "1396039803",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/893173c2027a4b79b5b4b849d27b0f9caecec5e5ef74b27f8afb36f0497b2904/analysis/1407998472/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SasukeHair-52496-1-0.zip?fid=1000102768&ttl=1535835547&ri=8192&rs=8192&setec=1738975c99e03b64baae7f9161bcd50d"
    },
    {
      "fileId": "1000104686",
      "name": "SasukeHair NMM",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1757",
      "fileName": "SasukeHair NMM-52496-1-0.zip",
      "uploadedUnix": "1397326913",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/19de75306be2b35d94aac295ef66127d88f15795f1f7932f002cca388d484819/analysis/1408017566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SasukeHair%20NMM-52496-1-0.zip?fid=1000104686&ttl=1535835548&ri=8192&rs=8192&setec=f4f297fe62ba07f9f344a14617640342"
    }
  ]
}