{
  "modId": 52492.0,
  "modName": "Vampire Armor Set with Deathbrand Stats",
  "summary": "A new vampire armor set that has the same AC as the Deathbrand set from Dragonborn.",
  "descriptionHtml": "I was disappointed that the vampire royal armor from Dawnguard was so weak. I thought that it should at least be comparable to the Dawnguard&#39;s armor, but it&#39;s not. So, I changed it. Simply press ~ and type &#34;player.additem (FORMID) (NUMBER)&#34; without quotes, replacing (FORMID) with the form ID and (NUMBER) with the quantity you desire. The &#34;xx&#34; part of the form ID depends on your load order; if you load this mod after Skyrim, Update.esm, and Dawnguard, then &#34;xx&#34; would be &#34;03&#34;, for example.\r<br />\r<br />For those who don&#39;t have Dragonborn, the Deathbrand armor is an ancient armor set that is more powerful even than Daedric armor because it has a unique +100 bonus to armor when the entire set is worn. I liked the insane armor rating, obviously, but I liked how the vampire armor looked. Besides, a vampire clan that has survived for millennia should have some extremely good armor, instead of something that is more flimsy than scaled armor. \r<br />\r<br />Below, I&#39;ve listed what I&#39;ve changed.\r<br />\r<br />Vampire Gauntlets\r<br />FormID:xx002F9B\r<br />AC: 11.5 (same as Deathbrand)\r<br />\r<br />Vampire Royal Armor\r<br />FormID:xx002F9A\r<br />AC: 155.5 (Deathbrand cuirass, special bonus, and helmet stats combined)\r<br />\r<br />Vampire Boots\r<br />FormID:xx002F9D\r<br />AC: 11.5 (Same as Deathbrand)\r<br />\r<br />Note: Obviously, this will be extremely overpowered if you use ANY helmet. I also chose not to enchant any item other than the Royal Armor, which grants a 125% increase in Magicka regeneration. I only intended to make essentially a Vampire Armor copy with Deathbrand Armor stats.\r<br />\r<br />OTHER MODS I RECOMMEND (these were used in my screenshots):\r<br />Skyrim HD- makes everything beautiful, if your computer can handle it.\r<br />\r<br />Dawnguard Fortress Improved High Resolution 2K and Castle Volkihar HD Retexture by HXP- makes Fort Dawnguard and Castle Volkihar look much better.\r<br />\r<br />Xenius Character Enhancement and XCE-Dawnguard by Xenius- makes faces MUCH better. The Dawnguard version even lets you get the &#34;batlike&#34; appearance of NPC vampires (wrinkled nose, higher brow, etc).\r<br />\r<br />\r<br />Feel free to comment and suggest other things for me to do, but I&#39;m still a novice modder. I may not make anything new soon, and my real life will be my priority for now.",
  "categoryId": "54",
  "version": "1.00",
  "author": "reapthesystem",
  "createdUnix": "1396028700",
  "updatedUnix": "1396028665",
  "containsAdultContent": false,
  "uploadedBy": "reapthesystem",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000102751",
      "name": "VampireArmorChanges",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "VampireArmorChanges-52492-1-00.7z",
      "uploadedUnix": "1396028665",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/6a61943e7abd9e3c90f59fafd7871ba82410d21e950d7b8d6b11a707efe953ed/analysis/1407998342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VampireArmorChanges-52492-1-00.7z?fid=1000102751&ttl=1535835542&ri=8192&rs=8192&setec=f00b553e1eddc3152babbea8287fa8ee"
    }
  ]
}