{
  "modId": 5253.0,
  "modName": "Confidence-Man ENB",
  "summary": "An all-new custom profile for Boris Vorontsov\\'s ENBSeries graphical enhancement. ",
  "descriptionHtml": "This is an all-new preset for ENB graphical enhancement. \r\n\r\nIf you\\'re not familiar with Boris Vorontsov\\'s ENBSeries, visit http://enbdev.com/ or http://www.skyrimnexus.com/downloads/file.php?id=2971\r\n\r\nNOTE: This download does not contain the required d3d9.dll file. Download it here: http://enbdev.com/mod_tesskyrim_v0102.htm \r\n\r\n\r\n[b]-TO INSTALL-[/b]\r\n\r\nFirst download the source files: http://enbdev.com/mod_tesskyrim_v0102.htm, copy over only the d3d9.dll and place in your skyrim directory where TESV.exe is.\r\n\r\nNext extract all files from the config to the same location. To uninstall, just delete them:\r\n\r\nd3d9.dll\r\nenbbloom.fx\r\nenbeffect.fx\r\nenbprepass.fx\r\nenbpalette.bmp\r\nenbseries.ini\r\neffect.txt\r\n\r\nKeep in mind if you download with Nexus Mod Manager it won\\'t put the files in the right place. It will still track versions I suppose so I re-enabled NMM downloads for 1.4 plus some people wouldn\\'t even download without it. \r\n\r\n[b]NOTE[/b] - Be sure to set bFloatPointRenderTarget to 1 in your SkyrimPrefs.ini (in Documents directory)! If your game looks like you\\'re walking on the surface of the sun this may be the reason (the mod is very bright in the daytime in clear weather to begin with.) \r\n\r\n[b]-VERSION NOTES-[/b]\r\n\r\n- Brighter nights (still dark compared to vanilla).\r\n- Glowing blue water/first-person models/smoke etc.. at night is largely gone.\r\n- Skies are improved to give a more atmospheric dawn and dusk.\r\n- New settings in enbeffect.fx to control postprocessing values separately for day and night.\r\n- Added a slight film grain effect through the effect.txt file.\r\n- Includes Matso\\'s depth of field effects in enbprepasseffect.fx, modified for more subtlety.  \r\n- Also included is an optional texture that reduces the brightness of river water foam at night (it\\'s tied to fire intensity, and my fire is pretty intense at night ;)  \r\n- Indirect Lighting is disabled by default, I use it myself but most probably won\\'t want the performance hit it brings.\r\n- Anisotropic Filtering is also disabled by default, if you\\'ve been using it through ENB just reenable it in enbseries.ini. \r\n\r\n[b]-TROUBLESHOOTING & TWEAKING-[/b]\r\n\r\nIt\\'s too bright! - In general days are very bright, if you want it less bright lower the relevant settings in enbseries.ini under ENVIRONMENT, specifically DirectLightingIntensityDay, DirectLightingCurveDay, and AmbientLightingIntensityDay. Direct lighting values affect the light from the sun, ambient values affect the overall amount of light (it will affect areas not lit by direct light, shadowed areas for example). Try setting the values to 1.0 and go up from there incrementally. It\\'s worth making sure your fGamma setting in SkyrimPrefs.ini is set to 1.0 as well. \r\n\r\nNo, I mean BRIGHT bright! - Double check your bFloatPointRender value is set to 1 in SkyrimPrefs.ini in your Documents directory, if you still get a super-overexposed look as some have been I\\'m still trying to figure out what the issue is. Until then I would suggest doing what I described above with lighting values and see if that doesn\\'t help. \r\n\r\nNights are too dark! - Increase the DirectLightingIntensityNight and AmbientLightingIntensityNight values. If you want light sources like fires, torches, etc... to be brighter (or darker), adjust the PointLightingIntensity values. Dungeons and interiors are controlled by Ambient and Point lighting night values, so keep in mind whatever changes you make to those kinds of night lighting will affect interiors as well. \r\n\r\nIt\\'s too colorful! - You can either decrease the saturation of different kinds of lights independently or reduce the overall saturation. Each lighting type under ENVIRONMENT has it\\'s own desaturation value, raise the value to desaturate (0 is no desaturation, 1.0 is max). You can also adjust the saturation by lowering the EColorSaturationV2 value, a global variable located in the enbeffect.fx file under POSTPROCESS 2. \r\n\r\nI get CTDs! - There could be a number of reasons for this, mostly beyond my ability or knowledge to resolve. Try disabling MSI Afterburner, Xfire, or EVGA tools if you use them, or look through here and maybe ask Boris: http://www.thenexusforums.com/index.php?showtopic=489986\r\n\r\nIt runs like crap! - This is likely because of SSAO being enabled, there are some things you can do to make it run better though. In enbseries.ini try change the SamplingQuality and FilterQuality values to 2 (2 is the lowest setting, 0 the highest), change SizeScale and SourceTextureScale to 0.35, and set UseIndirectLighting to false. Also, if you\\'re running AF through the game or through your card\\'s drivers, disable it and use the AF setting in the enbseries.ini instead (it\\'s on by default in the SSAO enabled version).\r\n\r\nNo NMM download? - NMM wasn\\'t installing properly, people were enabling the mod and nothing would happen. Maybe because it doesn\\'t go in the Data file? I don\\'t know, but for now just download manually and extract to your skyrim folder. It isn\\'t hard. \r\n\r\nIt doesn\\'t look like your screenshots! - I use SSAO along with some ini changes I described above (pretty conservative changes, all things considered). Beyond that the only mods I\\'m using are texture mods; Skyrim HD 2k textures for the ground outside, Enhanced Distant Terrain, Enhanced Night Sky, Farmhouse and Village HD textures, and a HD rock texture that I don\\'t recall the name of. Slight differences in color or brightness could just come down to different displays and how they\\'re calibrated. Using the adjustments I described above you should be able to tweak it until it looks the same or similar, or even tweak it so it looks completely different if you like. \r\n\r\nHow do I use a FXAA injector with this? - It\\'s very simple. First you rename the d3d9.dll used for the injector (d3d9FXAA.dll, for example), then in enbseries.ini set the EnableProxyLibrary value to true, and after ProxyLibrary replace other_d3d9.dll with the renamed .dll\r\n\r\nKnown ENB bugs - Night-eye doesn\\'t work, bright water/smoke/fog at night, SSAO makes water and smoke/fog semi-transparent, inclement weather can cause things to get very dark. \r\n\r\n\r\n\r\n",
  "categoryId": "62",
  "version": "1.6",
  "author": "Confidence Man",
  "createdUnix": "1325628183",
  "updatedUnix": "1325628183",
  "containsAdultContent": false,
  "uploadedBy": "Confidence Man",
  "primaryFile": null,
  "files": []
}