{
  "modId": 52547.0,
  "modName": "Arrow Refining - Vanilla",
  "summary": "Allows for the refining of arrows at the forge from Fine up to Legendary.",
  "descriptionHtml": "Version: 0.1\r<br />\r<br />Changelog:\r<br />V0.1:\r<br />-Incorporates the existing bug-fixes from Arrow And Bolt Refining - Dawnguard and Dragonborn Version 0.3 along with a reverse daedric billet crafting recipe to create ebony ingots.\r<br />\r<br />Allows for the tempering of Fine, Superior, Exquisite, Flawless, Epic and Legendary versions of each of the arrows available at the forge. Each arrow is tempered using billets of materials used to temper the armour and weapons of the same type and not have left arrows remaining. The levels that can be crafted is dependent on the archery skill you have and what perks you have unlocked for each type of arrow in the Smithing skill tree. \r<br />\r<br />Vanilla: \r<br />Ancient Nord (Steel smithing needed) \r<br />Daedric (Daedric smithing needed) \r<br />Dwarven (Dwarven smithing needed) \r<br />Ebony (Ebony smthing needed) \r<br />Elven (Elven smithing needed) \r<br />Falmer (Elven smithing needed, uses chitin scales) \r<br />Forsworn (Steel smithing needed) \r<br />Glass (Glass smithing needed) \r<br />iron (No smthing perks needed) \r<br />Nord Hero (crafted from the equivalent Ancient Nord equivalents at the Skyforge upon completing the Companion&#39;s Quests storyline, as per the other Nord Hero weapons and armour, also upgradeable at the Skyforge from lower spec arrows) \r<br />Orcish (Orcish smithing needed) \r<br />Steel (Steel smithing needed) \r<br />\r<br />Archery skill needed: \r<br />Fine - 25 \r<br />Superior - 40 \r<br />Exquisite - 55 \r<br />Flawless - 70 \r<br />Epic - 85 \r<br />Legendary - 100 \r<br />\r<br />Damage increases: \r<br />Fine - +1 \r<br />Superior - +3 \r<br />Exquisite - +5 \r<br />Flawless - +7 \r<br />Epic - +8 \r<br />Legendary - +10 \r<br />\r<br />Value increases: \r<br />Fine - 15% \r<br />Superior - 30% \r<br />Exquisite - 50% \r<br />Flawless - 65% \r<br />Epic - 82% \r<br />Legendary - 100% \r<br />\r<br />Both damage and value increases are in line with the weapon tempering equivalent levels. Did not want to create ridiculously overpowered arrows, just wanted to keep things nice and simple for the timebeing and not break immersion. \r<br />\r<br />Planned changes:\r<br />-Replacement of the billets with arrowheads for each type of arrow, craftable at the forge.\r<br />-A fletching table to craft the upgrades at instead of the forge and reduce the clutter in the forge menu\r<br />\r<br />Possible changes:\r<br />-Possible Dawnguard only and Dragonborn only versions of this mod, subject to demand and time constraints. Would run independent of this mod as a modular approach.\r<br />-Possible additional levels to reflect the smithing skill beyond 100 using enchantments and alchemy. Current possible titles include Mastered, Perfected and Timeless. \r<br />-Archery skill may also be revised to match the smithing skill requirements for tempering of weapons and armour of the same material type with the perk unlocked, as the perks are required to craft them anyway. \r<br />\r<br />-Notes: This is the vanilla only version of the Arrow and Bolt Refining - Dawnguard and Dragonborn Version mod. The proposed future arrowhead upgrade method will be more legally sound for this version, as I am uncertain as to the use of modified DLC content for the DLC version of this mod.\r<br />\r<br />Feedback welcomed.",
  "categoryId": "55",
  "version": "0.1",
  "author": "Notanon81",
  "createdUnix": "1396195401",
  "updatedUnix": "1396195377",
  "containsAdultContent": false,
  "uploadedBy": "Notanon81",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000103027",
      "name": "Arrow Refining - Vanilla",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1774",
      "fileName": "Arrow Refining - Vanilla-52547-0-1.zip",
      "uploadedUnix": "1396195377",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/945242c561679ab7784f4b523ad8b2a2e7a96fcda85d820e3286c89713b0a8dd/analysis/1408000853/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arrow%20Refining%20-%20Vanilla-52547-0-1.zip?fid=1000103027&ttl=1535835626&ri=8192&rs=8192&setec=21edd63c59852f4423bf56d6ac8f87f8"
    }
  ]
}