{
  "modId": 52627.0,
  "modName": "Mixed Unit tactics - deutsch",
  "summary": "Die deutsche Übersetzung von &#34;Mixed Unit Tactics&#34; - komplette Ingame-Übersetzung.",
  "descriptionHtml": "[center]---[This is merely a translation of the Mod made from flexcreator into German language. You need to download the original mod in order to use this translation.]---[/center]\r<br />\r<br />\r<br />\r<br />Bürgerkrieg und Drachenangriffe. In dieser Zeit tut sich ein Held auf, der die Welt vor dem aufkommenden Bösen retten möchte. Der mit all seiner Kraft und seiner besonderen Gabe, der Stimme, wieder Frieden und Ordnung in die Welt bringen möchte... und all das ganz alleine&#33;? Sollte das mächtige und berühmte Drachenblut wirklich all seine Abenteuer mutterseelenallein mit einem einzigen Kameraden verbringen? Oder sollte dieser Held nicht viel eher eine eigene Armee auf die Beine stellen und ganz Himmelsrand unter seiner Hand einen?\r<br />Diese Erweiterung macht endlich Schluss mit der unsinnigen Begrenzung, dass man nur einen Begleiter haben kann. Ob eine Armee aus Söldnern, oder eine Truppe der besten Kameraden, mit &#34;Mixed Unit Tactics&#34; ist man endlich in der Lage, seine eigene Kampftruppe aufzustellen, zu organisieren und in die Schlacht zu führen.\r<br />Kompatibel mit allen bisher bekannten Begleiter-Mods ist diese Erweiterung eine sehr gute Gelegenheit, sein militärisches und strategisches Geschick unter Beweis zu stellen.\r<br />\r<br />-\r<br />\r<br />Dieser Mod wurde ursprünglich von flexcreator erstellt. Meine Leistung war lediglich, ihn ins deutsche zu übersetzen.\r<br />\r<br />Um diese Übersetzung zu benutzen muss zunächst unbedingt der &#34;Mixed Unit Tactics&#34;-Mod von flexcreator installiert sein. Zu finden ist er hier:\r<br />[url=http://www.nexusmods.com/skyrim/mods/30578/?]http://www.nexusmods.com/skyrim/mods/30578/?[/url]\r<br />\r<br />-\r<br />\r<br />[b]Installation:[/b]\r<br />1.) Zuerst den &#34;Mixed Unit Tactics - Form an army of followers - Skyrim meets RTS&#34; von flexcreator herunterladen und nach der dort gegebenen Anleitung installieren.\r<br />2.) Die Dateien aus diesem Download in das Installationsverzeichnis (in der Regel steamsteamappscommonSkyrimData) verschieben und die alte Datei überschreiben.\r<br />3.) Den Mod aktivieren und Spaß haben :-)\r<br />\r<br />-\r<br />\r<br />[color=red][b]Anmerkung:[/b][/color]\r<br />Ich habe auch in diesem Mod viel Arbeit und Aufwand gesteckt und ihn mit großer Sorgfalt übersetzt. Wegen seinem Umfang und den schwer zu formierenden Menüs kann es jedoch sein, dass ich vielleicht mal eine Kleinigkeit übersehen habe, oder es Formatierungs-Probleme gibt. Sollten euch also ingame irgendetwas in dieser Hinsicht auffallen, so teilt mir das bitte hier auf Skyrim-Nexus mit.\r<br />\r<br />\r<br />\r<br />[b]Schlusswort:[/b]\r<br />[b][b][size=3][color=orange]Abschließend möchte ich hier Werbung für meine neuste Übersetzung machen, nämlich für den wahnsinnig spannenden Mod &#34;[url=http://www.nexusmods.com/skyrim/mods/64283/?]Immersive Jewelry[/url]&#34;, den ich [url=http://www.nexusmods.com/skyrim/mods/66774/?]hier[/url] übersetzt habe.[/color][/size][/b][/b]\r<br />\r<br />\r<br />-\r<br />\r<br />\r<br />Credits gehen vor allem an flexcreator für seinen praktischen Mod, sowie an alle anderen Beteiligten.\r<br />\r<br />\r<br />-\r<br />\r<br />[b]Schlusswort:\r<br />Sollte Euch meine Arbeit gefallen, dann lasst mir bitte einen Kommentar da, oder klickt einmal auf &#34;endorse me&#34;. Bei genug guter Resonanz übersetze ich vielleicht wieder neue Mods.[/b]",
  "categoryId": "96",
  "version": "2.0",
  "author": "flexcreator und Verodor",
  "createdUnix": "1396451848",
  "updatedUnix": "1397935284",
  "containsAdultContent": false,
  "uploadedBy": "Verodor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105632",
      "name": "Mixed Unit tactics - deutsch v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": "Mixed Unit tactics - deutsch v2-52627-2-0.rar",
      "uploadedUnix": "1397935284",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/8731454e0abc3be6de0ab0cdb14b30d270e60fda7093549d47d3c9255ca6bfe9/analysis/1408029962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mixed%20Unit%20tactics%20-%20deutsch%20v2-52627-2-0.rar?fid=1000105632&ttl=1535835749&ri=8192&rs=8192&setec=a77052eacf1a7c57985853f8f5815e34"
    }
  ]
}