{
  "modId": 52636.0,
  "modName": "Kingdom Hearts Keyblade Wielder mod",
  "summary": "This is a mod that adds summonable Keyblades to Skyrim&#33; All meshes and textures are from scratch, and currently, I encountered a problem that broke all my textures.. But I will make new ones in the future&#33; So far, the Keyblades Kingdom Key, Oathkeeper, and Wayward Wind have been created. To obtain the spells, use &#34;help summon 0&#34; and",
  "descriptionHtml": "I originally intended to create this mod only for my private entertainment, but I noticed when looking at other Kingdom Hearts mods that a lot of you have been searching for one with summonable keyblades. Please give me feed back, although not too harshly since this is my very first mod. I created this page for anyone who doesn&#39;t use steam for their mods. Its my dream to become an animator for Disney Studios when I grow up, so constructive criticism would be nice&#33;\r<br />\r<br />And yes, my textures are currently broken, so I just added some filler textures for now until I can repair or remake some new ones. My goal is to eventually add all the keyblades in Kingdom Hearts to date, all complete with summoning spells for them.\r<br />\r<br />UPDATE (4/19/2014): New easter egg (now the nexus is up to date with my steam post, sorry for the delays&#33;) adds a new spell for funzies&#33;&#33;&#33; If you don&#39;t feel like searching for it, check out my steam post and it&#39;ll have info on the new spell in the description. And for those too lazy for even that, scroll to the bottom of the page for what to search with the help command. SPELL TOMES WERE ALSO ADDED FOR ALL THE KEYBLADE SUMMONING SPELLS WITH THE EXCEPTION OF THE EASTER EGG&#33;&#33; THEY CAN BE FOUND SITTING ON A DESK BEHIND THE MAP IN FARENGAR&#39;S DRAGONSREACH QUARTERS&#33;&#33;&#33;&#33; Hope you like it&#33; ~Rncg15\r<br />\r<br />Keyblades and stats\r<br />\r<br />Kingdom Key-no enchantments (so you can utilize elemental fury and other weapon enhancing magic), strength 12, reach 1.0, speed 1.0\r<br />\r<br />Oathkeeper-(magic steal enchantment-deleted on 4/5/2014 to boost compatibility with a keyblade wielder magic mod I&#39;m working on) adds 70 magic points to your current mp value and max cap when wielded, strength 11, reach .90, speed 1.0\r<br />\r<br />Wayward Wind-no enchantments, boosts stamina regeneration speed by 15%, strength 9, reach .75, speed 1.5\r<br />\r<br />New&#33; 4/9/2014  (sorry these came late on the nexus, I&#39;ve been a bit busy lately. Originally added these on 4/5 on steam)\r<br />\r<br />Rainfell-no enchantments, boosts magic regeneration by 20% when wielded, strength 11, reach .90, speed 1.0\r<br />\r<br />Earthshaker-no enchantments, boosts armor rating by 30 points when wielded, strength 14, reach 1.2, speed .95\r<br />\r<br />Hope you all like it&#33; ~Rncg15 (Kingdom Hearts, Keyblades, and related concepts are copyright of Square enix and Disney Interactive studios. All my weapon meshes and textures are originals made by me; this mod is purely for non-profit entertainment&#33;&#33;)\r<br />\r<br />Easter Egg: Search the term &#34;levitate&#34;",
  "categoryId": "77",
  "version": "v.05",
  "author": "Rncg15",
  "createdUnix": "1396486697",
  "updatedUnix": "1397961881",
  "containsAdultContent": false,
  "uploadedBy": "rncg15",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105687",
      "name": "KH Keyblade Wielder mod",
      "version": "v.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "832",
      "fileName": "KH Keyblade Wielder mod-52636-v-05.zip",
      "uploadedUnix": "1397961881",
      "modVersion": "v.05",
      "virusScanUrl": "https://www.virustotal.com/file/fbc1449c6c16a72c6fd1e5e00c782ce92a25feb566958a253122aa29bf746aef/analysis/1408030528/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KH%20Keyblade%20Wielder%20mod-52636-v-05.zip?fid=1000105687&ttl=1535835760&ri=8192&rs=8192&setec=8fd897e460c20edc6abcc6eaac9b821b"
    }
  ]
}