{
  "modId": 52644.0,
  "modName": "Fawn",
  "summary": "This mod is for those who have got tired from the glamorous beauties and stupid bots.\r<br />\r<br />Dared to get acquainted with Fawn Dragonborn get enough unpredictable and capricious, but a nice friend. You should be prepared&#33; You will know how it feels when You distract from the urgent cases, requests and questions&#33;  But unlike modest gir",
  "descriptionHtml": "After not too big line of quests You will be joined by the mysterious companion. I just want to say that he is not so much a child as forest spirit, like a Park or satyr. So he acts accordingly... \r<br />\r<br />You can&#39;t control him, but if you can call him. For this special ability added to you. In addition, quest marker points to him almost all the time. \r<br />\r<br />Fawn does not use the horse, as in the open air, he turns to the deer and is worn around in this form.  He is also a pacifist and not responding to monsters.  He doesn&#39;t go at caves and other strange places without special need - he don&#39;t likes to mess underfoot.\r<br />\r<br />But if the evil enemies will destroy half health from brave Dragonborn, Fawn will come and help. He is strong and invincible fighter. But if Dragonborn, will be on the edge of destruction despite such support, Fawn will carry it in a safe place, heal and... lock there for day. It&#39;s give careless hero a chance to think in silence about their mistakes...\r<br />\r<br />One of the main features of Fawn is his importunity. If You come to a city, he may consider this a reason to rest from the adventure and offer to go for a walk. He always chooses the place and always running ahead. He loves to play musical instruments in the end of the walk . Moreover, he does not want to do it alone and requires the participation of Dragonborn. However, You can try to distract his attention to food. \r<br />\r<br />As Fawn loves to beg a variety of gifts, to climb into bed when You sleep and pulling off the blanket etc. However, You do not need to wait his requests: when you find or buy an object that is interesting for him, «intuition» will remind you about it. And sometimes Fawn can thank you and give something of value. But more often, you can hear the simple thank or to receive the blessing.\r<br />\r<br />If You go to the tavern without money, he carefully will offer to earn. If You&#39;re rich, you can relax and have a dance together. By the way the people and the good spirits come to listen to the Fawn&#39;s music and watch dancing...\r<br />\r<br />If you are strong in Speech, Fawn will begin to sincerely talk to You and You will learn a lot from his life.\r<br />\r<br />I do not advise you to hurt the boy - you can run into a curse: Fawn vindictive creature.\r<br />\r<br />Mod is fully voiced and animated. Animation is standard (but if you have FNIS, it will be FNIS), voice is russian and, on the contrary, non-standard (only the subtitles translated into English - so enable it, if will try the mod). \r<br />\r<br />Behavioral events made in the form of repeatable quests that appears in the journal - so they are easier to track.\r<br />\r<br />Mod debugged and tested on pure Skyrim and on the set of more than one hundred mods. So far I have found two bugs, which failed to resolve, but they can easily be avoided:\r<br />\r<br />- after the event, with an intimate conversation, when it is fully finished, Fawn&#39;s dialogues may disappear. You should sit and wait, when he is going to go talk with you. If You have already managed to start another event, you will have to complete through the console and then still to sit and wait until Fawn speak with you.\r<br />\r<br />- sometimes while walking Fawn is sticking. In this case, go to the marker destination on the map and call a stubborn person there - this will surely cure the problem.\r<br />\r<br />And if Fawn will gather you dwarven bot, don&#39;t forget to start it after each fight, or he will die out and get lost.\r<br />\r<br />A few words about the translation:\r<br />\r<br />As you have noticed, my English is not the best. So I did not translate, poetic passages and books, because their understanding is not important for interaction with Fawn. But I believe that people who have something to say can always understand each other. And I will do everything in my power to help you understand my mod.\r<br />\r<br />With hope for mutual understanding 33krok.\r<br />\r<br />P.S. Fawn does not use the companion slot\r<br />\r<br />----------------------------------\r<br />Added a small edit from UlithiumDragon (fix bug with Russian names in the English version and a bit in translation). Just replace the old .esp \r<br />",
  "categoryId": "66",
  "version": "1.0R2",
  "author": "33krok",
  "createdUnix": "1396553063",
  "updatedUnix": "1396699210",
  "containsAdultContent": false,
  "uploadedBy": "33krok",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000103574",
      "name": "FawnEngSub",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "332735",
      "fileName": "FawnEngSub-52644-1-0.zip",
      "uploadedUnix": "1396549584",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FawnEngSub-52644-1-0.zip?fid=1000103574&ttl=1535835773&ri=8192&rs=8192&setec=c2935e79d1ee922b99d9788eef926333"
    },
    {
      "fileId": "1000103728",
      "name": "FawnEngSubSm_small_bug_fix_by_UlithiumDragon",
      "version": "1.0R2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "81",
      "fileName": "FawnEngSubSm_small_bug_fix_by_UlithiumDragon-52644-1-0R2.7z",
      "uploadedUnix": "1396699210",
      "modVersion": "1.0R2",
      "virusScanUrl": "https://www.virustotal.com/file/cbb0d2ef109e0981217bb08d971d9435a14076db9e9491f304a87c7ef8160f68/analysis/1408007874/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FawnEngSubSm_small_bug_fix_by_UlithiumDragon-52644-1-0R2.7z?fid=1000103728&ttl=1535835773&ri=8192&rs=8192&setec=e757307727cbda4b4186a518538ab2b0"
    }
  ]
}