{
  "modId": 5268.0,
  "modName": "Super Revealing Elven Armor for CBBEv2 Females",
  "summary": "A super revealing female elven armor set for the CBBEv2 body mod. ",
  "descriptionHtml": "Updated 17:22 1/4/12: The new file contains all the weapon colors corrected to match the armor.\r\n\r\nAs requested here is my female elven armor mod for CBBEv2 bodies. In the rush to get it uploaded, some of the weapons have not been included etc. Someone else posted something similar and took it across the brow so I didn\\'t take the time to \\\"do the rest\\\" yet. If everything goes well, it won\\'t take long to finish up the weapon set and I\\'ll post them up. :-)\r\n\r\nWarning:\r\n\r\nNexus Forum Rules: \\\"Don\\'t like it? Don\\'t use it, but pass in silence.\\\"\r\n\r\nCredits:\r\n\r\nCaliente and Aknot for the original body mods.\r\nKiller Keos for the skimpy version I based this mod on. He indirectly gave me the idea.\r\nThe full body tattoo mods are my own and listed for download on Nexus.  \r\n\r\nNotes: \r\n\r\nFor use with the normal and silly huge CBBEv2 mod.\r\n\r\nThe meshes contained in this file came from Killer Keos\\' version of elven armor. Well, I\\'m pretty sure they are Keos\\'. In the process of modding the game, I\\'ve hacked up so many files together trying out different things I get confused on what belongs to who and what\\'s original from the bsa files. Still, I try to give credit where it\\'s due.\r\n\r\nThe _1.nif\\'s are the \\\"silly huge\\\" version, so if you don\\'t like this, you should be able to switch them out for the \\\"normal\\\" version using Keos\\' meshes from his elven armor upload. All I\\'ve really done here is strip out most of the armor in the texture files and changed the colors.\r\n\r\nThe only weapon textures I\\'ve currently changed are the handaxe and bow. I also changed the shield\\'s color. I haven\\'t done the rest because my personal character doesn\\'t use the other weapons and I initially never intended to upload this. If this somehow becomes a very popular download without getting tons of complaints, (i.e the people mentioned in the warning) I\\'ll whip them up real fast and swap out this file with a better one; shouldn\\'t take too long.\r\n\r\nNotes:\r\n\r\nFemales use the male boots, helmet, and gauntlet texture files, so these parts of male elven armor will be silver/black. Shields, weapons, etc, are global, so if you use the \\\"weapons\\\" folder, all of the ones listed above will also appear different, male or female etc. Still, silver/gold/black all work together nicely in color theory so it shouldn\\'t be a big deal. \r\n\r\nUpload some better pics if you have the time; it was almost high noon in the game when i grabbed these. Like real photography, this is about the worst time to take pictures. ^_^\r\n\r\nI hope you like this file and it increases your enjoyment of the game,\r\n\r\n\r\nJammer",
  "categoryId": "54",
  "version": "v1a",
  "author": "Jammer",
  "createdUnix": "1325648228",
  "updatedUnix": "1325722923",
  "containsAdultContent": true,
  "uploadedBy": "jammer2006",
  "primaryFile": null,
  "files": [
    {
      "fileId": "16412",
      "name": "Super Revealing Elven Armor for CBBEv2 Females",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3848",
      "fileName": "Super Revealing Elven Armor for CBBEv2 Females-5268-v1.rar",
      "uploadedUnix": "1325648346",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/bd0adf68484ec0495d9703e5729c5fa0acd91798305ba75c9b665385ec7f45b9/analysis/1406581152/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Super%20Revealing%20Elven%20Armor%20for%20CBBEv2%20Females-5268-v1.rar?fid=16412&ttl=1535761860&ri=8192&rs=8192&setec=fb2ff85cb8d4cdd1fff2a97a1f4ef604"
    },
    {
      "fileId": "16699",
      "name": "Super Revealing Elven Armor for CBBEv2 Females All Weapons",
      "version": "1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5070",
      "fileName": "Super Revealing Elven Armor for CBBEv2 Females All Weapons-5268-1a.rar",
      "uploadedUnix": "1325722923",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/7feede6adb584761606443ad781f3099c1968c11a0b4986a763a1cd3a62ebd9b/analysis/1406583186/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Super%20Revealing%20Elven%20Armor%20for%20CBBEv2%20Females%20All%20Weapons-5268-1a.rar?fid=16699&ttl=1535761861&ri=8192&rs=8192&setec=b0a7877a1680cb364d5a9233f0066f84"
    }
  ]
}