{
  "modId": 52719.0,
  "modName": "Darius Stormshield",
  "summary": "Darius is a vampiric follower skilled in two-handed combat and heavy armor.",
  "descriptionHtml": "This is the first mod I&#39;ve bothered to upload, and as such forgive me if I have forgotten pieces. I have tested this mod quite a bit before uploading, so it should work fine.  It does not require other mods or DLC in order to function and has not presented any issues with saved games or other mods as of this time. However, as with any mod, please be aware that there may be issues that I am not aware of. I would advise making backups of your saves beforehand if you are worried about it breaking something, for I am not responsible for messed up content. This is essentially a practice mod to test the waters--you have been warned. \r<br />\r<br />What this mod does:  Adds my favorite player character into the game as a follower. His name is Darius Stormshield--a half Nord/half Imperial warrior that contracted vampirism as the result of an accident  while hunting vampires near Morthal. He uses heavy armor and two-handed weapons and can be found in the Four Shields tavern in Dragonbridge. You do not have to do anything special to get him to follow you--just talk to him. He is not marriageable and he does not bite. He is marked as essential, so fire away at those enemies in those massive battles--he&#39;ll be fine&#33;\r<br />\r<br />Although he is a vampire, it is safe for him to follow you to Fort Dawnguard, for those of you with the Dawnguard DLC. He followed me through the whole fort on the test runs and no one batted an eye over it.\r<br />\r<br />Note: Although Darius will refuse to commit crimes for the player, he will attack certain NPCs if asked. I am not sure of the entire list of ones he will/won&#39;t attack, so caution should be exercised when asking him to attack things. I am currently unaware of how to resolve this issue.\r<br />\r<br />Note on Screenshot:  Any screenshots uploaded here are from my own personal game files, and as such may contain mods that I use personally but aren&#39;t included in these files. I have endeavored to strip the game down as close to vanilla as possible before taking the screenshots, but there may still be traces of mods that I forgot to deactivate beforehand. This shot has textures from, I believe, aMidian&#39;s armor texture mod(s) and textures from Xenius&#39;s character enhancement mods. Once again, those mods are not included in these files.\r<br />\r<br />\r<br />",
  "categoryId": "96",
  "version": "",
  "author": "LadyWYT",
  "createdUnix": "1396752591",
  "updatedUnix": "1396752346",
  "containsAdultContent": false,
  "uploadedBy": "LadyWYT",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000103803",
      "name": "Darius_Stormshield",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Darius_Stormshield-52719-.zip",
      "uploadedUnix": "1396752346",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3d2fcd271f19af92229b70f22d8785b5da2f4c1bf38a577108ecae685afa0360/analysis/1408008760/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darius_Stormshield-52719-.zip?fid=1000103803&ttl=1535835885&ri=8192&rs=8192&setec=cb6e3d1ff2feb225553e859c0a329e82"
    }
  ]
}