{
  "modId": 52721.0,
  "modName": "All Thieves Guild Jobs Concurrently",
  "summary": "Lets you take on all seven types of Thieves Guild job at once, instead of only one for Delvin and one for Vex at a time.",
  "descriptionHtml": "Skyrim by default artifically limits you to one job for Delvin and one job for Vex at a time, but the underlying quest structure supports all seven at a time, so this mod simply removes the &#34;is player on job for X&#34; check from the dialogue of Delvin and Vex.\r<br />\r<br />The mod lets you start one of each type of job at a time (bedlam, fishing, numbers, burglary, shill, sweep, and heist) but not more than one of the same type. The point of this is to get to the 125 jobs completed faster but without any sort of cheating, requiring a minimum of 18 trips out into the world rather than the staggeringly-obnoxious 63 that the base Skyrim requires.\r<br />\r<br />If you are already on one of each of Vex&#39;s four jobs or Delvin&#39;s three jobs, and you try to ask for more work, the conversation will simply end with no ill effect (since it&#39;s harmless, and this way I can avoid editing any scripts which would cause problems with existing savegames).\r<br />\r<br />There should be no problem with turning in multiple jobs as the four special jobs come available, but keep an extra savefile just in case (and report any bugs you find).\r<br />\r<br />This is built against the latest version of Skyrim, but requires no DLC or unofficial patches and doesn&#39;t conflict with either.\r<br />\r<br />This mod will conflict with any mod that alters the way Thieves Guild special jobs work, such as the mod that lets you choose jobs specifically by city.\r<br />\r<br />This mod edits only the dialogue (no scripts, characters, or anything else), so there&#39;s no reason you can&#39;t enable and disable this mod at will without hurting your saved games.",
  "categoryId": "25",
  "version": "1",
  "author": "JAKJ",
  "createdUnix": "1396756520",
  "updatedUnix": "1396756225",
  "containsAdultContent": false,
  "uploadedBy": "jakj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000103808",
      "name": "All Thieves Guild Jobs Concurrently",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "All Thieves Guild Jobs Concurrently-52721-1.zip",
      "uploadedUnix": "1396756225",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/48d41fa14a8da4dfedf226f1f3f6028e3d2c358671aeac3e51fc6bbffc5ec389/analysis/1408008816/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Thieves%20Guild%20Jobs%20Concurrently-52721-1.zip?fid=1000103808&ttl=1535835889&ri=8192&rs=8192&setec=207f38bfcb00b298a77b8b47021ebe3a"
    }
  ]
}