{
  "modId": 5280.0,
  "modName": "Paraleyes More Realistic Dragonbone Armor with Skull Design",
  "summary": "If you wear heavy armor, this will be the last armor you put on! Skull Mouth Holds Up Your Belt! Bone colors look more realistic! Leathers completely overlayed with new HD texture! -See pictures! All metal pieces are now very black. Still has the implemented Gold-Trimmed accents from my original file! -My old colorful armor is still available.",
  "descriptionHtml": "V3.0 = FULL SET NOW INCLUDES MALE ARMOR! :)\r\n\r\nThis male version, since I did it after the famale one, I think turned out better.\r\n\r\n\r\n1) MORE REALISTIC BONE COLOR\r\n2) HD LEATHER TEXTURE UPDATE FROM BLURY BETHESDA DESIGN *SEE PICTURE!\r\n3) SKULL IMPLEMENTED INTO FRONT AND BACK OF ARMOR!!! LOOK SO GOOD!\r\n   -Note to those who do not like skulls. I created this design with the intent on making a more realistic bone skeleton structure of a dragon to wear as my armor. Then I thought, well I am wearing a skeleton... may as well implement some extra design opportunities. Many will never want a different set of armor! For those not into the skull thing, rest assured you will feel happy and enjoy bashing in heads of bad guys while you wear my new dragonbone armor texture! :)\r\n4) GOLD AND BLACK THEME STILL IN PLACE. JUST NO MORE UGLY BONE FROM THE ORIGINAL FILE!!!\r\n\r\n\r\n\r\nTHE OLD OPTIONAL ARMOR FILE INCLUDES:\r\n\r\nThis mod took me many many hours to complete as it was a learning process for me as well as lots of fun! This is my 1st texture mod, but now that I know how to do it and how to get it to work out just right, you can expect many more from me in the near future! :) Not only that, but I aim to show you how to do this too!\r\n\r\n1) Golden Bone textures.\r\n-I used a higher saturation to bring out more of the color in the original Bethesda design.\r\n\r\n2) Defined Lines.\r\n-I dialed up the sharpness on these textures to bring out the depth in all 3D aspects of how the textures lay over the meshes.\r\n-I also used an embossing effect on a very low setting to do this as well.\r\n\r\n3) Shortened Skirt/Kilt\r\n-I didn\\'t like the length of the female armor. This shortened look gives a much more freely moving feel to the set.\r\n-I did this to both the front and the back.\r\n\r\n4) Black Metal.\r\n-All the metal on this armor has been painted black.\r\n\r\n5) Golden Rivets.\r\n-I used my favorite photo editor to create entirely new golden rivets for every single rivet located on this armor. And they shine so beautifully! :)\r\n\r\n6) Overhauled arm band texture.\r\n-I made a Dragon Eye center piece.\r\n-I surrounded it with Golden Rivets.\r\n-Also included an extra Celtic themed chain circlet around the Dragon Eye.\r\n\r\n7) Golden Chain.\r\n-The factory Bethesda chain was very dull and plain. I replaced it with a tighly woven Golden Chain piece that dangles from the waist and has bones hanging down from behind. (The bones are Bethesda\\'s design. I just changed the chain.)\r\n\r\n8) Opened up the clevage Area.\r\n-I removed the woven leather shoelace look on the female chest area.\r\n-Then gave it a necklace surround band to surround whatever necklace you choose to wear just right.\r\n\r\n9) Jewelry Arm Wrap\r\n-This was my primary focus on this texture mod and my most proud accomplishment within! I can see how some of you would prefer the fur and I would consider creating the Bethesda\\'s design back into this new texture if enough people requested it. I personally love the jewels!!!\r\n-***There is a small flaw in the design. If you look up underneath her shoulder armor from down low, you can see through the mesh of layout at that point. Please understand that there isn\\'t anything I can do about this as it is also the very same flaw in the Bethesda desinged armor set.\r\n\r\n10) Golden Chain Boot surround.\r\n-I wanted to tie in the jewelry theme with a more balanced feel, so I created a small golden chain around the calf area of the boots to match the chain around the waist area the the bones hang from.\r\n\r\n11) Skyrim Logo Helmet\r\n-A golden Skyrim logo was put on both sides of the top as well as the front nose spike of this helmet. It is very decorative, yet still not too overboard.\r\n\r\n12) Rainbow Helmet option.\r\n-This was my crown acheivement on this set(Pun intended), in my opinion. However I realize how some of you would prefer a more matched horn set, so I made the black version as well.\r\n\r\n13) Shield has Skyrim logo on the inside lining of the metal curving around the edges which is lovely to look at as you are in the guarded position!\r\n-I also recently added a steel strip with golden rivets arcross the top of the shield :)\r\n-Newest version has a 2 headed Black dragon on the front & back! :)\r\n\r\n\r\n\r\nPERSONAL NOTE TO USERS:\r\n\r\nPlease read this entire page before commenting. As I mentioned, I spent many very long hours learning how and on this mod specifically and I did my best to give you as many quality images to preview this armor texture mod before you spend the time to download it. Please try it out and if you like it, be sure to comment on how it effects your gaming experience within the discussion area. If you don\\'t like it, just follow the UNINSTALL directions below and go right back to enjoying your original Skyrim experience! It\\'s all about having fun with the game!!! So enjoy! :) :) :)\r\n\r\nIf you really enjoy this Dragonbone armor mod as much as I do, please favorite/bookmark this page or friend me within skyrimnexus to follow my progress as I will be creating many more texture mods in the near future!\r\n\r\n\r\nCAN SOMEONE PLEASE UPLOAD A SHOT OF THEIR MALE ARMOR? I HAVE NO WAY OF TESTING IT TO DISPLAY PICTURES.\r\n\r\n\r\nINSTALL:\r\n\r\nIt is my goal for everyone using these mods to learn how to install these textures on their own and hopefully even begin making wonderful new creations of their own to share the rest of the modding community. For this reason, I may decide to not even include the NMM option with my file uploads. Installation on your own is really very simple!\r\n\r\nMany of you will know the following information. If so, please continue on to try out my armor mod! I will be as specific as I can on these steps so you ALL can begin taking control of your Skyrim reality!\r\n\r\nOpen your downloaded file with your preferred compression utility(WinZip, WinRAR, etc..) and extract all the files to the following directory (c:\\\\program files(x86)\\\\steam\\\\steamapps\\\\common\\\\skyrim) ***Uneless you chose to install Skyrim in a different directry of course and in which case you already understand this process.\r\n\r\nIf asked to overwrite any files, Click YES! If that concerns you, please read below WHY THIS IS SAFE?!\r\n\r\n\r\n\r\nUNINSTALL:\r\n\r\nLocate the all the files that were extracted into the (C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data) directory that came with this mod. If you are unsure of which files were installed. It would be helpful to open the original compressed file you downloaded so you can identify each individual file name specifically. The files that need to be deleted for this mod will be located in the (C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\armor\\\\dragonbone) directory. I don\\'t want to name each file individually as I will be updating this mod with more textures several times.\r\n\r\nThe same should go for most any other mod you have implemented into your Skyrim experience. However, if using the NMM, you are NOT guaranteed full control over what is installed onto your system, so I do encourage you all to learn how to install these mods on your own.\r\n\r\n\r\n\r\nWHY THIS IS SAFE?!\r\n\r\nIt is completely risk free and safe to install this mod and to overwrite any existing Data mod files you may have already installed. This is why. All the factory Bethesda designed meshes and textures are located in .BSA files within the (C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data) directory. Any mods that you install go into this same directory, but under a completely separate and new sub-directory as described in the UNINSTALL section of this write up. Therefore, if you chose to uninstall, delete and/or overwrite any files in the Data folder, you can rest assured that they are completely separate from the file and design structure of the original game. I hope that helps! :)\r\n\r\n\r\n\r\nHOW TO MOD IT YOURSELF:\r\n\r\n-Yes, you can take control of your Skyrim reality!!! Below is my personal \\\"How to\\\" do this yourself and to start reflecting the very best of your own creations within your very own Skyrim experience!!!\r\n\r\nThe way these texture mods work is we are extracting the .DDS texture files from Bethesda\\'s .BSA files which are all also located in the C:\\\\Program Files (x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data directory. Then we edit them with our preferred photo editors and resave them as new .DDS files. And then we create a new sub-directory within the Data folder of Skyrim\\'s directory and and install the new textures there.\r\n\r\nTo do this, you need a handful of programs.\r\n\r\n1) FO3_Archive_Utility-34.zip ***Free Program!\r\n-FO3 is of course Fallout 3; another Bethesda creation with the same .BSA file structure.\r\n-With this, you can open the .BSA texture directories within the Skyrim Directory and extract them to a new working folder of your choosing.\r\n\r\nUsing FO3 Archive Tool:\r\n\r\n1)Open FO3 Archive tool.\r\n2)Click File/Open Archive\r\n3)Navigate to: C:Program Files (x86)SteamSteamAppscommonskyrimData\r\n4)Open Skyrim - Textures.bsa\r\n-Within this file you will find ALL Skyrim Textures.\r\n5)Find your desired texture to edit and extract them wherever you want.\r\n\r\nOnce extracted, you can also download DDS Converter V2 just for the use of it\\'s so very hand Right Click option to preview any image file within the right click context menu! This will spead up your search progress exponentially! :)\r\n\r\n2) PAINT.net ***Free Program!\r\n-With this, you will be able to open any .DDS file that you wish to edit the textures on.\r\n-You can also save the .DDS texture file as .TIF with transparency and then open it with your personal favorite photo editor.\r\n\r\n3) DDS Converter 2.1\r\n-***Download this optionally for reasons explained below.\r\n-The reason I like this program is that it gives you a preview of any photo file within the Right Click context menu anytime you Right Click on any photo file, including .DDS! This makes browsing through which .DDS file you need to open with PAINt.net very efficient! :)\r\n-This program needs to be bought in order to use the full features, which is not necessary as I do not even ever open the program. I only use the sub-context preview window that pops up within the Right Click option on your mouse.\r\n\r\n4) If you wish to use another photo program that you own such as PhotoShop, there is an Nvidia plug-in that allows you to open and edit .DDS files directly which is available on nvidia\\'s website.\r\n\r\n5) I actually use a different program alltogether to do my photo editing. However, it does not have a .DDS plug-in available to use. If you fall under this category, use the following steps to convert the files to be edited.\r\n\r\n1) Locate the .DDS file using the Right Click preview option from installing the DDS Converter 2.1 program.\r\n\r\nThere are several files in the armor section. These are the base texture files you should start with for editing. I\\'ll be using dragonbone as an example since this is where you found the info:\r\n\r\ndragobonearmor.dds\r\ndragonbonearmf.dds (F=Female)\r\ndragonboneboots.dds\r\ndragonbonegauntlets.dds\r\ndragonbonehelmet.dds\r\ndragonboneshield.dds\r\n\r\nThere are other files that do other things, such as those ending with the name *nvmask.dds They are for changing the amount of light that reflects on the armor.\r\n\r\nNOTE: Download my Optional file, Paraleyes Ultra Reflective Glass file and look at those .DDS files compared to the origonals. Then you will immediately understand how to alter these effects as well. :)\r\n\r\n2) Open the .DDS file with PAINT.net\r\n\r\n3) Save the file as a .TIF with transparency with whatever preferred name you want.\r\n-There are many other file formates available. .TIF works for me quite well though.\r\n\r\n4) Open the .TIF file with your favorite Photo Editor.\r\n\r\n5) Complete and re-save your modifications as .TIF. Be sure to use the Transparency option!\r\n\r\n6) Open up the modified file with PAINT.net and the save it back to .DDS. Use the \\\"DXT5 Interpolated Alpha) option to retain transparency! Other options workd for me, but DXT5 was the cleanest in my experience! :)\r\n\r\n\r\n\r\nUSER INPUT:\r\n\r\nFeel free to upload any photos you wish to share after installing my mod. I will likely approve them right away!\r\nEspecially if they are tasteful and decent quality. One request however, please try to use a compression editor to keep down on the load times. Not everyone has super fast internet. :)\r\n\r\nFeel free to comment in the discussion area and ask me questions about this mod.\r\n\r\n",
  "categoryId": "54",
  "version": "3.0",
  "author": "Jake Fischer",
  "createdUnix": "1325658586",
  "updatedUnix": "1326192344",
  "containsAdultContent": false,
  "uploadedBy": "paraleyes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "16453",
      "name": "Paraleyes_Black_Metal_Golden_Dragonbone_Armor",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "853",
      "fileName": "Paraleyes_Black_Metal_Golden_Dragonbone_Armor-5280.rar",
      "uploadedUnix": "1325658838",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2eb645d944d38a549548d355522ff16c05115d5d8277c8a8edb8791fd3e7731e/analysis/1406581565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paraleyes_Black_Metal_Golden_Dragonbone_Armor-5280.rar?fid=16453&ttl=1535761875&ri=8192&rs=8192&setec=5d28dc7fa44272ff8d1d876975412e47"
    },
    {
      "fileId": "16463",
      "name": "Paraleyes Rainbow Horned Helmet Option",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "116",
      "fileName": "Paraleyes Rainbow Horned Helmet Option-5280.rar",
      "uploadedUnix": "1325661120",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0f4a9dde31e474db5d0cc53bb5d2bf515c3e4946207a061b8a48e05147dd5908/analysis/1406581624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paraleyes%20Rainbow%20Horned%20Helmet%20Option-5280.rar?fid=16463&ttl=1535761876&ri=8192&rs=8192&setec=4166343a9dbc95bb272f1d369dd3ac40"
    },
    {
      "fileId": "16493",
      "name": "Paraleyes Black Metal Dragonbone Armor - Gold Acccents",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1308",
      "fileName": "Paraleyes Black Metal Dragonbone Armor - Gold Acccents-5280.rar",
      "uploadedUnix": "1325672853",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1bdb2e42022b1181568a145a142c4d5881bb77fcf551cf64ecd1b4584bf14cb1/analysis/1406581748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paraleyes%20Black%20Metal%20Dragonbone%20Armor%20-%20Gold%20Acccents-5280.rar?fid=16493&ttl=1535761876&ri=8192&rs=8192&setec=bfdafe42df762b4636cd7a06950433ab"
    },
    {
      "fileId": "16518",
      "name": "Male and Female complete with Shield",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1424",
      "fileName": "Male and Female complete with Shield-5280.rar",
      "uploadedUnix": "1325678297",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/5d9fd5b16b940b262598da7b26d8ee49a00eca4858aa68b8f71c3e945946c186/analysis/1406581865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Male%20and%20Female%20complete%20with%20Shield-5280.rar?fid=16518&ttl=1535761877&ri=8192&rs=8192&setec=a8849cd2e31540eb2876cccd4508ff48"
    },
    {
      "fileId": "16539",
      "name": "Paraleyes_Black_Metal_Golden_Trim_Old_Shield",
      "version": "1.4.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1424",
      "fileName": "Paraleyes_Black_Metal_Golden_Trim_Old_Shield-5280.rar",
      "uploadedUnix": "1325686664",
      "modVersion": "1.4.2",
      "virusScanUrl": "https://www.virustotal.com/file/27fffc36fe9b623528747ed0a5ed82bf75486d5d18950d102acc09bb65d547da/analysis/1406582024/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paraleyes_Black_Metal_Golden_Trim_Old_Shield-5280.rar?fid=16539&ttl=1535761877&ri=8192&rs=8192&setec=d3a1e73a60eaf3e0eaaf6117b76652d9"
    },
    {
      "fileId": "16715",
      "name": "Two Headed Two Tailed Dragonbone Shield Option",
      "version": "1.4.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "116",
      "fileName": "Two Headed Two Tailed Dragonbone Shield Option-5280.rar",
      "uploadedUnix": "1325726964",
      "modVersion": "1.4.2",
      "virusScanUrl": "https://www.virustotal.com/file/589654865a729be0f28ce491cb7f6aa569846fb2ce8ada9e11bbde8c6c99fc90/analysis/1406583303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Two%20Headed%20Two%20Tailed%20Dragonbone%20Shield%20Option-5280.rar?fid=16715&ttl=1535761878&ri=8192&rs=8192&setec=93ab211de02839cd068f115a8fb8cd37"
    },
    {
      "fileId": "16728",
      "name": "Paraleyes Black Metal Gold Trim 2 Headed Dragonbone Armor",
      "version": "1.4.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1423",
      "fileName": "Paraleyes Black Metal Gold Trim 2 Headed Dragonbone Armor-5280.rar",
      "uploadedUnix": "1325731003",
      "modVersion": "1.4.4",
      "virusScanUrl": "https://www.virustotal.com/file/003d724298d6390790bbd5ebb0fcf0c9b673dd248a55a9548e505fc1eefa8812/analysis/1406583486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paraleyes%20Black%20Metal%20Gold%20Trim%202%20Headed%20Dragonbone%20Armor-5280.rar?fid=16728&ttl=1535761878&ri=8192&rs=8192&setec=ed5dce82e6370508ecd782b8798e3930"
    },
    {
      "fileId": "17111",
      "name": "Parleyes Bronze Black Glass Weapons Pack Gold Accents",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "976",
      "fileName": "Parleyes Bronze Black Glass Weapons Pack Gold Accents-5280.rar",
      "uploadedUnix": "1325834012",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/cc8aa7e7733c59dc130f34edfa01d0865151944053adcc8fd161bffd0e53924a/analysis/1406586916/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Parleyes%20Bronze%20Black%20Glass%20Weapons%20Pack%20Gold%20Accents-5280.rar?fid=17111&ttl=1535761878&ri=8192&rs=8192&setec=e7673cb12e6c9b10550cdfc13314a084"
    },
    {
      "fileId": "18449",
      "name": "Paraleyes Black with Gold Trim Glass Weapon Pack As seen in pictures",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "996",
      "fileName": "Paraleyes Black with Gold Trim Glass Weapon Pack As seen in pictures-5280-2-1.rar",
      "uploadedUnix": "1326172082",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/17c1d061758c18fd8944313e7b1a0a72e6e971dae06840b0e397b6c668982fe0/analysis/1406598667/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paraleyes%20Black%20with%20Gold%20Trim%20Glass%20Weapon%20Pack%20As%20seen%20in%20pictures-5280-2-1.rar?fid=18449&ttl=1535761879&ri=8192&rs=8192&setec=290a9758d690180f71e7273deb0c5187"
    },
    {
      "fileId": "18499",
      "name": "Paraleyes More Realistic Dragonbone Armor with Skull Design",
      "version": "V3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1342",
      "fileName": "Paraleyes More Realistic Dragonbone Armor with Skull Design-5280.rar",
      "uploadedUnix": "1326192344",
      "modVersion": "V3.0",
      "virusScanUrl": "https://www.virustotal.com/file/952fcca5906ce83ef023adf0c5541ba2be4acf789c7d0994946e943078412d35/analysis/1406599219/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Paraleyes%20More%20Realistic%20Dragonbone%20Armor%20with%20Skull%20Design-5280.rar?fid=18499&ttl=1535761879&ri=8192&rs=8192&setec=29bac60cdad87567d2fbacdfb5c3aaa2"
    }
  ]
}