{
  "modId": 52805.0,
  "modName": "The Thane Defence",
  "summary": "A.K.A. How to take the mick out of your position.",
  "descriptionHtml": "So you spend ages doing work for the Jarls of Skyrim. You slay however many dragons, help their annoying irritating citizens and you spend countless hours getting seven bells beaten out of you just to make a person happy so you can earth the luxurious title of &#34;Thane&#34;.\r<br />\r<br />Now for some, that&#39;s great. You can feel happy that you earned that title and all and that you are a true champion of the hold. The Jarl will graciously let you own property, give you a nice shiny axe/sword for your troubles and said title. You can lord it over the peasants and bask in your glorious power and prestige.\r<br />\r<br />Others though feel that the title should give them a little more leeway, you earned that, why shouldn&#39;t you be allowed to exploit that position a little? Why not bend a few rules here and there? Sure the guards will let you get away with a few misdemeanors but they only do it once. But is this really fair? With oh so much work you put into the hold why should they only be required to look away just once...? Who says they cannot look away a few times.\r<br />\r<br />Description:\r<br />When a player is thane of a hold, as long as your crime gold is less than an amount you are allowed to use your ace card of &#34;I&#39;m thane, ignore my crimes&#34;. The guards will let you off and allow you to continue on your way. In the vanilla game, that&#39;s when their leniency stops, you can only use that defence once. What I have done, a slight alteration to some of the variable changes when things happen, no custom content or anything like that, it means that you can continue to use the &#34;I&#39;m the Thane&#34; dialog option as many times as you need to. The usual rules still apply in that it must be lower than the gold threshold for the crime to be glossed over (in the files it&#39;s 2000 gold or less).\r<br />\r<br />This requires no custom files or script or anything like that, purely me playing with some values and getting to know the CK a little better. I will of course attempt to fix any issues which occur with this to the best of my abilities and might also look to release another option to allow players to bend the rules even further but this is basically some inexperienced tinkering.\r<br />\r<br />Disclaimer:\r<br />While I have tested a few of the holds (Whiterun, Falkreath, Dawnstar), I have been unable to test all nine holds while Thane for both Imperials and Stormcloaks so I cannot guarantee that I did indeed catch all of them. This does not alter the Forsworn Conspiracy Guard interaction in any way. Usual rules for mods apply, you use it at your own risk and I cannot be responsible if it breaks your save game, your Skyrim install, any quests, causes a rift in time/space etc. All feedback is appreciated and considered.",
  "categoryId": "40",
  "version": "1.0",
  "author": "Calgor",
  "createdUnix": "1396981635",
  "updatedUnix": "1396981466",
  "containsAdultContent": false,
  "uploadedBy": "Calgor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000104155",
      "name": "The Thane Defence",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "The Thane Defence-52805-1-0.zip",
      "uploadedUnix": "1396981466",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3ee1643528ba6a73ccafc6ee32b93a8bb944e40737e1203ab199e01fe665de80/analysis/1408012161/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Thane%20Defence-52805-1-0.zip?fid=1000104155&ttl=1535836011&ri=8192&rs=8192&setec=f4b158ed12e7af189e5e79d3d20a02a1"
    }
  ]
}