{
  "modId": 5282.0,
  "modName": "PA Dark Ancient Nord Craftables v_1 - more colors soon",
  "summary": "Nonreplacer mod that allows the player to craft a darker-colored version of Draugr/Ancient Nord armor, with more colors on the way. ",
  "descriptionHtml": "Hey folks! After my Draugr ebony replacer mod, people seemed interested in more work concerning the armor itself, which many seem to find appealing. Hopefully this mod is to your liking.\r\n\r\nAncient Nord armor with the darker textures from my previous mod is now craftable at forges. The materials are pretty straightforward and I didn\\'t set any smithing requirements. The items are located under the iron category. Note that this is a nonreplacer mod (or it should be--I don\\'t have much experience with this).\r\n\r\nNote that this is just my initial release after working solidly for a day to understand how to even make a functioning esp without a construction set.  ---I plan on adding more colors/texture variants soon--. Let me know if you have any color requests in the comments!\r\n\r\nAlso let me know of any issues/concerns etc. This is essentially the first mod I\\'ve made that actually required some amount of effort. Thanks!\r\n\r\np.s. - At the forge, the armor displayed in the menus still retains the appearance of the old Ancient Nord armor. I\\'m too lazy right now to correct that and probably won\\'t get to it till much later--I figure actual retextures are more important than the way it looks sitting in a game menu or on the ground. ",
  "categoryId": "54",
  "version": "v1",
  "author": "polishanarky",
  "createdUnix": "1325659007",
  "updatedUnix": "1325659106",
  "containsAdultContent": false,
  "uploadedBy": "polishanarky",
  "primaryFile": null,
  "files": [
    {
      "fileId": "16456",
      "name": "PA Dark Ancient Nord Craftables v_1",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2795",
      "fileName": "PA Dark Ancient Nord Craftables v_1-5282-v1.rar",
      "uploadedUnix": "1325659106",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/e8ceaf8ab3a5d07fb7f8df8566517ca68df97738622d5cbb3ed4a059dbc24095/analysis/1406581569/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PA%20Dark%20Ancient%20Nord%20Craftables%20v_1-5282-v1.rar?fid=16456&ttl=1535761881&ri=8192&rs=8192&setec=b1b23bbce1b060843d0a706dc00518f8"
    }
  ]
}