{
  "modId": 5283.0,
  "modName": "Be A Better Mage with Unique Spells",
  "summary": "More Spells, tweaked game configurations",
  "descriptionHtml": "AROUND 40 NEW SUMMONING SPELLS!!!\r\n\r\n*Race Spells may not show up in inventory if you have mods that modify your race. So console: Urul(orc), Ra\\'Tesh(khajiit), Sinah(Breton), Ashanta(Redguard), Erissa(high elf), Liette(wood elf) Nord Legends(Nord), Vasesius(Imperial), Dremora Queen(dark elf), Neesha(Argonian) and you can get the spell. But the spells only work with the race that you are. So Neesha(Argonian) won\\'t work when you are say a Redguard.\r\n\r\nThis mod was made so that pure mages can now compete in the Dark Souls type world that Pise/Deadly Dragons mod do to the game. So I added new spells to all who are a fan of the school of conjuration. Each spell should be able to fit into most of the possible builds out there: pure mage, ranger, battle mage, etc. You can now, for I am, can compete slightly (not with guys who break the game with all the smithing/enchanting/alchem hax) with a daedric greatsword fire enchanted wielding tank.\r\n\r\n A BETTERMAGE README IS INCLUDED. This is to keep my description from being too jumbled on the main page. The readme will tell you everything this mod does.\r\n\r\nThis mod was made so I can compete on the higher difficulties as a pure mage. It might be overpowered playing on the Novice/Adept level, but board and sword warrior can be just as overpowered as well. I die a lot, with Deadly Dragons/PISE mod, but I succeed a lot more than before this mod. Dremora Lord is WEAK, on the higher difficulties. Needed something with more damage capabilities. \r\n\r\nI have greatly increased the school of conjuration, because that is my favorite school and helps playing as a mage easier, with more spells. And the spells get more powerful, in the higher levels, instead of longer duration, like the Vanilla Skyrim. Let\\'s face it, a master level potent fire thrall still gets one shotted, like it\\'s apprentice brethren. But the master one has to be recasted, which takes up to an hour. \r\n\r\nI also added new spells to the illusion school, and they scale better than the vanilla version. The school of illusion is pointless around level 25+. Not anymore! I even added spells to the school of illusion that will even do damage.\r\n\r\nIf you are using other mods for destruction magic or other schools, then download the alternate versions, especially alternate version 2. They will only add the spells, and leave the game completely vanilla. That way there are no conflicts with your mods. But the atronach stone fix, spells, enchantments, are all still added.\r\n\r\nTo obtain these spells: Visit Phinis, Farangar, or the SkyForge in Whiterun each time you reach the Apprentic, Adept, Expert, Master level. You will either be able to craft them at the SkyForge, or buy them outright. A few are quest rewards, and I will note those in the description below.\r\n\r\n\r\nDESTRUCTION MAGIC/SYSTEM TWEAKS \r\n\r\n- The entire Destruction Perk tree has been reworked. The spells will now scale each time you spend a perk in Novice, Apprentice, Adept, Expert, and Master. They will see a 25% increase each level. But, they will only scale from their school and up. So a fireball won\\'t see a increase from vanilla version, until you unlock the Expert perk tree. Unless, you spend perks in the Augmented flames category. Also, you will get a 10% boost when spending a perk in \\\"Intense Flames\\\" to your fire magic only. Same with frost and shock. Runes, Flame Cloak, and Flame Wall, should now scale with you as well as you put perks in the destruction tree. You should be plenty powerful upon filling out the destruction tree, and a PURE Destruction Mage, should be possible at the higher difficulties. Will tweak and open to suggestions.\r\n\r\n- For better balance now that your spells are more powerful, Impact will only have a 60% chance of happening. So now you have to use more strategy than focusing on chain locking your foes. I think 60% is the right balance. \r\n\r\n-Fire Storm can now be cast using one hand. But it still takes some time to charge. But, you can  use fireball, flames, incinerate, etc while charging Firestorm. Then unleash firestorm for possibly the most powerful combo in the game. Tried it, and it\\'s awesome. \r\n\r\n-Staffs will scale the same as your spells. So they\\'ll be more powerful as you put perks into the tree. Enchantments, will ONLY see a boost when putting a perk into the, \\\"Intense Flames, Deep Freeze, Disentegrate,\\\" tree. So item enchantments shouldn\\'t be super overpowered.\r\n\r\n-Runes should now be able to be silent casting upon unlocking the QuietCasting perk.\r\n\r\n- Atronach Stone summoning bug should now be fixed.\r\n\r\n-Also new: Mages, we know we\\'re professional spammers. We have to spam in order to level up our abilities. Conjuration, hard! Destruction, hard! Alteration, dang near impossible! So if you have the Mage Stone activated, you will see a 25 not 20% boost to magic leveling. It\\'s a small boost, but it does help cut down the spamming/exploits a little. Your active effects will still say 20% but trust me,it\\'s 25. I tested it at 100% and saw a crazy boost. So it\\'s there. This effect is only in the main file, not the other two. Destruction levels way too slow. I got through the beginning of the game, cleared a few bandits, got to Bleak Falls Barrow, and still was only level 3 using destruction magic only. You can get to level 3 in the beginning portion of the game using only swords/axes/whatever. It\\'s not right how Bethesda thumbed there nose up at pure mages. \r\n\r\n- Each of the main destruction spells got a 5 to 10 point boost for better scaling on the higher difficulties. Also, dual casting went from a damage rating of 2.2 to a damage rating of 2.5\r\n\r\n\r\nIllusion\r\n\r\n- Illusion spells should now work on higher level enemies now. So Frenzy should no longer be totally useless on higher levels.\r\n\r\n\r\nConjuration\r\n\r\n- Twin Souls perk has been boosted to 4 (Quadsouls is its new name). So you can now summon 4, instead of 2. You have to unlock the twin souls perk for you to be able to see this in action.\r\n- Bound Sword/Bow/Axe went from a 120 second duration, to a 180 second duration.\r\n\r\nDECAPITATION/KILLMOVERANDOM\r\n\r\n- You will see a higher rate of decapitations and kill moves with this mod.\r\n\r\n- Alteration spells have been reworked so that you can wear light/heavy gauntlets and boots only, and still get the Mage Armor Perks. Remember, gauntlets and boots only. Also, if you\\'re wearing helmets, shield, cuirass, you won\\'t receive ANY boost to armor. So, alteration spells will no longer work with heavy/light armor. Only gauntlets and boots. \r\n\r\nEDIT: Helmets now can be worn because Skyrim has shrouded cowls and other headgear classified as ArmorHelmet.\r\n\r\n- Upon reaching Master Alteration, you will be able to CRAFT (changed from buying) Master Alteration Robes at any TANNING RACK. Ingredients: 1 Novice Alteration Robes and 1 FILLED Grand Soul Gem. Thalmor robes will require any Thalmor robes and a grand soul gem. These robes will have an alteration spell enchantment that will last for as long as you\\'re wearing the robes. So you will no longer have to cast alteration spells every 60 seconds. The base armor is 100 but if you have all 3 Mage Armor Perks, then it will be 350. BUT... You won\\'t be able to cast another alteration spell to enhance the effects of the robes. So casting another spell will not stack with the robe enchantment. HOWEVER... My custom spells like: Daedricflesh, Orcishflesh, etc, will allow their fortify buffs to be included with the robes. So cast my custom alteration spells while wearing the robes for the fortify buffs only. \r\n\r\n*YOU MUST, obtain the 3rd Summoner perk in order to gain the four souls upon reaching level 100 conjuration. It was the only way I could get it to work. But I figure most of you would want the ability to have 2 souls once reaching 80 conjuration that it wouldn\\'t be a big deal. If you already have the QuadSouls perk prior to this update, then console, \\\"TwinSouls\\\", and the the third summoner perk will come up. Unlock that one to receive the four souls. Sorry for any inconvenience. \r\n\r\nThese are some of the things that I found to make the game more fun and less frustrating on the higher difficulties (Master/Expert). Let me know of any items that haven\\'t/aren\\'t appearing, any bugs, description fails, spelling fails, crashes, etc. I\\'m really hoping you guys help me make this mod as clean and enjoyable as possible. I\\'m open for any suggestions you may have. Have fun.\r\n\r\n\r\nBOUND WEAPON MOD\r\n\r\n- Ok for all you battle mages (the hardest play style in skyrim) how about a nice powerup to your Bound weapons? Well sword at least, will get to the others shortly. The sword now has 5 perks that can be spent in the conjuration tree. Renamed the lame, mystic binding, to something even lamer, \\\"Battle Mage\\\". Your weapons will now do the same damage as smithed steel, orc, dwarven, ebony, daedric weapons.\r\n\r\nThe vanilla sword will do a base damage of 9.\r\n\r\n1st Perk- 15 (the same as an exquisite steel sword)\r\n2nd- 20 (Legendary Orcish)\r\n3rd- 22 (Dwarven Legendary)\r\n4th- 24 (Ebony Legendary)\r\n5th- 26 (Daedric Legendary and an All Powerful enchantment is included on the weapon. It\\'s worth the work in obtaining.)\r\n\r\nThat\\'s just base damage, the weapon will scale with your one-handed perks as well. \r\n\r\nNow, I gave an option to the daring few, who want to do a battle mage, wearing robes. Well, here are THREE new alteration spells that will help you obtain that manly feat. \r\n\r\n- SteelFlesh (Apprentice)- Armor increases 78 points and stamina increases 50 points for 60 seconds. The reason it\\'s 78 is I wanted to keep it the same stats as Steel armor, with 0 perks in smithing and heavy armor. Buy when you reach Apprentice Alteration.\r\n\r\n- Dwarvenflesh (Adept)- Armor increases 85 points and health increases 50 points for 60 seconds. Same stats as unsmithed Dwarven armor. Buy when you reach Adept Alteration.\r\n\r\n- Orcishflesh (Expert)- Armor increases 95 points, stamina regenerates 50% faster, one-handed and two-handed are increased 25%, for 60 seconds. Buy when you reach Expert Alteration.\r\n\r\n- Daedricflesh (Master)- Armor increases 200 points, attacks with bows, one-handed, two-handed weapons will be 50% stronger. You will be a Mage tank. Can be obtained by either defeating the \\\"Champion of Boethiah\\\" and essentially trading ebony mail for Daedricflesh. Ebony Mail will still be able to be obtained, I mean, you\\'re a cloth wearing mage, give that armor to a companion. Or, if you already completed that quest, then you can craft it at the SkyForge, using, your Ebony Mail as the only ingredient, and you have to be at Expert Alteration. If you already sold, or don\\'t want to use your precious Ebony Mail to craft the spelltome, well then it sucks to be you, J/K. Just console it by searching for, help \\\"Daedricflesh\\\" 4. \r\n\r\nAlso, all perks in the Alteration tree, should work with the new spells. So if you have the 3x perk in the alteration tree then Daedricflesh gets boosted to 600 points (the max I think is 567, give or take a few). \r\n\r\n-Wispmother is a bit more powerful now and her spelltome can now be obtained upon completing the \\\"Pale Lady Quest\\\". Also, her Ice Volley spell is now able to be used (Expert Destruction) after completing the same quest. Check the corpse of the named NPC, who also has the \\\"Pale Lady Sword\\\". It will be there.\r\n\r\n-Can now cast 3 Runes, instead of just 1. Looking to add it to a Perk, just need more time to figure out how.\r\n\r\n-Dead Thrall now works on enemies up to 100\r\n\r\n-Storm Atronach thrall bug (as per request) is fixed.\r\n\r\n- Call of Valor should no longer have issues with those using the Atronach Stone. \r\n\r\n\r\nNEW OPTIONAL FILE: POWERFUL SHOUTS\r\n\r\n-Couldn\\'t stand how weak the base shouts were so I tweaked all the shouts, so that now you\\'ll WANT to use them on the higher levels. Your Fire and Frost breath will be like the dragons. Frost will be a steady stream of frost. Flames will be the same fireball that the dragons shout at you while you\\'re at a distance from them. The shouts will be more deadly. There are three parts to a shout, I\\'m sure you know this, I didn\\'t touch the first part. Made the second part a bit stronger, and you\\'ll notice a huge difference in the third part. Majority of the main offensive shouts got tweaks: Dismay, Unrelenting Force, Marked for Death, etc. While the others like Aura Whisper and Kyne\\'s Peace I didn\\'t touch.\r\n\r\nThis is a standalone file, you can include it with the main file or the two other alternates, or don\\'t use it at all. It\\'s truly optional if you want stronger shouts. \r\n\r\nHave fun shouting like a true dragon born.\r\n\r\nFans of Categorized favorites should visit this site: http://skyrim.nexusmods.com/downloads/file.php?id=7242\r\n\r\nMy mod should now work with the awesome Categorized favorites. Sorry I was too lazy to do it myself.  THANK YOU KICKER!!!\r\n\r\n",
  "categoryId": "75",
  "version": "16.8.2",
  "author": "Concept83",
  "createdUnix": "1325659216",
  "updatedUnix": "1346171102",
  "containsAdultContent": false,
  "uploadedBy": "Concept83",
  "primaryFile": null,
  "files": [
    {
      "fileId": "20681",
      "name": "PowerfulShouts V2-1",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "PowerfulShouts V2-1-5283.rar",
      "uploadedUnix": "1326818978",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/48bb13caeebe7c9db8477346c0cd3cd2266a332e0ab669683d9f215439d7bfd6/analysis/1406619137/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PowerfulShouts%20V2-1-5283.rar?fid=20681&ttl=1535761883&ri=8192&rs=8192&setec=363eec4d09e96d1b5120397c50fe3711"
    },
    {
      "fileId": "21750",
      "name": "QuadSouls Perks",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "QuadSouls Perks-5283.rar",
      "uploadedUnix": "1327157954",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6a938ddaed60e579805b95aeae042b1b3d1fad7e3f75bc335b4eb651c2c21311/analysis/1406627768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/QuadSouls%20Perks-5283.rar?fid=21750&ttl=1535761883&ri=8192&rs=8192&setec=c1dfdbd6cfd9dd2dcf347fc4745ee1b6"
    },
    {
      "fileId": "21761",
      "name": "Gameplay Boosts",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "Gameplay Boosts-5283.rar",
      "uploadedUnix": "1327159910",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/150b10b7cef426d6b4d0b6841bfa2e9768230abce4f3b8005aab689ffc88a84c/analysis/1406627762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gameplay%20Boosts-5283.rar?fid=21761&ttl=1535761884&ri=8192&rs=8192&setec=012226c33c76ea413811fa9207f0c775"
    },
    {
      "fileId": "22043",
      "name": "Illusion Spell Tweaks V1-1",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Illusion Spell Tweaks V1-1-5283-1-1.rar",
      "uploadedUnix": "1327241519",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4d62aa0cdcd068f7c7bc9521197b25fca6d0c9c138bbaa719fa7bd775f7a0af3/analysis/1406630106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Illusion%20Spell%20Tweaks%20V1-1-5283-1-1.rar?fid=22043&ttl=1535761884&ri=8192&rs=8192&setec=e01a5866c229809536143b6dfe7cc931"
    },
    {
      "fileId": "52859",
      "name": "Skyrim Dark V 2-3",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5673",
      "fileName": "Skyrim Dark V 2-3-5283-2-3.rar",
      "uploadedUnix": "1334328734",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/da37b9fbefd8cfb817cd1a18a890005a080024226c45fc9469c0a4babc32e50d/analysis/1406813591/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Dark%20V%202-3-5283-2-3.rar?fid=52859&ttl=1535761885&ri=8192&rs=8192&setec=c523c37ad78c6ac0e787aef5b75f14a5"
    },
    {
      "fileId": "64448",
      "name": "BetterMage V 16-7-3",
      "version": "16.7.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11335",
      "fileName": "BetterMage V 16-7-3-5283-16-7-3.rar",
      "uploadedUnix": "1338322701",
      "modVersion": "16.7.3",
      "virusScanUrl": "https://www.virustotal.com/file/ddc5be25075988dd2b6e2ad99ed792e439be3f532d58128e29c86e0611668f57/analysis/1406923992/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMage%20V%2016-7-3-5283-16-7-3.rar?fid=64448&ttl=1535761885&ri=8192&rs=8192&setec=fe9ec72c29e2581aa7a669cc18d71d2d"
    },
    {
      "fileId": "67975",
      "name": "BetterMageAlt V 16-8",
      "version": "16.8",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "11284",
      "fileName": "BetterMageAlt V 16-8-5283-16-8.rar",
      "uploadedUnix": "1339697095",
      "modVersion": "16.8",
      "virusScanUrl": "https://www.virustotal.com/file/43800c0ea781181e74d3c86872d41e94295b5660efbfdeecc87ef7bc3e2194ff/analysis/1406958971/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMageAlt%20V%2016-8-5283-16-8.rar?fid=67975&ttl=1535761886&ri=8192&rs=8192&setec=b793173fb26c0e3d90076613206fe6a9"
    },
    {
      "fileId": "84847",
      "name": "BetterMage V 16-8-2",
      "version": "16.8.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11332",
      "fileName": "BetterMage V 16-8-2-5283-16-8-2.rar",
      "uploadedUnix": "1346171102",
      "modVersion": "16.8.2",
      "virusScanUrl": "https://www.virustotal.com/file/c7bf8327c722fb2189566e3c0204356c8fe2ca5511d2d9f5fd129b2eaae9aeba/analysis/1407128175/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterMage%20V%2016-8-2-5283-16-8-2.rar?fid=84847&ttl=1535761886&ri=8192&rs=8192&setec=3c9fbf338d6012586da74a07e7a4d47d"
    }
  ]
}