{
  "modId": 52834.0,
  "modName": "Dragons Giants Mammoths and Trolls Drop Skulls",
  "summary": "Adds skulls to loot from slain dragons, giants, mammoths, trolls and frost trolls. The skulls are in addition to existing death loot for each creature. They may be sold for gold, or kept as trophies and displayed on tables, in fire pits or elsewhere. Dragon skulls may be changed to dragon bones and Mammoth skulls to tusks at a smelter.",
  "descriptionHtml": "I&#39;ve uploaded this mod to Nexus, because many Steam users requested it uploaded here, too.\r<br />\r<br />When I was playing Skyrim for the first time, I kept track of how many trolls my character slain. After seeing troll skulls scattered throughout the game world, I thought, &#34;Wouldn&#39;t it be great if every troll dropped a skull?&#34; The idea for Drop Skulls was born, but I didn&#39;t want to stop at just troll skulls. So I added skulls to the death loot for giants, mammoths and dragons, too. It&#39;s a simple mod, but I enjoyed it. Hope you do, too&#33;\r<br />\r<br />========= \r<br />Contents \r<br />========= \r<br />\r<br />1. Description \r<br />2. Skulls Added to the Game \r<br />3. Frequently Asked Questions \r<br />4. Requirements \r<br />5. Installing or Updating \r<br />6. Uninstalling \r<br />7. Known Bugs \r<br />8. Incompatibilities with Other Mods \r<br />9. Version History \r<br />\r<br />============== \r<br />1. Description \r<br />============== \r<br />\r<br />Dragons, Giants, Mammoths and Trolls Drop Skulls adds skulls your character may loot from slain dragons, giants, mammoths, trolls and frost trolls. The skulls are in addition to existing death loot for each creature. They may be sold to shopkeepers, or kept as trophies. They can be dropped, moved and displayed on tables, in fire pits or elsewhere. Dragon skulls may be smelted into two dragon bones, and mammoth skulls may be smelted into three tusks. No DLC required.  Good skull hunting&#33; \r<br />\r<br />=========================== \r<br />2. Skulls Added to the Game \r<br />=========================== \r<br />\r<br />Item Name | Weight | Value \r<br />-------------------------------\r<br />* Dragon Skull | 30.0 | 1500 \r<br />* Frost Troll Skull | 4.0 | 150 \r<br />* Giant Skull | 6.0 | 250 \r<br />* Mammoth Skull | 45.0 | 300 \r<br />* Troll Skull | 3.5 | 100 \r<br />\r<br />============================= \r<br />3. Frequently Asked Questions \r<br />============================= \r<br />\r<br />Q. What will Drop Skulls do? \r<br />A. You will be able to loot skulls from slain dragons, giants, mammoths, trolls and frost trolls. They may be kept as trophies, dropped, smelted, or sold for gold. \r<br />\r<br />Q. Is any DLC required? \r<br />A. No, but Drop Skulls is compatible. \r<br />\r<br />Q. I&#39;ve already downloaded this mod from Steam. Does this mod add anything new?\r<br />A. No. It is the same mod. I&#39;ve just made it available to Nexus users, because they requested it.\r<br />\r<br />Q. Do named dragons have unique skulls? \r<br />A. Not yet. But if there is enough interest in this mod, I will add this feature in an add-on mod, which is currently available only at Steam. \r<br />\r<br />Q. Will you add skulls for Dremora and other creatures? \r<br />A. Not yet. But if there is enough interest in this mod, I will upload another mod having Dremora and other skulls, which is currently available only at Steam.\r<br />\r<br />Q. Who will buy the skulls? \r<br />A. Shopkeepers who sell general goods and alchemy ingredients. \r<br />\r<br />Q. What can I do with skulls I don&#39;t sell? \r<br />A. Suggestions: Use dragon skulls as lawn ornaments outside your home. Give a jarl giant skulls to put around his throne. Fill a housecarl&#39;s bedroom with troll skulls to the ceiling. Smelt dragon skulls into bones and mammoth skulls into tusks. \r<br />\r<br />Q. Can I pick up mammoth and dragon skulls I find lying around? \r<br />A. You cannot pick up skulls of these types, which are already in the game world. However, there is one of each new skull you may find and pick up: \r<br />- frost troll skull on the porch of Fendal&#39;s house, in Riverwood \r<br />- giant skull in the brazier outside Jorrvaskr, in Whiterun \r<br />- mammoth skull at Whitewatch Tower, north of Whiterun \r<br />- dragon skull outside High Hrothgar, where the Greybeards reside (exit to the courtyard, turn left, walk through the gate) \r<br />\r<br />Q. Does Drop Skulls change existing items? \r<br />A. It increases the base value of troll skulls from 5 to 100 gold coins. \r<br />\r<br />Q. Does Drop Skulls add new meshes and textures? \r<br />A. Yes, it adds dragon skulls, mammoth skulls, frost troll skulls and giant skulls, which can be picked up, dropped and moved. Frost troll skulls have a different texture from troll skulls. \r<br />\r<br />Q. Why are the skulls so big? \r<br />A. Troll, dragon and mammoth skulls are the same size as skulls already in the game. Giant skulls were made larger than troll skulls. \r<br />\r<br />Q. Why are dragon skulls worth so much? \r<br />A. Dragons haven&#39;t been around Skyrim for centuries, so their skulls are rare. But the skulls really aren&#39;t overpriced when compared to other dragon death loot. They are worth the same as three dragon bones. \r<br />\r<br />Q. Why are dragon and mammoth skulls so heavy? \r<br />A. Dragon skulls are the same weight as two dragon bones. Mammoth skulls are the weight of three dragon bones, as they are larger. \r<br />\r<br />Q. Why are the frost troll skulls more valuable than other troll skulls? \r<br />A. A load screen for the game claims, &#34;The Frost Troll is the most fearsome of its kind found in Skyrim...&#34; Since it is more fearsome than other trolls, its skull is more valuable. \r<br />\r<br />Q. I use another mod that changes the items creatures drop. Can I use your mod, too?\r<br />A. Sure&#33;  Just put the two mods in the correct load order.  For example, let&#39;s say another mod gives you troll skulls.  You want the troll skulls from that mod to make armor, and the dragon skulls from this mod to display as trophies.  Simply use the Nexus Mod Manager to move the other mod to the bottom of the load order. That way, you will get both skulls.  Instructions on changing the load order are here: \r<br />http://wiki.tesnexus.com/index.php/How_to_install_Skyrim_mods\r<br />\r<br />Q. What will happen if I uninstall? \r<br />A. Dragon, mammoth, giant and frost troll skulls collected will be removed from the game. All troll skulls collected will remain but will be worth 5 gold coins. All static skulls (skulls you cannot pick up) will also remain. \r<br />\r<br />=============== \r<br />4. Requirements \r<br />=============== \r<br />\r<br />* Skyrim and the Skyrim updates - required \r<br />* Hearthfire - not required, but compatible \r<br />* Dawnguard - not required, but compatible \r<br />* Dragonborn - not required, but compatible \r<br />* Unofficial Skyrim Patch - not required and untested \r<br />\r<br />=============\r<br />5. Installing \r<br />=============\r<br />\r<br />Use the Nexus Mod Manager by selecting the Download (NMM) button, or install manually by selecting the Download (Manual) button. To download manually, simply place the drop_skulls_sp0ckrates files in the Data folder. \r<br />\r<br />=============== \r<br />6. Uninstalling \r<br />=============== \r<br />\r<br />Use the Nexus Mod Manager to remove the mod, or delete the drop_skulls_sp0ckrates files in the data folder.  \r<br />\r<br />============== \r<br />7. Known Bugs \r<br />============== \r<br />\r<br />No known bugs. \r<br />\r<br />===================================== \r<br />8. Incompatibilities With Other Mods \r<br />===================================== \r<br />\r<br />No known incompatibilities. If Drop Skulls does not seem to work, move it to the bottom of the load order.  If another mod that already gives you troll skulls does not work, move it below this mod in the load order. \r<br />\r<br />=================== \r<br />9. Version History \r<br />=================== \r<br />\r<br />* Version 3.3 - first release on Nexus",
  "categoryId": "78",
  "version": "3.3",
  "author": "sp0ckrates",
  "createdUnix": "1397063802",
  "updatedUnix": "1397063661",
  "containsAdultContent": false,
  "uploadedBy": "sp0ckrates",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000104278",
      "name": "Dragons Giants Mammoths and Trolls Drop Skulls",
      "version": "3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6032",
      "fileName": "Dragons Giants Mammoths and Trolls Drop Skulls-52834-3-3.7z",
      "uploadedUnix": "1397063661",
      "modVersion": "3.3",
      "virusScanUrl": "https://www.virustotal.com/file/0cd0351e34b9bb567a55f232a7477ebb77e50bddd365f279a9e71d137f403a71/analysis/1408013238/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragons%20Giants%20Mammoths%20and%20Trolls%20Drop%20Skulls-52834-3-3.7z?fid=1000104278&ttl=1535836043&ri=8192&rs=8192&setec=78021accbb1f779b0cda102c425e89bd"
    }
  ]
}