{
  "modId": 52885.0,
  "modName": "Henriks Tomb Revisited_Larrys Legacy",
  "summary": "This mod adds two new dungeons and a cute little player home with all the modern amenities.\r<br />Larrys off to find some loot, but it seems his action have had consequences. \r<br />Do you want to go after him?\r<br />",
  "descriptionHtml": "Larry&#39;s Legacy\r<br />\r<br />Someone&#39;s told Larry of a possible looting opportunity and he&#39;s left his little house in Riverwood to go and check it out.\r<br />\r<br />Your journey begins at Larry&#39;s house just outside the Riverwood gate&#39;s where you&#39;ll find the first clue to his whereabouts and the key to henrik&#39;s tomb.\r<br />Larry&#39;s not at home so you can use it as your own. It&#39;s a nice cosy and function house with just about everything you&#39;ll need as a base of operations.\r<br />\r<br />What&#39;s in this mod:\r<br />\r<br />1 x Nordic Ruin (Henrik&#39;s Tomb) near Bleakfalls Barrow\r<br />1 x Mine / Dwemer ruin (Vengere Mine) west of Shor&#39;s Stone - north of Riften\r<br />1 x Player home (Larry&#39;s House) just outside Riverwood\r<br />1 x Secret Stash (hidden somewhere in skyrim - lookout for the clues)\r<br />2 x New Spell&#39;s (The Cold Snap / Direct Inquiry)\r<br />1 x New weapon (Larry&#39;s lucky sword)\r<br />\r<br />This is my second instalment of Larry&#39;s little adventure and contain&#39;s some of the same cells (Henriks Tomb) as the first, so if you have my previous mod I would suggest removing it and creating a clean save before using this one....it&#39;s worth it...this is much better&#33;&#33;\r<br />\r<br />Look closely as there are diaries and note&#39;s scattered around the place and on npc&#39;s to guide you.\r<br />During testing this took me about an hour and thirty minutes of game-play to complete, not including the search for the secret stash.\r<br />\r<br />This file has been cleaned with TES5Edit and all attempt&#39;s have been made to make as little impact as possible, but if i&#39;ve missed something please let me know in the comments. i&#39;ve used only Vanilla texture&#39;s and items so no other file&#39;s are needed.\r<br />\r<br />I&#39;m planning a third and final part to this series which i&#39;ll hopefully have done soon called Featherbrook Castle where we&#39;ll have a showdown with &#34;THE BOSS&#34;.\r<br />\r<br />This is only my second dungeon mod release so any advice or comments good or bad are welcome..\r<br />\r<br />Thank&#39;s. ",
  "categoryId": "88",
  "version": "1",
  "author": "GreenSmirf",
  "createdUnix": "1397237437",
  "updatedUnix": "1397237158",
  "containsAdultContent": false,
  "uploadedBy": "Greensmirf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000104530",
      "name": "Larrys Legacy_Henriks Tomb Revisited ",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "314",
      "fileName": "Larrys Legacy_Henriks Tomb Revisited -52885-1.zip",
      "uploadedUnix": "1397237158",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8b45142f7e74e820a2eae924b0b159951e4141dc7996bda08e211624c77a3eed/analysis/1408016287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Larrys%20Legacy_Henriks%20Tomb%20Revisited%20-52885-1.zip?fid=1000104530&ttl=1535836129&ri=8192&rs=8192&setec=88bfbc81f7151eac6dc27e04eebd26db"
    }
  ]
}