{
  "modId": 52909.0,
  "modName": "Simple Divorce",
  "summary": "Allows a simple way to divorce your spouse and restart the marriage quests through a dialogue.  Separate option for divorcing dead spouse.",
  "descriptionHtml": "[center][size=5][color=#ff0000]THIS MOD ONLY WORKS for [/color][color=#ff7700]VANILLA VOICED NPCS[/color]\r<br />[color=#ff0000]that were MARRIED by the [/color][color=#ff7700]VANILLA QUEST[/color][color=#ff0000].[/color]\r<br />[color=#ff0000]IF YOU MARRIED a CUSTOM-VOICED NPC, or by ANY OTHER MEANS than VANILLA,\r<br />THIS WILL NOT WORK&#33;[/color][/size][/center]\r<br />\r<br />[size=+1][color=#ffff99][b]Why make this mod?[/b][/color][/size]\r<br />I made this mod ages ago b/c I was lazy and wanted a way to divorce a spouse w/o having to do a string of console commands.\r<br />I was requested to bring it to SSE so here it is.\r<br />\r<br />You love your (vanilla) spouse. Perhaps you&#39;ve been on many adventures together, and when you return home from being away they are always happy to see you. But... you met someone hotter. Maybe even someone who is custom voiced and has a personality&#33; Some marriage mods have a ton of extra foo-foo and scripts and packages, but maybe you&#39;re looking for something lightweight, pure and practical. Here it is&#33;\r<br />\r<br />[size=+1][color=#ffff99][b]What this is:[/b][/color][/size]\r<br />This very simple, very tiny mod quickly and easily allows you to divorce and then you&#39;re free to remarry.\r<br />Part I:\r<br />- 1 dialogue, 1 script\r<br />To make this, I simply took the information on [url=http://www.uesp.net/wiki/Skyrim:Marriage]UESP Marriage[/url] under &#34;Notes... Steps to remarry&#34; and translated it to papyrus. With this mod, you won&#39;t have to fiddle with console and it&#39;ll feel less like cheating. It removes you and your spouse from married factions and restarts the marriage quests.\r<br />This mod will work with any NPC with vanilla marriage voice type that was married using the standard vanilla marriage procedure.\r<br />Part II:\r<br />- Divorce Dead Spouse - The second feature is a quest that will divorce you if your spouse is dead.\r<br />It was requested by several people, and it was reported to work. See the bug reporting note at the bottom.\r<br />- This feature is not active by default, so will not cause any problems unless it is activated (see next section).\r<br />It was a real pain to try to make this feature because of the nature of papyrus, aliases and properties, and I hadn&#39;t done anything like this before.\r<br />\r<br />[size=+1][color=#ffff99][b]How to use it:[/b][/color][/size]\r<br />- Speak to your spouse and tell them you want a divorce. That&#39;s it, done. They will agree and leave. They won&#39;t hate you, no repercussions, just like as if you did it by console.\r<br />(Read: This means your spouse must be alive. Obviously you can&#39;t talk to them if they&#39;re dead. You could try targeting them in console and type &#34;resurrect&#34; but that command only works if it&#39;s done RIGHT after they die. Otherwise, the game will still act like they&#39;re dead, even if they get up again. See the [url=http://www.uesp.net/wiki/Skyrim:Console]UESP console page[/url] for more information.)\r<br />- Load order shouldn&#39;t matter, but probably better to load after any mod that alters the marriage quests. This mod doesn&#39;t touch them directly, just resets them through a new quest file.\r<br />- If your spouse is dead (this part was requested and I had reports that it works), you must start the new quest manually through the console:\r<br />\r<br />[i]startquest SimpleDivorceSpouseDead[/i]\r<br />\r<br />Then activate your dead spouse and a message will pop up, allowing you to divorce, or do nothing.\r<br />The quest will then stop itself. If you marry again and want to divorce again, you must again start it manually.\r<br />\r<br />If you like it please ENDORSE&#33;&#33; :-D\r<br />\r<br />[size=+1][color=#ffff99][b]NOTES:[/b][/color][/size]\r<br />- Any problems just let me know, though conflict is very unlikely, you just never know.\r<br />- Might conflict with UFO/AFT/EFF if those mods do stuff to marriage factions, NPCs, or quests.\r<br />More testing would be helpful, if you use them and would like to volunteer.\r<br />- Reporting issues, give as much detail as possible. Otherwise, I can&#39;t help&#33; And I won&#39;t try.\r<br />Vague unhelpful bug reports will be IGNORED and DELETED.\r<br />- Questions already addressed in the description will be IGNORED and DELETED. You need to read it&#33;\r<br />- This mod [color=red]does NOT require HF DLC[/color], it is just vanilla Skyrim. That means it does NOT take into account HF homes, or kids AI regarding divorce & marriage reset. If you have a problem with kids, it is most likely something with the HF home, or a custom home, or some other HF mod having to do with homes/kids/marriage, so try to determine if this is the case BEFORE posting. I CANNOT help with those.\r<br />- If for whatever reason this mod doesn&#39;t work for you, just do the console route, see the link above.",
  "categoryId": "24",
  "version": "1.2",
  "author": "Anduniel",
  "createdUnix": "1397283480",
  "updatedUnix": "1407913159",
  "containsAdultContent": false,
  "uploadedBy": "Anduniel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000104612",
      "name": "Simple Divorce",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "305",
      "fileName": "Simple Divorce-52909-1-0.7z",
      "uploadedUnix": "1397283002",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a1ad46d165d5668ef4cb06a7a68865704d452f050af3cbad27f95e9d824101a9/analysis/1408016887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Divorce-52909-1-0.7z?fid=1000104612&ttl=1535836169&ri=8192&rs=8192&setec=7d63cf58e541dfdeeef7cada82f6b220"
    },
    {
      "fileId": "1000105333",
      "name": "Simple Divorce",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "305",
      "fileName": "Simple Divorce-52909-1-1.7z",
      "uploadedUnix": "1397769620",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/98ec53c033fb5ba9eb2abd50bc7d3c495dab7f107ca0ad134cd58c2e52439cdd/analysis/1408026784/",
      "changelogHtml": " - Changed a condition on the divorce line which was causing it to not come up.  Seems that completing the marriage quest doesn&#39;t work b/c it&#39;s a script event, so now the conditions are:  In PlayerMarriedFaction, RelationshipRank 4, and vanilla MarriageVoicesAll. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Divorce-52909-1-1.7z?fid=1000105333&ttl=1535836170&ri=8192&rs=8192&setec=d7c82f7cf728ff3e8b64fbafb2fe894c"
    },
    {
      "fileId": "1000121804",
      "name": "Simple Divorce",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1503",
      "fileName": "Simple Divorce-52909-1-2.zip",
      "uploadedUnix": "1407913159",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e9c712a6385707fbf3ad27722ad073ed9a3a0b13156b2e32821ee0ea878cb367/analysis/1407913220/",
      "changelogHtml": " Changed the dialogue condition to simply Alias is an external reference to the vanilla Spouse from the vanilla marriage quest.  Now should be NO problem getting the dialogue option.  That&#39;s really the very simplest, most fool-proof way I can possibly think of.  It still does NOT touch the vanilla quests in any way and does NOT conflict. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Divorce-52909-1-2.zip?fid=1000121804&ttl=1535836170&ri=8192&rs=8192&setec=a2edfdf9fa9e070d534459cd542170a4"
    }
  ]
}