{
  "modId": 52948.0,
  "modName": "Venus - Custom Girl Body Replacer",
  "summary": "A custom female body replacer specifically tweaked to emphasize the most amount of variance between a perky, naturally shaped girl and a larger, more fantastic woman.",
  "descriptionHtml": "[img]http://reaverlord.mzzhost.com/images/bikini001n.jpg[/img]\r<br />New bodies and skin textures for Skyrim. When modders post them, if you’re like me, you hate having to back up all your—arranged just right—game files just to try them out. Well, brothers and sisters, I’m here to tell you those days are over.\r<br />\r<br />Just place the Test Drive esp, bsa, and bls files in your data folder and spawn the Venus Pack using your command console. Inside the container, you will find a Venus “costume”. It has hands, feet, body and head that, when worn, masks your current body type with a Venus body. \r<br />\r<br />[size=5]You can test out this new body without replacing a single game file&#33;[/size]\r<br />\r<br />Now you got nothing to lose by trying Venus in your game—this means you million peeps out there who look but never touch because you don’t wanna mess up your system. I sooo get that. The Test Drive was made just for you. \r<br />\r<br />It is the only truly honest (and painless) way to compare the Venus body to your favorite custom body style. You can toggle Venus on and off from your inventory menu, seeing precisely how it shifts your player’s body.  Be sure you fiddle with the weight slider while wearing on and off, too.\r<br />[center][img]http://reaverlord.square7.ch/images/bikini004.png[/img][/center]\r<br />Once you have placed the mod’s files in your Data folder and started your game, press tilde ` and type:\r<br />[color=#ffff00][font=courier new,courier,monospace]help venus 0[/font][/color]\r<br />\r<br />When you see the Venus CONT code, type:\r<br />[color=#ffff00][font=courier new,courier,monospace]player.placeatme thecode 1[/font][/color]\r<br />\r<br />Grab the Venus parts from the bag that appears and try them on. If you press tilde ` again and type:\r<br />[color=#ffff00][font=courier new,courier,monospace]showracemenu[/font][/color] \r<br />\r<br />You can alter the Venus body’s skin color, hair color, and weight. FYI: Other configuration options are disabled due to the head/body&#39;s mask-like nature.\r<br />\r<br />[color=#ffff00][font=courier new,courier,monospace]NOTE[/font][/color]: Venus requires a UNP-type skeleton to work. If you have a CTD the moment you try on the body using Test Drive, you need one of these skeletons. Grab the CTD Fix file I have in the DL area if you use CBBE/Vanilla/etc as your default body. The file is a small nif file that will not affect/replace/harm your default body in any way.\r<br />[img]http://reaverlord.mzzhost.com/images/head004.jpg[/img]\r<br />After you’ve ran a few laps in the Venus suit, it’s time to decide whether to make the switch for good.  Of course, Venus is by no means ideal. It is a body shape based on my own personal taste and aesthetic. I took photo sets I liked online and did my best to shape Venus according to them. What I think makes it unique is it has a good span of change between weight slider extremes. Arms and legs shift slightly in muscular definition. Waist/hips increase/decrease slightly in mass. Folds in skin/fat areas fall as weight increases. Breasts transform from real(small, tear-shaped) to fake(large and unrealistically spherical). Pubic hair even grows. I&#39;m also toying around with the idea of adding peach fuzz to the meshes. \r<br />[img]http://reaverlord.mzzhost.com/images/layingvenus1.jpg[/img]\r<br />[img]http://reaverlord.mzzhost.com/images/head005.jpg[/img]\r<br />Your common variety UNP/Sevenbase/TopModel skin textures found around Nexus will work with the Venus body meshes. But this custom skin texture pack has been included anyway just in case you want permanently what you see in the test-drive. \r<br />\r<br />The skin is based on the Dimon99 and Navetsea skins(to remove seams) and my own special mixing and matching of imagery I bought from my stock account. My utmost thanks to those authors for allowing modders to build on their great work&#33;\r<br />\r<br />[img]http://reaverlord.mzzhost.com/images/head006.jpg[/img]\r<br />[b]Fun fact: [/b][i]There are dozens of unique “vanilla” outfits you can potentially wear in Skyrim[/i]. Sure, I would like to port a skimpy version of them all to show off Venus.  However, too much of that starts to make your game look sleazy. That’s why only certain armors have been reworked for the Venus body. These specific outfits have been crafted so they look good, but still retain a lore-friendliness to the game’s subject matter. Sure, there are forsworn and bandits who don’t wear a lot of cloth. Those outfits are definitely cover…er not covered…, in the Venus Lore Pack. So are the rest you see in the photos. Unfortunately, there is no test-drive for this part of the Venus mod. You will have to back up your original directories if you wanna test out the Lore mod. I could create individual outfits and individual esps for each one. But I’m too lazy. \r<br />\r<br />[img]http://reaverlord.mzzhost.com/images/head007.jpg[/img]\r<br />[LIST]\r<br />[*]Credits go to Nightasy for his original UNP skimpy armors pack. He gave permission to use certain aspects of it to create the Venus Lore pack.[/*]\r<br />[*]Credit goes to Dimon, Navetsea, Nuska, alt3rn1ty, and Petrovich for their great skins I used in part as bases for the skin texture.[/*]\r<br />[*]Credit goes to xp32, Mr. Troublemaker, and all the other amazing modders who created the first UNPB skeleton, used to cause the breast animation on the Venus body.[/*]\r<br />[*]Credit goes to Onigiri023 for their permission to port their Tomb Raider outfit.[/*]\r<br />[*]Credit goes to Peter Cooley for his permission to port his Leia outfit to this body.[/*]\r<br />[*]Credit goes to Tiwa44 for his amazing min-dress versions of the Party/Beggar clothes I ported for Venus.[/*]\r<br />[*]Credit goes to Petrovich for the original lingerie pack he created for UNP.[/*]\r<br />[*]Credit goes to my friend and fellow DAZ3D artist Hongyu for his permission to use his Bikini mesh parts on some of my body’s outfits.[/*]\r<br />[*]Credit goes to Newermind99 for their permission to port the Ayumi meshes.[/*]\r<br />[*]Credit goes to Japanarou for his original Beaded Bikini meshes.[/*]\r<br />[*]Credit goes to Izumiko for their great Wonder woman outfit, which has been ported & included along with my own retro Wonder Woman outfit.[/*]\r<br />[*]Credit goes to Ryk, for his excellent bikini meshes used in parts of my Venus Lore Outfits Pack2(TBR).[/*]\r<br />[*]Credit goes to Bethesda for Skyrim and its meshes I have used primarily to create these mods.[/*]\r<br />[/LIST]\r<br />\r<br />[img]http://reaverlord.mzzhost.com/images/head008.jpg[/img]\r<br />You may not upload, distribute or post—at any site—this body style or its related mod materials. All rights are owned by either me or those authors whom I have mentioned. If I have not provided an honorary mention of authors who helped contribute to this mod, please PM me and I will see to it you are recognized or the files immediately removed.   \r<br />\r<br />[img]http://reaverlord.mzzhost.com/images/head009.jpg[/img]\r<br />[LIST]\r<br />[*][b]WinRAR won&#39;t open the downloaded files??? -[/b] I used an experimental RAR compresso which works for some versions of WinRAR, but not others. The fix is change the filename from RAR to ZIP and use Windows or WinZIP to open. Will update the download links soon.[/*]\r<br />[*][b]Why doesn’t the test drive head’s eyes move or talk? -[/b] Because it is a mask. The full replacer doesn’t do this, only the test drive.[/*]\r<br />[*][b]Can I have the test drive as my normal, animated head?[/b] [b]-[/b] Not at this time. I am still experimenting with the CK on how to get the custom head to work as a regular head.[/*]\r<br />[*][b]Why do her eyes shimmer & flash white at times with the Test Drive mask??[/b] [b]-[/b] No idea. Side effect that let&#39;s you know the face is in fact a mask? That&#39;s kinda cool.[/*]\r<br />[*][b]Why can’t I put clothing on the Venus Test Drive Body? - [/b]Because logically it covers up your default body, as if it were clothing. Unless you use custom mash-up items, the game will remove the Venus part and show whatever clothing you chose. The full body replacer has clothing though&#33;[/*]\r<br />[*][b]The head, hands, and feet work fine, but why does my game crash when I put on the Venus body using Test Drive? - [/b]You are one of those people who requires a skeleton used by UNP-based bodies. Just use the CTD Fix I have added if your game crashes when you try on the body. It&#39;s a common issue with an easy fix.[/*]\r<br />[*][b]Her butt cheeks are spread out too much&#33; - [/b]You must be using a custom animation idle that pulls the cheeks apart. I personally don&#39;t mind this, but you may not so I designed the meshes to work best with Skyrim&#39;s default female standing idle. Just FYI.[/*]\r<br />[/LIST]\r<br />[img]http://reaverlord.mzzhost.com/images/layingvenus2.jpg[/img]",
  "categoryId": "29",
  "version": "1.0",
  "author": "ReaverLord",
  "createdUnix": "1399587252",
  "updatedUnix": "1406989279",
  "containsAdultContent": true,
  "uploadedBy": "ReaverLord",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114476",
      "name": "Venus Test Drive 2.0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "160641",
      "fileName": "Venus Test Drive 2.0-52948-2-0.rar",
      "uploadedUnix": "1403652829",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/746767fde2f4f1473b5f32cfc2882dd5fb29045af241fcfc73c51b220099bf4d/analysis/1408141534/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Venus%20Test%20Drive%202.0-52948-2-0.rar?fid=1000114476&ttl=1535836213&ri=8192&rs=8192&setec=e14666ecb2d7f97573b95c6ad11e83fa"
    },
    {
      "fileId": "1000114477",
      "name": "Venus Body Replacer",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2917",
      "fileName": "Venus Body Replacer-52948-2-0.rar",
      "uploadedUnix": "1403653136",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/a334e1b9a8614847f4e2b28d638bdb2da43f122ebd7a4762f6b95305e7ac8675/analysis/1408141537/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Venus%20Body%20Replacer-52948-2-0.rar?fid=1000114477&ttl=1535836214&ri=8192&rs=8192&setec=2be09133bfd35c70b37edd56851020d9"
    },
    {
      "fileId": "1000115490",
      "name": "Venus Body Textures 2.0",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125667",
      "fileName": "Venus Body Textures 2.0-52948-2-0.rar",
      "uploadedUnix": "1404253000",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/b1c95e9e1214ce374ea240fb36e79da6b0bd18d6d84e70b420006cb1fe0d5c54/analysis/1408156858/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Venus%20Body%20Textures%202.0-52948-2-0.rar?fid=1000115490&ttl=1535836214&ri=8192&rs=8192&setec=5972321967b3cfa291de2fe241515f31"
    },
    {
      "fileId": "1000120307",
      "name": "VenusLore Outfits Pack1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "269324",
      "fileName": "VenusLore Outfits Pack1-52948-1-0.rar",
      "uploadedUnix": "1406989279",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/be386f91dd2e713d889ab2b94aba63faa94db2ff9113deeadc6497d9f1bacdde/analysis/1408382623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VenusLore%20Outfits%20Pack1-52948-1-0.rar?fid=1000120307&ttl=1535836215&ri=8192&rs=8192&setec=2b1e02e784cd4f5d44e76b766cd597c8"
    }
  ]
}