{
  "modId": 52953.0,
  "modName": "Turn fixed and movable statics into collectable items",
  "summary": "This will show you how to turn a movable or fixed static item into a misc item (which you can add to your inventory). CK needed.",
  "descriptionHtml": "This is part of the work log for a mod I&#39;m working on. For all mods that I will publish I will attach a &#34;Making of - tutorial&#34; so that interested modders can learn new things or suggest better solutions in case they spot mistakes). \r<br />\r<br />I.\r<br />GOAL: Convert all human bone parts (skulls, arms, legs, ribcages) from movable or fixed statics into miscellaneous clutter which can be added to your inventory. \r<br />METHOD: Copy the nif folder path of the MovableStatic clutter into a new form in the MiscItems category, then search and replace them to preserve the use info.\r<br /> \r<br /> \r<br />WALKTHROUGH:\r<br />1. \r<br />Fire up the CK. From the &#34;File&#34; (upper left) menu select &#34;Data&#34; and, from the list, double-click &#34;Skyrim.esm&#34; and hit &#34;OK&#34;. WARNING: Do not click &#34;Set as active file&#34;. \r<br />Click &#34;Yes to all&#34; to all error boxes that appear.\r<br /> \r<br />From the right side of the object window (where it shows you the editor ID, Form ID, Count, etc) right click and from the drop down menu select &#34;Create New Object Window&#34;. Place them side by side. We won&#39;t need the render window.\r<br /> \r<br />In the first object window, navigate to Items &gt; MiscItem &gt; CLUTTER &gt; Bones.\r<br />In the second object window, navigate to WorldObjects &gt; MovableStatic &gt; CLUTTER &gt; Bones. In this window, the items which interest us are:\r<br /> \r<br />BoneHumanArmL\r<br />BoneHumanArmR\r<br />BoneHumanBloodyArm\r<br />BoneHumanBloodyBone\r<br />BoneHumanBloodyHand\r<br />BoneHumanBloodyLeg\r<br />BoneHumanBloodyRibcage\r<br />BoneHumanBloodyShoulder\r<br />BoneHumanBloodySkull\r<br />BoneHumanFoot\r<br />BoneHumanFoot\r<br />BoneHumanHand\r<br />BoneHumanHand\r<br />BoneHumanLeg\r<br />BoneHumanLeg\r<br />BoneHumanRibcage\r<br />BoneHumanRibcageFull\r<br />BoneHumanSkull\r<br />BoneHumanSpine\r<br /> \r<br />2. \r<br />Let&#39;s start with BoneHumanArmL in this second window (the one with &#34;WorldObjects &gt; MovableStatic &gt; CLUTTER &gt; Bones&#34;). \r<br />Double click it (or right click and select &#34;edit&#34;). You&#39;ll see the first three fields are &#34;ID&#34;, &#34;Name&#34; and &#34;Model&#34;. \r<br />From the &#34;Model&#34; field copy the folfer path (ClutterBonesHumanArmLeft.nif) and close the window (or click &#34;cancel&#34;). \r<br /> \r<br />3. \r<br />Go to the first window (the one with &#34;Items &gt; MiscItem &gt; CLUTTER &gt; Bones&#34;). In the object list, right click and select &#34;New&#34; from the drop-down menu. Above the &#34;OK&#34; button you&#39;ll see the Model field which is empty. Click &#34;Edit&#34; to open the &#34;Model Data&#34; window. Click &#34;Edit&#34; after the &#34;Model File Name&#34; field to open the &#34;Select File&#34; window. Paste the folder path you copied from the MovableStatic item (ClutterBonesHumanArmLeft.nif) and hit &#34;OK&#34;. You should now see the model preview renedered in the Model Data window, where we now hit &#34;OK&#34;.\r<br /> \r<br />4. \r<br />We now need to add ID, Name, weight, value and keywords. ID should be &#34;01BoneHumanArmL&#34; (the &#34;01&#34; will make it show up at the top of the list and be easily found). Name should be &#34;Left arm&#34;. I&#39;ve approximated the value at 2 gold per weight unit, based on the vanilla human skull. Weight should be 2 and value 4. In the keywords section, right-click and select &#34;Add&#34;. In the new window in the &#34;Filter&#34; field, type &#34;VendorItemAnimalPart&#34;, select it from the list and either double-click it or click OK. Our new MiscItem is now complete and again we click &#34;OK&#34;. It will now appear in the &#34;Items &gt; MiscItem &gt; CLUTTER &gt; Bones&#34; list.\r<br /> \r<br />5.a \r<br />Now, we must replace all instances of MovableClutter in the game with our own MiscItem in order to preserve the use data (which tells the game where to put them in the world).\r<br />To do this, click the top of the Render window and press Ctrl+F to bring up the &#34;Search & Replace&#34; window. By default, it&#39;s set to the &#34;Single Form Replace&#34; tab (which we will use) and has the &#34;Same Base Object Only&#34; and &#34;Selection Only&#34; boxes checked. Uncheck &#34;Same Base Object Only&#34; and &#34;Selection Only&#34;. All the checkboxes should be empty.\r<br /> \r<br />NOTE: This way we can find our own new item in the list (which &#34;Same Base Object Only&#34; would prevent, since our MiscItem is not the same base category as the MovableStatic we want to replace. Also, &#34;Selection only&#34; applies the change to a single object you have selected in the render window, &#34;Current Cell Only&#34; applies the swap only in the cell currently loaded in the render window and &#34;Current World Only&#34; applies the swap only in the worldspace loaded in the render window. If you would like the swap to be in all exterior cells, you&#39;d have to select &#34;Tamriel&#34; from the &#34;Worldspace&#34; list in the &#34;Cell View&#34; window and hit &#34;Go&#34;. But we want to replace all the instances of movable or fixed static in the game (meaning all exterior and interior cells) with our own misc item. To do that, all the three options in the &#34;Search & Replace&#34; window (&#34;Current World Only&#34;, &#34;Current Cell Only&#34; and &#34;Selection Only&#34;) must be unchecked.\r<br /> \r<br />In the &#34;Search for&#34; field, find &#34;BoneHumanArmL&#34;. In the &#34;Replace with&#34; field below, find our &#34;01BonehumanArmL&#34;. Hit OK and you&#39;ll receive a warning: &#34;This will replace all the instances in the game. Are you absolutely sure you want to do this?&#34;. Hit &#34;Yes&#34; and you&#39;ll see a confirmation: &#34;Search/Replace done, replaced 257 objects&#34;. Click OK to finalise. Now you will be able to pick up and add to your inventory all the skeletal left arms you find in the game that were previously movable static. \r<br /> \r<br />5.b \r<br />Now we need to replace the fixed static (the one you can&#39;t manipulate and is fixed by a bounding box). We repeat step 5.a with the same prerequisites (uncheck all the boxes) and in the &#34;Search for&#34; field, find &#34;BoneHumanArmLStatic&#34;. In the &#34;Replace with&#34; field below, find our &#34;01BonehumanArmL&#34;. After you&#39;re done, all the previously static skeletal left arms can be picked up and carried in your inventory.\r<br /> \r<br />6. Repeat steps 2-5 with the rest of the objects in the &#34;WorldObjects &gt; MovableStatic &gt; CLUTTER &gt; Bones&#34; list. ",
  "categoryId": "82",
  "version": "1.0",
  "author": "Mogribus",
  "createdUnix": "1397385220",
  "updatedUnix": "1397385220",
  "containsAdultContent": false,
  "uploadedBy": "mogribus",
  "primaryFile": null,
  "files": []
}