{
  "modId": 52963.0,
  "modName": "The Ring Of Tetlotr",
  "summary": "Dont be to harsh ;)",
  "descriptionHtml": "This is a redo of my second mod, it will add a gold ring made with a gold ingot and a black soul gem *filled* the ring will give Invisibility, Muffle, Sneak Boost, Backstab waterbreathing and pickpocket boost. this is op so if you dont like op things use my other ring mod :)\r<br />\r<br />this mod is just something anyone could make *yeah even you random person who has never coded* i added it for easy access due to me wanting a mod like this in the past that didnt add random shit like more armor, swords and spells that cause instability... \r<br />i used vanilla skyrim perks etc for this mod *as i say a few times here :P* so this WONT have any \r<br />game breaking effects and should be 100% compatible to any mod *i say SHOULD due to if you are the 1 in 99999999999999999999 people that find a mod that conflicts with it you cant complain :P* \r<br />\r<br /> \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Known Bugs:\r<br />\r<br />two muffles listed.\r<br />after going invisible if you activate something *it wears off* there is a slight texture glitch to fix this just take off the ring and leave it off or put it back on to go invis\r<br />sometimes you have to sneak for people to not notice you when you are invis (i use skyrims spells for this so unless i go right into the code *which i cant due to me being a nub still :P* i cant fix, sorry&#33; D: \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Future Plans:\r<br />I Am In The Middle Of Making An Entirely New Invisibility Enchantment For The Ring *meaning i can fix any bugs that this one has if/when i get it done* also it wont have any of the bugs that this version has ^.^\r<br />\r<br />\r<br />\r<br />\r<br />My Time Is Split With Homeschooling, reading and my watching an episode of Naruto Shippuden Once a week in my normal life *yeah ik some life right ...* and with nexus im still learning how to mod *pretty obvious considering all i did was add a ring with perks that were already in the game sticky taped onto it* But im making another mod which although isn&#39;t anything special it will add a full Light/Heavy armor, weapon and jewellery set along with A Special item that will have its own shrine and daedric lord, seeing as though i still suck with modding skyrim i only have the basic enchantments, perks, powers And a rather suckish sketch of the textures. I have no more money and i cant 3d model for shit so unless i either find someone to make them for free or learn how *and im still in the basics of learning how to make mods* to make 3d models the mod will take more time than what its worth on my part but im not gonna bother learning how to 3d model until i get decent with making mods first.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Final Note/Request:\r<br />\r<br />If you have nothing nice to say just leave this page.\r<br />*i don&#39;t classify Constructive criticism as bad, as long as it serves a purpose and has a valid point and objective E.G  * this place [text here] is good to learn how to mod, give it a shot because i think you need to learn a bit more b4 u upload mods*  rather than just &#34;You suck&#34;\r<br />\r<br />&#33;I KNOW I SUCK&#33;\r<br />\r<br />this is just for people who want basic mods and really cbf even trying to make one due to me myself being in that spot at one stage, its also so i can watch myself progress :) \r<br />The mods i add are things that are OFC in my lvl and things that &#33;&#33;&#33;&#33;    I  &#33;&#33;&#33;&#33;  want in skyrim \r<br />still im open to requests if u can think of something easy enough for a nub like me.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />&#33;[COOKIE]&#33;   \r<br />for those that read it all &lt;3",
  "categoryId": "75",
  "version": "",
  "author": "TheEasytooner",
  "createdUnix": "1397408957",
  "updatedUnix": "1397408952",
  "containsAdultContent": false,
  "uploadedBy": "theeasytooner",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000104806",
      "name": "The Ring Of Tetlotr",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "The Ring Of Tetlotr-52963-2-0.zip",
      "uploadedUnix": "1397408952",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/26cc416e7f434270a00b5023b0abe2c780498ccf1000ecb3c6bac6d823801b8e/analysis/1408018883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ring%20Of%20Tetlotr-52963-2-0.zip?fid=1000104806&ttl=1535836244&ri=8192&rs=8192&setec=36a3ec5a29f98bccbbaacc99ccdf9bc6"
    }
  ]
}