{
  "modId": 52968.0,
  "modName": "Shadows of the Moon",
  "summary": "A new Castle high in the mountains south of Falkreath with a mid ranged length high difficulty quest to recieve a new fully voiced follower, in the style of heavy armor/sword and board combat&#33;",
  "descriptionHtml": "This is my first successful mod that I will be uploading. The mod adds a castle which can become a player owned estate, containing plenty of weapon/shield racks, standing weapon racks, all the facilities you would need to perform alchemy/enchanting, 12 total mannequins, a throne room, a trophy room, several locations to plant alchemy ingredients, all spread out across six separate rooms. The layout of the castle is simple 4 on top of 2 rooms, with two floors total. Throne room, trophy room, armory, and library/guest banquet hall on the first floor, with the second floor containing mead hall, children&#39;s room, and master bedroom.\r<br />\r<br />The children&#39;s room is still currently under development to allow your actual children adopted through hearthfire to live with you. This functionality is planned for a future patch.\r<br />\r<br />There is a courtyard currently, but it is currently next-to-empty. I have plans for a future quest line involving the courtyard in the near future.\r<br />\r<br />The mod also adds a new quest named Shadows of the Moon, where you help a poor elf(breton, not really an elf) to slay a necromancer that has been haunting her family for generations. The quest will start as soon as you enter a town or village, where the courier will come up and hand you a letter. A word of caution, this quest shouldn&#39;t be attempted in the first ten levels unless you are particularly skilled.\r<br />\r<br />At the end of the quest, you will be officially given Frostholme Hall as your personal estate, and will unlock the services of a new fully voiced follower Willow Rosenwood, modeled after my wife&#39;s character. Willow is a heavy armor, sword and board fighter class combatant. She currently has a partial marriage quest option, with the only housing option after marriage being Frostholme Hall itself. I plan to leave it this way to show a more sentimental attachment to her family&#39;s estate.\r<br />\r<br />This mod has been tested on at least three occasions with minor bugfixes each time, so it is not perfect, there may be issues here and there for other users. I am unaware of any incompatibilities at this current moment, so if anything is encountered please report it so I can work on fixing it.\r<br />\r<br />This mod DOES require all official DLC.\r<br />\r<br />Future releases plan to include:\r<br />1. Fully functional adopted children access\r<br />2. Larger, more useful courtyard\r<br />3. Guards for the estate\r<br />4. Additional dungeons with related questlines\r<br />5. Two additional fully voiced followers modeled after Willow&#39;s brothers, Manus Locus, the mage, and Virtus Sectus the ranger\r<br />6. Quest driven expansion to the estate\r<br />7. Linked to expansion, options to expand into a full fledged village\r<br />8. Potential wars with Falkreath for territory\r<br />9. A true mage&#39;s tower\r<br />10. Potentially new guild options",
  "categoryId": "96",
  "version": "1.1.3",
  "author": "Aerizanthar",
  "createdUnix": "1397419905",
  "updatedUnix": "1397746039",
  "containsAdultContent": false,
  "uploadedBy": "Aerizanthar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000104833",
      "name": "Shadows of the Moon Initial Release",
      "version": "1.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1325",
      "fileName": "Shadows of the Moon Initial Release-52968-1-1-2.7z",
      "uploadedUnix": "1397419622",
      "modVersion": "1.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/716b6afa39a9aef9cf7bd6852503a91569d630b44749485df8cd4868ffdb7c30/analysis/1408019355/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadows%20of%20the%20Moon%20Initial%20Release-52968-1-1-2.7z?fid=1000104833&ttl=1535836252&ri=8192&rs=8192&setec=8a7b4409a17460c3b88bfb6671660aeb"
    },
    {
      "fileId": "1000105303",
      "name": "Shadows of the Moon",
      "version": "1.1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10498",
      "fileName": "Shadows of the Moon-52968-1-1-3.7z",
      "uploadedUnix": "1397746039",
      "modVersion": "1.1.3",
      "virusScanUrl": "https://www.virustotal.com/file/1fe4a0566ee6e36e2374c5d99e3071c7a505d2f8a87911b30880c0ebc51462a8/analysis/1408026221/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadows%20of%20the%20Moon-52968-1-1-3.7z?fid=1000105303&ttl=1535836253&ri=8192&rs=8192&setec=d2a0e68bf5707d8714ff21c5e6324859"
    }
  ]
}