{
  "modId": 53015.0,
  "modName": "Layla - A nightingale follower",
  "summary": "Do you want a badass archer as follower? Sick and tired of Feandal? Then you&#39;ll want this mod",
  "descriptionHtml": "First of all, sorry for my bad English, it is not my native language. :)\r<br />\r<br />This is Layla. She was a nightingale together with Mercer Frey and Karliah. When times in the guild got rough she left the thieves guild. She went to Riverwood to spend some time with her family but with the dragons returning, she wants to go out and slay these dragons. The problem is, she can&#39;t kill dragons. Therefore she is in the Sleeping Giant Inn, waiting for the Dragonborn.\r<br />\r<br />Layla is a wood elf who starts at level 1 and will level with you till level 81. I am planning to add a journal, describing her life in the guild and a small quest to get her as follower. I&#39;m thinking something involving the golden claw and Bleak Falls Barrow. If you have any suggestions, please let me know.\r<br />\r<br />She was created with the SevenBase Bombshell body, I don&#39;t know if she works with other body types, she probably will.\r<br />\r<br />You have my permission to use this file as you see fit. You may use her in let&#39;s plays and mod reviews. But please give the credit to me.",
  "categoryId": "96",
  "version": "1",
  "author": "Flugellover",
  "createdUnix": "1397547596",
  "updatedUnix": "1397547590",
  "containsAdultContent": false,
  "uploadedBy": "flugellover",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105043",
      "name": "Layla",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Layla-53015-1.rar",
      "uploadedUnix": "1397547590",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f75067ea56d9f70c6eb4985e8bba05d3ff9ed16c501ee4d1f27db451c3f9d5ec/analysis/1408021684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Layla-53015-1.rar?fid=1000105043&ttl=1535836332&ri=8192&rs=8192&setec=a366fd6d60bbf866e2a6b33a6f55fa46"
    }
  ]
}