{
  "modId": 53016.0,
  "modName": "Breezehome Hearthfire Redux",
  "summary": "It is a simple lore friendly overhaul that adds a better integration of hearthfire, so you don&#39;t have to give up an alchemy table to have a child.\r<br />You now have a fully functioning child&#39;s bedroom, a large library in the new basement, and a freezer area.",
  "descriptionHtml": "[center][size=5][color=#953734][font=Arial Black]\r<br />Breezehome Hearthfire Redux[/font][/color][/size]\r<br />\r<br />I will be working on a skyrim SE version for all of my mods as well as mods that i have not finished \r<br />and uploaded, so new mods may be coming as well, please be patient as i \r<br />begin testing.[/center][color=#953734][font=Arial Black][size=5]What Is It[/size][/font][/color]\r<br />It is a simple lore friendly overhaul that adds a better integration of hearthfire, so you don&#39;t have to give up an alchemy table to have a child.\r<br />You now have a fully functioning child&#39;s bedroom, a large library in the new basement, a freezer area, i added an enchanting area, the alchemy area is moved to the basement, added most of the hearthfire amenity&#39;s and no more fire pit in the floor, 3 feet in front of the entrance. I also replaced the walls, and added furnishings more suited to a thane. \r<br />[line]\r<br />[color=#953734][font=Arial Black][size=5]Inspiration[/size][/font][/color]\r<br />This is a redux of an old mod that was removed from the nexus, which was completely broken and needed a total overhaul. so this is exactly that. and while it shares most of the features with the original mod it is completely remade starting from the vanilla home, however now it doesn&#39;t completely break the game in every way possible.\r<br />[line]\r<br />[color=#953734][font=Arial Black][size=5]Instillation[/size][/font][/color]\r<br />To install this mod, it is best to start with a game where you have not purchased breezehome, if you do have it, i will explain that further down.\r<br />Go to the person who sells the house(depends if you concord the city for Ulfric) and buy the house, then immediately buy all the furnishings [u][b]Except[/b][/u] for the alchemy bench, and you [u][b]Must[/b][/u] buy the child&#39;s bedroom furnishings if you want to adopt, the alchemy lab is added by default now so you don&#39;t lose anything if using a previous version. then enjoy the mod. \r<br />\r<br />[b][u]If you already have breezehome[/u][/b]\r<br />Get all of your belongings out of the home, save outside the home, and install the mod\r<br />(if things are not in the proper place you may need to exit and enter the game again, wait a couple of hours, or if all else fails bring up the command prompt using the [b]~[/b] key (left of the 1 on an English keyboard) and type in [u][b]&#34;resetinterior whiterunbreezehome&#34;[/b][/u] (note this is a console command and should be used carefully. save beforehand)\r<br />if you own the alchemy lab you need to go to the stewerd and purchase the child&#39;s bedroom furnishings  [u][b]After[/b][/u] installing the mod \r<br />[line]\r<br />[color=#953734][font=Arial Black][size=5]Uninstillation[/size][/font][/color]\r<br />\r<br />Grab all your stuff, save outside the home and uninstall. \r<br />[line]\r<br />[color=#953734][font=Arial Black][size=5]Bugs[/size][/font][/color]\r<br />If you try and spam purchase all of the decorations you can bug it out and break it, this is not a problem if you don&#39;t spam purchase\r<br />[line]\r<br />[color=#953734][font=Arial Black][size=5]Compatibility and requirements\r<br />[/size][/font][/color]This is a Breezehome [u][b]Hearthfire[/b][/u] redux, meaning it [u][b]needs[/b][/u] hearthfire to work.\r<br />\r<br />This mod is not compatible with any mod that edits breezehome, this can be tricky because many mods take things from breezehome without reverting the changes. \r<br />\r<br />Realistic lighting overhaul, changes the lighting in breezehome, making it overexposed and nasty looking, to fix this im afraid the only way is to edit it in tesvedit. Which you should not do if you do not know how to do it.\r<br />[line]\r<br />[color=#953734][font=Arial Black][size=5]Permission&#39;s[/size][/font][/color]\r<br />Please do not edit or redistribute this mod, i am unsure if it is compatible with other languages, however the quest to get breezehome is the same so it would stand to reason that no translations would be needed. if a translation is needed contact me before you upload a translation.",
  "categoryId": "67",
  "version": "1",
  "author": "Nord Kitten",
  "createdUnix": "1397560655",
  "updatedUnix": "1397559059",
  "containsAdultContent": false,
  "uploadedBy": "NordKitten",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105054",
      "name": "Breezehome Hearthfire Redux",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4229",
      "fileName": "Breezehome Hearthfire Redux-53016-1.zip",
      "uploadedUnix": "1397559059",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6e4288626972240a9d6fa4a001a9d900acacf72f85376cf137b13719db8b2e3e/analysis/1408021751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome%20Hearthfire%20Redux-53016-1.zip?fid=1000105054&ttl=1535836333&ri=8192&rs=8192&setec=353cbc575606c765621fc3622de39856"
    }
  ]
}