{
  "modId": 53022.0,
  "modName": "Jokerine&#39;s Misc Resources",
  "summary": "A bunch of meshes I have assembled during my modding adventures, free to use.",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />Hello, and welcome&#33; During my modding times I&#39;ve made heavy use of modder&#39;s resources from many different places, and I&#39;ve always felt like I would like to give back to the community somehow. So here we are&#33; Some mesh mashups for you&#33;\r<br />\r<br />\r<br />[center][b][u]Remember[/u]: These are [i]only meshes and textures[/i], [u]not a playable mod.[/u] If you want to use them, you need to add them to your mods manually with the CK.  All of my resources (otherwise noted) are meant as statics or fixed containers - If you enable havok with these meshes selected in the Creation Kit the program will most likely crash, so please don&#39;t~[/b][/center]\r<br />\r<br />[i][center]I prefer that you do not use my directories to avoid mod installation/uninstallation conflicts, and instead place them in a directory specifically named for your project.[/center][/i]\r<br />\r<br />\r<br />[size=5][center]Be sure to check out my resources for [color=#DB7900]Fallout: New Vegas [url=http://www.nexusmods.com/newvegas/mods/56009/?](FNV)\r<br />[/url][/color]and [color=#A0C544]Fallout 3 [url=http://www.nexusmods.com/fallout3/mods/21613/?](FO3)[/url][/color], too&#33;[/center][/size]\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 1, RELEASED ON APRIL 16[/size][/color]\r<br />I am not very talented so there isn&#39;t much I can offer, but if there&#39;s something that has always bothered me, it is how difficult it is to decorate houses in Skyrim. Good luck trying to make food stay on top of dishes, even if you set them to not havok settle&#33; So I&#39;ve used the food plates from Oaristys and Tony67&#39;s [url=http://www.nexusmods.com/skyrim/mods/16525/?]Modders Resource Pack[/url] in almost all of my houses. But I always wanted to have a little more variety, so after I asked Oaristys for permission, I got started on 3 food variants of all available pottery styles in vanilla Skyrim except for Dwemer and Basic, which are already included in Oaristys and Tony67&#39;s resource pack. Be sure to take a look&#33;\r<br />\r<br />The additional silver sets are part of the vanilla game, but slightly modified so they&#39;d be statics and wouldn&#39;t roll around. All meshes (except for the inn sign, obviously) use vanilla textures, so if you have retextures or high-resolution packs they will look a bit different from the screenshots.\r<br />\r<br />I haven&#39;t checked if there is new pottery in the DLCs as I haven&#39;t started playing them yet, but if there is, or if I missed something else, please let me know and I&#39;ll add some right away. I may expand this little pack in the future if I come across any good ideas or find myself in need of something for a house or whatnot. If you&#39;d like to see something, tell me and I&#39;ll see what I can do.\r<br />\r<br />I&#39;m also including a generic inn sign for people who want to make their own tavern, and a blank one in case you may feel like making some custom artwork. I know the textures I included aren&#39;t that great, but what can I say, I did say I am not that talented, haha&#33; And, last but not least, there is a simple medal display, as this was something I wanted for a house I was making but could not find one anywhere. Special thanks go to BrettM, of [url=http://www.nexusmods.com/skyrim/mods/43143/?]FPI Experiment Pack 1[/url] fame, for inspiration and permission to base my display case on one of the shelves included in the FPI Experiment Pack 1.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 2, RELEASED ON MAY 02[/size][/color]\r<br />Added a couple of new things - desk clutter and some smithing thingamabobs. Check the pictures&#33;\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 3, RELEASED ON MAY 25[/size][/color]\r<br />Added offering plates. Working with gems is such a hassle... \r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 4, RELEASED ON MAY 26[/size][/color]\r<br />Added some new stuff&#33; Eye jars (I used the Argonian eyes one [url=http://www.nexusmods.com/skyrim/mods/54098/?]here[/url] and made some human-looking eye textures to match - I know the textures are kind of bad, but I did say I&#39;m not good at texturing...), a static closed basket that I&#39;ve used as a container in several of my mods, a cleaning set with a broom, bucket and such, and an embalming basket for a dungeon or necromancer&#39;s home.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 5, RELEASED ON MAY 29[/size][/color]\r<br />Added a hanged skeleton for spooky scary mods.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 6, RELEASED ON JUNE 08[/size][/color]\r<br />Added bottled ships, a wooden toy ship, and a narrow noble divider. All of the bottled ships (except for [i]BottledShipModelWooden[/i]) are MASSIVE when placed in the Creation Kit for the first time - they&#39;re the size of regular ships&#33; Simply downscale them to the minimum the CK and they will look perfect. Also, two meshes in particular ([i]BottledShipLarge01[/i] and [i]BottledShipLargeKatariah02[/i]) are really heavy, about 4 MB each in size. To cut on mod size, you can use the empty bottles I included in the download, and place the static ships directly inside in the CK. Keep in mind, however, that people using mods such as [url=http://www.nexusmods.com/skyrim/mods/48287/?]Animated Clutter[/url] will have these ships bob inside the bottles, so if you&#39;d rather play it safe, use the pre-bottled versions.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 7, RELEASED ON SEPT 04[/size][/color]\r<br />Added some loose glass panes (no collision so you can access what&#39;s behind them) for custom display shelves, windows and such, as this was something I needed and decided to leave here. There are versions with and without a decorative edge. \r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 8, RELEASED ON SEPT 06[/size][/color]\r<br />Added small tabletop pictures. These obviously require custom textures for the canvas. I included several in the download with screenshots I took (Icicle is my Skyrim character, by the way), but they&#39;re not very good in my opinion so feel free to make your own&#33; They are about the size of a bottle of mead, for reference.\r<br />\r<br />Tamira has a much better-looking tabletop picture available [url=http://www.nexusmods.com/skyrim/mods/62787/?]here[/url], in case you&#39;d prefer something that looks the way it&#39;s meant to&#33; :)\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; EXTRA UPDATE, RELEASED ON OCT 07[/size][/color]\r<br />A tiny update - uploaded single-sided and double-sided inn sign meshes and my old generic and blank inn textures as a separate file, for people who may want only those. Also added a Solitude-style sign.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 9, RELEASED ON OCT 30[/size][/color]\r<br />Added an updated wooden chair model with all sitting furniture markers (front, left and right). The wooden chair is one of my favorite pieces of furniture but it annoyed me immensely that the model itself only had a front chair marker, so here you go. I also included some low-poly bottled ships after I found a mesh in the game files of a suitable model ship. Not as detailed as my other bottled ships, but way lighter in filesize&#33;\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 10, RELEASED ON FEB 16[/size][/color]\r<br />Hello everybody&#33; I haven&#39;t modded Skyrim in a long time (focused on New Vegas...) but today I put together a couple of things I needed, and thought I&#39;d share. There are small flower arrangements (all in cups, goblets and tankards) for a bit of colorful decor, a tray with tasty treats, a basket of drinks and a barstool with the regular chair markers (front, left and right) so it displays the regular animation instead of the default barstool animation.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 11, RELEASED ON FEB 16[/size][/color]\r<br />I bring a little trifle today - clay lanterns. Originally traps, which I took apart and turned into tabletop lamps. Fidgety collision as usual, so put a collision box around them and you&#39;ll be golden. They have animated fire and candlewick effects for your enjoyment. The vanilla texture for the lamps is, truth be told, hideous, so I&#39;d recommend installing a mod such as [url=http://www.nexusmods.com/skyrim/mods/14227/]Ruins Clutter Improved[/url] by raiserfx.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 12, RELEASED ON APRIL 24[/size][/color]\r<br />Today I&#39;m uploading a bunch of stuff I had been hoarding so I could make a proper good update instead of just one or two meshes. First we have a group of colorful basket textures that I recommend you apply to your new baskets through a [url=http://wiki.tesnexus.com/index.php/Using_Texture_sets_for_Skyrim]Texture Set[/url]. I also am including a bunch of square planters with different designs at the behest of the almighty [url=http://www.nexusmods.com/skyrim/users/3231858/?]Elianora[/url]. The upload includes a basket filled with books, a basket filled with fish, and a series of wooden boxes (existing but unused vanilla asset) with different stuff inside, all meant to be used as containers. And, last but not least, some misc stuff. A cute little note in a bottle that can be used as a harvestable to collect the note inside (the scroll will actually disappear, thanks to [url=http://www.nexusmods.com/skyrim/users/776954/?]Tamira&#33;[/url]), an open display case without collision (a request, so you will need to put collision markers around it), a dwemer urn with a lid that can be hidden through a Null Texture Set to use as a planter or decoration, and a havoked rolled bedroll - basically the horse hide mesh with an edited UV map so it would use the bedroll texture. Just a clutter item, not usable for sleep&#33;\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 13, RELEASED ON AUG 04[/size][/color]\r<br />I&#39;ve just uploaded some assorted stuff that I made while I worked on [url=http://www.nexusmods.com/skyrim/mods/68447/?]Proudspire Marketplace[/url]. Among the misc stuff you can find a basket with mountain flowers, a half-opened book to put on a lectern, a loose book page, a lidded Dwemer cup and chopped firewood (all with collision except the firewood). The frisbees and colored chalk sticks are clutter and have custom textures (included in the download, but you&#39;ll need to set the texture paths in Nifskope). There is also a fun collection of skulls (without collision) wearing different vanilla headgear - all circlets, almost all helmets, and some hats. All of these except for the one with Tamira&#39;s pearls use vanilla textures - if you want the pearls, you&#39;ll need to download the textures from Tam&#39;s [url=http://www.nexusmods.com/skyrim/mods/57394/?]assorted resources[/url] (thank you&#33;). And last but not least, a bunch of Dwemer-style lamps because I always find myself needing these for Dwemer dwellings.They are all fully animated - the wicks will flicker and the dynamo will spin - and have static collision. The empty gyro is available in case you want to put in a custom light, such as the magelight orb.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 14, RELEASED ON AUG 30[/size][/color]\r<br />Today I bring you some low-poly framed paintings (about 8 KB each) with two sample canvas textures and a blank one for you to make your own. The frames use vanilla textures, but you can definitively apply your own if you want to. Each frame has a slightly edited UV map to fit the vanilla texture I chose. Enjoy&#33;\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 15, RELEASED ON JAN 15[/size][/color]\r<br />A really belated upload. Just a handful of static things today for the mage or necromancer on a budget: sacks with soul gems and scrolls (sack originally from [url=http://www.nexusmods.com/skyrim/mods/62787/?]Stroti&#39;s Treehouse Resource[/url] by Stroti and Tamira -- you&#39;ll need to grab the textures for the sack and rope from there), a small barrel of scrolls, a bucket of soul gems, and some ruins-styled cooking basins with functional furniture markers. Perfect for a cave or an ancient Nordic dwelling&#33;\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 16, RELEASED ON JAN 16[/size][/color]\r<br />Something quick I made for a personal house - shrines on the cheap&#33; Basically just a wooden spike with a nail and an amulet hanging from it. The download includes the empty spike and a selection of static amulets: Akatosh, Arkay, Dibella, Julianos, Kynareth, Mara, Stendarr, Talos, and Zenithar, as well as the [url=http://www.uesp.net/wiki/Skyrim:Jeweled_Amulet#Jeweled_Amulet]Elder Council[/url], [url=http://www.uesp.net/wiki/Dragonborn:Skaal_Amulet#Skaal_Amulet]Skaal[/url] (DG), [url=http://www.uesp.net/wiki/Skyrim:Bone_Hawk_Amulet#Bone_Hawk_Amulet]Bone Hawk[/url] (DG) and [url=http://www.uesp.net/wiki/Skyrim:Strange_Amulet#Strange_Amulet]Necromancer[/url] amulets. The idea of these is to add the spike as a regular static, and the amulet as a copy of your intended shrine. Please note that I haven&#39;t tested to see how these would work with mods that add animations to shrines, such as [url=http://www.nexusmods.com/skyrim/mods/61223/]Pray at Shrines[/url] -- I&#39;m using [url=http://www.nexusmods.com/skyrim/mods/34881/?]AE Animations[/url] in the picture.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED IN PT 17, RELEASED ON FEB 13[/size][/color]\r<br />A few things I put together while working on [url=http://www.nexusmods.com/skyrim/mods/73431?]Frostfield[/url]. Some more generic, text-free signs (inn, scrolls and sweets), a bowl of rings (I never know where to store them...), static coin purse, closed cooking pot, linen wrap crate and iron arrow quiver (to use as containers), a hanging shelf made out of ropes and planks, a loose static iron arrow, a loom with the default tanning rack animations, a ladder without collision, a simple stone bench with furniture marker, a tall standing planter (cooking stand and pot with dirt in it), and an upper thin table.\r<br />\r<br />\r<br />[color=#1E90FF][size=4]&gt; ADDED ALL-IN-ONE DOWNLOAD FILE, OCT 09[/size][/color]\r<br />Since I&#39;m not planning on uploading anything else at the moment, I threw together an all-in-one download of all the files so far, for folks who can&#39;t be bothered to download stuff separately. I added in a couple of extra meshes I had on my Dropbox as well.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />As this is a modder&#39;s resource, you can use the meshes and textures in your own mods as long as credit is given and you do not make profit from them. Maybe shoot me a PM so I can check out your mod&#33;\r<br />\r<br />There are only meshes and textures in the download, no .esp file. If you don&#39;t know what to do with these, take a look at [url=http://tesalliance.org/forums/index.php?/tutorials/article/99-using-modders-resources/]this[/url] tutorial to get started. I&#39;ve included a link to the tutorial in the download as well. Oaristys also has written a great tutorial in the description page of the great [url=http://www.nexusmods.com/skyrim/mods/16525/?]Modders Resource Pack[/url]. The collision on these is a bit wonky, unfortunately, and their flags are static, so make sure to use these as containers or statics to decorate your mods in order to avoid issues. \r<br />\r<br />I have also released some similar resources for [url=http://www.nexusmods.com/newvegas/mods/56009/?]New Vegas[/url] and [url=http://www.nexusmods.com/fallout3/mods/21613/?]Fallout 3[/url], in case you may be interested&#33;\r<br />\r<br />Thanks go to the Niftools team for giving us Nifskope, Bethesda for the vanilla meshes, and both [url=http://www.nexusmods.com/skyrim/users/2235573/?]Oaristys [/url] and [url=http://www.nexusmods.com/skyrim/users/3989420/?]BrettM[/url] for help and permission to base my work on theirs. You guys rock&#33;\r<br />\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "82",
  "version": "1.0",
  "author": "Jokerine",
  "createdUnix": "1397575367",
  "updatedUnix": "1475990305",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105067",
      "name": "Jokerine&#39;s Misc Resources Pt 1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2619",
      "fileName": "Jokerines Resources v1-53022-1-0.rar",
      "uploadedUnix": "1397574284",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8c13baada20481cb4ea233b852f74d3486aa14317856d221f1574c26758f8b61/analysis/1408022112/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Resources%20v1-53022-1-0.rar?fid=1000105067&ttl=1535836342&ri=8192&rs=8192&setec=7f099d46b38885693978ee5ff1ea0ce3"
    },
    {
      "fileId": "1000107611",
      "name": "Jokerine&#39;s Misc Resources Pt 2",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "674",
      "fileName": "Jokerines Misc Resources Pt 2-53022-.rar",
      "uploadedUnix": "1399111224",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f7ecbb93faa941a65ca4778d294f1dc6c3f2fa27e2a26aa32cb019de21269d79/analysis/1408052771/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%202-53022-.rar?fid=1000107611&ttl=1535836342&ri=8192&rs=8192&setec=dcfbaf9930294d1e0f9899152ada22f4"
    },
    {
      "fileId": "1000110336",
      "name": "Jokerine&#39;s Misc Resources Pt 3",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "626",
      "fileName": "Jokerines Misc Resources Pt 3-53022-.rar",
      "uploadedUnix": "1400969766",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/37126ed9b84412589cf03c2686e0598527662584d47591900e66689e374254d7/analysis/1408095483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%203-53022-.rar?fid=1000110336&ttl=1535836343&ri=8192&rs=8192&setec=1c6e4b1a4e9f339d1d9b6bd4b31ac8ee"
    },
    {
      "fileId": "1000110562",
      "name": "Jokerine&#39;s Misc Resources Pt 4",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "684",
      "fileName": "Jokerines Misc Resources Pt 4-53022-.rar",
      "uploadedUnix": "1401096357",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/abb15c72d8e629e186dd176c9679ef82be4202312c7108d2e1297e6e46df0ac3/analysis/1408097473/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%204-53022-.rar?fid=1000110562&ttl=1535836344&ri=8192&rs=8192&setec=64bb0cd9e701c6ade8ef01457cdfecb7"
    },
    {
      "fileId": "1000110853",
      "name": "Jokerine&#39;s Misc Resources Pt 5",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "566",
      "fileName": "Jokerines Misc Resources Pt 5-53022-.rar",
      "uploadedUnix": "1401300378",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/cbdd72f2debedbbba232d8356eff34b95e56febc60db4ecdb35d2ac7f3c42976/analysis/1408100417/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%205-53022-.rar?fid=1000110853&ttl=1535836345&ri=8192&rs=8192&setec=545b1384096b60f0af0d09252ae58e7e"
    },
    {
      "fileId": "1000112115",
      "name": "Jokerine&#39;s Misc Resources Pt 6",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3845",
      "fileName": "Jokerines Misc Resources v6-53022-.rar",
      "uploadedUnix": "1402140350",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/69df6fc098949b529363f4f5f88ac6661705e0a1c1aedce4aa6ec3b73df78b3c/analysis/1408116097/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20v6-53022-.rar?fid=1000112115&ttl=1535836346&ri=8192&rs=8192&setec=96df7ada42be11cc0519128589ad4e9e"
    },
    {
      "fileId": "1000125231",
      "name": "Jokerine&#39;s Misc Resources Pt 7",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Jokerines Misc Resources Pt 7-53022-.rar",
      "uploadedUnix": "1409814378",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5414571b8f02cb43e62f316336763976dbd036569615b360b81c8f4f43c8c067/analysis/1409814481/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%207-53022-.rar?fid=1000125231&ttl=1535836346&ri=8192&rs=8192&setec=38b2aa36a3be3c736c875559e8140f39"
    },
    {
      "fileId": "1000125426",
      "name": "Jokerine&#39;s Misc Resources Pt 8",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2974",
      "fileName": "Jokerines Misc Resources Pt 8-53022-.rar",
      "uploadedUnix": "1409927932",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7f68340eb8b934ebd87abb7be2aa3e371e545e797c2618163389e55759ae58e1/analysis/1409928007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%208-53022-.rar?fid=1000125426&ttl=1535836347&ri=8192&rs=8192&setec=f90ad2481c783fa05500fae50c54a923"
    },
    {
      "fileId": "1000129944",
      "name": "Jokerines Misc Resources - Only Signs v2",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "928",
      "fileName": "Jokerines Misc Resources - Only Signs v2-53022-.rar",
      "uploadedUnix": "1412660873",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c9494da30cb0e262ae447607ff42458b7e8778b7f7fd003103ee5f905eb267fa/analysis/1412660942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20-%20Only%20Signs%20v2-53022-.rar?fid=1000129944&ttl=1535836348&ri=8192&rs=8192&setec=eeaee5361de5870dc23edb4e2f89fbbf"
    },
    {
      "fileId": "1000133176",
      "name": "Jokerine&#39;s Misc Resources Pt 9",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "128",
      "fileName": "Jokerines Misc Resources Pt 9-53022-.rar",
      "uploadedUnix": "1414658632",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e6d6fa41895930c97cfce2069233944fa46edbe4685c03c671161f8c1c6948fe/analysis/1414658522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%209-53022-.rar?fid=1000133176&ttl=1535836348&ri=8192&rs=8192&setec=65fd66b9c726867d61d87dc06452911c"
    },
    {
      "fileId": "1000147696",
      "name": "Jokerine&#39;s Misc Resources Pt 11",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "387",
      "fileName": "Jokerines Misc Resources Pt 11-53022-.rar",
      "uploadedUnix": "1424085600",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/aea2d209ea25aabb711c1425cd5eec39fdcf6da79926fed1219cb9d621f6b4e5/analysis/1424085603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%2011-53022-.rar?fid=1000147696&ttl=1535836349&ri=8192&rs=8192&setec=03992fca043c9506ea87f72ead9dddef"
    },
    {
      "fileId": "1000156800",
      "name": "Jokerine&#39;s Misc Resources Pt 12",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2298",
      "fileName": "Jokerines Misc Resources Pt 12-53022-.rar",
      "uploadedUnix": "1429817778",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c57b4aaf07daf3c40d63eda5cc14ca627996f91dd1480832a32a0d2ecea02fbc/analysis/1429817825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%2012-53022-.rar?fid=1000156800&ttl=1535836350&ri=8192&rs=8192&setec=903803a81f80932e7c609088ca4fcccd"
    },
    {
      "fileId": "1000170426",
      "name": "Jokerine&#39;s Misc Resources Pt 13",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4019",
      "fileName": "Jokerines Misc Resources Pt 13-53022-.rar",
      "uploadedUnix": "1438638220",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ec07b20e500195a12cec1e7101dedd3511ebf7a37af2c6f769a45462a1f49661/analysis/1438638247/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%2013-53022-.rar?fid=1000170426&ttl=1535836350&ri=8192&rs=8192&setec=ee9c816f281132ae366fd7cb3df5c059"
    },
    {
      "fileId": "1000173921",
      "name": "Jokerine&#39;s Misc Resources Pt 14",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "287",
      "fileName": "Jokerines Misc Resources Pt 14-53022-.rar",
      "uploadedUnix": "1440926970",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/42a62d5db646a0345d5b28d0aa8266a874ff1b3d8d652b63b72493b08811c5b7/analysis/1440927004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerines%20Misc%20Resources%20Pt%2014-53022-.rar?fid=1000173921&ttl=1535836350&ri=8192&rs=8192&setec=0c8db30e8bcbcc0cfaefd2b112e67d95"
    },
    {
      "fileId": "1000191594",
      "name": "Jokerine&#39;s Misc Resources Pt 16",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "287",
      "fileName": "Jokerine's Misc Resources Pt 16-53022-.rar",
      "uploadedUnix": "1452933673",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/04b1936b051bdd1f52e92537fd69035be4671138464a93c5cca5bc6a4ecf3091/analysis/1452941106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerine%27s%20Misc%20Resources%20Pt%2016-53022-.rar?fid=1000191594&ttl=1535836351&ri=8192&rs=8192&setec=3182f74e446b8e48800b0c49a3e663de"
    },
    {
      "fileId": "1000194471",
      "name": "Jokerine&#39;s Misc Resources Pt 15 - Reupload",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "405",
      "fileName": "Jokerine's Misc Resources Pt 15 - Reupload-53022-.rar",
      "uploadedUnix": "1454784942",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c99c4d0b09024fa8c92388be547c35ab80b20930e8c86814fef1fb092d060781/analysis/1454785025/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerine%27s%20Misc%20Resources%20Pt%2015%20-%20Reupload-53022-.rar?fid=1000194471&ttl=1535836351&ri=8192&rs=8192&setec=93e0a43fc5747189899e5b626c7f36a2"
    },
    {
      "fileId": "1000194475",
      "name": "Jokerine&#39;s Misc Resources Pt 10 - Reupload",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1465",
      "fileName": "Jokerine's Misc Resources Pt 10 - Reupload-53022-.rar",
      "uploadedUnix": "1454785206",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fcb712c8242481b4aa68ce894cc9444f7797a3785c07ded18b190fc49f544080/analysis/1454785267/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerine%27s%20Misc%20Resources%20Pt%2010%20-%20Reupload-53022-.rar?fid=1000194475&ttl=1535836352&ri=8192&rs=8192&setec=b61eb8ac98fb2a832172dafbf714b110"
    },
    {
      "fileId": "1000195309",
      "name": "Jokerine&#39;s Misc Resources Pt 17",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1541",
      "fileName": "Jokerine's Misc Resources Pt 17-53022-.rar",
      "uploadedUnix": "1455315355",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/afd4049429951a2387ee5d59acf47978cc07480012008a41e59a640da72c113e/analysis/1455315375/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerine%27s%20Misc%20Resources%20Pt%2017-53022-.rar?fid=1000195309&ttl=1535836352&ri=8192&rs=8192&setec=1ac9415f0f1575b764de8364f3b03e06"
    },
    {
      "fileId": "1000223525",
      "name": "Jokerine&#39;s Misc Resources - All-In-One Super Bundle",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23814",
      "fileName": "Jokerine's Misc Resources - All-In-One Super Bundle-53022-.rar",
      "uploadedUnix": "1475990305",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/32be27e5ca48d524100950dc783d5b10ccf7b64e77a83d7d579c75a802949c35/analysis/1475990361/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jokerine%27s%20Misc%20Resources%20-%20All-In-One%20Super%20Bundle-53022-.rar?fid=1000223525&ttl=1535836352&ri=8192&rs=8192&setec=8c65cd932b6108d1356077cfa0f5f2c7"
    }
  ]
}