{
  "modId": 53091.0,
  "modName": "Slayers Unite",
  "summary": "The Vigilants of Stendarr have sought refuge with the Dawnguard as they begin to rebuild.\r<br />",
  "descriptionHtml": "Slayers Unite&#33; is a lore friendly mod that expands on the similarities between the Dawnguard and the Vigilants of Stendarr.\r<br />\r<br />Dawnguard required.\r<br />\r<br />This mod is a work in progress. Despite this, it&#39;s still perfectly usable in its current state, in the sense that it doesn&#39;t break anything and it accomplishes what it&#39;s supposed to. I&#39;ll be updating it as often as I can to include new features. Any assistance is appeciated, and any modders that help will be credited.\r<br />\r<br />If you have previously uninstalled this mod, do not reinstall if you are inside of any of the altered cells. You will CTD.\r<br />----------------\r<br />So far it adds five Vigilants of Stendarr to Dayspring Canyon and the battlements, none inside of Fort Dawnguard yet. Whether or not you have Holmwood, one is standing in the road nearby.\r<br />Adds a Dawnguard Sentinel to Stendarr&#39;s Beacon.\r<br />They are perfectly hostile to any vampires, werewolves, witches, and daedra that might pop up for whatever reason. They&#39;ll also attack anything that attacks a Dawnguard member.\r<br />The only way it changes the Vigilants of Stendarr outside of Dayspring is by setting the Dawnguard as an ally.\r<br />They&#39;ve been buffed to be a bit more useful in case of vampire attacks.\r<br />They level with the player from 15-60.\r<br />\r<br />They have new perks: \r<br />Ward Absorb\r<br />Adept Restoration\r<br />Atronach\r<br />Respite\r<br />\r<br />They have new spells: \r<br />Vampire&#39;s Bane (working on making this one work)\r<br />Stendarr&#39;s Aura (the one handed Vigilants will cast it after their flesh spell)\r<br />Stoneflesh (replaces Oakflesh)\r<br />\r<br />They are also equipped with Dawnguard war axes/warhammers, silver swords, and crossbows.\r<br />----------------\r<br />Known Bugs/Problems:\r<br />Evidently Vigilants are scared of dragons... While combat testing them they simply ran away screaming instead of trying to help.\r<br />----------------\r<br />Future Plans:\r<br />Changing combat types to allow for the use of other spells. Adding a Vigilant or two inside of the fort. Rebuilding the Hall of the Vigilants inside of Dayspring Canyon (or possibly outside of it somewhere.) I&#39;m open to ideas, just keep my limited knowledge of the CK in mind please&#33; For now I&#39;m also fairly busy training for a dogfighting tournament in Battlefield 3. Some power outages lately have also hindered my ability to update the mod.\r<br />\r<br />Link to Steam Workshop Version:\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=248241529",
  "categoryId": "25",
  "version": "1.0",
  "author": "RFxSukhoi",
  "createdUnix": "1397762901",
  "updatedUnix": "1397762901",
  "containsAdultContent": false,
  "uploadedBy": "RFxSukhoi",
  "primaryFile": null,
  "files": []
}