{
  "modId": 53092.0,
  "modName": "No pretty snowflakes in dust",
  "summary": "Just for crazy perfectionist users of any of the pretty snowflake mods like Quality Snowflakes to prevent random snow from floating around in inappropriate places like dungeons",
  "descriptionHtml": "FYI this mod does NOTHING unless you have a pretty snowflake mod (in my case Quality Snowflakes) installed.\r<br />\r<br />Now I love me some pretty snowflakes, but for a long time I&#39;ve put off using any snowflake mods because I noticed early on (in the torturer&#39;s room in Helgen Keep specifically... yeah that early) that random flakes of snow seemed to be mixed in with what should clearly have only been dust particles.  I can&#39;t POSSIBLY be the only one who&#39;s ever noticed this can I??\r<br />\r<br />Okay fine, I know it&#39;s very minor and maybe I am the only OCD modder crazy enough to give a rat&#39;s ass, and if this was the only immersion breaking moment one might usually experience while playing Skyrim I might let it slide.  But even with tons of more major fixes installed, little annoyances like this tend to pile up quickly in this game, incessantly gnawing away at your immersion instead of totally breaking it (kinda like Chinese water torture) until you find you have to start drinking or smoking dope every time you play just so can have one goddamn nice enjoyable f&#39;ing immersion experience without noticing all the CRAP&#33;&#33;&#33;\r<br />\r<br />...Or perhaps i&#39;m the only one that does that.  Felt good to let that out though :)\r<br />\r<br />Anyhooo, so finally the other day when I wasn&#39;t overly intoxicated I figured out how the prevent it by redirecting fxcameraattachdust.nif to use a copy of the original unmodded fxsnowsub.dds texture cleverly renamed fxdustsub.dds.  That&#39;s pretty much it, should be compatible with any snowflake mods out there, so enjoy your slightly less f&#39;ed up game&#33;\r<br />\r<br />You didn&#39;t really read all of this did you?  Awww that&#39;s sweet of you, a little Skyrim rant does the bugweary soul good.\r<br />\r<br />Edit: Also despite the above rant I also have to say, to be fair, that this &#34;bug&#34; doesn&#39;t actually occur in the original game, but if you&#39;re playing vanilla what the hell are you doing here?\r<br />\r<br />**pretty snowflakes in pretty pictures courtesy of Quality Snowflakes by Yuril http://www.nexusmods.com/skyrim/mods/7405/?",
  "categoryId": "29",
  "version": "1",
  "author": "newwavedave30a",
  "createdUnix": "1397860286",
  "updatedUnix": "1397858885",
  "containsAdultContent": false,
  "uploadedBy": "newwavedave30a",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105476",
      "name": "No Pretty Snowflakes in Dust",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "No Pretty Snowflakes in Dust-53092-1.zip",
      "uploadedUnix": "1397858885",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0abeb6e8f8c9bf5fff13c9510ba9731a23163993d037f1b2d2d8a62589dfd4f8/analysis/1408028438/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Pretty%20Snowflakes%20in%20Dust-53092-1.zip?fid=1000105476&ttl=1535836473&ri=8192&rs=8192&setec=23f73146c841b8005fe7b4d676ca2d51"
    }
  ]
}