{
  "modId": 53129.0,
  "modName": "The B-Team",
  "summary": "Everyone knows about the followers in Skyrim - your Lydias and Mjolls and Onmunds, all bright, competent followers. This mod is not about them. This is about the kind of followers you would expect to see on Skyrims A-Team or B list - the misfits and weirdos who try so hard but never make the cut - until now.",
  "descriptionHtml": "[size=3][b]Attention: Valdr is broken and I do not know why. I threw everything I had at him in an attempt to get him to work but everything failed. Anyone with an insight is welcome to post it.[/b][/size]\r<br />\r<br />[i]In 4E 201, a crack Stormcloak unit and a couple passerby were sentenced to be executed by a military court for a crime they didn&#39;t commit. These men and women promptly escaped from a maximum security stockade to the Skyrim underground. Today, still wanted by the government, they survive as soldiers of fortune. If you have a problem, if no one else can help, and if you can find them, maybe you can hire the B-Team - but why would you?[/i]\r<br />\r<br />Everyone knows about the followers in Skyrim - your Lydias and Mjolls and Onmunds and Seranas, all bright, competent followers chosen by destiny to fight with the Dragonborn. This mod is not about them. This is about the kind of followers you&#39;d expect to see on Skyrim&#39;s A-Team or B list - the misfits and weirdos who try so hard but never make the cut - until now.\r<br />\r<br />The B-Team is one part overhaul and one part compilation - it changes up a wide range of Skyrim&#39;s existing characters to give them the potential to become a unique follower in their own right. Some are included from existing mods - such as my own Anska, Heimskr, and Nazeem, and rcarass1&#39;s Kaie mod. Some are newly added from requests which I&#39;ve received over the course of making and publishing my mods from the community. Finally, at least two are stand-alones which I made specifically for this mod, mainly to help round out voicetypes that were poorly represented in-game.\r<br />\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/requirements.png[/img]\r<br />\r<br />Technically, the B-team is not an overly complex mod, but it does come with a set of requirements.\r<br />\r<br />First, [url=http://store.steampowered.com/app/211720/]Dawnguard[/url] is a [color=#ff0000][b]hard requirement[/b][/color] for the mod - i.e., the mod will crash to desktop if Dawnguard is not active. Some of the abilities and one of the quests added require Dawnguard in order to work.\r<br />\r<br />Second, are the [b][color=#ffff00]soft requirements[/color][/b]: [url=http://www.nexusmods.com/skyrim/mods/52553/]Follower Voicetypes Expanded[/url], and [url=http://www.nexusmods.com/skyrim/mods/23971/?]Research Thief[/url]. These soft requirements, if not present, won&#39;t [i]crash[/i] the mod, but without them it will be impossible to hire on every NPC that the B-team adds. FVE is the most critical, as it adds the 34 additional voicetypes used by B-team followers; its Convincing Coinage plugin and TES5Edit script are not required, but will allow you to hire even more NPCs than B-team adds. Research Thief restores a cut vanilla quest at the College of Winterhold which will determine whether or not you&#39;re able to get Nirya and Feralda as followers.\r<br />\r<br />Thirdly are [b][color=#00ff00]recommended mods[/color][/b]: these mods are not integral to B-teams functionality at all but their presence will mesh well with it. My own [url=http://www.nexusmods.com/skyrim/mods/52019/]Follower Commentary Overhaul[/url] will bring some of the followers to life, giving them additional commentary about you, themselves, their surroundings and current events. [url=http://www.nexusmods.com/skyrim/mods/12933/?]Extensible Follower Framework[/url] will give you the ability to recruit and manage groups of followers with ease. [url=http://www.nexusmods.com/skyrim/mods/2637/?]Younger Bretons[/url] or like functionality in other mods is recommended so Breton followers don&#39;t look like they were born at the age of 30.\r<br />\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/faq.png[/img]\r<br />\r<br />[list]\r<br />[*]Q) Which NPCs does the B-team change?[/*]\r<br />[*]A) B-team currently changes around 50 vanilla NPCs, optimizing their AI and statistics to be more useful and unique followers. A full rundown of the NPCs, changes made to them, whether they use FVE, and their eligibility for marriage, is [url=https://docs.google.com/spreadsheets/d/1mCLSQ8gb0CIcYCr7TgaUHTF1BrR8kX3zlR6x8be0n24/edit?usp=sharing]located here.[/url][/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) What&#39;s the level cap for the followers?[/*]\r<br />[*]A) There is none.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) You said something about standalone followers?[/*]\r<br />[*]A) Yes&#33; B-team also adds two standalone followers as well, one of which comes with a short quest. Zalkanas, the sinister sorceress, can be found milling about the top of the center gate tower in the College of Winterhold, opposite the Hall of the Elements, and has an unusual request for you. Terzaerian, the cynical mercenary, can be found at the Moorside Inn in Morthal, and can be hired for a fair price; unlike other hirelings, however, he will not time out and demand further payments. One gets the sense that deep down, he&#39;s not in it for the money and just enjoys what he does, and having good company.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I&#39;ve installed the mod and recruited the NPC, but they seem to have vanilla stats&#33;[/*]\r<br />[*]A) This has been a tricky problem from the time I started making these kinds of mods to the present. Basically the hard truth is this: things are going to work most smoothly if you&#39;re starting a new game after installing B-team - nobody is spawned, dead, or otherwise disabled out of the world. Merely being spawned in the game world tends to lock in some characteristics by writing them to the player&#39;s save file, no matter what mods are installed - mainly their leveling (i.e. whether they level with the player, or have a set static level), their aggression and their confidence. Some fixes, such as chaining recycleactor, disable, and enable seem to fix some issues but only considerable tweaking either in the console or with a mod that can fix everything in an NPC that has already been spawned.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) What does it mean that FVE and Research Thief are soft requirements?[/*]\r<br />[*]A) In a nutshell, it means that if you choose to run B-team without these two mods, it will still *work* - the game will not suffer a crash-to-desktop like it would if a hard requirement (such as Dawnguard) were missing. However, at least half the mod is still not going to work properly - followers with voicetypes that aren&#39;t part of the standard eighteen (which is about half of the followers added by B-team) will get B-team&#39;s dialogs, but will lack the dialog necessary to receive  follower commands - most importantly, the join and dismiss dialogs. Granted, some mods will have workarounds - EFF in particular has a Mind Control spell which allows you to automatically jump-start an NPC into EFF&#39;s follower system, and then issue commands through its own menus. That said, if you want the full, immersive experience, you&#39;re going to want FVE and Research Thief running as well.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Does B-team include the mods mentioned in the credits?[/*]\r<br />[*]A) B-team does not include full versions of any mod in the credits save for the [url=http://www.nexusmods.com/skyrim/mods/38037/?]Kaie Redone[/url] mod, which was included in this compilation in agreement with her author, rcarass1. A single hairstyle from [url=http://www.nexusmods.com/skyrim/mods/31797/?]Ponytail Hairstyles[/url] and a single robe from [url=http://www.nexusmods.com/skyrim/mods/20077/?]Tribunal Robes[/url] are included as resources for B-team&#39;s stand-alone follower (featured in the Image section) with the express consent of their authors; [url=http://www.nexusmods.com/skyrim/mods/11933/?]Geralt Eyes[/url] is included under its permissions to be re-used as a modder&#39;s resource. B-team is fully compatible with all of these mods but does not require the three to run, though obviously I strongly encourage you to get and endorse these excellent mods. That said, B-team should not be redistributed outside of the Nexus, or on/as part of any other mod&#39;s page within the Nexus.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) I&#39;m using the [url=http://www.nexusmods.com/skyrim/mods/47327/]Cutting Room Floor[/url] mod to restore the Research Thief quest, will that work?[/*]\r<br />[*]A) Unfortunately, it will not, not by itself. The alternate resolution of bringing the notes to Faralda appears to not have been included in CRF; only the Nirya resolution is possible. However, if you install and load the dedicated Research Thief mod after Cutting Room Floor, its design and alternate resolution will override CRF&#39;s and you will be able to resolve it either in Faralda&#39;s or Nirya&#39;s favor.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) What makes this better than just using a mod like [url=http://www.nexusmods.com/skyrim/mods/41629/?]Everyone is an Adventurer[/url] or functionality in [url=http://www.nexusmods.com/skyrim/mods/15524/?]AFT[/url] or [url=http://www.nexusmods.com/skyrim/mods/12933/?]EFF[/url] to turn the vanilla NPC into a follower?[/*]\r<br />[*]A) They are all fine mods, to be sure. That said, there are limits to their functionality - EIAA and AFT might be able to boot someone into the right factions, and EFF might be able to change their class to general roles, but the focus on B-team, and all my follower mods, is to go a step further and detail the NPCs - to give them a set of perks, class, and combat AI that reflect their role and personality, and in some cases give them unique abilities. As well, B-team also adds stand-alone followers in poorly-populated follower voicetypes, to increase the potential diversity of your group.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Will this work with [any number of NPC appearance overhauls, including but not limited to [url=http://www.nexusmods.com/skyrim/mods/24273/?]Ethereal Elven Overhaul[/url] or [url=http://www.nexusmods.com/skyrim/mods/15411/?]ApachiiSkyHair NPC Overhaul[/url]?[/*]\r<br />[*]A) No and yes. The full version of the mod, which adds perks and tweaks the NPC&#39;s data to optimize it as a follower, will almost certainly conflict with global NPC overhauls. [url=http://www.nexusmods.com/skyrim/mods/25859/?]TES5Edit[/url] may be able to help some, but I&#39;m not sure how well it handles collisions between mods which alter facial appearance and hairstyles - it&#39;s possible the infamous Gray Face/Neck Seams bug will still occur. So I am also offering a version of the mod that contains no vanilla NPC records - your NPCs won&#39;t be optimized to be followers but they will still be recruitable per B-team&#39;s design.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Will this work with [url=http://www.nexusmods.com/skyrim/mods/52019]FCO[/url]?[/*]\r<br />[*]A) Mostly. In fact, from the beginning FCO was built with working alongside the B-team in mind, and vice-versa. Some NPCs were given unique idles in FCO that will only become evident after they have been recruited through B-team. That said, the range of voicetypes represented in B-team is currently larger than what FCO covers - FiftyTifty&#39;s [url=http://www.nexusmods.com/skyrim/mods/52553/?]FVE[/url] mod was developed and released after FCO&#39;s. I do plan on releasing an expansion to FCO so that [i]all[/i] the followers B-team adds will get commentary, but as of this initial publishing probably half will make idle commentary.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Will this work with your other follower mods (Nazeem, Heimskr, Anska)?[/*]\r<br />[*]A) B-team includes all three of those mods integrally; upgrading to B-team from them will effectively replace all three. Running them in parallel with B-team is not recommended - nothing should break but unusual behavior might result, especially with Heimskr and Nazeem. You should be fine upgrading these mods even if the NPC/s in question is/are in your group, however, I would make sure that the Nazeem brawl is not in progress or finished (or you have otherwise turned Nazeem into a follower because of a broke brawl), as brawls are [i]notoriously[/i] touchy when it comes to mods.[/*]\r<br />[/list]\r<br />[list]\r<br />[*]Q) Does this change any vanilla quests?[/*]\r<br />[*]A) Almost all B-team&#39;s follower use a unique &#34;drop/hook&#34; quest which adds new dialogue to the NPCs targeted by the mod, which will add a short dialog referencing past quests done on that NPC&#39;s behalf, whose entire function is to add them to the follower faction and up their relationship rank, if it is not already at 3. These hooks only reference, and do not alter, the vanilla quests. However, one quest is affected by B-team: the quest script for [url=http://www.uesp.net/wiki/Skyrim:Hitting_the_Books]&#34;Hitting the Books&#34;[/url] has been altered to not disable Orthorn at the conclusion of the quest. If you have already completed &#34;Hitting the Books&#34; prior to installing the B-team, Orthorn will still be disabled, but can be grabbed back from Oblivion through the console by enabling his RefID, which is 0002A389.[/*]\r<br />[/list]\r<br />\r<br />[line]\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/credits.png[/img]\r<br />\r<br />The first credit goes to [url=http://www.nexusmods.com/skyrim/users/4937832]FiftyTifty[/url] and [url=http://www.nexusmods.com/skyrim/mods/52553/?]Follower Voicetypes Expanded[/url] - without which this mod literally couldn&#39;t have gone forward.\r<br />\r<br />I&#39;d also like to offer my profuse thanks to:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/2102930]NatterForMe[/url] for allowing me to use  [url=http://www.nexusmods.com/skyrim/mods/20077/?]Tribunal Robes,\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/tribrobes.png[/img][/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/907295]AzarKiowa[/url] for allowing me to feature [url=http://www.nexusmods.com/skyrim/mods/31797/?]Ponytail Hairstyles,\r<br />[img]http://i1182.photobucket.com/albums/x445/terzaerian/ponytails.png[/img][/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/5038363]Rcarass1[/url] for allowing me to include his excellent [url=http://www.nexusmods.com/skyrim/mods/38037/?]Kaie Redone[/url] mod in this compilation.\r<br />[url=http://www.nexusmods.com/skyrim/mods/38037/?][img]http://i1182.photobucket.com/albums/x445/terzaerian/kaie.png[/img][/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/910853]Didjos[/url] for allowing use of [url=http://www.nexusmods.com/skyrim/mods/11933/?]Geralt Eyes[/url] as a modder&#39;s resource.\r<br />[url=http://www.nexusmods.com/skyrim/mods/11933/?][img]http://i1182.photobucket.com/albums/x445/terzaerian/geralt.png[/img][/url]\r<br />\r<br />The open-hearted generosity of these individuals and others like them is what makes the modding community great. As a user of these mods I am thrilled to be given the chance to feature them in my own.\r<br />\r<br />Last but not least, I&#39;d like to thank the Skyrim modding community as a whole: B-team is as much theirs as it is mine. While the core of the NPCs added are ones I&#39;ve turned into followers or repaired over the years, the bulk come from suggestions I&#39;ve gotten in threads from my first mod, HEIMSKR FOREVER, up through FCO. Each one that comes the community is, typically, an NPC I otherwise never really knew existed, some of which ended up becoming my favorites.\r<br />\r<br />[url=http://creativecommons.org/licenses/by-nc-nd/4.0/][img]https://i.creativecommons.org/l/by-nc-nd/4.0/88x31.png[/img][/url]\r<br />This work is licensed under a [url=http://creativecommons.org/licenses/by-nc-nd/4.0/]Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License[/url]. [b]Please do not destribute this mod elsewhere as per Nexus Network rules.[/b]",
  "categoryId": "96",
  "version": "0.6",
  "author": "terzaerian - FiftyTifty - rcarass1",
  "createdUnix": "1399666752",
  "updatedUnix": "1402701479",
  "containsAdultContent": false,
  "uploadedBy": "terzaerian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108304",
      "name": "The B-Team",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "37082",
      "fileName": "The B-Team-53129-0-5.7z",
      "uploadedUnix": "1399521131",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/fada4b08c3b38ce02842c539f7915fa8baa65cef8326f7e16582e3cdd227bbda/analysis/1408067830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20B-Team-53129-0-5.7z?fid=1000108304&ttl=1535836538&ri=8192&rs=8192&setec=1c2b43fbce59c7fb55641e6e74cb2f3f"
    },
    {
      "fileId": "1000112893",
      "name": "The B-Team",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37217",
      "fileName": "The B-Team-53129-0-6.7z",
      "uploadedUnix": "1402701479",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/990d3e292b6fb6f485fe39d441b0c2e16f0a134719d639880cf08410ef018201/analysis/1408125077/",
      "changelogHtml": " Nazeem&#39;s brawl tree was incorrectly appearing pre-Mirmulnir; this has been fixed <br/> \n Hadvar&#39;s dialogue conditions tweaked to properly look for an Imperial victory over Windhelm <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20B-Team-53129-0-6.7z?fid=1000112893&ttl=1535836539&ri=8192&rs=8192&setec=9a28ce4b9e5b07c3af09dcc1b4a40cad"
    }
  ]
}