{
  "modId": 53172.0,
  "modName": "Better Eagle Eye and Steady Hand Redux",
  "summary": "Better Eagle Eye and Steady Hand Redux is a Skyrim mod that allows user customization of two archery perks: Eagle Eye and Steady Hand.  With it, you have control over Eagle Eye&#39;s zoom magnitude and stamina drain, and Steady Hand&#39;s time manipulation scale.",
  "descriptionHtml": "[center][b][size=5]Better Eagle Eye and Steady Hand Redux[/size][/b][/center][center][b][size=3]by Trasd[/size][/b][/center]\r<br />\r<br />Better Eagle Eye and Steady Hand Redux (BEER) is my attempt to fix (or finish) mackam08&#39;s (aka IrksomeBadger) &#34;[url=http://www.nexusmods.com/skyrim/mods/33808]Better eagle eye and steady hand perks[/url]&#34; mod.  Please be aware, my goal was to fix the mod&#39;s reported problems, not extend its functionality.\r<br /> \r<br />Before we begin, I want to say that I take no credit for the mod and will accept no responsibility for problems.  All programming credit goes to mackam08 and all responsibility is your own.  Remember, Bethesda Softworks allows for modding, but does not officially support it.\r<br />\r<br />\r<br />[color=#FF4444][b]So, what is BEER and what does it do?[/b][/color]\r<br /> \r<br />BEER is a Skyrim mod that allows user customization of two archery perks: [url=http://www.uesp.net/wiki/Skyrim:Archery#Eagle_Eye_and_Steady_Hand]Eagle Eye and Steady Hand[/url].  With it, you have control over Eagle Eye&#39;s zoom magnitude and stamina drain, and Steady Hand&#39;s time manipulation scale.\r<br />\r<br /> \r<br />[color=#FF4444][b]What are BEER&#39;s prerequisites?[/b][/color]\r<br />\r<br />To use BEER, you need the following (up and running):\r<br />[list][*]Skyrim (DLC is not mandatory)\r<br />[*][url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/3863]SkyUI[/url]\r<br />[*]The Eagle Eye and Steady Hand (Rank 2) in-game perks.[/list]\r<br />\r<br />[color=#FF4444][b]What exactly are BEER&#39;s settings specifications?[/b][/color]\r<br />\r<br />Eagle Eye&#39;s zoom range is customizable between .05 and 1.00 in increments of .05.  The zoom slider numbers are basically arbitrary and do not correspond to any scale, but represent Skyrim&#39;s internal raw data.  The game uses .60 as the default and anything above 1.00 does not work.  Because of this, I cannot give you a true magnitude or zoom percentage.  Play with the setting and see which works best for you.\r<br />\r<br />Eagle Eye&#39;s stamina drain is customizable between 0 and 20 in increments of 1.  The same magnitude information from zoom applies here as well.  The default is 10, if that helps (this is the default mackam08 setup and I defer to his knowledge).\r<br />\r<br />Steady Hand&#39;s time scale is customizable between .05 and .40 in increments of .05.  The same magnitude information from zoom applies here as well.  The default is .25 ([b]this is not a percentage[/b]), if that helps (this is the default mackam08 setup and I defer to his knowledge).\r<br />\r<br /> \r<br />[color=#FF4444][b]How is BEER installed?[/b][/color]\r<br />\r<br />If you are running the original mod, please remove it before installing this Redux.  I also highly recommend installing into a clean save.\r<br />\r<br />I use [url=http://www.nexusmods.com/skyrim/mods/1334]Mod Organizer[/url] (I like the ability to setup different profiles) to manage my mods, but NMM or manually should work just as well.  For manual installation, just unzip the archive in your Skyrim data directory (folder, file cabinet, branch, whatever you want to call it).\r<br />\r<br /> \r<br />[color=#FF4444][b]How is BEER uninstalled?[/b][/color]\r<br />\r<br />I use [url=http://www.nexusmods.com/skyrim/mods/1334]Mod Organizer[/url], though NMM or manually should work just as well.  For manual removal, just delete the ESP and script (check under script&#39;s source directory as well).  You can look in the archive for the file names, if you&#39;re not sure.  If you want to be safe, uncheck the ESP and return the settings to default first.\r<br />\r<br /> \r<br />[color=#FF4444][b]Is BEER compatible with other Eagle Eye or Steady Hand mods?[/b][/color]\r<br />\r<br />I&#39;d have to say, unlikely.  It depends on the purpose of the specific mod.\r<br />\r<br /> \r<br />[color=#FF4444][b]Why, oh why is BOSS flagging this mod as unrecognized?[/b][/color]\r<br />\r<br />BEER has not been entered into BOSS&#39;s database yet (I changed the name of the ESP).  If you run BOSS and see that BEER is still not entered, please submit it.\r<br />\r<br />[s][color=#FF4444][b]BEER is now in BOSS&#39;s database.[/b][/color]\r<br />\r<br />Thank you to those that submitted it.[/s]\r<br />\r<br /> \r<br />[color=#FF4444][b]What was changed from the original mod?[/b][/color]\r<br /> \r<br />[list][*]fixed zoom so it can be set back to the vanilla default value (.60)\r<br />[*]changed the zoom slider intervals to .05 (was .25)\r<br />[*]changed the zoom slider range to .05 - 1.00 (was .25 - 2.0)\r<br />[*]changed the stamina slider to increments of 1 (was 2)\r<br />[*]changed the name of the ESP\r<br />[*]changed the SkyUI menu name (removed version info to simplify updates)[/list]\r<br />\r<br />[color=#FF4444][b]&#34;But mine goes to 11&#33;&#34;[/b][/color]\r<br />\r<br />Again, I want to stress that BEER&#39;s sliders do not correspond to any real-life scale.  The number data is a direct reflection of Skyrim&#39;s internal variable representation.  With the methods used in this mod, increasing the upper end of zoom&#39;s slider, for example, will not increase its magnification.  1 is the engine&#39;s upper limit.  Please do not submit requests asking me to increase the magnification - it cannot be done.\r<br />\r<br /> \r<br />[color=#FF4444][b]Anything else?[/b][/color]\r<br />\r<br />Don&#39;t forget, SkyUI takes at least 20 seconds to register new MCM items.\r<br />\r<br />Remember, like advice, Endorsements and Kudos are free, but unlike advice, they are usually welcomed.\r<br />\r<br />Have fun&#33;  And remember, it&#39;s just a game.\r<br />\r<br /> \r<br />[color=#FF4444][b]mackam08&#39;s (aka IrksomeBadger) Original Description[/b][/color]\r<br />\r<br />Update to version 1.1 - Added a bunch of code changes to make everything a lot nicer and remove one particularly ugly hack. Removed options that aren&#39;t needed anymore.\r<br />\r<br />This mod adds the ability for the player to tweak the zoom value associated with the eagle eye perk from the in-game menu, using MCM and SkyUI. It also allows the player to tweak the stamina drain amount when zoomed in. It is also possible to adjust the time slow-down amount that comes with the steady hand perk.\r<br />\r<br />I made this mod because I thought it was a little strange that as a master archer I was stuck using a certain zoom level and a certain timescale. I thought it was especially odd that I had somehow lost the ability to use the faster time setting when I learned the slower one. This mod is for the times when you need a little bit more help making a snipe, or when you feel the slow down is just a little too much or too little, the values are now under your complete control. Customize to your liking&#33;\r<br />\r<br />Your character needs the eagle eye perk to adjust the settings. If you want to play with the steady hand settings you also need the steady hand perk at the second rank (2/2).\r<br />\r<br />For this mod to work you need to have SkyUI installed (And therefore SKSE).\r<br />\r<br />This mod does not require and DLC.\r<br />\r<br />There could be some compatibility issues with other mods that alter these two perks. If you have any specific concerns please tell me and I will investigate.\r<br />\r<br />To install this mod, download the .rar and use the nexus mod manager. Or you can drop the .esp and .bsa files into your Data directory if you don&#39;t use the mod manager.\r<br />\r<br />Created by mackam08 aka IrksomeBadger.\r<br />\r<br />Many thanks to the SkyUI developers for providing the MCM interface. You can learn more about SkyUI here: http://skyrim.nexusmods.com/mods/3863\r<br />\r<br />=============\r<br />RELEASE NOTES\r<br />=============\r<br />\r<br />========================\r<br />v1.0.0\r<br />========================\r<br />\r<br />Date of release: 26/03/2013\r<br />Purpose: Code fix\r<br />Notes: Added a bunch of code changes to make everything a lot nicer and remove one particularly ugly hack. Removed options that aren&#39;t needed anymore.\r<br />Released by: mackam08 aka IrksomeBadger\r<br />\r<br />========================\r<br />v1.0.0\r<br />========================\r<br />\r<br />Date of release: 23/03/2013\r<br />Purpose: Initial release\r<br />Notes: This is the first public release version, it adds the &#34;Better eagle eye&#34; menu to allow the user to tweak the zoom and stamina values related to the eagle eye perk. Also allows the user to tweak the timescale settings related to the stead hand perk in game.\r<br />Released by: mackam08 aka IrksomeBadger\r<br />\r<br />========================",
  "categoryId": "24",
  "version": "1.0",
  "author": "Trasd",
  "createdUnix": "1397971146",
  "updatedUnix": "1398167920",
  "containsAdultContent": false,
  "uploadedBy": "Trasd",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106071",
      "name": "Better Eagle Eye and Steady Hand Redux",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Better Eagle Eye and Steady Hand Redux-53172-1-0.zip",
      "uploadedUnix": "1398167920",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e88f6ebb4f0afaa322c604081d19188291d1fbfd760421f744939b5bd87fc7e2/analysis/1408034791/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Eagle%20Eye%20and%20Steady%20Hand%20Redux-53172-1-0.zip?fid=1000106071&ttl=1535836616&ri=8192&rs=8192&setec=71735d98fb40dc21b978c277349606a1"
    }
  ]
}