{
  "modId": 53192.0,
  "modName": "Elianora&#39;s Extra Resources",
  "summary": "Everyone knows I am crazy about re-texturing vanilla stuff. I have gathered a decent pile over the course of my modding career, thought I would share it with other modders&#33; It includes re-textured furniture, clutter and architectural structures. More to come as I get ideas and people make suggestions.",
  "descriptionHtml": "[center][b][color=#e69138][color=red][b][url=http://www.nexusmods.com/skyrim/mods/65163/?][/url][/b][/color][/color][/b][/center][center][b][color=#e69138][color=red][b][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/xbDPWdF.png[/img][/url][size=6] \r<br />[color=#cc4125][b]\r<br />[url=https://www.facebook.com/elianorapwnsu][img]http://i.imgur.com/267fYFk.png[/img][/url]\r<br />[url=https://www.youtube.com/c/Elianora][img]http://i.imgur.com/bGTVC9s.png[/img]\r<br />[/url][/b][/color][/size][/b][/color][/color][/b]_____________________________________________________________________________________\r<br />\r<br />\r<br />[size=5][color=orange][b]Welcome to my resource corner of the world&#33;[/b][/color][/size]\r<br />\r<br />Did you ever wonder &#34;Man I love decorating my house with the awesome new Dark Elf furniture added by the Dragonborn DLC but THERE ARE NO CONTAINERS OR STORAGE AT ALL&#33; This is totally ruining my Feng Shui.&#34; ? \r<br />\r<br />I sure did, and so I used the Dunmer furniture texture to turn the basic dresser, end table and wardrobe into Dark Elf styled ones. Then I thought what the hell, someone else probably needs these too.\r<br />\r<br />Then I realised my meshes folder was full of re-textured junk that I&#39;d only use in one or two mods. They need to see more action&#33; GO USE THEM. MAKE AWESOME MODS OF UNIQUE AWESOMENESS.\r<br />\r<br />Ya&#39;ll be like \r<br />[img]http://i.imgur.com/CK6MSCK.gif[/img]\r<br />I&#39;m sure.\r<br />\r<br />[size=5][color=#b22222][b]:: PERMISSIONS ::[/b][/color][/size]\r<br />This resource is free game. Made with vanilla, free-to-use and DLC assets, so there&#39;s no ties what-so-ever&#33; If you want to be polite, you&#39;ll credit me, but there&#39;s no need to, really. But I&#39;d love to see what you did with these, so send me a link if you publish something  :)\r<br />\r<br />[size=5][color=#b22222][b]:: REQUIREMENTS ::[/b][/color][/size]\r<br />The meshes are linked to all the DLC textures, so you need Dawnguard, Heartfires and Dragonborn for this to work.\r<br />\r<br />[b][color=orange]Anywhere in this pack where VANILLA textures are used, they will use any retexture the &#34;target computer&#34; has. So all retextures work with these meshes (sans the few custom textured ones in there)[/color][/b]\r<br />\r<br />[size=5][color=orange][b]:: CONTENTS ::[/b][/color][/size]\r<br />\r<br />UPDATE 1\r<br />- Pottery and planters with Dwemer texture\r<br />- Dwemerized snow elf temple items\r<br />- Re-textured Greybeard furniture\r<br />- A Dark Brotherhood hand-print note\r<br />- Riften Stables re-textured to blend in Whiterun architecture\r<br />- Imperial stable re-textured with Windhelm wood and removed stone so it&#39;s just a frame\r<br />- The weathered open chest re-textured as upper-class chest \r<br />- Common bed with pillows/pelts removed and hay changed to a mattress\r<br />- Dark elf furniture storage\r<br />- Wooden panel I use for building shelf units, left an example in the esp\r<br />- Three re-textured fireplaces (Solitude style and 2 Redoran style)\r<br />- 3 new floor textures, remember to include the new textures in your bsa/loose files\r<br />- Dawnguard doorway re-textured for Castle Volkihar style\r<br />- Unlit torch\r<br />\r<br />UPDATE 2\r<br />- See pictures\r<br />\r<br />Man, have you ever walked inside Nordic ruins thinking those hanging ivies would look gorgemahsauce in your new mod? Me too. I had great plans until I went to CK and realised they were attached to the wall elements of Nordic ruins. After flipping off the invisible Bethesda in my room, swearing a little bit and feeling sorry for myself, I manned up, rolled my sleeves and opened the buggers up in Nifskope. Friends, I present you, STRIPPED DOWN IVY MODELS. Woo&#33; I know ya&#39;lls are now forever grateful to me.\r<br />\r<br />UPDATE 3\r<br />- See pictures. I added some storage meshes. They can work as a static, or as a container. I set them up for you, so just copy the one you want. The one&#39;s on the right side work as storage, just drag and drop them to your mod like a barrel or a cupboard. I setup the non havok and the sounds for ya. The left side is static objects, just like the rest of the clutter stuff. If your storage gets sent flying around, use &#34;Don&#39;t Havok Settle&#34; and add &#34;DisableHavokOnLoad&#34; script to them.\r<br />\r<br />UPDATE FROM OLDER VERSIONS:\r<br />Download, extract to Data files. Overwrite when prompted \r<br />\r<br />UPDATE 4\r<br />See pictures. Dunmer panel, a buncha nightshades, a red reach fern x 2, a plaster wall, some Dwemer stuff and coloured baskets.\r<br />\r<br />UPDATE 5\r<br />Adds a plain staff enchanter (non-Dunmer), blue Dwemer texture and planters etc., a Window version of the Winterhold sign (used to be a floor piece), some static robes that you can use for wardrobes etc, and so on. Check out the picture gallery.\r<br />\r<br />UPDATE 6\r<br />The vampire coffin comes with 2 versions: Static decorations and a usable vertical coffin without its lid. You can use the static lid like I did\r<br />in Ravenholm.\r<br />\r<br />The alchemy and enchanting clutter is static. You can build unique workstations like I do, in my mods, by marking a furniture object &#34;Is Marker&#34; in its\r<br />properties. That creates an invisible overlay of the furniture that you can use with any static clutter. Enable markers when browsing my resource.esp to\r<br />see what I mean.\r<br />\r<br />I left a blank rolled paper poster in the set, you can make your own by editing the texture.\r<br />For the Alchemy books, you need Blary&#39;s wallart (http://www.nexusmods.com/skyrim/mods/30602/?) \r<br />\r<br />[size=5][color=orange][b]:: HOW TO USE ::\r<br />[/b][/color][/size]\r<br />[i]&#34;Oh Eli that sounds wonderful, but how do I get to be part of this magical creation kit party of awesome new items?&#34;[/i]\r<br />\r<br />Just open the EliResources.esp file up in CK, copy and paste what you want from the 000EliWarehouse cell to your mod&#39;s cell, and REMEMBER TO DUPLICATE IT. So if an item is called EliObject, just double-click the item in the render window inside your mod cell, click Edit Base and rename it to WhateverObject, confirm creation of new object. Done. That way it&#39;ll still be in your mod when you don&#39;t load my esp in CK any more :)\r<br />\r<br />[b]If you use this esp for mod making, it will make your esp dependent on all the files.. if you copy only certain DLC items to your mod and don&#39;t use all DLC, you can just &#34;Clean masters&#34; in TES5Edit after your mod is done, it will remove dependency on DLC masters you don&#39;t use.[/b]\r<br />\r<br />[img]http://i.imgur.com/OV9PG.gif[/img]\r<br />____________________________________________\r<br />\r<br />Enjoy, and let me know about any items you would love to see re-textured, or some other ideas you have for this resource. I cannot edit models or create new items, but I can shrink down meshes, like that window you see in the cell, I removed it from a full Solitude wall.\r<br />\r<br />There&#39;s not that much stuff yet, but I&#39;ll be sure to update this at some point, so track the file&#33;\r<br />\r<br />[size=5][color=#b22222][b]Let me know if you use them, I&#39;d love to see what people do with these :)[/b][/color][/size]\r<br />\r<br />And remember kids:\r<br />[img]http://i.imgur.com/Svgcm6o.jpg[/img][/center]",
  "categoryId": "82",
  "version": "6",
  "author": "Elianora",
  "createdUnix": "1398018578",
  "updatedUnix": "1431702297",
  "containsAdultContent": false,
  "uploadedBy": "Elianora",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000160175",
      "name": "Eli Resources 6",
      "version": "6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "51967",
      "fileName": "Eli Resources 6-53192-6.7z",
      "uploadedUnix": "1431702297",
      "modVersion": "6",
      "virusScanUrl": "https://www.virustotal.com/file/29c162231daf1b350b92afc71907656a5fce571a2b00ae5416cae40c00ae934e/analysis/1431702371/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eli%20Resources%206-53192-6.7z?fid=1000160175&ttl=1535836647&ri=8192&rs=8192&setec=af9cec1bbb0c5d9f15d997702dec14e5"
    }
  ]
}