{
  "modId": 53197.0,
  "modName": "The Enterprising Thief&#39;s Apartment",
  "summary": "Tired of being a member of the Guild and having to become a Thane to have somewhere to live? Then this mod is for you&#33;",
  "descriptionHtml": "[img]http://images.uesp.net/2/28/SR-icon-shadowmark-Guild.png[/img][size=5][color=red][u]Enterprising Thief&#39;s Apartment[/color][/size][/u][img]http://images.uesp.net/2/28/SR-icon-shadowmark-Guild.png[/img]\r<br />\r<br />Tired of being a member of the Guild and having to become a Thane to have somewhere to live? Or perhaps you downloaded a house mod, only to find it too opulent or too far away from the beloved Flagon? Then this mod is for you&#33;\r<br />\r<br />[b]The Enterprising Thief&#39;s Apartment[/b] is a small abode in an extension of the Cistern.  Most of the Guild members have apartments in the extension as well, but breaking into them might not be the best of ideas, unless you have some way of hiding and fencing goods where your fellow thieves can&#39;t find out. Remember how easy it was to track down Karliah...?\r<br />\r<br />Besides, who wants to sleep in a wet, cold, drafty cistern in the sewers? I don&#39;t care how nice your bed is, that&#39;s pretty nasty. Even with a dainty wooden partition. Apartments are significantly better than some wooden frame draped in moldy furs&#33;\r<br />\r<br />[i]And before I get deluged in gripes about how Bryn, Vex, and Delvin aren&#39;t technically guildmasters, they&#39;re counted as Mercer&#39;s lieutenants, with Brynjolf having the most exalted position as Mercer&#39;s right hand. They would naturally have a little better living space than a common member. Niruin doesn&#39;t get a mansion just because he&#39;s a whiny SOB, and neither do you. Unless you feel like making a mod to get Riftweald Manor. Which, come to think of it, why don&#39;t you get THAT as a reward for becoming Guildmaster? That&#39;s significantly better than Honeyside or an apartment... but you can&#39;t win them all [size=0.5]without mods[/size].[/i]\r<br />\r<br />[color=blue][b][u]Apartments[/u][/b][/color]\r<br />[list]\r<br />[*][color=yellow][b]Thieves&#39; Wing[/b][/color]\r<br />[*]      -Your Apartment\r<br />[*]      -Niruin&#39;s Apartment\r<br />[*]      -Vipir&#39;s Apartment\r<br />[*]      -Thrynn&#39;s Apartment\r<br />[*]      -Cynric&#39;s Apartment\r<br />[*]      -Rune&#39;s Apartment\r<br />[*]      -Tonilia and Vekel&#39;s Apartment\r<br />[*]      -Dirge&#39;s Apartment\r<br />[*]      -5 Abandoned Apartments (two are occupied by Garthar and Ravyn Imyan after you\r<br />          complete the necessary requirements for them to appear)\r<br />[*][color=yellow][b]Guildmasters&#39; Wing[/b][/color]\r<br />[*]      -Brynjolf&#39;s Apartment (Bigger than the regular tenements due to his position as Mercer&#39;s second in command)\r<br />[*]      -Vex&#39;s Apartment (Same as Brynjolf&#39;s, but with a large safe. If only I could port objects from the Thief reboot...)\r<br />[*]      -Delvin&#39;s Apartment (Same as Brynjolf&#39;s, but with tonnes of goods and a study. Apparently Delvin&#39;s a scholar in his free time)\r<br />[/list]\r<br />\r<br />Guild members will go here to sleep instead of their beds in the Cistern. In future updates, I&#39;ll probably remove the beds and just create storage for the Guild members instead, or clutter, or something. I haven&#39;t gotten that far yet.\r<br />[color=red][size=195]WARNING[/size][/color]: BREAKING INTO ANY APARTMENT OTHER THAN AN ABANDONED APARTMENT OR YOUR OWN WILL START THE &#34;REPARATIONS&#34; QUEST ONCE YOUR B&E HAS BEEN DISCOVERED. If a Guild member detects you breaking into an apartment during the act, the &#34;Reparations&#34; quest is triggered right then. While it has an ironic poetry, thieving from thieves costs more than it&#39;s worth.\r<br />(&#34;Once your B&E has been detected&#34; is implemented like so; whenever the Guild member you stole from returns to their apartment and finds their items missing, they&#39;ll be understandably angry. While this has no way to be visually implemented other than a letter or two, the member will be watching both the legal and illegal markets, looking for their things. If you decide to keep their things, I would suggest avoiding them, especially if you have their things on your person, and more so if you have them equipped. If you steal an Amulet of Articulation from Brynjolf&#39;s apartment, don&#39;t wear the bloody thing in front of him. If you steal an Ebony Dagger from Vex, don&#39;t have it equipped in front of her. If you steal anything from anybody, don&#39;t parade the fact that you&#39;re the thief in front of them unless you&#39;re looking for the same thing to happen to you ;) )\r<br />\r<br />[color=blue][b][u]Apartment Features[/b][/u][/color]\r<br />Your apartment has:\r<br />[list]\r<br />[*]A kitchen (has a fire, cooking pot, source of water and food/drink storage)\r<br />[*]A living room (basically just somewhere to sit that isn&#39;t the bedroom)\r<br />[*]A small workshop/study (with a small enchanting table, alchemy table, desk, and bookcases)\r<br />[*]A bedroom (A couch, an end table, and a bed)\r<br />[*]A backstory&#33;\r<br />\r<br />\r<br />[color=blue][b][u]The Previous Owner: Tafiir-Dei[/color][/b][/u]\r<br />Obviously, your apartment had a previous owner. According to Delvin&#39;s letter, he left rather abruptly, however, and never returned. So it&#39;s yours, along with everything inside. Sweet.\r<br />Looking around your new home reveals clues as to the previous tenant&#39;s identity. His journals are lying about, and there&#39;s a few letters stashed about.\r<br />The owner before you was Tafiir-Dei, a cold and sly Argonian alchemist on the brink of a phenomenal breakthrough in alchemical science. He does whatever he needs to get the funds for his work; stealing, cheating, and sometimes even killing for gold or ingredients. He&#39;s left eight volumes of his journal lying about somewhere in Skyrim; find them to find him. It&#39;s not an official quest (doesn&#39;t even really merit an entry in your quest journal), but Tafiir-Dei usually keeps his journals where he keeps his gold. And about that mysterious door in the back of the hidden room? I bet he has the key.\r<br />[color=red]SPOILERS[/color].\r<br />Tafiir-Dei discovered a small Dwemer storeroom behind his apartment, and mined into it. He naturally set up a lab in a derelict section of the Ratway adjacent to the passage, and began doing experiments on skeevers and other vermin. Finding his lab yields a staggering amount of materials for the alchemist, and a fortune for the enterprising thief. Beware, though... this lizard is more devious than even his personal anecdotes reveal.\r<br />\r<br />\r<br />[color=blue][b][u]Obtaining the Key[/b][/u][/color]\r<br />To obtain the key, you must first complete the shill job for Brynjolf in the marketplace (framing Brand-Shei) and the extortion job (getting the 300gp from Bersi, Keerava and Haelga). After that, the courier will deliver a letter from Delvin saying that as a Guild member, you get a living space, and that you can do whatever you please with it. Enclosed is the key, and from then on, you can get into the apartment common and your apartment specifically.\r<br />If you&#39;ve already completed the Thieves Guild questline, Delvin will still send the letter to you. However, I recommend getting the Guild Master&#39;s Quarters by GoddessofThieves if you&#39;re the Guild Master. It makes more sense to have your own suite than have a dingy apartment that belonged to a dead Argonian.\r<br />\r<br />[color=blue][b][u]Compatibility[/u][/b][/color]\r<br />As far as I know, this mod is compatible with everything but mods that directly alter the Thieves&#39; Guild members or the Cistern. If so, try loading my mod before the conflicting ones. If that doesn&#39;t work, try loading theirs before mine. If THAT doesn&#39;t work, tell me.\r<br />\r<br />[b]I give permission for you to edit this mod to fix bugs, but I ask that you send me a message telling me what you fixed, why you fixed it, and how you fixed it. I give permission for anybody to make mod reviews, but I ask that you send me the link to the video or article. I give permission for you to redistribute this mod, but NOT BY POSTING TO ANOTHER MOD SITE. That means you can email somebody the files or give it to them on a flash drive or something, but not post it on a filesharing or mod site.[/b]\r<br />\r<br />[b]Old Versions[/b] will be removed each time an update occurs. If you want an old version for compatibility reasons, I&#39;ll be happy to put it back up.\r<br />[b]Compatibility Requests[/b] are welcomed and I&#39;m happy to accomodate them. I&#39;m already working on stocking the player&#39;s apartment with tools from Shenk&#39;s Thievery Overhaul, Sneak Tools, and the Blackjack mod. If my mod is in some way incompatible with another file, please tell me and I will do my utmost to repair the issue, if it&#39;s a problem with my mod.\r<br />[b]Suggestions[/b] are what I live on. If you haven&#39;t figured it out already by the inundation of &#34;tell mes,&#34; I like suggestions and feedback. A lot. So if you have an idea for the mod, shoot me a PM or something and I&#39;ll see if I can fit it in. You&#39;ll get credit for the idea, and I&#39;ll put it on the main description.\r<br />\r<br />[b][u][color=red]Reported Bugs[/color][/u][/b]\r<br />[list]\r<br />[*]I have a random door appear over the functional door in the Cistern&#39;s training room that serves no purpose other than to wear out my &#34;disable&#34; command. This is probably due to a bad edit on one of my ESPs, and I don&#39;t feel like hunting it down if it only affects me. If you have issues with it, please tell me, and I&#39;ll fix it.\r<br />[*]There are multiple cells that are similarly named. I DID THIS ON PURPOSE. Occasionally, in a massive fit of stupidity, I will do something in Creation Kit that I can&#39;t undo. Normally, this action is not what I intended to happen, and breaks the game entirely. So those other cells are fodder for me to slough unfixable errors off on. The cells that actually contain what you&#39;re looking for can be determined by their possession of an actual sensible name or by trial and error. Whatever works. I&#39;m not getting rid of those cells, because I have a massive tendency to mess things up. Just... leave them alone.\r<br />[*]Deleted navmeshes. I know, I know, blasphemy, I&#39;m a skid, etc, etc.. I&#39;m currently going through tutorials on creating navmeshes and repairing existing ones. I apologize if the game deluges you with errors or CTDs outright. It&#39;ll be fixed as soon as I lower my levels of retardation with them book smarts.\r<br />[*]The Material Transport System is not currently working. Put your stuff in it at your own peril. The Dwemer storeroom is quite capable of holding all your valuables, so it shouldn&#39;t be an issue. [b]Will be fixed in the next update.[/b]\r<br />[*]Getting stuck on top of the mead barrel. It&#39;s your own damn fault for getting up there when there was a perfectly good bar stool right there. If you&#39;re stupid enough to get stuck there, then you deserve starving to death as you stand paralyzed on your food. [size=.35]That was evil, even for me[/size]\r<br />[/list]",
  "categoryId": "67",
  "version": "Beta2.5",
  "author": "QuiMoritur",
  "createdUnix": "1398020626",
  "updatedUnix": "1398020626",
  "containsAdultContent": false,
  "uploadedBy": "QuiMoritur",
  "primaryFile": null,
  "files": []
}