{
  "modId": 53206.0,
  "modName": "Requiem - Inigo Follower Compatibility Patch",
  "summary": "Compatibility patch for Inigo follower mod to bring him in line with Requiem attributes & perks.",
  "descriptionHtml": "This compatibility patch is aimed at bringing the Inigo follower mod in line with Requiem&#39;s attributes & perks.\r<br />\r<br />Changes 2.0\r<br />\r<br />- Removed another two perks which various people on the forum classed as overpowered.\r<br />- Compatible with Inigo 2.0 and Requiem 1.8.1\r<br />Note: Make sure to re-run the Reqitificator (is found with Requiem 1.8.1) after downloading and activating Inigo 2.0 and this patch to ensure Inigo gets all the necessary Mass Effect (among others) perks.\r<br />\r<br />Changes 1.13\r<br />\r<br />- Removed two one-handed perks which made Inigo too powerful.\r<br />- Sorted Masters so this patch should no longer be highlighted Red in Wyre Bash.\r<br />\r<br />Changes 1.1:\r<br />\r<br />- Amended FormID so my changes should now successfully overwrite the Inigos default attributes and perks,\r<br />- Added Greatsword and Dual-Wielding Perks.\r<br />\r<br />Changes 1.0:\r<br />\r<br />- Increased health and Stamina by 450.\r<br />- Removed vanilla perks and added Requiem perks so Indigo is proficient in Archery, Light Armour, One-Handed Sword and Shield.\r<br />- Increased his speed by 15% to match Requiem&#39;s Khajiit movement speeds.\r<br />- Added Heavy Armor perks in case you want him to play as a warrior type.\r<br />- Inigo starts at level 8 and levels with Player up to 81.\r<br />- Removed Ebony Bow, Sword and Arrows and potions from his inventory for two reasons; very powerful and tempting for the player to take.\r<br />\r<br />\r<br />Note - In regards to the high health, Inigo starts with 170 health and I have added 450 (620 in total). Although this seems high, Aela the Huntress for example is level 45 and has 867 health. By the time Inigo reaches level 45 he will approximately be on par with Aela attribute-wise.\r<br />\r<br />I&#39;ve played with him for about 5 hours and loving his character and usefulness in-game. Inigo will seem powerful against low level bandits but against mid to high level character balances out like most Requiem followers.\r<br />\r<br />\r<br />\r<br />Installation:\r<br />\r<br />You must have Requiem.esp and Inigo.esp above this patch in your load order.\r<br />\r<br />\r<br />\r<br />If you have any questions then please ask in the Comments section.",
  "categoryId": "84",
  "version": "2.0",
  "author": "Kazekage1",
  "createdUnix": "1398038308",
  "updatedUnix": "1411168083",
  "containsAdultContent": false,
  "uploadedBy": "Kazekage1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127611",
      "name": "Requiem - Inigo",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Requiem - Inigo-53206-2-0.rar",
      "uploadedUnix": "1411168083",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f3ce634402313dfdc4c5a540e4f4bd217134aebaa269915625ae55e954a91fb/analysis/1411168202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Inigo-53206-2-0.rar?fid=1000127611&ttl=1535836667&ri=8192&rs=8192&setec=53214395c980c70dc314c8011843c41c"
    }
  ]
}