{
  "modId": 53235.0,
  "modName": "No red gem for Old Barbaric Armor",
  "summary": "An alternative texture for Lagrie&#39;s Old Barbaric Wild Armor that replaces the red gem in the belt.\r<br />You will need the original mod: \r<br />http://www.nexusmods.com/skyrim/mods/51167/?",
  "descriptionHtml": "Old Barbaric Wild Armor: no red gem edition\r<br />===========================================\r<br />A texture replacement by Autan Waspeez for the armour uploaded by lagrie, http://www.nexusmods.com/skyrim/mods/51167/?\r<br />&gt;v.1.0\r<br />A small yet significant alteration to the principal texture, plus matching normal map.\r<br />\r<br />Nexus only. You see this on Steam, it&#39;s been stolen.\r<br />\r<br />\r<br />Summary\r<br />=======\r<br />\r<br />I was blown away when I saw the Old Barbaric Wild Armor by lagrie. It was exactly what I wanted for a roaming pagan character, the kind who thinks Daedra worshippers are poseurs and the Forsworn are Hagraven-hugging wimps. The kind who&#39;d rather dance naked round a campfire with Spriggans than sit in some tavern listening to another tedious saga about some idiot who got themselves killed a thousand years ago.\r<br />...but...\r<br />I had to agree with some of the commenters: the big red gem(?) thing on the belt stuck out like a panic button. It just didn&#39;t fit the feel of the rest of the set. So I broke out some programs I haven&#39;t used since modding Fallout 3 and whipped up a texture alternative. Not better, just different. If you like it, please comment/endorse. If you don&#39;t like it, please provide feedback more creative and useful than &#39;retarded&#39; or &#39;lol&#39; or &#39;gay&#39; or whatever people shout at you when you go past on the short bus :)\r<br />\r<br />Likers gonna like, and hopefully endorse.\r<br />\r<br />Installation\r<br />============\r<br />1. Ensure you have lagrie&#39;s Old Barbaric Wild Armor mod installed, active and endorsed. Duh.\r<br />2. Drop the &#39;Data&#39; folder into your Skyrim directory, saying &#39;yes&#39; to merging the folders.\r<br />3. Make sure your Archive Invalidation contains data/textures/barb/tsuncuirass.dds and data/textures/barb/tsuncuirass_n.dds, or do the necessary to make sure it does, like resetting Archive Invalidation in NMM. These are loose files and the original mod works from a .bsa, so it will override without permanently affecting the original mod.\r<br />\r<br />Tools\r<br />=====\r<br />GIMP, DTXBMP, PaintShopPro 8 (&#33;)\r<br />\r<br />If you want to use this in any other mod, all I need is a credit, you don&#39;t have to ask me. I trust you&#39;d be polite enough to ask legrie as well though.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Autan Waspeez",
  "createdUnix": "1398093143",
  "updatedUnix": "1398093048",
  "containsAdultContent": false,
  "uploadedBy": "Autan Waspeez",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105928",
      "name": "No Red Gem for Old Barbaric Wild Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1455",
      "fileName": "No Red Gem for Old Barbaric Wild Armor-53235-1-0.7z",
      "uploadedUnix": "1398093048",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3e3bec740b1d640c0c6d4178730e98f3c9f9dc6b1e2913caa0e2f3cdeca5826f/analysis/1408033352/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Red%20Gem%20for%20Old%20Barbaric%20Wild%20Armor-53235-1-0.7z?fid=1000105928&ttl=1535836705&ri=8192&rs=8192&setec=3235bd2a2fb28973840fb7ca7d9a1994"
    }
  ]
}