{
  "modId": 53247.0,
  "modName": "Perkbaum - verbesserter Kampfstil",
  "summary": "Verbesserte Perkbäume für einen leicht veränderten Kampfstil, möglichst nahe an Vanilla\r<br />vor allem: Zweihänder, Einhänder\r<br />leichte Veränderungen: Schwere Rüstung, Leichte Rüstung, Schießkunst, Schleichen",
  "descriptionHtml": "Perkbäume - verbesserter Kampfstil\r<br />\r<br />\r<br />\r<br />In dieser Mod werden vor allem die Nahkampfwaffenperks überarbeitet. Ich fand das Nahkampfsystem in Vanilla-Skyrim immer recht langweilig, da es nur daraus bestand zum ersten Gegner hinzulaufen, Mächtige Angriffe zu machen bis der Gegner tot ist, und dann zum nächsten zu laufen und dort das gleiche zu machen. Wenn die Ausdauer aufgebraucht war, hat man eben kurz normale Angriffe gemacht, ansonsten keine Variationen.\r<br />\r<br />Zudem waren die Waffenspezialisierungsperks in den Vanillabäumen zwar eine gute Idee - aber die Schwert- und Axtspezialisierungen waren leider nur eine Perkverschwendung, da sie wenig Schaden und machen spätestens ab lvl 30 komplett vernachlässigbar sind.\r<br />\r<br />Über die Zeit habe ich mir meine eigene Mod erstellt, geändert, und gebalanced, um diese Probleme zu lösen.\r<br />\r<br />Durch die Perks lassen sich jetzt die Kampfstile mit Einhändern und Zweihändern leicht verändern. Man klickt normal um mit seiner Waffe anzugreifen, mächtige Angriffe bringen keinen Schadensbonus mehr, sondern treffen alle Gegner vor einem. Diese Veränderung ist allerdings optional, da die Perks ausgelassen werden können.\r<br />\r<br />Ansonsten wurden vor die Waffenspezialisierungen verändert und allen Waffengattungen zugänglich gemacht. Der Nutzlose Blutungsschaden wurde entfernt. Kritische Treffer sind jetzt auch im Endspiel sinnvoll (auser man nutzt den Schmiedeexploit für lächerlich starke Waffen). Das Balancing zwischen schwerer und leichter Rüstung wurde leicht verändert, so das beide eine sinnvolle Wahl darstellen. Auch der Schaden von Bögen wurde angepasst um gebalanced zu sein. Und zuletzt wurden die heimlichen Angriffe für Zweihänder und Bögen verstärkt.\r<br />\r<br />Grundsätzlich habe ich versucht, dem Vanillaspielgefühl und -einstellungen möglichst nahe zu bleiben und durch einfache, aber geschickte Veränderungen, das Balancing zwischen Kampfstilen zu verbessern, Ein- und Zweihandkampfstilen mehr Variatnen zu geben, jeden Perk wertvoll zu machen und die Steuerung im Nahkampf angenehmer zu gestalten.\r<br />\r<br />\r<br />\r<br />Es gibt zwei Versionen dieser Mod.\r<br />\r<br />Die Mainversion basiert auf der &#34;Attack Speed Mod&#34; (ASM).\r<br />Kurz gesagt ist diese Mod nötig, damit Angriffsgeschwindigkeitssteigerungen richtig stacken. Ansonsten funktioniert der Schrei &#34;Elementare Raserei&#34; nicht richtig mit &#34;Doppelwirbel&#34; (in meiner Mod &#34;Tanzender Stahl), &#34;Schnellschuss&#34; und &#34;Raserei&#34; (wird durch meine Mod hinzugefügt).\r<br />ASM verändert die Effekte von Doppelwirbel, Elementare Raserei und Schnellschuss und ist daher mit anderen Mods, welche diese verändern inkompatibel und muss nach den inkompatiblen Mods geladen werden um diese einzelnen Effekte zu überschreiben.\r<br />\r<br />ASM muss vor meiner PerkOverhaul.esp geladen werden, da ich den Effekt von Doppelwirbel verändere, aber eben angepasst zu ASM\r<br />Es wird nur die Mainfile benötigt: http://www.nexusmods.com/skyrim/mods/28456/?\r<br />\r<br />Loadorder:\r<br />\r<br />xyz.esp (&lt;- Mods, die mit ASM inkompatibel sind)\r<br />asm.esp\r<br />PerkOverhaul.esp\r<br />\r<br />Wem dieses Problem von Vanilla-Skyrim egal ist kann auch einfach die optionale Version ohne ASM nutzen. Die Mainversion wird dazu nicht benötigt. Allerdings wird Elementare Raserei dann die Angriffsgeschwindigkeit zusätzlich um 100% steigern, sobald man &#34;Tanzender Stahl&#34; (bzw &#34;Doppelwirbel&#34;), &#34;Raserei&#34; oder &#34;Schnellschuss&#34; erwirbt.  \r<br />\r<br />\r<br />\r<br />Nun eine genau Auflistung über die Perks aus dem Einhand- und Zweihandbaum, sowie eine genau Beschreibung der veränderten Perks aus den anderen Bäumen\r<br />\r<br />\r<br />\r<br />Zweihändig\r<br />\r<br />Der Kampfstil mit Zweihändern wurde verändert:\r<br />\r<br />- Der Bonusschaden wurde von 100% auf 150% erhöht\r<br />- Waffenspezialisierungsperks wurden verändert und sind nun für alle Waffengattungen zugänglich (Blutungsschaden wurde entfernt und ersetzt)\r<br />- Der kritische Trefferschaden wurde an den Entwicklungsprozess im Spiel angepasst\r<br />- Meisterperk wurde geändert in eine Chance auf entwaffnen\r<br />- Baumstruktur wurde leicht verändert\r<br />\r<br />- Ein optionaler Perk ist möglich, durch den mächtige Angriffe alle Gegner vor einem Treffen anstatt zusätzlichen Schaden zu verursachen\r<br />-&gt; man kämpft also hauptsächlich mit normalen Klicks und macht nur dann einen mächtigen Angriff wenn man Gegner ins straucheln bringen will und/oder mehrere Gegner treffen will\r<br />-&gt; Um den fehlenden zusätzlichen Schaden durch die mächtigen Angriffe auszugleichen, kann man jetzt Angriffsgeschwindigkeit und mehr Schaden skillen\r<br />\r<br />\r<br />Barbar - 5 Ränge - 30% mehr Schaden mit Zweihändern pro Rang\r<br />(Skill 00-20-40-60-80)\r<br />\r<br />Gewaltiger Ansturm - Du kannst nun einen mächtigen Angriff aus dem Sprint heraus ausführen, der zusätzlichen Schaden verursacht\r<br />(Skill 25)\r<br />\r<br />Raserei - 3 Ränge - 10%/20%/30% schneller Angreifen mit Zweihändern\r<br />(Skill 30-60-70)\r<br />\r<br />Tiefe Wunden - 3 Ränge - Erhöht die kritische Trefferchance mit allen Zweihandwaffen auf 10%/15%/20%. Erhöht zusäztlich den kritischen Trefferschaden auf bis zu 46/93/140 Schadenspunkte\r<br />-&gt; der kritische Schaden hängt wie im Original von der Waffengattung und vom Waffenmaterial ab\r<br />(Skill 30-60-70)\r<br />\r<br />Schwere Treffer - 3 Ränge - Angriffe mit allen Zweihandwaffen ignorieren 25%/50%/75% Rüstung\r<br />(Skill 30-60-70)\r<br />\r<br />Rundumschläge - Mächtige Angriffe mit Zweihandwaffen treffen nun alle Gegner vor dir, verursachen dabei allerdings keinen zusätzlichen Schaden mehr\r<br />-&gt; Dieser Perk ist optional und kann ausgelassen werden\r<br />(Skill 35)\r<br />\r<br />Kraftreserven - Beim führen von zweihändigen Waffen regeneriert sich eure Ausdauer 50% schneller. Mächtige Angriffe können den Gegner enthaupten.\r<br />-&gt; Kraftreserven oder Kriegerhaltung muss gewählt werden um zum letzten Punkt zu kommen\r<br />(Skill 50)\r<br />\r<br />Kriegerhaltung - Mächtige Angriffe mit Zweihandwaffen verbrauchen jetzt 25% weniger Ausdauer\r<br />-&gt; Kraftreserven oder Kriegerhaltung muss gewählt werden um zum letzten Punkt zu kommen\r<br />(Skill 50)\r<br />\r<br />Meister des Krieges - Angriffe mit Zweihandwaffen haben eine Chance das Ziel zu entwaffnen\r<br />(Skill 90)\r<br />\r<br />\r<br />Einhändig\r<br />\r<br />Der Kampfstil mit Einhändern wurde verändert:\r<br />\r<br />- Bonusangriffsgeschwindigkeit für kämpfen mit zwei Einhandwaffen wirkt jetzt auch beim kämpfen mit einer Einhandwaffe (auch in kombination mit Schild oder Zauber)\r<br />- Waffenspezialisierungsperks wurden verändert und sind nun für alle Waffengattungen zugänglich (Blutungsschaden wurde entfernt und ersetzt)\r<br />- Der kritische Trefferschaden wurde an den Entwicklungsprozess im Spiel angepasst\r<br />- Meisterperk wurde geändert: anstatt eine Chance auf Lähmen bietet er nun sicheres Lähmen zu sehr hohen Ausdauerkosten\r<br />\r<br />- Ein optionaler Perk ist möglich, durch den mächtige Angriffe alle Gegner vor einem Treffen anstatt zusätzlichen Schaden zu verursachen\r<br />-&gt; man kämpft also hauptsächlich mit normalen Klicks und macht nur dann einen mächtigen Angriff wenn man Gegner ins straucheln bringen will und/oder mehrere Gegner treffen will\r<br />-&gt; Um den fehlenden zusätzlichen Schaden durch die mächtigen Angriffe auszugleichen, kann man nun eine sehr hohe kritische Trefferchance skillen\r<br />\r<br />Landsknecht - unverändert - 5 Ränge je +20% Schaden\r<br />\r<br />Wilder Krieger - optional - Mächtige Angriffe treffen nun alle Gegner vor euch, verursachen dabei allerdings keinen zusätzlichen Schaden mehr\r<br />(Skill 20)\r<br />\r<br />Kampfhaltung - unverändert - Mächtige Angriffe kosten 25% weniger Ausdauer\r<br />\r<br />Knochenbrecher - Angriffe mit allen Einhandwaffen ignorieren 25%/50%/75% Rüstung\r<br />(Skill 30-60-70)\r<br />\r<br />Duellant - 3 Ränge - Attacken mit allen Einhändern haben nun eine Chance von 17%/34%/50% kritisch zu treffen\r<br />(Skill 30-60-70)\r<br />\r<br />Gemetzel - 3 Ränge - Erhöht den kritischen Trefferschaden auf bis zu 32/64/96 zusätzliche Schadenspunkte\r<br />-&gt; der kritische Schaden hängt wie im Original von der Waffengattung und vom Waffenmaterial ab\r<br />(Skill 30-60-70)\r<br />\r<br />Tanzender Stahl - 2 Ränge - Angriffe mit allen Einhändern sind nun 20%/35% schneller\r<br />(Skill 30-50)\r<br />\r<br />Langer Atem - Beim führen von einhändigen Waffen regeneriert sich eure Ausdauer 50% schneller. Mächtige Angriffe können den Gegner enthaupten.\r<br />-&gt; Langer Atem oder Ansturm muss gewählt werden um zum letzten Punkt zu kommen\r<br />(Skill 50)\r<br />\r<br />Ansturm - Du kannst nun einen mächtigen Angriff aus dem Sprint heraus ausführen, der zusätzlichen Schaden verursacht\r<br />(Skill 50)\r<br />\r<br />Lähmender Schlag - Ein mächtiger Angriff nach hinten lähmt jetzt das Ziel für 7 Sekunden, kostet jedoch dreifach Ausdauer\r<br />(Skill 90)\r<br />\r<br />\r<br />Schießkunst\r<br />\r<br />Dieser Baum wurde nur im Schaden an die anderen Bäume angepasst, sowie die Chance zu betäuben beim Meisterperk. Alle anderen Perks sind unverändert\r<br />\r<br />Überspannen - 5 Ränge - 35% mehr Schaden mit Bögen pro Rang\r<br />\r<br />Todesschuss - 3 Ränge - 10%/15%/20% Chance auf einen kritischen Treffer, der bis zu 40/80/120 zusätzlichen Schaden verursacht.\r<br />-&gt; der kritische Schaden hängt wie im Grundspiel vom Waffenmaterial ab\r<br />\r<br />Meisterschuss - 20% Chance das Ziel zu betäuben (erhöht von 15%)\r<br />\r<br />\r<br />Leichte Rüstung\r<br />\r<br />- In diesem Baum wurde der zweite Perk, der 25% Rüstungsbonus gibt wenn man nur leiche Rüstung trägt, verändert. Er gibt jetzt nur noch 5% Rüstungsbonus, so dass schwere Rüstung einen leicht verbesserten Vorteil hat. Zum Ausgleich verringert der Punkt die kosten von mächtigen Angriffen um 10%.\r<br />- Beim Perk &#34;Windläufer&#34; wird nun kein Helm mehr benötigt (Ausdauer regeneriert sich 50% schneller wenn nur leichte Rüstung getragen wird)\r<br />\r<br />\r<br />Schwere Rüstung\r<br />\r<br />Schwere Rüstung bietet in Skyrim keinen wirklichen Vorteil, deswegen wurden einige leichte Veränderungen vorgenommen.\r<br />\r<br />Arkane Resistenz - Schwere Rüstung schützt euch zu 15% vor Magieschaden (Keine magische Resistenz, wird bei der Berechnung des Magieresistenzcaps von 85% nicht berücksichtigt .. man kann also 85% + diesen Skill haben)\r<br />-&gt; ersetzt Stählerne Fäuste\r<br />\r<br />Rohe Kraft - Halbiert den Sturzschaden wenn nur schwere Rüstung getragen wird. Handschuhe verursachen ihren Rüstwert als Schaden bei Faustkämpfen.\r<br />-&gt; erstezt Abfedern: kombiniert &#34;Stählerne Fäuste&#34; mit &#34;Abfedern&#34;\r<br />\r<br />Konditionierung - Schwere Rüstung verlangsamt nicht mehr\r<br />-&gt; Skillanforderung von 70 auf 60 gesenkt\r<br />\r<br />Gut ausgestattet - 25% Rüstungsbonus wenn nur schwere Rüstung getragen wird\r<br />-&gt; Hier wurde nur die Bedingung, dass ein Helm getragen werden muss, entfernt\r<br />\r<br />\r<br />Schleichen\r<br />\r<br />Hier wurden nur die Beiden Perks verändert, die den Schaden bei heimlichen Angriffen mit Einhändern und Bögen erhöhen\r<br />- Der Perk für Einhänder betrifft jetzt auch Zweihänder\r<br />- Der Schadensbonus für Bögen wurde von 300% auf 600% erhöht\r<br />\r<br />\r<br />\r<br />Kombatibilität:\r<br />\r<br />Diese Mod ist grundsätzlich mit allem kompatibel, was NICHT den Einhand- und Zweihandbaum, so wie die Veränderten Perks in den anderen Bäumen verändert.\r<br />\r<br />Ich habe diese Mod nicht modular gestaltet, da es dabei auch ums Balancing geht. Einzelne Bäume oder auch einzelne Perks können von anderen (modularen) Mods aber problemlos überschrieben werden.\r<br />\r<br />Andere Kampfsystem-Mods, wie z.B. Duel (welche die Perks nicht verändert), sind kompatibel.\r<br />Wenn sie die Perks verändern, können diese durch meine Mod überschrieben werden, indem sie in der Ladereihenfolge über meiner Mod stehen, ob das dann allerdings noch gebalanced ist muss jeder selbst wissen ;D\r<br />\r<br />Respecc Mods sollten kompatibel sein, da Vanilla-Perks nur verändert werden, aber nicht gelöscht. Keine neuen Perks werden hinzugefügt.\r<br />(Ich selbst verwende Perk Reset - die alte Version ohne SkyRe Support http://www.nexusmods.com/skyrim/mods/30684/? )\r<br />\r<br />Meine Mod enthält keine Scripts und kann Problemlos deinstalliert werden\r<br />\r<br />\r<br />Erlaubnis:\r<br />Der Inhalt dieser Mod darf nach belieben weiterverwendet werden. Allerdings würde ich mich über Credits und/oder eine kurze Benachrichtigung freuen.\r<br />\r<br />Credits:\r<br />Bethesda: Skyrim, Creation Kit\r<br />Sharlikran / ElminsterAU: TES5Edit\r<br />\r<br />",
  "categoryId": "73",
  "version": "1.0",
  "author": "JoeKa8",
  "createdUnix": "1398106878",
  "updatedUnix": "1398106872",
  "containsAdultContent": false,
  "uploadedBy": "JoeKa8",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105976",
      "name": "PerkOverhaul mit ASM",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "PerkOverhaul mit ASM-53247-1-0.rar",
      "uploadedUnix": "1398106792",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/272a80a5c21783b32fc2e61bd481c5e631a2f0c981963528b1235939a14bbe27/analysis/1408033808/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerkOverhaul%20mit%20ASM-53247-1-0.rar?fid=1000105976&ttl=1535836720&ri=8192&rs=8192&setec=a72cfbc7ea840636923f213d98593062"
    },
    {
      "fileId": "1000105977",
      "name": "PerkOverhaul ohne ASM",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "PerkOverhaul ohne ASM-53247-1-0.rar",
      "uploadedUnix": "1398106872",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fec6417f021f3b7e121aeb080b79072444b26a6786741416c4bea5f82a4cb243/analysis/1408033808/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerkOverhaul%20ohne%20ASM-53247-1-0.rar?fid=1000105977&ttl=1535836721&ri=8192&rs=8192&setec=92c4ee62a44e8f9dec81996b9a513880"
    }
  ]
}