{
  "modId": 53252.0,
  "modName": "Arkaner Krieger - Kampfmagier - Verzauberungsbaum",
  "summary": "Der Verzauberungsbaum wird zu einem Skillbaum geändert, der spezielle Fähigkeiten gibt und dabei die Spielererstellten Verzauberungen ersetzt",
  "descriptionHtml": "Skillbaum Arkaner Krieger oder Kampfmagier\r<br />\r<br />- Die Mod funktioniert, hat aber im Moment noch ein kleines Problem: siehe unten -\r<br />\r<br />Edit: Ich verwende diese Mod zusammen mit SmartCast. Damit ist es möglich, Ringe zu erstellen die Zauber (Heilungen, Runen, Eisspeer usw) instant zaubern ohne das man den Zauber in der Hand haben muss. So kann man Zaubern während man einen Zweihänder in der Hand hat und muss nur auf seine Magicka achten.\r<br />http://www.nexusmods.com/skyrim/mods/43123/?\r<br />\r<br />Was ich in Skyrim nie mochte war das Verzauberungssystem. Umständliche Menüführung, wodurch das skillen nervig wird. Keine schöne Skillentwicklung, da sehr lang nutzlos, um dann mit dem letzten Perk für zwei Verzauberungen schlagartig zu stark zu werden. Und letzten Endes sind auch die Waffen- oder Rüstungsverzauberungen, welche den Schaden erhöhen, witzlos, da man seinen Schaden sowieso über den Schwierigkeitsgrad einstellt um sein Spiel zu balancen. \r<br />\r<br />Diese Mod versucht nicht das Verzauberungssystem zu verbessern - sondern es zu ersetzen.\r<br />\r<br />Das Verzauberungssystem an sich existiert noch, allerdings verbessert der Baum die eigenen Verzauberungen nicht mehr, sondern gibt Fähigkeiten, die den Spieler direkt verbessern.\r<br />\r<br />Während Magier und Nahkämpfer von vielen der Perks profitieren können, profitieren davon vor allem Spieler, die beide Fähigkeiten vereinen, z.B. Arkane Krieger, Battlemages, Spellswords usw.\r<br />\r<br />Um zugang zu den Punkten zu haben muss nicht das Talent Verzauberung erhöht werden, sondern das Talent Zerstörung.\r<br />\r<br />\r<br />Startperk: Resourcenregeneration\r<br />\r<br />Arkane Quelle - 4 Ränge\r<br />\r<br />20%/40%/60%/80% verbesserte Ausdauerregenerationsrate\r<br />zudem wird die Manaregeneration um 30%/60%/90%/120% verbessert - allerdings nur, wenn man keine Nahkampfwaffe oder Bogen in der Hand hält\r<br />Wenn man eine Waffe nutzt, kann man den dritten Effekt des Perks nutzen: Nahkampfangriffe stellen, immer wenn ein Gegner mit &#34;Gedankenblock&#34; oder &#34;Magickabrand&#34; getroffen wird, 15/30/45/60 Magicka her\r<br />\r<br />(Zerstörungsskill 20-40-60-80)\r<br />\r<br />\r<br />Erster Zweig: Gegnerische Zauber im Nahkampf unterbinden\r<br />\r<br />Gedankenblock\r<br />Wenn ihr einen Gegner trefft, verbrennt ihr 30 Magicka bei ihm\r<br />\r<br />(Zerstörungsskill 30)\r<br />\r<br />Magickabrand\r<br />Wenn ihr einen Gegner trefft, verbrennt ihr jetzt 60 Magicka bei ihm\r<br />\r<br />(Zerstörungsskill 60)\r<br />\r<br />\r<br />Zweiter Zweig: Gegner verlangsamen (Nur die Bewegungsgeschwindigkeit, die Angriffsgeschwindigkeit wird nicht verlangsamt, somit auch nicht die Geschwindigkeit wenn ein Gegner einen mächtigen Angriff nach vorne macht)\r<br />\r<br />Schneewirbel\r<br />Ein Treffer mit einer Nahkampfwaffe verringert das Bewegungstempo für 4 Sekunden um 80%\r<br />Bögen verlangsamen nur für 1 Sekunde\r<br />\r<br />(Zerstörungsskill 30)\r<br />\r<br />Tiefschnee\r<br />Ein Treffer mit einer Nahkampfwaffe verringert das Bewegungstempo jetzt für 8 Sekunden um 80%\r<br />Bögen verlangsamen jetzt für 2 Sekunden\r<br />\r<br />(Zerstörungsskill 60)\r<br />\r<br />\r<br />Dritter Zweig: In Magierroben schneller laufen (allerdings nur im Kampf - passt zu den magischen Rüstungen, die man im Veränderungsbaum verbessern kann wenn man nur Kleidung trägt)\r<br />\r<br />Konzentrierter Körper\r<br />Wenn ihr nur Kleidung tragt erhöht sich eure eigene Bewegungsgeschwindigkeit im Kampf um 6%\r<br />\r<br />(Zerstörungsskill 30)\r<br />\r<br />Geladener Körper\r<br />\r<br />Wenn ihr nur Kleidung tragt erhöht sich eure eigene Bewegungsgeschwindigkeit im Kampf um weitere 6%\r<br />\r<br />(Zerstörungsskill 60)\r<br />\r<br />\r<br />Vierter Zweig: Auf kosten von Schaden schneller angreifen (Zum einen kann man mit &#34;Arkane Quelle&#34; schneller Magicka herstellen, zum ist die Gefahr durch einen Schildschlag unterbrochen zu werden geringer)\r<br />\r<br />Energie bündeln\r<br />Ihr greift mit Bögen und Nahkampfwaffen jetzt 10% schneller an, verursacht dabei allerdings 10% weniger Schaden\r<br />\r<br />(Zerstörungsskill 25)\r<br />\r<br />Synthese\r<br />Ihr greift mit Bögen und Nahkampfwaffen jetzt 20% schneller an, verursacht dabei allerdings 20% weniger Schaden\r<br />\r<br />(Zerstörungsskill 50)\r<br />\r<br />\r<br />Sturm\r<br />Ihr greift mit Bögen und Nahkampfwaffen jetzt 30% schneller an, verursacht dabei allerdings 30% weniger Schaden\r<br />\r<br />(Zerstörungsskill 75)\r<br />\r<br />\r<br />Schneewirbel und Gedankenblock (bzw. ihre Upgradeversionen) funktionieren zusammen und können beide gleichzeitig aktiv sein. Die Fähigkeiten funktionieren auch mit beschworenen Waffen und sind mit den Perks &#34;Seelenfalle&#34; und &#34;Bindung zu Oblivion&#34; aus dem Veränderungsbaum kompatibel&#33;\r<br />Allerdings muss ich zugeben, dass die Abfrage um Magicka herzustellen, wenn man einen Gegner trifft etwas holprig ist und nicht immer aktiviert wird - dafür ist diese Mod Scriptfrei.\r<br />\r<br />\r<br />Für diese Mod wird eine weitere Mod benötigt: &#34;Attack Speed Mod&#34; (ASM).\r<br />\r<br />Kurz gesagt ist diese Mod nötig, damit Angriffsgeschwindigkeitssteigerungen richtig stacken. Ansonsten funktioniert der Schrei &#34;Elementare Raserei&#34; nicht richtig mit &#34;Doppelwirbel&#34;, &#34;Schnellschuss&#34;.\r<br />ASM verändert die Effekte von Doppelwirbel, Elementare Raserei und Schnellschuss und ist daher mit anderen Mods, welche diese verändern inkompatibel und muss nach den inkompatiblen Mods geladen werden um diese einzelnen Effekte zu überschreiben.\r<br />\r<br />ASM muss vor meiner Battlemage.esp geladen werden, da ich den Effekt von Doppelwirbel verändere, aber eben angepasst zu ASM\r<br />Es wird nur die Mainfile benötigt: http://www.nexusmods.com/skyrim/mods/28456/?\r<br />\r<br />Loadorder:\r<br />\r<br />xyz.esp (&lt;- Mods, die mit ASM inkompatibel sind)\r<br />asm.esp\r<br />Battlemage.esp\r<br />xyz.esp (&lt;- Mods, die mit ASM kompatibel sind)\r<br />\r<br />\r<br />Wenn man auf ASM verzichtet wird der 4. Baum, der die Angriffsgeschwindigkeit erhöht diese anstatt dessen auf 10%/20%/30% verringern&#33;\r<br />(Spezialfall: Wer mit zwei Einhandwaffen kämpft und den Doppelwirbel geskilled hat, wird mit dem 4. Baum die korrekten steigerungen bekommen)\r<br />\r<br />\r<br />Probleme:\r<br />\r<br />Das System, welches darauf basiert, das man den Gegner trifft (Magicka herstellen, Gedankenblock, Schneewirbel), ist nicht komplett mit den Meisterperks von Einhändern, Zweihändern und Bögen kompatibel. \r<br />\r<br />An sich wüsste ich zwar, wie man dieses Problem behebt, allerdings müsste ich dazu die Meisterperks verändern, was zu anderen Mods inkompatibel sein könnte. Zudem wäre es eine sehr umständliche und aufwendige Lösung. \r<br />\r<br />Für den Moment gibt es folgende (nicht optimale) Lösung:\r<br />Die Perks aus dem 1h, 2h, oder Bogenbaum müssen zuerst geskilled werden (gängige Respecc-Mod kann dabei behilflich sein). Danach die Perks aus meinem &#34;Arkaner Krieger&#34;Baum. So wird zuerst die Chance für die Vanillaperks berechnet - und wenn sie nicht auftreten werden meine Perks aktiv. Schiesst man jetzt allerdings weiter Pfeile auf einen Gegner, der bereits gelähmt ist, wird jedesmal wieder der Lähmungszauber aktiv, bis dieser ausgelaufen ist.\r<br />Bei den Nahkampfwaffen ist das ein nicht so großes Problem, da diese nur durch einen mächtigen Angriff nach hinten ausgelöst werden. \r<br />\r<br />Wenn man diese Mod verwenden will, wäre es im Moment die sicherste Lösung, die Meisterperks aus dem 1h, 2h, und Bogenbaum nicht zu skillen. Man erhält dafür ja auch einen ausgleich ;D\r<br />\r<br />Ich versuche eine Lösung dafür zu finden\r<br />\r<br />\r<br />Erlaubnis:\r<br />Die Mod darf beliebig weiterverwendet werden, allerdings würde ich mich über eine kurze Benachrichtigung und Credits würde ich mich freuen\r<br />\r<br />Credits\r<br />Bethesda: Skyrim, Creation Kit\r<br />Sharlikran / ElminsterAU: TES5Edit\r<br />\r<br />",
  "categoryId": "24",
  "version": "1.0",
  "author": "JoeKa8",
  "createdUnix": "1398113872",
  "updatedUnix": "1398113820",
  "containsAdultContent": false,
  "uploadedBy": "JoeKa8",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000105992",
      "name": "Arkaner Krieger",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Arkaner Krieger-53252-1-0.rar",
      "uploadedUnix": "1398113820",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d11c0e836451baab981b9dcfa8d0d89d7e141e5bb428bdb4770b1a47b7d3003a/analysis/1408034036/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arkaner%20Krieger-53252-1-0.rar?fid=1000105992&ttl=1535836725&ri=8192&rs=8192&setec=25d2b21af2e6b46422dede147aeee995"
    }
  ]
}