{
  "modId": 53279.0,
  "modName": "Casius Varon - A Companion Mod For TESV Skyrim",
  "summary": "A Great War Veteran - See the full backstory on the file page",
  "descriptionHtml": "You can find this veteran at the solitude docks, near the shipping office\r<br />\r<br />Cassius Varon born 7th Heartfire 4E 140 in Chorrol. He spent the first 16 \r<br />years of his life working in his families mill just on the outskirts of the\r<br />town. \r<br />\r<br />On the 5th of Second Seed 4E 157 the farm was attacked by a group\r<br />of elven bandits who killed his family with no mercy. The leader of the\r<br />group was called Tumrenen Kaeuseus a man wanted all over Tamriel. His \r<br />group consisted of 4 other elves named Gilgonolemar Larethiath a skilled\r<br />archer, Halngoth Larethaen a half crazed mage, Faraloon Larethbinder\r<br />a master sword fighter and Hondntar Grayaen a very small assassin.\r<br />\r<br />Cassius barely escaped but not with getting a scar down the right side of\r<br />his face from his brow to his lip but completely removed Tumrenen&#39;s left\r<br />arm.\r<br />\r<br />Cassius travelled all of Tamriel in 3 years searching for the bandit\r<br />group who attacked the farm. He learned the group that attacked him were\r<br />called The Black Diamond Bandits and they only attacked people or places\r<br />in posession of black diamonds.\r<br />\r<br />Cassius learned that black diamonds were nearly 10x times more valuable than normal diamonds and could be crafted\r<br />in a misty black armor that was near indestructable.\r<br />\r<br />In his 3 years of searching, Cassius had heard rumors of a powerful Breton mage named \r<br />Celbard Maneiane. Cassius was intriuged by Celbard&#39;s ideas of prolonging\r<br />life to hundreds of years but keeping the body looking how it originally\r<br />looked at the time of the spell was cast.\r<br />\r<br />Celbard needed just one thing for this spell to work and that was a black diamond. All of the black \r<br />diamonds belonged to the The Black Diamond Bandits. Cassius now had 2 \r<br />good reasons to go after them. After he overheard a group of refugees \r<br />in a tavern in Wayrest talking about how a group of 4 high elves attacked\r<br />and took a valuable black gemstone off of them he decided to ask them\r<br />where this attack took place. They told him it had happened all the way\r<br />over in Mournhold in Morrowind. \r<br />\r<br />Cassius told Celbard he had located a black diamond and was setting off to Morrowind to find it. After another 3 years of travelling to Morrowind he eventually wound up in Mournhold \r<br />where he began his search. To his surprise he found all 4 of them in\r<br />a tavern in Godsreach. They didn&#39;t recognise him so he used this to his\r<br />advantage. He poisoned Hondnthar which arroused suspicion and paranoia\r<br />grew between the remaining 4 elves. \r<br />\r<br />All 4 of them went to the same room upstairs and barred the doors from the inside. To their disadvantage their room was located at the back of the tavern. In his 6 years of being\r<br />alone he had spent a great deal of time with the Wood Elves and Khajits\r<br />and learnt the most effective free running techniques in all of Tamriel.\r<br />Cassius climbed to the back window and opened it without anyone knowing.\r<br />\r<br />He was about to strike when he realised that Tumrenen was wearing black\r<br />diamond armor and his entire body was protected with the exception of his\r<br />face. Cassius was wearing just simple black clothes, a black cape and a\r<br />hood with a facemask. Deciding it was only a matter of time before he was\r<br />seen, he struck with his steel longsword he acquired from his time spent\r<br />in Valenwood. He ran Gilgonolemar through with it killing him instantly.\r<br />Halngoth went in for a strike but missed giving Cassius the perfect time\r<br />to strike. He decapitated him. Faraloon tried climbing out of the window\r<br />but Cassius threw a knife at him sending him out of the Window onto the \r<br />ground dying. \r<br />\r<br />Finally it was just him and Tumrenen. Turmenen went to stab\r<br />Cassius but he deflected it and disarmed him, but not before being disarmed himself. Cassius punched Turmenen as hard as he could knocking him back. Turmenen threw a punch at Cassius while wearing the black diamond gauntlets instantly getting Cassius to floor and stunning him. \r<br />\r<br />Turmenen picked up Cassius and went to throw him out of the window to his death \r<br />when Cassius head butted him and kicked him in the jaw. Turmenen was on the \r<br />floor stunned. \r<br />\r<br />Cassius grabbed his sword and plunged it deep into Turmenens\r<br />eye killing him dead. Cassius looted all of the corpses of the bandits\r<br />and sold all of their possessions giving him 5,678 gold. Cassius used \r<br />money to sail to Daggerfall and met up with Celbard giving him the \r<br />black diamond armor set. \r<br />\r<br />Celbard used the armor to amplify the power of \r<br />the spell so it would grant near immortal life. As Celbard cast the spell\r<br />he felt weary and fell to his knees. He told Cassius that in order for the \r<br />spell to work he had to give his life. Celbard died and was buried outside\r<br />of Daggerfall with a unmarked grave.\r<br />\r<br />It is now 4E 168 and Emperor Titus Mede the II has ascended to the throne.\r<br />Cassius has been living quietly for many years on his old families farm \r<br />which he rebuilt. Cassius heard rumors of war and joined the Imperial\r<br />Legion hoping his new found immortality could help if war was going to\r<br />happen.\r<br />\r<br />On the 4E 171 the Empire and the Aldmeri Dominion declared war. Cassius\r<br />was assigned to Leyawiin but shortly after that the city fell. He defended\r<br />Bravil before it fell to. He was sent off to Hammerfell. Him and other \r<br />Imperial troops are forced to retreat across the Alik&#39;r Desert.\r<br />4E 174 the year the Imperial city is ransacked by the Almderi Dominion.\r<br />Cassius over the last 3 years had seen horros beyond his wildest dreams\r<br />and to this day he doe not talk about what happened between 4E 171 and\r<br />4E 174.\r<br />\r<br />One year later on 4E 175 The Battle Of The Red Ring takes place and results\r<br />in a complete victory for the Empire. Cassius was fighting alongside \r<br />Emperor Titus Mede II.\r<br />Cassius was shocked to learn that the White-Gold Concordat was being signed\r<br />and very shortly after it was he went to the northen most reach on Skyrim \r<br />and settled there until he heard about Hammerfell leaving the Empire and\r<br />fighting the Aldmeri Dominion.\r<br />\r<br />When 4E 176 rolls around Cassius had travelled all of Tamriel 3 times in\r<br />his entire life and he was only 36 but he still looked as if he was in his\r<br />early 20&#39;s. He left Hammerfell after the Aldmeri Dominion lost nearly a third\r<br />of their invasion force. He moved to Balmora in Vvardenfell and lived there\r<br />\r<br />On 4E 201 Cassius heard that Ulfric Stormcloak killed the High king of \r<br />Skyrim and sent the land into a civil war. Cassius decided he would help\r<br />the Empire free Skyrim from this conflict so he set off to Skyrim. As \r<br />soon as he arrived in Skyrim he set off to Solitude and re-joined the \r<br />Imperial Legion and fought the Stormcloaks until he was badly injured\r<br />in the war. He decided he was going to leave the war alone as it was a\r<br />loast cause. A few weeks later he heard of a attack on Helgen and when \r<br />he learned who was responseable he didn&#39;t believe it. Then he heard \r<br />whispers of The Dragonborn returning which he didn&#39;t beleive either until\r<br />he met him....",
  "categoryId": "66",
  "version": "",
  "author": "Me and my mate Tom",
  "createdUnix": "1398180652",
  "updatedUnix": "1398180648",
  "containsAdultContent": false,
  "uploadedBy": "simonthekid10",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106097",
      "name": "Casius Varon V1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Casius Varon V1-53279-1-0.rar",
      "uploadedUnix": "1398180648",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f13badc25d96801636d76b523e7b550a0e59919a6bb419ae101991f29e6d3a36/analysis/1408035065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Casius%20Varon%20V1-53279-1-0.rar?fid=1000106097&ttl=1535836766&ri=8192&rs=8192&setec=9673243207a4371b146606a117ab587b"
    }
  ]
}