{
  "modId": 5334.0,
  "modName": "Yalles Ultimate Hybrid-Pitch Black Nights and dungeons-Ultim",
  "summary": "The whole new way of looking at the game!! \r\nPitch Black Nights and dungeons-Ultimate Light!\r\npls bring a torch :)",
  "descriptionHtml": "Hi ppl \r\nThis is my first file sent on Nexus.I don\\'t have any modding experience but I have enough computer knowledge to edit ENB and FXAA to suit my needs.I have tried every single FXAA and ENB on the site and after a lot of trying, testing, deleting I have decided that I cant go on like that.So I began to edit one that will be the best for me.I don\\'t take any credit for making the dll\\'s,filters etc...My role was just editing the settings and tweaking them to suite my needs.I would like to say thank you to Boris Vorontsov for making ENB and to some dude who made FXAA, without you we would not have such rich and colorful skyrim!U are inspiration to us all :)\r\n\r\nNow back to the file:\r\nI have spend last 2 days editing and I came up with this.I have tested it in city\\'s, forest, dungeons, day, night and any other environment i cod think of.In this post u will find some screen shoots I will probably post more,in game is a bit(small bit) darker then the actual screen shoots don\\'t know why.I have managed to bring natural darkness in to the dungeons of skyrim , u will also noticed that exploring without a torch is a tough choice.\r\n\r\nFutures\r\n-Warm colors (a bit saturated atm but I\\'m working on a solution)\r\n-Bright day light \r\n-Dark Night\r\n-Dark dungeons \r\n-Light from torches and other sources has been re tweaked so it glows with warm orange color\r\n-Sharper edge \r\n-Camera lens effect from light sources\r\n-Small touch of a bloom \r\n\r\nI really don\\'t know how big impact this is to the performance so if u have low-mid range PC \r\ndon\\'t download it.I have used a lot of mods from this site for making thous screen shoots.My skyrim is 12gb big :) in any case u can say I\\'m mod junkie.\r\nIf u are not getting the same results try fallowing:\r\nSTEP - Skyrim Total Enhancement Project by TheCompiler its a great guide and a lot of work has been put in to it.Great work dude!!\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=11\r\n\r\nWhen u extract the files put them in main skyrim dir(where exe is)\r\nPls delete any other FXAA and ENB if u are using one.\r\nSSAO is off atm but u can turn it on by opening enbseries.ini and finding a line:\r\nEnableAmbientOcclusion=false and then edit it to true but u will have some problems with water so I don\\'t recommend it.\r\nThere is still some problem with this(small one) but I\\'m perfectionist so it bugs me.\r\nWater is a bit strange, especial at night because it glows lol(not a lot but its not dark as it should be) If some1 knows the solution to the problem pls let me know u will save me a lot of time.Fell free to edit it if know how,if u can make it even beater that would be great , just let me know what changes did u make so I can test them on my rig.I hope I did not forgot something. If u have any question post it and I will answer u as soon as I can.\r\n\r\nMy spec are :\r\nASUS P8P67-B3\r\nIntel i5 2500k\r\nMSI Nvidia Gforce GTX 560\r\nKingston 4gb 1600mhz\r\nSamsung Syncmaster 2243nw calibrated \r\n\r\nP.s I have included a optional config for even more darker nights and dungeons \r\n\r\nP.s.s Atm I there is no option to comment on the file I don\\'t know why but I will try to fix it as soon as I can.So if u have any suggestions or questions pls pm me directly because I want your opinion so I can make it even beater.\r\n\r\nafter some testing i have noticed that night eye power does not work properly(bloody irony).I will do some more testing and hopefully I will find a solution to the problem.\r\n\r\n[b]NEW VERSION AVAIBLE WITH FIXED EVERY ISSUE!!!![/b]\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=5396",
  "categoryId": "62",
  "version": "",
  "author": "Yalle",
  "createdUnix": "1325707054",
  "updatedUnix": "1325708114",
  "containsAdultContent": false,
  "uploadedBy": "Yalle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "16627",
      "name": "Yalles Ultimate Hybrid-Pitch Black Nights and dungeons",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2728",
      "fileName": "Yalles Ultimate Hybrid-Pitch Black Nights and dungeons-5334.rar",
      "uploadedUnix": "1325707560",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ed901e10872e8016e7187161fcf0fded3d1486d8cdf22212e35092999c0d5549/analysis/1406582682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yalles%20Ultimate%20Hybrid-Pitch%20Black%20Nights%20and%20dungeons-5334.rar?fid=16627&ttl=1535761975&ri=8192&rs=8192&setec=2a8add991a060fbad05fb0c896c23c46"
    },
    {
      "fileId": "16629",
      "name": "Even Darker",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Even Darker-5334-1.rar",
      "uploadedUnix": "1325708114",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5cf5417db3b63721d1cc87689015318cfee11efa5813b005f1be8abbacffa295/analysis/1406582733/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Even%20Darker-5334-1.rar?fid=16629&ttl=1535761976&ri=8192&rs=8192&setec=5f4c2ba1def01961c47b87aab769467e"
    }
  ]
}