{
  "modId": 53365.0,
  "modName": "Jaxonz Archery Focus",
  "summary": "Simply shifts camera to first person when you pull the bowstring.",
  "descriptionHtml": "[color=yellow][b]This mod has been superceded by [url=../61431]Jaxonz Archery Util[/url].[/b][/color]\r<br />I do not intend to continue updates.\r<br />\r<br />[color=red]Now also available in a [b]bloated flavor[/b] with all requested features added&#33;[/color]\r<br />\r<br />[center][size=6][color=#F5C908][b]Improved Aiming[/b][/color][/size]\r<br />[size=4]Shifts your perspective to first person when you pull the bowstring.[/size][/center] \r<br />\r<br />This is by far the simplest mod I&#39;ve ever written. It does only one thing (see above).\r<br />\r<br />I like to run around in third person view or use Immersive First Person View (which is a great mod... you should check it out), but feel that I cannot aim as well as in true FPV. So... I wrote a few lines of code to fix this.\r<br />\r<br />And, by &#34;a few&#34; I mean to say exactly 7 lines of code. Really&#33; Don&#39;t believe me? Look, here is the actual source code:\r<br />[code]\r<br />Scriptname JaxonzArcheryFocus extends Quest\r<br />{change focus to first person on bow draw} ;this line is a comment, it doesn&#39;t count as code&#33;\r<br />\r<br />Event OnInit()\r<br />     RegisterForActorAction(5)\t   ;register for Bow Draw\r<br />EndEvent\r<br />\r<br />Event OnActorAction(int actionType, Actor akActor, Form source, int slot)\r<br />     Game.ForceFirstPerson()\r<br />EndEvent\r<br />[/code]\r<br />That&#39;s all there is to it. (And really, there&#39;s only 2 lines that really do anything, the RegisterForActorAction and ForceFirstPerson.)\r<br />[heading]Languages Supported[/heading]\r<br />[list]\r<br />[*]All\r<br />[*]Because there is no text output\r<br />[*](see code above... no text)\r<br />[/list]\r<br />[heading]Requirements[/heading]\r<br />[list]\r<br />[*][url=http://skse.silverlock.org]SKSE 1.6+[/url]\r<br />(The RegiserForActorAction function comes from that savior of all Skyrim modders. Pretty much if you want to do anything at all cool, you really need SKSE.)\r<br />[/list]\r<br />[color=#F5C908][heading]Compatibility[/heading][/color]\r<br />[list]\r<br />[*]100% compatible with every other mod on the planet.\r<br />[*]Fully compatible with DLC and 3rd party mods.\r<br />[*]Not known to conflict with any other mod. Any load order works.\r<br />[*]The above statements are entirely redundant, but you get the idea.\r<br />[/list]\r<br />[color=#F5C908][heading]Frequently Asked Questions[/heading][/color]\r<br />OK, well no one has actually asked these questions, but from vast experience I can pretty much predict what they will be, so why not be a little preemtive?\r<br />\r<br />Q. Isnt there already a mod that does this?\r<br />A. Yes, I did did a quick search and did notice one. However, it switched views whenever the weapon was drawn, which isn&#39;t quite what I wanted. Besides, this was really fast and easy to code up (see the code above). It took much less time to code, get working and debug than it has taken to write this description, much less upload the mod for others.\r<br />\r<br />Q. Does it always switch to first person?\r<br />A. In my experience, yes. It does so reliably. There are no If statements or other conditionals (see the actual source code above) that would cause it to do otherwise.\r<br />\r<br />Q. Will it change my perspective back when I&#39;m finished shooting?\r<br />A. Nope. See the code (above)? There is no code to accomplish that, so you will stay in first person view once switched unless you or someone else switches you back out.\r<br />\r<br />Q. Will it work with crossbows?\r<br />A. Yep. In fact, it should work with any projectile weapon that you have to hold the aim and then release before firing.\r<br />\r<br />Q. Is it compatible with DLC and third party mods?\r<br />A. Yes. It should be compatible with all projectile weapons (see above) and all mods (see Compatibility above).\r<br />\r<br />Q. Can you make it so that it doesn&#39;t ALWAYS switch to first person?\r<br />Q. Can you add feature XYZ to this mod?\r<br />Q. Hey, I have a fantastic idea for another mod&#33; Can you make it?\r<br />Q. Can you make it work for staves, aimed spells, melee weapons, and my favorite mod?\r<br />A. Absolutely&#33;&#33;&#33;\r<br />And by &#34;absolutely&#34;, I mean that I could absolutely make any of those changes. However, this mod already does exactly what I want. I&#39;m not inclined to change it to suit your needs. So, in this case &#34;absolutely&#34; means &#34;no&#34;.\r<br />Hopefully, by posting the 7 (arguably 2) lines of source code (see above) I am demonstrating how pitifully easy it is to modify Skyrim. Say, isn&#39;t this a fantastic opportunity for you (yes, YOU) to try your hand at modding? All you have to do is download the FREE Creation Kit, throw this mod into it and make the changes you want. If you can spend hours playing or searching for and installing mods, then you too have the skill set to actually be a modder&#33; There are tons of modders&#39; resources out there: wikis, forums, tutorial videos, etc. to help get you started and pull you through rough spots in the learning curve. (OK, probably not literally &#39;tons&#39; since most of these electronic resources don&#39;t actually weigh anything... although arguably the people providing them for free cumulatively weigh quite a few tons. [This is not intended to insult modders, implying that they are overweight, although I could certainly stand to loose a few pounds. (That was my attempt at self-deprecating humor to prove my noble intent. (And, I know these parenthesis and brackets are nested. Best you get used to it if you&#39;re going to be a modder.))]) (Just make sure the brackets balance or you&#39;re screwed.)\r<br />\r<br />Q. Why is it version 1000.0?\r<br />A. That&#39;s my way of saying that this is the first and last release of this particular mod. (Won&#39;t it be embarrassing if I have to post a patch for this? Stay tuned... Experience tells me this is bound to happen.)\r<br />A. Version 1001 is now available thanks to everyone whining about bugs and new features. Sheesh&#33; (Hate it when I&#39;m right.)\r<br />\r<br />Q. Will this mod be compatible with XYZ?\r<br />A. In case you missed the COMPATIBILITY statement above (see above), then Yes, this very simple mod should be compatible with EVERYTHING.\r<br />Load order should make absolutely no difference with respect to this mod.\r<br />If you have another mod that attempts to do something similar, they may struggle for control a bit. This mod with just 7 (or arguably 2) lines of code may execute faster. In that case, I&#39;m guessing the slow, bloated inferior competing mod will actually win out (last command issued wins). (Couch potatoes rejoice&#33; Slow and inferior wins&#33;&#33;)\r<br />\r<br />Q. Can you help me get this to work?\r<br />Q. Can you help me install SKSE?\r<br />A. Just do a web search. This has been asked and answered 10^9 times.\r<br />\r<br />Q. Do you provide technical support?\r<br />A. I do my best, but you get what you pay for and this is free, right?\r<br />If you need technical support, I suggest you just remove this mod altogether or never install it in the first place. In the grand scheme of things, it is only saving the one keystroke it takes to switch to first person view.\r<br />Please do post a note if you find a bug. Indicate the line of source code causing it. Post a screen shot, video, mod load order, log files, AND photos of your cat. (Someone else&#39;s cat will do if you don&#39;t have one handy.) Someone will get back to you... eventually.\r<br />\r<br />Q. FANTASTIC MOD&#33; Can I do a translation?&#33;\r<br />A. You&#39;re so kind. There&#39;s actually nothing whatsoever to translate, other than this description, but please be my guest. I would imagine that my poor attempts at humor here will be even more painful in another language. I take no responsibility for harm it may cause.\r<br />\r<br />Q. Why are you so snarky?\r<br />A. I&#39;m just in one of those moods, especially when I realize that posting and supporting mods is 10x the effort to actually create them.\r<br />\r<br />Q. Well, you come off as bitter.\r<br />A. That wasn&#39;t my intent... and that wasn&#39;t structured as a question.\r<br />\r<br />Q. You pedantic b*&#33; Why are you so bitter?&#33;\r<br />A. That&#39;s better (structured as a question for the FAQ)&#33; I&#39;m really not bitter... just having a bit of fun here (see above). But seriously, wouldn&#39;t the world be an amazingly better place if we all became modders, hackers, makers, and do-ers?&#33;\r<br />\r<br />Check out [url=http://www.nexusmods.com/skyrim/users/10674107/?tb=mods]Other Great Mods[/url] from Jaxonz\r<br />\r<br />All Jaxonz mods are professionally coded for stability and high quality.",
  "categoryId": "77",
  "version": "1001",
  "author": "Jaxonz",
  "createdUnix": "1398354839",
  "updatedUnix": "1418609538",
  "containsAdultContent": false,
  "uploadedBy": "jaxonz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106379",
      "name": "Jaxonz Archery Focus",
      "version": "1000.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Jaxonz Archery Focus-53365-1000-0.zip",
      "uploadedUnix": "1398354009",
      "modVersion": "1000.0",
      "virusScanUrl": "https://www.virustotal.com/file/73fb062c6e6888f423b12b8dd435f28092075b1a5a3e3fd19f713255304b397d/analysis/1408038807/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jaxonz%20Archery%20Focus-53365-1000-0.zip?fid=1000106379&ttl=1535836872&ri=8192&rs=8192&setec=5ff7ab7f2096d1bcfb5166ea2ff32649"
    },
    {
      "fileId": "1000138896",
      "name": "Jaxonz Archery Focus",
      "version": "1001",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Jaxonz Archery Focus-53365-1001.zip",
      "uploadedUnix": "1418609538",
      "modVersion": "1001",
      "virusScanUrl": "https://www.virustotal.com/file/326ef385e0e83047526ea34f47fd65b952f59b46337b5ae1a75d08807ef4aaf6/analysis/1418609582/",
      "changelogHtml": " OK, OK... enough people asked that I implemented a new version which fixes all the bugs (exactly 1, since SKSE changed to fire the bowstring pull for all players... not my fault, really&#33;), and implements requested features, such as an MCM menu, a hotkey to enable/disable, and I even threw in some help info and SKSE and SkyUI diagnostics to boot.\r<br />\r<br />Of course this adds about 100% more code (and undoubtedly there will be a bug in there somewhere).\r<br />\r<br />Feel free to use whichever version strikes your fancy. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jaxonz%20Archery%20Focus-53365-1001.zip?fid=1000138896&ttl=1535836872&ri=8192&rs=8192&setec=6756d63f3bd4afca576e4d865330eb9f"
    }
  ]
}