{
  "modId": 53416.0,
  "modName": "Breezefarm your Breezehome away from home",
  "summary": "Starter house, based on Breezehome template, but located in the fields outside Whiterun. Minimalistic and clean design, focused in open-spaced areas, minimum clutter, lots of containers, and balanced lighting.",
  "descriptionHtml": "Breezefarm is a starter player-house, located across the road from the Khajit encampment just outside the exterior doors of Whiterun. It’s based on the structure of Breezehome, but the interior design it’s been improved to maximize the usable space, to make easier to walk around the house, without bumping every three steps with a chair, or kicking off every vase/pot/cup as soon as you get close to a table.\r<br />\r<br />The idea was a to have a simple, small but “have it all in one place” house, with lots of containers, using only resources from main Skyrim.esm.\r<br />\r<br />So these are the main features:\r<br />- Balanced lighting: dark enough for an interior so candles are still noticed, but bright enough so you don’t need a torch or night eye to see the details in objects or decoration\r<br />- Movable clutter almost entirely replaced by static alternatives\r<br />- Non respawnable containers: 34 chest (basement), barrels, sacks, drawers, 1 large bookcase, 5 containers for alchemy, 4 containers for enchanting. See pictures.\r<br />- Alchemy and enchanting table\r<br />- Open basement (no load screen), regular size. \r<br />- Smelter, Grindstone, Tanning Rack, Workbench, woodcutting block. All in basement\r<br />- Anvil (not forge) with same effect as Skyforge, also in basement\r<br />- Main bed and 3 additional beds, for as many companions\r<br />- Fully navmeshed and idle marked, for companions\r<br />\r<br />What Breezefarm doesn’t have:\r<br />- Interactive bookcases: I don’t like them, if you have less than the maximum quantity of books the ones you add tend to fall, if you have more than the max amount you can’t store them all, it doesn’t work for showing off your precious/valuable pieces since all you see is the spine.\r<br />- Weapon/shields racks: these I like, but I have another building (showroom, warehouse type) in which I display them, more than 100 of them ;)  \r<br />- Farm animals or facilities. I know the name is “Breezefarm” but it was initially intended to be an inside-city-house until I realized there was no more room to get it to fit inside Whiterun\r<br />- Heartfire DLC support: I designed it with Heartfire in mind, until I understood the complexity involved in making it compatible\r<br />- Luxury/extravagant amenities: It doesn’t have a pool, sauna, not even a bath; neither porch, nor balcony nor terrace; it doesn’t have a bar, wine cellar, gold mine or Daedra shrine\r<br />- NPC: Only you and your companions will be inside\r<br />- Weapons (all weapons seen in the pictures are decorative/static), armor, clothes (except whatever you may find in the non respawnable drawers/chests)\r<br />- Large amounts of resources (ingots, alchemy ingredients, food) or money\r<br />\r<br />Installation\r<br />It’s a simple .esp file, just unzip it into your DATA folder and enable it in your load order together with you other house mods and give it a roll. \r<br />\r<br />Compatibility\r<br />Not compatible with: Heartfire DLC or any mods using the same exterior space. Everything else should be fine.\r<br />\r<br />Note: I tried to make the stairs to work properly but I’m not sure I get them alright, if somebody can give me precise instructions on how to fix them I’d appreciate it. (I’ve read descriptions in mods that fix them, but I can’t find any explanation on how they did it).\r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "maxgnc",
  "createdUnix": "1398480038",
  "updatedUnix": "1398477265",
  "containsAdultContent": false,
  "uploadedBy": "maxgnc",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106599",
      "name": "Breezefarm",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53",
      "fileName": "Breezefarm-53416-1-0.zip",
      "uploadedUnix": "1398477265",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c41a22ebcfd328e8594fa67472b7782563f5c3667b9fe6f419c602a72b0b0078/analysis/1408041561/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezefarm-53416-1-0.zip?fid=1000106599&ttl=1535836963&ri=8192&rs=8192&setec=5c602a55d5d00640ac9263dc48547088"
    }
  ]
}