{
  "modId": 53430.0,
  "modName": "True Stealth Sniping",
  "summary": "Add a standalone slightly overpowered bow, and an almost useless arrow that is only good for speed.",
  "descriptionHtml": "This is my first mod and I thought it is pretty fun to use so I decided to share it. Used Auriel&#39;s bow and Sunhallowed Arrows so DAWNGUARD IS REQUIRED.\r<br />\r<br />RECOMMEND: Use this with CryRim - Realistic Force and Physics for overkill fun.\r<br />http://www.nexusmods.com/skyrim/mods/51222/?\r<br />\r<br />Ever wondered why silent sniping is so hard in skyrim?\r<br />Here&#39;s Why:\r<br />1. The damage of your bow and arrow is too low to snipe high level enemies.\r<br />2 Arrows travel too slow and you failed to predict enemy movements.\r<br />3. Any hostile actions done even when you were supposed to be in stealth can alarm the enemy.\r<br />\r<br />This Mod aim to help you to be a true sniper in Skyrim.\r<br />The Peace Arrow will hit your target instantly without mistake.\r<br />The Peace Maker Bow will strike your target down before they know what hits them.\r<br />\r<br />**Currently no one would attack you even if you kill their allies right in front of them. e.g you can shoot dozens of arrows into Ulfric in Windhelm and nobody would bat an eye. If killing without consequence is what you are looking for, here&#39;s the bow and arrow for you.\r<br />\r<br />Note:\r<br />The bow will take sometime for you to pull the string but it does ridiculous damage. Of course you want to one shot all your targets while sniping. \r<br />The arrow hit instantly but offers 0 damage, and because of this, your projectile will not alarm your enemies while you snipe in peace.\r<br />\r<br />*****To get the bow and arrow, simply type : &#34;help peace&#34; in your console command add them accordingly.\r<br />\r<br />Endorse if you like this&#33;",
  "categoryId": "55",
  "version": "0.1",
  "author": "NovaSe7en",
  "createdUnix": "1398513186",
  "updatedUnix": "1398513180",
  "containsAdultContent": false,
  "uploadedBy": "novaqh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106667",
      "name": "Auriel is too stingy",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Auriel is too stingy-53430-0-1.rar",
      "uploadedUnix": "1398513180",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7252e5cb761820f4e685e628dc4adf7a31cb0673a6d4bd95e2be2d3addaac79b/analysis/1408042216/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Auriel%20is%20too%20stingy-53430-0-1.rar?fid=1000106667&ttl=1535836978&ri=8192&rs=8192&setec=231118db008b89ec7a58eed41f0ac60b"
    }
  ]
}