{
  "modId": 53439.0,
  "modName": "Konahrik Dovahsebrom",
  "summary": "Just another strong Nord man for your adventures",
  "descriptionHtml": "Game:Skyrim\r<br />Mod Name:Konahrik Dovahsebrom Follower\r<br />Version:1.0\r<br />Contact Info: &#34;Did I ever tell you the definition of insanity?&#34;\r<br />Author(s):L0st-D4md\r<br />\r<br />[b][u] In order to get Konahrik how he looks in the screenshots, you would need: [/b][/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/8772/?]Actualize Apparel[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17664/?]Daedric Lord Armour[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10123/?]Daedric Mask[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/21844/?]Armour of Tiber Septim[/url]\r<br />\r<br />[b][u] I will try to include the above mods stand alone in a future update :) [/b][/u]\r<br />\r<br />Description:This is a small time follower mod of my long time player charcater, Konahrik Dovahsebrom. I made this on request of a few special friends but I&#39;m still releasing it to the public for those who just want an extra follower, or is sexually attracted to the sight of a strong Nord male.\r<br />Although I&#39;m a Mod user myself, Konahrik&#39;s face was entirely created on vanilla assets and even though I have used mods for armour and clothing, I also used vanilla assets for Konahrik&#39;s default armour in this initial release.\r<br />\r<br />In short, this mod is entirely vanilla, only requiring base game + latest patch. No Mods or DLC. Yes, the screenshots I&#39;m using here do show Konahrik in modded dress, I&#39;ll provide links to the respective mods until I get around to a stand alone port.\r<br />\r<br />I have participated in Elder Scrolls RP as Konahrik and he has his own backstory, personal agenda and basic depth. Yet for the sake of simplicity in this mod, he is just a simple follower who does just about as much as Lydia.\r<br />Still, I have some interesting things to note:\r<br />\r<br />[img] http://i.imgur.com/hye8cGD.jpg [/img]\r<br />\r<br />&gt; Konahrik has been married through Roleplaying, but he is marriageable in-game like most custom companions. You know who you are and please don&#39;t message me on Facebook at 1am gloating to me about what happens in your erotic fantasies\r<br />\r<br />&gt; Konahrik is intialy located in the Dragonsreach main hall and will return there upon dismissal\r<br />\r<br />&gt; Konahrik does come with a set of armour and a weapon, but for now its just an upgraded set of Ebony with a Skyforge sword. This will be updated to something more signature later\r<br />\r<br />&gt; Konahrik&#39;s face was tweaked entirely with vanilla FaceGen with no anime hair, corpse paint, Elf faces or hypersexualized body mods. This mod was actually fixed for grey face bug.\r<br />\r<br />&gt; While I don&#39;t use body mods personally, what you fangirls or bisexual friends of mine do is not my concern ;)\r<br />\r<br />&gt; Konahrik levels up with the player evenly from level 29 to level 150\r<br />\r<br />&gt; His stats and class favour a sword and shield style. He fights with the same combat style as Lydia. (I may change that?)\r<br />\r<br />&gt; No, I will not do a custom voice. Don&#39;t take the &#39;Farkas&#39; voice too seriously. It was a fair comprimise over how I imagine my character. Also I am a terrible voice actor.\r<br />\r<br />\r<br />So that&#39;s basically it. If you actually liked this mod, please give me feedback, Endorse, etc and that may just give me extra motivation to elaborate on a future release :)\r<br />\r<br />\r<br />[youtube] https://www.youtube.com/watch?v=ba0K-4D1Lj0 [/youtube]\r<br />\r<br />Installation:Like any other mod. Extract the contents into your Skyrim root folder. Of course, most people would just use NMM for this stuff :3\r<br />\r<br />Uninstallation:Either delete the files manually, or deactive in NMM. I&#39;m not responsible for your file organization XD\r<br />\r<br />Change Log:Initial release\r<br />\r<br />Future Updates:\r<br />&gt;Modded armour, weapons, clothing\r<br />&gt;Explaining more about his backstory (Lore, not in-game)\r<br />\r<br />Special Thanks To:\r<br />\r<br />&gt;Ulbert\r<br />&gt;Theo\r<br />&gt;Abbykins\r<br />&gt;Ari\r<br />&gt;Arianna\r<br />&gt;Aza-ROL\r<br />&gt;Daihearta\r<br />&gt;Kirsty\r<br />&gt;Renji\r<br />&gt;Gudlin\r<br />&gt;Vivec\r<br />&gt;Talos\r<br />&gt;Heimskr\r<br />&gt;Amaya\r<br />&gt;Kharjo\r<br />&gt;Brynjolf\r<br />(You know who you all are and I love you.)\r<br />\r<br />NO Thanks To:\r<br />\r<br />Eric\r<br />Eddard\r<br />Bitchis\r<br />Titus\r<br />Oraza\r<br />Helkan\r<br />Audrey\r<br />(I&#39;m serious, I fucking hate you with every vein in my heart&#33;)",
  "categoryId": "66",
  "version": "1.0",
  "author": "L0st-D4md",
  "createdUnix": "1398521340",
  "updatedUnix": "1398521243",
  "containsAdultContent": false,
  "uploadedBy": "pa1ad1n",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106708",
      "name": "Konahrik",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "179",
      "fileName": "Konahrik-53439-1-0.rar",
      "uploadedUnix": "1398521243",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/91431c4bf9173a49e472cbe07312d489f1c8a918901d9d7600fddb764131efdf/analysis/1408042404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Konahrik-53439-1-0.rar?fid=1000106708&ttl=1535836993&ri=8192&rs=8192&setec=35c1a10fdea361d95db3627621a8d3a6"
    }
  ]
}