{
  "modId": 53482.0,
  "modName": "Cosmopolitan Solitude",
  "summary": "Places five vendors - an Imperial, Orc, a Dunmer, and two Argonians - in Solitude. Two of them sell unique beverages. ",
  "descriptionHtml": "The supposedly cosmopolitan capital of Solitude (well, at least, I got the impression that it&#39;s supposed to be cosmopolitan) isn&#39;t that cosmopolitan in-game. This mod rectifies it by adding five vendors to the city. They don&#39;t have any unique dialogue, but four of them carry advertisements you can buy, which provide a minimum backstory for them.  \r<br />\r<br />Meralyn Telendas, a Dunmer, is the wife of the Imperial legate in Winterhold camp. She knows some techniques the Telvanni use in creating their Bug Musk, and sells her own imitation. \r<br />\r<br />Raises-Her-Spirits is an Argonian who sells special wine from the Black Marsh.\r<br />\r<br />They spend their time in the Blue Palace and in the Winking Skeever respectively from 20:00 to 8:00, they walk around the city from 8:00 to 13:00, and they stand in marketplace from 13:00 to 20:00. They will retreat to the Blue Palace when Solitude is under siege during the Civil War. \r<br />\r<br />Khargol gro-Burish is an Orcish dignitary in the Blue Palace. He always stays in the palace and sells Orcish armor. \r<br />\r<br />Antonina Liberia is the Imperial librarian at the Bards College. She sells an assortment of some relatively rare books. Since the College is a big building, she has hired an Argonian assistant, Ruleen-Shei, in order for her bookselling business to be easier to find. They usually stay in the College, though Antonina sometimes takes a stroll in the city.\r<br />\r<br />All the vendors sell their wares from 6:00 to 22:00. ",
  "categoryId": "33",
  "version": "1.5",
  "author": "LoneWolfEburg",
  "createdUnix": "1398556152",
  "updatedUnix": "1404840836",
  "containsAdultContent": false,
  "uploadedBy": "LoneWolfEburg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116546",
      "name": "Cosmopolitan Solitude",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "717",
      "fileName": "1.5-53482-1-5.rar",
      "uploadedUnix": "1404840836",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/f06bdf60c69c2361ecc212b6bb46aa4f6aeebd86045c57df5c1f87e39082dcc9/analysis/1408168753/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1.5-53482-1-5.rar?fid=1000116546&ttl=1535837053&ri=8192&rs=8192&setec=834daf7fb135bd3158400c52523f2b32"
    }
  ]
}