{
  "modId": 53499.0,
  "modName": "More Dynamic Injuries - English",
  "summary": "The Original Poster Of This Mod Has Removed This Mod From Nexus. Ive Reposted It To Try And Allow People To Get This Mod That Are Interested In It.\r<br />\r<br />Thomas Kaira - Original Mod Creator",
  "descriptionHtml": "Permissions Given By Original Mod Creator\r<br />\r<br />- You are free to alter, expand on, or destroy this mod in any way you see fit. If you wish to share your work, however, you MUST contact me and obtain my explicit permission before doing so. Any instances of severe mod destruction will not be eligible for technical support until restored to a functional state.\r<br />\r<br />- Any works that are found to be in breach of the above, the author will receive a single polite request from me to remove it from wherever it is being hosted (from all sites it is being hosted on). Failure to respond within 48 hours will result in more direct action being taken.\r<br />\r<br />- DO NOT upload this mod to any site other than those I have personally uploaded it to without my express permission given. Any user or site found in violation of this will be considered to be stealing intellectual property and will be treated as such. Just because this mod is free does not mean that gives you free reign over what you can do with it. My work, my rules.\r<br />\r<br />- If I fail to respond to your requests to expand or alter this mod within 30 days, you may consider yourself as having my approval to do as you wish, but please note that upload location restrictions still stand.\r<br />\r<br />- Translators: please simply PM me if you wish to translate this mod. If you wish to upload the translated version to one of my current mirrors, you may consider my answer to be “yes” outright. If you wish to upload elsewhere, though, you must obtain my permission to do so. All I wish to know is that the mod is being translated, and anyone who wishes to do so has my approval.\r<br />",
  "categoryId": "28",
  "version": "1.1.6",
  "author": "Prolix",
  "createdUnix": "1398590837",
  "updatedUnix": "1398591173",
  "containsAdultContent": false,
  "uploadedBy": "OfficialG8R",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106845",
      "name": "MDI 116",
      "version": "1.1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "101",
      "fileName": "MDI 116-53499-1-1-6.7z",
      "uploadedUnix": "1398591173",
      "modVersion": "1.1.6",
      "virusScanUrl": "https://www.virustotal.com/file/86eb10ab31d964cd6aefeba16e009885a5c26e7ed5a2cc4afed09becbc014ef8/analysis/1408043883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MDI%20116-53499-1-1-6.7z?fid=1000106845&ttl=1535837078&ri=8192&rs=8192&setec=c0f743830799fdd2275022ce40cb0dae"
    }
  ]
}