{
  "modId": 53495.0,
  "modName": "Coffee and Water in Inns and Other Places",
  "summary": "",
  "descriptionHtml": "This is a fairly simple mod. I wanted a drink in Skyrim, but I avoid alcohol, so I figured it would be nice to have coffee. Imp&#39;s More Complex Needs by Imp of the Perverse is a mod which adds nutritional values to foods and drinks, and adds coffee, tea and other consumable items. I&#39;ve used it for months, but I finally decided it was too much, and I just wanted coffee. Very simple. So I added mugs of coffee, pots of coffee, coffee beans, water, and cooking recipes for coffee to Skyrim with this mod. \r<br />\r<br />Coffee beans can always be bought from Khajiit caravans, and you will often find innkeepers selling it as well. Mugs of coffee and pots of coffee can often be found in inns as well. Water seems to pop up all over the place, for instance in bandit dungeons (they might get thirsty occasionally), and will nearly always appear in inns. If an inn does not sell ready-made coffee, you can buy the water and beans from them, and brew the coffee yourself, if you have a kitchen nearby. \r<br />",
  "categoryId": "78",
  "version": "1.2",
  "author": "MysteryMan3",
  "createdUnix": "1398581311",
  "updatedUnix": "1398581306",
  "containsAdultContent": false,
  "uploadedBy": "MysteryMan3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106837",
      "name": "Coffee and Water in Inns and Other Places",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Coffee and Water in Inns and Other Places-53495-1-2.zip",
      "uploadedUnix": "1398581306",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/adc9a406bf935a8102460465a9fda21dbd7ba56a70d426a35eab5618bb0dd537/analysis/1408043832/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Coffee%20and%20Water%20in%20Inns%20and%20Other%20Places-53495-1-2.zip?fid=1000106837&ttl=1535837073&ri=8192&rs=8192&setec=0b300e7869562ca4ccc7899876fde3a7"
    }
  ]
}