{
  "modId": 5353.0,
  "modName": "BARNDOG WEREWOLF IMPROVE",
  "summary": "WEREWOLF TOGGLE & IMPROVE\r\nImproves Regen, Unarmed Damage, Most Wolves & Werewolves Do Not Attack, Transformation Time is Extended Dramatically.",
  "descriptionHtml": "Forget this mod guys everything here has been achieved without having to use console commands, \r\nJust look up:\r\nLFox Werewolf improvement mod\r\nAnd tweak it with:\r\nSkyedit\r\n\r\nCheers\r\n\r\nFirst Attempt\r\n When the CK comes out will set it up with hot keys and know console commands cheers\r\n\r\nI love the werewolves in this game: they look awesome, they\\'re fun to play but they are too weak too be playable as you get to \r\nhigher levels. \r\nThis frustrated me and I didn\\'t feel it was werewolf lore friendly in or out of the game.\r\n\r\n\r\n\r\nWEREWOLF TOGGLE\r\n\r\n\r\n\r\n*Spoiler Alert*\r\n\r\nMost players will gain their werewolf ability from the companions who have supposedly mastered their bestial nature. \r\nTo me this would suggest the ability to summon this form at will and return to normal as you see fit. \r\nSo here are a couple of commands to turn into a werewolf at will!\r\n\r\n\r\n\r\nWerewolf On\r\n\r\nGo Into Console commands with Tilde Key (~)\r\n\r\nType \\'bat WWon\\' and press enter\r\n\r\nReturn to gameplay and your transformation will commence!\r\n\r\n\r\n\r\nWerewolf Off\r\n\r\nGo Into Console commands with Tilde Key (~)\r\n\r\nType \\'bat WWoff\\' and press enter \r\n\r\nReturn to gamplay and you will begin to shift back!\r\n\r\n\r\n\r\nWEREWOLF IMPROVE\r\n\r\n\r\n\r\nYou are more than an ordinary werewolf - you have the soul of a dragon! The werewolves I\\'ve come to know and love over the years are\r\nunstoppable raging beasts who can barely be wounded by anything bar silver as you watch their wounds close in front of you terrified \r\nbecause you know they can be on you in an instant with monstorus strength to tear your head from your shoulders. \r\nEven in human form they are stronger than ordinary men, faster able to heal quicker. \r\nOther wolves can smell your canis pheromones and know to generally keep clear because of the power you exude! \r\nYou are also a companion and have mastered your bestial form and can now mainatiain it for almost an infinite amount of time.\r\n\r\n\r\n\r\nFor all the effects of these improves to be persistent the following commands must be entered AFTER you have completed transformation\r\nto human or werewolf. \r\nThis does mean you can chose to imrpove the werewolf form only if you like.\r\n\r\n\r\n\r\nMan Form Improve\r\n \r\nAFTER turning back human Go Into Console commands with Tilde Key (~)\r\n\r\nType \\'bat barndog\\' and press enter\r\n\r\nWhen you return to gameplay you will be slightly faster.\r\n\r\nYou will heal quicker, about 1/2 again as fast.\r\n\r\nYou will do 50 extra unarmed damage as a true werewolf would.\r\n\r\nMost other wolves and werewolves sense your nature and power and do not attack.\r\n\r\n\r\n\r\nWerewolf Form Improve\r\n\r\nAFTER turning into a werewolf Go Into Console commands with Tilde Key (~)\r\n\r\nType \\'bat barnwolf\\' and press enter\r\n\r\nWhen you return to gameplay you will be much faster.\r\n\r\nYou will heal quicker, about 3 times as fast.\r\n\r\nYou will do 150 extra unarmed damage as a true werewolf would.\r\n\r\nMost other wolves and werewolves sense your nature and power and do not attack.\r\n \r\n\r\n\r\nInstallation is simple:\r\n\r\nDownload and copy all files into data file in your skyrim directory.\r\n\r\n\r\n\r\nUninstall:\r\n\r\nDelete the four text files from skyrim/data folder.\r\n\r\n\r\n\r\nThanks to all the werewolf improvers out there, gave me ideas especially this one\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=1469\r\n\r\n\r\n\r\nAnyone that can improve on this please do, \r\nI\\'d love to have the improve and toggle as one command (especially a hotkey!!) \r\nbut becuase the transformation isn\\'t instant it affects all the improvements unless done like this when working with bat files. \r\nNeeds to be scripted. \r\n",
  "categoryId": "24",
  "version": "0.1",
  "author": "BARNDOG",
  "createdUnix": "1325723047",
  "updatedUnix": "1325724749",
  "containsAdultContent": false,
  "uploadedBy": "Baine1983",
  "primaryFile": null,
  "files": [
    {
      "fileId": "16704",
      "name": "BARNDOGS WEREWOLF",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "BARNDOGS WEREWOLF-5353-1.rar",
      "uploadedUnix": "1325724749",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ab83f75c1485d65fed4513b606b6c5742aba2b2bf9f3beed70683e70891fe291/analysis/1406583302/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BARNDOGS%20WEREWOLF-5353-1.rar?fid=16704&ttl=1535762001&ri=8192&rs=8192&setec=35dfbd5837303c2cb987173b37084bdc"
    }
  ]
}