{
  "modId": 53530.0,
  "modName": "Sayid the Mercenary - Standalone Follower",
  "summary": "Standalone release of Sayid the Warlord from my WIP quest mod. Supports any mods that change follower behavior. Requires Hearthfire and Dragonborn.",
  "descriptionHtml": "[center][IMG]http://i59.tinypic.com/14y045k.png[/IMG]\r<br />\r<br />\r<br />[b]Sayid Standalone Follower Mod - Supplement and main character of my upcoming fully-featured quest mod, A Mercenary&#39;s Due.[/b][/center]\r<br />\r<br />[b]Small update (5/22/2014):[/b] I&#39;ve filled out quite a few of the locations and quests for the &#34;full&#34; mod as of now, which is mostly done. I&#39;m currently ironing out some issues with his custom faction and interacting with the canned mercenary NPCs that will be part of the new patrols, so that when players finish all of the story quests it will be still be a dynamic and on-going experience with Sayid and his allies. Sayid himself is still with incomplete dialogue due to some real-life constraints I&#39;m facing at the moment (namely, money and time), and two other followers, Zubayr and Sampson, are both in similar shape. Once all of the main characters have been completed, I might release other follower sub-mods, however.\r<br />\r<br />There are also some &#34;hidden&#34; things within the currently uploaded release for people to look at if they&#39;re curious. Simply open your console and type &#34;help SFQ&#34; and there will probably various NPCs, locations, and items listed. I cannot guarantee that anything besides the barebones Sayid follower in stable, however. I know that Zubayr is also within this release as a follower, with the same fighting style as Sayid.\r<br />\r<br />[center][IMG]http://i59.tinypic.com/vh98oo.png[/IMG]\r<br />\r<br />\r<br />[b]Sayid, the Warlord from Elsweyr[/b][/center]\r<br />\r<br />The battle-hardened veteran of countless contracts and incursions, Sayid became a feared warlord and mercenary leader, whose origins lie in the inhospitable and dangerous badlands of Elsweyr.\r<br />\r<br />A Nord by birth, Sayid joined the Imperial Legion at a young age with the goal of traveling and seeing all of Tamriel. After four years of serving the Empire, a festering hate for military bureaucracy grew in him, and after being stationed in Elsweyr, he was arrested by his commanding officer for disobedience. \r<br />\r<br />Before the prisoner caravan could transport him back to Cyrodiil, he had an ambush arranged by a Khajiit named Zubayr, during which Sayid killed his commander with his bare hands. A legionnaire no more, Sayid took up his arms to do what he did best, fight. Zubayr became his second-in-command and they founded the now-notorious Red Moons mercenary unit.\r<br />\r<br />Leading the Red Moons, Sayid gathered hundreds of soldiers under his command, forming an organization spanning all provinces of Tamriel, from Hammerfell to Black Marsh. The Red Moons gained a reputation for professionalism and efficiency, with its ranks including some of the most deadly fighters Tamriel has ever seen. There was no job too big, no distance too far for them. And with each contract and each expansion, the bounty on Sayid&#39;s head only grew larger.\r<br />\r<br />With war brewing in the northern province of Skyrim, Sayid set his sights there. He received a very special contract, and unknown to him, one that would effect the very outcome of history itself, and finally clear his name of the Imperial bounty...\r<br />\r<br />\r<br />[center][IMG]http://i58.tinypic.com/v45454.png[/IMG][/center]\r<br />\r<br />\r<br />[center][b]Details about the mod and Sayid[/b][/center]\r<br />\r<br />[b]Where? -[/b] Sayid can be found spending his time in the [b]New Gnisis Cornerclub in Windhelm[/b]. This is where his quest will begin as well, but for the time being he&#39;ll just be waiting for you to show up and ask him to follow you.\r<br />\r<br />[b]What? -[/b] Sayid comes fully equipped with his own armor and weaponry ready to fight for you, or can be equipped with whatever you want to give him. He is compatible with all follower mods, so you may manage him with AFT, etc.\r<br />\r<br />[b]Combat Style -[/b] Sayid is an aggressive fighter and will not run away, even when nearly dead, so rest assured he will have your back in even the most fierce of battles. He fights intelligently and can quickly overpower many enemies, even on Legendary difficulty, so don&#39;t be afraid to set him loose on groups of enemies as a tank or damage sponge.\r<br />\r<br />[b]Additional information -[/b] I&#39;ve had a couple people ask me about what textures were used when he was originally created. His face textures are the &#34;2048x2048 Rugged&#34; option of DCE Realistic Male Face, which can be found here: http://www.nexusmods.com/skyrim/mods/38301/?\r<br />\r<br />His body was made with Better Males - Underwear - Default option, that can be downloaded here: http://www.nexusmods.com/skyrim/mods/2488/?\r<br />\r<br />[center][b]- WIP features -[/b][/center]\r<br />\r<br />Sayid is planned to be fully voiced with unique comments on locations. In addition to his quest line, the mod will include members of his mercenary band who will move to their den in Skyrim later on and can be used as additional followers or set loose to roam and patrol, with their own unique &#34;quests&#34; and contracts that will allow them to generate additional income for you.\r<br />\r<br />[center][b]- Installation and Uninstall -[/center][/b]\r<br />\r<br />Simply download with NMM and install.\r<br />\r<br />Without NMM, unzip the file and place the SayidFollowerStandalone.bsa and data folder into your Skyrim folder.\r<br />\r<br />To uninstall, use NMM or delete the associated files from your Skyrim folder. \r<br />\r<br />This is a non-replacer mod, so removing everything should allow you to continue to use your previous save games as well, as long as you have not used the console to get any items associated with it for yourself.\r<br />\r<br />[center][b]- Credits and additional information -[/b][/center]\r<br />\r<br />As I am very inefficient at creating meshes and textures for custom equipment, he will be wearing Letho&#39;s armor and Iorveth&#39;s bandana from The Witcher 2, ported to Skyrim by L0rd0fWar, which he has graciously given modders the permission to use in their own content (his ports can be found here: http://www.nexusmods.com/skyrim/mods/5588/?). The weapons I hope to use are Khajit Yatagan and An-Xileel Cleaver from Unexpected Blades, a set of incredibly well done weapons by naranjisimo and testhc (that can be found here: http://www.nexusmods.com/skyrim/mods/21857/?).\r<br />\r<br />Feel free to upload your screenshots using Sayid. The mod page could definitely use it, since I&#39;m not good with ENBs.\r<br />\r<br />If you have any questions about the mod or anything else, feel free to contact me here through the Nexus.\r<br />\r<br />If you run into any issues with the mod or incompatibilities, post them in the discussion section so I can be made aware.\r<br />\r<br />[b]CREDITS:[/b]\r<br />L0rd0fWar&#39;s Witcher 2 ports: http://www.nexusmods.com/skyrim/mods/5588/?\r<br />naranjisimo and testhc&#39;s Unexpected Blades: http://www.nexusmods.com/skyrim/mods/21857/?\r<br />\r<br />",
  "categoryId": "96",
  "version": "v0.1",
  "author": "DeltaWulf",
  "createdUnix": "1398652497",
  "updatedUnix": "1398654099",
  "containsAdultContent": false,
  "uploadedBy": "DeltaWulf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000106958",
      "name": "Sayid Standalone Follower - Requires Hearthfire and Dragonborn",
      "version": "v0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38382",
      "fileName": "Sayid Standalone Follower - Requires Hearthfire and Dragonborn-53530-v0-1.rar",
      "uploadedUnix": "1398654099",
      "modVersion": "v0.1",
      "virusScanUrl": "https://www.virustotal.com/file/91c8c100b4465b6d0401659a8874e0f75187bb2ac14a9e4f722e8e66a3608f85/analysis/1408045271/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sayid%20Standalone%20Follower%20-%20Requires%20Hearthfire%20and%20Dragonborn-53530-v0-1.rar?fid=1000106958&ttl=1535837123&ri=8192&rs=8192&setec=5e7cc78a9b2722ac7c6fdf79c839ea8d"
    }
  ]
}