{
  "modId": 53628.0,
  "modName": "Morrowind Overhaul",
  "summary": "Changes the empty and boring tundra and the volcanic marshes from the vanilla game by adding hundreds of new morrowind-style mushrooms to create a great morrowind-atmosphere in skyrim - COMPATIBLE WITH EVERYTHING",
  "descriptionHtml": "This is a mod I made over a year ago just for fun.\r<br />But then I begun really to like the idea and the concept and since that I played never without it.\r<br />Now, today I decided to finally share it with you guys.\r<br />\r<br />\r<br />So what does this mod do?\r<br />In my opinion the tundra in skyrim is boring: It&#39;s so empty&#33; So I wanted to fill it with some stuff, and I really liked the idea to fill it with some mushrooms from Morrowind to create a bit of an more fantasy- and TES3- feeling.\r<br />But this isn&#39;t a landscpae overhaul (what would cost an amount of work to create and would be very incompatible with every other mod in this area), it&#39;s a simply, esp.-based replacer:\r<br />It basically replaces some very little stones in the tundra that you - I can guarantee that - never really noticed with the awesome morrowind-style Mushrooms from the Dragonborn DLC.\r<br />There&#39;s also a file with does the same for the same little stones in the Volcanic marshes, where the mushrooms in my opinion also look great, but they have a little bit other look than the ones from the tundra to create a bit more diversity.\r<br />You won&#39;t find any mushrooms outside of this regions.\r<br />So I didn&#39;t added anything to the world of skyrim, this is only an esp.-based replacer for the stones - that creates maximal compatibility with every other mod. I now played over a year with this mod and I never noticed any bugs with any other mods - and I tried hundreds of them in that period of time ;)\r<br />\r<br />\r<br />FAQ:\r<br />\r<br />Q: I came here and expected an epic game-overhaul which adds the complete land of morrowind to the game&#33; This sh*t s*cks&#33;&#33;\r<br />A: Well, every mod author want&#39;s that attention is going to his mod, aren&#39;t they? Of course this title is a bit misleading, but hey, it isn&#39;t wrong&#33; ;) And btw, if you&#39;re searching for a mod like this, there are still 2 projects which want to do exactly this and they&#39;re awesome, the name of them are &#34;Beyond Skyrim&#34; and &#34;Skywind&#34;&#33; ;)\r<br />\r<br />Q: So did you placed every of this mushrooms by hand? Wow, that&#39;s an crazy amount of work&#33;\r<br />A: No, I didn&#39;t. I&#39;m a very lazy person (  ;D  ), so I just replaced some of the small stones in the tundra and the volcanic marshes with the mushrooms. And I didn&#39;t made that with changing actually the object, I simply changed the path of the mesh in the CK. So the file-size is just around 2 - 10 KB.\r<br />\r<br />Q: But so this is very incompatible with every other mod which adds stuff to the world, isn&#39;t it?\r<br />A: No, it&#39;s basically compatible with everything. The stones were there in the vanilla game, i didn&#39;t added anything&#33; And only the stones in the marshes and the tundra are replaced - and there isn&#39;t basically any other stuff that could cause problems :D . I walked around for hours and never noticed a mushroom growing through a building, for example :D\r<br />\r<br />Q: So you didn&#39;t changed something other?\r<br />A: Well´, I did: In the city of Whiterun growed one mushroom. That didn&#39;t fit in my opinion. I changed one mushroom back to the original stone-model by hand. So you&#39;ll find one manual edit.\r<br />\r<br />Q: This isn&#39;t lorefriendly in my opinion&#33;\r<br />A: Well, then don&#39;t download the mod, in my opinion&#33; :D\r<br />\r<br />Q: Please do another region with mushrooms, like the reach or the pineforests&#33;\r<br />A: No, I won&#39;t. I tried, but it wasn&#39;t good for 2 reasons: The greatest problem is that these areas are much more filled like the tundra or the volcanic marshes, and that would cause clipping and overlapping with other objects. And I don&#39;t want to correct this by hand, because it would cost an crazy amount of work and would make the file much more incompatible with other mods. And the second thing is, the mushrooms simply doesn&#39;t look great in this regions in my opinion.\r<br />\r<br />Q: Are there any NavMesh- Problems?\r<br />A: No, I never noticed some NPC or animal being stucked in the mushrooms or walking senseless in front of them. It seems like the little stones were recognized in the original NavMesh. And if you will notice someone making weird interactions with them - hey, everyone loves mushrooms&#33; :DD\r<br />\r<br />Q: Are there LOD&#39;s?\r<br />A: No, there aren&#39;t LOD&#39;s. And I don&#39;t have any plans to add them. It&#39;s not such a great problem as it might sound - believe me or not. Skyrim has much larger objects that suddenly are popping in - and you don&#39;t really notice that with the mushrooms.\r<br />\r<br />Q: Do I need any DLC to run this mod?\r<br />A: You&#39;re kidding me, aren&#39;t you? ;D Of course you need the Dragonborn- DLC if you want to run this mod, althought you want to have funny, floating exclamation-marks in your game ;) Dawnguard and Heartfire are not required.\r<br />\r<br />Q: Yoda and Batman are hanging around in Solitude and they&#39;re trying to kill me&#33; This is a bug&#33;&#33;\r<br />A: No it&#39;s not&#33; Well, not from this mod&#33; This mod is clean. :)\r<br />\r<br />\r<br />\r<br />Check out my other mod: Unique Villages&#33; It gives an unique look to every village in Skyrim&#33; http://skyrim.nexusmods.com/mods/29365\r<br />\r<br />And if you want to add much more morrowind-feeling to your game, check out my mod &#34;Oblivion and Morrowind Soundtrack&#34; if you want to hear the TES3 and TES4 music in Skyrim&#33; http://www.nexusmods.com/skyrim/mods/30568/?\r<br />\r<br />Thanks for downloading, rating - maybe endorsing? ;) - and giving a chance to my mod&#33;\r<br />Of course you are allowed to present or showcase the mod on every other side, forums or youtube, it would by actually very nice if you do so&#33; ;)\r<br />But the best and most motivating thing is when you leave a personal comment&#33;\r<br />\r<br />\r<br />And btw: Sorry for my bad english...\r<br />\r<br />\r<br />\r<br />I hope I made a part of your skyrim better&#33;\r<br />\r<br />\r<br />adidertulpendieb",
  "categoryId": "74",
  "version": "1.0",
  "author": "adidertulpendieb",
  "createdUnix": "1398947785",
  "updatedUnix": "1398947179",
  "containsAdultContent": false,
  "uploadedBy": "adidertulpendieb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000107375",
      "name": "Morrowind- Overhaul - Tundra",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Morrowind- Overhaul - Tundra-53628-1-0.rar",
      "uploadedUnix": "1398947136",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bc588bfbc72d3865c6df7881666f853881e1daad0e2c01a8b5bf51ef55b5d800/analysis/1408050185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowind-%20Overhaul%20-%20Tundra-53628-1-0.rar?fid=1000107375&ttl=1535837269&ri=8192&rs=8192&setec=5941a00e302864809408b5ec87e151d2"
    },
    {
      "fileId": "1000107376",
      "name": "Morrowind Overhaul - Volcanic Marshes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Morrowind Overhaul - Volcanic Marshes-53628-1-0.rar",
      "uploadedUnix": "1398947179",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c4ae7952b8fb1ef3604e524dc6be7b7be9ece2abf10e2700219fddd34568aabf/analysis/1408050185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowind%20Overhaul%20-%20Volcanic%20Marshes-53628-1-0.rar?fid=1000107376&ttl=1535837269&ri=8192&rs=8192&setec=4c98fc72ffa6d03669e967c3a7adf3af"
    }
  ]
}