{
  "modId": 53642.0,
  "modName": "Zahrahmiik",
  "summary": "*IN EARLY DEVELOPMENT, EXPECT IN LATE 2014-EARLY 2015* Zahrahmiik is a &#34;New Lands&#34; Mod for The Elder Scrolls V: Skyrim. Mahlaan takes the Dragonborn to an island, separate from Skyrim, where suffering and hatred is a common sight. It is up to the Dragonborn to rescue the island from total destruction at the hands of a powerful ancient Drago",
  "descriptionHtml": "     In year 201 of the Fourth Era, a small island off of the North coast of Skyrim, Vodahmin, is shaken to life as an ancient tomb&#39;s doors open for the first time in more than 4,000 years. \r<br />     In year 416 of the First Era, when the Nords are driven from Skyrim, one of the Ancient Nordic warriors, who was known as Bjorgen, turns to the gods for help in finding powers, to avenge his fallen friends. In doing this, he received the ultimate powers, but at a cost. He had received the powers from an old Nordic shaman, who worshipped dragons. While this shaman gave Bjorgen the power he had requested, the shaman had also taken Bjorgen&#39;s life-being... his soul. In return for his soul, Bjorgen got a simple wooden mask, and a robe, and the ability to control fire. Bjorgen, howerever, had also received a power he had not known was coming; the inability to die without being killed by another person of Dragon blood. He had been reborn, he was now Zahrahmiik, &#34;Sacrifice.&#34; With these abilities, he slaughtered thousands of Dwemer people. Having accomplished his final mission, he felt guilt, remorse, and anger. Wanting to rid the world of his filth, he sealed himself in a small chamber, which could not be opened. Thinking he could simply starve to death, he sat down and waited. He waited for months, years, yet he was not dead.\r<br />     When he had received his immortality, age was the least of his concerns, he thought he could still die of natural causes, but this was not the case. He would still age, feel pain, and grow weaker. Lying alone in his chamber, he was starving, crying, and scared for 4,000 years. One day, his chamber&#39;s door opened without reason. He did not question this. He slowly crawled to the entrance, took a breath of air, and stood up. He was ready to make Nirn pay for his own mistake. He was ready to make everyone know his name: Zahrahmiik.\r<br />\r<br />INSTALL\r<br />As with any mod, install using Nexus Mod Manager, or any similar program. \r<br />Manual install is also possible, to do so, simply extract the downloaded folder into\r<br />your &#34;Skyrim/Data&#34; directory. Once you have launched The Elder Scrolls V: Skyrim\r<br />simply check the .esm file in the &#34;Data Files&#34; section of the launch menu.\r<br />Press play, and &#34;Zahrahmiik&#34; should be installed and active. \r<br />\r<br />HOW TO START\r<br />To begin Zahrahmiik, simply travel to Dawnstar, and locate Hjormir, who will take \r<br />you to Vodahmin. Hjormir will be on a small boat. He will explain everything you need to \r<br />know. Enjoy from there.\r<br />\r<br />UNINSTALL\r<br />If, for whatever reason, you wish to uninstall Zahrahmiik, simply uncheck the .esm file. \r<br />You can then delete the file from the &#34;Skyrim/Data&#34; directory.\r<br />*DISCLAIMER*\r<br />AS WITH ANY NEW LARGE WORLD MOD, UNINSTALL IS NOT SUPPORTED. UNINSTALLING\r<br />ZAHRAHMIIK IS *NOT* SUPPORTED. IF YOU UNINSTALL ZAHRAHMIIK, YOU ARE RESPONSIBLE \r<br />FOR ANY DAMAGE TO YOUR SKYRIM GAME AND SAVE FILES. UNINSTALL AT YOUR OWN RISK.\r<br />",
  "categoryId": "30",
  "version": "0.1.0",
  "author": "FancyZebraSoftware",
  "createdUnix": "1398986511",
  "updatedUnix": "1398986511",
  "containsAdultContent": false,
  "uploadedBy": "FancyZebraSoftware",
  "primaryFile": null,
  "files": []
}