{
  "modId": 53650.0,
  "modName": "Katria Ghost Follower",
  "summary": "I was disappointed after completing the Lost to the Ages quest because Katria was gone and unavailable as a Follower.  So I brought her back.  ",
  "descriptionHtml": "This mod required the Dawnguard DLC\r<br />\r<br />Possible spoilers to follow…\r<br />\r<br />I was disappointed after completing the &#34;Lost to the Ages&#34; quest because Katria was gone and I couldn&#39;t use her as a Follower.  So I brought her back.  \r<br />\r<br />I&#39;ve played Skyrim for quite some time with this mod and recently searched the Nexus to see if anyone else had done anything with Katria, only to find that the only mods dealt with her prior to her death and the &#34;Lost to the Ages Quest.&#34;\r<br />\r<br />So I polished my mod up a bit and submit it here.  Katria Ghost Follower.\r<br />\r<br />I have written a short story explaining how Katria came to be in Whiterun and placed it in Breezehome near the door to the Alchemy Lab/Child&#39;s Room.  The name of the book is, &#34;Zephyr&#34; which means Quiet Breeze.  I have played heavily upon that meaning within the story.  To make the book I wrote the story in Word, then copied it to Notepad to strip the formatting, etc., then cut and paste the story within the frame of the book &#34;Dragonborn&#34; then dropped it within Breezehome.\r<br />\r<br />\r<br />Prerequisites:\r<br />1. Complete the quest &#34;Lost to the Ages&#34; obtained by reading the book &#34;Aetherium Wars&#34;\r<br />2. Kill Taron Dreth (Katria&#39;s apprentice) in a random encounter while traveling Skyrim which is triggered by the completion of &#34;Lost to the Ages&#34;.  You have to carry the Aetherial item you crafted in the Aetherium Forge in your inventory to complete this encounter.\r<br />\r<br />Then Katria will become available to you as a Follower. You&#39;ll find her walking the streets of Whiterun&#39;s Plains District at night (8pm to 6am).  She circles Breezehome on her patrol route.\r<br />\r<br />Katria is Protected, not Essential, and she has a weakness to fire (this is part of the original Katria).  She can be killed, especially by fire.  If you allow her to be set on fire by repeated exposure to; burning oil, Dragon Fire or Mage fire spells, she will be taken down rater quickly and could die.  \r<br />\r<br />If you want to make her Essential that is, of course, your call.  There are any number of mods that will change the Protected status, or you can use the console command;\r<br />\r<br />setessential xx002F9A 1\r<br />\r<br />Replace xx with the load order number of the mod which can be found in Nexus Mod Manager/Mods.  Make sure you use the hexadecimal &#39;Load Order&#39;, do not use the &#39;Index&#39; number.\r<br />\r<br />This is a different Katria, I have in no way modified the Katria from the Dawnguard DLC who you meet during the &#39;Lost to the Ages&#39; quest (DLC1LD), just made a copy.  I use Taron Dreth&#39;s encounter quest (DLC1_WESC09), monitoring its completion to trigger Katria&#39;s nightly walks around Whiterun.\r<br />\r<br />Katria&#39;s appearance has been unaltered, so the only thing necessary for the mod to run is the Dawnguard DLC.\r<br /> \r<br />Katria&#39;s voice; DLC1LD_FemaleNordUniqueKatria, does not contain follower dialog and will not work within this Mod.  Her voice has been replaced with FemaleEvenToned.\r<br />\r<br />Zephyr means, quiet breeze.  Katria carries Zephyr from the Dawnguard DLC.  Her DLC daggers are not available for use by another character, so in keeping with the tone I created two similar daggers, still SkyForgeSteel, Gale and Squall (I also played heavily upon that meaning in the story), each enchanted with Frost and Shock respectively.  I have not modified the stats on the weapons beyond enchantments.\r<br />\r<br />I have given Katria all steel armor with stats along with a necklace and ring.  Stats are Vanilla plus enchants; Health, Stamina, HeavyArmor, Stealth, Marksman, OneHanded.  She wears a helmet but I glitched it so it doesn&#39;t display.  She gets the benefits but you don&#39;t have to look at it. \r<br />\r<br />She is equipped with a custom class, CombatKatriaGhost which is similar to CombatRanger (In game it displays as &#39;Unknown Class&#39; if anyone knows how to fix this let me know and I&#39;ll make the necessary change).  I took the two points from Block adding one each to OneHanded and Sneak and moved three points from Light Armor to Heavy Armor.  The Skill Weight point total remains 11.  I know, Heavy Armor and Sneak, together, but come on, she&#39;s a ghost...\r<br />\r<br />I use the following Follower Mods and have no conflicts with them concerning Katria (See Screenshots)\r<br />Convenient Horses by Alek http://www.nexusmods.com/skyrim/mods/14950\r<br />Extensible Follower Framework by Expired http://www.nexusmods.com/skyrim/mods/12933\r<br />My Home Is Your Home - a mod for followers by Volek http://www.nexusmods.com/skyrim/mods/18045\r<br />\r<br />   I hope you enjoy the mod, as I enjoyed making it, and having Katria the Ghost as a follower.",
  "categoryId": "96",
  "version": "1.0",
  "author": "Dragonfire12",
  "createdUnix": "1399011573",
  "updatedUnix": "1399024361",
  "containsAdultContent": false,
  "uploadedBy": "Dragonfire12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000107471",
      "name": "Katria Ghost Follower Solid",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "182",
      "fileName": "Katria Ghost Follower-53650-1-0.7z",
      "uploadedUnix": "1399010216",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4e9ca60d178b5a16c7405f9b20a9a3b73992650166bb11056fabec2bebeb848e/analysis/1408051282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katria%20Ghost%20Follower-53650-1-0.7z?fid=1000107471&ttl=1535837299&ri=8192&rs=8192&setec=402d98442beadc258c4233ac659098c7"
    },
    {
      "fileId": "1000107482",
      "name": "Katria Ghost Follower Transparent",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "182",
      "fileName": "Katria Ghost Follower Transparent-53650-1-0.7z",
      "uploadedUnix": "1399024361",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a94d87e79f9446c6ac25665db2b10bf9b638029e74e6f55aebcdc4b6ed285ce6/analysis/1408051386/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katria%20Ghost%20Follower%20Transparent-53650-1-0.7z?fid=1000107482&ttl=1535837300&ri=8192&rs=8192&setec=13528882a75e389a417823e15ba76249"
    }
  ]
}