{
  "modId": 53751.0,
  "modName": "Witchhunter Spells and Prayers Pack",
  "summary": "A mod that adds 75+ new lore-friendly, balanced, unique spells and powers designed to be used in conjunction with weaponry. Spells added by this pack are mapped to the power button, opening up new possibilities for nearly every playstyle, while still granting skill XP for their respective schools.",
  "descriptionHtml": "[b][size=6][url=http://www.nexusmods.com/skyrimspecialedition/mods/133/?][center]This mod is also available for Skyrim Special Edition. Click here&#33;[/center][/url][/size][/b]\r<br />\r<br />[center][img]http://i.imgur.com/kSAnZiF.png[/img][/center]\r<br />[center][youtube]RxEMe6Y4W3s[/youtube][/center]\r<br />\r<br />\r<br />I created the Witchhunter Spells and Prayers Pack to address a simple problem: Using magic in combination with weapons. Have you ever tried to play an arcane archer? Or a two-handed warrior who dabbles in Destruction? Are you tired of having to constantly switch off of your weapons to equip your spells? Then this is the mod for you. The WItchhunter Spells and Prayers Pack adds unique, balanced new spells designed to work in conjunction with weapons, not against them. Now you can turn your magic inward, and augment your weapons with powerful effects. Or perhaps focus on your physical ability, and increase your strength for a time. Silence your enemies&#39; spells, resist their magic.\r<br />\r<br />Be a Witchhunter.\r<br />\r<br />[b][SIZE=7]What does this mod do?[/SIZE][/b]\r<br />\r<br />Designed to increase synergy between weapons and magic, The Witchhunter Spells and Prayers Pack adds 75+ lore-friendly, balanced spells and powers to the game. Unlike other spells in Skyrim, every ability added by this mod is mapped to the power button and does not require the use of a hand. They are all learned by purchasing Witchhunter Tomes, Aedra Prayer Tomes, and Daedra Prayer tomes from spell merchants. These tomes are added to the lists dynamically, to ensure full compatibility with other mods. Once read, the spells and prayers will be found in the Powers section of the magic menu. The spells will advance relevant skill XP, and will be affected by the Novice, Apprentice, Adept, and Expert perks for each school of Magicka. Furthermore, they only become available from merchants when your skill reaches the appropriate level, just like the spell tomes from the vanilla game. All Novice and Apprentice Witchhunter tomes are available from the beginning, as well as all Aedra and Daedra prayer tomes.\r<br />\r<br />To offset their ability to be used without a free hand, these spells are costly to cast. Their Magicka cost can be cut in in half by buying the appropriate magic perks. Example: An Apprentice-level Destruction power added by this mod will cost 50% less to cast after purchasing Apprentice Destruction in the Destruction tree.\r<br />\r<br />The abilities added by this pack are broken down into two categories. Spells and prayers. Spells cost magicka, advance skill XP, and benefit from casting perks. Prayers are greater powers, allowing only one use per day, and do not advance skill XP. \r<br />\r<br />[b][SIZE=7]Spells added by this pack:[/SIZE][/b]\r<br />\r<br />\r<br />- Augment weapon spells. Temporarily imbue your unenchanted wepons with powerful effects. Four tiers of fire, frost, and shock damage. Two tiers of absorb health and Magicka. Paralysis, Soul Trap, and more&#33;\r<br />- Silence augmentation. Strikes from your weapons prevent enemy mages from casting spells for a limited time. Returning effect from Oblivion&#33;\r<br />- Magicka Resistance. Multiple tiers of resist Magicka spells, Magicka Shroud, Magicka Armor, and Magicka Field.\r<br />- Conjure Arrows. Permanently summon bundles of arrows, comes in four tiers.\r<br />- Focus your physical ability, and at the cost of mana, increase your effectiveness with weapons for a time.\r<br />- 26 Prayer spells. Pray to your favorite Tamrielic god, and receive a unique effect once per day. Pray to Jyggalag to bring time to a halt. Pray to Hircine and receive one of his Hounds as your ally. Pray to Mara and be cured of all disease. Pray to Vaermina to trap your foes in their own nightmares. Pray to Arkay to reveal the Undead. 26 prayers to choose from&#33;\r<br />- An immersive lore book available from all generic spell merchants with details on the Witchhunters.\r<br />- All that, and more&#33;\r<br />\r<br />[b][size=5]New in the 1.3 Update:[/size][/b]\r<br />\r<br />- Enhanced Reflexes and Blinding Speed. A Slow Time effect that breaks when the caster attacks, bringing time to a crawl and boosting mobility.\r<br />- Elemental Focus spells. Temporarily boost your affinity for a given elemental type, but become vulnerable to the others.\r<br />- Conjure Elemental arrows. Powerful Fire, Frost, Shock, and Freezing arrows are available to summon&#33; \r<br />- Focus Voice. Use your Magicka to boost your proficiency with the Thu&#39;um, greatly reducing the cooldown time on your Shouts for the duration of the effect.\r<br />- Defensive Elemental Cloak spells. You wrap yourself in a protective cloak of Fire, Frost, or Shock, increasing your resistance to their respective elemental type.\r<br />\r<br />\r<br />[b][size=4]For a full list of spells and powers added by this mod, click the Readme tab on this page, or open the included readme after downloading&#33; It  has a full list of every spell, which school they belong to, and what level they are&#33;[/size][/b]\r<br />\r<br />[b][SIZE=7]FAQ[/SIZE][/b]\r<br />\r<br />[b][size=4]Where do I buy these spells?[/size][/b]\r<br />\r<br />You buy them the same way you buy any other spells, at existing merchants. Just like spells in the base game, the higher-level ones will only become available after your skill with a given school of Magicka is high enough. Check the mages at the College of Winterhold for the highest-level spells in the game, and this mod.\r<br />\r<br />[b][size=4]I bought an Augmentation spell, and can&#39;t select it. What gives?[/size][/b]\r<br />\r<br />You have to be holding an unenchanted weapon, and it has to be drawn. No overpowering your weapons by buffing already-enchanted ones.\r<br />\r<br />[b][size=4]Why isn&#39;t my XP increasing when I cast Witchhunter spells?[/size][/b]\r<br />\r<br />Just like many vanilla spells, casting these spells only advances skill XP while in combat. No free levels while sitting in towns.\r<br />\r<br />[SIZE=7]Permissions[/SIZE]\r<br />\r<br />[url=https://robbiemod.wordpress.com/License]https://robbiemod.wordpress.com/License[/url]\r<br />\r<br />- Contact me before using anything from this mod. I will probably say yes.\r<br />\r<br />- If you contact me and I do not respond within 30 days, you have full permission to use this mod, in whole or in part, in any of your work. This includes compilations, conversions, and any derivative works.\r<br />\r<br />- No parts of this mod can be monetized under any circumstances. If you are caught monetizing this work, your permission to use any content from any of my mods is permanently revoked.\r<br />\r<br />- Credit me if you use something from this mod.\r<br />\r<br />- If you use something from this mod, your permissions should be open so other people can use it the same way you did.\r<br />\r<br />\r<br />[b][SIZE=7]Installation[/SIZE][/b]\r<br />\r<br />I recommend installing with Nexus Mod Manager. Otherwise, add the WitchhunterPackRelease1.0.esp file to your Skyrim/data folder. Also be sure to add the contents of the scripts folder into your Skyrim/Data/scripts folder, and the contents of the Sound folder into the Skyrim/Data/Sound folder. All scripts are marked with the tag MODWitchhunter (or just Witchhunter), for easy uninstallation. Otherwise, let NMM handle it.\r<br />\r<br />(The items in the screenshots were added by the Immersive Weapons mod and the Immersive Armors mod by Hothtrooper44. As well as Cloaks of Skyrim by Nikinoodles. They&#39;re my favorite mods on the Nexus and I urge you to go and check them out out.)\r<br />\r<br />[b][SIZE=7]Compatibility[/SIZE][/b]\r<br />\r<br />This mod adds Witchhunter Tomes and Aedra/Daedra Prayer Tomes to the leveled lists dynamically only after the game starts. This means that Wrye Bash is [b]not[/b] necessary. This mod should play nicely with pretty much all other mods, as it adds new assets and doesn&#39;t modify any vanilla ones. \r<br />\r<br />[b][SIZE=7]My Other Mods:[/SIZE][/b]\r<br />\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/65607/?][center][img]http://i.imgur.com/uX3g6JA.jpg[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/76949/?][center][img]http://i.imgur.com/wt24bOb.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/79045/?][center][img]http://i.imgur.com/bh3nfCC.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66995/?][center][img]http://i.imgur.com/0fPggDT.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/45780/?][center][img]http://i.imgur.com/Oh1KZft.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66055/?][center][img]http://i.imgur.com/KK7LOim.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50294/?][center][img]http://i.imgur.com/o1vzSpP.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66196/?][center][img]http://i.imgur.com/hObIhrQ.png[/img][/center][/url]\r<br />[center][img]http://i.imgur.com/V0ICmGW.png[/img][/center]",
  "categoryId": "75",
  "version": "v1.3",
  "author": "Robbie",
  "createdUnix": "1399245488",
  "updatedUnix": "1414451302",
  "containsAdultContent": false,
  "uploadedBy": "Robbie922004",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000107900",
      "name": "Witchhunter Spells and Prayers Pack v1",
      "version": "v1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "414",
      "fileName": "Witchhunter Spells and Prayers Pack v1-53751-v1.rar",
      "uploadedUnix": "1399245482",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/ce1f4256a6792772296f6c8ff16e2de767b2e3845cbd5fa1dd99150fd919123d/analysis/1408062548/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witchhunter%20Spells%20and%20Prayers%20Pack%20v1-53751-v1.rar?fid=1000107900&ttl=1535837450&ri=8192&rs=8192&setec=b494f4e947e0d9f17eb77b4e43987875"
    },
    {
      "fileId": "1000108254",
      "name": "Witchhunter Spells and Prayers Pack v1_1",
      "version": "v1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "415",
      "fileName": "Witchhunter Spells and Prayers Pack v1_1-53751-v1-1.rar",
      "uploadedUnix": "1399492255",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e8b3228d919b76f5f0849b43476c852cf366634b27582728539f72661951c9e2/analysis/1408067410/",
      "changelogHtml": " Fixed a bug that caused weapon speed to be increased when using the Augmentation spells in conjunction with certain perks. <br/> \n Balance adjustment for XP gain. <br/> \n Channel Health changed to a Novice Restoration spell. <br/> \n Channel Regeneration changed to an Apprentice Restoration Spell. <br/> \n Regenerating Burst changed to an Adept Restoration Spell. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witchhunter%20Spells%20and%20Prayers%20Pack%20v1_1-53751-v1-1.rar?fid=1000108254&ttl=1535837450&ri=8192&rs=8192&setec=e7e75d3aca8424474f64456f1755b175"
    },
    {
      "fileId": "1000109195",
      "name": "Witchhunter Spells and Prayers Pack v1_2",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "415",
      "fileName": "Witchhunter Spells and Prayers Pack v1_2-53751-v1-2.rar",
      "uploadedUnix": "1400168522",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4a7397dacf662c43fb2b2a56974ac6e4b2c6b5f82ffa19b802b96f6da50afcdc/analysis/1408077918/",
      "changelogHtml": " Adjusted balance of Channel Health, Channel Regeration, and Regenerating Burst.  <br/> \n Fixed a bug that prevented Channel Regeneration and Regenarating Burst from becoming available from vendors at the appropriate levels. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witchhunter%20Spells%20and%20Prayers%20Pack%20v1_2-53751-v1-2.rar?fid=1000109195&ttl=1535837451&ri=8192&rs=8192&setec=c3cec6260e2c7cbc3cfb08f31e41b989"
    },
    {
      "fileId": "1000132857",
      "name": "Witchhunter Spells and Prayers Pack v1_3",
      "version": "v1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "427",
      "fileName": "Witchhunter Spells and Prayers Pack v1_3-53751-v1-3.rar",
      "uploadedUnix": "1414451302",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/08b87673d5467a84a7ae6bacbea29bdd55016e71cf86bf779be1e49f006783a8/analysis/1414451402/",
      "changelogHtml": " - Added 15 new spells: \r<br />- Enhanced Reflexes \r<br />- Blinding Speed \r<br />- Conjure Fire Arrows \r<br />- Conjure Frost Arrows \r<br />- Conjure Shock Arrows \r<br />- Conjure Freezing Arrows \r<br />- Focus Breath \r<br />- Focus Breath \r<br />- Focus Shout \r<br />- Elemental Focus - Fire \r<br />- Elemental Focus - Frost \r<br />- Elemental Focus - Shock \r<br />- Defensive Flame Cloak \r<br />- Defensive Frost Cloak \r<br />- Defensive Lightning Cloak \r<br />- Fixed a bug that could cause the player to become stuck in Jyggalag&#39;s Order. \r<br />- Adjusted balance on many of the prayers, tweaked an existing spell or two. Mostly just increasing the duration on some underpowered prayers.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witchhunter%20Spells%20and%20Prayers%20Pack%20v1_3-53751-v1-3.rar?fid=1000132857&ttl=1535837451&ri=8192&rs=8192&setec=ec44646f615d3645810c76c1c72bd2fe"
    }
  ]
}