{
  "modId": 53783.0,
  "modName": "Extra Guard Voices",
  "summary": "Adds new voices to the guards in every hold.",
  "descriptionHtml": "Very simple mod that adds some variety to the robot guards in Skyrim. In vanilla Skyrim, there are 2 total male guard voices, this mod simply adds a few voices of other in game NPCs. In Imperial holds there are now 5 different voices instead of 2. In Stormcloak holds there are now 3 (not counting female guards, I didn&#39;t add any to them) instead of 2. Here&#39;s a breakdown.\r<br />New Imperial guard voices: Commander voice type (used by commander Caius in Whiterun and the legates in Imperial camps), Nord voice type (the generic and most frequent male voice you hear, used by tons of male nords like Ralof, Jarl Balgruuf, and every male Stormcloak soldier), and lastly the Soldier voice type (the scratchy Imperial soldier voice, used mostly just by Imperial soldiers and I think a wizard I don&#39;t remember).\r<br />New Stormcloak guard voices: Just the male Nord (Ralof) voicetype because the other 2 seemed out of place and Stormcloak holds have female guards so not as much change was necessary. \r<br />\r<br />This mod does NOT change any thing else about guards, no weapons, no armors, and there are NO extra guards added, just the addition of extra voices. I haven&#39;t thoroughly play tested it yet but I haven&#39;t run into any problems either. It blends into your game as if it was already there. \r<br />\r<br />One last thing to be aware of: any guard that has a new voice WON&#39;T have the dialogue that they usually do. For example a guard that has a default guard voice will say something like, &#34;blah blah blah you should visit the blacksmith&#34; or &#34;I used to be an adventurer like you, then I took an arrow in the knee&#34;. A guard with one of the extra voices (with the exception of Soldier voiced guards in Solitude, they have most of the Solitude guard dialogue from what I can tell) will not say these little things, they will have generic greeting dialogue, &#34;Need something?&#39; &#34;I&#39;m waiting&#34; &#34;Yea&#34;. They will however have the arrest dialogue so if you commit a crime they can arrest you like any normal guard. \r<br />\r<br />LOAD ORDER: I recommend putting this after any other mod that makes changes to guards. I&#39;ll update and make changes if necessary. Download with NMM or manually. Tell me about any problems please.\r<br />\r<br />If you want even more variety, check out my Varied Guards mod:\r<br />http://www.nexusmods.com/skyrim/mods/53787/?",
  "categoryId": "33",
  "version": "1",
  "author": "Donngold",
  "createdUnix": "1399329101",
  "updatedUnix": "1399328935",
  "containsAdultContent": false,
  "uploadedBy": "donngold",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108016",
      "name": "Extra Guard Voices",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Extra Guard Voices-53783-1.zip",
      "uploadedUnix": "1399328935",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d6cdf626a9eed26449cadd78927a1a588c49e4c6d112831d69b065fd44b44669/analysis/1408063883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extra%20Guard%20Voices-53783-1.zip?fid=1000108016&ttl=1535837502&ri=8192&rs=8192&setec=7c7e02dcc8b0e4d9b4a969976201c211"
    }
  ]
}