{
  "modId": 53787.0,
  "modName": "Varied Guards",
  "summary": "Adds more variety to guards in Skyrim",
  "descriptionHtml": "This mod is based on Varied Guards and Stormcloaks found here: http://www.nexusmods.com/skyrim/mods/6575/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D6575%26preview%3D&pUp=1\r<br />Since that mod was not updated I decided to make a new one. This mod gives each hold guard more variety and makes them less like clones. Every hold has new (mostly based on original mod&#39;s ideas) guard outfits. In addition, every guard now carries either iron or steel arrows, and Stormcloak guards carry a long bow or a hunting bow. \r<br />Here&#39;s an overview:\r<br />Windhelm guards-new sleeved cuirass, iron boots and gauntlets, new helmets (hide, scaled, iron, steel, and Stormcloak officer)\r<br />\r<br />Dawnstar-new helmets (hide, scaled, iron, steel)\r<br />\r<br />Winterhold-fur guantlets, new helmets (hide, fur, scaled, iron, steel)\r<br />\r<br />Riften-leather boots and guantlets, new helmets (hide, scaled, iron, steel)\r<br />\r<br />Whiterun-hide boots, gloves, new helmets (since Whiterun doesn&#39;t side with the imperials until the civil war quest I gave them a mix of both: hide, scaled, steel, imperial, imperial light)\r<br />\r<br />Falkreath-gloves, hide boots, new helmets (imperial, imperial light, steel)\r<br />\r<br />Morthal-steel boots and gauntlets, new helmets (imperial, imperial light, steel)\r<br />\r<br />Markarth-imperial light bracers and imperial light boots, new helmets (imperial, imperial light, steel, also now carry imperial equipment since they&#39;re an Imperial hold)\r<br />\r<br />And finally Solitude-new helmets (imperial, imperial light, steel, and imperial officer)\r<br />\r<br />No known bugs, playtested, shouldn&#39;t break your game :) Any problems let me know.\r<br />Works on existing saves too, if a guard hasn&#39;t changed open the console click on him or her and type &#34;resetinventory&#34; then press enter and they should update. Download with NMM or manually.\r<br />\r<br />Also check out my Extra Guard Voices mod: http://www.nexusmods.com/skyrim/mods/53783/?\r<br />\r<br />and my Varied Soldiers mod(s): http://www.nexusmods.com/skyrim/mods/53803/?\r<br />\r<br />\r<br />Anyone who wants to port this or my other mods to the special edition or to consoles feel free. I cant as I no longer own a good PC",
  "categoryId": "33",
  "version": "1",
  "author": "Donngold",
  "createdUnix": "1399342698",
  "updatedUnix": "1399342216",
  "containsAdultContent": false,
  "uploadedBy": "donngold",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108037",
      "name": "Varied Guards ",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Varied Guards -53787-1.zip",
      "uploadedUnix": "1399342216",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/8439969c5a07e90f65337a4ab1f7364e2afafbc4fe0fa9b3123f8169f24bbe9d/analysis/1408064223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Varied%20Guards%20-53787-1.zip?fid=1000108037&ttl=1535837506&ri=8192&rs=8192&setec=7e89ae741e1837e64a118a1f323b259f"
    }
  ]
}