{
  "modId": 53807.0,
  "modName": "Elsa - Frozen",
  "summary": "Elsa from Frozen as a saved game character, I&#39;m just uploading this if anyone wants to use it, because I&#39;m fairly happy with the result and if you really like Frozen like me. (It is a good film tho).",
  "descriptionHtml": "My first upload on the Nexus, I just wanted to plop on a save character to see how it would work because I really have little clue. If my creations/abominations are popular I may try to recreate other things from other stuff. If I&#39;m thinking about this right, Elsa should have all the Tier 1 spells (but it makes sense to just use Frostbite, yo) and should have glass armour (it was the most Elsa-esque) she&#39;ll probably have some other crap in her inventory too. She should spawn somewhere around Shor&#39;s Stone I think. \r<br />\r<br />BIT OF A WOOPSIE PLEASE READ: I used Skyrim Unbound when creating this character so you might not have access to the main quest. And none of the dragon shouts. Unless you know how to solve this well uh. Sorry.\r<br />\r<br />Tutorial:\r<br />I&#39;m guessing that you will have to manually download it and plop it into where all the saved games are. My documents&gt;My games&gt;Skyrim&gt;Saves\r<br />\r<br />Mods I used for Elsa that you may need but idk I ain&#39;t a mod genius, yo:\r<br />Apache Sky Hair by Apachii (http://www.nexusmods.com/skyrim/mods/10168/?)\r<br />Cbbe v3 by Caliente (because I&#39;m an awfully lonely pervert - http://www.nexusmods.com/skyrim/mods/2666/?)\r<br />Sporty sexy sweat by xs2reality (once again, sorry those who disagree with my hormones - http://www.nexusmods.com/skyrim/mods/28946/?)\r<br />Bangos Glass Female Armour by Bango (I thought it was sexy, but not too sexy and kinda fit in with Frozen the most)\r<br />Skyrim Unbound by chinagreenelvis (sorry about that - http://steamcommunity.com/sharedfiles/filedetails/?id=169372128)\r<br />And that&#39;s about it, I think.",
  "categoryId": "43",
  "version": "over.9000",
  "author": "Quep_",
  "createdUnix": "1399412809",
  "updatedUnix": "1399412792",
  "containsAdultContent": false,
  "uploadedBy": "Quep",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108134",
      "name": "Elsa from Frozen save",
      "version": "over.9000",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Elsa from Frozen save-53807-over-9000.rar",
      "uploadedUnix": "1399412792",
      "modVersion": "over.9000",
      "virusScanUrl": "https://www.virustotal.com/file/69f9e370a24a065ee8b7bffef76d9430d6eb441b7c1f2314f5e9504a68e0d0c1/analysis/1408065602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elsa%20from%20Frozen%20save-53807-over-9000.rar?fid=1000108134&ttl=1535837552&ri=8192&rs=8192&setec=3331c865e3476a19630d835959b6b409"
    }
  ]
}