{
  "modId": 53815.0,
  "modName": "Titan Hammer",
  "summary": "This hammer is a result of my need to make a weapon suitable for the titan transformation mod. Link in the full description. This is my first mod and it&#39;s the typical god weapon with a twist.",
  "descriptionHtml": "So you were at least interested enough in my mod to click on it. This mod is not for the lore-friendly people nor the immersive crowd. This is purely for fun. This mod adds an item called the Titan Hammer. It&#39;s an ebony hammer that deals a ridiculous amount of damage. If you can&#39;t one hit dragons you&#39;re doing something wrong.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/43365/?]This hammer is best paired with the titan form.[/url] \r<br />\r<br />\r<br />As of May 7th, 2014 it should now be craft-able. Please post a comment or send my a private message if it isn&#39;t.\r<br />\r<br />Please endorse if you like this mod, it took literally 8 hours of my life to get the enchantment working and i would really like it if you could take five seconds out of yours to show your appreciation.\r<br />\r<br />This mod is complete and whole. As far as i know there are no bugs and no conflicts. I don&#39;t recommend using the hammer indoors as the enchantment is a powerful explosion and launches npc&#39;s quite far. I&#39;m not sure what might happen if you use it indoors. Also launching people over city walls is a bad idea from the market standpoint but that&#39;s for the player to choose.",
  "categoryId": "40",
  "version": "1.2",
  "author": "Michael Tepes",
  "createdUnix": "1399431378",
  "updatedUnix": "1399494567",
  "containsAdultContent": false,
  "uploadedBy": "mtepes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108257",
      "name": "Titan Hammer V1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Titan Hammer V1_2-53815-1-2.rar",
      "uploadedUnix": "1399494567",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/797bdf8d2d55ea2c23a9e420cd920797eb21a3c8bb9bae4f40d8f6256791b809/analysis/1408067411/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Titan%20Hammer%20V1_2-53815-1-2.rar?fid=1000108257&ttl=1535837565&ri=8192&rs=8192&setec=abd2bb6816f466ecb853708b3c54babe"
    }
  ]
}