{
  "modId": 53813.0,
  "modName": "Lance&#39;s Show Room",
  "summary": "A show room to be used with Jaxonz Positioner. It contains static objects that the player can take and re-spawn to decorate their home. Also creates a Hearthfire vendor that sells supplies you need to build your home.",
  "descriptionHtml": "This companion mod to Jaxonz Positioner will allow you to turn a blank house into the customized house you always wanted.\r<br />\r<br />It contains static objects, furniture, and containers you can pick up with Jaxonz Positioner or a similar mod. In lore friendly mode pressing the Dwemer button next to each display will cost a 100 gold toll, and then a copy of the display object will be built by an ancient machine. The copy will appear in the room west of the entrance at 8 am the next day. Construction time and cost can be changed in the mod menu.\r<br />\r<br />With lore friendly mode disabled the Dwemer button next to each display item will spawn a new one for you right away for no charge.\r<br />\r<br />Currently I have the following sets on display:\r<br />Common\r<br />Crafting Stations\r<br />Noble\r<br />Nord\r<br />Orc\r<br />Upper\r<br />\r<br />More are coming soon&#33;\r<br />\r<br />The show room also contains Lance, a building supplies vendor for Hearthfire supplies. His research notes can be found on the counter when you first enter the show room.\r<br />\r<br />You can find the show room along the north beach of Lake Ilinalta next to one of the fishing camps.\r<br />\r<br />This mod was made to be used with Jaxonz Positioner which you can find here: http://www.nexusmods.com/skyrim/mods/52583/? but any mod that let&#39;s you move static items in game will work.\r<br />\r<br />Right now I cannot spawn weapon racks, mannequins, or working bookshelves. Once you can move these with Jaxonz Positioner I can use his spawn code to create them for you.\r<br />\r<br />Please let me know if there are any items you want added to the show room, I will be glad to set them up.",
  "categoryId": "69",
  "version": "1.2.6",
  "author": "Lance C",
  "createdUnix": "1399427297",
  "updatedUnix": "1400608738",
  "containsAdultContent": false,
  "uploadedBy": "animejunkey54",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109782",
      "name": "Lances Show Room",
      "version": "1.2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122",
      "fileName": "Lances Show Room-53813-1-2-6.zip",
      "uploadedUnix": "1400608738",
      "modVersion": "1.2.6",
      "virusScanUrl": "https://www.virustotal.com/file/4771f73dae7b41748aca67a5f653ef883e29437be9af1fac191f5b1ad4482842/analysis/1408087027/",
      "changelogHtml": " More attempts at fixing scripts. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lances%20Show%20Room-53813-1-2-6.zip?fid=1000109782&ttl=1535837560&ri=8192&rs=8192&setec=c120018dc5e2f38b87049ba5bc7fed8e"
    }
  ]
}