{
  "modId": 53836.0,
  "modName": "Living Legends - Heroes of Sovngarde",
  "summary": "A small, lore-conscious mod that modifies the generic &#34;Hero of Sovngarde&#34; NPCs in the Hall of Valor as well as named NPCs.",
  "descriptionHtml": "REQUIREMENTS:\r<br />Skyrim\r<br />Dawnguard\r<br />Dragonborn\r<br />\r<br />DESCRIPTION:\r<br />Speaking for nobody but myself, it was a massive disappointment to walk into the Hall of Valor at the end of the Main Quest, only to find it occupied by a dozen or so forgettable NPCs in generic armor. In order to remedy this, I have done two things:\r<br />\r<br />1) I&#39;ve modified each Hero of Sovngarde NPC to give them a unique name and appearance, and placed three new NPCs with the same attributes where previously there were three instances of the same one. Every hero you&#39;ll see here is somebody whom you&#39;ve met in Morrowind or Oblivion, or else comes from books and obscure lore. Special care has been taken here to make sure their face and clothes match their description or previous incarnations, where either exist, within the confines of the vanilla loot/chargen options. As much as possible this mod strives to adhere to the lore of the series and hopefully these characters should fit seamlessly into the gameworld.\r<br />\r<br />2) The other thing I&#39;ve done is modify the inventories, and in a couple cases the faces, of most of the already named NPCs to give them the same treatment. So Olaf One-Eye now wears clothing suitable for a Jarl of Whiterun, and the legendary heroes of the Dragon War are equipped with dragonbone/dragonscale weapons and armor reflecting their deeds.\r<br />\r<br />INSTALLATION:\r<br />Drag and drop the ESP, meshes, and textures into the Skyrim/Data folder and activate the ESP with your mod management tool of choice.\r<br />\r<br />BUGS:\r<br />Not so much a bug as a small quirk, but every Hero of Sovngarde has a random chance of saying the line: &#34;Hail, Dragonborn. That honor is also mine - to our shared birthright you&#39;ll bring new glory&#33;&#34;. For most of the historical/mythological figures this shouldn&#39;t be too big a deal, but it may be off-putting to hear it said by some of the others. The line&#39;s pretty rare so in general it shouldn&#39;t affect your game much.\r<br />\r<br />COMPATIBILITY:\r<br />It should be compatible with anything except mods that also modify the NPCs in the Hall of Valor. This mod strictly uses vanilla and DLC content. I have not touched Ysgramor himself, and recommend using [url=http://www.nexusmods.com/skyrim/mods/53581/?]Rise of the Legend - Ysgramor[/url] which does him far more justice than I could hope to.\r<br />\r<br />I also recommend using [url=http://www.nexusmods.com/skyrim/mods/27575/?]More Sovngarde NPCs[/url], and have purposefully tried to avoid using any NPCs featured in that mod so the two will play together nicely. Please let me know if you encounter any doubling.",
  "categoryId": "33",
  "version": "1.0",
  "author": "Saint_Jiub",
  "createdUnix": "1399496391",
  "updatedUnix": "1399496246",
  "containsAdultContent": false,
  "uploadedBy": "spaceinvader91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108262",
      "name": "Heroes of Sovngarde",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25796",
      "fileName": "Heroes of Sovngarde-53836-1-0.zip",
      "uploadedUnix": "1399496246",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1563e7126ad0c2cfce22541a24559d5c408a576ea7ecdbb1716fc5ac9cc984cc/analysis/1408067476/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heroes%20of%20Sovngarde-53836-1-0.zip?fid=1000108262&ttl=1535837593&ri=8192&rs=8192&setec=c024f64e8049f9955f371edfb20df316"
    }
  ]
}