{
  "modId": 53851.0,
  "modName": "Terminator Main Screen Replacer With Music",
  "summary": "This mod replaces the main menu background and music with The Terminator image background with a theme music.",
  "descriptionHtml": "Description:\r<br />This mod replaces the main menu background and music with a Terminator theme.  The background will be different and the music that is played in the background is also a terminator theme.\r<br />\r<br />Copyright:\r<br />Music- I got permission to use the song from TheBiologicalHazard (YouTube) https://www.youtube.com/watch?v=evCPDj2D1bU  .  He got permission to edit and share the song and to be able to give permission to others such as me as long as credit was given to himself and the original composer Brad Fiedel.\r<br />\r<br />Background Image- The image is from the website http://www.wall321.com in which they have permission to share the image and in which they gave me permission to use as long as I give credit to them.\r<br />\r<br />Now that the boring legal stuff is out of the way. . .\r<br />\r<br />Installation:\r<br />To install you can either use NMM or you can just download manually and extract in your skyrim folder.\r<br />\r<br />Random Info:\r<br />This is my first mod I&#39;ve created so if you notice any issues with the mod or suggestions that could help improve just let me know.  I hope to do other mods that are more challenging but as for now baby steps.\r<br />\r<br />Credit:\r<br />James Cameron- For directing this kick ass movie.\r<br />Brad Fiedel- Original composer of the theme song.\r<br />Wall321.com- Source where the image used is from.\r<br />TheBiologicalHazard- Edited version of theme song used in this mod.  Check out his page, he has many more.  https://www.youtube.com/watch?v=evCPDj2D1bU",
  "categoryId": "61",
  "version": "1.0",
  "author": "vraven95",
  "createdUnix": "1399530185",
  "updatedUnix": "1399530156",
  "containsAdultContent": false,
  "uploadedBy": "vraven95",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108318",
      "name": "TerminatormainscreenVer1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6489",
      "fileName": "TerminatormainscreenVer1_0-53851-1-0.zip",
      "uploadedUnix": "1399530156",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9996afcffee2168b40f6051e256bcbaa93b918658a86dfe80999d631ce0ab6e0/analysis/1408067946/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TerminatormainscreenVer1_0-53851-1-0.zip?fid=1000108318&ttl=1535837613&ri=8192&rs=8192&setec=307f4c6e5744a780a5c06fb8f6cdebff"
    }
  ]
}