{
  "modId": 53885.0,
  "modName": "Chesko and Nikkita&#39;s Arissa - The Wandering Rogue - DV",
  "summary": "",
  "descriptionHtml": " \r<br />[center][img]http://i.imgur.com/evjGl7e.jpg[/img][/center]\r<br /> \r<br /> \r<br />\r<br />[center]ACHTUNG: Die Originalmod von the one and only &#34;Chesko&#34; wird benötigt&#33;&#33;&#33; Diese könnt ihr hier herunterladen:\r<br />[url=http://www.nexusmods.com/skyrim/mods/53754/?][color=#add8e6][b]Arissa - The Wandering Rogue[/b][/color][/url] \r<br /> \r<br /> \r<br />Dies ist meine erste Übersetzungsarbeit und ich bitte daher um etwas Nachsicht, sollten sich Rechtschreib- und/oder Übersetzungsfehler eingeschlichen haben. Schiebt es auf mein Hirn, welches sich meistens im Zombie-Modus befand, als ich des Nachts diese Übersetzung gemacht habe. Ich gelobe Besserung in den sehr wahrscheinlich folgenden Updates. (DIES GALT NUR FÜR DIE v1.1a&#33;&#33;&#33; In der v1.2 und v1.3 sieht alles viel viel besser aus. Denke ich zumindest und hoffe es&#33;) \r<br />\r<br />\r<br />[COLOR=#ffd700][SIZE=5][B]ÜBERBLICK [/B][/SIZE][/COLOR](Auszug aus Cheskos &#39;Overview&#39;. Freie Übersetzung):\r<br />=========================================================\r<br />\r<br />Arissa ist ein Skyrim-Begleiter mit über [COLOR=#daa520]450 Zeilen Dialog[/COLOR], professionell aufgenommen und wunderschön gesprochen von der talentierten [COLOR=#daa520]Nikkita[/COLOR]. Sie wurde designed, um dich von Anfang bis Ende des Spiels zu begleiten. Inspiriert von Emmas und Amgepos Vilja, Bethesdas Serana aus Dawnguard und solche Art von Charakteren, die man in BioWare-Spielen findet.\r<br />\r<br />Arissa ist eine Kaiserliche mit einem unabhängigen und rebellischen Geist und mit einem Geschenk gesegnet, teure Dinge verschwinden zu lassen.\r<br />\r<br />Arissa ist eine Art Schurkencharakter mit einem Zwei-Schwerter-Kampfstil. Sie wird Klingen, Bögen und jegliche Art von Rüstung benutzen die ihr gegeben werden. Sie leveled mit dem Spieler/der Spielerin, favorisiert diebesorientierte Fähigkeiten, wie leichte Rüstung, Schlösser knacken und einhändige Waffen. Sie wird nie Druckplatten oder Stolperdrähte auslösen. Ihr Level ist unbegrenzt...\r<br />\r<br />Zwar kann Arissa es nicht mit der Bandbreite von Features, wie sie in &#39;[COLOR=#daa520]Vilja in Skyrim[/COLOR]&#39; geboten werden, aufnehmen, aber wir können eine obsessive Sorgfalt an Qualität zum Detail versprechen, während wir eine Erfahrung bieten, die sich anfühlt wie eine normale Erweiterung des Spiels...\r<br />\r<br />Spezielle Anmerkung: Spieler die an Arachnophobie leiden, könnten es unter Umständen schwer haben einen Teil von Arissas Hauptquest zu erfüllen. Bitte installiert einen Spinnen-Replacer, wenn das euch betrifft...\r<br />\r<br />\r<br />\r<br />[B][COLOR=#ffd700][SIZE=5]Wie Anfangen[/SIZE][/COLOR][/B]:\r<br />======================\r<br />Besuche den Totmannstrunk in Falkenring. Arissa wird dort auf dich warten.\r<br />\r<br />\r<br />[COLOR=#ffd700][B][SIZE=5]Unterhaltungen[/SIZE][/B][/COLOR]:\r<br />========================\r<br />Arissa kann über generelle Dinge der Umgebung sprechen (&#34;Was wisst Ihr über diesen Ort?&#34;) und über ihren Hintergrund. Sie wird zuerst misstrauisch sein, aber sich im späteren Verlauf der Hauptquest immer mehr öffnen. Sie wird ausserdem Interesse an der frühen Phase der Hauptquest zeigen...\r<br />\r<br />\r<br />[COLOR=#b22222][B][SIZE=3]WARNUNG[/SIZE][/B][/COLOR]: Arissa verabscheut Kannibalismus. Wenn du dich von jemandem ernährst, während du den Ring von Namira trägst und Arissa dich zu dieser Zeit begleitet/sieht, wird sie dich für immer verlassen. Du wirst danach nicht im Stande sein sie noch einmal zu rekrutieren, also sei vorsichtig&#33;\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=6][color=#ffd700][b]Installation[/b][/color][/size][/center]\r<br /> \r<br />Zuerst die Originalmod von Chesko nach seinen Anweisungen installieren, danach einfach meine CompanionArissa.esp in den Skyrim/Data Ordner verschieben. Gewöhnlich ist dieser unter SteamSteamappsCommonSkyrim zu finden. Überschreiben, wenn danach gefragt wird. Vorher bitte vorsichtshalber ein Backup von Cheskos Original .esp machen, falls Ihr mit meiner Übersetzungsarbeit total unzufrieden seid und doch lieber diese wunderbare Mod im Original spielen möchtet.\r<br />\r<br />Da diese Übersetzung nur die Untertitel beinhaltet (Nein, ich habe nicht versucht die Stimme einer Frau nachzuahmen und somit Arissa auf deutsch zu vertonen), müsst Ihr selbstverständlich darauf achten, das Ihr die Untertitel im Spiel einschaltet. Danke&#33;\r<br />\r<br />ACHTUNG: Wichtigste Neuerung in der v1.2 wie ich finde ist, dass Arissas Level nun &#34;uncapped&#34; ist. Damit Ihr diesen Effekt in eurem Spiel erleben könnt, MÜSST ihr entweder ein neues Spiel anfangen ODER einen Spielstand laden, der noch keine Arissa gesehen hat&#33;\r<br />\r<br />Auch der neu hinzugefügte Konsolencommand &#34;set RecoverArissa to 1&#34; (ohne Anführungszeichen eingeben) ist sehr wichtig. Damit könnt ihr Arissa zu euch &#34;beamen&#34;, sollte sie euch mal abhanden kommen.\r<br /> \r<br />\r<br />[b]WENN IHR VON V1.1a AUF v1.2 UPDATED: Erst die v1.1a deinstallieren, dann die v1.2 installieren.\r<br />Laut Chesko ist KEIN Clean Save nötig&#33;[/b]\r<br /> \r<br /> \r<br />[center]\r<br />[size=6][color=#ffd700][b]Bei Kritik und technischen Problemen[/b][/color][/size][/center]\r<br />\r<br />Sollten Bugs, Glitches oder sonst irgendwelche Fehler auftreten, die nichts mit meiner Übersetzung zu tun haben, so wendet Euch doch bitte an Chesko auf seiner [b][url=http://www.nexusmods.com/skyrim/mods/53754/?][color=#add8e6]Arissa Modseite[/color][/url][/b]. Und solltet Ihr diese Mod genauso toll finden wie ich, wisst Ihr was Ihr zu tun habt, geht und drückt den kleinen Button auf Cheskos Modseite. Er und Nikkita (welche Arissa spricht) haben es sich verdient. Vielen Dank&#33;\r<br />\r<br />Solltet Ihr Beanstandungen an meiner Übersetzung haben, mir ein klitzekleines Lob aussprechen wollen, konstruktive Kritik leisten wollen oder solltet Ihr diese Übersetzung gar in der Luft zerreissen wollen, so steht die Kommentarecke dafür immer offen.\r<br />Auch Heiratsanträge nehme ich in der Kommentarecke gern entgegen, nur Kinderwünsche werde ich leider nicht erfüllen, da ich schon 3 Töchter habe. :)\r<br />\r<br />\r<br />\r<br />[center][size=6][color=#ffd700][b]Changelog v1.3[/b][/color][/size][/center]\r<br />\r<br /> *Arissas &#34;Schnippe-zum-Spieler&#34;-Feature für&#39;s Erste wieder entfernt. Wenn es in Zukunft verbessert wurde, wird es wieder hinzugefügt. Beachtet, das es dazu führen kann, das ihr Arissa schneller verlieren könnt in Aussenarealen. Falls ihr sie verloren habt, gebt in die Konsole &#34;Set RecoverArissa to 1&#34; ein (ohne Anführungszeichen) und Arissa ist wieder an eurer Seite.\r<br />\r<br />    *Bug beseitigt der dazu führte das Arissa nicht mit dem Spieler reden wollte, als sie versuchte dem Spieler aus dem Weg zu gehen.\r<br />\r<br />    *Arissas Aussehen sanfter gemacht. Sie sollte nun mehr ihrem Alter ( 28 ) entsprechend aussehen, ohne die Nutzung von Mods.\r<br />\r<br />    *Ihr könnt nun Essen und Getränke mit Arissa tauschen wenn ihr &#34;Lasst uns Eure Ausrüstung überprüfen&#34; benutzt, damit wurde Kompatibilltät mit dem Begleiter-Feature von iNeed sichergestellt. Beachtet das ihr im Dialog die Option &#34;...Ausrüstung überprüfen&#34; nutzen MÜSST damit die iNeed-Features bei Arissa funktionieren.\r<br />\r<br />    *Unterstützung für Extensible Follower Framework (EFF) 4.0 Beta hinzugefügt.\r<br />\r<br />\r<br /> \r<br /> [center][size=6][color=#ffd700][b]Changelog v1.2[/b][/color][/size][/center]\r<br /> \r<br />Freie Übersetzung des Changelog v1.2 (Auszug) von Chesko:\r<br />___________________________________________________\r<br />\r<br />[LIST]\r<br />[*]Die Eröffnungsquest scheitert nun nicht mehr an irgendwelchen Problemen.[/*]\r<br />[*]Neues Inventar -und Outfitsystem.[/*]\r<br />[*]Gegenstände die Ihr Arissa mit &#34;Ich möchte etwas mit Euch tauschen&#34; gebt, werden von ihr nicht getragen. Ihr könnt ihr alles geben ohne zu fürchten ihr Aussehen zu verhunzen.[/*]\r<br />[*]Gegenstände die ihr Arissa mit &#34;Lasst uns Eure Ausrüstung überprüfen&#34; gebt, werden versucht getragen zu werden. Ihr könnt Arissa keine Gegenstände geben die keine Waffen/Rüstung/Kleidung/Munition oder Lichtquellen (z.B. Fackeln) sind, wenn Ihr diese Option benutzt.[/*]\r<br />[*]Das neue Dialogsystem erfordert das Ansehen &#34;distanziert&#34; oder besser, das Gleiche bei der &#34;Handeln&#34; Option.[/*]\r<br />[*]Die &#34;lockere Bekleidung&#34;/&#34;Rüstung&#34; Option wurde entfernt. Wenn Ihr wollt das Arissa lockere Bekleidung trägt, müsst ihr all die Rüstung die sie bei sich trägt aus ihrem Inventar entfernen.[/*]\r<br />[*]Neues Konsolenkommando hinzugefügt: &#34;set RecoverArissa to 1&#34; bringt Arissa wieder an Eure Position zurück, solltet ihr sie wirklich und wahrhaftig irgendwo verloren haben.[/*]\r<br />[*]Problem gelöst bei dem Arissa nicht mit dem Fahrstuhl fahren wollte am Ende ihrer Hauptquest. Wenn das Euch betrifft und Arissa unter dem Fahrstuhl feststeckt, dann wird dieses Update dafür sorgen das sie zu Eurer Position gebracht wird und damit die Quest beenden.[/*]\r<br />[*]Uncapped Arissas Level. Ihr MÜSST ein neues Spiel anfangen / einen Spielstand laden der nie eine Arissa gesehen hat, damit dieser Effekt Wirkung zeigt.[/*]\r<br />[*]Arissa ist nun auf Essential gestellt an allen Punkten nach der Eröffnungsquest. Eure einzige Möglichkeit sie zu töten ist, diese Option während der Quest zu wählen.[/*]\r<br />[*]Arissa muss Euch nun sehen bei Euren Taten, die das Ansehen bei ihr beeinflussen.[/*]\r<br />[*]Einen Eintrag in den aktiven Effekten hinzugefügt welcher anzeigt wie es um Euer Ansehen bei Arissa bestellt ist.[/*]\r<br />[*]&#34;Schnippe zum Spieler&#34; Verhalten gefixt wenn ausserhalb gereist wird; Arissa sollte nun nicht mehr weit hinter Euch zurückfallen.[/*]\r<br />[*]Arissas zweiter Teil der Hauptquest kann nun gestartet werden indem Ihr nach Haafingar in die Nähe des Sturmantellagers reist.[/*]\r<br />[/LIST]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />[center]\r<br />[size=6][color=#ffd700][b]CREDITS[/b][/color][/size][/center]\r<br />[b]THANK YOU und DANKESCHÖN an:[/b]\r<br />\r<br />*Chesko for making this wonderful companion mod and for permission to translate his work&#33;\r<br />\r<br />*Nikkita for the best voice acting I&#39;ve ever heard in a mod&#33; You are an amazing Arissa&#33; \r<br />\r<br />*Ablaze666 für das cool aussehende Layout dieser Beschreibung&#33; Danke sehr für die Arbeit, die du dir damit gemacht hast&#33; \r<br />\r<br />*Merkur67 dafür das du mir den Vortritt gelassen hast für die Übersetzung&#33; Dankeschön&#33; \r<br />\r<br />*Bethesda for making one of the best games I&#39;ve ever played, Skyrim, even it seems that you&#39;ve forgotten to finish it, but that&#39;s why there is a community. \r<br />\r<br />Und zum Schluss meiner besten Freundin Daniela. Danke das du mir immer eine wundervolle Freundin warst&#33; Hab dich unfassbar lieb&#33;&#33;&#33; *hug* ",
  "categoryId": "96",
  "version": "v1.3",
  "author": "Chesko and Nikkita - DV by WestsideKidd",
  "createdUnix": "1399677780",
  "updatedUnix": "1400693746",
  "containsAdultContent": false,
  "uploadedBy": "westsidekidd",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108484",
      "name": "Arissa - The Wandering Rogue - Deutsche Uebersetzung",
      "version": "1.1a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "196",
      "fileName": "Arissa - The Wondering Rogue - Deutsche Uebersetzung-53885-1-1a.rar",
      "uploadedUnix": "1399677755",
      "modVersion": "1.1a",
      "virusScanUrl": "https://www.virustotal.com/file/b532c3cd3681d2831e30c3f5601029cd8b31f00f5eef6eaedf63037a7c5c8032/analysis/1408069985/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arissa%20-%20The%20Wondering%20Rogue%20-%20Deutsche%20Uebersetzung-53885-1-1a.rar?fid=1000108484&ttl=1535837686&ri=8192&rs=8192&setec=74355644a3388a2452af997c8f466c8f"
    },
    {
      "fileId": "1000109630",
      "name": "Chesko and Nikkita&#39;s Arissa-The Wandering Rogue - Deutsche Version",
      "version": "v1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "199",
      "fileName": "Chesko and Nikkita's Arissa-The Wandering Rogue - Deutsche Version-53885-v1-2.rar",
      "uploadedUnix": "1400489524",
      "modVersion": "v1.2",
      "virusScanUrl": "https://www.virustotal.com/file/a22e8bef555ab6770c6c3cca400068ebe1d9600fbd3088067c201338c4843232/analysis/1408084683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chesko%20and%20Nikkita%27s%20Arissa-The%20Wandering%20Rogue%20-%20Deutsche%20Version-53885-v1-2.rar?fid=1000109630&ttl=1535837687&ri=8192&rs=8192&setec=2ab98a9144122d17783ef43690833071"
    },
    {
      "fileId": "1000109904",
      "name": "Arissa - The Wandering Rogue v1.3 - Deutsche Version",
      "version": "v1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "200",
      "fileName": "Arissa - The wandering Rogue v1.3 - Deutsche Version-53885-v1-3.rar",
      "uploadedUnix": "1400693746",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/64ef5dfca8f43876e22bb794247397a6802b50496a077b15ccc4d3ba3d35ccd0/analysis/1408088652/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arissa%20-%20The%20wandering%20Rogue%20v1.3%20-%20Deutsche%20Version-53885-v1-3.rar?fid=1000109904&ttl=1535837687&ri=8192&rs=8192&setec=df24d4adf17b200c598c4b329772ec76"
    }
  ]
}