{
  "modId": 53900.0,
  "modName": "Iosif Stalin on skyrim - DELETED",
  "summary": "He located in riften ",
  "descriptionHtml": "Joseph Stalin or Iosif Vissarionovich Stalin (Russian: Ио́сиф Виссарио́нович Ста́лин, pronounced [ˈjosʲɪf vʲɪsɐˈrʲonəvʲɪt͡ɕ ˈstalʲɪn]; born Ioseb Besarionis Dze Jugashvili, Georgian: იოსებ ბესარიონის ძე ჯუღაშვილი, pronounced [iɔsɛb bɛsariɔnis d͡ze d͡ʒuɣaʃvili]; 18 December 1878[1] – 5 March 1953), was the leader of the Soviet Union from the mid-1920s until his death in 1953.\r<br />\r<br />Among the Bolshevik revolutionaries who took part in the Russian Revolution of 1917, Stalin was appointed general secretary of the party&#39;s Central Committee in 1922. He subsequently managed to consolidate power following the 1924 death of Vladimir Lenin through suppressing Lenin&#39;s criticisms (in the postscript of his testament) and expanding the functions of his role, all the while eliminating any opposition. By the late 1920s, he was the unchallenged leader of the Soviet Union. He remained general secretary until the post was abolished in 1952, concurrently serving as the Premier of the Soviet Union from 1941 onward.\r<br />\r<br />Under Stalin&#39;s rule, the concept of &#34;socialism in one country&#34; became a central tenet of Soviet society. He replaced the New Economic Policy introduced by Lenin in the early 1920s with a highly centralised command economy, launching a period of industrialization and collectivization that resulted in the rapid transformation of the USSR from an agrarian society into an industrial power.[2] However, the economic changes coincided with the imprisonment of millions of people in correctional labour camps[3] and the deportation of many others to remote areas.[3] The initial upheaval in agriculture disrupted food production and contributed to the catastrophic Soviet famine of 1932–1933, known as the Holodomor in Ukraine. Later, in a period that lasted from 1936 to 1939, Stalin instituted a campaign against alleged enemies within his regime, called the Great Purge, in which hundreds of thousands were executed. Major figures in the Communist Party, such as the old Bolsheviks, Leon Trotsky, and several Red Army leaders, were killed after being convicted of plotting to overthrow the government and Stalin.[4]\r<br />\r<br />In August 1939, Stalin entered into a non-aggression pact with Nazi Germany that divided their influence and territory within Eastern Europe, resulting in their invasion of Poland in September of that year, but Germany later violated the agreement and launched a massive invasion of the Soviet Union in June 1941. Despite heavy human and territorial losses, Soviet forces managed to halt the Nazi incursion after the decisive Battles of Moscow and Stalingrad. After defeating the Axis powers on the Eastern Front, the Red Army captured Berlin in May 1945, effectively ending the war in Europe for the Allies.[5][6] The Soviet Union subsequently emerged as one of two recognized world superpowers, the other being the United States.[7] The Yalta and Potsdam conferences established communist governments loyal to the Soviet Union in the Eastern Bloc countries as buffer states, which Stalin deemed necessary in case of another invasion. He also fostered close relations with Mao Zedong in China and Kim Il-sung in North Korea.\r<br />\r<br />Stalin led the Soviet Union through its post-war reconstruction phase, which saw a significant rise in tension with the Western world that would later be known as the Cold War. During this period, the USSR became the second country in the world to successfully develop a nuclear weapon, as well as launching the Great Plan for the Transformation of Nature in response to another widespread famine and the Great Construction Projects of Communism. In the years following his death, Stalin and his regime have been condemned on numerous occasions, most notably in 1956 when his successor Nikita Khrushchev denounced his legacy and initiated a process of de-Stalinization. He remains a controversial figure today, with many regarding him as a tyrant[8] similar to his wartime enemy Adolf Hitler; however, popular opinion within the Russian Federation is mixed.[9][10][11]\r<br />\r<br />\r<br />From wikipedia",
  "categoryId": "96",
  "version": "0.1",
  "author": "fizzn1",
  "createdUnix": "1399703625",
  "updatedUnix": "1399703622",
  "containsAdultContent": false,
  "uploadedBy": "fizzn1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108536",
      "name": "StalinMod01",
      "version": "0.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "5",
      "fileName": "StalinMod01-53900-0-1.zip",
      "uploadedUnix": "1399703622",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/453238b70c1fd966b1dbd716b61879d2a0087b36fbddecf4fd8d54f76083ec59/analysis/1408070593/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/StalinMod01-53900-0-1.zip?fid=1000108536&ttl=1535837715&ri=8192&rs=8192&setec=a40c28801a40633e413ffa3646018e49"
    }
  ]
}