{
  "modId": 53988.0,
  "modName": "The Snowline",
  "summary": "Elegant rusticity for mid to upper level characters and up to five companions - Snowline has a lot to offer those who appreciate a more realistic approach to the game.",
  "descriptionHtml": "[center][img]http://static-5.nexusmods.com/15/mods/110/images/53988-2-1399935832.jpg[/img][/center]\r<br />\r<br />Built for the hero(ine) of Skyrim who might have up to five companions in tow, Snowline is nevertheless suitable for any character willing to accept its upper level yet rustic charm.  \r<br />Some will recognize that my usual checklist of prerequisites are observed in this mod as well: \r<br />[list]\r<br />[*]highly interactive\r<br />[*]realistic lighting\r<br />[*]lots of little details yet mostly clear of hoarder&#39;s clutter\r<br />[*]lore-friendly\r<br />[*]uses mostly vanilla resources to create some interesting new looks\r<br />[*]no dependencies on other mods or dlc&#39;s\r<br />[*]carefully navmeshed\r<br />[*]cleaned with TES5edit\r<br />[*]thoroughly tested before releasing to the Nexus\r<br />[*]friendly to even the lowest-end computers that meet the requirements of the game. (I personally maintain 60 fps throughout most of the house on my &#39;potato&#39;.)\r<br />[/list]\r<br />If you bought the game and have it updated you are more than welcome to use this mod right out of the box.\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]The Snowline features:[/color][/b]\r<br />-----------------\r<br />[list]\r<br />[*]Main living area is open with a large centrally located fireplace - sitting area at one end; dining and bar at the other. Fire can be &#34;stoked&#34; from a romantic, low setting to a blazing &#34;Frostfall&#34; warming setting. Dinner table can be set with four individual place settings or cleared of all dinnerware leaving maps, notes, books, and candles. All candles and lanterns can be activated EXCEPT: Overhead entry, shield display, and bar alcove lanterns which are all on timers; ALL candlehorn chandeliers in the house remain on low (thank you, Sonja, for refilling them). There&#39;s a wood-storage alcove with a place to store your axe and an imposing shrine to Talos in the opposite alcove.\r<br />[*]Master bedroom off the living area is sunny and bright:  a small activating bookshelf, desk, double bed with &#39;well-rested&#39;; plenty of storage. (All storage is safe in the house unless it states &#34;respawning&#34; as is the case of just a few food containers and a trash basket.)\r<br />[*]Downstairs is the *kitchen, *the help&#39;s private room, *a storage room with two extra beds, *a privy with a two-seater (lids lift to provide seating, the hatchway behind can be opened to the outside for disposal, a small bath that sits one-in and one at the side; fire activates of course), and *a second master bedroom with activating fireplace, double-bed; a secret entry to an enchanting and alchemy room.  All of which is connected by a long hallway which contains an alcove for a big, effing bear and four weapon displays entitled &#34;The Art of Warfare&#34; featuring Ebony, Orc, Elven, and Glass craftsmanship which you can use to store your own weapons or merely leave them as displays as intended.\r<br />[*]Racks, displays, and .. yes, peeps, even mannequins (3 of them I had to grit my teeth to put in) are available throughout the house to use but are not overpowering and certainly not deserving of a mighty war-room of their own.  All tested and function perfectly I might add.\r<br />[*]As stated most candles and lanterns within reach can be activated throughout the house and you should note that I intentionally left most &#34;on&#34; so you could easily find them if you first arrive at night.\r<br />[*]All workstations are available either at the house or via a quick boat ride across the lake to Bruma Shays. Who? Shay is an old friend you set up with a blacksmithing business who gratefully insists on caring for your horse in the warmer climes of the south shore during your stays at Snowline. Hope that answers your question.\r<br />[*]The house comes with a cook/house cleaner/personal servant [providing some logic to fires and lamps that remain lit thank you very much] by the name of Sonja Pharingale. While she is set up as a follower, &#34;firing&#34; her in this case just means she&#39;ll go back to her regular duties in the house. She understands that and takes no offense. (See pic for her details.)\r<br />[*]A boat at the Snowline dock will take you to either Shays or Riverwood and back home again. Just look to either side of the boat for the portal. For the boats in Riverwood and at Shays - look to the front of the boat as they have only one travel location: Snowline.\r<br />[*]There&#39;s also an overland passage as marked in the location picture. Go to Brittleshin Pass first and then follow the cliffs just to the left of its cave entrance. And speaking of location - what&#39;s next?\r<br />[/list]\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]Location:[/color][/b]\r<br />-----------------\r<br />The Snowline is map-marked on the north side of Lake Ilinalta just west of Brittleshin Pass. If your horse should fast travel with you there&#39;s a place to tie him up just outside the house.\r<br />&#34;Bruma Shay&#39;s Stable and Blacksmithing Trade&#34; is also map-marked off the south shore of the lake if you wish to go there first and drop off said horse.  The boat at his dock as previously mentioned will get you to Snowline.\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]Install:[/color][/b]\r<br />-----------------\r<br />Any which way you choose but since there are texture files involved you should reset archive invalidation to be safe.  \r<br />You should also be indoors on your last save prior to installing this mod.  Some of the outdoor workstations may not function properly if done otherwise. (Just a little bug one can run into - easily dealt with.)\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]Uninstall:[/color][/b]  If done manually remove the following:\r<br />-----------------\r<br />[list]\r<br />[*]meshes&gt;actors&gt;character&gt;FaceGenData&gt;FaceGeom&gt;The Snowline.esp folder\r<br />[*]meshes&gt;LegendsHallofFame folder (That&#39;s right - I should have used a generic name instead before deciding on what to call it. At least I was consistent most everywhere else.)\r<br />[*]scripts&gt;Source&gt;aaHLLightSwitchScript  and aaHLtimedLightSwitch\r<br />[*]scripts&gt;aaHLLightSwitchScript.pex  and  aaHLtimedLightSwitch.pex\r<br />[*]textures&gt;AARS&gt;openbook&gt;largebookpaper01  or just the AARS folder if you&#39;re not using any other of his textures in your game.\r<br />[*]textures&gt;actors&gt;character&gt;FaceGenData&gt;FaceTint&gt;The Snowline.esp folder\r<br />[*]textures&gt;The Snowline folder\r<br />[*]and finally The Snowline esp\r<br />[/list]\r<br />and I can&#39;t imagine why you&#39;d need to do it this way instead of just double-clicking the mod in the NMM but there it is.\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]Update to V2 5/13/2014:[/color][/b]\r<br />-----------------\r<br />An old problem that had been &#39;corrected&#39; popped up again as I was playing the game last night.  Seems the arches built into the house like to disappear on the lower level under what must be very specific and unpredictable conditions.  Lighting, collision, the portal through the Room Bounds all taken into consideration, changed, and declared &#39;fixed&#39; after weeks of observation ... until last night.  So I took what have to be final and drastic measures to &#39;hide&#39; it.  If you update from V1 you&#39;ll notice some physical changes to the kitchen, lower hall and lower master bedroom because of the new arches and stuff being moved around to accommodate them.  No containers were affected so your goods will be safe by simply changing out the files. Sorry if this happened to you, though no one mentioned it. Maybe my computer just needs cleaning and all this was for naught. :)\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]Issues:[/color][/b]\r<br />-----------------\r<br />Lights come on at the wrong time.  Timers may take a game day to adjust to your game. Npc&#39;s on AI packages (like Sonja and Shay) that are set on timers, and lights that are set on timers (as a few of mine inside and outside are) which are introduced in a new mod may take a game day to adjust to your game&#39;s time. So patience, my friend, all will be well shortly. (I&#39;ve personally experienced this with the lights that first day, and while Sonja and Shay may act goofy for a short while they settle down fairly quickly.)\r<br />\r<br />Incompatible with &#34;Aurora Village&#34;. Shay&#39;s Stable lies under someone&#39;s house and once the navmesh is laid out it&#39;s no longer a simple matter of picking up and moving. So use one mod or the other - not both together. (Or how &#39;bout keeping both mods and just use them in alternate games?)\r<br />\r<br />It&#39;s too dark. Then look to your own settings. The lighting scheme was designed for the vanilla game and it&#39;s not too dark. Check your settings in COT, enhanced lighting mods, and your various ENBs of which they&#39;re are over 500 on this site at last count. (I agree - a few might be great for taking fx-enhanced pictures but they sure can screw up your game if you unwittingly start messing with ini files.)  Needless to say I won&#39;t be making patches for all the variables you could throw at it in this regard.\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]Q&A:[/color][/b]\r<br />-----------------\r<br />[Q] Would you add an under ...\r<br />[A] No underground caves, mines, or hidden treasure rooms thank you very much.  This may be a fantasy game but my homes are real, kid. \r<br />[Q] Could you change out the sta ...\r<br />[A] Talos stays&#33;  To hell with the Thalmor and let &#39;em come&#33;  What kind of milk-drinker did you say you were?\r<br />[Q] Do you always insult everyone who makes a ...\r<br />[A] Bad habit isn&#39;t it?  Got it from reading Elianora&#39;s responses.  KID-ding&#33;  (H-i &#33;  Love you, E.  It is okay to kid the best, isn&#39;t it?)  :)\r<br />[Q] Where&#39;s the quest to get the house? It would certainly be more realistic.\r<br />[A] Just wanted you to finish &#39;cause I like this one so much.  Go to nexusmods&gt;Files&gt;Categories&gt;Quests and adventures. You get to pick one. Finish it and only then download the house as your reward.  Then ignore the fact that the house is already bought and paid for.  \r<br />Nothing else?  Thanks, guys.  Speaking of &#39;thanks&#39; .. what&#39;s next?\r<br />\r<br />-----------------\r<br />[b][color=#be81f7]Credits and Thanks:[/color][/b]\r<br />-----------------\r<br />[list]\r<br />[*][url=http://www.creationkit.com/Light_Switch]Light Switch Scripts[/url] resource on the Construction Kit wiki. The only two simple scripts I use for most everything.\r<br />[*][url=http://skyrim.nexusmods.com/mods/25859/?]TES5edit[/url] by ElminsterAU. If you were to check this file now you&#39;d find &#34;2353&#34; processed records, &#34;0&#34; Removed Records, &#34;0&#34; Undeleted Records, and &#34;0&#34; navmesh errors - clean as a whistle.\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/14134/?]OpenBooks Resource[/url] by Blary\r<br />[*][url=http://www.iguanadons.net/Skyrim-Fixing-Navmesh-Deletion-Using-TES5Edit-511.html]Empire of the Iguanadons[/url] for the tutorial on &#34;Fixing Navmesh Deletion Using TES5Edit&#34; without which I would have been completely asea and awash on the deleted navmesh issue.\r<br />[/list]\r<br />+ All those others who make tutorials but especially to Gopher and DarkFox whose contributions have been of invaluable help to me in working with TES5edit, making followers and NPCs, and with creating Room Bounds. Look &#39;em up on YouTube.\r<br />+ Bethesda - Skyrim and its assets.\r<br />+ The Dark One, his moderators and staff for their tireless efforts in keeping the Skyrim Nexus up and running for all to use.\r<br />+ Finally to the members of this community who graciously offer their comments and/or endorsements in support of the mods they use and enjoy - I can&#39;t imagine just doing this for my own use.  You all make it fun and rewarding to make and share mods. So keep up the good work ..\r<br />\r<br />and take care.\r<br />gary\r<br />\r<br />Want a little country house to get away for a quiet weekend close to old friends?  May I recommend a short trip to your [url=http://skyrim.nexusmods.com/mods/47152/?]grandfather&#39;s old farm[/url] (which you would never sell btw) where you resided in earlier, leaner times.\r<br />\r<br />-----------------\r<br />Mods by gary62 for Bethesda/Obsidian games:\r<br />-----------------\r<br />On the Fallout4nexus -\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/fallout4/mods/7307/?]Legends _ Saves[/url]\r<br />[/list]\r<br />\r<br />On the skyrimnexus - \r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/57944/?]The Cabin[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/56700/?]Providence _ A Settlement Near Ivarstead[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/54738/?]Skyview[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/53988/?]The Snowline[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/47152/?]Hindalok - Grandfather&#39;s Farm[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/49714/?]A Night On the Rift[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/59092/?]Legends Presets _ Famous Heroes and Heroines _ ECE CME saves[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/66989/?]Red Sonja _ Origins[/url]\r<br />[/list]\r<br />\r<br />On the newvegasnexus - \r<br />[list]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46004]Rancho Villa[/url] - (Mod of the Month for May 2012)\r<br />[*][url=http://newvegas.nexusmods.com/mods/49173/?]Phoenix Point[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46591]Ravens Nest[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46862]Rathers Camp[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/50333/?]Legends Presets[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/50710/?]gary62 version of Fees Realistic Portable Tent[/url]\r<br />[/list]\r<br />\r<br />On the tesnexus - \r<br />[list]\r<br />[*][url=http://oblivion.nexusmods.com/mods/43084]Silverfish River Cabin[/url]\r<br />[/list]\r<br />\r<br />On the fallout3nexus -\r<br />[list]\r<br />[*][url=http://fallout3.nexusmods.com/mods/18055]Megaton Return[/url] - (Mod of the Month for Aug 2012)\r<br />[*][url=http://fallout3.nexusmods.com/mods/17492]Camp Meridian[/url] \r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=17444]Hunters Ridge[/url]\r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=16922]The Dockside Inn_v1b_Redux[/url]\r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=16201]The g62 Housing Compilation[/url]\r<br />[*][url=http://fallout3.nexusmods.com/mods/19137/?]Legends Presets[/url]\r<br />[/list]",
  "categoryId": "67",
  "version": "V2",
  "author": "gary62",
  "createdUnix": "1399936995",
  "updatedUnix": "1400011352",
  "containsAdultContent": false,
  "uploadedBy": "gary62",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000108877",
      "name": "The Snowline",
      "version": "V1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3877",
      "fileName": "The Snowline-53988-V1.7z",
      "uploadedUnix": "1399936469",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/cf39b8b678e13c4c835bc38b7e4997fcbc575677a633de8a8be489200c8ecb4f/analysis/1408074787/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Snowline-53988-V1.7z?fid=1000108877&ttl=1535837870&ri=8192&rs=8192&setec=72ec6096f53701a21bb80ba7ebc270cb"
    },
    {
      "fileId": "1000108993",
      "name": "The Snowline",
      "version": "V2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3877",
      "fileName": "The Snowline-53988-V2.7z",
      "uploadedUnix": "1400011352",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/937f5e73d2f86fbb6fd9dc06e33e26dbf8050906c69e58b72dfe9cfc2bed883d/analysis/1408075779/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Snowline-53988-V2.7z?fid=1000108993&ttl=1535837871&ri=8192&rs=8192&setec=1b5aacbb5e50b159b7ddd80d0681037a"
    }
  ]
}