{
  "modId": 54018.0,
  "modName": "Better Riftweald",
  "summary": "Makes some small changes to Mercer Frey`s house and his story\r<br />This mod is a Work In Progress",
  "descriptionHtml": "I have loved Skyrim from the moment I first played it, but I find myself Disapointed with the lack of Heavy Armors in game, not the lack of types of heavy armor but the Lack of Faction/Guild Heavy Armors. So I started out to make a Heavy Version of the Thieves Guild Armor.\r<br />Along the Way I realised that it would be so simple to change a few other things too.\r<br />Ever been Disapointed that when you got into Mercers house there was a distinct lack of loot?\r<br />The man has been stealing from the Guild for over 25 years and yet his house is nearly as empty as Breezehome when you first buy it, \r<br />He sets up all those traps, and a special entrance that not many people can use. But what was he protecting? The bust of the Grey Fox? that statue of Dibbella?\r<br />Where are the piles of gold? where are the valuables?\r<br />He`s supposed to be a power hungry man, he`s supposed to be extremely smart, devious, and wealthy. But other than killing Gallus and stabbing you while you lay on the ground unable to move he shows no signs of this hunger for power.\r<br />This mod adds a series of clues to the game that point to a Heavy Armor version of the Thieves Guild armor existing, a prototype if you will. Mercer has left a note near your bed in the Cistern telling the Guild members about his progress towards making this armor become a reality.\r<br />There 4 pieces to the Armor and it is easy to get once you complete the Thieves Guild Quests and the Nightingale Quests. \r<br />Vald has a note on him that will give you the first clue to help you get this armor.\r<br />The second thing this mod does is give Mercer`s secret room a reason to be secret. I have added alot of loot to it and made some minor changes to the layout. \r<br />The reason I placed so much Loot in the final room of the house is because Mercer has been steeling from the guild for over 25 years, and he is supposedly a master thief too, so it stands to reason that he would have gathered alot of gold, and other valuable items. The Armor that Alot of you would probably consider to be over powered is there because Mercer was Power Hungry and wanted to give himself every advantage he could get.\r<br />I tested this mod with over 100 other mods running at the same time and had no problems with it.\r<br />Any comments/advice/change suggestions are welcome.\r<br />Would love to make a quest to go with this mod, but I`m just not good at quests at all. If anyone out there would like to work with me on this I would very much appreciate the help\r<br />I`m too easily distracted by other things to continue working on this mod. Feel free to make any changes to it that you want. All I ask is that you credit me with the inspiration for it if you do so.\r<br />Suggested change would be to make it a quest that leads to the Armor",
  "categoryId": "25",
  "version": "V1.5",
  "author": "Bladeus Leonheart",
  "createdUnix": "1400041878",
  "updatedUnix": "1400135235",
  "containsAdultContent": false,
  "uploadedBy": "Bladeus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109035",
      "name": "Better Riftweald ",
      "version": "V1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "Better Riftweald -54018-V1-0.rar",
      "uploadedUnix": "1400041863",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b76919ed48def3436cdf43fc55d5e9bfe5724b53739d1c4ee4bac1f92b56bfb7/analysis/1408076304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Riftweald%20-54018-V1-0.rar?fid=1000109035&ttl=1535837921&ri=8192&rs=8192&setec=af301fb7b5d8a0f40727afecfb8194e9"
    },
    {
      "fileId": "1000109162",
      "name": "Better Riftweald ",
      "version": "V1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Better Riftweald -54018-V1-5.rar",
      "uploadedUnix": "1400135235",
      "modVersion": "V1.5",
      "virusScanUrl": "https://www.virustotal.com/file/2f0705ed19da6baf08ad90d98a105c92bd3b75fbb7a97b558c63dc7783941049/analysis/1408077680/",
      "changelogHtml": " Added some statues of Dibella to the house <br/> \n Decorated Mercers Secret Room with Different shields and armors from the different holds <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Riftweald%20-54018-V1-5.rar?fid=1000109162&ttl=1535837921&ri=8192&rs=8192&setec=0fbcde0ee519110694132f5426fd59dc"
    }
  ]
}