{
  "modId": 54013.0,
  "modName": "Bryndis Pepperglass - Breton Spell Sword",
  "summary": "Bretons don&#39;t get enough love. Bryndis is here to help. From her red hair to her leather boots, she&#39;s ready to see you to Oblivion and back.",
  "descriptionHtml": "I like the Bretons. They are a great mix of magic and combat and so I created my (first) follower. Bryndis Pepperglass may one day be independently voiced but I am still learning about modding and so that will hopefully come in time.\r<br />\r<br />She is a Breton spell sword, decked out in Thieves Guild armor (though not a member of that Guild herself). Her strengths are the Light Armor, One-handed, Destruction, Sneak and Alteration. She dual-wields ebony war axes (enchanted with Paralyze) by default but in a scrape will diversify with Wall of Storms.\r<br />\r<br />You can pick her up in Rorikstead at the Frostfruit Inn. No quest to get her to follow for now. She can&#39;t wait to be friends with the DB.\r<br />\r<br />The hair is from the Lovely Hairstyles mod ( http://www.nexusmods.com/skyrim/mods/7403/? )  but other than that--she should work just fine in the vanilla game. I have been using her in conjunction with the Amazing Follower Tweaks mod---and she rocks on beautifully. \r<br />\r<br />And sometimes, she&#39;ll go to other ladies in Jarl&#39;s palaces or in Inns and snicker with them. \r<br />\r<br />\r<br />NOTE : Although I deeply recommend the Lovely Hairstyles mod--I did go ahead and create an optional file that uses Vanilla hair. Everything is the same--except the hair. So it shouldn&#39;t require anything special if you download the optional file. You do not need to grab the main file with it.\r<br />\r<br />\r<br />\r<br />NOTE: I cleaned this in Tes5 and with Bryn, I get a strange error: ord NPC_ contains unexpected (or out of order) subrecord SNAM\r<br />\r<br />There are lines and lines of this error--just with different letters on the end. I looked it up online and apparently--it only does that because elements of the mod are not where Tes5 expected them to be. So the mod should work fine if you get this error. It appears to be normal, I guess.\r<br />\r<br />\r<br />\r<br />UPDATE: 13 July 2014\r<br />\r<br />I had to reload my laptop, my game and my mods and upon getting Bryndis back in my game--I discovered that she was all messed up. Because I was so new to modding--I did not realize that in creating her, I had used some texture meshes. So I&#39;ve added them to the Required Files.\r<br />\r<br />The Eyes of Beauty mod by Gabriel Mailhot\r<br />and\r<br />SG Female Textures Renewal by Hello Santa\r<br />\r<br />\r<br />Though, I presume that other texture mods will also work---I just realized that with just the hair and then vanilla textures--she looks like a 40 year old chain smoker.",
  "categoryId": "96",
  "version": "1.0",
  "author": "sailtheplains",
  "createdUnix": "1400047429",
  "updatedUnix": "1401017672",
  "containsAdultContent": false,
  "uploadedBy": "sailtheplains",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109009",
      "name": "BryndisPepperglass",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "87",
      "fileName": "BryndisPepperglass-54013-.zip",
      "uploadedUnix": "1400023620",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/42deacc8f831bcf13ac8df56f39dc7b507720dabf0f59780bd0e23b3d5ef5550/analysis/1408075928/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BryndisPepperglass-54013-.zip?fid=1000109009&ttl=1535837913&ri=8192&rs=8192&setec=905b4ed5a79e9c330d3678fb86436698"
    },
    {
      "fileId": "1000110417",
      "name": "Bryndis Pepperglass - Vanilla Hair",
      "version": "1.0a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "152",
      "fileName": "Bryndis Pepperglass - Vanilla Hair-54013-1-0a.zip",
      "uploadedUnix": "1401017672",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/7d6b61621563ff7d9b3a04b5ee7c0eadf18908ce1cab3a21fb0b49cc0e6164c5/analysis/1408096263/",
      "changelogHtml": " Added a version to download with vanilla hair. Everything else is the same. Labelled it as &#39;optional&#39;. Don&#39;t need the main file. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bryndis%20Pepperglass%20-%20Vanilla%20Hair-54013-1-0a.zip?fid=1000110417&ttl=1535837914&ri=8192&rs=8192&setec=ff33fd506984bc2d25f8418aa3fe97bf"
    }
  ]
}