{
  "modId": 54021.0,
  "modName": "The SPIKE ESM",
  "summary": "If you are having some troubles with your load order, or a mod such as immersive armors, guard dialogue ovehaul, or immersive weapons and the SPIKE.ESM file doesn&#39;t exist in your data folder, HERE YOU HAVE IT&#33;",
  "descriptionHtml": "[font=Comic Sans MS][u][size=5]If you are having some troubles with your load order, or a mod such as immersive armors, guard dialogue overhaul, or immersive weapons and the SPIKE.ESM file doesn&#39;t exist in your data folder, HERE YOU HAVE IT&#33;[/size][/u][/font]\r<br />[size=3]Tips: \r<br />1.download it manually.\r<br />2. Extract it.\r<br />3. Paste the only file (SPIKE.ESM file) inside your data folder and that is all :D[/size]\r<br />\r<br />[u][b][size=4]About this file:\r<br />[/size][/b][/u]\r<br />[size=3]This file was made by [url=http://www.nexusmods.com/skyrim/users/5270699/]Eckss[/url]. He made it for get  a simple way to pass information dynamically between Mods. He wanted a system that would be invisible to players and require nothing more from them than the ability to use Nexus Mod Manager. He also wanted a system that would be easy for he to use as a Mod author and reduce the amount of work he had to do to make his Mods compatible with the work of other authors.\r<br />\r<br />Here It is the full explanation about the file in his article: http://www.nexusmods.com/skyrim/articles/414/? (Yeah, you have to get into and give him a like because he deserves it, and I won&#39;t paste the full article here because doesn&#39;t belongs me)\r<br />\r<br />In short words, thanks to the comment in the previus article, from [/size][url=http://www.nexusmods.com/skyrim/users/5142460]NemesisTheWarlock[/url][size=3] says:[/size]\r<br />\r<br />[size=5][i]&#34;[/i]There are NO mods left that still use SPIKE.esm, if you&#39;re being told you need it, it&#39;s generally an error in the program you&#39;re using as it hasn&#39;t been updated. Otherwise, it can be because you have a patch or merged file which is still reliant on SPIKE.esm. You need to remove/replace/update anything that still uses SPIKE.esm. All of the mods that used to use it have now been upgraded to using SPIKE VE instead and that doesn&#39;t require any extra effort or monitoring on the part of users, it works the way that SPIKE.esm originally worked when Eckss designed it, before the program update that made it a separate, required master file.[i]&#34;[/i][/size]\r<br />[size=3]\r<br />So... that is a good conclution... I suggest to find another way to make the mods work, but if you just need this file because the load order and you can&#39;t edit the warning, use it.[/size]",
  "categoryId": "82",
  "version": "1.0",
  "author": "HircineMANDA",
  "createdUnix": "1400050136",
  "updatedUnix": "1400050320",
  "containsAdultContent": false,
  "uploadedBy": "HircineMANDA",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109046",
      "name": "SPIKE ESM",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "SPIKE ESM-54021-1-0.rar",
      "uploadedUnix": "1400050320",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3b0df974e552ceb45a68a90d8c5ab5ab179d72bc3fdbc1a97c1775f89f543ca2/analysis/1408076404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SPIKE%20ESM-54021-1-0.rar?fid=1000109046&ttl=1535837928&ri=8192&rs=8192&setec=997d55eff1d9dbf0381abfb53386fe5a"
    }
  ]
}