{
  "modId": 54056.0,
  "modName": "Alternate Start - Live Another Life - Deutsch - German",
  "summary": "Das ist die Übersetzung von Arthmoors Mod &#39;Alternate Start - Live Another Life&#39;. Wenn euch die Mod gefällt gebt ihm bitte ein Credit. Er hat sie erstellt und ich habe sie lediglich übersetzt.",
  "descriptionHtml": "Autor: [url=http://www.nexusmods.com/skyrim/users/684492/?]Arthmoor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/9557/?]Original[/url]\r<br />\r<br />Das ist die Übersetzung von Arthmoors Mod &#39;Alternate Start - Live Another Life&#39;. Wenn euch die Mod gefällt gebt ihm bitte ein Endorsement. Er hat sie erstellt und ich habe sie lediglich übersetzt. Die Originalmod wird nicht benötigt, da alle Dateien des Originals im Archiv enthalten sind und an ihnen nur übersetzungstechnisch nötige Veränderungen vorgenommen wurden.\r<br />\r<br />\r<br />\r<br />Beschreibung:\r<br />=============\r<br />&#39;Alternate Start - Live Another Life&#39; fügt viele Möglichkeiten ein den Vanilla-Start in Helgen durch einen alternativen Start zu ersetzen.\r<br />Ihr wählt zuerst eure Rasse und findet euch dann in einer Kerkerzelle mit einer Mara-Statue und einem Bett wieder. Ihr müsst mit der Statue reden um einen Start auszuwählen. Dann müsst ihr euch ins Bett legen und schlafen um den Start zu aktivieren. Ihr könnt euren gewählten Start ändern indem ihr nochmal mit der Statue sprecht (funktioniert nur vor dem Schlafen). \r<br />Um die Hauptquest zu starten, müsst ihr Vanilla-NPCs (Tavernenbesitzer) nach Gerüchten fragen und sie werden euch den Weg weisen. Folgt einfach der Quest.\r<br />Alternativ könnt ihr das Ganze auch abkürzen indem ihr direkt nach Helgen geht und nur die letzten Phasen der Quest macht.\r<br />\r<br />\r<br />Installationsvorraussetzungen:\r<br />===========================\r<br />Es wird lediglich Skyrim mit Patch 1.9.32.0.8 benötigt. Skyrim mit niedrigerem Patch wird nicht unterstützt. Es kann zu CTDs und anderen Problemen führen, wenn ihr diese Mod mit einem geringeren Patch benutzt.\r<br />\r<br />Seit Version 3.0.0 werden alle offiziellen DLCs (Dawnguard, Hearthfire, Dragonborn) benötigt.\r<br />Es gibt noch eine Version 2.5.6, die keine DLCs benötigt. In dieser Version liegt ein Patch für Hearthfire bei. Allerdings wird diese Version von Arthmoor nicht mehr fortgeführt und auch nicht mehr unterstützt.\r<br />\r<br />\r<br />Startoptionen\r<br />============\r<br />Eure Startausrüstung hängt vom gewählten Start ab. \r<br />\r<br />Mit dem Schiff nach Himmelsrand kommen\r<br />---------------------------------------------------------\r<br />Ihr startet am Hafen von Einsamkeit/Dämmerstern/Windhelm. Ihr habt einige Basis-Vorräte, Mittelschichtkleidung und eine angemessene Menge Gold.\r<br />\r<br />Grundbesitzer\r<br />------------------\r<br />Ihr startet mit einem voll eingerichteten Haus in Markarth/Weißlauf/Einsamkeit/Rifton (Windhelm ist nicht inbegriffen, da einige Vanilla-Quests [u.a. die Bürgerkriegsquestreihe] direkt mit dem Haus dort verknüpft sind). Bei jedem Haus werdet ihr mit eurem Status entspechender Kleidung und etwas Gold starten. Außerdem wird es in einer Kiste in eurem Schlafzimmer eine Auswahl von Waffen geben, die zur gewählten Stadt passen. Desweiteren könnt ihr auch einen Bauernhof als Grundbesitz wählen. Der Hof befindet sich südöstlich von Drachenbrügge an der Hauptstraße und ist vollständig eingerichtet. Zum Hof gehören auch einige NPCs, die den Hof für euch bewirtschaften. Der Hof wird regelmäßig Einkommen generieren, das ihr bei euren Arbeitskräften abholen könnt.\r<br />WICHTIG: Wenn ihr mit Grundbesitz in einer Stadt startet, könnt ihr in dieser Stadt nicht mehr Thane werden.\r<br />\r<br />Mitglied einer Gilde\r<br />--------------------------\r<br />Ihr könnt als neues Mitglied in einer der folgenden Gilden anfangen:\r<br />\r<br />- Diebesgilde: Ihr beginnt in der Zerbrochenen Flasche und seid gerade  aus dem Rattenweg gekommen. Sprecht mit Brynjolf um den Handel zu beschließen.\r<br />\r<br />- Dunkle Bruderschaft: Ihr startet unmittelbar im Heiligtum in Falkenring und müsst nur mit Astrid sprechen um den Prozess zu vollenden.\r<br />\r<br />- Die Akademie von Winterfeste: Ihr startet draußen vor der Halle der Elemente und müsst mit Mirabelle Ervine sprechen um fortzufahren.\r<br />\r<br />- Die Gefährten: Ihr beginnt in Jorvaskr und müsst draußen mit Vilkas trainieren. \r<br />WICHTIG: Ihr müsst den Faustkampf bis zum Ende ansehen, bevor Vilkas mit euch zum trainieren rausgeht.\r<br />\r<br />- Die Dämmerwacht: Ihr startet in Festung Dämmerwacht und seid gerade vom Hof Harkons zurückgekehrt. Nun müsst ihr Gunmar und Sorine Jurard für die Dämmerwacht rekrutieren.\r<br />\r<br />- Volkihar-Vampire: Ihr startet in Festung Volkihar gleich nachdem ihr zum Vampirlord gemacht wurdet\r<br />\r<br />\r<br />Stammgast in einer Herberge\r<br />---------------------------------------\r<br />Ihr startet in der von euch gewählten Herberge. Beachtet dass einige in gefährlichen Gegenden liegen.\r<br />\r<br />Gesetzloser in der Wildnis\r<br />-----------------------------------\r<br />Ihr startet als Mitglied einer Gruppe Banditen und habt ein Kopfgeld von 500 Gold in dem Fürstentum, in dem ihr startet (wird zufällig ausgewählt). Die Banditen eurer Gruppe werden euch nicht angreifen, solange ihr sie nicht verärgert.\r<br />\r<br />Soldat in einer Armee\r<br />------------------------------\r<br />Ihr startet als Rekrut bei den Sturmmänteln oder der Kaiserlichen Legion, je nachdem wie ihr wählt. Ihr habt gerade die erste Quest der jeweiligen Armee abgeschlossen und sollt nun die Zackenkrone bergen.\r<br />WICHTIG: Ihr müsst unbedingt die die Zackenkronen-Szene auspielen lassen, ansonsten kann es passieren, dass die Quest nicht startet und die komplette Bürgerkriegs-Questreihe unspielbar wird.\r<br />\r<br />Lager in den Wäldern\r<br />-----------------------------\r<br />Ihr startet als einsamer Jäger in den Wäldern südlich von Helgen.\r<br />\r<br />Schiffbruch vor der Küste von Himmelsrand\r<br />------------------------------------------------------------\r<br />Ihr startet im Wrack des Schiffes auf dem ihr Passagier wart. Das Schiff erlitt Schiffbruch an einem Eisberg und ihr seid der einzige Überlebende. Wenn ihr Survival-Mods mit Hypothermia-Modulen benutzt, müsst ihr sehr vorsichtig sein, da ihr sonst schnell erfrieren könnt.\r<br />\r<br />Überfallen und als Toter zurückgelassen\r<br />-------------------------------------------------------\r<br />Ihr startet in einer abgelegenen Gegend. Ihr wurdet überfallen und ausgeraubt. Man hielt euch für tot und ließ euch liegen als Fraß für die Tiere.\r<br />\r<br />Vampir in einer einsamen Höhle\r<br />-------------------------------------------\r<br />Ihr startet als Vampir in einer Höhle. Die anderen Vampire in der Höhle sind normalerweise friedlich, es sei denn sie werden verärgert. Sollten sie dennoch grundlos angreifen, ladet einfach neu dann funktioniert es wieder.\r<br />\r<br />Totenbeschörer in einem geheimen Versteck\r<br />------------------------------------------------------------\r<br />Ihr startet als Totenbeschwörer in einem Labor in Schwarzweite, da sich eure Vorräte dem Ende zuneigen, beschließt ihr nach draußen zu gehen um neue Vorräte zu beschaffen und zu sehen was draußen so los ist.\r<br />Faire Warnung: Außerhalb eures Labors befindet sich eine Dwemersphäre (Vanilla-Übersetzung: Zwergensphäre). Daher solltet ihr euch überlegen, wie ihr vorgeht.\r<br />\r<br />Wächter von Stendarr\r<br />------------------------------\r<br />Ihr startet als Mitgleid der Wächter in der Halle der Wachsamkeit. Wenn Dawnguard installiert ist, wird die Halle trotzdem später niedergebrannt.\r<br />\r<br />Leibeigener eines Hexenmeisters\r<br />----------------------------------------------\r<br />Ihr beginnt in der Steinfallhöhle, die zwei Hexenmeister ihr Heim nennen. Außer einer einfachen Robe und einem Eisendolch besitzt ihr einen mächtigen magischen Ring, der euch Magieresistenz gibt.\r<br />\r<br />Aus der Zelle fliehen\r<br />----------------------------\r<br />Wenn igr diese Startoption wählt, werden im Seelensteinhalter 3 Dietrieche erscheinen, knackt das Schloss und erringt eure Freiheit. Das Spiel startet, sobald ihr die Treppe hochgeht. Bevor ihr die Treppe rauf seid, könnt ihr immer noch zurück zur Mara-Statue gehen und einen anderen Start auswählen. Habt ihr erst einmal die Treppe erklommen, habt ihr euch festgelegt.\r<br />\r<br />Leben in einer Orkfestung\r<br />------------------------------------\r<br />(Nur wenn ihr als Ork spielt) Ihr startet in der Orkfestung Dushnikh Yal, obwohl die anderen Orks sich euch gegenüber friedlich verhalten, betrachten sie euch als Außeseiter. Ihr startet mit einer vollständigen Orkrüstung und einer Orkkampfaxt.\r<br />\r<br />Wache einer Khajiitkarawane\r<br />----------------------------------------\r<br />(Nur wenn ihr als Khajiit spielt) Ihr habt lange Zeit als Wache für die Karawane gearbeitet, dennoch hat der Karawanenführer eine neue Wache angeheuert und euch entlassen.\r<br />\r<br />Mitglied der Abgeschworenen\r<br />-----------------------------------------\r<br />(Nur wenn ihr als Bretone spielt) Ihr startet als Abgeschworener in Reach.\r<br />\r<br />Hafenarbeiter\r<br />-------------------\r<br />(Nur wenn ihr als Argonier spielt) Ihr startet als Dockarbeiter in Windhelm.\r<br />\r<br />Mitglied der Alik&#39;r\r<br />------------------------\r<br />(Nur wenn ihr als Rothwardone spielt) Ihr startet als ehemaliges Mitglied der Alik&#39;r. Unzufrieden mit eurem Leben in Hammerfell habt ihr euch den Alik&#39;r angeschlossen und seid mit ihnen zu einer Mission nach Himmelsrand aufgebrochen. Doch die Dinge waren nicht so wie sie schienen und nun geht ihr eure eigenen Wege.\r<br />\r<br />Flüchtling aus Morrowind\r<br />-----------------------------------\r<br />(Nur wenn ihr als Dunkelelf spielt) Ihr startet als Dunmer-Flüchtling in Windhelm. \r<br />\r<br />Flüchtling in Solstheim\r<br />--------------------------------\r<br />(Nur wenn ihr als Dunkelelf spielt UND Dragonborn installiert ist) Ihr startet als Dunmer-Flüchtling in Rabenfels. Diese Option ersetzt die &#39;Flüchtling aus Morrowind&#39;.\r<br />\r<br />Agent der Thalmor\r<br />--------------------------\r<br />(Nur wenn ihr als Hochelf spielt) Ihr startet in der Botschaft der Thalmor.\r<br />\r<br />Kindheitsfreund von Erik dem Töter\r<br />-------------------------------------------------\r<br />(Nur wenn ihr als Nord spielt)  Ihr beginnt in der Taverne von Rorikstatt. Eriks Miniquest ist bereits abgeschlossen und er steht euch als Begleiter zur Verfügung. Ihr habt die gleiche Ausrüstung wie Erik.\r<br />\r<br />Überrasch mich.\r<br />----------------------\r<br />Wählt einen der obigen Starts zufällig aus. (Wird auch gewählt wenn ihr die Statue verlasst ohne zu wählen)\r<br />\r<br />\r<br />Bekannte Probleme und Inkompabilitäten stehen in der ReadMe.",
  "categoryId": "24",
  "version": "3.1.4",
  "author": "Arthmoor",
  "createdUnix": "1400152223",
  "updatedUnix": "1468408530",
  "containsAdultContent": false,
  "uploadedBy": "Muddin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000149484",
      "name": "Alternate Start - Live Another Life-2-5-6-DV",
      "version": "2.5.6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4514",
      "fileName": "Alternate Start - Live Another Life-2-5-6-DV-54056-2-5-6.7z",
      "uploadedUnix": "1425123254",
      "modVersion": "2.5.6",
      "virusScanUrl": "https://www.virustotal.com/file/97dbbf31af23d4200fb93a50a24b39f6f41b076314699db0c02d497b447b4109/analysis/1425123306/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Start%20-%20Live%20Another%20Life-2-5-6-DV-54056-2-5-6.7z?fid=1000149484&ttl=1535837978&ri=8192&rs=8192&setec=1c2bca4454773990c380d3ad88a60858"
    },
    {
      "fileId": "1000186143",
      "name": "Alternate Start - Live Another Life-3.0.7",
      "version": "3.0.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4468",
      "fileName": "Alternate Start - Live Another Life-3.0.7-54056-3-0-7.7z",
      "uploadedUnix": "1448558999",
      "modVersion": "3.0.7",
      "virusScanUrl": "https://www.virustotal.com/file/1d7a1f599669fbb4d9cd01e59979da6377d7df6466876826387d26fb7889e70e/analysis/1448559018/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Start%20-%20Live%20Another%20Life-3.0.7-54056-3-0-7.7z?fid=1000186143&ttl=1535837979&ri=8192&rs=8192&setec=6d9341fbe3b43cef0070d4d7f552eec8"
    },
    {
      "fileId": "1000192878",
      "name": "Alternate Start - Live Another Life-3.1.1",
      "version": "3.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4765",
      "fileName": "Alternate Start - Live Another Life-3.1.1-54056-3-1-1.7z",
      "uploadedUnix": "1453819314",
      "modVersion": "3.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2797fe458061d4c3b6889bb53a0c6047e6be72248273dedb42ec31bd3ad8a10f/analysis/1453819326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Start%20-%20Live%20Another%20Life-3.1.1-54056-3-1-1.7z?fid=1000192878&ttl=1535837979&ri=8192&rs=8192&setec=a01eeb931dfa152a766ab42e4bb4c459"
    },
    {
      "fileId": "1000213057",
      "name": "Alternate Start - Live Another Life-3.1.4",
      "version": "3.1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4968",
      "fileName": "Alternate Start - Live Another Life-3.1.4-54056-3-1-4.7z",
      "uploadedUnix": "1468408530",
      "modVersion": "3.1.4",
      "virusScanUrl": "https://www.virustotal.com/file/4caeac0086ff1f7aa7cca65e52d89e57f25acc1281baef4178e4dd675741d1af/analysis/1468408565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Start%20-%20Live%20Another%20Life-3.1.4-54056-3-1-4.7z?fid=1000213057&ttl=1535837979&ri=8192&rs=8192&setec=977c207a3a47af203e8166ef9e7ad46f"
    }
  ]
}