{
  "modId": 54054.0,
  "modName": "Karo&#39;s Cairn",
  "summary": "A Unique fully exterior dwemer home floating in the reach, to access it you must jump across platforms that appear and disappear ",
  "descriptionHtml": "A Unique fully exterior dwemer home floating in the reach, to access it you must jump across platforms that appear and disappear. the home has a unique arrangement of dwemer style crafting tools (except for a smelter)on the back porch, inside the house you will find a simple cozy home with a butterfly cage a nice fire and a comfy solid stone bed along with plenty of storage options.\r<br />the house is located between  skyhaven temple and the lover stone, the easiest way to reach it would be to climb the hill southeast of the lover stone and click the stone pull lever on the inside of the dwemer arch you find, and get ready to start jumping (originally it was almost impossible to make it so i made it a lot easier). \r<br />\r<br />when fast traveling to the house your horse will appear directly underneath the island by the river\r<br />\r<br />the house itself has been untouched since the time of the dwemer so the doors are still locked with master locks but you can find the hidden key somewhere on the island if you cant pick the lock. \r<br />\r<br />Key location riddle from the keys perspective: I hear constant running and endless hunger during all hours and I am stone cold\r<br />\r<br />there are several secrets\r<br />\r<br />Requires\r<br />Dragonborn\r<br />Hearthfire\r<br />Dawnguard\r<br />and the will to download it&#33;&#33;",
  "categoryId": "67",
  "version": "1.0",
  "author": "Oldnotweak",
  "createdUnix": "1400145719",
  "updatedUnix": "1400145712",
  "containsAdultContent": false,
  "uploadedBy": "oldnotweak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109164",
      "name": "Karo&#39;s Cairn",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "441",
      "fileName": "Karo's Cairn-54054-1-0.rar",
      "uploadedUnix": "1400145712",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f3e0d79a5b33f68b4e25ecd1f13abb28465fa46d7ce4226203f523d16e1bb2a1/analysis/1408077682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Karo%27s%20Cairn-54054-1-0.rar?fid=1000109164&ttl=1535837976&ri=8192&rs=8192&setec=53a835044e0d246d5c0147c68ec2c4f3"
    }
  ]
}