{
  "modId": 54052.0,
  "modName": "Whiterun Feminizer - WIP",
  "summary": "Uses CK to change all males in Whiterun to females, and then to visually enhance all females to characters with ApachiiSkyHair and Visually appealing faces.",
  "descriptionHtml": "So, I&#39;m not new to modding, but I am new to this website, as well as the Nexus community, so I&#39;d like to upload one of the newer mods that I&#39;m working on for the enjoyment of the community.\r<br />\r<br />A long while back, I realized that it would be genuinely wonderful if all characters in Skyrim were 100% female. I then decided that I would love to take on this task, as well as the task of getting voice-overs to modify the sounds that came out of the female-turned character&#39;s mouths. I realize that this project is a long and arduous task, but I am perfectly willing to modify each and every humanoid NPC, be it a Bandit, Jarl, Commoner, or dead body, into a female version of said character. I&#39;ve even decided that I am going to take it one step farther and implement the usage of ApachiiSkyHair and attach that to each and every character as well.\r<br />\r<br />I&#39;m starting with Whiterun, and you can expect a total of 3 versions of this to come out of what I am producing here. \r<br />\r<br />1. All Female with ASH\r<br />2. All Female with ASH - No Orcs, Elves, Argonians, or Kajiit. \r<br />3. All Female Vanilla (That is to say, No Apachii Skyhair requirement)\r<br />\r<br />You can expect me to work on the mod quickly, but the creation of the voice-over aspect will take me a larger, more lengthy amount of time.\r<br />\r<br />Until it&#39;s official release in two weeks or so, I will be uploading a single character&#39;s file for a little sneak peek at what the game will end up looking like. I will update this entire post at the time of full release.\r<br />\r<br />",
  "categoryId": "79",
  "version": "Pre.Alpha",
  "author": "A-T-",
  "createdUnix": "1400129556",
  "updatedUnix": "1400129556",
  "containsAdultContent": true,
  "uploadedBy": "AlphaTadpole",
  "primaryFile": null,
  "files": []
}