{
  "modId": 54068.0,
  "modName": "Simple Cow and Goat Milking",
  "summary": "Adds an animated interaction that lets you milk cows and domestic goats once a day. Requires Hearthfire",
  "descriptionHtml": "REQUIRES THE HEARTHFIRE EXPANSION\r<br />\r<br />\r<br />Have you ever wanted to simply walk up to a cow in a farm and milk it to stave off death added by a hunger and thirst mod? Or just wanted extra jugs of milk for crafting?\r<br />\r<br />Well now you can. This mod adds the ability for you to walk up, activate a cow or goat, and watch a brief animation before you receive a jug of milk. That&#39;s it. There have been a few milking mods out there but they tended to add so much extra stuff that I had no interest in. This mod just adds the interaction.\r<br />\r<br />You can milk them once a day. If you try again after that you&#39;ll receive a simple message telling you off.\r<br />\r<br />It affects all basic cows and domesticated goats in the game (You can&#39;t milk wild goats and frankly you shouldn&#39;t try). It will also affect any mod placed goats and cows so long as it uses the same type of cow and goat npc. For example, the animals added in [url=http://www.nexusmods.com/skyrim/mods/37460/?]Dawn of Whiterun[/url] work fine with this mod.\r<br />\r<br />[u]Issues:[/u]\r<br />\r<br />Sometimes cow and goat animations can get a little weird.\r<br />The placement of the helpful bucket can also get a little weird when milking goats.\r<br />Otherwise it works fine.\r<br />\r<br />\r<br />[u]Future Plans:[/u]\r<br />\r<br />I dunno, compatibility for Skytest or other animal mods if I think it&#39;s needed.\r<br />\r<br />Possibly the ability to milk mammoths with the addition of a new mammoth milk item (for crafting into mammoth cheese of course) if I can figure out how the script works with them. Compatibility with RND and whatever would be a pain though.\r<br />\r<br />[u]Credit[/u]\r<br />\r<br />To berticus0001 who made the milking script this mod uses. I just took it and stuffed it into an extremely simplistic mod.\r<br />You can find his full mod and his resources here: [url=http://www.nexusmods.com/skyrim/mods/25239/?]http://www.nexusmods.com/skyrim/mods/25239/?[/url]",
  "categoryId": "24",
  "version": "1.0",
  "author": "lightningo",
  "createdUnix": "1400188532",
  "updatedUnix": "1400187523",
  "containsAdultContent": false,
  "uploadedBy": "lightningo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109213",
      "name": "Simple Cow and Goat Milking",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Simple Cow and Goat Milking-54068-1-0.rar",
      "uploadedUnix": "1400187523",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a2e3c1e1ab950ce3e646a9e21cb80ebbc7758f1fe905a0a7dbf748edd570e2b3/analysis/1408078246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Cow%20and%20Goat%20Milking-54068-1-0.rar?fid=1000109213&ttl=1535838000&ri=8192&rs=8192&setec=e676494d1570668261069427e1a3ba6b"
    }
  ]
}