{
  "modId": 54095.0,
  "modName": "Goddesses of Skyrim by Kingslayer and MODinsane Upload",
  "summary": "This mod add&#39;s 6 sexy follower&#39;s to the game. \r<br />A new goddess can be found in Riverwood,ENJOY&#33; \r<br />\r<br />THIS MOD REQUIRES APACHII SKYHAIR&#33; \r<br />With out the hair the game will crash,the link for it can be found below. \r<br />This mod also work&#39;s with UFO and EFF and any other follower based mod. If you have ctd&#39;s",
  "descriptionHtml": "Kingslayer: The followers all use vanilla assets. No other mods were used other then the apachii hair mod. But the files themselves are not in the mod. Thats why having the apachii hair mod installed is a requirement. MODinsane is using UNPB Redux Project with the followers and works well. Pretty much Standalone Bodies.\r<br />\r<br />Armor MODs used, giving credit to the authors:\r<br />Medusa Armor http://skyrim.nexusmods.com/mods/31229\r<br />Blood Witch Armor http://skyrim.nexusmods.com/mods/21572\r<br />If you want the girls took look as they do in the pictures on Steam Workshop, check out this mod as well http://skyrim.nexusmods.com/mods/3563\r<br />\r<br />*Jasmin is a scout (Good one too and knows the bow well)\r<br />\r<br />*Chelsie is a spellsword (Bloodwitch Armor) http://skyrim.nexusmods.com/mods/21572\r<br />\r<br />*Allison favors a sword and shield (Special armor, but can be exchanged)\r<br />\r<br />*Veronica is assassin/ranger (She will slit your throat a good sneak)\r<br />\r<br />*Rayne is a sorcerer.\r<br />\r<br />*Hayden is a sorcerer. &#34;She can be found in Riverwood in the sleeping giant inn.&#34; (If she is naked in the inn, no matter, when you exit she will be wearing her attire) A powerful sorcerer.\r<br />\r<br />These new follower&#39;s can all be found in the great city of Whiterun.&#34;Except for Hayden&#34; \r<br />Check in the hall of the dead and taverns to locate them. \r<br />\r<br />All six girl&#39;s will level up with you and cast healing spells on themselves outside of combat. They are also essential so you won&#39;t have to restart the game if they some how step on to a trap. \r<br />\r<br />MODinsane: Tested these followers many hours ingame using EFF and all of them are currently housed in my game, Proudspire Manor using EFF. Armor can be changed according to whatever you choose and weapons according to their stats. The MOD originally is found on Steam and NOWHERE else. Ask Kingslayer any questions here or on Steam Workshop and player experience question MODinsane. MODinsane or Kingslayer will &#34;try&#34; to get pictures up on Nexus from Steam images ASAP.",
  "categoryId": "96",
  "version": "1",
  "author": "Kingslayer",
  "createdUnix": "1400301082",
  "updatedUnix": "1400301082",
  "containsAdultContent": false,
  "uploadedBy": "MODinsane",
  "primaryFile": null,
  "files": []
}