{
  "modId": 54100.0,
  "modName": "Noble Savage Orcish Armor and Weapons",
  "summary": "An overhaul of the orcish weapon and armor set in a bid to make it more lore-friendly",
  "descriptionHtml": "It really bugged me that in TES lore orcs are supposed to be the best armour smiths in Tamriel and yet in Skyrim orcish armour and weapons are clunky and ugly. \r<br />\r<br />According to the lore, orcs supposed to take great pride in their smithing work, as culturally it&#39;s their main creative outlet, and of course, armour has great significance because combat and strength are a key component of orcish culture. I felt older interpretations of orcish gear in Oblivion and, in particular, Morrowind, were more appropriate. \r<br />\r<br />However, I didn&#39;t actually have a problem with the model for orcish armour in Skyrim, more that the texture was far too plain and the whole set lacked any ornate design as we&#39;ve seen previously.\r<br />\r<br />So, I&#39;ve retextured the orcish armour (including the shield) for both males and females. It uses the same model but with inspiration in colours, textures and themes from Morrowind&#39;s orc armour set.\r<br />\r<br />Primarily this mod is a texture replacer. You can simply install the armour texture files in your Skyrim data folder and you&#39;ll get the new armour appearance. I&#39;ve also included an optional .esp to add a light armour variant of orcish -  this is not added to levelled lists, so won&#39;t appear in shops or as loot, it is simply present in the game and should be craftable at a forge or can be added via the console.\r<br />\r<br />The light armour version is there for a handful of reasons:\r<br />\r<br />1) Having options is always a good thing in my book\r<br />2) Orcish armour in previous TES games was classed as medium, not heavy\r<br />3) Orcish armour in previous TES games, notably Morrowind, was inspired by Japanese armour and my retexture has attempted to replicate some of these stylistic features. Japanese armour is relatively lightweight compared to western armour styles due to its composite nature of many linked plates and the abundance of lacquered leather.\r<br />\r<br />I also heartily recommend VaynardTheWhiteWolf&#39;s Orc Tribes Wear Orcish Armor mod to equip orcish armour on orc tribespeople.\r<br />\r<br />Elements of the design:\r<br />So in terms of what remains of the original armour style, obviously the overall shape, but primarily the breast plate (or plates) is still present with an etched decorative design - this is an attempt to mimic the Morrowind set and its decorated chest piece. The large shoulder guard and collar plate has been given a bronze colour and some segmented panels in-line with the Morrowind shoulder pieces, while the shoulder guards going down the arm have also been bronzed - but are now made from numerous plates stitched together like a Japanese sode. This design has been extended to the thigh guards (or tassets) just like Japanese Kusazuri. The quilted pants have been re-coloured to match the Morrowind sets dark red, while the sleeves are now a dark metal scale design.\r<br />\r<br />The helmet has a coloured plume (black was a bit boring) and again more bronze elements. I&#39;ve also added a slightly purplish-blue metal to some segments of the helmet&#39;s front to mimic colouration on the Morrowind set. The gauntlets have some more patterned decoration, bronzed edging and bronzed fingerplates, meanwhile the boots have patterned decoration and some bronzed detailing.\r<br />\r<br />The shield has bronze detailing and more closely matches the armour&#39;s desaturated mossy green colour, it also has a large bronze spike plate for bashing. The female armour is mostly the same as the male, there are a few small stylistic changes simply for diversity&#39;s sake - for example, the shoulder spikes use the same cobalt-blue as the decorative panels on the helm, and the gloves have the whole bracer patterned rather than just a section of it, as on the male gauntlets.\r<br />\r<br />Weapon Plans:\r<br />While the armour model was in my view workable, I felt the vanilla weapons were just terrible as they looked far too crude. Even though orcs are renowned armour smiths rather than weaponsmiths, there are lore descriptions which say their weapons receive the same care and ornate decoration as the armour, not to mention the fact that smithing skills have some crossover, so the idea that excellent armour smiths can only make sucky weapons is a bit daft IMO. \r<br />\r<br />Although orc weapons are supposed to be more simplistic in design than weapons from other races, I think having them as roughly hewn blocks of metal was going a bit too far - they needed to look more functional, as well as having more ornamentation.\r<br />\r<br />I am in the process of obtaining permissions from various Nexus authors to use their models and modified versions of their textures in order to create a weapon replacer pack. This will be an optional add-on (complete with meshes, textures and an .esp) to replace the orcish vanilla weapons with entirely new models which I feel are more appropriate and a texture set which compliments the armour texture I have created.\r<br />\r<br />Compatibility:\r<br />As far as I&#39;m aware there should be no conflicts from this mod. As with any texture pack which modifies vanilla textures, the most recently installed mod will overwrite any others, so feasibly this could override or be overridden by any other mod which modifies orcish armour and/or textures. The optional light armour.esp shouldn&#39;t conflict with anything as far as I can tell.\r<br />\r<br />I should note two things. \r<br />\r<br />Firstly, the armour texture will apply itself to any other item which uses the vanilla orcish texture. So far, I&#39;ve observed this includes HothTrooper&#39;s excellent Warchief armour, as this uses some orcish armour mesh components and the vanilla textures. I quite like the effect, but you may not - just something to be aware of if you use that mod too.\r<br />\r<br />Second, I am making the optional weapon replacer in such a way that it should not conflict with any of the mods from which it will draw models - it simply selects the new meshes for the vanilla weapons and introduces a secondary textureset which applies to the orcish weapons only.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Mungo",
  "createdUnix": "1400319717",
  "updatedUnix": "1400319717",
  "containsAdultContent": false,
  "uploadedBy": "mungo",
  "primaryFile": null,
  "files": []
}