{
  "modId": 54179.0,
  "modName": "BASE- Balanced Alchemy Smithing and Enchanting",
  "summary": "The ultimate modification patch to balance the crafting diversions. \r<br />",
  "descriptionHtml": "The ultimate modification patch to balance the crafting diversions. \r<br />\r<br />What does this mod do?\r<br />1. Fortify Smithing and Alchemy armor enchants and potions removed from game. (its for the best)\r<br />2. Nerfs crafting perks in a simplistic way that makes crafting use less perk points (altogether 8 perk points saved from simplifying crafting perks)\r<br />3. Elegantly re-worded the nerfed perks.\r<br />\r<br />What this mod does NOT do.\r<br />No scripts. No new and confusing perks that you have to learn, just nerfed crafting perks in the same vanilla slots. \r<br />\r<br />Aren&#39;t there other mods like this? \r<br />Yes. But they are too ambitious and require new things to be learnt. I favor simplistic mods that get the job done.\r<br />\r<br />Why did I make this mod?\r<br />So many reasons, I have a type of video game obsessive disorder that forces me to always have the best gear possible. In this case it is crafting a 800 damage Stalhrim bow with 300 damage chaos/frosteed enchants (legit). With this mod, unique equipment and loot has a chance to outclass, which is exciting to me because I&#39;ve always used player made items because I knew it was superior, don&#39; t worry crafting is still needed because you can improve most unique weapons too&#33;  Because this also nerfs the archer and warrior (needed), the mage also is more viable. It also makes crafting more enjoyable as you don&#39;t have to swap your armor to your &#34;Alchemy Clothes Set&#34; which was a hassle. It also makes Mage armor such as ebony flesh more viable because it is now more of a fun struggle to get armor capped. I am excited to play my game with this patch and I hope you are to.\r<br />\r<br />1.0 Creation Patch Notes  \r<br />ALCHEMY\r<br />Fortify alchemy can no longer be found on armors. (its for the best)\r<br />Alchemist, physician, poisoner & benefactor have been reduced to from 25% to 10%. Alchemist (first alchemy perk) only has one rank now.\r<br />\r<br />SMITHING\r<br />Smithing perks reduced to 10% improvement (previously double improvement). Smithing perks wording changed to be more clear.\r<br />Fortified smithing can no longer be found on armor and potions. (its for the best)\r<br />\r<br />ENCHANTING\r<br />Perks reduced from 25% to 10%. Enchanter (first enchanting perk) only has one rank now.\r<br />",
  "categoryId": "84",
  "version": "1.0",
  "author": "Qwesar",
  "createdUnix": "1400505551",
  "updatedUnix": "1400505545",
  "containsAdultContent": false,
  "uploadedBy": "Qwesar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109658",
      "name": "BASE_Balanced-Alchemy-Smithing-Enchanting",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "BASE_Balanced-Alchemy-Smithing-Enchanting-54179-1-0.rar",
      "uploadedUnix": "1400505545",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4ea13774dff3351f9c3e607fd5db1a1724dd637e54ae95b2cb0ee01b8cdf89b6/analysis/1408085048/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BASE_Balanced-Alchemy-Smithing-Enchanting-54179-1-0.rar?fid=1000109658&ttl=1535838188&ri=8192&rs=8192&setec=ca03595b39404425c48b1e688dc13174"
    }
  ]
}