{
  "modId": 54195.0,
  "modName": "BattleHorn Castle Exterior",
  "summary": "Battlehorn in skyrim",
  "descriptionHtml": "I have attempted to add Battlehorn to skyrim&#33; I wanted a close replica and came up with this, before I gave up. This file is incomplete but I hope someone will pick it up in the near future and make a close replica to my favorite home from oblivion. If my dream comes true and somebody does pick this up, Please contact me when you are done my email is yourking77@gmail.com. The project itself is located in the middle of the lake north of Lakeview manor, follow the river south west of riverwood. I gave up on the inside so the exterior is nearly complete.\r<br />\r<br />What I was attempting. (and what I hope someone will pick up)\r<br />-A complete reconstuction of the original fighters stronghold dlc from oblivion.\r<br />-stock textures from Skyrim. (no custom ones if you can avoid it)\r<br />-I do want retextured flags and armor. (I used ones from solitude)\r<br />-I would like somebody to make custom .nif mesh files. (I don&#39;t know how)\r<br />-Working furniture. (from weapon racks to chairs and mannequins I want all the furniture to be interactive.)\r<br />-I also wanted a custom back story without changing the castle. (something so it makes sense why it is in Skyrim)\r<br />-beautified surroundings.\r<br />\r<br />Because I am not as experienced as some of the other modder&#39;s out there I do not know how to make NIF. files and so I used all in game static meshes, I tried to hid the seems the best I could and for what it is, it is good, but the interior is near impossible to complete that way so i am asking for help. \r<br />\r<br />",
  "categoryId": "67",
  "version": "",
  "author": "Carter_Baker",
  "createdUnix": "1400545220",
  "updatedUnix": "1400545215",
  "containsAdultContent": false,
  "uploadedBy": "yourking77",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109727",
      "name": "Battlehorn Castle",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "142",
      "fileName": "Battlehorn Castle-54195-.zip",
      "uploadedUnix": "1400545215",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6e81cadafa9057a76ef903668dfa4fb43b5dbc1595d175f5a73b0552584fce69/analysis/1408086130/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battlehorn%20Castle-54195-.zip?fid=1000109727&ttl=1535838215&ri=8192&rs=8192&setec=fe567152a864a0e11ca6028aa414c780"
    }
  ]
}