{
  "modId": 54213.0,
  "modName": "SKIP - Skyrim C(k)omplete Immersion Project",
  "summary": "Making Skyrim Immersive and Realistic as possible while staying lore-friendly",
  "descriptionHtml": "[size=3]As said above, the goal of this project is to make Skyrim as Immersive and Realistic as possible\r<br />while staying lore friendly. This means that this project will NOT\r<br />include mods that:\r<br />[/size][size=3]1. Change the flora of the game. Turning the valley around Whiterun into a grassland or forest\r<br />is not lore friendly and breaks immersion. The valley is supposed to\r<br />tundra, and that is what it is in vanilla skyrim.\r<br />[/size][size=3]2. Too many people to the land of Skyrim. Skyrim is supposed to be one of the least populated\r<br />provinces in Tamriel.\r<br />[/size][size=3]3. More things to Skyrim that does not fit the way Skyrim is supposed to be ( I can&#39;t think of\r<br />them now, I may add them later)[/size]\r<br />[size=3]Note: This is a work in progress. As I get feedback and more immersion mods are released,\r<br />this guide will change.[/size]\r<br />[color=#ff3333][size=3]\r<br />Stop[/size][/color][size=3]:If you are a beginner modder, watch gopher&#39;s [/size][size=3][url=http://www.nexusmods.com/skyrim/videos/126/?]Beginner&#39;s Guide to Modding Skyrim[/url].[/size]\r<br />[size=3]Gopher will take you through all the basics you need to mod your game successfully.[/size]\r<br />[size=6][color=#ff3333][size=3]Note[/size][/color][size=3]:It is [/size][color=#ff3333][size=3]Highly Recommended[/size][/color][size=3]that you read GrandBulwark&#39;s [url=http://www.nexusmods.com/skyrim/mods/32363/?]Skyrim Project Stabiltiy[/url] Guide. Following his advice increase thestability of your game, especially important if you decide to mod it\r<br />heavily.[/size][/size]\r<br />[size=3]\r<br />Note: These mods DO NOT INCLUDE survival mods (such RND and Frostfall). The reason is that\r<br />those mods are very script heavy because they are using scripts to\r<br />add new stats into the game that have to be tracked and modified. If\r<br />you are interested, I will list recommended hardcore survival mods at\r<br />the end.[/size]\r<br />[size=3]\r<br />Part 1: Immersion Fixes[/size]\r<br />[size=3]\r<br />The following mods fix problems with Skyrim that break immersion.[/size]\r<br />[size=3]\r<br />Part 1-A: An Immersive Interface[/size]\r<br />[size=3]\r<br />One of the biggest problems with immersion in Skyrim is the interface that gets in your\r<br />face and your ears every moment of play. It is the most immediate\r<br />sign that your not in another world but playing a game, and this part\r<br />is supposed to fix that problem.[/size]\r<br />[size=3]\r<br />Problem I: The HUD Breaks Immersion.\r<br />[/size][size=5][size=3]Solution: [url=http://www.nexusmods.com/skyrim/mods/3222/?]Immersive Hud[/url], by Gopher[/size][/size]\r<br />[size=3]\r<br />This is easy to fix, Gopher&#39;s Immersive HUD is essential to making the game immersive,\r<br />without this mod, this whole guide is meaningless.[/size]\r<br />[size=3]\r<br />Optional: If you don&#39;teven want to see the status bars, then download Appolodown&#39;s\r<br />Important Information Overhaul. This will give you visual effects to\r<br />replace the status bars. Personally I don&#39;t play with it because I\r<br />don&#39;t mind the bars.[/size]\r<br />[size=3]\r<br />Problem II: Interface Messages Breaks Immersion.\r<br />[/size][size=5][size=3]Solution: [/size][size=3][url=http://www.nexusmods.com/skyrim/mods/32060/?]Think To Yourself Messages[/url] by VorpalBlades[/size][/size]\r<br />[size=3]\r<br />This changes messages thatappear to first person to improve immersion. The author has already\r<br />created patches for mods that add messages like Skyrim Heart Rate and\r<br />Frostfall.[/size]\r<br />[size=3]\r<br />Note: If anyone can find anexus mod that replaces text on objects that can be activated, let me\r<br />know.  [/size]\r<br />[size=3]\r<br />Problem III: Interface Sounds Breaks Immersion.\r<br />[/size][size=5][size=3]Solution:[url=http://www.nexusmods.com/skyrim/mods/15034/?]Skyrim User Inteface Silencer[/url], by Odyseus77[/size][/size]\r<br />[size=3]This gets rid of the excess noise that is constantly butting its head as you do things.\r<br />However, not all changes are for everyone. That&#39;s why there is the\r<br />installer, just choose the sounds you don&#39;t want to hear.[/size]\r<br />[size=3]The ones I recommend are:\r<br />[/size][size=3]Activate Fail Silencer\r<br />[/size][size=3]Active-Inactive Quest in journal silencer\r<br />[/size][size=3]Objectives silencer\r<br />[/size][size=3]New-Update Quest silencer\r<br />[/size][size=3]Equip-Unequip Silencer\r<br />[/size][size=3]Level Up Silencer\r<br />[/size][size=3]Map Silencer\r<br />[/size][size=3]Ok-Cancer Silencer\r<br />[/size][size=3]Skill Increase Silencer\r<br />[/size][size=3]Sneak Attack Silencer\r<br />[/size][size=3]Discover Locations Silencer[/size]\r<br />[size=3]Using the others I feel ruin some parts of the game, so that&#39;s why I left them in. Of course,\r<br />that is my opinion, so do as you wish.[/size]\r<br />[size=3]Some of these silencers,like the Skill Increase Silencer and the Level Up Silencer; will\r<br />require that you pay more attention to your skill levels, or you&#39;ll\r<br />miss level up opportunities which will force you to choose several\r<br />bonuses at once the next time you visit the skill menu. (Personally,\r<br />I think SKYUI should make a widget to balance this out that let&#39;s you\r<br />know when you have a level up waiting for you, but of course with\r<br />Immersive HUD, you can turn those widgets on or off as you please)[/size]\r<br />[size=3]\r<br />Problem IV: Combat Music Breaks Immersion.\r<br />[/size][size=5][size=3]Solution: [url=http://www.nexusmods.com/skyrim/mods/28511/?]Condition[/url][/size][size=3][url=http://www.nexusmods.com/skyrim/mods/28511/?]al[/url] [/size][size=3][url=http://www.nexusmods.com/skyrim/mods/28511/?]Combat Music[/url], by Del[/size][size=3]a[/size][size=3]ric.\r<br />[/size][/size]\r<br />[size=3]I find it strange when my character is walking through the woods, and then all of sudden you\r<br />hear drums beating as the combat music picks up, that totally breaks\r<br />my train of though and many times make me jump out of my seat, not\r<br />because I am scared, but surprised. It was unexpected, and it breaks\r<br />immersion. Delaric&#39;s Conditional Combat Music fixes that by only\r<br />playing combat music when it&#39;s important, like during an epic battle\r<br />with dragons or other tough foes. People don&#39;t normally have a sense\r<br />for danger unless they hear or see something that could be dangerous.\r<br />The mod page actually lists what enemies the music is played for, if\r<br />you are interested. So the next time you are wondering through the\r<br />woods, expect to be surprised by unexpected attacks instead of\r<br />hearing combat music. It does make the wilderness more scary and\r<br />dangerous, as it should be in Skyrim.\r<br />[/size]\r<br />[size=3]Problem V: Game Bugs Breaks Immersion.\r<br />[/size][size=3]Solution: Unofficial Patches, by the Unofficial Patch Project Team\r<br />[/size][size=5][url=http://www.nexusmods.com/skyrim/mods/19/?][size=3]Unofficial Skyrim Patch\r<br />[/size][/url][/size][size=3]Unofficial Dawnguard Patch\r<br />[/size][size=5][url=http://www.nexusmods.com/skyrim/mods/25127/?][size=3]Unofficial Hearthfire Patch\r<br />[/size][/url][/size][size=5][url=http://www.nexusmods.com/skyrim/mods/31083/?][size=3]Unofficial Dragonborn Patch\r<br />[/size][/url][/size][size=5][url=http://www.nexusmods.com/skyrim/mods/31255/?][size=3]UnofficialHigh Resolution Patch[/size][/url][/size]\r<br />[size=3]This is a no-brainer,encountering a bug in Skyrim takes you out of the moment reminding\r<br />you that you are playing a game whos developers are fallible. If you\r<br />haven&#39;t heard of these, I wonder where you have been the last few\r<br />years. Most modding guides put these as important.[/size]\r<br />[size=3]I also recommend the [url=http://www.nexusmods.com/skyrim/mods/23833/?]Skyrim Misc Patches Collection[/url], by Hexase. This mod fixes a number of bugs left out by the unofficial patches. You see even the Unofficial Patch\r<br />Project Team isn&#39;t perfect.\r<br />[/size]\r<br />[size=3]Part 1-B: Environmental Fixes\r<br />[/size]\r<br />[size=3]There are many problems with the environment of Skyrim that if you fixate on them will\r<br />immediately break your immersion of the game. The following mods\r<br />should take care of those environmental annoyances.[/size]\r<br />[size=3]\r<br />Problem VI: Don&#39;t Enter the Water (It looks dangerous).\r<br />[/size][size=5][size=3]Solution: (preferred) [url=http://www.nexusmods.com/skyrim/mods/1111/?]Pure Water [/url]by Laast and [url=http://www.nexusmods.com/skyrim/mods/40564/?]Skyfalls[/url]by SjoertJansen[/size][/size]\r<br />[size=3]\r<br />The water looks terrible in Skyrim, and doesn&#39;t seem to flow well. Pure Water fixes that\r<br />without any impact of my frames per second. Of course, it is what I\r<br />prefer, and there are two other options, [url=http://www.nexusmods.com/skyrim/mods/13268/?]WATER[/url],and [url=http://www.nexusmods.com/skyrim/mods/41076/?]RealisticWaters Two[/url]. Just choose one, for the way water looks in Skyrim NEEDS to be changed for immersion sake.[/size]\r<br />[size=3]\r<br />The other issue is with waterfalls at a distant (it&#39;s terrible), and Skyfalls (which comes\r<br />with SkyMIlls which fixes distant windmills) makes it better.\r<br />[/size]\r<br />[size=3]Problem VII: What&#39;s With The Lights.\r<br />[/size][size=5][size=3]Solution: [url=http://www.nexusmods.com/skyrim/mods/13531/?]Ultra Realistic World Lighting[/url] Dark Version by Marco and  [url=http://www.nexusmods.com/skyrim/mods/27043/?]Enhanced Light and FX[/url], by Anamorfus (my choices)[/size][/size]\r<br />[size=3]\r<br />Skyrim nights are too bright, and so are the interiors. That constantly breaks immersion,\r<br />and these mods fix that.\r<br />[/size]\r<br />[size=3]To go along with these, I recommend [url=http://www.nexusmods.com/skyrim/mods/18916/?]Lanterns of Skyrim All In One[/url] mcm version and download the  2x brighter preset. This will put bright lanterns along the roads and in the\r<br />cities of Skyrim, and it doesn&#39;t break immersion. Roads and cities\r<br />should be brighter than the wilderness. (don&#39;t use Claralux, it\r<br />broken and will break your game)\r<br />[/size]\r<br />[size=3]Problem VIII: (optional) You Call That Weather?\r<br />[/size][size=3]Solutions: Project Reality: Climates of Tamriel, by JJC71; OR Skyrim Pure Weather, by\r<br />Laast.[/size]\r<br />[size=3]I don&#39;t use weather overhauls myself because they make mods like Frostfall a lot harder\r<br />with a lot more rain and a lot more snow/blizzards, and I prefer to\r<br />have more sunny days. However many may feel that the weather does\r<br />nothing to help immersion, so here are some fixes for that. [/size][size=3][color=#ff3333]Beware[/color]:These mods may conflict with the lighting mods, so check for\r<br />compatibility issues on the mod pages.[/size]\r<br />[size=3]I actually use a lightweight mod that changes the look of the rain called [url=http://www.nexusmods.com/skyrim/mods/16541/?]Real Rain[/url], by PlayerTwO. I am pretty happy of how it&#39;s working.\r<br />[/size]\r<br />[size=3](Part 1-C: Character Fixes(scrapped – will be removed at a later time)[/size]\r<br />[size=3]\r<br />I was going to put in a whole section of character fixes, when I realized that those kinds of\r<br />thing are based upon player&#39;s opinion and taste, and whether or not\r<br />the player even looks at the face or body of his/her character (the\r<br />same reason why I did not include texture and mesh fixes into this\r<br />guide). I personally use Ethereal Elven Overhaul because I feel that\r<br />elvish faces look more goblinoid. If you feel that looking at your\r<br />character breaks immersion because of the way his/her body or face\r<br />looks, go get a mod to fix it. There are dozens of them on the\r<br />Nexus.)[/size]\r<br />[size=3]\r<br />Part 2: Realistic Immersion mods\r<br />\r<br />[/size][size=3]So now that we are done with the fixes that break immersion, it&#39;s time to add mods that make\r<br />the game and game world more realistic. The following mods adds to\r<br />your immersion and takes it to the next level.\r<br />[/size]\r<br />[size=3]Part 2-A: Immersive WorldEffects\r<br />[/size][size=3]\r<br />These mods adds little effects into the game that improves immersion.\r<br />\r<br />[/size][size=3]1. Wet and Cold\r<br />[/size][size=3]2. Wet and Cold – Ashes\r<br />[/size][size=3]3. Wet and Cold –Holidays\r<br />[/size][size=3]\r<br />These mods add realism to the world mostly because they change npc behavior, forcing them to\r<br />react to rain storms, thunder storms, snow storms, blizzards, and\r<br />ash storms. Thus they react in a believable way. The holidays\r<br />addition also adds monthly holidays that the npcs respond to. All\r<br />together it makes Skyrim feel like a real place.\r<br />[/size]\r<br />[size=3]I recommend you get the cloak mods Cloaks of Skyrim and Cloaks: Winter is Coming. The npcs\r<br />will where the appropriate cloak when it is needed.[/size]\r<br />[size=3]\r<br />4. Footprints (self explanatory)\r<br />[/size][size=3]5. Splash of Rain (self explanatory)\r<br />[/size][size=3]6. Real Shelter II prevents precipitation from moving through overhangs and other things\r<br />that should provide shelter from the weather.\r<br />[/size][size=3]7. No Snow under the Roof not only removes snow under roofs were appropriate, but it also adds\r<br />snow pileup on the roof, both of which are realistic.\r<br />[/size][size=3]8. Realistic Boat Bobbing(self explanatory)\r<br />[/size][size=3]9. Waves (self explanatory) (isn&#39;t compatible with WATER\r<br />)[/size][size=3]10. Immersive Interiors[/size]\r<br />[size=3]11. Run for your Lives(for Dragons)\r<br />[/size][size=3]12. When Vampires Attack(vampire and werewolves\r<br />)[/size][size=3]These also add npc behaviors (to run inside). Not only does it prevent certain npc&#39;s\r<br />from dying, it also make sense and thus improves immersion.\r<br />[/size][size=3]13.  No Predator on Roads. It doesn&#39;t make sense for you to constantly run across predatory\r<br />animals [/size][size=3]while you are traveling on heavily used roads.\r<br />[/size][size=3]14. Point the Way, adds new signs to the roads.\r<br />[/size][size=3]15. Hold Border Banners. Adds banners along the roads near the borders. This shows you what\r<br />hold you are entering.\r<br />[/size]\r<br />[size=3]Part 2-B: City and Town enhancements:\r<br />[/size][size=3]These mods improve the cities and towns, make them feel more lived in and more realistic, without breaking away from lore. When it comes to major hold capitals\r<br />(Markarth, Riften Solitude, Whiterun, and Windhelm) the purpose is\r<br />not only to make the cities better,  but also to make the approach to\r<br />the city feel more gandeur like they should be. \r<br />[/size]\r<br />[size=3]1. Complete Solitude. This makes Solitude feel very busy and crowded, like a capital should be.\r<br />It also add buildings along the walk up to the city.\r<br />[/size][size=3]2. Solitude Docks District. This enhances the waterfront also making it look busy.\r<br />[/size][size=3]All Solitude mods are compatible\r<br />[/size][size=3]3. Dawn of Whiterun.\r<br />[/size][size=3]4. Whiterun Outskirts. Note: This mod is old thus problematic, BUT there has been a patch to\r<br />it to make it more stable and secure.\r<br />[/size][size=3]All Whiterun mods arecompatible\r<br />[/size][size=3]5. Dawn of Windhelm\r<br />[/size][size=3]6. Windhelm BridgeOverhaul\r<br />[/size][size=3]7. WindhelmExteriorAltered\r<br />[/size][size=3]All Windhelm mods arecompatible\r<br />[/size][size=3]8. Riften Thief Addition. This not only makes Riften look like a den of murder and mayhem, but\r<br />it adds a slums district just out the north gate. (optional\r<br />replacement: Dawn of Riften, without the slums district)\r<br />[/size][size=3]9. The City of Dawnstar –a city under construction. This mod improves the look and feel of\r<br />Dawnstar\r<br />[/size][size=3]10. ImpReal Empire –Unique Cities – Falkreath\r<br />[/size][size=3]11. Winterhold Expanded Ruins (unless you use the mod that gives you a quest to rebuild the\r<br />city)\r<br />[/size][size=3]12. Hold of Technology –Markarth[/size]\r<br />[size=3]\r<br />Part 2-C: NPC&#39;s Enhancements\r<br />\r<br />[/size][size=3]These mods will enhance NPC&#39;s behavior and a new ones. The purpose is to not dramatically\r<br />increase the populations of Skyrim, but to improve thing that need\r<br />improvement.\r<br />[/size]\r<br />[size=3]1. Sleep Tight. This will cause more npc&#39;s to go to sleep at night, which makes them more\r<br />realistic. It does not effect Innkeepers. You need a mod called\r<br />Sleeping Innkeepers to change them.\r<br />[/size][size=3]2. ASIS. This stands forAutomatic Spells Increased Spawns. This is a java. The increase\r<br />spawns does make it much more difficult. If you don&#39;t want the extra\r<br />difficulty, when you run the file, add only the options that are\r<br />realstic and thus immersive: Automatic Spells, Automatic Perks, NPC\r<br />Potions. This may make it more difficult, but that is price sometimes\r<br />with improved immersion.\r<br />[/size][size=3]3. Guard DialogueOverhaul: Makes the guards less repetitive and more respectful\r<br />[/size][size=3]4. Follower Commetary Overhaul, makes the followers say more things. \r<br />[/size][size=3]5. Immersive NPC in the Dark. This will make NPCs act realistically when in dark dungeons,\r<br />and when it is nighttime.\r<br />[/size][size=3]6. Inconsequential NPCs.This adds NPC&#39;s to places that makes sense, like carriage guards, an\r<br />audience at the Jarl&#39;s courts, college studens, inn patrons, and\r<br />more. Yes it does add more people, but they don&#39;t feel out of place.\r<br />[/size][size=3]7. Immersive Patrols. This doesn&#39;t just add patrols, but it also adds more people traveling the\r<br />roads. This makes the heavily trafficked roads feel more used.\r<br />[/size]\r<br />[size=3]Part 2-D: Immersive Gameplay Effects and Enhancements\r<br />[/size][size=3]\r<br />These add little things that make the game more immersive. This it&#39;s own section because I\r<br />felt that it should be seperated from world effects, or effects that\r<br />change the world of skyrim from things that change the gameplay.[/size]\r<br />[size=3]1. Animations: This adds animations that your player does, like pickup up flowers, looting\r<br />chests, opening doors, etc; and adds an animation to it that makes it\r<br />feel like you are actually doing. However, I recommend you turn off\r<br />the loot animations so that you can see the effects of the next\r<br />mod...\r<br />[/size][size=3]2. Animated Clutter: Like the barrel animation of SMIM (which is worth downloading SMIM for\r<br />just to get that), this mod adds opening animations to things like\r<br />sacks, coffins, trap doors, satchels, and more. Basically it just\r<br />adds any animation that was missing from the game.\r<br />[/size][size=3]3. Realistic Humanoid Movement Speed. Now you can keep up with people.\r<br />[/size][size=3]4. Immersive Loot. Changes the items that you get from spelunking making it more realistic\r<br />[/size][size=3]6. Reflection. Makes you go to sleep to choose perks.\r<br />[/size][size=3]7. Audio Overhaul forSkyrim 2: Enhances the sound effects in the game. Now you can hear\r<br />things from much further away.\r<br />[/size][size=3]8. Training Dummies andTargets (it makes sense that you skills should improve if you are\r<br />hitting dummies or shooting targets. It even works with spells.[/size]\r<br />[size=3]\r<br />That is all I can think of for the moment. As I said before, this will always be a work in\r<br />progress as new immersion mods come out and make the game even more\r<br />immersive.\r<br />\r<br />[/size][size=3]Feedback is much appreciated, especially anything that helps improve this guide. I\r<br />hope you enjoy, This is the guide that I have been looking for a long\r<br />time that I couldn&#39;t find, and now I am making it myself.[/size]\r<br />[size=3]\r<br />Appendix 1: Recommended Survival Mods\r<br />\r<br />[/size][size=3]These mods are not in themain guide because they may be script heavy, but these mods DO make\r<br />Skyrim more immersive. The make the player characters feel alive\r<br />because now with these mods,you have to look after them and take care\r<br />of them. These mods also slow down the game because now you have to\r<br />plan your adventures more carefully, and you&#39;ll have to prepare for\r<br />them so that you have everything your character needs. The\r<br />recommended mods are compatible, and as far as I know, are stable.[/size]\r<br />[size=3]\r<br />1. Frostfall This makesyou keep your character dry and warm. It adds the equipment that you\r<br />need to survive, something that it&#39;s competitor (Hypothermia) does\r<br />not; like tents and backpacks. You need to carry around wood too.\r<br />This mod alone makes it worth owning a horse or buying a home or both\r<br />as early as possible in the game.\r<br />[/size][size=3]2. I-Need. This adds basic needs to the game so that you&#39;ll have to eat, sleep, and drink.\r<br />You&#39;ll have to cook your food and boil water collected from rivers\r<br />and streams to avoid diseases, and diseases get worse.\r<br />[/size][size=3]3. Skyrim Heart Rate:Makes it so that you can&#39;t run all over the place.\r<br />[/size][size=3]4. Total Carryweight System Overhaul: Lowers your character&#39;s carry weight depending on\r<br />race, and limits the number of certain items that you can carry.\r<br />[/size][size=3]5. Weighted Items\r<br />[/size][size=3]\r<br />The following mods are meant to balance out the effects of the above mods.\r<br />[/size][size=3]1. Knapsack Enhanced (forFrostfall)\r<br />[/size][size=3]2. Bandoliers – Bags andPouches (to balance out the carry weight mod)\r<br />[/size][size=3]3. Drinking Fountains ofSkyrim (for RND).[/size]\r<br />[size=3]\r<br />Appendix II: Other Survival Mods\r<br />[/size][size=3]The following mods havenot been tested for stability. If used with the above mods, it may\r<br />cause problems with your game, so beware and do your own testing\r<br />before you start a new save.[/size]\r<br />[size=3]1. Battle Fatigue andInjuries[/size][size=3](optional injure kit tohelp out)\r<br />[/size][size=3]2. Weapons and ArmorDegredation and Repair[/size]\r<br />\r<br />End of Description\r<br />\r<br />Note: I still have some work to do on this guide, adding links, making corrections, etc.. Please check back here to keep updated monthly on the changes. Further changes might be needed as new mods come out that are better replacements for mods on this guide.",
  "categoryId": "79",
  "version": "1.81",
  "author": "OpenWorldAddict",
  "createdUnix": "1400631228",
  "updatedUnix": "1411277942",
  "containsAdultContent": false,
  "uploadedBy": "OpenWorldAddict",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127801",
      "name": "Skyrim Complete Immersion Project",
      "version": "1.81",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "88",
      "fileName": "Skyrim Complete Immersion Project-54213-1-81.zip",
      "uploadedUnix": "1411277942",
      "modVersion": "1.81",
      "virusScanUrl": "https://www.virustotal.com/file/077bcd2a39eb8aaa945ba41ee1e126300cc7973ad204c96835c14add2df44e3d/analysis/1411278063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Complete%20Immersion%20Project-54213-1-81.zip?fid=1000127801&ttl=1535838235&ri=8192&rs=8192&setec=cb5c928e1b9ef9f8bc2444b29428f0ee"
    }
  ]
}