{
  "modId": 54222.0,
  "modName": "HJERIM ESTATE - A Remodel of Hjerim",
  "summary": "A great family orientated house for the Dragonborn.  Imperials and Stormcloaks all welcome.",
  "descriptionHtml": "[center][color=blue][size=+2]HJERIM ESTATE – A Remodel of Hjerim[/size][/color][/center]\r<br />A Mod by PCGirl Updated June 20, 2016\r<br />\r<br />IN LIGHT OF ALL THE CHANGES THAT HAVE BEEN TAKING PLACE IN THE LAST LITTLE WHILE, I DO NOT WISH THIS MOD OR ANY PART OF IT TO BE RE-UPLOADED ANYWHERE ELSE, AND MORE SPECIFICALLY ANY SITE THAT CHARGES FOR MODS. MY MODS ARE FREE TO DOWNLOAD, BUT I DO NOT GIVE PERMISSION TO CONVERT THIS MOD TO ANY OTHER FORMAT.  THIS MOD IS EXCLUSIVE TO NEXUS AND WILL REMAIN AS SUCH IN THE FORESEEABLE FUTURE.  ALL OTHER PERMISSIONS REMAIN AS STATED IN THE PERMISSIONS SECTION.\r<br />\r<br />[url=http://s744.photobucket.com/user/PCGirl4/media/2014-05-14_00022_zps75ba6014.jpg.html][img]http://i744.photobucket.com/albums/xx82/PCGirl4/2014-05-14_00022_zps75ba6014.jpg[/img][/url]\r<br />\r<br />[size=+2][color=red]IMPORTANT STUFF:[/size][/color]\r<br />This is a remodel of the original Hjerim with Hearthfire and [url=http://www.nexusmods.com/skyrim/mods/29249/?]TMPhoenix Multiple Adoptions[/url] compatibility.  You must have Hearthfire installed for the house to work properly as there are criteria and items from that DLC used in my remodel.   If you are using TM Phoenix’s mod make sure it is loaded after my house mod so that the components of his mod will pick up the links in my remodel.  If you are not using TM Phoenix’s Multiple Adoption mod you will not be able to move your children or your spouse into this home, only the player will be able to occupy the house.\r<br />\r<br />[size=+1][color=red] SECONDLY:[/size][/color]\r<br />This house is not 100% lore friendly, so move on if that is what you expect from this remodel.  I will not swap out furniture or other items that people do not like, nor will I make major changes to the room structures or décor.  That is just the way it is, so take it or leave it.  A lot of work went into this mod, as with any mod, and is the 3rd house in the vanilla houses that I have completed.  You can also check out the remodel of Honeyside [url=http://www.nexusmods.com/skyrim/mods/45273/?]Riften House[/url] and the remodel of Breezehome [url=http://www.nexusmods.com/skyrim/mods/44079/?]The White House of Whiterun[/url]\r<br />\r<br />The home is complete with the ability to house your housecarl, spouse and 6 children, as well as 3 additional followers.  The main area of Hjerim has not been changed, however, there has been a large basement level added onto the home to provide room for the children.  If you are not using TM Phoenix’s Multiple Adoption Mod, I strongly reiterate that you will not be able to move your children or spouse into this home, only yourself.\r<br />\r<br />There are many storage areas in the home.  Mannequins, weapon storage, crafting areas, treasure storage, bookshelves, and many other little perks throughout the house.  Explore and discover all the special areas the house has to offer. You do not need to install General Stores or General Displays for any of my displays or storage containers to work.  They have been created by me and are self -maintained.   Displays for Dragon Claws, Dragon Masks, Bug Jars and TG Treasure items have been set up and you must have the items in your inventory to activate the storage.  See pictures for what the shelves actually hold.\r<br />\r<br />\r<br />[url=http://s744.photobucket.com/user/PCGirl4/media/2014-05-20_00001_zps52b87810.jpg.html][img]http://i744.photobucket.com/albums/xx82/PCGirl4/2014-05-20_00001_zps52b87810.jpg[/img][/url]\r<br />\r<br />\r<br />[url=http://s744.photobucket.com/user/PCGirl4/media/2014-05-20_00002_zps3f1d83d1.jpg.html][img]http://i744.photobucket.com/albums/xx82/PCGirl4/2014-05-20_00002_zps3f1d83d1.jpg[/img][/url]\r<br />\r<br />\r<br />[url=http://s744.photobucket.com/user/PCGirl4/media/2014-05-20_00004_zps9675fa5b.jpg.html][img]http://i744.photobucket.com/albums/xx82/PCGirl4/2014-05-20_00004_zps9675fa5b.jpg[/img][/url]\r<br />\r<br />\r<br />[url=http://s744.photobucket.com/user/PCGirl4/media/2014-05-20_00003_zps627ed604.jpg.html][img]http://i744.photobucket.com/albums/xx82/PCGirl4/2014-05-20_00003_zps627ed604.jpg[/img][/url]\r<br />\r<br />\r<br />The kitchen offers full storage options, crafting oven, butter churn and many other things that the homeowner considers conveniences.\r<br />\r<br />There are many plantable containers, gardens and flowers that adorn the whole house, as well as a functional hot tub and pool area for your family to relax around.  A full smithy is located outside on the patio area, and a small sitting area is included as well.\r<br />\r<br />[size=+1][color=purple]INSTALLATION NOTES:[/size][/color]\r<br />Do not install this house mod until you have at least completed the Questline Blood on the Ice.  You do not have to be Thane, but the quest line must be completed.  When you install make sure to move the mod above TM&#39;s Multiple Adoption Mod so that his changes and scripts will affect the house and characters living within it.  If you do not use TM&#39;s mod you will not be able to move your family into the house, but can still occupy it yourself. \r<br />\r<br />If you have already purchased the original Hjerim and have your housecarl moved in, simply have him/her follow you somewhere else, install this mod and move him/her back into the new remodel as normal.  The house is recognized as Hjerim for fast travel and map markers.  I simply use the “This is your new Home” option for the housecarl, which is part of [url=http://www.nexusmods.com/skyrim/mods/18045/?]My Home is Your Home[/url] mod for followers.  You will need to cast the “Bless Home” spell contained with TMPhoenix’s mod in order to have the children recognize the remodel as your new home.  Tell them to move to the “New House” not into the original home.  You can only move 2 children into the vanilla homes, this mod allows for a maximum of 6 children to move in and the spell will recognize that requirement.  Your spouse as well will recognize this spell and again you must tell them to move into the “New House” not the vanilla one.  \r<br />\r<br />Sometimes the children will be slow in moving into the home whether it is the vanilla or a remodel version of it.  Be Patient, they will show up. You can also go to another location in game and either sleep or wait for 24 hours and return home at that point.  Everyone should be there.  All the vanilla markers are recognized for outside play time, your spouse’s activities, such as setting up a shop, as well as some special activities that have been added in for the housecarl to complete when he/she is not acting as follower.\r<br />\r<br />[b]NOTE:[/b]  If you do not wish to wait to purchase Hjerim through the normal course of events, as I understand it can be pretty far into the game, you can always use [url=http://www.nexusmods.com/skyrim/mods/12558/?]Neutral Hjerim[/url] which allows you to purchase Hjerim as soon as you have completed the Blood on the Ice questline, instead of having to wait for the outcome of the Civil War quest line.  There is also a mod called &#34;No Requirements to Buy Homes&#34; that allows for the purchase of any home at anytime regardless of being Thane or not, essentially a bit of a cheat.\r<br />  \r<br />[color=red]RUSSIAN TRANSLATION[/color] Modgames has honored my work by translating this house mod into Russian which you can find here:  [url=http://modgames.net/load/tes_v_skyrim/doma_i_lokacii/dom_v_vindkhelme_pererabotannyj_kherim/254-1-0-17770]RussianVersionofHjerimHouse[/url]  The translations were done by Murderface(Skvizgar) and I thank him for the great job he did.\r<br />\r<br />[size=+1][color=pink]KUDOS & CREDITS[/size]\r<br />Where to start, firstly I need to thank the two people who have mentored me throughout learning the CK and helping me trouble shoot problems, spending many long hours on chats with me to sort through things.   Their sense of humor, encouragement and letting me use them as sounding boards when I wanted to give up on the whole thing, kept me going.   Berticus and Gentester, I couldn’t have completed the mod without their instruction and friendship.  It seems so inadequate to say, but Thank you so much to both of you.  I honestly didn’t think it would finally be completed. \r<br />TM Phoenix for the inspiration to do this mod in the first place and for putting together a fantastic mod with his Multiple Adoptions. Also, to Clinster74 for his texturing instructions, and allowing me to use his and Bond&#39;s resources.[/color]\r<br />\r<br />\r<br />\r<br />Comments & Reviews\r<br />If you enjoy my mod, thank you and feel free to leave a comment in the appropriate section.  I truly appreciate any constructive ideas and comments.  However, if you do not like my mod, that is fine too, simply move on to something else that you will like.  Please don’t leave rude comments as they will be removed and reported, and you face the potential of being banned from the site.  You have been duly warned.\r<br />\r<br />Disclaimer:   You may not use any part of this mod or the resources without express permission from the specific mod author/authors unless stated otherwise in the author/authors permissions.\r<br />\r<br />I hope you enjoy the house.  Constructive comments are always welcome as are endorsements, if you so choose to.",
  "categoryId": "67",
  "version": "v1.1",
  "author": "PCGirl",
  "createdUnix": "1400662489",
  "updatedUnix": "1405368059",
  "containsAdultContent": false,
  "uploadedBy": "PCGirl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109856",
      "name": "Hjerim Estate - A Remodel of Hjerim",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "318148",
      "fileName": "Hjerim Estate - A Remodel of Hjerim-54222-v1-0.rar",
      "uploadedUnix": "1400662342",
      "modVersion": "v1.0",
      "virusScanUrl": null,
      "changelogHtml": " main file uploaded <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hjerim%20Estate%20-%20A%20Remodel%20of%20Hjerim-54222-v1-0.rar?fid=1000109856&ttl=1535838250&ri=8192&rs=8192&setec=fcedd78246d130a76f91c702ff61869f"
    },
    {
      "fileId": "1000117526",
      "name": "Hjerim Estate - A Remodel of Hjerim",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "318144",
      "fileName": "Hjerim Estate - A Remodel of Hjerim-54222-v1-1.rar",
      "uploadedUnix": "1405368059",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2c8d272a7b07f5b7e1a6b244fef2a424c71f0846eb989604dd0d46d0a6ceee49/analysis/1408390370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hjerim%20Estate%20-%20A%20Remodel%20of%20Hjerim-54222-v1-1.rar?fid=1000117526&ttl=1535838250&ri=8192&rs=8192&setec=2bd5e5a1041a2c6d4fac72b0ff2af6c5"
    }
  ]
}