{
  "modId": 54250.0,
  "modName": "Armored Black Rose TBBP Mashup",
  "summary": "An armored variant of the Black Rose Armor in a Mashup",
  "descriptionHtml": "This is a mashup of the Black Rose Armor to be more… armored. Added things include ebony plates and a corset. \r<br />\r<br />Instillation: First install Black Rose BBP, Latex Corset, and Remodeled Armor. In the cases of Latex Corset and Remodeled Armor, you do not require them to be active since you only require the provided textures from those packets. Now, install the new meshes provided in Black Rose Armored  overriding the meshes in n8k’s respective data folder. In other words, override Torso _1  and Torso_0 inside the following folder: Steam/SteamApps/Common/Skyrim/Data/Meshes/n8k. \r<br />\r<br />You will need to download multiple mods for this mashup. These files are listed below. You will also need to download any additional requirements from those mods.\r<br />\r<br />http://www.nexusmods.com/skyrim/mods/46580/?\r<br />http://www.nexusmods.com/skyrim/mods/49350/?\r<br />http://www.nexusmods.com/skyrim/mods/25259/? \r<br />\r<br />In order to obtain the armor, just forge the Black Rose Armor; it has been upgraded to this new appearance. Thus, the name of the mod. \r<br />\r<br />I have either obtained permission to use the resources for this mashup, or have seen permission written on the pages of the provided mods. Since this is a mashup I do not have the authority to allow any further alterations. Please do not ask to alter this design since I cannot approve such a request. At any time the mod authors providing the pieces for this mash-up reserve the rights to pull the content; therefore I will then delete the mash-up.  Below is the list of the mods main contributors and their lists of thanks and contributors. \r<br />\r<br />Credits:\r<br />N8k:\r<br />XPMS for UNPB resources.\r<br />Dimon99 for original UNP resources.\r<br />HydrogensaysHDT for HDT HighHeels System\r<br />And every others who I forgot to mention here.\r<br />Nakrulz:\r<br />Calientes Beautiful Bodies Edition -CBBE- by Caliente\r<br />Bodyslide - 15 extra sliders for CBBE by moonballz\r<br />Buckles used in the Black Rose armor by N8k\r<br />Corset Dress Brianna by anticz\r<br />ChronnoTrigger77:\r<br />Mak - for the original Remodeled Armor CBBEv3M\r<br />Caliente - for the CBBEv3 body, Bodyslide, and the Bodyslide tutorial\r<br />JosefGrey - for the &#34;Non-Nude&#34; version of Mak&#39;s mod (Bra and Panty textures, Bra shape) and for the Skirt Shape\r<br />stuffed_bunny (was: moonballz @ Nexus) - for bodyslide tools and for general help and advice.\r<br />Acdale - base meshes and inspiration (See ADEC Armor n Clothing Compilation)\r<br />Killer Keo - base meshes and inspiration (See Killer Keos Skimpy CBBE Collection)\r<br />Cotyounoyume - base meshes and inspiration (See a little sexy apparel replacer)\r<br />Zonzai - Nocturnal robes base meshes and textures (See The Art of Magicka)\r<br />alchmo - BAIN/Wrye Bash installer\r<br />Bubinga64, doomknightofchaos, Reducer, BrabbelKP - bug hunting and general mod development support\r<br />Bethesda - for addicting as all again and again with utterly immersive gameplay - and for having the wisdom to realize that we can make it even better :-)\r<br />\r<br />WARNING&#33;&#33;\r<br />I did not experience any glitches when forging or equipping the armor. However, I did experience 1-2 CTDs when switching between armors, but it was not a constant thing. Just make sure to keep saving. \r<br />",
  "categoryId": "54",
  "version": "",
  "author": "jcdenton2012",
  "createdUnix": "1400732203",
  "updatedUnix": "1400732193",
  "containsAdultContent": false,
  "uploadedBy": "jcdenton2012",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000109950",
      "name": "Armored Black Rose TBBP",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5333",
      "fileName": "Armored Black Rose TBBP-54250-.zip",
      "uploadedUnix": "1400732193",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a7f057262c1732a97e25a3108c55cf09b6b011ab97e318acbf3588e5f01451d4/analysis/1408089253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armored%20Black%20Rose%20TBBP-54250-.zip?fid=1000109950&ttl=1535838293&ri=8192&rs=8192&setec=71ae069b4bc1661691aa130e8f75d14f"
    }
  ]
}