{
  "modId": 54274.0,
  "modName": "Dragon Stalking Fix",
  "summary": "Dragon corpses will no longer follow you or fall out of the sky.",
  "descriptionHtml": "This mod fixes the bug where dead dragon corpses follow you around or fall out of the sky, affectionately known as &#34;dragon stalking&#34;.\r<br />\r<br />[img]http://i.imgur.com/HEY5aAP.gif[/img][url=http://www.nexusmods.com/skyrim/mods/65163/][img]http://static-4.nexusmods.com/15/mods/110/images/54274-0-1434239478.png[/img][/url]\r<br />\r<br />What causes dragon stalking?\r<br />\r<br />Well, you see... when a young male dragon likes a young female dragon, but he&#39;s not sure how to approach the female dragon, he might lurk around any locations he knows the female frequents, inevitably causing awkward and embarassing encounters with the female...\r<br />\r<br />From her point of view, it starts out sort of cute.  Simply an odd, haphazard, fluke&#33;  What a weird boy dragon just popping out of nowhere, twitching all around, not able to contain his excitement.  Maybe he would make a nice friend who would do stuff for me since he likes me, she thinks to herself.  Just look how trusting he is exposing his underside like a silly puppy dog&#33;\r<br />\r<br />[img]http://i.imgur.com/t8Dp0Egl.jpg[/img]\r<br />\r<br />The two part ways and the female dragon heads off to the Whiterun markets, when what do ya know?  There he is again&#33;  And how sweet, he&#39;s bought her some tomatoes.  What a thoughtful friend this boy dragon is.  But wait... how did he get there so fast?  Was he... following her?\r<br />\r<br />[img]http://i.imgur.com/gKd4ucrl.jpg[/img]\r<br />\r<br />But she dwells on it not and so our female dragon moves right along.  Next stop is Dragonsreach, which is of course, the only fitting place for a dragon to be in Whiterun.  Detesting outspoken impudence, she promptly ingests Heimskr and Nazeem for bastardizing the spoken word, which she finds to be insulting, even when done in a language far inferior to her own.  Appetite sated, she proceeds onward.\r<br />\r<br />As she climbs the steps to Dragonsreach, there he is yet again&#33;  But... oh... oh my.  We&#39;re talking full-on George Takei OH MY here, ladies and gentlemen.  Our poor male dragon seems to have himself in a bit of a snare...  tsk, tsk, tsk, boys really will stick that thing anywhere won&#39;t they?  How embarassing...\r<br />\r<br />[img]http://i.imgur.com/DcvwwJQl.jpg[/img]\r<br />\r<br />What?  Oh, right, the bug... well I don&#39;t know exactly what causes that.  Some problem with the game engine not doing proper housekeeping on dragon corpses, which seems to be exacerbated by issues introduced by the Havok physics suite, causing exponential amounts of derp on heavily articulated objects, such as dragons.  In any case and for whatever reason, when the game tries to reload a dragon corpse that was previously unloaded, it may fail to do so correctly and ends up dropping the corpse in a default location as a fail-safe, which is usually somewhere near the player.  The corpse then proceeds to reload in whatever default location it can find as the player moves from cell to cell.\r<br />\r<br />So how did you fix it?\r<br />\r<br />I took the base script for dragons in the game, DragonActorScript, and I implemented the OnLoad and OnUnload events in the deadDisintegrated state, which is the state dragons go to after their soul is absorbed and they&#39;ve turned to bones.  As soon as the dragon is unloaded from the game in this state, it gets dispelled of any active magic effects and then deleted.  The same is done if the dragon is reloaded in the deadDisintegrated state.  This will delete any dragon corpses which are currently stalking the player on existing save games.\r<br />\r<br />To be clear, this fix will only [u]only[/u] delete a dragon once it has died, released its soul, and turned to bones.  Also, this mod does [u]not[/u] fix the underlying problem which is buried deep in the game engine, rather it imposes a work-around specifically for dragons that have reached a specific state in order to avoid the problem in the first place.\r<br />\r<br />Does it work on an existing save game?\r<br />\r<br />Yes, I just said that.\r<br />\r<br />Does it work with Dragon Combat Overhaul and Deadly Dragons?\r<br />\r<br />Yes, of course.\r<br />\r<br />Does it incorporate fixes from the Unofficial Patches?\r<br />\r<br />You betcha.\r<br />\r<br />Is there a catch?  Are you a wizard?\r<br />\r<br />Not really and that&#39;s none of your business.  Just be sure to loot anything you want from the corpse before you leave the area because the new script will aggressively delete the corpse the moment it unloads.  \r<br />\r<br />Will the fix cause issues?\r<br />\r<br />It shouldn&#39;t.  This mod simply forces the game to cleanup dragon corpses quickly, rather than relying on the existing framework to do it because we&#39;ve found that doesn&#39;t always work.  If the choice is between dragon stalking and aggressive dragon deletion, I choose the latter, at least until a better solution presents itself.\r<br />\r<br />How extensively did you test it?\r<br />\r<br />Pretty extensively.  Most of the time I spent on this mod was doing testing.  I tested it on named dragons like Mirmulnir and Sahloknir in a normal play-through of the game with no problems.  I tested it on dragons at word walls, by killing them once and then waiting for them to respawn after 30 days and got souls each time.  I tested it on dragons spawned randomly in the game and through the console and had no issues and no stalking.  I tested it on existing saves where dragon stalking was occurring to verify that the fix works retroactively and cleans up any dragon corpses which are currently stalking you on existing saves.  This was all done on a 100+ mod load order, including Deadly Dragons and Dragon Combat Overhaul and [url=http://www.nexusmods.com/skyrim/mods/52681/?]NPC Knockout Overhaul[/url], which is my other mod you should go check out, by the way.\r<br />\r<br />This mod asks if I want to overwrite files from another mod&#33;  What do I do?\r<br />\r<br />This mod must overwrite dragonactorscript for the fix to work.  If another mod needs to modify dragonactorscript, then that mod can simply incorporate this fix into that version of the modified script.  I give full permission for this fix to be incorporated into any other mod.  I simply ask to be credited in some way.\r<br />\r<br />Also, I [u]highly[/u] recommend using [url=http://www.nexusmods.com/skyrim/mods/1334/?]Mod Organizer[/url] if you are at all serious about modding Skyrim.  It eliminates the problem of overwritten files and provides a veritable cornucopia of features above and beyond any other mod management software available.\r<br />\r<br />Can this be added to the USKP?\r<br />\r<br />Yes, I give full permission for this fix to be incorporated into any mod, especially the USKP.\r<br />\r<br />Glowing Testimonials\r<br />\r<br />I&#39;m happier than a breakdancing drunk Gremlin. - FallingStar7777\r<br />The description puts my own to shame. - ApolloDown\r<br />The image of the dragon at Dragonsreach is saying &#34;LET ME LOVE YOU&#33;&#34; - Reokudo\r<br />Very description. Such nice. Wow. - cor3zone\r<br />I have never actually seen this bug, but it sounds kind of fun. - XunAmarox\r<br />But did the male dragon ever find true love?  What happened next? - mcshade\r<br />It works&#33; Thank you&#33; - Aelthas\r<br />But seriously... are you a wizard? - tatwizard\r<br />[img]http://imgur.com/M3O3hYT.gif[/img] - keithinhanoi\r<br />\r<br />Credits\r<br />\r<br />Bethesda for creating Skyrim and allowing us to mod it so easily.\r<br />Nexus for hosting the mod and supporting the community.\r<br />The entire [url=http://www.nexusmods.com/skyrim/mods/19/]Unofficial Patch Project Team[/url] for their DragonActorScript.psc modified source code and for their relentless efforts in debugging Skyrim.\r<br />Sepherose for his dragon skin textures, which are used in the images: [url=http://www.nexusmods.com/skyrim/mods/9888/?]Sepherose Dragon Skins[/url].",
  "categoryId": "95",
  "version": "1.2",
  "author": "sevencardz",
  "createdUnix": "1400809022",
  "updatedUnix": "1402623285",
  "containsAdultContent": false,
  "uploadedBy": "sevencardz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110958",
      "name": "Dragon Stalking Fix for Dragonborn",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Dragon Stalking Fix Dragonborn Edition-54274-.7z",
      "uploadedUnix": "1401382495",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/75dd186f3b15731d09705777e4ceea9e1c7cbcaf755826c2c16b76a9ad3ebec3/analysis/1408101614/",
      "changelogHtml": " Durnehviir is now explicitly excluded from being deleted to prevent issues with his quests.\r<br />FOMOD installer added with an option for either plugin or loose files installation. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Stalking%20Fix%20Dragonborn%20Edition-54274-.7z?fid=1000110958&ttl=1535838324&ri=8192&rs=8192&setec=2f3152ebc9dc9f8ce3983851deb05eef"
    },
    {
      "fileId": "1000112815",
      "name": "Dragon Stalking Fix",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1813",
      "fileName": "Dragon Stalking Fix-54274-1-2.7z",
      "uploadedUnix": "1402623285",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/de18ca4427f4fee228ac68da458754954d947ad93bf72cf167db78bfaa7f6b0c/analysis/1408124108/",
      "changelogHtml": " Durnehviir is now explicitly excluded from being deleted to prevent issues with his quests.\r<br />FOMOD installer added with an option for either plugin or loose files installation. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Stalking%20Fix-54274-1-2.7z?fid=1000112815&ttl=1535838325&ri=8192&rs=8192&setec=bf46d9e586c4f03a6b228bf26d848b3c"
    }
  ]
}