{
  "modId": 54284.0,
  "modName": "Pontimus - Thane of Skyrim Hero of the People Daedric Champion",
  "summary": "Level 81 Nord Warrior with all vanilla quests completed (Except Paarthurnax and The Bonds of Matrimony)",
  "descriptionHtml": "This is my amazing Nord warrior, specialized in two-handed swords and heavy armor. His gear is custom-made in legendary quality with the best enchantments. All quests are completed, all unique items and artifacts are collected and stored in his Markarth estate, along with a metric tonne of materials and ingredients for just about anything he wants to craft with his maxed out skills. \r<br />\r<br />This awesome guy joined the Imperial Legion and won the civil war. He rose through the ranks and was promoted to Legate, cause he&#39;s just that awesome. \r<br />\r<br />His greatest feat is his ability to kill everything, so naturally he was inducted into the Dark Brotherhood as their Listener.\r<br />\r<br />The Thieves Guild didn&#39;t want to miss out on this Messiah, so they took him in and made him their leader as well.\r<br />\r<br />He&#39;s probably the smartest dude in Tamriel, cause he was promoted to Arch-Mage of the college of Winterhold the same week he enrolled.\r<br />\r<br />In case you don&#39;t get how amazing he is yet, let me tell you, the ghost of the Companion&#39;s former Harbinger returned to the world of the living to declare this tremendous gentleman his successor.\r<br />\r<br />And of course, he was made Thane in ALL the Holds and given a house in each major city, pimped out with everything he needs, furniture, Housecarl, you name it&#33;\r<br />\r<br />If you should happen to find a quest that I might have missed, please leave a comment and tell me.\r<br />\r<br />Also, enjoy&#33;",
  "categoryId": "43",
  "version": "1.0",
  "author": "Poper40",
  "createdUnix": "1400843705",
  "updatedUnix": "1400843701",
  "containsAdultContent": false,
  "uploadedBy": "poper40",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110090",
      "name": "Pontimus the Decimator",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4202",
      "fileName": "Pontimus the Decimator-54284-1-0.rar",
      "uploadedUnix": "1400843701",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/787a3563a2d751ed81ed3effed4d9c99241ab8b78fdd92f03dd42411f6b41ca1/analysis/1408091051/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pontimus%20the%20Decimator-54284-1-0.rar?fid=1000110090&ttl=1535838341&ri=8192&rs=8192&setec=4d647d099c85727aeb606a4111bc839b"
    }
  ]
}