{
  "modId": 54283.0,
  "modName": "C.O.R.P.R.U.S. - Unenchanted Staff Crafting",
  "summary": "Contains two versions: \r<br />CORPRUS Light - Adds the ability to craft unenchanted staves to forges and adds staff materials to some merchants.\r<br />CORPRUS Carpentry - Moves the crafting of the staves to the Hearthfire Carpentry Workbenches as well as adding Carpentry alternatives to other wooden items in game (WIP)",
  "descriptionHtml": "[b][u]C.O.R.P.R.U.S. - Craftable or Readily Purchasable Range of Unenchanted Staves.[/u][/b]\r<br />\r<br />Made for me to use personally but uploaded here for the community to enjoy.\r<br />\r<br />This mod was born out of the uselessness of the Hearthfire Carpentry Workbenches after you have completely finished your house. There are mods out there that disable them, but I decided I wanted to be able to use them for something. I then looked at the Staff Enchanter, an idea that I liked, but never seemed early enough to be useful. I looked over the Nexus and found that there are numerous mods that place these enchanters around Skyrim. \r<br />\r<br />I made this mod as a way of creating the staves at an enchanter without having been forced to go to Solstheim (obviously everyone in Skyrim just stole Neloth&#39;s ideas, but he can get over it with his canis root tea). Although the light version was designed with the idea of using mods that add enchanters, it can still be used by those who simply do not wish to buy anything from Neloth.\r<br />\r<br />[u]C.O.R.P.R.U.S. Light - Requires Dragonborn Only[/u]\r<br />\r<br />First of all, the, no doubt more popular, version that depends on Dragonborn alone.\r<br />\r<br />[list] [*]Adds construction recipes for the 5 unenchanted staves added by Dragonborn and needed for the Staff Enchanter in Tel Mithryn. These are found at the forge under the Wood category. Staves require 3 Firewood and a filled Petty Soul Gem to craft. [/list]\r<br />[list] [*]Unenchanted staves have been added to their respective tutors at the College of Winterhold. [/list]\r<br />[list] [*]Enthir now sells Heart Stones. [/list]\r<br />Nothing else should have been touched in this version, if you find something, let me know.\r<br />\r<br />[u]C.O.R.P.R.U.S. Carpentry Edition - Requires Dawnguard, Hearthfire and Dragonborn[/u]\r<br />\r<br />[list] [*]Items are sold by the mages at the college as in the Light version. [/list]\r<br />[list] [*]Staff crafting has been moved to the Hearthfire Carpentry Workbenches with their recipes staying the same. [/list]\r<br />[list] [*]Arrows and bolts have had their material types changed to Wood and have had recipes added to the Carpentry Workbenches that yield more ammo than their blacksmithing counterparts (as a trade of for no experience). Numerically you get 36 arrows or 20 bolts. It is worth noting that I decided to not carry over the recipes for exploding bolts, they remain at the Dawnguard Forge. BLACKSMITHING RECIPES ARE UNALTERED, but all ammo is now found in the Wood category in the Forge. [/list]\r<br />[list] [*]Steel crossbows are craftable at the workbench using the same materials as forging one, and as an added bonus, the enhanced crossbow can be crafted, both without joining the Dawnguard. The enhanced crossbow requires only 1 x Corundum ingot and 2 x Firewood. I will not be adding the Dwarven Crossbow, only the bolts. [/list]",
  "categoryId": "28",
  "version": "1.1",
  "author": "TheJelleyMan",
  "createdUnix": "1400848361",
  "updatedUnix": "1400848322",
  "containsAdultContent": false,
  "uploadedBy": "thejelleyman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110097",
      "name": "C.O.R.P.R.U.S. - Carpentry Version",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "C.O.R.P.R.U.S. - Carpentry Version-54283-1-1.zip",
      "uploadedUnix": "1400848260",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/14d305731d2bd2e9cc43c8c2d1effd08243d3bf1be0ec949a718b179a2073eaf/analysis/1408091054/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/C.O.R.P.R.U.S.%20-%20Carpentry%20Version-54283-1-1.zip?fid=1000110097&ttl=1535838339&ri=8192&rs=8192&setec=2c084140f805d5c9bd19c96fead091e7"
    },
    {
      "fileId": "1000110098",
      "name": "C.O.R.P.R.U.S. - Light Version",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "C.O.R.P.R.U.S. - Light Version-54283-1-0.zip",
      "uploadedUnix": "1400848322",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/47b5a532cbd48b0df4857dab7778b00c23acbe2001c410b780eaff5dcb6a77c1/analysis/1408091054/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/C.O.R.P.R.U.S.%20-%20Light%20Version-54283-1-0.zip?fid=1000110098&ttl=1535838340&ri=8192&rs=8192&setec=9fb00a03a7fcc191709085958e1fedc5"
    }
  ]
}