{
  "modId": 5428.0,
  "modName": "Bad Mouth Bear",
  "summary": "Gives the bears some really nasty language. The voice is TG (Tourettes Guy) famous for his profane You-Tube rants and videos.",
  "descriptionHtml": "Gives the bears some really nasty language. Heavy and gratuitous profanity. \r\n\r\nI was inspired by the Swearing Mubcrabs and Swearing Trolls. I just took the original voice samples and changed the pitch so they sound more like a bear.\r\n\r\nI made this for my own amusement. I wanted the bears to cuss out everyone and everything. I made it so the profanity does not totally overide the roars and bear growls. The bears will still sound like bears. This mod just provides a good liberal dose of profanity now and some funny death cries.\r\n-----------\r\n\r\nBad Mouth Bear \r\nVersion 1.0 Final Relase \r\n\r\nThis is the voice of the late Tourettes Guy, may his nasty ass rest in whatever peace he found in the afterlife. There is a new legend floating the icy winds of Skyrim. It tells the tale of how the bears started to roar with an profane new voice soon heard all across the land.\r\n\r\nAnd so it is said in legend still:\r\n\r\n\\\"One day a bear woke up from an endless hibernation in a dim and forgotten cave lost in frozen, icy Winterhold. He woke up with his nether parts frozen to the ice, and started to scream out the most nasty and offensive language ever heard in Skyrim. It is said even the statue of Talos turned his head in shock when the mighty bear went on a devastatingly offensive and profane rampage. Soon every bear of every kind across the vast land started to roar out his profane and deadly outrage.\\\"\r\n\r\n--------------------\r\n\r\nI did not know there was another mod already posted using his voice, but really, mine is so different that they are in no way even similar to each other. \r\n\r\nI actually made the original samples into WAV on 12/23/11 and had them running in my game for two days before I decided to share them for Christmas. I got as far as RARing the files and giving them to a bunch of my game testing friends when I got called to work. As a result of a drawn out holiday emergency I just posted this on 1/5/12. \r\n\r\nAs I said, I was not aware of the fact there was another bear mod paying tribute to TG. I d/led it and checked it out, and after comparing, I think mine is a completely different mod, not in any way a copy of his. \r\n\r\nPlease read this to see what I mean.\r\n\r\nI have repitched the voice and ran it through several filters and volume leveling phases. I also kept my samples to 4 seconds or under to minimize sample overlap. I tried to make the original TG sound more like a bear, and the result was about 25 hours of actual in game use before I figured out the correct pitch and timing to keep the voice from overlapping or dragging out.\r\n\r\nI removed as much background noise and static as I could working with the low rendered samples I was able to find. I tried to set the audio levels to sound good at medium volume, but even with very high in-game sound volume, they sound as clean as they could possible be and will match the vanilla bear roars as closely as possible.\r\n\r\nI had around 20-30 people try this in-game, and they all report that it works very well with the other effects, and that the length of the samples are mostly timed correctly. I have tried it out on about 50 bears so far, and unless you are getting mobbed the new voice samples blend in and sound great great with the bear roars. \r\n\r\nI have tried to make the TG samples as seamlessly intergrated with the vanilla bear attacks and roars. So far I have enjoyed it, and the samples are not too overwhelming in my opinion.\r\n\r\nAs I said, there is another mod using the same voice, but I believe mine is much cleaner sounding and has the total TG feel that I wanted to get. This was really just made for my own amusement and laughs. After sharing it with some fellow RP gaming freaks for Christmas, I was convinced to share it with all my fellow Skyrim community of modders and mod users.\r\n\r\nHope you enjoy. Somewhere TG is probably cursing me right now. I think it is fitting that he was reborn in Skyrim as a big old nasty ass bear. Just remember, every time you get you ass ripped open by a bear, TG is laughing at you and calling you names.\r\n\r\nOh yeah, just for the legal thing, this is an adult mod and is filled with an extreme amount of very offensive profanity and general bad taste. Not for children or the easily offended and dismayed. You have been warned, use at your own discretion.\r\n\r\nAll audio samples were obtained from a public sound file service and were marked as Creative Commons Non-Profit Only. \r\n\r\nDO NOT POST TO ANY OTHER SITES! NEXUS HOSTING ONLY!\r\n\r\nAll samples are from Free Sound.",
  "categoryId": "61",
  "version": "1.0",
  "author": "Dark Highlord",
  "createdUnix": "1325801757",
  "updatedUnix": "1325862219",
  "containsAdultContent": true,
  "uploadedBy": "DarkHighlord69",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17184",
      "name": "Badmouth Bear",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3063",
      "fileName": "Badmouth Bear-5428-1-0.rar",
      "uploadedUnix": "1325862219",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/018f58e3a6b9d66f8c198a66aeaa4bc86de74e906d5dd337f1ecfb2f58ab6105/analysis/1406587636/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Badmouth%20Bear-5428-1-0.rar?fid=17184&ttl=1535762122&ri=8192&rs=8192&setec=6bdf864d41d2764226c9453f5a5c93dd"
    }
  ]
}