{
  "modId": 54306.0,
  "modName": "More Draconic Dragon Aspect",
  "summary": "Adds some cosmetic and combat features to the Dragon Aspect Shout, including animated wings and tail, new shouts and spells.",
  "descriptionHtml": "[b]Added a FAQ in the troubleshooting section to answer the most common issues that users may have. Please, read them before you ask on the &#34;Post Tab&#34;.[/b]\r<br />\r<br />This mod adds some spice to the Dragon Aspect shout and makes it more dragon-like by adding some cosmetic and combat features, including:\r<br />\r<br />[list][*][b]A pair of animated wings[/b] (for all races) and a dragon tail (for non-beast races).[*][b]Increased effect duration[/b], from 5 to 10 minutes.[*][b]Two new shouts:[/b] Fire Ball and Ice Storm (don&#39;t confuse it with the spell). They&#39;re the ones that the dragons use when they&#39;re too far from you, exploding on contact with an object. They deal around the same amount of damage as Frost Breath and Fire Breath, but travel faster, further, and their cooldown times are shorter.[*][b]Summon Fire Wyrm spell:[/b] You&#39;ll can summon a faster and stronger fire wyrm to fight at your side until it&#39;s defeated. It&#39;s tied to your level up to level 50. Magicka base cost of 100.[*][b]Seismic Toss spell:[/b] All targets in the area around you that fail to resist are staggered or pushed away, in a similar manner as Unrelenting Force. Magicka base cost of 100.[*][b]No falling damage[/b], as long as you have wings, of course.[*][b]CUSTOM COLORS&#33;[/b] Download the optional file to change the look of your dragon aspect effect. From shiny colors for good fellas, to shady colors for bad guys, take a look of the images tab and make your choice&#33;[/list]\r<br />\r<br />[youtube]n1XK3WhVet0[/youtube]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Translations (if you have a translation of this mod let me know):[/u][/b]\r<br />[list][*][b]Portuguese:[/b] [url=http://www.nexusmods.com/skyrim/mods/63386/?]Português[/url][/list] - by Vulthoryu. \r<br />[line]\r<br />\r<br />Each Dragon Aspect word adds a word of Fire Ball and Ice Storm:\r<br />\r<br />   [b][color=#e78e17]Fau (Cool) [/color][/b]- Deals 55 points of frost damage 10 seconds of cooldown (unlocked with the word Mul)\r<br />   [b][color=#e78e17]Fusk (Throw) [/color][/b]- Deals 75 points of frost damage 20 seconds of cooldown (unlocked with the word Qah)\r<br />   [b][color=#e78e17]Vey (Cut) [/color][/b]   - Deals 200 points of frost damage 45 seconds of cooldown (unlocked with the word Diiv)\r<br />\r<br />   [b][color=#99f3ff]Kaag (Explode)[/color][/b]- Deals 55 points of fire damage 10 seconds of cooldown (unlocked with the word Mul)\r<br />   [b][color=#99f3ff]Niiv (Ball) [/color][/b]- Deals 75 points of fire damage 20 seconds of cooldown (unlocked with the word Qah)\r<br />   [b][color=#99f3ff]Ag (Burn)[/color][/b]   - Deals 200 points of fire damage 45 seconds of cooldown (unlocked with the word Diiv)\r<br />\r<br />[line]\r<br />\r<br />Thank you Chayification, Brodual, Gopher, MMOxReview, Seriezs and Smike for your video reviews&#33;\r<br />\r<br />[youtube]qKygCv7AnGA[/youtube][youtube]fqrjv3yDGGE[/youtube]\r<br />[youtube]2WPvp6nAXkg[/youtube][youtube]Gjx3ufrIbRU[/youtube]\r<br />[youtube]tghd8jyNGZA[/youtube][youtube]-xha2lWyElM[/youtube]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Requirements:[/u][/b]\r<br />[list][*]Dragonborn DLC[*]Animated Dragon Wings http://www.nexusmods.com/skyrim/mods/53271/?[/list]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Installation:[/u][/b]\r<br />[list][*]Install via NMM and follow the install wizard instructions.[*]Or follow the &#34;Manuall Installation Instructions&#34; file contained in this mod, if you decide to install it manually.[/list]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Uninstallation:[/u][/b]\r<br />[list][*]Wait until the Dragon Aspect effect has worn out.[*]Save your game.[*]Deactivate the mod via NMM[*]Load your savegame.[*]Save again.[*]Or follow the instructions contained in the &#34;Manuall Installation Instructions&#34; file that comes with this mod.[/list]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Important:[/u][/b]\r<br />[list][*]The wings use a behavior file that comes with the Animated Dragon Wings mod, so make sure it&#39;s placed before this mod on the load order, or you&#39;ll get nasty CTD&#39;s. Nope, I won&#39;t add that file with this mod, please, download it from it&#39;s original page.[/list]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Compatibilities:[/u][/b]\r<br />[list][*]Compatible with the latest version of xp32&#39;s skeleton and Dual Sheath Redux.[*]Compatible now with Cloaks of Skyrim (or any cloak mod that doesn&#39;t occupy the slot 52).[*]Compatible with Belt-Fastened Quivers and other custom skeletons, as long as they have a version for beast races and you follow the instructions on the video in the troubleshooting section.[/list]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Notes:[/u][/b]\r<br />[list][*]Seismic Toss can be a little tricky to use. It takes a little more time to prepare than other spells and if you&#39;re on a non-flat or open surface (like a downhill), you need to hold your cast button, and release it while you&#39;re walking or running to make it work.[*]The spells do not require a minimun destruction level and they&#39;re for novices. It would be frustrating that, not enough with having them for ten minutes a day you cannot use them because you&#39;re not a mage.[*]Don&#39;t worry, you&#39;re immune to Miraak&#39;s Seismic Toss, besides a brief staggering. I made it this way because on high difficulties it can be a real pain. Though Miraak is immune to your spell too.[/list]\r<br />\r<br />[line]\r<br />\r<br />[b][u]Troubleshooting and F.A.Q:[/u][/b]\r<br />Some of you were having trouble with this mod and Belt-Fastened Quivers and some asked if there&#39;s a way to use the tailed version with their custom skeleton.\r<br />\r<br />I made this video-tutorial to explain how can you solve CTD&#39;s with MDDA and Belt Fastened Quivers, but will work with almost every custom skeleton that has a version for beast races. It&#39;s quite easy and quick, and you won&#39;t have negative repercutions.\r<br />[youtube]LdOomOU_bh4[/youtube]\r<br />\r<br />[i]My game crashes when I start the game or I&#39;m in the main menu. What&#39;s happening?[/i]\r<br />CTD&#39;s on main menu or startup it&#39;s almost 100% likely due to a missing masterfile or incorrect load order. Remember that you have to install Animated Dragon WIngs (and Flying Mod of you decide to use the Flying mod Addon), and place it before this mod in your load order.\r<br />\r<br />[i]I have all the required mods in the correct order, but the game crashes when Miraak or I use the shout. Why?[/i]\r<br />You tried to use a version with tail, right? This case is due to skeleton incompatibilities. Probably you are: \r<br />-Using a vanilla skeleton and you didn&#39;t select the &#34;Vanilla Skeleton&#34; option in the install wizard. You have to select it.\r<br />-Using a custom skeleton that doesn&#39;t have a tail. In this case you have to follow the instructions on the tutorial video I previously placed in this section.\r<br />-You&#39;re using an outdated version of XP32&#39;s skeleton. You need to update it to the latest version.\r<br />\r<br />[i]Do I really need a vanilla skeleton to make your mod work?[/i]\r<br />No. As I said before, your custom skeleton is compatible as long as it has a tail, for both beast and non-beast races.\r<br />\r<br />[i]I sorted my load order using LOOT/BOSS and cannot see the wings when I shout. What can I do?[/i]\r<br />I&#39;m assuming that you&#39;re using the three words of power. I don&#39;t know why LOOT or BOSS mess up the load order of this mod, but you can solve this problem by manually re-arranging the plugins to follow this order, of course, all of them have to be placed after Animated Dragon Wings and Flying Mod Beta plugins:\r<br />\r<br />-More Draconic Dragon Aspect - Powered Edition.esp.\r<br />-More Draconic Dragon Aspect - Wings and Tail.esp (or any other cosmetic plugin).\r<br />-More Draconic Dragon Aspect - Flying Mod Addon (if you installed it).\r<br />\r<br />[i]When I use the shout, my armor/cape/cloak/bag disappears, and if I equip them again, the tail disappears[/i]\r<br />Your armor/cape/cloak/bag is using the same slot that the tail uses (slot 52). This slot is very rarely used by other clothing mods, so I choose it for the tail.\r<br />\r<br />[i]I have Dragon Aspect Overhaul Mod installed. Is it compatible with this mod?[/i]\r<br />I haven&#39;t tested it yet, and seems that users of both mods have different results. Some of them told me that both mods are compatible as long as you place this mod after DAO in the load order, others that if you place this mod before DAO, some more said that they aren&#39;t compatible. So to be honest, I&#39;m not sure.\r<br />\r<br />[line]\r<br />\r<br />[b]Some other Q/A:[/b]\r<br />[i]Why the wings and tail textures are not animated like the rest of the armor?[/i]\r<br />I&#39;m not sure, to be honest. I added the necessary controllersequences  for the texture animations, but for some reason, they don&#39;t work ingame (or perhaps I&#39;m doing something wrong). I&#39;m still trying to find what&#39;s the problem exactly, in order to fix it.\r<br />\r<br />[i]I see it has scripts. Are you sure they won&#39;t screw up my savegame?[/i]\r<br />Don&#39;t worry, these scripts are minimal, and they stop their execution when the dragon aspect effect wears off. Just follow the uninstallation instructions above in case you don&#39;t want this mod anymore.\r<br />\r<br />[i]When I swim I can&#39;t see the wings/tail/armor. What&#39;s happening?[/i]\r<br />This, my fellow, is a engine issue. The game does not render properly meshes that use BSShaderEffects (transparent textures) while they&#39;re underwater and there&#39;s no object behind them, like a rock, the floor or your character. This issue happens with the flaming effect on bound weapons and most of the spells too. Sorry, but there&#39;s nothing I can do to solve it.\r<br />\r<br />[i]Can I fly? I believe I can fly&#33;[/i]\r<br />Go ahead, you can try, but you&#39;ll be kissing the floor in just no time. However, if you decide to install Flying Mod Beta http://www.nexusmods.com/skyrim/mods/15775/? you can also install the Flying Mod Addon on this mod&#39;s Install Wizard. Flying Mod Addon makes the flying spell available only while you&#39;re under the effects of the Dragon Aspect Shout, and also will tell you when it&#39;s about to finish. So don&#39;t worry about becoming a big splat on the floor without previous warning.\r<br />\r<br />[i]Will I be able to use those new shouts/spells anytime?[/i]\r<br />Only while Dragon Aspect is active.\r<br />\r<br />[i]WHY U NO REMOVE ONE DAY RESTRICTION?&#33;1&#33;[/i]\r<br />That would be too OP, and if you use the shout again while you&#39;re still under it&#39;s effects, your DA armor, tail and wings will disappear.\r<br />\r<br />This is my first mod, yay&#33; If you like it, don&#39;t forget to endorse, vote and have fun&#33;\r<br />Bugs? Suggestions? Spelling or grammar mistakes? Don&#39;t hesitate to comment.\r<br />\r<br />[line]\r<br />\r<br />[b][u]Permissions:[/u][/b]\r<br />You can use the tail, scripts and spells on your mod, as long as you credit me, and send me a link to it when you release it. For anything regarding to the wings, talk to Anton. Don&#39;t upload this mod to other sites without my permission.\r<br />\r<br />[line]\r<br />\r<br />[b][u]Credits:[/u][/b]\r<br />-Bethesda for Skyrim and Creation Kit.\r<br />-Anton for his animated wings.",
  "categoryId": "24",
  "version": "1.2c",
  "author": "Stania",
  "createdUnix": "1400911291",
  "updatedUnix": "1403505768",
  "containsAdultContent": false,
  "uploadedBy": "Stania",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114216",
      "name": "More Draconic Dragon Aspect v1.2c",
      "version": "1.2c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3050",
      "fileName": "More Draconic Dragon Aspect v1.2c-54306-1-2c.rar",
      "uploadedUnix": "1403505512",
      "modVersion": "1.2c",
      "virusScanUrl": "https://www.virustotal.com/file/ea0d1b3349fabd9d4dd224f7587e1ca05cc11b66cf2c8bdc8c4518c927147d55/analysis/1408139322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Draconic%20Dragon%20Aspect%20v1.2c-54306-1-2c.rar?fid=1000114216&ttl=1535838393&ri=8192&rs=8192&setec=f6d3fc7094b9c6ee92383860526fa145"
    },
    {
      "fileId": "1000114218",
      "name": "More Draconic Dragon Aspect - Custom Colors v1.0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7774",
      "fileName": "More Draconic Dragon Aspect - Custom Colors v1.0-54306-1-0.rar",
      "uploadedUnix": "1403505768",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/82de0e13cb0d9b8b2a3eb1117befd63e6dd7f70ca6a94ce3ceb90dac3b447369/analysis/1408139344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Draconic%20Dragon%20Aspect%20-%20Custom%20Colors%20v1.0-54306-1-0.rar?fid=1000114218&ttl=1535838393&ri=8192&rs=8192&setec=7c038f1fd5549cd06844b2c41065f0a9"
    }
  ]
}