{
  "modId": 54307.0,
  "modName": "The Skyrim Sweepers and The Sweep Follower System",
  "summary": "The new follower System, The Sweep Follower. They pick up items with following you.",
  "descriptionHtml": "(I am not good at English. I hope you&#39;ll understand my English.)\r<br />\r<br />[b][size=5]The new follower System &#34;The Sweep Followers&#34;[/size][/b]\r<br />\r<br />[b][color=#ffe599][size=4]This MOD adds the following to the game.[/size][/color][/b]\r<br />[list][*]The new follower System &#34;The Sweep Follower&#34;. They pick up items with following you.\r<br />[*]9 NPCs (They are the Skyrim sweepers or hyenas.) and a number of markers for them all over Skyrim\r<br />[*]The small inn located south of Drelas&#39; Cottage, and the inn keeper\r<br />[*]Some objects and markers in Belethor&#39;s General Goods\r<br />[/list]\r<br />[color=#ffe599][size=4][b]Requirement[/b][/size][/color]\r<br />[list]\r<br />[*]The Skyrim Script Expander (SKSE), Version 1.6.16 (or newer)\r<br />[*]Hearthfire(DLC)\r<br />[/list]\r<br />[color=#ffe599][size=4][b]Update[/b][/size][/color]\r<br />\r<br />The patch for Dawnguard is updated.\r<br />\r<br />[Version 1.3.0]　Overwrite the old files to the new ones. \r<br />The sweep follower\r<br />[list]\r<br />[*]Improved the script of &#34;Go and sell all items&#34;. Removed the possibility that the game marely crashes, when the sweep follower has some items which haven&#39;t been stacked up correctly. This seems happen occasionally when scripts of other mods force the follower equiped the same armor which the follower has already.\r<br />[*]Modified the follower&#39;s AI packages.\r<br />[/list]The Skyrim sweepers\r<br />[list]\r<br />[*]Modified their AI packages.\r<br />[*]Changed Gaea&#39;s face mesh.\r<br />[*]In the Sweeper&#39;s Rest Inn, changed the owner of the chest of the player&#39;s bedroom to the player. You can use the chest for free.\r<br />[/list][line]\r<br />[size=5][b]Details[/b][/size]\r<br />[size=4][u]1. The Skyrim sweepers (hyenas)[/u][/size]\r<br />They run all over the holds of Skyrim with picking up items. At the weekend, they go to each city or town of the hold.\r<br />They are also peddlers and sometimes sell items they gathered. Their merchant chests are initially empty and don&#39;t respawn. If you sell something to them, they would store those items forever. \r<br />Some of them have their own Combat Style, but almost half of them are coward.\r<br />\r<br />[list][*]Whiterun : Ajjal (Khajiit)\r<br />[*]Falkreath : Gaea (Imperial child) and her dog, Blade\r<br />[*]Rift : Deslerva (Bosmer)\r<br />[*]Eastmarch : Mavrus Teril (Dunmer) and his chicken\r<br />[*]Winterhold : Nargol (Orc)\r<br />[*]Pale : Frald (Nord)\r<br />[*]Hjaalmarch : Teegla (Argonian)\r<br />[*]Haafingar : Surmina (Altmer)\r<br />[*]Reach : Geor (Breton)\r<br />[/list]\r<br />They are essential. Their details are below on the page.\r<br />You can adopt Gaea. If you get her the sweep follower, be sure to dismiss her before the adoption. If something is wrong, go to the Sweeper&#39;s Rest Inn and ask the inn keeper to dismiss all the sweep followers.\r<br />After the adoption, Gaea is not the Skyrim sweeper any more. She closes her shop too. However, you can ask her about an adventure. After this dialogue, she reopens her shop and you can get her the sweep follower again.\r<br />\r<br />[u][size=4]2. The Sweeper&#39;s Rest Inn[/size][/u]\r<br />Laire (Redguard) runs this small inn. The inn is located south of Drelas&#39; Cottage.\r<br />She is also the sweeper&#39;s boss and will tell you the location of the sweepers. You can check their current locations in the quest journal.\r<br />From the first to the third of every month, all sweepers come to this inn and pay tribute to Laire. The tribute is saved in a strongbox on a cupboard. When they become the sweep follower, they will come there to sell items and pay tribute to her from their lot.\r<br />There is a map room at the basement. All sweeper&#39;s merchant chests are in this room. If you need to access their chests, the key of the room is in the basket next to the strongbox.\r<br />\r<br />[u][size=4]3. The sweep follower system[/size][/u] (Quest ID : SL00SSF, priority : 50)\r<br />This new follower system is independent from the vanilla follower system. The max number of the sweep follower you can lead is 2. The sweep follower is protected (not essential).\r<br />The sweep followers find and pick up things around you (about 7 meters radius), not around themselves. They don&#39;t steal things (except for flora, hanging herbs and hanging meat). When you are sneaking, they stop gathering things and follow you with a distance away. In a habitation area, they don&#39;t pick up items but may catch bugs and fish they find. If they have something to eat or drink in their inventory, they have breakfast and supper.\r<br />If the sweep follower has &#34;Healing Hands&#34; or &#34;Heal Other&#34;, the follower behaves like a (impromptu) healer.\r<br />\r<br />Adult followers will find those objects.\r<br />(according to priority) Scrolls, Soul Gems, Septims, Combat Wearable (Weapons, Armors and Ammo), Ingredient, Potions, Books, Misc objects, Foods, Bugs, Fish, Crimson Nirnroot, Nirnroot, Flora.\r<br />Child followers will find those objects.\r<br />(according to priority) Scrolls, Soul Gems, Septims, Ammo, Ingredient, Potions, Books, Misc objects, Foods, Bugs*, Fish*, Crimson Nirnroot*, Nirnroot*, Flora.\r<br />*Children can&#39;t activate those objects without the optional esp file.\r<br />\r<br />Don&#39;t expect much from them. There are some items(keys, dropped weapons on death, Azura&#39;s Star...) they can not find or pick up. They don&#39;t so quickly gather items as you do.\r<br />\r<br />[b][color=#ea9999][size=3][Hire the sweep follower][/size][/color][/b]\r<br />There are two ways of hiring NPC as a sweep follower.\r<br />[color=#f9cb9c]&#34;Would you like to come with me for more junk? (Teammate)&#34;[/color]\r<br />The player&#39;s teammate flag is set to True. The sweep follower will equip the best armor in their inventory and will draw a weapon when the player draws a weapon.\r<br />[color=#f9cb9c]&#34;I don&#39;t mind if you follow me and gather junk. (Non-Teammate)&#34;[/color]\r<br />The player&#39;s teammate flag is set to False. The sweep follower will not change their outfit and will not draw a weapon when the player draws a weapon. If you have installed a lot of mods which add a number of creatures, choose this dialogue and hire the sweep follower.\r<br />[u]Child NPC is always become non-teammate follower.[/u]\r<br />\r<br />[color=#ea9999][size=3][b][Dialogues to the sweep follower][/b][/size][/color]\r<br />[color=#f9cb9c]&#34;Wait around.&#34;[/color]\r<br />If you don&#39;t order them to stop gathering things, they stay there and find things around themselves (about 10 meters radius). When you tell them to stop gathering things, they stay there and relax. When you are sneaking near a sweep follower, the follower will be sneaking and won&#39;t move. If the follower is left to wait over three days, the follower is tired waiting and will go back to you.\r<br />[color=#f9cb9c]&#34;Stop gathering items.&#34;[/color]\r<br />They stop picking up things and get after you or start to stroll there.\r<br />[color=#f9cb9c]&#34;Show me what you gathered&#34;[/color]\r<br />You are able to exchange items with them.\r<br />[color=#f9cb9c]&#34;Go and sell all items you have.&#34;[/color]\r<br />If the sweep follower is the Skyrim sweeper, the follower runs to the Sweeper&#39;s Rest Inn. After a few days, the follower comes back with some money. You will take your lot (your lot : the follower&#39;s lot = 8 : 2). All items the follower had are moved to the chest on the loft in the inn. This chest is respawning.\r<br />[color=#f9cb9c]&#34;Got a minutes?&#34;[/color]\r<br />You can give a command to the follower. This dialogue is not appear on the teammate follower, you need to point at the follower and hold the activate key to give a command.\r<br />\r<br />[size=4][u]4. You can make NPC a sweep follower.[/u][/size]\r<br />The dialogue &#34;Would you like to come with me...&#34; becomes available on NPC by using  the console.\r<br />\r<br />[list=1][*]Click the NPC, or type [u][i]prid &lt;RefID&gt;[/i][/u] and Enter.\r<br />[*]Type [u][i]addfac xx01C74D 0[/i][/u] and Enter (&#34;xx&#34; is the hex number of load order for this mod).\r<br />[/list]\r<br />It is not recommended to make next NPC a sweep follower. For example, NPC who is an actor in a random event, is not unique, has running quests or reserved quests, and is not humanoid.\r<br />All NPCs cannot always become the sweep follower.\r<br />If something is wrong, go to the Sweeper&#39;s Rest Inn and ask Laire to dismiss all the sweep followers.\r<br />\r<br />[color=#f9cb9c]&#34;Go and sell all items you have.&#34;[/color]\r<br />The sweep follower go to Belethor&#39;s General Goods and sell all items. The sale price is dependent on the follower&#39;s speech skill. All items the follower had are moved to the chest under the ladder. This chest is respawning.\r<br />They cannot enter the shop when the shop&#39;s door is closed. If Belethor is dead, you need to open the door with lock picks or the key in Belethor&#39;s coffin. Don&#39;t let them go to the shop during the quest &#34;Battle for Whiterun&#34;. \r<br />[line]\r<br />[size=5][b]Caution[/b][/size]\r<br />[list][*]The sweep follower can pick up quest items. Make sure whether they have quest items before sending them to the inn or the Belethor&#39;s shop.\r<br />[*]The sweep follower is not a porter but a scavenger. Do not give the sweep followers any important items, or those items will be lost.\r<br />[*]After the sweep follower sells all items, the sweep follower is reset and the inventory respawn.\r<br />[*]The selling price of the item improved or enchanted by player is the same as the base item.\r<br />[*]Do not use dialogues added by other mods for followers. It sometimes isn&#39;t effective or prevents the normal behavior of the sweep follower.\r<br />[*]Because the items owned by player have no ownership, the sweep follower can pick up the items of player.\r<br />[*]In a cell which doesn&#39;t have habitable location keywords, the sweep followers will continue to search the cell for items.\r<br />[/list][line]\r<br />[b][size=5]Known issues[/size][/b]\r<br />[list][*]When the sweep follower picks up armors of creatures, the sweep follower becomes naked and headless when the follower equips creature&#39;s armors. Those armors aren&#39;t displayed in the inventory and you cannot remove them from the sweep follower&#39;s inventory without using the console command. To fix the follower, say &#34;Go and sell all items you have.&#34;, and the follower will come back with normal appearance after a few days. This is almost fixed on vanilla creatures after version 1.1. If you hire the sweep follower as a non-teammate follower, you are free of this trouble.\r<br />[*]The sweep follower sometimes doesn&#39;t do fast travel or move to a cell with you. Wait (through the key T) an hour, and the follower will appear near to you.\r<br />[*]The sweep follower&#39;s AI is a little complicate. If there are other actors near the follower, this follower couldn&#39;t find items so efficiently.\r<br />[*]The sweep follower picks up items from a locked container without turning the lock.\r<br />[/list][line]\r<br />[b][size=5]Uninstall[/size][/b]\r<br />[list=1][*]If the sweep follower goes to sell items, wait until the follower comes back&#33; Dismiss all the sweep followers.\r<br />[*]In the console, type StopQuest SL00SSF and Enter. Type StopQuest SL00SSG and Enter\r<br />[*]Go to the map room at the basement in the Sweeper&#39;s Rest Inn. Take all items you have sold to the Skyrim sweepers in their merchant chests.\r<br />[*]Confirm the chest on the loft in the inn and the chest in Belethor&#39;s shop don&#39;t store any quest items.\r<br />[*]Go to somewhere far from the Sweeper&#39;s Rest Inn. Save the game. Uninstall this mod.\r<br />[/list][line]\r<br />[b][size=5]Conflict[/size][/b]\r<br />conflict with mods change the outside of Drelas&#39; Cottage.\r<br />minor conflict with mods change the cell of Belethor&#39;s shop. The chest and the markers added by this mod may be buried. I don&#39;t touch any data of Belethor and his merchant chest.\r<br />[line]\r<br />[b][size=5]Load order[/size][/b]\r<br />[u]SL00SkyrimSweeper.esp (Main file)[/u]\r<br />Before the mods which change the cell of Belethor&#39;s shop, included some lighting mods.\r<br />\r<br />[u]SL00EnableChildActivateBugsFishNirnroot.esp (Optional file)[/u]\r<br />Anywhere. However this mod will conflict with mods change the vanilla bugs, fish or Nirnroots. I simply checked the flag &#34;Child can use&#34; in the data of bugs, fish and Nirnroots in this esp file.\r<br />\r<br />[u]SL00SkyrimSweepers_DGPatch.esp (Optional file)[/u]\r<br />Creature&#39;s armors of Dawnguard(DLC) will be removed from the sweeper&#39;s inventory in accordance with the unsuitable armors list. Load it after the main file.\r<br />\r<br />\r<br />Thank you for reading it through.\r<br />\r<br />[line]\r<br />[size=5]The Skyrim Sweepers Details[/size]\r<br />They run around their located hold, and it is very difficult to find them on the road. \r<br />Please go to the Sweeper&#39;s Rest Inn south of Drelas&#39; Cottage and speak the inn keeper. She will tell you the sweeper&#39;s current location. Check &#34;Show the locations of the Skyrim sweepers&#34; in the Miscellaneous category in the quest journal and see the map.\r<br />\r<br />[size=4]Ajjal[/size] (RefID: xx021882)\r<br />Location: Whiterun (Weekend: near the gate of Whiterun)\r<br />Race: Female Khajiit\r<br />Confidence: Cowardly\r<br />Morality: Property Crime Only\r<br />Primary Skills: Sneak, Lockpicking, One-handed, Archery, Block, Pickpocket\r<br />Spells for Healer: No\r<br />Combat Style: Default\r<br />\r<br />[size=4]Gaea[/size] (RefID: xx021886)\r<br />Location: Falkreath (Weekend: the inn or the general shop or outdoor in Falkreath)\r<br />Race: Female ImperialChild\r<br />Confidence: Cautious (She&#39;ll attack creatures only.)\r<br />Morality: No Crime\r<br />Primary Skills: Archery, Sneak, Light Armor, Lockpicking, One-handed, Destruction\r<br />Spells for Healer: No\r<br />Combat Style: Prefer ranged attack\r<br />\r<br />[size=4]Deslerva[/size] (RefID: xx021884)\r<br />Location: Rift (Weekend: the market or the meadery or the bunkhouse in Riften)\r<br />Race: Female Bosmer\r<br />Confidence: Cowardly\r<br />Morality: Property Crime Only\r<br />Primary Skills: Sneak, Lockpicking, One-handed, Archery, Block, Pickpocket\r<br />Spells for Healer: No\r<br />Combat Style: Prefer ranged attack\r<br />\r<br />[size=4]Mavrus Teril[/size] (RefID: xx021883)\r<br />Location: Eastmarch(Weekend: the Gray Quarter or the Cornerclub in Windhelm)\r<br />Race: Male Dunmer\r<br />Confidence: Cowardly\r<br />Morality: No Crime\r<br />Primary Skills: Archery, Sneak, Light Armor, Lockpicking, One-handed, Destruction\r<br />Spells for Healer: HealingHands\r<br />Combat Style: Prefer ranged attack\r<br />\r<br />[size=4]Nargol[/size] (RefID: xx01D218)\r<br />Location: Winterhold(Weekend: the inn or the general shop or outside in Winterhold)\r<br />Race: Female Orc\r<br />Confidence: Cautious\r<br />Morality: No Crime\r<br />Primary Skills: Archery, Sneak, Light Armor, Lockpicking, One-handed, Destruction\r<br />Spells for Healer: Healing Hands\r<br />Combat Style: Prefer ranged attack\r<br />\r<br />[size=4]Frald[/size] (RefID: xx01D216)\r<br />Location: Pale(Weekend: the mine or the inn or outside in Dawnstar)\r<br />Race: Male Nord\r<br />Confidence: Average\r<br />Morality: No Crime\r<br />Primary Skills: Heavy Armor, Sneak, Lockpicking, Speech, Block, Light Armor, illusion\r<br />Spells for Healer: No\r<br />Combat Style: Unarmed only\r<br />\r<br />[size=4]Teegla[/size] (RefID: xx021887)\r<br />Location: Hjaalmarch (Weekend: the inn or the shop or outside in Morthal)\r<br />Race: Male Argonian\r<br />Confidence: Cautious\r<br />Morality: Any Crime\r<br />Primary Skills: Sneak, One-handed, Archery, Light Armor, Lockpicking, Alteration, Destruction\r<br />Spells for Healer: No\r<br />Combat Style: Prefer ranged attack\r<br />\r<br />[size=4]Surmina[/size] (RefID: xx01D217)\r<br />Location: Haagingar (Weekend: the inn or the farm or outside in Solitude)\r<br />Race: Female Altmer\r<br />Confidence: Cowardly\r<br />Morality: No Crime\r<br />Primary Skills: Destruction, Restoration, Alteration, Conjuration, Sneak\r<br />Spells for Healer: HealOther, HealingHands\r<br />Combat Style: Prefer ranged attack\r<br />\r<br />[size=4]Geor[/size] (RefID: xx021885)\r<br />Location: Reach (Weekend: the inn or outside in Markarth)\r<br />Race: Male Breton\r<br />Confidence: Cautious\r<br />Morality: No Crime\r<br />Primary Skills: Sneak, Archery, Light Armor, Lockpicking, Alteration, Restoration\r<br />Spells for Healer: No\r<br />Combat Style: Prefer ranged attack\r<br />\r<br />Their level is same to the Player, and don&#39;t have the level cap. They(except Frald) have the perk &#34;Light Foot&#34;.",
  "categoryId": "66",
  "version": "1.3.0",
  "author": "uni_SL",
  "createdUnix": "1400930517",
  "updatedUnix": "1436367411",
  "containsAdultContent": false,
  "uploadedBy": "UNI00SL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110203",
      "name": "EnableActivateCrittersNirnroot forChild",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "EnableActivateCrittersNirnroot forChild-54307-1-0.zip",
      "uploadedUnix": "1400914487",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ba0b58b3adb51cf53a9e6d0bcb3a86a09e1e0d96d908dcbda941c2a2dcd6a96f/analysis/1408092785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EnableActivateCrittersNirnroot%20forChild-54307-1-0.zip?fid=1000110203&ttl=1535838395&ri=8192&rs=8192&setec=2a61806dfa2ed96774927ac4d6d68b16"
    },
    {
      "fileId": "1000112628",
      "name": "EnableActivateCrittersNirnroot forChild(Japanese)",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "EnableActivateCrittersNirnroot forChild(Japanese)-54307-1-0.zip",
      "uploadedUnix": "1402496004",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d9a0e2390ba7f9d98b1c733b001cf2a93b230c1c0e6aafd5b783d122bab6c2ee/analysis/1408122051/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EnableActivateCrittersNirnroot%20forChild%28Japanese%29-54307-1-0.zip?fid=1000112628&ttl=1535838395&ri=8192&rs=8192&setec=b8d52a62b7cf678b53f010ba74472dd3"
    },
    {
      "fileId": "1000167059",
      "name": "TheSkyrimSweepers",
      "version": "1.3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1983",
      "fileName": "TheSkyrimSweepers-54307-1-3-0.zip",
      "uploadedUnix": "1436367167",
      "modVersion": "1.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/8bda84ac98b5a76eb78b68204c66fbd28f657f5f3e51fa742aa44289f5b764f4/analysis/1436367183/",
      "changelogHtml": " [Patch for Dawnguard]\r<br />- Added other creature&#39;s armors to the remove list of the sweep follower&#39;s inventory.\r<br />[The sweep follower]\r<br />- Improved the script of &#34;Go and sell all items&#34;. Removed the possibility that the game marely crashes, when the sweep follower has some items which haven&#39;t been stacked up correctly. This seems happen occasionally when scripts of other mods force the follower equiped the same armor which the follower has already.\r<br />- Modified the follower&#39;s AI packages.\r<br />[The Skyrim sweepers]\r<br />- Modified their AI packages.\r<br />- Changed Gaea&#39;s face mesh.\r<br />- In the Sweeper&#39;s Rest Inn, changed the owner of the chest of the player&#39;s bedroom to the player. You can use the chest for free. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheSkyrimSweepers-54307-1-3-0.zip?fid=1000167059&ttl=1535838395&ri=8192&rs=8192&setec=608a9336ac07161329826c205e2012b9"
    },
    {
      "fileId": "1000167060",
      "name": "TheSkyrimSweepers(Japanese)",
      "version": "1.3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1990",
      "fileName": "TheSkyrimSweepers(Japanese)-54307-1-3-0.zip",
      "uploadedUnix": "1436367306",
      "modVersion": "1.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/be92afc835d97704dfc7b160ce5312d22cfbec4eca4fe8bb221c15896eea9cf3/analysis/1436367363/",
      "changelogHtml": " [Patch for Dawnguard]\r<br />- Added other creature&#39;s armors to the remove list of the sweep follower&#39;s inventory.\r<br />[The sweep follower]\r<br />- Improved the script of &#34;Go and sell all items&#34;. Removed the possibility that the game marely crashes, when the sweep follower has some items which haven&#39;t been stacked up correctly. This seems happen occasionally when scripts of other mods force the follower equiped the same armor which the follower has already.\r<br />- Modified the follower&#39;s AI packages.\r<br />[The Skyrim sweepers]\r<br />- Modified their AI packages.\r<br />- Changed Gaea&#39;s face mesh.\r<br />- In the Sweeper&#39;s Rest Inn, changed the owner of the chest of the player&#39;s bedroom to the player. You can use the chest for free. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheSkyrimSweepers%28Japanese%29-54307-1-3-0.zip?fid=1000167060&ttl=1535838396&ri=8192&rs=8192&setec=37b125f089be84bf7b8aaab83f1849b5"
    },
    {
      "fileId": "1000167061",
      "name": "TheSkyrimSweepers DawnguardPatch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "TheSkyrimSweepers DawnguardPatch-54307-.zip",
      "uploadedUnix": "1436367411",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/204de72a42775b5e22c30dda27d8e427fa2e498db558c521cc84dc30a1ed9655/analysis/1436367422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheSkyrimSweepers%20DawnguardPatch-54307-.zip?fid=1000167061&ttl=1535838397&ri=8192&rs=8192&setec=29b1d114a93f284a13ea3820f926c3af"
    }
  ]
}