{
  "modId": 5432.0,
  "modName": "Gokstad Sailable Ship and Portable Player Home",
  "summary": "Sail in real-time, aboard an authentic, custom-modeled Viking longship.  Attack the shoreline while still moving!  Ram your ship onto the beachhead for an explosive landing! Spawn a raiding party! Enter your 100% safe Player-home at any time or place!",
  "descriptionHtml": "**********\r\nI, SLuckyD, am no longer developing or supporting this mod.\r\n**********\r\n\r\n\r\n\r\nGOKSTAD SAILABLE SHIP AND PORTABLE PLAYER HOME v1.3b\r\n- Another ground-breaking mod by SLuckyD\r\n- Including a custom book & Skyrim naval charts by Mebyon\r\n\r\n\r\n*****\r\nYOU NEED BE ABLE TO MAINTAIN AT LEAST 30fps IN-GAME FOR THIS MOD TO WORK DECENTLY.  In order to tweak your game or actual system to gain fps, see the tweak-section below for tips.\r\n30-40fps = Jumpy and Studdering Objects\r\n40-50fps = Occasional Studdering\r\n50+ fps = Flawless Operation\r\n\r\nThis mod requires a certain level of system performance; when not met, the ship\\'s pieces will appear to \\'studder\\'.  If your system is inadequate, it will NOT ruin or destroy anything.. it simply won\\'t sail as smoothly as you may want it to (using this mod will NOT adversely affect anything in-game).  For lower fps rates (<40), you should use the \\'Observer\\' or \\'Navigator\\' view modes to minimize the studder effect.  Please see the section below for more details.\r\n*****\r\n\r\nREAD THE INSTRUCTIONS BEFORE DOWNLOADING AND USING.  This Mod is still unfinished, but is 100% usable and performs as described below.\r\n\r\nONLY POST COMMENTS IF: you have something politely constructive to say, have a technical problem, or want to express your truthful opinion on the Gokstad (don\\'t forget I READ this stuff, and may respond accordingly!).\r\n\r\n\r\n[SUMMARY]\r\nSail the icy seas of the North, in REAL-TIME, using the FIRST sailable ship for Skyrim!  The Gokstad will have you and your horse out to any island or coastal location in speed, safety, and style... did I mention you can ram it into enemies on the shore?  Attack them with your bow or magic WHILE STILL SAILING.. for Skyrim drive-bys!  Optionally spawn a raiding party when you beach the ship, to help fight anything closeby.  The ship is also a safe, portable Player-home, with its own map-marker; choose from three different interiors.\r\n\r\n\r\n[DETAILS]\r\n- Adds a custom-made, precisely authentic, SAILABLE VIKING SHIP.  Modeled 1:1 scale to the real-life Gokstad longship in Norway.\r\n- The ship is also a portable & safe place to sleep, perform alchemy, or permanently store loot.\r\n- Choose from THREE different Player-home interiors; the authentic Gokstad, the IceRunner (Vanilla-clone), or Katariah (also a Vanilla-clone).  Eventually, I plan to enable followers to enter them.\r\n- Available for free at a new dock; located just North of the East Empire Company Warehouse (near Solitude).  The dock is immediately in front of the waterfront door (in the cliffside) which takes Player up to Solitude (inside the walls).\r\n- PORTABLE MAP-MARKER; located wherever the ship is.  Fast-travel is disabled while sailing, restored when stopped.\r\n- When crashing your Gokstad at a fast enough speed, it will cause fireball damage to anything nearby.\r\n- You may also opt to spawn several friendly attackers during this sequence; choose from Nord Raiders or Draugr Warriors.\r\n- Instantly travel to a distant dock; currently two to choose from - Solitude and Dawnstar.\r\n- Sail in full, REAL-TIME CONTROLS; in First OR Third Person view!  Third Person allows you to seamlessly view Player from any angle while sailing.\r\n- Animated oars automatically appear at slower speeds; while the sail unfurls when moving faster.\r\n- Player\\'s last horse ridden will also hitch a ride on the Gokstad.\r\n- Full Player controls are enabled the entire time; so Inventory and Quickslots may be accessed.  In Pilot view-mode, you are able to ATTACK ENEMIES WHILE SAILING using a bow or magic. (Navigator and Observer views prevent magic/weapons.. see below for details)\r\n- Includes a helpful navigation book created by Mebyon.  This has a naval chart in it, which I will eventually place on a mesh... similar to the \\'civil war\\' maps.\r\n- There\\'s also an in-game book which gives real-life information about the Gokstad Viking Longship in Norway.  It\\'s the first of several planned volumes relating the stories, the history, and the details of one of the oldest and most intact ships of its kind.\r\n\r\n\r\n[DIRECTIONS/USAGE]\r\nLocation:\r\n- There are pre-discovered mapMarkers for both the dock AND the ship itself (wherever it may be).  The dock is located near the EastEmpireCo Warehouse, as you travel the road toward the sea.  If you use the door from Solitude (inside the walls), it comes out at a door in the rock cliffs near the water - DIRECTLY in front of that door is where you\\'ll see the dock & the ship.\r\n\r\nStarting the sailing controls:\r\n- ACTIVATE THE OARS.\r\n\r\nPlayer-Homes:\r\n- ACTIVATE THE STOWED SAIL (or the lever on the dock), then choose \\'VISIT PLAYER HOME\\'\r\n- To return, ACTIVATE THE DECK (Vanilla ships: exit through the appropriate door)\r\n\r\nInstant Travel to Distant Ports:\r\n- ACTIVATE THE STOWED SAIL WHILE SNEAKING\r\n- Currently, only two destinations are available; hopefully will be expanded in a future version.\r\n\r\n\r\n[CONTROLS]\r\n(Watch for the speed notices in the upper-left corner of the screen.  When you see \\'full\\' you don\\'t need to press it anymore.)\r\n\r\nUSE THE DIRECTIONAL KEYS (WASD) TO CONTROL THE SHIP\r\n(As long as the button is pressed, the action still takes place; when released, ship movement still continues)\r\n** Changed/remapped directional keys or a 360 controller should work effortlessly. **\r\n\r\nFORWARD (W) - Acceleration\r\nSPRINT FORWARD (Alt-W) - Full Speed Ahead\r\nBACKWARD (S) - Brake & Reverse\r\nLEFT & RIGHT (A & D) - Turns the Ship\r\n\r\nSNEAK WHILE WEAPON DRAWN (Cntl then R) - Immediately stops the ship and exits the controls\r\n\r\nRunning aground/assaulting land:\r\n- The ship will immediately stop and end the control script when the bow runs ashore, or comes into contact with anything larger than a rock.\r\n\t* It will NOT stop if the ship is in reverse or going VERY slow.  This is for easily relaunching your ship, or in case you get it stuck somewhere.\r\n= If impact occurs at or above \\\"Ramming Speed\\\", a huge fireball is auto-cast on the entire area and explosion effects play.  The fireball is toggled OFF by default.\r\n= You may choose to have three friendly (but temporary) attackers spawn after the fireball is cast.\r\n- You may also \\'park\\' your ship off-shore by Sneak/DrawWeapon to anchor... then hop ashore for your assault or explorations.\r\n- Be aware that enemies can and WILL come aboard your ship after you... if at all possible (ie: the ship is close enough to land).  If you activate the sailing again, they will eventually fall overboard; unless they kill you first.\r\n\r\n\r\nEntering the Player-home:\r\n- ACTIVATE THE STOWED SAIL while the ship is stopped, then choose \\\"VISIT PLAYER HOME\\\"\r\n- To return back to the \\'world\\'; (Gokstad) ACTIVATE THE DECK, (IceRunner & Katariah) ACTIVATE THE DOOR which exits the boat. [Katariah has two such doors in its the top level]\r\n\r\nHorse aboard the ship:\r\n- It will automatically bring along your LAST RIDDEN HORSE.  If you haven\\'t ridden a horse since loading your current saveGame, no horse will be on the ship.\r\n- If you ram your ship up on shore (for an explosion), your horse will NOT be damaged... so don\\'t worry because I disable its \\'damagability\\' until after the explosion.\r\n\r\nAttacking enemies while sailing:\r\n- You must be in Pilot view-mode to use weapons or magic.\r\n- Simply point and shoot!  Continue using WASD to move the ship while you attack from afar.\r\n= If you Sneak-While-Weapon-Drawn, the boat will STOP sailing (without an explosion or NPC spawns).\r\n\r\n\r\n[CUSTOMIZATION MENU]\r\n** Activate the stowed sail while the ship is stopped, or the lever on the dock **\r\n\r\nVISIT PLAYER HOME:\r\nWill instantly transport you to whichever Player-home you\\'ve chosen in the Customization Menu.  The default is the Authentic Gokstad.\r\n\r\nNPC SPAWNS:\r\n1- None\r\n2- Nord Raiders\r\n3- Draugr Warriors\r\n* Will create THREE friendly attackers near the bow of the ship. (all are leveled to Player)\r\n* Occurs only when the ship is moving fast enough to have the sail up/unfurled.\r\n* Each attacker will disappear forever if killed, or thirty seconds after the last enemy in the area has been killed... whichever comes first.\r\n* Will attack anything that isn\\'t Player-Faction related (followers, spouse, housecarl, etc).  Also, because I didn\\'t want this to conflict with Vanilla or other mods, currently EVERYTHING will most likely attack them (including your followers).  [I plan to work on this in the future.]\r\n\r\nTOGGLE EXPLOSIONS:\r\n- Off by default.  On will cause a fireball to automatically be cast on the bow area if the ship is going fast enough.\r\n\r\nCRASH DETECTOR HEIGHT:\r\n1- Normal\r\n2- Medium\r\n3- High\r\n* Normal is at sea-level, Medium allows you to sail over ice floes/rocks and low land, while High ignores most anything below the TOP OF THE BOW.\r\n\r\nSET SHIP INTERIOR:\r\n1- Authenthic Gokstad\r\n2- (Vanilla) IceRunner\r\n3- (Vanilla) Katariah\r\n* All interiors have Player-storage, which is labelled such.  Anything NOT labelled will respawn and destroy anything you leave inside it.\r\n* The Vanilla interiors have all NPCs and quest-related objects removed; as well as the weapon racks.  All else has been left intact.\r\n\r\nCHANGE VIEW:\r\n1- Pilot (normal)\r\n2- Observer\r\n3- Navigator\r\n* Pilot view is the ONLY one which allows the use of weapons and magic while still sailing; Sneaking-While-Weapon-Drawn will instantly stop the ship (without an explosion or NPC spawns).\r\n* Observer & Navigator views require Player to \\'crash/beach\\' the ship to stop sailing; and may best be viewed in third person mode.\r\n* Pilot view requires at least 30-35fps to function smoothly; Observer/Navigator views allow smooth operation with as low as 20-25fps (but at the cost of not using weapons/magic while sailing).\r\n\r\n\r\n\r\n[REQUIRED]\r\n= Skyrim v1.5.26.05 or higher\r\n\r\n\r\n[UPGRADING FROM A PREVIOUS VERSION]\r\n- (SKIP THIS STEP if you don\\'t have any items in the Player-storage) start the game with the old version still enabled (and the new version NOT enabled/installed); remove the items and exit the ship, save a new saveGame away from any area this mod changes and exit Skyrim\r\n- simply overwrite the old files with the new\r\n- make sure to disable the old ESP before playing the game\r\n\r\n\r\n[INSTALLATION]\r\n- be sure to create a new saveGame BEFORE using this mod; in an area that is NOT changed by the mod\r\n- copy the contents of this mod\\'s DATA/ folder to your game\\'s DATA/ folder (recursing subfolders)\r\n- run the game; and in the Skyrim Launcher, click \\\"Data Files\\\"\r\n- make sure the box next to this mod\\'s ESP is CHECKED\r\n\t(load order shouldn\\'t make a difference, as I do NOT change anything Vanilla)\r\n- click \\\"OK\\\" then click \\\"Play\\\"\r\n- load your new saveGame and play\r\n\r\n*** After proper installation, there should be:\r\n- 1 ESP in the DATA/ folder\r\n\tGokstad Sailable Ship v1.3b.esp\r\n- 6 PEXs in the DATA/SCRIPTS/ folder\r\n\taaSLuckGokReset.pex, aaSLuckGokReturn.pex,aaSLuckGokRaiderClean.pex, aaSLuckGokSail.pex, aaSLuckGokTrigger, QF_aaSLuckGokMoveQuest_01561608.pex\r\n- 9 NIFs in the DATA/MESHES/SLUCKYD/GOKSTAD folder\r\n\tGokstadOars.nif, GokstadOarsRowing, GokstadSail5_0.nif, GokstadSail5_0A.nif, GokstadSailStowed.nif, GokstadShields1.nif, GokstadShipMainC.nif, GokstadShipMainV.nif, GokstadTentShip.nif\r\n- 2 DDSs in the DATA/TEXTURES/SLUCKYD/GOKSTAD/ folder\r\n\tgokSailStriped.dds, gokSailStriped_n.dds\r\n\r\n\r\n[KNOWN SHORTCOMINGS & IMPORTANT NOTES]\r\n\r\n*** You MUST have ridden a horse in the SAME GAME session you are currently playing; it will NOT take a horse you rode in your saveGame before loading it.  Stolen horses may not work.\r\n\r\n- Collision is not assigned to all of the boat meshes (such as the mast and the rowers\\' benches).\r\n\r\n- Inferior texturing of the custom meshes (I use Vanilla Skyrim textures, quickly mapped to my meshes for expediency)\r\n\r\n- Some of the meshes need to be tweaked to remove clipping.  Originally (in an unreleased Oblivion mod), my sails are animated using morph-targets... something that can\\'t be done in Skyrim.  For example: the \\'stowed sail\\' clips because it originally unfolded as it raised up the mast (the sails also flapped in the wind, and animate as the boat turns)... very cool, but I can\\'t do it with it Skyrim.\r\n\r\n- No NPCs, other than the temporary attackers which spawn during \\'raids\\'.\r\n\r\n- No quest or \\\"unnerfing\\\".\r\n\r\n***** It is currently using perma-persistent references in the scripting.. over a half-dozen medium res versions of them (about 100k tri\\'s or so).\r\n\r\n\r\n[KNOWN ISSUES & PROBLEMS]\r\n\r\n\\\"Something happened to my ship, and now I can\\'t access it!\\\"\r\n- Go to the dock near Solitude, pull the lever while sneaking.  Choose one of the docks.\r\n\r\n\\\"I\\'ve hit the shore (or SOMETHING) but the boat didn\\'t stop!\\\"\r\n- Either keep sailing until OUT of the land, or press the backward key (\\\"S\\\") until the boat is in Reverse.  The boat will eventually emerge and may be steered away.\r\n- I\\'ve found that certain areas sometimes may not trigger the stop sequence correctly.  I have no idea why this occurs; but if it does, the ship may finally stop when reemerging from the land.  Simply re-activate it, tap the forward key (until it starts to move a bit), then steer clear of any obstacles.\r\n\r\n\\\"I\\'ve run aground, but now I want to sail again.\\\"\r\n- Press the backward key (\\\"S\\\") to put the ship in reverse, until you can steer it away from land.\r\n- The stop-ship sequence is only triggered above a certain speed (NOT the same speed that causes explosions).  If you tap the forward key (\\\"W\\\") in order to get the ship moving slowly, you will be able to sail through anything... as long as you don\\'t increase speed any further.\r\n\r\n\\\"Sometimes the ship\\'s pieces will studder or not be in synch.\\\"\r\n- They should eventually auto-correct; if not, your system is under too much stress.\r\n- If it\\'s a problem, try the \\'Change View\\' option and set it to either Navigator or Observer.\r\n- If it\\'s STILL a glaring problem, see the following section for helpful hints.\r\n- Some of the objects may not remain in PERFECT synch, simply because of the limitations of Papyrus scripting; namely, the sail while unfurled and the oars while rowing.  I\\'ve tried to reduce this as much as possible, but I doubt I\\'ll ever be able to eliminate it altogether. (unless I drastically reduce the detail of my ship and combine the meshes into one; but I am NOT going to do that.. when I \\'hook up\\' my script to a Vanilla ship this will be eliminated in certain view-modes)\r\n\r\n\\\"Sometimes Skyrim crashes to desktop!\\\"\r\n- Recently, I\\'ve seen the game CTD for seemingly no apparent reason.  Sometimes it\\'s from the Main/Title Screen when trying to load a saveGame (or coc)... once it happened when I tried to \\'port-travel\\'.  This happens even when this mod is NOT enabled... so I suspect somthing else going on in the game.  I don\\'t use other mods, so that doesn\\'t leave anything else to blame but the game itself (already having eliminated poor system performance).\r\n\r\n\r\n[INCREASING SYSTEM PERFORMANCE]\r\n*** For IDEAL usage, this mod requires your system to maintain at least 40fps while sailing.  The ship will appear to studder/shake if your system is too stressed; and steering will be VERY \\'jumpy\\'.  Here are some tips for improving Skyrim performance.\r\n\r\n= This is a thread I started to explain all the following stuff in more detail and to discuss it.\r\nhttp://forums.bethsoft.com/topic/1370110-impact-of-system-stress-scripting-errors-on-game-performance/\r\n\r\n- This is another thread I started to illustrate the effects of script timing, mainly for other modders.\r\nhttp://forums.bethsoft.com/topic/1386736-performance-timing-testing-using-scripted-movement/\r\n\t\r\n- Enable Papyrus logging in your INI file (see the above forum thread).  Load and play a saveGame for a couple minutes, then exit Skyrim.  Look at the log.  If there are errors a mile long, you have mods installed which have erroneous scripting... get in contact with the authors and inform them (the plugins\\' names are listed in the log, along with the actual line of code the error is on).\r\n\r\nMeanwhile, I suggest disabling the problematic mods until they have been fixed.  These WILL cause severe problems with intense scripting such as mine, as well as other aspects of the game.\r\n\r\n- Do not run other programs while playing Skyrim... even the CK; other examples are Photoshop and 3DSMax.  Try to maintain at least 2.5gig of RAM free before running Skyrim.\r\n\r\n- Reduce the detail level your game is set to.  The easiest way is to click one of the default buttons in the Skyrim Launcher (Low, Medium, etc).  You may also add, remove, or change certain individual sliders or settings; either in the Launcher or editing the INI file directly.\r\n\r\n- Currently, the only \\\"magic fixes\\\" I know of to drastically boost fps rate (with relatively minimal impact to detail level) are to reduce SHADOW DETAIL, ANTIALIASING, FXAA, and/or Blur Radius (in order of impactfulness).\r\n\r\n- Another way to improve performance/fps is to reduce the sliders for VIEW DISTANCE.  Grass, objects, and items will probably be the least missed, so I suggest trying them first.\r\n\r\n\r\n[POTENTIAL CONFLICTS]\r\n- Any other mod which alters the cells Wilderness (-15,24), SolitudeDocks2 (-16,24), and/or DawnstarExterior04 (7,26).  (the cells at and just North of EastEmpire Warehouse entrance; and just outside Dawnstar)\r\n- Any other mod, INI setting, or software which alters the game of Skyrim or saveGame data\r\n- A BETA version of Skyrim; or a recently released FINAL version. (I tend to wait a couple weeks after Final releases to avoid potentially lingering drama)\r\n- NMM or other modman software may not install the mod correctly; if you have strange problems (eg: CTD), use the above directions for a manual installation.  It\\'s usually because my Data/ folder wasn\\'t extracted with recursed folders (or at all).\r\n\r\n= For specific conflicts/problems and how to resolve them, see the mod\\'s comment/discussion thread; there may be solutions to common problems, but some may require special attention.  Don\\'t be afraid to post if you get stuck or can\\'t find what you need!\r\n\r\n\r\n[UNINSTALL]\r\n- load your saveGame with this mod STILL installed/enabled\r\n- remove your belongings from the Player-storage inside the interiors\r\n- navigate Player to an area in-game that is NOT changed by the mod\r\n- create a NEW saveGame, exit Skyrim\r\n- delete this mod\\'s resources (specifically listed above, after \\\"Installation\\\")\r\n\t- the Data/Meshes/SLuckyD/Gokstad/ folder and it\\'s contents\r\n\t- the Data/Textures/SLuckyD/Gokstad/ folder and it\\'s contents\r\n\t- the \\\"aaSLuckGok..\\\" scripts located in the Data/Scripts/ folder\r\n\t- the mod\\'s ESP file\r\n- load your new saveGame and resume play\r\n\r\n\r\n\r\n[Real-Life BACKGROUND]\r\nGokstad: pronounced GAWK-shtahd (rhymes with \\\"hawk\\'s plaid\\\").  In real-life, this was the name of an area in modern Norway, now a collection of various farms, and is believed to have been one farm, estate, or \\'township\\' long ago.  The word Gokstad derives from the words \\\"gaukr\\\" (cuckoo bird) and \\\"stadir\\\" (dwelling or farm).  This \\'Cuckoo Farm\\' is where the real Gokstad Ship was found at the time of its (re)discovery in 1880, buried inside a huge earthen round-barrow called Kongshaugen (King\\'s Mound).  The barrow was named thusly because of the belief that an ancient King was buried there.  Unimaginative scholars, as they are wont to do, referred to the ship by the place where it was found.  SEE THE IN-GAME BOOK for more real-life information; located inside the Gokstad tent-ship (Player-home).\r\n\r\n\r\n[VERSION HISTORY]\r\nv1.3b\r\n- fixes not being able to exit Vanilla interiors\r\n- changes how Player exits the Gokstad \\'interior\\'\r\n- adds collision to the main ship\\'s meshes (eliminating one more object that needed scripting to move)\r\n- collision now affects actors during sailing (will push them if they are in the way)\r\n- fixes the issue of the stored oars not properly returning if the boat was stopped at slow speeds (v1.2b hotfix)\r\n- fixes issue of the ship moving while the Player remaining still; and/or CTD\r\n- reduces studdering and \\'wandering\\' of ship\\'s objects (oars, sail, etc)\r\n- removes ability to change the script timing; is now hard-coded at a flat rate (0.1)\r\n- adds ability to adjust height of crash-detector\r\n- adds ability to toggle explosion/fireball on or off\r\n\r\nv1.2b\r\n- adds two more interiors as alternative Player-homes\r\n- adds various \\'system performance modes\\', for in-game adjustment by Users\r\n- adds optional spawning of three NPCs, two different types\r\n- adds ability to change view/position of Player\r\n- adds collision to some meshes for better immersion (replaces the lever inside the mast)\r\n- adds the ability to use the mod at fps rates as low as the 20-25fps (use \\'Change View\\')\r\n- sail and oars now switch out depending on speed (sail/row and stowed)\r\n- expands functionality of the \\'ground/crash detector\\' (now detects most everything)\r\n- adds a Customization Menu in-game, so Users can tweak various aspects of the mod\r\n- tweaked for overall increase in performance on ALL systems\r\n- adds another simple dock in Dawnstar\r\n- fixed the \\'reset lever\\' on the dock\r\n\r\nv1.1b\r\n- fixes the shields from clipping into the gunwales\r\n- revamped the entire control system to allow WASD instead of sneak/mouseLook\r\n- better collision detection; adds actor detection (rather than only land)\r\n- moves Player\\'s position on the ship while sailing to the Navigator\\'s spot in the stern\r\n- adds the beginnings of the shipwright\\'s building\r\n- fixes the stowedSail from not appearing when anchoring (if far enough away from the dock)\r\n- overall stability of the script and operation (given User\\'s system maintains at least 50fps)\r\n\r\nv1.0b\r\n* requires the Gokstad Hotfix2 to also be installed\r\n- First PostCK release; remade completely using the Skyrim Creation Kit\r\n- adds a simple dock near EastEmpireWarehouse\r\n- adds a sailable ship to Tamriel\r\n- adds a static ship to an interior cell (for the Player-home)\r\n- adds the first volume of \\'History of the Gokstad\\'\r\n\r\nvBeta 1 through 3\r\n*** DO NOT USE THESE - PreCK mods may cause saveGame corruption or other problems in-game ***\r\n- Original PreCK releases\r\n- only the meshes, and a bed in the \\'tent ship\\'\r\n\r\n\r\n[CREDITS]\r\n- Mebyon: for creating the magnificent naval chart for the coastline of Skyrim, and for taking it even further by making a book with valuable game information.  ALSO for putting up with my \\'editorial comments & advice\\' during the chart\\'s development.\r\n- Bethesda: I used several Vanilla textures applied to my meshes.  I also altered a Vanilla NIF to contain my meshes (due to the shader data not being exported from 3DSMax properly); as well as using collision geometry from various Vanilla meshes.\r\n- Langskibet fra Gokstad ved Sandefjord; N Nicolaysen 1882 Kristiania, Forlagt af Alb. Cammermeyer\r\n(this is the book I used to model most of the Gokstad)\r\n\r\n\r\n[LEGAL]\r\nBethesda (or \\\"Licensor\\\" as defined in the Skyrim EULA) is not the author of the \\\"Customized Game Materials\\\" included in this package.\r\n“THIS MATERIAL IS NOT MADE, GUARANTEED OR SUPPORTED BY THE PUBLISHER OF THE SOFTWARE OR ITS AFFILIATES.”\r\n\r\nSLuckyD is not responsible for any damage these materials may cause, and/or failure to successfully deliver any stated products or services.\r\n\r\n\r\n\r\n[OTHER SLuckyD RELEASES]\r\n(availability may be limited until I can update them to 100% compatible, Skyrim Creation Kit versions)\r\n\r\n- Portable On-demand Disposable Unlimited Mannequins (SPODUM)\r\nhttp://skyrim.nexusmods.com/mods/10578\r\n\r\n- Vanilla Mannequin Script Fix\r\nhttp://skyrim.nexusmods.com/mods/10652\r\n\r\n- Moving Target Practice\r\nhttp://skyrim.nexusmods.com/mods/28336\r\n\r\n- Overlook Tower Player Home\r\nhttp://skyrim.nexusmods.com/mods/4514\r\n(this was the first Skyrim mod to offer a non-Vanilla Player-home)\r\n\r\n- Gokstad Sailable Viking Ship & Portable Player Home\r\nhttp://skyrim.nexusmods.com/mods/5432\r\n(this was the first Skyrim mod to implement real-time sailing/flying with multiple objects)\r\n\r\n- Faster Woodland Creatures\r\nhttp://skyrim.nexusmods.com/mods/4799\r\n\r\n- Wounded Knee Gulch\r\nhttp://skyrim.nexusmods.com/mods/3787\r\n(this was the first Skyrim mod to offer a new dungeon)\r\n\r\n- Ring of Fortify Carry Weight plus 10000\r\nhttp://skyrim.nexusmods.com/mods/8520\r\n\r\n- Bullseye\r\nhttp://skyrim.nexusmods.com/mods/2945\r\n(this was the first Skyrim mod to offer a new worldSpace, as well as several other \\'preCK firsts\\')\r\n\r\n\r\n[OTHER PROJECTS I\\'VE ACTIVELY CONTRIBUTED TO]\r\n\r\n- Flyable Dragon Race Revamped\r\nhttp://skyrim.nexusmods.com/mods/17178\r\n(I did the ground-detection, which auto-switches the dragon to walking mode)",
  "categoryId": "89",
  "version": "1.3b",
  "author": "SLuckyD",
  "createdUnix": "1325803819",
  "updatedUnix": "1341536719",
  "containsAdultContent": false,
  "uploadedBy": "SLuckyD",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17000",
      "name": "Gokstad Ship Preliminary Resources",
      "version": ".5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2554",
      "fileName": "Gokstad Ship Preliminary Resources-5432.rar",
      "uploadedUnix": "1325808458",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/034c53b9568f45b96e68c5214eca8c6b2a945ea853c06f21f84245c4369367d7/analysis/1406585525/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20Preliminary%20Resources-5432.rar?fid=17000&ttl=1535762126&ri=8192&rs=8192&setec=577024ac72b95af2c59c395722edaa4a"
    },
    {
      "fileId": "19821",
      "name": "Gokstad Ship vBeta1",
      "version": "b1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2418",
      "fileName": "Gokstad Ship vBeta1-5432.rar",
      "uploadedUnix": "1326575164",
      "modVersion": "b1",
      "virusScanUrl": "https://www.virustotal.com/file/527e720fb852e0d1b33a2c26a6786759ea7cc1b8d03e3fef4ff1cfb93351ff24/analysis/1406611096/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20vBeta1-5432.rar?fid=19821&ttl=1535762126&ri=8192&rs=8192&setec=37b024e795bf46049886eb921ae5de59"
    },
    {
      "fileId": "20503",
      "name": "Gokstad Ship vBeta2",
      "version": "b2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "154",
      "fileName": "Gokstad Ship vBeta2-5432.rar",
      "uploadedUnix": "1326761259",
      "modVersion": "b2",
      "virusScanUrl": "https://www.virustotal.com/file/00f659a127fe64322c64bdf3788d556b6616ec2fa6e083a2341067ba37a7c296/analysis/1406617712/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20vBeta2-5432.rar?fid=20503&ttl=1535762126&ri=8192&rs=8192&setec=5b47e88d5a302e4382332342ae471681"
    },
    {
      "fileId": "20890",
      "name": "Gokstad Ship  vBeta3",
      "version": "b3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3829",
      "fileName": "Gokstad Ship  vBeta3-5432.rar",
      "uploadedUnix": "1326895744",
      "modVersion": "b3",
      "virusScanUrl": "https://www.virustotal.com/file/4dd32974d62c165e529e7c509484e601dd09580dd090b34545e4b88766ba09c3/analysis/1406620751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20%20vBeta3-5432.rar?fid=20890&ttl=1535762127&ri=8192&rs=8192&setec=a154d7a6b821adfa3d93b26fb810de68"
    },
    {
      "fileId": "56244",
      "name": "Gokstad Ship and Player Home v1_0b",
      "version": "v1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3099",
      "fileName": "Gokstad Ship and Player Home v1_0b-5432.rar",
      "uploadedUnix": "1335379817",
      "modVersion": "v1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/909fcc5ec3de5da5d73965247a7f119a2aeccde22185e328f7599f071d112518/analysis/1406840296/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20and%20Player%20Home%20v1_0b-5432.rar?fid=56244&ttl=1535762127&ri=8192&rs=8192&setec=f8c5e5714554464a8dcc27c41a220ce4"
    },
    {
      "fileId": "56813",
      "name": "Gokstad v1_0b HOTFIX2",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Gokstad v1_0b HOTFIX2-5432.rar",
      "uploadedUnix": "1335548720",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0ab1761b222db30de7cda5cce605fb26c0e481ea47dd36f72093c548226b48ce/analysis/1406843784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20v1_0b%20HOTFIX2-5432.rar?fid=56813&ttl=1535762128&ri=8192&rs=8192&setec=fc6863ce02c0eccb938ff39bb2ab9405"
    },
    {
      "fileId": "58703",
      "name": "Gokstad Ship and Player Home v1_1b",
      "version": "1.1b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3100",
      "fileName": "Gokstad Ship and Player Home v1_1b-5432-1-1b.rar",
      "uploadedUnix": "1336171577",
      "modVersion": "1.1b",
      "virusScanUrl": "https://www.virustotal.com/file/f0a3d9b3607af3d78c51bcf2cf66df2027b1ed2a243eb99fb96446269f4167b2/analysis/1406866947/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20and%20Player%20Home%20v1_1b-5432-1-1b.rar?fid=58703&ttl=1535762128&ri=8192&rs=8192&setec=f5ff4e7a4fdc3a39286a4d2606744625"
    },
    {
      "fileId": "66762",
      "name": "Gokstad Ship and Player Home v1_2b",
      "version": "1.2b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3200",
      "fileName": "Gokstad Ship and Player Home v1_2b-5432-1-2b.rar",
      "uploadedUnix": "1339201599",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/1929631ece3068d51f6cfacdcbd1f1b81e73af8cfac417902d9dc6c9967d755d/analysis/1406947155/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20and%20Player%20Home%20v1_2b-5432-1-2b.rar?fid=66762&ttl=1535762129&ri=8192&rs=8192&setec=3688b4f533c5e7634f5df8f8e629d3fa"
    },
    {
      "fileId": "67380",
      "name": "Gokstad Ship and Player Home v1_2b HOTFIX",
      "version": "1.2b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Gokstad Ship and Player Home v1_2b HOTFIX-5432-1-2b.rar",
      "uploadedUnix": "1339434879",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/913cbacbc2e27aa3531ffc83de99531b39bc288e17c9c0b4356568c448915efc/analysis/1406953022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20and%20Player%20Home%20v1_2b%20HOTFIX-5432-1-2b.rar?fid=67380&ttl=1535762129&ri=8192&rs=8192&setec=d6385b8c551b6ff3843fc286d5df91d9"
    },
    {
      "fileId": "72482",
      "name": "Gokstad Ship and Player Home v1_3b",
      "version": "1.3b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4589",
      "fileName": "Gokstad Ship and Player Home v1_3b-5432-1-3b.rar",
      "uploadedUnix": "1341536719",
      "modVersion": "1.3b",
      "virusScanUrl": "https://www.virustotal.com/file/27694911a13cb82dd76c1bf7d9cbeb2b1e325717fe01ab47773756f839446f3c/analysis/1407004328/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gokstad%20Ship%20and%20Player%20Home%20v1_3b-5432-1-3b.rar?fid=72482&ttl=1535762130&ri=8192&rs=8192&setec=f5fe73110f8d598f033431a33c9047fe"
    }
  ]
}