{
  "modId": 54328.0,
  "modName": "Clean Slate - Main Quest Completed and All Shouts Unlocked",
  "summary": "A level one character with the main quest completed and all shouts unlocked (with no mods), utilizing minimalistic impact on the game. Only locations discovered are ones pertaining to the main questline and places with word walls, only unique items picked up are the ones found along the path of the main quest, and none of the locations with word wa",
  "descriptionHtml": "This is an alternate version of my save file &#34;Clean Slate - Main Quest Completed&#34; (http://www.nexusmods.com/skyrim/mods/39289/?) with all the dragon shouts from the word walls unlocked. I manually visited all the locations so that no shout finding quests were broken, and no word walls will play their sound and animations infinitely (which would happen if the shouts were just added manually with the console).\r<br />\r<br />Locked dungeons with word walls inside them (from various quests) were entered using the &#34;coc&#34; console command, and thus are still locked until the proper quest is started.\r<br />\r<br />This version of the save file is merely an extension of my first save file, and thus all the same things pertaining to the first save file remain the same:\r<br />\r<br />-Have not decided whether or no to kill Paarthurnax\r<br />-During Seasons Unending, Markarth was given to the Stormcloaks, and Winterhold to the Imperials -The Thalmor ambassador was allowed to stay; Ulfric had to pay compensation \r<br />(I wanted to be even, but I couldn&#39;t stand the though of the most corrupt person in all of the Empire, Maven Black-Briar, being given even more power)\r<br />-All shouts encountered on the main questline are unlocked\r<br />-The quest Discerning the Transmundane is advanced up to the point of possessing the runed lexicon, but not having returned to to Septimus Signus\r<br />-The miscellaneous quest to find someone to identify the mysterious gem (I only picked up the one outisde the Thalmor Embassy) is active\r<br />-The golden claw has been obtained, but not returned to Riverwood\r<br />-No couriers have given any letters\r<br />-Minimalistic chat options were selected with everyone\r<br />-The College of Winterhold was joined, but Mirabelle Ervine has not been talked to\r<br />-No houses have been bought\r<br />-No horses have been bought\r<br />-The character has almost no money or items, other than uniques picked up during the main quest\r<br />\r<br />\r<br />To install: extract the save file, and place it inside your Skyrim save directory. This is usually located at C:/Users/&lt;YOURUSERNAME&gt;/Documents/Games/Skyrim/Saves\r<br />\r<br />To uninstall: simply delete the file from the aforementioned location\r<br />\r<br />Compatibility\r<br />---------------------\r<br />-While it&#39;s theoretically possible that I may have broken a quest by entering a locked dungeon, I haven&#39;t run into any issues as of yet.\r<br />-I tried very hard to stay out of most event and trigger bounding boxes, using the &#34;tcl&#34; command to fly outside the walls. Still, some ambushes and events were impossible to avoid triggering. This affects several named dragon priests&#39; busting open their coffin lids (though still sleeping), a couple of NPC cutscenes started (but only the first line of dialog has been said - I could avoid triggering the rest).\r<br />\r<br />Update log\r<br />---------------------\r<br />1.0 - Initial Release\r<br />1.0 - Added versions with DLC shouts. These include just Dawnguard, just Dragonborn, and Dawnguard + Dragonborn (Some limitations apply*)\r<br />\r<br />\r<br />Regarding DLC Versions:\r<br />-----------------------------------\r<br />\r<br />I have decided for the following reasons to only include DLC-related shouts not gained during their respective main quests:\r<br />\r<br />1) Some have no word walls and could only be added by the console. It&#39;s highly probable that that would break the quests that add these shouts (such as Summon Durnehviir).\r<br />2) Certain shouts are gained through quests themselves, and would probably break if added by the console (such as Soul Tear).\r<br />3) Half of the point of these save files was to skip all the boring content I&#39;ve played through 100+ times, and jump right into the DLC&#39;s.\r<br />\r<br />If anyone absolutly HAS to have these shouts, add them yourself at your own risk, with the console command &#34;player.teachword &lt;wordid&gt;&#34;. Word ID&#39;s can be found here: http://elderscrolls.wikia.com/wiki/Console_Commands_(Skyrim)/Shouts\r<br />\r<br />*Several Dragonborn word walls are not accessible without doing their required quests:\r<br />-The Battle Fury shout was not added because only one of the three words found on the word wall inside Vahlok&#39;s Tomb get added without doing the quest. This has to do with how multi-shout word walls are handled. A normal scripted word wall trigger only gives one word. This is circumvented here and for the vanilla shout &#34;Throw Voice&#34; be using a quest to add the other two words. Since in the case of Battle Furry this quest IS the Vahlok&#39;s Tomb quest, only one word was added when I visited it without the quest. This WOULD break gaining the other two words when you went to do that quest, since the trigger is placed on the word wall.\r<br />-One of the words for the Cyclone shout could not be added without completing the required stages of the quest for Kolbjorn Barrow. This is because the triggers for the word wall aren&#39;t enabled until a certain point in the quest to unearth the barrow. This was done probably to prevent the word wall music from playing prematurely.",
  "categoryId": "43",
  "version": "1.0",
  "author": "Ulithium_Dragon",
  "createdUnix": "1400966552",
  "updatedUnix": "1400979711",
  "containsAdultContent": false,
  "uploadedBy": "UlithiumDragon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110326",
      "name": "Main Quest Complete and All Shouts - Vanilla",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1929",
      "fileName": "Main Quest Complete and All Shouts - Vanilla-54328-1-0.7z",
      "uploadedUnix": "1400966545",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/29013bac2135108a44242f5cd3c848ec9150d79f4cf8a7b409daa5320a2eb790/analysis/1408095374/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20Quest%20Complete%20and%20All%20Shouts%20-%20Vanilla-54328-1-0.7z?fid=1000110326&ttl=1535838427&ri=8192&rs=8192&setec=19149567f52a070d00792125b15f8127"
    },
    {
      "fileId": "1000110327",
      "name": "Main Quest Complete and All Shouts - Dawnguard",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2031",
      "fileName": "Main Quest Complete and All Shouts - Dawnguard-54328-1-0.7z",
      "uploadedUnix": "1400967487",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a69aef1109d1e83c4edd84d8842fc2beca920147904aba655fc037112529adf6/analysis/1408095425/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20Quest%20Complete%20and%20All%20Shouts%20-%20Dawnguard-54328-1-0.7z?fid=1000110327&ttl=1535838428&ri=8192&rs=8192&setec=b97a8348b8719bb13e10bba60b9b2ce9"
    },
    {
      "fileId": "1000110337",
      "name": "Main Quest Complete and All Shouts - Dragonborn",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2133",
      "fileName": "Main Quest Complete and All Shouts - Dragonborn-54328-1-0.7z",
      "uploadedUnix": "1400970118",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2b5e64941bff05166e688c01ea692d79b947da07cacd437e0177043b6bf85e28/analysis/1408095485/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20Quest%20Complete%20and%20All%20Shouts%20-%20Dragonborn-54328-1-0.7z?fid=1000110337&ttl=1535838428&ri=8192&rs=8192&setec=cf5208a7d5bb93fa94bcf8a3735edb01"
    },
    {
      "fileId": "1000110338",
      "name": "Main Quest Complete and All Shouts - Dawnguard and Dragonborn",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2281",
      "fileName": "Main Quest Complete and All Shouts - Dawnguard and Dragonborn-54328-1-0.7z",
      "uploadedUnix": "1400970229",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a246be3f922ce7251317bd7c67a5ec4fc9dcdb56c99e0bccf18b020d42d558fd/analysis/1408095489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20Quest%20Complete%20and%20All%20Shouts%20-%20Dawnguard%20and%20Dragonborn-54328-1-0.7z?fid=1000110338&ttl=1535838429&ri=8192&rs=8192&setec=0890da1eda73905e6049b6d821f2243b"
    },
    {
      "fileId": "1000110363",
      "name": "Generated .skse Files For People Having Issues",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4966",
      "fileName": "Generated .skse Files For People Having Issues-54328-1-0.7z",
      "uploadedUnix": "1400979711",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9b27d1fad2c5295b3f020911f04222fd675de8062144cf0f4b48d7322b85536e/analysis/1408095726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Generated%20.skse%20Files%20For%20People%20Having%20Issues-54328-1-0.7z?fid=1000110363&ttl=1535838429&ri=8192&rs=8192&setec=2c0ef3f78aed6dd62d8e47e723e1620d"
    }
  ]
}