{
  "modId": 54336.0,
  "modName": "Commoner Rabble HD",
  "summary": "Commoner clothes and housecarl clothes based on the miner clothes for male and female and housecarls set to use them with proper animations for female housecarls. All housecarls still have their default armor they just wear their new clothes when not following you. All main clothing textures using 2k resolution.",
  "descriptionHtml": "Totally FORGOT to include the clothes in leveled lists for sale at merchants DOH&#33; so I fixed that and also some npcs now wear these clothes, all carriage drives wear the white clothes and matching gloves and boots. Doesn&#39;t require dawnguard or dragonborn to work.\r<br />\r<br />Merge your mods with tes5edit merged patch&#33; http://www.youtube.com/watch?v=ue4N6JgZEOE\r<br />\r<br />Don&#39;t be scared of leveled lists mods anymore&#33;\r<br />\r<br />\r<br />\r<br />Got so tired of using miner clothes that didn&#39;t look right with gloves of any kind and some boots too. New clothes are high def textures 2k resolution with boots and gloves using 1k resolution. Clothes come in six colors white, black, brown, red, blue, green they can be found in commoner cupboardsand wardrobes and any vendors that sell clothes including radiant rainments. The commoner clothes come with their own boots and share the same gloves as housecarl outfits. \r<br />\r<br />Housecarl clothes are only for housecarls but can be found in qasmoke clothing container. Each housecarl outfit has both male and female version just in case player wants to wear them. Each housecarl has their own style of outfit which replaces the steel armor outfit for each of them. The same steel armor parts are added to their inventory so they should still have the steel armor in a saved game and a new game. The female housecarls have their animations switched to female so they don&#39;t walk around like robots. Housecarls have their own boots borrowed mesh from the jester boots. There is a leather bag on the back of the housecarl clothes. I was going for a plain sleek leather look so it wouldn&#39;t just merge visually with the rest of the game it would stand out a bit. \r<br />\r<br />When I first saw the mord sith cara mod and those gloves that was THE look I was thinking of so I did my best to make the textures for the male gloves and the boots to look the same. Might add some more clothes in the future and maybe some brown variants for the leather stuff.\r<br />\r<br />The female clothing meshes for housecarls had to be included because the bag was added. The CBBE setting for the meshes is the default curvy setting so this mod works best visually with CBBE. If anyone would like to make addons that support other female body types for housecarls please let me know thanks. \r<br />\r<br />BUGS\r<br />\r<br />So far the only bugs I know about are the bag, which I can&#39;t get to stay the right size on males housecarl clothes and a neck clipping bug in all male clothes but if your male character has long hair you won&#39;t see it. The clipping only occurs if you are using the sos light mod or some other male body replacer. If someone can fix the bag that would be great just let me know about it and if you want to include it here or not thanks. The female clothes mesh doesn&#39;t have proper skin dismemberment which means the pants clip through the boots but this is a bug from the default meshes that carried through to caliente mod and OCR mod. Wavion2 says he might be able to fix this bug on the next release of his mod so I will try to get that fixed file for this mod if he fixes it.\r<br />\r<br />Yep this mod alters leveled lists to place the things where they should be so use wyre bash or similar to get the mod working right in your game.\r<br />\r<br />CREDITS\r<br />\r<br />The original idea came from the noble female clothes mod by karmoth http://www.nexusmods.com/skyrim/mods/1393/? used that mods design as a guide and some textures from it too.\r<br />\r<br />Female miner clothes mesh used came from the OCR omnisway clothing mod by wavion2 http://www.nexusmods.com/skyrim/mods/49286/? which also uses resources from the calientes vanilla outfits for CBBE mod by caliente http://www.nexusmods.com/skyrim/mods/12273/?\r<br />\r<br />Bag for the housecarl clothes came from luddemanns armory mod by luddemann http://www.nexusmods.com/skyrim/mods/33213/? used the bag from the bard outfit which is also a witcher 2 CDProjectRED mod resource.\r<br />\r<br />Male gloves came from the witcher 2 viper assasins bluestripes mod by TH3WICK3D1 which is also a witcher 2 CDProjectRED mod resource. http://www.nexusmods.com/skyrim/mods/7807/? used the glove mesh from there.\r<br />\r<br />Female gloves came from the mord sith cara armor mod by newermind43\r<br /> http://www.nexusmods.com/skyrim/mods/50930/? used mesh and textures from there.",
  "categoryId": "60",
  "version": "v1.1",
  "author": "Dragonslayer2k12",
  "createdUnix": "1400987288",
  "updatedUnix": "1404506449",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115902",
      "name": "CommonerRabbleHD",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "67908",
      "fileName": "CommonerRabbleHD-54336-v1-1.rar",
      "uploadedUnix": "1404506449",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/882c571e9ab1499b94f6388474200c30efd4922365362596705988737b751d29/analysis/1408164557/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CommonerRabbleHD-54336-v1-1.rar?fid=1000115902&ttl=1535838444&ri=8192&rs=8192&setec=14f8ae0fa63a889d2f857d97ce428836"
    }
  ]
}