{
  "modId": 54335.0,
  "modName": "How to Remove the Shadow Aura or Glow Effect",
  "summary": "Do you notice the aura around the player, npcs and objects when they are in front of a shadow? This guide shares my game and enb ini file settings on how I removed the shadow glow, and also have very nice looking shadows.",
  "descriptionHtml": "[color=#3399FF][size=16]Shadow Glow/Aura Removal Guide[/size][/color]\r<br />\r<br />[color=#3399FF][b]INTRODUCTION[/b][/color]\r<br />\r<br />What is the &#34;shadow aura&#34;? Check the images. It is a white glow that appears around the edge of objects that are in front of a shadow. \r<br />\r<br />The shadow aura/glow occurs due to how the game blurs the edge of shadows. The fix involves not only the correct edge blur setting, but in disabling the game&#39;s own antialiasing.\r<br />\r<br />After applying the fix there is an alternative way to blur shadow edge and apply antialiasing that can be implemented.\r<br />\r<br />The guide starts with only the tweaks required in order to effectively remove the shadow aura/glow. From there it moves on to additional settings that address other issues you may face after implementing the basic fix.\r<br />\r<br />If you are new to Skyrim settings tweaking, or havent used ENB before, you&#39;re probably going to be confused. Just stick with it, take one step at a time, and you&#39;ll learn as you go. I recommend putting your my games/skyrim and steamapps/common/Skyrim folders into your Favourites list for easy access.\r<br />\r<br />[u][b]Before you begin: Backup any files you will be editing[/b][/u] - skyrimprefs.ini, skyrim.ini, and if you have ENB already then enblocal.ini and enbseries.ini\r<br />\r<br />[color=#3399FF][b]STAGE 1. THE VERY BASICS REQUIRED TO REMOVE ALL TRACES OF THE AURA/GLOW[/b][/color]\r<br />\r<br />Instructions\r<br />\r<br />1. Edit skyrimprefs.ini, changing (find and replace) or adding the following.\r<br />\r<br />iBlurDeferredShadowMask=1\r<br />iMultiSample=0\r<br />bFXAAEnabled=0\r<br />bTransparencyMultisampling=0\r<br />bDeferredShadows=1\r<br />\r<br />After making those edits, you should now find the shadow glow/aura effect gone. Its a good idea to change the file properties of skyrimprefs.ini to read-only to prevent the game launcher from making any changes.\r<br />\r<br />[b]NOTE: After doing this your shadows will probably have blocky/pixelated edges.[/b] The problem with the basic fix is that it removes the aura but also makes your shadow edges look pixelated. To smooth them out you need to use ENB.\r<br />\r<br />[color=#3399FF][b][b]STAGE 2. AFTER APPLYING THE BASIC FIX, HERE&#39;S HOW TO [/b]REDUCE SHADOW EDGE PIXELATION [/b][/color]\r<br />\r<br />So if you want no aura/glow, AND smooth shadow edges, you must next use ENB. Shadow edge blur (to reduce the blockiness) is handled very well by ENB. \r<br />\r<br />[b]For those who have never used ENB before: [/b]ENB is not only to make the game more pretty (people make ENB Presets to do that). It can actually be used to improve performance, or to fix visual problems with the original graphics.\r<br />\r<br />Instructions:\r<br />\r<br />1. Download latest version of ENB. You can download it here [url=http://enbdev.com/download_mod_tesskyrim.html]http://enbdev.com/download_mod_tesskyrim.html[/url] (the download links there are at the bottom of the page). \r<br />\r<br />After downloading it, extract the contents of the Wrapper version into your Skyrim folder.\r<br />\r<br />Also, in skyrimprefs.ini you need to set this:\r<br />bFloatPointRenderTarget=1\r<br />\r<br />2. Okay now launch the game for a testrun. If you had not previously installed ENB, you should find that the default ENB settings should result in nice looking shadows without having to change anything. But if you want to know how to adjust shadow blur in ENB settings, read on...\r<br />\r<br />3. Open enbseries.ini for editing (which is now located in your main Skyrim folder after extracting the ENB files there). I just use Notepad for this.\r<br />\r<br />4. Press Ctrl+F (or Search/Find function) and look for ShadowBlurRange. By default it should be =2.0. This is the setting that you should now adjust for shadow blockiness. If you had not previously installed ENB, you should find that the default ENB settings should result in nice looking shadows without having to change anything.\r<br />\r<br />[b]Important:[/b] after applying the basic fix, and then installing ENB, you must now leave the iBlurDeferredShadowMask setting in skyrimprefs.ini alone. Leave it at =1. If you set it to =0 you will get dithered/cross-checked shadow edges. If you increase it more than =1, the shadow glow will reappear.\r<br />\r<br />5. There is another ENB settings file, enblocal.ini. This file mostly has settings to improve performance. Make sure it has UsePatchSpeedhackWithoutGraphics=false . This means that it will use the settings of enbseries.ini. The Speedhack refers to ENBoost features, which can improve performance but make little-to-no changes to vanilla visuals. But we need to utilise some of ENB&#39;s visual features to fix shadows, so make sure it is =false.\r<br />\r<br />[color=#3399FF][b]STAGE 3. HOW TO MAKE THE GAME LOOK THE SAME AS VANILLA AFTER INSTALLING ENB[/b][/color]\r<br />\r<br />If you&#39;re like me, you don&#39;t like to change the look of the game with ENB. I only use ENB to apply fixes and improve performance - other than that I want the game to look the same as vanilla.\r<br />\r<br />The following instructions were given to me by user --Jawz-- over at the ENB forum.\r<br />\r<br />&#34;If you are using the ENBSeries default shader files .fx and .ini files you should look inside the enbeffect.fx to disable the post-processing effects of ENBSeries.\r<br />\r<br />In that file look for these lines;\r<br />\r<br />#define POSTPROCESS 3 // Enter a 0 here to disable ENBSeries shader effects\r<br />\r<br />//#define APPLYGAMECOLORCORRECTION // Remove the the two forward slashes // in front of the #define to activate Skyrim vanilla shader effects.\r<br />\r<br />In enbseries.ini, skip enabling the UseOriginalPostProcessing and espescially UseOriginalObjectsProcessing if you want to use the shadow feature or similar effects. [I think he means set both of those to =false]\r<br />\r<br />When you have set the enbeffect.fx properly and you use the default values found in the enbseries.ini (generate a new one by deleting your current one and load up the game) you should have a vanilla looking game. Some effect values are not in a vanilla state order but those are the &#34;real&#34; special effects.&#34;\r<br />\r<br />Note: Whilst --Jawz-- recommends deleting files in order to generate new ones, I would instead just extract them from the ENB installation zipped folder (where they have remained fresh and unedited).\r<br />\r<br />[color=#3399FF][b]STAGE 4. ANTIALIASING (AA) OPTIONS THAT ARE COMPATIBLE WITH THE FIX[/b][/color]\r<br />\r<br />Having to disable the game&#39;s own AA obviously means youre going to have jagged, pixelated edges now. So here are 3 other options to fix that too.\r<br />\r<br />[b]OPTION 1: ENB&#39;s own AA options.[/b]\r<br />\r<br />Open enblocal.ini. Scroll down to [ANTIALIASING] and set the following:\r<br />\r<br />EnableEdgeAA=true\r<br />EnableSubPixelAA=true\r<br />EnableTemporalAA=false\r<br />EnableTransparencyAA=true\r<br />\r<br />Note: It has been reported to me by user EssArrBee over at the STEP forum that &#34;The ENB AA for transparency is not performance friendly at all. The other three AA types in ENB are very performance friendly, but EdgeAA can cause blurriness and Temporal can cause ghosting.&#34;\r<br />\r<br />[b]OPTION 2: Use injectSMAA.[/b] Recommended&#33;\r<br />\r<br />The aura fix is compatible with injectSMAA. Hooray. What is injectSMAA, you ask? It is a superb form of antialiasing (reduced jaggies on edges) that performs very well.\r<br />\r<br />If you use injectSMAA, you should be able to disable all the antialising settings in enblocal.ini. But you may want to enable certain of the ENB AA settings in cae injectSMAA misses anything.\r<br />\r<br />For instruction on how to add it, check this guide [url=http://wiki.step-project.com/Guide:ENB#tab=SMAA]http://wiki.step-project.com/Guide:ENB#tab=SMAA[/url]\r<br />\r<br />Please note: Read all the instructions in that guide&#33; Its important that you change the filename of d3d9.dll included in the injectSMAA zip folder to d3d9_smaa.dll - dont overwrite the original d3d9.dll&#33; I recommend that you extract the zip into a different folder and make the filename change there before copying to your Skyrim root folder.\r<br />\r<br />Its not actually complicated to do this, and is certainly worth it. I use the ultra preset for amazingly smooth edges. The only issue with it is that the game&#39;s text becomes a little too smoothed out but its still readable.\r<br />\r<br />[b]OPTION 3: Driver-forced AA.[/b] Recommended for trial by advanced users, but untested by me, may reintroduce same problem as game&#39;s own AA (the hard white edge), and possibly no better than Option 1 or 2.\r<br />\r<br />If youre an &#34;advanced user&#34;, in that youre using programs like RivaTuner and Inspector, you could try forcing an AA option in the profile for tesv.exe. Nvidia Control Panel itself is inadequate, as the only option there is for Antialising - Transparency which only affects images with transparent textures.\r<br />\r<br />[color=#3399FF][b]IMPROVEMENTS??[/b][/color]\r<br />\r<br />My desire is to remove the aura with the lowest amount of changes to the vanilla look of the game. Unfortunately ENB is a necessity because its the only way to smooth out the shadows after applying the fix. To be honest Im not sure what the best/optimal settings for ENB are to preserve the vanilla look of the game, and not introduce other graphical problems.\r<br />\r<br />So if you are able to improve upon anything I suggest in the guide, especially in regards to ENB settings, please let me know in the comments.\r<br />\r<br />[color=#3399FF][b]MY OWN SETTINGS[/b][/color]\r<br />\r<br />Keep in mind that if you want to use the same settings as I run that I have a 4770K CPU and 780Ti GPU. \r<br />\r<br />These settings wont make shadow edges soft&#33; They do look okay though in my opinion.\r<br />\r<br />1. I set Ultra quality preset in the Skyrim launcher and tweak from there.\r<br />\r<br />2. I use all of defosh369&#39;s ultra quality shadow tweaks. But I set fShadowDistance=7000 instead of 3800, because I dont like shadow pop-in. \r<br />\r<br />defosh369&#39;s shadow tweaks can be found here: [url=http://www.nexusmods.com/skyrim/mods/7638/?]http://www.nexusmods.com/skyrim/mods/7638/?[/url]\r<br />\r<br />All shadow resolution settings in skyrimprefs.ini and skyrim.ini I set to 8192.\r<br />\r<br />3. I use latest version of ENB - [url=http://enbdev.com/download_mod_tesskyrim.htm]http://enbdev.com/download_mod_tesskyrim.htm\r<br />[/url]\r<br />As detailed in the guide above, I use ENB but try to retain vanilla visuals. I really only use it for Speedhack/ENBoost, and the visual features are only enabled (UsePatchSpeedhackWithoutGraphics=false) in order to fix the shadow aura problem.\r<br />\r<br />I&#39;d like to use ENB for Detailed Shadows as they are able to blur the edges instead of skyrimprefs.ini&#39;s iBlurDeferredShadowMask. In theory its better and ideal solution after applying the no-aura fix. But for me ENB&#39;s Detailed Shadows causes a bug/glitch/artifact of a dark &#34;shadow ray&#34; hanging in the air between the object and the shadow drawn on the ground. See screenshot 3 above.\r<br />\r<br />4. I use injectSMAA with low preset. It has good performance and doesnt soften the text edges too much.\r<br />\r<br />[color=#3399FF][b]OTHER RECOMMENDED GUIDES[/b][/color]\r<br />\r<br />[b]Skyrim Stability Guide by FireFreak111[/b]\r<br />An excellent tweak guide that greatly improved my game performance and stability.\r<br />Link: [url=http://www.nexusmods.com/skyrim/mods/50244/?]http://www.nexusmods.com/skyrim/mods/50244/?[/url]\r<br />\r<br />[b]Skyrim Total Enhancement Project ENB Guide[/b]\r<br />Some good information if you are new to using ENB.\r<br />Link: [url=http://wiki.step-project.com/Guide:ENB]http://wiki.step-project.com/Guide:ENB[/url]",
  "categoryId": "62",
  "version": "1.1",
  "author": "zyg0tic",
  "createdUnix": "1400978945",
  "updatedUnix": "1401201847",
  "containsAdultContent": false,
  "uploadedBy": "zyg0tic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110361",
      "name": "Shadow Glow Aura Removal ENB Files",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Shadow Glow Aura Removal ENB Files-54335-1-0.zip",
      "uploadedUnix": "1400978940",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/893bb8dca985e43deb54791d59ab44d25d7405a49e46feb33b422a3a190ea97b/analysis/1408095662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shadow%20Glow%20Aura%20Removal%20ENB%20Files-54335-1-0.zip?fid=1000110361&ttl=1535838442&ri=8192&rs=8192&setec=c75b7e56321092d441f2332b0699319c"
    },
    {
      "fileId": "1000110720",
      "name": "Customised ENB ini files for shadow aura fix",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Customised ENB ini files for shadow aura fix-54335-1-1.zip",
      "uploadedUnix": "1401201847",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7c06760c71526c6a44cf5e45fc35eb33941915090f165b2df50b700782dda481/analysis/1408099325/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Customised%20ENB%20ini%20files%20for%20shadow%20aura%20fix-54335-1-1.zip?fid=1000110720&ttl=1535838442&ri=8192&rs=8192&setec=8e63b9f94a070a201efa67e7c1b18070"
    }
  ]
}