{
  "modId": 54350.0,
  "modName": "Ancient Nightingale Gear",
  "summary": "New enchantments and better Nightingale gear. Hood replaced by a circlet for those of us who want to see our characters face and enjoy our nice hairdos. No enchantment drain for Nightingale weps.",
  "descriptionHtml": "[center][font=Trebuchet MS][color=#cc4125][b][size=6]Mod works as intended, so don&#39;t expect any updates.[/size]\r<br />[b][size=4]I don&#39;t develop old mods any more.\r<br />[/size][/b]\r<br />[url=https://www.facebook.com/elianorapwnsu][img]http://i.imgur.com/267fYFk.png[/img][/url]\r<br />[url=https://www.youtube.com/c/Elianora][img]http://i.imgur.com/bGTVC9s.png[/img]\r<br />[/url][/b][/color]____________________________________________[/font][/center]\r<br />\r<br />I hate hiding my character&#39;s face but I do love those sweet, sweet matching set perks. So I made a Nightingale Circlet, thanks to johnskyrim I was able to borrow a nice Ebony circlet model and texture. [b][url=http://www.nexusmods.com/skyrim/mods/41603/?]GO CHECK OUT HIS MOD HERE[/url][/b]\r<br />\r<br />I also think for such a legendary unique armours and weapons, the gear you get in the game is lacklustre. So I made my own enchantments. Adds Ancient Nightingale armour set and Ancient Nightingale weapons to the Nightingale Hall.\r<br />\r<br />REQUIREMENTS: \r<br />- Skyrim up to date\r<br />\r<br />LOCATION:\r<br />\r<br />At a chest in the Nightingale hall:\r<br />[youtube]fatJ7hryS9Y[/youtube]\r<br />\r<br />:: STATS AND IMPROVING ::\r<br />\r<br />The items are based on top-tier Nightingale gear. The armour is temperable the way the vanilla armour is (Void Salts) and the Nightingale weapons require Daedric smithing perk (Ebony ingots. no need for Arcane Blacksmith perk)\r<br />\r<br />&bull; Maintains vanilla keywords so should be compatible with reproccers\r<br />\r<br />ARMOUR: \r<br />\r<br />&bull; The armour uses a link to vanilla mesh location, so if you have a replacer (no cape) or a retexture, they will be applied to the Ancient set as well (any body mod you&#39;re using etc.)\r<br />&bull; See the pictures provided to see the new enchantments.\r<br />&bull; Circlet has support for all races.\r<br />\r<br />WEAPONS: \r<br />&bull; The weapons have their vanilla top-tier enchantments, but I removed the dumb drain effect on them. These are Daedric artifacts of awesomeness. They shouldn&#39;t just run out of charge like a puny normal weapon. \r<br />\r<br />:: RECOMMENDED MODS ::\r<br />&bull; [url=http://www.nexusmods.com/skyrim/mods/3765/?]This retexture and remodel (remove cape)[/url]\r<br />&bull; [url=http://www.nexusmods.com/skyrim/mods/33704/?]I use this weapon retexture for the bow and blade[/url]\r<br />There are no proper rewards for completing the TG questline, so I made this to get myself feel like I actually accomplished something after all that work. Plus I want to enjoy my mischief and adventuring, not be recharging my weapon all the time. And honestly the frost resist enchantment and ridiculous 40+ to stamina are completely obsolete in this game. \r<br />\r<br />NOT IN TG BUT WANT THE GEAR? \r<br />[i]coc nightingalehall01 to the console and grab them[/i]\r<br />\r<br />Disclaimer: I made this for myself, and thought others might enjoy it as well. The enchantments are not the greatest, but they are something that is important to me personally. So no, I won&#39;t change anything in it :)",
  "categoryId": "54",
  "version": "1.0",
  "author": "Elianora",
  "createdUnix": "1401031537",
  "updatedUnix": "1401030576",
  "containsAdultContent": false,
  "uploadedBy": "Elianora",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110447",
      "name": "Ancient Nightingale Gear",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3412",
      "fileName": "Ancient Nightingale Gear-54350-1-0.rar",
      "uploadedUnix": "1401030576",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1e8a0b71c4aa2c842a83dbcc630f394f165ffdedb13edf83264a6222740ac259/analysis/1408096578/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ancient%20Nightingale%20Gear-54350-1-0.rar?fid=1000110447&ttl=1535838465&ri=8192&rs=8192&setec=930ad387e730ead650ddb89b631fc7bd"
    }
  ]
}