{
  "modId": 54389.0,
  "modName": "Ages Of The Past (BETA)",
  "summary": "Myst/D&#39;ni themed mod",
  "descriptionHtml": "This is going to be a Myst/D&#39;ni themed mod, something I worked on a long time ago. So I pulled it back out, cleaned the dust off it and I am going to start working on it again. I am open to any thoughts and anyone who may want to help.\r<br />\r<br />This is a beta some things may be broken.\r<br />\r<br />NOTE: Official DLC requirements Hearthfire\r<br />\r<br />The story:\r<br />No one knew who the stranger was or where he came from, all that was known was he was not from the races of Tamriel. Some think that he was from the collage as he was seen writing a strange language in the books he always had with him some way that he would vanish right in front of them as he was reading a book but he did not use any other magic.\r<br />\r<br />One day one my way to Riverwood I saw the stranger it, look as if he had been in a battle he had a large book with him the likes of which I have not seen in all of Skyrim he wrote something in the book and a cave appeared as if by magic and he went inside I followed him inside the cave but he was gone and the cave was empty with no other way out.\r<br />\r<br />I went back to the cave a few times but did not find anything inside, I did find a few books outside the cave that were blank the book you are reading now is one of them I had hope that the books were magic somehow but it looks like they are not. I spent many days watching the cave to see if the stranger would come back out, but he was not seen in Skryim again.\r<br />",
  "categoryId": "30",
  "version": "1",
  "author": "MercAngel",
  "createdUnix": "1401147800",
  "updatedUnix": "1401148058",
  "containsAdultContent": false,
  "uploadedBy": "MercAngel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110669",
      "name": "Age Of The Past V1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7367",
      "fileName": "Age Of The Past V1-54389-1.7z",
      "uploadedUnix": "1401148058",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/11cf86a46beb60dd8404187bf802ddfa2e76e80a2406767c2474280935b45190/analysis/1408098607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Age%20Of%20The%20Past%20V1-54389-1.7z?fid=1000110669&ttl=1535838550&ri=8192&rs=8192&setec=41cb27f7bf35c3dbe23f521c588648c0"
    }
  ]
}