{
  "modId": 54413.0,
  "modName": "Faraena--an Altmer follower",
  "summary": "Adds a beautiful Altmer spellsword follower.  Find her in the Drunken Huntsman.",
  "descriptionHtml": "[b][u]Info:[/u][/b]\r<br />Adds an Altmer follower named Faraena.  She&#39;s a spellsword that can be found in the Drunken Huntsman in Whiterun.  She&#39;s equipped with steel armor and a dagger.  Currently there is no quest or any other requirement in order to get her; just walk inside the Drunken Huntsman and ask her to follow you.  When dismissed, she returns to the Drunken Huntsman.\r<br />\r<br />I really love the Altmer, but was disappointed that there was hardly any that weren&#39;t enemies--just one (rather lousy) marriage candidate and no followers in the vanilla game.  I get the whole Aldmeri Dominion thing, but not all Altmer are diehard Thalmor Justiciars.  Faraena is an Altmer whose loyalty lies with Skyrim (and the Dragonborn), though most Nords distrust her just the same, so she spends her time in the Drunken Huntsman with some of the other elves.  In the future I hope to add some backstory explaining all of this in a letter/journal or perhaps a short quest, but for now you&#39;ll just have to use your imagination as to why this Altmer sees herself as a daughter of Skyrim.\r<br />\r<br />This is my first follower mod, done quickly to learn the basics.  I&#39;ve taken her through a few battles and dismissed/recruited her a few times from various places.  Everything seems to be working properly.  She&#39;s also a marriage candidate, though I have not personally tested this feature.  She levels with the player from 5-80, uses the vanilla follower system, and is protected status (NOT essential--not everyone likes essential followers, and those that do probably already have mods installed that change that).  In some interior lighting, she appears quite green, but outside she looks great.  I used a Thalmor Wizard as a basis, and made changes from there.  She uses &#34;ThalmorDagger&#34; as her weapon, which means it could vary in your experiences, and upon death she&#39;ll drop &#34;ThalmorLoot.&#34;  It felt fitting, especially for the backstory I may add in the future, so I left those things alone.  However, she wears a very Nordic set of steel armor as her default outfit.\r<br />\r<br />I would appreciate any feedback/tips.  I hope to keep expanding my modding skills and improve Faraena and maybe add more followers in the future.\r<br />\r<br />[u][b]Compatability:[/b][/u]\r<br />There shouldn&#39;t be many conflicts.  Anything that significantly alters the Drunken Huntsman&#39;s interior may interfere with her spawning.  She uses the vanilla follower system, so she should work perfectly with any follower overhauls that modify that system.\r<br />\r<br />[u][b]Installation[/b][/u]\r<br />--Use NMM to install (I believe everything is set up correctly, but this is my first mod that isn&#39;t just an esp), or manually copy the Faraena.esp and meshes and textures folders.  Say &#34;yes to all&#34; when asked to merge the folders.\r<br />[u][b]Uninstallation[/b][/u]\r<br />--Use NMM, or delete Faraena.esp, the folder found at meshesactorscharacterFaceGenDataFaceGeomFaraena.esp, and the folder found at texturesactorscharacterFaceGenDataFaceTintFaraena.esp\r<br />\r<br />[u][b]Recommended Mods:[/b][/u]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/15524/?]Amazing Follower Tweaks by Dheuster[/url]--My preferred follower overhaul mod; makes leveling, combat style, outfit management, etc. really easy and efficient to modify on the fly.\r<br />--[url=http://www.nexusmods.com/skyrim/mods/18045/?]My Home is Your Home by Volek[/url]--Give Faraena a home other than the Drunken Huntsman.\r<br />--[url=http://www.nexusmods.com/skyrim/mods/2666/?]CBBE-Vanilla by Caliente[/url]--Used in my screenshots above.  Really improves the looks in a lot of subtle ways by just being better than what Bethesda provided.  (Also, I really hope I didn&#39;t accidentally steal any of Caliente&#39;s stuff when I made Faraena; I&#39;m still not entirely sure how mesh/texture replacers affect character creation in the CK).\r<br />\r<br />[b][u]My Other Mods:[/u][/b]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/55574/?]Ancient Falmer Ivory Glass Weapons[/url]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/55689/?]Bloodskal Stahlrim Armor[/url]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/55428/?]Chillrend Weapons[/url]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/53847/?]Fort Dawnguard No Cobwebs[/url]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/53979/?]Dawnguard Armor Expanded[/url]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/55596/?]Karliah&#39;s Dagger[/url]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/55849/?]Quicksilver Elven Set[/url]\r<br />--[url=http://www.nexusmods.com/skyrim/mods/55060/?]Skaal Shack[/url]",
  "categoryId": "96",
  "version": "1.0",
  "author": "GyntRyles",
  "createdUnix": "1401247485",
  "updatedUnix": "1401247363",
  "containsAdultContent": false,
  "uploadedBy": "GyntRyles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000110777",
      "name": "Faraena",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "182",
      "fileName": "Faraena-54413-1-0.zip",
      "uploadedUnix": "1401247363",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e884e428eadb3ce9aa4acff1680495b59cef6ba60ab66ad2e4d330073f662191/analysis/1408099984/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Faraena-54413-1-0.zip?fid=1000110777&ttl=1535838584&ri=8192&rs=8192&setec=088023b5b2640aa4d92b2d87a9dcdaec"
    }
  ]
}