{
  "modId": 54460.0,
  "modName": "Daltonious Sul- Custom Voiced Mage Companion",
  "summary": "Daltonious Sul is the great-great nephew of the fool who triggered The Red Year. A powerful mage with much to say, Sul is willing to help out any fellow adventurer he meets. However, he may need a bit of help clearing out a custom dungeon that he comes along with.",
  "descriptionHtml": "[b]Short Description:[/b] \r<br />Daltonious Sul is the great-great nephew of the fool who triggered The Red Year. A powerful mage with much to say, Sul is willing to help out any fellow adventurer he meets. However, he may need a bit of help clearing out a custom dungeon that he comes along with.\r<br />\r<br />[b]Getting More Specific:[/b]\r<br />Sul is a powerful pyromancer companion voiced my myself. He has all sorts of idle dialog befitting an seasoned adventurer, though he&#39;s quite young. Sul comes with a brand new (but short) dungeon known as Azeltoz. Azeltoz is home to the dreaded Lizard Wizard (also custom voiced) and her odd experiments. Shall the player choose to do so, they may assist Sul in ending her reign of cold blooded terror. Journals may be found around the dungeon (check desks&#33;) that tell her story in addition to explaining the various oddities found around the dungeon.\r<br />\r<br />This isn&#39;t my first mod, but it&#39;s certainly the largest I&#39;ve done, and a lot of experimentation was involved&#33; This mod was actually done as a month long school project. That being said, this was a learning experience for me. Sul certainly isn&#39;t as good as Vilja or Anduniel, but he doesn&#39;t whine about carrying your burdens, which is nice.\r<br />\r<br />As stated, this whole mod was a learning opportunity for me, and there&#39;s still some bugs. I&#39;ll point out the ones I caught and couldn&#39;t fix for everyone. I gladly welcome criticism of the constructive variety along with any solutions to bugs that have been found&#33;\r<br />\r<br />[b]Requirements:[/b]\r<br />Latest version of Skyrim\r<br />\r<br />[b]Conflicts:[/b]\r<br />-Any mod that puts a dungeon in the middle of the icy tundra near Saarthal (unlikely).\r<br />- Sul is built off of the vanilla follower system, and should work with follower overhaul mods. I know for a fact that he works with AFT, but UFO and EFF remain untested.\r<br />\r<br />[b]Where to Start:[/b]\r<br />Azeltoz appears on your map, ready for fast travel. It&#39;s right near Saarthal.\r<br />\r<br />[b]Bugs/Glitches:[/b]\r<br />- RIGHT WHEN YOU SEE SUL, SAVE AND RELOAD. It&#39;s a damn dialog bug.\r<br />-The first cell of Azeltoz is stuck as unowned cell for some reason, despite being renamed over and over again.\r<br />- Minor clipping around the dungeon due to my poor dungeon making skills (sorry).\r<br />- One dwarven sphere refuses to attack (I purposefully left him there, I think he&#39;s cute).\r<br />- Lighting flicker in the garden area\r<br />\r<br />\r<br />[b]FAQs (Asked by my beta testers):[/b]\r<br />[b]Q.[/b] Why doesn&#39;t Sul automatically follow me for the quest?\r<br />[b]A.[/b] Because I couldn&#39;t figure out how to make that work. Luckily, the dialog allows that issue to be bypassed.\r<br />\r<br />[b]Q.[/b] Why does the Lizard Wizard sing/ why don&#39;t the bandits bleed/ why is the Lizard wizard wearing Sul&#39;s clothes/ what the heck is going on in Azeltoz?&#33;\r<br />[b]A.[/b] Read the journals found on desks around the dungeon&#33; They answer all of these little quirks in the story. Most of these are actually technical things I blended with the story. (The Lizard Wizard sings because I liked the song but couldn&#39;t get her to work properly, this was a school project so I removed some gore and Sul&#39;s gloves, hood and boots are custom and may be desired by an aspiring mage with good fashion sense.)\r<br />\r<br />[b]Q. [/b] Who&#39;s the voice of the Lizard Wizard?\r<br />[b]A.[/b] A close friend of mine who decided to dabble in voice acting. (I&#39;m trying to get her to do more&#33;)\r<br />\r<br />[b] What about this school project?[/b]\r<br />This mod was part of my Senior Project, a wonderful month long learning experience at my high school. I had to make to do something on my own which gives back to the community in some way. So, the mod itself is the gift to the community. I learned a lot about pacing myself and teaching myself along the way, and I really had a blast taking a month to do my own thing.\r<br />\r<br />[url=https://extraordinarygamegeeks.wordpress.com/]There&#39;s a development blog, if anyone&#39;s interested&#33;[/url]",
  "categoryId": "66",
  "version": "1.0",
  "author": "Glassesguy",
  "createdUnix": "1401477157",
  "updatedUnix": "1401421830",
  "containsAdultContent": false,
  "uploadedBy": "Glassesguy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000111018",
      "name": "Daltonious Sul- Custom Voiced Companion",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27608",
      "fileName": "Daltonious Sul- Custom Voiced Companion-54460-1-0.rar",
      "uploadedUnix": "1401421830",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5368b5269482d2fffb500c6b1d44fbcd94b47b28dcfaa599da9c31af2264fe6c/analysis/1408102254/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daltonious%20Sul-%20Custom%20Voiced%20Companion-54460-1-0.rar?fid=1000111018&ttl=1535838661&ri=8192&rs=8192&setec=87c82b9b94cf1b1a9b2619654f6cd851"
    }
  ]
}