{
  "modId": 54467.0,
  "modName": "Tes Arena modmod - Notices Beverages and Trainers",
  "summary": "Adds followers, trainers and beverages to cities of Tes Arena modmod by jabr.",
  "descriptionHtml": "Updated to the latest version of Jabr&#39;s mod&#33; Those 2 people who downloaded the updated version before, please download it again, since it had a crash-on-startup stupidity on my part (to myself: don&#39;t use TESedit at 00:30...)\r<br />\r<br />Requires modular version (one esp for each town) of Tes Arena mod. \r<br />\r<br />Unique useful beverages added for Granite Hall, Vernim Wood and Dunparwall. Unique stronger Stormcloak officer helmet item is sold by \r<br />the common store owner and by the blacksmith in Vernim Wood.\r<br />\r<br />New followers in the inns of Granite Hall (Donndubhan), Vernim Wood (Adaves Harelas) and Blackmoor (Ingmarr Mead-Lover). To make them follow you, just give them a drink. Keep in mind, the option to give them a drink appears only when you have one in your inventory (If they may not seem to follow you initially, being too preoccupied with dancing, just enter and leave the inn again, or wait 6-7 seconds before recruiting them). They level from 10 to 30, don&#39;t trigger traps and have 3-5 unique idles to say.\r<br />\r<br />Some innkeepers and vendors now have unique notices about their businesses. The Argonian at Vernim Wood EEC is now also a merchant, since he&#39;s the only EEC employee in the city. \r<br />\r<br />The following places are changed:\r<br />\r<br />Granite Hall - trainers are Aenvir - archery, Earana - speech and Housecarl Agata - heavy armor. Native Reachman follower in the inn.\r<br />Vernim Wood - trainers are Ulfred - sneak, Thane Ulfgar - one-handed and Niphas Televin - alchemy. Dunmer sorcerer follower in the inn.\r<br />Blackmoor Fortress - trainers are Sarimon of Balmora - destruction, Bothiel - archery and Thane Wilhelm - light armor. Nord archer follower in the inn.\r<br />Dunparwall - trainer is Gogro gro-Shura, smithing.\r<br />Sunguard - trainers are Hjorta - restoration, Vidkun Stonevoice - block, and Erich Stonevoice - one-handed.\r<br />\r<br />The level up to which they train varies from 60 to 90, according to the trainer.\r<br />\r<br />Unfortunately, I haven&#39;t been able to create a modmod version for all-in-one so far. Working with Creation Kit and Tes5Edit was very \r<br />frustrating here, sorry. ",
  "categoryId": "89",
  "version": "4.1",
  "author": "LoneWolfEburg",
  "createdUnix": "1401438233",
  "updatedUnix": "1427224417",
  "containsAdultContent": false,
  "uploadedBy": "LoneWolfEburg",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119188",
      "name": "Tes Arena - addons",
      "version": "3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3180",
      "fileName": "Tes Arena - addons-54467-3-0.rar",
      "uploadedUnix": "1406291382",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/7fc70e8606cf8aa0d1e42d68e1787b690c5366364f164bfb6466a19c58b269e2/analysis/1406331673/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tes%20Arena%20-%20addons-54467-3-0.rar?fid=1000119188&ttl=1535838677&ri=8192&rs=8192&setec=c352da30d56cd66785062aea2189d32b"
    },
    {
      "fileId": "1000152881",
      "name": "Tes Arena - addons",
      "version": "4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3180",
      "fileName": "Tes Arena - addons-54467-4-1.rar",
      "uploadedUnix": "1427224417",
      "modVersion": "4.1",
      "virusScanUrl": "https://www.virustotal.com/file/1f92065fd4b48c34e65d3fb1499633a3638a17eafc43fdb0e6181c2f6ca0befa/analysis/1427224445/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tes%20Arena%20-%20addons-54467-4-1.rar?fid=1000152881&ttl=1535838678&ri=8192&rs=8192&setec=912b6ee9cb9e0169676b70996d33ad1f"
    }
  ]
}