{
  "modId": 54479.0,
  "modName": "White River Cottage",
  "summary": "A house near Riverwood for family and followers",
  "descriptionHtml": "[b][color=#ff0000]In light of recent changes to Valve and Steam workshop and Paying for mods.[/color]\r<br />[color=#ff0000]My mods are free to download and will remain so. [/color]\r<br />[color=#ff0000]I do not  give my permission for my mods to be uploaded to Steam Workshop or uploaded for Gaming Consols. This is not me being PC elitist. I don&#39;t own a gaming consol so I can&#39;t troubleshoot, maintain the mod or in any way be helpful to a user - if someone wants to do all that they are welcome to get in touch with me and ask to do so. \r<br />[/color]Please note permission was given to Tarshana to port the mod for Xbox.[url=https://bethesda.net/en/mods/skyrim/mod-detail/4021868]White River Cottage XBox[/url]\r<br />[color=#ff0000]I do not under any circumstances give my permission for any assets I personally have made for this mod to be used in a mod which then charges users money to download them.[/color]\r<br />[color=#ff0000]Other permissions remain as listed at the bottom of this page. [/color][/b]\r<br />\r<br />White River Cottage\r<br />\r<br />A house just outside Riverwood.\r<br />\r<br />This mod REQUIRES Hearthfire DLC to run – it will not run without it. No other DLC’s are required.\r<br />\r<br />If you wish to get your children to move in you must use [url=http://www.nexusmods.com/skyrim/mods/29249/?]TMPhoenix&#39;s Hearthfire Multiple Adoptions Mod[/url]   This mod is not dependent on it – if you don’t use it the house will work perfectly well but the children’s bedroom will remain unused and they won’t move in. \r<br />Please see the Known Issue section below for advice on using with mods which alter Riverwood.\r<br />\r<br />Fast travel is enabled after purchase, however the landing area is quite small and horses will not use it (followers on foot will). Its only a short way from the Riverwood marker so if on horseback use that and ride in. If on foot use the house marker.\r<br />\r<br />In brief:  This warm and comfortable cottage is set by the Riverwood Bridge opposite the road to Whiterun. it has a kitchen, lounge, master bedroom, followers bedroom, children’s bedroom, smithing facilities, crafting facilities, alchemy and enchanting areas and a large multi purpose relaxing room with plunge pool suitable for frostfall users.  Additionally there are a large number of heathfire planting mounds both in and outside the house, a milkable cow, chickens and a bee hive. It is not totally lore friendly as it has sofa’s and plumbed in water – I will not be doing a lore friendly version as this house was designed by me – for me. The house is purchasable – please read the for sale notice by the bridge.\r<br />\r<br />German translation here [url=http://www.nexusmods.com/skyrim/mods/57285/?]WhiteRiver Cottage –German- by MelodyOfNight[/url]\r<br />Plese note I use Skyrim URWL and my photos will reflect that lighting. One of the photos of the display area below uses vanilla lighting (thank you Bert).\r<br />\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/3LookingtowardsRiverwood_zpsd9cceac6.jpg[/img]\r<br />\r<br />[youtube]jPVz7Ulrebk[/youtube][youtube]FNbHkjfjreI#t[/youtube] \r<br />[youtube]JFzjYBrJLi4[/youtube][youtube]uWBcNTdPS9E[/youtube]\r<br />[youtube]kovB79RrzKI[/youtube][youtube]MVsVNAzXdhM[/youtube]\r<br />\r<br />thanks to Weekly Skyrim Mods, Nozi87, Skyrim Mods, Storm Forge Gaming, Hodilton and Skyrim Daily Mod Shout out for the vids.\r<br />\r<br />More detailed description:\r<br />Interior:  You enter the kitchen, by the door is storage for keys. The kitchen has chilled storage, a butter churn which gives you butter daily (it doesn’t use the hearthfire system so you will get it every day), a tabletop wheat grinder which you can use to make flour from wheat you have grown (no animation as I haven’t found a suitable one yet) all cooking facilities including a hearthfire oven, storage for your fruit and veg, cakes and pastries, with other labelled storage – all of which is themed, depending on the mods you have installed some may be useful to you – others you can use for whatever you wish. Your children, if they are living here using the Multi adoption mod will use the dining table here.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/16TheKitchen_zps1b3eed18.jpg[/img]\r<br />The lounge, entered through an archway from the kitchen, has the adult dining table, many bookcases and storage and a warm and cozy fireplace with seating. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/21Aloungetorelaxin_zpsd80fa10b.jpg[/img]\r<br />The stairs go up to the bedrooms. \r<br />The master bedroom has a bed which if you are using the Multi adoption mod will allow your spouse to sleep, although it’s a custom bed it should be usable by the Steam workshop&#39;s &#34;Another Sleep Mod&#34;. It has a desk area for the player with storage for Deeds, Notes etc and several bookcases. It also has a large amount of wardrobe storage.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/46SupposeIcouldsitforabit_zpse0870d7c.jpg[/img]\r<br />The child’s bedroom will sleep 6 (if using the multi adoption mod). They have a study area and a practise dummy, toys, a rocking horse and seating.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/30Sleepyheads_zps2a162398.jpg[/img]\r<br />From the lounge take the steps to the rest of the house. You will first reach the alchemy area. By the alchemy table there are buttons which enable all your ingredients to be stored in the jars on the shelves nearby, you can remove the items either from the jars themselves or by clicking the other button which will place everything back in your inventory. As the house isn’t slaved to the DLC’s ingredients from the Hidden Valley and Solstheim have a small storage chest. Potions, salts and the DLC ingredients will have to be stored manually. There is also a storage chest for recipes. The enchanting area opposite has glass storage for soul gems on a sorting button, and themed storage for scrolls, rings, circlets and amulets/necklaces. There is a storage chest for recipes. The area has bookcases for your spell tomes.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/24Howaboutmakingsomepotions_zpsfa53bc44.jpg[/img]\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/25Ormaybedoingsomeenchanting_zps06c21fbc.jpg[/img]\r<br />From this area the player moves to the display area.  This has 6 mannequins, labelled storage for heavy and light armor, weapons, enchanted weapons, staffs and arrows and 2 weapon display cases.  There is a display which is set up for your Skyrim masks, skull keys and Claws. The masks are individually used, the skull keys and claws you use the button on the nearby pillar to place your items but they can be removed individually. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/38Ahherearetheothers_zps2958ed3f.jpg[/img]\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/42CheckingthedisplaysMasksandClaws_zpse99d28c7.jpg[/img]\r<br />\r<br />Please note in my own game (and thus is most of these photos) I use a mannequin replacer, the mannequins in the mod are vanilla ones.\r<br />\r<br />There are also displays for the Elder scrolls, the Paragons from Dawnguard DLC, the masks from Dragonborn DLC and the Black Books from Dragonborn DLC. These displays do not operate if you haven’t got Dawnguard or Dragonborn installed – other items will be in their place as statics. If you start the game and then install a DLC midway through simply leave the house and return and the displays will then operate. \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/43CheckingthedisplaysElderScrollsandDragonbornmasks_zpsbb275d7e.jpg[/img]\r<br />With all DLC installed\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/Vanilla%20Game%20White%20River%20Cottage/Image06_zps9f61ccfc.jpg[/img]\r<br />With just Hearthfire (and vanilla lighting).\r<br />\r<br />From this area there is a door to a forge with everything you need to craft weapons and armor. It includes weapon racks, shield racks, a grinder, work bench, forge and smelter. Themed storage for ingots and ores. Storage chests for leather, pelts, linen and miscellaneous.\r<br />\r<br />From the display area there is a door to the followers bedroom, also contains wardrobe storage. Followers will undress to sleep.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/40Quietniceaccomodationforthem_zps249ecc98.jpg[/img] \r<br />From the display area there is an archway through to a general relaxation area which has a small plunge pool, a bar, more bookcases and a door off to a small toilet and sink area with changing lockers. Your followers will undress to use the pool. The pool is heated for frostfall users. This area has a large indoor garden with a number of hearthfire planting mounds. Please note since 1.6 update the bookcase nearest the fire now displays the Black Books and has Dagger Display Cases.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/36Apparentlyitinvolvesalcohol_zps2c2cb484.jpg[/img]\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/34Thisbitlooksgood_zpscad8d68a.jpg[/img]\r<br />If using the multi adoptions mod and your children are living there you can tell them to do their chores.\r<br />\r<br />Exterior: \r<br />There is a covered stable for your horse, terraces and gardens with a small number of planting mounds. If you are using the multi adoption mod and your children move in they will play tag and hide and seek, both in the area and will also join the Riverwood children to play. The area has markers for your children to do many activities.  \r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/4TheExterior_zpsc46c3cec.jpg[/img]\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/11TheConcert_zps6dd55538.jpg[/img]\r<br />The cow Maggie is set to essential and friendly to all, she is milkable – just hover the cursor over her flank and click e, she gives 2 jugs of hearthfire milk daily. \r<br />The chickens are set to essential and friendly to all, their nests will enable you to collect eggs daily. These are not the vanilla game nests but are scripted to get round the intermittent harvesting bug that plagues Riverwood so although you can gather eggs the original egg in the nest won’t disappear – I could have had it swopping out but really it’s such a minor thing and hardly noticeable that I didn’t bother.  The Beehive will give you honey and honeycomb daily – again using a script rather than the vanilla harvesting system.\r<br />[img]http://i97.photobucket.com/albums/l208/gentester/White%20River%20Cottage/5TheLivestock_zpsbae9b59b.jpg[/img]\r<br />\r<br />Known issues\r<br />\r<br />Please note this is a high end mod with a lot of resources and textures. \r<br />\r<br />The house should work with Riverwood mods PROVIDING that mod doesn’t affect the cell in which the house stands.  The house sits in cell 6/-10, cells affected by it will be  6/-11, 5/-10, and 6/-9.  If your Riverwood mod is unaffected by those cells they should work fine together.\r<br />I use it with [url=http://www.nexusmods.com/skyrim/mods/13608/?] Miss Jennabee’s Expanded Towns and Cities [/url]  with no issues whatsoever using the patch - in optionals.\r<br />\r<br />Conflict reported with Dragon Souls to Perks as that mod places something in the same spot.\r<br />If unsure just try it out and try it loaded before and after your Riverwood mod. If it doesn’t work then just remove the mod and go back to a save before you loaded it. The scripts in this mod will not linger in your game.\r<br />\r<br />Pixelated Paintings. This is due to antialiasing. I discovered the fix when I put the mod onto my very poorly set up ancient lap top in the process of transfering stuff between computers and noticed that I also had the paintings pixelated. I cured it by following the step guide set up for skyrim graphics at[url=http://wiki.step-project.com&#92;STEP:Guide]Step Project Guide[/url]and following section 1.E.1. i.e. configuring my internal graphics to better play the game - there are instructions for both nvidia and AMD users on it.\r<br />\r<br />If you leave the house for 31 days or more it is possible that your claws may be stuck to the display or vanish altogether  (in testing this hasn’t happened but it’s a known game bug) to reclaim any missing items – for the vanilla claws look to the small ship model on the top of the display case, hover cursor over it – make sure you are looking at the ship and not the wall - open the consol (the tilde key to the left of the 1) and type removeallitems player 1. The claws will return to your inventory. The Elder scrolls storage container is the unfurled scroll which is part of the display so again just hover the cursor over it and type removeallitems player 1. The Black Books storage container is the metal dragon statue on the top shelf of the bookcase just above where the Black Books are displayed.  With the masks just click on the bust itself and follow the same procedure. The amethyst claw and paragons are unaffected.\r<br />\r<br />Mods I recommend that work well in my game with this house:\r<br />[url=http://www.nexusmods.com/skyrim/mods/31268/?]FloraRespawn Fix by bluedanieru[/url] Fixes occasions where flora doesn&#39;t respawn as it should do.\r<br />[url=http://www.nexusmods.com/skyrim/mods/26851/?]Moreplants and recipes by numberland[/url] Takes flora present in the game that are not available to be planted in hearthfire planting mounds (tomatoes,garlic, yellow mountain flower for example) and adds them to it.\r<br />[url=http://www.nexusmods.com/skyrim/mods/39377/?]Hearthfire Dolls areUgly by berticus0001[/url]  Swops out the rather ugly hearthfire dolls for your choice of teddy bear or elf doll.\r<br />\r<br />General troubleshooting\r<br />\r<br />Floating Grass Fix(info taken from [url=http://www.creationkit.com/Floating_Grass_Fix]Creation kit wiki page on this issue[/url]) Open up both Skyrim.ini and SkyrimPrefs.ini and at the bottom of the [Grass] section add/alter this:\r<br />bAllowLoadGrass=0\r<br />bAllowCreateGrass=1\r<br />\r<br />For people who have problems with endless loading screens or random crashes when changing between cells, its caused by having a lot of texture mods or heavy scripted mods and overloading the vanilla game, I recommend the following fixes:\r<br />Use either SSME or SKSE with the .ini tweak.\r<br />Gophers vid for installing SKSE if using Nexus Mod Manager or manually installing\r<br />[youtube]xTGnQIiNVqA[/youtube]\r<br />Gophers vid for installing SKSE if using Mod Organiser\r<br />[youtube]jGKhdiJYBqo[/youtube]\r<br />\r<br /> [url=http://www.nexusmods.com/skyrim/mods/41592/?]uGridsToLoadby Altimor[/url](requires SKSE and makes crossing between cells much more stable whether or not you use an ENB or have changed your uGrids)\r<br />[url=http://www.nexusmods.com/skyrim/mods/38649/?]CTDand Memory Patch ENBoost by Boris Vorontsov[/url]I would recommend the method used by STEP to install this, rather than downloading the version on the Nexus, Boris&#39;s website is not the most user friendly one I have ever come across but STEP does explain where to go to find the download and how to install it here:\r<br />[url=http://wiki.step-project.com/ENBoost#Recommendations]STEP Projects recommendations for installing ENBoost[/url]this page does not reiterate Boris&#39;s own recommendation to do the following tweak in the skyrim Prefs.ini\r<br />bFloatPointRenderTarget=1 \r<br />which must be set in SkyrimPrefs.ini file to make this mod work so I have mentioned it here, if used with the STEP settings it works very well indeed.\r<br />(STEPS own ini tweaks section here [color=#5ea2e5][url=http://wiki.step-project.com/STEP:Guide]STEP Projects main page for step core mods[/url] [/color]does mention the float point tweak in Section 1.D.1 and I would always recommend their ini tweaks and graphic settings - Section 1.E. as being a very good stable basis on which to add mods.)\r<br />\r<br />This mod is Nexus Exclusive. Please do not reupload it to other sites without my permission or change the mod and reupload it. If anyone wants to translate it the script sources are included but I would like to know about it and would like credit. \r<br />Anything made by me is free to use as a modders resource providing credit it given.\r<br />\r<br />Credits\r<br />General (mainly for meshes and textures)\r<br />Blary Various including his book sets\r<br />Bond123  Retexture of the tundra cotton from his Tundra Rose Chalet mod on the Nexus\r<br />Brendan62  Fireplace tools and help and advice\r<br />BrettM  Various from his resource pack on TesAlliance\r<br />Clintster74 The retexture of the hearthfire oven and help and advice\r<br />InsanitySorrow Various from his resources on TesAlliance\r<br />Jet4571 for his meshes for paintings and frames (which I have adapted somewhat)\r<br />Lilith  filled baskets from her resources on TesAlliance\r<br />MJY some statues and the large bookcase from his castle mod\r<br />Oaristys  Modders Resource Pack\r<br />Pheo3309  Soul gem storage and extra glass ingredient storage from TesAlliance\r<br />Runspect  Various resources from his pack on the Nexus\r<br />Stoverjim  Book set from his resource on TesAlliance\r<br />Stroti  Various from his resources on Nexus and TesAlliance\r<br />Tamira Various including the rocking horse, teddy bears and others from TesAlliance and the Nexus\r<br />Tueffelachtein  Clutter staves from TesAlliance\r<br />WillieSea The Toilet and Chilled Storage (slightly adapted) from his Levelers Tower mod on the Nexus.\r<br />\r<br />Scripts\r<br />Berticus0001 [url=http://www.nexusmods.com/skyrim/mods/36756/?]Berts Bits and Bobs Resources for Modders[/url]  Also many thanks to Bert for endless help in setting them up and in some cases writing them specifically for me.\r<br />IsharaMeridan  [url=http://www.nexusmods.com/skyrim/mods/25890/?]IsharaMeradin’s Individual Item  Sorter[/url]\r<br />Andragon   [url=http://www.nexusmods.com/skyrim/mods/27361/?]Andragon&#39;s Underground Bathhouse\r<br />[/url]TMPhoenix     [url=http://www.nexusmods.com/skyrim/mods/29249/?]TMPhoenix&#39;s Hearthfire Multiple Adoptions Mod[/url]   the elder scrolls display script\r<br />subtanker      [url=http://http://www.nexusmods.com/skyrim/mods/54030/?]Loraine-AQuest driven Voiced Companion[/url] Script for storing multiple items non dlc specific.\r<br />\r<br />Many thanks to all modders who make their resources free to use. If I have missed anyone out please mail me and I will add you to the list.\r<br />\r<br />Art\r<br />Wolf Painting\r<br />http://dark-sheyn.deviantart.com/art/Two-318712566\r<br />Landscapes\r<br />from photos by www.stevecarter.com (used with permission).\r<br />Others\r<br />http://www.gdefon.com  wallpapers\r<br />http://www.doverpictura.com public domain fairy tale paintings",
  "categoryId": "67",
  "version": "1.6",
  "author": "Gentester",
  "createdUnix": "1401470979",
  "updatedUnix": "1413574673",
  "containsAdultContent": false,
  "uploadedBy": "gentester",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000111096",
      "name": "White River Cottage",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82220",
      "fileName": "White River Cottage-54479-1.rar",
      "uploadedUnix": "1401465117",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0f5a48c2ef528843541c07a5926bd4121f5fa232eebf03f5b6c5049fe1dbfd68/analysis/1408102824/",
      "changelogHtml": " 31st May 2014.  Added 2 vids to description <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1.rar?fid=1000111096&ttl=1535838700&ri=8192&rs=8192&setec=d43c4a003aa775334b6261edeaedbd09"
    },
    {
      "fileId": "1000111300",
      "name": "White River Cottage",
      "version": "1.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82221",
      "fileName": "White River Cottage-54479-1-0a.rar",
      "uploadedUnix": "1401572475",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/32962584e3008a95465dfa68493ad4beaf5c053694e55e9b9495e1a64b6596e5/analysis/1408105945/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1-0a.rar?fid=1000111300&ttl=1535838700&ri=8192&rs=8192&setec=62d2ca9df81ebf5c9c5781a06dbd69cd"
    },
    {
      "fileId": "1000111802",
      "name": "White River Cottage",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82222",
      "fileName": "White River Cottage-54479-1-1.rar",
      "uploadedUnix": "1401915323",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e77031d9f7a26d8f832beec9eba0f37df045faf7581652d1c45d113a6789640c/analysis/1408112309/",
      "changelogHtml": " 4th June 2014. Uploaded new file. Corrects over red lighting. <br/> \n added optional esp only to deal with grass growing through patio from mod Unique grasses & ground cover <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1-1.rar?fid=1000111802&ttl=1535838701&ri=8192&rs=8192&setec=3b63bd35e12c2f477335fea2704b51dc"
    },
    {
      "fileId": "1000111979",
      "name": "White River Cottage",
      "version": "1.1.a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "197",
      "fileName": "White River Cottage-54479-.rar",
      "uploadedUnix": "1402052489",
      "modVersion": "1.1.a",
      "virusScanUrl": "https://www.virustotal.com/file/af0eb9dd1ef7d7c60009167bbb6e651574d68d1f31dcb75786f32b4bbe95c8c9/analysis/1408114627/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-.rar?fid=1000111979&ttl=1535838701&ri=8192&rs=8192&setec=7b1667cc9cd088f08166718d1e5fb82b"
    },
    {
      "fileId": "1000112621",
      "name": "White River Cottage",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83526",
      "fileName": "White River Cottage-54479-1-2.rar",
      "uploadedUnix": "1402489662",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/03fdfd191cf0b3a452ccaadd09aeec241d041b55ad721bd14c75f45ef50fa550/analysis/1408122023/",
      "changelogHtml": " 11th June 2014. New Version. Followers undress to sleep. <br/> \n 14th June 2014. Added some vids. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1-2.rar?fid=1000112621&ttl=1535838702&ri=8192&rs=8192&setec=ed5a4a62ca972c3ed3a1de554cf3dbfe"
    },
    {
      "fileId": "1000112659",
      "name": "White River Cottage No Bed Undress",
      "version": "1.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83526",
      "fileName": "White River Cottage No Bed Undress-54479-1-2a.rar",
      "uploadedUnix": "1402513207",
      "modVersion": "1.2a",
      "virusScanUrl": "https://www.virustotal.com/file/6c4458d160d090b868cb41df61b3abb404ba78107a77cb3ac91f2677e94d8373/analysis/1408122322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage%20No%20Bed%20Undress-54479-1-2a.rar?fid=1000112659&ttl=1535838703&ri=8192&rs=8192&setec=72c97fb252b93141c087cf4131d7a68b"
    },
    {
      "fileId": "1000113311",
      "name": "White River Cottage",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83425",
      "fileName": "White River Cottage-54479-1-3.rar",
      "uploadedUnix": "1403009506",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/3d417b825f40d875328c70b3fecc02366fc92836f50134e19451d15108c48713/analysis/1408130485/",
      "changelogHtml": " New ETAC patch loaded <br/> \n New ETAC patch loaded to correct a problem with multi adoption mod not working as intended <br/> \n Added a separate patch for the Modular ETAC version <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1-3.rar?fid=1000113311&ttl=1535838703&ri=8192&rs=8192&setec=bc9143b426fb98fac75d779c20413be3"
    },
    {
      "fileId": "1000113313",
      "name": "White River Cottage No Bed Undress",
      "version": "1.3a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83423",
      "fileName": "White River Cottage No Bed Undress-54479-1-3a.rar",
      "uploadedUnix": "1403010426",
      "modVersion": "1.3a",
      "virusScanUrl": "https://www.virustotal.com/file/e555b4434e6419b6a353a7415e03dd08d793fd93cf5ddaaabdeb467ad058005e/analysis/1408130600/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage%20No%20Bed%20Undress-54479-1-3a.rar?fid=1000113313&ttl=1535838704&ri=8192&rs=8192&setec=ff986cf7f1ae2ce3b473742747702d55"
    },
    {
      "fileId": "1000113314",
      "name": "Patch for ETAC. Expanded Towns and Cities by MissJennabee",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49",
      "fileName": "Patch for ETAC. Expanded Towns and Cities by MissJennabee-54479-.rar",
      "uploadedUnix": "1403010818",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4bee1a20a3f3561482a9d56b3af73f8049d9e9e50624c2d9e8102221c48c5a14/analysis/1408130602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20ETAC.%20Expanded%20Towns%20and%20Cities%20by%20MissJennabee-54479-.rar?fid=1000113314&ttl=1535838704&ri=8192&rs=8192&setec=70cb6f00fca88b7e0327b6ea3ce1eb55"
    },
    {
      "fileId": "1000114817",
      "name": "Better Patch for ETAC. ",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47",
      "fileName": "Better Patch for ETAC. -54479-.rar",
      "uploadedUnix": "1403891313",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4cb182e6312ad1dbc200a03333444e33ae12ed05a78e37e93d6b63b0a578a337/analysis/1408150220/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Patch%20for%20ETAC.%20-54479-.rar?fid=1000114817&ttl=1535838705&ri=8192&rs=8192&setec=eef370027d43256fdbc3d20237f43f8c"
    },
    {
      "fileId": "1000115674",
      "name": "Patch for ETAC (Complete version).",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "47",
      "fileName": "WhiteRiverETACpatch.-54479-.rar",
      "uploadedUnix": "1404373862",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/228e80043881e85a4e99b2f099e2d7f0beb9d00a029df3a1bd0e9b1113df909c/analysis/1408158731/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WhiteRiverETACpatch.-54479-.rar?fid=1000115674&ttl=1535838706&ri=8192&rs=8192&setec=e277859df35039c8dedc9e86fdfd798f"
    },
    {
      "fileId": "1000116437",
      "name": "Patch for ETAC Modular Riverwood version. ",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "60",
      "fileName": "Patch for ETAC Modular Riverwood version. -54479-.rar",
      "uploadedUnix": "1404776345",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e5f913c8210aac912d3cc2e1b7d474269e4ff353677c43f009c8c9e0ebad9704/analysis/1408167327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20ETAC%20Modular%20Riverwood%20version.%20-54479-.rar?fid=1000116437&ttl=1535838706&ri=8192&rs=8192&setec=17e548e6c3583314c307fb4d4be9fb75"
    },
    {
      "fileId": "1000116467",
      "name": "Patch for ETAC (Riverwood Standalone Version)",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "58",
      "fileName": "Patch for ETAC (Riverwood Standalone Version)-54479-.rar",
      "uploadedUnix": "1404800743",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/85bfdf00645a257d89ab3dc0b8fc0276092ac90cc0a7d6fff3485c9cb7955e1b/analysis/1408167728/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20ETAC%20%28Riverwood%20Standalone%20Version%29-54479-.rar?fid=1000116467&ttl=1535838707&ri=8192&rs=8192&setec=3e84bd534a150ded0465cb7b4dd08db0"
    },
    {
      "fileId": "1000117195",
      "name": "White River Cottage",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83433",
      "fileName": "White River Cottage-54479-1-4.rar",
      "uploadedUnix": "1405198019",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/fde3567e6e55c3f4f49112e1622cc77d20af970e12bcf0a9242f1eacb9bd897d/analysis/1405198155/",
      "changelogHtml": " 12 July 2014. Uploaded new versions due to Nexus anti virus scans coming into operation. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1-4.rar?fid=1000117195&ttl=1535838707&ri=8192&rs=8192&setec=b1375c1c1fcfde2616c313ebdfecbfad"
    },
    {
      "fileId": "1000117201",
      "name": "White River Cottage No Bed Undress",
      "version": "1.4a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83433",
      "fileName": "White River Cottage No Bed Undress-54479-1-4a.rar",
      "uploadedUnix": "1405198981",
      "modVersion": "1.4a",
      "virusScanUrl": "https://www.virustotal.com/file/e477b9f2dd5419e2ec16a00586a41d0bd559d181b7ca6ee9e2be88b533ee088b/analysis/1405199064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage%20No%20Bed%20Undress-54479-1-4a.rar?fid=1000117201&ttl=1535838708&ri=8192&rs=8192&setec=85ff7e60bcca184e1b756b36ba921fbd"
    },
    {
      "fileId": "1000117202",
      "name": "Patch for ETAC (Complete version).",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "47",
      "fileName": "Patch for ETAC (Complete version).-54479-.rar",
      "uploadedUnix": "1405199237",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/91cec3f6912570d78e28fcebc43bd8148c2718a1c98312862b4b4d2b6dd80c07/analysis/1405199284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20ETAC%20%28Complete%20version%29.-54479-.rar?fid=1000117202&ttl=1535838708&ri=8192&rs=8192&setec=e18611031331b16505a1cf4bfa0fa197"
    },
    {
      "fileId": "1000117203",
      "name": "Patch for ETAC (Modular Riverwood version)",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "47",
      "fileName": "Patch for ETAC (Modular Riverwood version)-54479-.rar",
      "uploadedUnix": "1405199507",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8f94221e83007c6f262433d6fd4e8169b54bd956724be503ea181d2e7d6397ad/analysis/1405199562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20ETAC%20%28Modular%20Riverwood%20version%29-54479-.rar?fid=1000117203&ttl=1535838709&ri=8192&rs=8192&setec=b84090e7d02a3152818f5d57a01243a1"
    },
    {
      "fileId": "1000124005",
      "name": "White River Cottage",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83629",
      "fileName": "White River Cottage-54479-1-5.rar",
      "uploadedUnix": "1409063834",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/fdf42d8a60dd50c847025e3be5e65971b8dc6ee41ebd23ae7c22461bbd1a0313/analysis/1409063975/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1-5.rar?fid=1000124005&ttl=1535838709&ri=8192&rs=8192&setec=27eaab2932038421afc24440fd3753e4"
    },
    {
      "fileId": "1000124011",
      "name": "White River Cottage No Bed Undress",
      "version": "1.5a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "83629",
      "fileName": "White River Cottage No Bed Undress-54479-1-5a.rar",
      "uploadedUnix": "1409064842",
      "modVersion": "1.5a",
      "virusScanUrl": "https://www.virustotal.com/file/1097da51610ac1426d1e81d14d2de06e93f8d8a0d57dc1bae37c312b1c326e46/analysis/1409064918/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage%20No%20Bed%20Undress-54479-1-5a.rar?fid=1000124011&ttl=1535838710&ri=8192&rs=8192&setec=174b53f575f4e4ffe87d805fd3ad3dea"
    },
    {
      "fileId": "1000131400",
      "name": "White River Cottage",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "83835",
      "fileName": "White River Cottage-54479-1-6.rar",
      "uploadedUnix": "1413573617",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/c70cbc9c725d79bce51e644145e5cf69587d9e32504da4927212fb9085fda31d/analysis/1413573737/",
      "changelogHtml": " Added Black Book Storage <br/> \n 20th Oct. Changed Main page attributes to properly reflect what is in the mod now. Also added some general gameplay tips for in game stability <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage-54479-1-6.rar?fid=1000131400&ttl=1535838710&ri=8192&rs=8192&setec=c3387ff38c8e4f25519e3c13b6db7937"
    },
    {
      "fileId": "1000131401",
      "name": "White River Cottage no bed undress",
      "version": "1.6a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "83835",
      "fileName": "White River Cottage no bed undress-54479-1-6a.rar",
      "uploadedUnix": "1413574673",
      "modVersion": "1.6a",
      "virusScanUrl": "https://www.virustotal.com/file/0f30dd46aa704dc235522f00e25db5645f39665cf9d2cf72591208537f60117b/analysis/1413574757/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/White%20River%20Cottage%20no%20bed%20undress-54479-1-6a.rar?fid=1000131401&ttl=1535838711&ri=8192&rs=8192&setec=d2e34dbed5795137b3fabf26c5e2b6a6"
    }
  ]
}