{
  "modId": 54483.0,
  "modName": "Gemling Queen Resources",
  "summary": "Collection of jewelry meshes / textures and other miscellaneous things I made for other mod authors that I don&#39;t intend to use in a mod of my own at the moment, so I have decided to share them with the rest of the community as well.",
  "descriptionHtml": "[font=Georgia][size=4][color=yellow]Update 2 August 2014:[/color][/size][/font]\r<br />Added a new pack called Vanilla Jewelry Combinations (read below for more information).\r<br />\r<br />[font=Georgia][size=4][color=yellow][font=Georgia][size=4][color=yellow]Update 30 October 2014:[/color][/size][/font]\r<br />[/color][/size][/font]New Wind Chime pack with 3 different variations of Morrowind-inspired wind chimes based on [url=http://www.nexusmods.com/skyrim/mods/36703/?]Tueffel&#39;s resource[/url]. Also contains a small script that allows to control the havok behaviour of the chimes (read below for more information).\r<br />\r<br />[font=Georgia][size=4][color=yellow]Update 27 June 2014:[/color][/size][/font]\r<br />New amulet pack that contains aquamarine, onyx and peridot amulet meshes. No cabochon variants at the moment, amulets are a pain to rig because of the weight slider so texture replacements are all I&#39;m doing at the moment. No amber necklace since I&#39;m working on a whole new mesh for those. The pack also contains all vanilla necklaces with disabled vertex colours.\r<br />\r<br />[font=Georgia][size=4][color=yellow]Update 23 June 2014:[/color][/size][/font]\r<br />New horn only variant of the Maleficent headdress that is biped to the circlet slot, so it will not replace your character&#39;s hair. Won&#39;t work with every hairstyle (there will be some clipping here and there), but looks ok with most of the vanilla ones I&#39;ve tried. It doesn&#39;t have it&#39;s own ground art yet, so it will look like the regular headdress in inventory. Made for female Lunari characters but will work with any gender or race, though it looks pretty stupid on argonians and clips with the khajiit ears. Makes male orcs look like Hellboy on a bad horn day (&#39;cept for the skin colour, of course).\r<br />\r<br />There&#39;s also a second set of horns called &#34;Maleficent Curved Horns&#34; that uses the dragonbone helmet as a base for the mesh. Also uses those textures, so it will work with any texture replacer you might have installed.\r<br />\r<br />[font=Georgia][size=4][color=yellow]Update 09 June 2014:[/color][/size][/font]\r<br />Added cabochon variants of all vanilla rings (smooth cabochons for low value amethyst and garnet, sparkling cabochons for high value emerald, ruby and sapphire gems). The idea is to allow for flawed / flawless gems to be set into different rings. Since I&#39;ve never seen a diamond cabochon in my life (not sure it&#39;s even possible to polish them that way), I&#39;ve added an extra sparkly brilliant cut diamond ring for flawless diamonds. It has a subtle star-shaped pattern inside that is difficult to capture in the screens.\r<br />\r<br />[font=Georgia][size=4][color=yellow]Update 07 June 2014:[/color][/size][/font]\r<br />Added a male equipped mesh to the maleficent headdress, many thanks to [url=http://www.nexusmods.com/games/users/455075/?]pheo3309[/url] for doing the conversion. I also split the two onyx stones from the crafting materials pack into two separate meshes by request.\r<br />\r<br />[font=Georgia][size=5][color=white][b]Introduction[/b][/color][/size][/font]\r<br />This is a collection of jewelry meshes, textures and other miscellaneous things that I was asked to make for authors of other jewelry replacers / overhauls, mainly [url=http://www.nexusmods.com/games/users/4291352/?]kryptopyr[/url] and [url=http://www.nexusmods.com/games/users/758255/?]Forteverum[/url]. As I don&#39;t much care for fiddling with stats and balancing in the CK I don&#39;t intend to use these assets in a mod of my own at the moment, so I have decided to share them with the rest of the community as well.\r<br />\r<br />This resource is aimed at people who know what they&#39;re doing and can handle themselves with NifSkope or the CK at the very least. There is no .esp included and I have no time to give detailed instructions on how to get them ingame. There are enough tutorials out there that explain how to set up custom armors for Skyrim.\r<br />\r<br />[font=Georgia][size=5][color=white][b]Contents[/b][/color][/size][/font]\r<br />[font=Georgia][size=4][color=lightblue]Ring Pack[/color][/size][/font]\r<br />Contains ring meshes for several new gemstone types I made, namely onyx, aquamarine, peridot and amber. Originally they were created for [url=http://www.nexusmods.com/skyrim/mods/49791/?]CCOR[/url] and meant to replace all the custom ring meshes included with the latest release of [url=http://www.nexusmods.com/skyrim/mods/8655/?]SMIM[/url] with my sparkling gemstones. Ultimately I decided to mix up the selection of stones a bit, for instance I decided not to make topaz because I don&#39;t like those very much, and went with peridot and aquamarine instead. The amber was specifically requested by kryptopyr for CCOR.\r<br />\r<br />The aquamarine rings come in three different versions:\r<br />[list][*][size=2]_facets.nif is my normal facetted cut[/size][/*]\r<br />[*][size=2]_cabochon_facets.nif has a smooth, round outside but with subtle sparkles inside[/size][/*]\r<br />[*][size=2]_cabochon_smooth.nif is smooth inside and out (no sparkles, but it catches the light quite nicely)[/size]\r<br />[/list]\r<br />Peridot comes as normal cut and smooth cabochon, amber is available as smooth cabochon only (the material is much too soft for any facetting). The onyx ring has an enitrely unique honeycomb cut to give it a bit more impact even though the stone is opaque.\r<br />\r<br />All the ring meshes have disabled vertex colours, so even if some of them look golden in NifSkope they will [i]all[/i] be silver ingame. This is so the missing gemstone / material combinations can easily be made in the CK with texture sets, without me having to copy-paste together tons of different meshes (which is boring work). To make gold rings you will need a gold-coloured texture and set the mesh up to use it, either through NifSkope or with a texture set.\r<br />\r<br />The ring package also includes a full set of the vanilla rings from my [url=http://www.nexusmods.com/skyrim/mods/52266/?]Gemling Queen Jewelry[/url] replacer without vertex colours, for the same reason.\r<br />\r<br />As of v1.2 also contains a brilliant diamond ring and cabochon variants of all vanilla rings.\r<br />\r<br />[b]Important[/b]: I included all the gemstone textures required for the new gems, these [i]must[/i] overwrite some of the files from [url=http://www.nexusmods.com/skyrim/mods/52266/?]Gemling Queen Jewelry[/url] if you&#39;re using that mod as well or all the new gems will be black. I did [i]not[/i] include any metal textures for the rings, users will need one of the options from GQJ or they will get purple textures. This is because none of those textures were made by me so I cannot just give them away. Also I don&#39;t want a mod made with this resource to override the choice of texture / resolution my users make when installing GQJ. If you really [i]must[/i] include those textures (e.g. you want to use Gamwich&#39;s textures for some rings only, and SMIM&#39;s for the rest), contact me about it first.\r<br />\r<br />[font=Georgia][size=4][color=lightblue]Amulet Pack[/color][/size][/font]\r<br />Contains new meshes for aquamarine, onyx and peridot amulets, as well as a full set of vanilla amulets with disabled vertex colours. Once again this is to easily enable the missing gemstone / metal combinations through texture sets.\r<br />\r<br />[font=Georgia][size=4][color=lightblue]Crafting Materials Pack[/color][/size][/font]\r<br />Currently only contains a raw onyx mesh I made for CCOR. It comes with full havok and collision, and I plan to make resources for the other new jewelry I added, e.g. raw amber, flawed / flawless aquamarine gems etc.\r<br />\r<br />As of v1.1 also contains two separate meshes for the small / big chunks of onyx so they can be used independantly.\r<br />\r<br />[font=Georgia][size=4][color=lightblue]Maleficent Headdress[/color][/size][/font]\r<br />A black horned headdress requested by [url=http://www.nexusmods.com/games/users/5712421/?]Gamwich[/url] for his Maleficent inspired character. Meshes made by me, textures by Gamwich.\r<br />\r<br />The download includes inventory art (with rudimentary havok) and a female-only equipped mesh, plus an example .esp that adds it to the game as a cloth helmet (no armor value) with the Helm of Yngol frost enchantment. It isn&#39;t craftable or placed anywhere in the world, you will need to add it through the console. The headdress was made for the [url=http://www.nexusmods.com/skyrim/mods/21602/?]Lunari Race[/url], but will work with humanoid females (Redguard, Nord, Breton, Imperials), though it makes it look as if they had pointy ears. Elven females can equip it, but the ears will clip through the fabric. On beast races or any male character it will look like the Helm of Yngol.\r<br />\r<br />As of v1.1 also contains a male equipped mesh (the new .esp is set up to use it), many thanks to [url=http://www.nexusmods.com/games/users/455075/?]pheo3309[/url] for doing the conversion.\r<br />\r<br />As of v2.0 includes two sets of standalone equippable horns. They act like circlets, have no armor value and have the helm of yngol enchantment on them.\r<br />\r<br />To get the items ingame using my demo plugin, type the following command into your console:\r<br />\r<br />[i]player.additem [id] 1[/i]\r<br />\r<br />Replace [id] with the FormID of the item you want. You can get those by typing\r<br />\r<br />[i]help Maleficent[/i]\r<br />\r<br />You should get a list of at least three items (with their corresponding ids), &#34;Maleficent Curved Horns&#34; are the dragonbone horns.\r<br />\r<br />[font=Georgia][size=4][color=lightblue]Wind Chimes[/color][/size][/font]\r<br />If you&#39;ve ever played Morrowind, you might remember the pretty little chimes that used to decorate the Yurts of the Ashland tribes, gently swaying in the breeze and making that soft, soothing sound. I never noticed how much I missed them until I came across [url=http://www.nexusmods.com/skyrim/mods/36703/?]this[/url] wonderful resource. My wind chime  component contains a complete overhaul of Tueffel&#39;s meshes to add more detail and bring it closer to the original Morrowing look. I also added two brand new variations, a bright yellowish bamboo with an ebony inlayed with Ivory trim, and a warm reddish wood with oxidized brass decorations.\r<br />\r<br />The meshes are not animated as their MW counterparts were, but Tueffel rigged them with very convincing havok constraints so they will swing back and forth when hit or bumped into. They don&#39;t make any sound currently when colliding with themselves, but they will issue a soft clattering when they hit another solid object, like a wall. If you were so inclined, I imagine it would be very easy to hook up a generic wind chime sound (or even the original audio from MW, if you own it) as a looping sound to the objects in the CK.\r<br />\r<br />One slight problem with the havok simulation is that it is not quite precise enough, the solver tends to end movement mid-swing so the chimes will end up sticking out at slightly unnatural angles instead of returning to their proper resting positions. If this annoys you, try one of the following things:\r<br />   a) Make the chimes static items in the CK and do without the movement entirely or\r<br />   b) Have the chimes be activators (make sure to give them a name) and attach the script located in the scripts folder of the archive to each of \r<br />       them. It will cause them to automatically respawn after a short period of simulation each time they are grabbed (Z key) or hit by weapons or\r<br />       projectiles. They will also immediately reset whenever they are activated. Unfortunately my scripts cannot detect collisions, such as NPCs\r<br />       bumping into the chimes, so I cannot make them recover from those simulations automatically. The player will have to reset them manually.\r<br />       You can minimise the need to do this by placing them high up or away from NavMeshed areas, so NPCs don&#39;t bump into them so often.\r<br />       Don&#39;t forget to tick &#34;Don&#39;t Havok Settle&#34; on each chime you place in the world, to prevent them from weirding out the moment the game\r<br />       loads.   \r<br />\r<br />\r<br />[font=Georgia][size=4][color=lightblue]Vanilla Jewelry Combinations[/color][/size][/font]\r<br />This pack contains material/gem combinations not available in the vanilla game, including the three gems that didn&#39;t have circlets at all (amethyst, diamond and garnet). Note that not every single combination is available, some of the (e.g. jade + garnet) offend my sense of colour and I refuse to add them. If you absolutely must have a variation that isn&#39;t included, let me know in the comment section and I will explain how you can add it yourself. It&#39;s very easy.\r<br />\r<br />Currently only covers rings and circlets. Contains the meshes only, none of the items are added to the game. You will need to download the combined ring textures and circlet textures from my replacer mod [url=http://www.nexusmods.com/skyrim/mods/52266/?]Gemling Queen Jewelry[/url] for this pack to work&#33; Feel free to include all of those textures with your mod if you use this resource.\r<br />\r<br />Please note that I haven&#39;t tested any of these meshes ingame. If something is amiss, let me know in the comment section and I will take care of it.\r<br />\r<br />[font=Georgia][size=5][color=white][b]Terms Of Use[/b][/color][/size][/font]\r<br />You are free to use any assets included in these packs for your own mods (note that &#34;use&#34; does not mean &#34;reupload without the slightest change&#34;, I will not give permission for that), all I ask is that you credit me and comment / PM me with a link to your mod once it&#39;s released. I like to see what people create with my work.\r<br />\r<br />You may upload the meshes / textures along with your mod, you do not have to make people download them from this page. You are also allowed to tweak and modify them, under the condition that you share your work with the community in turn (you must make the modified assets available as resources, and allow others to use them as well).\r<br />\r<br />Note that [i]only[/i] the assets uploaded here are free-to-use, this does not include all my other mods. If you&#39;d like to use assets from [url=http://www.nexusmods.com/skyrim/mods/52266/?]Gemling Queen Jewelry[/url] or my [url=http://www.nexusmods.com/skyrim/mods/54078/?]White Phial Replacer[/url], PM me about it first.\r<br />\r<br />Feel free to contact me if you have questions or think these rules are unclear. I hope you enjoy my resources and may you make many pretty things with them.\r<br />\r<br />[font=Georgia][size=5][color=white][b]Requests[/b][/color][/size][/font]\r<br />I&#39;m always happy about feedback and new mod ideas, so drop by the comment section and say hi&#33; Please be aware that I&#39;m very busy with my other mod projects at the moment though, so I might be slow to respond to requests. I also do this for fun, in my free time, so I tend to do whatever I feel like at the time - you may very well end up with peridot when you asked for topaz. ;)\r<br />\r<br />[font=Georgia][size=5][color=white][b]Tools Used[/b][/color][/size][/font]\r<br />Gimp\r<br />CrazyBump\r<br />NifSkope\r<br />Blender",
  "categoryId": "82",
  "version": "5.1",
  "author": "Saerileth",
  "createdUnix": "1401473558",
  "updatedUnix": "1438517478",
  "containsAdultContent": false,
  "uploadedBy": "Saerileth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000111113",
      "name": "Gemling Queen Resources - Ring Pack",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1221",
      "fileName": "Gemling Queen Resources - Ring Pack-54483-1-0.7z",
      "uploadedUnix": "1401472780",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8e18afe8859e4f027633a9e7ea2ece652682c992c36aa0c45cba3c8508683d15/analysis/1408102865/",
      "changelogHtml": " - Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Ring%20Pack-54483-1-0.7z?fid=1000111113&ttl=1535838722&ri=8192&rs=8192&setec=288681f174f52efc10a3a50ec509d1dd"
    },
    {
      "fileId": "1000111115",
      "name": "Gemling Queen Resources - Crafting Materials",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "81",
      "fileName": "Gemling Queen Resources - Crafting Materials-54483-1-0.7z",
      "uploadedUnix": "1401473354",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0ee432f877ee24631554508524c300ad1fd074b4a7d7cc3bbb08c290940f78be/analysis/1408102992/",
      "changelogHtml": " - Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Crafting%20Materials-54483-1-0.7z?fid=1000111115&ttl=1535838722&ri=8192&rs=8192&setec=d4bfecb2915b78fefcecbcae487aa222"
    },
    {
      "fileId": "1000111297",
      "name": "Gemling Queen Resources - Maleficent Headdress",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1323",
      "fileName": "Gemling Queen Resources - Maleficent Headdress-54483-1-0.7z",
      "uploadedUnix": "1401568879",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6f3be6bffcbffa576b111cd7a385443cab34365269c994491bfe3dfac63de99d/analysis/1408105930/",
      "changelogHtml": " - Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Maleficent%20Headdress-54483-1-0.7z?fid=1000111297&ttl=1535838722&ri=8192&rs=8192&setec=1523c301337ae56be550389dad36ef4e"
    },
    {
      "fileId": "1000112107",
      "name": "Gemling Queen Resources - Crafting Materials",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "110",
      "fileName": "Gemling Queen Resources - Crafting Materials-54483-1-1.7z",
      "uploadedUnix": "1402138212",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1b87970c5bf7d6a0750d9a0960ab99ab329f0342ff843ad9918a0cbab295bf72/analysis/1408116007/",
      "changelogHtml": " - Added male equipped mesh to the maleficent headdress (mesh by pheo3309)\r<br />- Split the two stones in the onyx mesh into two separate meshes by request <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Crafting%20Materials-54483-1-1.7z?fid=1000112107&ttl=1535838723&ri=8192&rs=8192&setec=82d3cec0cef493d8971d45f9975005d0"
    },
    {
      "fileId": "1000112116",
      "name": "Gemling Queen Resources - Maleficent Headdress",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1377",
      "fileName": "Gemling Queen Resources - Maleficent Headdress-54483-1-1.7z",
      "uploadedUnix": "1402140532",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2dd18a719312ffdb4717abbcceaa545e3dc5ccdbffc3e29c06770b462d1483c1/analysis/1408116101/",
      "changelogHtml": " - Added male equipped mesh to the maleficent headdress (mesh by pheo3309)\r<br />- Split the two stones in the onyx mesh into two separate meshes by request <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Maleficent%20Headdress-54483-1-1.7z?fid=1000112116&ttl=1535838723&ri=8192&rs=8192&setec=6c061b0cca966608190cf88ce82e873a"
    },
    {
      "fileId": "1000112438",
      "name": "Gemling Queen Resources - Ring Pack",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1674",
      "fileName": "Gemling Queen Resources - Ring Pack-54483-1-2.7z",
      "uploadedUnix": "1402347609",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ebaf894846d08a9597b2e5d85b889787ac9d0a37db74b3968ed2fc6c269778a8/analysis/1408119965/",
      "changelogHtml": " Ring Pack:\r<br />- New diamond ring with extra sparkly brilliant cut\r<br />- Added smooth cabochon amethyst and garnet, facetted cabochon emerald, ruby and sapphire rings\r<br />- Renamed the unadorned ring to plainring for clarity and better sorting <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Ring%20Pack-54483-1-2.7z?fid=1000112438&ttl=1535838724&ri=8192&rs=8192&setec=d12a0e0eed7e433402e8aead5327b2b0"
    },
    {
      "fileId": "1000114272",
      "name": "Gemling Queen Resources - Maleficent Headdress",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1390",
      "fileName": "Gemling Queen Resources - Maleficent Headdress-54483-2-0.7z",
      "uploadedUnix": "1403551117",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/775bfa5401f26da6bc10feb118c507720d0009599f30761476fc3cf01c650ce9/analysis/1408139840/",
      "changelogHtml": " Maleficent Headdress:\r<br />- Added two sets of standalone equippable horns (biped to circlet slot) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Maleficent%20Headdress-54483-2-0.7z?fid=1000114272&ttl=1535838724&ri=8192&rs=8192&setec=400bb9c9a39aa86eb8127f7776554c9d"
    },
    {
      "fileId": "1000114824",
      "name": "Gemling Queen Resources - Amulet Pack",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2060",
      "fileName": "Gemling Queen Resources - Amulet Pack-54483-3-0.7z",
      "uploadedUnix": "1403897224",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/9291b2733dbbeeeee454378426f9d825261a804f9261be39cc9359ba62aedad1/analysis/1408150283/",
      "changelogHtml": " New Amulet Pack released&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Amulet%20Pack-54483-3-0.7z?fid=1000114824&ttl=1535838725&ri=8192&rs=8192&setec=5c1e1f9cc12311c105180c4686a496f9"
    },
    {
      "fileId": "1000133155",
      "name": "Gemling Queen Resources - Wind Chimes",
      "version": "4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1440",
      "fileName": "Gemling Queen Resources - Wind Chimes-54483-4-0.7z",
      "uploadedUnix": "1414642481",
      "modVersion": "4.0",
      "virusScanUrl": "https://www.virustotal.com/file/c214d21ba993b413d6dcb731eb5729e06ccbae193ee3218514e3933e0bc2d500/analysis/1414642563/",
      "changelogHtml": " - New wind chime pack released <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Wind%20Chimes-54483-4-0.7z?fid=1000133155&ttl=1535838726&ri=8192&rs=8192&setec=20eac21ab0df52b5da6a2d7f9d7d4c9d"
    },
    {
      "fileId": "1000170264",
      "name": "Gemling Queen Resources - Vanilla Jewelry Combinations",
      "version": "5.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "356",
      "fileName": "Gemling Queen Resources - Vanilla Jewelry Combinations-54483-5-0.7z",
      "uploadedUnix": "1438514203",
      "modVersion": "5.0",
      "virusScanUrl": "https://www.virustotal.com/file/fa4315a0e4ec8288d743d6c0961d39831f2ddc5786fbc539ebcd70b841a0f9b7/analysis/1438514222/",
      "changelogHtml": " - New module released, adds gem/material combinations not available in vanilla game.\r<br />\r<br />Vanilla Jewelry Combinations:\r<br />- copper emerald circlet\r<br />- gold ruby circlet (without onyx)\r<br />- gold sapphire circlet\r<br />- jade ruby circlet\r<br />- silver emerald circlet\r<br />- silver ruby circlet\r<br />- gold amethyst ring\r<br />- gold garnet ring\r<br />- gold ruby ring\r<br />- silver diamond ring\r<br />- silver emerald ring\r<br />- silver sapphire ring <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Vanilla%20Jewelry%20Combinations-54483-5-0.7z?fid=1000170264&ttl=1535838726&ri=8192&rs=8192&setec=c1e9da74f21bc33c6d3b723d5a0dbde0"
    },
    {
      "fileId": "1000170274",
      "name": "Gemling Queen Resources - Vanilla Jewelry Combinations",
      "version": "5.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "992",
      "fileName": "Gemling Queen Resources - Vanilla Jewelry Combinations-54483-5-1.7z",
      "uploadedUnix": "1438517478",
      "modVersion": "5.1",
      "virusScanUrl": "https://www.virustotal.com/file/76c5da83fc2ecfa7f48035a2367c2f3ff105898ebd106c9debabf057a52ebfb7/analysis/1438517526/",
      "changelogHtml": " Vanilla Jewelry Combinations:\r<br />- copper diamond circlet\r<br />- copper garnet circlet\r<br />- gold amethyst circlet\r<br />- gold diamond circlet\r<br />- gold garnet circlet\r<br />- jade diamond circlet\r<br />- silver amethyst ciclet\r<br />- silver diamond circlet <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gemling%20Queen%20Resources%20-%20Vanilla%20Jewelry%20Combinations-54483-5-1.7z?fid=1000170274&ttl=1535838727&ri=8192&rs=8192&setec=4106abc35d539f96def3c2ab064daa27"
    }
  ]
}