{
  "modId": 54567.0,
  "modName": "Radical Remodel of All Homes",
  "summary": "Not completely lorefriendly upgrades to all player homes and a couple of new homes:\r<br />Requires: All DLC",
  "descriptionHtml": "This started out as part of my other mod:\r<br />All Homes Remodel - http://www.nexusmods.com/skyrim/mods/44410/\r<br />\r<br />But I was trying to keep that one mostly lore friendly...I massively upgraded the Hearthfire houses because they were built brand new, so they got new banners and new rugs. This however takes the next illogical step and makes all of the houses newer looking with better rugs, static dishes, and nicer furniture.  Plus cloud storage for all your houses, without the need of a separate mod.\r<br />\r<br />This comes with something of a quest or explanation at least.  Look at the new home in Riverwood, it is called Oracle&#39;s Home.  You will find a journal, and it will tell you where to go next.  It also has a locked door, but if you read the journal, you should be able to find it.\r<br />\r<br />All player houses come with custom cloud storage without the need for another mod (A wizard did it&#33;), each one is color coded with new beds, rugs, and color coordinating static glazed pottery. They also include:\r<br />\r<br />Less Clutter\r<br />Cheese making and maturation shelves for each house\r<br />salt barrels that respawn salt\r<br />egg baskets that respawn eggs\r<br />lots of safe storage via the custom scripted cloud storage\r<br />beds for 6 children\r<br />bathrooms\r<br />new layout\r<br />working lights, sunlight goes out at night, and some lamps turn off late at night\r<br />Not excessive use of Tardis Space (some are bigger on the inside, but only when it was practical, like inside a mountain, or underground)\r<br />Gardens or greenhouses \r<br />New AI for your housecarls so they go to town, wander the market, hit the pub, and tend the garden...not just stand around all day being creepy.\r<br />Rain Barrels to catch water (patches coming soon to make these work with iNeed and Realistic needs and diseases)\r<br />\r<br />Hearthfires Homes Only:\r<br />Milkable Cows&#33;\r<br />Master Bedroom with Bath\r<br />Kitchen\r<br />Library/Alchemy Lab/Enchanting room\r<br />Armory with 9 mannequins, 6 weapon plaques, 6 shield plaques, 4 large display cases, 6 small Display Cases, and 16 weapon racks\r<br />kids room with 6 beds (must use Multiple Adoptions Mod to move them into the Hearthfire Homes)\r<br />New Exterior Decorations\r<br />Mead and Wine making with maturation shelves in the basement\r<br />Basement infirmary\r<br />Large Basement Bathing Room\r<br />Coffin\r<br />All Shrines\r<br />Even more mannequins and weapons display in the basement\r<br />Beds for your Housecarl, Driver, Bard, and Maid\r<br />Maid/Babysitter\r<br />New AI so that Driver, Bard, and Housecarl all sleep downstairs\r<br />New Exterior with Walls, Hottubs, Outdoor Smithing areas, and whatever else I felt like throwing at it\r<br />\r<br />And yes, you guessed it, ALL IN ONE ESP&#33;&#33;  So no, there will not be a Hearthfire edition only.  I value what little bit of sanity I have left.\r<br />\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "Galadreal",
  "createdUnix": "1401757270",
  "updatedUnix": "1401757270",
  "containsAdultContent": false,
  "uploadedBy": "Galadreal",
  "primaryFile": null,
  "files": []
}