{
  "modId": 54571.0,
  "modName": "Skyrim - Too Many Items",
  "summary": "The lands of Nirn are laden with treasures - Sharper blades, stronger shields, tougher hides and stouter ales. Adding variations on classics such as the Iron sword and Long bow, Too Many Items adds a host of new and powerful weapons and spells, as well as a horde of tougher enemies to test them on.",
  "descriptionHtml": "Skyrim - Too Many items (S.T.M.I) is NOT an overhaul or a cheat mod, It is to all intents and purposes an aesthetic/item mod, purely for those who want some old fashioned &#34;RPG&#34; fashion items, such as the long forgotten &#34;Notched Akaviri Katana&#34; or the deadly &#34;Weighted Daedric Warhammer&#34;. But this mod does not only address weapons, It tweaks armours, adding variations of similar respect. \r<br />\r<br />Also added with this mod is an entire world of 1st person RPG lore notes written for each and every item possible from Long bow all the way to the Archmages Robes with every sword, boot, shield, book, staff and everything between getting the same treatment, the mod even renames all Dwarven Items to their lore proper Dwemer counterparts - Dwarven Axe = Dwemer Axe and so forth&#34;\r<br />\r<br />The mod also adds a small selction of ales and brews for the bar going Dovakhiin, complete with a few new drinking buddies and selection of novels filled with daring heroes and dastardly villains or perhaps a more fact filled pursuit in the non-fiction section, the choice is yours.\r<br />\r<br />Or for the dungeon-ering warlord, many of the bright and cheery dungeons have had a dim down and grim light tweak, causing many catacombs and barrows to be plunged into a new and atmospheric mood. Also adding a few, powerful enemies wandering around selected dungeons for some hack and smack fun.\r<br />----------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />As I stated above, this is NOT AN OVERHAUL. Just a few tweaks and even more additions and edits to the existing items in Skyrim, Oh and for all those Lore Keepers such as myself EVERYTHING IS LORE FRIENDLY. EVEN THE FOLLOWERS HAVE LORE FRIENDLY BACKGROUNDS.",
  "categoryId": "28",
  "version": "1.0.0",
  "author": "Blueflame Gameforge",
  "createdUnix": "1401780369",
  "updatedUnix": "1403529612",
  "containsAdultContent": false,
  "uploadedBy": "Tenebruce",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114239",
      "name": "Skyrim - Too Many Items",
      "version": "Alpha1.0.",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "Skyrim - Too Many Items-54571-Alpha1-0-.zip",
      "uploadedUnix": "1403529612",
      "modVersion": "Alpha1.0.",
      "virusScanUrl": "https://www.virustotal.com/file/85fff2d191635f9c0f713759f48d18b14ebb858cf38ff5da271184fa6d51f138/analysis/1408139593/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20-%20Too%20Many%20Items-54571-Alpha1-0-.zip?fid=1000114239&ttl=1535838927&ri=8192&rs=8192&setec=9ae0c1614f48d60388160df81b03e78d"
    }
  ]
}