{
  "modId": 54635.0,
  "modName": "Quick Containers",
  "summary": "Allows you to craft a variety of non-respawning containers and place them where you want. Also includes shelves and select furniture.",
  "descriptionHtml": "[center][size=7][color=#0099ff][font=georgia,serif]Quick Containers[/font][/color][/size]\r<br />[size=3]by [url=http://www.nexusmods.com/games/users/1012244/?tb=mods]trilioth[/url][/size]\r<br />[color=#ffa500][size=4]Requires [url=http://skse.silverlock.org/]SKSE[/url](version 1.6.16 or higher) and Hearthfires DLC[/size][/color][/center]\r<br />\r<br />This is a Beta version. \r<br />\r<br />While I have tested it and it works as intended there may situations that I had not thought or tested. Also, there may be incorrect recipes or item names that I missed. There are a total of 57 items each with a recipe, kit visual reference and placed item associated with it. [url=https://docs.google.com/spreadsheets/d/1OYDttwyp1QJfXapiluASHCPmrS2svIssCi2nnUcIKF4/edit?usp=sharing]Here is a spread sheet for the details.[/url]\r<br />\r<br />[color=#daa520]Oops. I forgot to package the textures for the tool box. They are provided in the Update Section. Future releases will included these textures.[/color]\r<br />\r<br />Quick Containers allows you to craft containers, quickly place them into the world and adjust their positions.\r<br />\r<br />How to Use:\r<br />    First Craft a Toolbox at the forge. Without this toolbox in your inventory no other recipe from Quick Containers will be visible.\r<br />    \r<br />    Craft a Toolbox.\r<br />    Craft a Kit.\r<br />    Drop the Kit to place the item.\r<br />    \r<br />    [size=5]The Toolbox[/size]\r<br />    \r<br />    The toolbox is a portable crafting station that you carry in your inventory. Dropping the toolbox puts you directly into the crafting menu without the need to place it and activate it.\r<br />    The toolbox will return directly to your inventory. While this means you cannot drop it into the world, you may store in a container or give it to a follower.\r<br />    \r<br />    From Toolbox crafting menu, you can craft a kit for most containers and even some shelves and furniture. Some kits must be crafted at the forge due to the large amount of metal involved in them.\r<br />    \r<br />    [size=5]Kits[/size]\r<br />    Kits are misc items that represent a group of materials prepared for constructing the item on the spot. This requires possession of the toolbox as well as glue for many items. Each kit&#39;s name is prefixed with the number of glue required for placement.\r<br />    \r<br />    To place a kit, drop it and placement will begin. Your view will be forced into first person and some of your controls will be disabled. The view is forced in order to properly place the object where you are looking and the controls are disabled to prevent actions that could cause problems with placement.\r<br />    \r<br />    Take care to only drop one kit at a time, not too soon after a placement has finished. While I did my best to prevent the loss of kits due to dropping multiples. The system is not perfect and you will loose kits if it has not finished tracking before you drop another kit. This could easily be avoided if you only drop one kit at a time. Kits are misc items and are dropped in order to avoid cluttering armor or spell lists. Kits use models that allow for you to view them in your inventory as they would appear in the world. This was done for convenience and this is why they don&#39;t have havok enabled models and need to be cleaned up when dropped.\r<br />    \r<br />    Once kits are placed their position may be adjusted or they may be dismantled. A menu for selecting the option to adjust or dismantle is accessed through holding a modifier key while activating the placed object. \r<br />    \r<br />    An image is provided that shows what keys are used to adjust placement. It requires a fixed set of keys on the number pad that are only registered during adjustment. The option to change these keys has not been provided, because there are many keys and it would complicate matters.\r<br />\r<br />   [img]http://static-3.nexusmods.com/15/mods/110/images/54635-1-1401992641.png[/img]\r<br />   Also, hold left shift for increased adjustment and hold left alt for decreased adjustment.\r<br />    \r<br />    Adjustment is generally not required as the placement system is quite adequate for most applications. All items except for wall shelves are designed to be placed on the floor. But items are not forced onto the floor. The placement system is designed to handle tight spaces on flat surfaces. The adjustment system was provided as a method to refine the position if needed. \r<br />  \r<br />    From time to time you may find that you cannot see the item during placement or that the item is not updating it&#39;s position. This is a problem in the engine and it occurs very rarely. If this happens to you, switching between interior and exterior cells or loading form a save will fix the issue. There is no worry about saving after the problem occurs. \r<br />    \r<br />    Dismantling the placed object returns a kit to your inventory.\r<br />    \r<br />    [size=5]Recipes[/size]\r<br />    Recipes require anyone of the following items, plus 2 new items that can be crafted at the forge, but only if you possess the toolbox.\r<br />    \r<br />[LIST]\r<br />[*]Firewood[/*]\r<br />[*]Nails[/*]\r<br />[*]Iron Fittings[/*]\r<br />[*]Locks[/*]\r<br />[*]Iron Ingot[/*]\r<br />[*]Steel Ingot[/*]\r<br />[*]Steel Fittings*[/*]\r<br />[*]Steel Decoration*[/*]\r<br />[/LIST]\r<br />[color=#808080][size=3]*new items[/size][/color]\r<br />    \r<br />    Many items require glue for placement. Glue can be made at the Cooking Pot, but only when in possession of the toolbox (to avoid cluttering the menu). The following items combine to make 10 glue.\r<br />\r<br /> [LIST]   \r<br />[*]Troll Fat\r<br />[*]Powdered Mammoth Tusk\r<br />[/LIST]\r<br />    \r<br />    There are 7 containers, 3 wall shelves, and a farm table that do not require glue. You can expect that the more expensive looking items require more expensive materials to make them.\r<br />    \r<br />Concerns:\r<br />    No vanilla items have been altered by this mod. While it does have scripts there is no reason that uninstalling should not have any affect over your game. If you choose not to use the mod and you don&#39;t wish to uninstall a mod during the middle of a play through, simply dismantle all placed items and store all kits and the toolbox in a respawning container, to get rid of the extra data on your save.\r<br />    \r<br />    Placing a lot of items into the world will cause save game bloat. And possibly load lag. It&#39;s up to you what you wish to do with this mod, but I recommend being moderate with the number of items you add to the world. When dismantling, the placed item is disabled and deleted.\r<br />    \r<br />    Also, it is best that you do not place items in pathways and instead place things close to walls or any out-of-the-way place.\r<br />    \r<br />    Since placement requires first person view, the mod Immersive First Person View will cause some problems. I am not saying that these can&#39;t work together, but you may need to avoid using the feature that Immersive First Person provides while in the placement process. In short make sure you are not in the immersive first person view when you drop a kit. I have tested this and it makes placement more difficult as the there is no way to accurately aim the visual reference.\r<br />\r<br />    This mod should in no way be in direct conflict with any other mod.\r<br />\r<br />Furthermore:\r<br />    This was not intended to be a carpentry system. This is intended to be a balanced method of allowing you add a few extra things to your home. I have no intention of adding chair, beds or any other interactive furniture to this mod. If you wish to expand upon this mod, then you have my permission to use this mod and it&#39;s code to do so, so long as you credit me with a link to my profile and this mod&#39;s page.\r<br />\r<br />Credits:\r<br />[url=http://www.nexusmods.com/skyrim/users/187943/?]Chesko[/url], the maker of [url=http://www.nexusmods.com/skyrim/mods/11163/?]Frostfall[/url], for his placement method which inspired the placement method used here and for answering some questions I had about his placement method.\r<br />egocarib, Hyno88, DienesToo, B1gBadDaddy,  cdcooley and a few others from the bethsoft forums for all of their assistance.\r<br />[url=http://forums.nexusmods.com/index.php?/user/2188613-berenost/]Berenost[/url] for suggesting Frostfall&#39;s placement system, for his request for the feature that this mod provides, and for his help with the recipes.\r<br />Strotis for making the resources used for the tool box.\r<br />[url=http://www.nexusmods.com/skyrim/users/776954]Tamira[/url] for obtaining permission and uploading [url=http://www.nexusmods.com/skyrim/mods/45540/?]Strotis Craftsman Tools[/url]\r<br />\r<br />Alternatives to this mod:\r<br />    [url=http://www.nexusmods.com/skyrim/mods/10045/?]Craftable and moveable alchemy and crafting containers[/url]\r<br />    [url=http://www.nexusmods.com/skyrim/mods/17574/?]Storage Helpers[/url]\r<br />\r<br />Other related Mods:\r<br />    [url=http://www.nexusmods.com/skyrim/mods/22791/?]Home Construction and Decoration[/url]\r<br />    [url=http://www.nexusmods.com/skyrim/mods/25068/?]Placeable Statics - Move Anything[/url]",
  "categoryId": "28",
  "version": "0.1.2",
  "author": "trilioth",
  "createdUnix": "1401992039",
  "updatedUnix": "1403305241",
  "containsAdultContent": false,
  "uploadedBy": "trilioth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000111907",
      "name": "Quick Containers",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1936",
      "fileName": "Quick Containers-54635-0-1.zip",
      "uploadedUnix": "1401992035",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/a4d9fd2a65aa26b35d0b1d499e482d16ae178cd7e15862b28f81990a06b9034e/analysis/1408113582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quick%20Containers-54635-0-1.zip?fid=1000111907&ttl=1535839028&ri=8192&rs=8192&setec=0a1fc7d3ab81c8dc5b94d7a526615b6b"
    },
    {
      "fileId": "1000112316",
      "name": "v0.1 Missing Textures",
      "version": "0.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "497",
      "fileName": "v0.1 Missing Textures-54635-0-1.zip",
      "uploadedUnix": "1402262251",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/ce63dbc2e14dfb78f9ee38d3884a2e7dd216cf8085ee017551eaf93c2edbb078/analysis/1408118174/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/v0.1%20Missing%20Textures-54635-0-1.zip?fid=1000112316&ttl=1535839029&ri=8192&rs=8192&setec=a8d36ebb98009ec30030b1bdcca7a087"
    },
    {
      "fileId": "1000112498",
      "name": "0.1.1 (BETA)",
      "version": "0.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2434",
      "fileName": "0.1.1 (BETA)-54635-0-1-1.zip",
      "uploadedUnix": "1402390836",
      "modVersion": "0.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f06d1b4e45e932e6f699cf85fbb174b17894a279100fad6d21a201a29ac3cd04/analysis/1408120568/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/0.1.1%20%28BETA%29-54635-0-1-1.zip?fid=1000112498&ttl=1535839029&ri=8192&rs=8192&setec=8bd4bee0ce6464d9e746a1e1d314ec4b"
    },
    {
      "fileId": "1000113803",
      "name": "v0.1.2",
      "version": "0.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2435",
      "fileName": "v0.1.2-54635-0-1-2.zip",
      "uploadedUnix": "1403305241",
      "modVersion": "0.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/df0d5802209a7ea0aa88d898dbd8fd8681f670716073212f1bfda8592930b0e9/analysis/1408135634/",
      "changelogHtml": " Disabled Fighting Controls during activating and placement. This prevents the game from registering hot key presses. Oddly Numpad 1-8 are also hot keys. \r<br />Disabled Activate through the same function rather than using a perk as before. I should have realized I could do this from the start. \r<br />Disabled Controls in the same manners as placement for the adjustment process and also added check for combat to abort adjustment.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/v0.1.2-54635-0-1-2.zip?fid=1000113803&ttl=1535839030&ri=8192&rs=8192&setec=cad56a473b62912630ec395fc73825fc"
    }
  ]
}