{
  "modId": 54687.0,
  "modName": "RedSkull Fort Food Supplies",
  "summary": "This addon is a work-in-progress and must be used with LC_BecomeJarlofIvarstead (by Locaster). This addon places a few food barrels at RedSkull Fort.",
  "descriptionHtml": "This addon is a work-in-progress and must be used with [url=http://www.nexusmods.com/skyrim/mods/51633/?]LC Become Jarl of Ivarstead by Locaster[/url]. \r<br />\r<br />Currently this addon places a few food barrels at RedSkull Fort and fixes some clipping issues.\r<br />\r<br />This addon has been cleaned by TES5Edit, all edits in this addon are intentional.\r<br />\r<br />One of the more difficult quests for Become Jarl of Ivarstead is trying to find 50 potatoes, 50 red apples, 50 tomatoes, and 30 venison. I ended up using cheat codes, because gathering those items was a chore and there wasn&#39;t a viable alternative. \r<br />\r<br />To help fix this problem I&#39;ve added a couple of food barrels at RedSkull Fort, they have the exact amount of food items needed to complete the quest. So, once you get the quest to collect the various types of food, head to RedSkull Fort and look for the food barrels, but watch out for RedSkulls. There isn&#39;t a quest telling you to head to RedSkull Fort to steal their supplies, but I don&#39;t think you always need a quest objective. Stealing from your enemy to strengthen your own army, seems like a logical plan.\r<br />\r<br />Don&#39;t worry, you don&#39;t go inside the Fort (it&#39;s locked anyway and requires a key), the food barrels are outside, just look for the area where all the mead barrels are stacked.\r<br />\r<br />You might be wondering how the RedSkulls got so much food. Well, they may have pillaged other towns, or maybe they&#39;re stockpiling supplies in preparation for a war with Ivarstead.\r<br />\r<br />[b]If anyone has problems or suggestions, please let me know.[/b] \r<br />\r<br />Some of the storage items from the original mod are stacked in perfect order, something I&#39;ve heard Elianora warn other modders to avoid, because it doesn&#39;t look lived-in, it ends up looking fake. I would like to fix this problem, but it depends on how much free time I have.\r<br />\r<br />[b][color=#f6ff00]Required Mod:[/color][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/51633/?]LC_BecomeJarlofIvarstead by Locaster[/url]\r<br />\r<br />[b][u]Installation:[/u][/b]\r<br />Install [url=http://www.nexusmods.com/skyrim/mods/51633/?]LC_BecomeJarlofIvarstead[/url] first, and then mine. \r<br />Use Nexus Mod Manager to install this mod or manually install it.\r<br />Use BOSS or LOOT to sort your load order. Or, place my mod below LC_BecomeJarlofIvarstead.\r<br />\r<br />[b][color=#e88a1a]Recommended Mods:[/color][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/54558/?]Lesser Tribes Men in the Rift by TheBlueShark[/url] reduces the number of RedSkulls.\r<br />[url=http://www.nexusmods.com/skyrim/users/3231858/?tb=mods&pUp=1]Elianora&#39;s house mods[/url]\r<br />\r<br />[b][u]Acknowledgements:[/u][/b]\r<br />I would like to thank Locaster, who spent over 7 months working on LC_BecomeJarlofIvarstead. Of course, without him this addon would not exist. Locaster&#39;s hard work and determination is very much appreciated, more than he knows, and we lost a great modder the day he left Skyrim. I hope he returns soon and makes more amazing mods for us to experience and praise.\r<br />\r<br />I would like to thank TheBlueShark, who was probably the first one to get an addon for Jarl of Ivarstead working and published after Locaster left Skyrim modding; his addon reduced the number of RedSkulls outside Riften and Ivarstead, making the wilderness a little safer for everyone.\r<br />\r<br />Thank you Bethesda for making Skyrim, one of the best games ever made.\r<br />Thank you Nexus for hosting a site where modders and gamers can share their creativity and talents with one another. ",
  "categoryId": "28",
  "version": "1.0",
  "author": "PhoenixSky",
  "createdUnix": "1402163792",
  "updatedUnix": "1402163789",
  "containsAdultContent": false,
  "uploadedBy": "PhoenixSky",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112180",
      "name": "PS_RedSkullFortFoodSupplies",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "PS_RedSkullFortFoodSupplies-54687-1-0.7z",
      "uploadedUnix": "1402163789",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6689f9f8f6530be28c37feb38318008c15eb2f0a41bee12c8689d880f6f86e7c/analysis/1408116562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PS_RedSkullFortFoodSupplies-54687-1-0.7z?fid=1000112180&ttl=1535839113&ri=8192&rs=8192&setec=6ceca7784358dc87f594f134804a69df"
    }
  ]
}