{
  "modId": 5470.0,
  "modName": "Rama_s Happy Pretty Colorful Necromancer Robes Mage Clothes",
  "summary": "This is a very small file download size that changes all the necromancer robes in the game to a much happier colorful version, that is still tasteful. _Instead of a skull on the front_ there is a subtly colored rainbow sun. I also _added a design to the back_ of the mage robes, the portion you are typically viewing :)",
  "descriptionHtml": "Another Mod by me: \r\n\r\nRama\\'s Perfect Female Skin Mod\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=5057\r\n\r\ncopy-paste the above line into your web-browser address bar to see my main mod :)\r\n\r\n---\r\n\r\nAdding Pics of Your Own\r\n\r\nIf anyone wants to add pics of their characters wearing my happy necromancer robes, \r\n\r\nyou can click the two-rectangle icon below the version number near top of this page.\r\n\r\nI will verify your pics post-inspection which may take awhile depending on my schedule.\r\n\r\n---\r\n\r\nVersion 1.0\r\n\r\nRama\\'s Happy Pretty Colorful Necromancer Robes (female and male)\r\n\r\n\r\nSummary:\r\n\r\n-made necromancer robes a richer darker black color\r\n\r\n-added a pretty design to back of robes\r\n\r\n-removed skull from front of robes\r\n\r\n-added a tasteful rainbow sun design to front of robes\r\n\r\n\r\n-no change to amount of skin being revealed\r\n\r\n\r\nStory:\r\n\r\nI made this mod because I was using a two-handed conjured weapon girl who also raises the dead to fight for her, and uses Alteration magic to give herself magic armor.\r\n\r\nI looted some better quality robes, necromancer robes, that gave me 75% magic regen instead of 50%.\r\n\r\nThe only problem was, I really didn\\'t like the necromancer front image of a skull!\r\n\r\nI wanted to wear robes that made me happy and uplifted!\r\n\r\nSooo, I made my own!\r\n\r\nI also added a design to the back of the necromancer robes, since I am typically looking at my girl\\'s back.\r\n\r\nNote that this mod replaces all necromancer robes in the game with the happier, prettier version.\r\n\r\n* * *\r\n\r\nThis means mage enemies you fight who used to wear the old necromancer robes will be wearing my more colorful necromancer robes even if you aren\\'t :)\r\n\r\n* * *\r\n\r\nI made this mod originally for my own entertainment.\r\n\r\nThen I found my mod made me surprisingly happy!\r\n\r\nI really enjoy seeing my happy necromancer robes, the colors, the shapes, for some reason it is soothing and entertaining at the same time.\r\n\r\nBecause I found I liked it so much I concluded I should share it with all of you!\r\n\r\n\r\nIf you like my mod feel free to upload pics, which I explain how to do at the top of this post.\r\n\r\n\r\nEnjoy!\r\n\r\n-Rama\r\n\r\n---\r\n\r\nHow to Obtain These Robes\r\n\r\n~~~\r\n\r\nAzura Star Quest\r\n\r\nDo the Azura Star quest chain and you\\'ll get about a 100 of them hee hee, obtain this quest from Riverwood or Whiterun inn keeper if you don\\'t have it already.\r\n\r\nThe Azura Star quest is essential for developing a strong character with great enchanted weapons and armor, you should do it early if you want it to be easier. \r\n\r\nPre-level 10, Azura Star quest chain is VERY easy.\r\n\r\nMake sure to always side with the guy in Winterhold, don\\'t go back to the shrine after you obtain the quest from the lady at the shrine.\r\n\r\nThe only reason I am telling you this is because it is an unlucky fate for any poor player that doesn\\'t follow this advice, as grand souls of large animals like mammoths are so much harder to find (trying to not reveal too much).\r\n\r\n~~~\r\n\r\nNear Whiterun\r\n\r\nYou can try the skill stone near Whiterun, to the east and across the river, near the bandit towers.\r\n\r\nThis is THE necromancer skill stone.\r\n\r\n~~~\r\n\r\nFastest Method\r\n\r\nOr you can enter this code into your console:\r\n\r\n1. press ~ to activate console\r\n\r\n2. enter the following:\r\n\r\nplayer.additem c36ea 1\r\n\r\nnote: \r\n\r\nc36ea = item code\r\n\r\n1 = quantity\r\n\r\n---\r\n\r\nNote on the Pictures for this Mod: \r\n\r\nEvery computer\\'s color / display settings are different, and your game resolution and anti-aliasing settings will also change what you see in-game.\r\n\r\n\r\nThe pictures on this page are lower quality than what your in-game experience will be!\r\n\r\n\r\n* * *\r\n\r\nSo please try my mod for yourself to see how it will look on your computer with your settings.\r\n\r\nI cannot show you pictures that will give you a completely accurate representation of how it will look on your machine, so try it out :)\r\n\r\nFortunately, my mod is easy to install/uninstall.\r\n\r\n:)\r\n\r\n<3\r\n\r\nRama\r\n\r\n* * *\r\n\r\nNo-Risk Install\r\n\r\nThis mod is easy to undo if you don\\'t like it.\r\n\r\nThis mod does not damage or alter any original installation files\r\n\r\n---\r\n\r\nTo Install\r\n\r\nCopy the zipped folder series, starting with \\\"Data\\\" into the _same directory as your TESV.exe file_, probably in:\r\n\r\nc:\\\\program files(x86)\\\\steam\\\\steamapps\\\\common\\\\skyrim\r\n\r\nTo get to the location I am describing, start by going to your computer\\'s main hard drive, probably C:\\\\ using My Computer, then click on the hard drive, then go to program files and follow the above path.\r\n\r\nThere might already be a Data folder in your main Skyrim directory, if you have any other mods. \r\n\r\nWhen copying the file structure for this mod, starting with Data, select the option to overwrite any duplicate files. \r\n\r\nIf you already have a modified version of the necromancer robes, see below for how to test this mod without affecting your prior modified Skyrim.\r\n\r\nRemember there is only a single file inside the series of folders in the zipped download, so selecting \\\"overwrite any duplicates\\\" will only affect a maximum of 1 file.\r\n\r\n\r\nSorry for the lack of nexus download manager support at present, you should learn to do these things directly though, it will become more important to be intimately familiar with your Skyrim file structure once the Creation Kit comes out.\r\n\r\nYou need to know how modding works yourself so you can undo anything other people\\'s mods do to your skyrim file structure, because they won\\'t always tell you how to undo the damage.\r\n\r\n---\r\n\r\nHow Modding Works\r\n\r\n* * *\r\n\r\nThis is essential information for you to know so that you are in charge of your Skyrim Reality. \r\n\r\n* * *\r\n\r\n\r\nOur friends at Bethesda were so nice to make modding so easy.\r\n\r\nBasically, any files you put into a folder called Data, in your root Skyrim folder where \\\"TESV.exe\\\" is located will be preferred by Skyrim when it launches.\r\n\r\nSkyrim dynamically checks the contents of your custom Data folder each time you load Skyrim.\r\n\r\nSo to see changes you\\'ve made to your Data folder you have to quit and re-launch Skyrim.\r\n\r\n\r\nTo undo any mods, you go into the Data file structure and delete the appropriate files.\r\n\r\n\r\nIf you don\\'t have a \\\"Data\\\" folder you can make one.\r\n\r\n\r\nMost likely you do have a Data folder if you\\'ve found this mod of mine :)\r\n\r\n\r\nThe reason mods can have conflicts is because sometimes mods modify the same files in the Data file structure, and Skyrim can only pick one version of that file to use at a time.\r\n\r\n---\r\n\r\nHow to Test a New Mod Easily, Wile Preserving Your Previous Modded Skyrim Settings\r\n\r\nIf you want to test a mod, rename existing files that you do not wish to overwrite permanently, and try the new mod that modifies those same files.\r\n\r\nIf you don\\'t like the new mod you tried, delete the files and rename the originals.\r\n\r\nFor example, if you already have a hypothetical file named filename.dds in your Data folder structure, you can rename it to filename.back and then try my mod which has its own version of filename.dds\r\n\r\nThis way, you can easily undo my mod by deleting the new filename.dds and renaming the backup that you made.\r\n\r\n---\r\n\r\nWhat Are .DDS Files?\r\n\r\nTo view/edit .dds files, download PAINT.net, it is free\r\n\r\n---\r\n\r\nHow Can I Access Skyrim\\'s Original Textures, Models/Meshes, and All other Game Data?\r\n\r\nTo extract files from Skyrim\\'s core .bsa files,\r\n\r\ngoogle search for \\\"FO3_Archive_Utility-34.zip\\\"\r\n\r\nor \\\"FO3 archive utility\\\"\r\n\r\nFO3 = FallOut 3\r\n\r\nThis is how you can view the entire file structure of all meshes, textures, and everything else for Skyrim, extract, and play with these files.\r\n\r\nThen move these files to the Data folder as I describe above to try your own mods.\r\n\r\n---\r\n\r\nCompatibility \r\n\r\nThis Mod is compatible with all mods except a mod that modifies the necromancer robes.\r\n\r\n---\r\n\r\nTo Uninstall\r\n\r\n1. Navigate to your main skyrim dir where TESV.exe is located, probably c:\\\\program files(x86)/steam/steamapps/common/skyrim/ (no x86 for XP users)\r\n\r\n2. Navigate to Data/Textures/clothes/necromancer/\r\n\r\n3. delete this file\r\n\r\nrobes.dds\r\n\r\n---\r\n\r\nOther Mods Used in the pictures:\r\n\r\nSkyUI - you gotta have this, it is awesome! Check for latest version periodically, it is still in production\r\n\r\nBella\\'s Prettier Female Faces Mod\r\n\r\nCoolsims Hair pack\r\n\r\nMany thanks to both of them for enhancing my Skyrim experience!\r\n\r\n---\r\n\r\nVictory to You All!\r\n\r\nRama\r\n",
  "categoryId": "60",
  "version": "1.0",
  "author": "Rama",
  "createdUnix": "1325853918",
  "updatedUnix": "1325854075",
  "containsAdultContent": false,
  "uploadedBy": "evernewjoy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17155",
      "name": "Rama_s Happy Necromancer Robes Mage Clothes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "249",
      "fileName": "Rama_s Happy Necromancer Robes Mage Clothes-5470-1-0.rar",
      "uploadedUnix": "1325854075",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/45a18af58cd1e8fb6d6c22de13e3fa5c634d842c74f0a0c84ca69dd63285a870/analysis/1406587392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rama_s%20Happy%20Necromancer%20Robes%20Mage%20Clothes-5470-1-0.rar?fid=17155&ttl=1535762220&ri=8192&rs=8192&setec=9c2d5218400061f6818bd0a5c7e349df"
    }
  ]
}