{
  "modId": 54734.0,
  "modName": "Become High King of Skyrim - Deutsch",
  "summary": "Wolltet ihr:\r<br />... noch nie jemanden gehabt den ihr köpfen wollt? ins Gefängnis stecken? versklaven?\r<br />... jemanden zu fragen, das jemand sagt, Farkas oder Balgruufs Kinder, geht hinaus und beschützt Himmelsrand als Teil deiner elitären Jäger?\r<br />... jemanden anzuordnen ihre Taschen zu leeren und ihr Gold anschließend zu erhalten?\r",
  "descriptionHtml": "I. UM WAS GEHT ES IN DIESER MOD?\r<br />\r<br />Hier gibt es eine Vorschau dafür, was mit dieser Mod möglich ist:\r<br />http://imgur.com/a/6Zl7k\r<br />\r<br />Here is a roleplay-playthrough of the mod:\r<br />http://imgur.com/a/uxEa7\r<br />\r<br />Wolltet ihr:\r<br />... noch nie jemanden gehabt den ihr köpfen wollt? ins Gefängnis stecken? versklaven?\r<br />... jemanden zu fragen, das jemand sagt, Farkas oder Balgruufs Kinder, geht hinaus und beschützt Himmelsrand als Teil deiner elitären Jäger?\r<br />... jemanden anzuordnen ihre Taschen zu leeren und ihr Gold anschließend zu erhalten?\r<br />... ein komplettes Schloss im Besitz mit eigener Mine, heißen Quellen, Seelenschmiede, ihr könnt über 40 Begleiter haben, einem Marktplatz, einer Arena, etc... sogar einen gefangenen Drachen&#33;\r<br />... Leute einzuladen in eurem Schloss zu leben? Das ist richtig&#33; Ihr glaubt Noster der Bettler verdient ein besseres Leben? Fragt ihn ob er dort leben möchte&#33; Ihr mögt die ansprechende Hroki? Ladet sie ebenfalls ein&#33; Möchtet ihr NPCs einsammeln für eure Arena? Kein Problem, ladet sie einfach ein dort zu leben&#33;\r<br />... macht jeden zu eurem Begleiter, nicht nur zu einem einfachen Begleiter, aber lasst sie zu eurem Level aufsteigen und ihnen Perks geben? Das ist richtig&#33; Ihr könnt auf Abenteuer mit Ulfric gehen, einem Graubart, sogar Oberfeinde wie Harkon, Ysolda (und macht sie zu einem mächtigen Krieger), mit jedem den ihr sprecht, könnt ihr zu einem Begleiter machen&#33;\r<br />... besitzt eine eigene Armee, welche euren Befehlen folgt, eure Schlachten schlägt, während ihr in Ruhe dasitzt und ihr könnt NPCs wie Lydia, Miraak oder sogar den Kindern Teil eurer Armee werden?\r<br />\r<br />Wenn ihr einen der oben genannten Punkten zustimmen könnt und sogar wenn ihr dies nicht getan habt, ist diese Mod etwas für euch&#33; Diese Mod besitzt so viele Features, welche ihr nützlich finden werdet&#33; Diese Mod besitzt sogar eine Rüstung, welchen euch unsichtbar macht sobald ihr in der Hocke seit&#33;\r<br />\r<br />II. BENUTZUNG\r<br />\r<br />- Benutzt dies nicht bei einem neuen Spiel. Benutzt diese Mod NACHDEM ihr mit allen wichtigen einleitenden Quests fertig seit\r<br />- Diese Mod besitzt keine Sprachdateien, also nutzt eure Untertitel\r<br />- benötigt keine DLC&#39;s. Nur das Hauptspiel auf aktuellem Stand\r<br />- jede einzelne Version ist STANDALONE und wird für sich funktionieren\r<br />\r<br />III. ALLE NPC&#39;s KÖNNEN NUN GETÖTET WERDEN\r<br />\r<br />- durch das hinzufügen eines optionalen Patches kann jeder getötet werden. Bitte teilt mir die NPC&#39;s mit, welche immer noch nicht sterben wollen.\r<br />- Achtung: Das töten von NPC&#39;s welche nicht sterben sollten, kann die Questreihe &#34;zerstören&#34;\r<br />- ihr könnt zwischen den Essential/Nicht-Esssential Status jedes NPCs mittels der Dialoge schalten\r<br />- tippe &#34;set aakingextra to 0&#34; ein, um den &#34;Seit ihr essential?&#34; Dialog zu verbergen\r<br />\r<br />IV. SURGUS AUS DER DUNKELHEIT\r<br />\r<br />Ein neuer NPC in den Bezirken von Markarth welcher die Großkönig-Quest starten lässt\r<br />- er bietet euch an Leute für euch zu töten. Lauft einfach zu dem NPC den ihr hasst, markiert ihn mit einer neuen Dialogoption und kehrt anschließend zu Surgus zurück. Zahlt ihm 1500 Gold und er wird sich um das Problem für euch kümmern\r<br />\r<br />V. WERDET GROßKÖNIG VON HIMMELSRAND&#33;\r<br />\r<br />- als erstes sprecht mit Surgus um die Quest zu beginnen\r<br />- die Questgegenstände dienen nur der Information, sie werden euren Fortschritt nicht aufzeichnen noch diesen vervollständigen. Aber dies bedeutet nicht, dass diese nicht funktionieren. Erfüllt die Bedingungen und sprecht anschließend mit Surgus\r<br />\r<br />Um Großkönig zu werden benötigt ihr:\r<br />1. Besitzt 50.000 Gold für eure Kampagne \r<br />2. Erlangt 20 Unterstützer, welche euer Vorhaben unterstützen\r<br />3. EINES der folgenden:\r<br />- Tötet Ulfric oder lasst ihn ermorden\r<br />- Tötet Elisif oder lasst sie ermorden\r<br />ODER\r<br />- Heiratet Elisif oder Ulfric (Die Quest zur Heirat wurde dafür an diese angepasst)\r<br />ODER\r<br />- Erlangt 40 Unterstützer, welche euren Vorhaben unterstützen anstelle von 20\r<br />\r<br />\r<br />Um Unterstützer zu erlangen, sprecht mit jemanden mit dem ihr eine gute Beziehung habt, nachdem die Quest begonnen hat. Eine neue Dialogoption wird erscheinen, welche euch nach Unterstützung fragen lässt\r<br />\r<br />- Nachdem dies alles getan wurde, kehrt zu Surgus zurück und er wird euch zum Großkönig machen.\r<br />\r<br />Achtung: Das Heiratssystem funktioniert, jedoch wird das Spiel weder Ulfric noch Elisif nach der Heirat als Ehegatte ansehen. Ihr könnt sie demnach heiraten und anschließen Großkönig werden, aber sie werden nicht wie euer Gatte agieren. Ich muss noch immer die vorhandenen Dialogzeilen dafür editieren.\r<br />\r<br />VI. SPIELT ALS DER GROßKÖNIG VON HIMMELSRAND&#33;\r<br />\r<br />Der Großkönig zu sein bringt viele neue Features und Herausforderungen mit sich&#33;\r<br />- Ihr werdet eine unbestimmte Zahl an Personen haben die euch Grüßen und euch als den Großkönig anerkennen\r<br />- Ihr werdet neue Dialogzeilen erhalten, welche euch nach dem Eintritt ins Gefängnis die Möglichkeiten gibt eure Straftaten zu tilgen und sofort freigelassen zu werden\r<br />\r<br />Als der Großkönig könnt ihr eure Leute anordnen:\r<br />- sich vor euch zu verbeugen/tanzen\r<br />- all ihren Besitz abzugeben\r<br />- jemanden dazu zu zwingen euch zu lieben und ein potienzieller Bewerber für eine Hochzeit zu werden, unabhängig des Geschlechtes\r<br />- jemanden augenblicklich mit eurem Thuum zu töten\r<br />- und vieles, vieles mehr&#33;\r<br />\r<br />Weitere nützliche Zusätze\r<br />\r<br />Nützliche Zaubersprüche:\r<br />- Tunnel nach Hochwind beschwören: Beschwört einen Tunnel der euren Aufenthalt direkt mit Festung Hochwind verbindet\r<br />- Behälter der Händler beschwören: Beschwört einen Handelsbehälter, um eure Waren abzulegen. Eure Bezahlung wird in Hochwind erhältlich sein.\r<br />- Teleport nach Hochwind: Teleportiert euch nach Hochwind. Wirkt den Zauber erneut, um zur vorherigen Position zurückzukehren.\r<br />- Teleport zu den Jägern von Hochwind: Teleportiert euch zu den Jägern. Geht und folgt ihnenl&#33;\r<br />- Teleport zum/zur königlichen Gatten/in: Teleportiert euch zum/r königlichen Gatten/in\r<br />- alle Zauberspruchrollen dieser Mod können im Schloss von Hochwind gefunden werden, nahe dem Thron\r<br />\r<br />Nützliche Gegenstände:\r<br />- Chameleon Cuirass\r<br />- Reisestiefel\r<br />- alle Bonusgegenstände können am Marktplatz von Hochwind gefunden werden\r<br />\r<br />VII. ANWERBUNGSSYSTEM\r<br />\r<br />- ihr werdet möglicherweise Leute aus verschiedensten Schichten anwerben\r<br />- angeworbene NPC werden manuell nach Hochwind laufen. Also wartet eine Weile bevor sie dorthin gehen, erwartet sie nicht auf der Stelle dort.\r<br />\r<br />1. Der Hohe Rat von Himmelsrand\r<br />- ihr könnt Leute für euren Hohen Rat anwerben\r<br />- Mitglieder des Hohen Rates werden im Schloss leben\r<br />\r<br />Oberster Verwalter\r<br />- sammelt Steuern ein\r<br />- ermöglicht euch die Scheidung\r<br />- ermöglicht euch die Jäger oder euren Gatten zurück nach Hochwind zu beordern\r<br />- ermöglicht euch die Jarl nach Hochwind einzuberufen (nur die Jarl, welche von der Mod unterstützt werden)\r<br />\r<br />Großer Gelehrter\r<br />- studiert viel um Skills zu erlernen (eimal pro Tag)\r<br />- ermöglicht euch die zusätzlichen Dialoge wie &#34;Seit ihr auf essential gesetzt?&#34; und &#34;(Markiert für den Tod)&#34; zu deaktivieren\r<br />\r<br />Hochzauberer\r<br />- bietet einen Laden, wo ihr Zutaten aller Art kaufen könnt\r<br />\r<br />Oberster Kommandant\r<br />- Führer der Armee\r<br />- ermöglicht es euch Soldaten anzuwerben\r<br />\r<br />Meisterschmied\r<br />- verkauft Waffen\r<br />- wird in der Schmiede nahe des Stadtzentrums von Hochwind arbeiten (tagsüber)\r<br />\r<br />2. Die Leibwache des Großkönigs\r<br />- ihr könnt jeden als euren Schutz anheuern\r<br />- Leibwächter können aufleveln\r<br />\r<br />Lernt Perks\r<br />- eure Leibwächter, Jäger und eure Armee können nun möglicherweise Perks erlernen\r<br />- das Erlernen von Perks kostet zwischen 1000-2000 Gold\r<br />\r<br />Perk-Liste:\r<br />Einhandmeister - 50% Bonus auf Einhandschaden\r<br />Zweihandmeister - 100% Bonus auf Zweihandschaden\r<br />Rüstungsmeister - 100% Bonus auf Rüstung\r<br />Bogenmeister - 100% Bonus auf Bogenschaden\r<br />Arkaner Schutz - 50% Immunität auf magischen Schaden\r<br />Drachenherz - Bonus 500 Gesundheitspunkte\r<br />\r<br />Einzigartige Leibwächter in Hochwind:\r<br />\r<br />Hanza Unsichtbar\r<br />- Level 30\r<br />- dauerhaft unsichtbar\r<br />- kann angewiesen werden erneut unsichtbar zu werden nach einem Kampfe/agieren mit einem Gegenstand\r<br />- zu finden in der Taverne\r<br />\r<br />Umbra\r<br />- Level 80\r<br />- mächtige Leibwache mit einzigartiger Ausrüstung\r<br />- zu finden in der Taverne\r<br />\r<br />Ysgramor\r<br />- Level 50\r<br />- besitzt eine einzigartige Version von Wuuthrad welche Feinde bei einem mächtigen Angriff in die Luft schlägt\r<br />- zu finden im Portal nach Sovngarde\r<br />\r<br />Jurgen Windrufer\r<br />- Level 50\r<br />- besitzt alle Schreie der Graubärte\r<br />- zu finden im Portal nach Sovngarde\r<br />\r<br />Ulfric Stormcloak\r<br />- Level 20\r<br />- benutzt Schreie im Kampf\r<br />- wird als ein Geist im Portal nach Sovngarde erscheinen, sofern er getötet wurde\r<br />\r<br />3. Die Armee von Hochwind\r<br />- die persönliche Armee des Großkönigs\r<br />- kann als eine Einheit befehligt werden\r<br />- kann individuell aufgerüstet/angekleidet werden\r<br />- leben in den Kasernen\r<br />- Oberster Kommandant und die Helden von Himmelsrand sind alle Teil der Armee und werden deren Befehlen folgen\r<br />\r<br />Soldaten von Hochwind\r<br />- können bei dem Obersten Kommandanten für jeweils 1500 Gold erstanden werden\r<br />- ihr könnt 5 Soldaten für 7500 Gold auf einmal kaufen\r<br />- werden auf eurem Level spawnen\r<br />- können individuell angekleidet werden\r<br />\r<br />Helden von Himmelsrand\r<br />- ihr könnt jeden zu einem Helden machen\r<br />- ihr könnt bis zu 5 Helden besitzen\r<br />- die Helden werden in den Kasernen leben und nahe des Schlosses tranieren\r<br />\r<br />4. Die Jäger von Hochwind\r<br />- Nicht so wie die Armee, welche dem Großkönig folgt oder in den Kasernen bleibt, werden die Jäger auf Patrouille in Himmelsrand gehen\r<br />- werden gegen Banditen und Monster kämpfen\r<br />- können den Befehl erhalten nach Hochwind zurückzukehren, durch den Administrator\r<br />\r<br />Hauptmann der Jäger\r<br />- ihr könnt jeden in diese Stellung einsetzen\r<br />- ihr könnt bis zu 5 Jäger unterhalten\r<br />\r<br />*Es ist ratsam als erstes die Jäger nach Hochwind zurückzuholen bevor ihr einen neuen Jäger einstellt, damit sie sich neu bilden und gemeinsam auf Patrouille gehen können.\r<br />\r<br />4. Bürger von Hochwind\r<br />\r<br />Bürger\r<br />- ihr könnt NPC&#39;s zu Bürgern von Hochwind machen\r<br />- sie werden in Hochwind leben, arbeiten und schlafen\r<br />- bis zu 30 Bürger\r<br />\r<br />Adlige\r<br />- ihr könnt NPC&#39;s aus Himmelsrand zu Adligen machen\r<br />- sie werden im Schloss leben\r<br />- bis zu 5 Adlige\r<br />\r<br />5. Königliche/r Gatte/in\r<br />- ihr könnt nur jemanden zu eurem Gatten/eurer Gattin machen, wenn ihr mit dieser verheiratet seit, durch die Heiratsquest des Spieles\r<br />- ihr könnt eure/n Gatten/in danach fragen, ob sie/er euch auf euren Abenteuern begleiten möchte (ihr könnt sie/ihn bitte aufzuleveln und Perks zu erlernen, wie eure Leibwachen)\r<br />- ihr könnt eure/n Gatten/in beauftragen hinauszugehen und Himmelsrand zu erkunden, er/sie wird auf Reisen bleiben bis ihr sie/ihn zurück nach Hochwind beordert\r<br />- ihr könnt eure/n Gatten/in beauftragen eine zufällige Stadt in Himmelsrand zu besuchen, er/sie wird dort bleiben bis ihr sie/ihn zurück nach Hochwind beordert\r<br />- diese zufälligen Städte können sein: Rifton, Weißlauf oder Einsamkeit\r<br />- ihr könnt über euren Administrator eure/n Gatten/in zugreifen/sie nach Hochwind zurückholen\r<br />- euer/eure Gatte/in wird Geschenke von ihren/seinen Reisen mitbringen sofern ihr ihn/sie in eine der Städte gesandt hattet oder sie/ihn auf Erkundsreise geschickt habt\r<br />- ihr könnt euren/eure Gatte/in fragen ob sie/er in Hochwind leben möchte. \r<br />\r<br />6. Jarl von ___________\r<br />- ernenne jedermann zum Jarl aus einer der größeren Städten\r<br />- die Jarl werden im Schloss der Stadt leben\r<br />- die Jarl können ihre Amtes enthoben werden\r<br />- die Jarl können ihre Kleidung auf Anfrage ändern\r<br />- die Jarl können über dem Administrator zu einem Treffen nach Hochwind beordert werden\r<br />\r<br />*Dies betrifft nur die Jarl welche durch diese Mod unterstützt werden, nicht aber die restlichen Jarl. Wenn ihr jemanden ernennt, so wird der eigentliche Jarl immer noch in seinem Schloss verweilen und wie ein Jarl agieren. Dies ist kein Bug, ich habe dies aus Kompatibilitätsgründen beibehalten. Falls ihr sie loshaben möchtet (sodass euer Jarl der einzige ist), so müsst ihr die alten Jarl gefangen nehmen bzw. töten.\r<br />\r<br />VIII. BESTRAFUNGSSYSTEM\r<br />\r<br />- ihr könnt jedermann auf verschiedensten Wegen bestrafen\r<br />\r<br />1. Hinrichtung\r<br />- ihr könnt jeden öffentlich hinrichten\r<br />- versichere dich das ihr sie auf Unessential gesetzt habt, sodass diese auch sterben\r<br />\r<br />2. Gefangenschaft\r<br />- ihr könnt jedermann gefangen nehmen\r<br />- die Gefangenen werden in den Zellen von dem Gefängnis von Hochwind verweilen\r<br />\r<br />3. Sklavenarbeit\r<br />- ihr könnt jederman versklaven und in den Aar-gol Minen arbeiten lassen\r<br />\r<br />4. Arena\r<br />- ihr könnt Leute in die Arena schicken\r<br />- ihr könnt zwei Leute in der Arena gegeneinander kämpfen lassen\r<br />\r<br />Um zwei Leute kämpfen zu lassen, setze einen auf &#34;Gladiator&#34; und den anderen NPC auf &#34;Herausforderer&#34;.\r<br />\r<br />IX. FESTUNG HOCHWIND\r<br />\r<br />- eine brandneue Worldspace welche nahe dem Eingang des Lagerhaus der Ostkaiserlichen Handelsgesellschaft zu fnden ist\r<br />- besitzt 20 Bewohner inklusive eines Barden\r<br />- &#34;coc aahighreachcenter&#34; falls ihr es nicht finden könnt\r<br />\r<br />Behälter der Händler\r<br />- zu finden überall in Hochwind\r<br />- ihr könnt darin Gegenstände ablegen und eure Händler werden diese für euch verkaufen, aber sie werden 20% &#34;Steuern&#34; erheben\r<br />- ihr könnt auch jederzeit durch den Zauberspruch einen Behälter beschwören. Zu finden im Thronsaal von Schloss Hochwind\r<br />\r<br />Festung Hochwind enthält:\r<br />1. Schloss des Großkönigs\r<br />- Mitglieder des Rates werden dort leben und an eurem Thron des Tages erscheinen\r<br />- Leute essen, sandbox und schlafen darin\r<br />- fügt eine Krone hinzu, neue Zauberbücher und die Robe des Herrschers für den Spieler, gleich gegenüber des Thrones in der großen Halle\r<br />\r<br />2. Schatzkammer von Hochwind\r<br />- ihr könnt dort Gegenstände in sicheren Behältern lagern\r<br />- enthält eine große Menge an Goldbarren, welche in der Not verkauft werden können\r<br />\r<br />3. Gefängnis von Hochwind\r<br />- der Schlüssel befindet sich auf einem Tisch innerhalb der Wachquartiere\r<br />- gefangene Npc&#39;s können über einen Dialog befreit werden\r<br />\r<br />4. Der schnarchende Horker (Taverne)\r<br />- besitzt einen Händler, welcher Speiß und Trank verkauft\r<br />- enthält eine Meetbrauerei im Keller\r<br />\r<br />5. Aar-Gol Sklavenminen\r<br />- ihr könnt bis zu 5 Leute in den Minen als Sklaven arbeiten lassen\r<br />- Sklaven können über einen Dialog befreit werden\r<br />- enthält Goldadern, welche eine große Menge Gold enthalten\r<br />\r<br />6. Hinrichtungsplattform\r<br />- ihr könnt nun jemanden öffentlich hinrichten\r<br />\r<br />7. Waffenkammer von Hochwind\r<br />- enthält eine Menge Mannequins, Lagertruhen, Schaukästen und Auslagen für eure Waffen & Rüstungen\r<br />\r<br />8. Skoomahöhle\r<br />- enthält einen geheimen Eingang\r<br />- enthält einige Zutaten, welche man für das Skooma benötigt\r<br />- ihr könnt nun &#34;Hochwertigen Skooma ersten Grades&#34; kochen (1 Nachtschatten, 1 Mohnzucker)\r<br />- &#34;Hochwertigen Skooma ersten Grades&#34; ist ein mächtiges Narkotikum\r<br />\r<br />9. Unterfrostarena\r<br />- enthält Schalter um Säbelzahntiger, Trolle und Chaurus zu spwanen\r<br />- enthält einen Schalter um die Gladiatoren loszulassen\r<br />- enthält eine Tür, welche zur aktuellen Arena führt (falls ihr aufräumen möcht/Bären kämpfen lassen wollt)\r<br />\r<br />10. Anwesen der Begleiter\r<br />- ein unbenutztes Haus mit 13 Betten (6 Doppelbetten)\r<br />- reserviert für eure Begleiter, ihr könnt &#34;My Home Is Your Home&#34; oder andere Mods benutzen, sodass ihr sie dort behalten könnt\r<br />\r<br />11. Botschaft von Hochwind\r<br />- die Botschafterin von Elswyr besitzt eine Mini-Quest, sodass ihr hochwertigen Skooma verkaufen könnt, sprecht einfach mit ihr\r<br />- der Botschafter der Thalmor startet nun die Thalmor-Kriegs-Quest\r<br />- Der Botschafter der Thalmor kann dazu benutzt werden Frieden oder Krieg mit den Thalmor zu schmieden\r<br />- Der Botschafter der Thalmor kann für euch die Kriegszonen zurücksetzen\r<br />\r<br />12. Tunnel von Hochwind\r<br />- ein besonderer Tunnel, welcher euch überall in Tamriel hinbringen wird&#33;\r<br />- fügt einen neuen Zauberspruch hinzu, &#39;Beschwöre Tunnel nach Hochwind, welcher eure aktuelle Position mit Hochwind verbindet\r<br />- die Zauberspruchrolle befindet sich in der Nähe des Thrones im Schloss\r<br />\r<br />13. Kasernen von Hochwind\r<br />- besitzt einen Händler, welcher normale Waffen & Rüstungen verkauft\r<br />- Soldaten, welche vom Obersten Komandanten erstanden wurden, werden sich hier aufhalten\r<br />\r<br />14. Katakomben von Hochwind\r<br />- zu finden oberhalb der Treppenstufen nahe der Rüstungskammer\r<br />- Verstorbene Soldaten von Hochwind werden hier plaziert\r<br />\r<br />15. Seelenschmiede\r<br />- kann benutzt werden um Seelensteine zu erwerben\r<br />\r<br />16. Portal nach Sovngarde\r<br />- führt zu den Meethallen von Sovngarde\r<br />- neues Gebiet, überschneidet nicht mit dem normalen Sovngarde\r<br />\r<br />17. Markt von Hochwind\r<br />- enthält massenweise Nahrung und Zutaten\r<br />- ihr könnt hier kochen\r<br />\r<br />18. Heiße Quellen von Hochwind\r<br />- ein neues Gebiet in dem die Bürger und Adligen sich aufhalten werden\r<br />- Bürger werden sich in diesem Gebiet entsprechend kleiden\r<br />\r<br />19. Bauernhöfe von Hochwind\r<br />- enthalten erntebare Pflanzen aller Art\r<br />\r<br />X. DER THALMOR-KRIEG\r<br />\r<br />- kann begonnen werden bei dem Botschafter der Thalmor\r<br />- der Beginn des Krieges wird 4 Kriegszonen in Tamriel erzeugen, welche ihr besuchen könnt\r<br />- ihr könnt um ein Friedesabkommen beten, welcher die Angriffe beenden wird (kostet 10.000 Gold)\r<br />\r<br />1. Thalmor Zufällige Begegungen\r<br />- es gibt eine gewisse Change das die Thalmor Weißlauf, Markarth, Windhelm, Einsamkeit oder Rifton angreifen werden solange ihr euch dort befindet\r<br />- jeder erschlagene Thalmor wird gezählt und reduziert die Schlagkraft der Thalmor-Truppen\r<br />\r<br />2. Kriegsbotschaft der Thalmor\r<br />- solltet ihr den Thalmorkrieg begonnen haben und der Botschaftsteil der Hauptquest wurde bereits abgeschlossen, so wird die Botschaft der Thalmor zu einer Kriegsbotschaft umgewandelt\r<br />- besitzt Soldaten im inneren, welche ihr töten könnt um ihre Anzahl zu reduzieren\r<br />- besitzt einen Kommandanten, dessen Tod ihre Anzahl um eine großen Teil reduzieren wird (irgendwo zwischen 50-300&#33;)\r<br />- dies ist ein Gebiet für höhere Level und sehr herausfordernd, sie stellen die Elite der Thalmor dar und sind auf Level 70 oder höher&#33;\r<br />- dies ist ein Gebiet welches respwanen wird wenn ihr es verlasst\r<br />\r<br />3. Thalmorkriegszonen\r<br />- 4 Thalmorkriegszonen werden in Himmelsrand erscheinen, welche die Invasion der Thalmor darstellen wird\r<br />- Orte: Außerhalb von Weißlauf, nahe Stendarrs Außenposten, nahe Halldirs Grab, nahe Schattengipfelturm \r<br />- das Betreten dieser Zonen wird den Kampf beginnen, mit 15-30 Thalmor auf der einen Seite und 10 Soldaten von Himmelsrand auf der anderen, eurer Oberster Kommandant und eure Helden von Himmelsrand auf einer anderen\r<br />- die Thalmorsoldaten in den Kriegszonen werden auf dem Level 30 sein\r<br />- Jede Kriegszone kann nur einmalig absolviert werden, anschließend müsst ihr mit dem Botschafter der Thalmor reden um diese zurückzusetzen\r<br />- Es ist zu empfehlen diese Zonen nur mit eurer Armee zu betreten\r<br />- Hinweis: Ihr benötigt keine riesige Armee, eine Armee von 10 Soldaten ist genug für eine solche Zone bei 10 bereits vorhandenen Soldaten, inklusive eures Kommandanten un eurer Helden\r<br />\r<br />XI. HANDHABUNG/DEBUG:\r<br />\r<br />Solltet ihr Probleme mit dieser Mod haben, so benutzt dies:\r<br />Setze AAIsHighKing auf 1 - macht euch sofort zum Großkönig\r<br />Setze AAKingExtra auf 0 - verbirgt den &#34;seit ihr essential?&#34; Dialog \r<br />\r<br />Diese Mod wird nicht länger unterstützt&#33; Ich bin zur Entwicklung mit Android fotgeschritten. Falls ihr die Zeit habt, hier ist meine App: https://play.google.com/store/apps/details?id=com.marchonestudios.popmath\r<br />\r<br />Benötigt keine DLC&#39;s aber die neueste Version von Skyrim&#33;\r<br />BITTE MACHT EINE UPDATE zu der neuesten Version UND behaltet einen Speicherstand, welcher diese Mod benutzt.\r<br />Benutzt einen Cleansave wenn ihr die Mod updatet&#33; Um einen Speicherstand zu säubern, deaktiviert meine Mod, lasst Skyrim laufen. Geht zu eurem Speicherstand, dann speichert. Beendet skyrim. Installiert die neue Version.",
  "categoryId": "24",
  "version": "v5e",
  "author": "Solarcow",
  "createdUnix": "1402302935",
  "updatedUnix": "1402302582",
  "containsAdultContent": false,
  "uploadedBy": "Gunter525",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112353",
      "name": "RemoveEssentials - Deutsch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "225",
      "fileName": "RemoveEssentials - Deutsch-54734-.7z",
      "uploadedUnix": "1402302369",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/74ed1482385ac48d62c98688ceea4db3ee08b6485ef94513f3ca49f9b0366eb8/analysis/1408118674/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RemoveEssentials%20-%20Deutsch-54734-.7z?fid=1000112353&ttl=1535839182&ri=8192&rs=8192&setec=56ecd6ede173db0de5c90e634425983c"
    },
    {
      "fileId": "1000112354",
      "name": "BecomeKingOfSkyrimv5e - Deutsch",
      "version": "v5e",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2796",
      "fileName": "BecomeKingOfSkyrimv5e - Deutsch-54734-5e.7z",
      "uploadedUnix": "1402302582",
      "modVersion": "v5e",
      "virusScanUrl": "https://www.virustotal.com/file/404ee527d1f6e47f37fddc6f0e79d397cd4dcd745cf023c94e1665fb356cc0ae/analysis/1408118677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BecomeKingOfSkyrimv5e%20-%20Deutsch-54734-5e.7z?fid=1000112354&ttl=1535839182&ri=8192&rs=8192&setec=16d86cfd42bbceab8a584e1df4bdd862"
    }
  ]
}