{
  "modId": 54769.0,
  "modName": "Hearthfire Exterior Improved",
  "summary": "Adds a littlebit of improved looks to the exteriors along with additional features.",
  "descriptionHtml": "Hearthfire Exterior Improved\r<br />****************************************\r<br />\r<br />About:\r<br />----------\r<br />What does this mod do? Well it adds new features upon the existing contents of the DLC.\r<br />It does not remove anything, but it simply adds new counterparts to the manors.\r<br />So far this mod have only progressed to be completed with the Lakeview Manor.\r<br />\r<br />It adds a new interior which got plenty of storage possibilities.\r<br />Also it expands on the exterior of the manor, making it a bit more... of a homestead rather than a building located somewhere in the wilderness.\r<br />Take a look at the images for more details.\r<br />\r<br />[CURRENTLY]:\r<br />As of V.06 I am looking at the two other manors and for their additional improvements, however they are located to extremely far up in the wilderness that applying a road will take alot of time. Their locations in general proves little landscape to add things upon, so I will have to technically alter the landscape and see what I can make out of it...\r<br />\r<br />Install:\r<br />---------\r<br />Recommended to use the NMM for installation as it is quick, fast and simple.\r<br />You can also install it manually by dropping the files into your Skyrim Data folder.\r<br />\r<br />Requirements:\r<br />--------------------\r<br />This mod does require all the official DLCs.\r<br />\r<br />\r<br />NOTE:\r<br />---------\r<br />This is a work in progress, I have no idea when it will be completed, so far it only contains the Lakeview Manor. This mod was something I made because I felt like this is what the DLC lacked.\r<br />Also take note that this mod simply adds these new features, so it is recommended to install them after you are done building Lakeview Manor. But I have done my best to make it as immersive as I could.\r<br />Enjoy ;)\r<br />\r<br />I would just like to mention that I am open for suggestions. What sort of other enhancements do you think the homesteads could use?\r<br />(Remember, stay within reason and stay true to the lore if you want to make a suggestion).\r<br />\r<br />ALSO take note that I am using the mod called Designs of the Nords. It gives alternative looks to banners in the game, I cannot identify if the banners shown on the picture are vanilla or not. Either way, I recommend the mod highly.\r<br />\r<br />Designs of the Nords:\r<br />http://www.nexusmods.com/skyrim/mods/13429/?\r<br />\r<br />Update log:\r<br />----------------\r<br />*V.02:\r<br />Reconfigurated some navmesh.\r<br />\r<br />*V.03:\r<br />Added a new interior cell for Lakeview Manor, Shrine of Talos.\r<br />\r<br />*V.04:\r<br />Added a road that connects the manor to the northern and southern roads.\r<br />\r<br />*V.05:\r<br />Added a new chest to the Shrine of Talos at Lakeview Manor.\r<br />\r<br />*V.06:\r<br />Added a new interior to Lakeview Manor: the Armory Shack.\r<br />\r<br />Known Bugs:\r<br />------------------\r<br />Upon the added extented platform at Lakeview Manor, NPCs / Followers have some problems accessing it from the left side, from the wooden platform. However, the right side is fully functional and they are able to reach it.\r<br />I have myself experienced that if you attempt to access the platform from the left side, my followers follows until they reach wooden platform, from there they will turn around and attempt to find another way to it.\r<br />You may also witness the followers hesitate when choosing the right path, I have corrected and checked the Navmesh to the best of my abilities, according to it, NPCs should be able to walk from both the left and right. However I use two companions, so it might result in some confusion regarding their chosen paths colliding with each other.\r<br />\r<br />In the Shrine of Talos section of the homestead... be aware that the interior cell is not very large and there are objects there that limit space a great deal.\r<br />Not sure if it works to gather up 2 - 3 followers and attempt to get them down there. I have done what is required in order to make NPCs follow you down there, but as I have 2 followers none of them appeared, it seemed they were instead waiting in the previous interior cell.",
  "categoryId": "67",
  "version": "V.06",
  "author": "Mikkhep",
  "createdUnix": "1402419644",
  "updatedUnix": "1412279536",
  "containsAdultContent": false,
  "uploadedBy": "MikkHep",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000129349",
      "name": "Hearthfire Exterior Improved V.06",
      "version": "V.06",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "200",
      "fileName": "Hearthfire Exterior Improved V.06-54769-V-06.rar",
      "uploadedUnix": "1412279536",
      "modVersion": "V.06",
      "virusScanUrl": "https://www.virustotal.com/file/3eee4003756ad0594dfc32a40f0960b8387d83fcf84ab0c1b9818dcdf894e082/analysis/1412279584/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Exterior%20Improved%20V.06-54769-V-06.rar?fid=1000129349&ttl=1535839234&ri=8192&rs=8192&setec=771ea0c35413093b1f0fdd0f4fe8a09c"
    }
  ]
}