{
  "modId": 54794.0,
  "modName": "Lydia Ranger",
  "summary": "Changes Lydia to a more ranger-like character. A different haircut, light armor and skills focused on one-handed, archery and sneak.",
  "descriptionHtml": "Somehow I was a little annoyed by Lydia. She is a good companion, but her outfitting never really suited my own character. So I decided to make this little tweak for myself and thought: why don&#39;t I just share it with anyone who also thinks Lydia should have been lightly armored. So here it is, my first ever mod, I hope you enjoy. If not, leave this page now.\r<br />\r<br />Details: It changes Lydia&#39;s appearance so she has a ponytail haircut, a few facial tweaks and a leather outfit. Also, she now has an Imperial Bow instead of a Hunting Bow and a starting amount of Steel Arrows. Her class has been changed to CombatAssassin, which makes her better with light armor, one-handed and archery skills. And as a little extra, I uncheched the box that said &#34;opposite gender anims&#34;, so now she SHOULD have a more feminine pose.\r<br />\r<br />NEW: There is now a version that leaves her old appearance intact, by request of  Aerodamus, it does reduce her weight a little so the pauldron-free armor doesn&#39;t glitch.\r<br />\r<br />Requirements: None unless you want her to have the pauldron-free Leather Armor. If you want her to have the pauldron-free version, look here: http://www.nexusmods.com/skyrim/mods/6975/?\r<br />\r<br />Bugs: The Grey Face Bug is likely to occur when activating this mod after first encountering the Housecarl. So either use this on a save file in which you haven&#39;t encountered the affected NPC, or hope a more experienced modder comes up with a solution.\r<br />\r<br />Installation: Standard procedure: download and drop the files in the Data folder. Don&#39;t use both eps&#39;s at the same time, because the one lowest in the load order will take superiority.\r<br />\r<br />Load order: as far down as possible, especially if you have mods running that alter Lydia.\r<br />\r<br />P.S., for some reason I can&#39;t take screenshots in-game, so please feel free to upload your screenshots with this mod :)\r<br />\r<br />Permissions: If you want to have the file changed, just send me a message and what you want changed, and I&#39;ll probably give permission or do it myself.",
  "categoryId": "96",
  "version": "1.0",
  "author": "pepertje",
  "createdUnix": "1402504916",
  "updatedUnix": "1402571203",
  "containsAdultContent": false,
  "uploadedBy": "pepertje",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112642",
      "name": "Lydia Ranger",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "118",
      "fileName": "Lydia Ranger-54794-1-0.rar",
      "uploadedUnix": "1402504835",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0016c99220886599b96cf3d90a6c79d46c0012ab143d45bc6e854ee4232c921c/analysis/1408122187/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lydia%20Ranger-54794-1-0.rar?fid=1000112642&ttl=1535839269&ri=8192&rs=8192&setec=a2ebc8367beddbf4d3846ff94c7eff02"
    },
    {
      "fileId": "1000112735",
      "name": "Lydia Ranger Old Face",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Lydia Ranger Old Face-54794-1-0.rar",
      "uploadedUnix": "1402571203",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d45680bf3d80f260d26b132a05cea79508877f879c4dbd2a2c2fe1c29964348f/analysis/1408123120/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lydia%20Ranger%20Old%20Face-54794-1-0.rar?fid=1000112735&ttl=1535839269&ri=8192&rs=8192&setec=230e3e66e4e6e53c0c22a9d9a930af48"
    }
  ]
}