{
  "modId": 54807.0,
  "modName": "Hulk 2.0 Follower",
  "summary": "This mod is a collection of pieces from the other older few hulk follower mods to make the best hulk follower because I wasn&#39;t impressed with the others.",
  "descriptionHtml": "Smashes like a giant but a lot more extreme than Hulkas (the other hulk mod) every blow smashes up the earth around him and sends people flying. The problem with the Hulkas mod is he could be sitting there punching away at the enemy for an eternity with a higher level because his actual damage wasn&#39;t that high. This hulk smashes, kills and sends them flying every time (the way a hulk should be). He also doesn&#39;t have a little bitch face like hulkas. He&#39;s got a masculine jaw and very manly features and no weird skin conditionwar paint. He also runs like 90 mph and is a bit bigger. If you want an even wider more muscular hulk try the better males Mod (bodybuilder version). Hulkas would sometimes glitches to a weight of 0.85 this hulk is 0.100 the maximum weight. Also the biggest problem of all is that Hulkas replaces Farkas....It caused so many mod conflicts&#33; Immersive weapons wont work, ultimate follower overhaul and worst of all it glitches the companion missions as Farkas is a main companion player. The only thing I took from the avengers hulk was his pants :P cool hulk clothes but that hulk was just a large green man with normal capabilities.\r<br />\r<br />Found in jorrvaskr\r<br />\r<br />*All credit goes to Hulkas and avengers mod&#33; Created my favorite mods they just needed Fixes",
  "categoryId": "96",
  "version": "",
  "author": "TJ",
  "createdUnix": "1402541583",
  "updatedUnix": "1402541580",
  "containsAdultContent": false,
  "uploadedBy": "tjkoehler",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112701",
      "name": "Hulk",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "147",
      "fileName": "Hulk-54807-.rar",
      "uploadedUnix": "1402541580",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/32663d9fee2d7ee3d38259a674e78add7de69d2a88909889a415a97bc0c2cc0a/analysis/1408122725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hulk-54807-.rar?fid=1000112701&ttl=1535839284&ri=8192&rs=8192&setec=f10aff6ed522cfa27b78ebdb4914c624"
    }
  ]
}