{
  "modId": 54803.0,
  "modName": "The Voice of Winter",
  "summary": "",
  "descriptionHtml": "This is my first attempt at modding so just bear with me. \r<br />&lt;br /&gt;I made this simple mod for myself a while back and decided I might as well upload it. While using the Vanilla Ice Form shout is fun, I thought that making it permanent would be even more fun&#33; Who doesn&#39;t want to freeze their foes solid and laugh at them? DISCLAIMER: I am not a very good modder.  \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;DESCRIPTION:\r<br />&lt;br /&gt;This mod looks at Ice Form from a more cryogenic stand point. \r<br />&lt;br /&gt;Basically this mod changes the Ice Form shout in three ways. \r<br />&lt;br /&gt;1. It removes the damage aspect from the last word of Ice Form. (This disables the damage completely when the full shout is used) \r<br />&lt;br /&gt;2. It shortens the cool down time for each word dramatically, making the shout overpowered. \r<br />&lt;br /&gt;3. It dramatically increases the amount of time the target is encased in ice when all three words are used. \r<br />&lt;br /&gt;This mod is not lore friendly at all and is pretty much a cheat. \r<br />&lt;br /&gt;The mod DOES NOT cause the target to freeze in place. That is Ice Form Improved by Keinichn.  (Link below.) It is not required for my mod to work and none of Ice Form Improved&#39;s files were used in The Voice of Winter.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;GLITCHES:\r<br />&lt;br /&gt;There are glitches that I have found, but I&#39;m not good enough at modding fix the problems.\r<br />&lt;br /&gt;These include: \r<br />&lt;br /&gt;-target sometimes disappears leaving an icy cloud in mid air. \r<br />&lt;br /&gt;-target appears to be where the player froze them, but is not counted as &#39;there&#39;. If a weapon is used on the image it will pass right through as if nothing is there. \r<br />&lt;br /&gt;-after a target that has been frozen dies the image stays standing, sitting, whatever they were doing when they were frozen. \r<br />&lt;br /&gt;These seem to be the only glitches I have found so far. Please leave comments so that I can attempt to improve it within my abilities. I hope you enjoy the mod&#33;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Links: \r<br />&lt;br /&gt;Ice Form Improved:  http://www.nexusmods.com/skyrim/mods/10484/?\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;",
  "categoryId": "93",
  "version": "1.0",
  "author": "Aviator191",
  "createdUnix": "1402527759",
  "updatedUnix": "1402527759",
  "containsAdultContent": false,
  "uploadedBy": "Aviator191",
  "primaryFile": null,
  "files": []
}