{
  "modId": 54811.0,
  "modName": "Starfall",
  "summary": "The Dragonborn is called on to journey to a new land to help safeguard all of Mundus from a sinister plot to undo Lorkhan&#39;s work and destroy the walls which separate the planes. Can you muster the courage to finish what the Hero of Kvatch started and close shut the jaws of Oblivion? Can you go as far as it takes, and retrace the footsteps of th",
  "descriptionHtml": "[size=32][b] WORK IN PROGRESS [/size][/b]\r<br />\r<br />[b][i] “In the Age of Dragons, after the Red Tower burns, The line of the Kings of Shor shall fall. The Jaws of Oblivion shall be wrenched open, and all of Mundus shall be threatened. In this time, one of Dragon&#39;s birth shall come, bearing the Tools of Divinity, and a Fallen Star, to restore the First Stone to its Tower, and restore balance to the Aurbis.” [/b][/i]\r<br />\r<br />\r<br />This prophecy has rested in an Elder Scroll, which according to lore was presented to the king of the Vanngarde during the founding of the kingdom in the First Era. It foretells the end of their line, the end of all life as it is known, and a savior who will come to restore balance to the world. Since the kingdom&#39;s founding on the island of Vanngarde off the northern coasts of Skyrim, the line of kings has never been broken, guarded by an elite force of protectors known as the Ruvaaksizaan. Now the last king of the Vanngarde has died in his old age, and his son is to take the throne. \r<br />The Dovahkiin is enlisted to collaborate with the Ruvaaksizaan and ensure his safe return from skyrim to Vanngarde. What follows is an adventure that will have you uncovering secret plots, delving into ancient knowledge, becoming the Arch-Mage of the College of Winterhold (if you are not already&#33;), visiting the Isle of Artaeum and the Psijic Order, delving into the core of the Red Mountain, and walking in the footsteps of the Nerevarine to restore balance to all of Aurbis.",
  "categoryId": "30",
  "version": "0.0.0",
  "author": "Aerizanthar",
  "createdUnix": "1402550195",
  "updatedUnix": "1402550195",
  "containsAdultContent": false,
  "uploadedBy": "Aerizanthar",
  "primaryFile": null,
  "files": []
}