{
  "modId": 54810.0,
  "modName": "AxonBitshift&#39;s Modding Guide",
  "summary": "This is a detailed guide designed to very heavily mod Skyrim. It has been written so anyone with reasonable computer literacy can follow it, and no prior modding experienced is needed.",
  "descriptionHtml": "AxonBitshift&#39;s Skyrim Modding Guide\r<br />v1.0 - Up-to-date as of April 2014\r<br />\r<br />\r<br />Welcome&#33; I&#39;ve written this guide because I couldn&#39;t find anything like it.\r<br />\r<br />\r<br />So what does this guide do differently?\r<br />       - No prior modding experienced needed. Everything is explained from the ground up in as much detail as possible and to the best of my knowledge/ability. Of course, those with modding experience might pick up a few tips and tricks too&#33;\r<br />       - It&#39;s designed to be a step-by-step walkthough that anyone with decent computer literacy can easily follow.\r<br />       - It&#39;s self-contained and can take you from a freshly installed Skyrim to a heavily modded and tested working game without the need for extensive research.\r<br />       - Nothing has been left out unless it had to be. We will install hundreds of mods that significantly change and improve almost every aspect of the vanilla game.\r<br />       - It has been written with as much flexibility as possible. You can pick and choose your mods based on your preferences and hardware.\r<br />       - Mod Organizer, not the Nexus Mod Manger, is explained and used in this guide as it is massively more flexible.\r<br />\r<br />\r<br />What this guide is not:\r<br />       - Simple. Nothing has been left out just because it&#39;s complicated.\r<br />       - Quick.  This guide will likely take 8+ hours to follow in its entirety (even if half that time is spent waiting for mods to download&#33;).\r<br />       - Small. I&#39;m a wordy writer and there&#39;s hundreds of mods in this guide\r<br />\r<br />\r<br />Download this guide in the files tab and please endorse if you&#39;re happy with the result&#33;\r<br />\r<br />\r<br />Note regarding the images: All screenshots have been taking using only the mods in this guide with the exception of Skyrim Bigger Trees (http://www.nexusmods.com/skyrim/mods/17168/) which is also used in several screenshots. If you&#39;d like to install it feel free but it does have some visual conflicts with Skyrim Flora Overhaul. I do not use any depth of field effects in my screenshots as it can often artificially enhance the appearance of the image by hiding the lower-quality objects in the distance.\r<br />\r<br />\r<br />I hope this guide helps you achieve a stable and amazing Skyrim experience&#33;\r<br />-AxonBitshift",
  "categoryId": "79",
  "version": "1.0",
  "author": "AxonBitshift",
  "createdUnix": "1402552407",
  "updatedUnix": "1402552402",
  "containsAdultContent": false,
  "uploadedBy": "axonbitshift",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112716",
      "name": "AxonBitshift&#39;s Modding Guide v1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1472",
      "fileName": "AxonBitshift's Modding Guide v1.0-54810-1-0.zip",
      "uploadedUnix": "1402552402",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9e3bef7711f86a8668c394f7409f436bb90ab35cfe938efb3804e762346ab832/analysis/1408122907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AxonBitshift%27s%20Modding%20Guide%20v1.0-54810-1-0.zip?fid=1000112716&ttl=1535839290&ri=8192&rs=8192&setec=2994c36f3d37122a463778836bc42aec"
    }
  ]
}