{
  "modId": 54823.0,
  "modName": "Animations for Statics_Clutter in Blender and 3ds Tutorial",
  "summary": "This tutorial shows you how to get animations into nif&#39;s using blender and 3ds",
  "descriptionHtml": "Look into the Videos Tab for the Embedded Youtube Videos\r<br />\r<br />Look at the Required Tab just below the Endorsments at the top of this page for hot links to the required mods by Anton.\r<br />\r<br />*******\r<br />\r<br />There are plenty of tutorials on getting custom animations on Characters through creating custom idles, when I tried to find a tutorial or tool to get basic animations on statics, such as opening a chest for the many new custom model resources on here and TES Alliance, I came up short.  \r<br />\r<br />Anton0028; aka Anton has created a number of tools to do just this, so first and foremost Big thanks to Anton for his great tools and all the help he has given me and the community.\r<br />\r<br />For this tutorial you will need his Mesh Injector:\r<br />\r<br />http://www.nexusmods.com/skyrim/mods/34226\r<br />\r<br />Mesh Injector takes an .obj that you can create in any 3d program, preferably Blender, and to inject that mesh into a nif, without needing to use the Niftools exporter.  While Niftools exporter are still the preferable method for simple things, Mesh injector is a must have for getting custom animations into the nifs.\r<br />\r<br />You will also need Anton&#39;s Body Animator:\r<br />\r<br />http://www.nexusmods.com/skyrim/mods/51351/?\r<br />\r<br />It transfers the bone, skin and key data from Blender and 3ds and allows you to inject it into a nif.\r<br />\r<br />\r<br />Disclaimer:\r<br />\r<br />This tutorial only covers getting the animations into nifskope; i&#39;ll eventually make tutorials for getting the animations in game, but it should be a simple process that you can figure out.\r<br />\r<br />Also should be noted that if you&#39;re using 3ds max, the body animator script may function strangely which i address in the video.  The Blender version is by far superior.  So there&#39;s no reason not to use blender to animate, its free and simple to use.\r<br />\r<br />3ds Max\r<br />\r<br />https://www.youtube.com/watch?v=C4aLLDwg2rc\r<br />\r<br />Blender (preferred version)\r<br />\r<br />https://www.youtube.com/watch?v=Oxd5VHoYoNY",
  "categoryId": "82",
  "version": "12",
  "author": "Marthgun",
  "createdUnix": "1402596851",
  "updatedUnix": "1402623219",
  "containsAdultContent": false,
  "uploadedBy": "marthgun",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112814",
      "name": "Simple Text File For Endorsing",
      "version": "abc",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Simple Text File For Endorsing-54823-abc.7z",
      "uploadedUnix": "1402623219",
      "modVersion": "abc",
      "virusScanUrl": "https://www.virustotal.com/file/76f1e7281540333993365a9bc30106cfb34883014bf33908112a2e2cc7c3d019/analysis/1408124105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Text%20File%20For%20Endorsing-54823-abc.7z?fid=1000112814&ttl=1535839311&ri=8192&rs=8192&setec=92efb945f9bc1c1160debe81feeb3cf0"
    }
  ]
}