{
  "modId": 54834.0,
  "modName": "No More College Robes Comments",
  "summary": "NPCs will stop commenting on your college robes. It really is none of their business anyway.",
  "descriptionHtml": "Anyone who&#39;s tried to play a magic-based character in this game knows that the robes sold by the College of Winterhold are pretty much the end-all-be-all of wizard apparel in Skyrim. Unlike nearly every other piece of armor, the player cannot even get close to replicating the strength of their enchantments except possibly through the use of game-breaking glitches. As a result, if you play a mage, you&#39;re going to be mostly wearing college robes.\r<br />\r<br />However, this comes at a significant downside: the barrage of idiotic comments hundreds of NPC in this game likes to make whenever you wear them&#33; Normally I wouldn&#39;t mind--I tolerate guards waxing lyrical about stolen sweetrolls, arrows to the knee, and the dangers of lollygagging--but the endless bombardment of &#34;fancy robes,&#34; &#34;those are College of Winterhold robes&#33;,&#34; &#34;are you a member of the college?,&#34; and the especially maddening &#34;are you a sorcerer? From the college?&#34; proved too much for my soul to bear. So I decided to do something about it.\r<br />\r<br />This mod has a very simple function: with it, no NPCs in the game will comment on you wearing college robes. It does so by changing the WICommentChanceCollegeRobes variable to zero. Therefore I would expect any mods you have that change or rely on that variable to be incompatible. I cannot fathom what sort of mod would do so, but you&#39;ve been warned.\r<br />\r<br />I&#39;ve found it works fine with Guard Dialogue Overhaul, but that does not preclude some massive conflict I have yet to discover. Use at your own risk; I know I will.\r<br />\r<br />Should be compatible with any combination of DLCs.",
  "categoryId": "33",
  "version": "1.0",
  "author": "StupidLemonEater",
  "createdUnix": "1402629710",
  "updatedUnix": "1402629703",
  "containsAdultContent": false,
  "uploadedBy": "StupidLemonEater",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112820",
      "name": "NoMoreRobeComments_v1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "NoMoreRobeComments_v1.0-54834-1-0.zip",
      "uploadedUnix": "1402629703",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1841cfc4d6873f618c3a1d33e771845e75dcf334c8ba4522425c2300f4444595/analysis/1408124172/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NoMoreRobeComments_v1.0-54834-1-0.zip?fid=1000112820&ttl=1535839329&ri=8192&rs=8192&setec=4d9051722d7e7907412c198bf807f902"
    }
  ]
}