{
  "modId": 54833.0,
  "modName": "Iona Huntress",
  "summary": "Changes Iona to wear a more huntress-like outfit and makes her better at archery and light armor.",
  "descriptionHtml": "My second Housecarl mod, this changes Iona, the Housecarl from Riften, to become more like a huntress, which I personally believe suits Riften and its hold more than a heavily armored warrior.\r<br />\r<br />Details: Changes Iona&#39;s outfit to fur armor and hide boots and gauntlets, changes her class to Combatscout and changes her weapon loadout to an Imperial Bow and Steel Dagger. Also, a small tweak to her eyes to make them a little bigger.\r<br />\r<br />Requirements: None unless you want her to have the alternate bow positioning. If you do want that, look here: http://www.nexusmods.com/skyrim/mods/50096/?\r<br />\r<br />Bugs: The Grey Face Bug is likely to occur when activating this mod after first encountering the Housecarl. So either use this on a save file in which you haven&#39;t encountered the affected NPC, or hope a more experienced modder comes up with a solution.\r<br />\r<br />Installation: simply drag and drop the files into the Data folder and activate the .esp.\r<br />\r<br />Load Order: as low as possible, especially if you have any other mods running that alter Iona&#39;s appearance.\r<br />\r<br />P.S., feel free to take screenshots of Iona whilst running this mod and send them to me, I might add the pictures to the file. Also, if you want any other followers altered, send me a message, I enjoy doing this.\r<br />\r<br />Permissions: If you want to have the file changed, just send me a message and what you want changed, and I&#39;ll probably give permission or do it myself. ",
  "categoryId": "96",
  "version": "1.0",
  "author": "pepertje",
  "createdUnix": "1402622884",
  "updatedUnix": "1402622879",
  "containsAdultContent": false,
  "uploadedBy": "pepertje",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112813",
      "name": "Iona Huntress",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Iona Huntress-54833-1-0.rar",
      "uploadedUnix": "1402622879",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/122ab47ba383c5bd7b0407967aff030874be125c3387665d79e5f4f758bdb2b2/analysis/1408124105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Iona%20Huntress-54833-1-0.rar?fid=1000112813&ttl=1535839327&ri=8192&rs=8192&setec=ca6f719eb4afd48d6d772fb3765e037a"
    }
  ]
}