{
  "modId": 54831.0,
  "modName": "FeatherBrook Castle",
  "summary": "A large dungeon mod consisting of cave&#39;s, exterior world and csatle interiors. A continuation of my previous mod - Henriks Tomb",
  "descriptionHtml": "This is the final part of my Larry&#39;s Legacy dungeon series.\r<br />\r<br />You must find your way to Deepcut cavern which is close to Glenmoril Coven (South-west), battle your way through the cavern to get to featherbrook castle and take out the ruthless bandit boss&#33;&#33;\r<br />You&#39;ll even pick a new follower along the way if you keep your eye&#39;s open.\r<br />\r<br />Word of advice..bring plenty of health potion&#39;s coz this can get real tricky real fast, I had alot of fun testing this mod..as it&#39;s been a while since I got killed by bandit&#39;s :) note: I tested this mod using a level 45 character with many other mods installed including PISE which definitely helps to make things more interesting. \r<br />\r<br />This still needs to be cluttered in many places and is by no means finished but the dungeon areas are up and running just don&#39;t expect to find much help along the way in terms of potions.\r<br />\r<br />Its taken along time to get to this stage because of real world work and all that boring stuff so I thought i&#39;d upload it for you as is..just to get a feel of what you guy&#39;s think and want me to add/change.\r<br />\r<br />The Areas are fully navmeshed however I have had issues with followers not following into some areas only to reappear in other&#39;s, and then in other test playthrough&#39;s there&#39;s been no issue so it&#39;s a bit of a mixed bag at the moment. I would suggest making this a Solo mission (which is the way I play anyway, it feels much more challenging and fun I think).\r<br />\r<br />This is a simple ESP file so just drop into your data folder and make sure its active before you boot up, I&#39;ve used only vanilla items so there&#39;s no specific requirements, and of course backup your save before trying this out as you should with all mods.\r<br />\r<br />All Comments and suggestions are welcome, hope you enjoy.",
  "categoryId": "88",
  "version": "",
  "author": "Greensmirf",
  "createdUnix": "1402618599",
  "updatedUnix": "1402618457",
  "containsAdultContent": false,
  "uploadedBy": "Greensmirf",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112810",
      "name": "FeatherBrook",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "361",
      "fileName": "FeatherBrook-54831-.zip",
      "uploadedUnix": "1402618457",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2f7cfda45997569ac4471b3787cf72291a9df8f23583600fcc61af3e4f93f141/analysis/1408123989/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FeatherBrook-54831-.zip?fid=1000112810&ttl=1535839325&ri=8192&rs=8192&setec=8999af893fb9ef8eacf423fd6f9d809c"
    }
  ]
}