{
  "modId": 54842.0,
  "modName": "Jordis Spellsword",
  "summary": "Changes Jordis, the Solitude Housecarl, to a Spellsword and changes her equipment. Also, by request, I&#39;ve made it optional to change her race to a High Elf, which I consider to be Lore-Friendly nonetheless.",
  "descriptionHtml": "By request of AfroSama, here&#39;s another installment of the Housecarl Requip project I just started. Its aim is to add diversity to the Housecarls the Dragonborn gets appointed. This one changes the Solitude Housecarl, Jordis the Sword-Maiden, to a Spellsword class character and potentially a High Elf. Yes, this is Lore-Friendly, Irileth is a Dark Elf and she&#39;s Housecarl to a Jarl, so why wouldn&#39;t a High Elf become Housecarl? Anyways, hope you enjoy, if not tell me why or gtfo.\r<br />\r<br />Details: Changes Jordis the Sword-Maiden into an Altmeri Spellsword, changes her equipment into an Imperial Heavy Armor set without helmet and gives her an Elven Sword and changes her name into Virani. The optional file leaves her race and appearance intact, but still changes her loadout and skills.\r<br />\r<br />Requirements: None\r<br />\r<br />Bugs: The Grey Face Bug is likely to occur when activating this mod after first encountering the Housecarl. So either use this on a save file in which you haven&#39;t encountered the affected NPC, or hope a more experienced modder comes up with a solution.\r<br />\r<br />Installation: simply drag and drop the files into the Data folder and activate the .esp.\r<br />\r<br />Load Order: as low as possible, especially if you have any other mods running that alter Jordis&#39;s appearance.\r<br />\r<br />P.S., feel free to take screenshots of Jordis whilst running this mod and send them to me, I might add the pictures to the file. Also, if you want any other followers altered, send me a message, I enjoy doing this.\r<br />\r<br />Permissions: If you want to have the file changed, just send me a message and what you want changed, and I&#39;ll probably give permission or do it myself. ",
  "categoryId": "96",
  "version": "1.0",
  "author": "pepertje",
  "createdUnix": "1402662566",
  "updatedUnix": "1402696747",
  "containsAdultContent": false,
  "uploadedBy": "pepertje",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112846",
      "name": "Jordis Nord Spellsword",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Jordis Nord Spellsword-54842-1-0.rar",
      "uploadedUnix": "1402662562",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4d05102649b0e2f753b9e16cf30e53ba1af6a253b2f8b9788abe359b6ce5c621/analysis/1408124525/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jordis%20Nord%20Spellsword-54842-1-0.rar?fid=1000112846&ttl=1535839338&ri=8192&rs=8192&setec=e9099d26f76b820815dc9d4f24b9e742"
    },
    {
      "fileId": "1000112885",
      "name": "Jordis Spellsword Altmer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Jordis to Virani-54842-1-0.rar",
      "uploadedUnix": "1402696747",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1cd36637a47d9fa0b47a9c6414d6f83a04560fce825687fc47d9f402cd7c0fa6/analysis/1408125043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jordis%20to%20Virani-54842-1-0.rar?fid=1000112885&ttl=1535839338&ri=8192&rs=8192&setec=470a5433b5721828046a213ff7a703cf"
    }
  ]
}