{
  "modId": 54869.0,
  "modName": "Thalith&#39;s Righteous Weapons and Armor",
  "summary": "Thalith is a daedric prince, the prince of handiwork and smithing to be exact. He has oh-so graciously forged some of his delicate yet robust creations in Tamriel, while also personally selling them to the one and only Dovakhiin, the one he sees fit to wield his glorious equipment, but at a high cost in gold. He can be found just up the road from t",
  "descriptionHtml": "INFO: \r<br />Hey guys&#33; This is my first mod to ever be posted to the Nexus. NOTE that this mod JUST got published, and is in literal stage 1 of development. Thalith only sells his best weapons and armor (Tier 5) at the moment, so sorry if it takes you 60 hours of gameplay just to scrounge up enough gold for one of these items.. anywho, I&#39;d really like some feedback and suggestions. Thalith himself and his great hall are in their baby steps, which explains why both are so minorly detailed. In the next update, (By June 26 at the latest) you can expect Tier 4 weapons and an improved Great Hall. Thanks for taking the time to check out this mod&#33;&#33; :) (Thalith can be found just north of Riverwood, right beside the bridge across the river, in a sewer grate. It&#39;s also on the map.)",
  "categoryId": "69",
  "version": "1.0",
  "author": "BlackTacoSauce",
  "createdUnix": "1402738526",
  "updatedUnix": "1402738522",
  "containsAdultContent": false,
  "uploadedBy": "BlackTacoSauce",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000112935",
      "name": "ThalithTheTrader",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "ThalithTheTrader-54869-1-0.rar",
      "uploadedUnix": "1402738522",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e2d6a1aada8ed4d53413c4aef34c2eb36551301594bd33cec8e6b4742096c4a5/analysis/1408125551/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ThalithTheTrader-54869-1-0.rar?fid=1000112935&ttl=1535839375&ri=8192&rs=8192&setec=2b5327c2e94a2d3d918511d2c011a861"
    }
  ]
}