{
  "modId": 54899.0,
  "modName": "Grimoire - Spell package",
  "summary": "Adds 100+ balanced, lore-friendly spells that flesh out each magic school and provide more ways to role-play. Each spell takes full advantage of vanilla skills and perks to unlock powerful bonuses. ",
  "descriptionHtml": "[center][b][i][size=7]Grimoire[/size][/i][/b][/center]\r<br />[center] [/center]\r<br />[color=#d5a6bd][b][size=4]An updated and improved version of this mod has been released&#33; Go here to get it:[/size][/b][/color]\r<br />http://www.nexusmods.com/skyrim/mods/60796/?\r<br />\r<br />\r<br />[size=5][b]Introduction[/b][/size]\r<br />[b]Grimoire adds 100+ new spells to Skyrim that work together to flesh out each school of magic and give magic users more engaging ways to role-play. [/b]These aren&#39;t just random spells thrown in for giggles - they all work together within each magic school (and across school lines) to allow you to become a true Master of Alteration, Conjuration, Destruction, Illusion, and Restoration.\r<br /> \r<br />Grimoire takes full advantage of the vanilla Skyrim perks to bring out the potential of your magic. No perks were altered or added&#33; This mod also seeks to correct a lot of the glaring issues with the default balance of magic in Skyrim (see below).\r<br />\r<br />\r<br />[size=5][u][b]Contents:[/b][/u][/size]\r<br />[list][*]Important info[/*]\r<br />[*]Comparison to default[/*]\r<br />[*]Spell List[/*]\r<br />[*]Future Plans[/*]\r<br />[*]Known Bugs[/*]\r<br />[/list]\r<br />\r<br />\r<br />[size=6][b]Important Info[/b][/size]\r<br /> \r<br />[size=4][b]Requirements:[/b][/size]\r<br />-Skyrim (not a pirated copy)\r<br />-Dawnguard\r<br />-Dragonborn\r<br />\r<br />YOU MUST HAVE BOTH DAWNGUARD AND DRAGONBORN INSTALLED OR YOUR GAME WILL CRASH.\r<br />***This mod has already been cleaned with TES5edit. You do not need to clean it&#33;\r<br />\r<br />****NOTICE: If the main download on the &#39;files&#39; tab doesn&#39;t work, go to the &#39;mirrors&#39; tab to download&#33; ****\r<br />[b]Install (manual):[/b]\r<br />1) Download the zip file by clicking &#39;manual download&#39;\r<br />2) Drag-and-drop everything in the zip file into your Skyrim/Data folder.\r<br />\r<br />[b]Install (NMM):[/b]\r<br />1) Download the file with the green Nexus Mod Manager button.\r<br />2) Click the &#39;install&#39; button in Nexus Mod Manager. \r<br />\r<br />[b]Uninstall:[/b]\r<br />1) Dismiss all your summoned minions\r<br />2) Wait for a few minutes to let all spell effects wind down\r<br />3) Save a new game\r<br />4) Uninstall using NMM, or manually remove the files\r<br /> \r<br /> \r<br />[size=5][b]Where are the new spells?[/b][/size]\r<br />All spell tomes have been added to leveled lists for the appropriate merchants. That means low-level spells will be sold by court wizards, high level spells will be sold by the mages at Winterhold, and you can find all spells (except master-level spells) as loot.\r<br />\r<br />\r<br />[size=4][b]Recommended Mods[/b][/size]\r<br />[b](Grimoire is completely compatible with all of the following mods.)[/b]\r<br />Better Magic &gt; seriously, GET THIS MOD. It&#39;s lean, mean, and makes it possible to play a mage in Skyrim.\r<br />Forgotten Magic Redone \r<br />Better Vampires\r<br />Moonlight tales\r<br />*And many more&#33; This mod is 99% stand-alone and should be compatible with everything. (Yes, even Skyre). \r<br /> \r<br />\r<br />\r<br />[size=6][b]Comparison with Vanilla Skyrim[/b][/size]\r<br /> \r<br />[u][b]Vanilla:[/b][/u] Novice spells are worthless once you have the apprentice version, and apprentice spells are worthless when you have the adept version. Etc, ad infinium.\r<br />[u][b]Grimoire: [/b][/u]Spells NEVER become worthless. Perks and scripted bonuses unlock new effects for ALL spells as you level in that school of magic. Spells will also enhance each other if cast in certain combinations.\r<br /> \r<br />[u][b]Vanilla:[/b][/u] Impossible to play as an assassin mage, unless you level Illusion like crazy to get the quiet casting perk.\r<br />[u][b]Grimoire:[/b][/u]An entirely new branch of Destruction magic that focuses on stealth-based gameplay. Certain spells in other schools also give sneak attack bonuses.\r<br /> \r<br />[u][b]Vanilla:[/b][/u] Alteration is only good for armor buffs, Restoration is only good for healing, Illusion is only good for Quiet Casting....you always need Destruction and Conjuration to get through the game as a pure mage.\r<br />[u][b]Grimoire:[/b][/u] Now possible to play as a pure Restoration, Alteration, or Illusion mage. Each school now has the ability to bring the pain in combat in its own unique way. These schools have also been massively fleshed out to provide a greater variety of spell types. Think Destruction and Conjuration get to have all the fun? Think again.... :]\r<br /> \r<br />\r<br /> \r<br />[center][size=6][b]Spells and Role-Play[/b][/size][/center]\r<br /> \r<br />[center][size=5][i]~Alteration~[/i][/size][/center]\r<br />[center]&#34;By our Will we reshape the world.&#34;[/center]\r<br /> \r<br />To my mind, Alteration focuses on change - on taking one thing and molding it into another. That has a lot more potential than the handful of shield spells available in vanilla Skyrim. With ESG, there are three main role-play options: the shape-shifter, the engineer, and the alchemist. The shape-shifter transforms herself to boost her own skills; the engineer is the master of creating bombs and breaking down Dwarven automatons; the alchemist transforms the world around her to win battles.\r<br /> \r<br />[b]Novice:[/b]\r<br />[list][*]Unlock &gt; For 10 seconds, the caster can automatically open locks. The higher the caster&#39;s Alteration skill, the stronger the locks that can be opened.[/*]\r<br />[*]Crystallize &gt; Improves the caster&#39;s magic resistance by 10-40 points for 60 seconds. *Power boosted by Magic Resistance perks.[/*]\r<br />[*]Rusting Curse &gt; Reduces the target&#39;s armor rating by 33% for 60 seconds. Also reduces weapon damage. *Slows down dwarven automatons.[/*]\r<br />[/list]\r<br />[b]Apprentice:[/b]\r<br />[list][*]Exchange Stamina &gt; Transform 10 stamina into magicka per second.[/*]\r<br />[*]Featherlight &gt; Become as light as a feather for 30 seconds, reducing fall damage to 0 and allowing you to walk on water. *Makes you fall more slowly[/*]\r<br />[*]Withering Curse &gt; Reduce the target&#39;s magicka regeneration by 50% for 30 seconds. The target loses additional magicka when casting spells. Does 3 damage per second to spriggans.[/*]\r<br />[*]Rewire &gt; Concentrate to gradually convert a dwarven automaton to your side. *Will eventually make any automaton an ally, if you can continue casting the spell for long enough. Time needed decreases with alteration skill.[/*]\r<br />[/list]\r<br />[b]Adept:[/b]\r<br />[list][*]Stone Golem &gt; Creates a stone golem for 60 seconds wherever the caster is pointing. The stone golem takes no damage from arrows, but is weak to ice.[/*]\r<br />[*]Mage&#39;s Gambit &gt; Transform 25% of your maximum health into magicka for 60 seconds.[/*]\r<br />[*]Forest Curse &gt; Target is slowed by 50% for 4 seconds, then turned into a tree for 30 seconds. When the curse fades, the target takes damage and staggers.[/*]\r<br />[*]Diamond Plating &gt; Transforms the caster&#39;s armor into solid diamond, increasing armor rating by 1.25x the caster&#39;s Alteration skill for 60 seconds. *Must be wearing at least 1 piece of armor to cast. With the Stability perk, armor rating is increased by 1.5x your Alteration skill.[/*]\r<br />[/list]\r<br />[b]Expert:[/b]\r<br />[list][*]Time Warp &gt; Stops time for 30 seconds, immobilizing everyone around the caster. Time-locked targets cannot be harmed.[/*]\r<br />[*]Construct Automaton &gt; Construct a dwarven automaton using filled soul gems and dwarven materials. Studying the secrets of the Dwemer unlocks stronger automatons. *Ancient Knowledge quest perk enables building centurions - your centurion will respond to wait/follow commands, and can be deconstructed for parts. Can only have 1 automaton at a time. Stability perk gives automatons extra health, and allows them to regenerate health in combat. Automatons have a chance to drop scrap and empty soul gems on death.[/*]\r<br />[*]Warmonger &gt; For up to 60 seconds, no stamina is consumed when power attacking. Drains 10 magicka per second from the caster to power this spell. *Lesser power, no casting cost. Magicka drain is halved with the Atronach perk.[/*]\r<br />[*]Wyvern Scales &gt; Turns the caster&#39;s skin into wyvern scales, reducing damage from bladed weapons by 25% for 60 seconds. 50% chance to absorb hostile spells. *If not wearing armor, protection against blades raised to 25-40% w/ Mage Armor perks; no armor + mage armor perks also grants 5-15% protection from crushing weapons.[/*]\r<br />[/list]\r<br />[b]Master:[/b]\r<br />[list][*]Medusa&#39;s Stare &gt; On cast, gain the power to turn one target with less than 50% health permanently to stone by pressing z. Power remains equipped for 10 seconds. *casting the spell equips a one-use power that you have 10 seconds to use.[/*]\r<br />[/list]\r<br /> \r<br /> \r<br />[center][size=5][i]~Conjuration~[/i][/size][/center]\r<br />[center]&#34;Power is all about who you know.&#34;[/center]\r<br />[center] [/center]\r<br />Much like vanilla Skyrim, conjuration in ESG is focused on making friends with things on the other side. There are four main branches of summoning in ESG: Undead, Daedra, Familiars, and Artifacts. Familiar summoning gives you the ability to role-play as a &#39;light-side&#39; summoner. The new Artifact summoning spells, when combined with the vanilla bound weapon spells, allow you to play as a master blade-binder.\r<br />\r<br /> \r<br />[b]Novice:[/b]\r<br />[list][*]Spectral Shield &gt; creates a spectral shield for 120 seconds that raises magic resistance by 60/70% while blocking. *Oblivion Binding allows you to absorb some magicka from the opponent whenever you block an attack. Mystic binding improves shield strength/magic resist bonus.[/*]\r<br />[*]Wolf Familiar &gt; Conjures a wolf familiar for 60 seconds. *High speed. Levels with the caster. NOTE: This is an edited version of the &#34;Conjure Familiar&#34; spell.[/*]\r<br />[/list]\r<br />[b]Apprentice:[/b]\r<br />[list][*]Bone Servant &gt; Create a skeleton warrior, archer, or mage for 60 seconds wherever the caster is pointing. *Levels w/ the caster; gear/spells improve w/ caster level.[/*]\r<br />[*]Spider Familiar &gt; conjures a spider familiar for 60 seconds. *Frail, but poisons enemies. High stealth skill. Levels with the caster.[/*]\r<br />[/list]\r<br />[b]Adept:[/b]\r<br />[list][*]Spectral Staff &gt; Conjures a powerful staff from Oblivion for 120 seconds. *Enchanted with Dark Nova, which shoots orbs that explode for 40/50 points of arcane damage. Each explosion has a chance to spawn whispering spirits that attack the target. Bound weapon perks boost damage and allow it to cast soul trap and banish raised/summoned minions.[/*]\r<br />[*]Command Undead &gt; The undead target is put under your control. *Affects undead up to level 10-45; power grows with conjuration perks.[/*]\r<br />[*]Chose Affinity &gt; (Toggle) Boosts the power and duration of either Undead, Daedra, Familiar, or Artifact summons.   [/*]\r<br />[*]Sabrecat familiar &gt; Conjures a sabrecat familiar for 60 seconds. *High attack. Levels with the caster.[/*]\r<br />[/list]\r<br />[b]Expert:[/b]\r<br />[list][*]Call Gargoyle &gt; the caster performs a dark ritual, sacrificing 50 health to summon a powerful gargoyle for 60 seconds.[/*]\r<br />[*]Devouring Wraith &gt; For 60 seconds, summons a devouring wraith that will leech magicka from enemies and use their own power against them. *Absorbs all magicka, but is weak to physical damage.[/*]\r<br />[*]Oblivion Gate &gt; Open a portal through Oblivion and teleport yourself a short distance away.[/*]\r<br />[*]Bear Familiar &gt; Conjures a bear familiar for 60 seconds. *High defense. Levels with the caster.[/*]\r<br />[*]Conjure Lurker &gt; Summons a Lurker for 60 seconds wherever the caster is pointing. *Spell book only available in Apocrapha and on Soletheim.[/*]\r<br />[/list]\r<br />[b]Master:[/b]\r<br />[list][*]Bone Overlord &gt; Create a powerful skeleton overlord using a human skull, a filled black soul gem, and a human heart. *Can be given 1-handed/2-handed weapons, bows, or staves, and will use them in combat. Can also equip circlets and hoods. Responds to follow/wait/dismiss commands.[/*]\r<br />[*]Raise Skeletal Dragon &gt; Conjures an ancient scroll, which summons a Skeletal Dragon that guards that location until destroyed. Consumes 5 dragon bones and a dragon soul. *Only 1 skeletal dragon can be active at a time. Warning: Cast far away from you unless you like being crushed.[/*]\r<br />[*]Lady of the Veil &gt; Summons the Lady of the Veil for 15 seconds. While active, the Lady allows you to conjure any number of lesser daedra, familiars, or undead.[/*]\r<br />[*]Faithful Familiar &gt; Conjure your faithful familiar permanently. *Your faithful familiar will level with you. Familiar type is based on which lesser familiar you use the most: wolf, spider, sabrecat, or bear. Provides passive boosts to the caster based on type. Wolf: Movement speed, weapon speed, wolves are allies, heal in werewolf form. Spider: Poison resistance, chance to evade attacks, chance to add poison damage to physical attacks. Sabrecat: increased weapon speed, increased critical hit damage. Bear: Increased stamina, resistance to stagger[/*]\r<br />[*]Spectral Crown &gt; Conjure a ghostly daedric crown for 120 seconds. *All nearby undead, daedra, and familiars will fall under your command, unless they are a higher level than you. Gives you the power Cast Out, which allows you to send one living target with a lower level than yours to Oblivion.[/*]\r<br />[/list]\r<br /> \r<br /> \r<br />[center][size=5][i]~Destruction~[/i][/size][/center]\r<br />[center]&#34;Destruction magic is the art of harnessing the raw power of Aetherius through Fire, Ice, and Lightning.&#34;[/center]\r<br />[center] [/center]\r<br />Destruction mages are the Elementalists of Skyrim - they control the most primal elements of magic, and channel them into spells of unfathomable power. In vanilla Skyrim, that&#39;s both a good and bad thing: good, because you kick ass (at least early on), and bad because, well....all you do is dual-cast firebolt all the way through the game. No ability for stealth, nothing more than raw damage output. Destruction in vanilla is a game of numbers: does x spell do more damage than y spell? If so, use x. ESG introduces both the ability to be a destruction-based assassin and provides spells that allow you to take a strategic approach to Destruction magic.\r<br /> \r<br />[b]New secondary effects:[/b]\r<br />Lingering Cold &gt; Applies a small amount of frost damage over time and slows the target.\r<br />Searing Pain &gt; Passive: -25% fire resistance. Chance to stagger when hit by a fire spell.\r<br />Static Charge &gt; Passive: -25% shock resistance. If the target is hit by a shock spell, 10% chance to electrocute the target, then dispels Static Charge.\r<br /> \r<br />[b]Novice:[/b]\r<br />[list][*]Ice Shard &gt; Creates a shiv made from solid ice for 120 seconds. Deals 9x damage if the caster is undetected. Base power grows with destruction skill. *No weapon value; damage determined by destruction skill and frost perks.[/*]\r<br />[*]Light the Tallow &gt; Silently lights the target on fire, using their flesh like the wick of a candle. Does 3 fire damage per second for 30 seconds.[/*]\r<br />[*]Zap &gt; Silently shock the target for 16 damage to health and magicka. 3x damage if the caster is undetected.[/*]\r<br />[/list]\r<br />[b]Apprentice:[/b]\r<br />[list][*]Icy Veil &gt; Boosts the caster&#39;s frost resistance by 30-50% for 60 seconds. Frost spells restore some magicka.  Applies Lingering Cold to those who touch the caster. *Frost resist boost and magicka absorb increase w/ augmented frost perks.[/*]\r<br />[*]Molten Core &gt; Boosts the caster&#39;s fire resistance by 30-50% for 60 seconds. Fire spells restore some magicka. Applies Searing Pain to those who touch the caster. *Fire resist boost and magicka absorb increase w/ augmented flames perks.[/*]\r<br />[*]Electrify &gt; Boosts the caster&#39;s shock resistance by 30-50% for 60 seconds. Shock spells restore some magicka. Applies Static Charge to those who touch the caster.  *Shock resist boost and magicka absorb increase w/ augmented shock perks.[/*]\r<br />[/list]\r<br />[b]Adept:[/b]\r<br />[list][*]Deep Freeze &gt; Silently freeze the target for 40 frost damage. If the caster is undetected, the target is frozen solid for 15 seconds.[/*]\r<br />[*]Fire Bomb &gt; Silently turn a touched opponent into a bomb, which will explode for 150-250 fire damage in a 20ft radius after 10 seconds. Will not work if the caster has been detected. *Damage determined by destruction skill and augmented flames perks.[/*]\r<br />[*]Electrocute &gt; Silently electrocute a touched target, doing 150 shock damage and staggering the target. Will not work if the caster has been detected.[/*]\r<br />[*]Flame Infusion &gt; Infuses the target with the power of fire. Does 4 damage for second for 10 seconds to opponents and applies Searing Pain. Provides powerful boosts to summoned allies.[/*]\r<br />[*]Frost Infusion &gt; Infuses the target with the power of ice. Does 4 damage per second for 10 seconds to opponents and slows them by 50%. Provides powerful boosts to summoned allies.[/*]\r<br />[*]Lightning Infusion &gt; Infuses the target with the power of lightning. Does 4 damage for second for 10 seconds to opponents and applies Static Charge. Provides powerful boosts to summoned allies.[/*]\r<br />[/list]\r<br />[b]Expert:[/b]\r<br />[list][*]Hellfire &gt; A gout of otherworldly flame that does 20 damage per second and negates fire resistance. Anything it touches is set on fire for 5 seconds.[/*]\r<br />[*]Supercharge &gt; Concentrate to charge up an electrical blast; release to trigger the explosion, doing up to 350 damage to opponents near the caster. Power grows with charging time.[/*]\r<br />[*]Winter&#39;s Fury &gt; Summon 3 ice spirits for 120 seconds to aid you in battle. *Summons 4 ice spirits w/ the Deep Freeze perk.[/*]\r<br />[*]Heat Lightning &gt; A bolt of white-hot electricity that does 50 points of shock damage. Targets wearing metal are burned. Chance to disarm.[/*]\r<br />[/list]\r<br />[b]Master:[/b]\r<br />[list][*]Flameheart &gt; Summon the living spirit of fire for 120 seconds to aid you in battle. On death, explodes for massive damage. *Boosted by Intense Flames perk.[/*]\r<br />[*]Absolute Zero &gt; For 60 seconds, all nearby opponents are slowed by 50% and are 50% weaker to frost. Opponents in melee range also have a chance to be frozen solid for 30 seconds. Frozen targets will shatter if struck. Applies Lingering Cold.[/*]\r<br />[*]Storm Call &gt; Call down lightning around the caster. Does 150 shock damage to all targets in the area. Targets close to the caster take 70 extra damage and are flung away.[/*]\r<br />[/list]\r<br />[center] [/center]\r<br />[center] [/center]\r<br />[center][size=5][i]~Illusion~[/i][/size][/center]\r<br />[center]&#34;Conquer the mind, and you have conquered the world.&#34;[/center]\r<br />[center] [/center]\r<br />I think we can all admit that the vanilla Illusion school needed some serious help. It was either overpowered or useless depending on when you leveled the Illusion skill, and there were really only 4 spells: fury, calm, fear, and invisibility. With ESG, you have the ability play as a magician, a shadow mage, or a psychic. Magicians focus on creating illusions in the world around them to fool enemies; psychics manipulate the enemy&#39;s mind directly; and shadow mage&#39;s excel at using light and dark to their advantage.\r<br /> \r<br />[b]Novice:[/b]\r<br />[list][*]Disorient &gt; Mentally stun the target, causing them to stagger. The targer cannot be disoriented again for 10 seconds.[/*]\r<br />[*]Phantom Pain &gt; For 30 seconds, the target loses health when attacking the caster. *Damage inflicted grows w/ Illusion skill.[/*]\r<br />[/list]\r<br />[b]Apprentice:[/b]\r<br />[list][*]Chameleon &gt; For 120 seconds, the caster is mostly invisible when moving slowly.[/*]\r<br />[*]Empathic Link &gt; The target receives 1.5x the healing or damage done to the caster for 30 seconds.[/*]\r<br />[*]Paradox &gt; Causes a paradox in the target machine, doing random damage between 10 and 70 points. Chance to stagger the target.[/*]\r<br />[*]Quiet &gt; Silently muffle the air around you, reducing the noise from casting by 50% for 60 seconds.[/*]\r<br />[/list]\r<br />[b]Adept:[/b]\r<br />[list][*]Bend Will &gt; The target becomes an ally of the player for 120 seconds. Will not work if the target is too powerful. *Level of targets that can be affected grows w/ Illusion skill and perks.[/*]\r<br />[*]Manifest Fears &gt; Creates illusory copies of the target&#39;s deepest fears for 30 seconds. Targets up to level 14 will flee; all others will be consumed with fighting the illusion.[/*]\r<br />[*]Decoy &gt; Creates a decoy of the caster to distract enemies for 10 seconds; the caster goes invisible.[/*]\r<br />[*]Challenge &gt; Challenge an opponent to a duel, forcing them to attack you for 60 seconds.[/*]\r<br />[/list]\r<br />[b]Expert:[/b]\r<br />[list][*]Shatter &gt; Crush the target&#39;s mind, permanently decreasing all skills. If the target is affected by a mind-altering spell, the effect is increased. Chance to cause madness.[/*]\r<br />[*]Waking Nightmare &gt; Bombard the target with visions of horror, doing 40 points of damage. Targets up to level 20 flee from combat. Target is slowed by 50%.[/*]\r<br />[*]Mark of Doom &gt; Cast on a surface to mark nearby targets with a symbol of doom, which causes them to lose 25% of their remaining health every 5 seconds. The effect is broken if the target heals or leaves combat. *This effect will not kill the target(s).[/*]\r<br />[*]Lucky Rabbit &gt; Silently conjure an illusory rabbit for 30 seconds to distract opponents and lead them away from you. *Ineffective in combat.[/*]\r<br />[/list]\r<br />[b]Master:[/b]\r<br />[list][*]One with the Shadows &gt; For 3 minutes, the caster is invisible while in shadow. Invisibility is not broken by combat or interacting with the world. *Works on gloomy, overcast days as well.[/*]\r<br />[*]Psychic Bond &gt; Form a permanent psychic bond with a close ally. The bond will break if your partner dies or leaves your company. *Your skills are boosted based on your partner&#39;s top skills, and vice versa. While close together, you and your partner both have increased magicka, stamina, and health regeneration. Your attacks and spells do no damage to your partner. You will be able to sense if your partner is in danger. If you partner dies while bonded, the effect on you can be rather....dramatic. Master of the Mind allows you to bond with your animal follower, or with your Bone Overlord or constructed centurion.[/*]\r<br />[/list]\r<br />\r<br />[center][i][size=5][b]~Restoration~[/b][/size][/i]\r<br />&#39;The light of the sun and the heartbeat of Nirn guide our path.&#39; [/center]\r<br />\r<br />Restoration in ESG focuses on three main archetypes: the priest, the healer, and the shaman. The Priest uses holy magic and the power of the sun to combat unholy forces; the Healer is the master of manipulating life-force, including blood magic; the shaman calls upon the ancient magics of poison and disease to wither away his foes.\r<br /> \r<br />\r<br />[b]Novice:[/b]\r<br />[list][*]Ray of Light &gt; The living are healed 6 points per second. Undead targets take 9 points of damage per second.[/*]\r<br />[*]Share Lifeblood &gt; Drains 7 health per second from the caster, healing the target 16 points per second in exchange. *No magicka cost. Also gives target stamina with the Respite perk.[/*]\r<br />[*]Poison Seed &gt; Target is 20% weaker to poison for 10 seconds. Damages the target for 3 points of poison damage per second for 10 seconds.[/*]\r<br />[/list]\r<br />[b]Apprentice:[/b]\r<br />[list][*]Scorpion Sting &gt; Silently inflict 22 points of poison damage. 3x damage if the caster is undetected. Targets weak to poison take 30 extra points and have a chance to become paralyzed.[/*]\r<br />[*]Black Swarm &gt; Target is attacked by a swarm of flies, which do 4 disease damage for 20 seconds and can cause the target to stagger.[/*]\r<br />[*]Divine Aegis &gt; For 15 seconds, negates the next 3 physical attacks against the caster.[/*]\r<br />[/list]\r<br />[b]Adept:[/b]\r<br />[list][*]Arcane Healing &gt; Heals the summoned or machine target 15 points per second, but not the living or undead.[/*]\r<br />[*]Plague Bringer &gt; For 30 seconds, every target struck with your weapon is infected with up to 6 diseases. Disease vectors are consumed from your inventory to power this spell.[/*]\r<br />[*]Plague of Locusts &gt; Targets that fail to resist are infected with a plague. On death, the target spawns a horde of locusts, which attack and infect other hostiles with the plague.[/*]\r<br />[*]Soul Fire &gt; Cloaks the caster in holy flames for 60 seconds, doing 7 points of damage per second to undead in melee range. Restores 4 health and stamina per second to nearby allies.[/*]\r<br />[/list]\r<br />[b]Expert:[/b]\r<br />[list][*]Divine Guardian &gt; The friendly target is protected by a divine guardian for 60 seconds during combat. *Does not work on undead.[/*]\r<br />[*]Blood Sacrifice &gt; Fully heals the target and applies healing over time for 15 seconds. Caster health is reduced by 50%. Does not work on undead or machines. *No magicka cost.[/*]\r<br />[*]Infestation &gt; Targets that fail to resist are infected with a virulent plague. On death, the target spawns poisonous spiders, which attack and infect other hostiles with the plague.[/*]\r<br />[*]Poison Cloak &gt; Opponents in melee range take 5 points of poison damage per second for 60 seconds.[/*]\r<br />[/list]\r<br />[b]Master:[/b]\r<br />[list][*]Resurrection &gt; Brings the target back to life. Does not work on undead or machines.[/*]\r<br />[*]Phoenix Song &gt; Drains all magicka and stamina, and fully heals the caster. Nearby allies are healed 250 points. *DOES work on undead and machines.[/*]\r<br />[*]Rite of the Old Gods &gt; Lowers the poison and disease resistance of nearby enemies by 50%. Chance to infect enemies with a random disease - even if normally immune. Lasts 120 seconds.[/*]\r<br />[*]Dread Cocoon &gt; Cast on a corpse to implant it with a fearful creature, which will hatch from its cocoon in 15 seconds. Those attacked by the creature also have a chance to be infected.[/*]\r<br />[/list]\r<br /> \r<br />\r<br />[center][size=5][b][i]Scroll-Only Spells[/i][/b][/size][/center]\r<br />[b]Conjuration:[/b]\r<br />[list][*]Dark Crystal &gt; Store part of your soul in a Dark Crystal. On death, if the Dark Crystal is in your inventory, you will be revived with half health. Crystal shatters after resurrection. *Can be created at the Atronach forge if you have the sigil stone. Crafted with: Roll of paper, charcoal, black soul gem.\r<br />[/*][/list]\r<br />[b]Restoration:[/b]\r<br />[list][*]Daedric Blessing &gt; Cast at the shrine of a Daedric Lord to receive a blessing. *Can be created at the Atronach forge. See the readme for details on all the possible effects (if you wish to be surprised, don&#39;t look&#33;) Crafted with: Roll of paper, charcoal, nightshade, gold ring, and daedra heart.\r<br />[/*][/list]\r<br />\r<br />\r<br />[size=5][b]Future Plans:[/b][/size]\r<br />-Add a few new spells that were put on hold originally\r<br />-Add purchasable Lexicons for each school that describe the spells in a detailed, lore-friendly way.\r<br />-Add scrolls and staves for some of the new spells, and add them to loot/vendor lists\r<br />-Atronach forge recipes for a few of the darker spells\r<br />-Bug fixing, bug fixing, bug fixing\r<br /> \r<br /> \r<br />[size=5][b]Known Bugs:[/b][/size]\r<br />\r<br />[u][b]Critical[/b][/u] - (CTD&#39;s everywhere, Skyrim won&#39;t start, my computer went up in flames)\r<br />None\r<br />\r<br />[u][b]Major [/b][/u]- (Things that are flat-out broken and/or break other things in Skyrim)\r<br />None\r<br />\r<br />[u][b]Minor[/b][/u] - (Things not working quite the way they should, odd behavior)\r<br />-&#39;Choose Affinity - Artifact&#39; doesn&#39;t boost bound weapon spells from other mods. Might be able to fix with a compatibility patch.\r<br />-Resurrected targets have their inventory reset. I think this one is unfixable (nature of the beast with the papyrus function used), but I&#39;m still looking for a solution.\r<br />-Oblivion Gate can cause some lag if you try to teleport to a spot really far away.\r<br />\r<br />[u][b]Annoyances[/b][/u] - harmless niggles, slight visual glitches\r<br />-Chameleon visual effect only appears in 3rd person.\r<br />-Devouring Wraith and Winter&#39;s Fury ice spirits drop ash piles on death...despite my best efforts to prevent it.  ",
  "categoryId": "75",
  "version": "1.2",
  "author": "steelfeathers",
  "createdUnix": "1403983952",
  "updatedUnix": "1411193400",
  "containsAdultContent": false,
  "uploadedBy": "steelfeathers",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114971",
      "name": "Grimoire v1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10049",
      "fileName": "Grimoire v1.0-54899-1-0.zip",
      "uploadedUnix": "1403983025",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ffc65c68e27b8003fc63bb6060781adbcfa78d4ca791b97278c80c106fff0841/analysis/1408151841/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grimoire%20v1.0-54899-1-0.zip?fid=1000114971&ttl=1535839423&ri=8192&rs=8192&setec=bc4fbad5b6fc62c44b16184eb4951e0c"
    },
    {
      "fileId": "1000116795",
      "name": "Grimoire v1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10051",
      "fileName": "Grimoire v1.1-54899-1-1.zip",
      "uploadedUnix": "1404950230",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7aa815a8b6dc8de5a319a5e31d154447c2e7bf6617c984da7f89e604eb5d19af/analysis/1408171656/",
      "changelogHtml": " Fixed sneak attack multiplier for Ice Shard <br/> \n Added tags for ASIS compatibility <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grimoire%20v1.1-54899-1-1.zip?fid=1000116795&ttl=1535839424&ri=8192&rs=8192&setec=c3f96c84c85542ad14883db05d8fefb2"
    },
    {
      "fileId": "1000127655",
      "name": "Grimoire v1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10051",
      "fileName": "Grimoire v1.2-54899-1-2.zip",
      "uploadedUnix": "1411193400",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/fae1af79b1a5b447283e845a8acaccbf31564bd2909dea98bf61cf4aa5ddb6db/analysis/1411193467/",
      "changelogHtml": " Fixed summon spell absorption with Atronach stone <br/> \n Fixed summon limit conflict with Twin Souls (Fixes both Lady of the Veil and Winter&#39;s Fury) <br/> \n Unlock no longer allows you to open &#34;Key Required&#34; locks <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grimoire%20v1.2-54899-1-2.zip?fid=1000127655&ttl=1535839424&ri=8192&rs=8192&setec=bebed6bd8a0c658f6956d4e6b1e77013"
    }
  ]
}