{
  "modId": 54897.0,
  "modName": "Riverwood Enhanced - Summer Edition",
  "summary": "Transforms Riverwood into a beautiful village to be used alongside Seasons of Skyrim - Summer Edition. Adds many trees, clutter, and plants. New types of trees not originally seen in Skyrim have also been placed to give Riverwood an even more unique summer feel.",
  "descriptionHtml": "[IMG]http://i.imgur.com/lVk3DG7.png[/IMG]\r<br />\r<br />[color=yellow][size=6][b]~About The Mod~[/b][/size][/color]\r<br />\r<br />Riverwood Enhanced - Summer Edition is a mod that makes drastic and subtle changes to all of Riverwood. It adds clutter to many areas which include statics, furniture, animals, and flora. Many new trees and plants have been added that are not in the usual Skyrim settings.\r<br />\r<br />I have been using Seasons of Skyrim -Summer Edition and wanted to work on making places seem more summer like and full of life that just puts on a summery atmosphere. So, I started with Riverwood; the village that always seems to get changes added to it.\r<br />\r<br />[color=yellow]Changes in Version 1 Include:[/color]\r<br /> - Smelter added next to blacksmith\r<br /> - Many new tree and plant types added throughout Riverwood\r<br /> - More farm life added\r<br /> - Many flowers and other flora added to make the environment more beautiful\r<br /> - Campsite with safe storage for player added\r<br /> - New clutter added - balanced without too much &#34;clutter&#34;\r<br /> - Little bits and pieces added throughout - these are subtle changes, but really bring out a rustic, small community feel\r<br /> - Cleaned with TES5Edit\r<br />\r<br />---&gt;Also there has been a new camping area added to Riverwood. It includes a few safe storage places which have some nice stuff for starting out. The camp was two storage barrels, a chest, satchel, a tent and bedroll, campfire with cooking spit, fishing rods, and a chair with a table. The storage is all safe and will not respawn.\r<br />\r<br />\r<br />Note: About the pictures... Most are After and then before pictures. I meant to edit them and put the words &#34;after&#34; and &#34;before&#39; on them, but I forgot. Will edit and do them later. For now just look at them in that order. The first one being &#34;after&#34; the installment of this mod and the next one in line being &#34;before&#34; this mod.\r<br />\r<br />[color=yellow][size=6][b]~Recommended Mods~[/b][/size][/color]\r<br />\r<br />First and foremost, this mod was created to go along with [url=http://www.nexusmods.com/skyrim/mods/46628/?]Seasons of Skyrim - Summer Edition[/url]. The plants, environment, and even the trees used in Riverwood would be out of place for anyone who does not use that mod. Sure, it would work.. but some of the plants that have been retextured by the SoSP mod wouldn&#39;t fit without that said mod installed.\r<br />\r<br />For example, SoSP makes changes to the tundra brush and plants, making them green and lush with life. Several &#34;tundra&#34; plants have been placed in Riverwood, but with this mod and SoSP installed they look summery fresh.\r<br />\r<br />[color=yellow][size=6][b]~Future Updates~[/b][/size][/color]\r<br />\r<br />I do plan on doing future updates that will include patches for those who use mods such as &#34;Expanded Towns and Cities&#34;, ect. It does take time though, be patient. For now their may be clipping/things in odd places, ect. You can easily disable any problems via the console command.\r<br />\r<br />[color=yellow][size=6][b]~Other Plans?~[/b][/size][/color]\r<br />\r<br />Yes, I do plan on doing this for other villages throughout Skyrim. I will also make changes to the cities. I hope to completely overhaul every village and city in Skyrim with new flora and critters.\r<br />\r<br />[color=yellow][size=6][b]~Problems?~[/b][/size][/color]\r<br />\r<br />File not correct? Something not working right? Let me know please. Also feel free to take screen shots for me. I&#39;d love to see them&#33;\r<br />\r<br />[color=yellow][size=6][b]~Compatibility/Incompatibility~[/b][/size][/color]\r<br />Anything that changes Riverwood will not be compatible. Other &#34;enhancement&#34; mods will also be incompatible. \r<br />\r<br />[color=yellow][size=6][b]~Credits~[/b][/size][/color]\r<br />Elinen&#39;s plants and trees mod resources\r<br />\r<br />[size=5][color=yellow]My Other Mods:[/color][/SIZE]\r<br />\r<br />[URL=http://www.nexusmods.com/skyrim/mods/52794/?][IMG]http://i.imgur.com/UDBMqrI.jpg?1[/IMG][/URL]\r<br />\r<br />[URL=http://www.nexusmods.com/skyrim/mods/52391/?][IMG]http://i.imgur.com/PlPccow.jpg?1[/IMG][/URL]",
  "categoryId": "58",
  "version": "V1",
  "author": "FatalxSyn",
  "createdUnix": "1402810017",
  "updatedUnix": "1402809774",
  "containsAdultContent": false,
  "uploadedBy": "FatalxSyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113039",
      "name": "Riverwood Enhanced - Summer Edition",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "Riverwood Enhanced - Summer Edition-54897-V1.rar",
      "uploadedUnix": "1402809774",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/c7ed6178fe6d4131370de6e84737ff95018ce5737935cf4f74d1fcf4064cdbd3/analysis/1408127347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Enhanced%20-%20Summer%20Edition-54897-V1.rar?fid=1000113039&ttl=1535839420&ri=8192&rs=8192&setec=3fbbca9df8bc1d411a9c0e7763d0ba2b"
    }
  ]
}