{
  "modId": 5493.0,
  "modName": "HD Remodeled Cutlery - Fork and Knife",
  "summary": "Forks and knives remodeled in nice detail.",
  "descriptionHtml": "HD Cutlery by Ronisaurus\r\n\r\nI made a vid about the mod and where you can find equipable forks/knives:\r\nhttp://www.youtube.com/watch?v=gbAlH2TvsCE\r\n\r\n- DESCRIPTION:\r\n\r\nThis mod replaces the basic knife and fork found on some tables in Skyrim. Wieldable ones are very rare to find, but when you finally find them, this mod is good to have. This mod makes them look awesome. It is fun to poke a guard 2-3 times with the weakest weapons of the game before he aggros you to see the enchanted paralyze proc and make them sit on their butts. Even more fun when you have nice looking models equipped instead of the original, ugly looking ones. \r\n\r\n- INSTALLATION:\r\n\r\nPut the contents of the data folder from the HD Cutlery folder into your Skyrim main directory!\r\n\r\n- UNINSTALLATION:\r\n\r\nRemove the same files this pack contained!\r\n\r\n- KNOWN ISSUES AND TROUBLESHOOTING:\r\n\r\n------- PHATE3 HELPED ME SOLVE IT, SO HE IS AWESOME! ---------\r\n\r\nTHE KNIFE AND FORK ARE BUGGED BY DEFAULT IN THE GAME, that is why you can\\'t pick every fork and knife up. This mod has nothing to do with the bug, but you might encounter it, because you might start using the cutlery more.\r\n\r\nWHAT THE BUG IS: Nothing game-breaking. When you load up a game with the knife/fork/both equipped and sheated in some closed spaces - only spotted a few so far - (like a house/inn), your character might end up placed away from the original saved coordinates  and the items might not appear in the character\\'s hand in 3rd person.\r\n\r\nHOW TO FIX: Go outside into an open area, drop the fork/knife/both, then pick them up. This should now fix the problem and draw the items in 3rd person. From then on they will also show up in places where they don\\'t appear after loading. To prevent the bug, dont have them equipped when you save!\r\n\r\nIf you want to test the bug yourself, go to the Sleeping Giant Inn in Riverwood, equip the knife, sheath it, quicksave, quit the game, then reload the save. You will then know why equipable versions of these items are rare in Skyrim.\r\n\r\n\r\n- THANKS TO:\r\n\r\nMADCAT221 - for helping out with nifscope crazyness\r\nNEXUSANGEL - for helping out with even more nifscope madness\r\nPHATE3 - for helping a lot with a fluke bughunt.\r\n\r\n\r\nEnjoy the op cutlery!",
  "categoryId": "55",
  "version": "1.00",
  "author": "Ronisaurus",
  "createdUnix": "1325876822",
  "updatedUnix": "1325894422",
  "containsAdultContent": false,
  "uploadedBy": "ronisaurus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17323",
      "name": "HD Remodeled Cutlery",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2173",
      "fileName": "HD Remodeled Cutlery-5493-1-00.rar",
      "uploadedUnix": "1325894422",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/1a6a2fe8cecb6281c637ffb756de7dbd3aab43cb1ba12bf88385118c831c89b3/analysis/1406588897/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HD%20Remodeled%20Cutlery-5493-1-00.rar?fid=17323&ttl=1535762258&ri=8192&rs=8192&setec=507e0c12f60117007577ef90978bf460"
    }
  ]
}