{
  "modId": 54956.0,
  "modName": "Northern Cardinal",
  "summary": "Add a unique medium-sized ship named Northern Cardinal as player home/guild base with crew system, fast travel system. The mod also comes with new quests,  new dock locations, new npcs, new worldspace, new dungeon, new weapon and more.",
  "descriptionHtml": "[img]http://i.imgur.com/IykizGF.png[/img]\r<br />\r<br />[img]http://i.imgur.com/9dNbUSL.png[/img]\r<br />\r<br />[size=3]Feb. 2015\r<br />\r<br />This mod is no longer supported, want more of Northern Cardinal? Check out the expansion by BigBizkit\r<br />[/size]\r<br />[size=4][url=http://www.nexusmods.com/skyrim/mods/62844/?]Pirates of Skyrim - The Northern Cardinal under the Black Flag[/url][/size]\r<br />\r<br />[LINE]\r<br />[img]http://i.imgur.com/gZalbOP.jpg[/img]\r<br />\r<br />Nothing much in regard to the actual content. Main update is the MCM menu. It requries SkyUI and will show up after completing the quest.\r<br />\r<br />However with the redone of the traveling system, adding more locations and banners etc. will be more convenient. I may add a new location near Winterhold and if want to add any new banners you can post for me, I may also leave a slot for custom banners as well.\r<br />\r<br />And thanks to [url=http://www.nexusmods.com/skyrim/users/120929/?]-Ren-[/url] for the Fomod installer.\r<br />\r<br />For the full 1.4 update details, check the CHANGES Tab.\r<br />[LINE]\r<br />\r<br />[img]http://i.imgur.com/ii4igNW.png[/img]\r<br />\r<br />[url=https://www.youtube.com/user/Brodual]Brodual[/url] made a detailed video showcase about almost all the contents and features about this mod, watch this video should be enough if you feel tl;dr about my descriptions. Thanks for the video&#33;\r<br />\r<br />[center][youtube]yp5dvvvBkKA[/youtube][/center]\r<br />\r<br />Northern Cardinal is a merchant ship from the East Empire Trading Company, the impact of the Company is no match for its former glory, even the vessels from the Company itself can hardly get sufficient protection. In every voyage, those ships have to face various of dangers, the unexpected weather in the Sea of Ghosts and more importantly, the ever increasing pirate activities. Northern Cardinal is no exception, it went missing during its lasted mission. Whether it&#39;s sunken deep into the sea, or ported near some pirate hideouts, no one knows the answer...\r<br />\r<br />I always feel that Skyrim is lacking in contents about seas, the Sea of Ghosts, the East Empire Company, the Pirates, those are all very exciting to think about. There are mods aim to improve this and I decide to do so as well. For me, a ship mod is a good start.\r<br />\r<br />[img]http://i.imgur.com/FDUjFmS.png[/img]\r<br />\r<br />[list][*]You need Skyrim up to date.[/*]\r<br />[*]You don&#39;t need any DLC for this mod to work.[/*]\r<br />[*]The MCM menu requires SkyUI but it&#39;s not essential for the mod.[/*]\r<br />[/list]\r<br />[center]\r<br />Other Languages:\r<br />\r<br />[url=http://bbs.3dmgame.com/forum.php?mod=viewthread&tid=4344108][img]http://i.imgur.com/suaBmPz.png[/img][/url]   [url=http://www.nexusmods.com/skyrim/mods/56455/?][img]http://i.imgur.com/411lgbc.png[/img][/url]   [url=http://renn.tistory.com/270][img]http://i.imgur.com/e7h6pnW.png[/img][/url]   [url=http://modmaximus.net/load/3-1-0-4314][img]http://i.imgur.com/khbegTq.png[/img][/url]   [url=http://www.nexusmods.com/skyrim/mods/56634/?][img]http://i.imgur.com/oXOMMtW.png[/img][/url]   [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/bordeciel/habitations/cardinal_du_nord][img]http://i.imgur.com/n7K2mRE.png[/img][/url][/center]\r<br />[img]http://i.imgur.com/r1QsgBL.png[/img]\r<br />\r<br />The content of the mod can be divided into three parts: a quest, a player home and several new areas with new NPCs. The player home, i.e. the ship, has a fast travel system and a crew recruitment system which will be covered in the next section.\r<br />\r<br />[b][color=#ffcc33]The Quest[/color][/b]\r<br />\r<br />Where to Start:\r<br />\r<br />The quest is automatically enabled after the installation, the quest giver is a merchant named Marcian, he is in the new dock area in Solitude.\r<br />\r<br />The quest is pretty straight-forward, read the quest log or follow the quest marker should be enough. The level recommendation is after level 12. Approximated time is around 30 mins of gameplay.\r<br />\r<br />[b][color=#ffcc33]The Ship[/color][/b]\r<br />\r<br />After completing the quest and sailing the ship back to Solitude, a quest is updated to tell you go talk to the merchant Marcian about purchasing upgrades for the ship. A decoration guide will be given to you after talking to him. There are five packages for purchasing and the details are in the guide, note certain purchases are the requirements for crew recruitment.\r<br />\r<br />Here is a video that shows the fully upgraded ship, by courtesy of [url=https://www.youtube.com/channel/UCoEjvAplB6GaVJjCAwx3fJA]hodilton[/url].\r<br />\r<br />[center][youtube]5e7kJ7EqzNM[/youtube][/center]\r<br />\r<br />[b][color=#ffcc33]New Solitude Dock[/color][/b]\r<br />\r<br />Same location as the mod Solitude Docks District. Considering the performance issue, only three major buildings are added: the general goods store for the aforementioned merchant, an inn and a blacksmith. Also an addition to the Solitude Arch city entrance makes it more stand-out.\r<br />\r<br />[b][color=#ffcc33]New NPCs[/color][/b]\r<br />\r<br />Solitude Docks:\r<br />[list][*][b]Marcian[/b], Imperial Merchant, General Vendor, Quest Giver, Offers Ship Purchases[/*]\r<br />[*][b]Liviana[/b], Nord Sailor/Mercenary, Misc Favor Quest Giver, Potential Follower[/*]\r<br />[*][b]Cleland[/b], Nord Sailor/Mercenary, Misc Favor Quest Giver, Potential Follower[/*]\r<br />[*][b]Istandir[/b], Nord Blacksmith, Blacksmith Vendor[/*]\r<br />[*][b]Platinis[/b], Imperial Innkeeper[/*]\r<br />[*][b]Jestien[/b], Breton Bard[/*]\r<br />[*][b]Bolldar[/b], Nord Blacksmith Apprentice, Potential Ship Blacksmith[/*]\r<br />[*][b]Gormmer[/b], Nord Merchant, Fishery Vendor, Quest Ally[/*]\r<br />[*][b]Alonzo[/b], Redguard Merchant, Fletcher Vendor, Quest Ally[/*]\r<br />[/list]\r<br />Other Locations:\r<br />[list][*][b]Sigvand[/b], Nord Achemist, Potential Ship Alchemist, Location: Dawnstar Dock Farmhouse[/*]\r<br />[*][b]Celia Ireton[/b], Dunmer Mage, Potential Ship Mage, Location: Windhelm Dock Farmhouse[/*]\r<br />[/list]\r<br />\r<br />[img]http://i.imgur.com/KYxIa9i.png[/img]\r<br />\r<br />[color=#ffcc33][b]Travel System[/b][/color]\r<br />\r<br />The ship can be anchored in major docks along the northern coast: Solitude, Dawnstar and Windhelm. Fast travel can be done by:\r<br />[list][*]Activating the wheel at the quarterdeck.[/*]\r<br />[*]Activating the map at the foredeck.[/*]\r<br />[*]Activating the map in the captain&#39;s cabin.[/*]\r<br />[*]Talking to the First Mate you appointed.[/*]\r<br />[/list]\r<br />If Dragonborn addon is installed, Raven Rock dock can be unlocked by talking to captain Gjalund after going to Solstheim for the first time.\r<br />\r<br />[color=#ffcc33][b]New Lands Mods Addon[/b][/color]\r<br />\r<br />In order to unlock the docks for the new lands, you need to advance their quest to certain stages to avoid breaking their quests.\r<br />For Falskaar, you need to [b]complete[/b] the quest [b]Passage Home[/b].\r<br />For Wyrmstooth, you need to [b]complete[/b] the quest [b]Barrow of the Wyrm[/b].\r<br />After meeting the quest requirements, talk to the merchant Marcian at Solitude Docks to update the sailing route.\r<br />Use the [b]map inside the captain&#39;s cabin[/b] to travel to new lands locations.\r<br />\r<br />[b][color=#ffcc33]Crew System[/color][/b]\r<br />\r<br />You can recruit up to nine crew for the ship, they will stay on board until dismissed.\r<br />\r<br />There are three ways to recruit your crew:\r<br />[list=1]\r<br />[*]Simply take your followers on the ship, talk to them about joining the crew, when you dismiss them from the follower duty, they will stay on board.[/*]\r<br />[*]For the followers who are not in the vanilla follower system (Serana, Interesting NPCs, some other mod followers), there is a crew journal available in the captain&#39;s cabin, give it to the follower and the dialogue option will be available.[/*]\r<br />[*]You can get blacksmith, mage, alchemist vendors and bard to work on the ship by talking to them about working on the ship. There are new npcs near the docks if you don’t want to use vanilla npcs (which is recommended).[/*]\r<br />[/list]\r<br />Note: You can actually recruit almost anyone by reverse-pickpocketing, which is not recommended but fun to try I guess.\r<br />\r<br />Working on ship dialogues depend on the class of the vendor (VendorBacksmith, VendorApothecary and VendorSpells), while blacksmith and apothecary vendors are mostly with the correct class, most spell vendors in vanilla game are not in vendor class.\r<br />\r<br />Crews will sandbox both interior and exterior of the ship, they prefer staying outside providing the weather condition is good. Ship blacksmith/mage/achemist and first mate have special sandbox routines which make them easier to locate. Some of the crew will visit local inn in the evening.\r<br />\r<br />[b][color=#ffcc33]Other Features[/color][/b]\r<br />\r<br />[list][*]Ship model to customize the banners and figurehead of the ship.[/*]\r<br />[*]Activate the main mast to the crow&#39;s nest.[/*]\r<br />[*]Rope ladder by the side of the ship to get out of the water quickly.[/*]\r<br />[*]New ambiance sound around the ship locations.[/*]\r<br />[*]New pirate weapon: Steel Cutlass (same attributes as Scitmar)[/*]\r<br />[/list]\r<br /> \r<br />[b][color=#ffcc33]Hearthfire Support[/color][/b]\r<br />\r<br />In order to move spouse and kids to the ship you will need [url=http://www.nexusmods.com/skyrim/mods/29249/?]Hearthfire Multiple Adoptions[/url]\r<br />\r<br />1. Make sure the ship is docked at Solitude/Dawnstar/Windhelm.\r<br />2. Dismiss all of the crew members.\r<br />3. Activate the ship model insdie the captain&#39;s cabin, replace the beds for kids.\r<br />4. Use the spell Bless Home from Hearthfire Multiple Adoptions inside the ship.\r<br />5. Tell your spouse or kids to move in.\r<br />\r<br />Note: Kids will lost AI sometimes at places other than the three main docks mentioned above since they cannot go outside, just don&#39;t stare at them all day long , after sailing back it will be fine.\r<br />\r<br />You can still recruit crew after moving in your family, but the limit is now 4 with 5 beds replaced for kids.\r<br />\r<br />[img]http://i.imgur.com/ggt1Cxi.png[/img]\r<br />\r<br />Install and uninstall with NMM or MO. Dragonborn add-on is required if Dragonborn DLC is active.\r<br />\r<br />[color=#ffcc33]How to merge addons:[/color]\r<br />\r<br />You will need [url=http://www.nexusmods.com/skyrim/mods/37981/?]Merge Plugins TES5Edit Script[/url]\r<br />\r<br />1. Open TES5Edit and select and main esp and the esps for addon you want to merge.\r<br />2. Select the esps you want to merge in TES5Edit -&gt; Right Click -&gt; Apply Script -&gt; Select &#34;Merge plugins v1.65&#34;\r<br />3. Uncheck Renumber FormIDs and keep others with default settings.\r<br />4. Choose -- CREATE NEW FILE -- and give a name for the merged file.\r<br />5. After merging, delete following folders (not essential but they are useless):\r<br />Data/Textures/Actors/Character/FacegenData/facetint/&lt;yourfilename&gt;\r<br />Data/Meshes/actors/character/facegendata/facegeom/&lt;yourfilename&gt;\r<br />Data/Sound/Voice/&lt;yourfilename&gt;\r<br />6. Rename the merged plugins back to NorthernCardinal.esp\r<br />\r<br />Note: If you are not sure what you are doing at any point or get errors/ctds after merging, you might as well keep the addons, there are only two if you are using the legendary version anyway.\r<br />\r<br />[img]http://i.imgur.com/LvmJ60N.png[/img]\r<br />\r<br />[color=#ff3333]Incompatible:[/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/22821/?]Solitude Docks District[/url]\r<br />Incompatible in almost every aspects, not even patchable.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/29443/?]Pirates of the Pacific[/url]\r<br />Major clipping of the ships when Northern Cardinal is at Solitude and navmesh conflicts.\r<br />\r<br />REGS - Cities.esp from [url=http://wiki.step-project.com/Pack:Explorers_Guide]A Real Explorer&#39;s Guide to Skyrim[/url]\r<br />It adds a small jetty where the new Solitude dock locates. You can still use other individual mods that esp file includes.\r<br />\r<br />[color=#ffcc33]Semi-compatible:[/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/13608/?]Expanded Towns and Cities[/url]\r<br />Minor navmesh conflict near Dawnstar Sanctuary, load this mod after ETaC will be fine.\r<br />\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=1677559]Quest: Sea of Ghosts[/url]\r<br />Navmesh conflicts, clean SoG mod with TES5Edit and load Northern Cardinal after Sea of Ghosts.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/50977/?]Windhelm Exterior Altered[/url]\r<br />Object clipping, use console command or creation kit to remove the clipping objects.\r<br />\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=129969995]Castle Volkihar Redux[/url]\r<br />An invisible collision box marker is added to the dock walkway.\r<br />\r<br />Mods that modify areas around [b]Solitude Docks District[/b], [b]outside Dawnstar Sanctuary[/b], [b]outside Windhelm near Hlaalu Farm[/b] are most likely to be incompatible.\r<br />\r<br />Please report any incompatibility issues so that they can be added to the list and maybe patched.\r<br />\r<br />[color=#33cc33]Compatible:[/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/14087/?]Better Docks[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/15508/?]Better Fast Travel[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/37994/?]Falskaar[/url] and [url=http://www.nexusmods.com/skyrim/mods/25704/?]Wyrmstooth[/url], addons for travelling there by ship are available.\r<br />\r<br />[img]http://i.imgur.com/AcsmFDk.png[/img]\r<br />\r<br />All the dialogues are fully voiced with vanilla voice files, even though I tried very hard to find and edit from thousands of lines of dialogues, it can still sound a bit out of place here and there. I&#39;m not a native English speaker so please report any grammar/spelling/context errors.\r<br />\r<br />There may be floating grass which is a bug related to new worldspaces, fix is available here:\r<br />http://www.creationkit.com/Floating_Grass_Fix\r<br />\r<br />For Falskaar/Wyrmstooth/Dawnguard addons (and future addons), npcs will not use the doors from the ship interior by themselves. This means the crew will stay indoor at those locations and followers will not naturally find their way back if dismissed inside. Followers will follow you in and out without any problem though.\r<br />\r<br />[img]http://i.imgur.com/XNbOVQW.png[/img]\r<br />\r<br />Q: Will you make it real time sailable?\r<br />A: Not in the forseable future. While there are some mods already achieved the similar feature, such as sailable ships, airships, they all have their tradeoffs: performance issue, collisions etc. And making my ship sailable won&#39;t provide much more gameplay elements since the water system in Skyrim is terrible for ship travel.\r<br />\r<br />Q: Will you make it compatible with Solitude Docks District?\r<br />A: Unfortunately you have to choose between the two, both mods have heavy edits including landscape and navmesh which makes it almost impossible to patch.\r<br />\r<br />Q: Can you make the ship port/sail to &lt;certain location&gt;.\r<br />A: I will definitely add more locations when I improve the system to be more expandable, the current priority is Falskaar/Wrymstooth -&gt; Dawnguard -&gt; Hearthfire -&gt; others.\r<br />\r<br />Q: There are floating grass.\r<br />A: Read the Known Issue section.\r<br />\r<br />Q: Where are the Dawnstar and Windhelm Dock Farmhouses?\r<br />A: They are not at the vanilla docks, they are near the docks where the ship is harboured.\r<br />\r<br />Q: Is this mod compatible with &lt;mod not mentioned in the compatibility section&gt;\r<br />A: I&#39;m sorry but I can&#39;t test all of them by myself, you are welcomed to report any compatibility issues.\r<br />\r<br />Q: I don&#39;t like the exterior/interior model/texture of the ship, can you change that?\r<br />A: All the models used are in the creation kit already (not used in game), and I have little to none knowledge about 3D model and textures. It will be nice if anyone offers help about new model or retexure, but for now, the ship is what it is.\r<br />\r<br />Q: Will it break other quests if I clear the vanilla dungeon as the first quest objective instructed?\r<br />A: No, that is a clearable location which can be cleared and respawn anytime in game, and the quest objective actually has nothing to do with the enemies inside.\r<br />\r<br />[img]http://i.imgur.com/TKvKc3i.png[/img]\r<br />\r<br />[list][*]Travel and Crew System improvement.[/*]\r<br />[*]Customizable sails.[/*]\r<br />[*]Improve working system of the ship.[/*]\r<br />[*]Alternative textures for the ship.[/*]\r<br />[*]Add/improve quests and back story for existing npcs.[/*]\r<br />[*]More misc quests.[/*]\r<br />[*]Sea battle.[/*]\r<br />[*]East empire company/pirate quest line.[/*]\r<br />[*]Add more future plans to future plans.[/*]\r<br />[/list]\r<br />Even though the quests are not a top priority for now, I&#39;m still expecting interesting ideas about EETC/Pirate story line, which will certainly give me some more motivation. Some ideas about crew, first mate are also welcomed.\r<br />\r<br />[img]http://i.imgur.com/ktNUdvP.png[/img]\r<br /> \r<br />[list][*]Blary for [url=http://www.nexusmods.com/skyrim/users/2250922/?tb=mods]Open Books, Alchemy Clutter etc[/url].[/*]\r<br />[*]Stoverjm for [url=http://www.nexusmods.com/skyrim/mods/42362/?]Open Books Library[/url].[/*]\r<br />[*]yourenotsupposedtobeinhere for [url=http://www.nexusmods.com/skyrim/mods/17303/?]Rug Resource[/url].[/*]\r<br />[*]BrettM for [url=http://www.nexusmods.com/skyrim/mods/43143/?]Experiment Pack[/url] and [url=http://www.nexusmods.com/skyrim/mods/44434/?]Aquarium Kit[/url].[/*]\r<br />[*]InsanitySorrow for all his [url=http://tesalliance.org/forums/index.php?/topic/5972-list-insanitys-skyrim-resources/]Skyrim Resources[/url].[/*]\r<br />[*]Oaristys for [url=http://www.nexusmods.com/skyrim/mods/16525/?]Modder Resource Pack[/url].[/*]\r<br />[*]Ghosu for allow me using Pirate Saber from his [url=http://www.nexusmods.com/skyrim/mods/28545/?]Weapon Pack[/url].[/*]\r<br />[*]Horrorview for allow me to use his texture in [url=http://www.nexusmods.com/skyrim/mods/12928/?]Sexy Boats[/url].[/*]\r<br />[*]Daemonjax for his [url=http://www.nexusmods.com/skyrim/mods/10361/?]Just In Time Lighting Scripts[/url].[/*]\r<br />[*]Prometheus for his [url=http://www.nexusmods.com/skyrim/mods/30494/?]Unfolded Sails Ship[/url] resource.[/*]\r<br />[*]TESA for [url=http://tesalliance.org/forums/index.php?/files/file/1330-the-tesa-skyrim-resource-kit-project/]Skyrim Resource Kit Project[/url].[/*]\r<br />[/list]\r<br />Thanks to:\r<br />[list][*]AlexanderJVelicky, Darkfox127, BestInSlot and others for tutorial videos.[/*]\r<br />[*]Elianora for her amazing player house mod as inspiration for interior decorations.[/*]\r<br />[*]People who contribute to CreationKit.com[/*]\r<br />[*]All the other modders who kindly reply my questions and permission requests, even though some of them are not in the mod (yet).[/*]\r<br />[*]For creator of tools: TES5Edit, Wrye Bash, MultiXwm, Skyrim Audio Convertor, NifSkope, Unfuzer, Oscape, BSA Browser etc.[/*]\r<br />[*]All the mod reviewers who featured my mod.[/*]\r<br />[*]Bethesda for Skyrim and Creation Kit.[/*]\r<br />[*]The modding community.[/*]\r<br />[/list]\r<br />[LINE]\r<br />Release Note:\r<br />\r<br />1.0: 6/18/2014\r<br />Initial release.\r<br />1.1: 6/19/2014\r<br />Removed custom muisc.\r<br />1.2: 6/30/2014\r<br />Add Falskaar & Wyrmstooth support.\r<br />1.3: 7/11/2014\r<br />Add Hearthfire & Dawnguard support.\r<br />1.4: 7/26/2014\r<br />Add MCM menu and Fomod installer.\r<br />\r<br />Permissions:\r<br />\r<br />Translations are open, just PM the link when you&#39;re done so that I can add it to this page. \r<br />Permissions are needed if you want to repost the translated version to sites other than nexusmods.\r<br />Do not repost the original version to any other site in any circumstance.\r<br />\r<br />My Other Mod:\r<br />[url=http://www.nexusmods.com/skyrim/mods/51339/?]Better Falskaar and Wyrmstooth Map With Roads[/url]",
  "categoryId": "67",
  "version": "1.4",
  "author": "dastrokes",
  "createdUnix": "1403078146",
  "updatedUnix": "1406448694",
  "containsAdultContent": false,
  "uploadedBy": "swordboy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119453",
      "name": "NorthernCardinal_Installer",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "66164",
      "fileName": "NorthernCardinal_Installer-54956-1-4.rar",
      "uploadedUnix": "1406448694",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/5d6791429f75f7ceb2a33ab42650d1f658f5c40d6949699c7626157016b457b5/analysis/1406448740/",
      "changelogHtml": " Add an MCM menu for Northern Cardinal (Requires SkyUI). <br/> \n You can view ship/crew status and customize the ship banners/figurehead in MCM. <br/> \n Add an option to add a new crew journal for the crew book in case someone manages to lose it. <br/> \n (Hopefully) prevent the floating grass bug from happening. The fix still applies. <br/> \n Revamp of the traveling system and other bug fixes. <br/> \n New pirate banner option for the ship. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NorthernCardinal_Installer-54956-1-4.rar?fid=1000119453&ttl=1535839517&ri=8192&rs=8192&setec=d701e9a9c2e700047f77f1202b7373be"
    }
  ]
}