{
  "modId": 54952.0,
  "modName": "The Hairstyler - Deutsche Version",
  "summary": "",
  "descriptionHtml": "                                                                         [FONT=impact][SIZE=5][B][COLOR=lightblue]                                                                       Der Haarstylist  [/COLOR][/B][SIZE=3][COLOR=lightblue]von Lycanthrops\r<br />[/COLOR][/SIZE][/SIZE][/FONT]\r<br />\r<br />Ins Deutsche übersetzt von meiner Wenigkeit: WestSideKidd\r<br />                                                                                                                                     [SIZE=7][COLOR=lightblue][B][SIZE=3]Gib jedem einen neuen Haarstil[/SIZE][/B][/COLOR][/SIZE][B][SIZE=3]\r<br />[/SIZE][/B]\r<br />\r<br />                                                                   Diese Mod ist Emma und Vilja gewidmet. Spezieller Dank im gleichen Zusammenhang geht an Amgepo und CDCooley. ~ Lycanthrops\r<br />\r<br />\r<br />                                                                          [COLOR=#b22222][SIZE=3]                                                                     Achtung:[/SIZE][/COLOR]\r<br />\r<br />                                                                                             Diese Mod benötigt [SIZE=5][COLOR=red] ApachiiSkyHair_v_1_5_Full von Apachii[/COLOR][/SIZE][SIZE=5][COLOR=lightblue]\r<br />                                                         http://skyrim.nexusmods.com/mods/10168//?[/COLOR][/SIZE]\r<br />                                                              [COLOR=#00ffff][SIZE=4]\r<br />                                                                                            sowie die Originalmod von[/SIZE][/COLOR][COLOR=#ff0000][SIZE=4] Lycanthrops\r<br />[/SIZE][/COLOR]\r<br />[SIZE=5][COLOR=lightblue]                                                    http://www.nexusmods.com/skyrim/mods/48470/?[/COLOR][/SIZE]\r<br />[B][SIZE=3][COLOR=#ff0000]\r<br />\r<br />Beschreibung:[/COLOR][/SIZE][/B]\r<br />\r<br />Dies ist eine einfache Mod, die euch erlaubt einen Zauberspruch auszuführen, welcher jedem Akteur der Standardrassen einen anderen Haarstil gibt. Es funktioniert natürlich auch mit gemoddeten NPCs, wie euren Verbündeten und Begleitern etc. und mit dem Spieler (ohne das Race Menu nutzen zu müssen).\r<br />\r<br />In Version 1.4 habt ihr die Möglichkeit aus 35 verschiedenen Haarstilen zu wählen. Jeder Haarstil hat eine Option von mindestens 5 Haarfarben (schwarz, blond, braun, rot und weiß).\r<br />\r<br />Insgesamt stehen also 176 Haarobjekte zur Verfügung.\r<br />\r<br />Diese Mod fügt keine neuen Haarstile hinzu. Sie benutzt die Haarstile aus den Apachii Mods \r<br />ApachiiSkyHair_v_1_5_Full, ApachiiSkyHairFemale_v_1_3 und ApachiiSkyHairMale_v_1_1, dem Newsea Haarstil J117 Moonrise und den Nuska Haarstilen Dagi02, dem langen glatten Irokesen und dem männlichen Dagi01 Haarstil. Vielen Dank an Apachii und Newsea für die Erlaubnis ihre Meshes und Texturen nutzen zu dürfen. \r<br />\r<br />\r<br />Version 1.4 beinhaltet beide, Nicht-Lore-Stil und Lore-Stil-Haarschnitte.\r<br />\r<br />\r<br />[COLOR=#ff0000]Für alle die mit Vilja spielen und nicht herausfinden können, warum sie in Räumen immer wieder zu ihrem Standardhaar wechselt... geht sicher das ihr Benehmen auf &#34;Kopfbedeckungen immer tragen&#34; gestellt ist. Das Haar ist eine Perücke und als Kopfbedeckung gedacht. \r<br />\r<br />[/COLOR]\r<br />[COLOR=#ff0000][SIZE=3][B]Wie funktioniert diese Mod?[/B][/SIZE][/COLOR]\r<br />\r<br />Sobald ihr die Mod zum ersten Mal installiert habt, bekommt der Spielercharakter zwei Zaubersprüche:\r<br />\r<br />1. Ändere Haarstil\r<br />Dieser Spruch, gezielt auf einen NPC-Akteur der Standardrassen, ändert den Haarstil des Ziels.\r<br />2. Ändere eigenen Haarstil\r<br />Dieser Spruch ändert den Haarstil des Spielercharakters. \r<br />\r<br />Nachdem ihr den Spruch angewendet habt, öffnet sich ein Menü mit den Haarstilen. Ihr werdet nun ein nicht-farbiges Model der jeweiligen spezifischen Haarstiles sehen.\r<br />Um einen besseren Blick bekommen zu können, könnt ihr das Model mit der linken Maustaste herumdrehen und mit dem Mausrad hineinzoomen. \r<br />\r<br />Die Namen der jeweiligen Haarstile, sind zur besseren Auswahl sortiert nach:\r<br />\r<br />W/M - für weiblich oder männlich (das Geschlecht welches dem Haarstil angepasst ist)\r<br />\r<br />Zöpfe/Lang/LangX/Mittel/Kurz/Pferdeschwanz/PferdeschwanzXL - für den generellen Typ des Haars\r<br />\r<br />ApachiiSkyHairFull/ApachiiskyHairFemale H(uman)/ApachiiSkyhairMale/Vanilla - für die Quelle aus denen die Meshes und Texturen stammen\r<br />\r<br />15 (als Beispiel) - für die Anzahl der Haarstile aus der entsprechenden Mod.\r<br />\r<br />w/m - für die Kompalibität des Models mit dem weiblichen oder männlichen Kopfes. Alle Haarstile passen zum weiblichen Kopf, aber nur die Haarstile die mit einem &#39;m&#39; gekennzeichnet sind, passen zu einem männlichen Kopf. Andere Haarstile führen zu Clippingfehlern. \r<br />\r<br />schwarz/blond/braun/rot - für die verfügbaren Haarfarben\r<br />\r<br />\r<br />[COLOR=#ff0000][COLOR=green][SIZE=4]Und das ist die Prozedur:[/SIZE][/COLOR][/COLOR]\r<br />\r<br />Einem NPC einen neuen Haarstil geben\r<br />- Wähle den &#39;Haarstil ändern&#39;-Zauber aus dem Veränderungsabschnitt im Magiemenü (P Taste)\r<br />- Mach den Zauber bereit, ziele und führe den Zauber am Ziel, dessen Haarstil du ändern möchtest, aus.\r<br />-Das Haarstilmenü wird sich nun öffnen. Klicke auf den von dir gewünschten Haarstil. (Er wird dann aus der Liste verschwinden)\r<br />-Drücke die TAB-Taste um aus dem Menü zu gelangen und dein Ziel wird nun mit dem ausgewählten Haarstil ausgestattet.\r<br />\r<br />Wie man den Haarstil wieder entfernt und zum Standardhaar wechselt\r<br />-Führe den Zauber am Ziel, dessen Haarstil du geändert hast aus.\r<br />-Wähle keinen Haarstil sondern drücke die TAB-Taste\r<br />-Mit dem Schliessen des Menüs, wird der Haarstil oder die Kopfbedeckung des Ziels wieder zurückgesetzt.\r<br />\r<br />\r<br />Deinem Spielercharakter einen neuen Haarstil geben\r<br />- Wähle den &#39;Ändere eigenen Haarstil&#39;-Zauber aus dem Veränderungsabschnitt im Magiemenü aus\r<br />- Bereite den Spruch vor und führe ihn aus\r<br />- Das Haarstilmenü wird sich nun öffnen. Klicke auf den gewünschten Haarstil. (Er wird dann aus der Liste verschwinden)\r<br />- Drücke die TAB-Taste um aus dem menü zu gelangen und dein Spielercharakter wird mit dem ausgewählten Haarstil ausgestattet\r<br />- Indem du den Spruch nocheinmal anwendest und dann sofort die TAB-Taste drückst, wird der Haarstil entfernt und zum Standardhaar zurückgesetzt\r<br />\r<br />\r<br />Die Haarstile haben die Rüstungswerte eines Pelzhelmes, also bieten sie einen sicheren Schutz. Sie können verkauft und/oder weggeworfen werden. \r<br />\r<br />\r<br />[COLOR=#006400][SIZE=4]Beschränkungen:[/SIZE][/COLOR]\r<br />\r<br />- Die Zaubersprüche in Version 1.4 funktionieren nicht an Argoniern, Khajiit, Kindern, Kreaturen wie z.B. Draugr, Trollen, Hühnern, Kühen und Drachen usw...\r<br />\r<br />- Solange ein NPC einen Haarstil trägt, kann er keinen Helm aufsetzen. \r<br />\r<br />-Wenn ein komplettes Outfit mit Kapuze getragen wird, welches den Slot für lange Haare nutzt, wird das ganze Outfit ausgezogen und der Akteur ist nackt.\r<br />\r<br />- Diese Mod kann keine Haarstile direkt aus anderen Mods nutzen. Die Modelle müssen konvertiert sein. Das erklärt die größe der Datei dieses Downloads.\r<br />\r<br />- Ich kann nicht verhindern, das Haarstile in manchen Situationen und Umständen entfernt werden. Normalerweise bleiben sie aber ausgerüstet, selbst bei Zellenwechseln und Schnellreisen.\r<br />\r<br />\r<br />[SIZE=4][COLOR=#b22222]Kompatibilität:[/COLOR][/SIZE]\r<br />\r<br />Diese Mod wird nichts kaputt machen, da alle Änderungen rückgängig gemacht werden können. Sie wurde an Vilja, Cerwiden und den Vanilla Huscarls getestet. \r<br />Die Mod ist sauber.\r<br />\r<br />\r<br />[COLOR=#ff0000][SIZE=4]Installation:[/SIZE][/COLOR]\r<br />\r<br />Die Originalmod von Lycanthrops herunterladen und am Besten manuell den Dataordner in euren Skyrimordner verschieben. Dann die englische .esp mit der deutschen .esp ersetzen.\r<br />\r<br />[COLOR=#ff0000][SIZE=4]Deinstallation:[/SIZE][/COLOR]\r<br />\r<br />Löscht die Daten LycHairstyler.esp und LycHairstyler.bsa aus eurem Skyrim/Dataordner.\r<br />\r<br />\r<br />[COLOR=#ff0000][SIZE=4]Credits:[/SIZE][/COLOR]\r<br />\r<br />Lycanthrops für&#39;s Erlauben seine Hairstyler-Mod ins Deutsche zu übersetzen. Dankeschön&#33;\r<br />Emma, Amgepo and Lycanthrops for Vilja. Thanks a lot for all your hard work and this great Companion&#33; \r<br />\r<br />",
  "categoryId": "26",
  "version": "1.4",
  "author": "Lycanthrops - DV by WestSideKidd",
  "createdUnix": "1402943157",
  "updatedUnix": "1402943138",
  "containsAdultContent": false,
  "uploadedBy": "westsidekidd",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113214",
      "name": "The Hairstyler - Deutsche Version",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "The Hairstyler - Deutsche Version-54952-1-4.rar",
      "uploadedUnix": "1402943138",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/a37ee2c69b4a52df99d35b1f0ae2f238c48c819b6ae324dd8cfaa49edf957fdd/analysis/1408129395/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Hairstyler%20-%20Deutsche%20Version-54952-1-4.rar?fid=1000113214&ttl=1535839513&ri=8192&rs=8192&setec=a05e4fd2f2e454377ffd11a73750e346"
    }
  ]
}