{
  "modId": 54962.0,
  "modName": "Witcher 2 Oathbreaker&#39;s Armor",
  "summary": "Adds the Oathbreaker&#39;s armor, boots, and gauntlets, craftable at any forge in the leather section.  Male only.  Same stats as Guildmaster&#39;s Armor, but not worth as much due to lack of enchantments.",
  "descriptionHtml": "V1.1\r<br />Fixed the values for BS Num UV Sets in the meshes.  Special thanks to Serindas for bringing it to my attention.\r<br />\r<br />V1.0\r<br />In my opinion, the Oathbreaker&#39;s Armor is the best looking armor in The Witcher 2.  Sadly, no one ever converted it to Skyrim.  Everyone who was interested in converting Witcher 2 armors appears to have moved on to other projects.  \r<br />After a lot of trial and error, and countless internet searches, I can finally share with you what is hopefully the first of many Witcher 2 conversions to come.  Thanks for your interest, and happy adventuring&#33;\r<br />\r<br />Q & A:\r<br />Q: Are you going to do a female version?\r<br />A: No. I play as a male character, and I have no interest in having female npc&#39;s wear this armor.\r<br />\r<br />Q: What&#39;s with your account name?  Are you some kind of gun nut?  Were there really already 154 other accounts named howitzer?\r<br />A: Actually, I used to serve in the U.S. Army National Guard.  Specifically, I was a fire direction specialist in a field artillery unit.  Our cannons were 155 millimeter howitzers, hence the name and the number.\r<br />\r<br />Q: Why don&#39;t the shoulders look like they do in The Witcher 2?\r<br />A: I was having trouble with the rigging, and finally just shortened those, um, pauldrons?  Anyway, I ended up liking it better the way it is.\r<br />\r<br />Q: I&#39;m feeling extra cheeky today.  How can I use this file as an outlet for my goofy nature?\r<br />A: I suppose you could be a walking contradiction and wear the Oathbreaker&#39;s Armor while carrying Bolar&#39;s Oathblade.  Even better, if I ever get the Blasphemer Armor finished, you could wear that while starting a fistfight with Heimskr. ;)\r<br />\r<br />All assets are the property of CD Projekt Red.  Feel free to use these models for any armor mash-ups you have in mind.  Retextures are also welcome.  I only ask that you do not simply re-release the original files under your own account.  That&#39;s not cool.  I&#39;d also appreciate you not uploading this mod to other sites.  I&#39;ve taken a lot from the Nexus sites over the years, and I&#39;m very thankful that I can finally give back something cool.  Also, nothing saps a modder&#39;s motivation like seeing someone else claim credit for their work.\r<br />\r<br />Tools Used: \r<br />Gibbed&#39;s RED Tools\r<br />W2ENT Converter\r<br />3DS Max 2012\r<br />Nifskope\r<br />Creation Kit\r<br />\r<br />Thanks to CD Projekt Red for their generosity, and for treating gamers with respect and understanding.\r<br />Thanks to Bethesda Game Studios for making such an awesome and customizable game.",
  "categoryId": "54",
  "version": "1.1",
  "author": "Howitzer155",
  "createdUnix": "1402962831",
  "updatedUnix": "1403041265",
  "containsAdultContent": false,
  "uploadedBy": "Howitzer155",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113390",
      "name": "Oathbreaker&#39;s Armor",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25354",
      "fileName": "Oathbreaker's Armor-54962-1-1.zip",
      "uploadedUnix": "1403041265",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9475626bef1f62a59c4dceabba9ca39ca5925889772d6dd692f73dee848eb52a/analysis/1408131210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oathbreaker%27s%20Armor-54962-1-1.zip?fid=1000113390&ttl=1535839532&ri=8192&rs=8192&setec=dca2b0ceb82af5617397d6a9a32aa653"
    }
  ]
}