{
  "modId": 54966.0,
  "modName": "Pelinal Follower",
  "summary": "Adds a fully custom voiced follower of Pelinal Whitestrake, the Divine Crusader, with unique attacks, armor, and all that jazz.",
  "descriptionHtml": "Everyone&#39;s favorite insane genocidal future cyborg crusader is now everyone&#39;s favorite follower&#33;\r<br /> \r<br />Unless you&#39;re an elf. If you are an elf, please go away, Pelinal will not follow you if you are an elf. I&#39;m not kidding, go away.\r<br /> \r<br />Anyway, this adds a fully voiced follower of Pelinal Whitestrake. He is extremely strong, especially against elves, practically invincible. This is to be expected, because he is an android from the future (and yes shut up this is confirmed.)\r<br /> \r<br />FEATURES:\r<br />-A companion of Pelinal Whitestrake, who has\r<br />        +Fully, customed voiced, with over 30 lines. That&#39;s right, that&#39;s way more than 20.\r<br />        +random quips and elf-hatery when traveling out in the world with him\r<br />        +A sword of  elf-killing and a killing light (a laser, really) that can do tons of damage\r<br />        +The ability to go absolutely nuts when fighting an elven enemy, causing him to glow bright red and do extra damage to elves.\r<br /> \r<br /> \r<br />INSTALLATION AND COMPATS YO:\r<br />Pelinal can be found in the basement of the Temple of the Divines in Solitude, which means things that modify that area might be incompatible.\r<br />Pelianl will NOT FOLLOW YOU IF YOU ARE AN ELF. Why would he? He hates pointy-ears. This includes Bretons (which are half-elves, and that&#39;s enough for him), and orcs (which are elves, read your lore you twit). Khajiit, Argonians, Imperials, and Nords are a-okay with him. Don&#39;t whine about this, I&#39;ll just laugh at you.\r<br /> \r<br />CREDITS:\r<br />Maty743 for the armor and weapons.\r<br />TESG for testing.\r<br />Simon for use of his voice.",
  "categoryId": "96",
  "version": "",
  "author": "Trainwiz",
  "createdUnix": "1402967916",
  "updatedUnix": "1402967894",
  "containsAdultContent": false,
  "uploadedBy": "xtwentythree",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113271",
      "name": "Pelinal Follower",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19136",
      "fileName": "Pelinal Follower-54966-.rar",
      "uploadedUnix": "1402967894",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f1ce04825d66a41ecb045537523f960b318266480d390c9a4daad929424ecb12/analysis/1408130120/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Pelinal%20Follower-54966-.rar?fid=1000113271&ttl=1535839537&ri=8192&rs=8192&setec=9f8b7abc263c06c9207515175f1e64f0"
    }
  ]
}