{
  "modId": 54984.0,
  "modName": "Warrior Scholar",
  "summary": "Gain true benefits from the books you collect in the world, knowledge is now truly power. Take a look. It&#39;s in a book, but you don&#39;t have to take my word for it.",
  "descriptionHtml": "[color=red]Description:[/color]\r<br />For so long Books have only served a few purposes, the odd skill up, some quick cash, something to fill up your [url=http://nexusmods.com/skyrim/mods/49770/?]bookcase[/url], or something pretty to look at once you&#39;ve let [url=http://nexusmods.com/skyrim/mods/35399/?]BCS[/url] get ahold of them. Not a lot of fun & very little reason to ever try to collect them. Now you can be the librarian, collect books, learn their secrets, become more powerful than you could ever imagine&#33;\r<br />\r<br />[color=red]What books will teach me stuff?:[/color]\r<br />Books that contain information on a topic will increase your understanding of that topic, this understanding will present itself as a small buff. Have you read Physicalities of Werewolves? It is pretty detailed on the inner workings of werebeasts, surely you would have been able to learn how to better strike at such a foe, but until now you knew nothing. Now, after reading, keeping a copy of the book on you, for reference, will increase the damage you can deal to werebeasts while also increasing your chance to land a critical strike.\r<br />When you read a book that will teach you something you will get a message saying the book has taught you something. After reading, keeping the book on hand, as an affirmation, will grant a small bonus to you. The bonus will depend on the context of the book, a book on unarmed combat may increase your unarmed damage, while a book about shooting fireballs will probably give a bonus to damage with fire spells, or reduce their cost.\r<br />\r<br />[color=red]Can my follower gain the buff also?:[/color]\r<br />Yes&#33; You just need to use [url=http://nexusmods.com/skyrim/mods/18436/?]ASIS[/url] to make the magic happen, but understand it&#39;s a double edged bonus, as every NPC that ASIS has access to will also be able to take advantage of any books they have on them.\r<br />\r<br />[color=red]But I want ALL the buffs ALL the time&#33;:[/color]\r<br />Nope. There are about 350 books, having a permanent bonus from all of them would have a large impact on balance. Having the book on you will help keep the information fresh in your mind, like a General carrying his copy of The Art of War, or an electrician with his copy of Ugly&#39;s and the NEC.\r<br />\r<br />[color=red]Books that are excluded:[/color]\r<br />Scripted Books; Most of these are already teaching you something, normally it&#39;s the location of something.\r<br />Quest Books; Fairly obvious reasons here.\r<br />Spell Tomes; You either lose the book on reading, or get a message saying you already read it.\r<br />Notes; Most of these are hastily scrawled and have nothing to offer in the way of general knowledge.\r<br />Journals; Most are just someone&#39;s personal thoughts, like notes they generally have little to teach. If you happen to find a journal that you could learn from, let me know.\r<br />\r<br />[color=red]Requirements:[/color]\r<br />[url=http://nexusmods.com/skyrim/mods/19/?]Unofficial Skyrim Patch[/url]\r<br />\r<br />[color=red]Installation:[/color]\r<br />Manual; Drop the .esp and .bsa files in your Skyrim/Data folder. Activate in Skyrim Launcher.\r<br />NMM; Simply click the install button, and follow the FOMOD installer, no files will be overwritten. Make sure it was activated.\r<br />\r<br />[color=red]Updating:[/color]\r<br />Manual; Overwrite the existing files.\r<br />NMM; When NMM asks if you are updating the mod, just click yes.\r<br />\r<br />[color=red]Load Order:[/color]\r<br />Book Covers Skyrim.esp\r<br />WarriorScholar.esp\r<br />WarriorScholarBCS.esp\r<br />\r<br />[color=red]Compatibility:[/color]\r<br />Any mod that edits Vanilla books will be incompatible, a patch for BCS is included. Load this after any other book mods. If you&#39;re not sure ask, I&#39;ll be doing some expansion patches to cover &#39;new books&#39; mods after I finish with Vanilla and DLC books.\r<br />Compatible with;\r<br />[url=http://nexusmods.com/skyrim/mods/10012/?]Unread Books Glow[/url]\r<br />[url=http://nexusmods.com/skyrim/mods/5398/?]Books Books Books[/url]\r<br />[url=http://nexusmods.com/skyrim/mods/28778/?]Skill Book Overhaul -MORE SKILL BOOKS-[/url]\r<br />\r<br />[color=red]Uninstalling:[/color]\r<br />Remove any books from your inventory, ensure any active effects from this mod have ended and save. Then deactivate/remove the esp & return to the days of wishing you could be big and strong. Not removing the books before you uninstalling may cause any active effects to become locked on you.\r<br />\r<br />[color=red]Credits:[/color]\r<br />T3nd0 for letting me use his script, without which this mod would not be possible.\r<br />Gopher for planting a seed that would eventually grow into this idea.",
  "categoryId": "27",
  "version": "0.5.3",
  "author": "Raulfin",
  "createdUnix": "1403017481",
  "updatedUnix": "1403310650",
  "containsAdultContent": false,
  "uploadedBy": "raulfin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113749",
      "name": "Warrior Scholar",
      "version": "0.5.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1215",
      "fileName": "Warrior Scholar-54984-0-5-4.rar",
      "uploadedUnix": "1403285162",
      "modVersion": "0.5.4",
      "virusScanUrl": "https://www.virustotal.com/file/f886d5fcaaa5e1f85fdfecf485369229b5b1f78888afed63cb6cdfb2d7669072/analysis/1408135084/",
      "changelogHtml": " SkyRe patch & BCS_SkyRe patch Added. Covers the 10 books edited by SkyRe, SkyRe patches will have bonuses proper for SkyRe. Fully compatible with ASIS, thanks to Dienes offering some great tech support to help me get it right. Removed 1 more book. BCS patch updated. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Warrior%20Scholar-54984-0-5-4.rar?fid=1000113749&ttl=1535839562&ri=8192&rs=8192&setec=145a02ad809c8fecab7764536ef144d9"
    },
    {
      "fileId": "1000113811",
      "name": "Warrior Scholar",
      "version": "0.5.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1215",
      "fileName": "Warrior Scholar-54984-0-5-3.rar",
      "uploadedUnix": "1403310650",
      "modVersion": "0.5.3",
      "virusScanUrl": "https://www.virustotal.com/file/f886d5fcaaa5e1f85fdfecf485369229b5b1f78888afed63cb6cdfb2d7669072/analysis/1408135699/",
      "changelogHtml": " Corrected an effect priority typo in Immortal Blood. Added two more books, Art of War Magics & Nirnroots. BCS patch updated. Removed another book that was just a note masquerading as a book. All of the kinks look to be worked out, can start adding more than 1-2 books at a time now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Warrior%20Scholar-54984-0-5-3.rar?fid=1000113811&ttl=1535839563&ri=8192&rs=8192&setec=88204c85158da0b15f5c439480167cfb"
    }
  ]
}