{
  "modId": 5500.0,
  "modName": "Dalls_Ebony_Weapons",
  "summary": "Ebony_Weapons is arms custom re-texturing (n not simple recolour) mod which changes how game Ebony weapons look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Ebony_Weapons\r\n\r\nv1.1\r\n\r\n07/01/2012\r\n\r\nEbony_Weapons is arms custom re-texturing (n not simple recolour) mod which changes how game Ebony weapons look.*\r\n\r\n* Word of warning - my work actually do changes how these items look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers.\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nModels used for these - great looking and highly specified weapons - are among Skyrim best but their in-game textures - being overly gaudy - make them - in my opinion - less then appealing. Ebony is - supposed to be - black high grade metal -but as all games / game engines have, problem to render / show black (colour / shade) with any details - my weapons are not made to be completely black. Instead, they are mostly shades of dark grey with only some parts left - as if - being made of \\\"pure\\\" / unaltered black ebony. In game these weapons look really mean and your Black Knights n DB Assassins should not complain much if fitted with them. ;)\r\n\r\nBeside textures, there are as well some \\\"new\\\" - resized (weapons) model meshes for all which prefer more realistic - read somewhat smaller - (ebony) weapons. Bow, dagger and (one-hand) sword are all left as they are / unchanged. \r\n\r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my texture files from Data/textures/weapons/ebony as well as resized meshes (if installed) from Data/meshes/weapons/ebony and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!\r\n\r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nNote on v1.1: All ebony weapons are now present n ready for your immediate use. Some minor size tweaks (meshes) to hammers, great swords n axes.\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.\r\n\r\n",
  "categoryId": "55",
  "version": "1.1",
  "author": "Dall",
  "createdUnix": "1325881155",
  "updatedUnix": "1325950798",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17262",
      "name": "Dalls_Ebony_Weapons",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8117",
      "fileName": "Dalls_Ebony_Weapons-5500.7z",
      "uploadedUnix": "1325881387",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e738d662278a89ac0ff15991461e461008ffef2f33e2f8213f5d652b0b94109f/analysis/1406588230/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Ebony_Weapons-5500.7z?fid=17262&ttl=1535762266&ri=8192&rs=8192&setec=2b17328d3b68d0f67edf7229e3d42d6c"
    },
    {
      "fileId": "17533",
      "name": "Dalls_Ebony_Weapons_v11",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10096",
      "fileName": "Dalls_Ebony_Weapons_v11-5500-1.7z",
      "uploadedUnix": "1325950798",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a380a0e8fe3427eb6bd34408a5be5f860972f8fbbcdba3c855c2dfa12cd73d56/analysis/1406590580/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Ebony_Weapons_v11-5500-1.7z?fid=17533&ttl=1535762266&ri=8192&rs=8192&setec=9121460bce2c5dddf98689b035037cc2"
    }
  ]
}