{
  "modId": 55012.0,
  "modName": "Housecarl Requip Full",
  "summary": "Features all my Housecarl Requip Project files in one single source. All Housecarls, both core game and Hearthfire, with the exception of Rayya from Falkreath, have been altered to add more racial and combat-based diversity to the Housecarls the Dragonborn can obtain.",
  "descriptionHtml": "The compilation of all the Housecarl Requip Project files, the HRP Compilation file features every single file published. To see the details of the individual files, follow the links.\r<br />\r<br />Contents:\r<br />-Argis Two Handed http://www.nexusmods.com/skyrim/mods/54854/?\r<br />-Calder Stormcloak http://www.nexusmods.com/skyrim/mods/54857/?\r<br />-Gregor Sorcerer http://www.nexusmods.com/skyrim/mods/55010/?\r<br />-Iona Huntress http://www.nexusmods.com/skyrim/mods/54833/?\r<br />-Jordis Spellsword http://www.nexusmods.com/skyrim/mods/54842/?\r<br />-Lydia Ranger http://www.nexusmods.com/skyrim/mods/54794/?\r<br />-Valdimar Hunter http://www.nexusmods.com/skyrim/mods/55007/?\r<br />\r<br />Installation: unzip the Housecarl Requip Compilation folder and select ONLY ONE .esp per Housecarl (it would amount to 7 in total). Though it is not dangerous to place all the esp&#39;s in the Data folder, it would just be silly to activate them all, since the one lowest int he load order takes priority.\r<br />\r<br />Requirements: see the indiviaual pages for more details. Hearthfire only needed for Valdimar and Gregor.\r<br />\r<br />Load Order: as low as possible, especially if any of the Housecarls are altered by another mod.\r<br />\r<br />Bugs: The Grey Face Bug is likely to occur when activating this mod after first encountering the Housecarl. So either use this on a save file in which you haven&#39;t encountered the affected NPC, or hope a more experienced modder comes up with a solution.\r<br />\r<br />P.S., feel free to take screenshots of any of the Housecalrs altered by this mod and send them to me, I might include them in the compilation file as well as the original files. Also, since this is the Grand-Finale of the project, feel more than free to request any other NPC&#39;s to be edited. \r<br />\r<br />Permissions: If you want to have the file changed, just send me a message and what you want changed, and I&#39;ll probably give permission or do it myself. ",
  "categoryId": "96",
  "version": "1.0",
  "author": "pepertje",
  "createdUnix": "1403098922",
  "updatedUnix": "1403098918",
  "containsAdultContent": false,
  "uploadedBy": "pepertje",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113455",
      "name": "Housecarl Requip Compilation",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Housecarl Requip Compilation-55012-1-0.rar",
      "uploadedUnix": "1403098918",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cec228858beb182b36ae5a291ebca50090d85d3edea2e520a48e359e8ccb5b9c/analysis/1408132029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Housecarl%20Requip%20Compilation-55012-1-0.rar?fid=1000113455&ttl=1535839599&ri=8192&rs=8192&setec=3bce4e061d9de1168862ae0d37fe993e"
    }
  ]
}