{
  "modId": 55061.0,
  "modName": "Heroes of Karutkan",
  "summary": "Players of Waters of Karutkan may enjoy this mod as it features some of the classic characters everyone knows and loves from Karutkan into Tamriel, enabling players to team up with some of the legendary heroes.",
  "descriptionHtml": "This mod currently introduces seven new followers from the campaign setting &#34;Waters of Karutkan&#34;, as well as bringing in two classic villains from the epic story. For those unfamiliar with Waters of Karutkan (most of you), the characters in this mod wont mean anything to you, so, simply enjoy random new followers and enemies&#33; I will admit I am new to the modding world so if there are any glitches here and there I am terribly sorry. \r<br />\r<br />For those of you familiar with the storyline, the mod brings in the followers Lex, Uillium Firefist, Tanya the Swift, Caeyn Victera, Kethl, Nortix Quickhand, and finally the ghost of Arcanis Victera, Caeyn&#39;s dead father. The enemies brought into the world are Theonis and Arkan. Unfortunately, while the followers scale with the PC, the enemies do not. So both Theonis and Arkan may be extremely difficult or extremely easy, depending on player level. \r<br />\r<br />In terms of locations, for those who do not wish to simply explore the world to find the followers, two of them can be found in or around the Mages College, two are in whiterun (Hall of the Dead and Jorrvaskr), one is below decks on the Wreck of the Brinehammer, one is outside of the ratway in Riften, and the last one is within SkyHaven Temple. Theonis can be found within the abandoned prison, and finally the archenemy Arkan can be fought within Blackreach, at the Blackreach Arena. Be warned, some of the items these characters are carrying ARE UNBALANCED. A few of the swords are stronger and faster than typical tamriel quality (Im looking at you Blade of Arkan).\r<br />\r<br />This mod does not add any new weapon appearances, but merely uses the weapon models supplied by the game. I intend to further expand this mod to include other characters of the Karutkan world and to build a quest line tying them all together. Hope you enjoy&#33;",
  "categoryId": "96",
  "version": "1",
  "author": "Tortugaflamante",
  "createdUnix": "1403223464",
  "updatedUnix": "1403223464",
  "containsAdultContent": false,
  "uploadedBy": "tortugaflamante",
  "primaryFile": null,
  "files": []
}