{
  "modId": 55099.0,
  "modName": "The Lucky Lady - A Player Home for Thieves and Assassins",
  "summary": "A spacious thief/assassin home in the city of Riften. High ceilings, lots of displays, a chef and blacksmith as staff, and room for followers&#33; Also fully navmeshed and full of food.",
  "descriptionHtml": "[center][size=4][b][color=#cc0000]I am no longer maintaining Oldrim mods. Permissions are 100% open, do whatever you want.[/color][/b][/size][/center]\r<br />\r<br />[center][img]http://i.imgur.com/ONdVurU.jpg[/img][/center]\r<br />[center]PSA: Please view this house during the day AND night before deciding to use it, it gets VERY dark at night and a bit too bright for my taste during the day but I am trying to correct this.[/center]\r<br />\r<br />[center]Welcome to The Lucky Lady&#33; I originally created this mod for my own use, I wanted a spacious home that still felt appropriate for a thief/assassin/food lover/horder. I travel with three followers and cannot easily navigate compact homes without them blocking my way, so I made this home very open with plenty of space for numerous minions. The entrance to this home is on the lower level of Riften on the docks, very subtle (as a thief with massive amounts of stolen goods would want). You&#39;ll need to lockpick a chest next to the door to get the key (and a note from the previous owner). Once you get inside there is abundant decor and expensive furnishings, as well as a chef and blacksmith. I have stuck to a rather dark theme involving many assassin-y elements, so this home certainly would not suit a character who is against murder (or stealing). Also take note, I&#39;ve made heavy use of General Displays so the home may seem to have a lot of empty shelves/displays when you first enter, but this is intentional&#33; These places will be filled up as you deposit items into the General Displays treasures safe in the bedroom. You just moved in after all, your home can&#39;t be completely full.[/center] \r<br />\r<br />[b]Features:[/b]\r<br />[list][*]Fully navmeshed (follower friendly)\r<br />[*]4 mannequins\r<br />[*]Numerous weapon displays\r<br />[*]3 book shelves\r<br />[*]General Stores cloud storage\r<br />[*]General Displays throughout the home (dragon priest masks, claws, daedric artifacts, etc)\r<br />[*]A chef, blacksmith and guard with detailed AI&#39;s, two are vendors\r<br />[*]3 follower beds (6 total but 3 are used by the staff)\r<br />[*]Custom crafting stations for alchemy, enchanting, and armor smithing\r<br />[*]All crafting stations except smelter (because why would you put that indoors)\r<br />[*]Two displays of Skyrim-themed action figures to fulfill your inner Dova-horder; also a few trading cards\r<br />[*]A teleportation spell to take you home from anywhere\r<br />[*]All divine shrines\r<br />[*]New music that only plays in this home\r<br />[/list][center][b]A Note on General Stores and General Displays[/b][/center][center]For those unfamiliar with General Stores/Displays, these mods add cloud storage so that you can deposit everything in one chest and it will be autosorted into the appropriate storage areas through the home. For General Stores, you can also walk up to each area (armor/food/scroll/book/etc. storage) and deposit your items like with any normal chest but who has time for that, you need to be saving Skyrim and stuff. There is a chest right next to the front door where you can have everything autosorted. General Displays is similar except it&#39;s for displaying things&#33; There is a safe just inside the bedroom (by the nocturnal statue) where you can deposit all of your treasures such as daedric artifacts, dragon priest masks, divine amulets, guard shields, dragon claws, thieves guild treasures, Dawnguard paragons, Arentino family heirlooms, and whatever other things you&#39;ve plundered&#33; There is a display for [i]almost[/i] everything that is very special. Once deposited, these items will show up all over your home wherever I decided to put them. The more things you acquire, the more decorated your home will become&#33;[/center][center][img]http://i.imgur.com/w7o8j5U.png[/img][/center][center]As mentioned above, your new home comes with two staff members&#33; Don&#39;t ask why they&#39;re there, they just are. For reasons. There is a khajiit chef and a redguard blacksmith. They are both vendors, however they will only sell/buy while they&#39;re working. No more waking up people to sell them things, that&#39;s rude. The blacksmith sells blacksmith-type items, and the khajiit sells whatever she wants to. Both workers will eat three times a day and spend most of their time awake working in their respective areas, however they each have a little free time in the evening where they will do whatever they please. They also have each been assigned a bed in the followers quarters. If one of the staff calls your mother a mean name, you can kill them, they are only set as protected and their bodies will be cleaned up automatically (in a day or two).NEW IN 1.5: I have added a night guard who will now patrol the home while the other staff are asleep. She has an assigned bed and AI just like the others. She also is similarly set to protected and may be killed if she is not wanted. (A big thank you to Apachii for letting me include her hair&#33;)[/center][center][img]http://i.imgur.com/1KVy5md.jpg[/img][/center][list][*]ALL DLC (Dragonborn, Dawnguard, Hearthfire)\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/18340/?]General Stores[/url] [i]You should be fine with getting the runtime version, but get the other main file instead if you have issues.[/i]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/32550/?]General Displays[/url] [i]You need ALL the components for the DLC&#39;s, which are in an installer I believe. You also need the optional file called &#34;General Stores Patch&#34; if you want General Displays use the treasure chest that I placed in the bedroom for display. This way you can hit unburden at the door and not have to worry about anything. If you don&#39;t download this patch you will need to separately deposit your &#34;treasure&#34; items into the safe in the bedroom.[/i]\r<br />[*]A character with highly questionable morals and a major interest in banquets.\r<br />[/list][center][b]Please ensure this mod is AFTER General Stores and General Displays in your load order. Load order should be all DLC, General Stores, General Displays, General Displays - DG, General Displays - DB, THEN TheLuckyLady somewhere below that. Otherwise you may crash&#33;[/b][/center][center][img]http://i.imgur.com/zqIcApW.jpg[/img][/center]\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/24359/?]Bookshelves SKSE Script[/url] [i]Makes the bookshelves look much nicer by fitting more books, highly recommended since I only included 3 shelves. Requires [url=http://skse.silverlock.org/]SKSE[/url].[/i]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/7241/?]Sexy Riften[/url] [i]This makes the home look DAMN FINE. Personal taste though. Pictures shown use these textures.[/i]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/10652/?]Vanilla Mannequin Script Fix[/url] [i]Makes your mannequins less likely to come alive and escape, definitely get this. Mannequins are still buggy by nature but this helps a lot.[/i]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/11370/?]Spouses Can Live Everywhere[/url] [i]Allows your spouse to live in this home with you&#33;[/i]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/50327/?]Rens HD Shrines[/url] [i]So your divine shrines look pretty.[/i]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/46320/?]Megatherium ENB[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/5941/?]Coverkhajiits[/url] [i]So your chef looks fabulous.[/i]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/35399/?]Book Covers Skyrim[/url] [i]So your books look fabulous.[/i]\r<br />[/list][center][img]http://i.imgur.com/fNMetcJ.jpg[/img][/center][center]The door to this mod is in the Riften docks, so other mods that edit the &#34;Riften Origin&#34; cell may conflict. I don&#39;t use any so I can&#39;t say from experience, but try loading my mod after other mods that edit Riften and see if the door shows up&#33;[/center][list][*]I hate that the CK makes the home change lighting with time of day. It&#39;s much too dark at midnight and much too bright in the afternoon, but until I find a way around this just try to visit the home around 6 PM. If I make the lights any brighter at night there are massive flickering issues, so for now it just has to be super dark at night.\r<br />[*]There is a random dwemer-type noise that happens out of nowhere, and despite spending literally hours trying to figure out why I have come up with nothing. If it suddenly sounds like the Titanic just sunk inside your house, walk towards the kitchen and it will stop. \r<br />[*]Followers cannot use my custom crafting stations, not sure why but I&#39;m working on it.\r<br />[*]Mannequins are buggy and creepy but that&#39;s just the vanilla game so I can&#39;t really do anything about that. If they move out of place just take a piece of armor off and give it back, they will move. I&#39;ve also heard that it helps if you don&#39;t load a save into the home, try to go outside the house before you save and exit.\r<br />[*]The weapon rack in the smithing room sometimes partially disappears and cannot be activated, working on this.\r<br />[/list][center][img]http://i.imgur.com/vdsBwKI.png[/img][/center][list][*]I would like to add a quest for obtaining the house that involves payment, this is a high priority[*]If enough people want it I will look into adding children&#39;s beds but I really don&#39;t think this home is the right place for kids, you bad parents. There are skeleton bits all over the place.[*]I might add a supplier NPC to come into the home a few times a week to stock your kitchen and vendors.[*]I want to integrate moving a spouse into the home in this mod rather than having you use another one to do it but I haven&#39;t found a stupid-proof guide on how to do that. [*]I want the house to always look like it does at 7:30 PM. It&#39;s too bright during the day and too dark at night but I have not found a way to disable time of day in the creation kit.[*]Possibly more mannequins.[*]Possibly a torture room, if I figure out how.[*]More music tracks.[/list][center][img]http://i.imgur.com/zB8duyE.jpg[/img][/center][list][*]First and foremost, a HUGE thank you to [url=http://www.darkfox127.co.uk/]Darkfox127[/url] for an amazing resource of guides, also for his [url=http://www.darkfox127.co.uk/resource-collection.html]resource collection[/url][*][url=http://www.nexusmods.com/skyrim/mods/10168/?]ApachiiSkyHair[/url] for the guard&#39;s hairstyle[*][url=http://tesalliance.org/forums/index.php?/files/file/1326-chessboard-resource/]ChessBoard Resource[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1344-insanitys-action-figure-resource/]Action Figures[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1448-insanitys-bath-towels/]Bath Towels[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1319-insanitys-clutter-stuffs/]Clutter[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1419-insanitys-collectible-cards/]Collectible Cards[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1410-insanitys-dwemer-clutter/]Dwemer Clutter[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1203-insanitys-food-stuffs-resource/]Food[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1452-insanitys-folded-blankets/]Folded Blankets[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1182-soap-resource/]Soap[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1332-insanitys-lanterns/]Lanterns[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1436-insanitys-paintings/]Paintings[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1429-insanitys-pillows/]Pillows[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1394-insanitys-room-dividers/]Room Dividers[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1464-insanitys-sofas-chairs/]Sofas and Chairs[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1325-insanitys-washing-stuffs/]Washing Stuff[/url], [url=http://tesalliance.org/forums/index.php?/files/file/1473-insanitys-wall-charts/]Wall Charts[/url] by InsanitySorrow[*]From [url=http://tesalliance.org/forums/index.php?/topic/5441-development-journal/]this[/url] page: cookies, buttons, baskets, stoneware, trophy cases[*][url=http://www.nexusmods.com/skyrim/mods/43143/?]FPI Experiment Pack[/url] by BrettM[*][url=http://www.nexusmods.com/skyrim/mods/30600/?]Ingredients Drawer Resource[/url], [url=http://www.nexusmods.com/skyrim/mods/30602/?]Ingredients Wall Art[/url], [url=http://www.nexusmods.com/skyrim/mods/14133/?]Food Container Resource[/url], [url=http://www.nexusmods.com/skyrim/mods/30599/?]Alchemy Clutter Resource[/url], [url=http://www.nexusmods.com/skyrim/mods/14134/?]Open Books[/url], [url=http://www.nexusmods.com/skyrim/mods/14136/?]Potion Shelves[/url] by Blary[*][url=http://www.nexusmods.com/skyrim/mods/11618/?]Mannequin/Plaque/Bookshelf CK Resource[/url] by Eldiabs[*][url=http://www.nexusmods.com/skyrim/mods/16525/?]Modders Resource Pack[/url] by Oaristys[*][url=http://tesalliance.org/forums/index.php?/files/file/1264-catering-by-lilith/]Catering[/url] by Lilith[*][url=http://www.nexusmods.com/skyrim/mods/17303/?]Rugs[/url] by Yourenotsupposedtobeinhere[*][url=http://www.nexusmods.com/skyrim/mods/45540/?]Craftsman Tools[/url] and [url=http://www.nexusmods.com/skyrim/mods/42690/?]Kitchen Tools[/url] by Strotis[*][url=http://www.nexusmods.com/skyrim/mods/26132/?]Resources for Modders[/url] by Runspect[*][url=http://chriszabriskie.com/]Chris Zabriskie[/url] for making amazing creative commons music&#33;[/list]",
  "categoryId": "67",
  "version": "1.5",
  "author": "Sokkvabekk",
  "createdUnix": "1403508529",
  "updatedUnix": "1403950414",
  "containsAdultContent": false,
  "uploadedBy": "Sokkvabekk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114348",
      "name": "Base Resources - Required Along With .Esp File",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "610888",
      "fileName": "Base Resources - Required Along With .Esp File-55099-1-3.rar",
      "uploadedUnix": "1403595456",
      "modVersion": "1.3",
      "virusScanUrl": null,
      "changelogHtml": " New mannequin stands <br/> \n New bathtub <br/> \n Minor lighting fixes <br/> \n Mini Hearthfire trophy <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Base%20Resources%20-%20Required%20Along%20With%20.Esp%20File-55099-1-3.rar?fid=1000114348&ttl=1535839703&ri=8192&rs=8192&setec=717e05e73d9844669071272a3fb5dd93"
    },
    {
      "fileId": "1000114898",
      "name": ".Esp File - Also a couple modified standalone meshes and textures",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15119",
      "fileName": ".Esp File - Also a couple modified standalone meshes and textures-55099-1-5.rar",
      "uploadedUnix": "1403950414",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/2915fcf0da23fc021be64b7345bfe69057856c5aa85846f7b217397286f1f436/analysis/1408151200/",
      "changelogHtml": " Added night guard and assigned her a bed <br/> \n Added all divine shrines <br/> \n Nocturnal statue in bedroom now works as a shrine <br/> \n Added bodycleanupscript to the staff <br/> \n Minor decor changes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/.Esp%20File%20-%20Also%20a%20couple%20modified%20standalone%20meshes%20and%20textures-55099-1-5.rar?fid=1000114898&ttl=1535839703&ri=8192&rs=8192&setec=0c9d27d3f37f34dac04c3b62b0fe6dad"
    }
  ]
}