{
  "modId": 55091.0,
  "modName": "Ald&#39;Muhr",
  "summary": "**Requires Dragonborn** A small Dunmer settlement established just north of Fort Greymoor and east of Redoran&#39;s Retreat.",
  "descriptionHtml": "**REQUIRES DRAGONBORN and UPDATE**\r<br />\r<br />Ald&#39;Muhr (meaning &#34;Old Home&#34;) is a Dunmer settlement with the feeling of the strongholds from THE ELDER SCROLLS III: MORROWIND but in Skyrim. Ald&#39;Muhr is located just north of Fort Greymoor and just east of Redoran&#39;s Retreat. \r<br />\r<br />Ald&#39;Muhr comes with the following:\r<br />\r<br />\t* Three interior cells\r<br />\t* Two Redoran buildings (one of them being the player home that can be acquired) \r<br />and a tomb for the settlement\r<br />\t* Nine NPCs (Including a barkeep, merchant, and blacksmith) and some names that players of Morrowind may recall.\r<br />\t* Workstations (minus a smelter)\r<br /> \t* Blessing shrine\r<br />\t* Fully enclosed area to defend against thieves, dragons, giants, etc.\r<br />\t* Random encounter occurring outside of the settlement gates to give a sense of interaction\r<br />\t* Dialogue (although non-voiced)\r<br />        * Books inside the Ald&#39;Muhr Manor adding a backstory that works with the lore\r<br />\r<br />********************************************************\r<br />\r<br />\tFAQ\r<br />\r<br />********************************************************\r<br />\r<br />\tQ1. Why can&#39;t I see or hear what people are saying?\r<br />\tA1. Even though there are audio files with the mod, I did not record speech so please enable subtitles to address what the NPCs are saying\r<br />\r<br />\tQ2. I cannot find the key in the tombs near the ash pit&#33;\r<br />\tA2. Even though HAVOK settle is disabled for the key, if an item brushed it or the key was disturbed by an outside force i.e combat, shouts, etc, then the key may have fallen into the water, the ash itself, or is somewhere in the room. Use caution next time.\r<br />\r<br />\tQ3. The robes in the Manor are so overpowered&#33;\r<br />\tA3. In my personal opinion, magic based players have a handicap especially early on and the robes to help counter that. If you think they are overpowered or hate them or whatever the issue is: don&#39;t use them. Place them in a chest, sell them, or hang them up somewhere.\r<br />\r<br />\tQ4. My spouses (and/or children if Hearthfire is active) won&#39;t move into Ald&#39;Muhr Manor.\r<br />\tA4. I did not own Hearthfire at the time, so there&#39;s no support for children at the manor. Also, I did not create the necessary data for a spouse to live there as well. If you wish to add the missing data for spouses and children, then ask permission before editing the files.",
  "categoryId": "53",
  "version": "1.0",
  "author": "badgermullins",
  "createdUnix": "1403294691",
  "updatedUnix": "1403294681",
  "containsAdultContent": false,
  "uploadedBy": "badgermullins",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113771",
      "name": "AldMuhrV1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7728",
      "fileName": "AldMuhrV1_0-55091-1-0.zip",
      "uploadedUnix": "1403294681",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/199728333838e72f2778b1c109d67a8c9ac4f21f4a42fc36f1bffc2e20502197/analysis/1408135273/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AldMuhrV1_0-55091-1-0.zip?fid=1000113771&ttl=1535839689&ri=8192&rs=8192&setec=b974460a6acec7f6eb52808e4b70ddf8"
    }
  ]
}