{
  "modId": 55123.0,
  "modName": "Master Exploder Shout Mod",
  "summary": "Blow the minds of everyone in Skyrim with your powerful voice&#33;",
  "descriptionHtml": "INTRODUCTION:\r<br />\r<br />Ever wish your dovahkiin could have the voice of Jack Black and blast your enemies away with your powerful voice?\r<br />Prepare yourself for the greatest mind-blowing experience that will rock the socks off your feet&#33; Introducing the &#34;Master Exploder Shout Mod&#34;&#33; This mod adds a brand new shout to the\r<br />game that uses audio from the Tenacious D song, &#34;Master Exploder&#34;. We tried to make it so what Jack does in the movie with this song, you can do as well&#33; \r<br />\r<br />Word 1: Cause an enourmous fire blast&#33; Show that microphone you don&#39;t need it&#33;\r<br />Word 2: Blow the crowd away with your awesome power&#33;\r<br />Word 3: Paralyze the masses in pure awe while you ready your next display to blow their minds&#33;\r<br />\r<br />The shout does have a cooldown, so don&#39;t think it&#39;s TOO OP. It was created as a joke idea, so if anyone wants to argue that it&#39;s not lore-friendly, then sure, go ahead.\r<br />\r<br />\r<br />Description:\r<br />\r<br />-Adds a new shout to the game called the &#34;Master Exploder Shout&#34; where word 1 causes a fire blast, word 2 makes a constant &#34;fus ro dah&#34; stream, and word 3 causes mass paralyzation.\r<br />\r<br />also, just to make this clear:\r<br />I DO NOT OWN&#33; (he does not own)\r<br />THE ORIGINAL AUDIO&#33; (what he said)\r<br />THAT WOULD BELONG TO&#33; (belong to)\r<br />TENACIOUS DDDDDDDDDD&#33;&#33;&#33;&#33;\r<br />(I do not own the original audio used to make this mod; Tenacious D and Jack Black do.)\r<br />\r<br />\r<br />LOCATION:\r<br />\r<br />You can learn the shout from a book in High Hrothgar. It&#39;s sitting on a table in a back room near their beds (how dare they never teach you how to be such a badass with your voice&#33;). The\r<br />location is also in pictures of the mod. When you read the book, you will learn all three words of the shout and have them unlocked (no searching or dragon souls required&#33;)\r<br />\r<br />\r<br />REQUIREMENTS:\r<br />\r<br />No DLC should be required and the newest update for Skyrim will do sufficiently.\r<br />\r<br />\r<br />CONFLICTS:\r<br />\r<br />So far no mods have shown any conflicts with this mod.\r<br />\r<br />\r<br />INSTALLATION:\r<br />\r<br />Simply download the files and drag them into your Data folder. Just like pretty much every other mod. :)\r<br />(If you got no idea, don&#39;t fret. There&#39;s a billion people makin videos and tutorials on this. I don&#39;t wanna steal their chance at a\r<br />teaching opprotunity.)\r<br />\r<br />\r<br />BUGS:\r<br />\r<br />-Word 2 can possibly have an audible shout from your dragonborn before the actual audio plays.\r<br />\r<br />\r<br />CREDITS:\r<br />\r<br />-Bobshadow: The Idea\r<br />-VitchRazor(Steam) or WitchRiser(Nexus): The Scripting\r<br />-SamMetal: The Trimmed Audio\r<br />-Tenacious D: The Original Audio\r<br />\r<br />A BETTER THANK YOU BECAUSE THE GUYS WHO DID THIS DESERVE MORE THAN THEIR NAMES MENTIONED:\r<br />\r<br />So I basically came up with the idea and did some minor audio trimming. It was really the rest of these guys that brought this mod together.\r<br />\r<br />VitchRazor, the awesome modder that he is, took time out of his days to make this mod happen for me by scripting and creating everything we needed perfectly. Go check out some of his awesome quest mods&#33;\r<br />Steam: http://steamcommunity.com/profiles/76561198052943484/myworkshopfiles/?appid=72850\r<br />Nexus: http://www.nexusmods.com/skyrim/users/2899851/?tb=mods&pUp=1\r<br />\r<br />SamMetal was kind enough to help me do some better audio trimming and adjustments to the files I sent him, so he definately deserves a big &#34;YEAUH&#33;&#34;\r<br />\r<br />And obviously we couldn&#39;t do this mod without Jack Black and Tenacious D. You guys rock&#33; :D\r<br />\r<br />And if you&#39;re still reading this, thank you for not only downloading, endorsing, reviewing, looking at, briefly glancing toward, thinking about it, and/or still reading this mod. You&#39;re all awesome&#33; Thank\r<br />you all&#33;",
  "categoryId": "104",
  "version": "1.0",
  "author": "Bobshadow",
  "createdUnix": "1403369835",
  "updatedUnix": "1403369829",
  "containsAdultContent": false,
  "uploadedBy": "Bobshadow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000113933",
      "name": "Master Exploder Shout Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6461",
      "fileName": "Master Exploder Shout Mod-55123-1-0.zip",
      "uploadedUnix": "1403369829",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/153cd926a28c0ec0e7a52a164162115330ea45afa18e379898bf54c0863c2187/analysis/1408136776/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Master%20Exploder%20Shout%20Mod-55123-1-0.zip?fid=1000113933&ttl=1535839734&ri=8192&rs=8192&setec=e5fe226f4d7b5b9185f1c977ba5c83a9"
    }
  ]
}