{
  "modId": 55225.0,
  "modName": "Druglords of Skyrim",
  "summary": "Have you ever felt that Skyrim does not have a druglord, or do you wana have your own drug empire? Well in that case this mod is just for you. ",
  "descriptionHtml": "                              [size=250]Druglords of Skyrim[/size]\r<br />\r<br />[color=#ff0000][size=3]We have to let you know that this mod has been but on the hold as we just don´t have the firepower at the moment to continue with the mod. We are just a team of two teenagers trying to get trough collage with part time jobs and just don´t have the time to work on a project like this. But we give this mod as a free will project. If you think you want to continue with it or use something from the mod or anything like that. You have the free will, as long as you credit us. We will come back one day, maybe then we will just join a new team if someone else will continue with this mod. If you want to continue but you want to know the story and how we planned to mod to be. Just message me and I will send you all the details. We are really sorry that it had to come this[/size][/color][color=#ff0000][size=5]PAUSE.[/size][/color][color=#ff0000][size=3] We hope that we can come back later or someone will continue and it wont just be another dead project. \r<br />[/size][/color]\r<br />[i]Made by the Winking Owl team[/i]\r<br />[img]http://s3.postimg.org/sys8mt9qb/Winking800x600.jpg[/img]\r<br />\r<br />[b]Disclaimer[/b]\r<br />We do not endorse the use of drugs in any way... We are not Heisnberg \r<br />This mod is meant only for the sake of FUN & ENJOYMENT\r<br />\r<br />[b][s][color=#efefef]NEXT BIG UPDATE: 25th of August. We shall enter the BETA stage[/color][/s][color=#ff0000] Sad news. We can not release beta jet as of lately we had some personal problems. I will release the latest build. We are at late alpha now. Some rooms are undone and NPC´s if we get them done we are in BETA. I´m terribly sorry for this.[/color][/b]\r<br />\r<br />We are also in open testing. I need to have a file ready for the users, so I took upon myself and start uploading the mod. I will update the file once a week. There will still be a lower case of daily alpha testing done by me and my friend. Every one can check this mod out. It really not much. But if you find something really wrong let me know and I will try to fix it.\r<br />\r<br />To open any of the doors, you have to picklock them or find the keys. The first key is near the main house door. The other two are hidden somewhere in the house. I will be waiting for your feedback. The mod is really small and should not collide with any other mod. Do get there you have to fast travel to Var`Shir Camp. Its near Whiterun, Basically next to the bandit camp that´s past the first dragon encounter after Helgan\r<br />\r<br />Have you ever felt that Skyrim does not have a druglord, or do you wana have your own drug empire? Well in that case this mod is just for you. Just a team of two friends will try to bring you a lore friendly mod, as lore friendly as we possibly can, that will bring a drug empire to the game.\r<br />\r<br />[b]Lore[/b]\r<br />An old Kahjit clan know only as  Iko Kha´jay  is long forgotten by common folk but remember by some from scrolls of old. The clan was known as the best and biggest skooma makers in the last 16 kingdoms, after The Thrassian Plague the Iko Kha´jay  clan lost a lot of members. Brothers from the Var´Shir family are the last Manes know to man or other creature. But Elsweyr is big and nobody really knows who may still roam the jungles.(The mod will have different books that will have a detailed story of the Var´Shir and Ika Kha´jay)\r<br />Now the last brothers Ri´Dar and Ma´Jos have settled in Skyrim after traveling around Tamriel since kittens. They have set a camp up to give the Skyrim caravans a place to stock and rest in the harsh trading and discrimination of the people of Skyrim, but is that the only thing they offer. The family is known by history as Skooma dealers and makers. There is no evidence of them selling skooma anymore but is that really the case?\r<br />\r<br />[b]In the mod[/b]\r<br />What we want to make this mod have:\r<br />*Khajiit trading camp\r<br />*A new dungeon \r<br />*Quest\r<br />*New NPC\r<br />*Bunch of new books\r<br />*A new custom flag and some other items\r<br />*Different race quest starts \r<br />*Working your way up in the drug empire\r<br />*Owning an empire\r<br />*Upgrading possibility for your empires camp \r<br />*Costume quality skooma by how you make it\r<br />*Bigger Skooma market\r<br />*Custom event with drug busts and such\r<br />*Maybe some new armor and even bottles for skooma, but as I have no skill in modeling and such skill lacks in my friends also this may come in really near future\r<br />\r<br />We also have added Ja´Qus shack as a possibility, it is an optional file, but later will be part of the story. If you want Distillery with no sound or effects Go here: [url=http://www.nexusmods.com/skyrim/mods/56374/?]Ja´Qus shack [/url]\r<br />\r<br />[b]Plans[/b]\r<br />Our plan is to release the Beta of this mod in the end of summer or in the middle of autumn, the late Beta in the late winter and the full version in 2015. Yes as I only have 40% of the dungeon ready this mod will take some time, but with some patience this mod will slowly grow. Because I´m quite new to modding and my friend has no skill what so ever and will only stay to story board and testing I will have to do it all by my self. Of course If you think you could help its well accepted. I will start looking for testers also in the beginning in August, so keep look out for that. \r<br />\r<br />[youtube]8K7Ospw1724[/youtube]\r<br />A little Review of Ja&#39;Qus shack (by Thyworm Skyrim) what is a standalone mod also but will be included in the Beta stage with the main mod. \r<br />\r<br />Would thank Tony67 for his items:\r<br />http://www.nexusmods.com/skyrim/mods/16446/? For the Dwarven statue: T67 - Statue Dwarven\r<br />http://www.nexusmods.com/skyrim/mods/16482/? For the fake gold piles : T67 - GoldCoin\r<br />Made By: Tony67\r<br />\r<br />[b]Team[/b]\r<br />The team consist only of two friends right now.\r<br />Me (Kaimar) and my best friend (Patrick). We are just random people from butt freck nowhere in Europe. We live in the small country also known as Estonia (google it). I will do most of the level design, my friend will do the NPC and the story will be done together. We are both unskilled modders, and have no idea what we are playing with, but given us time I think we can make this mod a beauty. And lets be honest Skyrim will go nowhere in the next year or so. \r<br />[img]http://s30.postimg.org/7xz91khn1/10464156_487592408053055_8006018171172891729_n.jpg[/img] Kaimar\r<br />[img]http://s22.postimg.org/xmmbmk01p/10304035_881240441902807_6368655907568969707_n.jpg[/img] Patrick",
  "categoryId": "35",
  "version": "Alpha2.9",
  "author": "Winking Owl",
  "createdUnix": "1403574377",
  "updatedUnix": "1408912020",
  "containsAdultContent": true,
  "uploadedBy": "kaimar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123735",
      "name": "Ja&#39;Qus Shack(Full distillery effect)",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "542",
      "fileName": "Ja'Qus Shack(Full distillery effect)-55225-2.rar",
      "uploadedUnix": "1408911948",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/8210c6fec3a78fdc91c1c8a07b19e4a4ccf83ff386215d47f6f25613da448146/analysis/1408912023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ja%27Qus%20Shack%28Full%20distillery%20effect%29-55225-2.rar?fid=1000123735&ttl=1535839877&ri=8192&rs=8192&setec=e6bfba68177818ef7b36e0fc304c44a0"
    },
    {
      "fileId": "1000123736",
      "name": "Druglords Of Skyrim Alpha 2.9",
      "version": "Alpha2.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3991",
      "fileName": "Druglords Of Skyrim Alpha 2.9-55225-Alpha2-9.rar",
      "uploadedUnix": "1408912020",
      "modVersion": "Alpha2.9",
      "virusScanUrl": "https://www.virustotal.com/file/bec7efccb8c860f8a40f70750ff851c3a29a30ac9d46319aa5d3500f83b600d9/analysis/1408912085/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Druglords%20Of%20Skyrim%20Alpha%202.9-55225-Alpha2-9.rar?fid=1000123736&ttl=1535839877&ri=8192&rs=8192&setec=5f85c6b278242339ccaba15a28acbf6b"
    }
  ]
}