{
  "modId": 55256.0,
  "modName": "Soulgem Sword",
  "summary": "It&#39;s a sword made of soul gems.  A little powerful, perhaps, but not so strong as to ruin the fun.",
  "descriptionHtml": "To be fair, this is my first mod.  While I&#39;m reasonable in the CK, I can&#39;t mesh-edit for the life of me, so this is the result of 1.5 hours in Nifskope, playing around with soulgem meshes and an iron dagger, and later on, a torch.\r<br />\r<br />Yes, it hits nearly as hard as a Daedric Sword, and it&#39;s in the Dwarven category.  However, you need the Ancient Knowledge perk (Unfathomable Depths) to be able to craft it.  It may not be exactly a late game quest, but I felt, within my character&#39;s lore, that it was a requirement that fit in well.\r<br />\r<br />After all, who else but the Dwemer would be able to melt soulgems down into a formable material?  Who else would want to?\r<br />\r<br />Now while I haven&#39;t given the sword any interesting properties, that&#39;s simply due to the fact that, well, honestly I couldn&#39;t think of anything cool to do.  That, and I&#39;ve seen too many awesome standalone weapons ruined by a lack-luster enchantment.\r<br />\r<br />Oh, I suppose I should mention things you&#39;ll be needing to make this blade.\r<br />\r<br />You&#39;ll need:\r<br />The Dwarven Smithing Perk.\r<br />Ancient Knowledge\r<br />1 Dwarven Dagger\r<br />1 Black Soul Gem\r<br />1 Grand Soul Gem\r<br />2 Lesser Soul Gems\r<br />5 Common Soul Gems\r<br />\r<br />All soul gems are the unfilled version (at least, I&#39;m fairly sure they are.  If they&#39;re not, please, inform me&#33;  Working with filled soul gems is hazardous to one&#39;s health&#33;)\r<br />\r<br />Temperable with a Black Soul Gem.  Yeah, it&#39;s expensive.  I didn&#39;t want this to be an easy weapon to make or maintain, but for someone who has Dwarven Smithing and Ancient Knowledge, along with a lot of empty soul gems, this blade can be a good stepping stone.\r<br />\r<br />Oh, I should warn you, to temper the blade, you&#39;ll need the Arcane Blacksmith perk.  Just to keep it from being too overpowered early on, as well as a bit of my own lore behind it.\r<br />\r<br />What is the lore behind the blade?  I&#39;ve been playing a Vaalsark, a race created by the Dwemer.  (Check it out:  http://www.nexusmods.com/skyrim/mods/13561/? )  My particular character has been alive and well since the First Era, year 675.  He&#39;s not particularly nice and was looking for ways to more effectively murder people.  Specifically Altmer, but that doesn&#39;t matter for this particular mod.  Inevitably, after finding he was too strong for traditional Dwemer metal swords, and breaking a few with overly strong swipes, he went researching his former creators, and discovered a Lexicon with powerful forgotten knowledge.  It taught him the secrets of a blade that never dulls, never breaks, a blade that strikes fear into the hearts of those who see it, a blade as cold as ice, yet burns like fire.  Despite being a master blacksmith, working soul gems without the proper amount of heat kept him from making the blade perfect, though it is certainly as sharp as ebony, but with an everlasting edge.\r<br />\r<br />Initially, I hadn&#39;t planned on releasing this mess to the public (I can&#39;t make it look any better, I don&#39;t have the aptitude to pick up mesh editing properly.) but some people I&#39;d talked to were interested in the idea.  Well, to those of you who were interested, the concept is there, but I can&#39;t make it look good.  However, for someone who wants a crude, somewhat mystical looking weapon, this might do.\r<br />\r<br />I made this entirely from assets found in Skyrim&#39;s BSA file, so the soul gems may pick up any alternate textures you&#39;re using.  If that happens, show me how cool (or potentially uncool) it looks.  I like the somewhat-rough blade, but I know others might not.",
  "categoryId": "55",
  "version": "v1.0",
  "author": "Madrias",
  "createdUnix": "1403836483",
  "updatedUnix": "1403836038",
  "containsAdultContent": false,
  "uploadedBy": "Madrias",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114729",
      "name": "Soulgem Blade v.1.0a - Shorter Black Soul Gem",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "85",
      "fileName": "Soulgem Blade v.1.0a - Shorter Black Soul Gem-55256-v1-0.7z",
      "uploadedUnix": "1403835795",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c4b55c6a24713f8ef947c137d599b21ac1ab68bbfbce6b3b100a287f62db4afe/analysis/1408149194/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soulgem%20Blade%20v.1.0a%20-%20Shorter%20Black%20Soul%20Gem-55256-v1-0.7z?fid=1000114729&ttl=1535839920&ri=8192&rs=8192&setec=97ffff49aa57708b48120636c8fc3b1f"
    },
    {
      "fileId": "1000114730",
      "name": "Soulgem Blade v.1.0 - Original Mesh",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "85",
      "fileName": "Soulgem Blade v.1.0 - Original Mesh-55256-v1-0.7z",
      "uploadedUnix": "1403836038",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d5a834ddb47671eac7b8f3114b68c8148e0a0777fcba3216f6c57793c061f50/analysis/1408149195/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soulgem%20Blade%20v.1.0%20-%20Original%20Mesh-55256-v1-0.7z?fid=1000114730&ttl=1535839921&ri=8192&rs=8192&setec=06b447aa58f3ee90087fa3b40c1fda97"
    }
  ]
}