{
  "modId": 55287.0,
  "modName": "Aradia Kato Armor for Litheria",
  "summary": "A conversion of the Aradia Kato Outfit for the Litheria Race/Body replacer",
  "descriptionHtml": "[b][u]Short Description[/u][/b]\r<br />\r<br />Armor conversion for the Litheria Race/Body Replacer. It does not need the original file, but make sure to pass by its page and endorse: http://www.nexusmods.com/skyrim/mods/51111/?\r<br />\r<br />\r<br />[b][u]Story (or Long Description)[/u][/b]\r<br />\r<br />I started to use the Litheria mod as body replacer a month or so ago and found out, to my dismay, that there are only one or two armor conversions for that body in the community - or the whole internet.\r<br />\r<br />The Litheria mod already has a set of armor parts, mixable and mashable, but I wanted more, since I get bored quite easily of armors. Never before did I make an armor conversion and suceeded, but I wanted to make something different for Litheria. \r<br />\r<br />The idea for this conversion came, then. Since Aradia Kato has a lot of parts, I though it would be easier to convert it than it would be any other armor mods.\r<br />\r<br />Not known for my patience, I was wrong, of course, and struggled badly against Bodyslide 2/Outfit Studio.\r<br />\r<br />Then, the author of Litheria mod offered to help me with the meshes and the conversion finally came out.\r<br />\r<br />\r<br />[b][u]Features[/u][/b]\r<br />\r<br />Humannanture666 made the parts with slots that were similar to Litheria&#39;s armor, so they could be combined with Litheria&#39;s armor parts. He also made the panties a separate part.\r<br />\r<br />The armor can be crafted under Elven Smithing.\r<br />\r<br />From my side, came the crafting and tempering recipes, made different than the original since I was experimenting with CK. (Let me know if you would like them kept as original.)\r<br />\r<br />The original outift can be crafted in the forge using leather, leather strips and linen (for the lace variation), but the colored variations can be achieved in the tanning rack using one original armor part and an alchemy ingredient, similar to what was done with the color variations for the Temptress Race&#39;s outfits.\r<br />\r<br />Blue - Equivalente Armor Part + Blue Mountain Flower (i.e., Vintage Blue parts)\r<br />Red - Equivalente Armor Part + Red Mountain Flower\r<br />Brown - Equivalente Armor Part + Creepy Cluster\r<br />Lace - Equivalente Armor Part + Linen\r<br />\r<br />For those who do not wish to craft the armor, there is a chest inside Dragonsreach, just to the right as you enter the door, with all pieces and variations.\r<br />\r<br />\r<br />[b][u]Requirements[/u][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25461/?]HN66s Litheria - Race - BodyReplacer[/url] - Armors by humannature66 and ginnyfizz\r<br />\r<br />\r<br />[b][u]Compatibility[/u][/b]\r<br />You will only have compatibility problems if you had other mods that alter the inside of Dragonsreach. \r<br />\r<br />\r<br />[b][u]Future Plans[/u][/b]\r<br />Learn to use Blender or even Outfit Studio to make other conversions, but I need some free time and a lot of patience first. ;)\r<br />\r<br />[b][u]Installation - Manual or NMM[/u][/b]\r<br />\r<br />Manual :\r<br />1. Extract this archive to any folder and then copy the contents to Skyrim&#39;s Data\r<br />folder.\r<br />2. Start Skyrim Launcher, click Data Files, and enable the HN66 Aradia Kato Outfit.esp.\r<br />\r<br />NMM Install:\r<br />1. Start NMM.\r<br />2. Double-click the name of the mod in NMM.\r<br />\r<br />\r<br />[b][u]Uninstall[/u][/b]\r<br />\r<br />[color=red]Recommended:[/color] unequip any items from this mod first before uninstalling.\r<br />\r<br />Pick which method you are going to use for uninstall based on how you installed it:\r<br />\r<br />Manual:\r<br />1. Start Skyrim Launcher, click Data Files, uncheck the HN66 Aradia Kato Outfit.esp.\r<br />2. Delete the files associated with the mod.\r<br />\r<br />Skyrim - Data - Meshes - Armor - HN66 - 0 LITHERIA ARADIA KATO\r<br />Skyrim - Data - Textures - Aradia - aradiakato\r<br />\r<br />\r<br />NMM Uninstall:\r<br />1. Start NMM.\r<br />2. Double-click the name of the mod in NMM.\r<br />\r<br />\r<br />[b][u]Known Problems[/u][/b]\r<br />Some clipping might inevitably occur.\r<br />\r<br />\r<br />[color=red][b][u]Permissions:[/u][/b][/color]\r<br />If you wish to upload this mod to any other website, it is fine, as long as you direct the users to the original mod and the Litheria Race/Body Replacer mod.\r<br />\r<br />Any other alterations should be mentioned first to Kalilies, who uploaded the mod to the Nexus, or Aradia.\r<br />\r<br />\r<br />[color=red][b][u]Credits:[/u][/b][/color]\r<br />\r<br />Thanks to humannature666 for creating Litheria and the infinite patience to deal with me, as well for remaking the meshes&#33;\r<br />Thanks to Kalilies for making the Aradia Kato mod available in the Nexus and giving permission to publish a conversion.\r<br />Thanks to Aradia for the original meshes and textures.\r<br />\r<br />And the other people that also helped with the original mod:\r<br />Thanks to aariq for textures.\r<br />Thanks to MrDave for textures.\r<br />Thanks to Raven aka t56yr for textures.\r<br />\r<br />Thanks to Bethesda for Skyrim and the Creation Kit. ",
  "categoryId": "54",
  "version": "v1",
  "author": "Aelthas and humannature666",
  "createdUnix": "1403764879",
  "updatedUnix": "1403764429",
  "containsAdultContent": false,
  "uploadedBy": "Aelthas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114643",
      "name": "Aradia Kato - Litheria Conversion",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "55784",
      "fileName": "Aradia Kato - Litheria Conversion-55287-v1.rar",
      "uploadedUnix": "1403764429",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/aa6ffaeaee0017f14c99c98f959d3a588d57abad431c54eeb118d0dba393616a/analysis/1408147519/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aradia%20Kato%20-%20Litheria%20Conversion-55287-v1.rar?fid=1000114643&ttl=1535839975&ri=8192&rs=8192&setec=e046417c65cdc580e305974ad35ad523"
    }
  ]
}