{
  "modId": 55312.0,
  "modName": "Dragonbridge Retreat",
  "summary": "A cozy medium-sized cabin just outside of Dragon Bridge.  Features named/custom storage containers, an automatic sorting chest, unlockable trophies, interactive planters, interactive display shelves, and crafting stations.",
  "descriptionHtml": "[b][size=6]Dragonbridge Retreat v1.1[/size][/b]\r<br />[color=red][b][size=4]TO UPDATE FROM V1.0 YOU MUST FOLLOW INSTRUCTIONS OR YOU WILL LOSE ANYTHING STORED IN THE HOUSE&#33;[/size][/b][/color]\r<br />[list]\r<br />[*]Remove ALL items from ALL containers (or any items left in the open) in the House Interior, House Exterior, and Forge.\r<br />[*]Save your game.\r<br />[*]Uninstall Dragonbridge Retreat 1.0.\r<br />[*]Load your game and re-save in safe location.\r<br />[*]Install Dragonbridge Retreat 1.1.\r<br />[*]Enjoy&#33; \r<br />[/list]\r<br />[b][size=4]Description:[/size][/b]\r<br />The denizens of Dragon Bridge are growing worried that something terrible may have befallen Jogi Bjornsson who lives on the outskirts of the town.  Residents haven&#39;t seen Jogi in weeks and report strange noises coming from across the river.  An Imperial ranger was sent to investigate but hasn&#39;t returned.  Solve the mystery and there may be a substantial reward.\r<br />\r<br />Dragonbridge Retreat is a medium-sized cabin for one located just across the Dragon Bridge.  It includes named/custom storage containers, an automatic sorting chest, unlockable trophies, interactive planters, interactive item displays, and crafting stations.\r<br />\r<br />[color=red][b][size=4]NOTE: This mod requires the Dawnguard, Hearthfire, and Dragonborn DLCs to function.[/size][/b][/color]\r<br />\r<br />[b][size=4]v1.1 Update Changelog:[/size][/b]\r<br />[list]\r<br />[*]Added small quest to obtain key for the house.  If you are updating you will have to complete the quest as well, be sure to follow the update instructions so you don&#39;t lose your items.\r<br />[*]Nerfed the hell out of Jogi.  Still provides a good challenge for low to mid level players but not too overpowered.  Higher level characters will have an easy time.\r<br />[*]Improved the sorting chest.  Added over 100 items to sorting system because Bethesda either forgot to add the proper keywords or put weird ones on certain items.  Rearranged sorting priorities so ingredients take precedence over food to avoid most ingredients from being moved into the food container or the crafting supplies container (animal parts).\r<br />[*]Added tooltips to the trophies so you can see which quests are required to unlock them. \r<br />[*]Added a secret entrance/exit to forge area.  The entrance is enabled after completing the intro quest.  Includes another sorting chest near the exit.\r<br />[*]Added Black Book that instantly transports you to Raven Rock and back.  The special entrance is enabled after completing the quest Dragonborn once you enter the house. A notification will be displayed upon entering the house telling you it has been enabled.\r<br />[*]Added shrines for Azura, Mephala, Boethiah, and Nocturnal in the armory area.\r<br />[*]Modified Dark Brotherhood trophy so that a modified version is displayed if the player decided to destroy the Dark Brotherhood instead of joining.\r<br />[*]Slightly moved the smelter in the forge area to avoid clipping with shoveling animation.\r<br />[*]Adjusted lighting to remove excessively dark areas in the house and to illuminate displays more.\r<br />[/list]\r<br />\r<br />Special thanks to [url=http://www.nexusmods.com/skyrim/users/3231858/]Elianora[/url] for some great advice on my last mod and [url=http://www.nexusmods.com/skyrim/users/4672007/]Darkfox127[/url] for his awesome creation kit tutorials&#33;\r<br />\r<br />Special thanks to  [url=http://www.nexusmods.com/skyrim/users/2388835/]Hodilton[/url] and  [url=http://www.nexusmods.com/skyrim/users/5322165/]Ruiuji[/url] for making videos featuring the mod&#33;\r<br />[youtube]h2lFuv9kE7s[/youtube][youtube]5dCSTQmZ2s4[/youtube]\r<br />\r<br />\r<br />[b][size=4]Features:[/size][/b]\r<br />\r<br />[b][size=3]Unlockable Trophies:[/size][/b]\r<br />The player can unlock a total of 24 trophies located on bookshelves in the bedroom.  In order to unlock the trophies you must complete certain quests and any corresponding trophies will be unlocked the next time you enter the house. Simply read the inscriptions to see which quests you need to complete.\r<br />\r<br />[b][size=3]Automatic Sorting:[/size][/b]\r<br />Dragonbridge Retreat also features a sorting system.  The chests are located in either the top floor of the cabin next to the entrance, or next to the exit of the forge area.  To sort your items simply place your items into the sorting chest and they will be immediately moved to the corresponding named storage container.  Even items that can be placed into the special displays will automatically be moved and the display will be updated accordingly. \r<br />\r<br />The sorting should work with items added in other mods if the creators applied the normal keywords to the items such as VendorItemWeapon, VendorItemArmor, WeapTypeStaff, etc.\r<br />\r<br />Note: some items may not be able to be sorted. They will automatically be placed back into your inventory and a notification will appear in the top-left corner of the screen.\r<br />\r<br />[b][size=3]Interactive Displays:[/size][/b]\r<br />Throughout the cabin you may notice various shelves or display cases that can be activated like a normal chest.  There are displays for the dragon claws located in various Nordic ruins, the miscellaneous bug jars that can be found in Skyrim, and the Dragonpriest masks.  These items will be automatically added if placed in the sorting chests.  Otherwise you can activate the display and place the items inside for them to appear on the shelves or in the display case.\r<br />\r<br />Note:  You may have to complete certain quests to be able to remove certain dragon claws from your inventory… or possibly steal one after returning it to its rightful owner.\r<br />\r<br />[b][size=3]Named/Restricted Storage:[/size][/b]\r<br />There are also many named storage containers for specific types of items that work with the sorting system.  These are typically different in appearance to normal Skyrim containers or may not even look like containers at all.  Most of these have item restrictions placed on the chests, so you can only put armor into the armor chest or only weapons into the weapon chest.  Not all chests have these restrictions and there are plenty more storage containers located nearby that you can use for arranging your items.  If an item cannot be placed into a certain chest, it will be placed back into your inventory and a notification will appear in the top-left corner of your screen.\r<br />\r<br />[b][size=3]Other Features:[/size][/b]\r<br />[list]\r<br />[*]8 Interactive planters from the Hearthfire DLC.\r<br />[*]Shrines for the Nine Divines, Nocturnal, Mephala, Boethiah, and Azura.\r<br />[*]Interactive bookshelf.\r<br />[*]Crafting stations.\r<br />[*]15 Weapon racks.\r<br />[*]5 Mannequins.\r<br />[/list]\r<br />\r<br />[b][size=4]Installation/Uninstallation[/size][/b]\r<br />\r<br />Either use the Nexus Mod Manager or for manual installation unzip the contents into your skyrim Data folder.\r<br />NOTE: See the instructions at the top of the page for upgrading from v1.0.\r<br />\r<br />To manually install/uninstall place/delete the following files from your Skyrim Data folder and enable in the Data Files options:\r<br />\r<br />DragonbridgeRetreat.esp\r<br />DragonbridgeRetreat.bsa\r<br />\r<br />[b][size=4]Known Compatibility Issues:[/size][/b]\r<br />[list]\r<br />[*]SOUTH DRAGON BRIDGE - Fight Against the Thalmor IV - (Building/navmesh conflicts)\r<br />[/list]\r<br />Any other mod that edits cell -24, 18 or surrounding cells.",
  "categoryId": "67",
  "version": "1.1",
  "author": "Socharis",
  "createdUnix": "1403831219",
  "updatedUnix": "1406158457",
  "containsAdultContent": false,
  "uploadedBy": "socharis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114725",
      "name": "Dragonbridge Retreat",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "202",
      "fileName": "Dragonbridge Retreat-55312-1-0.7z",
      "uploadedUnix": "1403831215",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f39989c4c28820291b85d0f11a1b612b2cacec5ba09db907e7b1f059d71e0da/analysis/1408149185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonbridge%20Retreat-55312-1-0.7z?fid=1000114725&ttl=1535840028&ri=8192&rs=8192&setec=9e1ccaf750732532742fe0157b269ec1"
    },
    {
      "fileId": "1000118956",
      "name": "Dragonbridge Retreat v1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "261",
      "fileName": "Dragonbridge Retreat v1.1-55312-1-1.7z",
      "uploadedUnix": "1406158457",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1a6f99bba8a084cf1413ccd80cc99faf3c924964d4803f781eb2c03af8e54ab3/analysis/1406158563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonbridge%20Retreat%20v1.1-55312-1-1.7z?fid=1000118956&ttl=1535840028&ri=8192&rs=8192&setec=83d630f4edc8f0d69bd92ebf16377480"
    }
  ]
}