{
  "modId": 55326.0,
  "modName": "No Menu During Combat",
  "summary": "The name says it all - you cannot access in-game menus while you are engaged in combat.",
  "descriptionHtml": "[size=6][center]You should probably look at the [url=http://www.nexusmods.com/skyrim/mods/83379/?]SkyrimSouls [/url]mod instead. ;)[/center][/size]\r<br />\r<br />[u]About...[/u]\r<br />The name says it all - you cannot access in-game menus while you are engaged in combat. I have always found a bit strange how TES characters can just stop the flow of time, heal themselves with potions or even change outfit DURING COMBAT. Skyrim made a huge step ahead and at least dialogues and crafting take place during normal game time but being able to manage equipment during combat still destroys the immersion and thrill of battle. So - because I am weak of spirit and cannot force myself NOT to acces the menu while I can - I created this simple mod which takes that option away.\r<br />\r<br />All menus are disabled with the exception of the System menu so you can stil save and load during combat (not that it can be disabled anyway...). Do note that this also affects the vanilla hotkeys&#33; This effectively makes you unable to change weapon after the combat has started.  If you think that is too hardcore (as it surely is), you can use the group hotkeys (default F1, F2, F3, F4 for groups 1, 2, 3, 4) of the SkyUI favorites menu, they will still work - or I highly recommend you to use [url=http://www.nexusmods.com/skyrim/mods/23416/?]More HotKeys Please[/url] by [b]Spinner385. [/b]\r<br />\r<br />[u]Uninstall[/u]\r<br />If you would like to uninstall, find a safe location (e.g. your house) and make sure you are not in combat or in a quest scene. Then you can save the game and safely remove the mod. If you save the game during combat and uninstall the mod, you will probably not be able to access the menus so be careful&#33; Yeah, and in case nobody told you - make a clean backup save before installing any mod (including this one).",
  "categoryId": "24",
  "version": "1.0",
  "author": "DavidTheFalcon",
  "createdUnix": "1403864219",
  "updatedUnix": "1403863202",
  "containsAdultContent": false,
  "uploadedBy": "DavidTheFalcon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000114759",
      "name": "No Menu During Combat",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "No Menu During Combat-55326-1-0.7z",
      "uploadedUnix": "1403863202",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c0eca3f0c8cd26ae2ae79f2c948b8ee1f13e3ade017c1cb7432c40b88a9ea085/analysis/1408149861/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Menu%20During%20Combat-55326-1-0.7z?fid=1000114759&ttl=1535840048&ri=8192&rs=8192&setec=2888c5830f11ee4cbb4d62b5c8b05e9f"
    }
  ]
}