{
  "modId": 55352.0,
  "modName": "Nens - 2 Player - Skyrim Coop Mod - ALPHA",
  "summary": "This is a Skyrim Coop Mod 2014\r<br />\r<br />This mod allows for a human player to sit beside you and play as a companion ingame, theres ALLOT missing from this mod, 2nd player customization, better combat system, and much more, but this is a light Alpha proof of concept. ",
  "descriptionHtml": "[size=4]\r<br />\r<br />[center]                         Skyrim Couch Coop Mod 2014\r<br />\r<br />Should this mod ever be on a skyrim video, Name is pronounced Nenill - eye, Zill, oh, Dell. I know how name pronunciations can be, and mines not easy xP . And please let me know so I can see = D[/center]\r<br />\r<br />[b][color=#0055FF][size=5][center]DESCRIPTION[/center][/size][/color][/b]\r<br />\r<br />Think of this mod as a Sonic and Tails style mod, which allows the player to plug in a controller and play with a friend, your friend will do nothing more than control your companion.\r<br />\r<br />(Although you can have a player 2 companion AND the normal story companion as to avoid any issues with the story)\r<br />\r<br />[b][color=#0055FF][size=5][center]PLEASE NOTE[/center][/size][/color][/b]\r<br />\r<br />ALPHA roughly means that the file is not ready for use just yet and is still being designed, BETA means it has been designed but is being tested. Version 1.0 and higher means the file is ready to be used and tested, and the author will be making updates. Please understand this file is in ALPHA phase.\r<br />\r<br />[b][color=#0055FF][size=5][center]FEATURES[/center][/size][/color][/b]\r<br />\r<br />This mod allows for a human player to sit beside you and play as a companion ingame, theres ALLOT missing from this mod, 2nd player customization, better combat system, and much more, but this is a light Alpha concept. \r<br />\r<br />I&#39;ve had this mod for over a year now and tweaked it over and over myself, never getting the confidence in it needed to release it because I don&#39;t feel its anywhere near good enough, or enough people even want to see it. But I was talked into releasing it as an alpha phase and once ready if the community likes and supports it, I&#39;ll update it.\r<br />\r<br />Please comment positively, take pictures, endorse , the works  so I know its liked by the community.\r<br />\r<br />Trading with Player 2 can also be done easily as you would with another NPC by the press of a button by them. \r<br />\r<br />Player 2 can attack NPC&#39;s , Objects, and YOU, based off of scripts used for their attacks, so please be cautious as they do hit pretty hard, at least at first, this hasnt been tested with endgame characters.\r<br />\r<br />Player 2 is a default nord female for now, that can be modded with the toolset by appearance and armor, but weapons for now are scripted in and will need updates to allow equipping new things perminantly on the character, you can trade to player 2 but items may not stay on them long, as their natural weapon swap keys tend to delete the items.\r<br />\r<br />This mod is compatible with almost any other mod out there as it uses custom scripts and a custom NPC. \r<br />\r<br />\r<br />[b][color=#0055FF][size=5][center]REQUIRED[/center][/size][/color][/b]\r<br />\r<br />You will need the Most recent version of the Skyrim Script Extender, which you can find here:\r<br />http://skse.silverlock.org/\r<br />\r<br />For now you will need a program to route to your numpad, as the numpad will control the second player, Player 2 can be teleported to you at any time the moment this mod is installed. \r<br />\r<br />Heres a link to a useful proram called Xpadder but any keyboard to joystick program will do:\r<br />http://xpadder.en.malavida.com/\r<br />\r<br />If your using an XBOX controller or a PS3 controller, you should disable the controller so it doesnt control Player 1, The game is fully integrated so your controller effects player one, you&#39;ll need to disable skyrim player 1 controls and route the keys through Xpadder or another program to your numpad.\r<br />\r<br />[b][color=#0055FF][size=5][center]RECOMMENDED[/center][/size][/color][/b]\r<br />A high speed leveling mod like this one below:\r<br />http://www.nexusmods.com/skyrim/mods/50790/?\r<br />\r<br />Leveling in the game is set to slow pace for a single player, but with a friend, grinding can get boring really fast. Its considerable to help speed up gameplay but depends completely on you and your friend. My girlfriend doesnt like to wait when we play.\r<br />\r<br />[line]\r<br />\r<br />[b][color=#0055FF][size=5][center]BASIC CONTROLS[/center][/size][/color][/b]\r<br />\r<br />Numpad Enter = Summons Player 2 at any time\r<br />\r<br />Numpad 8 = UP\r<br />Numpad 2 = DOWN\r<br />Numpad 6 = RIGHT\r<br />Numpad 4 = LEFT\r<br />\r<br />Numpad 7 = ATTACK (Current Equipped weapon\r<br />\r<br />[b][color=#0055FF][size=5][center]AI CONTROL[/center][/size][/color][/b]\r<br />\r<br />Numpad 5 = Follow player like normal companion with extra controls\r<br />\r<br />Numpad 1 = Sneak mode\r<br />\r<br />Numpad 3 = Open Inventory for trade with Player 1\r<br />\r<br />\r<br />[b][color=#0055FF][size=5][center]WEAPON SWAP[/center][/size][/color][/b]\r<br />\r<br />Numpad +   = Weapon Swap (Hold Down and Press Another Key)\r<br />\r<br />Numpad+ & Numpad Enter = SWORD\r<br />Numpad+ & Numpad 7 = HAMMER\r<br />Numpad+ & Numpad / = Dagger\r<br />Numpad+ & Numpad 9 = Mace\r<br />\r<br />[b][color=#0055FF][size=5][center]SPELLS[/center][/size][/color][/b]\r<br />\r<br />Numpad+ & Numpad 8 = FIRE\r<br />Numpad+ & Numpad 6 = ICE\r<br />Numpad+ & Numpad 1 = Shield\r<br />Numpad+ & Numpad 2 = Heal Self (Player 2)\r<br />Numpad+ & Numpad 4 = Heal Other (Player 1)\r<br />\r<br />[line]\r<br />\r<br />[b][color=#0055FF][size=5][center]TROUBLESHOOTING[/center][/size][/color][/b]\r<br />None at this time\r<br />\r<br />[b][color=#0055FF][size=5][center]KNOWN BUGS[/center][/size][/color][/b]\r<br />Many Im sure\r<br />\r<br />[b][color=#0055FF][size=5][center]INSTALLATION[/center][/size][/color][/b]\r<br />Simply put the 2 player mode file inside your data folder in your skyrim directory and your done, activate it and play the game, its only a script and needs no other changes.\r<br />\r<br />[b][color=#0055FF][size=5][center]More about Nenilai[/center][/size][/color][/b]\r<br />I&#39;m a modder who uses creative thought rather than raw code or skill to do things. I would like to clarify that I am not trained, as I have never been able to afford college schooling in any design field(Coding, 3d, etc) everything I&#39;ve learned , be it Animation, C++ Coding, Hex Editing, Sound And Music Creation, 3d Editing, Particle Design, and Texture Mapping etc, has all been on my own, from books and tutorials.. I&#39;ve been messing with games since I was 10 Years old playing around with Game Genie codes on nintendo, and making a Starcraft Website for my guild at 15. Around 18 or so I started Messing with Neverwinter Nights 1 which led to allot of what I learned today.\r<br />\r<br />I don&#39;t like to hear the concept &#34;Can&#39;t Be Done&#34;, even if you have to turn left 3 times to turn right it can be done &gt;_&lt;, so when I saw a forum post over a year ago stating 2 player couch coop couldnt be done in Skyrim, even without ever using the creation kit, and having no clue what Papyrus was, I decided I was going to do it. Unemployed , I make money off of designs I create I don&#39;t get much time to design things I love, but every now and then I suffer the time to work on mods for Skyrim and Neverwinter Nights 1 & 2. Games I&#39;ve always loved. \r<br />\r<br />[/size]",
  "categoryId": "96",
  "version": "0.01",
  "author": "Nenilai Xilodel - Shawn J",
  "createdUnix": "1403959287",
  "updatedUnix": "1404347958",
  "containsAdultContent": false,
  "uploadedBy": "Nenilai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115483",
      "name": "2 Player Coop Mode - ALPHA RELEASE - WORK IN PROGRESS",
      "version": "0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "2 Player Coop Mode - ALPHA RELEASE - WORK IN PROGRESS-55352-0-01.zip",
      "uploadedUnix": "1404249912",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/f1a957f278702442ed4f2f13420570ab287f40bb1ad82460ad00ddee553785fc/analysis/1408156756/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/2%20Player%20Coop%20Mode%20-%20ALPHA%20RELEASE%20-%20WORK%20IN%20PROGRESS-55352-0-01.zip?fid=1000115483&ttl=1535840075&ri=8192&rs=8192&setec=0c603912c90931f9f562158fd53097f2"
    },
    {
      "fileId": "1000115648",
      "name": "Xpadder Profile",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "214",
      "fileName": "Xpadder Profile-55352-1.zip",
      "uploadedUnix": "1404347958",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e400b439087af3c30ede0160ba922dcc79b72ad1caf7b2a461763d8e87b46e15/analysis/1408158365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Xpadder%20Profile-55352-1.zip?fid=1000115648&ttl=1535840076&ri=8192&rs=8192&setec=63657501fc27b1d6240d14ce7a230abd"
    }
  ]
}