{
  "modId": 55376.0,
  "modName": "Ciderhouse Restaurant -- Spanish",
  "summary": "Esta es la traducción de este fantástico mod creado por katixa que te permitirá abrir tu propia sidrería cerca de Carrera Blanca.",
  "descriptionHtml": "Esta es la traducción de este fantástico mod creado por katixa que te permitirá abrir tu propia sidrería cerca de Carrera Blanca.\n<br />\n<br />[center][img]http://centostudios.com/Compatible.png[/img][/center]\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/55496/?]CORRECCIONES Y MEJORAS DE TEXTOS Y VOCES[/url][/center]\n<br />\n<br />Si alguna vez has querido ser un sidrero de tomo y lomo, con este fabuloso mod ahora puedes. \n<br />\n<br />Toma las riendas de un local que nunca llego a ver la luz y ponlo al día. Elabora tu propia sidra desde el principio, recolecta las manzanas, prénsalas, decántalas, ferméntalas y por ultimo embotéllalas. Atrae clientes a tu local, sírveles una buena comida con una deliciosa sidra y recibe pedidos desde todos lados de la provincia. Si ganas el suficiente dinero podrás incluso contratar personal y mejorar la sidrería. \n<br />\n<br />La gran cantidad de opciones de este mod aumenta considerablemente la jugabilidad alternativa de Skyrim.\n<br />\n<br />Para más información, acerca de los requisitos necesarios y características, puedes visitar la página del mod original y ya de paso, reventar el botón de endorse para animar a katixa a que siga creando complementos tan buenos y de calidad como este. ¿¡A qué esperas!? ¡Destroza ese botón! y si de paso lo haces con el mío, pues eso ya sería la leche.\n<br />\n<br />[color=#93c47d]¿Por qué usar mis traducciones?\n<br />\n<br />- Porque no están hechas a base de copiar los textos en traductores online.\n<br />- Porque se usa el sentido común en todo momento para redactar palabras, frases y oraciones.\n<br />- Porque se ajustan fielmente a los conceptos del juego y en general, al mundo de Elder Scroll.\n<br />- Porque se redactan siguiendo nuestras reglas gramaticales y se evita crear frases robotizadas.\n<br />- Porque son actualizadas siempre que sea necesario para corregir errores y establecer mejoras.\n<br />- Porque se ajustan al proyecto \"Correcciones y mejoras de textos y voces\" para lograr una mayor inmersión.\n<br />- Porque todos los textos de configuración y jugabilidad se traducen siempre al 100%.\n<br />- Porque se realizan intencionadamente para que parezcan parte del propio juego y se enlazan conceptos similares con otras traducciones.\n<br />\n<br />Fe de erratas:\n<br />\n<br />Soy consciente que a veces puedo cometer algún error, por lo que si en tus partidas detectas alguna falta de ortografía, algún espacio de más, algo que te suene a chino o quisieras hacerme alguna sugerencia respecto a alguna frase traducida, no dudes en comentármelo. ¡Tu ayuda será siempre bien recibida![/color]\n<br />\n<br />¡Que lo disfrutes!\n<br />\n<br />[color=#f6b26b]¡Ah! y no te olvides de estas[/color] [url=http://www.nexusmods.com/skyrim/users/3198127/?tb=mods&amp;pUp=1]otras traducciones[/url][color=#f6b26b].[/color]\n<br />\n<br />[center][img]http://centostudios.com/Imagen.png[/img][/center]",
  "categoryId": "22",
  "version": "1.6.0",
  "author": "supercento",
  "createdUnix": "1403983696",
  "updatedUnix": "1430307295",
  "containsAdultContent": false,
  "uploadedBy": "supercento",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000157801",
      "name": "Ciderhouse Restaurant",
      "version": "1.6.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "170",
      "fileName": "Ciderhouse Restaurant-55376-1-6-0.rar",
      "uploadedUnix": "1430307295",
      "modVersion": "1.6.0",
      "virusScanUrl": "https://www.virustotal.com/file/1c22f734d41847bf0908c5677f8eaae6e820d5ab01552aabdec93c53ff476069/analysis/1430307303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ciderhouse%20Restaurant-55376-1-6-0.rar?fid=1000157801&ttl=1535840110&ri=8192&rs=8192&setec=6257963d65b10e9e57a14f4aabab4a2c"
    }
  ]
}