{
  "modId": 55396.0,
  "modName": "Toxicity - A Witcher-like Toxicity System",
  "summary": "Adds a toxicity value to consuming potions based on the strength of the potion and effect types. Works with any potions from any mods. High toxicity produce visual effects and drunkenness. This put a soft limit on the number of potion that can be consumed in a row.",
  "descriptionHtml": "[size=6][b]MOD DESCRIPTION[/b][/size]\r<br />Let&#39;s face it, the vanilla alchemy system is poorly designed. Too many potions that do not have any impact, duration so short that it makes many of them useless and instant spam-able potions can be used as a cheat for infinite attribute. This mod doesn&#39;t solve all of these issues by itself, but it&#39;s a start.\r<br />First it adds a dynamic toxicity system that effectively limits the number of potions the player can ingest in a given amount of time. It also works with any potion and alchemy rebalance because it doesn&#39;t change any potion value and effects, and works for all effects (even from other mods) since it attributes toxicity values dynamically. The toxicity value of a given potion depends on the poison resistance of the character, giving a lot more meaning to racial poison resistance and the snakeblood perk (there are barely any poison in vanilla and they are very weak). Also, drinking poison resistance potion will effectively reduce the toxicity and subsequent potion producing interesting gameplay strategic choice. Finally, toxicity diminishes over time with a configurable half-life and can be further reduced by drinking &#34;Cure Poison&#34; potion (this is the only effect modified by this mod since it is mistakenly not keyworded as a potion).\r<br />\r<br />[size=6][b]FEATURES[/b][/size]\r<br />-This mod does NOT modify any potion effects and attributes (the only exception is the potion of cure poison which is incorrectly keyworded in the vanilla game and hasn&#39;t been fixed by the unofficial patch at the time of writing). It give a toxicity value to potion dynamically and, as a result, it&#39;ll work with any potion, from any mods and with any effects. Therefore, any potion overhaul can be used with Toxicity and there will never be a need to patch.\r<br />-An auto-hidding sleek UI Toxicity widget\r<br />-Toxicity visual effect start to appear at half toxicity and smoothly increases over time. They are not too intrusive at first but start to be significant when close to 100% toxicity.\r<br />-Overdose impairment in the form of random tripping: you might fall prone on the ground if toxicity is greater than 100%.\r<br />-Drinking potion increases alchemy skill slowly based on the potion strength.\r<br />-Many of the features: toxicity widget, message, visual effects, condition effects and timescale are configurable in the MCM menu \r<br />\r<br />[size=6][b]RECOMMENDED MODS[/b][/size]\r<br />I started using [url=http://www.nexusmods.com/skyrim/mods/35124/?]Alchemy and Food Balanced Overhaul[/url] recently for alchemy rebalance and so far I like it. It is a set of minimalistic and effective tweaks and provides restore attribute over time, which is a must have. I have also used [url=http://www.nexusmods.com/skyrim/mods/11481/?]Phitts Alchemy and Food Overhaul[/url] for a long time and it still works fine even though it hasn&#39;t been updated in a long time. \r<br />I would also point the reader to [url=http://www.nexusmods.com/skyrim/mods/45654/?]Useful Potions[/url] which is an under-endorsed mod that also implement a toxicity system, along with many other gameplay tweaks to potions.\r<br />I&#39;m sure many other potion overhaul are quite adequate and that other have implemented toxicity systems. This mod is compatible with any of them although it may make some gameplay effect redundant.\r<br />  \r<br />[size=6][b]INSTALLATION[/b][/size]\r<br />As usual. Require SKSE 1.7.\r<br />Activate the mod in the Config menu after installation.\r<br />\r<br />[size=6][b]ACKNOWLEDGMENTS:[/b][/size]\r<br />Bethesda for creating Skyrim and the Elder Scrolls series\r<br />\r<br />[size=6][b]MY OTHER MODS:[/b][/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/45894/?]Death Alternative - Your Money or Your Life[/url] An extensive and expansive alternative to death scenario framework\r<br />[url=http://www.nexusmods.com/skyrim/mods/54867/?]Death Alternative - Captured[/url] Extra scenarios involving capture and enslavement of the PC.\r<br />[url=http://www.nexusmods.com/skyrim/mods/50546/?]Alternative Crafting System - I don&#39;t want to be a blacksmith[/url] Smiths can craft any item for you.\r<br />[url=http://www.nexusmods.com/skyrim/mods/50589/?]Functional Bags[/url] Add functional bags and items to Skyrim.",
  "categoryId": "24",
  "version": "1.2",
  "author": "BralorMarr",
  "createdUnix": "1404032360",
  "updatedUnix": "1421953763",
  "containsAdultContent": false,
  "uploadedBy": "BralorMarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115093",
      "name": "Toxicity",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "44",
      "fileName": "Toxicity-55396-1-0.7z",
      "uploadedUnix": "1404032179",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/82fc0e1e2d78e998171c6a4c171c20e4c11f211a21039e0e5221209908143a31/analysis/1408152792/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Toxicity-55396-1-0.7z?fid=1000115093&ttl=1535840134&ri=8192&rs=8192&setec=7b030d6d46c8c63cd23445b0cb296336"
    },
    {
      "fileId": "1000116286",
      "name": "Toxicity",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "44",
      "fileName": "Toxicity-55396-1-01.7z",
      "uploadedUnix": "1404717058",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/1a9eff39dc03de4dda2380bdd61e76fcb110c643d2c94182711e696898e1bc7f/analysis/1408165335/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Toxicity-55396-1-01.7z?fid=1000116286&ttl=1535840135&ri=8192&rs=8192&setec=e464d835e96100284545550a38d75414"
    },
    {
      "fileId": "1000144079",
      "name": "Toxicity",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46",
      "fileName": "Toxicity-55396-1-2.7z",
      "uploadedUnix": "1421953763",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4f2b1d0e2269826325c5e92d9e62ea6a0d393eeb9d976d1374288b11d164ff0c/analysis/1421953802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Toxicity-55396-1-2.7z?fid=1000144079&ttl=1535840135&ri=8192&rs=8192&setec=a315e35ef98f18cf1f2bb594cacf4bf2"
    }
  ]
}