{
  "modId": 55403.0,
  "modName": "Skyrim Project Stability - FR - en cours de traduction",
  "summary": "Tutoriel étape par étape afin de réduire le nombre de crash et de freezes à une valeur proche de zéro.  (Traduction Française de Skyrim Project Stability par GrandBulwark)",
  "descriptionHtml": "Avant-propos:\r<br />\r<br />Je tiens à préciser que ce guide n&#39;est en aucun cas une réalisation de ma part. Son créateur est [url=http://www.nexusmods.com/skyrim/users/6137612/?]GrandBulwark[/url], je n&#39;ai fait que traduire son guide [url=http://www.nexusmods.com/skyrim/mods/32363/?]Skyrim Project Stability[/url]. C&#39;est pourquoi tous les honneurs lui reviennent si ce guide ci vous a été utile.\r<br />Marenkai\r<br />\r<br />[img]http://x3.fjcdn.com/comments/forgot+this+_218cac352a40d5c41b8d8b43d98e91bd.jpg[/img]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/6137612/?]GrandBulwark[/url]: créateur, unique auteur, éditeur et compileur\r<br />Marenkai: traducteur français\r<br />\r<br />[u][color=yellow]A LIRE:\r<br />ce guide n&#39;étant qu&#39;une traduction je vous invite à aller approuver (Endorse) le guide original disponible ici :[/color][/u][url=http://www.nexusmods.com/skyrim/mods/32363/?]Skyrim Project Stability[/url]\r<br />[u][color=yellow]Pour ce faire il vous suffit de télécharger le petit fichier (0ko) disponible dans la section Main Files de la page Nexus du guide[/color][/u]\r<br />\r<br />Autres Mods de l&#39;auteur:\r<br />[url=http://www.nexusmods.com/skyrim/mods/54784/?]Followers Share Knowledge[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/54574/?]Conjurer&#39;s Friend[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/54577/?]Creatures of the Night Revised[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/54650/?]Immersive Armors for NPCs Revisited[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/55320/?]8-bit Skyrim Theme Music[/url]\r<br />\r<br />*******************************************************************************************************************************************\r<br />\r<br />[color=green][size=15]Table des Matières[/size][/color]\r<br />\r<br />Code couleur du guide:\r<br />[color=green]Parties[/color]\r<br />[color=orange]Sous-Parties[/color]\r<br />[color=yellow][u]Informations essentielles à lire attentivement[/u][/color]\r<br />[url=http://www.nexusmods.com/skyrim/Images/294604/?]Liens vers les références ou les utilitaires[/url]\r<br />\r<br />Partie 1 : Introduction (optionnel)\r<br />    * 1A: Ce qu&#39;est ce guide\r<br />    * 1B: Ce que ce guide n&#39;est pas\r<br />\r<br />Partie 2: Informations complémentaires\r<br />\r<br />Partie 3: Optimiser son ordinateur\r<br />     * 3A: Démarrage\r<br />     * 3B: Services\r<br />     * 3C: Maintenance et Nettoyage\r<br />\r<br />Partie 4: Les optimisations liées à Skyrim\r<br />     * 4A: La bonne façon de modder son jeu\r<br />     * 4B: Ordre des Mods / Gestionnaire de Mods\r<br />     * 4C: Les Patchs Non-Officiels, SKSE, STEP et SkyProc\r<br />     * 4D: Mods comportant des problèmes non résolus\r<br />     * 4E: Le Sur-Moddage\r<br />     * 4F: Les problèmes des fichiers *.ini\r<br />     * 4G: Debug Du Papyrus\r<br />     * 4H: Tester la stabilité de sa sauvegarde\r<br />\r<br />Partie 5: Gestion de la mémoire\r<br />\r<br />Partie 6: Optimisation de son processeur\r<br />     * 6A: Libérer les coeurs de son processeur\r<br />     * 6B: Mode économie d&#39;énergie/ Mode de veille hybride\r<br />     * 6C: Astuce pour le Clock du processeur\r<br />\r<br />Partie 7: FAQ\r<br />     * 7A: FAQ\r<br />\r<br />Partie 8: Conclusion\r<br />\r<br />*******************************************************************************************************************************************\r<br />\r<br />[color=green][size=15]Partie 1: Introduction[/size][/color]\r<br />\r<br />Avant tout soyons réalistes: si vous suivez ce guide vous éliminerez tous les freezes liés à des problèmes de mémoire. Faites en l&#39;expérience et ensuite faites le savoir autour de vous. Il y a encore des milliers de personnes qui aimeraient jouer à Skyrim avec plein de Mods mais qui souffrent de problèmes d&#39;instabilité, de freezes, de crash et de bugs en tout genre.\r<br />\r<br />[color=yellow][u]Il est important de noter que tous les freezes ne sont pas dûs à un problème d&#39;utilisation de la mémoire par le système[/u][/color]. Il y encore les problèmes de conflits entre mods, des erreurs de script et d&#39;autres soucis à prendre en considération. Avec une liste de mods à jour (correspondant à votre version de Skyrim) vous ne devriez plus faire les frais de freezes intenpestifs ou de crashs liés à des problèmes de mémoire.\r<br />\r<br />[color=orange][size=13]1A: Ce qu&#39;est ce guide[/size][/color]\r<br />\r<br />Ce guide est une liste des différents utilitaires et des différentes techniques qui feront TOUJOURS de Skyrim un environnement plus stable. Ces techniques marchent de la même manière pour les petites configurations et les configurations de PC Gamer haut de gamme. il est basé sur l&#39;utilisation de Windows 7 mais devrait aussi fonctionner sur les autres systèmes d&#39;exploitation.\r<br />\r<br />Ce guide ne vous montrera pas seulement comment optimiser votre ordre de chargement de vos mods et leur nettoyage; il se concentre surtout sur l&#39;optimation complète de votre système.\r<br />\r<br />[color=orange][size=13]1B: Ce que ce guide n&#39;est pas[/size][/color]\r<br />\r<br />Ce guide n&#39;a strictement rien à voir avec les graphiqsmes, l&#39;immersion, les scripts ou encore cette armure qui donne un air trop sexy à votre Prêtresse Hybride-Dremora/Orc. En réalité ce guide ne modifie en rien tous les aspects du jeu. Comme toutes choses, la plupart des erreurs ne sont pas le fruit d&#39;une erreur de programmation mais plutôt celui d&#39;une erreur d&#39;utilisation. Ces techniques vous permettront de corriger beaucoup d&#39;erreurs  que vous auriez pu faire durant l&#39;amélioration de votre éxpérience de jeu sur Skyrim.\r<br />\r<br />Ce guide n&#39;est PAS une substitution à l&#39;achat d&#39;un processeur plus performant ou d&#39;une carte graphique plus puissante. Ce n&#39;est pas non plus un guide qui vous permettra de corriger TOUS vos problèmes de crash ou de freezes. C&#39;est tout simplement un guide d&#39;apprentissage pour prendre soin de son sytème d&#39;exploitation et de votre installation Steam de the Elder Scrolls V: Skyrim. [color=yellow][u]Certaines démarches nécessiteront des compétences plus ou moins avancés, soyez donc sûrs de lire attentivement la manière de procéder.[/u][/color]\r<br />\r<br />*******************************************************************************************************************************************\r<br />\r<br />[color=green][size=15]Partie 2: Informations complémentaires[/size][/color]\r<br />\r<br />Et voilà, nous y sommes encore une fois &#33; Encore un moyen de rendre Skyrim plus stable. Il éxiste une multitude d&#39;astuces plus ou moins farfelues,de techniques et de mods qui promettent ce résultat. Cependant il faut retenir que certaines choses marchent pour certaines configurations, et d&#39;autres choses non. Les promesses offertes par les différentes choses proposées un peu partout sont subjectives. J&#39;ai fait tout mon possible pour maintenir une approche objective: plusieurs des progammes  utilisés dans ce guide ne sont pas dépendants de votre configuration. La quasi-totalité des astuces présentées marcheront pour vous, et si ce n&#39;est pas le cas cela sera clairement spécifié.\r<br />\r<br />Avant toutes choses, ceci n&#39;est PAS un autre guide qui vous dira comment diminuer vos options graphiques pour grapiller quelques FPS. Il en éxiste déjà beaucoup trop partout sur le net et tout le monde en a très certainement déjà testé un. Les personnes ayant des problèmes liés à des machines très peu performantes ou en dessous de la moyenne n&#39;aurant peut être pas d&#39;augmentation significative des performances, du moins pas selon les standards de Skyrim. Les personnes fonctionnant sous ce genre de configuration devront certainement lancer leurs jeux en basse qualité.\r<br />Avant de continuer, laissez moi poster mes configurations depuis que j&#39;ai commencé à jouer à Skyrim en 2011:\r<br />\r<br />Vieux PC:\r<br />Intel core 2 duo 3.3 Ghz\r<br />Integrated G41 graphics chip\r<br />Caviar Green 1 TB HDD\r<br />3 gigs of 1333 RAM\r<br />\r<br />[i]Note du traducteur: Je post aussi ma configuration qui n&#39;a plus de soucis de freezes ou de crash depuis l&#39;utilisation de ce guide\r<br />Intel i5-4670 3.4Ghz\r<br />nVidia ASUS GTX 770 2Go DDR5 avec les drivers toujours à jour.\r<br />8Go de RAM DDR3\r<br />SSD Toshiba 240Go (Windows 7 + logiciels)\r<br />WD Caviar blue 1 To (Données + jeux)[/i]\r<br />\r<br />Mon PC fait maison:\r<br />AMD FX 8350 4Ghz OC&#39;ed to 4.5ghz\r<br />Nvidia EVGA 670 FTW 2 gig DDR5 avec les drivers toujours à jour (même en bêta)\r<br />16Gbs of DDR3 1600 RAM overclocké à 1680\r<br />Caviar Black 2 TB HDD (Windows 7 Ultimate)\r<br />Seagate Barracuda 250 Gig HDD (Backups)\r<br />Seagate Barracuda 80 Gig HDD\r<br />\r<br />Comme vous pouvez le constater j&#39;ai été des deux côtés de la balance et j&#39;ai TOUT éssayé pour faire en sorte que Skyrim fonctionne convenablement. Actuellement je suis en paramètres Ultra de base avec plus de 150 mods de textures HD (2048 et quelques unes en 1024) qui couvrent tous les aspects du jeu. Presque aucune texture n&#39;est en 512.\r<br />\r<br />Maintenant nous approchons de la racine du problème... Même avec un PC ultra performant, les *.exe de Skyrim ont un problème sournois: une fuite de mémoire (RAM). Pour ceux qui ne ne savent pas, ce la signifie que le jeu à un souci quant à la suppression des données qu&#39;il n&#39;a plus besoin dans la RAM. Les données s&#39;accumulent de plus en plus et on commence à sentir un certain lag. Quand ces données chargées dans la RAM approchent les 3.2Go, le jeu freeze. Ce n&#39;est pas quelque chose qui peut se résoudre facilement mais j&#39;ai trouvé un moyen de supprimer ce problème. Supprimer n&#39;est peut être pas le mot juste, &#34;traiter&#34; serait plus exact.\r<br />\r<br />Dans les faits il se pourrait que ce ne soit pas le résultat d&#39;une fuite de mémoire, cela pourrait juste être un codage mal fait ou l&#39;introduction de nombreuses éditions et/ou de nombreux scripts dans une même sauvegarde. Ce problème est aussi présent dans Skyrim Vanilla mais l&#39;ajout de nombreuses textures HD peut sévèrement aggraver la situation.\r<br />\r<br />Pour plus d&#39;informations rendez-vous [url=http://forums.bethsoft.com/topic/1298690-confirmation-of-memory-leak/]ICI[/url] (lien en anglais). Même s&#39;il est vieux, le même test peut être réalisé aujourd&#39;hui avec les mêmes résultats. Bethesda l&#39;a reconnu, cependant aucun de leur patch n&#39;a été pensé pour résoudre le problème.\r<br />\r<br />Ce guide se concentre sur la modification de cette limitation.\r<br />*******************************************************************************************************************************************\r<br />\r<br />[color=green][size=15]Partie 3: Optimiser son Ordinateur[/size][/color]\r<br />\r<br />[color=orange][size=13]3A: Démarrage[/size][/color]\r<br />\r<br />Votre PC est-il réactif sous windows ? Fonctionne-t-il parfaitement sans problèmes particuliers à noter ? Ou peut-être ne les avez-vous pas encore découverts. Skyrim, lui, les remarque, ou du moins ses performances en souffrent. Combien de processus pensez-vous faire tourner et dont vous n&#39;avez pas [i]besoin[/i] ? Combien de programmes/utilitaires démarrent en même temps que votre ordinateur ? Si vous n&#39;avez pas encore fouillé de ce côté là avant, alors il risque d&#39;y avoir plusieurs problèmes dont vous n&#39;avez même pas conscience et que nous règleront par un simple réglage Windows.\r<br />\r<br />     * Cliquez sur &#34;Démarrer&#34;\r<br />     * Cliquer sur la commande &#34;Excécuter...&#34;\r<br />NB: Si cette commande n&#39;est pas présente, pas de panique &#33; Faites un clique droit sur le panneau du menu démarrer (à côté de votre image de session par exemple) puis cliquez sur propriétés. Dans la boîte de dialogue qui vient de s&#39;ouvrir allez dans l&#39;onglet &#34;Menu Démarrer&#34; puis &#34;Personnaliser...&#34;. Dans le menu déroulant il vous suffit d&#39;activer la ligne &#34;Commande Excécuter&#34;\r<br />     * Dans la boîte de dialogue taper: [i]msconfig[/i]\r<br />     * Allez ensuite dans l&#39;onglet &#34;Démarrage\r<br />     * Maintenant il vous suffit de décocher les cases des programmes qui n&#39;ont pas besoin de se lancer en même temps que le démarrage de votre ordinateur (programmes, utilitaires etc.)\r<br />     * Ensuite faites une recherche Google pour chacun des autres processus afin de savoir si vous pouvez ou non les enlevez du démarrage de Windows\r<br />\r<br />[color=yellow][u]Désactiver ces programmes du processus de démarrage Windows ne permet pas de les empêcher de se lancer sous d&#39;autres conditions (action volontaire de votre part, ou bien association du programme avec un fichier à ouvrir par exemple), cela les empêche juste de se lancer en même temps que votre PC. Tous les programmes pourront donc être utilisés normalement si le besoin s&#39;en fait sentir.[/u][/color]\r<br />\r<br />[color=orange][size=13]3B: Services[/size][/color]\r<br />\r<br />Similairement aux programmes lancés au démarrage, les services sont des processus que Windows ou un programme/utilitaire installé peut lancer en tâche de fond. Certains d&#39;entres eux sont extrêmement important pour la stabilité du système et d&#39;autres sont inutiles pour la plupart des utilisateurs. Attention, il y a bien entendu beaucoup d&#39;autres guides qui vous donneront des noms de Services à désactiver sans danger. Ceux-ci sont juste ceux que je passe en manuel et je recommanderai à tout le monde d&#39;en faire autant.\r<br />\r<br />[color=yellow][u]ATTENTION:\r<br />Si vous allez chercher sur internet quels Services sont sans dangers, faites bien attention à vérifier que vous prenez vos exemples d&#39;une source sûre. Mon conseil serait de ne pas trop y toucher de peur de rendre votre système instable. Surtout ne jamais DESACTIVER quoi que ce soit (mis à part les thèmes), mettez les plutôts en mode manuel; et si vous ne savez pas ce que le Service fait exactement, laissez le tranquille &#33;[/u][/color]\r<br />\r<br />     * Tapez [i]services[/i] dans la recherche Windows\r<br />     * Cliquez sur [i]Services[/i]\r<br />\r<br />D&#39;après Vishal voici les Services qui peuvent être passer en [color=yellow][u]MANUEL[/u][/color]:\r<br />\r<br />[i]Expérience d&#39;Application\r<br />Gestionnaire de session du gestionnaire de fenêtrage (uniquement si vous n&#39;utilisez pas le thème Aero)\r<br />Assistance IP\r<br />Client de suivi de lien distribué\r<br />Service d&#39;énumérateur d&#39;apparail mobile\r<br />Service de Stratégie de diagnostique\r<br />Fichiers Hors-Connexion\r<br />Spouleur d&#39;impression\r<br />Registre à distance (laissez toujours celui-ci désactiver pour des raisons de sécurité)\r<br />Ouverture de Session secondaire\r<br />Centre de sécurité\r<br />Serveur (si votre orfinateur n&#39;est connecté à aucun réseau)\r<br />Tableau de saisie Tablet PC\r<br />Themes (seulement si vous utilisez le Theme Windows Classic)\r<br />Service de rapport d&#39;erreurs Windows\r<br />Service de reception Windows Media Center\r<br />Windows Search (seulement si vous n&#39;utilisez pas la fonction de recherche fréquemment)\r<br />Temps Windows (seulement si vous n&#39;utilisez pas la synchronisation de l&#39;horloge par internet)\r<br />Assistance NetBIOS sur TCP/IP[/i]\r<br />\r<br />Note: Il y a aussi ces deux là dont je n&#39;ai pas trouvé l&#39;équivalent dans les Services, si quelqu&#39;un les trouve qu&#39;il le fasse savoir, merci :)\r<br />Computer Browser (uniquement si votre ordinateur n&#39;est pas connecté à un réseau)\r<br />Protected Storage\r<br />\r<br />[color=orange][size=13]3C: Nettoyage et Maintenance[/size][/color]\r<br />\r<br />Utilisez vous les programmes par défaut de Windows pour défragmenter, nettoyer vos disques ou encore supprimer des programmes ? Si vous ne les utilisez pas (ou n&#39;utilisez pas d&#39;équivalents) alors vous avez des soucis à vous faire. Même s&#39;il éxiste des programmes étant LARGEMENT mieux que ceux proposés par défaut avec Windows, c&#39;est quand même mieux que rien. Si vous les utilisiez déjà, laissez moi vous proposer quelques programmes tout de même bien meilleurs, plus rapides et surtout plus efficaces que ceux par défaut. Si en revanche vous ne les utilisiez pas... Pour l&#39;amour de Talos &#33;&#33; Empressez vous de lire cette partie &#33;\r<br />\r<br />[color=yellow][u]********Utilisateurs de SSD: NE JAMAIS DEFRAGMENTER &#33;&#33;&#33;********\r<br />plus d&#39;informations[/u][/color] [url=http://helpdeskgeek.com/featured-posts/should-you-defrag-an-ssd/]ICI[/url]\r<br />[color=yellow][u]Veuillez noter qu&#39;il éxiste  d&#39;autres alternatives, MAIS peut importe ce que vous choisissez, BANNISSEZ COMPLETEMENT l&#39;utilisation des programmes par défaut de Windows pour défragmenter, nettoyer ou supprimer des programmes.[/u][/color]\r<br />\r<br />[url=http://www.piriform.com/ccleaner/download]CCleaner[/url]\r<br />CCleaner est le meilleur nettoyeur de disques.registres qui peut éxister actuellement. C&#39;est aussi le seul ne limitant pas les possibilités de nettoyage. Pour ce guide, le nettoyage avec les paramètres par défaut suffira. [color=yellow][u]L&#39;optimisation du registre est déconseillée car elle a une infime possibilité de complètement ruiner votre ordinateur (mieux vaut être prudent). Si vous devez l&#39;utiliser, faites D&#39;ABORD un point de restauration Windows au cas où les choses iraient mal[/u][/color]\r<br />\r<br />[url=http://www.mydefrag.com/]MyDefrag[/url]\r<br />Léger, rapide et efficace. Un des meilleurs pour la défragmentation.\r<br />Pour les utilisateurs de HDD: lancez &#34;Systeme Disk Monthly&#34; ou bien &#34;System Disk Weekly&#34; si votre ordinateur neuf (moins d&#39;un mois)\r<br />[color=yellow][u]Pour les utilisateurs de SSD: Si Windows est installé sur un SSD et vos jeux/données sur un HDD à part, faites : &#34;Data Disk Monthly&#34; ou bien &#34;Data Disk Weekly&#34; si votre PC à moins d&#39;un mois[/u][/color]\r<br />Mon conseil serait de faire un &#34;Monthly&#34; dès que vous avez le logiciel (sauf si votre PC à moins d&#39;un mois) puis d&#39;attendre un mois et d&#39;ensuite faire des nettoyages chaque semaine (&#34;Weekly&#34;) si vous utilisez beaucoup votre ordinateur. (Si il n&#39;est pas beaucoup utilisé, un &#34;Monthly&#34; une fois par mois devrait suffir)\r<br />\r<br />[url=http://www.revouninstaller.com/revo_uninstaller_free_download.html]Revo Uninstaller[/url]\r<br />Un très bon utilitaire si vous voulez supprimer des programmes dont vous n&#39;avez plus besoin. Il permet de supprimer les fichiers principaux du programmes puis il scanne la structure des fichiers et des registres pour supprimer toutes les traces du programme. Ce programme est un must-have si vous voulez optimiser votre PC.\r<br />\r<br />[url=http://www.jam-software.com/treesize_free/]Tree Size[/url]\r<br />L&#39;explorateur Windows peut se faire vieux. Tant de dossiers, de sous dossiers, de fichiers et documents, il est presque impossible de garder une fluidité de tous les instants avec un ordinateur se faisant vieux. Ce programme est un petit bijou: is affiche TOUT le contenu de vos HDD et SSD dans une arborescence agréable et rapide. Depuis ce menu vous pouvez déplacer, supprimer et renommer des fichiers. [color=yellow][u]Attention: si vous lancer ce programme en tant qu&#39;Administrateur il vous permettra d&#39;avoir accès à tous les fichiers système Windows et les fichiers cachés. Ni GrandBulwark, ni moi même ne pourront être tenu pour responsable si vous supprimez des fichiers nécessaire au bon fonctionnement de votre machine. Ignorez cet avertissement à vos risques et périls.[/u][/color]\r<br />\r<br />*******************************************************************************************************************************************\r<br />\r<br />\r<br />[color=green][size=15]Partie 4: Les optimisations liées à Skyrim[/size][/color]\r<br />\r<br />Avant de commencer sachez que cette partie est essentielle à la stabilité de vos Playthroughs. Certaines personnes peuvent avoir la chance de jouer de manière stable et fluide dès leur premier essai mais ce n&#39;est malheureusement pas le cas de tout le monde. Les problèmes menant à l&#39;instabilité et aux crash sont cumulatifs: le problème principal des gens ayant intallé des mods est évidemment les conflits et l&#39;ordre dans lequel ils sont chargés au lancement du jeu. Mais un autre souci vient se greffer là dessus: la gestion des scripts de Skyrim est bordélique &#33;\r<br />Commencons donc par le commencement.\r<br />\r<br />The Elder Scrolls V: Skyrim n&#39;est pas comme les autres The Elder Scrolls ou bien les jeux Fallout de Bethesda avec lesquels vous pouviez tout simplement ajouter et retirer des modules (.esp , .esm , plugins , mods etc.) de votre sauvegarde et continuer à jouer sur celle-ci.\r<br />\r<br />Tout d&#39;abord il vous faudra choisir un utilitaire pour gérer vos mods. Personnelement j&#39;utilise  Mod Organizer pour les classer et Wrye Bash pour créer les patchs.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/modmanager/?]Nexus Mod Manager[/url]\r<br />Certainement l&#39;utilitaire le plus populaire pour classer les Mods. Il vous permet de créer des catégories, profiles et il gère les mises à jour de mods.\r<br />[color=yellow][u]NB: Sur la page du guide original vous trouverez des tutoriaux en vidéos pour vous aider à utiliser certains des logiciels présents dans cette section. Même si votre maîtrise de l&#39;anglais n&#39;est pas parfaite, je vous invite à y faire un tour ne serait-ce que pour regarder comment il s&#39;y prend. Sinon d&#39;autres vidéos existent certainement en Français sur YouTube.[/u][/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/1334/?]Mod Organizer[/url]\r<br />Mon préféré. Cet utilitaire offre de nombreuses fonctionnalités et a une courbe d&#39;apprentissage plus haute que NMM. Cependant, il un répertoir virtuel qui donne à chaque mod son propre sous dossier. Vous pouvez donner des priorités aux mods pour savoir quel mod supprimera lequel en jeu, mais il n&#39;y aura jamais de déletion physique du mod. Il peut aussi être réglé pour extraire automatiquement les fichiers BSA.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/1840/?]Wrye Bash[/url]\r<br />Je recommande fortement l&#39;utilisation de cet utilitaire. Je ne l&#39;ai pas testé en tant que classeur de mods. Cependant, il est essentiel que vous ayez ce programme pour les Patchs Bash que nous verrons plus tard. J&#39;ai entendu dire que les personnes expérimentés avaient réussi à faire des choses géniales avec ce logiciel, mais je n&#39;est pas encore exploré toutes ses options.\r<br />\r<br />[color=yellow][u]Note: NMM devrait être considéré comme le plus facile d&#39;utilisation. Pour les personnes voulant juste jouer au jeu sans se prendre la tête, NMM est votre ami. Je conseille aux utilisateurs plus aguéris de se tourner vers MO qui est plus fiable et il est plus facile de voir ce qui affecte réellement votre jeu.[/u][/color]\r<br />\r<br />[color=orange][size=13]4A: Le bonne façon de modder son jeu[/size][/color]\r<br />\r<br />Cette section est probablement la plus utile pour tout les modders amateur.\r<br />\r<br />Les mesures préventives sont souvent un sujet négligé par les joueurs. Il est beaucoup plus facile d&#39;éviter un problème que d&#39;avoir à en gérer un &#33; Il est aussi plus aisé de savoir ce qui fait planter votre jeu si vou avez d&#39;abord pris quelques mesures préventives.\r<br />\r<br />Commençons par l&#39;ajout de Mods; c&#39;est d&#39;ailleurs ce pour quoi nous sommes tous ici &#33; Ajouter de nouveaux Mods est quelque chose de vraiment génial &#33; Malheureusement ils peuvent aussi corrompre votre sauvegarde si vous n&#39;êtes pas prudents. La plupart d&#39;entre nous à une liste définie de mods et un personnage qui en dépend. Ne JAMAIS retirer des mods qui ont été utilisé sur une de vos sauvegarde à moins que vous ayez l&#39;intention de recommencer avec une sauvegarde [i]propre[/i]. Les exceptions sont les suivantes:\r<br />       * Textures et Meshes\r<br />       * Les petits mods sans scripts (non recommandé si votre liste de mods est longue)\r<br />\r<br />[color=yellow][u]Ne soyez pas trompés par tous les utilitaires qui vous promettent de &#34;nettoyer&#34; votre jeu ou vos sauvegardes. Une sauvegarde propre ne peut être réalisée qu&#39;en recommençant manuellement le jeu.[/u][/color]\r<br />\r<br />Maintenant considérons le fait que vous vouliez ajouter un mod dans une partie en cours. C&#39;est généralement sans dangers mais cela dépend du type de mods. Les modifications massives des scripts sont fortement déconseillées en milieu de jeu (ex: [url=http://www.nexusmods.com/skyrim/mods/37216/?]Apollodown&#39;s Civil War Overhaul[/url]). Il est toujours préférable d&#39;avoir une sauvegarde de secours sur laquelle reprendre sa partie au cas où des problèmes seraient créés par cotre ajout. Voici ma procedure de de création d&#39;une sauvegarde de secours:\r<br />     * ouvrir votre dernière sauvegarde SANS ajouter le mod\r<br />     * Appuyez sur [b]²[/b] pour ouvrir la console\r<br />     * Tapez ceci:      save &#34;Backup Save&#34;\r<br />     * Appuyez sur Entrer\r<br />     * Vérifiez qu&#39;une sauvegarde nommée &#34;Backup Save&#34; à été créée\r<br />     * Quittez le jeu et ajoutez vos Mods\r<br />     * Classez vos mods avec LOOT ou manuellement\r<br />     * Activez les Mods\r<br />     * Lancer votre jeu sur votre dernière sauvegarde\r<br />     * Si il plante, vous pourrez repprendre depuis votre sauvegarde de secours en n&#39;oubliant pas de retirer les Mods &#33;\r<br />\r<br />Maintenant parlons un peu de la mise à jour de mods. Comme vous le savez sans doutes tous, de nombreux créateurs de mods continuent de sortir de nouvelles versions de leurs mods. Il est assez délicat de savoir exactement ce qui a été modifié et ce qui a été complètement supprimé. Avec des petits mods vous ne devriez pas avoir de problèmes en faisant la mise à jour tant que vous serez LOIN de l&#39;endroit où s&#39;applique la mise à jour (si un mod modifie quelque chose à Blancherive, allez à Solitude avant de faire la mise à jour par exemple). Les types de mods suivant n&#39;ont pas une procedure de mise à jour fiable pour quelqu&#39;un en plein milieu d&#39;un playthrough:\r<br />    * les mods à gros scripts, à moins que l&#39;auteur ne précise le contraire\r<br />    * les mods comportant des éditions massives de l&#39;espace\r<br />    * les mods modifiant l&#39;endroit où vous vous trouvez actuellement en jeu (à part les Textures/meshes)\r<br />\r<br />[color=yellow][u]Les pages de description sur le Nexus contiennent souvent une partie &#34;Mise à jour&#34; ou &#34;Installation&#34;. Lisez attentivement ces parties pour savoir si l&#39;auteur donne des indications particulières.[/u][/color]\r<br />\r<br />Les procédures de nettoyage de sauvegarde ne sont pas fiables et pourraient corrompre votre sauvegarde de manière irreversible. La commande &#34;clearinvalidregistrations&#34; de SKSE ne permet PAS de résoudre ces problèmes. La seule manière de modder correctement est de suivre la procédure. Si vous ne le faites pas, alors peu importe si vous nettoyez votre auvegarde, jurez ou tapez contre votre écran avec un manche à balai, votre sauvegarde sera corrompue de manière permanente.\r<br />\r<br />Un dernier conseil avant de fermer cette sous-partie: lisez TOUJOURS la description des mods qui vous intéressent. Soyez encore plus attentifs si la description du mod contient une partie &#34;Compatibilité&#34;, &#34;installation&#34; ou une FAQ et des notes sur la fonctionalité du mod. Ensuite lisez les premiez commentaires sur le mods. Les commentaires negatifs ne sont pas forcément des gens ingrats sans aucune forme de politesse (si, si, je vous jure). Si par exemple tout le monde se plaint d&#39;un mod, alors vous vous serez évité un énorme mal de crâne quand le problème aurait fait surface chez vous.\r<br />\r<br />[color=orange][size=13]4B: Ordre des Mods / Gestionnaire de Mods[/size][/color]\r<br />\r<br />[url=https://github.com/loot/loot/releases]LOOT - Load Order Optimization Tool[/url]\r<br />\r<br />LOOT est plus ou moins le remplaçant de BOSS. Là où BOSS ne faisait qu&#39;interpréter où chaque Mod devrait aller, LOOT les classe en les scannant un à un. Qu&#39;est-ce que ça change ? Et bien tout simplement qu&#39;il n&#39;y aura plus de plugins ou de mods non reconnus et donc non classés. Il fait aussi un rapport complet sur chaque Mod et vous indique si un nettoyage du Mod est nécessaire.\r<br />\r<br />[color=yellow][u]Si vous utilisez actuellement BOSS, je vous recommande d&#39;attendre votre prochain playthrough pour passer à LOOT car si l&#39;ordre des mods est changé en cours de partie, cela peut entraîner les mêmes effets que l&#39;ajout de Mods traité plus haut.[/u][/color]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/25859]TES5EDIT[/url]\r<br />\r<br />[color=yellow][u]Utilisez LOOT pour classer vos mods avant d&#39;utiliser ce programme[/u][/color]\r<br />Ce programme marche main dans la main avec LOOT. LOOT repère les plugins endommagés (.esp/.esm/Plugins) et cet utilitare les nettoie.\r<br />[color=yellow][u]Je vous invite à chercher un tutoriel pour l&#39;utilisation de ce logiciel ou bien d&#39;aller sur la page du Mod original pour la vidéo[/u][/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/1840/?]Wrye Bash[/url]\r<br />\r<br />Après avoir installer ce logiciel vous allez pouvoir créer vos Patchs Bash. Ces patchs sont essentiels si vous voulez faire fonctionner tous vos mods les uns avec les autres &#33;\r<br />Lancez le programme. Vous notterez que votre liste de mods apparaît dans une boîte de dialogue et qu&#39;un nouveau plugin appelé &#34;Bashed Patch, 0.esp&#34; est apparu. \r<br />Voilà ce qu&#39;il vous faudra faire:\r<br />     * Tout d&#39;abord déplacez &#34;Bashed Patch, 0.esp&#34; tout en bas de votre liste mais faites en sorte qu&#39;il soit juste ava,t tout Mods ayant été installés via SkyProc. C&#39;est à dire qu&#39;il devra se trouver à la fin de votre liste à moins que vous ayez installé Automatic Variants, ASIS, Dual Sheathe Redux etc.\r<br />     * Faites un clic droit sur &#34;Bashed Patch, 0.esp&#34; et sélectionnez &#34;Rebuild Patch&#34;\r<br />     * Sélectionnez [i]seulement[/i] &#34;leveled lists&#34;, à moins que vous ne commenciez une nouvelle partie, dans ce cas vous pouvez fusionner tout les patch que Wrye Bash détecte.\r<br />     * Cliquez sur &#34;Rebuild Patch&#34;, quand le rapport apparaît, fermez le programme\r<br />[color=yellow][u]Les patchs Bash doivent être générés à chaque fois que vous installez un nouveau mod changeant les Leveled Lists (ex: MorrowLoot, Piratelords Loot adjustments etc.). Ce programme est soumis aux même règles de nettoyage et de précautions que SkyProc que nous détailleront plus tard.[/u][/color]\r<br />\r<br />[color=orange][size=13]4C: Les patchs non officiels, SKSE, STEP et SkyProc[/size][/color]\r<br />\r<br />Ces mods sont des impératifs à avoir si vous voulez un environnement stable et sans bugs; Surtout si vous avez la mise à jour la plus récente qui, selon Bethesda, devrait être la dernière.\r<br />Ne prenez que ce qui vous concerne:\r<br />\r<br />- [url=http://www.nexusmods.com/skyrim/mods/19/?]Skyrim Patch[/url] = concerne tout le monde\r<br />- [url=http://www.nexusmods.com/skyrim/mods/23491/?]Dawnguard Patch[/url] = concerne uniquement les possesseurs de l&#39;extension Dawnguard\r<br />- [url=http://www.nexusmods.com/skyrim/mods/25127/?]Hearthfire Patch[/url] = concerne uniquement les possesseurs de l&#39;extension Hearthfire\r<br />- [url=http://www.nexusmods.com/skyrim/mods/31083/?]Dragonborn Patch[/url] = concerne uniquement les possesseurs de l&#39;extension Dragonborn\r<br />- [url=http://www.nexusmods.com/skyrim/mods/31255/?]Textures HD Patch[/url] = concerne uniquement les possesseurs du pack de textures HD officiel de Bethesda\r<br />\r<br />[url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url]\r<br />SKSE est un launcher pour Skyrim qui étend ses possibilités sans aucun impact sur les performances. Il est nécessaire pour un grand nombre de mods (SkyUI par exemple). Il est facile à installer grâce à leur dernière mise à jour qui rajoute un intalleur.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/32363/?]SkyProc[/url]:\r<br />Plusieurs mods on besoin d&#39;une application, nommée SkyProc, codée en Java pour être installés. Comme par exemple [url=http://www.nexusmods.com/skyrim/mods/18436/?]A.S.I.S[/url], [url=http://www.nexusmods.com/skyrim/mods/21377/?]Automatic Variants[/url], [url=http://www.nexusmods.com/skyrim/mods/34155/?]Dual Sheathe Redux[/url] etc.\r<br />\r<br />Le début de l&#39;installation est classique, suivez les instructions à l&#39;écran et ensuite ouvrez le dossier &#34;Skyproc patchers&#34; dans votre dossier &#34;Skyrim/Data/&#34;. A l&#39;intérieur vous remarquerez un dossier pour chaque Skyproc patcher que vous possédez. Chacun d&#39;entre eux [color=yellow][u]DOIT[/u][/color] être lancé avant de jouer et à CHAQUE FOIS que vous mettez à jour votre liste de mods (cela inclue aussi la modification de l&#39;emplacement d&#39;un plugin).\r<br />\r<br />Skyproc Patcher crée un *.esp dynamique qui ajoute le mod correspondant à votre jeu tout en maintenant la compatibilité entre les patchs et votre liste de Mods. Les différents patchs ne PEUVENT PAS être inter-dépendants &#33; Cela signifie que lorsque vous patchez un mods avec Skyproc, les autres doivent être désactivés dans votre liste (si vous patchez ASIS, Automatic Variants et Dual Sheathe Redux devront être désactivés par exemple). Ceci peut être facilement géré grâce au [url=http://www.nexusmods.com/skyrim/mods/29865/?]Skyproc Unified Manager[/url] qui est aussi très utile pour empêcher le lancement de B.O.S.S que certains patchers intègrent.\r<br />\r<br />[color=yellow]Préparer la mise à jour des patches Wrye Bash ou Skyproc[/color]\r<br />Tout d&#39;abord sachez que cette procédure n&#39;est PAS optionnelle si vous utilisez les patches précédemment cités &#33; Cela peut sembler compliqué, mais ça ne l&#39;est pas. Cette manipulation va vous permettre de purger les Cells Buffer et réinitialiser les World Cells pour qu&#39;à chaque mise à jour de vos patches, les PNJ re-spawns et tout est chargé à nouveau depuis la mémoire et non depuis le cavhe du jeu.\r<br />\r<br />Avant de mettre à jour et en étant dans le jeu:\r<br />    * Allez en intérieuret ouvrez la console (&#34; ² &#34; par défaut)\r<br />    * Tapez &#34;PCB&#34; et faites entrée pour purger les cells buffer\r<br />    * Sauvegardez et fermez le jeu\r<br />Mettez vos patches ainsi que votre liste de mods à jour, et continuez:\r<br />    * Chargez votre sauvegarde\r<br />    * Réinitialisez les World Cells ( voir procédure plus bas)\r<br />\r<br />NB: Vous pouvez réinitialiser vos World Cells en faisant passer 31 jours en jeu. Cela peut être fait facilement (mais lentement) avec ce mod: [url=http://www.nexusmods.com/skyrim/mods/12625/?]No Boring Sleep/Wait menu[/url]\r<br />Pour ma part je préfère utiliser l&#39;option MCM qui est présente dans le mod [url=http://www.nexusmods.com/skyrim/mods/3829/?] Deadly Dragons[/url] (MCM&gt;Extra Options&gt;&#34;World Cells reset in&#34;) ou bien [url=http://www.nexusmods.com/skyrim/mods/24913/?]Skyrim Immersive Creatures[/url] (MCM&gt;Random Cell Respawner&gt;Prepare Cell Reset&gt;Follow Prompts)\r<br />\r<br />[color=yellow][i]N&#39;oubliez jamais de lancer vos patchers quand vous mettez à jour votre liste de Mods. TOUS, et à CHAQUE FOIS; peu importe si vous n&#39;avez changé qu&#39;une chose infime. Votre sauvegarde en dépend.[/i][/color]\r<br />\r<br />[color=orange][size=13]4D: Mods comportant des problèmes non résolus[/size][/color]\r<br />Cette section couvre les mods buggés mais qui sont toujours très populaires. Des alternatives sont le bien venu. Cette section est constamment en chantier étant donné que les auteurs de mods vont et viennent.\r<br />[i]Ils ne sont pas dans un ordre particulier. Ici la priorité 5 représente les mods comportant le plus gros risque pour votre sauvegarde.[/i]\r<br />\r<br />Claralux: corrompt les sauvegardes et n&#39;est plus en développement [color=red]{priorité 5}[/color]\r<br />Warzones: scripts buggés, mauvaises éditions, plus en développement [color=red]{priorité 5}[/color]\r<br />Imaginator: à ne surtout pas utiliser &#33;&#33; [color=red]{priorité 5}[/color]\r<br />Crimson Tide-Blood: généralement instale, surcouche de scripts [color=yellow]{priorité 3}[/color]\r<br />Unlimited Bookshelves: très vieux et n&#39;est plus en développement [color=red]{priorité 5}[/color]\r<br />\r<br />Si vous pensez qu&#39;un mod a été posté ici par erreur, merci de me contacter directement par MP. J&#39;attendrai néanmoins un meilleur argument que &#34;Il marche pour moi &#33;&#34;. Des suggestions sont aussi le bien venu mais encore une fois j&#39;attends un meilleur argument que &#34;Il ne marche pas pour moi &#33;&#34;.\r<br />\r<br />Alternatives:\r<br />[url=http://www.nexusmods.com/skyrim/mods/60/?]Enhanced Blood Textures[/url] : Alternative a Crimson Tide\r<br />[url=http://www.nexusmods.com/skyrim/mods/12977/?]Immersive Patrols[/url] : Alternative a Warzones\r<br />[url=http://www.nexusmods.com/skyrim/mods/18436/?]ASIS - Automatic Spells, Increase Spawns[/url] : Alternative a Warzones\r<br />[url=http://www.nexusmods.com/skyrim/mods/18916/?]Lanterns of Skyrim[/url] : Alternative a Claralux\r<br />[url=http://www.nexusmods.com/skyrim/mods/35399/?]Book Covers[/url] et [url=http://www.nexusmods.com/skyrim/mods/24359/?]Bookshelves script SKSE[/url] : Alternative a Unlimited Bookshelves\r<br />[url=http://enbdev.com/]ENB[/url] :  les binaires offerts par ce site sont les seuls alternatives viables pour la correction des couleurs/ombres, profondeur de champ et l&#39;éclairage. Des fichiers pré-programmés sont disponibles sur le Nexus, vous devriez en choisir un qui correspond à [i]votre[/i]liste de mods et vos besoins. {Alternative à Claralux et Imaginator}",
  "categoryId": "95",
  "version": "8.1",
  "author": "Marenkai",
  "createdUnix": "1404038206",
  "updatedUnix": "1404038195",
  "containsAdultContent": false,
  "uploadedBy": "Marenkai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115106",
      "name": "Endorsement File",
      "version": "8.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Endorsement File-55403-8-1.rar",
      "uploadedUnix": "1404038195",
      "modVersion": "8.1",
      "virusScanUrl": "https://www.virustotal.com/file/dd59fe505e338d8e94f0d0156bc90a1686b9228aaa43512eaf31aa854ed00f87/analysis/1408152991/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Endorsement%20File-55403-8-1.rar?fid=1000115106&ttl=1535840146&ri=8192&rs=8192&setec=5f27328a76dca6361d108bebfbe0efdd"
    }
  ]
}