{
  "modId": 55413.0,
  "modName": "Ranus better (and more) Khajiit",
  "summary": "Khajiit Overhaul, Khajiit housecarls, some Khajiit in Guilds, get more trainingspoints per level and so one. Requires Heartfire",
  "descriptionHtml": "&#33;Requires Heartfire&#33;\r<br />\r<br />Description:\r<br />All Khajiit have now modified resistences higher cold, lightning and disease trough the fur is higher but there are lower resistences against fire. It has nothing to do with the lore it is common sense ;)\r<br />They have distinct senses and instincts so they can smell their prey over higher distances. It lasts for 10 seconds around the place where you used it. It can be used anytime and anywhere.\r<br />The cat eye vision lasts now one hour and can be switched off by using it again like in the original.\r<br />The bonus in alchemy is gone for +5 speechcraft, also there is no more one handed bonus for +5 in light armor. The claw attack bonus has increased by 3 points up to 15.\r<br />\r<br />There are now 10 training units per level up.\r<br />\r<br />All housecarls are now Khajiit and can be married or used as voigt. They have their original voice set. Otherwise they could not be married nor be housecarls. There is just one character with khajiit voice set J&#39;zargo from wintergrasp academy.\r<br />They are all marked as essential, so they can not die and they don&#39;t trigger pressure plate traps.\r<br />\r<br />The housecarls have clothing, but no armor. Armor disapears when they where sent away so they are clothing when recruited again. You can take and regive them a piece of armor to get them proper dressed again.\r<br />\r<br />All housecarls have now different classes\r<br />Markarth - Battle mage\r<br />Solitude - Archer (light armor)\r<br />Whiterun - Tank (one handed+shield+heavy armor)\r<br />Windhelm - Warrior (two handed axe+heavy armor)\r<br />Rifton - Thief/Asassine (one handed+light armor)\r<br />The AI is sometimes a bit unstable but it comes from the game not the mod.\r<br /> \r<br />Installation:\r<br />Copy all files from the zip file to your skyrim data directory and activate it in the launcher.\r<br />\r<br />Known bugs\r<br />When the mod is loaded with an old savegame where you already are married with an housecarl you can sometimes not choose him/her to follow you. Then you must manually change the relationship in the console.\r<br />\r<br />-open console\r<br />-click on the npc (name must be shown above the console window)\r<br />-type or copy &#39;setrelationshiprank player 4&#39; into the console (without the &#39;&#39;)\r<br />-done\r<br />\r<br />There are no more known problems. But you can post it here when you have some problems or found something wrong in the translation.",
  "categoryId": "79",
  "version": "1.0",
  "author": "Ranu",
  "createdUnix": "1404055781",
  "updatedUnix": "1404055188",
  "containsAdultContent": false,
  "uploadedBy": "Ranu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115145",
      "name": "Ranus better Khajiit EV",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2468",
      "fileName": "Ranus better Khajiit EV-55413-1-0.zip",
      "uploadedUnix": "1404055188",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c88f382d0ed4c014857108b3f0b54951222676a25c7a4fd81b83ca01e16357e3/analysis/1408153458/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ranus%20better%20Khajiit%20EV-55413-1-0.zip?fid=1000115145&ttl=1535840157&ri=8192&rs=8192&setec=93ef328de0270af796ab71eabc3c8842"
    }
  ]
}