{
  "modId": 55417.0,
  "modName": "No More Soul Trapping",
  "summary": "Feel guilty about trapping someone&#39;s soul for your enchantments?  This mod is for you.  With it you can use your own magicka pool to fill soul gems renamed to magicka gems.  A new spell is available from court wizards to fill gems.  Uses a lot of magicka depending on the size of the gem.",
  "descriptionHtml": "I&#39;m working on a new version of this mod that will make it a little more lore friendly and add some questing and new features as well.  I&#39;ll keep you posted on progress in the comments.\r<br />\r<br />Update: When running out of magicka for the spell the wrong error message appears so I fixed that.\r<br />\r<br />This mod is for people who don&#39;t feel comfortable trapping souls.  Instead all the soul gems have been renamed to magicka gems and a spell is available from court wizards and Collette in Winterhold to fill them.  The spell uses an initial charge of magicka, then the script takes an amount of magicka ranging from 50 - 250 depending on the size of the gem.\r<br />\r<br />This mod is open to all for editing and whatever else you want without my permission.  You may also make a new mod using this mod as well. Please give credit where credit is due if you want to use this mod. \r<br />\r<br />Since this is my first mod, I&#39;ll need feedback on whether I packaged it right and whether it works like it&#39;s supposed to.  So please give HELPFUL feedback :) Thanks.\r<br />\r<br />Installation Instructions:\r<br />Unzip the archive into your Skyrim data directory usually found at C:/Program Files (x86)/Steam/SteamApps/common/Skyrim.  There is an instruction file in the zip file for those forgetting how to install the mod.\r<br />\r<br />Thanks guys&#33;",
  "categoryId": "75",
  "version": "1.1",
  "author": "Lancelot40",
  "createdUnix": "1404064488",
  "updatedUnix": "1479308462",
  "containsAdultContent": false,
  "uploadedBy": "lancelot40",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000228306",
      "name": "EnergyNotSoul",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "EnergyNotSoul-55417-1-1.zip",
      "uploadedUnix": "1479308462",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e85847fbf29236a7de7a2126e85e656732d2188fd358afbb5f6e0c62d2c98a21/analysis/1479308522/",
      "changelogHtml": " Made script more efficient. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EnergyNotSoul-55417-1-1.zip?fid=1000228306&ttl=1535840163&ri=8192&rs=8192&setec=45d4e13f98d706b84b9c071b456ca4bd"
    }
  ]
}