{
  "modId": 55441.0,
  "modName": "Kynareth&#39;s Fountain",
  "summary": "Small sanctuary inspired by The Fountain and in response to a Mod Request in the forums.",
  "descriptionHtml": "The Fountain (of Kynareth) v1.2\r<br />by DrNewcenstein\r<br />\r<br />=====================v 1.2 changes====================================\r<br />\r<br />- changed the sphere texture to a starfield.\r<br />- added a barrier to prevent swimming out of the sphere (the Eye of Magnus barrier).\r<br />- expanded the sphere, so it&#39;s now about twice the original size.\r<br />- added a massive pillar under the island so it&#39;s not just floating in the water, looking all weak and stuff.\r<br />- added a Spriggan caretaker who wanders around the tree (she&#39;s not a threat).\r<br />- added Imp Stools behind the tree, and moved the Shrine of Kynareth near the knapsack.\r<br />- if you get an error about a missing Package, ignore it. It was a modded copy of Azura&#39;s &#34;floating in the air&#34;\r<br />package I tried to apply to the Spriggan, but she wouldn&#39;t take to it. \r<br />=======================================================================\r<br />\r<br />======================Instructions for updating to v1.2================\r<br />Unzip and replace the ESP. Boom, you&#39;re done. No muss, no fuss.\r<br />=======================================================================\r<br />\r<br />This mod requires Dragonborn.\r<br />\r<br />This was born from a post by Rivaan in the Mod Requests forum on the Nexus, for a player home inspired \r<br />by the movie The Fountain, specifically a large tree inside a bubble/sphere, with a bedroll for sleeping \r<br />and a sack for storing and a lantern in the tree for light. Simple enough.\r<br />\r<br />He also thought it could be accessed by a worn item, so I went with the Amulet of Kynareth \r<br />(Mother Nature in TES universe), and with help from IsharaMeradin, attached a modified version \r<br />of the Wooden Mask script so once you put the amulet on, you are teleported to the cell.\r<br />\r<br />Unlike the Wooden Mask, you are not teleported out of the cell when you remove it. On the downside, \r<br />where the Wooden Mask script has a failsafe to keep you from dropping it and forever losing access \r<br />to the Sanctuary, if you drop the amulet in the Fountain cell and FT out of it, the amulet will stay \r<br />behind. In that event, the cell name is TheFountain, so you can COC back to it.\r<br />\r<br />Since you can teleport from anywhere in Skyrim into the Fountain cell, I left it set so that you \r<br />have to fast travel to get out of it. For those who don&#39;t like fast traveling, just pretend that the \r<br />amulet can send you to any location you&#39;ve already been to. Because you really, really, do not want \r<br />me to put a door to every possible location in Skyrim. Really, you don&#39;t even want to ask.\r<br />\r<br />The Amulet can be found in Helgen Keep, on top of a chest at the foot of a bed in the barracks on the \r<br />Imperial side, where you would follow either Hadvar or Ralof into the Keep at the start of a New Game. \r<br />\r<br />You don&#39;t have to start a New Game, as it&#39;s there either way.\r<br />\r<br />Unless you have a mod that significantly changes the HelgenKeep01 cell, in which case, I just can&#39;t do \r<br />anything about that. \r<br />\r<br />=================MANUAL INSTALLATION==================================\r<br />Unzip into your Data folder. This mod includes a custom Script (Kynes_Fountain) and mesh (fountainsphere01.nif, \r<br />which will go into Data&#92;Meshes&#92;Dungeons&#92;Azurasstar).",
  "categoryId": "67",
  "version": "1.2",
  "author": "DrNewcenstein",
  "createdUnix": "1404119840",
  "updatedUnix": "1406406615",
  "containsAdultContent": false,
  "uploadedBy": "DrNewcenstein",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119384",
      "name": "The Fountain v1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79",
      "fileName": "The Fountain v1.2-55441-1-2.zip",
      "uploadedUnix": "1406406615",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/dae00636c7493f4868e2c4e218b2498ad630acd7ecdbe5e50283e539c853f845/analysis/1406406670/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Fountain%20v1.2-55441-1-2.zip?fid=1000119384&ttl=1535840202&ri=8192&rs=8192&setec=e51d51da73af144a7b3e2f0a9d98c4e1"
    }
  ]
}