{
  "modId": 55459.0,
  "modName": "The Memory of Rael",
  "summary": "A new dungeon and quest-demo that has you hunting a Vampire that is intimately familiar with Riften.",
  "descriptionHtml": "STORY~\r<br />\r<br />Isran at Fort Dawnguard had told a tale of a son, belonging to the Jarl of Riften in the Second Era, and how he turned to a bloodthirsty monster that had to be put down. Perhaps his demise was fabricated to save face, as there are rumors of people gone missing in the Riften wine cellars recently. \r<br />\r<br />Perhaps this son of Riften is looking for vengeance. \r<br />\r<br />WHAT THIS IS~\r<br />\r<br />I&#39;m not very good at scripting at all yet, so what I&#39;ve made here is a dungeon &#39;and&#39; demo of a quest that I might grow if it&#39;s well received. It is a lore-friendly, non-intrusive mod that has all new areas except for one small portion of Riften&#39;s north gate. So far, there are only written cues as you progress through the wine cellars of Riften, and an area known as Shor&#39;s Rift, which includes a labyrinth and soul gem mine, as well as a special puzzle-zone with an uncharacteristic obstacle. \r<br />\r<br />You can find the entrance to the wine cellars between Riften&#39;s north gate and the player home&#39;s garden.\r<br />\r<br />I&#39;ve attempted to make this into a nice horror/mystery quest with the barest of bones that I could manage. I am looking for good feedback, so I hope you enjoy it&#33; It is navmeshed (although I&#39;ve had some trouble there) and cleaned with TES5Edit.\r<br />\r<br />Since I wished to give some feeling of desolation and horror, I recommend you do not take any followers with you. If you see any problems or have any problems finishing this mod, please let me know&#33;\r<br />\r<br />COMPATIBILITY~\r<br />\r<br />This will require the latest Skyrim version, the Update, Dawnguard and Dragonborn. Hearthfire is not needed. \r<br />\r<br />INSTALLATION~\r<br />\r<br />One can use the Manager, or manually install the mod file into your Data folder. No other parts needed.",
  "categoryId": "35",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1404156364",
  "updatedUnix": "1404156298",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115312",
      "name": "Memory of Rael",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4325",
      "fileName": "Memory of Rael-55459-1-0.zip",
      "uploadedUnix": "1404156298",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b277977c15725719403f95641ab3c4813cc0e3347d28179d4e11e99ea785deae/analysis/1408155070/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Memory%20of%20Rael-55459-1-0.zip?fid=1000115312&ttl=1535840227&ri=8192&rs=8192&setec=22ee5ac34c129024054a603897227365"
    }
  ]
}