{
  "modId": 55496.0,
  "modName": "Correcciones y mejoras de textos y voces",
  "summary": "Este es un proyecto avanzado de edición de palabras, frases y oraciones con el fin de corregir y mejorar los textos y voces de todo el juego.",
  "descriptionHtml": "[color=#e06666][center]Only for spanish users. Corrections and improvements of the game strings and voices in spanish.[/center][/color]\n<br />Este es un proyecto avanzado de edición de palabras, frases y oraciones con el fin de corregir y mejorar los textos y voces de todo el juego.\n<br />[center][url=http://www.nexusmods.com/skyrimspecialedition/mods/1304]\n<br />VERSIÓN PARA SKYRIM SPECIAL EDITION[/url][/center][center][url=http://www.nexusmods.com/fallout4/mods/22102]VERSIÓN PARA FALLOUT 4[/url][/center]\n<br />Skyrim es uno de esos juegos en los que se puede echar horas y horas explorando sus mapas con libertad, interactuando con sus personajes como y cuando quieras, llenando tu inventario de decenas de objetos de todo tipo, personalizando tu rol de formas diferentes o, simplemente, relajándote inmerso en una vida alternativa... Sus características lo hacen altamente rejugable y, gracias a la gran cantidad de mods que aparecen cada día, casi interminable.\n<br />\n<br />Pero, un juego de tal envergadura no está exento de fallos. En mis viajes, comencé a darme cuenta que estaba lleno de errores gramaticales, frases mal redactadas, artículos con nombres erróneos y palabras que te podían sacar de la inmersión. Al ver esto me decidí aventurar en los strings del juego y realizar una revisión en las cadenas de texto. Al principio comenzó como una pequeña edición de errores, pero al final se ha convertido en todo un proyecto de corrección.\n<br />\n<br />Por tanto, este es el mayor y más completo trabajo de mejora en nuestro idioma, ya que se han realizado cientos de cambios en las celdas de texto de diálogos, conceptos, efectos, subtítulos, descripciones, menús, notificaciones, escritos, [size=2]personajes, lugares y objetos [/size]para realizar correcciones ortográficas y otras mejoras respetando siempre el lore del juego y del mundo de Elder Scroll.\n<br />\n<br />Un proyecto que jamás podrá ser desbancado porque carga con incontables horas de minucioso trabajo de edición a sus espaldas en el 100% del juego. Si ves algo parecido es que lo intentan copiar esos flojos.\n<br />[center][/center]\n<br />[list][*][size=2]TEXTOS[/size]\n<br />[/list][size=2]\n<br />[/size][list]\n<br />[*][color=#f6b26b][size=2]Se ha realizado un completo ajuste de los diferentes tipos de signos ortográficos utilizados, entre los que se incluyen comillas, paréntesis, puntos y comas, en aquellos textos donde no estaban correctamente ubicados o ausentes y eliminándolos en aquellos en los que no eran necesarios.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han corregido aquellos textos que representan las onomatopeyas de los subtítulos entre paréntesis para que sigan el mismo patrón de escritura que el resto, eliminando conceptos como \"grita ahogádamente\", \"resuella\" o \"ladra\", entre otros.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han realizado numerosos cambios a mayúscula en palabras que son consideradas como nombres propios, así como también se han cambiado a minúscula aquellas que son consideradas como nombres comunes. Este factor afecta a un gran número de conceptos del juego, como[color=#f6b26b][size=2] facciones, lugares, hechizos, gritos, encantamientos, poderes, efectos activos, objetos únicos y habilidades del jugador[/size][/color].[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han eliminado todos los espacios de más que estaban incluidos por error entre algunas palabras y se han añadido donde faltaban, así como correcciones en palabras sin terminar.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han cambiado algunos diálogos del jugador para mejorar su concordancia con las voces a lo largo del juego, ya que se daban ciertas diferencias en lo que se hablaba con otro personaje y podía hacer que la conversación perdiera sentido puntualmente.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se ha eliminado la herencia inglesa de la mejor forma que se ha podido, la cual afectaba a la unión de palabras que inicialmente no pertenecían a la misma frase en aquellas ocasiones en las que el juego utiliza conceptos aleatorios o a la diferencia estructural entre ambos idiomas.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se ha eliminado cualquier error de escritura en diversas palabras a lo largo del juego, como \"draédrica\" o \"crista\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han ajustado algunas palabras para representar mejor la variabilidad que puede darse en género y número, como \"punto/os\" o \"vacío/a\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han mejorado numerosos conceptos utilizados en el encantamiento, la magia y la alquimia para mejorar su representación en el juego y corregir errores. Esto afecta a las descripciones que se muestran al desplazarse por los inventarios de objetos y magia, a los efectos y poderes del jugador, a los resultados tras combinar ingredientes en los laboratorios de alquimia y a los conceptos de los árboles de habilidades al subir de nivel.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han comprobado todos los nombres de personajes y criaturas del juego para modificar los nombres incoherentes que se les ha dado con la excusa de especificar su nivel de juego, como \"vampiro ensangrentado\", \"forajido bandido\", \"restos del afectado\" o \"rondador nocturno falmer\", para que se muestren de una manera más lógica. Por ejemplo, la jerarquía de los dragones se basa en identidades más propias a su edad, desde uno \"jóven\" hasta uno \"alfa\", mientras que la de los nigromantes, conjuradores o magos en su experiencia mágica, desde uno \"novato\" hasta uno \"magistral\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se ha revisado por completo el extenso listado de armas, bastones, munición, anillos, collares, aros, atuendos y armaduras para que muestren de manera más clara, evitando confundir al jugador con nombres diferentes para un mismo encantamiento en función de la potencia del mismo, como \"de vigor\", \"consagrado\", \"reverente\"... Esto ha conllevado a que, por ejemplo, cualquier artículo que mejore la arquería se llame simplemente \"de Arquería\", ya sean unas botas, un anillo, una espada o unos guanteletes. De esta manera será más entendible encontrar un yelmo, un escudo, una daga o cualquier otro objeto con un encantamiento mejor del que ya se tenga equipado y recordar con más facilidad el hechizo aplicado.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han ajustado los nombres de las pociones y los venenos para que ahora se muestren correctamente, revisando que el nombre y la fuerza de cada poción, brebaje, solución, elixir, veneno o pócima siga el mismo patrón que el resto de acuerdo a la estructura del juego.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han mejorado los nombres de todas las llaves para ayudar a identificar más fácilmente el lugar al que corresponden. Este ajuste se ha hecho de manera coherente, ya que si por ejemplo nos encontramos una llave que abre sólo una puerta en concreto estará identificada como \"llave de una puerta de...\" o si nos topamos con una llave que abre todas las jaulas de un lugar estará identificada como \"llave de las jaulas de...\". Si, por el contrario, el jugador encuentra una llave que no tiene ninguna función, puede encontrarse con que esté nombrada como \"llave de algún lugar desconocido\", por ejemplo.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han cambiado los nombres de todas las notas que pueden ser encontradas a lo largo del juego para evitar la repetición masiva de la palabra \"nota\" en el inventario. Ahora muestran una breve entrada que hace referencia al contenido escrito en cada una de ellas, algo que ya ocurría con algunas, y que ayudará al jugador a recordar con más facilidad lo escrito en las mismas una vez leídas.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han corregido los nombres de algunos objetos del inventario para que se muestren según el patrón seguido por el juego, como \"guanteletes de escamas dragón\" por \"guanteletes de escamas de dragón\" o \"martillo de ébano\" por \"martillo de guerra de ébano\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han mejorado los nombres de prácticamente todos los lugares y todas las estructuras a lo largo de Skyrim para mejorar su representación. Por ejemplo, ahora las viviendas muestran realmente a todos los propietarios de las mismas, afectando a casas, mansiones y alojamientos, de la misma forma que otras estructuras como, casas comunales, salones de los muertos o cuarteles, muestran ahora la ciudad o el asentamiento al que pertenecen.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han modificado los nombres de algunos artículos para corregirlos en función del tipo de objeto que sean, como \"casco imperial\" por \"yelmo imperial\" o \"guanteletes de renegado\" por \"brazales de renegado\", mientras que en otros se ha realizado una mejora en su representación, como \"aro\" por \"tiara\" o \"adularia refinada\" por \"lingote de piedra lunar\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han editado las palabras entre paréntesis que se incluyen en aquellas frases que resaltan acciones a tomar por el jugador en determinados momentos, como \"(50 de oro)\" por \"(50[size=2] septim[/size])\", así como también se han añadido en aquellas donde no aparecían.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han establecido diferencias entre objetos similares que pueden repetirse demasiadas veces en el inventario, por ejemplo, en relación a su diseño, como \"atuendo de noble\" y \"atuendo de noble elaborado\", en relación a su portador, como \"túnica de mago\" y \"túnica de nigromante\" e incluso en relación a sus atributos, como \"yelmo élfico\" y \"yelmo élfico mejorado\". También se han mejorado algunos nombres para seguir el patrón que utiliza el juego, como \"calavera\" por \"calavera humana\", en relación a la calavera de trol, o \"granate\" por \"granate imperfecto\", en relación al granate perfecto.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han corregido los nombres de numerosas localizaciones secundarias para que ahora hagan referencia al lugar principal en el que se encuentran, como \"bodega\" por \"bodega de la cabaña de Anise\" o \"almacén\" por \"almacén de Ventalia\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se han modificado varios conceptos de la interfaz de usuario a lo largo de los diferentes menús del juego, entre los que se incluyen opciones de configuración, resúmenes o estadísticas, entre otros, así como la gran mayoría de las frases notificadas por pantalla para mejorar su representación.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han modificado ligeramente numerosas frases de los subtítulos para igualarlas a las voces y eliminar cualquier error que hiciese mostrar un contexto equivocado o sin traducir.[/size][/color]\n<br />[*][color=#f6b26b][size=2]Se han cambiado los nombres de algunas criaturas que carecían de subespecies, como \"oso\" por \"oso pardo\" o \"lobo\" por \"lobo negro\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han eliminado las entradas de estructuras y accidentes naturales de los nombres de las localizaciones principales, como campamentos, fuertes y cuevas, entre otros, debido a que la gran mayoría de ellas no las incluían por defecto, como \"Fuerte Páramo Gris\" por \"Páramo Gris\" o \"Campamento de Arroyo Estancado\" por \"Arroyo Estancado\", pero manteniendo aquellas en donde ha sido coherente hacerlo debido a que forman parte del nombre del lugar, como \"Torres Hendidas\" o \"Cueva del Nonato\".[/size][/color]\n<br />[/list][list]\n<br />[*][color=#f6b26b][size=2]Se ha mejorado la representación en el inventario de todos los grimorios, pergaminos y recetas.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han cambiado los nombres de la mayoría de los diarios para dar a entender mejor quien a escrito cada uno.[/size][/color]\n<br />[*][color=#f6b26b][size=2]Se han establecido diferencias entre todas las piezas de una misma armadura que tiene un juego pesado y otro ligero, como la imperial, la quitinosa o la de stalhrim.[/size][/color]\n<br />[/list][list]\n<br />[*][color=#93c47d][size=2]Se han aplicado numerosas correcciones menores muy diversas a lo largo del juego.[/size][/color]\n<br />[/list][color=#93c47d][size=2]\n<br />[/size][/color][list]\n<br />[*][size=2]VOCES[/size]\n<br />[/list][size=2]\n<br />[/size][list]\n<br />[*][color=#f6b26b][size=2]Se han eliminado algunas frases puntuales que estaban insertadas entre conversaciones de varios personajes y cuyo contenido interrumpían la continuidad haciéndolas totalmente inútiles. Del mismo modo, se han llevado a cabo ciertos cortes necesarios en varias frases para eliminar partes que no tenían sentido en el diálogo y que eran totalmente irrelevantes en el momento que se decían.[/size][/color]\n<br />[*][color=#93c47d][size=2]Se han igualado varias frases de relleno que estaban ligadas al mismo subtítulo pero que, según el personaje que las decía, eran diferentes; por ejemplo, en conversaciones con guardias o cuando los diferentes personajes actúan de la misma forma ante una situación, como un robo, un ataque...[/size][/color]\n<br />[*][color=#f6b26b][size=2]Se han realizado pequeñas ediciones para sustituir algunas palabras erradas en numerosos diálogos que conllevaban a diversos tipos de incoherencias de doblaje en ubicaciones, personajes, tiempo o continuidad de la acción... Dichas ediciones se han hecho con el mayor cuidado posible para lograr la entonación necesaria y evitar que se noten.[/size][/color]\n<br />[*][color=#93c47d][size=2]Se han creado nuevos diálogos a partir de fragmentos existentes para crear frases cuyo doblaje no había sido realizado, usando siempre el tipo de voz del personaje al que afectan.[/size][/color]\n<br />[/list]\n<br />Y recuerda que todas mis [url=http://www.nexusmods.com/skyrim/users/3198127/?tb=mods&amp;pUp=1]traducciones[/url] están completamente adaptadas a este proyecto para maximizar la compatibilidad.\n<br />\n<br />[list]\n<br />[*][color=#ffe599][size=2]Notas a tener en cuenta[/size][/color]\n<br />[/list]\n<br />Es importante recordar a algunos usuarios que están en NexusMods, un portal en el que se publican cientos de trabajos que pueden modificar la experiencia de juego estándar de Skyrim. Por tanto, si eres de los que buscan jugar consultando guías online o conseguir beneficios mediante la consola integrada, este proyecto no es para ti. Este trabajo esta dedicado a aquellos que quieran disfrutar de una experiencia mucho más inmersiva optimizando lo que Bethesda publicó en su día.\n<br />\n<br />¿Aun juegas a Skyrim sin un Unofficial Patch? Pues entonces estás jugando a un juego bugeado. Este proyecto corrige y mejora muchos aspectos de este fantástico título, pero no puede corregir errores internos de programación olvidados por Bethesda.\n<br />Si realmente quieres disfrutar de Skyrim, un Unofficial Patch es el primer mod que deberías tener en mente para instalar. Además, dispones aquí de un parche opcional que compatibiliza los cambios realizados de este proyecto, así que... ya no tienes excusa. 100% recomendado para obtener una experiencia única de juego.\n<br />\n<br />\n<br />[center][img]http://centostudios.com/Imagen.png[/img][/center]",
  "categoryId": "42",
  "version": "10.5",
  "author": "supercento",
  "createdUnix": "1404235180",
  "updatedUnix": "1519207954",
  "containsAdultContent": false,
  "uploadedBy": "supercento",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000246733",
      "name": "Correcciones y mejoras de textos y voces",
      "version": "10",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "5907",
      "fileName": "Correcciones y mejoras de textos y voces-55496-10.rar",
      "uploadedUnix": "1497177696",
      "modVersion": "10",
      "virusScanUrl": "https://www.virustotal.com/file/f36a8e1641f259948d90e8bdede03381fb094db93af797f72a4b497bb23ba444/analysis/1497177809/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Correcciones%20y%20mejoras%20de%20textos%20y%20voces-55496-10.rar?fid=1000246733&ttl=1535840307&ri=8192&rs=8192&setec=871132af3cc3843cddc12f7e7fe9b497"
    },
    {
      "fileId": "1000252523",
      "name": "Compatibilidad con Unofficial Legendary Patch",
      "version": "3.0.10",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "6790",
      "fileName": "Compatibilidad con Unofficial Legendary Patch-55496-3-0-10.rar",
      "uploadedUnix": "1503319295",
      "modVersion": "3.0.10",
      "virusScanUrl": "https://www.virustotal.com/file/46de5945d79e70aba9a959208c7df618def8c1c579152c7a9646c24038dcf1d6/analysis/1503333295/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Compatibilidad%20con%20Unofficial%20Legendary%20Patch-55496-3-0-10.rar?fid=1000252523&ttl=1535840308&ri=8192&rs=8192&setec=7a82238b8ab92edbe6a4abd079c9e464"
    },
    {
      "fileId": "1000265203",
      "name": "Correcciones y mejoras de textos y voces",
      "version": "10.5",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "6537",
      "fileName": "Correcciones y mejoras de textos y voces-55496-10-5.rar",
      "uploadedUnix": "1517399355",
      "modVersion": "10.5",
      "virusScanUrl": "https://www.virustotal.com/file/853fafa42f3e8256dd80152d8d85fa3c29d3a78ace77b1b5bcf563e6ea800cec/analysis/1517399605/",
      "changelogHtml": " - Varias correcciones de piezas de armadura que se mostraban confundidas, donde el equipamiento pesado se mostraba como ligero y viceversa, además de otras mejoras puntuales en otros complementos que no terminaban de cuadrar.\n<br />- Nuevas mejoras en atuendos. Ahora es posible diferenciar túnicas con capuchas de las que no las tienen.\n<br />- Revisión completa de los personajes no jugables para eliminar algunos errores y corregir la organización jerárquica que relaciona sus nombres respecto a sus niveles, ya sean individuos o criaturas. Para diferenciar ciertos personajes invocados de los que no los son (coléricos, brumosos, engendros de ceniza...) aparecerán con la etiqueta \"conjurado\"... (los atronach, por ejemplo, no están incluidos ya que todos son invocaciones).\n<br />- Ya sean imperiales o Capas de la Tormenta, cualquier personaje que pertenezca a la facción de \"guardias\" aparecerán como tales, identificados según la comarca en la que estén: La Cuenca, La Grieta, Carrera Blanca...\n<br />- Eliminación de discrepancias en varios accesorios de ropa para hacer una referencia más exacta al personaje que los lleva.\n<br />- Solución de errores en bastones y algunas armas puntuales del juego que no se mostraban como deberían.\n<br />- Mejorada la representación de las recetas de la fragua del atronatch y la cámara de imbuir.\n<br />- Nuevas mejoras en la interfaz de usuario para los menús y las notificaciones por pantalla.\n<br />- Gran actualización de las descripciones que acompañan los inventarios de objetos y magia, y de los árboles de habilidades del juego. Se han revisado al completo para establecer mejoras respecto a las actualizaciones anteriores, ofreciendo más detalles que no se mostraban de los efectos de cada uno de sus componentes y corrigiendo fallos que no se habían tratado.\n<br />- Varias mejoras aleatorias en objetos misceláneos del mundo y almacenables en el inventario.\n<br />- Pequeñas correcciones en otros objetos usables, como pergaminos y arañas, gemas de alma, localizaciones y llaves.\n<br />- Creación de voces en ciertos diálogos que no estabán traducidos, usando la voz del personaje afectado.\n<br />- Igualación de textos idénticos afectados en varios archivos diferentes (skyrim, dawnguard, unofficial patch...) con el fin de evitar posibles incoherencias.\n<br />- Traducción completa desde cero nuevamente del parche del Unofficial para eliminar errores que han perdurado. Se incluye nuevas ediciones en voces, debido a que el unofficial patch corrige ciertas partes de algunos diálogos que contenían errores en el doblaje original y que han continuado en el doblaje en español.\n<br />- Otras mejoras misceláneas y correcciones ortográficas. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Correcciones%20y%20mejoras%20de%20textos%20y%20voces-55496-10-5.rar?fid=1000265203&ttl=1535840308&ri=8192&rs=8192&setec=4288867aceeac1b1d22777252a2e9d7d"
    },
    {
      "fileId": "1000265206",
      "name": "Correcciones y mejoras de textos y voces",
      "version": "10.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6517",
      "fileName": "Correcciones y mejoras de textos y voces-55496-10-5.rar",
      "uploadedUnix": "1517401842",
      "modVersion": "10.5",
      "virusScanUrl": "https://www.virustotal.com/file/853fafa42f3e8256dd80152d8d85fa3c29d3a78ace77b1b5bcf563e6ea800cec/analysis/1517399605/",
      "changelogHtml": " - Varias correcciones de piezas de armadura que se mostraban confundidas, donde el equipamiento pesado se mostraba como ligero y viceversa, además de otras mejoras puntuales en otros complementos que no terminaban de cuadrar.\n<br />- Nuevas mejoras en atuendos. Ahora es posible diferenciar túnicas con capuchas de las que no las tienen.\n<br />- Revisión completa de los personajes no jugables para eliminar algunos errores y corregir la organización jerárquica que relaciona sus nombres respecto a sus niveles, ya sean individuos o criaturas. Para diferenciar ciertos personajes invocados de los que no los son (coléricos, brumosos, engendros de ceniza...) aparecerán con la etiqueta \"conjurado\"... (los atronach, por ejemplo, no están incluidos ya que todos son invocaciones).\n<br />- Ya sean imperiales o Capas de la Tormenta, cualquier personaje que pertenezca a la facción de \"guardias\" aparecerán como tales, identificados según la comarca en la que estén: La Cuenca, La Grieta, Carrera Blanca...\n<br />- Eliminación de discrepancias en varios accesorios de ropa para hacer una referencia más exacta al personaje que los lleva.\n<br />- Solución de errores en bastones y algunas armas puntuales del juego que no se mostraban como deberían.\n<br />- Mejorada la representación de las recetas de la fragua del atronatch y la cámara de imbuir.\n<br />- Nuevas mejoras en la interfaz de usuario para los menús y las notificaciones por pantalla.\n<br />- Gran actualización de las descripciones que acompañan los inventarios de objetos y magia, y de los árboles de habilidades del juego. Se han revisado al completo para establecer mejoras respecto a las actualizaciones anteriores, ofreciendo más detalles que no se mostraban de los efectos de cada uno de sus componentes y corrigiendo fallos que no se habían tratado.\n<br />- Varias mejoras aleatorias en objetos misceláneos del mundo y almacenables en el inventario.\n<br />- Pequeñas correcciones en otros objetos usables, como pergaminos y arañas, gemas de alma, localizaciones y llaves.\n<br />- Creación de voces en ciertos diálogos que no estabán traducidos, usando la voz del personaje afectado.\n<br />- Igualación de textos idénticos afectados en varios archivos diferentes (skyrim, dawnguard, unofficial patch...) con el fin de evitar posibles incoherencias.\n<br />- Traducción completa desde cero nuevamente del parche del Unofficial para eliminar errores que han perdurado. Se incluye nuevas ediciones en voces, debido a que el unofficial patch corrige ciertas partes de algunos diálogos que contenían errores en el doblaje original y que han continuado en el doblaje en español.\n<br />- Otras mejoras misceláneas y correcciones ortográficas. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Correcciones%20y%20mejoras%20de%20textos%20y%20voces-55496-10-5.rar?fid=1000265206&ttl=1535840309&ri=8192&rs=8192&setec=c5d48ff54be66e129eabec487ff5b807"
    },
    {
      "fileId": "1000265207",
      "name": "Compatibilidad con Unofficial Legendary Edition Patch",
      "version": "3.0.11",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "7705",
      "fileName": "Compatibilidad con Unofficial Legendary Edition Patch-55496-3-0-11.rar",
      "uploadedUnix": "1517402997",
      "modVersion": "3.0.11",
      "virusScanUrl": "https://www.virustotal.com/file/78084108bd75a158a21aebf1c59e6a759abb50f7ec2ba1dcd7c4d1ac3573beef/analysis/1517403059/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Compatibilidad%20con%20Unofficial%20Legendary%20Edition%20Patch-55496-3-0-11.rar?fid=1000265207&ttl=1535840309&ri=8192&rs=8192&setec=8593863dfcf91a660a6e37be48d24bd9"
    },
    {
      "fileId": "1000266831",
      "name": "Compatibilidad con Unofficial Legendary Edition Patch",
      "version": "3.0.12",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7860",
      "fileName": "Compatibilidad con Unofficial Legendary Edition Patch-55496-3-0-12.rar",
      "uploadedUnix": "1519207954",
      "modVersion": "3.0.12",
      "virusScanUrl": "https://www.virustotal.com/file/29de0670db7f4dd9a99d915ed01d58d38863c344a68e5e6bb1a7b5236154713c/analysis/1519208250/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Compatibilidad%20con%20Unofficial%20Legendary%20Edition%20Patch-55496-3-0-12.rar?fid=1000266831&ttl=1535840309&ri=8192&rs=8192&setec=0ef4c1ff78ffa0294c4d305a264b69bb"
    }
  ]
}