{
  "modId": 5550.0,
  "modName": "Potent Flame Thralls_More Bad-asser abilities and spells",
  "summary": "Hey.. if you are like me and got all the good perks in conjuration so your potent flame thralls could kick ass  only have them die or get killed too quickly and wish there was something you could do.. well now you can. With this Esp. All Flame thralls that are powered up by Elemental Potency that makes atronach 50% stronger now have way better atta",
  "descriptionHtml": "Hey.. if you are like me and got all the good perks in conjuration so your potent flame thralls could kick ass  only have them die or get killed too quickly and wish there was something you could do.. well now you can. With this Esp. All Flame thralls that are powered up by Elemental Potency that makes atronach 50% stronger now have way better attacks. The weak fireball spell will be replaced with INCINERATE (A blast of fire that does 60 points of damage. Targets on fire take extra damage) Instead of the weak Flame thrower spell they\\'ll have WALL OF FLAMES (Sprayed on the ground, it creates a wall of fire that does 50 points of fire damage per second) And when enemies get to close they\\'ll have to worry about FLAME CLOAK (\tFor 60 seconds, opponents in melee range take 8 points fire damage per second. Targets on fire take extra damage) \r\n\r\nIt\\'s fun for the whole family. Take advantage of this special right now!\r\n\r\nFor only 156 easy payments of $0.00 dollars this could be all yours !!!!\r\n\r\n\r\nAnd if you really want fire flying \\\" too and fro\\\" left and right up and down and all around I Suggest you look at this bad boy right here :\r\n\r\nConjuration Perks Overhaul by SteepledHat- http://www.skyrimnexus.com/downloads/file.php?id=3339",
  "categoryId": "75",
  "version": "1",
  "author": "Striarii",
  "createdUnix": "1325925296",
  "updatedUnix": "1325925820",
  "containsAdultContent": false,
  "uploadedBy": "Striarii",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17453",
      "name": "Potent Flame Thralls now have Superior Spells ",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Potent Flame Thralls now have Superior Spells -5550-1.zip",
      "uploadedUnix": "1325925820",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d35f347e459d0e9f2b6d9dab33a86222811c62b481945188628b6358ff5b9f06/analysis/1406590023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Potent%20Flame%20Thralls%20now%20have%20Superior%20Spells%20-5550-1.zip?fid=17453&ttl=1535762348&ri=8192&rs=8192&setec=5857fb2757e1a936f15d6145e1ff3e4a"
    }
  ]
}