{
  "modId": 55552.0,
  "modName": "Haafstad and the Border of High Rock",
  "summary": "Like my other mods, this one makes use of the worldspace behind the Skyrim border, offering you one Nordic Island with the town Haafstad. From there you can visit the bordering lordship Pinemarch in High Rock and sail to the remote Breton island Kirkmore. It adds 8 quests, 6 towns, new creatures, 2 player s homes in High Rock, and more.",
  "descriptionHtml": "[color=yellow][center][size=6][font=Comic Sans MS]~ WELCOME TO HAAFSTAD AND THE BORDER OF HIGH ROCK (a small High Rock DLC) ~[/font][/size][/center][/color] [size=4]\n<br />\n<br />[/size][color=yellow][center][font=Comic Sans MS][size=4]~ Go West and see new places! You want to go to High Rock? Who's stopping you? ~[/size][/font][/center][/color] \n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1519854604.jpg[/img]\n<br />\n<br />\n<br />Important: Dawnguard is needed to play this mod! You also have to unlock the Skyrim border.\n<br />\n<br />\n<br />[center][color=#ffff00][size=5]~ Huge chunk of landscaped Land behind the Skyrim Border ~\n<br />\n<br />[/size][/color][color=#ffff00][size=5]~ In Skyrim: Haafstad, fully functioning with NPC's ~\n<br />~ In High Rock: Lordship Pinemarch behind Skyrim's border ~\n<br />~In High Rock, new worldspace: Island Kirkmore ~\n<br />~ A total of Six towns, Eight Quests, Four dungeons~\n<br />~ A House for the Player in Pine Vale &amp; in Kirkmore, both in High Rock ~\n<br />~ New monsters, ingredients and fully voiced followers ~\n<br />~ AS-LAL Extension to start a new life here (by Jknjb) ~\n<br />~ Much More ~[/size][/color][/center]\n<br />\n<br />Location: northwest, behind the Skyrim border in High Rock!  No teleports, just travel. You want more land? You want more to explore? Let's HIGH ROCK! Navmeshed and cleaned with Tes5edit.\n<br />\n<br />With this mod, the territory of the Skyrim province itself is expanded; giving Skyrim an extra island (Haafstad), near the High Rock border.\n<br />\n<br />\n<br />[url=https://www.youtube.com/watch?v=L2TN28HdYWE]Haafstad and the Border of High Rock by Frosty on Youtube[/url]\n<br />[url=https://www.youtube.com/watch?time_continue=11&amp;v=YRITcLJ5caM]Haafstad and the Border of High Rock by myself on Youtube[/url]\n<br />[url=https://www.youtube.com/watch?v=2MPHBu9jfFs]A showcase of Haafstad ported over to Xbox by AngelofDeathXxx[/url]\n<br />[url=https://www.youtube.com/watch?v=addwC7x3m0c]Back to High Rock by IvanLeFou01 on Youtube[/url]\n<br />\n<br />\n<br />\n<br />[color=yellow]ABOUT HAAFSTAD (SKYRIM)_______________________________________________________________________________________________________\n<br />[/color]\n<br />Since the Miracle of Peace (3E 417), the Breton Kings unified High Rock after 150 years of struggle. One of the dangers were the Nords who occupied / reclaimed parts of east High Rock during the War of Bend'r-Mahk (3E 397). These Nords were driven away some \n<br />years later.\n<br />But in the far north, on an island, near the border of Skyrim, a group of Nords repelled their attacks and turned their settlement into a small, profitable trading centre. These Nords call their village Haafstad and they are linked with Solitude, although they stayed neutral during the civil war in Skyrim. \n<br />\n<br />As time passed, they made peace with the Bretons who in their turn, welcomed the trading Nords. Ships come from Lordship Pinemarch and even from the Breton island Kirkmore. In Haafstad, Breton and Nordic ships go on and off. And in these days (4E 201) Haafstad is led by a pirate who calls himself Captain One Eye (\"...because I have one eye\") and his hardened Nords. There lives a smith, an innkeeper, two mages, warriors, Old man Snorri (a potential follower) and more. \n<br />\n<br />It's a tough life. Captain One Eye has indeed one problem, he wants somebody to clear out an abandoned ship. It’s danger could be a possible threat to Haafstad and it's trade.\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1468703015.jpg[/img]\n<br />\n<br />[i]Haafstad, Skyrim. From there, you can take a ship to Kirkmore, High Rock.[/i]\n<br />\n<br />[img]http://staticdelivery.nexusmods.com/images/110/6616512-1455142886.jpg[/img]\n<br />\n<br />[i]Your follower in Haafstad: Old man Snorri. A senile old magician. He can fight well, but he started to deteriorate, and it shows.[/i]\n<br />\n<br />[color=yellow]ABOUT THE LORDSHIP PINEMARCH (HIGH ROCK)_______________________________________________________________________________________[/color]\n<br />\n<br />Onshore, the Lordship Pinemarch, just across the border in High Rock, is part of the Kingdom Jehanna. This Lordship contains the town Pine Vale, the settlement Haelth, a few farms, a castle and a strip of the coast. \n<br />\n<br />The High Rock border is guarded by Breton soldiers, accompanied by traders. A little further there is an inn, the Drunken Horse. It's innkeeper has a secret. He thought he heard just rats in his cellar. Turned out to be scamps and other creatures from Oblivion. It's up to you to help him.\n<br />Ps.: you have to click a few times on Stendar to let him talk with you. He is too busy pouring beer. Guess that's more important to him than talking with you....\n<br />\n<br />The main town of this Lordship is Pine Vale. This village is surrounded by pinetrees and mountains. It's cold and foggy. You can have a drink at a local pub where you can receive a quest and there is a small library where you can buy books. There is also a chapel of Kynareth. The most interesting this small village has is a simple player's home. It's a small house surrounded with pines. Inside there is on the second floor an alchemy table and next to it a barrel you can store your ingredients, since the barrel won't respawn. Also the chest near your bed is safe to store your goods. So if you are a Breton, and you ever wanted to have a home in High Rock, this is the mod!\n<br />You have to find the key though.\n<br />\n<br />Even more west, you can visit the settlement Haelth and the castle Pinemarch, tucked in the mountains. Castle Pinemarch is the seat of the Lord of Pinemarch, overlooking his territory. Lordship Pinemarch seems safe, but this is not the case. A Steeldragon passed the Skyrim border and settled in High Rock, not far away from this Lordship. With this dragon, also one of the surviving members of the blades took shelter in Pine Vale to avoid the Thalmor persecutions. Where is he? Can you resque him?\n<br />\n<br />\n<br />[color=yellow]ABOUT KIRKMORE (HIGH ROCK)_____________________________________________________________________________________________________[/color]\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1491126530.jpg[/img]\n<br />\n<br />\n<br />[i]Coast of Kirkmore, High Rock[/i]\n<br />\n<br />From the Nordic town Haafstad, you can take a ship, heading for the island Kirkmore. Kirkmore is about as big as 1 hold of Skyrim. It contains the main town Kirkmore and two smaller towns; Fyth Craig and Moch, both located north. It's mainly a green island, with lots of trees; aspens, pines you won't see in Skyrim, and also bigger trees, white and green bushes and lots of yellow/white harvestable flowers (mountainflowers, ghost bane and the 'yellow lad'). The northern part of the island, which is less urbanized, has a more red vegetation with pines. The creatures living there are rabbits, foxes, wild horses and wild dogs. But also creatures you won't see in Skyrim; rats, treants, sand crabs, [size=2]paralyzing[/size] Iliac spiders, phantoms and nightweepers.\n<br />\n<br />This island was colonised by mainly Northpointers from High Rock, in times the continent was occupied by the Direnni elves. It was much later that merchants from the Kingdom of Camlorn gave this island a commercial impulse and improved the trade. With the Bretons came horses and dogs. Some of them escaped their domestic lives and turned wild.\n<br />Kirkmore is ruled by a Lord and although not under the direct rule, it's Lord traditionally accepts the King of Northpoint as their King. Because of the traders from the continent, Kirkmore keeps healthy ties with the kingdom of Camlorn.\n<br />\n<br />The climate of Kirkmore is maritime temperate and is strongly regulated by the effects caused by the Eltheric Ocean. It's summers are pleasant and not too warm and it's winters are mild. This island, especially it's southern part, is generally warmer than the southern holds of Skyrim.\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1509656879.jpg[/img]\n<br />\n<br />[i]The Woods of southern Kirkmore (image by PTC001).[/i]\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1509722901.jpg[/img]\n<br />\n<br />[i]The Red Woods in northern Kirkmore.\n<br />\n<br />[/i]When you take the ship to Kirkmore, you'll be on an adventure. You'll hear and find information about the island and it's inhabitans along the way , but you'll soon discover that the centre of this island is a large tree. It is called The Guardian Tree, which might be compared with the Wyrd Trees on the continent in High Rock. It's power is still not fully understood by the people and therefore the tree is seen as a both a threat and a protector of nature and the island itself.\n<br />There are also other things and threats waiting to be discovered. In Fyth Craig lives an ' elder' , an important person of a certain area in Kirkmore, who's eager to help you when you are on a quest, even when you are accompanied by old man Snorri from Haafstad.\n<br />\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1491127082.jpg[/img]\n<br />\n<br />[i]Map of High Rock with Kirkmore, west of Camlorn. Haafstad can be found north of Jehanna and is part of Skyrim.[/i]\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1520118649.jpg[/img]\n<br />\n<br />[i]Map the island Kirkmore.[/i]\n<br />\n<br />When the player takes the ship to Kirkmore, he/she receives a quest. Along the way you can choose to have a follower named Fergus in Fyth Craig to join you. You'll enter a dark mine and fight skeleton guardians, dangerous Iliac spiders and strong phantoms (30+ level), which are quite hard to detect.\n<br />\n<br />[color=yellow]AS-LAL EXTENSION FOR HAAFSTAD, PINE VALE &amp; KIRKMORE______________________________________________________________________________[/color] \n<br />\n<br />This additional mod, made by [color=yellow]Jknjb [/color], which is also downloadable from this site, gives you the opportunity to start your character in several locations! \n<br />\n<br />Your character will spawn at the map marker in Haafstad, Pine Vale, the High Rock border, Kirkmore, Fyth Craig and Moch, depending on what you select.  You will start with a basic suit of iron armor, a set of steel weapons, a woodcutter's axe and a pickaxe, a set of clothes, 10 lockpicks, 10 restore health potions and 500 gold.\n<br />\n<br />\n<br />To play this mod, you need the Alternate Start-Live Another Life from [color=yellow]Arthmoor[/color] .\n<br />[url=http://www.nexusmods.com/skyrim/mods/9557/]Alternate Start-Live Another Life[/url]\n<br />\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1461006548.jpg[/img]\n<br />\n<br />[color=yellow]THIS MOD CONTAINS:_____________________________________________________________________________________________________________  [/color]\n<br />\n<br />[list][size=2] [/size][*][size=2]The village Haafstad on an island with small forest, NPC's and a quest[/size]\n<br />[*][size=2] The Lordship Pinemarch, containing the village Pine Vale, Haelth a farm and an inn. Pine Vale contains two quests.[/size]\n<br />[*][size=2]The Breton island Kirkmore, containing Kirkmore, Fyth Craig and Moch. Has 4 quests. [/size]\n<br />[*][size=2] The (guarded) border with High Rock, including an Inn[/size] with a dark dungeon and quest\n<br />[*][size=2] New creatures, ingredients, trees, flowers.[/size]\n<br />[*][size=2]Two homes for the player in (not in Skyrim but in ) HIGH ROCK (with barrel and chest, both don't respawn, plus a quest)[/size]\n<br />[*][size=2] Three followers.[/size]\n<br />[/list]\n<br />\n<br />Creaturelist:\n<br />\n<br />- Scamp: small greenish humanoid ceature from the realms of Oblivion. A scamp is hardly alone and found in a small group. Together, this group is a tough nut for even high level players. Can be found in the dungeon of the Dronken Horse.\n<br />- Iliac Bay Spider: the paralyzing TES II spider is back. Can be found in small groups everywhere, also in Kirkmore. These creatures might not have a lot of health, but once you are paralized, you have a big problem as they will eat you alive.\n<br />- Sand Crab: weak creatures like their counterparts in Skyrim. Can be found on the sandy beaches of Kirkmore.\n<br />- Rat: weak creatures like skeevers in Skyrim. These rats are NOT retextured skeevers, but real rats. Can be found in Kirkmore.\n<br />- Treant: peaceful walking trees, huge and strong. They guard the woods of Kirkmore.\n<br />- Skeleton Guardian: stronger skeleton with armor, tough enemy for low level players. Can be found everywhere.\n<br />- Nightweeper: peaceful spirits, guarding certain trees in Kirkmore. They only appear at night.\n<br />- Phantom: a powerful, transparant ghost (not to be compared with the ghosts in Skyrim) and even a tough enemy for high level players. Only to be found in Kirkmore.\n<br />- Steel Dragon: Can be found in the Sea of Ghosts.\n<br />- Black Dragon: Can be found east of Haafstad.\n<br />- Seagulls can be found in Kirkmore.\n<br />- Ducks can be found in Kirkmore.\n<br />- Different kinds of wild dogs, elks and a walrus (an Ontocetus from the Pleistocene) in Kirkmore.\n<br />\n<br />[color=yellow]HOW TO UNLOCK THE BORDERS:____________________________________________________________________________________________________ [/color]\n<br />\n<br />You have to edit the file Skyrim.ini. There are two locations where you can find this file. You should not have the one in your Skyrim data folder, where you put the mods for example, but the one in your General folder (I think it is: User/My Documents/My Games/Skyrim).\n<br />If you found the Skyrim.ini file, type: bBorderRegionsEnabled=0 in the section [General]. That should work. \n<br />\n<br />\n<br />[color=yellow]COMPATIBLE WITH:__________________________________________________________________________________________________________________________[/color]\n<br />\n<br />- Unique Border Gates\n<br />- Seapoint settlement\n<br />- Beyond Reach\n<br />\n<br />\n<br />[color=yellow]TRANSLATIONS OF THE HAAFSTAD MOD__________________________________________________________________________________________________________________________[/color]\n<br />\n<br />\n<br />[url=http://www.skycitizen.net/?view=POSTSOFUSER&amp;userid=86969&amp;post=181001]Chinese translation of the Haafstad mod[/url]\n<br />\n<br />[url=https://confrerie-des-traducteurs.fr/forum/viewtopic.php?f=190&amp;t=19854]French translation of Haafstad mod[/url]\n<br />\n<br />[url=http://skyrim.2game.info/detail.php?id=55552]Japanese translation of Haafstad mod[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90052/]Spanish translation of Haafstad mod[/url]\n<br />\n<br />\n<br />[color=yellow]__________________________________________________________________________________________________________________________[/color]\n<br />\n<br />\n<br />Team Beyond Skyrim creates High Rock at this moment, a team which I support fully, work with- and am part of. This part of High Rock I created is not directly linked with- and part of Beyond Skyrim's Hammerfell, nor have I used their assets.\n<br />\n<br />There could be some grammar mistakes; I am sorry. I am Dutch, not English. \n<br />\n<br />May Talos guide you and good luck; \n<br />\n<br />JoopvanDie\n<br />\n<br /> \n<br />[img]http://staticdelivery.nexusmods.com/images/110/6616512-1453579507.jpg[/img]\n<br />[i]Your house in Pine Vale, High Rock?[/i]\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1516373421.jpg[/img]\n<br />[i]Your house in Kirkmore, High Rock? With a balcony.[/i]\n<br />\n<br />[color=yellow]YOU WANT MORE? WE HAVE MORE :  [/color]\n<br />\n<br />If you like this mod, you might like:\n<br />[url=http://www.nexusmods.com/skyrim/mods/55551/]Nyhus and the border of Cyrodiil[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/58331/]Folkstead and the Border of Hammerfell[/url].\n<br />\n<br />Both mods are built behind the borders of Skyrim.\n<br />\n<br />\n<br />[color=orange]\n<br />MY THANKS GO TO:\n<br />- DUURANJP for making and uploading his Haafstad Movie - back in 2014.\n<br />- I want to thank Jknjb for making the AS-LAL Extension for Folkstead, Morreath and Vrostheim! And of course this couldn't have happened without Arthmoor, who made the Alternate Start-Live, thank you for your permission!\n<br />- Thanks Izzik for helping me making the worldmap of Kirkmore! Check out his [url=http://www.nexusmods.com/skyrimspecialedition/mods/7012/]Remove Map Camera Limits[/url]\n<br />- Thank you Jknjb, Spacepotato1, Laiilaiiheii and Tomoko Leenen to do some voice acting.\n<br />- Laiilaiiheii alias Frosty for making the wonderful video about my mods.\n<br />- PTC001 alias IvanLeFou01 for making the wonderful story about two npc's traveling to Kirkmore.\n<br />- The people playing my mods and posting their feedback, much appreciated.\n<br />- Credits go to Mr Siika for using his Seagulls [url=http://www.nexusmods.com/skyrim/mods/59578/]Mr Siika Seagulls[/url], to Newermind43 to use the Ancient Spriggan (I recalled it the Treant) and Hissssa to use the Rat, downloadable from GendunDrup's site  [url=http://www.nexusmods.com/skyrim/mods/49682/]Nexus Creature Resource[/url].\n<br />- Credits go to Mentha to use the red aspens [url=http://www.nexusmods.com/skyrim/mods/26192/]More Colorful Trees[/url] and to Elinen and Hoddminir to use the right pines and willows, my island needed from  [url=http://www.nexusmods.com/skyrim/mods/38651/]Hoddminir Plants and Trees[/url],  [url=http://www.nexusmods.com/skyrim/mods/55158/]Hoddminir Flowers[/url] and  [url=http://www.nexusmods.com/skyrim/mods/19066/]HoddminirGroundTextures[/url].\n<br />- Credits go to Stroti and Tamira for using the Market Stands [url=http://http://www.nexusmods.com/skyrim/mods/46785/]Strotis Market Stands[/url], and to Phitt and Tamira for using the Shacks [url=http://http://www.nexusmods.com/skyrim/mods/60125/]Phitt's Sheogorad Resource[/url].\n<br />- Thanks Bethesda for the fantastic game and Jeremy Soule for the beautiful music.\n<br />[/color]\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/images/110/6616512-1478283828.jpg[/img]\n<br />\n<br />[url=https://www.youtube.com/watch?v=aKBvjMKRCfY]JoopvanDie Trilogy Mods[/url]",
  "categoryId": "89",
  "version": "15",
  "author": "JoopvanDie",
  "createdUnix": "1404369692",
  "updatedUnix": "1519853849",
  "containsAdultContent": false,
  "uploadedBy": "Joopvandie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000203628",
      "name": "AS-LAL Ext Haafstad - Pine Vale -  Kirkmore Start",
      "version": "2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "6",
      "fileName": "AS-LAL Ext Haafstad - Pine Vale -  Kirkmore Start-55552-2.7z",
      "uploadedUnix": "1461004336",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/f596ec7bcce95f03a0ceb379ef4d61c711400fc7258157396b883c1fc469d938/analysis/1461004383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AS-LAL%20Ext%20Haafstad%20-%20Pine%20Vale%20-%20%20Kirkmore%20Start-55552-2.7z?fid=1000203628&ttl=1535840394&ri=8192&rs=8192&setec=6c4250d50f33ad63f791f1f9f3dfdfdc"
    },
    {
      "fileId": "1000234060",
      "name": "Jehanna ini",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "0",
      "fileName": "Jehanna ini-55552-.rar",
      "uploadedUnix": "1484774057",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7bebdae13011260a126ba32055c0b72ceb032b2851e72d3442f326ab42538ff4/analysis/1484774402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jehanna%20ini-55552-.rar?fid=1000234060&ttl=1535840394&ri=8192&rs=8192&setec=3144d4db9d495ac4f4367dde8ed7f392"
    },
    {
      "fileId": "1000244241",
      "name": "Haafstad 13",
      "version": "13",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "496995",
      "fileName": "Haafstad 13-55552-13.rar",
      "uploadedUnix": "1494714172",
      "modVersion": "13",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2013-55552-13.rar?fid=1000244241&ttl=1535840395&ri=8192&rs=8192&setec=cebb042c9defb1b30f3d82bb20b33145"
    },
    {
      "fileId": "1000244243",
      "name": "Haafstad extra LOD 13",
      "version": "13",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "519891",
      "fileName": "Haafstad extra LOD 13-55552-13.rar",
      "uploadedUnix": "1494715325",
      "modVersion": "13",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%20extra%20LOD%2013-55552-13.rar?fid=1000244243&ttl=1535840395&ri=8192&rs=8192&setec=945f8f11231939fa2b21353f225a4032"
    },
    {
      "fileId": "1000249371",
      "name": "Row row row your boat. By Jknjb",
      "version": "1.1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1827",
      "fileName": "Row row row your boat. By Jknjb-55552-1-1.rar",
      "uploadedUnix": "1500019110",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0dc473d6d9075febdf87a528e88113df258321ea510ad2dfb8f8e171dc188364/analysis/1500019361/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Row%20row%20row%20your%20boat.%20By%20Jknjb-55552-1-1.rar?fid=1000249371&ttl=1535840396&ri=8192&rs=8192&setec=1f213f0676c4b8e45d1e63e858757003"
    },
    {
      "fileId": "1000253043",
      "name": "Haafstad extra LOD 13.1",
      "version": "13.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "547239",
      "fileName": "Haafstad extra LOD 13.1-55552-13-1.rar",
      "uploadedUnix": "1503867798",
      "modVersion": "13.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%20extra%20LOD%2013.1-55552-13-1.rar?fid=1000253043&ttl=1535840396&ri=8192&rs=8192&setec=bf4dce4d91d78c98f5c8b93515e800b2"
    },
    {
      "fileId": "1000253044",
      "name": "Haafstad 13.1",
      "version": "13.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "511861",
      "fileName": "Haafstad 13.1-55552-13-1.rar",
      "uploadedUnix": "1503867803",
      "modVersion": "13.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2013.1-55552-13-1.rar?fid=1000253044&ttl=1535840397&ri=8192&rs=8192&setec=0c5466d1c6bc336fb61ea9816e07bf0f"
    },
    {
      "fileId": "1000258236",
      "name": "Haafstad extra LOD 13.2",
      "version": "13.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "545252",
      "fileName": "Haafstad extra LOD 13.2-55552-13-2.rar",
      "uploadedUnix": "1509050214",
      "modVersion": "13.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%20extra%20LOD%2013.2-55552-13-2.rar?fid=1000258236&ttl=1535840397&ri=8192&rs=8192&setec=464cda0d7ec4e1005f9d88f960694aa4"
    },
    {
      "fileId": "1000258238",
      "name": "Haafstad 13.2",
      "version": "13.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "522121",
      "fileName": "Haafstad 13.2-55552-13-2.rar",
      "uploadedUnix": "1509050679",
      "modVersion": "13.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2013.2-55552-13-2.rar?fid=1000258238&ttl=1535840398&ri=8192&rs=8192&setec=5708dfcbfbb811a33c08c8187c58f06b"
    },
    {
      "fileId": "1000264318",
      "name": "Haafstad 14",
      "version": "14",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "541697",
      "fileName": "Haafstad 14-55552-14.rar",
      "uploadedUnix": "1516369620",
      "modVersion": "14",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2014-55552-14.rar?fid=1000264318&ttl=1535840398&ri=8192&rs=8192&setec=57ef1c8253bad443ee984ad2919c54f0"
    },
    {
      "fileId": "1000264320",
      "name": "Haafstad14extraLod",
      "version": "14",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "541697",
      "fileName": "Haafstad14extraLod-55552-14.rar",
      "uploadedUnix": "1516372162",
      "modVersion": "14",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad14extraLod-55552-14.rar?fid=1000264320&ttl=1535840399&ri=8192&rs=8192&setec=b3fe933367455495846d9a3e21967a26"
    },
    {
      "fileId": "1000264372",
      "name": "Haafstad 14 extra Lod. The first ' 14th' version didn't work properly.",
      "version": "14",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "575661",
      "fileName": "Haafstad 14 extra Lod. The first ' 14th' version didn't work properly.-55552-14.rar",
      "uploadedUnix": "1516445235",
      "modVersion": "14",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2014%20extra%20Lod.%20The%20first%20%27%2014th%27%20version%20didn%27t%20work%20properly.-55552-14.rar?fid=1000264372&ttl=1535840399&ri=8192&rs=8192&setec=c4b4fb99d9a86c9e0653e90982e39a75"
    },
    {
      "fileId": "1000265974",
      "name": "Haafstad 14.1",
      "version": "14.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "575632",
      "fileName": "Haafstad 14.1-55552-14-1.rar",
      "uploadedUnix": "1518199966",
      "modVersion": "14.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2014.1-55552-14-1.rar?fid=1000265974&ttl=1535840400&ri=8192&rs=8192&setec=3903c6b871bbc13b4c2c978a77dc3725"
    },
    {
      "fileId": "1000265975",
      "name": "Haafstad 14.1 extra Lod",
      "version": "14.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "589125",
      "fileName": "Haafstad 14.1 extra Lod-55552-14-1.rar",
      "uploadedUnix": "1518200353",
      "modVersion": "14.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2014.1%20extra%20Lod-55552-14-1.rar?fid=1000265975&ttl=1535840400&ri=8192&rs=8192&setec=870aafaa20b47d1f7d366d2e389f0bca"
    },
    {
      "fileId": "1000267457",
      "name": "Haafstad 15",
      "version": "15",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "593220",
      "fileName": "Haafstad 15-55552-15.rar",
      "uploadedUnix": "1519853166",
      "modVersion": "15",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2015-55552-15.rar?fid=1000267457&ttl=1535840401&ri=8192&rs=8192&setec=c8784b620b7ecf49012060a38f1d83c9"
    },
    {
      "fileId": "1000267458",
      "name": "Haafstad 15 extra Lod",
      "version": "15",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "609417",
      "fileName": "Haafstad 15 extra Lod-55552-15.rar",
      "uploadedUnix": "1519853849",
      "modVersion": "15",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Haafstad%2015%20extra%20Lod-55552-15.rar?fid=1000267458&ttl=1535840402&ri=8192&rs=8192&setec=c32fc235ea107af1b4363ec7efc72034"
    }
  ]
}