{
  "modId": 55570.0,
  "modName": "Asa&#39;s Amazing ENB Photo Comparison-Highlight Compilation",
  "summary": "Folder containing all photos from my comparison plus single ENB screenshots.\r<br />he comparison photos are 5759x4316. A very large resolution, as a result the photos in the description are very small, hard to focus on, so this folder contains all photos so you can zoom in as close as you want to compare them individually. ",
  "descriptionHtml": "All credits go to Bethesda, for making such a beautiful game, to Boris Voronstov for ENB, and to the talented people who made these ENB presets for making this game infinitely more beautiful&#33;\r<br />\r<br />[size=5][color=red]Notice&#33;:\r<br />[/color][/size]All ENBs have dozens of brightness settings in the enbseries.ini file and any light levels can be edited to your liking, as well as any other settings. All of these screenshots are using default enbseries.ini settings and Climates Of Tamriel. \r<br />My comparison is NOT an accurate representation of how the Aeon ENB should look. I did not have it installed correctly and will re-take the photos for it and will upload and updated file download. \r<br />\r<br />[size=5]Introduction:[/size]\r<br />This is my attempt at making some comparison shots of several ENBs. Ones I personally like, some that are more popular, and some that maybe do not get enough love.\r<br />This comparison was NOT made to show how some ENBs are &#34;better&#34; or &#34;worse&#34; than others. That all boils down to your own personal tastes.\r<br />The reason for this compilation was that it sounded like fun, I like to do fun things, I think you do too, and I had fun making them.\r<br />Please do not get upset if you do not see an ENB that you think should, or deserves, to be showcased.\r<br />Please leave a comment and suggest anything, and I will gladly make more of these and include other ENBs. Tips and suggestions are extremely welcome&#33;\r<br />\r<br />[size=5]Information:[/size]\r<br />Under each photo will be a list of mods specific to that photo as well as time and weather, also my opinions of the ENBs and environmental settings. All ENBs have the recommended and necessary changes made to the skyrimprefs.ini, enblocal.ini, and etc...\r<br />Mods used in all photos are Tamriel Reloaded, Static Mesh Improvement Mod, Climates Of Tamriel, Vivid Landscapes - Rocking Stones, and Realistic Water Two + 2k ENB Textures.\r<br />My brightness setting is 5 ticks from the darkest, so it is about 1/3 of the way up the slider. Certain ENBs will need their brightness settings tweaked for optimal viewing pleasure, I kept them all the same though for consistent testing purposes.\r<br />\r<br />[size=5][color=red]Disclaimer:[/color][/size]\r<br />Majority of what you are about to read are opinions, my opinions, on several ENBs. Take that lightly and only take away information from this. I am not looking to offend anyone. Please share your opinions in the comments.\r<br />\r<br />[heading][/heading]\r<br />\r<br />Location: Whiterun, Time: 10AM, Weather: Clear\r<br />[url=https://flic.kr/p/oajDfu][img]https://farm4.staticflickr.com/3861/14545334684_9975ca2a15_c.jpg[/img][/url]\r<br />Mods: Tamriel Reloaded (Optional Whiterun Textures), Real Wood Textures, The Bosmeric Drunken Huntsman.\r<br />\r<br />This being my first photo made, what I really noticed was the shadow cast by the Bannered Mare, and how some ENBs focus highly on shadows being dark and lights being bright, and some focus more on ambient lighting and colors.\r<br />Saraan Suum gets the gold from me. The shadows are impressive, the lighting gives the setting a very atmospheric view, and the colors are crisp and not over saturated. \r<br />\r<br />Location: Honningbrew Meadery, Time: 8AM, Weather: Clear\r<br />[url=https://flic.kr/p/nSYVjH][img]https://farm6.staticflickr.com/5562/14360422577_31f38e94c5_c.jpg[/img][/url]\r<br />Mods: Cobby Lodge, Real Wood Textures, and Hybrids HD Plants and Herbs Retexture.\r<br />\r<br />In this photo, more than the first one, I really noticed how some ENBs focus more on shadows and realistic feeling, directional lighting, and some focus more on ambient lighting and vibrant colors.\r<br />For this round, Somber 3 wins it for me. I think the time and weather played a large part in this photo, and for viewing pleasure outside of game, I believe it has the best attributes.\r<br />\r<br />Location: Western Watchtower, Time: 6PM, Weather: Clear\r<br />[url=https://flic.kr/p/nSYoPW][img]https://farm6.staticflickr.com/5273/14360319988_6638ed0d7e_c.jpg[/img][/url]\r<br />Mods: Enhanced Distant Terrain 2,\r<br />\r<br />[color=red]Remember kids&#33; Don&#39;t stare at the sun&#33;[/color]\r<br />Great comparison showing the differentiation of direct sunlight from the setting sun. Most of these ENBs have a beautiful blooming from the horizon over the peaks of the distant mountains, however, Poupouri First Seed has an intense sunset, beautiful, yet intense. It gives a similar feeling in game as having the sun in your direct line of sight in real life. It is difficult to have on your screen, and I found myself trying to not look directly at it, by diverting my sight away from it to the left and right, which gives it a unique, realistic aura. Something that does not happen so often in video games. \r<br />Saraan Suum wins this round again for me however. The intense bloom effect from the sunset compared to the lower light level area on the ground contrasts very well and works great for a sunset. \r<br />\r<br />Location: Falkreath, Time: 8PM, Weather: Overcast\r<br />[url=https://flic.kr/p/oanUdY][img]https://farm4.staticflickr.com/3894/14545970392_cfc80e5431_c.jpg[/img][/url]\r<br />Mods: Skyrim Bigger Trees, TreesHD_Skyrim_Variation.\r<br />\r<br />Falkreath is an area I love, and I love the darker ENBs. As a result, the darker ENBs give the Falkreath area a very eerie, mysterious feeling. However, some ENBs are just too dark with normal COT settings and need the brightness adjusted up or COT settings altered. \r<br />WINNER WINNER CHICKEN DINNER&#33; It&#39;s a tie here for me between Somber 3 and The Grim And Somber Enchanted ENB. Both are quite dark and have a way of keeping colors noticeable, and as a result they feel amazing to play with. While taking these photos, I walked around the Falkreath area for about 2 hours, just exploring, because these two ENBs made Falkreath feel like what I think Bethesda meant for it to feel like.\r<br />\r<br />Location: Morthal Marshes, Time: 10:30AM, Weather: Clear\r<br />[url=https://flic.kr/p/nSY3UC][img]https://farm4.staticflickr.com/3922/14360252980_e0007de611_c.jpg[/img][/url]\r<br />Mods: TreesHD_Skyrim_Variation.\r<br />\r<br />As I am sure you are aware of by now, I am a sucker for shadows and lighting. In this particular instance, Sharpshooters Classic is doing a lot for me. The shadows are very crisp, and the light has a very clean appearance. K ENB gets an honorable mention for its realistic colors and contrast of light and dark, very playable in game, but not so much for photography aspects.\r<br />\r<br />Location: Nightgate Inn, Time 6AM, Weather: Light Snow\r<br />[url=https://flic.kr/p/oaTUrq][img]https://farm3.staticflickr.com/2917/14551824474_2285ec59d4_c.jpg[/img][/url]\r<br />Mods: No Snow Under The Roof, Real Wood Textures, Skyfix - Unique Inn Signs, Better Dynamic Snow, and Quality Snow HD 4k.\r<br />\r<br />I did not realize how beautiful this setting was until after I had chosen it. Depending on which ENB you are using, 6AM may be too early, and you might need to wait till 8 or 9AM to get an equal view.\r<br />This was the first time where I thought Grim&#39;s Vintage Somber would be visually pleasing. The way it lights up the neighboring valley as jaw dropping. The fog has a bright golden glow,while the are not yet reached by direct sunlight is still dark.\r<br />It is strong, but it does not win it for me this time. Somber Antique 2 takes the win for me. Warm colors and dark shadows. It is exactly what I would imagine this view would look like in real life, or maybe a fantasy. Those two are polar opposites though, so what ever.\r<br />\r<br />Location: Nightgate Inn, Time: 4PM, Weather: Snow\r<br />[url=https://flic.kr/p/ob2XRg][img]https://farm6.staticflickr.com/5574/14553396845_ff7a48571a_c.jpg[/img][/url]\r<br />Mods: Better Dynamic Snow and Quality Snow HD 4k.\r<br />\r<br />As soon as I loaded the game up with this ENB, I knew it was special. No other ENB, that I know of, can give this feeling. The feeling of actually being in a blizzard. Poupouri First Seed has achieved that. This ENB makes me want to wonder around a winter wonder land of blizzardness. You cannot see for shit in the snow with this ENB, only about 10 meters, which gives it a very unique, realistic feel that I did not know I wanted from snow in Skyrim. I will for sure be having a snow day using this ENB.\r<br />\r<br />Location: Outside Blind Cliff Cave, Time: 9AM, Weather: Clear\r<br />[url=https://flic.kr/p/nTCSiZ][img]https://farm3.staticflickr.com/2917/14367826699_1b54973ae5_c.jpg[/img][/url]\r<br />Mods: N/A\r<br />\r<br />Not many impressed me in this setting, other than Saraan Suum and Somber 3. Saraan Suum&#39;s sun rays are very warming and the light blooming over the mountain adds to that. Somber 3 gives the terrain a very soft feel, the ground is easy to look at because the light levels of objects are not too contrasting. \r<br />\r<br />Location: Outside Blind Cliff Cave, Time: 5:15PM, Weather: Overcast\r<br />[url=https://flic.kr/p/ocVXNZ][img]https://farm3.staticflickr.com/2898/14574859033_7a1618c057_c.jpg[/img][/url]\r<br />Mods: N/A\r<br />\r<br />Poupouri First Seed + COT + Fog = Badass volumetric, thick fog. Enough said.\r<br />Saraan Suum, Somber 3, and The Grim And Somber Enchanted ENBs all look great, but dat fog do&#33;\r<br />Gave me a whole new view on how The Reach can look.\r<br />\r<br />Location: Gray Pine Goods\r<br />[url=https://flic.kr/p/nTFjmW][img]https://farm6.staticflickr.com/5591/14368304558_92dcc0428f_c.jpg[/img][/url]\r<br />Mods: ELFX, Real Wood Textures, and Silly Level of Detail - Potions and Poisons.\r<br />\r<br />Saraan Suum and The Grim And Somber Enchanted ENBs have a very cool cinematic feeling to them, which is great for interiors. They might, however, stray a bit far off the path into the unrealistic territory. \r<br />I think Realvision Classic is where it&#39;s at for interiors with this type of lighting. Not just the shadows cast by the light sources, but the ambient shadows around the objects are outstandingly realistic. I found it hard to see the lines where the objects meet the surface they are sitting on, which in my opinion is very life like lighting.\r<br />\r<br />Location: The Apprentice Stone, Time: 9:15AM, Weather: Rain\r<br />[url=https://flic.kr/p/obgsG6][img]https://farm4.staticflickr.com/3847/14556030325_4e455ee25b_c.jpg[/img][/url]\r<br />Mods: Vivid Landscapes - Birthsigns and TreesHD_Skyrim_Variation.\r<br />\r<br />[color=#43B7BA]Rain, rain, come again...[/color] \r<br />Rain is very thick, and heavy in the Saraan Suum ENB, which some people may or may not like, becuase it&#39;s different than default rain and most other ENBs. Somber Antique 2 and Somber 3 have very similar rain, being made by the same creators attributes to that, and it is a very pleasant rain. Much more realistic than default and most other ENBs, but softer than Saraan Suum, but still impressive. \r<br />\r<br />Location: The Apprentice Stone, Time: 6:30AM, Weather: Overcast\r<br />[url=https://flic.kr/p/od3tev][img]https://farm4.staticflickr.com/3915/14576128683_f2bab65ce6_c.jpg[/img][/url]\r<br />Mods: Skyrim Bigger Trees.\r<br />\r<br />Settings like these are where Poupouri First Seed covers up the beauty behind the fog, and ones like Somber Antique 2, Saraan Suum, Somber 3, and The Grim And Somber Enchanted ENBs show their colors. I couldn&#39;t pick a winner here, too many look amazing.\r<br />\r<br />Location: Solitude Docks, Time: 9:15AM, Weather: Clear\r<br />[url=https://flic.kr/p/ob8jAS][img]https://farm4.staticflickr.com/3856/14554442214_17a7131a44_c.jpg[/img][/url]\r<br />Mods: Real Wood Textures and Lanterns Of Skyrim.\r<br />\r<br />Saraan Suum takes the lead again. Provides very crisp lighting and vibrant colors. Poupouri First Seed did the opposite. It gave the setting a very cold and dark feeling that is attributed to a lot of docks in movies and novels. They both have strong points, but for realism purposes based on the weather and time of day, Saraan Suum wins. Honorable mention to Somber 3 for the very drinkable looking water.\r<br />\r<br />[heading][/heading]\r<br />\r<br />[url=https://flic.kr/p/oatnsF][img]https://farm4.staticflickr.com/3851/14547037575_ab58d0bfec_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nSZ9G4][img]https://farm3.staticflickr.com/2939/14360467547_2e43525fa8_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nSYyuC][img]https://farm4.staticflickr.com/3849/14360352508_5393f8eefd_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/oakxPs][img]https://farm4.staticflickr.com/3925/14545511524_812a8097fe_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nTwvzz][img]https://farm4.staticflickr.com/3901/14366586287_4dcec07eef_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nTAYJE][img]https://farm4.staticflickr.com/3885/14367458090_777d0c3c2d_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/ocSP9v][img]https://farm4.staticflickr.com/3889/14574244553_7e50b8eac8_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nTECw6][img]https://farm4.staticflickr.com/3840/14368170529_2eb33410ef_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/oaPKoa][img]https://farm3.staticflickr.com/2897/14551013561_c333380433_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/o95Svy][img]https://farm4.staticflickr.com/3887/14531331226_a521a950fa_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/obeRJ9][img]https://farm4.staticflickr.com/3868/14555717592_fee15ca882_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nTFk2L][img]https://farm6.staticflickr.com/5584/14368306810_c9b39142a5_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nTLSnb][img]https://farm4.staticflickr.com/3878/14369387780_b6c220daca_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/obgLHr][img]https://farm3.staticflickr.com/2940/14556090955_56b95ac244_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nTPziJ][img]https://farm6.staticflickr.com/5478/14369915728_835bfcb074_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/o9gCuq][img]https://farm6.staticflickr.com/5563/14533430296_0b8d543607_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/obKRxs][img]https://farm6.staticflickr.com/5510/14561570332_e4135f5e15_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nTCqqs][img]https://farm3.staticflickr.com/2934/14367739610_d186326078_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/obFExw][img]https://farm6.staticflickr.com/5237/14560752884_042a9d06c2_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/obQ9yB][img]https://farm6.staticflickr.com/5476/14562408035_9f0d8ce696_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/obKXzs][img]https://farm6.staticflickr.com/5567/14561590632_6e6273fa11_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nUkEuN][img]https://farm4.staticflickr.com/3890/14375786550_44520ba1a1_c.jpg[/img][/url]\r<br />\r<br />[url=https://flic.kr/p/nUkEps][img]https://farm6.staticflickr.com/5578/14375786240_0061a7f9dc_c.jpg[/img][/url]\r<br />\r<br />And that&#39;s all folks.\r<br />Look forward for more to come?\r<br />Leave your opinions and suggestions in the comments.",
  "categoryId": "97",
  "version": "1.0",
  "author": "Asa",
  "createdUnix": "1404414534",
  "updatedUnix": "1405984844",
  "containsAdultContent": false,
  "uploadedBy": "AsaHerring",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115733",
      "name": "Asa&#39;s ENB Compilation Comparisson",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "479900",
      "fileName": "Asa's ENB Compilation Comparisson-55570-1.rar",
      "uploadedUnix": "1404414022",
      "modVersion": "1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Asa%27s%20ENB%20Compilation%20Comparisson-55570-1.rar?fid=1000115733&ttl=1535840425&ri=8192&rs=8192&setec=7d6f9d8efee80b555a475d5c04609211"
    },
    {
      "fileId": "1000118651",
      "name": "Download This File If You Just Want To Endorse",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "890",
      "fileName": "Download This File If You Just Want To Endorse-55570-1-0.rar",
      "uploadedUnix": "1405984844",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bb66ab6a25b90dadafd847de37f2fd9d1e6affe64f19a95256e088967d5d1546/analysis/1406010863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Download%20This%20File%20If%20You%20Just%20Want%20To%20Endorse-55570-1-0.rar?fid=1000118651&ttl=1535840426&ri=8192&rs=8192&setec=930926498bba51f0fd252491dab6663f"
    }
  ]
}