{
  "modId": 55609.0,
  "modName": "Serana No More Skyrim Weather comment outside Skyrim - DELETED",
  "summary": "With this mod, Serana won&#39;t longer talk about &#34;that beatiful Skyrim weather&#34; while she is not in Skyrim (Solstheim, Falskaar, etc)",
  "descriptionHtml": "[b][color=#ff0000]THIS MOD ISN&#39;T NEEDED ANYMORE. UNOFFICIAL DAWNGUARD PATCH FIXED THIS IN VERSION 2.0.6[/color][/b]\r<br />I&#39;ll leave the file anyway since I don&#39;t like to delete pages and break links.\r<br />\r<br />This is a very simple mod that fixes the Serana dialogue line &#34;This must be that beautiful Skyrim weather I&#39;ve always heard about.&#34; so that she doesn&#39;t longer say it while she is not in Skyrim. Like for example, in Solstheim (or Morrowind if you have Shadow of Morrowind), Falskaar, the future beyond skyrim projects, or any other mods with their own world spaces.\r<br />\r<br />I always found it very annoying - I would shoot an arrow on her face every time it happened - so I took the 1 minute time necessary to fix that.\r<br />\r<br />Requeriments: unofficial dawnguard patch, although for no special reason, just because I specified it as master (unofficial dawnguard patch doesn&#39;t touch this dialogue line anyway)\r<br />\r<br />English and spanish versions included in the rar. The language only affects the subtitle of that line (and only that line), audio will stil be in the native Skyrim language.\r<br />\r<br />Uninstall: just disable and delete. This mod doesn&#39;t have scripts, and doesn&#39;t have its own forms, so nothing bad happens if enabling it and disabling it all the times you want.",
  "categoryId": "95",
  "version": "0.1",
  "author": "vagonumero12",
  "createdUnix": "1404518248",
  "updatedUnix": "1404518244",
  "containsAdultContent": false,
  "uploadedBy": "vagonumero12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000115935",
      "name": "Serana weather comment fix ",
      "version": "0.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1",
      "fileName": "Serana weather comment fix -55609-0-1.rar",
      "uploadedUnix": "1404518244",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/668c294cc1fa77d3584f8fd77cc7a9d91143e2cb87cc100418b2f7a496aa330d/analysis/1408161069/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Serana%20weather%20comment%20fix%20-55609-0-1.rar?fid=1000115935&ttl=1535840481&ri=8192&rs=8192&setec=55bd00a7b9c366e2f9ca315b9b2ca066"
    }
  ]
}