{
  "modId": 55647.0,
  "modName": "Weapon Types Matter",
  "summary": "Adds a new element to combat by dividing all weapons into two categories. All weapons are either effective against living or undead enemies; never both.",
  "descriptionHtml": "[heading]Overview[/heading]\r<br />Weapon Types Matter adds a new element to combat by dividing all weapons into two categories: Natural and Arcane. All weapons are either effective against living or undead enemies; never both. It does this via a hidden perk that is added to the player that looks for keywords in the player&#39;s weapon and target (similar to the way the vanilla silver sword bonus is calculated).\r<br />\r<br />Like The Witcher, which WTM was inspired by, this means you&#39;ll need to keep at least one weapon from each of the two categories with you. If you attack an enemy with a weapon type that is not effective against it, your weapon&#39;s damage will be reduced by 75% (enchantments are unaffected).\r<br />\r<br />Please keep in mind that this is currently in beta, so please keep a lookout for any bugs. Also, let me know if you encounter something doesn&#39;t make sense at ALL (e.g. an obviously ghost-like enemy that is weak to Natural weapons).\r<br />\r<br />I would like to implement customization via MCM in the future. I can&#39;t make any promises, but if it does happen it won&#39;t be for a while. In the meantime, this mod is actually VERY easy to customize for yourself in Creation Kit. Just familiarize yourself with how perk entries work and all you&#39;ll really have to do is customize some conditions and values to what you see fit.\r<br />\r<br />[heading]Details[/heading]\r<br />[b]Arcane Weapons[/b] (Effective vs Ghosts, Undead, Daedra, Werewolves, Werebears, Wisps, and Shades):\r<br />[list]\r<br />[*] Silver Weapons\r<br />[*]Elven Weapons\r<br />[*]Glass Weapons\r<br />[*]Ebony Weapons\r<br />[*]Daedric Weapons / Daedric Artifacts\r<br />[*]Stalhrim Weapons (Requires Dragonborn)\r<br />[*]Bound Weapons\r<br />[*]Nightingale Weapons\r<br />[*]Dragon Priest Daggers\r<br />[*]Ghostly Draugr Weapons (e.g. Drainblood Battleaxe)\r<br />[/list]\r<br />[b]Natural Weapons[/b] (Effective vs everything else):\r<br />[list]\r<br />[*]All weapons of materials not listed above (e.g. Iron, Steel, etc)\r<br />[*]Any unique weapons that do not have any set material keyword that are also not specified to be Arcane by the mod (e.g. Wuuthrad)\r<br />[/list]\r<br />[heading]Installation/Uninstallation[/heading]\r<br />[b]To safely install:[/b]\r<br />[list=1]\r<br />[*]Save your current game while out of combat.\r<br />[*]Download mod. (Make sure to download the right one, depending on what DLC you have).\r<br />[*]Drop the .esp into .../Skyrim/Data (or install/activate using MO or NMM). Make sure it&#39;s checked.\r<br />[*]Load game.\r<br />[*]Open the console (while still out of combat) and type &#34;player.addperk XX000D62&#34; without the quotes, &#34;XX&#34; being WTM&#39;s mod index number in your load order.\r<br />[*]Save game.\r<br />[/list]\r<br />[b]To safely uninstall/update:[/b]\r<br />[list=1]\r<br />[*]Open the console (while out of combat) and type &#34;player.removeperk XX000D62&#34; without the quotes, &#34;XX&#34; being WTM&#39;s mod index number in your load order.\r<br />[*]Save game.\r<br />[*]Remove the .esp from .../Skyrim/Data (or uninstall/deactivate using MO or NMM).\r<br />[*](If updating to newer version) Install newer version using above installation process.\r<br />[/list]\r<br />[heading]Compatibility[/heading]\r<br />I purposefully made this mod as simple as possible, since I wanted to add it to my already heavily modded game without it breaking anything. Because of this, it does not alter anything except the vanilla silver weapon hidden perk. The only thing it adds is the custom perk. The perk reads the keywords of the player&#39;s equipped weapon (and in some cases the base ID) and the keywords/race of the player&#39;s target, and modifies weapon damage accordingly.\r<br />\r<br />This means that WTM should be compatible and not interfere with any mod (including overhaul mods like SkyRe or Requiem). Any custom weapon or creature mods should also be perfectly fine, as long as the mod author included keywords that make sense.\r<br />\r<br />For example, if you have a mod-added sword called &#34;Silver Sabre,&#34; but that weapon does not have the keyword &#34;WeapMaterialSilver&#34; attached to it, this mod will treat the weapon as Natural rather than Arcane. This will not break either mod, it just will make things inconsistent among different types of weapons.\r<br />\r<br />In the case of bound weapons, those are detected using the weapon&#39;s base ID. This means if there are any custom-made bound weapons, they will be treated as natural rather than arcane. Again, this will not break anything; just make things inconsistent.\r<br />\r<br />If you encounter issues like this, it should be pretty simple to edit the mod being affected and add appropriate weapon material keywords to the affected weapons.\r<br />\r<br />WTM will not work as intended with any mod that removes or alters the vanilla keywords for weapons or creatures (not sure if any mods like this exist, but I&#39;ll mention it anyways). It won&#39;t break other mods, but if all the keywords are changed or removed, it will just treat all weapons as natural and you&#39;ll be screwed when fighting undead.\r<br />\r<br />[heading]FAQs[/heading]\r<br />[b]&#34;Is this mod balanced?&#34;[/b]\r<br />\r<br />Yes, but keep in mind this mod will cause a difficulty spike in the early parts of a new game, before the player can readily access higher tiers of weapons or enchantments. Play smart and avoid overwhelming encounters with the undead until you get your hands on an arcane weapon.\r<br />\r<br />[b]&#34;Is WTM lore-friendly?&#34;[/b]\r<br />\r<br />Mostly yes, but in some ways no. The weapon materials I chose were mostly for balance/gameplay reasons, but I did try to keep TES lore in mind. Examples of things that are NOT lore-friendly: Dawnguard weapons are steel, but vampires are undead (I may edit the perk in a future version to force Dawnguard weapons to be arcane). In-universe, dragons are definitely not natural beings, but this mod categorizes both dragons and dragonbone weapons as natural.\r<br />\r<br />[b]&#34;Why are my elven arrows inneffective against undead?&#34;[/b]\r<br />\r<br />When using a bow/crossbow, ammo type does not matter. Example: Using a hunting bow with elven arrows is still only effective against living natural creatures.\r<br />\r<br />[b]&#34;My follower is still doing normal amounts of damage, regardless of their weapon. Why?&#34;[/b]\r<br />\r<br />WTM only affects the player attacking others. In the interest of simplicity, leaving NPCs and weapons unaltered was the best course of action.\r<br />\r<br />[b]&#34;Why are silver weapons the only weapons that say anything about being effective against the undead?&#34;[/b]\r<br />\r<br />This is leftover from the vanilla game. Since I did not alter any weapons, the Silver Sword/Greatsword description will still say &#34;Especially effective against undead&#34; even though this mod removes that bonus.\r<br />\r<br />[b]&#34;Why, in my inventory, does my weapon have X damage when it usually has Y damage?&#34;[/b]\r<br />\r<br />Do not worry. If you happen to open your inventory while this mod&#39;s perk conditions are met, it will temporarily show the modified weapon damage value. This is unavoidable due to the nature of perks in the game, but it does not harm anything.\r<br />\r<br />[b]&#34;I installed the mod but nothing changed.&#34;[/b]\r<br />\r<br />You probably didn&#39;t follow the installation instructions and forgot to give yourself the perk through the console. I use a console command for installation because it seemed easier and less intrusive than needlessly including quests and scripts to install such a simple mod. This may change if the mod gets more complex in the future.\r<br />\r<br />[heading]Known Bugs[/heading][list]\r<br />[*]Currently None\r<br />[*]If you think you found a bug, please check the FAQ section above first. The issue may be explained there.\r<br />[/list]\r<br />[heading]Version History[/heading][list]\r<br />[*]Version 0.6 - Wisps, Shades, Ash Spawn, Werebears, Magic Anomalies, and Ice Wraiths are now affected by Arcane instead of Natural. Forced Ash Spawn weapons as Arcane, in case of mods that make them playable.\r<br />[*]Version 0.5 - Initial Beta Release\r<br />[/list]",
  "categoryId": "77",
  "version": "0.6",
  "author": "elguapo1991",
  "createdUnix": "1404608680",
  "updatedUnix": "1404624438",
  "containsAdultContent": false,
  "uploadedBy": "elguapo1991",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116070",
      "name": "Weapon Types Matter v0.5",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Weapon Types Matter v0.5-55647-0-5.7z",
      "uploadedUnix": "1404607138",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/84d6c172b95fc03beaa2683963c3055680f053706eac4016412a418f0fdcf58f/analysis/1408162865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weapon%20Types%20Matter%20v0.5-55647-0-5.7z?fid=1000116070&ttl=1535840535&ri=8192&rs=8192&setec=2eac17729d53124c38c1ee096daecd36"
    },
    {
      "fileId": "1000116071",
      "name": "Weapon Types Matter v0.5 (No Dragonborn DLC)",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Weapon Types Matter v0.5 (No Dragonborn DLC)-55647-0-5.7z",
      "uploadedUnix": "1404607202",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/b8886bbc4e1bc2051106bbf0ef4ca4ebdb1564b5faa3f0088a42c243f30f5cd4/analysis/1408162865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weapon%20Types%20Matter%20v0.5%20%28No%20Dragonborn%20DLC%29-55647-0-5.7z?fid=1000116071&ttl=1535840535&ri=8192&rs=8192&setec=2fbaeab36a2fcd89dd25931a746aca91"
    },
    {
      "fileId": "1000116099",
      "name": "Weapon Types Matter v0.6",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Weapon Types Matter v0.6-55647-0-6.7z",
      "uploadedUnix": "1404624380",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/e7433187150021c69ea24d44555f4c9ac5231dcde4049f4a2d882fea3df26878/analysis/1408163174/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weapon%20Types%20Matter%20v0.6-55647-0-6.7z?fid=1000116099&ttl=1535840536&ri=8192&rs=8192&setec=d37cacb94ef32f12f039aea40ae7527e"
    },
    {
      "fileId": "1000116100",
      "name": "Weapon Types Matter v0.6 (No Dragonborn DLC)",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Weapon Types Matter v0.6 (No Dragonborn DLC)-55647-0-6.7z",
      "uploadedUnix": "1404624438",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/8a971f1efd80eb1aba41862bf2b8a22bfaca891902fb2c7f51d6bd6912b0c441/analysis/1408163174/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weapon%20Types%20Matter%20v0.6%20%28No%20Dragonborn%20DLC%29-55647-0-6.7z?fid=1000116100&ttl=1535840536&ri=8192&rs=8192&setec=e359552c623a34fb06b47ae818fe4f48"
    }
  ]
}