{
  "modId": 55677.0,
  "modName": "Loot and Degradation",
  "summary": "NPCs now have access to tempered/enchanted items that were previously only available to you. Tempered items no longer retain their tempered state forever.",
  "descriptionHtml": "[center][size=2][img]http://static-2.nexusmods.com/15/mods/110/images/55677-1-1404675400.png[/img][/size][/center][color=#FFFF99][size=4]Version:\r<br />[/size][/color]1.31\r<br />[list][*]Added timed function to the widget hotkey.\r<br />[/*]\r<br />[*]NPCs will now sometimes loot dead allies but will only loot potions, weapons and ammo. In previous versions this feature only applied to NPCs killed by the player but now applies to NPCs killed by anything.\r<br />[/*]\r<br />[*]Optimized and fixed a few issues related to the NPCs Loot feature.\r<br />[/*]\r<br />[*]Fixed a few minor MCM issues.\r<br />[/*]\r<br />[*]Fixed an issue where tempered equipment looted from NPCs were predominantly found at 100% health.\r<br />[/*]\r<br />[/list][color=#FFFF99][size=2]\r<br />[/size][size=4]Dependencies:[/size][/color]\r<br />\r<br />[color=#FF9999]Required:[/color][size=2] Skyrim 1.9.29.0.8+[/size]\r<br />[color=#FF9999]Required:[/color] [url=http://skse.silverlock.org/]SKSE[/url][size=2] 1.7.0+[/size]\r<br />\r<br />[color=#FFFF99][size=4]Compatibility:[/size][/color]\r<br />\r<br />[list][*][size=2]Works with all mods that add new weapons/armor/NPCs without the need for patches.[/size][/*]\r<br />[*][size=2]If degradation is enabled, all tempered items will now be considered unique from each other even if they look identical in your inventory. Hotkeys to equip items may function differently now. To counteract this, this mod offers options to configure hotkeys to automatically equip a weapon of a certain type from your inventory.[/size][/*]\r<br />[*][size=2]This mod will automatically configure itself to Requiem 1.8+&#39;s tempering system. An additional patch for Requiem is available [url=http://www.nexusmods.com/skyrim/mods/54562/]here[/url].[/size][/*]\r<br />[/list][size=2]\r<br />[/size][color=#FFFF99][size=4]Overview:[/size][/color]\r<br />\r<br />[size=2]NPCs now have access to tempered/enchanted items that were previously only available to you. Tempered items no longer retain their tempered state forever. All features can be adjusted using [/size][url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url][size=2]&#39;s MCM.[/size]\r<br />\r<br />[color=#cccc99]Loot:[/color]\r<br />[list][*][size=2]NPCs can now be found equipped with tempered/enchanted weapons and armor from any mod as long as they have been added to the leveled lists.[/size][/*]\r<br />[*][size=2]Temper and enchantment chance/quality increases with NPC level. For a level 1 NPC, enchanted items will be very rare and untempered items will be most common followed by &#34;Fine&#34;, &#34;Superior&#34;, &#34;Exquisite&#34;, &#34;Flawless&#34;, &#34;Epic&#34; then &#34;Legendary&#34;.[/size][/*]\r<br />[*][size=2]NPCs will now also automatically obtain the loot of their dead targets if they are killed within melee range. NPCs will sometimes loot dead allies but will only loot items that may help them immediately.[/size]\r<br />[/*]\r<br />[/list]\r<br />[size=2][color=#cccc99]Degradation:[/color]\r<br />[/size][list][*][size=2]Tempered weapons and armor will now eventually degrade back to their original, untempered states upon use/hit. Continuously blocking with a weapon, using power attacks or bashing with a bow will significantly increase the rate at which the weapon degrades.[/size][/*]\r<br />[*][size=2]If a hit is blocked with a shield, your armor will be protected from degradation for that hit and instead, your shield may degrade. Getting hit by power attacks can significantly degrade armor.[/size][/*]\r<br />[*][size=2]The rate of degradation scales with material type. From least durable to most durable: Cloth, Wood, Fur, Leather, Iron, Steel, Elven, Bonemold, Falmer, Dwarven, Glass, Chitin, Orcish, Dragon, Ebony, Stalhrim, Daedric.[/size][/*]\r<br />[*][size=2][url=http://static-3.nexusmods.com/15/mods/110/images/55677-1-1410401371.jpg]Widgets[/url]: icons that represent your equipment&#39;s health before degrading can be configured to display anywhere on your screen. Requires SkyUI.\r<br />[/size][/*]\r<br />[*][size=2]Equipped gear has a chance to permanently break into pieces on use/hit. These pieces can be forged into materials at the smelter. The faster an item degrades, the more likely the item will break. The higher the temper quality, the less likely the item will break. Artifacts (unique items that already come enchanted) cannot break. Being under the effects of a Mage Armor spell will render armor/clothing immune to breaking. Disabled by default.[/size][/*]\r<br />[*][size=2]These features can also be enabled for followers.[/size][/*]\r<br />[/list]\r<br />[size=2][color=#cccc99]Services:[/color]\r<br />[/size][list][*][size=2]To help with the degradation aspect, blacksmiths and fletchers will now temper your (non-artifact) items for a price. Blacksmiths are more expensive but can temper everything. Fletchers are cheaper but are limited to light armor, bows and one-handed weapons. Eorlund Graymane is the only blacksmith who can temper artifacts or other unique equipment. Orc blacksmiths are proficient in Orcish items, Baldor Iron-Shaper from Dragonborn is proficient in Stalhrim items. Being proficient with certain items means they are able to temper those items 1 level higher than their current skill level.[/size][/*]\r<br />[*][size=2]All will be randomly sorted into Apprentices or Journeymen and will only able to temper items into (Fine) and (Superior) respectively except Eorlund Gray-Mane who begins the game as an Adept. Their skill levels will progress through Journeyman (Superior), Adept (Exquisite), Expert (Flawless), Artisan (Epic) and then Master (Legendary) as they temper items. Although more expensive tempering will result in faster progression, experience is calculated before discounts via Speech, fletcher, etc. are applied so you aren&#39;t penalized for looking for cheaper options.[/size][/*]\r<br />[*][size=2]In addition, blacksmiths and fletchers will gain two skill levels (i.e. Adept to Artisan) over the course of about 6 in-game months without your aid. This experience over time feature will automatically adjust to your game if this mod is installed during a mid-playthrough.[/size][/*]\r<br />[*][size=2]You can also enable an option to have blacksmiths/fletchers take X hours to temper items instead of immediate repairs. After the X hours, a courier will deliver your improved items to you.[/size][/*]\r<br />[*][size=2]An Equipment Repair Kit is a portable item that will allow you to temper or degrade weapons and armor anywhere. Items improved using this kit will degrade faster than items improved at a grindstone, workbench or NPC. Once enabled, they can be crafted at a leather rack or purchased from blacksmiths.[/size][/*]\r<br />[/list]\r<br />[color=#FFFF99][size=4]Install:[/size][/color]\r<br />\r<br />[size=2]Manual installers drop the files into your Data folder. NMM/BAIN: download the main file and add to your respective programs.[/size]\r<br />\r<br />[color=#FFFF99][size=4]Update:[/size][/color]\r<br />\r<br />[size=2]Remove all files from the previous version and install the new version.[/size]\r<br />\r<br />[color=#FFFF99][size=4]Uninstall:[/size][/color]\r<br />\r<br />[size=2]Remove all installed files.[/size]\r<br />\r<br />[color=#FFFF99][size=4]Translations:[/size][/color]\r<br />\r<br />[size=2]You have my permission to translate this mod and upload it to the Nexus or non-English sites. Just send me a link.[/size]\r<br />\r<br />[color=#FFFF99][size=4]Credits:[/size][/color]\r<br />\r<br />[size=2]richmondb for the [/size][url=http://www.nexusmods.com/skyrim/mods/13800/?]whetstone[/url][size=2].\r<br />psychosteve for the widget [url=http://www.nexusmods.com/skyrim/mods/11010/?]icons[/url].[/size]",
  "categoryId": "78",
  "version": "1.31",
  "author": "isoku",
  "createdUnix": "1404676135",
  "updatedUnix": "1508078315",
  "containsAdultContent": false,
  "uploadedBy": "isoku",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128777",
      "name": "Loot and Degradation v1_31",
      "version": "1.31",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2132",
      "fileName": "Loot and Degradation v1_31-55677-1-31.7z",
      "uploadedUnix": "1411920612",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/861ee9e4d91fd701871d1554ce2f13b7add2e8839dc77805027cbdca6bd018b5/analysis/1411920724/",
      "changelogHtml": " Added timed function to the widget hotkey.\r<br />\r<br />NPCs will now sometimes loot dead allies but will only loot potions, weapons and ammo. In previous versions this feature only applied to NPCs killed by the player but now applies to NPCs killed by anything.\r<br />\r<br />Optimized and fixed a few issues related to the NPCs Loot feature.\r<br />\r<br />Fixed a few minor MCM issues.\r<br />\r<br />Fixed an issue where tempered equipment looted from NPCs were predominantly found at 100% health. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loot%20and%20Degradation%20v1_31-55677-1-31.7z?fid=1000128777&ttl=1535840581&ri=8192&rs=8192&setec=34349a6b6b969fabf0ff78daa8137fb0"
    },
    {
      "fileId": "1000257443",
      "name": "Loot and Degradation v1_40 Alpha 1",
      "version": "1.40A1",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2459",
      "fileName": "Loot and Degradation v1_40 Alpha 1-55677-1-40A1.7z",
      "uploadedUnix": "1508078315",
      "modVersion": "1.40A1",
      "virusScanUrl": "https://www.virustotal.com/file/01cce1f6623751ecfee53aeaf770f20530238f2e8a8ea3cd01754b8df6ad838d/analysis/1508078410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loot%20and%20Degradation%20v1_40%20Alpha%201-55677-1-40A1.7z?fid=1000257443&ttl=1535840582&ri=8192&rs=8192&setec=e124ea2ed72b97f0d3727972aa74be54"
    }
  ]
}