{
  "modId": 55724.0,
  "modName": "Svanhildr - A Vampire Follower",
  "summary": "This is a Follower mod I made for personal use (and also the first ever thing I&#39;ve used the CK For) She uses Dawnguard Assets, so you&#39;ll need the DLC to use this.",
  "descriptionHtml": "-Updated to 1.1, will need un-installation of Version 1.0, as I&#39;ve changed her game-load position within Fort Dawnguard. She will stay there forever and will not leave your service if you don&#39;t do the above step. Also, her Vampiric Drain ability WILL give you progress to your Vampire lord perk tree, even if you are NOT a Vampire Lord/Lady.\r<br />\r<br />This is a Standalone Vampire Follower I made for personal use, and also the first thing I&#39;ve ever used the CK for, so please be forgiving of the quality of the Follower. She will be affected by any Vampire overhauls you have, alongside any mods that alter how a Female looks, Bodymods included.. I figured I&#39;d release it here to get Feedback on it, and see if anyone can suggest ways of Improving her.\r<br />\r<br />She uses the Standard follower AI, meaning she is entirely compatible with UFO, AFT and any other Follower AI Overhauls you may have. I&#39;ve also set her Combat Ai to that of Serana&#39;s, mostly because I&#39;m lazy and I quite like the way Serana fights. Of course, any AI Overhauls will affect this.\r<br />\r<br />She has the Apprentice Restoration Perk, no special abilities outside the usual Vampire ones (maybe a few LESS, since I don&#39;t have any idea just how many abilities Vampires have), and I&#39;ve given her 3 Spells to start with, all of which are used in the Left Hand.\r<br />-Summon Gargoyle (Dawnguard Resource)\r<br />-Vampiric Drain (The Vampire Lord one, with the AoE)\r<br />-Necromantic Healing (Dawnguard Resource, Undead equivalent of the standard Healing spell)\r<br />May add more if either I feel like it or you guys/girls want more variety to her Spells. Suggestions would be great.\r<br />\r<br />She can be found in Fort Dawnguard,Straight across from the Entrance (in the room with all the Beds). I don&#39;t like Castle Volkihar, and Fort Dawnguard is easier to navigate. She also dons the Dawnguard Armour, uses their War Axe (Right Hand), and I&#39;ve also set her Allegiance to the Dawnguard, so she doesn&#39;t slaughter everything in there. The concept of a Vampire hating their own kin is one I like, so forgive me if this is seen as Cliche to you. She will harm and kill Anyone, assuming you give the order or are attacked. Otherwise, she&#39;s passive.\r<br />\r<br />Feedback on her is always welcomed, especially so since this is my first use of the CK (with a Video Tutorial showing how to make a Follower), and any advice how to further improve her in any way would be great. And for some reason, I can&#39;t seem to make her move, so help on that is also greatly appreciated. \r<br />\r<br />NOTES:\r<br />-If you hate Lydia&#39;s voice, Svanhildr shares the same voice, so you won&#39;t like her, either (But she doesn&#39;t have the Housecarl-specific Dialogue, which is good)\r<br />\r<br />-When in Fort Dawnguard, she doesn&#39;t move (When you first encounter her and don&#39;t have her as a Follower), Most likely something to do with Navmeshes, Some help in fixing that would be great.\r<br />\r<br />- I don&#39;t know if she Scales with the Player&#39;s level, I ticked the &#34;PC level Multi&#34; box, I&#39;m assuming that makes her level with you by default? If not, AFT resolves that, of which Svanhildr is fully compatible with (and all other Follower Overhauls)\r<br />\r<br />-She isn&#39;t designed with beauty in mind (I think very few follower mods are), so if her looks don&#39;t take your fancy, you can edit them yourself in the Creation Kit, just don&#39;t upload these self-modified versions. Sounds selfish, I know.\r<br />\r<br />-Rarely, she may be attacked by any other Followers you have. I&#39;m not sure what causes this, but It typically happens after Combat has ended. Not sure on a fix, but will try to find one. If anyone knows how to fix that, please let me know.\r<br />\r<br />If you find anything that can be improved, either Comment or PM me, I&#39;ll check this page often.\r<br />The eyes you see her with are the Vampire Eyes of Coldharbour, found HERE:http://www.nexusmods.com/skyrim/mods/52872/?",
  "categoryId": "96",
  "version": "1.1",
  "author": "Metallionus",
  "createdUnix": "1404764437",
  "updatedUnix": "1404832618",
  "containsAdultContent": false,
  "uploadedBy": "Metallionus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116527",
      "name": "Svanhildr - A Vampire Follower 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122",
      "fileName": "Svanhildr - A Vampire Follower 1.1-55724-1-1.7z",
      "uploadedUnix": "1404832618",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7020bd0650787defc4a7ca2026c6e6f9e682e42260413c8bf2dc46c597f8c64e/analysis/1408168518/",
      "changelogHtml": " -Added Spell &#34;Necromantic Healing&#34;, and the Apprentice Restoration Perk, Left-hand Cast\r<br />\r<br />-Slightly modified FaceGen Morphs\r<br />\r<br />-Mostly fixed the Textures not being the same colour, it&#39;s not as hugely drastic now, although opening the Console and typing &#34;unequipall&#34; (Without quotation marks) will show her Body isn&#39;t as pale is her Face is. Still, Neck seam is gone. This is mostly noticeable in Bright Lighting.\r<br />\r<br />-Added 100 to Offset Values for HP, Stamina and Magicka (all her base values are 150 now, 50 more than the Player Character starts with)\r<br />\r<br />-Added AI Flag &#34;Wear Sleep Clothing&#34; and added Necromancer Robes as Sleepwear (applies only when she is in a Bed)\r<br />\r<br />-Location has been changed in Fort Dawnguard, which WILL require you to dismiss her and uninstall Version 1.0, then Install version 1.1, otherwise she stays in her new location, never moving and will not leave your service.\r<br />\r<br />-Still doesn&#39;t move about when first loaded into the game, will see if I can fix that. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Svanhildr%20-%20A%20Vampire%20Follower%201.1-55724-1-1.7z?fid=1000116527&ttl=1535840646&ri=8192&rs=8192&setec=d5b518ba06d48bf9d96d6d2119a62a29"
    }
  ]
}