{
  "modId": 55755.0,
  "modName": "The Pelagia Expedition",
  "summary": "Just a little (big) mod that adds in new dungeons, side-quests, weapons, armours, and a storyline quest.",
  "descriptionHtml": "[b][color=#00ffff]Please bare in mind that the current state of this mod is far from completion, a new storyline quest will take a long while to implement, as well as custom armour and weapon sets to coincide with it. I will update the mod the best I can as often as I can, but currently only the dungeons and side-quests will be available. Thank you for checking out the mod&#33;[/color][/b]\r<br />\r<br />---------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][b][u]Introduction[/u][/b][/center]\r<br />Hello adventurer, and welcome to the Pelagia Expedition&#33; I&#39;m Aidy, and the purpose of this mod is to add in a new storyline complete with new dungeons, armours, weapons, NPCs, a new companion, and a few more hours of free content&#33;\r<br />\r<br />The aim of this mod is to primarily give some new and interesting dungeons to explore. The dungeons in Skyrim are okay, some are better than others, but for the most part they get fairly boring. My goal is to add in a few new dungeons with a story linked to them that&#39;ll hopefully be interesting and curious, all will be lovingly handcrafted* and no 2 dungeons will share the same layouts.\r<br />\r<br />*I know Bethesda said theirs would be, but I mean it. I&#39;m not telling you sweet little lies c:\r<br />\r<br />---------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][b][u]Progress[/u][/b][/center]\r<br />It&#39;s going okay. I study and work so I try to dedicate what free time I have to the development of this. It is by no means a small mod, and I&#39;m going to redesign part of it so that the quality is the best someone of my skillset can possibly achieve. The community deserves the best, and so I&#39;ll try my best to deliver that&#33;\r<br />\r<br />I&#39;m looking to get the mod at least partially released by the end of the year. Hopefully by the end of summer, if things go as planned, but we&#39;ll see.\r<br />\r<br />---------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][b][u]Installation & Compatibility[/u][/b][/center]\r<br />\r<br />No guide is really necessary, if you download it through NMM then it&#39;ll be done for you, though I recommend using BOSS. If you want to do it manually, just simply drag the data folder into your Skyrim root folder in Steam and you&#39;re good to go. If there&#39;s custom fonts, drag them to your desktop, right click and install, then you&#39;re all done&#33;\r<br />\r<br />---------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][b][u]Fancy helping me out?[/u][/b][/center]\r<br />\r<br />I&#39;m working on this mod on my own at the moment of writing this, it&#39;s a lot of work especially - as I mentioned - I am attending Uni. I&#39;m developing a game there for my assignment, and this is my spare time project. I&#39;ve been wanting to make a mod like this for a long time but I&#39;ve never had the time or inspiration to do it, and suddenly I&#39;ve gained the latter. If you think you can help me out then I would greatly appreciate it, this is what I&#39;m looking for right now:\r<br />\r<br />[list]\r<br />[*]3D Artist for weapons and armour\r<br />[*]2D Texture artist for weapons and armour\r<br />[*]Script writer for dialogue between the PC and NPCs\r<br />[*]Level builder to assist me with the workload and work flow\r<br />[/list]\r<br />\r<br />If you reckon you can help me out then throw me a PM, we&#39;ll discuss it further then. Please make sure you can provide a sample of work&#33; I know it seems a bit much to ask just for a mod, but seeing your work all nice and finished in a well-built mod is always satisfying c:\r<br />\r<br />---------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][b][u]FAQ[/u][/b][/center]\r<br />Q: Will this be paid?\r<br />A: Absolutely not. My stance on paid modding is clear, I won&#39;t post it here because this isn&#39;t a place to discuss it, this is about my mod. But rest assured, this&#39;ll remain free forever. \r<br />\r<br />Q: Can I use some of your custom assets in my mod?\r<br />A: Look at the distribution permissions, PM me if you want further info.\r<br />\r<br />Q: Can I donate?\r<br />A: If you want to. The donation tab will be up once I feel like I&#39;ve delivered enough content to warrant receiving any money for my work.\r<br />\r<br />Q: When will the mod be done?\r<br />A: I don&#39;t know, whenever it&#39;s ready. Don&#39;t ask. Please.\r<br />\r<br />Q: Can I help?\r<br />A: Go for it buddy, as mentioned above, send me a PM (if I&#39;m looking for people to help out, that is) and we&#39;ll talk&#33;\r<br />\r<br />Q: What are the requirements for this mod?\r<br />A: Nothing&#33; Just a legit copy of Skyrim. That&#39;s all.\r<br />\r<br />Q: Will the storyline be one big release?\r<br />A: Probably, we&#39;ll see what we can do about that. I don&#39;t want to let all the work from this mod go to waste and if - for whatever reason - any hype is built up for it, I don&#39;t want to let it die down and have people be disappointed. It all depends on the situation, really.\r<br />\r<br />Q: Will it work with/without the DLCs?\r<br />A: Yep&#33; All the locations will be in the country of Skyrim, I&#39;ll avoid using assets that are linked to Dawnguard/Dragonborn so that everyone can enjoy this game if they don&#39;t own the DLCs. I&#39;d recommend getting them though, they&#39;re awesome.\r<br />\r<br />Q: I&#39;ve found a dungeon that&#39;s too hard, can you nerf it?\r<br />A: I&#39;ll probably give it a look to see if I can change monster spawns or traps around, sure. But bare in mind I&#39;m testing these dungeons with vanilla Skyrim combat, so spawns are being adjusted accordingly to that. Similarly with any incompatibilities with mods that add in new locations, I&#39;ll try to create a patch that scales accordingly to other combat/difficulty mods. But that isn&#39;t my priority right now, sorry.\r<br />\r<br />Q: I can see through the world in one of your dungeons&#33;\r<br />A: That&#39;s not a question &gt;:C But thanks for pointing it out, tell me which dungeon, where abouts it is, take a screenshot, make a video, point it out on the local map, any one will help greatly. Just please tell me where it is. I try to make the dungeons as streamlined as possible, but in the bigger dungeons I&#39;m bound to make some errors.\r<br />\r<br />Q: Are these dungeons follower friendly?\r<br />A: Yes&#33; I&#39;m putting a lot of time into my navmeshes, it&#39;s a real pain but I&#39;m planning on making them as follower friendly as possible.\r<br />\r<br />Q: A dungeon quest won&#39;t let me progress even though I&#39;ve done as it asked, help&#33;\r<br />A: I can&#39;t help directly, I&#39;ll try my best though. I&#39;m not wholly familiar with quest making in the CK, so please excuse my mistakes when it comes to making them go. I&#39;ll do whatever I can to fix it and I&#39;ll try to release a patch for it ASAP. Apologies in advance if this happens&#33;\r<br />\r<br />Q: Your mod is incompatible with x mod\r<br />A: Sorry, as mentioned before, report the incompatibility to me and I&#39;ll check it out. This mod shouldn&#39;t be incompatible with most mods though, just ones that add in new locations.\r<br />\r<br />Q: Do I need SKSE?\r<br />A: No. You&#39;ll always be able to run this mod through vanilla Skyrim. SKSE is only really necessary if a mod vitally needs to be integrated into the game&#39;s engine, and this mod doesn&#39;t do that. So don&#39;t worry&#33;\r<br />\r<br />---------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][b][u]Changelog[/u][/b][/center]\r<br />\r<br />[list]\r<br />[*]You get the privilege of writing a changelog once you actually have a release version &gt;:c\r<br />[/list]",
  "categoryId": "35",
  "version": "0.01",
  "author": "Aidy",
  "createdUnix": "1404829199",
  "updatedUnix": "1404829199",
  "containsAdultContent": false,
  "uploadedBy": "aidy70060",
  "primaryFile": null,
  "files": []
}