{
  "modId": 55768.0,
  "modName": "Willow The Movie Mod",
  "summary": "All Willow Properties, associations and copy rights belong to Lucas Films. \r<br />Willow (1989) ",
  "descriptionHtml": "This is on Steam Workshop. If you cannot get it here, get it on Steam Workshop.\r<br />\r<br />This mod allows you to play two new unique races, from Willow, the movie, from 1989 (All rights and properties go to Lucas Films). The Daikini, which is the Human race of the Willow franchise, and The Nelwyn, a Dwarven/Halfling like race that Willow Ufgood belongs to. The Nelwyns are weak, and very short. The Daikini aren&#39;t giants, but they are larger even than Nords and Orcs. \r<br />\r<br />Nelwyns have no racial powers other than 10 more starting magicka and 20 percent faster magicka regeneration. However, Nelwyns have 50 starting skill points instead of 35. Furthermore, another downside to Nelwyn are that, because they are so small, they lose muscle mass, thus, they start with 270 lb carry weight instead of the standard 300. \r<br />\r<br />Daikini are larger, slightly stronger and healthier than other races. They also have no special starting racial powers, unfortunately. \r<br />\r<br />Nelwyn ability bonuses are: \r<br />10 Light armor \r<br />10 Alteration \r<br />5 Enchanting \r<br />10 Destruction \r<br />5 Illusion \r<br />5 Sneak \r<br />5 Smithing \r<br />\r<br />Daikini ability bonuses are: \r<br />5 heavy armor \r<br />5 One-handed \r<br />5 Block \r<br />10 Alteration \r<br />10 Destruction \r<br />\r<br />In retrospect, I may have accidentally made the Daikini a little too underpowered. Someone please tell me if I did that. \r<br />This is my first mod, please subscribe, and of course thumbs up (like) if you enjoy. Also, I may try to expand on the Willow Project by including a Nelwyn village with a few Daikini characters thrown in the mix. \r<br />\r<br />The idea for the Newlyn&#39;s abilities and starting utility is that they are physically frail but very gifted in magic. I heard that smaller characters are easier to hurt in Skyrim so I thought since Nelwyns are so small that would be a significant disadvantage. Nelwyns also suffer from a slight lack of carrying muscle, and in a Skyrim where 300 carry weight is still not enough, I figured that would be a significant hassle. Also, Nelwyns have no resistances or activated powers. I&#39;ve played as an Elder Race that has a boost in magicka regeneration, so I didn&#39;t think that Nelwyns would be over powered. Please inform me if you think the Nelwyn are overpowered. \r<br />\r<br />Please give your opinions on both of these races, be constructive with your criticism.",
  "categoryId": "34",
  "version": "current",
  "author": "JoezzaHawke and Jacob The Viking",
  "createdUnix": "1404871268",
  "updatedUnix": "1404871234",
  "containsAdultContent": true,
  "uploadedBy": "JoezzaHawke",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116612",
      "name": "Willow The Movie Mod",
      "version": "current",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "418",
      "fileName": "Willow The Movie Mod-55768-current.exe",
      "uploadedUnix": "1404871234",
      "modVersion": "current",
      "virusScanUrl": "https://www.virustotal.com/file/53ac3070a78705c77437665f0fa007ce82e2a8a06bc7ab40f49be1d3b53de53b/analysis/1408169830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Willow%20The%20Movie%20Mod-55768-current.exe?fid=1000116612&ttl=1535840719&ri=8192&rs=8192&setec=9aa1e5a1b4c248ff743e3b501c0ffc54"
    }
  ]
}