{
  "modId": 55761.0,
  "modName": "Real Girls Realistic Body Texture for CBBE",
  "summary": "CBBE adaptation of Real Girls Realistic Body Texture for all you CBBE lovers out there.",
  "descriptionHtml": "[SIZE=6][B]SUMMARY[/B][/SIZE]\r<br />\r<br />It&#39;s been a long time in waiting. Just a few weeks back, [B]Zonzai[/B], the creator of the textures for [B]Real Girls Realistic Body Texture for UNP UNPB and SeveNBase[/B] came back, allowing modders to release their work based off his textures. So here I am with a CBBE adaptation finally able to release to the public a first BETA.\r<br />\r<br />CBBE is my choice of body mods & this mod is being done in my spare time and to my own liking. This is an [B]ADULT[/B] mod & not for everyone. If you intend to use it please try to at least act like one. I understand that we all have different opinions but please keep the comments constructive so I can improve the mod. If you don&#39;t like the mod for some reason, please state your reasoning in a clear and constructive manner that can help improve the mod. Otherwise, simply don&#39;t use it or create your own from [B]Zonzai&#39;s[/B] textures. If you are a UNP or Sevenbase user, please see [B]Zonzai[/B] & [B]Seren4XX[/B] original release.\r<br />\r<br />[B]Please post lots of screen shots and enjoy :)[/B]\r<br />\r<br />\r<br />[SIZE=6][B]ABOUT THE BETA[/B][/SIZE]\r<br />\r<br />After some consideration. I&#39;ve decided that I should start releasing some files for testing instead of worrying that I need to get everything right, right now. I have work on some seams already including those of the inner thigh, the edge going around the upper leg that connect to the core, and the inner arm but work still remains to be done. Yes, there will still be seams in this release--most notably the neck, hand, foot, & side seams. A proper fix for the neck seam will be my target for the next release followed by those for the other parts just mentioned. Color banding and detail in certain areas will be fixed/added/removed at a later release. I have removed most of the moles, marks from this texture as I am of the opinion that these should left to overlays for customization. Many of you will want to customize your character&#39;s with war paint, scars, freckles, body hair, etc. and a clean texture will allow for that. This download does not contain the tan lines or pubic hair you see in the screenshots: it&#39;s a just a clean body texture.\r<br />\r<br />\r<br />[SIZE=6][B]INSTALL/UNINSTALL[/B][/SIZE]\r<br />\r<br />Please have [B]Caliente&#39;s Beautiful Bodies Edition -CBBE- by Caliente[/B] installed properly first BEFORE proceeding. Unless you download the FULL package, I also recommend you install [B]Real Girls Realistic Body Texture for UNP UNPB and SeveNBase - WIP by Zonzai and Seren4XX[/B] for the head & hand textures.\r<br />\r<br />Most of you will be using the [B]Nexus Mod Manager[/B], in which case just chose [B]yes to all[/B] when it prompts you to overwrite files and you&#39;re done. If you want to do a manual install, keep reading.\r<br />\r<br />You can manual install this mod by extracting it to your skyrim directory. This mod will replace the diffuse map files for your female character & NPCs. Back them up as needed before proceeding. In particular, the [B]femalebody_1.dds[/B] will be overwritten. If you downloaded the FULL package which includes unmodified hand & head textures from the original v0.5 UNP release by [B]Zonzai[/B] and [B]Seren4XX[/B], the [B]femalehands_1.dds[/B] & [B]femalehead.dds[/B] will also be overwritten.\r<br />\r<br />\r<br />[SIZE=6][B]TROUBLE SHOOTING[/B][/SIZE]\r<br />\r<br />If you are getting an all black texture or the Real Girls texture isn&#39;t showing up, you may possibly have to also replace the femalebody_2.dds up to femalebody_11.dds files with a copy of femalebody_1.dds. Running the included batch file duptex.bat (will be in Skyrim/Data/textures/actors/character/female after the install) will create the necessary copies of femalebody_1.dds. If you are still not seeing the Real Girls texture applied, check that you don&#39;t have other mods redirecting the game to a different folder for female bodies. A body changer mod may do this for your character & NPCs. Standalone follower mods may do this for that particular follower.\r<br />\r<br />\r<br />[SIZE=6][B]REQUIREMENTS[/B][/SIZE]\r<br />\r<br />This is a 4Kx4K texture saved with DXT1 compression & mipmaps. I&#39;m using the texture with a 1GB Radeon HD 5870 without any noticable frame drops but I would not recommend running it on anything with less than 1GB of video memory.\r<br />\r<br />\r<br />[SIZE=6][B]CREDITS & MAIN MODS USED FOR SCREENSHOTS[/B][/SIZE]\r<br />\r<br />[LIST]\r<br />[*]HEAD, BODY, & HAND mesh - CBBE v3.2 by Caliente customized with BodySlide also by Caliente\r<br />[*] HEAD & HAND texture - Real Girls Realistic Body Texture for UNP UNPB and SeveNBase - WIP by Zonzai and Seren4XX\r<br />[*] BODY texture - [U]modded by drunkenmojo[/U] from Real Girls Realistic Body Texture for UNP UNPB and SeveNBase - WIP by Zonzai and Seren4XX\r<br />[*] HEAD normal - SG Female Textures Renewal by Hello Santa\r<br />[*] BODY normal - CBBE skin texture V2 V3 plus Thepal and UNP compatible by navetsea\r<br />[*] HAND normal - CBBE v3.2 by Caliente\r<br />[*] HEAD, BODY, & HAND specular - Equipable Wet Female Body Textures - CBBE UNP by ousnius\r<br />[*] OVERLAY tan - [U]by drunkenmojo[/U]\r<br />[*] OVERLAY pubic hair - RaceMenu Overlay Compilation by TheOniNinja\r<br />[*] HAIR - SG Hair Pack by Hello Santa\r<br />[*] EYES - (??? not sure) The Eyes Of Beauty by Gabriel Mailhot\r<br />[*] TEETH texture - Smile in HD by zzjay\r<br />[*] ENB - RealVision ENB by SkyrimTuner\r<br />[*] LINGERIE & ACCESSORIES - Sweet and Sexy Lingerie shop CBBE by Nikitaa\r<br />[*] ACCESSORIES - Ultimate Assortment by Favoredsoul\r<br />[*] LOCATION - Leaf Rest by Aukmat\r<br />[/LIST]",
  "categoryId": "29",
  "version": "0.5BETA",
  "author": "drunkenmojo",
  "createdUnix": "1404846778",
  "updatedUnix": "1405451276",
  "containsAdultContent": true,
  "uploadedBy": "drunkenmojo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117695",
      "name": "Real Girls Realistic Body Texture CBBE v0.5 beta FULL PACKAGE for NMM",
      "version": "0.5BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9762",
      "fileName": "Real Girls Realistic Body Texture for CBBE v0.5 beta FULL PACKAGE-55761-0-5BETA.zip",
      "uploadedUnix": "1405450913",
      "modVersion": "0.5BETA",
      "virusScanUrl": "https://www.virustotal.com/file/559d697c2d616e5fa3361be0fd38cee428b5f1e59a270b4e7daa49fd3a532c2b/analysis/1405450939/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real%20Girls%20Realistic%20Body%20Texture%20for%20CBBE%20v0.5%20beta%20FULL%20PACKAGE-55761-0-5BETA.zip?fid=1000117695&ttl=1535840709&ri=8192&rs=8192&setec=03701cb1abf24ea73adc25dc5487fe7b"
    },
    {
      "fileId": "1000117697",
      "name": "Real Girls Realistic Body Texture CBBE v0.5 beta BODY ONLY for NMM",
      "version": "0.5BETA",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4645",
      "fileName": "Real Girls Realistic Body Texture CBBE v0.5 beta BODY ONLY for NMM-55761-0-5BETA.zip",
      "uploadedUnix": "1405451276",
      "modVersion": "0.5BETA",
      "virusScanUrl": "https://www.virustotal.com/file/86333ae8ebb1f1664d96cae11956e2be8acb2af4a3aa19e0e94f12dc89050130/analysis/1405451297/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Real%20Girls%20Realistic%20Body%20Texture%20CBBE%20v0.5%20beta%20BODY%20ONLY%20for%20NMM-55761-0-5BETA.zip?fid=1000117697&ttl=1535840709&ri=8192&rs=8192&setec=63cd7a00ab364c87151d8d1b1aa70c5d"
    }
  ]
}