{
  "modId": 55779.0,
  "modName": "Serana-Daughter of Coldharbor",
  "summary": "I felt that followers were underwhelming. Especially Serana, I know that she can clear out bandits on her own and Beth made her really powerful vanilla at level 50. I play with difficulty mods that just makes pretty much turns them to tanks. I also felt lore wise she was really underwhelming. So i used to power of the daedra... I mean creation kit ",
  "descriptionHtml": "This is my first Mod and I modded my favorite npc in the game.\r<br />\r<br />I felt that followers were underwhelming. Especially Serana, I know that she can clear out bandits on her own and Beth made her really powerful vanilla at level 50. I play with difficulty mods that just makes pretty much turns them to tanks. I also felt lore wise she was really underwhelming. So i used to power of the daedra... I mean creation kit to fix that. \r<br />\r<br />No longer will a regular vampire be capable of defeating her.\r<br />\r<br />==================================================\r<br />Changes:\r<br />-&gt; I added thunder bolt, icy spear and frost cloak and casted at a reduced cost \r<br />-&gt; I made her reanimate undead reanimate up to level 100\r<br />-&gt; I added a daedric dagger to her inventory\r<br />-&gt; I gave her destruction, light armor, one handed and twin souls perks so she should do a lot of damage than vanilla.\r<br />-&gt; I upgraded her vampiric drain to drain more health, magicka and stamina.\r<br />\r<br />V2 (upcoming release TBD) &#33;&#33;NOT ON THE MOD YET&#33;&#33;\r<br />\r<br />-&gt; Adding lightfooted + silent roll\r<br />-&gt; Adding the bat cloak\r<br />-&gt; Buffing Valerica and Harkon (human form)\r<br />-&gt; Adding ice form shout to all Vampire Lords\r<br />\r<br />\r<br />==================================================\r<br />\r<br />\r<br />Permissions: \r<br />\r<br />I tweaked some values in CK so no permission required from me.\r<br />\r<br />\r<br />==================================================\r<br />\r<br />Disclaimer: \r<br />\r<br />This is just a combat mod, there are no visual changes and the vampire lord pictured is from &#34;Amazing Follower tweaks&#34;.\r<br />\r<br />This mod was meant to played with High level enemies and any mod that adds high level monsters at a higher level. Vanilla Serana is enough for most cases for gameplay reasons. This is so Serana fits the lore better.\r<br />\r<br />==============================================================\r<br />Compatibility:\r<br />\r<br />I know this works with AFT, I just tested it. Put it below any follower mods and any mods that modify Serana.\r<br />==============================================================\r<br />\r<br />Additional comments:\r<br />\r<br />I&#39;m a new modder and I know very little coding so don&#39;t expect SKYRE type of mods from me so soon. \r<br />\r<br />My next plans are to buff Valerica and Harkon as well.\r<br />\r<br />Once I&#39;m more experienced in modding I plan to revamp Fort Dawnguard so it is actually a fort (and satisfying for vampire players to wipe out clean).\r<br />\r<br />If I get the time and the knowledge I will add a more quests with voice acted characters in Castle Volkhiar and revisit Serana.\r<br />",
  "categoryId": "96",
  "version": "1",
  "author": "roh234",
  "createdUnix": "1404878632",
  "updatedUnix": "1404878486",
  "containsAdultContent": false,
  "uploadedBy": "roh234",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116642",
      "name": "Serana-DaughterOfColdharborV1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Serana-DaughterOfColdharborV1-55779-1.7z",
      "uploadedUnix": "1404878486",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4ad57d9f0eb6dd096687fec91eeccf904c8cedea14d397d4d43d0368fed2274d/analysis/1408170371/",
      "changelogHtml": " First version <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Serana-DaughterOfColdharborV1-55779-1.7z?fid=1000116642&ttl=1535840731&ri=8192&rs=8192&setec=9abddb2f29c569e1928c592ce989bd8d"
    }
  ]
}