{
  "modId": 55789.0,
  "modName": "Understone Home and Dungeon",
  "summary": "This mod provides a small camp-like home in the Understone Keep of Markarth near where Calcemo works.  The camp provides a few basic crafting needs with more provided close by.  In addition is access to a somewhat large Dwemer dungeon. Discover the fate of the camp owner, Sleeps-With-Fishes, and claim your fortune of Dwemer riches. ",
  "descriptionHtml": "Bare bones info:\r<br />Find the body of a dead Nord on the bridge just below the Old Hroldan Inn. He has a letter on him that suggests opportunities for fame, fortune and glory, or at least a free place to sleep. \r<br />\r<br />A bit more info if needed:\r<br />This mod provides a small camp-like area in a tower just above where Calcemo works in the Understone caverns of Makarth.  There is not much here except a place to sleep, cook, store things and make basic gear.  You may move in immediately since the previous tenant, Sleeps-With-Fishes, seems to be away at the moment. For potions and enchanting, you can use Calcemo’s tables and there is a smith shop up by the Jarls’ living area.  In the camp you can find the journal of Sleeps-With-Fishes.  This will give you a bit his story and some info on the dungeon he discovered.  Behind the tower you can find a ladder allowing access to a door leading to ruins no one has seen in ages.\r<br />\r<br />Practical concerns:\r<br />The barrel, the large Dwemer chest and the small Dwemer chest (next to Calcemo’s tables), all come with loot but will not respawn and are thus safe for storage.  The containers and monsters inside the dungeon will respawn so you can enjoy looting and killing over and over.  Just don’t store stuff there.\r<br />\r<br />Stylistic info: \r<br />The camp is small and spare so don’t feel bad about not having “earned it.”  Although not fancy, I think it will provide a good working home for new characters until they have enough money and fame to acquire a nicer place to show off all their fancy weapons, armor, masks and whatnot.  I tried to make most areas of the ruins have a purpose or be interesting in some way. I also tried to have lots details to add depth and immersion.  There is a lot of rough terrain in the ruins so expect to jump around a lot. I think I’ve removed all the places you can get stuck, but save now and then just in case.  You can also use the consul command TCL to toggle off collision to get your character out.  Thorough follower testing was provided the lovely [url=http://www.nexusmods.com/skyrim/mods/55303/]Karyssa Althera-Standalone Follower by lewbob[/url] who is featured in many of the screen shots.  She would like to remind everyone that followers usually find a way through if you are patient. They also tend to catch up after you go through a load door.  You will find lots of water areas and skylights providing illumination and vegetation.  These are all things I enjoy in dungeon exploring, and if you do too I think you find this a good addition to your Skyrim experience.\r<br />\r<br />Changes to your game:\r<br />This mod adds some items to the small tower just above Calcemo’s work area.  A container is also added right next to his tables.  A dead Nord can be found on the bridge below Old Hroldan Inn.  The entrance to the dungeon is above and to the right a bit from the entrance of Nchuand-Zel.  The dungeon is very vanilla with no added characters, scripts, quests or much of anything that might cause stress to your game experience.  Hopefully the dungeon is not too big to cause problems with computer performance. \r<br />\r<br />\r<br />My other mods:\r<br />[url=http://skyrim.nexusmods.com/mods/55953/]Lab of Sinderion as a Player Home in Blackreach[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/48885/]Whiterun Gatehouse Home and Skooma Den[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/38779/] Riverwood Tower and Tunnels [/url]\r<br />[url=http://skyrim.nexusmods.com/mods/40056/] Nilheim as a Player Home [/url]\r<br />",
  "categoryId": "88",
  "version": "1.0",
  "author": "scon27",
  "createdUnix": "1404998421",
  "updatedUnix": "1404938144",
  "containsAdultContent": false,
  "uploadedBy": "scon27",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116779",
      "name": "Understone Home and Dungeon",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "170",
      "fileName": "Understone Home and Dungeon-55789-1-0.rar",
      "uploadedUnix": "1404938144",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/50ffe0a7d6954c7564c985221e6bf438ed3c4b068a8ade669e966170e0c5c692/analysis/1408171504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Understone%20Home%20and%20Dungeon-55789-1-0.rar?fid=1000116779&ttl=1535840750&ri=8192&rs=8192&setec=1763340ea2c554d656e7456928581049"
    }
  ]
}