{
  "modId": 55828.0,
  "modName": "Sp - Spanish - Alternate start - live another life",
  "summary": "traducción a español de este fantástico mod de Arthmoor\r<br />Ver: 2.4.0",
  "descriptionHtml": "¿Cansado de tener siempre el mismo inicio de partida en Helgen? Este mod te va a gustar :D\r<br />\r<br />Este mod es ideal para aquellas personas que tienen muxos mods instalados en su skyrim, ya que esto suele provocar problemas y bugs en el &#34;prólogo&#34; ( en Helgen para q nos entendamos ).\r<br />Este mod ofrece muxisimos comienzos e historias alternativos, que podrás elegir tu mismo, haciendo nuestra primera experiencia de juego, mucho mas aleatoria. También puedes elegir iniciar comenzar en la secuencia original ;D por lo que el inicio en Hlgen no se pierde, solo tienes q decirle a la estatua, &#34;Fui capturado cruzando la frontera ilegalmente&#34; a lo q ella te contestara en plan sarcastico &#34; lo que es el destino&#34; o algo similar, entonces cuando vas a dormir en la cama comienzas el juego como si nada xD\r<br />\r<br />Ejemplos de errores por los cuales este mod es una de las mejores alternativas:\r<br />\r<br />en mi caso por ejemplo, al no poder atravesar cadáveres, cuando le cortan la cabeza al capa de la tormenta su cuerpo queda tirado en el suelo, provocando un error q evita q puedas llegar a que te corten a ti la cabeza, o en caso de q te la corten, cuando llega el dragón no te puedes mover porq tu cuerpo se a quedado pillado con el cadáver anteriormente mencionado, dejandote fijo sin poder moverte y sin poder hacer nada en absoluto, en fin, que te has comido tooooda la historieta de camino a Helgen y demas por enesima vez y encima no te sirve de nada xq no puedes moverte y solo te quedan dos alternativas.\r<br />\r<br />1 Des-instalar los mods e ir probando uno a uno para ver donde esta el fallo ( cosa q cuando se tienen pocos mods vale, pero con mas de 80... la cosa no pinta bien)\r<br />\r<br />2 Instalar este mod y saltarte toda esa parafernalia (mola no? ^^)\r<br />\r<br />Aunque no lo parezca son muchos mods los que afectan a la secuencia de helgen, el propio immersive armors v7.1 provoca que las carretas no dejen de dar vueltas de campana, haciendo que nunca llegues a helgen y provocandote un mareo que no veas xD... pero el mod en sí no deja de ser uno de los mejores mods de armaduras y es una pena tener que prescindir de el por jugar una escena que sinceramente se lega a  hacer aburrida\r<br />\r<br />Bueno y tras esta parrafada :P solo deciros que espero que disfruteis de este mod, que es realmente grande (os lo aseguro) y que endorseis al autor por este pedazo de trabajo\r<br />\r<br />Un Saludo&#33;&#33;\r<br />\r<br />Instrucciones:\r<br />\r<br />Instalar el mod original\r<br />descargar este, descomprimir y copiar solo el .esp en la carpeta data (en principio no he probabo si vale con NMM)\r<br />\r<br />Posibles fallos:\r<br />Debido a que este mod tiene muchisimas lineas que traducir, es posible que se me haya olvidado poner algun &#34;¡&#34; o &#34;¿&#34; al principio de alguna frase, no es gran cosa pero tratare de revisarlo\r<br />Cualquier error gramatical o frase sin sentido o sin traducir os agradeceria mucho me las pusierais en un comentario y tratare de resolverlo lo antes posible\r<br />\r<br />",
  "categoryId": "24",
  "version": "2.4.1",
  "author": "Arthmoor",
  "createdUnix": "1405010016",
  "updatedUnix": "1405987396",
  "containsAdultContent": false,
  "uploadedBy": "rmtpsr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116875",
      "name": "Live another life",
      "version": "2.4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4164",
      "fileName": "Live another life-55828-2-4-0.7z",
      "uploadedUnix": "1405010008",
      "modVersion": "2.4.0",
      "virusScanUrl": "https://www.virustotal.com/file/f90f3b388ca02db99ecd2b8080ccd39889f0f1088f7ead6594deb5353f17b21f/analysis/1405010050/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Live%20another%20life-55828-2-4-0.7z?fid=1000116875&ttl=1535840814&ri=8192&rs=8192&setec=460b618a1b819ab0b8f21ddbbd96f34b"
    },
    {
      "fileId": "1000118666",
      "name": "alternate start 2.4.1",
      "version": "2.4.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "269",
      "fileName": "alternate start 2.4.1-55828-2-4-1.7z",
      "uploadedUnix": "1405987396",
      "modVersion": "2.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/f3a2912c47ef059ce14d4261f93750a8a37a5bd1eab6516818d59e93a41354fb/analysis/1406011404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alternate%20start%202.4.1-55828-2-4-1.7z?fid=1000118666&ttl=1535840814&ri=8192&rs=8192&setec=3cb1736e5329a2dff6465f7d8b541995"
    }
  ]
}