{
  "modId": 55824.0,
  "modName": "Tusaron The Vampire DreadLord-HARDEST BOSS EVER",
  "summary": "Hello all.This mod includes HARDEST ♥♥♥♥ING BOSS FIGHT EVER ( beatable on Legendary difficulty ) \r<br />Tusaron The Vampire DreadLord: And 3000 years old Altmer that is travelling to his old friend (Lord Harkon) castle. \r<br />But now he is resting in his camp in Helgen.He has 2 ancient very powerful swords enchanted by the most powerful wi",
  "descriptionHtml": "Hello all.This mod includes HARDEST ♥♥♥♥ING BOSS FIGHT EVER ( beatable on Legendary difficulty ) \r<br />Tosuran The Vampire DreadLord: And 3000 years old Altmer that is travelling to his old friend (Lord Harkon) castle. \r<br />But now he is resting in his camp in Helgen.He has 2 ancient very powerful swords enchanted by the most powerful wizards in Alinor.Beware THIS is REALLY ♥♥♥♥ING hard even on Novice so I highly recommend 70+ leveled character. \r<br />Be sure to check his chest in the camp but you will need the key. Just take it from his dead body... if you manage to kill him. \r<br />\r<br />How to beat him: \r<br />There are 5 major ways to beat him( AND MILLIONS OF POTIONS) : \r<br />\r<br />The Destructive Conjurer: \r<br />Main Skills: Restoration, Destruction, Conjuration, Heavy Armor, Enchanting. Levelling point scheme: Health&gt;Health&gt;Magicka - Repeat. \r<br />Take Dragonbone armor.With the perk &#34;Extra Effect&#34; from the &#34;Enchanting SkillTree&#34; you can put up to 2 enchantments on 1 armor: Put on every piece : 25% less magicka to cast on Restoration spells, 25% less magicka to cast on Destruction spells.That way if you have full set of it you will have 100% less magicka to cast on Restoration and Destructionl. Basically Free Spell Casts.But you will need lots of Magicka for Conjuration. \r<br />\r<br />\r<br />The &#34;Classic&#34; Barbarian Style Warrior: \r<br />Main Skills: Block, One-Handed Weapons, Light Armor, Smithing, Restoration.Levelling point scheme: \r<br />Health&gt;Health&gt;Stamina - Repeat \r<br />Take Elven or Glass armor sets(Doesnt matter, they still reach armor cap of 567 if improved).Improve them with your Smithing Skills and you should reach 567 armor with full set.Take some enchanted mace or sword but dont use \r<br />war-axes.Now... shield part is very important. Pick the best shield that you have. You will need to do a lot of bashing and blocking. And finally some low leveled Restoration spell just to sustain you. \r<br />\r<br />The Heavy Guy with the Big Hammer: \r<br />Main Skills: Heavy Armor, Two-Handed Weapons, Restoration, Block.Levelling point scheme: All the way HEALTH&#33;.. \r<br />Take the best heavy armor that you have with some bonus resistances against fire.Now you will need a Hammer or Greatsword with Drain Stamina Enchant. 100% you will need it.So you better find one or enchant. Be sure to Block. \r<br />Or you will be dead again no matter how much life you have...Just go to him and try to crack his skull. \r<br />\r<br />\r<br />The Classic Archer( Best ♥♥♥♥ing class in the The Elder Scrolls/in my opinion/...Damn those precious bows..) \r<br />Main Skills:Archery, Sneak, Light Armor, Alchemy, Illusion.Leveling point scheme: \r<br />Stamina&gt;Stamina&gt;Health - Repeat \r<br />Basically I prefer the bows with higher DPS, but in this case we need stagger and burst damage. So the best bow against our Vampire DreadLord will be the Daedric( with most stagger I think and second to damage-If you dont like it take Elven Bow and be badass.)Light armor won&#39;t slow you down.That&#39;s good. We need speed.Now you need the perk &#34;Shadow Warrior&#34; from the Sneak skilltree. It&#39;s extremely effective.Whenever he comes near you just cast Illusion invisibility spell and Sneak around him. When you get far away from him bombard him with the epic arrows. \r<br />Also you MUST have the &#34;Bullseye&#34; Perk from Archery skilltree.That 15% chance of paralyzis cant be blocked so it&#39;s very good. Sometimes you can even have streaks of paralyzing arrows.Now for the Alchemy.Make yourself some ♥♥♥♥ing OP poison that can ♥♥♥♥ up half Tamriel and put it in your favorites.Poison your every arrow for most efectivness and if it doesn&#39;t stack, just wait the effect of the previous one to finish then use it again. \r<br />\r<br />\r<br />The &#34;Conjuration Archer&#34;( Im not a big fan of this class, but my Altmer is just overpowered with him....Damn this Bethesda)/But still not my favorite/ \r<br />Main Skills:Conjuration, Archery, Light Armor, Sneak.Leveling point scheme: \r<br />Magicka&gt;Stamina&gt;Health - Repeat \r<br />The thing with the conjuration archer is that both skilltrees (Conjuration and Archery) boost your bow and arrows. \r<br />The Bound Bow Spell is really good and never rans out of ammo so you dont need to worry about ammunition.All the perks from Archery apply to the Bound Bow. Im not sure about poisons doe... \r<br />Just put some 2 Dremora Lords infront of him, while you ♥♥♥♥ up his body with ghostly arrows.Then repeat. \r<br />\r<br />\r<br />FINALLY THE MOST IMPORTANT TIP: \r<br />NEVERNEVERNEVERNEVERNEVERNEVERNEVERNEVERNEVERNEVER NEVER&#33; Dual Wield. He will just ♥♥♥♥ing smash through your tiny swords. You need to BLOCK. \r<br />\r<br />If you can&#39;t beat him just lower the difficulty.But if you are already on Novice and again can&#39;t beat him even once.... \r<br />Just kill him with &#34;kill&#34; command in the console :D.And loot his chest and body.\r<br />\r<br />\r<br />So thats all. \r<br />HIs exact destination will be on the images. Check them. \r<br />I created the mod for my friend... who doesn&#39;t know shit about editing programs, but he said that I  should upload it because its great for Hardcore Skyrimers \r<br />\r<br />Write Comments If there are any Bugs or &#34;weak spots&#34;  \r<br />Have Fun&#33; \r<br />Kadkata",
  "categoryId": "77",
  "version": "1.01",
  "author": "Kadkata",
  "createdUnix": "1404996088",
  "updatedUnix": "1404995661",
  "containsAdultContent": false,
  "uploadedBy": "kadkata",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116853",
      "name": "TusaronHARDESTBOSS",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1548",
      "fileName": "TusaronHARDESTBOSS-55824-1.rar",
      "uploadedUnix": "1404995661",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/438062a48bd5cff4d309771521cc15870365eecbcd3828dda54b1a1b5cc3e5b6/analysis/1408172353/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TusaronHARDESTBOSS-55824-1.rar?fid=1000116853&ttl=1535840810&ri=8192&rs=8192&setec=b9d0fa5ad57c4b1e6104b5a1f3bf16ca"
    }
  ]
}