{
  "modId": 55835.0,
  "modName": "Arn&#39;s Krieg ALPHA",
  "summary": "A small Content mod, see it as a DLC",
  "descriptionHtml": "This mod contains only a dungeon right now, the mod will be updated in time with more quests and slowly adding more and more depth to the story and dungeons. keep in mind that this is one of our first mod projects and it wont be of the highest quality you can find.\r<br />\r<br />You can find the dungeon outside of riverwood.\r<br />\r<br />Main story of the mod:            Alpha\r<br />Eons ago, a great star fell from the sky. \r<br />This.. Thing. That fell was treated as something with far more power. \r<br />This, being, of sorts gave off an aura, an aura of flames, as hot as a thousand suns. An aura, of sheer terror, the kind of terror produced by nightmares, that not even the sickest of fears can create. \r<br />Soon after the fall of the star, people developed an attachment to this thing. People gathered around it, praying to it, asking it to give them good fortune/\r<br />Praying not to take their lives, so they can live to see another day. \r<br />The fire slowly burned out. \r<br />As it did, people cheered and celebrated in joy, finally the thing they feared the most, the thing that held them captive within in their own minds, finally set them free. \r<br />A few of the people who worshiped the fire, thought that it brought chaos upon the enemies of those who praised it. \r<br />They believed that those who worshiped the flames, were rewarded by the flames. \r<br />The few crazed cultists that believe they are prophets, seek to bring back the flames, that they so desperately need.\r<br />                  ",
  "categoryId": "88",
  "version": "0.1",
  "author": "Greenfire Dev",
  "createdUnix": "1405018271",
  "updatedUnix": "1405018267",
  "containsAdultContent": false,
  "uploadedBy": "Derparuni15",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000116897",
      "name": "Arn&#39;s Krieg",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "Arn's Krieg-55835-0-1.rar",
      "uploadedUnix": "1405018267",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/10ab5c17b87355e9d5f8d2ec5a4a38672de48e3e07ef4ec5e9de0889d7f1ad00/analysis/1405018370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arn%27s%20Krieg-55835-0-1.rar?fid=1000116897&ttl=1535840824&ri=8192&rs=8192&setec=70f7741490d58093b9ace59bfdb0d6c4"
    }
  ]
}