{
  "modId": 55846.0,
  "modName": "SkyRe - Revenge of the Enemies Compatibility Patch",
  "summary": "The aim of this patch is to bring Revenge of the Enemies inline with the enemy scaling and encounter zones of SkyRe. Ultimately, this patch provides a smoother leveling experience while preserving the spells/shouts added by RotE.\r<br />",
  "descriptionHtml": "The aim of this patch is to bring Revenge of the Enemies inline with the enemy scaling and encounter zones of SkyRe. Ultimately, this patch provides a smoother leveling experience while preserving the spells/shouts/combat AI added by RotE. It is ideal for those starting a new character. If installing on a current playthrough, the enemy scaling and stat tweaks will apply to fewer and fewer NPCs the higher a player&#39;s level is due to engine limitations. The rest of the balancing changes, however, will apply to any savegame.  \r<br />\r<br />[SIZE=4][COLOR=#ff0000][B]Required[/B][/COLOR][/SIZE]\r<br />[URL=http://www.nexusmods.com/skyrim/mods/9286/?]SkyRe[/URL]\r<br />[URL=http://www.nexusmods.com/skyrim/mods/40491/?]Enemy AI Overhaul - Revenge of the Enemies[/URL]\r<br />[URL=http://www.nexusmods.com/skyrim/mods/19/?]Unofficial Skyrim Patch[/URL]\r<br />[URL=http://www.nexusmods.com/skyrim/mods/12092/?]Cloaks of Skyrim[/URL] (If using cloaks version of this patch)\r<br />\r<br />[SIZE=4][COLOR=#e36c09]General[/COLOR][/SIZE]\r<br />[LIST]\r<br />[*]SkyRe encounter zones have been restored. Only a handful were changed by Revenge of the Enemies.\r<br />[*]SkyRe difficulty settings have been restored. The settings will now have a greater effect in both directions than RotE.\r<br />[*]SkyRe enemy scaling level settings have been carried over. This should make the leveling experience more balanced and much smoother. Certain level ranges and enemy types will see greater changes than others.\r<br />[/LIST]  \r<br />\r<br />[SIZE=4][COLOR=#e36c09]Weapons/Armor/Items[/COLOR][/SIZE]  \r<br />[LIST]  \r<br />[*]RotE&#39;s NPC-only weapons have had their damaged increased to match Reproccer values. A few enemies will now be more dangerous than before. I&#39;ll let you figure out which ones through trial and error, by which I mean death.\r<br />[*]RotE&#39;s unique armor/weapons/staves are no longer lootable. May be balanced and reintegrated in the future.\r<br />[*]RotE&#39;s two spellbooks are no longer lootable. Their effects were haxxor OP omg.\r<br />[*]Vampires no longer carry silver weapons. Just no.\r<br />[*]Cloaks of Skyrim, erm, cloaks are back where they&#39;re supposed to be. (For those of you out there—you know who you are—this requires the cloaks version of this patch.)\r<br />[/LIST]   \r<br />\r<br />[SIZE=4][COLOR=#e36c09]NPCs[/COLOR][/SIZE]  \r<br />[LIST]\r<br />[*]RotE&#39;s inflated health and health offset settings have been reverted to SkyRe or Vanilla settings. While it is an &#34;AI overhaul&#34; by name, much of the added difficulty was through large health bonuses that don&#39;t really fit with the spirit of SkyRe enemy scaling.\r<br />[*]All &#34;unlimited&#34; magicka/stamina RotE tweaks have been limited to SkyRe or custom levels. This was a shortcut taken to add lots of spells. Unfortunately, the way spells were designed in RotE makes this change mostly ineffective for players trying to drain magicka from opponents. There are, however, a few circumstances where magicka drain will prevent the usage of a few Vanilla spells.\r<br />[*]Vanilla Dragon Priests reduced to level 50. Vanilla named Dragon Priests reduced to level 65.\r<br />[*]Most &#34;Warlock&#34; creature types reverted to SkyRe enemy scaling spellset. &#34;Death Priest&#34; from RotE preserved. SkyRe&#39;s unique conjuration spells will try to kill you again. \r<br />[*]Some Falmer reverted to SkyRe enemy scaling spellset and behavior. Some will swarm around you with RotE&#39;s invisibility behavior, others are just gonna kill you because they ain&#39;t even afraid.\r<br />[*]Red Eagle&#39;s health drastically reduced. Level reduced to 65. Still does plenty of damage, but it is no longer a raid encounter that required a bathroom break.\r<br />[*]Ulfric Stormcloak reverted to Vanilla settings. General Tullius was jealous.\r<br />[*]Vahlok the Jailor reduced to level 70.\r<br />[*]A handful of NPCs levels adjusted to fit SkyRe encounter zone levels.\r<br />[*]Most of the extremely high &#34;tiers&#34; of enemies added by RotE have been preserved as they have no SkyRe counterpart, and, oddly, they scale quite well with Vanilla compared to other tiers modified by RotE. High level characters (60+) may see a bit of a spike in health in some NPCs. Your Wayfarer/Fingersmith master merchant can suck it.\r<br />[/LIST]    \r<br />\r<br />[SIZE=4][COLOR=#e36c09]Spells[/COLOR][/SIZE]  \r<br />[LIST]\r<br />[*]Most of RotE&#39;s attack spells have either had charge time increased or added when there previously wasn&#39;t one. \r<br />[*]Most of RotE&#39;s conjuration spells have either had charge time increased or added when there previously wasn&#39;t one.\r<br />[/LIST]    \r<br />\r<br />So, here&#39;s the deal. Spells added by RotE have no mana cost. Zip. Zilch. Nada. This was a quick way to greatly increase damage without balancing magicka costs and NPC magicka stats. The upside is we get to see all those nifty spells/effects, and it sort of &#34;mimics&#34; AI without scripts. The downside is any strategy involving magicka drain or dodging is out the window, and it sort of breaks immersion to see an NPC machine-gunning spell after spell.  \r<br />\r<br />There are some solutions. One could compare damage values, effects, and cast times to SkyRe&#39;s changes to ballpark a spell cost. Then, one could adjust NPC magicka to fit an immersive amount of casting. But one could also write a novel, train for a marathon, or learn three new languages. Not to mention that by the time these balance changes are done, one might as well just write an entirely new mod.  \r<br />\r<br />I have elected to add/increase casting time. This reduces damage output and also prevents crazy animations from spells that had no charge time. It also prevents scenarios where certain NPCs summon 3/4/5/a bajillion conjurations in your face in the blink of an eye. You, Dragonborn, may wish to use these windows of opportunity to slay thine foes. I get to keep my sanity and maintain my suntan.  \r<br />\r<br />Mercifully, shouts already have cooldowns.  \r<br />\r<br />[SIZE=4][COLOR=#e36c09]Miscellaneous[/COLOR][/SIZE]\r<br />[LIST]\r<br />[*]RotE&#39;s extra damage perk has been scaled back according to SkyRe extra damage perks.\r<br />[*]A few Unofficial Skyrim Patch changes carried over. \r<br />[*]Official DLC changes carried over. Some Vanilla texture lighting settings have been restored.\r<br />[*]A couple Falmer will now use the &#34;Supple&#34; bow variant, because they don&#39;t lift. Ever.\r<br />[/LIST]    \r<br />\r<br />[SIZE=4][COLOR=#ff0000][B]Attention&#33; Stop skimming and read this part&#33;[/B][/COLOR][/SIZE]  \r<br />\r<br />Stats and scaled levels are a part of your savegame. Once you load an NPC into your game and make a save, no mod can change these values. And I truly mean any NPC, whether or not you fought/killed it. If you install this patch during a playthrough, you will most likely still see plenty of the stats changes as you level up and explore higher level encounter zones.   \r<br />\r<br />You know that one NPC in the Thieves Guild? Yeah, that one. You more than likely already have that NPC&#39;s stats baked into your save. One of the biggest changes with this patch are the health reductions. It is possible to reduce/increase stats permanently with console commands. It&#39;s a workaround that you mess with at your own peril, but honestly isn&#39;t too difficult if it&#39;s important to you.  \r<br />\r<br />[SIZE=4][COLOR=#00b0f0][B]Installation[/B][/COLOR][/SIZE]  \r<br />\r<br />Make a save in a quiet, happy place. Install. If you make a save while Red Eagle is mid-attack and install, you&#39;re gonna have a bad time.  \r<br />\r<br />[SIZE=4][COLOR=#00b0f0][B]Load Order[/B][/COLOR][/SIZE]  \r<br />\r<br />Place the .esp in your load order after all SkyRe .esp files and &#34;Rebirth Monster.esp&#34;. If using Skyrim Immersive Creatures and it&#39;s RotE patch, please place this .esp AFTER &#34;Rebirth Monster - SIC.esp&#34;  \r<br />\r<br />[COLOR=#00b0f0][SIZE=4][B]Recommendations[/B][/SIZE][/COLOR]  \r<br />\r<br />[URL=http://www.nexusmods.com/skyrim/mods/48629/?]SkyRe Compatibility and ReProccer Patches[/URL] Grab whatever you need. No matter what, make sure you download and install the Unofficial SkyRe Patch.  \r<br />\r<br />\r<br />\r<br />[SIZE=4][COLOR=#00b0f0]Credits[/COLOR][/SIZE]\r<br />\r<br />Thanks to MyEvergreenHometown for the awesome and creative work done on Revenge of the Enemies.\r<br />Thanks to T3nd0 for his massive overhaul.  \r<br />\r<br />Big shoutout to all the people who have slaved endlessly to keep SkyRe compatible, especially the peeps that maintain Xathra&#39;s ReProccer patches and the others who have contributed.  \r<br />\r<br />[COLOR=#00b0f0][SIZE=4]Licensing[/SIZE][/COLOR]  \r<br />\r<br />Do whatever you like with this. Just give me credit, keep me informed, and keep it on the Nexus Network.",
  "categoryId": "84",
  "version": "1.0a",
  "author": "mo_fiah",
  "createdUnix": "1405036264",
  "updatedUnix": "1405986172",
  "containsAdultContent": false,
  "uploadedBy": "anchorstates",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118657",
      "name": "SkyRe_Revenge_Patch",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "192",
      "fileName": "SkyRe_Revenge_Patch-55846-1-0a.7z",
      "uploadedUnix": "1405986099",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/63fc51932578189e5b0b4e57d9c8115ff624e2f19d391265307fc1909c3f0fb0/analysis/1406011053/",
      "changelogHtml": " Cleaned up texture lighting changes introduced by CK bug and 2 ITM records. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe_Revenge_Patch-55846-1-0a.7z?fid=1000118657&ttl=1535840841&ri=8192&rs=8192&setec=916cbce87c65253061f2160f1e0b3552"
    },
    {
      "fileId": "1000118658",
      "name": "SkyRe_Revenge_Cloaks_Patch",
      "version": "1.0a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "193",
      "fileName": "SkyRe_Revenge_Cloaks_Patch-55846-1-0a.7z",
      "uploadedUnix": "1405986172",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/2c9058f75342c0a458e387af178195825dc8686f1fae8f4acd30775f853902f2/analysis/1406011054/",
      "changelogHtml": " Cleaned up texture lighting changes introduced by CK bug and 2 ITM records. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyRe_Revenge_Cloaks_Patch-55846-1-0a.7z?fid=1000118658&ttl=1535840842&ri=8192&rs=8192&setec=931707af5179a48df0bac0d15e82530b"
    }
  ]
}