{
  "modId": 55872.0,
  "modName": "Skyrim Immersion Patch",
  "summary": "Skyrim Immersion Patch is a small collection of patches and tweaks I put together to facilitate some annoying areas. It provides bedrolls where needed, heat sources for Frostfall where it makes sense along with other small improvements.",
  "descriptionHtml": "Have you ever wondered how the Greybeards keep themselves warm? or those bandits in that tower above Riverwood? How do they prepare food in those inns?\r<br />\r<br />And what about beggars...where do they sleep?\r<br />\r<br />Mods like &#39;Cutting Room Floor&#39; or &#39;Unofficial Skyrim Patch&#39; inspired me to get started with that dreaded CK editor and give back a little to the Skyrim community.\r<br />\r<br />This mod is not earth-shattering but it provides some useful immersive changes where it makes sense.\r<br />\r<br />The mod itself is kept as simple as possible, using only Vanilla resources so far.\r<br />\r<br />FrostFall is not required although many changes in this Immersion Patch were added with Frostfall in mind. Compatibility is extended only through the addition of campfires and other heat sources.\r<br />\r<br />This mod covers the following kinds of changes:\r<br />\r<br />- Heat sources in places that make sense (such as where NPCs work all day long in cold weather)\r<br />- User accessible bedrolls in some public places (beggars beds for example)\r<br />- Extra NPCs where you would expect them (such as a Vigilant of Stendarr helping out with daedric curses in them Temple of Kynareth or guarding various Shrines of Stendarr)\r<br />- Small details that were originally missed (for example, Reyda&#39;s clothes folded on the shore in Ivarstead)\r<br />- Small updates to vendors and other loot lists (Firewood, torch, linen wraps added to Misc Merchant Items).\r<br />- Cooking Spit added to inns without kitchens (can be disabled by talking to innkeepers) \r<br />\r<br />There will be more changes in the future as I come across them. Feel free to post suggestions in the discussion area. I will be happy to include them if they are doable with minimal resources.\r<br />\r<br />Look into the Readme section for a full list of the changes so far...",
  "categoryId": "84",
  "version": "0.4",
  "author": "Agiel",
  "createdUnix": "1405092686",
  "updatedUnix": "1407817392",
  "containsAdultContent": false,
  "uploadedBy": "agiel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121587",
      "name": "Skyrim Immersion Patch 2014-08-11",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50",
      "fileName": "Skyrim Immersion Patch 2014-08-11-55872-0-4.7z",
      "uploadedUnix": "1407817392",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/b20fe08b389a050bbec4c5eb8dd38a3d6187c5cfe593235909f213d875c2d4e0/analysis/1408177300/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Immersion%20Patch%202014-08-11-55872-0-4.7z?fid=1000121587&ttl=1535840882&ri=8192&rs=8192&setec=d56b03f03e6ee36bfa9f53e7396344d0"
    }
  ]
}