{
  "modId": 55883.0,
  "modName": "Akame ga Kiru mod for Skyrim",
  "summary": "A mod currently being worked on by Ornate Chaos, Lethal Rayne and Ocelot8. It adds features from the manga that has recently been adapted to anime form, Akame ga Kiru.",
  "descriptionHtml": "*Edit: Progress on this mod has ended\r<br />\r<br />A mod that was being worked on by Ornate Chaos, Lethal Rayne and Ocelot8. It adds features from the manga that has recently been adapted to anime form, Akame ga Kiru. For those of you who don&#39;t know Akame ga Kiru is a manga about a group of assassins that attempt to bring down a corrupt government by assassinating the corrupt officials. They use items called Teigu to do this, a Teigu is an item with a unique ability such as Murasame, which kills anyone it cuts, even if the cut was not a killing cut and was just a scratch.\r<br />\r<br />Currently we are working on adding the main teigu to Skyrim, after that we will add characters from the manga as followers and a custom questline. \r<br />\r<br />Currently we have:\r<br />~ Murasame which we used the akaviri katana as a base, the sword is used in one hand in the manga which is why we used a one handed sword yet we recommend that you not use anything else in your other hand as it breaks the feel of the weapon (it&#39;s op enough on it&#39;s own). Murasame is a katana that kills anyone it cuts almost instantly, even if the cut bearly did any damage.\r<br />\r<br />~ Ecstasy, a pair of giant scissors that can cut through anything (texture can&#39;t be done until Lethal gets online\r<br />\r<br />As both of us are new to Skyrim modding we appreciate any feedback and help that you can offer us. We would love any help or suggestions you can offer. We are also in need of some more experienced modders to help us out with some of the more complex things that we have trouble with. Such as anyone experienced in 3D editing or at making custom spells and effects. So if you are interested in helping please contact me at isaac.gamer.nz@gmail.com, we would greatly appreciate it and would be honoured working with you.\r<br />\r<br />So far if you want Murasame open console commands using the tilde key and type &#34;help murasame&#34;, some id&#39;s will come up and one of them has WEAP. Then type &#34;player.additem xxxxx 1&#34; replacing xxxxx with the id.\r<br />\r<br />As both of us are new to Skyrim modding we appreciate any feedback and help that you can offer us.\r<br />\r<br />Installation:\r<br />1) Extract the Akame ga Kiru folder into your data folder at SteamSteamAppscommonSkyrimData\r<br />2) Load Skyrim and select data files, then tick the Akame ga Kiru.esp box\r<br />3) Play Skyrim\r<br />\r<br />Uninstallation: Delete the Akame ga Kiru.esp file in your data folder or from data files.\r<br />\r<br />Change Log:12/07/2014: Added Murasame.\r<br />\r<br />Future Updates:1. Make more Teigu.\r<br />2. Add custom companions from the manga.\r<br />3. Add some form of a questline (will likely build off of the Dark Brotherhood as the plot is quite similar, assassinate the emperor and all).\r<br />\r<br />Known Issues:None so far.\r<br />\r<br />Faqs:\r<br />What is this? \r<br />A mod for Skyrim based on the manga Akame ga Kiru.\r<br />\r<br />How do I install?\r<br />Read the readme.",
  "categoryId": "28",
  "version": "0.1",
  "author": "OrnateChaos LethalRayne and Ocelot8 ",
  "createdUnix": "1405143344",
  "updatedUnix": "1405233461",
  "containsAdultContent": false,
  "uploadedBy": "OrnateChaos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117249",
      "name": "Akame ga Kiru",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Akame ga Kiru-55883-0-1.7z",
      "uploadedUnix": "1405233461",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/bade948a3eb70f36ad06e9d57344bdb672bbfad41cc7bac6341e4066f51361ea/analysis/1405233483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Akame%20ga%20Kiru-55883-0-1.7z?fid=1000117249&ttl=1535840902&ri=8192&rs=8192&setec=b62801b09871246380eeca458540f119"
    }
  ]
}