{
  "modId": 55896.0,
  "modName": "Dynamic Birthsigns",
  "summary": "Birthsigns now have much more powerful influence on the player, if right now there is a constellation in the sky, matching this stone.",
  "descriptionHtml": "According to the Lore, there is a different  birthsigns, which player can choose, to change his attributes. Each sign corresponds to a particular month of the year. Now you can aquire much more powerful bonuses from your sign, if it matches current month of the year.\r<br />\r<br />FULL LIST OF CHANGES:\r<br />\r<br />-Apprentice Sign: magicka regeneration doubled from 100% to 200%, same about magic weakness. Very dangerous to fight with other mages or dragons, but useful for... apprentices, i suppose, if you are just practicing magic in safety.\r<br />\r<br />-Atronach Sign: just 100 additional points of magicka instead of 50, same thing about decreasing magicka regen rate from 50% to 100%. \r<br />\r<br />-Lady Sign: 50% fortify regen rate of health and stamina.\r<br />\r<br />-Lord Sign: +100 to armor rating, 50% magicka resistance. If you are a Breton, then the First Seed will be your lucky month.\r<br />\r<br />-Lover Sign: 25% faster learning of all skills\r<br />\r<br />-Mage Sign: all spells cost 20% cheaper magicka.\r<br />\r<br />-Ritual Sign: reanimated corpses now sustain reanimated for 24 hours, level of creatures raised to 100.\r<br />\r<br />-Serpent Sign: paralyse and poison effects lasts twise longer, and deals triple damage.\r<br />\r<br />-Shadow Sign: invisibility for 24 hours. I think its fair enough, because, sooner or later, you will activate something anyway.\r<br />\r<br />-Steed Sign: additional 25% faster moving. I think it is fair too (remembering my Sonic-like character from Morrowind with Steed birthsign, lol)\r<br />\r<br />-Thief Sign: your Achemy is 20% better. \r<br />\r<br />-Tower Sign: one month in a year your lockpicks will never broke again. Maybe you will say that this is overpowered, but, for me, this birthsign is so useless in vanilla game, so, we need to reward those of us, who still prefer it.\r<br />\r<br />-Warrior Sign: your weapon attacks deals 20% more damage.\r<br />\r<br /> \r<br />For example, you start the game at 17th of Last Seed month- it matches the Warrior stone (you can find information about that in &#34;The Firmament&#34; book in-game), so, you will get additional 20% stronger weapon attacks, besides his original bonus of 20% faster learning the combat skills.\r<br />\r<br />Different birthsigns will give you different attributes. Thief now can make 20% stronger potions, besides his original bonus, Mage can cast spells for 20% cheaper cost of magicka (original bonuses will stay at every birthsign too), Steed can run 15% faster, Lover can learn everything 25% faster... Some powers became much stronger- for example, with the Ritual birthsign, now you can be a very effective necromancer at the Morning Star month, because your minions can be much higher level, and will stay alive for 24 hours. You will not be disappointed with your new powers. \r<br />\r<br />Actually, I think, it could be very good for roleplayers, who wants to play as а pilgrim, travel to different standing stones at the end of each month, to maintain good bonuses and abilities.\r<br />\r<br />IMPORTANT info about Serpent sign: according to Lore, there is no month appropriate to this sign, because it is always changing his position in the night sky. So, a assumed, then you can use all bonuses of this sign in the second half of the year. Experts of TES lore, please, correct me, if I am not right.\r<br />\r<br />There is a lot of changes in birthsigns, so it will conflict almost with everythig, that changes the same things. WILL conflict with SkyRe, but if you will disable SkyRe module &#34;Standing Stones Module&#34; everything will be alright.\r<br />\r<br />And, guys, sorry for bad English.\r<br />\r<br />INSTALL- as usual: put file DoomStones .esp in your Data category, activate the file DoomStones .esp, but after that you will need to re-select your current birthsign (choose another one, by activating the appropriate stone).\r<br />\r<br />UNINSTALL- delete the DoomStones .esp file.",
  "categoryId": "78",
  "version": "1.0.1",
  "author": "GR1n",
  "createdUnix": "1405169891",
  "updatedUnix": "1405198149",
  "containsAdultContent": false,
  "uploadedBy": "Gr1n",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117130",
      "name": "Dynamic Birthsigns",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dynamic Birthsigns-55896-.rar",
      "uploadedUnix": "1405169766",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/24b4152a87129421a49e2f6057f8020c77d04963b084017e7833423f72a1a1ef/analysis/1405169832/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Birthsigns-55896-.rar?fid=1000117130&ttl=1535840920&ri=8192&rs=8192&setec=1caa5bb78b567f7da4206cbb418e7ae1"
    },
    {
      "fileId": "1000117197",
      "name": "Dynamic Birthsigns v 1.0.1",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Dynamic Birthsigns v 1.0.1-55896-1-0-1.rar",
      "uploadedUnix": "1405198149",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/6e6c0d53889828ad561f6cb415c4f21aada6e40f4bcdd99d0549a0f7f336a288/analysis/1405198210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Birthsigns%20v%201.0.1-55896-1-0-1.rar?fid=1000117197&ttl=1535840920&ri=8192&rs=8192&setec=4f3e799723e0ac3a82cfce8fdf073934"
    }
  ]
}