{
  "modId": 55921.0,
  "modName": "Skyrim Graphics Guide",
  "summary": "A comprehensive guide to improve Skyrims rendering, with a barebones ENBSeries preset, suggestions with actually useful INI Tweaks and of course, mods.",
  "descriptionHtml": "[center][size=3][url=http://www.nexusmods.com/skyrim/mods/50244/?]Skyrim Stability Guide[/url][/size][/center]\r<br />\r<br />Throughout the years that Skyrim has existed on PC, many people have recommended various changes to many aspects of Skyrim to improve the graphical experience. Unfortunately, too many of them are harmful tweaks to Skyrim’s INI settings, or useless settings that bloat these files.\r<br />\r<br />A lot of these recommendations have been ENBSeries presets, designed to significantly improve Skyrim’s post-processing. ENBSeries has many valuable fixes to Skyrim’s rendering, however its other improvements often hamper performance no matter what.\r<br />\r<br />This is a comprehensive guide to improve the rendering side of Skyrim. Knowing how to install a mod and edit a config file is assumed.\r<br />\r<br />[color=#ffcc33][size=3]If this guide helps you, please download and endorse to help more people improve Skyrim’s graphics.[/size][/color]\r<br />\r<br />[size=7]ENBSERIES[/size]\r<br />There are numerous ENB presets available for download, significantly altering Skyrim’s graphics with varying levels of performance. Only a few ENB’s are designed to look like vanilla, such as SkyRealism, yet these are most often out of date. This ENB is designed to completely maintain Skyrim’s post-processing, with only minor alterations to Skyrim’s object processing and a very low performance hit.\r<br />\r<br />What is the point of this ENB then? It is basically a minor patch to Skyrim’s rendering, improving shadow detail and the casting of shadows, the sky and its reflection on the water, minor fixes to particles and optionally improvements to Skyrim’s water rendering, adding shadows, lighting and better shoreline blending. It also includes ENB’s fixes for Parallax, ENBoost, better Anisotropic Filtering and the double cursor glitch. This is all within Skyrim’s forward rendering pipeline, in simple terms you can use Skyrim’s Anti-Aliasing (x2, x4, and x8 if you’re crazy) with this mod.\r<br />\r<br />[color=#ffcc33][size=3]If you already have an ENB, then you already have the majority of these fixes and can ignore this.[/size][/color]\r<br />\r<br />[color=#ffcc33][size=3]Installation[/size][/color]\r<br />Go to [url=http://enbdev.com/mod_tesskyrim_v0254.html]http://enbdev.com/mod_tesskyrim_v0254.html[/url] and scroll right down until you find the ‘Download’ button. Download this and my ENB files in the download section. Download the Water Improvements version if you have performance to spare. Extract [b][i]only[/b][/i] the d3d9.dll file in the ‘Wrapper’ folder for the first download and my files into your Skyrim root folder (where TESV.exe is located). Edit your enblocal.ini files ENBoost settings according to my Stability Guide, ([url=http://www.nexusmods.com/skyrim/mods/50244/?]http://www.nexusmods.com/skyrim/mods/50244/?[/url]).\r<br />\r<br />Lastly, open up your SkyrimPrefs.ini file (My Documents/My Games/Skyrim), find the line ‘[color=#ffcc33]bFloatPointRenderTarget=0[/color]’ in the [Display] section and set it to 1. ENBSeries requires this to function.\r<br />\r<br />[color=#ffcc33][size=6]Technical Breakdown of ENB Preset[/size][/color]\r<br />[color=#ffcc33][size=3]Shadows[/size][/color]\r<br />ENB has many fixes for Skyrim’s shadows. It doesn’t solve the fundamental problems of Skyrim’s shadow technique, which is outdated and slow. It has a variety of improvements to make them bearable.\r<br />\to\t[b]Self-shadowing of characters[/b] – Vanilla is insanely inaccurate with shadow detail on characters, with rampant flickering, no precision alongside highly inaccurate casting of shadows from hoods, cloaks (mods) and bows. ENB dramatically improves this to bearable levels, the most noticeable improvement in shadow rendering.\r<br />\to\t[b]Shadow Aliasing[/b] – This fundamentally cannot be eradicated but it is reduced to less noticeable levels primarily in interiors, where a massive improvement can be seen.\r<br />\to\t[b]Shadow Striping[/b] – Better filtering of distant shadows removes most sources of striping in the distance, as long as Shadow LOD settings are left at default in the Skyrim.\r<br />\to\t[b]Accurate Casting[/b] – Precision on mountain geometry, buildings, characters and more is improved, increasing realism across the board.\r<br />\to\t[b]Vegetation shadows[/b] – Grass finally casts a shadow and reacts properly to shadows cast upon it. Minor improvements to tree shadowing.\r<br />\r<br />[color=#ffcc33][size=3]Sky rendering[/size][/color]\r<br />The largest problem with vanilla Skyrim’s sky (besides dated clouds and a bad horizon) is actually its reflection unto the water. It isn’t locked to the water plane, when you jump the sky jumps with you along the water. Alongside this, there is heavy sky banding (Google ‘colour banding’ if your confused) and imprecise math used to calculate the gradients.\r<br />\to\t[b]Procedural Sun[/b] – An ENB shader to replace Skyrim’s imprecise sun texture with a shader effect. Far more accurate, less issues with rendering.\r<br />\to\t[b]Sky Reflection[/b] – Finally locked down to the water plane, finally provides stable water reflections.\r<br />\to\t[b]Sky Banding[/b] – Dramatically reduces the banding effect across the sky, and completely removes it if used with an improved sky mesh, such as the one included with Pure Weathers.\r<br />\r<br />[color=#ffcc33][size=3]Water rendering[/size][/color]\r<br />Skyrim’s water by nature is nothing to boast about, a simple water plane with basic normal maps. Its default texture is awful, its shoreline blending is horrid and its LOD texture is even worse. To top this off, specularity is imprecise and reflections are a joke. ENB has some improvements that allow the water to fade into the scene with less issues.\r<br />\to\t[b]Improved blending[/b] – Shoreline blending finally works completely (at least with Pure Waters). Easily the most notable improvement, allowing water to fade into the background.\r<br />\to\t[b]Volumetric Shadows and Lighting[/b] – Water at least blends into the environment, with objects like bridges casting shadows onto the water, and the scene generally providing basic lighting to the water.\r<br />\to\t[b]Improved Dispersion effects[/b] – Wading through the water now produces far better effects then vanilla, easily noticeable.\r<br />\r<br />[color=#ffcc33][size=3]Other ENB improvements[/size][/color]\r<br />\to\t[b]Particles[/b] – Better visual collision with surfaces, less coarse and less aliasing. Also better blending between overlapping fires.\r<br />\to\t[b]Parallax fixes[/b] – Allows proper parallax textures and meshes for many objects in the game.\r<br />\to\t[b]Snow brightness fix[/b] – A slight decrease to Direct Lighting intensity improves the blinding snow effect, making it less overblown and more realistic, yet still present.\r<br />\to\t[b]Transparency Sorting[/b] – Better sorting of some objects (like trees) through effects like fog, barely noticeable but present. \r<br />\to\t[b]Double Cursor Fix[/b] – No more need for SKSE plugins to fix this, ENB does it for you.\r<br />\to\t[b]Occlusion Culling[/b] – Minor improvement to the polygon and draw call (unique objects) counts, improving performance on bottlenecked systems. \r<br />\to\t[b]Improved Anisotropic Filtering[/b] – Skyrim uses very poor filtering by default, causing a loss of distant detail. ENB enables the highest quality filtering, for improved clarity of textures.\r<br />\r<br />\r<br />[size=7]INI TWEAKS[/size]\r<br />This section is here to clarify and recommend many tweaks that will improve the rendering of the game.\r<br />\r<br />[i]These INI files are located in My Documents/My Games/Skyrim. The two files are SkyrimPrefs.ini, Skyrim.ini. If you use Mod Organiser, they are located in your Mod Organiser folder, within Mod Organiser/profiles/(YourProfileNameHere).[/i]\r<br />\r<br />[b]If you want a better Notepad, I recommend Notepad++, download, and open the files with that.[/b]\r<br />\r<br />[color=#ffcc33][size=3]Warning[/size][/color]\r<br />[color=#ffcc33][b][i]It is highly recommended you start with a fresh set of INI files set to Ultra[/i][/b][/color], delete your existing ones and launch the Skyrim Launcher to regenerate them. Use Ultra settings if you can, they should be your baseline. 4x Multisampling is more than enough for 1080p, since no form of hardware transparency anti-aliasing is present in Skyrim.\r<br />\r<br />[color=#ffcc33][size=3]How to Tweak[/size][/color]\r<br />Simply find the lines to change, and change them. Most will be already there, if not add them. The Baseline will be what you should always change, anything else in any section are optional changes. Optional changes always modify existing variables listed in the baseline. [color=#ffcc33][b]Use the baseline settings then modify certain lines based on what you desire.[/b][/color] Some of these will not be in your files, add them if they aren’t.\r<br />\r<br />[color=#ffcc33][size=6]Shadows[/size][/color]\r<br />Despite three years of torment, no-one (Especially not Bethesda) has a true solution for Skyrim’s shadows. It’s always been a quantity vs quality choice, distance or detail. This cannot be changed. While the shadows on characters are mostly fixed with ENBSeries, shadows in general still have the same problems.\r<br />\r<br />[color=#ffcc33][size=3]Baseline[/size][/color] \r<br />[color=#ffcc33](The following are in the Display section of SkyrimPrefs.ini)[/color] \r<br />[size=2][font=Courier New]iBlurDeferredShadowMask=4\r<br />fInteriorShadowDistance=3000.0000\r<br />fShadowDistance=5500.0000\r<br />iShadowMode=4\r<br />bTreesReceiveShadows=1\r<br />bDrawLandShadows=1\r<br />iShadowMapResolution=2048\r<br />fShadowBiasScale=0.2500\r<br />iShadowMaskQuarter=4\r<br />iShadowFilter=4\r<br />bShadowsOnGrass=1[/font][/size]\r<br />\r<br />[color=#ffcc33][size=3]Detail over Distance[/size][/color]\r<br />[size=2][font=Courier New]fShadowDistance=3000.0000[/font][/size]\r<br />\r<br />[color=#ffcc33][size=3]Distance over Detail[/size][/color]\r<br />[size=2][font=Courier New]fShadowDistance=6500.0000[/font][/size]\r<br />\r<br />[color=#ffcc33][size=3]High Resolution[/size][/color]\r<br />[color=#ffcc33](Warning, heavy performance impact possible)[/color]\r<br />[size=2][font=Courier New]iShadowMapResolution=4096\r<br />fShadowBiasScale=0.1500[/font][/size]\r<br />\r<br />[color=#ffcc33][size=4]Explanation[/size][/color]\r<br />First off, [color=#ffcc33]iBlurDeferredShadowMask[/color]. Too much blur, and you’re crushing the possible detail that can be recovered by ENBSeries. Also, every blur pass hits performance. Too little blur, and ENBSeries doesn’t blur correctly, and as a bonus you get horrid shadows. A value of 4 works perfectly.\r<br />\r<br />[color=#ffcc33]fInteriorShadowDistance[/color] and [color=#ffcc33]fShadowDistance[/color], these are simple. Interior shadows are perfect with ENBSeries, so the full distance of 3000 works well. [color=#ffcc33]fShadowDistance[/color] impacts immersion greatly, shadows are the most visual demonstration of depth in a 3D world. Too high however, and shadows become a joke. 5500 strikes a balance, but this is more of a personal choice, change as you will. The shadow map is a texture. Skyrim stretches this texture depending on this distance.\r<br />\r<br />[color=#ffcc33]iShadowMode[/color], [color=#ffcc33]iShadowFilter[/color] and [color=#ffcc33]iShadowMaskQuarter[/color]. The first two control the quality of certain passes done to the shadow texture, values of 4 appear to have a mild improvement in precision of the casting of finer shadows, with no real impact on performance. [color=#ffcc33]iShadowMaskQuarter[/color] is a variable no-one fully understands, its best left to its Ultra setting of 4. Setting it to 8 made no real difference on any shadowing present.\r<br />\r<br />[color=#ffcc33]bTreesReceiveShadows[/color], [color=#ffcc33]bDrawLandShadows[/color], [color=#ffcc33]bShadowsOnGrass[/color]. The names of these variables are explanatory enough, the quality of these passes however are improved with ENBSeries, and should be enabled.\r<br />\r<br />[color=#ffcc33]iShadowMapResolution[/color] has an impact on [color=#ffcc33]fShadowBiasScale[/color], and thankfully Skyrim has values already for each resolution. [color=#ffcc33]iShadowMapResolution[/color] is set to 2048, which is sufficient for high resolution character shadowing with ENBSeries and decent quality for other shadowing. 4096x is an option if you have a strong GPU (192 bit Memory Bus+, high end model) or performance to spare. Different scenes will have varying levels of performance impact. Quick note, shadows are rendered on the GPU, not the CPU.\r<br />\r<br />[color=#ffcc33][size=6]LOD[/size][/color]\r<br />Skyrim has three options for improving LOD distance, and two are relatively harmful. One is safe but still has a performance and VRAM hit.\r<br />\r<br />[color=#ffcc33]uGridsToLoad[/color] is an old variable, present since the engine was first accessible years ago. Skyrim’s world is divided into cells, forming a large grid. If the player were the centre of this grid, uGridsToLoad controls how many of these cells in a radius around the player have their content fully loaded into memory. Every cell fully loaded can include actors, geometry, navmeshs, scripts, textures, lights, high-resolution water and 3D trees. Its default value is 5, which is conservative and safe. Papyrus (scripting engine) has its load kept low, draw call count (amount of unique objects to be processed by the CPU and GPU drivers) is kept minimal, Video memory is kept low due to less HD textures presently loaded and Skyrim’s forward renderer is fed a smaller list of lights in the scene.\r<br />\r<br />Increasing this variable overloads many aspects of Skyrim’s 32 bit engine, designed for machines with just 512MB of combined RAM and VRAM. There are safer ways to render certain aspects of the game at a longer distance.\r<br />\r<br />Another method to improve the quantity and maximise the quality of LOD objects is to flag the full quality mesh of an object with the ‘Is Full LOD’ in the Creation Kit, like Distant Detail. This will exponentially increase the polygon count compared to other methods, and increase the draw call count significantly, depending on how many are flagged to load regardless of distance to the object. This is a bad choice, possible causing aliasing or z-flickering, and increasing the CPU load.\r<br />\r<br />The desirable method to distant detail is to have polygon-reduced models loaded past a certain distance, which switches to the full-polygon model when closer to the player. Less noticeable objects are kept out of the LOD, with a focus on larger rocks and noticeable objects like bridges or forts. Skyrim has these models for only mountain meshes, a few rocks and major architecture. There is a mod recommended in the next section to add significantly more LOD objects, yet the following tweaks work regardless of mods (of course with a less significant impact).\r<br />\r<br />Skyrim has four LOD levels, starting with fully loaded cells, then Level 0, 1 and 2. Level 2 is loaded depending on the distance that the world in general is loaded at ([color=#ffcc33]fBlockMaximumDistance[/color]). It includes a decent amount of very low-poly meshes for the mountains, some major features (Holds, solitude rock) as well as some major cliffs/rock meshes. Level 1 includes more LOD objects like forts, ruins and many more major rocks. Level 0 includes these LOD objects at much higher detail levels and additionally some smaller meshes. Fully loaded cells have full detail meshes loaded right up to the cell edge.\r<br />\r<br />[color=#ffcc33][size=3]Baseline[/size][/color]\r<br />[color=#ffcc33](The following are in the TerrainManager section of SkyrimPrefs.ini)[/color]\r<br />[size=2][font=Courier New]fTreeLoadDistance=125000.0000\r<br />fBlockMaximumDistance=250000.0000\r<br />fBlockLevel1Distance=70000.0000\r<br />fBlockLevel0Distance=35000.0000\r<br />fSplitDistanceMult=1.50000[/font][/size]\r<br />\r<br />[color=#ffcc33][size=3]Distance[/size][/color]\r<br />[color=#ffcc33](Warning, heavy performance impact possible, especially on HDD based systems)[/color]\r<br />[size=2][font=Courier New]fBlockLevel1Distance=120000.0000\r<br />fBlockLevel0Distance=70000.0000[/font][/size]\r<br />\r<br />[color=#ffcc33][size=3]Performance[/size][/color]\r<br />[color=#ffcc33](Loss of quality will be present in LOD meshes, use if stuttering after installing the SDO mod)[/color]\r<br />[size=2][font=Courier New]fBlockLevel1Distance=50000.0000\r<br />fBlockLevel0Distance=25000.0000[/font][/size]\r<br />\r<br />[color=#ffcc33][size=3]Terrain detail[/size][/color]\r<br />[color=#ffcc33](Warning, heavy performance hit and longer loading times possible, especially on HDD based systems)[/color]\r<br />[size=2][font=Courier New]fSplitDistanceMult=2.00000[/font][/size]\r<br />\r<br />[color=#ffcc33][size=4]Explanation[/size][/color]\r<br />[color=#ffcc33]fTreeLoadDistance[/color] is a very simple variable, it controls the distance that LOD trees (flat, 2D intersecting planes textures) are rendered at. 75000 is relatively low, especially when viewed from a high place. 125000 is a distance that ensures visible terrain is covered in trees. Past this, with fog and blur, you will not notice a difference.\r<br />\r<br />[color=#ffcc33]fBlockMaximumDistance[/color] controls the distance that cells are rendered at. 250000 is the ultra setting, and there is no practical difference when raising it. It is best to leave this at default.\r<br />\r<br />[color=#ffcc33]fBlockLevel1Distance[/color] and [color=#ffcc33]fBlockLevel0Distance[/color] are very important variables, which control the distance that LOD objects are rendered at and the quality they are rendered at. 70000 and 35000 is the ultra default, and is the baseline I recommend. Lowered past this, distant mountain meshes will no longer load in the higher quality Level0 region, and instead load in the Level1 region. Additionally, and many new LODs won’t appear due to a smaller Level1 region. Raise it past this, and meshes in the Level0 will gain detail, and more meshes will be rendered in the Level1 region at a greater distance. These variables have varying levels of performance impact on different systems. HDD based systems will gain stutter however on higher settings. Better CPU’s can process more unique objects without hitches or performance impacts. When using raised values and the Skyrim Distance Overhaul, I recommend at least an i5.\r<br />\r<br />[color=#ffcc33]fSplitDistanceMult[/color] controls the quality of the landscape mesh and texture. Its default of 1.5 is adequate, yet at 2.0 it raises texture quality and mesh accuracy to a good degree, while avoiding the loading errors that occur at excessive values. If you suffer any form of Infinite Loading Screens, revert this variable.\r<br />\r<br />[color=#ffcc33][size=6]Grass[/size][/color]\r<br />Skyrim renders grass at a relatively short distance, and for good reason. Skyrim’s grass is limited by the [color=#ffcc33]uGridsToLoad[/color] value. With a value of 5, it can render up to ~7000 (the ultra default) before the grass attempts to render past the limit. When it reaches this limit the grass will stop expanding into the distance, and wait for a new cell to be loaded. When loaded, the grass that was waiting to load will ‘pop’ into view, a very visible issue many complain about when raising these values.\r<br />\r<br />Since most extra variables are ineffective and seem to not work as planned, there is nothing to change here. Grass should be left at default settings to avoid the grass pop-up on cell transition.\r<br />\r<br />[color=#ffcc33][size=4]Explanation[/size][/color]\r<br />[color=#ffcc33]fGrassStartFadeDistance[/color] and [color=#ffcc33]fGrassMaxStartFadeDistance[/color] should be capped at 7000 to avoid the cell transition issue, unless you use higher uGrids settings and have changed [color=#ffcc33]iGrassCellRadius[/color]. [color=#ffcc33]fGrassMinStartFadeDistance[/color] should be kept at 0 to avoid bad grass fading.\r<br />\r<br />[color=#ffcc33]iGrassCellRadius[/color] is a setting you can add to the Grass section of Skyrim.ini IF you are changing [color=#ffcc33]uGridsToLoad[/color], and WILL cause issues if you are not. The formula for this value is uGridsToLoad/2 - 0.5 (uGrids 7/2 = 3.5 – 0.5 = 3.). This will increase the maximum radius for grass, and allow you to experiment with higher [color=#ffcc33]fGrassStartFadeDistance[/color] and [color=#ffcc33]fGrassMaxStartFadeDistance[/color] values.\r<br />\r<br />[color=#ffcc33][size=6]Water[/size][/color]\r<br />Skyrim has very few settings for controlling water. Most are hidden away, and disabled. Many are from the older titles (Fallout NV and beyond), and no longer have a real effect. Only two variables can be changed for an improvement from the default ultra settings, yet even then the effect is very subtle.\r<br />\r<br />[color=#ffcc33][size=3]Baseline[/size][/color]\r<br />[color=#ffcc33](The following are in the Water section of SkyrimPrefs.ini)[/color] \r<br />[size=2][font=Courier New]iWaterReflectHeight=1024\r<br />iWaterReflectWidth=1024 \r<br />bUseWaterDisplacements=1\r<br />bUseWaterRefractions=1\r<br />bUseWaterReflections=1\r<br />bUseWaterDepth=1[/font][/size]\r<br />\r<br />[color=#ffcc33](The following are in the Water section of Skyrim.ini)[/color] \r<br />[size=2][font=Courier New]bReflectSky=1\r<br />bReflectLODTrees=1\r<br />bReflectLODObjects=1\r<br />bReflectLODLand=1[/font][/size]\r<br />\r<br />[color=#ffcc33][size=4]Explanation[/size][/color]\r<br />[color=#ffcc33]iWaterReflectHeight[/color] and [color=#ffcc33]iWaterReflectWidth[/color] control the resolution of the real-time reflections for Skyrim’s ‘updated’ water rendering. Increasing them has a very subtle effect, most noticeable with the detail of glacier reflections on still LOD water. It has an exponential performance hit, especially at 4096x. 1024x has no real effect on performance.\r<br />\r<br />[color=#ffcc33]bUseWaterDisplacements[/color], [color=#ffcc33]bUseWaterRefractions[/color], [color=#ffcc33]bUseWaterReflections[/color], [color=#ffcc33]bUseWaterDepth[/color] are all standard, keeping them enabled ensures Skyrim’s water is completely rendered with all effects.\r<br />\r<br />[color=#ffcc33]bReflectSky[/color], [color=#ffcc33]bReflectLODTrees[/color], [color=#ffcc33]bReflectLODObjects[/color], [color=#ffcc33]bReflectLODLand[/color] are all self-explanatory and simple. [color=#ffcc33]bReflectSky[/color] can now be enabled with ENBSeries without unstable sky reflections. Skyrim only reflects LOD objects as they are cheap, low-polygon, pre-calculated and fewer in number. It keeps performance high on Skyrim’s outdated renderer.\r<br />\r<br />[color=#ffcc33][size=6]Other[/size][/color]\r<br />[color=#ffcc33](The following are in the General section of Skyrim.ini)[/color]\r<br />[size=2][font=Courier New]fFlickeringLightDistance=7000.00[/font][/size]\r<br />\r<br />[color=#ffcc33](The following are in the Display section of Skyrim.ini)[/color]\r<br />[size=2][font=Courier New]fLightLODMaxStartFade=7000.00 \r<br />bDecalsOnSkinnedGeometry=1 \r<br />fSunShadowUpdateTime=0.1000\r<br />fSunUpdateThreshold=2.0000[/font][/size]\r<br />\r<br />[color=#ffcc33](The following are in the Display section of SkyrimPrefs.ini)[/color]\r<br />[size=2][font=Courier New]iMaxAnisotropy=16\r<br />fTreesMidLODSwitchDist=10000000.0000\r<br />fLightLODStartFade=7000.00\r<br />bFloatPointRenderTarget=1[/font][/size]\r<br />\r<br />[color=#ffcc33](The following are in the Main section of SkyrimPrefs.ini)[/color]\r<br />[size=2][font=Courier New]fSkyCellRefFadeDistance=250000.0000[/font][/size]\r<br />\r<br />[color=#ffcc33][size=4]Explanation[/size][/color]\r<br />Skyrim has two types of lights the game can load, static and animated (flickering) lights. [color=#ffcc33]fFlickeringLightDistance[/color] controls the distance that lights flicker at. When set lower then [color=#ffcc33]fLightLODMaxStartFade[/color], there will generally be pop-in as the light changes from static to animated. Keep this at the same setting as [color=#ffcc33]fLightLODMaxStartFade[/color].\r<br />\r<br />[color=#ffcc33]fLightLODMaxStartFade[/color] and [color=#ffcc33]fLightLODStartFade[/color] control the rendering distance of lights in Skyrim. The default value of 3500.00 is too low for a modern system, which can handle many more lights (thousands more in a better renderer, not just 5). Make sure [color=#ffcc33]fFlickeringLightDistance[/color] is the same as this variable. \r<br />\r<br />[color=#ffcc33]bDecalsOnSkinnedGeometry[/color] allows blood decals to apply to ‘skinned’ models, such as NPC and player models. This should specifically be for the skin of a model, not the clothing geometry, which is handled by other variables.\r<br />\r<br />[color=#ffcc33]fSunShadowUpdateTime[/color] and [color=#ffcc33]fSunUpdateThreshold[/color] control the speed and timing of shadow time-of-day updates. These settings keep the transitions quick and subtle.\r<br />\r<br />[color=#ffcc33]iMaxAnisotropy[/color] controls the amount of filtering applied to textures, this can significantly reduce blurry distant textures. ENBSeries however provides better anisotropic filtering, while also providing better compatibility with Skyrim’s rendering compared to Driver-force Anisotropic filtering. Ensuring ENBSeries and Skyrim have the same setting will maximise compatibility.\r<br />\r<br />[color=#ffcc33]fTreesMidLODSwitchDist[/color] controls the distance that trees switch to a lower-polygon model. What I recommend is the same as the Ultra settings for this, but it’s still included to ensure people keep it maxed. This switching can be a very distracting visual effect.\r<br />\r<br />[color=#ffcc33]bFloatPointRenderTarget[/color] enables a wider range of colour values for rendering, enabling greater precision, less banding and more intense extremes of different effects in theory. In reality, Skyrim’s engine doesn’t utilise these values well. ENBSeries does use and requires this sort of precision however.\r<br />\r<br />[color=#ffcc33]fSkyCellRefFadeDistance[/color] controls the distance that 3D clouds on mountains are rendered at. Setting this to match [color=#ffcc33]fBlockMaximumDistance[/color] is a safe way to add more detail in the distance, and to additionally conceal more of the distant mountains z-flickering.\r<br />\r<br />[color=#ffcc33][size=6]Placebo/Harmful/Useless settings[/size][/color]\r<br />[color=#ffcc33]iShadowSplitCount[/color], [color=#ffcc33]iShadowMapResolutionPrimary[/color] and [color=#ffcc33]iShadowMapResolutionSecondary[/color] aren’t included, because it appears that these values are hardcoded, and changing them has no effect. [color=#ffcc33]iShadowSplitCount[/color] controls the amount of shadow maps rendered, which are layered across a distance dependent on [color=#ffcc33]fShadowDistance[/color]. More cascades would hit performance, but you could reduce the resolution of cascades further out. (Primary and Secondary) to reduce that hit. Every cascade allows each shadow map to be stretched less. Unfortunately it seems that these values are locked, hardcoded and currently untouchable. Such a shame…\r<br />\r<br />[color=#ffcc33]bShadowMaskZPrepass[/color] and [color=#ffcc33]bMainZPrepass[/color] are useless variables, Z-Prepassing is an older technique, one that most agree doesn’t really help performance anymore on DX11+ GPU’s without heavy optimization, which Bethesda clearly didn’t bother with. It additionally can cause rendering glitches with many systems. Best it’s left disabled, saving useless effort.\r<br />\r<br />[color=#ffcc33]fShadowLODStartFade[/color] and all shadow fade settings are generally harmful to the quality of the shadows in one way or another. Max this out to 1000 and your shadows will have a visible line as the fade distance is reached. Max all shadow LOD settings to 6000, and nothing changes. Leave this at 200. \r<br />\r<br />[color=#ffcc33]bTransparencyMultisampling[/color] and [color=#ffcc33]iWaterMultiSamples[/color] are older variables from Fallout NV and beyond, no longer functioning in Skyrim. [color=#ffcc33]bTransparencyMultisampling[/color] should allow multisampling on transparent textures, like trees and grass. If you enable this form of multisampling through the control panel however, a significant amount of glitches occur (likely due to Skyrim’s poor transparency sorting). [color=#ffcc33]iWaterMultiSamples[/color] in older games provided anti-aliasing to the water shader. This variable does nothing in Skyrim.\r<br />\r<br />[color=#ffcc33]bAllow30Shaders[/color] has no real effect with Skyrim. Shader Packages from the older games are gone, it’s a relic of an older system. Skyrim has one set of shaders, and this variable has no real effect.\r<br />\r<br />[color=#ffcc33]b30GrassVS[/color] has been proven to have no real effect, it is not worth enabling.\r<br />\r<br />[color=#ffcc33]bGrassPointLighting[/color] should enable point lighting (light sources) to light grass, but this option seems to not work as intended, with no relation to [color=#ffcc33]b30GrassVS[/color] or anything else. Skyrim’s grass shader is incredibly simple, to compensate for its brute force rendering of grass objects. Point lighting does not appear to be a part of this shader, so this option by nature cannot do anything.\r<br />\r<br />[color=#ffcc33]bUseWaterHiRes[/color], [color=#ffcc33]bForceHighDetailReflections[/color] and [color=#ffcc33]bAutoWaterSilhouetteReflections[/color] are all left out as they appear to have no real effect on Skyrim’s water, and aren’t in the config files at all initially. The first two could be added to Skyrim.ini and set to 1, however you will likely see no difference at all.\r<br />\r<br />[color=#ffcc33]bUseWaterReflectionBlur[/color] and [color=#ffcc33]iWaterBlurAmount[/color] are left out as they are relics of an older water renderer and again have no effect.\r<br />\r<br />[color=#ffcc33][size=3]If you have any tweaks you would like clarification on, post in the comments.[/size][/color]\r<br />\r<br />[size=7]MODS[/size]\r<br />Skyrim’s rendering hasn’t been the focus of most mods, but there are a couple of mods dedicated to improving the LOD and correcting certain glitches with Skyrim’s rendering.\r<br />\r<br />[color=#ffcc33][size=5]The Skyrim Distance Overhaul LOD Improvement[/size][/color]\r<br />This mod is a massive improvement to the landscape of Skyrim. It makes the world feel denser, by giving many objects a low-polygon mesh to display past the [color=#ffcc33]uGridsToLoad[/color] distance. Rocks, buildings and bridges are added in large quantities, allowing you to see more of Skyrim from afar. Its performance hit depends on your [color=#ffcc33]fBlockLevel1Distance[/color] and [color=#ffcc33]fBlockLevel0Distance[/color], alongside its draw distance. HDD based systems will suffer however, and will likely stutter, especially if Level1 and Level0 are kept at Ultra or above.\r<br />\r<br />I do not recommend any of the optional esp’s at this time, their performance hit can be hefty, SkyFalls handles waterfalls, and the esp’s are full of dirty edits.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/19446/?]http://www.nexusmods.com/skyrim/mods/19446/?[/url]\r<br />\r<br />[color=#ffcc33][size=5]SkyFalls and SkyMills - Animated Distant Waterfalls and WindMills[/size][/color]\r<br />This mod works alongside the Skyrim Distance Overhaul, by adding animated low-detail waterfalls in the distance, replacing the horrid static meshes in vanilla Skyrim. It also adds animated sails for the Windmill’s, improving immersion from afar. It supports all DLC, and works with the SDO as long as you don’t install the optional Skyrim LOD from this mod.\r<br />\r<br />Additionally, it can further improve compatibility if you manually install the compatibility patch for SkyFalls from the SDO downloads.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/40564/?]http://www.nexusmods.com/skyrim/mods/40564/?[/url]\r<br />\r<br />[color=#ffcc33][size=5]High Quality LOD’s[/size][/color]\r<br />The terrain LOD’s in Skyrim are generally lacking in detail. Their meshes are sharp and inaccurate, full of flickering and generally are poor to look at. This mod regenerates them with a high quality tool, to improve their quality significantly. It also includes better textures and normals, which allows better lighting and generally pleasing landscape compared to the vanilla textures.\r<br />\r<br />Install of this mod is generally involved, but not difficult. Download the ‘Meshes – Hi-Res’ through the Nexus Mod Manager or any other tool. [b][i][u]Install this package as is. Install the texture and normal packages manually, follow these instructions carefully.[/b][/i][/u] For the textures and normals, first download the ‘normals’ package. If you have any corresponding landscape texture packs, then download the relevant texture package, otherwise just download the vanilla package.\r<br />\r<br />Once they are downloaded, extract them both into their own folders. Choose the resolution you want (I recommend 256x normals no matter what. Choose 512x textures if you have 2GB VRAM+, otherwise choose 256x textures). Once chosen, open the corresponding folder of each (normals and textures), and compress each of their ‘textures’ folders (the folder) into a .rar or .zip (one for each). Add these .rars or .zips to your Mod Manager software and install.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/4834/?]http://www.nexusmods.com/skyrim/mods/4834/?[/url]\r<br />\r<br />[color=#ffcc33][size=5]Skyrim Particle Patch[/size][/color]\r<br />Many of Skyrim’s meshes have incorrect settings assigned to them, causing missing shadows, bright textures, and more. Many mods fix parts of these meshes, but some are still left out. This package will ensure all meshes are fixed and work correctly with ENBSeries.\r<br />\r<br />These can be installed through NMM or other tools, you just need to add them to it. Download the PARTICLE PATCH ALL-IN-ONE, SUBSURFACE SCATTERING PATCH and ICE SHADER FIX packages. [b][i][u]Don’t overwrite any files[/b][/i][/u], just let it install any that aren’t covered by other mods.\r<br />\r<br />[url=http://enbseries.enbdev.com/forum/viewtopic.php?f=6&t=1499]http://enbseries.enbdev.com/forum/viewtopic.php?f=6&t=1499[/url]\r<br />\r<br />[color=#ffcc33][size=5]High Quality 3D Map[/size][/color]\r<br />A very similar mod to High Quality LOD’s, this regenerates the LOD’s for the map, allowing much finer detail on lakes and mountains, and providing high quality normals for better lighting. Installing this mod is similar to installing High Quality LOD’s, except that the texture package can be skipped and instead you can use the ‘A Quality World Map’ mod, it has an option for High Res textures that support these meshes, along with roads on the map.\r<br />\r<br />Install of this mod is generally involved, but not difficult. Download the ‘Meshes – Hi-Res’ through the Nexus Mod Manager or any other tool. [b][i][u]Install this package as is. Install the texture and normal packages manually, follow these instructions carefully.[/b][/i][/u] For the normals, just download the ‘normals’ package. \r<br />\r<br />Once they are downloaded, extract them both into their own folders. Choose the resolution you want (I recommend 1024x normals for 2GB VRAM and 512x for 1GB VRAM). Once chosen, open the corresponding folder, and compress the ‘textures’ folder (the folder itself) into a .rar or .zip (one for each). Add the .rar or .zip to your Mod Manager software and install.\r<br />\r<br />For the textures, either follow above except for the relevant Texture package and choose 1024x res for 2GB VRAM or 512x for 1GB VRAM, or instead download the ‘A Quality World Map’ mod and choose the Hi-Res textures option in its installer.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/4817/?]http://www.nexusmods.com/skyrim/mods/4817/?[/url]\r<br />\r<br />[color=#ffcc33]A Quality World Map[/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/4929/?]http://www.nexusmods.com/skyrim/mods/4929/?[/url]\r<br />\r<br />\r<br />Thankyou for following this guide, hopefully Skyrim should look better, more consistent and far denser than before. Avoid following things just because its popular, it’s the reason so many harmful tweaks (like the Papyrus Memory Tweak) have spread around for years. Do your own research if you’re not sure.\r<br />\r<br />[color=#ffcc33][size=3]If this guide helped you, please download and endorse to help more people improve Skyrim’s graphics.[/size][/color]",
  "categoryId": "62",
  "version": "1.1.1",
  "author": "FireFreak111",
  "createdUnix": "1405229274",
  "updatedUnix": "1405471798",
  "containsAdultContent": false,
  "uploadedBy": "FireFreak111",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117435",
      "name": "ENB Barebones Preset - with Water improvements v1.01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "148",
      "fileName": "ENB Barebones Preset - with Water improvements v1.1-55921-1-01.rar",
      "uploadedUnix": "1405316163",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/b98ee3c0d47e8e4c2c9e6427e5fd7e7b98eeec0c25c648725b88bac12489499e/analysis/1405316227/",
      "changelogHtml": " Very minor update to the guide: \r<br />Clarified info about having an existing ENB\r<br />Enabled ENB Anisotropic Filtering\r<br />Clarified adding tweaks not there \r<br />Lowered recommendations for 4096x shadows. \r<br />Added the fSkyCellRefFadeDistance tweak. \r<br />Clarified water reflections explanation. \r<br />Grammar improvements <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Barebones%20Preset%20-%20with%20Water%20improvements%20v1.1-55921-1-01.rar?fid=1000117435&ttl=1535840971&ri=8192&rs=8192&setec=b66ebee2f91f9cf29f325afbfa5781ec"
    },
    {
      "fileId": "1000117436",
      "name": "ENB Barebones Preset - without Water improvements v1.01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "148",
      "fileName": "ENB Barebones Preset - without Water improvements v1.01-55921-1-01.rar",
      "uploadedUnix": "1405316221",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/51532a8c80686c439c636ba42ef7abc3d94a79ec317fc4f31647df424a3cedc0/analysis/1405316283/",
      "changelogHtml": " Very minor update to the guide: \r<br />Clarified info about having an existing ENB\r<br />Enabled ENB Anisotropic Filtering\r<br />Clarified adding tweaks not there \r<br />Lowered recommendations for 4096x shadows. \r<br />Added the fSkyCellRefFadeDistance tweak. \r<br />Clarified water reflections explanation. \r<br />Grammar improvements <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Barebones%20Preset%20-%20without%20Water%20improvements%20v1.01-55921-1-01.rar?fid=1000117436&ttl=1535840971&ri=8192&rs=8192&setec=9a9b08240c652f0ea103a8b3cbc247d2"
    },
    {
      "fileId": "1000117437",
      "name": "Skyrim Graphics Guide v1.01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "275",
      "fileName": "Skyrim Graphics Guide v1.01-55921-1-01.zip",
      "uploadedUnix": "1405316325",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/2bb491e1a040e049027c65ebe181286355608a5fbc05c73ebea50107286de74d/analysis/1405316343/",
      "changelogHtml": " Very minor update to the guide: \r<br />Clarified info about having an existing ENB\r<br />Enabled ENB Anisotropic Filtering\r<br />Clarified adding tweaks not there \r<br />Lowered recommendations for 4096x shadows. \r<br />Added the fSkyCellRefFadeDistance tweak. \r<br />Clarified water reflections explanation. \r<br />Grammar improvements <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Graphics%20Guide%20v1.01-55921-1-01.zip?fid=1000117437&ttl=1535840972&ri=8192&rs=8192&setec=7c4cbbcc683710c5ba69d50874cd62ab"
    },
    {
      "fileId": "1000117637",
      "name": "ENB Barebones Preset - Peformance Edition - v1.1",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "161",
      "fileName": "ENB Barebones Preset - Peformance Edition - v1.1-55921-1-1.zip",
      "uploadedUnix": "1405436959",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d818383b389daadcb711ac817d754ee6b3c9291718b20089df9065914cc728cd/analysis/1405437272/",
      "changelogHtml": " Quick improvement focusing on clarifying the performance heavy settings in the guide.\r<br />- Altered recommendations for fBlockLevel1Distance and fBlockLevel0Distance, changed the baseline to Ultra default, instead offering &#39;Distance&#39; and &#39;Performance&#39; options. Rewrote the explanation for it.\r<br />- Clarified possible consequences of altering fSplitDistanceMult.\r<br />- Added performance warning to the &#39;High Resolution&#39; shadow option.\r<br />- Clarified possible performance impact for the Skyrim Distance Overhaul mod.\r<br />- Reshuffled the Pseudo/Useless/Harmful section to be in the same order it appears in the file, and clarified the two 3.0 shader variables. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Barebones%20Preset%20-%20Peformance%20Edition%20-%20v1.1-55921-1-1.zip?fid=1000117637&ttl=1535840973&ri=8192&rs=8192&setec=e74f7ff89e484a5bc86315ec6dd85415"
    },
    {
      "fileId": "1000117638",
      "name": "ENB Barebones Preset - Full Edition - v1.1",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "161",
      "fileName": "ENB Barebones Preset - Full Edition - v1.1-55921-1-1.zip",
      "uploadedUnix": "1405437052",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ff162d2e01447381a9727f0bd3b8c6bc90feefbabce586f87c3e67484f4f9b07/analysis/1405437188/",
      "changelogHtml": " Quick improvement focusing on clarifying the performance heavy settings in the guide.\r<br />- Altered recommendations for fBlockLevel1Distance and fBlockLevel0Distance, changed the baseline to Ultra default, instead offering &#39;Distance&#39; and &#39;Performance&#39; options. Rewrote the explanation for it.\r<br />- Clarified possible consequences of altering fSplitDistanceMult.\r<br />- Added performance warning to the &#39;High Resolution&#39; shadow option.\r<br />- Clarified possible performance impact for the Skyrim Distance Overhaul mod.\r<br />- Reshuffled the Pseudo/Useless/Harmful section to be in the same order it appears in the file, and clarified the two 3.0 shader variables. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENB%20Barebones%20Preset%20-%20Full%20Edition%20-%20v1.1-55921-1-1.zip?fid=1000117638&ttl=1535840973&ri=8192&rs=8192&setec=431c6592fe53d5dca1a9ab8f82aa9ffb"
    },
    {
      "fileId": "1000117747",
      "name": "Skyrim Graphics Guide - v1.1.1",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "277",
      "fileName": "Skyrim Graphics Guide - v1.1.1-55921-1-1-1.zip",
      "uploadedUnix": "1405471712",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/51ea8847a9d52ed23899a0cdaadd316607a24b982339fc6408239ed76eecae37/analysis/1405471748/",
      "changelogHtml": " Quick improvement focusing on clarifying the performance heavy settings in the guide.\r<br />- Altered recommendations for fBlockLevel1Distance and fBlockLevel0Distance, changed the baseline to Ultra default, instead offering &#39;Distance&#39; and &#39;Performance&#39; options. Rewrote the explanation for it.\r<br />- Clarified possible consequences of altering fSplitDistanceMult.\r<br />- Added performance warning to the &#39;High Resolution&#39; shadow option.\r<br />- Clarified possible performance impact for the Skyrim Distance Overhaul mod.\r<br />- Reshuffled the Pseudo/Useless/Harmful section to be in the same order it appears in the file, and clarified the two 3.0 shader variables. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Graphics%20Guide%20-%20v1.1.1-55921-1-1-1.zip?fid=1000117747&ttl=1535840974&ri=8192&rs=8192&setec=1df6a9ca1397db57a1836a5be9554915"
    },
    {
      "fileId": "1000117748",
      "name": "Skyrim Graphics Guide - For Printing v1.1.1",
      "version": "1.1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "274",
      "fileName": "Skyrim Graphics Guide - For Printing v1.1.1-55921-1-1-1.zip",
      "uploadedUnix": "1405471798",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/0ad6a549ac2d703bb0cdd535b643905eaca1f6b97872102cd021d662eddc92b9/analysis/1405471804/",
      "changelogHtml": " Quick improvement focusing on clarifying the performance heavy settings in the guide.\r<br />- Altered recommendations for fBlockLevel1Distance and fBlockLevel0Distance, changed the baseline to Ultra default, instead offering &#39;Distance&#39; and &#39;Performance&#39; options. Rewrote the explanation for it.\r<br />- Clarified possible consequences of altering fSplitDistanceMult.\r<br />- Added performance warning to the &#39;High Resolution&#39; shadow option.\r<br />- Clarified possible performance impact for the Skyrim Distance Overhaul mod.\r<br />- Reshuffled the Pseudo/Useless/Harmful section to be in the same order it appears in the file, and clarified the two 3.0 shader variables. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Graphics%20Guide%20-%20For%20Printing%20v1.1.1-55921-1-1-1.zip?fid=1000117748&ttl=1535840974&ri=8192&rs=8192&setec=7545d9ea7fbab51c5647a5a2fcfeec6d"
    }
  ]
}