{
  "modId": 55933.0,
  "modName": "Fantasy Soundtrack Project for Epic Music Overhaul",
  "summary": "Forcefully and haphazardly shoves music from Fantasy Soundtrack Project into Epic Music Overhaul",
  "descriptionHtml": "[color=#ff7700][size=4][b]NOTE: I&#39;ve been informed that this may no longer work with newer versions of EMO (or whatever it&#39;s called now, i&#39;ve been uninvolved with Skyrim modding for a few years since this). I&#39;ll look into it maybe as i&#39;m thinking about picking Skyrim up again, but don&#39;t hold your breath. if you still see this message in a few months i probably haven&#39;t bothered, sorry.[/b] - [i]2016.11.03[/i][/size][/color]\r<br />\r<br />\r<br />Forcefully and haphazardly shoves music from Fantasy Soundtrack Project into Epic Music Overhaul\r<br />\r<br />Not much else to say at the moment. This is an simple and hastily done reorganization of the music files available in Fantasy Soundtrack Project so that they can be used with Epic Music Overhaul instead. \r<br />\r<br />Most tracks have been put somewhere, usually where they belong (Markarth Town music goes where you&#39;d expect it, etc.). Anything that didn&#39;t have an exact or obvious place to be in EMO was just kinda shoved into somewhere that seemed alright at the time. There wasn&#39;t a lot of thought put into this.\r<br />\r<br />A few tracks from FSP are not currently in here because i wasn&#39;t sure what to do with them. Mostly the &#34;Theme&#34; music for the guilds and some castle music that EMO doesn&#39;t use. I&#39;ll figure out something to do with it all later (maybe I&#39;ll pester Apollo to add categories for &#39;em).\r<br />\r<br />Before anyone asks if i got permissions (or complains that i didn&#39;t) for the music used, according to FSP&#39;s page permissions seem to be implicit so long as credits are given, which you can find on their page (I&#39;ll do credits properly here later).\r<br />\r<br />Currently i do not suggest using this mod seriously at the moment, it&#39;s hardly even started let alone  &#34;finished&#34;. But if you want to test out how the sounds match the environments (since i didn&#39;t test anything yet) or make sure i didn&#39;t royally screw anything up (since i haven&#39;t tested anything yet) feel free to do so. I&#39;ll try and get things done properly soon. Possibly even look at expanding and adding more music (since EMO allows for a lot more tracks than FSP provides).",
  "categoryId": "61",
  "version": "0",
  "author": "Captain Jack Fenderson",
  "createdUnix": "1405269474",
  "updatedUnix": "1405268664",
  "containsAdultContent": false,
  "uploadedBy": "CatmanIX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117311",
      "name": "FSP4EMO",
      "version": "0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "298707",
      "fileName": "FSP4EMO-55933-0.rar",
      "uploadedUnix": "1405268664",
      "modVersion": "0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FSP4EMO-55933-0.rar?fid=1000117311&ttl=1535840993&ri=8192&rs=8192&setec=ab41d00063414ed36092460f15c98492"
    }
  ]
}