{
  "modId": 55953.0,
  "modName": "Lab of Sinderion as a Player Home in Blackreach",
  "summary": "This mod converts Sinderion’s field lab in Blackreach into a usable player home with safe storage and all crafting areas.",
  "descriptionHtml": "About the mod:\r<br />You know how when you stumble out of that elevator into Blackreach and you are all exhausted and overloaded.  One of the first places you come upon in Sinderion’s Field Lab.  Wouldn’t it be nice if you could rest there a bit and unload the tons of Dwemer metal you’ve hauled with you?  Someplace a bit warm and cozy.  Perhaps even a place where you could wash off all that automaton oil, falmer blood and chaurus gook caking your body from all the battles you’ve just fought. Well now you can.  Sinderion’s Field Lab has been cleaned up and made livable again. There you will find all you need for crafting, resting and storage.  There is even a deck with a spa off the back so you can enjoy the beauty of Blackreach while soaking your wounds in the warm comforting waters your own hot tub.  Or if you still have some energy you can use this high vantage point to take pot shots with your bow or spells at the falmer lurking in the lands below.  Download this mod and you can have this wonderful base of operations to thoroughly explore Blackreach at your leisure. \r<br />\r<br />Changes this mod makes:\r<br />This mod changes both the inside and outside of Sinderion’s Field Lab in Blackreach.  Most of the inside has been left the same but containers have been added and the original containers have been replaced with non-respawning containers. These include two barrels, two dwemer chests (one small, one medium), a knapsack and an apothecary satchel. I think that is all there is, but if you find some other container I missed let me know.  The bones of Sinderion are also a container which have not been touched other than the occasional tripping over them.  Therefore do not store anything on them.\r<br />The lab already had enchanting and alchemy tables along with a workbench and many ingredients.  I have added an anvil, a sharpening wheel, a tanning rack and even squeezed  a smelter in next to the bed.  There is also a fire in the fireplace with cooking pot close by and a shrine on the mantle. \r<br />Outside I have added a deck off the back of the building with chairs and a spa along with some idle markers for followers and a couple of keyed gates which do pretty much nothing to keep the falmer away. \r<br />\r<br />I hope this mod is as handy for you as it has been for me.\r<br />\r<br />And don&#39;t forget to check out the images here and at my Understone Dungeon Mod for shots of the escapades of Sigrid and Karyssa.\r<br />\r<br />Here are some other mods of mine:\r<br />[url=http://skyrim.nexusmods.com/mods/55789/]Understone Home and Dungeon[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/48885/]Whiterun Gatehouse Home and Skooma Den[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/38779/] Riverwood Tower and Tunnels [/url]\r<br />[url=http://skyrim.nexusmods.com/mods/40056/] Nilheim as a Player Home [/url]\r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "scon27",
  "createdUnix": "1405359584",
  "updatedUnix": "1405346155",
  "containsAdultContent": true,
  "uploadedBy": "scon27",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117487",
      "name": "Lab of Sinderion as a Player Home",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "63",
      "fileName": "Lab of Sinderion as a Player Home-55953-1-0.rar",
      "uploadedUnix": "1405346155",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3fcf8b9af77e2df1af12c8c41dfb0510ccfe6b753c3d6e3da1a98495d9719192/analysis/1405346185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lab%20of%20Sinderion%20as%20a%20Player%20Home-55953-1-0.rar?fid=1000117487&ttl=1535841039&ri=8192&rs=8192&setec=a33e8920cc27fcc56226ca741f382661"
    }
  ]
}