{
  "modId": 55984.0,
  "modName": "Clearstone",
  "summary": "A unique player home, its a river carved cave that due to erosion was left on pillars standing over the river itself thats been turned into a home by some mage with glass windows melted right in place between all the natural rock formations. ",
  "descriptionHtml": "I could use someone to test the indoor version and tell me what i forgot and if its safe for vampires....... SADLY its been months since i made a vampire friendly indoor version (by request) and nobody bothered to see if it worked for vampires... or at least they didnt give any feedback. makes me wonder why people ask for things if they are not planning on even checking back in again after the first visit\r<br />\r<br />\r<br />\r<br />A unique player home, its a river carved cave that due to erosion was left on pillars standing over the river itself, at some point its been turned into a home by some mage, with glass windows melted right in place between all the natural rock formations. its a fully exterior home with no load screens... unless you decide to try the console code coc aacrystal to get home... then you just follow the in game  instructions from there... and remember to keep your arms and legs inside the portal at all times\r<br />\r<br />you can find it half way between markarth and solitude on the confluence of the river next to brucas leap redoubt check screenshots of map\r<br />\r<br />on the bridge you will find an archery challenge that you may find either impossible or at least very difficult\r<br />this home includes a moon door... sadly it wont kill anything that can swim BUT it functions as a safe and quick way to exit the house.\r<br />\r<br />it has an enchanting table and alchemy table inside the &#34;house&#34; outside on the narrow ledge you will find the workbench, anvil, sharpening stone and tanning rack.\r<br />\r<br />I love to make unique and strange fantasy houses without making them too ridiculous and I think ive balanced this one fairly well, I had some more ideas for this house but I lost interest in skyrim again so its just gonna have to do as it is. this mod has been nearly finished for almost a month and it only got finished today because the game im currently playing (firefall) is down for updating for the day\r<br />\r<br />at some point i will add in a better spot for the horse to stay thats why its still version .9\r<br />\r<br />I hope you enjoy it\r<br />\r<br />requirements\r<br />dragonborn\r<br /> dawnguard \r<br />  hearthfire\r<br />I also suggest you get an HD rock replacer such as http://www.nexusmods.com/skyrim/mods/1760/?  HD Mountains and Rocks New Textures\r<br />you can also get the real shelters compatibility from the link below, thanks [url=http://www.nexusmods.com/skyrim/users/2999419]ChouMahouHenshin[/url] \r<br />http://www.nexusmods.com/skyrim/mods/52612/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D52612%26preview%3D&pUp=1",
  "categoryId": "67",
  "version": "0.9",
  "author": "oldnotweak",
  "createdUnix": "1405385311",
  "updatedUnix": "1406543683",
  "containsAdultContent": false,
  "uploadedBy": "oldnotweak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117551",
      "name": "Clearstone",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "186",
      "fileName": "Clearstone-55984-0-9.rar",
      "uploadedUnix": "1405385304",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/2f655c0d1953b279954df57dc210dedbe365462b878869fe3b798d6d822a31ca/analysis/1405407701/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clearstone-55984-0-9.rar?fid=1000117551&ttl=1535841093&ri=8192&rs=8192&setec=fad6e228221906f5340a38bdb8cdce32"
    },
    {
      "fileId": "1000119660",
      "name": "Clearstone with interior test",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "232",
      "fileName": "Clearstone with interior test-55984-.rar",
      "uploadedUnix": "1406543683",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d139b8d4ceebec1afba5601e01e96bdaaccce0c1c776e3ed6081acbc38943686/analysis/1406543720/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clearstone%20with%20interior%20test-55984-.rar?fid=1000119660&ttl=1535841094&ri=8192&rs=8192&setec=719cdeebe8432ef22e1716929b37175c"
    }
  ]
}