{
  "modId": 55994.0,
  "modName": "Better Hunting and Prices (Updated)",
  "summary": "A mod created to improve Hunting and prices of pelts and hides.",
  "descriptionHtml": "[b][u]Description[/u][/b]:\r<br />\r<br />I created this mod to give more love to Hunters. In a place like Skyrim, hunting is for sure one of the best ways of gathering food as well as all the pelts the Nords require to make their amours and clothes. I felt that hunting wasn&#39;t rewarding enough and so I increased the price of all the pelts and hides along with some other items related to hunting (food and ingredients). The animal loot was also improved. We all need to pay for that house in Solitude and what would we do with all the pelts and hides acquired from all the animals we had to kill to stack our Glass Bow of the Stag Prince? By the way, this mod only requires the main Skyrim game. No DLC required. :P\r<br />\r<br />[b][u]List of contents[/u][/b]:\r<br />\r<br />[b][u][UPDATE][/u][/b]\r<br />- Bug fixes\r<br />- [u][i]Kyne&#39;s Sacred Token[/i][/u] - Bows do 10% more damage insteasd of 15%.\r<br />- [u][i]Ancient Bow of the Hunt[/i][/u] - 25 points of extra damage to Animals instead of 20.\r<br />- [New] [u][i]The Great Bear&#39;s Head[/i][/u]\r<br />- [New] [i]The Great Bear[/i]\r<br />\r<br />This is the list of items that had their value modified:\r<br />- [b]Pelts[/b]:\r<br />Bear Pelt - value increased from 50 to 90 gold;\r<br />Cave Bear Pelt - value increased from 60 to 120 gold;\r<br />Deer Pelt - value increased from 10 to 45 gold;\r<br />Fox Pelt - value increased from 5 to 20 gold;\r<br />Ice Wolf Pelt - value increased from 15 to 55 gold;\r<br />Sabre Cat Pelt - value increased from 25 to 75 gold;\r<br />Sabre Cat Snow Pelt - value increased from 40 to 145 gold;\r<br />Snow Bear Pelt - value increased from 75 to 165 gold;\r<br />Snow Fox Pelt - value increased from 7 to 25 gold;\r<br />Wolf Pelt - value increased from 10 to 35 gold;\r<br />Cow Hide - value increased from 10 to 55 gold;\r<br />Deer Hide - value increased from 10 to 45 gold;\r<br />Deer Hide - value increased from 10 to 45 gold;\r<br />Goat Hide - value increased from 5 to 25 gold;\r<br />Horse Hide - value increased from 15 to 60 gold.\r<br />Chaurus Chitin - value increased from 50 to 60 gold.\r<br />Leather - value increased from 10 to 20 gold;\r<br />Leather Strips - value increased from 3 to 5 gold.\r<br />\r<br />- [b]Bones[/b]:\r<br />Horker Tusk - value increased from 15 to 105 gold;\r<br />Mammoth Tusk - value increased from 150 to 215 gold;\r<br />Troll Skull - value increased from 5 to 115 gold.\r<br />\r<br />- [b]Ingredients[/b]:\r<br />Large Antlers - value increased from 2 to 70 gold;\r<br />Small Antlers - value increased from 2 to 30 gold;\r<br />Hawk Feathers - value increased from 15 to 25 gold;\r<br />Bear Claws - value increased from 2 to 15 gold;\r<br />Sabre Cat Tooth - value increased from 2 to 25 gold.\r<br />Rock Warbler Egg - value increased from 2 to 15 gold;\r<br />Pine Thrush Egg - value increased from 2 to 15 gold;\r<br />Chicken&#39;s Egg - value increased from 2 to 5 gold;\r<br />Charred Skeever Hide - value increased from 1 to 10 gold;\r<br />Chaurus Eggs - value increased from 10 to 30 gold;\r<br />Silverside Perch - value increased from 15 to 20 gold;\r<br />Abecean Longfin - value increased from 15 to 20 gold;\r<br />River Betty - value increased from 15 to 20 gold;\r<br />Cyrodilic Spadetail - value increased from 15 to 20 gold;\r<br />Histcarp - value increased from 6 to 15 gold;\r<br />Mudcrab Chitin - value increased from 2 to 15 gold;\r<br />Skeever Tail - value increased from 2 to 5 gold;\r<br />Slaughterfish Egg - value increased from 3 to 10 gold;\r<br />Slaughterfish Scales - value increased from 3 to 10 gold;\r<br />Spider Egg - value increased from 5 to 10 gold;\r<br />Troll Fat - value increased from 15 to 35 gold.\r<br />\r<br />- [b]Foods[/b]:\r<br />Spiced Beef - value increased from 4 to 15 gold;\r<br />Raw Beef - value increased from 4 to 10 gold;\r<br />Cooked Beef - value increased from 5 to 15 gold;\r<br />Beef Stew - value increased from 8 to 25 gold;\r<br />Charred Skeever Meat - value increased from 4 to 10 gold;\r<br />Leg of Goat - value increased from 3 to 10 gold;\r<br />Leg of Goat Roast - value increased from 4 to 15 gold;\r<br />Horker Meat - value increased from 3 to 35 gold;\r<br />Horker Loaf - value increased from 4 to 40 gold;\r<br />Horker Stew - value increased from 8 to 45 gold;\r<br />Horse Meat - value increased from 3 to 15 gold;\r<br />Horse Haunch - value increased from 4 to 20 gold;\r<br />Mammoth Snout - value increased from 6 to 80 gold;\r<br />Mammoth Steak - value increased from 8 to 85 gold;\r<br />Pheasant Breast - value increased from 3 to 10 gold;\r<br />Pheasant Roast - value increased from 4 to 15 gold;\r<br />Raw Rabbit Leg - value increased from 2 to 5 gold;\r<br />Rabbit Haunch - value increased from 3 to 10 gold;\r<br />Salmon Meat - value increased from 3 to 10 gold;\r<br />Salmon Steak - value increased from 4 to 15 gold;\r<br />Seared Slaughterfish - value increased from 5 to 20 gold;\r<br />Venison - value increased from 4 to 30 gold;\r<br />Venison Chop - value increased from 5 to 35 gold;\r<br />Venison Stew - value increased from 8 to 40 gold.\r<br />\r<br />- [b]Animals[/b]:\r<br />Cows - Now drops 3 Raw Beef and 2 Cow Hide;\r<br />Goat - Now drops 4 Goat Leg;\r<br />Horse - Now drops 2 Horse Meat;\r<br />Bears - Now drops 4 Bear Claws;\r<br />Chaurus - Now drops 2-3 Chaurus Chitin;\r<br />Sabre Cat - Now drops 2 Sabre Cat Eyes and 2 Sabre Cat Tooth;\r<br />Mudcrab - Now drops 2 Mudcrab Chitin;\r<br />Slaughterfish - Now drops 5 Slaughterfish Scales;\r<br />Horkers - Now drops 3 Horker Tusks and 4 Horker Meat;\r<br />Trolls - Now drops 3-5 Troll Fat (3 for normal Trolls and 5 for Frost Trolls) and 1 Troll Skull;\r<br />Deer and Elk - Now drops 2 Venison;\r<br />Rabbit - Now drops 4 Rabbit Leg;\r<br />Mammoth - Now drops 2 Mammoth Tusk.\r<br />\r<br />- [b]Weapons and Gear[/b]:\r<br />[u][i]Angi&#39;s Hunting Bow[/i][/u] - 15 points of extra damage to Animals.\r<br />Acquisition: Complete the unmarked quest &#34;Composure, Speed, and Precision&#34; that is given by Angi, at Angi&#39;s Camp.\r<br />\r<br />[u][i]Kyne&#39;s Sacred Token[/i][/u] - Damage taken from animals is reduced 10%. Bows do 15% more damage. Sneaking is 15% better.\r<br />Acquisition: Complete the quest &#34;Kyne&#39;s Sacred Trials&#34; that is given by given by Froki Whetted-Blade, at Froki&#39;s Shack.\r<br />\r<br />[u][i]Ancient Bow of the Hunt[/i][/u] - 20 points of extra damage to Animals. Chance to paralyze for 3 seconds.\r<br />Acquisition: Inside a cave near Clearspring Tarn.\r<br />\r<br />[u][i]The Great Bear&#39;s Head[/i][/u] - Increases your Stamina by 25 points. Carrying capacity increased by 30 points. One-handed weapons do 15% more damage.\r<br />Acquisition: Kill The Great Bear.\r<br />\r<br />- [b]Characters[/b]:\r<br />[i]The Great Bear[/i] - a really strong Bear found in the forests near Falkreath. \r<br />Drops [u][i]The Great Bear&#39;s Head[/i][/u].\r<br />\r<br />If you have any questions regarding this mod or you would like to make a suggestion, please leave a comment bellow and let me know&#33; Also don&#39;t forget to tell me if you find any issues&#33; Enjoy the mod and don’t overhunt (we also need to preserve the wildlife). (:",
  "categoryId": "83",
  "version": "",
  "author": "Jydro",
  "createdUnix": "1405427276",
  "updatedUnix": "1405715960",
  "containsAdultContent": false,
  "uploadedBy": "Jydro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117604",
      "name": "Better Hunting and Prices (15 July 2014)",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Better Hunting and Prices-55994-.rar",
      "uploadedUnix": "1405427271",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2f46dfd1377b68832076221fb384da272201f81d4045626fa368fc2a3fca40fe/analysis/1405427324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Hunting%20and%20Prices-55994-.rar?fid=1000117604&ttl=1535841104&ri=8192&rs=8192&setec=41ed14ef51cbf9b4382ae82f9069b648"
    },
    {
      "fileId": "1000118142",
      "name": "Better Hunting and Prices (18 July 2014)",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Better Hunting and Prices (15 July 2014)-55994-.rar",
      "uploadedUnix": "1405715960",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4089ae026f5f64675ab9bf0a5720c301197c43941f2a2daaef3cbc092e8a87db/analysis/1405716015/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Hunting%20and%20Prices%20%2815%20July%202014%29-55994-.rar?fid=1000118142&ttl=1535841105&ri=8192&rs=8192&setec=901dcf3a0525d73ed9defdd4bcd0b36e"
    }
  ]
}