{
  "modId": 56009.0,
  "modName": "Deepcrest - A reduced bullcrap player home",
  "summary": "Deepcrest is a Dwemer-themed home with a focus on displaying all of Skyrim&#39;s weapons and armor and storing as much of the Dragonborn&#39;s adventuring gear that has accumulated as possible. It is located on the path to Riverwood from Helgen (great for new characters to get a head start on organization).",
  "descriptionHtml": "Deepcrest is a Dwemer-themed home with a focus on displaying all of Skyrim&#39;s weapons and armor and storing as much of the Dragonborn&#39;s adventuring gear that&#39;s accumulated as possible. It is located on the path to Riverwood from Helgen (great for new characters to get a head start on organization). Its creation came about from the prevelance of player homes in the Workshop having as much crap filling them as the vanilla homes and farmhouses. \r<br />\r<br />Deepcrest, instead of piles of cheese wheels and mead and a few chests, has: \r<br />-51 mannequins, 48 named by armor sets, placed according to armor rating, and separated according to whether they are DLC \r<br />-109 weapon racks \r<br />-88 weapon plaques \r<br />-16 shield plaques \r<br />-36 storage chests \r<br />-dragon priest mask busts (DO NOT enhance the masks, placing them will delete them) \r<br />-dragon claw stands \r<br />-designated chests and utilities for smelting, smithing, cooking, enchanting, and creating potions. \r<br />\r<br />Also available [url=http://steamcommunity.com/sharedfiles/filedetails/?id=281810668]on the Steam Workshop&#33;[/url]\r<br />\r<br />TODO: \r<br />Add wooden mask bust \r<br />Add more mannequins, scrap the idea to separate DLC and remove mannequin names\r<br />Make the workshop a smaller room for ease of use \r<br />Add display cases \r<br />Fix the stupid bug which makes all the chandeliers not cast light properly (might just be me)\r<br />EVENTUALLY redesign to be upgradeable so it scales with the player (maybe)\r<br />\r<br />Possible incompatibilities: \r<br />-Any mod that uses the area of the entrance, obviously \r<br />-A new game IS NOT required, but is recommended for the best use of the space \r<br />-This mod DOES NOT require buying Dawnguard or Dragonborn, nor will anything I ever make. Spending &#036;20-40 to be able to use a mod is just a ridiculous idea. \r<br />\r<br />Please do tell me if you find any issues or if you have any suggestions for changes. I will consider them all.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Insederec Fox",
  "createdUnix": "1405452386",
  "updatedUnix": "1405452373",
  "containsAdultContent": false,
  "uploadedBy": "Insederec",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117699",
      "name": "Deepcrest.zip",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "83",
      "fileName": "Deepcrest.zip-56009-.zip",
      "uploadedUnix": "1405452373",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d50973734e0d8751f9c658aeeac96556c22e32eb52642709af07f9a96383cb70/analysis/1405452423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deepcrest.zip-56009-.zip?fid=1000117699&ttl=1535841127&ri=8192&rs=8192&setec=081eefb4a237d2b9bf723bcef41e3ca6"
    }
  ]
}