{
  "modId": 56025.0,
  "modName": "The Orc for Me - Marriageable Urag gro-Shub",
  "summary": "Makes Urag gro-Shub, the librarian at the College of Winterhold, a candidate for marriage.",
  "descriptionHtml": "Urag gro-Shub is my ideal man (or Orc): grumpy and obsessed with books.\r<br />\r<br />With that in mind, this mod allows the player to marry Urag. Simply equip an amulet of Mara and talk to him, and he can become the librarian of your heart.\r<br />\r<br />Notes:\r<br />-As of this initial version, Urag does not have any courtship requirements.\r<br />-If you are not already Blood-Kin to the Orcs, Urag will name you thus after your first conversation.\r<br />-Urag can live either in one of your homes or at the College after marriage. If you tell him that you will live at his home, he will remain at his post in the Arcanaeum 24/7.\r<br />-I made this mod very quickly and have not yet tested how it affects the College questline if you have not already completed it before marriage. His radiant quest and Shalidor&#39;s Insights quest dialogue options remain after marriage.\r<br />-To be safe, and for role-play purposes, I recommend waiting until after completion of the College questline before proposing to Urag.",
  "categoryId": "33",
  "version": "1.0",
  "author": "Nyessa",
  "createdUnix": "1405498897",
  "updatedUnix": "1405498758",
  "containsAdultContent": false,
  "uploadedBy": "NyessaX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117783",
      "name": "Marriageable Urag gro-Shub",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Marriageable Urag gro-Shub-56025-1-0.zip",
      "uploadedUnix": "1405498758",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60136287a9d8be80ab43268d5b2792745ec2d92d7defeff2758c91fd51efd939/analysis/1405498826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marriageable%20Urag%20gro-Shub-56025-1-0.zip?fid=1000117783&ttl=1535841158&ri=8192&rs=8192&setec=7406f5ee96001f357bf08c942a0fd5df"
    }
  ]
}