{
  "modId": 56047.0,
  "modName": "Master of the Thieves Guild Without Tedious",
  "summary": "A simple bat file that allows you to start the 4 especial quests to become master of the thieves guild without having to do all 20 quests from Vex and Delvin ",
  "descriptionHtml": "A simple bat file that allows you to start the four main quests Delvin and Vex without doing all the mini-quests major cities. When you type &#34;bat Guildmaster&#34; in the console and the four quests to go to start immediately and you can complete them normally. Once it finishes the wrath Breniolf start the dialogue for you to be crowned the master of the guild.\r<br />\r<br />Before you guys had to make five guild quests in each of the major cities except Riften. When you guys did the five quests in a city, Delvin gave a special quests. Now all special quests start automatically without you need to make small and tedious mini-quests \r<br />\r<br />How to use: \r<br />Do not use NMM. Manual instalation only.\r<br />Extract the text file and place the folder where the initiator of the game (do not put in the Data folder, place where is the game executable). Then in-game you will open the console and type &#34;bat GuildMaster&#34; (without quotes) and the quests begin immediately. the mod is only enabled when you enter the bat guildmaster command, you can always keep the file in your folder without any problem.\r<br />\r<br />Important: Never use before finishing the main quest line of the thieves guild, it can break other quests, although I would not be sure, but there is not reason for anyone to use this artifice before completing the main quest of the guild. the mod is only enabled when you enter the  command, you can always keep the file in your folder without any problem.\r<br />\r<br />bugs: \r<br />Being a file text may not function properly for players that use translations of the game, I used in Brazilian Portuguese and the quests were stopping the session complete quests in my journal, but I could complete it normally. If the quests appear as full paper, but will not be complete, to solve this just finish the quest normally. I think you will not have problems using the game in English normally. \r<br />\r<br />So here is the name of the quests in the English language: \r<br />\r<br />Silver Lining (Markarth) \r<br />The Dainty SLOAD (Solitude) \r<br />Imitation Amnesty (Whiterun) \r<br />Summerset Shadows (Windhelm)\r<br />\r<br />Also check out my other mod: \r<br />http://www.nexusmods.com/skyrim/mods/60850/?\r<br />\r<br />Sorry my english, is not my native language, I&#39;m Brazilian.",
  "categoryId": "35",
  "version": "1.0",
  "author": "IvanLeal ",
  "createdUnix": "1405553789",
  "updatedUnix": "1405553758",
  "containsAdultContent": false,
  "uploadedBy": "IVANLEAL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117878",
      "name": "Master of the Guild of thieves without stalling",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Master of the Guild of thieves without stalling-56047-1-0.rar",
      "uploadedUnix": "1405553758",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d55d5eb2fe3e74d95628c002e5a019cbaf99ab25a2e8e14b90b181b4d85553d8/analysis/1405553764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Master%20of%20the%20Guild%20of%20thieves%20without%20stalling-56047-1-0.rar?fid=1000117878&ttl=1535841194&ri=8192&rs=8192&setec=bb65fefcbe5ab051579c1a10bac73203"
    }
  ]
}