{
  "modId": 56055.0,
  "modName": "Odyssey ENB",
  "summary": "Minimalistic, Colorful, and easy-to-run ENB preset.",
  "descriptionHtml": "Hey there fellow modders. I&#39;ve gotten around to getting my personal ENB preset in a presentable state, so I decided I would release it to you all to enjoy. I hope you all like it&#33;\r<br />\r<br />[b][color=red]You must download the official ENB Series v0.254 from the author&#39;s website in order to obtain the enbhost.exe and d3d9.dll files (wrapper version) that are required for this to work.[/b][/color]\r<br />\r<br />\r<br />\r<br />This ENB preset was designed with three important factors in mind:\r<br />\r<br />[b]· [color=purple]Minimalism[/color]\r<br />· [color=purple]Performance[/color]\r<br />· [color=purple]Atmosphere[/b][/color]\r<br />\r<br />\r<br />[b][color=green]Users with very high end rigs may not find this preset appealing since it doesn&#39;t make use of all the features ENB possesses. You&#39;re probably better off with something more taxing and extensive like RealVision or Grim and Somber. Since I&#39;m still not too familiar with properly configuring depth-of-field, I may not upload a &#34;quality&#34; version that enables the more taxing features until I learn the odds and ends of making proper bokeh DoF. Until then, sorry PC Enthusiasts.[/b][/color]\r<br />\r<br />\r<br />[b][u][color=purple]Minimalism & Performance[/b][/u][/color]\r<br />\r<br />Most importantly, it makes use of ENB&#39;s extensive fixes for shadows, parallax (for more realistic water and users who happen to use parallax texture mods), and sky lighting. Effects like depth of field, adaptation, and ambient occlusion are disabled entirely in order to maintain good performance and playability. No distracting depth of field blur, no suttering from unoptimized ambient occlusion calculations, and no jarring screen darkening/lightening from bright lights and such. Other effects like vignette, film grain, lens effects, and letterboxing are also disregarded. Additionally, this ENB was not designed around extensive overhaul mods such as Enhanced Lights and Effects or Climates of Tamriel. It was not my intention to require users to install mods that they weren&#39;t fans of or that their systems could not handle (ELFX can be taxing depending on your hardware). I personally dislike CoT, and ELFX makes interiors (especially dungeons) lag immensely on my system due to my outdated graphics card. The only lighting mod I use is Relighting Skyrim. This only modifies the position of lights within the game world in order to create a more believable atmosphere. It doesn&#39;t change direct/ambient lighting settings in any way. In my opinion, it is essential for anyone who plays a modified Skyrim. It is, however, NOT required to achieve the look of this ENB as represented.\r<br />\r<br />\r<br />[b][u][color=purple]Atmosphere[/b][/u][/color]\r<br />\r<br />Color is the star here; emphasized primarily via palette textures. There is some additional (minor) saturation and contrast applied through ENB&#39;s color correction system to bring things out a little more. You have three choices as far as palettes are concerned (purple-yellow palette is installed by default). Each palette texture focuses on complimentary colors in order to achieve an aesthetically pleasing atmosphere. There are no ugly mixtures of colors here.  You can see comparison images that represent each palette very well to assist you in making a decision. I personally like the pruple-yellow palette. I&#39;ve enabled other effects such as subsurface scattering and volumetric rays since they add a lot to the visuals without being too taxing. There is an option to disable these features if you feel like they are hogging performance. Disabling them will darken the visuals ever so slightly, but it will still look fine (you can compensate by adjusting your in-game brightness). Plus, volumetric rays are just too sexy to NOT use. :D\r<br />\r<br />\r<br />\r<br />[b][u][color=purple]Installation[/b][/u][/color]\r<br />\r<br />[b]1.)[/b] First and foremost, you must oepn your SkyrimPrefs.ini (located in &#34;Documents/My Games/Skyrim&#34;) and change/add the following lines under [Display] so it reads as follows:\r<br />· [color=yellow]bFloatPointRenderTarget=1[/color]\r<br />· [color=yellow]bTreesReceiveShadows=1[/color]\r<br />· [color=yellow]bDrawLandShadows=1[/color]\r<br />· [color=yellow]bShadowsOnGrass=1[/color]\r<br />· [color=yellow]iMultiSample=0[/color] (incompatible when using ENB)\r<br />· [color=yellow]bFXAAEnabled=0 [/color] (FXAA is applied via ENB)\r<br />· [color=yellow]iMaxAnisotropy=0[/color] (x16 AF is applied via ENB)\r<br />\r<br />[b]2.)[/b] Copy all the contents from the folder &#34;Core Files&#34; in to the Skyrim installation directory. If you bought the game retail (Gamestop, Best Buy, etc.), that&#39;s &#34;X:&#92;Program Files&#92;The Elder Scrolls V Skyrim&#92;&#34; (Folder may just be named Skyrim). For Steam users, it will be &#34;X:&#92;Program Files&#92;Steam&#92;Steamapps&#92;Common&#92;Skyrim.&#34;\r<br />\r<br />[b]3.)[/b] Open the folder &#34;Palette Options&#34; and choose the one that sounds most appealing (refer to screen shots for visual comparisons). Rename the palette to &#34;enbpalette.bmp,&#34; and copy it to the same location as the core files. Overwrite when prompted.\r<br />\r<br />[b]4.)[/b] If you decide you do not wish to use Volumetric Rays and Subsurface Scattering for performance reasons, open the folder &#34;Disable Vol. Rays and Sub. Scattering&#34; and copy the enblocal.ini file to the same location as the core files.\r<br />\r<br />[b]5.)[/b] Download ENB version 0.254 from the author&#39;s website. Open the archive and browse to the &#34;WrapperVersion&#34; folder. Extract &#34;d3d9.dll&#34; and &#34;enbhost.exe&#34; to the same location as the core files.\r<br />\r<br />[b]6.)[/b] Load Skyrim, open up the options menu, go to Display, and set your brightness to the following (tweak brightness level as you please):\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/56055-1-1405632953.png[/img]\r<br />\r<br />\r<br />\r<br />[b][u][color=purple]Deinstallation[/b][/u][/color]\r<br />\r<br />Remove all files and folders beginning with &#34;enb&#34; and the file &#34;d3d9.dll&#34; from the Skyrim installation directory. Success.\r<br />\r<br />\r<br />\r<br />[b][u][color=purple]Recommended Mods[/b][/u][/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/17609/?]Relighting Skyrim[/url] (For easy-to-render added realism in interiors)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/47173/?]Ethereal Cosmos[/url] (Just the star map)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/6178/?]Inside the Nebula[/url] (For nebula texture. I use the Forge Nebula)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/51869/?]Ethereal Auroras[/url] (For surreal nights)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/54349/?]Skygazer Moons[/url] (1k for performance, 2k for better systems, 4k if you&#39;re pcmasterrace)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/607/?]Skyrim HD[/url] (Lite for performance, full if your system can handle it)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/49344/?]Vivid Landscapes All-In-One[/url] (For beefy systems)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/41076/?]Realistic Water TWO[/url] + ENB Textures (Required if you want sexy water)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/48938/?]Water Color for ENB and RWT[/url] (Color goes well with this preset, but isn&#39;t necessary for sexy water)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/55238/?]Fairies of Skyrim[/url] (Additional atmosphere, but mod is rumored to corrupt save files after being UNINSTALLED)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/18916/?]Lanterns of Skyrim All-In-One[/url] (DAT ATMOSPHERE&#33;)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/141/?]Skyrim Flora Overhaul[/url] (For beefy systems)\r<br />\r<br />\r<br />\r<br />[b][color=red]*I totally welcome [i]any[/i] user who wants to upload their own images showcasing this preset. I only ask that you refrain from submitting any images containing nudity or super-skimpy outfits. Not everyone is in to that stuff and I want every user that views this submission to feel welcome. Feel absolutely free to include as many pretty female characters as you want. Or even big burly men if that&#39;s your thing.*[/b][/color]",
  "categoryId": "97",
  "version": "1.0",
  "author": "Nubblecakes",
  "createdUnix": "1405571570",
  "updatedUnix": "1405571177",
  "containsAdultContent": false,
  "uploadedBy": "Nubblecakes",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117904",
      "name": "Odyssey ENB 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1281",
      "fileName": "Odyssey ENB 1.0-56055-1-0.rar",
      "uploadedUnix": "1405571177",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9085558e3592279818423737b53d5e768bab681e3714db7d85d91736344c2070/analysis/1405571252/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Odyssey%20ENB%201.0-56055-1-0.rar?fid=1000117904&ttl=1535841211&ri=8192&rs=8192&setec=61e2fc3f3d102ac4200654185ffc99c0"
    }
  ]
}