{
  "modId": 56069.0,
  "modName": "Legend of Zelda Old World Artifacts",
  "summary": "A mod containing some armors and weapons from &#34;The Legend of Zelda&#34;, it has a small unwritten quest you can do by looking in a book found in the Winterhold College Library. This mod is just to let people check out some of the items that will later be added into the &#34;Land of Hyrule&#34; Mod, by Matt13382, and were created for that purpos",
  "descriptionHtml": "Hey guys, this mod has taken me quite some time to make, and really is not even complete. Also, this mod contains items which will all be implicated into &#34;Land of Hyrule&#34; by Matt13382. This mod is just here to get you guys even more hot and ready for it. Also any other Whovians (Doctor Who and Zelda are my two obsessions) who play this will get the cameo, and if all goes well, this will play a MUCH cooler role in the full &#34;Land of Hyrule&#34; mod :)\r<br />\r<br />\r<br />Item details \r<br />\r<br />Master Sword: Aka The Blade of Evil&#39;s Bane, legendary blade forged by the gods in order to end the Great War before recorded Hylian history. Can be upgraded to Master Sword L2 with two master Ore.\r<br />[img]http://static-2.nexusmods.com/15/images/110/2107638-1405605512.jpg[/img]\r<br />\r<br />Master Sword L2: An upgraded Master Sword, boasting heightened damage, and a glowing red blade. Can be uploaded to Master Sword L3 with two more Master Ore.\r<br />[img]http://static-3.nexusmods.com/15/images/110/2107638-1405608734.jpg[/img]\r<br />\r<br />Master Sword L3: The Master Sword with it&#39;s full potential unleashed, with even greater damage than before, and a radiant golden blade, this shining blade of the gods is unmatched in strength by any other weapon in existence.\r<br />[img]http://static-2.nexusmods.com/15/images/110/2107638-1405608917.jpg[/img]\r<br />\r<br />",
  "categoryId": "36",
  "version": "1.0",
  "author": "jewfish",
  "createdUnix": "1405601884",
  "updatedUnix": "1405601884",
  "containsAdultContent": false,
  "uploadedBy": "jewfish",
  "primaryFile": null,
  "files": []
}