{
  "modId": 56065.0,
  "modName": "Nevah&#39;s Rest",
  "summary": "This is the Player Home/Pub Mod Nevah&#39;s Rest. \r<br />It has all the features usually associated with a large player home \r<br />as well as a hidden Chamber under the water fall...",
  "descriptionHtml": "[i][b][color=blue]Hello Again[/color][/b][/i]\r<br />\r<br />Even though I am sorry this mod is so buggy...\r<br />I can not fix any of its problems\r<br />and no I will not update this mod.\r<br />I no longer have time to work on mods as I find creating \r<br />them is more addictive than Meth, Hammer and Crack combined...\r<br />If anybody wants to take up the task of fixing my mod you are quite \r<br />welcome to alter and upload your refashioned version of my mod...\r<br />I will do no more to it refine it.\r<br />I have been eternally disillusioned in my faith of the phrase,\r<br />&#34;If you build it they will come&#34;.\r<br />I actually thought that If I Believed in and trusted my artistic ability,\r<br />then read every Creation Kit tutorial I could find online\r<br />then watched every Creation Kit tutorial on Youtube\r<br />then put in the serious hours of work (At least 180),\r<br />I would be able to see the peoples joy in playing my mod \r<br />by the number of downloads it received. \r<br />How wrong I was. \r<br />Maybe the lack of downloads was caused by the fact \r<br />that Skyrim mods are starting their inevitable decline in popularity.\r<br />Or maybe people just have a different taste in mod styles than me.\r<br />I really do not know why. \r<br />All I know is that I have found a lot of excellent mods on Nexus \r<br />that have very few Downloads and even fewer Endorsements.\r<br />I think if you really take the time to use or seriously explore a mod,\r<br />you will nearly always find some hidden gem.\r<br />Some little piece of the modder left within the mod.\r<br />If people only knew how much work \r<br />some people put in to creating a mod,\r<br />The long nights when a modder just can&#39;t get to sleep \r<br />and if they do they dream of a bigger better and more realistic Skyrim. \r<br />Every time they close their eyes they see a new way to light or orientate that room. \r<br />Or trying to focus enough to come up with that perfect line of dialogue \r<br />that finally hits you at 1am of your third straight day awake.\r<br />Finally falling asleep at the keyboard only to wake up abruptly \r<br />and closing the Creation Kit and saying no to &#34;Do you wish to Save?&#34;\r<br />Then realizing the next day and having to redo a whole nights worth of work.  \r<br />See some people really put in the hard yards when making a mod\r<br />and you can usually tell a fairly decent mod from a poor one by the number, \r<br />artistry and effort the modder has put in to their uploaded images or videos.\r<br />Having said all this I must reiterate,\r<br />I can no longer mod for Skyrim.\r<br />It has absorbed so much of my life already. \r<br />I do not wish to waste any more time on mods \r<br />that do not appeal to nor satisfy anyone but me. \r<br />I only ask that you download and try this mod.  \r<br />Really look around in the mod.\r<br />There&#39;s some personal detail in the mod that may allude you at first,\r<br />but if you keep an eye out you just might see some.\r<br />If you are not satisfied let me know in a post. \r<br />Who knows though? \r<br />You might like it.\r<br />Right?\r<br />If you do find that you do want to keep my mod...\r<br />Then for the love of Bob...\r<br />\r<br />\r<br />This is my new mod &#34;Nevah&#39;s Rest&#34;.\r<br />I made this mod because I was sick of not seeing many \r<br />player home mods near or next to waterfalls.\r<br />I wanted a player home but I wanted it to be a functioning Pub as well.\r<br />It has everything you could want except for an Alchemists lab.\r<br />There is an outdoor Kitchen (With functioning Barman) and sitting area.\r<br />There are two Barmen and an armorer trader. \r<br />I have also hidden another cell under (to the side) of the waterfall.\r<br />Within the cell is a lot of Weapon displays, a few mannequins \r<br />and a sleeping and bathing area...\r<br />\r<br />How to find it...\r<br />\r<br />A courier should deliver a message to you explaining how to get there.\r<br />If he does not appear make a clean save then leave and enter a town\r<br />and he should appear.\r<br />Otherwise just look at the Map image above.\r<br />\r<br />Problems...\r<br />\r<br />There are a few bugs I am trying to sort out. \r<br />Such as the Mercenary NPC&#39;s not letting you buy their services.\r<br />There are also a few Nav Mesh Problems.\r<br />This mod is not adoption friendly.\r<br />\r<br />I hope you enjoy my mod as much as I enjoyed making it. ",
  "categoryId": "68",
  "version": "1.0",
  "author": "NevahNevah",
  "createdUnix": "1405595133",
  "updatedUnix": "1405594694",
  "containsAdultContent": false,
  "uploadedBy": "NevahNevah",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000117948",
      "name": "Nevahs Rest",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17415",
      "fileName": "Nevahs Rest-56065-1-0.zip",
      "uploadedUnix": "1405594694",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6f8f51d64741595de1e6b70fe00f250df2aec50480bda88666d4e3a8f8f2802c/analysis/1405594764/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nevahs%20Rest-56065-1-0.zip?fid=1000117948&ttl=1535841226&ri=8192&rs=8192&setec=e8c33b9474160dc405190c9090597b4a"
    }
  ]
}