{
  "modId": 56075.0,
  "modName": "TTYM - Think To Yourself Messages - Italian",
  "summary": "Traduzione Italiana della mod &#34;TTYM - Think to Yourself Messages&#34; by VorpalBlades\r<br />Italian Translation of &#34;TTYM - Think to Yourself Messages&#34; mod by VorpalBlades",
  "descriptionHtml": "Questa è la traduzione in italiano della mod &#34;TTYM - Think to Yourself Messages&#34; di VorpalBlades.l\r<br />Non richiede la mod originale, poiche essa è composta solo di un file .esp&#33;\r<br />\r<br />This is only the Italian translation of &#34;TTYM - Think to Yourself Messages&#34; mod by VorpalBlades.\r<br />This doesn&#39;t requires original mod because original mod only contain a .esp file&#33;\r<br />\r<br />Vi prego di segnalare eventuali errori o mancanze nei commenti.\r<br />I ask you to report some errors or missed things in comments.\r<br />\r<br />Descrizione della Mod (Tradotta dalla pagina ufficiale):\r<br />\r<br />Ami le mod immersive? Ti piace qualsiasi cosa renda più profonda la tua esperienza nel mondo di Skyrim? Vuoi semplicemente liberarti del fastidioso narratore in terza persona? Se una qualunque di queste ipotesi è fatta per te, Think To Yourself Messages renderà sicuramente migliore la tua esperienza&#33;\r<br />\r<br />Questa mod è basata sulla precedente mod dello stesso autore (con un vecchio nickname, Farm Fresh). L&#39;obiettivo di questa mod è di rendere i messaggi che appaiono durante il gioco più sensati, invece di avere un messaggio come &#34;Non puoi rimuovere dal tuo inventario un oggetto di missione&#34; questa mod renderà il messaggio più personale, come detto dal tuo personaggio &#34;Questo oggetto è troppo importante per essere gettato&#33;&#34;\r<br />\r<br />Questa mod non sostituisce la parola &#34;tu&#34; con la parola &#34;io&#34; all&#39;interno del gioco. I messaggi sono costruiti e studiati per sembrare naturali e profondi.\r<br />\r<br />I messaggi sono stati letti più volte, quindi non contengono errori grammaticali. Provate la mod e vedete se fa per voi&#33;\r<br />\r<br />\r<br />Installazione: Installate la mod da questa pagina, essendo la mod originale composta solo del file .esp è insensato installare prima quella originale e poi la traduzione\r<br />\r<br />--------------\r<br />Progetti\r<br />-------------\r<br />\r<br />A breve arriverà la traduzione del Frostfall Module, molto utile se usate la rinomata mod immersiva &#34;Frostfall&#34; di Chesko\r<br />\r<br />Quando l&#39;autore attuerà aggiornamenti cercherò di tenere aggiornata la traduzione, visto che l&#39;autore ha programmi interessanti, come moduli per altre mod, ad esempio &#34;Better Vampires&#34; di Brehanin o la versione per Khajiit.",
  "categoryId": "78",
  "version": "1.2",
  "author": "VorpalBlades - D4RKL1GHTx",
  "createdUnix": "1405625108",
  "updatedUnix": "1405624998",
  "containsAdultContent": false,
  "uploadedBy": "D4RKL1GHTx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118015",
      "name": "TTYM - Think To Yourself Messages v1-4 - ITA",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "TTYM - Think To Yourself Messages v1-4 - ITA-56075-1-2.rar",
      "uploadedUnix": "1405624998",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4667568ab650bfec0ee140e6cd3685d869b744c0c57a2225ef634026099bdab0/analysis/1405625045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TTYM%20-%20Think%20To%20Yourself%20Messages%20v1-4%20-%20ITA-56075-1-2.rar?fid=1000118015&ttl=1535841236&ri=8192&rs=8192&setec=1a07c339f2d1e82dfdb489df368d2231"
    }
  ]
}