{
  "modId": 56097.0,
  "modName": "Lucien Looks Like Lucien",
  "summary": "A small mod that makes the Spectral Assassin (Lucien Lachance) look like he did in The Elder Scrolls IV: Oblivion.",
  "descriptionHtml": "[size=6][font=Georgia][color=#1155cc]Luci[/color][color=#3c78d8]en Lo[/color][color=#6d9eeb]oks Lik[/color][color=#a4c2f4]e Lucie[/color][color=#c9daf8]n[/color]\r<br />[/font][/size][font=Georgia][size=6][b][i][color=#1e84cc]                     L[/color][color=#6d9eeb]4[/color][/i][/b][/size][/font][size=6][font=Georgia]\r<br />[/font][/size][size=5]\r<br />\r<br />\r<br />[/size][font=Georgia][i][b][size=5][color=#cc0000]HELP WANTED&#33; [/color]\r<br />\r<br />[/size][/b][/i][/font][font=Georgia]WIP: I need to retexture his robes; I used the Mythic Dawn Robes and have renamed them, but they are still red and yellow (the red with his ghostly blue make him look purple-ish). I will also add Black Hand Robes to the Dawnstar Sanctuary after I learn how to retexture the models. (I would gladly accept help from anyone who knows how to edit .dds files. I mainly need to be recommended an application with which to do it.) He looks okay as is, but he isn&#39;t perfect.\r<br /> [b][color=#ff0000]I DON&#39;T PLAN TO UPLOAD THE FILE TO NEXUS UNTIL IT IS COMPLETE.[/color] [/b]You can get the bare minimum version from Steam [url=http://www.steamcommunity.com/sharedfiles/filedetails/?id=262254414]here[/url][/font][font=Georgia][i].[/i][/font][font=Georgia][i][b][size=5]\r<br />\r<br />What is this mod? \r<br />\r<br />\r<br />\r<br />Reason for this mod\r<br />\r<br />\r<br />\r<br /> Future of this mod (?)[/size]\r<br />[/b][/i][/font][font=Georgia]\r<br />This is a mod that makes the Spectral Assassin look more like he did in Oblivion. [/font]\r<br />\r<br />[font=Georgia]I disliked the vanilla depiction of Lucien. His outfit made him look less like an assassin and more like a disco dancer. (&#34;Yes Cicero, there is dancing in the Void...&#34;) [/font]\r<br />\r<br />[font=Georgia]If you are a Lucien Lachance advocate you will appreciate this mod&#33; [/font]\r<br />\r<br />[font=Georgia]I&#39;d looked all over the internet and no one else had created a mod that gave Lucien any justice; as a Lucien Lachance fan, this motivated me to create one for myself. I&#39;ve only ever tinkered with the Creation/Construction Kits for Elder Scrolls games before, so I still need some aid in certain aspects... [/font]\r<br />\r<br />[font=Georgia]UPDATE 1.1: Created the Black Hand Robes, Black Hand Gloves, and Black Hand Shoes and placed them in the Dawnstar Sanctuary on a table parallel to the one the Jester Clothes are located on (for the sake of symmetry).[/font]",
  "categoryId": "78",
  "version": "1.1",
  "author": "MurderMagic8",
  "createdUnix": "1405664912",
  "updatedUnix": "1405664912",
  "containsAdultContent": false,
  "uploadedBy": "MurderMagic8",
  "primaryFile": null,
  "files": []
}