{
  "modId": 56093.0,
  "modName": "Realistic Body System remade",
  "summary": "Realistic Body System (RBS) let female NPCs be unique. The main feature is that female NPC will get nearly unlimited different bodyshapes and clothes/armors fitting to them. But it offers a lot more possibilites, configurable with a SkyProc Programm i developed in the last 2 years.",
  "descriptionHtml": "[COLOR=#0070C0][SIZE=6][B]Realistic Body System (RBS)[/B][/SIZE][/COLOR]\r<br />\r<br />\r<br />RBS let female NPCs be unique. The main feature is that female NPC will get nearly unlimited different bodyshapes and clothes/armors fitting to them. But it offers a lot more possibilities, configurable with a SkyProc program, i developed in the last 2 years.\r<br />\r<br />Video of Girlies in the “Winking Skeever”\r<br />[youtube]jKBoYQhdvyk[/youtube]\r<br />\r<br />Installation Video:\r<br />[youtube]hR_18foJpsk[/youtube]\r<br />\r<br />other Features are:\r<br />* No scripts will destroy performance (its free of scripts)\r<br />* not only vanilla NPCs will be using RBS, every female NPC added by other mods, too\r<br />* every female NPC can have its own animations (default animations are walking/running/sitting/idle animations)\r<br />* every female NPC movement speed is recalculated by its weight and default outfit\r<br />* every female NPCs scale is recalculated\r<br />* weight of NPCs is calculated by what they are doing (for example Shop Owners /Cooks are fatter) \r<br />* if you have apachii hair installed female NPCs can get new hairstyles (Face maybe not matching body tint) if you check hair deployment in RBS menu. If you don´t want hairstyles distributed to npcs, they won´t suffer from &#34;grey head bug&#34;.\r<br />* NPCs will wear normal clothes, or skimpy ones if you want.\r<br />* Argonian female NPCs will have a very slim bodyshape.\r<br />* many things i forgot to mention *g*\r<br />\r<br />Maybe you may ask, why did you spent so much time to create RBS? My load order contains 400+ mods. Skyrim got beautiful and more realistic with every mod i installed. But NPCs were looking all the same, they never got enough love. To make Skyrim even more realistic i decided to give them the love they deserve. Besides that i also made a Body System for Oblivion named VORB. VORB wasn´t perfect and hard to use. So i thought for Skyrim it must be better and easier to use for &#34;Nongeeks&#34;.\r<br />\r<br />I tried to make it as simple as it is possible for u NPC lovers. So how is possible?\r<br />\r<br />RBS itself is a Java program using the SkyProc library created by Justin Swanson (thank you for that and also for the help you gave me while starting using your library&#33;) Because Java 1.8 gave new nifty Functions that made it easier to code some things i updated RBS source code using 1.8 functions. So Java 8 is a must have (be sure you have it installed, before using RBS). By the way i decided to make the code public as open source on github. Maybe someone would jump in and lay a hand in developing more features?\r<br />\r<br />Also RBS needs some tools, made by Skyrim coding gods. RBS has included those, because it would be very complicated for you mod users to put all needed resources together and you may get lost in doing so. I have tried to contact authors of those tools, but i haven´t got a response from all yet. Okay what tools are included in RBS?\r<br />\r<br />Bodyslide 2 - RBS won´t be possible without it. Thanks Caliente and Ousnius&#33; Your tool is so awesome&#33;\r<br />hkxcmd - is makes it possible that NPCs can use different animations, thanks to TheFigment\r<br />RBSconvert – it´s my own program calculating bodyshapes and controlling bodyslide2 to create them.\r<br />\r<br />RBS needs resources to be able to do what it is meant for. I tried to code RBS using those resources so that it only need to be downloaded and be put into the correct folder. But that was not possible, because folder structure of mods needed by RBS are made to exchange vanilla files. I hope that you great modders understand that it would have made RBS to hard to use for others than me if they have to extract your mods and copy parts out of it to the folder structure RBS uses. If only one file would is missed, RBS would stop working and users will be frustrated.\r<br />\r<br />What resources are included?\r<br />\r<br />Bodyslide files made by ChronoTrigger77, Caliente and wavion2. I can´t thank you enough for making such fantastic outfits&#33;\r<br />Animations files by xp32, gekkou1992 and dualsun, great stuff you made&#33; Maybe RBS will help focus users on how important better and different animations are.\r<br />\r<br />If one of you modders don´t want your files be packed up in RBS, please drop a pm. Please have in mind, that it would make things difficult for users. One reason, why RBS gone open source is to show you my respect and that i can show that i don´t &#34;adorn myself with borrowed plumes&#34;.\r<br />\r<br />\r<br />I would like to explain what you have to do (not much, because most things that could be automated is done by my programs)\r<br />\r<br />Installation with Mod Organizer:\r<br />\r<br />- Download RBS\r<br />- Install it in Mod Organizer\r<br />- Activate it in Mod Organizer\r<br />- go to you directory were Mod organizer saves all mods (usually it is “Mod Organizer/Mods”) Go into “Realistic Body System remade” folder. Then open “RBSGenerator/tools/autoit”. Here BodyCreator.exe is found, run it as administrator&#33;\r<br />- you will be asked how many Bodytypes you want to generate. Enter something between 3 and x. Be carefull with to many bodytypes, because it Skyrims memory usage may rise.\r<br />I tried 100 bodytypes and it worked fine, but default is 30. It starts to rearrange the file structure. After that is done you will be asked if you want to generate new Bodyshapes, click yes. Bodyslide will started automatically and Files that are used by RBS will be created.\r<br />Wait until BodyCreator is finished.\r<br />\r<br />Get a cup of coffee and chill, because this could run for a long time, depending on your pc speed and how many bodyshapes you would like to create.\r<br />\r<br />After Bodyslide is closed automatically you have successfully generated ten thousands of new meshes.\r<br />\r<br />Be sure that you have enough disk space free, 30 RBS bodyshapes are about 15 gb big.\r<br />\r<br />BodyCreator only need to be run the first time you run RBS or if you add a package or want new bodyshapes generated because you thing the previous suck.\r<br />\r<br />Now its time to start RBS itself.\r<br />To do so you have to be sure java8 32bit is installed on your pc. You can get it here: http://www.oracle.com/technetwork/java/javase/downloads/jre8-downloads-2133155.html\r<br />\r<br />You can add a shortcut to the RBS.jar or run it directly out of “SkyProc/RBS” folder.\r<br />Have a look at the tutorial video if you want to know how to add a shortcut.\r<br />\r<br />Start RBS.jar. Now there should open the configuration menu of RBS. Choose the configuration you like, use the checkboxes.\r<br />\r<br />If you are ready, click on “Patch” \r<br />\r<br />RBS asks about where you BOSS file is located, it is needed to be sure every mod is in its correct place, before calculating the RBS.esp.\r<br />You also can point to LOOT -  works like a charm.\r<br />\r<br />Now RBS is creating the RBS.esp file and put it into your data folder. After RBS is ready it closes itself. Activate RBS.esp if it is not yet done by Mod Organizer. If it is not active, RBS is not running, everything will be the same as before.\r<br />\r<br />\r<br />Further Information:\r<br />\r<br />Source Code of RBS is found here: https://github.com/VadersApp/RealisticBodySystem If you want to have a look into it, but i warn you code could be ugly ;) Most parts a rewritten but there are still old functions in it.\r<br />\r<br />RBS is scriptfree, but that could be changed in future. Depending on how many mods you have installed it uses more memory, i highly recommend using ENB/ENBBoost and memory patch function of SKSE. If memory usage is too high and you don´t use those tools RBS could crash more often.\r<br />\r<br />Be sure that you run BodyCreator.exe as administrator&#33;\r<br />",
  "categoryId": "33",
  "version": "1.11",
  "author": "VadersApp",
  "createdUnix": "1405657150",
  "updatedUnix": "1406177743",
  "containsAdultContent": false,
  "uploadedBy": "VadersApp",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118075",
      "name": "RealisticBodySystem",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "208878",
      "fileName": "RealisticBodySystem-56093-1-0.7z",
      "uploadedUnix": "1405667239",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7a4f86bf45270cd9658055f1a0e144af0397eadc621fd5fffa9b8b1ab43d3a63/analysis/1408387772/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RealisticBodySystem-56093-1-0.7z?fid=1000118075&ttl=1535841264&ri=8192&rs=8192&setec=c004b348f49db4f682ca61ae69c563a9"
    },
    {
      "fileId": "1000118851",
      "name": "RealisticBodySystem",
      "version": "1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "205985",
      "fileName": "RealisticBodySystem-56093-1-10.7z",
      "uploadedUnix": "1406097606",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/ed329af8daedae58e858867605bfb25d1c33fc8a5ddcebbb21f825e05ccc3eaa/analysis/1408385864/",
      "changelogHtml": " * BodyCreator will ask you how many bodytypes you want to generate (default 30) if you want you can create less and more (but be carefull, memory usage will rise).\r<br />* BodyCreator has a new GUI which shows the progress.\r<br />* Added detection if filter data in bodyslide wasn´t correctly entered. (this was one of the reasons BodyCreator failed to work for some of you)\r<br />* hkxcmd is copied to your skyrim folder automatically\r<br />* deleted wrongly added defaultmale.hkx\r<br />* added more progress info\r<br />* several other bugfixes <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RealisticBodySystem-56093-1-10.7z?fid=1000118851&ttl=1535841264&ri=8192&rs=8192&setec=02e01fb8af3cdef10175b4596cac63b4"
    },
    {
      "fileId": "1000118978",
      "name": "RealisticBodySystem",
      "version": "1.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "198184",
      "fileName": "RealisticBodySystem-56093-1-11.7z",
      "uploadedUnix": "1406177743",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/2001566c49f8834f13bbb421dda7d4142ffb7354f7efb2988f71a6ccb8a271fe/analysis/1406177807/",
      "changelogHtml": " fixed hkxcmd.exe not found bug <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RealisticBodySystem-56093-1-11.7z?fid=1000118978&ttl=1535841265&ri=8192&rs=8192&setec=630cf757f49ef2c87557b8302fbe994f"
    }
  ]
}