{
  "modId": 56102.0,
  "modName": "Rochester Overhaul",
  "summary": "WIP overhaul of breti&#39;s Rochester Mod Resource aimed to bring realism and completion to his existing efforts.",
  "descriptionHtml": "[b][u]This mod is very much a Work In Progress.[/u][/b]\r<br />\r<br />[i]The aim of this mod is to overhaul breti&#39;s work and bring Rochester to life by fleshing out the existing content with clutter, buildings, revised functions, interiors, dialogue, quests, AI and over all bring a sense of real life to a great mod that currently feels a little bare-bones.[/i] \r<br />\r<br />----\r<br />\r<br />WIP Progress (26/8/14):\r<br />\r<br />This is a comprehensive list of everything that you will find in the newest version of the file.\r<br />\r<br />- Rochester Castle bailey is now fully navmeshed. The walls can be walked by guards on patrol.\r<br />- All bailey buildings now have interior cells. New additions are; Castle Forebuilding (featuring entrance hall, state room where the Baron and his stewards receive requests from the townspeople, and where townspeople come to pay their taxes, and door to chapel); Castle Chapel (located above the state room); Feasting Hall; Servants&#39; Quarters for Feasting Hall.\r<br />- Minor tweaks to blacksmith and kitchen interiors.\r<br />- Finished Town Guard Recruitment interior. This will be the starting point for a planned &#34;Join the Guard&#34; questline. \r<br />- Navmesh tweaks near Town Guard Barracks.\r<br />- Navmeshed round tower near Town Barracks. The guard posted on top also has an altered package so that he descends the stairs and sleeps in the barracks. \r<br />- Got rid of the old wooden stockades and replaced them with stone steps, which are easier for AI and the player to navigate and also look a lot more accurate to the real Rochester castle.\r<br />- Castle Barracks guards now at full complement of 6. They will go out each day and patrol their roof or wall. Two guards actually swap their wall halfway through the day for added variety. Another spends half his day in the gatehouse and the afternoon walking the walls. \r<br />- Begun to replace &#34;CredoTemplar&#34; guards with ones in the Town Guard attire, so that fully fledged knights of the realm aren&#39;t simply guarding a gate. This will make knights and their armour more of a force to be reckoned with and awed at.\r<br />- Fixed Gertrude&#39;s (the castle cook) merchant package so that she will now sell ingredients and food to the player.\r<br />- New NPCs&#33; New additions are; Thomas, a young but spirited stable boy; Matilda Fairvoice, a bard who plays in the Feasting Hall (need to add sleep and eat package in future, once I find her a place to use as a home); Stephen the Simple, a Court Jester who dances and says somewhat sinister asides in the Feasting Hall; Harold, a rather aloof servant who sweeps both levels of the Feasting Hall; Shepherd Book, a kindly priest who spends his day and night paying in the Castle Chapel (sleeps and eat packages TBA); Steward, a... well, steward, who occupies the lower level of the Castle Forebuilding and receives the Baron&#39;s guests; Sir Adama, a One-Handed trainer who works out in the Town Guard Recruitment building and sleeps in the Town Barracks, and Town Guard Recruitment Officer, who lives in the building and receives new recruits during the day.\r<br />\r<br />[i]Phew&#33; \r<br />\r<br />This was quite a large update, on top of me getting into my university and then having a mountain of paperwork to complete and a ton of things to organise before I go in September. But rest assured, this mod is here to stay, and will be frequently updated :)\r<br />\r<br />As always, if you are interested in offering any help or expertise, I would greatly appreciate it, even if it&#39;s just ideas for future updates&#33; Please don&#39;t hesitate to leave a comment or send me a PM, I love reading your thoughts&#33; :)[/i]\r<br />----\r<br />\r<br />Plans for 0.06: \r<br />\r<br />- Full eat/work/sleep packages for all NPCs added in this overhaul.\r<br />- More castle interior cells.\r<br />- Begin work on Player Home next to the tavern in the town.\r<br />- More guard patrols.",
  "categoryId": "89",
  "version": "0.05",
  "author": "TwiggyShip ",
  "createdUnix": "1405690943",
  "updatedUnix": "1409091101",
  "containsAdultContent": false,
  "uploadedBy": "TwiggyShip",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118090",
      "name": "Rochester Overhaul",
      "version": "0.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "219",
      "fileName": "Rochester Overhaul-56102-0-01.zip",
      "uploadedUnix": "1405690939",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/4b98e377f74e616269b3b8bdc62367a1f225b7c23954ecf47a62397464f8d33d/analysis/1405691104/",
      "changelogHtml": " - Castle flags now St George\r<br />- Castle now has accurate roof\r<br />- Castle battlements now sport doors and clutter/furniture\r<br />- Stable now has appropriate clutter ie hay, troughs, buckets. \r<br />- Added 1 horse to the stable\r<br />- Added two stockades/ramparts that enable access to the castle walls. \r<br />- Added clutter/furniture to stockades\r<br />- Overhauled entire bailey with clutter ie boxes, barrels, hay, wagons, carts, chests etc.\r<br />- Added new blacksmith building in the previously open yard. \r<br />- Blacksmith yard has full forge capabilities.\r<br />- Added plenty of containers to the store barn\r<br />- Added kitchen building\r<br />- Added containers to the two shacks\r<br />- Added portcullis to castle bailey gatehouse and castle forebuilding, which work with levers\r<br />- Added torches to building exteriors\r<br />- Added full interior to bailey gatehouse and forebuilding gatehouse\r<br />- Added clutter to barracks on far edge of castle wall\r<br />- Added access to the roof level of bailey gatehouse and forebuilding\r<br />- Moved the band stage to the centre of Rochester town, moved market stalls around a bit\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rochester%20Overhaul-56102-0-01.zip?fid=1000118090&ttl=1535841285&ri=8192&rs=8192&setec=357f61dde35bf0c0dbb32784a2972d7a"
    },
    {
      "fileId": "1000121295",
      "name": "Rochester Overhaul",
      "version": "0.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "227",
      "fileName": "Rochester Overhaul-56102-0-02.rar",
      "uploadedUnix": "1407665773",
      "modVersion": "0.02",
      "virusScanUrl": "https://www.virustotal.com/file/98b1911b385f173f46781c1253bdb9ce9990458337e19679407035ea279e0537/analysis/1408176706/",
      "changelogHtml": " - Initial NPC roll-out; Castle Smith and 6 Town Guards. Fully packaged.\r<br />- Full interior for the Castle Smithy.\r<br />- Full interior for the Town Guard barracks.\r<br />- WIP interior for the Town Guard Recruitment building\r<br />- Improved navmeshing in bailey gate area \r<br />- Improved navmeshing in barracks courtyard \r<br />- Additional clutter (sacks, barrels, crates etc) \r<br />- Improved exterior and interior lighting in the barracks courtyard.\r<br />- Minor touch-ups here and there, item placement etc. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rochester%20Overhaul-56102-0-02.rar?fid=1000121295&ttl=1535841285&ri=8192&rs=8192&setec=ab78284af619fb339cbaf01d6904c95b"
    },
    {
      "fileId": "1000121540",
      "name": "Rochester Overhaul 0.03",
      "version": "0.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "295",
      "fileName": "Rochester Overhaul-56102-0-03.rar",
      "uploadedUnix": "1407797725",
      "modVersion": "0.03",
      "virusScanUrl": "https://www.virustotal.com/file/c89249d263d2afb20d73995e3c2a691465b09f9372eb15d81e4c67200995fbc0/analysis/1407797822/",
      "changelogHtml": " - Hotfix for CK bug in which the bailey navmesh would appear on top of the one that appears with the default Rochester mod. Now fixed to only include the one for this overhaul, and also expanded o include the entire bailey area and both stockades.\r<br />- Hotfix for missing navmesh on bandstand in centre of the town from which the dancers fell through the stage. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rochester%20Overhaul-56102-0-03.rar?fid=1000121540&ttl=1535841286&ri=8192&rs=8192&setec=67f51fd219a3a208b2d382242eefc83d"
    },
    {
      "fileId": "1000122352",
      "name": "Rochester Overhaul Version 0.04",
      "version": "0.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "221",
      "fileName": "Rochester Overhaul Version 0.04-56102-0-04.rar",
      "uploadedUnix": "1408212526",
      "modVersion": "0.04",
      "virusScanUrl": "https://www.virustotal.com/file/11eb2a1e316a73b5446b6798be5ccf426248868d0142dd6c68c8ee8ed2cfbb16/analysis/1408212553/",
      "changelogHtml": " - Added interior cells for Castle Barracks (NW corner of bailey, by the stables), Castle Kitchens and Servants Quarters (door located under the kitchen stairs)\r<br />- Added full AI packages for all guards - the guards by Town Guard barracks go to sleep in there (planned to include the one on the round tower when I get my head around navmeshing that), whereas the ones on top of the Castle barracks, gatehouse and in the gatehouse go into the Castle Barracks to sleep. The guard in the portcullis room still sleeps there. \r<br />- Added one more guard above the Castle Barracks.\r<br />- Added a chef (Cook Gertrude) to the Kitchens. She wakes at 6, has breakfast till 8, works in the kitchen till 8pm, has dinner and then sleeps in the Servants Quarters.\r<br />- Added a servant (Ranald) to the Kitchens. Follows the same pattern as Gertrude but sweeps instead of cooks.\r<br />- Polished up exterior around the kitchens, added more plants to the area. \r<br />- Minor cell name corrections. \r<br />- Expanded bailey navmeshing (along the walls). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rochester%20Overhaul%20Version%200.04-56102-0-04.rar?fid=1000122352&ttl=1535841286&ri=8192&rs=8192&setec=8b2697a73cb8878a68c219a2ec4eb1c3"
    },
    {
      "fileId": "1000124077",
      "name": "Rochester Overhaul",
      "version": "0.05",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "303",
      "fileName": "Rochester Overhaul-56102-0-05.rar",
      "uploadedUnix": "1409091101",
      "modVersion": "0.05",
      "virusScanUrl": "https://www.virustotal.com/file/1467e0cccce236c9a232e644e3adff557b3c4037c9055441551531b8bcc3cd74/analysis/1409091183/",
      "changelogHtml": " - Rochester Castle bailey is now fully navmeshed. The walls can be walked by guards on patrol.\r<br />- All bailey buildings now have interior cells. New additions are; Castle Forebuilding (featuring entrance hall, state room where the Baron and his stewards receive requests from the townspeople, and where townspeople come to pay their taxes, and door to chapel); Castle Chapel (located above the state room); Feasting Hall; Servants&#39; Quarters for Feasting Hall.\r<br />- Minor tweaks to blacksmith and kitchen interiors.\r<br />- Finished Town Guard Recruitment interior. This will be the starting point for a planned &#34;Join the Guard&#34; questline. \r<br />- Navmesh tweaks near Town Guard Barracks.\r<br />- Navmeshed round tower near Town Barracks. The guard posted on top also has an altered package so that he descends the stairs and sleeps in the barracks. \r<br />- Got rid of the old wooden stockades and replaced them with stone steps, which are easier for AI and the player to navigate and also look a lot more accurate to the real Rochester castle.\r<br />- Castle Barracks guards now at full complement of 6. They will go out each day and patrol their roof or wall. Two guards actually swap their wall halfway through the day for added variety. Another spends half his day in the gatehouse and the afternoon walking the walls. \r<br />- Begun to replace &#34;CredoTemplar&#34; guards with ones in the Town Guard attire, so that fully fledged knights of the realm aren&#39;t simply guarding a gate. This will make knights and their armour more of a force to be reckoned with and awed at.\r<br />- Fixed Gertrude&#39;s (the castle cook) merchant package so that she will now sell ingredients and food to the player.\r<br />- New NPCs&#33; New additions are; Thomas, a young but spirited stable boy; Matilda Fairvoice, a bard who plays in the Feasting Hall (need to add sleep and eat package in future, once I find her a place to use as a home); Stephen the Simple, a Court Jester who dances and says somewhat sinister asides in the Feasting Hall; Harold, a rather aloof servant who sweeps both levels of the Feasting Hall; Shepherd Book, a kindly priest who spends his day and night paying in the Castle Chapel (sleeps and eat packages TBA); Steward, a... well, steward, who occupies the lower level of the Castle Forebuilding and receives the Baron&#39;s guests; Sir Adama, a One-Handed trainer who works out in the Town Guard Recruitment building and sleeps in the Town Barracks, and Town Guard Recruitment Officer, who lives in the building and receives new recruits during the day. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rochester%20Overhaul-56102-0-05.rar?fid=1000124077&ttl=1535841287&ri=8192&rs=8192&setec=902954fd4a587599ab6cc4b3d232306d"
    }
  ]
}