{
  "modId": 56163.0,
  "modName": "Loot and Degradation -- Spanish",
  "summary": "Esta es la traducción de este fantástico mod creado por isoku que permite mejorar la inmersión sobre saqueos y temple de equipamiento tanto para el jugador como para los seguidores.",
  "descriptionHtml": "Esta es la traducción de este fantástico mod creado por isoku que permite mejorar la inmersión sobre saqueos y temple de equipamiento tanto para el jugador como para los seguidores.\n<br />\n<br />[center][img]http://centostudios.com/Compatible.png[/img][/center]\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/55496/?]CORRECCIONES Y MEJORAS DE TEXTOS Y VOCES[/url][/center]\n<br />\n<br />Los herreros y los flecheros podrán templar nuestras armas y armaduras por un coste en oro, pero el grado de maestría dependerá de su experiencia en el \n<br />trabajo, la cual ira evolucionando con el paso del tiempo. Además, podremos establecer la opción de que el equipamiento se pueda degradar hasta el punto de romperse y que tengamos que volver a forjarlo, con el añadido de podremos comprar kits que nos permitirán reparar nuestro equipamiento mientras estemos lejos de asentamientos en los que poder hacerlo.\n<br />\n<br />Por último, se ha añadido la posibilidad de que los seguidores u otros personajes puedan saquear a los enemigos caídos en combate.\n<br />\n<br />Para más información, acerca de los requisitos necesarios y características, puedes visitar la página del mod original y ya de paso, reventar el botón de endorse para animar a isoku a que siga creando complementos tan buenos y de calidad como este. ¿¡A qué esperas!? ¡Destroza ese botón! y si de paso lo haces con el mío, pues eso ya sería la leche.\n<br />\n<br />[color=#93c47d]¿Por qué usar mis traducciones?\n<br />\n<br />- Porque no están hechas a base de copiar los textos en traductores online.\n<br />- Porque se usa el sentido común en todo momento para redactar palabras, frases y oraciones.\n<br />- Porque se ajustan fielmente a los conceptos del juego y en general, al mundo de Elder Scroll.\n<br />- Porque se redactan siguiendo nuestras reglas gramaticales y se evita crear frases robotizadas.\n<br />- Porque son actualizadas siempre que sea necesario para corregir errores y establecer mejoras.\n<br />- Porque se ajustan al proyecto \"Correcciones y mejoras de textos y voces\" para lograr una mayor inmersión.\n<br />- Porque todos los textos de configuración y jugabilidad se traducen siempre al 100%.\n<br />- Porque se realizan intencionadamente para que parezcan parte del propio juego y se enlazan conceptos similares con otras traducciones.\n<br />\n<br />Fe de erratas:\n<br />\n<br />Soy consciente que a veces puedo cometer algún error, por lo que si en tus partidas detectas alguna falta de ortografía, algún espacio de más, algo que te suene a chino o quisieras hacerme alguna sugerencia respecto a alguna frase traducida, no dudes en comentármelo. ¡Tu ayuda será siempre bien recibida!\n<br />[/color]\n<br />¡Que lo disfrutes!\n<br />\n<br />[color=#f6b26b]¡Ah! y no te olvides de estas[/color] [url=http://www.nexusmods.com/skyrim/users/3198127/?tb=mods&amp;pUp=1]otras traducciones[/url][color=#f6b26b].[/color]\n<br />\n<br />[center][img]http://centostudios.com/Imagen.png[/img][/center]",
  "categoryId": "24",
  "version": "1.31",
  "author": "supercento",
  "createdUnix": "1405864547",
  "updatedUnix": "1459190054",
  "containsAdultContent": false,
  "uploadedBy": "supercento",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000200913",
      "name": "Loot and Degradation",
      "version": "1.31",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "Loot and Degradation-56163-1-31.rar",
      "uploadedUnix": "1459190054",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/331bfff1160a356eeaa0f6ae9c70e3fd36e019071afb9ebbe2b7f7332c17fc24/analysis/1459190114/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loot%20and%20Degradation-56163-1-31.rar?fid=1000200913&ttl=1535841381&ri=8192&rs=8192&setec=87a4f39f9f12e8b7db15e762a5f818d7"
    }
  ]
}