{
  "modId": 56187.0,
  "modName": "Thieves Guild and Nightingales - Upgrades and Alterations",
  "summary": "Per the advice of my friend Telessah, I added this here. My take on what the Nightingale armor and weapons SHOULD have been.",
  "descriptionHtml": "I have played through this questline about a million times, and a few things always stuck in my craw. Why are the Nightingale Armor Enchants so lame? I mean, I understand having some of them, like Illusion for the invisibility spell, but frost resistance? If you&#39;re a Nord it&#39;s moot, and all it takes to fix that if you aren&#39;t is put on a necklace and a ring. Done. Then there&#39;s the Guild Master&#39;s armor. Why would we want the enchants put on for us? I mean, don&#39;t we as guild master get to choose? I for one think so, and that is what I have done here. \r<br />\r<br />The Thieves Guild Master armor has had its quality upgraded to dragonscale, all enchants removed, and is able to be enchanted and upgraded to legendary. The Nightingale set has been almost totally overhauled. For the enchants, I altered them considerably as per my taste, and did so to all the different levels. What you see in the pics is the max level armor (dragonscale) and enchants. Set 2 is equal to glass and set 1 is just below that, but still higher than elven.The enchants I used are the same across the board, just different intensities per level of armor, all done in multiples of 15, if I have it right. As for the sword and bow, which have 5 levels each in terms of obtainment (see the wiki), I started the sword with 10 health and stam drain, then multiplied by 2, 3, 4, and 5 for each level, highest being 50 stam and health. The base damage ranges from elven to dragonbone. For the bow, I didn&#39;t alter the first, but used the same multipliers for each subsequent one, and I fixed the bug where everyone could hear the damn thing, it&#39;s now Silent like it&#39;s supposed to be. As with the sword, base damage has been upped to the same levels. Again, what is pictured is the highest. As you can see, all are also upgradable to legendary, and all, including the Thieves guild armor, use the glass smithing perk. I chose this on account of the original armors being glass quality and a subscriber of mine on steam made me realize that some light armor users might not even have touched the heavy armor side of the smithing tree. I even changed the temper material for the sword and bow to malachite to make it all match. \r<br />\r<br />I didn&#39;t use any DLC in making this so it should run with vanilla. To obtain these armors, you still need to do the Thieves Guild questline as normal; I did not add them to any sort of chest or anything. I have to give a major shoutout to Lucubration here on Nexus. He was the one who helped me figure out how to work with armors like this, and he actually did the one I used till I figured this out the rest of the way on my own. It&#39;s called Legendary Smithing, and his covers ALL of the armors in the game that usually don&#39;t get perks, not just the few that I am doing in various mods. I highly recommend his if that is what you&#39;re after. As always, let me know of any bugs&#33;&#33; ",
  "categoryId": "54",
  "version": "1.1",
  "author": "MertMidnightAngel",
  "createdUnix": "1405925711",
  "updatedUnix": "1412613114",
  "containsAdultContent": false,
  "uploadedBy": "mertmidnightangel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118551",
      "name": "Thieves Guild and Nightingales",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Thieves Guild and Nightingales-56187-1-0.zip",
      "uploadedUnix": "1405925705",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f5f259bade15a8d347e651155e69faae1326338a29493003a25b247bda1c9dd9/analysis/1405925765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thieves%20Guild%20and%20Nightingales-56187-1-0.zip?fid=1000118551&ttl=1535841418&ri=8192&rs=8192&setec=dce7bb3b25dedae5d4d508281ddd6178"
    },
    {
      "fileId": "1000129885",
      "name": "Thieves Guild and Nightingales",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Thieves Guild and Nightingales-56187-1-1.zip",
      "uploadedUnix": "1412613039",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/852e90669455aaea3fb2bb1fd58e0f3e129a0aeb36a094df7771f6ad064cd30d/analysis/1412613122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thieves%20Guild%20and%20Nightingales-56187-1-1.zip?fid=1000129885&ttl=1535841419&ri=8192&rs=8192&setec=852445fa71761333510acf1e54a2e59d"
    },
    {
      "fileId": "1000129886",
      "name": "Thieves Guild and Nightingales - Heavy Version",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Thieves Guild and Nightingales - Heavy Version-56187-1-1.zip",
      "uploadedUnix": "1412613114",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/43eb050fe4b99b0c611054a88e878b9d67136908f902640260f1c761ebafb31e/analysis/1412613123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thieves%20Guild%20and%20Nightingales%20-%20Heavy%20Version-56187-1-1.zip?fid=1000129886&ttl=1535841419&ri=8192&rs=8192&setec=89c03b1140f7ac9e094032735d106e13"
    }
  ]
}