{
  "modId": 56226.0,
  "modName": "Patrick The Trader",
  "summary": "A mod that adds &#39;Patrick The Trader&#39; NPC into the game. He is in The Warrens of Markarth and he has a high amount of gold to buy your valuable items&#33; Please read long description for backstory.",
  "descriptionHtml": "                                                                    Story\r<br />   \r<br />  &#39;Patrick the buyer&#39; grew up in The Warrens of Markarth, a very poor place. As a child he dreamed of one day becoming an adventurer like those he read of in books. He grew up and left The Warrens to become an adventurer, now he&#39;s retired. Why? Not because of any &#39;arrow to the knee&#39; none sense that&#39;s for sure. He was always out adventuring and finding glorious exspensive items, sounds great right? Nope, patrick had no one to sell these items too because they were so great, no one could afford them. So patrick retired and gave up his dream of becoming an adventurer to help others with the same problem. He set up shop in many diffrent places, Whiterun, Riften, Solitude and so on, before eventually returning to where he felt most at home...The Warrens.\r<br />\r<br /> \r<br />                                                              The Mod Details   \r<br />\r<br />   &#39;Patrick the Trader&#39; resides in &#39;The Warrens&#39; of Markarth. He is always there and is available 24/7. He has no items to sell but a high amount of gold to buy items with. He has 10,000 Gold on him, the same for all levels. If 10k is not enough simply quicksave your game with F5 and then quit, come back and he will have another 10k. If you excpierience any problems or have suggestions let me know in the discussions. Subscribing, rating, and following are appreciated. \r<br />\r<br />\r<br />                                                            Known Bugs/Issues\r<br />\r<br />   When trading with Patrick and hovering over an item in your invetory, the green (+x) amount does not show up by your gold amount, but selling the item still adds to your gold and takes away from his.",
  "categoryId": "33",
  "version": "1.9.32.0.8",
  "author": "white0zombie",
  "createdUnix": "1406001587",
  "updatedUnix": "1406001524",
  "containsAdultContent": false,
  "uploadedBy": "white0zombie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118684",
      "name": "Patrick The Trader",
      "version": "1.9.32.0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Patrick The Trader-56226-1-9-32-0-8.rar",
      "uploadedUnix": "1406001524",
      "modVersion": "1.9.32.0.8",
      "virusScanUrl": "https://www.virustotal.com/file/8f546906a7669d088bb1fc2cb5efd92a02865987c522bb1c9cfa17a5a94503f5/analysis/1406011794/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patrick%20The%20Trader-56226-1-9-32-0-8.rar?fid=1000118684&ttl=1535841467&ri=8192&rs=8192&setec=aeac451a60bf2a5124033c5deeed8387"
    }
  ]
}