{
  "modId": 56227.0,
  "modName": "Dragon Master Armory",
  "summary": "This is the Dragon Master Armory, which adds a teleport stone behind a false closet in the Lakeview Manor basement.  It teleports to a sizable, detailed hidden armory in a mountain peak near the Shrine of Azura, which can be used to store weapons and supplies.",
  "descriptionHtml": "This is the Dragon Master Armory, which adds a teleport stone behind a false closet in the Lakeview Manor basement.  It teleports to a sizable, detailed hidden armory in a mountain peak near the Shrine of Azura, which can be used to store weapons and supplies.  There is also an exterior entrance to the armory which cannot be reached unless you can fly or mountain climb or cheat to get to it.  It&#39;s got quite a view.  Once discovered, you can fast travel to it.\r<br />\r<br />Containers meant for storage throughout are marked &#34;(Safe)&#34;.  The armory contains:\r<br />- 30 Large Display Cases (with weapon snapping)\r<br />- 12 Small Angled Display Cases (with weapon snapping)\r<br />- 15 Mannequins\r<br />- 36 Weapon Mounts\r<br />- 42 Safe Categorized Storage Containers (16 of which are for alchemy ingredients - each container is labeled)\r<br />\r<br />\r<br />\r<br />\r<br />LOCATION:\r<br />\r<br />You&#39;ll need to build the Lakeview Manor cellar (near Falkreath) to access the armory via a teleporter - it&#39;ll be behind a closet with a false back.  As mentioned in the description, there is an entrance to the actual armory near the Shrine of Azura, but it&#39;s not accessible unless you cheat to get to it (there&#39;s also a gate requiring a key to pass).  I don&#39;t know what effects attempting to access the Lakeview Manor cellar before it&#39;s built via the armory will have, and I wouldn&#39;t recommend it.  \r<br />\r<br />\r<br />\r<br />\r<br />COMPATIBILITY:\r<br />\r<br />This mod has been cleaned to ensure maximum compatibility with minimal edits to the core game. \r<br />\r<br />*The Hearthfire DLC is required.\r<br />\r<br />- This mod makes some small edits to the Lakeview Manor cellar, and to the top of a mountain near the Shrine of Azura - Tamriel Worldspace cells (25,15), (25,16) and (25,17).  Any other mods making changes to those locations may cause a conflict.\r<br />\r<br />\r<br />\r<br />\r<br />INSTALLATION:\r<br />\r<br />For new installs, copy the &#34;Data&#34; folder to your &#34;Data&#34; folder and activate the esp, or feel free to use NMM (recommended). \r<br />\r<br />\r<br />\r<br />\r<br />PERMISSIONS:\r<br />\r<br />You can do whatever you want with this mod. Just, please give me any due credit.\r<br />\r<br />\r<br />\r<br />\r<br />NOTES:\r<br />\r<br />- There is a gate requiring a key near the exterior of the armory.  The key is located on a table (it&#39;s not hidden) in a room overlooking the main floor of the armory.\r<br />\r<br />- I would recommend running this mod in a game where you have not already built and furnished the Lakeview Manor cellar.  If you have, there may be some persistent references in your save game causing items to partially block the door.  They can be disabled (using the &#34;disable&#34; command on the reference in the console), but that will permanently eliminate the furnishing in your save game even if this mod is later deactivated.\r<br />\r<br />- The weapon snapping feature of the display cases is accomplished using hidden weapon mounts, which does have a few oddities. Maces sink into the display case a bit, and magical staffs don&#39;t quite fit completely into the case. Additionally, the display cases are not meant for non-weapon items... attempting to store things manually in the display case could potentially cause some issues with the weapon snapping and therefore I wouldn&#39;t recommend it.\r<br />\r<br />\r<br />If this isn&#39;t evil enough for you, check out the &#34;a touch of madness&#34; version, which I recommend.  It can be found here:\r<br />http://www.nexusmods.com/skyrim/mods/57351\r<br />\r<br />If you like this mod but you&#39;re looking for something a little (a lot maybe?) bigger, check out my mod RENDSPIRE PALACE.\r<br />http://skyrim.nexusmods.com/mods/23134\r<br />\r<br />Also, check out my edits to the Honeyside home in Riften:\r<br />http://skyrim.nexusmods.com/mods/20959",
  "categoryId": "67",
  "version": "1.1",
  "author": "Shoeski11",
  "createdUnix": "1406001409",
  "updatedUnix": "1406001396",
  "containsAdultContent": false,
  "uploadedBy": "Shoeski11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000118683",
      "name": "Dragon Master Armory",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "115",
      "fileName": "Dragon Master Armory-56227-1-0.zip",
      "uploadedUnix": "1406001396",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/251820fc1fac431611aca5949dd0fcb4424373a1e1ad27d2986262d3550e2d2a/analysis/1406011570/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Master%20Armory-56227-1-0.zip?fid=1000118683&ttl=1535841469&ri=8192&rs=8192&setec=136a4ed119e2020a0f38b353c8ff35dd"
    }
  ]
}