{
  "modId": 56252.0,
  "modName": "Dialog Customization - Lydia",
  "summary": "Changes Lydia&#39;s &#34;Sworn to Carry your Burdens&#34; Line to something lass sarcastic.",
  "descriptionHtml": "[heading][color=green]-Introduction-[/color][/heading]\r<br />Lydia is a pretty cool gal, all the way until you ask her to carry something. This mod aims to change that by putting some more pleasant words in her mouth.\r<br />Right now it makes her say, &#34;What do you want me to carry&#34;, but I plan on adding more options later.\r<br />\r<br />[heading][color=red][b]- PLEASE READ THE ENTIRE DESCRIPTION BEFORE DOWNLOADING -[/b][/color][/heading]\r<br />You should always know exactly what you&#39;re downloading and putting into your savegames. \r<br />\r<br />[heading][color=green]-Don&#39;t we already have some mods that do this?-[/color][/heading]\r<br />I&#39;ve seen some other mods that do similar things, but usually they replace voice files or other types of back-door approaches. This mod is a small .esp that directly changes Lydia&#39;s dialog options to prevent her from using that line, and instead make her use a different one.\r<br />\r<br />[heading][color=green]-How does it work? Has it been cleaned?-[/color][/heading]\r<br />This mod makes only two changes in the CK. First, it takes the conditions for the &#34;Sworn to Carry Your Burdens&#34; line, and makes it so Lydia is not an option. Then, it takes the &#34;What Do You Want Me to Carry?&#34; line conditions, and specifies that Lydia should use it.\r<br />TES5 Cleaning happens when there are unintentional edits to the game through an .esp file, mainly due to the modder testing things out, and later reverting the changes. I did all my testing through a different .esp than what is being hosted here. I did not touch anything other than the two dialog records while making the .esp you will be downloading, so there shouldn&#39;t be anything that needs to be cleaned out of it.\r<br />\r<br />[heading][color=green]-Compatibility-[/color][/heading]\r<br />This mod should be compatible with pretty much everything, as it only changes two dialog records. The only things that would be incompatible are mods that completely overhaul Lydia&#39;s voice (and if you&#39;re using one of those mods, you probably won&#39;t need this one anyway).\r<br />Specifically this is compatible with [url=http://www.nexusmods.com/skyrim/mods/52019/?]Follower Commentary Overhaul[/url] (a mod which I strongly recommend)\r<br />\r<br />[heading][color=green]-Future of the Mod-[/color][/heading]\r<br />I plan on making more options pretty soon. If you know of a dialog line that is part of Lydia&#39;s voice type that would work well as a response to &#34;Let me trade with you&#34;, let me know.\r<br />For that matter, if you can think of any other NPCs who could use something like this, let me know and I&#39;ll see if I can dig up something in the CK.\r<br />\r<br />[heading][color=green]-Installation-[/color][/heading] \r<br />This mod comes packaged in a fomod installer. It is strongly recommended that you use NMM, or a fomod compatible mod installer. \r<br />[b][u][color=yellow]For Manual Installation; read the following[/color][/u][/b]\r<br />Find the folder titled &#34;00 Main&#34;, extract the .esp, and put it in your data folder.\r<br />\r<br />[heading][color=green]-Uninstallation-[/color][/heading]\r<br />Simply deactivate using your mod install software, or delete the .esp if you manually installed it. The .esp for this mod should start with NK. \r<br />[color=yellow]This mod does NOT make gamesave changes, add scripts, or anything else that meddles with save files. It is [u]absolutely[/u] safe to remove my mod at any time.[/color]\r<br />\r<br />[heading][color=green]-Version History-[/color][/heading]\r<br />[list]\r<br />*1.0 - Initial Release. Changes Lydia&#39;s &#34;Burdens&#34; line to &#34;What do you want me to carry?&#34;\r<br />[/list]\r<br />\r<br />[heading][color=green]-Recommended Mods-[/color][/heading]\r<br />[list]\r<br />[*][url=http://skyrim.nexusmods.com/mods/3863/?][u]SkyUI[/u][/url]. Honestly, if you haven&#39;t heard of this, I would like to know what rock you&#39;ve been living under\r<br />[*][url=http://skyrim.nexusmods.com/mods/19/?][u]USKP[/u][/url] and their patches for any DLC\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/51467/?][u]Skyrim Mod Combiner[/u][/url] is an amazing tool to find and combine several spectacular mods.\r<br />[/list]\r<br />\r<br />[heading][color=green]-Permissions-[/color][/heading]\r<br />Do [b]not[/b] upload this mod to any other site, or to the Steam Workshop. Steam Workshop is great for other games, but with a game as complicated and easy-to-crash as Skyrim, the Workshop is shoddy at best, and I do not support modding through it.\r<br />Please ask before using my work in another mod. I would prefer my work to remain in my own hands, but I might make an exception if I like what you propose.\r<br />You can make compatibility patches for other mods without permission, but [b]PLEASE[/b] give credit where credit is due, and send me a PM about it.\r<br />If I am offline, and don&#39;t reply to PM&#39;s for more than 3 months, I give my full consent to do anything with this mod that you wish.\r<br />\r<br />[heading][color=green]-Credits-[/color][/heading]\r<br />[b][u]Bethesda[/b][/u] - For making Skyrim\r<br />[b][u]Nexus Mods[/b][/u] - For hosting such a great community of modders, and generally being awesome.\r<br />[b][u]The Nexus Mods Community[/b][/u] - You guys are the reason I&#39;m doing this, and the reason Skyrim modding is so spectacularly robust.\r<br />[b][u]My mom[/b][/u] - You know why.",
  "categoryId": "96",
  "version": "1.0",
  "author": "NerevarineKhajiit",
  "createdUnix": "1406250104",
  "updatedUnix": "1406211711",
  "containsAdultContent": false,
  "uploadedBy": "NerevarineKhajiit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119035",
      "name": "Dialog Customization - Lydia",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dialog Customization - Lydia-56252-1-0.7z",
      "uploadedUnix": "1406211711",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd7ffd836f46a5994500e422331f26595ce3e4a89d863482386f296090b4e1b3/analysis/1406211734/",
      "changelogHtml": " Initial Release <br/> \n One option: Changes Lydia&#39;s inventory request dialog to &#34;What do you want me to carry?&#34; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dialog%20Customization%20-%20Lydia-56252-1-0.7z?fid=1000119035&ttl=1535841494&ri=8192&rs=8192&setec=fc5c62293d66c5e9579e6a10485fd5ac"
    }
  ]
}