{
  "modId": 56259.0,
  "modName": "Elves-Fuller Lips Edition",
  "summary": "Less Harsh Elves for SG Female Texture Renewal. ",
  "descriptionHtml": "When using SG Female Texture renewal, elves would get a dark ring around their mouth in my game. To fix it, I made the elf lips &#34;human shaped&#34;. This is an alteration of Less Harsh Elves and Dimonized Wood Elf face, because those are the faces that I used in my game. This is a face texture re-placer only (for elves). No body textures included.\r<br />\r<br />You do NOT need this mod if you use [i]Ethereal Elven Overhaul[/i]&#33;\r<br />\r<br />[u]Recommended Mods & Installation Order(with NMM)[/u]. \r<br />- DIMONIZED UNP Female Body \r<br />- SG Female Texture Renewal\r<br />- Less Harsh Elves\r<br />- This mod.\r<br />\r<br />Click yes to overwrite.\r<br />\r<br />I also recommend you use [i]RaceMenu[/i]. Like I said, the lips will be [u]a lot[/u] fuller after installing this and you might want to slim them down a notch.\r<br />\r<br />\r<br />You do not need Less Harsh Elves installed, if you don&#39;t want the Less Harsh Elves male faces. My mod overwrites his for females.\r<br />\r<br />You do not actually need SG Female Texture Renewal, either. While this face was made for that mod, it may look fine with other body skin textures as well. Just install this mod after your chosen skin mod with NMM. Just remove it again with NMM if it doesn&#39;t look right.\r<br />\r<br />If you don&#39;t want all 3 races, you need to do a manual installation. Simply delete the folder of the race you don&#39;t want in the zip file. I don&#39;t recommend this though as this may result in lip coloration smearing for the races you don&#39;t want.\r<br />\r<br />If there is a NECK SEEM, try UNP (or other) Texture Blender.",
  "categoryId": "26",
  "version": "1.0",
  "author": "Izuela",
  "createdUnix": "1406099314",
  "updatedUnix": "1406099314",
  "containsAdultContent": false,
  "uploadedBy": "Izuela",
  "primaryFile": null,
  "files": []
}