{
  "modId": 5626.0,
  "modName": "ThuuMic - Use your mic for dragon shouts",
  "summary": "Master the Thu&#39;um using your PC microphone",
  "descriptionHtml": "[center][img]http://static.skyrimnexus.com/downloads/images/5626-1-1325995683.png[/img]\r<br />\r<br />[b][u]\r<br />\r<br />[size=&#34;4&#34;]Thu&#39;uMic[/size]\r<br />[size=&#34;3&#34;]Master the Thu&#39;um using your PC Mic&#33;[/size]\r<br />\r<br />[/u][/b]\r<br />\r<br />[u][b]THE THU&#39;UM[/b][/u]\r<br />You are Dragonborn, use shouts in REAL LIFE and see them faithfully blast through the screen towards your enemies. Learn the ancient tongue of the Dovah as you play and always be ready for whatever is beyond the next door and over the next horizon.\r<br />\r<br />As you use hone your Thu&#39;um you will see a change in the way you play Skyrim. You will use shouts more often in more varied ways and feel the rush of SHOUTING your opponents off cliff faces, whispering ZUL and throwing your voice, deceiving foes from the shadows.\r<br />\r<br />Roar out TIID&#33; and watch as time slows to a crawl around you. As wild creatures attack let out a mighty RAAS&#33; and they will fight by your side..\r<br />\r<br />This is Thu&#39;uMic.\r<br />\r<br />And your long path along the [b]true[/b] Way of the Voice...\r<br />\r<br />Has only just begun...\r<br />\r<br />____________________________________\r<br />\r<br />**NOTE this is the last version before v2 that will be a fresher look, new features and bug fixes. stay tuned**\r<br />\r<br />[b]Known issues in version 1.9:\r<br />- Horse call and NPC controls not working. to be fixed by probably adding support for better horse/follower mods.\r<br />\r<br />\r<br />\r<br />Special Powers\r<br />Racials = Power of Blood\r<br />Werewolf Transform = Hircine Grant me Power&#33;    (Pronounced Her Seen)\r<br />\r<br />note: will most likely be removed somewhat in 2.0\r<br />\r<br />Companion Commands\r<br />Activating Commands = \r<br />Follow Me                       = Follow me...\r<br />Wait There                      = Wait there (These two commands COMPLETELY disable ai for this user so note... they probably won&#39;t follow you through zones and won&#39;t fight. until you once again use &#34;Follow Me&#34;... use extremely sparingly)\r<br />Activate that for me         = Start Favor\r<br />Never Mind                     = Stop Favor\r<br />Trade with me                 = Companion Inventory Menu\r<br />\r<br />Always remember to tell your Companion to Follow you after you stop them and want them to return to you.\r<br />Or else they will just stand there... in mid pose... doing nothing. (This was a complete hack for this particular command)\r<br />[/b]\r<br />\r<br />\r<br />Version 1.0 Tutorial and Video by PsychoHampster\r<br />[youtube]ofC3TW30fGQ[/youtube]\r<br />\r<br />This is a great video Put together by Schnok54 Thanks mate&#33;\r<br />[youtube]zYYCnqJlVBI[/youtube][/center]\r<br />\r<br />**************************************************************\r<br />[b]XP Installs Please Read&#33;&#33;&#33;&#33;\r<br />Please Read&#33;&#33;&#33; Important For XP Installs&#33;[/b]\r<br />\r<br />How to install XP version of Thuumic Shouter.\r<br />(64-bit May not work as of now, or it may...)\r<br />\r<br />\r<br />ONLY DO STEP ONE IF THIS IS THE FIRST TIME FOR YOU TO INSTALL THUUMIC SHOUTER ON YOUR XP OPERATING SYSTEM\r<br />\r<br />[b](1[/b] From Optional Downloads section of this mod\r<br />Download the File XPPREREQUESITES.ZIP. Inside this file are two Installers\r<br />\r<br />  SAPIREDIST.MSI\r<br />  &\r<br />  dotNetFx40_Full_x86_x64.exe\r<br />  \r<br />Run them both.\r<br />  (Note you may to run them in admin mode)\r<br />[b]This may require a reboot to be successful.[/b]\r<br />  Go to Control Panel &gt; Speech\r<br />  [b]If Control Panel &gt; Speech Does not exist then SAPIREDIST.msi did not install properly and Thuumic Shouter will not work&#33;[/b]\r<br />  Verify All settings for your Microphone is correct\r<br />  \r<br />  [b]Optional but highly reccomended.[/b] (Run the WIndows Speech training in Control Panel &gt; Speech)\r<br />\r<br />\r<br />Skip to this step if you are just Updating ThuumicShouter on your XP Operating System\r<br />[b](2[/b] Download ThuumicShouterSetupXp.exe From Downloads section of this mod\r<br />\r<br />[b](3[/b] Run Above program\r<br />[b](4[/b] Select Install Options\r<br />[b](5[/b] Go to settings and verify that Shout Hotkey is the same as your skyrim Shout Hotkey (On new installs)\r<br />[b](6[/b] start shouting\r<br />\r<br />\r<br />NOTES***\r<br />Some shouts just have horrible recognition at the moment, this is a deficiency in XP&#39;s Forced Sapi 5.1 vs 7&#39;s 5.4 version. (There is no way to upgrade XP to 5.4)\r<br />Shout recognition may increase with more training in Control Panel &gt; Speech, as well as adjustable grammar to be added.\r<br />It also seems shouts take a little while longer to recognize, you might have to adjust play style accordingly\r<br />[b]There is no alternate grammar or cutsom horse name for xp at this time.[/b]\r<br />**************************************************************\r<br />\r<br />\r<br />**************************************************************\r<br />I&#39;m putting this here because it seems to be a good fix for a major problem.\r<br />If shouts don&#39;t switch for you in game, try running thuumic in compatability mode for Windows XP SP 3\r<br />**************************************************************\r<br />\r<br />\r<br />[b]**VERSION 1.0 RELEASED, EASY INSTALL, NO MORE VAC, NO ADDITIONAL MODS TO DOWNLOAD (except script dragon - ofcourse)**\r<br />\r<br />\r<br />Heres what some of Thu&#39;uMic&#39;s other users have to say&#33;\r<br />\r<br />&#34;My throat hurts now it&#39;s too fun&#33;&#34; \r<br />-  SASAlbertini \r<br />\r<br />&#34;I turned the Shout Recovery time to zero for use with this mod, jacked the difficulty up to the max, now when I fight a dragon it&#39;s like I&#39;m having a deadly verbal debate&#33; ... I&#39;ve also found myself saying the Shouts differently, Fus Roh Dah is a full-throated yell, Lass is a hiss, Wuld Nah Kest is said in a hurry, and Krii Lun Aus is a low, evil-sounding whisper.\r<br />100% Endorsed.&#34; \r<br />- Ess Gee Dee\r<br />\r<br />&#34;easily the most fun mod I&#39;ve played since I started downloading mods on day one. Very impressive and fully endorsed. &#34; \r<br />-MarcusRocks\r<br />\r<br />&#34;I almost never used shouts at all until I found this, its really changed the way I play. I&#39;ll fus ro dah one guy off a cliff and then a few seconds later I&#39;ll wuld over to the guy shooting arrows at me and smash his face in too. Soooo satisfying.&#34; \r<br />- Kaiser_Soze\r<br />\r<br />\r<br />[size=&#34;3&#34;]\r<br />**IN THE MEDIA**\r<br />Great article on GEEK.COM&#33; read it [url=http://www.geek.com/articles/games/use-your-own-voice-to-perform-dragon-shouts-with-this-epic-skyrim-mod-20111216] here&#33;[/url]\r<br />Thu&#39;uMic (and its creator) received VERY flattering nod from Gameranx.com [url=http://www.gameranx.com/updates/id/4074/article/thu-umic-lets-you-use-shouts-with-voice-commands] here&#33;[/url]\r<br />IGN have given Thu&#39;uMic a shout-out&#33;&#33; (sorry couldn&#39;t resist) [url=http://au.ign.com/articles/2011/12/13/skyrim-mod-enables-voice-activated-shouts] See what the FUS is about&#33;[/url] (Ok I&#39;ll stop)\r<br />Thu&#39;uMic featured on GEEKOLOGIE&#33; WOO&#33; * one of my fav sites :) * [url=http://www.geekologie.com/2011/12/skyrim-mod-to-perform-dragon-shouts-irl.php#more]Check it&#33;[/url]\r<br />Myona.com made a small report on Thu&#39;umic&#33; [url=http://myona.com/2011/12/12/skyrim-mod-voice-dragon-shout]See it here[/url]\r<br />Featured in DSOGaming&#33; [url=http://www.dsogaming.com/news/the-elder-scrolls-v-skyrim-thuumic-mod-use-shouts-with-your-mic]Check it out[/url][/center][/b][/size]\r<br />\r<br />____________________________________\r<br />\r<br />\r<br />[u][b]WHAT YOU NEED[/b][/u]\r<br />\r<br />[list]\r<br />[*][b]Regular PC Mic[/b]  your headset mic will do just fine, no Kinect required ;)\r<br />[*][b][url=http://alexander.sannybuilder.com/Files/tes]Script Dragon[/url][/b] *this link has Script dragon versions for 1.1, 1.2 and 1.3 versions of Skyrim\r<br />[*][b]Thu&#39;uMic Real Life Dragon Shouts[/b] Available in downloads, All documentation included inside :)\r<br />[*][b]Windows Vista or Windows 7[/b] with Speech recognition enabled (If your language doesn&#39;t support Window&#39;s Speech Recognition see below in FAQ&#39;s for a language work around.\r<br />[*][b]Windows XP[/b] version now released, requires optional download pack available in download&#39;s section.\r<br />[/list]\r<br />\r<br />____________________________________\r<br />\r<br />\r<br />[b]FEATURES[/b]\r<br />[list]\r<br />[*]Keyboard & 360 Controller Friendly :)\r<br />[*]Direct one to one shouts. shout &#34;FUS&#34; you get &#34;FUS&#34;. Shout &#34;FUS RO DA&#34; thats what you get. Changes the way you will play skyrim and think about SHOUTS. Bethesda doesn&#39;t know it yet, but this is how SKYRIM was meant to be played.\r<br />[*]All &#39;shout&#39; character voices replaced with silent replacement .fuz files to enhance immersion when shouting. (Optional)\r<br />[*]Script Dragon integration\r<br />[*]Dragon word translations in game in your shout list&#33; (Can be affected by other mods that edit your ui)\r<br />[*]Shout Reference - See what you shouted in the main window, good for testing\r<br />[*]Doesn&#39;t mess with your hotkeys ^_^\r<br />[*]Silent Character Shouting - Replaces all the in-game character shout sounds with  silent shouts for immersion. (Optional)\r<br />[*]Horse Calling - Call your horse to you (at a walking speed atm) with whatever you decide to name your mount&#33;\r<br />[*]Dragon Scroll - Delivered in secret to one of the last remaining blades, this scroll holds the secrets to the Thuum. when a true dragonborn reads its words aloud, the secret of the scroll is revealed...\r<br />[*]PTT -     Push to Talk has been implemented for both 360 and Keyboard\r<br />[*]Safe mode  -     Allows you to keep ThuuMic working even in towns by disabling certain (or all) shouts depending on whether or not your in combat&#33;\r<br />[*]Properly integrated PTT/On & Off toggle for 360 controller \r<br />[*]Werewolf Transform&#33; (Shout &#39;Hircine Grant me Power&#39;) To experience the strength of the beast. (Must have the spell to activate it. Uses all in-game constraints)\r<br />[*]Racials. Praise your ancestors by proclaiming &#39;Gift of Blood&#39; and activate your racial powers.\r<br />[*]Companions Commands. Want to trade with your companion? Want to tell him to stop following you? Or perhaps ask him to do something for you? Now you can, just by speaking&#33;\r<br />[*]Call your horse. Simply by calling your horses name, (Which you can change) he/she will come running to you at full speed&#33; (Assuming it&#39;s not dead&#33;)\r<br />[*]Two alternate grammar methods if one doesn&#39;t work for you.\r<br />[*]XP compatability (may not have all features)\r<br />[b]PLANNED[/b][list][*]in-program Tweaking of Phoenetic Spellings for Shout Recognizability\r<br />[*]Non-Qwerty Keyboard Layouts\r<br />[/list]\r<br />\r<br />[u][b]VIDEOS[/b][/u]\r<br />v0.3 video by EssGeeDee\r<br />[youtube]UHHv90b7q38[/youtube]\r<br />\r<br />Beautiful Skyrim Review&#33;\r<br />[youtube]j7occ3tizg8[/youtube]\r<br />jump to 7:45 for the review :D\r<br />\r<br />V0.2.2 with reduced lag (recorded off screen to give true lag times)\r<br />[youtube]JNCKgmjOkXg[/youtube]\r<br />\r<br />V1.6 Free Thuumic Shouter By Gigify\r<br />[youtube]UYqnvxFAkC8[/youtube]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />________________________________\r<br />\r<br />[u][b]FAQ[/b][/u]\r<br /> - I have a non-english version of Window&#39;s Speech or Keyboard Layout and it won&#39;t work for me, what should I do?\r<br />\r<br />Some versions of Windows Vista/7 aren&#39;t provided with SAPI by default. An example are the Italian and Danish version. Contrary to what is written on the FAQ it&#39;s not related to the Keyboard layout, aka switching keyboard layout to English US won&#39;t solve the issue. As there seems not to be a self-installing package for SAPI alone, the only workaround I found is switching Windows&#39; system language to English. Normally that would be allowed only to the Ultimate edition of W7/V, but there&#39;s a freeware called Vistalizator that works for both and allows an easy and non-invasive installation of MUIs (language packs). Of course it&#39;s always possible to revert back to the original language. Here&#39;s the link: \r<br />\r<br />http://www.froggie.sk/ \r<br />\r<br />Switching to English will make Speech Recognition Options from the Control Panel available. \r<br />\r<br />I&#39;ll test it more and check if reverting back to the original language while keeping English installed will also retain SAPI. \r<br />EDIT: Hell it works&#33; Reverting back to the original language (in my case, Italian) disables SRO from the Control Panel but keeps SAPI working (and VAC too). Don&#39;t know if enabling English and setting up the Microphone from SRO at least once is required or if you just need to install the MUI and then reboot however.\r<br />____________________________________\r<br />\r<br />Vistalizator not working with windows 7 SP1? try this\r<br />\r<br />http://www.youtube.com/watch?v=NwdmukiE7xM&feature=player_embedded\r<br />\r<br />Thanks to Hoptic for the info&#33;\r<br />\r<br />____________________________________\r<br />\r<br />\r<br /> - The above method does not work for me, or I really don&#39;t want to change my language what do i do?\r<br />\r<br />From ecli7pse\r<br />\r<br />1) I have a german Win 7 edition with Speech Recognition enabled, but this didn&#39;t work because it is the german Speech Recognition version. So i tried your link in the FAQ ( http://www.froggie.sk/ ) , but this only works for Win 7 without ServicePack. I googled a bit and found this tutorial ( http://blog.y-m-e.net/2011/05/language-pack-installation-auf-windows-7-professional-mit-sp1/ ) and i worked for me. It is in german so use google tranlator or something else. I even did not have to activate English language, i just installed it in the way it is descibed there. \r<br />____________________________________\r<br />\r<br />\r<br /> - It worked at first, but stopped what can I do? or It&#39;s not working at all and I meet all the requirements.\r<br />\r<br />algaeb\r<br />\r<br />I hope this may help others: \r<br />\r<br />I am using Windows 7 and Thu&#39;uMic was recognizing my shouts and working in game at first, but after a short time it would stop reacting to my voice. \r<br />\r<br />I looked in the Windows event viewer by typing &#34;eventvwr.msc&#34; into the Start Menu&#39;s Run... command box. In the event viewer, under &#34;Windows Logs&#34;, I clicked on &#34;Applications&#34; and then looked at the list. The most recent entries were &#34;Information&#34;, &#34;Event 1001, Windows Error Reporting&#34;, and when I selected them, the details below looked like this: \r<br />\r<br />Fault bucket , type 0 \r<br />Event Name: PCA2 \r<br />Response: Not available \r<br />Cab Id: 0 \r<br />\r<br />Problem signature: \r<br />P1: ThuumicShouter.exe \r<br />\r<br />I Googled the PCA2 error and found a post somewhere that said it was a Program Compatibility error, and suggested setting the Compatibility mode to Windows XP SP3. So, I right-clicked on the Thu&#39;uMic EXE, selected Properties, Compatibility tab, and enabled that mode. \r<br />\r<br />And so far... it seems to be working.\r<br />____________________________________\r<br />\r<br />\r<br /> - I get an error on starting Thuumic Shouter that won&#39;t allow it to open or I can not correctly install .net 4.0\r<br />\r<br />http://social.msdn.microsoft.com/Forums/en-US/netfxsetup/thread/3cc78f3c-d782-4f90-9035-1b6675890af7/\r<br />\r<br />\r<br />Is there an easy way to change all of my key settings?\r<br />SkyrimKeyHelper.exe Was not written by us but is wonderful for this.\r<br />http://www.skyrimnexus.com/downloads/file.php?id=88\r<br />\r<br />________________________________\r<br />\r<br />\r<br />Thuumic Recognizes my shout but in Skyrim only the shout  I have equipped works.\r<br />1- Increase general delay time in Thuumic Settings\r<br />2- If you use Nexus Mod Manager to load the game, it may break thuumic.\r<br />3- Run thuumic AND skyrim in administrator mode.\r<br />4- Run Skyrim in windowed mode\r<br />5- Run thuumic in windows xp sp3 Compatability mode\r<br />6- Change hotkey to trigger shout switching in Thuumic Settings.\r<br />7- Uninstall/Reinstall Thuumic using the uninstall program in Control panel &gt; Programs and features\r<br />7- Try running the Prerequesites program in the optional File downloads.\r<br />\r<br />[u][b]THANKS[/b][/u]      \r<br />\r<br />Personal thanks to [b]PsychoHampster[/b] from Azuril, dude - the work you have done to bring this out of VAC and give us a truly free program is invaluable. Can&#39;t thank you enough mate.\r<br />\r<br />The guys over @ Kinect FAAST for pointing me to VAC for pre v1.0\r<br />Alexander Blade - for making Script Dragon\r<br />FutureVisions - Community Support\r<br />007Allmighty - Community support\r<br />Grot - Community support\r<br />EssDeeGee - Community Support / Beta Tester\r<br />yevh - Community Support\r<br />Junlou - Community Support / Supplying Quickshouts solution\r<br />PetrucciJohn - Community Support / Beta Tester\r<br />BETHESDA GAME STUDIOS for creating the greatest game series of all time\r<br />TimeForTea(Alice) - Community Support / Beta Tester\r<br />Mt. Dew - For keeping me awake.\r<br />\r<br />[u][b]VERSION NOTES:[/b][/u]\r<br />*******************************************************\r<br />Version 1.94.2\r<br /> - Changed DotNet4.0 dl location to a more reliable source\r<br /> - Forced Install of Visual Basics Power Packs as a requirement\r<br /> - Fixed Double entry for settings\r<br />\r<br />*******************************************************\r<br />Version 1.94.1\r<br /> - Small change to force DotNet4.0 if needed\r<br />\r<br />*******************************************************\r<br />Version 1.94\r<br /> - Werewolf Transformation added&#33;\r<br />(command trigger to say is)  &#34;Hircine Grant me Power&#33;&#34; (Pronounced Her Seen)\r<br /> - Improved set up file. Will check for XNA install and force it if it is not yet installed.\r<br /> - Adds Uninstall feature to Start Menu\r<br />\r<br />*******************************************************\r<br />Version 1.93\r<br /> - Racial powers are now here (with the exception of Khajiits.. I can&#39;t find the Spell Form ID (command trigger to say is)  &#34;Gift of Blood&#33;&#34;\r<br /> - Horse now actually bloody RUN to you when you call them, no more klip klop\r<br />\r<br />\r<br />*******************************************************\r<br />Version 1.9\r<br />- Companion Control Commands Added&#33; *NOTE* Some of these are just hacked as there wasn&#39;t full support for Companions in Script Dragon.\r<br />Activating Commands = \r<br />Follow Me                       = Follow me...\r<br />Wait There                      = Wait there (These two commands COMPLETELY disable ai for this user so note... they probably won&#39;t follow you through zones and won&#39;t fight. until you once again use &#34;Follow Me&#34;... use extremely sparingly)\r<br />Activate that for me         = Start Favor\r<br />Never Mind                     = Stop Favor\r<br />Trade with me                 = Companion Inventory Menu\r<br />\r<br />*******************************************************\r<br />Version 1.82\r<br />- Added Xbox Controller Hotkey Support\r<br />- MUST install the prerequisite at least once before this functions\r<br />\r<br />*******************************************************\r<br />Version 1.81\r<br /> - Fixed PTT hotkey and PTT On Not sticking in Settings\r<br /> - XP Version Released&#33;\r<br />\r<br />*******************************************************\r<br />Version 1.8\r<br /> - Adjusted general delay issue to prevent Interval &gt; 0 Error\r<br /> - Added a donate button in the about page if you really like the mod\r<br /> - 75 Hotkeys now available&#33; Took out Alpha Keys only limitation for OnOff / Saftey / and PTT Toggle (Now expanded to match other hotkeys)\r<br /> - Due to extra hotkeys being available, changed Default Power Toggle to [ { Key. And Safety Toggle Key to ] }\r<br />\r<br />*******************************************************\r<br />Version 1.78\r<br />Added A new Option &#34;NON XML Grammar&#34; to help fix no shouts being recognized but IIZ\r<br />\r<br />*******************************************************\r<br />Version 1.73\r<br />Font Fix\r<br />Fonts will no longer uninstall\r<br />\r<br />*******************************************************\r<br />Version 1.72\r<br />New Fix for Crashing When calling horses in Dungeons (tested myself and seemed to be ok)\r<br />Added a new setup script to help the user find TESV.exe for correct installation.\r<br />Added checking for Script Dragon on Startup\r<br />\r<br />*******************************************************\r<br />Version 1.71\r<br />Fixed Alt Grammar Sticking In settings\r<br />Added Some additional measure to try to force shout switching in .asi\r<br />\r<br />*******************************************************\r<br />Version 1.7\r<br />Removed 1.6 change that I believe was crashing the game. \r<br />Returned Alternate Grammar to orginal formula \r<br />Removed Additional Faas Roo Maar in regular grammar. \r<br />Change Default shout key to Z To match Skyrim \r<br />Changed Default Hot key to trigger shout switching to F8 hopefully to fix shouts not switching. \r<br />\r<br />*******************************************************\r<br />Version 1.5\r<br />Added autosave to settings. \r<br />Added &#34;error handling&#34; to settings. So users should be able to tell me what is stopping settings from changing. \r<br />\r<br />*******************************************************\r<br />Version 1.4\r<br />Fixed Tier2,3 shouts for Alt grammar. \r<br />\r<br />*******************************************************\r<br />Version 1.3\r<br />Fixed Calling for horses crashing dungeons. \r<br />Added Alt Grammar setting to Settings. \r<br />Added ability to kill 3 in-program hotkeys to prevent accidental switching. \r<br />\r<br />*******************************************************\r<br />Version 1.2\r<br />Added Dragon Word Translation for in-game viewing of Shout words. \r<br />\r<br />*******************************************************\r<br />Version 1.1\r<br />Fixed Silent shouts not installing correctly. \r<br />\r<br />*******************************************************\r<br />v1.0\r<br />FIRST RELEASE OF NEW SOFTWARE&#33; so many new things, weve worked hard on getting this out for you guys and making it as hassle-free as possible. hope you like it and please endorse if you enjoy&#33;\r<br />\r<br />Az",
  "categoryId": "78",
  "version": "v1.94.2",
  "author": "DeadlyAzuril and PsychoHampster",
  "createdUnix": "1325993671",
  "updatedUnix": "1345492700",
  "containsAdultContent": false,
  "uploadedBy": "DeadlyAzuril",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19797",
      "name": "QuickShouts zip",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "QuickShouts zip-5626.zip",
      "uploadedUnix": "1326569994",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/bab06f15c2a612b017717a131fa86aff8cde75b1fdc43ea13b436fe982ac182e/analysis/1406610903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/QuickShouts%20zip-5626.zip?fid=19797&ttl=1535762465&ri=8192&rs=8192&setec=cac25af770fd14a32ff8170901388f25"
    },
    {
      "fileId": "20133",
      "name": "Font Pack",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "66",
      "fileName": "Font Pack-5626-1.zip",
      "uploadedUnix": "1326655918",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/0ad2af875b62af2fad182bf6170176494d85f264b62b37281c2b20e8ea216a85/analysis/1406613726/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Font%20Pack-5626-1.zip?fid=20133&ttl=1535762466&ri=8192&rs=8192&setec=7c176e71d50d4d44e76bdb387152a43e"
    },
    {
      "fileId": "22786",
      "name": "XP ONLY XP ONLY XP ONLY PREREQUESITES",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "99667",
      "fileName": "XP ONLY XP ONLY XP ONLY PREREQUESITES-5626.zip",
      "uploadedUnix": "1327454937",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0373342db6b17d32a155e818b5759c98829a784ccf6e9a0db81900d0797bfe39/analysis/1406635889/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20ONLY%20XP%20ONLY%20XP%20ONLY%20PREREQUESITES-5626.zip?fid=22786&ttl=1535762466&ri=8192&rs=8192&setec=4a6266b756e0ae3ba3d70ac113c78535"
    },
    {
      "fileId": "22975",
      "name": "XP ONLY THUUMICSHOUTER SETUP",
      "version": "1.81",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10498",
      "fileName": "XP ONLY THUUMICSHOUTER SETUP-5626-1-81.exe",
      "uploadedUnix": "1327524288",
      "modVersion": "1.81",
      "virusScanUrl": "https://www.virustotal.com/file/ff502a7adc9667a1f26241240eb4cb7a62d2e95c1161df0df25e3b6690ea6059/analysis/1406637166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XP%20ONLY%20THUUMICSHOUTER%20SETUP-5626-1-81.exe?fid=22975&ttl=1535762467&ri=8192&rs=8192&setec=7d4c2f9ac4cad4db3e8117a10a180afc"
    },
    {
      "fileId": "31387",
      "name": "ThuumicShouterSetupV1_94_1 Werewolf Support",
      "version": "1.94.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18530",
      "fileName": "ThuumicShouterSetupV1_94_1 Werewolf Support-5626.exe",
      "uploadedUnix": "1329283942",
      "modVersion": "1.94.1",
      "virusScanUrl": "https://www.virustotal.com/file/8689a101959e27343c26ca5c5211106eba09b7b888c034166ad1e175c6f2580b/analysis/1406683640/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ThuumicShouterSetupV1_94_1%20Werewolf%20Support-5626.exe?fid=31387&ttl=1535762467&ri=8192&rs=8192&setec=148e56734b182defb0577d2a8dea2647"
    },
    {
      "fileId": "33198",
      "name": "ThuumicShouterSetupV1_94_2 Small Fixes to Prerequisites",
      "version": "1.94.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18963",
      "fileName": "ThuumicShouterSetupV1_94_2 Small Fixes to Prerequisites-5626-1-94-2.exe",
      "uploadedUnix": "1329582217",
      "modVersion": "1.94.2",
      "virusScanUrl": "https://www.virustotal.com/file/f455f301d64ca3e395c3fbf1d367ea768c2c54b03965fa1f5d162f6ae074fc92/analysis/1406693297/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ThuumicShouterSetupV1_94_2%20Small%20Fixes%20to%20Prerequisites-5626-1-94-2.exe?fid=33198&ttl=1535762467&ri=8192&rs=8192&setec=d234817387a67bb520eb00840c8654c4"
    },
    {
      "fileId": "83059",
      "name": "Thuumic for win 7 users experiencing problems",
      "version": "1.8",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "11733",
      "fileName": "Thuumic for win 7 users experiencing problems-5626-1-8.zip",
      "uploadedUnix": "1345492700",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/6be201bc5ca14d91106138aa8d1b654df33ae9afaf3fbbce966faf59e25ddae0/analysis/1407110532/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thuumic%20for%20win%207%20users%20experiencing%20problems-5626-1-8.zip?fid=83059&ttl=1535762468&ri=8192&rs=8192&setec=99b6e9924212f03e315a90c8ddd8072e"
    }
  ]
}