{
  "modId": 56281.0,
  "modName": "Spanish Translate Vampiric Thirst - Dawnguard Edition",
  "summary": "Traducción al español del mod Vampiric Thirts - Dawnguard Edition.",
  "descriptionHtml": "Esta es la traducción del mod &#34;Vampiric Thirst - Dawnguard Edition&#34; creado por MsLeeches el cual ofrece una nueva experiencia de juego al ser un vampiro que pretende poner a prueba tus espectativas.\r<br />\r<br />[size=14][color=red]Características del Mod:[/color][/size]\r<br />[list]\r<br />[*] Nuevo sistema de hambre basado en la sangre en vez del tiempo el cual consta de 6 etapas las cuales vienen con algunas ventajas y penalizaciones. Mantente bien alimentado y podrás caminar bajo la luz del sol sin el temor de morir durante un tiempo pero ten cuidado, el padecimiento por el hambre puede volverte loco&#33;\r<br />[*]El daño provocado por la luz solar es calculado dinámicamente basado en el clima, hora del día, etapa de hambre e incluso la intensidad de la luz&#33; Esto significa que puedes usar las sombras para disminuir el daño provocado por el sol&#33;\r<br />[*]Envejecer incrementa tus ventajas innatas y potencia varios de tus poderes vampíricos con 5 etapas alcanzables de 10 que están disponibles para los vampiros NPC. Toma alrededor de 9 meses de juego para pasar de Novato a Pariente de Sangre pero esto puede ser ajustado en el archivo de configuración que viene incluido&#33;\r<br />[*]Nueva experiencia vampírica que cuenta con 29 nuevas ventajas y poderes que pueden ser desbloqueados a medida que avanzas en tu estado vampírico&#33; Algunas son habilidades que vienen por defecto en Skyrim pero que han sido modificadas para hacerlas mas interesantes y otras son nuevas. La mayoría de ellos se hacen mas fuertes a medida que envejeces. Pero recuerda: nada es gratis&#33; El primer poder que obtienes es la &#34;Visión de vampiro&#34;: el resto de habilidades nesecitas desbloquearlas&#33;\r<br />[*]Los sistemas de caza y de alimentación se adaptan a diferentes estilos de juego: sigilosos, sociales, brutales e incluso vampiros inclinados hacia la magia, todos encontrarán algo para sí mismos. Totalmente animados&#33;\r<br />[*]Las calidades y sabores de la sangre que te dan una razón para pensar acerca de tu &#34;dieta&#34; y con el tiempo reconocer y premiar a tu gusto y paladar único&#33;\r<br />[*]Integrado con Dawnguard y mutuamente interactivo con el sistema del señor de los vampiros. Desbloquear el potencial del linaje de sangre de Harkon y acceder a su poderosa magia de la sangre y a sus poderosos cambios de forma tanto dentro como fuera de esa forma&#33; También puedes desbloquear poderes normales para acceder a ellos o variaciones de ellos en forma del señor de los vampiros.\r<br />[*] Apoya a los NPCs que tienen acceso a algunas de las mismas capacidades que el jugador y en algunos casos aún más grandes&#33; Y van a usar todos los trucos a su disposición si se sienten amenazados. Los cazadores no deben subestimar a sus presas y los vampiros deben de tener cuidado de sus rivales no-muertos&#33;\r<br />[/list]\r<br />\r<br />Si encuentras algún error en la descripción o nombre de algún hechizo o que no concuerde con lo que hace en el juego por favor comentaló para mejorar la traducción.\r<br />\r<br />[color=red]Nota:[/color] Este es solo el .esp con la traducción, REQUIERE EL MOD ORIGINAL [url=http://www.nexusmods.com/skyrim/mods/24222/]Mod Original(Vampiric Thirst - Dawnguard Edition)[/url]",
  "categoryId": "79",
  "version": "2.61",
  "author": "Chofranc",
  "createdUnix": "1406504892",
  "updatedUnix": "1406529745",
  "containsAdultContent": false,
  "uploadedBy": "chofranc",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119640",
      "name": "Spanish Translation - Vampiric thirst - v2.61",
      "version": "2.61",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59",
      "fileName": "Spanish Translation - Vampiric thirst - v2.61-56281-2-61.rar",
      "uploadedUnix": "1406529745",
      "modVersion": "2.61",
      "virusScanUrl": "https://www.virustotal.com/file/db18562ffc85114ed14f9d0f0f492a6c8f7b3160ec775485718b2abca2eb152e/analysis/1406529800/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spanish%20Translation%20-%20Vampiric%20thirst%20-%20v2.61-56281-2-61.rar?fid=1000119640&ttl=1535841541&ri=8192&rs=8192&setec=d17ba8395d8cda5b39e43544edd0d8dc"
    }
  ]
}