{
  "modId": 56303.0,
  "modName": "No quiver Arrows",
  "summary": "Adds a special type of arrow that has no quiver to be used with the TERA weapon mod.",
  "descriptionHtml": "[heading]Introduction[/heading]\r<br />So, I recently started using the TERA Armors for UNP and the TERA weapon mod to suit them best. What really annoyed me was the fact that there were no arrows for the bows, so you need to use vanilla arrows, which look really ugly with these armors. It annoyed me enough so i took some minutes and did this little mod, which isn&#39;t that nice, but it gets the problem more or less solved and since i didn&#39;t find a mod doing this up on nexus ithought I&#39;d upload for everyone who might be interested.\r<br />\r<br />[heading]What it does[/heading]\r<br />So, after talking about WHY i did this I guess I should tell you WHAT i did ;)\r<br />This simply adds a new type of arrow, called Summoned Arrow, that can be forged under the Misc. category at every smithing forge. You will need one small soul gem to craft 50 arrows. The arrows do not have a model, so your back will stay empty what is exactly the intention of this. The problem is that since there is no model you will see no arrow when you draw the bow. If someone has a fix for it you are welcome to tell me :)\r<br />The Arrows use the same projectile like the bound arrow, but with less damage and less gravity drop.\r<br />I think it&#39;s optic is as close as I could get to the original archery in TERA, which was my intention.\r<br />But ofc you can use this with every bow you like ;)\r<br />[heading]Installation[/heading]\r<br />just extract the .esp into your Skyrim&#39;s Data-folder and activate in the launcher, pretty standard :)\r<br />\r<br />[heading]Alternatives[/heading]\r<br />If you are looking for a &#34;light&#34; arrow mod that removes the quivers u should maybe check out this: \r<br />http://www.nexusmods.com/skyrim/mods/28204/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D28204%26preview%3D&pUp=1\r<br />I personally don&#39;t use it because i dont like the optic with the single arrow + I dont want to replace the quivers for all NPCs, but if you are currentlxy reading this, this mod could help you, too.",
  "categoryId": "55",
  "version": "1.0",
  "author": "JonnyWalls",
  "createdUnix": "1406211350",
  "updatedUnix": "1406211345",
  "containsAdultContent": false,
  "uploadedBy": "JonnyWalls",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119032",
      "name": "Summoned Arrow",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Summoned Arrow-56303-1-0.zip",
      "uploadedUnix": "1406211345",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e7934a294d495a91fefe82d19b1e8c9f7e33c1e588ad607229d7a36a7358d1a8/analysis/1406211384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summoned%20Arrow-56303-1-0.zip?fid=1000119032&ttl=1535841575&ri=8192&rs=8192&setec=559d89e289fc37ccf07d565f6f46693b"
    }
  ]
}