{
  "modId": 56354.0,
  "modName": "Thematic Loot",
  "summary": "This mod changes the loot that can be found in certain chests. Chests owned by the Dwemer, the Falmer, mages, draugrs, vampires and giants are affected. The purpose behind the changes is to make each chest more representative of the individuals who filled it with items.",
  "descriptionHtml": "Thematic Loot\r<br />by Tiny Lampe\r<br />\r<br />Requirements: Skyrim 1.9, Dawnguard, Dragonborn.\r<br />\r<br />1. Motivation behind this mod\r<br />-------------------------------------------\r<br />\r<br />Once I opened a dwemer chest. I was expecting to find something representative of the dwemer and its culture. Like, I don&#39;t know...dwemer weapons and armor? dwemer coins? Potions from millenia ago? Instead I got an iron sword, some gold coins and a freshly-baked potion like those you can find at Belathor&#39;s. WHAT THE...?&#33;\r<br />\r<br />Once I opened a falmer chest. I was expecting to find something representative of the falmer and its culture. Like, I don&#39;t know...poisonous ingredients? human remains? pieces of their tribal armors? Instead I got some gold coins, a health potion and a lockpick. A lockpick&#33; WHAT THE...?&#33; \r<br />\r<br />Once I opened a mage chest. I was expecting to find something useful for rougue spellcasters. Like, I don&#39;t know...jewelry enchanted with fortify destruction or conjuration? scrolls? alchemy recipes? Instead I got some gold coins, a health potion, and an iron warhammer. An iron warhammer&#33; What the...?&#33; \r<br />\r<br />I could continue but I&#39;m sure you get the picture. In Skyrim, the loot you find in chests is very generic. It doesn&#39;t matter if you loot a dwemer chest or a draugr chest; you are very likely to find the exact same things. This bothered me. Shouldn&#39;t chests better represent the people that presumably filled them with items? I think so, and this is precisely what this mod attempts to do. \r<br />\r<br />\r<br />2. Short Description\r<br />----------------------------\r<br />\r<br />This mod changes the loot that can be found in certain chests. Chests owned by the Dwemer, the Falmer, mages, draugrs, vampires and giants are affected. The purpose behind the changes is to make each chest more representative of the individuals who filled it with items. \r<br />\r<br />\r<br />3. Exhaustive list of the changes\r<br />---------------------------------------------\r<br />\r<br />See readme tab.\r<br />\r<br />\r<br />4. And what about the probabilities? \r<br />--------------------------------------------------\r<br />\r<br />In the readme I described the items that can spawn in chests but, how likely are they to spawn? Will I receive so much loot after opening a couple of chests that I will need a carryig capacity of over 9000? \r<br />\r<br />Answer: on average, you should receive less loot than in vanilla Skyrim. Also, loot should also be more varied even though my chests have clearly defined themes. This is because each chest includes many different leveled lists (the ones described above) but with very high probabilities of spawning no item (75-85%).  \r<br />\r<br />\r<br />5. Installation and uninstallation\r<br />--------------------------------------------\r<br />\r<br />No scripts so it&#39;s save to install and uninstall at any point. Do consider that if you install it midgame only the dungeons you have not visited yet will receive my changes. The others will eventually receive them too, but only after the cell resets (31 game days). \r<br />\r<br />To install copy the meshes and texture folders together with the .esp file inside your data folder. Then active the mod. Remove the files to uninstall. \r<br />\r<br />\r<br />6. Credits\r<br />--------------\r<br />\r<br />Insanity Sorrow for granting me permission to use their excellent models. Dwemer and draugr chests would be so much more bland without them. List of Insanity&#39;s mod that were used in this project: \r<br />\r<br />&#39;Lore Weapon Expansion&#39; http://www.nexusmods.com/skyrim/mods/44179/?\r<br />&#39;Insanitys Dwemer Coin&#39; http://www.nexusmods.com/skyrim/mods/33812/?\r<br />&#39;Insanitys Celtic Coin&#39; http://www.nexusmods.com/skyrim/mods/15513/?\r<br />&#39;Insanitys Morrowind Potions&#39; http://tesalliance.org/forums/index.php?/files/file/1400-insanitys-morrowind-potions/",
  "categoryId": "78",
  "version": "1",
  "author": "Tiny Lampe",
  "createdUnix": "1406323122",
  "updatedUnix": "1406322775",
  "containsAdultContent": false,
  "uploadedBy": "tiny lampe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119248",
      "name": "Thematic Loot",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44766",
      "fileName": "Thematic Loot-56354-1.7z",
      "uploadedUnix": "1406322775",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e6f72bdda61e35406bebd05a18c78316593051a4fdeeecfab674bed23fcb0a62/analysis/1406332057/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thematic%20Loot-56354-1.7z?fid=1000119248&ttl=1535841658&ri=8192&rs=8192&setec=2f0684a7b53251fb2f4ded59b152cc90"
    }
  ]
}