{
  "modId": 56359.0,
  "modName": "Eye Customization Overhaul",
  "summary": "Adds over 1,000 new eye combinations without adding any new textures, controllable by two new Sliders in the RaceMenu. Every eye color is now available in any combination of left and right eyes to every race.",
  "descriptionHtml": "[center]Everyone, \r<br />\r<br />I&#39;ve returned to modding&#33; I&#39;ve updated the no-sliders version of this mod to SSE, with many corrections, and even some new eye texture options&#33;\r<br />[url=http://www.nexusmods.com/skyrimspecialedition/mods/2006] Check it out&#33;[/url][/center]\r<br />\r<br />\r<br />[heading][color=green]-Introduction-[/color][/heading]\r<br />I found it rather annoying that you could select an eye set that makes your left eye blind, but there wasn&#39;t the equivalent for the other eye, or for other colors. So I set out to change that, and so much more.\r<br />\r<br />[center][heading][color=green][size=4]-NerevarineKhajiit Presents-[/size][size=6]\r<br />Eye Customization Overhaul[/size][/color][/heading][/center]\r<br />Using the power of [url= http://www.nexusmods.com/skyrim/mods/29624/?]Racemenu[/url]  (and with a lot of help from its author, expired6978), this mod adds two new sliders that control each eye. Over 1,000 combinations are now possible, without adding any new textures&#33; Want to make your Nord have his left eye be Orcish and Red, and have his right eye be Blind? Go for it&#33;\r<br />Now with Beast Race support&#33; Using some new meshes, Beast Race eyes are now able to be separated into left and right.\r<br />\r<br />[heading][color=yellow]-MOD NEWS-[/color][/heading]\r<br />Version 2.1 is out now&#33;\r<br />What&#39;s New: \r<br />[list]\r<br />[*]Optional selection - Choose whether or not you want the new sliders. \r<br />[*]Without Sliders: All 1,000+ options show up directly in your regular eye slider. It&#39;s a pain to navigate with that many, but this version has no dependencies.\r<br />[*]With new Sliders: Removes all new eyes from the regular slider in lieu of two new sliders that control Left and Right eyes. 32 options on each eye --&gt; 32x32=1024 combinations.\r<br />[*]Sliders Version: Merged .esp files.\r<br />[/list]\r<br />\r<br />[heading][color=red][b]- PLEASE READ THE ENTIRE DESCRIPTION BEFORE DOWNLOADING -[/b][/color][/heading]\r<br />You should always know exactly what you&#39;re downloading and putting into your savegames. \r<br />[center][/center]*Note, this video was made using version 1.0. As of 2.0 there are now two different sliders to make for easier selection.\r<br />\r<br />[heading][color=green]-What&#39;s the difference between this and other eye mods?-[/color][/heading]\r<br />Other eye mods add new textures. This mod doesn&#39;t add any of those; it adds new eye sets created using the textures already available in vanilla Skyrim. This also means that this mod works with re-texture mods that change vanilla eyes.\r<br />\r<br />[heading][color=green]-How do I use it?-[/color][/heading]\r<br />If you&#39;re using the version without new sliders, just install it and the eyes will appear in your slider.\r<br />\r<br />If you&#39;re using the version with the new sliders, you need to have RaceMenu installed, first. Two new sliders will appear towards the bottom of the eye customization list. Moving the “Left Eye” slider will change the texture of the left eye, and moving the “Right Eye” slider will change the other eye.  To prevent issues, I’ve made all Vanilla eye types “Unplayable” in this version to prevent them from showing up in the regular slider. If you have a mod that adds entirely new eye types, those will still show up in the regular slider.\r<br />\r<br />\r<br />[heading][color=green]-What’s so special about Beast Race support?-[/color][/heading]\r<br />In Vanilla Skyrim, neither Beast race had a mesh that would allow one eye to be different from the other. This mod comes with some new meshes, provided by expired6978, that separate the beast eyes into left and right, allowing cross-combination of their eye textures. However, this is not without limitation. Argonians and Khajiit still each have different eye meshes, which make them incompatible with other races&#39; textures. While human and elf races will be getting 1,000+ combinations from this mod, Argonians will only get around 575, and Khajiit only about 140, due to the smaller number of available textures. (32 for humans/elves, 24 for Argonians, and only 12 for Khajiit).\r<br />\r<br />[heading][color=green]-Help&#33; I’ve got a problem.-[/color][/heading]\r<br />Depending on your setup, using the new slider version might give you a glitch where updating your Left and Right sliders either doesn’t appear to do anything, or you end up with some serious flickering issues. What’s happening is that the game, for some reason, forgot to remove the other eye set when it added the one you selected with the new sliders. This means you have two eyes in the same socket.\r<br />To combat this, I’ve included a “Blank” eye set you can use in the regular slider. Just set the regular slider to this Blank set, and then continue using the new sliders.\r<br />\r<br />[heading][color=green]-How does it work/What did you do to get these?-[/color][/heading]\r<br />[color=yellow]Technical details below. You can skip this paragraph if you don&#39;t care about the nitty-gritty details[/color]\r<br />Using the CK, I found the eye mesh that makes the Left eye different from the Right (in vanilla this mesh is only used to make blind eyes) and created 32 new faceparts using that mesh, one for each of the vanilla non-beast eye textures. Then I copied one of the vanilla eye sets that has a blind eye, and set it to be useable by all non-beast races. I then went over to [url=http://www.nexusmods.com/skyrim/mods/25859/?]TES5Edit[/url] and duplicated that record 1024 times (32 colors means 32*32=1024). Each set of 32 records was set to use one of the new faceparts I made, and have one of the 32 textures. Then I duplicated all of the records I had made and set them all to the equivalent for the other gender.\r<br />A similar process was used for the Beast Races, using the new meshes.\r<br />I then went through and unchecked “playable” tag on all vanilla eyes, and used TES5Edit to remove the same tag on all my eyes.\r<br />\r<br />[heading][color=green]-Does this modify any NPCs?-[/color][/heading]\r<br />No. All of the eye combinations are completely new records and are not referenced by anything in the game. You&#39;ll only see them if you put them on your character, or manually edit an NPC.\r<br />However, if you are interested in seeing these eyes on your companions, I recommend the mod [url= http://www.nexusmods.com/skyrim/mods/54509/?]Familiar Faces[/url]. Using that mod, you can turn your own characters into followers for your other characters.\r<br />\r<br />[heading][color=green]-Compatibility-[/color][/heading]\r<br />This mod should be compatible with about every mod that I can think of. It will use any Texture mod you have, unless they come with their own meshes. Mods that add completely new eye sets will work as they normally do.\r<br />Additionally, this will work with custom races, provided that your custom race is compatible with vanilla eye meshes (most custom races are), and provided your race doesn’t automatically assign an eye type (some custom races force you to use vampire eyes, for example)\r<br />\r<br />[heading][color=green]-Future of the Mod-[/color][/heading]\r<br />[list]\r<br />[*]I plan on making &#34;Compatibility Patches&#34; for a some mods that add new eyes so that their new textures will appear in the new sliders. \r<br />[color=yellow]If you have a recommendation/request, post it in the comments&#33;[/color][*]I&#39;m working on a version that merges both .esp files into one.\r<br /> [/list]\r<br />\r<br />Planned Patches (Pending Permissions):\r<br />[list]\r<br />[*]None at the moment. \r<br /> [/list]\r<br />Work-In-Progress Patches\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/30823/?]Hale - Iridum Eyes[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/43899/?]Runic Eyes[/url]\r<br />[/list]\r<br />\r<br />[heading][color=green]-Installation-[/color][/heading] \r<br />This mod comes packaged in a fomod installer. It is strongly recommended that you use NMM, or a fomod compatible mod installer. \r<br />\r<br />[heading][color=green]-Uninstallation-[/color][/heading]\r<br />Simply deactivate using your mod install software, or delete the .esp if you manually installed it. The .esp for this mod should start with NK. \r<br />[color=yellow]This mod does NOT add save-changing scripts or mess with any NPCs, [b][u]however[/u][/b], it will mess up your character&#39;s eyes if you save with one of the new eye sets in place. If you want to uninstall the mod, use the console command &#34;showracemenu&#34; and change your eyes to something not included in the mod first.[/color]\r<br />\r<br />[heading][color=green]-Version History-[/color][/heading]\r<br />[list]\r<br />[*]2.1 - Optional installs. Choose whether or not you want the new sliders. Merged .esp files for Sliders Version.\r<br />[*]2.0 – [url=http://www.nexusmods.com/skyrim/mods/29624/?]RaceMenu[/url] plugin added; Two sliders now control each eye. Beast Race support added.\r<br />[*]1.0 - Initial Release. Adds 1024 new eye sets to all non-beast races, in both genders.\r<br />[/list]\r<br />\r<br />\r<br />[heading][color=green]-Recommended Mods-[/color][/heading]\r<br />[list]\r<br />[*]Any eye texture replacer. The better the textures, the prettier this mod&#39;s changes become.\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/54509/?]Familiar Faces[/url] - This mod allows you to use some of your own characters as followers in a different save. If you want custom followers with my new eye sets, use this, and just make new characters for your followers.\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/29624/?]RaceMenu[/url] - As stated previously, this mod is essential to be able to navigate over 1,000 eye combinations using my new sliders.\r<br />[*][url=http://skyrim.nexusmods.com/mods/3863/?][u]SkyUI[/u][/url] - Honestly, if you haven&#39;t heard of this, I would like to know what rock you&#39;ve been living under.\r<br />[*][url=http://skyrim.nexusmods.com/mods/19/?][u]USKP[/u][/url] and their patches for any DLC.\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/51467/?][u]Skyrim Mod Combiner[/u][/url] is an amazing tool to find and combine several spectacular mods.\r<br />[/list]\r<br />\r<br />[heading][color=green]-Permissions-[/color][/heading]\r<br />Do [b]not[/b] upload this mod to any other site, or to the Steam Workshop. Steam Workshop is great for other games, but with a game as complicated and easy-to-crash as Skyrim, the Workshop is shoddy at best, and I do not support modding through it.\r<br />Please ask before using my work in another mod. I would prefer my work to remain in my own hands, but I might make an exception if I like what you propose.\r<br />I would prefer if compatibility patches were made only by me, so that the records follow the same formatting, but you have my permission to make compatibility patches for other mods without asking. [b]PLEASE[/b] give credit where credit is due, and send me a PM about it if you do make a patch so I know that it’s being made.\r<br />If I am offline, and don&#39;t reply to PM&#39;s for more than 3 months, I give my full consent to do anything with this mod that you wish.\r<br />\r<br />[heading][color=green]-Credits-[/color][/heading]\r<br />[b][u]expired6978[/u][/b] – For helping me write the RaceMenu script, and for providing new Beast Race eye meshes.\r<br />\r<br />[b][u]Bethesda[/u][/b] - For making Skyrim\r<br />[b][u]The TES5Edit Team[/u][/b] - I used their tool heavily during this mod&#39;s inception. Without it, my workload would&#39;ve been multiplied by a factor of at least 30.\r<br />[b][u]Nexus Mods[/u][/b] - For hosting such a great community of modders, and generally being awesome.\r<br />[b][u]The Nexus Mods Community[/u][/b] - You guys are the reason I&#39;m doing this, and the reason Skyrim modding is so spectacularly robust.\r<br />[b][u]My mom[/u][/b] - You know why.",
  "categoryId": "29",
  "version": "2.1",
  "author": "NerevarineKhajiit",
  "createdUnix": "1406334604",
  "updatedUnix": "1406784062",
  "containsAdultContent": false,
  "uploadedBy": "NerevarineKhajiit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119268",
      "name": "NK Eye Customization Overhaul v1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "20",
      "fileName": "NK Eye Customization Overhaul v1.0-56359-1-0.7z",
      "uploadedUnix": "1406334176",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bbf6df7a5e160fd2f78feb5a53622254d8bdd638a1603165c7fb07a6b2e2f484/analysis/1406334186/",
      "changelogHtml": " Initial Release <br/> \n Add 1024 new eye sets using vanilla assets. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NK%20Eye%20Customization%20Overhaul%20v1.0-56359-1-0.7z?fid=1000119268&ttl=1535841665&ri=8192&rs=8192&setec=ccaeed1a8398b77b7be46739bc888934"
    },
    {
      "fileId": "1000119613",
      "name": "NK Eye Customization Overhaul v2.0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "43",
      "fileName": "NK Eye Customization Overhaul v2.0-56359-2-0.7z",
      "uploadedUnix": "1406508430",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/daa8c4414add4e1414978ee4d7efbb32cc7b379b24c75caaaea60fed566a212e/analysis/1406508486/",
      "changelogHtml": " Beast Race Support <br/> \n New Racemenu Sliders to control each eye <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NK%20Eye%20Customization%20Overhaul%20v2.0-56359-2-0.7z?fid=1000119613&ttl=1535841666&ri=8192&rs=8192&setec=5a2b3f3a5fe57716900bdb4d1d017f53"
    },
    {
      "fileId": "1000120011",
      "name": "NK Eye Customization Overhaul v2.1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "NK Eye Customization Overhaul v2.1-56359-2-1.7z",
      "uploadedUnix": "1406784062",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/f78460a65e7f870bd139250e62692176cebe4a497006698de54d73d30ad3a9cf/analysis/1408173269/",
      "changelogHtml": " Optional versions - Choose between new sliders and not. <br/> \n New Sliders Version: Merged .esp files. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NK%20Eye%20Customization%20Overhaul%20v2.1-56359-2-1.7z?fid=1000120011&ttl=1535841666&ri=8192&rs=8192&setec=78c59e62712df02f015534424cc8e69b"
    }
  ]
}