{
  "modId": 56382.0,
  "modName": "Aetherius - More Alien Skyrim",
  "summary": "This mod overhauls the night sky \r<br />to make Skyrim feel like a totally alien planet",
  "descriptionHtml": "[center][size=6]Aetherius - More Alien Skyrim[/size]\r<br />\r<br />This is a quick, simple version of two of my separate night sky projects merged together. I have taken some of the most requested and liked parts of each of these mods, and wrapped it all up into one quick simple package, with no confusing options and versions. \r<br />\r<br />[size=6]So what does it do exactly?[/size]\r<br />it replaces the moon, star galaxy, sun, and constellation files. It does this to change the night sky into a far more alien looking one, more befitting of the epic fantasy that skyrim is. While not technically lore friendly, you can argue that the Dovahkiin is a borderline God, and can see the sky for what it truly is. This quote can help to explain why that may allow him to see the sky differently then mortals.\r<br />\r<br />&#34;The planets are the gods and the planes of the gods, which is the same thing. That they appear as spherical heavenly bodies is a visual phenomena caused by mortal mental stress. Since each plane(t) is an infinite mass of infinite size, as yet surrounded by the Void of Oblivion, the mortal eye registers them as bubbles within a space. Planets are magical and impossible.&#34;\r<br />\r<br />[size=6]Compatibility[/size]\r<br />Anything that edits anything in the NIGHT sky is likely to conflict&#33; Sun replacers, cloud replacers, aurora replacers are all FINE. Galaxy, moon, moonshadow, star, constellation mods WILL conflict.  This mod is designed for Climates of Tamriel, but will work perfectly fine without it.\r<br />This mod is designed to work with ENBs, but as all ENBs are different, you may have to tweak yours if something is to bright. Press Shift + Enter in game, and pull up the ENB menu, scroll down to the &#34;sky&#34; section. From here you should be able to figure it out yourself.\r<br />\r<br />[size=6]Installation/Uninstallation[/size]\r<br />[size=5]Installation;[/size]\r<br />Merge the &#34;Data&#34; folder with your &#34;Data&#34; folder, and make SURE to say yes if anything asks to overwrite&#33; Activate the More Alien Skyrim.esp. Load order position shouldn&#39;t matter, but to be safe, put after anything that edits the sky or lighting&#33; If that gives you problems, try putting it before everything that effects sky and lighting. I&#39;ve yet to encounter any conflicts with this, so these are just guesses. If you encounter any problem with this mod, \r<br />Please visit the Nexus where you downloaded this mod and post in the &#34;POSTS&#34; section\r<br />\r<br />This mod is a merger of the following mods, and should be uploaded to both of them.\r<br />[url=http://www.nexusmods.com/skyrim/mods/32972/?]More Alien Skyrim - Sky[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/48313/?]Aetherius[/url]\r<br />Posting in any either of those or on this mod page, should get a prompt response.\r<br />[size=5]Uninstallation;[/size]\r<br />Delete every single file installed by this mod. To be extra safe, you probably want to save indoors before doing this \r<br />if you are playing at night. But, I&#39;ve tested uninstalling this mod myself and simply deleting the files seems to work fine.\r<br />It is only meshes and textures, and the .esp only changes the moon sizes, there should be NO lingering effect from uninstalling.\r<br />\r<br />[size=6]Suggested Mods[/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17802/?]Climates of Tamriel[/url] works great with this mod. It is in fact designed for it. I personally suggest not using any of the exterior lighting options though, as they apply a weird &#34;sunglasses&#34; effect that can make the textures in this mod dark and desaturated. I also suggest using [url=http://www.nexusmods.com/skyrim/mods/36067/?]Vividian[/url] as your ENB/lighting mod, I personally use the Vivid Version and the Extended Weathers option, which require you also install\r<br />[url=http://www.nexusmods.com/skyrim/mods/39799/?]Climates Of Tamriel - Weather Patch[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/28110/?]Expanded Snow Systems - Climates of Tamriel Version[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27022/?]Supreme Storms[/url] (make sure to downlaod the CoT and NOT the original&#33;)\r<br />\r<br />[size=6]Credits[/size]\r<br />A lot of work from a lot of people went into this mod&#33; All content in this mod is used by ArtMurder with direct permission from the makers, or with indirect permission through their Asset Use permissions on the Nexus Mods website.\r<br />\r<br />Art Murder - Improving texture quality, editing galaxy, editing stars, sticking this entire thing together with duct tape and bubble gum.\r<br />\r<br />HXP - Galaxy and star Texture resources\r<br /> \r<br />Kriskos - Nebula\r<br />\r<br />-quaddamage21 (Original author of the planets/moons)\r<br />\r<br />Paint.net + Various Plug-Ins, I.e Shape 3d.\r<br />\r<br />Various texture libraries (license free.)\r<br />\r<br />Various DeviantART Planet and space resource textures. (all stated free to use)\r<br />\r<br />http://www.spacetelescope.org/ - Public free to use pictures of wonderful things in space.\r<br />\r<br />The Hubble Telescope\r<br />\r<br />Adobe Photoshop CS6(+CS2).\r<br />\r<br />Nexusmods.com\r<br />\r<br />Bethesda\r<br />\r<br />\r<br />If I have missed you, or you wish for me to no longer use something of yours in this mod, despite the permission given, \r<br />PLEASE CONTACT ME(ArtMurder) ON THE NEXUS FORUMS&#33;\r<br />[/center]",
  "categoryId": "74",
  "version": "1.0",
  "author": "ArtMurder",
  "createdUnix": "1406401999",
  "updatedUnix": "1406401634",
  "containsAdultContent": false,
  "uploadedBy": "ArtMurder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119372",
      "name": "Aetherius - More Alien Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10279",
      "fileName": "Aetherius - More Alien Skyrim-56382-1-0.7z",
      "uploadedUnix": "1406401634",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ecb8febb87f2943e02e80768d9d33b7449d60160a78817881a6be907723c7c91/analysis/1406401709/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherius%20-%20More%20Alien%20Skyrim-56382-1-0.7z?fid=1000119372&ttl=1535841700&ri=8192&rs=8192&setec=7a5c849768520724a2cf0d6007b207a8"
    }
  ]
}