{
  "modId": 56406.0,
  "modName": "SpeechCraft - buy crafting",
  "summary": "Buy custom-crafted items with speech and gold. Non-cheating, reasonable way to have non-crafter characters access to all craftable items via merchants. ",
  "descriptionHtml": "WHAT SPEECHCRAFT DOES\r<br />=====================\r<br />\r<br />SpeechCraft allows you to buy custom crafted items with speech skill, so you don&#39;t have to invest in crafting skills. You can access the merchant system from Honeyside. What is accessible to you depends on your Speech skill and perks.\r<br />\r<br />No longer do you have to grind crafting skills yourself to get access to what items you want. Game balance is struck the best I could, so that the player needs to advance the Speech skill, invest in perks, and to pay a fortune in gold. The balance in SpeechCraft (at least in Requiem, which I play with) is designed to work with the restriction that the player never sells items from their crafting. (Even low-end items, particularly potions, are waaay to easily mass produced for stupendous amounts of gold)\r<br />\r<br />There is an in-game book at Honeyside that has an in-character introduction as to how the &#34;SpeechCraft system&#34; is thought to abstract your access to a network of NPC crafters/middlemen. The book also has a detailed out-of-character &#34;manual&#34; on how the system works.\r<br />\r<br />COMPATABILITY\r<br />=============\r<br />\r<br />SpeechCraft uses the game&#39;s normal crafting system, so it is compatible with all mod-added items that tie to normal crafting stations.\r<br />\r<br />SpeechCraft will not automatically recognize new perks or changes to perks. It needs crafting (smithing, enchanting, alchemy) perks and speech perks. This means it needs a compatability patch for crafting and speech overhauls. \r<br />\r<br />CURRENT VERSION FOR REQUIEM ONLY\r<br />Since I don&#39;t think there&#39;s a point for making this for vanilla perks (who uses them these days), and I only use Requiem myself. Extensions to other perk overhauls should not be that involved, but currently I do not have the time to make them.\r<br />\r<br />HOW IT WORKS\r<br />============\r<br />\r<br />Technically SpeechCraft achieves this via a special crafting area, which can be accessed from Honeyside. Upon entering the area you are given crafting skills and perks according to your speech skill and perks. You can use the crafting stations with your temporary skills like normal (you still need to bring ingredients yourself). Upon exiting the area back to Honeyside you will be charged a hefty fee for every item you bring back, and of course you have your speech-based crafting skills removed.\r<br />\r<br />Think of the system as an abstraction of spending a few days going around asking various merchants, mages, blacksmiths, alchemists, black marketeers, and so on to get the items you want made for you. Your success depends on your Speech skill.\r<br />\r<br />You can enter the system via two activator &#34;notebooks&#34; in Honeyside. One for making/enchanting items, and one for tempering.\r<br />\r<br />Prices for items ordered via SpeechCraft are double what a merchant would usually sell the item for. Tempering can also be done, and costs (only) somewhat above what the item value increase is. (Still means close to 100k to temper some artifacts) ",
  "categoryId": "100",
  "version": "1.0",
  "author": "teemul",
  "createdUnix": "1406460681",
  "updatedUnix": "1406460453",
  "containsAdultContent": false,
  "uploadedBy": "teemul",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119476",
      "name": "SpeechCraftv1.rar",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18",
      "fileName": "SpeechCraftv1.rar-56406-1-0.rar",
      "uploadedUnix": "1406460453",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/00deac1b076deb7435cd149201da9348ab639afdce6e20bcf8a25e8cf6da9bbb/analysis/1406460486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpeechCraftv1.rar-56406-1-0.rar?fid=1000119476&ttl=1535841730&ri=8192&rs=8192&setec=27d2d7a0b9db77c5b4a6c6f2500c2c76"
    }
  ]
}