{
  "modId": 5641.0,
  "modName": "Gigantic Skyrim FPS Performance Patch",
  "summary": "+20 FPS In Cities\r\n+30 FPS In Wild",
  "descriptionHtml": "Follow Nix9862 on twitter for updates and information on this and more of his mods: https://twitter.com/#!/Invisible_Cries\r\n\r\nAlso check out my blog!: http://ninfreak97.blogspot.ca/\r\n\r\n\r\nA .dll file that will make Skyrim run like Oblivion. Jump from medium to Ultra in less then a minute. This works with both ATI and Nvidia. It allows for transparency AA so trees and grass will look much better if you have AA turned on. Installation and more inforation below.\r\n\r\n\r\nThis .dll will make your game run like Oblivion. \r\nYou runned oblivion on max settings? and Skyrim only on High or Medium with lags? \r\nThis file is for you! \r\nYou can jump from Medium to Ultra in less than 1 minute! \r\n================================== \r\nI was encountering lags on High settings with old .dll file, So i maked this one and now i play Skyrim on High settings without any lags! \r\nBefore i used this dll. my auto detect settings set game to MEDIUM quality after repleacing .dll auto detect settings set game to HIGH quality. \r\nAlso my FPS went up over by 10. \r\nPossible Fix for \\\"The Glowing Eye Glitch\\\" - Some dude told this fixed that glitch for him. \r\n================================== \r\nIMPORTANT: You will need program called \\\"WinRar\\\" to unpack archive. \r\nIMPORTANT: If your PC can run Skyrim on High or Ultra settings i suggest to do not use this file, however some peoples could run Skyrim on High and with this mod they now play game on ultra. \r\n++++++++++++++++++++++++++++++++++ \r\n++++++++++++++++++++++++++++++++++ \r\nVERY IMPORTANT: \r\nThis .dll is not stolen! \r\nMany peoples asked about this because there is .dll file like this one for F:NV. \r\nF:NV have its own d3d9.dll file that improves performance for it. \r\nAlso F3 have d3d9.dll that improves performance, and Oblivion. \r\nHowever all .dll are for other games, This one is for F3 and this one is for Skyrim. \r\nSo please stop spamming in comments that I stole this file. \r\nIt was made from scratch, by saying scratch i mean: \r\n\\\"From Original .dll that i got from fresh copy of game\\\" \r\n++++++++++++++++++++++++++++++++++ \r\n++++++++++++++++++++++++++++++++++ \r\n================================== \r\nThis works with both Ati and Nvidia. \r\nIt allows transparency AA so trees and grass will look much better if you have AA turned On. \r\nConfirmed by (shuriken200) First .dll works with XFX Radeon HD 5770 \r\n================================== \r\nINSTALLATION! \r\n\r\n1. Unpack archive called \\\"Skyrim Performance for Nvidia\\\" with WinRar. \r\n2. Make backup of your original d3d9.dll file - IMPORTANT \r\n3. Copy d3d9.dll File to your Skyrim folder. \r\nIt goes in your regular game folder not in the \\\"data\\\" folder with the mods. \r\n\r\nIf you placed .dll file in right place launcher will re-scan settings, and you will have to set them again how you want. \r\n================================== \r\nBUGS! \r\n\r\n- Launcher Bug: d3d9.dll file will change name of your Graphic Adapter in settings. \r\nI have Nvidia GeForce9600GT and after repleacing .dll file, in options i see GeForce 8800 GS instead of my real Graphic Adapter name - THIS REALLY DOESN\\'T MATTER! \r\n- Many peoples might get crash with Crossfire or SLI \r\n- usually crashes with XFIRE possible fix for this - In Xfire go to Tools>options>\\'game\\' tab and click on the checkbox \\\"Disable Xfire in game\\\" \r\n================================== \r\nUNINSTALLING! \r\n\r\n1. It does not change any files! \r\nJust delete .dll file you downloaded and place the old one. \r\n================================== \r\nNOTES: \r\n- Make sure you are running the launcher or .exe shortcut as administrator if you have crash when launching. \r\n\r\n- This isn\\'t lowering your Graphics! \r\n\r\n- I play game with AA on - some ppl\\'s asking if it works with AA on. \r\n\r\n- If you don\\'t have d3d9.dll in your game folder don\\'t worry! \r\nJust place my .dll in game folder and if you will want to uninstall it just simply delete it, but it\\'s still unexplained why some ppl\\'s dont have this file in game folder. \r\n\r\n- I highly recommend to lower Anisiotropic Filtering because it might lag pretty much. \r\n\r\n- Mod might don\\'t work on some Graphic Cards from GTX series and others. \r\nStill don\\'t know why it\\'s not working i will try to fix this. \r\n\r\n- Mod will work with other graphic mods like FXAA just be sure to do NOT repleace .dll file. \r\nI tested this with FXAA and it worked. \r\n\r\n- If you have issues, try updating your official DX runtime first from Microsoft, a quick google search for \\\"DirectX End User Runtime\\\" will get you what you need. \r\n\r\n- DX is card/driver agnostic, so it should run on any card, though the particular optimization in this likely favors older nVidia cards of the pre G200 cores, so 9000 and 8000 series. \r\nIf you have performance issues, instead of using this mod turn off AA and use FXAA. \r\nIn the game launcher you can find this advanced option. It is a post process (after rendering) algorithm that removes jagged edges without much loss of fidelity or framerate. \r\n\r\n================================== \r\n\r\nEnjoy! \r\nMeritus.\r\n\r\n======================================\r\nA Side Note From nix9862\r\n\r\nIf anyone was wondering i had nothing to do with this file, i had no part in making it, i was just so pleased with it i wanted to upload it to the nexus. All credit goes to Meritus.\r\n\r\nI have seen my fps increase by a big leap, in citys i now recieve 30 fps, before applying the dll i recieved 20-25 fps\r\n\r\nIn the wild i recieved 30 fps before applying the patch, i now recieve about 45-50 fps depending on my location",
  "categoryId": "84",
  "version": "1.1",
  "author": "Meritus",
  "createdUnix": "1326003807",
  "updatedUnix": "1326003858",
  "containsAdultContent": false,
  "uploadedBy": "nix9862",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17776",
      "name": "Skyrim Booster",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37",
      "fileName": "Skyrim Booster-5641-1.rar",
      "uploadedUnix": "1326003858",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5e01db49ef28cff3434f228d24c1b4afd2a0d25175ca6d8a9e51102511c6599d/analysis/1406593023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Booster-5641-1.rar?fid=17776&ttl=1535762506&ri=8192&rs=8192&setec=84d11e6972474357f45501c8be96a4d3"
    }
  ]
}