{
  "modId": 56413.0,
  "modName": "Isran Follower - Rise of a Vampire Hunter",
  "summary": "Recruit Isran, the Dawnguard leader&#33;",
  "descriptionHtml": "[center][size=20]Isran Follower - Rise of a Vampire Hunter[/size][/center]\r<br />\r<br />[quote]&#34;He was previously a member of the Vigilants of Stendarr years ago after witnessing his family&#39;s death at the hands of Molag Bal Vampire cultists, alongside Celann. Dissatisfied with the order, and the fact the Vigil found his methods &#34;extreme&#34;, they both left to form their own partnership. It didn&#39;t last long, as Celann began to disagree with some of Isran&#39;s methods. \r<br />\r<br />In 4E 201, after a recent spate of vampire attacks, Isran went on to revive an ancient order of vampire hunters known as the Dawnguard. He re-established its headquarters in Fort Dawnguard, a massive fortress deep within the Velothi Mountains and rallied new recruits in order to combat the undead menace.&#34;[/quote]\r<br />\r<br />Also available on [url=http://steamcommunity.com/sharedfiles/filedetails/?id=292118879]Steam[/url].\r<br />Please consider trying my [url=http://www.nexusmods.com/skyrim/mods/55974]Recruitable Valerica mod[/url]\r<br />and [url=http://www.nexusmods.com/skyrim/mods/55538/?]Knight-Paladin Gelebor Follower[/url]\r<br />\r<br />\r<br />[img]http://i.imgur.com/ujznNTo.jpg[/img]\r<br />This mod, which requires the official Dawnguard DLC, allows you to recruit Isran, the mighty and badass leader of the Dawnguard. You can recruit him only if you finished the main Dawnguard storyline, on the &#34;good&#34; (not vampire) side.\r<br />\r<br />Isran uses his own follower system; which means you can recruit another follower alongside him without compatibility issue. Talking about compatibility, this mod is compatible with other mods. This mod [b]is[/b] compatible with cosmetic mods that modify Isran himself. So, no known compatibility issues. This mod has been cleaned with TES5Edit and does not include dirty edits. No vanilla forms have been altered.\r<br />\r<br />\r<br />Once you tell him to wait, he will stay there forever until you come back and find him. If you make him wait in your home or somewhere else considered as a friendly location, Isran will choose to sandbox (&#34;relax&#34;) in this location. If you tell him to wait somewhere else, then he will not move until you come back.\r<br />When fired, Isran will head back to the Dawnguard Fort.\r<br />\r<br />[img]http://i.imgur.com/6e73Ebt.jpg[/img]\r<br />\r<br />Isran uses his vanilla combat style, meaning he will use his mace and his restoration spells a lot during combat. Also, I made him use his horse if you decide to travel on a horse. He will use his horn and try to find his mount.\r<br />\r<br />Isran is voiced (in English) using vanilla assets.\r<br />\r<br />One very last thing you should know, is that this mod includes a cross-mod feature. Basically, it means that Isran will react if you have my [url=http://www.nexusmods.com/skyrim/mods/55974/]Recruitable Valerica[/url] mod. If Valerica is your follower, you will either have to fire her to be able to take Isran, or have a Speechcraft high enough.\r<br />[center][youtube]dzZQGNu0LdE[/youtube][/center]\r<br />\r<br />",
  "categoryId": "96",
  "version": "1.0",
  "author": "Sagittarius22",
  "createdUnix": "1406472373",
  "updatedUnix": "1406471683",
  "containsAdultContent": false,
  "uploadedBy": "sagittarius22",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119504",
      "name": "Isran Follower - Rise of a Vampire Hunter",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "200",
      "fileName": "Isran Follower - Rise of a Vampire Hunter-56413-1-0.7z",
      "uploadedUnix": "1406471683",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/840ff82dd2a15e92cfd50a8138dadc319b4a5adfdb7268bb1f4fcfe70c498475/analysis/1406471706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Isran%20Follower%20-%20Rise%20of%20a%20Vampire%20Hunter-56413-1-0.7z?fid=1000119504&ttl=1535841744&ri=8192&rs=8192&setec=469505db442ad4f407a0f97132f3fd6d"
    }
  ]
}