{
  "modId": 56429.0,
  "modName": "Alternative Bound Weapons",
  "summary": "changes bound swords, axes and bows: +elemental dmg -time .. works other perkmods .. zusätzlich DV",
  "descriptionHtml": "Alternative Bound Weapons\r<br />\r<br />(deutsche Beschreibung unten)\r<br />\r<br />This mod changes bound swords, axes and bows. \r<br />\r<br />Time: These Spells only last 10 seconds now\r<br />-&gt; if you get conjuration dual casting perk its 25 seconds\r<br />\r<br />Damage: on Adept Difficulty (means you do 100% dmg to others)\r<br />\r<br />physical: normal bound weapons do around 20 points less dmg than legendary tempered Daedric Weapons\r<br />-&gt; if you get Mystic Binding perk (conjuration tree) you do around 20 points more dmg than legendary tempered Daedric Weapons (scales with perks of 1h, 2h and bow)\r<br />\r<br />elemental: if you get Novice Destruction perk, Bound Swords and Axes will get Firedamage, at Apprentice Destruction Perk they get additional Frostdamage, at Adept Destruction Perk they get additional Shockdamage\r<br />-&gt; Augmented Perks in Destruction Tree raise this elemental damage, if you have all Perks you will get around +100 elemental Damage to Health, 200 to Stamina and 50 to magicka with every hit (+20% with 2h weapon)\r<br />-&gt; Bound Bows won&#39;t receive elemental Damage, instead their physical Damage gets raised to +120 when you pick Novice-, Apprentice- and Adpet-Destruction-Perk\r<br />\r<br />Compability\r<br />This mod alters Bound Weapon Spells, Bound Weapons itself including Enchants of Bound Weapons, and Magic Effect of Mystic Bow\r<br />- As long as you don&#39;t change these, every other Mod will work with this\r<br />- My Mod does not alter perks or perk trees\r<br />- Works with Mods, which change Vanilla-Perks, as long as this vanilla-perks are around somehow\r<br />- Works with Mods, which change other spells etc.\r<br />- Adds no scripts, just a few tweaks in CK\r<br />- Doesn&#39;t need Dawnguard or Dragonborn\r<br />\r<br />Deutsche Beschreibung\r<br />\r<br />Ändert die beschworenen Waffen Schwert, Axt und Bogen. Die Zauber halten jetzt nur noch 10 Sekunden lang, bzw. 25 Sekunden wenn man die Dauer von Beschwörungszaubern beim dualen zaubern skillt. Allerdings machen sie mehr Schaden.\r<br />Die normalen Beschworenen Waffen machen ca 20 Schaden weniger als legendär geschmiedete daedrische Waffen, mit dem &#34;Mystische Bindung&#34;-Perk im Beschwörungsbaum machen sie ca 20 Schaden mehr als legendär geschmiedete daedrische Waffen (Skaliert mit den Perks aus 1h, 2h und Bogen). \r<br />\r<br />Äxte und Schwerter bekommen zusätzlich Elementarschaden. Wenn man im Zerstörungsbaum Novzie skillt, bekommt man Feuerschaden, bei Lehrling zusätzlich Frostschaden, und bei Adept zusätzlich Blitzschaden. Dieser Schaden skaliert mit den Perks im Zerstörungsbaum zum Verstärken der Elemente. Wenn man alle Perks hat bekommen 1h-waffen insgesamt ca 100 Schaden auf Gesundheit, 200 auf Ausdauer und 50 auf Magica, 2h-waffen bekommen ca 20% mehr\r<br />\r<br />Bögen bekommen keinen zusätzlichen Elementarschaden, anstatt dessen werden sie nach &#34;Mystische Bindung&#34; (Beschwörung) durch den Novzien-, Lehrlings-, und Adeptenperk weiter im physischen Schaden verstärkt, bis sie ca 120 zusätzlichen physischen Schaden verursachen.\r<br />\r<br />Kompatibilität:\r<br />Diese Mod verändert nur die Zauber &#34;Beschworenes Schwert&#34;, &#34;Beschworene Streitaxt&#34; und &#34;Beschworener Bogen&#34;, so wie die Beschworenen Waffen einschlieslich ihrer Verzauberungen. Zusätzlich wird noch der Magische Effekt von &#34;Mystischer Bogen&#34; verändert.\r<br />- Solange diese nicht verändert werden, funktioniert jede andere Mod damit\r<br />- Diese Mod verändert keine Perks oder Perk-Bäume\r<br />- Funktioniert mit Mods, die Perks und/oder Perk-Bäume verändern, solange die Vanilla-Perks noch irgendwie vorhanden sind\r<br />- Funktioniert mit Mods, die andere Zauber usw verändern\r<br />- Fügt keine Scripts hinzu\r<br />- Benötigt weder Dawnguard noch Dragonborn\r<br />\r<br />Credits \r<br />creation kit by bethesda\r<br />TES5Edit by ElminsterAU, Sharlikran",
  "categoryId": "93",
  "version": "1.0",
  "author": "JoeKa8",
  "createdUnix": "1406502356",
  "updatedUnix": "1406502002",
  "containsAdultContent": false,
  "uploadedBy": "JoeKa8",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119593",
      "name": "alternative bound weapons 1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "alternative bound weapons 1-0-56429-1-0.rar",
      "uploadedUnix": "1406501960",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2a1716e45a181c7dfd2d75a9b7e74422d26e50633af03fad6c2b9491a997697e/analysis/1406502016/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alternative%20bound%20weapons%201-0-56429-1-0.rar?fid=1000119593&ttl=1535841780&ri=8192&rs=8192&setec=73e424cdccb1f47774e1295bbbee1929"
    },
    {
      "fileId": "1000119594",
      "name": "alternative bound weapons 1-0 german",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "alternative bound weapons 1-0 german-56429-1-0.rar",
      "uploadedUnix": "1406502002",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4c8f08d9191f73f99e3fc9bcc6602d8fc51e2519390d87cef5df7ea8804aafb4/analysis/1406502016/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alternative%20bound%20weapons%201-0%20german-56429-1-0.rar?fid=1000119594&ttl=1535841780&ri=8192&rs=8192&setec=992d0d25f0d2cedb56ef3f7935ed2134"
    }
  ]
}