{
  "modId": 56455.0,
  "modName": "Northern Cardinal - Deutsch",
  "summary": "Der &#39;Kardinal des Nordens&#39; ist ein Handelsschiff der Osterkaiserlichen Handelsgesellschaft, der Einfluss der Gesellschaft stellt keinen Vergleich zu früheren Zeiten dar, sogar die Schiffe der Organisation haben unter dem geringen verfügbaren Schutz zu leiden. Auf jeder Reise, müssen sie sich dutzenden Gefahren gegenüber sehen, das unber",
  "descriptionHtml": "[center][img]http://i.imgur.com/IykizGF.png[/img][/center]\r<br />\r<br />[center][img]http://i.imgur.com/9dNbUSL.png[/img][/center]\r<br />\r<br />[center][img]http://i.imgur.com/gZalbOP.jpg[/img][/center]\r<br />\r<br />Keine großen Änderungen am Inhalt. Wesentlicher Bestandteil des Updates ist das MCM. Es benötigt SkyUI und wird nach dem Beenden der Quest erscheinen.\r<br />\r<br />Jedoch, mit dem Abschluss der Arbeiten am Reisesystem, wird das Hinzufügen von weiteren Orten und Bannern etc. komfortabler werden. Ich werde unter Umständen einen Location nahe Winterfeste einfügen und falls ihr weitere Banner eingefügt haben wollt, so kontaktiert mich einfach.\r<br />\r<br />Und mein Dank geht an -Ren- für den Fomod installer.\r<br />\r<br />Die kompletten Änderungen von Version 1.4 sind unter dem &#39;CHANGES Tab&#39; zu finden.\r<br />\r<br />[center][img]http://i.imgur.com/ii4igNW.png[/img][/center]\r<br />[center][b]Überblick[/b][/center]\r<br />\r<br />Brodual und Shinji72 haben beide ein Video erstellt, welches alle Inhalte und Features dieser Mod enthält, schaut euch ihre Videos an und ihr solltet genug Gründe haben diese Mod zu testen; näheres in der Beschreibung. Dank euch für die Videos&#33;\r<br />\r<br />http://www.youtube.com/watch?feature=player_embedded&v=yp5dvvvBkKAhttp://www.youtube.com/watch?feature=player_embedded&v=hC-1ghnX6JI\r<br />\r<br />Der &#39;Kardinal des Nordens&#39; ist ein Handelsschiff der Osterkaiserlichen Handelsgesellschaft, der Einfluss der Gesellschaft stellt keinen Vergleich zu früheren Zeiten dar, sogar die Schiffe der Organisation haben unter dem geringen verfügbaren Schutz zu leiden. Auf jeder Reise, müssen sie sich dutzenden Gefahren gegenüber sehen, das unberechenbare Wetter im Geistermeer und noch viel dringlicher, die derzeitigen Piratenaktivitäten. Der &#39;Kardinal des Nordens&#39; ist keine Ausnahme, er ging auf seiner letzten Mission verloren. \r<br />\r<br />Ich hatte immer das Gefühl, Skyrim würde etwas missen lassen, im Bezug auf die Meere, das Geistermeer, die Ostkaiserliche Handelsgesellschaft, die Piraten, dies sind alles sehr interessante Gedanken. Es gibt bereits Mods die dies verändern wollen und ich entschied dies auch zu versuchen. Für mich ist eine Schiffsmod, ein guter Anfang.\r<br />\r<br />[center][img]http://i.imgur.com/FDUjFmS.png[/img][/center]\r<br />[center][b]Anforderungen[/b][/center]\r<br />\r<br />Ihr benötigt Skyrim auf aktuellem Stand.\r<br />Ihr braucht an sich keine DLCs für diese Mod.\r<br />\r<br />[center][img]http://i.imgur.com/r1QsgBL.png[/img][/center]\r<br />[center][b]Beschreibung[/b][/center]\r<br />\r<br />Der Inhalt dieser Mod kann auf drei Teile begrenzt werden: einer Quest, einem Spielerheim und dutzende an neuen Orten mit neuen NPCs. Das Spielerheim, das Schiff, besitzt ein Schnellreisesystem und ein Mannschaftserwerbungssystem, welches im nächsten Abschnitt ausführlich beschrieben wird.\r<br />\r<br />[color=yellow]Die Quest[/color]\r<br />\r<br />Wo fängt es an:\r<br />\r<br />Die Quest wird automatisch nach Installation der Mod aktiviert, der Questgeber ist der Händler mit dem Namen Marcian, er befindet sich in den neuen Hafenanlagen von Einsamkeit.\r<br />\r<br />Die Quest ist selbsterklärend, das Lesen des Questlogs oder dem Folgen der Questmarker sollte ausreichend sein. Die Mod ist zu empfehlen ab einem Level von 12. Die Quest hat eine ungefähre Länge von 30 Minuten.\r<br />\r<br />[color=yellow]Das Schiff[/color]\r<br />\r<br />Nach dem Beenden der Quest und der Rückkehr in Einsamkeit, so wird die Quest aktualisiert und euch wird geraten mit dem Händler Marcian zu sprechen, um bei diesem Aufwertungen für das Schiff zu erwerben. Euch wird eine Anleitung zur Dekoration gegeben, nachdem ihr mit ihm gesprochen habt. Es gibt insgesamt fünf Pakete, Details zu diesen lassen sich in der Anleitung finden, beachtet das einige Aufwertungen Vorraussetzung für den Erwerb einer Mannschaft sind.\r<br />\r<br />Hier findet ihr ein Video, welches das Schiff voll ausgerüstet aufzeigt (von courtesy von hodilton)\r<br />\r<br />http://www.youtube.com/watch?feature=player_embedded&v=5e7kJ7EqzNM\r<br />\r<br />[color=yellow]Neue Hafenanlage in Einsamkeit[/color]\r<br />\r<br />Zu finden im selben Gebiet des Hafens von Einsamkeit. Um die Performance nicht zu beeinträchtigen, wurden nur drei Gebäude hinzugefügt: das Handelskontor für den Händler, einer Herberge und einer Schmiede.\r<br />\r<br />[color=yellow]Neue NPCs[/color]\r<br />\r<br />Hafen von Einsamkeit: \r<br />[list]\r<br />[*][b]Marcian[/b], Kaiserlicher Händler, Allgemeiner Händler, Questgeber, Bietet Schiffsverbesserungen an\r<br />[*][b]Liviana[/b], Nordseemann/Händler, Misc Favor Questgeber, Potenzieller Begleiter\r<br />[*][b]Cleland[/b], Nordseemann/Händler, Misc Favor Questgeber, Potenzieller Begleiter\r<br />[*][b]Istandir[/b], Nord, Schmied, Schmied (Händler)\r<br />[*][b]Platinis[/b], Kaiserlicher, Wirt\r<br />[*][b]Jestien[/b], Bretone, Barde\r<br />[*][b]Bolldar[/b], Nord (Schmiedelehrling), Potenzieller Schmied für das Schiff\r<br />[*][b]Gornmer[/b], Nord (Händler), Fischhändler, Questhelfer\r<br />[*][b]Alonzo[/b], Rothwardone (Händler), Pfeilhändler, Questhelfer\r<br />[/list]\r<br />\r<br />Weitere Ortschaften:\r<br />[list]\r<br />[*]Sigvand, Khajiit Alchemist, Potenzieller Schiffsalchemist, Ort: Dämmerstern Hafen, Bauernhaus\r<br />[*]Celia Ireton, Bretone (Magier), Ort: Windhelm Hafen, Bauernhaus\r<br />[/list]\r<br />\r<br />[center][img]http://i.imgur.com/KYxIa9i.png[/img][/center]\r<br />\r<br />[color=yellow]Reisesystem[/color]\r<br />\r<br />Das Schiff kann an den größeren Häfen entlang der nördlichen Küste vor Anker gehen: Einsamkeit, Dämmerstern und Windhelm. \r<br />Eine Schnellreise kann gestartet werden durch:\r<br />\r<br />[list]\r<br />[*]Aktivieren des Rades auf dem Achterdeck\r<br />[*]Aktivieren der Karte auf dem Vordeck\r<br />[*]Aktivieren der Karte in der Kapitänskajüte\r<br />[*]Mit dem Ersten Maat sprechen.\r<br />[/list]\r<br />\r<br />Sofern ihr das Dragonborn-Addon installiert habt, so kann der Hafen von Rabenfels durch ein erstes Gespräch mit dem \r<br />Kapitän Gjalmund freigeschaltet werden, nachdem ihr Solstheim das erste Mal betreten habt.\r<br />\r<br />[color=yellow]Neue Lande - Mods - Addon[/color]\r<br />\r<br />Um die Häfen für neue Lande freizuschalten, müsst ihr deren Quest bis zu einem bestimmten Punkt erfüllen um diese nicht\r<br />zu beeinträchtigen. \r<br />Für Falskaar müsst ihr die Quest &#34;Passage Home&#34; beendet haben.\r<br />Für Wyrmstooth müsst ihr die Quest &#34;Barrow of the Wyrm&#34; beendet haben.\r<br />Nachdem ihr die Questvorraussetzungen erfüllt habt, sprecht erneut mit dem Händler Marcian im Hafen von Einsamkeit, \r<br />um eure Reiserouten zu aktualisieren.\r<br />Benutzt die Karte innerhalb der Kapitänskajüte[Fett] um zu diesen Orte zu reisen.\r<br />\r<br />[color=yellow]Mannschaftsystem[/color]\r<br />\r<br />Ihr könnt bis zu neun Crewmitglieder für euer Schiff anwerben, sie werden an Bord verweilen bis ihr diese entlässt\r<br />\r<br />Es gibt drei Möglichen eure Mannschaft anzuheuern:\r<br />1) Nehmt eure Begleiter einfach mit aufs Schiff, sprecht sie darauf an sich eurer Mannschaft anzuschließen, wenn ihr\r<br />sie von deren Aufgaben entlasst, so werden sie an Bord bleiben.\r<br />2) Für die Begleiter, welche nicht aus dem Vanilla-System stammen (Serana, Interesting NPCs, oder anderen Mod-Begeleitern), gibt es ein Mannschaftstagebuch in der Kapitanskajüte, gebt dieses euren Begeleitern und eine Dialogoption wird verfügbar sein.\r<br />3) Ihr könnt einen Schmied, einen Magier, Alchemiehändlern und einen Barden auf eurem Schiff anheuern, indem sie bezüglich der Arbeit auf dem Schiff anredet. Es gibt einige NPCs nahe der Hafenanlagen, falls ihr nicht eure Vanilla-NPCs nutzen möchtet. (dies ist empfehlenswert)\r<br />\r<br />Hinweis: Ihr könnt beinahe jeden anheuern, indem ihr ihn die Taschen leert, dies ist nicht zu empfehlen, kann aber lustig sein es zu probieren.\r<br />\r<br />Arbeit auf dem Schiff - Dialoge; hängen von der Klasse des Händlers ab (Schmied, Apotheker und Händler für Zaubersprüche), während die Dialoge für den Schmied und dem Apotheker sich meist in der richtigen Klasse befinden, so sind die meisten Sprüche der Sprochrollen-Händler des Vanillaspieles nicht in der richtigen Klasse.\r<br />\r<br />Die Mannschaften werden sowohl das Innere, als auch das Äußere des Schiffes benutzen, so bevorzugen es an Deck zu bleiben, solange das Wetter gut ist. Der Schmied/Magier/Alchemist und der Erste Maat des Schiffes besitzen eigene Routinen, dadurch sind diese leichter zu finden. Einige Mitglieder der Mannschaft wird des Abends die örtliche Taverne aufsuchen.\r<br />\r<br />[color=yellow]Weitere Features[/color]\r<br />\r<br />[list]\r<br />[*]Ein Schiffsmodel um die Banner und die Gallionsfigur des Schiffes anzupassen.\r<br />[*]Aktivieren des Mastes, um zum Krähennest zu gelangen.\r<br />[*]Strickleiter an der Seite des Schiffes, um schnell und einfach aus dem Wasser zu gelangen.\r<br />[*]Neue Ambientmusik um die Orte des Schiffes.\r<br />[*]Neue Piratenwaffe: Stahlmachete (selben Attribute wie das Scitmar)\r<br />[/list]\r<br />\r<br />[color=yellow]Support Hearthfire[/color]\r<br />\r<br />Um eure Ehefrau und die Kinder aufs Schiffs zu bekommen, so benötigt ihr [url=http://www.nexusmods.com/skyrim/mods/37981/?]Hearthfire Multiple Adoptions[/url]\r<br />\r<br />1. Versichert euch, dass das Schiff in Einsamkeit/Dämmerstern/Windhelm vor Anker liegt.\r<br />2. Entlasst eure Mannschaft\r<br />3. Aktiviert das Schiffsmodell in der Kapitanskajüte, ersetzt die Betten mit denen für die Kinder\r<br />4. Benutze den Zauber &#39;Bless Home&#39; von Hearthfire Multiple Adoptions innerhalb des Schiffes\r<br />5. Sagt eurer Frau und euren Kindern, sie sollen das Schiff betreten\r<br />\r<br />Hinweis: Die KI der Kinder setzt ab und an aus, anders bei den drei Häfen, bei denen sie scheinbar\r<br />nicht hinausgehen können, so starret nicht den ganzen Tag auf sie, nach Rückkehr sollte alles wieder\r<br />in Bester Ordnung sein.\r<br />\r<br />Ihr könnt weiterhin eine Mannschaft anheuern, nachdem ihr eure Familie an Bord geholt habt, das Limit\r<br />beschränkt sich nun auf 4, da 5 Betten für die Kinder ersetzt wurden.\r<br />\r<br />[center][img]http://i.imgur.com/ggt1Cxi.png[/img][/center]\r<br />[center][b]Installation & Deinstallation[/b][/center]\r<br />\r<br />Installiere die Mod mit dem NMM oder MO. Das Dragonborn Addon wird benötigt, sofern das Dragonborn-DLC aktiv ist.\r<br />\r<br />Ihr benötigt [url=http://www.nexusmods.com/skyrim/mods/37981/?]Merge Plugins TES5Edit Script[/url]\r<br />\r<br />1. Öffnet TES5Edit und wählt die Main-ESP und die ESPs für die Addons aus, welche ihr mergen wollt\r<br />2. Wählt die ESPs in TES5Edit aus, die ihr mergen wollt -&gt; Rechtsklick -&gt; Setze Skript -&gt; Wähle &#39;Merge Plugins v1.65&#39;\r<br />3. Nehme das Häckchen bei &#39;Renumber FormIDs&#39; heraus und behalte bei dem Rest die Standard-Einstellungen\r<br />4. Wähle -- ERSTELLE NEUE DATEI -- und gebe dieser einen Namen\r<br />5. Nach dem Mergen, lösche folgende Ordner (nicht grundsätzlich nötig, aber sie sind nutzlos):\r<br />Data/Textures/Actors/Character/FacegenData/facetint/&lt;yourfilename&gt;\r<br />Data/Meshes/actors/character/facegendata/facegeom/&lt;yourfilename&gt;\r<br />Data/Sound/Voice/&lt;yourfilename&gt;\r<br />6. Benenne das ge-mergte Plugin zu NorthernCardinal.esp um\r<br />\r<br />Hinweis: Falls ihr euch an irgendeinem Punkt nicht sicher seit oder Fehlermeldungen nach dem Mergen erhaltet, so solltet ihr die Addons beibehalten, es sind lediglich zwei an der Zahl, solltet ihr die Legendary-Version nutzen.\r<br />\r<br />[center][img]http://i.imgur.com/LvmJ60N.png[/img][/center]\r<br />[center][b]Kompatibilität[/b][/center]\r<br />\r<br />[color=red]Nicht kompatibel:[/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/22821/?]Solitude Docks District[/url] \r<br />Inkompatibel in allen Aspekten, nicht patchbar.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/29443/?]Pirates of the Pacific[/url] \r<br />Hauptsächlich Clippingfehler bei den Schiffen, wenn der Kardinal des Nordens sich in Einsamkeit befindet; Navmesh - Konflikte.\r<br />\r<br />REGS - Cities.esp from [url=http://wiki.step-project.com/Pack:Explorers_Guide]A Real Explorer&#39;s Guide to Skyrim[/url]\r<br />Es fügt einen kleinen Anleger nahe des Hafens von Einsamkeit hinzu. Ihr könnt weiterhin andere individuelle Mods benutzen [...]\r<br />\r<br />[color=yellow]Halbwegs Kompatibel:[/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/13608/?]Expanded Towns and Cities[/url]\r<br />Geringere Navmesh Konflikte nahe des Sanktums bei Dämmerstern, ladet diese Mod nach ETaC.\r<br />\r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=1677559]Quest: Sea of Ghosts[/url]\r<br />Navmesh - Konflikte, cleane SoG mit TES5Edit und ladet &#39;Northern Cardinal&#39; nach Sea of Ghosts.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/50977/?]Windhelm Exterior Altered[/url]\r<br />Objekt-Klipping, benutze die Konsole oder das CK um diese Objekte zu entfernen.\r<br />\r<br />Mods, welche die Gegend um den Hafen von Einsamkeit, außerhalb vom Sanktum von Dämmernstern oder außerhalb von Hlaalus Farm [Fett] etwas verändern, werden höchstwahrscheinlich mit dieser Mod hier inkompatibel sein.\r<br />\r<br />Bitte sendet jegliche Kompatibiltätsprobleme ein, sodass sie dieser Liste hinzugefügt oder gar gepatcht werden können.\r<br />\r<br />[color=green]Kompatibel:[/color]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/14087/?]Better Docks[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/15508/?]Better Fast Travel[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/37994/?]Falskaar[/url] und [url=http://www.nexusmods.com/skyrim/mods/25704/?]Wyrmsfang[/url]\r<br />Addons für das Reisen dorthin sind verfügbar.\r<br />\r<br />[center][img]http://i.imgur.com/AcsmFDk.png[/img][/center]\r<br />[center][b]Bekannte Probleme[/b][/center]\r<br />\r<br />Einige der NPC besitzen ein leeres Inventar, sofern sie als Schmied/Magier/Alchemist auf dem Schiff erscheinen, sie sind in der Händlerfraktion aber noch nicht aktiviert, sie sind dazu da Ersatz zu leisten, sofern jemand sterben sollte.\r<br />\r<br />Alle Dialoge sind durch Vanilla-Stimmen vertont, obwohl ich mir viel Mühe gab diese aus all den tausenden zu finden und diese Dialoge zu editieren, kann es hier und da unpassend erscheinen. Ich bin kein richtiger Engländer also teilt mir meine Fehler in der Grammatik/Aussprache/Inhaltlichen Fehlern mit.\r<br />\r<br />Es mag durch die neue Worldspace bedingt schwebendes Gras geben, dies ist ein Bug und gehört zu den neuen Worldspaces, ein Fix ist hier erhältlich:\r<br />http://www.creationkit.com/Floating_Grass_Fix\r<br />\r<br />Für Falskaar/Wyrmstooth/Dawnguard Addons (und zukünftigen Addons), die NPCs werden nicht selber die Türen innerhalb des Schiffes benutzen. Dies bedeutet, dass die Mannschaft innerhalb der Orte bleiben werden und die Begleiter nicht von alleine ihren Weg nach dem Entlassen finden werden. Die Begleiter werden euch jedoch ohne Probleme rein wie raus folgen.\r<br />\r<br />Falls ihr die Startquest als welchen Gründen auch immer überspringen möchtet, so gebt dies in die Konsole ein: &#34;setstage 0shipquest 200&#34;.\r<br />\r<br />[center][img]http://i.imgur.com/XNbOVQW.png[/img][/center]\r<br />\r<br />Q: Will you make it real time sailable?\r<br />A: Not in the forseable future. While there are some mods already achieved the similar feature, such as sailable ships, airships, they all have their tradeoffs: performance issue, collisions etc. And making my ship sailable won&#39;t provide much more gameplay elements since the water system in Skyrim is terrible for ship travel.\r<br />\r<br />Q: Will you make it compatible with Solitude Docks District?\r<br />A: Unfortunately you have to choose between the two, both mods have heavy edits including landscape and navmesh which makes it almost impossible to patch.\r<br />\r<br />Q: Can you make the ship port/sail to &lt;certain location&gt;.\r<br />A: I will definitely add more locations when I improve the system to be more expandable, the current priority is Falskaar/Wrymstooth -&gt; Dawnguard -&gt; Hearthfire -&gt; others.\r<br />\r<br />Q: There are floating grass.\r<br />A: Read the Known Issue section.\r<br />\r<br />Q: Where are the Dawnstar and Windhelm Dock Farmhouses?\r<br />A: They are not at the vanilla docks, they are near the docks where the ship is harboured.\r<br />\r<br />Q: Is this mod compatible with &lt;mod not mentioned in the compatibility section&gt;\r<br />A: I&#39;m sorry but I can&#39;t test all of them by myself, you are welcomed to report any compatibility issues.\r<br />\r<br />Q: I don&#39;t like the exterior/interior model/texture of the ship, can you change that?\r<br />A: All the models used are in the creation kit already (not used in game), and I have little to none knowledge about 3D model and textures. It will be nice if anyone offers help about new model or retexure, but for now, the ship is what it is.\r<br />\r<br />Q: Will it break other quests if I clear the vanilla dungeon as the first quest objective instructed?\r<br />A: No, that is a clearable location which can be cleared and respawn anytime in game, and the quest objective actually has nothing to do with the enemies inside.\r<br />\r<br />[center][img]http://i.imgur.com/TKvKc3i.png[/img][/center]\r<br />[center][b]Zukünftig[/b][/center]\r<br />\r<br />[list]\r<br />[*]Reise und Mannschafts-System verbessert.\r<br />[*]Anpassbares Segeln.\r<br />[*]SkyUI Unterstützung.\r<br />[*]Verbesserte Funktion des Systems des Schiffes.\r<br />[*]Alternative Texturen für das Schiff.\r<br />[*]Quests hinzufügen/verbessern und Hintergrundgeschichte für die NPCs.\r<br />[*]Weitere Nebenquests.\r<br />[*]Seeschlacht.\r<br />[*]Ostkaiserliche Handelsgesellschaft/Piraten Questreihe.\r<br />[*]Weiteres \r<br />[/list]\r<br />\r<br />Obwohl die Quests nicht primär im Vordergrund stehen, erwarte ich weitere interessante Ideen zur EETC/Piratenquestreihe, welche mir weitere Motivation gibt. Einige Ideen zur Mannschaft, dem Ersten Maat sind mir willkommen.\r<br />\r<br />[img]http://i.imgur.com/ktNUdvP.png[/img]\r<br />\r<br />[list]\r<br />[*]Blary für [url=http://www.nexusmods.com/skyrim/users/2250922/?tb=mods]Open Books, Alchemy Clutter etc.[/url] \r<br />[*]Stoverjm für [url=http://www.nexusmods.com/skyrim/mods/42362/?]Open Books Library.[/url] \r<br />[*]yourenotsupposedtobeinhere für [url=http://www.nexusmods.com/skyrim/mods/17303/?]Rug Resource.[/url]   \r<br />[*]BrettM for [url=http://www.nexusmods.com/skyrim/mods/43143/?]Experiment Pack[/url] und dem [url=http://www.nexusmods.com/skyrim/mods/44434/?]Aquarium Kit.[/url] \r<br />[*]InsanitySorrow für all seine [url=http://tesalliance.org/forums/index.php?/topic/5972-list-insanitys-skyrim-resources/?]Skyrim Ressourcen.[/url]   \r<br />[*]Oaristys für das [url=http://www.nexusmods.com/skyrim/mods/16525/?]Modder Resource Pack.[/url] \r<br />[*]Ghosu für sein Einverständnis seine Piratensäbel aus seinem [url=http://www.nexusmods.com/skyrim/mods/28545/?]Weapon Pack.[/url] zu nutzen\r<br />[*]Horrorview für seine [url=http://www.nexusmods.com/skyrim/mods/12928/?]Sexy Boats.[/url]  \r<br />[*]Daemonjax für sein [url=http://www.nexusmods.com/skyrim/mods/10361/?]Just In Time Lighting Scripts.[/url]  \r<br />[*]Prometheus für seine [url=http://www.nexusmods.com/skyrim/mods/30494/?]Unfolded Sails Ship Ressourcen. [/url] \r<br />[*]TESA für sein [url=http://tesalliance.org/forums/index.php?/files/file/1330-the-tesa-skyrim-resource-kit-project/]Skyrim Resource Kit Project[/url] \r<br />[/list]\r<br />\r<br />Danke an:\r<br />\r<br />[list]\r<br />[*]AlexanderJVelicky, Darkfox127, BestInSlot and others for tutorial videos.\r<br />[*]Elianora for her amazing player house mod as inspiration for interior decorations.\r<br />[*]People who contribute to CreationKit.com\r<br />[*]All the other modders who kindly reply my questions and permission requests, even though some of them are not in the mod (yet).\r<br />[*]For creator of tools: TES5Edit, Wrye Bash, MultiXwm, Skyrim Audio Convertor, NifSkope, Unfuzer, Oscape, BSA Browser etc.\r<br />[*]All the mod reviewers who feature my mod.\r<br />[*]Bethesda for Skyrim and Creation Kit.\r<br />[*]The modding community.\r<br />[/list]\r<br />\r<br />Release Note:\r<br />\r<br />1.0: 6/18/2014\r<br />Initial release.\r<br />1.1: 6/19/2014\r<br />Removed custom muisc.\r<br />1.2: 6/30/2014\r<br />Add Falskaar & Wyrmstooth support.\r<br />1.3: 7/11/2014\r<br />Add Hearthfire & Dawnguard support.\r<br />\r<br />Erlaubniss:\r<br />\r<br />Translations are open, just PM the link when you&#39;re done so that I can add it to this page.\r<br />Permissions are needed if you want to repost the translated version to sites other than nexusmods.\r<br />Do not repost the original version to any other site in any circumstance.\r<br />\r<br />Meine andere Mod:\r<br />[url=http://www.nexusmods.com/skyrim/mods/51339/?]Bessere Falskaar und Wyrmstooth Karte mit Straßen[/url]  ",
  "categoryId": "67",
  "version": "1.4",
  "author": "dastrokes - DV von Gunter525 -OM-",
  "createdUnix": "1406582478",
  "updatedUnix": "1406582209",
  "containsAdultContent": false,
  "uploadedBy": "Gunter525",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119732",
      "name": "NorthernCardinal_Installer - Deutsch",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65233",
      "fileName": "NorthernCardinal_Installer - Deutsch-56455-1-4.7z",
      "uploadedUnix": "1406582209",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/09037686f6591dab6aac5dd47fc367bd5205493233da0bf2f0d5280ace91b01d/analysis/1406582370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NorthernCardinal_Installer%20-%20Deutsch-56455-1-4.7z?fid=1000119732&ttl=1535841822&ri=8192&rs=8192&setec=add252740e5ff4c5598a01e52d4c4b2d"
    }
  ]
}