{
  "modId": 56474.0,
  "modName": "LOHS - Lanterns on horse saddles",
  "summary": "Lets you add lanterns to your or any other horse in the game&#33;\r<br />Never search for your horse again in the dark&#33; No more cold and dark roads&#33; Only warm candlelight&#33;",
  "descriptionHtml": "[center] [/center]\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/VX6u8od.png[/img][/center]\r<br />[center][b][color=#ff8c00]Never search for your horse again&#33; No more cold and dark roads&#33; Only warm candlelight&#33;[/color][/b]\r<br />\r<br />Mod of the Week on &#34;[url=http://drakulus.com/2014/07/31/top-5-weekly-skyrim-mods-28/]Drakulus[/url]&#34;\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/1wXSO.png[/img][/url][/center][/center]\r<br />\r<br />Welcome to the LOHS - Lanterns on horse saddles BETA&#33;\r<br />[list=1]\r<br />   [*]The Mod[/*]\r<br />   [*]Compatibility and Requirements[/*]\r<br />   [*]Installation[/*]\r<br />   [*]Ingame instructions[/*]\r<br />   [*]F.A.Q.[/*]\r<br />   [*]Update history[/*]\r<br />   [*]Know issues[/*]\r<br />   [*]Merely a Framework&#33;[/*]\r<br />   [*]Future plans[/*]\r<br />   [*]Thanks and Credits[/*]\r<br />[/list]\r<br />\r<br />[size=5][b]A favor to ask from the author:[/b][/size]\r<br /> \r<br />Please report every bug you encounter (even if you are not sure if it is a bug)&#33;\r<br />Please post screenshots of your horselanterns&#33; Im sure they look beautiful and my PC is crap so I can&#39;t take nice screenshots for you guys.\r<br />Please provide as much feedback as possible&#33; Think you have a cool idea or something is missing in the mod?\r<br />USE THE COMMENT SECTION\r<br /> \r<br />[b][size=6]The Mod[/size][/b]\r<br />The main goal of LOHS is to enhance your Skyrim experience by adding lanterns to horses.\r<br />You can put candle lanterns on your own horse or any other horse in the game. Candles are lit automatically depending on the daytime or lit manually by the player. Configurable via MCM.\r<br />Never search for your horse again in the dark&#33; No more cold and dark roads&#33; Only warm candlelight&#33;\r<br /> \r<br />The mod features a (new) different way of adding candle flame particle systems to objects and is therefore more a playground of mine then a finished mod. Please keep in mind, that the mod is still in BETA. There will be bugs and I will probably update the mod quite often in the first few days after the release.\r<br /> \r<br />[size=6][b]Compatibility and Requirements[/b][/size]\r<br />This mod requires the latest (and legal&#33;&#33;&#33;) version of Skyrim. It requires no DLCs.\r<br />Although [u][b]SKSE[/b][/u] and [u][b]SkyUI[/b][/u] are not 100% necessary to run this mod but it is [u][b]highly[/b][/u] recommended that you have both, therefore they are set as a requirement on the Nexus download. Without SKSE and SkyUI you wont be able to use the configuration menu and you will be force to use the preset options (see installation and ingame instructions)\r<br />The Mod is probably compatible with any mod that does not change the model (size) of horses. If you use a mod that changes the model of the saddle and/or horse it depends on that specific mod.\r<br />- Fully compatible and intended for &#34;Convenient Horses&#34; by Alek.\r<br />- Frostfall: Lanterns do not count as heatsources \r<br /> \r<br />[size=6][b]Installation[/b][/size]\r<br />- Updating to 0.3\r<br />(you only need to do this if you had 0.1 or 0.2 installed before)\r<br />[list][*]Unintsall any version prior to 0.3. \r<br />[/*][*]Open Skyrim and load your save (all horselanterns will now disappear). \r<br />[/*][*]Save your game and close skyrim.\r<br />[/*][*]Install 0.3, overwrite if asked (see FAQ).\r<br />[/*][*]An allready equiped Lantern will probably disappear. You need to use another one (buy one if needed)[/*]\r<br />[*]You can only use one lantern per horse. Take it away and use it again if you want to change the positioning[/*]\r<br />[*]If you did unpack the BSA file from a prior version please uninstall all prior versions first before installing 0.3&#33; I dont know what will happen with &#34;leftovers&#34; that are cuased by loose files&#33; I didnt recomment unpacking them in the first place so its on you :/[/*]\r<br />[/list]\r<br />- [b]Normal[/b] \r<br />[list][*]Please download the latest version with NMM (Nexus Mod Manager) and install via NMM.\r<br />[/*][*]When installing with NMM you will have to choose one of six different lighting presets.[/*]\r<br />[*]Big, Normal and Small handle the radius of the light given by horselanterns. &#34;Normal&#34; has the same radius as the normal vanilla torch while &#34;Big&#34; has double the radius and &#34;small&#34; has half the radius.[/*]\r<br />[*]&#34;Aggressive&#34; and &#34;Fade&#34; handle the initial impact and the fading of the light given by horselanterns.[/*]\r<br />[*]&#34;Aggressive&#34; variations have a high initial light (&#34;impact&#34;) and fade very little over the radius. This gives a more scenic and warm light.[/*]\r<br />[*]&#34;Fade&#34; variations have a moderate initial light and fade progressively over the light radius. This light is oriented on the normal vanilla torch.[/*]\r<br />[*]The [u][b]recommended option [/b][/u]is &#34;Normal, Aggressive&#34; but this depends on your settings and lighting mods.[/*]\r<br />[*]If you want to switch your initial lighting preset you can just uninstall the mod via NMM and install it again immediately.[/*]\r<br />[*]Don&#39;t forget to activate the mod.[/*]\r<br />[/list]\r<br />- [b]Manual[/b] ([u][b]not recommended[/b][/u])\r<br />[list][*]Download from Nexus manually.[/*]\r<br />[*]Extract the archive and move the &#34;LOHS.bsa&#34; into your skyrim-data folder.[/*]\r<br />[*]Choose [u]one[/u] of the following folders (lighting presets) and move the &#34;LOHS.esp&#34; that is [b]in that[/b] folder into your skyrim-data folder. Bi = Big, Me = Normal, Sm = Small, Ag = Aggressive, Fa = Fade.[/*]\r<br />[*]Example: I want the small fading lighting preset so I would choose the folder &#34;SmFa&#34;.[/*]\r<br />[*]Don&#39;t forget to activate the mod. [/*]\r<br />[/list]\r<br />- [b]Mod Organizer[/b] \r<br />I hope you know what you are doing when using such a powerfull tool&#33;\r<br />Install as you would do with any other mod.\r<br />Watch Gophers [url=https://www.youtube.com/playlist?list=PLE7DlYarj-DcLS9LyjEqOJwFUQIIQewcK]Mod Organizer videos[/url] if you are not 100% sure on how to use mod organizer.\r<br />\r<br />- [b]Load order:[/b] The mod does not rely on any data from other mods. For best results (regarding this mod) load at the bottom of your loadorder (it shouldn&#39;t really matter). If you are not sure please use [url=http://loot.github.io/]LOOT[/url] to let it handle your loadorder. I dont recomment to use BOSS since it is outdated.\r<br /> \r<br />[size=6][b]Ingame Instructions[/b][/size]\r<br />- After you first installed the Mod you will be greeted with the message &#34;Welcome to the LOHS BETA&#34;\r<br />- Note: it can take up to 10 minutes for the MCM configuration menu to be added to the MCM list. Please be patient.\r<br />- Horselanterns are miscellaneous items and can be crafted at any forge using 1 iron ingot and 2 leather strips or bought in the following general goods stores:\r<br />[list][*]Markarth  - Arnleif and Sons Trading Company[/*]\r<br />[*]Riften       - Pawned Prawn[/*]\r<br />[*]Solitude    - Bits and Pieces[/*]\r<br />[*]Whiterun  - Belethor&#39;s General Goods[/*]\r<br />[*]Windhelm - Sadri&#39;s Used Wares[/spoiler][/*]\r<br />[/list]\r<br />- Once you have obtained one or multiple horselanterns they will be in your inventory under the miscellaneous items.\r<br />- To place a lantern on a horse go near the horse (10 ft ~ 3 meters range), target the horse, open inventory and equip the horselantern from your inventory. As soon as you close your inventory a menu will pop up where you can select the position of the lantern. Select your favorit position and you will receive a message that a lantern has been placed. You will then get an &#34;empty lantern sleeve&#34; which you can use in the same way as the lantern to remove a lantern from a horse (10 ft ~ 3 meters range).\r<br />- If you want to change the position of a lantern you have to use the sleeve to take it away from the horse and use the lantern again on the horse.\r<br />- Lanterns are toggle ON/OFF depending on the time of day by default, 7 pm-6 am (If you don&#39;t have SKSE and SkyUI installed you will not be able to change that&#33;). Note: it can take up to 5 seconds for a lantern to be autotoggled.\r<br />- To change the time at which lanterns are turned ON/OFF or disable/enable autotoggle open the MCM configuration menu and select &#34;LOHS&#34;.\r<br />- If you want to toggle lantern manually please deactivate autotoggle in the MCM. You will get a power that lets you toggle the lantern of a targeted horse manually.\r<br />\r<br /> \r<br />[size=6][b]F.A.Q.[/b][/size]\r<br />[b]Q: I just installed this mod and I see that it includes a &#34;ski_playerloadgamealias.pex&#34; script which conflicts with the same script from the &#34; Dance of Death &#34; mod. Is that intentional? [color=red](fixed in 0.3)[/color][/b]\r<br />A: ski_playerloadgamealias.pex is a normal script used by all mods that use MCM. It should not be included in the download as it is not needed as a single file. You can overwrite or not it doesnt matter its allways the exact same script provided by the MCM/SkyUI author (I cant even edit it). The creation kit will allways add this script to a .bsa by default if you have a MCM in your mod.\r<br />\r<br />[b]Q: LOHS wants to overwrite Wearable Lantern / There is no rule for the LOHS.esp file so I created a rule for it to come after Wearable Lanterns, does that sound reasonable since you change its textures?[/b] \r<br />A: I did not change the textures from wearable lanterns, I use the exact same&#33; Chesko gave me permission (they just happen to be included in my .bsa for people that dont have werable lanterns). Its the same as above. Just dont overwrite if you have wearable lantern installed (it doesnt matter if you do it anyways). And it does not influence the loadorder&#33; (I will move the texture to my own folder in a future release so it is clear that there is no conflict)\r<br />[b]\r<br />Q: I cant equip my horselantern&#33;[/b]\r<br />A: Please close your inventory and all other menus. Wait 10 Seconds and the try euipping it again. If this doesnt work you found a bug :) Please report it in the comment section.\r<br />[b]\r<br />Q: The light of my lanterns clips through walls, textures flicker, textures are black, textures are not properly lit. How can I fix this?[/b]\r<br />A: These issues are general problems of the games lighting engine and are not caused by this mod. I can only try to find ligthing presets that fit most peoples configurations. Sorry. You can always try another lighting preset (swap Aggressive and Fade around).\r<br />[b]\r<br />Q: Why a .bsa and not single files?[/b]\r<br />A: Easier to pack up, easier to update, no hassle&#33; Extract if you feel like it (I dont recomment this).\r<br /> \r<br />\r<br />[size=6][b]Change log[/b][/size]\r<br />[b]0.3[/b]\r<br />- There are now 4 different positions for your lantern (left, right, left back, right back)\r<br />- You can only use one lantern per horse&#33;\r<br />- adjusted the Size and positions of the Candlefalmes once more\r<br />- cleaned up some unused items, script parts etc.\r<br />- removed ski_playerloadgamealias.pex form the .BSA\r<br />[b]0.2[/b]\r<br />- Lanterns can now be dropped and picked up again. Same for sleeves.\r<br />- Adjusted the size of the candle flames, candle glow and the positioning.\r<br />[b]0.1[/b]\r<br />- Beta release\r<br /> \r<br />[size=6][b]Known Issues[/b][/size]\r<br />-Flames burn for a short time after you took a lit lantern back from a horse (that&#39;s a problem of the game and it would take a lot of time to fix it for this mod)\r<br />-?The center of the light might be to close to the Horse?\r<br /> \r<br />[size=6][b]Merely a Framework&#33;[/b][/size]\r<br />LOHS is merely a framework for future plans. Because of the way Lanterns and candle flames are used (they are actually magic effect) they can be switched out more or less &#34;easy&#34; against other effects, opening up a potential &#34;plugin&#34; option witch allows lanterns/particle systems created by other players to be used. This also means that &#34;lanterns&#34; can be placed at any creature in the game (although I prevent players from that for the moment).\r<br />Lanterns and Candle flames are actually ArtObjects that run an &#34;empty&#34; loop while having a model or particle system attached to them. Therefore they don&#39;t fill up a characters equip slots like many similar mods and can be added &#34;endlessly&#34; to a NPC/Creature.\r<br /> \r<br />[size=6][b]Future Plans[/b][/size]\r<br />I hope that I can implement more and different &#34;lanterns&#34; (meaning basically any mesh or particle system in the game or created by a modder) once the beta phase is over.\r<br />I hope that interested modders and or people that are fairly new to modding (like my self) will create content that can then be added to this mod.\r<br />If you want to stay up to date about the development of the mod and/or want to test the latest build as soon as it comes out please [url=http://forums.nexusmods.com/index.php?/topic/1942664-lanterns-on-horse-saddle-testers-suggestions/]check in on the Nexus forum[/url].\r<br />I use this threat to talk to my self and post updates on how the development is going and link alpha build for you to test and give feedback on.\r<br />Im not an &#34;arts person&#34; so creating new models an textures isnt my thing. I hope i can find someone to do that.\r<br />\r<br />[b]Working on[/b]\r<br />-multiple positions (see forum for preview)\r<br /> \r<br />[size=6][b]Thanks and Credits[/b][/size]\r<br /> \r<br />[b]Credits[/b] go to [b]Chesko[/b] for his original mod &#34;Wearable Lanterns&#34; that was used as a base for this mod in the early stages and for his permission to use his lantern and flame meshes (although I didn&#39;t use the flames in the end^^).\r<br /> \r<br />[b]Thanks:[/b]\r<br />- Huge thanks to my Alpha testers nivea and Boombro&#33; Its hard to test a mod if you know what it is supposed to do.\r<br />- Huge thanks to nivea for the beautiful screenshots&#33; My PC sucks so without her I could have drawn better pictures in MSPaint then my screenshots would have been.\r<br />- Thanks to the entire Nexus Forum Modding Community&#33; Without these guys I would still bash my head against NifSkope^^\r<br />- Thanks to my horse... that poor thing has seen a lot of straaange stuff during development^^\r<br />\r<br />[center]Be carefull please&#33; The people on r/Horses told me that you should not add lanterns to your horse IRL^^[/center]",
  "categoryId": "83",
  "version": "0.3",
  "author": "h4n4",
  "createdUnix": "1406637755",
  "updatedUnix": "1408140952",
  "containsAdultContent": false,
  "uploadedBy": "mastabenja",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119804",
      "name": "LOHS 0.1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "882",
      "fileName": "LOHS 0.1-56474-0-1.7z",
      "uploadedUnix": "1406636022",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/6a81582854417bcb06605a8030f8731c6882bfb41f66e6d21150adf7874cf634/analysis/1408172937/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LOHS%200.1-56474-0-1.7z?fid=1000119804&ttl=1535841850&ri=8192&rs=8192&setec=9ebd0584fa911bb0ac95bf970ecf8acf"
    },
    {
      "fileId": "1000120015",
      "name": "LOHS 0.2",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "918",
      "fileName": "LOHS 0.2-56474-0-2.7z",
      "uploadedUnix": "1406785556",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/7af39f91ca823294aa6956cfbd2f3df96a882f59143e7325238a1d2e65aa9834/analysis/1406785563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LOHS%200.2-56474-0-2.7z?fid=1000120015&ttl=1535841850&ri=8192&rs=8192&setec=44302cfed0300ea472d5f77776677ac7"
    },
    {
      "fileId": "1000122211",
      "name": "LOHS 0.3",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "901",
      "fileName": "LOHS 0.3-56474-0-3.7z",
      "uploadedUnix": "1408140952",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/13ccc56cd36917a59e18564fa36e9e2a858fc7ae642ada9ef82994d0a84bbfcd/analysis/1408141002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LOHS%200.3-56474-0-3.7z?fid=1000122211&ttl=1535841851&ri=8192&rs=8192&setec=7da387c0f625f451d8d6456f688a7199"
    }
  ]
}