{
  "modId": 56504.0,
  "modName": "allskill.txt - DELETED",
  "summary": "Text file containing several cheats related to skill, shout and character progression.",
  "descriptionHtml": "To use this file just place it in &#34;Data&#34; folder of your Skyrim installation. Remember this is just a cheat, so do not use it if you have a thing against cheating (i know i would :D). But if you still going to use it, before you do you should at least know what it does. It&#39;s a bat file that will progress all skills towards maximum level, unlock all perks, add extra perk points (handy if you also have custom perks other than the vanilla ones), increases skill levels over the max value of 100 (these values are in my opinion minimum necessary to have a relaxed game experience without getting beheaded by an angry sabertooth when you least expect it, if you know what i meen. also really handy with crafting and enchanting and stuff), adds some extra things like gold (who doesn&#39;t need that), soulgems (wich are good to get you started), arrows (i mostly like playing archer) and will also mod character primary stats and some secondary ones (not all of them tho; i tried to mod spellresist for example, but then i noticed you resist some of your own shouts, like summon durnehviir, wich is why i dropped it). To use it, you just have to type &#34;bat allskill&#34; in console while playing the game. No need to start a new game to use this, as far as i tested (it&#39;s just a bat cheat doh, doesn&#39;t modify the savegame other than character stats and stuff...)",
  "categoryId": "40",
  "version": "1.0",
  "author": "SeptimusRaven",
  "createdUnix": "1406732423",
  "updatedUnix": "1406732413",
  "containsAdultContent": false,
  "uploadedBy": "SeptimusRaven",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000119928",
      "name": "allskill.rar",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1",
      "fileName": "allskill.rar-56504-1-0.rar",
      "uploadedUnix": "1406732413",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cdb52790c4ebf61b3d8208bae9543044c1ef3436f70790b506b73396a8849328/analysis/1406732469/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/allskill.rar-56504-1-0.rar?fid=1000119928&ttl=1535841897&ri=8192&rs=8192&setec=c405e2ec25653bd2f70d162af466a09c"
    }
  ]
}