{
  "modId": 56530.0,
  "modName": "The Nightingale Brotherhood",
  "summary": "The Nightingale Brotherhood is a new joinable faction&#33; it provides new gang wars, quests etc. The Nightingale Brotherhood is a secret organization Nightingales possess great power and knowledge, they are masters of the blade many believe the Nightingales are masterminds while others believe the Nightingales are just a myth and don&#39;t exist",
  "descriptionHtml": "[size=10][color=purple]The Nightingale Brotherhood[/color][/size] \r<br />\r<br />[color=#ff00ff][size=6]1.2 Will be released in the future[/size][/color]\r<br />Planning to Change the names, making it more lore friendly.\r<br />[youtube]_Rkk7OeXIqM[/youtube]\r<br />\r<br />[youtube]bGqSJMh80Uc[/youtube]\r<br />\r<br />[size=3][color=yellow]Intro[/color][/size] \r<br />The Nightingale Brotherhood was formed by Selene a very talented assassin and member of the Dark Brotherhood and thieves guild&#33; The Nightingale Brotherhood is a separate branch and have their own set of rules and desires, the Nightingale Brotherhood have a different way of doing business, they are more active and are currently involved in arms trade, drug trade, warfare and much more, the Nightingale Brotherhood cooperates with Nocturnal, some members even worship Nocturnal&#33; Selene is very successful she has slain many enemies and has made much coin, she is well respected and feared&#33; She is also very dangerous and is wanted dead by many. Selene is the leader everyone admires and wants to impress, Selene attracts the men with her beauty and charm, and always gets what she wants, new recruits try their hardest to impress her and get accepted into the guild but only a few elect get accepted. Selene is a mastermind who was just an average pickpocket in the streets of Riften. She quickly rose through the ranks of the thieves guild and got a big bounty on her head by bandits and ruthless dealers. She made many allies and enemies and quickly gained influence and much power in Riften. She then had enough power and gold to set up her own guild and move up in society, she met Karliah and got introduced to Nocturnal and that&#39;s when everything changed. Selene got accepted into the Nightingales inner circle but she always wanted more and more power&#33; So she decided to run her own gang after she served Nocturnal she was free to do as she desired. Selene formed a guild of talented warriors and became very wealthy&#33; Selene is now the leader of the Nightingale Brotherhood&#33; Making her one of the most successful  leaders in the underground of Skyrim.\r<br />\r<br />\r<br />[size=3][color=purple]Oath[/color][/size] \r<br />I shall render unconditional obedience to the Nightingale Brotherhood\r<br />Though we are threatened by many evils&#33; we will not back down\r<br />We shall stand courageous on the battlefield&#33; And We shall avenge the fallen\r<br />It is better to die in battle with the enemy, then bend the knee and surrender\r<br />We shall fight For the torture and humiliation of our people\r<br />We shall fight for Freedom and Justice Honor and Glory to all the \r<br />Nightingales United we stand, divided we fall&#33;\r<br />\r<br />[size=7][color=red]Features[/color][/size] \r<br />New Joinable Faction&#33; (To Join the Nightingale Brotherhood&#33; you must complete a few quests and say the oath)\r<br />Go back and fight in the arena&#33; A feature all of us miss from The Elder Scrolls IV: Oblivion\r<br />Climb the ranks of the Brotherhood; prove yourself by completing quests and fighting in the arena&#33; The Ranks are Associate, Mercenary, Assassin, Night blade, Agent, Master, and Hero&#33;\r<br />New Quests that are unique, interesting and custom voiced&#33;\r<br />New Custom voiced NPC&#39;s and 3 New Merchants&#33;\r<br />New Teleportation spells with animated visual effects&#33;\r<br />3 New Portals the first portal is outside of Twilight, the second one is near the Throat of the World&#33; And the last one is Underwater North of Hela&#39;s Folly&#33;\r<br />Travel Back to Sovngarde; protect Tamriel from the Evil Daedra&#33;\r<br />New Gang Wars&#33; More Action&#33; More Fun&#33;\r<br />Custom Weapons and Armor&#33; (Thanks to all who gave me permission to use your work, really appreciate it&#33; :)\r<br />New Books, Letters and Journals&#33;\r<br />New Player Home&#33; Decorated with custom meshes and textures&#33;\r<br />New Creatures&#33;\r<br />Tigers- Another version of Sabrecats&#33;\r<br />Imga - Large, gorilla like creatures natives of Valenwood.\r<br />Ancient Spriggan - Tall Spriggans resembles the Spriggans from Daggerfall. \r<br />Drowner Undead - Aquatic, Undead Creatures&#33;\r<br />Rotfiend - Undead creatures, zombies&#33;\r<br />New Gangs/Factions&#33;\r<br />\r<br />[size=5][color=purple]The Nightingale Brotherhood~[/color][/size] \r<br />The Nightingale Brotherhood is a secret organization&#33; They are masters of the blade&#33; Nightingales possess great power and knowledge, many believe the Nightingales are masterminds while others believe that the Nightingales are just a myth and don&#39;t exist&#33; The Nightingale Brotherhood has great influence in Tamriel&#33; Although the Brotherhood doesn&#39;t work directly with Nocturnal, they are a separate branch and have their own set of rules&#33; The Nightingale Brotherhood governs themselves but cooperate with Nocturnal&#33; The Nightingale Brotherhood is involved in the drug trade business, warfare, arms trade and much more&#33; The Nightingale Brotherhood is also dedicated in protecting the innocent and powerless&#33; They are known to eliminate monsters, the undead, witches and wizards and all sorts of creatures that threaten society. They are the voice of the oppressed and powerless; many consider the Nightingale Brotherhood to be light in the middle of darkness. The Nightingale Brotherhood has managed to receive great power&#33; The Elite members have come into close contact with Nocturnal and have been blessed with Nocturnal&#39;s insight and have received special abilities and powers&#33; Nightingales posses’ great talent and power&#33; They often move like the shadows&#33; And rarely lose a fight&#33; To get accepted in the Brotherhood you have to be the best of the best, and you must prove that you are worthy to become part of the Nightingale Brotherhood&#33; Once you are accepted, the Nightingale Brotherhood has a set of Ranks, many members try their best to reach the top but only a few manage to climb the ranks and become a hero&#33; The first rank in the Nightingale Brotherhood is Associate, the individual has joined the Nightingale Brotherhood and shows interest in the organization&#33; The Second rank is Mercenary the individual has great potential. The Third rank is Assassin the individual has completed more than two contracts and has survived a few battles. The fourth rank is Night blade, the individual is a force to be feared and has shown great power and is well rounded&#33; The fifth rank is Agent, few reach this level as it involves more than brute strength but strategy and tactics&#33; The Sixth rank is Master or Commander&#33; An individual has gained much respect and honor and has major influence among the Nightingales&#33; The final rank is Hero&#33; only a few reach this level&#33; the individual possesses great power and has made a huge impact on the Brotherhood&#33; The individual is admired, respect and honored&#33;\r<br />\r<br />[size=5][color=red]Blackwood Wizards~[/color][/size] \r<br />The Blackwood Wizards was a secret organization born in the realms of the dead lands deep in Oblivion&#33; The Organization was formed by a Dremoran named Rekim he is extremely evil&#33; The Blackwood Wizards are a secret organization and posse’s great power and magic&#33; The Blackwood Wizards are entirely wicked and work directly with the evil daedra&#33; A very rebellious and evil spirit is rising in Tamriel&#33; The Blackwood Witches are extremely dangerous and lurk around in caves and secluded areas performing forbidden rituals and are shunned by society they only come out to spill blood and commit wicked deeds&#33; They enjoy war and the lamentation of mortals&#33; The Nightingale Brotherhood is concerned about the well being of humans and is dedicated to murder all the monsters and evil creatures that pose a threat to society&#33; Many believe the return of the Blackwood Wizards is the reason why so many foul creatures are returning to Skyrim such as Zombies, Ancient Spriggan&#39;s and more&#33; The Nightingale Brotherhood has taken matters into their own hands and has sworn to eliminate all the Blackwood Wizards&#33;\r<br />\r<br />[size=5][color=yellow]The Ronin[/color][/size] \r<br />The Ronin are extremely dangerous&#33; They are a secret organization that was born in Akavir&#33; The Ronin are highly disciplined and trained in the art of combat&#33; They value prestige and social standing. The Ronin are diplomatic, but love to wage war&#33; The Ronin are fearless in battle and are trained at a very young age&#33; Most Ronin rather take their own life then be humiliated&#33; The Ronin favor honor and respect and will never bow down to their enemies&#33; Once the Ronin came to Skyrim, they felt superior and planned to conquer many areas in Skyrim&#33; They started getting into the drug trade business and got rather reckless&#33; They started killing anyone who would get in their path or go against them&#33; The Nightingale Brotherhood did not cooperate with the Ronin on their arrival and refused to work with them&#33; In return the Ronin despised the Nightingale Brotherhood&#33; The small grudges lead to a small dispute which leads to a few assassinations&#33; Now the Ronin have declared war against the Nightingale Brotherhood, all over their pride and ego&#33; Ronin Warriors have become allies with the bandits and outlaws in Skyrim&#33; They plan to make much gold in Skyrim&#33; And don&#39;t plan to leave the land&#33; They are involved in many crimes such as the drug trade business, arms trade&#33; Warfare, gambling and much more&#33; There is also a set of ranks&#33; Silver Eagles are those gifted with the bow making them a very deadly warrior from a distance. There is also the Golden Tigers these Assassins are gifted with the blade&#33; and can cast a cloak of flame around them&#33; There is also the Golden Dragons which is a well rounded and dangerous Assassin. The Ronin have much experience in battle they have fought with many different creatures and monsters such as the Snow Demons of Kamal, the serpent-men of Tsaesci&#33; And the Monkey People of Tang Mo&#33; Making the Ronin one of the, fiercest warriors in all of Nirn.\r<br />\r<br />[size=5][color=Grey]Uruk Hai[/color][/size] \r<br />The Uruk Hai is a more advanced breed of Orcs&#33; The Uruk Hai is a small army&#33; They are considered to be one of the most dangerous forces in Tamriel&#33; They are repulsive and vicious creatures&#33; The Uruk Hai are masters of combat and take what they want when they want it&#33; The Uruk Hai are shunned by most of society&#33; Only the underworld accepts the Uruk Hai&#33; Most Uruk Hai&#39;s live in caves and secluded areas they are atrocious creatures&#33; The Uruk Hai are vicious in battle and love waging war&#33; The enjoy spilling blood and abuse&#33; The Uruk Hai are also Cannibal&#39;s and are known to eat human flesh, they are considered to be savages and are avoided at all costs by the common people&#33; The Uruk Hai are working with witches, wizards, the undead and the Evil daedra, they are planning to take over Skyrim and rule it with an Iron fist&#33;\r<br />\r<br />[size=5][color=red]Battle/War Locations[/color][/size] \r<br />\r<br />Blackwood Wizards&#33;\r<br />Broken Helm Hollow (Blackwood Wizards)\r<br />East of Twilight (Nightingale Brotherhood Vs Blackwood Wizards)\r<br />North Of Brittleshin Pass&#33; (Nightingale Brotherhood Vs Blackwood Wizards)\r<br />Bannermist Tower (Blackwood Wizards)\r<br />Sunderstone Gorge (Blackwood Wizards)\r<br />Falkreath Watchtower (Blackwood Wizards)\r<br />North of Autumn Shade (Blackwood Wizards)\r<br />\r<br />\r<br />The Ronin&#33; (Akaviri Warriors)\r<br />Uttering Hills Cave (Nightingale Brotherhood Vs The Ronin)\r<br />GloomReach&#33;(Nightingale Brotherhood Vs The Ronin)\r<br />East Of PineWatch&#33; (Nightingale Brotherhood Vs The Ronin)\r<br />Halted Stream Camp&#33; (The Ronin)\r<br />The Lady Stone&#33; (The Ronin)\r<br />The Lover&#39;s Stone (The Ronin)\r<br />South Of Half Moon Mill (Nightingale Brotherhood Vs The Ronin)\r<br />\r<br />THE URUK HAI&#33;\r<br />Rebel&#39;s Cairn&#33;(Nightingale Brotherhood Vs The Uruk Hai)\r<br />Reach Wind Eyrie&#33;(Nightingale Brotherhood Vs The Uruk Hai)\r<br />Lost Prospect Mine (Nightingale Brotherhood Vs The Uruk Hai)\r<br />Wreck Of The Pride of Talos&#33;(Uruk Hai & &#34;Aquatic&#34; Drowner Undead)\r<br />Hela&#39;s Folly (Uruk Hai)\r<br />Refugee&#39;s Rest&#33; (Uruk Hai)\r<br />\r<br />Creatures/Monsters&#33;\r<br />East of Twilight (Imga&#39;s) You must start the Blackwood Wizards quest for most creatures to spawn&#33;\r<br />East of Twilight (Ancient Spriggans)\r<br />Lunds Hut (The Undead)\r<br />Solitude Hall of the Dead Catacombs&#33;(Undead)\r<br />Whiterun Hall of the Dead (Undead)\r<br />Markarth Hall of of the Dead (Undead)\r<br />High Gate Ruins (&#34;Aquatic&#34; Drowner Undead)\r<br />Hela&#39;s Folly (Drowner Undead)\r<br />Riften Docks (&#34;Aquatic&#34; Drowner Undead)\r<br />Uttering Hills Cave (The Undead, Zombies)\r<br />The Ronin have tamed the vicious (Tigers) the tigers are known to support them in most areas.\r<br />The Blackwood Wizards have tamed the (Imga&#39;s) they are known to support them in some areas.\r<br />\r<br />Arena&#33; \r<br />Blackwood Wizards, Ronin, Uruk Hai, Tigers, Imga&#39;s\r<br />\r<br />\r<br />[size=5][color=blue]Main Quest[/color][/size] \r<br />\r<br />1. Shadows of Death&#33; \r<br />Meet one of the scouts of the Nightingale Brotherhood outside the Twilight Sepulcher&#33; The Scout informs you that the key to the portal of the Nightingale Brotherhood base has been stolen by witches&#33; The Blackwood Wizards are planning to bring the key to the deadlands to their master Rekim&#33; And plan an attack and take over their base&#33; The Scout informs you that you have a shot at joining the brotherhood if you retrieve the key and terminate the witches&#33; As you return The Scout betrays you and tells you to hand over the key, it’s clear he&#39;s tired of being a scout and wants Selene to notice him&#33; (Broken Helm Hollow)\r<br />\r<br />2. Blackwood Wizards&#33;\r<br />The Leader of the Blackwood Wizards is bitter and angry he comes from the deadlands himself to take over the Nightingale&#39;s Brotherhood base&#33; Together he leads a small army marching towards twilight; together with his clan he spawns Ancient Spriggans to do his bidding&#33; Selene informs you that the base is in danger and she needs help in the battlefield, and offers you a contract to prove yourself to the Nightingale Brotherhood and defeat the leader of the Blackwood Wizards. (East of Twilight)\r<br />\r<br />3. Prisoner Of War&#33; \r<br />Selene the Leader of the Nightingale Brotherhood informs you that the Commander of the Nightingale Brotherhood was ambushed near windhelm and has been kidnapped by the Ronin it&#39;s up to you to save the day&#33; (Uttering Hills Cave)\r<br />\r<br />4. Desperate Justice&#33;\r<br />Selene proposes another contract for you&#33; You are to eliminate the Ronin, and interegote The Ronin Advisor&#33; (GloomReach)\r<br />\r<br />5. Time for Revenge&#33;\r<br />You have been sent (East of Pinewatch) to defeat the Ronin and avenge the fallen Nightingales&#33;\r<br />\r<br />6. Through A Nightmare&#33;\r<br />Selene informs you that the Leader of the Blackwood Wizards you eliminated in the beginning&#33; Was supposed to end up in the Deadlands&#33; But he found a loophole and ended up in Sovngarde&#33; He&#39;s trying to find another loophole and end up in Tamriel&#33; The balance and order of things is at stake&#33; Selene proposes a contract for you&#33; You are to travel to teleport to Sovngarde and execute The Leader of the Blackwood Wizards again&#33; And send him back to the Deadlands&#33; (Sovngarde)\r<br />\r<br />More Side Quests from Selene&#33;\r<br />\r<br />1. Till Death Do Us Part&#33;\r<br />Selene demands justice for Mika&#33; Vladimir has gone insane and killed Mika in cold blood&#33; For refusing Vladimir&#39;s marriage proposal&#33; Mika can be found in the room next door to Selene&#33; As you investigate the scene you find Mika&#39;s body, flowers all over the floor, love letters and a bloody dagger&#33; Selene proposes a contract for you and informs you that Vladimir usually hangs out in Whiterun and usually contacts the dead&#33; (Whiterun, Hall of the Dead)\r<br />\r<br />2. Just Business&#33;\r<br />The Nightingale Brotherhood usually deals with the drug dealers from Morrowind&#33; But this Selene&#39;s Drug Shipment never arrived&#33; Selene wants you to invistegate Hella&#39;s Folly which was the place where the drug deal took place&#33; (Hela&#39;s Folly)\r<br />\r<br />3. More Unfinished Business&#33;\r<br />The Uruk Hai weren&#39;t bluffing when they said they were coming for Soran&#33; The Uruk Hai attack the living Quarters in the Nightingale Brotherhood base looking to eliminate Soran for killing a Commander of the Uruk Hai&#33; (To unlock this quest you must complete Unfinished Business&#33; from Soran)\r<br />\r<br />4. In Too Deep&#33;\r<br />There is more to Sonia&#39;s Case&#33; Sonia made a drug deal with the Ronin which backfired, she then tried to flee to her hideout near Winterhold but She got ambushed and kidnapped by the Ronin&#33; Some agents have told Selene that there might be a missing drug shipment where the deal took place.\r<br />\r<br />Quest from Robin (Fully Voiced)\r<br />\r<br />1. Pit Fighter\r<br />First battle in the Windhelm arena&#33; You face an Imga and a Witch&#33;\r<br />\r<br />2. Path Of The Assassin&#33;\r<br />The Second battle in the Arena&#33; You face a few Ronin and a tiger&#33;\r<br />\r<br />3. Proving Grounds&#33;\r<br />The third battle in the arena&#33; Robin captured some Ronin and promised them that if they survived he would set them free&#33; Will you be their worst nightmare or will they be your worst nightmare?\r<br />\r<br />4. Uruk Hai Warriors\r<br />Your fourth battle in the arena, this time you face the Uruk Hai Warriors&#33;\r<br />\r<br />5. Blood Bath&#33;\r<br />The Uruk Hai has threatened the Nightingale Brotherhood&#33; and have eliminated a few Nightingales, Robin proposes a contract for you to help the Nightingale Brotherhood defeat the Uruk Hai Warriors on the west side of Skyrim&#33; (Reach Wind Eyrie)\r<br />\r<br />Quest from Inari Nightingale Agent\r<br />\r<br />1. Drug Shipment&#33;\r<br />Inari wants to steal a drug shipment in Lost Prospect Mine&#33; He holds bitter feelings towards the Uruk Hai Warriors as they murdered his father&#33; Inari also wants to me to avenge his father&#39;s death&#33;\r<br />\r<br />Quest from Soran&#33; Nightingale Agent&#33; (Fully Voiced)\r<br />\r<br />1. Unfinished Business&#33;\r<br />Soran executed a former Commander of the Uruk Hai Warriors with a powerful sword called the Ice Blade&#33; He now has a price on his head&#33; And had to flee his home to live in the Nightingale&#39;s Base for his own safety&#33; He then returns to check on his wife and retrieve his Ice blade to fight in the arena to make more gold&#33; But as he arrived&#33; His wife was kidnapped and held at ransom&#33; The Uruk Hai left Soran a letter and promised him that if he sent a payment of 10,000 gold they would release her&#33; But Soran already sent the gold&#33; And hasn&#39;t received any news about his wife&#33; or the Ice Blade&#33; Soran asks for help to save his wife, eliminate the Uruk Hai and retrieve the Ice blade&#33;\r<br />\r<br />[size=blue][color=red]People Of Interest[/color][/size] \r<br />Selene (Leader of The Nightingale Brotherhood) Level 80-200 \r<br />Robin (Commander of the Nightingale Brotherhood) Level 100-200\r<br />Aeron (Nightingale Merchant)\r<br />Aria (Nightingale Agent/Merchant) Level 70 - 200\r<br />Donald (Khajiit Nightingale Agent/Blacksmith)\r<br />Inari (Khajiit Nightingale Agent) Level 50-200\r<br />Mika (Nightingale Associate)\r<br />Riane (Nightingale Mage) Level 50-200\r<br />Soran (Nightingale Agent)\r<br />Sonia (Nightingale Commander)\r<br />\r<br />[size=5][color=red]Requirements[/color][/size] \r<br />Skyrim.esm\r<br />Latest Update 1.9\r<br />\r<br />Future Plans&#33;\r<br />The Mod is complete&#33; Voice actors are welcomed&#33; I prefer experienced users that can dominate the creation kit or at least know the basics&#33;\r<br />I was going to add another faction in this mod with their own custom armor and weapons&#33; But I decided to just have 4 new factions, and save the other faction for another mod&#33; \r<br />Now that I finished this mod I want to set my next project on creating a new world where you can travel back and forth from Skyrim&#33; This will be my next project&#33; I&#39;m planning to add \r<br />More quests&#33; New factions and a new tropical world&#33; As for now The Nightingale Brotherhood is in it&#39;s complete stage&#33; Unless other modders are willing to do some voice acting&#33; \r<br />If modders are interested in doing voice acting the entire quests in the creation kit will appear if you type in TNB&#33; So if you’re interested in doing voice acting Just send me a message and let me know.\r<br />\r<br />Author&#39;s Note&#33;\r<br />Bethesda is one of my favorite gaming studios&#33; I been a big fan since Morrowind came out&#33;\r<br /> As a full time college student, I spent over a month on this mod&#33; And I believe it&#39;s complete unless people would like to do some more voice acting&#33; \r<br />I treat my mods like projects&#33; And Skyrim is my favorite game right now&#33; So I mainly make mods for my own pleasure and entertainment&#33; \r<br />You can expect to find no bugs in this mod&#33; If you do it might be a compatibility issue&#33; I tend to be a perfectionist and everything just has to feel right and accurate. I wanted to mention that I&#39;m very respectful of other&#39;s \r<br />people&#39;s work, I&#39;m a modder and I know modding is hard work That&#39;s why I really appreciate those who make resources, and grant permission for other moddders to use their great work&#33; I have\r<br />Been on the nexus for a few years&#33; And The Nexus has become my favorite modding site&#33; I love the community here and I have complied with the rules over the years&#33; Honestly it&#39;s been a \r<br />Pleasure and honor to be part of this community I would never behave like a troll because I&#39;m a very respectful and nice person. I would never use someone else&#39;s work unless they have given\r<br />Me permission themselves or it&#39;s clearly stated that modder&#39;s can use assets of their work without permission as long as we give them the credit etc. If any issues or questions arise with the content\r<br />Within this mod send me a message or comment and I would be glad to comply, &#34;act in accordance with a wish or command&#34;.\r<br />\r<br />Permission&#33;\r<br />If you want to use some of the contents in this mod for your own project or mod&#33; Please ask the authors I credited&#33; I had to ask a lot of people for permission to use custom armors and weapons etc. So please respect the wishes and desires of the other author&#39;s, be courteous and ask for permission first.\r<br />\r<br />[size=5][color=blue]Credits[/color][/size] \r<br />Disclaimer: All custom weapons, armors and objects included in this mod are part of the resource mods or permissions have been granted by the authors themselves and in most cases permission was not necessary unless we give them the credit as they stated themselves&#33; \r<br />If any complications or issues arise send me a message or comment and I would be glad to comply&#33; &#34;Act in an accordance with a wish or command&#34;.\r<br />\r<br />I want to thank [url=http://www.nexusmods.com/skyrim/users/3140055/?]Zero Frost[/url] for giving me permission himself to use his armor mod The Evil master mind armor&#33; Its clear ZeroFrost is one of the best modders&#33;\r<br />I want to thank [url=http://www.nexusmods.com/skyrim/users/258945/?]InsanitySorrow[/url]for all his amazing mods and modder&#39;s resources&#33; by far one of the greatest Modder’s&#33;\r<br />I want to thank mandarinn for giving me permission himself to use the Uruk-Hai Armor in this mod&#33; Thank you so much&#33; And great job on the models&#33; :)\r<br />I want to thank hifoo&#33; For the Ronin Outfit&#33; Splendid job&#33;\r<br />I want to thank Sushiyant for the Ariyan Weapon Pack&#33; and also for the meshes and textures&#33; VengenceMkII, Adonnay, Hel Borne, mbj_mje&#33;\r<br />I want to thank DarkRider (Darkrder) for the Celtic Decor for Skyrim I&#33; The paintings are beautiful&#33;\r<br />I want to thank&#33; Runspect and Adele for the Resources for modders&#33; :)\r<br />I want to thank stoverjm and blary for the open books resource and library&#33;\r<br />I want to thank GendunDrup for the Nexus Creature Resource&#33;\r<br />I want to thank CD Projekt Red, (The Witcher, The Witcher 2) Models used in this mod&#33; (Drowner undead) & (Rotfiend)\r<br />I would also like to thanks Newermind43 - (Ancient Spriggan) \r<br />I would also like to thank frankthefish (Tiger)\r<br />I would also like to thank&#33; exray catt, KANRAx2, muppetpuppet, Grohiik, Ph0rce, cansu, Dogtown1, MrCasual, Leodoidao, Penguinchao, AnTiWoMaAgNoT.\r<br />I want to thank Oaristys for the modder&#39;s resource pack&#33; Great job&#33;\r<br />I want to thank Apachii for Apachii Sky Hair&#33;\r<br />I want to thank sa547 for the wanted poster&#33;\r<br />I want to thank Darkfox127 for his great mods and great tutorials&#33;\r<br />I want to thank the Skyrim Nexus Community; personally I believe Nexusmods is one of the best modding website I have come across&#33; I&#39;m honored to be part of this community&#33;\r<br />I want to thank the creators of the site and the people that help keep the site running, Robin Scott, The supporters, administrators and moderator&#39;s.\r<br />I want to thank Bethesda for creating the Elders Scrolls Series, and the Creation kit. By far one of the best open ended RPG games ever created&#33; \r<br />\r<br />On a Personal Note&#33;\r<br />I believe I gave credit to everyone&#33; If I&#39;m missing anyone please let me know and I&#39;ll update the list promptly&#33; I want to thank all the people who gave me permission to use their work, \r<br />But due to timing and space the content didn&#39;t end up in final release of the mod. By the time I was granted permission from other mods I was already doing voice acting and past gathering the resources\r<br />I needed to make this mod better&#33; I really appreciate your kindness&#33; It means a lot&#33; I&#39;m glad to be part of this community my respects and honor to all who have given me permission&#33; And have made great resources\r<br />Available to modders again I really appreciate it&#33; I want to thank everyone that has supported me, gave me compliments, endorsements and kudos. It means alot&#33; I also appreciate those great \r<br />modders who have taken time out of their schedule to reply to my messages and have given me support, and great advice&#33; Cheers&#33; :)",
  "categoryId": "25",
  "version": "1.1",
  "author": "RayneRed",
  "createdUnix": "1406785668",
  "updatedUnix": "1406785385",
  "containsAdultContent": false,
  "uploadedBy": "Raynel07",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120013",
      "name": "The Nightingale Brotherhood Vanilla",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122371",
      "fileName": "The Nightingale Brotherhood Vanilla-56530-1-1.zip",
      "uploadedUnix": "1406784867",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/23472ca6dcc860a56bc4ce04d1cf26f0998c61cd26d689a6338c74dd4b938d57/analysis/1406785013/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Nightingale%20Brotherhood%20Vanilla-56530-1-1.zip?fid=1000120013&ttl=1535841939&ri=8192&rs=8192&setec=c37e1e8eb5836f47dad816d4b6719398"
    },
    {
      "fileId": "1000120014",
      "name": "The Nightingale Brotherhood Apachii",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "155989",
      "fileName": "The Nightingale Brotherhood Apachii-56530-1-1.zip",
      "uploadedUnix": "1406785385",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ddf45e618ca16a48188cef46844f7edfda2b2090f9debb5df15fbc15f23ebd60/analysis/1406785589/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Nightingale%20Brotherhood%20Apachii-56530-1-1.zip?fid=1000120014&ttl=1535841939&ri=8192&rs=8192&setec=0294f08cc19ee9b8343523f88e7e4b9a"
    }
  ]
}