{
  "modId": 56541.0,
  "modName": "Darkwaters Pavilion - EN and FR",
  "summary": "A little cottage based on Ravenrock architecture and &#34;Elsweyr-like&#34; environnement. It is located near Ivarstead, against huge waterfalls. I built it for myself and just wanted to share it.",
  "descriptionHtml": "[center][size=16][color=mediumvioletred]Darkwaters Pavilion / Logis de Sombreflot[/color][/size][/center]\r<br />\r<br />[center][b][color=blue]ENGLISH - INTRODUCTION[/color][/b][/center]\r<br />Hello Everyone &#33;\r<br />Here&#39;s my very first mod, as known as &#34;Darkwaters Pavilion&#34;. It is a little cottage based on Ravenrock architecture and surrounded by &#34;Elsweyr-like&#34; environnement (plants). It is also full of respawnable alchemical ingredients.\r<br />[b]This is probably not lore-friendly[/b], and it is a house probably only for solitary dragonborns. However, if you want to bring your spouse in this pavilion, i suggest you to use Spouses Can Live Everywhere by Emma : http://www.nexusmods.com/skyrim/mods/11370/?\r<br />\r<br />[center][b][color=blue]ENGLISH - LOCATION[/color][/b][/center]\r<br />I let you discover of what the house looks like with the screenshots, but it is located near Ivarstead. Though if you already visited the upper level of the Darkwater Passage in Skyrim, you just have to fast travel right there.\r<br />For people who did&#39;nt discovered the Darkwater Passage yet, i suggest you to fast travel to Ivarstead and follow the dirt route, toward the High Hrothgar bridge. Attention &#33; Don&#39;t pass the bridge and continue your walk to the tiny dirt route &#33; Finally, a settlement icon will appear to the east, and it is Darkwaters Pavilion &#33; Just keep to follow the route and you will find it.\r<br />\r<br />THE KEY OF THE HOUSE IS ON THE TABLE AT THE TERRACE &#33;\r<br />\r<br />[center][b][color=blue]ENGLISH - INSTALLATION[/color][/b][/center]\r<br />[center][color=lightblue]ENGLISH - NEXUS USERS[/color][/center]\r<br />1. Download the EN file.\r<br />2. Install the file via your Nexus Mod Manager.\r<br />3. Done &#33;\r<br />[center][color=lightblue]ENGLISH - NON-NEXUS USERS[/color][/center]\r<br />1. Download the EN file.\r<br />2. Open the .rar archive with Winrar/7zip/AlZip/... \r<br />3. Unpack the files in you Skyrim Data Folder.\r<br />4. Done &#33;\r<br />\r<br />[center][color=lightblue]ENGLISH - REQUIREMENTS[/color][/center]\r<br />This mod unfortunately requires all the DLCs. I tried to add the meshes, textures and all things i used from Dragonborn and Dawnguard in a bsa file, and also with loose files, but it just failed. I withdrew my DLCs to test if the textures were functional, but... It just does&#39;nt work, even if these exact files are in your Data game folder. That&#39;s why Gleamblossoms and Soul Husks are&#39;nt functional and can&#39;t be harvested : they come from extracted Dawnguard bsa file and are just &#34;static-like&#34; objects. Maybe i&#39;ll fix this later if it is really a problem for the users of this Mod.\r<br />\r<br />N.B.: If you don&#39;t own Dawnguard, you still can have this Mod (but Dragonborn AND Hearthfires are really required). Gleamblossoms and Soul Husk will simply disappear. No bugs, no crash.\r<br />\r<br />[center]-----------------------------------------------------------------------------------------[/center]\r<br />\r<br />[center][b][color=red]FRANCAIS - INTRODUCTION[/color][/b][/center]\r<br />Salut, tout le monde &#33;\r<br />Ceci est mon tout premier Mod, connu sous le nom de &#34;Logis de Sombreflot&#34;. C&#39;est un petit pavillon basé sur l&#39;architecture de Corberoc et entouré d&#39;un envirronnement &#34;Elsweyr&#34; (les Plantes). C&#39;est également plein d&#39;ingrédients alchimiques capables d&#39;être récoltés. Pour ceux qui ont le jeu traduit en Français, attention, il y a un soucis de réapparition de ces plantes, et je vous suggères de vous dégoter le patch non-officiel fourni par Wiwiland. Plus d&#39;informations ici : http://skyrim.wiwiland.net/spip.php?article49\r<br />\r<br />[b]Cette maison n&#39;est probablement pas fidèle à la tradition de Bordeciel[/b], et est sûrement plus une maison pour des Enfants de Dragons solitaires. Cependant, si vous désirez amener votre compagne/compagnon ici, je vous suggère également d&#39;utiliser Spouses Can Live Everywhere par Emma : http://www.nexusmods.com/skyrim/mods/11370/?\r<br />\r<br />[center][b][color=red]FRANCAIS - LIEU[/color][/b][/center]\r<br />Je vous laisse découvrir à quoi la maison ressemble grâce au imprim&#39;écran, mais c&#39;est situé près de Fort-Ivar. Cela dit, si vous avez déjà découvert le niveau supérieur du Passage de Sombreflot en Bordeciel, il vous suffit de faire un voyage rapide vers là et vous serez face à la maison.\r<br />Pour ceux qui n&#39;ont pas encore découvert le Passage de Sombreflot, je vous suggère de faire un voyage rapide vers Fort-Ivar et de suivre la route de terre, en direction du pont qui mène au Haut Hrothgar. Attention &#33; Ne passez pas le pont et continuez votre marche sur la petite route de terre &#33; Enfin, une icône de maison apparaîtrea vers l&#39;Est et ce sera le Logis de Sombreflot &#33; Continuez simplement de suivre la route et vous la trouverez.\r<br />\r<br />LA CLE DU LOGIS EST SUR LA TABLE DE LA TERRASSE.\r<br />\r<br />[center][b][color=red]FRANCAIS - INSTALLATION[/color][/b][/center]\r<br />[center][color=coral]FRANCAIS - UTILISATEURS DU NEXUS[/color][/center]\r<br />1. Téléchargez le fichier FR de ce Mod.\r<br />2. Installez-le via le Nexus Mod Manager.\r<br />3. Gagné &#33;\r<br />[center][color=coral]FRANCAIS - UTILISATEURS CLASSIQUES[/color][/center]\r<br />1. Téléchargez le fichier FR de ce Mod.\r<br />2. Ouvrez l&#39;archive .rar avec Winrar/7zip/AlZip/... \r<br />3. Dépaquettez les fichiers dans votre dossier &#34;Data&#34; de votre jeu Skyrim.\r<br />4. Gagné &#33;\r<br />\r<br />[center][color=coral]FRANCAIS - EXIGENCES[/color][/center]\r<br />Ce Mod requiert malheureusement tous les DLCs. J&#39;ai tenté d&#39;ajouter les meshes, textures et autres choses que j&#39;ai utilisé provenant de Dawnguard et Dragonborn, autant dans un fichier bsa qu&#39;avec des &#34;loose files&#34;, mais ça a juste raté. J&#39;ai retiré mes DLCs pour tester si les textures et les meshes étaient fonctionnelles, mais... Ca ne marche tout bonnement pas, même si tu as le fichiers extraits du jeu dans ton dossier Data. C&#39;est pour ça que les Brillefleur et les Cônes des Âmes ne fonctionnent pas et ne peuvent pas être récoltés : Ils proviennent du fichier bsa extrait de Dawnguard et sont statiques. Peut-être réparerais-je cela plus tard, si c&#39;est réellement un soucis pour les utilisateurs de ce Mod.\r<br />\r<br />N.B. : Si vous ne possédez pas Dawnguard, vous pouvez tout de même utiliser ce mod. (mais Dragonborn ET Hearthfires sont vraiment exigés). Les Brillefleur et les Cônes des Âmes disparaîtront simplement. Pas de bugs, pas de crash.\r<br />\r<br />[center]-----------------------------------------------------------------------------------------\r<br />\r<br />[size=16][color=blue]CREDITS[/color][/size]\r<br />Stroti for the ovens, stove and all your amazing work.\r<br />Elianora, because your resource pack is awesome, even if unfortunately did&#39;nt used that much this time.\r<br />BrettM for the FPI Research &#33;\r<br />Tamira for these awesome plants.\r<br />Harvey2112 : General Stores &#33;\r<br />Blary : All the AARS. &lt;3\r<br />Yourenotsupposedtobeinhere : for these super fluffy round rugs.\r<br />EldiabS, because you made my life easier with that EID cell.\r<br />TonyMarko67, for the nice planters. Dabess planters.\r<br />Jokerine for the tiny boat in the bottle. :)\r<br />Oaristys, with him/her awesome ressource pack &#33;&#33;\r<br />MarkusLiberty : the Cyrodiil windmill. \r<br />\r<br />Finally : my husband, who tested my Mod in the two languages, for several times. :)\r<br />[/center]\r<br />",
  "categoryId": "67",
  "version": "1.0",
  "author": "Supernagabonds",
  "createdUnix": "1406833467",
  "updatedUnix": "1406833395",
  "containsAdultContent": false,
  "uploadedBy": "Supernagabonds",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120052",
      "name": "EN FILE",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "136374",
      "fileName": "EN FILE-56541-1-0.rar",
      "uploadedUnix": "1406832016",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8e6d96b77bfedc47fe0683f4316a4b32cec58fe492c7d699a38961cc57ab7287/analysis/1406832120/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EN%20FILE-56541-1-0.rar?fid=1000120052&ttl=1535841957&ri=8192&rs=8192&setec=6586c165e9dc0680f393e210f7eb1734"
    },
    {
      "fileId": "1000120053",
      "name": "FR FILE",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "136182",
      "fileName": "FR FILE-56541-1-0.rar",
      "uploadedUnix": "1406833395",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a1b1b15c71d7c759f4227ccb4a3a45a14c78d4a9f4e75181d2579308e40507df/analysis/1406833474/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FR%20FILE-56541-1-0.rar?fid=1000120053&ttl=1535841957&ri=8192&rs=8192&setec=c2e65c29d93c210cc142085cfa6d4a20"
    }
  ]
}