{
  "modId": 56557.0,
  "modName": "Epic Races of Skyrim",
  "summary": "The Epic Races of Skyrim features over ten refined races in a lore-friendly way. Some abilities that came from a previous edition of The Elder Scrolls series – Oblivion, has been restored. Where will you stand within the fate of Tamriel?",
  "descriptionHtml": "[font=century gothic][size=2][center][img]http://static-3.nexusmods.com/15/images/110/14551534-1406889209.png[/img][/center]\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/mods/110/images/56557-1-1406870472.png[/img][/center]\r<br />\r<br />The Argonians are the best guerilla warriors in Tamriel.\r<br />\r<br />The Bretons have the gifts of magic and diplomacy.\r<br />\r<br />The Dark Elves have a natural affinity for magic.\r<br />\r<br />The High Elves were the original settlers of Tamriel and also naturally proficient with magic.\r<br />\r<br />The Imperials are the unaligned outcasts of their own province of Cyrodiil.\r<br />\r<br />The Khajiit, a proud feline race, are fearsome forefront warriors, proficient with bladed weapons.\r<br />\r<br />The Nords are the brash, boisterous front line of the battle; fierce warriors and expert weapon masters.\r<br />\r<br />The Orcs are stalwart soldiers and talented armorers who manufacture the finest weapons and armor in all of Tamriel.\r<br />\r<br />The Redguards are supremely athletic, and raised to be outstanding warriors from the moment they are born.\r<br />\r<br />The Wood Elves, the most gifted archers in all of Tamriel; inhabit the thick, near-impenetrable forests of Valenwood. They are supreme hunters, guides, masters in sneaking and thievery.\r<br />\r<br />The Epic Races of Skyrim features over ten refined races in a lore-friendly way.\r<br />\r<br />Some abilities that came from a previous edition of The Elder Scrolls series – Oblivion, has been restored.\r<br />\r<br />Where will you stand within the fate of Tamriel?\r<br />\r<br />Satisfy guaranteed for 30 years.\r<br />\r<br />[center][img]http://static-4.nexusmods.com/15/images/110/14551534-1406889285.png[/img][/center]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-1-1406869945.png[/img][/center]\r<br />\r<br />The Saxhleel of Black Marsh are possessed of a cool intellect, and are well-versed in the magical arts, stealth, and the use of blades. They are also guerilla warfare experts, long accustomed to defending their borders from invaders. They have a natural resistance to diseases, able to breath underwater and have an unarmed claws. They can call upon the Histskin and Histborn to manipulate their health.\r<br />\r<br />Argonians can breathe underwater, resistant to diseases and have an unarmed claws. Their Histskin power allows them to regenerate health quickly, and Histborn to boost their health, for a short time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Saxhleel Blood[/b][/color]\r<br />Argonian blood is 75% resistant to diseases.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Histborn[/b][/color]\r<br />Argonian lungs can breathe underwater and swimming increases attributes regeneration.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Argonian Claws[/b][/color]\r<br />Argonian claws do 10 points of damage.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Histskin (at will)[/b][/color]\r<br />Invoke the power of the Hist to recover health ten times faster as magicka and stamina are nearly not regenerate for 30 seconds.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Histborn (at will)[/b][/color]\r<br />Increases maximum health by 100 points as it degenerates over time for 60 seconds.\r<br />\r<br />[i]Rapid health regeneration could help you when in combat. But, when is the best situation to use such power should be? You can only use that once per day... And then, one ability for today is lost.[/i]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-2-1406869946.png[/img][/center]\r<br />\r<br />The Aldmeri-Nedic Manmer of High Rock were once ruled by the High Elves overlord. An elvish ascentry still runs in their veins, giving Bretons an innate grasp of magic that distinguishes them from the other human races. The Bretons are renowned and talented craftsmen, shrewd merchants, gallant cavaliers, and inventive wizards. They are able to alter their defense with either the Dragoncloak or Dragonskin.\r<br />\r<br />Bretons are born with extra magicka and their veins grants a resistance to magic. They can invoke the Dragoncloak to absorb magicka from hostile spells, and Dragonskin allows them to ignore the most incoming damage, for a short time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Twin Blood[/b][/color]\r<br />Bretons are born with 50 extra magicka.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Manmer Blood[/b][/color]\r<br />Manmer blood grants a 50% resistance to magic.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Dragoncloak (at will)[/b][/color]\r<br />Lose focus on magicka and absorb 50% of the magicka from hostile spells for 30 seconds, as it negates the Manmer Blood.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Dragonskin (once per day)[/b][/color]\r<br />Increases the physical damage resistance to 80% for 60 seconds, but doubled if not wearing any armor.\r<br />\r<br />Your male Breton will has a voice like Phinis Gestor, Nazeem and Jarl Siddgeir.\r<br />Your female Breton will has a voice like Ingun Black-Briar, Ysolda and Idgrod the Younger.\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-3-1406869946.png[/img][/center]\r<br />\r<br />The Dunmer, or Moriche, homeland of Morrowind has been invaded many times by the Akaviri and the Nords. This history of conflict has transformed the Dunmer into hardened warriors. They also have a natural affinity for magic and great intellect, making them skillful sorcerers. They are naturally resistant to fire and can call upon their Ancestor&#39;s Fury and Ancestor&#39;s Rage to unleash their flame affinity.\r<br />\r<br />Dark Elves have an innate resistance to fire. They can call upon the Ancestor&#39;s Fury to surround themselves in fire for a short time, and Ancestor&#39;s Rage to create a burst of fire.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Ashborn[/b][/color]\r<br />Dunmer heritage gives a 50% resistance to fire.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Ancestor’s Fury (at will)[/b][/color]\r<br />Opponents that get too close will take 8 points per second of fire damage for 90 seconds.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Ancestor’s Rage (once per day)[/b][/color]\r<br />Summon your ancestor&#39;s spirit in a burst of fire, creating a huge explosion that deals 100 points of damage from your position.\r<br />\r<br />Your male or female Dark Elf character have a voice like the other Dark Elf.\r<br />\r<br />[i]Yesterday, Ancestor&#39;s Wrath was an awful flame cloak.[/i]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-4-1406869946.png[/img][/center]\r<br />\r<br />The Altmer, or Salache, of Summerset Isle arrived in Tamriel thousands of years ago from Old Aldmeris. They are a highly cultured people, known for their breathtaking architecture and massive libraries of histories and creative works. They are powerful mages and warriors, and the de facto leaders of the Aldmeri Dominion. They can call upon their Highborn and Highbreed to manipulate their magicka.\r<br />\r<br />High elves are born with extra magicka and have an innate elemental affinity. They can invoke the Highborn to regenerate magicka quickly, and Highbreed to boost their magicka, for a short time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Highborn[/b][/color]\r<br />High Elves are born with 100 extra magicka.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Salache Blood[/b][/color]\r<br />Altmer blood grants a 25% resistance to fire, frost and shock.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Highborn (at will)[/b][/color]\r<br />Regenerate magicka ten times faster as health and stamina are nearly not regenerate for 30 seconds.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Highbreed (at will)[/b][/color]\r<br />Increases maximum magicka by 100 points as it degenerates over time for 60 seconds.\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-5-1406869946.png[/img][/center]\r<br />\r<br />Known as Cyrodiils, Cyrodilics or Cyro-Nordics before the time of Talos, are the unaligned outcasts of their own province of Cyrodiil. Rogue Imperials have broke away their Daedra worshipping leaders. They have a Voice of the Emperor although their Empire has fallen off to command &#34;stop&#34; the others. They also gain a power of Star of the West, which letting them survive in combat.\r<br />\r<br />Imperials are natives of Cyrodiil, the cosmopolitan heartland of the Empire. They can invoke the Voice of the Emperor power to calm nearby angry opponent for a short while, and Star of the West to make themselves survive in combat.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=yellow][b]Imperial Luck[/b][/color]\r<br />Additional gold coins, up to 10 extra sum of gold, might be found anywhere.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=yellow][b]Voice of the Emperor (at will)[/b][/color]\r<br />Harmonize everyone, gaining additional speech skill by 15 points and prices are 15% better for 45 seconds.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=yellow][b]Star of the West (once per day)[/b][/color]\r<br />Fully restores health, magicka and stamina.\r<br />\r<br />Your male Imperial has a voice like Commander Caius and Commander Maro.\r<br />Your female Imperial has a voice like Aela the Huntress, Adrianne Avenicci and Legate Rikke.\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-1-1406870233.png[/img][/center]\r<br />\r<br />The population of the proud feline Khajiit of Elsweyr has dwindled in recent years following a devastating outbreak of Knahaten Flu. They have a wry wit and a hedonistic outlook, but they are fearsome on the field of battle. They are able to see better in the dark, survive on leaping, have a deadly claw and swifter weapon attacks.\r<br />\r<br />Khajiit has a deadly claws that can be used in unarmed combat and able to swing weapon swiftly. They can see better in the dark with their Eye of Night and an ability to survive when leaping.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Khaj Claws[/b][/color]\r<br />Khajiit claws do 20 points of damage.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Khajiiti Athletics[/b][/color]\r<br />Khajiit is always lands on feet, reducing the damage taken from falling; and move 25% faster on the wilderness.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Eye of Night (at will)[/b][/color]\r<br />Improves night sight.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Eye of Fear (once per day)[/b][/color]\r<br />Weapon swings 90% faster for 30 seconds, as the speed decreases by 30% per 10 seconds.\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-2-1406870233.png[/img][/center]\r<br />\r<br />The Nords of Skyrim once conquered most of Tamriel. They broke the power of the Ayleids, nearly drove the High Elves out of High Rock, and conquered much of Resdayn, the precursor to Morrowind. They are natural-born warriors who fight with an ecstatic ferocity that terrifies their enemies. They are also resistant to cold. They can create a Battlecry and Warcry as they confront their enemies.\r<br />\r<br />Nords have an innate resistance to frost. They can create a Battlecry to make their enemies flee, and Warcry to increase their strength, for a short time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Nordic Blood[/b][/color]\r<br />Nordic blood gives a 50% resistance to frost.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Battlecry (at will)[/b][/color]\r<br />Makes nearby opponents flee for 45 seconds; you lose all of your stamina and recover it slower.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=red][b]Warcry (once per day)[/b][/color]\r<br />Increases health and stamina by 40. Increases one-handed, two-handed and archery skills by 15 points for 90 seconds.\r<br />\r<br />Your male Nord has a voice like Alvor, Jarl Balgruuf the Greater and Wilhelm.\r<br />Your female Nord has a voice like Mjoll the Lioness, Gerdur, Hulda and most female Stormcloak guard.\r<br />\r<br />[i]Not so good while you&#39;re surrounded multiple times in combat and you can only cast Battle Cry once per day.[/i]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-3-1406870233.png[/img][/center]\r<br />\r<br />The Orsimer, or Pariah Folk, live under a simple code of honor by which the strong survive and the strongest rule. These noble warriors have an ancient culture forged from endless warfare in Wrothgarian Mountains, Dragontail Mountains, and Orsinium. Their craftmanship are prized everywhere. They are naturally resistant to shock, and ruthless when under effect of the Berserker&#39;s Frenzy.\r<br />\r<br />Orcs have an innate resistance to shock. They can go berserk by increasing their endurance to do double damage while only taking half damage with a sacrifice, for a short time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Blood-Kin[/b][/color]\r<br />Orcs are great in strength, granting 50 extra health.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Orsimer Blood[/b][/color]\r<br />Orsimer blood gives a 50% resistance to shock.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Berserker’s Frenzy (at will)[/b][/color]\r<br />Health and stamina are increased by 50, dealing twice as much damage and take half damage from enemies for 45 seconds. Sacrifices health, stamina and magicka over time.\r<br />\r<br />[i]Go berserk at your own peril.[/i]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-4-1406870234.png[/img][/center]\r<br />\r<br />The Redguards of Hammerfell are talented and athletic warriors. Their ancestors migrated to Tamriel from the lost continent of Yokuda. They prize honor and dignity above all else, combining a deep reverence for the divine with a suspicion of all things magical. They are resistant to poison and able to call upon an Adrenaline Vigor and Adrenaline Rush to manipulate their stamina.\r<br />\r<br />Redguards are trained at their desert homeland and resistant to poison. They can invoke the Adrenaline Rush to regenerate stamina quickly, and Adrenaline Vigor to boost their stamina, for a short time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Desert Training[/b][/color]\r<br />Redguards are trained with 50 extra stamina.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Yokudan Blood[/b][/color]\r<br />Redguard blood is 75% resistance to poison.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Adrenaline Rush (at will)[/b][/color]\r<br />Regenerate stamina ten times faster as health and magicka are nearly not regenerate for 30 seconds.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=lightblue][b]Adrenaline Vigor (at will)[/b][/color]\r<br />Increases maximum stamina by 100 points as it degenerates over time for 60 seconds.\r<br />\r<br />Your male Redguard still has the same voice. It seems it’s the standard male Redguard voice, such Kematu and Alik&#39;rs.\r<br />Your female Redguard has a voice like Faralda and Saadia.\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/mods/110/images/56557-5-1406870234.png[/img][/center]\r<br />\r<br />The Bosmer, Boiche, or the Tree-Sap people, are mischievous, curious and nimble. They are the experts to the art of defense. They are also gifted archers, perhaps the best in all of Tamriel. The Elden Root, lies in the heart of their homeland. They are naturally resistant to both poison and diseases. The Beast Tongue and Assassinate abilities can be somewhat useful.\r<br />\r<br />Wood Elves are resistant to both disease and poison. They can use Beast Tongue to make animals an ally, and able to call upon the Assassinate power, for a short time.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Boiche Blood[/b][/color]\r<br />Bosmer blood is 50% resistance to poison and diseases.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Chameleon[/b][/color]\r<br />Automatically blends into surroundings of wilderness; if standing still or walking and out of combat.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Beast Tongue (at will)[/b][/color]\r<br />Call the forces of nature for 90 seconds.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/images/110/14551534-1406872031.png[/img] [color=orange][b]Assassinate (once per day)[/b][/color]\r<br />Bows do ten times as much damage when sneaking and slows time by 30% for 10 seconds.\r<br />\r<br />Your male Wood Elf has a voice like Anoriath, Quintus Navale, Gwillin, Onmund and Sven.\r<br />Your female Wood Elf has a voice of the default female human race, such Wylandriah, Sigrid and Arcadia.\r<br />\r<br />[i]NB: One day, the foces of nature will save you.[/i]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/images/110/14551534-1406889352.png[/img][/center]\r<br />\r<br />[color=cyan][i]Installation[/i][/color]\r<br />\r<br />Use your preferred method, either using a mod manager or manual install.\r<br />\r<br />I suggest you to deactivate this mod while you&#39;re creating a new character. Don&#39;t blame me if this mod binds your savegame.\r<br />\r<br />[color=magenta][i]Compatibility[/i][/color]\r<br />\r<br />Someone just tried to apply a patch that included in the ZIP file and made his/her game CTD. So, I said a short reply about the patch. He/she told me that he/she won&#39;t download another [i](I&#39;d say: master)[/i] mod to use my mod, or I need to fix [i](I&#39;d say: blame)[/i] my mod, and he/she wanted me to answer this more clear.\r<br />However, I already listed a mod below that need to apply the patch. If you use it, apply the patch. Otherwise, [b]do not.[/b]\r<br />Why this description tab always skipped and blame the author&#39;s inresponsibility? I&#39;d rather to say [i]blame the user&#39;s laziness.[/i]\r<br />\r<br />[list][*] [url=http://www.nexusmods.com/skyrim/mods/21587]Character Creation Overhaul[/url]\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/7587]Height Adjusted Races with True Giants[/url] (load Epic Races after this mod)\r<br />[*] [url=http://www.nexusmods.com/skyrim/mods/24273]Ethereal Elven Overhaul[/url] (load Epic Races after this mod, and apply the included patch - [color=red]untested&#33;[/color])\r<br />[/list]Nothing else, but I&#39;m sure it will conflict with another races mod. The winner is the last loaded.\r<br />[color=orange][i]Uninstallation[/i][/color]\r<br />\r<br />If you found the [b]xx[/b] prefix on certain ID, type [u]help &#34;racial ability&#34;[/u] on console to find out your first two ID. The prefix varies depending upon your load order.\r<br />\r<br />[color=red]&gt; Argonian[/color]\r<br />Saxhleel Blood (was Argonian Blood): 104acf\r<br />Argonian Claws: [color=grey]xx[/color]0155fb\r<br />Histborn (was Waterbreathing): aa01b\r<br />\r<br />[color=lightblue]&gt; Breton[/color]\r<br />Twin Blood: [color=grey]xx[/color]000d64\r<br />Manmer Blood (was Breton Blood): aa01f\r<br />\r<br />[color=orange]&gt; High Elf[/color]\r<br />Highborn: 105f16\r<br />Salache Blood: [color=grey]xx[/color]0135ab\r<br />\r<br />[color=orange]&gt; Khajiit[/color]\r<br />Khaj Claws (was Claws): aa01e\r<br />Khajiiti Athletics: [color=grey]xx[/color]013b10\r<br />\r<br />[color=lightblue]&gt; Orc[/color]\r<br />Blood-Kin: [color=grey]xx[/color]00b461\r<br />Orsimer Blood: [color=grey]xx[/color]015b5e\r<br />\r<br />[color=lightblue]&gt; Redguard[/color]\r<br />Desert Training: [color=grey]xx[/color]001829\r<br />Yokudan Blood (was Redguard Blood): aa023\r<br />\r<br />[color=orange]&gt; Wood Elf[/color]\r<br />Boiche Blood (was Bosmer Blood): aa025\r<br />Chameleon: [color=grey]xx[/color]1c71e\r<br />\r<br />Then, type [u]player.removespell [color=red]xx[/color][color=yellow]yyy[/color][color=lightgreen]zzz[/color][/u]. Example: player.removespell 3d015b5e for Orsimer Blood.\r<br />\r<br />Save and disable/delete the mod. Vanilla racial powers will automatically detect new settings and mod-added racial powers will be removed after uninstallation.\r<br />\r<br />Cleaning your save isn&#39;t necessary, but always recommended.\r<br />\r<br />[color=lightgreen][i]After Installation/Uninstallation[/i][/color]\r<br />\r<br />Apply these command lines to refresh the setup:\r<br />\r<br />[color=red]&gt; Argonian[/color]\r<br />Histborn (was Waterbreathing): 0155fb\r<br />Saxhleel Blood (was Argonian Blood): 104acf\r<br />\r<br />[color=lightblue]&gt; Breton[/color]\r<br />Manmer Blood (was Breton Blood): aa01f\r<br />\r<br />[color=orange]&gt; High Elf[/color]\r<br />Highborn: 105f16\r<br />\r<br />[color=orange]&gt; Khajiit[/color]\r<br />Khajiit Claws (was Claws): aa01e\r<br />\r<br />[color=lightblue]&gt; Redguard[/color]\r<br />Yokudan Blood (was Redguard Blood): aa023\r<br />\r<br />[color=orange]&gt; Wood Elf[/color]\r<br />Boiche Blood (was Bosmer Blood): aa025\r<br />\r<br />[center][img]http://static-1.nexusmods.com/15/images/110/14551534-1406889405.png[/img][/center]\r<br />\r<br />You probably like this mod because...\r<br />...everything are still lore-friendly;\r<br />...you don&#39;t need to create a new game after uninstallation, because this isn&#39;t a binding mod;\r<br />...you hate the once per day powers;\r<br />...you still want to have the racial abilities from an older TES.\r<br />\r<br />You probably don&#39;t like this mod because...\r<br />...I am a liar. The images and the results are none;\r<br />...the descriptions are overrated, but the contents are petty;\r<br />...you have a better mod to play with;\r<br />...you&#39;re already using an overhaul mod that changes the entire game, from perks into miscellaneous items.\r<br />\r<br />Anonymous: What kind of presentation is this? You just have a small mod here.\r<br />DwemerBot: Serious stuff comes with a serious service.\r<br />Anonymous: Hey, why the hell my character doesn’t sounds while shouting?\r<br />DwemerBot: Well, I just grew tired of all the same race voices. Shouts don’t sound because of missing its voice file. Actually, there are only 10 voice actors who has been selected being a Dragonborn to shout at their mic.\r<br />Anonymous: But there are 10 races and there are also 10 available voice actors&#33; Why they still same, then?\r<br />DwemerBot: You stupid&#33; One race needs two voice actors for different genders.\r<br />Anonymous: I noticed that your race description and the pictures are from the Elder Scrolls Online. I will call the guard for a copyright infringement.\r<br />DwemerBot: Yes, sure. I have the bribery perk and I’m the one of the Thieves Guild member.\r<br />Anonymous: Do you always clean your mod?\r<br />DwemerBot: I&#39;m always neat when working with my mod. So, I don&#39;t have any dirty records.\r<br />Anonymous: Will this compatible with mods that changes the race height?\r<br />DwemerBot: Of course. I have tested and has no conflict. Just load it before this mod.\r<br />Anonymous: I have the Character Creation Overhaul. Will it compatible?\r<br />DwemerBot: Since CCO isn’t changing the race record, it would be.\r<br />Anonymous: Sounds nice. But, how about SkyRE or somewhat known as role-playing overhaul?\r<br />DwemerBot: SkyRE has their own race module named SkyRe_Races. You can disable it. If you have Requiem, disable the Requiem. LOL.\r<br />\r<br />Now, if you have any question, please don&#39;t ask me. I&#39;m just a dwarven robot&#33; And don&#39;t forget to [s][u]dis[/u][/s]endorse. Oh, my...\r<br />\r<br />[line]\r<br />\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/56644/][img]http://static-2.nexusmods.com/15/mods/110/images/56644-2-1407043779.png[/img][/url]\r<br />[url=http://facebook.com/groups/1488738874722755/][img]http://static-4.nexusmods.com/15/images/110/14551534-1412490867.png[/img][/url][/center]\r<br />\r<br />[/size][/font]",
  "categoryId": "34",
  "version": "1.4",
  "author": "DwemerBot",
  "createdUnix": "1406873299",
  "updatedUnix": "1412488506",
  "containsAdultContent": false,
  "uploadedBy": "DwemerBot",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120124",
      "name": "Epic Races Module V1.0 plus Uninstaller",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "189",
      "fileName": "Epic Races Module V1.0-56557-1-0.zip",
      "uploadedUnix": "1406871129",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6dd3ca8be30e1ecfa78708d2ea1a8251f072fd188dec8bed014b02931b67572b/analysis/1406871185/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Races%20Module%20V1.0-56557-1-0.zip?fid=1000120124&ttl=1535841983&ri=8192&rs=8192&setec=a96b3862a0febafa31df1ab6a712e530"
    },
    {
      "fileId": "1000120570",
      "name": "Epic Races Module V1.0 - Default Voice",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "96",
      "fileName": "Epic Races Module V1.0 - Default Voice-56557-1-0.zip",
      "uploadedUnix": "1407140555",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d91d937eb70c1d7b40b615d051bfd1f0eba5a5bdc0dfb30a71e1c0701c2e2643/analysis/1407140585/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Races%20Module%20V1.0%20-%20Default%20Voice-56557-1-0.zip?fid=1000120570&ttl=1535841983&ri=8192&rs=8192&setec=c92f68be4d4c678f0a1e72bc441eea83"
    },
    {
      "fileId": "1000120695",
      "name": "Epic Races V1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "98",
      "fileName": "Epic Races V1.1-56557-1-1.zip",
      "uploadedUnix": "1407231751",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/da4c4c8006319bdddd9b651116a36cbee4d585a6fa9a2bb72f168c5ded816b10/analysis/1407231783/",
      "changelogHtml": " Breton&#39;s Dragonskin is now a Dragonhide spell. <br/> \n High Elf now has an elemental protection, listed under the &#34;Salache Blood&#34; ability. <br/> \n Imperial&#39;s Star of the West now fully restores to all attributes. <br/> \n Khajiit now has a &#34;Khajiiti Athletics&#34; ability. <br/> \n Khajiit now has a &#34;Rampage&#34; greater power. <br/> \n Wood Elf now has an &#34;Assassinate&#34; greater power. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Races%20V1.1-56557-1-1.zip?fid=1000120695&ttl=1535841984&ri=8192&rs=8192&setec=dc4f45c5fd33e2213144e952673f238c"
    },
    {
      "fileId": "1000120697",
      "name": "Epic Races V1.1 - No Voice Changes",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "97",
      "fileName": "Epic Races V1.1 - No Voice Changes-56557-1-1.zip",
      "uploadedUnix": "1407231907",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/60b12aeb8d960ec618ce4e9dcc892984699bc1ba558e3f5d22e6711ae49a38a7/analysis/1407231962/",
      "changelogHtml": " Breton&#39;s Dragonskin is now a Dragonhide spell. <br/> \n High Elf now has an elemental protection, listed under the &#34;Salache Blood&#34; ability. <br/> \n Imperial&#39;s Star of the West now fully restores to all attributes. <br/> \n Khajiit now has a &#34;Khajiiti Athletics&#34; ability. <br/> \n Khajiit now has a &#34;Rampage&#34; greater power. <br/> \n Wood Elf now has an &#34;Assassinate&#34; greater power. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Races%20V1.1%20-%20No%20Voice%20Changes-56557-1-1.zip?fid=1000120697&ttl=1535841984&ri=8192&rs=8192&setec=2468d40e802ac83ff77649f65cd31c2e"
    },
    {
      "fileId": "1000122290",
      "name": "Epic Races",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "593",
      "fileName": "Epic Races-56557-1-2.zip",
      "uploadedUnix": "1408177512",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/27452095c40dd199120b2906f768b02943a38f8e185d5fe1e565cff3dbde8d88/analysis/1408177614/",
      "changelogHtml": " Argonian now has an &#34;Argonian Claws&#34; ability. <br/> \n Argonian&#39;s Saxhleel Blood (waterbreathing) renamed to &#34;Marsh Diver&#34;. <br/> \n Breton&#39;s Twin Blood (magic resistance) renamed to &#34;Manmer Bood&#34;. <br/> \n Khajiit red-eyed vision fixed. <br/> \n Orc now has an &#34;Orsimer Blood&#34; ability. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Races-56557-1-2.zip?fid=1000122290&ttl=1535841984&ri=8192&rs=8192&setec=fd6e0d165799e7559e960fe4f36a121e"
    },
    {
      "fileId": "1000124637",
      "name": "Epic Races",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "231",
      "fileName": "Epic Races-56557-1-3.zip",
      "uploadedUnix": "1409467392",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/e8abf7e2a50d795838d4f93726d022a14a33b47daae580972f4ee7f1576082e2/analysis/1409467503/",
      "changelogHtml": " New visual effect of racial abilities. <br/> \n &#34;Marsh Diver&#34; renamed into &#34;Histborn&#34;. <br/> \n &#34;Blood Oath&#34; renamed into &#34;Blood-Kin&#34;. <br/> \n Small fix to &#34;Assassinate&#34;. <br/> \n Diversed race and gender heights. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Races-56557-1-3.zip?fid=1000124637&ttl=1535841985&ri=8192&rs=8192&setec=f755a91b95204249ef2a6d0025b153a5"
    },
    {
      "fileId": "1000129673",
      "name": "Epic Races",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "231",
      "fileName": "Epic Races-56557-1-4.zip",
      "uploadedUnix": "1412488506",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/1f92bdb97f88af8e49f6f720b45c56d8d1bcc906c2ae7a059eb26223ace9d448/analysis/1412488623/",
      "changelogHtml": " Refined racial powers visual effect. <br/> \n Alternate of vanilla powers (Histborn/Adrenaline Vigor/Highbreed) have been re-tweaked. <br/> \n New passive &#34;Chameleon&#34; ability to Wood Elf, inspired by Command and Conquer&#39;s cloak, which makes you invisible while standing still and only on wilderness. <br/> \n Argonian&#39;s Waterbreathing has been renamed into &#34;Histborn.&#34; <br/> \n Argonian will regenerates its attributes faster when swimming. <br/> \n Breton&#39;s Dragoncloak will negates the Manmer Blood when active. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Epic%20Races-56557-1-4.zip?fid=1000129673&ttl=1535841985&ri=8192&rs=8192&setec=8dffd0b35ec967529a928864032e3a26"
    }
  ]
}