{
  "modId": 56572.0,
  "modName": "Reduced Armor Rating and SkyRe Compatibility Patch for DreamBurrows Regal Huntsman Armor",
  "summary": "Reduces the armor rating of DreamBurrows Regal Huntsman Armor to being the equivalent of dragonscale because it is light armor. This also had a built in compatibility patch for T3nd0s Skyrim Redone that reclassifies the armor under dragonscale. NOT NECESSARY TO HAVE SkyRe if you only want the reduced armor rating. It will work with or without SkyRe",
  "descriptionHtml": "The main purpose of this patch is to reduce the armor rating for [url=http://www.nexusmods.com/skyrim/mods/39983/?]DreamBurrow&#39;s Regal Huntsman Armor[/url]﻿ (amazing mod) from having the stats of heavy daedric to that of light armor dragonscale, because hey, the Regal Huntsman armor is light armor and was too OP to use in your game without ruining it when the stats were the same as heavy daedric even though it&#39;s light armor. I also changed the crafting recipe to be the same as dragonscale. (Doesn&#39;t make a ton of sense, but it keeps the set balanced, and lets be real, everyone has plenty of dragonscales sitting around). I didn&#39;t assign a required smithing perk to make the armor, so if you don&#39;t have dragon smithing you can still make the set. If you prefer to be more immersive, just wait until you&#39;re a decent level or have the dragon smithing perk (although it&#39;s not required) to craft it. (It&#39;d be silly to have this set at level 5 haha).\r<br />\r<br />This also functions as a compatibility patch for [url=http://www.nexusmods.com/skyrim/mods/9286/?]T3nd0s Skyrim Redone[/url] by reclassifying the armor as dragonscale so that it gets assigned the proper stats by the [url=http://www.nexusmods.com/skyrim/mods/28467/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D28467%26preview%3D&pUp=1]ReProccer[/url]. [b][u]HOWEVER it is NOT NECESSARY to have SkyRe[/u][/b] in order to use this patch. If you want the reduced armor rating and you don&#39;t use SkyRe it will still function perfectly because I changed both the base stats and the armor classification to dragonscale.\r<br />\r<br />DreamBurrow made a SkyRe patch, but as I said, it gives the set the same stats as heavy daedric, which of course isn&#39;t balanced with the rest of the game. She also made a reduced armor rating patch, but that patch doesn&#39;t work with SkyRe, and that patch makes the set slightly stronger than heavy ebony, which also isn&#39;t balanced. Hence, I made this patch that does both properly and sets it to dragonscale. :)\r<br />\r<br />Head on over to [url=http://www.nexusmods.com/skyrim/mods/39983/?]DreamBurrows Regal Huntsman Armor[/url]﻿ for the actual textures etc. This is only a patch and you must first download her original mod.\r<br />\r<br />[b][i]Installation:[/i][/b] Install with Nexus Mod Manager AFTER you have installed the original mod and allow anything that pops up to overwrite.",
  "categoryId": "36",
  "version": "1",
  "author": "Rileymac4",
  "createdUnix": "1406905574",
  "updatedUnix": "1406905465",
  "containsAdultContent": false,
  "uploadedBy": "Rileymac4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120168",
      "name": "Reduced Armor Rating and SkyRe Compatibility Patch for DreamBurrows Regal Huntsman Armor",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Reduced Armor Rating and SkyRe Compatibility Patch for DreamBurrows Regal Huntsman Armor-56572-1.zip",
      "uploadedUnix": "1406905465",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6a9e86b7d66306eba5766a24be499e6e7bbefa9ce7b97e33141048aa67c10c54/analysis/1406909170/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reduced%20Armor%20Rating%20and%20SkyRe%20Compatibility%20Patch%20for%20DreamBurrows%20Regal%20Huntsman%20Armor-56572-1.zip?fid=1000120168&ttl=1535842001&ri=8192&rs=8192&setec=7816bff88872e0c6979621768f972a5d"
    }
  ]
}