{
  "modId": 56573.0,
  "modName": "Lunarforged Lunar Weapons",
  "summary": "This mod was made in order to outshine the vastly dissapointing vanilla Lunar Weapons.",
  "descriptionHtml": "Please read my FAQ on this page before commenting with a question.\r<br />Thank you.\r<br />\r<br />=== Also on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=294510620]Steam Workshop[/url], for those who prefer.\r<br />\r<br />--------------------------------------------------\r<br />Summary:\r<br />--------------------------------------------------\r<br />\r<br />This mod was made in order to outshine the vastly disappointing vanilla Lunar Weapons.\r<br />I chose to make the new Lunar set out of the Iron Weapons, in order for them not to clash with my [url=http://www.nexusmods.com/skyrim/mods/47596]Skyforged Skyforge Weapons[/url], which uses the steel set. That is the simple explanation for why there are no longer any Lunar Steel Weapons; in exchange though, there is now a whole set, complete with one- AND two-handed weapons.\r<br />\r<br />Each weapon has five tiers, each with unique glowing, purple-ish textures that get increasingly intricate as the weapon improves.\r<br />Each tier deals more damage when the moons are out, but has a steeper level requirement [for crafting] than the last (see the table beneath).\r<br />(Tier/level req./Lunar Dmg.\r<br />I/7/5\r<br />II/14/10\r<br />III/21/15\r<br />IV/28/20\r<br />V/35/25\r<br />This meant that you need to be AT LEAST level 7 in order to craft [or improve] the first tier, and that you can only craft the fifth tier by level 35.\r<br />Previously you were able to aquire weapons that dealt a perkless 30 damage [at night] at no more than level eight. This has been nerfed, but in exchange, you can now obtain 43 damage [at night] weapons in the end.\r<br />The weapons are still sort of an easter egg or a novelty, but they are quite powerful at night...)\r<br />\r<br />--------------------------------------------------\r<br />Exactly what it does:\r<br />--------------------------------------------------\r<br />\r<br /> - REPLACES the bland vanilla Lunar Weapons (Iron Sword, Axe and Mace + Steel Sword, Axe and Mace) with new and unique glowing weapons (entire Iron Weapon set). If you already own Lunar weapons, these will not be replaced, but there will be no way of obtaining the original vanilla versions after this mod is installed (besides the console; they are still in the game, simply nowhere to be found).\r<br /> - REPLACES the regular old forge at the Silent Moons Camp with the Lunar Forge; a custom textured forge for the crafting of these weapons. It only gains its special properties when the moons are out though...\r<br /> - MAKES All the new weapons craftable at the Lunar Forge with five tiers each, IF you meet the level requirement (Requires the Arcane Blacksmithing perk). Every weapon, regardless of tier, can be improved at the Grindstone (Requires the Arcane Blacksmithing perk). They can also be disenchanted like the vanilla Lunar weapons, and the enchantment can then be applied to other weapons.\r<br /> - EXCHANGES the old lunar weapons scattered around the Silent Moons Camp with levelled Lunar Iron Weapons.\r<br /> - GIVES each bandit of the Silent Moons Camp a 2/3rds chance to be armed with a Lunar Iron Weapon, giving the player an extra challenge/reward for finding and clearing the camp.\r<br /> - CHANGES the green enchantment effect of the Silent Moons Enchant to a purple one. This wont show on the weapons of this mod, but on the ones you enchant with the effect yourself.\r<br /> - CHANGES the impact effect of the weapons from the magical shield effect to a similar, but purple effect, that matches the weapons.\r<br />\r<br />--------------------------------------------------\r<br />Plans:\r<br />--------------------------------------------------\r<br />\r<br />I would like to add a bow to this sometime. Arrows too maybe. We’ll see...\r<br />\r<br />I would like to make the weapons light up, because of their glow. It would be cool if they could act as a weapon/torch combo, but then I would have to make the feature disable when crouching, so as not to eliminate their use for stealth characters...\r<br />I will have to look into the possibilities of this sometime.\r<br />\r<br />--------------------------------------------------\r<br />Compatibility:\r<br />--------------------------------------------------\r<br />\r<br />This mod will conflict with any that alters the Lunar Weapons, the Lunar Forge, or Silent Moons Camp.\r<br />\r<br />--------------------------------------------------\r<br />FAQ:\r<br />--------------------------------------------------\r<br />\r<br />Q: You say ‘unique’, but these are just re-skinned Iron Weapons?\r<br />A: Yes. An artist must adapt to his medium, and I only work in textures, as I have neither the interest, resources, nor stamina to teach myself 3D modelling. I can only make weapons glow so that is what I do.\r<br />\r<br />Q: Why the Roman numerals?\r<br />A: Initially I wanted all the weapons to have the same name, and only their power and texture varying between them, however, this caused the weapons to show up in utterly random order at the blacksmith and in the players inventory, and so to remedy this, I added the Roman numerals.\r<br />I just personally felt ‘I’, ‘II’, ‘III, etc. Fit better with the theme than 1, 2, 3...\r<br />\r<br />Q: How did you get the weapons to glow?\r<br />A: See [url=http://skyrim.nexusmods.com/mods/7069/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D7069&pUp=1] this tutorial[/url] and [url=http://www.loverslab.com/topic/15629-add-glow-effect-to-weapons-solved/] forum topic[/url] for further help. Retexturing weapons to glow is a very easy [and awesome] thing to do. I was able to make my first glowing weapon within two or three hours, and I’m not really that smart. Give it a go&#33;\r<br />\r<br />Q: I’m not a huge fan of purple; could you make a blue/green/red/orange/some-other-colour version?\r<br />A: No. I made this with purple, as I thought it fit the moon-theme quite well. I do not believe I will be adding other colours, as doing so would require a lot of work.\r<br />\r<br />Q: Now we have Lunar Iron Weapons. Will other weapon sets follow?\r<br />A: No. I made this to be a complete, matching set, and this is all that it will be. I am abundantly certain that I will not be expanding upon this mod with more weapons, as doing so would require a lot of work.\r<br />\r<br />--------------------------------------------------\r<br />Thanks:\r<br />--------------------------------------------------\r<br />\r<br /> - Bethesda Softworks as always\r<br /> - The awesome guys who roam the ‘Quick Questions, Quick Answers’-topics on Bethesda Softworks’ Creation Kit Forum - I could not have done this without you&#33;\r<br />\r<br />--------------------------------------------------\r<br />Permissions:\r<br />--------------------------------------------------\r<br />\r<br />Please do contact me if you have any wish to involve my work in another project. Then we’ll have a chat and see what we can do ;)\r<br />\r<br />Thank you :)",
  "categoryId": "55",
  "version": "1.0",
  "author": "Graesholt",
  "createdUnix": "1406908066",
  "updatedUnix": "1406914111",
  "containsAdultContent": false,
  "uploadedBy": "Graesholt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120169",
      "name": "Lunarforged Lunar Weapons",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "64810",
      "fileName": "Graesholt - Lunarforged Lunar Weapons-56573-1-0.rar",
      "uploadedUnix": "1406906659",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b8a91e3c109019094dc91b77cda52a18ad2857e822d3cf0883645b4da3cd509b/analysis/1406906722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Graesholt%20-%20Lunarforged%20Lunar%20Weapons-56573-1-0.rar?fid=1000120169&ttl=1535842002&ri=8192&rs=8192&setec=abe542dbb3f428386ef52ea773560c08"
    },
    {
      "fileId": "1000120190",
      "name": "Lunarforged Lunar Weapons (Texture Pack)",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "44142",
      "fileName": "Lunarforged Lunar Weapons (Texture Pack)-56573-1-0.rar",
      "uploadedUnix": "1406914111",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/52b046ce04f76b92a7cf13394c89ec3aa4c7ba6672a5fef0be39d3db66a1b8bb/analysis/1406914205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lunarforged%20Lunar%20Weapons%20%28Texture%20Pack%29-56573-1-0.rar?fid=1000120190&ttl=1535842003&ri=8192&rs=8192&setec=a32920014d6379c8252d904948b9ce5b"
    }
  ]
}