{
  "modId": 5658.0,
  "modName": "Silent Followers",
  "summary": "This mod will make followers stop talking constantly.",
  "descriptionHtml": "This mod will make followers and hirelings stop their constant and repetitive idle dialogue.\r\nAs of initial release, this affects Mjoll the Lioness, as I have not used other followers much, I will start testing and adding more of them to the list, feel free to request any particular character.\r\n\r\nInstallation:\r\nInstall with NMM or just extract to the Skyrim data folder.\r\n\r\nChangelog:\r\nInitial release: v0.1\r\nMjoll\r\n\r\n\r\nNotes:\r\nMjoll dialogue removed:\r\n - Exploring these caves feels like coming home, I missed it.\r\n - I really miss traveling like this, walking the breadth of Skyrim has always filled my heart with excitement.\r\n - I\\'ve never been a sell-sword, never traded my skills for pay, I\\'ve always adventured on my own terms.\r\n - You should have seen me at the height of my adventuring career, I was fearless, took too many risks, but that is what it was all about.\r\n - I remember a cut-purse tried to rob me on the road once, when I drew grimsever, I think the poor man soiled his armor.\r\n - I\\'ve seen enough death to last 3 lifetimes, yet I never tire of a good fight, what do you make of that?\r\n - When I was young, I journeyed with my father on hunting expeditions into Morrowwind, the cliff racers make excellent sport.\r\n - I love the cold air, it\\'s exhilarating, perhaps it\\'s because of my nord blood, but there\\'s something about it that makes me feel alive.\r\n - My father wanted me to follow in his footsteps as a hunter, but I set my aspirations a bit higher, he never complained, I miss him.\r\n - My mother was a strong woman, she\\'s the one who instructed me on my sword-fighting techniques, can you imagine?\r\n - People say Skyrim is one of the most dangerous places in Tamriel, I think they\\'re wrong, it\\'s magnificent, and I\\'m proud to call it home.",
  "categoryId": "61",
  "version": "0.1",
  "author": "Black Bart",
  "createdUnix": "1326024899",
  "updatedUnix": "1326025009",
  "containsAdultContent": false,
  "uploadedBy": "blackbart",
  "primaryFile": null,
  "files": [
    {
      "fileId": "17843",
      "name": "Silent_Followers_v0_1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Silent_Followers_v0_1-5658-0-1.7z",
      "uploadedUnix": "1326025009",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/8a32562ddc940588faf869d7d6c4dce30ba2cec5c71d3847d0ffab2aa31a6400/analysis/1406593571/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silent_Followers_v0_1-5658-0-1.7z?fid=17843&ttl=1535762543&ri=8192&rs=8192&setec=8c7ab4fbe3dc2dc341f2ed13d58f6bcd"
    }
  ]
}