{
  "modId": 56601.0,
  "modName": "Completed Main and DLC.7z",
  "summary": "Nord Female, Completed Main Quest, Dragonborn DLC and Dawnguard DLC\r<br />",
  "descriptionHtml": "[size=6][center][u][i][b]THIS SAVEGAME IS FOR EITHER LEGENDARY EDITION OR THE ORIGINAL GAME PLUS ALL DLC - IT WILL NOT WORK WITHOUT DAWNGUARD AND DRAGONBORN&#33;[/b][/i][/u][/center][/size][center]\r<br />[size=6]-- 2016 (October) Update #2.1 --\r<br />[/size]\r<br />For me, this is the Ultimate RPG Savegame.\r<br />[i][u][size=3]The 2.0 update was removed due to a glitch caused by a mod that overpowered the Enchanting Buff. \r<br />Please use the 2.1 Version&#33;\r<br />\r<br />[/size][/u][/i][/center]After a few requests, I started the game from scratch and ran through all of the DLC main quests. Alduin is defeated. Miraak is Defeated. Lord Harkon is defeated. No other side quests were completed unless they were required to be completed for the main/DLC quests (with the exception of two Soul Cairn Quests: Arvak&#39;s Skull and the Impatience of a Saint). No side was chosen in the Civil War, the College was joined but abandoned at Under Saarthal.  Grelod the Kind is still alive.  The thieves guild quest has not been started. The player is neither a vampire nor a werewolf.  After the treaty conference, the character bolted and Delphine has not had a chance to tell the Dragonborn to kill Paarthurnax. \r<br />\r<br />Extra items are in Breezehome, in the player&#39;s bedroom chest (I purchased Breezehome so that I would have a place to safely stash clutter and park Lydia). The items in the chest include all of Miraak&#39;s armor, a full set of Snow Elf armor, and a few other items gathered while questing. \r<br />The character is wearing a full set of unenchanted Dawnguard Armor, and is carrying Auriel&#39;s Bow, 10 Steel Arrows and 10 of each of the cursed and blessed arrows, plus the quest items that cannot be removed (Black Books, etc.).\r<br />\r<br />Serana is at Fort Dawnguard. Lydia is lurking about Breezehome. \r<br />\r<br />A few shouts have been learned or earned.  A few spells have been learned. Stamina, Magicka and Health have been reset to 100. All perk points have been spent and removed. All skills have been set to 10 (no racial balance done).  Jenniera is a female Nord, so she comes with the racial characteristics, and that&#39;s it.  You can, of course change race and gender using the console command [i]showracemenu[/i] .  I don&#39;t know if this horks up the game or not.  I always choose a female Nord, so I&#39;ve never tried to change race or gender. YMMV.\r<br />\r<br />Note: I once again made use of Script Scalpel (see link below) to clean up the savegame and stop all running scripts and remove script references that were broken or orphaned.  I played for a while after doing so, just to check the file I uploaded, and I can&#39;t find anything broken. Again, YMMV.\r<br />\r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[center][size=5]-- 2016 (September) Update --\r<br />[/size][size=3][/size][/center][center][size=3]\r<br />[/size][size=3]It was brought to my attention in the Discussion Section that there were a couple of problems with the 1.1 version of this file.  I have fixed the following issues:[/size][/center]\r<br />\r<br />[list]\r<br />[*]Returned Miraak Armor and Weapons (I had sold them somewhere in the game - but not to the Black Market)\r<br />[*]Removed some over-powered items I had used to finish the game more quickly\r<br />[*]Fixed the HP settings\r<br />[*]Fixed the Carry Weight Settings\r<br />[/list]\r<br />The player currently has the Black Market Power enabled.  There is gear stored with the Summoned Daedra.\r<br />\r<br />I also ran the [url=http://www.nexusmods.com/skyrim/mods/53045/?]Script Scalpel[/url] on the Save Game and removed all instances of scripts and other flotsam and jetsam that might cause the game to crash.  As far as I can tell, this game is clean and should run so long as you meet the requirements:\r<br />\r<br />[list=1]\r<br />[*]Have Dawnguard AND Dragonborn DLC (or)\r<br />[*]Have Legendary Edition\r<br />[/list]\r<br />Note: I chose to NOT redo this with the High Resolution Pack Installed. I figured some people might not have it.  This should not impact users who have it. I also did not include Hearthfire when saving this game - this should also not impact any users.\r<br />\r<br />Also, because I sold Miraak&#39;s Armor and Weapons somewhere in-world, I had to use the console to summon the Miraak NPC and then remove all of his items.  I was NOT going to play the game all over again or hunt around Skyrim for who I had sold these items to originally.  This means that there is a SLIGHT chance that some vendor MIGHT have Miraak&#39;s gear. \r<br />\r<br />Have fun.\r<br />\r<br />TD.\r<br />\r<br />\r<br />[i][center]--- UPDATED ---[/center]\r<br />Note: I don&#39;t know a lot about editing ESS files, but after someone told me they were crashing loading this savegame, I opened the file using SaveTool.exe.  There were several hundred instances of orphaned scripts which I removed.  I ran the game using this save file, and asked a couple friends to do the same, and no one had any issues.  Hopefully this works for everyone.  My apologies to anyone who had a CTD using the original.\r<br />-----------------------------------------------------------------------------------\r<br />[/i]I spent some time looking for a savegame that had the Main and DLC quests completed, as well as an Imperial Victory over the  Stormcloaks. I didn&#39;t find any that looked like what I wanted, so I just did my own.  Once I completed the Main Quest and the Dragonborn and Dawnguard DLC main quests, I reset the character (a Nord female) back to as close to factory defaults as possible.\r<br />\r<br />She is equipped with Auriel&#39;s Bow, Dawnguard armor, Blades armor, a bow, a couple of maces, some other stuff.  She has a little over a 1,000 gold.  She has Black Market, Mara&#39;s Boon, and a couple of other Dragonborn powers, as well as a few Dawnguard spells.\r<br />\r<br />I played through with a bunch of mods I liked, and when I finished, I uninstalled all the mods, reset the character and saved the game.  There are probably a couple of loose scripts in the savegame.  I tried to clean everything up.  To verify that everything was working right, I deleted my entire Skyrim game folder and told Steam to re-download the game fresh.  I played a couple of hours with this save game in a fresh install, and there were no hiccups or glitches.\r<br />\r<br />None of the major sub quests are done.  She has killed Grelod the Kind and been invited into the Dark Brotherhood, but has not gone to the door yet.  She has not joined the Companions, has never been a werewolf or a vampire.  She has been invited to join the Thieve&#39;s Guild, but has not started &#34;Taking Care of Business&#34; yet.\r<br />\r<br />Hopefully someone can use this savegame as a kickoff for role playing and questing without the hassle of the main quests.",
  "categoryId": "43",
  "version": "2.1",
  "author": "Tom Davidson",
  "createdUnix": "1406958426",
  "updatedUnix": "1475952072",
  "containsAdultContent": false,
  "uploadedBy": "tomdavidsonjr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120263",
      "name": "Jenniera - Female Nord - Completed Main and DLC",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3685",
      "fileName": "Jenniera - Female Nord - Completed Main and DLC-56601-1-0.7z",
      "uploadedUnix": "1406958730",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/529d1b02f663f63ecfd5461939903c01e6f34f76ebeff28bbf80ef52cd83d393/analysis/1406958789/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jenniera%20-%20Female%20Nord%20-%20Completed%20Main%20and%20DLC-56601-1-0.7z?fid=1000120263&ttl=1535842040&ri=8192&rs=8192&setec=c57309a9ce4b00043aeeb7010edfb0b8"
    },
    {
      "fileId": "1000120305",
      "name": "Updated - Completed Main and DLC - Cleaner Save",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3583",
      "fileName": "Updated - Completed Main and DLC - Cleaner Save-56601-1-1.7z",
      "uploadedUnix": "1406988830",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/80a0ff58c6b3fa2e1582c603674b18e2a80e00a80f5d0e5a1907ab5c178bb213/analysis/1408173988/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated%20-%20Completed%20Main%20and%20DLC%20-%20Cleaner%20Save-56601-1-1.7z?fid=1000120305&ttl=1535842041&ri=8192&rs=8192&setec=2a094d74da1201e1ad9d4fd67329b1f5"
    },
    {
      "fileId": "1000220318",
      "name": "Updated - Completed Main and DLC - Cleaner Save",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3523",
      "fileName": "Updated - Completed Main and DLC - Cleaner Save-56601-1-2.7z",
      "uploadedUnix": "1473533469",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/543240206a4af067fbccfbdbbdb202f4b6342399ae888f27a062b6cd731dede8/analysis/1473533522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated%20-%20Completed%20Main%20and%20DLC%20-%20Cleaner%20Save-56601-1-2.7z?fid=1000220318&ttl=1535842041&ri=8192&rs=8192&setec=e02aae4f08ba30cd41536f1ef8eaaa8c"
    },
    {
      "fileId": "1000223465",
      "name": "Completed Legendary",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2951",
      "fileName": "Completed Legendary-56601-2-1.7z",
      "uploadedUnix": "1475952072",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/fcbf3439d46553c3e8645bfaf62f698afd93e3735d23defd7e051dbe55acf841/analysis/1475952125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Completed%20Legendary-56601-2-1.7z?fid=1000223465&ttl=1535842042&ri=8192&rs=8192&setec=7855254863f9617ee3f2d1e7ba81bcd0"
    }
  ]
}