{
  "modId": 56625.0,
  "modName": "Proudspire Manor Hearthfire Overhaul",
  "summary": "Proudspire Manor is the most expensive house in the game to purchase and decorate, but it&#39;s never been as well-appointed as the other homes in \r<br />\r<br />Skyrim. I had hoped that it would be expanded and improved whenever Hearthfire was released, but it wasn&#39;t. So I decided to re-arrange some \r<br />\r<br />things, re-configure some rooms",
  "descriptionHtml": "Proudspire Manor is the most expensive house in the game to purchase and decorate, but it&#39;s never been as well-appointed as the other homes in Skyrim. I had hoped that it would be expanded and improved whenever Hearthfire was released, but it wasn&#39;t. So I decided to re-arrange some things, re-configure some rooms, and include some new Hearthfire amentities to the property to make it a more attractive housing option.\r<br />\r<br />And honestly, I got sick of having to fend off monsters as soon as I walked outside of one of a Hearthfire Manor. Or having to worry about the spouse being kidnapped. Or the spouse complaining about the surrounding area. Or even worse, the *kids* complaining about the house&#33; Anyways, I&#39;ve broken down the major changes that I&#39;ve made to each area of Proudspire Manor below. You can also check out the screenshots to see how each area looks before and after being upgraded. \r<br />\r<br />If you are interested in decorating your home in great detail, I highly recommend downloading and installing either the [url=http://www.nexusmods.com/skyrim/mods/52583/?]Jaxonz Positioner[/url] mod (requires [url=http://skse.silverlock.org/]SKSE[/url] and [url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url]) or [url=http://www.nexusmods.com/skyrim/mods/25068/?]Placeable Statics - Move Anything[/url] and [url=http://www.nexusmods.com/skyrim/mods/13586/?]Decorator Assistant[/url] to make things a bit easier on yourself&#33;\r<br />\r<br />\r<br />[b][u]Alchemy Laboratory[/u][/b]\r<br />\r<br />- A variety of containers have been placed in the vicinity of the Alchemy Laboratory. These include a small cupboard, a barrel, a few sacks, and an apothecary&#39;s satchel.\r<br />\r<br />- All of the alchemy ingredients from the original layout are now spread across two large noble shelves.\r<br />\r<br />- Most of the potions that were originally strewn about the Manor now rest on a shelf that hangs next to the Alchemy Lab.\r<br />\r<br />\r<br />[b][u]Armory & Trophy Room (New)[/u][/b]\r<br />\r<br />- The old Housecarl&#39;s Bedroom has been expanded and converted into an Armory & Trophy Room. The area in the basement with the mead cupboard is now considered to be part of this section of the home and will also see upgrades whenever this area is decorated.\r<br />\r<br />- The Armory & Trophy room features three large trophy bases, four small trophy bases, four large display cases, two mannequins, and four weapon racks capable of holding four weapons each. The display cases do NOT have activators and are set up like the Hearthfire display cases.\r<br />\r<br />- Two mannequins will appear in the hall leading to the Alchemy and Enchanting Laboratories whenever this area is upgraded.\r<br />\r<br />- A weapon cabinet and an armor cabinet will also appear next to the mead cupboard whenever this area is upgraded.\r<br />\r<br />- The mead barrels in the mead cupboard are now useable just like the ones in the cellar in homes constructed in Hearthfire.\r<br />\r<br />\r<br />[b][u]Blacksmith&#39;s Forge (New)[/u][/b]\r<br />\r<br />- The old Alchemy Laboratory has been converted into a Blacksmith&#39;s Forge. It includes an anvil, a smelter, a tanning rack, a grindstone, and a workbench.\r<br />\r<br />- A shield/weapon rack is positioned above the workbench.\r<br />\r<br />- A pile of firewood, a strong box, a knapsack, and four safes have been positioned right next to the lower entrance of Proudspire Manor.\r<br />\r<br />\r<br />[b][u]Children&#39;s Bedroom Changes[/u][/b]\r<br />\r<br />- The Children&#39;s Bedroom now exists as part of the base floorplan of Proudspire Manor. The undecorated version of the room is completely empty. If you have no desire to actually adopt children and decorate the Children&#39;s Bedroom, you can use console commands and/or mods to decorate the room however you like. \r<br />\r<br />[b][u]Enchanting Laboratory Changes[/u][/b]\r<br />\r<br />- The Alchemy and Enchanting Laboratories now share the same area on the ground floor.\r<br />\r<br />- A variety of containers have been placed in the vicinity of the Enchanting Table, including a small wardrobe, a small cupboard, a chest, a satchel, and six strongboxes.\r<br />\r<br />- Purchasing the Enchanting Laboratory will add another two four-shelf bookcases in the corner of the room.\r<br />\r<br />\r<br />[b][u]Kitchen Changes[/u][/b]\r<br />\r<br />- An alcove has been added to the Kitchen that includes the oven, a second cupboard, a variety of foodstuffs, a rack for drying herbs, and an ring for hanging animals.\r<br />\r<br />- Four more planters have been placed next to the kitchen windows to cultivate ingredients for cooking or alchemy.\r<br />\r<br />- The cooking pot has been pulled back from the fireplace to avoid clipping during the cooking animation.\r<br />\r<br />- A butter churn has been added to the kitchen.\r<br />\r<br />- The two-shelf bookcase has been removed from the kitchen altogether.\r<br />\r<br />\r<br />[b][u]Living Areas & Stairwell Changes[/u][/b]\r<br />\r<br />- Eight planters have been added in the stairwell (upper level for plants that need sunlight, lower level for fungus that doesn&#39;t).\r<br />\r<br />- Rugs have been placed on each level of the stairwell.\r<br />\r<br />- The main living area now has a shrine to the Nine Divines and two more planters for growing alchemical ingredients.\r<br />\r<br />- A desk and chair have been added near the shrine in the main living area.\r<br />\r<br />- The bookcase and the noble shelf in the main living area now have four shelves each.\r<br />\r<br />- The Juniper Tree has been replaced with a &#34;regular&#34; tree.\r<br />\r<br />\r<br />[b][u]Master Bedroom Changes[/u][/b]\r<br />\r<br />- The Master Bedroom now has a shield & weapon mount on the wall where the small Noble&#39;s Table with food and drink on it used to be.\r<br />\r<br />- The chest at the foot of the bed has been changed from a regular chest to a Noble&#39;s Chest to match the rest of the decor of the room.\r<br />\r<br />- The two-shelf bookcase has been replaced with a four-shelf bookcase.\r<br />\r<br />- A Large Wardrobe has been placed next to the two-shelf bookcase.\r<br />\r<br />- A second Noble End Table has been placed on the right side of the bed.\r<br />\r<br />- Round green rugs have been placed on each side of the bed.\r<br />\r<br />- One of the healing potions has been moved onto the Noble&#39;s Nightstand.\r<br />\r<br />- The dinner table next to the Master Bedroom is now stocked with food and drink as appropriate for a &#34;noble&#34; household.\r<br />\r<br />- The living Area outside of the Master Bedroom now has six planters for growing alchemical ingredients.\r<br />\r<br />- The living area outside of the Master Bedroom now has a large noble shelf and a four shelf bookcase.\r<br />\r<br />\r<br />[b][u]Housecarl&#39;s Bedroom Changes[/u][/b]\r<br />\r<br />- The Housecarl&#39;s Bedroom has been moved so that it is adjacent to the hallway leading to the kitchen.\r<br />\r<br />- It will also automatically be decorated whenever you are made Thane of Haafingar.\r<br />\r<br />- A two Noble Shelves and a four shelf bookcase have been added to this room.\r<br />\r<br />- Two more planters can be found next to the window and the bookcase.\r<br />\r<br />\r<br />[b][u]Other Changes[/u][/b]\r<br />\r<br />- Jordis the Sword Maiden now has an assigned patrol route. She also takes time out of her day to eat breakfast, lunch, and dinner, and will go to sleep at around 9 PM every evening. However, if you either 1) marry her before adopting children and select &#34;Let&#39;s move to my house in Solitude&#34; instead of &#34;Let&#39;s move into your house&#34; whenever prompted where you want to love or 2) you marry her after adopting children, she will abandon her patrol route and set schedule and default to the regular Proudspire Manor Spouse Sandbox package.\r<br />\r<br />- If you marry Jordis - regardless of whether she is patrolling or sandboxing - she will still sleep in the couple&#39;s bed in the Master Bedroom and should not sleep in her original Housecarl&#39;s bed.\r<br />\r<br />- The exterior window on the lower level of the Manor that shouldn&#39;t really be there has been bricked over accordingly.\r<br />\r<br />- A few tall pine trees have been added to the rear exterior of the manor.\r<br />\r<br />- The fern sprouting from the stone at the staircase leading to the ground floor and the moss growing on the exterior of the building will be removed whenever you upgrade the patio.\r<br />\r<br />- Lighting throughout the residence has been tweaked in order to prevent light sources from bleeding through between floors and rooms.\r<br />\r<br />- The Solitude Decoration Guide has been updated to reflect the new rooms that have been added and the changes to the existing spaces.\r<br />\r<br />- Falk Firebeard offers you upgrade packages in alphabetical order and the menu is arranged in such a way that you can quickly blaze through buying all of them ASAP&#33;\r<br />\r<br />- I added a chopping block on the side of Victoria Vici&#39;s house for the player to use.\r<br />\r<br />\r<br />[b][u]Installation[/u][/b]\r<br />\r<br />If you are starting a new game - or are in the middle of a game but have neither entered Proudspire Manor nor upgraded it, you&#39;re in luck - you should be able to just extract the mod and the accompanying script files into your Data and Scripts folders, enable the esp, and be ready to rock. PSMHFOverhaul.esp needs to be placed in the Skyrim&#92;Data folder, and the accompanying scripts (TIF_PSMARMORY.pex and TIF_PSMFORGE.pex) need to be placed in the Skyrim&#92;Data&#92;Scripts folder.\r<br />\r<br />If you have already entered or decorated Proudspire Manor at some point during the game, you&#39;re also PROBABLY ok, but if the house exhibits any odd behavior (weapon racks that don&#39;t work, bookshelves that should have disappeared but still hang in empty space, etc.), installing this mod gets a little more complicated. Here&#39;s what you&#39;ll need to do:\r<br />\r<br />1. Pick up ALL of the clutter that you have used to decorate Proudspire Manor and empty ALL of the containers inside of the Manor.\r<br />\r<br />2. Get every NPC out of the Manor somehow. Relocate the family, send the kids outside to play, take on Jordis as a companion, whatever it takes.\r<br />\r<br />3. Go to any other interior cell, make a NEW save, and then quit to the desktop.\r<br />\r<br />4. Activate this mod.\r<br />\r<br />5. Load up the new save, enter the house, and make sure that everything works properly.\r<br />\r<br />If things aren&#39;t working properly. Then you&#39;ll need to do the following:\r<br />\r<br />A. Reload the new save that you made.\r<br />\r<br />B. Open the console and (while you are still in an interior cell) type in the following commands:\r<br />\r<br />pcb\r<br />resetinterior 00016A06 \r<br />\r<br />C. Leave the console and save the game. Proudspire Manor has now been reset and any decorations that you have already purchased should be in place in the Manor. They may be in different positions then the vanilla game, but they should be there&#33;\r<br />\r<br />MANY thanks to Necrocytosis and goatk for posting about this process on the Nexus Forums&#33;\r<br />\r<br />\r<br />[b][u]Incompatibility[/u][/b]\r<br />\r<br />This mod will *probably* conflict with any mods that change Proudspire Manor, any of the objects contained within, or the marriage and adoption scripting.\r<br />\r<br />\r<br />[b][u]Frequently Asked Questions[/u][/b]\r<br />\r<br />[b]Q.[/b] There are two cooking pots in the Kitchen now&#33; What gives?\r<br />\r<br />[b]A.[/b] If you have the Unofficial Skyrim Patch installed (and I suggest that you do), it restores a cooking pot to the Kitchen that was somehow deleted in Hearthfire. However, it&#39;s not set as far back as mine is, so whenever you use it, your head still clips through the fireplace whenever you use it. Your best bet is to use the console to select their cooking pot and disable it. You can do this by typing the following commands into the console:\r<br />\r<br />prid xx10C205 (XX = load order for the Unofficial Skyrim Patch)\r<br />markfordelete\r<br />\r<br />And then leave Proudspire Manor and come back inside, and the extra cooking pot should be gone&#33;\r<br />\r<br />[b]Q.[/b] The Housecarl&#39;s Room isn&#39;t decorated and/or won&#39;t decorate after I complete the quest &#34;Thane of Haafingar&#34;.\r<br />\r<br />[b]A.[/b] Leave Proudspire Manor, go into the console and then type the following:\r<br />\r<br />prid 000e25d4\r<br />enable\r<br />\r<br />That should switch the Housecarl&#39;s Room to the &#34;decorated&#34; state.\r<br />\r<br />[b]Q.[/b] I adopted a dog and it&#39;s causing traffic jams in my house&#33; Jordis and the children can pass each other in the stairwell just fine, but the dog blocks the path for everyone&#33;\r<br />\r<br />[b]A.[/b] Dogs are generally a pretty big pain in the ass in Proudspire Manor. Between blocking the stairwell and their constant barking, I personally recommend that you don&#39;t adopt one. But if you MUST take on a dog as a family pet, you should probably drop him/her off in the Armory & Trophy Room to minimize his blockage of other NPC patrol/sandbox routes. Good luck&#33;\r<br />\r<br />[b]Q.[/b] You included a lot of clutter in this mod, but the various NPCs wandering around the Manor keep knocking stuff all over the place&#33; How can I put items back in their original positions without having to try and drag them all over the place?\r<br />\r<br />[b]A.[/b] Go into the console, click the item in question, and then type in &#34;recycleactor&#34; and press enter, and it will put the item back in its original position.\r<br />\r<br />[b]Q.[/b] Sometimes whenever I place or remove books from the bookshelves in the Manor, books end up disappearing - it&#39;s like the shelf is eating them&#33;\r<br />\r<br />[b]A.[/b] Another issue in the base game that doesn&#39;t seem to have an easy solution. I recommend adding or removing ALL of the books from a shelf in one go; this seems to minimize the chances that the bookshelf will get confused and start eating books.\r<br />\r<br />\r<br />[b][u]History[/u][/b]\r<br />\r<br />1.0 - 08/02/2014 - Initial release.\r<br />\r<br />1.1 - 08/02/2014 - Realized that TIF_PSMARMORY.pex and TIF_PSMFORGE.pex were accidentally excluded from the 7z archive, so I added them and re-uploaded the mod accordingly.",
  "categoryId": "67",
  "version": "1.1",
  "author": "Mogomra",
  "createdUnix": "1407003981",
  "updatedUnix": "1407108254",
  "containsAdultContent": false,
  "uploadedBy": "Mogomra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120538",
      "name": "Proudspire Manor Hearthfire Overhaul",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Proudspire Manor Hearthfire Overhaul-56625-1-1.7z",
      "uploadedUnix": "1407108254",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/db66287e720854bcc163f82510d2e4ef45b734cee48ba2ccde82a18352b269c5/analysis/1407108321/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proudspire%20Manor%20Hearthfire%20Overhaul-56625-1-1.7z?fid=1000120538&ttl=1535842082&ri=8192&rs=8192&setec=2bbb0a730c0e2a163b05573157998a52"
    }
  ]
}