{
  "modId": 56627.0,
  "modName": "Yofisu Dragon Alchemy",
  "summary": "Allows the character to use dragon bone and dragon scale along with some typical items that have little standard use to produce some dragon based ingredients for alchemy. These ingredients can be used to mix some new potions with both typical and more distinct effects. For example, you can craft a potion to Become Ethereal.",
  "descriptionHtml": "\r<br />[size=5][b][font=Verdana]\r<br />[u]Description:[/u][/font]\r<br />[/b][/size][font=Verdana][size=2]Ever imagined to what good use you could put all the clothes irons you find? Maybe you imagined using them to smash Lydia&#39;s kneecaps until she stopped standing in the doorway. This isn&#39;t &#34;that” mod. With this mod take those clothes irons and make some use of them to gain some unique alchemy ingredients and effects. Not just clothes irons. You have all that dragon scale and dragon bone and so few people that want to buy it and those that do may not have a lot of coin. You are the Dragonborn and you produce dragon remains faster than the market can absorb them. By the Gods, if you are level 100+ smithing and can create Dragon Armor I bet you still collect more smelly dragon remnants than you can do away with.  Thus was born Dragon Alchemy. \r<br />\r<br />With Dragon Alchemy you can take dragon bone and dragon scale to your favorite smelter location and combine it with other materials that have no use or little value to create the new ingredients of Dragon Ash, Dragon Bone Meal, Dragon Dust, Dragon Ooze and Dragon Salts. It will have you asking yourself &#34;Why didn&#39;t I pick up those spigots?&#34; These new ingredients have some worth on the market but their best use is in Alchemy. Combine these ingredients together with one another or with other standard ingredients and get some nice effects. See the section below marked off as a spoiler area for the list of effects. \r<br />\r<br />**See Page Change Log section below for information on major page edits.\r<br />\r<br />[/size][/font][font=Verdana][b][u][size=5]Details:\r<br />[/size][/u][/b][size=2]This is a very small mod that creates:\r<br />      21 smelting recipes\r<br />      5 new ingredients\r<br />      13 different ingredient effects that vary in magnitude based on skill\r<br />      5 ingredient effects that are specific to this mod\r<br />      new ingredient meshes\r<br />      new textures for the meshes\r<br />\r<br />Unlike version  1 of the mod there is an economic gain when performing each step. Both smelting raw materials into ingredients and combining ingredients at an alchemy table will produce a result of greater value than the raw materials. The amount of gain for the smelting process will be on average about 2x the value of the raw materials. For the resulting potions the value gain will be dependent on the magnitude of the potion effects which depends on alchemy skill and other boons while performing the alchemy; thus, potions can range from 2x-20x in value of their raw materials. [/size][/font]\r<br />\r<br />[b][size=4][font=Verdana]Smelter Recipes[/font]\r<br />[/size][/b][font=Verdana]The following are the smelter recipes to create ingredients the (xN) beside the smelting product name is the quantity produced for the recipe under it.\r<br />\r<br />[b]Dragon Ash (x3)[/b]\r<br />[list][*]1    x Dragon Scales[/*]\r<br />[*]2    x Charcoal[/*]\r<br />[*]8    x Linen Wrap[/*]\r<br />[/list]\r<br />[b]Dragon Ash (x6)[/b]\r<br />[list][*]2    x Dragon Scales[/*]\r<br />[*]10   x Tankard[/*]\r<br />[*]12   x Wooden Bowl[/*]\r<br />[/list]\r<br />[b]Dragon Ash (x6)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]2    x Yellow Book of Riddles[/*]\r<br />[*]5    x Spigot[/*]\r<br />[/list]\r<br />[b]Dragon Ash (x5)[/b]\r<br />[list][*]1    x Dragon Scales[/*]\r<br />[*]1    x Dragon Salts[/*]\r<br />[/list]\r<br />[b]Dragon Bone Meal (x6)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]2    x Spigot[/*]\r<br />[*]6    x Kettle[/*]\r<br />[/list]\r<br />[b]Dragon Bone Meal (x7)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]1    x Dwemer Cog[/*]\r<br />[*]7    x Clothes Iron[/*]\r<br />[/list]\r<br />[b]Dragon Bone Meal (x6)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]3    x Uncommon Taste (Book)[/*]\r<br />[*]10   x Burned Book[/*]\r<br />[/list]\r<br />[b]Dragon Bone Meal (x9)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]1    x Dragon Dust[/*]\r<br />[/list]\r<br />[b]Dragon Dust (x6)[/b]\r<br />[list][*]2    x Dragon Scales[/*]\r<br />[*]1    x Wooden Plate[/*]\r<br />[*]2    x Blacksmith Bellows[/*]\r<br />[/list]\r<br />[b]Dragon Dust (x2)[/b]\r<br />[list][*]1    x Dragon Scales[/*]\r<br />[*]1    x Broom[/*]\r<br />[*]12   x Tankard[/*]\r<br />[/list]\r<br />[b]Dragon Dust (x6)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]2    x Blacksmith Tongs[/*]\r<br />[*]10   x Wooden Plate[/*]\r<br />[/list]\r<br />[b]Dragon Dust (x15)[/b]\r<br />[list][*]2    x Dragon Bone[/*]\r<br />[*]8    x Lantern[/*]\r<br />[*]3    x Blacksmith Tongs[/*]\r<br />[/list]\r<br />[b]Dragon Dust (x6)[/b]\r<br />[list][*]1    x Dragon Scales[/*]\r<br />[*]1    x Dragon Dust[/*]\r<br />[/list]\r<br />[b]Dragon Ooze (x6)[/b]\r<br />[list][*]2    x Dragon Scales[/*]\r<br />[*]5    x Clam Meat[/*]\r<br />[*]10   x Lantern[/*]\r<br />[/list]\r<br />[b]Dragon Ooze (x3)[/b]\r<br />[list][*]1    x Dragon Scales[/*]\r<br />[*]8    x Bloody Rags[/*]\r<br />[*]1    x Blacksmith Hammer[/*]\r<br />[/list]\r<br />[b]Dragon Ooze (x6)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]8    x Lantern[/*]\r<br />[*]15   x Burned Book[/*]\r<br />[/list]\r<br />[b]Dragon Ooze (x8)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]1    x Dragon Bone Meal[/*]\r<br />[/list]\r<br />[b]Dragon Salts (x5)[/b]\r<br />[list][*]1    x Dragon Bone[/*]\r<br />[*]2    x Kettle[/*]\r<br />[*]3    x Spigot[/*]\r<br />[/list]\r<br />[b]Dragon Salts (x6)[/b]\r<br />[list][*]2    x Dragon Scales[/*]\r<br />[*]3    x Wooden Bowl[/*]\r<br />[*]10   x Clothes Iron[/*]\r<br />[/list]\r<br />[b]Dragon Salts (x11)[/b]\r<br />[list][*]3    x Dragon Scales[/*]\r<br />[*]3    x Dwemer Cog[/*]\r<br />[*]8    x Bloody Rags[/*]\r<br />[/list]\r<br />[b]Dragon Salts (x5)[/b]\r<br />[list][*]1    x Dragon Scales[/*]\r<br />[*]1    x Dragon Ooze[/*]\r<br />[/list]\r<br />\r<br />Because those are a lot of recipes and you may not wish to see them all in your MISC menu section when at the smelter I have added an MCM menu. In the MCM menu select then Dragon Alchemy menu screen. You will see a single option - &#34;Show all dragon alchemy recipes&#34; by default it is marked as enabled. If you un-mark this option you should no longer see the recipe at the smelter unless you have the materials to use the recipe. You can also set the GlobalVariable - YofisuListAllRecipes to 0 for false/unchecked or 1 for true/checked.\r<br />\r<br />[size=4][b]Alchemy Recipes[/b][/size]\r<br />[spoiler][size=2]Ingredient effects can be found in this [url=http://www.nexusmods.com/skyrim/mods/56627/?tab=4&&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D56627%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D1975494&pUp=1]forum thread[/url] with a sticky post.[/size] [/spoiler]\r<br />\r<br />[size=2]\r<br />The version 2 of this mod (the current version) has no changes to the base potion effects created or recipes but there are some changes in recipe magnitudes and values. \r<br /> --The negative effect potions have had their negative effect magnitudes shifted downward as compared to v1. This is because they were much higher than desired at high levels.\r<br /> --The values of the potions have been shifted upward significantly so that now you can make some decent coin if you were to actually resell them.\r<br />\r<br />\r<br />\r<br />Recommendations for alternate effects, magnitudes and durations on these effects at any or all skill levels or recipe changes for ingredient production are very welcome. \r<br />\r<br />Since the order of the effects for an ingredient may impact some folks more than others, especially depending on how you use perk points in your alchemy tree when it comes to tasting ingredients or getting a pure poison or pure potion please comment if the effect order gives you an undesired result. \r<br />\r<br />That outcome of mixing a potion can depend on variables where my testing samples may not have hit on a range that give the results you encounter Since there are multiple inputs that can slide in power across a wide range there is a lot of room for differing outcomes. The resulting potions should be along a range of results in all cases but there is always a possibility that a unexpected result occurs. I tried to cover the bases up through Alchemy skill 199 and about 100% additional boon on alchemy results.\r<br />\r<br />Any feedback on how you would like it differently balanced is encouraged. A proper balance is a very difficult thing and also a bit subjective. What feels nerfed for one may be OP for another. Thus feedback is encouraged.  [/size]\r<br />\r<br />[size=5][b][u]Installation:\r<br />[/u][/b][/size][size=2]\r<br />Use your favorite Mod Manager to handle the files or extract the files into your Skyrim Data folder and then add the plugin into your load order. The Data folder will contain the following files or additional folders as indicated in the following:\r<br />/data\r<br />---YofisuDragonAlchemy.esp\r<br />---/textures/yofisu/clutter/ingredients\r<br />------ 13 files\r<br />---/meshes/yofisu/clutter/ingredients\r<br />------ 5 files\r<br />---/scripts\r<br />------ YofisuDragonAlchemyConfig.pex\r<br />-------/source\r<br />---------- YofisuDragonAlchemyConfig.psc\r<br />\r<br />The script file is there only to create the MCM menu.\r<br />\r<br />\r<br />This mod can go anywhere you&#39;d like into the load order. It has limited dependencies. These dependencies are only to support the MCM menu. If you really need a non-MCM menu version let me know or grab this mod and open it up in creation kit and delete the Quest YofisuDragonAlchemy. That quest exists only to provide the MCM menu. To use this mod with its MCM menu you will need:\r<br />[url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI v4.0+[/url]\r<br />[url=http://skse.silverlock.org/]SKSE v1.6.16+ (because SkyUI requires it)[/url]\r<br />\r<br />\r<br />No conflicts with other mods are known. If using ReProccer or T3nd0s Skyrim Redone then I suggest you place this mod before those mods or similar type mods in your load order. This mod uses a number of standard effects so anything that changes the behavior of potion or magic effects may change the effect of these potions. I have not tested when using Immersive Poisons for SkyRe as it has only been out since 4 Sept. 2014 and I just recently became aware of it. As soon as I can put together a Skyrim instance with SkyimRe and Immersive Poisons for SkyrimRe I will test the default outcome of Dragon Alchemy when used with these two mods.\r<br />[/size]\r<br />\r<br />[size=5][b][u]Credits:\r<br />[/u][/b][/size][size=2]Special thanks to Brumbek for allowing this mod to use some of [url=http://www.nexusmods.com/skyrim/users/283020]Brumbek&#39;s[/url] meshes for ingredients and some related textures from the  [url=http://www.nexusmods.com/skyrim/mods/8655/?]SMIM[/url] mod . If you aren&#39;t familiar with SMIM you should check it out. Any aesthetic faults in the meshes or textures of this mod are almost certainly my own. \r<br />\r<br />The following files in this mod are derivative or reused (with new name) assets from the SMIM mod by Brumbek. They are used in this mod with permission. If you wish to derive work for redistribution from this mod and use of the following files please seek permission from Brumbek:\r<br />---/data/meshes/yofisu/clutter/ingredients\r<br />------ All 5 files\r<br />---/data/textures/yofisu/clutter/ingredients\r<br />------ Any file with dragonbonemeal in the name\r<br />------ Any file with dragondust in the name\r<br />------ Any file with dargonooze in the name\r<br />------ Any bowl with ingredientbowl in the name\r<br />\r<br />All other files not attributed in the preceding text are the full rights of the user Yofisu and the use of these files are granted unconditionally without need for credit or permission. \r<br />\r<br />[/size]\r<br />[size=5][b][u]Page Change Log:\r<br />[/u][/b][/size][/font][font=Verdana][size=2]\r<br />[list][*]13 Sept. 2014: Changed to reflect the V2 version of the mod[/*]\r<br />[*]9 Sept. 2014: Added additional info on load order to Installation section to cover SkyRimRe, ReProccer and Immersive Poisons for SkyrimRe[/list]\r<br />[/size]\r<br />[/font]",
  "categoryId": "94",
  "version": "2.0.0",
  "author": "Yofisu",
  "createdUnix": "1407079943",
  "updatedUnix": "1410654476",
  "containsAdultContent": false,
  "uploadedBy": "Yofisu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120481",
      "name": "Dragon Alchemy v1-0-0",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "25546",
      "fileName": "Dragon Alchemy v1-0-0-56627-1-0-0.7z",
      "uploadedUnix": "1407079448",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/a3dda7884521011b2678cbd172489d1e4d8b1ffe63a5c6ec1a6b863d913d0e01/analysis/1408174622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Alchemy%20v1-0-0-56627-1-0-0.7z?fid=1000120481&ttl=1535842084&ri=8192&rs=8192&setec=130621d0213603e98f35c5400a234466"
    },
    {
      "fileId": "1000126768",
      "name": "Yofisu Dragon Alchemy",
      "version": "2.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25551",
      "fileName": "Yofisu Dragon Alchemy-56627-2-0-0.7z",
      "uploadedUnix": "1410654476",
      "modVersion": "2.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/89194e4efc2926e3cdbd1c6b90750436cc0f849d225f9072c1b7dea703bad894/analysis/1410654552/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yofisu%20Dragon%20Alchemy-56627-2-0-0.7z?fid=1000126768&ttl=1535842085&ri=8192&rs=8192&setec=6de08907c32592b520d1908c50727a60"
    }
  ]
}