{
  "modId": 56700.0,
  "modName": "Providence _ A Settlement Near Ivarstead",
  "summary": "Some called it a place where dreams would go to die.\r<br />Those who were supremely more hopeful gave it a name instead.\r<br />Providence awaits its place on the map .. and its place in history.",
  "descriptionHtml": "Providence _ A Settlement Near Ivarstead \r<br />\r<br />-----------\r<br />Backstory:  &#34;Birthplace of the Dragonborn Insurgency&#34; \r<br />-----------\r<br />\r<br />&#34;Word is spreading like mage fire&#34; and some of Skyrim&#39;s citizenry were not satisfied with just idle chatter.  At first there were simple, spontaneous, though sometimes illegal gatherings in the holds - voices raised in chants of &#34;Dovahkiin&#33;&#34;.  Even demonstrations of this kind did not go unnoticed long by certain Jarls - jealous of the allegiance they demanded. Yet Followers of the Dragonborn began to unite en masse in their desire to demonstrate their fealty to another.  The campfires of one assemblage at the foot of the &#39;7000 Steps&#39; grew in such number as to light up the entire landscape around Ivarstead - &#39;like evening stars&#39;. Spies scurried back to their masters with new and exaggerated reports, for no signs of aggressive behavior were ever demonstrated or witnessed, of the &#34;insurgency at our doorstep&#34;.\r<br />  \r<br />As several of the more ardent and skilled of the Followers began work on a permanent structure where they could meet, form alliances, and give home to the legend they had yet to encounter,  a ramshackled and long abandoned livery outside of town became the starting point of their efforts and in a surprisingly short while the settlement of &#34;Providence&#34; grew to completion.  Still there was no sign of the Dragonborn.  As time passed in waiting for the leadership that had never materialized, followers with no one to follow became disheartened.  Though punishment surely awaited many as a result of their .. disloyalty, all would eventually part with their companions at Providence and return to their homes.\r<br />  \r<br />In the days, weeks, and months that would follow, as Tharin Silverlocke stepped out into the deathly still and cold night air, &#39;bout midnight as was his habit, his gaze moved upward to the glistening peak of the &#39;Throat of the World&#39; looming far above the city walls and his thoughts turned inward to a bitter remembrance of a taste of freedom won and lost and to the dream that had been theirs. Tharin heard a dog&#39;s distant bark and spoke the words softly, his breath appearing before him and punctuating each phrase, &#34;Yes, Jarl, you were misinformed ... it was not an insurgency.&#34;  And then Tharin smiled in a thinly disguised look of defiance as he turned to go back inside, &#34;But wait awhile longer, you bloodsucking tyrant ... soon, very soon - it will be.&#34;  And the slamming of the door behind him shook the quiet - echoing through the town and disturbing the slumber of all nearby.\r<br />\r<br />[center][img]http://static-6.nexusmods.com/15/mods/110/images/56700-4-1407193994.jpg[/img][/center]\r<br />\r<br />If you like your homes out of the ordinary and yet fit seamlessly into Skyrim geography and lore - this might very well be to your liking.  \r<br />Most suitable as a home base for any Dragonborn wishing to remain grounded with the common folk - could have a primary follower and others to lend support. (It has nine available sleep spots besides your own and two which are already in use.  And if you can run this mod with that many followers without your frame rate going to zero - my hat&#39;s off to you.)\r<br />\r<br />\r<br />-----------\r<br />Location:\r<br />-----------\r<br />This map-marked settlement is just south of Ivarstead where the roads meet - you can see the main hall&#39;s rooftop from the Inn and the bridge heading out of town. \r<br />\r<br />-----------\r<br />Features:\r<br />-----------\r<br />[list]\r<br />[*]The main hall is a weather-scripted exterior-cell construction which allows for rain being visible through open doors and shutters but won&#39;t spoil immersion by coming through the roof of this structure. (Credit for the script and its application go to [url=http://www.nexusmods.com/skyrim/mods/18651/?]Xilante[/url] and to [url=https://www.youtube.com/watch?v=SZwPcVrwlEU]DARKFOX127[/url].)\r<br />[*]Being of this construction (1) there are no load doors, (2) the views and sounds in and around Providence are real time, (3) &#39;Interior&#39; lighting is realistically affected by the time of day, and (4) companions can move naturally between the inside and outside areas of the settlement on their own (provided they have wandering capabilities). \r<br />[*]It&#39;s &#34;Frostfall&#34; friendly.\r<br />[*]Providence&#39;s main hall has corner food prep, corner armory, sleep alcoves for followers, private quarters for the player behind the elevated &#39;throne&#39; at the back, and dining, gathering and room-enough-to-dance areas through the middle - all in one level barn-sized structure.\r<br />[*]The mod is highly interactive.  (See *Activators below.)\r<br />[*]Comes with three NPCs: a blacksmith merchant, a seer spell merchant (both can be followers) and a horse. (See NPCs below for more info.)\r<br />[*]Most decorative objects are static, collision bound, and can&#39;t get knocked about. Any &#34;freebies&#34; you might find are pretty low-level and inconsequential. The two Vendor/Merchant/Followers sell leveled items of course.\r<br />[*]All storage is safe except for two containers: the &#34;Garbage Barrel [respawns]&#34; just outside the main gate, and the &#34;Well [respawns]&#34; for fresh drinking water.\r<br />[*]It has plenty of weapon racks .. but no mannequins.  I&#39;ve always thought mannequins were particularly out of place in anything but a castle or mansion .. beside their natural creepiness factor.\r<br />[*]All vanilla workstations are present - all realistically placed and with storage nearby. There&#39;s a separate seer&#39;s hut with enchanting table, blacksmith&#39;s for the workbench, sharpening stone and forge, smelter and iron ore to mine located up the hill behind the smithy, two wood-chopping locations; cooking and alchemy in the main hall.\r<br />[*]The wagon outside can be unloaded.\r<br />[*]Tables can be set with dishes and then food. \r<br />[*]The main gate can be bar-locked from the inside but will be open for your arrival.  (The side door remains un-barred so Girandha can move freely in or out as her ai packages dictate.)\r<br />[*]Navmeshed, cleaned with TES5edit; both versions thoroughly tested in-game before being released to the Nexus.\r<br />[/list]\r<br />\r<br />-----------\r<br />The NPCs:\r<br />-----------\r<br />The note attached with an arrow to the front barricade explains their presence to the Dovahkiin. The horse in the paddock was at the old deserted livery when the property was discovered as if waiting for something or someone. The other two were late arrivals and chose to take up residence.  Girandha, the Orc blacksmith [vendor], hit her old philandering husband with her blacksmith&#39;s hammer right between his eyes, killed him instantly, was tried and banished by her clan despite all the sympathy aligned in her favor.  The Dark One was similarly outcast but as a result of his &#34;feebleness&#34; and failing eyesight, so he followed the rumors to Providence` and set up his trade [spell vendor] in an empty supply hut nearby.  Both are followers as well - and Zeya, despite letting no one put a saddle on her, might just be waiting to serve her perceived master.\r<br />Though there was plenty of room to add more I felt that should be left up to the individual user and your own choice for a companion or two or more - depending on personal preferences that were not my own.\r<br />\r<br />-----------\r<br />Light Activators:  (Any and all that you can activate will be preset to the &#34;ON&#34; position when you arrive. Timed outdoor lights come on at 7p.m. and go out at 6a.m. and may require a game day to adjust to your game&#39;s time settings.)\r<br />----------- \r<br />[list]\r<br />[*]The Main Hall: the torch just inside the front gate activates most of the candles and braziers here.  Candles in the sleeping alcoves and the fire pits are activated seperately.\r<br />[*]Dovahkiin&#39;s quarters:  look to the two wall sconces with the silver plate backings - one located at the entrance controls the bedroom area - one at the top of the stairs controls the &#39;living room&#39; - with the fire pit again being seperately activated. \r<br />[*]Seer&#39;s hut:  candle sitting on the table in front of you as you enter controls it and the two small braziers. They will also be on when you arrive. \r<br />[*]Outdoor lights: most are on timers with just three exceptions:  the campfire, the lantern at the privy, and the torch at the back of the smithy (which will also light two lanterns on the path leading to the smelter area and one on the ground near the iron ore vein).\r<br />[/list]\r<br />-----------\r<br />Static Activators:\r<br />-----------\r<br />[list]\r<br />[*]As stated the wagon can be unloaded - most crates move to the side of the main entrance and the freshly killed elk (hunters helped load it up) gets butchered immediately. :)  \r<br />[*]The barricade at the main road entrance (the one with the notes affixed) can be removed entirely.  It&#39;s activator is located at the other barricade and shield left of the main entrance to the hall.\r<br />[*]In the food prep area of the main hall - to the left there&#39;s a stack of plates and goblets on a shelf.  The activator there will move those to the dining tables along with the cook pot and rack to the fire. Speaking of cook pot - the one in the &#39;kitchen&#39; is only a marker for stirring.  Once it&#39;s moved to the fire you can cook with it.\r<br />[*]Once the cook pot is set up by the fire - an activator will become available to the lower right on the low table nearby (the one with the bowl and ladle) to serve the food.  (Use this same activator to remove &#39;leftovers&#39; before you put the dishes back in storage or you&#39;ll have floating food.)\r<br />[*]Of course there are all the crafting activators as well.\r<br />[/list]\r<br />[center][img]http://static-6.nexusmods.com/15/mods/110/images/56700-5-1407193994.jpg[/img][/center]\r<br />\r<br />\r<br />-----------\r<br />Available Downloads and Requirements - Use only one.\r<br />-----------\r<br />[list]\r<br />[*]Providence - Vanilla Weather [VAN1a] - No requirements outside of the game and its update.\r<br />[*]Providence - CoT weather [CoT2a] - Requires &#34;Climates of Tamriel&#34; be installed and activated.\r<br />[/list]\r<br />\r<br />-----------\r<br />Installation:  **Important** - Get indoors&#33;  Your last save prior to installing and activating this mod needs to be in an interior cell.\r<br />-----------\r<br />[list]\r<br />[*]Simply install the mod using NMM.\r<br />[*]Manually installing?  I&#39;ll guess that you know what you&#39;re doing already.  And if not - the question begs to be asked ....\r<br />[*]Uninstalling - No worries. Everything installed with the NMM gets removed and the scripts I use will not linger or affect your saves in the least.\r<br />[/list]\r<br />\r<br />-----------\r<br />Issues or Possible Issues:\r<br />-----------\r<br />[list]\r<br />[*]Frame Rate:  This might not be suitable for some low-end computers.  The fall forest can be a beeotch on frame rates.  Add to that a fairly massive exterior construction.  Test it for suitability with your machine.  If your lag prohibits you from using this mod you have my humble apologies - it was not my intent to make this exclusive to the well-provided-for.  [I too have a low-ender, but it does have an upgraded video card and power supply thanks to my son, and it runs fairly smoothly.  My fps tests benchmarked in the four quadrants of the primary cell (looking in all directions) averaged 49, 50, 60, and 43.7 fps - not great, but good.]\r<br />[*]Companion adjustment time:  Well this really isn&#39;t an issue with just this mod because it&#39;s part and parcel of navmesh and the game.  Companions and other NPCs have to go through a period of adjustment with a cell&#39;s new navmesh (particularly one in an exterior cell).  So if they try to walk over or through something or do the disappearing/reappearing act - just be a little patient.  That kind of behavior should stop in a game day or, on the outside, two. If not then there&#39;s something else at work like with the next &#39;issue&#39;.  \r<br />[*]Mod Conflicts:  Any other mod you have that affects any part of this same cell will likely cause a navmesh conflict (or even a possible crash).  So make a choice and pick one mod or the other, &#39;cause this one can&#39;t be moved.\r<br />[*]The fx rain outside is still visible when you exit the main hall.  I had the same occasional problem with this weather script functioning 100% of the time because I&#39;ve got a machine that barely meets game requirements and scripts run slow.  I investigated and found this ini &#39;fix&#39; at [url=http://forums.nexusmods.com/index.php?/topic/894681-skyrim-script-lag/]The Nexus Forums - entry by steve40[/url].  (Save and safely stash your original ini text of course before making any changes to it.) and this [url=http://forums.bethsoft.com/topic/1321575-rel-tesv-acceleration-layer/]TES5 Acceleration Layer[/url] plugin for SKSE.  I&#39;ve had no problems at all since installing both, and that&#39;s the extent of my personal recommendation.  Use either at your own risk.\r<br />[/list]\r<br />A helpful hint:  Not using an ENB or using one that doesn&#39;t affect color?  Most exterior cell homes like this one will appear washed out in comparison to their colorful interior cell counterparts - it&#39;s the nature of the beast.  So may I recommend you download [url=http://www.nexusmods.com/skyrim/mods/32064/?]Immersive Saturation Boost[/url] by Aplestormy.  You&#39;ll be pleasantly surprised at the difference it makes in your enjoyment of this mod without affecting your fps.\r<br /> \r<br />-----------\r<br />Many Thanks and Credit go to:\r<br />-----------\r<br />[list]\r<br />[*]The researchers and designers of &#34;Vikings&#34; TV series for inspiration for the main hall of Providence - patterned after the Jarl&#39;s longhouse in Kattegat - and for the initial impetus for this mod. \r<br />[*][url=http://www.nexusmods.com/skyrim/mods/54421/?]Four new taller horses for different player types[/url] by LadyMassaca - for my first look at an unsaddled horse available for riding.\r<br />[*]Blary of course for the booksets and food containers.\r<br />[*]Again to Xilante and DarkFox127 for the weather script.\r<br />[*]The Nexus for its continued support and tireless efforts for modders and mod-users.\r<br />[*]And to Bethesda and Obsidian for starting it all.\r<br />[/list]\r<br />\r<br />Hope you enjoy it.\r<br />Take care.\r<br />gary\r<br />\r<br />\r<br />-----------------\r<br />Mods by gary62 for Bethesda/Obsidian games:\r<br />-----------------\r<br />On the Fallout4nexus -\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/fallout4/mods/7307/?]Legends _ Saves[/url]\r<br />[/list]\r<br />\r<br />On the skyrimnexus - \r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/57944/?]The Cabin[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/56700/?]Providence _ A Settlement Near Ivarstead[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/54738/?]Skyview[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/53988/?]The Snowline[/url]\r<br />[*][url=http://skyrim.nexusmods.com/mods/47152/?]Hindalok - Grandfather&#39;s Farm[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/49714/?]A Night On the Rift[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/59092/?]Legends Presets _ Famous Heroes and Heroines _ ECE CME saves[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/66989/?]Red Sonja _ Origins[/url]\r<br />[/list]\r<br />\r<br />On the newvegasnexus - \r<br />[list]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46004]Rancho Villa[/url] - (Mod of the Month for May 2012)\r<br />[*][url=http://newvegas.nexusmods.com/mods/49173/?]Phoenix Point[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46591]Ravens Nest[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/46862]Rathers Camp[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/50333/?]Legends Presets[/url]\r<br />[*][url=http://newvegas.nexusmods.com/mods/50710/?]gary62 version of Fees Realistic Portable Tent[/url]\r<br />[/list]\r<br />\r<br />On the tesnexus - \r<br />[list]\r<br />[*][url=http://oblivion.nexusmods.com/mods/43084]Silverfish River Cabin[/url]\r<br />[/list]\r<br />\r<br />On the fallout3nexus -\r<br />[list]\r<br />[*][url=http://fallout3.nexusmods.com/mods/18055]Megaton Return[/url] - (Mod of the Month for Aug 2012)\r<br />[*][url=http://fallout3.nexusmods.com/mods/17492]Camp Meridian[/url] \r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=17444]Hunters Ridge[/url]\r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=16922]The Dockside Inn_v1b_Redux[/url]\r<br />[*][url=http://fallout3.nexusmods.com/downloads/file.php?id=16201]The g62 Housing Compilation[/url]\r<br />[*][url=http://fallout3.nexusmods.com/mods/19137/?]Legends Presets[/url]\r<br />[/list]",
  "categoryId": "67",
  "version": "Van1a",
  "author": "gary62",
  "createdUnix": "1407196520",
  "updatedUnix": "1407195149",
  "containsAdultContent": false,
  "uploadedBy": "gary62",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120654",
      "name": "Providence - Vanilla Weather",
      "version": "Van1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2252",
      "fileName": "Providence - Vanilla Weather-56700-Van1a.7z",
      "uploadedUnix": "1407195000",
      "modVersion": "Van1a",
      "virusScanUrl": "https://www.virustotal.com/file/1dcd2c1b3b9a24a0ba4165e2a79f13f024fefef6ff8a5f37bd9bff7e7e010837/analysis/1407195031/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Providence%20-%20Vanilla%20Weather-56700-Van1a.7z?fid=1000120654&ttl=1535842210&ri=8192&rs=8192&setec=8eda6df33df15c1e543b66585d922224"
    },
    {
      "fileId": "1000120655",
      "name": "Providence - CoT Weather",
      "version": "Cot2a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2258",
      "fileName": "Providence - CoT Weather-56700-Cot2a.7z",
      "uploadedUnix": "1407195149",
      "modVersion": "Cot2a",
      "virusScanUrl": "https://www.virustotal.com/file/bd4ea284bf8f9138c270cf399987b79bf7ee45d389eba21e277db3bd47b7eed2/analysis/1407195210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Providence%20-%20CoT%20Weather-56700-Cot2a.7z?fid=1000120655&ttl=1535842211&ri=8192&rs=8192&setec=fb50c4ea179942a75d29f099779143ef"
    }
  ]
}