{
  "modId": 56763.0,
  "modName": "Truly Heavy Armor",
  "summary": "Armor both heavy and light now make their presence known.  Armor now slows down characters.",
  "descriptionHtml": "[size=5][size=5][color=#e69138][left]Update:  The current &#34;Truly Heavy Armor&#34; main file works as intended.  But I am still very unhappy with how it affects gameplay (Excessively punished for wearing heavy armor when traveling at early levels).  For example, if you try to travel when emcumbered, you will run out of stamina and become ridiculously slow (Ouch).  I will be working on making significant changes, but I will be away for 1 week and start school afterwards).  This mod will update, but not in the near future.  Check out my other mods btw (Bottom of description), I&#39;ve got some goods ones.[/left][/color]\r<br />[color=#ead1dc][center][size=5][color=#ead1dc]﻿Changes Made[/color][/size][color=#ead1dc]﻿[/color]﻿[/center][/color][/size][/size]The [b][u]player[/u][/b] and [u][b]NPCs[/b][/u] now move slower when wearing armor depending on the armor type, armor piece, and the character&#39;s skill in that armor type.\r<br />\r<br />[size=5][color=#76a5af][center]﻿Reasons for this change[/center][/color][/size]I wanted armor in Skyrim to feel PRESENT in the character&#39;s movement. if you are clad in steel, you will move like steel.  If you are naked, you best run away, because that&#39;s the one thing you&#39;re good at.  If you do not have much experience in the outdoors, don&#39;t expect to run very fast in light armor, light armor has its own hurdles to overcome.\r<br />\r<br />The aim of this mod is to make heavy armor feel heavy all game long (See your enemy cower in fear as you slowly tread towards their position, with a terribly smug look on your face), and to make light armor feel like ACTUAL ARMOR (Heavy when inexperienced, part of your body when you perfect your technique).\r<br />\r<br />Heavy armor will become less clumsy and more sturdy as you level, and light armor will become more maneuverable as you level.  In other words, the better you are at it, the faster you are, but light armor is the most quick.\r<br />[size=5][color=#6aa84f]\r<br />[center]Should I download this mod?﻿[/center][/color][/size]Download it if you want armor type to be a meaningful choice.  This mod aims to make heavy armor make players feel like lumbering titans and make light armor make players feel swift and vulnerable.  If you dislike how heavy armor and light armor don&#39;t feel different, try out my mod.\r<br />\r<br />This mod is functional.  Makes everyone of the ten races of Nirn move slower.\r<br />[size=5][color=#f1c232]\r<br />[center]How does this mod make the player slower exactly?﻿[/center][/color]\r<br />[/size]There are three factors that decide the player&#39;s movement.\r<br />\r<br />First, Heavy Armor always makes the player slower than its light armor counterpart.  Heavy Armor Cuirass is heavier than a Light Armor Cuirass for example.  Second, the Cuirass is the armor piece that slows the player the most, while the helmet, gauntlets, and boots do not slow the character as much.  In other words, the Cuirass is the main factor which decides which path you will take, you can mix and match armor from both types if you like (To optimize your movement), or specialize in one armor type and rely on your skill level and perks to optimize your movement.\r<br />\r<br />To give you an idea of how slow you will move, I&#39;ll give you the current max and min speed of a player that has a full set of a type of armor.\r<br />\r<br />A player with Lvl 15 Heavy Armor skill wearing full heavy armor will move at 60% movement speed.\r<br />A player with Lvl 85 Heavy Armor skill will full perks wearing full heavy armor will move at 95% movement speed.\r<br />A player with Lvl 15 Light Armor skill wearing full light armor will move at 80% movement speed.\r<br />A player with Lvl 85 Light Armor skill wearing full light armor will move at 100% movement speed.\r<br />\r<br />Is 40% too slow even for heavy armor?  Is 75% not enough for the supposedly fast light armor?  Although currently not available, I plan to add perks which offer the player more movement when wearing armor (Now you have a reason to spec in the armor perk trees), I will aim to add perks which add personality to each of the perk trees instead of forcing you wear matching sets (This is not a fashion show, we can mix and match socks however we like&#33;).\r<br />\r<br />I am currently aiming to raise armor speed another 15% or 20% (55% - 60% Heavy, 95% - 105% Light) to add more satisfaction to leveling the armor skills while making sure to not break the immersion I plan to add with REALLY HEAVY armor.\r<br />[color=#ffff00][size=5]\r<br />[center]Is that it?﻿[/center]\r<br />[/size][/color]I am currently adding a few more small features as well as changing the perk trees for Heavy and Light armors to complement this mod.  In the meanwhile I am releasing this version to get feedback on how significant / unnecessary these changes feel.  Am I making the player TOO slow at early levels?  Am I not giving the player enough movement at higher levels?  Drop a comment and let me know.  I want  to share a heavy Skyrim with as many people as possible.\r<br />\r<br />[youtube]Fl_dCuwGmaQ[/youtube]\r<br />\r<br />[size=5][b]Other mods made by me:[/b][/size]\r<br />\r<br />Are skeletons too easy for you?  [url=http://www.nexusmods.com/skyrim/mods/56690/?]Tenacious Skeletons[/url]﻿\r<br />\r<br />Are bandits too miserably weak? [url=http://www.nexusmods.com/skyrim/mods/56555/?]Tougher Bandits[/url]﻿\r<br />\r<br />Should Orc bandits not be as strong as Skeevers but rather Orc player characters?\r<br />[url=http://www.nexusmods.com/skyrim/mods/56660/?]Unique Race Stats[/url]",
  "categoryId": "24",
  "version": "1.2",
  "author": "sneaky_squirrel",
  "createdUnix": "1407372507",
  "updatedUnix": "1407532285",
  "containsAdultContent": false,
  "uploadedBy": "sneaky_squirrel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120926",
      "name": "Truly heavy Armor",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "121",
      "fileName": "Truly heavy Armor-56763-1.zip",
      "uploadedUnix": "1407371674",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9cc9fc38077074840108c97ec4f8813558a6311433164a3b6e4d0a72bfce8a9d/analysis/1407371709/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Truly%20heavy%20Armor-56763-1.zip?fid=1000120926&ttl=1535842331&ri=8192&rs=8192&setec=1312fc7aca4d5e61d92f764cae110137"
    },
    {
      "fileId": "1000121050",
      "name": "Truly heavy Armor",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "123",
      "fileName": "Truly heavy Armor-56763-1-1.zip",
      "uploadedUnix": "1407466857",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/06596eb7dd6ee2632a6f5a3c33d9302bc93c864689c100a107adf095dde3ef92/analysis/1407466872/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Truly%20heavy%20Armor-56763-1-1.zip?fid=1000121050&ttl=1535842331&ri=8192&rs=8192&setec=c5766cd7a352b5367ee476b83cb9beab"
    },
    {
      "fileId": "1000121147",
      "name": "Truly Heavy Armor",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "124",
      "fileName": "Truly Heavy Armor-56763-1-2.zip",
      "uploadedUnix": "1407532285",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d06baf7d0bec8645d8249ea046cb1a496b88f379d17a188dc20def2a279e0b35/analysis/1408176201/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Truly%20Heavy%20Armor-56763-1-2.zip?fid=1000121147&ttl=1535842331&ri=8192&rs=8192&setec=e0ae74add2249b243cc8c9f66952add3"
    }
  ]
}