{
  "modId": 56778.0,
  "modName": "Corvus Mill",
  "summary": "A player home on the coast of Solstheim, near Raven Rock but far enough for its secondary purpose as an observatory&#33;",
  "descriptionHtml": "I hate to only be contributing player homes to the Nexus, but hey, it&#39;s my passion. I do love making beautiful looking homes. This one is no different in the exotic lands of Solstheim&#33;\r<br />\r<br />Corvus Mill is not only a windmill, but an observatory with variable lighting (the telescope, unfortunately, purely for aesthetics and roleplay). It hosts a nice small living room for dining and audiences, one manikin, several display racks, two display cases, and your usual crafting stations. The windowed living room has its day/night cycle, and the whole house (though lower class) is made for comfort in the uncomfortable ash-fallen lands of Solstheim. On the exterior you&#39;ll find a small garden with grain for the mill, rare livestock, a patio with woodchopping block, an outhouse and small roofed dock for a rowboat.\r<br />\r<br />It may be small, but it&#39;s not bad for an alternative to Severin Manor, and should be fair competition to other Solstheim homes even if it relies only on vanilla resources. I&#39;ll hope you find it as interesting to live as I do&#33; \r<br />\r<br />It is located north of the Skaal stone in Raven Rock along the coast, right next to a treasure site for one of the sidequests. No conflicting navmeshes there, and everything else should flow just fine. \r<br />\r<br />Requirements: Dragonborn. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1407400942",
  "updatedUnix": "1407400936",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000120951",
      "name": "Corvus Mill",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4588",
      "fileName": "Corvus Mill-56778-1-0.zip",
      "uploadedUnix": "1407400936",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/327fc272e41037f485cbfcf9183150b2e410e6fea02466deecf9f4efa0054bdb/analysis/1407400990/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corvus%20Mill-56778-1-0.zip?fid=1000120951&ttl=1535842347&ri=8192&rs=8192&setec=2231cf3a2193e7abaf7d81f0798251d6"
    }
  ]
}