{
  "modId": 56803.0,
  "modName": "Realistic needs and diseases ADDON BREW DRINKS",
  "summary": "brew, make and craft your own nord mead, ale, honningbrew mead, black briar mead and reserve, dragonsbreath mead, firebrand wine, all 4 types of alto wine, skooma, double distiled skooma, balmora blue, and etc. REQUIRES ORIGINAL REALISTIC NEEDS MOD&#33; ALL CREDIT GOES TO PERSEID9 FOR HIS MOD&#33;",
  "descriptionHtml": "[i][u][b]REQUIRES THE ORIGINAL REALISTIC NEEDS AND DISEASES MOD[/b][/u][/i], at least version 1.9. all credit goes to its mod author perseid9. when downloading, replace his esp file with mine.\r<br />\r<br />what this mod does: you can now brew, at the cooking pot, most of the drinks you find in skyrim, like nord mead, honningbrew mead, blackbriar mead and reserve, firebrand (which you can&#39;t get in the game, but is there in the vanilla data), dragons breath mead, all alto wine, etc. \r<br />\r<br />BEFORE YOU GET ON MY CASE ON HOW THIS ISNT LORE FRIENDLY, HERE IS MY CASE:\r<br />i agree that mead and wine can only be brewed at the meaderies in skyrim, therefore:\r<br />[b][u]\r<br />THERE IS A PERK REQUIREMENT AND/OR QUEST FINISHED REQUIREMENT FOR ALL OF THE DRINKS[/u][/b]\r<br /> example: it will take the second alchemist perk, the one at level 20, to make normal nord mead\r<br />if you want the dragonsbreath mead, you have to finish the quest that introduces it in dragons bridge, freeformdragonbridge01, and also have the alchemist 2nd perk.\r<br />\r<br />(i did this to make it somewhat lore friendlier since normally alcohol must be brewed at meaderies, and takes a long time to prepare, not the 1 second click and make system from skyrim. but the same can be argued for weapon and armor crafting that it takes 1 second to make them, when in reality it doesn&#39;t). anyway i digress:\r<br />[u]\r<br />the recipes [/u]will involve a couple of wheat, flagon of water (From RND) and honey. thats for mead\r<br />ale requires the same, only instead of honey, it&#39;s gourd \r<br />wine requires the jazbay grapes, (since there is no normal grapes in skyrim, unlike oblivion) and some wheat, and the water flagon.\r<br />blackbriar mead requires you to have the alchemist perks, finished the quest for sibbi to find the girl he wants dead, and uses frost mirriam and elves ears in addition to normal mead recipe. (yea sorry idk why i chose this for the recipe, but deal with it)\r<br />honningbrew requires the perks, the thieves guild quest completed (dampening spirits, where you help maven take over the meadery), and lavender instead of mirriam and elves ears.\r<br />\r<br />also: [i][b]I CHANGED THE SKOOMA REQUIREMENTS[/b][/i]: it is now brewed only when you finish the skooma raid quest and help the jarl of riften clear out crags lane cavern and get rid of the skooma dealers. (not sure if there&#39;s the alchemist perk requirement for it, can&#39;t remember lol). \r<br />AND: I CHANGED THE RECIPE TO MATCH WHAT THE BANDITS WERE USING: skooma now reuires fly amanita, moon sugar, and nightshade (as well as a flagon of water from RND mod)\r<br />   ﻿   ﻿(why did i do this, you ask? because i dont want to start the game as a noob and    ﻿   ﻿instantly have knowledge on skooma making)\r<br />\r<br />finally: you can brew balmora blue and double distilled skooma, and yes there is perk requirements for both, not the second alchemist perk, but higher. and the balmora blue, you guessed it, requires you to have completed the quest for it from the thieves guild (when you talk to erikur in solitude to place the balmora blue on their ship).\r<br />\r<br />one last thing, i added a recipe for the milk bucket to use 2 firewood and 1 leather strip, since i can&#39;t find buckets to craft them with, so there ya go.\r<br />side note: I DID NOT ADD COLOVIAN BRANDY OR CYRODIILIC BRANDY, or HEARTHFIRE RECIPES, or DRAGONBORN/DAWNGUARD RECIPES (like red water skooma, argonian bloodwine, surlie brothers wine, etc) because then the file would require those dlc, AND because no one really knows how to make those in skyrim. argonian bloodwine is obviously made from blackmarsh, so only argonians know the recipe, and surlie brothers and cyrodiilic brandy are  made from cyrodiil. to add recipes to those would kinda be lore breaking.\r<br />\r<br />VERSION 2: added mead with juniper berries but everything is craftable with grass pods. yea, even i&#39;m not happy with this version.\r<br />\r<br />VERSION 3: wheat is required for mead and ale, not wine. tundra cotton required for all (for the cotton balls used to make yeast), removed recipes for spiced wine, blackbriar mead and reserve, honningbrew, firebrand, but still kept mead w/ juniper berries, and dragon&#39;s breath mead since they are never encountered again. no grass pods required unlike version 2. potato and wheat required for ale. added honey for alto wine. \r<br />   ﻿(also made craftable cheese wheels, renamed goat cheese to cheese since you can&#39;t milk goats for milk :(, used mold as requirement for eidar cheese, jazbay (since there were no lemons) for normal cheese. \r<br />\r<br />VERSION 4: added a new ingredient called brewing yeast, craftable at cooking pot, or found in honningbrew basement/ honningbrew mead brewery building /blackbriar meadery. this yeast is required by all alcoholic drinks.\r<br />\r<br />VERSION 5: same as 4, but made it easier to craft skooma + double distilled skooma: you need the 2nd alchemist perk OR clear out cragslane cavern OR do the thieves guild quest for tonilia where you trade a satchel of moon sugar to the khajiit caravan for their business. same for double distilled skooma but you need the 4th alchemist perk instead of the 2nd.       \r<br />\r<br />note: ALL CREDIT GOES TO THE ORIGINAL MOD AUTHOR WHO MADE RND. YOU STILL NEED HIS MOD TO USE MINE, but when you download, replace his .esp file with mine.",
  "categoryId": "100",
  "version": "6",
  "author": "perseid9 who is the original mod maker",
  "createdUnix": "1407459707",
  "updatedUnix": "1432671865",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121043",
      "name": "realistic needs and diseases with brewing drinks",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "realistic needs and diseases with brewing drinks-56803-.rar",
      "uploadedUnix": "1407459703",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2d875488e6428d2fb4184a3a90cf9132c8b6c856153190ff5a04322440119b97/analysis/1407459723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/realistic%20needs%20and%20diseases%20with%20brewing%20drinks-56803-.rar?fid=1000121043&ttl=1535842382&ri=8192&rs=8192&setec=e084a11e4ae94462de8d9d84775552ec"
    },
    {
      "fileId": "1000123804",
      "name": "alternate version",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "alternate version-56803-5.rar",
      "uploadedUnix": "1408941968",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/11922c729d55566c167b7306da22915b401c06b859ffc44bbc0f0597c685fc2b/analysis/1408942081/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alternate%20version-56803-5.rar?fid=1000123804&ttl=1535842383&ri=8192&rs=8192&setec=04db358e23a7c2d1702bccacadb3850d"
    },
    {
      "fileId": "1000124024",
      "name": "alternate version 2 with yeast ingredient",
      "version": "4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "39",
      "fileName": "alternate version 2 with yeast ingredient-56803-4.rar",
      "uploadedUnix": "1409072416",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/b4c4c4ed53c4e291d1b8ef9c4a1fc30ab91e80a30b295c368e8f46d30541c392/analysis/1409072522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alternate%20version%202%20with%20yeast%20ingredient-56803-4.rar?fid=1000124024&ttl=1535842383&ri=8192&rs=8192&setec=7c406fa5241dc32120878e2dc1542de8"
    },
    {
      "fileId": "1000124514",
      "name": "version 5 with easier crafting skooma",
      "version": "5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "39",
      "fileName": "version 5 with easier crafting skooma-56803-5.rar",
      "uploadedUnix": "1409368397",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/10ed3713464513d0b33d47d6394d69ddb225ca3882342cbd41481b338cae49ad/analysis/1409368527/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/version%205%20with%20easier%20crafting%20skooma-56803-5.rar?fid=1000124514&ttl=1535842383&ri=8192&rs=8192&setec=8756391ec840a394fa54a70df9d6da06"
    },
    {
      "fileId": "1000161741",
      "name": "final version max compatibility",
      "version": "6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4891",
      "fileName": "final version max compatibility-56803-6.rar",
      "uploadedUnix": "1432671865",
      "modVersion": "6",
      "virusScanUrl": "https://www.virustotal.com/file/f67d41f359d0eac56cfef38fad9a111ee4045ccbc43aed2b6ea329a1b337b9f6/analysis/1432671906/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/final%20version%20max%20compatibility-56803-6.rar?fid=1000161741&ttl=1535842384&ri=8192&rs=8192&setec=b189509a1845ea76973dc205545ecd43"
    }
  ]
}