{
  "modId": 56834.0,
  "modName": "Expanded Towns and Cities - Better Winterhold Ruins",
  "summary": "Makes some subtle improvements to the Expanded Towns and Cities (ETaC)&#39;s city of Winterhold, that bring more immersion to the devastating aftermath of the Great Collapse. Although ETaC features a visual presentation of the Great Collapse, the ruins were not very realistically presented in-game.",
  "descriptionHtml": "[center][img]http://static-2.nexusmods.com/15/mods/110/images/31450-1-1397968738.jpg[/img]\r<br />\r<br />\r<br />[b][u]A lore-friendly decorative mod which improves the:[/u][/b]\r<br />[url=http://www.nexusmods.com/skyrim/users/3123219]missjennabee[/url]&#39;s [b] [color=#00FF00][url=http://www.nexusmods.com/skyrim/mods/13608/?]Expanded Towns and Cities[/url][/color] city of Winterhold[/b]&#33;[/center]\r<br />\r<br />\r<br />[center]This mod is, lets say, a small tribute to [url=http://www.nexusmods.com/skyrim/users/3123219]missjennabee[/url] for her hard efforts to \r<br />provide us with some of the greatest mods for TES V Skyrim&#33;\r<br />Don&#39;t forget to [color=#e2a753]endorse[/color] it, if you liked it&#33; Help the others gamers be aware of this little mod&#33; :)[/center]\r<br />\r<br />\r<br />\r<br />[u][heading]MOD INFO[/heading][/u]\r<br />The lore claims that the city of Winterhold, prior to its devastating Great Collapse, was once a major city in Skyrim that attracted lots of travelers and merchants from all across Tamriel, but in the game, as well as in ETaC, the ruins of the Great Collapse aren&#39;t very realistically represented. My mod comes to correct this.\r<br />\r<br />\r<br />\r<br />[u][heading]MOD DETAILS[/heading][/u]\r<br />The mod does nothing more than just some subtle additions of hand-placed \r<br />wall bricks to the city of Winterhold&#39;s collapsed portions, which greatly improves the city&#39;s \r<br />immersion, without any noticeable hits to the performance (FPS). The mod\r<br /> is 100% compatibility with all the ETaC-compatible mods out there&#33;\r<br />\r<br />[u]What my mod does:[/u][list][*] Makes the ETaC city of Winterhold have some more wall pieces and wall bricks scattered on the edge, that reflects the devastating blow the great city walls suffered during the collapse. A lore-friendly mod that does not alter the natural look of the city.[*] The Winterhold&#39;s collapsed cliffs are now more dotted with wall bricks.[*] The wall bricks are placed very carefully, to represent the physics behind the destruction of the city&#39;s walls during the Great Collapse, without breaking any immersion.[*] Is a clean mod. Always scanned with TES5Edit and checked for errors.[*] Is a friendly mod. Fully compatible with all other mods in your game&#33;[*] Is Loading Order-neutral mod. Doesn&#39;t matter where in the Loading Order you place it&#33; Just make sure the Expanded Towns and Cities&#39;s Winterhold, by missjennabee, is installed too&#33;[/list]\r<br />[u]What my mod does NOT: [/u][list][*] No edits to Navmesh.[*] No edits to textures, meshes or lights.[*] No edits to any NPCs, Dragons, etc.[*] No edits to existing Buildings, Decor, Objects, Items, or Walls.[*] No edits to Landscape, Trees, Rocks, and Flora.[*] No edits to the vanilla game, at all. Absolutely no edits&#33;[*] No disabled nor deleted stuff&#33; (my mod does not touch the game at all)[*] No dirty edits, ITM, and such trash&#33;  The mod is absolutely clean&#33; (verified by TES5Edit)[*] No edits to scripts, events and quests, or whatever you may think. and... [*]...contains no errors&#33;[/list]\r<br />\r<br />[u][u]\r<br />\r<br />[heading]MOD REQUIREMENTS[/heading][/u][/u]\r<br />This mod requires the [b] [color=#00FF00][url=http://www.nexusmods.com/skyrim/mods/13608/?]Expanded Towns and Cities[/url][/color][/b] by  [url=http://www.nexusmods.com/skyrim/users/3123219]missjennabee[/url] to be installed. Although it can be used without the ETaC installed, you won&#39;t see the desired improvements in the vanilla game&#39;s Winterhold.\r<br />\r<br />\r<br />\r<br />[u][u][heading]INSTALL[/heading][/u][/u]\r<br />Just place the .esp to the Skyrim/Data Folder and activate it.\r<br />\r<br />\r<br />\r<br />\r<br />[u][u][heading]UNINSTALL[/heading][/u][/u]\r<br />Just deactivate/remove the .esp from the Skyrim/Data Folder.\r<br />\r<br />\r<br />\r<br />\r<br />[u][heading]LOAD ORDER[/heading][/u]\r<br />This is a Load Order Neutral Mod. With simple words, really it doesn&#39;t matter where you place it. This mod is safe to be placed anywhere in your game&#39;s mod loading order. Even loading it before the Expanded Towns and Cities is absolutely safe, as it is the case of LOOT. Feel free to group it in the same load order with all other decoration mods for your game.\r<br />\r<br />\r<br />\r<br />[u][heading]COMPATIBILITY[/heading][/u]\r<br />My mod is designed with the goal of full compatibility with anything else that decorates the same cells in ETaC Whinterhold, and therefore it decorates the city carefully, without touching any pre-existed objects&#33;\r<br />[u]The Expanded Towns and Cities - Better Winterhold Ruins is:[/u]\r<br />[color=#00cc00]100%[/color] compatible with any game versions\r<br />[color=#00cc00]100%[/color] compatible with all Official Patches\r<br />[color=#00cc00]100%[/color] compatible with all Unofficial Patches\r<br />[color=#00cc00]100%[/color] compatible with all the Official DLCs (Dawnguard, etc)\r<br />[color=#00cc00]100%[/color] compatible with any mods that may do changes to Expanded Towns and Cities\r<br />[color=#00cc00]100%[/color] compatible with any mods that add stuff to Expanded Towns and Cities\r<br />[color=#00cc00]100%[/color] compatible with any overhaul mods\r<br />[color=#00cc00]100%[/color] compatible with any texture mods\r<br />[color=#00cc00]100%[/color] compatible with any NPC mods\r<br />With simple words, my mod is [color=#00cc00]100%[/color] compatible with anything in TES V Skyrim&#33; Need to say more?\r<br />\r<br />\r<br />[u][heading]HISTORY/CHANGELOG[/heading][/u]\r<br />[b]Version 1.0 - Date: 09/08/2014[/b][list][*]Added.[/list]\r<br />\r<br />\r<br />\r<br />[u][heading]TROUBLESHOOTING[/heading][/u]\r<br />Please do not post here any problems you may have in your game&#33; My mod DOES NOT TOUCH ANYTHING in your game&#33; Absolutely nothing&#33; :) \r<br />So if your game crashes to desktop, your savefiles are bloated or corrupted, or if you have any missing items/objects in the towns, floating torches, or invisible walls, or whatever, it is very likely that you messed it up. \r<br />That&#39;s why the community always warns: be careful when installing mods&#33; Always read their readmes for proper installation/uninstall&#33; Please do not ask for my help, unless you got a proof that a problem in your game is caused by the Expanded Towns and Cities - Better Winterhold Ruins mod. To ensure this, first test carefully all the installed mods in your game, one by one, Disable all mods that may do changes to outdoors/landscape/cities, before you accuse my mod for any troubles you may be having with other mods&#33; :)\r<br />\r<br />\r<br />\r<br />\r<br />Have a nice day and [color=#e2a753]remember to [b]endorse[/b] the mod[/color]&#33;",
  "categoryId": "53",
  "version": "1.0",
  "author": "SilentResident",
  "createdUnix": "1407536339",
  "updatedUnix": "1407536254",
  "containsAdultContent": false,
  "uploadedBy": "SilentResident",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121160",
      "name": "Expanded Towns and Cities - Better Winterhold Ruins",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Expanded Towns and Cities - Better Winterhold Ruins-56834-1-0.rar",
      "uploadedUnix": "1407536254",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/579d6e1bd338bd3af2238ba7a6ca32d2605826b8247c3187bbba78ee24d4de48/analysis/1407536310/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Expanded%20Towns%20and%20Cities%20-%20Better%20Winterhold%20Ruins-56834-1-0.rar?fid=1000121160&ttl=1535842430&ri=8192&rs=8192&setec=bce6288d177a68bf44b30c0edccfb8e3"
    }
  ]
}