{
  "modId": 56837.0,
  "modName": "The Warded Man - RaceMenu Tattoo Plugin",
  "summary": "This is a RaceMenu tattoo plugin which will give your character the all over tattoos of Arlen Bales; The Warded Man.",
  "descriptionHtml": "This is a small homage to Peter V Brett&#39;s excellent stories of the Warded Man (or the Painted Man, depending on where you are from). If you are here then you are almost certainly a fan of Skyrim, which means you are almost bound to love these books. My praise doesn&#39;t do them justice, just read them.\r<br />\r<br />[b]Description\r<br />[/b]==========\r<br />\r<br />This is a RaceMenu tattoo plugin which will give your character the all over tattoos of Arlen Bales; The Warded Man.\r<br />\r<br />Using RaceMenu will of course enable you to select whatever colour you like for the tattoos, but I would recommend black with a slight blue glow if you want to keep to Peter V Brett&#39;s lore.\r<br />\r<br />In order to give your character the powers that Arlen has due to his warding (or approximations within Skyrim&#39;s options) I have also included an ability (Which is entirely optional, if you don&#39;t want the ability, just don&#39;t use it) which boosts Magicka 100, Carry Weight 100, Unarmed Damage 50, Damage Resistance 50, Fortify Armour 50 and Health Regeneration 20.This ability is available via a spell tome which can be found in the ruins of Anoch Sun which I have placed North East of Windhelm (See the picture), or more precisely: East of Yngol Barrow, or North East of Traitors Post. Inside Anoch Sun you will find the corpse of Kaji, he has the spell tome. No battles or anything, just grab the tome and read it.\r<br />\r<br />I am currently working on making Anoch Sun into a useful little player home for sleeping, crafting etc but mainly concentrating on display for your character&#39;s items.\r<br />\r<br />[b]Use\r<br />[/b]===\r<br />\r<br />While in character creation (or using the console command showracemenu) click on the overlays tab, the tattoo wards can be found in Body Paint, Hands, Feet and Face Paint. In each of these menus select an unused slot and press T. The tattoos are called Warded Body, Warded Hands, Warded Feet and Warded Face. The RaceMenu lists tattoos alphabetically so all of the warded tattoos will be close to the bottom of the list.\r<br />\r<br />The available ability is explained in the description above.\r<br />\r<br />[b]Requirements\r<br />[/b]============\r<br />\r<br />The latest version of Skyrim\r<br />\r<br />RaceMenu http://www.nexusmods.com/skyrim/mods/29624/?\r<br />SKSE http://skse.silverlock.org/\r<br />\r<br />[b]Installation\r<br />[/b]==========\r<br />\r<br />I would recommend installing this with NMM, just be sure that this mod is positioned below RaceMenu and any other RaceMenu optional esp&#39;s.\r<br />\r<br />For manual installation just unzip the folder and place it&#39;s contents inside your Data folder. Be sure that this mod is positioned below RaceMenu and any other RaceMenu optional esp&#39;s.\r<br />\r<br />[b]Un-installing[/b]\r<br />==========\r<br />\r<br />Use NMM to remove the files.\r<br />\r<br />For manual install just remove the files that you moved to the Data folder.\r<br />\r<br />[b]Credits[/b]\r<br />======\r<br />\r<br />Peter V Brett for his amazing books and his permission to post this mod.\r<br />\r<br />Lauren K. Cannon for her beautiful wards.\r<br />\r<br />Expired6978 for RaceMenu.\r<br />\r<br />Vinniewryan for RaceMenu mod maker which was the foundation for and the learning tool used to make this mod.\r<br />\r<br />Bethesda for Skyrim",
  "categoryId": "29",
  "version": "0.1",
  "author": "Jedininjafuq",
  "createdUnix": "1407545418",
  "updatedUnix": "1414684980",
  "containsAdultContent": false,
  "uploadedBy": "Jedininjafuq",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121169",
      "name": "Warded Man",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1231",
      "fileName": "Warded Man-56837-0-1.rar",
      "uploadedUnix": "1407545177",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f7497aebc6b5b78dc0f1a6fe776e59eb4351e37de97d38936a010830dde014a5/analysis/1407545239/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Warded%20Man-56837-0-1.rar?fid=1000121169&ttl=1535842435&ri=8192&rs=8192&setec=76ba38bc3913f8296ff7daf3747ae6cc"
    },
    {
      "fileId": "1000133219",
      "name": "Rebel Alliance Tattoo",
      "version": "0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Rebel Alliance Tattoo-56837-0-1.rar",
      "uploadedUnix": "1414684980",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/546e83ba31b1b9b9abe2a3710c5ecc4d7a219b7fa73710bf2021367052be8ba1/analysis/1414685042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rebel%20Alliance%20Tattoo-56837-0-1.rar?fid=1000133219&ttl=1535842436&ri=8192&rs=8192&setec=b4871495c146034dc6e9e769ed3ab117"
    }
  ]
}