{
  "modId": 56869.0,
  "modName": "Dragonheart Haven v0.4",
  "summary": "A player living space set in Sovngarde.",
  "descriptionHtml": "[center]*Please leave a short comment if you come back to let others know how you felt about the mod&#33; Thanks&#33;\r<br />*\r<br />*[/center][center]DRAGONHEART HAVEN[/center]\r<br />I offer for your consideration and living enjoyment, Dragonheart Haven. A world away from Skyrim, where family can be safe, from the turmoils of a violent world.  \r<br />\r<br />Spend time in the  Garden Court, &#34;tending&#34; to almost every growing thing you can hope for. And don&#39;t forget to have a look under the waves.\r<br />\r<br />Mine Soul Gems and Stalhrim in your Underground retreat.Enjoy the ability to craft at your very own Skyforge.\r<br />\r<br />Store and collect every book you could hope for in your own personal Library Archive, alphabetized for your convenience. \r<br />\r<br />Your Athenaeum (soon to be changed to a more Lore-friendly name), is also your transportation hub for the locations you frequent most. \r<br />\r<br />A collector&#39;s haven awaits in your Armoury. Three square floors of angular Dwemer precision.\r<br />\r<br />You can enter the Library immediately upon reaching Riverwood, or you can wait for access to the main entrance, via the peak of the Throat of the World once you make your way up to the Greybeards. \r<br />\r<br />And be sure to give every nook and cranny a peak. Hidden treasure, A LOT of it, awaits.\r<br />\r<br />Installation Requirements:\r<br />\r<br />-Dawnguard\r<br />-Hearthfires\r<br />-Dragonborn\r<br />\r<br />Recommended Mods:\r<br />\r<br />Hellion Arrows.  Have a look at the few ceilings I do provide and be prepared to die if you miss.\r<br />\r<br />Also on Steam: http://steamcommunity.com/sharedfiles/filedetails/?id=298181057\r<br />\r<br />NOTE: WIP\r<br />\r<br />Navmesh Coverage:\r<br />- Dragonheart Haven\r<br />- Dragonheart Hearth partial\r<br />- Throat of the World, path & floating island\r<br />- Dragonheart Library, interior & exterior\r<br />- Where the lIbrary Tomes meet up with the world, your follower should be able to get to them with you if you naturally can\r<br />\r<br />*FOREMOST I have spent quite a bit of time putting this together. I DO NOT currently remember where Navmeshes that are okay for followers exist and don&#39;t exist. Please give me a few weeks to get a list together and to work on a much better level of Navmesh completion. For the time being, I believe the entrance at Riverwood is good to go, and so is the Main Island, the Library, and the Library &#39;foyer&#39;. I haven&#39;t had a machine that could handle a follower until now, I&#39;ll get on this again ASAP.\r<br />\r<br />*It is not recommended that you install this alongside Dragonheart Sanctuary. The entrances at the Throat of the World will conflict with each other or at least look awful side by side.\r<br />\r<br />*If you wish to have a popular location added to the Apocrypha books in the Library, please message me and if there are no better candidates suggested by the community, I will make a point of giving the community access to that location. \r<br />\r<br />*If you have an older machine (circa 4 years), loading will be longer in places like the Armoury. I have just upgraded to a new system and it still had difficulty rending the Armoury all at once for that screen shot on Ultra settings. If you can muster the patience, take a couple minutes to let it load and you should be all right.\r<br />\r<br />*Please note that this is a work in progress. There is one area blocked off pending an acceptable level of completion (Dragonmyst Island). Fans of the Myst games will like this one. ",
  "categoryId": "67",
  "version": "v0.4",
  "author": "Shorya Dragonheart",
  "createdUnix": "1407633058",
  "updatedUnix": "1446418209",
  "containsAdultContent": false,
  "uploadedBy": "Shorya",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121410",
      "name": "Dragonheart Haven v0.1",
      "version": "v0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2561",
      "fileName": "Dragonheart Haven v0.1-56869-v0-1.rar",
      "uploadedUnix": "1407723292",
      "modVersion": "v0.1",
      "virusScanUrl": "https://www.virustotal.com/file/dbba5d8b2724b1cf5c46e83bbd8965528da164e8cd3c82555a7e0ae06b076fbc/analysis/1407723304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonheart%20Haven%20v0.1-56869-v0-1.rar?fid=1000121410&ttl=1535842472&ri=8192&rs=8192&setec=8dfc25a683fbca7e1d163069c634c4d0"
    },
    {
      "fileId": "1000183419",
      "name": "Dragonheart Haven v0.4",
      "version": "v0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2807",
      "fileName": "Dragonheart Haven v0.4-56869-v0-4.rar",
      "uploadedUnix": "1446418209",
      "modVersion": "v0.4",
      "virusScanUrl": "https://www.virustotal.com/file/d9ce4ebf7aca9ca4a99310e73ca7a856012920eeb4a0cea946e432fe84fb1c56/analysis/1446418264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonheart%20Haven%20v0.4-56869-v0-4.rar?fid=1000183419&ttl=1535842473&ri=8192&rs=8192&setec=04fc7a93a75b0bac7c46c070b460df9b"
    }
  ]
}