{
  "modId": 56915.0,
  "modName": "Craftable Gambesons",
  "summary": "Adds craftable, upgradable Gambesons to the game. ",
  "descriptionHtml": "First mod ever&#33; \r<br />\r<br />This is a simple mod I made to address the lack of realistic medieval-style padded cloth armour in Skyrim, and as an alternative to the more shiny fantasy style light armours available in the later game. The vanilla &#39;Fine Clothes&#39; was the closest item in the game to what I envisioned (I&#39;m no 3d modeller or texture artist), so the armour uses that as the model. Apart from the odd clipping issue (which isn&#39;t my fault so don&#39;t bother asking), it works perfectly well. \r<br />The Gambesons in this mod are all fully craftable and upgradeable, and are available in variants from Novice to Master level for both genders and all races. I have tried to make this mod as balanced as possible, so if you&#39;re looking for God-items you are very much in the wrong place. \r<br />I have no idea how to intergrate items into the loot and NPC level lists, as awesome as that would be. My bad. \r<br />\r<br />Other mods in the screenshots are: \r<br />Craftable Aketons (Also by me, available on the Workshop and Nexus) \r<br />Improved NPC Clothing - High Res (available on the Nexus) \r<br />aMidianBorn Book of Silence (available on the Nexus) \r<br />\r<br />Please do not upload this file elsewhere without my permission. Hell, why would you bother? This mod took about ten minutes to make with the creation kit (not including playtesting). \r<br />\r<br />Credits:\r<br />BorderWise (myself, last time I looked)\r<br />Bethesda, for making the game that caused 800 hours of my life to mysteriously disappear...\r<br />\r<br />Version 1.0: Craftable and upgradeable Gambesons added to the game. ",
  "categoryId": "54",
  "version": "1.0",
  "author": "BorderWise",
  "createdUnix": "1407724905",
  "updatedUnix": "1407724729",
  "containsAdultContent": false,
  "uploadedBy": "BorderWise",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121412",
      "name": "GambesonsMod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "GambesonsMod-56915-1-0.zip",
      "uploadedUnix": "1407724729",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a294ddefefe4c7290a6aa2b2911e89fbfa3a5104ff6bc86dffd79ea0fbd67b06/analysis/1408177032/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GambesonsMod-56915-1-0.zip?fid=1000121412&ttl=1535842568&ri=8192&rs=8192&setec=90b24668b5c5ab511f47edbb9f7a99f6"
    }
  ]
}