{
  "modId": 56937.0,
  "modName": "Populated Lands - Roads - Paths",
  "summary": "This mod adds NPCs to the world of Skyrim. ",
  "descriptionHtml": "[size=5]***I DO NOT OWN THIS MOD&#33;&#33;*** This mod was originally uploaded by a guy named &#34;RS&#34;, but was taken down a few months ago. I have tried to contact him but was unable to. So I decide, since I still have this mod, I thought I would re-upload it for everyone to have again. FULL CREDIT GO TO THE ORIGINAL AUTHOR.\r<br />\r<br />\r<br />[/size]I am not sure why this mod was removed in the first place, and I personally have no had any problems with it whatsoever... and I have 50+ active mods. So I am GUESSING that this mod will be perfectly fine for you. I remember in the original description of this mod, that there are NO SCRIPTS. The NPCs just wander across roads, lands and paths to different locations. \r<br />\r<br />\r<br />[size=4][i][b]What this mod is (FROM MEMORY):[/b][/i][/size]\r<br />\r<br />Since I am NOT the original owner of this mod, I do not know the exact specifics. But from memory, I believe some of the NPCs that roam around are Merchants, Wandering Knights, wandering Guards (Imperial and Stormcloak), and some wandering NPCs ride horses [size=4]I THINK.[/size][size=2] The horses may be part of a different NPC mod that I have.\r<br />\r<br />\r<br />KEEP IN MIND: I am not an official mod maker. I do not know how to get rid of bugs or glitches IF you find any. I do not know how to make patches for this mod. This mod, and ONLY THIS MOD, are available. No patches, no bug fixes (if you find any), nothing else. Unless someone else wishes to make patches for their mod(s) you probably wont find any patches. \r<br />\r<br />\r<br />\r<br />\r<br />[/size]",
  "categoryId": "33",
  "version": "1.0",
  "author": "RS",
  "createdUnix": "1407789317",
  "updatedUnix": "1407789965",
  "containsAdultContent": false,
  "uploadedBy": "bloodshed714",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121518",
      "name": "Populated Lands - Roads - Paths",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26230",
      "fileName": "Populated Lands - Roads - Paths-56937-1-0.7z",
      "uploadedUnix": "1407789965",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f56c349b2396f17cfb5d4294c23dd49b89006f8ee3d0be3c8257bdfcc397011/analysis/1407790078/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Populated%20Lands%20-%20Roads%20-%20Paths-56937-1-0.7z?fid=1000121518&ttl=1535842602&ri=8192&rs=8192&setec=1a0d8b915b74f77dba98999b0f15fbe0"
    }
  ]
}