{
  "modId": 56946.0,
  "modName": "Proper Predators And Pelts",
  "summary": "Realistic predator textures and matching pelts.\r<br />",
  "descriptionHtml": "[size=6]Proper Predators & Pelts\r<br />\r<br />[/size][color=#ff0000]***Notice: I am two days away from finishing college. I&#39;m going to be very busy wrapping that up, and then will probably spend some time celebrating and vacationing. Although I DO plan on finishing the bear pelts for this mod, It won&#39;t be for a few weeks at least. Just track my file and you&#39;ll be notified when new things are here.***[/color]\r<br />\r<br />[color=#ff0000][size=4]***Update&#33; Improved snow bear is now released featuring new foot pads, retouched teeth and mouth textures, and a better nose. Picture below.***\r<br />\r<br /> [img]http://s14.postimg.org/ww9q49njl/New_Snow_Bear.jpg[/img]\r<br />\r<br />[/size][/color]\r<br />\r<br />[size=3]If you have ever seen real pictures of polar bears, white wolves, arctic foxes, or snow leopards, you know that a healthy individual of those species is VERY white, nearly matching the snow. Skyrim&#39;s snow/ice predators, well...arent. On top of that, most of the other predators had problems too: pelts that didn&#39;t match or textures that don&#39;t look anything like the living animal they are supposed to resemble.\r<br />[/size]\r<br />[size=3]Frustrated by this and unable to find a mod that addressed it all, I made these texture tweaks myself. I was so pleased with the result that I decided to share them. A full list of changes can be found below. Some textures were extracted right out of my game folder and modified by me. 4 came from Bellyaches excellent &#34;Bellyaches Animal and Creature Pack&#34;, which he gives permission on his page to use. Of those, 1 I personally tweaked, and 3 were left as is. \r<br />\r<br />[/size][size=4]Bears[/size] - The snow bear has had it&#39;s coat whitened, and now has brown eyes like a real polar bear. The devs seem to have just run the normal bear texture through some kind of filter and screwed up the mouth/teeth, nose, and foot pads. This has been carefully fixed. The teeth and mouth textures from the normal brown bear were swapped for the old ones, the feet have been re-touched to show proper foot pads, and the nose has been darkened and cleaned up. ***Coming soon: Bear and cave bear tweaks&#33;***\r<br />\r<br />[size=4]Foxes [/size]- The snow fox is now a proper white, with a matching whitened pelt. The normal fox now uses Bellyaches great fox texture. I also added and fixed Bellyaches fox pelt, which was missing white on the underside tip of the tail and slightly too orange to match the in-game fox. This has been corrected.\r<br />\r<br />[size=4]Sabre Cats[/size] - The snowy sabre cat and it&#39;s pelt are whitened. The normal sabre cat matches it&#39;s pelt, and since sabre toothed tigers no longer exist and we have no idea what actual color their fur was, I left them alone.\r<br />\r<br />[size=4]Wolves[/size] - Ice wolves are now actually white instead of that weird gray they are by default, and have brown eyes like a real-life white wolf. They now also have matching pelts. Normal wolves and their pelts now resemble gray or timber wolves, and use Bellyaches great wolf and pelt textures. They were too good to improve. ***Red wolf fix is in the works***\r<br />\r<br />\r<br />A few choice textures I used came from:\r<br />\r<br />&#34;Bellyaches Animal and Creature pack&#34;:\r<br />http://www.nexusmods.com/skyrim/mods/3621/?\r<br />\r<br />^^^There&#39;s some great stuff in there, and I recommend you give it a browse. ",
  "categoryId": "29",
  "version": "",
  "author": "Mcchuggernaut",
  "createdUnix": "1407819410",
  "updatedUnix": "1408021905",
  "containsAdultContent": false,
  "uploadedBy": "mcchuggernaut",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121592",
      "name": "Proper Predators and Pelts",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10823",
      "fileName": "Proper Predators and Pelts-56946-.rar",
      "uploadedUnix": "1407819116",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fbf2a94bed7aafa8c8156f84efbc9202458329c47effd4ab7f36f5b137a69f68/analysis/1407819132/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Predators%20and%20Pelts-56946-.rar?fid=1000121592&ttl=1535842613&ri=8192&rs=8192&setec=cfce884c5a666b999d573cb4a963a28f"
    },
    {
      "fileId": "1000122007",
      "name": "Proper Predators and Pelts Update 1",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10827",
      "fileName": "Proper Predators and Pelts Update 1-56946-.rar",
      "uploadedUnix": "1408021905",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/398cdf586f4f2e851a66b054750667b676c8ec737fa108718398a84f587f6e5c/analysis/1408178134/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Proper%20Predators%20and%20Pelts%20Update%201-56946-.rar?fid=1000122007&ttl=1535842614&ri=8192&rs=8192&setec=4a5f3c197e69ff2b17c466bcc623f996"
    }
  ]
}