{
  "modId": 56942.0,
  "modName": "Open Cities Teleport Spells",
  "summary": "This is a modification which adds spells that allow you to teleport to all of the major hold cities in Skyrim.",
  "descriptionHtml": "I made a version of [url=http://www.nexusmods.com/skyrim/users/3174434]chairmanxyz[/url]&#39;s mod (http://www.nexusmods.com/skyrim/mods/29144/?) compatible with Open Cities and included some of my own tweaks. I removed the spell tomes from the barrels and put them in the merchant chests of the court wizards. I also relocated the teleports to the vanilla fast travel points for vanilla cities and outside the gates for the Open Cities.\r<br />\r<br />Otherwise this mod is basically the same. [url=http://www.nexusmods.com/skyrim/users/3174434]chairmanxyz[/url] did all of the heavy lifting with the script and the spells. I just renamed some stuff and moved some things to make it work with Open Cities. I would like to thank him for being so kind as to allow me to post this mod for other immersion junkies to enjoy.\r<br />\r<br />Location: \r<br />\r<br />All spells are sold by the court wizard of the desired city. In Winterhold it is sold by Nelacar, in Morthal by Falion, and in Falkreath (which lacks any spell vendor) by  Gray Pine Goods.\r<br />\r<br />The teleport destinations are located at the vanilla fast travel points for vanilla cities and outside the gates for the Open Cities.\r<br />\r<br />There are no restrictions on the spell use, so you can teleport whenever you wish, however I&#39;d recommend avoiding doing so during combat or important scripted events just to be safe. \r<br />\r<br />Please leave information about bugs and such else on the main mod page.\r<br />\r<br />***\r<br />Please Note:\r<br />1. This mod was designed around a mage which doesn&#39;t use fast travel and prefers to stay more lore friendly. Therefore this mod will only be useful to someone who doesn&#39;t use fast travel.\r<br />2. The only plugins ticked while making this mod were Skyrim.esm, Update.esm, and Open Cities Skyrim.esp, so it requires no DLC. And since I placed the teleports at vanilla markers, it should also work without Open Cities, though you&#39;ll have to enter the city gate and watch a second load screen.\r<br />***\r<br />",
  "categoryId": "75",
  "version": "1.0",
  "author": "Golmore",
  "createdUnix": "1407803242",
  "updatedUnix": "1407803238",
  "containsAdultContent": false,
  "uploadedBy": "quaidbass",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000121558",
      "name": "Open Cities Teleport Spells",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Open Cities Teleport Spells-56942-1-0.zip",
      "uploadedUnix": "1407803238",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7b5b0e7e5c0e061d05df9cac2480ffc26e694f24a05eec737179f4f7ea4089b5/analysis/1407803285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Open%20Cities%20Teleport%20Spells-56942-1-0.zip?fid=1000121558&ttl=1535842609&ri=8192&rs=8192&setec=9dd123bb43e89e2c0e6ce5884810074e"
    }
  ]
}