{
  "modId": 57022.0,
  "modName": "Daedric Enchanter Craftable Daedric Spells",
  "summary": "craft new spell tomes based on each of the daedric princes. after you have become their champion, and have the 5th enchanter perk, you can craft the spell at the daedric enchanter at the midden dark.",
  "descriptionHtml": "[size=5]mod is complete&#33; :D enjoy [/size]\r<br />REUPLOADED HERE: http://www.nexusmods.com/skyrim/mods/57146/?   but this is basically the same \r<br />WARNING THESE SPELLS ARE OVERPOWERED BUT REQUIRE A LOT OF MAGICKA TO CAST (especially the concentration ones) OBVIOUSLY YOU WILL ACTUALLY NEED THE PERKS THAT GO ALONG WITH EACH SCHOOL THE TOMES BELONG TO TO REDUCE THE COST, instead of just adding the tomes via console, cheaters. :D\r<br />\r<br />basically this adds a new enchanting workbench that creates spell tomes, located in the midden dark. [i][b][u]to craft the tomes you need to have finished the quest for the daedric prince of which the tome is named after and the fifth enchanter perk&#33; THIS IS THE BASE REQUIREMENT FOR ALL TOMES&#33;[/u][/b][/i]\r<br />\r<br />each tome also requires a high level perk based on the tome, and at least one additional requirement: example: to craft the daedric spell tome: hircine&#39;s will, you need to have finished his quest, ill met by the moonlight, have the bullseye perk (lvl 100) in archery, have the fifth enchanter perk, and the spell bound bow known.\r<br />[b][u]\r<br />[/u][/b][center][b][u][i]all spell tomes are crafted by a burned book, a filled black soulgem, and a daedra heart[/i][/u][/b]. (why a burned book? because only the flames of oblivion could cleanse a destroyed tome and curse it with daedric sorcery, lol)[/center]\r<br />\r<br />[b][u]THERE MAY ALSO BE THE ARTIFACT REQUIREMENT FOR THE RECIPE TO UNLOCK[/u][/b]: some recipes will require you to have the daedric artifact in your inventory and not just finish the quest. (like vaermina&#39;s quest, look below)\r<br />\r<br />LIST OF SPELLS, THEIR REQUIREMENTS, AND THEIR EFFECTS: oh spoiler alert\r<br />﻿(the trend is 3 minutes base duration, 25 ft area for area effects, 1000 base cost for 1-hit spells, 100 mps cost for concentration, 50 magnitude, trying to make 4 spell for each school, destruction ilusion restoration conjuration alteration, totaling 20 spells. finally each book costs 1000 gold base price. hey, they are daedric spells after all) the italic ones are ones i&#39;m done with.\r<br />here&#39;s what i have so far:\r<br />\r<br />[u][b]Hircine&#39;s will[/b]:[/u] conjuration based: casts a bound bow for 3 minutes, fortify marksman 50 points for 3 minutes, fortify sneak 50 points 3 minutes\r<br />\r<br />[u][b]Vaermina&#39;s Nightmare[/b][/u]: illusion: fear for 3 minutes, 25 ft area, 100 magnitude, and paralyze 30 seconds, 25 ft area requires you to have the 5th enchanter perk, master illusion perk, know the paralyze spell, have the skull of corruption in your inventory, and have finished her quest of course. \r<br />\r<br />[u][b]Mephala&#39;s whispers:[/b][/u] illusion, fortify persuasion, backstab 3 min, allure and deceit (50% damage boost to opposite sex) (needs persuasion and allure perk, and base requirements)\r<br />[b][u]\r<br />Peryite&#39;s pestilence[/u][/b]: alteration: inflict poison damage 50 points on 3 min duration, (requires alchemist 5th perk, poisoner perk from alchemy, since it is a poisoning spell, and the base requirements) \r<br />[u][b]\r<br />Nocturnal&#39;s shroud:[/b][/u] illusion, fortify sneak 50 points, muffle and invisibility for 3 minutes ( needs to have quest darkness returns completed for the thieves guild, has spell invisibility, has shadow warrior perk, enchanter fifth perk)\r<br />\r<br />[u][b]Clavicus vile:[/b][/u] two spells: restoration: [u][b]vile&#39;s guile,[/b][/u] fortify two handed, stamina regen, stamina, requires rueful axe in inventory, limbsplitter 3rd perk (in two handed tree). \r<br />second spell: illusion, [u][b]vile&#39;s duplicity[/b][/u]: fortify persuasion and barter, and articulation (so basically double persuasion) requires the haggler 5th perk in speech, and masque of clavicus vile in inventory.\r<br />\r<br />[u][b]Dagon&#39;s Carnage[/b][/u]: destruction, fireball 100 magnitude, 25 area, soul trap 25 area for 3 minutes, fear 50 magnitude 25 feet 3 minutes: requires intense flames perk, master destruction perk, know spell soul trap, have mehrunes razor in inventory, finished his quest and fifth enchanter perk.\r<br />\r<br />[b][u]Molag bal&#39;[/u][/b]s dominance: destruction, frostbite 25 magnitude, vampiric drain, stamina and magicka drain 50 points, requires deep freeze perk, master of destruction, finished his quest, fifth enchanter perk.\r<br />\r<br />[b][u]Namira&#39;s decay[/u][/b]: poison effect, 25 points for 3 min and fear for 3 min: requires corpus enchanter perk, fifth enchanter perk, aspect of terror perk in illusion, finished her quest.\r<br />[b][u]\r<br />Sheogorath&#39;s touch[/u][/b]: alteration: target transforms into chicken, and is struck with permanent hysteria on second hit. requires master illusion perk, finished sheogorath&#39;s quest, has fear spell\r<br />\r<br />[b][u]Malacath&#39;s might:[/u][/b] alteration, fortify health 300 points fortify 2 handed 75, 3 minutes: requires warmaster and skullcrusher(third) perks for two handed, and base requirements\r<br />\r<br />[b][u]Boethiah&#39;s Veil: [/u][/b]alteration: muffle 3 minutes, backstab 3 min, fortify 1 handed: requires backstab, bladesman 3rd perk, base requirements.\r<br />\r<br />[b][u]sanguine&#39;s debauchery[/u][/b]: conjuration: conjures daedra seducer (knows warlock spells), non-hostile damage to targets in 25 to stamina and magicka for 3 minutes. requires master conjuration perk, sanguine&#39;s rose in inventory, and base requirements)\r<br />\r<br />[b][u]Meridia&#39;s Radiance[/u][/b]: destruction: turn undead 100, fireball 50 magnitude, 25 area, requires: necromage perk in restoration, master destruction perk, finished her quest, fifth enchanter perk.\r<br />\r<br />[u][b]Azura&#39;s Command[/b][/u](if you have the pure star) conjuration: mass soultrap, conjure dremora lord, command daedra: requires perk master conjuration, know soul trap, know command daedra, have azuras star in inventory. instead of a black soul gem, you need a grand soul gem to craft this.\r<br />[u][b]Varen&#39;s Desecration[/b][/u] (if you have black star)  conjuration, mass soul trap, reanimate dead, banish daedra: requires perk dark souls, black star in inventory, know spell soul trap, know spell expel daedra.\r<br />[b][u]\r<br />Hermaeus mora&#39;s lore: [/u][/b]restoration: 3 spells:    all require to finish hermeaus mora&#39;s daedric quest, and 5th enchanter perk\r<br />LORE OF MIGHT: for 3 minutes: fortify health 250 points, and fortify 100 magnitude to block, one handed, two handed, heavy armor, and archery: requires the fifth perk of each of those five skills, and regeneration perk in restoration, and enchanter fifth perk. i think this is worth the effect. feel free to yell at me out in the comments :D \r<br />LORE OF SHADOW: for 3 minutes, fortify stamina 250 points, fortify 100 magnitude to sneak, pickpocket, lockpicking, speech, light armor, requires 5th perk of each of those skills, respite perk in restoration, enchanter fifth perk.\r<br />LORE OF MAGIC: for 3 minutes, fortify magicka 250 points, fortify 100 magnitude to destruction, illusion, alteration, restoration, conjuration. requires master perk of each of those schools of magic, fifth enchanter perk, and second recovery perk.\r<br />\r<br />[u][b]please report any bugs, problems, etc[/b][/u]\r<br />\r<br />CREDITS:  finally, i would like to credit the daedric enchanter to [url=http://www.nexusmods.com/skyrim/users/6973877]RefurbMadness[/url] and the cherrywood dragon enchanting table found here:  http://www.nexusmods.com/skyrim/mods/54291/?   thank you so much for letting me use your table\r<br />\r<br />notes (originally this mod was going to let you craft spell tomes to equip as armor but shadowjin refused to let me borrow his tomes, so i figure it&#39;s better to craft daedric spells anyway :D",
  "categoryId": "75",
  "version": "1",
  "author": "paulhanna",
  "createdUnix": "1407963368",
  "updatedUnix": "1408224043",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122385",
      "name": "DAEDRIC ENCHANTER- 20 craftable spells",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3228",
      "fileName": "DAEDRIC ENCHANTER- 20 craftable spells-57022-1.rar",
      "uploadedUnix": "1408224043",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/a5f5717b9b69f88ac06c6453147801deda82de577599ae151abbd153f795f7e2/analysis/1408224079/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DAEDRIC%20ENCHANTER-%2020%20craftable%20spells-57022-1.rar?fid=1000122385&ttl=1535842749&ri=8192&rs=8192&setec=efb1a7c692d3104a58574544c6c58790"
    }
  ]
}