{
  "modId": 57121.0,
  "modName": "Clan Tremere Mod Resurected",
  "summary": "A new guild of Vampire mages has arrived to Solitude; spells, quests and new locations await.",
  "descriptionHtml": "[center][b]\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/25160-1-1349635307.jpg[/img]\r<br />by Galejro[/b][/center]\r<br />[b][color=#ff0000][color=#ffffff][center][size=5]MODERNITY PRE-ALPHA RELEASE&#33;&#33;&#33;[/size][/center][center]\r<br />The mod has entered a pre-alpha stage and it has been released as a full standalone. Several new quests, modern earth urban zones. A new modern time chantry - for now there is just a randomly palced door in the chanbtry labs. And there are modern area teleportation books in the chantry staircase for test purposes.[/center]\r<br />\r<br />[/color][/color][/b][color=#ff0000]\r<br />[size=4][b]Requirements?[/b][/size][/color]\r<br />\r<br />Dawnguard and Dragonborn DLC... nothing more, nothing less.\r<br />\r<br />[color=#ff0000][b][size=4]What it does?[/size][/b][/color]\r<br />\r<br />It creates a new guild of vampire mages, the Clan Tremre from Vampire the Masquerade/ World of Darkness universe. The guild so far gives 7 quests with about 10 to 15 more quests in production. The guild, of course, has its seat in Solitude complete with all its amenities.\r<br />\r<br />The quest line eventually leads you to become a Tremere Vampire. According to World of Darkness lore becoming Tremere means severing all ties to mortal magic, meaning you loose the ability to cast mortal magic. Instead, the mod allows you to use only its internal spells, spells which are fueled with health instead of mana; \r<br />\r<br />- Purely Destruction spells from the Discipline of Thaumaturgy\r<br />- Mind controlling/ Combat spells from the Disciline of Dominate\r<br />- Vision enhancement from the Discipline of Auspex\r<br />- Various support spells from the Discipline of Blood Rituals (Healing, summoning, teleportation or soul catching for soul gems)\r<br />\r<br />[b]A quick word on the Quests - [/b]These are Morrowind-styled quests, they don&#39;t treat you like an idiot, after a talk with the quest giver you just have to work on journal entries that may update as you do what is specified in the quests to do. NO map markers, NO objective update sounds, quest items that are NOT stuck/nailed/riveted to you because &#34;they are quest items and you can&#39;t loose them&#34;, No immortal quest characters, you kill them = you loose chance to continue the quest line and the guild goes nuts on you. Just you, the quest and your wit, without babysitting you all the time. Quests also contain some extra stuff and items that are not specified in the, the mod contains secrets and easter eggs that work to your advantage. \r<br />\r<br />The mod contains a solution in case anyone just needs a hint.\r<br />[b][size=4]\r<br />[color=#ff0000]What is planned for the Future?[/color][/size][/b]\r<br />\r<br />Extra 10-15 quests to complete the guild quest line that&#39;s for sure.\r<br />\r<br />The current quest-line allows you to visit the Clan Cappadocian (also from World of Darkness), I plan to add some additional quest line for that clan as well.\r<br />\r<br />New locations and possibly new vampire clans with their own small quest lines. \r<br />\r<br />A soundtrack for the mod. So far there are just 3 tracks, I seek more.\r<br />[b][size=4]\r<br />[color=#ff0000]Any issues or problems with the mod so far?[/color][/size][/b]\r<br />\r<br />Since the mod has been tested only by one person it is unknown to me so far if the issues that arise are a result of his client or the mod. In order to avoid most of them it is recommended to download the full main file;\r<br />\r<br />- The chantry&#39;s internal architecture textures appear to be combating the vanilla ones. The dark Gothic textures are sometimes replaced by solitude interior textures, rugs may be replaced by their vanilla textures as well. [b][color=#ffff00](Unknown if it will appear on your client as well)[/color][/b]\r<br />- Dialog texts may just flash on your screen. [b][color=#ff0000](Current problem, reccomend the full main file download to solve)[/color][/b]\r<br />- Spells don&#39;t work? There is a &#34;Tome of Transcendence&#34; in the chantry that is supposed to turn 50 of your mana into health as compensation for all you mage players that spent talents on mana. For some reason it doesn&#39;t remove mana and make health but debuffs your mana and adds health. This means that when you eventually become Tremere if you used the tome it will make your mana below 0 and Tremere spells require 0 mana.[b] [color=#ff0000](Current problem, could use help with it)[/color][/b]\r<br />\r<br />I will upload 2 files so far. The full main download file and bare essentials. The Bare essentials is light archive file and .esp technically it&#39;s all that&#39;s supposed to be required for the mod to fully work, but we all know it never works this easily. So I&#39;ll add the full file with extracted dialog files, textures and music, 3x heavier file, but now most stuff should work as intended. \r<br />\r<br />[color=#ff0000][b][size=4]Permissions:[/size][/b][/color]\r<br />\r<br />- Some of the textures, models and all soundtracks I received permission to use. Some are of my own production so ask what you might want to use in your own mod, of course you have full permissions to use the resources of MY own making, you just need to know what is mine.\r<br />[b][size=4]\r<br />[color=#ff0000]Credits:[/color][/size][/b]\r<br />\r<br />-First and foremost White Wolf publishing for making a great universe and therefore, basis for the mod.\r<br />-Bethesda for Skyrim obviously XD\r<br />-Allzero and darkangels0000 for contributing in making this mod as advisors\r<br />-jerminator1977 for Mythic dawn re-texture\r<br />-Komoni for some textures and dark brotherhood robe texture\r<br />-Isoku for window textures\r<br />-mgbeach for rug textures\r<br />-Blary and stoverjm for the Open books resources\r<br />-dove218 and WingoWinston from Newgrounds.com for excellent soundtracks.\r<br />-Linn for the modern house resources\r<br />-Andrew Clements and Nancy Krantz for modern male outfits\r<br />-SydneyB for Modern female outfit\r<br />\r<br />Music:\r<br />\r<br />Death & The Aftermath pt 2 by Dove218\r<br />Avril Lavigne Let Me Go by Dove218\r<br />Necromantic by WingoWinston\r<br />Cor Plumbea by WingoWinston\r<br />\r<br />If I didn&#39;t gave credit for something in the mod that isn&#39;t mine then notify me I shall remedy this instantly. ",
  "categoryId": "25",
  "version": "1.0",
  "author": "Galejro",
  "createdUnix": "1408198674",
  "updatedUnix": "1439058990",
  "containsAdultContent": false,
  "uploadedBy": "Galejro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122320",
      "name": "Main full file",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "165118",
      "fileName": "Main full file-57121-1-0.rar",
      "uploadedUnix": "1408198107",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7471fe457cbb05d2923073c89468a3867db3d20c40cdd910402a9f60995cd61c/analysis/1408198193/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20full%20file-57121-1-0.rar?fid=1000122320&ttl=1535842892&ri=8192&rs=8192&setec=412045dcba03676d4dcbe3ef846031b4"
    },
    {
      "fileId": "1000122321",
      "name": "Bare Essentials Pack",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "41431",
      "fileName": "Bare Essentials Pack-57121-1-0.rar",
      "uploadedUnix": "1408198417",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3793ea3fb03e16cf4971c3b0820292b3feb15fb92699b9b8c995de403c4980f5/analysis/1408198451/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bare%20Essentials%20Pack-57121-1-0.rar?fid=1000122321&ttl=1535842893&ri=8192&rs=8192&setec=b617390bd6efcd21701ed0d0ea540c89"
    },
    {
      "fileId": "1000170987",
      "name": "Modernity patch pre-alpha full (Standalone)",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "341357",
      "fileName": "Modernity patch pre-alpha full (Standalone)-57121-1-1.rar",
      "uploadedUnix": "1439058990",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Modernity%20patch%20pre-alpha%20full%20%28Standalone%29-57121-1-1.rar?fid=1000170987&ttl=1535842893&ri=8192&rs=8192&setec=cc78070dc001e50eb17584350f929d5d"
    }
  ]
}