{
  "modId": 57140.0,
  "modName": "Arthurian Lore - EXCALIBUR - Easter Eggs Improved",
  "summary": "Changes the King Arthur references in the game from levelled swords to unique ones.",
  "descriptionHtml": "=== Also on the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=301428445] Steam Workshop[/url], for those who prefer. \r<br />\r<br />Warning: This mod will require Dawnguard to function properly, as the final upgrade tier of the weapons use the ‘DLC1WeapMaterialDragonbone’-keyword. To what degree the mod might work without Dawnguard, I have no Idea.\r<br />If not a Dawnguard owner, use at own risk.\r<br />\r<br />I will also NOT be answering questions tackled in my FAQ-section, and I retain the right to remove such questions without warning or answer, as I find them vastly annoying and disrespectful.\r<br />Read the FAQ before asking questions.\r<br />\r<br />--------------------------------------------------\r<br />Summary:\r<br />--------------------------------------------------\r<br />\r<br />This mod replaces the swords found in the Authurian Lore (King Arthur) Easter Eggs with new custom, glowing retextures of the Dwarven Greatsword and Sword (There. A freaking one-handed version. Happy?&#33;)\r<br />Furthermore, adds new glowing retextures of the Dwarven Dagger ‘inside’ the Lady Stone (since the Lady Stone is found on a lake, it’s kind of easter egg-y... And I needed a place to put them, because I felt like doing a dagger...)\r<br />\r<br />The emblems on the weapons, which I have always struggled to understand what meant, have been exchanged for dwarf-faces, similar to the ones the dwarves adorn their armour with in the Warhammer universe.\r<br />\r<br />The weapons do extra damage to dragons, and each weapon (and their enchantment) can be upgraded at a forge (‘Misc’-section) using Dragonbones. They are tiered as Iron (when you find them), then Dwarven, then Orcish, then Daedric, and lastly Dragonbone; each requiring the appropriate perk to upgrade and improvable with their corresponding material.\r<br />\r<br />If you like Easter Egg improving mods, my [url=http://www.nexusmods.com/skyrim/mods/48101/?] Bleakcoast Cave [STAR WARS] Easter Egg Mod[/url] just had a big update&#33;\r<br />Be sure to check it out&#33;\r<br />\r<br />--------------------------------------------------\r<br />Exactly what it does:\r<br />--------------------------------------------------\r<br />\r<br /> - REPLACES the levelled sword of the Lady of the Lake Easter Egg, just north of the Bleakwind Basin giant camp, with a unique, glowing, upgradable retexture of the Dwarven Sword, which does extra damage to dragons.\r<br />- REPLACES the levelled sword of the Sword in the Stone Easter Egg, just outside of Rebel’s Cairn, with a unique, glowing, upgradable retexture of the Dwarven Greatsword, which does extra damage to dragons.\r<br /> - PLACES two unique, glowing, upgradable retextures of the Dwarven Dagger ‘inside’ the Lady Stone (which just so happens to be on a lake). These also do extra damage to dragons.\r<br /> - ALL weapons (Sword, Greatsword, and Dual Daggers) are upgradable at a forge (in the ‘Misc’-section) with Dragonbones, granted that you have the appropriate perk to upgrade tot he next tier.\r<br />All tiers are also improvable at a grindstone.\r<br />\r<br />-------------------------------------------------- \r<br />Plans: \r<br />-------------------------------------------------- \r<br />\r<br />No future plans exist for this mod at this point.\r<br />\r<br />--------------------------------------------------\r<br />Compatibility:\r<br />--------------------------------------------------\r<br />\r<br />This mod will conflict with any that alters any of the Easter Eggs described above.\r<br />\r<br />--------------------------------------------------\r<br />FAQ:\r<br />--------------------------------------------------\r<br />\r<br />Q: Great, I see textures, but when are these going to get new awesome models of their own?\r<br />A: Never. I have neither the stamina, time, nor resources to learn 3D modelling. Textures is all I do.\r<br />\r<br />Q: How did you get the sword to glow?\r<br />A: See [url=http://skyrim.nexusmods.com/mods/7069/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D7069&pUp=1] this tutorial[/url] and [url=http://www.loverslab.com/topic/15629-add-glow-effect-to-weapons-solved/] forum topic[/url] for further help. Retexturing weapons to glow is a very easy [and awesome] thing to do. I was able to make my first glowing weapon within two or three hours, and I’m not really that smart. Give it a go&#33;\r<br />\r<br />Q: Why Dwarven weapons? The Dwarves did not forge Excalibur&#33;\r<br />A: Well, apparently in Tamriel they did.\r<br />Another explanation could be that in Norse Mythology the dwarves forge all the powerful tools, and weapons, of the gods. Since Skyrim relies heavily on a nordic feel, maybe that’s where I got the Idea...\r<br />Personally, I just have so many easthetic problems with so many weapons (swords, especially) in the game, and Iron, Steel and Dwarven [and Dragonbone MAYBE...] are about the only ones I actually like...\r<br />\r<br />Q: Are we going to see Axes, Warhammer, etc. later?\r<br />A: Not unless you have some VERY good ideas as to where to put them. Because as of now, I am out of easter eggs for this sort of thing...\r<br />\r<br />Q: These swords seems sorta OP?\r<br />A: Well, in the legend of King Arthur, no matter what interpretation you subscribe to, he has something to do with dragons, and more often than not, that something is murder.\r<br />I made these to be the ultimate dragon-fighting weapons, on par with Dragonbone, but with a powerful enchantment on top.\r<br />In later levels most things get OP, so I don’t really thing they do anything gamebreaking...\r<br />You’re always welcome to tweak it yourself ;)\r<br />(Just don’t re-upload without permission&#33;)\r<br />\r<br />--------------------------------------------------\r<br />Thanks:\r<br />--------------------------------------------------\r<br />\r<br /> - Bethesda Softworks as always\r<br /> - The awesome guys who roam the ‘Quick Questions, Quick Answers’-topics on Bethesda Softworks’ Creation Kit Forum - I could not have done this without you&#33;\r<br />\r<br />--------------------------------------------------\r<br />Permissions:\r<br />--------------------------------------------------\r<br />\r<br />Please do contact me if you have any wish to involve my work in another project. Then we’ll have a chat and see what we can do ;)\r<br />\r<br />Thank you :)",
  "categoryId": "55",
  "version": "1.0",
  "author": "Graesholt",
  "createdUnix": "1408221124",
  "updatedUnix": "1408221038",
  "containsAdultContent": false,
  "uploadedBy": "Graesholt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122374",
      "name": "Arthurian Lore - EXCALIBUR - Easter Eggs Improved",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11003",
      "fileName": "Arthurian Lore - EXCALIBUR - Easter Eggs Improved-57140-1-0.rar",
      "uploadedUnix": "1408221038",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/03416d5cd841e9acc9c6548b24ea2256b310ff5adbf6a8771073b8b49ccf820f/analysis/1408221076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arthurian%20Lore%20-%20EXCALIBUR%20-%20Easter%20Eggs%20Improved-57140-1-0.rar?fid=1000122374&ttl=1535842919&ri=8192&rs=8192&setec=e7018b6a249f8f8c1c1b697c2177c8b3"
    }
  ]
}