{
  "modId": 57166.0,
  "modName": "Craftable Ghost weapons.",
  "summary": "Make your own Ghostly Weaponry.",
  "descriptionHtml": "Hello All i have always Loved the Look of The Drainheart weapons as well as the Ghost blade. But I couldn&#39;t be bothered with going into a dungeon and getting killed a million times before actually getting the darn things. So I had my tech Geek Baby brother whip these Up as fast as possible. Then I thought what the Hell why not upload it to the Nexus. \r<br />\r<br />Essentially all this Mod Does is take the Drainheart weapons And make them Cratable in any Forge In Tamriel. They are also enchantable so you can add your own echantments to them, like Lightning, soul snare, fire and ice etc, etc. \r<br />\r<br />Anyway the way you make them is that You are required to have Arcane blacksmith, 10 filled GRAND soulgems aswell as 25-50 ectoplasms. My brother needed to choose a material to set the Weapons in the crafting table. So they are in the dwarven Section of the Forge. If I can learn enough about the creation kit I may create a whole new tier set to place them in. Heres hoping right? \r<br />\r<br />EDIT: MY Brother is currently looking at Blender 2.71 tutorials on how to make Models, textures, animations, Etc. So rather then the Normal Ancient nord Sword mesh and texture, My brother will most likely create a new model for the weapons or maybe make a set of armor to go with the weapons.",
  "categoryId": "55",
  "version": "1.0",
  "author": "CarosellRarity",
  "createdUnix": "1408295316",
  "updatedUnix": "1408295264",
  "containsAdultContent": false,
  "uploadedBy": "Carosellrarity",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122504",
      "name": "Craftable Ghost Weaponry",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Craftable Ghost Weaponry-57166-1-0.rar",
      "uploadedUnix": "1408295264",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/436a11c9e0c47b9b31ee2211d988073e73d614cf859c0c1c12c7c16f8acbee4c/analysis/1408295285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Ghost%20Weaponry-57166-1-0.rar?fid=1000122504&ttl=1535842976&ri=8192&rs=8192&setec=ba98837cd6b1ac64374306ab99d13a56"
    }
  ]
}