{
  "modId": 57161.0,
  "modName": "Griffins Land Episode II- Colonialized",
  "summary": "Adds a large new island to skyrim to discover with several beautiful dungeons and diverse landscapes. \r<br />Now with two castles and factions fighting over the island, several changes in landscape as result of colonialization. Requires Dawnguard.",
  "descriptionHtml": "Adds a large new island to skyrim to discover with several beautiful dungeons and diverse landscapes. \r<br />\r<br />Content: \r<br />- a large new Island, landscape created by hand \r<br />- an imperial castle \r<br />- an orcish stronghold \r<br />- new npcs, everyone with a unique schedule and patrols to enhance immersion \r<br />- new weapons \r<br />- dungeons \r<br />- eastereggs \r<br />&#33;Requires Dawnguard&#33; \r<br />\r<br />Episode II is set a few years after the first Episode, when the island was discovered. After the East Empire Trading Company sent word to Cyrodiil, the Imperial Army followed to build a castle. Their mission was to find resources on the island and to create a new trading route to skyrim. Eventually, the former sailors of the explorer&#39;s ship, the orcs, didn&#39;t want to share their income, so they moved to the icy heights to build an own stronghold, fighting over the island&#39;s resources with the imperial army. Their reputation is to be extraordinary skilled and merciless warriors, worshipping their deadric God Malacath and sacrificing Men to him. \r<br />By now, most of the northern half of the island is under orcish control, while the south eastern part is imperial. The Forest of the eastern side is No-Man&#39;s-Land, patrolled by several hunters of both sides. \r<br />Can you fight off the Orcs? \r<br />Will you eradicate the Empire&#39;s influence? \r<br />Or will you build a cabin in the woods, living from what the island gives you, while Orcs and men keep fighting each other? \r<br />\r<br />To get to the Island you just have to get to the new big ship near Windhelm, walk up to the stern of the deck and you will sail there. When you reached the eye of the storm, activate the door under the ship&#39;s wheel that will teleport you to Griffin&#39;s Land. \r<br />Alternative: type &#34;coc springquellcavern&#34; in your console \r<br />\r<br />Stuff coming soon: \r<br />- Groups of two enemy factions patrolling the island, so they will meet eventually and fight each other \r<br />- Dialogue for various NPCs \r<br />- Custom soundtrack, a cool one, probably \r<br />- some sidequests, maybe \r<br />- Episode III will be called &#34;Exploited&#34; \r<br />\r<br />The Mod is fully playable, but not quite finished. I will add some patrols and battlefields to bring the conflict to life. NavMesh in important areas was made by hand. Updates will be coming regulary. Feedback and Suggestions are as always welcome, thank you. \r<br />\r<br />Now go and have fun&#33;",
  "categoryId": "30",
  "version": "0.9",
  "author": "Viktor Kurz",
  "createdUnix": "1408286739",
  "updatedUnix": "1408286730",
  "containsAdultContent": false,
  "uploadedBy": "vykaz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122473",
      "name": "Griffin&#39;s Land Episode II- Colonialized",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37061",
      "fileName": "Griffin's Land Episode II- Colonialized-57161-0-9.rar",
      "uploadedUnix": "1408286730",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/ced1ada5a65e365127fe9dce672c562723512bbd1326c1a9052d27773e04a5c5/analysis/1408286772/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Griffin%27s%20Land%20Episode%20II-%20Colonialized-57161-0-9.rar?fid=1000122473&ttl=1535842959&ri=8192&rs=8192&setec=f63232dd58412e5e03311cb2d0b8471a"
    }
  ]
}