{
  "modId": 57186.0,
  "modName": "Lakeview Manor Stockade and Guards",
  "summary": "What this mod does:\r<br />\r<br />Adds a wooden stockade around the Hearthfires Lakeview Manor in Falkreath. The stockade has three gates, each manned by a guard. Five additional guards patrol the area. ",
  "descriptionHtml": "I like Lakeview, but I&#39;ve got virtual kids and a &#34;Children can die&#34; mod on so I felt Lakeview was just a little too... insecure for child rearing. So I put in some stockade walls and created five guards. They&#39;ve got a basic patrol package that has them walk around the house, check on the farm next door, then patrol the road a bit and they&#39;re all armed with bows and a heavy emphasis on ranged combat to help out with the constant plague of flying lizards.\r<br />\r<br />This mod\r<br />\r<br />- Adds a stockade around Lakeview Manor\r<br />\r<br />- Removes some trees to make room for the stockade\r<br />\r<br />- Adds three guards who stand at the entrances to the stockade\r<br />\r<br />- Adds five guards that travel around the area to keep your household safe\r<br />\r<br />The guards are intended to protect your NPCs and as such they are set to be 1.5x the player&#39;s level. They use Falkreath Guard dialogue and equipment but will not report you for crimes. Custom combat styles make them very aggressive with their bows, allowing them to clear dragons out of the area reasonably well. Together with the walls this should make your house much safer and more secure. Spend more time gardening and less time worrying that your kids are going to join the Skryim Space Program due to an unexpected giant attack&#33;\r<br />\r<br />Compatibility:\r<br />\r<br />This mod should be compatible with most mods. The only things that would be likely to cause issues would be mods that change the Lakeview Manor exterior cells or navmesh. Aside from that all assets are vanilla, so you should be good to go.\r<br />\r<br />Note to other modders: If you&#39;d like to tinker with this mod all the AI packages, NPCs, and other bits are prefixed FM_ to make them easier to find in the creation kit interface. ",
  "categoryId": "67",
  "version": "V01",
  "author": "FrankManic",
  "createdUnix": "1408337162",
  "updatedUnix": "1408337133",
  "containsAdultContent": false,
  "uploadedBy": "FrankManic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122585",
      "name": "FMLakeviewGuardsandStockadev01",
      "version": "V01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "155",
      "fileName": "FMLakeviewGuardsandStockadev01-57186-V01.zip",
      "uploadedUnix": "1408337133",
      "modVersion": "V01",
      "virusScanUrl": "https://www.virustotal.com/file/b9f3752399ac02fc38301ca0944919acf10e99fcb6bccff6d64209a5129af74b/analysis/1408337223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FMLakeviewGuardsandStockadev01-57186-V01.zip?fid=1000122585&ttl=1535843013&ri=8192&rs=8192&setec=03a22212f6293b18d835712d1986a4a4"
    }
  ]
}