{
  "modId": 5722.0,
  "modName": "Ohmes Catface Tattoos",
  "summary": "Seven catface tattoos for Ohmes or Ohmes-Raht.",
  "descriptionHtml": "Title:  Ohmes Catface Tattoos\r\n\r\nAuthor:  Asterai\r\n\r\nVersion:  1.0\r\n\r\nRelease date:  1/8/12\r\n\r\nCategory:  Modder\\'s resource\r\n\r\nRequirements:  None\r\n\r\nDownload the latest version at:  http://www.skyrimnexus.com/downloads/file.php?id=5722\r\n\r\nForum home:  http://forums.bethsoft.com/topic/1330902-relz-ohmes-tattoos-etc/\r\n\r\n\r\nDescription:\r\n\r\n\\\"[The Ohmes variety of Khajiit are] similar in many ways to the Bosmer, although generally of lesser stature. In order to avoid being mistaken as one of the Bosmer many Ohmes tattoo their faces to resemble a feline-aspect.\\\"  - UESPWiki, Lore: Khajiit\r\n\r\nI made catface tattoos so that quest and race modders could add Ohmes and Ohmes-raht characters to the world.  Feel free to use them for other purposes, too.\r\n\r\nThis mod includes male and female versions of seven feline-esque tattoos that display well on both elf and human faces.  I tried to cover a wide range of artistic and emotional archetypes in these tattoos; hopefully you can find something that suits your modding needs.\r\n\r\nI may add more tattoos as inspiration strikes.\r\n\r\n\r\nPermissions:\r\n\r\n- Please do not upload to any site you own, are employed by, or will otherwise profit from.  I prefer that these files be uploaded only to sites that have a strong focus on supporting the Elder Scrolls modding community, but in case of a modding apocalypse (Cthulhu wakes, eats Nexus servers, and returns to slumber, for example), do whatever you deem necessary.\r\n\r\n- You may use these for anything you want, but give credit where credit is due.  I\\'d prefer that where I\\'m credited, you also describe briefly what I contributed (a single phrase will suffice); I consider this good practice and will do the same for others in my own work.\r\n\r\n- I\\'d also appreciate it if you sent me notice when you use my mods; I\\'m interested to see what others will do with my work!  You do not need to wait for any response from me before continuing.\r\n\r\n- You may redisribute these files unaltered, and with the readme intact.\r\n\r\n- You may redistribute these files with minor added value (renamed to be used as replacers, or forming the enitre base of new resources for a single race, for example) if you place a prominent notice attributing my files, but not your mod, to me.\r\n\r\n- You may redistribute these files as part of a larger work (as part of a quest mod, or as part of a mod that adds and balances multiple races, for example) so long as you credit me.\r\n\r\n- This mod was made without any resources or tools from Bethesda Softworks, and therefore may be repurposed for use in other games, so long as you observe the guidelines above, any applicable terms in the EULA, and any applicable local laws.\r\n\r\n- If you feel these terms should be modified I am open to discussion.  My goal is to make my work usable by many people while receiving proper credit for that work, and avoiding the woes that can come with uncontrolled distribution.\r\n\r\n\r\nChangelog:\r\n\r\n1/8/12:  First upload\r\n\r\n\r\nCredits:\r\n\r\nScreenshots are taken with Xenius Character Enhancement, a character texture improver.\r\n\r\n\r\nTools used to create this mod:\r\n\r\nFallout Mod Manager BSA Browser to extract texture files.\r\n\r\nNVIDIA Texture Tools for Adobe Photoshop to open and save .dds files.\r\n\r\nPhotoshop Elements to create tattoo art.\r\n\r\n\r\nContact:\r\n\r\nBe aware that I only support versions of these files that I uploaded myself.  I WILL NOT and CANNOT support files uploaded by others, i.e. anywhere other than http://www.skyrimnexus.com/downloads/file.php?id=5722 .\r\n\r\n\r\nPost in the forum home (listed above), or in the discussion section for this file.  This is preferable to PMing me because other experienced users may be able to help you if I am out of contact.\r\n\r\nI may take a while to respond.  Modding is not supposed to be my top priority.",
  "categoryId": "34",
  "version": "1.0",
  "author": "Asterai",
  "createdUnix": "1326072900",
  "updatedUnix": "1326075648",
  "containsAdultContent": false,
  "uploadedBy": "Asterai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18101",
      "name": "Ohmes Catface Tattoos",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "222",
      "fileName": "Ohmes Catface Tattoos-5722-1-0.zip",
      "uploadedUnix": "1326075648",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2e89d5a353147fbd21c9856c33d53de8d378bb5c33e4044f89098da26f97fda6/analysis/1406595784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ohmes%20Catface%20Tattoos-5722-1-0.zip?fid=18101&ttl=1535762673&ri=8192&rs=8192&setec=cf0bfd1dd2ec87b2f8bf308b3f51182c"
    }
  ]
}