{
  "modId": 57257.0,
  "modName": "Scrib Shield",
  "summary": "A head of an Ash Hopper as a shield",
  "descriptionHtml": "[img]http://static-3.nexusmods.com/15/images/110/5083650-1360156467.jpg[/img]\r<br />\r<br />Well in this case Chitin. \r<br />\r<br />From the void in which I call my mind crept this abomination, The Scrib Shield&#33; (yes I know it&#39;s an Ash Hopper, just let me have my moment)\r<br />\r<br />Ever since seeing this little bugger I said to myself (because I was the only one there at the time) &#34;That noggin&#39; would make a good shield&#34; but sadly back then I didn&#39;t know how to get items into the game but now I do and chances are you&#39;ll see me more often now. \r<br />\r<br />The Scrib Shield can be crafted at a forge from 5 Chitin plates, 2 Netch leather and with the Elven Smithing perk, it can also be tempered with 1 Chitin plate and it also can be found in various places where Ash Hoppers reside whithin solsthiem, I haven&#39;t hid them so they&#39;ll be easy to see just look near trees. There&#39;s about 5 laying around and if you&#39;re really lazy there&#39;s one in the Qasmoke cell near the Dragonborn chests just past the doorway. \r<br />\r<br />It&#39;s a wee bit better than the Chitin shield and a wee bit heavier but it&#39;s still classed as  a light shield. Yes it doesn&#39;t look much in first person but that&#39;s not my fault, I&#39;m hoping there&#39;s some Ash Hopper Retex&#39;s out there to ease the eye burn. \r<br />\r<br />Right that&#39;s your lot, enjoy your new shield and if you ask nicely I&#39;ll probably make some weapons out of Scribs.\r<br />\r<br />[color=#f1c232]If you have the Hi-Res textures DLC, it would make the Scrib Shield look less blurry. [/color]\r<br />\r<br />Until next time.\r<br />Muddy. ",
  "categoryId": "54",
  "version": "V1",
  "author": "MudCrabKing",
  "createdUnix": "1408483680",
  "updatedUnix": "1408482774",
  "containsAdultContent": false,
  "uploadedBy": "MudCrabKing",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122840",
      "name": "Scrib Shield",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "70",
      "fileName": "Scrib Shield-57257-V1.rar",
      "uploadedUnix": "1408482774",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/1ef7b1a72fb4754c8e81a4fd3d7fcaa5a1f463630b77262d18e84ff05f8eec0c/analysis/1408528076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scrib%20Shield-57257-V1.rar?fid=1000122840&ttl=1535843152&ri=8192&rs=8192&setec=d92b7f10f5cac0c8516065ea158a0fba"
    }
  ]
}