{
  "modId": 57266.0,
  "modName": "Parentless Connection Framework",
  "summary": "A small script to allow other mods to pass information to yours without any interaction between the two.",
  "descriptionHtml": "Requires [url=skse.silverlock.org]SKSE[/url]\r<br />\r<br />When you make a mod accept information from other mods, it often comes with one of two drawbacks. Either your mod must be updated constantly to accept the new information, or their mod must insert its information into yours, which requires a script, and a quest if they don&#39;t already have one.\r<br />\r<br />With this, script, you can set up the script in your mod, then other mods can pass information to you simply by creating a global variable and changing its FormID. This means you don&#39;t need to update your mod, and they don&#39;t need scripts and quests.\r<br />\r<br />Why would you need this? The idea behind this plugin is to use it in mods which are intended for other mods to be able to interact with it. For instance, if you charge the player taxes based on the houses they own, but the houses cost different amounts of gold based on how extensive they are, where they&#39;re located, or something else, then there&#39;s no good way for you to determine how much to charge for the owning the house or even necessarily whether or not the player owns the house. With this system, you could be compatible with any house mod (and any [i]number[/i] of house mods) as long as they have a global variable for what the current rent should be for that house. The mod would set the rent to a relevant price when the player owns the house and 0 before that point. That house mod would only have this inherent compatibility with that rent mod, but other rent mods could also pull in that same global variable, allowing compatibility without any extra work. And the mod that charges rent doesn&#39;t need to look for mods that add houses. It just finds these specific global variables and that&#39;s it. The rent mod, in this case, should check if the form is a global variable or a formlist of global variables in case some mod adds multiple houses.\r<br />\r<br />Another usage example would be a mod that affects all ingredients or all of a certain type. Rather than constantly scanning the player for unknown ingredients to add to the mod&#39;s lists or making a compatibility patch for each mod which adds ingredients, the plugin would allow the mod to simply look for a formlist of ingredients which should be affected. The makers of the mods which add these ingredients would then just need to make a formlist of all of the ingredients which the mod should affect. If the other mod isn&#39;t installed, the formlist is useless but does nothing harmful.\r<br />\r<br />As you can see, this plugin does add a new way for mods to interact with one another. It may not open up a whole new era of modding, but for certain cases, it could make an otherwise difficult task very easy.\r<br />\r<br />The process is simple.\r<br />[list=1][*][size=2]Create a FormList. This will contain the actual forms from the other mod, whether they&#39;re global variables that contain numbers or formlists that contain whatever it is your mod uses (or any other form).[/size][/*]\r<br />[*][size=2]Create a quest, then attach the included script to that quest.[/size][/*]\r<br />[*][size=2]Set the two properties. The FormList property should be the FormList from step 1. The FormIDBase should be &#34;{F}{NexusModID}&#34;. Your NexusModID is the number in your mod&#39;s URL on the Nexus. If you number is more than 5 digits, truncate it or convert it to hexadecimal. If it is less than 5 digits, preceed it with 0&#39;s. It MUST be 5 digits. This doesn&#39;t have any affect on the actual script. It ONLY serves to allow other modders to link to know which number to use, and using your NexusID allows you to avoid conflicts with other mods.[/size][/*]\r<br />[/list][size=2]You&#39;re done. When you run the game, your formlist will be populated with any relevant forms from other mods.\r<br />\r<br />[/size]To make a mod use this system from the other end, it&#39;s just as easy, but it requires Tes5Edit.\r<br />[list=1][*][size=2]Make a form that you want to pass and the other mod is expecting. If it&#39;s expecting a global variable, make a global variable. If it&#39;s expecting a formlist, make a formlist.[/size][/*]\r<br />[*][size=2]Save and exit.[/size][/*]\r<br />[*][size=2]Open your mod in Tes5Edit. Find the form you made.[/size][/*]\r<br />[*][size=2]Right click and choose &#34;Change FormID&#34;.[/size][/*]\r<br />[*][size=2]DO NOT TOUCH THE FIRST TWO DIGITS[/size][/*]\r<br />[*][size=2]Set the last 6 digits to {F}{NexusModID}.[/size][/*]\r<br />[*][size=2]Exit and allow it to save.[/size][/*]\r<br />[/list][size=2]That&#39;s it. The other mod will get the info, and from there, magic.\r<br />\r<br />[/size]I&#39;ve included some examples. There are two files. One file, PCF_Test, is just a global variable with the correct FormID. The other, PCF_Parentless Connection Framework contains a quest with two scripts. The manager script is the one that you&#39;ll be using. The other just shows it in action. This esp also contains a global, although it has a different value. This global is in no way directly connected to the quest or the script, but the script will pick it up just as if it came from another mod. If you start the game with these two enabled, after about 10 seconds, you&#39;ll get two notifications telling you the name of the mod it found the form in, and the value of the form (they&#39;re both global variables, although the example is set up to also accept a formlist which is populated with globals for passing multiple arguments).\r<br />\r<br />This script ONLY runs when the it updates, and unless you update it, that only happens once. To use it in your mod, discard everything except PCF_ManagerScript. Attach that to your quest, the rest is just for showing you what it does.\r<br />\r<br />If you have any questions, let me know.",
  "categoryId": "82",
  "version": "1.0",
  "author": "Xander9009",
  "createdUnix": "1408500495",
  "updatedUnix": "1408500492",
  "containsAdultContent": false,
  "uploadedBy": "Xander9009",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122890",
      "name": "Parentless Connection Framework",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Parentless Connection Framework-57266-1-0.zip",
      "uploadedUnix": "1408500492",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0d6ec9e93ad61c6ac0f714e6f4c70496d2d2618602891971a64200328a12dcce/analysis/1408527307/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Parentless%20Connection%20Framework-57266-1-0.zip?fid=1000122890&ttl=1535843165&ri=8192&rs=8192&setec=7c0670db7914b99355792164c52f3e3b"
    }
  ]
}