{
  "modId": 57279.0,
  "modName": "Sounds of Westeros - Game of Thrones Soundtracks for Skyrim.",
  "summary": "IMPORTANT: This Mod does not provide the Music Tracks from the Game of Thrones Soundtracks. For this mod to work it is required for you to have the Game of Thrones Soundtracks.\r<br />This mod only adds the Esp File that will allow the music tracks to play in the game. Read the mod page for instructions on how to convert and where to place the music",
  "descriptionHtml": "Introduction:This Mod is for all the fans of Game of Thrones that play Skyrim and that would really like to listen to the amazing Soundtrack of the Tv Series while they play Skyrim.　\r<br />\r<br />Details:\r<br />In order for this to happen you must have for now the Game of Thrones Soundtrack from Season 1 that i cannot provide for you.That&#39;s the main requirement of the mod in order for it to work.What i will do is to provide you with the Esp file that will make the music tracks play in the Skyrim game; and the respective folders for you to put the music tracks that you will have to convert to the .xwm file type with a software programme available on the nexus site.The .Esp file name is Game of Thrones Soundtracks.esp and the folders are Data/Music/Game of Thrones/Season 1.Be sure to follow all the steps that i will be mentioning next; in order for you to be able to listen to the Amazing Game of Thrones Soundtracks while playing Skyrim.\r<br />\r<br />Steps:\r<br />\r<br />Step 1:\r<br />Installing:First download the mod manually or with the nexus mod manager.Next go to your Skyrim/Data/Music folder; and search for a folder with the name &#34;Game of Thrones&#34;; click on it and inside will find another folder called &#34;Season 1&#34;.Inside this folder &#34;Season 1&#34; is where you will put all your converted Game of Thrones Season 1 music tracks.\r<br />\r<br />Step 2:\r<br />Now that you know where to put the Music tracks that you will be converting; its time to download the software programme that will allow you to convert your music tracks into the .xwm file type that is required in order for the game engine to play the music tracks in the game.You need to convert the music tracks because the game engine has its own music player; and also to avoid game crashes.&#34;Be sure to confirm first if none of your music track files is damaged in order to avoid the game to crash.&#34; 　[size=3]In the Skyrimnexus website use the search engine and writte [/size]Skyrim Audio Converter by [b]JohnB[/b]; or go to this url address: http://www.nexusmods.com/skyrim/mods/8303/?Download the software programme and install it; and don&#39;t forget to endorse it.\r<br />\r<br />Step 3:\r<br />Using the software programme is really easy; but if you have any doubts read the mod page.After converting all of your music tracks into .xwm file type; place them all on the folder called &#34;Season 1&#34; that i have mencioned before and that is located in &#34;Skyrim/Data/Music/Game of Thrones/Season 1&#34;.Next comes one of the most important steps of all if not the most important; so read carefully and be patient; because we are almost done.\r<br />\r<br />Step 4:\r<br />This next step is super important because all of the converted music tracks must have the exact same name has the ones i have selected on the Creation Kit; and that are the ones the .Esp file Game of Thrones Soundtracks.esp will be recognising when you are playing Skyrim; or they will not play at all or it could make the game crash; so i will be giving next an example on what you must do in order for this to work correctly.\r<br />The name of the first Music track of my Game of Thrones Soundtrack is:                   \r<br />\r<br />01 Main Title.xwm\r<br />\r<br />Lets imagine that yours is:\r<br />\r<br />Game of Thrones - 01 Main Title.xwm\r<br />\r<br />This may not seem important but in fact its really important because the esp file will not recognize this music file because it has not the same name has the one above; so all of the names of the music tracks i will be writing on the next step will have to be exactly the same has the ones that you have put on the &#34;Season 1&#34; folder; so be careful and confirm if they are correct otherwise the mod will not work.If the the names of the music tracks that i will be writing on the next step are different than yours like the ones on the example above; be sure to change they&#39;re names.The easiest way to do this is just to copy the names with your mouse and paste them on the name of your correspondent music track.\r<br />\r<br />Step 5:\r<br />These are the names of the music tracks that the Game of  Thrones Soundtracks.esp file will recognize:Skyrim/Data/Music/Game of Thrones/Season 1/:\r<br />01 Main Title\r<br />02 North of the Wall\r<br />03 Goodbye Brother\r<br />04 The Kingsroad\r<br />05 The King&#39;s Arrival\r<br />06 Love In the Eyes\r<br />07 A Raven from King&#39;s Landing\r<br />08 The Wall\r<br />09 Things I Do for Love\r<br />10 A Golden Crown\r<br />11 Winter Is Coming\r<br />12 A Bird Without Feathers\r<br />13 Await the King&#39;s Justice\r<br />14 You&#39;ll Be Queen One Day\r<br />15 The Assassin&#39;s Dagger\r<br />16 To Vaes Dothrak\r<br />17 Jon&#39;s Honor\r<br />18 Black of Hair\r<br />19 You Win or You Die\r<br />20 Small Pack of Wolves\r<br />21 Game of Thrones\r<br />22 Kill Them All\r<br />23 The Pointy End\r<br />24 Victory Does Not Make Us Conquerors\r<br />25 When the Sun Rises In the West\r<br />26 King of the North\r<br />27 The Night&#39;s Watch\r<br />28 Fire and Blood\r<br />29 Finale\r<br />\r<br />All of them sould have the .xwm extension at the end of the name.\r<br />\r<br />Step 6:\r<br />Now that we have completed all of the previous steps its time to check if the Game of Thrones Soundtraks.esp file is active and then test if the mod is working.The easiest way to test the mod is to Fast Travel to a Majot city like Whiterun or Solitude and hang out there for a while until a Game of Thrones Music starts to play.Remember that this mod does not replace the Musics from the Skyrim game; so it may take a while for you to listen to a Game of Thrones music.If you have any doubts about the mod be sure to comment on the mod page or send me a message; i will reply if i can.I hope you enjoy this mod and don&#39;t forget to endorse if you really like it. \r<br />\r<br />Uninstalling: \r<br />Just deselect the Game of Thrones Soundtracks.esp file and delete the Game of Thrones Folder [font=Times New Roman]found on Skyrim/Data/Music/.\r<br />\r<br />Credits:\r<br />[/font][font=Times New Roman]George R. R. Martin for writting the Game of Thrones Books\r<br />[/font][font=Times New Roman]Ramin Djawadi and all the Musicians that made the amazing Game of Thrones Sountracks.\r<br />HBO Channel and all of the Game of Thrones Cast for the best tv show in years to come.\r<br />Bethesda for creating the best video game Rpg&#39;s.\r<br />Nexus websites for creating a great modding community.　　　[/font]",
  "categoryId": "61",
  "version": "1.0",
  "author": "Sergeynest",
  "createdUnix": "1408549526",
  "updatedUnix": "1408549422",
  "containsAdultContent": false,
  "uploadedBy": "Sergeynest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000122968",
      "name": "Sounds of Westeros",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Sounds of Westeros-57279-1-0.zip",
      "uploadedUnix": "1408549422",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/38e9ec18dd419d4d1a217edb218add48fe4c68749ba140277e8c9ddebecde0ba/analysis/1408549505/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sounds%20of%20Westeros-57279-1-0.zip?fid=1000122968&ttl=1535843191&ri=8192&rs=8192&setec=bbd540f053c96adb4a9dc4f984269d43"
    }
  ]
}