{
  "modId": 57299.0,
  "modName": "Immersive Perks - BETA",
  "summary": "This mod overhauls every Perk in Skyrim, making the names and flavor text more immersive\r<br />Re-balances and re-designs the Perks and Perk Trees for convenience and Role Playing\r<br />Above all it is designed with compatibility and ease of use in mind and is one simple ESP file",
  "descriptionHtml": "[center][b][size=5][color=yellow]Skyrim Immersive Perks[/color][/size]\r<br />[size=3]Unlike most perk mods on the nexus, this one is designed with simplicity in mind.\r<br />Outside of mods that edit perks directly as well, it should have no conflicts and should require no patches.\r<br />It re-balances armor and weapons, yet does not and will not ever need patches for armor and weapon mods.\r<br />So long as they are properly tagged with light/heavy, one-handed/two-handed and material type so they work in Vanilla.\r<br />Installation and Uninstallation is a breeze, it is nothing but one single ESP, no clean save is required, totally risk free&#33;\r<br />This mod is still in &#39;beta&#39; because it has not been tested much, if you notice ANY problems please let me know. \r<br />I am likely going to rebuild this mod from the ground up at some point, so more ideas for that is always good&#33;\r<br />[/size]\r<br />------------------------------------------------\r<br />\r<br />[size=5][color=yellow]What does this mod do?[/color][/size]\r<br />[size=3]It changes around all the perks in Skyrim to feel more, well, immersive. Rather then saying &#34;increases heavy Armor by 10%+ it will say &#34;I am a Novice at Heavy Armor and can use it to defend myself with a decent bit of skill&#34;. A great deal of thought has been put into assuring that it provides as much information as possible about the perks, but at the same time prevents it from being a mathematical calculation. It is designed so that it seems more as a list of actual skills and traits your character has gained through effort and training, rather then bonuses you&#39;ve unlocked through spending level up points.\r<br />\r<br />It also rebalances some of the perks as well, some, like Two-Handed Weapons and Heavy Armor now boost those respective skills more, but the perks are unlocked at a slightly higher level and they level up slightly slower. Some of the overpowered/over abusable skill trees such as Light Armor and One-Handed Weapons have been slightly nerfed, but are still very viable to use as it takes less time to get to the good perks in these skills. Some trees, such as illusion and alteration have been buffed as well to make them more viable. In fact, illusion probably got the biggest buff of all, as I thought it was basically useless in the vanilla game, even playing a as a vampire with illusion buffng enchantments on my armor, it only effected enemies of such a low level it felt pointless to even bother using illusion spells on them. Why even bother frenzying a skeever? If you feel illusion is now overpowered, please let me know, but it should not be.\r<br />\r<br />Perhaps most importantly though, this changes the layout of the perk trees, making it so you should no longer be forced to get perks you don&#39;t want to just to unlock the ones you do want. Perks linked together, are get this, actually related perks, rather then say, speechcraft requiring &#34;persuasive&#34; perk to unlock the &#34;intimidation&#34; perk, or alchemy requiring the &#34;benefactor&#34; perk for the &#34;poisoner&#34; perk, if you are playing a character that is not nice, or does use healing, these perks are not only a waste of a valuable perk point, but unimmersive to have. Now, perk trees branch out based on the different &#34;skill paths&#34; your character can take. Though they don&#39;t make &#34;shapes&#34; as well now.\r<br />\r<br />Lastly, it changes up the Destruction and Enchanting tree, making Fire, Shock, and Frost mutually exclusive. For example, the fire spell and fire enchantment perks will lock out the shock and frost enchantment and spell mods respectively, and make your frost and shock spells/enchantments weaker. However it now buffs the spell/enchantment you pick even more. This is meant to be more immersive, as you basically never see NPCs in the game swap between elements. This does not prevent you from picking say, fire enchantments and frost magic, though I don&#39;t know why you would do that, and it also doesn&#39;t prevent the summoning of any kind of atronach nor does it weaken any of them based on what you pick. \r<br />\r<br />Check out the video for this mod in the video section to see all the changes made to the perks and perk trees. [/size]\r<br />\r<br />------------------------------------------------\r<br />\r<br />[size=5][color=yellow]What doesn&#39;t this mod do?[/color][/size]\r<br />[size=3]It doesn&#39;t add any perks. It doesn&#39;t remove any perks. it doesn&#39;t edit ANYTHING outside of the perks and perk trees. It doesn&#39;t add scripts. It doesn&#39;t add textures, meshes, or anything else. It doesn&#39;t bake anything into your save file, it doesn&#39;t require a clean save to remove. It doesn&#39;t make any of the perks do anything dramatically different. It doesn&#39;t need a patch for Armor mods, it doesn&#39;t need a patch for Weapon mods, it doesn&#39;t need a patch for Creature mods it doesn&#39;t need a patch for NPC mods, it doesn&#39;t need a patch for Spell mods, if it works with the vanilla game and does not directly edit perks or perk trees it does not conflict or require a patch with this mod, period.\r<br />[/size](as far as I know)\r<br />\r<br />------------------------------------------------\r<br />\r<br />[size=5][color=yellow]What does this mod conflict with?[/color][/size]\r<br />[size=3]Skyrim Redone, Requiem, ACE, SPERG, Stealth Skills Rebalanced, and anything else that edits the perks like this mod.\r<br />I MAY come out with a patch for some of these mods in the future, but Requiem and Skyrim Redone dramatically edit every perk so it&#39;s not likely I will try those, I also have never used and know nothing about SPERG so that one isn&#39;t likely. ACE and SSR.. maybe.[/size]\r<br />\r<br />------------------------------------------------\r<br />\r<br />[size=5][color=yellow]installation/uninstallation[/color][/size]\r<br />[size=4]To Install:[/size]\r<br />[size=3]Download and drop &#34;Immersive Perks.esp&#34; into your Skyrim/Data folder[/size]\r<br />[size=4]To Uninstall:[/size]\r<br />[size=3]Delete &#34;Immersive Perks.esp&#34; in your Skyrim/Data folder[/size]\r<br />\r<br />[size=4]Uninstall/Install Late Game?:[/size]\r<br />[size=3]If you uninstall/install this mod late in a play through and have a bunch of spent perk points, it might have odd effects as this mod changes the placement and level of some perks, so I actually suggest [url=http://www.nexusmods.com/skyrim/mods/16471/?]Ishs Respec Mod[/url], this mod is compatible with it [u]without the need for a patch[/u]. You can use it to reset and repick your perks if you do choose to install/uninstall this mod late in a play through.[/size]\r<br />\r<br />------------------------------------------------\r<br />\r<br />[size=5][color=yellow]Credits[/color][/size]\r<br />[size=4]Art Murder - Author/Creator.[/size]\r<br />\r<br />------------------------------------------------\r<br />[/b][/center]",
  "categoryId": "78",
  "version": "9.1",
  "author": "Art Murder",
  "createdUnix": "1408582656",
  "updatedUnix": "1408740234",
  "containsAdultContent": false,
  "uploadedBy": "ArtMurder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123298",
      "name": "Immersive Perks",
      "version": "9.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Immersive Perks-57299-9-1.7z",
      "uploadedUnix": "1408740234",
      "modVersion": "9.1",
      "virusScanUrl": "https://www.virustotal.com/file/d0a0c7eee49911b05d1643513cfb48240e31afcde921b5677b50cc5729176a9f/analysis/1408740304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Perks-57299-9-1.7z?fid=1000123298&ttl=1535843230&ri=8192&rs=8192&setec=2a2cca404470f29c7d1214f615384c34"
    }
  ]
}