{
  "modId": 57325.0,
  "modName": "Dragon Falls Stables and Camp Site",
  "summary": "Adds a small stables with a basic stablehand (can be recruited) and a camp site, ideal for followers and their horses, to the top of the waterfall used by the brilliant Dragon Falls Manor player house. For both a nice new area or just a way to stop Lydia bouncing all the furniture around as she smashes into tables and jumps through windows etc.",
  "descriptionHtml": "[center][color=#ffff00]Disclaimer: I am not a good modder, this is made for my own personal use and uploaded for the few other people who might be interested. Always back up your save before installing to make it easier to remove if there is a serious conflict.\r<br />I will take feedback and advice to try and improve this mod if people like it, and I will add more features as my modding abilities grow.\r<br />[/color][color=#ff0000][size=1]Also first mod, woo&#33;[/size][/color][color=#ff0000]\r<br />[/color][/center][url=http://imgbox.com/RtiDCJwL][center]﻿[/center][center]﻿[/center][img]http://i.imgbox.com/RtiDCJwL.jpg[/img][/url]\r<br />\r<br />[color=#ff0000]Description:[/color]\r<br />This mod (made to be used in tandem with the brilliant [url=http://www.nexusmods.com/skyrim/mods/10901/?]Dragon Falls Manor[/url] player home) adds a stable and campsite to the hills at the top exit of Darkwater Pass (see pictures for location). It is made to give any player followers a place to live that isn&#39;t inside the house (things get a bit crowded). The campsite is on a sort of dock area and the stables overlook this area with a boardwalk jutting out to admire the view. Everything is well lit enough to be compatible with darker night mods or anything else that increases contrast.\r<br />\r<br />I have added a basic NPC called the Farrier who is fully voiced (through using generic dialogue) and can be recruited as a follower, although at this point he has no interesting weaponry as I didn&#39;t get that working properly. NPC&#39;s in the stables have over 15 idle positions to try and make it look active and give your followers something to do if you have an idle mod installed (I would recommend [url=http://www.nexusmods.com/skyrim/mods/18045/?]My Home is your Home[/url]﻿ because it&#39;s got no extra functions apart from what it needs). NPC&#39;s will look out over the waterfall, chop wood, eat a lot of bread, sit on fallen trees and other such stuff.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/26704/?]Convenient Horses[/url] is important as it allows you to make your herd of horses and follower mounts stay in the stable by placing the flag (seen above) into the spot in the middle of the grazing field, however the mod is not required if that is not something that interests you. I just wanted them to stop following me for 5 seconds.\r<br />\r<br />Navmeshes are fully created as NPC interaction is the core of this mod, but see my notes throughout on how temperamental they might/might not be, due to both my lack of experience and other issues.\r<br />\r<br />This mod is lore friendly to the point that all trees that were in the stables location have been replaced with stumps or fallen trunks in the same exact location so they could have realistically been chopped down.\r<br />\r<br />[color=#ff0000]Load order:[/color]\r<br />directly underneath [url=http://www.nexusmods.com/skyrim/mods/10901/?]Dragon Falls Manor[/url] ESP (if used)\r<br />above [url=http://www.nexusmods.com/skyrim/mods/26704/?]Convenient Horses[/url] (if used)\r<br />\r<br />[color=#ff0000]Known issues/compatibility:[/color]\r<br />Navmeshes are wonky to say the least, despite my best attempts. If they seem ou[size=2]tlandishly bad check to see if this mod is below DF manor in your load order. I attempted to clean these using TES5edit but this (while mostly fixing the meshes) resulted in CTDs so I reverted back.\r<br />\r<br />[/size][list][*][size=2][url=http://www.nexusmods.com/skyrim/mods/56877/?]Skysight[/url], while compatible, prevents several NPC idle spots (where followers and NPCs animate to &#34;relax&#34;) from activating.\r<br />[/size][/*]\r<br />[*][size=2]Anything else should be fully compatible as long as it doesn&#39;t alter the exact tiny spot of land that this mod uses.\r<br />[/size][/*]\r<br />[/list]\r<br />﻿[url=http://youtube.com/user/1edzeppelin][img]http://i.imgbox.com/IQLEjgJu.jpg[/img][/url]\r<br />Click the image to go to [url=http://youtube.com/user/1edzeppelin]my channel[/url]﻿\r<br />(messages will probably be replied to more quickly.)",
  "categoryId": "22",
  "version": "0.5.beta",
  "author": "1edzeppelin",
  "createdUnix": "1408642237",
  "updatedUnix": "1408640351",
  "containsAdultContent": false,
  "uploadedBy": "MrGreatVegas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123132",
      "name": "Dragon Falls Stable and Camp",
      "version": "0.5.beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "167",
      "fileName": "Dragon Falls Stable and Camp-57325-0-5-beta.rar",
      "uploadedUnix": "1408640167",
      "modVersion": "0.5.beta",
      "virusScanUrl": "https://www.virustotal.com/file/6345d5daf53f5b9c44de2c7390ecf95bb0929f5d2366b67d3bd30a1bfe629a10/analysis/1408640364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Falls%20Stable%20and%20Camp-57325-0-5-beta.rar?fid=1000123132&ttl=1535843263&ri=8192&rs=8192&setec=88e68b4dad25fed210259605710d17ba"
    },
    {
      "fileId": "1000123133",
      "name": "DFSAC TES5EDIT Cleaned Navmesh version - not recommended",
      "version": "0.55",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "122",
      "fileName": "DFSAC TES5EDIT Cleaned Navmesh version - not recommended-57325-0-55.rar",
      "uploadedUnix": "1408640351",
      "modVersion": "0.55",
      "virusScanUrl": "https://www.virustotal.com/file/3ab330ed421b4c8fc0be89b1884ee0b31c5b3b2310fb86095f1e8d4e39f26f3a/analysis/1408640553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DFSAC%20TES5EDIT%20Cleaned%20Navmesh%20version%20-%20not%20recommended-57325-0-55.rar?fid=1000123133&ttl=1535843264&ri=8192&rs=8192&setec=1dd2eb632555e6668df83f240cc9190e"
    }
  ]
}