{
  "modId": 57345.0,
  "modName": "Hrafnrokk Keep",
  "summary": "A larger player home / estate in Solstheim&#33;",
  "descriptionHtml": "Hrafnrokk (Raven Rock) Keep is a cozy castle nested north of the Skall stone by Raven Rock, a coastal bastion of the wealthy East Empire overseer that left the land to ruin over a hundred years ago. \r<br />\r<br />It is a single-cell entity, spacious and powerful with many amenities. The main hall has its dining display and throne, with a spiral staircase leading to a large fireplace and adjacent wings. The south wing holds the workshop, with alchemy and enchanting workbenches, along with weapon racks and a manikin. For aesthetics, there is also a nonfunctional shrine to Azura, and a conceptual glider hanging from the ceiling. A doorway in the south wing also leads to the Lookout Tower. The north wing holds the library and scholar&#39;s desk, with a shrine to Arkay and a map of the land. A few more nicknacks, two manikins and a crystal ball precede the Master Bedroom, holding another fireplace and wash basin. Beneath the wings hold the guard bedroom and kitchen.  The three guards of the keep maintain vigilance outside, with an anvil and wood chopping block. Limited ingredients are available outside, such as a chickens nest and nightshade, besides the natural Morrowind flora. \r<br />\r<br />I&#39;ve attempted to make an aesthetically pleasing entity once more with this small castle, using Whiterun architecture in a way that still works with the coast of Solstheim. Ruin and whatnot. \r<br />\r<br />It requires only the latest Skyrim and Dragonborn. It&#39;s possible to make it adoption friendly in the future. It is Incompatable with my previous Corvus Mill, as it&#39;s in the same plot of land. WARNING: I have used many mischelaneous items and attempted to make static meshes, such as a custom Clavicus Vile statue outside and a mirror in the master bedroom. If these things do not show in your file, let me know, and if you can please help me find a way to make that work. \r<br />\r<br />INSTALLATION: It only needs to have the main file placed in your data folder.      ",
  "categoryId": "68",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1408668288",
  "updatedUnix": "1408668233",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123178",
      "name": "Hrafnrokk Keep",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3875",
      "fileName": "Hrafnrokk Keep-57345-1-0.zip",
      "uploadedUnix": "1408668233",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f5ef2d3f2d5e191d20b0a0b707e00e0d23717d75fb84aa15ae702a7c4417584/analysis/1408668304/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hrafnrokk%20Keep-57345-1-0.zip?fid=1000123178&ttl=1535843293&ri=8192&rs=8192&setec=108e389bb9cae14b63b50f913b3e5d42"
    }
  ]
}