{
  "modId": 57351.0,
  "modName": "Dragon Master Armory - A touch of madness",
  "summary": "This is the Dragon Master Armory - A touch of madness, based on my original Dragon Master Armory mod.  It adds a teleport stone inside a small closet in the Lakeview Manor basement which teleports to a sizable, detailed hidden armory in a mountain peak near the Shrine of Azura.  The location can be used to store weapons and supplies.",
  "descriptionHtml": "This is the Dragon Master Armory - A touch of madness, based on my original Dragon Master Armory mod.  This mod contains very detailed interiors using standard vanilla assets. It adds a teleport stone inside a small closet in the Lakeview Manor basement which teleports to a sizable, detailed hidden armory in a mountain peak near the Shrine of Azura.  The location can be used to store weapons and supplies. There is also an exterior entrance to the armory which cannot be reached unless you can fly or mountain climb or cheat to get to it. It&#39;s got quite a view. Once discovered, you can fast travel to it.  This version also adds a torture room to the cellar and is themed more for evil characters (mainly vampires).\r<br />\r<br />Containers meant for storage throughout are marked &#34;(Safe)&#34;. The armory contains:\r<br />- 30 Large Display Cases (with weapon snapping)\r<br />- 12 Small Angled Display Cases (with weapon snapping)\r<br />- 15 Mannequins\r<br />- 36 Weapon Mounts\r<br />- 42 Safe Categorized Storage Containers (16 of which are for alchemy ingredients - each container is labeled)\r<br />- (Version 1.2 - 1.21) 3 additional Safe Storage Containers\r<br />\r<br />Version 1.21 Notes:\r<br />- Fixed navmesh for the door from Purification Room to Lakeview Mine \r<br />- Added navmesh to the lake in Lakeview Mine\r<br />- Tweaked navmesh around lake in Lakeview Mine for improved pathing\r<br />- Added dirt textures around the Lakeview Mine entrance (make it look more used)\r<br />- Added light armor versions & temper data of General Tullius and Ulfric Stormcloak Armors, added to misc chest in the mine (leather armor stats)\r<br />- Edited Thalmor corpse NPC to a unique character / should fall properly in cage\r<br />- Tweaked hanging skeleton arms to hang more parallel to body\r<br />- Adjusted Lakeview Mine hidden exterior door switch (behind banner) to be easier to activate\r<br />- Turned off some of the candles around the coffin\r<br />- Added double doors to the Purification Room interior\r<br />- Changed Purification Room music to &#39;Dungeon Fort&#39; (same as vanilla caves)\r<br />- Various clutter tweaks\r<br />- No storage changes\r<br />\r<br />Version 1.2 Notes:  \r<br />This version adds a mine called &#34;Lakeview Mine&#34; that I spent way to much time building - I wanted a way to access the cellar and torture room without going through the house (the mine entrance to the torture room is hidden).  Please note that this version removes the coffin in the cellar and adds a door there.  I&#39;ve got a coffin located elsewhere for sleepy vampires.  The entrance to the mine is located on the north side of the mountain east of Lakeview Manner near a bandit camp.  Again, there&#39;s a gate near the entrance to the mine which requires the armory key to unlock - this is to prevent access to the cellar before it&#39;s built.  This version does not remove any safe storage or make any major alterations from the previous version.\r<br />\r<br />\r<br />\r<br />\r<br />LOCATION:\r<br />\r<br />You&#39;ll need to build the Lakeview Manor cellar (near Falkreath) to access the armory via a teleporter - it&#39;s inside of a small closet in the torture room which is also hidden in the cellar. As mentioned in the description, there is an entrance to the actual armory near the Shrine of Azura, but it&#39;s not accessible unless you cheat to get to it (there&#39;s also a gate requiring a key to pass). I don&#39;t know what effects attempting to access the Lakeview Manor cellar before it&#39;s built via the armory will have, and I wouldn&#39;t recommend it. \r<br />\r<br />\r<br />\r<br />\r<br />COMPATIBILITY:\r<br />\r<br />This mod has been cleaned to ensure maximum compatibility with minimal edits to the core game. \r<br />\r<br />*The Hearthfire DLC is required.\r<br />\r<br />- This mod makes some small edits to the Lakeview Manor cellar, and to the top of a mountain near the Shrine of Azura - Tamriel Worldspace cells (25,15), (25,16) and (25,17). Any other mods making changes to those locations may cause a conflict.\r<br />\r<br />- Also see version 1.2 notes above.\r<br />\r<br />\r<br />\r<br />\r<br />INSTALLATION:\r<br />\r<br />For new installs, copy the &#34;Data&#34; folder to your &#34;Data&#34; folder and activate the esp, or feel free to use NMM (recommended). \r<br />\r<br />If upgrading from the vanilla version of Dragon Master Armory, I recommend using a clean save, again preferably before the Lakeview Manor is built and furnished. However, most all of the storage containers, mannequins and weapon mounts are largely unchanged from the original version (The only exception being that I moved the ingredient storage containers into the torture room).\r<br />\r<br />\r<br />\r<br />\r<br />PERMISSIONS:\r<br />\r<br />You can do whatever you want with this mod. Just, please give me any due credit.\r<br />\r<br />\r<br />\r<br />\r<br />NOTES:\r<br />\r<br />- There is a gate requiring a key near the exterior of the armory. This is done on purpose, to prevent prematurely entering the Lakeview Manor cellar prior to it being built. The key is located on top of the small closet containing the teleport stone (it&#39;s not hidden) within the torture room.\r<br />\r<br />- The torture room and the armory itself come pre-furnished.  Happy birthday.\r<br />\r<br />- I would recommend running this mod in a game where you have not already built and furnished the Lakeview Manor cellar. If you have, there may be some persistent references in your save game causing items to partially block the door. They can be disabled (using the &#34;disable&#34; command on the reference in the console), but that will permanently eliminate the furnishing in your save game even if this mod is later deactivated.\r<br />\r<br />- The weapon snapping feature of the display cases is accomplished using hidden weapon mounts, which does have a few oddities. Maces sink into the display case a bit, and magical staffs don&#39;t quite fit completely into the case. Additionally, the display cases are not meant for non-weapon items... attempting to store things manually in the display case could potentially cause some issues with the weapon snapping and therefore I wouldn&#39;t recommend it.\r<br />\r<br />\r<br />\r<br />You can view or download the original, alignment neutral Dragon Master Armory here:\r<br />http://www.nexusmods.com/skyrim/mods/56227\r<br />\r<br />If you like this mod but you&#39;re looking for something a little (a lot maybe?) bigger, check out my mod RENDSPIRE PALACE.\r<br />http://skyrim.nexusmods.com/mods/23134\r<br />\r<br />Also, check out my edits to the Honeyside home in Riften:\r<br />http://skyrim.nexusmods.com/mods/20959",
  "categoryId": "67",
  "version": "1.21",
  "author": "Shoeski11",
  "createdUnix": "1408672435",
  "updatedUnix": "1409421579",
  "containsAdultContent": false,
  "uploadedBy": "Shoeski11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123196",
      "name": "Dragon Master Armory - A touch of madness",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "163",
      "fileName": "Dragon Master Armory - A touch of madness-57351-1-0.zip",
      "uploadedUnix": "1408672431",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/35b181f667ea97c93836ade447afe6c9f5bee85110aab68e68fd542776b8b244/analysis/1408672504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Master%20Armory%20-%20A%20touch%20of%20madness-57351-1-0.zip?fid=1000123196&ttl=1535843299&ri=8192&rs=8192&setec=b7e61eeed9230c01c1b9539541b7fd45"
    },
    {
      "fileId": "1000124261",
      "name": "Dragon Master Armory - A touch of madness",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "278",
      "fileName": "Dragon Master Armory - A touch of madness-57351-1-2.zip",
      "uploadedUnix": "1409213379",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/52db0daf1d04146ac03681385b46e4418a01aadbe1271c9e33234f0e89fd186a/analysis/1409213463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Master%20Armory%20-%20A%20touch%20of%20madness-57351-1-2.zip?fid=1000124261&ttl=1535843299&ri=8192&rs=8192&setec=6644a25180667726e2dc1e923123111b"
    },
    {
      "fileId": "1000124581",
      "name": "Dragon Master Armory - A touch of madness",
      "version": "1.21",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "283",
      "fileName": "Dragon Master Armory - A touch of madness-57351-1-21.zip",
      "uploadedUnix": "1409421579",
      "modVersion": "1.21",
      "virusScanUrl": "https://www.virustotal.com/file/0dc9a6e51469b93e13cd1d13cb019f6ce4e829d4b41be8ea63600c59b88a73d2/analysis/1409421663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Master%20Armory%20-%20A%20touch%20of%20madness-57351-1-21.zip?fid=1000124581&ttl=1535843299&ri=8192&rs=8192&setec=7e25dd5c5545c054b917e3c80421d651"
    }
  ]
}