{
  "modId": 57352.0,
  "modName": "New Follower - The Rabbit of Caerbannog",
  "summary": "That&#39;s no ordinary rabbit&#33; That rabbits got a vicious streak a mile wide it&#39;s a killer&#33; It&#39;s do you at a treat mate&#33; Hes got huge sharp... He can leap about....&#33;",
  "descriptionHtml": "[center]Alright so I decided to release him by himself\r<br />Currently have a script done and am working on getting him in Discworld before the alpha.\r<br />In Discworld BunBun is the sole surviving son of the late Rabbit of Caerbannog, he watched his Father mother and 37 brothers and sisters die to that nasty holy hand grenade attack brought forth by the evil Sir Arthur and the mythic dawn order of the round. He has been hunting for years and now he has picked up a trail, on a small island, that sits on the back of 4 mighty mammoths, who stand on the back of the great sea mudcrab A&#39;tuin.\r<br />Revenge will soon be at hand.\r<br />\r<br />Demo Video\r<br />[youtube]yGMfDTT-OPc[/youtube]\r<br />\r<br />\r<br />As usual Discworld Trailers\r<br />[youtube]FEBNe8XINd0[/youtube]\r<br />\r<br />[youtube]aPzA_6RBWcg[/youtube][/center]\r<br />\r<br />Installation\r<br />The zip file contains 1 BSA and 1 ESP, drop them in your data folder, cause this is like 2011 and stuff so people might not know O.o\r<br />\r<br />\r<br />\r<br />Mod adds a new companion behind Honningbrew Meadery\r<br />BunBun requires 50 carrots to join you\r<br />BunBun is invincible\r<br />BunBun will use 4 different abilities randomly in combat\r<br />Maggic Carrots - 3 waves of 3 carrots fired at his target Magic Missile style\r<br />Ravage - BunBun leaps at his target and ravages them biting and clawing them asunder while freezing their movement\r<br />Holy Hand Grenade - He throws a friggin Holy hand grenade, nough said\r<br />Carrotstorm - He leaps into the air with whirling carrots that fly out and smack random people\r<br />BunBun will follow you around, inside, outside etc. Sometimes he will run form combat if there is a door nearby, maybe he gets scared idk, it&#39;s pretty rare.\r<br />If BunBun ever disappears for too long just zone or wait 1 hour, rarely after combat or zoning during combat he can get stuck in his invis stage while a attack spell is playing out\r<br />\r<br />\r<br />HD white rabbit texture by chocolambot",
  "categoryId": "66",
  "version": "1.0",
  "author": "darren83",
  "createdUnix": "1408680486",
  "updatedUnix": "1408680108",
  "containsAdultContent": false,
  "uploadedBy": "Darren83",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123203",
      "name": "BunBun1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "505",
      "fileName": "BunBun1-57352-1-0.7z",
      "uploadedUnix": "1408680108",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/55c77f4b8c13afc342180f334177236170583969b36913a468bfcc3224db3ac1/analysis/1408680183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BunBun1-57352-1-0.7z?fid=1000123203&ttl=1535843301&ri=8192&rs=8192&setec=66d2646f96854c960424f9dced95fafc"
    }
  ]
}