{
  "modId": 57362.0,
  "modName": "Dovakiin Follower Pack-Dragon Followers",
  "summary": "Adds three new dragon-related followers to Skyrim.",
  "descriptionHtml": "[font=Arial, Helvetica, Verdana, sans-serif][color=#f4f4f4]This mod adds four new followers so far. Read the back stories down below for more info.(I highly recommend you do&#33; :) [/color][/font]\r<br />\r<br />The Dragon Warrior: \r<br />[color=#f4f4f4][font=Arial, Helvetica, Verdana, sans-serif]Bert is a ferocious level 50 Nordic warrior. He grew up in the forest around Falkreath, and used to spend his days dungeon hunting with his father. When he was about 16, his father was killed by some stupid draugr and their stupid shouts. He slew them all and took their armour and stole their weapons. Then he decided to go and learn how to use his voice to shout, and become a true Nord. He has spent the last 30 years of his life honing his skill and trying to learn FUS...RO...DA. He has finally mastered it, but got pissed when the greybeards sent him to go and find the stupid horn. So he left and has been travelling skyrim ever since, shouting at all the guards because he really doesn&#39;t give a damn about their sweet-rolls and stories of arrows in the knee. He ended up back in Falkreath, and hopes to have the honour of guarding the dragonborn throughout his travels. He can be found in the Jarls Long house in Falkreath. [/font]\r<br />[/color]\r<br />The Dragon Hunter: \r<br />[font=Arial, Helvetica, Verdana, sans-serif][color=#f4f4f4]Ragnar is a highly talented level 60 nord warrior from ol&#39; Rorikstead. After his parents died in a bandit raid, he lived with his uncle and helped out around the farm. His uncle was a miner, but he gave Ragnar a little bit of weapons practice from the skills he learnt when he was in the army. One day, Ragnar witnessed a dragon swoop down from the sky and obliterate his old man. Overcome with a ferocious unstoppable rage, ragnar attacked the dragon and utterly demolished, crushed, destroyed and annihilated that poor beast. He then smashed it to little pieces and turned its bones into armour, which he wears until this day. He spent The next few years as a wondering warrior, until the blades completed his training for him. Now he wonders Skyrim as an elite dragon slayer, and wishes to help the Dovakiin take down Alduin and end this war for once and for all&#33; He can be found in Rorikstead. [/color][/font]\r<br />\r<br />The Dragon Whisperer: \r<br />[color=#f4f4f4]Hadrif was a greybeard of High-Hrothgar, even though his beard was not grey, until Arngeir accidentally shouted him of the mountain. He landed on his head and realised that the greybeards were a bunch of stupid assholes. He then wondered Tamriel growing stronger and learning more magic and shouts until, seeking revenge, he returned to Ivarstead. There he noticed a dragon attacking the town. The greybeards did nothing about it. He decided to kill the dragon himself, but during the fight, he met the dragonborn. Since the greybeards were not helping him, Hadrif decided to take the matter into his own hands, and help the Dovakiin. Screw the greybeards, he thought. He can be found in the Vilemyr Inn in Ivarstead. \r<br />[/color]\r<br />The Dragon Rogue: \r<br />[font=Arial, Helvetica, Verdana, sans-serif][color=#f4f4f4]Anna grew up in a wealthy part of Cyrodiil as daughter to a Wealthy Imperial Merchant and advisor to the emperor. Her mother was a Nord and served as the Imperial Battlemage and her father used to be a general in the legion before he retired. Because of this, Anna learned combat skills in both magic and weapons from a very early age. When the war broke out, her mother and father were sent of to fight in the legion, while she used her skills as a healer. Her mother and father were killed in a Stormcloak ambush. She left the army after this, and patrolled Skyrim looking for Stormcloaks to slaughter. While she was exploring, she befriended a young baby dragon. But unfortunately, he was killed in a Stormcloak Raid by Ulfric Stormcloak Himself. The last thing the baby dragon did was teach her Unrelenting Force, so she could kill Stormcloaks better, and tell her to protect herself with armour made from his hide. She now serves as bodyguard to the high king and can be found in the Blue Palace in Solitude. [/color][/font]\r<br />\r<br />Please like and favourite my mod. Also, give any ideas you have about more dragon-related followers, and upload any pictures of them being awesome. \r<br />\r<br />Bugs/Issues: \r<br />None. \r<br />\r<br />Compatible/Incompatible: \r<br />Must be loaded after ultimate follower overhaul.",
  "categoryId": "96",
  "version": "1.0",
  "author": "DireWolf12345",
  "createdUnix": "1408709597",
  "updatedUnix": "1408711710",
  "containsAdultContent": false,
  "uploadedBy": "DireWolf12345",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123245",
      "name": "Dovakiin Follower Pack-Dragon Followers",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Dovakiin Follower Pack-Dragon Followers-57362-1-0.zip",
      "uploadedUnix": "1408709593",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/082a74e7e24e8ff0027fbec74d4a33a7a8f4925a82c832f4b32446e04d219aa8/analysis/1408709881/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovakiin%20Follower%20Pack-Dragon%20Followers-57362-1-0.zip?fid=1000123245&ttl=1535843315&ri=8192&rs=8192&setec=125aeb1331c73b1d7cd9d24857d06844"
    },
    {
      "fileId": "1000123250",
      "name": "Dovakiin Follower Pack-Dragon Followers ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Dovakiin Follower Pack-Dragon Followers -57362-1-1.zip",
      "uploadedUnix": "1408711710",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/480c620b4dee9c5fe8fbb2a96cc06547b4ff5d7133b07afac1aaa5b9b7f96465/analysis/1408711862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovakiin%20Follower%20Pack-Dragon%20Followers%20-57362-1-1.zip?fid=1000123250&ttl=1535843315&ri=8192&rs=8192&setec=61ebbbf28a5bf63cdc5962d976ea3b40"
    }
  ]
}