{
  "modId": 5736.0,
  "modName": "SIB Skyrim Immersive Battles Script v1_1",
  "summary": "Lore friendly BAT files for spawning Factions through the console",
  "descriptionHtml": "SKYRIM IMMERSIVE BAT BATTLES (SIB Battles) VERSION 1.1\r\n\r\nThis is SIB Battles, an immersive BAT file Mod in development.\r\n\r\nThe goal of this mod is simple: to create a series of BAT files that spawn NPCs from various factions found within Skyrim which balances the compromise between the following factors: efficiency (CPU), Lore (spawn count and spawn logic), Immersion (spawn quality) and AI vs AI Balance (gameplay). \r\n\r\nAs such, this mod is not stand-alone and works best with AI altering mods such as PISE by Pluto (www.skyrimnexus.com/downloads/file.php?id=1269) and/or other mods which modifies the strengths/weaknesses of NPCs of your preference, though I recommend PISE since that is the mod I use in tweaking/playtesting the bat files.\r\n\r\nThere is also three different BAT configurations to choose from, starting from the recommended 15v15 configuration (low-end pc), 30v30 configuration (med/high end pc) and the 60v60 configuration for those who have insanely powerful PCs or for people who have already tried to spawn ridiculous amounts of NPCs and still has Skyrim running \\\"smoothly\\\".\r\n\r\nA more detailed explanation of this mod can be found in the README text included in the file. \r\n\r\nRequirements\r\n\r\n- A working latest version of Skyrim\r\n- PISE or any AI altering Mod\r\n- A combat overhaul such as Duel by Gabriel Mailhot (www.skyrimnexus.com/downloads/file.php?id=2700)that affects both PC and NPC combat.\r\n- Some sort of \\\"despawning\\\" mod such as Corepc\\'s mod (www.skyrimnexus.com/downloads/file.php?id=3084)\r\n- ClassicalNoodles\\' Heavy Stormcloak Officer Armor (www.skyrimnexus.com/downloads/file.php?id=2774\r\n- a very good imagination and creativity (because town wars are fun).\r\n\r\nChangelog\r\n\r\n1.1\r\n\r\nThe Empire\r\n- Increased Imperial Soldiers from 6 to 9\r\n- Merged melee \\\"specialists\\\" into the Imperial Soldier units\r\n- Reduced Archers from 6 to 3\r\n- Increased Imperial Mage from 1 to 2\r\n- The Imperial Soldiers now properly use shields\r\n\r\nThe Stormcloak Rebellion\r\n- Increased Stormcloak Soldiers from 9 to 11\r\n- Merged melee \\\"specialists\\\" into the Stormcloak Soldier units\r\n- Reduced Stormcloak Archers from 4 to 2\r\n- Stormcloak Soldiers spawns now correctly randomize between gender, weapon of choice but still maintains a dominantly two-hander tradition in variety.\r\n- Stormcloak Field Commander\\'s Outfit upgraded to Heavy Armor (thanks to ClassicalNoodle)\r\n\r\nThe Aldemeri Dominion\r\n- Replaced Thalmor Wizards to Thalmor Justicars (mage) due to bad AI scripts\r\n- Reduced Thalmor Justicar (non-magic) from 4 to 1\r\n- Increased Thalmor Justicar (mage) from 0 to 4\r\n- Reduced overall Aldemeri Dominion forces max unit count from 15 to 10\r\n\r\nThe Forsworn\r\n- Temporarily removed The Forsworn Faction for future testing; general changes listed below\r\n- Removed Forsworn Briarheart in the 15v15 configuration, reduced to 1 in the 30v30 configuration and 2 in the 60v60 configuration\r\n- Removed Forsworn mages in the 15v15 configuration, reduced to 2 in the 30v30 configuration and 4 in the 60v60 configuration\r\n- Replaced most caster Forsworn into generic melee/ranged fighters\r\n- Reduced Forsworn Archers from 3 to 2\r\n- Added Forsworn Ravager \\\"Berserkers\\\"\r\n\r\nThe Housecarls of Whiterun (NEW)\r\n- Added The Whiterun Housecarls Faction\r\n- Spawns 4 Whiterun Guards friendly to the player\r\n- Patrols Skyrim when out of combat randomly using the roads\r\n\r\nInstallation and how to use\r\n\r\nChoose and extract desired BAT configuration into your Data folder. Choose only 1 or rename the bat txt file if you wish to have more control or options.\r\n\r\nIn the game, open the console (`) and type \\\"bat\\\" followed by the faction you want to spawn (example typing \\\"bat empire\\\" without the quatation marks will summon an imperial squad).\r\n\r\nCompatibility\r\n\r\nSIB is compatible to all kinds of mods and scripts even to other BAT files you have already downloaded or are currently using in your Skyrim game. \r\n\r\n[FD] Future Updates\r\n\r\nGeneral\r\n- Transition from a BAT txt file to either an .asi or .esp through modding tools for more options such as AI equipment/spell selection.\r\n- custom NPCs for Factions such as the housecarls.\r\n- General AI versus AI Balance through use of third party mods and repackage with permission as a single download pack. \r\n- Better Spell Selection for caster mobs fit to the lore and theme of each faction.\r\n- Dynamic AI handling to increase AI activity during big-spawns.\r\n- Compatibility after transition to other mods.\r\n\r\nThe Empire\r\n- Better Archers. They got weaker stats than the soldiers, which uses guard stats.\r\n- Improvements to Spell Selection for Imperial Mages; must include heal-other capabilities instead of more offensive punch.\r\n\r\nThe Stormcloaks\r\n- Activate the Nord Racial Abilities for all Nords\r\n- Improvements to spell selection for Stormcloak mages; must include more offensive punch.\r\n\r\nThe Aldemeri Dominion\r\n- Better spell selection for all Aldemeri Dominion forces. They need more power.\r\n\r\nThe Housecarls of Whiterun\r\n- A working Irileth/Lydia/Random Captain stand-in when spawned that would not conflict with the original/radiant AI.\r\n- More player control for the whiterun guards spawn.\r\n\r\n[BUG] Bug, fixes and other oddities\r\n\r\n- Skyrim will crash if you spawn too many NPCs at once or got too much corpses. This is a game-limitation which partly is influenced by your CPU. Also spawning too many NPCS would render most NPCs \\\"inactive\\\" until attacked.\r\n\r\n- I recommend you use the 15v15 version since its designed for low-end pcs. Its not epic compared to the 30v30 and the 60v60 but you can use the 15v15 to stress test your CPU before using the more stressful versions of the mod.\r\n\r\n- lower your graphic settings if you wish to use the 30v30 and especially the 60v60 version for maximum CPU performance. ON my friend\\'s PC who has a quad-core CPU, the NPCs spawned were active up until the 50th spawn mark, after which the succedding NPC spawns were inactive and would only react upon attack. Reducing the CPU load might help the game AI and thus more interesting battles.\r\n\r\n- You can edit the BAT files to your liking, I only tailored it as such so that you can see for yourself how your PC can handle multiple NPCs spawning and interacting with each other by batches.\r\n\r\n- The Stormcloak and Imperial soldiers will sometimes use the lines used by the guards in Markath and Solitude. This is intended because I used their IDs instead of the usual stormcloak/imperial soldier ID due to their better stats and AI handling.\r\n\r\n- The Stormcloak and Imperial Soldiers may register as guards and may wear their corresponding city colors (markath and solitude). I am checking my texture mods to see if I installed an immersion package that changed their colors.\r\n\r\n[UNI]\r\nSimply delete the text files associated with this mod.\r\n\r\nContacts and about the author\r\n\r\nI am miniminionette, who recently registered in skyrim nexus after searching google for a low-res mod to help my low-end pc play skyrim (dual core 3.3 ghz 4 gig ram 32 bit win 7 NVIDIA 9500gt) and eversince had me hooked up in downloading mods that I am far more enjoying skyrim playing over and over random characters from 1 - 10 and not caring if I was not able to finish the game on my 400 hours mark.\r\n\r\nFor suggestions, harsh criticisms and other comments please do so in the discussion panel; I am always online at least everyday for 3 hours checking the nexus community for new/updated mods that I can use to make my skyrim look and perform better.\r\n\r\n\r\n\r\n",
  "categoryId": "28",
  "version": "1.1",
  "author": "miniminionette",
  "createdUnix": "1326084201",
  "updatedUnix": "1326166295",
  "containsAdultContent": false,
  "uploadedBy": "miniminionette",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18425",
      "name": "15v15 configuration",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "15v15 configuration-5736-1-1.rar",
      "uploadedUnix": "1326166146",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/961351d6b7b93bcfff71a4a6817b9adc0c01064b709fdeb607028b3304e9fae2/analysis/1406598604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/15v15%20configuration-5736-1-1.rar?fid=18425&ttl=1535762698&ri=8192&rs=8192&setec=86d8940d709fa010c533cc5a992c132f"
    },
    {
      "fileId": "18427",
      "name": "30v30 configuration",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "30v30 configuration-5736-1-1.rar",
      "uploadedUnix": "1326166188",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/8db9d3902f79fabbfca572a56cd1607115a729c876a55b248ec2731c05bbc7d8/analysis/1406598604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/30v30%20configuration-5736-1-1.rar?fid=18427&ttl=1535762698&ri=8192&rs=8192&setec=4f4d399080e0cb505e321f7a97ca850e"
    },
    {
      "fileId": "18428",
      "name": "60v60 configuration",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "60v60 configuration-5736-1-1.rar",
      "uploadedUnix": "1326166295",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/578975f0256d6bd959e5760af48da19ccd84416a376929f3a7b841c56468c713/analysis/1406598605/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/60v60%20configuration-5736-1-1.rar?fid=18428&ttl=1535762699&ri=8192&rs=8192&setec=2db5dc753e4f7c410357d28e415cc446"
    }
  ]
}