{
  "modId": 57374.0,
  "modName": "Groot - A Fully-Voiced Guardians of the Galaxy Based Follower",
  "summary": "A follower based upon Groot from Guardians of the Galaxy",
  "descriptionHtml": "[center][b][u]UPDATE (13TH DECEMBER 2014)[/u][/b]\r<br />\r<br />Since I&#39;ve been asked a number of times, and I now have 5 weeks holidays to be bored for, I&#39;m going to give improving this mod a go. However, as I&#39;ve stated, I&#39;m a newbie to modding, and really have no experience with this, so as it stands, I doubt I&#39;ll be able to do much. Googling for guides only gets me so far. I should know - I&#39;ve tried.\r<br />\r<br />So... below is a list of things I&#39;d like to add to the mod. If anyone can suggest any decent guides or offer help in actually getting any of it done, it would be much appreciated, and help towards improving this mod :) Also, any suggestions on how to improve the mod would be helpful.\r<br />\r<br />\r<br />Possible improvements (as of 13th December) :\r<br />New Model (Could do with someone who&#39;s capable of making a proper model for it, but need most importantly guide on how to add custom models to Groot)\r<br />Quests for recruiting (Don&#39;t know much about quest modding, so need guide to those)\r<br />Possible expanded speech (I can do the basics, but could do with guide to understanding deeper elements of it)\r<br />Quests for Groot (Sort of mixes the above. Would need knowledge on quests and expanded speech to achieve this, as well as sensible rewards)\r<br />\r<br />\r<br />Please do leave comments in comments section :)[/center]\r<br />\r<br />\r<br />One of the Guardians of the Galaxy, Groot is exactly what he looks like - a giant talking tree with a three-word vocabulary. Understanding what he says is nigh on impossible, but he&#39;s still a loyal companion :) And now he&#39;s come to Skyrim.\r<br />\r<br />Created using a Spriggan model, this companion - found in the Eldergleam Sanctuary (idk, it just seemed suitable :D) - can follow you around, carry your junk and fight for you with lightning spells (best I could find for him...) and heal you and himself both.\r<br />\r<br />Sorry he&#39;s a bit basic and his vocabulary consists of various versions of the same line :) I&#39;m a newbie to modding, and his vocabulary is basic for a reason :) See below for longer description.\r<br />\r<br />\r<br />\r<br />\r<br />Originally I was just doing this as an idle laugh. Originally was just going to make a Spriggan, call it Groot, and be done with it.\r<br />\r<br />But at the insistance of my younger brother, I started to flesh it out a bit. Created a combat style, added custom voice lines... all that. I&#39;m a complete novice at modding - I&#39;ve never tried it before in my life - so I had to follow a guide for most of it. And I don&#39;t know how well it&#39;ll work overall.\r<br />\r<br />However, since I saw some people requesting a Groot follower on a couple of sites, I thought I&#39;d upload it, since as far as I can tell there isn&#39;t one out there. This mod is pretty lame, in my opinion, but I guess it&#39;s better than nothing for some people :)\r<br />\r<br />Honestly, there&#39;s a lot I&#39;d have liked to do with this mod. I&#39;m a writer, so I have the ideas - but I simply don&#39;t have the ability. I can&#39;t do texturing, so can&#39;t create a custom mesh for him. I&#39;ve got no clue how to do advanced speech and quests, so can&#39;t add any of that. I&#39;d love to, but it&#39;s simply beyond my ability at the present.\r<br />\r<br />Still, all that aside, I hope people at least find this amusing :) And if anyone thinks they could help with advancing him and wouldn&#39;t mind, then feel free to message me :) I can come up with ideas for quests, conversation and all that, but I can&#39;t do the meshing or scripting to bring it all to life.\r<br />\r<br />Also, if there&#39;s enough interest in me doing so, I may go through his voice lines and add translations of his various versions of &#39;I am Groot&#39; :) But I&#39;m not going to go to that effort without reason. Sorry &gt;.&gt;\r<br />\r<br />If anyone has any ideas for improvment, would like to know :) And would like to know if people enjoy the mod, too. Not expecting endoresments - not good enough for that, I know - but would still like to hear if anyone is happy with it :)\r<br />\r<br />\r<br />\r<br />\r<br />A few notes...\r<br />This is not meant as any infringement of copyright to Marvel or any other company or person. If this is an issue from any company, contact me, and if you have a good point I&#39;ll happily take this down and apologize.\r<br />Also, if anyone intends to edit this (no idea why anyone would want to edit a mod like this, but still), please message me for permission before reposting anything.\r<br />This shouldn&#39;t intefere with most mods, but I can&#39;t promise that. There&#39;s a lot of mods which do a lot of different things, and I&#39;m not taking any blame for any inteference from existing mods.\r<br />This shouldn&#39;t be particularly non-lore friendly. He doesn&#39;t do much but follow you and say &#39;I am Groot&#39;. But if he isn&#39;t, sorry.",
  "categoryId": "66",
  "version": "1.0",
  "author": "Braeken",
  "createdUnix": "1408740826",
  "updatedUnix": "1408740803",
  "containsAdultContent": false,
  "uploadedBy": "Braeken",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123302",
      "name": "Groot Follower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10374",
      "fileName": "Groot Follower-57374-1-0.zip",
      "uploadedUnix": "1408740803",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/017b6643a9b72eb4b7228b5116fbf308a61bed441eee5b32177895be892fe37a/analysis/1408740913/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Groot%20Follower-57374-1-0.zip?fid=1000123302&ttl=1535843332&ri=8192&rs=8192&setec=76bdfa8f5787c8cdc90308abc8a86c52"
    }
  ]
}