{
  "modId": 5737.0,
  "modName": "Caliente&#39;s Texture Blender",
  "summary": "A custom written Windows application that attempts to simplify the task of applying texture modifications to Skyrim&#39;s textures.  Designed for flexibility and ease of use.  Please read the included readme file and try the Examples to learn how to use.  Also includes c++ source code released under MIT license.",
  "descriptionHtml": "[center][img]http://i.imgur.com/RTMWP.png[/img][color=#3CB371]\r<br />The universal texture blender for The Elder Scrolls V: Skyrim.[/color][/center][color=#3CB371]\r<br />\r<br />[u]Contents[/u]\r<br />Description\r<br />Installation\r<br />Blending Files\r<br />Examples\r<br />Hints\r<br />FAQ\r<br />Adding Custom Files\r<br />Source Code\r<br />Library Usage and Licenses\r<br />Version History[/color]\r<br />\r<br />[img]http://i.imgur.com/8DlXj.png[/img]\r<br />This is a small tool designed to simplify the process of applying modifications to existing texture maps for use in games. With only a few clicks, you can quickly apply a tattoo to your character&#39;s body, change the details on your favorite set of armor, or blend away an ugly texture seam between joined meshes. Please note modifications such as these require separate texture file packages to be installed.\r<br />\r<br />Caliente&#39;s Texture Blender (TexBlend) is easily expandable by a user or by content authors who wish to provide a simple interface for providing options for their work. A simple definition format (detailed later) allows nearly any sort of texture to be modified, and a clear file organization method allows each user to build a library of modifications that can be mix-and-matched at will. \r<br />\r<br />TexBlend is a C++ application written for Windows XP and above, requires no additional software to perform it&#39;s duties, and comes with complete source code that you&#39;re allowed to view and modify as you wish. The image manipulation is done with a modified version of the Developer&#39;s Image Library (DevIL), and supports a very large array of input and output file formats.\r<br />\r<br />[color=#3cb371]Why use Caliente&#39;s Texture Blender?[/color]\r<br />TexBlend allows you to apply desired texture changes without having to download or use a more full featured image editing tool. The various tasks of correctly loading files, matching sizes, and saving the files in the right place are automatically taken care of. It also allows you to work with the files in a manner that reduces the tedium of keeping track of numerous files.\r<br />\r<br />[color=#3cd371]TexBlend Mods[/color]\r<br />[url=http://skyrim.nexusmods.com/mods/24394]Body Imperfect by BetterBecause[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/37261]Body Designs by Jeir\r<br />[/url][url=http://skyrim.nexusmods.com/mods/27352]Body Options by SvarogNL[/url][url=http://skyrim.nexusmods.com/mods/37261]\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/16731/]Fitness Body by SvarogNL[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/30759]UNP Texture Blender[/url]\r<br />\r<br />[img]http://i.imgur.com/0eJX3.png[/img]\r<br />Installing TexBlend is a simple matter of extracting the program archive to a location on your hard drive. From there, simply execute TexBlend.exe to use the program.TexBlend comes with a small set of texture files (mainly for use with my Skyrim Female Body Mod), but be on the lookout for additional texture packages, from me or others, intended for use with the program. See the section on adding custom files below to understand how these texture files should be stored. For the most part, additional texture packs should be installed by extracting them to the TexBlend installation folder, but be sure to check the packages for any special instructions.\r<br />\r<br />To make things easier, you could also make a CalienteTools/TexBlend folder inside your Skyrim/Data folder to place the TexBlend files. If you are a user of CBBE, and use BodySlide, then the CalienteTools folder should already exist, so you just need to make a TexBlend one.\r<br />\r<br />[img]http://i.imgur.com/MePHh.png[/img]\r<br />Using TexBlend is essentially a matter of choosing a source image and a modification image, and having the tool superimpose the latter on the former. Before using TexBlend, it is recommended that you ensure that you have available backups of all files in your skyrim/data/textures folder.\r<br />\r<br />First, you must choose a &#34;texture set&#34; to work with. This is conceptually a grouping of texture files (ie, color map, normal map, specular map, etc.) and associated variants (eg character race variants for a face texture). The topmost left selection box labled &#34;Set:&#34; will enable you to make this selection.\r<br />\r<br />Next, you will need to choose which &#39;Type&#39; to work with fron the selection labeled &#34;Type&#34;. The types correspond to the texture channels used by models in a game to display various effects. Typically, the types are: Color for the actual color of the object Normal for the information that allows the object to interact with light (eg, shadows and small bump details) Specular for the shinyness of the surface. Other channels are possible, including Glow, Skin, Environment, etc.\r<br />\r<br />Third, you will select the variant to modify from the list beneath the Type selection. In many cases, this list will have only one available selection, such as &#39;Female&#39; when modifying the body/color set included with TexBlend. Other times this list will contain the names of potential variants, such as the race variants when viewing the included Head/Normal set. You can think of this list as the list of variants that will be modified by the blending operation. Normally, all available variants for the texture set are selected -- simply uncheck any that you wish to avoid updating when applying the modification. In most cases you will leave all items selected.\r<br />\r<br />Fourth, you will choose the source file itself that you wish to modify. This appears in the tree in the bottom left of the application window. By default, TexBlend will pull source textures from the ones currently installed with your game. The checkbox in the lowest left of the window labled &#34;Use Currently Installed Textures&#34; allows you to change this behavior. \r<br />NOTE: only textures in the Skyrim/Data folder are available; TexBlend does not extract images from the skyrim .BSA files. If you wish to modify vanilla textures, please extract them first.If you uncheck the use currently installed textures option, the tree view of available source textures becomes usable. This list is filtered by the texture set and channel to only show appropriate choices, and the files themselves are the ones located in the TexBlendSource subdirectories. You can double click a file in this list to show a preview of the image.\r<br />\r<br />Finally, you will choose what modification to apply over the source texture. To do this, select an available file from the tree view in the center column of the application. This list is filtered to only show options that are appropriate for the current texture set and channel, and the files themselves are located in the TexBlendLibrary subdirectories. You can double click a file in this list to show a preview of the image.\r<br />\r<br />Once your selections are complete, you can click the preview button (lower right of the window) to get a view of the source,modification,and destination image. Double click on the preview boxes to get a larger view. \r<br />\r<br />When satisfied with your choices, click the Blend Texture button to generate the modfied textures and save them to disk. Normally the source, destination, and final images are saved in memory after you click preview or blend. A second press of the blend button will simply re-save the same image to the disk. If you wish, you can Control+Click on the blend texture button to force TexBlend to reload the source and modification files and regenerate the final image. This can allow you to re-apply the same modification more than once (as long as &#39;use currently installed textures is ON). In the case of partially tranpsarent modifications, this will cause successively darker applications of the same image. \r<br />\r<br />If you have multiple variants selected in the variant list, the blend operation will attempt to modify all of those files with the modification image. If the &#39;use currently installed textures&#39; option is ON, each variant source will be loaded and modifed individually. If the &#39;use currently installed textures&#39; option is OFF, the single source file and single modification file you have selected will be saved to ALL selected variants. To avoid this, deselect all but one variant.\r<br />\r<br />[img]http://i.imgur.com/cZD64.png[/img]\r<br />[url=http://staticdelivery.nexusmods.com/mods/110/images/5737-1-1370806761.png]How to Use TexBlend - Fixing Neck Seams Part 1[/url]\r<br />[url=http://staticdelivery.nexusmods.com/mods/110/images/5737-2-1370806763.png]How to Use TexBlend - Fixing Neck Seams Part 2[/url]\r<br />\r<br />[img]http://i.imgur.com/jrhU7.png[/img]\r<br />- Double click a file in the source list or library view to load it into a preview window, then double click the preview window to see a larger view.\r<br />- To overwrite just one thing (such as a single race&#39;s head normal), deselect all other options in the list. At least one must be selected for anything to work, however. \r<br />- Copy your favorite textures from either a mod directory or the Skyrim data directory to TexBlend&#39;s Source folder to keep an inventory of textures that you can easily swap in and out. See the section on Folder Structure in the Readme for details on what should go where. \r<br />- You can apply multiple mods to a single texture by selecting different mods one by one and Control+Clicking Blend Images button to add them together. Warning, doing this with a compressed DDS file output might reduce the final quality. (since the compression tends to loose a little each time its saved). Note, if you don&#39;t Ctl+Click on the Blend button, and you don&#39;t change the source (or toggle use currently installed textures), you&#39;ll simply replace the modified texture.\r<br />- Similar to above, if you have a translucent mod image (like body hair or a tatoo) you can Ctrl+Click blend repeatedly with the same texture mod selected, and successively darken the result.\r<br />\r<br />[img]http://i.imgur.com/O40vT.png[/img]\r<br />[color=#3CB371]Q1: After using TexBlend, my character&#39;s face has large white/shiny blocky areas. How do I fix this?[/color]\r<br />A1: Disable compression in the texblend/setdefs/basehead.xml file. Look for the female head specular map and set &lt;compresstex&gt; from 1 to 0. (it&#39;s on line 35). Then reinstall the mod&#39;s head textures, and reapply texblend.\r<br />A2: Go to your Skyrim/Data/Textures/actors/character/female folder and delete femalehead_s.dds. It&#39;s not ideal, but it should fix the issue. The femalehead_s.dds is the &#39;specular map&#39;, which controls how shiny or dull a face texture is. For a very small number of people, using TexBlend causes it to become buggy.\r<br />A3: Usually this occurs with Bella&#39;s face texture #3. One user has said installing the &#39;no shine&#39; option from that mod fixes it.\r<br />\r<br />[color=#3CB371]Q2: The face is so much darker than the body. How do I fix this?[/color]\r<br />A1: If the issue is with npcs, then you have changed their appearance in some way, such as by changing the hairstyle, or removing warpaint, will cause this bug. For a fix, go to the Apachii SkyHair mod, and follow the instructions in the description.\r<br />A2: If the issue is with your player character, then it&#39;s a more serious fault with no known cause, and there are no definitive fixes for it. One user has found that their video card kept default back to application settings, so be sure to check that to see if it&#39;s doing the same.\r<br />A3: You&#39;re using a face mod with dirty skin, or the vanilla face textures. As most body textures are clean, this means there will be an obvious colour/shade mismatch. Install a different face mod, or a dirty body texture to fix this.\r<br />\r<br />[color=#3CB371]Q3: I screwed up and now the textures are black/multicoloured/invisible&#33; How do I fix this? -or- I didn&#39;t bother reading the instructions and clicked Blend on something I didn&#39;t want/I&#39;ve changed my mind and don&#39;t want this tattoo/added texture&#33; How do I &#39;unblend&#39; the textures?[/color]\r<br />A: Reinstall the original textures/the files you backed up before you started. Currently there is no way for TexBlend to revert to the original textures. In future, make sure you use the preview button to check what exactly you are changing.\r<br />\r<br />[color=#3CB371]Q4: I added a tattoo to my character, and now all same-gender NPCs have it&#33; Why does this happen, and how do I make sure only my character gets the tattoo?[/color]\r<br />A: With the exception of Argonians and Khajiits, all female characters use the same body texture, just with a different colour overlay to give them the racial colours. The same goes for male ones. The only way around this is to have a custom race that uses its own unique textures.\r<br />\r<br />[color=#3CB371]Q5: My characters have blank colours at the hips. Can I use TexBlend to fix this?[/color]\r<br />A: This is caused by not using the correct textures with the body. For instance, you can&#39;t use CBBEv2 body textures on a CBBEv3 body. TexBlend can&#39;t fix this; the only way is to install textures for the body you have installed.\r<br />\r<br />[img]http://i.imgur.com/n3njk.png[/img]\r<br />TexBlend comes with a few textures for demonstration purposes (And also to facilitate the neck seam fix process), but it is very easy to install your own source textures and modifications, and even allow TexBlend to support more texture sets such as armor or environments. Please see the Readme for full instructions about how to add new files.\r<br />\r<br />[img]http://i.imgur.com/ZOudi.png[/img]\r<br />TexBlend is a C++ application written to utilize the standard Win32 API. The full source code is included in the package, under the MIT license (License is printed at the top of each source file). The code itself is regrettably uncommented for the most part, but is included partly to allow others to expand/adopt the code if they like, and to allow them to see exactly what I&#39;m doing in there. The license allows you to do pretty much whatever you like with it :) I did not include any makefiles or project files, but it should be simple enough to add all the source files to a basic project and compile if desired. I&#39;m happy to answer questions and/or accept critique and suggestions with respect to the code and application, but please note I won&#39;t have time to give anyone a programming course :)\r<br />\r<br />[img]http://i.imgur.com/a4j34.png[/img]\r<br />TexBlend makes use of two third party Libraries. \r<br />\r<br />[url=http://www.grinninglizard.com/tinyxml/]TinyXML[/url]\r<br />A small chunk of code written by Lee Thomason that performs non-validating parsing of an XML document. This code is included right along side the rest of the TexBlend source files (they all start with tiny*), and is released under the MIT license as well. I have made no changes to this library, and recommend it to anyone interested in a fast and easy to use XML library. \r<br />\r<br />[url=http://openil.sourceforge.net/]DevIL[/url]\r<br />A nicely featured image library called Developer&#39;s Image Library and written by Denton Woods. The library is offered under the Lesser GPL license (full license text available in the src/DevILChanges/DevIL-LICENSE(LGPL) file).  The library itself did not quite meet the needs of TexBlend, particularly in the handling of transparency from PSD files, so I&#39;ve modified some of the library code to correct these issues. I did not include the whole library with my distribution, but instead included the files that I changed. To see what I changed, read TexBlendsrcDevILChangesAboutThisFolder.txt, or look at the source files located within that folder. To obtain the library itself, please visit http://openil.sourceforge.net/. My changes are based on version 1.7.8, and should you need to rebuild the .Dlls, replacing the official library files with my changed ones should suffice.  My compilation of DevIL also included libSquish (For compression), libJpeg, libpng, and zlib. Any other external libraries supported by DevIL were disabled in the configuration and not used. \r<br />\r<br />[img]http://i.imgur.com/eZ9Pc.png[/img]\r<br />[color=#3cb371]0.9.2[/color]\r<br />- Added files for Caliente&#39;s Body V3\r<br />- Added an autoheadfix function (enabled through config)\r<br />\r<br />[color=#3CB371]Version 0.9.1[/color]   \r<br />- Corrected an issue that caused TexBlend to be unable to find files in the Library and source directories.\r<br />\r<br />[color=#3CB371]Version 0.9a[/color]\r<br />- Initial release.",
  "categoryId": "82",
  "version": "0.9.4b",
  "author": "Caliente",
  "createdUnix": "1326089310",
  "updatedUnix": "1360016739",
  "containsAdultContent": false,
  "uploadedBy": "Caliente",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18288",
      "name": "ModPack CBBEBody To Neck Blend 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1035",
      "fileName": "ModPack CBBEBody To Neck Blend 1-0-5737-1-0.7z",
      "uploadedUnix": "1326137860",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/95a42f881ed09e8c75d04d83224bedd79e4eaeea52978f3174350aa3e3745b0c/analysis/1406597105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModPack%20CBBEBody%20To%20Neck%20Blend%201-0-5737-1-0.7z?fid=18288&ttl=1535762700&ri=8192&rs=8192&setec=60557fa8ab587ba7d07c8aeb81bb28ba"
    },
    {
      "fileId": "18300",
      "name": "TextureBlend DEBUG executable 0-9-1",
      "version": "0.9.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "101",
      "fileName": "TextureBlend DEBUG executable 0-9-1-5737-0-9-0.7z",
      "uploadedUnix": "1326141682",
      "modVersion": "0.9.0",
      "virusScanUrl": "https://www.virustotal.com/file/027c937e857a9c6c1fb5d9246f4e6b9e48e5384ddca5cad48382149fa1f26221/analysis/1406597164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TextureBlend%20DEBUG%20executable%200-9-1-5737-0-9-0.7z?fid=18300&ttl=1535762701&ri=8192&rs=8192&setec=88c854d5d93ab2d305e4ceb88cd7c82b"
    },
    {
      "fileId": "18373",
      "name": "Calientes Texture Blender v0-9-1",
      "version": "0.9.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8857",
      "fileName": "Calientes Texture Blender v0-9-1-5737.7z",
      "uploadedUnix": "1326155247",
      "modVersion": "0.9.1",
      "virusScanUrl": "https://www.virustotal.com/file/db47395b8c4e3d9dd92e59de0b9f3a379c440fd1609933b5ed785805932f1d3d/analysis/1406598007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Calientes%20Texture%20Blender%20v0-9-1-5737.7z?fid=18373&ttl=1535762701&ri=8192&rs=8192&setec=064415aedf573fd46af0868837a933f1"
    },
    {
      "fileId": "22182",
      "name": "Calientes Texture Blender v0-9-2",
      "version": "0.9.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17094",
      "fileName": "Calientes Texture Blender v0-9-2-5737-0-9-2.7z",
      "uploadedUnix": "1327265613",
      "modVersion": "0.9.2",
      "virusScanUrl": "https://www.virustotal.com/file/4619b5d29fdff88eae0b8719bdc7752d6bb0d0d18cc82307c6d32372a2f64501/analysis/1406631678/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Calientes%20Texture%20Blender%20v0-9-2-5737-0-9-2.7z?fid=22182&ttl=1535762702&ri=8192&rs=8192&setec=7d2dab2c9f80aceaeafdaef6448431b6"
    },
    {
      "fileId": "97618",
      "name": "TextureBlender-MediumResOutput 1-0",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "TextureBlender-MediumResOutput 1-0-5737-1-0.7z",
      "uploadedUnix": "1352099786",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eb3d3762b08203a203ada490d83fe1f97812e4da2c7c2c701339e9106e00d083/analysis/1407250384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TextureBlender-MediumResOutput%201-0-5737-1-0.7z?fid=97618&ttl=1535762702&ri=8192&rs=8192&setec=c129f3cfc4bec5c46976cbc47d52f994"
    },
    {
      "fileId": "97640",
      "name": "Calientes Texture Blender v0-9-3",
      "version": "0.9.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29252",
      "fileName": "Calientes Texture Blender v0-9-3-5737-0-9-3.7z",
      "uploadedUnix": "1352129381",
      "modVersion": "0.9.3",
      "virusScanUrl": "https://www.virustotal.com/file/958c9026dc981a8e8a850c0ff5807101d345a978d65dec9b957fcf98b5e91f0a/analysis/1407250600/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Calientes%20Texture%20Blender%20v0-9-3-5737-0-9-3.7z?fid=97640&ttl=1535762702&ri=8192&rs=8192&setec=2a8a404944d881b7d7e4773c42f50b2e"
    },
    {
      "fileId": "1000002974",
      "name": "Calientes Texture Blender v0-9-4",
      "version": "0.9.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29057",
      "fileName": "Calientes Texture Blender v0-9-4-5737-0-9-4.7z",
      "uploadedUnix": "1358441714",
      "modVersion": "0.9.4",
      "virusScanUrl": "https://www.virustotal.com/file/c1e6f63d01c65abb8c5787340ac176a814c23cfea12dc3f3f847846d7215c6fe/analysis/1407358040/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Calientes%20Texture%20Blender%20v0-9-4-5737-0-9-4.7z?fid=1000002974&ttl=1535762703&ri=8192&rs=8192&setec=f516f18b53c03052e374b30326256580"
    },
    {
      "fileId": "1000006624",
      "name": "Calientes Texture Blender v0-9-4a",
      "version": "0.9.4a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29524",
      "fileName": "Calientes Texture Blender v0-9-4a-5737-0-9-4a.7z",
      "uploadedUnix": "1359842793",
      "modVersion": "0.9.4a",
      "virusScanUrl": "https://www.virustotal.com/file/5bdcb5e3739df44290a58574e8dd640a6602e0c30664d2997c0d7a735256aff7/analysis/1407393438/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Calientes%20Texture%20Blender%20v0-9-4a-5737-0-9-4a.7z?fid=1000006624&ttl=1535762704&ri=8192&rs=8192&setec=0e1b1cbcdbd63c5f00ffd396e981b79f"
    },
    {
      "fileId": "1000007115",
      "name": "Calientes Texture Blender v0-9-4b",
      "version": "0.9.4.b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29527",
      "fileName": "Calientes Texture Blender v0-9-4b-5737-0-9-4-b.7z",
      "uploadedUnix": "1360016739",
      "modVersion": "0.9.4.b",
      "virusScanUrl": "https://www.virustotal.com/file/6738ce2438066e460299f458fe57c08591ec27736823958f594ef0d84ad8c19c/analysis/1407397660/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Calientes%20Texture%20Blender%20v0-9-4b-5737-0-9-4-b.7z?fid=1000007115&ttl=1535762704&ri=8192&rs=8192&setec=4f89c782e8173ab097c177ec73c2f9dc"
    }
  ]
}