{
  "modId": 57394.0,
  "modName": "Assorted  Resources",
  "summary": "Assorted  Resources for modders",
  "descriptionHtml": "[color=#ff0000][size=3][b]None of these resources or parts of them may be used in paid mods[/b][/size][/color]\r<br />\r<br />===========================================\r<br />Assorted resources \r<br />===========================================\r<br />\r<br />for modders\r<br />\r<br />Version 1.0\r<br />\r<br />by Tamira\r<br />\r<br />\r<br />During the past months I converted or made some new stuff for friends or for my own pleasure, most of it to be used in tropical/desert/carribean surroundings. Now I packed some of these together as modder&#39;s resources. Maybe I will add some more stuff later. \r<br />\r<br />\r<br />Content:\r<br />========\r<br />\r<br />Skooma Pipes by McMuffin:\r<br />One with the original texture, the other one with the glaced pottery texture. The top has glowing embers. Both have clutter collision, so they work as misc items but of course can be added as statics too in the CK. \r<br />\r<br />WindChimes:\r<br />Moving wind chimes, with a chime sound included which you can add as sound marker, or you can add the chime as an activator in the CK and add the sound as looping sound. \r<br />I always missed a wind chime in Skyrim, now I finally took on the challenge, as regards the animation. \r<br />I made this from the vanilla wall basket with Nifskope as my only tool, so please forgive me if this isn&#39;t as perfect as you may expect.\r<br />Preview (showing the bamboo hut too):\r<br />https://www.youtube.com/watch?v=kFg_5S0JEoU\r<br />\r<br />Bamboo huts:\r<br />Assembled from the orc hut kit so you have ready-to-use complete huts. They are retextured with a straw respectively wicker roof and bamboo sides. I made interiors for them too (same object but with a floor added) and matching doors. Don&#39;t forget the &#34;show sky&#34; in the CK for the interior as it has an opening in the roof. \r<br />\r<br />Treasure:\r<br />Crowns (by Khugan), pearl necklaces, gold Vase, gold bowls, gold bucket. \r<br />Two treasure chests, one with gold only and one with gold and some valuables\r<br />Gold coin mounds and a loose coin mesh to cover the edges of the mounds by multiple use. \r<br />You may notice that the coins don&#39;t show the Skyrim Septim, they are considered to be pirate loot or foreign currency from external trade. \r<br />All these are statics, they don&#39;t work as misc items. Also, the crowns and pearl necklaces are not wearable of course. \r<br />\r<br />Paintings:\r<br />Some still life paintings of old masters from the 16th and 17th century. Maybe I&#39;ll add some more later on.\r<br />\r<br />Rugs and wall hangings: \r<br />The rugs are retextured Skyrim rugs and the wall hangings are retextured and modified Skyrim banners (not moving), all textured in oriental style. Maybe I&#39;ll add some more later on. \r<br />\r<br />Bison skull:\r<br />The bison shield (by ringx) works like a real shield though it is more a fun object, the skull on it is evidently too small to be a bison&#39;s skull. You can add it as a static too and use it as wall decoration. \r<br />Bison skull and Bison Skull with nails both are statics, they don&#39;t work as misc items.\r<br />\r<br />Voodoo doll:\r<br />I made this from the vanilla &#34;Effigy of King Olaf&#34;. And I made some &#34;voodoo needles&#34; from vanilla meshes. Static use only. \r<br />\r<br />Filled baskets: \r<br />For now only a flower basket and a vegetable basket, both are statics. Maybe I&#39;ll add some more later on.\r<br />\r<br />\r<br />\r<br />Credits:\r<br />=======================\r<br />\r<br />Skooma Pipes:\r<br />Converted for Skyrim from the Oblivion original by McMuffin http://www.nexusmods.com/oblivion/mods/13121/?\r<br />This resource is already open source. I asked McMuffin and he gave me explicit permission to convert and upload his Skooma pipes. \r<br />\r<br />Treasure:\r<br />The crowns are conversions from this Oblivion mod \r<br />http://www.nexusmods.com/oblivion/mods/16426/?\r<br />The author Khugan (user name Conifer) has given me permission for the conversion and to upload them in a resource pack.\r<br />\r<br />The coin texture is made by Bartalon http://bartalon.deviantart.com/art/Seamless-Gold-Coins-190680975?\r<br />\r<br />The basic shapes of the pearl necklace cords are from Mr Siikas Seaview mod. I have already the permission for all objects of that mod.\r<br />\r<br />Bison skull and shield:\r<br />Converted from this free resource by ringx: \r<br />http://www.turbosquid.com/FullPreview/Index.cfm?ID=725212&seo=0\r<br />\r<br />WindChimes:\r<br />I made this with Nifskope from the vanilla wall basket\r<br />\r<br />\r<br />CG Textures\r<br />The Niftools team for giving us Nifskope.\r<br />Skyfox from the Niftools team for his great tool NifUtils\r<br />\r<br />\r<br />My personal thankyou goes to my friend Beolo for the painting frame and for all his help\r<br />\r<br />\r<br />Permission:\r<br />===========\r<br />\r<br />You may use these resources in your mods as long as you give credit and you do not charge money for it. \r<br />You have to give credit to the authors of the original resources too as mentioned above if you use them in your mod. \r<br />\r<br />You may use this resource in Skyrim Special Edition too. All files should work without problems. \r<br />\r<br />Do not upload to other sites.",
  "categoryId": "82",
  "version": "1.0",
  "author": "Tamira",
  "createdUnix": "1408784094",
  "updatedUnix": "1408783770",
  "containsAdultContent": false,
  "uploadedBy": "Tamira",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123364",
      "name": "Assorted  Resources",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19252",
      "fileName": "Assorted  Resources-57394-1-0.7z",
      "uploadedUnix": "1408783770",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/772b681f41ad705296c79eeb5d1a84d138422c831247976c065b94e85ca33847/analysis/1408783869/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Assorted%20%20Resources-57394-1-0.7z?fid=1000123364&ttl=1535843368&ri=8192&rs=8192&setec=87cabd2cbf2aaf48450d9b4aee77921f"
    }
  ]
}