{
  "modId": 57393.0,
  "modName": "Stray Khajiit - Transforming Follower",
  "summary": "A Khajiit that can transform into several different animals for combat. Each form has its own abilities.",
  "descriptionHtml": "Adds a Khajiit follower that transforms into one of several different animal forms when he enters combat. Each form has its own unique abilities. To start the short quest to unlock the follower, simply ask any barkeeper for rumors.\r<br />\r<br />[color=yellow][b]Requirements:[/b][/color]\r<br />[list][*]The latest Skyrim patch[/*]\r<br />[*]Dawnguard[/*][/*]\r<br />[/list]\r<br />[color=yellow][b]Installation:[/b][/color]\r<br />[list][*][b]With Nexus Mod Manager[/b]: Simply click on the &#34;Download with Manager&#34; button.[/*]\r<br />[*][b]Manual Installation[/b]: Extract both files (the .bsa and the .esp) to your Skyrim data folder.[/*][/*]\r<br />[/list]\r<br />[color=yellow][b]Features / Forms:[/b][/color]\r<br />[list][*]The Khajiit automatically transforms when he enters combat.[/*]\r<br />[*]All of his forms gain more damage and armor as his level increases (same rate as the player; max level of 50).[/*]\r<br />[*]Sabre cat form&#39;s attacks reduce magicka regeneration by 15% for 6 seconds, the effect stacks and both magic and disease resistance can protect against it. The form has a higher chance of being used if the opponent is skilled in magic. If it is snowing, it will become a snowy sabre cat (&#34;snowy&#34; sub-forms have a frost resistance and a fire weakness; otherwise, all sub-forms are the same statistically); if it is &#34;night time&#34; (9 PM to 4 AM) it will become a vale sabre cat; otherwise it&#39;ll become a regular sabre cat.[/*]\r<br />[*]Werewolf form&#39;s attacks reduce the damage one and two handed weapons do by 10% for 6 seconds and the effect stacks. Werewolf form has the lowest chance of being used normally but at night and outdoors the chance increases, and if that&#39;s during a full moon the chance increases much more.[/*]\r<br />[*]Deer form restores health and stamina to itself and all nearby non-hostile targets if it or the player takes damage. The healing consumes his stamina instead of magicka and consumes more stamina than it restores. The form has a higher chance of being used if you are outdoors (as it gets stuck quite easily in narrower hallways). It can appear as a regular deer, an elk, a white stag or a vale deer.[/*]\r<br />[*]Cow form can summon up to 3 &#34;Mini Spectral Giants&#34; when it hits or gets hit. It also grants nearby allies the ability to have one extra summon or raised creature. The form has a higher chance of being used if the player&#39;s conjuration is his/her best magic skill.[/*]\r<br />[*]Chaurus form can afflict enemies with a damaging poison using its ranged attack and its melee attacks apply a different poison that weakens the target&#39;s resistance to poison. The potency of both poisons increase as it levels. If its level is 32+, then it becomes a Chaurus Hunter instead. The forms have a higher chance of being used if the opponent has less than 50% poison resistance.[/*]\r<br />[*]Skeever form&#39;s attacks can reduce the amount potions and spells heal the target for 6 seconds; automatons and undead are immune to this effect. The form has a higher chance of being used if the opponent&#39;s best magic skill is restoration. If it is night time or you are indoors, it will become a &#34;white&#34; skeever instead.[/*]\r<br />[*]Troll form&#39;s attacks reduce the target&#39;s armor by 25/50/75 if its level is at least 1/15/30 for 6 seconds and this stacks. If its level is at least 25, the troll will wear armor that increases its armor rating; the amount increases as he levels and this is in addition to the bonus armor all forms get as they level. The form has a higher chance of being used if your best weapon skill is on par with or better than your best magic skill. If it&#39;s snowing then he will become a frost troll.[/*]\r<br />[*]Bear form&#39;s attacks reduce stamina regeneration by 15% and speed by 10% for 18 seconds, this stacks and does not affect automatons. If it&#39;s night time or you are indoors then it will become a cave bear instead; if it&#39;s snowing it will become a snow bear instead.[/*]\r<br />[*]Goat form&#39;s power attacks &#34;Unrelenting Forces&#34; opponents.[/*]\r<br />[*]Fox form gives nearby allies 25% stronger destruction magic and 15% stronger illusion, restoration, alteration and conjuration magic. If it&#39;s snowing, it will become a snow fox instead.[/*]\r<br />[*]A short quest (started by asking a barkeeper for rumors) is required to unlock him. The quest itself can be started at any level.[/*]\r<br />[*]When dismissed, the Khajiit will make the location it&#39;s currently at its new home.[/*]\r<br />[*]The Khajiit occupies the pet slot and not the follower slot.[/*]\r<br />[*]If asked to follow last, then the mod is compatible with multiple pets using AFT. With other follower overhauls, I had less luck. Feel free to leave comments if it works / sort of works / does not work with certain follower overhauls.[*]I had a little experiment with this one. I tried to write a diary thing [url=http://tfskyrim.drupalgardens.com/content/making-stray-khajiit-1-werecats]here[/url] chronicling the making of the mod.[/*]\r<br />[/list]\r<br />\r<br />\r<br />I hope you will enjoy the mod&#33; If you do, please endorse and/or track. Also, feel free to check out my other completed mod[s]s[/s] and my blog:\r<br />[list][*][b][url=http://skyrim.nexusmods.com/mods/41629/]Almost Everyone is an Adventurer[/url][/b] = My 1st Nexus submission. This allows you to turn most NPCs into useful, recruitable followers for you to use and abuse. Walk up to your favorite (or least favorite) NPC, pick a class and start questing with them today&#33;[/*]\r<br />[*][b][url=http://skyrim.nexusmods.com/mods/43529/]Miraak - Dragonborn Follower[/url][/b] = Have the antagonist of the Dragonborn DLC as your follower&#33; In addition to weapons and spells, he also uses a variety of shouts semi-intelligently. His in-game dialogue has also been copied and edited in order to make him a &#34;fully voiced&#34; follower. The mod also comes with two regular, boring followers.[/*]\r<br />[*][b][url=http://www.nexusmods.com/skyrim/mods/58069/]Better Dead Thralls[/url][/b] = Improves the Dead Thrall spell to give you greater control over your thralls and make the use of thralls more convenient.[/*]\r<br />[/list][url=http://tfskyrim.drupalgardens.com/content/my-completed-mods][img]http://i.imgur.com/FoPztus.png[/img][/url]",
  "categoryId": "96",
  "version": "v1.0",
  "author": "transientfaith",
  "createdUnix": "1408782250",
  "updatedUnix": "1408782121",
  "containsAdultContent": false,
  "uploadedBy": "transientfaith",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123361",
      "name": "Stray Khajiit Follower - version 1.0",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "212",
      "fileName": "Stray Khajiit Follower - version 1.0-57393-v1-0.zip",
      "uploadedUnix": "1408782121",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/420fde2e748ec299b596848b963b8ca975151ba04bd312f8e7c7d5d396ac0829/analysis/1408782183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stray%20Khajiit%20Follower%20-%20version%201.0-57393-v1-0.zip?fid=1000123361&ttl=1535843366&ri=8192&rs=8192&setec=8a03bdd32dd1f22f5b6d5f2e40bc17e5"
    }
  ]
}