{
  "modId": 57408.0,
  "modName": "HDT Equipment",
  "summary": "This mod allows bouncy HDT physics to unequiped/sheathed weapons.",
  "descriptionHtml": "[youtube]tx43ZfpeZ3E[/youtube]\r<br />\r<br />[size=4][b]Description:[/b][/size]\r<br />\r<br />This mod allows bouncy HDT physics to unequipped/sheathed weapons. This mod comes in two variants:\r<br />\r<br />[size=3][b]Craftable Weapon Sling:[/b][/size]\r<br />You can craft a Weapon Sling item at a tanning rack for 3 leather strips and 1 iron ingot. The weapon sling allows bouncy HDT physics to unequipped/sheathed weapons when worn. When crafting the sling item, you will be presented with several options of which type to craft:\r<br />\r<br />[list][*][b]Weapon Sling[/b] - The default weapon sling. Will only apply physics to vanilla-type weapon positions.[/*]\r<br />[*][b]Weapon Sling[/b][b] (Dual Sheath)[/b] - Compatible with dual sheaths. Uses the default dual sheath arrangement.[/*]\r<br />[*][b]Weapon Sling (Belted Quiver)[/b] - Compatible with dual sheaths. Uses the default belted-quiver arrangement.[/*]\r<br />[*][b]Weapon Sling (Dual Back Scabbard)[/b] - Compatible with dual sheaths. Uses the default back one-handed sword arrangement.[/*]\r<br />[*][b]Weapon Sling (Belted Back Armory)[/b] - Compatible with dual sheaths. Uses a custom arrangement, combining the belted quiver with the back one-handed swords.[/*]\r<br />[*][b]Weapon Sling (Well Fitted)[/b] - This may also spawn as the player&#39;s default weapon sling if Groovtama&#39;s [url=http://www.nexusmods.com/skyrim/mods/26800]XPMSE[/url] v2.60+ is installed (is also craftable at a tanning rack). Will work with any custom weapon configurations set by the [url=http://www.nexusmods.com/skyrim/mods/29624]RaceMenu[/url] by Expired. Do not use this weapon sling if your character is not using the proper XPMSE version&#33; Compatible with dual sheaths.\r<br />[*][b]Weapon Sling (Personalized)[/b] - If you have a blacksmith&#39;s hammer in your inventory while crafting, you can also make a custom sling reserved for your own preferences (if you are using v0.2d+, customization can be made via the MCM). Compatible with dual sheaths. \r<br />[/*][/list][size=2]\r<br />[b]Note:[/b] [i]&#34;Compatible with dual sheaths&#34;[/i] means that the physics will apply to both the right- and left-handed sheaths. This, in turn, allows you to see both sheathed weapons, given the proper mods installed. Depending on how many actors have this going on at once and your system setup, it may bog down your game. Alternatively, the vanilla variants apply physics to less bones, thus using less resources to calculate the physics.[/size]\r<br />\r<br />If you have follower NPCs, you may also be able to give them slings as well. You can mix and match different sling arrangements even if you \r<br />don&#39;t have a matching main skeleton. Though a matching skeleton is preferred, it is not required. Certain visual glitches between pause screens may be prevalent when using an arrangement that does not match your skeleton, but it is purely graphical and not game-breaking.\r<br />\r<br />In version 0.2b+ of this mod, the player character will automatically have a default weapon sling added to his/her inventory and equipped upon starting the game. The mod is also able to automatically add and equip a weapon sling to any valid NPC near the player character (this includes Draugr, Skeletons, and Falmer as well). If the NPC has a weapon and it is equipped, they will automatically get a weapon sling, if they are unarmed, they will not get a sling until they equip a weapon. The options can be found in SkyUI&#39;s MCM under &#34;HDTPE Weapon Sling&#34;. By default, the add-and-equip to NPCs feature is turned off for safety reasons. It is highly recommended that you set your desired slot number first before enabling the NPC feature--as once the slot number has changed, the sling needs to be unequipped and re-equipped in order to refresh the changes (some NPCs cannot un-equip/re-equip items automatically).\r<br />\r<br />The NMM Installer of this variant includes options for alternate physics movements as well as alternate dagger and 2-handed weapon positions. It also includes animation and image references for the user to compare. The installer also includes .esps for MCM, No MCM, Craft Only, and Craft + Outfits (the latter two do not use scripts).\r<br />\r<br />Performance friendly. Plugin made by Jacques00.\r<br />\r<br />[size=3][b]Everyone:[/b][/size] \r<br />This variant of the mod will enable the sheathed weapon physics to the player character and all valid NPCs. It does this by replacing HDT Physics Extension&#39;s default .xml file. This will overwrite any custom [i]hdtPhysicsExtensionsDefaultBBP.xml[/i] file you may have.\r<br />\r<br />For those with close-to-vanilla setups, there is also a Vanilla version of this variant (TBBP/BBP and dual sheath compatibility, and the XPMSE requirement are not a part of this version--though see the [b]Known Issues[/b] section below for specification.) [i]Install this if you don&#39;t want any errors in the [/i]hdtPhysicsExtensions.log[i] file concerning missing bones to bind physics to--this is because you are using a vanilla-like skeleton that omits the Breast and Butt bones.[/i]\r<br />\r<br />[i]([b]Note:[/b] the &#34;Everyone&#34; version of this mod has now been moved to the &#39;Old Versions&#39; section to prevent confusion with the current version of the \r<br />mod. When further breakthroughs happen for this version, it will be updated accordingly. For now, development on this version is on hiatus.)[/i]\r<br />\r<br />[size=3][b]Optional Downloads:[/b][/size] \r<br />[list][*][b]HDTPE Wearable Lanterns Mesh Replacement[/b] - Replaces worn lantern meshes for [url=http://www.nexusmods.com/skyrim/mods/17416]Wearable Lanterns by Chesko[/url] and makes them HDTPE-compatible. Either variant of the main mod is not required for this add-on, but the add-on does require Wearable Lanterns to be installed first. This affects all worn lanterns (default, paper, and torchbug jar lanterns). Because there is a technical difficulty for making the physics show on held weapons/shields/torches (if possible at all), the held lanterns could not have physics implemented, unfortunately. If this changes in the future, then this add-on may be updated for that. After installing this replacement, additional replacements also include [url=http://www.nexusmods.com/skyrim/mods/34535]Wearable Lanterns SMIM Patch by Telamont[/url] and [url=http://www.nexusmods.com/skyrim/mods/64125]Wearable Lanterns - Lighting Fix by IcePenguin[/url]. Alternate edits to this mod can also be found: [url=http://www.nexusmods.com/skyrim/mods/65668]Travel Lanterns Art -HDT Equipment-[/url] by SrRamrod.\r<br />[/*][/list]\r<br />[i]([b]Note:[/b] The basic requirement for these optional add-ons is the HDT Physics Extensions plugin.)[/i]\r<br />\r<br />---\r<br />\r<br />[size=4][b]Requirements:[/b][/size]\r<br />\r<br />[size=3][b]All Versions Require:[/b][/size]\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/53996/?][b]HDT Physics Extensions[/b] by HydrogensaysHDT[/url] - Physics engine. Latest version.[/*]\r<br />[*][url=http://skse.silverlock.org][b]SKSE[/b][/url] - Skyrim Script Extender. Latest version.[/*]\r<br />[/list]\r<br />[b][size=3]Required for &#34;Weapon Sling&#34; Variant[/size] [/b](for version 0.2b and higher)[size=3][b]:[/b][/size]\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/3863/]SkyUI[/url] - to access the mod options using the MCM settings. (A non-MCM version is included in the NMM Installer if you choose not to use SkyUI or the MCM.)[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/37481/]NetImmerse Override[/url] [i](for v0.2d+)[/i] - for the &#34;Personalized&#34; Weapon Sling features. [i]If you are using the latest version of Expired&#39;s [url=http://www.nexusmods.com/skyrim/mods/29624/]RaceMenu[/url], this plugin should already be included.[/i]\r<br />[/*][*][url=http://www.nexusmods.com/skyrim/mods/24020/]Brawl Bug Patch[/url] or [url=http://www.nexusmods.com/skyrim/mods/23435/]Brawl Bug Plugin[/url] ([i]Optional[/i]) - to avoid brawl bug issues with the cloak spell function (regardless, a &#34;Brawl Check&#34; safety option is also included in the MCM).[/*]\r<br />[*][i][b]Note[/b]: This variant of the mod should work for any skeleton, as long as it contains vanilla weapon nodes. However, there have been a couple reports saying there is a strange conflict using this mod and XPMSE, with [url=http://www.nexusmods.com/skyrim/mods/11954/?]Pretty Female Idles[/url] and/or [url=http://www.nexusmods.com/skyrim/mods/13272/?]Victoria&#39;s High Heel Walk[/url]. The solution to this is if you are using those particular animations, to roll back to an earlier XPMS. This is not a fault of the mod or the skeleton, but it may be issues with the animations themselves. This conflict does not affect the &#34;Everyone&#34; version.[/i]\r<br />[/*][/list]\r<br />[b][size=3]Required for &#34;Everyone&#34; Variants[/size] [/b](Recommended for Craftable Sling variant, but not necessarily required)[size=3][b]:[/b][/size]\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/26800/?][b]Groovtama&#39;s XPMS Extendend skeleton[/b] by Groovtama & xp32[/url] - The latest version of Groovtama&#39;s extended skeleton.[/*]\r<br />[*][i][b]Note:[/b] Currently, the &#34;Dual Sheath Redux&#34; version for &#34;Everyone&#34; has a modified skeleton that overwrites the XPMSE skeleton for technical dependency reasons. We are looking to removing this dependency, but until then, using this version will overwrite any custom weapon placements you may have when installing XPMSE&#33; Because the overwriting of the skeleton is necessary, be sure to install this mod [b]after[/b] installing any skeleton.[/i][/*]\r<br />[/list]\r<br />[size=3][b]Recommended Mods for All Versions:[/b][/size][b]\r<br />[/b][list][*][url=http://www.nexusmods.com/skyrim/mods/34155/?][b]Dual Sheath Redux by Neovalen[/b][/url] - For left hand weapons to show up and shield on back.[/*]\r<br />[/list]Or\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/49784/?][b]Equipping Overhaul[/b] by DragonDude1029[/url] - To see the mod in all it&#39;s glory.[/*]\r<br />[/list]Or\r<br />[list][*][url=http://www.nexusmods.com/skyrim/mods/40953/?][b]All Geared Up[/b] by MrJack[/url] - To see the mod in all it&#39;s glory.[/*]\r<br />[/list]\r<br />Remember to read the prerequisite for these mods in order to get them working&#33;\r<br />\r<br />---\r<br />\r<br />[size=4][b]Installation:[/b][/size]\r<br />[i][b]Note:[/b] Please make sure all the prerequisites are installed and working first--then install this mod.[/i]\r<br />\r<br />[b][size=3]Craftable Weapon Sling:[/size][/b]\r<br />[list=1][*]Use the mod manager or extract all files manually into their respective folders (drop the &#34;data&#34; folder into your Skyrim folder). Be sure to back up any files that require overwriting as a precaution. Users of the NMM Installer version will need to install with the mod manager and will be guided through the install options step-by-step.[/*]\r<br />[*]Activate the HDTPhysicsWeaponSling.esp in your plug-in list.[/*]\r<br />[*]The Weapon Sling items can now be crafted at any tanning rack in the game.[/*]\r<br />[*]For v0.2b+, you can access the option via SkyUI&#39;s MCM after the menu registers.[/*]\r<br />[/list]\r<br />[size=3][b]Everyone:[/b][/size]\r<br />[list=1][*]Use the mod manager or extract all files manually into their respective folders (drop the &#34;data&#34; folder into your Skyrim folder). Be sure to back up any files that require overwriting as a precaution (namely, the [i]hdtPhysicsExtensionsDefaultBBP.xml[/i] file).[/*]\r<br />[/list]\r<br />---\r<br />\r<br />[size=4][b]Uninstallation:[/b][/size]\r<br />[i][b]Note:[/b] Please make sure to have backups in case something goes wrong.[/i]\r<br />[b][size=3]\r<br />Craftable Weapon Sling:[/size][/b]\r<br />Use the mod manager or remove the following files:\r<br />[list][*]data&#92;HDTPhysicsWeaponSling.esp[/*]\r<br />[*]data&#92;meshes&#92;weapons&#92;weaponsling (entire folder and contents within)[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponsling.xml[/*]\r<br />[/list]\r<br />In addition, if using v0.2b or higher, remove the following files:\r<br />[list][*]data&#92;interface&#92;HDTPhysicsWeaponSling (entire folder and contents within)[/*]\r<br />[*]data&#92;interface&#92;translations&#92;HDTPhysicsWeaponSling_[i](LANGUAGE)[/i].txt[/*]\r<br />[*]data&#92;scripts&#92;HDTPE_WeaponSlingApplyingScript.pex[/*]\r<br />[*]data&#92;scripts&#92;HDTPE_WeaponSlingMCMScript.pex[/*]\r<br />[*]data&#92;scripts&#92;HDTPE_WeaponSlingPlayerScript.pex[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponsling_b1hs.xml[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponsling_dsr.xml[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponsling_user.xml[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponslingdraugr.xml[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponslingdraugr_user.xml[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponslingfalmer_.xml[/*]\r<br />[*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensions&#92;weapons&#92;weaponslingfalmer_user.xml[/*]\r<br />[/list]\r<br />Also, if using v0.2b or higher:\r<br />[list][*]It is highly recommended to use a [url=http://www.nexusmods.com/skyrim/mods/52363/]save tool[/url] to remove any leftover latent scripts (see script names above--file extension &#34;.pex&#34;) on a save game after uninstalling and optionally creating a &#34;clean save&#34;.[/*]\r<br />[/list][size=3][b]\r<br />Everyone:[/b][/size]\r<br />Use the mod manager or remove the following files:\r<br />[list][*]data&#92;skse&#92;plugins&#92;hdtPhysicsExtensionsDefaultBBP.xml[/*]\r<br />[/list]\r<br />In addition, if using the current &#34;Dual Sheath&#34; version, remove or replace the following files:[list][*]data&#92;meshes&#92;actors&#92;character&#92;character assets&#92;skeleton.nif[/*]\r<br />[*]data&#92;meshes&#92;actors&#92;character&#92;character assets&#92;skeletonbeast.nif[/*]\r<br />[*]data&#92;meshes&#92;actors&#92;character&#92;character assets female&#92;skeleton_female.nif[/*]\r<br />[*]data&#92;meshes&#92;actors&#92;character&#92;character assets female&#92;skeletonbeast_female.nif[/*]\r<br />[/list]\r<br />---\r<br />\r<br />[size=4][b]Known Issues:[/b][/size]\r<br />\r<br />[size=3][b]General Issues:[/b][/size]\r<br />[list][*]Sometimes the physics freak out (usually relates to .xml file and other variables, such as system setup, ENBs, render settings, vsync, time-scaling and/or frame/altering mods).[i] Some have said capping the frames-per-second to about 50 or 60, disabling v-sync, and/or enabling WaitBusyRender will help remedy this. The frame rate does have an impact on how the physics is calculated with the HDTPE plugin, so do keep that in mind. This is an HDTPE plugin issue, not an issue with this mod in particular. For more support or information, please visit [url=https://code.google.com/p/hdt-pe/]HDT Physics Extension for Skyrim[/url].[/i]\r<br />[/*][*]Clipping is inevitable (clipping has been minimized, but certain combinations will inevitably clip--this is a common problem with features that are highly modular as there is no one-size-fits-all). There are adjustable features (via the MCM) for the Personalized Weapon Sling that may help remedy that, but only for the player character and not for NPCs.\r<br />[/*][*]Though no longer an early test version, this mod is still a work in progress from time to time.[/*]\r<br />[/list]\r<br />[size=3][b]Craftable Weapon Sling:[/b][/size]\r<br />[list][*]When using a sling that does not match the actor&#39;s skeleton, the weapons for that actor may jump back to their original positions between pause menus (inventory, console, etc.--this is a limitation of the HDT PhysicsExtension plug-in and skeleton files, not the items themselves).[/*]\r<br />[*]Slot limitation--If you are using mods that occupy the Biped Object Slot 44, this mod may conflict with it (Slot 44 is the default slot this mod uses on start-up, but it can be changed if using v0.2b+ of this mod).[/*]\r<br />[*](v0.2b+) The player can infinitely farm weapon slings from an NPC if the cloak spell remains active while removing a weapon sling from an NPC. To avoid this, turn off the cloak effect via the MCM or console before removing a weapon sling from a living and armed NPC.[/*]\r<br />[*](v0.2b only) There was an issue with the [i]HDTPE_WeaponSlingApplyingScript.pex[/i] rewrite in which I forgot to reincorporate my dispel safety feature before uploading. This may result in a save bloat/script lag. If you are using this version, please check the Update section, under the Files tab, for a patch (it will replace the previous script). If the save still bloats (or game script lags during excessive play) after installing the patch and cleaning the latent scripts using a [url=http://www.nexusmods.com/skyrim/mods/52363/]save tool[/url], please let me know in the comments/forum. Future releases will incorporate the update already, so no worries if you are using a newer version of this mod.[/*]\r<br />[*]When using the Default &#34;Weapon Sling&#34; for NPCs, sometimes the back weapons spin when too far from the player character. To get passed this, it is probably best to spawn the &#34;Dual Sheath&#34; or other custom weapon sling aside from the default. For v0.2e and under, the issue will still be present for Creatures, but it will be solved for the future releases. This has been fully resolved in v0.3a+.\r<br />[/*][/list][size=2]\r<br />[/size][size=3][b]Everyone:[/b][/size][list][*]Places with mounted/hanging weapons (like outdoor vendor stands), may have their weapons offset--making the weapons appear to float (this is an artifact of the HDT Physics Extension plug-in&#39;s auto-binding system and how weapons are handled by Skyrim&#39;s engine).[/*]\r<br />[*]Because of how the hdtPhysicsExtensionsDefaultBBP.xml works, the weapons physics may only apply to female characters--it seems the best solution for full gender support is to use the latest XPMSE.[/*]\r<br />[/list]---\r<br />\r<br />[size=4][b]Alternate Downloads and Fixes:[/b][/size]\r<br />Third-party fixes made by others in the community. If you have any problems with the current setup and are looking for alternative solutions, you may find these links useful.\r<br />\r<br />[size=3][b]Everyone:[/b][/size]\r<br />[list][*][b][url=http://www.nexusmods.com/skyrim/mods/57708/]HDT Equipment v0.2 - Everyone - Breast Fix[/url] by Mirage711[/b] - Fixes parameters of breasts in v0.2. Also includes a Dual Sheath Redux version.[/*]\r<br />[*][b][url=http://www.nexusmods.com/skyrim/mods/57852/]HDT Equip With Belly and Collision for Everyone[/url] by Carloss32[/b] - Edited parameters for the breasts, butt, and added belly node in v0.2. Also includes a Dual Sheath Redux version.[/*]\r<br />[/list]\r<br />---\r<br />\r<br />[size=4][b]Current Plans/Development:[/b][/size]\r<br />[size=3][b]\r<br />Weapon Sling:[/b][/size]\r<br />[list][*]Possibly add universal preset slots for the Personalized Weapon Sling.[/*]\r<br />[/list][size=3][b]\r<br />Everyone:[/b][/size]\r<br />[list][*]Development on the &#34;Everyone&#34; versions are on hiatus at the moment due to technical hurdles. Once there is a compatible way to making them work with dual sheaths without having to result in overwriting skeletons, improvements will resume (most likely it will either involve a skeleton.hkx patch, or dependency on one exclusive skeleton--similar to how it is now, but &#34;better&#34;).[/*]\r<br />[*]It is recommended to use the performance-friendly &#34;Weapon Sling&#34; version for dual sheaths if you have an issue with overwriting your current skeleton.\r<br />[/*][*]For those who don&#39;t mind just one additional .esp, an ongoing &#34;light&#34; script, and sacrificing that one Biped Object Slot, I highly suggest migrating over to the &#34;Weapon Sling&#34; version as it comes with more options, more user control, and won&#39;t kill your system with numerous NPCs on the screen at one time (though that last statement may be debatable&#33;). Though you can theoretically use both variants at the same time, it is gradually getting redundant to do so, so it may be best to choose one over the other.\r<br />[/*][/list]\r<br />Thank you for your patience and I hope you enjoy the mod&#33;\r<br />\r<br />---\r<br />\r<br />Credit to Jacques00 for helping me make this possible.\r<br />\r<br />[youtube]RCzYzTjj4Gc[/youtube]\r<br />\r<br />[youtube]qsm9xVgPkBw[/youtube]",
  "categoryId": "62",
  "version": "0.3a",
  "author": "IceKK and Jacques00art",
  "createdUnix": "1408799835",
  "updatedUnix": "1431897060",
  "containsAdultContent": false,
  "uploadedBy": "IceKK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123416",
      "name": "HDT Equipment Version 3",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "38",
      "fileName": "HDT Physics Weapon Sling-57408-0-1.rar",
      "uploadedUnix": "1408799728",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/32691a620dc2f7f9db0f9a6a3c9aa0b82cecda903e360dc1cc6c17ad6260efa5/analysis/1408799821/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Physics%20Weapon%20Sling-57408-0-1.rar?fid=1000123416&ttl=1535843385&ri=8192&rs=8192&setec=52b0673d63b9a067afde77f73f407b81"
    },
    {
      "fileId": "1000123548",
      "name": "HDT Equipment Version 2",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "HDT Equipment Version 2-57408-0-1.rar",
      "uploadedUnix": "1408847025",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/044c8d0e03f539b5eff92d7a43aa78e4fabb22f8749eeac8c712ae0417cccc6c/analysis/1408847102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20Version%202-57408-0-1.rar?fid=1000123548&ttl=1535843385&ri=8192&rs=8192&setec=0c7bb490ec18cf9580d7e3b5de9cfab3"
    },
    {
      "fileId": "1000123549",
      "name": "HDT Equipment Version 1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "HDT Equipment Version 1-57408-0-1.rar",
      "uploadedUnix": "1408847099",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/17684cead0a00e7c90038b42461949a9296070e639b516286bfcd9f2f642900c/analysis/1408847162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20Version%201-57408-0-1.rar?fid=1000123549&ttl=1535843386&ri=8192&rs=8192&setec=0c720d97fb0ed8571433ef3b651d670d"
    },
    {
      "fileId": "1000124542",
      "name": "HDT Equipment v.0.2 - Everyone",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "HDT Equipment v.0.2 - Everyone-57408-0-2.rar",
      "uploadedUnix": "1409403193",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/97633a091b2827462e6a70f3451ce1569b82d2248f42a8e49a4c3201886e1cf5/analysis/1409403301/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.2%20-%20Everyone-57408-0-2.rar?fid=1000124542&ttl=1535843386&ri=8192&rs=8192&setec=32f47a2e6a2384ae1e7afbf9143cb334"
    },
    {
      "fileId": "1000124543",
      "name": "HDT Equipment v.0.2 - Everyone - Dual Sheath Redux",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "82",
      "fileName": "HDT Equipment v.0.2 - Everyone - Dual Sheath Redux-57408-0-2.rar",
      "uploadedUnix": "1409403398",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/3fe5674e58eaa9198d117770a14029025ad1c76d912e00f8a8f1a0e5783d97d9/analysis/1409403482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.2%20-%20Everyone%20-%20Dual%20Sheath%20Redux-57408-0-2.rar?fid=1000124543&ttl=1535843387&ri=8192&rs=8192&setec=e8dc471a98e94b6d214d398c1ae7255d"
    },
    {
      "fileId": "1000124617",
      "name": "HDT Equipment v.0.2 - Everyone - Vanilla",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "HDT Equipment v.0.2a - Everyone - Vanilla-57408-0-2a.zip",
      "uploadedUnix": "1409449730",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/583dc0a5dcf6a4b3bc6b5bdb0154d2248e062533afd29d0ca0d94ccc81354103/analysis/1409449802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.2a%20-%20Everyone%20-%20Vanilla-57408-0-2a.zip?fid=1000124617&ttl=1535843387&ri=8192&rs=8192&setec=9578d1fc3c9f6f8b0cd1225a8b559fb3"
    },
    {
      "fileId": "1000133614",
      "name": "HDT Equipment v.0.2e - Craftable Weapon Sling (Non-Installer)",
      "version": "0.2e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "441",
      "fileName": "HDT Equipment v.0.2e - Craftable Weapon Sling (Non-Installer)-57408-0-2e.zip",
      "uploadedUnix": "1414923733",
      "modVersion": "0.2e",
      "virusScanUrl": "https://www.virustotal.com/file/11d6b63b134dac08e933b13e7c913305fcac6b16e18c7798cd088a661e9378f9/analysis/1414923843/",
      "changelogHtml": " Updated all scripts. <br/> \n Custom slot selection now updates upon load <br/> \n Converted node transition features over from NetImmerse to NiOverride for Personalized Weapon Sling functions. <br/> \n Added node rotation features to Personalized Weapon Sling functions. <br/> \n Carried relevant changes over to the non-MCM version (from the NMM Installer). <br/> \n Added translations (French and Japanese). <br/> \n Updated language translation package to reflect the changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.2e%20-%20Craftable%20Weapon%20Sling%20%28Non-Installer%29-57408-0-2e.zip?fid=1000133614&ttl=1535843388&ri=8192&rs=8192&setec=155941a631cef3654c342fb9bdb76a00"
    },
    {
      "fileId": "1000133616",
      "name": "HDT Equipment v.0.2e - Craftable Weapon Sling (NMM Installer)",
      "version": "0.2e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5503",
      "fileName": "HDT Equipment v.0.2e - Craftable Weapon Sling (NMM Installer)-57408-0-2e.zip",
      "uploadedUnix": "1414924072",
      "modVersion": "0.2e",
      "virusScanUrl": "https://www.virustotal.com/file/e60630ec02c75ce0f6064291ac6fa2fd9f491db482f808e38ae7e056583dfe29/analysis/1414924147/",
      "changelogHtml": " Updated all scripts. <br/> \n Custom slot selection now updates upon load <br/> \n Converted node transition features over from NetImmerse to NiOverride for Personalized Weapon Sling functions. <br/> \n Added node rotation features to Personalized Weapon Sling functions. <br/> \n Carried relevant changes over to the non-MCM version (from the NMM Installer). <br/> \n Added translations (French and Japanese). <br/> \n Updated language translation package to reflect the changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.2e%20-%20Craftable%20Weapon%20Sling%20%28NMM%20Installer%29-57408-0-2e.zip?fid=1000133616&ttl=1535843388&ri=8192&rs=8192&setec=8720227b4505f534c11182f93746f2f3"
    },
    {
      "fileId": "1000154298",
      "name": "HDT Equipment v.0.2e - Craftable Weapon Sling (ApplyScript Fix)",
      "version": "0.2e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "HDT Equipment v.0.2e - Craftable Weapon Sling (ApplyScript Fix)-57408-0-2e.zip",
      "uploadedUnix": "1428193348",
      "modVersion": "0.2e",
      "virusScanUrl": "https://www.virustotal.com/file/5aba4fcd51f5fd79bed35541b8e86adef7f955621f6ff4a929c67651484f1774/analysis/1428193382/",
      "changelogHtml": " Updated all scripts. <br/> \n Custom slot selection now updates upon load <br/> \n Converted node transition features over from NetImmerse to NiOverride for Personalized Weapon Sling functions. <br/> \n Added node rotation features to Personalized Weapon Sling functions. <br/> \n Carried relevant changes over to the non-MCM version (from the NMM Installer). <br/> \n Added translations (French and Japanese). <br/> \n Updated language translation package to reflect the changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.2e%20-%20Craftable%20Weapon%20Sling%20%28ApplyScript%20Fix%29-57408-0-2e.zip?fid=1000154298&ttl=1535843388&ri=8192&rs=8192&setec=5bdda0c07d272597cad1b3acdeaf2d8e"
    },
    {
      "fileId": "1000154431",
      "name": "HDTPE Wearable Lanterns Mesh Replacement (SMIM Patch)",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "132",
      "fileName": "HDTPE Wearable Lanterns Mesh Replacement (SMIM Patch)-57408-1-0.zip",
      "uploadedUnix": "1428272208",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7e7cad041587ce67a9f3b195d1c9ac40a5a77d855538dafa5e6eb5d2d975cae7/analysis/1428272223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDTPE%20Wearable%20Lanterns%20Mesh%20Replacement%20%28SMIM%20Patch%29-57408-1-0.zip?fid=1000154431&ttl=1535843389&ri=8192&rs=8192&setec=8813aa929879328cc9ddfd1752eec0e0"
    },
    {
      "fileId": "1000156820",
      "name": "HDTPE Wearable Lanterns Mesh Replacement",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "459",
      "fileName": "HDTPE Wearable Lanterns Mesh Replacement-57408-1-2.zip",
      "uploadedUnix": "1429827655",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/2262e0a2861cd8a07f8f12b0ca6b0e37f63b58d631da438e2b942a3b3976f805/analysis/1429827667/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDTPE%20Wearable%20Lanterns%20Mesh%20Replacement-57408-1-2.zip?fid=1000156820&ttl=1535843389&ri=8192&rs=8192&setec=b647e3d12bf77f5724a37a26dea1a784"
    },
    {
      "fileId": "1000156822",
      "name": "HDTPE Wearable Lanterns Mesh Replacement (Alt. XML)",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "9",
      "fileName": "HDTPE Wearable Lanterns Mesh Replacement (Alt. XML)-57408-1-2.zip",
      "uploadedUnix": "1429827792",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e21c657df03d1be45e81ca9f6a64a301b857b0f33e1cd74779ee43a33381a824/analysis/1429827842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDTPE%20Wearable%20Lanterns%20Mesh%20Replacement%20%28Alt.%20XML%29-57408-1-2.zip?fid=1000156822&ttl=1535843390&ri=8192&rs=8192&setec=0c04dd5eff5c18195fde912d51850e46"
    },
    {
      "fileId": "1000156824",
      "name": "HDTPE Wearable Lanterns Mesh Replacement (Lighting Fix)",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "23",
      "fileName": "HDTPE Wearable Lanterns Mesh Replacement (Lighting Fix)-57408-1-2.zip",
      "uploadedUnix": "1429827877",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/c7c9a675c77d20730e5f8fc0094dddfe9eb23ee521aaa1dbcb38fa86e4a2b64a/analysis/1429827918/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDTPE%20Wearable%20Lanterns%20Mesh%20Replacement%20%28Lighting%20Fix%29-57408-1-2.zip?fid=1000156824&ttl=1535843390&ri=8192&rs=8192&setec=cad12233646a82b34f13675cb58d3713"
    },
    {
      "fileId": "1000159875",
      "name": "HDT Equipment v.0.3a - Craftable Weapon Sling (Non-Installer)",
      "version": "0.3a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "132",
      "fileName": "HDT Equipment v.0.3a - Craftable Weapon Sling (Non-Installer)-57408-0-3a.7z",
      "uploadedUnix": "1431481926",
      "modVersion": "0.3a",
      "virusScanUrl": "https://www.virustotal.com/file/2819cc01f5f4ed2022fb1774ad2f2e217a1406dd60040816e3d57b6165229b7b/analysis/1431481983/",
      "changelogHtml": " Fixed a major CTD issue with creature weapon slings\r<br />Added more sling controls (weight and visibility in inventory)\r<br />Added a requested weapon position on NMM install\r<br />Added an faction list for ignoring NPCs (no NPCs are on the list yet) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.3a%20-%20Craftable%20Weapon%20Sling%20%28Non-Installer%29-57408-0-3a.7z?fid=1000159875&ttl=1535843391&ri=8192&rs=8192&setec=cf765455b3617c66ca3b89c357d7cffe"
    },
    {
      "fileId": "1000159876",
      "name": "HDT Equipment v.0.3a - Craftable Weapon Sling (NMM-Installer)",
      "version": "0.3a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5159",
      "fileName": "HDT Equipment v.0.3a - Craftable Weapon Sling (NMM-Installer)-57408-0-3a.7z",
      "uploadedUnix": "1431482084",
      "modVersion": "0.3a",
      "virusScanUrl": "https://www.virustotal.com/file/12d402f294293a4f93eb7859d34d17c9578035a21b16472dc3a58b90f49afc33/analysis/1431482104/",
      "changelogHtml": " Fixed a major CTD issue with creature weapon slings\r<br />Added more sling controls (weight and visibility in inventory)\r<br />Added a requested weapon position on NMM install\r<br />Added an faction list for ignoring NPCs (no NPCs are on the list yet) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.3a%20-%20Craftable%20Weapon%20Sling%20%28NMM-Installer%29-57408-0-3a.7z?fid=1000159876&ttl=1535843391&ri=8192&rs=8192&setec=6a60cbfd06599e655318f6145941b61e"
    },
    {
      "fileId": "1000159878",
      "name": "HDT Equipment v.0.3a - Craftable Weapon Sling (Translation Package)",
      "version": "0.3a",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "49",
      "fileName": "HDT Equipment v.0.3a - Craftable Weapon Sling (Translation Package)-57408-0-3a.zip",
      "uploadedUnix": "1431482336",
      "modVersion": "0.3a",
      "virusScanUrl": "https://www.virustotal.com/file/d0779a54848e628d82baa173e621dbdb1c3a08bab661361ad623b462169edb36/analysis/1431482343/",
      "changelogHtml": " Fixed a major CTD issue with creature weapon slings\r<br />Added more sling controls (weight and visibility in inventory)\r<br />Added a requested weapon position on NMM install\r<br />Added an faction list for ignoring NPCs (no NPCs are on the list yet) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.3a%20-%20Craftable%20Weapon%20Sling%20%28Translation%20Package%29-57408-0-3a.zip?fid=1000159878&ttl=1535843392&ri=8192&rs=8192&setec=3238e40cabd8e77d0aa964dfc7d86a02"
    },
    {
      "fileId": "1000160540",
      "name": "HDT Equipment v.0.3b - Craftable Weapon Sling (NMM-Installer)",
      "version": "0.3b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5192",
      "fileName": "HDT Equipment v.0.3b - Craftable Weapon Sling (NMM-Installer)-57408-0-3b.7z",
      "uploadedUnix": "1431897060",
      "modVersion": "0.3b",
      "virusScanUrl": "https://www.virustotal.com/file/8ebc47b704a799f281515dbd6d7731b76a43dbdb8a4675f40b5bbde9db463293/analysis/1431897124/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HDT%20Equipment%20v.0.3b%20-%20Craftable%20Weapon%20Sling%20%28NMM-Installer%29-57408-0-3b.7z?fid=1000160540&ttl=1535843392&ri=8192&rs=8192&setec=fae7d70cba7bf296f31f296eff4492c3"
    }
  ]
}