{
  "modId": 57414.0,
  "modName": "craftable children clothes and linen wrap",
  "summary": "HEARTHFIRE REQUIRED&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />this lets you craft children&#39;s clothes from linen and some more ingredients, and linen wrap from straw (they didnt have flax straw, but let&#39;s pretend they&#39;re the same)",
  "descriptionHtml": "REQUIRES HEARTHFIRE&#33; \r<br />this mod if for those proud skyrim parents out there that don&#39;t want to buy clothes from the jerks at radiant raiment, and want to make their own clothes for their kids. \r<br />\r<br />you can craft linen wrap from straw under the tanning rack. 5 straw = 1 wrap. i didn&#39;t want to add a new item named flax straw, or a new plant called flax, or make linen craftable from tundra cotton cause that&#39;s just absurd&#33; \r<br />\r<br />also you can craft clothes for your daughter and/ or son: each clothes needs 1 linen wrap, a few leather strips, 5 tundra cotton, and some more ingredients to give it the color: example, boy&#39;s blue clothes requires the mentioned materials and 2 blue mountain flowers. red clothes require creep cluster, green requires grass pod from spiky grass, grey from void salts, and yellow from dragon&#39;s tongue, and 1 blue mountain flower for the blue pants/dress. \r<br />all craftable at tanning rack. \r<br />\r<br />i really recommend you use this mod with dynamic things since it lets you harvest straw from hay piles all around skyrim. link here: http://www.nexusmods.com/skyrim/mods/32448/?\r<br />\r<br />again this requires hearthfire. \r<br />\r<br />\r<br />version 2: i added a version using stroti&#39;s spinning wheel resource, where you can make the linen wraps from straw there. everything else is still made at a tanning rack. the spinning wheel itself is put in several locations throughout skyrim, mostly farm houses. also put some in houses i thought should have them, like radiant raiment, house gray-mane, etc. \r<br />- on a personal note, i am not proud of this &#34;update.&#34; spinning wheels are not in skyrim lore, let alone viking lore. vikings used spindles and hand.... forget it. this is skyrim. they have frickin crossbows for talos&#39; sake&#33; vikings didnt use crossbows. yea forget it, just download and enjoy, i dun care anymore. \r<br />and no, i am not adding anything new to the game, or making new items craftable at the wheel, like sheep&#39;s wool or cotton or whatever. yes i know i could do something with the tundra cotton and goat hide in the game to make clothes, but honestly i tried implementing a loom in the game with my craftable clothes mod. THERE&#39;S NO GOOD RESOURCE for the loom&#33; if someone finds a resource for the loom, plz tell me, i really dont like how clothes are craftable at a tanning rack. IT&#39;S A TANNING RACK&#33; NOT A LOOM&#33; \r<br />\r<br />i mean this adds a spinning wheel , so why not add a loom too? well too bad&#33; unless someone finds, or makes, a loom resource and tells me, we all gonna have to pretend that a tanning rack is a loom. &gt;...&lt;\r<br />\r<br />credit goes to stroti for his spinning wheel resource.",
  "categoryId": "60",
  "version": "2",
  "author": "paulhanna",
  "createdUnix": "1408814184",
  "updatedUnix": "1433272408",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123446",
      "name": "craftable hearthfire child clothes and linen wrap",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "craftable hearthfire child clothes and linen wrap-57414-1.rar",
      "uploadedUnix": "1408814178",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6fb1789b6a325c3e67093e3b38028ba6de2cd0d3db269e69edffacff97f5bbce/analysis/1408814042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/craftable%20hearthfire%20child%20clothes%20and%20linen%20wrap-57414-1.rar?fid=1000123446&ttl=1535843402&ri=8192&rs=8192&setec=d8b54e8ebdb74d8167abae9e73937a62"
    },
    {
      "fileId": "1000162726",
      "name": "new spinning wheel",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1330",
      "fileName": "new spinning wheel-57414-2.rar",
      "uploadedUnix": "1433272408",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/63584bb10270280b77f47c7f992f6d7b176eaabe6eea0a70a561851d2f24e2d3/analysis/1433272443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/new%20spinning%20wheel-57414-2.rar?fid=1000162726&ttl=1535843403&ri=8192&rs=8192&setec=276271b05dd7710f0cfb79c3296e423f"
    }
  ]
}