{
  "modId": 57439.0,
  "modName": "Grn&#39;Darsh Ironbeard Follower for Skyrim",
  "summary": "Adds a new, protected Half Orc, Half Nord warrior follower to the Palace of Kings in Windhelm complete with his own backstory.",
  "descriptionHtml": "[u][size=4][b]Off-topic, but ﻿if you could, sign my friends petition[[/b][url=https://www.change.org/p/bethesda-softworks-better-optimize-your-games]Here[/url]﻿][/size]\r<br />\r<br />[size=5]~~~~~DESCRIPTION﻿~~~~~[/size][/u]\r<br />This mod adds a semi lore-friendly protected(Can only be killed by you)Half Orc Half Nord warrior follower into the game into the windhelm palace of kings. He will level with the Dragonborn until the Dragonborn reaches Level 50. If the Dragonborn reaches level 60 for example Grn&#39;Darsh will remain at level 50.\r<br />\r<br />The mod was made by me with some additonal help by my friend Mehz/countofanvil with some additonal lore help\r<br />\r<br />[b][size=5][u]~~~~~BACKSTORY(It&#39;s somewhat long)﻿~~~~~[/u][/size]\r<br />[/b]Grn&#39;Darsh Ironbeard was born from a Lady Orcish Shield-Maiden of Orsinium and a Nordic Barbarian of Skyrim Which makes him Half Orc Half Nord as well as giving a whiteish tone to his skin. Despite their severe difference in race they still loved each other. Amongst a night of curiosity Grn&#39;Darsh was born in Orsinium, the capital of the orc race in High Rock. \r<br />\r<br />He lived there until he was 10, Old enough to fight he as well as his mother and father left orsinium and began a new life in Bruma, Cyrodill.He spent most of his life in Bruma. \r<br />\r<br />He got along well with the locals and the count, and even became a mercanary in the Fighter&#39;s Guild. He helped take out several bandit camps for the guild although he eventually left due to a lack of interest. When the Thalmor ravaged cyrodill and raided Bruma they killed his mother and father. \r<br />\r<br />Which forged his strong hatred towards the thalmor. During the war he fought as hard as he could to save Bravil. \r<br />\r<br />He killed several Thalmor including Commanders.After the war where he suffered slight damage And ended up crossing the borders of Cyrodill and Skyrim During his time in skyrim he was loyal to the greybeards long enough to learn one shout. Due to impaitence he left the order and ended up Joining the Companions of Whiterun. Spending most of his time in the group until he was banished to several arguments with other companions, as well as his vicousness.\r<br />\r<br />[size=2]After being banished from the Companions of Whiterun,He moved to Windhelm to support the claimant of Ulfric Stormcloack and become loyal to him. Making him a loyal warrior of the Stormcloacks(Hence why he is found in the Palace of Kings)[/size]﻿\r<br />[u][b][size=5]~~~~~HOW IS IT LORE FRIENDLY?~~~~~[/size]\r<br />\r<br />[/b][/u]For anyone seeing this and going: &#34;This isin&#39;t lore friendly at all&#33;&#34;\r<br />The thought of a Half Orc Half Nord warrior may seem completley against Lore although here&#39;s evidence of stuff like this happening in TES Lore/Games:\r<br />\r<br />Pelagius III from Lore and Skyrim is Half Imperial,Half Altmer\r<br />The Pale Orc from Oblivion is Half Orc,Half Imperial\r<br />\r<br />Race marriges like this have happened before, making this mod, in ways &#34;Lore-Friendly&#34;\r<br />\r<br />\r<br />﻿﻿[size=5][u]~~~~~INSTALLATION~~~~~[/u][/size]\r<br />\r<br />[size=2][size=2]For anyone wondering how to install the mod it is a fairly simple installation process.\r<br />\r<br />All that is required is to drag the .esp and the &#34;Meshes&#34; and &#34;Textures&#34; in the mod&#39;s.zip file and run skyrim, Click &#34;Data&#34; and tick the mod&#39;s .esp(GrnDarsh Follower.esp)\r<br />\r<br />\r<br />[/size][/size][size=5][u]~~~~~QUESTIONS AND ANSWERS~~~~[/u]~[/size]\r<br />\r<br />[size=2][u]Q.Why does the follower have the Grey Face Bug?[/u]\r<br />A.Grn&#39;Darsh Ironbeard is suppose to be Grey/White due to him being a cross breed of two different races. In his default outfit the Grey Face bug is hardly noticeable, It&#39;s really only an issue if you equip him in different gear(Which shouldn&#39;t be needed due to his stats)\r<br />\r<br />﻿[/size][u]Q.He died, What do i do&#33;?\r<br />﻿[/u]A.Grn&#39;Darsh Ironbeard is a protected character. Meaning nothing i mean NOTHING can kill him except the player. If he does die press &#34;~&#34; on your keyboard and type in the command &#34;resurrect&#34;\r<br />\r<br />\r<br />[u]﻿﻿﻿[size=5]~~~~~THANKS FOR READING~~~~~[/size][/u]\r<br />Thank you for reading the post until this point, if you like the mod be sure to leave an endorsement for more content in the future",
  "categoryId": "96",
  "version": "1.0",
  "author": "Japanga",
  "createdUnix": "1408853247",
  "updatedUnix": "1408895366",
  "containsAdultContent": false,
  "uploadedBy": "Japanga",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123675",
      "name": "Grn&#39;Darsh Ironbeard Follower Mod v1.0 Fixed Greyface",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "305",
      "fileName": "Grn'Darsh Ironbeard Follower Mod v1.0 Fixed Greyface-57439-1-0.zip",
      "uploadedUnix": "1408895366",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/15c528735c9a1dced04692be963487470049eb85138cac4510317b2e54034ac0/analysis/1408895463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grn%27Darsh%20Ironbeard%20Follower%20Mod%20v1.0%20Fixed%20Greyface-57439-1-0.zip?fid=1000123675&ttl=1535843455&ri=8192&rs=8192&setec=c4440bedbe303c3e49259c1a9fdbc49d"
    }
  ]
}