{
  "modId": 57445.0,
  "modName": "General Goods Merchants Everywhere Beta",
  "summary": "I always found it irritating, particularly when traveling on foot, that general goods merchants were so few and far between. So, limited modding experience in hand, I set out to change that.",
  "descriptionHtml": "[size=3][b]VERSION 0.8 RELEASE: [/b][/size]\r<br />[list][*]There is now a version of this mod that does not use ApachiiHair. This should solve all problems with the game crashing because you&#39;re missing the proper hair files. \r<br />[/*]\r<br />[*]Lysene now has a shack near Anise&#39;s Cabin. You can&#39;t get inside yet. I have plans for that. The inside is still a bit wonky, so I wouldn&#39;t suggest trying to explore.[/*]\r<br />[*][size=2]I&#39;ve run into Lysene during my travels in Skyrim, so she&#39;s definitely out there&#33; If you can&#39;t find her and you want her, open up the console and type: help &#34;lysene&#34; - you&#39;ll be able to find her NPC code. Then use the command player.placeatme (code). If I&#39;m not mistaken, that should bring her directly to you.[/size][/*]\r<br />[/list]\r<br />I always found it irritating, particularly when traveling on foot, that general goods merchants were so few and far between. So, limited modding experience in hand, I set out to change that. This mod adds several general goods, or &#34;pawnbroker&#34; merchants, to Skyrim, in areas that didn&#39;t have them before. The goal of this mod is to create more convenience for the player while trying not to break lore too much. \r<br />\r<br />The following merchants have been added to Skyrim:\r<br />[list][*][size=2]Ellie, a Redguard woman who runs the shop &#34;Ellie&#39;s Eccentricities,&#34; outside of Dawnstar, (and family: a husband, Arden, and a son, Brinn)[/size][/*]\r<br />[*][size=2]Vorthir, a male Wood Elf who manages &#34;Swamp&#39;s Edge Supplies&#34; in Morthal next to the Jarl&#39;s Longhouse (and family: a sister, Vera)[/size][/*]\r<br />[*][size=2]Katya, a Nord woman who lives and works out of a small shop next to the inn in Ivarstead (and dog: Patch)[/size][/*]\r<br />[*][size=2]Walks-On-Ice, a female Argonian who stays in the Frostfruit Inn in Rorikstead[/size][/*]\r<br />[*][size=2]J&#39;zira, a male Khajiit who sells caravan merchandise from the Four Shields Tavern in Dragon Bridge[/size][/*]\r<br />[*][size=2]Francis Bonnefoy, a vampire Breton man (and fence) who hangs out outside of Enmon&#39;s house in Karthwasten[/size][/*]\r<br />[*][size=2]Lysene the Wandering Merchant, an Imperial woman who (theoretically) wanders Skyrim looking for customers[/size][/*]\r<br />[/list][size=2]\r<br />\r<br />[b]WORD OF CAUTION:[/b] As I said, I only partially know what I&#39;m doing, so there may very well be errors. It all runs pretty smoothly in my game, but it&#39;s entirely possible that I&#39;ve screwed something up, somewhere, and that I won&#39;t know until someone else plays with it. If you find any errors, bugs, or conflicts with other mods (there shouldn&#39;t be any unless you&#39;ve done something like overhauled the area where they live or something), let me know. I can&#39;t guarantee I can fix them, so suggestions are always welcome, as well.\r<br />\r<br />[/size]This mod is not finished, as I have a lot of other silly crap I want to add, and I&#39;m thinking about putting in a few more merchants. Let me know what you think, and I hope you enjoy convenient pawnbrokers everywhere as much as I do&#33;",
  "categoryId": "69",
  "version": "0.8",
  "author": "Clockwork Grapefruit",
  "createdUnix": "1408869725",
  "updatedUnix": "1410615762",
  "containsAdultContent": false,
  "uploadedBy": "aportraitfordorian",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126692",
      "name": "General Goods Merchants Everywhere - No ApachiiHair",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "General Goods Merchants Everywhere - No ApachiiHair-57445-0-8.7z",
      "uploadedUnix": "1410615689",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/26093515025a58d26d2ccf170d513482cc2369888a085773ef73437c9d97523b/analysis/1410615782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Goods%20Merchants%20Everywhere%20-%20No%20ApachiiHair-57445-0-8.7z?fid=1000126692&ttl=1535843464&ri=8192&rs=8192&setec=0431f70f767f829e8a4e7a7ac5ec4f8d"
    },
    {
      "fileId": "1000126693",
      "name": "General Goods Merchants Everywhere",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "291",
      "fileName": "General Goods Merchants Everywhere-57445-0-8.7z",
      "uploadedUnix": "1410615762",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/66babef09c543fcb5d256d269576ebd095f3d4bbf7162564996f9cc3717829e8/analysis/1410615842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Goods%20Merchants%20Everywhere-57445-0-8.7z?fid=1000126693&ttl=1535843465&ri=8192&rs=8192&setec=451babe8815590cbd9293a68295eb86c"
    }
  ]
}