{
  "modId": 57455.0,
  "modName": "Toggleable Eclipse (WORKING)",
  "summary": "Simple mod that allows player to control Dawnguard Eclipse.",
  "descriptionHtml": "Hello guys&#33;\r<br />\r<br />At first I have to sorry for any language mistakes I made in description ;)\r<br />\r<br />[b][i][color=#ff0000]Mod requires the latest version of Skyrim and Dawnguard of course.\r<br />[/color][/i][/b][color=#ff0000]For now it doesn&#39;t require to have DG finished. I&#39;ll change it one day&#33; [/color]\r<br />\r<br />Ok, so after trying a few mods that should give player power to toggle the Eclipse I was quite angry when none of them worked properly. After that I made my own that finally does what it had to - allow player end the Thyrany of the Sun or bring sun back whenever he wants to.\r<br />\r<br />For now mod just adds a spellbook with a lesser power near the Harkon&#39;s coffin. Use the power during the sunny (or cloudy, lol) day and you&#39;ll have a beautiful Eclipse. Use it when Eclipse is on the sky and it&#39;ll end it. Mod offers Eclipse with all its visual effects, removing sun weaknesses and making vampire attacks - in mechanic it works exactly as Auriel&#39;s Bow.\r<br />\r<br />I&#39;ll improve my mod by adding some lore-friendly stuff like quest or something (and better description ^^) if I see people are interested in this mod. So any feedback or reported bugs would be nice.\r<br />\r<br />So, hope you enjoy it and let the darkness rule the world&#33; ;]\r<br />\r<br />P.S.\r<br />You can cast it in interiors and everything will be ok. I am not sure how it will work when cast between 7 PM and 6 AM.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Gestru",
  "createdUnix": "1408881881",
  "updatedUnix": "1408899308",
  "containsAdultContent": false,
  "uploadedBy": "VeJot9",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123706",
      "name": "Eclipse Power",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Eclipse Power-57455-1-0.7z",
      "uploadedUnix": "1408899308",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6fa0f8263d3e57a4cf52f0ad312657a27ce164ae67265bfedb854842f3864c68/analysis/1408899482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eclipse%20Power-57455-1-0.7z?fid=1000123706&ttl=1535843478&ri=8192&rs=8192&setec=a330bc31f711d30af6956dbbaa0bf9ee"
    }
  ]
}