{
  "modId": 57472.0,
  "modName": "Playable Time Lord Race Beta",
  "summary": "Adds a playable Time Lord race, from the show Doctor Who, to Skyrim.",
  "descriptionHtml": "Adds a playable Time Lord race, from the show Doctor Who, to Skyrim. Obviously, this mod is not in the slightest bit lore-friendly, but it sure is a lot of fun.\r<br />\r<br />Time Lords are a humanoid race of aliens from the planet Gallifrey. They have the following abilities:\r<br />[list][*][size=2]Shock Resistance - Time Lord blood grants a 50% resistance to lightning-based magic[/size][/*]\r<br />[*][size=2]Regeneration - Fully restores health and boosts health regeneration for a short time[/size][/*]\r<br />[*][size=2]Mastery of Time - Time slows at the Time Lord&#39;s command for a brief period[/size][/*]\r<br />[*][size=2]+10 starting Magicka[/size][/*]\r<br />[*][size=2]Naturally slightly higher rates of health, stamina, and magicka - particularly health (two hearts and all that, you know)[/size][/*]\r<br />[*][size=2]Gifted in Restoration magic and Lockpicking (+10 starting skill), with minor gifts in Illusion, Speech, Alchemy, Alteration, and Destruction (+5 starting skill)[/size][/*]\r<br />[/list][size=2]\r<br />The Time Lords are slightly overpowered because... well, they&#39;re Time Lords, but I tried not to make them too godmode-y and more like a race that was more or less acceptable to place beside the others. Also, TIME LORDS DO NOT YET HAVE FULL VAMPIRE FUNCTIONALITY. Please do not try to play a vampire Time Lord at this time, because there&#39;s a 99.9999% chance it won&#39;t work. I&#39;m planning on providing for that at a later date.\r<br />\r<br />Every Time Lord also comes equipped with a Sonic Staff, which has full sonic sound effects. :) It has a Magelight/Calm enchantment on it because I wasn&#39;t sure what else to do with it. Might change it later. I can&#39;t make it open locks yet, unfortunately - you&#39;ll just have to rely on your natural Time Lord lock talents for that.\r<br />\r<br />[/size]There are far superior TARDIS mods out there than anything I could ever hope to do, so if you really want the Doctor Who feel, I&#39;d suggest you go grab one of those. There are two on the Nexus right now, I believe.\r<br />\r<br />[b]WORD OF CAUTION:[/b] As I&#39;ve stated previously, I don&#39;t completely know what I&#39;m doing. As always, there may be bugs that I don&#39;t know how to fix. I&#39;m not sure how Time Lords will interact with the rest of the world entirely yet, which is why this is very much a beta. Please keep that in mind&#33;",
  "categoryId": "34",
  "version": "0.5",
  "author": "Clockwork Grapefruit",
  "createdUnix": "1408912279",
  "updatedUnix": "1408912279",
  "containsAdultContent": false,
  "uploadedBy": "aportraitfordorian",
  "primaryFile": null,
  "files": []
}