{
  "modId": 57485.0,
  "modName": "Refurb&#39;s Animal Fat Mod",
  "summary": "Changes Troll Fat to Animal Fat and broadens the types of creatures that yield it. Works with mods that require Troll Fat as an ingredient&#33;",
  "descriptionHtml": "[center][img]http://i.imgur.com/oBj21fE.png[/img][img]http://i.imgur.com/ZK1qCBE.png[/img][/center][font=Trebuchet MS][size=3]So one night a friend lamented the relative scarcity of troll fat[/size][/font][size=3] which he needed to process animal bits for a taxidermy mod, and we began wondering on why it is that only trolls yield fat while animals like deer, horkers, and mammoths don&#39;t in spite of it being an important and useful substance in terms of living the life of a huntsman, to say nothing of the fact that animals in a place like Skyrim certainly would have [i]some[/i] fat stored up. He wondered if there was a way to increase the availability of troll fat without affecting [url=http://www.nexusmods.com/skyrim/mods/19803/?]Trophy Hunting[/url]&#39;s functionality, and thus this mod was conceived. It&#39;s incredibly simple, I know, perhaps even a bit silly to some. But it&#39;s posted on the chance that someone else might find use of it.[/size]\r<br />\r<br />[img]http://i.imgur.com/2enbe4b.png[/img]\r<br />\r<br />[size=3]This is a very small and simple mod that changes the name of &#34;Troll Fat&#34; to read &#34;Animal Fat&#34;, and places it on the loot lists for other creatures that would viably yield fat. That&#39;s all&#33; It functions the same as troll fat, has the same alchemical properties, and is recognized even by mod-added recipes as troll fat. The only differences are the name and the increased availability.\r<br />\r<br />So now instead of trolls[/size][size=3] hogging all the fat to themselves[/size],[size=3] you can now find fat on:\r<br />[/size][list][*][size=3]All deer (1-2)[/size]\r<br />[/*][*][size=3]All bears (2-3)[/size]\r<br />[/*][*][size=3]Horkers (2-6)[/size][/*]\r<br />[*][size=3]Mammoths (3-9)[/size][/*]\r<br />[/list]\r<br />[size=3]Trolls retain their usual guaranteed drop of one fat per kill, but all added animals only have a 60% chance to yield fat. Why not 100%? For one, some animals will simply be lean. For another, if you&#39;re playing a hunter character, you can very quickly end up with more fat than is practical. Tweaks may yet be made, but likely only in the downward direction, and likely in the form of optional files. Not sure.[/size]\r<br />\r<br />[size=3]It also bears mentioning that this change will not affect fetch quests that call for troll fat. Actors will still of course [i]say[/i] troll fat, but the quest log will reflect the change in name.[/size]\r<br />\r<br />[img]http://i.imgur.com/7V3syag.png[/img]\r<br />\r<br />[size=3]This mod will be fundamentally incompatible with any mod that alters the leveled lists of deer, bears, mammoths, and horkers. You&#39;ll either need to compromise via placing this mod last in your load order so that it takes precedence over the other mod, or work some magic with Wrye Bash.\r<br />\r<br />[u][b][color=#f6b26b]Hunterborn Users&#33;\r<br />[/color][/b][/u]This mod is compatible with Hunterborn, but I am told you need to select the manual loot option or else you will not pick up any fat, should it have appeared on the drop.\r<br />\r<br />And again, this mod should (barring any oddities) work with mods that add recipes requiring troll fat as an ingredient. It&#39;s just going to ask for animal fat now.\r<br />\r<br />If you run into any issues, please let me know.\r<br />\r<br />[img]http://i.imgur.com/6YImxVf.png[/img][/size]\r<br />\r<br />[size=3]Use the mod manager of your choice or extract the file into your Skyrim/Data folder.\r<br />\r<br />Uninstallation should be relatively safe. There&#39;s no scripts to worry about. Just before you remove the file make sure your character is in a place like a house, away from any deer/bear/mammoth/horker carcasses that could possibly have this on their person. At least I assume you don&#39;t keep unprocessed carcasses in your house because that would be weeeeeeird. Save your game in that little safe place, then remove RM_AnimalFat.esp from your Data folder, and you ought to be good to go.[/size]\r<br />\r<br />[img]http://i.imgur.com/fDEzsUE.png[/img]\r<br />[font=Trebuchet MS][size=3]25/08/14\r<br />v1.12 - Corrected issue which could cause mammoths and horkers to drop less than their minimum guaranteed amount.[/size][/font]\r<br />\r<br />\r<br />[img]http://i.imgur.com/aHvZCIo.png[/img]\r<br />\r<br />[size=3]As usual, this file is yours to do with as you please. Especially in this case you really don&#39;t need permission or to notify me if you make changes to this you wish to publish. If it&#39;s a patch or whatever, I&#39;ll be happy to host it here on this page or post a link to your page. \r<br />\r<br />\r<br />[img]http://i.imgur.com/pbolcG4.png[/img][/size][size=3]\r<br />\r<br />Credit of course goes to Bethesda for graciously allowing us to do weird and terrible things with their intellectual property.\r<br />\r<br />Unending thanks goes to Kursan for the idea, the testing, the screenshots, and a whole heckuvalot of guidance and feedback&#33;[/size]",
  "categoryId": "94",
  "version": "1.12",
  "author": "RefurbMadness",
  "createdUnix": "1408933428",
  "updatedUnix": "1409022655",
  "containsAdultContent": false,
  "uploadedBy": "RefurbMadness",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123792",
      "name": "Troll Fat into Animal Fat",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Troll Fat into Animal Fat-57485-1-1.7z",
      "uploadedUnix": "1408933402",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/018093179a8357903b774d5436a4928982a9e7bc2bfa5fda6cc613fb6026ff5f/analysis/1408933502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Troll%20Fat%20into%20Animal%20Fat-57485-1-1.7z?fid=1000123792&ttl=1535843534&ri=8192&rs=8192&setec=813a648a2ffd6b5921d2d52927498b53"
    },
    {
      "fileId": "1000123945",
      "name": "Troll Fat into Animal Fat 1-12",
      "version": "1.12",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Troll Fat into Animal Fat 1-12-57485-1-12.7z",
      "uploadedUnix": "1409022655",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/115f27c13da40a7493049b6aa93e286f521a8ee8cc8d5a5885457f81613565e5/analysis/1409022721/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Troll%20Fat%20into%20Animal%20Fat%201-12-57485-1-12.7z?fid=1000123945&ttl=1535843535&ri=8192&rs=8192&setec=2591909b4d45033e2b03a62727d9015d"
    }
  ]
}