{
  "modId": 57509.0,
  "modName": "WIP Ancient Nord Follower Heddvild Mul-Jah",
  "summary": "This is Heddvild Mul-Jah (Strong-Will) she is part of a tribe of Nords who still follow the ancient ways and speak the ancinet language of the dragons (subtitles in English so you can understand her). She is incomplete at the moment as she has no dialogue, this is where I would be grateful of help, read full description for details.",
  "descriptionHtml": "[color=#ff0000]This is my first attempt at usuing the creation kit and the first mod I have ever attempted to make.[/color]\r<br />[color=#ff0000]\r<br />[/color]\r<br />This mod adds a custom NPC called Heddvild Mul-Jah to the Bannered Mare in Whiterun, I wanted to create a follower who speaks the ancient language because as far as I know this is unique as no one has done this before (not that I&#39;ve seen anyway). I also gave her a background to fit her in with the lore; I also added the fact she has a specific power, which allows her to be understood by those with ancient blood who dont speak the language (the Dragonborn) that was developed by her tribe a long time ago.\r<br />\r<br />Screenshots will be uploaded when I release the full version (if I ever do).\r<br />\r<br />[color=#ff0000]This is a WIP[/color] as she has [u][b]NO[/b][/u] custom dialogue as of yet, I have only posted this as I need help form an experienced modder on how to actually add my own voice to the NPC. \r<br />\r<br />[color=#ffff00][size=3]LORE:[/size][/color]\r<br />\r<br />Heddvild was a member of a small tribe of Nords who have remained true to the ancient ways, they also keep the ancient dragon language alive as this is the one they speak. Heddvild has left this group as her parents have died, and she wants to venture out and explore her homeland. Her tribe developed a power which allows those with the ancient blood (Dragonborn has ancient dragon blood technically) understand them, which is why the Dragonborn can understand the dragon language when she speaks it, but they cant understand the dragons or draugr who speak this language as neither of them have this power.\r<br />\r<br />[color=#ffff00][size=3]DETAILS OF THIS MOD:[/size][/color]\r<br />\r<br />Heddvild will be heard speaking the ancient language (future update hopefully if I get assistance); though you won&#39;t have to know the language to understand her, there will be subtitles in English and the diaglogue options will all be in English.\r<br />\r<br />[color=#ffff00][size=3]FUTURE PLANS:[/size][/color]\r<br />\r<br />&bull; Fully custom voice acted with many dialogue options.\r<br />&bull; Ability to ask to follow.\r<br />&bull; Ability to marry.\r<br />\r<br />I would really appreciate help with this because I have no idea how to add my voice to her or create any dialogue options, I&#39;m new to the creation kit and this is the first time I&#39;ve used it. I&#39;ve looked at tutorials but I&#39;ve just been left confused.",
  "categoryId": "96",
  "version": "0.1",
  "author": "Charlotte",
  "createdUnix": "1408989184",
  "updatedUnix": "1408989178",
  "containsAdultContent": false,
  "uploadedBy": "charlyxx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123888",
      "name": "Heddvild Mul-Jah",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Heddvild Mul-Jah-57509-0-1.zip",
      "uploadedUnix": "1408989178",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/513a4026d8eeb8d74cabc4d0e652e4a8090619eeed0ec515283efb9014cdc453/analysis/1408989243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heddvild%20Mul-Jah-57509-0-1.zip?fid=1000123888&ttl=1535843566&ri=8192&rs=8192&setec=7f6ac5084eaca3203aecc5e0cbdf3469"
    }
  ]
}