{
  "modId": 57508.0,
  "modName": "Personalized Music - HT&#39;s Unofficial HearthFires Add-on",
  "summary": "Allows you to personalize the music in the HearthFires homes. An unofficial stand-alone addon to the great Personalized Music mod, adding compatibility for the player homes added by HearthFires.",
  "descriptionHtml": "[center]Personalized Music - HT&#39;s Unofficial HearthFires Add-on[/center]\r<br />[u][b]Description:[/b][/u]\r<br />It allows you to personalize the music you hear in the player homes added by HearthFires. I simply used the same techniques used by the author of [url=www.nexusmods.com/skyrim/mods/13286]Personalized Music[/url] ([url=http://www.nexusmods.com/skyrim/users/680166]No_Aardvarks_Allowed[/url]) and his file structure for compatibility, but I didn&#39;t include or use any part of his mod at all.\r<br />\r<br />\r<br />[u][b]Requirements:[/b][/u]\r<br />HearthFires.esm\r<br />\r<br />This mod is compatible with Personalized Music (it will use the Player Homes - All music if you have any in that folder), but does not require it.\r<br />\r<br />\r<br />[u][b]Installation:[/b][/u]\r<br />If you have [url=http://www.nexusmods.com/skyrim/mods/13286]Personalized Music[/url] already, it follows the same installation procedure. If you don&#39;t, it&#39;s quite simple:\r<br />\r<br />Manual:\r<br />1. Unzip the contents of the [url=http://www.7-zip.org/].7z archive[/url] into your Data folder.\r<br />\r<br />2. Make sure the folders are also extracted. To know if you did it right, there should be a Music folder inside your Data folder with a Player Homes subfolder inside it, containing 4 subfolders:\r<br />Heljarchen\r<br />Lakeview\r<br />Player Homes - All\r<br />Windstad\r<br />\r<br />3. Add your music into the folders, following the filename formats described in the .txt files inside each folder.\r<br />\r<br />4. Activate the .esp and play the game&#33;\r<br />\r<br />NMM should be able to handle steps 1 and 2 properly. You still need to follow steps 3 and 4 manually to add your music to the folders.\r<br />\r<br />\r<br />[u][b]Load Order:[/b][/u]\r<br />Load it after any mod that modifies the HearthFires homes.\r<br />\r<br />\r<br />[u][b]Adding Music:[/b][/u]\r<br />Within each of the folders that come in the archive is a small .txt file, which is sort of a readme. It tells you the number of tracks you can add and what file names to use for the game to recognize them.\r<br />\r<br />[color=#ff0000]* Please be careful with spelling as it matters. Copy the file names carefully as typos will make the game not read your music. Nothing bad will happen if you make spelling errors with the file name. You just won&#39;t hear any music.[/color]\r<br />\r<br />File formats supported are .xwm and .wav. However, I do not recommend using .wav files for music, especially if you&#39;re like me and you like to put in songs that are 4 minutes long or more. Those are usually 30 MB or more per file depending on quality, which means you&#39;re pushing your game closer to its RAM limit.\r<br />\r<br />I highly recommend converting to the .xwm format because it&#39;s compact and easier for the game to read. There are a lot of tools that can do this. I use [url=http://www.nexusmods.com/skyrim/mods/8303]Skyrim Audio Converter[/url] and have had no problems with it except my PC going nuts when I try to convert too many files at once with the 64-bit version. I generally just convert 10 at a time or less.\r<br />\r<br />This shares the same Player Homes - All folder that comes with Personalized Music (if you install the Player Homes module anyway), for compatibility. This way you can also hear the songs you put in there.\r<br />\r<br />\r<br />[u][b]Troubleshooting/FAQ:[/b][/u]\r<br />[color=#dbb0a7][b][i]Game crashes at startup&#33;[/i][/b][/color]\r<br />[color=#d9ead3]- Make sure you have HearthFires.esm activated, and this loads after that.[/color]\r<br />\r<br />[color=#dbb0a7][b][i]Game crashes after a while&#33;[/i][/b][/color]\r<br />[color=#d9ead3]- Many possible reasons for that, but with context to this mod, you may be running low on RAM. As far as I know, the game can only use 3.1 GB of RAM regardless of how much system memory you have installed on your machine, so if you have too many music files loaded, it contributes to RAM usage.[/color]\r<br />\r<br />[color=#dbb0a7][b][i]I don&#39;t hear any music&#33;[/i][/b][/color]\r<br />[color=#d9ead3]- Check your volume (yes this is a common problem even with the original Personalized Music).\r<br />- Make sure your files are named properly. Make sure you don&#39;t have a MMLakeview01.wav.wav (due to Windows hiding known file extensions).\r<br />- Make sure your files are the right format. Renaming an .mp3 file into MMLakeview.xwm won&#39;t work. You need to convert it to the proper format.[/color]\r<br />\r<br />More troubleshooting in the readme of [url=http://www.nexusmods.com/skyrim/mods/13286]Personalized Music[/url].\r<br />\r<br />\r<br />[u][b]Permissions:[/b][/u]\r<br />You are allowed to modify this mod (such as to add more tracks, or to add conditional music), but you are not allowed to upload your modifications without my permission. Therefore all modifications are for personal use only.\r<br />\r<br />You are allowed to copy the techniques used in this mod to make your own version of this mod. If you copy the techniques without actually using any part of my mod, you don&#39;t need my permission to upload your modifications.\r<br />\r<br />No part of this mod may be redistributed on any website or file sharing service without my permission.",
  "categoryId": "61",
  "version": "1.0",
  "author": "Hosokawa Takuya",
  "createdUnix": "1408987824",
  "updatedUnix": "1408987354",
  "containsAdultContent": false,
  "uploadedBy": "HosokawaTakuya",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000123884",
      "name": "HT HF PM",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "HT HF PM-57508-1-0.7z",
      "uploadedUnix": "1408987354",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1d722e0fa910c5549b8f9623afd6f58cfc97c44f69127b6c1b42b502d3c7be5f/analysis/1408987442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HT%20HF%20PM-57508-1-0.7z?fid=1000123884&ttl=1535843565&ri=8192&rs=8192&setec=fa907782e70ebe02f0e19f944c3d5b9d"
    }
  ]
}