{
  "modId": 57516.0,
  "modName": "Equipable Nudity",
  "summary": "This will allow you to become naked, while everyone else will have underwear.",
  "descriptionHtml": "Tired of naked corpses lying around, especially if their gender is same as yours (with some exceptions)? Install this and turn nudity in something special once again, as it was before you&#39;ve installed all those body replacers. Or perhaps you&#39;ve never used one. This is not really important. As long as you want to see the naked body when you want this and not after you loot dead NPC or encounter those fellas that love to wear belongings of their just slaughtered victims while their naked corpses lie around, this mod is for you.\r<br />\r<br />All NPC and your character as well from now on will wear underwear cloth, so no more nude bodies. \r<br />If you want undress your character you can do so, as well as you can undress your follower/spouse if you want so.\r<br />So how to undress? Easy&#33; Go to any forge and cast the rags you wear on fire. Yes, seriously. Do that. Doing this will give you special item in your inventory. By equipping this item you become undressed. So basically you are equipping nudity. :D\r<br />There are two variants of underwear. Vanilla and alternate. You can see both on screenshots.\r<br />\r<br />If you want to undress your follower, you need to force him/her to equip nudity as in vanilla game they wear only item that have higher stats for them.\r<br />So having any of the followers mods that allows you to control your follower outfit or give you full access to their belongings, including their default outfits, might be a good idea for in this case.\r<br />Here comes the brief list of mods that I&#39;ve used myself and can recommend:\r<br />[url=http://www.nexusmods.com/skyrim/mods/15524]Amazing Follower Tweaks[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14037]UFO[/url]\r<br />\r<br />If you want to undress your spouse, you need the mod that does the same for spouses.\r<br />[url=http://www.nexusmods.com/skyrim/mods/23099]Marriage Dynamic Outfits[/url] for instance.\r<br />\r<br />Mind that every mod that has undress feature from now on will not fully undress the target, but will undress to underwear instead.\r<br />\r<br />These mods are required and must be installed before:\r<br />[url=http://www.nexusmods.com/skyrim/mods/6709]DIMONIZED UNP female body[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/3421]Nude Male with Import from Roberts new vegas male[/url]\r<br />\r<br />For best visual experience I highly recommend you to use:\r<br />[url=http://www.nexusmods.com/skyrim/mods/32986]Mature skin texture and body[/url] for females.\r<br />As for males it&#39;s a bit harder, so stick with textures of mentioned above male body mod or use whatever you prefer.\r<br />\r<br />You can use any texture packs that are compatible with mods mentioned above. This mod doesn&#39;t contain any textures&#33;\r<br />\r<br />NO beast race support&#33; Means that Khajiit and Argonian will not take off their underwear. First of all because that looks sick.\r<br />\r<br />Installation: \r<br />1. Install both required mods.\r<br />2. Install this mod.\r<br />Use NMM. Overwrite everything it asks. Enjoy.\r<br />\r<br />No scripts used&#33; No custom race or edits to vanilla races. No \r<br />compatibility issues as long as you follow installation procedure. Load \r<br />order is not important. \r<br />This will not screw up your savegame in any case. At any moment you decide this mod is crap and you want to get rid of it, \r<br />just deactivate it in NMM and play as before.",
  "categoryId": "78",
  "version": "1.0",
  "author": "mluppov",
  "createdUnix": "1408994636",
  "updatedUnix": "1408994636",
  "containsAdultContent": false,
  "uploadedBy": "maximluppov",
  "primaryFile": null,
  "files": []
}