{
  "modId": 57578.0,
  "modName": "Signs of Skyrim",
  "summary": "Replacements for the shop/inn signs, plus some new ones.",
  "descriptionHtml": "Signs of Skyrim\r<br />============\r<br />by Autan Waspeez\r<br />v.1.2\r<br />\r<br />If a picture paints a thousand words, videos must do a few million&#33; I&#39;ll let these esteemed Mod Review channels introduce things.\r<br />\r<br />[youtube]ogJvVT269UQ[/youtube]\r<br />\r<br />[youtube]1kfJhrX_IhY[/youtube]\r<br />\r<br />[youtube]sL7utv4LOjo[/youtube]\r<br />\r<br />\r<br />\r<br />UPDATE 20/05/2015: EvilDeadAsh34, creator of the &#39;Mystical Illumination&#39; mod - which gave the original signs a glow to enable them to be seen at night - has performed his magic on Signs of Skyrim. So if you want these signs to shine in the dark, it&#39;s over here: [url=http://www.nexusmods.com/skyrim/mods/15664/?]Mystical Illumination for Signs of Skyrim[/url]\r<br />\r<br />&#34;SEEEE HOW IT GLOOOWWWS&#33;&#34; Yes, I just made a &#39;Hawk the Slayer&#39; reference. You&#39;re not a true fan of epic fantasy if you haven&#39;t seen that movie.\r<br />\r<br />\r<br />***********************************************************************************\r<br />\r<br />As a &#34;thank you&#34; for those who have downloaded Signs of Skyrim, and shown great patience as the inevitable quirks and bugs have come to light, I&#39;ve made a sign for Warmaiden in Whiterun, now in the Files section. It&#39;s a loose file replacer, so those with ESP problems can use it safely. There&#39;s a picture in the Images tab if you&#39;re curious.\r<br />\r<br />\r<br />DESCRIPTION\r<br />===========\r<br />\r<br />[N.B. - update available to correct the ugly texture misalignment in the Thaumaturgist&#39;s Hut sign. God, I hate UV mapping.\r<br />\r<br />\r<br />**NO LONGER REQUIRES SMIM**\r<br />\r<br />Please use 1.2 - I&#39;ve removed the need for SMIM textures, and corrected a false texture path in at least one sign. You don&#39;t want those nasty white missing textures now do you? \r<br />\r<br />N.B. THIS INCLUDES ALL CONTENT FROM MY &#39;STABLE SIGNS&#39; AND &#39;ANGELINES AROMATICS&#39; MODS, WITH SUBSTANTIAL IMPROVEMENTS.]\r<br />\r<br />Going from place to place in Skyrim, you see the difference between somewhere like, say, Whiterun compared to Windhelm or Markarth. Banners, buildings, guard uniforms. It gives  you a sense that you&#39;ve travelled, and that you&#39;re somewhere different.\r<br />\r<br />Except that the shop signs almost all look the same. Generic jellyfish-in-a-can alchemists signs; weird weighing scales for general good shops. And not a shop name in sight. Which you could understand if it was a matter of language localisation... except the inns all have written names.\r<br />\r<br />Oh yes, those Inn signs with the same clipart foaming tankard.\r<br />Numerous signs with the same puffy pseudo-Celtic font, like Beowulf meets Comic Sans.\r<br />Stables displaying signs that looked like a bored goat with a big pretzel stuck on its back.\r<br />And all on that same shabby, rotten wood background.\r<br />\r<br />It felt jarring, so I changed it.\r<br />\r<br />Now shops display their name on their sign (I apologise to my non-English speaking readers), and each shop has its own artwork. Alchemists no longer feel like the Tamriel equivalent of McDonalds.\r<br />I&#39;ve also added brand new signage for the stables at Windhelm, Markarth and Solitude, with the appropriate local feel.\r<br />\r<br />[b] YES, THIS IS ONE OF THE REASONS THE MOD USES AN .ESP [/b]\r<br />\r<br />- also because I&#39;ve made some adjustments and changes to placement of signs to give places more of their own personality.\r<br />\r<br />You WILL see wrongly positioned signs if you don&#39;t use the .ESP - if you don&#39;t want that but you don&#39;t want to use the .esp, you&#39;re just going to have to open up one of the mods you do want to keep in the Creation Kit, re-path the signs to use my meshes, then adjust their placement to best suit you. Changing stuff I didn&#39;t like is how I learned to tinker with Morrowind - get NifSkope, TES5EDIT and WryeBash and give it a try. I look forward to seeing what you come up with&#33;\r<br />\r<br />I didn&#39;t touch some signs which were decent. Bannered Mare and Sleeping Giant inns come to mind. Most signs are carved wood with maybe some burned-in touches: paint isn&#39;t easy to come by in Skyrim, and best saved for your shield. Or face.\r<br />\r<br />Please note that not all the signs are shown in the Images section: I&#39;d rather get on and release the mod than do a bunch of beauty shots. You get the general idea, and why spoil all the surprises? (that&#39;s not a way of saying &#39;go find the bugs and glitches for me&#39;, I did visit each location to check)\r<br />\r<br />Certain local themes came to mind when making this:\r<br />Riften is a town on the water in the warmest corner of Skyrim. It&#39;s damp, shabby and going to seed, so the wood of the signs is starting to grow algae and the surrounds are rusting. The Black-Briars signage is newer but comparatively cheap, the design burned onto the wood rather than hand carved like most other signs. The Bee and Barb is run by Argonians who hail from Black Marsh, so the art style looks more &#39;thorny&#39;. Makes them feel at home.\r<br />\r<br />Dawnstar is on the coast where the hard wind from the sea is merciless. The wood of a sign warps and bleaches quickly, and salt corrodes the metal surround.\r<br />\r<br />Windhelm is a dark and brooding place. Iron signs resist the biting cold, though ice chips in the bitter wind scour the metal.\r<br />\r<br />Winterhold&#39;s glory is past, but an echo still remains in the carved marble and inlaid silver of the Frozen Hearth inn.\r<br />\r<br />Markarth&#39;s inhabitants live in the bones of a dead civilisation, the homes and hearths carved by long-gone hands wielding unknown tools. The signs are made from the materials left by the unknowable Dwemer: corundum and their own strange metal. Who can say what the plaque that now marks The Hag&#39;s Cure was for?\r<br />\r<br />Solitude&#39;s is home to many races and types: shops must advertise themselves with more colour and variety if they are going to prosper.\r<br />\r<br />Inns and taverns out in the wilds will vary according to their owners and local history. Old Hroldan was the site of a battle with the Reachmen, somewhat keen on dressing as beasts; and so on.\r<br />\r<br />I use RCRN so I don&#39;t know if the new textures will look strange on ENB.\r<br />\r<br />\r<br />Please suggest improvements in simple language with punctuation. One long wishlist written in textspeak starting with &#34;dude&#34; will earn naught but weary dismissal. \r<br />\r<br />:)\r<br />\r<br />COMPATIBILITY\r<br />=============\r<br />I&#39;ve used straight one-for-one mesh replacements, taken gratefully and with permission from Brumbek&#39;s supreme Static Mesh Improvement Mod. Find it here: http://www.nexusmods.com/skyrim/mods/8655/?\r<br />It&#39;s a superb mod and you should have it anyway even if you don&#39;t want Signs of Skyrim. Over 3 million downloads can&#39;t be wrong&#33;\r<br />\r<br />SIGNS OF SKYRIM DOES NOT REQUIRE SMIM TO WORK.\r<br />\r<br />I won&#39;t be making a vanilla mesh version any time soon. UV mapping is like pulling teeth, I&#39;ve had enough for the moment.\r<br />\r<br />Worldspace edits have been kept to a minimum within reason, and so far I&#39;ve not found any severe conflicts or clashes. No scripts are in the mod: the .ESP has been cleaned with TES5EDIT. Load order may be of some significance if you think Signs of Skyrim is to blame. Placement issues have been highlighted with Enhanced Towns and Cities, and Enhanced Lights and FX (floating lanterns). Signs of Skyrim was built from the vanilla arrangement of buildings, so mods will interact accordingly.\r<br />\r<br />There will be *no* version released without the .ESP. If you want to use the assets in your own game, please feel free to open up the Construction Kit and play all you like: you could always merge it into another mod if your mod count is too high. I&#39;m not great at mod merging so I&#39;ll quote Ramakgaming when discussing my original Stable Signs mod:\r<br />\r<br />[i]&#34;flag it, and any mods [that affect areas in question] as mergeable in Wrye Bash, and then include them in the bashed patch, while disabling the originals (which it&#39;ll ask you if you want to do that before you start rebuilding the patch, just say yes). That&#39;s easier than the TES5Edit merging, as I have TES5Edit and the plugins for it that are required to make a merged esp, and it doesn&#39;t come up as an option no matter what I do. So I used the Wrye Bash bashed patch instead.&#34;[/i]\r<br />\r<br />Installation:\r<br />=============\r<br />Nexus Mod Manager should take care of the necessary processes.\r<br />Manual procedure: \r<br />Drop the .esp in your Skyrim directory and Meshes and Textures folders into your Skyrim/data directory, merging when asked and saying &#39;yes&#39; to the prompt to overwrite.\r<br />Activate the Signs_of_Skyrim.esp.\r<br />Go travel.\r<br />\r<br />\r<br />Thanks:\r<br />======\r<br />Brumbek for SMIM and permission to use his meshes. Hope you approve of what I did with your babies.\r<br />\r<br />CrazyBump. There is *no* substitute if you&#39;re making Normal Maps. Does in minutes what can otherwise take hours. \r<br />\r<br />Bethesda, for making the game and giving us the tools to tweak it how we like. Wish GSC had done that with S.T.A.L.K.E.R. :(\r<br />\r<br />BluePianoTwo, for initial suggestion to make signs for the Markarth and Solitude stables. \r<br />That snowflake started an avalanche :)\r<br />\r<br />The modding community, for support and feedback. \r<br />\r<br />Usual disclaimer: if this hurts your computer, don&#39;t blame me, I didn&#39;t hold a gun to your head while you installed it. You should always be careful when putting anything on your computer&#33; If you want to use it in a mod, credit me, otherwise no permission needed.",
  "categoryId": "85",
  "version": "2",
  "author": "Autan Waspeez",
  "createdUnix": "1409695406",
  "updatedUnix": "1411337487",
  "containsAdultContent": false,
  "uploadedBy": "Autan Waspeez",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000125298",
      "name": "Ragged Flagon fix",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "Ragged Flagon fix-57578-1-0.7z",
      "uploadedUnix": "1409851289",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/50eecdae706e6c99819b2d47d393bf8165a772ec79c0b464fa0d248bdde52ac0/analysis/1409851381/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ragged%20Flagon%20fix-57578-1-0.7z?fid=1000125298&ttl=1535843678&ri=8192&rs=8192&setec=37ac2ee410cc69066bb0437c418481cf"
    },
    {
      "fileId": "1000125299",
      "name": "Signs of Skyrim - no SMIM needed. V1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13197",
      "fileName": "Signs of Skyrim - standalone-57578-1-2.7z",
      "uploadedUnix": "1409851510",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/14cba4be281282c8b406d0398d00f41c700bbecffec10fe467ab044191ada1dd/analysis/1409851635/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Signs%20of%20Skyrim%20-%20standalone-57578-1-2.7z?fid=1000125299&ttl=1535843678&ri=8192&rs=8192&setec=27f7d56c5ba5e0280f3928e1daed72e3"
    },
    {
      "fileId": "1000125459",
      "name": "Thautmaturgists Hut mesh fix",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "61",
      "fileName": "Thautmaturgists Hut mesh fix-57578-.7z",
      "uploadedUnix": "1409945833",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c4bf1342260eb294c32ceca62ce6c08ee9456599cd12529398cbeaa4e46d3b06/analysis/1409945942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thautmaturgists%20Hut%20mesh%20fix-57578-.7z?fid=1000125459&ttl=1535843679&ri=8192&rs=8192&setec=6bf2960a1d4fd1deba55068efdc40c6c"
    },
    {
      "fileId": "1000127904",
      "name": "Warmaiden Sign",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "349",
      "fileName": "Warmaiden Sign-57578-2.7z",
      "uploadedUnix": "1411337487",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/55535f5c0ece8c804c23b8cf1267ff5c2ed6ee6baf073cac3684be56919d14de/analysis/1411337583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Warmaiden%20Sign-57578-2.7z?fid=1000127904&ttl=1535843679&ri=8192&rs=8192&setec=693f39cc70a8f28250e936d0c6b761a0"
    }
  ]
}