{
  "modId": 57589.0,
  "modName": "Mixed Unit Tactics - Dawnguard Edition - Skyrim meets RTS",
  "summary": "Command your troops all over the Skyrim, plan the assaults, send squads to guard places, write orders on paper, pay salary and do other things that fit the commander&#39;s playthrough.",
  "descriptionHtml": "[img]http://static-1.nexusmods.com/15/mods/110/images/57589-1-1409188854.jpg[/img]\r<br />\r<br />[center][url=http://www.skyrimgems.com][img]http://i.imgur.com/hXQSy.png[/img]\r<br />[/url][/center]\r<br />\r<br />You can read stuff, but the following demonstration should save you a lot of time:\r<br />\r<br />[youtube]wC5mi-u0TtY[/youtube]\r<br />\r<br />This is a re-release of my mod called[b] &#34;Mixed Unit Tactics&#34;[/b] with a bunch of changes and the ability to control followers in the Vampire Lord form.\r<br />This is NOT a beta, this is a finished product.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/57589-2-1409188854.jpg[/img]\r<br />\r<br />Since Morrowind I always thought that it&#39;s weird that the main Hero have all these resources (money, weapons, daedric artifacts) and none of them are actually working. There are few ways to spend money in TES. There is no point to carry all the game items you own, so they just collect dust at your houses. Yet, the player is still fighting alone. I think it will be more rational to put these resources in a good use and organize some kind of armed force from the people you trust. \r<br />\r<br />Mixed Unit Tactics is not designed as a follower mod (followers are not supposed to accompany player all the time).\r<br />Of course, you can use it this way, but there are plenty of other mods that allows you to do the same.\r<br />\r<br />Instead, you command your troops all over the Skyrim, plan the assaults, send squads to guard places and do other things that fit the commander&#39;s playthrough.\r<br />\r<br />The goal of this plugin is to create balanced, less chaotic combat experience with focus on preparation.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/57589-3-1409188854.jpg[/img]\r<br />\r<br />Mixed Unit Tactics is compatible with [b][u]Everything[/u][/b]. \r<br />It means, you can use with [b]UFO, AFT of EFF.[/b]\r<br />\r<br />The mod doesn&#39;t change anything in the vanilla followers system. The mechanics is designed from the scratch. \r<br />You recruit followers in a different way and you use them in a different way.\r<br />\r<br />[i]Known issues[/i]: Followers won&#39;t give commentaries like they do in the vanilla system (for the compatibility \r<br />purposes)\r<br />\r<br />You can use [b]EFF/MUT/AFT[/b] for immersion and MUT for tactics / large scale operations. \r<br />\r<br />Vilja, Serana are not able to be part of the squad, because they have they own independent systems. Modded followers that are designed according to the regular system, can be recruited with MUT without any issues.\r<br />\r<br />[img]http://static-4.nexusmods.com/15/mods/110/images/57589-4-1409188854.jpg[/img]\r<br />\r<br />Skyrim 1.9 is all you need.\r<br />\r<br />[b]SKSE Free[/b] (no, you don&#39;t need any script extension in order to run this mod)\r<br />[b]Dragonborn [/b]is supported (command your units from a Dragon), but [b][u]NOT [/u][/b]required.\r<br />[b]Dawnguard[/b] is supported (command your units from the Vampire Lord form), but [b][u]NOT [/u][/b]required.\r<br />\r<br />[img]http://static-4.nexusmods.com/15/mods/110/images/57589-5-1409188854.jpg[/img]\r<br />\r<br />MUT is not designed to operate single followers. It operates squads.\r<br />Every squad has a leader that take all the main orders and a group of regular fighters that follow him.\r<br />\r<br />There are multiple ways to define a squad, but the basic idea is the same: \r<br />[b]Define a leader -&gt; attach followers\r<br />[/b]\r<br />DO [u]NOT [/u]use the [b]&#34;Follow me&#34; [/b]option, \r<br />\r<br />To define a leader:\r<br />[b]&#34;I want to recruit new members to my party&#34; -&gt; &#34;You are the leader of the new squad&#34;.[/b]\r<br />\r<br />How to attach other followers to the leader?\r<br />\r<br />[b]First way: [/b]\r<br />1) Talk with the follower, &#34;I want to recruit new members to my party&#34; =&gt; &#34;Mark this person&#34;\r<br />2) Talk with the leader, &#34;I want to recruit more...&#34; =&gt; &#34;Attach the marked person&#34;\r<br />\r<br />[b]Second way: [/b]\r<br />1) &#34;Mark this person&#34;\r<br />2) Select the recruit with &#34;Tactical Sign&#34;\r<br />3) Point to the squad to join.\r<br />Can be useful if the squad is awaiting at some distance.\r<br />\r<br />[b]Third way: [/b]\r<br />1) Select the squad with &#34;Tactical Sign&#34;\r<br />2) Talk with the follower you want to recruit, &#34;Mark this person&#34;. The follower will be attached.\r<br />The squad remains selected, so you can repeat with other followers. Can be useful in case of recruiting the pack of followers to the same squad. Also, the leader don&#39;t have to follow you.\r<br />\r<br />[b]Fourth way:[/b]\r<br />1) Write the Recruitment Instructions (details are below).\r<br />2) Talk with the follower, select &#34;I want to recruit more...&#34;, &#34;Take this instruction to the leader&#34;\r<br />\r<br />The leader in this case can even rest at home hundreds miles away.\r<br />\r<br />Here is the video describing how you can define a squad:\r<br />[youtube]yTga7Na9gBA[/youtube]\r<br />\r<br />\r<br />The squad size and the squads count are unlimited. Only the size of your party is limited - you can have up to \r<br />120 followers in any combinations.\r<br />\r<br />[i]Question: Skyrim can&#39;t handle a lot of NPCs, will it lag with 120 followers?[/i]\r<br />[b][u]Sure [/u][/b]if you take all of them with you. But it won&#39;t lag if they are waiting for your orders at some distance.\r<br />\r<br />If the leader is dead or dismissed, the most advanced squad member will automatically take the lead with the \r<br />next order.\r<br />\r<br />[b][u]Keep the structure[/u][/b]\r<br />You can dismiss a follower completely, but I don&#39;t recommend doing it. Instead, temporary send your followers \r<br />to rest if you want to keep the current structure.\r<br />1) [i]&#34;You and your people can go home and relax&#34;[/i] - suspend all orders for the squad or the specified squad \r<br />member. You don&#39;t pay to the party members that are in the &#34;relax&#34; mode. Also, feel free to use then in the \r<br />vanilla style.\r<br />2) [i]&#34;Take your old place in squad&#39; [/i]- resume orders for the specified member. But I strongly recommend using \r<br />shouts and movement instructions (see below).\r<br />\r<br />\r<br />[img]http://static-4.nexusmods.com/15/mods/110/images/57589-1-1409188874.jpg[/img]\r<br />\r<br />[b]Tactical Sign[/b] is the heart of the mod. It gives you the precise control over your troops.\r<br />In my opinion, there is no point of installing Mixed Unit Tactics if you are not going to use Tactical Sign. \r<br />\r<br />[b][u]Controlling troops while staying on the ground.[/u][/b]\r<br />Tactical Sign is a directional lesser power, which means - you need to point to the specific area.\r<br />There are commands for the whole party and commands for the selected squad. In most cases the leader must see the player in order to recognize his signs.\r<br />\r<br />[u]Basic whole-party signs[/u]\r<br />\r<br />[b]Hold Sign[/b]\r<br />Cast it under the player&#39;s feet while your weapon is DRAWN to give the &#34;Hold position&#34; order to every leader \r<br />that see player. [i]Sneak: [/i]if you are in the Sneaking state, followers will also go into sneak after you perform the &#34;hold&#34; order.\r<br />\r<br />[b]Regroup Sign[/b]\r<br />Cast it under the player&#39;s feet while your weapon is SHEATHED to give the &#34;Regroup and follow&#34; order to every leader that see player. Regular fighters will also resume following their leaders. [i]Sneak: [/i]if you are in the Sneaking state, followers will also go into sneak after you perform the &#34;Regroup&#34; order.\r<br />\r<br />[b]Attack Sign[/b]\r<br />Point Tactical Sign to the ground near the enemy to give the &#34;Attack&#34; order to all nearby squads.\r<br />\r<br />[b]Ride Sign[/b]\r<br />Select the horse to order your nearby followers to use it (they must be allowed to ride animals from the dialogue)\r<br />\r<br />[u]Single squad commands\r<br />[/u]\r<br />[b]Select a squad[/b]\r<br />Cast it at the ground near the squad to select it.\r<br />\r<br />[i]Popular question: why cast on the ground? why not cast on the NPC instead?[/i]\r<br />1) It&#39;s hard to pinpoint the NPC from a distance.\r<br />2) Technical issues. The current scheme allows to use a single spell for all the orders, so you don&#39;t have to switch between spells in the inventory.\r<br />\r<br />[u]What can you do with the selected squads?\r<br />[/u]\r<br />Please, note that visibility matters. The squad won&#39;t recognize any your orders if the leader can&#39;t see you.\r<br />If you want to give an order from a distance, equip a torch (in this case you must see the squad while giving a command).\r<br />\r<br />[b]The &#34;Move&#34; order[/b]\r<br />Cast on the ground. The squad will move to the location you pointed at.\r<br />\r<br />[b]Stealth movement[/b]\r<br />If you are crouching, while giving an order, followers will try to move to their target undetected\r<br />\r<br />[b]The classic &#34;Favors&#34; mode. [/b]\r<br />Point with Tactical Sign to the selected squad (yes, second time) to enter the &#34;favors&#34; mode.\r<br />\r<br />[i]Question: Can I use the regular Skyrim orders activation system on non-leaders? [/i]\r<br />Hold the &#34;Use&#34; key while pointing on the target follower to select him or her.\r<br />\r<br />[b]Clear formation[/b]\r<br />Select the squad three times to clear the formation.\r<br />\r<br />[b]Tactical Units[/b]\r<br />Temporary attach the selected squad to another to create Tactical Unit (squads will follow the Leading squad, each squad will maintain it&#39;s own formation). &#34;Regroup Sign&#34; will disassemble Units.\r<br />\r<br />[b]Escort[/b]\r<br />Cast to the ground near the NPC (while your weapon is SHEATHED) to make the selected squad escort this NPC.\r<br />\r<br />[b]Attack[/b]\r<br />Cast to the ground near the NPC (while your weapon is DRAWN) to make the selected squad attack this NPC.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-2-1409188874.jpg[/img]\r<br />\r<br />If you give an attack sign while crouching, squad leader will try to approach the target undetected and perform a stealth kill (the squad leader must be equipped with a sword or dagger to perform stealth attack). Also the whole squad will try to become invisible (using spells or potion if they have some).\r<br />\r<br />Here is the video describing Stealth Operations:\r<br />[youtube]1QkjezQrhRI[/youtube]\r<br />\r<br />\r<br />\r<br />[i]Popular question: I use &#34;Tactical Sign&#34; and no menus are appearing. [/i]\r<br />[b][u]Tactical Sign won&#39;t give you any menus[/u][/b]. It&#39;s a [b][u]DIRECTIONAL [/u][/b]spell. Read the description, watch the videos. Sorry, I don&#39;t know how to make it more clear.\r<br />\r<br />\r<br />[b][u][img]http://static-3.nexusmods.com/15/mods/110/images/57589-3-1409188874.jpg[/img]\r<br />[/u][/b]\r<br />If you have[b] Dawnguard DLC[/b], you can use Tactical Sign in the Vampire Lord form. Rules are the same. Note: Most \r<br />VL overhauls allows you to fly.\r<br />\r<br />If you have[b] Dragonborn DLC[/b], you can control your units from the sky while riding a Dragon. Use the illusion spells or Magical Light. They work just like Tactical Sign (which is unavailable while you ride a Dragon), except the player visibility doesn&#39;t matter. You can select a squad, fly to any place in the world and mark the location. Your troops will travel all over the Skyrim to reach their destination.\r<br />\r<br />Select the squad twice while riding a dragon to order your fighters to move to one of the locations you defined previously.\r<br />\r<br />[youtube]EcWZeCousos[/youtube]\r<br />\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-4-1409188874.jpg[/img]\r<br />\r<br />Use dragon shouts as signals to your followers.\r<br />\r<br />First you have to equip the shout. \r<br />Second, talk with the leader and bind this squad to the shout\r<br />&#34;Let&#39;s talk about order in party&#34; =&gt; &#34;Time will come and i&#39;ll need your help&#34;.\r<br />\r<br />Use [b]&#34;Dragon Sign&#34; [/b]in 3 different ways:\r<br />1) Use the voice as usual. If you have squads nearby that are binded to the shout that you use, they will \r<br />regroup and start following you.\r<br />2) If you are involved in combat, use the voice as usual and the binded squads will attack your current target.\r<br />3) Shout into the sky (literally). All binded squads will hear your voice. They will travel to the location \r<br />where you performed the shout.\r<br />\r<br />\r<br />That means: you don&#39;t have to take your troops with you (just define squads, send them to their homes and call \r<br />only when you need some support).\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-5-1409188875.jpg[/img]\r<br />\r<br />All party members share the same combat style:\r<br />1) Ranged weapons are the highest priority\r<br />2) Staffs are more prior that close combat weapons\r<br />3) Melee weapons are more prior than magic\r<br />4) Magic has lowest priority\r<br />\r<br />The gear does matter. \r<br />So If you want to have squad of archers just give them bows or crossbows. \r<br />If you want to have a pure mages squad, just leave them with daggers and so on.\r<br />\r<br />Your followers can [b][u]heal [/u][/b]themselves and others. They can use vanilla healing potions or vanilla spells (like Healing, Grand Healing, Healing Hands, Heal Other). They MUST have enough magicka and they MUST known the spell in order to do that (you can upgrade your followers and teach spells with UFO)\r<br />\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-1-1409188886.jpg[/img]\r<br />\r<br />Most characters won&#39;t join your party for free. There is a daily salary for all the members.\r<br />The advanced followers require more money.\r<br />\r<br />Once you hired a follower, you debt is going to grow each day.\r<br />When the character is disappointed about the amount of money you owe him, he [u]will leave the squad[/u].\r<br />\r<br />How the follower can determine if the debt is [b]critical [/b]or not?\r<br />- The more quests you complete, the more [i][u]respect [/u][/i]you get from followers, and they can forgive you bigger debts.\r<br />- The [u][i]Speechcraft [/i][/u]skills of the player and the follower (only in the common salary system, see below).\r<br />\r<br />You can pay your debt completely: [b]&#34;Let&#39;s talk about the salary&#34; -&gt; &#34;About your payment&#34;.[/b]\r<br />If you talk with a leader, you can also pay to entire squad.\r<br />\r<br />You can also pay in advance ([b]&#34;pay the specific amount of money&#34;[/b]). If you pay the custom amount to leader, the \r<br />payment will be equally shared between all the fighters.\r<br /> \r<br />There are[b] [u]three [/u]salary modes[/b] available.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-2-1409188886.jpg[/img]\r<br />\r<br />\r<br />You pay a fixed sum to all the followers. You can change the value at any time. Remember that if the value is lower than the follower&#39;s minimal cost, he/she will leave your party.\r<br />[b]Advantages[/b]: friendly atmosphere in the squad (because the payment is equal). Followers will stay with you much longer if the debt is critical (depends on how much you overpay). They can also warn you if they are going to leave (if close enough).\r<br />[b]Disadvantages:[/b] you overpay a lot.\r<br />\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57589-3-1409188886.jpg[/img]\r<br />\r<br />You pay the minimal possible salary that the follower can take.\r<br />[b]Advantages:[/b] you save a lot of money.\r<br />[b]Disadvantages:[/b] Followers will leave without warning if the debt is critical.\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57589-4-1409188886.jpg[/img]\r<br />\r<br />[b]Special custom salary[/b] (&#34;I want to pay you in a different way&#34;).\r<br />This is a special deal between you and the follower. It will override the selected mode.\r<br />Can be handy if you have followers with special talents that you don&#39;t want to lose no matter what.\r<br />\r<br />[b]Advantages: [/b]Same as in the common salary.\r<br />[b]Disadvantages: [/b]you still have to overpay if you want to keep the follower.\r<br />\r<br />You can also pay bonuses for[i] [b]&#34;frags/kills&#34; [/b][/i]and bonuses for the [i][b]damage [/b][/i]taken (this will raise the follower&#39;s confidence in combat).\r<br />\r<br />[b]What affect the lower bound of the salary?\r<br />[/b]\r<br />- The follower&#39;s skills:\r<br />OneHanded\r<br />TwoHanded\r<br />Marksman\r<br />Block\r<br />LightArmor\r<br />Alteration\r<br />Conjuration\r<br />Destruction\r<br />Illusion\r<br />Restoration\r<br />HeavyArmor\r<br />Sneak\r<br />Speachcraft\r<br />\r<br />- The player&#39;s Level vs the follower&#39;s Level\r<br />- The follower&#39;s &#34;speachcraft&#34; vs the player&#39;s &#34;speachcraft&#34;\r<br />\r<br />- Player&#39;s haggling perks\r<br />- How many quests are completed (Fame)\r<br />\r<br />- Is the follower a Hireling\r<br />- Is the follower a marriage partner (can hire for free)\r<br />- Is the folllower a Daedra or a some Mythical creature (can hire for free, MUST have proper keywords)\r<br />- Is the follower a Housecarl (can hire for free)\r<br />\r<br />If you are not happy with the salary [b]balance[/b], you can always change it via the console. \r<br />&#34;[i]SquadsSalaryScale[/i]&#34; is the salary multiplier that affects the lower bound of the follower&#39;s salary.\r<br />\r<br />[i]Examples:\r<br />[/i]set SquadsSalaryScale to 6 =&gt; this will increase the follower&#39;s cost\r<br />set SquadsSalaryScale to 0.3 =&gt; this will reduce the follower&#39;s cost\r<br />set SquadsSalaryScale to 0 =&gt; this will disable the salary (so you can get all the followers for free)\r<br />set SquadsSalaryScale to 1 =&gt; this will set the salary to the regular (default) value\r<br />\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57589-5-1409188886.jpg[/img]\r<br />\r<br />You can send messages to your followers. And you need to actually [b][u]write [/u][/b]them.\r<br />\r<br />Required items: \r<br />- Ruined Books or Rolls Of Paper as Paper Source\r<br />- A Quill\r<br />- An Inkwell\r<br />\r<br />A) Drop and activate the [b]Inkwell [/b]to write a single letter\r<br />B) Activate the [b]Inkwell [/b]while sitting to write [u]several [/u]letters\r<br />\r<br />[youtube]isVjPSP0AyE[/youtube]\r<br />\r<br />[b]Recruitment Instructions[/b]\r<br />Can be used to recruit a follower to the squad that is located far away\r<br />\r<br />[b]Payment instructions[/b]\r<br />You can send money to your followers with a courier. Talk with any guard.\r<br />\r<br />[b]Signal Instructions[/b]\r<br />Allows to bind a shout to the squad.\r<br />\r<br />[b]Movement instructions\r<br />[/b]Allows to order the squad to move to one of the locations you defined. The leader will take all the fighters \r<br />with him (even if the squad is on rest).\r<br />\r<br />[b]How to edit the location list?[/b]\r<br />Open the Movement Instructions from your inventory. You can define the point at your current position.\r<br />\r<br />\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/57589-1-1409192386.jpg[/img]\r<br />\r<br />\r<br />[b]Combat formations [/b]are good to organize tactical units and gain the advantage at the beginning of the fight. However, I don&#39;t recommend to use them all the time (the game engine is not perfect, you know, sometimes they get stuck in rocks and trees). So, use as a temporary solution for the specific task.\r<br />\r<br />1. To set a formation, talk with the squad leader:\r<br />[i]&#34;Let&#39;s talk about order in party&#34; -&gt; &#34;Combat Formation&#34;[/i]\r<br />\r<br />2. Select the type of formation\r<br />If you want to set a custom formation, you should move the squad member before talking with the leader. To move a follower, hold &#34;Use&#34; key while standing at some distance from him. You will enter the &#34;Favors&#34; mode. Select the position for this follower.\r<br />\r<br />3. To clear the formation select &#34;Clear Formation&#34;. If the formation get broken after combat, select &#34;Restore the formation&#34; to repair it. You can also use the Regroup sign for this task.\r<br />\r<br />The following video describe the advanced features like formations and auto-loot:\r<br />[youtube]Qs7uMmfOHmE[/youtube]\r<br />\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-1-1409188910.jpg[/img]\r<br />\r<br />This mod is not about cheating. Actually, in the vanilla system the game is trying to protect your followers from dying with the &#34;Protected&#34; flag. Your followers will die very rarely, often because of the &#34;poison&#34; bug. The enemy will just let your mates to recover.\r<br />http://www.uesp.net/wiki/Skyrim:Followers\r<br />\r<br />This mod doesn&#39;t protect your followers and doesn&#39;t try to trick the AI. They have the same chances as your enemies. Sure, they can die very easily. However, you can select the right tactics, use your troops wisely and avoid losses in fair battle. This will lead to more rewarding experience than what you have with the vanilla system.\r<br />\r<br />Still, the vanilla world doesn&#39;t give enough challenge to your followers. So, I recommend mods that strengthen your enemies.\r<br />I&#39;m also going to address this issue in my next mod.\r<br />\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-2-1409188910.jpg[/img]\r<br />\r<br />[i]Question: with all the presented features why this mod have so few endorsements?\r<br />[/i]\r<br />First, this mod has [b]no adult content[/b] (no, you can&#39;t organize a group sex between squads).\r<br />\r<br />Second, it requires [b]reading descriptions and thinking[/b]. This mod wasn&#39;t designed to make your life easier. Most users prefer simple things that just run in the background and don&#39;t require any actions from them.\r<br />\r<br />Third, like I said, the [b]vanilla Skyrim doesn&#39;t suit the large scale planning[/b], so it&#39;s up to you to organize a \r<br />proper challenge.\r<br />\r<br />These are the reasons why this mod will never become popular. This shouldn&#39;t confuse you though. If you are interested in large scale battles, planning and micromanagement, you won&#39;t be disappointed. I least, I hope so.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57589-3-1409188910.jpg[/img]\r<br />\r<br />If you want to uninstall, please, [b]RELEASE ALL SQUADS[/b] before doing this&#33;&#33;\r<br />\r<br />[i]Question: this is a scripted mod, so... is it safe to uninstall it?[/i]\r<br />All my mods should be safe to uninstall.\r<br />\r<br />[i]Question: But the official Bethesda statement claims that...[/i]\r<br />Listen, I don&#39;t want to go through all these ( [url=http://www.youtube.com/watch?v=NkaTvRx_4x4] _1_[/url] , [url=http://forums.nexusmods.com/index.php?/topic/1995639-reanimate-skyrim-utility-mod-broken-animation-fix/page-4#entry17544249]_2_ [/url] ) arguments again.\r<br />Here is the stress test where I&#39;m trying to &#34;break&#34; the game by uninstalling &#34;Mixed Unit Tactics&#34;\r<br />[youtube]c7wPSZTW4Eg[/youtube]\r<br />\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/57589-4-1409188910.jpg[/img]\r<br />\r<br />Bugreports are always welcomed (especially with details), but please note that 99% of so called &#34;bugs&#34; appear because you don&#39;t completely understand the mechanics. \r<br />\r<br />Suggestions are welcomed, but I&#39;m not planning to add any large features. This mod is in development since January 2013 and it is already complex enough. \r<br />\r<br />Thank you for your attention.\r<br />\r<br />[b]Old trailers:[/b]\r<br />[youtube]MUfPjrTBM8U[/youtube]\r<br />\r<br />[youtube]PZASnLaOWNA[/youtube]",
  "categoryId": "96",
  "version": "3.0",
  "author": "flexcreator",
  "createdUnix": "1409193834",
  "updatedUnix": "1440337850",
  "containsAdultContent": false,
  "uploadedBy": "flexcreator",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000124226",
      "name": "Mixed Unit Tactics 2_9",
      "version": "2.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62",
      "fileName": "Mixed Unit Tactics 2_9-57589-2-9.rar",
      "uploadedUnix": "1409189110",
      "modVersion": "2.9",
      "virusScanUrl": "https://www.virustotal.com/file/0bda4d66c446d7dcf108198a568cc571b79b29d4dc765f105f0053546d4ce7c2/analysis/1409189222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mixed%20Unit%20Tactics%202_9-57589-2-9.rar?fid=1000124226&ttl=1535843696&ri=8192&rs=8192&setec=3abc93fc8b263dfd1a074ec2c9a75201"
    },
    {
      "fileId": "1000124502",
      "name": "Mixed Unit Tactics 3_0 English",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "62",
      "fileName": "Mixed Unit Tactics 3_0 English-57589-3-0.rar",
      "uploadedUnix": "1409356161",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/2786d57ae3c33dfadc08f414d4c646e5fb84595c534ee850f31379cc642e0871/analysis/1409356262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mixed%20Unit%20Tactics%203_0%20English-57589-3-0.rar?fid=1000124502&ttl=1535843696&ri=8192&rs=8192&setec=ada462e948dcb7c2a2cdede4f5c1a115"
    },
    {
      "fileId": "1000124597",
      "name": "Mixed Unit Tactics 3_0 Russian",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "63",
      "fileName": "Mixed Unit Tactics 3_0 Russian-57589-3-0.rar",
      "uploadedUnix": "1409432891",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/2ec0a46cc9dc6c6277a9daa513e52ca70c17022b7d9eeef38b13c21e7e051a45/analysis/1409433004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mixed%20Unit%20Tactics%203_0%20Russian-57589-3-0.rar?fid=1000124597&ttl=1535843697&ri=8192&rs=8192&setec=cef9eae6ce80740cf8ab5b7dea523039"
    },
    {
      "fileId": "1000173035",
      "name": "Fix for missing followers",
      "version": "3.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "13",
      "fileName": "Fix for missing followers-57589-3-1.rar",
      "uploadedUnix": "1440337850",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/168e939ca4462a562993f176cc8ddbf98c0d7e17c47296202d96db59bcde253d/analysis/1440337868/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fix%20for%20missing%20followers-57589-3-1.rar?fid=1000173035&ttl=1535843697&ri=8192&rs=8192&setec=1df491b7a4fd2ffadc36697e52ecada7"
    }
  ]
}