{
  "modId": 57588.0,
  "modName": "Heavy Armor Perk Revision",
  "summary": "Small mod to revise the heavy armor tree.",
  "descriptionHtml": "By the armor cap, heavy armor is arguabley the less effective armor to fight in due to the light armor perk Wind Walker (Stamina regenerates 50% faster in all Light Armor: head, chest, hands, feet).\r<br />\r<br />Cushioned was useless (Half damage from falling if wearing all Heavy Armor: head, chest, hands, feet).\r<br />\r<br />Conditioning (Heavy Armor weighs nothing and doesn&#39;t slow you down when worn) would inadvertantly, nonsensically affect the player&#39;s ability to sneak by making his shoes weigh less, despite wearing a suit of armor.\r<br />\r<br />Reflect Blows made no sense at all (10% chance to reflect melee damage back to the enemy while wearing all Heavy Armor: head, chest, hands, feet).\r<br />\r<br />--THE MOD--\r<br />\r<br />Now, heavy armor is much harder to sneak in due to not making any changes to it&#39;s weight. It retains being slower to move in, but protects\r<br /> the wearer a lot better than light armor.\r<br />\r<br />Cushioned: 10% resistance to the elements (fire, frost and shock).\r<br />\r<br />Conditioning: +100 carry weight (which should cover the weight of equipped weapons and armor).\r<br />\r<br />Deflect Blows: 20% chance to deflect physical damage (weapons and bows, not from falling).\r<br />\r<br />All the perks except Juggernaut and Deflect Blows: 5% chance to deflect physical damage (weapons and bows, not from falling).\r<br />\r<br />\r<br />--All together, that comes to a 50% chance to deflect physical damage (it may sound like a lot, but it is effectively the same as atronach is for magic)\r<br />\r<br />(The steed stone still changes equipped armor to weigh nothing, so allows unrestricted movement and bonus to sneak if you feel that way inclined).",
  "categoryId": "24",
  "version": "1",
  "author": "Deadarmour",
  "createdUnix": "1409190053",
  "updatedUnix": "1409189974",
  "containsAdultContent": false,
  "uploadedBy": "deadarmour",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000124227",
      "name": "Heavy Armor Perk Revision",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Heavy Armor Perk Revision-57588-1.zip",
      "uploadedUnix": "1409189974",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cb9ad78a9925b0e024c5110c35b6dccaf77227a5b09aeecea74bd59b9e17a6fb/analysis/1409190062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Heavy%20Armor%20Perk%20Revision-57588-1.zip?fid=1000124227&ttl=1535843694&ri=8192&rs=8192&setec=745245074a22a884fda9abf87a63f157"
    }
  ]
}