{
  "modId": 57612.0,
  "modName": "Skyrim Better Roads (SkyBeRoads)",
  "summary": "Skyrim Better Roads (or SkyBeRoads) is a small modification that aims to bring immersion to the roads of Skyrim.",
  "descriptionHtml": "[center][color=#ff7700]The mod author is currently recruiting modders willing to develop this mod even further and cover the roads from the remaining holds of Skyrim&#33; If you could like to join, send the author of this mod a message&#33;[/color]\r<br />[u][u][heading][/heading][/u][/u]\r<br />\r<br />[color=#6d9eeb]Skyrim Better Roads (or SkyBeRoads) is a lore-friendly decorative mod which improves the roads of Skyrim.[/color]\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57612-1-1409934934.png[/img][/center][u][u][heading][/heading][/u][/u]\r<br />\r<br />[center]A video that demonstrates the SkyBeRoads&#39;s changes to the roads of Skyrim (thanks to [url=http://www.nexusmods.com/skyrim/users/2388835]hodilton[/url]&#33;)[/center]\r<br />[center][youtube]RMMmJPAnBYA[/youtube]\r<br />\r<br />\r<br />Another video that demonstrates the SkyBeRoads&#39;s changes to the roads of Skyrim (thanks to [url=http://forums.nexusmods.com/index.php?/user/4051376-brodual]Brodual[/url]&#33;)\r<br />[youtube]XnZO970loTc[/youtube][/center]\r<br />[center][/center][center]One more video that demonstrates most of the SkyBeRoads&#39;s changes to the roads of Skyrim (thanks to [url=http://www.nexusmods.com/skyrim/users/3140928]izon87604[/url]&#33;)\r<br />[youtube]CdcAgo_qeSY[/youtube][/center]\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]MOD INFO[/size][/heading][/u]\r<br />[color=#00ffff]What is Skyrim Better Roads (SkyBeRoads)?[/color]\r<br />Skyrim Better Roads, or simply SkyBeRoads, is a small mod that makes some subtle changes and improvements to the main roads\r<br />(and to some secondary roads if needed) of Skyrim, in an effort to provide you a more immersive feeling in your travels.\r<br />From now, the roads will make more sense, by being what they were supposed to be: for the people&#33;\r<br />\r<br />Since it&#39;s a commonly asked question, I&#39;ll answer it here: Yes, SkyBeRoads is[color=#00ff00] very compatible[/color] with most of the other mods out there&#33;\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u][u]\r<br />[u][heading][size=4]MOD SUMMARY[/size][/heading][/u][/u]\r<br />[size=2][b][u]What the Skyrim Better Roads does:[/u][/b][/size]\r<br />[list][*]Makes the roads reflect the social, economic and strategic importance of the nine Holds. The roads to capital cities will be better than the village roads.[/*]\r<br />[*]Makes lore-friendly changes to the roads of Skyrim. The main roads will be better than the small roads. Main roads &gt; secondary roads &gt; small paths.\r<br />[/*][*]Makes the bridges more unique, and less identical to each other, visually. Each bridge will borrow elements from the architecture of the Hold capitals.\r<br />[/*][*]Main roads only: some of the grass & shrubs are moved away from the middle of them. Secondary/Small roads will still have grass and shrubs on them.\r<br />[/*][*]Adds stone or wooden fences to the roads, where appropriate. Skyrim wasn&#39;t inhabited yesterday. Skyim is the birthplace of the human civilization.\r<br />[/*][*]Adds extra decors, such as stairs, etc, where there is need for them. Mountain roads no longer look like slippery slides when there is rainstorm or cold.\r<br />[/*][*]Adds foliage and other natural objects such as rocks, around some empty roads. These additions are reasonable. For example, If there are fallen leaves on the ground, but no trees nearby to explain where these leaves came from, then, deciduous trees will be added in the area.[/*]\r<br />[/list]\r<br />[size=2][b][u]What the Skyrim Better Roads does not:[/u][/b][/size]\r<br />[list][*]It does not do any landscape or terrain edits.\r<br />[/*][*]It does not do any navmesh/pathfinding edits. Uses NavCut Collision Markers instead. (Credits to Arthmoor&#33;)\r<br />[/*][*]It does not add/change any quests or dialogs.[/*]\r<br />[*]It does not add/change any textures or meshes. Uses only what the game offers to the modders.\r<br />[/*][*]It does not contain any scripts - the mod is completely safe to uninstall from your game, anytime.[/*]\r<br />[*]It does not contain any dirty edits. Absolutely clean mod. Verified by TES5Edit&#33;[/*]\r<br />[/list][u]\r<br />[/u]The Skyrim Better Roads does not alter the landscape or the terrain&#33; Also it does not do any navmesh editing&#33;\r<br />My mod is fully compatible with all other mods out there.[u]\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[heading][size=4]COMPATIBILITY[/size][/heading][/u]\r<br />My mod is designed with the goal of [color=#00ff00]full compatibility with any mods [/color]in your game&#33;\r<br />\r<br />[u]The Skyrim Better Roads - SkyBeRoads is:[/u]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]all the game versions[color=#00ffff][color=#00ffff][color=#ffffff], [/color][/color][color=#00ffff][color=#00ffff][color=#ffffff]and[/color][/color][/color][/color][color=#00ffff] all [/color]the DLCs\r<br />[color=#00cc00]100%[/color] [color=#ffffff]compatible with[/color] all the Unofficial Patches[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Open Cities Skyrim[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Cutting Room Floor[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Provincial Courier Service[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Expanded Towns and Cities[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Immersive Settlements[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]More Carriages[/color][color=#00ffff][color=#ffffff],[/color] Better Fast Travel: Carriages and Ships[color=#00ffff][color=#ffffff], etc.[/color][/color][/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Lanterns of Skyrim[/color] (highly recommended for use with SkyBeRoads, as shown in my pictures)\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Point the Way[/color] (highly recommended for use with SkyBeRoads, as shown in my pictures)\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Real Roads for Skyrim[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Hold Border Banners[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Better Docks[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Solitude Docks District[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Unique Border Gates[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Skyrim Bridges[/color] (Don&#39;t install the Bridge module of SkyBeRoads with this mod, they clip.)\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Illustrated Panels Towns[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Sexy [color=#00ffff][City Name][/color][/color] mod series\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Sexy Villages and Towns[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Dawn of [City Name][/color] mod series\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]A Real Explorer&#39;s Guide to Skyrim[/color] collection\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Skyrim Landscape Overhaul[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Static Mesh Improvement Mod (S.M.I.M.)[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]W.A.T.E.R[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Realistic Water Two[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]SkyFalls and SkyMills[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Skyrim Flora Overhaul[/color], [color=#00ffff]Lush Trees and Grass[/color], etc.\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Convenient Horses[/color]\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Immersive Patrols[/color], [color=#00ffff]Interesting NPCs[/color], [color=#00ffff]Inconsequential NPCs[/color],  etc.\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]Skyrim Immersive Creatures[/color], [color=#00ffff]Monster Mod[/color], etc.\r<br />[color=#00cc00]100%[/color] compatible with [color=#00ffff]ENB Series[color=#ffffff],[/color] Imaginator[color=#ffffff],[/color] FXAA Post Process Injector[color=#ffffff], etc.\r<br />[color=#00ffff][color=#ff0000]0%[/color][color=#ffffff] compatible with [/color]Touring Carriages[color=#ffffff].\r<br />[color=#00ffff][color=#ffffff][color=#00ffff][color=#ffffff][color=#00ffff][color=#ffffff][color=#00ffff][color=#ff0000]0%[/color][color=#ffffff] compatible with [/color][/color][/color][/color][color=#00ffff]Immersive Citizens  - AI Overhaul[/color][/color][/color][/color][/color]\r<br />\r<br />[/color][/color][/color][/color]\r<br />With simple words, Skyrim Better Roads - SkyBeRoads is [color=#00cc00]99%[/color] compatible with anything else out there.\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u][u]\r<br />[/u][u][u][heading][size=4]MOD DETAILS[/size][/heading][/u]\r<br />[/u]The mod is a personal modification which improves various roads and bridges\r<br /> around Skyrim. The scope is to fix and correct all the problems related\r<br /> to the road system of Skyrim and restore them into what they were meant\r<br /> to be: for the safer and better movement of people, carriages and goods\r<br /> across the province of Skyrim&#33; From now, the roads will be a reflection\r<br /> of the wealth of the 9 Holds of Skyrim, with some roads being better \r<br />than others, depending on their strategic importance. The roads will now\r<br /> reflect the economic prowess of their Holds and the bridges will, \r<br />visually speaking, use the architecture of the holds and their capital \r<br />cities&#33;\r<br />\r<br />The mod is modular, allowing you to pick up the road improvements you see fit for your game.\r<br />\r<br />[size=3][b][u][color=#6d9eeb][color=#ffffff][size=2][u][b][u]The [/u][/b][/u][/size][/color][size=2]SkyBeRoads - Solitude [/size][/color][/u][/b][size=2][u][b][u]module:[/u][/b][/u][/size][/size]\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57612-3-1409935657.png[/img]\r<br /> The Solitude module of the mod corrects problems and issues related to the roads of Solitude.\r<br />Although the main road to the city of Solitude is a very important road (is the \r<br />primary road linking Solitude with rest of the province), and thus, used\r<br /> everyday by travelers, citizens, merchants, carriages and the Imperial \r<br />Legion, it is one of the worst roads ever seen in the entire province of\r<br /> Skyrim&#33;\r<br />The Solitude road really looks abandoned and unused. Shrubs and bushes growing from within the middle of the road as if it has been \r<br />years since the last time humans stepped on it, huge Pine trees taking \r<br />over half of the road and leaving no enough space for the travelers, and\r<br /> solid grass popping up from within the road&#39;s stones, all these \r<br />problems can seriously ruin the immersion that the Solitude&#39;s road is \r<br />indeed the road which connects the capital city of Skyrim with the rest \r<br />of the province and the world&#33;\r<br />How can the provincial capital Solitude, seat of the High King, have such a bad main road (to \r<br />understand how bad the road is, you can see that Riverwood and Helgen \r<br />have already much better roads than Solitude), which not only does not \r<br />reflects the Solitude&#39;s importance as the largest merchant and trading \r<br />hub in the entire region of Skyrim? The Solitude module deals with these\r<br /> issues.\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57612-1-1410018854.png[/img]\r<br />\r<br />\r<br />[u][size=3][b][u][color=#6d9eeb][size=2][b][u][color=#6d9eeb][color=#ffffff][u][b][u]The [/u][/b][/u][/color][/color][/u][/b]SkyBeRoads - Ivarstead[/size][/color][/u][/b][size=2][u][b][u] module:[/u][/b][/u][/size][/size]\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/57612-1-1409935656.png[/img]\r<br />[/u]The Ivarstead module of the mod corrects problems and issues related to the roads of Ivarstead.\r<br />Although Ivarstead isn&#39;t a trading hub or an important settlement, however, it \r<br />is the meeting point for several roads and mountain paths that link the \r<br />Throat of the World with the rest of the world. Due to this, many \r<br />mountain travelers and hikers often make a stop at Ivarstead for \r<br />supplies or for a night rest. Ivarstead is situated on the slopes of the\r<br /> Throat of the World, however, the mountain paths and roads around the \r<br />village seem as if the villagers never cared to maintain them - the \r<br />roads around the village in fact look terrible or make absolutely no \r<br />sense. They lack any means for easier traveling, such as stones and \r<br />rocks especially on the sloppy sections, which can be dangerous on rainy\r<br /> days, and the roads, in general, feel as if Bethesda left them totally \r<br />incomplete. My mod aims to deal with this and improve these roads, as \r<br />well as the immediate areas around them.\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57612-2-1410018854.png[/img]\r<br />\r<br />\r<br />[u][size=3][b][u][color=#6d9eeb][size=2][b][u][color=#6d9eeb][color=#ffffff][u][b][u]The [/u][/b][/u][/color][/color][/u][/b]SkyBeRoads - Whiterun [/size][/color][size=2]module:[/size][/u][/b][/size]\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57612-2-1409935657.png[/img]\r<br />[/u]The Whiterun module of the mod corrects problems and issues similarly to the ones above.\r<br />Also, due to Whiterun&#39;s importance as the main trading hub located at the \r<br />center of the province of Skyrim, the roads of Whiterun have been \r<br />upgraded where fit, by adding wooden fences made of the fine Whiterun \r<br />wood, and improves the roads around the city of Whiterun to reflect the \r<br />high profile of the city of Whiterun. Also, the stone bridges around \r<br />Whiterun got some improvements too, to make them more unique, and match \r<br />better the Whiterun&#39;s stone architecture. Thanks to SkyBeRoads, Whiterun\r<br /> now has more proper roads and bridges&#33;\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/57612-3-1410018854.png[/img]\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]MOD REQUIREMENTS[/size][/heading][/u]\r<br />No mod dependencies or requirements. This is a standalone mod.\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]INSTALL[/size][/heading][/u]\r<br />Just place the .esp to the Skyrim/Data Folder and activate it.\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]UNINSTALL[/size][/heading][/u]\r<br />Just deactivate/remove the .esp from the Skyrim/Data Folder.\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]LOAD ORDER[/size][/heading][/u]\r<br />This is a Load Order Neutral Mod. With simple words, really it doesn&#39;t matter where you place it. \r<br />This mod is safe to be placed anywhere in your game&#39;s mod loading order.\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]QUESTIONS & ANSWERS[/size][/heading][/u]\r<br />[b][size=3]1.[/size] [u]Does SkyBeRoad has any impact to the performance of the game?[/u][/b]\r<br />Absolutely no&#33; SkyBeRoads contains no scripts at all, and it carefully decorates the Skyrim&#39;s roads with low-to-medium polygon static objects that barely can affect your game&#39;s performance. Generally speaking, SkyBeRoads could be the last mod to concern you about performance in your game.\r<br />\r<br />[b][size=3]2.[/size] [size=2][b][u]Help&#33; I&#39;m experiencing Infinite Load Screens (ILS) and/or Crashes to Desktop (CTD) [/u][/b][/size][u]near the X location&#33; What to do?[/u][/b]\r<br />Your ILS and CTD have nothing to do with SkyBeRoads at all. ILS and CTD are a common issue especially since March of 2013, when Bethesda released their final patch for Skyrim, version 1.9.32.0.8. Prior to this patch, most mods had little trouble operating in the available memory the game provided on the computer. It has since been found though that Patch 1.9 changed something about the way Skyrim allocates its initial pools of memory, likely due to trying to get the DLC to work properly on the PS3. But Bethesda did try to make sure everything works OK on PCs too.\r<br />\r<br />The end result is that, when traveling in Skyrim, either on foot or by fast travel, it is now possible that you to run into problems with ILS/CTD issues. This is especially true in Whiterun,Windhelm and almost guaranteed to happen when trying to get back from Solstheim. It&#39;s also likely to happen when fast traveling from one city to another, and CTD may result when trying to enter some interiors after you arrive.\r<br />\r<br />Fortunately the PC gaming community has devised a solution to this problem in the form of a pre-load &#34;memory patch&#34;. There are several options, but the the most common (and most recommended) one is the SKSE tool (1.7 or higher). Other recommended options are the Memory Patch tool, and the ENBoost Series tool, which help even more in reconfiguring how RAM is used by the game.\r<br />\r<br />For those who have SKSE installed, you have to configure it to resolve this memory management problem. How to do that: simply open your skse.ini file located in Skyrim/Data/SKSE and make sure that these two lines are present under the [Memory] tab:\r<br />\r<br />[Memory]\r<br />DefaultHeapInitialAllocMB=768\r<br />ScrapHeapSizeMB=256\r<br />\r<br />Logically, this should resolve the memory issues on all but the heaviest of load orders. If you still are having issues, then you can try either raising the 768 value to 1024, but with caution, and/or try the other 2 options as suggested above: the Memory Patch tool, and the ENBoost Series tool.\r<br />\r<br />[b][size=3]3.[/size] [size=2][u]Your mod isn&#39;t working at all&#33; I see no changes in my game. What to do[/u][/size][u]?[/u][/b]\r<br />Make sure you haven&#39;t passed the limit of 255 .esp plugin files in your game, otherwise the mods and or the game won&#39;t work properly&#33; There is a hardcore limitation set by Bethesda on how many .esp files can the game load at a time.\r<br />\r<br />[b][size=3]4.[/size] [u]Is the mod safe to uninstall in the middle of a gameplay? [/u][/b]\r<br />Yes, of course&#33; SkyBeRoads is a script-free mod, and does not include anything that could affect the NPCs, the quests, the monsters, or the carriages, or whatever else, in any way. Nor will it break your SaveGames. The mod is absolutely safe to uninstall and install anytime, and as many times as you please, during the gameplay, worry-free&#33; SkyBeRoads is a very clean mod. Uninstalling SkyBeRoads leaves no clutter behind, and no traces of the mod will remain on your Savegames, at all&#33;\r<br />\r<br />[b][size=3]5.[/size] [u]Does SkyBeRoads remove anything from the roads? [/u][/b]\r<br />Nope. Absolutely no. SkyBeRoads does not remove any existing objects or items from the roads of Skyrim. SkyBeRoads only adds some extra roadside decors such as fences, where there was a need for them. This is done carefully, without over-cluttering the roads.\r<br />\r<br />[b][size=3]6.[/size] [u]Huh? Fences?&#33; Improved roads?&#33; Why to have fences and better main roads in Skyrim? They do absolutely nothing and aren&#39;t part of the lore&#33;[/u][/b]\r<br />You are absolutely wrong here. Let me copy/paste here a fellow hardcore Elder Scrolls gamer&#39;s comment: &#34;Since Morrowind already, I felt a basic but brutal disparity between the Imperial Empire and the Roman Empire: Romans put A LOT of time, money and resources in building and maintaining roads. They knew that good roads make easy not just for merchants to travel, but also for the Empire to protect its provinces, by dispatching troops in a speed never seen before. Good roads means faster communication. Cities have their sizes, complexity and wealth defined by the flux of people and goods. But let&#39;s just think about the USA, the automobile nation. Do i need to say more ? Then i can say that FINALLY someone came with the mod that actually add something not just lore friendly, but lore necessary, because without it the Cyrodiilic Empire have no way to exist. You covered the biggest miss of the entire TES saga.&#34;\r<br />\r<br />[b][size=3]7.[/size] [u]The side paths, mountain paths, and secondary roads, are they going to be fenced? That would be a little too much&#33;[/u][/b]\r<br />Nope. SkyBeRoads does not add fences to any roads or paths that lack any strategic value and are not used by merchants and carriages.\r<br />Only the important main roads of Skyrim get such &#34;upgrades&#34;.  See the Ivarstead module for example. Mountain paths and other paths won&#39;t be getting fences unless there are true reasons for that.\r<br />\r<br />[b][size=3]8.[/size] [u]Could you do a version without removed plants and trees? [/u][/b]\r<br />SkyBeRoads does not remove any trees or plants, at all. SkyBeRoads only corrects some immersion-breaking issues found on the roads, such as misplaced big plants that are growing from within the... stones of the main road to Solitude, which can be an eyesore. Grass is OK, but, really, 12 meters tall Pine Trees and 2 meters-tall grass to grow on the main road to the capital of Skyrim, Solitude? No way&#33; Even the village of Riverwood had better roads than Solitude ever does. SkyBeRoads comes to correct this. In this case, these plants and pine trees aren&#39;t removed - they are moved slightly (by a few feet, lets say) so they no longer block the people and carriages from using these main roads to travel to the Skyrim&#39;s capital cities. After all, the main roads of Skyrim are supposed to be used extensively by merchants / soldiers and carriages and reflect the social / economic status of the capital cities&#33;\r<br />\r<br />[b][size=3]9.[/size] [u]Why are there no navmesh edits? What about the NPCs who may be trying to walk through the fences? [/u][/b]\r<br />The NavCut Collision Markers eliminate any need for NavMeshing in SkyBeRoads. With the NavCut Collision Markers, everyone, including the NPCs, enemies, monsters, and creatures, will intelligently go around the fences to reach their targets. The NavCut Collision Markers do exactly what navmesh does, just without causing any conflicts with others. Thanks to Arthmoor, author of the Unofficial Patches, for his valuable help&#33;\r<br />\r<br />[b][size=3]10.[/size] [u]I have installed the X texture mod which re-colors the fences / bridge parts, differently&#33; I demand that you fix that&#33;[/u][/b]\r<br />SkyBeRoads&#39; fences and bridges are designed using the normal, lore-friendly and matching texture colors for the fences and bridges the game has to offer to the modders. So, if you are using any custom texture mods that causes potential texture color mis-matches or other eyesores on the fences or on parts of the bridges, the best you can do is to remove the particular texture files from your Textures Folder, or uninstall the texture overhaul mod completely from your game. You should understand that there are hundreds of texture mods available for Skyrim out there, which makes it impossible for me and every other author out there to take every of them in account when making the decorations in our mods. You are solely responsible for the use of any texture mods in your game, not the authors who create the mods. The best you can do is to switch to a different texture mod, or just remove the specific texture files that are causing to you any eyesores, from your Textures folder that affect the bridges and fences.\r<br />\r<br />[b][size=3]11.[/size] [u]Are there more updates coming for SkyBeRoads? Will there be more bridges / roads done by the mod?[/u][/b]\r<br />Of course&#33; SkyBeRoads will being kept updating as frequently as long as the community (you) is supporting my efforts to bring you better roads for Skyrim&#33; SkyBeRoads aims to update and improve all the main roads (and some secondary roads) in all the nine (9) Holds of Skyrim&#33; Please do not ask me which roads are coming next. Have patience and wait for mod updates and announcements.\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]CREDITS[/size][/heading][/u]\r<br />[list][*]to SilentResident for actually creating the mod.[/*]\r<br />[*]to [url=http://www.nexusmods.com/skyrim/users/684492/?]Arthmoor[/url] for his help with the NavCut Collision Markers of the mod and for the info about CTD solutions in his OCS page.\r<br />[/*][*]to [url=http://forums.nexusmods.com/index.php?/user/3085408-zlostnypopolnik/]zlostnypopolnik[/url] for the picture frames which are used for the mod. A special thanks to him&#33;[/*]\r<br />[*]to [url=http://forums.nexusmods.com/index.php?/user/4599069-crinch33/]crinch33[/url] and to [url=http://www.nexusmods.com/skyrim/users/4536241]raulfin[/url] for their help in making the mod&#39;s FOMOD Installer&#33;\r<br />[/*][*]to  [url=http://www.nexusmods.com/skyrim/users/2388835]hodilton[/url] for the ENB pictures from his video, as well as for the video itself. A special thanks to him&#33;\r<br />[/*][*]to [url=http://www.nexusmods.com/skyrim/users/3140928]izon87604[/url] and [url=http://www.nexusmods.com/skyrim/users/8929079]Thyworm[/url] for their videos of the mod. A special thanks to them&#33;\r<br />[/*][*]to Bethesda, the developer of the Elder Scroll series.[/*]\r<br />[*]to Nexus Team for the awesome Nexus Site, the great mod hosting & sharing website.[/*]\r<br />[*]to you for supporting the mod&#33; Your support keeps the SkyBeRoads mod alive&#33;\r<br />[/*][/list]\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]BUGS / PROBLEMS[/size][/heading][/u]\r<br />1 bug/problem reported thus far: In the Whiterun Module of the SkyBeRoads, especially at Honningbrew Meadery, some Whiterun guards may get stuck near the fences. The upcoming updates of the mod&#39;s Whiterun Module will remove the fences and fix the bug. Thanks for your patience.\r<br />\r<br />\r<br />\r<br />[u][u][heading][/heading][/u][/u]\r<br />[u][heading][size=4]HISTORY/CHANGELOG[/size][/heading][/u]\r<br />[b]Version 1.3 - Date: 06/09/2014[/b]\r<br />[list][*]Compatibility with Skyrim Bridges added.[/*]\r<br />[*]Clipping with Immersive Settlements fixed.[/*]\r<br />[*]All Pathfinding issues related to SkyBeRoads are fixed.\r<br />[/*][*]Whiterun Module updated.[/*]\r<br />[*]Ivarstead Module updated.[/*]\r<br />[*]Solitude Module updated.[/*]\r<br />[/list]\r<br />[b]Version 1.2 - Date: 02/09/2014[/b]\r<br />[list][*]Whiterun Module released.[/*]\r<br />[*]Ivarstead Module updated.[/*]\r<br />[*]Solitude Module updated.[/*]\r<br />[/list][b]\r<br />Version 1.1 - Date: 29/08/2014[/b]\r<br />[list][*]Ivarstead Module released.[/*]\r<br />[*]Solitude Module updated.[/*]\r<br />[/list][b]\r<br />Version 1.0 - Date: 28/08/2014[/b]\r<br />[list][*]Solitude Module released.\r<br />[/*][/list]",
  "categoryId": "78",
  "version": "1.3",
  "author": "SilentResident",
  "createdUnix": "1409244561",
  "updatedUnix": "1410008588",
  "containsAdultContent": false,
  "uploadedBy": "SilentResident",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000124999",
      "name": "Skyrim Better Roads (FOMOD Installer - All options included) - OLD VERSION",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "91",
      "fileName": "Skyrim Better Roads - FOMOD Installer (All options included)-57612-1-2.rar",
      "uploadedUnix": "1409664736",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/28da16f40ffbeede138b9e97d4eb43fb3c2796523273ca92684031769378c7ae/analysis/1409664845/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Better%20Roads%20-%20FOMOD%20Installer%20%28All%20options%20included%29-57612-1-2.rar?fid=1000124999&ttl=1535843736&ri=8192&rs=8192&setec=8238f36a5a484a3112cdf46fed6658a7"
    },
    {
      "fileId": "1000125571",
      "name": "Skyrim Better Roads (FOMOD Installer - All options included)",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5311",
      "fileName": "Skyrim Better Roads (FOMOD Installer - All options included)-57612-1-3.rar",
      "uploadedUnix": "1410008588",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/d01e0e1ff7de1636a4eb22ad5f0577d31c3e08e9037e9d924ff4b8d37e447cc9/analysis/1410008706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Better%20Roads%20%28FOMOD%20Installer%20-%20All%20options%20included%29-57612-1-3.rar?fid=1000125571&ttl=1535843736&ri=8192&rs=8192&setec=3d493e6b3820d60c96ab99cac3ce2ed8"
    }
  ]
}