{
  "modId": 57621.0,
  "modName": "Rayan - Quest Aware Custom Voiced Standalone Companion",
  "summary": "Rayan is a quest aware custom voiced companion. He is standalone and has a unique background story, he comes with his own quest and features about 300 lines of dialogue.",
  "descriptionHtml": "[font=Comic Sans MS][url=http://imageshack.com/f/ey8U3DZjp][img]http://imagizer.imageshack.us/v2/280x200q90/538/8U3DZj.png[/img][/url][/font][font=Comic Sans MS][url=http://imageshack.com/f/ey8U3DZjp]\r<br />[/url][color=#cc0000]Rayan 1.1 has been released&#33;[/color]\r<br />[color=#f4f4f4][size=2]Rayan is now Available for marriage after you complete the (Wanted: Dead or Alive) Quest&#33; Brings along unique dialogue for marriage.\r<br />Polished, rerecorded and replaced some dialogue&#33;\r<br />[/size][/color][color=#f4f4f4][size=2]More Quest Aware Dialogue. Once you become the Leader of the Dark Brotherhood Rayan will fear you and look up to you more&#33; (etc)\r<br />[/size][/color][color=#f4f4f4][size=2]Rayan comments on even more places in Skyrim.\r<br />[/size][/color][color=#f4f4f4][size=2]Rayan has more dialogue in combat&#33;\r<br />[/size][/color][color=#f4f4f4][size=2]New Feature can ask Rayan what he wants.\r<br />[/size][/color][color=#f4f4f4][size=2]Rayan comments on some of the armor you wear\r<br />[/size][/color][color=#f4f4f4][size=2]Rayan comments on the weather, swimming, running and many other activities.\r<br />[/size][/color][color=#f4f4f4][size=2]Rayan Comments on many people in Skyrim including Queen Potema, Camilla, Lydia, High Queen and King. Grelog the kind and much more.\r<br />[/size][/color][color=#f4f4f4][size=2]New Quest (Wanted: Dead Or Alive)\r<br />[/size][/color][color=#f4f4f4][size=2]More jokes and humor and m[/size][/color][color=#f4f4f4][size=2]uch more Content&#33;\r<br />[/size][/color]New Save game, is not really necessary.\r<br />\r<br />[/font]\r<br />[youtube]mQlVTjYJYkw[/youtube]\r<br />Race: RedGuard\r<br />Class: Combat Monk\r<br />Perks: Lightfoot, Muffled Movement, SilentRoll, Armsman, Avoid Death, Master Locks, Snake blood, Perfect Touch, Stealth\r<br />Location: Riverwood, behind the sleeping Giant inn, he works for the lumberjack, Hod.\r<br />Preferred Faction: Neutral\r<br />Likes: Skyrim, Jokes, Katanas, Women, Snowberries, Moonsugar, Adventures, Sailing\r<br />Levels: 30-100 (Non Essential)\r<br />\r<br />[size=3][color=#cc0000]Recommended Files[/color]\r<br />[url=http://http://www.nexusmods.com/skyrim/mods/27815/?]Fi[/url][/size][color=#0000ff][size=3][url=http://http://www.nexusmods.com/skyrim/mods/27815/?]ne Face Textures for Men by Urshi[/url]\r<br />[url=http://http://www.nexusmods.com/skyrim/mods/53412/?]Frank&#39;s Scimitar by [b]FrankFamily\r<br />[/b][/url][/size][/color][url=http://http://www.nexusmods.com/skyrim/mods/2666/?]Caliente&#39;s Beautiful Bodies Edition -CBBE- by [b]Caliente[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36510/?]Superior Lore-Friendly Hair - HD textures by [b]skyrimaguas\r<br />[/b][/url][url=http://http://www.nexusmods.com/skyrim/mods/13722/?]The Eyes Of Beauty by [b]Gabriel Mailhot[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/2488/?]Better males - Beautiful nudes and faces - New hairstyles by [b]Chris57 and FavoredSoul[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25476/?]Evil MasterMind Armor by [b]Satyr ZeroFrost[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/13500/?]Redguard Knight Armor by [b]hothtrooper44[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15752/?]Hammerfell Assassin Suit by [b]Sasino[/b][/url]\r<br />\r<br />[b][u]Small Description[/u][/b]\r<br />Rayan is a very fierce and strong spirit, he has gone through many difficult situations in his life that has only made him stronger, he has a very rebellious and reckless attitude. Rayan craves someone to talk to, he wants to find someone he can trust. Although he tries hard to hide his emotions, inside he is burning with rage, anger, bitterness and sadness, he craves for a way out to forget his past, he spends most of his days drinking booze, plotting how he will murder those who betrayed him and took away everything he ever loved. Rayan use to live a happy life in Hammerfell with his beloved, he used to have it all, a big family, a great shop, treasures, food on the table, everything he ever wanted. As the families business collapsed Rayan sailed around planet Nirn, raiding ships, and working as a bloody mercenary but then he started to miss his beloved and his hometown and as he came back to the love of his life, she convinced him to leave the mercenary life behind as his families business was at an all time high and there was no need for him to be a mercenary anymore. The Crew was very bitter and angry about that decision as Rayan got richer his crew got poorer as they wasted all their coin on gambling, hookers, skooma, moonsugar, and other strong drugs in Hammerfell. his crew got so jealous of Rayan as he had it all that they betrayed him out of jealousy and misfortune. They took everything he ever loved, and forced him to flee Hammerfell and start a new chapter with nothing but memories of his past. \r<br />[font=Comic Sans MS][color=#cc0000][size=3][b][url=http://imageshack.com/f/iqwMLpgip][img]http://imagizer.imageshack.us/v2/280x200q90/674/wMLpgi.png[/img]\r<br />[/url][/b][/size][/color][/font]300+ Unique lines of Dialogue\r<br />Rayan is also Quest AwareYou can ask Rayan whats on his mind and a bit more about himself.\r<br />Rayan brings his own Quests, and journal&#39;s\r<br />Rayan is standalone and brings his own custom weapons and armor.\r<br />Rayan Comments on his sorroundings, including all holds of Skyrim.[font=Comic Sans MS]\r<br />Rayan is a quest aware custom voiced companion. He is standalone and has a unique background story, he comes with his own quest and features about 300 lines of dialogue.[/font]\r<br />[font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS][color=#cc0000][size=3][b][url=http://imageshack.com/f/ipREX4eQp][img]http://imagizer.imageshack.us/v2/280x200q90/673/REX4eQ.png[/img][/url][/b][/size][/color]\r<br />1. The Bloody After Party:\r<br />[/font]Rayan got really drunk and as his daily routine he went to the Sleeping giant inn to get wasted. He was partying with hookers and other friends, but he got so drunk he didn&#39;t remember a thing, and got robbed by hookers, he woke up naked near the bushes out the inn, he felt humiliated, angry and bitter and wants his coin back.\r<br />\r<br />2. Wanted: Dead Or Alive\r<br />Rayan has a bounty on his head, and many people are looking to kill him in Hammerfell, Rayan receives a letter from a relative back home from Hammerfell, the Rebels of Rihad his old crew have crossed the border and are looking for Rayan in Skrim, Rayan goes on a journey to get revenge on those that took everything he ever loved.\r<br />\r<br />[font=Comic Sans MS][url=http://imageshack.com/f/f0I7JIj5p][img]http://imagizer.imageshack.us/v2/280x200q90/540/I7JIj5.png[/img]\r<br />[/url][/font][font=Comic Sans MS]Rayan was born in Hammerfell he was born into a middle class family. He had many brothers and sisters. When he was 12 years old he went to train with his Grandfather which was a monk, he trained in the hot deserts for years until he was 17 he mastered the art of combat and was an unstoppable force to be feared, as he walked back to his home in Hammerfell he got bit by a snake and thanks to his natural resistance to poison he survived but nearly died, now Rayan has a even higher resistance to poison. When he went back to his home town he dived into the well and stayed their for hours. His family was so excited to see him including his beloved Ruby, the love of his life. He lived a very happy and prosperous life and often tended his families business. When he turned 21 he decided to help out for his family as the families business went on a economical crisis. He decided to join his crew of bandits and work as a mercenary, he boarded a ship and sailed around planet Nirn, he went to many places, including the imperial city, Black Marsh, Valenwood, he became so strong and wealthy raiding other ships, taking assassinations contracts, but then he started to miss his family and decided to stop at Stros M&#39;kai there he learned the power of magic. As he went back to his home the families business was at an all time high, and he decided to marry his wife Ruby, she convinced him to leave the life of a mercenary behind. His crew was not so happy and got really bitter and angry as Rayan was one of the best warriors and key to success&#33; He lived a happy life with his wife, but the family business started to receive more threats and more people started getting jealous of their wealth the same bandits that used to run with him, demanded that they pay protection money to them Rayan&#39;s father denied them and stabbed one of the bandits but didn&#39;t kill him, he just got tired of people taking him for a joke. Rayan didn&#39;t blame him at all. But a few weeks later all hell broke loose. His father got pinned down in an alley way near the shop as he was walking back home, and they also killed Ruby and the people that were in the shop working that day. It was a really sad day, in the morning Rayan went to visit the shop and he could see a cloud of black smoke from a mile away, he witnessed Ruby with a dagger pierced in her chest, and the bloody mess the bandits had left, then there was a note saying your next. The bandits who performed the murder of his beloved was long gone, but their was a few bandits their looting the place in the morning Rayan quickly killed a few and as they called for backup he realized there was too many of them, he quickly ran as hard as he could and almost got riddle with arrows, but as an arrow almost pierced his back he jumped into a wagon that was going downhill, all the arrows flew right over his head, and he managed to escape. Rayan decided to go North to Skyrim, and with tears and great lament in his heart he drank wine until he passed out in the wagon. Rayan swore one day to get Revenge on his family. But he first needed some time to heal and some time to get stronger to face his new enemies, he arrived in Riverwood he fell in love with the forest, and right away Hod offered Rayan a job chopping wood, it was with great sadness Rayan lived his new life, but he was always hopeful, and spent most of his days working hard labor and spending his earnings on booze at the Sleeping Giant inn.\r<br />\r<br />[color=#cc0000][size=3][url=http://imageshack.com/f/ezjKOfeqp][img]http://imagizer.imageshack.us/v2/280x200q90/539/jKOfeq.png[/img]\r<br />[/url][/size][/color]Skyrim.esm\r<br />Latest Update 1.9\r<br />\r<br />[b][u][size=4]My other mods\r<br />[url=http://www.nexusmods.com/skyrim/mods/52093/?]GOS - Gangs Of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/56530/?]The Nightingale Brotherhood[/url][/size][/u][/b]\r<br />\r<br />\r<br />\r<br />[/font][font=Comic Sans MS][b][color=#0000ff][size=3][url=http://imageshack.com/f/eycmyw8cp][img]http://imagizer.imageshack.us/v2/280x200q90/538/cmyw8c.png[/img][/url][/size][/color]\r<br />[/b]Compatible with most mods you shouldn&#39;t have a problem I run with Rayan together with Inigo, Sofia etc\r<br />[/font]For best results I recommend the AFT mod&#33; and it&#39;s recommended to place Rayan at the bottom of your load order.[font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]I have cleaned this mod with Tes5Edit and it also brings it&#39;s own SEQ file, so you don&#39;t have to save and reload.\r<br />[/font][font=Comic Sans MS]The hunting bow that automatically spawns in your Companions has been fixed in this mod. \r<br />[/font]\r<br />[color=#0000ff][url=http://imageshack.com/f/f0X7jTxUp][img]http://imagizer.imageshack.us/v2/280x200q90/540/X7jTxU.png[/img][/url][/color]\r<br />I want to thank Insanity Sorrow for all his amazing mods and modders resources&#33; The Celtic Katana is his creation, by far one of the greatest Modder’s.[font=Comic Sans MS]I want to thank Sushiyant for the Ariyan Weapon Pack&#33; and also for the meshes and textures&#33; VengenceMkII, Adonnay, Hel Borne, mbj_mje\r<br />[/font][font=Comic Sans MS]I want to thank  Lord of War & CD Projekt Red, The Witcher, The Witcher 2 Models used in this mod&#33;First of all also want to give credit to the Skyrim Nexus Community, and the creators of The Elders Scrolls Series, thank you Bethesda one of the best gaming studios up to date.[/font]",
  "categoryId": "66",
  "version": "1.1",
  "author": "RayneRed",
  "createdUnix": "1409276200",
  "updatedUnix": "1409518711",
  "containsAdultContent": false,
  "uploadedBy": "Raynel07",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000124359",
      "name": "Rayan 1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "37480",
      "fileName": "Rayan 1.0-57621-1-0.zip",
      "uploadedUnix": "1409275614",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/506dd3ae9ac98b58d3db5b6453955e7ccfb2d90aeb3234e7d8d68e7789dfea06/analysis/1409275707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rayan%201.0-57621-1-0.zip?fid=1000124359&ttl=1535843751&ri=8192&rs=8192&setec=8e5e580843b189467646c3752f17cf87"
    },
    {
      "fileId": "1000124753",
      "name": "Rayan 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "41682",
      "fileName": "Rayan 1.1-57621-1-1.zip",
      "uploadedUnix": "1409518711",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/af4ac868490f956f0d7dd4206c69e63aa191f6d6e805441c569ac0e1a7b73c03/analysis/1409518811/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rayan%201.1-57621-1-1.zip?fid=1000124753&ttl=1535843752&ri=8192&rs=8192&setec=e60027384ea6851626df5e65a1870358"
    }
  ]
}