{
  "modId": 57681.0,
  "modName": "Weapons and Armor Reloaded",
  "summary": "All non-playable weapons and armor have now been made playable, craftable and upgradable.",
  "descriptionHtml": "This is a mod I made ages ago (the first mod I ever made actually) just for myself really, and I&#39;ve finally decided to upload it for you guys. I wouldn&#39;t say it&#39;s finished yet, but it&#39;s in a perfectly usable state, and I&#39;ll list what my future plans are for this mod at the bottom of the description.\r<br />\r<br />[b]What Does It Do?[/b]\r<br />All previously unplayable weapons and armors have now been made playable, and are craftable at either the forge or tanning rack, and also upgradable.\r<br />(please let me know in the comments if I&#39;ve missed any)\r<br />Note: I did not make the summerset shadows armor craftable as it looks identical to thieves guild armor so I thought there was no point. Also, I have changed the executioner armor set to be light armor rather than clothing as I thought it was more appropriate to it&#39;s appearance.\r<br />[b]\r<br />Installation:[/b]\r<br />Just install normally using NMM or manually extract the esp to your data folder.\r<br />[b]\r<br />Compatibility:\r<br />[/b]There should be no compatibility issues. I myself also use Weapons and Armor Fixes Remade and Complete Crafting Overhaul and have no problems.\r<br />\r<br />[b]Future Plans:[/b]\r<br />[list][*][size=2]Make Herebane Sorenshield exist in game and make his unique sword and shield retrievable only from him in a sort of mini quest, so they will no longer be craftable at the forge (they are right now) which is much more lore-friendly.[/size][/*]\r<br />[*][size=2]Do the same with any other unique weapons and armors, i.e make them not craftable so they can only be obtained by finding them in appropriate dungeons or wherever they should be.[/size][/*]\r<br />[/list]",
  "categoryId": "36",
  "version": "1.0",
  "author": "simsim899",
  "createdUnix": "1409430803",
  "updatedUnix": "1409430772",
  "containsAdultContent": false,
  "uploadedBy": "simsim899",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000124596",
      "name": "Weapons and Armor Reloaded",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Weapons and Armor Reloaded-57681-1-0.rar",
      "uploadedUnix": "1409430772",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b251b33fba81cbed919ab0b224bf06383e03240697e32508449bdab9c26c992f/analysis/1409430843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weapons%20and%20Armor%20Reloaded-57681-1-0.rar?fid=1000124596&ttl=1535843820&ri=8192&rs=8192&setec=61b6b914bea7f0c31297f0260872d786"
    }
  ]
}