{
  "modId": 57718.0,
  "modName": "Craftable Staves- Dragonborn Addon",
  "summary": "If you thought the staff crafting table in dragonborn DLC did not make up for the lack of craftable saves in skyrim, this mod is for you. you can now craft all the staves that can be crafted in dragonborn at a forge but depending on your enchanting skill. you can also craft the unenchanted staves if you have the arcane enchanter perk.",
  "descriptionHtml": "DRAGON BORN DLC REQUIRED&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />when i heard that the dragonborn dlc added craftable staves, i was thrilled. but i was pissed off that it only added one station in the entire game, let alone in that one island away from the rest of skyrim. &#34;wait so how do these wizards have those staves? did they craft it in solstheim and move to skyrim? do solstheim traders ship those staves to wizards? how come you need heart stones to make staves, since there are no heart stones in skyrim?&#34;    in short, i didn&#39;t like it.\r<br />\r<br />with this mod, you can craft staves at a normal smithing forge: \r<br />\r<br />you can craft the unenchanted staves at the staff enchanter with one hearth stone, 3 firewood and a varying ingot, OR at a normal forge, requiring the perk arcane enchanter, but with a filled grand soulgem instead of one heart stone.\r<br />\r<br />you can craft the actual enchanted staves at the smithing forge, but you still need to know the spells like the original staff crafting concept. you do not need any skill in smithing tree to craft the enchanted staves, nor the heart stones, but need at least the second enchanter perk. the stronger the enchantment of the staff, the higher the enchanter perk you need. THE RECIPES ARE BASED ON HOW MANY HEART STONES ARE REQUIRED FOR THE NORMAL STAFF CRAFTING RECIPES, BUT INSTEAD OF HEART STONES, YOU NEED THE ENCHANTER PERK EQUIVALENT TO HOW MANY HEART STONES.\r<br />\r<br />example: to craft the frostbite staff, you would need a heart stone and the unenchanted destruction staff. but to make the same one at a normal forge, you need the unenchanted staff, and the second enchanter perk (at lvl 20). \r<br />example 2: to craft the command daedra staff, you would need the 5th enchanter perk (at level 80)\r<br />\r<br />simply put: crafting a staff at a forge means you need the enchanter perk of lvl 2X the number of heart stones needed at the staff enchanter.\r<br />\r<br />&#34;blah, but paul&#33; how is this lore friendly&#33; uh duh you need heart stones to make dem staves&#33;&#34;  it&#39;s lore friendly (at least to me) because a true staff enchanter would know the spell and would invest in the enchanter perks. if you don&#39;t, then go find those heart stones in solstheim and use the staff enchanter. you don&#39;t need skills in enchanting or smithing to make one at that station. but if you live in skyrim, where there are no heart stones or a staff enchanter, you would need to train your enchanting skill to craft an enchanted staff. seems like a fair trade off to me. \r<br />\r<br />again, you need to know the spells for each enchanted staff.\r<br />\r<br />(finally i added a craftable forsworn staff that appears if you have finished the quest for melka or the darklight tower quest. depending on which quest you finished, you can also craft the enchanted version of the forsworn staff. i made the recipe easier though, and i only added the craftable unenchanted staff at the forge, not the staff enchanter, since i doubt there are any forsworn living in solsthiem or morrowind) \r<br />- plz report any bugs, glitches or so on. enjoy :)\r<br />\r<br />VERSION 2:\r<br /> i updated it to make it easier to craft spells at the forge: now instead of forcing you to know the spell, you just need the spell tome. you also need a filled soul gem based on how strong the spell of the staff you want to craft is, for balance. ex: grand soul gem for master level spell, and greater for expert. you still need to have at least the  second enchanter perk, that part is unchanged. the way i see it, if dragonborn expects you to know the spell to craft the staff, then what about those wizards who use the staff but not the spell? i think it&#39;s easier to just be a high level enchanter with the spell tome to craft the staff than a high level enchanter who knows how to use the spell, too.\r<br />i also increased the ingots used from 1 to 2. \r<br />\r<br />VERSION 3:  same as version 2 but now you no longer need to have a high enchanting skill. just have the arcane enchanter perk, the right material, the filled soul gems and a spell tome. also I added falmer staves to the crafting list, so yea, this requires dawnguard and dragonborn now. I think this is the most lore friendly version. and I am sure that I am done with this mod now&#33; unless I think of a better idea or there was a bug. anyway, I&#39;m done&#33;&#33;&#33;",
  "categoryId": "75",
  "version": "1",
  "author": "paulhanna",
  "createdUnix": "1409523365",
  "updatedUnix": "1434725978",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000124766",
      "name": "dragonborn craftable staves ",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "dragonborn craftable staves -57718-1.rar",
      "uploadedUnix": "1409523354",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/75d9d1f6b35e4ce65d22eacb4b49a64712fab66d5cd8329a421763ec2e9b2dcd/analysis/1409523366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/dragonborn%20craftable%20staves%20-57718-1.rar?fid=1000124766&ttl=1535843876&ri=8192&rs=8192&setec=873ce6f9530cdc75c27f700d7915a3e3"
    },
    {
      "fileId": "1000136858",
      "name": "version 2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "version 2-57718-2.rar",
      "uploadedUnix": "1417035700",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/247562476fe7f97e4991a80c5573d034b87f238ede6ad8e36311a2005af6952d/analysis/1417035782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/version%202-57718-2.rar?fid=1000136858&ttl=1535843876&ri=8192&rs=8192&setec=17ef93ce80186df3734d7f89dce11639"
    },
    {
      "fileId": "1000164717",
      "name": "version 3 no enchanting skill required ",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "version 3 no enchanting skill required -57718-3.rar",
      "uploadedUnix": "1434725978",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/6706b566d2c9d6143dc8e82335efecc6e94132021b5cb4d3b8def768987e6a1f/analysis/1434726003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/version%203%20no%20enchanting%20skill%20required%20-57718-3.rar?fid=1000164717&ttl=1535843877&ri=8192&rs=8192&setec=3c335da4cf6447b67c87da37a97fc8c7"
    }
  ]
}