{
  "modId": 57766.0,
  "modName": "MarsKor&#39;s Skyrim Overhaul",
  "summary": "Absoloute Alpha WIP no file for download yet, but upgraded changelog here.",
  "descriptionHtml": "[center]﻿[u][size=5]MarsKor&#39;s Skyrim Overhaul[/size]\r<br />[/u]Actually no release yet changelog will follow.\r<br />\r<br />[u]Introduction\r<br />[/u]Well, because there is no file yet lemme give you a little grasp of what my plans are with this giant WIP.\r<br />At first im going to aim for some simple gameplay addon features like new scalings and more progresses etc.\r<br />based on wich im going to try to alter the gamplay as far as i can.\r<br />\r<br />[u]interested? lemme try to go a little into deatail[/u]\r<br />I&#39;ll be going to aim for a complete storyline addin like a second story quest line aswell as a big bundle of features like generic improvements(wich all going to be listed in the features section of the mod files as soon as there is a download)\r<br />\r<br />as soon as i think the first changes are worthy to be given out of developement for first impressions i will update this\r<br />(first changes are probably going to be a muscular growth system wich means that you physically improve by doing physical work)\r<br />-&gt; that means if you use your right arm with a 1handed sword your right arm muscles will grow and give some global incresements on actions linked with that right arm (in developement right now &#33;)\r<br />or the use of heavy armour(or overall carriing much in your backpack) conditions your body and allows you to slightly carry more or move faster(of course there will be balancing acts done)\r<br />\r<br />that&#39;s so for for my first step on this project before that i aint goin on with explainin because there is nothing for you yet.\r<br />\r<br />if there are any interests suggestions or stuff like that its appreciated(feel free to contact me then)\r<br />\r<br />till then see ya guys on the battlefield when the time comes\r<br />\r<br />PS&lt;&lt;iforgot&gt;&gt;: you probably goin to need HF - DB - DG official dlc&#39;s cause im using them in developement and also in later stages there are very likely going to be a lot of compatibility issues with other mods[/center]",
  "categoryId": "79",
  "version": "a0.0",
  "author": "MarsKor",
  "createdUnix": "1409666310",
  "updatedUnix": "1409666310",
  "containsAdultContent": false,
  "uploadedBy": "MarsKor",
  "primaryFile": null,
  "files": []
}