{
  "modId": 57799.0,
  "modName": "USURE - Acheter vos capacites",
  "summary": "Passer les niveaux sans gagner de point de compétence.\r<br />Obtenez ces points de compétences en lisant des livres mis en vente chez les marchands...",
  "descriptionHtml": "Lorsque vous passez un niveau, vous gagnez santé, magie ou endurance, mais pas de point de compétence &#33;\r<br />\r<br />Ceux-ci vont être recu en lisant un &#34;livre de compétence&#34;, article mis en vente chez les marchands, autant que vous pourrez en acheter &#33;\r<br />\r<br />Augmentation du perso lié donc au commerce et au loot, plus qu&#39;au passage des niveaux, ce qui change le gameplay, et donne une raison de fouiller le monde à la recherche de trésors, car ces livres ne sont pas donnés &#33;\r<br />\r<br />REMARQUE: les livres seront trouvables dans la catégorie &#34;divers&#34; de votre inevntaire, pas dans les livres &#33;\r<br />\r<br />enjoy\r<br />\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />[b]Pour ceux que cela intéressent et pour reprendre l&#39;initiative de cette série de mod, j&#39;aimerais particulièrement recommander et parler de ce mod, car depuis son installation, au côté d&#39;autres mods,  je me suis surpris à atteindre une expérience de jeu inhabituellement ronde, cohérente et harmonieuse en Bordeciel, \r<br />comme si le sentiment d&#39;absurde du jeu avait disparu, comme si finalement ce que souhaite cette série &#34;USURE&#34; commencait à se révéler: \r<br />Parvenir à injecter du désir, du défi, et un peu de logique dans ce chaos pseudo-ludique.\r<br />Voilà:\r<br />Le jeu à son origine envoie le joueur parcourir un monde énorme rempli d&#39;occasions telles que l&#39;ennui devrait être quasi proscrit; \r<br />Pourtant c&#39;est sous une pluie gratuite de compétences reçues et de milles trésors accumulés plus par habitude que par nécessité \r<br />que l&#39;on se rend compte de l&#39;absence de finalité, qu&#39;émergent l&#39;insipide d&#39;une toute-puissance éclectique et l&#39;absurdité de ne vouloir que &#34;collectionner&#34; vu l&#39;inutilité de l&#39;or en abondance  sinon à accumuler chevaux et maisons...\r<br />\r<br />En contraste de ceci, après l&#39;installation de ce mod (et d&#39;autres comme dit, mais surtout celui-ci), l&#39;univers abandonne cette générosité insipide pour\r<br />envoyer cette fois le joueur dans un monde dans lequel il va falloir travailler, interagir, couper du bois, tanner, construire, batailler, récolter, voler ou tuer... \r<br />Et au bout de trois niveaux passés et un parcours aventurier indescriptible, vous voilà enfin en possession des 1000 or nécessaires et mérités pour pouvoir vous procurer un livre de compétence, qui vous donnera un point à placer dans l&#39;arbre de votre perso, pour d&#39;autant mieux repartir vers d&#39;autres aventures.\r<br />\r<br />Ce point vous le placerez judicieusement, croyez-moi, selon vos choix de développement.\r<br />La boucle est pour ainsi dire bouclée, l&#39;or/le loot tel un résultat de vos actions devient vraiment une récompense, un indicateur d&#39;expérience, \r<br />fruit de vos agissements dans ce monde et structure votre développement, là où avant cet agaçant superflu de trésors venait gonfler les poches de vide \r<br />tant dans le jeu original il n&#39;y avait aucun rapport entre agissements, résultats de l&#39;agissement et développement du perso.\r<br />\r<br />En effet dans skyrim,  agissements et résultats de vos agissement sont liés dans le loot;\r<br />Agissements et développement du perso sont liés dans le gain des niveaux et des compétences;\r<br />Mais aucun rapport n&#39;existe entre résultats des agissements et le développement du perso, ce qui fait qu&#39;on agit vite avec un sentiment d&#39;absurde.\r<br />\r<br />C&#39;est précisément ce lien complètement décousu dans le jeu original entre fruits de vos agissements et développement du perso que ce mod parvient à raccommoder en imposant/proposant un investissement de vos récoltes et mérites pour vous spécialiser.\r<br />\r<br />Un tout petit mod, mais vraiment à essayer pour une toute autre expérience de jeu...\r<br />[/b]----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------",
  "categoryId": "24",
  "version": "1.2",
  "author": "Marcoousik",
  "createdUnix": "1409772760",
  "updatedUnix": "1410090759",
  "containsAdultContent": false,
  "uploadedBy": "marcousik",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000125169",
      "name": "USURE - Acheter vos points de competences",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "USURE - Acheter vos points de competences-57799-1-0.zip",
      "uploadedUnix": "1409772756",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/85d22264a1984891d161602a7cb6f0b1516c9d570d345ab02fbd79529eb452a1/analysis/1409772849/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/USURE%20-%20Acheter%20vos%20points%20de%20competences-57799-1-0.zip?fid=1000125169&ttl=1535843988&ri=8192&rs=8192&setec=7f5d739623a638bea53dc82827e0e5bd"
    },
    {
      "fileId": "1000125816",
      "name": "USURE - Acheter vos points de competences",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "USURE - Acheter vos points de competences-57799-1-2.zip",
      "uploadedUnix": "1410090759",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b7c85432345e3e53dac9e34bea523ddb4dfbb0969007044f237d8eacaffae242/analysis/1410090842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/USURE%20-%20Acheter%20vos%20points%20de%20competences-57799-1-2.zip?fid=1000125816&ttl=1535843989&ri=8192&rs=8192&setec=344bc027bcd51d6b76ba906b39dcc43f"
    }
  ]
}