{
  "modId": 57809.0,
  "modName": "My Pa&#39;s Axe",
  "summary": "&#34;My Pa&#39;s Axe. Stendarr preserve us&#34;",
  "descriptionHtml": "Isran once scoffed at the idea of a simple woodcutter&#39;s axe being his future recruit Agmaer&#39;s weapon of choice. An axe that belonged to Agmaer&#39;s pa no less. Little did Isran know, &#34;My Pa&#39;s Axe&#34; is no ordinary woodcutter&#39;s tool, it is a lethal instrument of death.\r<br />\r<br />This mod is very straightforward. It adds a unique woodcutter&#39;s axe called &#34;My Pa&#39;s Axe&#34; to the game. It appears in Agmear&#39;s inventory as you approach Fort Dawnguard. It also appears on a barrel on the first floor of Fort Dawnguard, in the set of rooms immediately to the left of the entrance. It can be upgraded at a grindstone, and is not affected by any smithing perks.\r<br />\r<br />This is my first mod, so be gentle in your criticism. I am no modder, so it doesn&#39;t use any fancy new models or textures. Don&#39;t expect anything balanced either. It is overpowered, but definitely not a god item by my standards (my standards aren&#39;t really high though, so consider that). Also, this mod was made for shits &#39;n&#39; Giggs, so I won&#39;t take anything seriously if you comment about it. In fact, ignore the first sentence of this paragraph and just lay it on me.\r<br />\r<br />With that said, enjoy it if you download the mod, if you don&#39;t I can&#39;t blame you.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Kuboxxl",
  "createdUnix": "1409799870",
  "updatedUnix": "1409799811",
  "containsAdultContent": false,
  "uploadedBy": "kuboxxl",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000125212",
      "name": "My Pa&#39;s Axe",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "My Pa's Axe-57809-1-0.rar",
      "uploadedUnix": "1409799811",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4744087e0c50a757ade078c06d6ecc7ce5e0bc6fb020eaceab9f117c61553b32/analysis/1409813942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20Pa%27s%20Axe-57809-1-0.rar?fid=1000125212&ttl=1535844001&ri=8192&rs=8192&setec=202af9761c7cae161d4b2e57ab71ad03"
    }
  ]
}