{
  "modId": 5782.0,
  "modName": "Advance all skills to 90",
  "summary": "Are you tired of leveling up your character to something amazing, only to find out that there are no worthwhile quests left? Do you wish you could rewind your life in Skyrim and relive all those glorious moments with all the master skills you have right now? Then this mod is for you.\r\n\r\nThis batch file lets you advance all your skills to 90 approx.",
  "descriptionHtml": "Are you tired of leveling up your character to something amazing, only to find out that there are no worthwhile quests left? Do you wish you could rewind your life in Skyrim and relive all those glorious moments with all the master skills you have right now? Then this mod is for you.\r\n\r\nThis batch file lets you advance all your skills to approximately 90. The reasons I made the skills \\'advance\\' to 90 are as follows:\r\n\r\n1) You get to earn perk points. Using \\'setav\\' on the console will only \\\"set\\\" your skills to 90. Anybody could do it, and that won\\'t earn you the perk-points that you could\\'ve otherwise earned.\r\n\r\n2) A similar cheat-mod to max your skills to 100 already exists. But using that cheat-mod removed the fun associated with earning skills from quests and skill books.\r\n\r\n3) Quick perk-points. Aside from the initial 71 perk points you\\'d earn, what if you decide to change your style of game-play in the middle of the game? What if you initially started out as a Mage (distributing your perks amongst magic schools) but want to change over to a thief? If you reset your level to level-1 using \\'player.setlevel 1\\' cheat, you can gain levels for almost every 2 skill levels (increasing a skill-level from 90 to 91 gets you a lot more XP than increasing it from 15 to 20). So, you can still retain the joys of level-ups just like in the vanilla game. \r\n\r\n4) I found that I got stuck with the role I chose in the later levels. At level 45, a Mage wouldn\\'t really want to try and improve his combat skills to become a Warrior. But with this mod, the only things that make a difference between a skilled Archer and a Warrior, are the perk points. You can always assign your perk points to any skills you want thereby letting you become anything you want. \r\n\r\nThis mod best works with the \\'Dragon souls to perks\\' mod.\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2063\r\n\r\n\r\nInstallation/Usage\r\n1) Extract the AdvSkills.txt file to your main Skyrim directory (the \r\none containing TESV.exe).\r\n\r\n2) In your game, open the console (hit the tilde ` key) and type \\\"bat AdvSkills\\\".\r\n\r\n If you use it right at the start of the game (just after creating your character and siding with Hadvar/Ralof), all your skills will increase to exactly 90. Otherwise, it could increase to anywhere between 90 and 100 depending on how much skill you have already earned. Your skills may also vary depending on the initial skills of the race you have chosen.\r\n\r\nUninstall:\r\nJust delete the AdvSkills.txt or simply don\\'t use it :)\r\n\r\nCredit: Inspired from Els236\\'s advance all skills mod.",
  "categoryId": "40",
  "version": "1.0",
  "author": "divyanthj",
  "createdUnix": "1326145658",
  "updatedUnix": "1326145713",
  "containsAdultContent": false,
  "uploadedBy": "divyanthj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18317",
      "name": "Advance all Skills to 90",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Advance all Skills to 90-5782.rar",
      "uploadedUnix": "1326145713",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/63cc006070c9556f7c38bb616647ce7cb7bd83eeb3424ba21b5a10af0e255d95/analysis/1406597408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Advance%20all%20Skills%20to%2090-5782.rar?fid=18317&ttl=1535762794&ri=8192&rs=8192&setec=1fe9c79729bfa750e3a670099f148240"
    }
  ]
}