{
  "modId": 57866.0,
  "modName": "True Hardcore Morrowskooma",
  "summary": "Alters skooma&#39;s effects to be more like Morrowind... With more intense weaknesses, as well as strengths- including faster movement speed, stronger melee attacks, worse lockpicking/pockpocket and way less magicka. All effects last 60 seconds.  Also alters the prices of skooma to be more like Morrowind. 500 for normal skooma, 1000 for double-dist",
  "descriptionHtml": "Alters skooma&#39;s effects to be more like Morrowind... With more intense weaknesses, as well as strengths than other skooma mods seen here on the Nexus- no longer gives back stamina. All effects last 60 seconds.\r<br />\r<br />Positive Effects: 20+ unarmed effectiveness , 20+ one handed effectiveness, 20+ two handed damage effectiveness, 100 carry weight, 55+ movement speed for 60 seconds.\r<br />Negative Effects: 285 ravage magicka, 50% less magicka regeneration, 20 less lockpicking and pickpocket effectiveness for 60 seconds, and 88% less stamina regen for 120 seconds.\r<br />\r<br />Double-Distilled Skooma Postive Effects: 40+ unarmed effectiveness , 40+ one handed effectiveness, 40+ two handed damage effectiveness, 200 carry weight, 110+ movement speed.\r<br />\r<br />Double-Distilled Skooma Negative Effects: 570 ravage magicka, 100% less magicka regeneration, 15 less max\r<br /> stamina, 40 less lockpicking and pickpocket effectiveness for 60 seconds, and 176% less stamina regen for 240 seconds.\r<br />\r<br />Ending note: I made this, because none of the other skooma mods increased melee damage (weapons as WELL as unarmed), and none of them had intense enough weaknesses as well, well one of them did, but didn&#39;t have the increased movement speed.\r<br />\r<br />I made the magicka drained by 285, because I wanted to ensure that even if you had a high magicka pool, that it still drained a lot of magicka, because in Morrowind the max magicka amount was much lower... And skooma is SUPPOSED to temporarily augment you physically at the cost of magical or intellectual abilities anyways. I added the stamina drain effect, so it could partially simulate lower agility, EVEN MORE so if you use a mod that slows time with stamina- while still only draining a tiny amount of stamina, and making you move much faster regardless.\r<br />\r<br />Compatability: Anything that alters the effects of magical effects of Skooma/Double-Distilled Skooma/Kordir&#39;s Skooma will probably conflict, though this is almost definitely 100% compatible with anything else. This mod also does not alter Redwater Skooma at all, being a completely separate mod.",
  "categoryId": "94",
  "version": "",
  "author": "Lectra",
  "createdUnix": "1410003106",
  "updatedUnix": "1410005914",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000125564",
      "name": "TrueHardCoreMorrowSkooma",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "TrueHardCoreMorrowSkooma-57866-.zip",
      "uploadedUnix": "1410005914",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d306846396f2cc6ac8265c44f533220ff6982f28012b96f13987b29f76448784/analysis/1410006005/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TrueHardCoreMorrowSkooma-57866-.zip?fid=1000125564&ttl=1535844090&ri=8192&rs=8192&setec=1f6dcd277e5142a31be3cf46a05cb783"
    }
  ]
}