{
  "modId": 57865.0,
  "modName": "Redwater Skooma Improved",
  "summary": "Alters Redwater Skooma to be... More interesting- as well as very different from guardian variety skooma provided by my other mod. The effects are in some ways similar to skooma, but with more potent effects at the cost of moving slow. Including 110 more health and 50% more powerful melee abilities. Also changes the value to 850 gold.\r<br />",
  "descriptionHtml": "Update: Slightly altered this mod so that Redwater Skooma now effects vampires differently- I&#39;ve learned some things about modding vampirism long since I released the now outdated version. In this new version vampires will NOT be slowed by consuming Redwater Skooma, and ONLY vampires will get a health buff from drinking it.\r<br />\r<br />\r<br />Alters Redwater Skooma to be... More interesting- as well as very different from guardian variety skooma provided by my other mod. The effects are in some ways similar to skooma, but with more potent effects at the cost of moving slow.\r<br />\r<br />Now Redwater Skooma will make you hit very hard in melee combat, and be much harder to kill with 110 hit points... At the expense of you being very... Slowwwwwwwww. In spite of some of the ridiculous buffs this gives, I consider this to be balanced, because moving slowly is a massive weakness for a melee character. Unless you are extremely creative, it&#39;s likely going to be quite hard for you to hit any enemies attempting to flee.\r<br />\r<br />Sure even if you don&#39;t use strategy or tactics at all, this type of skooma will be GREAT for fights where you just take turns hitting each other with melee enemies who never flee... But at the cost of, just about everything else. Redwater Skooma has a MASSIVE weakness in vanilla- 50% less movement speed is huge, so I figure, it should get some massive strengths in turn.\r<br />\r<br />This mod also changes the value of Redwater Skooma to 850 gold. Because I think it should be more valuable than regular skooma was in Morrowind (500), due to rarity, but not be as valuable as double distilled skooma since it&#39;s generally less useful.\r<br />\r<br />Positive Effects: Fortify Unarmed Damage 50%, Fortify Health 110, Fortify Carry Weight 175, Fortify Two Handed Damage 50%, Fortify One Handed Damage 50%, Fortify Stamina 50, Fortify Stamina Regen by 30% for 48 seconds.\r<br />\r<br />Negative Effects: Slow movement speed 50%, drain maximum magicka by 285, drain magicka regen by 50% for 48 seconds.\r<br />\r<br />Requires Dawnguard, and the Official Skyrim Update.\r<br />\r<br />Reasons behind this mod: Seeing as how Redwater Skooma makes it&#39;s FIRST appearance in Skyrim, the vanilla version has some attributes I might want to imitate to try to be lorefriendly. So consequently, seeing as how vanilla Redwater Skooma had some of the OPPOSITE effects of Morrowind&#39;s skooma, I figured I&#39;d retain some of those, partially to be lorefriendly, but ALSO because I figured it&#39;d be more interesting if Redwater Skooma was very different from other types of skooma.\r<br />\r<br />So if you combine this with my Morrowskooma mod, the effects will be even more opposite in some ways, though that&#39;s intended. And YES all the effects are supposed to last 48 seconds, as I suppose lorewise the effects of redwater skooma aren&#39;t supposed to last as long as regular skooma does.\r<br />\r<br />Also: In spite of all the skooma mods I see here on the Nexus, NONE of them seem to change Redwater Skooma... So I decided, I myself would make this rare specific Dawnguard DLC narcotic much more... Interesting. The reason why this is separate from my MorrowSkooma mod, is because one, this mod isn&#39;t a throwback of Morrowind, it alters something that never existed in Morrowind to begin with, and two, this mod requires the DLC which not all Skyrim players have... And three some people may want this to be more modular to begin with.\r<br />\r<br />Compatability: Anything that alters the effects of magical effects of Redwater Skooma will probably conflict, though this is almost definitely 100% compatible with anything else.",
  "categoryId": "94",
  "version": "",
  "author": "Lectra",
  "createdUnix": "1410003099",
  "updatedUnix": "1415261018",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000125554",
      "name": "BetterRedWaterSkooma",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "BetterRedWaterSkooma-57865-.zip",
      "uploadedUnix": "1410000860",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c89e33a0eb89f962f25d3b3a95dfde6f990323ba741a59d5652e65db095b1509/analysis/1410000961/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BetterRedWaterSkooma-57865-.zip?fid=1000125554&ttl=1535844089&ri=8192&rs=8192&setec=e7ac53ec0b09e4faa8ca2ca261e87b3d"
    },
    {
      "fileId": "1000134106",
      "name": "UpgradedBetterRedWaterSkooma",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "UpgradedBetterRedWaterSkooma-57865-.zip",
      "uploadedUnix": "1415261018",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1a7220ebf7162954b48716cdf0e9dc7c3d331ab22f22e2eb5b867c81b07f419c/analysis/1415261102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UpgradedBetterRedWaterSkooma-57865-.zip?fid=1000134106&ttl=1535844089&ri=8192&rs=8192&setec=e79aec0402b1d845898c36965b7ecdee"
    }
  ]
}