{
  "modId": 57869.0,
  "modName": "Holidays - Deutsch",
  "summary": "Ein eigenständiges Addon, welches die Funktionen von Wet and Cold benutzt, um dadurch die Feiertage nach Himmelsrand zu bringen. Dörfer/Städte werden sich äußerlich verändern, sowie die Feiertage auf der TES-Lore basieren -- einige von ihnen wurden bereits von Bethesda geplant, zu sehen war dies in den Strings, welche im CK gefunden worden ",
  "descriptionHtml": "[img]http://static-7.nexusmods.com/15/mods/110/images/64820-1-1429199553.png[/img]\r<br />\r<br />[color=#ff7700][size=5]Version:[/size][/color]\r<br />\r<br />2.0\r<br />[list]\r<br />[*]Holidays wurde komplett überarbeitet und optimiert. Es ist nun Standalone und hat keine weiteren Abhänigkeiten mehr. Wet and Cold wird nicht länger mehr benötigt. \r<br />[*]Anstatt das Datum jede Stunde zu überprüfen und die Marker zu aktivieren/deaktivieren, checkt die Mod das Datum nun täglich. Sofern das Datum sich mit einem Feiertag deckt, nur dann wird das jeweilige Skript aktiv. Dies verändert auch das Polling des Spielers und der NPCs solange ein Feiertag aktiv ist. \r<br />[*]Wirte besitzen nun einen Dialog der in Verbindung mit dem Herztag eingeblendet wird. \r<br />\r<br />[*]Händler besitzen nun einen Dialog, welcher anzeigt das das Fest der Händler aktiv ist. \r<br />[*]Der Tod der Geschichten und Schmiere besitzen nun einen neuen Sound. \r<br />[*]Ihr könnt das Startdatum nun zufällig oder manuell über das MCM bei Beginn eines Spieles einstellen. \r<br />[*]Einen Fehler gefixt, bei dem die &#39;Ein Neujahrsjubiläums-Bücher&#39; während Weihnachten nicht gefunden werden konnten. Diese Bücher können nun ebenfalls gefunden werden (Deutsch nicht oder teilweise übersetzt), außerhalb dieser Zeit sind sie seltener zu finden. \r<br />[*]Viele weitere Anpassungen und Tweaks.\r<br />[/list][color=#ff7700][size=5]Abhängigkeiten:[/size][/color]\r<br />\r<br />[color=#6aa84f]Benötigt[/color]: Skyrim 1.9.29.0.8+\r<br />\r<br />\r<br />Optional: [url=http://skse.silverlock.org/]SKSE[/url] 1.6.5+\r<br />[size=4]SKSE wird nur für die ausgerüsteten Features und zur Konfiguration dieses Addons im MCM benötigt.[/size]\r<br />\r<br />[size=3]\r<br />Optional: SkyUI 3.0+\r<br />Features dieser Mod können über SkyUI&#39;s MCM Menü konfiguriert werden.\r<br />[/size]\r<br />\r<br />[color=#ff7700][size=5]Kompatibilität:[/size][/color]\r<br />\r<br />[list][*]Keine der NPCs wurden direkt verändert, sodass diese Mod kompatibel zu anderen NPC-Mods ist. Da die Mod darauf abziehlt die Bevölkerung des Spieles besser zu nutzen, so ist es empfehlenswert andere Mods zu installieren, welche die Bevölkerung von Himmelsrand bereichern.\r<br />[/*][*]NPC AI Packete von Wet and Cold, Run For Your Lives und When Vampires Attack werden bei einem Event Vorrang haben, wenn die NPC sich ein Dach suchen müssen.[/*]\r<br />[*]Kompatibel mit allen Mods, welche in irgendeiner Weise mit Tavernen/Händlern/Verkauf/Einkaufs- Preisen zu tun haben.[/*]\r<br />[*]Es können einige geringere Clippingfehler in Bezug auf die Dekorationen auftreten, sofern eine andere Mod die Städte oder Dörfer verändert, installiert ist. Mods welche größere Veränderungen bewirken, werden auch eher Clipping- und Floatingfehler in Bezug auf die Dekorationen hervorrufen.[/*]\r<br />[*]Ein Kompatiblitätspatch für Open Cities ist erhältlich. Dieser Patch muss nach &#34;Open Cities Skyrim.esp&#34; installiert werden. Alle anderen Wet and Cold-Module müssen irgendwo vor &#34;Open Cities Skyrim.esp&#34; installiert sein.\r<br />[/*][/list]\r<br />\r<br />[color=#ff7700][size=5]Überblick:[/size][/color]\r<br />\r<br />Ein Addon für Wet and Cold, welches die Funktionen von Wet and Cold benutzt, um dadurch die Feiertage nach Himmelsrand zu bringen. Dörfer/Städte werden sich äußerlich verändern, sowie die Feiertage auf der TES-Lore basieren -- einige von ihnen wurden bereits von Bethesda geplant, zu sehen war dies in den Strings, welche im CK gefunden worden waren -- kommt und geht. NPCs werden auch unterschiedlich auf diese Veränderungen reagieren, indem sie an diversen Events teilnehmen werden. Falls ihr diese Ingame-Feiertage in Bezug aufs reale Leben erleben möchtet, so ist es möglich diese Feiertage Tag für Tag zu erzwingen, dazu nutzt einfach das MCM. Install, update, troubleshooting, etc. Anleitungen sind identisch zu Wet and Cold. Deinstalliert die Mod nicht, während ein Feiertag aktiv ist.\r<br />\r<br />[color=#ff7700][b]Feiertage:[/b][/color]\r<br />\r<br />Von Festtagslaternen zu Feuerwerken, eine Liste aller momentan implemtierten Feiertage und deren Effekte kann [url=https://docs.google.com/document/d/1poiQz3S7Xh2yk5ajItzo6NKsN0BGWjzfa-A-muAhtoo/edit]hier [/url]gefunden werden: \r<br />Ihr werdet eine Notiz über einen anstehenden Feiertag in Form eines Flyers über einem Boten erhalten und/oder aber über einen der monatlichen Eventflyer, welche in jeder Taverne einer Stadt gefunden werden kann.\r<br />\r<br />[color=#ff7700][b]Feiertagsausrüstung:[/b][/color] [[color=#ff00ff]SKSE[/color]]\r<br />NPCs werden sich mit verschiedenen Gegenständen bekleiden, abhängig des jeweiligen Feiertags. Aktuell implementiere Ausrüstung: Weihnachtshüte während Weihnachten, Narrenkostüme für den Narrentag, Neues Leben - Kopftücher während des Fest des Neuen Leben, Fest der Lichter Kerzen und Laternen während des Fests der Lichter und Übungswaffen während des Kriegerfestes.\r<br />\r<br />[color=#ff7700][b]Geh Feiern&#33;:[/b][/color]\r<br />Die NPC der Stadt/der Dörfer werden in Tempeln, Läden, Herbergen oder auch außerhalb am jeweiligen Feiertag feiern. Händler/Arbeiter werden unter Umständen früh zurückkehren um sich den Events anzuschließen. Alle Städte und Dörfer in Himmelsrand beherbergen NPC, welche feiern werden, solange deren Siedlung die Anforderungen für den Feiertag erfüllt (z.B. die Jahresmittfeier besitzt NPC welche im Laufe des Tages in Tempeln und außerhalb feiern. Da Flusswald keinen Tempel besitzt, so werden die NPCs an diesem Feiertag nur außerhalb feiern). Da dieses Feature mit einigen Questszenen der NPC konkurieren könnte, kannst du A) sie später belästigen (lass sie ihren Feiertag feiern&#33;) oder B) dieses Feature bei Bedarf temporär deaktivieren.\r<br />\r<br />Hinweise:\r<br />\r<br />[list][*]Ein Buch über die &#34;Feste in Himmelsrand&#34; mit detallierter Beschreibung aller nicht-dynamischen Feiertage innerhalb der Mod. Es besteht die eine geringe Wahrscheinlichkeit dass dieses Buch an verschiedenen Orten Himmelsrands auftauchen wird. Nützlich wenn ihr kein SkyUI/MCM besitzt oder die Feiertage in einem Buch nachschlagen wollt.\r<br />[*]Nach der Schlacht um Weißlauf, wird diese Mod deaktiviert bis der Bürgerkrieg beendet wurde. Jedoch kann dies mittels der Überschreibfunktion überschrieben werden, auf eigene Gefahr.\r<br />[*]Alle aufgelisteten Zeiten sind Schätzungen. Die Reisezeiten der NPC sollten einberechnet werden.\r<br />[*]Bürger eines Ortes werden zufällig sich in einem Abstand von zwei Stunden einem Event anschließen. Nach fünf Uhr Abends stabilisert sich die Liste an Zuläufern.\r<br />[*]Winterfeste hält keinerlei Festlichkeiten ab.\r<br />[*]Weihnachstdekorationen am Güldengrünbaum in Weißlauf werden nur erscheinen, sofern dieser gesund und ausgewachsen ist.\r<br />[*]Eine Bücherreieh über das &#34;Ein Neujahrsjubiläum&#34; (5 gesamt) sind eine Skyrim-Adaption von Dickens &#34;Eine Weihnachtsgeschichte&#34; von princess_stomper und kann während der Zeit der Weihnachtsdekorationszeit gefunden werden.\r<br />[/*][/list]\r<br />\r<br />[color=#ff7700]Zufälliger Startpunkt:[/color]\r<br />Wenn ihr ein neues Spiel startet, so werdet ihr in der Lage sein den Monat, Tag und/oder die Zeit des Beginns eures Abenteuers einzustellen. Kompatibel mit [url=http://www.nexusmods.com/skyrim/mods/9557/?]Alternate Start - Live Another Life[/url], [url=http://steamcommunity.com/sharedfiles/filedetails/?id=169372128]Skyrim Unbound[/url] und [url=http://www.nexusmods.com/skyrim/mods/25404/?]Random Alternate Start[/url].\r<br />\r<br />[color=#ff7700][size=5]Übersetzungen:[/size][/color]\r<br />\r<br />[list][*]Ihr habt meine Erlaubnis diese Mod zu übersetzen und sie auf dem Nexus oder anderssprachigen Seiten zu laden. Sendt mir einfach den Link zu.\r<br />[*]Textfehler im MCM können [url=https://docs.google.com/spreadsheet/ccc?key=0AkWSEPTFGEcZdDcwUGRoQkwzcEtsOGk1M3hYT3FxT2c#gid=0]hier [/url]korrigiert werden\r<br />[/list]\r<br />[color=#ff7700][size=5]Credits:[/size][/color]\r<br />\r<br />[size=1][size=3]Jeder der etwas auf uesp.net dazu beigetragen hat.\r<br />Zaf für seine Stimme beim Fest der Toten.\r<br />mindboggles für die Modifikation und dem [url=http://www.nexusmods.com/skyrim/mods/48271/?]Feuerwerk[/url].\r<br />mannygt für die Modifikation und seinen [url=http://www.nexusmods.com/skyrim/mods/27845/?]Weihnachtslaternen[/url].\r<br />Oaristys für verschiedenste Modelle aus dem [url=http://www.nexusmods.com/skyrim/mods/16525/?]Modder Ressourcen Paket[/url].\r<br />Blary für die Notiz-Meshes aus [url=http://www.nexusmods.com/skyrim/mods/14134/?]OpenBooks Resource[/url].\r<br />Deandra, Yughues und Tamira für die Modifikation und der Benutzung der Kürbisse: [url=http://www.nexusmods.com/skyrim/mods/44654/?]Halloween In Skyrim - Even More Pumpkins[/url].\r<br />Vicn für verschiedenste Masken aus [url=http://www.nexusmods.com/skyrim/mods/35902/?]The Mad Masker[/url].\r<br />volvaga0 für die Kopftücher aus [url=http://www.nexusmods.com/skyrim/mods/20900/?]Bandanas of Skyrim[/url].\r<br />princess_stomper für die Skyrim_Adaption von Dickens Weihnachtsgeschichte.\r<br />DanielCoffey für die Bücherressourcen aus [url=http://www.nexusmods.com/skyrim/mods/37113/?]Better Book Mesh[/url] und [url=http://www.nexusmods.com/skyrim/mods/44267/?]Book Covers PSD[/url].\r<br />Phoenix Amon (Daleth), ohne die [url=http://oblivion.nexusmods.com/mods/5570]Book Jackets: Oblivion[/url] würde die [url=http://www.nexusmods.com/skyrim/mods/35399/?=]Book Covers Skyrim[/url] Mod nicht existieren.\r<br />Metallicow für seine Büchertexturen und Ressourcen.\r<br />improbabile für die Umsetzung der Übersetzung Italien.\r<br />Moorichka für die Umsetzung der russischen Übersetzung.\r<br />Mekrani für die Umsetzung der polischen Übersetzung.\r<br />www.fuzzimo.com für die Free Stock worn fabric book cover textures.\r<br />css0101 und hifoo für ihre Laternen aus [url=http://www.nexusmods.com/skyrim/mods/33161/?]Nordic Lantern - Replacer[/url] und [url=http://www.nexusmods.com/skyrim/mods/8835/?]Usable Lantern[/url].         \r<br />[/size]\r<br />Die Übersetzung ist geistiges Eigentum von Gunter525 (Obvlion_Member) und darf ohne seine ausdrückliche Genehmigung nicht weiter verbreitet werden.\r<br />[/size]",
  "categoryId": "78",
  "version": "2.0",
  "author": "isoku - DV von Gunter525 -OM",
  "createdUnix": "1410007542",
  "updatedUnix": "1429819233",
  "containsAdultContent": false,
  "uploadedBy": "Gunter525",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000156802",
      "name": " Holidays v2_0 - Deutsch",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24691",
      "fileName": " Holidays v2_0 - Deutsch-57869-2-0.7z",
      "uploadedUnix": "1429818866",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e54b4b0e1d71fbce7693b77b87b9fe9fe24d707b2f805ff4ea8f255c429a5a96/analysis/1429818914/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20Holidays%20v2_0%20-%20Deutsch-57869-2-0.7z?fid=1000156802&ttl=1535844097&ri=8192&rs=8192&setec=9fdc2eb1d3400ea3c090a8664318c61b"
    },
    {
      "fileId": "1000156805",
      "name": " Holidays - ETaC Patches - Deutsch",
      "version": "1.00",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "21",
      "fileName": " Holidays - ETaC Patches - Deutsch-57869-1-00.7z",
      "uploadedUnix": "1429819233",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0321da7a7d58ade70f24fd1ae57237bfe6516528d3d719992eb6d8509d6e8107/analysis/1429819262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20Holidays%20-%20ETaC%20Patches%20-%20Deutsch-57869-1-00.7z?fid=1000156805&ttl=1535844097&ri=8192&rs=8192&setec=876f8aff9c85aa21e5cac520b09b8563"
    }
  ]
}