{
  "modId": 57927.0,
  "modName": "Mask of the Afflicted",
  "summary": "With this mask, afflicted will recognise you as one of their own and won&#39;t be hostile, and you also gain their special power - vile vapors&#33;",
  "descriptionHtml": "Created by the Daedric Lord Peryite and passed down to each of his Champions, this mask is a deadly force to be reckoned with. Now that you are his latest Champion, it is only right to claim this mask that is rightfully yours&#33; Find it in the ruins the Afflicted call home, and you can call it home too as you freely walk among them. This mask makes you friendly to all afflicted, and even grants you their special power - vile vapors&#33; In your own way though of course. For you are not afflicted, you cannot spray acid from your mouth. But you can gain their unique power as a spell when wearing this mask :)\r<br />\r<br />Installation: Just install via NMM, or manually extract the esp to your data folder, and merge the meshes, textures, and scripts folders with the ones in your data folder.\r<br />\r<br />Compatibility: There shouldn&#39;t be any issues with other mods.\r<br />\r<br />Hope you enjoy&#33; :)\r<br />\r<br />Future Plans: Maybe make the mask also grant you an ability where you can call on the Afflicted to help you in battle.",
  "categoryId": "54",
  "version": "1.0",
  "author": "simsim899",
  "createdUnix": "1410113567",
  "updatedUnix": "1410113555",
  "containsAdultContent": false,
  "uploadedBy": "simsim899",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000125871",
      "name": "Mask of the Afflicted",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "522",
      "fileName": "Mask of the Afflicted-57927-1-0.rar",
      "uploadedUnix": "1410113555",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/535eb56a81c16935c21d55d234b5ddf352458c43f86543bb799059d1b551164f/analysis/1410113644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mask%20of%20the%20Afflicted-57927-1-0.rar?fid=1000125871&ttl=1535844209&ri=8192&rs=8192&setec=32babef469aefc53572c7821fb58ebc0"
    }
  ]
}