{
  "modId": 5793.0,
  "modName": "Nude Flavors for CBBE",
  "summary": "UPDATED : 1-9-12    This is a realistic style skin texture for CBBE with plans to offer choices of Dirty/Clean, Breast Areola Color and Pubic Hair Styles.",
  "descriptionHtml": "UPDATED : 1-9-12\r\nThis is a WIP so any suggestions or comments are welcomed, but keep in mind this is my 1st mod for Skyrim.  \r\n\r\nCurrently only tested with CBBE - Slim.\r\n\r\nThe idea of this mod is to make realistic skin textures for the CBBE Mesh that will hopeful one day ( Creation Kit ) be able to cycled randomly to NPCs to create a greater sense of immersion.\r\n\r\nFor now I just wanted to upload my progress as I am mostly doing it for myself, how much gets done on this mod and it\\'s scope will be based completely on people\\'s feedback.\r\n\r\nBased on the work of Caliente\\'s Female Body Mod Big Bottom Edition -CBBE- Thank you for all your hard work!!\r\nURL - http://www.skyrimnexus.com/downloads/file.php?id=2666\r\n\r\n\r\n[ Texture Details ] :\r\n\r\n- 4096 and 2048 resolutions\r\n- Realistic Skin including freckles, moles and imperfections.\r\n- Clean and Dirty Options.\r\n- Vaginal area changed.\r\n- Areola and Nipples changed.\r\n- Pubic Hair Styles including - Natural, Shaved, Trimmed, Strip, Heart.\r\n\r\n\r\n[ Flavors ] :\r\n\r\nPink Lemonade :\r\n-----------------------\r\n\r\n- Pink nipples, labia and areola with darker colored outer ring\r\n\r\n( Progress )\r\n\r\nClean - Shaved = Done\r\nClean - Natural = Done\r\nClean - Trimmed = Done\r\nClean - Strip = Done\r\nClean - Heart = Done\r\n\r\nDirty - Unfinished\r\n\r\n\r\nStrawberry :\r\n------------------\r\n\r\n- Red nipples, areola, labia.\r\n\r\n(Progress) - Unfinished\r\n\r\n\r\n\r\nIf you have any suggestions or if you would like to recommend a Flavor or Style please feel free, if you have a specific model or actress with the attributes in mind mention their name so I can gather reference material.\r\n\r\n\r\n\r\nI would love to make a Object Normal ( *msn.dds ) but even though I have Photoshop, 3ds Max, and Zbrush I = fail.\r\n\r\n\r\n\r\nAbout the Design and Style :\r\n\r\nMy personal preference leans strongly towards realism so most of my work will chase that, so dont expect much support of flawless barbie doll complexion, DDD Cups.\r\n\r\nSo try to understand that when leaving suggestions and requests!",
  "categoryId": "29",
  "version": "v1",
  "author": "Mytheos",
  "createdUnix": "1326154662",
  "updatedUnix": "1326154662",
  "containsAdultContent": true,
  "uploadedBy": "mytheos",
  "primaryFile": null,
  "files": []
}