{
  "modId": 58042.0,
  "modName": "Blackguard&#39;s Armor and Guild Master&#39;s Armor Stat Swap",
  "summary": "This mod just swaps the stats on the Guild Master&#39;s armor and the Blackguard&#39;s armor from the Dragonborn DLC so that, in my opinion, they make more sense.",
  "descriptionHtml": "Have you ever wondered why the Blackguard&#39;s armor from the Dragonborn DLC has higher stats than the Guild Master&#39;s armor? I mean, to get the Guild Master&#39;s armor you have to complete numerous quests, and it takes a lot of time and effort to achieve them. Yet, the Blackguard&#39;s armor, which you can get access to after a pretty simple quest, has higher stats&#33;? Well, worry no more&#33; This mod fixes that. The stats have now been swapped on the two armor sets. Now the Guild Master&#39;s armor has the more powerful enchantments, the higher value, and the higher armor rating compared to the Blackguard&#39;s armor. However, the weights of the two armor sets were kept so that the Guild Master&#39;s armor also weighs more as it is long sleeved, so theoretically should be heavier than the short sleeved Blackguard&#39;s armor. A few of the thieves guild improved armor variants were also edited slightly as well to stick with the rankings of the armor sets, from best to &#39;worst&#39; (not that any are bad) being Guild Master&#39;s Armor, then Blackguard&#39;s Armor, then Thieves Guild Improved Armor, then the regular Thieves Guild Armor.\r<br />\r<br />Installation: Just install normally via NMM, or unpack the esp into the skyrim data folder.\r<br />\r<br />Compatibility issues: Shouldn&#39;t be any :)\r<br />\r<br />Hope you like it :)",
  "categoryId": "54",
  "version": "1",
  "author": "simsim899",
  "createdUnix": "1410443046",
  "updatedUnix": "1410442934",
  "containsAdultContent": false,
  "uploadedBy": "simsim899",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126414",
      "name": "Blackguard&#39;s Armor and Guild Master&#39;s Armor Stat Swap",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Blackguard's Armor and Guild Master's Armor Stat Swap-58042-1.rar",
      "uploadedUnix": "1410442934",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1828d1b4333430cc61398edd52bad5bf45dfd5f385470e0ffc08b05fb7768ffd/analysis/1410443042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackguard%27s%20Armor%20and%20Guild%20Master%27s%20Armor%20Stat%20Swap-58042-1.rar?fid=1000126414&ttl=1535844375&ri=8192&rs=8192&setec=ba66870ebbe6c87da1f1f1a7328307d9"
    }
  ]
}