{
  "modId": 58051.0,
  "modName": "Simple Magic Overhaul",
  "summary": "FEEL THE POWER, KRONK.\r<br />\r<br />Oh.  I can feel it.",
  "descriptionHtml": "[center][b][color=#ffff00][size=6][size=5][b][b][b][center][youtube]YpTy5CbuLzI[/youtube][/center][/b]\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/37216-1-1430053788.png[/img][/b][/b]\r<br />\r<br />[size=12]SIMPLE MAGIC OVERHAUL[/size][/size][/size][/color][/b]\r<br />\r<br />[size=5]AN [url=http://www.nexusmods.com/skyrim/mods/52487/?]EPIC GAMEPLAY OVERHAUL[/url] MOD\r<br />[/size]\r<br />\r<br />\r<br />[b][size=4]THIS MOD REQUIRES SKSE, SKYUI, DAWNGUARD, DRAGONBORN, AND THE LATEST SKYRIM UPDATE.[/size][/b]\r<br />\r<br />\r<br />\r<br />[center][youtube]EyJKt3J3EDo[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[size=4][/size][size=4]\r<br />[url=http://skyrim.nexusmods.com/mods/32597/?]Dragon Combat Overhaul[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/37216/?]Civil War Overhaul[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/43241/?]Fire and Ice Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52474/?]Combat Drama Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52471/?]Important Information Overhaul[/url][/size][/center][center][size=4][url=http://www.nexusmods.com/skyrim/mods/53888/?]Epic Music Overhaul\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/58051/?]Simple Magic Overhaul\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/edit/?id=60077][/url][url=http://www.nexusmods.com/skyrim/mods/60077/?]Movement and Stamina Overhaul[/url][/size][/center]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5]INSTALLATION NOTES[/size][/b]\r<br />\r<br />DO NOTHING OTHER THAN THIS.\r<br />\r<br />Download the main file. Enable it.\r<br />\r<br />IF YOU ARE UPDATING:\r<br />\r<br />Install and overwrite all files.  This can be done at any time.\r<br />\r<br />\r<br />[b][size=5]APOLLO&#39;S OBJECTIVE MOD ASSESSMENT[/size][/b]\r<br />\r<br />Script weight.........................Low\r<br />Installation Difficulty...............Low\r<br />Modding Skill Level Required......Low\r<br />Game Difficulty Increase...........Medium\r<br />\r<br />\r<br />[b][size=5]TABLE OF CONTENTS[/size][/b]\r<br />\r<br />I. Features\r<br />II. I still don&#39;t understand. What is this and what does it do?\r<br />III. Known issues and Incompatibilities\r<br />IV. Frequently Asked Questions\r<br />V. Reviews\r<br />VI. Recommended Mods\r<br />VII. Glowing Testimonials\r<br />VIII. Shameless Advertising for My Buddies\r<br />\r<br />\r<br />\r<br />[size=3][i]It&#39;s like trying to hit a puppy by throwing a live bee at it&#33;  Which is a weird image and you should probably just forget it.\r<br />\r<br />[/i][/size] - Willow Rosenberg\r<br />\r<br />\r<br />[center][size=8][color=#0084ed]TL;DR[/color][/SIZE]\r<br />\r<br />\r<br />[size=3][b]Og no understand.[/b][/size][/center][size=3][b]\r<br />\r<br />\r<br />[/b][/size][center][youtube]7bd5YUEOwlE[/youtube][/center]\r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=5][b]YOU GOTTA WANT IT, JOHNNY D&#33;[/b][/size][/color]\r<br />\r<br />Part 1: Everybody starts out with significantly less magicka.  If you are a high elf, you start with zero magicka, if Breton, you start out with negative 50 magicka, if Wood Elf, or Dark Elf, you start with negative 75 magicka, and if you are any other race, you start with negative 100 magicka.  Ouch.  \r<br />\r<br />Part 2: Increasing a spell school to level 65 will give you a permanent +50 bonus to magicka.  Enchanting does not count.\r<br />\r<br />Why?  Because magic is NOT something for everybody.  The problem with vanilla Skyrim is that everybody starts as a wizard - this defeats the role playing aspect of the game.  If you are a Nord berserker, you should NOT have access to the healing and ward spells.  SMO will make sure that you truly want to be a wizard, instead of just treating it as a passing fancy.  But if you work at it, you will be more powerful than a vanilla wizard no matter what race you are(though some are better than others at it, naturally).\r<br />\r<br />[color=#ffff00][size=5][b]SWEET SPOT[/b][/size][/color]\r<br />How much magicka you have remaining in your pool determines spell cost, regen, and power.  Spells will increase in power, cost, and efficiency as your available magicka decreases, up to 300% stronger.  Sound good, right?\r<br />\r<br />Unfortunately, below 50% Magicka, your magicka regeneration will drop sharply, and below 30% Magicka, the magicka will actually drain from you, and you will be forced to use a potion or sleep to regen magicka again. Furthermore, your spells will be wildly inefficient the lower your magicka gets below 30% as well.  For the most part, you want your character to hover around 50% magicka(regen begins to drop after that) to get the maximum efficiency and benefit to your magicka.  That being said, if you fire a spell that burns you out, it&#39;s going to be massive.\r<br />\r<br />Furthermore, magic power is affected by stamina.  At stamina values below 70%, your magic power will begin to decrease substantially(down to 50% at below 10% stamina).\r<br />\r<br />That&#39;s the basics of it, anyway.  It gets far more complex when you consider how SMO calculates your spell cost and damage.  Spell cost is determined at the moment of spell charge, spell power is determined at the moment of spell release.  FOR EXAMPLE: I cast a lightning bolt from full magicka.  If the casting cost brought me down to 35% magicka, the spell would be INCREDIBLY efficient(it would cost the base cost of 1 at a power of 2).  If, however, I cast it between 30% and 40%, and the casting cost was low enough that it remained in the 30-40 range, it would still be very efficient, but not as efficient as the previous example(The spell cost would be 1.5 and the spell power would still be 2).  The higher your magicka is when you begin charging the spell, the less it will cost, and where your mana pool ends up determines its power.\r<br />\r<br />Further complicating matters, this handles concentration spells differently than &#34;fire and forget&#34; spells, because the cast and release events happen at the same point in your mana pool, and are not recalculated until recast.  SO if I were at full magicka, the cost of Sparks would be 1 and the damage would be 1, but if I cast it at 50%, it would cost 1.4 and the power would be 1.5, and it would remain at this rate until I recast the spell, meaning that you can burn yourself out &#34;safely&#34; with concentration spells.  Bear in mind that your magicka regen will take a hit because of this, however, so it won&#39;t be completely painless.\r<br />\r<br />THEREFORE: if I wanted to fire the biggest spell possible, I would fire a spell at 100% magicka that took up as much of my magicka pool as possible, which would buff the damage to 300%.  This would automatically burn me out, however, so if I wanted to be more efficient, I would use smaller casting cost spells and keep my magicka above 50%.\r<br />\r<br />It&#39;s confusing, but you eventually get the hang of it.  The idea is that using magicka intelligently, knowing your limits, and sometimes taking chances will make you far more powerful than a vanilla wizard.\r<br />\r<br />No jokes for this feature, I&#39;m already confused enough, thank you.  At some point I&#39;ll get around to graphing the values together so you can see the effect.  But not now because I&#39;m flojo bue.\r<br />\r<br />[color=#ffff00][size=5][b]FEEDBACK[/b][/size][/color]\r<br />\r<br />Do you think it&#39;s weird that everybody is FREAKED OUT by magic use in Skyrim, calling it dangerous and the like, when meanwhile you can just cast as many spells as you want without repercussions?  FEEDBACK will cause a number of unpleasant effects if you cast spells that are out of your league, or at low magicka(below 50% is the default, and yes, this means that the SWEET SPOT will have the chance to cause FEEDBACK at the default value).  FEEDBACK will knock you down, severely damage your health/stamina/magicka/, turn all of your conjured creatures against you, or many other negative effects.  \r<br />\r<br />FEEDBACK is also dependent on perks - if you have the perk associated with the spell, FEEDBACK will never kick in until your magicka hits the feedback value(50% by default), and is less likely to occur than if you did not have the perk after that.\r<br />\r<br />FEEDBACK is calculated on spell release.\r<br />\r<br />[color=#ffff00][size=5][b]DESPERATION[/b][/size][/color]\r<br />\r<br />Magic is volatile and dangerous, folks.  If you are a mage, during desperate situations you may fire off a random vanilla spell OF ANY LEVEL.  You will not gain this ability until you have started down the path of the mage, however.  This module is intended to be incredibly mysterious, and as such, there is no MCM for it.  I will not tell you how I calculate when the spell fires, only that it will only fire in desperate circumstances. \r<br />\r<br />[color=#ffff00][size=5][b]FEEL THE POWER, KRONK[/b][/size][/color]\r<br />\r<br />Magic and enchantments will &#34;level with you&#34; increasing in power based on your skill in the applicable school of magic.  They will increase to up to THREE TIMES in power at a skill level of 200.  This multiplies the damage multiplier, which means that under ideal conditions with SWEET SPOT, you can fire a spell of that is NINE times more powerful than it would have been in vanilla.  FEEL THE POWER, KRONK.\r<br />\r<br />[center][youtube]b3c1RORu_Bs[/youtube][/center]\r<br />\r<br />[color=#ffff00][size=5][b]JAN, YOU ALWAYS DEFLECT THE CONVERSATION TO YOURSELF[/b][/size][/color]\r<br />\r<br />Wards, if timed correctly, will now reflect spells back at your attacker.  In order to reflect a spell, you have to cast the ward up to one second before the spell hits, and it will not reflect if your ward breaks.  The window for this opportunity is small, but with practice you&#39;ll get it nearly every time.\r<br />\r<br />[color=#ffff00][size=5][b]ALSO, I CAN KILL YOU WITH MY BRAIN[/b][/size][/color]\r<br />\r<br />Telekinesis is the most pointless spell in Skyrim.  Plunking a dude in the head with a cast iron pot in real life would give him a freaking hematoma and kill him, but in Skyrim all it does is annoy people.  SMO dramatically increases the power, range, and utility of telekinesis, making it a viable way to deal damage so you can play as that pure Alteration mage you&#39;ve always wanted. \r<br />\r<br />[b][color=#ffff00][size=5]MCMS EVERYWHERE[/size][/color][/b]\r<br />As a member of the EGO family, SMO has an MCM.  Because this is beta right now, there&#39;s not much there except for the feedback global and the uninstall key.  I&#39;ll add more later if I need to.  NOTE: DUE TO ENGINE RESTRICTIONS, SWEET SPOT AND FEEL THE POWER ARE HARDCODED AND WILL NEVER HAVE AN MCM TO EDIT THEIR VALUES.  Sorry.\r<br />\r<br />\r<br />[center][img]http://media.tumblr.com/10617d07811a3ff603371cc261ed17b8/tumblr_inline_n247u05KdH1sxa61c.gif[/img][/center]\r<br />\r<br />\r<br />\r<br />[b][size=5]I STILL DON&#39;T UNDERSTAND - WHAT IS THIS AND WHAT DOES IT DO[/size][/b]\r<br />\r<br />SMO rebalances how magic generally works in Skyrim.  You will actually need to think and strategize a little when you use magic, as the rewards are incredible, and the punishments are fairly dire.\r<br />\r<br />\r<br />\r<br />[b][size=5]KNOWN ISSUES[/size][/b]\r<br />\r<br />Please visit [url=http://www.nexusmods.com/skyrim/mods/52487/?]the EGO bug tracker[/url] for a list of all known issues and incompatibilities associated with this mod.\r<br />\r<br />Regarding incompatibilities: SMO should not conflict with mods that add spells if they have the proper keywords and perks, however any spell rebalancing mod may be &#34;incompatible&#34; in that the confluence of factors could cause serious game inbalance.  Let me know how it works with Skyre/Requiem/etc.\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5]FREQUENTLY ASKED QUESTIONS[/size][/b]\r<br />\r<br />&#34;I hate your description.&#34;\r<br />\r<br />[youtube]TpU5O_Uur_c[/youtube]\r<br />\r<br />\r<br />&#34;So does this make magic stronger or weaker?&#34;\r<br />It depends.  If you use magic like you would in vanilla Skyrim, it would be weaker, and you&#39;ll probably get yourself killed by FEEDBACK sooner or later.  If you role play a mage, however, it will be SO MUCH STRONGER.  Also, lower level characters and those not trained in magic will certainly have a harder time casting magic than pure mages.  The trick is not to burn yourself out, because it will take you longer to recharge and spells will be less efficient if you are burnt out.  Also, and I can&#39;t stress this enough, FEEDBACK, MAN.  It&#39;ll happen every other spell at low magicka on release.\r<br />\r<br />&#34;So what should my strategy be?&#34;\r<br />It really depends on your play style.  You can play it safe and cast stuff only above 50%, then you&#39;ll get all the rewards and none of the negative effects.  Or you can live on the edge and hover around 35%, and you&#39;ll be really powerful.  It&#39;s all about power vs. control.  Remember, the big thing is that if you burn yourself out, you will get punished HARD.  \r<br />\r<br />&#34;Does this affect NPCs?&#34;\r<br />NO.  NPC&#39;s are not affected because their AI is not programmed to handle this.  They would all burn themselves out in moments and then spend the rest of the fight poking at you with a dagger.  I COULD make their wards reflect spells back at you, but again they wouldn&#39;t be using their wards with this in mind because their AI is not programmed to do that, and furthermore it would dramatically increase the script load for too little of a payoff.  That being said, there are a number of enemy scaling and spell mods that you might like that will help you with the difficulty of mages.  My current favorite recommendation for NPC magic combat is Revenge of the Enemies.\r<br />\r<br />&#34;Will you be adding spells in the future?&#34;\r<br />YES.  But not in this version.\r<br />\r<br />&#34;OMG I LOVE TENDO OMG OMG HE&#39;S THE GUY WITH THE FUNNY DUCK AND TEH SNAKE OMG IS THIS COMPATIBLE WITH PERMA ZOOOOMG&#34;\r<br />WHOA.  Yes, it is.  FEEL THE POWER can be disabled in the MCM if spells become too powerful with T3nd0&#39;s spell scaling solution.  Otherwise, I feel I should remind you guys that T3nd0 and I are working closely to bring Mannimarco to you.  We are in communication about these things.\r<br />\r<br />&#34;Reducing my magic by a bajillion is STUPID.  Now I can&#39;t even play a mage for the first 15 levels and by then the warriors and thieves will be SO POWERFUL.&#34;\r<br />THAT&#39;S THE POINT.  I told you, being a wizard should NEVER be something you are able to do at level one, no matter what race you are.  Somebody playing as a pure mage will have a substantially harder first few levels, as they won&#39;t even be able to cast magic usually until a couple of levels later.  But there are items that increase magicka, you know.  Maybe this doesn&#39;t answer your question, but understand, THAT ALL SOUNDS GOOD TO ME.  Your complaint is the point of this mod, to make the path of the mage significantly harder, yet more rewarding.  \r<br />\r<br />[center][youtube]T8gOh0wEgLg[/youtube][/center]\r<br />\r<br />[b][size=5]REVIEWS[/size][/b]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[b][size=5]HIGHLY RECOMMENDED MODS[/size][/b]\r<br />\r<br />These mods carry my highest recommendation. They have been thoroughly tested in my game, and I guarantee they will work with all of my mods.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/336241/?]Anything by LifesToRock[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3959191/?]Anything by EnaiSiaion[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/1614960/?]Anything by 3jiou[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3841389/?]Anything by tktk1[/url] - EXCEPT FOR ULTIMATE DRAGONS\r<br />[url=http://erkeilmods.altervista.org/skyrim/category/news/]Anything by Erkeil[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10168/?]ApachiiHair[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17802/?]Climates of Tamriel[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/1002/?]Jaysus Swords[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/18916/?]Lanterns of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24445/?]SPERG[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/3222912/?]Any of Immersive Sounds[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/30947/?]Dead Body Collision[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12977/?]Immersive Patrols[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/18799/?]Radiant Potions and Poisons[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/26017/?]Destructible Bottles[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/22745/?]Footprints[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33482/?]MinimalHUD[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27644/?]Immersive Weapons[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10251/?]Silverlight Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40216/?]Stormlord Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25846/?]TERA Armor[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/33292/?]Unique Uniques[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/40491/?]Revenge of the Enemies[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15599/?]Fortified Dawnstar[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17168/?]Skyrim Bigger Trees[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52019/?]Follower Commentary Overhaul[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49036/?]Immersive First Person[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27043/?]ELFX[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/41634/?]DVA[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/9717/?]Better Vampires[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14353/?]Improved Dragon Shouts[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/10906/?]Dance of Death[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15524/?]AFT[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/13268/?]WATER[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19718/?]Bloody Facials[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/60/?]Enhanced Blood[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17214/?]No Spinning Death Animation[/url]\r<br />\r<br />We will always remember our fallen brother, Cabbage in a Pot. Rest well, sweet prince.\r<br />\r<br />\r<br />[b]GLOWING TESTIMONIALS:[/b]\r<br />\r<br />&#34;Huh?&#34; - The internet\r<br />\r<br />&#34;I told you Magic is volatile and dangerous&#34; - Tolfdir\r<br />\r<br />\r<br />\r<br />[b][size=5]SHAMELESS ADVERTISING FOR MY FRIENDS[/size][/b]\r<br />\r<br />Millions of pageviews, guys; I gotta do something with it. Help me make these guys famous.\r<br />\r<br />[center]\r<br />[i][/i][i][size=6][color=red]Driver Friendly&#33;[/color][/size]\r<br />(Screaming and taking off your bra is optional, but recommended)[/i]\r<br />\r<br />[youtube]qeiTX2IlHkY[/youtube][/center]",
  "categoryId": "93",
  "version": "2",
  "author": "ApolloDown",
  "createdUnix": "1410465549",
  "updatedUnix": "1416490708",
  "containsAdultContent": false,
  "uploadedBy": "Apollodown",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136107",
      "name": "Simple Magic Overhaul",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Simple Magic Overhaul-58051-2.7z",
      "uploadedUnix": "1416490708",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/1a735d7d7e67c6697b0c05d2e6a96812be5cf7544861bfc5c9ea2f1bfcbc84e7/analysis/1416490802/",
      "changelogHtml": " DESPERATION has been added. <br/> \n the MCM menu has been fixed <br/> \n You are now given the option to reduce your magicka or not. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Magic%20Overhaul-58051-2.7z?fid=1000136107&ttl=1535844392&ri=8192&rs=8192&setec=b76254b46039083924fe6c0a5854bff9"
    }
  ]
}