{
  "modId": 58069.0,
  "modName": "Better Dead Thralls",
  "summary": "Improves the Dead Thrall spell to give you greater control over your thralls and make the use of thralls more convenient.",
  "descriptionHtml": "Improves the Dead Thrall spell to give you greater control over your thralls and make the use of thralls more convenient.\r<br />\r<br />[color=#ffff00][b]Requirements / Suggested Mods[/b]:[/color]\r<br />[list][*]The latest Skyrim patch.[/*]\r<br />[*](optional for some minor features) The Skyrim Script Extender ([url=http://skse.silverlock.org/]SKSE[/url]).[/*]\r<br />[*](optional) The Mod Configuration Menu (MCM) which comes with [url=http://www.nexusmods.com/skyrim/mods/3863/]SkyUI[/url].\r<br />[/*]\r<br />[/list]\r<br />[color=#ffff00][b]Installation[/b]:[/color]\r<br />[list][*][b]Before anything else, if you have any dead thralls, kill all of them and then save your game.\r<br />[/b][/*]\r<br />[*][b]With Nexus Mod Manager[/b]: Simply click on the &#34;Download with Manager&#34; button.\r<br />[/*]\r<br />[*][b]Manual Installation[/b]: Extract both files (the .bsa and the .esp) to your Skyrim data folder.[/*]\r<br />[/list]\r<br />[color=#ffff00][b]Features[/b]:[/color]\r<br />[list][*]The level cap on the Dead Thrall spell was removed.[/*]\r<br />[*]Dead Thrall now works on all creatures and not just NPCs.[/*]\r<br />[*]Dead thralls will now sneak with the player.[/*]\r<br />[*]Dead thralls will equip weapons, armor, etc. just like followers and their equipment will no longer be limited by their &#34;outfit&#34;.[/*]\r<br />[*]By activating (&#34;talking to&#34;) a thrall you can trade items with them and not have to resort to killing them to give them items to carry.[/*]\r<br />[*]You can view their level, race (requires SKSE to display properly), health, magicka, stamina, skill levels and resists.[/*]\r<br />[*]You can make a thrall put all their items into a chest and optionally exclude boots, gloves, armor or helmet. For example, you want a Bandit Chief to wear robes but they prefer their heavy armor and by removing all their starting gear said gear can respawn. You can make him remove all his gear except for boots, he will then not have armor, he will equip the robe but as he has the boots equipped his starting gear will not respawn. The chest will appear at your feet and when you leave the area it will despawn. This feature requires SKSE if you want to select a piece of equipment to exclude but manually removing them before reanimation will also work.[/*]\r<br />[*]You can, if you&#39;re in combat, order a thrall to flee.[/*]\r<br />[*]You can turn on or off a thrall&#39;s &#34;consciousness&#34;. Useful if you need them to stay in one place or they&#39;re attacking a friendly NPC and you need them to stop.[/*]\r<br />[*]You can kill a thrall by activating them and selecting Deanimate instead of having to kill them yourself.[/*]\r<br />[*]Thralls are indicated by quest markers.\r<br />[/*]\r<br />[*]When a thrall is killed under most circumstances, an &#34;aura whisper&#34; effect will be applied to them to help you find them. This effect lasts 3 minutes and is dispelled by activating or hitting the corpse. This can be disabled in the MCM menu.\r<br />[/*]\r<br />[*]Additionally, you will also get a notification at the top-left of the screen when a thrall dies. In the MCM you can turn this off or make it a message box that must be clicked.\r<br />[/*]\r<br />[*]A new lesser power called [b]Voice of the Thrall Master [/b]has been added. This lets you control &#34;consciousness&#34;, order to flee or deanimate all your thralls at once. The Voice also lets you teleport all thralls to you and order the thralls to attack a target. The [url=http://www.nexusmods.com/skyrim/mods/28170]Better MessageBox Controls [/url]mod is recommended to make selecting which option you need  easier. The spell tome for the Voice power is available at a new vendor in Whiterun&#39;s Hall of the Dead.[/*]\r<br />[*]The vendor also sells [b]Conjure Corpse [/b]scrolls, which creates different corpses (I recommend looking them up at the [url=http://www.uesp.net]UESP[/url] to know their perks, etc.), a potion that temporarily reduces Conjuration spell costs to 0, Dead Thrall scrolls and the Dead Thrall tome.\r<br />[/*]\r<br />[*]Thralls should now be immune to decapitation and disintegration. If they die, you should always be able to reraise them.\r<br />[/*]\r<br />[*]NPCs will no longer keep saying &#34;That spell looks dangerous.&#34;[/*]\r<br />[*]Thrall moaning and other sounds have been disabled. This also means that NPCs will use the combat and idle lines they had while alive. Though you can reenable them at the MCM if you prefer.[/*]\r<br />[*]Thralls rapidly regenerate health, magicka and stamina while out of combat.\r<br />[/*]\r<br />[*]The purple shader undead have can disappear from the thralls when you change locations. I have &#34;fixed&#34; this though the &#34;fix&#34; can be turned off at the MCM.[/*]\r<br />[*]There is an option in the MCM to give you 8 additional thralls for a total of 10 with Twin Souls. Note that the mod only supports a maximum of 10 dead thralls at a time. Any above that will end up as vanilla thralls and not &#34;better&#34; thralls.[/*]\r<br />[*]There is an option in the MCM to make thrall weapons and staves automatically recharge to a certain threshold when it falls below that.\r<br />[/*]\r<br />[/list]\r<br />[color=#ffff00][b]Known and Potential Issues:[/b][/color]\r<br />[list][*]This will conflict with any mod that alters the Dead Thrall spell and/or scroll.[/*]\r<br />[*]If you have two identical (name, gender, hair, etc) thralls, one can be lost when you leave an area. This affects the vanilla game as well. Still working on this.\r<br />[/*]\r<br />[*]If a thrall dies, you save while still in the same area and then load, it will load with the &#34;commanded&#34; flag active. If you raise this thrall and you&#39;re already at your summon/raise cap then it will ignore the cap and the thrall will be raised. Fast travelling away and back removes the flag.\r<br />[/*]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/33502]Upgraded Weapons and Armors for Enemies [/url]ended up downgrading the smithed gear I equipped my thralls with. This should only affect your thralls if they are generic NPCs; unique NPCs seem to be exempt from the upgrade effect.\r<br />[/*]\r<br />[/list]\r<br />\r<br />\r<br />I hope you will enjoy the mod&#33; If you do, please endorse and/or track. Also, feel free to check out my other completed mod[s]s[/s] and my blog:\r<br />[list][*][b][url=http://skyrim.nexusmods.com/mods/41629/]Almost Everyone is an Adventurer[/url][/b] = My 1st Nexus submission. This allows you to turn most NPCs into useful, recruitable followers for you to use and abuse. Walk up to your favorite (or least favorite) NPC, pick a class and start questing with them today&#33;[/*]\r<br />[*][b][url=http://skyrim.nexusmods.com/mods/43529/]Miraak - Dragonborn Follower[/url][/b] = Have the antagonist of the Dragonborn DLC as your follower&#33; In addition to weapons and spells, he also uses a variety of shouts semi-intelligently. His in-game dialogue has also been copied and edited in order to make him a &#34;fully voiced&#34; follower. The mod also comes with two regular, boring followers.[/*]\r<br />[*][b][url=http://skyrim.nexusmods.com/mods/57393/]Stray Khajiit - Transforming Follower[/url][/b] = Travel with a Khajiit with the power to transform into several different creatures each with its own unique abilities.[/*]\r<br />[/list][url=http://tfskyrim.drupalgardens.com/content/my-completed-mods][img]http://i.imgur.com/FoPztus.png[/img][/url]",
  "categoryId": "79",
  "version": "v1.0",
  "author": "transientfaith",
  "createdUnix": "1410530410",
  "updatedUnix": "1410529544",
  "containsAdultContent": false,
  "uploadedBy": "transientfaith",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126536",
      "name": "Better Dead Thralls v1_0",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "142",
      "fileName": "Better Dead Thralls v1_0-58069-v1-0.zip",
      "uploadedUnix": "1410529544",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0f22c236d499ee4014ee77d05880c8b8e759ed587fdb1b4defd98b4da9491559/analysis/1410529623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Dead%20Thralls%20v1_0-58069-v1-0.zip?fid=1000126536&ttl=1535844422&ri=8192&rs=8192&setec=74b67de36952225cff4afdc846eea75a"
    }
  ]
}