{
  "modId": 58072.0,
  "modName": "Mjoll the Actual Lioness",
  "summary": "Turns Mjoll into a Khajiit",
  "descriptionHtml": "This is my first mod, that I made for myself and decided to share with others.\r<br />\r<br />I really wanted a suitable companion for my male Khajiit, but not being able to find any Khajiit females that could be companions or be married, I decided to make my own. \r<br />\r<br />I always thought it interesting that Mjoll was called The Lioness. Her voice has an interesting purr-like quality to it, and since she&#39;s both a follower and marriable, I thought she&#39;d be perfect as a Khajiit woman. Plus, when she says she&#39;s itching for a fight, I always think, &#34;Hmm, fleas?&#34; ;)\r<br />\r<br />So now, meet Mjoll, the ACTUAL Lioness. I tried to keep her trademark face paint (but done in Khajiit style) and coloring. Her hair is not quite the same color, though.\r<br />\r<br />You might think it breaks immersion when she speaks of her Nord blood, but I figure it like this: Mjoll is a well-travelled female. She had to have inherited that desire to travel from somewhere. In my head canon for Mjoll the Actual Lioness, her mother was a Khajiit who was travelled with the caravans, came to Skyrim, and fell in love with a Nord gentleman. The ring that Mjoll speaks about was a gift from her Nord father to her Khajiit mother, which is why she cherishes it so much. That&#39;s what she has left from them, besides their memories and the skills that they taught her, of hunting and swordplay.  \r<br />\r<br />So, this may not be lore-friendly, but you can make it work when you think about it the way I described.\r<br />\r<br />PLEASE NOTE: The mods that are listed as being required are needed only if you want Mjoll to look as she does in the picture. If you choose not to use Khajiit Wild Eyes or CoverKhajiits for females, your Mjoll should still work just fine, she just won&#39;t look quite the same. \r<br />\r<br />Installation: This is just an .esp file. Unzip it, and extract it into your Skyrim Data folder. Make sure the mod is checked in the data files list.\r<br />Uninstall: Uncheck from data files list, find it in your Skyrim Data folder, delete it. \r<br />\r<br />I hope you enjoy this small mod, please let me know what you think in the comments. Thanks&#33;",
  "categoryId": "33",
  "version": "1",
  "author": "namedforthemoon",
  "createdUnix": "1410539782",
  "updatedUnix": "1410539308",
  "containsAdultContent": false,
  "uploadedBy": "NamedForTheMoon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126551",
      "name": "mjolltheactuallioness.zip",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "mjolltheactuallioness.zip-58072-1.zip",
      "uploadedUnix": "1410539308",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4d646963644ba848adaeb628df24bafed56907240a03445ca7f8771851ab140a/analysis/1410539402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mjolltheactuallioness.zip-58072-1.zip?fid=1000126551&ttl=1535844426&ri=8192&rs=8192&setec=1a16e3e3cdf09fd3d101c95a062e362e"
    }
  ]
}