{
  "modId": 58102.0,
  "modName": "The Gilded Ebony Set",
  "summary": "My Gilded Ebony Set is a try to bring back a bit of the feeling that gave The Elder Scrolls IV: Oblivion to the Players when wearing the Ebony Armor. It is no replacer and not exactly how it was in Oblivion. But i did my best to bring out a lore friendly mod that reminds you of the Oblivion Ebony Armor",
  "descriptionHtml": "With this mod I tried to bring back a bit of the Ebony Armor from The Elder Scrolls IV: Oblivion.\r<br />\r<br />\r<br />[b]What does this Mod?[/b]\r<br />\r<br />This Mod adds a heavy and a light Version of my Gilded Ebony Armor and also a complete Weaponset. It is all crafable and temperable under the Ebony Section with the Ebony Smithing perk. As the Oblivion Version was made completely of Ebony Wood - not like in Skyrim - I wanted the Player also to have the Feeling he wears a Gilded Ebony Wood armor what makes it harder to craft it:\r<br />\r<br />[b]Crafting [/b]\r<br />\r<br />You need to craft Ebony Wood under the Misc section with firewood and an Ebonyingot (I know this doesn&#39;t really make sense) and to craft a Gilded Ebony Armor or Weapon you also need a Goldingot. To improve your stuff you need another piece of Ebony Wood.\r<br />To reward you for your crafting efforts the whole heavy armor is slightly better than dragonscale, the light Armor slightly weaker than Dragonscale and the Weapons as strong as Daedric weapons.\r<br />\r<br />[b]New Feature:[/b]\r<br />\r<br />As Member of The Dark Brotherhood you will find a Ancient Weapon in the Falkreath Sanctuary. - The Ancient Blade of Woe might be greatly known to some Oblivion Fans ;)\r<br />Note: Model made from Scratch by me, no Oblivion Import&#33;\r<br />\r<br />If you spy some Bugs let me know and I&#39;ll try to fix it.\r<br />\r<br />No DLCs required&#33;\r<br />Rate and comment if you like, and enjoy&#33;\r<br />\r<br />[b]Steam Version:[/b]\r<br />\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=183977053&searchtext=gilded+ebony\r<br />\r<br />[b]Steam Name:\r<br />\r<br />[/b]DoG",
  "categoryId": "54",
  "version": "3.0",
  "author": "thetruedragonborn135",
  "createdUnix": "1410607112",
  "updatedUnix": "1410607083",
  "containsAdultContent": false,
  "uploadedBy": "thetruedragonborn135",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000126674",
      "name": "The Gilded Ebony Armory",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19232",
      "fileName": "The Gilded Ebony Armory-58102-3-0.zip",
      "uploadedUnix": "1410607083",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/9e3bef23291ef5e97541465100670b1a6d1ecf98faa51d29ede1bc32f9b85cf2/analysis/1410607213/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Gilded%20Ebony%20Armory-58102-3-0.zip?fid=1000126674&ttl=1535844506&ri=8192&rs=8192&setec=94afd835ab53611bc17aa1fd436a7988"
    }
  ]
}