{
  "modId": 58184.0,
  "modName": "Quintower Manor v2",
  "summary": "Player home with 30 mannequins, weapon racks and storage galore, a bard, and room for an army.",
  "descriptionHtml": "[center][b][size=4][u]DrNewcenstein&#39;s Quintower Manor for Skyrim[/u][/size][/b][/center]\r<br />**Updated Sept 20 2014**\r<br />-Added Armorer Workbench to inner tower room with \r<br />Anvil.\r<br />-Added more Dagger Display cases to three of the \r<br />East towers (large cases that can hold 5 daggers \r<br />each).\r<br />=================================================\r<br />\r<br />This is a lovely player home (like we need another one) situated East of Whiterun that features 5 towers (hence the name), 30 mannequins, 3 interior levels, beds for over 20 people, dining seats for 16, and weapon racks out the whazoo (hint - look closely at the trim over the doors and around the rooms).\r<br />There are also crafting stations of all sorts (except Atronach and Aetherium Forges) both inside and outside (Enchanting and Alchemy only on the inside, though).\r<br />\r<br />The towers have ladders that lead to their observation decks, with seating. While they&#39;re navmeshed, my followers have not been inclined to follow me onto them for whatever reason.\r<br />\r<br />There are also plenty of idle markers inside the house for your followers to interact with.\r<br />\r<br />Lastly, there is a ghostly bard who should only play music, not sing.\r<br />\r<br />I&#39;ve been testing it for the past few weeks, and have only encountered problems when I loaded it up with over 20 followers and left them in it, and loaded up all the mannequins and weapon racks. Sometimes one or two mannequins will hop off their pedestals, but that&#39;s a vanilla issue. At least they don&#39;t walk around.\r<br />\r<br />Enjoy.",
  "categoryId": "67",
  "version": "2",
  "author": "DrNewcenstein",
  "createdUnix": "1410847590",
  "updatedUnix": "1411345252",
  "containsAdultContent": false,
  "uploadedBy": "DrNewcenstein",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127917",
      "name": "Quintower Manor",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "420",
      "fileName": "Quintower Manor-58184-2.zip",
      "uploadedUnix": "1411345252",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/c4b36e2eb29f64462f31a7aad34811d76e457850b6e954b1e6ee83c2a5bbd66a/analysis/1411349102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Quintower%20Manor-58184-2.zip?fid=1000127917&ttl=1535844667&ri=8192&rs=8192&setec=cba3ad09c6a79f34c76362217e89cd95"
    }
  ]
}