{
  "modId": 58208.0,
  "modName": "Library Of Teskara",
  "summary": "Explore the first glimpse into Teskara. A new world that has its own lore, factions, armors, weapons, etc. With its own connected, yet independent, lore you will discover more about the history of this new world. Paying attention and being thorough in your travels will yield the best results and the most immersion.",
  "descriptionHtml": "Hello everyone Monkiman300 here,\r<br />\r<br />This is my first installment of my expansive Teskara world set in the Elder Scrolls universe. This is a simple mod with a few quests and some (poor) voice acting and characters. Since this is my first upload to Steam, there will assuredly be some bugs to deal with. Report any you find and I will fix them as soon as possible.\r<br />\r<br />Explore the first glimpse into Teskara. A new world that has its own lore, factions, armors, weapons, etc. With its own connected, yet independent, lore you will discover more about the history of this new world. Paying attention and being thorough in your travels will yield the best results and the most immersion. Through time the player will discover massive cities, sprawling forests, and even fight the gods themselves. Jump into Teskara today and start making your mark on a brand new world in the Elder Scrolls universe. \r<br />\r<br />The entrance to the Library is just south of Whiterun. A hint to its location is found in the pictures on the mod home page. The Library of Teskara provides about 1-2 hours of new game play and it is suggested that you be a level 45+ character to embark on the missions. It will  only get more difficult from here, so get ready for a challenging new world of fun, adventure, and deep immersion.\r<br />\r<br />If you want to keep tabs on what is happening and what is coming in the future you can:\r<br />Follow The Teskara Project on Twitter [url=https://twitter.com/TeskaraProject]here[/url]\r<br />Or check out the website at [url=http://theteskaraproject.wix.com/theteskaraproject]here\r<br />[/url]\r<br />And don&#39;t forget to rate&#33;\r<br />\r<br />-Monkiman300",
  "categoryId": "36",
  "version": "1.1",
  "author": "Monkiman300",
  "createdUnix": "1410909844",
  "updatedUnix": "1410909844",
  "containsAdultContent": false,
  "uploadedBy": "Monkiman300",
  "primaryFile": null,
  "files": []
}