{
  "modId": 58226.0,
  "modName": "Sea Salt",
  "summary": "Allows making salt out of firewood and sea water, only in limited locations. WIP",
  "descriptionHtml": "I tried all salt related mods, neither worked with Frostfall very well (usualy there was too much salt which affected my characters purse). Either by too meta-game solotions or lack of balance.\r<br />Mod is not fancy script wise, its more about adding an idea that would improve immersive gaming.\r<br />\r<br />In my attempt i reached for option known to mankind for several thousands years- geting salt from sea water.\r<br />\r<br />As of now this mod adds 2 locations near major coastal cities that allow cooking seawater untill salt remains, only material being firewood, (water being roughly 5 yards away). Exchange ratio is 10 firewood per 1 Salt Pile (will most likely be down to 4 in next update). \r<br />All solution are lore friendly and are immersion lead.\r<br />\r<br />Updates will expand on a story of certain nord enterpreuner, expand an added house (it&#39;s a placeholder at the moment).\r<br />\r<br />Modified locations are removed to avoid conflicts with most popular location mods, accidentaly one incorporated itself in 1 such mod.",
  "categoryId": "78",
  "version": "0.9",
  "author": "Ignatius Artemisius",
  "createdUnix": "1410999664",
  "updatedUnix": "1410998825",
  "containsAdultContent": false,
  "uploadedBy": "mike222222",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127300",
      "name": "SeaSalt",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "SeaSalt-58226-0-9.7z",
      "uploadedUnix": "1410998825",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/13885d40b777754b5fd46de061e5283ad3a94be7bc1cddee2de2e734e87c936a/analysis/1410998942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SeaSalt-58226-0-9.7z?fid=1000127300&ttl=1535844740&ri=8192&rs=8192&setec=fc0d848862b5f1670389036680c0e157"
    }
  ]
}