{
  "modId": 58258.0,
  "modName": "Mo&#39; Daedra",
  "summary": "Mora and Dagon are going at it again, and skyrim has become their battleground. Adds about 3000+ leveled daedra, including seekers, lurkers, dremora, and atronachs. The difficulty is comparable to arx fatalis and dark souls die more in a big ol clusterfuck of death and hate. Also changes values of Daedric loot.",
  "descriptionHtml": "Let me start off by saying this mod will ruin what you think of skyrim. It will turn a once peaceful vacant area into a murderboss deathzone. You will die far far more than dark souls. Far more. The only safe(ish) places are places with lots of guards, bandits or dragons. The difficulty is comparable to arx fatalis and dark souls die more in a big ol clusterfuck of death and hate. Also changes values of Daedric loot.\r<br />\r<br />\r<br />Mora and Dagon are going at it again, and skyrim has become their battleground. Adds about 3000+ leveled daedra, including seekers, lurkers, dremora, and atronachs. This mod does 2 things. Turn skyrim into a war-zone beyond that which you&#39;ve ever seen before, and balance that warzone so you or the critters you fight are not too OP. If you download this, it will see your play through to the end. Use with caution, but have fun.\r<br />\r<br />I recommend my other mods as one larger play through pack.\r<br />\r<br />Changelog:\r<br />V: 1.00 Posted basic initial version.\r<br />\r<br />V: 1.10 Added daedra hearts to all daedra. Added about 500 leveled cultist spawn points.",
  "categoryId": "24",
  "version": "1.10",
  "author": "adrian85858",
  "createdUnix": "1411084659",
  "updatedUnix": "1411102013",
  "containsAdultContent": false,
  "uploadedBy": "adrian85858",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127475",
      "name": "Mo&#39; Daedra",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1266",
      "fileName": "Mo' Daedra-58258-1-10.rar",
      "uploadedUnix": "1411102013",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/6466e1bd251a736c3d5f1a7bfa7f33087d49eb3cf12dbdf278609503752b5b39/analysis/1411102090/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mo%27%20Daedra-58258-1-10.rar?fid=1000127475&ttl=1535844787&ri=8192&rs=8192&setec=f3d5838937adbe2c5f83d0f905a87276"
    }
  ]
}