{
  "modId": 58311.0,
  "modName": "Death Mountain 2",
  "summary": "Death Mountain Chapter Two: The Beginning of the End.\r<br />\r<br />Death Mountain 2 is DLC size, adds more 30 hours of new content to Skyrim. history runs parallel to Chapter One: Death Mountain. \r<br />\r<br />This new Adventure adds FIVE New Worlds, and more Epic Battles that you have lived. Only for Dragon Blood.",
  "descriptionHtml": "[center][font=Georgia]\r<br />[center][color=#a47a08][size=4][size=5][img]http://i.imgur.com/QQjkWMQ.png?1[/img]\r<br />[img]http://i.imgur.com/QehZULC.png[/img]\r<br />\r<br />Chapter Two:\r<br />- THE BEGINNING OF THE END -[/size][/size][/color][/center]\r<br />\r<br />[img]http://i.imgur.com/5Fq8s1G.png[/img]\r<br />\r<br />\r<br />[center][size=4][color=#a47a08]First of all thank the team ObliSan  for their support and assistance in this project.\r<br />especially [url=http://www.nexusmods.com/skyrim/users/2002999/?]Sanchez (ilpinfas)[/url] and [url=http://www.nexusmods.com/skyrim/users/1170735/?]Perdida[/url] for their help and encouragement during the project of creating \r<br />\r<br />to [url=http://www.nexusmods.com/skyrim/users/1534227/?]Malakh Venatoris (Malakh22)[/url] for its elaborate translation of the project to the  English language\r<br />and thank users who appreciated my previous project, to all of them is dedicated Death Mountain Chapter Two.\r<br />\r<br />\r<br />[color=#6d9eeb]I have needed about two years to complete this project and be able to bring all fans of Elder Scrolls, only I want to show that you can live your own adventures in this magical universe with a little imagination and dedication, \r<br />\r<br />I ask you only a minute of your time to endorse or comment me if you really like this adventure because it will determine the realization of the last chapter of this trilogy. \r<br />\r<br />Thank you all for playing[/color][/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/NoAKfOc.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]Death mountain 2 is the result of hundreds of hours of work, a titanic effort that demonstrates that we can live our own stories in this wonderful environment such as Skyrim.[/color]\r<br />\r<br />[color=#6d9eeb]You can play chapter one (DM1) and chapter 2 (DM2) in the order you want.[/color]\r<br />\r<br />[color=#a47a08]Death Mountain 2 belongs to the second chapter of the trilogy &#34;Death Mountain&#34; written by Oblivionlaserie.\r<br /> \r<br />[url=http://www.nexusmods.com/skyrim/mods/35200/?]Chapter One: Death Mountain[/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/58311/?]Chapter Two: The Beginning of the End[/url] \r<br />Chapter Three: The Lady Dark\r<br />\r<br />In[url=http://www.nexusmods.com/skyrim/mods/35200/?]&#34;Chapter One: Death Mountain&#34;[/url]our first adventure had to face many dangers to free Sorceress Arcane Nerelia one of the &#34;Order of De Akatosh&#34; she captured in the bowels of Death Mountain a magical fortress that hovers in the skies Skyrim and guarded by armies of undead led by Lords Daedras. \r<br />\r<br />In this new adventure discover who is behind all the evil that threatens the extermination of the Order of Wizards, for so fulfill his plan for the people of Tamriel.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/lh5dLjb.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]In Death Mountain 2 will continue with the same gameplay as the first delivery, our tour we will have to go find the numerous notes, messages and keys in Quest, which will open up new ways to continue our adventure, which take us from the beautiful landscapes of Skyrim to five new and dangerous worlds created for this adventure.\r<br />\r<br />All the rooms we find in our journey, the player can use, homes, cottages and huge castles allies and enemies,and choose our new home, can live in both those found in Skyrim as towns and fortresses we find in the new worlds without any problems, of course if we choose to stay enemy, we must first conquer them.\r<br />\r<br />During our trip we will find followers of various races, Nordic, Imperial, Khajiit, Orc ... trained in various arts, wizards, barbarians, archers, warriors, some of them know the Thu&#39;ums and utilized to help us and so be victorious in our Adventure, these followers are specially designed for large battles that lie ahead, which require a high level of experience and expertise in the arts of our character.[/color][/size][/center]\r<br />\r<br />[center][size=3][color=#a47a08]Death mountain chapter 2, will pass parallel to the first chapter, so for while in Death mountain Nerelia is captured and taken to the fortress to sacrifice, in this second installment we will have to stop the evil that pulls the strings and responsible for the appearance of the first Death mountain and wants to conquer the lands of Tamriel.\r<br /> \r<br />For that you have to travel for five new worlds specially created for this new project, they find all kinds of threats and enemy armies that will put things difficult at the beginning of our adventure, you with the help of Alysha a follower and  Nerelia companion that is specially created and edited to help us win this new adventure.\r<br />\r<br />Books and notes are on our way and guided us through the adventure, also would reveal us succulent rewards, weapons and armor, spells and accessories that will give us advantage over thousands of enemies that await us, you find them all will not be easy , but something is easy ?, \r<br />\r<br />Death Mountain 2, only for Dragon bloods &#33;&#33;&#33;\r<br />\r<br />The realization of Chapter Three: The Lady Dark, is still early to talk about this future project, and will depend upon your comments.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/QhKNkFB.png[/img]\r<br />\r<br />[img]http://i.imgur.com/5o7DDUP.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]To begin our adventure in Death Mountain Two have to find a messenger, your brand will be the one we see on the map at this point in the adventure, after this first meeting, our tour we anger revealing new areas in Skyrim we go visiting, before us five new worlds, allied and hostile, all these worlds are full care and full of details, will open five new to us, Five worlds to explore, live, die, and especially dream ...\r<br />\r<br />The difficulty level of this adventure exceeds that of chapter one, those who have played the previous chapter Death Mountain shall bring a level of appropriate experience to this new venture, so I advise you to have about level 50 to start and survive in Death Mountain Chapter Two.\r<br />\r<br />Since the beginning of the adventure and to its end, you will find hundreds of sites specially created for our character, houses, cottages, castles, forts, ships, etc ... all kinds of housing that can inhabit and so our adventure will be more enjoyable, some of these places must be conquered the enemy in these rooms have everything you need for your character, secure containers of all types and specially appointed where we can leave all our belongings.\r<br />\r<br />To advance the adventure should be finding the notes and messages that will leave us the different characters, which will tell us the locations of the new zones and their respective keys that open, as you can see the structure of the missions is the same as previous mod, which leads to an intense search for these elements, to facilitate  our search and because they are very large areas where you will have to look, I added to the coffers and various containers containing notes and keys adventure with a magical aura.\r<br /> \r<br />Which will make it stand out from everyone else and so we know that contains key elements for our adventure, these containers can be used as insurance for our belongings as everyone else without any problem.\r<br />\r<br />\r<br />[img]http://i.imgur.com/8h5yrWi.png[/img]\r<br />\r<br />\r<br />\r<br />[size=4][color=#6d9eeb]LEGENDARY WEAPONS[/color][/size]\r<br />\r<br />\r<br />During the course of the adventure we can begin a series of alternative searches, such as finding legendary weapons endowed with great power and magic effects , a number of weapons Daedric, weapons are scattered all worlds, so maybe not find them all in our first round of the mod, giving more opportunities to continue your search once finish Adventure travel, and return to visit the scenarios more closely to find them.\r<br />\r<br />\r<br />[size=4][color=#6d9eeb]LEGENDARY ARMOR[/color][/size]\r<br />\r<br />\r<br />Another special searches can begin is the legendary armor, this armor daedric is very special, every part of the armor scheme reinforces the skills, and thus raise the percentages of these skills to heights never imagined with this armor equipped the difficulty level of the game goes into more normal levels, for which you think the level of difficulty is very high, if you wear this armor it becomes quite simple, but you have search all parts of the armor.\r<br />\r<br />\r<br />\r<br />[size=4][color=#6d9eeb]FOLLOWERS[/color][/size]\r<br />\r<br />\r<br />We will find followers from the beginning of our adventure that will help us win the many battles that lie ahead, each follower is trained in various fighting arts, we have the choice between mages and warriors, may shout for power which dominate dragon&#39;s league. \r<br />to the Time to leave his company to pursue and seek support from another follower, the latter return to the place where we recruit, whether in the world of Skyrim or any of the five new worlds, the follower will return home or the place from which it came from.\r<br />\r<br />\r<br />[size=4][color=#6d9eeb]MERCHANTS[/color][/size]\r<br />\r<br />\r<br />In urban areas, especially in the castles, towns, etc ... even in the fortress Death Mountian we can locate different merchants of various kinds, these merchants will put at our disposal various goods, so as to sell that we have found in travel, and in this way we can trade into new worlds without having to return for it to Skyrim.\r<br />\r<br />\r<br />[size=4][color=#6d9eeb]SPECIAL URNS[/color][/size]\r<br />\r<br />\r<br />Exist special urns, these urns can find different types, some can find all kinds of potions, and other of them can find weapons and armor. \r<br />\r<br />These urns are scattered over the battlefield and hostile worlds, the objective of these urns or containers is to provide our character in case you need extra help with the elements they contain. \r<br />\r<br />These types of urns have special names for distinguishing them from other, and have the ability to respawn, so you can return to them after the time, to return to pick up our rewards.\r<br />\r<br />\r<br />[color=#6d9eeb]This is a small sample of what you can find, the rest depends on you and get wherever you want, \r<br />Good Luck &#33;&#33;&#33;[/color][/color][/size][/center]\r<br />\r<br />\r<br />[img]http://i.imgur.com/uOg9CYI.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]Unlike the first chapter of the trilogy, this new adventure takes place not only in the world of Skyrim, in this new chapter we will look at five new world completely different from each other, from the shores of the bay rock dragon, to the forgotten forest the lost sanctuary, challenging the dangerous coast of Necros, while dodging the envestidas dragons when we went into the location nearby fortress Death Mountain, where only you can access by multiple skeletons bridges levitating above the ground hundreds of feet high, one false move and it&#39;s over.\r<br />If you survive even Necros, have to cross the dangerous labyrinths Sepulchre, extensive forbidden world beyond the skies Necros.\r<br />\r<br />These worlds are made with great detail the maximum possible that allows Skyrim engine, reaching sometimes in certain areas, some momentarily slow PC, if any of these worlds perceive it this setback, save the game exit the game and re-load and the problems will be solved, is a minor setback to overcome this level of detail.\r<br />\r<br />Every world has its own Navmeshed 100% finished, so all the followers and NPCs can be used without any problem, both on land and low the waters of the bay and seas of Necros.\r<br />Another important added to Death Mountain 2  is the LOD of the Immense worlds containing, all exclusively made ​​by grandmaster Mod  [url=http://skyrim.nexusmods.com/users/2002999] Sanchez (ilpinfas)[/url]for this project and that enhance the beauty worlds, and to the danger of the Worlds most dangerous ever created.\r<br /> \r<br />All interior rooms and exterior both containing the various worlds may be inhabited and used by our own characters and followers in the game without any problem.\r<br />\r<br />Then some of the features of the new worlds.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/A6sOpsg.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]Alysha&#39;s home is the first player home to start the Aventura, located in Skyrim, it is a house that blends with the environment so it will be difficult to locate at first glance, the house contains two interior rooms.\r<br />\r<br />A house with two floors, and underground cave, it is our main heroine of this chapter, it is Alysha an arcane mage that can recruit as a follower.\r<br />\r<br />The house has everything you need for your character, interior and exterior areas of crafting, lots of specially designated containers, plates of arms, weapons, all types of furniture, operating mines to extract ore and also to improve our weapons, etc ...\r<br />In the stables of the house we find Alysha mount which can be used to ride to the most remote places.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/m4sCLLx.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]The Rock Dragon Castle is a huge castle located in Skyrim, fullyedited with  sixteen interior, the castle contains everything needed for the most demanding characters, it would be impossible to enumerate all features this impressive castle, so find out yourself.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/DAV8t5X.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]The Venator is the only ship with which we can navigate through the world of Death Mountain2, is conceived as a player home, with a large interior that contains everything you need to save our most precious belongings and we can use in different worlds . \r<br />The ship also contains carfting area to create and improve our weapons and armor, kitchen, bedrooms, on the Venator find everything you need to navigate new areas.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/DPbpcWV.png[/img]\r<br />\r<br />[img]http://i.imgur.com/LEUwhoz.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]In Dragon Rock Bay area find another castle in Skyrim, in the castle buildings you can find many merchants as well as a people to their feet with several houses, inn, armory, temples, etc ... with large numbers of citizens and security guards at all the coastal area.\r<br />In castle bay inhabits a very special one, is Alahios firstborn of Akatosh and guardian of the bay,the notes and books that you find along the adventure we reveal more of this special Dragon. \r<br />Under the waters of the bay you can also go looking for treasures in it together, as well as some other mission that will affect the adventure.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/wDzsu7m.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]Lost Sanctuary is a very special and beautiful, full of thick forests and wildlife, but countless dangers, the guardians of the forest, prevent us from continuing on our way and we never get to old temple found in the depths of forest.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/vDfhH8J.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]These hostile worlds are full of treasures hidden, both the indoor and the outdoor . \r<br />\r<br />We will face Battles Epicas with hundreds of enemies, never vivid in Skyrim, enemies have a high level and have the ability to regeneration and shouts of power, if this were not enough the bosses are gifted by the maximum life the game allows, only for true Dragonborn if lograis complete this new chapter of my saga. \r<br />\r<br />Good Luck[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/btO3TeA.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]The creation of the worlds has been a very laborious and costly process, as they are very large areas of land and all of them have been created by hand, piece by piece placed in these new places. \r<br />\r<br />All of them and in full has its respective Navmeshed for the NPCs and followers can use as if it were in Skyrim without any problem. \r<br />A minimum setback we can find in few cases these worlds, oblivious to the mod are loads of these scenarios, because due to the large number of items, the game could not load well on stage, \r<br />\r<br />\r<br />the solution is simple: enough just to save the game and load the game again and the stage will be loaded properly without any problem. \r<br />Thus when we find an element or part of the stage that has disappeared, simply save and reload our game and all sorted. \r<br />\r<br />I´m sorry but, I can not do anything about it.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/d1suqQx.png[/img]\r<br />\r<br />[img]http://i.imgur.com/liTmRjc.png[/img]\r<br />\r<br />\r<br />[center][size=3][color=#a47a08]All these new areas belonging to the hostile worlds, and will have to discover for yourself, and discover all the secrets that are hidden in them.\r<br />\r<br />Although a blood dragon like you will not have problems in challenging the enemy, is it?\r<br />\r<br />\r<br />[size=4][color=#6d9eeb]Guide of Death Mountain 2[/color][/size]\r<br />\r<br />Guide Book of Mod Death Mountain 2 in PDF format, please use only if you can not follow the adventure Death Mountain 2. Available file in this post.\r<br />\r<br />[img]http://i.imgur.com/siuoU1k.jpg[/img][/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/c4rU2zZ.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]You can see the video made especially for Death Mountain 2 [/color][/size][/center][size=3]\r<br />\r<br />[center][youtube]VuTJzQjdPNg[/youtube]\r<br />\r<br />[youtube]V6EqDQRwUwQ[/youtube][/center]\r<br />\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/52559/?] Trailer DEATH MOUNTAIN 2 [/url][/center]\r<br />\r<br />[img]http://i.imgur.com/vlkgE2p.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]AVAILABLE:\r<br />English: [url=http://www.nexusmods.com/skyrim/users/1534227/?]Malakh Venatoris[/url]\r<br />Deutsche:[url=http://www.nexusmods.com/games/users/8185401]Novem99[/url][/color][/size][/center][size=3]\r<br />\r<br />[img]http://i.imgur.com/tB7hAav.png[/img]\r<br />\r<br />[/size][/size][center][font=Georgia][size=3][size=3][color=#a47a08]You only need Skyrim\r<br />No need any other mod, and none of the DCL.\r<br />It is also recommended to have Skyrim latest update.[/color]\r<br />\r<br />\r<br />[img]http://i.imgur.com/WHOJ4Tq.png[/img]\r<br />\r<br />[color=#a47a08]Option 1. Use NMM (recommended).\r<br />or\r<br />Option 2. Simply extract the file with Winrar or 7zip.\r<br />The mod data folder contains two files one esp. and bsa. Install these two files manually into the Skyrim data folder. \r<br />enjoy\r<br />\r<br />VERSIONS:\r<br />\r<br />There are two versions of the mod, the using Skyrim users and for users who use the DLC Dawnguard. \r<br />\r<br />The Two versions have the same content, nothing distinguishes them from one another in terms of history. \r<br />\r<br />Normal Version: For those who use only Skyrim, Not DLC. \r<br />\r<br />Dawnguard version: Who use DLC Dawnguard, this version fixes and improves Navmeshed, the Dwemer door located near the Rock Dragon Castle.[/color][/size][/size][/font][/center][font=Georgia][size=3]\r<br />\r<br />[img]http://i.imgur.com/YSi1vEt.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]Deactivate the esp file in the mod manager of your choice (default Skyrim director, NMM, etc.) \r<br />Delete the esp and bsa file in the data folder of your Skyrim.[/color][/size][/center][size=3]\r<br />\r<br />[img]http://i.imgur.com/sgTEnoe.png[/img]\r<br />\r<br />[center][size=3][color=#a47a08]Only mods may not be compatible with buildings that occupy the same field in Skyrim.\r<br />The Forgotten City mod is NOT compatible with Death Mountain 2[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/rcVTxAu.png[/img]\r<br />\r<br />[/size][/size][center][size=3][color=#a47a08]Ask before using any of the resources from Death Mountain, and don&#39;t upload at  Steam Workshop and the anywhere else without permission.\r<br />Please refrain from distributing an unmodified version of this mod without my written permission.\r<br />Contact me for permission on subjects not covered by these aforementioned terms.[/color][/size][/center]\r<br />\r<br />[img]http://i.imgur.com/nBMU9qR.png[/img]\r<br />\r<br />[img]http://i.imgur.com/VUgIuRO.png[/img]\r<br />\r<br />[size=3][color=#a47a08]For more information, followed in this Web:\r<br />[url=http://oblisanteam.creatuforo.es/foro.html]ObliSan Team Forum[/url]\r<br />[url=http://oblisanteam.blogspot.com.es]ObliSan Team Blog[/url]\r<br />[url=http://www.taringa.net/comunidades/oblisan/]ObliSan Team Web[/url]\r<br />Thank the members of the team, without whose help and support this project would not be possible.\r<br />\r<br />Thank:\r<br />[url=http://skyrim.nexusmods.com/users/2002999] Sanchez (ilpinfas)[/url] \r<br />[url=http://skyrim.nexusmods.com/users/1170735] Perdida[/url] \r<br />\r<br />Thank for Translation \r<br />English: [url=http://www.nexusmods.com/skyrim/users/1534227/?]Malakh Venatoris[/url]\r<br />Deutsche:[url=http://www.nexusmods.com/games/users/8185401]Novem99[/url]\r<br />\r<br />OBLISAN TEAM 2013-2014\r<br />\r<br />[/color][/size][/font][/font][/center]",
  "categoryId": "30",
  "version": "1.1",
  "author": "Oblivionlaserie",
  "createdUnix": "1413303572",
  "updatedUnix": "1420546940",
  "containsAdultContent": false,
  "uploadedBy": "Oblivionlaserie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130674",
      "name": "Death Mountain 2 V 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56762",
      "fileName": "Death Mountain 2 V 1.0-58311-1-0.rar",
      "uploadedUnix": "1413142643",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4af7bd38bf7a9f287f9f2de7803e1b3873dcba0e50e82399897491ec188ad70c/analysis/1413142751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%202%20V%201.0-58311-1-0.rar?fid=1000130674&ttl=1535844887&ri=8192&rs=8192&setec=5fae1004e20276c4848ca2603e527c5d"
    },
    {
      "fileId": "1000130676",
      "name": "Death Mountain 2 V 1.0 Dawnguard",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56784",
      "fileName": "Death Mountain 2 V 1.0 Dawnguard-58311-1-0.rar",
      "uploadedUnix": "1413143971",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f2990c01cd0301190c4c0d9c53ec9ab20540b69923eb58c411a2f15afcf25d2/analysis/1413144072/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%202%20V%201.0%20Dawnguard-58311-1-0.rar?fid=1000130676&ttl=1535844888&ri=8192&rs=8192&setec=027d696550d130fd9951e80b06196242"
    },
    {
      "fileId": "1000140138",
      "name": "Death Mountain 2 V 1.1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "56761",
      "fileName": "Death Mountain 2 V 1.1-58311-1-1.rar",
      "uploadedUnix": "1419500028",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c85babb9d8858b0ba440e5f2eb87c493ff64f3e16c590903980760393a6c5073/analysis/1419500053/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%202%20V%201.1-58311-1-1.rar?fid=1000140138&ttl=1535844888&ri=8192&rs=8192&setec=f93f13e590a894bd444f524133c13982"
    },
    {
      "fileId": "1000140139",
      "name": "Death Mountain 2 V 1.1 Dawnguard",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "56784",
      "fileName": "Death Mountain 2 V 1.1 Dawnguard-58311-1-1.rar",
      "uploadedUnix": "1419501151",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a90ae0953e4bbf8a88641b3f77c5151aa03c1e64b0fb9981b3bdba12d6bb6c37/analysis/1419501191/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%202%20V%201.1%20Dawnguard-58311-1-1.rar?fid=1000140139&ttl=1535844889&ri=8192&rs=8192&setec=089299247562381bed121c8b56ff9fc0"
    },
    {
      "fileId": "1000140140",
      "name": "Death Mountain 2 V 1.1 Dawnguard - Deutsche Version Translation",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8334",
      "fileName": "Death Mountain 2 V 1.1 Dawnguard - Deutsche Version Translation-58311-1-1.zip",
      "uploadedUnix": "1419501588",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/33a40fb1bf79c3b8ff84496a97073d378f01bee026dfe58438f07fd5ce524962/analysis/1419501606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%202%20V%201.1%20Dawnguard%20-%20Deutsche%20Version%20Translation-58311-1-1.zip?fid=1000140140&ttl=1535844889&ri=8192&rs=8192&setec=c397d683279a3f0ce06bc5a7483bc9d0"
    },
    {
      "fileId": "1000141639",
      "name": "Death Mountain 2 - Guide Part 1",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "54067",
      "fileName": "Death Mountain 2 - Guide Part 1-58311-.rar",
      "uploadedUnix": "1420546940",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/89fe14624f6674df087742cfdd1457192a7f4adfda84fdebd4dff46152ef7b65/analysis/1420546991/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Mountain%202%20-%20Guide%20Part%201-58311-.rar?fid=1000141639&ttl=1535844890&ri=8192&rs=8192&setec=bafaba4778474ee49cbd3fa67e285a42"
    }
  ]
}