{
  "modId": 58325.0,
  "modName": "Aura&#39;s Super Simple Tutorial - Blender Installation and Prep",
  "summary": "First in my new A.S.S. series of tutorials (I saw the opportunity, and I took it). This tutorial will guide you through installing Blender 2.49b, Python, and the PFFI for use in editing NIFs, exporting and importing them, among other things. Lasciate ogne speranza, voi ch intrate&#33; This on i&#39;s a little complicated.",
  "descriptionHtml": "[img]http://i.imgur.com/mGkek7s.png[/img]\r<br />                  BECAUSE INSTALLING THIS SHIT IS [i]HARD[/i]. I don&#39;t wanna hear any whining about how easy it is.\r<br />                  Even people who are computer savvy above an average level had difficulty. And when I say \r<br />                  &#34;people&#34;, I mean me. \r<br />\r<br />                  Second, there are a lot of great tutorials out there covering a wide range of topics, but sometimes\r<br />                  the most needed ones are the most seemingly simple things. All of this information is available is\r<br />                  readily available on the niftools website, but it&#39;s all a little spread out and difficult to find, especially\r<br />                  if you&#39;re not sure what you&#39;re looking for. Accordingly, a lot of people (myself included) are visual \r<br />                  learners, and an image-based tutorial is really the best way for us to learn.\r<br />\r<br />                           \r<br />      [img]http://i.imgur.com/IiR0p8L.png[/img]\r<br />            I&#39;m so glad you asked, non-descript purple text symbolizes the masses of confused Nexus members&#33; According\r<br />            to my very good friend and scholar wikipedia, Blender is a [i]&#34;professional free and open source 3D computer \r<br />            graphics program used for creating animated films, visual effects, art, 3D printed modsels, interactive 3D \r<br />            applications and video games. Blender&#39;s features include 3D modeling, UV unwrapping, texturing, raster graphics, \r<br />            rigging and skinning&#34;[/i], and a lot more. Basically, Blender is a modeling tool that can aid modders in creating/editing\r<br />             meshes and making textures. Anything else you want to know can be found on the interwebs and via the many useful\r<br />            tutorials here on the nexus.\r<br />\r<br />            For use with many Bethesda games, Blender has to be dialed back a few versions (actually, nearly 5 years worth of \r<br />            versions) in order for certain needs to be fulfilled. The version of Blender most modders use is...considerably less\r<br />            polished than the newest versions.\r<br />\r<br />            Because of the version needed to meet said needs, the installation process is a little more complicated than just\r<br />            downloading an .exe and double-clicking it. And, considering how much trouble some Nexus users go through installing\r<br />            a simple texture pack (JK GUYS I LOVE YOU, WE WERE ALL THERE AT ONE POINT), a tutorial is almost necessary.\r<br />            So, coupled with my narcissistic tendencies, inert love for attention, and superiority complex, I decided to do it&#33;\r<br />\r<br />               [i]Aura, stop blasting me with a wall of text&#33; Y U SO BORING?[/i]\r<br />\r<br />            Well, someone&#39;s a little testy. Take a seat and get ready to [b][i]learn[/i][/b].\r<br />\r<br />   [img]http://i.imgur.com/oTMnVNy.png[/img]\r<br />                  (Don&#39;t worry, these are all safe downloads directly from the developers through niftools&#39; sourceforge.)\r<br />            - [url=http://download.blender.org/release/Blender2.49b/blender-2.49b-windows.exe]Blender 2.49b[/url]\r<br />            - [url=http://www.python.org/ftp/python/2.6.6/python-2.6.6.msi]Python 2.6.6[/url]\r<br />            - [url=http://sourceforge.net/projects/pyffi/files/pyffi/2.1.11/PyFFI-2.1.11.cefd181.win32.exe/download]PyFFI 2.1.11[/url]\r<br />            - [url=http://sourceforge.net/projects/niftools/files/blender_nif_scripts/2.5.x/2.5.09/blender_nif_scripts-2.5.9.77b0815.zip/download]Blender NIFscripts 2.5.9[/url]\r<br />            - Optionally, winrar or 7zip. You can find those online.\r<br />\r<br />         [i]Reason why an old build is needed:[/i]\r<br />            Blender 2.49b is the build that we need in order to utilize the Blender NIFscripts. We [i]have[/i] to use the 2.49b build\r<br />             because the 2.5 build and the 2.49 builds were massively different in regards to their coding. The NIFscripts must be\r<br />            coded to work with entire new systems in the API (application programming interface). The PyFFI API and Blender API\r<br />            have been coded to work together using the Blender NIFscripts, and if one is changed in a drastic way, then it must be\r<br />            entirely rewritten. The development team for the NIFscripts has a blog, but the development is going slow due to instability\r<br />            in newer versions and introduction of new systems. \r<br />\r<br />            Basically, it&#39;s molasses up in there right now. So we work with what works.\r<br />\r<br />      [img]http://i.imgur.com/KfckEby.png[/img]\r<br />            Now, you walk that sweet ass over to the files tab, and download the cute little tutorial file I put together just for you. When\r<br />            you&#39;ve finished and everything is working, come back to this page and let me know how it went (hopefully great, or I&#39;m a failure).\r<br />            I&#39;ll have a stickied post in the comments full of useful links, resources, and other things I&#39;ve found helpful.",
  "categoryId": "82",
  "version": "v1",
  "author": "auramods",
  "createdUnix": "1411280249",
  "updatedUnix": "1411280231",
  "containsAdultContent": false,
  "uploadedBy": "auraMods",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127802",
      "name": "A.S.S. - Blender Tutorial",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "466",
      "fileName": "A.S.S. - Blender Tutorial-58325-v1.zip",
      "uploadedUnix": "1411280231",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/d4e3e0a9683e42b8fe0f9cd0f3865449ac326fe7800883dac7a0a968966b9608/analysis/1411280342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A.S.S.%20-%20Blender%20Tutorial-58325-v1.zip?fid=1000127802&ttl=1535844907&ri=8192&rs=8192&setec=86f3d48e9d62a552e4a8427ab10c6edf"
    }
  ]
}