{
  "modId": 58348.0,
  "modName": "Roadsigns Remade",
  "summary": "Roadsigns re-textured to be more distinctive",
  "descriptionHtml": "ROADSIGN REPLACERS\r<br />==================\r<br />\r<br />v1.0\r<br />by Autan Waspeez\r<br />\r<br />Firstly: a video&#33; \r<br />\r<br />\r<br />[youtube]s3zXOIdLzIg[/youtube]\r<br />\r<br />\r<br />Many thanks to Nozi :)\r<br />\r<br />DESCRIPTION\r<br />===========\r<br />\r<br />LOOK NO .ESP&#33; Less grief for you *and* me.\r<br />\r<br />****Not all the signs are shown in the images section. I&#39;d rather upload than wander around taking beauty shots. You get the general idea.\r<br />\r<br />\r<br />So, Skyrim&#39;s roadsigns. There are quite a few mods that make them look different ways: here&#39;s another. You&#39;ll either like it or you won&#39;t, depending on your individual tastes. I make my mods for me, but if you like it, I&#39;m glad.\r<br />\r<br />The idea behind this mod was to give the roadsigns a little &#39;personality&#39;. That sounds strange, but I wanted them to be a bit more like advertisements (warnings?) for the different destinations. I&#39;m sure Tamriel doesn&#39;t have any kind of central Ministry of Transport who would insist on standardised signs, so maybe the various Jarls send out wandering housecarls to put up their own town&#39;s signs on the posts around Skyrim. The mod originally started with the idea to make each Hold have its own distinct style of roadsign: however, the scale of that project was beyond what I was prepared to invest in terms of time. The only thing that really survived that prototype is the carved stone pillars to which the signs are attached. I liked them too much to discard :)\r<br />\r<br />In a way it&#39;s a companion piece to my other mod &#39;Signs of Skyrim&#39; - there&#39;s a similar train of thought running through both. So, Solitude&#39;s sign is more emblematic of the more rich (decadent?) Imperial style, whereas Windhelm&#39;s is hard and austere like the place and its inhabitants.\r<br />That kind of thing.\r<br />\r<br />\r<br />\r<br />Most textures are 1k, and now each sign has its own specific normal map.\r<br />\r<br />NO I WILL NOT DO ANY HIGHER RESOLUTIONS. They&#39;re roadsigns for heaven&#39;s sake, don&#39;t stare at them like a lover&#39;s eyes&#33; You&#39;ve got better things to use your VRAM for.\r<br />\r<br />Strongly recommended ====&gt; [url=http://www.nexusmods.com/skyrim/mods/33393/?]Point The Way[/url]\r<br />\r<br />\r<br />\r<br />INSTALLATION\r<br />============\r<br />\r<br />Extract the archive to your Skyrim folder, or let NMM do the work for you. This is a loose files replacer, so agree to overwrite files if asked. BACK UP anything you&#39;re not prepared to lose, including your saves (though they shouldn&#39;t be affected). The sign meshes have altered texture paths and some UV tweaks, in case you&#39;re about to start screamimg about why isn&#39;t this just a bunch of new textures.\r<br />\r<br />\r<br />COMPATIBILITY\r<br />=============\r<br />Shouldn&#39;t clash with anything. Post a picture in the comments if you think it does. I reserve the right to ignore and/or mock you if it&#39;s something blatantly impossible.\r<br />\r<br />\r<br />THANKS\r<br />======\r<br />Brumbek for SMIM - pretty sure the new signpost is one of those meshes.\r<br />PSP8 - the old workhorse plods on.\r<br />Paint.net - sometimes the best things in life really *are* free.\r<br />Crazybump - sooo easy, sooo good. Painless normal mapping in a couple of clicks.\r<br />A Perfect Circle - listening material while I threw this together.\r<br />Bethesda - for making the game and giving us the tools to disembowel the poor thing and remake it as our very own custom-tailored gaudy nightmare freakshow ;)",
  "categoryId": "85",
  "version": "1.0",
  "author": "Autan Waspeez",
  "createdUnix": "1411330613",
  "updatedUnix": "1411330574",
  "containsAdultContent": false,
  "uploadedBy": "Autan Waspeez",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000127895",
      "name": "Roadsigns Redone",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9215",
      "fileName": "Roadsigns Redone-58348-1-0.7z",
      "uploadedUnix": "1411330574",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9d0fd6584799840cbba158ab3660932e775ae3dae6768e72eba1fc83febc60e0/analysis/1411330691/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Roadsigns%20Redone-58348-1-0.7z?fid=1000127895&ttl=1535844968&ri=8192&rs=8192&setec=7e79a807a8ce29352ecbad5605cdab61"
    }
  ]
}