{
  "modId": 5836.0,
  "modName": "Krissa and Meeko - A lvl 5 Khajiit and her Dog",
  "summary": "Krissa and Meeko - A lvl 5 Khajiit and her Dog",
  "descriptionHtml": "\\\"Doesn\\'t look like much....\\\", thinks the lone khajiit who steps onto the dock.  But it\\'s the first port in Skyrim that her little boat docked at so it\\'ll do.  Krissa is confident that she\\'ll have the place wiped clean in no time at all, then it\\'s on to greener pastures.  She flexes her claws and strides through the stares... off to find adventure!\r\n\r\nKrissa is a level 5 khajiit claw fighter, who doesn\\'t know a thing about dragons or dragonborn.  I used the \\\"Skyrim - An Alternate Reality\\\" modded save game to have her starting point be in Dawnstar instead of Helgen.  In fact, the main quest is not even activated and won\\'t do so on it\\'s own.  If you ever want to start the main quest line then use console command \\\"setstage MQ102 30\\\".  Kudos to StannieDum for creating this freeflow RPG save.\r\n\r\nShe hasn\\'t been to very many places... I walked her from Dawnstar to the Solitude stables so I could get to Windhelm and Riften to easily start the thief/assassin quests.  On her way to Solitude she found Meeko, a dog pining away over his dead master.  He\\'s happily attached himself to her and though she detests the dirty mutt, she can\\'t seem to shake herself loose from him.  I can\\'t imagine an odder pairing in Skyrim!\r\n\r\nShe has exactly four perks, one perk in heavy armor (to get to Fists of Steel which is crucial for a claw fighter)... one perk in one-handed to get to Dual Fury which works when one is unharmed... one perk in Sneak and Illusion because I intend for her to be a thief/assassin turned honorable shadow warrior in my own game.\r\n\r\nI have her wearing Triss\\'s Armor for now, as well as a Ring of Khajiit... both of these items are separate mods (listed below) that you will have to install first if you don\\'t already have them.  There are also a few other mods in play, but none of them are required, except perhaps for my own re-colored texture for Meeko the dog, unless you want the default color or another retexture.  I also recolored the Triss Armor myself as I wanted the cloth bits to be more colorful and look less like leather.  This I am not providing because I do not have permission from Psyke23 or Fraper to repost edited versions of their mods.  If there are enough commented requests for me to provide this then I will seek the required permission, although Krissa might look just as good in one of the color sets already available online.\r\n\r\nOh yeah, this save has Krissa placed right outside of Riften, ready to get into trouble ;)\r\n\r\n\r\n\r\nMod Credits:\r\n\r\n\\\"Skyrim - An Alternate Reality\\\" by StannieDum\r\n\\\"No More Blocky Faces\\\" by Xenius\r\n\\\"Covereyes\\\" by MrLenski\r\n\\\"Triss Armor Retextured\\\" by Psyche23 (based off original mod by Fraper)\r\n\\\"Ring of Khajiit\\\" by Bartok TB\r\n\\\"Dog Retex - Reddish Hound\\\" by trixterpriest (moi)\r\n\r\n\\\"Coolsim Hair Pack\\\" by newermind43 (I don\\'t think this is a coolsim hair, but I have it installed so add it here just in case)\r\n\\\"Coolsim Hair Retexture (wild version)\\\" by BloodySunday (again not sure if it applies to this particular hairstyle)\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "trixterpriest",
  "createdUnix": "1326204194",
  "updatedUnix": "1326204336",
  "containsAdultContent": false,
  "uploadedBy": "trixterpriest",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18535",
      "name": "Krissa and Meeko",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1624",
      "fileName": "Krissa and Meeko-5836-1-0.zip",
      "uploadedUnix": "1326204336",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b292f4d36285b25fc54fbe17b051e3c71d9ddb731e6219f8d40eabec4cdf5def/analysis/1406599553/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Krissa%20and%20Meeko-5836-1-0.zip?fid=18535&ttl=1535762874&ri=8192&rs=8192&setec=2533016cf7232ed1751b6ac260c366ef"
    }
  ]
}