{
  "modId": 58383.0,
  "modName": "Dragon Priest Dagger Redone",
  "summary": "A quick retexture and rebalance of the Dragon Priest Dagger",
  "descriptionHtml": "Ever wished that the Dragon Priest Dagger was just a little stealthier looking? I&#39;ve always liked it; it looks like an artifact ripped from the bones of the earth at the beginning of time in a shadowy hall with blood on the floor and walls, and yet I haven&#39;t seen any retextures of this cool dagger on the nexus or anywhere else. I&#39;ve simply retextured it to suit a stealthy character, given it an improvement recipe and changed its stats to match an ebony dagger. It&#39;s no longer that strange copper color; instead it&#39;s a darkish gray. You&#39;ll still need to find one however; smithing one yourself would make it a 4th era fake, not an ancient artifact with a bloody history of unspeakable deeds&#33; I hope you like it; my texturing skills are very limited however, and I likely won&#39;t be taking any requests to change it. Anyone with Fallout Mod Manager, Gimp 2.0 and the DDS plugin could make this in about 10 minutes; I did. Any rebalancing can also be done by you with the Creation Kit in about 5 minutes, so I won&#39;t be fiddling around with that either. Let me know in the comments if this fulfilled your wildest dreams or is the shabbiest excuse for a mod you&#39;ve ever seen; either way, at least you saw it&#33; ;)\r<br />\r<br />If you want to make a better version, go ahead, and send me the link&#33;",
  "categoryId": "55",
  "version": "1.0",
  "author": "skyler544",
  "createdUnix": "1411422504",
  "updatedUnix": "1411422431",
  "containsAdultContent": false,
  "uploadedBy": "skyler544",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128086",
      "name": "Dragon Priest Dagger Redone",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "447",
      "fileName": "Dragon Priest Dagger Redone-58383-1-0.7z",
      "uploadedUnix": "1411422431",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1e1db796e9d077f0731a5d2ec7c293214611b238339b5b2aa0205c97a8386788/analysis/1411422543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Priest%20Dagger%20Redone-58383-1-0.7z?fid=1000128086&ttl=1535845031&ri=8192&rs=8192&setec=de9cfd86716914c9f7253c506bd8ccc3"
    }
  ]
}