{
  "modId": 5839.0,
  "modName": "Wicked Wolf and Fox- Voice Mod",
  "summary": "This mod gives some very aggro and appropriate sounding vocal attacks, injury, and death cries to the wolves and foxes. These are sounds that I think are appropriate for wolves and foxes in a \r\nland where lycanthropy is quite common. \r\n",
  "descriptionHtml": "UPDATED AND FIXED FILE.\r\n\r\nNew version just posted. Now much less sound overlap when being attacked by a group of wolves. Some attack samples were removed because they were playing on top of each other when you injured a wolf multiple times.\r\n----------\r\n\r\nWicked Wolf \r\nVersion 1.0b \r\n\r\nA wolf and fox voice add-on mod for Skyrim\r\n\r\nBy: DarkHighlord69\r\n\r\n--------\r\n\r\nThis mod gives some very aggro and appropriate sounding vocal attacks, injury, and death cries to the wolves and foxes. These are sounds that I think are appropriate for wolves and foxes in a land where lycanthropy is quite common. \r\n\r\nThe voices will actually be a part of an upcoming mod that will make the wolves and foxes a recruited/conscripted faction of spies and mercenary hunter/killers for the Aldmeri Dominion and Thalmor. \r\n\r\nIn the W.I.P. mod, the Aldmeri Dominion recruit and magically train the wolves and foxes to be their willing thralls across all of Skyrim. They have gathered a huge force of willing killers and spies to act as their four legged agents and assasins. It is quite appropriate in my mind that they would use the insults they are now able to vocalize. \r\n\r\nIt is now very common knowledge among the hunters and adventurers that the wolves and foxes of Skyrim have a deep hatred for heretics and worshippers of Talos. \r\n\r\nThey are the wild servants of the Thalmor who will hunt Skyrim mercilessly with the sole purpose of killing any and all heretics. Dedicated followers of Talos and the ancient gods beware, the wolves are hunting you. The foxes are watching you and alerting the wolves and Thalmor agents. Kill them before they kill you.\r\n\r\nI got sick of waiting for the CS so I decided to share this with the community. I want to get some feedback and comments on the vocal elements, and the general concept of the upcoming mod.\r\n\r\n--------\r\n\r\nHow I made this vocal mod.\r\n\r\nFirst I went though about 5gb of vocal samples trying to find just the right samples for a wolf. I was not able to find any for almost a week. I took a short break from Skyrim mod testing to go back in time to visit Martin Septim. Heard my Oblivion character say some of the best lines I had ever heard and knew I found my voice for the wolf.\r\n\r\nI re-pitched the original samples and made them very deep and growly sounding. I then ran all the vocals though a bunch of audio processing and noise filters to make it blend in as seamlessly as possible. They sound best at mid-level game volumes, but even at very high audio levels they do  not overcome the natural attack sounds.\r\n\r\nThe wolves will still growl and make all the other attack sounds. I was very specific in setting up which samples to replace. From over 100 hours of testing I was able to determine the precise pitch level and timing to make them sound like evil and hate filled wolves.\r\n\r\nI am warning you ahead of time that if you kill the wolf or fox too quickly the samples will overlap on occasion. If you are getting attacked by a wolf pack it will also sound a little strange when more than one wolf is speaking. I have tried to make this as small a problem as possible, but it will happen occasionally when you get mobbed.\r\n\r\nBy default all sounds for the wolves also are applied to the foxes, so I unintentionally made for some very funny times for all you fur hunters. As a result of the default settings in the game the foxes\\' voices are actually pitched just like a small fox would sound. I had no idea that this would happen, but it really sounds funny when you hit a fox with a slow acting attack like Frost or Fire Breath. You\\'ll just have to murder one of the poor little foxes to see what I mean.\r\n\r\nNo real animals were harmed or killed in the making of this mod. A pile of virtual animals the size of Red Mountain was created right outside of Whiterun during testing; sorry for the smell. My thanks goes to all the poor innocent foxes who died a slow and painfully hilarious death for my testing purposes. \r\n\r\n; {P \r\n\r\n------\r\n\r\nHow to install-\r\nEither use NMM or manually extract the data folder and copy it to your game folder.\r\n\r\nTo remove, just go to sound/fx/npc and delete the wolf folder.\r\n\r\n-------\r\n\r\nCREDITS-\r\n\r\nMy Voice Extender for Oblivion by Maskar.\r\n\r\nAll vocal samples were taken from the My Voice Extender mod for Oblivion.\r\n\r\nProper respect and all credit to Maskar . He created of one of the most excellent and useful voice mods ever made for any game.\r\n\r\nPermission from original mod is as follows.\r\n\r\nMy Voice Extender:\r\nLicensing/Legal\r\n===============\r\nYou can do whatever you want with this mod but all I ask in return is that you give me credit if you distribute any part of this mod.\r\n\r\nPlease note that permission for using the included soundfiles was asked for and that I was told that there were no objections.\r\n-----------\r\n\r\nDark Highlord\\'s Rules of Use for this file-\r\n\r\nNo sharing or posting to other sites. If you use the samples in this mod you must give credit to the original mod author. I do not own the files in this mod, so I will not allow it to be hosted on any other site. NEXUS USE ONLY!!!!",
  "categoryId": "61",
  "version": "1.0b",
  "author": "DarkHighlord69",
  "createdUnix": "1326204562",
  "updatedUnix": "1326212662",
  "containsAdultContent": false,
  "uploadedBy": "DarkHighlord69",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18561",
      "name": "Wicked Wolf 1_0b",
      "version": "1.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2616",
      "fileName": "Wicked Wolf 1_0b-5839-1-0b.rar",
      "uploadedUnix": "1326212662",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/daaf29202a7c3b8283be00727da876d3709456ed9c7b5d4021ea4058caf25418/analysis/1406599893/",
      "changelogHtml": " Removed some of the vocal samples so the voices do not overlap when attacked by more than one wolf. <br/> \n Removed some of the samples to prevent lots of samples overlapping when the wolf gets injured <br/> \n Swapped sveral aggro sounds that had previously been used for the attacks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wicked%20Wolf%201_0b-5839-1-0b.rar?fid=18561&ttl=1535762877&ri=8192&rs=8192&setec=a83855430372c0a9c8075cb55e147219"
    }
  ]
}