{
  "modId": 58413.0,
  "modName": "Bright and Dark Tyrael Armor German",
  "summary": "Der Mod bringt eine Neue Rüstung in das Spiel Jedoch ist diese in Vier Varianten erhältlich. Einmal als Leichte oder Schwere version und diese jeweils Hell oder Dunkel. Die Stats sind in etwa mit der Ebenerzrüstung zu Vergleichen.",
  "descriptionHtml": "[b]Die Modifikation wurde von KoRe Erstellt und wird ebenfalls benötigt.\r<br />Ihr findet die Mod hier: http://www.nexusmods.com/skyrim/mods/8729/?\r<br />\r<br />[/b]Beschreibung:\r<br />Der Mod bringt eine Neue Rüstung in das Spiel Jedoch ist diese in Vier Varianten erhältlich. Einmal als Leichte oder Schwere version und diese jeweils Hell oder Dunkel. Die Stats sind in etwa mit der Ebenerzrüstung zu Vergleichen. Die Rüstung ist die von Tyrael dem Erzengel der Gerechtigkeit aus Diabolo.\r<br />\r<br />Installation:\r<br />Sind wir doch ehrlich jeder weiss wie es geht. (falls dem nicht so ist gibt es grob geschätzt 50k Anleitungen im WWW)\r<br />\r<br />Zu mir:\r<br />Dies ist meine Erste Übersetzung sollten sich Fehler bei der Übersetzung eingeschlichen haben entschuldige ich mich dafür. \r<br />Ich werde weitere Mods Übersetzen, zuerst die welche ich selbst gerne benutze und noch keine Übersetzung besitzen und danach werde ich mich bemühen auch eure Vorschläge zu Übersetzen. \r<br />Ich Arbeite momentan an der Übersetzung zur Windstad mine, bin damit eigentlich auch fertig möchte jedoch selbst gerne noch eine Proberunde drehen und sehen ob mir die Satz- bzw. Wortwahl gefällt.\r<br />\r<br />Fehler:\r<br />Sollten sich Übersetzungsfehler eingeschlichen haben, dürft ihr mir das sehr gerne schreiben werde mich bemühen den Fehler auszubügeln.\r<br />Bei Fehlern an der Modifikation bitte an KoRe wenden, sollte euer English jedoch nicht so gut sein dürf ihr mir gerne euer Problem schreiben und ich werde sehen was sich machen lässt.\r<br />",
  "categoryId": "54",
  "version": "1.0",
  "author": "KoRe",
  "createdUnix": "1411520532",
  "updatedUnix": "1411520532",
  "containsAdultContent": false,
  "uploadedBy": "denu1452",
  "primaryFile": null,
  "files": []
}