{
  "modId": 58433.0,
  "modName": "Bandits Blimp - Playerhome Mod",
  "summary": "A beautiful playerhome, which can be found flying above the beautiful docks of Riften. The blimp offers a nice and relaxing place in which the player can rest, and gaze into the sunset of Tamriel. ",
  "descriptionHtml": "[center][b][img]http://i.imgur.com/iEOIfBn.jpg[/img]\r<br />[/b]\r<br />[size=3]Hello, and thank you for viewing my new mod. This took me atleast 2 days to produce; was previously going to be publishing\r<br />it on the first, but then decided that it wasn&#39;t up to standard, and added a whole lot more detail into it. [/size]\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/24thnqx.jpg[/img]\r<br />\r<br />[size=3][b]With this unique player home, you get the ability to sleep, rest, and be solitary whilst flying over the peaceful, misty docks[/b]\r<br />[b]of [url=#]Riften[/url].[/b]\r<br />\r<br />[b]Despite Riften being classed as one of the most crime ridden cities in all of Skyrim, your new [url=#]blimp[/url] allows you to get away from this danger, and allows you, the dragonborn to retreat yourself to a peaceful paradise. [/b]\r<br />\r<br />[b]The Bandits Blimp has all of the features of a standard home; from alchemy equipment to a place to rest. This flying mechanism has all you need&#33; (Apart from a parachute. Atleast if the Blimp does manage to fall, you will HOPEFULLY land in the ocean right?) [/b]\r<br />\r<br />[img]http://i.imgur.com/L4KfG7V.jpg[/img]\r<br />\r<br />[b]Here is a list of the features that are included within this Fantastic player Home:[/b]\r<br />\r<br />[b]-All of the tools that are included within a standard player home. (Bed, storage, Alchemy Lab, Enchantment[/b]\r<br />[b] Table, cooking pot, etc.)[/b]\r<br />\r<br />[b]-Companion friendly, and should allow your companion to follow you around your hovering home&#33;[/b]\r<br />\r<br />[b]-Detailed and immersive interiors, and gives you the feeling of a standard skyrim home.[/b]\r<br />\r<br />[b]-Quality check means that this blimp is 100% safe, and the chances of it falling out of the [url=#]sky[/url] are next-to nothing&#33;[/b]\r<br />\r<br />[b]-Wood crafted from the finest craftsmen, maintaining heat during the cold seasons of Tamriel.[/b]\r<br />\r<br />[b]-Built in burglary contraptions, making it impossible for bandits, thieves, smugglers to steal your goods. [/b]\r<br />\r<br />[img]http://i.imgur.com/XaW7wTb.jpg[/img]\r<br />\r<br />[b]Where can the Blimp be found, within Riften?[/b]\r<br />\r<br />Honestly, its pretty hard to miss, but i will tell you anyway. Upon entering Riften from the main gates, walk across the bridge which is directly in-front of you, carry on strolling past the Bee and Barb Inn, and then bring yourself into the marketplace. From there, you should see a ladder, a rather long ladder in-fact. This should take you to the blimp. If you cannot see this ladder, then i am afraid that the mod has not been [url=#]installed[/url] properly&#33; \r<br />\r<br />[img]http://i.imgur.com/fVtKV0c.jpg[/img]\r<br />\r<br />[b]Is the blimp spacious?\r<br />\r<br />[/b]I ensure you, the blimp is huge, and most of the rooms are rather spacious, so don&#39;t worry about becoming claustrophobic&#33;\r<br />\r<br /> \r<br />[b]Were any of the assets used, created by you?[/b]\r<br />\r<br />To tell the truth, all of the assets that i used, even when constructing the blimp itself, were simply assets that were within the creation kit. These models can also be found within [url=#]the game[/url]. None of the assets that i used were produced by me, which shows what you can really do with the assets that are in skyrim by default&#33; \r<br />\r<br />[b]Can you find the Blimp on the World Map? \r<br />\r<br />[/b]When creating this mod i did not believe that a fast Travel feature was needed to get to the blimp, due to the fact that most people that are going to be getting this mod should have already adventured towards Riften. The quickest way of getting to the blimp is simply by fast travelling to Riften, and then escorting yourself to the ladder which will take you to the blimp. \r<br />\r<br />[img]http://i.imgur.com/PMLAHmr.jpg[/img]\r<br />\r<br />[b]If you need any help with installing the mod, which should be done using the Nexus Mod Manager, or if you just want to ask questions in general then please leave these in the comment section and i will reply to them as quick as i can&#33; \r<br />\r<br />[/b]\r<br />\r<br />[img]http://i.imgur.com/fOssnMu.jpg[/img]\r<br />\r<br />[b]I would like to personally say thank you so much if you do in-fact decide to install my mod. This mod took me a total of 2 days to produce (2 days straight i must add), so im hoping that this is a playerhome that you would consider of a decent quality, and i hope that you decide to pack your bags, and move into this drifting  demicastor&#33;\r<br />\r<br />If you believe that this mod is worth an endorsement (Please tell me it is) then please endorse this mod if you feel the need to, as even that gives me enough support to carry on producing mods, and simply makes me feel better about my mods&#33; (I don&#39;t mean to sound like i want sympathy, sorry if i seem that way&#33;) \r<br />\r<br />Thank you, and i hope that you have safe flights, in your new home&#33; \r<br />\r<br />[img]http://i.imgur.com/FnRqPjI.png[/img][/b][/size][/center][size=3][b]\r<br />[/b][/size]",
  "categoryId": "67",
  "version": "1.0.0",
  "author": "Me",
  "createdUnix": "1411590115",
  "updatedUnix": "1411588490",
  "containsAdultContent": false,
  "uploadedBy": "fi5h1fishy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128296",
      "name": "The ",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7541",
      "fileName": "The -58433-1-0-0.zip",
      "uploadedUnix": "1411588490",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/028d8eb5171bd57c3bcef9f718c0889f7e28090e6f0e88942504029618af4f58/analysis/1411588565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20-58433-1-0-0.zip?fid=1000128296&ttl=1535845119&ri=8192&rs=8192&setec=799a2c48a3050fa39f7ed82d25bb1a6c"
    }
  ]
}