{
  "modId": 58432.0,
  "modName": "The Ruby Knife",
  "summary": "This mod adds a new and unique weapon to the game, but it is no ordinary weapon mod. To get this weapon, you must embark on a journey across Skyrim to find all it&#39;s pieces in order to craft it. It also has a unique enchantment.",
  "descriptionHtml": "An unfortunate treasure hunter met his end in Lake IIinalta. Find his body, and you can uncover the secrets of what he was searching for.\r<br />This mod adds a mini quest for you to embark on, that will take you all across Skyrim, looking for parts of a rare treasure. When you find them all, you can craft the legendary Ruby Knife&#33; This is a unique knife, with a unique power, that&#39;ll be well worth the adventure.\r<br />The knife itself is the 4th weapon I&#39;ve modelled and textured all myself from scratch. This one I have spent the most time on so far, taking over a week to get the texture to look just right. I hope my effort pays off and you enjoy this mod&#33; :)\r<br />\r<br />Installation: Just install normally via NMM or another mod manager, or, extract the esp to your data folder, and merge the meshes, textures and scripts folders with the ones in your data folder. (Only one small script is used)\r<br />\r<br />Compatibility: There should be no issues with other mods that I&#39;m aware of.\r<br />\r<br />Credits go to Tamira for helping me out when I had an issue with my mesh, and everyone who commented on my post on the forums with feedback about my textures :)\r<br />\r<br />Hope you like it&#33;\r<br />\r<br />Also thanks to Matthiaswagg for doing a showcase of my mod&#33; You can check it out right here:\r<br />\r<br />[youtube]t6C3y1pP2IA[/youtube]",
  "categoryId": "55",
  "version": "1.0",
  "author": "simsim899",
  "createdUnix": "1411585463",
  "updatedUnix": "1411585394",
  "containsAdultContent": false,
  "uploadedBy": "simsim899",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128294",
      "name": "The Ruby Knife",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "626",
      "fileName": "The Ruby Knife-58432-1-0.rar",
      "uploadedUnix": "1411585394",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a9667c91f498d62f761bddec14fa28cf91f0ca6cf549614aa2423730ea59efe5/analysis/1411585503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ruby%20Knife-58432-1-0.rar?fid=1000128294&ttl=1535845118&ri=8192&rs=8192&setec=72dc3b983fd1a82cf8fdfa6655ff1467"
    }
  ]
}