{
  "modId": 58487.0,
  "modName": "Less Annoying Merchants",
  "summary": "Replaces most of the vendors&#39; long, repetitive lines (eg. &#34;some call this junk, I call them treasures&#34;) with short ones (eg. &#34;take a look&#34;). This can be considered a redux of BaconCat&#39;s &#34;Merchants only reply with Take a Look&#34; mod.",
  "descriptionHtml": "[b]\r<br />[size=2]First off........If you&#39;d like to support me, please check out my game, [url=http://www.sprykegame.com/]Spryke[/url]&#33; To watch it evolve, as well as get updates about my upcoming Skyrim mods, follow me [url=https://www.facebook.com/Volnaiskra]on facebook[/url].\r<br />[/size]\r<br />[center][url=http://www.sprykegame.com/][img]http://i.imgur.com/fsWmSrF.jpg[/img][/url][/center]\r<br />\r<br />____________________________________________________________________________________________\r<br />\r<br />ok, now on to the mod...\r<br />\r<br />[size=5]WHAT?[/size][/b]\r<br />\r<br />[i]Less Annoying Merchants [/i]replaces most of the various vendors&#39; long, repetitive lines that you&#39;re sick to death of hearing, such as &#34;Some may call this junk - I call them treasures&#33;&#34; and &#34;Oh, so you&#39;re an alchemist, then?&#34;, with shorter and snappier ones like &#34;Take a look&#34;. \r<br />\r<br />\r<br />\r<br />[b][color=#ffd966][size=5]WHY?[/size][/color][/b]\r<br />\r<br />There is already a mod on the Nexus that does this: [url=http://www.nexusmods.com/skyrim/mods/10905/?]Merchants only reply with take a look[/url] by BaconCat, which I happily used myself for a long time. Unfortunately, that mod has issues, and the author is no longer active on the Nexus.\r<br />\r<br />BaconCat made his mod by modifying attributes in the Creation Kit (to force certain dialogue options to point to different voice files) and packaging these modifications into an .esp file. That was arguably the smart and elegant way to make this mod, but it also has the potential to conflict with other mods that edit the same records, such as the USKP. Several users have reported that it prevents certain thieves&#39; guild vendors from working properly. \r<br />\r<br />So, I&#39;ve redone the mod, using a cruder, but much safer, method...\r<br />\r<br />\r<br />\r<br />[b][color=#ffd966][size=5]HOW?[/size][/color][/b]\r<br />\r<br />I&#39;ve dug up all of the actual vanilla sound files, and replaced the annoying ones with duplicates of the less annoying ones. So, the game still [i]thinks[/i] that it&#39;s berating you with &#34;Trinkets, odds and ends; that sort of thing&#34;, but actually the &#39;trinkets...&#39; file has been changed to a duplicate of the &#39;take a look&#39; file. \r<br />\r<br />That makes this mod very light-weight and risk-free. There are no .esps, no scripts, and no realistic potential for conflict with other mods. It uses 100% vanilla assets, and you can install/uninstall at any time without affecting your save.\r<br />\r<br />However, there&#39;s one catch to using this method. The files I&#39;ve replaced are .FUZ files, which contain both the audio and the lip-sync information (so yes, the lip-syncing will still be correct - though you won&#39;t ever have time to really see it, since NPCs in Skyrim freeze once you enter a barter menu). But the .FUZ files don&#39;t contain subtitle information. That means that if you have subtitles enabled, you&#39;ll still see the old subtitles (eg. you&#39;ll hear &#34;take a look&#34;, but the subtitle might still say &#34;Spells and incantations for those with the talent to cast them&#34;). \r<br />\r<br />This is at worst a minor annoyance, since the subtitles will only display for a moment before entering the barter menu in vanilla -  and even less if you use [url=http://www.nexusmods.com/skyrim/mods/34224/?]Vendor Sale Delay - GONE[/url].\r<br />\r<br />There [i]is[/i] a solution for this subtitle problem, but I am unwilling to implement it. Skyrim&#39;s subtitles are kept in &#34;...STRINGS&#34; files, and there are only a very small handful of these in the entire game. That means that if I was to make edits to one of them, this mod would suddenly conflict with just about any other mod that touched the STRINGS files. That would violate one of my primary goals with this mod: to make it risk-free and uber-compatible with everything. \r<br />\r<br />If subtitles are important to you and you&#39;d like to edit them yourself, I believe the file you need to edit is skyrim&#92;Data&#92;Strings&#92;Skyrim_English.ILSTRINGS. It&#39;s in some strange format, so you&#39;ll need to google yourself a special program to be able to read it - a regular text editor such as Notepad or Notepad++ won&#39;t do.\r<br />\r<br />[size=5]\r<br />[b][color=#ffd966]WHO?[/color][/b][/size]\r<br />\r<br />I&#39;ve replaced the files of all all generic voice types, using the original vanilla voice files, so it should affect all traders in the game. The only dialogue that is affected are the vendors&#39; various replies to the question &#34;What have you got for sale?&#34;. In most cases, I&#39;ve replaced their answers with &#34;take a look&#34;. In some cases, I&#39;ve replaced them with &#34;see for yourself&#34;, or other lines that I deemed to be suitably prompt and inoffensive.\r<br />\r<br />[i]Most [/i]instances of the longer lines have been replaced, but not [i]all - [/i]this is intended. I wanted to minimise the repetition of the merchants&#39; tiresome lines while keeping things [i]somewhat [/i]organic, so that at least a few of them didn&#39;t sound like robots who can only say &#34;take a look, take a look, take a look...&#34;\r<br />\r<br /> In particular, I have not removed:\r<br />\r<br />[list][*][size=2]Certain lines that contained contextual information (such as lines informing you about special prices for members of a certain guild). [/size]\r<br />[/*][*][size=2]Certain lines that I felt added personality to one or two specific vendors, and didn&#39;t just feel like generic cookie-cutter lines (such as a line about &#34;raiments&#34;, spoken by a vendor at Radiant Raiments).[/size][/*]\r<br />[*][size=2]Certain lines that I felt would sparingly add a bit of colour, such as &#34;what are you hunting?....never mind, I don&#39;t want to know&#33;&#34;. In these cases, I stripped them from all voice types except one. That way, you&#39;ll likely only hear them spoken by one NPC in the game, rather than hearing several NPCs utter the same exact line in different voices.[/size][/*]\r<br />[/list]\r<br />Let me know if you think I&#39;ve missed someone. But please keep in mind that, as outlined above, the mod does not aim to remove 100% of all non-&#34;take a look&#34; lines.\r<br />\r<br />\r<br />\r<br />[b][color=#ffd966][size=5]WHERE?[/size][/color][/b]\r<br />\r<br />To install/uninstall, just use NMM. Uninstalling won&#39;t affect your saves.\r<br />\r<br />For manual installation, copy the contents inside the archive into your data folder. To find [i]Less Annoying Merchants&#39; [/i]files, navigate to the folder data&#92;sound&#92;voice&#92;skyrim.esm&#92; and look in the various subfolders there. All of the files from this mod are FUZ files that begin with [i]dialoguege_offerservicesto......[/i]\r<br />\r<br />\r<br />\r<br />[b][color=#ffd966][size=5]AND?[/size][/color][/b]\r<br />\r<br />I highly recommend this complementary mod which will make your Skyrim shopaholism experience even smoother:\r<br />[url=http://www.nexusmods.com/skyrim/mods/34224/?]Vendor Sale delay - GONE[/url]\r<br />\r<br />The following mod is of a similar spirit. If you get the excellent &#34;no pause between lines&#34; option, it noticeably improves a large proportion of the dialogue in Skyrim (not just the bards). I consider it essential.\r<br />[url=http://www.nexusmods.com/skyrim/mods/6496/?]FSS - Better Bards [/url](Make sure you install the the &#34;no pause between lines&#34; option&#33; I use the &#34;slight delay&#34; variant)\r<br />\r<br />Also, check out my other mod:\r<br />[url=http://www.nexusmods.com/skyrim/mods/24805/?]Better Animal Footsteps[/url]\r<br />\r<br />\r<br />\r<br />[b][color=#ffd966][size=5]HUH?[/size][/color]\r<br />[/b]\r<br />[b][color=#fff2cc]FAQ: Does [i]Less Annoying Merchants[/i] have a performance impact?[/color]\r<br />[/b]\r<br />No. It doesn&#39;t add any scripts, esps, or new assets. It uses only vanilla assets. In fact, if you want to get technical about it, the mod theoretically improves your performance, since it replaces long dialogue files with shorter ones that use less RAM. Though of course the difference would be too tiny to notice.\r<br />\r<br />[b]\r<br />[color=#fff2cc]FAQ: Is [i]Less Annoying Merchants[/i] compatible with [i][mod x][/i]?[/color]\r<br />[/b]\r<br />Yes. \r<br />\r<br />\r<br />\r<br />[b][color=#fff2cc]FAQ: Is [i]Less Annoying Merchants[/i] compatible with [i][mod y][/i]?[/color]\r<br />[/b]\r<br />Yes. \r<br />\r<br />\r<br />\r<br />[b][color=#fff2cc]FAQ: You don&#39;t even know what mods I was thinking of - how would you know they&#39;re compatible?&#33;[/color][/b]\r<br />\r<br />[i]Less Annoying Merchants [/i]doesn&#39;t make any edits in the creation kit, and doesn&#39;t add any new content. It doesn&#39;t try to coerce Skyrim to behave differently to how it was intended to behave. In other words, as far as Skyrim is concerned, it&#39;s still playing the same number of FUZ files in the same order as before, using the same files with the same filenames as before. The only way a mod could conflict with [i]Less Annoying Merchants [/i]is if it wanted to provide its own versions of those exact same vendor dialogue files. And if that happened, the worst result would be that that particular line of dialogue would be overwritten by whichever mod you installed last.\r<br />\r<br />In fact, [i]Less Annoying Merchants [/i]is even 100% compatible with the afore-mentioned [url=http://www.nexusmods.com/skyrim/mods/10905/?]Merchants only reply with take a look[/url] that it seeks to replace (even though there would be no point in using both mods).\r<br />\r<br />\r<br />\r<br />[b][color=#fff2cc]FAQ: Are there any known issues?[/color][/b][color=#fff2cc]\r<br />[/color]\r<br />Yes, Belethor still sounds like he&#39;s gargling through a bucket-full of phlegm. Sadly, this mod doesn&#39;t change that. Also, the subtitles - if you have them enabled - will still display the old lines. Please see the &#34;How?&#34; section for details. \r<br />\r<br />\r<br />\r<br />[b][color=#fff2cc]FAQ: You said that the correct subtitles didn&#39;t display, but your screenshots show correct subtitles. What gives?[/color][/b][color=#fff2cc]\r<br />[/color]\r<br />Yes, I know. But I figured that showing the correct subtitles was the best way of illustrating what the mod is about in an image. To get the screenshots, I had to repeatedly talk to the vendors until the correct (eg. &#34;take a look&#34;) subtitle finally sh",
  "categoryId": "69",
  "version": "1.0",
  "author": "Volnaiskra",
  "createdUnix": "1411799681",
  "updatedUnix": "1411798392",
  "containsAdultContent": false,
  "uploadedBy": "volnaiskra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128583",
      "name": "Less Annoying Merchants v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "210",
      "fileName": "Less Annoying Merchants v1-58487-1-0.7z",
      "uploadedUnix": "1411798392",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e42728235aa4ab053a931c628a76e443df1a0aba29f5937cac3622f67e16b2d3/analysis/1411798502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Less%20Annoying%20Merchants%20v1-58487-1-0.7z?fid=1000128583&ttl=1535845200&ri=8192&rs=8192&setec=ed435cbf0a4cfb70283b37deae86e20e"
    }
  ]
}