{
  "modId": 58513.0,
  "modName": "Knights of the Order of the Azure Glade",
  "summary": "Set of five themed male light armors, equivalent to leather, elven, scale, glass and dragonscale, each with a matching shield",
  "descriptionHtml": "[size=3]\r<br />[youtube]dMaogcG3tLU[/youtube]\r<br />Be sure to change to highest HD setting when viewing on YouTube&#33;\r<br />\r<br />=====================================================================================================\r<br />UPDATES AND IN THE WORKS:\r<br />\r<br />11/23/2014: I think I have [color=#00ffff]fixed the leather armor issue[/color] where &#34;vanilla&#34; leather armor was displaying the azure texture.\r<br />\r<br />11/23/2014: Now that I finally know HOW to imbed a custom specular map inside the normal map, I have [color=#00ffff]remastered all of the normal maps[/color].  Things that are supposed to be metallic and reflective -- such as the order emblem and the rank runes -- now look like metals, as well as the elbow and knee guards.  Everything now has at least a subtle reflection befitting its imagined material.  The effect is subtle, but profound.\r<br />\r<br />[size=3]11/10/2014: I have uploaded a youtube video showing the two armor textures.  To best see them, play the video on youtube and be sure and use the highest HD setting to view them.  The videos still do not show the true fidelity of the textures in game, but they do give you an idea of the overall armors.[/size]\r<br />\r<br />[size=3]11/10/2014: After receiving permission from all mod authors, I have now combined all esp files into one, preventing the need for installing other mods.  I also &#34;remastered&#39; the esp, which should eliminate any &#34;junk&#34; entries.[/size]\r<br />\r<br />[size=3]10/26/2014:  I am still working on trying to combine everything into on esp file.[/size]\r<br />\r<br />[size=3]10/26/2014:  I uploaded a &#34;corrected&#34; esp file that should be installed only if you installed the original main file BEFORE \r<br />10/27/14.  It fixes a problem with the Squire armor where the texture \r<br />files were not linked correctly, causing nakedness when worn.[/size]\r<br />\r<br />[size=3]10/26/2014:  I have uploaded a MIDNIGHT GLADE retexture that might help with the &#34;too blue and bright&#34; comments.  It shifts the color spectrum away from azure and towards the indigo spectrum, with darker and less-saturated colors. I will upload some screen shots of the Midnight Glade texture as time permits.[/size]\r<br />\r<br />9/29/2014:  There have been comments that the colors of the set are too blue and too bright.  I think this has a lot to do with the ENB that you&#39;re using, since many ENB&#39;s over-saturate colors for bolder effect.  Also, it&#39;s SUPPOSED to be blue -- that&#39;s why I put &#34;Azure&#34; in the name.\r<br />\r<br />\r<br />=====================================================================================================\r<br />\r<br />\r<br />\r<br />This is my first attempt at this sort of project, so over all, I suppose the end result did not turn out too poorly.  [/size]\r<br />\r<br />[size=3]I started this mod because I wanted a male light armor that had some tasteful color to it.  All of the armors that I had seen up to that point, in my opinion, were either too bland, too garish, or female-only, so I set out originally to do a simple color overlay to an existing armor.   Little did I know  that the project would balloon out and consume six months and well over 400 hours of my time.[/size]\r<br />\r<br />[size=3]When I stumbled across the [/size][b]Knightranger Archers Armor[/b][size=3], I knew I had found something that I could use as a foundation.  That set of armor had an excellent texture, and I thought a simple recolor would not be too complicated. [/size]\r<br />\r<br />[size=3]After I had done the original retexture, I happily started playing Skyrim for the first time.  Everything went smoothly until I leveled my smithing skill up to to “advanced” and discovered that my painstakingly-retextured armor was becoming obsolete.[/size]\r<br />\r<br />[size=3]That’s when I wondered if it would be possible to create a set of light armor that you could start the game in, and then level up all the way through dragonscale.  Thus, the Order of the Azure Glade was born.[/size]\r<br />\r<br />[color=#00ff00][size=4][b]This set of armor has five “ranks” --  Knight (leather), Knight Errant (elven), Knight Chevalier (scale), Knight Commander (glass), and Knight Warden (dragonscale).  There is also an equivalent shield for each rank.  The armor can be forged, tempered and enchanted. [/b][/size][/color]\r<br />\r<br />[size=3]The lowest rank starts out with the least adornment, and as each rank progresses, the cuirass and hood become a little more elaborate.[/size]\r<br />\r<br />[size=3]There is also a “Squire” cuirass, hood and shield for each of the regular “ranks” of armor.  I did this so that you could adorn your male “minions” in the best armor that you could craft, but they would still appear to be of lesser rank  than you.    The squire armors possess the Azure Glade order emblem, but lack any rank runes.  All of the squire armors look exactly alike, no matter what armor protection that they provide.  (So the leather squire 5 cuirass [dragonscale armor value] looks exactly the same as the squire 1 cuirass [leather armor value].)  [/size]\r<br />\r<br />[size=3][color=#ffff00] Although this turned out to be a complicated re-texture using multiple overlays, it is still exactly that – a [color=#00ff00]RE-TEXTURE[/color].  I do NOT know how to change meshes, [color=#ff7700]so any restrictions of the original armor remain[/color].  \r<br />\r<br />That means that the armor is [color=#ff7700]MALE ONLY[/color].[/color]  [color=#00ff00]Although the armor (cuirass, gloves, boots and shield) can be worn by [color=#ffff00]ANY[/color] male[/color], the [color=#ff0000]hood[/color] cannot be worn by Khajit or Argonians because of their extra-large and irregularly shaped heads.  As time permits, I may try and find another hood just for them, but for now, I would suggest for those two races to use a mod that either provides invisible helmets or an armored circlet.[/size]\r<br />\r<br />[size=3]There is a cloak.  It is just cloth and provides no armor, so there is only one cloak (not one for each rank).  As with many cloaks, the armor tears through the cloak in spots around the shoulder.  There’s nothing I can do about that since to fix it would require changing the mesh.[/size]\r<br />\r<br />[size=3]There are a couple of oddities that you should note before you think something is missing from the crafting list at a forge.  There is no leather shield in vanilla Skyrim, so although the Knight cuirass, gloves, hood and boots show up under “Leather”, the shield shows up under “Hide” armor.  The same applies to the Knight Chevalier armor, which you can craft when you get the “Advanced” armor smithing perk.  The Chevalier armor shows up under “Steel” because it is based off of Scale armor.  However, the Chevalier shield shows up under the “Elven” menu at a forge because I copied from an elven shield when I created it since there is no “scale” shield.[/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700][size=5]======[color=#ff0000]F I R S T  T I M E INSTALLERS[/color]  - N M M    I N S T A L L A T I O N =======\r<br />[/size][/color]\r<br />[size=3]Choose either the original main file for the Azure colors, or choose the OPTIONAL MIDNIGHT GLADE retexture for the darker texture set.  You do NOT need to install both.[/size]\r<br />\r<br />\r<br />[color=#ff7700][size=5]========[color=#ff0000]U P G R A D I N G [/color]   I N S T A L L A T I O N =============[/size][/color]\r<br />\r<br />[size=3]Uninstall my previous Azure Glade mod.\r<br />\r<br />Uninstall the Knightranger Archer&#39;s Armor.\r<br />\r<br />Uninstall the Old Knight Shield (if you still have it installed -- that was from the very first version of this mod).[/size]\r<br />\r<br />[size=3]Install the mod again with your preference of original Azure texture or the newer Midnight texture.[/size]\r<br />\r<br />[size=3]I remastered the ESP and combined everything into one.[/size]\r<br />\r<br />\r<br />\r<br />[size=4]CONSOLE COMMANDS:[/size]\r<br />\r<br />[size=3]There are a lot of armors, all with similar names, so if you try and us the &#34;help&#34; console command, you will get too many to show at one time.\r<br />\r<br />To help isolate the particular Azure Glade armor set from all of the others in Skyrim, I suggest using the following syntax:\r<br />\r<br />For ( leather) Knight armor and (elven) Knight Errant armor, use the command [color=#ffff00] help &#34;glade knight&#34; [/color]\r<br />[size=3](note the quotation marks)[/size]\r<br />\r<br />For (scale) Knight Chevalier armor, use the command  [color=#ffff00]help &#34;glade chevalier&#34;[/color]\r<br />[size=3](note the quotation marks)[/size]\r<br />\r<br />For (glass) Knight Commander armor, use [color=#ffff00]help[/color] [color=#ffff00]&#34;glade commander&#34;[/color]\r<br />(note the quotation marks)\r<br />\r<br />For (dragonscale) Knight Warden armor, use  [color=#ffff00]help &#34;glade warden&#34;[/color][/size]\r<br />[size=3](note the quotation marks)[/size]\r<br />\r<br />[size=3]For the Squire armors, remember that they are numbered 1 to 5, with 1 being leather and 5 being dragonscale.  Use &#34;glade x squire&#34;  with the &#34;x&#34; being the number that you want.  For example, if you want to show the glass armor set -- set 4 -- you would type[/size] [size=3][color=#ffff00]help &#34;glade squire 4&#34;[/color][/size]\r<br />\r<br />\r<br />\r<br />\r<br />[u]ROLE-PLAYING:[/u]\r<br />\r<br />[size=3]As to the nature of the Order of the Azure Glade, well, that’s up to you to decide.  Perhaps they are an ancient order of druids sent to Skyrim to investigate the sickness of the Gildergreen… Perhaps they are an order of rangers investigating the rumors of returning dragons…. Perhaps they are an order formed by surviving Blades members whose purpose is to thwart the machinations of the Aldmeri Dominion in the Empire…Perhaps they are a super-secret, elite order of the Thalmor Justiciars whose true purpose is known only to the most senior leaders of the Aldmeri Dominion… it’s up to you to define them&#33;\r<br />\r<br />\r<br />[b][u]SPECIAL THANKS:[/u][/b]\r<br />Thanks to KnighRangerGuild for permission to use his Knightranger Archers Armor, and LordofWar for porting the Witcher Setkirk armor for which it was based upon.\r<br />\r<br />Also thanks to TheMalfazar for permission to use his Old Knight Shield, which is the only one that I could find that had a regular shape and also a smooth surface for easy retexturing.[/size]",
  "categoryId": "54",
  "version": "1.4",
  "author": "Piyarz",
  "createdUnix": "1411877284",
  "updatedUnix": "1416753548",
  "containsAdultContent": false,
  "uploadedBy": "Piyarz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136453",
      "name": "Knights ofthe Azure Glade Armor Set - Single ESP",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "119745",
      "fileName": "Knights ofthe Azure Glade Armor Set - Single ESP-58513-1-4.rar",
      "uploadedUnix": "1416752774",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/b1d17e7077b358fdb7b702ea233669378c836d66130da222daef4782cde67d3e/analysis/1416752944/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Knights%20ofthe%20Azure%20Glade%20Armor%20Set%20-%20Single%20ESP-58513-1-4.rar?fid=1000136453&ttl=1535845250&ri=8192&rs=8192&setec=930f06bee72c55373a53deda43f7b934"
    },
    {
      "fileId": "1000136454",
      "name": "Knights of the Azure Glade - Midnight Glade Retexture",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "118278",
      "fileName": "Knights of the Azure Glade - Midnight Glade Retexture-58513-1-4.rar",
      "uploadedUnix": "1416753548",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/fa93a02cbd2ac9e90297819cdec5e6c9cbb14963cc97ddd96482b27feae9f5e5/analysis/1416753717/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Knights%20of%20the%20Azure%20Glade%20-%20Midnight%20Glade%20Retexture-58513-1-4.rar?fid=1000136454&ttl=1535845251&ri=8192&rs=8192&setec=6945f287b78fdbc9c4e2e9e6407b459d"
    }
  ]
}