{
  "modId": 58523.0,
  "modName": "Skyrim - Discworld Alpha 0.1",
  "summary": "The alpha build of Skyrim Discworld, come on in and enjoy the ride",
  "descriptionHtml": "[center][color=#00ff00][size=5]\r<br />\r<br /> [url=http://www.bbc.com/news/entertainment-arts-31858156]Sir Terry Pratchett[/url]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />NOTE[/size]\r<br />[/color]This file will never be scanned and always show the yellow indicator due to file sizes etc\r<br />Reference post by Darkone IE Robin Scott IE Owner of the site (For those of you still in the dark)\r<br />[url=http://forums.nexusmods.com/index.php?/topic/1901058-virus-scan-reports-now-visible-on-file-pages-more-security-incoming/page-19#entry18688394]Reference Post[/url]\r<br />I was tweaking out about this the first few days and actually posted the question to him as well and got the same response\r<br />\r<br />Also, for those of you that Cohen seems to hate and doesn&#39;t want to follow correctly, he is 76, if he seems to be lagging wait a hour he will catch up, or just run ahead, he magically appears at key points to do what he is supposed to to advance the story (Failsafes and REASONS&#33;)\r<br />\r<br />\r<br />\r<br />First, the most recent Trailer (It looks more epic than the mod is trust me)\r<br />[youtube]FEBNe8XINd0[/youtube][/center]\r<br />[size=3]A must watch for ANYONE playing this, especially before you post any bugs, critiques etc, a lot of information is given as well as anyone who wants to help in the future of the mod should watch\r<br />[/size][center][youtube]QY1fRSPqXdQ[/youtube][/center]\r<br />&#34;Also, NEVER save the game when controlling a character other than yourself, the reloads are unpredictable, this includes the Blessing of fenris spell&#34;\r<br />\r<br />\r<br />[font=Times New Roman][color=#00ff00][size=5]Fix Log 0.5 Final Stable\r<br />[/size][/color][/font]This should be a decent list of the fixes etc to 0.5\r<br />I plan to stop supporting this Alpha version unless we experience some gamebreakers that are new and were not addressed already. I am glad to report we have approximately 15 more dungeons to add to the Discworld landscape and I will be spending the next few weeks writing out quests for as many as I can. I expect Alpha 1.0 to be toward end of year or very early next. We also have people brainstorming boss ideas for some dungeons and we have some custom creatures to use as well for some situational encounters\r<br />\r<br />Fixes from 0.1 - 0.5\r<br />-Cohen control scene should have some failsafes and he should not come through the wall to help you fight anymore\r<br />-Nepenthe, Stinky will now actually give you the potion instead of trolling you\r<br />-Fixed mended drum invisible furniture (I hope)\r<br />-Goblin control sequence in Snuff should have a redundancy on first second and third zones, please report if still buggy tested 5 times\r<br />-Valuns should no longer hide under the docks from death, who he shouldn&#39;t see anyway&#33;\r<br />-Vimes has a silent greeting which should prevent the conversation from sticking in snuff\r<br />-You can no longer jump out to oblivion through the windows of towers in riftvald\r<br />-Crafting station/animation bug was resolved\r<br />-Summon horse spell is now named correctly\r<br />-Some grammar subtitle fixes, it&#39;s a long process cause I am a slop at typos\r<br />-More than kin will stop firing till after Snuff\r<br />\r<br />\r<br />\r<br />[size=3]Table of contents\r<br />[/size]   [size=3]1 Introduction\r<br />[/size]   [size=3]2 FAQ&#39;s\r<br />[/size]   [size=3]3 Known Bugs\r<br />[/size]   [size=3]4 Compatibility  Issues\r<br />[/size]   [size=3]5 Installation Instructions\r<br />   6 Special Thanks\r<br />\r<br />\r<br />[/size][size=4]Introduction\r<br />[/size]   \r<br />   This mod has been a long time coming to Alpha. Originally I was planning on Alpha with a few hours of content. We have surpassed that by a fair margin. Playable quests are 18. There are 2961 total audio files (some may be duplicates it got messy for a spell), 10,100 total files packed in the BSA. As of now I have no idea how long it takes to do everything as I tend to massively cheat. (Reports range from 10-15 hours)\r<br />   \r<br />   This is first and foremost A test. There is a lot of land empty, there are probably still bugs I haven&#39;t found, There is a lot of QA that needs to be done to tweak some aspects. There is also far less &#39;discworld&#39; than I would have liked and it is mostly myself to blame. I got distracted on side quests and populating the world and also fell ill for a few months which degraded my modding. For the next few months my sole objective is getting more and more actual discworld into the mod. Sidequests will be added all over to fill in and give the world more life, but those will be written and cast by others.\r<br />   \r<br />   On that note, anyone who is willing to write a quest (Cleared by me on technical aspects etc and overall fit of story) is welcome to come aboard. With the addition of Valentari tot he ranks as lead casting director, I have a bit more free time and someone who is willing and also very good at getting voices for the characters, leaving me more time to do more of what I love and setting up quests and the world\r<br />   \r<br />   Dungeon and house designers are also in great demand for me. Basically anything that can be done out of house, IE outside my esp and then imported in, speeds the overall completion of the mod drastically. Not to mention I am rubbish at interior design.\r<br />\r<br />   Also a special thanks to Jean-Gabriel Raynaud and Marwan de Carmentran, for stepping up and making amazing music for this giant pile of trash I am making :P, seriously though, their music makes me feel that my work is inadequate to host it. Just stand outside in discworld sometime and let the tracks cycle, I found myself doing that a fair bit. A full soundtrack is planned, as of now it is 4 exploration tracks and 2 battle tracks and a theme song that will play on the intro credits when you enter discworld.\r<br />\r<br />   The quest is started in the middle of whiterun, Jimmy will approach you. The video above has information on quests order, chain quests, and locations of misc side quests.\r<br />\r<br />      Future plans include the following:\r<br />   A granny weatherwax quest chain\r<br />   Completion of Going Postal storyline\r<br />   Completion of Snuff storyline\r<br />   A Death/Susan storyline\r<br />   The Hogfather -Probably butchered to no end to make it work-\r<br />   The Fifth Elephant storyline\r<br />   A fully functioning summoners rift, The baseline for it is up and tested etc but it&#39;s on the backburner for a while\r<br />   The final part of the main questline will be The Color of Magic and The Light Fantastic, culminating what should be a 9 part main questline\r<br />   30-50 more sidequests\r<br />   A total of 40+ hours of content\r<br />   Actually integrating all the spells I made (Sorry guys whove been following never got to it)\r<br />   Collection and exploration minigames using reality re-alignment spell\r<br />   Spell bartering with the Librarian using Bananans found around the island\r<br />\r<br />\r<br />\r<br />\r<br />[size=4]Frequently asked Questions  [/size](going to make these up atm)\r<br />\r<br />1: Why is there so much empty space\r<br />   A:  It&#39;s a Alpha\r<br />\r<br />2: You broke my Game&#33;\r<br />   A: Not a question, but quite Possible\r<br />\r<br />3: Voice X is horrible, and/or there are missing lines and half the people do not say hello tome\r<br />   A: Not a question, but we are aware of some voice issues on the technical side especially and will be working in the future to recast with more reliable voice actors. Also no one likes the dragonborn cause you don&#39;t speak to them, merely send them text responses\r<br />\r<br />4: Why didn&#39;t you do X\r<br />   A: It&#39;s a alpha, there is a lot that needs to be done that isn&#39;t\r<br />\r<br />5: Why did you release a unfinished product\r<br />   A: Mainly to test issues and see if there are any random compatibility issues and stability issues with how I am building the quests and world. Also to gen up interest and get others to help on the project. \r<br />\r<br />6: Death talks over X, why is he so loud, he also is using large caps\r<br />   A: Cause he is death and therefore important, alas the game does not have small caps\r<br />\r<br />7: Why is there a stargate\r<br />   A: Seemed the funnest way to send the player home, it will have a quest leading up to it in phase two but needed something there as a go between for alpha\r<br />\r<br />8: My game crashes when I reload because I was controlling another character\r<br />   A: Unfortunate side effect of the game engine and controlling a different character, almost nothing I can do besides the warning\r<br />\r<br />9: No one arrests me and the watch helps me attack people WTF?\r<br />   A: It&#39;s a alpha, if you want to run around and rob and kill everyone.. go for it, Crime factions etc and jailing the player is nowhere near a priority for the mod at this stage. Once all quests are done and tested and working I may begin working on crime factions and punishment etc. But to be fair, it is discworld, if you kill a innocent without being a member of the assassins guild they would probably have you imbued, likewise stealing the thieves guild would then hire the assassins guild to take you out sooooo, yolo?\r<br />\r<br />10: Do I have to complete the first three quests to unlock the rest\r<br />   A: Short answer, yes, long answer, there are a few quests that do not require it, but after the first three the whole of the non-chain sidequests will probably unlock, this is planned for future sidequests as well\r<br />\r<br />11: Does this require DLC SKSE etc etc\r<br />   A: No it is and will always be fully vanilla compatible\r<br />\r<br />12: What is with the intro credits\r<br />   A: Anyone with a large contribution to the mod made it in the intro credits, each person there has the option to add 1 Favorite author in the special thanks and 1 active, inactive, deceased etc soldier from any branch of any military (barring the obvious) to the dedication. Terry Pratchett was a given. For disclosure, mine was John Ringo and Captain Tamara Long. \r<br />\r<br />\r<br />[size=4]Known Bugs   -Read before posting bug reports please-\r<br />\r<br />[/size][s]Something seems to be keeping people from using crafting stations, looking into this more tomorrow[/s]\r<br />During control of Goblin in snuff quest markers do not work hence the arrows, cannot be fixed, game mechanic\r<br />[s]Cohen control scene will be refined but so far only 2 errors on it waiting to hear more[/s]\r<br />The &#34;Summon Horse&#34; Spell at the beginning is incorrectly named &#34;Summon Familiar&#34; in spell tab, will fix \r<br />   Sometimes the player falls during the intro credits, God mode is on but it can get weird, still trying to fix it correctly\r<br />   BunBun&#39;s carrotstorm can sometimes hit the player\r<br />   There are letters in the Going Postal memory sequence -Still trying to track down which ones they are-\r<br />   Vimes has missing lines in &#34;A Matter of perspective&#34;\r<br />   Colon has one missing line in &#34;A Matter of perspective&#34;\r<br />   [s]Fillin has a missing line in BunBuns intro[/s]\r<br />   BunBun can get stuck randomly, it&#39;s part of rabbit animations, just wait 1 hour to fix him\r<br />   Sometimes the compass points back into buildings when the objective on the map is clearly defines in a different area, possible navmesh issues\r<br />   Subtitle grammer problems, Will be fixed at way later dates, not even close to high on priority at the moment\r<br />   Sometimes on escort scenes (especially with angua) they frees after traveling for a bit, save/reload or wait usually works, no idea why it is doing this randomly\r<br />   Battle music was causing me problems by not turning off randomly, but it does that in vanilla sometimes so might not be my issue\r<br />   In &#34;Less than kind&#34; randolf likes to run away from combat, no idea.. maybe he&#39;s advancing in a different direction?\r<br />   The game can CRASH on trying to close it, this is due to cutscenes employing loss of collision via translate scripts which bug out the game, there is no harm as far as I can tell as it only does it on trying to close skyrim, just crash it out and restart, mostly happens after intro credits on older computers\r<br />   Riftvald Wing1, game crashes on first reload of the zone, for instance if you die, never happens again as far as I can tell reloads fine from restart, will look into this further, zone only uses vanilla assets so it is a bit weird\r<br />   [s]Little more than kin is firing anytime in the Uberwald center, looks buggy as people run to it, just wait one hour if you trigger it. Supposed to be after snuff forgot to disable box I was testing it, will fix in a esp update in the future[/s]\r<br />   Cultists in riftvald might fight each other, hilarious, not game breaking, but will be fixed at some point rofl\r<br />   --More added as we find them--\r<br />\r<br />\r<br />\r<br />[size=4]Compatibility Issues[/size]\r<br />   [size=2]Anything that modifys Whiterun possibly because Jimmy is just sitting there in the Alpha, will be fixed later with a tp into a existing marker.\r<br />[/size][size=2]   Anything that modifys Solitude Docks possibly, the ship that you leave on is there, will probably never change\r<br />\r<br />   My BunBun Mod here on nexus, uninstall it for sure before installing DIscworld\r<br />   All my spells are currently ok to keep as I didn&#39;t get around to adding those yet\r<br />[/size]   --Will post further ones if found--\r<br />\r<br />\r<br />\r<br />[size=4]Installation\r<br />[/size]   Requires 1 Gigabyte of HD space when unzipped\r<br />   Download with NMM\r<br />   Or manually move the BSA and ESP into your data folder and play\r<br />   Put at top of load order just in case\r<br />\r<br />\r<br />\r<br />\r<br />[size=4]Special Thanks\r<br />[/size]Krystin Mass, you were there from Dragon Break and onward, your enthusiasm and pep helped me to forget that I am a colossal idiot who undertook a impossible job and just keep plowing on\r<br />\r<br />Matthew Curtis, you annoy the piss out of me with constant badgering, but I need it :) Also if anyone needs a Voice Actor this guy comes through in a pinch and is pure quality, can&#39;t recommend him enough\r<br />\r<br />Ryuji/MarianHawk, The first dungeon designer and person besides a voice actor to join the team. People like him are underrated to the extreme. His dungeons litter Discworld and Dragon Break, and without him I would be months behind where we are now. Without him on board Discworld would have never even been a idea, let alone a small reality.\r<br />\r<br />Khijin, He helped me with the mental anguish of a thousand migraines and crash coursed me through programming. I never want to do somethign that annoying again but a massive amount of how we are doing programming and what I am capable of now is due to him\r<br />\r<br />Jason &#34;Valentari&#34; Start, for stepping up and making this day possible a few weeks probably early. He hunted down VA&#39;s and got me a ton of missing lines and recasts within a short few days. he is also stepping in as Casting director now, a much needed role as I am clearly not a people person and 100% terrible at casting reliable people\r<br />\r<br />Terry Pratchett, We are about to celebrate the 31st anniversary of The Color of Magic, a book published almost exactly 2 months after I was born, I just wish I could age as well :) His writing has followed me my whole life and I look forward to his books more and more. Age has made his writing better, but I will never forget the first two books and they will stay with me as my favorites of the series.\r<br />\r<br />My wife, the silent hero in all of this, who has to constantly listen to me drone on about everything in this mod as well as put up with my ADD etc and she finances all of this without really bitching at all. If you enjoy this now or in the future, thank her. On the same note if you hate it I will whip her and scream at her in accordance to how much hate is given (What, she can&#39;t take the thanks without the hate mkay&#33;) I kid I kid, I&#39;ll only scream at her.",
  "categoryId": "30",
  "version": "0.5",
  "author": "darren83",
  "createdUnix": "1411931916",
  "updatedUnix": "1414006125",
  "containsAdultContent": false,
  "uploadedBy": "Darren83",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128723",
      "name": "Discworld Alpha 0.1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "320264",
      "fileName": "Discworld Alpha 0.1-58523-0-1.7z",
      "uploadedUnix": "1411887046",
      "modVersion": "0.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Discworld%20Alpha%200.1-58523-0-1.7z?fid=1000128723&ttl=1535845263&ri=8192&rs=8192&setec=c51f89144e27a9f89950fadabe40cdab"
    },
    {
      "fileId": "1000128984",
      "name": "Discworld Intro Replacers",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12939",
      "fileName": "Discworld Intro Replacers-58523-1-0.7z",
      "uploadedUnix": "1412022296",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7102f0fad8272d05d44b74cba301d6c720eb4b601e3a054fa6b6be276bc7aa39/analysis/1412022371/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Discworld%20Intro%20Replacers-58523-1-0.7z?fid=1000128984&ttl=1535845264&ri=8192&rs=8192&setec=1dd751ad139adc7b12ba4344676d9b1b"
    },
    {
      "fileId": "1000129130",
      "name": "Discworld Alpha 0.314",
      "version": "0.314",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "320325",
      "fileName": "Discworld Alpha 0.314-58523-0-314.7z",
      "uploadedUnix": "1412100018",
      "modVersion": "0.314",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Discworld%20Alpha%200.314-58523-0-314.7z?fid=1000129130&ttl=1535845264&ri=8192&rs=8192&setec=a2204137a7faca1e933a9960a5815f48"
    },
    {
      "fileId": "1000129678",
      "name": "Discworld Alpha 0.5 Final",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "320423",
      "fileName": "Discworld Alpha 0.5 Final-58523-0-5.7z",
      "uploadedUnix": "1412489995",
      "modVersion": "0.5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Discworld%20Alpha%200.5%20Final-58523-0-5.7z?fid=1000129678&ttl=1535845265&ri=8192&rs=8192&setec=c0cdb9a55f265e56a3d8aad74ed67379"
    },
    {
      "fileId": "1000132057",
      "name": "Discwroldm1.esp",
      "version": ".5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10879",
      "fileName": "Discwroldm1.esp-58523--5.7z",
      "uploadedUnix": "1414006125",
      "modVersion": ".5",
      "virusScanUrl": "https://www.virustotal.com/file/c41d71829bb1deed58f088c96bd40b6e8e8c632aea8e4637b47c0e512e089ac2/analysis/1414006214/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Discwroldm1.esp-58523--5.7z?fid=1000132057&ttl=1535845265&ri=8192&rs=8192&setec=5cac101dc677ffd01c4dd7289a19d22c"
    }
  ]
}