{
  "modId": 58550.0,
  "modName": "Simple Sun Damage",
  "summary": "In skyrim vampism is minor, it takes away regen that you might have already removed yourself with other mods and does minimal damage. So in sunlight your attributes go down by your stages times 100, and you can keep your regen. (More to be added later)",
  "descriptionHtml": "In skyrim sunlight was never threatening in the least, nobody bothered feeding because nobody relied on regen. So you know what? JUST KEEP YOUR BLOODY REGEN I&#39;M AIMING FOR THE SOFT SPOTS. Sunlight will damage your health, stamina, and magicka by 100 times your stage number. To clarifty those are the max stats being damaged. So if you have 410 health the sun will not kill you. That&#39;s it, I touched 0 scripts.\r<br />\r<br />\r<br />There is going to be more to this mod later, for now though I&#39;m focusing on the essential bit. It works as is mind you.\r<br />\r<br />Also for permissions, do whatever with it, translate it, mirror it, hell even fill the NSA server number 1 with it. I don&#39;t care.\r<br />\r<br />[size=4]Post feedback about ideas in the comments, below is the current roadmap. You can be an ideas guy if wanted.[/size]\r<br />[list][*][size=2]Infinite Stamina Regen if it&#39;s above 0 because you&#39;re undead and don&#39;t need to even breathe.[/size][/*]\r<br />[*][size=2]Since sunlight is made out of magicka, do something with that stat, please give me ideas on that.[/size][/*]\r<br />[*][size=2]Better Vampires Testing, and if it needs it, better vampires entire version of this mod.[/size][/*]\r<br />[*][size=2]No scripts, EVER. If I have to rebuild an ESP from scratch instead of doing a script that will be how it&#39;s done.[/size][/*]\r<br />[/list][size=2]\r<br />Personally I use RND + Frostfall and never felt punished as a vampire by those, thats why this even exists.[/size]",
  "categoryId": "78",
  "version": "0.1",
  "author": "Taiolu",
  "createdUnix": "1411948466",
  "updatedUnix": "1411948461",
  "containsAdultContent": false,
  "uploadedBy": "Taiolu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128840",
      "name": "Simple Sun Damage",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Simple Sun Damage-58550-0-1.zip",
      "uploadedUnix": "1411948461",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3c3781a8509691075905e2520c12a4f65f2d9d57676b5033a862c4eba894d50f/analysis/1411948561/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Sun%20Damage-58550-0-1.zip?fid=1000128840&ttl=1535845306&ri=8192&rs=8192&setec=3861bacd829629a009005b6f41f63214"
    }
  ]
}