{
  "modId": 58562.0,
  "modName": "Read Book Aloud FR",
  "summary": "Lecture des livres à haute voix + Pack de livres DLC Dawnguard",
  "descriptionHtml": "[center][size=6]Read Book a Loud FR&#33;[/size][/center]\r<br />[center]Vous trouverez néanmoins le mode équivalent Anglais ici / English mod here : \r<br />[url=http://www.nexusmods.com/skyrim/mods/46088/?] Original Mod [/url] \r<br />A big thank to sjors boomschors and Chesko&#33;[/center]\r<br />\r<br />\r<br />\r<br />Mod Lecture des livres à haute voix \r<br />+ Pack de livres DLC Dawnguard\r<br />+ Pack de livres DLC Heartfire\r<br />+ Pack de livres DLC Dragonborn disponible [url=http://www.nexusmods.com/skyrim/mods/58676/?] ICI [/url] \r<br />+ Pack de livres Vanilla disponible [url=http://www.nexusmods.com/skyrim/mods/59106/?] ICI [/url] \r<br />\r<br />\r<br />Pack de livres Vanilla en cours.\r<br />\r<br />\r<br />\r<br />Ca vous ennuie de lire mais vous adorez le lore de Skyrim? Et bien ce mod est fait pour vous, les livres vous seront lu à haute voix et en Français&#33;\r<br />\r<br />Merci de lire cette description, surtout, les F.A.Q et les notes, et de regarder la vidéo avant de poster une question.\r<br />\r<br />[color=#ffff00][size=5][u]Description/installation/Infos en Vidéo[/u][/size][/color]\r<br />\r<br />[center]\r<br />[youtube]yOko9umv7eY[/youtube][/center]\r<br />[color=#ffff00][size=5][u]Description[/u][/size][/color]\r<br />\r<br />Il ne s&#39;agit pas là d&#39;une traduction au sens stricte du terme, bien qu&#39;en comprenant des éléments tels que l&#39;interface, mais l&#39;utilisation d&#39;une ressource pour modeur afin de permettre la lecture des livres à haute voix.\r<br />Le travail de fourmi fait sur FCO et Vilja ne m&#39;à pas suffit, je suis donc repartit pour quelques mois afin de vous fournir ce mod, et ses packs parce que vous le valez bien (il faut m&#39;imaginer secouant la tête pour onduler les cheveux là, un effort&#33;)\r<br />\r<br />[u][b]J&#39;ajouterai tous les livres du jeu et des dlc au final mais histoire de vous en faire profiter le plus rapidement, voici les premiers, j&#39;uploaderais tout ça au fur et à mesure.[/b][/u]\r<br />[center][b]Et pour inaugurer cela, voici les Packs de livres de dawnguard et Heartfire&#33;[/b][/center]\r<br />\r<br />\r<br />A chaque nouveau pack, je mettrais un lien ici même et créerais une nouvelle page sur le nexus, comme un addon à ce mod histoire de permettre au plus de monde possible d&#39;être au courant de l&#39;existence du mod.\r<br />\r<br />\r<br />Pour chaque livre, il faut appliquer une procédure assez longue, cela demande un nombre d&#39;heures conséquent supérieur à ce que j&#39;ai pu faire sur FCO.\r<br />Les livres sont soit lu par un logiciel de synthèse vocale, soit par moi même.\r<br />Si vous voulez participer en lisant un livre, pas de soucis et je vous remercie d&#39;avance, vous serez bien sur crédité pour cela. Mais je tiens à garder un certain niveau de qualité donc vous devez:\r<br />-Posséder un équipement adéquat (pas capture de son avec une webcam ou un casque micro bon marché)\r<br />-Me contacter par MP sur le Nexus\r<br />\r<br />J&#39;ai déjà fait 20% du travail en préparant la structure, en traduisant tous les esp et le menu mcm. Reste donc à identifier chaque livre et à en faire la lecture via vrai voix ou synthèse vocale.\r<br />\r<br />Tous les livres ne sont pas supportés pour diverses raisons (les scriptes liés aux livres dans le jeu par exemple)\r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Pré requis[/u][/size][/color]\r<br />\r<br />-Skyrim 1.9.29.0.8+\r<br />-SKSE 1.7 \r<br />-Les Dlc 3 dlc\r<br />-L&#39;intégrale d&#39;Yvette Horner en CD\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Installation[/u][/size][/color]\r<br />\r<br />-Prenez le fichier Principal et Download with manager et activez&#33;\r<br />\r<br />Optionnel:\r<br />-Prenez le pack Dawngard et Download with manager et activez&#33;\r<br />-Prenez le pack Heartfire et Download with manager et activez&#33;\r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Notes [/u][/size][/color]\r<br />\r<br />-Parfois certains livres sont présent en version (par exemple) originales falmer et traduites du falmer, la version originale ne sera pas\r<br /> lue à haute voix (4 Livres)\r<br />-Certains livres ou notes ne fonctionneront pas à partir de votre inventaire (s&#39;ils sont liés à autre chose dans le jeu).  \r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]F.A.Q[/u][/size][/color]\r<br />\r<br />[u]J’ai bien installé le pack de livres mais tous les livres ne sont pas lus à haute voix [/u]\r<br />C’est parce que tous les livres ne sont pas supportés, de fait, j’ai fait bien plus de fichier audio et si je trouve un moyen de mettre à jour le mod de Chesko, plus de livres seront lus à haute voix car les fichiers sont présents. \r<br />\r<br />[u]Pour un livre donné, la lecture s’enclenche bien quand je lis le livre à partir d’une bibliothèque par exemple, mais pas à partir de mon inventaire.[/u]\r<br />C’est tout simplement un bug, une façon de le contourner (quand cela arrive) est d’activer la lecture après fermeture du livre dans le menu MCM, de lâcher le livre au sol, de cliquer dessus et une fois que la lecture se déclenche de le récupérer.\r<br />\r<br />[u]Je trouve la voix de la synthèse vocale trop artificielle.[/u]\r<br />Moi aussi, mais c’est mieux que rien. C’est encore pire en VO où TOUTES les lectures se font en synthèse vocale, en vf j’ai fait l’effort de lire moi-même un certain nombre de notes et de livres.\r<br />\r<br />[u]Es-ce que les chats, et pourquoi si l&#39;on considère l&#39;implication d&#39;Yvette Horner ?[/u]\r<br />Et bien je dirais que le travail de moding et de traduction rends fou mais j’en suis pas certain.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Autorisations[/u][/size][/color]\r<br />\r<br />Tous mes mods traduits sont traduits avec l’autorisation explicite de leur auteurs respectifs et à leur conditions (hébergement ect...)\r<br />Il est interdit d’héberger ma traduction ailleurs.  Dans le cas ou cette traduction ne serait plus à jour, libre à vous d’en refaire une autre mais il est interdit de prendre celle-ci comme base.\r<br />\r<br />\r<br />\r<br />[line]\r<br />\r<br />N&#39;oubliez pas de cliquer sur Endorse sur la page du mode original si vous aimez le mod et ici même pour la traduction.\r<br />Cela est un encouragement pour le modeur ainsi que pour moi même, m&#39;encourageant à effectuer plus de traduction.\r<br />\r<br />[color=#ffff00] [size=5]Bon Jeu&#33; [/size][/color]",
  "categoryId": "61",
  "version": "1.0",
  "author": "Chesko Sjors Boomschors et Floyd",
  "createdUnix": "1412086061",
  "updatedUnix": "1412066729",
  "containsAdultContent": false,
  "uploadedBy": "Floyd2099",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000128918",
      "name": "Read Book a Loud fr ",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "907",
      "fileName": "Read Book a Loud fr -58562-1-0.rar",
      "uploadedUnix": "1411997465",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f5e2eb8c209b5739c932881f3f0c1c2d77d69c483e649bd0fa935a4ac0e1b2ad/analysis/1411997583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Read%20Book%20a%20Loud%20fr%20-58562-1-0.rar?fid=1000128918&ttl=1535845331&ri=8192&rs=8192&setec=e9331415ef79673fcc6fe92cc9b1a2ab"
    },
    {
      "fileId": "1000128919",
      "name": "Read Book a Loud Pack de Livres audio Dawnguard",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "23643",
      "fileName": "Read Book a Loud Pack de Livres audio Dawnguard-58562-1-0.rar",
      "uploadedUnix": "1411997517",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/078d1f7c6e94b214503e8e324170727bc30d7372774284aafb576a52d6c7c46c/analysis/1411997592/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Read%20Book%20a%20Loud%20Pack%20de%20Livres%20audio%20Dawnguard-58562-1-0.rar?fid=1000128919&ttl=1535845331&ri=8192&rs=8192&setec=8c785354e504038c28b694a195b78c50"
    },
    {
      "fileId": "1000129064",
      "name": "Read Book a Loud Pack de Livres audio Heartfire",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7313",
      "fileName": "Read Book a Loud Pack de Livres audio Heartfire-58562-1-0.rar",
      "uploadedUnix": "1412066729",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c7a10db92b9b5a1a15f3254c2d386bd6cf7f025e16d657c65b385fe4865fde52/analysis/1412066826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Read%20Book%20a%20Loud%20Pack%20de%20Livres%20audio%20Heartfire-58562-1-0.rar?fid=1000129064&ttl=1535845332&ri=8192&rs=8192&setec=683b38158e9659e1ff2bbf45142e41a6"
    }
  ]
}