{
  "modId": 5857.0,
  "modName": "Another Nude Khajiit_Human Hybrid for CBBE v3 and CHSBHC",
  "summary": "This is my mod of Nalim666\\'s Nude Female Khajiit mod for CBBE 1.2 and CHSBHC models.  I loved Nalim666\\'s mod, but when CBBE 1.2 came out it had issues so I made my own version.",
  "descriptionHtml": "UPDATE: Added furry-butt version.  It\\'s just like the main file but the rear is left furry.  Added images for that too.\r\n\r\nUPDATE: Tweaks done to fix some minor issues and to make her more in line with what I liked best about Nalim666\\'s original.  More detail in comments.  ALL images now are of this latest update.\r\n\r\nUPDATE: So, CBBE version 3 broke my fix of Nalim666\\'s mod.  How complex can this get?  So I set about fixing the fix.  But instead I went a new route and used the same concept but with a different original Khajiit model - specifically the one in AnTiWoMaAgNoT\\'s texture pack.  So now I\\'ll end up with 2 files here.  The older, CBBE v2 compatible one, and the newer CBBE v3 compatible one.  Happily, both look fine with CHSBHC\\'s latest version (which is the body that the images of the new skin are actually from - I can\\'t leave that booty!)  Which now leaves me with 4 people to credit (not to mention those that THEY credit): AnTiWoMaAgNoT, Nalim666, Caliente and Cherry H.\r\n\r\nWhile I thought I\\'d like the original Khajiit texture better, I\\'m not sure I do in the long run.  But I\\'ll put up plenty of images so you can decide for yourself.  Even though I\\'m running with CHSBHC body, I still want to stay compatible with CBBE too - this this update.\r\n\r\nAlso, since AnTiWoMaAgNoT\\'s texture included hands and feet, mine does too - though I didn\\'t edit those...\r\n\r\nOLD VERSION:\r\nA revision of Nalim666\\'s EXCELLENT idea for a female nude khajiit.  I only modified it to work with CBBE 1.2 (and CHSBHC) and a few other tweaks that I personally liked.\r\n\r\n(Added some CBBE based images so there are some of both CBBE (SillyHuge) and some of CHSBHC)\r\n\r\nFirst the upsides: my mod works with both CBBE 1.2 and CHSBHC (which I\\'ve recently switched to for the Bouncing Boobies and the Even More Silly Hugeness.  So much that I actually am considering downsizing my kitty!)\r\n\r\nNow, the down.  First, I shaved her butt.  Sorry, but it just made sense to me and I like it.  There\\'s a noticable seam now - it might have been there before but hidden by the fur - but I don\\'t plan to do any more work on it as she\\'s ok for me with it.   Second, since switching to CHSBHC her tail now essentially grows out of her butt it appears when the slider is really cranked (like it is for my kitty.)\r\n\r\nFinally, her crotch is a mess.  Somewhere along the way, I obviously messed it up.  Fortunately for me, I don\\'t do much gynelogical exploring so I don\\'t mind.  But don\\'t expect I\\'ll fix it as my whole purpose was to make her to my liking and my skill level and this is the best I\\'m inspired to do.  Don\\'t bend her over if you don\\'t want to see the horror that bad-modding can cause!  ^_^",
  "categoryId": "29",
  "version": "3.1",
  "author": "bluedraggy",
  "createdUnix": "1326215761",
  "updatedUnix": "1328916808",
  "containsAdultContent": true,
  "uploadedBy": "bluedraggy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18593",
      "name": "Original file for CBBE v2 and CHSBHC",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3277",
      "fileName": "Original file for CBBE v2 and CHSBHC-5857.zip",
      "uploadedUnix": "1326218297",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/65f1bb3ecd92236de08dc297e9182f6d55a99511a0f5f91d425b9643cedb081a/analysis/1406600346/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Original%20file%20for%20CBBE%20v2%20and%20CHSBHC-5857.zip?fid=18593&ttl=1535762900&ri=8192&rs=8192&setec=f0384dd356889b87c2ffe690f3226b16"
    },
    {
      "fileId": "26057",
      "name": "Update for CBBE v3 and tweaked a bit more",
      "version": "3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11909",
      "fileName": "Update for CBBE v3 and tweaked a bit more-5857-3-1.zip",
      "uploadedUnix": "1328423699",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/7fdaa2191a1c3335b958f4d9148e2531d8352f4498482f04adf8a260255dae30/analysis/1406654686/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20for%20CBBE%20v3%20and%20tweaked%20a%20bit%20more-5857-3-1.zip?fid=26057&ttl=1535762900&ri=8192&rs=8192&setec=19cde9237d0f530f87d51592f0929311"
    },
    {
      "fileId": "28636",
      "name": "Furry Butt version",
      "version": "3.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12303",
      "fileName": "Furry Butt version-5857-3-0.zip",
      "uploadedUnix": "1328916808",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/3f48b21c5ba3bf5f7468753d19109f82713c51d440cdf1e33a5a90ccbd7489c2/analysis/1406668189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Furry%20Butt%20version-5857-3-0.zip?fid=28636&ttl=1535762901&ri=8192&rs=8192&setec=9a666702b39940e34286ff6f41bcbf4a"
    }
  ]
}