{
  "modId": 58584.0,
  "modName": "Palace Residence",
  "summary": "This is my first mod, it&#39;s a beautiful mansion-like player home. It contains all crafting stations, kitchen, dining room, children&#39;s room, steward/housecarl&#39;s room and a master bedroom for the dragonborn and their spouse&#33; ",
  "descriptionHtml": "-UPDATE; New version of house with 2 more beds for children and a room (next to the stewards) for a couple of followers.\r<br />[b]--- I have fixed various holes in the walls and the blockage to the kitchen- please download the lastest file again&#33; I&#39;m so sorry for all of these bugs but most of them should be out of the way now, there is a missing texture that my friend is helping me look into. [/b]\r<br />\r<br />Hi guys&#33; Thank you for taking a look at and hopefully downloading and enjoying my first mod&#33; \r<br />\r<br />This is a beautiful, mansion-like player home. I used the Blue Palace because I thought it was beautiful. I cut out a few things and put in some new things, this house includes a navmesh which means that anyone you bring to the home WILL enter and walk around freely. \r<br />\r<br />[b][size=3]Before I say anything else I would like to make sure you all understand that this mod does have some minimal requirements. [/size][u][size=5]This mod requires the Skyrim Update.esm and it requires the Hearthfire DLC[/size][/u][size=3]. [/size]\r<br />\r<br />[size=3]WitchRiser also made an amazing mod called &#39;Custom Family Home&#39;. It allows you to move your entire family (children, spouse, steward and even your bard) to a new home via casting a spell. If you would like to use this for my home or any other custom home for that matter please download it here&#33; http://www.nexusmods.com/skyrim/mods/47621/?[/size][/b]\r<br />\r<br />Palace Residence contains a beautiful master bedroom for the dragonborn and their spouse, this room also has an onsuite bathroom. Down the hall is the children&#39;s room which has 2 beds and 2 chests for those little cuties to use. In the middle of the house we have a beautiful dining room for you and your family.  This is on the &#39;left wing&#39; of the house. On the right wing of the house you have a room for your Steward/housecarl and a kitchen that contains some harvestable meat and herbs&#33; This house has a basement, what&#39;s in the basement? Why- a daedric worshipper&#39;s drea- [b]I&#39;m just kidding&#33; [/b] It contains every crafting station you need as well as [b]LOTS OF STORAGE.[/b] I have lots of pictures for you to see as well&#33; \r<br />\r<br />If you love the mod please let me know and please endorse&#33; I will make more mods- I&#39;m still learning. It took 2 weeks to finish this house and I&#39;m so excited to release it and to show you all the photos of the house too&#33; ",
  "categoryId": "67",
  "version": "",
  "author": "Rachel Turner",
  "createdUnix": "1412055820",
  "updatedUnix": "1412340484",
  "containsAdultContent": false,
  "uploadedBy": "Novafoxay",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000129043",
      "name": "PalaceResidence",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92",
      "fileName": "PalaceResidence-58584-1.rar",
      "uploadedUnix": "1412055814",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/7131889c3495d261fce47fcd40258830a33537bfed3c853cebc00dff65d7f5af/analysis/1412055902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PalaceResidence-58584-1.rar?fid=1000129043&ttl=1535845365&ri=8192&rs=8192&setec=e4246e1863f01ce864d32055a8ecd173"
    },
    {
      "fileId": "1000129437",
      "name": "PalaceResidenceV1.2.1",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "96",
      "fileName": "PalaceResidenceV1.2.1-58584-.rar",
      "uploadedUnix": "1412340484",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/280d7542aa1ff47a83bbcc26ce182bf2ee07f4ef49cfe9144941207d49887266/analysis/1412340602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PalaceResidenceV1.2.1-58584-.rar?fid=1000129437&ttl=1535845365&ri=8192&rs=8192&setec=34152629f072eb088ac0b2ceaa3eeb33"
    }
  ]
}