{
  "modId": 58620.0,
  "modName": "Aetherius Magic - The Ancient Sanctuary of the Deceived",
  "summary": "::::Epic Spell Package:::: \r<br />Aetherius Magic takes the Dragonborn on an adventure to unravel the mysteries of Aetherius; the immortal plane where all magic derives. This Mod is unfinished; however, the content that is given here is worth your time. I&#39;ve had people leave comments saying that it was one of the best mods they ever played, but",
  "descriptionHtml": "[youtube]ujQYg-hlKRs[/youtube][youtube]G9ebPvhKfI8[/youtube][youtube]bS2vWEPr-gs[/youtube]\r<br />\r<br />[size=6]::::Epic Sell Package::::    (REQUIRES DAWNGUARD DLC&#33;)[/size]\r<br />[size=3]Aetherius Magic is a passion project of mine filled with exciting new spells you can&#39;t find anywhere else. The Lore of the Elder Scrolls is rich with fantastic stories illuminating to the mind pulling players deep into a world not their own. By using the existing lore I have created an immersive experience for the becoming mage set to transform into the most powerful magic wielder in all of Mundas. Aetherius Magic is the first installment to a hopeful series of mods that takes the Dragonborn on an adventure to unravel the mysteries of Aetherius, the immortal plane where all magic derives. For example, Sovngarde would be a plane of Aetherius. This Mod of mine is unfinished; however, the content that is given here is worth your time if you love a good story and fun spells to go with it. I&#39;ve had people leave comments saying that it was one of the best mods they ever played, but also some hard critics that said I left much to be desired. With Skyrim SE out it has given me a new drive to finish what I started all those years ago. I plan on finishing this mod once and for all, but the quest as it is now stops once it tells you to find a book in Aetherius, all spoilers put aside, that is all I can say. \r<br />[/size]\r<br />[size=6]::::Mod Features:::: [/size]\r<br />[size=3]*Quest that starts after you become the Archmage \r<br />*69 quality spells and growing as I develop more content to this mod \r<br />*Great story and lore that most Elder Scrolls Fans will appreciate \r<br />*Fully Voiced NPC that you encounter \r<br />*Great Treasure to be found as well as fantastic spells \r<br />*Improvements to reward items gained through college of Winterhold quests \r<br />*Early Spells you gain while you play through the College of Winterhold quest line. (You still get these spells if you already became the Arch-Mage.)\r<br />*Improvements to create Epic Boss Fights with the three bosses you face in the college of Winterhold Main Quest\r<br />*Fixed Dragon Priest Mist Bug (If you don’t know what this is don’t worry about it)\r<br />*Master level destruction spells (Lightning Storm) can now be used in combination with other spells while in the left hand (But can still be used with both hands) \r<br />*One Massive interior Cell Full of Epic Fights which is the Ancient Sanctuary of the Deceived. (No loading screens once you enter through the front door) (Warning&#33;&#33;&#33; This dungeon can be extremely difficult&#33; Enter at your own risk&#33;)\r<br />*A New Animation for concentration spells. (Tap the attack button then press and hold for a new animation with any concentration spell added by Aetherius Magic)\r<br />*Dark Magic spells that once learned can be used in Vampire Lord Form (Oblivion Spells)\r<br />*A Lightning area of effect spell that only harms established enemies engaged in combat (Shalidor&#39;s Sparks) Friendly NPCs can be hit but not harmed or aggravated into an enemy. It’s great in open battles where it’s hard to not hit your friends.\r<br />[/size]\r<br />[size=6]::::How to start Your Quest:::: [/size]\r<br />[size=3]When you become the Arch-Mage of the College of Winterhold use the Arch-Mage’s Quarters Key to unlock the Arch-Mage’s safe near the bed to begin your quest. Read the Journal and the quest will begin. There is a lot of reading involved but worth it in the end if you like Elder Scrolls Lore. The videos cover this information better but if you would rather read it than keep reading. You will find a journal and a long book filled with story and lore. You will need to read both of them. Like actually read the content. It is written very well and the chances of you getting bored reading it are kind of slim. I&#39;m just too good of a writer for that. :) You will then be told to find some letters hidden in the Arcanium which is basically the college’s library. Look in one of the book cases or in a strong box on the floor and you&#39;ll see two letters written to Astroxies and then things will progress from there once you use the spell that teleports you to the Ancient Sanctuary. Watch the videos if you are still lost as to what you need to do. Remember that you need to finish the College of Winterhold&#39;s main quest to obtain the key needed to open the safe that has what you need to begin your epic journey to unraveling the mysteries of Aetherius. \r<br />[/size]\r<br />[size=6]::::The Spells:::: [/size]\r<br />[size=3]There are 69 spells that are available to obtain through a story driven way as well as 2 powers. The list is organized in Alphabetical Order and will continue to be updated. \r<br />\r<br />Dark Sorcery: Crux of Agony……………………………..……Learned From Aetherius Magic Book\r<br />Dark Sorcery: Crux of Death……………………………..……Learned From Aetherius Magic Book\r<br />Dark Sorcery: Crux of Will……………………………..……….Learned From Aetherius Magic Book\r<br />Dawn of Inferno……………………………..……………………..Learned From Secret Spell Tome in Dungeon\r<br />Dawn of Thunder.…………………………..……………………..Learned From Secret Spell Tome in Dungeon\r<br />Dawn of Winter….…………………………..……………………..Learned From Secret Spell Tome in Dungeon\r<br />Fire Polarity……………………………..…………………………….Learned From A letter to Astroxies or found early on\r<br />Frost Polarity……………………………..…………………………..Learned From A letter to Astroxies or found early on\r<br />Infinite Sorcery: Blizzard……………………………..………….Learned From Aetherius Magic Book\r<br />Infinite Sorcery: Call of Aetherius………………………..….Learned From Aetherius Magic Book\r<br />Infinite Sorcery: Divine Blink………………………..………….Learned From Aetherius Magic Book\r<br />Infinite Sorcery: Fire Storm………………………..………..….Learned From Aetherius Magic Book\r<br />Infinite Sorcery: Spirit of Magnus…………………………….Learned From Aetherius Magic Book\r<br />Infinite Sorcery: Storm of Aetherius………………..……….Learned From Aetherius Magic Book\r<br />Lightning Polarity…..…………………………………………….….Learned From A letter to Astroxies or found early on\r<br />Oblivion: Echo of the Void………………………………………..Learned from Spell Tome in Dungeon\r<br />Oblivion: Ether of the Void………………………………………..Learned from Spell Tome in Dungeon \r<br />Oblivion: Fury of the Void………………………………………...Learned from Spell Tome in Dungeon \r<br />Oblivion: Ghost of the Void……………………………..………..Learned from Spell Tome in Dungeon \r<br />Oblivion: Healing of the Void……………………………………..Learned from Spell Tome in Dungeon \r<br />Oblivion: Madness of the Void (Power) ………..…………..Learned from Spell Tome in Dungeon\r<br />Oblivion: Paralysis of the Void………………………….………..Learned from Spell Tome in Dungeon\r<br />Oblivion: Peace of the Void………………………………………..Learned from Spell Tome in Dungeon\r<br />Oblivion: Phantom of the Void…………………………………..Learned from Spell Tome in Dungeon\r<br />Oblivion: Ward of the Void………………………………….…..Learned from Spell Tome in Dungeon\r<br />Phenomenon……………………………..…………………….……..Learned From A letter to Astroxies or found early on \r<br />Rise of Magic……………………………..………………….………..Learned From A letter to Astroxies or found early on \r<br />Shalidor&#39;s Dispel ……………………………..……………….……..Learned From A letter to Astroxies or found early on\r<br />Shalidor&#39;s Flames……………………………….………….………..Learned From A letter to Astroxies or found early on \r<br />Shalidor&#39;s Frostbite……………………………..……….….……..Learned From A letter to Astroxies or found early on \r<br />Shalidor&#39;s Insights: Alteration…………….……….…..……..Learned From A letter to Astroxies or found early on\r<br />Shalidor&#39;s Insights: Conjuration….…………………………..Learned From A letter to Astroxies or found early on\r<br />Shalidor&#39;s Insights: Destruction……….……………….……..Learned From A letter to Astroxies or found early on\r<br />Shalidor&#39;s Insights: Illusion………………………………….…..Learned From A letter to Astroxies or found early on\r<br />Shalidor&#39;s Insights: Magicka………………………….………..Learned From A letter to Astroxies or found early on\r<br />Shalidor&#39;s Insights: Restoration....…………………………..Learned From A letter to Astroxies or found early on\r<br />Shalidor&#39;s Sparks……………………………..……….……………..Learned From A letter to Astroxies or found early on\r<br />Sorcery: Aetherius Battle Lord………………………..……….Learned From Aetherius Magic Book\r<br />Sorcery: Aetherius Vortex………………………..………..…….Learned From Aetherius Magic Book\r<br />Sorcery: Flames of Ruin………………………………..………….Learned From Aetherius Magic Book\r<br />Sorcery: Immortal Power………………………..……..……….Learned From Aetherius Magic Book\r<br />Sorcery: Light of Magnus……………………………..………….Learned From Aetherius Magic Book\r<br />Sorcery: Rage of Magnus………………………..……………….Learned From Aetherius Magic Book\r<br />Sorcery: Relentless Shock…………………………….………….Learned From Aetherius Magic Book\r<br />Sorcery: Relentless Storm………………………..…….……….Learned From Aetherius Magic Book\r<br />Sorcery: Splendor of Magnus……………………...………….Learned From Aetherius Magic Book\r<br />Sorcery: Unremitting Gleam………………………..………….Learned From Aetherius Magic Book\r<br />Sorcery: Vex of Winter………………………..……………….….Learned From Aetherius Magic Book\r<br />Sorcery: Vex of Fire……………………………………...………….Learned From Aetherius Magic Book\r<br />Sorcery: Ward of Magnus………………………..…..………….Learned From Aetherius Magic Book\r<br />Sorcery: Waves of Aetherius………………………..………….Learned From Aetherius Magic Book\r<br />Spirit of Magnus (Power) ………………………..…………..….Learned From Aetherius Magic Book\r<br />Summon Dremora Spirit: Fire....………………….…………..Learned From A letter to Astroxies or found early on\r<br />Summon Dremora Spirit: Frost....…………………..………..Learned From A letter to Astroxies or found early on\r<br />Summon Dremora Spirit: Lighting....………………………..Learned From A letter to Astroxies or found early on\r<br />Teleport: Ancient Sanctuary....…………………………….…..Learned From A letter to Astroxies\r<br />Teleport: Boethiah&#39;s Sanctuary……………….………………..Learned from Spell Tome in Dungeon\r<br />Teleport: Mage&#39;s Haven………………………………..………….Learned From Aetherius Magic Book\r<br />Teleport: Zurin&#39;s Sanctuary…………………………...………….Learned From Aetherius Magic Book\r<br />Zurin&#39;s Apex Ward....…………………………………………….…..Learned From A letter to Astroxies\r<br />Zurin&#39;s Blink....……………………………………………………..…..Learned From A letter to Astroxies\r<br />Zurin&#39;s Candlelight....………………………………………………..Learned From A letter to Astroxies\r<br />Zurin&#39;s Exertion....………………………………………..…………..Learned From A letter to Astroxies\r<br />Zurin&#39;s Fury....…………………………………………………………..Learned From A letter to Astroxies\r<br />Zurin&#39;s Healing Ward....………………………………….………..Learned From A letter to Astroxies\r<br />Zurin&#39;s Magelight....………………………………………….……..Learned From A letter to Astroxies\r<br />Zurin&#39;s Vigorous Flames....……………………………….……..Learned From A letter to Astroxies\r<br />Zurin&#39;s Vigorous Frostbite....…………………………….……..Learned From A letter to Astroxies\r<br />Zurin&#39;s Vigorous Sparks....…………………………………..…..Learned From A letter to Astroxies[/size]\r<br />\r<br />[size=6]::::Updates:::: [/size]\r<br />[size=3]*More compatible with Magical College of Winterhold & Immersive College of Winterhold.\r<br />*Should no longer crash when entering Breezhome.\r<br />*Removed the floating ruin near Whiterun Watchtower. (I don’t know where that came from)\r<br />[/size]\r<br />[size=6]::::My Favorite Comments & Messages::::[/size]\r<br />[size=3]“This is a FANTASTIC mod that brings a wholesome, complete compilation of lore to the surface that has never existed up to this point. To every magic lover reading this who hasn&#39;t already subscribed (and has dawnguard): you absolutely, positively need this mod. The first installment already feels like a DLC, makes you feel like a god and if you find yourself thinking &#34;this is OP&#34;, you don&#39;t need to use the spells all the time, but the lore brought to the table alone is enough to give anyone, even a magical elder scrolls veteran like me, a new appreciation of both sorcery and its god. Advocus, I really wish I knew how to do things like this because I&#39;d help your cause in a heartbeat; the complete saga really needs to be available to everyone. One final time, get the mod. It&#39;s very well worth it.” (By: musicman716) \r<br />\r<br />“I&#39;ve been waiting for this to finally be done. I am glad to see that a person finally makes a mod that is lore friendly and is based off the most important part of any mage player. It truly makes me feel like my character is learning the magic of Aetherius. Very good job&#33;&#33;” (By: Silas_Cole) \r<br />“Something I did forget to mention is that this mod feels as if it’s a DLC rather than just a mod. Again, VERY WELL DONE&#33;&#33;&#33;” (By: Silas_Cole) \r<br />\r<br />“In all honesty I’ve never had so much fun. You made the mod right at every corner. That last book is so hard to find and in the end I would rather read through books and look for clues then have it handed to me with a quest marker. 3 amazing parts of this mod \r<br />-First entering the room with large elementals, I haven’t been punished for sloppy play this much since Dark Souls. What an epic battle that area provided \r<br />-fighting ishborn was a 10 minute struggle of epic proportions. To put it into perspective about 4 minutes into the 1v1 i had to alt tab to put on some AOT OST for the right mood \r<br />-lastly finding the 3 dawn spells. Very Very satisfying. Thank you for the experience” (By: cloud.74)\r<br />\r<br />“I would really really love to see the mod`s next episodes&#33; This mod is the best one I have ever installed, even after over 1000 hours of gameplay I still enjoy Aetherius Magic as it stays interesting and it makes me feel powerful like a true God. I like fantasy and story making myself and I really enjoy using this mod because it gives so much lore to think about&#33;&#33; Sky above, voice within. :)” (By: Darth Bumaex)\r<br />\r<br />“Advocus I think your mod&#39;s freaking amazing, it is vary mysterious and intense. It’s one of a kind and people who don’t appreciate people who make mods for US so we can play them can just go try and make them themselves.” (By: GassyAntelope)\r<br />\r<br />“This is one of the best mods I&#39;ve ever seen. The story is great, the voice acting is great, the spells are great, everything is great&#33; This mod deserves many, many more endorsements.” (By: TheEbonslayer)\r<br />\r<br />“Advocus - many congratulations on your mod - the amount of time and effort put in is definitely apparent. You&#39;re clearly very talented and I think the most impressive part is the voice acting which is in my opinion one of the most challenging aspects to get right.” (By: bell88)\r<br />\r<br />“This is truly a beautifully executed mod. The spells feel epic without being overpowered and still fit into the lore perfectly. The quests subtly integrate and flow seamlessly into the vanilla game without being obtrusive or feeling &#34;forced&#34;. I really feel like this is something that should have been part of the vanilla game from day one.” (By: Ikarisan)\r<br />\r<br />“From what I see in the trailer, it looks like you could just walk up to Bethesda Studios and show them this mod and it would be made a DLC very fast.” (By: Alexcbrazill)\r<br />\r<br />“Woah, that voice from Pultar... Now that was damned haunting. Love the echoes and reverberation going on Advocus. I started this mod over from the beginning. As I was progressing through the sanctuary, I felt like I was going through a series of trials to advance my magic. Hope that&#39;s what you were going for cause that&#39;s the impression I got. Can&#39;t wait for the next update.” (By: chrishpz)\r<br />\r<br />“Hello Advocus, I am here; contacting you because of the beautiful mod you made &#34;Aetherius Magic&#34;. Words will never begin to describe how I feel about this mod, just know that it is the best mod I&#39;ve ever played and ever will play. I have one question for you: is this mod dead? I sincerely hope that this mod is not dead but I have read the comments on the page and I know that you have some difficulty with the Creation Kit. I&#39;m wondering if you are making any progress with the second installment or have any plans for it in the future.” (By: TheEbonslayer)[/size]",
  "categoryId": "75",
  "version": "2.2",
  "author": "Advocus",
  "createdUnix": "1412207761",
  "updatedUnix": "1478754474",
  "containsAdultContent": false,
  "uploadedBy": "Advocus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000227588",
      "name": "Aetherius Magic",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "191387",
      "fileName": "Aetherius Magic-58620-2-2.zip",
      "uploadedUnix": "1478754474",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/4760ad05fb7882f695140cdcbca2a1e8097b25399d483c69aca72d65b1f232e1/analysis/1478765427/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherius%20Magic-58620-2-2.zip?fid=1000227588&ttl=1535845418&ri=8192&rs=8192&setec=5f10b3e564bf6019a4c1f194f8c87b30"
    }
  ]
}