{
  "modId": 58640.0,
  "modName": "Loki Lafeyson - Voiced Follower (WIP)",
  "summary": "Adds a voiced follower highly based on Loki from the Thor/Avengers movies.",
  "descriptionHtml": "[center][b][/b][i]NOTE: I am no longer responsible for any issues with this mod, I don't play or mod Skyrim anymore, so please refrain from contacting me if you're having issues with this mod, there are forums for that. And for goodness' sake, do not re-upload this mod to the Steam Workshop or anywhere else without my given permission. Thank you for taking your time reading this.[/i][b]\n<br />\n<br />~Backstory~\n<br />[/b][i]Long before Thor's exile to Midgard, his mischievous brother Loki had secretly discovered a new world. Nirn that is. Hungry for power, Loki snuck past Heimdall's gate and teleported himself to Tamriel in hopes of eventually taking over this new realm. What he didn't know was that his meeting with the Dovahkiin would change his life forever...\n<br />\n<br />[/i][b]~Mod description~\n<br />[/b]This mod adds Loki as a follower to Skyrim, highly based on the movies [i]Thor 1 and 2/The Avengers[/i] by Marvel Studios. I know there are at least 4 other mods that already adds him as a NPC, but none of them looked very close to Tom Hiddleston, which is what I was trying to achieve here. Anyway, this Loki NPC I have created, he is voiced by the talented Nik Zutshi, who can imitate a variety of celebrity voices. You may want to check out his [url=https://www.youtube.com/user/nikhilchampion]YouTube channel[/url].\n<br />\n<br />[b]~Where to find Loki~\n<br />[/b]He can be found in Windhelm, fighting four strong Stormcloak soldiers which are all factionless. When not in combat, he will stand around leaned against a wall most of the time.\n<br />\n<br />[b]~Features~\n<br />[/b]-He uses his own set of facial textures, including eyebrows.\n<br />He is protected, meaning that only the player can kill him. If you want him to be fully unkillable (which also should make sense in some cases), bring up the console and type \"setessential xx000d62 1\" without quotes. \n<br />   xx = number of the plugins load order.\n<br />-He levels with the player, from level 30 up to 200.-He's slightly overpowered for a reason; he's a demi-god. I recommend recruiting him at higher levels if you don't want him to take out your enemies before you even get the chance to strike.\n<br />-He has his own, unique equipment which are basically retextured vanilla armor pieces. Can be either looted off his corpse or crafted.\n<br />-His combat skills are focused on magic, so his main offenses are focused on destruction (frost) and illusion magic.\n<br />-He will wield his unplayable but quite overpowered scepter in battle. It has a strong shock-enchantment, which is guaranteed to paralyze it's victims.\n<br />-At the start of combat, he will conjure up a clone of himself. The clone is notably weaker than him but also leveled. This spell can be taught from a spelltome that you can loot from Loki if you ever decide to kill him. There might as well be a chance that he will gift the spelltome to you, not sure. Note; Loki's clone uses the Argonian voicetype.\n<br />-He has the Light Feet-perk so he won't trigger pressure plates.\n<br />-He will gladly commit crimes for the player, unless it involves looting containers, picking up objects above him or attacking your housecarl.\n<br />-Optional files that give Loki his Jötunn appearance. He will also adapt to any body replacer, as he only uses separate specular(shine) maps for the hands and body. (Not included in new version)\n<br />\n<br />-This mod doesn't contain quests of any kind, as I cannot write scripts to save my life.\n<br />\n<br />[b]~Requirements~\n<br />[/b]-The latest version of Skyrim.\n<br />-[url=http://www.nexusmods.com/skyrim/mods/10168/?]ApachiiHairMales[/url]\n<br />\n<br />[b]~Installation~\n<br />[/b]-Manually drag the Data folder(s) from the archive to your Skyrim folder via WinRar. Click yes if it asks to overwrite.\n<br />-Activate the plugin in the Skyrim launcher/Wrye Bash/Nexus Mod Manager.[b]\n<br />\n<br />~Recommended mods~\n<br />[/b](For cosmetic purposes)[url=http://www.nexusmods.com/skyrim/mods/498]\n<br />[/url]-[url=http://www.nexusmods.com/skyrim/mods/54416]Eye Normalmap Fix\n<br />[/url]\n<br />[b]~Known issues/bugs~[/b]\n<br />-The armor doesn't fully support females, as they will look exactly like the Nightingale armor. Since the male and female versions of said armor uses different UV-maps, I didn't feel like trying to retexture the female armor texture. This was also to make it compatible with as much body mods as possible.\n<br />-If you load a save inside Windhelm, the four soldiers won't pick a fight with Loki, only stand around in the same spot. If you want them wiped out, you can always ask him to kill them one by one without receiving a bounty on your head.\n<br />-Loki's Ice Storm-spell might aggravate some friendly NPC's, including his clone.\n<br />-He will have a hard time taking out the four Stormcloak soldiers at low levels without falling into bleedout state.\n<br />-At some point of the day, Loki may be seen walking around in circles or \"moonwalking\". As if he can't decide if he should continue to lean against the wall. It's probably due to the lack of multiple AI packages I gave him.\n<br />-If you have the Jotun version of this mod installed, and should you decide to turn Loki into a werewolf/vampire lord (with the help of third-party mods such as Moonlight Tales or Amazing Follower Tweaks), he might become invisible after transforming. That's because he uses his own \"naked armor\" for the Jötunn specular-maps to apply and I didn't make the beast ARMA compatible.\n<br />-There may still be voice lines missing, and I don't have much contact with Nik nowadays.\n<br />-Several voice files may have too low volume. I recommend decreasing the music/sound effect sliders ingame.\n<br />\n<br />[b]~Future plans~[/b]\n<br />-If someone ever makes meshes that looks closer to Loki's \"Avengers\" -gear, I'm going to replace the current meshes and give credit.\n<br />\n<br />[b]~Credits/Thanks~\n<br />[/b]-[url=http://www.nexusmods.com/skyrim/users/1871159]MikoYork[/url], [url=http://www.nexusmods.com/skyrim/users/722523]Limbek[/url] and [url=http://www.nexusmods.com/skyrim/users/4184206]Urshi[/url] for the facial textures which I combined.\n<br />-[url=http://www.nexusmods.com/skyrim/users/5547043]Haxxzor1[/url] for the Scepter mesh.\n<br />-[url=http://www.nexusmods.com/skyrim/users/283148]Apachii[/url] for the hair mesh and textures.\n<br />-[url=http://www.nexusmods.com/skyrim/users/4042551]KahjiitRaj[/url] for the Review Studio mod I used in some of the screenshots.\n<br />-And at last, thank you so much Nik for helping me out with the voice acting! Without you, I wouldn't have been able to bring this character to life the same way in Skyrim.\n<br />\n<br />I hope the rest of you Loki-fanatics enjoy this mod, and don't forget to endorse if you liked it! It motivates me to keep modding &lt;3\n<br />\n<br />Regards, Eri\n<br />\n<br />\n<br />Another note: I hardly mod or play Skyrim at all nowadays because I have a crappy computer. So anyone is free to continue working on this mod as long as you credit me.[/center]",
  "categoryId": "66",
  "version": "0.9",
  "author": "T3alrose",
  "createdUnix": "1412216675",
  "updatedUnix": "1426166596",
  "containsAdultContent": false,
  "uploadedBy": "T3alrose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000129244",
      "name": "Loki Follower by Eri",
      "version": "0.8b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "39921",
      "fileName": "Loki Follower by Eri-58640-0-8b.rar",
      "uploadedUnix": "1412214860",
      "modVersion": "0.8b",
      "virusScanUrl": "https://www.virustotal.com/file/0c200627353639b8e8d2de4ed9b73410e0a8deaf1217cca3d902e36e21f8da3d/analysis/1412214969/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loki%20Follower%20by%20Eri-58640-0-8b.rar?fid=1000129244&ttl=1535845440&ri=8192&rs=8192&setec=2372011cade3704d55cdf8585cf8bc31"
    },
    {
      "fileId": "1000151153",
      "name": "Loki Follower",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36010",
      "fileName": "Loki Follower-58640-0-9.rar",
      "uploadedUnix": "1426166596",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/0e7ac3ccd94695ace07e67af63f26fa51469c2d16545cfe926edaf2fd0b833c9/analysis/1426166649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Loki%20Follower-58640-0-9.rar?fid=1000151153&ttl=1535845441&ri=8192&rs=8192&setec=d7e2a480ab48404d3158ea1302ed196f"
    }
  ]
}