{
  "modId": 58676.0,
  "modName": "Dragonborn pack pour Read Book aLoud FR",
  "summary": "147 livres lus à haute voix ajoutés",
  "descriptionHtml": "[center][size=6]Dragonborn Books: Read Book aLoud FR[/size][/center]\r<br />\r<br />[center]Vous trouverez le mode équivalent Anglais ici / English mod here : \r<br />[url=http://www.nexusmods.com/skyrim/mods/46088/?] Original Mod [/url] \r<br />A big thank to sjors boomschors and Chesko&#33;[/center]\r<br />\r<br />\r<br />Pack de livres DLC Dragonborn (147 livres&#33;) dont la lecture vous sera faite à haute voix.\r<br />\r<br />Pour ce pack j&#39;ai varié les plaisirs en utilisant diverses voix de synthèses vocales ainsi que ma propre voix.\r<br />\r<br />Ça vous ennuie de lire mais vous adorez le lore de Skyrim? Et bien ce mod est fait pour vous, les livres vous seront lu à haute voix et en Français&#33;\r<br />\r<br />Merci de lire cette description, surtout, les F.A.Q et les notes, et de regarder la vidéo avant de poster une question.\r<br />\r<br />\r<br />\r<br />[center]NECESSITE LE MOD ORIGINAL READ BOOK ALOUD FR DISPONIBLE ICI:\r<br />[url=http://www.nexusmods.com/skyrim/mods/58562/?] Mod Principal [/url] [/center]\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Description/installation/Infos en Vidéo[/u][/size][/color]\r<br />[center]\r<br />\r<br />[youtube]yOko9umv7eY[/youtube][/center]\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Pré requis[/u][/size][/color]\r<br />-Skyrim 1.9.29.0.8+\r<br />-SKSE 1.7 \r<br />-Dragonborn\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Installation[/u][/size][/color]\r<br />-Allez sur la page principale du mod [url=http://www.nexusmods.com/skyrim/mods/58562/?] Mod Principal [/url] \r<br />-Allez dans Fichier\r<br />-Prenez le fichier Principal et Download with manager et activez&#33;\r<br />\r<br />Optionnel:\r<br />-Prenez le pack Dawngard et Download with manager et activez&#33;\r<br />-Prenez le pack Heartfire et Download with manager et activez&#33;\r<br />\r<br />Ensuite faites download with manager avec le pack Dragonborn ici même et activez&#33;\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]F.A.Q[/u][/size][/color][u]\r<br />[b]J’ai bien installé le pack de livres mais tous les livres ne sont pas lus à haute voix [/b][/u]\r<br />C’est parce que tous les livres ne sont pas supportés, de fait, j’ai fait bien plus de fichier audio et si je trouve un moyen de mettre à jour le mod de Chesko, plus de livres seront lus à haute voix car les fichiers sont présents. \r<br />\r<br />[u][b]Pour un livre donné, la lecture s’enclenche bien quand je lis le livre à partir d’une bibliothèque par exemple, mais pas à partir de mon inventaire.[/b][/u]\r<br />C’est tout simplement un bug, une façon de le contourner (quand cela arrive) est d’activer la lecture après fermeture du livre dans le menu MCM, de lâcher le livre au sol, de cliquer dessus et une fois que la lecture se déclenche de le récupérer.\r<br />\r<br />[u][b]Je trouve la voix de la synthèse vocale trop artificielle.[/b][/u]\r<br />Moi aussi, mais c’est mieux que rien. C’est encore pire en VO où TOUTES les lectures se font en synthèse vocale, en vf j’ai fait l’effort de lire moi-même un certain nombre de notes et de livres.\r<br />\r<br />[u][b]Pourquoi ne pas avoir mis le pack sur la même page que le mod ?[/b][/u]\r<br />Pour remettre le mod en avant sur le nexus et car le travail pour chaque pack est supérieur au travail de traduction d’un mod.\r<br />\r<br />[color=#ffff00][size=5][u]Autorisations[/u][/size][/color]\r<br />Tous mes mods traduits sont traduits avec l’autorisation explicite de leur auteurs respectifs et à leur conditions (hébergement ect...)\r<br />Il est interdit d’héberger ma traduction ailleurs.  Dans le cas ou cette traduction ne serait plus à jour, libre à vous d’en refaire une autre mais il est interdit de prendre celle-ci comme base.\r<br />\r<br />\r<br />[line]\r<br />\r<br />N&#39;oubliez pas de cliquer sur Endorse sur la page du mode original si vous aimez le mod et ici même pour la traduction.\r<br />Cela est un encouragement pour le modeur ainsi que pour moi même, m&#39;encourageant à effectuer plus de traduction.\r<br />\r<br />[color=#ffff00] [size=5]Bon Jeu&#33; [/size][/color]",
  "categoryId": "61",
  "version": "1.0",
  "author": "Chesko Sjors Boomschors et Floyd",
  "createdUnix": "1412494334",
  "updatedUnix": "1412323299",
  "containsAdultContent": false,
  "uploadedBy": "Floyd2099",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000129416",
      "name": "Readbook Aloud Dragonborn Pack fr",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "108502",
      "fileName": "Readbook Aloud Dragonborn Pack fr-58676-1-0.rar",
      "uploadedUnix": "1412323299",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c14a9ac793f93c3eb42d481721508ed5e9a10045b8d67ed35f9b6dbf382c9a5f/analysis/1412323398/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readbook%20Aloud%20Dragonborn%20Pack%20fr-58676-1-0.rar?fid=1000129416&ttl=1535845495&ri=8192&rs=8192&setec=fa82b7f43d6751465746d80094ebbb5e"
    }
  ]
}