{
  "modId": 58686.0,
  "modName": "Skyrim Quick Start Saves",
  "summary": "Even though there are more than a few of these floating around out there I figured I&#39;d go ahead and make one myself.",
  "descriptionHtml": "Even though there are more than a few of these floating around out there I figured I&#39;d go ahead and make one myself. Its a clean save the only things installed were all of the dlc including the hi-rez texture pack, and the unofficial patch.  The character is the default nord preset that is picked for you when you first enter the character customization menu. I stuck with the name &#34;Prisoner&#34; much for the same reason I went with the default preset, and that reason is time saving and allowing you more of a customization option.\r<br />His Skills are At the bottom. (Please note that when you change his race may reset to 15 don&#39;t be alarmed about that you can console command them back to normal or just ignore it and think of it as a fresh start.) I did not level up the character to allow you to place his perk points and attribute points. \r<br />Console Commands to change his race, and fix his skills back to what they are are, (type the name of the skill you wish to increase in the blank. Note that Archery will not increase unless you type &#34;marksmanship). Enjoy the fairly clean main quest complete save&#33; \r<br />showracemenu\r<br />player.advskill______ 200\r<br />\r<br />Now contains a file that is just the main quest completed, and one with both the mage, The Companions, and thieves guild completed as well as the main quest. I wish to hold off on the DB for the fact that I personally don&#39;t like them and choose to kill them however I am sure some would be upset about this. So I will wait and see what is wanted for you the community, so please let me know whether or not you want their quest line finished or not in the comment section.",
  "categoryId": "43",
  "version": "1.2",
  "author": "LazyPear",
  "createdUnix": "1412348733",
  "updatedUnix": "1413173982",
  "containsAdultContent": false,
  "uploadedBy": "SHDWSNP",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130745",
      "name": "Skyrim Save Collection",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11157",
      "fileName": "Skyrim Save Collection-58686-1-2.zip",
      "uploadedUnix": "1413173982",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ac7970f7f96d73b07989d6202ae45247fc6d05526132245993796f3bc95da121/analysis/1413174067/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Save%20Collection-58686-1-2.zip?fid=1000130745&ttl=1535845512&ri=8192&rs=8192&setec=c3ab4314a7e43a245b09489003d57d5a"
    }
  ]
}