{
  "modId": 58800.0,
  "modName": "Lucas Smithing Overhaul",
  "summary": "I wasn&#39;t happy with other mods, because they are to big or with alot of bugs.",
  "descriptionHtml": "So, this is my first Mod, not actually a Overhaul, but I want to change a lot of things about smithing in Skyrim, also I didn&#39;t do much yet, only made this.\r<br />I want to make able to smelt all sets into their basic ingots, but less than the recipe. And sorry for any spelling error, english is my second language.\r<br />Any tips are welcome, and also if you use this and find a bug, tell me. \r<br />\r<br />0.3\r<br />- Fur armor complete, can take leather or leather strips using tanning rack.\r<br />- Hide Armor complete, can take leather or leather strips using tanning rack.\r<br />- Leather Armor complete, can take leather or leather strips using tanning rack.\r<br />- Draedic Armor complete, can take Ebony Ingots or Draedic Heart but need a Grand Soul Gem Filled, the ingots from\r<br />the smelter and the Draedic Heart from the Forge (because didn&#39;t know where to put it).\r<br />- Dragon Scale Armor complete, can take Dragon Scales using the Forge.\r<br />- Dragon Plate Armor complete, can take Dragon Bones using the Forge.\r<br />- Dwarven Armor complete, can take Dwarven Metal Ingot using the Smelter.\r<br />- Ebony Armor Complete, can take Ebony Ingot using Smelter.\r<br />- Iron Armor complete, can take Iron Ingot using Smelter.\r<br />- Elven Armor Complete, can take Moonstone Ingot using the Smelter, \r<br />Quicksilver also can be taken from Gloves and Armor.\r<br />- Scaled Armor complete, can take Corundum using Smelter.\r<br />- Steel Armor and Steel Plate Armor complete, can take Iron Ingot using Smelter.\r<br />- Glass Armor complete, can take Malachite Ingot using the Smelter, \r<br />Moonstone also can be taken but it needs two from each but the armor.\r<br />- Blades Armor complte, can take Steel Ingot using the smelter, but for balance purpose, \r<br />it needs the Ebony Armor Perk because the chest is better than Ebony\r<br />and i&#39;m planning to make this Armor Craftable in a optional file.\r<br />- Able to craft a Long Bow.\r<br />\r<br />0.2\r<br />Fix the Imperial Light Shield smelting to Steel ingot from Tanning Rack and putting it on Smelter.\r<br />\r<br />0.1\r<br /> - Able to Smelt Heavy Imperial Armor into Steel Ingots, and needs the Smelting Steel Perk.\r<br /> - Able to take Leather Strips from Heavy Imperial Armor using the Tanning Rack, don&#39;t need the Smelting Steel Perk.\r<br /> - Able to Smelt Light Imperial Armor into Steel Ingots, also needs the Smelting Steel Perk.\r<br /> - Able to take Leather Strips from Light Imperial Armor using Tanning Rack, don&#39;t need the Smelting Steel Perk.\r<br /> - Able to craft Dawnbreaker with the Dragon Armor Perk.",
  "categoryId": "100",
  "version": "0.3",
  "author": "Lucandor",
  "createdUnix": "1412628275",
  "updatedUnix": "1412701978",
  "containsAdultContent": false,
  "uploadedBy": "DeathScyth31",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000129913",
      "name": "Lucas Smithing Overhaul",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Lucas Smithing Overhaul-58800-0-2.rar",
      "uploadedUnix": "1412628706",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/a599121035cf18d6035bb30765452bb8a2d07f2176da361e45f7744e1c21abaf/analysis/1412628782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lucas%20Smithing%20Overhaul-58800-0-2.rar?fid=1000129913&ttl=1535845674&ri=8192&rs=8192&setec=d5cb7166c388a1818d4cf2b7587046d2"
    },
    {
      "fileId": "1000129997",
      "name": "Lucas Smithing Overhaul",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Lucas Smithing Overhaul-58800-0-3.rar",
      "uploadedUnix": "1412701978",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/5f37ba7f8108b8ba6ebe8036e0150a6733efab76cbfd44ac59c0fc905ec6aff1/analysis/1412702042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lucas%20Smithing%20Overhaul-58800-0-3.rar?fid=1000129997&ttl=1535845674&ri=8192&rs=8192&setec=c2a0f7184b7ea96ea160b953c277b424"
    }
  ]
}