{
  "modId": 58906.0,
  "modName": "Cicero&#39;s Light Armor",
  "summary": "Modifies Cicero&#39;s clothing and makes them light armor with an equal rating than the &#34;Ancient Shrouded Armor&#34; set.",
  "descriptionHtml": "During my gameplay I decided to recruit Cicero as a follower.\r<br />\r<br />But when I checked his stats with a follower mod (Amazing Follower Tweaks) I noticed that Cicero had a very high light armor skill, but his current armor rating was 0. Why? Because his suit of armor is actually clothing, with no armor rating.\r<br />\r<br />So I made this mod to make sure he was a bit more durable, without having to make him wear a different suit of armor.\r<br />\r<br />This mod only modifies Cicero&#39;s set, not the Jester set.\r<br />\r<br />Even without Cicero, the set has very nice enchantments, but it lacks armor, great for wizards, but not so good for stealthy characters that have high light armor skill. (Plus wizards already have the &#34;Shrouded Robes&#34; set, and the Jester set which I haven&#39;t modified)\r<br />\r<br />Also, I made it so Cicero&#39;s set has the same armor as the ancient shrouded set (by the time you get access to Cicero&#39;s outfit you also should have access to the ancient shrouded set) so its not a downgrade.\r<br />\r<br />It can be improved at a workbench, each piece requires a single piece of leather and it requires the completion of the quest &#34;With friends like these...&#34;, that is the quest where you meet Astrid for the first time.\r<br />\r<br />I might also upload a 2nd version which makes it benefit from the &#34;Ebony Smithing&#34; perk when improving it at a workbench and double its improvement.\r<br />\r<br />PS: The images were taken with a light armor skill of 15. That&#39;s why they look so low. At level 100 the &#34;clothes&#34;  has a rating of 116, without improvement.\r<br />\r<br />TL; DR;\r<br />Turns Cicero&#39;s cloth set into light armor, can be improved, enjoy&#33;\r<br />\r<br />\r<br />Versions:\r<br />\r<br />-1.01: Fixed a small issue with a master file called AshramMod.esp (my personal mod file from which I pulled the Cicero outfit modifications)",
  "categoryId": "54",
  "version": "1.01",
  "author": "Kanaru",
  "createdUnix": "1412952032",
  "updatedUnix": "1412958100",
  "containsAdultContent": false,
  "uploadedBy": "Kanaru00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130330",
      "name": "Cicero&#39;s Light Armor set v1.01",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Cicero's Light Armor set v1.01-58906-1-01.rar",
      "uploadedUnix": "1412958100",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/32c3d0efbdead5eec6f88d6c274a7d1ebe7aa2c6195fad9006499ff2c7f8d151/analysis/1412958186/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cicero%27s%20Light%20Armor%20set%20v1.01-58906-1-01.rar?fid=1000130330&ttl=1535845822&ri=8192&rs=8192&setec=e75e95b64fe9f35e8a0f7bfb69175233"
    }
  ]
}