{
  "modId": 58920.0,
  "modName": "Rogue Pack",
  "summary": "The Rogue Pack adds a few minor things to make a rogue&#39;s life that little bit easier.",
  "descriptionHtml": "The Rogue Pack adds a few minor things to make a rogue&#39;s life that little bit easier.\r<br />\r<br />It does this by adding some new craftables and changing some tempering recipes. This is a WiP as it started as a personal mod, but I felt like adding it after adding many of the newer options.\r<br />\r<br />==New craft==\r<br />Lockpicks - 5 for 1 iron ingot\r<br />&#34;Rogue Armour&#34; - A set of armour aesthetically the same as the Theives Guild Master armour. Requires Advanced Armours, under &#34;Steel&#34; as uses Scaled Armour tags. The Armour rating is exactly the same as normal Thieves Guild Master armour. (The images are taken with a very high light armour skill).\r<br />*Hood - 2 Corundum Ingots, 2 Steel ingots, 2 Leather and 2 Leather Strips\r<br />*Cuirass - 3 Corundum Ingots, 3 Steel ingots, 3 Leather and 4 Leather Strips\r<br />*Gauntlets - 1 Corundum Ingot, 2 Steel ingots, 2 Leather and 3 Leather Strips\r<br />*Boots -  2 Corundum Ingots, 2 Steel ingots, 2 Leather and 3 Leather Strips\r<br />*Tempered with 1 Corrundum ingot\r<br />Longbow and Hunting bow recipes added. Easy to find, but felt they should be added. Longbow requires no perks, Hunting bow requires Steel Smiting.\r<br />*Longbow - 1 Iron Ingot, 1 Leather Strip and 2 Firewood\r<br />*Hunting Bow - 1 Steel Ingot, 1 leather Strip and 2 Firewood\r<br />\r<br />==New Tempering==\r<br />Steel Smithing now doubles the tempering bonuses on a few light armours, mainly Stormcloak, Light Imperial, Leather and normal Thieves Guild armour.\r<br />Advanced Armours now doubles the improvement of Nighingale armour and Theives Guild Master armour.\r<br />\r<br />Added note: This mod was made prior to Dawnguard, and has only been worked on again recently, so it may also allow for creation of other things that I may have forgotten about, if that is the case please leave a message and I will add it to the list.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Crazysam10",
  "createdUnix": "1412983047",
  "updatedUnix": "1412983042",
  "containsAdultContent": false,
  "uploadedBy": "crazysam10",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130380",
      "name": "Rogue Pack",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Rogue Pack-58920-1-0.7z",
      "uploadedUnix": "1412983042",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8a18044d9380bc2aa32bbd6cd150932fef0f9007ca00c76bef3e7a372b225838/analysis/1412983142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rogue%20Pack-58920-1-0.7z?fid=1000130380&ttl=1535845837&ri=8192&rs=8192&setec=bbded75bac2d9bd670411bc3d57a47b9"
    }
  ]
}