{
  "modId": 58949.0,
  "modName": "Cosy Windhelm Cabin",
  "summary": "REQUIRES HEARTHFIRE AND SKYRIM UPDATE. This is a small cabin home. Includes a Kitchen, Dining Room, converted-attic bedroom for 2 children, Master bedroom, Bathroom and a Basement. \r<br />\r<br />",
  "descriptionHtml": "[size=6][u][color=#ff0000]&gt;&gt;&gt;HEARTHFIRE AND SKYRIM UPDATE IS REQUIRED.&lt;&lt;&lt;[/color]\r<br />[/u][/size]\r<br />[size=3][u]-10/12/14  9:50am UPDATE; I will be working on adding more interactive display cases and weapons displays and I will also add a stable outside.[/u]   I am having issues with the house now... even though my teleport marker is above the ground I keep clipping through the floor... might let someone else take over if they are interested...[/size]\r<br />\r<br />\r<br />Windhelm Cabin is a small cosy home for a small family. The home includes;\r<br />\r<br />-Kitchen\r<br />-Dining Room\r<br />-A bedroom for up to 2 children, converted from an attic space&#33;\r<br />-A bathroom located to the left of the kitchen\r<br />-Master bedroom for dragonborn and spouse.\r<br />-Basement with Enchanting and Alchemy station and PLENTY OF STORAGE&#33;\r<br />\r<br />Windhelm Cabin also has all the crafting stations you need, they are located on the exterior of the house. \r<br />\r<br />[u][b][size=5]INSTALLATION:\r<br />\r<br />[/size][/b][/u]Please bare with me, I am relatively new to modding and I&#39;m not quite sure how Nexus Mod Manager works... I have included all Meshes required in a folder called &#39;Riverwoodcabin.esp&#39; and I thought that if I changed the name it might screw up the path that the game uses to find the items... so I left it at that. If you don&#39;t use Nexus Mod Manager, all you have to do is drop the &#39;Riverwoodcabin.esp&#39; file into your TEXTURES folder that is located in the Skyrim DATA folder. After that you can drop &#39;novafoxay_cabinhome&#39; plugin into the DATA folder and enable it through the Skyrim plugin menu. I&#39;m sorry if the explaination is terrible, I&#39;m relatively new, hopefully manager will sort it out for you&#33;\r<br />\r<br />As far as I know there aren&#39;t any issues with this mod. I went through the entire house several times to make sure there were no holes in the walls etc and I also got my boyfriend to test it for me so that I could make sure there weren&#39;t any missing items as well. ",
  "categoryId": "67",
  "version": "1.0",
  "author": "Rachel Turner",
  "createdUnix": "1413040192",
  "updatedUnix": "1413040186",
  "containsAdultContent": false,
  "uploadedBy": "Novafoxay",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130479",
      "name": "Windhelm Cosy Cabin",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6431",
      "fileName": "Windhelm Cosy Cabin-58949-.rar",
      "uploadedUnix": "1413040186",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/227d51548cae072a4dd8fc1bd88501ca66b9e4bdeb880474d27c24150c4c5578/analysis/1413040270/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Windhelm%20Cosy%20Cabin-58949-.rar?fid=1000130479&ttl=1535845876&ri=8192&rs=8192&setec=302472de8341804b2e1baba280765aec"
    }
  ]
}