{
  "modId": 58942.0,
  "modName": "Aetherial Pulse Axe",
  "summary": "A new, unique looking and uniquely enchanted battle axe for you to find and claim as your own.",
  "descriptionHtml": "This mod adds a new, uniquely modelled and textured battle axe to the game. It also has a unique enchantment for you to discover. It can be found within one of Skyrim&#39;s many dwarven ruins, along with the body of the unfortunate adventurer whom it belonged to, before he met his fate.\r<br />The axe can be tempered at any grindstone, and it can&#39;t be disenchanted.\r<br />Note: I spent absolutely ages trying to decide upon a name for this unique weapon, and finally settled on &#39;Aetherial Pulse Axe&#39; as suggested by Valkasha on the nexus forums. However, if you do not like the name, you can use the mod [url=http://www.nexusmods.com/skyrim/mods/57335/?]Jaxonz Renamer[/url] to change it to what ever you like.\r<br />\r<br />Installation: Just install normally using NMM or another mod manager, or, to manually install, drop the esp into your data folder, and merge the meshes, textures and scripts folders with the ones in your data folder.\r<br />\r<br />Compatibility: There should be no problems with other mods.\r<br />\r<br />I hope you like it :)\r<br />\r<br />Also, I want to say thanks to Matthiaswagg for coming up with the idea for it&#39;s enchantment and how to find it, and to everyone who commented on my post in the forums, and my picture I uploaded here, with suggestions on what to name it, thanks guys&#33; :)",
  "categoryId": "55",
  "version": "1.0",
  "author": "simsim899",
  "createdUnix": "1413031408",
  "updatedUnix": "1413031320",
  "containsAdultContent": false,
  "uploadedBy": "simsim899",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130447",
      "name": "Aetherial Pulse Axe",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "811",
      "fileName": "Aetherial Pulse Axe-58942-1-0.rar",
      "uploadedUnix": "1413031320",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f9983f1af9e31e2ae70f363d995ba3186f4c1381a6fb03f7853b1cde99f9eb0/analysis/1413031383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aetherial%20Pulse%20Axe-58942-1-0.rar?fid=1000130447&ttl=1535845866&ri=8192&rs=8192&setec=236632a4863db3a24d24d1b52b6d6d18"
    }
  ]
}