{
  "modId": 58998.0,
  "modName": "Ini Tweak Collection",
  "summary": "WIP - Work In Progress. There&#39;s nothing to it yet, but once finished, this &#34;mod&#34; will contain the most popular Skyrim.ini and SkyrimPrefs.ini tweaks, with an automated installer. No need to manually edit anything.\r<br />",
  "descriptionHtml": "[size=4][color=#e69138]NOTICE: This is a work in progress.[/color] The current version doesn&#39;t really do much. however, I do take suggestions. You know a useful ini tweak that you&#39;d like to have in this collection? Post it in the [url=http://www.nexusmods.com/skyrim/mods/58998/?tab=4&&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D58998%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D2188404&pUp=1]Tweak Request Thread[/url], and I&#39;ll add it.[/size]\r<br />\r<br />[center][size=6]Ini Tweak Collection[/size][/center]\r<br />Let&#39;s face it, Skyrim&#39;s default settings aren&#39;t for everyone. But most importantly, only a few can be changed in-game or from the launcher. Sometimes, the only way to optimize performance is to poke around in the game&#39;s ini files. But what to change? And what to change it to?\r<br />\r<br />This mod aims to provide a collection of tweaks to your Skyrim.ini and SkyrimPrefs.ini files. Though not in the &#34;traditional&#34; way, by providing them in the description or as downloadable text files. Instead, the mod will provide an automated installer or patcher that will do the dirty work for you. All you need to do is select the tweaks you&#39;d like to apply, and the rest is done for you. No worrying about forgetting to make a backup either, as the original values will be saved automatically. And if something does go wrong, you can instantly revert any changes.\r<br />\r<br />[size=4][color=#93c47d]A little technical...[/color][/size]\r<br />\r<br />This mod literally doesn&#39;t add any files to the game itself. In fact, the current version merely contains a scripted installer. That&#39;s it. My original intention was that I make a C# Script based installer and let Nexus Mod Manager handle the actual dirty work. However, as it turns out, NMM&#39;s ini handling has bugs. (I&#39;m gonna file a bug report about it soon-ish.) As such, I might make a patcher version instead. Let me know what you think in the discussion thread.\r<br />\r<br />[size=4][color=#93c47d]How to install and use[/color][/size]\r<br />\r<br />Use Nexus Mod Manager. The installer was built specifically to be used by NMM. I don&#39;t know if any other mod manager can handle C# install scripts (Though I didn&#39;t check). Clicking install will display a dialog window where you can select which tweaks to apply.\r<br />\r<br />[size=4][color=#93c47d]How to uninstall[/color][/size]\r<br />\r<br />Uninstall via NMM. The installer&#39;s built to tell NMM to remember any ini tweaks applied, so if the mod&#39;s disabled, any and all tweaks should be reverted.\r<br />\r<br />[size=4][color=#93c47d]Planned features[/color][/size]\r<br />\r<br />- Completely redesign the look of the installer - I really think it deserves more than a standard grey box. The current one&#39;s only a stitched-together something, anyways.\r<br />- Add a feedback area that displays exactly what changes will be made.\r<br />- Include additional tweaks (from my own list, and from suggestions).\r<br />\r<br />[size=4][color=#e69138]Known issues[/color][/size]\r<br />\r<br />Nexus Mod Manager&#39;s ini handling (that I&#39;m using to change ini values) is less reliable that I anticipated. If NMM crashes after you click the OK button on the install form, that&#39;s &#34;normal&#34;. Windows should apply some compatibility options to NMM that should prevent that from happening again.\r<br />\r<br />There&#39;s more, however. Attempting to change ini values will cause NMM to display confirmation messages similar to the ones you might see when overwriting files. However, when editing SkyrimPrefs.ini, error messages will display continually, preventing you from proceeding. Simply hit OK on the error message, then instantly press ENTER, which, after a few tries, should press the &#34;Yes to all&#34; button on the ini overwrite confirmation dialog. Or, also select a tweak that edits Skyrim.ini (I&#39;ve made them to be applied first), and press &#34;Yes to all&#34; there. [b]NOTE:[/b] There aren&#39;t any tweaks that affect SkyrimPrefs.ini implemented yet.\r<br />\r<br />NMM cannot handle cases where an ini tweak is being applied in a section that doesn&#39;t exists (yet) in the ini file. Consequence: The autosave increasing option doesn&#39;t work unless you create it manually.\r<br />\r<br />[size=4][color=#e69138]DISCLAIMERS[/color][/size]\r<br />\r<br />This mod is provided &#34;as is&#34;. Use at your own risk. I am not liable to any damage to your game or save file, permanent or reversible, caused directly or indirectly by any tweaks contained in this collection. Not all options are good for everyone. You have been warned.\r<br />\r<br />For the sake of better organizing the mod page, I disabled the comments section. Please use the [url=http://www.nexusmods.com/skyrim/mods/58998/?tab=4&&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D58998%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D2188484&pUp=1]General Discussion Thread[/url] instead.\r<br />\r<br />If you&#39;d like to make a similar mod for other games (or even Skyrim), you can use my mod as a base. Source code is included in the file, so you can easily modify it to suit your needs. If you use my work or parts of it, the source code (modified or not) should be included in your release as well, and you should credit me as the creator of the original mod yours is based on.\r<br />\r<br />I&#39;d like to keep this mod Nexus only, so please, PLEASE do not re-upload it anywhere. Mods that use mine as a base may be uploaded to other sites as well, this restriction only applies to the original (and anything that highly resembles the original - Like, if you only changed the background image, that&#39;s still Nexus only). Thank you for understanding.",
  "categoryId": "28",
  "version": "0.0.1",
  "author": "Rider01",
  "createdUnix": "1413199487",
  "updatedUnix": "1413194971",
  "containsAdultContent": false,
  "uploadedBy": "Rider01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130776",
      "name": "Ini Tweak Collection 0.0.1",
      "version": "0.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Ini Tweak Collection 0.0.1-58998-0-0-1.rar",
      "uploadedUnix": "1413194971",
      "modVersion": "0.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/c2f5b4e79dd8396105a8336336b6fc89df3df43796672c318797f3f4d1e1c657/analysis/1413195063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ini%20Tweak%20Collection%200.0.1-58998-0-0-1.rar?fid=1000130776&ttl=1535845950&ri=8192&rs=8192&setec=4b1d67926cf686d128a40d72b6087d43"
    }
  ]
}