{
  "modId": 59013.0,
  "modName": "Mage&#39;s Transmute and Smelt Spells",
  "summary": "extended and improved version of the mod by Silverknight7. Now with a concentration version of the transmute spell&#33;",
  "descriptionHtml": "Posted with the permission of the original author...so to start with, the original mod is this one: http://www.nexusmods.com/skyrim/mods/27495/?\r<br />Not required, in fact you may as well not download it, but endorsing it would be nice, since without it I wouldn&#39;t have gotten around to this one.\r<br />Changes:\r<br />-Get stuck smelting, without using magicka: GONE&#33;\r<br />-Magicka is only used when you actually transmute or smelt something&#33; Costs less and works faster the higher your alteration skill&#33;\r<br />-moved all the smelt spells to the alteration trainer. currently only changes one leveled list.\r<br />\r<br />-added an option to support some crafting overhauls, such as CCO. It&#39;s a global variable (oressmelt, yes I&#39;m that lazy)&#33; There&#39;s an optional file (included in download) if you don&#39;t want to bother changing it yourself. just load that after the first file.   \r<br />-have dozens, hundreds, even thousands of ore? Not a problem. The concentrated transmutation spell will transmute in multiples of 10, up to 10k.   \r<br />-concentrated transmutation is different than most spells, in that dual casting is cheaper, rather than having twice as powerful an effect. This is to preserve balance...no sense having 1 iron ore turn into 4 gold ore.\r<br />\r<br />Not changed:\r<br />-dual casting smelt spells will produce two ingots. It&#39;s not too imbalanced as a feature, considering how much of the ore is actually gold is up for debate. Especially with CCO...5 ores per bar.\r<br />-visual effects. Because pretty and shiny.\r<br />\r<br />Short version:\r<br />-Cool, balanced spells transmutation and smelting spells for sale at anyone that sells books from the alteration25 spellbook list.\r<br />\r<br />Possible updates:\r<br />-Switch from editing leveled lists to using that one function that adds items to a leveled list, when I figure out where it was and how to use it. (post info on it if you know what and where it is)\r<br />-Add in support for the mage stone perk (cheaper spells one.)\r<br />-moving ebony smelting to the master level, given how costly and useful it is.\r<br />\r<br />Changelog:\r<br />2.01: Forgot (to remove) some conditions earlier, which rendered some spells useless, such as dual-casted mithril/quicksilver transmutes. Removed all conditions from the smelt spell records, as the magic effects and the script handle that.",
  "categoryId": "75",
  "version": "2.1",
  "author": "EnigmaniteK",
  "createdUnix": "1413214768",
  "updatedUnix": "1413383595",
  "containsAdultContent": false,
  "uploadedBy": "EnigmaniteK",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131124",
      "name": "version 2_1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "version 2_1-59013-2-1.zip",
      "uploadedUnix": "1413383595",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/19ef958a07d3d7bc8e7065cc9e9da368628856f4a06f069b541ea02dc6f5e4b2/analysis/1413383702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/version%202_1-59013-2-1.zip?fid=1000131124&ttl=1535845966&ri=8192&rs=8192&setec=08ca7585a3f1304d94738465deaccacf"
    }
  ]
}