{
  "modId": 59023.0,
  "modName": "Zinni&#39;s Torch Arrow and Lantern Fix",
  "summary": "Fixes a save corrupt bug for users of Wearable Lanterns and Torch Arrows by using Elemental Arrows.",
  "descriptionHtml": "   \r<br />    [center]So, here&#39;s a little mod to fix a problem myself and other users were having when using [b][url=http://www.nexusmods.com/skyrim/mods/23574/?]Torch Arrows[/url][/b] and [b][url=http://www.nexusmods.com/skyrim/mods/17416/?]Wearable Lanterns[/url][/b]. The issue is that if you had a lantern and torch arrows equipped and the lantern was turned on and you saved your game, it would corrupt the save file. In turn, causing an instant CTD when loading said save. Having the lantern off with torch arrows equipped and saving worked fine. Although now you had to remember to turn it off before saving. Thanks to [url=http://www.nexusmods.com/skyrim/users/7925943/?]ScorpionSK[/url] for finding this.\r<br />\r<br />    I tested this myself to verify as I used both mods. Load order didn&#39;t matter, it was gonna CTD. And rather than trying to remember to turn off my lantern before saving I decided to adjust [b][url=http://www.nexusmods.com/skyrim/mods/49983/?]Elemental Arrows[/url][/b] to replace Torch Arrows. As testing the same issue with Elemental Arrows and Wearable Lanterns had no problems.\r<br />\r<br />    Since I was already using Elemental Arrows with the other two mods, it seemed a no brainer. After all, Torch Arrows&#39; arrows and EA&#39;s flame arrows do almost identically the same thing. The major differences are EA arrows require certain conditions to be met before you can craft them and to find them on guards or mobs is extremely rare and nonexistant in the early levels. And as a bonus, I save myself an .esp slot by not needing Torch Arrows anymore. While I hadn&#39;t run into any issues with Torch Arrows until using Wearable Lanterns, there are reports of other CTD issues posted on it&#39;s page from other users. Though Torch Arrows is an awesome mod and deserves love.\r<br />\r<br />    And personally, I love having the Torch Arrows added to the leveled lists. Never know when a Bandit or a Guard is gonna light your fur on fire&#33;\r<br />\r<br />\r<br />That being said, this is just an .esp replacer for Elemental Arrows and doesn&#39;t require any other mod. So, even if you aren&#39;t using Torch Arrows or Wearable Lanterns and would like to see lootable Flaming Arrows and  Bolts in the early lvls on npc&#39;s, you can use this with EA.[/center]\r<br />\r<br />\r<br />    [center][color=#6d9eeb][size=3][u][b]So, what did I do to the Elemental Arrows .esp?[/b][/u][/size][/color][b][/b][/center][b]\r<br />\r<br />\r<br />[/b]    I added Elemental Arrows&#39; Flaming Arrow to the same loot lists that Torch Arrows uses. Also gave them to the Storm Cloaks, since the Empire \r<br />already had them. Just to even the ground a bit. You now have a certain chance of seeing them on npc&#39;s and merchants starting at level 1, like you did with Torch Arrows. Still requires EA&#39;s conditions before you cancraft them.\r<br />\r<br />    Also, it seems that Nofumasa already had Gemmed Bolts and Flaming Bolts created in the CK, they just weren&#39;t being used anywhere. So, I added them into the game. And in trying to keep in accordance with Dawnguard, you should start seeing them show up around level 11.\r<br />\r<br /> - Created new lists for both bolts and added them to the appropriate lists.\r<br /> - Both bolts have crafting recipes in the same style as Elemental Arrows.\r<br /> - They can be crafted in batches of 20, 40 and 60.\r<br />\r<br /> - Both Flaming Arrows and Bolts have had their price reduced from 50g to 25g to be closer to Torch Arrows.\r<br /> - Gemmed Arrows and Bolts are now 20g a pop.\r<br />\r<br />And that&#39;s about it.[b]\r<br />\r<br />\r<br />\r<br />Compatibility:[/b]\r<br />\r<br />    From Elemental Arrows:\r<br />      &#34;This mod uses its own meshes and textures. It only used vanilla meshes for the quivers, the textures will change depending which texture replacers you install. This mod also won&#39;t be affected by mods that changes vanilla arrows. You can place this mod anywhere on the load order. This mod will not conflict with any other mod.&#34;\r<br />\r<br />    Just don&#39;t use both of our .esps\r<br />\r<br />    Loot Lists are added and added to, might wanna BashPatch\r<br />\r<br />[b]Requirements:[/b]\r<br />\r<br />    Skyrim 1.9.blahblahblah\r<br />    Dawnguard\r<br />    Dragonborn\r<br />    [url=http://www.nexusmods.com/skyrim/mods/49983/?]Elemental Arrows[/url] (This is just an .esp replacer, you need the rest of EA for this to work.)\r<br />\r<br />[b]Install:[/b]\r<br />\r<br />    Replace/Overwrite the original ElementalArrows.esp with this one.\r<br />\r<br />\r<br />[b]Uninstall:[/b]\r<br />\r<br />    Deactivate and delete my .esp and Elemental Arrows.\r<br />    Or replace my .esp with the original ElementalArrows.esp\r<br />\r<br />\r<br />\r<br />\r<br />[center][size=3][b]Disclaimer:[/b][/size]\r<br />\r<br />    I sent Nofumasa (Author of Elemental Arrows) a pm several weeks ago asking if he minded me uploading a patch, but have gotten no response.\r<br />From what I can see he hasn&#39;t been active since February and after finding this post on Morrowloot 4E Edition&#39;s page:\r<br />&#34;Since people have been asking continuously about making patches and I&#39;m too busy working on the mod, anyone that has a basic knowledge of how the Creation Kit and TES5Edit works can make patches for mods they want.&#34;\r<br />... I&#39;m gonna guess it&#39;s okay for me to do so.\r<br />\r<br />\r<br />\r<br />\r<br />Please don&#39;t upload this to any other site.\r<br />\r<br />Thanks to [url=http://www.nexusmods.com/skyrim/users/7925943/?]ScorpionSK[/url]\r<br />Thanks to [url=http://www.nexusmods.com/skyrim/mods/49983/?]Elemental Arrows[/url]\r<br />Thanks to [url=http://www.nexusmods.com/skyrim/mods/23574/?]Torch Arrows[/url]\r<br />Thanks to [url=http://www.nexusmods.com/skyrim/mods/17416/?]Wearable Lanterns[/url][/center]",
  "categoryId": "95",
  "version": "1.0",
  "author": "Zinni",
  "createdUnix": "1413236717",
  "updatedUnix": "1413236576",
  "containsAdultContent": false,
  "uploadedBy": "Zinni",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000130883",
      "name": "Zinni&#39;s Torch Arrow and Lantern Fix (Elemental Arrows .esp)",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Zinni's Torch Arrow and Lantern Fix (Elemental Arrows .esp)-59023-1-0.7z",
      "uploadedUnix": "1413236576",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/51d06fa06d25da50f9ac9ceedd94bfdf96972855d70862d555303882c42778ba/analysis/1413236402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zinni%27s%20Torch%20Arrow%20and%20Lantern%20Fix%20%28Elemental%20Arrows%20.esp%29-59023-1-0.7z?fid=1000130883&ttl=1535845979&ri=8192&rs=8192&setec=5e96853083a4f7c40213470360a74ff5"
    }
  ]
}