{
  "modId": 59036.0,
  "modName": "Hunterborn - RND - Frostfall Patch",
  "summary": "A simple patch between Hunterborn, RND and Frostfall to make all edible foods have the required effects and eliminate the need for more than one patch between the three of them. ",
  "descriptionHtml": "[b]\r<br />[size=5][size=4][u]Updated to Hunterborn 1.4&#33;[/u][/size]\r<br />[/size][size=2]\r<br />\r<br />If you&#39;re anything like me, you love your lore-friendly immersive mods, and it probably drove you nuts that RND and Hunterborn soups and teas weren&#39;t affected by Frostfall&#39;s brilliant exposure system. They were supposed to make you get a bit warmer by drinking stews, soups, teas and alcoholic beverages, but depending on your load order you only got the effects from one of the mods. The creator of Hunterborn made a patch between the two, but they used their own effects and buffs so as to presumably not interfere with anything. Well, that&#39;s nice, but it only mimics the effects from the other mods, not replicates them exactly, so I took it upon myself to actually go into the Creation Kit and fix that.\r<br />\r<br />\r<br />\r<br />[u]What This Mod Actually Does;[/u]\r<br /> I added all stews and other &#34;warm&#34; foods to the required Frostfall FormID lists, set up the added Hunterborn foods so they are affected in the exact same way as the regular ones, and mostly just made the mods play nicely with each other. I also fixed a few &#34;errors&#34; along the way, things like large hunks of meat marked as small meals or large bottles being medium drinks, and evening out the numbers of objects created so you get more sensible results, or just recipes that I didn&#39;t feel made sense. Mostly just tweaks and making things a bit more consistent. I also incorporated the Hunterborn pelt recipes and the Dawnguard patch for Hunterborn/Frostfall as well, in their entirety, so that&#39;s two less patches for your load list. (Hunterborn Frostfall Patch and Hunterborn Dawnguard Patch).\r<br />\r<br />\r<br />In layman&#39;s terms?  I made all the food items act like they&#39;re supposed to, in addition to making the recipes more consistent, and to free up some space in your load list, because you won&#39;t need DLC patches for these mods either. (They&#39;re all merged in).\r<br />\r<br />\r<br />\r<br />[u]Required;[/u]\r<br />This is made to work with the Merged ESP version of RND. You don&#39;t have to use it, but it probably won&#39;t work as intended, and if you have all the DLC then you&#39;re wasting space anyway. This mod will probably save you about three or four mods in your load list. No DLC-free version yet. If you want one, then you&#39;re going to have to give me a decent reason to do it. (&#34;I want one&#34; isn&#39;t a decent reason. We all want lots of things. Find a better one.)\r<br />Hunterborn\r<br />Frostfall\r<br />Realistic Needs and Diseases (Merged ESP version in the optional files, not required, but strongly recommended.)\r<br />All DLC\r<br />All Unofficial Patches.\r<br />\r<br />[u]Instructions;[/u]\r<br />Just open with NNM and that&#39;s it, or unzip and drag and drop into your Data folder. It&#39;s in BSA format, so you won&#39;t have to worry about files getting overwritten or cluttered. Put it after Hunterborn, RND and Frostfall in your load order. Shouldn&#39;t confict with anything that doesn&#39;t change those mods. \r<br />\r<br />\r<br />[u]Why I made it;[/u]\r<br />This is the result of my inability to just accept something as-is. I&#39;m constantly tweaking and editing all of my mods to my liking, no matter who made them or how good they are, because I&#39;m just obsessive and picky like that, and it&#39;ll drive me nuts if I don&#39;t. I also don&#39;t have the patience to request some sort of patch or specific edit, and wait for a response so I normally just attempt to do it myself. This little monster patch between my three absolute favorite is what happens when I&#39;m left with far too much free time, internet access and a powerful laptop. \r<br />\r<br />\r<br />[u]Anything Else?[/u]\r<br /> I will take requests, as this was made for my personal use and there&#39;s a good chance many of you don&#39;t share my personal tastes and want something changed.. If there&#39;s something specific you want or don&#39;t want, leave a comment and I&#39;ll see what I can do.\r<br />\r<br />\r<br />[/size][/b][size=2]\r<br />[b][b][u]Thanks;[/u]\r<br />While this certainly isn&#39;t the first mod I&#39;ve ever made, it is the first I&#39;ve uploaded, largely because of a certain friend of mine whom I \r<br />tweaked my personal patch for some time ago and as a result has hounded me relentlessly about it ever since. I&#39;d like to personally thank them for wasting the last two months of our lives and also inform them that if they don&#39;t shut up about it, \r<br />the next &#34;mod&#34; I make them will turn every female in the game into naked, bouncy-breasted draugrs. Possibly even something worse, depending on how much longer they keep it up.[/b]\r<br />\r<br />\r<br />[u]Updates;\r<br />[/u]Hunterborn 1.4, done.\r<br />\r<br />\r<br />(Note, I use my own edited versions of RND and Hunterborn, in which I&#39;ve deleted any recipe I deemed unnecessary or redundant, so things like the RND Sabre Cat meats and and Hunterborn Teas haven&#39;t been edited and will work as they normally do, and unless I get specific request for them I&#39;m not going to.)[/b][/size]",
  "categoryId": "84",
  "version": "1.0",
  "author": "MissQuinn",
  "createdUnix": "1413272343",
  "updatedUnix": "1414563089",
  "containsAdultContent": false,
  "uploadedBy": "animegirl12249",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000132962",
      "name": "Hunterborn - Frostfall - RND Patch (BSA Version)",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5408",
      "fileName": "Hunterborn - Frostfall - RND Patch-59036-1-2.zip",
      "uploadedUnix": "1414533102",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/24588e94e4b5403a7559271c90d9ad4f181d14392b2ab30e3417b1cd759199e2/analysis/1414533186/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hunterborn%20-%20Frostfall%20-%20RND%20Patch-59036-1-2.zip?fid=1000132962&ttl=1535846003&ri=8192&rs=8192&setec=17c707be60e1823680219184ad796a12"
    },
    {
      "fileId": "1000132963",
      "name": "Hunterborn - Frostfall - RND Patch (Loose Files Version)",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5445",
      "fileName": "Hunterborn - Frostfall - RND Patch (Loose Files Version)-59036-1-1.zip",
      "uploadedUnix": "1414533180",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a1246c47e0403862f9b53f94dcc366bf5494ce0deb84f6996fe127d3fcafbbd7/analysis/1414533244/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hunterborn%20-%20Frostfall%20-%20RND%20Patch%20%28Loose%20Files%20Version%29-59036-1-1.zip?fid=1000132963&ttl=1535846003&ri=8192&rs=8192&setec=7166e53d94c4498babf0c5162f93a6c0"
    },
    {
      "fileId": "1000132997",
      "name": "Hunterborn - Frostfall - RND Patch (BSA Version)",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5408",
      "fileName": "Hunterborn - Frostfall - RND Patch-59036-1-3.zip",
      "uploadedUnix": "1414562980",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/1f0224600e806b4f0926f502e41b1ad44f371f9f904b57673c9a7d608a24c2f9/analysis/1414563066/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hunterborn%20-%20Frostfall%20-%20RND%20Patch-59036-1-3.zip?fid=1000132997&ttl=1535846004&ri=8192&rs=8192&setec=aad93458d16a05b771a12400010bf3ff"
    },
    {
      "fileId": "1000132998",
      "name": "Hunterborn - Frostfall - RND Patch (Loose Files Version)",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5445",
      "fileName": "Hunterborn - Frostfall - RND Patch (Loose Files Version)-59036-.zip",
      "uploadedUnix": "1414563089",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b51404bd6332b035386283d599fa80762ee2e43d17a2e65334c05bddcc75cee0/analysis/1414563190/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hunterborn%20-%20Frostfall%20-%20RND%20Patch%20%28Loose%20Files%20Version%29-59036-.zip?fid=1000132998&ttl=1535846004&ri=8192&rs=8192&setec=a8ca5a814093af3f4a9c81f319b10ea6"
    }
  ]
}