{
  "modId": 59063.0,
  "modName": "Higher Magic - Potion Converter",
  "summary": "Convert potions to stronger or weaker ones, as you need.",
  "descriptionHtml": "Higher Magic Potion Converter\r<br />\r<br />by\r<br />\r<br />Rex1029 aka  Pan Dragondagger\r<br />\r<br />==========================\r<br />\r<br />Potion Converter allows a person to convert basic, vanilla potions that are in the game to other dosages of the same potion.\r<br />\r<br />To do such, you simply go to any cook pot, and proceed like normal.\r<br />\r<br />Most (but not all) recipees are able to be done in three forms.\r<br />Singles\r<br />Groups of 5\r<br />Groups of 10\r<br />\r<br />This allows you to not only convert up, into stronger potions, but also down, into weaker ones. Such is useful if you happen to have a character, like a mage, who has 130 health, and you find that potion that has 150 health. Instead of wasting the extra, convert and use it properly, as your character can best use such.\r<br />\r<br />===\r<br />\r<br />Limits :\r<br />\r<br />I did apply some limits to this list.\r<br />\r<br />1) I did not touch any potions that had more than 1 effect.\r<br />2) Some potions didn&#39;t convert well to match others in the series. In these cases, you will see gaps in the conversion ability.\r<br />\r<br />(IE: If you look, most of the FortifySkill potions have a L3 potion effect equal to 2 L1 potions... and the L4 potion is equal to a L1 and L2 effect combined. If 2 L1 = L3, then you can&#39;t get a L2 with that same formula... Such odd numbering was rampant in a host of places...)\r<br />\r<br />(IE: You have frenzy and fear spells that effect characters of a particiular level... That doesn&#39;t exactly have a good cut-off, or comparison for such things, so a formula isn&#39;t really possible to be made.)\r<br />\r<br />3) Potions that didn&#39;t have effects that could be broken up were ignored  (ie: Potion of Blood from Dawnguard.)\r<br />\r<br />4) This is nothing to do with the potions the player makes themselves. (I don&#39;t even know how to effect those, honestly.)\r<br />\r<br />5) In some cases, there are minor losses in the effects in the conversion. Each formula was rounded DOWN, however, not up.\r<br />\r<br />====\r<br />\r<br />How do I enable this?\r<br />Copy it to your ..&#92;Skyrim&#92;Data&#92; directory.\r<br />Go to your load manager, and click the check beside it.\r<br />\r<br />How do I disable this?\r<br />Go to your load manager. Unclick the check beside this mod.\r<br />\r<br />How do I erase it?\r<br />Delete this file.\r<br />\r<br />====\r<br />\r<br />Permissions :\r<br />\r<br />I ask you don&#39;t use this in your mods.\r<br />If you want to use such, please get my permission before you do so. \r<br />If I say &#39;No&#39;, then please do not use it, and stop distribution of any mod that may have it lumped in.\r<br />\r<br />Enjoy :)",
  "categoryId": "94",
  "version": "1.0",
  "author": "Rex1029 aka Pan Dragondagger",
  "createdUnix": "1413322581",
  "updatedUnix": "1413322573",
  "containsAdultContent": false,
  "uploadedBy": "Rex1029",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131021",
      "name": "HM Potion Converter - 1-0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "HM Potion Converter - 1-0-59063-1-0.zip",
      "uploadedUnix": "1413322573",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1f0b82a3de08e62c231dee7689f5845422f43db8da81957b4e9bfe1017efbea2/analysis/1413322683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HM%20Potion%20Converter%20-%201-0-59063-1-0.zip?fid=1000131021&ttl=1535846044&ri=8192&rs=8192&setec=6c45987dc0be0c72933e644ff9918aa0"
    }
  ]
}