{
  "modId": 5909.0,
  "modName": "Zohars Class Mod - 14 starting classes",
  "summary": "14 balanced starting classes each catered to a particular theme and pre-built with basic perks and skill levels.",
  "descriptionHtml": "Hello and thank you for checking out Zohar\\'s Class Mod.  This mod provides 14 starting classes for players who want to specialize from the get go with perks and modest skill levels in the relevant classes.\r\n\r\n-----------------------------------------------------\r\n::::::::::::::::::Zohar\\'s Class Mod:::::::::::\r\n-----------------------------------------------------\r\n\r\nThis mod aims to give players the option to start as\r\npre-skilled classes that cater to their specific style\r\nof play.  All classes start at level 1 but have already\r\nearned skill levels and basic perks in the relevant\r\nskill trees.  This is not designed as a cheat mod but\r\nrather a headstart that aims to set players on a job\r\npath right from the get-go, rather than starting you\r\nas kind of a jack of all trades.\r\n\r\nEach class has it\\'s pros and cons.  For example, mages\r\nstart with basic spells and perks but possess virtually\r\nno skill in any traditional combat school.  Warrior type\r\nclasses have extremely low skill levels in the magic\r\nschools.  They are actually much lower than what they\r\nwould normally be with the vanilla starting stats.\r\n\r\nEach character is built around a theme, so while you\r\nwill come across the basic thief, there are also other\r\nclasses that are a bit more specialized, such as the \r\nBarbarian and a bit more complicated, like the battlemage.\r\nI endevored to make them as balanced as possible with my\r\nlimited modding ability, so I hope I didn\\'t make the game\r\ntoo hard or too easy for any class.  I focused on ensuring \r\nno class overlaps another too much, save for the elemental\r\nmages, who kinda require some overlap.\r\n\r\nThe vanilla game basically starts off every character\r\nregardless of race with the same basic stats save for \r\nsome moderate increases in certain race specific areas.\r\nThis makes it less likely for an unknowledgable player\r\nto \\\"screw up\\\" but reduces the incentive to choose a\r\nspecific race. I understand Bethesda\\'s goal was to \r\nallow anybody the ability to do anything, and that\\'s\r\nfine, but this mod aims to more specifically define\r\nyour character and present you with compelling reasons\r\nto choose one class over another.\r\n\r\nEach class also has a basic story construct that I came up\r\nwith purely for my own enjoyment and also as motivation\r\nfor what types of skills and perks I was going to give\r\nthe class I was working on.  If you care to know the \r\nreasoning and motivation behind what I chose for the perks \r\nand skills for a class I strongly encourage you to read \r\nthe Class Descriptions.rtf file I included with the\r\ndownload. I think I made it interesting enough to read,\r\nso don\\'t be afraid of getting bored.\r\n\r\n-----------------------------------------------------\r\n::::::::::::::::::Zohar\\'s Class Mod:::::::::::\r\n-----------------------------------------------------\r\n\r\nThe classes included in this mod are:\r\n\r\nAcolyte\r\nAssassin\r\nBarbarian\r\nBattlemage\r\nBlacksmith\r\nEnchanter\r\nFire Mage\r\nIce Mage\r\nStorm Mage\r\nMerchant\r\nSoldier\r\nSummoner\r\nThief\r\n\r\nThis is the basic balancing methodology for the classes:\r\n\r\n-Class specialization skills start at around 40 and have basic perks plus 1 or 2 advanced perks.\r\n-Supplementary skills, for example light armor on a thief, start at around 25,30 and have 1/2 perks.\r\n-Outlier skills, things your class might have known about but doesn\\'t dabble in, start at 10\r\n-Antithesis skills, skills that have absolutely nothing to do with your class, start at 5\r\n\r\nHaving certain skills start extremely low makes sense for balance in two ways:\r\n1. It prevents you from being too overpowered in being able to do everything.\r\n2. It provides you an option for leveling to make up for the \\\"lost\\\" levels on the skills that I boosted.\r\n\r\nEnjoy and if you appreciate and enjoy the hours of work I put into this make sure to endorse the mod :D\r\n\r\n\r\n::HOW TO INSTALL::\r\n\r\nSimply extract the .txt files you wish to use to your Skyrim main directory.\r\n\r\n::HOW TO USE::\r\n\r\nOnce you\\'ve entered Helgan Keep and either Hadvar or Rolaf have cut your ties you will have access to your menus.  All you have to do is open the console with the ~ key and type \\\"bat classname\\\" without the quotes and swap \\\"classname\\\" with the name of the class you want to use and you\\'re done.  Open up your skills menu and check out all of your fancy new skills and perks.\r\n\r\n\r\nSuggested Mods:\r\nAny mods that give you more companions if you want to be an Acolyte\r\nSkyUI\r\nSkip to Character Creation\r\nLeveling Destruction Perks - Strongly Recommended!",
  "categoryId": "34",
  "version": "0.1",
  "author": "Zohar127",
  "createdUnix": "1326252956",
  "updatedUnix": "1326253097",
  "containsAdultContent": false,
  "uploadedBy": "zohar127",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18760",
      "name": "Zohars Class Mod - 14 Balanced Starting Classes",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Zohars Class Mod - 14 Balanced Starting Classes-5909-0-1.rar",
      "uploadedUnix": "1326253097",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/90f88475427571863f991633d7fa6c0fd0b036109798702d937e6fad3f02860d/analysis/1406601938/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zohars%20Class%20Mod%20-%2014%20Balanced%20Starting%20Classes-5909-0-1.rar?fid=18760&ttl=1535763004&ri=8192&rs=8192&setec=8fb27d8e72993dbd1d31fecedee57d56"
    }
  ]
}