{
  "modId": 59105.0,
  "modName": "Tabula Rasa",
  "summary": "Tired of beginning the game as a partially skilled adventurer who rapidly becomes a demigod? Begin your character as a blank slate and level more slowly, giving you time to enjoy your adventures.",
  "descriptionHtml": "[center][size=6]Tabula Rasa V2.1 Released&#33;[/size][/center]\r<br />While there are a couple of plugins that already do something similar, none of them IMO adequately address the problem of starting your character as a complete blank slate and then slow down level progression and development so that you actually [i]feel[/i] like a total inexperienced novice when starting a new character and don&#39;t end up a demigod after a few hours of play. I made this mod to address that issue in my games. With the release of V2.1 I feel that this mod has matured to the point that it now does a good job of providing a more challenging start and keeping level progression slow.\r<br />\r<br />[center][size=6]What does it do exactly?[/size][/center]\r<br />\r<br />1/ All skills begin at 0 instead of 15. The only skills that will be greater than zero with a new character will be racial skills. These represent either childhood training or inherent aptitude. Other than that your new character will be a blank slate.\r<br />\r<br />2/ Skill progression is half speed for ALL skills. Level zero skills should still level up pretty quickly but they will do very little to progress the overall character level. This is intentional since I believe that early skill training should be relatively rapid without pushing the character level up too high. Once you get to standard starting character skill levels (15+) your actual character level shouldn&#39;t be excessive and you will progress at half speed giving you more time to enjoy your many many adventures in Skyrim while you are still relatively low level.\r<br />\r<br />******  If half speed progression is still too fast I have also released 2 optional variants of the mod, 1/4 speed and 1/8 speed (for true masochists). The variants are identical to the main mod aside from the slower progression speed.  ******\r<br />\r<br />3/ A beginning character will start with only 50 in Health/Magicka/Stamina rather than 100 in each. For the next 10 levels (until level 11) you will gain 25 points per level to apply to a chosen stat rather than 10. This means you will start off very weak at level 1, not a hero, just an ordinary Joe / Jane with the same stats as all the other NPC&#39;s and hardly able to cast the most basic of spells even if you knew one - which you don&#39;t. But you will rapidly progress until level 11 where you will have earned the same number of stat points as if you had started with 100 in each stat. From then on skill progression will be as per vanilla Skyrim at 10 pts per level assigned to the chosen stat. It [i]will[/i] be harder at the beginning. That&#39;s the point.\r<br />\r<br />4/ Leveling Non-combat skills will only be half as effective at progressing your overall character level compared to other skills. For the purposes of this mod, non-combat skills are (Alchemy, Enchanting, Lockpicking, Pickpocket, Smithing and Speechcraft). This will allow you to work on these skills to a reasonable degree without the risk of pushing your character level up to the point that the game&#39;s auto-scaling outpaces your combat abilities and you get crushed for being a milk-drinker.\r<br />\r<br />5/ In order to compensate for less perk points due to 4/  you will get 6 perks for every 5 character levels which means that by level 81 you will still have earned roughly the same number of perk points as a normal character (actually a few more).\r<br />\r<br />6/ Starting characters will begin with no spells known except racial spells. For the true Tabula Rasa experience I highly recommend the SpellEraser plugin (get it [url=http://www.nexusmods.com/skyrim/mods/18096/?]here[/url]) so you can erase even racial spells and begin the game as a true blank slate. Another way to achieve the same effect without mods is to start as a Nord and then use the console (showracemenu) to change your race once the game has started. For example if you start as a Nord and then change race to Breton you will [i]not[/i] get the &#34;Summon Familiar&#34; spell although you [i]will[/i] get all the appropriate racial skills and powers for a Breton.\r<br />\r<br />This mod doesn&#39;t address the issue of training as a means of rapid skill progression. You may wish to self-impose training limits to ensure that leveling is more natural although some level 0 skills like pickpocket will probably need a little training before you can do pretty much anything. I believe this is realistic.\r<br />\r<br />[size=6]NOTE: V2.1 now absolutely requires Ely&#39;s Community Uncapper mod to also be installed&#33;[/size]\r<br />\r<br />Installation:\r<br />- First Install the Skyrim -Community- Uncapper by Elys which you can find [url=http://www.nexusmods.com/skyrim/mods/1175/?]here[/url].\r<br />- Then unzip all Tabula Rasa files into the Skyrim/Data folder, overwriting all files including the Uncapper&#39;s .ini file. A vanilla backup (SKSE_Elys_Uncapper - Backup.ini) will also be installed in case you wish to delete this mod and return to the uncapper default settings.\r<br />- If you are using Mod Organizer, make sure that Tabula Rasa Loads after the Uncapper.\r<br />\r<br />Un-Installation:\r<br />- Delete the &#34;SKSE_Elys_Uncapper.ini&#34; file from the Skyrim/Data/SKSE/Plugins directory.\r<br />- Rename the &#34;SKSE_Elys_Uncapper - Backup.ini&#34; file to &#34;SKSE_Elys_Uncapper.ini&#34;\r<br />- Delete the Tabula Rasa.esp file from the Skyrim/Data directory.\r<br />\r<br />Compatibility:\r<br />- Should be compatible with everything except other mods that change level progression and starting level. Placing this mod later in the load order should override them.\r<br />- I recommend starting a new character. This mod may behave strangely if used on an already experienced pre-existing character although it should be reasonably safe to use on a character who has already progressed to at least level 11.\r<br />- The &#34;StartingSpellChoice&#34; plugin WILL definitely clash with this mod. Place Tabula Rasa further down in the load order or it will get partially overwritten and not work properly.\r<br />\r<br />Version History:\r<br />********************************************************************************************************************************************************************************\r<br />V1.0\r<br />- Skills Begin at 0 not 15\r<br />- Skill progression rate is halved.\r<br />********************************************************************************************************************************************************************************\r<br />V2.0\r<br />- Starting characters begin with 50 Health/Magicka/Stamina, not 100. Gain 25 stat points per level for the first 10 levels.\r<br />- Non-combat skills only contribute 50% to character level progression.\r<br />- 6 Perks are gained for every 5 character levels to compensate for Non-combat skills contributing less.\r<br />- Starting characters begin with NO spells, only racial spells.\r<br />*********************************************************************************************************************************************************************************\r<br />V2.1\r<br />- Made some minor tweaks to smooth out the skill progression rate for a starting character. The problem: When skills begin at 0, some level extremely quickly (Eg. 1-Handed) while others take a relatively long time to level (Eg. Sneak). The Solution: Tweaked all skills so that normally rapid skills take a little longer to level and slow skills level a little faster. Really only noticeable for a beginning character with very low-level skills.\r<br />**********************************************************************************************************************************************************************************\r<br />\r<br />Credits:\r<br />- Thanks to the amazingly clever Skyrim -Community- Uncapper by Elys which works in conjunction with this mod to achieve the desired effect.",
  "categoryId": "73",
  "version": "2.1",
  "author": "Lucian",
  "createdUnix": "1413467461",
  "updatedUnix": "1422660745",
  "containsAdultContent": false,
  "uploadedBy": "Lucian6667",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131231",
      "name": "Tabula Rasa v1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Tabula Rasta v1.0-59105-1-0.rar",
      "uploadedUnix": "1413467264",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0e7b11b34a89e54f9963f701e8345d89444e7cdc5b56b9c370f97aa598e03bbe/analysis/1413467346/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tabula%20Rasta%20v1.0-59105-1-0.rar?fid=1000131231&ttl=1535846125&ri=8192&rs=8192&setec=4476fc470f201664088c907afc1f09d5"
    },
    {
      "fileId": "1000133130",
      "name": "Tabula Rasa v2.0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Tabula Rasa-59105-2-0.rar",
      "uploadedUnix": "1414625393",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/d3830dfec2d9833cdcb2af090d32f807acf463ea2d32871af8b655c11b8f00d6/analysis/1414625462/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tabula%20Rasa-59105-2-0.rar?fid=1000133130&ttl=1535846125&ri=8192&rs=8192&setec=2337b6ce8209c25acb54e49f35bb4c2d"
    },
    {
      "fileId": "1000136236",
      "name": "Tabula Rasa v2.1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Tabula Rasa-59105-2-1.rar",
      "uploadedUnix": "1416578403",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/c6a8035acece4c5dad65a78100431bb6c80a6f4d63c7468261af7cb2d9132549/analysis/1416578522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tabula%20Rasa-59105-2-1.rar?fid=1000136236&ttl=1535846126&ri=8192&rs=8192&setec=b7972e31f6929eac880e490fda5020fc"
    },
    {
      "fileId": "1000145293",
      "name": "Tabula Rasa v2.1 Quarter speed variant",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12",
      "fileName": "Tabula Rasa v2.1 Quarter speed variant-59105-2-1.rar",
      "uploadedUnix": "1422660466",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/f32eecace33ae85222963139479eca27dab8c605f7440a9375520d53977ace8b/analysis/1422660483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tabula%20Rasa%20v2.1%20Quarter%20speed%20variant-59105-2-1.rar?fid=1000145293&ttl=1535846126&ri=8192&rs=8192&setec=e8df83da499a0570fe0bf98e91fd6394"
    },
    {
      "fileId": "1000145295",
      "name": "Tabula Rasa v2.1 Eighth speed variant",
      "version": "2.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12",
      "fileName": "Tabula Rasa v2.1 Eighth Speed variant-59105-2-1.rar",
      "uploadedUnix": "1422660745",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/9082d059e7571e3e2f98ed5abd777ed65b8bb99e1ef57ab83bb9663550721849/analysis/1422660782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tabula%20Rasa%20v2.1%20Eighth%20Speed%20variant-59105-2-1.rar?fid=1000145295&ttl=1535846127&ri=8192&rs=8192&setec=2446d97b769d54415fb64dba42f0426d"
    }
  ]
}