{
  "modId": 59115.0,
  "modName": "JUSTICE - City Exteriors",
  "summary": "Adds JUSTICE clutter to the outside of the major cities",
  "descriptionHtml": "[b][size=4][color=#ffff00][url=http://www.goodfellowmodshop.yolasite.com][b]My ModShop[/b][/url][/color][i][url=http://www.goodfellowmodshop.yolasite.com]\r<br />[/url][/i][/size]\r<br />JUSTICE[/b] aims to add immersion by having more evidence of justice being carried out within Skyrim. Prisoners will no longer just be locked away in jail. You will now see corpses hanging outside of city walls as a visual deterrent to any potential law breakers.\r<br />\r<br />I have only covered the major cities and I feel that this makes sense. One could presume that any hold which has overcrowded cells would just ship them off to a major city to have them beheaded or left in a cage to die.\r<br />\r<br />\r<br />[i][u]Each city has different enemies and have their owns ways of dealing with prisoners[/u]\r<br />\r<br />\r<br />[/i][b]Solitude:[/b]\r<br />Everybody knows of the beheadings which happen just inside the city gates, but now solitude can hold prisoners in cages outside of the city who are awaiting justice or need some public humiliation.\r<br />\r<br />Solitude is in a civilized part of Skyrim, the biggest threat here would be local criminals or any captured Stormcloaks soldiers which need putting on display.\r<br />\r<br />\r<br />[b]Whiterun:[/b]\r<br />The city is now equipped to carry out beheadings and has a new platform leading up to the entrance. This isnt solitude. It isn’t uncommon for the victims of the perpetrators to carry out justice themselves (with permission from the Jarl). An everyday woodcutting axe is preferred over a specialist tool. Because of this, the cries of prisoners can be heard some way away from the city as several hacks of the axe are needed to hand out the justice.\r<br />\r<br />Whiterun is overrun by bandits. You will see the victims of failed raid attempts littered on your route into the city.[b]\r<br />\r<br />\r<br />Windhelm:\r<br />[/b]Known for its bitter climate and hatredof the Dark Elves, don&#39;t expect to find any leniency here. In fact, Windhelm probably has the most brutal ways of dealing with criminals. You even have a choice. Do you want to be burnt in a pit and have your skull mounted on a spike for all to see? Or would you prefer to be hung over the bridge and hope you freeze to death before you starve?\r<br />\r<br />Imperial soldiers litter the bridge way into the city, captured in camps or taken from the jail to be finished off. Ulfric hasn’t permitted the imprisonment of the Grey Quarter, (even though most of the city would be in favour of it). However if you are a Dunmer and are up to no good, then don&#39;t expect a prison cell. You either end up dead or frozen in a cage.\r<br />\r<br />\r<br />[b]Riften:[/b]\r<br />The city now has several hanging cages on both entrances to the city. Thats if your lucky. You could always be tied and thrown into the canal to drown.\r<br />\r<br />Riften is full of thieves. The guards may be equally bad as them, but they now hang outside the city as a warning to any one caught with their fingers inside somebodies pockets.\r<br />\r<br />\r<br />[b]Markarth:[/b]\r<br />The Silver-Bloods and the city guard rule the city with an iron fist. However, theres still extra ways of dealing with those who are getting in the way. Hard labour is one, the Cidhna mine. Alternatively just deal with them outside of the city walls. \r<br />\r<br />The Forsworn plague the hold and several raids can happen each month. The city doesn’t even want the bodies of their enemy within their city. They simply stack prisoners into cages which are submersed in the nearby lake. It isn’t uncommon for people to pelt the cages with rocks or even carry out\r<br />their own form of justice while passing into the city.",
  "categoryId": "78",
  "version": "",
  "author": "GoodfellowGoodspring",
  "createdUnix": "1413491335",
  "updatedUnix": "1413491331",
  "containsAdultContent": false,
  "uploadedBy": "GoodfellowGoodspring",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131268",
      "name": "JUSTICE - City Exteriors",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "144",
      "fileName": "JUSTICE - City Exteriors-59115-.rar",
      "uploadedUnix": "1413491331",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d93ef8d6ce32cabaff2a80bb25dfcdda07f872cdc41f94b3f0b39632422044ce/analysis/1413491403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/JUSTICE%20-%20City%20Exteriors-59115-.rar?fid=1000131268&ttl=1535846141&ri=8192&rs=8192&setec=92e1d50ffb2ea4025cdbb3af629c2dca"
    }
  ]
}