{
  "modId": 59118.0,
  "modName": "The Guardians of the North - Chapter 1 - A Nordic Tale",
  "summary": "The Guardians of the North is a new DLC. It gives players the ability to join a brand new faction, it comes along with a brand new fort made from scractch, a new arena, a ranking system, new weapons, armor and 15 new quests and much more.",
  "descriptionHtml": "[b][center][font=Courier New][color=#93c47d][size=5][i]Thank you so much for all the endorsements&#33; This project has been put on hold&#33; I&#39;m currently working on a new DLC Project &#34;The RedGuard Expansion&#34; which will feature a huge new tropical Island made from scratch, a new joinable faction and much more content&#33; Currently looking for voice actors&#33;[/i][/size][/color][/font]\r<br />\r<br />[size=6]The Guardians of the North[/size]\r<br />[s]B.E.T.A[/s]\r<br />[size=6]1.0 Coming Soon &#33;[/size]\r<br />[color=#ead1dc][color=#cccccc]Chapter 2 is coming soon&#33; What to Expect?\r<br />General Adjustments\r<br />Players will have the ability to double cross the Guardians and join the [s]Order of the fallen&#33; [/s](Black Skulls)\r<br />New Raids, Turf Wars&#33;\r<br />New Quests and much more&#33;[/color][/color]\r<br />[b][color=#93c47d][size=5][u]Lore story[/u][/size][/color]\r<br />[font=Lucida Sans Unicode][size=2]The Night is dark and full of terrors, dark days are coming to Skyrim. An Evil warlock named Dante used to study in the College of Winter-hold, he was passionate about magic but he got banned, for using dark forbidden magic,his anger grew like wildfire, and he started his own army, [/size]\r<br />[size=2]and many decided to follow his cause as he had great influence and riches, as he is a great noble from Solitude. He started to delight in wicked deeds, and out of anger and hatred towards the empire and the college of Winter-hold he embraced darkness, and started a very evil sect, the Order of the Fallen. [/size]\r<br />[size=2]Witches, warlocks, and all kinds of foul men and women joined his cause, He also established his own settlement the Black hallows, North west of Solitude. [/size]\r<br />[size=2]With the use of dark magic he is already starting to corrupt the land, the forest is changing, and becoming more corrupted, a foul and dark energy is rising to the North West of Skyrim. People are disappearing, Dante wants to reach immortality, and immortalize darkness he is using humans as Guinea pigs. [/size]\r<br />[size=2]He is also starting a new army of undead creatures. Skyrim is becoming more dangerous and there will never be peace with The Order of the fallen lurking around in the shadows. [/size]\r<br />\r<br />[youtube]ARnBgW5XgSo[/youtube]\r<br />\r<br />[size=3]Richard the Lion heart \r<br />[/size][size=2]started the Guardians of the North, as he is a direct descendant from Gjukar, he built his fort near Gjukar&#39;s monument. [/size]\r<br />[size=2]Richard a war hero, he used to run with the Storm cloaks, and then betrayed them and joined the Imperial army, he felt that the Civil war is pointless, and is only weakening Sykrim. He gathered many allies, family and close friends and decided to move away from the city, as he realized the main cities aren&#39;t safe, as a great evil is rising. He built his own guild, and in honor to his great, great, great grand father, he built a fort nearby where other brave warriors could join his cause, in mainting order and peace in Skyrim. [/size]\r<br />[size=2]The Guardians of the North are not bound to the laws of the government they govern themselves, and Richard has made many enemies in Skyrim. [/size]\r<br />[size=2]His fort started to produce much gold, and it was a success. [/size]\r<br />[size=2]Many joined his cause as he saw it was a righteous act, and a glorious guild that was founded in the basis of honor and respect. Richard is naturally a born leader, and natural warrior. [/size]\r<br />[size=2]The Guardians of the North are the North watch, brave warriors of the North. There are other clans and factions rising in Skyrim as well, The Nordic Outlaws are Kings of the Reach, or so they think, they are hungry for power, and want to take the North Watch for themselves and want the Guardians of the North Eliminated, they claim they are the native people of Skyrim, and they take what they want when they want it. [/size]\r<br />[size=2]The Butchers started by Richard&#39;s right hand man Desmond, another evil leader who envies Richard&#39;s success wants to take over the fort, and rule it for himself. [/size]\r<br />[size=2]Dark days are coming to Skyrim, an evil conspiracy is at hand, will you rise up to face the new threat, and uncover a new conspiracy in Skyrim. [/size]\r<br />[size=2]Will you be successful in climbing up the ranks of the Guardians and become a hero? Many get to become a Guardian of the North but only a few get to join the Inner circle. To be a Guardian of the North means to stand against the grand opposition, it means to accept contracts that other guilds will simply not accept, it means to conquer your enemies and rule the land. It means to be a brave warrior of the North. \r<br />\r<br />[youtube]U-DgULZvWUs[/youtube][/size][/font][/b][/center][b][font=Courier New][size=2]\r<br />[/size][/font][/b][/b][center][b][font=Comic Sans MS][size=6]Want to join a new Faction?\r<br />[/size][/font][/b]Would you like to join a brand new guild? Do you crave more action and warzones in Skyrim? Do you\r<br />favor the bow? Would you like to experience unique raids from unique enemies\r<br />and monsters? Would you like to live in a brand new fort, in the middle of\r<br />nowhere away from the main cities with a whole new community? Do you want\r<br />to be valued, admired and looked up too, as you rise through the ranks of the\r<br />Northern Guardians and become a hero? Do you wish to meet new and interesting characters?\r<br />Do you miss the action from the Arena in Oblivion and would you like to re live\r<br />your glory days in the arena? Do you want more fun and interesting quests\r<br />loaded with action? Would you like to participate in raids as you defend the\r<br />fort and protect your allies from a great evil rising upon the land? Would you like to uncover a whole new\r<br />conspiracy in Skyrim which stays faithful to the Skyrim lore? If you answered\r<br />yes to any of these questions, then this mod is for you.\r<br />\r<br />[b][size=5]HIGHLY RECOMMENDED MODS[/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/43107/?][size=4]V[/size][/url][/b][size=4][b][/b][b][url=http://www.nexusmods.com/skyrim/mods/43107/?]ivid Landscapes - Imperial Forts by [b]Aron[/b][/url][/b][/size][/center][center][b][font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/27371/?]Better Dialogue Controls by [b]ecirbaf[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/28170/?]Better MessageBox Controls by [b]ecirbaf[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/17214/?]No Spinning Death Animation by [b]dDefinder[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/22287/?]Skyhighrim - Craftable Drugs by [b]Ichibu and Minty[/b][/url][/size][/font][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/60/?]Enhanced Blood Textures by [b]dDefinder\r<br />[/b][/url][url=http://www.nexusmods.com/skyrim/mods/2666/?]Caliente&#39;s Beautiful Bodies Edition -CBBE- by [b]Caliente[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36510/?]Superior Lore-Friendly Hair - HD textures by [b]skyrimaguas\r<br />[/b][/url][url=http://www.nexusmods.com/skyrim/mods/54007/?]Valiant Nord Bow by [b]Corvalho[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/23780/?]LC_Assassin of Shadows Armor by [b]Locaster[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/58394/?]Kinoko Pose by [b]cryptoporus[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/57870/?]The Huntsman by [b]InsanitySorrow[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/31002/?]Insanitys Shields by [b]InsanitySorrow[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/48287/?]Animated clutter by [b]JackMorris[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24750/?]Rizings Bow Collection by [b]Rizing[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/22674/?]Nernies Ranger Pack by Nernie[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49747/?]Wisp Mother HD Retexture - Quartz Atronach by [b]Rengel[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/57691/?]Wisp Mother Retexture by [b]Billyro\r<br />[/b][/url][/center][center][font=Comic Sans MS][size=5][b]FEAUTURES:[/b][/size][/font]\r<br />New Joinable faction\r<br />4 New Factions each organization is set to have their own allies and enemies within the world of Skyrim.\r<br />Over five hundred lines of unique dialogue.\r<br />15 Quests fully voiced.\r<br />New player home &#34;cabin&#34;\r<br />“The North Watch” a brand new fort made from scratch. \r<br />“Black Hallows” a new Settlement.\r<br />New Raids, Gang Wars and turf wars.\r<br />Unique weapons, armors and shields.   \r<br />New Rewards, Horse glows with blue fire (Unlocks After you complete Desired Rage)  \r<br />and much more&#33;[/center][center][/center]\r<br />[center][font=Comic Sans MS][color=#cc0000][size=5]BASIC DETAILS[/size][/color][/font]\r<br />\r<br />The Guardians of the North is a new DLC, which brings a total of 15 new quests’ that will keep you\r<br />on the edge of your seat. This mod adds 4 new factions, unique weapons, and\r<br />unique armors. Players will also receive a brand new fort made from scratch,\r<br />and a new settlement called “Black Hallows” with new Houses, monsters and\r<br />enemies. This mod aims to bring a brand new experience to Skyrim. Experience\r<br />combat in a whole new way in the Guardians of the North. Those who favor the\r<br />bow will surely get their archery fix with this mod. In this mod you’re in\r<br />control and as you rise through the ranks you become highly important and\r<br />needed in this guild. Members of the guild will start sending you letters, some\r<br />will admire you so much that they will start following you around, and stalk\r<br />you. After you reach a certain rank. This mod adds many raids, often times\r<br />players will have to defend the fort from invaders who want to take over. This\r<br />mod also provides unique and fully voiced characters. \r<br />\r<br />All quests are fully\r<br />voiced. This brand new DLC also brings back the arena experience into Skyrim,\r<br />not only will you be doing quests, but you will be getting noticed. \r<br />People are watching you in this mod, they will\r<br />react to your actions and comment on your quests. The unique characters in this\r<br />mod will notice you even more once you start doing quests and climbing the\r<br />ranks of the Guardians. This mod makes players feel wanted, and highly\r<br />important. There are also unique gifts and rewards such as a brand new cabin\r<br />along the beautiful coast of the western side of Skyrim. \r<br />\r<br /> \r<br />\r<br />When the player reaches the rank of agent,\r<br />the leader of the Guardians also rewards the player with a special room\r<br />reserved only for heroes, within the North Watch Keep. There are also unique\r<br />quests in this mod. Each quest in this mod was very well thought, and were\r<br />designed to bring back more action and fun, especially immersion. The Guardians\r<br />of the North also have their own AI packages, each member has their own AI\r<br />package and their own daily routine they are smart their not just static NPC’s\r<br />they have a life of their own, theirs things to do in the North Watch Fortress,\r<br />some players will practice their combat skills on archery targets, others who\r<br />favor the sword will swing their blade on dummies, others have potions and trinkets\r<br />to make for the guild, etc. Each members plays a role in the guild they have a\r<br />schedule. Most members in the guild are\r<br />eager to improve in the guild, some desire to stay at the front line an guard\r<br />it all night from possible invader’s, most members in the guild want to impress\r<br />the inner circle, and fight hard in the front line.\r<br />\r<br />Many people want the Guardians of the North eliminated. \r<br />Every quest is unique and one quests leads to\r<br />another. Players will surely get a dopamine effect playing this mod. So what\r<br />are you waiting for? Join a new faction, participate in the butchery of your\r<br />enemies, prove yourself to the Guardians of the North, fight hard to gain\r<br />access to the inner circle, become part of a new and interesting guild, uncover\r<br />a new conspiracy, rise through the ranks of the Guardians, become a hero and\r<br />defend the North from a great evil that is rising upon the land. Become the\r<br />North Watch&#33; Become a Guardian of the North&#33; \r<br />\r<br />[youtube]Ra4lgzlnKmY[/youtube][/center]\r<br />\r<br />[center]\r<br />\r<br /> [color=#cc0000][size=4][u]Locations:\r<br />[/u][/size][/color]Locations:\r<br />The North Watch Keep (Guardians Base) is located near Gjukar&#39;s monument, South East of Rorikstead.\r<br />Turf War, Order of the Fallen Vs Northern Guardians/ New Settlement Black Hallows (North West of Solitude) South West of the Grotto\r<br />Pilgrims Trench, North West of Winterhold - Where you retrieve Jack&#39;s missing package, the Butchers are looking for it.\r<br />Turf War - Guardian Camp - Northern Guardians Vs Nordic Outlaws West of Rebel&#39;s Cairn\r<br />Turf War Nordic Outlaws Vs Northern Guardians (Drela&#39;s Cottage)\r<br />Gang War The Order of the Fallen Vs Northern Guardians (North Shriekwind Bastion)\r<br />Turf War - Northern Guardians Vs Nordic Outlaws (Cliffside Retreat)\r<br />Turf War Northern Guardians Vs Nordic Outlaws(White River Watch)\r<br />Solitude Cementary - Northern Guardians Vs Butchers\r<br />Many Raids including Skeletal dragon attack on the fort itself \r<br />(Nordic Outlaws Respawn in the raid for now)\r<br />All Turf Wars and Gang Wars are set to Respawn\r<br />[font=Lucida Sans Unicode][size=5][color=#cc0000][b][u]\r<br />The Inner Circle [/u]  [/b][/color] [/size][/font]    \r<br />The Guardians of the North are not dummies, they keep their doors locked, and they simply don&#39;t let stranger in, you have to prove yourself to the Guardians to gain access to their fort and their resources. The Inner circle are the figures that hold the most power within the guild. To be accepted into the inner circle is to hold great honor and a great influence in the guild. Many become Guardians of the North, but only a few get to join the inner circle.[/center]\r<br />\r<br />\r<br />\r<br />[center]\r<br />[font=Comic Sans MS][color=#ff0000][size=5][b]MAIN QUESTS: [/b][/size][/color][/font]\r<br />[u][size=3]1. Joining the Guardians of the North –[/size] [/u]\r<br />You are to prove yourself to the Guardians of the\r<br />North by killing two members of the Order of the Fallen \r<br />\r<br />[u]2. Proving Grounds – [/u]\r<br />Some Rangers captured a bear, it’s up to you, to take the bear out and\r<br />impress the guild. \r<br />[u]3. A Butcher&#39;s lament– [/u]\r<br />Some butchers got into a squabble with Wulfgard, he knocked them out cold, and\r<br />brought him into the arena. If you want to move up in the rank and join the inner\r<br />circle, you’ll have to beat the butchers in the arena.\r<br />\r<br />[u]4. Courage of the Fearless - [/u]\r<br />The Guardians captured some members of the Order of the Fallen, If\r<br />you want to move up in rank, you’ll have to step into the arena and take them\r<br />out. \r<br />[u]5. The Kings of the Reach – [/u]\r<br />The Nordic Outlaws think they’re the Kings of the Reach, and act like\r<br />everything belongs to them. They claim that Richard built his fort in their\r<br />soil, they want him to give up the fort, and bend over to their cause. The Leader\r<br />of the Nordic Outlaws tries to intimidate Richard, but Richard isn’t scared of\r<br />the Nordic Outlaws, they are on their way to take over the fort, and it’s up to\r<br />the Guardians of the North to save the day. \r<br />\r<br />[u]6. Whispers of Violence – [/u]\r<br />The Order of the Fallen wanted to be allies with The Guardians of\r<br />the North, Devin extended an invitation, but Richard the lionheart refused. The order of the fallen have a\r<br />strict rule and that is join us or be killed. Devin sent some members to take\r<br />over the fort, and kill everyone; it’s up to the Guardians of the North to\r<br />defend the fort. \r<br />\r<br />[u]7. Tainted Perception- [/u]\r<br />After the raid&#33; Blade & Richard want more answers&#33; They want to know\r<br />where their Headquarters are so they can infiltrate them, and exterminate their order.\r<br />Blade said that a recent captive escaped and took along with him a very\r<br />important journal, which has important information on the Order Of The Fallen,\r<br />Blade has sent many Guardians but not one has returned, he has trusted the player with\r<br />a top secret mission, you are to kill Seth and bring back the journal in which\r<br />exposes the plans of the Order Of The Fallen. \r<br />\r<br />[u]8. Dreams of Purity – [/u]\r<br />Bella,Richard’s wife was murdered by a person Richard once considered an ally. Devin\r<br />is a nutcase and got denied by Bella he tried desperately to date her but Bella\r<br />turned him down, Devin couldn&#39;t manage his emotions and went on a rampage\r<br />killing a few members of the guild including Bella. \r<br />\r<br />[u]9. A Butcher&#39;s Envy -[/u]\r<br />Richard has received a letter from Desmond the leader of the Butchers Gang&#33;\r<br />Richard used to be his right hand man, and partner in crime, back when they\r<br />were young lads. Desmond grew apart from Richard, and after Richard started\r<br />becoming more successful and started his own guild Desmond started feeling\r<br />jealous. Desmond offered Richard a chance to join his new gang but Richard had\r<br />better plans. Desmond grew wicked, and started to envy Richard. He offered one\r<br />last chance to become his ally, but Richard refused his offer to join him in\r<br />his affairs, Desmond is now marching with a gang of butcher&#39;s to take over the\r<br />fort, you must defend the fort and kill Desmond&#33;  \r<br />\r<br />10. Forsaken Assault -\r<br />Jack, Raven and Wulfgard avenged Antonia&#39;s parent&#39;s.\r<br />Some drunken Storm cloak’s killed them for a hurl of insult&#39;s from\r<br />Antonia&#39;s father, in return some corrupted Storm cloak Officials marched into\r<br />Antonia&#39;s old house and butchered her whole family. The remaining Storm cloak’s\r<br />that survived the Guardian Raid are on their way to take over. You are to defend\r<br />the fort from the Corrupted Storm cloaks.  \r<br />\r<br />11. Desired Rage - The time has come to defeat Dante the leader of the Order of the Fallen, if you fail\r<br />to put him down, he will establish a new nation of darkness, he is kidnapping\r<br />innocent humans and creating an army of undead creatures, The Guardians of the North must stop him at\r<br />all costs. \r<br />\r<br />[youtube]4sfhbm0xNOc[/youtube][/center]\r<br />\r<br />[center][size=5][b][font=Comic Sans MS] [/font][font=Lucida Sans Unicode][color=#6aa84f]SIDE QUESTS[/color][/font][/b][/size]\r<br />[u]1. Hunt or Be Hunted -[/u]\r<br />Sigrid claims that the guild is running out of fur, she needs some fur for the\r<br />guild, without fur the members will all freeze to death in the winter. The player must go out hunting and retrieve some fur.\r<br />\r<br />[u]2. Unfinished Business– [/u]\r<br />Jack got involved a drug deal, gone wrong, Northwest of Winter hold, he was\r<br />outnumbered and had to flee for his life, the package slipped in the freezing\r<br />cold water and is buried underneath the ocean. You will have to battle some\r<br />butchers, and dive into the cold waters of Northern Skyrim to recover Jack’s\r<br />drug shipment&#33; \r<br />\r<br />[u]3. Son’s of Skeevers -[/u]\r<br />Raven got robbed by some Butcher&#39;s&#33; They stole his moon sugar package. Rumors\r<br />are the Butcher&#39;s are hanging around the Solitude Market&#33; Raven promises to\r<br />split the shares in half and give the player some coin.\r<br />\r<br />[u]4. Peace in Death -[/u]\r<br />Arad came running from the hills, some members of the guild got ambushed by the\r<br />Nordic Outlaws&#33; You must check on the camp and make sure the other members are\r<br />safe. This is your opportunity to impress the guild and reach the next level. \r<br />\r<br />[youtube]SGHPCuqjuWY[/youtube] [/center]\r<br />\r<br />[center][font=Comic Sans MS][size=6][b][color=#ff0000]NEW FACTIONS [/color] [/b][/size][/font]\r<br />\r<br />[font=Comic Sans MS][size=5][u]The Guardians of the North[/u][/size][/font]\r<br />\r<br />The Guardians are highly trained, brave warriors of the North, many fear their legacy. \r<br />The Guardians of the North\r<br />are brave and fearless. their tales are glorious and hard to believe. \r<br />The Guardians of the North are considered to be master\r<br />minds, and extremely dangerous. They not only train and fight but they also\r<br />acquire knowledge and socialize with the Scholars, constantly expanding their\r<br />wisdom. The Guardians are the North watch&#33; They maintain order and bring\r<br />balance to Tamriel, these brave warriors keep an eye on everything that happens\r<br />in the North, but they are not limited to the North. \r<br />\r<br />The guardians are very strong in nature, \r<br />their one of the most talented warriors in the north. They have\r<br />performed many jobs and contracts in other places such as Valenwood, Morrowind,\r<br />Hammerfell, High Rock, and Cyrodiil. They have killed many monsters, and evil\r<br />assassins and warriors, many wish to destroy the Guardians, but the Northern\r<br />Guardians stand united and firm against any opposition that want to destroy\r<br />their order. These brave and talented warriors never back down from a fight.\r<br />The Guardians are also well connected with the underground in which gives them\r<br />access to high quality merchandise. Many want to join the Guardians of the\r<br />North, but only a few are elected and trusted within the inner circle. The\r<br />Guardians of the North are independent from the government and govern\r<br />themselves. The Guardians of the North fight for liberty, power and control.\r<br />They rather die like Kings than live like peasants. \r<br />\r<br />Nobody is born a Guardian; \r<br />one must fight hard to become a man of integrity and honor&#33; The\r<br />Guardians of the North are the few, the brave and fearless, they accept\r<br />contracts, which other guilds would rather avoid. The Priority for a Northern\r<br />Guardian will always be the women and children. The Guardians of the North are\r<br />involved in many activities, such as killing demons, witches, evil monsters,\r<br />and anything that poses a major threat to Planet Nirn. To become a Guardian of\r<br />the North means to stand against the grand opposition, it means to stand with\r<br />prestige and honor in the midst of chaos, it means to charge into battle\r<br />without hesitation or fear, it means to conquer your enemies and their land and\r<br />stand victorious. The Guardians of the North will always help maintain the\r<br />peace and order in Skyrim. Many believe that without the Guardians of the\r<br />North, Tamriel will crumble. The Guardians are protectors, and brave warriors\r<br />of the North.  [/center]\r<br />\r<br />[center][font=Courier New][color=#000000][size=5][b][u]The Order of the Fallen[/u][/b][/size][/color][/font]\r<br />\r<br />\r<br />The Order of TheFallen, are evil mages, witches, necromancers, and the greatest evil that could\r<br />ever exist. A dark and foul energy is rising in the North&#33; While many sleep, a\r<br />great dark spirit rises. These are dangerous times. The Order of the Fallen is\r<br />taking over Tamriel, they have killed thousands of innocent people, and their\r<br />master is a ruthless tyrant.\r<br />This Dark Order was created by a dark mage. \r<br />Lord Dante got banned from the College of Winter hold for using\r<br />dark forbidden magic. His anger and frustration grew like wild fire, Lord Dante\r<br />embraced darkness and acquired much power, he is trying to reach immortality,\r<br />he wants to immortalize darkness, and wants to rule Tamriel with an Iron fist.\r<br />He is also starting to corrupt the land deep in the north, he is using humans\r<br />as guinea pigs, and experimenting on humans trying to gain immortality. He is\r<br />tampering with forbidden magic, and is feared across Tamriel.\r<br />The Order of the Fallen is a very dangerous organization; they work directly with the evil spirits\r<br />and with the darkest most hated creatures of mankind. The Order of the fallen\r<br />are completely devoted to darkness, and have already started corrupting their surroundings,\r<br />they kill anyone who goes against them. The night is dark and full of\r<br />wickedness. Tamriel will never be a peaceful, stable land with the Order of\r<br />the fallen lurking in the shadows.  [/center]\r<br />\r<br />[center][font=Lucida Sans Unicode][color=#6aa84f][size=5][u]The Nordic Outlaws[/u][/size][/color][/font]\r<br />\r<br />The Nordic Outlaws are very dangerous, they are natives of the land, they are very selective of who\r<br />they let into their circle. The Outlaws are renegades and fugitives wanted by\r<br />the government. They take what they want when they want, they are currently at\r<br />war with the Guardians of the North, and envy their success. The Nordic Outlaws\r<br />have killed and robbed thousands. The Government has placed a large bounty on\r<br />mostly all the members of the Nordic Outlaws. Making them one of the most dangerous organizations in all of Tamriel   \r<br />\r<br />[font=Georgia][color=#ff0000][size=5][u]The Butchers [/u][/size][/color][/font]\r<br />\r<br />The Butchers are extremely cruel and evil, they are thieves and deadly assassins, and the gang\r<br />was formed by a former pickpocket who grew up in the streets of Solitude. The Butchers are mainly, mercenaries, and men who served in the Imperial army, and can&#39;t get used to living a regular lifestyle. The Butchers are ruthless bandits, they often look for a reason to kill, and find pleasure in killing. The Butchers are insane.\r<br />\r<br />\r<br />\r<br />[youtube]K1b8AhIsSYQ[/youtube][/center]\r<br />[center]\r<br />[font=Times New Roman][color=#741b47][size=5][b][u] Characters[/u][/b][/size][/color][/font]\r<br />\r<br />Richard the Lionheart: \r<br />\r<br />Richard is very fierce, he loves to wage war. Many think he’s a war\r<br />junkie. Richard is a direct descendant of Gjukar the brave warrior. \r<br />He fell along with his comrades on the east\r<br />side of the reach; their monument is a remembrance of their heroic act. As a\r<br />descendant of Gjukar Richard is a talented warrior by blood, many call him the\r<br />Lion heart because he’s bold and strong and at the age of 17 he killed his\r<br />first lion with his bear fist, Richard is very aggressive and is known to kill\r<br />anyone who double crosses him, Richard is not one to trifle with. He directs\r<br />the Guardians of the North, \r<br />and established the organization. \r<br />\r<br />Antonia: \r<br />Antonia isthe Merchant of the Guardians of the North, she is very loving and friendly, and\r<br />she never killed a person in her life, and avoids combat. Antonia supports the Guardians\r<br />of the North. She started her own shop at the North Watch keep with the help of\r<br />Raven. The business started blooming, and Antonia has made much more profit\r<br />allowing her to get even more quality products, it is Antonia that brought the robes,\r<br />swords and the unique bows to the guild, before the guild only had junk and a\r<br />bunch of steel weapons that were rusty. Many guys want to get with Antonia but\r<br />don’t think of flirting with Antonia as they think Antonia and Raven are\r<br />dating, but in fact their just really close friends. Antonia&#39;s parents were not\r<br />rich or neither poor, they are nobles, and belong to the middle class. Her parents\r<br />were merchants and had their own shop in Solitude before they were butchered by\r<br />some drunken Corrupted storm cloaks. After her parents died Antonia lived a\r<br />very reckless life. She is very close to Raven as they grew up together Raven\r<br />and Wulfgard invited her to join the guild. She has a very positive energy and\r<br />makes sure the members have their swords and armor before stepping into battle.\r<br />Even though Antonia&#39;s merchandise can be a bit expensive, you can be assured\r<br />that the product is of high quality. \r<br />\r<br />\r<br />Jack \r<br />\r<br />is very wild in nature. Jack is a red guard; he was born in Riften in the Orphanage.\r<br />Jack’s mother was a hooker from Riften, and was really young when she had Jack,\r<br />she simply couldn&#39;t afford having a baby so she left him in the front door of\r<br />the orphanage. Jack grew up to be a nice kid, but as he grew up and found out\r<br />about his past he got very rebellious and angry. Jack used to be a bandit, he\r<br />lived with bandit outlaws and used to be a stick up cat, he would mug people for all\r<br />the gold they had, until one day, he was caught mugging someone near Whiterun\r<br />some guards caught him and he served two years in the Whiterun prison, after\r<br />that Jack knew he needed a change, Richard knew Jack and heard about his jobs,\r<br />he looked beyond his past mistakes and saw something good in Jack, so he\r<br />offered him an invitation and Jack is now one of the best members the guild has\r<br />got to offer, with Richard’s permission Jack also started the arena business in\r<br />the Fort. Jack is the drug junkie of the Guardians, he sells skooma and moon sugar,\r<br />and is a high drug user, nobody dares to tell him anything, and even though the\r<br />Guardians of the North don’t fully support drug dealers or drug usage, they do\r<br />believe in free will, The Guardians of the North are free spirit’s and don’t\r<br />judge anybody for their personal or recreational activities. Jack is one of the\r<br />main figures in the guild; he gets things done, and is on the ground floor when\r<br />all hell breaks loose, Jack is the first one on the front line, ready to get\r<br />first blood. Jack has gotten into many problems with bandits and mainly the\r<br />butcher’s gang he’s been involved in many drug deals, and many  bandits and butcher’s want his head on a pike.\r<br />\r<br />Raven \r<br />\r<br />Raven was born in Solitude, his parent’s moved back to hammer fell, as they missed their\r<br />native land and they couldn&#39;t handle the cold weather. Raven loves Skyrim and\r<br />so he stayed behind. Raven is the person everyone loves in the guild; he’s\r<br />attractive, young charming and unites everyone together. Raven is a free\r<br />spirit, but don’t let his kindness fool you, he’s very dangerous. He served in\r<br />the Imperial army, in which changed him. Raven is also involved in the drug\r<br />trade business together with Jack. Raven is very loyal and social, he’s really\r<br />close to Antonia as they grew up together, and he also has a mysterious side.\r<br />Raven is young and wants to explore planet Nirn he has many ambitions and\r<br />desires, and joined the guild to re live his glory days in battle. Raven\r<br />couldn&#39;t get used to the normal life in Solitude. \r<br />\r<br />Patrick\r<br />\r<br />Patrick is 34 years old, he is very aggressive and smart he’s an Imperial from Cyrodiil he\r<br />used to be a mercenary, and had to flee from Cyrodiil as he ran into trouble\r<br />with the government in the Imperial city, many people wanted his head and were\r<br />looking to kill him. Pat decided to flee to Skyrim, and met Wulfgard who\r<br />offered an invitation to join the Guardians of the North.\r<br />\r<br />Vladimir\r<br />\r<br />Vlad is that mysterious guy that always keeps to himself he’s a loner, and spends most of\r<br />his time in the Crypt; he gave up on society, and rather keep to himself. He\r<br />rarely ventures outside; he thinks that one can avoid many problems by refusing\r<br />to go outside. He makes potions and trinkets for the guild, he also does the\r<br />dirty work nobody else desires to do in the guild, such as interrogation,\r<br />torturing the enemies, and making them squeal. Blade and Richard found Vladimir\r<br />hanging by a tree and brought him into the guild, many times Vladimir wishes\r<br />they would have left him there, as he lost his wife, she can be found in the\r<br />table in the crypt, he’s nearly gone insane trying to revive her corpse but to\r<br />no avail. Most members rarely visit Vladimir, other members don’t even know\r<br />Vladimir exists, as he keeps a very low profile and doesn&#39;t like to be bothered.\r<br />\r<br />\r<br />Sigrid: \r<br />\r<br />Sigrid is an Imperial from Anvil she is very nice and has a soft spot for animals. She loves\r<br />sailing, fishing and enjoys a good hunt from time to time. She makes sure the\r<br />guild has enough fur, ingots, linen, and leather strips and useful materials,\r<br />she also serves as the blacksmith, and helps craft important materials for the\r<br />guild. She’s always rambling about raids and such, and always sleeps with one\r<br />eye open. She cares about the members of the guild, and wants the best for the\r<br />guild.\r<br />\r<br />Blade:\r<br />\r<br />Blade is the second commander of the Guardians of the North, he’s very aggressive and likes\r<br />humiliating the enemy in battle, he always has to be right, and he always has\r<br />to win the battle. Blade is also involved in the trading of skooma and moon\r<br />sugar, he sleeps with bottle’s of mead and skooma next to his bed. He says it\r<br />helps him with the stress and rough experiences he had in war. Some think he’s\r<br />a drug junkie but nobody would dare to confront him on his habits, as he gets\r<br />the job done, and would kill anyone that would double cross him, or insult him.\r<br />\r<br />\r<br />Alexander\r<br />\r<br />is a brave Nord warrior; he used to be a Storm cloak before joining the\r<br />Guardians. He’s currently trying to impress the sister’s of Richard the Lion\r<br />heart, that’s why he prefers to stay and defend the front line, he’s full of\r<br />ambition, and is constantly trying to improve. \r<br />\r<br />\r<br />Sariel\r<br />\r<br />   is 29 years old she grew up as a Nordic peasant in Riften with the common rift raft.\r<br />Her parent’s left her in the orphanage as well, she was there with Jack but\r<br />they rarely speak about it, as their trying to forget that chapter in their\r<br />life. Sariel is very aggressive, and she enjoys being in the front line, she’s\r<br />been hit with arrows, and has bled for the guild she’s been close to dying in\r<br />the front line, as she’s the only lady in the front line along with Sigrid, but\r<br />she would take an arrow any day for the members of the Guardians of the North,\r<br />she takes the guild very serious.\r<br />\r<br />Yvahna\r<br />\r<br />Yvahna is half Breton and half nord, She is 21 years old, she is Richard’s little sister,\r<br />Richard likes keeping her close, and told her to move with him to the inner\r<br />circle once his wife was butchered by Devin. Richard has a very soft spot and\r<br />is very emotional when it comes to his sisters and his daughter. Yvahna is\r<br />trying to be the best she can be, and is willing to follow you; she wants to\r<br />prove to Richard that she has what it takes.\r<br />\r<br />Atheena: \r<br />\r<br />She is 36 years old and is Richard’s eldest sister; the guild means everything to her.\r<br />She keeps a close on eye on every new member that joins the guild, as she wants\r<br />to keep it exclusive, and she does not desire to have strangers in the guild\r<br />that would later turn their back on the Guardians, she desires loyalty more\r<br />than anything. Atheena admits that she is one with the shadows. She’s a sneaky\r<br />character, she’s a delicate flower, but her thorns are deadly, at first she\r<br />stalks you when you join the guild and she studies everything about you, and\r<br />appears when you least expect it.\r<br />\r<br />Jane \r<br />\r<br />is a footpatrol she is new in the guild and still has much to learn, after you complete\r<br />Whisper’s of Violence she admires you so much and starts following you around,\r<br />as she wants to study everything about you, and be like you. Jane is very young;\r<br />she’s only 19 years old. Her chances of survival are minimal she mostly spends\r<br />her time in the North Watch cavern, as she finds Malik very amusing.\r<br />\r<br />Malik \r<br />\r<br />is a Khajit he is very dangerous, and he sells weapons, armors, and teleportation spells. He\r<br />wants the best for the guild and he tries to stay out of trouble, he likes\r<br />to avoid drama and stays out of other’s people business. He mostly keeps to\r<br />himself.\r<br />\r<br />Selina\r<br />\r<br />is a female Nord she is 32 years old, and she is the chef for the Guardians of the North,\r<br />she is Richard’s cousin she makes sure, breakfast, lunch and dinner is served every\r<br />day, she sells potions and food to keep the members of the guild strong and\r<br />full of energy. She loves being part of the guild, and doesn&#39;t see herself anywhere\r<br />else.\r<br />\r<br />Alice\r<br /> is 12 years old she’s Richard’s daughter she always follows Selina around and likes\r<br />being around Antonia and Raven. She is very funny, and has a kind heart;\r<br />Richard is very overprotective over her.\r<br />\r<br />Ronald: \r<br />\r<br />Ronald is 52 years old, he’s Richard’s uncle and he is the blacksmith for the Guardians of\r<br />the North, he’s very close to Richard and Selina.\r<br />\r<br />Arad \r<br />   is 27 years old; he’s constantly around the hot spots, and engaging in turf wars. He’s\r<br />always out looking for trouble in the enemies’ territory trying to impress the\r<br />guild, he’s very eager to reach the rank of hero in the guild.\r<br />\r<br />\r<br />Sebastian: \r<br />\r<br />He guards the door to the North Watch Keep. He’s in charge of handling the new recruits.\r<br />Sebastian is very rude and selfish. Many believe he’s only in the guild for\r<br />the coin, and could care less about anyone in the guild\r<br />\r<br />Leonidas\r<br />\r<br /> is 42 years old, he’s a Nord and used to be a Skyrim thug, in other words he’s a\r<br />troll, and he could care less about anything&#33; He always tries to mug the new\r<br />recruits, everyone has gotten mugged by Leonidas, except Jack, Blade and\r<br />Wulfgard, Leonidas knows who to target, he always tries to intimidate the new\r<br />recruits, and those who seem to be weaker than him.\r<br />\r<br />Raddin: \r<br />is 35 yearsold he is a Redguard and is also another Skyirm thug, and is in the guild for\r<br />the coin. Him and Leonidas used to be bandits in Skyrim, mugging anyone they could\r<br />to stay alive, and survive the harsh winters in Skyrim. These two are trouble,\r<br />and want to get rich as quick as possible.\r<br />\r<br />Bjorn: \r<br />\r<br /> is 20 years old. He’s a Breton from High rock,his parent’s always looked down on him, \r<br />and told him he was never good at\r<br />anything, his friends always said he was a coward. Bjorn claims he\r<br />can talk to wolves, and enjoys the company of animals, some think he&#39;s a bit loony he thinks animals are\r<br />better than people, and is tired of being treated like a nobody so he ran away from High Rock and heard about the Guardians of\r<br />the North, he tries hard to impress the guild, he wants to fit in, and wants to\r<br />accepted. \r<br />\r<br />[font=Lucida Sans Unicode][color=#cc0000][size=5]Requirements[/size][/color][/font]\r<br />Skyrim.esm\r<br />Latest update 1.9\r<br />\r<br />[font=Comic Sans MS][color=#0000ff]CREDITS [/color][/font]\r<br />[url=http://www.nexusmods.com/skyrim/users/714867/?]Jedo_Dre [/url]for the [url=http://www.nexusmods.com/skyrim/mods/32988/?]Historical Revival - The Roman Era\r<br />[/url]Facial Piercings by [b]Regn[/b]\r<br />[url=http://www.nexusmods.com/skyrim/users/258945/?]Insanity Sorrow[/url] - For the Bastard Sword, Insanity&#39;s Shields, tapestries, the red rug, art tapestries. etc\r<br />[url=http://www.nexusmods.com/skyrim/users/936576/?]breti[/url]for the amazing Rochester World Modder Resource\r<br />[url=http://www.nexusmods.com/skyrim/users/2775819/?]Locaster[/url] - For The Assassins Hood used in this mod\r<br />[url=http://www.nexusmods.com/games/users/5568570/?tb=mods&pUp=1]RichardPellets[/url]from the Paxton series for voice acting Patrick and Dante\r<br />Sorapis for voice acting Sigrid\r<br />[url=http://www.nexusmods.com/skyrim/users/2959649/?]newermind43[/url]for the amazing mask and sword used in this mod, it&#39;s from the Soul collector armor.\r<br />[url=http://www.nexusmods.com/skyrim/users/2845280/?]GendunDrup[/url]Gendundrup for the Nexus Creature Resource\r<br />Vicn for the Vicn Creature Resources\r<br />[url=http://www.nexusmods.com/skyrim/users/8097062/?]OutbreakDV[/url] and MTindle - For the Albion Swords - The Chieftain \r<br />[url=http://www.nexusmods.com/skyrim/users/2331459/?]futoshisan[/url] for the Creepy zombies\r<br />[url=http://www.nexusmods.com/skyrim/users/866434/?]Nernie[/url] - For the Nernies Ranger Pack\r<br />[url=http://www.nexusmods.com/skyrim/users/3100441/?]L0rd0fWar[/url] for the Witcher 2 Models redxavier for the Witcher 2 Shield Pack\r<br />[url=http://www.nexusmods.com/skyrim/users/3561439/?]d2web[/url] for the Skull Helmets\r<br />[url=http://www.nexusmods.com/skyrim/users/7402811/?]steelfeathers[/url]  for the Death&#39;s Head - Skull Mask\r<br />Rizing and [url=http://www.nexusmods.com/skyrim/users/820158/?]jjim83[/url]for the Rizings Bow Collection\r<br />[url=http://www.nexusmods.com/skyrim/users/3399952/?]Marstonn[/url] for the Hook and Cleaver\r<br />[url=http://www.nexusmods.com/skyrim/users/10204660/?tb=mods&pUp=1]Corvalho1[/url] for the Valiant Nord Bow\r<br />[url=http://www.nexusmods.com/skyrim/users/1657719/?]Stroti[/url] for his resources\r<br />[url=http://www.nexusmods.com/skyrim/users/4756051/?]sa547[/url]  for the Ulfric wanted poster\r<br />[url=http://www.nexusmods.com/skyrim/users/3863233/?tb=mods&pUp=1]Vicn[/url] for the creature pack\r<br />[url=http://www.nexusmods.com/skyrim/users/776954/?]Tamira[/url] for the Antique Statue\r<br />Brendan for the beautiful sexy painting.\r<br />[url=http://www.nexusmods.com/skyrim/users/867382/?]Darkrder[/url] for the Celtic Decor for Skyrim I\r<br />[url=http://www.nexusmods.com/skyrim/users/5944828/?]kensmalice[/url] for voice acting Raddin the Skyrim thug\r<br />zaldiir, SabotageSam, Psykolabe, NellSpeed for the viking voice acting and the viking mod\r<br />Malo for the warrior statues \r<br />BrownPastel for the Throne seat, CN Resource pack\r<br />[url=http://www.nexusmods.com/skyrim/users/2250922/?tb=feed&pUp=1]Blary[/url] for the Ingredients Drawer Resource\r<br />I want to thank this awesome community, the supporters, administrators, Robin, all of you who make it possible to have a great site such as this one.I \r<br />finally want to thanks Bethesda for giving us such an open ended game such as Tes V Skyrim one of my favorite RPG games up to date, keep up the great work Bethesda&#33;\r<br />I believe I got everyone if I forgot anyone please let me know. :)[/center][center][/center]",
  "categoryId": "25",
  "version": "BETA",
  "author": "RayneRed",
  "createdUnix": "1413521333",
  "updatedUnix": "1413691550",
  "containsAdultContent": false,
  "uploadedBy": "Raynel07",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131307",
      "name": "The Guardians of the North (Loose Files)",
      "version": "One",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "264691",
      "fileName": "GOTN-59118-One.zip",
      "uploadedUnix": "1413515029",
      "modVersion": "One",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GOTN-59118-One.zip?fid=1000131307&ttl=1535846145&ri=8192&rs=8192&setec=4b8e19a0947bf2773f45857b9c1b421e"
    },
    {
      "fileId": "1000131614",
      "name": "The Guardians of the North Apachii Version",
      "version": "ONE",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "285563",
      "fileName": "The Guardians of the North Apachii Version-59118-ONE.zip",
      "uploadedUnix": "1413691550",
      "modVersion": "ONE",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Guardians%20of%20the%20North%20Apachii%20Version-59118-ONE.zip?fid=1000131614&ttl=1535846146&ri=8192&rs=8192&setec=110600ae00b40004119b056b15877761"
    }
  ]
}