{
  "modId": 59117.0,
  "modName": "LC_Immersive Looting Enchanting Patch",
  "summary": "Allows you to properly disenchant the jewelry from LC_immersiveLoot and enchant your own items with these effects. Also cleaned up many of the names. Requires LC_Immersive Looting:\r<br />skyrim.nexusmods.com/mods/44106",
  "descriptionHtml": "Allows you to properly disenchant the jewelry from LC_immersiveLoot and enchant your own items with these effects. Also cleaned up many of the names. Requires [url=http://www.nexusmods.com/skyrim/mods/44106/]LC_Immersive Looting[/url].\r<br />\r<br />[u][b]NOTE:[/b][/u] If you have already disenchanted any of the LC items prior to installing this patch, it is recommended you un-check LC_Immersive Loot in your load order, load your game, and create a new save without it. THEN re-enable LC and this patch after it. You will lose all your LC items, however you will also clear all the bad enchanting entries out of your list.\r<br />\r<br />\r<br />[u][b]CONTENTS:[/b][/u]\r<br />\r<br />There are three ranks of each enchant, corresponding with the three quality ranks of the items. The base values of the enchants correspond to the values of the quality level of the item you disenchanted. Ranks appear in your list as &#34;Eyes of Nature I&#34;, Eyes of Nature II&#34;, Eyes of Nature III&#34;, etc.\r<br />\r<br />Due to limitations of Skyrim itself, using higher level soul gems will only raise ONE of the values for each enchant, however the remaining values will still be the same as the base item you disenchanted, so you won&#39;t lose anything.\r<br />\r<br />All enchants can be placed on jewelry. Higher ranks can also be placed on one other item depending on various considerations, including the things the enchants on the item can normally be put on, which items these enchants normally cannot be put on (so you have more options for certain enchants), and the nature of the enchant. Also, rank II will sometimes allow a different additional item than rank III, allowing for more combinations when stacking a certain enchant.\r<br />\r<br />[u]UPDATE:[/u]  Now able to disenchant the rings as well. All of the rings with similar effects to the amulets will now teach an appropriate tier of those enchants when disenchanted, and unique rings teach their own enchant.\r<br />\r<br />[u]Magic Feathers CAN be disenchanted[/u], and also have three ranks. I made it so you can enchant any clothing item (including cloaks) with the fortify carry weight from this enchant, in addition to the items that can normally use this.\r<br />\r<br />Just load it after LC_immersiveLoot.esp and enjoy&#33;",
  "categoryId": "75",
  "version": "1.2",
  "author": "Phinix",
  "createdUnix": "1413497553",
  "updatedUnix": "1421713855",
  "containsAdultContent": false,
  "uploadedBy": "phinix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143634",
      "name": "LC_immersiveLoot-Enchanting",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "LC_immersiveLoot-Enchanting-59117-1-21.zip",
      "uploadedUnix": "1421713855",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/8911d2e99441a744f74aa7ae79a992d50898fa9090c538d74b7223703519154f/analysis/1421713862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LC_immersiveLoot-Enchanting-59117-1-21.zip?fid=1000143634&ttl=1535846143&ri=8192&rs=8192&setec=d12b0535ffcc5ca3afe0bd62e246afe5"
    }
  ]
}