{
  "modId": 5914.0,
  "modName": "Wildernewts Leathers",
  "summary": "Leathers mismatch in your thieves guild? mine did too. lets fix that issue by making them a more friendly, matching set of monotone leathers.",
  "descriptionHtml": "Joined the thieve\\'s guild but your leathers don\\'t match themselves or the leaders? Run the thieve\\'s guild and your thieve\\'s don\\'t match you or each other? Why can\\'t we all get along under one monochrome? Well, here we go! Something to fix that little issue at hand.\r\n\r\nMy first go at a retexture for this wonderful game. Once i figure out more about normal mapping, i might make them, you know, higher res than this, but until then, ill just fake it with larger textures on the low res normals.\r\n\r\nReplaces vanilla mismatched leathers with a set of varying shades of monochrome for the thieves guild armor sets, all of them including the varients. If i missed one, which i dont think i have, lemme know and ill get right  on that.\r\n\r\nsome tweeking with darkness still has to be done, that i know and will admit, but ill smooth it out eventually. So for now, enjoy this monochrome pack. If the extra texture i weaved in there is in the way, ill release a second pack without it, just holler.\r\n\r\ninstall normally with the manager, or read the HEY file tucked neatly inside of the zip.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Wildernewt",
  "createdUnix": "1326269839",
  "updatedUnix": "1326270563",
  "containsAdultContent": false,
  "uploadedBy": "wildernewt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "18812",
      "name": "Wildernewts_leathers",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21403",
      "fileName": "Wildernewts_leathers-5914-1-0.rar",
      "uploadedUnix": "1326270563",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/20026eecf114b061423639371a8105b9f9652fb7250d86cc82138374a1c9f311/analysis/1406602634/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wildernewts_leathers-5914-1-0.rar?fid=18812&ttl=1535763013&ri=8192&rs=8192&setec=90f25871f8d2f31f7b4b6acd906a6e9c"
    }
  ]
}