{
  "modId": 59200.0,
  "modName": "Taverns Aren&#39;t Discotecs",
  "summary": "A very simple mod that removes the ANNOYING chattering sound that you can hear inside/outside taverns. ",
  "descriptionHtml": "[size=4]Ohraahriohri bla bla bla bla... Ohraahriohri bla bla bla.... Ohraahriohri bla bla bla bla\r<br />\r<br />Seriously, WTF is that&#33;? It&#39;s one of the most disappointing and unimmersive things you can find across ALL Skyrim world. Even with a lot of npcs mod, your taverns will not EVER seems so crowded. And also, why they always repeat the same senseless words???\r<br />\r<br />The porpouse of this mod is to REMOVE TOTALLY this abomination.\r<br />\r<br />If you haven&#39;t any idea of what i&#39;m talking about, you&#39;re simply deaf. Aside from jokes, if you&#39;re so inattentive try to enter in a tavern (i suggest the Winking Skeever or Bannered Mare) around 10 PM o&#39;cloack. Put to 0 the music volume and to 100 the effects one. And finally you will understand what i&#39;m blabbering about. It can be called the &#34;crawded mess&#34; or whatever we can call it. And if EVEN NOW you still don&#39;t understand what i mean, you can watch this video:\r<br />\r<br />[youtube]ValCDBiYAt4[/youtube]\r<br />\r<br />If you don&#39;t need to do all this mess and already know what i&#39;m talking about... well seriously, YOU ARE STILL HERE? Hurry and download the mod&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />The archive contains 4 audio files that replace the vannila&#39;s ones. They are silent and empty like the head of the idiot that suggested to put this sound inside/outside a desolate place. You can install the mod simply putting it in the data folder or (HIGLY RECCOMENDED) using a mod manager for easily install/uninstall. The mod don&#39;t contains esps, bsas and ABOVE ALL SCRIIIIIPTS. This is the reason why its version is FINAL.\r<br />\r<br />If you want to update/share this s**t, feel free to do. I write this because... well i don&#39;t know even why. I can&#39;t imagine the porpouse of doing it... outside a sudden madness.[/size]",
  "categoryId": "78",
  "version": "FINAL",
  "author": "FEDERICOOO",
  "createdUnix": "1413718646",
  "updatedUnix": "1413718635",
  "containsAdultContent": false,
  "uploadedBy": "FEDERICOOO",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000131644",
      "name": "Taverns Aren&#39;t Discotecs",
      "version": "FINAL",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Taverns Aren't Discotecs-59200-FINAL.rar",
      "uploadedUnix": "1413718635",
      "modVersion": "FINAL",
      "virusScanUrl": "https://www.virustotal.com/file/937533a925506f52ce8cb1a27597200d087e13ecb56bf7a2c4ffcf88e44a7937/analysis/1413718751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Taverns%20Aren%27t%20Discotecs-59200-FINAL.rar?fid=1000131644&ttl=1535846291&ri=8192&rs=8192&setec=833be660dcb492cb5211e78375427d34"
    }
  ]
}