{
  "modId": 59258.0,
  "modName": "Breezehome Basement Redux - Hearthfire Compatible - DELETED",
  "summary": "This mod is a simple edit to the original Breezehome Basement Redux by Aelquias in order to make it compatible with Hearthfire.  No other changes have been made.",
  "descriptionHtml": "[size=4]This mod is a simple edit to the original [url=http://www.nexusmods.com/skyrim/mods/10878/?]Breezehome Basement Redux[/url] by Aelquias in order to make it compatible with Hearthfire.  No other changes have been made.[/size]\r<br />[size=5]\r<br />[/size][size=4][color=#00ff00][size=5]** It does NOT require Hearthfire to function so will work fine for anyone without the DLC **[/size][/color]\r<br />[/size]\r<br />[size=4]This is my first mod, although I cannot take any credit for creating it as all the work was done by Ekki firstly and Aelquias latterly. All I did was to edit the cell navmesh data in TES5Edit to remove the CTD that would occur if you tried to enter Breezehome with the original Breezehome Basement Redux\r<br />mod and Hearthfire installed.\r<br />\r<br />Special thanks to Aelquias for allowing me to upload this modified version.\r<br />\r<br />\r<br />\r<br />Description from the original mod:[/size]\r<br />\r<br />----------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[size=2][b]WHAT IS THIS MOD?[/b]\r<br />\r<br /> This is the most realistic and laid back basement mod around. Inspired and based\r<br /> off of Ekkii&#39;s Basement mod, this basement is in the same foundational \r<br /> footprint as Breezehome above it. It is not large but any means but it \r<br /> is a space that you&#39;d want to live in. You won&#39;t feel like you&#39;re \r<br /> cheating.\r<br />\r<br />[b] This mod includes the Ekkii&#39;s Spouse Life mod addition. That means when you get married your spouse can work at the \r<br /> market stall and hang out in the basement.\r<br />\r<br /> The mod works fine as a standalone as well for those not planning on getting married.[/b]\r<br />\r<br /> The space is divided into two sections: The Workshop, and the Living Area.\r<br />\r<br /> The Workshop includes an Anvil, a Workbench, a Tanning Rack, a Grinding Wheel, and an Enchanting Table. [b]Sorry, there is no smelter.[/b]\r<br />\r<br /> The workshop is also the gear display area which includes two working \r<br /> mannequins, one male and one female. There is also two up-right weapon \r<br /> racks beside the mannequins and a display case by the Enchanting Table.\r<br />\r<br /> There is a large chest and two barrels in the workshop for your crafting stuff or whatever you want to store there.\r<br />\r<br />[b] By request there is now a magical &#39;safe&#39; beside the Enchanter&#39;s table. It&#39;s super snazzy&#33;[/b]\r<br />\r<br /> The second space is the Den slash Library slash relaxing zone. It has 4 \r<br /> working book shelves. Two tall ones with 7 separate shelves combined. \r<br /> There is a custom-made &#39;Mammoth&#39; shelf (credit to Ekkii) above the desk,\r<br /> and a lectern with a top display spot.\r<br />\r<br /> There is one long fancy looking chest to hold nicer gear. There is a fancy strongbox on the desk\r<br /> perfect for notes, gems, and jewelry.\r<br />\r<br /> I placed a new navmesh by hand and made an overall sweep of asset placement to make everything \r<br /> grid friendly and lighting friendly.\r<br />\r<br /> There should be no shadow striping.\r<br />\r<br />[color=#f4cccc][s][b] This mod is currently INCOMPATIBLE with the Hearthfire DLC. Sorry about that. [/b][/s][/color]\r<br />\r<br />[b] Thanks to Ekkii, elgatoenlaluna and Thepal[/b]\r<br />\r<br /> This mod is based primarily on the [url=http://www.nexusmods.com/skyrim/mods/9000/?]Breezehome Basement by Ekkii\r<br />[/url] mod.\r<br />\r<br /> Thanks to Ekkii for giving me permission to upload this, and thanks to \r<br /> elgatoenlaluna for uploading the original mod and discussing things with\r<br /> me.\r<br />\r<br /> Thanks to Thepal for letting me include the new actor based on his work.\r<br />\r<br />[b] Is this mod OP?[/b]\r<br />\r<br /> I don&#39;t believe this mod will break any sense of immersion or difficulty.\r<br /> Essentially this mod will allow you to not have to run up to Dragon&#39;s \r<br /> Reach to enchant or use the War Maiden&#39;s tanning rack or forge. You will\r<br /> still need to use their smelter though.\r<br />\r<br /> There is no option to buy the basement from the Jarl&#39;s steward, but I feel the 5000 gp \r<br /> purchase price is enough of an investment of player&#39;s time to be \r<br /> rewarded with a working basement. In other words, if you buy Breezehome \r<br /> you get this standard. I may add the option to buy it later. If you \r<br /> really feel that bad you can always give away your gold :D\r<br />\r<br /> This mod will work fine regardless if you have or have not bought Breezehome already.\r<br />\r<br /> There is practically no saleable clutter, and no gear/treasure items pre-placed the character can use.\r<br />\r<br /> The space has been beautified and made to look like someone wants to live \r<br /> there and does live there. I hope you enjoy your new basement.\r<br />\r<br /> Thanks for checking it out&#33;[/size]\r<br />\r<br />-------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[size=4]Original version of this mod [url=http://www.nexusmods.com/skyrim/mods/10878/?]Breezehome Basement Redux[/url]\r<br />Mod upon which the original version was based [url=http://www.nexusmods.com/skyrim/mods/9000/?]Breezehome Basement by Ekkii[/url][/size]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Stoneye1969",
  "createdUnix": "1413909260",
  "updatedUnix": "1413909260",
  "containsAdultContent": false,
  "uploadedBy": "Stoneye1969",
  "primaryFile": null,
  "files": []
}