{
  "modId": 59309.0,
  "modName": "Follower Goes on a Trip German",
  "summary": "This is the german translation of the Follower Goes on a Trip mod by kitaring. All Credits go to him.\r<br />\r<br />Dies ist die deutsche Übersetzung der Mod Follower Goes on a Trip von kitaring. Alle Credits gehen an ihn.",
  "descriptionHtml": "[center]This is the german translation of the [b][i]Follower Goes on a Trip[/i][/b] mod by [i]kitaring[/i]. All Credits go to him.\r<br />\r<br />Dies ist die deutsche Übersetzung der Mod [i][b]Follower Goes on a Trip[/b][/i] von [i]kitaring[/i]. Alle Credits gehen an ihn.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/52235/?][b][size=3]Follower Goes on a Trip[/size][/b][/url]\r<br />\r<br />[size=2][b]Die Originalmod [/b][u]wird nicht benötigt.[/u]\r<br />[b]Ich würde mich sehr freuen, wenn ihr die Originalmod endorsen würdet&#33; :)[/b][/size][/center][size=2]\r<br />\r<br />\r<br />Mit der Mod Follower Goes on a Trip ist es möglich seine Begleiter oder jeden anderen NPC auf eine Reise zu schicken.\r<br />Die Begleiter und NPCs reisen nur in der Woche. An Wochenenden kehren sie zu ihrem ursprünglichen Aufenthaltsort zurück.\r<br />Lydia beispielsweise wird Samstags und Sonntags entweder in die Drachenfeste oder zum Briesenheim zurückkehren. Sollte ihr sie als Begleiterin dabei gehabt haben, als ihr sie auf die Reise geschickt habt, wird sie zu euch zurückkehren.\r<br />Die Reisenden werden ihr nächstes Reiseziel automatisch aus den verfügbaren Orten wählen und so auch Orte aus den DLCs bereisen, solange diese vorhanden sind.\r<br />\r<br />Bei ihrer Ankunft in Städten werden sie Gasthäuser, Tempel und Geschäfte besuchen. Wenn die NPCs Dungeons und Höhlen erforschen und sicher aus diesen zurückkehren, werden sie eine kleine Menge Gold erhalten.\r<br />\r<br />\r<br />Die NPCs werden Kopfgeldquests ausführen, die der Spieler angenommen hat. Solange der Spieler nicht in der Nähe ist, wird in dem Kampf des NPCs gegen das Ziel der Kopfgeldquest eine einfache Formel angewendet. Sieg und Niederlage hängen zu einem kleinen Teil vom Level des NPCs und zu einem großen Teil von Glück ab. Der NPC kann in diesem Kampf nicht sterben, sondern wird bei einer Niederlage nach kurzer Zeit einen neuen Versuch starten.\r<br />Im Folgenden findet ihr die Wahrscheinlichkeit auf einen Sieg gegen den jeweiligen Gegner:\r<br />gegen Banditen: 40%\r<br />gegen Abgeschworene: 30%\r<br />gegen Riesen: 20%\r<br />gegen Drachen: 10%\r<br />\r<br />NPCs werden Gold aus dem Inventar ihrer getöteten Gegner entnehmen und können die Belohnung bei dem Auftraggeber einstreichen. Der Spieler kann die Belohnung jedoch auch selbst abholen.\r<br />Seit Version 0.3 werden die reisenden NPCs bei einer Niederlage in einem Banditen- oder Abgeschworenenlager gefangen genommen und zu einem anderen Lager gebracht werden, bis der Spieler ihn befreit.\r<br />Um den jeweiligen NPC zu befreien müsst ihr lediglich den Ort der Kopfgeldquest finden, das Ziel töten und den NPC aktivieren.\r<br />\r<br />Insgesamt können 24 Begleiter gleichzeitig auf Reisen geschickt werden.\r<br />\r<br />Diese Mod sollte mit allen Mod-Begleitern und mit allen Multifollowermods funktionieren.\r<br />\r<br />\r<br />\r<br />[b]Konfiguration und Nutzung:[/b]\r<br />\r<br />[b]MCM-Konfiguration:[/b]\r<br />\r<br />-Kopfgeldquest annehmen\r<br />Schaltet die Möglichkeit, NPCs eure Kopfgeldquests annehmen zu lassen an und ab.\r<br />\r<br />-Textbenachrichtigungen\r<br />Schaltet die Textbenachrichtigungen an und ab.\r<br />\r<br />-Alle NPCs erlauben\r<br />Schaltet zusätzlich zu Begleitern alle NPCs für die Dialogoptionen an und ab.\r<br />&#33;&#33;Achtung&#33;&#33; Bei Aktivierung dieser Option ist höchste Vorsicht geboten. Ihr solltet euch genauestens überlegen, welchen NPC ihr auf die reise schickt. Quests können sonst nicht mehr richtig ausgeführt werden&#33;\r<br />Außerdem kann es vorkommen, dass NPCs ihre Reise nicht starten. In diesem Fall hat das normale Verhalten eine höhere Priorität als das Verhalten dieser Mod.\r<br />\r<br />-Alle NPCs zurücksetzen\r<br />Lässt alle betreffenden NPCs die Reise abbrechen und zu euch oder dem ursprünglichen Aufenthaltsort zurückkehren.\r<br />\r<br />-Debug Text\r<br />Zeigt zusätzliche Textbenachrichtigungen zu Aufenthaltsorten der betreffenden NPCs an.\r<br />\r<br />\r<br />[b]Dialoge:[/b]\r<br />\r<br />So schickt ihr NPCs auf eine Reise:\r<br />1. NPC aktivieren\r<br />2. Dialogoption &#34;Genießt eure Reise.&#34; wählen\r<br />\r<br />So brecht ihr die Reise des NPCs ab:\r<br />1. NPC aktivieren\r<br />2. Dialogoption &#34;Kehrt bitte zurück.&#34; wählen\r<br />\r<br />\r<br />\r<br />[b]Bekannte Bugs und Probleme:[/b]\r<br />\r<br />Bei Aktivierung der Option &#34;Alle NPCs erlauben&#34; ist höchste Vorsicht geboten. Ihr solltet euch genauestens überlegen, welchen NPC ihr auf die reise schickt. Quests können sonst nicht mehr richtig ausgeführt werden&#33;\r<br />Sollten die NPCs direkt nach Beginn eines Spiels trotz Aktivierung der Dialogoption ihre Reise nicht beginnen, kann es helfen, 24 Stunden ingame zu warten/schlafen.\r<br />\r<br />\r<br />\r<br />[b]Modempfehlung:[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/58450/?]Jaxonz Map Markers[/url] von Jaxonz (frei festlegbare Mapmarker für NPCs, Objekte und Orte)\r<br />\r<br />\r<br />Die Übersetzung basiert auf den Textkorrekturen des [url=http://www.scharesoft.de/elder-scrolls/tes-v-skyrim/skyrim-directors-cut.html]Skyrim Director&#39;s Cut[/url] der Version 4.0.\r<br />\r<br />\r<br />Danke an pitfl für seine Tests und Berichte.\r<br />\r<br />Viel Spaß mit dieser Übersetzung und nocheinmal ein riesiges Dankeschön an [url=http://www.nexusmods.com/skyrim/users/1297695/?]kitaring[/url] für die Erlaubnis :)\r<br />nhskill[/size]",
  "categoryId": "66",
  "version": "0.3",
  "author": "kitaring - german translation by nhskill",
  "createdUnix": "1414793854",
  "updatedUnix": "1414790758",
  "containsAdultContent": false,
  "uploadedBy": "nhskill",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133418",
      "name": "Follower Goes on a Trip 0_3 DV",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32",
      "fileName": "Follower Goes on a Trip 0_3 DV-59309-0-3.rar",
      "uploadedUnix": "1414790758",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/849752d4fe3e32ce9c1648f16f851cfcbd57e4e0d1fd79c3a38d5c90b0c3069c/analysis/1414790823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Goes%20on%20a%20Trip%200_3%20DV-59309-0-3.rar?fid=1000133418&ttl=1535846453&ri=8192&rs=8192&setec=09cc5dc96e450fb24a7cbf5283538078"
    }
  ]
}