{
  "modId": 59322.0,
  "modName": "Magic- Elemental Realism",
  "summary": "Have you ever stood within 5 feet of a bonfire? Have you ever walked through the bonfire relatively unharmed and commenced to shake your buddy&#39;s hand on the other side? Absolutely not&#33; within 5 feet of that fire the heat and intensity of the fire is unbearable enough you can&#39;t even breath properly. This mod aims to change the simply err",
  "descriptionHtml": "Have you ever stood within 5 feet of a bonfire? Have you ever walked through the bonfire relatively unharmed and commenced to shake your buddy&#39;s hand on the other side? Absolutely not&#33; Within 5 feet of that fire the heat and intensity of the fire is unbearable enough you can&#39;t even breath properly. This mod aims to change the simply erroneous concept of a man attacking you through your high level Destruction spells with barely a hair in his rendered beard singed. \r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;It always and without fail enraged me when I dual cast my flames spell on a bandit and his health bar barely moved while he went on his merry way in attacking me, and commenced to cleave my head in two and skipped away down the road without a moment of pause. You see, I did run through that bonfire as a kid. Not the roaring flames (or else I couldn&#39;t write this) but over a 2-week old ash pile. I fell through and some hibernating coals burned my feet all the way to the bone and left me hospitalized for a week after. So how does it make sense that my intense fire spell is virtually useless against anything other than the occasional bunny rabbit or fox along the road? In WWII the flamethrower was implemented in the war and was drastically effective in clearing any vehicle or unit that wasn&#39;t armored.  This mod aims to give the elemental destruction spells a real-world flavor. \r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;WARNING&#33;&#33;&#33; THIS MOD WILL MAKE ENEMY MAGES JUST AS REALISTICALLY POWERFUL. ENEMY MAGES USE THE SAME SPELLS AND NOT EVEN THE DOVAHKIIN CAN WALK THROUGH FIRE.\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;The ward spells will be similarly buffed to compensate for the sudden, massive increase in damage from spells. Expect wards to stand up to spells for a good amount of time before breaking. In the future I plan to make shot-spells break wards much easier than concentration spells with mastery spells shattering all but the most powerful wards with little effort.",
  "categoryId": "75",
  "version": "",
  "author": "vAbiss",
  "createdUnix": "1414113637",
  "updatedUnix": "1414113637",
  "containsAdultContent": false,
  "uploadedBy": "vAbiss",
  "primaryFile": null,
  "files": []
}