{
  "modId": 59370.0,
  "modName": "Sky Ball Tournament",
  "summary": "The newest and most ultra-violent contact sport to be played in Skyrim. If youre a fan of Speedball, Bloodbowl, soccer, rugby, American football or just plain old violence youll love this. Use cleaver tactics to outwit the other team, speed and agility to out manouvre them, or simply pound them into the turf&#33;",
  "descriptionHtml": "\r<br />\r<br />[img]http://i57.tinypic.com/263ahwi.png[/img]\r<br />\r<br />[b]Belethor:[/b] Welcome sports fans to another season of Sky Ball, one part ball sport, two parts warfare&#33;  It promises to be the most spectacular yet. Joining me in the stadium is two times Sky Ball champion Ulfric Stormcloak. Ulfric, what&#39;s your take on the atmosphere tonight?\r<br />\r<br />[b]Ulfric:[/b]  It&#39;s an exiting night Belethor. The Sons Of Sky Ball are poised to crush those imperial dogs the Gold Coast Ballers. General Tullius won&#39;t know what hit him&#33;\r<br />\r<br />[b]Belethor:[/b]  Ha, that&#39;s great Ulfric. Also here tonight we have Farengar Secret-Fire all the way from Whiterun. Are you looking forward the the game Farengar?\r<br />\r<br />[b]Farengar:[/b]  Well you know, it&#39;s true that I prefer my books and my spells to open confrontation but when Tempest are ready to RIP THE HEADS OFF THE ALDMERI WANDERERS I CAN&#39;T WAIT&#33;&#33;&#33;\r<br />\r<br />[b]Belethor:[/b]  Well there you have it sports fans, all the exitement and intregue of a new season. Word has it a new team takes to the field this year, the Tamriel All Stars, lead by none other than the Dragonborn we&#39;ve all been hearing about. Who know&#39;s if they&#39;ll make a name for themselves but each match is sure to be a riot&#33;\r<br />\r<br />[youtube]lHN_GtMsX50[/youtube]\r<br />\r<br />[img]http://i60.tinypic.com/igxl3s.png[/img]\r<br />\r<br />The newest and most ultra-violent contact sport to be played in Skyrim. [b]If you&#39;re a fan of Speedball, Bloodbowl, soccer, rugby, American football or just plain old violence you&#39;ll love this[/b]. Use cleaver tactics to outwit the other team, speed and agility to out manouvre them, or simply pound them into the turf&#33;\r<br />\r<br />[b]An almost DLC sized mod[/b] that took an insane amount of time to make. Sky Ball Tournament is a massively expanded version of the Sky Ball mini game found in my other mod Markarth Arena.\r<br />\r<br />[img]http://i57.tinypic.com/rh671v.png[/img]\r<br />\r<br />* [b]Play as a Sky Ball captain[/b], leading your team to victory in an brutally violent ball sport&#33;\r<br />\r<br />* [b]Epic tournament campain[/b] - develop your team over an infinite number of tournaments with persistant stats and equipment.\r<br />\r<br />* [b]Intense combat[/b], - six players a side, locking horns for up to 20 minutes a match.\r<br />\r<br />* [b]12 new teams[/b], one from each of the major races and yours the Tamriel All Stars, featuring seasoned players from all over Tamriel.\r<br />\r<br />* [b]Plan out your strategy[/b] - select players for different positions on the pitch, decide on their tactics, hire assistant coaches to help you.\r<br />\r<br />* [b]Three different venues[/b] - each requiring a different strategy; The Pitch - a rugby style outdoor pitch, The Court - a fast paced ice hockey style arena and The Maze - a dangerous converted Dwemer factory.\r<br />\r<br />* [b]Dynamic AI tactics[/b] - the AI will adjust it&#39;s tactics depending on the venue and during matches depending on how well the match is going for them.\r<br />\r<br />* [b]Balance your finances with the needs of your team[/b] - enourmous sums of money are to be made, but your expenses are also huge; hire players, pay wages, train and equip them. \r<br />\r<br />* [b]Eight new quests[/b] to find new star players, gain sponsors for your team or just to help out the Eldergleam stadium.\r<br />\r<br />* [b]Custom armour, weapons and spells.[/b] Each of the 12 teams has a distinctive look and feel, including yours. Many new non-Sky Ball related items to find too.\r<br />\r<br />* [b]Tons of unlockable content[/b] like new merchants, trainers and mini games.\r<br />\r<br />* [b]Cunning secret weapons[/b] to unlock as well as other useful bits of kit to help squash the other teams&#33;\r<br />\r<br />* [b]Play fair or play dirty[/b] - fouling K.O&#39;d players is a sound tactic if the ref isn&#39;t looking&#33;\r<br />\r<br />* [b]Complex scripting[/b] simulates tournament games when you&#39;re not playing - teams don&#39;t just beat each other randomly, their player stats count. AI teams develop over the campain just like yours do, some will become increasing powerful, others will fade into obscurity.\r<br />\r<br />* [b]Track your stats[/b] over the long game to see how you measure up against the other teams.\r<br />\r<br />* [b]Sky Ball is enjoyed by many of Skyrims inhabitants.[/b] You might see a celebrity or two enjoying a drink in the bar :)\r<br />\r<br />* [b]Full in-game tutorial[/b] as well as purchasable guides and tips books, all lore friendly. Easily accessible options menu.\r<br />\r<br />\r<br />\r<br />\r<br />Thanks to Noodles for the cloak meshes from Cloaks Of Skyrim - http://www.nexusmods.com/skyrim/mods/12092/?",
  "categoryId": "35",
  "version": "1.6",
  "author": "Absinthe",
  "createdUnix": "1414258308",
  "updatedUnix": "1414676181",
  "containsAdultContent": false,
  "uploadedBy": "AbsintheNexus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133199",
      "name": "Sky Ball Tournament",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45900",
      "fileName": "Sky Ball Tournament-59370-1-6.rar",
      "uploadedUnix": "1414676181",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/dbdd8d18a0d79f0e81565787296ee921842269644add180006347537b362e47e/analysis/1414676266/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sky%20Ball%20Tournament-59370-1-6.rar?fid=1000133199&ttl=1535846539&ri=8192&rs=8192&setec=31550dc06ad86b35791b00318194f43c"
    }
  ]
}