{
  "modId": 59389.0,
  "modName": "Modder Resource - Autosort and Autoloot",
  "summary": "Improved the Autosort and Autoloot Scripts used in popular Mods like Jaggarsfeld and Dawnspire.",
  "descriptionHtml": "[size=4]TTAutosortContainer[/size]\r<br />\r<br />This is the core script for autosorting and autlooting. It automatically sort items, that are placed in a special container, and sends them to designated chests. It also acts as a framework for autolooting. It must be attached to all sorting chests.\r<br />First you need to create a new BASE container and place it in your player home. Now choose (in your mind only) the chests where you want the items placed into. There are max 25 categories but you can merge categories, e.g. you can send Poisons and Potions to the same chest:\r<br />\r<br />[list]\r<br />[*]Alchemy Recipes\r<br />[*]Ammunition\r<br />[*]Book\r<br />[*]Bow\r<br />[*]Clothing\r<br />[*]Food\r<br />[*]Gem\r<br />[*]Gold\r<br />[*]Heavy Armor\r<br />[*]Ingot\r<br />[*]Ingredient\r<br />[*]Jewelry\r<br />[*]Key\r<br />[*]Light Armor\r<br />[*]Misc\r<br />[*]Ore\r<br />[*]Pelt\r<br />[*]Poison\r<br />[*]Potion\r<br />[*]Scroll\r<br />[*]Shield\r<br />[*]Soulgem\r<br />[*]Spell Tome\r<br />[*]Staff\r<br />[*]Weapon\r<br />[/list]\r<br />Once you have made your decision, open the BASE record of your Sorting Chest and edit the properties of the TTAutosortContainer script. First use &#34;Auto-Fill All&#34; and then point each Chestxxx property to the proper chest in your player home. Again, you can chose the same chest as a destination several times.\r<br />\r<br />If you decided to have a seperate ore chest, you must create a new formlist and add all ores to it. I recommend to filter MiscObject for &#34;ore&#34; and drag&drop everything into your formlist. Again, open the BASE record of your sorting chest and edit the properties of the TTAutosortContainer script and then point ListOres to your formlist.\r<br />\r<br />Congratulations&#33; You&#39;ve got a fully working autosort system. All items that are placed in the Sorting Chest will be sent to their assigned chest.\r<br />\r<br />\r<br />[size=4]TTAutosortLever[/size]\r<br />\r<br />This script offers the possibility to withdraw all items, that were sorted by my scripts. It must be attached to an activator, which can be activated by the player, e.g. a lever.\r<br />\r<br />The previsouly unused IsMasterChest property now becomes important. By default this is set to true, which turns the Sorting Chest into a Master Sorting Chest. A Master Chest sorts all items, that are placed within, while a normal Sorting Chest only sorts item, that are added by the player. The Sorting Chest that you created in step one is actually a Master Chest. If you want to use the lever system you need only one master chest, which should be hidden from the player. Therefore you have to change IsMasterChest on the BASE record to false. Place another copy of your Sorting Chest somewhere, where the player can&#39;t reach it, e.g. under the floor or behind a wall. Open the REFERENCE of this Master Chest and set IsMasterChest locally to true.\r<br />\r<br />Create a new activator, give it a useful name, attach the TTAutosortLever script to it and edit the properties of the TTAutosortContainer script. Point MasterChest to your hidden Master Chest and Sorting Chest to your Sorting Chest.\r<br />\r<br />\r<br />[size=4]TTCraftingSpell & TTCraftingAutoloot[/size]\r<br />\r<br />This script sets up the autoloot system behind the scenes.\r<br />\r<br />First you have to create a new spell with the following properties:\r<br />[list]\r<br />[*]Type: Delivery\r<br />[*]Casting: Constant Effect\r<br />[*]Delivery: Self\r<br />[*]Disallow Spell Absorb/Reflect\r<br />[/list]\r<br />Then you create a new magic effect with the following properties:\r<br />[list]\r<br />[*]Effect Archetype: Script\r<br />[*]Casting Type: Constant Effect\r<br />[*]Delivery: Self\r<br />[*]No Magnitude\r<br />[*]No Area\r<br />[/list]\r<br />Save it and reopen your magic effect. Add the TTAutolootSpell script and open its properties. Hit &#34;Auto-Fill All&#34;, point AutoootCraftingSpell to the spell you just created and point MasterChest to your Master Chest. Go back to the spell and add your magic effect to it. Next you create a new short global variable with a value not equal to 0. Setting this variable to 0 will disable the autoloot system.\r<br />\r<br />All that&#39;s left now, is linking the crafting stations to the autoloot circle.\r<br />I recommend to edit only references but you can add the script to base records too. Add the TTCraftingAutoloot script to a crafting station and edit the properties as usual. Hit &#34;Auto-Fill All&#34;, point AllowAutoLoot to the global variable from the step above and point AutoootCraftingSpell to the spell you created one previously. ContainersToBeLooted is an array containing all chests that will be looted automatically when the player activates the crafting station. You can loot 1-256 chests for a crafting station. However I highly recommend to only loot essential chests, as this part is rather resource heavy. Repeat this until all crafting stations in your player home are linked to the autoloot system.\r<br />\r<br />\r<br />[size=4]TTToggleAutoloot\r<br />\r<br />[/size]This is an optional helper script, that allows to toggle autolooting on and off in a simple manner.",
  "categoryId": "82",
  "version": "1.0",
  "author": "thetrader",
  "createdUnix": "1414319251",
  "updatedUnix": "1414319251",
  "containsAdultContent": false,
  "uploadedBy": "thetrader",
  "primaryFile": null,
  "files": []
}