{
  "modId": 59483.0,
  "modName": "The Bloody Tankard - Halloween Decorations and Food",
  "summary": "Adds a new store with Halloween-themed decor.",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />Welcome, everybody&#33; The Bloody Tankard (the last of my holiday-themed shops, alongside [url=http://www.nexusmods.com/skyrim/mods/47524]The Merry Snowberry[/url] and [url=http://www.nexusmods.com/skyrim/mods/50964/?]The Golden Rose[/url]) is here to celebrate Halloween&#33; Get ready to decorate your place with the fine items and apparel you will find in this humble little shop. \r<br />\r<br />This mod has been cleaned with TES5EDIT, [u][b]REQUIRES DAWNGUARD[/b][/u], does not make changes to cities, add NPCs, or modify scripts. Just like I did with my other shops, everything is buyable and droppable for maximum compatibility; none of the items have been added to leveled lists or placed around the world. I made it so you could install it and keep it, instead of feeling you should uninstall the mod once the Halloween spirit is gone.\r<br />\r<br />German translation available [url=http://www.nexusmods.com/skyrim/mods/59609/?]here[/url], and French [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/bordeciel/lieux/la_chope_sanglante]here[/url]&#33; Thanks, taryl80 and Sita&#33;\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/TpZrAj1.png[/img][/center]\r<br />The Bloody Tankard is located in the swamps near Morthal. There is a map marker available from the start, and the merchant here works 24/7 selling wrapped candy and other food, some table decorations, candles, books and clothes, for you to dress up or place around your home.\r<br />\r<br />The food has the usual vanilla effects, and I&#39;m afraid [u]I&#39;m not planning on making patches for needs mods.[/u] The candles also do not emit light, although they have an animated flaming wick. I tried to keep the prices fair and the amounts suitable for people with many friends or family to give candy to&#33;\r<br />[center]\r<br />\r<br />\r<br />Here&#39;s a great showcase of the mod by insane0hflex&#33; Thank you&#33;\r<br />\r<br />[youtube]pTWGA8an-dQ[/youtube][/center]\r<br />\r<br />[center][/center][center][img]http://i.imgur.com/rwmR9Gq.png[/img][/center]\r<br />To install, extract the contents of your downloaded file to your &#34;Steam/SteamApps/Common/Skyrim/Data&#34; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Or you can use the Mod Manager to download the mod automatically. To uninstall, simply delete the files from your Data folder, and you&#39;re good to go. \r<br />\r<br />\r<br />[center][img]http://i.imgur.com/akZI9o2.png[/img][/center]\r<br />The collision on some of the new items is a bit clunky. Also, because this is Skyrim we&#39;re talking about, my items tend to spazz out and jump around when you place them too close to each other, to other things, or whenever they are touched by an NPC or the player. Not much I can do about that, unfortunately. \r<br />\r<br />The mod should be compatible with anything, unless there is a mod out there somewhere that makes changes around the location of the shop. There&#39;s a conflict with The Evil Mansion mod, which adds a mansion at the same location, and the Creepy Zombies mod spawns zombies near the house. Thanks for the report, teepeezombie&#33; If you find any more conflicts, please let me know so I can list them here.\r<br />\r<br />The new consumables are compatible out-of-the-box with [url=http://www.nexusmods.com/skyrim/mods/60270/?]RND - Universal Compatibility Patch[/url]. [i][b]I will not make a dedicated patch for it or any other needs mods.[/b][/i] If you want to make one, feel free to do so. You are welcome to send it to me, if you&#39;d like to have it uploaded here -- with credits, of course. \r<br />\r<br />\r<br />[center][img]http://i.imgur.com/8Q6F6pu.png[/img][/center]\r<br />[b]- LORE&#33;&#33;&#33;1 NOT LORE FRIENDLY&#33;&#33; AGH&#33;&#33;[/b]\r<br />- [url=http://i.imgur.com/NIXnCtS.gif]Indeed.[/url]\r<br />\r<br />[b]- I hate [thing] and [thing] and [thing]&#33; You should have done [thing] and [thing] instead&#33; And while you&#39;re at it remove [thing] and [thing] and add [thing] and [thing]&#33; And [thing] is NOT LORE FRIENDLY&#33; FIX THIS&#33;[/b]\r<br />- This isn&#39;t a restaurant. If you don&#39;t like something, use the console to disable it, remove it with the Creation Kit or TESEDIT, or sell it off. [url=http://i.imgur.com/XumZOt2.gif]In other words...[/url]\r<br />\r<br />[b]- Why is the download so freakin&#39; big?&#33;[/b]\r<br />- I am using a large amount of custom content because there are only so many things already in the game I could use for something like this. [url=http://i.imgur.com/Jw9VaAX.gif?1]In other words...[/url]\r<br />\r<br />[b]- I hate everything being static&#33; I wanna pick things up&#33;[/b]\r<br />- There are three main reasons why things are static in the shop. First, the house is tiny and clutter would be flying around all the time. Second, it would greatly hurt framerate to have so many little things moving around at once. And third, it gives me much more freedom when it comes to decoration. [url=http://i.imgur.com/AYOKaDI.gif]In other words...[/url]\r<br />\r<br />[b]- Can I use some of these files on my own mod?[/b]\r<br />- A bunch of things I&#39;m using are already modder&#39;s resources, so just look around the credits tab to look for what you&#39;d like to use. If you cannot find the thing you want there, it probably means I made it myself. Feel free to ask if you&#39;re not sure.\r<br />\r<br />[b]- The new textures are too low res and ugly&#33; I cannot stand this&#33;[/b]\r<br />- It&#39;s what I had. I downscaled a lot of textures to help reduce the file size, but when it comes to upscaling textures, I am at a loss because I am no good at texturing, so what you see is what you get. [url=http://i.imgur.com/xe2OsXx.gif]In other words...[/url]\r<br />\r<br />[b]- The shop home is too small, make it bigger&#33;[/b]\r<br />- Nope. I wanted it to be a house for one. If you want to put more beds or whatnot, do it yourself with the Creation Kit or TESEDIT. [url=http://i.imgur.com/6DdDc.gif]In other words...[/url]\r<br />\r<br />[b]-The prices are too expensive/too cheap&#33;[/b]\r<br />- I think the prices are fair considering what you get. If there are enough complaints I may make some versions with different prices, but until then, I&#39;m afraid they&#39;ll stay as they are. [url=http://i.imgur.com/ulMiiOj.gif]In other words...[/url]\r<br />\r<br />[b]- Is this compatible with [mod]?[/b]\r<br />- If you have a mod that makes heavy changes to the surroundings of Morthal, there could be issues. The Evil Mansion mod, which adds a mansion at the same location, has a conflict, and the Creepy Zombies mod spawns zombies near the house. Thanks for the report, teepeezombie&#33; If you find any more conflicts, let me know so I can list them here.\r<br />\r<br />[b]- How come the mod looks different in my game than your screenshots?[/b]\r<br />- I am using several retextures in my own game and my own SweetFX preset, so results may vary.\r<br />\r<br />[b]- The mod is awful/glitchy/buggy/etc. I am going to uninstall it and I must let everybody know&#33;[/b]\r<br />- Sad to see you go~\r<br />\r<br />[b]- The mod sucks&#33;[/b]\r<br />- So does a vaccuum cleaner ;)\r<br />\r<br />[size=4][center][color=#1E90FF]FOR THE FULL LIST OF CREDITS, PLEASE CHECK THE &#34;CREDITS AND PERMISSIONS&#34; TAB [img]http://forums.nexusmods.com/public/style_emoticons/dark/wub.gif[/img]\r<br />[/color][/center][/size][center][url=http://www.nexusmods.com/games/users/donate/?mode=straight&id=2543917][img]http://i.imgur.com/V6qmsU9.png[/img][/url][/center]",
  "categoryId": "69",
  "version": "1.0",
  "author": "Jokerine",
  "createdUnix": "1414606629",
  "updatedUnix": "1414606067",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133071",
      "name": "The Bloody Tankard v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24342",
      "fileName": "The Bloody Tankard v1-59483-1-0.rar",
      "uploadedUnix": "1414606067",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/990617cf49bff39b8812e84c14d7a15ab6b75ce89401915ffedcfe9e20b6cc28/analysis/1414605556/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Bloody%20Tankard%20v1-59483-1-0.rar?fid=1000133071&ttl=1535846713&ri=8192&rs=8192&setec=96fb01ccc34006346a4595ee07f7fc27"
    }
  ]
}