{
  "modId": 59495.0,
  "modName": "Dingo&#39;s Mod",
  "summary": "My first mod. This mod adds a new follower to the game that is in memorial to my pet who died recently and I miss very much. I hope to make this mod very big. I have no real direction for this mod so I want people to suggest ways to improve it in any way (I&#39;m thinking of adding quests but I want good ideas for them)",
  "descriptionHtml": "[b][u]Description[/u][/b]\r<br />This mod adds a new follower to the game that is in memorial to my pet who died recently and I miss very much. I hope to make this mod very big. I have no real direction for this mod so I want people to suggest ways to improve it in any way (I&#39;m thinking of adding quests but I want good ideas for them) Seriously, any thing is helpful and if it seems like a good idea or something I want to do I will do it. I hope to make this an ongoing mod as long as I have feedback to work with. My apologies but I haven&#39;t been updating in a while and it might be awhile longer. I&#39;ve been really busy and working on another mod.\r<br />\r<br />[b][u]Who&#39;s Dingo?\r<br />[/u][/b]In real life, Dingo was a lizard that I owned but died a very tragic death. This mod was created in memorial to him. But he character is an argonian follower without much of a story but there will be soon enough. He isn&#39;t overpowered at all and you should be able to use him through an entire play-through if you so choose. He starts at level 3 and progresses to level 80. He doesn&#39;t wear overpowered equipment so if you&#39;re late game you will need to give him good armor. He is a spell sword type character. He is mostly skilled with light armor, sneak, one-handed weapons, alteration, restoration and destruction. He has a few spells that he can use: firebolt, heal other(don&#39;t know how much he uses it,) fast healing, and ironflesh (not used often.) I also gave him the ability to teleport. He won&#39;t use it a lot and only uses it to avoid attacks so he&#39;ll move just a little bit. You can find him at the Drunken Huntsman.\r<br />\r<br />[b][u]Issues\r<br />[/u][/b]I&#39;ve encountered no issues yet because this is a small mod. Please report any if you find them.\r<br />\r<br />[b][u]Future updates\r<br />[/u][/b]In the future, I plan on adding custom voice acting and new quests that will develop the character. These were due to popular suggestions. Keep those suggestions coming&#33;\r<br />\r<br />[u]If you&#39;re interested in helping...[/u]\r<br />[list][*][size=2]I need a voice actor with a killer Argonian accent[/size][/*]\r<br />[*][size=2]Anybody with a lot of experience in modding[/size][/*]\r<br />[/list]\r<br />[b][u]Contact information\r<br />[/u][/b]If anybody has some serious suggestions on my mod contact me through the mod page, steam (Flash80cam) or through email (acam.675@gmail.com) [b]NO SPAM PLEASE. Also don&#39;t Contact me through the forums because I&#39;m not premium (I know I&#39;m cheap) [/b]",
  "categoryId": "96",
  "version": "0.5.1",
  "author": "Bettter",
  "createdUnix": "1414625600",
  "updatedUnix": "1414701401",
  "containsAdultContent": false,
  "uploadedBy": "bettter",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133131",
      "name": "Dingo&#39;s Mod",
      "version": "0.5.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dingo's Mod-59495-0-5-0.zip",
      "uploadedUnix": "1414625593",
      "modVersion": "0.5.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f5e48786b7c60c3210a3f13871108ffb173a148dba200d0e207f92e2cce22bd/analysis/1414625702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dingo%27s%20Mod-59495-0-5-0.zip?fid=1000133131&ttl=1535846731&ri=8192&rs=8192&setec=a5550e04d2fcc4b78302160183539d7c"
    },
    {
      "fileId": "1000133263",
      "name": "Dingo&#39;s Mod 0.5.1",
      "version": "0.5.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Dingo's Mod 0.5.1-59495-0-5-1.zip",
      "uploadedUnix": "1414701401",
      "modVersion": "0.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/04ea658afcc993189f97c199877a2397c2783815f6145254ba61e975ebc5bdd1/analysis/1414701482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dingo%27s%20Mod%200.5.1-59495-0-5-1.zip?fid=1000133263&ttl=1535846732&ri=8192&rs=8192&setec=15052e9cc85266d40d830e2d17b58d71"
    }
  ]
}