{
  "modId": 59512.0,
  "modName": "Karstaag Returns",
  "summary": "Regain the ability to summon Karstaag by returning to his castle to do battle with him again.",
  "descriptionHtml": "[center][b][size=1][color=#FF0000]ATTENTION:[/color] While I reserve the right to delete off-topic comments and trolling from my threads, I WILL [u]NEVER[/u] BAN [u]ANY USER[/u] FROM ACCESSING [u]ANY[/u] OF MY FILES, NO MATTER WHAT THEY POST IN THE COMMENT THREAD. THERE ARE [u]NO[/u] EXCEPTIONS TO THIS RULE.[/size][/b][/center]\r<br />\r<br />[center][size=24]KARSTAAG RETURNS[/size][/center]\r<br />\r<br />[b]What it does:[/b]\r<br />\r<br />This mod allows you to regain the ability to summon Karstaag by returning to his castle to do battle with him again.\r<br />\r<br />Normally, after you complete the quest and summon Karstaag for the third time, he&#39;s gone for good. There is no way to get the spell back. With this mod, after you lose the spell, you can go back to Castle Karstaag and approach his throne, at which point he will reappear. Once you defeat him, you will regain the ability to summon him three more times. You can repeat this process as many times as you like.\r<br />\r<br />There are mods out there which simply remove the restriction on the number of times to summon him altogether, however I find that a bit OP, seeing as how Karstaag is such a murder machine. So I made this mod which does it a bit differently.\r<br />\r<br />Note that Karstaag will not reappear as soon as you enter the throne room. You have to actually approach the throne to get him to appear.\r<br />\r<br />[b]Installation:[/b]\r<br />\r<br />Place the contents of the archive in your Skyrim/Data directory.\r<br />\r<br />You can install this mod at any time: before you start the Karstaag quest, during the quest, after the quest, even after you have already summoned him three times and lost the power. I would discourage activating it on a save where you are actually in the throne room, though.\r<br />\r<br />You can uninstall it as well. Be sure you don&#39;t have the Karstaag summon active when you do. If you have re-fought Karstaag at least once, you will lose the spell when you uninstall (you will NOT lose the spell if you uninstall and you&#39;ve only fought Karstaag the one and only time - this mod doesn&#39;t do anything until after you have summoned him three times).\r<br />\r<br />[b]Compatibility:[/b]\r<br />\r<br />This mod doesn&#39;t touch the original Karstaag quest, or any vanilla forms for that matter, however it does query the original quest to see what state it&#39;s in. So, mods that make major changes to the Karstaag quest might not be compatible. Naturally, any mod that removes the restriction on the reward spell will prevent this mod from ever taking effect, as well.\r<br />\r<br />Minor bug fixes to the quest are probably fine, but the UDBP doesn&#39;t touch this quest as of 2.0.7. If in the future it does, and a compatibility patch is required, I will provide one. I won&#39;t provide compatibility patches for any other mods though, so don&#39;t ask.\r<br />\r<br />[b]History:[/b]\r<br />\r<br />1.0 - Initial release",
  "categoryId": "35",
  "version": "1.0",
  "author": "bluedanieru",
  "createdUnix": "1414678339",
  "updatedUnix": "1414677887",
  "containsAdultContent": false,
  "uploadedBy": "bluedanieru",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133210",
      "name": "Karstaag Returns",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Karstaag Returns-59512-1-0.zip",
      "uploadedUnix": "1414677887",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9639ac129b183028a084abc9efe511074bf00df4a7e6eaa5f7fe7012992f52a1/analysis/1414677962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Karstaag%20Returns-59512-1-0.zip?fid=1000133210&ttl=1535846762&ri=8192&rs=8192&setec=bf36abe41f7ce9b17a568f2e3befafc6"
    }
  ]
}