{
  "modId": 59565.0,
  "modName": "mlrose&#39;s Enhanced Lakeview Manor - Bedroom Wing",
  "summary": "Transform your bedroom wing into two separate rooms. A library and a children&#39;s bedroom. Don&#39;t worry, NPCs won&#39;t walk across the wall. This is the first mod of a series.",
  "descriptionHtml": "[font=Georgia][img]http://i.imgur.com/7LRK3k7.png[/img]\r<br />\r<br />[size=4]It&#39;ll be a mod series to enhance the Lakeview Manor interior to something more deserved by the Dragonborn.  The idea is make a beautiful house with more space and features without the clutter of the original. I&#39;d make this only for me, after a frustrating search, but then I though &#34;There must be more people with the same need and desire that I have&#34;.\r<br />\r<br />[b]The Bedroom Wing[/b]\r<br />I really liked some mods I&#39;ve seen trough the Nexus, transforming the bedroom wing on a Suite Master, but I really wanted a library and I also want the armory. Then I started to think and found a solution: Make a children&#39;s bedroom and a library in the first floor using the bedroom wing and modify the second floor to the master suite. Then I started with the first floor and here we are. See the pics to have a better understanding of my changes.\r<br />Also, I made the changes on the navmesh, so the NPCs won&#39;t cross trough the wall that I added and, as a bonus, I changed the navmesh of the main hall just to stop NPCs from climbing on tables and chairs. \r<br />Hope you all enjoy this.\r<br />\r<br />[color=#00ff00][center][/center][center]Bravo for me. I finished the third mod and it&#39;s published. Please, take a look on the other 2 mods of this series.[/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/64927/?][img]http://i.imgur.com/dpWcVNq.png[/img][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/80407/?][img]https://staticdelivery.nexusmods.com/mods/110/images/80407-0-1479838274.png[/img][/url][/center]\r<br />[/color]\r<br />\r<br />[b][color=#ffff00][center]Please, read the entire description before installing.[/center][/color][/b][/size]\r<br />[b][size=4]Features[/size][/b]\r<br />[list][*][size=3]dividing wall in the  room (with navmesh alterations); [/size]\r<br />[/*][*][size=3]improved lighting; [/size]\r<br />[/*][*][size=3]beautiful decor and ambiance; [/size][/*]\r<br />[/list]\r<br />[list][*][size=3][b]Library:[/b][/size]\r<br />[/*][*][size=3]bookcases; [/size]\r<br />[/*][*][size=3]study table; [/size]\r<br />[/*][*][size=3]custom container for letters and notes (just because I wanted to test the customization); [/size]\r<br />[/*][*][size=3]crate for scrolls; [/size]\r<br />[/*][*][size=3]two idle marks for book reading (I also kept the other idle marks that were already there);[/size][/*]\r<br />[/list]\r<br />[list][*][size=3][b]Children&#39;s bedroom: [/b][/size]\r<br />[/*][*][size=3]wardrobes and dressers spawning only children clothes; [/size]\r<br />[/*][*][size=3]toy chest; [/size]\r<br />[/*][*][size=3]use of original childrens beds, chests and idle marks, keeping adoption system and behaviors without issues.[/size]\r<br />[/*][/list]\r<br />[size=4][b]Requirements\r<br />[/b][/size][size=3]Skyrim 1.9.32* or higher;[/size]\r<br />[size=3]Dawnguard, Hearthfire and Dragonborn DLCs.[/size]\r<br />\r<br />[size=4][b]Installation[/b][/size]\r<br />[size=3][i]*Always make back-up saves before trying new mods.*[/i]\r<br />\r<br />Make sure you are outside the Lakeview manor before installing.\r<br />Download the mod and install on NMM or download the zip manually, extract and copy the files to your Skyrim&#39;s data folder.\r<br />You need to buy and build the Lakeview Manor with the Bedroom Wing and craft only the children&#39;s beds and chests, as shown on the images. You can also build the exterior furnishes if you want. Then remove the workbench of the room.\r<br />\r<br />I tested installing and activating the mod before even build the bedroom wing and didn&#39;t had any issues, but you can build the wing with the beds an chests before activating the mod if you think it&#39;s more safe. Both ways works fine.\r<br />\r<br />I didn&#39;t tested with the room fully furnished, but you can give it try and send me the results.\r<br />\r<br />[/size][size=4][b]Update\r<br />[/b][/size][size=3]For safety, remove any items from the storages that you want to keep, leave the manor and save your game before update.[/size]\r<br />[size=3]Just remove the old files manually or through NMM and install the new ones. You&#39;re ready to play again.[/size]\r<br />\r<br />[size=4][b]Compatibility[/b]\r<br />[/size][size=3]This mod should be compatible with any mods that don&#39;t change the west wing of the Lakeview Manor. Also, if you use any other Lakeview interior mods, put my mod after the others on the load order or you won&#39;t use my navmesh alterations.\r<br />If you&#39;re using more ELM mods, download the merged navmesh file through the link bellow. Just install and put after the ELM main files in the load order. If you find any problems or bugs let me know.\r<br />\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/66321/?][img]http://i.imgur.com/q1d2eq0.png[/img][/url][/center][center][/center][/size]\r<br />\r<br />[size=4][b]Uninstall[/b]\r<br />[/size][size=3]Before uninstall, remove any items from the room that you want to keep, leave the manor and make a hard save. Then you can uninstall the mod in NMM or delete the files from your data folder. Load your save and save again. Done.[/size]\r<br />\r<br />[size=4][b]Future Plans[/b][/size]\r<br />[/font][size=3]\r<br />My future plans aren&#39;t very clear anymore. As I said before, my installed mods are changed and I have to rethink some things.\r<br />\r<br />I just can say that my next step will be the refurnishing of the rest of Main Hall. I&#39;ll change some structure, like the second floor walls and the fireplace.\r<br />\r<br />If you take a good look in the fireplace, the shape of the chimney on the second floor is perpendicular to the first floor. It&#39;s really odd. I&#39;ll fix that and then I&#39;ll have to change the walls in second floor too. Lots of work, including mesh editing.\r<br />\r<br />If you have any ideas about the main hall or about other rooms, please, let me know. I&#39;ll analize every idea.\r<br />[/size]",
  "categoryId": "67",
  "version": "1.1",
  "author": "mlrose",
  "createdUnix": "1415040756",
  "updatedUnix": "1415299458",
  "containsAdultContent": false,
  "uploadedBy": "mlrose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133806",
      "name": "mlrose&#39;s Enhanced Lakeview Manor - Bedroom Wing",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "602",
      "fileName": "mlrose's Enhanced Lakeview Manor - Bedroom Wing-59565-1-0.zip",
      "uploadedUnix": "1415039217",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/10195d8098dc2e9f907d33eee2b267a6d1fb73a1bb67947a3a05496aad2a4aac/analysis/1415039285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mlrose%27s%20Enhanced%20Lakeview%20Manor%20-%20Bedroom%20Wing-59565-1-0.zip?fid=1000133806&ttl=1535846861&ri=8192&rs=8192&setec=83543c714975650a54b74912889d8929"
    },
    {
      "fileId": "1000134172",
      "name": "mlrose&#39;s Enhanced Lakeview Manor - Bedroom Wing v1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "603",
      "fileName": "mlrose's Enhanced Lakeview Manor - Bedroom Wing v1.1-59565-1-1.zip",
      "uploadedUnix": "1415299458",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2d0cf9051f85824f751818f7f3818986467f78c1327a454c02a4238f51a715e2/analysis/1415299563/",
      "changelogHtml": " Texture changed from central column (added wall) <br/> \n Maybe it&#39;s solved the problem of flying candles. Need feedback. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/mlrose%27s%20Enhanced%20Lakeview%20Manor%20-%20Bedroom%20Wing%20v1.1-59565-1-1.zip?fid=1000134172&ttl=1535846862&ri=8192&rs=8192&setec=649895a838fa031b3ed740fa8b3281f3"
    }
  ]
}