{
  "modId": 59619.0,
  "modName": "QuickDrop",
  "summary": "Bind hotkeys that allow you to quickly drop or keep the last few items you picked up - without ever having to open your inventory&#33;",
  "descriptionHtml": "[b][color=#1e84cc][size=4][youtube]j2-wH9WG6wk[/youtube][youtube]clOB1zw6g8c[/youtube]\r<br />[youtube]YB8PY5RydiI[/youtube][/size][/color][/b]\r<br />\r<br />[size=2]Thanks to Gopher, Nozi87 (QuickDrop coverage starts at 7:15), and Altair for the videos.[/size]\r<br />\r<br />[b][color=#1e84cc][size=4]HAPPY NEW YEAR - IT&#39;S QUICKDROP 2.0&#33;[/size][/color][/b]\r<br />\r<br />QuickDrop 2.0 is released&#33;  See below for the full list of changes.\r<br />\r<br />[color=#1e84cc][size=4][b]OVERVIEW[/b][/size][/color]\r<br />\r<br />QuickDrop lets you bind up to five hotkeys that allow you to quickly drop or keep the last few items you picked up without ever opening your inventory.  Have you ever tried to focus your crosshair on a soul gem, only to accidentally pick up a piece of random dungeon clutter, instead?  The days of opening your inventory to get rid of it are over - just tap the &#34;Drop Current Item&#34; hotkey to spit that clutter right back up&#33;  Want to move your collection of Bugs in Jars across your house?  Pick them up, walk across the room, and tap the &#34;Drop All Items&#34; hotkey to drop them all at once&#33;\r<br />\r<br />New in 2.0, you can also put items back in exactly the same spot you picked them up&#33;\r<br />\r<br />[color=#1e84cc][size=4][b]REQUIREMENTS[/b][/size][/color]\r<br />\r<br />[list=1][*][size=2]SKSE[/size][/*]\r<br />[*][size=2]SkyUI 4.1[/size][/*]\r<br />[/list]\r<br />[b][color=#1e84cc][size=4]UPDATING TO 2.0\r<br />\r<br />[/size][/color][/b]I can&#39;t recommend updating on an existing save - Skyrim&#39;s script engine is just too finicky.  If you&#39;d like to give it a shot, see the readme for a proposed method, and remember to back up your save&#33;\r<br />\r<br />If you&#39;re updating before starting a new game, just uninstall QuickDrop 1.0 and install QuickDrop 2.0.\r<br />\r<br />[b][color=#1e84cc][size=4]INSTALLATION\r<br />[/size][/color][/b]\r<br />Recommended: install and uninstall with NMM.\r<br />\r<br />To install manually, copy QuickDrop.esp and QuickDrop.bsa to your Skyrim/Data directory.  To uninstall manually, remove those two files.\r<br />\r<br />I can&#39;t recommend uninstalling QuickDrop from an existing save - Skyrim&#39;s script engine is just too finicky.  If you&#39;d like to give it a shot, see the readme for a proposed method, and remember to back up your save&#33;\r<br />\r<br />[b][color=#1e84cc][size=4]USAGE[/size][/color][/b]\r<br />\r<br />[img]https://dl.dropboxusercontent.com/u/20578437/QuickDrop%20MCM%20Screens/2014-12-30_00013.jpg[/img]\r<br />\r<br />QuickDrop remembers the last few items you picked up in a stack: last in, first out.  If you pick up a Red Mountain Flower, a Tundra Cotton, and an Iron Dagger, QuickDrop will remember that you last picked up an Iron Dagger, and before that a Tundra Cotton, and before that a Red Mountain Flower.\r<br />\r<br />[b]THE STACK MENU\r<br />\r<br />[/b][img]https://dl.dropboxusercontent.com/u/20578437/QuickDrop%20MCM%20Screens/2014-12-30_00014.jpg[/img]\r<br />\r<br />Here, you can manipulate your stack with a GUI as elegant as the MCM allows.  The right pane shows a list, in top-down stack order, of the items currently on your QuickDrop stack.  Mouse over each item to see a brief description of what it is, how many of it there are, where it came from, and whether it can currently be replaced at its original location. Click on the item to select it or deselect it.\r<br />\r<br />The &#34;selection&#34; options on the bottom left allow you to invert your selection, select all of your items, or unselect all of your items.\r<br />\r<br />Use &#34;Clear Locations From Selection&#34; to clean out any unneeded location data from the selected items.  This data allows the item to be replaced back at its original world location or back in its original container.  If you don&#39;t plan on replacing the item, you can clear its location data to free up whatever memory that data was occupying.  This option probably won&#39;t be terribly important to the average user.\r<br />\r<br />&#34;Drop Selected&#34; and &#34;Keep Selected&#34; do just what they say: drop all of the selected items from your inventory and remove them from your stack, or keep all of the selected items in your inventory and remove them from your stack.\r<br />\r<br />&#34;Move Up&#34; and &#34;Move Down&#34; are enabled when you have one and only one stack slot selected, and that slot isn&#39;t already at the top (for &#34;Move Up&#34;) or bottom (for &#34;Move Down&#34;) of the stack.  Use these options to move the selected stack slot up or down one position in the stack.\r<br />\r<br />&#34;Swap&#34; is enabled when you have exactly two stack slots selected, and swaps the positions of the two selected slots.\r<br />\r<br />&#34;Combine Up&#34; and &#34;Combine Down&#34; are enabled when you have more than one slot selected and all of your selected slots contain items of the same type.  These options allow you to combine the selected slots into one, adding the quantities of all slots together.  &#34;Combine Up&#34; will merge all slots into the top-most selected slot, and keep the location data from that slot, if any.  &#34;Combine Down&#34; does the same for the bottom-most selected slot.\r<br />\r<br />[b]THE GENERAL SETTINGS MENU\r<br />\r<br />[/b][img]https://dl.dropboxusercontent.com/u/20578437/QuickDrop%20MCM%20Screens/2014-12-30_00015.jpg[/img]\r<br />\r<br />Your Hotkeys are in the left pane of this menu.\r<br />[list][*][size=2]Toggle Remembering: Toggles the remembering of new items on and off when tapped.[/size][/*]\r<br />[*][size=2]Show Current Item: Displays a message in the upper left hand corner of the screen showing the item currently on top of the stack of remembered items.[/size][/*]\r<br />[*][size=2]Drop Current Item: Try to replace and/or drop the item on top of the stack of remembered items. The item below it in the stack, if any, becomes the new top of the stack. Depending on your settings, your stack might not actually be modified by this action - if, for example, you try to replace an item, but are too far away, and you don&#39;t have &#34;Drop on Fail to Replace&#34; checked.[/size][/*]\r<br />[*][size=2]Keep Current Item: Keep the item on top of the stack of remembered items. The item below it in the stack, if any, becomes the new top of the stack.[/size][/*]\r<br />[*][size=2]Drop All Items: Try to replace and/or drop all of the items in the stack of remembered items. The stack is cleared if every item was successfully dropped/replaced, but some items might remain, depending on your settings.[/size][/*]\r<br />[*][size=2]Keep All Items: Keep all of the items in the stack of remembered items. The stack is cleared.[/size][/*]\r<br />[/list][size=2]\r<br />&#34;Items Remembered&#34; is the number of stack slots you have available.  It currently maxes out at 10.  When you pick up a new item, all of the other items are pushed down one slot. If the stack is full, then the bottom-most slot gets overwritten. Nothing actually happens to the item stored in that slot, but QuickDrop will no longer know about that item or be able to drop or replace it for you.\r<br />\r<br />&#34;When Items Removed&#34; gives you two options for handling the case in which items that QuickDrop is remembering get removed from outside of QuickDrop - maybe you consume them, or sell them, or put them in a container from your inventory menu.  &#34;Forget First&#34; causes QuickDrop to behave as though any item removed this way is the most recent one that it has remembered, and so any items of the type removed will be removed from your stack immediately, starting from the top down.  &#34;Forget Last&#34; causes QuickDrop to behave as though any item removed this way is the [i]least [/i]recent one that it has remembered - so long ago that it might not even be in your stack anymore&#33;  Here, QuickDrop will remove the item from your stack starting from the bottom up, but only if there aren&#39;t enough of the item left in your inventory to match the number that you have in your stack.\r<br />\r<br />[/size]&#34;Remember New Items&#34; turns QuickDrop&#39;s item remembering on and off.  When this is off, your stack is frozen: no new items will get pushed onto the top when you pick them up.  When it&#39;s on, you&#39;re remembering new items like normal.  This can be togged in-game with the &#34;Toggle Remembering&#34; hotkey.\r<br />\r<br />[b]THE PICKUP/DROP MENU\r<br />\r<br />[b][color=#1e84cc][size=4][img]https://dl.dropboxusercontent.com/u/20578437/QuickDrop%20MCM%20Screens/2014-12-30_00016.jpg[/img][/size][/color][/b]\r<br />[/b]\r<br />This menu provides options for remembering your items when you pick them up and displaying relevant notifications when you pick up, drop, or keep items.\r<br />\r<br />Under &#34;Remembering Picked Up Items,&#34; you can select one of the four options:\r<br />[list][*]Remember Number Picked Up: The item(s) that you just picked up, along with the quantity that you just picked up, are remembered in one stack slot.  The &#34;Max Per Slot&#34; option modifies this option: if set, then only this number will be remembered in each slot. If you pick up more items than fit in one slot, they will spill over into a new slot. As many slots will be filled with this number of items as is needed to remember what you picked up or as will fit in your stack.[/*]\r<br />[*]Remember to One Stack Slot: Whenever you pick up a new item, QuickDrop checks to see if you already have item(s) of that type remembered.  If you do, QuickDrop combines them all in one slot, and moves that slot to the top of your stack. &#34;Max In Combined Slot&#34; modifies this option: if set, the combined stack slot will only be filled with up to this many items, at which point new items of this type will stop being remembered.[/*]\r<br />[*]Remember Each Individually: If you pick up one or more items, each of the items will remembered to an individual stack slot.  &#34;Max To Remember&#34; modifies this behavior: if set, QuickDrop will only remember this many individually.[/*]\r<br />[*]Remember Only Some Picked Up: If you pick up one or more items, QuickDrop will hold them in one stack slot, but will only remember up to as many as specified by &#34;Max To Remember.&#34;[/*]\r<br />[/list]\r<br />&#34;Remember Persistent Items&#34; will allow QuickDrop to remember any item that has a persistent reference, which it otherwise won&#39;t do. This includes all quest items, but includes many other items, as well.  Most users will probably want to enable this option. Just be careful about dropping quest items - it might break quest progression&#33; [b][i][color=#ffff00]IF YOU&#39;RE WONDERING WHY QUICKDROP DIDN&#39;T REMEMBER THAT THING YOU PICKED UP, THIS OPTION IS PROBABLY THE ANSWER&#33;[/color][/i][/b]\r<br />\r<br />In the right hand pane are notifications. &#34;Item Dropped&#34; will display a notification whenever you drop an item. &#34;Item Kept&#34; displays a notification when you keep an item. &#34;Persistent Items&#34; displays a notification when an item that you just picked up has a persistent reference.  If you have &#34;Remember Persistent Items&#34; enabled, it tells you what the item was and that it had a persistent reference; otherwise, it tells you that the item was persistent and so was not remembered.\r<br />\r<br />[b]THE REPLACE MENU\r<br />[/b]\r<br />[img]https://dl.dropboxusercontent.com/u/20578437/QuickDrop%20MCM%20Screens/2014-12-30_00017.jpg[/img]\r<br />Here, you can tell QuickDrop whether and how it should try to replace items in their original locations.\r<br />\r<br />The &#34;Replace in Container&#34; and &#34;Replace in World&#34; options are closely mirrored.  The &#34;Replace in Container&#34; options allow you to replace items that you picked up from a container back in their original container, and the &#34;Replace in World&#34; options allow you to replace items that you picked up from the game world back at exactly their original location and position.\r<br />\r<br />The &#34;Replace&#34; option tells QuickDrop whether it should try to replace items. The &#34;Distance&#34; slider allows you adjust the distance from which you can perform this type of replacement. When this slider is set to 0, you can replace items from anywhere in the game world&#33;  By default, the distance is set to 250 units, which is slightly further away than it takes to trigger the crosshair context menu.  &#34;Drop if Can&#39;t Replace&#34; will cause the item to be dropped if you were too far away to replace it.  And finally, &#34;Always Remember&#34; will tell QuickDrop to remember locations even if it hasn&#39;t been instructed to replace items.\r<br />\r<br />Be aware that remembering containers and world locations creates some persistent references, which can contribute to script bloat and increase your savegame filesize, but unless you&#39;ve got so many mods installed that you need to very carefully manage your memory, this probably shouldn&#39;t be an issue.\r<br />\r<br />Also be aware that the game considers a LOT of things containers.  For example, when you buy items from a vendor, QuickDrop will remember the vendor as a container. Replacing the item will give it back to the vendor&#33; For free&#33;&#33;&#33; You probably don&#39;t want that, so tread carefully.\r<br />\r<br />[b][color=#1e84cc][size=4]KNOWN ISSUES[/size][/color]\r<br />[/b]\r<br />[list][*][size=2]The &#34;Stack&#34; MCM menu isn&#39;t 100% user friendly. Every time you click on an &#34;Options&#34; option, you will have to move your mouse completely off of the option and then back onto it in order to click it again, if it&#39;s still enabled. This is a limitation of the MCM, and not something I can fix - trust me, I tried.[/size][/*]\r<br />[*][size=2][s]Opening and closing the &#34;Remembered Items&#34; slider without changing its value when its value is 10 and all 10 slots in your remembered items stack are full may cause some very, very strange behavior. If you encounter this bug, reload a save from before you opened and closed the slider.[/s] FIXED in 2.0.[/size][/*]\r<br />[/list]\r<br />[b][color=#1e84cc][size=4]NEW IN VERSION 2.0[/size][/color][/b]\r<br />\r<br />[list][*][size=2]Fixed the bug where opening and closing the Remembered Items slider without changing its value while its value is 10 and you have 10 items remembered might wreck everything.[/size][/*]\r<br />[*][size=2]Added new &#34;Quantity Handling&#34; option - &#34;Remember to One Slot.&#34;  When you pick up an item(s) of a type that you already have remembered, they get combined in one stack slot with the others that you already have remembered, and that slot gets moved to the top of your stack.  Great for accumulating a bunch of dumb clutter and dropping it in one go. The name &#34;Quantity Handling&#34; has also be changed.[/size][/*]\r<br />[*][size=2]The QuickDrop stack now updates if you drop remembered items from your inventory or through other means outside of QuickDrop. You can choose whether the items dropped outside of QuickDrop are forgotten bottom-up from your remembered items stack or top-down.[/size][/*]\r<br />[*][size=2]Added the ability to toggle item remembering on and off, so that you can freeze your stack of remembered items (barring items being removed outside of QuickDrop).[/size][/*]\r<br />[*][size=2]Added the ability to remember items with persistent references.[/size][/*]\r<br />[*][size=2]Added the ability to replace items in the containers they originally came from, if any.  Also added a slider that lets you adjust how far you can be from the container before this is no longer allowed, in case it breaks your immersion to chuck items back in their containers from all the way across the world. A new set of notification options accompanies this option, given that replacing an item in a container doesn&#39;t provide visual feedback like dropping an item does.[/size][/*]\r<br />[*][size=2]Added the ability to replace items that were picked up from the world back in their original locations.  As with replacing in containers, you can set the distance from which you&#39;re allowed to replace objects in the world and set notifications that tell you all about what&#39;s happening.[/size][/*]\r<br />[*][size=2]Added in-menu stack manipulation. You can manipulate your stack directly from the MCM &#34;Stack&#34; submenu, using a GUI as fully-featured as the MCM allows.[/size][/*]\r<br />[*][size=2]Added an MCM command that clears location/container data.  If you decide you don&#39;t want to replace in containers/in the world after all, this option will clean out references to world locations, freeing memory and reducing savegame bloat.[/size][/*]\r<br />[/list]\r<br />[color=#1e84cc][size=4][b]BACKLOG[/b][/size][/color]\r<br />\r<br />[list][*][size=2]Drop-to-Hands Hotkey: The home decorator&#39;s dream&#33; Tap a hotkey to put the item on the top of your stack directly in your hands&#33;  Is it even possible with Papyrus?  Beats me&#33;  But if there is a way, I&#39;ll find it. [i]Currently, this doesn&#39;t appear to be possible in a straightforward way - neither vanilla Papyrus nor SKSE provide an easy way to make the player grab a specific reference. I might be able to apply a custom TelekenisisEffect spell to the item right as it&#39;s dropped for the same effect?  To the lab&#33;[/i][/size][/*]\r<br />[*][size=2]Larger Stacks with Rudimentary Memory Management: The only thing stopping me from making the stack 100 items long is that fact that 100-item arrays for item type, quantity, and location data would be allocated, even if they were mostly empty, and that&#39;s a waste of precious memory, which Skyrim isn&#39;t great at dealing with.  I&#39;ll split my stack off into a proper re-usable data structure and add methods that can reallocate the arrays when they grow too large.  Thanks to Papyrus&#39;s beautiful feature set, this means a massive if-else that checks for size.  These ain&#39;t your dad&#39;s vectors; his were a lot goddamn better.[/size][/*]\r<br />[*][size=2]Stack Whitelist & Blacklist: Filter the items remembered based on a Whitelist and/or a Blacklist.  With the Whitelist, only items on the list are remembered; with the Blacklist, items on the list are never remembered.[/size][/*]\r<br />[*][size=2]Blacklist/Whitelist on Keep/Drop: When you keep or drop an item, automatically add it to your Whitelist/Blacklist.[/size][/*]\r<br />[*][size=2]Auto-Drop: If you pick up an item that&#39;s filtered by your Blacklist/Whitelist, spit it back out immediately, no hotkey required&#33; You&#39;ll also be able to set where you want it spat: in front of you, behind you, to your left, or to your right, so it won&#39;t immediately get in your way again.[/size][/*]\r<br />[*][size=2]Export Whitelists & Blacklists: The magic of FISS will be required here.  Export your Whitelist & Blacklist to use them across saves, or let another user do all the hard work of building a list so that you can download their preset and enjoy immediately auto-dropping stupid clutter.[/size][/*]\r<br />[*][size=2]Multiple Stacks: That&#39;s right&#33; More than one stack&#33;  And each one gets it own Blacklist and/or Whitelist&#33;  You&#39;ll be able to let items trickle down into the first stack that they&#39;re not filtered out of, making these some reg&#39;lar Bags of Holding.[/size][/*]\r<br />[*][size=2]Drop to Container/Drop All to Container Hotkeys: Remember when I said Bags of Holding?  Focus on a container and tap these hotkeys to transfer your current item/your entire stack to that container&#33; This may also be an extension of the current Drop/Drop All hotkeys, so that I&#39;m not taking up your entire keyboard all of a sudden.[/size][/*]\r<br />[/list][size=2]\r<br />[/size][color=#1e84cc][size=4][b]MY OTHER WORK\r<br />[/b][/size][/color]\r<br />[list][*][size=2][url=http://www.nexusmods.com/skyrim/mods/49056/]Stackable Stones of Barenziah with Optional Quest Markers[/url] - A bugfix that gets the Stones of Barenziah stacking properly in your inventory, so they don&#39;t clutter up multiple lines anymore. It also gives you the option to set quest markers on the Stones of Barenziah, in case you grow tired of looking for them.[/size][/*]\r<br />[/list]\r<br />[b][color=#1e84cc][size=4]CREDITS[/size][/color]\r<br />[/b]\r<br />The Skyrim logo in the comic was photoshopp&#39;d up by [url=http://lady-elizriel.deviantart.com/art/Skyrim-Logo-For-Your-Skyrim-Needs-291034404]lady-elizriel[/url].\r<br />[size=2]Fonts used in the comic:\r<br />[/size][list][*][size=2][url=http://www.dafont.com/damn-noisy-kids.font]Damn Noisy Kids[/url][/size]\r<br />[/*][*][size=2][url=http://www.dafont.com/sf-comic-script.font]SF Comic Script[/url][/size]\r<br />[/*][*][size=2][url=http://www.dafont.com/anim-ace.font]Anime Ace[/url][/size]\r<br />[/*][*][url=http://www.dafont.com/snot.font][size=2]Snot[/size][/url]\r<br />[/*][/list]",
  "categoryId": "24",
  "version": "2.0",
  "author": "geekofalltrades",
  "createdUnix": "1414990871",
  "updatedUnix": "1419988084",
  "containsAdultContent": false,
  "uploadedBy": "thegeekofalltrades",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133742",
      "name": "QuickDrop",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "QuickDrop-59619-1-0.7z",
      "uploadedUnix": "1414990061",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a4745aad1d7d39348477ef1c49a4028f3f67f0e7390912db0e7c447d8ba0c83f/analysis/1414990141/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/QuickDrop-59619-1-0.7z?fid=1000133742&ttl=1535846935&ri=8192&rs=8192&setec=39033fca8aa86e72b5d1fd7cd6d1a7cb"
    },
    {
      "fileId": "1000140768",
      "name": "QuickDrop",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46",
      "fileName": "QuickDrop-59619-2-0.7z",
      "uploadedUnix": "1419988084",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e46e3d8d1259d13728c41e0177cd6a54f9414a9f4ab0a08ecbc3dd5dc476ba7d/analysis/1419988142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/QuickDrop-59619-2-0.7z?fid=1000140768&ttl=1535846936&ri=8192&rs=8192&setec=aec13f6d253617a3e4640c282e17d416"
    }
  ]
}