{
  "modId": 59621.0,
  "modName": "Macromancy Revamp",
  "summary": "A revamp to MacroMancy with a few additions from the Size-Spell Effects mod&#33; The coding is redone to include new features for the player and the followers. Everything is more complex to allow new mechanics such as spell legendary buffs, spell interference, spell resistance, and other features&#33; ",
  "descriptionHtml": "A revamp to MacroMancy with a few additions from the Size-Spell Effects mod&#33; The coding is redone to include new features for the player and the followers. Everything is more complex to allow new mechanics such as spell legendary buffs, spell interference, spell resistance, and other features&#33; \r<br />\r<br />The mod will keep track of any changes while the mod is in use, and will be able turn all changes back to the character&#39;s original stats before the mod took effect (level up changes should still remain after unloading the mod). I also have the mod doing basic calculations for non-follower NPCs in case they are ever effected by the mod. The moment size has been altered in the game, it will automatically add the main spell without needing you to purchase it&#33; \r<br />\r<br />When your size is reduced, your damage output, speed, stamina, and health are lowered. You&#39;ll have to be more careful picking fights when you&#39;re too weak to deal damage. Poison is temporary, but certain spells, and weapons are permanent. Because of size alteration on poison, traps have become sightly more menacing. Try being careful around one :)\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Spells are similar to MacroMancy&#39;s version, but slightly different changes to them:\r<br />   \r<br />[list][*][size=2]Diminish ~ Absorbs size from target[/size][/*]\r<br />[*][size=2]Enlarge ~ Increase a target&#39;s size. If you have no more size to give, you will receieve a notification[/size][/*]\r<br />[*][size=2]Maximum ~ Slowly grow to your maximum stored height. The spell is set on specific values. If your size is altered while this spell is active, you will stop growing.[/size][/*]\r<br />[*][size=2]Revitalize ~ Restore to your original height. If your size is altered while spell is active, the spell will stop, and you are notified.[/size]    \r<br />[/*]\r<br />[/list]\r<br />Every spell except for Diminsh will have notifications for either completions, interruptions, or lack of requirements. All spells will become stronger as you increase Alteration, and if you reach legenadary status on a perk, you&#39;ll gain a bonus on the skill. It&#39;ll become stronger quicker (without being too broken). \r<br />   \r<br />Potions from the Size Spell Effects mod are incorporated, but the effectiveness is slightly changed:       \r<br />\r<br />[list][*][size=2]Weak Growth/Shrink Potions make you grow/shrink slowly until you reach a certain time. If your size is altered during the potion&#39;s effects, you will receive a 10% reduction (you will end up 10% shorter than the potion&#39;s intended effect). You&#39;ll notice this when you see &#34;You are feeling a bit dizzy&#34; appears.[/size][/*]\r<br />[*][size=2]Permanent Growth/Shrink Potions function just like its name suggests. You&#39;ll get a 0.25 increase/decrease to your size permanently.[/size]   \r<br />[/*]\r<br />[/list]\r<br />Enchanted weapons can only be crafted at the forge. All weapons have 10 hits in them before losing its size alteration abilities. Best thing is that the weapons are the least to ignore any resistance, making it good for a strong enemy that dishes a lot of damage. The weapons use your alteration as a base for the strength in the reduction. As of now, there&#39;s not real downside to using this. So I might come up with one in the next revision :)\r<br />\r<br />Diseases still function the same (Microbial Disease, Dwarfism, Skeevitis), but all diseases now has the ability to reconfigure values for restoring size if another size alteration spell/potion/poison alters the pace. \r<br />\r<br />There are a few extra additions for enemies too:   \r<br />   \r<br />[list][*][size=2]Damage Stipulation ~ Enemy will absorb damage and expand (damage is still taken)[/size][/*]\r<br />[*][size=2]Growth Chain Reaction ~ Enemy will continue to slowly grow until is killed. Growth amount is static and will gain 0.1 size every 3 seconds.[/size][/*]\r<br />[*][size=2]Shrink Stimulation ~ Enemy will make target shrink upon contact. Size lost is based on damage output of attack. (Only available for creatures)[/size]\r<br />[/*]\r<br />[/list]\r<br />All spell tomes are found at spellcaster merchants. Potions are found at alchemy merchants. Not all merchants will carry these items since I could not pull up every merchant in Creation Kit, but it&#39;ll cover mostly every merchant. \r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Keep in mind that every item/spell/etc. that affects a target can be resisted by either poison or magic resist. Enchanted weapons are the only exception. In light, I&#39;ve tried to create a way to make all types of weapons useable throughout the game. Poison provides instanteous size reduction, but is the easiest to become nullified. Enchanted weapons are able to ignore resistance the least, but only have 10 available hits, and have slightly low output (meaning all hits are needed to gain maximum effectiveness). Spells are weak initially, but become deadly if an enemy does not possess high magic resistance to a user with high alteration. \r<br />\r<br />One thing I know people wanted was to see creatures change in size when the mod is effecting them. I made the visual effect happen; however, the skeleton does not have any method to be scaled through script. If people prefer the scale to remain the same, I can make another version of this mod.\r<br />\r<br />The calculations for everything have been changed. So if you find any issue or notice something is stronger than normal, let me know so I can address them in later revisions.\r<br />\r<br />To install, extract the RAR file, and drop the contents into the Skyrim folder. [u][i][b]Load this mod last if you are using MacroMancy 2 and/or Size Change Spell Effects. [/b][/i][/u]\r<br />\r<br />To uninstall, pull up the console and set your fame to 1.234567890. The macromanger mod will give you a notification when the program is successfully removed. This is the same for any other NPC/Creature in game, but as long as you have the mod active, the game can forcefully add the manager.    \r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Future additions:\r<br />Enemy given chance to have (and use) size enchanted weapons\r<br />Computer AI to refuse fighting (and even run away) when size is reduced to a certain amount against opponents\r<br />\r<br />Credits: Harbringer86, Vanax8991, & lxlhunter",
  "categoryId": "24",
  "version": "1.2",
  "author": "Reikel",
  "createdUnix": "1414993336",
  "updatedUnix": "1415323253",
  "containsAdultContent": false,
  "uploadedBy": "Reikel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133746",
      "name": "MacroRevamp 1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "140",
      "fileName": "MacroRevamp 1.0-59621-1-0.rar",
      "uploadedUnix": "1414993329",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/78fb479a8cb57a7a500d01e2d8f6e28ef4f00ed3270e5377580988d745bdf657/analysis/1414993385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MacroRevamp%201.0-59621-1-0.rar?fid=1000133746&ttl=1535846939&ri=8192&rs=8192&setec=a28b8c7be6ceac1a5cea809d558b6e77"
    },
    {
      "fileId": "1000133979",
      "name": "Macro Revamp 1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "139",
      "fileName": "Macro Revamp 1.1-59621-1-1.rar",
      "uploadedUnix": "1415168279",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4bb83c12b5f383bfce92653c3d01759e664354418daffd70b0499a2ada018a50/analysis/1415168343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Macro%20Revamp%201.1-59621-1-1.rar?fid=1000133979&ttl=1535846939&ri=8192&rs=8192&setec=76f118a5043b31bd3ae2a816fbb12559"
    },
    {
      "fileId": "1000134213",
      "name": "MacroRevamp 1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "139",
      "fileName": "MacroRevamp 1.2-59621-1-2.rar",
      "uploadedUnix": "1415323253",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/50e4aac0a78f9b44b87c6f07b61a326e183692741db2e020114e4cc093e1a584/analysis/1415323322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MacroRevamp%201.2-59621-1-2.rar?fid=1000134213&ttl=1535846940&ri=8192&rs=8192&setec=000083ef25d36d10871a29b37725ec8c"
    }
  ]
}