{
  "modId": 59637.0,
  "modName": "Dovakiin Armor Set from Trailer",
  "summary": "Have you ever wanted to play the build of the Dovakiin warrior from the trailer but were afraid of not being able to do it with such a low quality armor set ? Fear no more, with this mod you will reach a daedric class armor with the looks of the Dovakiin warrior armor set.",
  "descriptionHtml": "[color=#ff7700][size=3]Description.[/size][/color]\r<br />\r<br />You wanted to play the Dovakiin warrior from the trailer but... Hey, with that studded armor I can&#39;t reach high levels, and that steel sword does not deal much damage either. If you felt frustrated then this mod is for you. \r<br />\r<br />This mod provides a 5 complete armor sets including shield and sword ranging from vanilla class set to daedric class set, all with the same looks of the trailer.\r<br />\r<br />The 5 sets are vanilla, dwarven, orcish, ebony and daedric. Each set mimics the stats of the category they are under, they are all craftable and temperable with the same requirements for the category they represent. So to craft the cuirass of the 5th set (daedric) you will need to have the daedric perk and have 3 leather strips, 5 ebony ingots and 1 daedra heart, same as the real daedric cuirass.\r<br />\r<br />The stats are the same of their counterparts so there is no breaking game with two exceptions, 1st the studded armor (light armor) was converted to a heavy armor so you won&#39;t need to invest perks on both light and heavy armor trees and could take advantage of the Matching Set perk, also was given in the 1st set the armor rating of the banded iron cuirass so it won&#39;t be a huge gap between the vanilla cuirass and the dwarven and 2nd the sword of the 3rd set (orcich) was given a damage value between the dwarven and the ebony becouse the orcish sword has less damage than the dwarven.\r<br />\r<br />All in all using this mod is the same as using the vanilla sets, progressing through the different armor categories.\r<br />\r<br />\r<br />[color=#ff7700][size=3]Where to Find.\r<br />\r<br />[/size][/color]You can find the complete first set in the potions barrel at Helgen Keep so you can start from the beginning if you like. The set includes 2 swords in case you like dual wielding. If you have a running game you need to craft it, 1st set (vanilla) no requirements, then the smithing requirements of the category.\r<br />\r<br />\r<br />[color=#ff7700][size=3]Credits.\r<br />\r<br />[/size][/color]A big thanks to [url=http://www.nexusmods.com/skyrim/users/4426004/?]murder5[/url] for giving me the idea and for providing some captures.\r<br />\r<br />",
  "categoryId": "36",
  "version": "1.0",
  "author": "OverClocked56",
  "createdUnix": "1415044292",
  "updatedUnix": "1415042719",
  "containsAdultContent": false,
  "uploadedBy": "OverClocked56",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133815",
      "name": "DovakiinArmorSet",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "DovakiinArmorSet-59637-1-0.7z",
      "uploadedUnix": "1415042719",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a272dc143bfe876c73eaf1d4f83813e4e98bde50a9dc78df0d649a4810c5968/analysis/1415042823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DovakiinArmorSet-59637-1-0.7z?fid=1000133815&ttl=1535846964&ri=8192&rs=8192&setec=a853314d840766fe10548eaa3184b9a4"
    }
  ]
}