{
  "modId": 59658.0,
  "modName": "LC_BecomeJarlofIvarstead_German_Translation",
  "summary": "Die deutsche V 1.3 Übersetzung des grandiosen DLC LC_BecomeJarlofIvarstead von Locaster.\r<br />\r<br />Diese DLC legt dem Spieler eine neue Art des Spielens auf. Das Drachenblut erhält die Möglichkeit als Jarl seiner eigenen Burg und Stadt zu fungieren. Es ist keine einfache Hausmod, denn man hat einiges zu tun um den Titel des Jarl zu erhalten. ",
  "descriptionHtml": "Quicktext;\r<br />Diese DLC weist dem Spieler eine neue Art des Spielens auf. Das Drachenblut erhält die Möglichkeit als Jarl seiner eigenen Burg und Stadt zu fungieren. Dies ist keine einfache Hausmod, denn man hat einiges zu tun um den Titel des Jarl zu erhalten. Eine Lore-Freundliche Questline wurde mit eingefügt und auch nach Beendigung der Haupt-Quest wird das Drachenblut noch alle Handvoll zu tun haben. Versorge die Bevölkerung, Handle, lege die Steuern fest, gebe Gelage und tue all das, was ein Jarl eben so zu erledigen hat um sein Volk bei der Stange zu halten.\r<br />Voll vertonte Dialoge (auf Englisch), ein eigenes Reich, und die Rotschädel als böser Obermotz. \r<br />\r<br />Diese Übersetzung benötigt die Originalfiles von [url=http://www.nexusmods.com/skyrim/mods/51633/?]LC_BecomeJarlofIvarstead[/url] von Locastor.\r<br />\r<br />[b]Wichtig[/b]&#33;\r<br />Die Rotschädelbanditen, auf die ihr treffen werdet, sind ziemlich stark. Deshalb fangt mit dieser DLC besser erst an, wenn ihrr mindestens Stufge 15 - 20 erreicht habt. Darüber hinaus werdet ihr jede Menge Gold brauchen, spart also jedes einzelne Stück und verkauft alles was nicht Niet und Nagelfest ist.\r<br />Der Boss an sich ist auch ein ziemlicher Brocken, auch hier gilt: Für Anfänger absolut tabu bzw tödlich.\r<br />Achja, spielt fair und sammelt alles, Gold Erze etc. . Das Nutzen der Konsole könnte schwerwiegende Konsequenzen im Rahmen des DLC´s nach sich ziehen.\r<br />\r<br />Ich habe mir ein wenig Zeit genommen um die Version 1.3 der Become Jarl of Ivarstead auf den aktuellen Stand zu bringen.\r<br />Es müssten nun die Questline, Dialoge, Namen etc übersetzt sein.\r<br />\r<br />[b]#UPDATE[/b]\r<br />In 1.3b habe ich die Texte noch einmal etwas überarbeitet und z.b Namensänderungen vorgenommen.\r<br />Die Arbeiter haben nun den Namenszusatz Arbeiter. Kaptiän Magnus wurde zu Hauptmann umbenannt, da mir dies besser gefiel und es auch besser passt.\r<br />Ebenso habe ich dies mit Goldur getan, der nun den Namenszusatz Lagerverwalter bekommen hat. Ebenso wurde sein Depot in Lagerhaus umbenannt\r<br />Darüber hinaus habe ich wieder einige Schreib-,Formulierungs- und Satzbau- Fehler/Korrekturen vorgenommen.\r<br />Ich werde mich die nächsten Tage einmal durch das Script wühlen, damit auch die Anzeige in der UI übernommen wird, da dort noch einige Quests falsch getaggt sind. Da dies allerdings Neuland für mich ist, bitte ich um etwas Geduld, wenn die 1.3c nicht allzuschnell erscheinen wird.\r<br />Im nächsten Update wird dann eine von mir bearbeitete Vollversion zur Verfügung stehen. (Voraussichtlich)\r<br />\r<br />INSTALLATION:\r<br />Mit NMM: Die Übersetzung herunterladen, installieren und bei Überschreibungsanfragen auf YES TO ALL klicken.\r<br />\r<br />Ohne NMM: Die Übersetzung herunterladen und in euren Skyrim Dataordner entpacken. Beim überschreiben auf kopieren und ersetzen klicken\r<br />\r<br />Dies ist meine erste Übersetzung, deshalb bitte nicht gleich erschlagen, sollte doch etwas fehlen.\r<br />Übersetzt habe ich das Ganze mit dem TESVTranslator.\r<br />Natürlich bin ich für jegliche Kritik offen, sofern diese Konstruktiv ist.\r<br />\r<br />Mein Dank geht an:\r<br />[b]Bethesda[/b]: für ihre wirklich großartige Welt Skyrim.\r<br />[b]Locastor[/b]: Der mittlerweile leider inaktiv ist, aber mit seinen Mods ein ganzes Stück Tiefe ins Gameplay gebracht hat und diese Mod ursprünglich erstellt hat.\r<br />[b]Flammenzunge[/b]: Er hat die Vorarbeit mehr oder weniger abgenommen, hat die Übersetzung allerdings leider nicht weiter verfolgt, weshalb ich mich entschied es zu beenden.\r<br />[b]McGuffin:[/b] Für sein wirklich einsteigerfreundliches Translatormodul.\r<br />\r<br />Habt Ihr Vorschläge, oder wollt eine Mod auf Deutsch übersetzt haben?\r<br />Fragt mich an und ich schaue was sich machen lässt.",
  "categoryId": "68",
  "version": "1.3b",
  "author": "Locastor and Palpatine1989",
  "createdUnix": "1415093635",
  "updatedUnix": "1415186450",
  "containsAdultContent": false,
  "uploadedBy": "Palpatine1989",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000133894",
      "name": "LC_BecomeJarlofIvarstead_German",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1294",
      "fileName": "LC_BecomeJarlofIvarstead_German-59658-1-3.7z",
      "uploadedUnix": "1415093631",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/16bcd6ea6e0f4f12aed482c8730014eeee10e56327e53e4d51fbceb653ad627d/analysis/1415093703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LC_BecomeJarlofIvarstead_German-59658-1-3.7z?fid=1000133894&ttl=1535846988&ri=8192&rs=8192&setec=1b581b3b2e6538ff7ba8a4435648e9d5"
    },
    {
      "fileId": "1000134000",
      "name": "LC_BecomeJarlofIvarstead",
      "version": "1.3b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1294",
      "fileName": "LC_BecomeJarlofIvarstead-59658-1-3b.7z",
      "uploadedUnix": "1415186450",
      "modVersion": "1.3b",
      "virusScanUrl": "https://www.virustotal.com/file/54adb01f7adffe9b3076235d4afb9223b624a5f655c0059636cd5788ca3b4c18/analysis/1415186523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LC_BecomeJarlofIvarstead-59658-1-3b.7z?fid=1000134000&ttl=1535846989&ri=8192&rs=8192&setec=d87c8ceb32229a925cbcfb646312bb4d"
    }
  ]
}