{
  "modId": 5968.0,
  "modName": "Unique Bodies - WIP",
  "summary": "This alters what resource files the 10 playable races and their vampire forms draw upon, to let each race use a unique set of asset files.",
  "descriptionHtml": "PLEASE NOTE: This is a work in progress, and will continue to be so until we have all the proper dev tools at our disposal. At this current moment it works well for new games, but a few people have had there old games crash with this. Yeah I know that sucks but again we don\\'t have the ful CS yet and its pretty hard to guess what all is going on until we do. If you have any information that may help us catch the nefarious villain that causes this mod to crash with existing save games, then please drops us a tip in the comments section :)\r\nSo far it seems that it works better to save your game indoors before instlling this mod.\r\n\r\n\r\n~~~Current Version~~~\r\n0.86  Uss this version if you want NPC\\'s to use unique face and head assets, but be aware their faces will be few shades darker then normal. The cause for that is currently still unknown. Also race names and descriptions will be in english with this active.\r\n0.81  Use this version if you do Not need NPC\\'s to use unique face and head assets.\r\n\r\n\r\n~~~Description~~~\r\nThis alters what resource files the 10 playable races and their vampire forms draw upon, to let each race use a unique set of asset files. \r\n\r\nAs it currently stands in the vanilla game, all races use the same basic body mesh, and share many of the same texture files. While this is good for Bethesda\\'s release, it limits the user\\'s ability to give each race a more unique shape. \r\n\r\nI made this for my own personal curiosity and ease of testing new body types, but it may be helpful to anyone else who desires more variety in their game.\r\n\r\nPresently this only re-directs the basic unclothed body to use unique meshes and textures. This means that upon donning armor or robes your body will take on the shape of said robes or armor. This mod could of course be expanded to include unique torso armors as well; however that comes with its own set of complications. Unique racial armor would require actually tagging every armor set affected in the esp, and thus cause a massive compatibility issue with future mods.\r\n\r\nSo for the present, this lets you choose exactly which body type that any unclothed npc or player in your game will have.\r\n\r\nAnother use for this mod would be to make race specific texture sets. For example, if you want your orcs to actually be green, and your dark elves to actually be dark (like they were in Morrowind). In fact you can check out the extra files for a couple quick and easy recolors to demonstrate this.\r\n\r\n\r\n~~~Requirements~~~\r\nKnowledge of basic computer use\r\nKnowledge of basic mod use\r\nA little bit of time and coherent thought. Don\\'t try installing this while wasted for example.\r\nObviously this requires Skyrim\r\nMost importantly this requires you to DL the various body and texture replacers of your choice... as this file will appear to do nothing at all on its own.\r\n\r\n\r\n~~~INSTALLATION and USE~~~\r\nThe actual asset files contained in this mod are straight vanilla, and are only present as a guideline as to where you should place files from your choice of body replacer mods, and what naming structure they should be in. This mod does not contain any other author’s body mods. You can get those mods right here on the Nexus site.\r\n\r\nModders or anyone very familiar with mod usage will probably figure all of this out anyway. For everyone else, I will try to spell it out below. If my description leaves you drawing a blank, then try tinkering around for a bit, then ask what you will in the comments.\r\n\r\n\r\nInstalling this file\r\n1. Open this file with 7zip\r\n2. Highlight and drag all the contents to you \\\\Skyrim\\\\Data directory\r\n3. Toggle the UniqueBodies.esp file with the SkyrimLauncher.exe or your choice of mod manager\r\n\r\n\r\nAdding Body Replacers per race\r\n1. Open the body mod of your choice and copy its contents to a location you can remember\r\n2. Open two explorer windows (Win7 users right click the explorer icon on your taskbar to open a second instance)\r\n3. in the first explorer window navigate to the \\\\Skyrim\\\\Data\\\\Meshes\\\\Actors\\\\Character\\\\DarkElf (or whichever specific race you want. NOTE for this mod only use the folders named directly after the race i.e. use DarkElf folder instead of DarkElfFemale)\r\n4. In the second explorer window navigate to the \\\\Meshes\\\\Actors\\\\Character\\\\Character Assets folder where you unpacked the body replacer you wish to use.\r\n5. Now look over the files from the mod of your choice, and ensure the naming format matches that of the files you unpacked from Unique Bodies. It is okay if the mod you are looking at has fewer files then you see in \\\\Skyrim\\\\Data\\\\Meshes\\\\Actors\\\\Character\\\\DarkElf (or whichever race) as some cater only to males or females. The important thing is to ensure that every file in the mod has a match in your game directory where you expanded Unique Bodies. This issue will be particularly important in the case of the beast races. Sometimes the race name is appended to the file name for these races, and will have to be trimmed out by renaming the files. With a little observation you will note that all of the race specific folders this mod places into the game directory contain universally named files. Make sure the mod you want to use for that race matches this format i.e. 1stpersonfemalehandsargonian_0.nif would become 1stpersonfemalebody_0.nif\r\n6. When you are sure the naming structure is a complete match, then copy the files from your mod of choice, into \\\\Skyrim\\\\Data\\\\Meshes\\\\Actors\\\\Character\\\\DarkElf (or whichever race). Every single file you copy should be overwriting a file in here; if not then you have to redo step 5 and make sure your names are correct again.\r\n7. You can now copy those files to any of the other Race specific folder that you wish to use that particular body type.\r\nNOTE: It is advised that you do not mix bodies designed for beast races with non-beasts, and vice versa. If you want to use a non-beast body for one of the beast races, then you should probably omit any Head files. If you were to put a non-beast head onto a beast race, well, obviously the hair and many other aspects simply would not work correctly\r\n\r\n\r\nAdding Texture Replacers per race\r\nNOTE: If you are using body replacers as per above then many times you will need to also use the textures from that body replacer via the direction below.\r\n1. Open the body mod of your choice and copy its contents to a location you can remember\r\n2. Open two explorer windows (Win7 users right click the explorer icon on your taskbar to open a second instance)\r\n3. in the first explorer window navigate to the \\\\Skyrim\\\\Data\\\\textures\\\\actors\\\\character\\\\DarkElf (or whichever specific race you want. NOTE for this mod only use the folders named directly after the race i.e. use DarkElf folder instead of DarkElfFemale)\r\n4. In the second explorer window navigate to the \\\\textures\\\\actors\\\\character\\\\female (or male depending on the body mod you chose) folder where you unpacked the body replacer you wish to use.\r\n5. Now look over the files from the mod of your choice, and ensure the naming format matches that of the files you unpacked from Unique Bodies. It is okay if the mod you are looking at has fewer files then you see in \\\\Skyrim\\\\Data\\\\textures\\\\actors\\\\character\\\\DarkElf (or whichever race) as some body mods cater only to males or females. The important thing is to ensure that every file in the mod has a match in your game directory where you expanded Unique Bodies. For textures, many of the file names will need some changes because Bethesda released them with random _1\\'s after some names, and other stupid inconsistent things. With a little observation you will note that all of the race specific folders this mod places into the game directory contain universally named files. Make sure the mod you want to use for that race matches this format i.e. FemaleBody_1.dds would become FemaleBody.dds\r\n6. When you are sure the naming structure is a complete match, then copy the files from your mod of choice, into \\\\Skyrim\\\\Data\\\\Meshes\\\\Actors\\\\Character\\\\DarkElf (or whichever race). Every single file you copy should be overwriting a file in here; if not then you have to redo step 5 and make sure your names are correct again.\r\n7. You can now copy those files to any of the other Race specific folder that you wish to use that particular body type.\r\n\r\n\r\n~~~COMPATIBILITY~~~\r\nThis file does NOT tag any of the races directly, so it should be compatible with future mods that tweak things such as racial abilities and stats. It should be compatible with most any body replacer out there, provided you follow instructions and take time to check/rename the files to use the universal format of this mod.\r\n\r\n\r\n~~~Version History~~~\r\n0.80 Initial release\r\n0.81 Russian translation of the Readme added, courtesy of and thanks to Tyomanator.\r\n0.85 Now NPCs will use unique head assests. In previous versions only the player, and rare NPCs would use the correct unique assests.\r\n0.86 Race names and descriptions fixed, however they are now no longer localized and only show the english version. Detail maps are still mysteriously being used twice on npc\\'s so they have slightly darkened faces. I still have no clue what is causing that.\r\n\r\n\r\n~~~Tools Used~~~\r\nSkyedit v.31 and later v.36 (use as an esm viewer)\r\nTESVsnip (my main editor currently)\r\n\r\n\r\n~~~Credits~~~\r\nBethesda Softworks\r\nme\r\n\r\n\r\n~~~Special Thanks too~~~\r\nTyomanator for the Russian version of the Readme\r\nThanks to everyone who has commented on this file.\r\n\r\n\r\n~~~Usage~~~\r\nFeel free to use or require this file for whatever mod you are making. Just credit me for anything you distribute using this esp or a derivative of it.\r\nIf you make and distribute one of the body mods out there then feel free to include a drag and drop friendly version of it using clean names, so folk can more quickly set them up per race using this or a similar tool. ",
  "categoryId": "29",
  "version": "0.86",
  "author": "Rain The Windflower",
  "createdUnix": "1326333244",
  "updatedUnix": "1327760391",
  "containsAdultContent": true,
  "uploadedBy": "rainrtw",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19022",
      "name": "UniqeBodies_DarkerElf_Example",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1914",
      "fileName": "UniqeBodies_DarkerElf_Example-5968-1.7z",
      "uploadedUnix": "1326334025",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/90639dd7afe6d4943b64c8322408f032c6ddd547a2b187c68d1d2abc3028dc50/analysis/1406604065/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UniqeBodies_DarkerElf_Example-5968-1.7z?fid=19022&ttl=1535763107&ri=8192&rs=8192&setec=675ceff436b0bee64a6b57a8a0479648"
    },
    {
      "fileId": "19023",
      "name": "UniqeBodies_GreenOrc_Example",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2070",
      "fileName": "UniqeBodies_GreenOrc_Example-5968.7z",
      "uploadedUnix": "1326334072",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/97dd73808bbb40d8852e2a8a340c6846753630df793e3d12f505f7355f310e00/analysis/1406604067/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UniqeBodies_GreenOrc_Example-5968.7z?fid=19023&ttl=1535763107&ri=8192&rs=8192&setec=a1adacb628ab67ef98e9a274ec85019d"
    },
    {
      "fileId": "19061",
      "name": "UniqueBodies_0_81",
      "version": "0.81",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33978",
      "fileName": "UniqueBodies_0_81-5968.7z",
      "uploadedUnix": "1326344713",
      "modVersion": "0.81",
      "virusScanUrl": "https://www.virustotal.com/file/3c14a4a595373b78e6ba76ff3a06a8d1c9b22549a79da59b63c8aa78157f7b23/analysis/1406604571/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UniqueBodies_0_81-5968.7z?fid=19061&ttl=1535763108&ri=8192&rs=8192&setec=f1fee72765d3d845cc57345dd01f33ec"
    },
    {
      "fileId": "23408",
      "name": "UniqueBodies_0_86",
      "version": "0.86",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34910",
      "fileName": "UniqueBodies_0_86-5968.7z",
      "uploadedUnix": "1327669581",
      "modVersion": "0.86",
      "virusScanUrl": "https://www.virustotal.com/file/1cf3ef21b1cb139ff5d64a9847d5f9650503f26ca5d1f964a8b92e6f8debf8b5/analysis/1406640234/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UniqueBodies_0_86-5968.7z?fid=23408&ttl=1535763108&ri=8192&rs=8192&setec=d3c78d1baf6d0295631c8d02748a71cb"
    },
    {
      "fileId": "23697",
      "name": "Readme_Russian",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "3",
      "fileName": "Readme_Russian-5968.7z",
      "uploadedUnix": "1327760391",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/073b405e93e28aa6ea092b401d571c54b5b8e2d2ea70c559f8892c2318d755ca/analysis/1406642010/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme_Russian-5968.7z?fid=23697&ttl=1535763108&ri=8192&rs=8192&setec=2a1271503a2a3e519555443738e2105f"
    }
  ]
}