{
  "modId": 59695.0,
  "modName": "Arachnel&#39;s Secret",
  "summary": "Adds a new dungeon and related quest to the game. Work In Progress.",
  "descriptionHtml": "The basic premise for the mod is this: the player is asked to clear out an old crypt by a man who left his journal inside on a recent exploration. The crypt turns out to be an old tomb rumored to contain several very powerful artifacts. A group of people from a guild is also after the artifacts, and the player has to decide who to side with. More details can be provided privately on request-I don&#39;t want to spoil it for anyone interested in playing the completed mod. \r<br />\r<br />More information will be added as progress continues.\r<br />\r<br />New in the beta 1.1 version:\r<br />Alastair Diebin and his house are actually in the game now&#33; Cobbleton Hall is outside of Riften and is fully navmeshed. \r<br />Layout of Arachnel&#39;s Crypt has been [i]drastically [/i]overhauled and now includes basic navmesh. It isn&#39;t pretty-enemies may notice you but not run towards you.\r<br />Screenshots&#33; All four of &#39;em, for everyone who wanted to see what they were getting themselves into.\r<br />The framework for the first quest has technically been in the mod since the first release, but it&#39;s now accessible due to Alastair existing and all that. It&#39;s nowhere near completed.\r<br />The entrance to Arachnel&#39;s Crypt was moved slightly to make it closer to sea level and easier to access. Staircase to Heaven outside of it was removed in favor of a fairly level dirt path.\r<br />Cleaned the mod with TES5Edit. Only a handful of vanilla records have been altered-these are all intentional. Cleaning my .ESP any further will probably cause issues, and those are all your fault.\r<br />\r<br />Not yet implemented but worth mentioning:\r<br />Voice actors for the three main NPCs have been cast&#33; Thanks PrinceOfOriel, Tatteredspyder, and Rufliane&#33;\r<br />\r<br />Known issues:\r<br />AI in Arachnel&#39;s Crypt is wonky due to horrible navmesh. I know. Please bear with me-I accidentally deleted the existing navmesh twice which has ruined my interest in navmeshing that particular cell for the moment.\r<br />Please let me know if you experience any bugs with lighting.\r<br />Three doors are locked in Arachnel&#39;s Crypt-one is a puzzle door with no activators, another is a wooden door, and the third is that ambiguous metallic stonelike door in the second room. The first two cannot yet be unlocked without console commands, but the third can-there&#39;s a key somewhere that appears after you accept Alastair&#39;s quest. At least, it should. t-t",
  "categoryId": "35",
  "version": "b1.1",
  "author": "Toast",
  "createdUnix": "1415227890",
  "updatedUnix": "1416945923",
  "containsAdultContent": false,
  "uploadedBy": "thiefoftoast",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136743",
      "name": "Beta 1.1",
      "version": "b1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "129",
      "fileName": "Beta 1.1-59695-b1-1.rar",
      "uploadedUnix": "1416945923",
      "modVersion": "b1.1",
      "virusScanUrl": "https://www.virustotal.com/file/61b1e32ef3212786a363548fcbeda02885b1518d03dca08125dd24d3b4c06a55/analysis/1416946023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beta%201.1-59695-b1-1.rar?fid=1000136743&ttl=1535847039&ri=8192&rs=8192&setec=acdcf438d92e596b083c8964eacb8d8b"
    }
  ]
}