{
  "modId": 59706.0,
  "modName": "Beast Feet Ability",
  "summary": "Khajiit do 25+ more unarmed damage (stacking with their default 10+), move 15% faster, and have 15% more stamina if they aren&#39;t wearing boots. Argonians do 15+ unarmed damage, move 10% faster, and have 15+ stamina if they aren&#39;t wearing any boots. ",
  "descriptionHtml": "Update: Sorry the initial released ESP was a little bugged, and the unarmed damage wasn&#39;t going up, but I fixed that. \r<br />\r<br />Are you TIRED of khajiit being stereotyped as HARMLESS thieves, who couldn&#39;t possibly hurt a flea? Are you tired of how even though you&#39;re SUPPOSED to have CLAWS, and how argonians and khajiit in LORE are SUPPOSED to have significantly better unarmed abilities- that your character doesn&#39;t seem to have any? Are you tired of having feet that seem... Lets just say, not very exceptional on a humanoid? Are you fed up with beast races not having any abilities that truly give them a unique edge of sorts?\r<br />\r<br />Do you miss the days of Morrowind, when there were actual benefits given to you, in turn for not having the bonuses of wearing boots as a khajiit or argonian?  You think in theory, these beings with the intellect of humanoids and the physical giftedness of beasts would be somehow... Much more \r<br />formidable than vanilla Skyrim makes them come across as.\r<br />\r<br />Are you tired of your khajiit having to wear boots that would logically speaking, impair the function your claws would perform- because otherwise you&#39;re underpowered? Are you sick of how, even though a real life lore friendly version of a khajiit (at least one of the more catlike sub types of a khajiit) could probably disembowel someone with a kick, yet in game, their unarmed attacks seem more like a harmless cuddle? Do you want to feel more, like a respectable predator, than a harmless cuddly creature? Well THAT&#39;S THE WHOLE POINT of this mod.\r<br />\r<br />Khajiit do 25+ more unarmed damage (stacking with their default 10+), move 15% faster, and have 15% more stamina if they aren&#39;t wearing boots (Be they listed clothing or armor). Argonians do 15+ unarmed damage, move 10% faster, and have 15+ stamina if they aren&#39;t wearing any boots. Both the non-vampire races, and vampire race versions of these two races, will get this ability.\r<br />\r<br />I choose exactly 25+ because I felt this was in the goldilocks zone of balance- powerful enough to be useful especially combined with the other abilities, but weak enough to not be overpowered, and weak enough to still be balanced combined with mods that buff unarmed combat. And I think this is one of my mod balanced mods ever, seeing as how boots have the fortify weapon damage enchantment on them- so it is indeed a tradeoff and not a straight upgrade.\r<br />\r<br />Khajiit got slightly better bonuses cause their racials tend to be weaker, and cause they have more powerful claws than argonians do.\r<br />\r<br />I highly highly HIGHLY recommend you combine this mod with True Digitigrade Beast Races combined with either Grimoas Plantigrade Feet For Beast Races , OR combined with Artifexo&#39;s Argonian Raptor Feet, or Derok&#39;s Reptilian Argonian so that your argonian or khajiit actually has clawed weaponized feet, and being digitigrade makes the movement speed buff make more sense, not to mention makes both races look more unique.\r<br />\r<br />I also equally much recommend you combine this mod with Martial Arts \r<br />\r<br />So that you can actually USE KICK ATTACKS, making this mod make even more sense, and then finally, I recommend you combine my Unarmed Tearing Visuals and Sound mod http://www.nexusmods.com/skyrim/mods/57622/? with this mod. Please note, the only mod I created here that I suggested you combine with this one is the Unarmed Tearing Sounds mod, I did not create the other suggested mods at ALL, and my mods do not use ANY RESOURCES from the other mods I suggest you combine together with this mod- they simply synergize EXTREMELY well together. Combine all of the suggested mods together, and I pretty much promise you they will combine together extremely well.\r<br />\r<br />If you&#39;re using a custom beast race, the spell ID for the khajiit version is XX000D69 the argonian version is XX000D65- replace XX with the first two digits of your mod load order, and use addspell typing in the proper ID, if you don&#39;t use a custom beast race you won&#39;t need to do that though.",
  "categoryId": "34",
  "version": "",
  "author": "Lectra",
  "createdUnix": "1415257303",
  "updatedUnix": "1415263751",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000134109",
      "name": "BeastFeetAbilities",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "BeastFeetAbilities-59706-.zip",
      "uploadedUnix": "1415263751",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f457e14c755a36ebd0566f116d82a7cf0c3188168873e9131d1d6c5ff3486224/analysis/1415263863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BeastFeetAbilities-59706-.zip?fid=1000134109&ttl=1535847054&ri=8192&rs=8192&setec=bc85b55e78f8e98d9e37aebfffa73fbe"
    }
  ]
}