{
  "modId": 59736.0,
  "modName": "Melee Weapons-Material Atributes",
  "summary": "I was tired that the type of the material and the design of weapons don´t have any consequence apart from a linear increased damage in the gameplay. So I created atributes for each material used to forge them, to have some variability in my gameplay.\r<br />Also the principal materials daedric ebony and dragonbone are more damaging, also glass.",
  "descriptionHtml": "sorry for any error, Im Yucatecan mayan , my native language is not english. Also this is the original file, not like the workshop copypaste one.\r<br />\r<br />I just did this mods for my personal use, and is time to share it, they are recently cleaned from dirty edits.\r<br />This is a mod strictly to enhance gameplay, not estetics; No more just picking dragonbone over anything...\r<br />I was tired that the type of the material and their design don´t have any consequence apart from a linear increased damage in the gameplay.Now the weapons have different atributes depending on the materials used to forge them:\r<br />\r<br />[color=#bf9000][b]Dragonbone:[/b] [/color]the damage is moderately higher now,you will fear enemies with dragonbone weapons it is still the best damage, also because is bone the weight was slightly reduced, and the speed of the weapons also was very slightly augmented.good critical damage.\r<br />\r<br />[color=#cc4125][b]Daedric:[/b][/color]the damage is moderately higher now because the lore in the other games classified them as the most deadly, the daedric souls imbued in the weapon also makes the daedric more prone to do crits +15% chance  to land a crit,the speed remained the same because they are still heavy but the daedra soul inside makes them more easy to wield (and kill) only mace and warhammers are slightly slower. very good critical damage.(you know that spiky/bladed designs)\r<br />\r<br />[color=#000000][b]Ebony:[/b] [/color]also their damage is moderately higher now but still little less than daedric, the ebony weapons are mostly the heavier(just look at the weapons even the handle is from ebony), these are so heavy that any strike with them will be feeled, the mace and warhammer do a lot of stagger the most of all weapons, any ebony weapon is heavier and do more stagger than their other material counterparts.their crits are good but don´t vary much from weapon to weapon.They are the slowest weapons of all.\r<br />\r<br />[color=#6aa84f][b]Glass:[/b][/color] their damage was lifted too but slightly, still is behind of the first 3 materials, these are the most quickest weapons and the most light in the game now, as it should be, you can see the lore about glass weapons in the other games they were feared by all, the best option for thieves and assasins.Extremely good criticals because that sharpening is lethal in the dagger, sword and great sword,very good crit damage in the others.Very fast.very Poor stagger capabilities only warhammer can do some stagger.\r<br />\r<br />[color=#999999][b]Nordic Steel: [/b][/color]normal speed as vainilla, they are little heavier than the normal steel weapons,but still are not slow,the durability and clever design of this weapons increase the defensive capabilities of the user:+10% bonus on the blocking skill in all nordic steel weapons. I lifted their crits slightly.It´s the unique weapon with a script and is very light, it will not bloat your game.\r<br />\r<br />[color=#f1c232][b]elven:[/b][/color] these are the second fastest,also lighter.The elves prefer finesse than raw power, so even the two handed are fast and produce less fatigue.poor stagger only the warhammer do good. they do normal to good crits.\r<br />\r<br />[color=#b45f06][b]Dwarven:[/b][/color] the second heavier, the dwemer material is very heavy and durable, so their stager is high sometimes even more than the daedric, the mace and warhammer still do not have the same stagger as ebony, even their swords have more stagger than most. they are not so slow as the ebony, normal speed as vainilla, only the heavier ones are slower.normal crits.The warhammer now do slightly more damage, because the dwemer loved them to crush rock and metal\r<br />\r<br />[color=#38761d][b]Orsimer:[/b][/color] they are normal speed just the battle axe is somewhat faster and lethal than normal, the orichalchum produces very sharp edges and is heavy, the weapons reflect the necessity of a brutal warrior to use that confusing edges.this is the weapon with the best critical damage even more than daedric, in most of the weapons the critical do more damage than the base weapon damage.Heavy but not as dwarven and faster than ebony and dwemer and daedric.\r<br />\r<br />[color=#b6b6b6][b]Steel:[/b][/color] includes Imperial sword , very few damage adjustments,they are faster than iron,nordic,dwemer, orsimer,daedric, ebony ,dragonbone. they do slightly better critical damage now. lighter. They do normal to decent crits.\r<br />\r<br />[color=#666666][u][b] Iron:[/b][/u][/color] pretty much the same as vainilla. the joke about their crits was now normalized I doubled the crit damage, it was ridiculous.Still the crit damage is the lowest.\r<br />\r<br />[color=#00ffff][b]Stahlrim:[/b][/color] heavy but not always slower, these permafrost in maces/hammers do a lot of stagger but slower them moderately, and in swords do a lot of critical damage because it acts like a glass edge.normal speed.\r<br />\r<br />[color=#cccccc]akaviri:[/color]fast,lightweight slightly higher damage, slightly higher crits.very poor stagger.\r<br />\r<br />[color=#8e7cc3]draugr:[/color] only minor weight adjustments.\r<br />\r<br />[color=#7f6000]forsworn:[/color]lighter and faster, but reduced very little their damage ,normal crits.\r<br />\r<br />[color=#cccccc]silver:[/color] Better crits now.slightly faster.\r<br />\r<br />minor adjustments in weight, and crits in the other weapons\r<br />\r<br />[color=#ff0000][b] Volendrung[/b][/color] is the heaviest slowest and the most damaging of all warhammers\r<br />\r<br />Almost all the crit.damage is double now, sometimes in the case of orsimer (best crits), stahlrim swords and three of the principal materials was even more.\r<br />\r<br />I did this for the lore that you can find in the past games.And to add a touch of variability.\r<br />\r<br />Load last because some other mods are not cleaned and they may override my changes.\r<br />\r<br />if you encounter any bug just tell me",
  "categoryId": "24",
  "version": "1.00a",
  "author": "MayanKing",
  "createdUnix": "1415340019",
  "updatedUnix": "1415339751",
  "containsAdultContent": false,
  "uploadedBy": "mayanking",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000134228",
      "name": "MeleeWeaponsMaterials Atributes",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "MeleeWeaponsMaterials Atributes-59736-1-00.zip",
      "uploadedUnix": "1415334915",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/38d847a2f988ba5b662358ca86dc16f2a7f090e580d40709e47699247e7af873/analysis/1415335022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MeleeWeaponsMaterials%20Atributes-59736-1-00.zip?fid=1000134228&ttl=1535847118&ri=8192&rs=8192&setec=d23f83c746b2571b16de21154632b588"
    },
    {
      "fileId": "1000134230",
      "name": " melee weapon material atributes for dawnguard",
      "version": "1.00a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": " melee weapon material atributes for dawnguard-59736-1-00a.zip",
      "uploadedUnix": "1415335299",
      "modVersion": "1.00a",
      "virusScanUrl": "https://www.virustotal.com/file/6e806966499e98cadfcf32f03f86070b424559967c0e1f8b9e2c9ed1dcf47bf1/analysis/1415335382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20melee%20weapon%20material%20atributes%20for%20dawnguard-59736-1-00a.zip?fid=1000134230&ttl=1535847119&ri=8192&rs=8192&setec=6da938585e0b37b7a67b65ac77aa044a"
    },
    {
      "fileId": "1000134243",
      "name": "MeleeWeaponsMaterials Atributes For dragonborn",
      "version": "1.00b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "MeleeWeaponsMaterials Atributes For dragonborn-59736-1-00b.zip",
      "uploadedUnix": "1415339751",
      "modVersion": "1.00b",
      "virusScanUrl": "https://www.virustotal.com/file/bd2a6dd08ce70579a77778796e949882f2aab0aed0a22bb28b0f3c7f22fb4c2b/analysis/1415339822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MeleeWeaponsMaterials%20Atributes%20For%20dragonborn-59736-1-00b.zip?fid=1000134243&ttl=1535847120&ri=8192&rs=8192&setec=5f1b90139544f9fefe591855379de941"
    }
  ]
}