{
  "modId": 59741.0,
  "modName": "Melee Weapons New materials atributes",
  "summary": "",
  "descriptionHtml": "sorry for any error, Im mayan , my native language is not english.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;I just did this mods for my personal use, and is time to share it, they are recently cleaned from dirty edits.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;I was tired that the type of the material and their design don´t have any consequence apart from a linear damage gameplay.Now the weapons have different atributes depending on the materials used to forge them\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;dragonbone: the damage is moderately higher now,you will fear enemies with dragonbone weapons it is still the best damage, also because is bone the weight was slightly reduced, and the speed of the weapons also was very slightly augmented.normal critical damage.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;daedric: the damage is moderately higher now because the lore in the other games classified them as the most deadly, the daedric souls imbued in the weapon also makes the daedric more prone to do crits 15% more in fact,the speed remained the same because they are still heavy only mace and warhammers are slightly slower.good critical damage.(you know that spiky/bladed designs)\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Ebony: also their damage is moderately higher now but still little less than daedric, the ebony weapons are the heavier(just look at the weapons even the handle is from ebony), the are so heavy that any strike with them will be feeled, the mace and warhammer do a lot of stagger the most of all weapons, any ebony weapon is heavier and do more stagger than their other counterparts.their crits are good but don´t vary much from weapon to weapon.They are the slower weapons of all.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Glass: their damage was lifted too but slightly, still is behind of the first 3 materials, these are the most quickest weapons and the most light in the game now, as should be, you can see the lore about glass weapons in the other games they were feared by all, the best option for thieves and assasins.Extremely good criticals because that sharpening is lethal in the dagger, sword and great sword,very good crit damage in the others.Very fast.very Poor stagger capabilities only warhammer can do some stagger.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Nordic Steel:normal speed as vainilla, they are little heavier than the normal steel weapons,but still are not slow,the durability and clever design of this weapons increase the defensive capabilities of the user:+10% bonus on the blocking skill in all weapons.lifted their crits slightly.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;elven: these are the second fastest,also lighter.The elves prefer finesse than raw power, so even the two handed are fast and produce less fatigue.poor stagger only the warhammer do good.normal to good crits.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Dwarven: the second heavier, the dwemer material is very heavy and durable, so their stager is high sometimes even more than the daedric, the mace and warhammer nearly still do not have the same stagger as ebony, even their swords have more stagger than most. they are not so slow as the ebony, normal speed as vainilla, only the heavier ones are slower.normal crits.The warhammer now do slightly more damage, because the dwemer loved them to crush rock and metal\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;.Orsimer: they are normal speed just the battle axe is somewhat faster and lethal than normal, the orichalchum produces very sharp edges and is heavy, the weapons reflect the necessity of a brutal warrior to use that confusing edges.this is the weapon with the best critical damage even more than daedric, in most of the weapons the critical do more damage than the base weapon damage.Heavy but not as dwarven and faster than ebony and dwemer.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;steel: very few damage adjustments,they are faster than iron,nordic,dwemer, orsimer,daedric, ebony.slightly better critical damage.lighter.normal to Good crits.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;iron: pretty much the same as vainilla. the joke about their crits was now normalized I doubled the crit damage, it was ridiculous.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;stahlrim: heavy but not always slower, these permafrost in maces do a lot of stagger but slower them moderately, and in swords do a lot of critical damage because it acts like a glass edge.normal speed.akaviri:fast,lightweight slightly higher damage, slightly higher crits.very poor stagger.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;draugr: only minor weight adjustments.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;forsworn:lighter and faster,poor crits.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;silver: Better crits now.slightly faster.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;minor adjustments in weight, and crits in the others.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Almost all the crit.damage is double now, sometimes in the case of orsimer, stahlrim swords and three of the principal materials was even more.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;I did this for the lore that you can find in the past games.And to add a touch of variability.\r<br />&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;",
  "categoryId": "24",
  "version": "1.00",
  "author": "MayanKing",
  "createdUnix": "1415334154",
  "updatedUnix": "1415334154",
  "containsAdultContent": false,
  "uploadedBy": "mayanking",
  "primaryFile": null,
  "files": []
}