{
  "modId": 59748.0,
  "modName": "Teammate Lockpicking Assistance",
  "summary": "Provides support for Teammates and Followers to successfully unlock doors, chests, strongboxes, etc at the request and control of the Player. Player also controls recruited members lockpicking skill level, simulated lockpick breakage, and inventory lockpick refresh.",
  "descriptionHtml": "[color=#9fc5e8][size=4]QUICKSTART:[/size][/color]\r<br />\r<br />Teammate Lockpicking Assistance (TLA) \r<br /> \r<br />Allows a the player to &#34;recruit&#34; a teammate/follower (or multiple teammates) to act on their behalf as an expert locksmith. \r<br /> \r<br />How to begin: give a follower a TeammateLockpick by opening up the inventory dialogue menu with them. As long as the TeammateLockpick is in their inventory they will be considered &#34;recruited&#34; by this mod and can open locked doors and chests by request. \r<br /> \r<br />Making the request is exactly the same as asking a follower to chop wood except instead of pointing at a wood pile the player points at a locked item (door, chest, display, strongbox, etc) and presses the activate key to make the request. \r<br /> \r<br />There are two ways of getting into this control mode, opening a dialogue menu and selecting &#34;I need you to do something.&#34; which will then put you into a crosshair command mode or getting into that mode directly by simply aiming your crosshair at your follower and holding down the activate key (X, A, or E by default depending on your controller method). However, getting directly into the crosshair control method is the only practical way to use this mod. If this method is new or challenging, more info is included in the tips section.\r<br />\r<br />[color=#9fc5e8][size=4]NEWS:[/size]\r<br />[/color]\r<br />Version 1.2 references lockpick breakage feature to skill rather than number of tokens. This was done specifically for Inigo, but also as a feature for similarly configured companions. The goal is to integrate better with companion mods where the lockpicking skill is already being managed. Check Version Info section for notes specific to Inigo.\r<br />\r<br />Version 1.1 adds support for Arissa as an MCM option, and a few other minor changes/improvements listed in the Version Info section below. Note that Arissa will not agree to open locks for the Player until her regard is high enough (Ally).\r<br />\r<br />[color=#9fc5e8][size=4]OVERVIEW:\r<br />[/size][/color]\r<br />What limits NPCs from successfully opening locks are:\r<br />\r<br />   1. [u]If they have lockpicks in their inventory[/u],\r<br />   2. [u]If they have the required skill level, and[/u]\r<br />   3. [u]If they can path to the door or chest to access it[/u].\r<br />\r<br />TLA is designed to addresses the first and the second but not the last. \r<br /> \r<br />What limits the player is how much expertise they develop in the use of the crosshair control method. There is a short video in the tips section below demonstrating the use of some of the tips.\r<br /> \r<br />An NPC is &#34;recruited&#34; by giving them a TeammateLockpick through the inventory dialogue menu. The player starts with three TeammateLockpick (tokens) in their inventory and that is all that will ever exist in the world (default behaviour). The player is free to sell, drop, destroy, lose, or give them out. They have zero value and in no way are special or protected items. There are no restrictions on whom they can be given to but if it is not a teammate or follower, nothing special will happen. \r<br /> \r<br />Each TeammateLockpick held in an NPCs inventory levels (not increases) their lockpicking skill by 25 points. In this way the player controls how much skill is granted to the designated locksmithing expert/s by giving out or taking back these TeammateLockpicks. A teammate will be dismissed from service when the TeammateLockpicks are removed from their inventory. \r<br /> \r<br />An example of how this works: Faendal has 20 lockpick skill, so giving him one TeammateLockpick will level his skill by 5, to 25. Giving him a second will bring his lockpick skill to 50.  Giving the last one to Sofia would bring her to 25 (she starts at 15). Now Faendal can open locks to 50 while Sofia can open locks to 25, both of them acting as &#34;recruited&#34; locksmiths. Removing one from Faendal will bring him back down to 25 and the player could just hold onto that TeammateLockpick until they find a use for it (or store it at home or on their horse or...).\r<br />\r<br />[color=#9fc5e8][size=4]FEATURES (MCM Options):\r<br />[/size][/color]\r<br />[b]GAMEPLAY:[/b][list][*][size=2]LockpickRespawn ([color=#f1c232]default enabled[/color]): &#34;Recruited&#34; Teammates will not fall below having one lockpick in their inventory, they can never completely run out. This is designed as a convenience in case for example the player is deep into Blackreach and realizes they forgot to restock lockpicks before starting out on the quest. The intent is that the player in good faith will supply lockpicks but it is in no way forced upon the player unless this feature is deactivated.[/size][/*]\r<br />[/list][list][*][size=2]RandomBreakage ([color=#f1c232]default enabled[/color]): Simulated lockpick breakage for &#34;recruited&#34; Teammates. If the NPC has lockpicks in their inventory, Vanilla removes one lockpick per successful lock opened (100% breakage). With this feature activated the chance of a lockpick breaking is related to the skill of the NPC as (110% - lockpicking skill).[/size][/*]\r<br />[/list][b]SPECIAL:[/b][list][*][size=2]TokenRespawn ([color=#f1c232]default disabled[/color]): Respawning TeammateLockpick tokens. If enabled works the same as follower lockpick feature above, a player will never have less than one TeammateLockpick in their inventory. In theory the player could use this to bring every follower/teammate that can be &#34;recruited&#34; to 100 lockpick skill. The default is for three TeammateLockpick tokens to spawn when the mod starts so the max any one teammate can be brought to is 75 lockpicking skill. This is primarily intended more as a help/debug tool in case say a teammate falls into a volcano and drowns or just never comes home one day or their inventory glitches or...[/size][/*]\r<br />[/list][b]COMPATIBILITY:[/b][list][*][size=2]Arissa Support ([color=#f1c232]default disabled[/color]): Support for Arissa 1.3, may work with other versions but I have not tested this. This option needs to be checked before giving Arissa any TeammateLockpicks. However, if she is already considered as &#34;recruited&#34; by the mod, then after checking this option give her one TeammateLockpick, close the menu, and take it back. Seeing the message that she has retired from service should be sufficient to restore everything. However, if you are comfortable with the console, issue ¨getavinfo lockpicking&#34; on her RefID to check that her base and current lockpicking are 15 and her mod value is 0 to be 100% sure.[/size][/*]\r<br />[/list]\r<br />[color=#9fc5e8][size=4]REQUIREMENTS:[/size][/color]\r<br /> \r<br />Skyrim and SKSE. I wrote this with SKSE 1.7.01 because that is what my savegames require and so it was just there. However, in theory 1.6.7 is the minimum - although I have not tested this. I have briefly looked into making a non-SKSE version. However, it looks like that would also lose functionality/features and be a lot of work (translation, basically starting from scratch again).\r<br />\r<br />[color=#9fc5e8][size=4]TROUBLESHOOTING:[/size][/color]\r<br />\r<br />For people not using MCM, opening the console and typing &#34;help TLA_&#34; will list the globals used to enable/disable the features listed above. It should be obvious what they do, for example type &#34;set TLA_RandomBreakage to 0&#34; to disable simulated lockpick breaking. \r<br /> \r<br />This will also list the quest that should be shutdown &#34;stopquest TLA_LockpickingFavor&#34; before uninstalling.\r<br />\r<br />[color=#9fc5e8][size=4]TIPS:\r<br />[/size][/color]\r<br />Learn to quickly get into crosshair command mode, most people I see having trouble move closer in an attempt to get into it. That is a bad thing because the game is already having trouble deciding if they want to enter dialogue menu or command mode. By moving closer they usually get forced into dialogue mode no matter how they mash and hold the activate key. So if you experience trouble initiating crosshair command mode, move further away. The mode will allow you to control followers from amazing distances. \r<br /> \r<br />Related to the distance comment above, learn to stay in command mode because you can usually stand in the center of a room and just flick your crosshair from locked object to locked object to quickly clear the room of all the locks. I also take the opportunity to have them pick up books and food that might be lying about as well. You can walk around to get line of sight to objects without breaking command mode, a good rule of thumb is to always avoid any keys that would end dialogue menu as they likely will also end command mode. \r<br /> \r<br />One weakness of asking an NPC to open locks is that they do not provide any feedback on success, or as to when the task is completed. They will usually provide feedback on failure though either by simply not moving at all or saying something like &#34;Sorry, can&#39;t do that&#34;. The way I deal with this is to wait for the NPC to stand motionless in front of the object for a second or so then flick my crosshair off and back onto the object. If the NPC is done, the displayed message will change from Locked to Open (if it is a door) or Take All (if it is a chest). DO NOT press the activate button again if Take All is displayed or whatever the NPC takes will be marked as stolen. \r<br /> \r<br />It is possible to queue up several requests but this is not totally reliable and breaking command mode will cancel all requests that are not already completed.\r<br />\r<br />Short video demonstrating recruiting Jenassa by giving her one TeammateLockpick then upgrading her skill by giving her another so that she can successfully open an Adept level locked door.\r<br />\r<br />[youtube]YyrsDP9A5e4[/youtube]\r<br />[color=#9fc5e8][size=4]\r<br />QUESTIONS & ANSWERS:[/size][/color]\r<br />\r<br />Q: What game changes are made to the vanilla system? \r<br />A: Zero, NPCs will not open item the game restricts them from opening or their morality restricts them from opening. If they commit a crime on the players behalf and get caught, the player gets charged. \r<br /> \r<br />Q: What about mod conflicts, are there any? \r<br />A: In theory none, no vanilla assets were modified, overridden, or touched. \r<br /> \r<br />Q: How does vanilla NPC lockpicking work? \r<br />A: Except as noted in the first question (quest related and crimes), any follower can open any chest, strongbox, or similar type object without needing lockpicks and regardless of the level it is locked at.  For NPCs to open doors they need to meet two requirements, have a lockpick in their inventory and have lockpick skill above the level the door is locked at. If the NPC has lockpicks in their inventory, one is removed for every lock they successfully opened. This includes chests, which COULD have technically been opened without a lockpick (but would have required accessing the NPCs inventory and removing all lockpicks before having them open the chest). \r<br /> \r<br />Q: Is this lore friendly? \r<br />A: Yea I don&#39;t know, it is how the vanilla game works except that the vanilla game does not generally level lockpicking for NPCs so I&#39;m giving that opportunity to the player to decide if lockpick should level - and if they decide yes by how much.\r<br />\r<br />[color=#9fc5e8][size=4]INSTALL:[/size][/color]\r<br />\r<br />Just an ESP and a BSA so unpack into the Data folder and activate or use mod manager of choice to do it.\r<br />\r<br />[color=#9fc5e8][size=4]UNINSTALL:[/size][/color]\r<br />\r<br />[list=1][*]Ideally open console and type &#34;stopquest TLA_LockpickingFavor&#34;,\r<br />[/*]\r<br />[*]Close console and wait a few seconds then save game,\r<br />[/*]\r<br />[*]Uninstall/delete FollowerLockpicking.esp and FollowerLockpicing.bsa as per your mod manager/method, and\r<br />[/*]\r<br />[*]Open previously saved game and re-save.\r<br />[/*]\r<br />[/list]\r<br />[color=#9fc5e8][size=4]UPGRADING:[/size][/color]\r<br />\r<br />I do my best to ensure that the mod can be updated in place. So simply replacing the old version files with the new should be all that is required.\r<br />\r<br />[color=#9fc5e8][size=4]MODDERS WILL:[/size][/color]\r<br /> \r<br />If I fail to respond on the Nexus for six months consecutive then this and anything else I have uploaded to the Nexus is unrestricted. \r<br /> \r<br />Other than that anything I have uploaded to the Nexus is unrestricted except I would request to be contacted and informed prior to use. I would appreciate if I were credited as well.\r<br />\r<br />[color=#9fc5e8][size=4]VERSION INFO:[/size][/color]\r<br />\r<br />v1.0\r<br />[list][*]Initial Release.\r<br />[/*][/list]\r<br />v1.1 \r<br />[list][*]Removed SKI_playerloadgamealias.pex that mistakenly got packed with v1.0.\r<br />[/*][*]Added basic support for Arissa as an MCM option. She is forced to use Lockpick Refresh mode and the messages saying she can not equip this item still appear when giving her TeammateLockpicks but can be ignored for the purpose of this mod.\r<br />[/*][*]Cleaned up some messages that sometimes appeared in log files related to trying to assign a reference to none.\r<br />[/*][*]Reorganized the MCM menus and updated version to 2.\r<br />[/*][*]Added localization file for the MCM.\r<br />[/*][*]Added support for remapping Activation key, not 100% effective until game is saved & reloaded.[/*]\r<br />[/list]\r<br />v1.2[list][*]Changed recruitment messages to not reference skill changes unless changes were actually made.\r<br />[/*][*]As part of above changed random lockpick breakage feature to work off NPC lockpicking skill not number of tokens.\r<br />[/*][*]Both of above were specifically changed as a result of testing with Inigo, the info specific to Inigo is included below.\r<br />[/*][*]Slightly changed the way lockpick skill is evaluated to handle potential case where the NPCs skill might be temporarily damaged or enhanced by needs and/or diseases mods that effect followers as well as the player.[/*]\r<br />[/list]\r<br />Notes on Inigo: I suggest waiting till the player character is level 6 or above then give Inigo one TeammateLockpick. Doing so should ensure that his lockpicking skill is managed by his own mod. Only the optional features, random lockpick breakage, and lockpick refresh will be managed by this mod (if checked in the MCM). If the recruitment message mentions his skill being upgraded, remove the token and wait for the PC to progress one move level and try giving it to him again. In my testing his skill was 26 by level 5 and 28 by level 6, ideally want it above 25 before giving him a token. Reference the image of Inigo above to see the message displayed when his skills are not being managed by TLA.\r<br />\r<br />By giving Inigo more than one token this mod can be forced into overriding his native lockpicking skills. Removing all tokens will restore his native lockpicking stats and restore control of those stats to his mod. If the message displayed when given a TeammateLockpick do not refer to the teammates skills as being upgraded then this mod has not overridden their native skill progression (any follower/companion in this case).\r<br />\r<br />As a result of these changes it is possible to use Vilja with just the optional features and not have this mod touch her lockpicking stats. However, I still do not recommend this as Vilja has so many ways to access her so many containers and intermediate storage that I can see problems developing. For example I addressed her while on horseback, asked to check her inventory, and from that dialogue opened her extra storage container which brought up a menu box and upon accessing and closing it I was kicked off my horse onto the ground... but back into original dialogue menu where I gave Vilja a TeammateLockpick, that sequence did not work as expected.",
  "categoryId": "24",
  "version": "1.2",
  "author": "M2RH",
  "createdUnix": "1415353621",
  "updatedUnix": "1416111966",
  "containsAdultContent": false,
  "uploadedBy": "M2RH",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000134263",
      "name": "TLA_FollowerLockpicking",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11",
      "fileName": "TLA_FollowerLockpicking-59748-1-0.7z",
      "uploadedUnix": "1415353604",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/84e19a9b754b3981ef24b3107b30bf7d98ac63c8dc8dbf90dd9fcfd311f9d746/analysis/1415353682/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TLA_FollowerLockpicking-59748-1-0.7z?fid=1000134263&ttl=1535847129&ri=8192&rs=8192&setec=f61e9d2e3e2471b566e98bbe84079863"
    },
    {
      "fileId": "1000134799",
      "name": "TLA_FollowerLockpicking",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "TLA_FollowerLockpicking-59748-1-1.7z",
      "uploadedUnix": "1415677276",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/99d1a71a8cace2477fbf5a7840ccfaa558fe412c61718a94a619761ee0bb4d94/analysis/1415677383/",
      "changelogHtml": " Removed SKI_playerloadgamealias.pex that mistakenly got packed with v1.0 mod. <br/> \n Added basic support for Arissa as an MCM option. <br/> \n Reorganized the MCM menus and updated version to 2 and added localization file for the MCM. <br/> \n Cleaned up some error messages that sometimes appeared in log files. <br/> \n Added support for remapping Activation key. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TLA_FollowerLockpicking-59748-1-1.7z?fid=1000134799&ttl=1535847129&ri=8192&rs=8192&setec=d0142f18837c0d3ff413ba2e22e2b284"
    },
    {
      "fileId": "1000135510",
      "name": "TLA_FollowerLockpicking",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "TLA_FollowerLockpicking-59748-1-2.7z",
      "uploadedUnix": "1416111966",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/15866231243ca339d7950ff00483f8ceb69927f5b3d4a240b8e784a7f5468429/analysis/1416112085/",
      "changelogHtml": " Changed recruitment messages to not reference skill changes unless changes were actually made. <br/> \n As part of above changed random lockpick breakage feature to work off NPC lockpicking skill not number of tokens. <br/> \n Slightly changed the way lockpick skill is evaluated to handle potential case where the NPCs skill might be temporarily damaged or enhanced by needs and/or diseases mods that effect followers. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TLA_FollowerLockpicking-59748-1-2.7z?fid=1000135510&ttl=1535847130&ri=8192&rs=8192&setec=1ad78f0bcaf3aee987555aedd15326bf"
    }
  ]
}