{
  "modId": 59772.0,
  "modName": "Interactive Wash Basins COMPLETE",
  "summary": "Now every single wash basin you find throughout Skyrim can be used, with an animation and sound effect, and a temporary &#39;clean&#39; buff applied to your character.",
  "descriptionHtml": "[center][img]http://www.darkfox127.co.uk/uploads/1/1/6/1/11613543/mod-header-wash-basins_orig.png[/img]\r<br />\r<br />\r<br />[img]http://www.darkfox127.co.uk/uploads/1/1/6/1/11613543/mod-sub-header-wash-basins-description_2_orig.png[/img]\r<br />\r<br />[font=verdana]Have you ever felt like those static wash basins you find scattered throughout player homes and inns in Skyrim should have more of a use? Well, now they do have a purpose&#33; Interactive Wash Basins replaces all wash basins in Skyrim with interactive versions which allow you to clean yourself up.\r<br />\r<br />Activating a wash basin will result in the player receiving a &#34;Clean&#34; buff​, as well as having a nice animation and sound play. The buff grants the player a 10% health increase, a 10% boost in regeneration speed and 100% disease resistance for 4 hours.\r<br />\r<br />[img]http://www.darkfox127.co.uk/uploads/1/1/6/1/11613543/mod-sub-header-wash-basins-installation_orig.png[/img]\r<br />\r<br />Installation is as simple as clicking the &#34;Download With Manager&#34; button and letting your mod manager of choice download the files. NMM users can simply activate the mod once it&#39;s added to your mod list. Mod Organizer users can double click to install and optionally choose the manual install options to make sure everything checks out.\r<br />\r<br />To install the mod manually, make sure you click &#34;Download Manually&#34; and then extract the contents of the folder. Dump all of the contents into your Skyrim data folder and make sure the mod is active in your launcher of choice.\r<br />\r<br />If you decide to install any patches from this page or optional files for the DLCs, be sure to install them after the main files and overwrite anything that your mod manager asks.\r<br />\r<br />[img]http://www.darkfox127.co.uk/uploads/1/1/6/1/11613543/mod-sub-header-wash-basins-compatibility_orig.png[/img]\r<br />\r<br />This mod&#39;s custom mesh will have compatibility issues with any other mod which changes the mesh as my mesh adds water to the wash basins. Any mod which changes player homes that contain wash basins or inns may have some minor issues, but nothing game breaking. For example, the wash basin may be moved by another mod or there could be clipping issues with other objects.\r<br />\r<br />Please do feel free to let me know in the comments about compatibility issues with other mods and I&#39;ll see if there&#39;s anything I can do to resolve it.\r<br />\r<br />[img]http://www.darkfox127.co.uk/uploads/1/1/6/1/11613543/mod-sub-header-wash-basins-other-information_orig.png[/img]\r<br />\r<br />\r<br />This mod has been fully tested and cleaned thoroughly with xEDIT to make sure there are no dirty edits, ITMs or any other problems with the mod. If for some reason you do notice any problems, please don&#39;t hesitate to get in touch.\r<br />\r<br />You do not need any of the DLCs for this mod as they are completely optional to install. If you do own the DLCs, then be sure to go ahead and download those files too and follow the installation instructions above.\r<br />\r<br />One known bug so far, is the wash basins should not be used in 1st person (it causes your arm to go weird and you become unable to move, but to fix it if you do happen to activate in first person all you have to do is jump, or switch back to 3rd person).[/font][/center]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Ever felt like those static wash basins you find scattered throughout homes and inns in Skyrim should be able to be used? Well, now they can be&#33; ALL wash basins added by Skyrim (not any added by DLCs yet though) have been made interactive. When you use them, an animation and sound effect will play, and you will get a temporary buff for becoming &#39;clean&#39;. Being clean grants you a 10% increase in health regeneration speed for 4 hours, and also grants 100% disease resistance for 4 hours.\r<br />\r<br />Installation: Just install normally via NMM or another mod manager, or, to install manually, extract the contents of the archive into your skyrim data folder (there should be an esp and a scripts folder).\r<br />\r<br />Compatibility: I don&#39;t think there should be any compatibility issues, but if you do find any let me know in the comments. If you have a mod that changes some inns or NPCs homes that contain wash basins, then there may be issues, but nothing game breaking, so you should be able to try it and see (e.g might be some clipping with other objects).\r<br />\r<br />This mod only requires Skyrim, no DLCs. If you would like the wash basins found in Hearthfire homes to be useable also, then try out my other mod: [url=http://www.nexusmods.com/skyrim/mods/57547/?]Interactive Wash Basins for Hearthfire[/url].\r<br />\r<br />This mod has also been cleaned with TES5Edit. However, if you do notice any bugs, please don&#39;t hesitate to say so in the comments. The only known bug so far, is the wash basins should not be used in 1st person (it causes your arm to go weird and you become unable to move, but to fix it if you do happen to activate in first person all you have to do is jump, or switch back to 3rd person).\r<br />\r<br />Hope you enjoy&#33; :)",
  "categoryId": "78",
  "version": "1.0",
  "author": "simsim899",
  "createdUnix": "1415465837",
  "updatedUnix": "1415465665",
  "containsAdultContent": false,
  "uploadedBy": "simsim899",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000134447",
      "name": "Interactive Wash Basins COMPLETE",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Interactive Wash Basins COMPLETE-59772-1-0.rar",
      "uploadedUnix": "1415465665",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4f86c238483cbf448f77f3f98949e4b2bae3cf6e8788e533838b51f314d7c882/analysis/1415465704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Interactive%20Wash%20Basins%20COMPLETE-59772-1-0.rar?fid=1000134447&ttl=1535847161&ri=8192&rs=8192&setec=44cc5a6d415087ab374ec462860694ec"
    }
  ]
}