{
  "modId": 59815.0,
  "modName": "Lost Longswords - Both Grips Patch",
  "summary": "A small patch for Lost Longswords to make both one-handed and two-handed versions available -both in crafting recipes and leveled lists.\r<br />You need the one-handed esp mod and textures folder in order to have both. This is JUST a standalone two-handed esp and meshes folder. ",
  "descriptionHtml": "This is just a small fix for everyone who, like me, has played, used, and endorsed the great mod from  MrBrownstone (apparently absent for some time), Lost Longswords, that always felt like both grips (one handed, two handed) should&#39;ve been implemented at some point in the mod. As it hasn&#39;t been updated in a year, I took the freedom to post my personal patch (both in crafting recipes and leveled lists).\r<br />\r<br />It just adds another esp (Lost Longswords 2h) that edits the [b]1stperson paths [/b](NOTHING is taken or modified aside from that) for the weapons, duplicating them from the meshes in the 2h original version so they don&#39;t overrite each other.\r<br />\r<br />[b]YOU STILL NEED THE ORIGINAL FILES FROM THE ONE HANDED VERSION IF YOU WANT ONE HANDED WEAPONS TOO.[/b] This adds the two-handed versions (though it isn&#39;t dependant on the original one-handed esp) of the weapons. But it&#39;s only meshes. YOU STILL NEED THE TEXTURES FOLDER FROM THE ONE HANDED VERSION (didn&#39;t include my textures between other reasons because I run a toaster PC and had to &#34;optimize&#34; -that&#39;s reduce- the original textures).\r<br />\r<br />So, no need for more Unlocked Grip to enjoy both grips of the thing.\r<br />\r<br />[b]LINK [/b]TO THE MANDATORY ORIGINAL GREAT LOST LONGSWORDS (ONE HANDED) MOD FROM MRBROWNSTONE: \r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/26261/?]LostLongswords bt MrBrownstone[/url]\r<br />\r<br />(http://www.nexusmods.com/skyrim/mods/26261/?)\r<br />\r<br />[b][u]PLANS AND NOTES:\r<br />[/u][/b]\r<br />If I get to it I might even add recipes to switch between the grips in the crafting menu. \r<br />\r<br />Note that these new weapons also don&#39;t have an identifier name, both their names are the same (for now you&#39;ll have to guess based on the damage they make and identifying that damage with the perks in each separate skill. In the CONSOLE, the latest is the two handed item -that&#39;s if you put it after the original one-handed version). Sorry for that, if I get some free time and if you ask I&#39;ll change them and add a &#34;claymore&#34; or &#34;two-handed x longsword&#34; tag to them.\r<br />\r<br />A thing I&#39;ve specially always wanted to do was a Morrowloot add-on (scatter some here and there, also make some unique ones) for these, so probably it will be available some time. You can track this if you want, though I&#39;ve disabled endorsements so I don&#39;t get credit instead of the original author.\r<br />\r<br />Thanks to everyone, but specially to MrBrownstone, and Beth. And of course the Nexus (the lore-friendly Nexus that is). Well, nah, just, all the nexus.\r<br />\r<br />[u]Recommended/related mods:[/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/52369/?]Specialized Weapons (including several rapiers for each material)[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50740/?]MORROWLOOT. GODS, GET IT ALREADY.[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50995/?]Unofficial Morrowloot Patch[/url]",
  "categoryId": "55",
  "version": "1.0",
  "author": " MrBrownstone",
  "createdUnix": "1415571506",
  "updatedUnix": "1415571023",
  "containsAdultContent": false,
  "uploadedBy": "Villacardo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000134638",
      "name": "Lost Longswords - Both Grips Available Add On",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1148",
      "fileName": "Lost Longswords - Both Grips Available Add On-59815-1-0.rar",
      "uploadedUnix": "1415571023",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/533d7562bd1784806379299526bb6dd5efebbe50aa000c6693755cce3e5cad2e/analysis/1415571123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lost%20Longswords%20-%20Both%20Grips%20Available%20Add%20On-59815-1-0.rar?fid=1000134638&ttl=1535847209&ri=8192&rs=8192&setec=646be5fd433233e718de5f37e4e6a388"
    }
  ]
}