{
  "modId": 59905.0,
  "modName": "Dragon Soul Disciple II",
  "summary": "Gain new draconic perks and abilities as you absorb dragon souls.",
  "descriptionHtml": "[color=#00ffff][u]What is this?[/u][/color]\r<br />Like my previous [url=http://www.nexusmods.com/skyrim/mods/30925/?]Dragon Soul Disciple[/url] mod, this mod aims to enhance the Dragonborn&#39;s innate draconic abilities as (s)he is exposed to more draconic energy (aka absorbs more dragon souls).\r<br />\r<br />Unlike my previous Dragon Soul Disciple mod, this mod is much more modular, giving you significant customization regarding the ways in which your draconic abilities develop. It accomplishes this using a perk-menu similar to my [url=http://www.nexusmods.com/skyrim/mods/51288/?]Blood Magery [/url]mod. The dragonborn will gain one Dragon Soul Disciple level (and one DSD perk) for every two dragon souls absorbed. Additionally, at DSD Level 1 and every 10 DSD levels afterwards, the Disciple gains an &#34;Elemental perk&#34;, which allows selection of a specific Draconic sub-type.\r<br />\r<br />This mod focuses exclusively on the abilities developing from your draconic nature. It will not change your appearance. I did this intentionally. There are already a number of mods which allow you to change your appearance, and I didn&#39;t see any reason to duplicate what another modder had already done successfully. If you want an appearance-altering mod, please examine one or more of these:\r<br />* [url=http://www.nexusmods.com/skyrim/mods/53271/?]Animated Dragon Wings\r<br />[/url]* [url=http://www.nexusmods.com/skyrim/mods/13995/?]Mystic Tails[/url]\r<br />* [url=http://www.nexusmods.com/skyrim/mods/14221/?]Astaroth Suit[/url]\r<br />* [url=http://www.nexusmods.com/skyrim/mods/15775/?]Flying Mod[/url]\r<br />I use all of these alongside DSDII, and have no conflicts.\r<br />\r<br />[u][color=#00ffff]Mod Requirements:\r<br />[/color][/u]This mod requires all DLC and Update.esp.\r<br />[url=http://www.nexusmods.com/skyrim/mods/18340/?]General Stores[/url] is also required.\r<br />\r<br />[u][color=#00ffff]Installation\r<br />[/color][/u]1) Download and install using NMM. (Or manually unzip into your &#34;Data&#34; folder.)\r<br />2) Activate the file.\r<br />3) Load Skyrim.\r<br />4) Upon loading a new or saved game, your character will receive a new voice-equipped Lesser Power: &#34;[Dragon Soul Disciple] Perk Tree&#34;.\r<br />5) If you&#39;re loading a saved game, you will also receive DSD perks based on the number of dragon souls you&#39;ve absorbed previously.\r<br />6) Use the [Dragon Soul Disciple] Perk Tree power to open a new perk menu where you can exchange your DSD Perks for draconic abilities.\r<br />\r<br />[u][color=#00ff00]Elemental Perks[/color]\r<br />[/u][color=#ffff00][b][color=#f1c232]Fire Affinity:[/color][/b] [/color]Provides 50% resistance to Fire magic and increases Fire shout damage by 50%.\r<br />[b][color=#f1c232]Fire Mastery:[/color][/b] Provides another 50% resistance to Fire magic and increases all Fire spell damage by 25%. Requires Fire Affinity.\r<br />[b][color=#00ffff]Frost Affinity:[/color][/b] Similar to Fire Affinity, but frost-oriented.\r<br />[b][color=#00ffff]Frost Mastery:[/color][/b] Similar to Fire Mastery, but frost oriented. Requires Frost Affinity.\r<br />[b][color=#ffff00]Shock Affinity:[/color][/b] Shock resistance, and Call Lightning lasts 50% longer.\r<br />[b][color=#ffff00]Shock Mastery:[/color][/b] Similar to Fire Mastery, but shock-oriented. Requires Shock Affinity.\r<br />[color=#00ff00]Poison Affinity[/color][color=#00ff00]:[/color] Resist poison, increase effectiveness of debilitating shouts.\r<br />[color=#00ff00]Poison Mastery[/color][color=#00ff00]:[/color] Resist poison, increase duration of debilitating shouts. Requires Poison Affinity.\r<br />[color=#999999][b]Dracoliche:[/b][/color] Increase the magnitude of all spells by the number of unspent dragon souls the Disciple holds. Requires at least one Elemental Mastery.\r<br />\r<br />[u][color=#00ff00]Dragon Soul Disciple Perks[/color]\r<br />[/u][color=#ff00ff][u]Breath Weapon:[/u][color=#ffffff] Allows a Disciple to deal magical damage at a short range in front of the disciple&#39;s mouth. The type and magnitude of the damage depends upon the Disciple&#39;s Elemental Perks. Each use spends a Fury point. Requires [color=#ff00ff]Draconic Fury[/color].\r<br />[color=#ff00ff][u]Claws (Impaling):[/u][/color] Unarmed sneak attacks deal 15x damage (similar to the dagger perk). Requires at least 5 levels of [color=#ff00ff]Unarmed Damage[/color].\r<br />[color=#ff00ff][u]Claws (Rending):[/u][/color] Unarmed attacks ignore 75% of the victim&#39;s armor (similar to the mace perk). Requires at least 3 levels of [color=#ff00ff]Unarmed Damage[/color].\r<br />[color=#ff00ff][u]Claws (Slashing):[/u][/color] Unarmed attacks deal bleeding damage (similar to the axe perk). Requires at least 1 level of [color=#ff00ff]Unarmed Damage[/color].\r<br />[color=#ff00ff][u]Dark Vision:[/u][/color] Provides a lesser power that gives the Disciple dark vision for 8 hours. Casting a second time within that period will resume normal vision.\r<br />[color=#ff00ff][u]Draconic Bite:[/u][/color] Gives the Disciple a chance to deal massive biting damage when successfully striking an enemy with at least one hand empty. Requires [color=#ff00ff]Claws (Slashing)[/color].[/color]\r<br />[u]Draconic Fear:[/u] [color=rgb(255,255,255)]This perk provides a lesser power that toggles an aura of intimidation around the Disciple. Enemies within 30&#39;, whose level is lower than the Disciple&#39;s DSD level (max 20) will flee in fear for 5 seconds. Casting the lesser power a second time turns off the aura.[/color]\r<br />[u]Draconic Fury:[/u][color=rgb(255,255,255)] This perk is a prerequisite for several activated abilities. It provides a number of uses of those abilities equal to the DSD&#39;s level in a shared pool. The pool regenerates once each day.\r<br />[color=#ff00ff][u]Draconic Lungs:[/u][color=#ffffff] Provides immunity from drowning.\r<br />[color=#ff00ff][u]Draconic Physiology:[/u][/color] Provides significant resistance to diseases.\r<br />[/color][u]Draconic Strength:[/u][/color] There are 5 levels of this perk. Each one increases the Disciple&#39;s melee damage by 10%. Each level requires twice the number of perks spent on [color=#ff00ff]Increased Carry Weight [/color](so a 50% boost to damage requires 5 levels of this perk AND 10 levels of Increased Carry Weight... translating to 30 dragon souls absorbed). Powerful, but expensive.\r<br />[color=#ff00ff][u]Draconic Voice:[/u][/color] The effectiveness of the Disciple&#39;s Illusion spell is increased by the Disciple&#39;s Speechcraft skill (double at Speechcraft 100).\r<br />[color=#ff00ff][u]Draconic Wrath:[/u][/color] This is a limited-use ability similar to an Orc&#39;s Berserking. Each use of this ability consumes a Fury point, and so this perk requires [color=#ff00ff]Draconic Fury[/color]. Unlike the Orcish ability, this can be triggered involuntarily any time the Disciple is struck in combat. Dragons are known for their violent, destructive tempers.\r<br />[/color][u]Dragon Hide:[/u][color=rgb(255,255,255)] The Disciple&#39;s toughened flesh reduces the damage of incoming physical blows. There are 10 levels of this perk, each one reducing incoming damage by 5%.\r<br />[color=#ff00ff][u]Dragon Lair:[/u] [/color]This ability requires 3 perks. It provides a spell that allows the Disciple to teleport to a private draconic lair. The lair is a player house designed around displays of wealth and power, although it is fully functional as a home. Due to the nature of the home, it is not designed for inhabitation by family or followers.[/color]\r<br />[u]Dragon Skin:[/u][/color] There are 5 levels of this perk, each one allowing you to absorb (as per the Atronach Stone or the Breton racial power) 5% of incoming magicka.\r<br />[color=#ff00ff][u]Increased Carry Weight:[/u][/color] Each level increases the Disciple&#39;s Carry Weight by 10.\r<br />[color=#ff00ff][u]Increased HP:[/u][/color] Each level increases the Disciple&#39;s Hit Points by 10.\r<br />[color=#ff00ff][u]Increased MP:[/u][/color] Each level increases the Disciple&#39;s Magic Points by 10.\r<br />[color=#ff00ff][u]Increased SP:[/u][/color] Each level increases the Disciple&#39;s Stamina Points by 10.\r<br />[color=#ff00ff][u]Shout Recovery:[/u][/color] There are 10 levels of this perk, each reducing the shout cooldown by 10%. This will (eventually) provide 100% reduction in cooldown time, but you can stop at any level short of that. I find that 100% reduction actually makes it difficult to time which word of the shout my character has actually used.\r<br />[color=#ff00ff][u]Unarmed Damage:[/u][/color] There are 10 levels of this perk, each increasing the Disciple&#39;s unarmed damage by 10.\r<br />\r<br />[color=#00ffff][u]The Dragon&#39;s Lair[/u][/color]\r<br />The lair is a player home designed around the concept that an immortal, powerful being could sit there and brood over its treasures. The lair has four rooms, which provide the major amenities of home. The largest of the rooms is a pit. As the player stores more gold in the General Stores Treasures, the pit will fill up with a variety of treasures. There are display upgrades at 10k, 50k, 100k, 200k, 300k, 400k, 500k, 750k and 1million gold stored. There will also be minor treasures added through the rest of the lair, but it is not nearly as dramatic. Some of the &#34;home amenities&#34; require at least 10k gold stored.\r<br />\r<br />In addition to quest-tracking displays for the major artifacts in the game, there are specialty areas in the bedroom for each guild (look for switches on the walls). Similarly, the library has all crafting stations, along with displays for such items as the Elder Scrolls and the Black Books. The area around the throne provides displays for daedric artifacts, dragon masks, claws, and a couple other unique artifacts.\r<br />\r<br />The majority of the displays are activated by quest completion. Those that actually orient around the item will store the copy of the item in the General Stores Treasures container. This is done intentionally, in order to provide compatability with one of the options from the [url=http://www.nexusmods.com/skyrim/mods/32550/?]General Displays[/url] mod. The displays in the Lair are fairly script-heavy. I wrote one massive script that controls the majority of the displays. That script is divided into portions, and one portion runs each second in order to reduce load on your system. That means that if you think something should be displayed, you may need to wait a couple seconds before it pops in. Apart from that intentional delay, I have noticed no performance impact on my system.\r<br />\r<br />[color=#00ffff][u]Final Thoughts, Permissions and Disclaimer:[/u][/color]\r<br />This is a spiritual descendent of my original Dragon Soul Disciple mod. The inspiration from the Dungeons and Dragon&#39;s Dragon Disciple class is there, although it&#39;s taken a more TES-friendly manifestation in this mod. The implementation of the perk system for this mod is my personal creation, an implementation that first appeared in my Blood Magery mod. I do not give permission to use this implementation concept without limitation; ask me. I&#39;ll probably discuss with you what you want to do, and advise you to make modifications to my system that fit your needs more closely. Do not distribute this mod outside the Nexus community.\r<br />\r<br />I have tested this mod through a couple different characters in my own playtesting. That means that I&#39;ve caught and corrected several errors, but I may not have caught everything. Keep a savegame from before installation, just in case.",
  "categoryId": "93",
  "version": "1.11",
  "author": "MasterBobcat",
  "createdUnix": "1415887593",
  "updatedUnix": "1415921860",
  "containsAdultContent": false,
  "uploadedBy": "MasterBobcat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135116",
      "name": "MB_DSDII_v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "118",
      "fileName": "MB_DSDII_v1-59905-1.zip",
      "uploadedUnix": "1415887360",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9abb32141cfa117104897597bf760d4e23b81e5d3ed0fb41f9ee5ca23df45e36/analysis/1415887442/",
      "changelogHtml": " Initial release 13NOV2014. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MB_DSDII_v1-59905-1.zip?fid=1000135116&ttl=1535847344&ri=8192&rs=8192&setec=a313b365278e810c2888af02468c4780"
    },
    {
      "fileId": "1000135152",
      "name": "MB_DSDII_v1.11patch",
      "version": "1.11",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1",
      "fileName": "MB_DSDII_v1.11patch-59905-1-11.zip",
      "uploadedUnix": "1415921860",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/f519003b3af2001341a59707d87156989a484800311fc711f77154d5f82dc74e/analysis/1415921942/",
      "changelogHtml": " Corrects a Dragon Fear issue. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MB_DSDII_v1.11patch-59905-1-11.zip?fid=1000135152&ttl=1535847344&ri=8192&rs=8192&setec=3773d38d46132a0164f44ae65acaf336"
    }
  ]
}