{
  "modId": 59963.0,
  "modName": "Stronger Crossbows - Version 1.0",
  "summary": "A simple mod that alters the weight and power of the standard crossbow within Skyrim. (Dawnguard is Required).",
  "descriptionHtml": "[center][img]http://i.imgur.com/9d6XeFs.png[/img]\r<br />\r<br />[img]http://i.imgur.com/Vi4EvuW.png[/img]\r<br />\r<br />Hello, and welcome to Stronger Crossbows&#33; This is a mod that i decided to quickly put together, due to me believing that the Steel Crossbow that is within Skyrim, isn&#39;t strong enough, and doesn&#39;t have the characteristics of a real crossbow. \r<br />\r<br />[color=#ff0000][size=3]&#34;THE CROSSBOW IS ALREADY OVERPOWERED&#34; [/size][/color][size=3]you may say, but take any of these examples and tell me that i&#39;m wrong.\r<br />\r<br />[/size][color=#ff0000][size=3][u]Without my mod[/u][/size][/color]\r<br />\r<br />Villager gets shot in the face. Survives.\r<br />\r<br />Guard gets shot multiple times. (7-8) and is still left standing, able to fight.\r<br />\r<br />Animals are shot with the bolt (Large animals such as bears) and still put up a fight.\r<br />\r<br />Dragons can take countless amounts of shots from a Crossbow, and damage is deducted slowly.\r<br />\r<br />Unarmed enemies are shot in a vital area of their body, such as their chest, and they are still able to walk around as if nothing hit em&#39;\r<br />\r<br />[color=#ff0000][size=3][u]With my mod installed&#33;[/u][/size][/color] \r<br />\r<br />Most villagers will die when shot with a Crossbow bolt, as without armor and without any defense mechanisms whatsoever, they are helpless.\r<br />\r<br />Guards will only have to be shot 3-4 times, as they will still become wounded despite wearing armor, due to the shear force of a crossbow.\r<br />\r<br />Large animals such as bears can be killed using a single bolt, as they too have no way of defending themselves, allowing the Crossbow bolt to penetrate through their bones, and cause alot of damage. \r<br />\r<br />Dragons will not take as many attacks from a crossbow. Despite their scaly rough skin, the bolts still manage to get through their protective layer, and take damage, but a number of bolts will still be required to kill it.\r<br />\r<br />Unarmed enemies will most likely die from a single shot, due to them not having any defense (Similar to a villager) and on rare occasions will survive depending on if they are a abnormally strong character, or are essential within the game, meaning they cannot die either way&#33; \r<br />\r<br />Do you see where I am going? Do you see that this system is more realistic than within Skyrim? I hope you do.\r<br />\r<br />[img]http://i.imgur.com/6dvCOEp.png[/img]\r<br />\r<br />[size=3][color=#ff0000]-[/color] Slight increase in weight due to me assuming that they needed a little extra bit of weight.\r<br />\r<br />[color=#ff0000]-[/color] Damage has obviously been increased for realistic reasons and to help you in general when in combat.\r<br />\r<br />[/size][color=#ff0000]Depending on how this mod goes, i may go ahead and release another version of it, and perhaps make alterations to the Dwarven Crossbow also, along with the bolts that go along side both of the Crossbows, but that is yet to be done&#33; \r<br />\r<br />[img]http://i.imgur.com/TpJfBa1.png[/img]\r<br />\r<br />[/color][size=3]DAWN GUARD IS REQUIRED&#33; IF YOU DO NOT HAVE DAWNGUARD, THEN YOU WILL OBVIOUSLY NOT HAVE THE CROSSBOWS WITHIN YOUR GAME, MAKING THIS MOD NOTHING BUT POINTLESS. PLEASE REFRAIN FROM DOWNLOADING IF YOU DO NOT HAVE IT&#33;\r<br />\r<br />[color=#ff0000]THIS MOD MAY ALSO NOT BE TO EVERYONES LIKING. IF YOU DO FEEL LIKE LEAVING A COMMENT, OR GIVING ME SOME FEEDBACK IN GENERAL THEN PLEASE DO SO. \r<br />\r<br />[img]http://i.imgur.com/tdmH0yE.png[/img]\r<br />\r<br />[/color][/size]I would like to thank anyone that goes ahead and downloads this mod. It took me a matter of minutes to produce as i simply had to alter a few bits of data, so don&#39;t give me too much praise. I configured this to how I would expect a crossbow to function, and the realistic characteristics of a crossbow, and was not an attempt to make the weapon overpowered. Please endorse if you feel the need to, and I hope you enjoy your slightly more realistic crossbow&#33; \r<br />\r<br />\r<br />[/center] ",
  "categoryId": "24",
  "version": "1.0.0",
  "author": "Fi5h1fishy",
  "createdUnix": "1416007795",
  "updatedUnix": "1416007768",
  "containsAdultContent": false,
  "uploadedBy": "fi5h1fishy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135324",
      "name": "Stronger Crossbows Version 1.0.0",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "205",
      "fileName": "Stronger Crossbows Version 1.0.0-59963-1-0-0.rar",
      "uploadedUnix": "1416007768",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/d8e8d8547d1a6ecba1df23e6648b67c06fb403aeb0e8c9ca8257a8a871b6171f/analysis/1416007862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stronger%20Crossbows%20Version%201.0.0-59963-1-0-0.rar?fid=1000135324&ttl=1535847455&ri=8192&rs=8192&setec=197845d79e6d23a73fe6d957e75d5dcc"
    }
  ]
}