{
  "modId": 5997.0,
  "modName": "Dalls_High_Mage",
  "summary": "High_Mage is clothes / robes custom texture remake (n not some simple - in-part - recolor) mod which changes how player (if mage) and Skyrim Higher Mages / their attires / robes (Expert, Master, Arch-Mage, Psiijic Order n Dragon Priests) look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - High_Mage\r\n\r\nv1.2\r\n\r\n24/01/2012\r\n\r\nHigh_Mage is clothes / robes custom texture remake (n not some simple - in-part - recolor) mod which changes how player (if mage) and Skyrim Higher Mages / their attires / robes (Expert, Master, Arch-Mage, Psiijic Order n Dragon Priests) look.*\r\n\r\n* Word of warning - my work actually do changes how these items look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers.\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nMages in Skyrim - especially Winterhold Collage academics - are for some reason made to look as quite motley n in-rags crew. Journeymen attires with furred hoods are interesting idea if you want to see (collage) mages as consummate travellers but - in my opinion unnecessary - addition of beggars\\' bandages / wrap-arounds (mages robes n boots) makes them look plain silly. Arch-Mage\\'s - furred poncho - outfit you\\'ll receive as (mage) reward - is yet another curious piece of Skyrim visual lore. \r\n\r\nThese (item) models being what they are were not easy to convert into something a bit more sensible and still Skyrim lore-friendly but as far as I\\'m concerned it was worth effort as this new (mod) lot definitely gives (higher) mages their dignity n good-looks back. Even Arch - Mage\\'s outlandish outfit (especially its hooded version) is - now - not too bad. ;)\r\n\r\nFemale Arch-Mage \\\"poncho\\\" has \\\"new\\\" model (no fur-trimmings) - if unhappy with this visual - only change install (last) my Female Arch-Mage_Fur Lined Poncho or simply remove / delete my altered (mod) meshes.\r\n\r\nLower (collage novices n likes) mages / their (body) outfits will not be affected by this mod but as boots they use / wear are same as worn by higher mages - expect to see them in my new - no-bandages - boots as well.\r\n\r\nAnd of version v1.1, Psiijic Order Mages / their outfits have been added as well. If you are wondering why - they are Skyrim\\'s ultimate in magic and as such, they definitely deserve place in my High Mages / robes assortment.\r\n\r\nAnyway, give it go and see for yourself. If your mage is still very far from being made into Arch-Mage and curious to see this new outfit first-hand - you might find useful these - add item to inventory - game (cheat) console codes: \r\n\r\nArch-Mage Hooded Robe - 0010F570\r\nArch-Mage No - Hood Robe - 007C932\r\nArch-Mage Boots - 007C92E\r\n\r\nand as your chances of becoming member of mysterious Psiijic Order or acquiring their outfit by \\\"legal\\\" game means are very small - read none - existent you can - at least - try to conjure their illustrious n prestigious outfit. Console - Add Item - Codes for their lot are:\r\n\r\nPsiijic Robe   - 00065B94 \r\nPsiijic Hood   - 00065B99\r\nPsiijic Boots   - 00065B9B\r\nPsiijic Gloves - 00065B9D\r\n\r\nAnd as final addition which completes this mod - Liches - in Skyrim lore - Dragon Priests. If you are wondering, why they - being (lore) vicious undead creatures - know if you don\\'t - Liches were High Mages - ultimate ones that have conquered death trough use of their (evil) Magic but at cost of becoming zombie-like creatures / corpse-like undead. You can not become one and in Skyrim (game), you will meet only few - but when you do, you will certainly understand why they are rightfully here with other High Mages. ;)\r\n       \r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my texture files from Data/textures/clothes/archmage, mageapprentice, magejourneyman, psiijic, and Data/textures/actors/dragonpriests and finally my altered (mod) meshes from Data/meshes/clothes/archmage - after that original look will be restored to your game. \r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!\r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nNote on v1.1: Some minor improvements (Arch-Mage) and Psiijic Order outfits added.\r\n\r\nNote on v1.2: Dragon Priests textures added.\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.",
  "categoryId": "60",
  "version": "1.2",
  "author": "Dall",
  "createdUnix": "1326376366",
  "updatedUnix": "1327441680",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19129",
      "name": "Dalls_High_Mage",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13693",
      "fileName": "Dalls_High_Mage-5997.7z",
      "uploadedUnix": "1326376725",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e6bac1003948e8544c0a664b48dd90cadbd6218d8f946db5a3d0d41c50e833ab/analysis/1406605045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_High_Mage-5997.7z?fid=19129&ttl=1535763145&ri=8192&rs=8192&setec=f9ae455946dfcfa0ef0d33001367a8c2"
    },
    {
      "fileId": "19455",
      "name": "Dalls_High_Mage_v11",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "19108",
      "fileName": "Dalls_High_Mage_v11-5997.7z",
      "uploadedUnix": "1326482457",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7a910ef80483b41a3ea3ab35f719c6660da1b0d229ea0ff0fdcc1de7ac69818e/analysis/1406608403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_High_Mage_v11-5997.7z?fid=19455&ttl=1535763145&ri=8192&rs=8192&setec=f855860d352465d81f1089f1aace99fe"
    },
    {
      "fileId": "22731",
      "name": "Dalls_High_Mage_v12",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22856",
      "fileName": "Dalls_High_Mage_v12-5997-1.7z",
      "uploadedUnix": "1327441680",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ba0f1ef65fd5b7abce4581240645713b88439451078bfa7651b2062cb0e2fc7f/analysis/1406635697/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_High_Mage_v12-5997-1.7z?fid=22731&ttl=1535763145&ri=8192&rs=8192&setec=34fbf86c84edf8f8fb9936f0b2cb6a0c"
    }
  ]
}