{
  "modId": 60008.0,
  "modName": "Queen Mary&#39;s Favour -A Staff of large proportions",
  "summary": "A more descriptive version&#33;",
  "descriptionHtml": "Well, I&#39;ve decided to re-upload this mod, because I guess not very many people like to download mods blind (which I understand)... But I would just like to say, that this mod is made much better if you do not know what it is going in. That is why I would suggest you go back to my first upload page (that contains no spoilers) and download from there&#33;\r<br />\r<br />Here: http://www.nexusmods.com/skyrim/mods/59995/?\r<br />\r<br />Last chance to change your mind&#33;\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />{SPOILERS&#33;&#33;&#33;&#33;&#33;&#33;&#33;}\r<br />\r<br />To Sum it up, I made a big dildo staff, and put it into Skyrim =) If that sounds like it interests you (you know it does&#33;&#33;&#33;&#33;), than please read on =)\r<br />\r<br />Have a look at my pictures to know exactly what you&#39;re downloading, and also where to find it when you (hopefully) do&#33;\r<br />\r<br />This is a Mod that I made for my college painting class. The assignment was to create some kind of project that contrasted high society with low society (like a fancy dress made of toilet paper or something....). So I decided to do something like this =) The contrast is pretty obvious when you read the poem I made to go with it(which you should also do-It&#39;s at the entrance to the tomb). It&#39;s also kind of a commentary on the lack of immature humor in this game, and on the need for the player to receive some kind of reward at the end of each section in this(and many other) game(s) (example: go in tomb, fight guys, get reward). \r<br />\r<br />The Staff is basically the most immature thing that I could think to put in this game, within the time limit.\r<br />\r<br />And I came into class with this on the projector&#33; lol Never though i&#39;d be doing something like this for school =) \r<br />\r<br />So anyways, that&#39;s my dry interpretation of the humor of my mod (which you really should not have been reading if you were following my advice&#33;). And hopefully that clarifies some things for some people =)\r<br />\r<br />But come on.... it&#39;s a Dildo Staff that shoots flames... Here you go&#33; \r<br />\r<br />P.S. I will leave part of my mod for you guys to find though.... let&#39;s just say.... a great warrior has a ..... large task ahead of him.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Bradzy",
  "createdUnix": "1416132239",
  "updatedUnix": "1416131843",
  "containsAdultContent": true,
  "uploadedBy": "Bradzy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135552",
      "name": "Queen Mary&#39;s Favour",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5147",
      "fileName": "Queen Mary's Favour-60008-1-0.zip",
      "uploadedUnix": "1416131843",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/793154230a8093e5fe0c6c0277fb9abf2f8a35794024d03503d0521091c324ac/analysis/1416131945/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Queen%20Mary%27s%20Favour-60008-1-0.zip?fid=1000135552&ttl=1535847531&ri=8192&rs=8192&setec=ad7b46e7ad588d3eb092e887df68233f"
    }
  ]
}