{
  "modId": 60027.0,
  "modName": "SkyrimKiltMod",
  "summary": "Unfinished mod to add a kilt, that looks like a kilt, moves like a kilt, and is easy to change the tartan on.",
  "descriptionHtml": "The first mod I attempted.  Was unhappy with available kilt, tartan mods at the time, so decided to make my own.  Couldn&#39;t find meshes that really did what I wanted, so I ended up making new meshes from scratch.  Through trial and error, I think I got the meshes to work without any clipping.  Problem I ran into was trying to get the lighting to work on the textures.  After spending way too many hours reading modding guides online and trying to figure it out, I eventually lost interest and just gave up.  After better part of a year, I have picked up playing Skyrim again, so I thought I would appeal to the nexus community for someone to finish my mod.  Currently, the mod can be loaded and the kilt crafted at a forge, but the .esp is a mess and poorly organized.  It would probably be easier for someone who knows what they are doing to use my meshes with a new .esp.\r<br />\r<br />I was also planning on adding a belt, so it looks right with a sword sheathed on the hip, maybe making the kilt look rougher and more lived in.  I tend to play with the shirtless default fur kilt, so I wasn&#39;t planning on adding a shirt, or cuiress, but feel free.  Anyone that wants to uses the meshes I made for other mods is free to do so.  I offer this to the nexus community, do what you will.",
  "categoryId": "29",
  "version": "1",
  "author": "LoganBruce",
  "createdUnix": "1416172013",
  "updatedUnix": "1416171998",
  "containsAdultContent": false,
  "uploadedBy": "loganbruce",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135685",
      "name": "UnfinishedKiltMod",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3504",
      "fileName": "UnfinishedKiltMod-60027-1.zip",
      "uploadedUnix": "1416171998",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e003dc65ca6307f489c3753ad0debfa8ea3e461beaef7ed839e130eb9f3d5d4d/analysis/1416172093/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UnfinishedKiltMod-60027-1.zip?fid=1000135685&ttl=1535847549&ri=8192&rs=8192&setec=c109c3be7e75862a04da563fd64c5a01"
    }
  ]
}