{
  "modId": 60030.0,
  "modName": "DreezNation Lighting Tweaks (Performance Friendly Exterior Lighting)",
  "summary": "Boosts saturation, and decreases night brightness using vanilla assets.",
  "descriptionHtml": "[size=5]Requirements: Skyrim, nothing else needed[/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=4]By request added a second file which makes nights a little less dark (vanilla multiplier for brightness changed from 1/3 to 2/5)[/size]\r<br />\r<br />This is a mod I made for myself personally. I have a low quality computer (I gotta disable shadows and all kinds of settings just to be able to move without lag). I have always been disappointed with vanilla visual settings. Everything looks too whitewashed and I dont even realize when the sun is up or down. I tried to find other mods that accomplished this, but most deal with ENB and all that fancy stuff. So I took matters into my own hands&#33;\r<br />\r<br />[size=5]Here is DreezNation Lighting Tweaks. Nights are dark and you need a torch, Days are vanilla brightness, Dusk and Dawn changes are now noticeable and cool to watch with the game time multiplier way up. Saturation is boosted to the boarder-line. All setting changes were calculated by a multiplier to the vanilla settings. (This means the vanilla saturation and brightness change between a rainy day or clear day are still present). Pictures were included to help viewer see the difference between night and day.[/size]\r<br />\r<br />I really enjoy this change. The way I use this mod with my computer&#39;s visual settings is: My computer and monitor settings are factory. However, monitor backlight is set to 0 (that way I can play for a while without murdering my eyes).\r<br />\r<br />If you try this mod out and it does not fit to your desires I can make some adjustments, you can request in the comments or via message. One thing to note though, is I will never have your computer&#39;s settings so I won&#39;t be good at making something look better for you. Best thing you can do is take this mod into Tes5 edit and change the settings to your liking.\r<br />\r<br />Before I leave you to your downloading/gaming I must first give credit where due. First to Bethedesa, and then to Aplestormy who created [url=http://www.nexusmods.com/skyrim/mods/32064/?]Immersive Saturation Boost[/url]. I did not use any assets from the mod, but my ideas were a direct result of viewing the mod.",
  "categoryId": "62",
  "version": "1",
  "author": "DreezNation",
  "createdUnix": "1416180593",
  "updatedUnix": "1416199440",
  "containsAdultContent": false,
  "uploadedBy": "DreezNation",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135718",
      "name": "DreezNationLightingTweaks",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "DreezNationLightingTweaks-60030-1.zip",
      "uploadedUnix": "1416180552",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/158776d63f2612783843af182fba9a3359a5fb355292789cda7e9086acee27e3/analysis/1416180662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DreezNationLightingTweaks-60030-1.zip?fid=1000135718&ttl=1535847553&ri=8192&rs=8192&setec=cb076f3cd949cd9b546275399d34ca2c"
    },
    {
      "fileId": "1000135757",
      "name": "DreezNationLightingTweaks 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "DreezNationLightingTweaks 1.1-60030-1-1.zip",
      "uploadedUnix": "1416199440",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7300ffd7f93712cd9170592d348336668231c759b3c91298c61265cb3c94eeaf/analysis/1416199503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DreezNationLightingTweaks%201.1-60030-1-1.zip?fid=1000135757&ttl=1535847553&ri=8192&rs=8192&setec=21c954223f63913bc3099fae965bb737"
    }
  ]
}