{
  "modId": 60034.0,
  "modName": "Whiterun Gatehouse Home Redux",
  "summary": "A retake on Scon27&#39;s house mod - Whiterun Gatehouse Home and Skooma Den with Bug fixes and redone interior.",
  "descriptionHtml": "                                        [color=green]Whiterun Gatehouse Home Redux[/color]\r<br />\r<br />   A immersive hidden free home located at Whiterun with a entrance both inside and outside the city. The house was originally a guard lookout post located within the city that linked into a reservoir which drains out into the water that flows under the drawbridge near the city gate. The guard post was eventually turned into a storage location and the reservoir was taken over by local skooma dealers. Only recently the guards chased off the skooma dealers and the reservoir was blocked off to prevent future miss-use.\r<br />   The housing site can be entered from two ways but on first time entry you can only enter via the gatehouse. Upon entering Whiterun take an immediate right and you will find a ladder with barrels blocking the way. Once you have climbed up you will find the abandoned guard post that is now being used to store various items. Among the clutter you will find an enchanting table and alchemy lab, abandoned by a buyer for lack of product quality. On closer inspection you will find an ivy covered door and with the right set of tools you could make entry. Inside you will find a reservoir which still bears evidence of the recent skooma dealings in the area.\r<br />\r<br />[color=red]House Information[/color]\r<br />\r<br />Safe Storage both in the reservoir and the guardpost\r<br />Container labeled as Skooma Stash respawns with both skooma and moonsugar\r<br /> ( not safe storage)\r<br />Bookshelf with space and storage for extra books\r<br />Several container for storage both in the reservoir and the guardpost\r<br />Bed DOES NOT provide well rested since it is not a &#34;purchased home&#34;\r<br />Several plants to harvest as well as respawning critters in the water section\r<br />Shrine of Zenithar\r<br />Cooking pot and fire\r<br />Fully nav meshed\r<br />Flowing water for those who have mods depending on it (drinking mods)\r<br />Entrance both outside and inside the city (Bring the joys of riften to whiterun&#33;)\r<br />\r<br />Big thanks to Scon27 for letting me post this edit up on Nexus&#33;\r<br />View his original version of the mod here ~ [url=http://www.nexusmods.com/skyrim/mods/48885/?]Whiterun Gatehouse Home and Skooma Den\r<br />[/url]\r<br />Please do not distribute to other sites~",
  "categoryId": "67",
  "version": "1.0",
  "author": "Scon27 - edits by Zazuban",
  "createdUnix": "1416189278",
  "updatedUnix": "1416189271",
  "containsAdultContent": false,
  "uploadedBy": "Zazuban",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135744",
      "name": "Whiterun Gatehouse Redux",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "103",
      "fileName": "Whiterun Gatehouse Redux-60034-.zip",
      "uploadedUnix": "1416189271",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/19aa9355434f5a424dfb809966a17e77f6f1b4d9f5e75d1004eef261ee3157e9/analysis/1416189362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whiterun%20Gatehouse%20Redux-60034-.zip?fid=1000135744&ttl=1535847560&ri=8192&rs=8192&setec=49b2e051c1b76696e60fe2cf2cbe3a05"
    }
  ]
}