{
  "modId": 60040.0,
  "modName": "Destrier Observatory - Dragonborn",
  "summary": "A wealthy cottage and observatory in Whiterun&#33;",
  "descriptionHtml": "[size=4][u][b]Destrier Observatory[/b][/u][/size]\r<br />\r<br />In a spell between work, Nanowrimo and a Quest mod, this was relaxing. And relaxing to live in&#33; Destrier Observatory is a player home just outside of Whiterun on the path past the Khajiit merchants, at the base of the waterfall and creek. The land area has an expanded pond for bathing, a chicken coup with small garden, and gemstone ores at the waterfall. No smelter or tannery; there&#39;s Whiterun for that. Tried making the place fairly lore-friendly, with that lovely Imperial/Dunmer style of Raven Rock buildings. The observatory is nonfunctional beyond modular lighting, and mainly for style. \r<br />\r<br />Functional amenities; \r<br />- 1 shield/sword plaque, 1 horizontal display plaque, 2 display cases, 5 weapon racks, 1 mannequin.\r<br />- Wood-chopping block on the exterior, alchemy/enchanting tables with the Dragonborn staff-maker on the interior.\r<br />- 1  double bed and dining table; House meant for more of a singles locale. \r<br />- Shrine of Julianos and Talos in the front room. \r<br />- A heavy amount of storage containers for the house. \r<br />\r<br />Requirements and Installation; \r<br />- Only the most recent Skyrim patch and the Dragonborn DLC, using only in-game parts. \r<br />- Compatible with the My Home is Your Home mods that by themselves modify the building for other people. \r<br />- Only one ESP to drop into your Data folder. \r<br />\r<br />Incompatible mods;\r<br />- In the same location as the UK02 Mudcrab Hunters mod. Sorry about that.\r<br />\r<br />This is, I think, a pleasant and small house that I hope you find enjoyable. If anyone wishes to do more to it, they are more than welcome to&#33;",
  "categoryId": "67",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1416202661",
  "updatedUnix": "1416202657",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135762",
      "name": "Destrier Observatory",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "184",
      "fileName": "Destrier Observatory-60040-1-0.zip",
      "uploadedUnix": "1416202657",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/547d806c8870fadd14a9dbce3801073a5e4f546a4653e157af617bbe8094d361/analysis/1416202742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destrier%20Observatory-60040-1-0.zip?fid=1000135762&ttl=1535847567&ri=8192&rs=8192&setec=05da7ba702c5b664cb4add8a2a43dba8"
    }
  ]
}