{
  "modId": 60053.0,
  "modName": "Fortify enchanting-Fortify smithing ingredients and Perfect touch are back and improved",
  "summary": "Some mods modify &#34;perfect touch&#34; perk so you can only pickpocket weapons, not armor. Now you can again, and it now works in essential NPC´s too. Also the fortify enchanting/smithing potions are back and stronger. Simple and compatible with every mod that needs this.",
  "descriptionHtml": "Some mods do have features that annoys me. I can not pickpocket equipped armor, only weapons. Or fortify enchating/smithing potions are disabled, or too weak. But the mods that fix such things are usually complicated and with reduced compatibility for big overhauls. So i made this to have those features back, with small modifications. This mod does not require any other mod to work, it is completely independent and compatible with everything (in theory), even mods that alter perks, big overhauls... It also has no scripts. \r<br />\r<br />[color=red][center]What this mod does:[/center][/color]\r<br />You can select two versions of the mod, fortify features and perk or only perk version. If you want the ingredients but not the perk, download the full version and dont activate the perk. Each feature is described here:\r<br />[u][b]Fortify ingredients:[/b][/u]\r<br />New NPC in winterhold college (hall of attainment) that sells new fortify enchanting/smithing ingredients, with slightly improved strenght. But they are VERY expensive. They are not modified ingredients, but new ones.\r<br />[u][b]Pickpocketing:\r<br />[/b][/u]First of all, the perk will not interfere with your perk trees, its invisible and independent.\r<br />This part of the mod does not improve the game, only gives back a feature that, in my opinion, should be there (in case you have a mod that disables it)\r<br />New perk that you can easily enable/disable via console commands  (explained in instructions section)\r<br />You can pickpocket armors/weapons, and now it also works on essential NPC´s. You need to remain undetected by THAT person or the armor wont be showed, so you need reasonable sneaking skills. Note that you need to remain undetected by that person, not others, just that one. The number of items you´ll see depends on that. What happens if you are caught by someone else is another story.\r<br />\r<br />\r<br />[color=red][center]INSTRUCTIONS(FOR THE PERK):[/center][/color]\r<br />1)Open the console, usually it is the key to left of the &#34;1&#34; in your keyboard, just above the tab key.\r<br />2)Type help &#34;rob perk&#34; (quotes included)\r<br />3)A small list will appear, look at the 8 digit number besides the rob perk\r<br />4)Then type &#34;player.addperk xxxxxxx&#34; (quotes not included) where xxxxxx is the number in step three.\r<br />5)Close the console, save and play\r<br />6)If by any reason you want to disable the perk do the same but type &#34;player.removeperk xxxxx&#34; (quotes not included) instead.\r<br />      \r<br />[color=red][center]UPDATING:[/center][/color]     \r<br />If updating from perk only version to perk and ingredients version just update normally, dont clean save.\r<br />If downgrading from perk and ingredients to perk only version: dont do it.  Just remove the perk as instructed above. It will not conflict.\r<br />\r<br />[color=red][center]LOAD ORDER:[/center][/color]\r<br />-The answer is in your heart. You can place it the first in load order.\r<br />\r<br />\r<br />[color=red][center]FAQ:[/center][/color]\r<br />Q: The perk is useless unless you use mods that disables pickpocketing armor like Requiem\r<br />A:[img]http://i838.photobucket.com/albums/zz303/kaliduss/Imrunningoutofpicturesgifss_56438977a811c12d48ccb4ad5003bd24.gif[/img]\r<br />\r<br />Q: Disrespectful comments/insults or similar stuff/Make, change or add  &#34;insert something here&#34; if you want my endorsement\r<br />A:[img] http://i838.photobucket.com/albums/zz303/kaliduss/63125b64c4445cff2fd639352485a172837532fcc5bc8c3102bd024170f30d09.jpg [/img]",
  "categoryId": "76",
  "version": "1.2",
  "author": "Cotoli",
  "createdUnix": "1416261662",
  "updatedUnix": "1416519841",
  "containsAdultContent": false,
  "uploadedBy": "cotoli",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136165",
      "name": "Perfect touch-Fortify enchanting-Fortify smithing ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "214",
      "fileName": "Perfect touch-Fortify enchanting-Fortify smithing -60053-1-2.rar",
      "uploadedUnix": "1416519841",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7e5f0231b12ee6bb7d9fb4b13f8949c38aedd4546d8060a664b5df439309e2cc/analysis/1416519903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perfect%20touch-Fortify%20enchanting-Fortify%20smithing%20-60053-1-2.rar?fid=1000136165&ttl=1535847582&ri=8192&rs=8192&setec=d9195f03c5a43c9b083ec2ae626b534d"
    }
  ]
}