{
  "modId": 60063.0,
  "modName": "Celeste - A Beautiful Ningheim Character Preset for RaceMenu and Save Game and Familiar Faces",
  "summary": "A beautiful Ningheim preset for those of you who want to jump straight into your game as a beautiful Ningheim without having to spend hours creating one. There is also a save game and a Familiar Faces preset.",
  "descriptionHtml": "[b][i][u][color=#00ffff][size=6][center]Celeste - A Beautiful Ningheim Character Preset for RaceMenu and Save Game and Familiar Faces[/center][/size][/color][/u][/i][/b][size=2][center](Please endorse if you enjoy the mod&#33;)[/center]\r<br />I enjoy creating characters a lot, but this is my first attempt at packaging one of those characters for others to use. I created Celeste within an hour, and although there may be some room to fine-tune her features a bit in the future, I wanted to release her for everyone to use in the time being. I usually revise my characters little by little as I progress through their story anyway, so you can likely expect minor changes both to the preset and this mod page in the future. I will do my best to update the page to reflect changes within the mod and to stay as active as my schedule will allow.[/size]\r<br />\r<br />Celeste is a character preset, meaning that she is [size=2][b][i][u]nothing more than a compilation of slider positions in the character creation menu[/u][/i][/b][/size]. You will need to install the appropriate mods if you want her to appear as she does in my images, and since she is a Ningheim character, you [b][i]WILL[/i][/b] need to install The Ningheim Race and its requirements as well. One of the requirements for The Ningheim Race is RaceCompatibility for Skyrim and Dawnguard, and you will also need RaceMenu along with its RaceMenuPlugin.esp and (preferably) RaceMenuOverlays.esp.\r<br />\r<br />If you download this preset without installing the recommended mods, then she could look better or worse than she does in my images, but if you download this preset without at least installing The Ningheim Race and its requirements, then you will not be able to use the preset as it was intended. If you aren&#39;t happy with how she looks in your game, then try installing the recommended mods. If that still doesn&#39;t make you happy, then tweak her a bit until she suits your needs&#33;\r<br />\r<br />I look forward to seeing your screenshots&#33; It&#39;s always nice to see someone using something that you created, and it helps other users see what Celeste looks like when loaded by someone who may or may not have all of the required files installed. Please keep your images user-friendly and abide by NexusMods&#39; Terms of Service. I am doing my best to keep my mod as safe for work as possible, so please don&#39;t request that I verify any NSFW images. Skimpy clothing is acceptable because this mod displays such, but I don&#39;t want to cross any lines.\r<br />\r<br />[size=5][center][u][color=#00ffff]Installation[/color][/u][/center][/size]\r<br />This character preset is saved using a .slot file extension. You need that .slot file to go in the appropriate folder. The appropriate file path is Data/SKSE/Plugins/CharGen/Presets. This mod (40.slot) will need to be placed within that Presets folder. If you have the required mods installed and have already saved a preset from within the character creation screen, then you should already have the proper folder directory. If not, then feel free to create the folders yourself once the recommended mods are installed. Alternatively, installing the character preset through NMM or MO should create the folder path for you. I made sure to set the file path correctly. It should appear within your game under the 40th preset slot in your character creation screen. For those who need it, the file path is as follows.\r<br />\r<br />[list][*][size=2]Data/SKSE/Plugins/CharGen/Presets/40.slot[/size]\r<br />[/*]\r<br />[/list]\r<br />The way that I do this is by making sure that my character&#39;s gender is set to female, making sure that my character&#39;s race is set to Ningheim and then simply navigating to the &#34;Presets&#34; tab and loading slot 40. It&#39;s as simple as that&#33; This will work on a new game or by typing &#34;showracemenu&#34; in your console command window and then following the steps that I listed above to use Celeste in an existing game.\r<br />\r<br />I have taken the time to create a new save game (using Alternate Start - Live Another Life) that you can download as well. It was created using only the required and recommended mods. By downloading and loading the save game, you will begin a new game as Celeste at the Sleeping Giant Inn in Riverwood. The only thing that I have done to the save is add the Face Light book by using the &#34;help face&#34; and player.additem &lt;the id for the book&gt; &lt;1&gt; console commands and casting the spell on Celeste. She should already have the spell cast on her when you load the save. If you don&#39;t have Face Light (which I highly recommend) installed, then you don&#39;t have to worry about any of that because she won&#39;t have it cast on her or know the spell. If you don&#39;t have Alternate Start - Live Another Life installed, then you won&#39;t have to worry about that either because the save was created after starting the new life. Again, please keep in mind that the save game requires the same mods as the preset if you want her to look the same as I have her in my images&#33;\r<br />\r<br />You will need the .ess file that is included in the zip file, but you don&#39;t necessarily need the .skse file. I included it anyway for those of you who would like to use it, but just make sure that you use the .ess file whether you use the .skse file or not. That&#39;s the one that you will have to have. You can download the file manually, extract the zip file somewhere on your desktop and place the save game in the appropriate folder. For me, the file path is as follows.\r<br />\r<br />[list][*][size=2]Documents/My Games/skyrim/Saves/Celeste.ess (and Celeste.skse for those who would like to use it)[/size][/*]\r<br />[/list]\r<br />I finished importing Celeste into the Familiar Faces mod and copied her .slot, .dds and .char.json files into the appropriate folders. Either you can download the mod manually, extract the contents somewhere on your desktop and then simply merge the Data folder with your skyrim/Data folder, or you can download and install using either NMM or Mod Organizer. Both programs will place everything in the appropriate folders.\r<br />\r<br />Celeste won&#39;t have an alcove assigned, so you will need to assign one for her, but that doesn&#39;t take long and you will likely want to customize her anyway by giving her a particular hangout so you always know where to find her and set her voice so that she sounds different from your other followers. You have complete customization over her this way and can set her to level with you, handle combat situations in particular ways and lots more. This is as close to a standalone follower as you will get until LivingDragon and I can sort all of that out and make her standalone, and Familiar Faces gives you a lot of options that you would otherwise have to manually set using the Creation Kit if she were a standalone follower.\r<br />\r<br />I encourage you to give that mod a try and download Celeste to see if it&#39;s your cup of tea. It should be simple enough to manage. Just be sure to check the mod&#39;s requirements as I won&#39;t list every requirement for every recommended mod on my mod page. I know that it requires JContainers but I&#39;m not sure what else is required as I don&#39;t own/update that mod in any way. You will need all of Celeste&#39;s required mods in order for her Familiar Faces preset to look the same as she does in my images, but that is no different than the requirements for the RaceMenu preset and the save game. The folder paths are as follows.\r<br />\r<br />[list][*][size=2]Data/SKSE/Plugins/CharGen/Exported/Celeste.slot[/size][/*]\r<br />[*][size=2]Data/textures/CharGen/Exported/Celeste.dds[/size][/*]\r<br />[*][size=2]Data/vMYC/Celeste.char.json[/size][/*]\r<br />[/list]\r<br />If you install these files using Mod Organizer, then everything will get placed in the overwrite folder. If you have any problem with the file path, then please let me know. Everything should work perfectly, but if it doesn&#39;t, then manually download and extract the mod somewhere on your desktop, and then place the first two files (the Celeste.slot and Celeste.dds files) in their appropriate folders. After that place the third file (Celeste.char.json) in the following folder.\r<br />\r<br />[list][*][size=2]Documents/My Games/skyrim/JCUser/vMYC/Celeste.char.json[/size][/*]\r<br />[/list]\r<br />The JCUser folder pertains to JContainers, which is required for Familiar Faces to work properly. If your files get moved into the overwrite folder, it won&#39;t mess anything up. If you are bothered by this, you can always open Mod Organizer and manually add the files in your overwrite folder (only add the files that were included in this mod) into your Familiar Faces folder (at least I believe that&#39;s how it&#39;s supposed to be done). As always, if you have any issues then just let me know in the comment section of this mod. If I don&#39;t know the answer to your question, then I&#39;ll stay up all night if I have to until we can get everything figured out and solve the problem together.\r<br />\r<br />Not all of the following mods are required for Celeste to work properly, but I recommended them anyway since I used them in my game when creating her and she won&#39;t look the same without them.\r<br />\r<br />[size=5][center][u][color=#00ffff]Recommended Mods[/color][/u][/center][/size]\r<br />[list][*][size=3][url=http://www.nexusmods.com/skyrim/mods/29624/?]RaceMenu[/url] by expired6976 [color=#ff0000](REQUIRED)[/color][/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/12951/?]Enhanced Character Edit[/url] by ECE team and uploaded by tktk1[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/2356/?]Xenius Character Enhancement[/url] by Xenius [/size][size=2](Highly Recommended)[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/2812/?]Better Females by Bella[/url] by BellaGail[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/13860/?]Joseph Anthony&#39;s Lip Gloss for Better Females[/url] by Joseph Anthony and uploaded by JosefGrey[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/31665/?]Better Makeup for SKSE[/url] by Diethardt\r<br />[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/34346/?]Smile in HD[/url] by zzjay\r<br />[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/24168/?]RaceCompatibility for Skyrim and Dawnguard[/url] by TMPhoenix [color=#ff0000](REQUIRED)[/color]\r<br />[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/35474/?]The Ningheim Race[/url] by Seren4XX [color=#ff0000](REQUIRED)[/color]\r<br />[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/50307/?]True Brows (Ningheim Patch)[/url] by jimtownirish [color=#ff0000](REQUIRED)[/color]\r<br />[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/27783/?]HN66s Long Eye Lashes[/url] by humannature66\r<br />[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/35267/?]SG Female Textures Renewal[/url] by hellosanta [/size][size=2](Highly Recommended)[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/36992/?]SeveNBase a custom FemaleBodyReplacer[/url] by Waste1980 [/size][size=2](This is my favorite body conversion)[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/601/?]Realistic Ragdolls and Force[/url] by dDefinder1[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/26800/?]XP32 Maximum Skeleton -XPMS[/url] by xp32[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/35303/?]Female Facial Animation[/url] by nao4288\r<br />[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/10168/?]ApachiiSkyHair[/url] by Apachii[/size]\r<br />[/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/13457/?]Face Light[/url] by tktk1 [/size][size=2](Highly Recommended)[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/9557/?]Alternate Start - Live Another Life[/url] by Arthmoor[/size][/*]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/54509/?]Familiar Faces[/url] by verteiron [color=#ff0000](REQUIRED FOR THE FAMILIAR FACES PRESET)[/color][/size][/*]\r<br />[/list]\r<br />[size=4][b][i]It isn&#39;t required, but for those of you who are interested, I use [url=http://www.nexusmods.com/skyrim/mods/30936/?]RealVision ENB[/url] by SkyrimTuner. It&#39;s brilliant... absolutely brilliant.\r<br />[/i][/b][/size]\r<br />Again, you don&#39;t [b][i]NEED[/i][/b] all of these mods in order to download and use the character preset, save game or Familiar Faces preset, but without the majority of them, you may notice considerable differences between our characters once you install Celeste. Then again, as long as you have the base requirements for using a Ningheim character to begin with, the only other thing that you really need is textures and you aren&#39;t restricted to using the same ones that I use. In fact, most of the mods that I use are texture replacements that overwrite files already overwritten by other texture replacements, meaning that you may find installing all of the recommended mods a bit of a waste of time. It&#39;s all up to you, and the end result should be what you find attractive or want your own unique version of Celeste to be. The &#34;Highly Recommended&#34; mods will give you more options during character creation though, and I installed the aforementioned mods in the order that I listed them above. I use Mod Organizer, so mods loaded before other mods are overwritten by the most recently installed mods. Also, it should be noted that if you don&#39;t use Face Light, then you&#39;re character won&#39;t look the same as mine when you load the preset, because all of my screenshots were taken using Face Light. It really does make a [b][i]HUGE[/i][/b] difference and I think everyone should use it on all of their characters. It really brings out the beauty in your face and can take a mediocre character and turn them into a masterpiece.\r<br />\r<br />[u][center][color=#00ffff][size=5]FAQ[/size][/color][/center][/u]\r<br />Q: I can&#39;t find the character preset&#33; Where did you hide it?&#33;\r<br />A: Please ensure that you installed the file in the appropriate folder.\r<br />\r<br />Q: My character doesn&#39;t look as good as yours&#33; You have somehow tricked me into thinking that I would be pretty and I&#39;m not&#33;\r<br />A: I use a lot of mods that assist in making my character look the way that she does. I&#39;ve done my best to list those mods in the Recommended Mods section. If you didn&#39;t download those mods, then that&#39;s something you may need to do to achieve the same results as I did.\r<br />\r<br />Q: I think that Celeste is ugly, and I only want to download her so that I can make her prettier and then rub it in your face.\r<br />A: Celeste was created within an hour, and I&#39;m happy with how she looks. If you don&#39;t like her, then either wait for me to release more presets, find a different preset to download from someone else or make your own character. It&#39;s all about what you want your character to look like. Beauty is a subjective thing, and it isn&#39;t my place to decide what you are looking for or what you need.\r<br />\r<br />Q: I just want to download your character so I can punch her in the face. You are stupid and should stop creating mods.\r<br />A: That wasn&#39;t a question, but since you are so caring and thoughtful when speaking to other human beings, I&#39;ll make you a sandwich.\r<br />\r<br />Q: Can you release more presets for me to download?\r<br />A: Of course&#33; I&#39;m not really taking requests right now, but this is a learning experience for me and I enjoy doing it. As soon as I feel that I am ready to release more content, I&#39;ll link to it on this page so you can find it easily&#33;\r<br />\r<br />Q: How come your mod page doesn&#39;t have pretty pictures all over it and doesn&#39;t look like you spent three weeks on it?\r<br />A: Because I don&#39;t have three weeks to spend on it and I&#39;m new to this. It won&#39;t affect the quality of the mod though, I can assure you.\r<br />\r<br />Q: If I am having any problems, can I comment on the mod page and ask for assistance?\r<br />A: Of course you can&#33; In fact, I encourage you to do so&#33; I&#39;m online at least once every day and I&#39;ll do my best to respond to your comment unless someone else has already helped you&#33;\r<br />\r<br />Q: My characters always have shadows all over their face, and this preset is no different&#33; How do I escape the shadows?\r<br />A: It isn&#39;t uncommon to find yourself having issues with shadows. That has nothing to do with this mod. If you want your character to look like mine does, then you should be using Face Light by tktk1 and you should be using it [b][i]RIGHT NOW[/i][/b]&#33; It&#39;s amazing and you should use it on all of your characters.\r<br />\r<br />[center][/center][color=#00ffff][size=5][u][center]Currently In Progress[/center][/u][/size][/color]\r<br />[list][*][size=2]Finish version 1.1[/size][/*]\r<br />[/list][list][*][size=2][s]Release a save game for Celeste.[/s] [b][i]FINISHED&#33;[/i][/b][/size][/*]\r<br />[/list][list][*][size=2][s]Create a version of Celeste to be used with Familiar Faces.[/s] [b][i]FINISHED&#33;[/i][/b][/size][/*]\r<br />[/list][list][*][size=2]Create a version of Celeste that doesn&#39;t require RaceMenu.[/size][/*]\r<br />[*][size=2]Create a version of Celeste that doesn&#39;t require The Ningheim Race.[/size][/*]\r<br />[*][size=2]Turn Celeste into a standalone follower. (See progress below&#33;)[/size][/*]\r<br />[/list][size=2]\r<br />[b][i][color=#00ffff]As of right now, Celeste is on her way to becoming a standalone follower&#33; She already has her own .esp and the next step is to import her custom face and perform some testing to ensure that she is in fact standalone. It wouldn&#39;t make sense to make her a follower without making her a standalone one because I&#39;ve already taken the time to upload her Familiar Faces preset (which makes her a follower that you can customize beyond what a normal follower could be customized). Once everything looks good and she is ready to upload, you&#39;ll be able to find her in the Files tab unless I decide to upload her as a separate file to avoid confusion. In other words, she is almost finished&#33;[/color][/i][/b][/size][center][u][color=#00ffff]\r<br />[size=5]Credits[/size][/color][/u][/center]\r<br />Since this mod is nothing more than a compilation of slider positions within the character creation screen, the uploaded file contains no assets from any other mod. The only thing that I&#39;ve created is a character to use in Skyrim and creating that character wouldn&#39;t have been possible if it weren&#39;t for the awesome people who created the awesome mods that I listed in the Recommended Mods section.\r<br />\r<br />[size=2]Special thanks to expired6976, tktk1, Xenius, BellaGail, JosefGrey, Diethardt, zzjay, TMPhoenix, Seren4XX, jimtownirish, humannature66, hellosanta, Waste1980, dDefinder1, xp32, nao4288, Arthmoor, verteiron, SkyrimTuner and Apachii. You should really take the time to endorse their work if you enjoy what the mod authors have created and allowed us to use. Endorsing only takes a moment and it lets the authors know how much you appreciate their hard work and dedication. Also, I would like to thank Elianora for assisting me with the file paths for the Familiar Faces preset. Without her help, I would have never found one of the files that I needed to include in the mod for it to work&#33; Thank you, Elianora&#33;\r<br />\r<br />Finally, I would like to thank [url=http://www.nexusmods.com/skyrim/users/5711054/?tb=about&pUp=1]LivingDragon[/url] for guiding me through all of this. You&#39;ll always have my back.\r<br />[/size]\r<br />Don&#39;t forget to [b][i]ENDORSE[/i][/b] this mod if you appreciate what I&#39;ve done&#33; It really does motivate mod authors to create more when they see how much their hard work and dedication gets appreciated&#33;",
  "categoryId": "26",
  "version": "1.0",
  "author": "GorG3ousNightMar3",
  "createdUnix": "1416360460",
  "updatedUnix": "1416586716",
  "containsAdultContent": false,
  "uploadedBy": "GorG3ousNightMar3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000135969",
      "name": "Celeste - A Beautiful Ningheim Character Preset",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Celeste - A Beautiful Ningheim Character Preset-60063-1-0.zip",
      "uploadedUnix": "1416356540",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d1ee665a853de57ef78ffdcca4f290a6e4efc12b05b9329fd4d46c59e7e373c5/analysis/1416356642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celeste%20-%20A%20Beautiful%20Ningheim%20Character%20Preset-60063-1-0.zip?fid=1000135969&ttl=1535847595&ri=8192&rs=8192&setec=cfe147000280ad8a8f04587b38119ec3"
    },
    {
      "fileId": "1000136196",
      "name": "Celeste Save Game",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1549",
      "fileName": "Celeste Save Game-60063-1-0.zip",
      "uploadedUnix": "1416531180",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f866eead2ae6beb435ccc2a201d96ccd92191997609dd77e8be89cb67344aa4/analysis/1416531245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celeste%20Save%20Game-60063-1-0.zip?fid=1000136196&ttl=1535847596&ri=8192&rs=8192&setec=dad33704a63c582909f3e375e8f4e7a7"
    },
    {
      "fileId": "1000136245",
      "name": "Celeste Preset for Familiar Faces",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "519",
      "fileName": "Celeste Preset for Familiar Faces-60063-1-0.zip",
      "uploadedUnix": "1416586716",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7519d9ea69ed92335806e93d956245e515ea39460cec98f5c4ae5b4f10b4bdcb/analysis/1416586804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celeste%20Preset%20for%20Familiar%20Faces-60063-1-0.zip?fid=1000136245&ttl=1535847596&ri=8192&rs=8192&setec=84df33da71eb116d424c121e8ea9571e"
    }
  ]
}