{
  "modId": 60123.0,
  "modName": "Dominions More Khajiit",
  "summary": "This mod adds 20 Khajiit across Skyrim, per user request.  The majority are marriage candidates and are spread across the province. No DLC required.  Adds merchants and priests as well as the more traditional NPCs seen in previous More NPC installments.",
  "descriptionHtml": "This mod adds 20 more khajiit to the base Skyrim continent. Each of these khajiit are unique and are spread throughout the province. Below are a list of each of them and where you might find them (since a few of them wander on the roads at times):\n<br />\n<br />Dark Brotherhood:\n<br />\n<br />Jo'rassa - She is a member of the Dark Brotherhood in Dawnstar (can marry)\n<br />\n<br />Omin-Dar Sajgandihr - Member of the Dark Brotherhood in Dawnstar (can marry)\n<br />\n<br />Dragons Bridge:\n<br />\n<br />Zayla Hammustahe - She is a bard at the Inn (can marry)\n<br />\n<br />Khajiit Caravan - Solitude Monday/Tuesday/Wednesday, Whiterun/Windhelm at some point Thursday, and Winterhold Friday/Saturday\n<br />\n<br />Tsarhni - She is a Merchant in the Caravan specializing on spells/ingredients/potions/enchantments\n<br />\n<br />Wadhannar - He is a Merchant in the caravan mostly specialized in arrows, armor, and minerals\n<br />\n<br />Nightgate Inn:\n<br />\n<br />Ja'shavir Kharstavir - He is a Bard at the Inn (can marry).\n<br />\n<br />Riften:\n<br />\n<br />Ahnasari Zahjohin - She is a priest at the Temple of Mara\n<br />\n<br />Ahndrrina - She is a guard in Riften\n<br />\n<br />Anjva Kastavir - She is a member of the Thieves Guild (can marry)\n<br />\n<br />Baaakha Raimanrin - He is a member of the Thieves Guild (can marry)  [Doubles as a bard when you are at an inn]\n<br />\n<br />Shor's Stone:\n<br />\n<br />Do'leena - She is a mercenary for hire hanging around outside (can marry)\n<br />\n<br />Solitude:\n<br />\n<br />Ak'jirr Ahrhirin - He is a member of the Bard's College (can marry)\n<br />\n<br />Baaddumiwa Kihrkpoor - He is a priest at the temple\n<br />\n<br />Kesraym Rawidavi - He is a mercenary for hire (can marry)\n<br />\n<br />Ma'mba Ahrtani - She is a member of the Bard's College (can marry)\n<br />\n<br />Mojidzo - He is a city guard on the Docks [you might find him patroling the palace occasionally]\n<br />\n<br />Whiterun:\n<br />\n<br />Do'amla Sihbari - She is a member of the Companions (can marry)\n<br />\n<br />Dro'shanji - He is a member of the The Companions (can marry)\n<br />\n<br />Winterhold:\n<br />\n<br />Harazami Zahnair - She is a member of the College of Winterhold (can marry)\n<br />\n<br />Kazgh Mahkar - He is a member of the College of Winterhold (can marry)\n<br />\n<br />Special Features: \n<br />\n<br />Unlike the previous More Elves packs, there are priests and merchants in this one. It made sense to add a few merchants in the mix, and they will be open all hours of the day, you just have to find them on their Solitude-Winterhold trade route. The priests will heal your wounds if you are injured, until you are at full health. \n<br />\n<br />Changelog:\n<br />V1:\n<br />-The initial release.\n<br />\n<br />Known Bugs:\n<br />None at this time.\n<br />\n<br />Note:\n<br />Voices will not sound Khajiit.  This is due to a basic Bethesda limitation.\n<br />\n<br />Credits:\n<br />Khajiit name generator - http://fantasynamegenerators.com/khajiit_names.php\n<br />\n<br />Additional Note:\n<br />Sorry this mod (and others still in the pipeline) took so long for release.\n<br />\n<br />\n<br />\n<br />Follow me on Facebook for updates: [url=https://www.facebook.com/ArronDominionProductions/]Arron Dominion Productions[/url]",
  "categoryId": "33",
  "version": "1.0",
  "author": "Arron Dominion",
  "createdUnix": "1416482321",
  "updatedUnix": "1416482301",
  "containsAdultContent": false,
  "uploadedBy": "Arron Dominion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136098",
      "name": "Dominions More Khajiits",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2377",
      "fileName": "Dominions More Khajiits-60123-1-0.zip",
      "uploadedUnix": "1416482301",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ec2c45c70ef63a5e4b61862ac7bfdf54d57df9183a2f963ba37bdc4426a8de98/analysis/1416482409/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dominions%20More%20Khajiits-60123-1-0.zip?fid=1000136098&ttl=1535847687&ri=8192&rs=8192&setec=86021224ac96ea505fced5514b0c0e66"
    }
  ]
}