{
  "modId": 60137.0,
  "modName": "ALPHA zMagicka Spell Crafting and Rituals",
  "summary": "A spell that does nothing at first, but grows as learn more about it. Mostly designed for a quest mod. This is an alpha version and meant for testing. ",
  "descriptionHtml": "This mod adds one spell and a book to your player. The book is a guide to the spell and is included because this is an alpha version. \r<br />\r<br />The spell will do nothing to start with. There are a few ways to get your character to &#39;learn&#39; how to use this spell, but in this version I suggest you just drop the book provided and cast the spell at that book. From there, you can try casting the spell at things and experiment and see what happens. You will need to see something&#39;s name in your cross-hair or the spell will not do anything. Read the book provided for additional guidance. In this version, the effects of the spell include crafting spells, transforming objects, and animating objects and the dead. Many more effects have been made, but these are the ones that are active for testing. Since this is my first, mod I am mostly just interested in making sure that what I have made so far is stable. There may occasionally be some debug notifications in the top left corner. This is because the mod is still being tested.\r<br />\r<br />The installation should be simple, just place the contents into your Skyrim data directory. It requires the expansions (not hearthfire), the latest update and skse.\r<br />\r<br /> ",
  "categoryId": "75",
  "version": "0.0",
  "author": "VincentEttrich",
  "createdUnix": "1416526588",
  "updatedUnix": "1416526560",
  "containsAdultContent": false,
  "uploadedBy": "VincentEttrich",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136178",
      "name": "zMagicka",
      "version": "0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "134",
      "fileName": "zMagicka-60137-0-0.7z",
      "uploadedUnix": "1416526560",
      "modVersion": "0.0",
      "virusScanUrl": "https://www.virustotal.com/file/3a51e08ba55dcc407a25c1008eabf67c8aeaf8f9bc5fb24f4015aa3d71d82cd5/analysis/1416526622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/zMagicka-60137-0-0.7z?fid=1000136178&ttl=1535847739&ri=8192&rs=8192&setec=e47c0b8781a14fbb25803380ead938b3"
    }
  ]
}