{
  "modId": 60159.0,
  "modName": "Hyper Reaper with Conjurable Reaper",
  "summary": "",
  "descriptionHtml": "[left][/left]--&gt;I&#39;m indonesian, so sorry for any grammatical errors and such &#39;cause english isn&#39;t my native language ;)&lt;--\r<br />\r<br />When i heard there is secret boss &#39;Reaper&#39; in the DAWNGUARD DLC, i just like &#34;Wow&#33; this should be truly challenging fight, interesting&#33;.&#34; A badass &#39;Reaper&#39; Boss fighting the Last Dragonborn in the Soul Cairn. Then took me forever to collect 3 shards and guess what? this &#39;Reaper&#39; battle is a real letdown. Such a shame though i look forward to fight this boss and he is easy to kill. Since there are no other mods to make him more deadly (or at least better) that&#39;s why this mod come out for those who love challenge in Skyrim. (need DAWNGUARD DLC or else this mod is useless)\r<br />\r<br />This mod aims to change DAWNGUARD &#34;unchallenging secret boss&#34; to &#34;challenging superboss&#34; with some rewards. I mean really &#34;SUPERBOSS&#34; (even stronger than karstaag from DRAGONBORN DLC on its max level) and for you who still at low level, get ready to get pawned easily. Change are described as below :\r<br />\r<br />- Changing &#39;Reaper&#39; name to &#39;Soul Reaper&#39; (i feel &#39;Reaper&#39; name is missing something so i add &#39;Soul&#39; on it &#39;cause it&#39;s from the Soul Cairn)\r<br />- Change Voice Type from &#34;crSkeletonVoice&#34; to &#34;crDraugrVoice&#34; (at least he can talk now rather than some random skeleton/bone voice)\r<br />- Changing combat behavior. For some reason, it seems DAWNGUARD &#39;Reaper&#39; NEVER physically attack with it&#39;s weapon/melee. Instead, only spitting some green poison and other than that only move around and DOING NOTHING except spitting poison.\r<br />- His &#39;Iron Battleaxe&#39; now changed to &#39;Reaper Battleaxe&#39; with 35% chance to stagger enemies upon contact (so be careful. . .)\r<br />\r<br />Soul Reaper Stats\r<br />Level   : 50 - 150 (scale to player at 1.5, so if your level 50, the he&#39;s 75 and so. . . with min level of 50 and max level of 150)\r<br />HP          : 1559 - 2659 (depends on the level)      \r<br />Magicka  : 100 (not really used)\r<br />Stamina   : 276 - 676\r<br />\r<br />Ability :\r<br />- Auto-Conjure Boneman : First time you hit him, he automatically summon 3 random leveled Boneman to aid him at combat until the time run out or killed.\r<br />- Auto-Firestorm             : Most Dangerous Skill he has, when you hit him, has a chance to cast Firestorm Spell to damage nearby enemies and staggers them. BEWARE, if you play by always keep attacking the Soul Reaper non-stop, mostly the Firestorm will cast twice even thrice and eventually killing you instantly.\r<br />- Auto-Invisible/Ethereal  : This skill always automatically active at the same time following the Firestorm when cast, so when Firestorm is cast, damaging any nearby, he becomes INVISIBLE and INVULNERABLE against any attack and damage (like Become Ethereal Shout). The best way is to run around area, or kill some time by killing Boneman. This effect disappear if Soul Reaper is attacking or blocking.\r<br />- Conjure Boneman Shout : When he run out of ally, he will summon 3 or 5 Boneman to aid him at combat (plus with Auto-Conjure Boneman and Spawned Boneman at Reaper&#39;s Lair, believe me, there would be a lot of random leveled Boneman)\r<br />- Soul Frost Breath Shout : No different with vanilla Frost Breath Shout except has a 50% chance to paralyze and freeze you up to 5 seconds.\r<br />- Soul Storm Call Shout    : Same as vanilla Storm Call Shout, since the battle is indoor, not really used and only used at open land. Then why i add it? Well only usable when YOU summoned him outside (see Loot)\r<br />\r<br />Perks (only 1 perk) :\r<br />- Reaper Multiple Summon : Allow Soul Reaper to conjure minions of Boneman up to 15 creature (That&#39;s a lot considering not counting the Boneman that spawn at Reaper&#39;s Lair)\r<br />\r<br />Loot :\r<br />Rather than normal loot such as Daedra Heart and Black Soul Gem, i increase the reward a bit by putting &#34;Spell Tome: Conjure Death Master&#34; on it. So for all of you who defeat him, will be granted his power.\r<br />\r<br />Tips :\r<br />Well no tips really . . . other than SAVE YOUR LIFE THIS GUY IS STRONG&#33;&#33;&#33; haha just kidding. Well before battle, i RECOMMEND you to SAVE and prepare A LOT of healing potion &#39;cause this battle is hard. And also DO NOT button mashing by keep attacking him non-stop &#39;cause his Auto-Firestorm is really hell of annoying and can kill you instantly before you notice, so play safe.\r<br />\r<br />Installation :\r<br />Use NMM or copy the Reaper.esp file to your Skyrim/Data\r<br />\r<br />Bug/Glitch/Crash :\r<br />With a lot of mods i am using, not so far as long as there are no other mods that modify DLC1SoulCairnReaper and it&#39;s content\r<br />\r<br />Closing :\r<br />You can beat this guy?&#33; Well Done for beating the Soul Cairn Master of Death, The Soul Reaper. You have my thanks for using my first mod.\r<br />\r<br />Thanks :\r<br />Thanks to Bethesda for this great games and the Creation Kit. Without them, this mod would never exist in the first place.",
  "categoryId": "24",
  "version": "",
  "author": "ladamanegra",
  "createdUnix": "1416603496",
  "updatedUnix": "1416603293",
  "containsAdultContent": false,
  "uploadedBy": "ladamanegra",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136271",
      "name": "HyperReaper",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "HyperReaper-60159-1.rar",
      "uploadedUnix": "1416603293",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1a8cdf44876c91dd8363ea24ef586be0dbe3fa071e4fb059aee67178c4bc961b/analysis/1416603366/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HyperReaper-60159-1.rar?fid=1000136271&ttl=1535847776&ri=8192&rs=8192&setec=77a9ecea545eb21e785bd1bba0aef217"
    }
  ]
}