{
  "modId": 60172.0,
  "modName": "Psijiic Greycloaks",
  "summary": "Clothe your monastic elves in the finery of the Grey Maybe",
  "descriptionHtml": "Psijiic Greycloaks, a mod by Kohdi\r<br />\r<br />-Description-\r<br />It&#39;s established lore that members of the Psijiic order have dressed in distinctive &#34;greycloaks&#34; for hundreds of years, at least since the time of Queen Potema. Why, then, have they suddenly decided to dishonor that tradition with a dingy yellow? This simple mod fixes that, making the yellow cloth more appropriately grey. That&#39;s it. The robes still retain their stats, their normally-unplayable status, and their mysterious spatters of mud. This is only a retexture. No .esp is included or needed. I don&#39;t plan to do anything else with this mod, I just made it today because I felt like it, so please do enjoy&#33;\r<br />\r<br />-Compatibility-\r<br />Incompatible with other Psijiic robe retextures. Aside from that feel free to do your freaky thing.\r<br />\r<br />-Installation-\r<br />1. Drag the Textures folder into your Data folder (overwrite if necessary)\r<br />2. You now have grey Psijiic robes\r<br />3. Taadaa\r<br />\r<br />-Uninstallation-\r<br />1. Remove the files you dragged into Textures\r<br />2. Convince yourself that you know better than someone crazy enough to make this mod\r<br />3. Realize your mistake and reinstall the mod\r<br />\r<br />-F.A.Q.-\r<br />Q: What resolution are the textures? 4K with parallax I assume?\r<br />A: 2048x, sourced from the high resolution patch. No I won&#39;t downgrade them. They&#39;re visible during one single questline in the game, treat yourself.\r<br />\r<br />Q: Any requirements?\r<br />A: Only your charming smile, you devil, you.\r<br />\r<br />Q: Male only?\r<br />A: I retextured the female version too. No, no, hold your applause.\r<br />\r<br />Q: The robes still shine like sunsets and old banana peels&#33;\r<br />A: Make sure you extracted everything properly, it&#39;s an easy mistake to make. Also make sure you overwrite when prompted.\r<br />\r<br />Q: I don&#39;t like the change, and I didn&#39;t make backups&#33;\r<br />A: Oops. Just delete the files I gave you, things should go right back to normal.\r<br />\r<br />Q: Fashion is the choice of the wearer and you shouldn&#39;t judge them for it (unless their robes are covered in pictures of fantasy babes)\r<br />A: I think you&#39;ll find a more receptive audience elsewhere.\r<br />\r<br />-Credits-\r<br />Texture recoloring by myself\r<br />All other work by Bethesda\r<br />\r<br />-Contact-\r<br />Leave a comment or send me a PM, I&#39;ll try to respond in a timely fashion.",
  "categoryId": "60",
  "version": "1.0",
  "author": "Kohdi",
  "createdUnix": "1416642271",
  "updatedUnix": "1416641793",
  "containsAdultContent": false,
  "uploadedBy": "Kohdi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136315",
      "name": "Psijiic Greycloaks",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3410",
      "fileName": "Psijiic Greycloaks-60172-1-0.rar",
      "uploadedUnix": "1416641793",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c777351b2a4f4a38105dc41d5dd3522509c32c4a0126767c7014b918ac90ed36/analysis/1416641887/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Psijiic%20Greycloaks-60172-1-0.rar?fid=1000136315&ttl=1535847790&ri=8192&rs=8192&setec=4263af1cdd749e11090f69ff8d6a6d95"
    }
  ]
}