{
  "modId": 60188.0,
  "modName": "The Ultimate Modded Skyrim",
  "summary": "This is a tutorial made to assist in turning a vanilla Skyrim into a personalized, custom-tailored experience full of useful utilities, amazing mods, tweaked INI files and an stable, well-organized load order and folder structure.",
  "descriptionHtml": "This section of the mod page is under heavy construction at the moment.\r<br />\r<br />[b][i][u][size=6][center][font=Georgia]The Ultimate Modded Skyrim[/font][/center][/size][/u][/i][/b]\r<br />If you have ever found yourself frustrated beyond belief at a broken, unorganized, unstable, ugly or disastrous mess that you don&#39;t even consider worthy of calling Skyrim, then you have come to the right place. The Ultimate Modded Skyrim is a guide/tutorial for turning your Skyrim into something worth showing off to your friends and loved ones. It covers everything that you need to know about modding your personal copy of Skyrim and turning it into everything that you ever wanted it to be. There are a lot of ways to customize your game and improve its efficiency, but not all of those ways are stable, truly efficient or should be performed by everyone. This guide will assist in eradicating every problem that you have with your game and hold your hand while you create a beautiful world for your own, personal enjoyment.\r<br />\r<br />Together, we will journey into the world of modding and examine both the basics and some of the intricate details behind what keeps Skyrim running smoothly . You will be carried over the dangerous waters, shielded from the stray arrows that seem determined to render your knees unusable, gently placed upon a bed of roses on the other side and lightly rocked until you fall asleep surrounded by your accomplishments and the beauty that you have infused into your game. You can kiss those long nights of troubleshooting your own mistakes goodbye, because your game will be the highlight of the party after we arrive at our destination and the ultimate Skyrim experience is yours to enjoy. Welcome to the future of Skyrim, adventurer. We&#39;ve been expecting you.\r<br />\r<br />[list][*][size=2]Introduction[/size][/*]\r<br />[*][size=2]Your First Steps[/size][/*]\r<br />[*][size=2]Your End-Game[/size][/*]\r<br />[*][size=2]Your Game Environment[/size][/*]\r<br />[*][size=2]Body Conversions, Skeletons and Animations[/size][/*]\r<br />[*][size=2]Utilities, Interfaces and Game Mechanics[/size][/*]\r<br />[*][size=2]Weapons, Clothing and Armour[/size][/*]\r<br />[/list][size=2]\r<br />\r<br />[/size][center][b][i][u][size=6][b][i][u][size=6][font=Georgia]Introduction[/font][/size][/u][/i][/b][/size][/u][/i][/b][/center][size=2][center][/center]\r<br />\r<br />Modding -in general- is all about learning the boundaries in which you have no choice but to operate, learning the limits which you are capable of pushing and then pushing those limits without exceeding the boundaries in which you are bound. First, we will establish some of the boundaries and note that only some of Skyrim&#39;s boundaries have been discovered. It is because of the latter that we will focus on establishing some of the boundaries that we know to exist and decide which boundaries we would like to test the limits of.\r<br />\r<br />\r<br />[/size][b][i][u][size=6][b][i][u][size=6][font=Georgia][center]Your First Steps[/center][/font][/size][/u][/i][/b][/size][/u][/i][/b]\r<br />In order to blah blah blah...\r<br />\r<br />\r<br />[b][i][u][center][font=Georgia][size=6]Your End-Game\r<br />\r<br />[/size][/font][/center][/u][/i][/b]There are many different reasons for why someone would want to mod their Skyrim game. We can&#39;t presume to understand what everyone is looking for, but I think it&#39;s safe to say that most of us started modding Skyrim because there was something that we wanted in our game that we didn&#39;t have. That&#39;s what drives us to continue adding mods, pushing our computers to their limits and keeping us awake at night. It&#39;s important to decide for yourself what it is that you are looking for. That&#39;s why you need to keep the most important thing about modding Skyrim in mind at all times... we all need an end-game.\r<br />\r<br />Your end-game might be that you want your Skyrim to look prettier and more realistic than everyone else&#39;s Skyrim. If that&#39;s the case, you may be what we call a &#34;Screen Archer.&#34; Perhaps you aren&#39;t as concerned with your graphics as you are with having a lot of pretty girls in your Skyrim. That&#39;s a common reason why people start modding their Skyrim and can&#39;t seem to stop. Maybe you couldn&#39;t care less about pretty girls or the most luscious visuals you can imagine, and maybe you only started modding Skyrim because you wanted new weapons, armor, quests and more incentive to create a new character and defeat Alduin for the thirteenth time. These are all great reasons to mod Skyrim.\r<br />\r<br />Once your first steps have been taken and your game is ready to be modded, you need to decide what your end-game is so we can build everything around that. This guide is called The Ultimate Modded Skyrim because it serves a very unique purpose. By the time we are done here, you should have a Skyrim that is unique and screams your name. This is where we will decide what it is that we are looking for and establish how we are going to go about all of this. We want to have our end-game figured out from the very beginning and keep it at the forefront of our minds during the whole process. Just because a mod is simple to install doesn&#39;t mean that we have to have it, and just because a mod is a bit more complicated to install doesn&#39;t mean that we should avoid it.\r<br />\r<br />We want to keep our load order as clean as possible and that means that we want to install mods in the appropriate place and maintain some kind of system to determine where a mod should be placed and in what order it should be installed. I prefer to install mods that I know will persist beyond a single profile together and before mods that may or may not be used in every profile or with every character that I play as. For example, if you have ten different characters that you play as and all of those characters use the same body conversion but don&#39;t require the same armors to be installed, then your armor mods should all be installed together and after your preferred body conversion. By maintaining structure like this, you reduce the possibility of not being able to find an armor in your load order and bloating your future saves by allowing armors that you no longer require to remain in saves that don&#39;t utilize them.\r<br />\r<br />\r<br />[b][i][u][center][font=Georgia][size=6]Your Game Environment[/size][/font][/center][/u][/i][/b]\r<br />Blah blah blah...\r<br />\r<br />[b][i][u][center][font=Georgia][size=6]Body Conversions, Skeletons and Animations[/size][/font][/center][/u][/i][/b]\r<br />Blah blah blah...\r<br />\r<br />[b][i][u][center][font=Georgia][size=6]Utilities, Interfaces and Game Mechanics[/size][/font][/center][/u][/i][/b]\r<br />Blah blah blah...\r<br />\r<br />[b][i][u][center][font=Georgia][size=6]Weapons, Clothing and Armour[/size][/font][/center][/u][/i][/b]\r<br />Blah blah blah...",
  "categoryId": "82",
  "version": "1.0",
  "author": "LivingDragon",
  "createdUnix": "1416687594",
  "updatedUnix": "1416687594",
  "containsAdultContent": false,
  "uploadedBy": "LivingDragon",
  "primaryFile": null,
  "files": []
}