{
  "modId": 60198.0,
  "modName": "Archery Overhaul - BETA",
  "summary": "A mod that aims to enhance the archery experience in Skyrim by adding new variants of all the vanilla bows and by adding some new unique bows.",
  "descriptionHtml": "[b]\r<br />\r<br />[center][/center]\r<br />[center][size=5]ARCHERY OVERHAUL - BETA[/size][/center]\r<br />\r<br />\r<br />\r<br />Description:[/b]\r<br />This mod currently adds 3 variants of every vanilla, base, bow in Skyrim. Every bow now has  a light, heavy, and war version. The light version does less damage but shoots quicker than the base bow, the heavy version does more damage but shoots slower than the base bow, and the war version of course does even more damage and shoots even slower. Each variant is craftable and upgradable as well&#33; I&#39;ve also made some of the unpopular bows, like the falmer or forsworn one, craftable. Oh and ive tweaked some of the bows stats. [b]There is a chest with all the bows and their variants to the right of the southern entrance of Riverwood up against the wall. \r<br />[/b]\r<br />[b]Things I plan to do:[/b]\r<br />Well this is gonna be alot. Ive currently only spent about 10 hours on this mod and I intend to spend MUCH more time, which is why this is just a beta. But anyway:\r<br />-Add a &#34;God Bow&#34; that does a ton of damage but shoots extremely slowly\r<br />-Add other unique bows that do special things like shoot super quick or something\r<br />-Create a quest associated with this &#34;God Bow&#34;\r<br />-Make the light versions weigh less\r<br />-Make heavy and war versions weigh more\r<br />-Might light and war versions worth more money\r<br />-Add archery related enchants that can edit the speed of the bow\r<br />-Possibly try and create a &#34;build you own bow&#34; type thing where you can create a bow in game and edit its speed and damage and such\r<br />-Possibly make bow making table where you can craft bows at and make a skill tree associated with that\r<br />-Make an add on for all DLC bows\r<br />-Make an add on for some modded bows\r<br />-Create my own custom bows with unique models and textures\r<br />-Stuff you guys tell me to do &lt;3\r<br />\r<br />[b]Why is this a beta?[/b]\r<br />I&#39;m releasing this as a beta before I have completed everything because I want people to start using the bows and reporting on how they are balanced so I can fix it. So instance: people may think the war bows are too overpowered. Now I ill be able to fix it for the final version\r<br />\r<br />[b]Other Info:[/b]\r<br />This is my second mod so please forgive me for any mistakes&#33; Also, please contact me with any suggestions with the mod and ill make sure to implement them&#33; My youtube channel has information on the mod and other fun Skyrim stuff&#33; Check it out: https://www.youtube.com/user/GingaNinja12398",
  "categoryId": "55",
  "version": ".1",
  "author": "GingaNinja23",
  "createdUnix": "1416721360",
  "updatedUnix": "1416721108",
  "containsAdultContent": false,
  "uploadedBy": "GingaNinja23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136415",
      "name": "Archery Overhaul",
      "version": ".1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Archery Overhaul-60198--1.zip",
      "uploadedUnix": "1416721108",
      "modVersion": ".1",
      "virusScanUrl": "https://www.virustotal.com/file/6b0474a89cd5275ff270d633fe1937048dbbffa06784933bbb1a16ba1ae7a744/analysis/1416721202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Archery%20Overhaul-60198--1.zip?fid=1000136415&ttl=1535847823&ri=8192&rs=8192&setec=9e60a70741384822801c244d94b95e05"
    }
  ]
}