{
  "modId": 60199.0,
  "modName": "Imperial Outposts",
  "summary": "Being the Empire supporter I am I decided to make some checkpoints for the Imperial soldiers that add a more realistic feel to winning the Civil War (For the Empire) and hope to convert some positions or make new ones, only 2 have been converted so far.",
  "descriptionHtml": "- The only conversion I made was to Northwatch Keep, where I changed it into an Imperial Fort.  Only the EXTERIOR has been changed and I plan to redo the interior if people want it.  I will also update this if people want more things or if I find the need to.\r<br />\r<br />-CHANGES: For now, the only changes I have made was that I switched the hay piles and beds to bedrolls, the makeshift shelters to imperial tents (which have the bedrolls), added some lighting with multiple fire lamps, installed Imperial flags, and reinforced the locations with wooden stockades and hope to add more fortifications in later updates.\r<br />\r<br />- WARNING: MAKE SURE YOU COMPLETE THE QUEST MISSING IN ACTION BY SAVING THORALD BEFORE INSTALLING THIS, I CAN&#39;T EVEN IMAGINE THE PROBLEMS THAT WOULD ARISE\r<br />\r<br />-This is the first mod I&#39;ve ever made and if this becomes successful I will expand on this idea to more locations and hopefully add more Imperial immersion to the game, Thanks&#33;\r<br />\r<br />",
  "categoryId": "78",
  "version": "1.0",
  "author": "Mystogan",
  "createdUnix": "1416723044",
  "updatedUnix": "1416722832",
  "containsAdultContent": false,
  "uploadedBy": "Antiablo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136418",
      "name": "Imperial Outposts- Northwatch Keep",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Imperial Outposts- Northwatch Keep-60199-1-0.rar",
      "uploadedUnix": "1416722832",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6717db4d2eb3a4ff57463a4211c1fb2c83c25541eee0df00fcb92a71e511e914/analysis/1416722942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Outposts-%20Northwatch%20Keep-60199-1-0.rar?fid=1000136418&ttl=1535847824&ri=8192&rs=8192&setec=eb62df80d21437eae15813e0b02407a0"
    }
  ]
}