{
  "modId": 60258.0,
  "modName": "Inuyasha Weapons - Revamp",
  "summary": "A much better version of my inuyasha weapons mod&#33;",
  "descriptionHtml": "[url=https://www.facebook.com/SaintGrimmOfficial]Saint Grimm Productions Facebook Page[/url]\r<br />\r<br />\r<br />\r<br />\r<br />This is a revamp of my inuyasha weapons mod. If you have that and want this you must first COMPLETELY uninstall the old one&#33;&#33;\r<br />\r<br />Requirements: Dragonborn\r<br />\r<br />Features:\r<br />\r<br />All of the weapons from my original mod with new models for banryu and tokijin so they better resemble how they looked in the anime.\r<br />\r<br />All of the swords now also have unique power attacks&#33;&#33;\r<br />\r<br />Tessaiga - \r<br />All power attacks: Windscar\r<br />\r<br />Red Tessaiga -\r<br />All power attacks: Red windscar\r<br />\r<br />Dragon-Scale Tessaiga -\r<br />All power attacks: Windscar\r<br />\r<br />Diamond Tessaiga -\r<br />All power attacks: Diamond Spear Burst (Adamant Barrage)\r<br />\r<br />Black Tessaiga -\r<br />All Power Attacks: Meido Badle that will turn enemies to ashes if the attack kills them\r<br />\r<br />Tenseiga: \r<br />All Power Attacks: Massive healing beam\r<br />\r<br />Bakusaiga: \r<br />All Power Attacks: Beam that poisons target and does 10 damage per second until they die, no matter how much HP they have&#33;\r<br />\r<br />Banryu: \r<br />Standing Power attack: Lightning Storm (this spell continues to fire until another power attack is used)\r<br />All other power attacks: Shoots a fireball (sometimes multiple fireballs, not sure why lol)\r<br />\r<br />So&#39;unga -\r<br />Standing/Forward/Backward Power attacks: Shoots a purple ball of energy that expands on impact and sucks enemies into it causing massive damage (for some reason, it only effects hostile npcs, non-hostile NPCs can walk right through the attack unharmed)\r<br />Left/Right Power attacks: Summons Dremora Lord\r<br />\r<br />Tokijin -\r<br />All Power attacks: fires a red lightning bolt\r<br />\r<br />Sesshomaru&#39;s Poison Whip - Causes poison damage for a short amount of time\r<br />\r<br />Spell: Toxic Luster Claw (Spray) - I tried to make a toggle ability that would cause Sesshomaru&#39;s unarmed attacks to cause poison damage, but failed. So instead, you get a magic spell that sprays green liquid and causes poison damage&#33;\r<br />\r<br />I&#39;ve also modeled some armors. I couldn&#39;t get the UV maps to unwrap correctly and thus the textures are pretty crappy. If anyone would like to help with this, let me know&#33; These armors are my first ever armor models, so don&#39;t expect TOO much greatness at all.\r<br />\r<br />Sesshomaru&#39;s gear -\r<br />Sesshomaru&#39;s Kimono\r<br />Sesshomaru&#39;s Armor\r<br />Sesshomaru&#39;s Boots\r<br />Lord Fluff Fluff (the fluffy thing he wears around his shoulder)\r<br />\r<br />Inuyasha&#39;s gear -\r<br />Inuyasha&#39;s Kimono\r<br />\r<br />I&#39;ve also created TWO races&#33; They seem to be perfectly compatible with alternate start - live another life, but I have not done much testing. Inuysha&#39;s hair had some issues during my final testing, the weight paint is slightly messed up and the hair doesn&#39;t move exactly as it should. So for now, he has the same hair as Sesshomaru (don&#39;t worry, he still has dog ears&#33;)\r<br />\r<br />The body textures are slightly off, if you run around naked, there ARE seams. And if you wear helmets, you might be bald, and either way, will most likely have some graphical issues with the backs of the head clipping the helmet (during my testing this may have been caused by showracemenu and the iron helmet expecting the nord head mesh, not sure).\r<br />\r<br />Inu Daiyokai, the Sesshomaru race, is 100% immune to poison and disease. I&#39;m not sure how this will effect vampirism/werewolf, I haven&#39;t tested it, but I will assume he is fully immune to both of those. He takes less damage from ALL attacks, magic, melee AND ranged attacks. He also has boosted unarmed damage (higher than khajiit). Inu Hanyo race, Inuyasha, has the all of the above EXCEPT the poison/disease resistance. Both races have clawed finger-nails.\r<br />\r<br />\r<br />Obtaining the Items:\r<br />Sesshomaru&#39;s Toxic Luster Claw is a spell that&#39;s unique to his race\r<br />However, every other item can be obtained by opening the console (hit the ` key, right under esc) and type in &#34;coc 00testingcell&#34; without the &#34;&#34; and you will find a chest containing all of the items&#33;\r<br />\r<br />Enjoy&#33;",
  "categoryId": "55",
  "version": "1.0",
  "author": "Saint Grimm Productions",
  "createdUnix": "1416942098",
  "updatedUnix": "1416904638",
  "containsAdultContent": false,
  "uploadedBy": "saintgrimm92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136678",
      "name": "Everything you need",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32756",
      "fileName": "Everything you need-60258-1-0.rar",
      "uploadedUnix": "1416904638",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fdf69e39b6704fec99a716a3f41ca243667440c4aedc63265f2c4b4d939947ac/analysis/1416904750/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Everything%20you%20need-60258-1-0.rar?fid=1000136678&ttl=1535847944&ri=8192&rs=8192&setec=811bb79e87a6715a38b55abeb318c0b7"
    }
  ]
}