{
  "modId": 60251.0,
  "modName": "Godly Items from Sparkey96 Steam profile",
  "summary": "This is a simple mod that adds a few ridiculously over powered weapons/potions/armor to a few places in the world. \r<br />&lt;br /&gt;&lt;br /&gt;If there are any ideas you have or items you would like to see added leave a comment&#33;",
  "descriptionHtml": "[font=Arial, Helvetica, Verdana, sans-serif][color=#acb2b8]This is a simple mod that adds a few ridiculously over powered weapons/potions/armor to a few places in the world. [/color][/font]\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;A mace can be found when going through the Helgen Keep while escaping in the beginning. \r<br />&lt;br /&gt;&lt;br /&gt;An axe and shock spell are lying on the floor in front of the fireplace in the Riverwood trader, there is another axe in the Bannered Mare, along with another copy of the shock spell tome \r<br />&lt;br /&gt;&lt;br /&gt;A super bow w/ arrows, a few various super potions and heavily enchanted mage robes in the hall of the elements. \r<br />&lt;br /&gt;&lt;br /&gt;There are now a few more items added. By the blacksmith in solitude, The dead bandit in Bleakfalls barrow and the Jarl&#39;s house in Dawnstar \r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;Added chest for alchemy, enchanting and smithing. Alchemy chest in Arcadia&#39;s Cauldron, smithing chest next to Adrianne in Whiterun and soul gem chest in the Hall of Countenance in the College of Winterhold. \r<br />&lt;br /&gt;&lt;br /&gt;All of these can now also be found in QASmoke area. If you have my mod &#34;Dungeon of Fun&#34;, there is a door that will lead there unless you would rather use the COC console command. \r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;NEW: Dark Brotherhood armor, two variants of power. First one found withing Dark Brotherhood Sanctuary on a table. Other inside the Dawnstar Sanctuary near the master bedroom I guess you could call it. \r<br />&lt;br /&gt;&lt;br /&gt;Godly steel dagger near the Talos Shrine in Markarth \r<br />&lt;br /&gt;&lt;br /&gt;Better Dragon Priests daggers in Bleakfalls barrow near dead bandit and in Sinderion&#39;s lab/workshop (Can&#39;t remember) in Blackreach. \r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;If there are any ideas you have or items you would like to see added leave a comment&#33;",
  "categoryId": "40",
  "version": "1.03",
  "author": "MastaJ96",
  "createdUnix": "1416888480",
  "updatedUnix": "1416888480",
  "containsAdultContent": false,
  "uploadedBy": "MastaJ96",
  "primaryFile": null,
  "files": []
}