{
  "modId": 60281.0,
  "modName": "Puffs Dawnguard Vampire - Kindred Judgment",
  "summary": "Modifies Isran&#39;s dialogue so that the player can complete the Kindred Judgment quest as a vampire.",
  "descriptionHtml": "*********************************************************************************\r<br />* Dawnguard Vampire - Kindred Judgment by Puff The Magic Dragon *\r<br />*********************************************************************************\r<br />===========\r<br />Description:\r<br />===========\r<br />During the Dawnguard quest line, if you approach Isran as a vampire, he will refuse to speak with you. This means that the Dawnguard quest line can not be completed without getting cured. This mod adds an extra condition to Isran&#39;s dialogue, so that if the Kindred Judgment quest is begun then Isran will speak to the player and continue the storyline, allowing you to finish the Dawnguard quest line without curing your vampirism.\r<br />\r<br />What this mod does *not* do is allow the player to start and complete the Dawnguard side of the DLC quest line as a vampire. \r<br />\r<br />============\r<br />More Details:\r<br />============\r<br />***SPOILERS***\r<br />This is intended primarily for players who play the Dawnguard side of the Dawnguard DLC quest, and who choose to become a vampire in order to enter the Soul Cairn. After the Soul Cairn, the rest of the quests can be completed as a vampire without difficulty, until you reach Kindred Judgment and it&#39;s time to rally support from the Dawnguard. Isran refuses to open a dialogue with a vapmiric player.\r<br />\r<br />This mod adds an extra condition to Isran&#39;s two &#34;the player is a vampire&#34; responses, so that if the Kindred Judgment quest has begun, Isran will open the dialogue with the player. Specifically: &#34;GetStage DLC1VQ08 &lt; 20&#34;.\r<br />\r<br />I consider this quasi-lore friendly. If I had the time, inclination, skills, and a voice actor who sounded like Isran, I would add dialogue to explain Isran&#39;s change of heart. (i.e. &#34;You got the bow&#33; Then even as a vampire, you must be on our side&#33;&#34; or something like that.)\r<br />\r<br />============\r<br />Installation\r<br />============\r<br />Recommended NMM:\r<br />Click and run&#33;\r<br />\r<br />Manual:\r<br />Extract the file directly into your &#92;Data folder.\r<br />\r<br />=============\r<br />Compatibility\r<br />=============\r<br />Since this mod directly edits Isran&#39;s existing dialogue, it may be incompatible with other mods that modify Isran&#39;s dialogue or Isran at all. However, I anticipate that it will have no conflicts.\r<br />\r<br />===============\r<br />Version History\r<br />===============\r<br />Version 1.0 - Isran&#39;s not as big of a racist as we thought he was&#33;\r<br />\r<br />===============\r<br />Credits goes to:\r<br />===============\r<br />All the users on the TES forums who helped me figure out some of this junk, the CS Wiki for all the tutorials and reference, the users who update and contribute to the wiki, for Blender and all the users who&#39;ve written wonderful tutorials for it, and for NifTools and the NifTools team and all the hard work they put into making such wonderful tools available. I know I didn&#39;t use half these tools for this mod, but they still get credit cause they&#39;re awesome.\r<br />And many thanks to Bethesda for making such an awesome game and for making the construction set that lets people like me with way too much free time modify the game.\r<br />Thanks to God for creating us all&#33;",
  "categoryId": "35",
  "version": "1",
  "author": "Puff",
  "createdUnix": "1417075254",
  "updatedUnix": "1416981562",
  "containsAdultContent": false,
  "uploadedBy": "pufthemajicdragon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136804",
      "name": "Puffs Dawnguard Vampire",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Puffs Dawnguard Vampire-60281-1.zip",
      "uploadedUnix": "1416981562",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b3c2dd9ecb91d401096ea1db16c1b4c42e5da5747dfbb5d02222f3d3aa364364/analysis/1416981662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Puffs%20Dawnguard%20Vampire-60281-1.zip?fid=1000136804&ttl=1535847983&ri=8192&rs=8192&setec=2a6afe2f7cfa3a045f8af3b3ea493857"
    }
  ]
}