{
  "modId": 60294.0,
  "modName": "Guild Amulets",
  "summary": "Combines enchantments of guild armors into a necklace to allow for stand alone armor use.",
  "descriptionHtml": "Introduction:\r<br />Ever want to wear standalone armors yet feel conflicted about wanting the bonuses from your guild\r<br />armor? Faction Amulets seeks to rectify this by giving you all the stats of\r<br />faction armors and putting them into a single enchantment on a piece of jewelry.\r<br />Your faction affinity will be also be preserved&#33; This mod is intended to save\r<br />you from having to enchant your armor. Using this mod and enchanted armor is\r<br />extremely overpowered, but each to their own.\r<br />\r<br />Factions Covered:\r<br />Mages College\r<br />Companions\r<br />Thieves Guild\r<br />Nightingales\r<br />Dark Brotherhood\r<br />Cicero\r<br />\r<br />Methodology:\r<br />The first tier amulet represents the armor that you could expect to get from joining an organization.\r<br />The second tier represents the rewards befitting the completion of a guild quest\r<br />line. And the third represents the apex suitable for end game content.\r<br />I used the ancient dark brotherhood armor, upgraded thieves armor, and max leveled nightingale to get\r<br />an idea for potency of the tiers. I took the combined stats and made a single enchantment.\r<br />The creation kit was kind enough to weight the value of all the pieces to give\r<br />a sense of how powerful the enchantment was. I then added an appropriate bonus\r<br />enchantment(s) to represent the amulet that would otherwise be worn.\r<br />\r<br />Tier One: 2500-3500\r<br />Tier Two: 4000-6000\r<br />Tier Three: 7500-8000\r<br />\r<br />So the tier one nightingale amulet includes all of the enchants of the level 37+ enchantments, dark\r<br />brotherhood back stab, and fortify marksmanship 25. The other two tiers have\r<br />essentially the same stats just scaled up. \r<br />\r<br />Lastly, a lot of the value on these items may not affect your character play style at all. But rather than\r<br />make a million different amulets I just made a few that cover pretty much\r<br />everything and let you have the flexibility to benefit from what you use and\r<br />ignore the stats you don&#39;t bother with.\r<br />\r<br />For example:\r<br />I assume that if you’re a companion you&#39;ll use either heavy or light armor exclusively, that you&#39;ll use\r<br />weapons governed by two perk trees primarily, you&#39;ll be trying to blocking\r<br />melee attacks, and that you&#39;ll be using shouts. \r<br />\r<br />Tier one companions amulet is roughly 3500 worth of stats covering: Archery, One-Hand, Block, Light Armor,\r<br />Shout Reduction, Stamina Regen, some magic resist, and Hit Points. Yet the amulet also has heavy armor and two\r<br />handed weapons included. \r<br />\r<br />Why max level items:\r<br />First, vanilla armor enchantments feel underwhelming to me. Second, the real life time invested into\r<br />the quests is of equal worth to me regardless if I&#39;ve been playing the\r<br />character for a few hours or several weeks. \r<br /> ",
  "categoryId": "54",
  "version": "1.0",
  "author": "Kaiezo",
  "createdUnix": "1417044369",
  "updatedUnix": "1417044365",
  "containsAdultContent": false,
  "uploadedBy": "Kaiezo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000136867",
      "name": "Guild Amulets",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Guild Amulets-60294-1-0.zip",
      "uploadedUnix": "1417044365",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c63726bbd4a71e3517d2687a73720d752878cbdffd3b9e58b3c5e186369042d1/analysis/1417044482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guild%20Amulets-60294-1-0.zip?fid=1000136867&ttl=1535848006&ri=8192&rs=8192&setec=9e224d4d52a9e66b454411c63a84689c"
    }
  ]
}