{
  "modId": 6030.0,
  "modName": "Project Time -WIP-",
  "summary": "Project: Time is an upcoming mod to completely overhaul Skyrim. This is a Work in Progress and could take me at least a year to complete by myself even with the Creation Kit.",
  "descriptionHtml": "Project: Time will change the face of Skyrim as you know it. Shouts will be combined into mighty powers. Spells will merge and become powerful cooldowns. Places and people will change. An epic adventure awaits us all in Project: Time.\r\n\r\nI first aim to change/remove/render unavailable abilities to the player. My idea\\'s so far are as follows (lacking their full name):\r\n\r\nPowers:\r\n\r\n1. CR: A combination of the Unrelenting Force and Elemental Fury shouts, this power in Project: Time will allow you to blast away/stagger an opponent before unleashing hell upon your opponent with your weapon. Lasts for double the duration of Elemental Fury. The cooldown of this ability is to be determined.\r\n\r\n2. HoT: A buffed version of the Slow Time shout, this power will allow you to slow time down to a crawl while you move at normal speeds. Lasts for triple the duration of Slow Time. The cooldown of this ability is to be determined.\r\n\r\nSpells:\r\n\r\n1. DF: A combination of the Flame Cloak and Flames spells, this spell will allow you to burn all nearby objects within a 15 yard radius while using your hands to focus your firey power on. Lasts 15 seconds. The cooldown of this ability is to be determined.\r\n\r\n2. FW: This spell will be an incredibly tweaked version of Whirlwind Sprint. Outside dungeons, it will work as normal. Inside dungeons, preform Whirlwind Sprint as you would if you where trying to perform Wuld Nah Kest and you will cast a waypoint. Preform it again anywhere within the same dungeon and you will be teleported to where you cast your waypoint. Lasts until you exit the dungeon. Can only be used 3 times per dungeon. Cooldown outside of dungeons, yet to be determined.\r\n\r\n3. NL: This spell will combine all of the ward and armour spells currently in game to create a powerful barrier around yourself. Lasts 4 seconds. The cooldown of this ability is to be determind.",
  "categoryId": "79",
  "version": "",
  "author": "AnarothEverstill",
  "createdUnix": "1326414742",
  "updatedUnix": "1326414742",
  "containsAdultContent": false,
  "uploadedBy": "AnarothEverstill",
  "primaryFile": null,
  "files": []
}