{
  "modId": 60320.0,
  "modName": "Refonte complete jouabilite skyrim",
  "summary": "Afin de rendre les combat plus dynamiques et surtout plus meurtriers, j&#39;ai apporté des modifications aux choses suivantes :\r<br />Armures , Armes, Sorts, Créatures et PNJ, competences, stats, Boss puissants et Loot intéressants sur ces boss",
  "descriptionHtml": "Ce mod est une modification Vanilla impliquant une refonte totale de toute la jouabilité du jeu de manière à rendre les combats plus rapides et meutriers même à haut level, ainsi qu&#39;un système de loot sur les Boss plus gratifiant.\r<br />\r<br />J&#39;ai crée le mod de manière à le rendre compatible avec le téléchargement d&#39;autres mods amateurs, et cela améliore même bien souvent la qualité de la jouabilité au sein de ses mods ( beaucoups de mods utilisent les créatures d&#39;origines du jeu, et j&#39;ai pris l&#39;Ebonite comme référence pour les stats des équipements )\r<br />\r<br />Compatibilité : - Nécessite Skyrim + Dawnguard (bien que la modification porte uniquement sur skyrim mais j&#39;ai eut le malheur 1 fois de charger dawnguard avec et ai enregistré par la suite)\r<br />- Compatible avec tout mods de modifications graphique ou ajoutants de nouvelles choses au jeu (armes, armures, lieux, sorts, etc...)\r<br />- Entre probablement en conflict avec d&#39;autre mods de jouabilité, si ces mods modifient les stats des créatures, les stats des équipements, les sorts d&#39;origines du jeu, les perks d&#39;origine du jeu. Il est nécessaire dans ce cas de définire l&#39;ordre de chargement des mods avec le mod manager.\r<br />\r<br />Installation : Facile à Activer/Desactiver et à Installer/Désinstaller car constitué d&#39;un simple fichier .esp (à mettre dans le dossier Data du jeu).\r<br />\r<br />MODIFICATIONS DU MOD :\r<br />\r<br />Créatures :\r<br />- TOUTES les créatures, ainsi que les PNJ ont été modifié. Les créatures et PNJ sont tous leveled afin de rester difficiles jusqu&#39;au lvl max.\r<br />- Les boss sont enfin réellement dur a vaincre et leurs Loot d&#39;équipements plus avancé que n&#39;importe quelles autres créatures (ainsi que du épique au lvl 50)\r<br />- La difficulté est plus difficile en donjon (=Ruines Draugr/Dwemer) que en exterieur\r<br />\r<br />\r<br />Perks :\r<br />- Dégats arcs x3,3 au lvl 50 donnant la possibilité de jouer exclusivement à l&#39;arc\r<br />- Vitesse des armes 1M x1,37 grace au talent &#34;posture de combat&#34;\r<br />- Vitesse des armes 2M x1,5 grâce au talent &#34;position du champion&#34; pour permettre 1 blocage plus vif et dégats max x1,7 au lieu de 2,0\r<br />- Puissance des attaques puissantes 1M et 2M modifiée sur les talents\r<br />- Blocage vraiment efficace (x6 au lieu de x2 max)\r<br />- Quelques autre modifications mineures\r<br />\r<br />Equipements :\r<br />- Réduction de l&#39;évolution des stats des équipements, afin de mieux pouvoir choisir son équipement en fonction du skin\r<br />- Les Arcs et Flèches sont divisés en 3 catégories suivant leurs vitesses d&#39;attaque et leurs dégats.\r<br />- Certaines épées ayant une petite taille sont devenues des épée courtes (plus rapide, moins d&#39;allonge, moins de dégats)\r<br />- Toutes les armes composés d&#39;un même materiaux s&#39;équivalent, seule la jouabilité change\r<br />- Possibilité de loot sur les Boss une version épique (=daedrique) de chaque équipement éxistant dans le jeu au lvl 50\r<br />- Possibilité de loot sur les Boss l&#39;ensemble des équipements non jouable (comme la robe Psjiik)\r<br />\r<br />Sorts :\r<br />- Possibilité d&#39;invoquer TOUTES les créatures du jeu (En lootant sur des boss ou des créatures légendaires éparpillé sur la carte pour la pluparts)\r<br />- Toute une panoplie de sorts de soins pour soigner les alliés (inspirés de wow)\r<br />- Sorts d&#39;illusions spéciaux pour voleur possedant que 100PM (Invisibilité rapide, stun CaC, Combo Invisibilité+Dgts1M, etc...)\r<br />- Ajouts de nouveaux sorts de destructions\r<br />- Sorts d&#39;armures et de buff alliés beaucoup plus long (pour ne pas avoir a les lancer tout le temps)\r<br />- Les réanimations peuvent réanimer n&#39;importe quelle créature et durent très longtemps\r<br />- Tous les sorts de bases ont été modifiés et d&#39;autres nouveaux sorts dont je n&#39;ai pas parlé ici ont été ajoutés car ça serait trop long\r<br />\r<br />\r<br />CE QUE LE MOD NE MODIFIE PAS :\r<br />Tous ce qui ne touche pas à la jouabilité c&#39;est a dire la topologie des lieux et les quêtes (cela dit j&#39;ai parfois mais rarement effectué des très légères modifications a certaine quête en y ajoutant plus d&#39;alliés)\r<br />\r<br />Je n&#39;ai pas touché aux cris, ils sont laissés d&#39;origines.\r<br />\r<br />\r<br />Voila j&#39;espère n&#39;avoir rien oublié et surtout n&#39;hésitez pas a me faire part de vos impressions, car même si je considère mon mod comme complet, je ferai surement des modifications suite a certains commentaires\r<br />\r<br />\r<br />ECHELLE DE DIFFICULTEE (du plus simple au plus dur) :\r<br />Bandits =&gt; Draugr et Creatures =&gt; machines Dwemers =&gt; Falmers =&gt; Boss (de tous types)\r<br />Jouez au jeu en mod standart\r<br />\r<br />\r<br />VIDEOS :\r<br />Bien que ayant déja maintes et maintes fois testé mon mod avec 3 personnages archetype (tank, assassin, mage), je suis actuellement en train de faire 1 ultime phase de test avec 1 personnage polyvalent et fournirai des vidéos qui en diront plus long sur la jouabilitée que des lignes de textes.\r<br />\r<br />\r<br />Autres mods que j&#39;ai sorti :\r<br />- Un immense donjon Dwemer durant 2h30 minimum a traverser composé de tous les intérieurs de ruines dwemers, inseré dans griffenoire, et possedant la même difficultée que mon mod refonte jouabilité (si jamais mon mod refonte jouabilité à des conflicts avec d&#39;autres mods, je vous conseil de le télécharger car les créatures ont les mêmes stats &#33;)\r<br />Lien : http://www.nexusmods.com/skyrim/mods/60611/?\r<br />\r<br />A VENIR d&#39;ici fin janvier MAX :\r<br />- Mon mod de jouabilité Dawnguard\r<br />- Mon mod de jouabilité Solstheim\r<br />\r<br />- Le même principe de donjon que le Dwemer pour tous les autres types interieurs de \r<br />donjons d&#39;origines du jeu sont aussi à venir.\r<br />\r<br />Avancé de mon travail de modding :\r<br />- aujourd&#39;hui le 08/12/2014 je continu ma phase de test finale (avancement = lvl 30/50)\r<br />\r<br />NB :\r<br />Ayant reçut 1 commentaire disant que mon mod ne marche pas chez moi car il entre en conflict avec d&#39;autre, mes donjons seront repeuplé de nouvelles créatures avec les même stats que dans mon mods (et chaque donjon = tous les donjon d&#39;origines du même type et contenant les mêmes créatures d&#39;origines mais améliorés)\r<br />\r<br />Je met régulièrement mon mod à jour donc passez sur le site pour voir si la version a changée.",
  "categoryId": "24",
  "version": "2.3",
  "author": "UTHDINGER Emmanuel",
  "createdUnix": "1417112440",
  "updatedUnix": "1418054473",
  "containsAdultContent": false,
  "uploadedBy": "manu67310",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000137014",
      "name": "Refonte jouabilite Skyrim",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1515",
      "fileName": "Fichier du mod-60320-2-1.7z",
      "uploadedUnix": "1417172386",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/df6910b2282942297158cd7245c45a42225f7a6cac04e41380c920ff81755fda/analysis/1417172404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fichier%20du%20mod-60320-2-1.7z?fid=1000137014&ttl=1535848043&ri=8192&rs=8192&setec=8331ff49ff753fb3b3d7c10621e22e13"
    },
    {
      "fileId": "1000137291",
      "name": "Fichier du mod.",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1520",
      "fileName": "Fichier du mod.-60320-2-2.7z",
      "uploadedUnix": "1417359364",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/3aa61ddd94fb296ca2f4625799a820d4c7997894f053a999c18ca8eee1ed9845/analysis/1417359423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fichier%20du%20mod.-60320-2-2.7z?fid=1000137291&ttl=1535848043&ri=8192&rs=8192&setec=64f3b4a0edaaba59217afa647b735591"
    },
    {
      "fileId": "1000138185",
      "name": "Refonte jouabilite Skyrim",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1527",
      "fileName": "Refonte jouabilite Skyrim-60320-2-3.7z",
      "uploadedUnix": "1418054473",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/59f68f143fe19d9b5af0d9223a584fd246d4f4ab14275cc6688e2b2472b68381/analysis/1418054523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Refonte%20jouabilite%20Skyrim-60320-2-3.7z?fid=1000138185&ttl=1535848044&ri=8192&rs=8192&setec=8e609fb5e1553a9235c92a5ecb8ee142"
    }
  ]
}