{
  "modId": 60321.0,
  "modName": "Bioshock Wrench and power mod (early stages)",
  "summary": "The Wrench from bioshock, my favorite weapon, I tried to keep it as like it as I could, even the way it smashes enemies back, with a hint of shock, now that the wrench is done I am working on the powers fro the mod.",
  "descriptionHtml": "Leave me a comment on what you want to be added :)\r<br />\r<br />Changes-\r<br />Can now get eve syringes that will boost your magic. Still a slight texture bug\r<br />\r<br />Added a spell electro bolt, this is obtained by finding the little syringe of adam next to jacks body, it will give you the power.\r<br />Fixed the blood on the wrench glitch, the blood works fine now :)\r<br />\r<br />bugs-\r<br />\r<br />The eletro bolt power went green on me and i cant get it back to to look like electricity.\r<br />Texture bug on the syringe\r<br />\r<br />\r<br />After watching an episode of Top 5 skyrim mods of the week Seb mentions how there is not really any bioshock mods out there, so I did a check and got the idea to make this one.\r<br />-\r<br />The wrench will knock back anyone that tries to attack you so it is fairly op.\r<br />-\r<br />This is of course the first mod I am uploading so plenty of feedback would be great :)\r<br />-\r<br />If people are interested in it I might keep going with it, if I do continue it in the future there will be different variations of the weapon, like poison or fire, to give it a bioshock feel of the powers, the different variations will have different textures to correspond with them, I will also upgrade the texture and the model if it comes to it.\r<br />-\r<br />If this ever gets mentioned on top 5 skyrim mods tweet me to let me know because that would just complete my life.\r<br />https://twitter.com/BroTechGames\r<br />-\r<br />\r<br />This mod does not require any additional mods or dlc, right now it is simple but if it receives interest I will consider making it better.",
  "categoryId": "55",
  "version": "v5",
  "author": "CactusKnight",
  "createdUnix": "1417112379",
  "updatedUnix": "1417281334",
  "containsAdultContent": false,
  "uploadedBy": "CactusKnight",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000137185",
      "name": "Bioshock Wrench and power mod v5",
      "version": "v5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5175",
      "fileName": "Bioshock Wrench and power mod v5-60321-v5.zip",
      "uploadedUnix": "1417281334",
      "modVersion": "v5",
      "virusScanUrl": "https://www.virustotal.com/file/62a0616b33ade401e91bbfe3aaeda7a631834e7b4573c347c98e50ef933fc891/analysis/1417281364/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bioshock%20Wrench%20and%20power%20mod%20v5-60321-v5.zip?fid=1000137185&ttl=1535848046&ri=8192&rs=8192&setec=4300a027870a54d3da8121f3524a4cf5"
    }
  ]
}