{
  "modId": 60336.0,
  "modName": "Ravenscale Cabin",
  "summary": "A cozy cabin on the coast of Dawnstar, limited in amenities but unique in style&#33;",
  "descriptionHtml": "[size=4][u]Ravenscale Cabin[/u][/size]\r<br />\r<br />Happy belated Thanksgiving everyone&#33; This nexus has given me a lot of fine things to enhance my Skyrim experience over these years, and you have my thanks. I&#39;d like to share with you my latest experiment, a player home using some Oblivion remade resources&#33; This Ravenscale Cabin hosts a cozy, perhaps even cramped, but fancy lifestyle for the Dragonborn who hasn&#39;t yet amassed an incredible wealth. It&#39;s positioned south of the Dark Brotherhood sanctuary of Dawnstar, next to Silus&#39; museum for the mythic dawn. \r<br />\r<br />I recommend the fine mods &#39;My Home is Your Home&#39; by Volek, and Custom Family Home by Witchriser, to have a Hearthfire flare without that dlc.\r<br />\r<br />[b][u]Pros[/u][/b]\r<br />- It works well with Dawnstar Expanded, Dawnstar Fortified, and other remakes to the city. It lies in the DBSanctuary cell, but modifies very little. \r<br />- 2 mannequins, 1 shield display, 1 shield/sword display, 2 horizontal weapon plaques, 5 weapon racks. \r<br />- Custom meshes, including paintings, the entirety of the interior/exterior cabin cells, and other static decor. \r<br />- 1 master bed and room, and 3 beds in the loft for followers or children. \r<br />- Alchemy and Enchanting stations, and a wood chopping block outdoors. \r<br />- No DLC needed&#33; \r<br />\r<br />[u][b]Cons\r<br />[/b][/u]- Unfortunately, no luxury crafting like smelters or smithing stations; My reasoning is that the town with these stations could use more love. \r<br />- There are no codes or amenities from the DLC&#39;s; this was meant to be Skyrim vanilla only. \r<br />- Limited light sources; I tried to get the place comfortably bright without too many light sources, so nothing would clip on the single large interior mesh.\r<br />\r<br />[b][u]Instalation[/u][/b]\r<br />- Unzip the file straight to your Data folder. The textures and meshes should work, let me know if there are problems. This is my first time working with these things. \r<br />\r<br />[b][u]Credits[/u][/b]\r<br />- My thanks to marcusliberty for his Cyrodiil Farmhouse Tileset, and jabr for his Legendary Cities - TES Arena textures&#33; \r<br />\r<br />EDIT: Being made aware of texture source problems (by talos am I embarassed), I think I included some proper files to prevent any problems there. Thank you for your patience. \r<br />\r<br />",
  "categoryId": "67",
  "version": "1.1",
  "author": "ClefJ",
  "createdUnix": "1417159496",
  "updatedUnix": "1417236299",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000137131",
      "name": "Ravenscale Cabin",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44954",
      "fileName": "Ravenscale Cabin-60336-1-1.zip",
      "uploadedUnix": "1417236299",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6ca5f1759f415aff8af3efbc000ff1ae16cc988204d7156618fe3f04a7e8bb31/analysis/1417235843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ravenscale%20Cabin-60336-1-1.zip?fid=1000137131&ttl=1535848068&ri=8192&rs=8192&setec=fb23ada3b5a8d8ad029757940077cef9"
    }
  ]
}