{
  "modId": 60369.0,
  "modName": "Your Home is My Home",
  "summary": "A small home placed right under the denizens of Riften. A house of a true thief.",
  "descriptionHtml": "I wonder how people make those fancy pages.......\r<br />\r<br />[b][size=3]The House[/size][/b]\r<br />The house is small, just about the size of you&#39;re average vanilla house. It was designed with more role-play in mind, and as such only has the bare essentials. It&#39;s also rather cluttered, so if you like large empty houses, you won&#39;t like this one. I personally don&#39;t like large emty houses, I prefer mine to feel like someone actually lives in them, and i set out try and accomplish that.\r<br />\r<br />The house is not fully functional. As in, it does not have every single crafting station, I simply put what i felt a true thief would need. although in doing so, I feel like I just made a small personal Cistern. Everything the house does have, IS fully functional. \r<br />\r<br />It is integrated with the Thieves Guild Quests. After a certain point during the main quests of the Thieves guild, you will open up a new entrance, and other function that you&#39;ll just have to discover. \r<br />\r<br />The integration includes Thieves Guild treasures. When you unlock the trophies in the Cistern, they will also be unlocked in your den, however, I made it so you can&#39;t pick up or remove them. Why? I hate it when nice displays get ruined when I accidentally remove something, so I took it upon myself that it will never happen.\r<br />\r<br />[b]NOT ALL STORAGE&#39;S ARE SAFE.[/b] For one, the [b]LOCKED CHESTS[/b] are not safe, I hope that&#39;s obvious, they&#39;re like the practice chests in the Cistern. [b]FOOD BARRELS [/b]and[b] SACKS are not safe. [/b]They respawn, simulating the everyday restocking of Dovakin, or at least I think they should. \r<br />\r<br />[b][size=3]Where[/size]\r<br />[/b]I&#39;d like to keep this a secret, a bit of exploring for anyone who decides to use it. I personally like the idea of finding a hidden house in someone&#39;s house. You&#39;ll have to sneak around the houses of Riften, looking for a new place to stay. It is in Riften, I can tell you that much. Alternatively, you can do Thieves guild quests, this will open up a blocked hidden passage to the house, you&#39;ll miss out on a small transformation if you do though, since the house updates to the quest. If you just want to know where it is, message me, I&#39;ll just tell you, but I don&#39;t want to spoil anyone one&#39;s fun.\r<br />\r<br />[b][size=3]Future[/size]\r<br />[/b]Depending on how this goes, I may or may not expand on this particular house.\r<br />\r<br />[b][size=3]To anyone who actually uses this mod :P[/size]\r<br />[/b]I&#39;d love if you guys would send in some screens.\r<br />\r<br />[size=3][b]VERY IMPORTANT\r<br />[/b][/size]I cannot guarantee storage. I&#39;d like to think I set up everything correctly, but you never know. I&#39;m even paranoid when putting items into vanilla homes. \r<br />[size=3]\r<br />[b]Incompatibilities[/b][/size]\r<br />I personally run around 180 mods, and it works. Although I suspect that if you have mods that alter the Cistern, or the aforementioned house, there may be problems, if you run into any, let me know.\r<br />\r<br />[b][size=3]Personal Note[/size][/b]\r<br />I&#39;ve long been fascinated by the idea of living right under someone&#39;s nose. At first i though of making it in the same interior cell as the NPC&#39;s house, but decided against it for various reasons. This is my first mod, and pretty much an experiment for me. I have a reasonably larger idea planned. I feel pretty late to this scene so I&#39;m not sure if I&#39;m too late or not :/ ",
  "categoryId": "67",
  "version": "1.0a",
  "author": "Lulilummu",
  "createdUnix": "1417275529",
  "updatedUnix": "1417428767",
  "containsAdultContent": false,
  "uploadedBy": "Lulilummu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000137177",
      "name": "YHMH-1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "43",
      "fileName": "YHMH-1.0-60369-1-0.7z",
      "uploadedUnix": "1417275434",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/180fb8a6fbcf0f29f49f083b08390855535a6104f986dcca55cfc4326ff6d127/analysis/1417275482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YHMH-1.0-60369-1-0.7z?fid=1000137177&ttl=1535848117&ri=8192&rs=8192&setec=5807b100e6141822e1f49cd4b1e169dc"
    },
    {
      "fileId": "1000137404",
      "name": "YHMH-1.0a",
      "version": "1.0a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43",
      "fileName": "YHMY-1.0a-60369-1-0a.7z",
      "uploadedUnix": "1417428767",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/b1e44df5eafa096a9f007cba280af8e587fdc797bd3d79e56d0c19457d4eac11/analysis/1417428782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YHMY-1.0a-60369-1-0a.7z?fid=1000137404&ttl=1535848117&ri=8192&rs=8192&setec=a2e8d1e4627c467513bb786b296da73d"
    }
  ]
}