{
  "modId": 60442.0,
  "modName": "Dwemer Shaded Solid Pipes - DELETED",
  "summary": "Short Solid Dwemer pipes.",
  "descriptionHtml": "Resource for mod makers. I made these custom meshes for Wheeze of the Luftahraan mod project. He had mentioned in one his online streams that he wished there were versions of the Dwemer pipes that were solid and had shaded interiors so he could use them for various ideas he had. So i figured I could do that real easy. I jumped into 3DSMAX imported the three short Dwemer pipes and went to work. I am sharing them with the Nexus community , under a few limitations. I want the files to remain a Nexus exclusives. No mirroring the assets on another site. You can list them, and post links to the assets on the Nexus, but I do not want to find then in part of another resource pack on the Steam Workshop. I might consider uploading to select other sites later. Its just easier to keep track of things all in one place. \r<br />\r<br />The pictures are just in the CreationKit, to prove that they in fact do work in the game engine. They are fully environmentally texture mapped just like the original pipes and have full inner vertex shading giving the appearance of depth. They are also fully collision mapped as well. I used water pouring out them in the screenshots, but steam could be used and I suppose they could also be used as a custom entrance and exit point in a Dwemer dungeon.  \r<br />\r<br />This is my fist posting of a mod so, please be kind. I have been modding Skyrim for myself for over 2 years. I have often wanted to share what I have made but always ended up changing my mind. But its becoming more apparent that more custom assets are needed as we often see the same meshes used over and over again and lets face the facts. As good as Bethesda is they often are a bit shortsighted when it comes to making meshes for their games. So here is my first of several things I have in the works. I am always open to comments both good or bad. Just don&#39;t be overly negative because this stuff is for free after all. And above all if you have any problem with them in the CreationKit let me know ASAP so I can work on what ever issue you might have found. \r<br />Thanx and have fun modding. ",
  "categoryId": "82",
  "version": "1.0",
  "author": "Impulseman45",
  "createdUnix": "1417488088",
  "updatedUnix": "1417487551",
  "containsAdultContent": false,
  "uploadedBy": "Impulseman45",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000137475",
      "name": "Dwemer Solid Pipes",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "85",
      "fileName": "Dwemer Solid Pipes-60442-1-0.rar",
      "uploadedUnix": "1417487551",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/842cfd7712e6e72b8ba12bfc2416316f6739e9e477b536362818c34af4660576/analysis/1417487642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Solid%20Pipes-60442-1-0.rar?fid=1000137475&ttl=1535848209&ri=8192&rs=8192&setec=e9be7cac7a340026851451e27e410821"
    }
  ]
}