{
  "modId": 60504.0,
  "modName": "See Red - An Immersive Imod Mod",
  "summary": "Adds immersive imagespace modifiers to Redguard Adrenaline Rush, Altmer Highborn and Werewolf Beast Form as well as making th modifier for Orc Berserker Rage more red.\r<br />&lt;br /&gt;For added immersion, notification messages for feeding as a werewolf or vampire lord are also turned off.",
  "descriptionHtml": "[center][size=6][b][u]  See  Red  [/u][/b][/size]\r<br />[b][size=3]An Immersive Imod Mod\r<br />[/size][/b]\r<br />[color=lightgrey]If you have ever played an Orc in Skyrim, or at the very least watched someone playing an Orc, you will be familiar with how awesome it looks as the screen blurs and reddens when you go into a Berserker Rage. Well here&#39;s a disappointing fact: That immersive, blurry-screen awesomeness is reserved for Orcs alone. Despite the other races having powers which put them into a similar hyped-up states, only the Orc receives a cool imagespace modifier when using theirs. Much to my confusion, not even werewolves get their own screen effect&#33; In a word, it&#39;s disappointing.[/color]\r<br />[b][size=5]Be disappointed no longer&#33;[/size][/b]\r<br />[color=lightgrey]See Red adds brand new screen effects to a few of Skyrim&#39;s racial powers, a host of subtle effects to werewolves and even goes so far as making Berserker Rage look just that bit more violent. Check it out&#33;[/color][/center]\r<br />\r<br />This mod is compatible with, and looks far better when used alongside, [b]LogicDragon&#39;s [/b][url=http://www.nexusmods.com/skyrim/mods/57859/?][b]Enhanced Camera[/b][/url] and [b]Gopher&#39;s [/b][url=http://www.nexusmods.com/skyrim/mods/3222/?][b]Immersive HUD[/b][/url]. Even if you don&#39;t use [b]See Red[/b], I highly recommend them to you.\r<br />\r<br />\r<br />[size=5][b]Feature List[/b][/size]\r<br />[color=lightgrey]- When a Redguard uses Adrenaline Rush, contrast and clarity are dramatically increased and the edges of the screen are subtly blurred, giving more focus to what you are looking at.\r<br />- When an Altmer uses Highborn, the world around them is given a golden tint and everything appears to glow somewhat.\r<br />- When an Orc uses Berserker Rage, the screen is now much more visibly reddened.\r<br />- When any race tranforms into a werewolf, the screen in blurred and reddened similar to Berserker Rage. With werewolves, however, the screen is much more desaturated (as werewolves cannot see colour) and everything is much brighter.\r<br />- All the new imagespace modifiers also come with individual intro and outro transitions and are designed with immersion in mind.\r<br />\r<br />All the imagespace modifiers can be previewed in the image section but, as of yet, cannot be configured within the mod.[/color]\r<br />\r<br />\r<br />[b][size=5]Known Bugs and Compatibility Issues[/size][/b]\r<br />[color=lightgrey]None as of yet. Please alert me if you find any.[/color]\r<br />\r<br />\r<br />[b][size=5]Planned Features\r<br />[/size][/b][color=lightgrey]- Mod Configuration Menu compatibility.\r<br />- Seperate main mod and dawnguard patch.\r<br />- Short blur when using Nord Battle Cry.\r<br />- Imagespace modifiers and other effects for alcohol and skooma.\r<br />- Imagespace modifiers for Argonian Hiskin and Breton Dragonskin.\r<br />- Increased blurring for Berserker Rage, Adrenaline Rush and Beast form while sprinting.\r<br />- Increased glowing for Highborn while casting spells.\r<br />\r<br />If you have any suggestions, please feel free to share them.[/color]",
  "categoryId": "62",
  "version": "1.0.0",
  "author": "LtMattmoo",
  "createdUnix": "1417730416",
  "updatedUnix": "1417733117",
  "containsAdultContent": false,
  "uploadedBy": "LtMattmoo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000137726",
      "name": "See Red",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "See Red-60504-1-0-0.zip",
      "uploadedUnix": "1417733117",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/eb9a99f4e9f395d56eba765403ccfac1d4f42f2071ab64b686ecd6438f291dc4/analysis/1417733162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/See%20Red-60504-1-0-0.zip?fid=1000137726&ttl=1535848290&ri=8192&rs=8192&setec=a5b9a1b5c67e66bbdb6b9b4e078e1f94"
    }
  ]
}