{
  "modId": 60511.0,
  "modName": "Ralvon - Simple Nord Follower",
  "summary": "A mod that adds a simple Nord follower to the game.",
  "descriptionHtml": "[size=5][b][i]Description\r<br />[/i][/b][/size][size=4]Ever wanted a follower mod that just adds a normal follower? All the other follower mods I&#39;ve discovered add some special follower who has special armor, has special voice acting, or the follower seems like they wouldn&#39;t fit into the normal game. I decided my first mod for Skyrim would be just a simple/normal, easy to get follower. Now I did add some lore for those who like knowing why characters are in a world (like me).\r<br />[/size]\r<br />\r<br />\r<br />[size=5][b][i]Lore\r<br />[/i][/b][/size][size=4]Ralvon was a bandit. He was part of a group that settled near the town of Riverwood, in a mine. Rarely did any of them see the light of day. One morning Ralvon thought of a plan to kill all the members of his group, and steal everything they had. However, he was caught and imprisoned in the same mine. Days, weeks, months went by. He finally escaped when the guard wasn&#39;t looking, and ran to the nearest town of Riverwood. Ralvon was ready to make up for the wrong he had done as a bandit, and pledge himself to anyone who wished for his assistance. This is where you come in\r<br />\r<br />\r<br />[/size]\r<br />[size=5][b][i]Why use my mod?\r<br />[/i][/b][/size][size=4]So why use my mod over another follower mod, or why [/size][u]shouldn&#39;t[/u][size=4] you?[/size]\r<br />\r<br />[size=4]Use this mod if you like...[/size]\r<br />[size=4]-Simple[/size]\r<br />[size=4]-Nothing special[/size]\r<br />[size=4]-Characters that feel like Bethesda NPCs[/size]\r<br />\r<br />[size=4]Don&#39;t use this mod if you like...[/size]\r<br />[size=4]-Unique characters[/size]\r<br />[size=4]-Special[/size]\r<br />[size=4]-Characters that you know are user-created[/size]\r<br />\r<br />[size=5][b][i]Features[/i][/b][/size]\r<br />[size=4]A simple Nord character with particularly long hair. Starting gear is an iron sword, fur bracers, fur armor, and fur shoes. I made sure that unlike most followers, the items are actually in his inventory so you can equip/unequip at will. [u]NOTE:[/u] The character is found in the Sleeping Giant inn at Riverwood\r<br />\r<br />[/size][size=5][b][i]Issues\r<br />[/i][/b][/size][size=4]Shouldn&#39;t have any compatibility issues. When you find Ralvon at the inn, he is not wearing any clothes. Once you recruit him, take his armor and give it back to fix this.[/size]",
  "categoryId": "96",
  "version": "v1.0",
  "author": "User_16587874",
  "createdUnix": "1443812817",
  "updatedUnix": "1443812817",
  "containsAdultContent": false,
  "uploadedBy": "User_16587874",
  "primaryFile": null,
  "files": []
}