{
  "modId": 60533.0,
  "modName": "Dragonborn Delayed",
  "summary": "Indefinitely prevents the forced beginning of the Dragonborn main questline.",
  "descriptionHtml": "Have you downloaded an overhaul mod that requires Dragonborn, but don&#39;t want to be thrust into the questline? Simply want to explore Solstheim but not have to deal with that jerkbag Miraak or his Cultist buddies? Then this could be the mod for you&#33; \r<br />That&#39;s right, what this mod does is simply delay the Cultists from ever approaching and attacking you, initiating the first main quest for the Dragonborn expansion. You can still travel to Solstheim by going to the Windhelm docks, talking to Gjarlund and paying up 250 septims, but without the hassle of any quest obligation. \r<br />\r<br />DISCLAIMERS: This won&#39;t work if you&#39;ve already started the Dragonborn questline. You also don&#39;t even need it if you&#39;re using an alternate start mod, or if you haven&#39;t even been summoned by the Greybeards. Also, if you use console commands to level yourself past level 999 (which why are you doing that, exactly?) the Cultists will come after you. Sorry. \r<br />\r<br />If you do decide that you want to start the Dragonborn main questline, you can do one of two things: \r<br />1. Enter &#34;setstage DLC2MQ01 10&#34; into the console. \r<br />2. Uninstall my mod. \r<br />\r<br />Both work equally, but the second option might make me cry.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Shaman Jayden",
  "createdUnix": "1417808983",
  "updatedUnix": "1417916970",
  "containsAdultContent": false,
  "uploadedBy": "ShamanJayden",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138005",
      "name": "Dragonborn Delayed",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Dragonborn Delayed-60533-1-0.7z",
      "uploadedUnix": "1417916970",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0779b33bc23026597ba82d2dd7f7787084543259266b31ed34a099a684e5bbe4/analysis/1417917003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20Delayed-60533-1-0.7z?fid=1000138005&ttl=1535848331&ri=8192&rs=8192&setec=b8199f47a7504206f825ed87dae77ed6"
    }
  ]
}