{
  "modId": 60547.0,
  "modName": "Simple Difficulty Rework",
  "summary": "A simple readjustment of the vanilla difficulty system.",
  "descriptionHtml": "This is a simple mod that takes a minimalistic approach to dealing with an issue, in this case being the damage-sponge difficulty system.\r<br />\r<br />The only edit this mod does is change the values that dictate the damage the player deals and receives as per the difficulty selected.\r<br />\r<br />Reasoning-\r<br />   I feel the damage-sponge system is a bit too...bad. I personally play almost exclusively on Legendary and find it a bit hard to believe certain cases where shenanigans happen. For example, repeated dagger sneak attacks on a sleeping bandit who wore little more than leather straps on his chest and no helmet would result in him standing up, taking more stabs while doing so, then giving me an angry stare and a flick of the finger to one-shot me. I have a hard time imagining how anyone could botch that assassination attempt hard enough to justify the result. However, being one to not back down, I continued on maddening difficulty anyway until I had proper gear and perks to beat anyone by getting higher numbers on my armor and weapons, and so on and so forth through several characters much like many a player.\r<br />   I&#39;m perfectly fine dealing with the damage I receive, but the damage I put back out I just find incredulous. At the same time, I felt that simply lowering the difficulty, be it by altering the values or simply bumping it down from Legendary to Master, was the coward&#39;s way out and that I should be able to fight against all these odds despite how they stacked against me. And then I got over it and discussed with a friend how to make it more interesting and an alternative came to mind, in a way something like this:\r<br />\r<br />Me: What if...I make it so I deal normal damage. They can deal triple damage all they want, but I want to deal normal damage atleast.\r<br />Friend: Both should deal triple damage.\r<br />Me: *why_not_both?.jpg appears in my mind, gears turn, and the happy why-not-both girl from that taco commercial appears and much rejoicing blah de blah*\r<br />Friend: Also maybe Legendary could be like Heaven and Hell mode from Devil May Cry, except not that extreme.\r<br />\r<br />So I changed the values. And they look something like this\r<br />\r<br />Vanilla Difficulty\r<br />\r<br />Difficulty: Damage Dealt, Damage Received\r<br />\r<br />Novice: 2x, 1/2\r<br />Apprentice: 1.5x, 3/4\r<br />Adept: 1, 1\r<br />Expert: 3/4, 1.5x\r<br />Master: 1/2, 2x\r<br />Legendary: 1/4, 3x\r<br />\r<br />\r<br />NEW Difficulty\r<br />\r<br />Novice: 1/4, 1/4\r<br />Apprentice: 1/2, 1/2\r<br />Adept: 1, 1\r<br />Expert: 2x, 2x\r<br />Master: 3x, 3x\r<br />Legendary: 10x, 10x\r<br />\r<br />(With alternate file where Legendary: 100x, 100x for the extreme end)\r<br />\r<br />The idea behind this is lower difficulty fights now should last longer, be forgiving of mistakes, give time to make up for them, and just do what you need to do. On higher difficulties, the fights should be quick as well as death. Quick maneuvers and reflexes reward taking initiative with swift dispatches and narrow escapes from death. Or so the concept goes.\r<br />\r<br />\r<br />Installation: This is only a .esp file, simply place it in skyrim&#39;s Data folder and enable it and you&#39;re good to go.\r<br />\r<br />There are two versions, use Only one.\r<br />The two versions are: DifficultyRevampL10.esp and DifficultyRevampL100.esp.\r<br />The L10 version has the 10x multiplier for legendary while L100 has the 100x multiplier for legendary.\r<br />\r<br />\r<br />Disclaimer&#33;&#33;&#33;\r<br />\r<br />This mod isn&#39;t for everyone, but hopefully for some of you, it might be a solution that can add just a little more excitement to your experience. While I understand it&#39;s a bit of a modding no-no, I admit the testing I did was rather minimal, but it certainly worked every bit as intended. \r<br />\r<br />Due to the nature of how simple this mod is, there really isn&#39;t much to take from it. If you want to post it somewhere else, by all means I&#39;m fine with spreading it to whoever would enjoy it, just give me the little bit of credit due for throwing this mod up. This includes if you want to integrate it into your own mod, however that works. Or not, it&#39;s fine, I really don&#39;t care, but the general rule of being a nice person is always smiled upon (if you actually used mine that is, rather than making it yourself, in which case it ain&#39;t my edit then). However, for anyone who wants to edit this (even though it would be much simpler to make your own edit from scratch), I encourage you by all means to come up with your own combination of adjustments that suits your playstyle or that you find to be a proper tuning of the values, just grab the Creation Kit, load the main Skyrim module, and go to Gameplay&gt;Settings and search for fDiffmult I believe it is.\r<br />\r<br />However I take no responsibility for stuff resulting from this mod, including computers exploding, raining muffins, pure rage, or any of that nonsense. I&#39;m also Very much likely not going to be editing or updating this. It will be what it will be and I&#39;m not obligating myself to changing it, make your own variant. :)\r<br />\r<br />Your word for the day is: Chortle. A word for laughing that sounds like a pokeman. This message brought to you by the Add&#39;nSubtract Council.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Zaiben",
  "createdUnix": "1417842450",
  "updatedUnix": "1417842362",
  "containsAdultContent": false,
  "uploadedBy": "Zaiben",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000137877",
      "name": "Simple Difficulty Rework - Both Versions",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Simple Difficulty Rework - Both Versions-60547-1-0.zip",
      "uploadedUnix": "1417842362",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3855e8ffc4b09ee60aa3da88bf579a22b527d52cd75adf4472de063533ebf82a/analysis/1417842183/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Difficulty%20Rework%20-%20Both%20Versions-60547-1-0.zip?fid=1000137877&ttl=1535848342&ri=8192&rs=8192&setec=fc5ba96bb8520a7e34b36c58e2e9fa54"
    }
  ]
}