{
  "modId": 60597.0,
  "modName": "Extended Bow Improvement",
  "summary": "Adds perks that allow the players to further improve their bows and arrows. Adds upgrades to merchants and new (tough) enemies.",
  "descriptionHtml": "[u][size=6]Hircine&#39;s Influence can be found right here: \r<br />\r<br />http://www.nexusmods.com/skyrim/mods/64362/? \r<br />\r<br />THIS IS WHERE UPDATES 3+ CAN BE FOUND&#33; THEY ARE HIRCINE&#39;S INFLUENCE V1+ NOW (currently it&#39;s sitting at Hircine&#39;s Influence version 4 (EBI V6)&#33;&#33;&#33;[/size]\r<br />\r<br />Introduction[/u]\r<br />Do you enjoy the hunt? As Hircine&#39;s influence spreads across Skyrim, more and more people are becoming like you... or are they? These hunters are always trying to prove themselves to Hircine and would stop at nothing to hone their skills. Kill them, or be killed - you may like the results&#33; You may think the Dragonborn is of no interest to most of the Daedric Princes and you may be right. However, Hircine has got his eyes on you, too&#33; Destroy as many of his hunters as you can to prove yourself and you will be greatly rewarded&#33;\r<br />\r<br />[u]This mod[/u]\r<br />This mod used to be called &#34;Extended Bow Improvement&#34;. I was unhappy with that name and with its new additions, I finally had a reason to give it a different one. \r<br />This mod adds several perks to the archery tree that allow the player to further improve bows and arrows. I created it, because I&#39;m playing around a lot with bows again and I wanted to be able to craft stronger bows, especially because I play on legendary. With this mod, a player can decide for him/herself how powerful he/she wants a bow to be.\r<br />This mod also adds a few unique(-ish) bows and upgrades to Auriel&#39;s Bow. I always found the low power for a divine bow hard to understand.\r<br />\r<br />\r<br />\r<br />[u]This description contains\r<br />[/u][list][*][u]Changelog[/u][/*]\r<br />[*][size=2]Video(&#39;s)[/size][/*]\r<br />[*][size=2]Perks[/size]\r<br />[/*][*][size=2]Added bows[/size]\r<br />[/*][*][size=2]Powerful Bows[/size]\r<br />[/*][*][size=2]Fast Bows[/size]\r<br />[/*][*][size=2]Normal Bows[/size]\r<br />[/*][*][size=2]Auriel&#39;s Bow[/size][/*]\r<br />[*][size=2]Unique(-ish) Bows[/size]\r<br />[/*][*][size=2]Poisonous Arrows[/size]\r<br />[/*][*][size=2]Sacrificial Arrows[/size][/*]\r<br />[*][size=2]Enemies And Loot (Ingredients)[/size][/*]\r<br />[*][size=2]The Rituals Of Hircine[/size]\r<br />[/*][*][size=2]Cheating[/size]\r<br />[/*][*][size=2]Requirements[/size][/*]\r<br />[*][size=2]Possible Conflicts[/size]\r<br />[/*][*][size=2]Bashed Patches[/size][/*]\r<br />[*][size=2]Recommended Mods (only for fun)[/size]\r<br />[/*][*][size=2]Installation[/size][/*]\r<br />[*][size=2]Uninstalling[/size]\r<br />[/*][*][size=2]Showcase[/size]\r<br />[/*][*][size=2]Thank you (and future-talk)[/size]\r<br />[/*][*][size=2]Planned Mods[/size]\r<br />[*][size=2]Custom Models[/size]\r<br />[/*][/list]\r<br />[b][i][u]Changelog\r<br />[/u][/i]Verion 1.1[/b]: For poison arrows levels 4 and 5, there were 2 entries for snowberries in the recipes, in stead of 1 for ectoplasm and 1 for snowberries. I swapped the ectoplasm ingredient for deathbell, as ectoplasm can be far more difficult to obtain. Therefore, the second entry for snowberries, has been changed to deathbell as well.\r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b]Version 2:[/b] For this version, I added crafting recipes for Auriel&#39;s Bow and its upgrades and also 3 unique bows. WARNING: the crafting recipe for Auriel&#39;s Bow requires you to already have one. It duplicates the bow. I have done this, so that you need to get the bow in the game first and to make sure you can &#39;complete&#39; your bow collection. If you want all versions eventually, you&#39;re going to need to be able to duplicate the original bow&#33;\r<br />\r<br />Versions of Auriel&#39;s Bow:\r<br />Auriel&#39;s Bow (vanilla + crafting (duplicate) recipe)\r<br />Auriel&#39;s Bow Lvl 2 (double the damage)\r<br />Auriel&#39;s Bow Lvl 3 (double the damage of Level 2)\r<br />Auriel&#39;s Bow (Fast) (Faster, but slightly weaker)\r<br />Auriel&#39;s Bow (Fast Lvl 2) (Faster, double the damage of Fast Lvl 1)\r<br />Auriel&#39;s Bow (Fast Lvl 3) (Faster, double the damage of Fast Lvl 2)\r<br />Auriel&#39;s Bow (Powerful) (Stronger, but slightly slower)\r<br />Auriel&#39;s Bow (Powerful Lvl 2) (Stronger, slower, double the damage of Powerful Lvl 1)\r<br />Auriel&#39;s Bow (Powerful Lvl 3) (Stronger, slower, double the damage of Powerful Lvl 2)\r<br />\r<br />The bow is duplicated by using: \r<br />Auriel&#39;s Bow\r<br />1 Flawless Diamond\r<br />2 Diamonds\r<br />5 Golden Ingots\r<br />5 Refined Moonstones\r<br />10 Filled Grand Soul Gems\r<br />Elven Smithing (smithing level 30)\r<br />Extra Effect (enchanting lvl 100)\r<br />\r<br />All bows after that do not require the flawless diamond. They require everything else, though. It should not be easy to upgrade a godly bow. The stronger versions, also need &#39;fast bows&#39; as a perk, or &#39;powerful bows&#39; as a perk and &#39;Leveled Bows 5&#39; for Lvl 2 and &#39;Enchanted Bows 5&#39; for level 3.\r<br />\r<br />The unique bows I have added, cannot be created, only found.\r<br />- Bow of the Vampire (ebony, 35 dmg, 20 critical dmg, 50 HP drain, 20 Frost dmg) can be found on a table in Castle Volkihar\r<br />- Bow of the Wolf (hunting bow, 35 dmg, 20 critical dmg, 50 fire dmg, 1 minute fear (as in the howl of the wolf)) can be found on top of something, next to a weapon rack in Jorrvaskr\r<br />- Bow of the Valkyrie (glass, 35 dmg, 20 critical dmg, 50 shock dmg, 1 minute soul trap) can be found in Riverwood&#39;s river, between the bridge and the mill... but also, maybe not... rivers flow ;)\r<br />\r<br /> There is no cheating chest for these.\r<br /> \r<br />After a very busy school time of like 4 weeks is over, I plan on adding the various bows to loot lists and merchant lists/chests. These lists are not going to include Auriel&#39;s Bow versions, nor the 3 unique bows added by Version 2.\r<br />-------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />[b]\r<br />Version 2.1: [/b]small change - the three unique bows appeared to cost too much when I tested them in-game (had not done that yet). To be more exact, the vampiric bow&#39;s enchantment did cost too much and the valkyrie bow could do with a decrease in cost. I changed the cost of the enchantments on those two bows and added an extra main file, so that you can choose your version. Huge cost, or smaller cost.\r<br />The cost for the vampiric bow was over 2000. Changed it to 300. \r<br />The cost for the valkyrie bow was over 1200. Changed it to 300.\r<br />The cost for the wolf bow was less than 200. Kept it that way.\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />[b]Version 3:[/b] \r<br />- Changed the name of the mod to &#34;Hircine&#39;s Influence&#34;. \r<br />- Added enemies (to leveled lists).\r<br />- Added the bow and arrow improvment to merchants (leveled lists) and to the created enemies (also in leveled lists). \r<br />- Added 2 new ingrediënts (Manipulated Hearts and Manipulated Dragon Hearts)\r<br />- Added a new type of arrow (Sacrificial Arrow. Very hard to obtain, but very powerful indeed).\r<br />- Added a new bow (Hircine&#39;s Bow; the reward the introduction speaks of. Very hard to obtain, but very powerful).\r<br />For a more detailed description, please read the rest of the page.\r<br />\r<br />[b][i][u]Video(&#39;s)[/u][/i][/b]\r<br />[youtube]xEuiFfAvryA[/youtube]\r<br />[b][i][u]Perks\r<br />[/u][/i][/b]This mod adds a few perks to the &#39;Archery&#39; skilltree. Picking these perks will allow the player to upgrade bows. The perks are:\r<br />Fast Bows: allows the player to create faster, but weaker versions of bows.\r<br />Powerful Bows: allows the player to create more powerful, but slower bows.\r<br />Leveled Bows 2 - 5: Allow the player to upgrade regular/fast/powerful bows to level 2, 3, 4 and 5.\r<br />Enchanted Bows 1 - 5: Allow the player to upgrade level 5 bows with enchantment levels 1 - 5, for Frost, Shock and Fire. Level 10 bows (level 5 bow, with   level 5 enchantments), are not easy to get, but are worth the trouble if you like to be powerful. The Frost bow of level 10 freezes anyone it    can solid for a full day, as long as their health reaches 50% or below.\r<br />Poisonous Arrows 1 - 5: Allow the player to craft poisonous arrows with levels 1, 2, 3, 4, or 5. It won&#39;t be necessary to upgrade previous arrows, but you need the perks to get the stronger ones, of course.\r<br />\r<br />[b][i][u]Added bows\r<br />[/u][/i][/b]The bows I focussed on for now, include Skyrim&#39;s bows and Dawnguard&#39;s bows, but only the craftable ones that are most often used. I may expand on that later, but for now, I&#39;ve focussed on Dwarven, Elven, Orcish, Glass, Ebony, Daedric and Dragonbone. Since there are no craftable bows at the start, normally, I added upgrades and crafting recipes for Hunting Bows as well. Because of this, you will not need the Smithing Skill. However, if you want more powerful bows than Hunting Bows, you will need to get smithing perks to unlock the other categories - that just makes sense to me.\r<br />\r<br />All bows now have levels 2 - 5 and also Frost 1 - 5, Fire 1 - 5 and Shock 1 - 5. The base bows are counted as level 1, of course, so that gives all bows 10 levels, for both fast, powerful and normal bows. Note that you need a normal bow first, to make it fast or powerful. It&#39;s your choice whether you want to go for enchantments and which ones you want to go for. You could have a fast, powerful and normal bow, all in level 10, with all 3 enchantments, if you would like (not all 3 on 1 bow), but I think that would take you a very long time. Since I want to collect bows, I might go and collect them all. There are well over 450 versions of bows added, so you&#39;ll be collecting for a while (crafting).\r<br />\r<br />[b][i][u]Powerful Bows\r<br />[/u][/i][/b]These bows have 8 base damage more, for all 5 first levels. So a Powerful Hunting Bow, has 8 more base damage than a Hunting Bow. Level 2, has 16 points more than a Hunting Bow, etc. However, once you start applying enchantments through the perks I created, you will not gain more base damage. Only your enchantment power will go up.\r<br />Powerful bows have a drawback though. All 5 levels of powerful bows are slower than their previous levels. In the Creation Kit, speed is given by a number below 1, for most bows. The slowest bow is the Daedric bow. The powerful version of that bow, has 0.4 speed (the original one has 0.5 speed). Level 2 has 0.3, level 3 has 0.2, level 4 has 0.1 and level 5 has 0.05. This means that, although the powerul bows have a great advantage in theory, the speed reduction is VERY noticable. It&#39;s a penalty to still keep it somewhat balanced and in my opinion, you&#39;re best off using the maximum levels of these powerful bows, only if you need to kill something that hasn&#39;t spotted you. I think that the bow will be over-powered if you sneak anyway, but since I don&#39;t like to sneak, I have no idea.\r<br />\r<br />[b][i][u]Fast Bows\r<br />[/u][/i][/b]These bows work the same as Powerul Bows, but they are much weaker. A Fast Hunting Bow, has got 3 less base damage than a normal Hunting Bow and every level only goes up with 3 base damage. However, the speed of every fast bow, will go up with 0.1 per level, giving you extreme speeds with the fastest bows, which should make the low damage a good way to.... slow things down? Bad joke, I know... Moving on&#33;\r<br />\r<br />[b][i][u]Normal Bows\r<br />[/u][/i][/b]There is not much to say about these normal bows. They level up, just like the others, but their speed will not change. Their damage goes up with - you guessed it - 5 for every level and that&#39;s about it. The Hunting Bow can be crafted right away (listed in the Steel section) and the player will still need the Smithing Skill to get other bows, but that&#39;s the same story for the fast and powerful bows, of course.\r<br />\r<br />[b]Auriel&#39;s Bow[/b]\r<br />Auriel&#39;s Bow now has a few upgrades. WARNING: the crafting recipe for Auriel&#39;s Bow requires you to already have one. It duplicates the bow. I have done this, so that you need to get the bow in the game first and to make sure you can &#39;complete&#39; your bow collection. If you want all versions eventually, you&#39;re going to need to be able to duplicate the original bow&#33;\r<br />\r<br />Versions of Auriel&#39;s Bow:\r<br />Auriel&#39;s Bow (vanilla + crafting (duplicate) recipe)\r<br />Auriel&#39;s Bow Lvl 2 (double the damage)\r<br />Auriel&#39;s Bow Lvl 3 (double the damage of Level 2)\r<br />Auriel&#39;s Bow (Fast) (Faster, but slightly weaker)\r<br />Auriel&#39;s Bow (Fast Lvl 2) (Faster, double the damage of Fast Lvl 1)\r<br />Auriel&#39;s Bow (Fast Lvl 3) (Faster, double the damage of Fast Lvl 2)\r<br />Auriel&#39;s Bow (Powerful) (Stronger, but slightly slower)\r<br />Auriel&#39;s Bow (Powerful Lvl 2) (Stronger, slower, double the damage of Powerful Lvl 1)\r<br />Auriel&#39;s Bow (Powerful Lvl 3) (Stronger, slower, double the damage of Powerful Lvl 2)\r<br />\r<br />The bow is duplicated by using: \r<br />Auriel&#39;s Bow\r<br />1 Flawless Diamond\r<br />2 Diamonds\r<br />5 Golden Ingots\r<br />5 Refined Moonstones\r<br />10 Filled Grand Soul Gems\r<br />Elven Smithing (smithing level 30)\r<br />Extra Effect (enchanting lvl 100)\r<br />\r<br />All bows after the original (duplicate) do not require the flawless diamond. They require everything else, though. It should not be easy to upgrade a godly bow. The stronger versions also need &#39;fast bows&#39; as a perk, or &#39;powerful bows&#39; as a perk and &#39;Leveled Bows 5&#39; for Lvl 2 and &#39;Enchanted Bows 5&#39; for level 3.\r<br />\r<br />[b][i][u]Unique(-ish) Bows[/u][/i][/b]\r<br />The 3 unique bows I originally added in Version 2, cannot be created, only found. I also added a new version for each of them in Version 3.\r<br />- Bow of the Vampire (ebony, 35 dmg, 20 critical dmg, 50 HP drain, 20 Frost dmg) can be found on a table in Castle Volkihar\r<br />- Bow of the Wolf (hunting bow, 35 dmg, 20 critical dmg, 50 fire dmg, 1 minute fear (as in the howl of the wolf)) can be found on top of something, next to a weapon rack in Jorrvaskr\r<br />- Bow of the Valkyrie (glass, 35 dmg, 20 critical dmg, 50 shock dmg, 1 minute soul trap) can be found in Riverwood&#39;s river, between the bridge and the mill... but also, maybe not... rivers flow ;)\r<br />\r<br /> There is no cheating chest for these.\r<br />\r<br />Version 3 unique bows:\r<br />The bows of version 2 were updated in version 2.1. They simply cost too much and even after the change. These bows still exsist and can be found as I described above. However, I added a version of each of these bows in version 3, that has an infinite amount of weapon charge (for as far as I know) and these cannot be found. These can only be obtained by killing &#34;Hircine&#39;s Fallen Valkyrie&#34;, &#34;Hircine&#39;s Cured Vampire&#34; and &#34;Hircine&#39;s Loyal Wolf&#34;. It is obvious which enemy carries which bow. You will not come across them often and they are really dangerous, so be careful&#33; These 3 new versions can be combined, along with some other ingredients, to create a fourth added bow: &#34;Hircine&#39;s Bow&#34;. This bow has 75 base damage and drains 50 health, magicka and stamina at once. However, it is the most difficult item to obtain in this entire mod. This bow is the reward the into speaks of.\r<br />\r<br />[b][i][u]Poisonous Arrows\r<br />[/u][/i][/b]There are 5 levels of poisonous arrows. They can be made from 5 different natural ingredients, fire wood and ingots. The ingots are the same as normally, however, I&#39;m not going to spoil the full list.\r<br />Level 1 arrows: do 1 point of poison damage per second, for a full day\r<br />Level 2 arrows: do 5 points of poison damage per second, for a full day\r<br />Level 3 arrows: do 10 points of poison damage per second, for a full day\r<br />Level 4 arrows: do 15 points of poison damage per second, for a full day\r<br />Level 5 arrows: do 20 points of poison damage per second, for a full day\r<br />\r<br />[b][i][u]Sacrificial Arrows\r<br />[/u][/i][/b]These arrows were added in version 3 and they are very hard to obtain. However, they are very powerful. You&#39;re going to need to create them and you will need a few hard-to-obtain ingrediënts to get them. You will also only get 1 arrow at a time. Not worth the trouble? Maybe it is, as these arrows are Daedric arrows with 1000 base damage and an enchantment that drains 1000 health, magicka and stamina at a time. Not all enemies are affected by the enchantment and not all enemies will be killed in one shot. Still, the arrows are really useful to use. And because they are so hard to obtain, I believe you will appreciate them.\r<br />\r<br />[b][i][u]Enemies And Loot (Ingredients)\r<br />[/u][/i][/b]This mod adds a new set of enemies to some of the leveled lists. As most of them are hunters, they have been added to the global leveled lists for animals (for plains, mountains, hills, etc) and to the predator leveled lists. The only exception is that 2 powerful dragons have been added. They have TONS of health and were added to the dragonany leveled list. These dragons will give you a rare Manipulated Dragon Heart, 10 scales, 10 bones and some other items, though, so they are worth killing. And the challenge might be fun, if they are a challenge to you, supreme hunter&#33;\r<br />\r<br />The other enemies are Hircine&#39;s Novice Hunter and higher: Apprentice, Adept, Expert, Excellent, Master, Perfect and Godlike. Godlike does not refer to the hunter being non-human, but to how well he has proven himself to Hircine. All hunters are Nords (I plan on adding more variation later on) and there are both females and males. The stats for the females and males are the same and for most of them, so is their inventory. However, Godlike Hunters use dragon equipment. Males use Dragonplate and females use Dragonscale. And for those in elven armor (Expert Hunters), it is the same story: Gilded for males, normal for females. Just to add some variation to the stuff they drop. The higher the rank, the better the gear. \r<br />All these enemies have Manipulated Hearts and 10 of those can be merged in a cooking pot, to create 1 Manipulated Dragon Heart, of which 10 are necessary to get Hircine&#39;s Bow. They also all carry 3 blood potions, while 100 of those are necessary for Hircine&#39;s Bow. The dragons carry 5 blood potions. All hunters carry a vanilla bow that matches their rank and when they die, they will drop more arrows, with a 20% chance of any level of poison arrow for their rank (so for Godlike Hunters, there is a 20% chance to get a set of 50 lvl 1, 2, 3, 4, or 5 Poisonous Dragonbone Arrows. If you don&#39;t obtain poisonous arrows, you will obtain 50 regular, vanilla arrows. All hunters carry a vanilla bow and there is a chance of them carrying a more powerful leveled or enchanted one, depending on your level. The higher your level, the more bow variations you unlock. However, it is practically impossible to get all variations through killing hunters. Most powerful bows will only appear when you reach levels 40, 50, 60, 70, 80, 90, 100 and anything in between. This is to keep an incentive to actually CRAFT the bows that you want.\r<br />\r<br />Last but not least there are &#34;Hircine&#39;s Fallen Valkyrie&#34;, &#34;Hircine&#39;s Cured Vampire&#34; and &#34;Hircine&#39;s Loyal Wolf&#34;. These enemies are rare, but more powerful than even the Godlike hunters. They carry the new versions of the unique-ish bows and because there is a chance to encounter these enemies more than once and thus obtain their weapons more than once, they are not truly unique weapons. These weapons are key ingredients in creating Hircine&#39;s Bow, so if you want it, you are going to have to find them and kill them before they kill you. The Loyal Wolf is in werewolf form, but will still carry the correct bow and he will also have a fourth blood potion. All 3 of these special enemies, have a guaranteed drop of 50 poisonous arrows. The arrows will match the bow material (the wolf is the exception, having Poisonous Daedric Arrows), but the chances for level 1 arrows are the highest, then lvl2, 3, 4 and finally 5 with the lowest chance of dropping. Still, you will get guaranteed poisonous arrows, so that is pretty cool, huh?\r<br />\r<br />A sidenote: the enemies have the poisonous arrows in leveled lists. The lists have been added to their &#34;Deth Item&#34; slot, which means they will never ever use these arrows on the player. Why? The enchantment carries over to the target, so if the player is hit, the player is enchanted with poison for 24 hours, without a possibility to cure himself. That&#39;s why. I tried many solutions, but have not be able to fix this problem yet. I&#39;m sorry if you&#39;re disappointed about this.\r<br />\r<br />[b][i][u]The Rituals Of Hircine\r<br />[/u][/i][/b]Farengar The Annoying finally did it&#33; He found his use in the game, other than being annoying&#33; He found out how to bless your bows with Hircine&#39;s power, without actually enchanting them. He wrote book about it - a book that&#39;s an important ingredient for every enchanted bow you want to create. If you didn&#39;t know (unlikely): Farengar can be found in Dragon&#39;s Reach in Whiterun and is the wizard that sends you to Bleak Falls Barrow, for a stone tablet that may or may not actually be there. \r<br />\r<br />[u][b][i]Cheating[/i][/b][/u]\r<br />Yes, for those who want to cheat - uh - test... I&#39;ve added a chest that contains all 450+ bows, plus all poisonous arrows, plus all regular bows and arrows. All Arrows even come in packs of 999... how convenient. All you have to do find your way to Jorrvaskr&#39;s backyard, where the targets are displayed. There, you will find the chest. Only drawback for cheaters is that it has a Master Level lock... unless of course, you use the console to open it. Cheating in style and all....\r<br />\r<br />This was for version 1. For all other versions, to cheat, you can open the console and enter help &#34;&lt;rank&gt; Hunter&#34; to get an ID and player.placeatme &lt;ID&gt;&lt;number&gt; to spawn the enemy you desire, or help &#34;&lt;kind of bow&gt;&#34; and player.additem &lt;ID&gt;&lt;number&gt; to add bows you desire. I don&#39;t encourage cheating, but it is possible.\r<br />\r<br />[b][i][u]Requirements\r<br />[/u][/i][/b]Skyrim (I recommend fully updated, as I use the same)\r<br />Dawnguard (I recommend fully updated, as I use the same)\r<br />I don&#39;t think SKSE is necessray, but if you use mods, you might as well grab the fully updated version of that. After all, it&#39;s what I use and many other mods require it.\r<br />I recommend Wrye Bash to create a Bashed Patch (see below for instructions).\r<br />\r<br />[u]Possible conflicts[/u]\r<br />Only mods that make changes to the Archery Skilltree, are likely to cause conflicts. If you want my perks (you could use the cheating chest if you don&#39;t have access to the perks), you need to put my mod below the other perk mod in your load order. Otherwise, if you want to use the perks of the other mod, you need to put that one below mine.\r<br />\r<br />The above was true for version 1, but now that leveled lists are changed, I recommend a Bashed Patch. See below for instructions:\r<br />\r<br />[b][i][u]Bashed Patches[/u][/i][/b]\r<br />If you want to create a Bashed Patch (usually only necessary if you have several mods installed that alter leveled lists), you are going to need Wrye Bash. Once you have that installed, fire up the program and make sure the &#39;mods&#39; tab is open. Scroll to the bottom and you will see &#39;bashed patch 0&#39; or something similar. Right-click on it, choose &#39;Rebuild Patch&#39; and tick Leveled lists and other options you might want. I have 3 of them ticked in total, but I forgot which ones. Something with names, I believe. \r<br />Let Wrye Bash do it&#39;s thing and when it asks you if you want to activate the Patch, click yes. A log will pop up and you can read it if you want, however I always click OK. \r<br />Add the bashed patch to your mod list, at the bottom and keep it at the bottom of your load order. If you add or remove a mod that changes the leveled lists, repeat this process. Other than that, have fun&#33; \r<br />\r<br />[b][i][u]Recommended Mods (only for fun)\r<br />[/u][/i][/b]Too many... don&#39;t get me started. For bows I like Better Bows, Unique Bows and a few others, I cannot play without SkyUI, Convenient Horses, UFO, Sharpshooters and some others. I LOVE Better Vampires, Cloud Of Bats, Moonlight Tales, Bloodmoon rising and many other supernatural mods... I love magics mods, Frostfall, Realistic Needs And Diseases... like I said; too many.\r<br />\r<br />[b][i][u]Installation\r<br />[/u][/i][/b]Nothing special, to NMM will do, or otherwise just drop it into the Skyrim/Data folder. Should be easy enough. Check &#34;Bashed Patches&#34; above for instruction on how to do that and when.\r<br />\r<br />Updating can be done by deleting the previous version and installing the new version. Very simple; can be done by NMM as well. I ALWAYS recommend backups before installing, or uninstalling anything, though. \r<br />\r<br />WARNING: the mod now has a new name, so it will be treated as a different mod&#33; Change the name back to Extended Bow Improvement.esp, or remove the old mod&#33;&#33;&#33;\r<br />\r<br />[b][i][u]Uninstalling\r<br />[/u][/i][/b]For as far as I know, simply removing it from the Data folder should so the trick without problems. NMM can also do that for you. I ALWAYS recommend to make a backup of your files before installing, or uninstalling anything, though.\r<br />\r<br />[b][i][u]Showcase\r<br />[/u][/i][/b]Since I make Let&#39;s Play video&#39;s, a showcase of my mod is bound to come. Stay tuned, or check out 2-Cousins on youtube every once in a while. Has some Skyrim vids already and I plan on trying to play as a Hybrid soon (already have a how-to video on that).\r<br />\r<br />Version 3 showcase will most likely come later.\r<br />\r<br />[b][i][u]Thank you (and future-talk)[/u][/i][/b]\r<br />For as far as I know, this was all information. I might add some other things and other versions in the future as well. I plan on making a file for those with Dragonborn, so that at least the Nordic Bow(s) can be included, as I initially planned. I might make more and more bows upgradeable, as well as the arrows. I might include more enchantments and more different kinds of arrows in the future as well, but I don&#39;t really have much time. If people want to see that though, I will give it some serious thought. I&#39;m also thinking of adding more enemies and unique(-ish) bows.\r<br />\r<br />If you downloaded this, THANK YOU VERY MUCH&#33; I put quite some hours into it and I can use all the support I can get&#33;\r<br />\r<br />[u]Planned Mods[/u][b][i][u]\r<br />[/u][/i][/b]I am working on &#39;The Maze of Trials&#39;; a dungeon in the form of a big maze, in a do-as-you-please format. Might tie a quest into it, but it&#39;s not my original idea to do so.\r<br />\r<br />I am also working on a mod similar to Hircine&#39;s Influence, but it is for Destruction Mages. I am planning on &#39;overhauling&#39; all weapons and magic schools in the same way (as far as possible) as I have &#39;overhauled&#39; the bows and arrows with Hircine&#39;s Influence.\r<br />\r<br />I plan on making several versions of the Maze mod, with and without Hircine&#39;s Influence and other &#39;overhauls&#39;.\r<br />\r<br />I have at least 1 follower mod planned. May become a follower pack. This is uncharted territory for me, though, so I&#39;m not sure how far I will come. If I am successfulm however, I am sort of already planning a second follower. Not a second pack. They shall all be standalone and I aim to make the follower (pack) configurable through an MCM menu or something, so change hair and eye color. And maybe some other things, like essential yes/no, combat style, etc.\r<br />\r<br />[size=6][size=5][size=6]MY OTHER MODS:[/size]\r<br />- The Guardians of Scrolls: http://www.nexusmods.com/skyrim/mods/71479/?\r<br />- Hircine&#39;s Influence: http://www.nexusmods.com/skyrim/mods/64362/?\r<br />- Simple Poison Enchantment: http://www.nexusmods.com/skyrim/mods/75863/?\r<br />- Silver Sword Smithing: http://www.nexusmods.com/skyrim/mods/75865/?\r<br />- Simple Katana Crafting: http://www.nexusmods.com/skyrim/mods/75864?\r<br />- Simple Angel and Fallen Angel Races: http://www.nexusmods.com/skyrim/mods/78861/?\r<br />- Fragcil: The Sword Bound to its Wielder&#39;s Soul: http://www.nexusmods.com/skyrim/mods/75855?\r<br />- Fragcil: The Soulbound Gear: http://www.nexusmods.com/skyrim/mods/78873/?\r<br />- 4 Presets: [size=5]http://www.nexusmods.com/skyrim/mods/76286?[/size][/size]\r<br />[size=2]\r<br />[/size][/size]\r<br />[b][i][u]Custom Models\r<br />[/u][/i][/b]I planned on learning how to mesh and texture weapons, but I don&#39;t have all the software and I lack the time. Plus, adding a new design for all these upgraded bows, may be a bit too much. If there&#39;s someone out there who would like to help me with it, thanks a bunch. However, I don&#39;t expect anyone to do such a huge job for me, so I&#39;m sorry if it disappoints any of you, mod users out there, who love custom models.",
  "categoryId": "73",
  "version": "6",
  "author": "DiaborMagics",
  "createdUnix": "1417988883",
  "updatedUnix": "1427560225",
  "containsAdultContent": false,
  "uploadedBy": "DiaborMagics",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138119",
      "name": "Extended Bow Improvement",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "34",
      "fileName": "Extended Bow Improvement-60597-1-0.rar",
      "uploadedUnix": "1417988850",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2a7a80ef828c65e5064e454ecbe097fe23b9c2d59f7f4b815190cd6c3a46f48c/analysis/1417988881/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extended%20Bow%20Improvement-60597-1-0.rar?fid=1000138119&ttl=1535848420&ri=8192&rs=8192&setec=abe6a8916ad8dd1803491ff8f029b685"
    },
    {
      "fileId": "1000138730",
      "name": "Extended Bow Improvement Version 1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "Extended Bow Improvement Version 1.1-60597-1-1.rar",
      "uploadedUnix": "1418497789",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fb3f32a825d6ac86633493341c0a3f31cbb5b9ae8851d9502aa3b99ae91d676a/analysis/1418497803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extended%20Bow%20Improvement%20Version%201.1-60597-1-1.rar?fid=1000138730&ttl=1535848420&ri=8192&rs=8192&setec=1d36ba7126f574be4c64bf158505ea69"
    },
    {
      "fileId": "1000153300",
      "name": "Extended Bow Improvement Version 2",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "48",
      "fileName": "Extended Bow Improvement Version 2-60597-2.rar",
      "uploadedUnix": "1427547354",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/cfbf12edc312de5632c78b56613a4edd64a2bb151b4cdbe41c02e19c2310f4b9/analysis/1427547363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extended%20Bow%20Improvement%20Version%202-60597-2.rar?fid=1000153300&ttl=1535848420&ri=8192&rs=8192&setec=f83aa65eb0ff1568f7040a774ae57b20"
    },
    {
      "fileId": "1000153327",
      "name": "Extended Bow Improvement Version 2.1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "47",
      "fileName": "Extended Bow Improvement Version 2.1-60597-2-1.rar",
      "uploadedUnix": "1427560225",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/ed699c30ea34f53037b45a19f81a597541f1b9dd4de94fea03ad1d7b14fa6a96/analysis/1427560287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extended%20Bow%20Improvement%20Version%202.1-60597-2-1.rar?fid=1000153327&ttl=1535848421&ri=8192&rs=8192&setec=90f6fdbde9b54c286e30940eb15436b4"
    }
  ]
}