{
  "modId": 60611.0,
  "modName": "Immense donjon Dwemer difficulte hardcore",
  "summary": "  Cet immense donjon dwemer est composé de l&#39;ensemble des donjons d&#39;origine du jeu mit bout à bout dans 1 ordre cohérent, et légèrement modifiés afin de maintenir la cohérence des intérieures entres eux (suppressions des décors bandits par exemple).\r<br />  Tous les monstres de ce donjons ont leurs stats modifiés et difficilles.",
  "descriptionHtml": "  Le but de ce donjon est de faire visiter tous les donjons dwemer du jeu en une seul fois, avec une jouabilité difficile (identique a celle de mon mod refonte jouabilité), et le tout est incorporé dans la quête principale lorsqu&#39;il faut recupérer les parchemins dans griffenoire.\r<br />\r<br />  - Il nécessite uniquement Skyrim pour fonctionner (pas de DLC requis cette fois)\r<br />\r<br />  - Il est composé de 90% des donjons dwemer du jeu mit dans 1 ordre cohérent, et j&#39;ai pris soins d&#39;enlever les décors cassant la cohérence du donjon dans chaques salles (comme par exemple les décors de bandits)\r<br />\r<br />  - Le donjon est très long, comptez 2h30 grand minimum pour le traverser (c&#39;est à dire en rushant et sans se perdre une seule fois).\r<br />\r<br />  - Toutes les créatures du donjon ont exactement les mêmes stats que celles de mon mod refonte jouabilité afin que si jamais mon mod refonte jouabilité ne marche pas à causes de conflicts éventuels avec d&#39;autres mods vous puissiez quand même en profiter d&#39;une certaine manière au sein de mon donjon.\r<br />\r<br />  - Le donjon ce termine bientendu par 2 boss finaux, le dernier (=Dwemer) ne peut pas être vaincu à la régulière au lvl 20 (il y a 1 sorte de strat)\r<br />\r<br />  - Une version HL lvl daedrique des l&#39;armures/armes Dwemer et Falmer se trouvent sur les 2 boss finaux et leurs coffres associées si vous faites le donjon au dessus du level 50 (sinon vous recevrez armes/armure dwemer enchanté, ainsi que l&#39;armure Elfe enchantée, et armes falmer supérieures d&#39;origines)\r<br />\r<br />  - Pour ceux qui ne possèdent pas mon mod de refonte jouabilité, il y a 1 coffre à l&#39;entrée délivrant des armes rapides, 1 anneau de parade, et 1 collier ajoutant 100PV + 10% de vitesse de déplacement afin de pourvoir bloquer ou esquiver les ennemis rapidement et efficacement (si vous possedez déja mon mod de refonte jouabilité, il serai 1 peu trop cheaté de les utiliser)\r<br />\r<br />  - Le donjon se trouve dans la tour de Mzark, l&#39;entrée se trouve coté griffenoire, et la sortie est verouillée (cela dit on peut comme raccourci entrer par la tour de Mzark directement et activer mon donjon seulement lorsque on est dans griffenoire)\r<br />\r<br />   -Si vous faites mon donjon en dessous du lvl 20 et surtout si vous n&#39;êtes pas en difficultée standart je vous souhaite sincerement bonne chance &#33; ^^\r<br />\r<br />  Voila je pense avoir tout dit, n&#39;hesitez pas à regarder mes vidéos de démos, ainsi que lire le Lisez moi du mod et la note contenue dans le coffre apportant des précisions sur les équipements de départs (concernant la vidéo du perso level 20 il y a 1 changement de skin de l&#39;arme rapide en raison du fait que moviemaker a buggé, j&#39;ai du refaire le tournage du début de la vidéo et j&#39;avais modifié le skin des armes de départs entre temps).\r<br />\r<br />\r<br />Autres mods que j&#39;ai sorti :\r<br />\r<br />- Refonte complete jouabilité Skyrim. Lien : http://www.nexusmods.com/skyrim/mods/60320/?\r<br />\r<br />\r<br />Je sortirai aussi bientot les autres donjons selon le même principe et le même type de difficultée :\r<br />\r<br />- Le passage de Hrothgar : les grottes du jeu lvl 10+ situées au tout début de la montées des 7000 marches pour gravire le mont hrothgar et aller voir les grises barbes (en cours de developpement actuellement et tous les animaux sauvages y seront représentés)\r<br />\r<br />- Les mines de Pénombris : les mines du jeu lvl 30+ dans la base principale de la main d&#39;argent (toutes les classes de PNJ y seront représentés)\r<br />\r<br />- Le labyrinthe : les ruines Draugr du jeu lvl 30+ dans le labyrinthe (tous les morts vivants y seront représentés c&#39;est a dire : Draugr, DraugrMagic, squelettes, ombre, mere fantomatiques, quelques PNJ fantômes, mais aussi ombre corrompue de la quete de Meridia)\r<br />\r<br />- Les forts : forts et ruines humaines lvl 50+ HL, je n&#39;ai pas encore décidé ce que je mettrai commes ennemis dedans mais j&#39;y mettrai l&#39;ensemble des loots daedriques probablement et reglerai la difficultée pour que ca soit faisable au lvl 50 + 2 alliés (recruté + invoqué) nous accompagnant au minimum.  Pour les ennemis je pense nottament y mettre des drémoras, mais si vous avez des idées à me suggerrer autre que de télécharger du net de nouvelles créatures n&#39;hésitez pas &#33;\r<br />\r<br />- Lorsque j&#39;aurai fini tout cela ci-dessus je fabriquerai probablement 1 donjon de toutes pièces contenant que des nouvelles créatures que j&#39;aurai téléchargées et de nouveaux stuff que j&#39;aurai téléchargés.",
  "categoryId": "91",
  "version": "1.1",
  "author": "UTHDINGER Emmanuel",
  "createdUnix": "1418051154",
  "updatedUnix": "1418216730",
  "containsAdultContent": false,
  "uploadedBy": "manu67310",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138180",
      "name": "La citee de griffenoire",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1630",
      "fileName": "La citee de griffenoire-60611-1-0.7z",
      "uploadedUnix": "1418051149",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/db50ed07e50728bccef4eca44547db75f45831549db8cc049f04c5017037af83/analysis/1418051163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/La%20citee%20de%20griffenoire-60611-1-0.7z?fid=1000138180&ttl=1535848444&ri=8192&rs=8192&setec=131a27f1383ea789a88cc1b0accf23d2"
    },
    {
      "fileId": "1000138371",
      "name": "Citee de griffenoire version finale",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1631",
      "fileName": "Citee de griffenoire version finale-60611-1-1.7z",
      "uploadedUnix": "1418216730",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/70570945e451452b78875ce632d8801892f4c6286704eee79d7236c100416bd3/analysis/1418216767/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Citee%20de%20griffenoire%20version%20finale-60611-1-1.7z?fid=1000138371&ttl=1535848444&ri=8192&rs=8192&setec=a877dbf8f5459e25518620e2f80132cd"
    }
  ]
}