{
  "modId": 60652.0,
  "modName": "The Candle Makers Part One v 1.3.0",
  "summary": "The Candle Makers, Part One\r<br />In the caves and dungeons the everlasting candles burn. The Candle Makers received the secret of the Eternal Flame from dragons themselves. Now, in the darkness, there is a new threat to Skyrim, a growing bandit guild and their mysterious elven sponsors.",
  "descriptionHtml": "[color=#ffffff][size=3][center][size=6]The Candle Makers, Part One v 1.3.0[/size][/center]\r<br /> \r<br />In the caves and dungeons the everlasting candles burn. The Candle Makers received the secret of the Eternal Flame from dragons themselves. Now, in the darkness, there is a new threat to Skyrim, a growing bandit guild and their mysterious elven sponsors. \r<br /> \r<br />The Candle Makers have been the quiet protectors of the weak and vulnerable in Skyrim since the time of the first Nords. Under cover of darkness and with the stealth of a wisp of smoke, they are everywhere and nowhere at once --  subtly guiding the fate of thousands without ever being known. They are both powerful and clandestine. \r<br /> \r<br />The Candle Makers enlist your help to defend the land during this time of unrest in the ultimate battle for the very heart of Skyrim. There is an ancient fortress, towns, ruins, dungeons, caves, mines and even a city within the catacombs of The Throat of the World. In Part One you will explore the fortress and face challenges as you infiltrate the Overlord Bandit Guild in order to learn its secrets. You must find out what forces guide this new army in Skyrim and find a plan to stop it, before it&#39;s too late.  \r<br /> \r<br />The Candle Makers, Part One, is your introduction to this ancient order with more adventures to come.\r<br /> \r<br /> \r<br />[center][size=5]If you like it, endorse it&#33;[/size]\r<br />\r<br />To Start: Follow the instructions and look at the &#34;Urgent Request&#34; note in your Book inventory.\r<br /> \r<br />[size=5]Features:\r<br /> \r<br />2+ hours of adventure\r<br /> \r<br />10 quests\r<br /> \r<br />12 new voiced NPCs\r<br /> \r<br />30+ new cells[/size][/center]\r<br />\r<br />These cells are only the ones used in the quests. There are a dozen more that are part of planned expansions that you can explore.\r<br /> \r<br />[size=5]Lots of loot:[/size] Seriously, you will get rich and work hard for it.\r<br /> \r<br />[size=5]Required Level:[/size] Bandit enemies are leveled, so you should be able to handle yourself if you have good armor, skills and weapons at any level above 30, but there are no level requirements. \r<br /> \r<br />[size=5]Difficulty:[/size] These quests are designed to be harder than most. You will almost always be attacked by several NPCs at once. Follow the quests instead of just killing everything or you will be overwhelmed and probably die. Or, go in, agro the bandits and be faced with a flood of enemies -- just for fun. \r<br /> \r<br />[size=5]Game Requirements:[/size] Skyrim (DLCs are not needed)\r<br /> \r<br />[size=5]Hardware Requirements:[/size] It will work. Use of large individual light sources in low ambient light situations requires a better GPU for best results. If your lighting fall off is set too low you might need too increase monitor brightness. In most areas you will interact with several NPCs at once, including combat, which eats more CPU time than vanilla Skyrim, particularly when spells are casts. A faster than minimum CPU is necessary for best frame rates. \r<br /> \r<br />[size=5]Conflicts:[/size] There have been no known reported conflicts. After thousands of downloads (including Steam) I have only had two people report mod conflicts that were not resolved. The Candle Makers involves areas of Skyrim outside of towns and away from vanilla quests. Native files have not been modified. If you have a problem, please report it. I will post it here.\r<br />\r<br />[size=5]Updates:[/size]\r<br />v 1.3.0 fixed problems with the BSA file in v.1.2.0. Do not use files named &#34;Candlemakers1v1_2&#34; (bsa and esm). Please delete these files. If loaded last, these files could cause problems with the latest updates. \r<br />Use files named &#34;Candlemakers&#34; (bsa and esm). Sorry for the mix up.\r<br />v 1.2.0  addresses confusion some players have when they do not follow quest markers at the end of game.\r<br />v 1.0.2 Lets players kill NPCs that are quest objectives and still allows those quests to be completed.\r<br />\r<br />[center] ____________________________________________________________\r<br />\r<br />\r<br />[size=5]The Great Carlotta Voice Vote&#33;[/size]\r<br />\r<br />\r<br />Many people like the voice of Carlotta the Spatula -- others, not so much. I put it to a vote. If you want Carlotta&#39;s voice to stay as it is, let me know. If you hate her voice with a deep passion that knows no bounds, let me know that too. I will keep it or change it depending on your comments.\r<br /> \r<br />Thank you.\r<br />\r<br /> ____________________________________________________________[/center]\r<br />\r<br />[size=4]FAQ: I have no dialogue and some characters have blank faces.[/size]\r<br />Do not use the version named &#34;Candlemakers1v1_2&#34;.  The BSA file is bad. Use a current update v 1.3.0 which will have files named &#34;Candlemakers&#34; (.esm and .bsa). You can delete &#34;Candlemakers1v1_2&#34; files. Sorry for the mix up. My learning curve with Nexusmods has been a little rougher than I had hoped.\r<br /> \r<br />[size=4]FAQ: I cant see quest objective markers.[/size]\r<br />Many quests stack, meaning a new one starts before an old one ends. You must manually go into your Journal (press J) and select the most recent quest. Then you will see a new quest objective marker. \r<br />\r<br />[size=4]FAQ: Feed me more&#33; Now&#33;[/size] (This is the most common form of this question.)\r<br />There are Six Parts planned. Much of Part Two is already complete, and I am planning for a February release.\r<br /> \r<br />[size=4]FAQ: I want to make and place candles.[/size]\r<br />Me too. Try &#34;Lanterns and Candles&#34; by mentilreq or the related &#34;Wearable Lanterns&#34; by Chesko. I might offer candle weapons in future mods.\r<br /> \r<br />[size=4]FAQ: I can&#39;t find all of the places in your screen shots.[/size]\r<br />If you follow New South Road from the Fortress until it emerges on the south side of the mountain, you will pass through a couple of small towns that will be used in future expansions.\r<br /> \r<br />[size=4]FAQ: Why do you have slanted roofs on houses in a cave?[/size] (Yes, people ask this question.)\r<br />To keep out little rocks and dripping ground water (and to use existing models to keep the mod under 100 MB).[/size][/color]",
  "categoryId": "35",
  "version": "1.3.0",
  "author": "Nemo Stone",
  "createdUnix": "1418195526",
  "updatedUnix": "1418611407",
  "containsAdultContent": false,
  "uploadedBy": "NemoStone",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138901",
      "name": "The Candle Makers Part One v 1.3.0",
      "version": "1.3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29189",
      "fileName": "The Candle Makers Part One v 1.3.0-60652-1-3-0.7z",
      "uploadedUnix": "1418611407",
      "modVersion": "1.3.0",
      "virusScanUrl": "https://www.virustotal.com/file/a5a94470785a3b723086e09deb0c95904aa28e0eec2e91e1a23880bf876ac0d1/analysis/1418611452/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Candle%20Makers%20Part%20One%20v%201.3.0-60652-1-3-0.7z?fid=1000138901&ttl=1535848522&ri=8192&rs=8192&setec=d6d62e30da205bf91834608b2faaee2a"
    }
  ]
}