{
  "modId": 60653.0,
  "modName": "The Legend of Zelda - Link - Preset for ECE and Racemenu",
  "summary": "Link the main protagonist Hero from Nintendo's The Legend of Zelda, with a more realistic look. I based him on his Twilight Princess concept mostly. This is a CME-ECE Enhanced Character Edit and Racemenu preset, your choice so that you can play as my version of Link, you will need to download ECE or Racemenu for this to work. Now go on an adventure",
  "descriptionHtml": "[color=#93c47d]Link the main protagonist Hero from Nintendo's The Legend of Zelda series, with a more realistic look. I based him on his Twilight Princess concept mostly although he's a bit different. This is his newest incarnation for Skyrim based on how I think LInk should look if he were in a more realistic game. [/color]\n<br />\n<br />\n<br />[color=#b6d7a8][u][s]Yes I know, he is missing his hat...Couldn't get any Link hat to work with the hair they all made him bald. So couldn't use a hat, plus to your surprise this is actually a Nord couldn't get his eyes to work with Elves or faceshape like how it is. Wanted a wood elf originally but oh well.... I am still happy with my work nonetheless. I think he could probly be converted to an elf though and keep his same appearance I believe I've heard of that being done before but Idk. Oh and pay no attention to Ganondorf being short like literally Ganon Dwarf, since it was a copy of my player character spawned through console it glitched just now noticed that, he loaded wrong being small an all lol. He's actually gigantic, taller and well... monstrous is one word to put it. Normally makes Link look small. [/s] [/u] Nevermind I've worked some things out and the newest Version will have his hat working flawlessly and earrings as well.. YES!!! :D\n<br />However...Those will need to be downloaded separately.\n<br />[b]\n<br />\n<br />[size=3]GET THEM HERE:[/size] [url=https://www.nexusmods.com/skyrim/mods/82317]https://www.nexusmods.com/skyrim/mods/82317[/url][/b]\n<br />\n<br />\n<br />[b][size=5]UPDATE is HERE, [/size][size=6]Racemenu version added![/size][size=5] And currently V4.0 is up for both ECE and Racemenu. :D\n<br />\n<br />And there may be a dark surprise in store for you, yes check the files closely.. my Dark Link preset is also in there so have fun! \n<br />\n<br />[/size][/b][size=3]Note for ECE users there is a problem with presets, not with Link per say but in general. If you have many hair/eye/makeup mods installed and load the preset sometimes it won't load properly.. I've created a solution to this.. Soon I will be adding save files of Link,  so if he doesn't appear properly load these saves for your downloaded version, then type showracemenu in console and then exit, and it will ask you if you want to save the face to a slot...just overwrite and save over the slot that your version of LInk is in and then wa-la! He should now be adapted to your game's mods. And his ECE slot will load in any save now upon starting a new game or in the race menu. If you want him to look exactly as he does in my screenshots then follow the instructions at the bottom of the page.[/size]\n<br />[/color]\n<br />\n<br />[color=#1e84cc][u][b][size=4]Don't forget to endorse! [/size]\n<br />[/b][/u][/color]\n<br />\n<br />\n<br />[color=#b6d7a8][size=3]Prologue:[/size][/color]\n<br />\n<br />[color=#fff2cc][size=3]Link was slowly walking through the forest.... just then he sees an old lady lying on the ground, her long gray ponytail was hanging from her head face covered, quickly he rushed to help her he looked closely at her face only to see it covered by a hood as he went to pull off her hood he was surprised to see that it actually wasn't an old lady at all, but was a dead bokoblin in robes, sacrificed by servants of the dark lord Ganondorf as a distraction, dark sorceress magic then appears around the body... it's body then vanishes as Ganondorf calls it back to keep it prisoner in a jar prison in the underworld until he releases it again into the living world later, a group of Ganon's minions attacked Link from behind one managed to stab his arm barely grazing him though he managed to cover it with cloth to stop the bleeding, Link defeated most shortly after that. After a failed attempt on the hero's life Ganondorf devised another plan, he had his minions place a treasure chest in the woods, where Link continued on his quest...he saw the treasure eager to open it, he takes steps towards the chest then opens it to reach inside, he sees a silver rupee upon reaching for it, it soon fades away and a needle then springs up from the chest and hits LInk's handed causing blood to drip...Link's is surprised and shocked by this he quickly leaves... After a drop of the Hero's blood was spilt from his cut, Ganondorf's minions managed to snatch some of it Link had no knowledge of their plan, they brought a vial of it to a place where they would do a dark ritual, resurrecting The Demon King, this time he didn't feel like waiting around for Link to show up and discover he'd returned instead he read tomes his servants brought him, about opening veils in which would open a ripple where Link and Zelda would be pulled through against their will appearing in front of where he would stand when he is in the flesh of existence once more, he simply needed the right passage to be read by his servants then he would be completely free. Only then could he obtain the Triforce, until all failed... his servants read the wrong column, Instead of releasing him, and summoning them the portal pulled him in.... he tried grabbing onto a stone wall through the portal to escape but to no avail he was swooped into the dark portal as was Link and Zelda from where they originally were. Now they all 3 are in a new world known as Skyrim, what lies ahead is now up to you![/size][/color]\n<br />\n<br />[color=#b6d7a8]---------------------------------------------------------------[/color][color=#b6d7a8]-END[/color]\n<br />\n<br />\n<br />[color=#fce5cd]As Link will you embrace your path of being heroic saving innocent lives, doing countless quests, slaying monsters, bringing peace to the lands. Or will you settle for a normal life in this new world, perhaps change your purpose even. The choice is yours! \n<br />\n<br />And what choices will Dark Link make? Will he continue his path of wickedness, become the hero of is own story.. conquer a world, or will he settle down for a normal life among Skyrim's people.. that's your choice player. [/color]\n<br />\n<br />\n<br />[size=5][color=#fff2cc]---------------------------------------------------------------------------------------------[/color]\n<br />\n<br />[/size][size=5][color=#b6d7a8][u][s]\n<br />[/s][/u]Good news!!! Followers are made now and will be released at some point!  TO BE ANNOUNCED\n<br />I recommend you track this file, and endorse if you like it..also track me too if you want to stay up to date with everything. As my Link is a follower now of the current version 4.0 and will be released as soon as everything works out. He's nearly there! So is Zelda!  :)\n<br />\n<br />[/color]\n<br />\n<br />\n<br />[/size][color=#ff0000][size=6]REQUIRED MODS:[/size][/color][color=#fff2cc] [/color]\n<br />\n<br />[size=5]First off you'll need this, The Skyrim Enhanced Character creation this is how most players are able to perfect their characters and make unique followers, characters and npc's:[/size][url=http://www.nexusmods.com/skyrim/mods/12951/?][color=#f4f4f4] [/color][color=#6fa8dc][size=5]http://www.nexusmods.com/skyrim/mods/12951/?[/size][/color][/url]\n<br />[size=5]The file above is very important if there is no character creation mod then there will be no Link.\n<br />\n<br />\n<br />If you are using the Racemenu version then you'll need the Racemenu mod, otherwise he will not show up, using both Racemenu and ECE together is very buggy and can cause problems so I'd advise against doing so. Here's Racemenu:  [url=https://www.nexusmods.com/skyrim/mods/29624/]https://www.nexusmods.com/skyrim/mods/29624/[/url]\n<br />\n<br />[/size]\n<br />\n<br />\n<br />\n<br />[size=5]Then you'll need Apachii Sky hair for the hair types, download Apachii Sky Hair Male V1.2 For Elves,here is the link it can be found on the files tab: [/size][url=http://www.nexusmods.com/skyrim/mods/10168/?][color=#6fa8dc][size=5]http://www.nexusmods.com/skyrim/mods/10168/?[/size][/color][/url]\n<br />\n<br />[size=6]\n<br />[b][size=6][color=#ff0000]NOTE:[/color][color=#f4f4f4] MODS BELOW ARE NOT NEEDED ALTHOUGH THEY ARE HIGHLY RECOMMENDED BECAUSE THEY IMPROVE OVERALL QUALITY EVEN THOUGH THEY ARE IN THE REQUIRED SECTION TOO, JUST IGNORE THOSE ONES IF YOU DON'T WANT THEM THEN ONLY GRAB THE ONES THAT YOU DO NEED. I just think they work best. [/color][/size][/b]\n<br />\n<br />[color=#f4f4f4]You should be all set now after those files above[/color][/size][size=3]. But if you want to add even more accuracy and make him look even more so like how he does in the newer pictures if he doesn't already, then I recommend you download these below:[/size]\n<br />\n<br />[size=4]\n<br />[/size][size=3][b]This is for the current version of Link V4.0, as I've updated this page.. Here is what the newest Link uses.[/b]\n<br />\n<br />[b]If you want him to look Younger then download Better Males Skintone [/b][/size][size=3]by [/size][b][size=3]Chris57 and FavoredSoul[/size]:  [size=3][url=http://www.nexusmods.com/skyrim/mods/2488/?]http://www.nexusmods.com/skyrim/mods/2488/?[/url]  \n<br />I use the Faces - YoungerGeonoxFacesWithoutBeard) for face, and for body I use Underwear - Slip)  Both can be downloaded on that page, Link's skin file the underwear slip version contains no nudity that's the clean version.\n<br />[color=#ff0000]Warning Adult Content, Viewer Discretion is Advised.\n<br />\n<br />[/color][/size][/b]\n<br />[size=4]Another mod I use for Link is Femfeet Redesigned for realistic feet the male version on that page for realism: [/size][url=https://www.nexusmods.com/skyrim/mods/82390/]https://www.nexusmods.com/skyrim/mods/82390/[/url]\n<br />[size=4]He uses [/size]FFR Better Males Slip Underwear) \n<br />Let this mod overwrite Better males so that the feet get updated, so click yes to all in your mod manager.\n<br />\n<br />Another body mod he uses with better Males is Smooth Body Textures For Better Males And SOS: [url=https://www.nexusmods.com/skyrim/mods/26145/]https://www.nexusmods.com/skyrim/mods/26145/[/url]\n<br />Link uses the file (Smooth Male Body - NEVERNUDE Version with underwear)\n<br />This mod needs to override better males so that it can give better younger skin. So in mod manager when installing this after better males click yes to all. \n<br />\n<br />\n<br />\n<br />[size=5]Also I recommend,\n<br />[/size]\n<br />\n<br />[size=4]Better makeup for SKSE:  [url=https://www.nexusmods.com/skyrim/mods/31665/]https://www.nexusmods.com/skyrim/mods/31665/[/url]﻿\n<br />Link uses the Male Version on that page called (High Res Male Face Makeup for SKSE)\n<br />This really helps in making him appear much younger. Install this last after Better males, feet redesigned and smooth body.. \n<br />[/size]\n<br />\n<br />[size=4]High res dirt maps and war paints:  [/size][url=http://www.nexusmods.com/skyrim/mods/4283/?]http://www.nexusmods.com/skyrim/mods/4283/?[/url]\n<br />Not because of Link, I just think it's cool!\n<br />\n<br />[size=4]And for eyes I use these High Quality Eyes by Xenius for Link, I use the darker ones though because the lighter felt too bright to me: [/size][url=http://www.nexusmods.com/skyrim/mods/498/?][size=4]http://www.nexusmods.com/skyrim/mods/498/?\n<br />[/size]\n<br />[/url][size=5]\n<br />[b]install order for mod manager if you use my recommendations is as follows. \n<br />1st install Better Males [size=3]YoungerGeonoxFacesWithoutBeard [/size]first for face\n<br />2nd install better males Underwear_Slip for skin on that same page.\n<br />3rd: Install Femfeet Redesigned (FFR Better males slip underwear)\n<br />4th: Install Smooth Body Textures for better males and sos\n<br />5th: Install Better Makeup for SKSE Males version last:\n<br />6: He should be good to go, I'd also recommend you download the eyes by xenius if you want him to look completely like Link and Apachii's Sky hair, [u][s]it won't be long until I get the Twilight Princess hat and tunic uploaded then he'll be exactly as he is in the pictures. Keep your eyes peeled! (O  __  O)[/s][/u][/b]\n<br />They are uploaded separate here:  [url=https://www.nexusmods.com/skyrim/mods/82317]https://www.nexusmods.com/skyrim/mods/82317[/url]\n<br /> :)  \n<br />\n<br />Link Twilight Princess Tunic Revision by Simdrew1993 myself here:  \n<br />Sorry at this time it is unavailable until the files are published. \n<br />\n<br />If you want his Hylian Tunic then go here I actually made an alternative Twilight Princess Version of it which is darker, more subtle, less contrasted less saturated, the one you see in my screenshots is my version though I have yet to upload it, I plan to at some point soon along with a nice new working hat, until then here is the original by alteredthebeast: [b] [url=http://www.nexusmods.com/skyrim/mods/2588/?]http://www.nexusmods.com/skyrim/mods/2588/?[/url][/b]\n<br />\n<br />If you want his Master Sword download that here: [url=http://www.nexusmods.com/skyrim/mods/32615/?]http://www.nexusmods.com/skyrim/mods/32615/?[/url]\n<br />\n<br />For the Hylian Shield download that here: [url=http://www.nexusmods.com/skyrim/mods/34718/?]http://www.nexusmods.com/skyrim/mods/34718/?[/url][b][size=5][url=http://www.nexusmods.com/skyrim/mods/498/?]\n<br />\n<br />[/url][/size][/b][color=#ff0000]NOTE: Ganondorf will be updated at some point after Link is updated. I also highly recommend you download Ganondorf as well if you would rather feel powerful playing as a demon warlord who destroys the world instead of saving it: [url=http://www.nexusmods.com/skyrim/mods/59971/?]http://www.nexusmods.com/skyrim/mods/59971/?\n<br />[/url][/color][/size]\n<br />\n<br />[color=#3d85c6][size=5][b]Or download my Princess Zelda and live a quiet or adventurous life, or maybe Dark Zelda and wreak havoc and terror on Skyrim's people: [url=https://www.nexusmods.com/skyrim/mods/73239/?]https://www.nexusmods.com/skyrim/mods/73239/?[/url] [/b][/size][/color]\n<br />\n<br />\n<br />[color=#b6d7a8]Followers of my characters are being made, by myself and with some help from others..most will be standalone vanilla followers initially and may be running on custom framework and voiced in the future later down the line as I've handpicked a few actors and Actresses who may be able to play them. Ganondorf will be voiced and have his own custom framework thanks to the modder tons for helping set that up he will be a very unique follower. So I will share them with you all at some point! I recommend you track me, and check out Tons (TheObstinateNoviceSmiths) work too if your interested, he's a great modder and an excellent writer: [/color][url=https://www.nexusmods.com/skyrim/users/5718878]https://www.nexusmods.com/skyrim/users/5718878[/url][color=#b6d7a8]  [/color]\n<br />[color=#b6d7a8]Feel free to browse through the rest of my work, I have alot to offer even if I don't have it all published yet. Plenty more to come!  ^__^[/color]\n<br />\n<br />[size=4]- FIND ME - [/size]\n<br />[size=4]------------------SOCIAL LINKS HERE---------------------------------[/size]\n<br />[size=4]http://simdrew1993.deviantart.com/[/size]\n<br />[size=4]https://www.facebook.com/Simdrew1993[/size]\n<br />[size=4]http://simdrew1993.tumblr.com/[/size]\n<br />[size=4]http://www.modthesims.info/member.php?u=3027486[/size]\n<br />[size=4]https://twitter.com/Simdrew1993[/size]\n<br />[size=4]http://simdrew1993.blogspot.com/[/size]\n<br />[size=4]http://simdrew1993.livejournal.com/[/size]\n<br />[size=4]-------------------CREDITS---------------------------------------------------[/size]\n<br />[size=4]Link created in Skyrim By Simdrew1993[/size]\n<br />[size=4]Bethesda for making The Elder Scrolls Skyrim[/size]\n<br />[size=4][b]Nintendo for creating Link, and The Legend of Zelda.[/b]\n<br />\n<br />\n<br />[b]Additional Credits Below: [/b]\n<br />\n<br />[b]Simdrew1993, for retexturing Link's original Tunic creating Twilight Princess Link and Dark [/b]\n<br />[b]Link's tunic out of it and making it standalone, and redesigning the hair textures and tunic [/b]\n<br />[b]textures. [/b]\n<br />\n<br />[b]Quechus9 for his Original Link hat and hair from part of his The Legend of Zelda Skyrim mod: which I redesigned for my Link: [/b]\n<br />[b][url=http://www.nexusmods.com/skyrim/mods/30353/? ]http://www.nexusmods.com/skyrim/mods/30353/? \n<br />[/url][/b]\n<br />[b]And his Youtube channel here:  [url=http://www.youtube.com/quechus13]www.youtube.com/quechus13[/url][/b]\n<br />\n<br />[b]\n<br />\n<br />JKalenad: Blade of evil's bane, and Hylian Shield, and Hero's Bow:  [/b]\n<br />[b][url=http://www.nexusmods.com/skyrim/mods/40615/?﻿]\n<br />[/url]﻿[url=http://www.nexusmods.com/skyrim/mods/40615/?﻿]http://www.nexusmods.com/skyrim/mods/40615/?﻿[/url]﻿\n<br />[/b]\n<br />\n<br />[b]Chief-01:   [/b][url=http://chief-01.deviantart.com/art/LoZ-Model-Texture-Resources-Some-are- incomplete-311134061][b]http://chief-01.deviantart.com/art/LoZ-Model-Texture-Resources-Some-are-[/b]\n<br />[b]incomplete-311134061[/b][/url]\n<br />\n<br />[b]\n<br />CaptainRC for converting the Master Sword, and Hylian shield over to Skyrim. [/b]\n<br />\n<br />[b]\n<br />AlteredTheBeast, for making the original texture designs which I used then heavily modified:  [url=https://www.nexusmods.com/skyrim/mods/2588?tab=posts]https://www.nexusmods.com/skyrim/mods/2588?tab=posts[/url][/b]\n<br />\n<br />[b]\n<br />Chris57 and FavoredSoul, Better Males Underwear Slip, and Faces - [/b]\n<br />[b]YoungerGeonoxFacesWithoutBeard:  [url=http://www.nexusmods.com/skyrim/mods/2488/?]http://www.nexusmods.com/skyrim/mods/2488/?[/url][/b]\n<br />\n<br />[b]\n<br />Urshi, Smooth Body Textures for better males: Nevernude Underwear addition:  [/b]additional\n<br />[b]credits Neovinci for underwear meshes. BaronDavid and Imperator3 for underwear textures  [/b]\n<br />[b][url=http://www.nexusmods.com/skyrim/mods/26145/?]http://www.nexusmods.com/skyrim/mods/26145/?[/url][/b]\n<br />\n<br />[b]\n<br />Xenius, High Quality Eyes:  [url=http://www.nexusmods.com/skyrim/mods/498/?]http://www.nexusmods.com/skyrim/mods/498/?[/url][/b]\n<br />\n<br />\n<br />[b]Leito86, Femfeet Redesigned FFR Better Males Slip Underwear:[/b]   [url=https://www.nexusmods.com/skyrim/mods/82390/]https://www.nexusmods.com/skyrim/mods/82390/[/url]\n<br />\n<br />[b]\n<br />Diethardt, Better makeup for SKSE males:  [url=http://www.nexusmods.com/skyrim/mods/31665/? ]http://www.nexusmods.com/skyrim/mods/31665/? [/url][/b]\n<br />\n<br />[b][size=4]\n<br />\n<br />END Of Credits:[/size][/b][/size]",
  "categoryId": "26",
  "version": "V4.0",
  "author": "Simdrew1993",
  "createdUnix": "1418202957",
  "updatedUnix": "1524659074",
  "containsAdultContent": false,
  "uploadedBy": "Simdrew1993",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138356",
      "name": "The Legend of Zelda - Link - Character Preset CME-ECE",
      "version": "V1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9044",
      "fileName": "The Legend of Zelda - Link - Character Preset CME-ECE-60653-1-0.zip",
      "uploadedUnix": "1418202838",
      "modVersion": "V1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1010df43b94cc2bb889dbbcc759fd5f64d28276c5ade78b3f54528f3413073e4/analysis/1418202850/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Legend%20of%20Zelda%20-%20Link%20-%20Character%20Preset%20CME-ECE-60653-1-0.zip?fid=1000138356&ttl=1535848524&ri=8192&rs=8192&setec=be2d091428db71962c8b1337c20b44b5"
    },
    {
      "fileId": "1000171435",
      "name": "The Legend of Zelda - Link - Character Preset CME-ECE",
      "version": "V3.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1054",
      "fileName": "The Legend of Zelda - Link - Character Preset CME-ECE-60653-V1-2.zip",
      "uploadedUnix": "1439323184",
      "modVersion": "V3.0",
      "virusScanUrl": "https://www.virustotal.com/file/0de5ee21cb3e4554c432071235311a35df24d90ed6060ef4a9777ee36c96937a/analysis/1439323207/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Legend%20of%20Zelda%20-%20Link%20-%20Character%20Preset%20CME-ECE-60653-V1-2.zip?fid=1000171435&ttl=1535848524&ri=8192&rs=8192&setec=a0faaf01711d446cc60981eab12de34d"
    },
    {
      "fileId": "1000271468",
      "name": "The Legend of Zelda - Link Preset for ECE",
      "version": "V4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "The Legend of Zelda - Link Preset for ECE-60653-V4-0.7z",
      "uploadedUnix": "1524658269",
      "modVersion": "V4.0",
      "virusScanUrl": "https://www.virustotal.com/file/8c7a51786eed9a0b3dedaecc1181cdc1f7a72499efa0076423b111e4b9170ea7/analysis/1524658443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Legend%20of%20Zelda%20-%20Link%20Preset%20for%20ECE-60653-V4-0.7z?fid=1000271468&ttl=1535848524&ri=8192&rs=8192&setec=985e01c0a5b87e963d8c09affc8a304c"
    },
    {
      "fileId": "1000271469",
      "name": "Link ECE Saves",
      "version": "V4.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5014",
      "fileName": "Link ECE Saves-60653-V4-0.7z",
      "uploadedUnix": "1524658722",
      "modVersion": "V4.0",
      "virusScanUrl": "https://www.virustotal.com/file/84736962ab1466ba261df23321dcc92fb55fa4b31631e758a2019450a6f2c9ba/analysis/1524658820/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Link%20ECE%20Saves-60653-V4-0.7z?fid=1000271469&ttl=1535848525&ri=8192&rs=8192&setec=eff0959245f3f211c6e15d544b73cbb5"
    },
    {
      "fileId": "1000271470",
      "name": "The Legend of Zelda - Link Preset for Racemenu",
      "version": "V4.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "597",
      "fileName": "The Legend of Zelda - Link Preset for Racemenu-60653-V4-0.7z",
      "uploadedUnix": "1524659074",
      "modVersion": "V4.0",
      "virusScanUrl": "https://www.virustotal.com/file/f360185ddcc9641830103d343c730537cf447b055ce6f38baca03fdf184c0bf5/analysis/1524659167/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Legend%20of%20Zelda%20-%20Link%20Preset%20for%20Racemenu-60653-V4-0.7z?fid=1000271470&ttl=1535848525&ri=8192&rs=8192&setec=4380e327b619a849ffb0a620dcb2ed78"
    }
  ]
}