{
  "modId": 60687.0,
  "modName": "Sun Elves (Heliormers)",
  "summary": "Adds a race called the Sun Elves or Heliormers.",
  "descriptionHtml": "About the Mod: I felt that vanilla skyrim lacked races, so I made my own. This mod as you know, is a playable race known as the Sun Elves. They are 50% resistant to fire, and 25% weak to ice. They can wield a type of magic known as sun magic, and also have two basic healing spells. \r<br />\r<br />Backstory: \r<br />Sun Elves ,also known as Heliormers, were created by the daedric princess Meridia to banish undead. Though after a while they began to evolve into much more greater beings. As they expanded into tamriel, they became corrupted with greed as they looked over all the land. The one thing the Heliormers coveted the most, was the sun. Much beauty the sun held, a ball of glowing fire. They spent their life studying it, trying to unlock its secrets. Kynareth saw this, and she knew if they somehow figured out how to steal its power, the balance of nature would be destroyed (as Meridia gave them great powers to defeat the undead they no longer worried about). Kynareth called out to Akatosh. She told him to help her with this situation. Akatosh called on the Heliormers and showed them the sun, knowing that those who survived were the only worthy of channeling its powers. Each of the ones that survived, were given a tiny piece of the sun, and channeled it until they mastered it and then created a new type of magic, Sun Magic. The only ones able to use this magic are Sun Elves. \r<br />\r<br />Updates: \r<br />Version 1.02 Added a disease that only Sun Elves can contract, added dialog to npc&#39;s to notice that you are a sun elf, added a few loading screens that have Sun elves in them. \r<br />Version 1.03Added a new spell similar to the Fire storm spell, changed duration of the disease from 1 hour to until you get it cured. \r<br />Version 1.04\r<br />Added craftable armor and weapons (Bow of the Heliormer) and a retextured Elven Sword both have sun enchants, Added craftable arrows, &#33;All Craftables require Quicksilver and Moonstone Thats It&#33; \r<br />Changed  Sun Ball and Racial Stats (E.G. Changed starting stamina, skills, and health regeneration) Removed one heal spell. Changed Extinguished Disease to 10 minutes instead of forever",
  "categoryId": "34",
  "version": "1.04",
  "author": "Teratronic",
  "createdUnix": "1418333471",
  "updatedUnix": "1418332470",
  "containsAdultContent": false,
  "uploadedBy": "Shadowdeaths7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138487",
      "name": "SunElf",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14193",
      "fileName": "SunElf-60687-1-04.7z",
      "uploadedUnix": "1418332470",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/bf78c2ea22094033a6fdb6177ecd97d87918b0270fef24162c04c897b9c4565f/analysis/1418332510/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SunElf-60687-1-04.7z?fid=1000138487&ttl=1535848588&ri=8192&rs=8192&setec=2db67ffe70ea0264241c196d40383122"
    }
  ]
}