{
  "modId": 60744.0,
  "modName": "Dawnguard Merchant Original Behaviour Mod for Unofficial Dawnguard Patch",
  "summary": "Dawnguard Merchant Original Behaviour Mod for Unofficial Dawnguard Patch",
  "descriptionHtml": "This is a very small mod made to restore the behaviour of Dawnguard Merchants modified by the Unofficial Dawnguard Patch. The UDGP mod refers to this change as &#34;Dawnguard members will not offer to sell things to the player if they have joined the Volkihar Vampires. (Bug #15136)&#34;. I disagree with this change as Pacify is meant to make friends of enemies & so they should offer the same services as if you were not a vampire. Also UDGP didn&#39;t fix the Dawnguard merchants completely... with UDGP if you pacify them they will actually still sell to you they just don&#39;t have access to their merchant chests when you access their store. Instead they sell some swords & cross bows only. Beyond this they will also still train you in skills which seems paradoxical in nature... &#34;we won&#39;t sell you items but we&#39;ll make you a better killer&#34;.\r<br />This mod achieves restoration of the original behaviour by modifying the form IDs in the faction section that UDGP modifies to change CITC - Condition Count from 1 to 0 for all the modified Dawnguard members.\r<br />I hope this doesn&#39;t cause any conflicts or troubles however it&#39;s my very 1st attempt at making any changes to Skyrim myself instead of just using the Nexus Mod Manager to add mods.\r<br />Load the ESP after any of the Unofficial Patch mods you may be using to ensure the settings work.",
  "categoryId": "95",
  "version": "1.0",
  "author": "JunglePredator",
  "createdUnix": "1418512370",
  "updatedUnix": "1418512364",
  "containsAdultContent": false,
  "uploadedBy": "JunglePredator",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138757",
      "name": "Unofficial Dawnguard Patch Merchant Fix.7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Unofficial Dawnguard Patch Merchant Fix.7z-60744-1-0.7z",
      "uploadedUnix": "1418512364",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0becca6e641526914b4f8100946cebf577b4bd8e4fb0cafe45a026b996cef7fb/analysis/1418512382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unofficial%20Dawnguard%20Patch%20Merchant%20Fix.7z-60744-1-0.7z?fid=1000138757&ttl=1535848670&ri=8192&rs=8192&setec=f9f20b8ac416c9ba26e7219c1cd0d29c"
    }
  ]
}