{
  "modId": 60741.0,
  "modName": "Bass Cannons AIO",
  "summary": "Crazy fun bass cannons with dozens of song choices to terrorize Nazzem.",
  "descriptionHtml": "I absolutely love the bass cannons created by [url=http://steamcommunity.com/id/Cordelephant]Cordelephant[/url] over at the steam workshop, although hitting the limit with my mods and never experimenting with the creation kit or anything, I had to start merging mods together.  This is the first mod I have altered/merged and I&#39;m quite proud I was able to keep everything working fine =)\r<br />\r<br />For those of you who are unaware of what the bass cannons are, they are ....staffs? that well... MAKE YOU WANT TO JAM AND TERRORIZE&#33; they are one of the funnest mods I&#39;ve ever used in skyrim, no not lore friendly, they are just for fun, and I assure you with these cannons you will have fun =)\r<br />\r<br />[center][youtube]6apGNCWecqw[/youtube][/center]\r<br />\r<br />For all of you who are familiar with the bass cannons, I have merged all of the cannons into one chest, renamed cannons 1-9 to include 0&#39;s in front of them (just for inventory purposes), and only included 1 book that has all of the cannons in it.\r<br />\r<br />The chest can be found on the left side of Dragonsreach toward the back of the building (where it/they have always been)\r<br />\r<br />Also While editing this mod I found a note that Cord included (although never saw in game) and i took the liberty of including the note into the book (just flip a couple pages past the last page)\r<br />\r<br />I hope it&#39;s ok that I&#39;m sharing this here and the original mod(s) can be found:\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=184546806\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=312512515\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=195685303\r<br />\r<br />Thanks to Cordelephant for creating these fun toys and if you guys like my merged mods, I for sure will have more to come (if it&#39;s even ok for me to) and ill probably enhance each mod i merge... in some way or another.",
  "categoryId": "40",
  "version": "1.0",
  "author": "DrCustUmz",
  "createdUnix": "1418637023",
  "updatedUnix": "1418637023",
  "containsAdultContent": false,
  "uploadedBy": "RyFabbro",
  "primaryFile": null,
  "files": []
}