{
  "modId": 60766.0,
  "modName": "Realistic Wooden Mannequins - CBBE - UNP",
  "summary": "Replaces existing mannequins with realistic wooden mannequins.",
  "descriptionHtml": "[size=5]Description:[/size]\r<br />This initial release only has female mannequins and requires either a CBBE or UNP compatible body and texture installed. Later I may do a male version if there&#39;s enough interest.\r<br />\r<br />This mod changes the mannequins in the game to a realistic wooden mannequin with the anatomical shape you would expect for a person but with a wooden texture - much better than the vanilla game&#39;s wooden mannequin textures. As a result they look less creepy while still preserving the original ideals of the game&#39;s designers. They also happen to be proper female mannequins rather than males which don&#39;t exactly display female armors very well.\r<br />\r<br />Some of you may remember my [url=http://www.nexusmods.com/skyrim/mods/26266]Statue Sculpture Mannequins[/url]. The knowledge I gained from making those assisted in my creation of these. While my statues were great without an ENB they don&#39;t look so great with one and lately I&#39;ve been looking at home designs (specifically some of Elianora&#39;s work) and they just seem like wooden mannequins would go better with the decor, color-wise. And so, these were born. It was quick and easy - to be honest I spent more time packaging this thing up than I did making it&#33;\r<br />\r<br />[color=#ff0000][size=5]READ THIS:[/size][/color] Screenshots provided are not indicative of how the mannequin bodies will be shaped in your game - [u]they will use your existing female body meshes.[/u]\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/60766-1-1418640846.gif[/img]\r<br />\r<br />[size=5]Installation:[/size]\r<br />If you have NMM you should be presented with an installer. Choose whether you want the Vanilla or HearthFires version. The difference is that the Vanilla version doesn&#39;t change any mannequins introduced in HearthFires and the HearthFires version does, along with having a dependency to the HearthFires DLC. I understand not everyone has it though so I have the Vanilla version available.\r<br />\r<br />Next you&#39;ll choose whether you have a CBBE or UNP type body. Of note, you don&#39;t need CBBE or UNP specifically, just bodies that are compatible with their textures, but as the mod draws on your existing models and textures it&#39;s important that you choose the correct one.\r<br />\r<br />By default 100 weight mannequins will be installed. If you&#39;d prefer 50 weight mannequins they have been provided for manual installation within the file archive in the folder &#34;[Optional] Weight-50&#34; - you will have to install this manually if you want it.\r<br />\r<br />I recommend only installing this before you start a new game. If you don&#39;t you may experience issues such as neck gaps or discolored faces, or even more bizarre ones like a wrong face or body. [color=red]Warning:[/color] if you choose to add this to an existing save I recommend creating a backup save before doing so as these things tend to get baked into saves and you would end up having to troubleshoot potential issues with the mod whether you kept it installed or not at that point. The issues are of course minor in nature and easily fixable with console commands but it&#39;s still good practice. There are however no scripts involved in this so aside from facetint data and NPC weight data being baked into saves for mannequins this mod is completely safe.\r<br />\r<br />The general procedure to correct neck seams is to use the following command after clicking the NPC in question: setnpcweight ### with ### being the intended weight. After you do this close the console and the neck gap should have disappeared. Now you would use disable then enable as at this point the face will have discolored with the facetint data being lost once the weight was changed. Follow that with a quicksave and a quickload and if it didn&#39;t fix it try to disable/enable again. Unfortunately, this doesn&#39;t seem to work with mannequins for me. So, uh... good luck with that if you run into it&#33;\r<br />\r<br />[size=5]Credits:[/size]\r<br />Stock wood texture from Mayang&#39;s Free Textures: [url=http://www.mayang.com/textures/]LINK[/url]\r<br />CBBE by Caliente - base texture for CBBE version (specifically my CBBE Innies modified version)\r<br />UNP by dimon99 - base texture for CBBE version\r<br />\r<br />[size=5]Incompatible Mods:[/size]\r<br />-Any mod that changes the mannequin race (Manakinrace) or overwrites files that are added with this installation.\r<br />\r<br />Find another? Let me know.\r<br />\r<br />[size=5]Known Issues:[/size]\r<br />-Neck gaps can occur if wrong NPC weight values are baked into an existing save, this can be fixed with console commands or by simply starting a new game. It&#39;s not the fault of this mod, it&#39;s just how data is baked into saves by the game engine.\r<br />-Discolored faces may result from setting an NPC&#39;s weight with console commands but this can be resolved by disabling and enabling the NPC along with a quicksave and quickload.\r<br />-Mannequins walking around? That&#39;s a vanilla bug but there are mods that correct that issue - it&#39;s not introduced by this mod.\r<br />-Incorrect face or body race? Something is incorrectly baked into your save, try starting a new game. If that doesn&#39;t work you have a mod conflict.\r<br />-People are incapable of reading and/or grasping the concept that these mannequins use their own existing body meshes and may be prone to making stupid comments. No solution currently available.\r<br />\r<br />[size=5]Version History:[/size]\r<br />1.0 - Initial release, female only. CBBE & UNP available.\r<br />1.1 Hotfix - This hotfix addresses a neck gap issue that surely would have arisen by my accidentally forgetting to include the FaceGeom mesh data, the hotfix will update 1.0 to 1.1 for the default 100 weight variant.\r<br />1.1 (full) - This is essentially just the combination of 1.0 and the 1.1 hotfix along with FaceGeom data for the 50 weight variant included for manual installation if it&#39;s the preferred weight. This is more or less the release that 1.0 originally should have been - just adding some meshes I forgot to include.",
  "categoryId": "29",
  "version": "1.1",
  "author": "XunAmarox",
  "createdUnix": "1418574543",
  "updatedUnix": "1418593604",
  "containsAdultContent": true,
  "uploadedBy": "XunAmarox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138829",
      "name": "Realistic Wooden Mannequins - CBBE - UNP",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24476",
      "fileName": "Realistic Wooden Mannequins - CBBE - UNP-60766-1-0.7z",
      "uploadedUnix": "1418573036",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/00003be1592740fa9ccf9e066885e84ae9809c67c2498d7c05ee40035a29a48e/analysis/1418573071/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Wooden%20Mannequins%20-%20CBBE%20-%20UNP-60766-1-0.7z?fid=1000138829&ttl=1535848718&ri=8192&rs=8192&setec=49f52289e107eafc79d00ba62214ad05"
    },
    {
      "fileId": "1000138869",
      "name": "Realistic Wooden Mannequins - Hotfix for v1-0 neck gaps",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "120",
      "fileName": "Realistic Wooden Mannequins - Hotfix for v1-0 neck gaps-60766-1-1.7z",
      "uploadedUnix": "1418592513",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/27824409e0515fb12ee542a7526a18df5599fdd0e6d615cc47a690f9cf76e3f3/analysis/1418592543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Wooden%20Mannequins%20-%20Hotfix%20for%20v1-0%20neck%20gaps-60766-1-1.7z?fid=1000138869&ttl=1535848719&ri=8192&rs=8192&setec=c8400eba591b54fa03abbb5cf6d032d7"
    },
    {
      "fileId": "1000138877",
      "name": "Realistic Wooden Mannequins - CBBE - UNP v1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24577",
      "fileName": "Realistic Wooden Mannequins - CBBE - UNP v1-1-60766-1-1.7z",
      "uploadedUnix": "1418593604",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bbd483f8eabbc12bcc4d21789bb925bf0a753c9a0b8590e322cde88930ee9a14/analysis/1418593634/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Wooden%20Mannequins%20-%20CBBE%20-%20UNP%20v1-1-60766-1-1.7z?fid=1000138877&ttl=1535848719&ri=8192&rs=8192&setec=8add76044e9108e98a30814ea940adc5"
    }
  ]
}