{
  "modId": 60765.0,
  "modName": "Skyrim Easy mode",
  "summary": "Txt file for a bunch of stuff to play the story without searching for materials and what not.",
  "descriptionHtml": "Hey guys, just a simple Txt file containing a bunch of materials, gems and what not that i made from 1 other person mod and adding a few bits of my own. The main point of this was just so if people wanted to jump in and play the story without having to search for every type of material at some point, they could use this without worry.\r<br />\r<br />I would advise that you find a mod or something to adjust your carry weight, as it will make you very heavy, i personally use the Sacred ring of jeebus mod (http://www.nexusmods.com/skyrim/mods/18172/?) but others for altering weight are out there. (when find one i use, will link, requires fishing it out though :P)\r<br />\r<br />Using it is easy, but i&#39;ll explain each step for those who somehow find mine first before any of the millions out there :P\r<br />1. once you&#39;ve downloaded it, open it in a program like 7zip or Winrar\r<br />2. take out the .txt file and put it into the skyrim folder (example of file path: C:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim)\r<br />3. once in there, load up skyrim and open console commands with ` key (should be next to 1)\r<br />4. type Bat Skyrimstart, then press enter.\r<br />5. Enjoy :)\r<br />\r<br />Credit for the first material list goes to yoo203, for his All Gems Crafting_materials ingots alchemy_ingredients (http://www.nexusmods.com/skyrim/mods/3894/?) Nice chap with a few mods, but they look great, so please go give him a visit :)\r<br />\r<br />Will hopefully add an enchant list once i get a reply from Akimb0\r<br />\r<br />All i added was a few materials (such as dragon scales/bones), giving you 1000000 gold right off the bat and giving skill ups to have 100 in everything.\r<br />A word of warning with the level ups, if you put points into health/stamina/magicka to quickly, at least in my game, it&#39;s likely going to crash. i dont know why but i have found that going very slowly shows almost no signs of crashing (it did once when i got impatient, who know right)\r<br />\r<br />Hope you guys enjoy it. Might possibly be the only thing i do as i have no modding skills. (if anyone comes along this and suggests a good tutorial or something, i&#39;ll try and give my hand at it :), so who knows)",
  "categoryId": "40",
  "version": "1",
  "author": "TakanaKyoshi",
  "createdUnix": "1418565486",
  "updatedUnix": "1418564929",
  "containsAdultContent": false,
  "uploadedBy": "TakanaKyoshi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138811",
      "name": "Skyrim Easy mode",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Skyrim Easy mode-60765-1.rar",
      "uploadedUnix": "1418564929",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c3f138c5fbf274264d6f5e15075223f7fd51cb2e1f045abae680260749aa9087/analysis/1418564943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Easy%20mode-60765-1.rar?fid=1000138811&ttl=1535848717&ri=8192&rs=8192&setec=0cca9135b9985ea7ef9d3a8d45ac0b89"
    }
  ]
}