{
  "modId": 6077.0,
  "modName": "Adjusted smithing weights",
  "summary": "Makes all ingots much heavier in accordance with the weight of items that you can craft.",
  "descriptionHtml": "[color=Greenyellow][u]Description[/u][/color]\r\nIn vanilla Skyrim you can craft a steel armor that weights 35 points using 5 ingots and 3 leather strips that weight just 5.3 points in total, and that\\'s just one example, look here [url=http://uesp.net/wiki/Skyrim:Forge]for more (marked with red)[/url]. 29 points of matter out of thin air - and that stupid [url=http://uesp.net/wiki/Skyrim:Nurelion]Nurelion[/url] think that White Phial is awesome!!\r\n\r\n\r\nThis mod changes the weights of all ingots so that the total weights of components placent into forge will be roughly equal to the weight of the item you craft. \r\n\r\nThe recipes for the smelter are changed - now you will need much more pieces of ore to smelt an ingot of pure metal, because real ore contains too much admixtures of minerals other than required. As a result, crafting yourself a set of high-end armor and wepons is more challenging.\r\nWARNING: mining enough ore to make full set of items or train Smithing skill to 100 is VERY time-consuming now. Because it is in real life. If you want to get it more easily - grab the ingots (there are lots of them), not ore. \r\n\r\n[color=Greenyellow][u]Details[/u][/color]\r\nIt seems that ingot size is equal to real-world \\'Good Delivery\\' gold ingot. In-game weights are calculated from the weight and density of this real-world ingot.\r\nThe weights of Ore is unchanged, so:\r\nIron ingot weights 10 \\'pounds\\' and requires 20 pieces of ore\r\nSteel ingot requires the same plus one piece of Corundum ore\r\nEbony and Orichalcum ingots require 40 pieces of ore\r\nRefined Malachite - 12 pieces\r\nRefined Moonstone - just 4 pieces\r\nSilver ingot requires 13 pieces of Silver ore, and Gold ingot requires 25 pieces\r\nPrice of all items is adjusted accordingly.\r\nIn the beginning there are ~75 pieces of Ebony ingots in Ore Veins, and they do replenish over time, so it is quite possible to forge full sets of Ebony and Daedric items - but these weapons and armors are rare, so if you want to make it, you would need to explore the world quite a lot! With the vanilla abundance of ebony ingots all the Legion would wear Ebony, not Steel.\r\n\r\n[color=Greenyellow][u]What about the jewelry?[/u][/color]\r\nThis mod consists of two parts - the first one deals with materials that are used for weapons and armor, and the second one with jewelry. When the weight of gold ingot is set to real values, it becomes 50 times heavier than any golden necklace. As it would be inappropriate churn out 50 Diamond necklaces every time you go to forge, I have changed the materials required to craft the golden jewelry. Now you use [b]coins[/b] instead of Gold ingots - because in Skyrim they are made of gold!! Just sell Gold ingotsto get the money, and make jewelry from the money! Nothing could be done with the silver at the moment - silver jewelry still requires ingots, weights less and now it even costs less, so I would propose simply not to craft silver jewelry unless you absolutely need to - it\\'s simply non-profitable.\r\n\r\n[color=Greenyellow][u]Installation[/u][/color]\r\nUse the Nexus mod manager\r\nIf you like only the changes I\\'ve made to ingots used for armor and weapons, just disable the \\'Adjusted Jewelry components.esp\\' in your favorite plugin manager or Skyrim Launcher.\r\n\r\nor\r\n\r\nDownload, extract and copy ESP files into the \\'Data\\' directory of Skyrim:  \\'<Steam folder>\\\\steamapps\\\\common\\\\skyrim\\\\Data\\' by default. \r\n\r\nActivate the esps you want in Skyrim Launcher : \r\n\r\n- \\'Adjusted Smithing components weights.esp\\' for ingots used to craft armor and weapons\r\n- \\'Adjusted Jewelry components.esp\\' for jewelry\r\n\r\n----\r\nYes, I know that it would be better to adjust the weight of weapons and armor - but it would rise lots of compatibility issues with other mods, and Wrye Bash is not there yet to resolve them. This mod, on the other hand, does not confilct with mods that add new weapons and armor.",
  "categoryId": "27",
  "version": "1.0",
  "author": "Leoriq",
  "createdUnix": "1326470492",
  "updatedUnix": "1326470651",
  "containsAdultContent": false,
  "uploadedBy": "leoriq",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19405",
      "name": "Adjusted smithing weights",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Adjusted smithing weights-6077-1-0.zip",
      "uploadedUnix": "1326470651",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/98572ead2ea5077662a5e0bc3df42cc4b2744b446dd205e4538abf0a3e4c7356/analysis/1406607902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adjusted%20smithing%20weights-6077-1-0.zip?fid=19405&ttl=1535763271&ri=8192&rs=8192&setec=bd0888ab6c1718332c83140fff878978"
    }
  ]
}