{
  "modId": 60795.0,
  "modName": "Parting Glass - Peter Hollens version",
  "summary": "This adds a group of singers to the Four Shields Tavern singing the song &#39;Parting Glass&#39; as preformed by Peter Hollens",
  "descriptionHtml": "As I was listening to Parting Glass preformed by Peter Hollens, I decided that it would sound great in Skyrim, so I asked if I could use it.\r<br />\r<br />Unfortunately, the individual tracks were not available, which means that all of these singers &#39;sing&#39; exactly the same. \r<br />They can be found in Four Shields Tavern. I chose this tavern because I think it is the least used one by modders. \r<br />\r<br />Credits:\r<br />Obviously, all the credits go to Peter Hollens for preforming this song, and allowing me to use it. \r<br />Also, credits should go to the one who wrote the piece, but that person unfortunately is unknown...\r<br />\r<br />Bugs:\r<br />- Sometimes, the lines of music are not being played at the same time. I think it has to do with Skyrim having to load all the pieces of music, and if it also has to do a lot of other stuff, it loads the pieces a slight bit after one another. \r<br />I tried to fix it as much as possible, but it sometimes does load right, and sometimes doesn&#39;t. \r<br />- I intented on making it so that you can ask them to sing it again, and while you can ask it, they (probably) don&#39;t sing it again. I am still trying to figure out why that is. \r<br />-Something beyond my reach to repair is the fact that there are some pauses in the song. This has to do with the way skyrim handles dialogue. I would have added the whole song in one piece, but that caused CTD&#39;s.",
  "categoryId": "61",
  "version": "1.00",
  "author": "ErianDragonborn",
  "createdUnix": "1418665762",
  "updatedUnix": "1418665741",
  "containsAdultContent": false,
  "uploadedBy": "ErianDragonborn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000138980",
      "name": "Parting Glass preformed by Peter Hollens",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90921",
      "fileName": "Parting Glass preformed by Peter Hollens-60795-1-00.zip",
      "uploadedUnix": "1418665741",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/a918cc1673ba4a4fd115c58b4a81fbbeccc50290c4e93bd3eed099f589c1b1fa/analysis/1418665817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Parting%20Glass%20preformed%20by%20Peter%20Hollens-60795-1-00.zip?fid=1000138980&ttl=1535848785&ri=8192&rs=8192&setec=ca6914653f9d3051b1c1f95ad645ecd7"
    }
  ]
}