{
  "modId": 60809.0,
  "modName": "Breezehome Sweet Home",
  "summary": "A reimagined Thane&#39;s abode with immersive lore-friendly style and functionality. 3 floors all in one cell, modestly redesigned with new basement, kitchen, library/study, outdoor front patio, backyard fire pit, and more. So comfortable and functional, you may never want to leave the house&#33;",
  "descriptionHtml": "[img]http://i401.photobucket.com/albums/pp92/ChazzRanger/Banner.jpg[/img]\r<br />[size=3]Requirements\r<br />Just Skyrim. No DLC, SKSE, or ENB required&#33;\r<br />\r<br />Installation\r<br />Install with NMM (recommended), or manually extract to your Skyrim main folder.\r<br />\r<br />Un-installation\r<br />Un-install with NMM, or manually remove\r<br />Breezehome Sweet Home.esp from your Skyrim/data folder.\r<br />[line]\r<br />~Description\r<br />\r<br />Remember when you first walked into your new upgraded Breezehome, thinking how awesome it was? Remember 10 minutes later when you realized how much it actually lacked and was in bad need of renovations? BHSH aims to give Whiterun&#39;s new dragon-slaying Thane a much better place to live, while maintaining the original Breezehome feel and remaining consistent with the rest of the Skyrim world. Breezehome existed before our Dragonborn came along, and its redesign reflects that; no special &#34;Dragonborn-specific conveniences&#34;, just realistic design elements and attention to detail, but still fully equipped for any new owner. Immersive realism so immersively realistic, it&#39;s worth shouting about&#33; Just... not in the house, it makes a terrible mess. You kids take all that yelling outside&#33;\r<br />[line]\r<br />~Features\r<br />\r<br />[/size][list][*][size=3]BREEZEHOME REDESIGNED from floor to ceiling, including the floors and ceilings. The place now looks and feels solid inside and out, with a patched-up roof and a loft floor that doesn&#39;t look like you&#39;ll fall through it. The redesign is slightly larger than the original Breezehome on the inside, but retains the basic shape of the house (i.e. no &#34;magical&#34; rooms that you can&#39;t see on the outside). The new large-ish basement area is, obviously, underground and can&#39;t be seen from the outside. Not even with Dwemer Goggles.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]NEW LARGE-ISH BASEMENT AREA with armoury, combat practice, alchemy, enchanting and basic blacksmithing. Details such as crafting-specific storage, room ventilation, and even the clutter have been thought-out to maintain a sense of realism, with no elements that wouldn&#39;t seem right, even in the crazy, magical world of Skyrim. (Like, who ever thought a smelter in your basement would be a good idea? That there&#39;s a fire hazard&#33;)[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]REDESIGNED LOFTY LOFT with a decent sized library/den, and somewhat epic-looking bedroom. What? Oh, Lydia sleeps in your bed with you now. Isn&#39;t that what we all wanted? But sorry, no room for any additional housecarls, stud. And NO CHILDREN (see below).[/size][/*]\r<br />[/list][size=3]\r<br />[list][*][size=3]And NO CHILDREN. Seriously, do not Hearthfire-upgrade your new home to adopt children, or they will sleep in your nice new kitchen and things will get messy real quick.[/size][/*]\r<br />[/list][/size][size=3]\r<br />[/size][list][*][size=3]NICE NEW KITCHEN with lots of functional storage so you can separate and store every. single. different. type of food in its own container like the OCD maniac you are. Plenty of harvestables including a nod to the original Breezehome hanging herb rack (ok, actually just the original Breezehome herb rack moved to a different room), plus harvestable meats&#33; All kitchen harvestables are set to respawn/are replenished by Lydia who apparently goes to the market when you aren&#39;t looking.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]REDESIGNED LIVING AREA retains the original &#34;there&#39;s a campfire in my livingroom&#33;&#34; layout, with many added design details including more seating, more storage, room ventilation, and a quaint little bathroom.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]QUAINT LITTLE BATHROOM with basic amenities. Yes, you can sit on the cozy rustic toilet, but the cozy rustic bathtub is currently just eye candy. However, it does make splashy noises when activated&#33; And that never gets old. I may eventually somehow upgrade to include a real working bathtub, because cleanliness is next to Talosness, but... TBH, this is the one area I&#39;m still torn over. I really like the look and feel of the bathroom, but it isn&#39;t really functional and it isn&#39;t consistent with the rest of Skyrim&#39;s disturbing lack of facilities. A no-bathroom version can be made if requested.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]AWESOME FIREPLACES for cooking, blacksmithing, and just chillin&#39; in front of. I sure loves me some fireplaces. You can never have too much fire in your home, amirite? (Unless caused by having a smelter in your basement, see above)[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]BETTER FURNITURE so you don&#39;t look like a bum when you bring housecarls over. Nothing that looks overly extravagant compared to the rest of Whiterun though, everything fits the theme. You like your furniture to say &#34;Sure, I&#39;m the Dragonborn and I like nice things, but I&#39;m not a snobby furniture d**che.&#34;[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]STUPID AMOUNT OF STORAGE intuitively and conveniently placed, with details like grouped storage containers for ease of use, unique container crates and mead barrels with sound effects, and pre-removal of the randomly-generated junk usually found in drawers and containers - &#34;This house... is clean.&#34; [/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]FRONT PATIO and BACKYARD FIRE PIT complete with the amazing comfort of chairs. Chairs&#33; Nice views also included.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]LYDIA D. HOUSECARL gets a new hairstyle, new leather armor, new AI packages and new idle markers to keep her busy around the house. She generally sleeps, eats meals, and practices with sword and bow on a schedule most days when at home. She now looks less manly and has more personality (when at home, at least). New leather armor? I know, she majors in heavy armor not light, but she looks way better in leather, and being a good Thane, you&#39;ll upgrade her armor for her one day anyway. She&#39;s sworn to carry your burdens dude, it&#39;s the least you can do.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]ROOM UPGRADES will fill your new home with joyous, not-havok-settled clutter, well-placed and well-thought out for increased realism. Most added clutter items are playable, but some are static (which is irrelevant if you use Jaxonz Positioner; if you purchase ANY house in Skyrim, you need this most excellent mod). Not upgrading still lets you love every stick of furniture in that place, just keeps most shelves and tables empty for convenience if you&#39;d like to decorate YOUR way.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3]FULLY OPTIMIZED via occlusion planes, so even with 3 floors full of awesome stuff, you should be able to run BHSH with a potato.[/size][/*]\r<br />[/list][size=3][line]\r<br />~Compatibility\r<br />\r<br />BHSH is obviously incompatible with other mods that alter Breezehome, but if you understand load order it shouldn&#39;t be an issue. I haven&#39;t tested BHSH with mods that do large overhauls like JK&#39;s Whiterun or Dawn of Whiterun, but guaranteed there will be some conflicts there. Mods that change Lydia will likely overwrite her new AI packages. Time permitting, I&#39;ll do my best to make BHSH compatible with other popular mods, as long as it doesn&#39;t require completely redesigning or removing main features.\r<br />[line][/size]\r<br />[size=3]~Known Issues and Common Bugs\r<br />Most issues that may arise with BHSH relate to known pre-existing Skyrim bugs and glitches, such as problems with display racks and bookshelves. They can often be reset by simply leaving the cell and re-entering. I&#39;ve set everything up to greatly reduce any chance of random weirdness, but there are some things to watch for:\r<br />\r<br />[/size][list][*][size=3][i]Weapons and armor may become stuck in display racks.[/i] This alone is a good enough reason to add [url=http://www.nexusmods.com/skyrim/mods/52583/?]Jaxonz Positioner[/url] to your mod list. It takes a little longer to set things up nicely in display racks, but you can set things up exactly how you want and - more importantly - you can get your stuff back.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3][i]Mannequins sometimes think they&#39;re alive.[/i] They&#39;re creepy enough as it is, but when you walk in the room and they&#39;ve OBVIOUSLY moved position, and they&#39;re STARING AT YOU? Nopenopenope. [url=http://www.nexusmods.com/skyrim/mods/10652/?]Vanilla Mannequin Script Fix[/url] will take care of your wandering coat racks, and even has options for cool action poses.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3][i]Lydia doesn&#39;t follow her new AI or acts weirder than usual.[/i] Depending on the situation, Lyds may not perform all her intended tasks in a timely manner. Skyrim NPC AI has the equivalent IQ of a [url=http://static-2.nexusmods.com/15/images/110/803017-1343153029.jpg]wooden bucket[/url], so cut her some slack.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3][i]There&#39;s a child&#39;s bedroom in your nice new kitchen.[/i] Again, if you have the Hearthfire DLC, do not upgrade Breezehome for adoption. You just aren&#39;t ready for that level of domestic responsibility, Dovahkiin. You still have some [url=http://www.homestarrunner.com/sbemail58.html]dragons[/url] to slay.[/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3][i]Harvestables aren&#39;t respawning.[/i] BHSH is set to respawn in 10 days (except containers), but Skyrim&#39;s respawn system seems to have a mind of its own at times. Note that you need to be out of the cell for 10 days (240 hrs) for the cell to reset. I recommend [url=http://www.nexusmods.com/skyrim/mods/50346/?]Fast Respawn[/url] to speed up Skyrim&#39;s respawn rate. [/size][/*]\r<br />[/list][size=3]\r<br />[/size][list][*][size=3][i]Everything in your home is exploding.[/i] Either you [url=http://www.quickmeme.com/img/8c/8cc34ba3f3412b3ccf272162eb7600fa39283aab233abaa52bcc1ea0fe783ce2.jpg]drank too much Mountain Dew again[/url], or your framerate is going above 60fps, which really messes with Skyrim&#39;s physics. Cap your framerate at 60fps for smooth gameplay and less poltergeist.[/size][/*]\r<br />[/list][size=3]\r<br />Anything else that goes squirrely, let me know in the comments.\r<br />\r<br />&#34;Welcome to your new home&#33;&#34;\r<br />- Whiterun Home Decorating Guide [/size]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Chazz Ranger",
  "createdUnix": "1418727978",
  "updatedUnix": "1418727978",
  "containsAdultContent": false,
  "uploadedBy": "chazzranger",
  "primaryFile": null,
  "files": []
}