{
  "modId": 60813.0,
  "modName": "Vault of whiterun and Jarls Personal Armoury",
  "summary": "always seemed weird to me that the jarl gave you items from his personal armoury yet there is not one in dragonsreach, nor is there a vault or a place for the wealth of the jarl. now there is and alot of treasure for you sneaky thief types",
  "descriptionHtml": "After much thought and messing around i decided to make another simple yet fun mod, this mod adds a little mission to sneak into the personal armoury of the Jarl of Whiterun and also into his Personal Vault. \r<br />\r<br />There is a key that is needed from a certain someone... since it is his vault after all to steal the Prize Jewel in the Vault Which is &#34;The Heart of the Province&#34;... a large Diamond Worth 10,000, within the vault is a vast amount of gold, ridiculous amount of gems and some expensive items from oaristys modder resource...http://www.nexusmods.com/skyrim/mods/16525/? (many thanks for that BTW :)) \r<br />\r<br />\r<br />There are guards and they are set to protect the wealth in the vault so they wont like you in there but they wont attack off the bat. set them up as normal guards but not had time to test much with this as life sometimes keeps you too busy for modding.\r<br />\r<br />\r<br />this i will leave as it is for people to mess around with and will put it as a modders resource &#34;or something for people to build upon&#34; except obviously you would need to put a heads up and thanks for the resource i used which is not my own material.\r<br />\r<br />\r<br />This mod Requires the latest update plus Dragonborn and Dawnguard DLC&#39;s&#33;&#33;&#33;\r<br />\r<br />have fun and enjoy the little things and if anyone wants it to be a little harder to get in i can sort that also... good luck :)",
  "categoryId": "35",
  "version": "1andonly",
  "author": "umknown357",
  "createdUnix": "1418743244",
  "updatedUnix": "1418742853",
  "containsAdultContent": false,
  "uploadedBy": "umknown357",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000139102",
      "name": "whiterun Vault",
      "version": "1andonly",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3029",
      "fileName": "whiterun Vault-60813-1andonly.7z",
      "uploadedUnix": "1418742853",
      "modVersion": "1andonly",
      "virusScanUrl": "https://www.virustotal.com/file/b235779db11763baeecde79b3262b0cf2ea89798b5a55983387fb3ed1e6c713b/analysis/1418742910/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/whiterun%20Vault-60813-1andonly.7z?fid=1000139102&ttl=1535848843&ri=8192&rs=8192&setec=c285a9a1ca28e1a085be25285d15100d"
    }
  ]
}