{
  "modId": 60861.0,
  "modName": "Sanctuary of Us(Wundun)",
  "summary": "Player Abode Located in Ivarstead",
  "descriptionHtml": "Ivarstead was a small town hub for pilgrimages on their way to High Hrothgar. During there long journeys they would either stay at an inn or find shelter in the local Sanctuary of Us(Wundun), Which translates from the dragon tongue &#34;Before Travels&#34;. Travelers would sit in its great halls built inside the cliffs of the largest mountain in skyrim. However, with haunted rumors in Ivarstead and the town slowly being lost to time. the halls were lost to the dust it collects. Leaving only one unlikely guest to tend its halls.\r<br />\r<br />\r<br />This Abode Mod contains:\r<br />\r<br />[b]Nim the Wisp Fairy[/b]\r<br />This little guy will auto sort all your items you find in the world for you. Complete with a &#34;simple&#34; autosort feature. He will put your items in storage areas Ideal to there location in the halls. Future updates might have him move to each room as you walk in there with a little Portal jump like feature. Sadly not enough time. so he is added in the Beautifully made basement and the front for maximum access.\r<br />[b]\r<br />Dragon Claw Hanging area[/b]\r<br />Losing patience on finding your Dragon Claws and not want to just put them in a chest. well now you can view it in the library.\r<br />\r<br />[b]Simple Renovation[/b]\r<br />Renovations I thought they were interesting, yet might be .unneeded for players needs. These features simply toggle on and off. Future updates might have you pay to make these if I can find some time. This Toggle is located in the Library on the top of the stairs in a ledger.\r<br />\r<br />[b]Shrine toggles[/b]\r<br />This feature allows players to craft there shrines the same way as hearthfire, however you can now place them in the corridors on either side of the hall. The Library corridor and the Armory corridor are the only areas but you can toggle the two areas as both sides have every shrine set up with a nice little detail added to it. Once you built the shrines located in the basement you can then toggle the shrines when ever you choose. Much like just grabbing the Ol&#39; shrines out of the attic feeling.Use The Ledger to toggle these... also located in the Library. This allows player more of a &#34;I only worship this shrine type&#34; feeling\r<br />[b]\r<br />Statue Toggle[/b]\r<br />There&#39;s a little base in the Library dedicated to the statues the player might prefer. Azura, nocturnal, and talos are only few of the 7 statues you can pick. this feature is also toggled and can be found in the Library. Remember, If its a ledger it might be something interesting. \r<br />\r<br /> [b]Feed the Fire[/b]\r<br />This little script adds one fully working fireplace in the center of the hall. It only takes 5 piece of wood and will light of a section of the hall with its vibrancy. The script is set up for 15 mins in real time... unless you pause the game. that is about 8 hours of ingame time and thought it was reasonable for the time you will probly be in and out of your new house, sorting your items, or talking to you family. The script has 3 phases: Normal Light up, Fade, then Dying Flames. at this time you can click on the firewood pile that will show up and you can feed it some more fire.\r<br />\r<br />[b]Adoption compatible[/b]\r<br />As research has proven to me if I add my own fragment for the adoption system it will create incompatibilities on a global level. So I made sure that it works with Hearthfire Multiple Adoption Mod and the Custom family Homes. Both have been tested so enjoy.\r<br />[b]\r<br />Alchemy Lab[/b]\r<br />This area has 8 planting areas for herbalist and alchemist. Storage is decorated uniquely for potions and ingredients. And a little shelf to story those interesting little bugs in a jar.\r<br />\r<br />[b]Enchanting room.[/b]\r<br />Hidden in a wardrobe this enchanting room resides with sorting soul gems by filled or empty. a mannequin and numerous containers Unique and common for sorting your non enchants and enchants.\r<br />\r<br />[b]Lighting[/b]\r<br />I cant believe the amount of Shading lights I fit into this room with out flickering as I created a unique script to turn all shading light off that you are not seeing. with this I was able to fit nearly 10 lights to shadow the area. so expect some beautifully rendered areas and very little flickering (99.9%) on top of optimized rooms for better framerates. \r<br />\r<br />[b]Armory[/b]\r<br />Sort by weapons and armory. each having a sub category but also tested display cases that have activators so they will place them in there by them selves. Find out what Ive added as every Thing has been set for a purpose. None of this combine all your mannequins in one area thing. Everything has been set to make it seem Feng shui.\r<br />\r<br />[b]Library[/b]\r<br />This area has alot of things... And I mean ALOT. Ledgers edit the areas in the interiors and working book shelfs litter the walls. Fully scripted dragon claw mounting area and a fully mask placing area with azura star mounting areas and many other things for special items like the Elder scrolls, Bug Jars(alchemy room),and Daedric Artifacts(armory).Special thanks [url=http://www.nexusmods.com/skyrim/users/4138425]skyrimlazz[/url]&#39;s Displays for the modding resource.\r<br />\r<br />[b]Basement[/b]\r<br />A vast cave is the scenery of this basement. It has all your blacksmiths needs and with chests that have sorted ingots for your quick accessing needs. A Kitchen with a working Fridge(old fashion) to keep your food cold and a bar style sitting area. Dummies for the kids and onlooking view of the Obelisk holding the Mountain from crushing this Abode.\r<br />\r<br />Pick an Outdoor Bridge that suits you \r<br />With the new Update (0.9.92) you can now change the way your Bridge outdoors looks. With this come even more compatibility for Ivarstead mods.\r<br />\r<br />[b]Fully NaveMeshed[/b]\r<br />Works with Followers that relax and children that play. Also No respawning chest so you can store your items.\r<br /> \r<br />And many more...\r<br />\r<br />Foot Note Narfi was relocated in a very nice location which looks nice and out of the way... not even 3 feet from its original location. You might even find the stormcloaks/imperials partying on your front step which is rather nice.\r<br />\r<br />_________________________________________________\r<br />Intalling\r<br />Simply put the scripts in the script folder Data&gt;Scripts\r<br />Then put the ESP in the in the data folder and your ready.\r<br />\r<br />Enable and enjoy.\r<br />_________________________________________________\r<br />\r<br />[u]Compatible[/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/60720/?]JK&#39;s Ivarstead[/url] (New Update (0.9.92) makes this fully compatible in the light that you can change the bridge now.)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/29249/?]Hearthfire multiple adoptions - Now with custom home support for kids and spouse[/url] (With Many areas for children to play and 4 children beds.)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/47621/?]Custom Family Home[/url] (Nicer alternative to HMA)\r<br />\r<br />\r<br />\r<br />[u]Semi Compatible if your willing to edit. [/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/13608/?]Expanded Towns and Cities[/url] (just delete all Trees across the river and the bridge and you should be good)\r<br />\r<br />\r<br />[u]Incompatible With[/u]\r<br />\r<br />Anything else not editing Ivarstead across the river. \r<br />\r<br />\r<br />Requires:\r<br />\r<br />[url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url]\r<br />\r<br />ENBBOOST   -   http://enbdev.com/download_mod_tesskyrim.htm\r<br />\r<br />\r<br />SKSE is for the unique scripts but if you dont have it I recommend it as it will increase frame rate and lessen crashes. Its a MUST for stability in skyrim\r<br />\r<br />ENBBOOST- you dont really need it for this mod but this thing is a Beauty not just visually by computing wize. It take the frame rate from 30 to nearly 80 on my system. just turn those effects off and you got yourself the original shaders. There is definitely no Down side. ",
  "categoryId": "67",
  "version": "0.9.92",
  "author": "Kageshi",
  "createdUnix": "1420213240",
  "updatedUnix": "1420681742",
  "containsAdultContent": false,
  "uploadedBy": "kageshi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000141423",
      "name": "Sanctuary Of UsWundun 0.9.91",
      "version": "0.9.91",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "457",
      "fileName": "Sanctuary of Us(Wundun)-60861-0-9-91.zip",
      "uploadedUnix": "1420426580",
      "modVersion": "0.9.91",
      "virusScanUrl": "https://www.virustotal.com/file/6d973dda9a08c18fc6ace6ea276ac9d7e6bda84102953f2a13a2b0e12e92f001/analysis/1420426623/",
      "changelogHtml": " Added Autosort Items: \r<br />Any Bow (chest can be found in armory on second floor) \r<br />Lockpicks (Library on desk in strong box) \r<br />Scrolls (in sack next to Bounties and letters chest) \r<br />Nord/draugr Items now sort.\r<br />Dumping Chest (instead of items that cant be sorted going back to you, the get dumping in the chest next to the front door. Helps with faster in and out access.) \r<br />\r<br />Fixs: \r<br />Fixed non-clickable items from poping out of collision wall/activator chest. Potions fell out of alchemy room and cant be picked up. Replaced with static Items so they NEVER move. Same can be said for every Item in its similar predicament...Black soul gems, arrows, gold items, weapons, coins, rubys, and many more. IF YOU HAVE NOT WITNESS THESE YET, PLEASE UPDATE NOW... this will save you headaches later. see forum for workaround if you have witness this. \r<br />\r<br />Spell Checks   <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sanctuary%20of%20Us%28Wundun%29-60861-0-9-91.zip?fid=1000141423&ttl=1535848915&ri=8192&rs=8192&setec=b49c0710fc3932fd158edf6a33a3f8fb"
    },
    {
      "fileId": "1000141855",
      "name": "Sanctuary Of UsWundun 0.9.92",
      "version": "0.9.92",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "482",
      "fileName": "Sanctuary Of UsWundun 0.9.92-60861-0-9-92.zip",
      "uploadedUnix": "1420681742",
      "modVersion": "0.9.92",
      "virusScanUrl": "https://www.virustotal.com/file/e680eb956ec341fd441e6302d289f6c945bd835c14b9f1664d9d3a32d3ed90bd/analysis/1420681804/",
      "changelogHtml": " 0.9.92\r<br />\r<br />Some renovations now alert you that you have activated it(in the upper left corner)\r<br />\r<br />Candle and light added to the basement shrine crafting bench for better finding it.\r<br />\r<br />Bridge now has three new toggles.Stepping stone, Wood, and stone(default).\r<br />\r<br />Outdoor Lights have embers now and smoke (accidently deleted them.)\r<br />\r<br />Obelisk waterfall. renovations.\r<br />\r<br />Updated scripts Autosorting and renovation\r<br />\r<br />Navmesh update\r<br />\r<br />Clutter Formlist for Autosort Updated.\r<br />\r<br />LesserSoulGems Filled now sort\r<br />\r<br />Light Optimization for Lesser possible flickering \r<br />\r<br />File Cleaning. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sanctuary%20Of%20UsWundun%200.9.92-60861-0-9-92.zip?fid=1000141855&ttl=1535848916&ri=8192&rs=8192&setec=f367eec74a8fe8dd948e72f006a48366"
    }
  ]
}