{
  "modId": 60889.0,
  "modName": "Dwarven Helmet Replacer",
  "summary": "A mod I created to replace the somewhat displeasing Dwarven/Dwemer Helmet found in Skyrim.",
  "descriptionHtml": "When I was venturing throughout Skyrim in the past, I came across hundreds of artefacts and items. One of which, was the nausea-inducing Dwarven Helmet. Whilst the rest of the set looked beautiful and protective, the helmet fell short and turned out looking like a chunk-o-poo. Using assets from the glorious &#34;Aethernautics- A Space Travel Mod&#34; (Thanks a tonne,Trainwiz&#33;) I was able to recreate the Dwarven Helmet by using a new mesh module from the mod. While I have an extremely limited knowledge of how it is you people make things in this game beautiful, I was somehow able to throw this half-assed modification together.\r<br />        \r<br /> If you feel like unpacking the .zip file and looking at the textures, you&#39;ll find that I have no idea as to how to do anything. I originally planned on making it a nice matte black, but I suck at texturing too ( as well as using Nifskope properly ). If you know how to make it not-so-shiny and get it looking spicy, contact me and I&#39;ll upload it as an optional file (Or if I&#39;m so impressed with it, I may just replace the main file altogether&#33;). So yeah.                                                                                             \r<br />---------------------------------------------------------------------------- C O M P A T A B I L I T Y ----------------------------------------------------------------------------\r<br />\r<br />As far as I&#39;m concerned, it doesn&#39;t work with any mods which replace the meshes for the Dwarven Helmet, and if you install the awesome &#34;Aethernautics- A Space Travel Mod (by Trainwiz)&#34; mod before this, the only difference you&#39;ll see is the visor changing on the Aethernaut Helm. But if you install the Aethernautics mod AFTER this, then the visor will look identical to the one in said mod. The mod is also compatible with any mod which retextures the Dwarven Helmet/Armor ",
  "categoryId": "54",
  "version": "1.2",
  "author": "Trainwiz",
  "createdUnix": "1418970840",
  "updatedUnix": "1419027260",
  "containsAdultContent": false,
  "uploadedBy": "StateWaffles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000139465",
      "name": "Dwarven Helmet Replacer",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "62",
      "fileName": "Dwarven Helmet Replacer-60889-1-2.7z",
      "uploadedUnix": "1419027260",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/f99a98c53c72e865a1ebc1fda88f1d279de0858938597b2e2fd56836112f31b8/analysis/1419027303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwarven%20Helmet%20Replacer-60889-1-2.7z?fid=1000139465&ttl=1535848961&ri=8192&rs=8192&setec=34db78b467497be26bcabb4a2aef296f"
    }
  ]
}