{
  "modId": 60887.0,
  "modName": "PerMa slower skill leveling",
  "summary": "Ever wondered why skills level so quickly with Perkus Maximus? Ever feel that other options to slow down leveling punished some skills too much or not enough? Then this uncapper ini file may be for you. *Now with even slower options*",
  "descriptionHtml": "I designed this file for use with my own installation of [url=http://www.nexusmods.com/skyrim/mods/59849/?]Perkus Maximus[/url]. Using it without PerMa isn&#39;t advised. Requires [url=http://www.nexusmods.com/skyrim/mods/1175/?]Skyrim -Community- Uncapper[/url]. Both of which also require [url=http://skse.silverlock.org/]SKSE[/url]. If you don&#39;t already use a combat difficulty mod with PerMa, I suggest [url=http://www.nexusmods.com/skyrim/mods/2700/?]Duel - Combat Realism[/url].\r<br />\r<br />[b]***New requested version labeled &#34;arcologist edit&#34; under miscellaneous files***[/b]\r<br />\r<br />This uncapper ini file slows down the leveling of pretty much all the skills over time. They start off with close to vanilla gains but as the skills increase, they level slower and slower.\r<br />\r<br />The slowest skills level between 70% and 50% of vanilla speed. (Alchemy, Enchanting, Dexterity, and Smithing.)\r<br />Moderate skills level between 80% and 60% of vanilla speed. (Alteration, Conjuration, Illusion, Restoration, Sneak, Speech, and Wayfarer.)\r<br />Combat skills level between 90% and 70% of vanilla speed. (Ranged Weaponry, Block, Destruction, Heavy Armor, Light Armor, Light Weaponry, and Heavy Weaponry.)\r<br />\r<br />[b]For the optional files, Even slower leveling halves these values:[/b]\r<br />\r<br />The slowest skills level between 35% and 25% of vanilla speed. (Alchemy, Enchanting, Dexterity, and Smithing.)\r<br />Moderate skills level between 40% and 30% of vanilla speed. (Alteration, Conjuration, Illusion, Restoration, Sneak, Speech, and Wayfarer.)\r<br />Combat skills level between 45% and 35% of vanilla speed. (Ranged Weaponry, Block, Destruction, Heavy Armor, Light Armor, Light Weaponry, and Heavy Weaponry.)\r<br />\r<br />[b]Extreme slower leveling quarters the original values:[/b]\r<br />\r<br />The slowest skills level between 17.5% and 12.5% of vanilla speed. (Alchemy, Enchanting, Dexterity, and Smithing.)\r<br />Moderate skills level between 20% and 15% of vanilla speed. (Alteration, Conjuration, Illusion, Restoration, Sneak, Speech, and Wayfarer.)\r<br />Combat skills level between 22.5% and 17.5% of vanilla speed. (Ranged Weaponry, Block, Destruction, Heavy Armor, Light Armor, Light Weaponry, and Heavy Weaponry.)\r<br />\r<br />[b]And Ultimate slower leveling is one-tenth of the original values:[/b]\r<br />\r<br />The slowest skills level between 7% and 5% of vanilla speed. (Alchemy, Enchanting, Dexterity, and Smithing.)\r<br />Moderate skills level between 8% and 6% of vanilla speed. (Alteration, Conjuration, Illusion, Restoration, Sneak, Speech, and Wayfarer.)\r<br />Combat skills level between 9% and 7% of vanilla speed. (Ranged Weaponry, Block, Destruction, Heavy Armor, Light Armor, Light Weaponry, and Heavy Weaponry.)\r<br />\r<br />Also, as any skill gets higher, they provide less and less towards your next character level. This basically means that in addition to the skills leveling slower \r<br />over time, it will take more and more skill ups to get your next character level as well. This is done independently by skill, however, so if you decide to go level a lower skill, it can provide more towards your next level than leveling a higher one in some cases.\r<br />\r<br />The skills that grant the least towards a level range between 80% and 70% of vanilla speed.\r<br />The skills that grant a moderate amount towards a level range between 90% and 70% of vanilla speed.\r<br />The skills that grant the most towards a level range between 100% and 80% of vanilla speed.\r<br />\r<br />[b]For the optional files, Even slower leveling halves these values:[/b]\r<br />\r<br />The skills that grant the least towards a level range between 40% and 35% of vanilla speed.\r<br />The skills that grant a moderate amount towards a level range between 45% and 35% of vanilla speed.\r<br />The skills that grant the most towards a level range between 50% and 40% of vanilla speed.\r<br />\r<br />[b]Extreme slower leveling quarters the original values:[/b]\r<br />\r<br />The skills that grant the least towards a level range between 20% and 17.5% of vanilla speed.\r<br />The skills that grant a moderate amount towards a level range between 22.5% and 17.5% of vanilla speed.\r<br />The skills that grant the most towards a level range between 25% and 20% of vanilla speed.\r<br />\r<br />[b]And Ultimate slower leveling is one-tenth of the original values:[/b]\r<br />\r<br />The skills that grant the least towards a level range between 8% and 7% of vanilla speed.\r<br />The skills that grant a moderate amount towards a level range between 9% and 7% of vanilla speed.\r<br />The skills that grant the most towards a level range between 10% and 8% of vanilla speed.\r<br />\r<br />This file is set up to allow skills to progress up to 150 at maximum, but getting there takes work. This includes allowing extra room for buffs to temporarily increase your stats and capping the max amount of skill in enchanting that counts towards magnitude and charges.\r<br />\r<br />This file is set up to give you 2 perks at level 2 to make up for not having one for level 1. After that, you get one perk per level and an extra one every five levels.\r<br />\r<br />Health, stamina, and magicka from leveling is increased at the front end but does get lower later. Total bonus adds up to 900 by level 105, after which you stop gaining anything at all. This means that you could split that 300 to each stat over time or 450 to two, etc.\r<br />\r<br />Carrying capacity grows no matter which stat you choose, but the amount gained slows over time and caps out at a total bonus of 400 around level 82.\r<br />\r<br />I&#39;d like to give a big thank you to T3nd0 for his work on Perkus Maximus, it is a great mod. I&#39;d also like to thank Elys for the Uncapper.\r<br />\r<br />[b]*^*^*^*^*^*^*^*^*Alternate Level Handling file description*^*^*^*^*^*^*^*^*[/b]\r<br />\r<br />Skills still level slower as they get higher but start at a slower pace than the original main file. All skills hit 0% at a max of 150 skill.\r<br />\r<br />Alchemy, Enchanting, Dexterity, and Smithing begin levelling at 50% vanilla rate.\r<br />Alteration, Conjuration, Illusion, and Restoration begin levelling at 60% vanilla rate.\r<br />All other skills begin levelling at 70% vanilla rate.\r<br />\r<br />Character leveling progress is now handled based on character level instead of base skill level. This means that the character will level \r<br />slower as their level rises REGARDLESS of base skill levels. \r<br />\r<br />Essentially, the original and optional files don&#39;t penalize you for picking up a skill later in the game. If you never leveled Block, the amount of progress towards your next level from leveling block is the same at lvl 50 as it would have been at level 2. \r<br />\r<br />This alternate file changes that. Using this file and the above example, beginning to level block for the first time at level 50 will only progress your character level bar the same amount as if you had been leveling block the entire time.\r<br />\r<br />Alchemy, Enchanting, Dexterity, and Smithing provide character level progress at 70% vanilla rate beginning at level 1 which falls to a rate of 20% vanilla rate by level 100.\r<br />Alteration, Conjuration, Illusion, Restoration, and Speech provide character level progress at 80% vanilla rate beginning at level 1 which falls to a rate \r<br />of 30% vanilla rate by level 100.\r<br />All other skills provide character level progress at 90% vanilla rate beginning at level 1 which falls to a rate of 40% vanilla rate by level 100.\r<br />\r<br />Perks, health, stamina, magicka, and carry weight gains are all the same as the original file.\r<br />\r<br />[b]*^*^*^*^*^*^*^*^*arcologist edit file description*^*^*^*^*^*^*^*^*[/b]\r<br />\r<br />Skills level extremely slow but character level speed is vanilla.\r<br />\r<br />Alchemy, Enchanting, Dexterity, and Smithing take between 8x and 11.5x more uses than vanilla to level one point.\r<br />Alteration, Conjuration, Illusion, and Restoration take between 7x and 9.5x more uses than vanilla to level one point.\r<br />All other skills take between 6x and 8x more uses than vanilla to level one point.\r<br />\r<br />Perks, health, stamina, magicka, and carry weight gains are all the same as the original file.",
  "categoryId": "73",
  "version": "1.0",
  "author": "Dragnier Draconai",
  "createdUnix": "1418965289",
  "updatedUnix": "1422504232",
  "containsAdultContent": false,
  "uploadedBy": "dragnierdraconai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000139381",
      "name": "PerMa Slower Skill Leveling - Uncapper ini file replacer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "PerMa Slower Skill Leveling - Uncapper ini file replacer-60887-1-0.7z",
      "uploadedUnix": "1418965279",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/01617c54d216277116059343dd043c7b063352fc40c39e1ffa2885478e6bd764/analysis/1418965322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerMa%20Slower%20Skill%20Leveling%20-%20Uncapper%20ini%20file%20replacer-60887-1-0.7z?fid=1000139381&ttl=1535848957&ri=8192&rs=8192&setec=a302fe85279095ea96cf17a825a57212"
    },
    {
      "fileId": "1000140105",
      "name": "PerMa Even Slower Skill Leveling",
      "version": "1.0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "PerMa Even Slower Skill Leveling-60887-1-0-1.7z",
      "uploadedUnix": "1419466889",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/d6e0d66225b46d35d86cc47091360be7b00ddb7e1e1ad3fc26b06aef7b9a4d93/analysis/1419466922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerMa%20Even%20Slower%20Skill%20Leveling-60887-1-0-1.7z?fid=1000140105&ttl=1535848958&ri=8192&rs=8192&setec=7f56d26ad3cd825c2f88c5402323ce9f"
    },
    {
      "fileId": "1000140107",
      "name": "PerMa Extreme Slower Skill Leveling",
      "version": "1.0.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "PerMa Extreme Slower Skill Leveling-60887-1-0-2.7z",
      "uploadedUnix": "1419467116",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/43e5c132a0faf94a7697480945db22097930b676419caaab544bfc05c2dcecff/analysis/1419467162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerMa%20Extreme%20Slower%20Skill%20Leveling-60887-1-0-2.7z?fid=1000140107&ttl=1535848958&ri=8192&rs=8192&setec=9573967f2675876994a3b7194cdbaf5f"
    },
    {
      "fileId": "1000140111",
      "name": "PerMa Ultimate Slower Skill Leveling",
      "version": "1.0.3",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "PerMa Ultimate Slower Skill Leveling-60887-1-0-3.7z",
      "uploadedUnix": "1419472289",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/b93ec11651c3c0fd63ee0b06a77d5214569e4f11165a995802593d2e9be80d6b/analysis/1419472322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerMa%20Ultimate%20Slower%20Skill%20Leveling-60887-1-0-3.7z?fid=1000140111&ttl=1535848959&ri=8192&rs=8192&setec=8e72f24606ecf696b9a331aa80e7af50"
    },
    {
      "fileId": "1000140450",
      "name": "PerMa Alternate Slower Skill Leveling",
      "version": "1.0.4",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "3",
      "fileName": "PerMa Alternate Slower Skill Leveling-60887-1-0-4.7z",
      "uploadedUnix": "1419745035",
      "modVersion": "1.0.4",
      "virusScanUrl": "https://www.virustotal.com/file/f4736b09f25044d2bd74ddfc3984808ee5fb691122416a6a813c9ba36519daef/analysis/1419745083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerMa%20Alternate%20Slower%20Skill%20Leveling-60887-1-0-4.7z?fid=1000140450&ttl=1535848959&ri=8192&rs=8192&setec=d0e990959ffa99f633ed1cb7e8c5e568"
    },
    {
      "fileId": "1000145056",
      "name": "PerMa Slower Skill Leveling (arcologist edit)",
      "version": "1.0.5",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "PerMa Slower Skill Leveling (arcologist edit)-60887-1-0-5.7z",
      "uploadedUnix": "1422504232",
      "modVersion": "1.0.5",
      "virusScanUrl": "https://www.virustotal.com/file/fabfff78ecce022d73eb741bff9b7bf68517ee59d86d4d4228e686a01bafa9a1/analysis/1422504243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PerMa%20Slower%20Skill%20Leveling%20%28arcologist%20edit%29-60887-1-0-5.7z?fid=1000145056&ttl=1535848959&ri=8192&rs=8192&setec=1beb149c2c758cfb8f2fb185ed632b1a"
    }
  ]
}