{
  "modId": 60902.0,
  "modName": "Armor_Improved",
  "summary": "Gives the hold guards better armor",
  "descriptionHtml": "I thought the hold guards had some pretty weak armor (seriously weaker then [i]leather armor[/i]) so I decided to do something. This makes the guard armor significantly stronger based on what hold they&#39;re in. I tried to make the armor reflect hold size and financial status of that hold. The bigger and wealthier the hold the better the armor the guards will have. Now because the guards in Windhelm use Stormcloak gear I had to adjust the armor power for both sides of the civil war. When I looked at the stats for the armor and weapons of the Imperials I have to admit I was a little sad to find that the armor was no better then what the Stormcloaks had (Their armor is only better because they have a shield -- seriously that&#39;s the only reason they have &#34;better armor&#34; and the heavy armor they have is on level with the mighty... iron.). I fixed that problem. While I was in there I decided to keep going. The Emperor&#39;s guard will now have some stronger armor, as will General Tullius and Jarl Ulfric (Although Tullius will still have better armor because more then his gloves are armored.). Below are the levels of armor I gave to the hold guards and the reason why. \r<br />\r<br />Falkreath - Same base power as Leather. \r<br />   I had this one hold its ground with leather because I don&#39;t see too much the hold can really export and the Jarl at the beginning isn&#39;t exactly the best.\r<br />\r<br />Hjaalmarch (Morthal) - Same base power as leather.\r<br />   Unless Morthal is exporting swamp I can&#39;t think they have enough to give their guards anything better then this. \r<br />\r<br />Markarth - Same base power as Scaled light armor.\r<br />   Markarth has the silver bloods, while I&#39;m aware the silver-bloods run the mine I&#39;m sure that taxes exist so the Jarl has to be getting some money here. I was going to put this gear on par with glass but figured the forsworn should be causing enough problems to bring this armor down a little. \r<br />\r<br />Riften - Same base power as Elven\r<br />   While I&#39;m sure that Riften has enough money going in to it because of the thieves guild and legitimate businesses I&#39;m fairly certain that the thieves guild would be working to see to it that the guards have bad armor. As far as a jarl getting in the way of that... well the jarl to start with puts Maven Black-Briar in charge of the Thieves guild hunt and if the Imperials get the city... it becomes jarl Maven Black-Briar. While I&#39;m sure the hold can afford better armor I doubt they would give it out. \r<br />\r<br />Haafingar (Solitude) - Stronger then Scaled, weaker then Glass\r<br />   The port would provide some excellent trade and the Empire&#39;s backing would help ensure that this place has all the money it needs to outfit its guards as well as it can. This armor is better then the Imperial armor. I did that because I figure if it&#39;s possible to outfit the police force to be just as strong, if not stronger then the military, go for it.\r<br />\r<br />ThePale (Dawnstar) - Same base power as leather.\r<br />   What&#39;s their export? Nightmares? Yeah not much money going in to this frosty hold. \r<br />\r<br />Whiterun - Same as Solitude\r<br />   Solitude is the trading hub of Skyrim, all the money they&#39;ll ever need will come and go from this place, and you can bet the jarl is getting taxes from what&#39;s going on here. Due to its central location and how much trade goes on here I&#39;m giving this armor a very high rating. \r<br />\r<br />Winterhold - Same base power as Leather.\r<br />   What&#39;s the export here? Isolation and collapse? I almost decided to not even touch this one and leave the armor weaker then leather but decided against doing that since the Stormcloaks would hopefully be helping them out. \r<br />\r<br />Windhelm - Same base power as Elven.\r<br />   Okay so these guards are not using special armor, it&#39;s Stormcloak armor and that&#39;s why I messed with the imperial armor since I couldn&#39;t really mess with this armor without adjusting for all Stormcloak armor. Or I might have been able to but decided I wanted to mess with the Imperial armor and this was a good excuse. The reason this armor is on level with Elven is because they&#39;re the capital of a rebellion, while I&#39;m sure they could make better armor that doesn&#39;t meany they have it for everyone, the foot soldier gets weaker armor.\r<br />\r<br />Note: When I was changing the shields for the guards I noticed they were all classified as heavy armor. That didn&#39;t make sense because they all look like they&#39;re made of wood and probably act like cheap toys in combat so I made the game recognize them all as light shields. \r<br />[center]\r<br />End of Hold Armor[/center][center][/center]\r<br />Stormcloak Officer - Same base power as Scaled\r<br />   Like I said, they do have the ability to make armor this strong, but that doesn&#39;t mean everyone has it. \r<br />\r<br />Imperial Light Armor (including Studded) - Same base power as Scaled\r<br />   Hey they boast &#34;better armor&#34; then the stormcloaks, this makes that armor a step up from what the stormcloaks have, thus meaning they&#39;re not liars anymore. \r<br />\r<br />Imperial Heavy Armor - Same base power as Steel Plate\r<br />   I did my best to translate light armor to heavy here. I had to improvise with the shield since steel plate doesn&#39;t have one. I put it as best I could to a middle child between Dwrven and Orcish. \r<br />\r<br />Penitus Oculatus - Unique. \r<br />   Yeah there was no set I wanted to really borrow from on the Emperor&#39;s personal guard. I put the gloves, helmet and boots right between scaled and glass. The armor itself is on par with the solitude and whiterun guards.\r<br />\r<br />Fur boots/gauntlets - Yeah I changed those too. \r<br />   Fun fact: All hold guards (with the exception of Solitude) use fur boots and probably gloves (some, like Falkreeth, don&#39;t) so I needed to change this too. I made it slightly stronger it should look like it fits in just about any hold. \r<br />\r<br />Imperial weapons - Improved to stand ground with elven. \r<br />   Here&#39;s my reasoning behind this: The Empire should have access to better steel the most people have right? So why don&#39;t they? Looking at the vanilla steel sword they&#39;re no better then what anyone else can get. Looking at the Scimitars the Redguard have that level of steel is possible. Looking at What&#39;s being made in the skyforge it&#39;s possible. Why then does an old empire still have imperial weapons only as strong as what civilians have? It doesn&#39;t make sense to me so I changed it here. The Imperial Sword will now hold ground with what allied neighbors have. The Imperial bow and Sword had the same base damage before I messed with it so I decided to put the bow on the same power level as its sword counterpart. \r<br />\r<br />Before anyone asks Yes I did get around to the rarer imperial equipment. The closed face helmet and officer&#39;s helmet are a little stronger now. \r<br />[center]\r<br />End Of Armor[/center]\r<br />   You may still be thinking that this isn&#39;t worth downloading because the armor doesn&#39;t receive any double improvement perks... you know where this is going don&#39;t you? Yeah Advanced armors will now give all this armor double improvement. This mod shouldn&#39;t conflict with anything since I just messed with what was in the vanilla game, and you shouldn&#39;t need any of the DLCs to make this work. And no I didn&#39;t make any of this craftable anywhere, there plenty (like... seriously a lot) of mods that will let you do that. Put those ones after this in your load order and you should be okay.\r<br />\r<br />   Now for a final statement I should say I didn&#39;t intend for this to favor either side, imperial or Stormcloak, if it does then that&#39;s just what happened. \r<br />\r<br />Instillation:\r<br />For some reason the big green button has been having trouble working lately. If for any reason you can&#39;t download normally (the big green button doesn&#39;t work) then you can perform a manual download and drag and drop the .zip you will receive into the mod manager which should install the file for you, it&#39;ll work like any other mod after that. \r<br />\r<br />Changes: \r<br />   12/21/14\r<br />Added a second file that improves guard armor without improving imperial weapons for those of you who don&#39;t want that. ",
  "categoryId": "54",
  "version": "",
  "author": "Slarche",
  "createdUnix": "1419040902",
  "updatedUnix": "1419216950",
  "containsAdultContent": false,
  "uploadedBy": "Slarche",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000139474",
      "name": "Armor Improved",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Armor Improved-60902-.zip",
      "uploadedUnix": "1419038224",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ba754e4853239f00d42c391c47f6e9b121036628715c157680490563d9b596a7/analysis/1419038282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armor%20Improved-60902-.zip?fid=1000139474&ttl=1535848997&ri=8192&rs=8192&setec=dc209976f04c7128d7552785e1cd226d"
    },
    {
      "fileId": "1000139729",
      "name": "Armor Improved No Weapon",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Armor Improved No Weapon-60902-.zip",
      "uploadedUnix": "1419216950",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d72846a2c5aa1da7a3c3058b2ba15e5c6698a30ff4b56c78c9280d6cfdd98fa8/analysis/1419216964/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armor%20Improved%20No%20Weapon-60902-.zip?fid=1000139729&ttl=1535848997&ri=8192&rs=8192&setec=7115bc6f3ce8ac0c5b15472588bdd668"
    }
  ]
}