{
  "modId": 60949.0,
  "modName": "HT Casting Regeneration",
  "summary": "HT Casting Regeneration allows the player and/or NPCs to regenerate Magicka while they are still casting, charging, or channeling spells including staves&#33; You can also customize the global Magicka regeneration rates for the player and NPCs separately. The mod is highly customizable via a SkyUI MCM menu.",
  "descriptionHtml": "[img]http://i.imgur.com/kE1mViL.png[/img]\r<br />\r<br />HT Casting Regeneration allows players, and if set to do so, NPCs to regenerate Magicka while they are still casting, charging, or channeling spells including staves. This is a feature that I was always perplexed was not in the base game, it makes no sense that holding a fireball should keep your bar from filling back up. You can also customize the global Magicka regeneration rates for the player and NPCs separately.\r<br />\r<br />\r<br />[img]http://i.imgur.com/mEAHD0s.png[/img]\r<br />[img]http://i.imgur.com/2NwnKRk.png[/img]\r<br />There are toggles to enable or disable every part of this mod. In addition to being able to disable the mod entirely from the in-game menu you can also toggle the following for both players and NPCs separately: regeneration while charging a spell, regeneration while channeling a spell, regeneration while charging or channeling a staff, and modification of the global magicka regeneration rate.\r<br />\r<br />[img]http://i.imgur.com/M11xDcC.png[/img]\r<br />Each of the aforementioned toggleable features also have a separate multiplier that can be set to customize as you see fit. For example if you have the casting regeneration multiplier set to 0.5 and you charge a fireball you will regain Magicka at 50% of your normal rate. If you also have the channeling regeneration multiplier set to 0.75 and you start casting sparks you will regain magicka at (0.5 * 0.75) = 0.375 37.5% your normal rate. The global regeneration multiplier affects ALL Magicka regeneration, except potions.\r<br />\r<br />[img]http://i.imgur.com/X8W4VEu.png[/img]\r<br />The amount of time between the script&#39;s updates. Lower values will make the Magicka bar move more smoothly, but will take up more time that could be better-used on other scripts. My script is very light, but if you put it too low it may be hard on low-end pcs.\r<br />\r<br />[img]http://i.imgur.com/XSKRFqy.png[/img]\r<br />The percent of the total cost of the spell(s) being casted that this mod will recharge. Example: You have 100 Magicka max, a fireball costs 50, this setting is set to 0.5, you would be able to recharge up to 75 Magicka while holding a charged fireball in one hand. If this is set to 1, you will be able to regenerate 100% of your Magicka bar. At 0 you will be able to regenerate to MAXMAGICKA-SPELLCOST while you are still casting/charging/holding a spell.\r<br />\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/hUbCR6t.png[/img]\r<br />[img]http://i.imgur.com/pDyu8u3.png[/img]\r<br />Install using the NMM or any other mod management utility, or just copy the contents of the archive into your Data directory.\r<br />\r<br />[img]http://i.imgur.com/ddbMXWY.png[/img]\r<br />To update to a newer version, uninstall the old version via the NMM (since you are updating, the latent variables are not a problem). Once that is done, just install the newer version via the NMM. Within a few seconds of loading your save the script will detect that a newer version has been installed and act accordingly. (You will recieve a text message to this effect at the top left corner of your screen.) NOTE: Doing this will reset the mod&#39;s settings to their default values.\r<br />\r<br />\r<br />[img]http://i.imgur.com/V3W9tTo.png[/img]\r<br />[color=#ff0000]IMPORTANT: [/color]Do not simply remove the mod. The mod saves data in your savegame, and applies scripts to actors. To uninstall cleanly you must go the the in-game MCM menu and click on the Uninstall button in the right-hand column and then save your game. This will remove the magic effect with the script from your character and purge all of the latent settings data from your save. Once you have done this you can simply uninstall via the NMM or remove the files that you added earlier. NOTE: This mod uses a third-party library (JContainers) which is packaged within. If you have other mods that rely on this package, be careful not to delete its files if uninstalling manually. Uninstalling via the NMM should be save however, as it is designed to avoid just this type of problem.\r<br />\r<br />\r<br />[img]http://i.imgur.com/cjPaKfT.png[/img]\r<br />Skyrim Script Extender (SKSE), version 1.7.1 or greater: [url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url]\r<br />SkyUI(for configuration, will work without it): [url=http://www.nexusmods.com/skyrim/mods/3863/?]http://www.nexusmods.com/skyrim/mods/3863/?\r<br />[/url][size=2]JContainers(packaged with my mod, so you don&#39;t need to download it): [url=http://www.nexusmods.com/skyrim/mods/49743/?]http://www.nexusmods.com/skyrim/mods/49743/?[/url][/size]\r<br />[color=#f6b26b][u]\r<br />\r<br />[/u][/color][img]http://i.imgur.com/N9Bav0N.png[/img]\r<br />This mod only adds new forms and scripts, so it will be comparable with anything and everything. Even other mods that might mess with the player&#39;s magicka, as my mod only modifies it via the RestoreAV command (never directly sets it).\r<br />\r<br />\r<br />[img]http://i.imgur.com/1Dc8AnX.png[/img]\r<br />[size=3][color=#dd7e6b][size=3]1.1.1 - 12/24/14[/size][/color]\r<br />[list][*]Reworked the entire mod again. It is now using abilities to apply the regeneration script again. This was necessary because the quest reference alias solution was causing a very noticeable pause in regeneration when it refreshed every 10 or so seconds. It was also very restrictive in the total number of NPCs that could be affected. This number is not essentially infinite.\r<br />[/*]\r<br />[*]Added support for regenerating Magicka while casting with a staff. This was already working, but now there is a specific toggle and multiplier for this case.[/*]\r<br />[*]Added the ability to customize the global Magicka multiplier of affected actors.[/*]\r<br />[/list]\r<br />[color=#dd7e6b]1.1.0 - 12/22/14[/color][/size]\r<br />[list][*]Reworked the entire mod. It no longer makes use of an Ability to apply the regeneration script; rather, it uses quest reference aliases.[/*]\r<br />[*]The regeneration script can now be set to apply to NPCs that are near the player as well.[/*]\r<br />[*]Added MCM settings for NPC options on their own page.[/*]\r<br />[/list]\r<br />[b][color=#dd7e6b][size=3]1.0.1 - 12/21/14[/size][/color][/b]\r<br />[list][*]Fixed an oversight that caused the regeneration rate to not be affected by modifiers the player had (enchantments, standing stones, etc).[/*]\r<br />[*]Added some instructional text to the MCM menu regarding proper update procedure.[/*]\r<br />[*]Changed some MCM option&#39;s text to be more clear.[/*]\r<br />[/list]\r<br />[color=#dd7e6b][size=3][b]1.0.0 - 12/21/14[/b][/size][/color]\r<br />[list][*]Initial release.\r<br />[/*]\r<br />[/list]\r<br />\r<br />[u][color=#f6b26b][size=5][b][img]http://i.imgur.com/LBJwUpH.png[/img][/b][/size][/color][/u]\r<br />SKSE Team - Awesomeness.\r<br />SkyUI Team - Without their excellent mod my configuration menu would not have been possible.\r<br />Silvericed&#39;s JContainers - This library is fantastic.",
  "categoryId": "93",
  "version": "1.1.1",
  "author": "Hacktank",
  "createdUnix": "1419187522",
  "updatedUnix": "1419439250",
  "containsAdultContent": false,
  "uploadedBy": "Hacktank",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000139676",
      "name": "HTCastingRegen_1.0.0",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "505",
      "fileName": "HTCastingRegen_1.0.0-60949-1-0-0.7z",
      "uploadedUnix": "1419187488",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/ec1e1209df61c925f477ebae18b89dfafa922ded7ebedf581d4347aac4171cd0/analysis/1419187502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HTCastingRegen_1.0.0-60949-1-0-0.7z?fid=1000139676&ttl=1535849088&ri=8192&rs=8192&setec=ec23815cb43d5f4697c17e7a99d0f6ef"
    },
    {
      "fileId": "1000139712",
      "name": "HTCastingRegen_1.0.1",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "506",
      "fileName": "HTCastingRegen_1.0.1-60949-1-0-1.7z",
      "uploadedUnix": "1419206044",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/29bf0a5563c44eb785e36a6639cc060eab5c0d5ad0a427f7d4cc836cef53efcc/analysis/1419206103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HTCastingRegen_1.0.1-60949-1-0-1.7z?fid=1000139712&ttl=1535849088&ri=8192&rs=8192&setec=6efdd3454315cfb7a9773d5ffef390bf"
    },
    {
      "fileId": "1000139830",
      "name": "HTCastingRegen_1.1.0",
      "version": "1.1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1103",
      "fileName": "HTCastingRegen_1.1.0-60949-1-1-0.7z",
      "uploadedUnix": "1419287449",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bf91fa1e98a84fb0eb0d8cb394c64e3ea06688499e6895c2c1c4db80c9153e77/analysis/1419287462/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HTCastingRegen_1.1.0-60949-1-1-0.7z?fid=1000139830&ttl=1535849088&ri=8192&rs=8192&setec=95812f5162b556fdf6a543b43484dab0"
    },
    {
      "fileId": "1000140060",
      "name": "HTCastingRegen_1.1.1",
      "version": "1.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1106",
      "fileName": "HTCastingRegen_1.1.1-60949-1-1-1.7z",
      "uploadedUnix": "1419439250",
      "modVersion": "1.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/3f8c432d2cb52d5cb67e09fa87fb91d0faf5ce00cb2ac5b21776e8621c91d642/analysis/1419439264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HTCastingRegen_1.1.1-60949-1-1-1.7z?fid=1000140060&ttl=1535849089&ri=8192&rs=8192&setec=f9f06f754918b026c0f2d1e64ed565ed"
    }
  ]
}