{
  "modId": 60976.0,
  "modName": "Falasmaryon Revamped",
  "summary": "After a long hyatus working on my game, I decided to take this house mod back to the creation kit for a total revamp during this winter break.\r<br />Note that the page itself is devoid of file, it currently acts as a placeholder and screenshot dump.",
  "descriptionHtml": "After a long hyatus working on my game, I decided to take this mod back to the creation kit for a total revamp during this winter break.\r<br />However, this page is only a placeholder for this month due to a reason I will cite later on. I have taken a few screenshots to show you the early goings of my work, [b][size=3]but please forgive the lack of proper lightning in them[/size][/b], as I have yet to finish that part of the cells.\r<br />[size=4][b]\r<br />[b][u][size=6][color=#00FF00][color=green] [b]Will update on progress here:[/b] [/color][/color][/size][/u][/b][/b][/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[b][u][size=6][color=#00FF00][color=orange] [b][u][size=6]A question to the viewers:[/size][/u][/b] [/color][/color][/size]\r<br />[/u][/b]\r<br />It has been a long time the DLCs has been released, but I still decided to stick to the vanilla resources so that anybody could download my mod.\r<br />There has been however, quite a lot of interiors and meshes I would absolutely love to use in both Dawnguard and Dragonborn. Before it is too late, I would like your opinion weither or not you wish me to keep my work Vanilla-oriented, or integrate the beautiful elements of those 2 DLCS for an even more awesome looking underwater mountain dwemer self-powered superfortress.\r<br />\r<br />[b]Why not release a separate DLC plugin then ?\r<br />[/b]\r<br />If I&#39;m going to integrate parts of these lovely models, I won&#39;t do it half assed. They will be a permanent part of the architecture and design as such that it would probably take me way too long to release another version of my mod rather than a bonus plugin with a few added cells.\r<br />\r<br />\r<br />[size=5][b][u][size=6][color=#00FF00][color=green] [b][u][size=6]Lore, if you really insist on integrating it into the TES World:[/size][/u][/b] [/color][/color][/size][/u][/b][/size]\r<br />Nilos Fyr, disciple of the immortal Telvanni mage Divayth Fyr himself, has long since discovered the secrets of dunmer magick as well as, with the help of Yagrum Bagarn, the last of the dwemers, the long lost aether discipline. Fleeing his old master&#39;s wrath following a freak accident, Nilos quickly began searching for exile, a barren place where he could practice his new powers in peace. To the south of Vvardenfel lays the terrible Black Marshes, Argonians filled with hatred for years of slavery against the dark elves, and to the north stands Solstheim, too dangerous with the ash rains affecting the island. The most viable solution were the frozen wastelands of Skyrim. Nilos thus established his new lair in the depths of a high mountain, inside it&#39;s groundwater. Combining the finest of dwemeri technology along with forbidden Telvanni spells, the apprentice managed to build a powerful facility all alone, self-powered by his near endless source of energy. &#34;The name will be Falasmaryon, the Ashen Stronghold, in remembrance of our lost legacy&#34;.\r<br />It&#39;s owner long gone, it is up to the dragonborn to climb the tall peaks and discover the existence of the fortress.\r<br />\r<br />[size=5][b][u][size=6][color=#00FF00][color=orange] [b][u][size=6]So, what does this mod has to offer ?[/size][/u][/b] [/color][/color][/size][/u][/b][/size]\r<br />[size=3]It is far from being completed, but the basic designs and many of the custom statics have been implemented to give out a clear idea of what will be the end product.[/size]\r<br />\r<br />\r<br />\r<br /> [b][u][size=6][color=#00FF00][color=yellow] -Multiple separate cells to avoid lag and ease access, covered as a dwemer elevator system: \r<br />[/color][/color][/size][/u][/b]\r<br />Rather than long horizontal corridors to tire the already tired Dovahkiin after his daily dragon-slaying routine, the mod gambles on a vertical approach with a simple elevator, equipped with multiple buttons directly leading to the provided rooms.\r<br />\r<br /> [img]https://imageshack.com/i/idTelKLSp[/img]\r<br />\r<br />\r<br /> [b][u][size=6][color=#00FF00][color=yellow] -A rather.. Unique design \r<br />[/color][/color][/size][/u][/b]\r<br />If there is one thing I may boast about, it would probably be the overall design of the home, with a custom architecture combining multiple in-game statics to become one. The excessive use of custom meshes from resources and others will also ensure you that it has absolutely nothing in common with any other house mods. \r<br />\r<br /> [img]https://imageshack.com/i/p9Yz9fjVp[/img]\r<br />\r<br />\r<br />[b][u][size=6][color=#00FF00][color=yellow] Amongst the features: [/color]\r<br />\r<br />[/color][/size][/u][/b]\r<br />[size=4][b][u][color=#00FF00][color=orange]  -Aquariums, aquariums everywhere &#33; \r<br />[/color][/color][/u][/b][/size]\r<br /> As a fan of bioshock, it was my wish to make a house mod that would look as close as rapture would be. Every room has a view upon the natural groundwater mentionned in the lore, and have been carefully crafted to be an enjoyement to admire every time.\r<br />\r<br />[img]https://imageshack.com/i/paRvcTXWp[/img]\r<br />[img]https://imageshack.com/i/exyQC0H1p[/img]\r<br /> \r<br />\r<br />[size=4][b][u][color=#00FF00][color=orange]  -Crafty dwemer appliances in the various rooms. [/color][/color][/u][/b][/size]\r<br />\r<br />Powered by Atronach energy, the stove of your kitchen looks like no other in Skyrim. \r<br /> \r<br />[img]https://imageshack.com/i/ipnbGOf7p[/img]\r<br />\r<br />\r<br />Same goes for the Hall of Arcanum where your enchanting will be assisted with powerful tomes, collected by the Telvanni mages.\r<br /> \r<br />[img]https://imageshack.com/i/f0CjP1ncp[/img]\r<br />[img]https://imageshack.com/i/ex9Uwl6Ip[/img]\r<br />\r<br />For Nords that live in the belief that magic is for puss... female sabertooth cats, the assisted mechanic forge will provide help with the fiery breath of a dragon&#39;s throat &#33; \r<br /> \r<br />[img]https://imageshack.com/i/exlOG6qDp[/img][color=#00FF00]\r<br />[/color]\r<br />\r<br />Rather on the dark side of the moon ? Find the (not so much) hidden Poisoner&#39;s Nook where you can brew deadly concoctions while hailing Sithis &#33;\r<br />Don&#39;t stare too much at the altar though, it will give you a headache.\r<br /> \r<br />[img]https://imageshack.com/i/p7i6qCzHp[/img]\r<br />\r<br />\r<br />Preparing for adventure ? Or just here to deposit your loot ? Connected to the Hall of the Wolverine, the War room provides a strategy table, a treasure vault underneath your feet guarded by a fake steam-powered dragon and a place for your companions to await your orders &#33; If you look closely, beyond the aquarium lays the shadow of a long forgotten colossus... A replica of the Numidium. What exactly would it be doing there ?\r<br /> \r<br />[img]https://imageshack.com/i/p9eevWNSp[/img]\r<br />[img]https://imageshack.com/i/exNZ822tp[/img]\r<br />\r<br />\r<br />A penthouse for you and your favorite follower awaits. Admire the finest of dwemer technology here, with a view both on the subterranean groundwater of the mountain, as well as a fake Space with two artificial moons, based on Masser and Secunda &#33; With a separate companion private room, If you decided to make Lydia swear to carry your burdens, she will be able to keep a close, emotionless eye on you every night... Or just glare at the fishes and the stars.\r<br />\r<br />[img]https://imageshack.com/i/f04VkKO2p[/img]\r<br />[img]https://imageshack.com/i/paA8mZKVp[/img]\r<br /> \r<br />\r<br />\r<br />\r<br />\r<br />ACCESS:\r<br />WIP\r<br />\r<br />ADDITIONAL ROOMS:\r<br />-Bath House - WIP\r<br />-Sky Garden (based on gorillaz&#39;s Feel good inc Island) - WIP\r<br />\r<br />\r<br />\r<br />[size=5][color=#00FF00][color=red] Credits: [/color][/color]\r<br />[/size][b][size=4]NOTE[/size][/b]: due to the sheer amount of custom resources used (over 100 new meshes) It is highly possible that I may forget a name even after checking the creation kit for every models and it&#39;s creators. If you see a content that belongs to you and you aren&#39;t on the credit list, please inform me immediately, I will add your name as soon as possible.\r<br />\r<br />-Insanity for an insane amount of clutters\r<br />-Tamira for various models\r<br />-Reaper for his portraits\r<br />-EnaiSiaion for his awesome dwemer models\r<br />-Denkigroove for the Magic Pyramid\r<br />-Dragonporn for Mead Quantum\r<br />-Kanra for the window model I made extensive use of\r<br />-Funktasm for his dunmer models\r<br />-Newermind43 for his sword model\r<br />-Blary for his dwemer aquarium models\r<br />-Strotti for his cannon resource and many more models\r<br />More to come...\r<br />\r<br />[color=#00FF00]THERE WILL BE custom music included for the dwemer jukebo... I mean Steam Bard with CCBY Music, but I am also planning on asking certain independent pro composers such as Adrian Von Ziegler for permission to use their works in mine.\r<br />\r<br />I may also require the help of an expert scripter for some nifty gadgets and button functionalities. [/color]\r<br />\r<br />If you wish to use assets included in this mod that do not belong to Bethesda, please ensure to ask permission to the appropriate creator in the credit list before use. Modify my mod and republish it to your liking if you wish as I do not ask for permission, but please include my name in the credits.",
  "categoryId": "67",
  "version": "0.0",
  "author": "BamfuPanda AKA Tigerpelt",
  "createdUnix": "1419249304",
  "updatedUnix": "1419249304",
  "containsAdultContent": false,
  "uploadedBy": "BamfuPanda",
  "primaryFile": null,
  "files": []
}