{
  "modId": 60984.0,
  "modName": "The Biographer - Feasts-On-Flesh",
  "summary": "",
  "descriptionHtml": "[b][size=6]ABOUT[/size][/b]\r<br />\r<br />The Dovahkiin has never been one for the histories has he? Plundering age old artifacts, ruining millenia untouched tombs, disturbing the remains of those long dead. Well, being the egotist we all know and love, maybe they’ll have a little more care when it’s their own legacy under the spotlight. But alas&#33; It seems the details of the Dovahkiin’s story will be lost, such as their brave balancing of the cheese wheel on Ulfric Stormcloak’s head, or the time they threw their Housecarl off the Throat of the World. So you know what they need? Therapy. And a biographer so they don’t get forgotten and stuff too.\r<br />\r<br />If you want a mod that cements your accomplishments in the world of Skyrim to the overture of a choir of sweated muscly barbarians singing in a choir, sadly this isn’t the mod for you. In fact, Feasts-On-Flesh isn’t even that good of a biographer, he stinks, he whines, and you don’t want to know what he’s using for a substitute for ink, but he’s the only one mad or desperate enough to follow you to your near certain doom.\r<br />\r<br />[youtube]J201lV7_eFw[/youtube]\r<br />\r<br />[size=6][b]FEATURES\r<br />[/b][/size]-       300 lines of dialogue so witty it’ll make you want to pluck your own eyes out\r<br />-       A follower system so vanilla you’ll overdose on it\r<br />-       A custom voiced Argonian follower&#33;\r<br /> [size=6][b]\r<br />FREQUENTLY ASKED QUESTIONS\r<br />[/b][/size][b]\r<br />Does he conflict with anything?[/b]\r<br />Uh… it shouldn’t? He’s completely vanilla and doesn&#39;t have quests implemented yet, so I’d be pretty impressed I managed to screw up that bad if he conflicts.\r<br />\r<br />[b]Does he use custom resources?\r<br />[/b]Nope. We’ll probably use a custom Argonian skin at somepoint, but for now? Just base resources.\r<br />\r<br />[b]Where can I find him?\r<br />[/b]The Winking Skeever in Solitude is his usual hangout,probably trying to forget his recent reading of The Lusty Argonian Maid with copious amounts of alcohol.\r<br />\r<br />[b]He won&#39;t do anything when I activate him?\r<br />[/b]This happens sometimes in the first conversation, just save and reload while in the same room. I&#39;ll work on a permanent fix on the next update.\r<br />\r<br />\r<br />[b][size=6]CREDITS[/size]\r<br />[size=2]\r<br />[/size][/b]Deck16 for his thorough guide on the creation of a custom voiced follower, this would have literally been impossible without it&#33;\r<br />Mur4s4me for his constant feedback and constructive criticism&#33;\r<br />\r<br />We are open to criticism of any kind, especially since this is our first mod and want to try and learn from the experience. If you can give us a tutorial, even better&#33; ",
  "categoryId": "96",
  "version": "1.1",
  "author": "DnKProductions",
  "createdUnix": "1419283510",
  "updatedUnix": "1419555618",
  "containsAdultContent": false,
  "uploadedBy": "DnKProductions",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140178",
      "name": "DnKFeasts1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "119478",
      "fileName": "DnKFeasts1.1-60984-1-1.zip",
      "uploadedUnix": "1419555618",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5a427855b08a9f707fdea5b2b54319661d7cf9ca6145d69bf9a14293529eb685/analysis/1419555684/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DnKFeasts1.1-60984-1-1.zip?fid=1000140178&ttl=1535849146&ri=8192&rs=8192&setec=4ad2ab0240b6b2bd67cd1c0049982e05"
    }
  ]
}