{
  "modId": 60987.0,
  "modName": "Snakey the Scaled Saviour Image Pack",
  "summary": "All hail to the Hiss&#33; The One Great Snake demands your attention&#33;",
  "descriptionHtml": "This is the only valid mod on the nexus, dedicated to my Lord and Saviour Snakey. I act as His vessel to spread His message, and He wants you to help Him as well.\r<br />He has filled the archive He wants you to download with two folders:\r<br />\r<br />[color=blue]modding tools\r<br />[/color]\r<br />This folder contains various images you may use to appreciate his greatness in the Skyrim nexus hot files. This is what you want to do:\r<br />\r<br />[img]http://i.imgur.com/Xr6c4Zn.jpg[/img]\r<br />\r<br />His Holyness offers various different images for your pleasure.\r<br />\r<br />- A single full Snakey for a single hot file\r<br />- Three unnumbered Snakey parts for those that occupy two or more hot file slots\r<br />- Six numbered Snakey parts to form a full perfect Snakey throughout the entire nexus main page\r<br />\r<br />All hail to the hiss.\r<br /> It is written that a Snake of length two or more brings great luck to its architects, for the image of His glory must be spread.\r<br />\r<br />If a Snakey is assembled from at least three parts, The Snakeying is called down upon earth, which will bestow all of his followers with a streak of great fate.\r<br />\r<br />If a perfect Snake is formed, using the numbered images in the correct order, The Perfect Snakeying takes place. Such a thing only happens once per millennium. It is said that The Saviour itself manifests on earth during The Perfect Snakeying, but no one ever witnessed The Perfect Snakeying.\r<br />\r<br />I encourage every modder on the nexus to help make this happen, and I encourage every user to spread this message across the world.\r<br />\r<br />[color=blue]fanart\r<br />[/color]\r<br />A tasteful collection of art pieces, created by Snakey&#39;s loyal following. Unlike false &#34;gods&#34;, Snakey encourages the creation of images in His likelyness. Use these to enrich your life, and become a better person under His guidance.\r<br />\r<br />Hail Snakey&#33;",
  "categoryId": "82",
  "version": "999",
  "author": "T3nd0 guided by His hand",
  "createdUnix": "1419286235",
  "updatedUnix": "1419286220",
  "containsAdultContent": false,
  "uploadedBy": "T3nd0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000139824",
      "name": "AllYouEverNeed",
      "version": "999",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3510",
      "fileName": "AllYouEverNeed-60987-999.7z",
      "uploadedUnix": "1419286220",
      "modVersion": "999",
      "virusScanUrl": "https://www.virustotal.com/file/ab9c8ad2a07717f31d60764a0ddd081812aaf76b0f8493752572d0d0309abeef/analysis/1419286264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AllYouEverNeed-60987-999.7z?fid=1000139824&ttl=1535849149&ri=8192&rs=8192&setec=5eecda859c494d504308eb7369d1e704"
    }
  ]
}