{
  "modId": 61007.0,
  "modName": "Ashling Raven-Mane",
  "summary": "A ranger, master of alchemy, capable with the Voice, and all in a very compact (as she would heatedly remind you) and sneaky package. She is my longest running character and also the principle character in my Skyrim fan-fiction. She will be getting all of my focus. ^-^",
  "descriptionHtml": "[center]-Her Story was modified from the original fanfiction &#34;Dragon Blood&#34; by small margins to make her work as a companion.-[/center]\r<br />\r<br />A strange woman, this Raven-Mane; daughter of the Blades, and with ancestors learned in the Way of the Voice. She even practiced herbalism for all of her life from poison to poultice to the point of mastery. She is more then happy to teach you, for a price. She is smaller then even your average Breton woman but her heart beats with the fury of a Nord&#33;\r<br />\r<br />Her Story:\r<br />Ashling was a hunter and alchemist like her dad and mom respectively. They lived in the wilds, North of Cheydinhal but at the foothills of the Jerral Mountains and overlooked Lake Arrius from it&#39;s Eastern Shore. She studied and practiced at her craft and eventually began to teach her brother Bjorn. She was barely twelve summers in age.\r<br />\r<br />Since she was a little girl, she had a deep curiosity, especially when it came to the dragons. She never believed anyone when they told her they were a myth. She read about them, Jarl Olaf One-Eye, about the Dragonborne of old and the ancient Akavirii dragon hunters. \r<br />\r<br />Her father taught her how to fight and when she turned nine he taught her about the thuume, the Voice. Her father&#39;s ancestor was a Grey Beard and the knowledge to shout was passed down through the family line, hoping to prepare them for next Dragonborn Emperor to return. You see, her parents were once part of the Blades organization before the White-Gold Concordate and they hoped that she would take up the mantle. \r<br />\r<br />Eventually, the Thalmor operating in the area discovered her parents and she was forced to flee north with her brother. They barely made it to Whiterun before she heard the news of a dragon attacking Helgen. Something within her told her to stay near the Jarl and listen while offering aid to the court wizard with her knowledge in dragon shouts. That is until a stranger came into the hall, with first-hand information of the attack and she resolved to go with this individual. She had to see one with her own mystified eyes. She needed a purpose again and it would seem, it would be to help this stranger save the world.\r<br />\r<br />[center]==========[/center]\r<br />\r<br />With her you get:\r<br />- A master alchemist trainer.\r<br />- She naturally dual-wields her weapons and sneaks. She is essentially a ranger.\r<br />- She has Savior&#39;s Hide as her default armor (until I can create my own) \r<br />   - This armor is hers. She caught the wolves to make it. She wont easily give it up. ;P I have it set as her default armor.\r<br />- A character that uses three shouts. You will hear them soon enough. ;) \r<br />   Locked Version: Shouts are restricted to being used once a day, like racial daily powers.. to reduce the frequency and one-sided fights.. The dragonborn should not be up-staged by a mere mortal, right? ;P\r<br />   Unlocked Version: Shouts normally\r<br />- A very short Nord woman with .9 height. (slightly shorter then a breton woman)\r<br />- A marriageable follower. (She uses even-toned female/Lydia voice) \r<br />- A cute companion who does not look like a supermodel or a porn star. That always annoyed me, now that I think about it. ^^;;\r<br />\r<br />[center]==========[/center]\r<br />Location:\r<br />\r<br />You will find her working away at the alchemy workbench in [b]Dragonsreach behind Farengar[/b]. I ran this with other mods that use the same area and she navigated the area just fine.\r<br />\r<br />[center]==========[/center][center][/center]- This mod contains or will contain assets from other mods. At least one mod author wants to keep his/her assets Nexus exclusive. I will not permit my mod to be uploaded anywhere outside of the Nexus. Please ask me if you want to use something and I will either redirect you or decide on a case by case basis. If permitted, please give the proper credits.\r<br />[center]\r<br />==========[/center][center][/center]\r<br />Goals and plans for Ashling:\r<br />- I will be making her armor which has a story of it&#39;s own. ;) This armor is what the credits below are about.\r<br />- If I can figure out how, I will build a quest and a dungeon centering on said armor.\r<br />- I want to eventually expand on her affection, not too dissimilar to my favorite modded companion &#34;Arissa&#34;.\r<br />- Eventually, completing her quests would build her affection enough so she will be marriageable. \r<br />- Making my own custom hair. I hope to have it in a bun with two needles holding it together.\r<br />- If there are more options for voice files for her, I would like to work on her commenting on her surroundings and react to quest decisions.\r<br />\r<br />If anyone has thoughts or suggestions, please message me. :)\r<br />[center]\r<br />==========[/center]\r<br />\r<br />Bugs: \r<br />With the locked shout version, there has been instances of not only her shouts being limited to once a day powers but the player&#39;s\r<br /> as well. To help with this I made an unlocked version which takes away \r<br />the once a day restriction. This also removed the flag from the player \r<br />so it should work normally again.\r<br />\r<br />                                          ==========\r<br />\r<br />Whether by blanket permission or expressed, the mods listed below were or will be used. These mod authors have all of my gratitude. :)\r<br />\r<br />- Ebony Mage Robes by Natterforme - http://www.nexusmods.com/skyrim/mods/21341/?\r<br />- Immersive Armors (Ebony Mage Robes fixes) by hothtrooper44 - http://www.nexusmods.com/skyrim/mods/19733/?\r<br />- Raven Witch Cape by Zerofrost Satyr - http://www.nexusmods.com/skyrim/mods/36497/?\r<br />- Reshaped Ebony Helmet by CalvinShark - http://www.nexusmods.com/skyrim/mods/57160/?",
  "categoryId": "96",
  "version": "v0.2",
  "author": "Duckbat",
  "createdUnix": "1419339234",
  "updatedUnix": "1487757373",
  "containsAdultContent": false,
  "uploadedBy": "ducky92704",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140207",
      "name": "Ashling Raven-Mane (Locked Shouts)",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "503",
      "fileName": "Ashling Raven-Mane-61007-.7z",
      "uploadedUnix": "1419584994",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d2a97d9807425a72fbc791daad8b67e08f8f993940fbc1f60df27a827531d715/analysis/1419585003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ashling%20Raven-Mane-61007-.7z?fid=1000140207&ttl=1535849189&ri=8192&rs=8192&setec=b6eae82be61e43cfb24e89707aa6c583"
    },
    {
      "fileId": "1000237018",
      "name": "Ashling Raven-Mane (Unlocked Shouts)",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "503",
      "fileName": "Ashling Raven-Mane (unlocked shouts)-61007-.7z",
      "uploadedUnix": "1487757373",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d2a97d9807425a72fbc791daad8b67e08f8f993940fbc1f60df27a827531d715/analysis/1487757722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ashling%20Raven-Mane%20%28unlocked%20shouts%29-61007-.7z?fid=1000237018&ttl=1535849190&ri=8192&rs=8192&setec=5ac8d13a5322c8cd9f2c4b82494db85f"
    }
  ]
}