{
  "modId": 61024.0,
  "modName": "Appropriately Attired Housecarls",
  "summary": "Changes the Armor, Weapons and Perks of the Jarl&#39;s (and soon player&#39;s) housecarls to something that more suits their role as a royal bodyguard.",
  "descriptionHtml": "[size=3]**THIS IS A REUPLOAD OF MY ORIGINAL MOD. IT HAS UNDERGONE A LARGE UPDATE SO I REUPLOADED IT***\r<br />\r<br />Have you ever wondered why the Jarls of Skyrim equip their Housecarl&#39;s with very weak armor? Irileth, the royal bodyguard of the prestigious Jarl of Whiterun, the trade hub of Skyrim, is equipped with the armor that your average beggar could craft with the hides from a wolf. Every wondered why Unmid Snow-Shod, the Housecarl of a Stormcloak Jarl, wears the armor of the very faction he is opposed against? Ever wondered why the Housecarl of the Jarl of Winterhold isn&#39;t wearing armor at all? Even if you hadn&#39;t noticed these oddities before, you sure will now, and that is where this mod comes into play.\r<br />\r<br />[color=#1e84cc][color=#38761D][color=#cc0000][color=#ff7700]What is the purpose of this mod?\r<br />[/color][/color][/color][/color]The purpose of this to equip the Housecarls of Skyrim with something worth their status. Many of the Housecarls in the game come equipped with some very basic armor. Irileth, is a striking example of this. Her Jarl is the ruler of the richest hold in Skyrim, and she is equipped with some run-off-the-mill leather armor? That&#39;s just insane. This mod really came up from the annoyance of seeing Irileth with that leather armor, but it has come a bit further now.\r<br />\r<br />[color=#ff7700]What does this mod do?\r<br />[color=#ffffff]This mod changes the armor, weapons, and perks of the Housecarls to give them a more intimidating look and to increase immersion. It also allows the housecarls to defend their Jarl if need be. The armor and weapon changes to each Jarl are as follows (perk changes are in ReadMe)\r<br />\r<br />[/color][/color]Galmar Stone-Fist of Eastmarch: No changes were made because his armor suits his role as a Stormcloak commander well.[/size]\r<br />\r<br />[size=3]Helvard of Falkreath: Scaled Armor to Steel Plate Armor and Steel Mace to Orcish Mace\r<br />\r<br />Bolgeir Bearclaw of Haafingar: Steel Plate Armor to Ebony Armor and Orcish Swords to Ebony Swords\r<br />\r<br />Gorm of Hjaalmarch: Studded Armor to Steel Plate Armor and weapon was not changed\r<br />\r<br />Jod of The Pale: Pale Guard Armor to Scaled Armor and weapon was not changed\r<br />\r<br />Faleen of The Reach: Steel Armor to Dwarven Armor and Steel Sword to Dwarven Sword\r<br />\r<br />Unmid Snow-Shod of the Rift: Elven Armor to Scaled Armor and Steel Greatsword to Orcish Greatsword\r<br />\r<br />Thaena of Winterhold: Farm Clothes(lel) to Steel Armor and Iron Dagger(lel) to Steel Waraxe\r<br />\r<br />Irileth of Whiterun: Leather Armor to Ebony Armor and Steel Sword (Frost) to Elven Sword (Fire) and Shock Spells to Fire[/size]\r<br />\r<br />[color=#ff7700][size=3]Installation\r<br />[color=#ffffff]Installing this mod is very similar to the installation of most mods on the Nexus\r<br />\r<br />1) Click the &#34;Download with Manager&#34; button in the files section.\r<br />2) Activate the mod in the mods tab/section.\r<br />\r<br />If you would instead like to install the mod manually, simply download the file and extract the included ESP file into your Data folder, which is located inside of your main Skyrim installation.\r<br />\r<br />[color=#ff7700]Credits\r<br />[color=#ffffff]This mod would have obviously not been possible without Bethesda and the creation of Skyrim.\r<br />aMidianBorn Team, NebuLa1, and Phinix for mods used in screenshots (Book of Silence, Skyrim HD, Phinix Natural ENB)[/color][/color][/color][/size][/color]",
  "categoryId": "33",
  "version": "1.0",
  "author": "Zediious",
  "createdUnix": "1419400834",
  "updatedUnix": "1419400653",
  "containsAdultContent": false,
  "uploadedBy": "Zediious",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000139997",
      "name": "Appropriately Attired Housecarls",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Appropriately Attired Housecarls-61024-1-0.zip",
      "uploadedUnix": "1419400653",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/579fc7eb5ecb65a976b1dce62be8f403765ecc50ec231c0dff9d49290aff2f50/analysis/1419400682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Appropriately%20Attired%20Housecarls-61024-1-0.zip?fid=1000139997&ttl=1535849220&ri=8192&rs=8192&setec=abd0b8af0c79ed22112b124ee409b827"
    }
  ]
}