{
  "modId": 61040.0,
  "modName": "The Warrior&#39;s Abode",
  "summary": "A warm and welcoming player home, in the mead-hall style, which stays entirely true to Skyrim&#39;s nordic themes. The aim is for it to be small and cozy, lore-friendly, and highly-functional.",
  "descriptionHtml": "[b]The Warrior&#39;s Abode\r<br />\r<br />[center][img]http://i.imgur.com/TedUwzv.png[/img][/center]\r<br />[/b]\r<br />[b]Overview:[/b]\r<br />A warm and welcoming player home, in the mead-hall style, which stays entirely true to Skyrim&#39;s nordic themes. The aim is for it to be small and cozy, lore-friendly, and highly-functional.\r<br />[b]\r<br />Requires:[/b]\r<br />Skyrim + Dragonborn.\r<br />\r<br />[b]Location:[/b]\r<br />- North of Whiterun and Dragonsreach, just inside the tree/snow line. It&#39;s a stone&#39;s throw southeast of Volunruud.\r<br />\r<br />[b]Features:[/b]\r<br />- All crafting stations, including an outdoor forge with smelter, forge, grinding stone, workbench and tanning rack, as well as indoor alchemy, cooking and enchanting stations, and a staff enchanter. There&#39;s named storage for each station.\r<br />- Displays: eight mannequins, four weapon racks, two shield racks, four large display cases, and three large weapon racks, as well as a few smaller ones scattered about the house.\r<br />- Storage: custom and named storage for everything. Light armor, heavy armor, shields, melee weapons, archery equipment, staves; raw food, cooked food; leather and ingots; ores and pelts; alchemy ingredients, poisons and potions; soul gems; keys, scrolls, notes, books and journals (as well as plenty of bookshelves for displaying your books); gems, jewelry, clothing and more.\r<br />- A bed, and a spare bed for your followers.\r<br />- A bit of empty space (desk, shelves) that you can decorate as you choose.\r<br />- A chopping block and well outside (you&#39;ll need to place your own bucket), for Frostfall users.\r<br />\r<br />[b]What is NOT featured:[/b]\r<br />- The mod does not have General Stores integration.\r<br />- There is no Hearthfire integration; you&#39;ll need a separate mod to bring spouses or adopted children here to live.\r<br />- Dragon Claw/Dragon Priest Mask/Black Book Displays. I&#39;m very new to modding, and this building was designed for myself, so this is one thing I haven&#39;t yet tackled.\r<br />\r<br />[b]Mod Conflicts:[/b]\r<br />- I&#39;m not yet aware of any, but certainly anything that modifies the area where I&#39;ve placed the home will create a conflict.\r<br />[b]\r<br />Known Issues:[/b]\r<br />- At times, the custom scrolls containers&#39; scrolls will bounce around inside their bounding box. This can make them look as if they&#39;re floating, or untidy, but usually resolves itself in time.\r<br />- The pathing outside can get a little bit wonky. From time to time a horse or follower might sink into the snow, but it usually resolves itself. If not, fast travel or wait, or go into the house.\r<br />[b]\r<br />Credits:[/b]\r<br />Any failures are my own. Successes, however, will be largely thanks to user Darkfox127, whose amazing Youtube guides really helped me out. I&#39;m a very new modder and this is only my third or fourth attempt at a mod, and it&#39;s only the first that I consider good enough to release to others, and most of what I&#39;ve learned was through his tutorials. Seriously, go check &#39;em out, or check out his mods, on the slim chance that you haven&#39;t--they&#39;re amazing. If I recall right, most of the bookshelves/displays&#39; scriptings are from one of his resource packs. Credit also to Bethesda ofc; the mead house&#39;s banners at the very least are what&#39;s there default in Thirsk, and I think some of the torches, too.\r<br />\r<br />\r<br />[center]__________\r<br />\r<br />A beautifully-done showcase vid by Hodilton: \r<br />\r<br />[youtube]bKs8_Kh-wJQ[/youtube][/center]\r<br />\r<br />\r<br />[center]___________[/center]\r<br />[b]\r<br />Further Background/Information:\r<br />[/b]\r<br />I initially made this mod to satisfy my own desire for a small but functional home, warm and inviting, for my Nord. I wanted something central to the map, mostly around the Whiterun area, since I tend to spend a lot of time there. The nearby tundra also makes for great hunting, since I used the Hunting in Skyrim mod. In the end I settled on this particular spot mostly because of the glorious view. You can hop outside, sit in a chair on the porch, and just stare off at Dragonsreach out on the plains, and I love that.\r<br />\r<br />The mod is meant to be lore-friendly, inasmuch as obtaining your own mead hall for free can be. But hell, you&#39;re the Dragonborn, right? There&#39;s a VERY brief backstory shown in a letter you can pick up in the Riverwood Trader, but it&#39;s not necessary. The idea is that a strange old, blind Nord seer was inhabiting the place, keeping it clean for the mythical Last Dragonborn&#39;s arrival, and has now wandered off, leaving it to its rightful owner. But honestly, see it however you wish.\r<br />\r<br />The house itself is one large room, and then a smaller one off of that. Most of the main hall is a large, open space with the firepit taking central focus. On one side is the &#34;display&#34; and storage area for weapons and armor; on the other is the crafting area, with bookshelves, alchemy, enchanting, and staff enchanting, as well as planters with lots of herbs and mushrooms. The fire pit has a cooking spit, and nearby there&#39;s a table and storage for food, as well as a dining table. The items on this table do not respawn and should NOT fly all over every time you come into the house. The atmosphere is meant to be inviting and warm, with a roaring fire and an open floor plan. Yet the sides are meant to be somewhat cluttered, to give it a cozy feel, and make good use of the small space available. The home is definitely more suited to a Nord-type character, what with the hanging furs and shields, but should be thematically suitable for most playstyles to use.\r<br />\r<br />The bedroom has a main bed, storage for gems, jewelry and clothing, and a little &#39;bathtub&#39; (it has no function; it&#39;s just ornamental). There&#39;s a spare bed, and then a desk with custom storage for whatever extra books don&#39;t fit on the (many) shelves, as well as custom Journal storage, an invisible bookshelf with statue bookends, and custom storage for keys, notes and so on. There&#39;s a couple spare chests in this room for any storage that I might not have covered. There&#39;s also a couple small shrines in here for clearing your diseases.\r<br />\r<br />If there&#39;s a lot of call for it I may add a &#34;hidden&#34; basement, where I&#39;d move some of the displays and add additional storage, and maybe the dragon mask and claw displays, like a vault of sorts. However, I think it&#39;s probably enough as-is.\r<br />\r<br />A lot of the screenshots are taken &#34;furnished.&#34; While the dining room comes with food and dishes, most of the desk and alchemy shelves start off empty for you to decorate as you wish. As an example, have a look at the desk screenshot, then the one showing the custom desk storage--the former has been furnished in-game, the latter is empty as it&#39;ll be after download.\r<br />\r<br />A final note: this is my first uploaded mod. Please let me know if there&#39;s any mistakes or errors; I&#39;ve done my best to keep the file as &#34;clean&#34; as possible but accidents do happen. As always, save before installing.\r<br />\r<br />________________\r<br />\r<br />Like this home? Try my next project, the Rorikstead home where you unlock more wings as you progress through the game, [url=http://www.nexusmods.com/skyrim/mods/75081/?]Ragnar&#39;s Retreat&#33;\r<br />[/url]",
  "categoryId": "67",
  "version": "1",
  "author": "Feralkyn",
  "createdUnix": "1419448042",
  "updatedUnix": "1419447837",
  "containsAdultContent": false,
  "uploadedBy": "Feralkyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140070",
      "name": "The Warriors Abode",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "200",
      "fileName": "The Warriors Abode-61040-.zip",
      "uploadedUnix": "1419447837",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/89cc174d9e86d726b63594913125e01456fc9571f0d86e2e0de5ea788ae887e2/analysis/1419447843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Warriors%20Abode-61040-.zip?fid=1000140070&ttl=1535849244&ri=8192&rs=8192&setec=2f37bad9d6036e5ee355ed5b0052a8fa"
    }
  ]
}