{
  "modId": 61057.0,
  "modName": "College of Winterhold New Life Festival- A Holiday Mod",
  "summary": "This mod adds new spells (based on Candlelight/Magelight) and robes to get into the holiday spirit.  Additionally, a mage has come back from High Rock and will offer insight into the New Life Festival and you can pick up a copy of his published work on a particular Wayrest family New Life Festival.  His research assistant can also be found within t",
  "descriptionHtml": "[center][u][b]College of Winterhold New Life Festival: A Holiday Mod[/b][/u][/center]\n<br />[youtube]AW10PyOzg1s[/youtube]\n<br />\n<br />[b]Description:[/b]\n<br />The 25th of Evening Star is here!  In most of Tamriel this is not a special day, but in select provinces there are cities that celebrate the New Life Festival early.  \n<br />\n<br />What is the New Life Festival?  It is the celebration of the new year, going from Evening Star to the next Morning Star.  \n<br />\n<br />In this mod you will discover the origins of celebrating the New Life Festival on the 25th of Evening Star, and can find a few spells and robes to get into the holiday spirit for your mage.  Head off to the College of Winterhold and look around the main complex, a mage from High Rock has returned.  His research associate can also be found at the College, just head over to the Arcaneum, and you might be able to take her out on your adventures.\n<br />\n<br />[b]Happy Holidays![/b]\n<br />\n<br />[b]What is added:[/b]\n<br />-Two NPCs\n<br />-First NPC is partially voice-acted and is lore-friendly.  He is the mage wandering around on the main College of Winterhold campus.\n<br />-Second NPC is his research assitant and is a follower.  You can also marry her if you so choose.  She uses the default follower system.\n<br />-Adds a new book.  This book is a story of a particular family's experience of the New Life Festival near the 25th of Evening Star.\n<br />-Adds red and green non-replacing re-textures of the vanilla College robes and Warlock hooded and non-hooded robes, along with their accompanying hoods and boots.\n<br />-Adds five new spells\n<br />-The first two spells are Red and Green versions of Candlelight\n<br />-The next two spells are Red and Green versions of Magelight\n<br />-The final spell is a version of Candlelight that oscillates between Red and Green\n<br />-All new spells, books, and clothing can be bought from the wandering College mage.\n<br />\n<br />[b]Known Issues:[/b]\n<br />-The inventory art for the clothing is not updated (ran out of time for the holiday)\n<br />-The 1st-person art for the clothing is not updated (ran out of time for the holiday)\n<br />-The oscillation between Red and Green does not have a red glow when the red spell is active (ran out of time to fix for the holiday)\n<br />-Some of the first NPC dialogue is not voiced if you have sub-titles active.  This is due to the College of Winterhold faction dialogue inserting itself on the first NPC.\n<br />[b]\n<br />Potential Quirks:[/b]\n<br />-I am not a voice actor, and I did a quick/plain voice for the first NPC.  Apologize if he is not Breton enough.\n<br />\n<br />[b]Note:[/b]\n<br />-If there are any issues outside of the above issues or quirks, inform me.  I might not get to fixes till after the holidays.\n<br />-Also, this mod will be updated next year to be a bit more involved.\n<br />\n<br />[b]Credits:[/b]\n<br />-Audacity - for Sound Recording/Editing\n<br />-Windows Movie Maker - for the trailer\n<br />-Creation Kit Wiki - http://www.creationkit.com/Main_Page - as a scripting resource \n<br />-Open Broadcaster Software - https://obsproject.com/ - Recording the videos to showcase the mod, and record footage for the trailer. \n<br />-USEP Wiki - http://www.uesp.net/wiki/Main_Page - Used as a reference for the lore references used in new dialogue and text. \n<br />-GIMP - For the re-texturing\n<br />-NIF Tools - For the spell re-texturing\n<br />\n<br />[b]Revision History:[/b]\n<br />v 1.0:\n<br />-The initial release. Happy Holidays!\n<br />\n<br />\n<br />Follow me on Facebook for updates: [url=https://www.facebook.com/ArronDominionProductions/]Arron Dominion Productions[/url]",
  "categoryId": "78",
  "version": "1.0",
  "author": "Arron Dominion",
  "createdUnix": "1419497125",
  "updatedUnix": "1419497087",
  "containsAdultContent": false,
  "uploadedBy": "Arron Dominion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140132",
      "name": "College of Winterhold New Life Festival - A Holiday Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22324",
      "fileName": "College of Winterhold New Life Festival - A Holiday Mod-61057-1-0.zip",
      "uploadedUnix": "1419497087",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a3d4fc148d7d6c56af5d6609104757c91d2138192ca5669b4133973b3d2225fc/analysis/1419497112/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/College%20of%20Winterhold%20New%20Life%20Festival%20-%20A%20Holiday%20Mod-61057-1-0.zip?fid=1000140132&ttl=1535849264&ri=8192&rs=8192&setec=aada2641598cabcb7920eb3c3543b227"
    }
  ]
}