{
  "modId": 61130.0,
  "modName": "Movement Speed and Regen Edits",
  "summary": "EDITS MOVEMENT SPEEDS AND REGEN RATES. Compatible with just about everything.",
  "descriptionHtml": "Installation: Open the .rar file and put the .esp anywhere you want.\r<br />C:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim&#92;Data &lt;- might be a good place to put it.\r<br />C:&#92;Program Files (x86)&#92;Mod Organizer&#92;mods &lt;- This works too, make a file, name it lookimadeafile, and put the .esp there\r<br />OR, you could just download it with Nexus mod manager.\r<br />\r<br />\r<br />This is a small edit to movement speeds for NPCs(and player) - The main goal of these edits is mainly to make you spend your resources faster making every decision you make matter just a bit more, while also increasing their regeneration to make combat a bit faster and slightly less punishing.\r<br />\r<br />All without the need to download a massive overhaul, or even having to do this yourself. This is a mod I made for myself and decided to share, since I didn&#39;t really see many other mods that did the same thing.\r<br />\r<br />\r<br />base walking speed has been significantly increased, as well as running speeds in all directions(weapon sheathed)\r<br />Walk: 175.00 NPC_Default_MT All Directions.\r<br />Run:  Forw: 385.00, Back: 375.00, L/R: 380.00 &lt;- Very slight difference, you might not even notice it ingame.\r<br />Combat(The main purpose of this mod) will be altered slightly to give each weapon type(class) a different advantage or weakness.\r<br />Warriors(1h/2h) : are faster at charging(running forward) but not so good at walking backwards\r<br />F: 380 B: 360 Side: 370(to help dodge arrows and fireballs)\r<br />Archers(bow/cbow): are slightly slower than warriors, but more balance at back and forth, not so good side to side though.\r<br />F/B: 375 S: 360 - Quickshot perk will reduce the penalties to movement.\r<br />Magic casters: Can move at a decent speed when not casting, and have good strafing ability but slows down while casting.\r<br />F:375 B:365 L/R: 370 - Casting: F:365 B:355 L/R: 360\r<br />\r<br />Health/Magicka/Stamina Regens to almost all races has also been applied to make the game a bit faster paced.\r<br />Stamina drain rates have also been altered. Your stamina WILL run out very quickly if you sprint, however, sprint speed has been increased to make up for this. Essentially giving you a few seconds of actually sprinting. I doubt many people would be able to sprint for very long wearing a heavy suit of armor and carrying 100lb worth of stuff anyways, so I&#39;ve also edited the weight multiplier a bit to make your stamina run out faster the more weight you&#39;re carrying.\r<br />\r<br />Regen rates have been altered only slightly and realistically.\r<br />ex: Bretons and elves get improved magicka regen, but not so much stamina or health.\r<br />Argonians get improved health regen. Undead still don&#39;t regen health. However other monsters (such as dragons) have had their regen ability slightly improved.\r<br />\r<br />These changes DO stack with other mods that add the same effect. Ex. If you have a mod (like convenient horses) and have the horse speed setting turned all the way to 100%(Can&#39;t imagine why you&#39;d do that but, w/e) You might end up with a horse that will sprint across skyrim faster than a bugatti veyron going at top speed.\r<br />\r<br />It is compatible with 360 walk and run plus, but you&#39;d have to untick the change your walking backwards speed option.\r<br />\r<br />Regen rates have not been altered too much to help prevent infinite stamina/magicka.\r<br />In and out of combat health regen has been altered slightly, more regen out of combat, less during.\r<br />\r<br />This mod should work well with other Combat mods that alter AI(making those npcs smarter) Skyrim Behavior Organizer / Character Behaviors enhanced whenever a fully working version is released to make combat more fast paced and all actiony and stuff. Maybe get a mod that lets you dodge or something, or just bring a shield, that worked great for me.\r<br />\r<br />\r<br />\r<br />\r<br />This is also meant to work in conjunction with my difficulty setting edits - TBA\r<br />\r<br />\r<br />If I missed anything or you want to tell me how much harder(What I call fair) your game is now please feel free to comment.\r<br />Dragons are big, scary creatures. They shouldn&#39;t be as dangerous as a baby sea otter, even to the mighty dragonborn.\r<br />\r<br />\r<br />\r<br />Partner mod to: http://www.nexusmods.com/skyrim/mods/61143/?",
  "categoryId": "84",
  "version": "1.0.1",
  "author": "Darkwroth1",
  "createdUnix": "1419757769",
  "updatedUnix": "1419800919",
  "containsAdultContent": false,
  "uploadedBy": "Darkwroth1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140527",
      "name": "Run and Regen Edits",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "46",
      "fileName": "Run and Regen Edits-61130-1-0-1.rar",
      "uploadedUnix": "1419800919",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/bb9610c4610c13793ebe35a32c095c1974ed7c67568ffaf44098d60320b504b8/analysis/1419800942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Run%20and%20Regen%20Edits-61130-1-0-1.rar?fid=1000140527&ttl=1535849375&ri=8192&rs=8192&setec=c143ab0abc5d7efd52458502ee64969e"
    }
  ]
}