{
  "modId": 61148.0,
  "modName": "Enhanced Vampiric Drain",
  "summary": "The Vampiric Drain spell is now more powerful and its magnitude scales with the player&#39;s Destruction level and it gives Destruction experience. NO SCRIPTS INVOLVED&#33;",
  "descriptionHtml": "[center][size=3]Note: I&#39;ve only just started modding, and this is my first published mod. Any constructive input will be highly appreciated.[/size][/center]\r<br />\r<br />\r<br />The most powerful vampire NPCs in the vanilla game can absorb 20 health, magicka and stamina per second with their spell. The player, in comparison, only gets to absorb a measly 5 health points per second at vampirism stage 4. \r<br />\r<br />In addition to the sucky damage output the spell fails to provide experience towards leveling the Destruction skill, making it a less than ideal choice for vampire mages. \r<br />\r<br />This mod aims to address both of the above problems. Using Vampiric Drain on a valid target now levels up you Destruction skill. In addition the damage magnitude of the spell levels up with your Destruction skill. At its highest level your stage 4 spell will now be on par with the strongest NPC version in the vanilla game. \r<br />\r<br />\r<br />[b][size=4]Damage Magnitude[/size][/b]\r<br />\r<br />Unlike all the other spells in the game Vampiric Drain is not intended to be used at a certain level and then discarded in favor of a stronger spell. If you&#39;re playing a vampire you&#39;ll be using the same spell at level 1 and at level 81. That causes a balancing problem: modding the spell so it&#39;s strong enough at endgame levels makes it overpowered for a low-level character. Modding the spell to be appropriate at low levels makes it useless at higher levels. \r<br />\r<br />This means that the damage magnitude of the spell has to level up with the player. In this mod the damage done by the Vampiric Drain spell is calculated based on your current Destruction skill level. As your Destruction skill level increases, so does to the damage magnitude of your Vampiric Drain spell. \r<br />\r<br />The purpose of this mod is to give the player power equal to the strongest vampire NPCs in the game. The strongest NPC version of the Vampiric Drain spell drains 20 health, magicka and stamina, and NPCs using it are level 48 and above. I&#39;ve thus capped the leveling of the player&#39;s Vampiric Drain spell at Destruction level 50, where the stage 4 version will be identical to the strongest NPC version (absorbing 20 health, magicka and stamina). \r<br />\r<br />The scaling of the damage magnitude has been implemented without using scripts. It&#39;s done with a custom perk which scales both spell magnitude and spell cost of the Vampiric Drain spell according to the player&#39;s Destruction level. \r<br />\r<br />[b][size=3]Spell stats[/size][/b]\r<br />\r<br />[u][b]Vampirism stage 1[/b][/u]\r<br />Destruction level 1: Absorb 2 health per second (Base cost: 2)\r<br />Destruction level 50: Absorb 10 health per second (Base cost: 10)\r<br />\r<br />[u][b]Vampirism stage 2[/b][/u]\r<br />Destruction level 1: Absorb 2 health + 2 stamina per second (Base cost: 3)\r<br />Destruction level 50: Absorb 10 health + 10 stamina per second (Base cost: 15)\r<br />[u][b]\r<br />Vampirism stage 3[/b][/u]\r<br />Destruction level 1: Absorb 3 health + 3 stamina per second (Base cost: 5)\r<br />Destruction level 50: Absorb 15 health + 15 stamina per second (Base cost: 23)\r<br />[u][b]\r<br />Vampirism stage 4[/b][/u]\r<br />Destruction level 1: Absorb 4 health + 4 magicka + 4 stamina per second (Base cost: 10)\r<br />Destruction level 50: Absorb 20 health + 20 magicka + 20 stamina per second (Base cost: 50) \r<br />(Note: I realize that the stage 4 at level 50 looks rather high. You do, however, get 20 magicka right back from the target. I can&#39;t go any lower with the spell cost or you&#39;ll effectively be able to cast the spell for free at master Destruction level.)\r<br />\r<br />\r<br />[b][size=4]Experience Gain[/size][/b]\r<br />\r<br />From what I could see in the Creation Kit, the vanilla Vampiric Drain spell is actually set to provide experience without further tweaking. The settings are all there, and I can only assume that the Absorb Health effect used in the spell is somehow bugged beyond repair. \r<br />\r<br />To circumvent the bug I have added two invisible effects to the spell. These two effects are designed to cancel each other out, and they won&#39;t impair your game in any way. They do not provide any additional damage, they do not show up in the spell description in the magic menu, and they don&#39;t influence the way the spell looks when cast in-game. They also do not negatively impair the spell cost. The sole purpose of these effects is to provide a basis for an experience gain calculation. \r<br />\r<br />Again this is done [b]without using scripts[/b].  \r<br />\r<br />\r<br />[b][size=4]Installation[/size][/b]\r<br />\r<br />Unzip the contents of the .zip file into the Data folder of your Skyrim installation.\r<br />\r<br />\r<br />[b][size=4]Compatibility[/size][/b]\r<br />\r<br />This mod will probably [b]not [/b]work with other mods which also modify the Vampiric Drain spell. You can try to move the Enhanced Vampiric Drain mod lower in the load order. This might get both mods to work, but I can&#39;t guarantee it. \r<br />\r<br />\r<br />[size=4][b]Troubleshooting[/b][/size]\r<br />\r<br />This mod adds a perk to the player character which is responsible for the spell scaling. In case the leveling of the spell does not work, it&#39;s likely you&#39;ve loaded another mod after the Enhanced Vampiric Drain mod which makes a change to the player character. Now there are two fixes for that particular problem:\r<br />\r<br />1. Move Enhanced Vampiric Drain lower in the load order (this might cause the conflicting mod to break, though)\r<br />\r<br />2. Add the required perk through the console\r<br />Open the console and type\r<br />[font=Courier New]help &#34;Vampire Drain Spell Scaling&#34;[/font]\r<br />\r<br />You&#39;ll be getting something like \r<br />[font=Courier New]PERK: (0C0012CC) &#39;Vampire Drain Spell Scaling&#39;[/font]\r<br />\r<br />The part in parentheses is important - it&#39;s the RefID of the perk. Now type into the console\r<br />\r<br />[font=Courier New]player.addperk REFID[/font] (substitute REFID for whatever you&#39;ve gotten by running the previous command). \r<br />\r<br />Now the spell scaling should be working.",
  "categoryId": "75",
  "version": "1.0",
  "author": "DarkHeart79",
  "createdUnix": "1419811968",
  "updatedUnix": "1421773507",
  "containsAdultContent": false,
  "uploadedBy": "DarkHeart79",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143726",
      "name": "EnhancedVampiricDrain_v1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "EnhancedVampiricDrain_v1.0-61148-1-0.zip",
      "uploadedUnix": "1421773507",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/086fe0da74c5bff190a9ff935464bf084ce05d5eb87051165263377e8a623fa2/analysis/1421773562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EnhancedVampiricDrain_v1.0-61148-1-0.zip?fid=1000143726&ttl=1535849400&ri=8192&rs=8192&setec=a4e288792fe2a01b85248ef48920f1dc"
    }
  ]
}