{
  "modId": 61154.0,
  "modName": "Archibald&#39;s Summonable Horses",
  "summary": "A set of three summonable horses with unique textures.",
  "descriptionHtml": "Archibald has sent another letter to the Dragonborn, this time with three new summonable horses. This time, they&#39;re abit easier to find. Just got into the Drunken Huntsmen, find the note he&#39;s left for you (It&#39;ll be somewhere around the bar, or on the shelves under the bar). If you cannot find it, the note it in the bottom of this description. The note will tell you were you will have to steal the books from.\r<br />\r<br />This mod includes three tomes, which has the three spells for the horses. They have a high duration period so they&#39;re not likely to disappear on you before being killed in battle. They are as strong as any warhorse and are 150% the speed of average horses in Skyrim. They are set to unaggressive, but they will assist friends and player during a battle. You can only spawn one at a time, summoning one kills the other. All three horses have their own unique textures, drawing by myself and they use the vanilla meshes. They have no scripts so that any other mod should work with them easily.\r<br />\r<br />Notice: I wanted to have custom saddles, but I could not get the meshes to work. If someone would give me help as to how to merge meshes of the saddles and other vanilla meshes, I would make saddles as addons or something, or at least for any new horse that anyone wants.\r<br />\r<br />You shouldn&#39;t have any issues this time around. I double checked their functioning and their textures and should be working correctly. Just fine the tomes, learn the spells, and enjoy the horses.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />NOTE BELOW:\r<br />\r<br />\r<br />Dragonborn,\r<br />\r<br />Hello from an old friend. I found three more horses you might like, and this time, they&#39;re not just strong and fast, but they&#39;re summonable too&#33; So this time, if one of decides that they&#39;d like to kick you then you can just kill them and resummon them&#33; Plus, no more looking for the horse, they&#39;ll be right in your hand. Now, I&#39;m not giving them off to you right away, you have to find them. This one is easier though, just look through the Whiterun shops and you&#39;ll come across the three tomes eventually. They&#39;re called Warlord, Overkill, and Bloodmoon. Warlord&#39;s name says it all, he&#39;s a War stallion that got his soul locked away, poor thing. Overkill... we&#39;ll I&#39;m not quite sure where he&#39;s from, but he&#39;s an interesting  boy nevertheless. Bloodmoon is a little more interesting: he&#39;s not had the bloody past of Warlord, but he used to have history with the great Hunter himself. You know who I&#39;m talking about, right? Old Hircine himself, you&#39;ve probably already had dealings with him and that White Stag of his. If you haven&#39;t had dealings, say hello to Barbas when you do, he&#39;s an old friend of mine. I&#39;ll try to find you more horses, it&#39;s always fun to watch you try to follow where I lead you. \r<br />\r<br />-Archibald",
  "categoryId": "83",
  "version": "",
  "author": "-GladnxofxBakerStreet",
  "createdUnix": "1419833275",
  "updatedUnix": "1419833222",
  "containsAdultContent": false,
  "uploadedBy": "GladnxofxBakerStreet",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140572",
      "name": "Summonable Horses",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2336",
      "fileName": "Summonable Horses-61154-.zip",
      "uploadedUnix": "1419833222",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2209893d1bb29cc359834c0df1dda43d42cff471400ab93420cd31f8c987771a/analysis/1419833285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Summonable%20Horses-61154-.zip?fid=1000140572&ttl=1535849410&ri=8192&rs=8192&setec=20a0f2278e0d0069b3dae500a10079db"
    }
  ]
}