{
  "modId": 61166.0,
  "modName": "XunAmarox Modder&#39;s Resource",
  "summary": "Custom display script for artifact/treasure rooms, and a disenchanting font script.",
  "descriptionHtml": "[size=5]Description[/size]\r<br />I&#39;ll add some more stuff later after I finish my current project but I feel that these two things are severely needed by the modding community so I want to get them out there right away.\r<br />\r<br />[size=5]What&#39;s Included[/size]\r<br />As of right now there are just three scripts: One to create custom displays (e.g. for stuff like elder scrolls, thieves guild stuff, daedric artifacts, or whatever you want&#33;), another for a disenchanting font which removes all enchantments and improvements from an item placed in a container and returns it to the player. Well, you could call it a renewal font or whatever you want since it pretty much renews the item to its original state before anything was \r<br />done to it. And as of 1.3 a script to display animated objects (toggle their animation on/off) much like the display script does but it&#39;s set up for the Auriel&#39;s Bow Pedestal (a static version of it) so you&#39;ll need to edit the source and rename it for any other animated object you want to use it for. \r<br />\r<br />I&#39;ve also included an esp with a small test cell with the scripts implemented so you can study how the scripts work. You can go to the area via console with &#34;coc 0xtestlab&#34; and it&#39;s in the CK under 0xTestLab right at the top. As of 1.3 it&#39;s probably not too useful for showing the newer features. I recommend just taking a look at my [url=http://www.nexusmods.com/skyrim/mods/60909]Stormcrown Estate[/url] mod to see how I implemented the scripts if you&#39;re having issues.\r<br />\r<br />Tip: To create a static object of any item you don&#39;t need to extract it from the BSA just edit it in the Object Window and copy the entire line it lists under Model, something like Clutter&#92;Containers&#92;Satchel.nif and then when you create a new static object make sure you&#39;re in your Meshes folder then just paste that address and click Open.\r<br />\r<br />[size=5]How to use[/size]\r<br />aaXunDisplayScript\r<br />-Create a static item that will be what you are displaying and set it to initially disabled.\r<br />-Create a container (set to not respawn), and hide it off of the map like under the floor or behind a wall or something (hiding it is optional but recommended).\r<br />-Add the script to a new trigger.\r<br />-Go to Primitives tab and make sure player activation is checked.\r<br />-Go to the scripts tab and then Properties and click Auto-Fill.\r<br />-Hover over various sections for descriptions, it should be intuitive.\r<br />\r<br />Only one of DisplayArmor, DisplayWeapon, DisplayItem, DisplayBook, or DisplaySoulGem, should be used at a time and should point to the original item&#39;s BaseID. The words after Display are the category it falls under - Item is for MiscItem.\r<br />\r<br />DisplayReference should link to the disabled static item you added earlier, the script will enable/disable it based on whether the real item is added or not.\r<br />\r<br />DisplayContainer should link to the hidden container you created earlier. It doesn&#39;t need to be unique, you can use one container for your entire display setup.\r<br />\r<br />When activated, the script should take the item out the player&#39;s inventory, move it to the container, and enable the static item.  When activated again it will disable the static item and move the item back to the player&#39;s inventory. Any improvements or enchantments will have been retained.\r<br />\r<br />aaXunDisenchantingScript\r<br />-Add the script to a container, any container will do.\r<br />-Create a new Global under Miscellaneous/Global called RFontGlobal with variable type of short, value set to 0, and Constant left unchecked.\r<br />-Create a new message under Miscellaneous/Message called RenewalFontMSG and keep Message box checked, inside the text box add a warning letting the user know what&#39;s happeing for instance &#34;Items you place here will have all improvements and enchantments removed.&#34; or something.\r<br />-Go to properties in the script and click Auto-Fill.\r<br />-Done. Script will now work, any item added will be &#34;disenchanted&#34; and renewed to its original state. It&#39;ll also remove any smithing improvements done or renaming. Additionally, on its first activation the user will get the help pop-up that you wrote earlier.\r<br />\r<br />aaXunDisplayScriptAnim\r<br />Currently this one only works for the Auriel&#39;s Bow pedestal which you&#39;d want to create a static object for. If you wanted to use it for a different object you&#39;d need to edit the source and change &#34;AnimIdle01&#34; and &#34;AnimIdle02&#34; to the appropriate animations but if you&#39;re going to do that then ensure you change the name of your script before distributing it so it doesn&#39;t conflict with anyone else&#39;s. The animation names are listed when you prevew an item (right click &gt; preview)\r<br />\r<br />To set this one up you need to place a static copy of auriel&#39;s bow pedestal and then create an activator and add this script to the activator.\r<br />--Go to Primitives tab and make sure player activation is checked for your activator.\r<br />-Open the script and hit auto-fill, PlayerRef and defaultLackTheItemMSG should be filled for you.\r<br />-Set the DisplayContainer to the hidden container where the bow will be stored for safekeeping.\r<br />-Set the DisplayAnim to the static copy of the auriel&#39;s bow pedestal\r<br />-Set the DisplayWeapon to Auriel&#39;s Bow (DLC1AurielsBow)\r<br />Hit OK.\r<br />\r<br />[size=5]Permission[/size]\r<br />This is a modder&#39;s resource. You are free to re-use it, modify it, and include it in your mods as much as you want as long as credit is given.",
  "categoryId": "82",
  "version": "1.2",
  "author": "XunAmarox",
  "createdUnix": "1419870827",
  "updatedUnix": "1420039278",
  "containsAdultContent": false,
  "uploadedBy": "XunAmarox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140619",
      "name": "XunAmarox Modders Resource 1-0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "XunAmarox Modders Resource 1-0-61166-1-0.7z",
      "uploadedUnix": "1419870355",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f867df04bee073794e331fce9876cc0d8fc0325b1e612ea2be603acdc2eb8354/analysis/1419870362/",
      "changelogHtml": " Initial release. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XunAmarox%20Modders%20Resource%201-0-61166-1-0.7z?fid=1000140619&ttl=1535849430&ri=8192&rs=8192&setec=a3b9dfd28c7f0076befba28173428487"
    },
    {
      "fileId": "1000140784",
      "name": "XunAmarox Modders Resource 1-1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "XunAmarox Modders Resource 1-1-61166-1-1.7z",
      "uploadedUnix": "1420006328",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/860b150bb892cc698f2dbfe7b5c4f37102376e8766a2533a89f2039381daec27/analysis/1420006381/",
      "changelogHtml": " -DisplayItem renamed to DisplayMiscItem to avoid confusion.\r<br />-Linking the static reference to enable/disable to the activator is no longer required. It was just an oversight as we already set it in the script, now the script uses that variable rather than checking for linked references. It should be easier to do multiple displays now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XunAmarox%20Modders%20Resource%201-1-61166-1-1.7z?fid=1000140784&ttl=1535849430&ri=8192&rs=8192&setec=e91237fd00749589e133f47a08058925"
    },
    {
      "fileId": "1000140789",
      "name": "XunAmarox Modders Resource 1-2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "XunAmarox Modders Resource 1-2-61166-1-2.7z",
      "uploadedUnix": "1420011786",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e21df198c5e8781d86f92fa0a3cbd697bad7173064e0dca4ce25a836af08a8db/analysis/1420011842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XunAmarox%20Modders%20Resource%201-2-61166-1-2.7z?fid=1000140789&ttl=1535849431&ri=8192&rs=8192&setec=f7b1ae9d07208951b772417d7d190601"
    },
    {
      "fileId": "1000140815",
      "name": "XunAmarox Modders Resource 1-3",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "XunAmarox Modders Resource 1-3-61166-1-3.7z",
      "uploadedUnix": "1420039278",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/9f89dfd1d741f9eb5d169d4cd207c772c6422f9b48672b04c1fbcc8f1e4c09ff/analysis/1420039323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XunAmarox%20Modders%20Resource%201-3-61166-1-3.7z?fid=1000140815&ttl=1535849431&ri=8192&rs=8192&setec=a3ef39cdac32df73170f74f2f271227f"
    }
  ]
}