{
  "modId": 61208.0,
  "modName": "Unique And Improved Potions",
  "summary": "A mod that give most of the potions in Skyrim a unique look.",
  "descriptionHtml": "[color=#f1c232][size=6]-UPDATE IN PROGRESS-[/size]\r<br />I&#39;m currently working on an update for the mod. Release date TBA.[/color]\r<br />\r<br />[u][color=#fff2cc]PLEASE NOTE: THIS MOD REQUIRES ALL THREE DLCS&#33;&#33;&#33;[/color][/u] This mod is compatible with all of the unofficial patches and should work with any mods that don&#39;t modify potions and poisons. If you find a mod incompatibility please notify me.\r<br />\r<br />Steam Version: http://steamcommunity.com/sharedfiles/filedetails/?id=365930692 \r<br />\r<br />Tired of seeing different potions and poisons using the same bottle? Fear not&#33; This mod changes most of the potion and poison bottles so that each one has its own unique look. \r<br />\r<br />This mod also allows apothecary vendors to sell poisons that were previously unavailable, but were still in the game. It also replaces all of the old salmon steaks with the new Hearthfire salmon steak. Vendors should only sell the new salmon steak aswell. I&#39;ve also added a new food item called dog meat stew, so dog meat doesn&#39;t have to be eaten raw (yuck). Here is a complete changelog: \r<br />\r<br />&bull; Added a unique/new model for the following items: Ale, Argonian Ale, Esbern&#39;s Potion, Cure Disease, Cure Poison, All Resist Potions, All Weakness         Poisons, All Well-Being Potions, All Waterbreathing Potions, Philter of the Phantom, Cyrodilic Brandy, Nurelion&#39;s Mixture, Jessica&#39;s Wine, Stros M&#39;Kai Rum, Empty Skooma Bottle, Balmora Blue, Double-Distilled Skooma, Dragon&#39;s Breath Mead, Ashfire Mead, Mead with Juniper Berry, Falmer Blood Elixir, Ice Wraith Bane, Vaermina&#39;s Torpor, Colovian Brandy, Potion of Waterwalking, Stallion&#39;s Potion, Nightshade Extract, Soul Husk Extract, Cooked Beef (spiced   beef has the old cooked beef model), Rabbit Haunch, Cooked Pheasant, and Ancient Skull \r<br />&bull; The ancient skull and skeleton at Wayward Pass have a unique look \r<br />&bull; Slightly altered the texture for raw chicken meat and raw pheasent meat \r<br />&bull; Added a smaller slice of potato bread, just like regular bread has \r<br />&bull; Some potions now appear in the food category instead of the potions category \r<br />&bull; Most potions now only weigh 0.5 \r<br />&bull; Fixed lighting issues on some of the poison bottles \r<br />&bull; Fixed weakness poisons not casting shadows \r<br />&bull; Apothecary vendors now sell all poisons that were previously unavailable \r<br />&bull; Fixed some typos in the item names \r<br />&bull; Added some bottles of Colovian Brandy in the Thalmor Embassy \r<br />\r<br />I was not planning on releasing this mod while I was making it, so I wasn&#39;t making a changelog as I went. If I missed something in the changelog, please tell me. \r<br />\r<br />More pictures coming soon. \r<br />\r<br />My Website: goostudios.weebly.com",
  "categoryId": "94",
  "version": "1.0",
  "author": "gooball60",
  "createdUnix": "1419993448",
  "updatedUnix": "1419993236",
  "containsAdultContent": false,
  "uploadedBy": "gooball60",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140773",
      "name": "Unique And Improved Potions",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6501",
      "fileName": "Unique And Improved Potions-61208-1-0.zip",
      "uploadedUnix": "1419993236",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1e012bfee0fe40b9a2248c805b83ec2fa2b58ad73be0293f41123163ee9962fd/analysis/1419993245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20And%20Improved%20Potions-61208-1-0.zip?fid=1000140773&ttl=1535849482&ri=8192&rs=8192&setec=7b0e195f3d55765f7bc785c55172e6a3"
    }
  ]
}