{
  "modId": 61201.0,
  "modName": "Disable Smithing Upgrades",
  "summary": "Prevents the player from using Workbenches and Grindstones.",
  "descriptionHtml": "DOES NOT REQUIRE ANY DLC \r<br />What this mod does is very simple: It makes Workbenches and Grindstones unusable by the player (NPCs can still use them for immersion purposes), therefore preventing you from upgrading your Armor and/or Weapons. \r<br />Why would you want this? Well, there&#39;s a number of reasons you might want this. \r<br />1. To make the game more difficult. No explanation needed. \r<br />2. For immersion. Ever noticed how not a single NPC uses upgraded weapons or armor? Everything they carry (unless you personally give them something else) has the base armor/damage value for that item. Feels kinda wierd to be the only one with an Iron Dagger that does the damage of a Daedric Sword. \r<br />3. To discourage having to waste time maxing out smithing with every new character you make. Now there&#39;s no point to working on smithing unless you legitimately want to make your own items. \r<br />4. To play the game the way it was intended. Daedric Armor is the best, no exceptions. You can no longer turn your bikini into a walking fortress just because you made some smithing potions and enchantments. Furthermore, you can&#39;t just smith your way into being a master archer/swordsman/Heavy Armor user. You actually need to work on the skill now.\r<br />5. For balance. Being the only guy with an M60 at a watergun fight gets really old really quick (at least for me it did).\r<br />6. For a Classic Elder Scrolls feel.\r<br />If you can think of more reasons, be my guest. \r<br />Now you maybe the thinking: &#34;If I wanted to not upgrade my armor/weapons, I&#39;d just not use the benches. It&#39;s called self-control&#33;&#34; \r<br />Well, this mod is for people who can&#39;t quite control themselves, or, to put it a nicer way, who like to exploit every resource available but would prefer they didn&#39;t. It&#39;s the same reason &#34;No Fast Travel&#34; mods exist. \r<br />\r<br />Now, I&#39;d like to point out one string attached to this mod. \r<br />\r<br />This mod disables the Smithing tutorial quest, because it requires you to use a Grindstone and Workbench (I didn&#39;t want to modify any scripts to simply skip these sections of the quest because I want this mod to remain lightweight and script free. Instead, I changed the initial dialogue option conditions to something unattainable.) If you&#39;ve already started the quest but have not finished it, I recommend you keep this mod disabled until you do so as that will render it incompletable. Lastly, though it&#39;s not required, this mod would go best with starting a new game as you probably already have upgraded items on your existing character. \r<br />\r<br />Enjoy, and don&#39;t forget to endorse if you found this mod useful.",
  "categoryId": "85",
  "version": "1.2",
  "author": "grasscid",
  "createdUnix": "1419979968",
  "updatedUnix": "1419986895",
  "containsAdultContent": false,
  "uploadedBy": "grasscid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140766",
      "name": "No Item Upgrading",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "No Item Upgrading-61201-1-2.rar",
      "uploadedUnix": "1419986895",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b238fc8c8f22662c03d76d0f870086fc82c03c961419c934534170cd135439e8/analysis/1419986943/",
      "changelogHtml": " Realized I was going overboard with the scope of this mod. The only things the latest version does is prevent the player from using workbenches, grindstones and doing the smithing tutorial quest. That&#39;s it. No perk editing, no magic effects changed, none of that. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Item%20Upgrading-61201-1-2.rar?fid=1000140766&ttl=1535849473&ri=8192&rs=8192&setec=ec82ac10e8b239a2eed32a106b6826fd"
    }
  ]
}