{
  "modId": 61206.0,
  "modName": "SKYRIM ENHANCED SHADERS NLA - ENB",
  "summary": "A custom adaptation of the landmark Skyrim ENB preset Natural Lighting and Atmospherics by Confidence Man  Adapted by the author of the Skyrim Enhanced Shaders mod; the very first ENB preset to be released on Skyrim Nexus.  Includes adapted configuration, performance presets, & detailed installation and setup guide.",
  "descriptionHtml": "[img]http://static-1.nexusmods.com/15/mods/110/images/61206-1-1419988032.jpg[/img]\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/61206-1-1419989765.jpg[/img]\r<br />[color=#6fa8dc]\r<br />[/color][center][color=#6fa8dc][size=4][b]Enhanced Shaders NLA by tapioks[/b][/size][/color]\r<br />\r<br />[youtube]JVT1lcN4ZUI[/youtube] [youtube]UoeeRpAEv58[/youtube]\r<br />[youtube]PRsvInnltI4[/youtube][youtube]A_2S4Aye1kM[/youtube][/center]\r<br />[color=#f6b26b]\r<br />[b]TABLE OF CONTENTS[/b][/color]\r<br />\r<br />[list=1][*]WHAT IS ENHANCED SHADERS NLA?\r<br />[/*]\r<br />[*]OBJECTIVES OF THIS MOD\r<br />[/*]\r<br />[*]WHAT ABOUT NLA HAS BEEN MODIFIED?\r<br />[/*]\r<br />[*]DOWNLOAD INSTRUCTIONS\r<br />[/*]\r<br />[*]INSTALLATION INSTRUCTIONS\r<br />[/*]\r<br />[*]WHICH PERFORMANCE PRESET TO USE\r<br />[/*]\r<br />[*]SIMPLE TIPS FOR BETTER PERFORMANCE\r<br />[/*]\r<br />[*]RECOMMENDED VISUAL MODS[/*]\r<br />[/list][color=#f6b26b][b]\r<br />\r<br />WHAT IS ENHANCED SHADERS NLA?[/b][/color]\r<br />\r<br />Enhanced Shaders NLA is a custom adaptation of Confidence Man&#39;s landmark Skyrim ENB preset &#34;Natural Lighting and Atmospherics&#34;: [url=http://www.nexusmods.com/skyrim/mods/50065/]http://www.nexusmods.com/skyrim/mods/50065/[/url]? \r<br />\r<br />This adaptation is configured by tapioks (me), the author of the Skyrim Enhanced Shaders mod; the very first ENB configuration to be released on Skyrim Nexus back in November 2011:  [url=http://www.nexusmods.com/skyrim/mods/822/]http://www.nexusmods.com/skyrim/mods/822/[/url]? \r<br />\r<br />In my opinion, Natural Lighting and Atmostpherics (NLA) is by far the most realistic lighting / weather mod available for Skyrim, rendering the most natural (and least video-game feeling) image possible. Confidence Man&#39;s employment of ENB’s effects and his sense of accurate color representation is unsurpassed.\r<br />\r<br />Confidence Man has not updated NLA since March 2014, and after playing the game extensively with the latest release, I have identified a few aspects of the configuration that I feel bear some fine tuning.  I have discussed my intentions with Confidence Man and he has approved the publication of this mod.\r<br />\r<br />Rest assured, Confidence Man deserves 98% of the credit for the image quality of this mod, as this is simply a variation of his masterpiece.\r<br />\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/61206-5-1419989744.jpg[/img]\r<br />\r<br />\r<br />[color=#f6b26b][b]OBJECTIVES OF THIS MOD[/b][/color]\r<br />\r<br />- Provide a set of adjustments for Natural Lighting and Atmospherics to help improve the image quality and playability of the mod\r<br />\r<br />- Provide a set of quality presets so that users with a variety of hardware configurations will be able to enjoy some version of the mod\r<br />\r<br />- To provide clear installation instructions, including any supporting files and recommended mods to achieve optimal image quality, performance and stability.\r<br />\r<br />- To muster up more well-deserved recognition for the original [url=http://www.nexusmods.com/skyrim/mods/50065/]Natural Lighting and[/url][url=http://www.nexusmods.com/skyrim/mods/50065/] Atmospherics[/url] mod by Confidence Man ... [url=http://www.nexusmods.com/skyrim/mods/50065/]go endorse it now[/url]&#33;\r<br />\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/61206-4-1419989744.jpg[/img]\r<br />\r<br />\r<br />[color=#f6b26b][b]WHAT ABOUT NLA HAS BEEN MODIFIED?[/b][/color]\r<br />\r<br />Below is a overview of the changes made to NLA for the purpose of this mod, along with reasoning for each change.  Please note that no weather-specific files were modified, only some global variables and post-processing settings. \r<br />\r<br />- Global gamma value changed from 1.15 to a neutral 1.0.  This allows for the broadest depth of colors to be displayed, and negates issues with &#39;black crush&#39;, where color definition in dark areas is lost and instead appears black.\r<br />\r<br />- Adjusted dedicated gamma value for nights.  Night time gamma was adjusted to make the preset more playable at night.  Everything is still very dark and light sources remain useful, though you can now make out the terrain and environment sufficiently to navigate and play the game.\r<br />\r<br />- Adjusted dedicated color correction values for interiors. Interior color correction was adjusted to aid with visibility in dark areas and to reduce the heavily saturated interior lighting of NLA\r<br />\r<br />- Adjusted sub-surface scattering parameters.  The variables of this effect were fine tuned to give skin a more natural appearance.  This improves the visible definition of skin textures and removes excessive glow.\r<br />\r<br />- Adjusted reflection parameters.  Enabled reflections for exteriors, adjusted reflection strength and blurriness, enabled reflection super-sampling to reduce noisiness of the effect\r<br />\r<br />- Disabled deprecated film grain effect. Disabled the old, irregular animated film grain effect from the enbeffectprepass.fx file, sothat the newer effect.txt version can be used instead.  This effect.txt film grain is also configurable through the in-game ENB editor panel.\r<br />\r<br />- Created performance presets.  Created a set of performance-related presets to allow for the mod to be enjoyed by users with varying hardware configurations\r<br />\r<br />- Adjusted cloud edge lighting.  Reduced the intensity of the edge lighting effect of clouds for smoother and more natural blending\r<br />\r<br />- Other stuff. Aside from changes to the NLA configuration I also provide comprehensive and clear installation and setup instructions, including recommendations for optimal image quality, performance and stability and some very basic benchmark information.\r<br />\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/61206-2-1419990592.jpg[/img]\r<br />\r<br />\r<br />[b][color=#f6b26b]DOWNLOAD INSTRUCTIONS[/color][/b]\r<br />\r<br />In addition to this mod,  you will also need to download the following files in order to proceed with installation:\r<br />[b]\r<br />[color=#ffff00]1) DOWNLOAD ENB SERIES:[/color][/b]\r<br />ENB 265 is available from the &#39;download&#39; link at the very bottom of the page at the following link:\r<br />\r<br />[url=http://enbdev.com/mod_tesskyrim_v0265.htm]http://enbdev.com/mod_tesskyrim_v0265.htm[/url] \r<br />\r<br />If ENB 265 is no longer available or a more recent update has been released, find it by visiting [url=http://enbdev.com/download_mod_tesskyrim.htm]http://enbdev.com/download_mod_tesskyrim.htm[/url], clicking the most recent version number from the list, and then click the &#39;download&#39; link at the very bottom of the subsequent page.\r<br />\r<br />[b]\r<br />[color=#ffff00]2) DOWNLOAD ENB HELPER PLUGIN:[/color][/b]\r<br />Download the ENB Helper Plugin from the following link:\r<br />[url=http://www.dev-c.com/skyrim/enbhelper]http://www.dev-c.com/skyrim/enbhelper[/url]\r<br />\r<br />This plugin provide ENB with additional information from the game, required to render some effects.  This is required for temporal antialiasing among other things.\r<br />\r<br />\r<br />[color=#ffff00][b]3) DOWNLOAD NLA:[/b][/color]\r<br />Download the original &#39;Natural Lighting and Atmospherics&#39; v1.4 mod from the following link (NOT compatible with v2.0 of NLA):\r<br />[url=http://www.nexusmods.com/skyrim/mods/50065/?]http://www.nexusmods.com/skyrim/mods/50065/?[/url]\r<br />\r<br />\r<br />[color=#ffff00][b]4) DOWNLOAD THE ENB PARTICLE PATCH and SUB-SURFACE SCATTERING PATCH:[/b][/color]\r<br />Download Mindflux&#39;s ENB Particle Patch and Sub-Surface Scattering Patch for Skyrim from the following links:\r<br />[url=http://dl.dropbox.com/u/8940928/Skyrim_Particle_Patch_for_ENB-All-In-One.zip]Mindflux Particle Patch All-in-One[/url]\r<br />[url=https://dl.dropboxusercontent.com/u/8940928/Skyrim_Subsurface_Scattering_Patch_for_ENB.zip]Mindflux Sub-Surface Scattering Patch[/url]\r<br />\r<br />The particle patch fixes errors in the ways some objects in Skyrim respond to ENB lighting and effects, such as the frequently reported &#39;bright water foam at night&#39; issue.  The sub-surface scattering patch enables this effect on candles, ice flows, and the skin of Nords and children.  For full details on both patches, and some additional optional files, see the following link:\r<br />[url=http://enbseries.enbdev.com/forum/viewtopic.php?t=1499]http://enbseries.enbdev.com/forum/viewtopic.php?t=1499[/url] \r<br />\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/61206-1-1419990611.jpg[/img]\r<br />[color=#f6b26b][b]\r<br />\r<br />INSTALLATION INSTRUCTIONS[/b][/color]\r<br />\r<br />[color=#ffff00][b]1) REQUIRED SKYRIMPREFS.INI CHANGES:[/b][/color]\r<br />You must make the following edits to your SkyrimPrefs.ini file in order for ENB to work correctly.  The skyrimprefs.ini file is generally located in:\r<br />C:&#92;Users&#92;YOUR NAME&#92;Documents&#92;My Games&#92;Skyrim&#92;.  \r<br />\r<br />Set all the following values to &#39;1&#39; as shown here:\r<br />\r<br />bFloatPointRenderTarget=1        required for ENB effects to work properly\r<br />bTreesReceiveShadows=1        allows shadows to be cast onto trees\r<br />bDrawLandShadows=1        allows land geometry to cast shadows\r<br />bShadowsOnGrass=1        allows shadows to be cast onto grass\r<br />\r<br />\r<br />[color=#ffff00][b]2) REQUIRED SKYRIM OPTIONS AND GPU CONFIGURATION:[/b][/color]\r<br />- This mod is not compatible with hardware antialiasing (i.e. multisampling and supersampling).  ENB includes its own antialiasing techniques.  \r<br />\r<br />- Ensure multisampling is disabled in the Skyrim launcher, and that all antialiasing for the game is disabled in your GPU control panel.  \r<br />\r<br />- Disabling anisotropic filtering in the Skyrim launcher and GPU control panel is also recommended (but not required), as anisotropic filtering is also handled by ENB.\r<br />\r<br />\r<br />[color=#ffff00][b]3) INSTALL ENB SERIES:[/b][/color]\r<br />Extract the downloaded ENB Series archive. Inside this archive find the &#39;Wrapper Version&#39; and &#39;Injector Version&#39; folders; these correspond to two different methods of adding ENB effects to your game.  \r<br />\r<br />The preferred method is the wrapper version, as this is the most hassle-free to use; however, some users may experience a crash at startup when using the wrapper method, depending on their hardware configuration.  For these users (which include myself), the injector method provides a suitable alternative.  Installation instructions for each method are provided below:\r<br />[color=#9fc5e8]\r<br />[b][i]WRAPPER VERSION INSTALLATION:[/i][/b][/color]\r<br />Copy the entire contents of the &#39;wrapper version&#39; folder into your Skyrim root folder, where the TESV.exe file is located.  If you prefer to maintain a clean file directory, you do not need to copy the following files:\r<br />\r<br />- _sample_enbraindrops (folder)\r<br />- FixForBrightObjects.txt\r<br />- INSTALL.txt\r<br />- license_en.txt\r<br />- license_ru.txt\r<br />- ParallaxMod.txt\r<br />- readme_en.txt\r<br />\r<br />To test that ENBseries is installed correctly, simply boot up Skyrim and look for ENB-related text to appear at the top left of the screen.  If you see this text, ENB is installed correctly; if you do not, the mod is not installed correctly.\r<br />[color=#9fc5e8][i][b]\r<br />INJECTOR VERSION INSTALLATION:[/b][/i][/color]\r<br />Copy the entire contents of the &#39;injector version&#39; folder into your Skyrim root folder, where the TESV.exe file is located.  If you prefer to maintain a clean file directory, you do not need to copy the following files:\r<br />\r<br />- _sample_enbraindrops (folder)\r<br />- FixForBrightObjects.txt\r<br />- INSTALL.txt\r<br />- license_en.txt\r<br />- license_ru.txt\r<br />- ParallaxMod.txt\r<br />- readme_en.txt\r<br />\r<br />Open the installed enbinjector.ini file and ensure that the name of the executable file you launch the game with is included in the list, i.e. tesv.exe, skse_loader.exe\r<br />\r<br />If you first installed the wrapper version, you must remove the d3d9.dll file from your Skyrim directory in order to use the injector version instead.  \r<br />\r<br />To test that ENBseries is installed correctly, first lanch the installed ENBinjector.exe application.  Then simply boot up Skyrim and look for ENB-related text to appear at the top left of the screen.  If you see this text, ENB is installed correctly; if you do not, the mod is not installed correctly.  If you are experiencing issues, be sure to set texv.exe, enbinjector.exe and skse_loader.exe (if applicable) to run &#39;as Administrator&#39; in Windows.\r<br />\r<br />To be clear, ENBinjector.exe must be run before launching Skyrim in order for ENB to work, and may be terminated after you close Skyrim.\r<br />\r<br />\r<br />[color=#ffff00][b]4) INSTALL ENB HELPER PLUGIN:[/b][/color]\r<br />Extract the downloaded ENB Helper archive and copy the enclosed enbhelper.dll file into the &#39;enbseries&#39;folder located in your Skyrim root folder.\r<br />\r<br />\r<br />[color=#ffff00][b]5) INSTALL NATURAL LIGHTING AND ATMOSPHERICS:[/b][/color]\r<br />Extract the downloaded NLA arcive and copy the enclosed contents into your Skyrim root folder, where the tesv.exe file is located.  You will overwrite some of the default ENB files in this process; this is intentional.  Activate the &#39;Natural Lighting and Atmospherics.esp&#39; in your preferred mod manager.  \r<br />\r<br />NOTE: NLA is NOT compatible with other weather mods, such as Climates of Tamriel.  The correct appearance of the mod depends completely on the specific custom weathers added by this plugin.\r<br />\r<br />[color=#ffff00]\r<br />[b]6) INSTALL MINDFLUX&#39;S ENB PARTICLE PATCH & SUB-SURFACE SCATTERING PATCH:[/b][/color]\r<br />For these patches, you can install the downloaded archives directly through Nexus Mod Manager (i.e. &#39;add mod from file).  Otherwise, extract the downloaded archives and copy the enclosed &#39;data&#39; folders to your Skyrim root folder.  These should merge with the existing &#39;data&#39; folder in that location.\r<br />\r<br />[color=#ffff00]\r<br />[b]7) INSTALL ENHANCED SHADERS NLA:[/b][/color]\r<br />Extract the downloaded Enhanced Shaders NLA archive.  The archive contains five folders corresponding to a set of performance presets for the mod, see the next section for details.\r<br />\r<br />Copy the contents from one of the enclosed folders into your Skyrim root folder, where the tesv.exe file is located. You will overwrite some of the default NLA files in this process; this is intentional.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/61206-1-1419990592.jpg[/img]\r<br />\r<br />[color=#f9cb9c][b]\r<br />[color=#f6b26b]WHICH PERFORMANCE PRESET TO USE[/color]\r<br />[/b][/color]\r<br />Assuming a target framerate of 30 FPS at 1920x1080, and also understanding there are MANY other factors that impact performance (i.e. game settings, mod configuration, hardware), I offer the following loose recommendations:\r<br />\r<br />[color=#ffff00][b]Extreme -  GTX 980\r<br />Ultra -  GTX 780 or 980M\r<br />Very High -  GTX 680 or 880M\r<br />High - GTX 670 or 780M\r<br />Medium -  GTX 580\r<br />Perf. -  GTX 480\r<br />[/b][/color]\r<br />Note that I only have a GTX 780m myself, so all the other recommendations are based on educated speculation.  However, I can provide my own configuration details as a point of reference to help you select which performance option to use.  \r<br />\r<br />\r<br />[color=#ffff00][b]MY COMPUTER:[/b][/color]\r<br />- ASUS G750JH Laptop\r<br />- i7-4700HQ CPU 2.4 Ghz\r<br />- nVidia GTX 780m GPU overclocked to 950 / 2750 - Similar to GTX 880M or GTX 680 desktop \r<br />- 24GB RAM\r<br />\r<br />\r<br />[color=#ffff00][b]BENCHMARK:[/b][/color]\r<br />- Skyrim settings at &#39;Ultra&#39;, with Antialiasing and Anisotropic filtering disabled\r<br />- Using the default &#39;High&#39; quality preset of this mod\r<br />- At a 1760 x 990 custom resolution, vsync at 30hz, I maintain a SOLID 30 FRAMES PER SECOND 99.9% of the time, with very infrequent dips to 27 or 28\r<br />- At 1920 x 1080, vsync at 30hz, I can maintain 30 FPS in interiors, but not in exteriors where it frequently dips to 24 or 25\r<br />\r<br />\r<br />[color=#ffff00][b]MODS USED:[/b][/color]\r<br />I use the official high resolution texture patch along with a lot of mods (150+).  Some of the more performance intensive mods include SMIM, Skyrim Flora Overhaul, Verdant, all aMidian Born textures and other texture packs.  Your own mod selection can have a significant impact on your performance.  A list of most of the visual mods I use is included at the end of this document.\r<br />\r<br />\r<br />[color=#ffff00][b]SYSTEM CONFIGURATION:[/b][/color]\r<br />\r<br />- I overclock my GTX 780m GPU by 100 mhz clock speed and 250 mhz memory; this provides performance loosely comparable with a GTX 880M mobile GPU or a GTX 680 desktop GPU.\r<br />\r<br />\r<br />[color=#ffff00][b]TECHNICAL NOTES ABOUT PERFORMANCE PRESETS:[/b][/color]\r<br />\r<br />[b]- EXTREME: [/b]Temporal antialiasing and all effects enabled at maximum quality.  This includes full 1.0 size and texture scales for SSAO and reflections, and with supersampling enabled for both of these effects.  Using this preset reduces my frame rate by 30% when compared with the default preset.\r<br />\r<br />[b]- ULTRA:[/b] Same as above but with reduced size and texture scales, and without supersampling enabled for SSAO.  Minor water effects also disabled.\r<br />\r<br />[b]- VERY HIGH:[/b] Same as above but with further reduced size and texture scales.  Minor water effects also disabled.\r<br />\r<br />[b]- HIGH (Default):[/b] Same as above but with further reduced size and texture scales.  Reflections disabled for exteriors.\r<br />\r<br />[b]- MEDIUM: [/b]Same as above but with further reduced size and texture scales, and without supersampling enabled for reflections.   Edge Antialiasing used instead of Temporal Antialiasing.\r<br />\r<br />[b]- PERFORMANCE:[/b] Same as above but with further reduced size and texture scales, and with reflections disabled completely.\r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/61206-2-1419989743.jpg[/img]\r<br />\r<br />[color=#f6b26b][b]SIMPLE TIPS FOR BETTER PERFORMANCE[/b][/color]\r<br />\r<br />[color=#ffff00][b]ENB SERIES CONFIGURATION:[/b][/color]\r<br />Most ENB effects can be modified in-game through the ENB configuration menu, accessed by hitting Shift-Enter.  While there are a LOT of options available in this panel, overall performance can be easily improved by simply disabling one or more of the most performance-intensive effects in the ‘EFFECT’ section:\r<br />\r<br />[list][*]Ambient Occlusion\r<br />[/*][*]Reflections\r<br />[/*][*]Depth of Field\r<br />[/*][/list]\r<br />\r<br />[color=#ffff00][b]ENB LOCAL CONFIGURATION:[/b][/color]\r<br />Temporal Antialiasing may be disabled in favor of Edge Antialiasing in the top panel of the in-game configuration menu.\r<br />\r<br />The ENBlocal.ini file also contains a number of additional variables that may be fine-tuned to better match your hardware configuration, though the default enblocal.ini files should be suitable for most users without any further tinkering.\r<br />\r<br />\r<br />[color=#ffff00][b]SYSTEM CONFIGURATION:[/b][/color]\r<br />\r<br />[list][*]CUSTOM RESOLUTION AND REFRESH RATE: I create a custom resolution in my GPU control panel for 1760x990 at 30hz.  This allows me to vsync smoothly at 30 frames per second and leaves the GPU a bit of headroom for greater stability.  The custom resolutions and refresh rates available to you will depend on your GPU and on your monitor.  Also, Skyrim will not run in fullscreen mode at some custom resolutions.  In these cases, you can achieve the same effect via ENB’s borderless fullscreen mode:\r<br />[/*][/list][list=1][*]   Set your desktop to the desired resolution and refresh rate\r<br />[/*]\r<br />[*]   Set Skyrim to run in windowed mode in the Skyrim launcher or in SkyrimPrefs.ini\r<br />[/*]\r<br />[*]   Set both of the following to ‘True’ in your ENBlocal.ini file:\r<br />[/*]\r<br />[list=1][*]   ForceBorderless=True\r<br />[/*]\r<br />[*]   ForceBorderlessFullscreen=True\r<br />[/*]\r<br />[/list][/list]\r<br />[list][*]ELIMINATE CRASHES: I use the SKSE Memory Patch to eliminate 99% of all crashes to desktop.  Download SKSE and the SKSE.ini files from the following links.  The ‘Stability Guide’ found at the second link is very useful in itself, and the skse.ini file is available on its download tab: \r<br />   SKSE: [url=http://skse.silverlock.org/]http://skse.silverlock.org/[/url]    SKSE.ini Memory Patch: [url=http://www.nexusmods.com/skyrim/mods/50244/]http://www.nexusmods.com/skyrim/mods/50244/[/url]? [/*][/list]\r<br />\r<br />\r<br />[img]http://static-2.nexusmods.com/15/mods/110/images/61206-1-1419989743.jpg[/img]\r<br />\r<br />[center]And here&#39;s a good demonstration of the real-time reflections effect using highly reflective pottery textures for demo purposes :)\r<br />\r<br />[url=http://i.imgur.com/2pNBdse.jpg][img]http://i.imgur.com/2pNBdsel.jpg[/img][/url][/center]\r<br />\r<br />[b][color=#f6b26b]RECOMMENDED VISUAL MODS[/color][/b]\r<br /> \r<br />Here’s a list of most of the visual mods I use and recommend -- I&#39;m sure I&#39;m missing some great ones too, but oh well.  Some of these mods have overlapping elements (i.e. more than one mod may texture the same item) so you may have to make some decisions … or if in doubt, just overwrite al&#33; :)\r<br />\r<br />\r<br />[list][*]A Quality World Map with Roads\r<br />[url=http://www.nexusmods.com/skyrim/mods/4929/]http://www.nexusmods.com/skyrim/mods/4929/[/url]? [/*][*]Actual Windows\r<br />[url=http://www.nexusmods.com/skyrim/mods/59519/]http://www.nexusmods.com/skyrim/mods/59519/[/url]? [/*][*]aMidianBorn Book of Silence\r<br />[url=http://www.nexusmods.com/skyrim/mods/24909/]http://www.nexusmods.com/skyrim/mods/24909/[/url]? [/*][*]aMidianBorn Caves and Mines\r<br />[url=http://www.nexusmods.com/skyrim/mods/39190/]http://www.nexusmods.com/skyrim/mods/39190/[/url]? [/*][*]aMidianBorn Farmhouse\r<br />[url=http://www.nexusmods.com/skyrim/mods/49040/]http://www.nexusmods.com/skyrim/mods/49040/[/url]? [/*][*]aMidianBorn Imperial Forts\r<br />[url=http://www.nexusmods.com/skyrim/mods/49710/]http://www.nexusmods.com/skyrim/mods/49710/[/url]? [/*][*]aMidianBorn Landscape\r<br />[url=http://www.nexusmods.com/skyrim/mods/37865/]http://www.nexusmods.com/skyrim/mods/37865/[/url]? [/*][*]aMidianBorn Solstheim Landscape\r<br />[url=http://www.nexusmods.com/skyrim/mods/37865/]http://www.nexusmods.com/skyrim/mods/37865/[/url]? [/*][*]aMidianBorn Whiterun\r<br />[url=http://www.nexusmods.com/skyrim/mods/38491/]http://www.nexusmods.com/skyrim/mods/38491/[/url]?[/*][*]Animated Clutter\r<br />[url=http://www.nexusmods.com/skyrim/mods/48287/]http://www.nexusmods.com/skyrim/mods/48287/[/url]? [/*][*]Better Dynamic Snow\r<br />[url=http://www.nexusmods.com/skyrim/mods/10383/]http://www.nexusmods.com/skyrim/mods/10383/[/url]? [/*][*]Better Rocks and Mountains - UV Tweaks Only\r<br />[url=http://www.nexusmods.com/skyrim/mods/2906/]http://www.nexusmods.com/skyrim/mods/2906/[/url]? [/*][*]Book Covers Skyrim\r<br />[url=http://www.nexusmods.com/skyrim/mods/35399/]http://www.nexusmods.com/skyrim/mods/35399/[/url]? [/*][*]Burn Freeze Shock Effects\r<br />[url=http://www.nexusmods.com/skyrim/mods/14692/]http://www.nexusmods.com/skyrim/mods/14692/[/url]? [/*][*]Coverkhajiits\r<br />[url=http://www.nexusmods.com/skyrim/mods/5941/]http://www.nexusmods.com/skyrim/mods/5941/[/url]?[/*][*]Customizable Camera\r<br />[url=http://www.nexusmods.com/skyrim/mods/37347/]http://www.nexusmods.com/skyrim/mods/37347/[/url]?[/*][*]Deadly Spell Impacts\r<br />[url=http://www.nexusmods.com/skyrim/mods/2947/]http://www.nexusmods.com/skyrim/mods/2947/[/url]?[/*][*]Distant Decal Fix\r<br />[url=http://www.nexusmods.com/skyrim/mods/31982/]http://www.nexusmods.com/skyrim/mods/31982/[/url]?[/*][*]Dwemer Metal Retexture\r<br />[url=http://www.nexusmods.com/skyrim/mods/35608/]http://www.nexusmods.com/skyrim/mods/35608/[/url]? [/*][*]Enhanced Distant Terrain 2\r<br />[url=http://www.nexusmods.com/skyrim/mods/39394/]http://www.nexusmods.com/skyrim/mods/39394/[/url]? [/*][*]Enhanced Lights and Effects\r<br />[url=http://www.nexusmods.com/skyrim/mods/27043/]http://www.nexusmods.com/skyrim/mods/27043/[/url]?[/*][*]Enhanced Night Skyrim\r<br />[url=http://www.nexusmods.com/skyrim/mods/85/]http://www.nexusmods.com/skyrim/mods/85/[/url]?[/*][*]Fences of Skyrim[url=http://www.nexusmods.com/skyrim/mods/58980/][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/58980/]http://www.nexusmods.com/skyrim/mods/58980/[/url]?[/*][*]Finer Dust\r<br />[url=http://www.nexusmods.com/skyrim/mods/2636/]http://www.nexusmods.com/skyrim/mods/2636/[/url]?[/*][*]Footprints\r<br />[url=http://www.nexusmods.com/skyrim/mods/22745/]http://www.nexusmods.com/skyrim/mods/22745/[/url]?[/*][*]HD Stone Quarry and Clay Deposits\r<br />[url=http://www.nexusmods.com/skyrim/mods/38479/]http://www.nexusmods.com/skyrim/mods/38479/[/url]?[/*][*]Hybrid’s HD Plants and Herbs[url=http://www.nexusmods.com/skyrim/mods/1546/][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/1546/]http://www.nexusmods.com/skyrim/mods/1546/[/url]?[/*][*]Immersive Armors\r<br />[url=http://www.nexusmods.com/skyrim/mods/19733/]http://www.nexusmods.com/skyrim/mods/19733/[/url]?[/*][*]Immersive HUD\r<br />[url=http://www.nexusmods.com/skyrim/mods/3222/]http://www.nexusmods.com/skyrim/mods/3222/[/url]?[/*][*]Immersive Interiors\r<br />[url=http://www.nexusmods.com/skyrim/mods/39208/]http://www.nexusmods.com/skyrim/mods/39208/[/url]?[/*][*]Immersive Skyrim Thunder\r<br />[url=http://www.nexusmods.com/skyrim/mods/1702/]http://www.nexusmods.com/skyrim/mods/1702/[/url]?[/*][*]Immersive Weapons\r<br />[url=http://www.nexusmods.com/skyrim/mods/27644/]http://www.nexusmods.com/skyrim/mods/27644/[/url]?[/*][*]Improved NPC Clothing\r<br />[url=http://www.nexusmods.com/skyrim/mods/2674/]http://www.nexusmods.com/skyrim/mods/2674/[/url]?[/*][*]Less Intrusive HUD\r<br />[url=http://www.nexusmods.com/skyrim/mods/35154/]http://www.nexusmods.com/skyrim/mods/35154/[/url]?[/*][*]Lightning During Thunder Storms\r<br />[url=http://www.nexusmods.com/skyrim/mods/15506/]http://www.nexusmods.com/skyrim/mods/15506/[/url]?[/*][*]Lower First Person Weapons\r<br />[url=http://www.nexusmods.com/skyrim/mods/26764/]http://www.nexusmods.com/skyrim/mods/26764/[/url]? [/*][*]MoreHUD\r<br />[url=http://www.nexusmods.com/skyrim/mods/51956/]http://www.nexusmods.com/skyrim/mods/51956/[/url]?[/*][*]Moss Rocks\r<br />[url=http://www.nexusmods.com/skyrim/mods/31856/]http://www.nexusmods.com/skyrim/mods/31856/[/url]? [/*][*]No More Glowing Edges\r<br />[url=http://www.nexusmods.com/skyrim/mods/34981/]http://www.nexusmods.com/skyrim/mods/34981/[/url]?[/*][*]No Snow Under the Roof\r<br />[url=http://www.nexusmods.com/skyrim/mods/34981/]http://www.nexusmods.com/skyrim/mods/34981/[/url]?[/*][*]Official High-Resolution Texture Patch[/*]\r<br />[*]No Stretching\r<br />[url=http://www.nexusmods.com/skyrim/mods/26126/]http://www.nexusmods.com/skyrim/mods/26126/[/url]? [/*][*]Peltapalooza\r<br />[url=http://www.nexusmods.com/skyrim/mods/60412/]http://www.nexusmods.com/skyrim/mods/60412/[/url]?[/*][*]Player Headtracking\r<br />[url=http://www.nexusmods.com/skyrim/mods/23600/]http://www.nexusmods.com/skyrim/mods/23600/[/url]?[/*][*]Project Parallax Remastered\r<br />[url=http://www.nexusmods.com/skyrim/mods/40512/]http://www.nexusmods.com/skyrim/mods/40512/[/url]?[/*][*]Pure Waters\r<br />[url=http://www.nexusmods.com/skyrim/mods/1111/]http://www.nexusmods.com/skyrim/mods/1111/[/url]?[/*][*]Quality Snow HD 4K\r<br />[url=http://www.nexusmods.com/skyrim/mods/49011/]http://www.nexusmods.com/skyrim/mods/49011/[/url]?[/*][*]Quality Snowflakes\r<br />[url=http://www.nexusmods.com/skyrim/mods/7405/]http://www.nexusmods.com/skyrim/mods/7405/[/url]?[/*][*]Rainbows\r<br />[url=http://www.nexusmods.com/skyrim/mods/25666/]http://www.nexusmods.com/skyrim/mods/25666/[/url]?[/*][*]Real Ice\r<br />[url=http://www.nexusmods.com/skyrim/mods/5388/]http://www.nexusmods.com/skyrim/mods/5388/[/url]?[/*][*]Realistic HD Ingots\r<br />[url=http://www.nexusmods.com/skyrim/mods/60438/]http://www.nexusmods.com/skyrim/mods/60438/[/url]?[/*][*]Realistic Paper\r<br />[url=http://www.nexusmods.com/skyrim/mods/937/]http://www.nexusmods.com/skyrim/mods/937/[/url]?[/*][*]Re-Defined Dungeons WIP\r<br />[url=http://www.nexusmods.com/skyrim/mods/3147/]http://www.nexusmods.com/skyrim/mods/3147/[/url]?[/*][*]Ren’s HD Shrines\r<br />[url=http://www.nexusmods.com/skyrim/mods/50327/]http://www.nexusmods.com/skyrim/mods/50327/[/url]?[/*][*]Ruins Clutter Improved\r<br />[url=http://www.nexusmods.com/skyrim/mods/14227/]http://www.nexusmods.com/skyrim/mods/14227/[/url]?[/*][*]SLOD Potions and Poisons\r<br />[url=http://www.nexusmods.com/skyrim/mods/4259/]http://www.nexusmods.com/skyrim/mods/4259/[/url]?[/*][*]SLOD Wine Cellar\r<br />[url=http://www.nexusmods.com/skyrim/mods/4260/]http://www.nexusmods.com/skyrim/mods/4260/[/url]?[/*][*]SkyFalls and SkyMills\r<br />[url=http://www.nexusmods.com/skyrim/mods/40564/]http://www.nexusmods.com/skyrim/mods/40564/[/url]? [/*][*]Skyrim Enhanced Camera\r<br />[url=http://www.nexusmods.com/skyrim/mods/57859/]http://www.nexusmods.com/skyrim/mods/57859/[/url]?[/*][*]Skyrim Flora Overhaul\r<br />[url=http://www.nexusmods.com/skyrim/mods/141/]http://www.nexusmods.com/skyrim/mods/141/[/url]?[/*][*]Skyrim Project Optimization[url=http://www.nexusmods.com/skyrim/mods/32505/][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/32505/]http://www.nexusmods.com/skyrim/mods/32505/[/url]?[/*][*]Smaller Ice Spike and Ice Spear\r<br />[url=http://www.nexusmods.com/skyrim/mods/31899/]http://www.nexusmods.com/skyrim/mods/31899/[/url]? [/*][*]Solstheim Climate Overhaul - Paradise Edition\r<br />[url=http://www.nexusmods.com/skyrim/mods/33919/]http://www.nexusmods.com/skyrim/mods/33919/[/url]?[/*][*]Spells Will Give Off Light\r<br />[url=http://www.nexusmods.com/skyrim/mods/8479/]http://www.nexusmods.com/skyrim/mods/8479/[/url]? [/*][*]Splash of Rain\r<br />[url=http://www.nexusmods.com/skyrim/mods/37873/]http://www.nexusmods.com/skyrim/mods/37873/[/url]? [/*][*]Static Mesh Improvement Mod\r<br />[url=http://www.nexusmods.com/skyrim/mods/27043/]http://www.nexusmods.com/skyrim/mods/27043/[/url]? [/*][*]Super Realistic Ore Textures\r<br />[url=http://www.nexusmods.com/skyrim/mods/3794/]http://www.nexusmods.com/skyrim/mods/3794/[/url]?[/*][*]Superior Lore-Friendly Hair\r<br />[url=http://www.nexusmods.com/skyrim/mods/36510/]http://www.nexusmods.com/skyrim/mods/36510/[/url]?[/*][*]Skyrim Distance Overhaul\r<br />[url=http://www.nexusmods.com/skyrim/mods/19446/]http://www.nexusmods.com/skyrim/mods/19446/[/url]?[/*][*]Transparent and Refracting Icicle and Frost Atronach\r<br />[url=http://www.nexusmods.com/skyrim/mods/50316/]http://www.nexusmods.com/skyrim/mods/50316/[/url]? [/*][*]Unique Grasses and Groundcovers\r<br />[url=http://www.nexusmods.com/skyrim/mods/42370/]http://www.nexusmods.com/skyrim/mods/42370/[/url]?[/*][*]Unofficial ELFX SMIM ENB Performance Patch\r<br />[url=http://www.nexusmods.com/skyrim/mods/60603/]http://www.nexusmods.com/skyrim/mods/60603/[/url]? [/*][*]Unofficial High-Resolution Patch\r<br />[url=http://www.nexusmods.com/skyrim/mods/31255/]http://www.nexusmods.com/skyrim/mods/31255/[/url]?[/*][*]Verdant - A Skyrim Grass Plugin\r<br />[url=http://www.nexusmods.com/skyrim/mods/60220/]http://www.nexusmods.com/skyrim/mods/60220/[/url]?[/*][*]Vivid Landscapes Dungeons and Ruins\r<br />[url=http://www.nexusmods.com/skyrim/mods/39874/]http://www.nexusmods.com/skyrim/mods/39874/[/url]?[/*][*]Weapon Retexture Project\r<br />[url=http://www.nexusmods.com/skyrim/mods/1754/]http://www.nexusmods.com/skyrim/mods/1754/[/url]?[/*][*]Wet and Cold\r<br />[url=http://www.nexusmods.com/skyrim/mods/27563/]http://www.nexusmods.com/skyrim/mods/27563/[/url]?[/*][/list]",
  "categoryId": "97",
  "version": "1.1",
  "author": "tapioks",
  "createdUnix": "1419991720",
  "updatedUnix": "1420488422",
  "containsAdultContent": false,
  "uploadedBy": "tapioks",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000140769",
      "name": "Enhanced Shaders NLA",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "405",
      "fileName": "Enhanced Shaders NLA-61206-1-0.zip",
      "uploadedUnix": "1419989124",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/243d548270c56394732c2602a5f77f50ba0609548b898ac7727acb441a203f7f/analysis/1419989162/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enhanced%20Shaders%20NLA-61206-1-0.zip?fid=1000140769&ttl=1535849478&ri=8192&rs=8192&setec=dd381d920b2792852ab7a3ea1cf6e53b"
    },
    {
      "fileId": "1000141529",
      "name": "Enhanced Shaders NLA",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "911",
      "fileName": "Enhanced Shaders NLA-61206-1-1.zip",
      "uploadedUnix": "1420488422",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1d94ea373315f935029e69c4fb39884f1aade8c83aa3e91bfa1459ec4818dbda/analysis/1420488482/",
      "changelogHtml": " - Improved performance of default &#39;High&#39; preset by reducing reflection size and texture scales, and also by disabling reflections for exteriors as with the original NLA mod\r<br />\r<br />-Added new &#39;Very High&#39; preset, same as the former &#39;High&#39; preset\r<br />\r<br />- Adjusted sub-surface scattering on skin to appear less wax-like\r<br />\r<br />- Updated documentation <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enhanced%20Shaders%20NLA-61206-1-1.zip?fid=1000141529&ttl=1535849478&ri=8192&rs=8192&setec=85a5995c46a80c6f80892757475cfa22"
    }
  ]
}