{
  "modId": 61204.0,
  "modName": "Skyrim Black Markets and Dens",
  "summary": "This mod aims to bring more realism into the world of Skyrim. The cities of Skyrim are places of immersion, where both the common and underground may be just moments away from another.",
  "descriptionHtml": "[size=3]DISCLAIMER:[/size]\r<br />[size=2]-Details of the mod will continue down below, with specific details after the &#34;legal&#34; section. Please read.[/size]\r<br />\r<br />[size=3]-  This mod is a resource containing the spaces for quests, factions, or whatever may fill the purpose of dens or lairs in Skyrim. This is only menat to portray an immersive, but still fictional world. These spaces are not at all graphic, and only have base clutter & design to allow those using this resource to add in their own things if they so wish.\r<br />\r<br />[/size]-  Similarities with some other mods may be possible, though not intentional considering the sheer amount of mods existing. This is as original work of my own design & accord as can be.\r<br />\r<br />[size=3]----    ----    ----\r<br />LEGAL:\r<br />\r<br />-Credit:   It is important to thank developers of Bethesda for the Elder Scrolls series and all DLCs for making such opportunity to mod or even play such games.\r<br />\r<br />-  Additionally, anyone whom chooses to use this work in a mod or discuss it within reason (alongside following etiquette & Nexus Mods&#39; official rules) may do so.\r<br />It is key to note that if this mod is used, that due credit is given for using this mod (name & author [minimal]). It is also preferable that I be contacted just so I know (It is greatly appreciated), and may offer reasonable suggestions (especially if requested).  Please feel free to message me, but note that at times I may be busy, but I will work on checking each month or so minimum.\r<br />\r<br />[/size]----    ----    ----[size=3]MOD:\r<br />\r<br />[/size]Going around Skyrim, it seemed a bit strange that considering the Civil War, return of the Dragons, & so many other things going on, that there was a lack of activity in Skyrim, but particularly the underground.  Considering all the citizens of Skyrim deal with, does it not make sense for there to be underground markets somewhere, even in major cities?  While there are many instances of bandits, Khajiit caravans, & the thieves guild, there seems to be little if any presence of smugglers, gamblers, & other [less/non-hostile] underground communities.\r<br />\r<br />People of Skyrim have faced hard times from the ban on Talos worship & regalia, to the trading of ores, artifacts, & goods that the Empire usually shuns or represses. Now in the hectic land of Skyrim, the underground scene has become more diverse & popular as ever.\r<br />\r<br />\r<br />-Note:\r<br />\r<br />This resource aims to fix some of this by providing small spaces for these underground communities around Solitude, Windhelm, Whiterun, Markarth, & Dawnstar.  These areas have all the basics (with the Solitude den even having possible sewer access).  Each of the areas is designed with some degree of lore-friendliness in mind, while also being carefully made to avoid as much conflicting (clipping) as possible.  I am especially aware of how popular city improvement mods can be, so most dens are built far enough away or use very little space (Solitude).\r<br />\r<br />----    ----    ----\r<br />UPDATES/FUTURE:\r<br />\r<br />  For the time being, this mod should be good to go & is fairly simple. I do not plan on updating it anytime soon, but I may work with compatability.\r<br />\r<br />I am consider myself somewhat of an Apprentice at modding, though I have little to no formal teaching other than BethSoft modding tutorials & some occasional videos on the subject.",
  "categoryId": "53",
  "version": "Legendary",
  "author": "ScRBMCMavenEndo",
  "createdUnix": "1419983984",
  "updatedUnix": "1419983984",
  "containsAdultContent": false,
  "uploadedBy": "ScRBMCMavenEndo",
  "primaryFile": null,
  "files": []
}