{
  "modId": 6123.0,
  "modName": "Voice of the Wolf",
  "summary": "Adds appropriate English dialogue to the wolves of Skyrim.  ",
  "descriptionHtml": "\\\"Voice of the Wolf\\\"\r\n\r\nPurpose:\r\n\r\nThis mod adds dialogue to the wolves commonly found throughout Skyrim.   \r\n\r\nIt operates under the assumption that if the Dragonborn chooses to become a Werewolf, s/he should have some insight into the minds of others with wolfblood.  This insight takes the form of being able to interpret some of the growls, threats and snarls of the creatures before and during an attack.  \r\n\r\nI tried to keep the dialogue appropriate and \\\"in character\\\" to wild wolves living in a cold, hard land, struggling to feed themselves and their pups.  I had no basis for this other then my own thoughts, and suggestions from my friend Ssthisto.  \r\n\r\nThis will affect all wolves immediately, so you\\'ll hear the new dialogue even before becoming a Werewolf.  It will also affect foxes since they utilize the same soundset as wolves.  \r\n\r\nInstallation:\r\n\r\nCopy the Data folder into your default Skyrim directory, pretty simple stuff.  If it asked to  \r\noverwrite, click \\\"OK\\\".  \r\nThe new dialogue will play on top of the default snarls and growls, so there\\'s no reason to worry about  \r\nyour wolves not sounding...wolfish.    \r\n\r\n\r\nCredit:\r\n\r\nI created this mod after seeing DarkHighlord69\\'s \\\"Wicked Wolves and Foxes\\\" mod, upon which this was based.  I simply took his mod as a template and recorded my own custom dialouge.  He did all the hard work, so credit should be given to him.    \r\n\r\nI also would like to acknowledge my friend Ssthisto, who brainstormed with me during recording and suggested a lot of the dialogue which I ended up recording.  \r\n\r\nNote:\r\n\r\nBecause of how Skyrim deals with audio, some of the voice clips may be cut off prematurely.  This is especially noticeable in the death sounds. \r\nThis is an issue I do not know how to fix, but the audio was recorded in such a way that the cutoff is only noticeable in two of the clips.  \r\n\r\nI hope to upload a video shortly, but first I need to install Fraps or some other video creating software.  I\\'ll put up some screenshots as well, useless as they may be for an audio mod...  \r\n\r\nI hope everyone enjoys this little mod!\r\n\r\nEdit:\r\n\r\nFor those not able to see the video here on nexus, here\\'s the link to the youtube vid:\r\nhttp://www.youtube.com/watch?v=M12g2vu8h18&context=C3372615ADOEgsToPDskL1aFSZ0ijeZDxQVUNHnlZ5",
  "categoryId": "61",
  "version": "1.0",
  "author": "DOPR",
  "createdUnix": "1326504832",
  "updatedUnix": "1326507745",
  "containsAdultContent": false,
  "uploadedBy": "DOPR5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19569",
      "name": "Voice of the Wolf",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4411",
      "fileName": "Voice of the Wolf-6123-1-0.rar",
      "uploadedUnix": "1326507745",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1d9764a4e5ea8f1aa37715d5e4b3b21863e3757fcd8f1e250c55778d3cfa79b6/analysis/1406609296/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Voice%20of%20the%20Wolf-6123-1-0.rar?fid=19569&ttl=1535763330&ri=8192&rs=8192&setec=c5398bde327f8f03f4edf1c082d509c2"
    }
  ]
}