{
  "modId": 61331.0,
  "modName": "Minacious Mages - Destruction Spell Overhaul",
  "summary": "Embark on your Skyrim experience as a mage like never before; stronger spells, unique spells and a selection of spells now. Check out now&#33; ",
  "descriptionHtml": "[center][img]http://i.imgur.com/4zDhRNs.png[/img]\r<br />\r<br />\r<br />[youtube]a0m-JGTUE7U[/youtube]\r<br />\r<br />[img]http://i.imgur.com/ZhTiDCV.png[/img]\r<br />[size=4]Minacious Mages is a mod that I have produced, that alters the damage and variables of Destructon spells in general. \r<br />\r<br />Why just destruction spells you may ask? Well let me tell you. Despite the Destruction catagory having the most spells overall, the strength and other stats of various spells were underpowered in my eyes, or simply didn&#39;t suit the tastes of the mage character I am currently playing. In one way or another, the spells below the Expert level of magic have some fault with them, so I produced this mod to correct this, strengthen the majority of the spells within the Destruction category and bring to you a selection of other features such as unique spells and potions to add variety and a more in-depth system for those that want to [url=#]play as[/url] a mage-styled character. \r<br />\r<br />[img]http://i.imgur.com/nxcEOFy.png[/img]\r<br />[/size]\r<br />[size=4]I have seen numerous forum threads, posts, and complaints about the playstyle for the mage in general, and seeing as Destruction is the main catagory when it comes to the Arcane arts, i thought why not provide the community with a mod that allows them to [url=#]play[/url] as a mage, but this time be alot stronger, minacious and have alot of fun and a more memorable experience as a whole.\r<br />\r<br />NOTE: Changes have not been made to Master and Expert spells, and only Expert and below spells have been altered. This is due to me not having alot of experience with higher ranking spells; changing them would be a dangerous operation as I may unbalance the spell system, and make the spells more powerful than they should be. \r<br />\r<br />[img]http://i.imgur.com/MtlzC6T.png[/img]\r<br />\r<br />For those that simply won&#39;t [url=#]download[/url] my mod until they know every single little change i&#39;ve made; then here you go&#33; Here is a list off the top of my head, of everything that this mod has to bring:\r<br />\r<br />[/size]- The damage of Flames has been increased to 38, and targets will now be engulfed in flames for a longer period of time. (Increased the amount of damage as I believed that fire should be more damaging than Bethesda were lead to believe.) \r<br />\r<br />- The damage of Frostbite has been increased to 32. The reason why I altered the damage output to 32 rather than 38, is due to me believing that fire should have a higher damage output, and should remain the strongest spell out of the 3 elements. The spell also costs a slightly less amount of [url=#]Magicka[/url] to use due to it being less dominant than the Flame spell.\r<br />\r<br />- The damage of Sparks has also been raised to 32. Likewise with Sparks, the Magicka has also been lowered slightly due to the damage output not being as significant as the output for Flames. \r<br />\r<br />-All 3 of the Elemental Runes (Fire, Frost and Lightning) have been transfomed into much powerful spells, giving a damage of 75 when triggered. The lightning rune is slightly higher with a damage output of 80, which kind of goes against me stating that fire was the dominant element out of the 3, but will be beneficial to those that would prefer to use electricity-based spells. \r<br />\r<br />-All frost spells will now slow enemies down, and the [url=#]speed depends[/url] on the power of the spell. Adept Frost spells will slow enemies down a titch more than Lower ranking spells.\r<br />\r<br />-The burning effect that is given off with Fire spells is also significantly more powerful, and depending on the spell; will either last for a longer or shorter period of time.\r<br />\r<br />-The secondary effect of the primary electric spells have not been altered, and only a few side-effects have been given to this catagory of spells.\r<br />\r<br />-The damage of the spell &#34;Firebolt&#34; has been increased to 50 and the speed of the fired spell has also been boosted. (Not tested)\r<br />\r<br />-The damage of the spell &#34;Ice spike&#34; has been altered to inflict 40 points of damage rather than 25, and will take off more stamina when an enemy is struck by the spell than previously. \r<br />\r<br />-The &#34;Lightning bolt&#34; spell has been raised to a whopping damage of 60, and is noticably more powerful than its rival spells. Due to this larger increase in damage, more Magicka will be consumed when firing the spell.\r<br />\r<br />-Chain Lightning is alot stronger with a damage output of 75 points, and the cost has also been increased by a small amount. \r<br />\r<br />-The damage of the Fireball spell has been doubled in order to blend in with the effect of the spell. (Large explosion was present in the vanilla game, but the damage given to the enemy upon being hit with the spell was poor). However, the radius of the spell has been kept the same. \r<br />\r<br />-Soul trap may not be a destruction spell, but I decided to make changes to it anyway as its a spell that I tend to use on a regular basis. The soul Trap spell will now last 120 seconds rather than 60 seconds, which gives you a larger amount of time to eliminate an enemy, and still fill a soul gem. How great is that&#33; \r<br />\r<br />-All 3 of the Cloak spells have also been granted a higher damage output, and the radius has been slightly increased to blend in with the effect of the spell. This means that enemies will be damaged from a further distance than originally. \r<br />\r<br />-Ice storm has had an increase in damage, and has been increased to 60 and the range of the spell has also been increased. (Not Tested) \r<br />\r<br />[img]http://i.imgur.com/vZgam6X.png[/img]\r<br />\r<br />[size=4]Surely thats all you&#39;ve given us within this mod? No, i&#39;ve got a few more tricks up my sleeve&#33; I have added a selection of new potions to the game, with similar effects to the ones within the game yet the duration, cost and ability is different. Not only that, I created some new spells with unique stats which can also be obtained for no cost, and will add to your spell collection&#33; \r<br />\r<br />Upon entering Dragonsreach, you will see a door on your right hand side. You honestly can&#39;t miss it. Go through the door, and you will be teleported to the room containing the new, and unique items I have also produced for you within this mod. No need to thank me. \r<br />\r<br />[img]http://i.imgur.com/0g9ImzL.jpg[/img]\r<br />\r<br />[img]http://i.imgur.com/LZsXDdX.png[/img]\r<br />\r<br />If this description failed to be the description you were looking for and you still have further quires and would like to ask further questions, then please do so in the comments section and I will try to answer as soon a I am able to. In the future I may release an update for the remaining spells that I didn&#39;t alter, and even for other mods but for now i&#39;m hoping that this is what the community are looking for, and this mod should perfect your experience if you are in-fact a mage&#33; \r<br />\r<br />[img]http://i.imgur.com/8xloL4Z.png[/img]\r<br />\r<br />Thank you to anyone that does choose to download my mod, it means alot to me. This mod was produced with my preferences in mind, but as a progressing mage this should be to everyones tastes. Please leave some feedback if you feel the need to, and enjoy your new playstyle as a much more powerful, Minacious, and fearful necromancer&#33; \r<br />[/size]\r<br />\r<br />\r<br />\r<br />\r<br />[/center]",
  "categoryId": "75",
  "version": "1.0.0",
  "author": "Fi5h1fishy ",
  "createdUnix": "1420334733",
  "updatedUnix": "1420334684",
  "containsAdultContent": false,
  "uploadedBy": "fi5h1fishy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000141297",
      "name": "Minacious Mages - Main File ",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Minacious Mages - Main File -61331-1-0-0.zip",
      "uploadedUnix": "1420334684",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/57e3ad17f7cae9c1e62563e0af73e18df2c893a8ec5f3b5f86cd91a472f68473/analysis/1420334704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Minacious%20Mages%20-%20Main%20File%20-61331-1-0-0.zip?fid=1000141297&ttl=1535849662&ri=8192&rs=8192&setec=64b2b15c8e510fbe94fb53a1f478856a"
    }
  ]
}