{
  "modId": 61369.0,
  "modName": "Pickpocket Chance Tweaks.",
  "summary": "Various min/max pickpocket chance edits. Use only one, or you may not get the desired settings.",
  "descriptionHtml": "Select which ever version suits your needs (only one), if what you want isn&#39;t here message me the values you want and I&#39;ll make it cuz I&#39;m cool like that.\r<br />\r<br />Requirements:\r<br />Skyrim.\r<br />\r<br />If you upload pics of it in action I&#39;ll give you a virtual high five. Or something.\r<br />\r<br />Should be compatible with all mods, unless they also edit the min/max pickpocket chance. Which would be dumb to have 2 of. Just run BOSS and you should be golden. You probably dont even need to run BOSS for this, as long as it&#39;s under skyrim.esm and update.esm it should work.\r<br />\r<br />Made with SkyEdit, because creation kit (I refuse to capitalize that wretched thing) is a POS. You can get SkyEdit here: http://www.uesp.net/wiki/Tes5Mod:SkyEdit\r<br />But please note that it is no longer being updated, and probably has a few bugs, but at least it&#39;s not as bad as ck.\r<br />\r<br />Not much else I can say, go grab Sneak Tools or something. and Skyui. Yeah.\r<br />\r<br />Mods in screenshot (recommended but not required): \r<br />\r<br />The Ningheim Race: http://www.nexusmods.com/skyrim/mods/35474/?\r<br />\r<br />Sneak Tools: http://www.nexusmods.com/skyrim/mods/19447/?\r<br />\r<br />SkyUI: http://www.nexusmods.com/skyrim/mods/3863/?\r<br />\r<br />Extended Carryweight: http://www.nexusmods.com/skyrim/mods/31173/?\r<br />\r<br />\r<br />Yes I realize I misspelled Jol&#39;inar, I shall do my best to atone for the smearing of her memory.  \r<br />\r<br />\r<br />Feel free to do whatever you want with it, kopimi for the win&#33; http://www.kopimi.com/\r<br />\r<br />I&#39;ve just gotten into modding, and I&#39;d love to make more mods&#33; I just have no idea what people want, so if there is a small mod or tweak you want made\r<br />You can message me at: romanthe9000th@gmail.com or on the Nexus Forums.",
  "categoryId": "76",
  "version": "1.1",
  "author": "Roman9000",
  "createdUnix": "1420421657",
  "updatedUnix": "1420421657",
  "containsAdultContent": false,
  "uploadedBy": "Roman9000",
  "primaryFile": null,
  "files": []
}