{
  "modId": 61379.0,
  "modName": "Viking - Odin Bloodtooth",
  "summary": "The ruthless Viking Odin Bloodtooth is an essential follower who is a work in progress. Soon, you will join him on his quest but for now he will lend you his strength. Odin is highly skilled in one handed weapons (war-axe favored) and a shield. He will level alongside you and is decent in stealth.",
  "descriptionHtml": "[center][size=5][b]Description[/b][/size][/center]\r<br />______________________________________________________________________________________________________________________________________________\r<br />\r<br />[size=3]   Odin Bloodtooth is a Viking, hailing from a faraway land. You can find him in the Thalmor Embassy locked inside the middle cell. You can&#39;t pick the door so you&#39;ll have to be sneaky and pickpocket the &#34;Interrogation Room Key&#34; from Rulindil, or be blunt about it and kill him for it. You can say hello to him and have a short, silent conversation but I won&#39;t be adding any more dialogue until I begin getting him voiced (hopefully that will be soon). When that happens he will gladly tell you everything you want to know about where he comes from and introduce to you his quest.\r<br />\r<br />[center]\r<br />\r<br />[img]http://i.imgur.com/4zTsxka.jpg[/img]\r<br />&#34;Legends don&#39;t burn down villages. Odin Bloodtooth burns down villages.&#34; - Jarl Ulfric Stormcloak\r<br />[size=1][i]He definitely said this.[/i][/size][/center]\r<br />[/size]\r<br />\r<br />[center][b][size=5]Backstory[/size][/b][/center]\r<br />______________________________________________________________________________________________________________________________________________\r<br />\r<br />   [size=3]Odin was abandoned as a child and was picked up by a Viking King that went by the name Olaf the Great. Growing up training to be a warrior was a rough life but having a companion and childhood friend made it easier. Gudfred, the only son of Olaf, accompanied Odin all throughout childhood and trained with him. When they reached sixteen, both boys went on their first raid together. As the army of Vikings stormed the village, Odin was suddenly pulled into a house. There, a guard who lived in the village made an attempt to kill the boy, but Odin managed to turn the tables by using a strange tactic. Before the guard could thrust his sword into his chest, Odin latched onto the guard and bit the man&#39;s ear off. The guard&#39;s sword fell to the ground as the man clutched onto his head where his ear once was, giving Odin enough time to pullout his axe and strike at the man&#39;s neck. As the guard&#39;s head fell to the floor, a couple fellow Vikings barged into the house to give aid to their comrade. However, when they got there they saw a dead guard and an alive Odin with blood all around his mouth. Thus, he got the name Bloodtooth.\r<br />   When Gudfred and Odin became young men, Olaf the Great became ill. As the king laid in his bed, cursing at how he needed to die in battle and not of an illness, an idea sparked in Gudfred&#39;s mind. When his father dies he will become king. The thought made him happy but his emotions turned sour when he overheard Olaf telling Odin that he would be king, and not his son. Gudfred, furious of being stripped of his future title, devised a plan. During the night, he poisoned Olaf and arranged it to look like it was Odin. The next morning, Odin was arrested and ultimately exiled to Tamriel along with imprisoned for the assassination of the Olaf the great. Gudfred would become the new Viking King as Odin was sent to the Thalmors. [/size]\r<br />\r<br />\r<br />[center][size=5][b]Thank you&#33;[/b][/size][/center]\r<br />______________________________________________________________________________________________________________________________________________\r<br />\r<br />   [size=3]Thank you to Hothtrooper for his amazing mods [url=http://www.nexusmods.com/skyrim/mods/19733/?]Immersive Armors[/url] and [url=http://www.nexusmods.com/skyrim/mods/27644/?]Immersive Weapons[/url] and also to Nivea for the wonderful [url=http://www.nexusmods.com/skyrim/mods/13486/?]Winter is Coming - Cloaks[/url]. These mods are not in the actual file, only in the screenshots.\r<br />   \r<br />   Also a shout out to Smartbluecat for inspiring me with his unique, fully-voiced follower [url=http://www.nexusmods.com/skyrim/mods/40960/?]Inigo[/url]&#33;\r<br />\r<br />   Finally, thank you to every indiviaul who downloads and endorses this mod&#33; I will be sure to get his voice and quest done when I can&#33;[/size]",
  "categoryId": "66",
  "version": "1",
  "author": "Crawfordnator",
  "createdUnix": "1420436958",
  "updatedUnix": "1420436558",
  "containsAdultContent": false,
  "uploadedBy": "Crawfordnator",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000141436",
      "name": "Odin Bloodtooth",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "379",
      "fileName": "Odin Bloodtooth-61379-1.rar",
      "uploadedUnix": "1420436558",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5fa1bc69afb8105c4a8a6919f7d96cf7b88a851aaffe23d15b45e3ccc8023fa8/analysis/1420436582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Odin%20Bloodtooth-61379-1.rar?fid=1000141436&ttl=1535849726&ri=8192&rs=8192&setec=93e4c255a1a4ebb8e664f2feaa882eeb"
    }
  ]
}