{
  "modId": 61439.0,
  "modName": "Persona V - The Elder Scrolls",
  "summary": "A Persona/Skyrim crossover mod. Enter the Velvet Room, my dear guest, and gain the power of Persona. Call forth Heroes and more, as you traverse the lands of Skyrim.",
  "descriptionHtml": "[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/title_image.png[/img][/center][center][i]Welcome to the Velvet Room, my dear guests.[/i]\r<br />\r<br />[i]My name is Igor.[/i]\r<br />\r<br />[i]Such an interesting destiny, you all have. Guided by fate, you are all the children of Akatosh, descendants of Talos in spirit if not blood.[/i]\r<br />\r<br />[i]Well, it is the duty of the members of Velvet Room to aid its&#39; guests. Let us see what the cards and the scrolls have in store for you, [/i][b]Dovahkiin[/b][i].[/i][/center]\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/line_break.jpg[/img][/center]\r<br />[u]Persona V: The Elder Scrolls[/u] is a Skyrim / Persona Crossover mod. What does that mean? It means that it attempts to create a storyline / interact with the Storylines of Skyrim in a way that is easily relatable to the [i][b]Persona [/b][/i]series of games, by [u]Atlus[/u]. More specifically, Persona 3 and/or 4, though I will admit to having a lot more knowledge of Persona 3 over Persona 4.\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/information.jpg[/img][/center]\r<br />The premise of the Persona series is the ability for characters to bring out aspects of their soul (&#34;Personas&#34; - facets of the mind), to combat strange entities which are the manifestations of the darkness of humanity (&#34;Shadows&#34;, it&#39;s very Jungian). As Skyrim already has a wonderful array of enemies to combat, I instead decided to focus my efforts on starting with the main quest. One thing to note is that the Protagonist, unlike the other characters of the series, has the ability to summon multiple Personas, each of which corresponds to a certain Arcana (from Tarot). This is done through what is known as a &#34;Social Link&#34;, a bond of friendship (and/or more, depending on your actions) which is made between the protagonist and a character or group (belonging to a certain Arcana). By developing this bond, the protagonist gets more powerful Personas, corresponding to that Arcana. \r<br />\r<br />This mod (for now) focuses on the Fool Arcana, which is meant to represent a journey, and used by the Persona series to denote the main storyline. As such, I tied it into the Main Quest of Skyrim. As you progress along the main quest, in-game, you will find strange doors (Dwemer doors, until I texture / find someone who is willing to texture them) in certain locations. These Velvet Doors lead to the Velvet Room, a strange blue room existing outside of time and space, said to exist inside of the human mind. The inhabitants of the Velvet Room (just Igor, for now), will assist you in obtaining and upgrading your Personas, alongside other things in later versions of this mod. If the player checks in often with the Velvet Room, he or she might find themselves obtaining new Personas. I recommend checking after every event of note, just to be safe, since I won&#39;t tell you when the trigger occurs, haha.\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/storyline.jpg[/img][/center]\r<br />For now, there is no separate Persona-esque Storyline. I may or may not add one later, under the [i]World Arcana[/i], since the [i]Fool Arcana[/i] is already taken.\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/the_arcana.jpg[/img][/center]\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/fool_arcana.jpg[/img][/center]\r<br />[size=3][b]More to come soon&#33;\r<br />Planned: [/b]Companions, Civil War, Thieves Guild, Dark Brotherhood, Dawnguard, Dragonborn[/size]\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/installation.jpg[/img][/center]\r<br />Installation using the Nexus Mod Manager should work. If there are any problems, please tell me. If you&#39;re installing manually, I hope you know what you&#39;re doing. That, or check one of the numerous help guides that will explain it far better than I could ever.\r<br />\r<br />As far as compatibility goes, this mod [i]should[/i] be compatible with most other mods. I don&#39;t modify much, just a few locations which I don&#39;t see many mods touch. If the location of some of the Velvet Doors conflicts with one of the other mods, tell me. Apart from that, most everything in my mod is original, and so shouldn&#39;t conflict. This mod HAS been cleaned with TES5Edit, and should have no &#34;dirty edits&#34; or whatnot. As for load order, it can go anywhere, but I recommend at the bottom, to minimize conflicts even further.\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/about.jpg[/img][/center]\r<br />Greetings. My name is KingAsh (call me Ash). Some of you might know me as &#34;ashtheking&#34;, but that was taken on the Nexus already.\r<br />I&#39;ve been modding in games for several years now, and decided to try Skyrim modding. Well, publicly, I had some small gimmicky personal mods.\r<br />I had gotten into the [b]Persona[/b] series recently, and so decided to try and make it here, in Skyrim. I figured it&#39;d fit together well, and I hope you all agree.\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/disclaimer.jpg[/img][/center]\r<br />[u]The Elder Scrolls V: Skyrim[/u], and all related concepts and content, belong to [b]Bethesda Softworks[/b], which I am not part of whatsoever. [u]Shin Megami Tensei: Persona[/u], and all associated content and concepts, belong to [b]Atlus[/b], of which I am not a part of either. I own nothing in this mod but my own work and ideas. Please respect these rights and trademarks. I am not responsible for anything you do with this mod, except basic gameplay.\r<br />\r<br />[center][img]https://dl.dropboxusercontent.com/u/19394796/persona_mod/bugs.jpg[/img][/center]\r<br />I am a novice mod author (at least, when it comes to Skyrim). So if you find a bug (or something you think just doesn&#39;t belong), please tell me. Same goes for a mod that isn&#39;t compatible. I am not doing beta-testing at this time, but if that changes, I&#39;ll let you guys know here.\r<br />\r<br />If you would like to help me out, I welcome the assistance. I would be grateful for voice actors, texturers, and pretty much anything else. I can probably use whatever Skyrim-modding related talents you have, probably. ",
  "categoryId": "35",
  "version": "1.1.0",
  "author": "KingAsh - ashtheking",
  "createdUnix": "1420596853",
  "updatedUnix": "1420776524",
  "containsAdultContent": false,
  "uploadedBy": "KingAsh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000141734",
      "name": "Persona - The Fool Arcana v1.0.0",
      "version": "1.0.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "56960",
      "fileName": "Persona - The Fool Arcana-61439-1-0-0.7z",
      "uploadedUnix": "1420596679",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/eca15578b5ca248f8d6923bd66c71202148b7870badc80c1b3bfe67cc2ea631f/analysis/1420596732/",
      "changelogHtml": " Initial release of the mod. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Persona%20-%20The%20Fool%20Arcana-61439-1-0-0.7z?fid=1000141734&ttl=1535849825&ri=8192&rs=8192&setec=f08f0a48adbfa56ae31e636ae0c57b4e"
    },
    {
      "fileId": "1000142000",
      "name": "Persona - The Fool Arcana v1.1.0",
      "version": "1.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56898",
      "fileName": "Persona - The Fool Arcana v1.1.0-61439-1-1-0.7z",
      "uploadedUnix": "1420776524",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8fd1c288c40f604220e9c5b4fb9d710955a325e87260ff9dc262a047e14aff9e/analysis/1420776552/",
      "changelogHtml": " Added Hama/Hamaon, Mudo/Mudoon, and Megido/Megidola/Megidolaon Spells. <br/> \n Added said spells to vendor lists dynamically, and added them to Personas. <br/> \n Fixed penultimate Personas&#39; combat style, fixed minor AI bugs with his combat. <br/> \n Changed 5th Personas&#39; armor and shield to correspond better to lore. <br/> \n Changed Igor&#39;s appearance to try and fit his actual look better. Unsure if I&#39;m keeping it. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Persona%20-%20The%20Fool%20Arcana%20v1.1.0-61439-1-1-0.7z?fid=1000142000&ttl=1535849825&ri=8192&rs=8192&setec=4ae3f0cd144fb1bf0ee644199402cca3"
    }
  ]
}