{
  "modId": 61463.0,
  "modName": "Dovahkiin Domicile",
  "summary": "Secret, secure, underground stronghold.",
  "descriptionHtml": "[size=4][i][color=#ff0000]LOCATION IS UNDER IMAGE TAB[/color][/i]\r<br />[color=#ff7700]If you mod like I do, Skyrim is a very dangerous place. So if you&#39;re looking for a great streamlined home that wont attract any unwanted attention, and are looking for a retreat to dump and organize your loot before you head back out, Dovahkiin Domicile is for you.[/color][/size]\r<br />\r<br />Within the Windhelm area&#39;s snowy cliff sides resides a lonesome dilapidated shack overlooking Bronzewater Cave. At first glance the shack appears striped bare, and of little use, even for a nights sleep out of the elements. Upon closer inspection you will find a secret cabinet and hatch leading underground to what then might be perceived as some sort of ancient remnants of a sewer or dungeon. However, an examination of the walls will give way to your new home including the following:\r<br />\r<br />[list][*]A library for all your book storage and display needs.[/*]\r<br />[*]A display hall with weapon racks, cases and Manikins. Collect full sets, there&#39;s room for it all&#33;[/*]\r<br />[*]A secret cabinet in the main room leading to your bedroom and kitchen.[/*]\r<br />[*]Another secret cabinet in the library leading to your crafting hall and vast treasure vault for all your gear managing and storage needs.[/*]\r<br />[/list]\r<br />[color=#ff0000]**NOTE** [/color][color=#ffff00]Make sure not to miss your bedroom and crafting hall/bank vault. If someone gets in your house they&#39;ll never find where you A: Sleep and B: Where you stash all your goods ;) )Yes I&#39;m kind of an immersion nut with an odd fetish for secret passages :P[/color]\r<br />\r<br />[color=#ff0000]**NOTE 2** [/color][color=#ffff00]I don&#39;t play with followers, so my apologies if the Domicile isn&#39;t EXACTLY made with followers in mind (like Jacuzzis for all your sex slaves), but they can certainly wander around the place with little issue.\r<br />\r<br />[/color][color=#ff0000]**NOTE 3** [/color][color=#ffff00]I&#39;ll offer as much support for the mod as I can, but everything has been tested and is pretty much set. I made a House that I wanted to use and decided to share it. Nexus mod only. No Steam cult please :)[/color]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Jonnycaz",
  "createdUnix": "1420665656",
  "updatedUnix": "1420665523",
  "containsAdultContent": false,
  "uploadedBy": "Jonnycaz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000141843",
      "name": "Dovahkiin Domicile",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "126",
      "fileName": "Dovahkiin Domicile-61463-1-0.zip",
      "uploadedUnix": "1420665523",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/edbbdd3eb7a13099b22f39fc2dc142ab55a11bc190ff353b2ee35d1d9bfdec22/analysis/1420665543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahkiin%20Domicile-61463-1-0.zip?fid=1000141843&ttl=1535849855&ri=8192&rs=8192&setec=2d538aee35d923948141974d8210f3a3"
    }
  ]
}