{
  "modId": 61492.0,
  "modName": "AZMagicBalance-I",
  "summary": "Magic Rebalance",
  "descriptionHtml": "AZMagicBalance (I) \r<br />Is a mod to make magic in skyrim more powerfull and viable, i got the inspiration to do this mod from great mods as Better Magic and Balanced Magic (i suggest to check these out). \r<br />The changes in game play are numerous but most of them are done via perks and effect, this mean that i dont touch any spell and this mode should so be compatible with most spell libraries mods. \r<br />note that this mod is localized in italian (I) so many of perks name will change in italian, other thank the perks i modified, everything else should stay in your localized language \r<br />WHAT THIS MOD WILL DO? \r<br />This mod will make magic in Skyrim scale better during the game, all schools of magic will be more powerful and viable in the lategame, Destruction spells will do more damage depending by how much you invest in the school, Conjuration will permit to have more summons active and once and so on. \r<br />Note that to have even a better balance i strongly suggest to instal a mod that doesnt permit to reach 100% magic cost reduction or to &#34;nerf yourself&#34; by not going overboard with enchantements. \r<br />\r<br />INSTALLATION: download the mod and put the AZMagicBalance.esp in your Skyrim/Data folder\r<br />DISINSTALLATION: Remove AZMagicBalance.esp\r<br />\r<br />CHANGES \r<br />DUAL CASTING improvement: dualcasting spells now deal x3.1 more dmg but also costs 4.5 more mana. the idea is to have a choice between dualcasting for massive effects but spending lot of mana vs a more efficent casting approach, so is not anymore just dualcast everything, but you have to chose accorinly. also note that lower level spells are still going to not cost much at higher levels, making them more viable with dualcast. \r<br />FATALITY PERKS revamp. depending by the type of spell the fatality have a chance to trigger when the opponent have higher life.an ice skpike for example have 20% to freeze an opponent under 60% hps while a fireball have a 35% to scare all enemies hits under 40% life. generally speaking frost spells have a lower chance to fire but &#34;activate&#34; at higher life, shock spells have the highest chance but with lowest hps and fire spells are inbetween (but again it varies with the kind of spells used) \r<br />DESTRUCTION \r<br />AUGMENT ELEMENT now scale dmg depending by the mastery in the school, an Apprentice in the school of destruction will deal way less damage than a master. generally higher you go up in spell mastery and more your augmented elemental spells will deal damage. again the spells scale a bit differently, so the lower level spells will get a buff in the process making then more viable as a filler at higher levels or vs weaker enemies. the damage goes from a 20% (but again depends by spells) with Augment Element 1 and novice to 250% at Augment Element 2 and master. Note that ofc only the elements you are &#34;specializing&#34; in will get the boost, if i have no augment shock perk my shock spells will not get any boost. \r<br />note that atm the bost is on all elemental dmg, so shouts, restoration dmg spells and enchantments too. im still unsure if to keep it this way or to restrict it only to spells of destruction school \r<br />\r<br />CONJURATION \r<br />Mastery: All mastery perks past novice will give a cumulative 20% duration boost \r<br />Summoner perk will grant up to 2 additional summoned creature, 1 more creature with Summoner 1 and Adept perk, and another creature at Summoner 2 with Expert perk. \r<br />Twin Souls grant an additional creature (other than the one it alredy provides) with Master perk \r<br />This way with Summoner 2, Master Conjuration and Twin souls you can have up to 5 evocations active&#33; \r<br />\r<br />RESTORATION \r<br />Necromage bug is fixed and doesnt grant anymore the boost on player stats when is a vampire (note that it doesnt touch the player vampire status so is compatible with vampire mods) \r<br />Regeneration now scales depending by perk masteries of the schools. it starts at 20% more healing at novice and goes up to 195% at Master \r<br />\r<br />ILLUSION \r<br />all mastery perks past novice give a cumulative 20% boost to spell duration \r<br />Animage, Kindred Mage, Hypnotic Gaze, Aspect of Terror and Rage permit to influence higher creatures with higher masteries (note that they start at about 50% of their current value and go up to 150-200% at master) \r<br />Aspect of Terror is also fixed and doesnt grant additional damage to fire spells. (they alredy do plenty of damage now&#33;) \r<br />\r<br />ALTERATION \r<br />all mastery perks past novice give a cumulative 20% boost to spell duration \r<br />Mage Armor is revamped&#33; now it kinda works as in Better Magic, boosting also the armor spell duration (if you wear no armor) and also grant a flat armor value if you wear no armors. it goes from 50 at mage armor 1 with Apprentice up to 250 armor at mage armor 3 with Master. with ebon skin is a (long duration) 550 armor rating so around 66% dmg reduction, whitout any spell active is about a 30% damage reduction (good if you get &#34;ambushed&#34;) \r<br />\r<br />COMPATIBILITY \r<br />the mod is compatible with every mod that doesnt touch magic school perks, it should also compatible with various mod that add new spells. the new spells should all benefit from the changes i made&#33; \r<br />FUTURE CHANGES: \r<br />Im thinking about to change the augment element perks in destruction to work only for the spells of its schools rather than for all elemental damage (feedback welcome :P) \r<br />in this version also i dont touch any spells, in future i may do a version with also spells, i will like to revamp alteration spells to provide magic resist (kinda like balanced magic) and to open dual casting to the master spells and give a boost to bound weapons and runes too... but still im not sure, \r<br />i may do an english version if people are interested into it, let me know&#33; \r<br />\r<br />so thats it, leave some feedback if you want, and let me know if you find some bugs (:P) i hope you will have fun with the mod. \r<br />good spell slinging&#33;",
  "categoryId": "93",
  "version": "0.9",
  "author": "Valamir",
  "createdUnix": "1420728534",
  "updatedUnix": "1420728525",
  "containsAdultContent": false,
  "uploadedBy": "Zilod",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000141911",
      "name": "AZMagicBalance",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "AZMagicBalance-61492-0-9.zip",
      "uploadedUnix": "1420728525",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/5be4a077fb7d729c52a4791036edf216d68dccf9bdef6d6c259a84bbdf48c04c/analysis/1420728542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AZMagicBalance-61492-0-9.zip?fid=1000141911&ttl=1535849887&ri=8192&rs=8192&setec=495ff90510475b6d4c673c6c6826f08b"
    }
  ]
}