{
  "modId": 61490.0,
  "modName": "Eli&#39;s Poison Arrow Crafting",
  "summary": "I wanted to take advantage of alchemy and archery in combat.. Until I found out how incredibly inconvenient and boring it is. I have no time nor the patience to poison my bow after every shot fired&#33; Want to carry a vine of poison arrows with you? NOW YOU CAN&#33;",
  "descriptionHtml": "[center]\r<br />[color=#cc4125][b][size=6]Mod works as intended, so don&#39;t expect any updates.[/size]\r<br />[b][size=4]I don&#39;t develop old mods any more.\r<br />[/size][/b]\r<br />[url=https://www.facebook.com/elianorapwnsu][img]http://i.imgur.com/267fYFk.png[/img][/url]\r<br />[url=https://www.youtube.com/c/Elianora][img]http://i.imgur.com/bGTVC9s.png[/img]\r<br />[/url][/b][/color]____________________________________________\r<br />\r<br />[b]Creator: Elianora\r<br />Contributors: [url=http://www.nexusmods.com/skyrim/users/3507075/?tb=mods&pUp=1]Nahkin [/url]for the original idea\r<br />[url=http://www.nexusmods.com/skyrim/users/4974983/?tb=mods&pUp=1]Leianne[/url]: Help with planting fungus, fungus mesh, other helpful stuff\r<br />\r<br />Are you like me? You&#39;d love to use your alchemy skill for crafting masterful poisons and dealing massive damage to your enemies in combat. Or just taking your archery to next level by dipping your arrows into various toxins? Me too, until I found out how incredibly inconvenient and boring it is. I have no time nor the patience to poison my bow after every shot fired&#33; There must be another way?&#33; Want to carry a vine of poison arrows with you? NOW YOU CAN&#33;\r<br />[/b]\r<br />[i][b][size=3][color=#ffd966]I took the mod down because I wanted to improve it, but turns out I&#39;m not as motivated to work on it as I thought. People keep asking for it, so here it is again.[/color]\r<br />[/size][/b][/i][color=#6aa84f]\r<br />[b][size=3]Mod gives the player the ability to craft poisoned/effect arrows in batches, \r<br />instead of poisoning every single arrow mid-battle.[/size][/b][/color][b][size=3]\r<br />[/size][/b]\r<br />[b][color=#6aa84f][size=4]:: REQUIREMENTS ::\r<br />[/size][/color][/b]\r<br />- Skyrim up to date\r<br />- Dawnguard.esm\r<br />- Hearthfires.esm\r<br />- Dragonborn.esm\r<br />\r<br />[b][color=#6aa84f][size=4]:: HOW TO CRAFT THEM ::\r<br />[/size][/color][/b]\r<br />The basis of the arrows with special effects are Hunter&#39;s Arrows (Bosmer arrow)\r<br /> \r<br />So, to make Hunter&#39;s Arrows, you need to learn an ability &#34;Secrets of Arrow Craft&#34;. \r<br />You can purchase the book that gives you the ability from Elrindir in Drunken Huntsman (Whiterun) for &#34;a steep price of millions&#34;. \r<br />He will also sell Hunter&#39;s Arrows, if you&#39;re not the craftsman type o&#39; character.\r<br /> \r<br />After you&#39;ve read the book you are able to craft Hunter&#39;s Arrows at the forge under &#34;Elven&#34;, and then\r<br />[color=#6aa84f]use the arrow poisoning font in Elrindir&#39;s shop OR outside the Fletcher in Solitude[/color].\r<br />I left a book with all the recipes on the table next to the crafting font, so you can check what ingredients each arrow needs.\r<br />\r<br />[i][color=#ffd966]BONUS: Since you need the poison fungus to make REALLY powerful arrows, the fungus is made plantable.\r<br />If you own a house with HF planting soil, you can take the fungus there and grow more of it. \r<br />If you don&#39;t have a garden, I am pretty sure the small supply of them in Elrindir&#39;s shop will respawn eventually.\r<br />[/color][/i]\r<br />And yes, I know the image for the paralysis arrows says 2 hours. It&#39;s actually 15 seconds. I just forgot to change the text. The uploaded version is fixed.\r<br />\r<br />[b]Before you ask why I used the DLC: [/b]\r<br />Dawnguard: Effects and ingredients for poisons and explosions\r<br />HF: Planting the fungus since I didn&#39;t want to mess with distribution lists\r<br />Dragonborn: Ingredients, effects (poison spider) and the fungus mesh\r<br />\r<br />[size=3]Warning, while the mod has been tested by multiple people, there is still a chance something goes wrong.[/size]\r<br />[size=3]Backup your saves and stuff before trying this.\r<br />[/size]\r<br />[b][size=4][b][color=#e06666][size=5]NOT COMPATIBLE WITH ELISDRIEL, SICARIUS&#39; REFUGE, THE ROOKERY OR ELI&#39;S SHACK &#33;&#33; [/size]\r<br />[size=2]I make mods for myself. I don&#39;t install 15 house mods into one playthrough. I use one house mod at the time and I move the arrow crafting to the mod I use. The arrow crafting will conflict with any of my other mods that use that feature.[/size][/color][/b]\r<br />[/size][/b]\r<br />ENJOY&#33; And do let me know if they&#39;re OP. lol[/center]",
  "categoryId": "55",
  "version": "1.0",
  "author": "Elianora",
  "createdUnix": "1420723501",
  "updatedUnix": "1420723442",
  "containsAdultContent": false,
  "uploadedBy": "Elianora",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000141905",
      "name": "Eli&#39;s Poison Arrow Crafting",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2260",
      "fileName": "Eli's Poison Arrow Crafting-61490-1-0.rar",
      "uploadedUnix": "1420723442",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/018902c3f2da3b9373113b825bc756046ae215507e44c53cc9f070f4c5eb4a19/analysis/1420723504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eli%27s%20Poison%20Arrow%20Crafting-61490-1-0.rar?fid=1000141905&ttl=1535849883&ri=8192&rs=8192&setec=8b96a9c129fd19e758b81d184d190504"
    }
  ]
}