{
  "modId": 61533.0,
  "modName": "Simply Spells",
  "summary": "A small collection of balanced spells of all schools of magic available for purchase at the college.",
  "descriptionHtml": "[b][center][b][img]http://i61.tinypic.com/6ieddl.png[/img][/b][/center]Summary\r<br />[/b]A mod which adds several new, and hopefully balanced, spells to the game from all schools of magic. Most of the spells follow the basic vanilla way of growing stronger with having weaker and stronger versions of the effect which differ slightly in purpose and effect as your skill in the appropriate school increases. All spell should be available for purchase at the various college vendors (destruction spells from Faralda, etc.).\r<br />I have other ideas for spells that have not yet been completed and may or may not end up included in this mod in a future version.\r<br />\r<br />I initially created this mod purely for my own use, however I figured I might as well post it here in case anyone was interested. As such however there may be remnants of the mod before I made it ready for public use (such as temporary names for effects), feel free to bring these to my attention.\r<br />\r<br />Careful, this mod uses scripts for most of its spells and I am relatively new to modding and scripting. This is also my first time uploading anything here on Nexus, so if there are problems with downloading and installing the mod feel free to let me know.\r<br />\r<br />[b]Alteration Spells\r<br />[/b]-Short-Range Teleport (Novice): You dual-cast this spell to mark a spot which you can teleport back to by casting the spell regularly. It will only teleport you within a relatively close area and never to another cell.\r<br />-Limited Wish (Adept): This spell has a semi-random effect. The effect of the spell can be either positive or negative, however the effect is as strong as the average expert level spell (thus a higher risk/reward). The higher your alteration level, the more positive effects and fewer negative effects and the more likely positive effects will occur instead of negative effects. It also has a chance of doing nothing.\r<br />-Teleport (Adept): You dual-cast this spell to mark a spot which you can teleport back to by casting the spell in the regular way. Unlike short-range teleport this spell has no limit in distance, but it cannot be used in combat.\r<br />-Wish (Expert): This spell has a semi-random effect. The effect of the spell can be either positive or negative, however the effect is as strong as the average master level spell (thus a higher risk/reward). The higher your alteration level, the more positive effects and fewer negative effects and the more likely positive effects will occur instead of negative effects. It also has a smaller chance of doing nothing.\r<br />-Powerful Wish (Master): This spell has a semi-random effect. The effect of the spell can be either positive or negative, however the effect is stronger than any other master-level spell (thus a higher risk/reward). The higher your alteration level, the more positive effects and fewer negative effects and the more likely positive effects will occur instead of negative effects. It also has a small chance of doing nothing.\r<br />-Combat Teleport (Master): You dual-cast this spell to mark a spot which you can teleport back to by casting the spell in the regular way. Unlike short-range teleport this spell has no limit in distance and unlike Teleport it can be used in combat.\r<br />\r<br />[b]Illusion Spells\r<br />[/b]-Directed Amnesia (Novice): You forget the spell in your other hand permanently. Mainly directed at removing clutter or obsolete spells.\r<br />-Nostrum (Novice): You temporarily gain 25 points of health, but after 30 seconds you lose the same amount again. Much cheaper in magicka cost than a restoration spell of the same power.\r<br />-Locator Spell (Adept): You dual-cast this spell on a person in order to make them trackable. Once you then cast it regularly it will lead you to the person as clairvoyance would.\r<br />-Placebo (Adept): You temporarily gain 120 points of health, but after 60 seconds you lose 120 points of health. Much cheaper in magicka cost than a restoration spell of the same power.\r<br />-Linking Spell (Master): You dual-cast this spell on a person in order to make them trackable. It will immediately teleport you near the target and show you the way to them as clairvoyance would.\r<br />-Panacea (Master): You temporarily gain 250 points of health, stamina and magicka but it does 250 points of damage to all after 120 seconds. Much cheaper in magicka cost than a restoration spell of the same power.\r<br />\r<br />[b]Conjuration Spells\r<br />[/b]-Close Summon (Novice): You can mark an allied target or summoned creature by dual-casting this spell and upon casting it again they will immediately be teleported to you as long as they are close-by enough.\r<br />-Remote Summon (Adept): You can mark an allied target or summoned creature by dual-casting this spell and upon casting it again they will immediately be teleported to you from any distance.\r<br />-Forced Summon (Master): You can mark any target friend or foe by dual-casting this spell and upon casting it again they will immediately be teleported to you from any distance.\r<br />\r<br />[b]Restoration Spells\r<br />[/b]-Shelter(Apprentice): For 60 seconds enemies that are below level 10 don&#39;t harm you. Does nothing to mitigate the damage of beings above that level however.\r<br />-Safeguard (Expert): For 60 seconds enemies that are below level 25 don&#39;t harm you. Does nothing to mitigate the damage of beings above that level however.\r<br />\r<br />[b]Destruction Spells\r<br />[/b]-Enemies Explode (Master): The famous spell created by Delphine Jend. Unlike the spell featured in Oblivion however, this one does precisely what it says on the can and reduces any enemy below level 25 to bones in a single flash of fire and light also doing 100 fire damage to all nearby enemies. Can also kill essential NPCs.\r<br />\r<br />[size=5]Related Videos:\r<br />[/size][size=1][youtube]RMmPGe6O8AA[/youtube]                   [youtube]ftCTcK1Iy3E[/youtube][/size]\r<br />\r<br />[size=5]My other mod(s):\r<br />[/size][url=http://www.nexusmods.com/skyrim/mods/61982/?][img]http://i59.tinypic.com/2wgf0r4.png[/img][/url][url=http://www.nexusmods.com/skyrim/mods/75059/?][img]http://oi64.tinypic.com/351ednb.jpg[/img][/url]",
  "categoryId": "75",
  "version": "1.1",
  "author": "OneOnOne1162",
  "createdUnix": "1420839316",
  "updatedUnix": "1420839312",
  "containsAdultContent": false,
  "uploadedBy": "OneOnOne1162",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142100",
      "name": "Simply Spells",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "Simply Spells-61533-1-1.7z",
      "uploadedUnix": "1420839312",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/45b136d80abf1f2aa9396822211d968418cdb01b855e3a15fe4e7d4e89667609/analysis/1420839362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simply%20Spells-61533-1-1.7z?fid=1000142100&ttl=1535849942&ri=8192&rs=8192&setec=578eef6892d115a7c552d39a570aa37c"
    }
  ]
}