{
  "modId": 61562.0,
  "modName": "Ysgramor Preset",
  "summary": "Ysgramor was the first Harbinger of the Companions. He hailed from Atmora and along with his 500 Companions drove the Falmer out of Skyrim and claimed it for the Atmorans. Now you can play as him&#33;",
  "descriptionHtml": "Ysgramor and his sons Yngol and Ylgar were the only survivors of the Night of Tears when the ancient Falmer sacked Saarthal and killed all within. He returned home to Atmora and gathered his famous 500 Companions. Together they returned to Skyrim and exacted revenge on the Falmer for what they had done. This started the full-scale colonization of Skyrim by the Atmorans.\r<br />\r<br />Ysgramor is the &#34;Harbinger of us all&#34; and is considered to be the world&#39;s first human historian as he developed a written language for the Atmorans to use. He was also a fierce warrior and the very epitome of what the Nords of modern times look up to. In vanilla Skyrim you briefly meet Ysgramor in Sovngarde. You find him outfitted in traditional Ancient Nord Armor and with his trusty battleaxe Wuuthrad on his back. This mod will enable you to play as Ysgramor by adding his face as an additional character preset for MALE NORDS ONLY. This should be compatible with all other mods, including ones that change races as it is dependent on the Skyrim.esm only.\r<br />\r<br />This mod does NOT give you ANY of Ysgramor&#39;s equipment when you start (Wuuthrad, Ysgramor&#39;s Shield, Ysgramor&#39;s Soup Spoon or Ancient Nord Armor). If you want those I suggest you complete the Companions questline. Or if you&#39;re intent on roleplaying as Ysgramor you can always use the console to acquire them. I haven&#39;t included any screenshots as I use other mods that edit player appearance and would make him look different from how he would appear in your game. Feel free to upload your own screenshots however. I have tested the mod and there should be no issues. Additionally after you create your character you can uninstall this mod as it simply adds a preset slot. After character creation your character&#39;s appearance is saved and thus this mod becomes unnecessary to keep in your load order.\r<br />\r<br />TO INSTALL:\r<br />\r<br />Installation is simple. Simply download the file and extract the MaleNordYsgramorPreset.esp to you Skyrim data folder with all the other plug-ins. Additionally you can simply download it via NMM. Then simply activate the mod and you&#39;re done. To uninstall simply delete the esp from your data folder or deactivate and delete using NMM. Keep this mod near the end of your load order (after all other mods that affect races). LOOT or BOSS should do this automatically, but if not you may have to do so manually.\r<br />\r<br />RECOMMENDED YOU USE WITH:\r<br />\r<br />Rise of the legend - Ysgramor by newermind43: http://www.nexusmods.com/skyrim/mods/53581/?\r<br />\r<br />Wuuthrad Fix - Rise of the legend - Ysgramor by GendunDrup: http://www.nexusmods.com/skyrim/mods/54216/?\r<br />\r<br />Shield_of_Ysgramor by k-xperience: http://www.nexusmods.com/skyrim/mods/2121/?\r<br />\r<br />aMidianBorn wolf armor and skyforge weapons by EmeraldReign, 83Willow, and CaBaL[b]: http://www.nexusmods.com/skyrim/mods/34147/?[/b]\r<br />\r<br />Enjoy&#33;",
  "categoryId": "34",
  "version": "Final",
  "author": "thor3992",
  "createdUnix": "1420924001",
  "updatedUnix": "1420923675",
  "containsAdultContent": false,
  "uploadedBy": "thor3992",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142229",
      "name": "Ysgramor Preset",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Ysgramor Preset-61562-Final.zip",
      "uploadedUnix": "1420923675",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/8f13949c993c1d718e09bad854818e1899e021b7e513951122fdf3921d44c7a0/analysis/1420923722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ysgramor%20Preset-61562-Final.zip?fid=1000142229&ttl=1535850004&ri=8192&rs=8192&setec=d1229d9d23eba57366532e30630a92a3"
    }
  ]
}