{
  "modId": 6157.0,
  "modName": "Tools of Kagrenac from Morrowind",
  "summary": "Tools of Kagrenac are ancient artifacts from morrowind from which the dwemer used to tap in the power of lorkhan&#39;s heart and possibly caused them to disappear...\r<br />",
  "descriptionHtml": "Lore and history aside what i am doing is bringing back these artifacts along with wraitguard into skyrim for all of you folks&#33;\r<br />\r<br />As you know if you have done the side quest &#34;Arniel&#39;s Endevor&#34; from the college of winterhold you will know the he has mentioned both &#34;Sunder and Wraithguard&#34; but its location is unknown.\r<br />\r<br />You will obtain Keening from skyrim but its power is useless...However, in this mod... i have fixed that error&#33; and now made it useable and Upgradeable for any occasions. \r<br />No need to thank me ;) I know how you think\r<br />\r<br />If you guys played morrowind and finished it, you would definitely know what Keening and Sunder is as well as wraitguard. They are extremely powerful ancient artifacts with extremely powerful enchantments to go with it... so i tried to mimic it as best as i could relative to skyrim&#39;s magic/combat/enchant mechanics and try to make a reasonable yet believable artifact of this kind... its meant to be strong... cheap?... hopefully not...\r<br />\r<br />My Aim for Tools of Kegrenac is a mod where you feel like a part of history by wielding an ancient artifact from morrowind. \r<br />Used by the Nerevarine [Main Character from morrowind] in order finish the main quest. Sunder, along with Keening, was subsequently lost during an annual pilgrimage to the Heart some time in the Third Era.\r<br />\r<br />So far without the actual Skyrim CS i can&#39;t place it in the game in terms of putting it in an environment or making a miniature quest to obtain it otherwise... so temporarily add it via console. When the Construction Set is out I will try and make a little quest to obtain the item and try to make sense of it at the same time... i might need some help on this part&#33;\r<br />\r<br />SUNDER: Player.additem &#34;xx01001001&#34; #\r<br />KEENING: Player.additem &#34;xx01001005&#34; # [NON-REPLACER]\r<br />\r<br />Obtain &#34;Keening&#34; from Quest Arniels Endevour from the college of winterhold [REPLACER]\r<br />The .ESP included is Data files is a RE-PLACER for Keening&#33;\r<br />\r<br />&#34;xx&#34; is the index of the ESP loaded.\r<br />\r<br />Version 1.0\r<br />-Added Sunder \r<br />-Fixed Enchantments for Vanilla Keening weapon. Allow Upgrades.\r<br />\r<br />Version 2.0\r<br />-Added Keening\r<br />-Updated Sunder Model, Texture and UV\r<br />-ESP&#39;s Updated, now will show correct Price\r<br />-Added both Keening REPLACER or NON-REPLACER ESP&#39;s\r<br />\r<br />You can upgrade it in a wet stone but it takes alot of... items...\r<br />\r<br />Install-\r<br />Examine the file.\r<br />Extract rar contents to your &#92;Data folder.\r<br />If Prompted with message Click &#34;YES TO ALL&#34; \r<br />Enjoy&#33;\r<br />\r<br />\r<br />Please Comment and Endorse if you like it&#33;\r<br />DO you have idea&#39;s i can use for this mod? Tell me&#33;, i would like to know&#33;\r<br />Constructive Criticism welcomed&#33; \r<br />Find any Bugs? Tell me right away&#33;\r<br />And always, Thanks for Downloading&#33;\r<br />\r<br />*NOTE*- I have worked very hard and spent countless of hours into making this weapon for skyrim. I have updated the textures, UV maps and the mesh to better suit the model... this is not a rip from the mod yet a appropriation of it. I really Hope you will love this mod as much as i do&#33; \r<br />Thank you everyone&#33;&#33; \r<br />\r<br />Future Plans: I will be adding wraithguard, Scrips and Possibly a Quest.\r<br />\r<br />***CREDITS***\r<br />-&gt;thePOSTALdude- Where i got keening and Sunder from his awesome mod &#34;Modular Oblivion Enhanced&#34;\r<br />-&gt;Star Boi - The creator of the mesh &#34;Keening, Sunder and wraithguard&#34; models \r<br />***END CREDITS***",
  "categoryId": "36",
  "version": "2.0",
  "author": "Krazz",
  "createdUnix": "1326547217",
  "updatedUnix": "1327567599",
  "containsAdultContent": false,
  "uploadedBy": "Krazz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23108",
      "name": "Tools of Kagrenac v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9412",
      "fileName": "Tools of Kagrenac v2-6157-2-0.rar",
      "uploadedUnix": "1327567599",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6a817fbe08669f2a0c93271c00313d3e5bbe9445b1a6f8287f3e7f636d915819/analysis/1406638227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tools%20of%20Kagrenac%20v2-6157-2-0.rar?fid=23108&ttl=1535763380&ri=8192&rs=8192&setec=beb3ed175da193d7495adf5cf5028a16"
    }
  ]
}