{
  "modId": 61576.0,
  "modName": "The BloodStone Blade",
  "summary": "A new unique dagger with an evil enchantment.",
  "descriptionHtml": "[b][center][size=5]~Dragonborn is Required~[/size][size=4][/size]\r<br />\r<br />[size=4]Presenting, the BloodStone Blade&#33; This mysterious and evil dagger has been handed down over centuries, though few know its origin. Read on to become one of those few, though be wary, for with knowledge comes danger.[/size][/center]\r<br />\r<br />[/b]\r<br />\r<br />[i][size=3]Long ago, a high elven lord known as Eru Narra hired a sorcerer to advise him in matters of magic. Lord Narra was unaware that his newly hired sorcerer was a master Illusionist, and that he had been tricked. Eru believed the sorcerer to be a friend, and called on him again and again, first for advice, then for more casual reasons. The elf was vain, and treasure was his greatest weakness. One day the sorcerer presented him with a massive gem, blood red in color and with an unsettling gleam that captured the eye. The lord was instantly bewitched, both by the strange beauty of the stone and the subtle power of the sorcerer&#39;s magic.[/size]\r<br />\r<br />[size=3]Years passed and the elf grew to love the stone with a horrible passion, keeping it near him night and day. The lord hired adventurers to scour the lands far and wide for more gems of its like. He received gifts of garnets, rubies, and stones still rarer both great and small, but no gems to match its allure. Eventually, Lord Narra could do nothing but stare into the stone, wasting away under its spell. Finally, one night after the elf had collapsed from hunger and exhaustion with his hands tightly wrapped around the stone, the sorcerer stole into his chambers and pried the stone from the lord&#39;s feeble grasp. [/size]\r<br />\r<br />[size=3]Upon awakening, Lord Narra went entirely mad at the loss of his stone and tore apart the palace looking for it, going so far as to torture and execute every member of the palace staff, guard, various peasants, and even his own family for stealing his stone. All who denied him simply confirmed his suspicion, and he could not look upon anyone without imagining them holding the stone save the treacherous sorcerer. Meanwhile, the sorcerer was painstakingly carving the stone into a dagger, for he knew that this magical artifact was actually a rare, possibly unique fragment of Oblivion known as the BloodStone, and with the proper rituals, it could steal a person&#39;s entire essence, turning them into an empty husk. The stone could be used in many ways once the ritual was completed, but one of the most insidious was to create a weapon from the stone and plant it in the heart of the betrayed person.[/size]\r<br />\r<br />[/i][size=3][i]As Lord Narra lay weeping over the loss of his stone, too feeble to even stand, the sorcerer lifted the dagger in front of the elf&#39;s face as he released him from his illusion. The lord looked into the blade of the dagger and in that instant, he realized how he had been tricked and what he had done in the name of the stone. That was the purest despair a mortal could feel, and as Eru&#39;s essence began to flow into the dagger, the sorcerer slipped the razor sharp blade between the elf&#39;s ribs and into his heart.[/i] [/size]\r<br />\r<br />[size=3][i]The dagger came to be known as the BloodStone Blade, and over the centuries it passed from hand to hand, corrupting some and giving great power to others already corrupted. It is said that on certain bleak nights the wielder hears the anguished wails of the elven lord and those who he executed as if from a great distance, riding the wind. This has never been confirmed, but be wary of its evil power lest you find yourself going mad as well.[/i]\r<br />\r<br />\r<br />[list][*]Find the weapon on the table in Movarth&#39;s Lair, location in screenshots. \r<br />[/*]\r<br />[*]This is intended to be used as a late-game weapon, if you get it too soon it will be really overpowered. \r<br />[/*]\r<br />[*]The dagger comes with a custom texture and does as much damage as a daedric dagger but with a higher critical and weighs less. [/*]\r<br />[*]The dagger is enchanted with slow, absorb health, and soul trap, and has 5000 enchantment which I believe is as much as a grand and a common soul gem. [/*]\r<br />[*]It can be tempered with a daedra heart. \r<br />[/*]\r<br />[/list][/size]\r<br />[size=3]I&#39;m considering making a short quest to obtain it, either as a sort of evil alternate reward for the Meridia quest where it can be looted from the boss&#39;s body, or adding a custom boss to a necromancer dungeon which would be the tortured remains of Lord Narra, having finally hunted down and claimed his prize. That is work for a future update, if the interest is great enough. I would also consider making a complete weapon set for bloodstone weapons of each type (using the stalhrim meshes like the dagger), but only if enough people are interested.[/size]\r<br />\r<br />Another aspect for a future quest which may be beyond my ability is to create an optional side quest where the dagger can be sanctified and become a good version with a different name and texture, golden maybe. \r<br />\r<br />Don&#39;t upload it anywhere else and don&#39;t include it in your mod without asking my permission. Feel free to change its stats for your own personal use.\r<br />\r<br />Credits:\r<br />\r<br />Bethesda",
  "categoryId": "55",
  "version": "1.1",
  "author": "Skyler544",
  "createdUnix": "1420949755",
  "updatedUnix": "1421095235",
  "containsAdultContent": false,
  "uploadedBy": "skyler544",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142297",
      "name": "The BloodStone Blade",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "523",
      "fileName": "The BloodStone Blade-61576-1-0.7z",
      "uploadedUnix": "1420949389",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8188093b37b1b109689d7ef4502342ccbd45862a53f9400d68ad4cddd3b277b8/analysis/1420949403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20BloodStone%20Blade-61576-1-0.7z?fid=1000142297&ttl=1535850022&ri=8192&rs=8192&setec=a03777948580804e198e0853dba6695b"
    },
    {
      "fileId": "1000142578",
      "name": "BloodStone Blade - Fixed Enchantment ",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "523",
      "fileName": "BloodStone Blade - Fixed Enchantment -61576-1-1.7z",
      "uploadedUnix": "1421095138",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c19943518d9314b068d760384901e4b3b8259fb51faf5379847ae89ccfaa4e97/analysis/1421095142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BloodStone%20Blade%20-%20Fixed%20Enchantment%20-61576-1-1.7z?fid=1000142578&ttl=1535850022&ri=8192&rs=8192&setec=ab607600db0ece8a40cb783df9866079"
    },
    {
      "fileId": "1000142579",
      "name": "Optional Non Enchanted Version",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "523",
      "fileName": "Optional Non Enchanted Version-61576-1-1.7z",
      "uploadedUnix": "1421095235",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/dfc5c6c880e0f7072ccbf3d5b3c47bc04ae456497e208c0b825733767e668566/analysis/1421095263/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Non%20Enchanted%20Version-61576-1-1.7z?fid=1000142579&ttl=1535850023&ri=8192&rs=8192&setec=3c5dcc255521eb34212d59e6ded203e6"
    }
  ]
}