{
  "modId": 61598.0,
  "modName": "Stormcrown Estate - RUS",
  "summary": "RUS - A minimal player home just outside Whiterun Stables based on the Sleeping Giant Inn in Riverwood. Full adoption support for 6 children, and room for 5+1 followers, and a spouse. Features a tunnel to Whiterun and a dragon translation book.",
  "descriptionHtml": "[center][url=http://www.nexusmods.com/skyrim/mods/60909][img]http://i.imgur.com/sjWWNF5.png[/img][/url] [url=http://www.nexusmods.com/skyrim/mods/61598][img]http://i.imgur.com/BGuo8a2.png[/img][/url][/center]\r<br />Looking for the English version? [url=http://www.nexusmods.com/skyrim/mods/60909]Grab the original mod here[/url].\r<br />[color=#5ea2e5][size=5]Краткое описание:[/size][/color]\r<br />Небольшой уютный домик около конюшни Вайтрана на основе таверны &#34;Спящий Великан&#34; в Ривервуде.\r<br />\r<br />Я знаю, что некоторые люди хотели бы пройти сложный квест или какое-нибудь подземелье, чтобы получить заветный ключик от дома, а некоторым это просто не нужно (они же убивают всех взглядом). Так что я сделал сюрприз для всех. Для доступа в дом нет квеста или сложного подземелья, однако есть туннель, ведущий из подвала дома до Вайтрана. Как только вы зачистите туннель и найдете ключ, у вас будет возможность попасть из дома прямиком в Вайтран. Но будте готовы&#33; Это вам не легкая прогулка и сражения с заморышами... Запасайтесь эликсирами и точите клинки&#33; Если у вас возникли проблемы с прохождением, прочтите hints.txt, но по крайней мере, сначала сами попробуйте. Рекомендую быть не ниже 50 уровня, Босс 80 уровня, если что.\r<br />\r<br />В качестве бонуса к получению быстрого перехода между домом и Вайтраном, вы получите уникальную книгу Языка Драконов, которая подробно описывает алфавит драконов и все общеизвестные слова. Возьмите ее с собой в путешествие и вы сможете перевести слова на стенах.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/60915-1-1419064665.jpg[/img]\r<br />\r<br />Тем не менее, ключик от дома вы просто так не получите... Поищите около дома. Просто подумайте, куда бы вы могли спрятать ключ? Если не догадались - вам один путь... Через туннель в Вайтране. Если найде ключ, мои поздравления&#33; Но учтите, что туннель вам все равно придеться зачистить...\r<br />\r<br />Дом полностью настроен и проверен для спутников, детей и жены/мужа. Отредактированы навмеши. Включает в себя все для крафта и приготовления пищи, алхимии и зачарования. Все очень компактно и легко доступно. Манекены. Витрины. Стойки для оружия. Красивые картины, авторские баннеры Довакина, кровати (с настоящими подушками), и так далее. Много хранилищ для вещей. Дом удобно расположен, далеко бегать не надо. Дом для 6 детей, 1 супруга/супруги, 5 + 1 спутник (+1 вампир). Если вам нужно больше, то вы маньяк&#33;\r<br />\r<br />[youtube]BnypXcnhTuk[/youtube][youtube]NILOXVN8ApQ[/youtube]\r<br />\r<br />[color=#5ea2e5][size=5]описание:[/size][/color]\r<br />Этот дом все о удобстве. Как только вы шаг внутри вы представлены оружейные стойки по обе стороны двери, а также манекены непосредственно перед вами в течение некоторого быстрого наряд или оружия подкачку на людей, которые предпочитают немного больше ролевые игры.\r<br />\r<br />Есть, конечно, более 3 манекены в непосредственной зрения, а также два очень известных витрины для чего-то, как кинжалы, и два больших витрины для больших оружия. На стенах есть два полных бляшки щит / оружие, а также 6 бляшки оружия - и все это прямо в дверь. Ох, и над направо в каждом из углов имеются святыни всех богов&#33;\r<br />\r<br />Через несколько шагов в дверь, и у вас есть вся ваша крафта потребности полностью выполнены. Существует полная схема установки ковка в комплекте с тонны организованного хранения и довольно ловко минимальной завода, построенного прямо в ямы огня.\r<br />\r<br />Вокруг на другой стороне ямы огня у вас есть настройки для приготовления пищи с небольшим роскошным немного Двемеры печи с кастрюлю на вершине, все работает без проблем с существующей пожарной яму. Там есть много хранения для ваших эля, меды, вина в непосредственной близости от настройки приготовления, а также.\r<br />\r<br />Кроме того, мы имеем таблицу полностью установки и не фиксируется на месте, так как ни ума он получает в вашем доме вы не будете иметь пластины летающих повсюду. Я тем не менее оставляют выбор пищи для вас - вы будете иметь, чтобы установить свои собственные тарелки. Я уверен, что некоторые из roleplayers там предпочитают это.\r<br />\r<br />И чтобы закончить ваши крафта потребности - по-прежнему в первой комнате вы вошли в, заметьте, у нас есть все ваши очаровательные и алхимия потребностей в дальнем конце комнаты с каким-то красиво организованного хранения для каждого. В дополнение к этому, на левой у вас есть персонал верстак вместе с хранения для ваших Столики и ваших heartstones. Кроме того, есть даже шрифт обновления, когда вы запутались и просто хочу, чтобы начать все сначала - это будет полностью отменить любые чары или улучшения сделали на объект. Если вы, ребята, помню, когда я первоначально выпущен этот мод я хотел включить распыления шрифт, который сделал то же самое, но я не смог получить разрешение на публикацию, что ... так как версии 3, я по сценарию мой собственный&#33; Наслаждайтесь.\r<br />\r<br />Это место не могло быть более удобно. Я сделал это для себя. Я уже говорил, это было красиво? Когда вы выходите в дверь, вы, вероятно, заметите классические картины на стене, в основном Венеры или сирен. Конечно, это уже выглядело довольно удивительным, прежде чем вы когда-либо вошел, что с тех Dovahkiin баннеров снаружи и Череп Дракона, прямо над вашей двери. Ниже картин есть плантаторы и есть 48, я повторяю [b]48[/b] участки плодородной почвы. Если вы думаете, что нужно больше, то вы, вероятно, нужно рассмотреть, какие молока пьющего ваш Dovahkiin является и вернуться в убийстве драконов&#33;\r<br />\r<br />Ваш последователь, если вам посчастливилось иметь один, имеет первую комнату слева, и хотя в маленькой комнате, будут в основном жить в роскошной жизни. Они имеют все, что они могли понадобиться: свой собственный манекен, подставки оружия, учебный манекен, шкаф для одежды, кровать, грудь, наряду с кресла и ночной столик с лампой, чтобы они могли читать удобно. Они также посчастливилось иметь золотой постели кастрюлю. Да. Вы, вероятно, нужно что-то вроде [url=HTTP://www.nexusmods.com/skyrim/mods/18045]My Home is Your Home[/url], чтобы получить ваш последователь двигаться в качестве версии 2.0 доме сейчас. поддерживает 4 дополнительных последователей в кварталах новый последователь, расположенных под номер последователя. Также поддерживает дополнительный последователем вампира с гробом вампира в зловещем номер.\r<br />\r<br />Во второй комнате слева у вас есть комната, где ваши дети, если вам посчастливилось иметь таковые будут проживать в номере. Они имеют все необходимое с кровати, комоды, шкафы, комоды, золотые свечи и золотые кастрюли слоем. Они не имеют куклы или что-нибудь подобное, но давайте быть серьезным ... просто Какое молоко пьет вы повышения, если вы покупаете их, что вещи ?&#33; Поднимите надлежащего Норд ребенка&#33; Просто дайте им большой ПР топор и отправить их на охоту. Принятие полностью работает, кстати. Вы будете нуждаться в [url=HTTP://www.nexusmods.com/skyrim/mods/29249] Hearthfire Multiple Adoptions[/url] мод для него [s], и есть место только для двух детей [/s], но это дом полностью поддерживает принятие&#33; Начиная с версии 2.0 дом теперь поддерживает принятие 6 детей с добавлением детских кварталы под детской комнате.\r<br />\r<br />Я не забыл о вас, конечно. О, нет ... вы живете наиболее роскошной жизни все. Вы находитесь в комнате на крайнем правом в комплекте с баннеров, дракон череп на стене, более красивые картины, чем вы можете встряхнуть палку в, и стол, который имеет все что вам может понадобиться. Вы сидите за столом, и вы делаете это в вашем трон, потому что почему вы должны сидеть в какой-то дерьмовый неудобном стуле любом случае? А оттуда у вас есть доступ к пользовательской памяти для вашего журналы, заметки, книги, свитки, монеты кошельки, ключи, сейф, и пол в безопасности. Там также креслом для чтения поблизости, если вам случится хотите, чтобы сидеть под лампой, чтобы почитать любимую книгу. В передней части стола есть большая карта Скайрима так что вы можете планировать свой следующий приключение в то время как вы организовать все ваши вещи.\r<br />\r<br />Конечно, у вас есть другие вещи тоже ... не так ли? Вы знаете, что вы не обязательно хотите, чтобы кто-то, чтобы быть вокруг. Ну, есть комната для этого тоже&#33; Найти его и у вас есть место для почти каждый Даэдрические артефакт, старший свиток, дракон священник маску, дракон коготь, Paragon, и Гильдия Воров сокровища. [s] Это автоматически помещается на их дисплеях для вас, а также - просто использовать большие сокровищ безопасного право, когда вы идете в [/s] Начиная с версии 3, просто использовать дисплеи напрямую.. При наведении курсора на пустую область скажу вам, что пункт идет туда и активации его автоматически разместит его на дисплее. Если вы посмотрите вокруг достаточно тщательно вы найдете секретную комнату - темная Братство стиль пыток место для более зловещих игроков.\r<br />\r<br />Ну, а теперь, что вы нашли эту комнату ... Вы наверняка увидите люк, ведущий вниз к Whiterun туннелей. Каковы Whiterun Туннели, спросите вы? Ну, это именно то, что вы всегда хотели, вот что&#33; Это туннель, ведущий непосредственно к Whiterun. Вы нашли какую-то старую древний нор туннель, ведущий под вашего дома всю дорогу до Whiterun с выходом построен прямо под мостом по основному ворот. Кроме этого, когда вы входите это так, как это может быть все засекречена без каких-либо свидетелей, и все такое.\r<br />\r<br />Дело в том ... вы не построить этот тоннель. Вы только что закончили строить свой дом (или, может быть, это был подарок от богов?), И этот туннель просто и появится в вашем подвале ... более того, она заперта&#33; Какие Сисси драконорожденного бы просто стоять что-то вроде этого? А в вашем собственном доме не меньше&#33; Вы бы лучше пойти проверить его.\r<br />\r<br />Что бы ни там вы не должны беспокоиться о больше, как только вы его уничтожить, как оба конца тоннеля закрыли. На яркой стороне, как только вы имеете дело с тем, что именно вы будете иметь хороший тоннель, соединяющий ваш дом прямо на Whiterun&#33; Вы не собираетесь разорвать ваш нос, запустив в стену в кромешной темноте, либо, потому что это хорошо освещено с факелами вдоль всего пути.\r<br />\r<br />Что еще? Местоположение Местоположение Местоположение. Ваш дом находится в центре Скайрима и просто оживленной ходьбы от Whiterun конюшен, в которых означает, что вы может быть где угодно в оснастке&#33; (с последующим длинным скучно ездить в вагоне, но эй, кто отслеживает&#33;)\r<br />\r<br />Я построил этот дом для себя. Я сел, и я подумал: &#34;Что именно я хочу в доме?&#34; Я, конечно, знал, что я хотел все крафт объектов и что вы, но некоторые дома остались за бортом с вещами, и вы в конечном итоге тратят больше времени сдачи каждого ингредиента вы имеете в отдельных банках или каждую книгу в соответствующем разделе, чем вы играете игра. Это намного больше упрощается. Все компактно, это очень маленький дом, хотя он, вероятно, чувствуют себя довольно большой, но его малость дает дополнительное преимущество все, что вы хотите быть всего в нескольких шагах от отеля. Здание с конечным количеством места также сдержал свое расширение увлечение под контролем. Не можете очень хорошо идут добавления 10 дополнительных номеров для этого-и-что, когда вы в значительной степени привязаны к первоначальному плану здания. Но, это только приведет к улучшению украшения и более домашним место чувство в конце.\r<br />\r<br />Недостатком является то, ... что вы собираетесь нужно все DLC, чтобы удовлетворить требования для этого месте: HearthFires, драконорожденных и Dawnguard. Я должен был использовать их так, это не может быть действительно помогло.\r<br />\r<br />[color=#5ea2e5][size=5]Как его получить:[/size][/color]\r<br />Вы не читали всю писанину, что написана сверху? Поздравляю&#33; Дом находится через дорогу от конюшен Вайтрана, вы его не пропустите. Побегайте вокруг дома, может и найдете ключ. А можете пойти сразу в туннель, он под мостом на входе в Вайтран. Но я предупредил, это будет не легко.\r<br />\r<br />[color=#5ea2e5][size=5]Требования:[/size][/color]\r<br />Skyrim 1.9.*\r<br />[color=red](Required)[/color] Dawnguard DLC\r<br />[color=red](Required)[/color] HearthFires DLC\r<br />[color=red](Required)[/color] Dragonborn DLC\r<br />(необязательно) [url=http://www.nexusmods.com/skyrim/mods/29249]Hearthfire multiple adoptions[/url] - для детей и супруга/супруги.\r<br />(необязательно) [url=http://www.nexusmods.com/skyrim/mods/18045]My Home Is Your Home[/url] - для спутников.\r<br />\r<br />[color=#5ea2e5][size=5]Что есть для хранения артефактов:[/size][/color]\r<br />Все маски Драконьих Жоецов\r<br />Все Когти Драконов\r<br />3 Древних Свитка\r<br />Шлем Ингола\r<br />Grey Fox Bust (goes into Sinister room on desk)\r<br />Statue of Dibella\r<br />Crown of Barenziah\r<br />All thieves guild treasures\r<br />Все парагоны\r<br />All Daedric artifacts\r<br />All black books\r<br />All Gauldur stuff\r<br />Auriel&#39;s bow & shield\r<br />All divine amulets\r<br />Ysgramor&#39;s shield and Wuuthrad\r<br />All bugs in jars (Bee, Butterfly, Dragonfly, Torchbug, Moth) - located at alchemy table\r<br />\r<br />Если вы просто хотите, чтобы все элементы экрана, не имея, чтобы заработать их, вы можете захватить файл летучая мышь в дополнительные файлы и положить его в каталог, что ваш TESV.exe находится (не, папку Data), то в игре типа &#34;летучая мышь All-DISPLAY-элементы &#34;, и он будет добавить их все в вашем инвентаре. Вы, возможно, потребуется изменить порядок загрузки на некоторых из элементов, как моя установка использует все неофициальные патчи в правильном порядке.\r<br />\r<br />Примечание: Там это витрина в зловещем Комната для вашего Клинок Горя но вы должны положить его туда самостоятельно, а не просто бросил его в грудь сокровища.\r<br />\r<br />[color=#5ea2e5][size=5]Credits:[/size][/color]\r<br />tueffelachtein - General Displays mod which as of 3.0 I&#39;m not using except as a mesh resource\r<br />gentester - pillows\r<br />Blary - bookset, enchanting wall art, open books, ingredients in jars resource, racks, key holder\r<br />Oaristys and Tony67 - Modders Resource Pack\r<br />eldiabs - mannequins, weapon racks, display cases, etc pre-set up\r<br />various amazing classical artists - the beautiful paintings adorning the walls\r<br />Artisanix - the picture frames\r<br />(myself) - realistic wooden mannequins - used in screenshots\r<br />raiserfx - detailed rugs (base for the blue rug - all I changed was all the vertex coloring)\r<br />Thuum.org - dragon alphabet font and translations\r<br />Dovah Zul Wiki - further translations\r<br />Elianora - soul gem chest\r<br />Darkfox127 - light toggle script, and his many tutorial videos of which I&#39;d be completely lost in the CK without\r<br />\r<br />[color=#5ea2e5][size=5]FAQ:[/size][/color]\r<br />Q: То место, где я нашел ключ, можно использовать как сундук?\r<br />A: Нет, он перезапустится. Я не советую хранить там ничего.\r<br />\r<br />Q: Что, черт возьми, происходит? Эта женщина ... Вы с ума сошли? Как, черт возьми я ее убью?&#33;\r<br />A: Ой, да ладно, не будь трусом, набери команду и подкачайся. Читай hints.txt в конце концов.\r<br />\r<br />Q: Я не могу найти этот дурацкий ключ ... вы уверены, что он есть?\r<br />A: Да.\r<br />\r<br />Q: Нет, действительно, я не могу его найти. Я думаю, что вы лжете.\r<br />A: Отлично. Пройдите через туннель. После того, как вам удастся попасть в ваш дом, вы найдете копию ключа в держателе на стене рядом с вашим столом.\r<br />\r<br />Q: Мои манекены ходят&#33;\r<br />A: Это ошибка игры, тут ничего не поделаешь. Ищите в интернете, есть много фиксов.\r<br />\r<br />Q: Бывает, натыкаюсь на невидемые стены или меня толкает кто-то...\r<br />A: Это опять баг с манекенами. Опять же, ничего сделать не смогу.\r<br />\r<br />Q: Я думаю, что я нашел несколько недостающих мешей / текстур ...\r<br />A: Пожалуйста, сообщите об этом мне, и я это исправлю сразу.\r<br />\r<br />Q: Но я бы хотел фонтан для снятия зачарований...\r<br />A: Он называется Фонтан обновления, рядом со столом зачарований.\r<br />\r<br />Q: Где вы взяли эти манекены, как на скриншотах?\r<br />A: Это мой [url=http://www.nexusmods.com/skyrim/mods/60766]Realistic Wooden Mannequins[/url] мод.\r<br />\r<br />Q: Что за броню вы носите на скриншотах?\r<br />A: Это сочетание нескольких вариантов брони. Капюшон из Hunting Grounds, нагрудник из Selene Нео, а сапоги и перчатки из Lustmord.\r<br />\r<br />Q: Что означают эти баннеры?\r<br />A: Ну большой значок, это символ[b] Акавиры д[/b]ля драконорожденного. Сам текст Dovahzul и читается, как Довакин или драконорожденный.\r<br />\r<br />Q: Что за журнал я нашел? Мне лень переводить.\r<br />A: Это старый журнал, который рассказывает как тоннель был разрушен, некоторые строительные заметки, и что она почувствовала возвращение Алдуина и пробуждение драконорожденного. Что их пути должны пересечься в ближайшее время, и что... Будет битва.\r<br />\r<br />Q: Мои Гильдия Воров сокровища похожи, что они с плавающей ... что с этим делать?\r<br />A: К сожалению, если вы начали игру с версии этого мода до их перемещении оригинальные позиции будет испечен в свой Сохранить несмотря на полках сами сохраняя свои новые позиции.Самым простым решением является просто начать новую игру. Вы можете попробовать вводе внутренней ячейки и введите PCB в консоли, то ждали 30 дней и, видя, если что фиксирует это, но нет никаких обещаний там. Это в значительной степени сосет.\r<br />\r<br />Q: Что ENB вы используете в ваших скриншотах?\r<br />A: Большинство из них сейчас используете Грим и мрачные Хирсин на высочайшее качество, но некоторые из них с помощью отредактированную версию естественного освещения и атмосферных. Некоторые из более новых, также используют Грим и Somber Сангвиник высочайшее качество.\r<br />\r<br />Q: Были ли вы пьяны, когда вы писали это описание?\r<br />A: Я не говорю по-русски. Я использовал Google Translate.Мод сама была переведена другим пользователем.",
  "categoryId": "67",
  "version": "3.1",
  "author": "XunAmarox",
  "createdUnix": "1421001152",
  "updatedUnix": "1421000344",
  "containsAdultContent": false,
  "uploadedBy": "XunAmarox",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142385",
      "name": "Stormcrown Estate RUS 3-1 Full",
      "version": "3.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34261",
      "fileName": "Stormcrown Estate RUS 3-1 Full-61598-3-1.7z",
      "uploadedUnix": "1420999788",
      "modVersion": "3.1",
      "virusScanUrl": "https://www.virustotal.com/file/3ca179a52f6b5e6a166f6ca27f5071f5d4da877fbfb718221db22c526231ab4b/analysis/1420999810/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stormcrown%20Estate%20RUS%203-1%20Full-61598-3-1.7z?fid=1000142385&ttl=1535850049&ri=8192&rs=8192&setec=0fb745b7f3792897320ea64d1aeeffe4"
    },
    {
      "fileId": "1000142387",
      "name": "All Display Items bat file",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "All Display Items bat file-61598-.7z",
      "uploadedUnix": "1421000344",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/852dcccd269e1a386ca57fc286d4820207ac9a8f706f7ab7c83d533cdc454343/analysis/1421000403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Display%20Items%20bat%20file-61598-.7z?fid=1000142387&ttl=1535850049&ri=8192&rs=8192&setec=1750ce1190585178e06a3c38bd9ec7de"
    }
  ]
}