{
  "modId": 61644.0,
  "modName": "Speech Tree Redone",
  "summary": "This mod simply makes the Speech tree much more useful and logical.\r<br />It gives you access to the actually useful perks in the early game and gives them a structure that actually haves sense.",
  "descriptionHtml": "Just a little mod I did for myself and decided to share. Never liked the vanilla Speech tree, nor the multiple mods that make changes like adding perks for shouting and so on. I just needed one that fitted my playstyle, so feel free to try it :)\r<br />\r<br />-Now the Haggling perk gives you a 10% bonus each level,  at 0, 25, 50, 75 and 100 Speech. So now you can have up to 50% better prices just by giving it a point once in a while and the Vanilla 30% is available at level 50.\r<br />\r<br />-The Intimidation perk is independent and divided in two levels, first one gives you a bonus 50% chance of Intimidate and second 100%. Level 35 and 70 respectively. Makes more sense.\r<br />\r<br />-The Persuasion perk is unlockable at Speech 35 and leads to Allure at level 50, wich gives you 20% better prices with the opposite sex. Available earlier and actually worth it :D\r<br />\r<br />-The Investor perk is available from level 25 and doesn&#39;t require anything but a point on Haggling. Now you can make wealthy merchants from the beggining and actually be able to sell your mountains of loot.\r<br />\r<br />-Fence is available at Speech 40. Now you can actually sell your stollen goods withou having to go all the way to level 90 where stealing is already worthless. It isn&#39;t that hard to sell stolen goods, for Zenithar&#39;s sake. \r<br />\r<br />-Fence leads to Bribery at speech 70, so you now have another reason to do the Thieve&#39;s Guild questline. And also, who bribes the guards? Let&#39;s be honest, it&#39;s waaay easier to load a previous save or sneak-killing them.\r<br />\r<br />-And finally, Master Trader has been changed to give 1000 gold to every merchant in the world to the effect of Merchant. Why? Because it was absolutely unlogical that just because you leveled everyone got rich, as well as a total waste once you had Fence. And lets face it, being able to sell anything to anyone is a complete game-breaker so I felt it was better to put it as the ultimate reward.",
  "categoryId": "104",
  "version": "1.0",
  "author": "Skoomadicto",
  "createdUnix": "1421129244",
  "updatedUnix": "1421128405",
  "containsAdultContent": false,
  "uploadedBy": "Skoomadicto",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142632",
      "name": "Speech Tree Reamde",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Speech Tree Reamde-61644-1-0.zip",
      "uploadedUnix": "1421128405",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e3e933eefc9cff7fbdec0d3b3ca9c0b16dddecb629b86421414b22cdeb3e5736/analysis/1421128442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Speech%20Tree%20Reamde-61644-1-0.zip?fid=1000142632&ttl=1535850121&ri=8192&rs=8192&setec=fb3eb9439e0f8f4f4e85e248aa20cfc0"
    }
  ]
}