{
  "modId": 61669.0,
  "modName": "New Lands and Quest - The Dovahkiin&#39;s Greatest Challenge",
  "summary": "New Lands Beyond Skyrim. Experience challenges far beyond what you experienced in the vanilla game. Perfect for end-game players.\r<br />\r<br />Contains a new world, a new quest with quest markers, 3 custom voiced NPCs, hundreds of enemies, and 2 unique bosses.",
  "descriptionHtml": "[b][center]PREPARE FOR A NEW CHALLENGE\r<br />[b]Created 1/13/15\r<br />[/b]\r<br />Designed Exclusively for High Level Characters\r<br />\r<br />Showcase your might in a way you never have before.[/center]\r<br />\r<br />This mod is 100% ready to go: Quest stages, quest markers, 3 fully custom voiced NPCs, hundreds of enemies, 2 unique bosses, 15 locations including a custom made home, camps, towers, a stronghold, and a town. Add hours of intense gameplay with a download that is under 300Kb in size&#33;[/b]\r<br />\r<br />[b]This mod is intended for experienced Skyrim players only. Recommended for players level 70 and up. You have never encountered anything this difficult in the vanilla game. You WILL need the best gear and the best potions. You WILL need your shouts and a ton of your spells. \r<br />\r<br />UPDATE 1/25/15 The Extreme version is designed for crazy people like urogodDx who complained it was too easy. I have not been able to beat this yet. It&#39;s crazy hard. Recommended for players 120 and up and players that are cheating. It&#39;s insane and there are too many enemies... if you try to sneak past too many hoards you will CTD. \r<br />\r<br />Note: extreme version has NO courier start issue and has [u]FULL dialogue[/u] thanks to a guy in the post that told me how to do it. I&#39;ll have the normal version updated soon as well.\r<br />\r<br />PICTURES FROM NEW EXTREME VERSION:\r<br />[img]http://i61.tinypic.com/1zplhxe.jpg[/img]\r<br />[img]http://i57.tinypic.com/2zsqzx3.jpg[/img]\r<br />\r<br />[/b] I wanted to make a quest that was very, very difficult for my end-game level 120 Nord. I feel mods that change difficulty put too much emphasis on enemy health. I don&#39;t want opponents with an unrealistic amount of health; I want more opponents. I wanted a new quest with hundreds of powerful, organized opponents and that&#39;s exactly what this mod delivers. Did I say difficult? Yeah. You can&#39;t beat this without a powerful character and some serious battle strategy. \r<br />\r<br />[center]---------------------------------------------------------------------------------------------------------------------------------------[/center]\r<br />If you manage to succeed, please let me know in posts so I can add you to the challenge Champion&#39;s List. See below for more details.\r<br />\r<br />CHAMPION&#39;S LIST:\r<br />DDunne666\r<br />(side note: DDunne reports that with the high king of skyrim mod, you can make the general your follower. The general has 3 shouts: fire breath, frost breath, and disarm)\r<br />\r<br />[center]---------------------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />UPDATE 1/15/15: added a second file to ensure compatibility for more users, also there&#39;s a console command fix that doesn&#39;t require the second download. see compatibility section\r<br />\r<br />UPDATE: 1/20/15 My second mod is done. \r<br />New Lands and Quest 2: The Great War Reignites\r<br />http://www.nexusmods.com/skyrim/mods/61804/?\r<br />\r<br />\r<br />[center]---------------------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />\r<br />[img]http://i59.tinypic.com/30lgfpw.jpg[/img]\r<br />\r<br />[u]INSTALLATION and [size=2]REQUIREMENTS\r<br />\r<br />[/size][list][*][size=2]Skyrim v1.9.32.0.8[/size][/*]\r<br />[/list][size=2]\r<br />INSTALL THE MAIN FILE AND START YOUR GAME. IF YOU DO NOT GET THE COURIER QUEST OR THE PORTAL DOES NOT WORK, DOWNLOAD THE SECOND FILE AND SEE COMPATIBILITY SECTION.[/size]\r<br />[/u](MOD MANAGER)\r<br />Add the archive to your mod manager and activate.\r<br />\r<br />(MANUAL)\r<br />The only file in the archive is the mod&#39;s .esp file. For manual installation unpack it and place the .esp file into your Skyrim/Data folder. \r<br />\r<br />[b][size=3]IMPORTANT INSTALLATION NOTE HIGHLY RECOMMENDED[/size]:[/b] \r<br />First, if you don&#39;t get the message from the courier in town first you won&#39;t get the quest or the quest markers&#33;\r<br />Second, when you first go install the mod, it might take a little while for everything to settle. \r<br />\r<br />The most efficient way to handle this [u]instantly[/u] is to: \r<br />Start game, see courier, enter portal, save, and load that save. Done. Dialogue and quest are ready for you.\r<br />(If you are using the second file for compatibility, skip the courier part)\r<br />\r<br />Longer explanation of line above in case needed: Start your game with the plugin installed, fast travel to a town to see your courier right away. He&#39;ll be there waiting for you and you&#39;ll get a quest marker upon reading the message. Once you head through the portal, immediately save your game and than simply load that save (you don&#39;t have to close Skyrim). All quests and dialogues will automatically be completely filled and ready for some reason. The same approach works with a lot of other mods too.\r<br />\r<br />\r<br />[u]UN[u]INSTALLATION[/u][/u]\r<br />\r<br />To remove this mod simply delete the file. As long as you aren&#39;t on the other side of the portal when you do this, your save will be 100% good every time. It&#39;s that simple.\r<br />\r<br />I know this for sure because between testings, instead of waiting a few days for the area to respawn, I simply removed the files, made a clean save, and re installed it. I did this a ton of times to test the quest stages and quest markers. They will run all over again from scratch if you do that.\r<br />[u]\r<br />[/u]\r<br />\r<br />\r<br />[img]http://i59.tinypic.com/154iro2.jpg[/img]\r<br />\r<br />[u]DIFFICULTY[/u]\r<br />I haven&#39;t found anything quite like this on NexusMods although I&#39;m sure something exists, feel free to discuss it here I&#39;d certainly be interested. I wanted it so I made it&#33; My level 120 character has maxed out every skill tree except block and heavy armor and she has beaten every quest in game plus a bunch of DLCs and mods. I attached a pic of her active effects. She&#39;s a beast.\r<br />\r<br />Y&#39;know how after you max out your character, it&#39;s hard to be challenged? You went through all the hard work of making your character invincible just to realize that there&#39;s no real challenges left to showcase your true might&#33; This mod is for YOU. Maybe you have a high level character that you stopped playing because you felt invincible. This mod will challenge you in ways you have never seen.[b] [/b]I guarantee you can&#39;t get through this mod without dying at least a few times assuming you aren&#39;t using god mode or way overpowered spells that don&#39;t belong in the game. That&#39;s a promise.\r<br />\r<br />[img]http://i57.tinypic.com/5v6vf5.jpg[/img]\r<br />\r<br />\r<br />Q[u]UEST BACKGROUND AND INFO\r<br />[/u]This quest starts via courier. Once you enter a town with the plugin installed you will be approached by a courier and the note will start up the quest and give you a quest marker. The portal also has its own fast travel marker. It is located at the Sleeping Tree Camp.\r<br />\r<br />The imperial legion discovered a large new land mass and built a new town but shortly afterward they found themselves under attack by all manner of dangerous adversaries. After suffering heavy losses, the imperial general decided to take another approach and contact the Dragonborn. Knowing that the Dragonborn has other priorities, the imperial general is offering the Dragonborn a massive reward in exchange for help: half of the town&#39;s treasury. Are you powerful enough to survive this challenge?\r<br />\r<br />You CANNOT bring followers on this quest. I didn&#39;t even try to fix that when I noticed it. I think its for the best. This is supposed to be a challenge and I don&#39;t want people hiding behind essential NPCs. Summoned mounts and summoned creatures are good substitutes. The legion and the general himself will give you a lot of help in the finale (and you&#39;re gonna need it).\r<br />\r<br />[u]THE WORLD[/u]\r<br />There are a lot of chests along the way and not all of them are out in the open.  Keep your eyes peeled and search your surroundings whenever you wipe out a hoard of enemies. Since this is designed for an end-game player, you will get significantly more loot than a normal quest and the final reward is quite large.\r<br />\r<br />Everything is in open world for now so there are zero loading screens. This brings some great immersion. If people show interest in more open area, a dungeon, or a couple of caves, I can certainly make them. For now I feel the size is perfect. It currently takes my level 120 character about 2 or 3 hours to run through the quest and clear all the locations. You won&#39;t be able to fast travel inside the portal, which is good because it makes things more challenging and adds immersion. Also, it prevents a player from claiming the final chest multiple times without fighting tooth and nail to get there. There are two portals that bring you back to the portal in Skyrim: one at the player home and one at the final chest.\r<br />\r<br />The challenges will get progressively harder as you get closer to your final goal and I have found that I need different approaches to succeed in different battles. One group might be more susceptible to archery or destruction magic while another group might be more susceptible to melee based on where they are in the world and how the fight plays out.\r<br />\r<br />The area will respawn, should be 5 days. If you want to reset the quest and quest markers for a second run, you can easily do so by: unistalling plugin, start game, save game, close game, install plugin, load save, fast travel to any town and your courier will be there waiting with the quest.\r<br />\r<br />[center]---------------------------------------------------------------------------------------------------------------------------------------[/center][center][/center]\r<br />\r<br />[u]COMPATIBILITY[/u]\r<br />[b]I[/b][b] ran through the quest a dozen times getting out any kinks. [/b][b]This mod is totally bug free and works great.[/b]\r<br />(with the single exception of a few giants that aren&#39;t behaving the way I want them to. If you know how to fix that please let me know. sometimes they do what I want them to and sometimes they don&#39;t)\r<br />\r<br />-This mod adds a new world out of Tamriel, so it shouldn&#39;t ever interfere with any mod that doesn&#39;t mess with the Sleeping Tree Camp or the courier. \r<br />-As of right now, no mods have been reported incompatible.\r<br />-You cannot bring followers to the new world. See quest background and info.\r<br />-I use a lot of mods already and my mod is compatible with all of them. See recommended mods.\r<br />\r<br />[u]Help&#33; My courier isn&#39;t showing up and/or my portal isn&#39;t working&#33;\r<br />[/u][u]\r<br />FIXED: You can use this console command to instantly travel through portal from anywhere: cow hell 0 0[/u]\r<br />\r<br />As of 1/17, 6 people have reported this out of 266 unique downloads. You can still play the mod but everything will not work in your game: the scripts did not install with the rest of the mod. \r<br />\r<br />The enemies and challenges will all still be there. The quest stages, including the courier, won&#39;t work and quest markers won&#39;t work. Luckily there is only one main path so stick to that and you will be set. The dialogue will work but my custom voicing won&#39;t be there, unfortunately (I say that because it came out better than I expected). Everything else will be as it should be. Enjoy&#33;\r<br />\r<br />Thanks UCastillo for the tip&#33; He recommended the center on world console command.\r<br />\r<br />I also uploaded a second file with new portals from a different creation kit. Out of the 6 that have reported this problem, only 1 person has reported the second file fixed the portal. [u]Recommend using console[/u], but to install: \r<br />go into your skyrim/data folder and delete the original 1myfirstmod.esp file. Download file version01B and install. \r<br />\r<br />\r<br />[center]---------------------------------------------------------------------------------------------------------------------------------------[/center]\r<br />\r<br />UNRELATED: RECOMMENDED SKYRIM MODS\r<br />\r<br />I use a lot of mods already and my mod is compatible with all of them. I have about 30, all compatible with each other, and I&#39;d recommend all of them. I found most of these mods through Brodual and I highly recommend their videos&#33; I&#39;ll list some of my fav mods real quick, all can be found on Nexus, and tag each one that I couldn&#39;t ever play the game without. Thanks to all these modders for making my gaming experience more amazing each and every day:\r<br />[i]\r<br />xp32 maximum skeleton, quality world map, adal matar, alternate start, apachiiskyhair, better thieves guild entrance (MUST&#33;), CHSBHC body physics, Falskaar, Guild Beta Starter (this is a bit bugged but can be awesome with practice), Gypsy Eyes Caravan, Helgen Reborn (amazing&#33;), JKs Skyrim (performance intensive), Kuertee simple multiple followers, loading screens, moonpath to elsweyr, player headtracking (MUST&#33;), pretty face, climates of tamriel (MUST&#33;), RaceMenu, realistic ragdolls, run for your lives, sabrecatmount, savegame manager, skse (must), skycomplete, skyrim immersive creatures (MUST&#33;), skyrim witchcraft and wizardry (fixes master spells but some spells are overpowered, don&#39;t ruin your game with this), skyui (must), the paarthurnax dilemma (MUST&#33;), unread books glow, water[/i]\r<br />\r<br />[center]---------------------------------------------------------------------------------------------------------------------------------------[/center][u]\r<br />THE CHALLENGE\r<br />[/u]\r<br />Now that I have confirmation that we have some people trying out the mod and getting killed (which is certainly to be expected), I am very excited to be made aware that someone has beaten the quest and/or cleared the continent of enemies. I was level 119 the first time I ran through all 15 locations... so no one under level 119 has ever beaten this quest as of right now. \r<br />\r<br />-If you post a screenshot showing you beat the quest, I will add you to the champion&#39;s list on this page&#33; \r<br />-The individual that provides proof of beating the quest with the lowest level character will be declared the ultimate champion.\r<br />\r<br />CHAMPION&#39;S LIST:\r<br />DDunne666 - He died roughly 20x but he finally beat it&#33; Even with the overpowered spells he has that aren&#39;t in the vanilla game, he said it was super hard. Congrats&#33; Now try it without those rigged spells :)\r<br />\r<br />\r<br />[center][/center][img]http://i61.tinypic.com/23lcu2b.jpg[/img]\r<br />\r<br />Notes: Post-Release Testing\r<br />- Camp with 6 Giants still don&#39;t do what they should be doing.\r<br />- When I summon Dremora to help me they are not doing what they should be doing. \r<br />- Summoned ranged creatures work best.\r<br />- Using storm call shout in the finale was incredibly awesome.\r<br />- Even though storm call targets everyone, including your allies, the general will not turn on you.\r<br />Notes: Post-2nd Mod Release\r<br />-Yeah, the Giants and Dremora weren&#39;t doing what they should be doing and we couldn&#39;t bring followers because I didn&#39;t quite understand Navmesh. Now I do and that shows in the 2nd mod. I wouldn&#39;t be hard to fix but since I depended on ranged enemies it&#39;s still awesome the way it is&#33; Might not be worth it for me.\r<br />-Using storm call shout in 2nd mod has similar awesome results&#33;\r<br />-Ddunne666 sending me pictures of his new follower the super powered immortal general rob from the dovahkiin&#39;s greatest challenge that&#39;s gotta be the best follower ever&#33; he&#39;s crazy strong\r<br />\r<br />[img]http://i59.tinypic.com/2n05wrb.jpg[/img]\r<br />\r<br />\r<br />\r<br />\r<br />How to make you own world:\r<br />This is basically a really easy tutorial on how to make a portal in the game, so if that&#39;s something you want to learn, here you go. \r<br />\r<br />Step 1: Create a plugin. Open Creation Kit. File, Data, double click &#34;skyrim&#34;. scroll down and double click your plugin. Click &#34;Set as active file.&#34;\r<br />Wait for it to load up everything, this will take a few seconds. Don&#39;t exit&#33;\r<br />Step 2: In the cell view window, click where it says &#34;interiors.&#34; go to &#34;Tamriel.&#34; You can type the letter &#34;t&#34; to find it fast. Find the place you want to create your portal and double click any of the options with that name.\r<br />Step 3: Open the object window if it isn&#39;t open and pick an activator (or a door). Right click that and duplicate it. Click on your new duplicate and drag to the render window. Plop your activator anywhere. If you want to resize it, hold &#34;s&#34; to resize.\r<br />Step 4: Go back to your cell view window. Click where it says &#34;tamriel&#34; and change it to your new area. Zoom in underwater and use the mouse to bring a patch of land to the surface. In object window under world objects, static, pick xheadingmarker. Drop it where you want to appear. It&#39;ll be a little red see through box. You will need this in a moment.\r<br />Step 5: In your object window, click your duplicated activator and where it says scripts, click add script.\r<br />Step 6: Ready to write a script? well you don&#39;t have to. you&#39;re gonna use a default script. type gotoscript and select it. You don&#39;t have to put anything in the initial value. Click okay, than in the scripts section click properties. Click the only property there, click edit value. Click select in render window and double click that red box I was talking about in the render window.\r<br />Step 7: Right click your gotoscript and click edit source. Click file, than save. It will say compilation successful or failed.\r<br />Step 8: Did I do this right?\r<br />\r<br />If it failed: you did something wrong. I know that can be a bit disheartening but please keep in mind this is a very sensitive process and, like any formula, everything must be perfect to end in the correct result. Please check your work.\r<br />If it succeeded: You did everything right&#33; Awesome&#33; Go through your new portal. \r<br />As for getting home, you could do the same thing for the return portal or you could just use the console to get back to Skyrim.",
  "categoryId": "30",
  "version": "Version01",
  "author": "Rdunne86",
  "createdUnix": "1421197330",
  "updatedUnix": "1422241224",
  "containsAdultContent": true,
  "uploadedBy": "rdunne86",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142757",
      "name": "New Lands Challenge",
      "version": "Version01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "287",
      "fileName": "New Lands Challenge-61669-Version01.rar",
      "uploadedUnix": "1421197452",
      "modVersion": "Version01",
      "virusScanUrl": "https://www.virustotal.com/file/1502d13893f785f1c1f6eebfa0a8dc992741a76c495040b8858aec9f4a2f2da1/analysis/1421197503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Lands%20Challenge-61669-Version01.rar?fid=1000142757&ttl=1535850150&ri=8192&rs=8192&setec=33838d6ce1f6341e96370f16f0a96f7e"
    },
    {
      "fileId": "1000143016",
      "name": "Version01B SEE COMPATIBILITY",
      "version": "Version01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "287",
      "fileName": "Version01B SEE COMPATIBILITY-61669-Version01.rar",
      "uploadedUnix": "1421353587",
      "modVersion": "Version01",
      "virusScanUrl": "https://www.virustotal.com/file/8dd65510445867289458610a5bcab30c1d3afe8084ededf37c652b0809e683a3/analysis/1421353623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version01B%20SEE%20COMPATIBILITY-61669-Version01.rar?fid=1000143016&ttl=1535850151&ri=8192&rs=8192&setec=d99a6dd2366ff2956b69865cca8d9dd7"
    },
    {
      "fileId": "1000144620",
      "name": "New Lands Challenge 1 - EXTREME VERSION",
      "version": "Version02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23655",
      "fileName": "New Lands Challenge 1 - EXTREME VERSION-61669-Version02.rar",
      "uploadedUnix": "1422241224",
      "modVersion": "Version02",
      "virusScanUrl": "https://www.virustotal.com/file/1fb73c53f8cf9986878216be952b77dd3ef8c2c062cf6570777bcb51dc2e3dbc/analysis/1422241332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Lands%20Challenge%201%20-%20EXTREME%20VERSION-61669-Version02.rar?fid=1000144620&ttl=1535850151&ri=8192&rs=8192&setec=e6c6aa7c3cd771eadeac89ad5a1e5eec"
    }
  ]
}