{
  "modId": 61677.0,
  "modName": "True Spellbreaker Ward",
  "summary": "A small mod that changes the Spellbreaker shield&#39;s ward effect into the effect for the ward spell.",
  "descriptionHtml": "This mod is my first attempt at using the creation kit and as such there may be bugs and errors that I don&#39;t know of with this mod. If you find any feel free to let me know and I&#39;ll do my best with my limited knowledge to correct them.\r<br />\r<br />This is a small mod that changes the half done ward animation for the Spellbreaker shield artifact into a full ward animation like you would get from the Lesser Ward spell. I didn&#39;t like the effect of the regular Spellbreaker effect as it was just wavy air in front of me and seemed underwhelming for a Daedric Artifact. I hope you like this mod.\r<br />\r<br />Please note that this mod will only work if you have not gotten the spell breaker yet as I don&#39;t believe it will modify existing shields. So either use this on a character that has yet to get Spellbreaker or use the console to get a new one\r<br />\r<br />Compatibility:\r<br />This mod should be compatible with just about any other mod except for those that modify the spellbreaker enchant. Unfortunately this means that it is not compatible with artifact disenchanting mods.",
  "categoryId": "75",
  "version": "1.0",
  "author": "RavenCurow",
  "createdUnix": "1421211584",
  "updatedUnix": "1421211580",
  "containsAdultContent": false,
  "uploadedBy": "ravencurow",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142778",
      "name": "TrueSpellbreaker",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "TrueSpellbreaker-61677-1-0.zip",
      "uploadedUnix": "1421211580",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/45555e687f52055e75e871502237ec171724a4e431001c01bb4feb904aa82aee/analysis/1421211603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TrueSpellbreaker-61677-1-0.zip?fid=1000142778&ttl=1535850165&ri=8192&rs=8192&setec=3592c8e24b1502b8ce8bccb9d3378dfe"
    }
  ]
}