{
  "modId": 61681.0,
  "modName": "Scripts for the lazy Dovahkiin",
  "summary": "Just two scripts that makes tgm and harvesting pointless",
  "descriptionHtml": "So, you have played countless lives of the dovahkiin and want the game looks like a candy shop (not actual candy featured)?\r<br />Are you searching the console commands to make all your stats go 100 but too lazy to input?\r<br />Want to become the greatest alchemist of Skyrim but too lazy to harvest materials?\r<br />Then this, my dovahfriend, is the mod for you&#33;\r<br />\r<br />Jokes aside, this &#34;mod&#34; contains two simple *.txt files, one that gives you 100 on each stat, level 100 for the player and almost infinite stamina/magicka/health and the other gives you 1000 ingredients (meaning that you will have 1000 pieces of EACH ingredient). This is my first mod attempt (no creation kit was harmed to pull this out&#33;) and a fancy way to slay your enemies if you want a vacation on the land of dreams (a.k.a. Skyrim).\r<br />As you can guess same result can be obtained with console commands, so this is aimed for people like me who are not in the mood for picking stuff but wants to kill dragons with just a glance (no actual killing glance featured kids).\r<br />\r<br />How to put this to work?\r<br />Just drop in your Skyrim directory (no NMM required). Then on the console (yup, in the game) type bat save_me or bat allingredientsx1000 (and yes, with a space between bat and the name) and you will be blessed with almost infinite power&#33; (remember, just in the game, no actual powers will be granted IRL).\r<br />\r<br />Thanks to all the real modders for making Skyrim the greatest game of all times (deal with it *insert other franchise name here* fanboys), without you guys Whiterun would still have Heimskr as the only source for fun",
  "categoryId": "40",
  "version": "1",
  "author": "Haelrc",
  "createdUnix": "1421225154",
  "updatedUnix": "1421225019",
  "containsAdultContent": false,
  "uploadedBy": "Haelrc",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142793",
      "name": "Almost absolute power",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Almost absolute power-61681-1.rar",
      "uploadedUnix": "1421225019",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fc221e6f4d9c1755b59d5292c03b9cebf6d5f97c0eec631063f1b7523739e1bb/analysis/1421225042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Almost%20absolute%20power-61681-1.rar?fid=1000142793&ttl=1535850171&ri=8192&rs=8192&setec=2be06cb67c709ccb3eaf8585fe1478e7"
    }
  ]
}