{
  "modId": 61690.0,
  "modName": "SOS Schlongs Of Skyrim",
  "summary": "",
  "descriptionHtml": "########## v2.05.034 ###########\r<br />- Added translation for German (thanks GornGrimm and Mister-X)\r<br />- Updated the included PapyrusUtil from v23 to v26, which means that SKSE 1.7.1 is now required\r<br />########## v2.05.033 ###########\r<br />- Added translation for French (thanks forceet24)\r<br />- Debug spell is now integrated in MCM - SOS - Player / NPC settings.\r<br />- MCM menu: Schlong resizing for PC will be disabled if the &#34;SOS - Racemenu Plugin&#34; mod is found. Previously you could change size, but it had no effect\r<br />- Fixed a underwear-clips-through-armor issue for NPCs wearing custom armor, when seeing them for the first time. It also affected enchanted variants of vanilla armors\r<br />- Added more info to the debug spell output, and fixed a bug with it\r<br />########## v2.05.032 ###########\r<br />- Added translation for Russian (thanks Huili)\r<br />- Updated the included PapyrusUtil from v22 to v23\r<br />########## v2.05.031 ###########\r<br />- Added translations for Japanese, Italian and Spanish (thanks Shiene and Tiranno_71)\r<br />- Added new SKSE plugin (SchlongsOfSkyrim.dll) that schlongifies vanilla armors (and DLC armors if found)\r<br />- Removed all vanilla armor edits from the main esp file as they are no longer necessary (note the biped slot 52 is still in use)\r<br />- Removed the optional DLC esp&#39;s from the installer as they are no longer necessary\r<br />- Fixed a bug since v2.05.027 where slot 52 items would not stay equipped\r<br />- Fixed a bug since v2.05.030 where NPCs whose armor was made revealing through MCM had no schlong when you meet them again after changing zone\r<br />########## v2.05.030 ###########\r<br />- MCM menu has been localized. Currently all language files are in English until someone translates them.\r<br />- Fixed a minor underwear issue when loading a save just after installing revealing gear. The actors that were wearing normal armors, that after the install became revealing, were not showing their schlong up automatically.\r<br />########## v2.05.029 ###########\r<br />- NPC werewolves will no longer equip an invisible pair of trousers. These trousers had a 50% chance of appearing, and were preventing the schlong from showing up.\r<br />- Fixed a permaunderwear issue since version 2.05.017 caused by rare events such as running the resurrect console command on the PC.\r<br />########## v2.05.028 ###########\r<br />- The archive was missing two folders corresponding to the DLC armor patches\r<br />########## v2.05.027 ###########\r<br />- The DLC armor patches have been added to the installer as optional selections.\r<br />- Fixed a bug where disabling the SOS potions through MCM was not working properly.\r<br />- Fixed a bug while using a revealing armor where unequipping an armor piece (other the sos underwear) from the slot 52 would cause the schlong not show up.\r<br />########## v2.05.026-BETA ###########\r<br />- Now SOS is able to recover itself from any problem with the stored data in the SKSE co-save.\r<br />- Better warnings in case of missing requirements or savegame issues.\r<br />########## v2.05.025-BETA ###########\r<br />- Compatibility added with SexLab. The PC schlong was not displayed upon being equipped after SL&#39;s strip, if SL&#39;s auto free camera setting was on\r<br />- Fixed an issue with customized revealing armor where the characters would not reschlongify due to conflicts with other mods or quests. Basically, I&#39;ve changed the way SOS detects if any actor is mounted on a cart.\r<br />- Fixed an issue where followers would not reschlongify upon loading an saved game automatically made after a zone change\r<br />########## v2.05.024-BETA ###########\r<br />- PapyrusUtil has been included in the archive. This is to make sure the SKSE plugin is installed at all times, otherwise SOS would loose its stored data (schlongs, menus, etc)\r<br />########## v2.05.023-BETA ###########\r<br />- New MCM option in &#34;General Settings&#34; to stop falmers and dragons from dropping SOS size potions\r<br />- SOS Shop has been added to the Wrye Bash installer\r<br />########## v2.05.022-BETA ###########\r<br />- New MCM option in &#34;Player / NPC Settings&#34; to set up armor as revealing or concealing\r<br />########## v2.05.021-BETA ###########\r<br />- Textures have been converted / optimized: A8R8G8B8 -&gt; DXT5 and R8G8B8 -&gt; DXT1. All textures except body normal maps.\r<br />- Schlong shape potions are no longer usable. You can change schlongs with the MCM submenu &#34;Player / NPC Settings&#34;\r<br />- SOS Shop has been added to the installer\r<br />- Fixed Bjorn LongSword&#39;s gray face bug from previous update\r<br />########## v2.05.020-BETA ###########\r<br />- Removed the Morning Wood content (the SOS shop) from the main esp file\r<br />- Added a new optional file to the downloads section: SOS - Shop\r<br />- Fixed a bug since 2.05.016 where some races like vampires and dremoras were not being schlongified\r<br />########## v2.05.019-BETA ###########\r<br />- Fixed a bug since 2.04.001 where disabling the schlong for the Werewolf Beast race was not working in some circumstances\r<br />- Fixed a bug since 2.05.017 where player or NPCs were not getting a new schlong after losing it\r<br />- Fixed a bug where upgrading to version 2.05.017 or 018 from any version &lt; 2.05.009 was causing player&#39;s schlong not properly scale after game load\r<br />########## v2.05.018-BETA ###########\r<br />- Fixed a minor bug when swapping schlongs via MCM where they weren&#39;t scaling properly\r<br />########## v2.05.017-BETA ###########\r<br />- SOS spells are no longer restarted on player after each game load or zone change\r<br />########## v2.05.016-BETA ###########\r<br />- Changed the way the SOS scripts are spreaded among the NPCs.\r<br />- Schlong shape potions no longer serve to schlongify custom race / followers. Use instead the new MCM page &#34;Player / NPC settings&#34;.\r<br />########## v2.05.015-BETA ###########\r<br />- New MCM page: Player / NPC settings\r<br />########## v2.05.014-BETA ###########\r<br />- Fixed a bug since v2.05.009-BETA that was producing error messages in the Papyrus log\r<br />########## v2.05.013-BETA ###########\r<br />- Fixed a bug since v2.05.009-BETA where NPCs would get permaunderwear while using revealing armor\r<br />- Added changes from v2.04.012 into beta (the armors edits done in the Unofficial Skyrim Patch)\r<br />########## v2.05.012-BETA ###########\r<br />- Added changes from v2.04.011 into beta\r<br />########## v2.05.011-BETA ###########\r<br />- As it is configurable in MCM, the max schlong size setting now remains at 10 when upgrading from non-beta versions. The current value in existing savegames won&#39;t be changed.\r<br />- Fixed a clipping underwear bug introduced in 2.05.009\r<br />- Fixed a bug in the migration process where installing beta versions 2.05.009 or 2.05.011 over any non-beta version (&lt; 2.05.001) was producing permaunderwear on all new encountered NPCs.\r<br />- Fixed a bug where using dragon essence potions on NPCs through the dialogue option was not working beyond rank 10 until you changed the max schlong size in MCM\r<br />########## v2.05.010-BETA ###########\r<br />- Added new MCM option &#34;Max schlong size&#34;. From 1 to 20, default 10.\r<br />- Fixed a bug where using dragon essence potions on NPCs through the dialogue option was not working beyond rank 10.\r<br />########## v2.05.009-BETA ###########\r<br />- Changes in reschlongification\r<br />- Added SKSE version check\r<br />- Added changes from v2.04.011 into beta\r<br />########## v2.05.008-BETA ###########\r<br />- Added changes from v2.04.010 into beta\r<br />########## v2.05.007-BETA ###########\r<br />- Added changes from v2.04.009 into beta\r<br />########## v2.05.006-BETA ###########\r<br />- Removed the Schlong addon lock mechanism because it is not necessary with StorageUtil. This makes new installed schlong load faster\r<br />- Added changes from v2.04.008 into beta\r<br />########## v2.05.005-BETA ###########\r<br />- Schlong addons can now be uninstalled safely without using the &#34;Remove&#34; schlong MCM option. The actors who lost his schlong will get a new one during the reschlongification process, right after loading the savegame.\r<br />########## v2.05.004-BETA ###########\r<br />- Added changes from v2.04.007 into beta\r<br />########## v2.05.003-BETA ###########\r<br />- Added changes from v2.04.006 into beta\r<br />########## v2.05.002-BETA ###########\r<br />- fixed an error in the migration process which caused weird schlong shapes, more noticeable at bigger sizes (you can fix them with MCM Restart SOS option)\r<br />- added the max schlong rank 20 to the migration process\r<br />- fixed the issue where dragon potions didn&#39;t work past rank 10\r<br />- added PapyrusUtil version check\r<br />- added missing schlong plugin check\r<br />########## v2.05.001-BETA ###########\r<br />- StorageUtil migration\r<br />########## v2.04.013 ###########\r<br />- Compatibility added with SexLab. The PC schlong was not displayed upon being equipped after SL&#39;s strip, if SL&#39;s auto free camera setting was on\r<br />- Fixed an issue with customized revealing armor where the characters would not reschlongify due to conflicts with other mods or quests. Basically, I&#39;ve changed the way SOS detects if any actor is mounted on a cart.\r<br />- Fixed an issue where followers would not reschlongify upon loading a saved game automatically made after a zone change\r<br />########## v2.04.012 ###########\r<br />- New MCM page: Player / NPC settings to change schlong size or type, and toggle equipped armor as revealing or concealing\r<br />- New MCM option: General Settings / Max schlong size. From 1 to 20, default 10\r<br />- New MCM option: General Settings / SOS Potions, to stop falmers and dragons from dropping SOS size potions\r<br />- The Morning Wood content (SOS shop) is now optional and has its own esp file. It has been added to the installer\r<br />- Schlong shape potions are no longer usable. You can change schlongs in the MCM submenu &#34;Player / NPC Settings&#34;\r<br />- Added changes from Unofficial Skyrim Patch\r<br />- Changes in reschlongification and the way SOS spreads schlongs among the NPCs\r<br />- Textures have been converted / optimized: A8R8G8B8 -&gt; DXT5 and R8G8B8 -&gt; DXT1. All textures except body normal maps\r<br />- Added SKSE version check\r<br />- Fixed a bug since 2.04.001 where disabling in MCM the schlong for the Werewolf Beast race was not working\r<br />########## v2.04.011 ###########\r<br />- New option in MCM menu for cleaning all schlongified, non-vanilla armors\r<br />- Fixed a bug where the body textures were not showing correctly while using armors\r<br />########## v2.04.010 ###########\r<br />- Fixed a bug where actors from leveled lists would not schlongify properly\r<br />- New option in MCM menu for hiding the SOS messages in the top-left corner of the screen\r<br />########## v2.04.009 ###########\r<br />- Fixed a rare bug where starting a new game with the &#34;Live Another Life&#34; would cause SOS not load properly\r<br />- Fixed a warning message in the MCM menu\r<br />########## v2.04.008 ###########\r<br />- Fixed an issue where uninstalling a schlong addon not using the &#34;Remove&#34; MCM option would give permaunderwear to some NPCs. Those who lost his schlong will get a new one during the reschlongification process, right after loading the savegame\r<br />- Fixed some issues where doing a clean save not using the &#34;Remove SOS&#34; MCM option would cause permaunderwear issues for the player or nearby NPCs due to the remainder scripts, baked in your savegame from the previous SOS installation\r<br />- Fixed some bugs where changing race or gender through the racemenu interface would cause temporary or permanent underwear issues\r<br />########## v2.04.007 ###########\r<br />- Added &#34;Remove SOS&#34; option in MCM SOS main menu for safe uninstall or reinstall\r<br />- Fixed a bug where a schlong shape potion on an already schlonged actor wasn&#39;t properly cleaning the old schlong\r<br />- Fixed some issues with the &#34;Restart SOS&#34; MCM option\r<br />########## v2.04.006 ###########\r<br />- Cleaning / Removing a schlong addon will remove the schlong item from player and NPCs\r<br />- Player and nearby NPCs will automagically get a new schlong after Cleaning / Removing a schlong, if they are eligible for that\r<br />- More info added to the debug spell message\r<br />- Fixed a bug where using a schlong shape potion might not properly schlongify the actor\r<br />- Fixed a bug where using a schlong shape potion would show up a wrong warning message\r<br />- Fixed a &#34;was trolled&#34; issue when drinking schlong shape potions under some conditions\r<br />- Minor script optimizations\r<br />########## v2.04.005 ###########\r<br />- &#34;Restart SOS&#34; MCM option now does a complete restart. It should fix all script issues\r<br />- Fixed a bug where followers eventually lose their schlong size\r<br />- Fixed a bug where SOS scripts would not run after loading a savegame\r<br />- Fixed a bug where the &#34;Restart SOS&#34; and &#34;Clean&#34; MCM functions would not work properly under certain conditions\r<br />########## v2.04.004 ###########\r<br />- Fixed a bug where starting a new game with the &#34;Live Another Life&#34; mod was spreading only small schlongs\r<br />########## v2.04.003 ###########\r<br />- Added compatibility with Alternate Start - Live Another Life\r<br />- Fixed a bug where new encountered NPCs might be marked as schlongless just after loading an autosave\r<br />- Removed the &#34;Run once&#34; flag from SOS quests. This should make it easier fixing SOS issues like when the schlongification process stops or the MCM menus get lost. \r<br />- Added &#34;Restart SOS&#34; option in MCM SOS main menu. It won&#39;t appear in existing savegames, need to start a new game\r<br />########## v2.04.002 ###########\r<br />- Transforming into Werewolf using the setrace command now re-scales the schlong\r<br />- Fixed a bug introduced in 2.04.001 that spread schlongs when they have zero % chance in the MCM settings\r<br />- Removed a warning from the log files when drinking an Essence of Dragon potion\r<br />########## v2.04.001 ###########\r<br />- Added support for Werewolf Beast race (requires Mighty Beasts - Werewolf)\r<br />- Bending keys: Added the flaccid state at the bottom position\r<br />- Fixed a bug where bending keys were not working just after a new game or when SOS runs for the first time\r<br />- Fixed an issue where changing the key bindings in the MCM menu was not working\r<br />- Fixed an issue with leftover scripts that lead to a wrong message when picking up any potion\r<br />########## v2.03.015 ###########\r<br />- Changed the way the bending keys work. Now can be used at any time, there is no need to cast the erection spell to be able to use them.\r<br />- &#34;Hey stud&#34; dialog off by default, it can be enabled via MCM. Current savegames won&#39;t be affected\r<br />- Small script optimizations\r<br />########## v2.03.014 ###########\r<br />- Partially fixed the &#34;Slot 52 issue&#34;\r<br />- Added more races to be ignored by the schlongification process such as cow, hare, horse, etc\r<br />- Added support for SOS racemenu plugin\r<br />- Added support for multi-gender addons\r<br />- Small script optimizations\r<br />- Added Brawl Bugs Patch as a requirement\r<br />########## v2.03.013 ###########\r<br />- Really removed SexLab interoperability because now is SexLab who interacts with SOS\r<br />########## v2.03.012 ###########\r<br />- Added new havok assets that VectorPlexus made some time ago. They provide support for the female SOS addons, and vampire lord and werewolf beast races (though there are no SOS meshes yet for these)\r<br />- The new havok assets should permit a better SexLab integration. I didn&#39;t test it yet though\r<br />- Removed SexLab interoperability because now is SexLab who interacts with SOS\r<br />- Released script source files\r<br />########## v2.03.011 ###########\r<br />- fix the Shape Potion to work on UnSchlongified actors (AKA Custom Race Compatibility)\r<br />########## v2.03.010b ##########\r<br />- Fixed most leveled actors incorrectly getting no compatible schlong determined.\r<br />- Performance & resource optimization on schlong determinations and reschlongification.\r<br />- Increased Slider booster max range to 300%.\r<br />- Male Body textures now include the anus (thanks to T3alrose, original layer by AlienSlof, for Oblivion).\r<br />- Underwear now includes world model (Thanks to Earrindo).\r<br />- Debug spells added for both PC and NPCs, that retrieve info on the targeted Actor to better diagnose issues. Disabled by default, can be enabled via MCM.\r<br />- Fixed flying cart in intro sequence.\r<br />- Retweaked Regular and Muscular SubShapes.\r<br />- All Addons were modified (older versions no longer work). They also have now a new Keyword on Genital Armors to enable better integration with future SexLab releases.\r<br />- Shape Potions can now to manually assign shapes to Custom Races. Proper assets (Skeleton/meshes/textures) are still required.\r<br />- Fixed Infinite potion use (Dragon/Falmer) when used via dialogue.\r<br />- Fixed the NPCs erection duration. Erection spells now have an hit effect to better perceive in which actor it was casted on.\r<br />########## v2.03.009b ##########\r<br />- Temporarily removed the edit on ArmorAstrid to see if it fixes the odd bug that some ppl are complaining about (females sometimes displaying Astrid&#39;s burned body texture).\r<br />- Removed the SOS_AmuletArmor. Added option to disable schlong spreading (amulet replacement).\r<br />- NMM Installer fix (thanks to Belisariu).\r<br />- Wrye Bash/BAIN installer by Alchmo.\r<br />- Revision to NMM installer to install and activate all modules in the correct order.\r<br />- Hopefully fixed horse flying bug, with the drawback of potentially having clipping underwear for riders.\r<br />- Shape switching potions now reset the schlong scale to reflect the new subshape and corrected the bug that prevented Normal/Concealing Body armors/clothes to be equipped.\r<br />- Fixed NiNode update that was being skipped when an armor was already registered as concealing which might led to clipping underwear.\r<br />- Added compatibility check after race switch.\r<br />- Fixed Average addon specular map.\r<br />- Erection spell fixed so it only now displays one effect on the SkyUI HUD, instead of nine.\r<br />- Tweaked Erection, Erection Exaustion and Distilled Mandrake durations.\r<br />- Added Targeted Erection Spell.\r<br />- Potion names renamed (Thanks for Setekh&#39;s Suggestions). Essence of the Dragon, Essence of the Falmer. Also added Essence of the Troll.\r<br />- Fixed drop rates. Were set by mistake to 25% instead of the intended 75%.\r<br />- Several tweaks and improvements to the code, reduced some overly verbose trace logging.\r<br />- Slightly rearranged MCM options on General Settings page.\r<br />- Added MCM option to add/remove the erection spells.\r<br />- Added MCM option to boost or shrink the maximum size of all schlong addons. The default maximum schlong sizes of the addons were tweaked to be somewhat within realistic limits as inspired by FelioCusland.\r<br />- Added MCM option to set dialog preferences off/campy with campy as default.\r<br />########## v2.03.008b ##########\r<br />- SexLab interoperability: should now work more like intended.\r<br />########## v2.03.007b ##########\r<br />- Initial public Release on The Nexus.\r<br />",
  "categoryId": "84",
  "version": "V.1",
  "author": "Vector Plexus",
  "createdUnix": "1421251892",
  "updatedUnix": "1421251892",
  "containsAdultContent": false,
  "uploadedBy": "AlexanderGamer",
  "primaryFile": null,
  "files": []
}