{
  "modId": 61715.0,
  "modName": "Helgen Reborn - German",
  "summary": "Die Deutsche version von Helgen Reborn.",
  "descriptionHtml": "[center]Dies ist die Deutsche Übersetzung zu Helgen Reborn.\r<br />Es ist eigentlich nur ein Update zur [url=http://www.nexusmods.com/skyrim/mods/37057]Version von Stefanu.[/url]\r<br />Eigentlich war geplant das nachdem ich die Übersetzung getestet habe Stefanu sie auf seiner Modpage updated.\r<br />Leider war er nicht lange bevor ich ihm die Mod geschickt hatte Inaktiv geworden, und seitdem nicht mehr auf Nexus.(12.10.2014)\r<br />Deshalb habe ich beschlossen hier das Update zu Posten, und es wieder zu entfernen wenn mir Stefanu wieder antwortet.\r<br />Die beschreibung habe ich von seiner Modpage Kopiert.\r<br />Über 95% der Übersetzung von 105.3 wurde von Stefanu Übersetzt.\r<br />Falls es euch gefällt lasst ein Endorsement bei Stefanu und Mike Hancho da. :)[/center]\r<br />\r<br />[left]Diese umfangreiche Mod erlaubt euch, Helgen nach dem Drachenangriff wieder aufzubauen. Ihr führt zwei alte Freunde zusammen, ihr könnt \r<br />Wachen ausbilden, ihr müsst verschiedene Missionen mit Begleitern \r<br />erledigen, ihr habt es mit gefährlichen Bösewichtern und weniger \r<br />gefährlichen, aber eindringlich dargestellten Charakteren zu tun. \r<br />Verbündet Euch mit einer Fraktion oder bewahrt Helgens Unabhängigkeit - \r<br />es liegt an euch. Viel Spaß&#33;\r<br />Es handelt sich nur um die übersetzte esp&#33; Die Originalmodifikation von Mike Hancho wird benötigt. Ihr findet sie hier:\r<br />http://skyrim.nexusmods.com/mods/35841/?tab=2&navtag=%2Fajax%2Fmodfiles%2F%3Fid%3D35841&pUp=1\r<br />Und nicht vergessen: Wenn euch die Mod gefällt, dann gebt Mike Hancho ein \r<br />Endorsement&#33; (Mir könnt ihr natürlich auch eins geben, aber erst in \r<br />zweiter Linie...)\r<br />Auszug aus Mike Hanchos Readme:\r<br />\r<br />EINLEITUNG\r<br />Der Autor, der für Fallout-New Vegas die drittbeliebteste Questmod \r<br />überhaupt geliefert hat, tritt mit seinem bislang ehrgeizigsten Projekt \r<br />an&#33; Helgen Reborn ist schlichtweg DIE Questmod für den Wiederaufbau \r<br />Helgens&#33; Erfahrt von den legendären Wächtern von Hattu, indem ihr zwei \r<br />alte Soldaten wieder zusammenführt und lasst euch in eine seit zwei \r<br />Jahrzehnten andauernde Fehde mit einem skrupellosen und mächtigen \r<br />Justiziar der Aldmeri-Dominion entführen&#33; Rekrutiert und trainiert eure \r<br />eigene Stadtwache oder bittet das Kaiserreich bzw. die Sturmmäntel um \r<br />Hilfe. Angefangen bei der Aufdeckung eines Sklavenhändlerrings bis zu \r<br />aufregenden Kämpfen in einer neuen geheimen Arena erwarten euch viele \r<br />weitere Abenteuer, während die Arbeiter nach und nach die Stadt wieder \r<br />aufbauen&#33; Ihr werdet mit einem eigenen Wohnturm belohnt, der den \r<br />offensten und dynamischten Ausstellungsraum in ganz Himmelsrand bietet&#33;\r<br />\r<br />Wenn euch andere Mods von Mike Hancho gefallen haben, wird Helgen Reborn \r<br />euch begeistern, denn es ist mein bislang umfangreichstes Projekt und es\r<br /> wurde beinahe ein ganzes Jahr lang daran gearbeitet&#33; Und \r<br />selbstverständlich legt Helgen Reborn den selben Qualitätsmaßstab an, \r<br />den ihr von einem Projekt Mike Hanchos zu recht erwartet&#33;\r<br />\r<br />ÜBERSICHT\r<br />    komplett vertont durch 20 der besten Sprecher der Community\r<br />    locker 4 bis 6 Stunden Spielzeit\r<br />    drei neue Rüstungssets\r<br />    Mike Hanchos akribischer Sinn für Details\r<br />    eindringliche Geschichte und Charaktere\r<br />    ein interaktiver Ausstellungsraum, der sich mit dem Spielverlauf verändert\r<br />    eine RIESIGE Höhle, um darin ausgestopfte Kreaturen auszustellen\r<br />    verwandelt Helgen vollständig in ein lebendiges Gemeinwesen\r<br />    viele Bündnismöglichkeiten für die Stadt (Unabhängigkeit, Sturmmäntel oder Kaiserliche)[/left]\r<br />Zur Originalmod geht es hier:\r<br />http://skyrim.nexusmods.com/mods/35841/?         ",
  "categoryId": "35",
  "version": "105.3",
  "author": "Mike Hancho - DV von Stefanu and Chefchen",
  "createdUnix": "1421335778",
  "updatedUnix": "1421335235",
  "containsAdultContent": false,
  "uploadedBy": "Chefchen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000142979",
      "name": "Helgen Reborn German",
      "version": "105.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "166699",
      "fileName": "Helgen Reborn German-61715-105-3.7z",
      "uploadedUnix": "1421335235",
      "modVersion": "105.3",
      "virusScanUrl": "https://www.virustotal.com/file/48497b42835c53b29e991ca86daab2c4f225d03585eebb0bc11df97fbe5aa794/analysis/1421335286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helgen%20Reborn%20German-61715-105-3.7z?fid=1000142979&ttl=1535850205&ri=8192&rs=8192&setec=47189aa2bd6c0e2ba689d6ce165b2c88"
    }
  ]
}