{
  "modId": 61744.0,
  "modName": "Character Creation - Rannveig for RaceMenu",
  "summary": "Nord preset for RaceMenu including backgroundstory and character development.",
  "descriptionHtml": "[center][img]http://fs1.directupload.net/images/150116/wc2eouxm.png[/img][/center]\r<br />\r<br />\r<br />[font=Georgia]This mod contains a facepreset for RaceMenu and much more.\r<br />Sometimes when creating a new character, may it be for playing, as a follower or just for a story, you need some ideas and inspirations – this little mod may help you to create something new. Of course you can change her face, backstory and everything else how ever you like. I would love to see your screenshots if you use her, so please load them up &#33;\r<br />\r<br />English is not my native language, so please excuse my grammatical mistakes. \r<br />\r<br />\r<br />\r<br />[b][center][size=5]Lore[/size][/center][/b]\r<br />Rannveig was born and raised in Helgen. Her father was a Stormcloak and like him and many others she always believed in Talos and native practices. She never really had any contact to those suspicious Elfs and the only foreign people she got to know where the Imperials. \r<br />Living in a small town she was a wild and free child, who spend her time exploring the woods or helping her parents. She was always her fathers daughter and he teached her how to defend herself, so that she became a passable swordfighter. Of course she was lacking the strenght of men, but she was brave and clever and one should not take her lightly. \r<br />\r<br />When Rannveig grew older she fell in love with her childhood friend Jarn, a glassmaker. Even if she loved an trusted him after all the years they spent together, she was avoiding marriage. She wasn`t feeling ready to settle down and give birth to children. In fact, she wanted more from her life and had always been dreaming of adventures and gaining honer. Beeing a companion was her secret dream, but she couldn`t leave her family and friends behind, even if she became more and more restless.\r<br />\r<br />The young woman that she is now knows that you have to be careful what you wish for. Rannveig is free to go where ever she wants and to do whatever she wants. But the price she paid for her freedom was much to high. When the dragon attacked Helgen, Rannveig was staying in Riverwood to buy some corn, that her mother wanted to plant. She saw the dragon and the smoke that was curling into the sky, even she couldn`t believe her eyes. Heading back to Helgen as fast as she could, she found only smolding ruins and dead bodys of the people she had known since she was born. \r<br />\r<br />\r<br />\r<br />[b][center][size=5]Character[/size][/center][/b]\r<br />The young Nord is a proud and honest woman. She tries hard not to show how much the loss of her family and friends hurt her, but can`t forget the pictures of her burning hometown. It seems, as if they had been burned into her eyes. Hunted by nightmares and bad memories she holds on to the things she knows, that seem familiar. It`s no suprise that she cultivated a dislike against all Elfs and Imperials. Rannveig is a little aimless, no that she has lost everything and even her dream of beeing a  companion seems to lose it`s appeal. \r<br />She would love to have someone by her side, someone who has a clear goal of what he or she wants to do with his life. On the other hand, it`s very hard for her to let people get closer. Of course she has ever known, that people die, sometimes even in very young years. But after her loss she fears to lose someone again, as much as she hates to be alone. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[b][center][size=5]Installation & Requirements[/size][/center][/b]\r<br />\r<br />Just download the file and put the preset into the preset folder of your RaceMenu. Wich is also the only requirement for this mod. \r<br />\r<br />\r<br />\r<br />[b][center][size=5]Mods used[/size][/center][/b]\r<br />\r<br />You only need them, if you want to make her look exactly as in my screenshots. Every other hair / skin / eyes mod works too. \r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/30411/?]Brows[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/2812/?]Better Females[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/6709/?]UNP Body[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/52841/?]FreckleMania[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/13722/?]Eyes of beauty[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/20483/?]Women of Skyrim[/url]\r<br />KS Hairdos – not on Nexus[/font]\r<br />\r<br />\r<br />[center]\r<br />[b]*Anyone is welcome to use this morph to make a follower mod  - please contact me, if interested*[/b][/center]",
  "categoryId": "26",
  "version": "1.0",
  "author": "Neladrie",
  "createdUnix": "1421417485",
  "updatedUnix": "1421416864",
  "containsAdultContent": false,
  "uploadedBy": "Neladrie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143107",
      "name": "Rannveig",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Rannveig-61744-1-0.rar",
      "uploadedUnix": "1421416864",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/13ed5ef29c59c7889ca298a69accdf242c816ef5964f6c43ee2a46923c874a1b/analysis/1421416922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rannveig-61744-1-0.rar?fid=1000143107&ttl=1535850259&ri=8192&rs=8192&setec=8bf67577bd770e47429fd1b22e6bcc98"
    }
  ]
}