{
  "modId": 61740.0,
  "modName": "Corpse Preparation Hate Quest Removed",
  "summary": "Main mod required - Removes the hate quest where NPCs refuse to talk to you for necromancy",
  "descriptionHtml": "First, go here and get this amazing mod (it is required) (Corpse Preparation True Necromancy)\r<br />\r<br />http://www.nexusmods.com/skyrim/mods/35378/?\r<br />\r<br />It makes Necromancy actually rather realistic, and definitely better than any other game I&#39;ve seen that has necromancy (which is very few actually).\r<br />\r<br />And just copy this ESP to the data folder and activate in your load order. If you use the main mod&#39;s esp, just overwrite. The BSA file is required from that mod though.\r<br />\r<br />What this does is one simple, but huge change. It removes the mods hate quest, where when you practice necromancy no (or very few) NPCs talk to you.\r<br />\r<br />First, not entirely realistic in my opinion. If I&#39;m hiding in a cave, and no one is around me...no one is going to know about my devious deeds (unless I have skeletons following me and I go into a city and even then, I could just have conjured them up). But, since I didn&#39;t want to add additional scripts (and I wouldn&#39;t know where to begin on that) to my personal already ALMOST too scripted game. I removed the hate quest out of the mod.\r<br />\r<br />I guess one could say carrying a corpse should make NPCs hate you. It would make sense in that regard. But, like I said, while I enjoy penalties and realism (and max speech DOES remove said penalty)...I&#39;d still rather play without it. And there are still penalties for raising corpses anyway (soul corruption).\r<br />\r<br />Second issue is, even when I killed my skeletons (hey I&#39;m an evil necromancer&#33;)...the hate script still stuck to my character. Not very fun not being able to talk to anyone, do any quest or even my own followers.\r<br />\r<br />You will however still get soul corruption, since that is easy to remove (sleep 20 hours (I sleep 24 to be sure) and it gets removed. Waiting doesn&#39;t seem to work on that. Once you are more powerful in necromancy AND conjuration, soul corruption isn&#39;t much (if at all) an issue.\r<br />\r<br />But this mod does nothing else but remove the semi-buggy, and mostly annoying hate quest from Corpse Preparation. Just a small, simple mod that for me personally, makes a huge change. Because for me as it was, unbreakable NPC hate to your character was rather...well...I wouldn&#39;t touch necromancy with it. It isn&#39;t my idea of fun. \r<br />\r<br />Now go out and kill all NPCs and use their corpses :P\r<br />\r<br />And for those that got to the end. It is completely save compatible&#33; :D (I was REALLY worried the script would stick and I&#39;d lose my 60 hour character). If you had the mod already, overwrite this and the quest will automatically leave your game...no waiting 31 days...no sleeping...quest is automatically removed and NPCs will go right back to talking to you.\r<br />\r<br />This will also the only time I&#39;ll update this mod, as it is finished already. Like I said, this mod does only one thing...remove the hate quest/script.",
  "categoryId": "84",
  "version": "1.0",
  "author": "TheNexusLeacher",
  "createdUnix": "1421395522",
  "updatedUnix": "1421395517",
  "containsAdultContent": false,
  "uploadedBy": "TheNexusLeacher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143089",
      "name": "Corpse Preparation No Hate Quest or Scripts",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "139",
      "fileName": "Corpse Preparation No Hate Quest or Scripts-61740-1-0.7z",
      "uploadedUnix": "1421395517",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e30280e0fc48d36977f88fc5df4a75af2c3a22b5cefe09c542d6bafa2768246/analysis/1421395563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Corpse%20Preparation%20No%20Hate%20Quest%20or%20Scripts-61740-1-0.7z?fid=1000143089&ttl=1535850254&ri=8192&rs=8192&setec=de45479660deeeff8c700c811c3a2ccb"
    }
  ]
}