{
  "modId": 6174.0,
  "modName": "Imola - An Alternative RP Start",
  "summary": "Imola, An Alternative RP Start",
  "descriptionHtml": "[IMG]http://i280.photobucket.com/albums/kk200/Jonezy264/ScreenShot9-1-1.jpg[/IMG]\r\n\r\n[FONT=Verdana][color=DarkRed][b]THE SETTING[/b][/color]\r\nYou\\'re a young, beautiful Imperial women named Imola, your parents moved to Skyrim from Cyrodil to start a new life, living off the land. Your parents adored their new life-style, but you however wanted to explore the vast lands that lay before you. So at the age of eighteen you decided to leave your parents lives and dreams at Corpselight Farm and begin your own. You head east out of Falkreath towards Riften in search of work, as you pass Snow-Shod Farm you overhear two men on the other side of the path talking about Haelga\\'s Bunkhouse and how splendid the \\\"service\\\" was. So you enter Riften and ask the nearest guard for directions to the Bunkhouse, the guard laughs and asks you why. You tell him you\\'re looking for work and that you\\'ve heard Haelga gives splendid service, the guard winks at you and then points in the general direction of the Bunkhouse. \r\n\r\nYou ponder on the meaning of the wink whilst walking towards the Bunkhouse but come up with nothing, you find yourself in front of the Bunkhouse and enter. You walk to the front desk and are immedietly greeted by Haelga who states that the Bunkhouse isn\\'t an Inn and that you should leave, you tell her that you\\'re looking for work and she ponders on the idea but says that she can\\'t afford to take you on. You\\'re worried you won\\'t have a bed to sleep in for the night and out of desperation tell her that you will work for free so long as you have a bed to sleep in. Haelga ponders once more but doesn\\'t think you could do much harm and decides to employ you, she hands you some clothes and a broom and starts walking up the stairs to show you your bed, she allows you ownership of the end table next to your bed and tells you that you start first thing in the morning.\r\nYou put your clothes on top of the end table, lean your broom against it and then with an exhale of relief lay down on your bed and fall asleep.\r\n\r\nYou wake the next morning at 11:00am and are worried about how Haelga will react, you get dressed and go downstairs. On your way down you notice a women about your age sweeping the floor and you begin talking to her.\r\n\r\n[color=DarkRed][b]INFORMATION[/b][/color]\r\n[color=DarkRed][b]- NOTE[/b][/color] This does disable the main Dragonborn questline. To enable it Open the console and type in \\\"setstage MQ102 30\\\" although I haven\\'t done so yet, so I don\\'t know the outcomes.\r\n\r\nI do recommend talking to Svana as she will give you a quest and it will set you in motion, also the outcome of the quest gives more reason not to stay in the Bunkhouse. After that you may become whatever you wish to be, when you enter the market you are approached by Brynjolf so that will get you started after Svana\\'s quest. (However I believe you need a lockpick for Brynjolfs first task, if you go straight from the Bunkhouse to Brynjolf I suggest using the console to add a few to your inventory (player.additem 0000000a xx) not very RP I know, but get by as best you can :)\r\n\r\nI have increased the Speech skill by 100 (Overall 115) and added all the Speech perks due to the fact that the quest from Svana requires a fairly high level in speech to complete. However if you want a more challenging approach you can of course decrease the level of your Speechcraft (player.modav speechcraft xx (15 default) and remove the perks (player.removeperk [Perk ID]) Perk ID\\'s can be found at http://elderscrolls.wikia.com/wiki/Console_Perk_Codes_%28Skyrim%29\r\n\r\n\r\n\r\n[color=DarkRed][b]RECOMMENDATIONS[/b][/color]\r\nI do recommend disabling the compass and crosshair and downloading a No Fast Travel mod.\r\n\r\n[color=DarkRed][b]HOW TO[/b][/color]\r\nYou can remove the crosshair via the In-game settings, however this doesn\\'t disable the sneak crosshair \r\nto do that you can decrease the HUD opacity slider which is also in-game.\r\n\r\n[color=DarkRed][b]INSTALL[/b][/color]\r\nPlace the ess. file in C:\\\\Users\\\\(USERNAME)\\\\Documents\\\\My Games\\\\Skyrim\\\\Saves\r\n\r\n[color=DarkRed][b]CHARACTER FEATURES(MODS USED)[/b][/color]\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=3563]Coverwomen[/url] Look 1 by mrLenski\r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=30]No More Blocky Faces[/url] by Xenius\r\nFace & Hair by FrankSunday (To my knowledge this is no longer on SkyrimNexus so I will place instructions in the readme.)\r\n\r\n[color=DarkRed][b]ADDITIONAL INFORMATION[/b][/color]\r\nFirst of all I would just like to give credit to Mshai the creator of [url=http://www.skyrimnexus.com/downloads/file.php?id=6089]a HUMBLE start[/url] which inspired me to create this. This is my first upload to SkyrimNexus, after downloading several mods/Alternative starts I thought I would give it a shot. The characters name originates from a Formula One championship race which was run in the town of Imola. I hope you took the time to read the setting, perhaps I went too far with it but I enjoyed doing it nonetheless and I hope you enjoy playing Imola, thanks.\r\n\r\nI now have another Alternative RP Start [URL=\\\"http://www.skyrimnexus.com/downloads/file.php?id=6281\\\"]Logan[/URL]  \r\n\r\n[color=DarkRed][b]NOTES[/b][/color]\r\nI haven\\'t changed the mods in any way, all I have done is combined them together.\r\n\r\nDo feel free to comment and/or make requests, they\\'re all appreciated and I will probably end up making a few more settings for both male and female characters.\r\n\r\nAlso feel free to upload images of what you have done with the character, it\\'d be interesting to see the differences in players :) [/FONT]",
  "categoryId": "43",
  "version": "",
  "author": "QUANT45",
  "createdUnix": "1326565066",
  "updatedUnix": "1326565201",
  "containsAdultContent": false,
  "uploadedBy": "QUANT45",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19759",
      "name": "Imola - An Alternative RP Start",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "929",
      "fileName": "Imola - An Alternative RP Start-6174-1.rar",
      "uploadedUnix": "1326565201",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4ed7ae57c9bf26f5210ee093380ceef66a538971b80acbf986f0ba2d94d02919/analysis/1406610724/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imola%20-%20An%20Alternative%20RP%20Start-6174-1.rar?fid=19759&ttl=1535763422&ri=8192&rs=8192&setec=d4b6456df9a06d9cd02c808c46c32c25"
    }
  ]
}