{
  "modId": 61762.0,
  "modName": "Lord of the Rings Transformation",
  "summary": "This is a big mod that complety changes Skyrim to the land of Middle earth. Races, Items, Locations, and Quests, all new&#33;",
  "descriptionHtml": "[size=5]THIS IS A WORK IN PROGRESS AND IS VERY EARLY IN DEVELOPMENT[/size]\r<br />\r<br />[size=2]\r<br />Now that I have that off my chest, welcome&#33; This mod aims to change Skyrim, into Middle Earth&#33; I am a huge LOTR fan myself and I never felt like there were any good, complete mods that made Skyrim very LOTR&#39;s like.[/size]\r<br />[size=2] [/size]\r<br />[img]http://images1.fanpop.com/images/photos/2300000/Map-of-Middle-Earth-lord-of-the-rings-2329809-1600-1200.jpg[/img]\r<br />This is Middle Earth and is what Skyrim is soon to look like with this mod.\r<br />\r<br />[size=4]So what does this mod do?[/size]\r<br />[size=2]\r<br />   Well currently... not much. [/size][b][u]It changes and adds races to resemble the races from LOTR[/u][/b][size=2]. The vanilla playable races in Skyrim were High Elves, Argonians, Wood Elves, Bretons, Dark Elves, Imperials, Kahjiits, Nords, Orcs, and Redguards&#33; [/size][u][b]The races now are Dwarfs, Hobbits, Wizards, Haradrim, Lothlorien Elves, Mirkwood Elves, Mordor Elves, Dunedain, and Middle Men[/b][/u][size=2]. All these races are lore friendly to LOTR so with that in mind, [/size][b][u]Argonians and Khajiits are no longer playable[/u]. [/b][size=2]Sorry but there are no talking lizards or cats in LOTR.[/size]\r<br />\r<br />[size=2]   Another thing this mod does is add locations&#33; (Whoa I just had some mad deja vu) [/size][b][u]It currently adds The Shire, Bree, Fornost, Mines of Moria, Rohan, Minas Tirith, The Black Gates, Erebor, and The lonely Mountain[/u][/b][size=2]. These locations are, more or less, in their correct locations from LOTR but [/size][b][u]none of these locations besides The Shire or Bree have anything there[/u][/b][size=2]. Don&#39;t worry, that&#39;s first on the priority list. [/size]\r<br />\r<br />[size=2]   This mod also [/size][b][u]adds Bag End[/u][/b][size=2], which is located in The Shire, [/size][u][b]and Bilbo Baggins who is in Bad End[/b][/u][size=2]. Yes Bilbo&#39;s face is messed up I know and yes he doesnt really look like Bilbo. Do you wanna try? [/size][b][u][size=2]It also adds The One Ring on the table by Bilbo. It currently doesn&#39;t do anything[/size][/u][/b]\r<br />\r<br />\r<br />\r<br />[size=4]\r<br />Lets see, I think thats all for what the mod CURRENTLY adds, but what will it add?[/size]\r<br />\r<br />[size=2][u][b]   Firstly, I need to finish all the locations and actually put stuff there[/b][/u]. That&#39;s gonna be a long process but it wont be too hard.\r<br />\r<br />    [b][u]I also want to add all the custom people from LOTR in their respective places. IE: Aragorn, Legolas, Gandalf, ect[/u][/b]. In the way future [u][b]these NPC&#39;s will be custom voiced[/b][/u]\r<br />\r<br />   The thing I&#39;m most excited for are the quests. [b][u]There will be 3 main quests. One: the quest to reclaim the lonely mountain. Two: The quest to bring the ring to Mordor and destroy it. And three: the quest to find the ring, bring it to Sauron, and conquer Middle Earth.[/u][/b] You will only be able to do one of these last two quests so choose wisely&#33; [u]There will also be some side quests, IE: take back Fornost, rid Mirkwood of evil, and hopefully something along the lines of restoring the Mines of Moria&#33;\r<br />\r<br />[/u][b][u]   I also plan on adding alot of the items from LOTR. IE: Armor, Spells, Books, Minerals, ect.[/u][/b] I cant do that as of now because I simply dont know how to make custom textures and what. I plan on collaborating with some other modders that have already made mods that add LOTR items to Skyrim and then putting their items in my mod - if that made any sense. \r<br />\r<br />[/size][size=4]Why am I uploading this so early in development?\r<br />\r<br />[/size]   Simply put: I want you guys feedback. If I should changes any of the locations (or change anything else) I would rather know now than later just because that makes the process much easier. Oh and because I have and awesome Youtube channel that you should check out: https://www.youtube.com/user/GingaNinja12398\r<br />;)\r<br />\r<br />\r<br />I dont know what else to say but im sure im forgetting something...Oh well...\r<br />\r<br />\r<br />[size=4] [/size]",
  "categoryId": "79",
  "version": ".01",
  "author": "Me",
  "createdUnix": "1421455930",
  "updatedUnix": "1421455892",
  "containsAdultContent": false,
  "uploadedBy": "GingaNinja23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143186",
      "name": "LOTR Transformation",
      "version": ".01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "448",
      "fileName": "LOTR Transformation-61762--01.7z",
      "uploadedUnix": "1421455892",
      "modVersion": ".01",
      "virusScanUrl": "https://www.virustotal.com/file/ab34a1c951d212f71a7026286c60016b267563e504b794ea62c84dab65d108bd/analysis/1421455924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LOTR%20Transformation-61762--01.7z?fid=1000143186&ttl=1535850287&ri=8192&rs=8192&setec=349c49ef17a479ceb2532631baef4cf3"
    }
  ]
}