{
  "modId": 61773.0,
  "modName": "Sexy Numidium Brass Goddess Follower in a Dress",
  "summary": "You&#39;ve probably been feeling pretty empty and lonely while adventuring through Skyrim. You&#39;ve tried the vanilla and custom waifus but just can&#39;t find a connection with them. Well, feel lonely no longer. You can now have the Brass Goddess as a marriageable follower. She is in a mini-dress too.",
  "descriptionHtml": "You&#39;ve probably been feeling pretty empty and lonely while adventuring through Skyrim. You&#39;ve tried the vanilla and custom waifus and just can&#39;t find a connection with them. Well, feel lonely no longer. You can now have the Brass Goddess as a marriageable follower. She has a big gun because why not. \r<br />\r<br />She uses vanilla dwemer textures so any fancy dwemer textures you use will make her look all fancy too.\r<br />\r<br />I originally made her 300 feet tall but turns out things get really glitchy when you make them that big, so she&#39;s been chipped down a bit. \r<br />\r<br />She can be found outside of Mzulft.\r<br />\r<br />[img]http://i.imgur.com/4c8eozZ.jpg[/img]\r<br />\r<br />Features:\r<br />-A 30 foot tall giant golden sexy goddess that you can marry\r<br />-The entire Dwemer race except Yaggy Baggy\r<br />-She&#39;s indestructible. If you want a chance at killing her, you&#39;re going to need your sexy Akulakhan follower.\r<br />-She uses mysterious dwemer tonal magic to fit through doors even though she&#39;s tall as some of the buildings she&#39;s trying to enter.\r<br />-Great if you&#39;re Thalmor.\r<br />-You get to marry the destruction of Mundus.\r<br />-She breaks reality by just walking around.\r<br />\r<br />\r<br />Credits:\r<br />Trainwiz - Bhruce Hammar&#39;s head and the idea for this mod\r<br />Mahty - Dwarven Rifle\r<br />Vicn - His meshes",
  "categoryId": "96",
  "version": "1.0",
  "author": "GendunDrup",
  "createdUnix": "1421543282",
  "updatedUnix": "1421543272",
  "containsAdultContent": false,
  "uploadedBy": "GendunDrup",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143318",
      "name": "Sexy Numidium Follower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10341",
      "fileName": "Sexy Numidium Follower-61773-1-0.zip",
      "uploadedUnix": "1421543272",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b63708ff5d3bd029cf238537543e5903532c8fd5018591313d625cdaa2cc7caa/analysis/1421543286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Numidium%20Follower-61773-1-0.zip?fid=1000143318&ttl=1535850300&ri=8192&rs=8192&setec=10f464e052279be24537b457968165b4"
    }
  ]
}