{
  "modId": 61788.0,
  "modName": "Death Alternative - Alternate Start Addon",
  "summary": "This adds many of the complex scenarios of &#34;Death Alternative - Your Money or Your Life&#34; and &#34;Death Alternative - Captured&#34; to &#34;Alternate Start - Live Another Life&#34;. All three mods required, though Death Alternative can be toggled off if one only wants the different starting scenario it offers.",
  "descriptionHtml": "[size=5][b]Short description:\r<br />[/b][/size]This mods adds the most complex scenario of Death Alternative - Your Money or Your Life (DA-YMOYL) and all the scenarios of Death Alternative - Captured (DA-C) as possible starting choice in Alternate Start - Live Another Life (AS-LAL).\r<br />\r<br />[b][size=5]Longer description:\r<br />[/size][/b]For those who don&#39;t know, all DA scenarios will provide a very challenging alternative start. Unlike the basic scenario of AS-LAL, these scenarios are extremely fleshed out. You are not just dropped at a starting location; you are really captured and escaping may be difficult in some cases. In many cases, the player will be left into the world with barely any equipment at all and with debts to repay. That is, of course, if he is lucky. In some case your game won&#39;t last 5 mins and your head will roll. Again, not for the faint of heart. There is, however, many ways to escape since that&#39;s the whole point.\r<br />\r<br />The scenarios that have been enabled are:\r<br />-[b]Bandit Ransom[/b]: You have been captured by bandits and are being held for ransom. You can escape or wait for rescue.\r<br />-[b]Thalmor Capture[/b]: The Thalmor captured you and brought you to Northwatch Keep for interrogation. Think about what you say... these might be your last words&#33;\r<br />-[b]Falmer Slave[/b]: You are a falmer slave in Blackreach. Complete tasks for your masters and plan your escape.\r<br />-[b]Vampire Thrall[/b]: You are under the effect of a Geas of compulsion and must serve your vampire master unless you can find a way to dispel the charm and escape. You may also be rescued by a Dawnguard patrol or join the vampire if you get infected and the disease progresses enough.\r<br />-[b]Soul trapped[/b]: You have been soul trapped and must bargain for your release or wait for rescue.\r<br />-[b]Captured by Forsworn[/b]: You have been captured by Forsworn and are being held for ransom. You can try to escape or wait for rescue.\r<br />\r<br />Here&#39;s some videos by Shinji72 describing some of the scenarios in Death Alternative - Captured\r<br />\r<br />[youtube]MkedTN5J4aw[/youtube]    [youtube]2S9RyQ08EaI[/youtube]\r<br />[youtube]rkm-QggLE1U[/youtube] \r<br />\r<br />[size=5][b]Requirements:\r<br />[/b][/size]-[url=http://www.nexusmods.com/skyrim/mods/45894/?]Death Alternative - Your Money or Your Life[/url], at least v6.1.0\r<br />-[url=http://www.nexusmods.com/skyrim/mods/54867/?]Death Alternative - Captured[/url], at least v2.0\r<br />-[url=http://www.nexusmods.com/skyrim/mods/9557/?]Alternate Start - Live Another Life[/url], at least v2.5\r<br />-All the requirements of the previous mods of course.\r<br />\r<br />[size=5][b]F.A.Q.\r<br />[/b][/size]Q: I chose an option but when I slept at the bed, nothing happen and now the statue of Mara is gone and I&#39;m stuck.\r<br />A: Certain scenario as radiant, and it can happen that no match is found and the quest failed to start. I took precautions to avoid that as much as humanly possible but that system can be capricious. Best solution is to reload the automatic save that was made before you chose and try again with the same or a different one.\r<br />\r<br />Q: Can I play this without Death Alternative.\r<br />A: Yes, just disable DA in the menu and I&#39;ll be as if it&#39;s not there, but all the scenario will still work. However, you won&#39;t get all features. For example, if you are defeated while trying to escape you will not be recaptured, you will just die and reload.\r<br />\r<br />Q: Where is Skyrim&#39;s main quest? \r<br />A: Many of the basic scenario of AS-LAL start the first main quest at a more advanced stage e.g. where the player already knows about Helgen. In my scenarios, that main quest is started (as expected) but you have to hear the rumor to get it in your Journal. Talk to a rumor dealing NPC.\r<br />\r<br />Q: The minigame is too hard. I can&#39;t free myself.\r<br />A: The minigame is tied to your character&#39;s skill and becomes easier with time. At the beginning, it will be at its hardest. It is also linked to the difficulty setting in DA. It is intentionally challenging at first. In last resort: Rope binding can be removed by any NPC willing to help and metal bindings can be removed by any blacksmith willing to help. \r<br />\r<br />Q: I see weird shit going on and stuff teleporting.\r<br />A: Many ENBs prevent imagespacemodifier from applying properly. You should know that by now.\r<br />\r<br />Q: Nothing is happening. Shouldn&#39;t there be something happening every second?\r<br />A: It&#39;s probably normal. There is a lot of waiting to do to make the quest progress. In doubt, wait. Then wait some more. If a scene failed to play for whatever reason, it&#39;ll try again automatically in one game hour so wait till then.\r<br />\r<br />Q: This is way too hard. This is way too easy.\r<br />A: Oh well.",
  "categoryId": "35",
  "version": "1.0.1",
  "author": "BralorMarr",
  "createdUnix": "1422146296",
  "updatedUnix": "1422219004",
  "containsAdultContent": false,
  "uploadedBy": "BralorMarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144563",
      "name": "Death Alternative - Live Another Life Addon",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Death Alternative - Live Another Life Addon-61788-1-0-1.7z",
      "uploadedUnix": "1422219004",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/09b2b5f048ecbbdc5b0fdca0e91cc1a19d8be71c3e8ba6d93a9f575cdb68eed8/analysis/1422219062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Death%20Alternative%20-%20Live%20Another%20Life%20Addon-61788-1-0-1.7z?fid=1000144563&ttl=1535850325&ri=8192&rs=8192&setec=375bee43eed407c1412d319039cadef1"
    }
  ]
}