{
  "modId": 618.0,
  "modName": "Sivaarh Skajaad - Male Khajiit",
  "summary": "A fresh save of a (rather handsome) male Khajiit, Si\\'vaarh Skajaad.",
  "descriptionHtml": "Si\\'vaarh Skajaad is a bit of an oddity; as a Skyrim born Khajiit, he considers himself every bit a proud \\\"Nord\\\" as the rest of his countrymen, despite their rather vocal opinions of his lineage. Without ties to any city, town, or Jarl due to being raised alongside the road by his merchant father, Si\\'vaarh plied the typical (in the eyes of the other races) Khajiit trade of mercantile for many years.\r\n\r\nOf course, during this time he quickly found himself a talent for archery, taking great pleasure in the thrill of the hunt, picking up experience from the few Nords who would take the time to apprentice a Khajiit for the short while he would remain in one place.\r\n\r\nAfter the death of his father at the hands of a none-to-happy Giant who had caught the elder cat attempting to steal a rather large surplus of mammoth cheese, Si\\'vaarh continued his father\\'s trade for but a few short months after.\r\n\r\nDeciding to head south towards his ancestral home of Elsweyr in search of both bettering himself and his talents, Si\\'vaarh\\'s journey ended rather abruptly while attempting to cross the border of Skyrim into Cyrodiil...\r\n\r\n- - -\r\n\r\nIn other words, that\\'s how I imagined the character when I was making him, but feel free to use him however you like. I was quite proud of how handsome I made him after spending far too much time in the character creation.\r\n\r\nI\\'m a lover of Khajiit through and through, and was very pleased of how they appear in Skyrim.\r\n\r\nThis save is directly after character creation. Enjoy. :3",
  "categoryId": "43",
  "version": "",
  "author": "Lunarion Silver",
  "createdUnix": "1321671821",
  "updatedUnix": "1321671926",
  "containsAdultContent": false,
  "uploadedBy": "lunarionsilver",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1527",
      "name": "Sivaarh Skajaad",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "998",
      "fileName": "Sivaarh Skajaad-618-1.7z",
      "uploadedUnix": "1321671926",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7a4b2a86c4c79acc68ecd03442906bd396a8e64a3cca0faaa16326cc99d50202/analysis/1406419804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sivaarh%20Skajaad-618-1.7z?fid=1527&ttl=1535753634&ri=8192&rs=8192&setec=1f7a4eaa7fee6bfec4d545b7f4b63171"
    }
  ]
}