{
  "modId": 61804.0,
  "modName": "New Lands and Quest 2 - The Great War Reignites in Hammerfell",
  "summary": "Immediately after the conclusion of the civil war, word reaches Skyrim that the Aldmeri Dominion has a new weapon and has invaded Hammerfell. If they succeed, they will be in prime position to invade High Rock and the Reach. The Dovahkiin is called upon to travel to Hammerfell and intervene.",
  "descriptionHtml": "[size=3][center][/center][/size][center][/center]\r<br />\r<br />\r<br />[size=3]UPDATE 1/25/2015: NEW VERSION\r<br /> I have just added a new version that has less warzone situations in it. I was averaging 2 or 3 CTDs per run because there&#39;s just so many opponents. The new version reduces that so you won&#39;t have CTDs but be warned: since NPCs aren&#39;t fighting each other, they will all obviously target you, which makes that version significantly more difficult. Can you handle it?\r<br />[/size]\r<br />\r<br />\r<br />\r<br />[img]http://i59.tinypic.com/2z66ues.jpg[/img]\r<br />\r<br />[size=6][u][font=Lucida Sans Unicode][b][center]THE GREAT WAR REIGNITES[/center][/b][/font][/u][/size][center]Greetings, warrior. I design mods exclusively for high level characters, typically level 70 and up.\r<br />\r<br />[b]This mod is 100% ready to go: Quest stages, quest markers, 2 custom voiced NPCs, hundreds of enemies, 1 unique boss, 11 locations. Add hours of intense gameplay with a download that is under 1mb in size&#33;[/b]\r<br />\r<br />We all know that at a certain level the Dovahkiin becomes invincible in the vanilla game. I aim to make us feel mortal again. \r<br />\r<br />I also aim to keep all my mods under 1 megabyte, so this takes up practically no space.[/center]\r<br />\r<br />[img]http://i60.tinypic.com/sliw4w.jpg[/img]\r<br />\r<br />\r<br />\r<br />[size=3][center]The Aldmeri Dominion has a new weapon and has invaded Hammerfell. The once great Redguard, battered from decades of war with the Thalmor and civil strife, are disorganized and divided. Hammerfell is all but lost.\r<br />\r<br />The jarls of Skyrim meet in secret and decide to employ the power of the Dovahkiin. \r<br />Your mission is to enter Hammerfell and defeat the Thalmor threat by any means necessary. \r<br />\r<br />Let nothing stand in your way.[/center][/size]\r<br />\r<br />\r<br />[img]http://i61.tinypic.com/2wowwnt.jpg[/img]\r<br />\r<br />[size=6]Important Notes:[/size]\r<br />\r<br />[size=2]1. Quest should start immediately once you have started the game with the mod installed. \r<br />If it doesn&#39;t please use console: player.setstage 01hammerfell 10. \r<br />Everything works perfectly on my game but its been tough for me to test on other people&#39;s games, so please give feedback.\r<br />Extreme version should start upon you opening the barrel in front of the gate to hammerfell.\r<br />If you do not have a new fast travel location west of Markarth called &#34;Gate to Hammerfell&#34;, the mod is not installed (see image below). \r<br />\r<br />2. Once you enter Hammerfell, please save your game and immediately load that save. Restarting Skyrim is not required. \r<br />If you do not follow these instructions, the dialogue will not work at all. Recommend turning on dialogue subtitles.\r<br />\r<br />Newest update: I addressed a few things I noticed in post-release testing. For details, see section near bottom of page.\r<br />[/size]\r<br />\r<br />[size=3]Side Notes:[/size]\r<br />\r<br />1.  [size=4]Everywhere you go in Hammerfell will basically be a war zone. \r<br />   The Thalmor are actively storming the entire country. It&#39;s a full scale invasion.[/size] \r<br />\r<br />Hammerfell is mostly desert, so you will have flat landscape and enemies can often see you and one another from very far away. \r<br />You will see them fighting with desert trolls, saber cats, al&#39;ikr etc. everywhere you go. \r<br />That&#39;s awesome&#33;... but it may require some high performance.\r<br />You should kill as many enemies as possible before you move to the next area (or you may be risking CTD). \r<br />\r<br />\r<br />2. I used an elevated navmesh so opponents will chase you up sand dunes, etc. This means that when you are at a far distance you may sometimes see them a few dozen feet in the air. They will adjust to ground level as you approach. This made the navmesh much easier for me and more efficient for our purposes. Please don&#39;t bother complaining about this.\r<br />\r<br />\r<br />3. There are NO interiors. I like this because there are no loading screens, which makes it a bit more immersive, and it&#39;s easier. If you want to add a cave or something, please ask or offer in posts.\r<br />\r<br />\r<br />4. I strongly recommend my previous mod as well. Your opponents will kill each other, so my last mod is probably slightly more difficulty, but this is still tough. You can also find a list of my recommended mods as well as the 30 mods I actively use.\r<br />[size=4] http://www.nexusmods.com/skyrim/mods/61669/?[/size]  (WARNING EXTREMELY DIFFICULT). \r<br />\r<br />\r<br />\r<br />[img]http://i57.tinypic.com/10wqrya.jpg[/img]\r<br />[u]Requirements[/u]: \r<br />SKSE and Skyrim 1.9.3 or higher\r<br />\r<br />[u]Installation[/u]:\r<br />Mod Manager: add .rar file and open in mod manager\r<br />Manual: unzip file and drop .esp file in your skyrim/data folder.\r<br />\r<br />[u]Compatatibility:[/u]\r<br />[size=3][b]Will this conflict with other mods? Do I need Tropical Skyrim? Will I need Dragonborn or Dawnguard?\r<br />[/b][/size]None reported, no sir, and hellz no. Please report any issues. See credits for tropical modders resources and original designers, found on Nexus. Thanks Nexus&#33;\r<br />\r<br />\r<br />[img]http://i59.tinypic.com/dlko7n.jpg[/img]\r<br />[center][/center][b][size=3]What will this mod be like?[/size][/b]\r<br />I make new lands mods exclusively for high level characters, typically level 70 and up. The combat challenges in my mods are designed to be extremely difficult and its the main focus of the mod. I also focus on making the challenges different so that you can&#39;t use the same approach all the time. \r<br />\r<br />[size=3][b]Yeah... B.S. How difficult are we really talking about?[/b][/size]\r<br />You have never seen anything like this in the vanilla game. Prepare to feel mortal again... No matter how invincible you think you&#39;ve become. If you are looking for an even more difficult challenge, try my last mod. Look for the link above in important notes. \r<br />\r<br />[size=3][b]Rewards and the World:[/b][/size]\r<br />Similar to what one might see in real life, the Redguard in Hammerfell will be unpredictable. Some will attack you, some will not, and some may attack you when there are no other enemies left to threaten them. If and when you can get them to help you, they can do serious damage. \r<br />\r<br />There are 11 locations and 4 chests that you need to reach. If you run through the world without killing enemies your game will obviously CTD. You need to wipe out your opponents before you move on to another area and it is sometimes a good idea to lure a group of opponents toward you so that your battle doesn&#39;t attract the attention of other dangerous groups that may be in the area. If your computer is really good maybe you can just run around and kill whatever you want, but if too many enemies target you at once the AI may start acting funny due to limitations in the game. This isn&#39;t the kind of quest you can rush through. There are simply way too many enemies.\r<br />\r<br />In the Dovahkiin&#39;s Greatest Challenge, you can expect gold as loot while in this mod, you can expect rewards in the form of daedric gear. It&#39;s worth tons of gold but most of it is quite heavy. Gloves are probably best gold to weight ratio.\r<br />\r<br />\r<br />[img]http://i60.tinypic.com/dg5wkj.jpg[/img]\r<br />\r<br />\r<br />[size=4]Post Release Testing:\r<br />[/size]The main reason I started designing mods was to challenge my characters, so I run through my mods dozens of times and I like to make some notes here on things I might improve or seek advice on.\r<br />\r<br />1/21/15 \r<br />-1st post release run. All quest markers and dialogue working perfectly. \r<br />- 3 deaths&#33; Wow, this is quite tough. I&#39;m level 120 and totally immortal in the vanilla game. Awesome.\r<br />- 3 CTDs from NPC war chaos, more than pre release testing. Still totally worth it but this can be improved, for now its good to save when possible. \r<br />- Putting up some big walls is anti lore but it will eliminate the kind of NPC war chaos that can cause a CTD. \r<br />- Putting up big walls will also reduce the amount of enemies you can see in the air from a long distance, which would be nice. \r<br />- Larger dunes might not look unrealistic but it might look okay. Let&#39;s find out.\r<br />(It&#39;s just hard not to make a desert not flat&#33; canyons wouldn&#39;t work either, obviously)\r<br />- More people trying to walk up mountains than in pre release testing. This is an easy fix: just make the mountains steeper.\r<br />- Dragons not attacking? Very odd, first time that has happened. I&#39;ve killed them both a bunch of times. I&#39;ll check that out.\r<br />- The melee attackers sometimes run at me from a mile away but sometimes they won&#39;t move until I approach them. To solve this, I can either test that aggro radius function I haven&#39;t tried yet or I can just replace some melee enemies with ranged enemies (I still think ranged is more dangerous, see Dovahkiin&#39;s Greatest Challenge)\r<br />- I found two floating plants out of a million and they are right next to one another. Delete.\r<br />- The navmesh in a 10 yard area near the second chest didn&#39;t seem to be functioning as it should. Easy to investigate in CK.\r<br />- One of the dwemer houses in Sentinel needs to be adjusted to the landscape.\r<br />\r<br />I addressed all this stuff in the third file I uploaded on 1/21/15. Biggest difference is that there are more and steeper walls so you shouldn&#39;t be attracting the attention of too many enemies at once.\r<br />\r<br />\r<br />[img]http://i59.tinypic.com/1051kpf.jpg[/img]\r<br />\r<br />[size=4]What are these strange plants? Is this adult content?\r<br />[/size]No. It&#39;s not. There is nothing in the game or the mod related to using any drugs of any kind besides alcohol, skooma, and moon sugar. I didn&#39;t curse in the dialogue at all. I&#39;m going to go ahead and post this as not adult content.\r<br />\r<br />P.S. the world is roughly the size of two holds.\r<br />\r<br />[img]http://i57.tinypic.com/15ple04.jpg[/img]",
  "categoryId": "30",
  "version": "Version02",
  "author": "Rdunne86",
  "createdUnix": "1421734781",
  "updatedUnix": "1422239590",
  "containsAdultContent": false,
  "uploadedBy": "rdunne86",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143666",
      "name": "Please use the most recent file.",
      "version": "Version01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "938",
      "fileName": "New Lands Challenge 2-61804-Version01.rar",
      "uploadedUnix": "1421734926",
      "modVersion": "Version01",
      "virusScanUrl": "https://www.virustotal.com/file/fe761617a0c843d0d0a9954b730c56755ee5d82a4be0c844ed3172bc278a5cbf/analysis/1421738703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Lands%20Challenge%202-61804-Version01.rar?fid=1000143666&ttl=1535850352&ri=8192&rs=8192&setec=879aa0ec91eafd1f2e0b88569de20263"
    },
    {
      "fileId": "1000143712",
      "name": "Please use the most recent file.",
      "version": "Version01B",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "939",
      "fileName": "New Lands Challenge 2 - The Deserts of Hammerfell-61804-Version01B.rar",
      "uploadedUnix": "1421763350",
      "modVersion": "Version01B",
      "virusScanUrl": "https://www.virustotal.com/file/05b5b9a2bf636fb03c9ee8b8d359bc90cb10a68a4897404bf4834636458a4a33/analysis/1421763367/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Lands%20Challenge%202%20-%20The%20Deserts%20of%20Hammerfell-61804-Version01B.rar?fid=1000143712&ttl=1535850352&ri=8192&rs=8192&setec=992f352383a42131676644982ab81b6f"
    },
    {
      "fileId": "1000143914",
      "name": "New Lands Challenge 2 - The Deserts of Hammerfell",
      "version": "Version01C",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "944",
      "fileName": "New Lands Challenge 2 - The Deserts of Hammerfell-61804-Version01C.rar",
      "uploadedUnix": "1421863216",
      "modVersion": "Version01C",
      "virusScanUrl": "https://www.virustotal.com/file/1fe4b2ce108afd033b726f30161579987ad9a8558bb2f494d00fcedaa2be63ad/analysis/1421863279/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Lands%20Challenge%202%20-%20The%20Deserts%20of%20Hammerfell-61804-Version01C.rar?fid=1000143914&ttl=1535850353&ri=8192&rs=8192&setec=98a4a095245a17cd3c08b937fd35b274"
    },
    {
      "fileId": "1000144616",
      "name": "Deserts of Hammerfell - Less Chaos - More Difficult",
      "version": "Version02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "963",
      "fileName": "Deserts of Hammerfell - Less Chaos - More Difficult-61804-Version01.rar",
      "uploadedUnix": "1422239590",
      "modVersion": "Version02",
      "virusScanUrl": "https://www.virustotal.com/file/5c61ed3d572bbf4e4e46021456eb1e424a0119db182c553826e59c3bec0c3668/analysis/1422239643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deserts%20of%20Hammerfell%20-%20Less%20Chaos%20-%20More%20Difficult-61804-Version01.rar?fid=1000144616&ttl=1535850353&ri=8192&rs=8192&setec=5d7384e296d8f0820d175e29a192913d"
    }
  ]
}