{
  "modId": 61812.0,
  "modName": "Follower Quarters",
  "summary": "Got a small army of followers? House &#39;em here.",
  "descriptionHtml": "[color=#1e84cc][size=5]Follower Quarters[/size][/color]\r<br />  [color=#3c78d8]-REQUIRES DAWNGUARD- SCROLL TO BOTTOM FOR TL;DR VERSION-[/color]\r<br />This mod adds a purchasable underground barracks just outside/under Markarth to house your followers. It is a single cell.\r<br />\r<br />I wanted a place where a good number of my followers could hang out permanently: a kind of, &#34;hey, we&#39;ve raided a lot of bandits and killed a dozen or so dragons and you let me keep all the loot, even the stuff I made you carry, so now that I&#39;m rich I think I&#39;ll give you a nice, warm bed and a belly full of mead&#34; thing. This also makes it a one-stop-shop for &#34;I got my ass handed to me 50 times in a row and I think I need backup and a new sword&#34; times.\r<br />\r<br />I also wanted it to look lived-in without me doing a whole lot, as if the followers were, you know, living there (more about that below). BUT I wanted the to option to add stuff from our travels, so I put in plenty of decorateable-but-not-empty places, like some dwemer wall shelves in the back corridor to place things on or leave just as decoration, extra pedestals, blank wall space, and open areas of floor. This&#39;ll also be nice if you don&#39;t like things overly cluttered, AND it helps open the place up and prevent follower bumping/stalling once you have a lot of people in there.\r<br />\r<br />The main hall has two side wings, each of which has separate bedrooms along its hallway and then ends in group dormitory style room. \r<br />[list][*][size=2]The individual rooms are decorated differently, some with themes. Each has a double bed (some with texture swaps and added elements),a chair, a banner, and a lightsource. Themed rooms: Winterhold College mage, non-affiliated mage, thieves&#39; guild member, and earthy/druidy room.[/size][/*]\r<br />[*][size=2]The dorms have different layouts, but both contain a group table, fireplace, and various beds, cots, and bedrolls. NPCs can also sleep by the fire. Static clutter and dummy items give a hint of who could be taking up residence and give it a lived-in feel - I tried to use them sparingly. Ex: boots, city shield, weapon of choice, map, banner, etc.[/size][/*]\r<br />[*][size=2]If you look closely at some of the beds (but not all, so no overkill), you&#39;ll find small details to give some individuality. Some examples: dagger under the pillow in the assassin room, greatsword in somebody&#39;s bed, journals/books tucked away, etc.[/size]\r<br />[/*][/list]The main hall then tapers into a smaller hallway with two offshoots that lead to the pool, workroom, and vampire den.\r<br />\r<br />[color=#1e84cc][size=5]Features Summary[/size][/color] \r<br />[list][*][size=3]Lots of follower beds. [/size]Cots, singles, doubles, bedrolls, sleeping places on the ground...[/*]\r<br />[*][size=3]Player animal area. [/size]Hay, bones, and idle markers for your animals. Comes with one (regular, not protected) dog.[/*]\r<br />[*][size=3]Work room. [/size]All the basic crafting stations, including a smelter. Vented so your followers don&#39;t die a horrible death. [/*]\r<br />[*][size=3]Vampire room. [/size] A small room with several coffins, storage, and vampy statics/decor. For your vampire friends. Or prisoners.[/*]\r<br />[img]http://i.imgur.com/BFHiSzx.gif[/img][*][size=3]Book nook. [/size] A little aside in the main hall with Winterhold-style bookshelves and seating.[/*]\r<br />[*][size=3]Pool/bath area. [/size] Because after 20 hours of killing draugr and carrying your burdens, your followers probably smell. Or could use a good soak. [/*]\r<br />[*][size=3]Shrine area. [/size] A corner area where you and your followers can seek the blessings of the nine.[/*]\r<br />[*][size=3]Mini trophy area. [/size] A corner with a troll on display and some empty pedestals waiting for the heads of your enemies. Or, you know, another Nordic urn.[/*]\r<br />[*][size=3]Pantry. [/size] A storage room for foods, booze, or whatever else you want to keep in there.[/*]\r<br />[img]http://i.imgur.com/ecmjRxv.gif[/img][*][size=3]Dining area. [/size] A biigg table with static dinnerware where your party can feast. Go ahead, run down it... or whatever.\r<br />[/*][*][size=3]Cooking area. [/size] A fire and cooking pot so your followers don&#39;t starve to death when they realise they can&#39;t eat the static food on the table.[/*]\r<br />[*][size=3]Locked Player room. [/size] An extra Assassin/Thief themed room behind a locked door for the player or a special follower (not player-owned). Custom bed. [/*]\r<br />[*][size=3]Navmeshed. [/size] With idle markers. And swimming. And jump-down points into the pool. \r<br />[/*][*][size=3]Cleaned with [size=2]TES5EDIT[/size]. [/size] No ITMs, UDRs, random edits to Breezehome or killer rabbits.[/*]\r<br />[*][size=3]Safe Storage. [/size] Cell is a noresetzone and individual containers are set to not respawn, so you can keep all your stuff. And things.[/*]\r<br />[img]http://i.imgur.com/XuSatdE.gif[/img][/list]\r<br />\r<br />[color=#1e84cc][size=5]New in 2.0[/size][/color]\r<br />[size=3]Additions:[/size]\r<br />[list][*][size=2]More furs and rugs for those cold Skyrim nights.[/size][/*]\r<br />[*][size=2]More seating/laying markers (IE &#39;invisible furniture&#39;)[/size][/*]\r<br />[*][size=2]Small waterfall into the pool (Dwemer-themed).[/size][/*]\r<br />[*][size=2]More display cases, plaques, and weapon racks. All the added cases have activators; the originals in the main hall do not (since I pictured putting trinkets in there, not weapons, but you can drop weapons in there, too).[/size][/*]\r<br />[*][size=2]Cage area behind the gate to the vampire den; has seats, bedroll, idles, and locked door (can be picked or uses FQ key). Use it for Zora Fairchild, Inigo (so he can repent without going to Riften), vampire thralls/cattle, prisoners, or your werewolf buddy who&#39;s hulking out.[/size][/*]\r<br />[*][size=2]Pool room improvements: more seating, furs & rugs, Dwemer pipeline, sconces for warmth & incense burning, various salts for bath/pool.[/size]\r<br />[/*][*][size=2]Shelves around cooking area to hold extra things.[/size]\r<br />[/*][/list][img]http://i.imgur.com/FFV7xyL.gif?1[/img]\r<br />[size=3]Tweaks and Fixes:[/size]\r<br />[list][*][size=2]Navmesh tweaks[/size][/*]\r<br />[*][size=2]Added/adjusted keyword and location info. This should make it more recognizable by other mods.[/size][/*]\r<br />[*][size=2]Removed and moved around some furniture in the individual bedrooms; navmesh adjusted accordingly. This should make it easier for NPCs to get around in those rooms and stop sitting in chairs to stare at walls so much.[/size][/*]\r<br />[*][size=2]Pool water is now much less grungy now that we&#39;ve hacked into a Dwemer pipeline instead of the kinda-murky cave/underground water. [/size]\r<br />[/*][*][size=2]Lighting tweaks[/size][/*]\r<br />[/list][size=2][b][color=#3d85c6]Should I Update?/ Update Notes[/color][/b]\r<br />- If you don&#39;t want any of the added stuff or changes and didn&#39;t have issues with other mods recognizing FQ, you don&#39;t need to update.\r<br />- Because of added flags you may get a duplicate bed or two when you update. These can easily be disabled with the console, however you probably won&#39;t notice them unless you go around and inspect/sleep in every bed. You may also have a few stray items sitting on the floor (potions that used to be in boxes, but the box has moved, etc.).\r<br />- You will not have to repurchase FQ if you update, or have the sale sign hanging around.\r<br />- [i]My[/i] containers did not reset/lose items/explode. To be safe, make a backup save and travel immediately to FQ after updating to check that everything&#39;s in place and you weren&#39;t sabotaged by Skyrim Sorcery.\r<br />- You can also uninstall the old version and reinstall the new version. However, you&#39;ll have to repurchase the house, re-assign your followers, and unpack/repack all your junk.[/size]\r<br />[color=#1e84cc][size=5]Getting the house[/size][/color]\r<br />[list=1][*][size=2]Travel to Markarth.[/size][/*]\r<br />[*][size=2]From the gate, head down the road leading from Markarth. On your right there will be a stone column with a stone block underneath it. You&#39;ll discover the &#34;Follower Quarters&#34; map marker and a trap door.[/size]\r<br />[/*]\r<br />[*][size=2]Click the &#34;For Sale&#34; sign on the stone near the door.[/size][/*]\r<br />[*][size=2]If you have the funds (12000 gold), you&#39;ll get your key and paperwork. If you&#39;re broke, you&#39;ll get a &#34;Sorry, you&#39;re broke&#34; message, and can come back later. [/size]\r<br />[/*]\r<br />[/list]\r<br />[color=#1e84cc][size=5]Required[/size][/color]\r<br />\r<br />Dawnguard. No, I cannot make a Dawnguard-free version; the floors, walls, etc. are all from Dawnguard.\r<br />   \r<br />A mod like [url=http://www.nexusmods.com/skyrim/mods/62040/?]My Home Is Your Home [/url]so you can actually move your followers in. You can still run my mod without one, if you just want the building for your player character or whatever. You can also set it as a hangout in Familiar Faces (use portal stone to add it).\r<br />\r<br />[color=#1e84cc][size=5]Recommended[/size][/color](but not required&#33;)\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/3621/?]Bellyache&#39;s Creature Textures[/url] for the various animal trophies.\r<br />[url=http://www.nexusmods.com/skyrim/mods/32448]Dynamic Things [/url]to make the various mead barrels, kegs, and practice dummies usable instead of just... nice.\r<br />[url=http://www.nexusmods.com/skyrim/mods/52583/?]Jaxon&#39;s Positioner [/url]to move in your own things and redecorate.\r<br />[url=http://www.nexusmods.com/skyrim/mods/57335/]Jaxon&#39;s Renamer [/url]to customize storage, name beds, etc.\r<br />[url=http://www.nexusmods.com/skyrim/mods/21225/?]No More Stupid Dog Comments[/url] to keep everyone in the room from saying &#34;stupid dog&#34; every five seconds if you choose to keep your dog(s) here.\r<br />\r<br />\r<br />[color=#1e84cc][size=5]Compatibility[/size][/color]\r<br />[color=#1e84cc]Location:[/color] I purposefully made this with a small exterior footprint so it wouldn&#39;t conflict with things and so it could be more hidden. Unless you have another mod that adds something right on top of the trapdoor or for sale sign, you should be good. Some of Markarth&#39;s civil war siege markers are on the same stone, but have not been touched. Exterior navmesh has also not been altered.\r<br />[color=#1e84cc]Textures/meshes: [/color]Everything I tinkered with has been made a new item and/or is a subfolder in my folder, so nothing gets overwritten or overwrites vanilla files or other mods using the same resources. (exception: for sale sign.)\r<br />[color=#1e84cc]Family Housing:[/color] You should be able to move your spouse in, but compatibility for kids is not planned (caveat: this doesn&#39;t mean I won&#39;t change my mind). I wanted a place just for followers that maybe the player sleeps at once  in a great while. If someone wants to make a patch/addon/separate version to use with Multiple Adoptions or other mods that allow families in other homes that&#39;s fine, just send me message so I can link it here&#33; \r<br />\r<br />[color=#1e84cc][size=5]Things you should know[/size][/color]\r<br />[list][*][size=2]Skyrim can only handle so many AIs at one place/time. As you pile on followers they may start to do things that are... odd... or just stand around.[/size][/*]\r<br />[*][size=2]If you have a weaker computer and have two dozen or so ladies running around in skimpy-but-super-high-res armor, you&#39;re gonna have problems.[/size][/*]\r<br />[*][size=2]Most of the stuff pictured is static, including the chalice in the vampire room and a lot of the weapons. This is so stuff doesn&#39;t fly around or get too OP.[/size][/*]\r<br />[*][size=2]You&#39;ll be able to sleep here, but you won&#39;t get a &#34;well rested&#34; bonus, just &#34;rested&#34;.[/size][/*]\r<br />[*][size=2]Sometimes when you tell followers to sleep in the assassin-themed room, they sleep in the nearest hallway bed. It&#39;s a radius thing; try setting their home/sleep option in whatever manager you&#39;re using closer to the front of the room or just outside the room.[/size][/*]\r<br />[*][size=2]If you set followers&#39; homes in the main hallway, they WILL eventually make their way around the whole place (tested with MHiYH). If you use a mod with a smaller radius they may only stay in one room/area, depending on where you set their home. I did not include roombounds/portals/etc. in the mod.[/size]\r<br />[/*][*][size=2]I did a new playthrough/ Skyrim install during the course of working on this mod, so you&#39;ll see some minor differences in screenshots. (IE I was using different lighting or textures or SMIM options.)[/size][/*]\r<br />[*][size=2]I don&#39;t pretend to be an expert at navmeshing. I&#39;ve made corrections after testing multiple times and everything seems good. If I have a mistake somewhere let me know.[/size][/*]\r<br />[*][size=2]You can fast-travel from inside FQ. [/size]\r<br />[/*][/list]\r<br />[color=#1e84cc][size=5]Installation & Uninstallation [/size][/color]\r<br />Install using NMM\r<br />-or-\r<br />drop into your data folder, saying &#34;yes&#34; to merge folders and verifying you put it in the right place.\r<br />\r<br />Before uninstalling, remove any items and followers from the house, dismiss the dog (if you still have him), and travel away from the Follower Quarters map marker for good measure. Save game. Exit game. Uninstall with NMM or manually delete files. Make a new save. You&#39;re done&#33;\r<br />\r<br />[color=#1e84cc][size=5]Updating [/size][/color]\r<br />Download the 1.1 to 2.0 update. If you install with NMM, say &#39;no&#39; to update and &#39;yes&#39; to overwriting files. If you install manually, drag the .esp into your data folder and overwrite. Travel to Follower Quarters in game to make sure nothing went crazy. Save game. You&#39;re done&#33;\r<br />\r<br />[color=#1e84cc][size=4]FAQs[/size][/color]\r<br />[size=2][size=1]okay, they&#39;re more like [i]anticipated [/i]FAQs.[/size]\r<br />\r<br />[b][color=#3d85c6]Why are there gifs?&#33;[/color][/b]\r<br />- The mod description was starting to look like a big scary wall of text.[/size]\r<br />[color=#3c78d8][b][color=#3d85c6]Why is it all underground/ how does that even work?[/color][/b][/color]\r<br />- It&#39;s kind of underneath Markarth. We know Markarth is built on top of other stuff... this is just playing fast and loose with that concept. I wanted a tiny footprint for the entrance to the place to avoid conflicts, including editing exterior navmesh. \r<br />[b][color=#3d85c6]How do I get it for free?[/color][/b]\r<br />- Open the console (~) and type [b]help &#34;key to follower quarters&#34; ([/b]or [b]help &#34;follower quarters&#34;[/b], then find the key name[b])[/b], then type &#34;player.additem #### 1&#34; with the ID that generated. You&#39;ll still have the for sale sign.\r<br />[b][color=#3d85c6]How can I see it/test it out before I commit to keeping the mod?[/color][/b]\r<br />- Open the console (~) and type &#34;coc 000followerquarters&#34;.\r<br />[b][color=#3d85c6]Why did you upload so many pictures?&#33;[/color][/b]\r<br />- I like to know what I&#39;m getting before I download and it&#39;s a preeeeetttttty big cell. Also, I wanted to take some shots with my lighting mods and whatnot disabled so people not running a lighting mod would know what to expect.\r<br />[b][color=#3d85c6]Why are there no mannequins?&#33;[/color][/b]\r<br />- Mannequins in Skyrim are technically actors. With so many followers running around, I didn&#39;t want to overload the cell. \r<br />\r<br />\r<br />[color=#1e84cc][size=5]TL;DR Version[/size][/color]\r<br />[list][*][b][size=2]REQUIRES DAWNGUARD[/size][/b][/*]\r<br />[*][size=2]Purchase at &#34;for sale&#34; sign outside Markarth, across road from stables[/size]\r<br />[/*][*][size=2]Many beds[/size][/*]\r<br />[*][size=2]Many chests[/size][/*]\r<br />[*][size=2]All Vanilla crafting stations[/size][/*]\r<br />[*][size=2]Stray dog from former owner included[/size][/*]\r<br />[*][size=2]Read full version before you ask questions :][/size]\r<br />[size=2]\r<br />[/size][/*][/list][color=#1e84cc][size=5]Other relevant mods in screenshots[/size][/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/62049/?]Lighter Elk[/url] - lightened version of Bellyache&#39;s texture for people with dark lighting mods. It was actually the making of this mod that made me notice how crazy-dark my lighting settings made the trophies in here.\r<br />[url=http://www.nexusmods.com/skyrim/mods/40736/?]Pottery Recolor[/url] - Iron & Stone version\r<br />Dogs Into Huskies - Mesh swap that defaults dogs into huskies, grey version. Currently hidden on Nexus. :(\r<br />[url=http://www.nexusmods.com/skyrim/mods/1875/?]RCRN AE[/url] - lighting (not all screenshots, since I took some with it off for comparison)\r<br />Peltapalooza\r<br />[url=http://www.nexusmods.com/skyrim/mods/1111/?]Pure Waters[/url] - water\r<br />\r<br />[color=#1e84cc][size=5]Credits[/size][/color]\r<br />Thank you to:\r<br />Oaristys & Tony67- [url=http://www.nexusmods.com/skyrim/mods/16525/?]Modder&#39;s Resource Pack[/url] - New meshes & textures. Fantastic resource&#33;\r<br />Berticus0001 - [url=http://www.nexusmods.com/skyrim/mods/36756/?]Bert&#39;s Bits and Bobs[/url] - &#39;For sale&#39; sign & purchase script. Seriously took the hassle out of making this purchasable.\r<br />Ethatron - [url=http://www.nexusmods.com/skyrim/mods/247]BSAopt program[/url] - For unpacking BSAs so I could make custom textures, like the player bed.\r<br />Blary - [url=http://www.nexusmods.com/skyrim/mods/14135/?]BookSets Resources[/url] - New meshes.\r<br />Eldiabs - [url=http://www.nexusmods.com/skyrim/mods/11618/?]Modders Resource- weapon racks, bookshelves, plaques, mannequins[/url] - For the easy/safe weapon plaques in his resource cell.\r<br />Bethesda - For giving us the Creation Kit.",
  "categoryId": "68",
  "version": "2.0",
  "author": "Sunnyemi",
  "createdUnix": "1422428190",
  "updatedUnix": "1425173460",
  "containsAdultContent": false,
  "uploadedBy": "Sunnyemi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000145064",
      "name": "Main file - original version",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4143",
      "fileName": "Main file-61812-1-1.zip",
      "uploadedUnix": "1422511802",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bd12b4dfc1921706d71c4d4f8133bf63367d53a8098a0ed2a48bd9a8a710229f/analysis/1422511866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20file-61812-1-1.zip?fid=1000145064&ttl=1535850367&ri=8192&rs=8192&setec=defa5e84f95e4974075ee7530dff9cd3"
    },
    {
      "fileId": "1000149585",
      "name": "Main File",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4148",
      "fileName": "Main File-61812-2-0.zip",
      "uploadedUnix": "1425173304",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/ab3f98e7789a5c2e39ab268a35f4362783be86417086796763aa7e48706f04ec/analysis/1425173348/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-61812-2-0.zip?fid=1000149585&ttl=1535850367&ri=8192&rs=8192&setec=ea4d5e36f5d63b3dd28dcd4f3c90d0d0"
    },
    {
      "fileId": "1000149586",
      "name": "Update - 1.1 to 2.0",
      "version": "2.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "88",
      "fileName": "Update - 1.1 to 2.0-61812-2-0.zip",
      "uploadedUnix": "1425173460",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/627d7198e22096c90ab80d01639baa9f4a36d2a92abf2e56060518130b01c58a/analysis/1425173463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20-%201.1%20to%202.0-61812-2-0.zip?fid=1000149586&ttl=1535850367&ri=8192&rs=8192&setec=b796557b31b4ab64a36c5e430318c91d"
    }
  ]
}