{
  "modId": 61863.0,
  "modName": "Magicks Of Old.",
  "summary": "In my latest discovery a man has been seen setting up a stall near Raven Rock. It will be interesting to see what he has to sell. I have heard he is a man of old, an ancient dark elf from 100s of years back, its said he traveled through the oblivion realm in search of resources to create forbidden spells. They say he is to complete his grand",
  "descriptionHtml": "This mod requires the[b] Dragonborn DLC.[/b] \r<br />\r<br />This mod is an addittion to the Dragonborn DLC it takes the enchantment from adzidals boots and turns it into Spells, you can now disenchant the boots, and make a waterwalking potion from the ingredients you find at the merchant of the old&#39;s camp and also 2 new spells, one will make yourself be able to walk on water, and the other spell alows another person to walk on water. \r<br />\r<br />Depending on the ratings and comments I get from this, determins if i make this into a fully fleged quest. you guys decide :D. \r<br />\r<br />Note, Please look at all the images to see how to find/use or locate the spells and ingredients. Bug: When first loading the mod into a new save, the loading screen will freeze for 20 max seconds, but does not crash skyrim, just dont click anywhere, until it has unfrozen. \r<br />\r<br />If any more bugs shall arise please dont hesitate to tell me.\r<br />\r<br />This is also on the steam workshop aswell; http://steamcommunity.com/sharedfiles/filedetails/?id=377286139&tscn=1421754835",
  "categoryId": "93",
  "version": "1.0",
  "author": "xXsim00Xx",
  "createdUnix": "1421756557",
  "updatedUnix": "1421756549",
  "containsAdultContent": false,
  "uploadedBy": "xXsim00Xx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143702",
      "name": "Magicks Of Old.",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Magicks Of Old.-61863-1-0.zip",
      "uploadedUnix": "1421756549",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/caf16d84acc5e2366d0a4f6b753186679430a8c9f24ea177f847f0fa73c352b5/analysis/1421756582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magicks%20Of%20Old.-61863-1-0.zip?fid=1000143702&ttl=1535850453&ri=8192&rs=8192&setec=9911fae4d1f08a8d8ba9af909d5f6978"
    }
  ]
}