{
  "modId": 61868.0,
  "modName": "Clean up your Corpses DE",
  "summary": "Mit diesem Mod könnt ihr den Leichen, die euren Weg pflastern, entweder ein würdiges Denkmal setzen, diese einfach beerdigen, sonstwie malträtieren oder diese einfach dauerhaft ins Nirvana -äh natürlich nach Sovngarde- verschwinden lassen.",
  "descriptionHtml": "[center][color=#1e84cc][size=6][b]Clean up your Corpses[/b][/size][/color][/center]\r<br />\r<br />Dieses ist eine Übersetzung des Mods [url=http://www.nexusmods.com/skyrim/mods/59340/]Clean up your Corpses[/url] von [url=http://www.nexusmods.com/skyrim/users/4205982/?]Mofakin[/url]\r<br />[size=2][color=#ff0000]\r<br />This is a tranlation of the mod [url=http://www.nexusmods.com/skyrim/mods/59340/]Clean up your Corpses[/url] of [url=http://www.nexusmods.com/skyrim/users/4205982/?]Mofakin[/url]\r<br />[/color][/size]\r<br />[b][size=4][color=#00ff00]Diese Präsentation hier ist noch nicht fertig (übersetzt). Der Mod ist aber natürlich fertig übersetzt&#33; Stelle es trotzdem bereits online, denn ich will Euch diese großartige Mod nicht länger als übersetzte Version vorenthalten. Werde dieses hier später fertig übersetzen[/color].[/size][/b]\r<br />\r<br />Seht euch auch unbedingt die Seite des Originalauthors an, welche prima gemacht ist und auch eine Tonne an Infos liefert (aber leider halt in englisch...)\r<br />Im Prinzip sind auch die Inhalte hier von Ihm.\r<br />\r<br />\r<br />[color=#1e84cc][size=4][b]Voraussetzungen:[/b][/size][/color]\r<br />1. aktuellstes Skyrim (1.9.32.8)\r<br />2. alle 3 DLCs: Dawnguard, Hearthfire und Dragonborn\r<br />3. Skyrim Script Extender (SKSE 1.7+)\r<br />4. SkyUI\r<br />\r<br />Clean up your Corpses ...oder auf Deutsch, &#34;macht mal eure Leichen weg&#34;, behandelt den Umgang mit den Leichenbergen, die Ihr für gewöhnlich in euren Abenteuern hinterlaßt. Seit Ihr eine pedantische Putzfrau? Leidet Ihr unter Zwangsneurosen? Bevorzugt Ihr es klinisch rein und sauber? Macht es euch krank, wenn sich nichts an seinem angedachten Platz befindet? Eventuell zu viel Monk geschaut? Benehmt Ihr euch neurotisch, wenn ständig Zeug in der Gegend rumliegen bleibt? Genießt Ihr es, in Skyrim zu töten, aber wird euch der Spaß danach durch die ganzen Leichenberge verdorben? Fangen die ganzen Leichen an langsam zu stinken? Ihr habt euch wieder mal dabei erwischt, eurem täglichen Gemetzel zu frönen, nichts als Tod und Verderben hinter euch zu lassend und spürt Ihr danach den unangenehmen Kloß der Reue in eurem Hals? Oder seid Ihr einfach nur ein Mitglied der dunklen Bruderschaft, das alle Spuren verwischen will? Nun Wanderer, dann sucht nicht länger, denn dies ist genau der Mod nach dem Ihr euer ganzes Leben lang gesucht habt.\r<br />\r<br />Beseitigt sämtliche Leichen in Skyrim, die Ihr entweder selber getötet habt, oder die von anderen getötet wurden. Es ist egal, ob es sich hierbei um Menschen, Elfen oder Viehzeug handelt. Um eure tägliche Neurose zufrieden zu stellen, müsst Ihr sie alle weg machen und die Lämmer zum Schweigen bringen. Natürlich, ich habe durchaus Verständnis dafür, daß Ihr es liebt, eure Opfer den Flußlauf hinabtreiben zu lassen, oder sie einfach von einem hohen Berg herunter zu schuppsen. Das ändert aber nichts daran, daß sie dann immer noch in der Gegend rumliegen und sinnlos vor sich hin verwesen. Ihr könnt auch Kadaver von Tieren mitnehmen und beim nächsten Händler verhökern und obendrein wärmt euch das Feuer mit dem Ihr die Leichenberge abfackelt, wenn Ihr Frostfall benutzt. Aber seid vorsichtig, wenn Ihr mit dem Feuer spielt, es ist heiß und kann euch verbrennen.\r<br />\r<br />Jetzt schön runter laden und ein bisschen mit Säure/Lauge, Feuer oder der Grabschaufel spielen...\r<br />\r<br />[color=#1e84cc][size=6][b]Inhalte:[/b][/size][/color]\r<br />\r<br />[color=#1e84cc][size=4][b]an Leichen:[/b][/size][/color]\r<br />\r<br />[color=#1e84cc][b]Durchsuchen:[/b][/color] ist genauso, wie es in Vanilla funktioniert. Ihr könnt das Inventar einer Leiche öffnen, egal welches Werkzeug oder sonstigen Gegenstand Ihr in Eurer Hand haltet. Aber Achtung: solltet Ihr das erwecken der Vampire im MCM aktiviert haben, werden diese wiederauferstehen, wenn Ihr das Inventar nicht im Schleichmodus geöffnet haben solltet. \r<br />\r<br />[color=#1e84cc][b]Entfernen:[/b][/color] vernichtet die Leiche dauerhaft durch wegätzen. Um das tun zu können, benötigt Ihr Säure. Platziert diese einfach im Inventar einer Leiche und schließt es danach. Säure kann an Kochtöpfe hergestellt werden. \r<br />\r<br />[color=#1e84cc][b]Mitnehmen:[/b][/color] Ihr könnt eine Leiche oder einen Kadaver mit Euch nehmen, in dem Ihr diese in Eurer Inventar aufnehmt und könnt diese dann überall wieder ablegen. Zum Aufnehmen müsst Ihr den Fleischhaken in Eurer Hand halten und die Leiche/den Kadaver damit bearbeiten. Fleischhaken können an einer Schmieder hergestellt werden. Nachdem Ihr die Körper wieder abgelegt habt, könnt Ohr auch alles weitere wieder mit ihnen anstellen: zerstückeln, verbrennen, wegätzen, pfählen usw.\r<br />\r<br />[color=#1e84cc][b]Verbrennen:[/b][/color] Has three flavors (only one on carcass). &#39;Barbecue&#39; with torches, which leaves a grilled body. &#39;Ashes to Ashes&#39; with fire based spells, will leaves an Ash Pile and is the prefered option if you want vampire ashes or bonemeal from human/creature corpses/carcass, and burning impaled detterence, which is considerably a burial option. You will need to hit the corpse/carcass with a torch or a fire spell and previously placed fire accelerant in their inventory. Putting bodys on fire will also add a hazard around them so be carefull and keep your distance. Torch and flame spells are Vanilla and you can find them everywhere in the world. From version 0.9.9 you can also burn corpses/carcasses with flame based staffs.\r<br />\r<br />[color=#1e84cc][b]Begraben:[/b][/color] You&#39;ll need to hit the corpse/charcass with a shovel, axe or scalpel to bury them. How you bury the body depends on what you use. If you use the Corpsecutter&#39;s Axe, an impaled detterent gets placed. Afterwards you can interact with the detterence, applie fire acceleratn to it, and ignite it with torch or fire spell. If you hit the corpse with a shovel, you will bury them with a tombstone, or under a heap of earth if you&#39;ve previously put clay into their inventory. And finally, if you previously put 5 linen wraps into their bodys, and use the scalpel, they will end as mummy. Animals/Creatures can only be processed with a shovel and will always leave a heap of earth, which you can then place a tombstone (fully interactable) or weapon at. The shovel and scalpel can be crafted at a forge. Corpsecutter&#39;s axes are craftable at forges with the vanilla Woodcutter&#39;s Axe as prerequisite. From version 0.9.9 you can also buy replacement tombstones at every Priest of Arkay at the corresponding Hall of Death in major settlements. Use the licenses they give you on tombstones you&#39;ve just placed. After 10 seconds you can&#39;t replace them, so you always want to carry around a license in case you want to replace an ordinary tombstone, before you even bury someone with tombstones. 10 seconds limit is inevitable due to bugs. Form version 1.0 you will be able to place the processed corpse in real time.\r<br />\r<br />[color=#1e84cc][b]an die Wand nageln:[/b][/color] ...oder sonst wo, wohin Ihr auch immer mögt. Use a hammer and nails to nail every corpse at any wall or any place you want, even in mid air. Hiting the corpse with the hammer will &#39;freeze&#39; them, hit them again and they will be unfrozen. This is done in replacement of no longer being capable of placing corpses/carcasses inside containers.\r<br />\r<br />[color=#1e84cc][b]gewährt Ehre auf einem Scheiterhaufen:[/b][/color] Every town and village no has a burial pyre where you can burn your most valued friends...or enemies...as honorable as possible. Just have a corpse in your inventory and activate the burial pyre. It will then process the corpse in your inventory. The person you&#39;re burning appears a last time as Ghost besides the ceremony to watch her/his own funeral, and will then be lifted to Sovngarde through a portal. Since version 0.9.9.4 there&#39;s an MCM option to turn burial pyres off to raise compatibility with mods that add new content to towns and cities. Since version 1.2 the actors will really go to Sovngarde Cell.\r<br />\r<br />[color=#1e84cc][b]Die Knochensäge:[/b][/color] ...is a special tool you&#39;ll get after killing one of the protagonists of the Cannibal mission in Markarth. You&#39;re able to dismember bodies with it, and it will grant you 4 pieces of human flesh, and 1 human heart.\r<br />\r<br />[color=#1e84cc][b]Der Besen der Chefin:[/b][/color] Another special tool, which you will get as reward when completing the DB quest line. You can disintegrate every corpse with it right away.\r<br />\r<br />Most of the placeable activators can be interacted with, like the detterence, tombstone and mummie. The interaction options allow you to write a notation, review the notation, replace the model of the activator, and remove it entirely. Heaps of Earth and Detterences will have special options, like placing the weapon, a tombstone, or fire accelerant at the activator to ignite it. Note that this is since version 1.2, and where you previously had to hold a torch in your hand when placing a detterence to ignite it, you&#39;ll now need to interact with the detterence once it&#39;s placed, applie fire accelerant, and ignite it with a torch or fire spell. \r<br />\r<br />[color=#1e84cc][size=4][b]Belohnungen/Wilderei:[/b][/size][/color]\r<br />\r<br />Corpse processing reward system (optional): Simple idea. Dig the good ones, pike the bad ones and disallow going on a game rampage. The system however is far more complex then this. Basically every tool that places activators or similar (Axe, Shovel, Mummifier, Torch, Flame Spells) will grant you an increase or deduction of your reward counter (showen as widget available in oldschool and white color). Poaching passive animals will deduct from your reward count based on the animals (Level * FeeMoney), and processing corpses/charcass with the correct tool will increase your reward count. Rewards are to be collected at the local Steward, as well as fines to be payed and buying a Hunting License. This Hunting License will allow you to hunt as many passive animals as you like, in a time frame of 3 days, without deduction from your reward count. If you however deliberately hunt more then you&#39;re allowed without Hunting License, you sooner or later face the stigmatization of a Poacher and all guards of all holds will sooner or later try to arrest you. Don&#39;t mess with Jarl&#39;s game. All the settings are configurable inside the MCM menu. Which tool is correct for which actor type? Well, I don&#39;t want to spoil the experience of figuring out...;) \r<br />\r<br />[color=#1e84cc][size=4][b]Zusätzliches:[/b][/size][/color]\r<br />\r<br />[color=#1e84cc][b]Brandwunden:[/b][/color] Getting to close to corpses or charcasses when igniting them, or when they&#39;re burning will get your health damaged and set you on fire, so always keep your distance (150 game units). This is also true for NPCs, so you could use this as trap?\r<br />\r<br />[color=#1e84cc][b]unterstützt Frostfall:[/b][/color] Burning corpses keeps you warm when using Frostfall. Once a body gets ignited a CampFireLight01(HeatSource) will be added to the corpse. This light is what Chesko uses to detect if a player is close to a heat source. Burning corpses will work like a regular campfire from Frostfall. To get the full benefit you&#39;ll need to have a tent build or warm clothes at your body. Additionally the range to the heat source defines the amount of exposure reduced. But don&#39;t get to close, or you get yourself grilled. If you use the bonfire option you will get longer burning corpses, which will warm you up longer.\r<br />\r<br />[color=#1e84cc][b]Vampires get special treatment (optional):[/b][/color] Since version 0.8 Vampire treatment is in particular one of my favorit features of this mod. First, there&#39;s one thing to remember after you killed a Vampire&#33; If you approach them without sneaking, they WILL resurrect&#33; So you want to do the following:\r<br />\r<br />1. kill the Vampire\r<br />2. approach them sneaking to open their inventory\r<br />3. take all their loot if wanted, and either place garlic, brand accelerator or leach inside them\r<br />\r<br />If you did it correctly you can now take the corpse (garlic), burn it(fire accelerant), or remove/melt them (leach). For sure, you can just approach a Vampire while not sneaking and just burn or bury them. In both cases they will not resurrect. This all follows a simple logic and makes it a highly immersive interaction with Vampire, which is also highly compatible with other Vampire mods since version 0.8. From version 0.9.9 Vampires will scream in agony if you decide to burn them and deliver an enjoyable show.\r<br />\r<br />[color=#1e84cc][b]Leichen kleiden:[/b][/color] There&#39;s also a feature to put armor and weapons on corpses if you put said items in their inventory.\r<br />\r<br />[color=#1e84cc][b]Greifstärke erhöhen:[/b][/color] A function inside the MCM menu. You can adjust the grab force to your liking, if you experience any related bug, like not being able to lift corpses.\r<br />\r<br />[color=#1e84cc][b]Angreifer entzünden:[/b][/color] If you use the fire accelerant as poison applied to a weapon, you can ignite actors that are currently using fire magic, or under the influence of fire magic. This opens up whole new opportunities of killing fire mages. \r<br />[center][/center]",
  "categoryId": "24",
  "version": "1.2.1de",
  "author": "mditsch",
  "createdUnix": "1421787170",
  "updatedUnix": "1422180622",
  "containsAdultContent": false,
  "uploadedBy": "mditsch",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144482",
      "name": "Clean up your Corpses",
      "version": "1.2.1de",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "326",
      "fileName": "Clean up your Corpses-61868-1-2-1de.7z",
      "uploadedUnix": "1422180622",
      "modVersion": "1.2.1de",
      "virusScanUrl": "https://www.virustotal.com/file/c890db26f5081f7ae41df52285c896bb672f8665414752528b005d5f05787f9d/analysis/1422180665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clean%20up%20your%20Corpses-61868-1-2-1de.7z?fid=1000144482&ttl=1535850462&ri=8192&rs=8192&setec=312fd4f29ddab49825652cfca1dd0c04"
    }
  ]
}