{
  "modId": 6186.0,
  "modName": "level up faster",
  "summary": "this files basicaly raise the level maximum from 83 to 251, but you need to make a new game, and don\\'t active it on a savegame that are new or not, or it\\'ll screw your savegame once and for good. You\\'ve been warned.",
  "descriptionHtml": "WARNING BEFORE DOWNLOADING\r\nYou MUST make a new game, if you don\\'t and you use my mods, you\\'re \r\ncharacter will level up once, got nothing in Health/magicka/stamina and \r\nwill be stuck at that level and even if you desactivate my mods after \r\nhaving done this, your character will still be stuck in that level, so \r\nyou must make a new game the instant you check my mods or you won\\'t be \r\nable to level up more than once.\r\n\r\nDescription: \r\ni was borred of always restarting a character because sometimes i feel \r\nmore destruction and sometimes i feel more blade, bethesda didn\\'t tough \r\nabout the kind of player that want to play all kind of character. so with\r\nthat mod you will not only lvl up faster, but if you want with this mods \r\nactivated, you will be available to get every perk of every skill, and \r\ni\\'ve changed the formula to make in sort that you stop to level when you \r\ngot every perk, now the level max is 251.\r\n\r\nOk it looks like there is one way to use this mods on an existing save game. I didn\\'t reed the post completely or even tested it\\'s your risk if you use it, so make back-up and you won\\'t have problem. Here is the post that explain how to do this:\r\n\r\nFirst off, my apologies! this does\\'nt give you an alternative start, sorry if it\\'s had a negative effect. \r\nWhy I am posting now is that I decided to give this another go, ( got heaps of alts most of which have been split into differet lifestyles etc ) and have found you can use your original char and it will lvl up just did it with a lvl 33 is now 41, and last night did it with a lvl 9 save game I got here from Bella, here\\'s how I did it. \r\nload your game! check and write down your health stamina, magicka, stats for sneak onehanded etc, mainly so you can check afterwards. Make a save, not a quick save! delete all auto saves and exit game. \r\nNext go to My Documents, my games, skyrim, here you will find your saves folder, before opening it make a new folder ( call it saves vanilla or something ) now open your saves folder and Cut and Paste everything in there to the new folder you just created! you should now have an empty folder. \r\nNow go to the new folder and Copy and Paste just the latest save you made back into your saves folder. \r\nNow load this mod, esp prefrably near or at the bottom for now of your load order. \r\nStart game it may take a while to load once it has maybe go through a door or fast travel to get an auto save, then press the console key, the one below Esc ( uk board) and type showracemenu hit enter, when race menu appears press console key again the next bit so far as I can see is the important bit it\\'s also where your memory needs to be good as to what your char looked like if you intend to have it look the same. \r\nYou now need to find the slider that says presets! and alter it, you will probably get a warning saying you will lose your settings click ok ( you may have to select another race in the case of Yaksha only one preset, then go back, at this point you should notice that your char has it\\'s hands in front in the bound position, thats because the game has reset your char, you shouldn\\'t loose any perks, but if you have messed with the stamina, enchant lvl\\'s via the console it will put them back to where they would have been and you will have to reset them. you can now redo your char as per the start of the game or change race if so desired, if this is your first time tho I suggest keeping changes to minimum and use the exact same name, \r\nOnce done make a new save and delete all the other ones includin auto ones, maybe exit game then restart. \r\nIf it goes pear shaped at least you will have the originals to fall back on enjoy!\r\n\r\nUpdate: This file is no longer a gameplay effect and change since the \\\"legendary patch\\\" do the same thing.... only difference is that this mod do the same job way faster than without mods cause to have the same effect without mod, you have to pass a skill legendary 147 times.",
  "categoryId": "40",
  "version": "1.0",
  "author": "Kevin Nadeau",
  "createdUnix": "1326572319",
  "updatedUnix": "1326572362",
  "containsAdultContent": false,
  "uploadedBy": "lquebecois",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19807",
      "name": "level up faster",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "level up faster-6186-1-0.rar",
      "uploadedUnix": "1326572362",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/06fceb282ed908ca050cbd96b568ac32251c1dbc7716e96646e0ef5bfd43756e/analysis/1406611026/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/level%20up%20faster-6186-1-0.rar?fid=19807&ttl=1535763442&ri=8192&rs=8192&setec=5fe14fb1d78f8a134ada93f9695af7a8"
    }
  ]
}