{
  "modId": 61887.0,
  "modName": "More Crafting Possibilities",
  "summary": "Adds a lot of new possibilities with crafting",
  "descriptionHtml": "I made this mod because I did&#39;t find the existing crafting mods exactly to my liking.\r<br />\r<br />[color=#9fc5e8][size=4]What does it do?[/size][/color]\r<br />This mod allows you to melt or degenerate a lot of misc. items and types of armor and weapons. \r<br />\r<br />[b][color=#9fc5e8][size=4]How does it work?[/size][/color][/b]\r<br />First, you gather the items required. When melting some items, you will need more than one. You will for example need 10 forks for 1 iron ingot.\r<br />Next, you need to find the barrel which holds various crafting-rings.\r<br />Equip the right ring, and start smelting your items&#33;\r<br />Beware though, that you will need the right smithing-perk. If you for example want to smelt glass armor, you need the glass smithing perk.\r<br />\r<br />You can smelt items into ingots in the smelter, and degenerate items into leather, firewood or paper rolls on the tanning rack.\r<br />\r<br />[color=#9fc5e8][size=4][b]Where to find the rings?[/b][/size][/color]\r<br />You can find the rings behind the forge of Whiterun.\r<br />\r<br />[color=#9fc5e8][size=4][b]Why these rings?[/b][/size][/color]\r<br />The list with things you can make was getting very long. Because there was no alternative for the crafting-menu, and I don&#39;t know how to change menus, I came up with this as a solution.\r<br />The list was getting so long because all &#39;recipes&#39; that use different &#39;ingredients&#39;, even though the give the same result, will have to be listed separately. \r<br />\r<br />[color=#9fc5e8][size=4][b]What can I melt?[/b][/size][/color]\r<br />Pfew, that&#39;s a lot. \r<br />All of the craftable armors and the guard-armors. (Not Nightingale, Dark Brotherhood and some others)\r<br />All craftable weapons. (Again, not the special ones)\r<br />A lot of misc. items, like lanterns, cups, candlesticks, bowls etc. \r<br />You can&#39;t &#39;melt&#39; ingredients or food, and also no regular clothing or robe, since this would make the list way to long to be used. \r<br />\r<br />[color=#a4c2f4][size=4][b]How did you make the choices on how many ingots you get?[/b][/size][/color]\r<br />Partially by looking at what you need in order to craft them, and partially by using common sense.\r<br />I didn&#39;t look at prices, though. It is, in my opinion, perfectly reasonable that things will be worth more or less if you degenerate them. \r<br />Oh, and a word of warning: you can turn septims into a gold ingot, but not the other way around. (It is unlikely that everyone could just make septims on their own.)\r<br />\r<br />[color=#9fc5e8][b]I made this mod mainly for myself, so I won&#39;t be taking requests, unless I find them usefull too.[/b][/color]",
  "categoryId": "24",
  "version": "1.00",
  "author": "ErianDragonborn",
  "createdUnix": "1421852437",
  "updatedUnix": "1421852433",
  "containsAdultContent": false,
  "uploadedBy": "ErianDragonborn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000143904",
      "name": "UltimateCraftingMod - ErianDragonborn",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "UltimateCraftingMod - ErianDragonborn-61887-1-00.zip",
      "uploadedUnix": "1421852433",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/b1fbdafd5d5f9f3d4b03c09d8644106f82ea3f2b3c425d1db2c99b5ef552aa90/analysis/1421859603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UltimateCraftingMod%20-%20ErianDragonborn-61887-1-00.zip?fid=1000143904&ttl=1535850490&ri=8192&rs=8192&setec=dde4ef3a20547079fd9c8a8f70815bce"
    }
  ]
}