{
  "modId": 6188.0,
  "modName": "Simpler Jewel Craft pack and ideal changes",
  "summary": "craft circlets, and two new gems to craft rings and neckalces, more realistic crafting...........",
  "descriptionHtml": "Simpler JewelCraft pack\r<br />\r<br />Description:\r<br />\r<br />In short this mod adds several craft-able circlets/necklaces/rings to skyrim forging/blacksmithing stations; see pictures for recipes also more pics in download for recipes too many pics to upload;\r<br />\r<br />This mod was originally made by happy_spike and all the credit and thanks goes to him.\r<br />http://www.skyrimnexus.com/downloads/file.php?id=1042\r<br />\r<br />What i did was edit stats/remove some of the original items because it was becoming too complex-ish of a mod and i wanted to keep it really simple. the original mod had a lot of good ideas so that is the template for this one.\r<br />\r<br />===Ideas i kept/modified/fixed original mod issues to suite my opinion of craft-able jewelry:\r<br />\r<br />1. kept recipe for charcoal and raised the amount made from 1 Firewood = 5 charcoal  (made more sense to me for fire wood is heavy so can have more charcoal)\r<br />\r<br />2. kept recipe for steel ingot (changed recipe to 2 Iron ore and 2 charcoal) (vanilla was iron ore and corundum ore which is not as accurate as happy_spikes ideas is)  \r<br />\r<br />3. kept steel circlet and elven circlet but changed location to jewelry (not steel/elven menu), removed the armor value to 0 and the perk set it had to none (it would not give much protection same like other circlets, makes more sense to me to only have it enchanted by the player)  \r<br />\r<br />4. kept the new gems as gem; topaz , gem; flawless topaz and gem; onyx , gem; flawless onyx\r<br />\r<br />5. Kept copper ingot and ore as ingot; copper (instead of vanilla Corundum ingot) and ore; copper \r<br />\r<br />(the renaming in numbers 4 and 5 above are done so to comply with this simple sorting mod by Valdacils Item Sorting which i recommend:\r<br />   http://www.skyrimnexus.com/downloads/file.php?id=4873     )\r<br />\r<br />==Ideas i removed from original mod was bugy/issues and to suite my opinion of craftable jewelry:\r<br />\r<br />1. removed the recipes for ebony and jade jewelry (wasnt my taste, too many varieties as is)\r<br />\r<br />2. removed all skull type pendents (too much; wanted it to be unique as Necromancer Amulet)\r<br />\r<br />3. removed all trinities Talisman (too much for me)\r<br />\r<br />4. removed nightingale amulet (too unique, didn&#39;t understand why it needed a daedra heart to craft?????)\r<br />\r<br />5. removed all charms (dibella, arkay, talos....etc..)(these seem iconic to me and so are unique)\r<br />\r<br />6. removed both statues of dibella (same as charms also see no use for it)\r<br />\r<br />7. removed the making/finding of rough, flawed, quality, and perfect gems; now only flawless and normal gems (like vanilla simple)\r<br />\r<br />8. removed Moldavite ingot and ore rename back to vanilla Malachite because it makes more sense to me (I read it up at wikipedia...thus vanilla felt more accurate)\r<br />\r<br />9. removed ancient nordic amulet (wanted to keep it but it was not working...did not appear in jewelry menu; coulnd&#39;t fix it)\r<br />\r<br />\r<br />This mod is for those like me who only want simpler parts of happy_spike&#39;s mod but can&#39;t mod, this edit was only done for my personal use but friends asked for it so I posted it, again all actual work was done by happy_spike so all thanks goes to him.\r<br />\r<br />See pictures for Crafting Recipes.\r<br />\r<br />\r<br />Installation (Manual): \r<br />- Download the main file \r<br />- Open the main archive and move the &#34;Simpler JewelCraft pack.esp&#34;, the textures, meshes, to Skyrim data directory. (These are all the files required)  \r<br />   c;&#92;program files&#92;the elder scrolls v skyrim&#92;data\r<br />- Make the game load the esp by checking the tick-box next to the newly added esp when starting skyrim  see DATA FILES option\r<br />\r<br />\r<br />\r<br />Uninstallation (Manual):\r<br />- Remove the &#34;Simpler JewelCraft pack.esp&#34; file from the &#34;Data&#34; folder in your Skyrim directory.\r<br />- Remove the Meshes&#92;Armor&#92;AmuletsandRings and textures&#92;Armor&#92;AmuletsandRings folder\r<br />\r<br />\r<br />Have not had any bugs/issues but if there are comment, i am new to modding  so dont expect miracle fixes.\r<br />\r<br />Comment, endorse its all good, All THANKS  GOES TO happy_spike so check out his other great mods.\r<br />\r<br />You may use this mod so long as you mention it origins and creators.",
  "categoryId": "60",
  "version": "1.0",
  "author": "davnat and happy_spike",
  "createdUnix": "1326574416",
  "updatedUnix": "1326574850",
  "containsAdultContent": false,
  "uploadedBy": "davnat",
  "primaryFile": null,
  "files": [
    {
      "fileId": "19818",
      "name": "Simpler JewelCraft pack",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26321",
      "fileName": "Simpler JewelCraft pack-6188.rar",
      "uploadedUnix": "1326574850",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/05f2d20248a34e5e955bc801c7b700e646f18e4c890f24ec5cc58976372c15e3/analysis/1406611094/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simpler%20JewelCraft%20pack-6188.rar?fid=19818&ttl=1535763444&ri=8192&rs=8192&setec=c724e20d336d6e73f598fad6f12519bd"
    }
  ]
}