{
  "modId": 61922.0,
  "modName": "Realistic Movement Speed Reduction",
  "summary": "This mod aims to bring backwards- and sideways running movement speed closer together and reach more realistic levels. This mod slows the backwards movement speed by roughly 15 % - but the sideways and sidestepping movement speed is reduced by 33 %. It also reduces movement during combat to more realistic levels&#33;",
  "descriptionHtml": "[b][u][size=5]QUICK OVERVIEW\r<br />[/size][/u][/b][size=3][b]\r<br />[/b]This mod aims to bring backwards- and sideways [i]running[/i] movement speed closer together and reach more realistic levels. I have always hated the fact that if you ran backwards and to the side, you can run a lot faster than if you&#39;d run straight backwards. This mod slows the backwards movement speed by roughly 15 % - but the sideways and sidestepping movement speed is reduced by 33 %. The result is that running backwards is just slightly slower than running back sideways or sidestepping.\r<br />\r<br />In the vanilla game or with other mods like this you can sidestep backwards a lot faster than you can run backwards, which is very unrealistic and makes moving and backpedaling in combat seem a bit mechanic. Some mods reduce the backup movement speed even more, which further fuel this problem. With this mod installed however, the difference between running backwards and sidestepping backwards is very small and doesn&#39;t have to be accounted for. This mod also slows down movement speed while Casting spells, Attacking, Shooting or running with a Bow, Shield charging, and Swimming. Vanilla [i]walking[/i] speeds and general balance between weapons and magic is intact.\r<br />\r<br />[b]These changes are very realistic in my opinion, in reality a human can run much faster straight backwards than sidestepping backwards or sideways. The problem with Skyrims speedfactor is that it&#39;s based on 4 directions, but you can run in 8. So to lower the sidestepping backwards, you have to modify the sideways running speed. I believe this mod is a perfect balance between backpedaling, sidestepping and sideways running.\r<br />\r<br />[/b]The effect of this mod is that combat positioning is now more important and you can no longer run circles around enemies or run backwards and blast enemies with your spells etc. This affects all humanoid NPC&#39;s and the Player. Combat now requires more caution, whether you&#39;re casting spells, using a bow or meleeing.\r<br />\r<br />\r<br />\r<br />[size=3]\r<br />[u][size=5][b]DETAILED MODIFICATIONS\r<br />\r<br />[/b][/size][/u][size=3][b]1) B[/b]ackwards running speed is reduced by ~15 %, Sideways running is reduced by ~33 %. [/size]These changes are &#34;global&#34; and affect all forms of humanoid movement (even swimming and sneaking, but not walking), [u]in addition to this[/u], several types of movement has been further reduced to make combat and movement feel more realistic and dangerous.\r<br />\r<br />2) ALL running movement while attacking with any melee weapon is slowed by 15 % compared to vanilla values. Twohanded weapons are still slower than Onehanded weapons, they are both reduced equally.\r<br />\r<br />3) ALL running movement while casting magic, shooting arrows, using Ranger and Block Runner is slowed by 15 %.\r<br />\r<br />This means that backwards running while casting magic is reduced by 15+15 = 30 %. And sideways reduced by 33+15 = 48 %. Keep in mind though that this mod makes combat of all forms more difficult, as you are easily surrounded and it&#39;s harder to dodge attacks. But this applies to the enemy as well, NPC&#39;s can no longer abuse their movement speed while attacking.[/size]\r<br />\r<br />\r<br />\r<br />\r<br />[b][u][size=5]OPTIONAL FILES\r<br />[/size][/u][/b][size=3][b]\r<br />[/b]The mod[/size] contains two versions, one that keeps Vanilla walking speeds with the exception of combat movement and aims to modify [i]running speed[/i] only.\r<br />\r<br />The other version combines this mod with some settings from [url=http://www.nexusmods.com/skyrim/mods/32229/?]Realistic Humanoid Movement Speed[/url] mod, which makes NPC&#39;s walk faster and sneak a bit slower. However, the original mod Realistic Humanoid Movement Speed makes you walk considerably faster when you block or draw a bow for example, and also reduces your forward running and sprinting speed. These settings have not been included as they hardly can be called realistic and can shift the balance in combat. While blocking you need to keep your balance intact and drawing a bow requires great strength, it&#39;s natural to move slower while you do this. Not to mention it&#39;s damn near impossible to hit enemy NPC&#39;s with arrows or spells if you INCREASE the movement while drawing a bow, since enemy NPC&#39;s are scripted to move sideways constantly while firing arrows or spells. Also by reducing the forward run and sprint speed the game becomes more tedious, and it&#39;s harder to close the gap for melee players and NPC&#39;s.\r<br />\r<br />IMO the faster walking version is realistic, but the problem with Skyrims walking speed lies in the tiny steps that humanoids take, increasing the walking speed means even more tiny steps and makes NPC&#39;s look like they are in a hurry - especially guards. I prefer to use vanilla walking speed for this reason, it&#39;s simply the lesser of two evils.\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][b][u]COMPATIBILITY[/u][/b][/size]\r<br />\r<br />[size=3]* Should be compatible with any mod that doesn&#39;t directly change movement speed of humanoids. The mod is only a minor change to some numbers in the CK.\r<br />\r<br />[/size]\r<br />\r<br />\r<br />[b][u][size=5]RECOMMENDED TO USE WITH\r<br />[/size][/u][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/30073/?][b]Immersive Potions[/b][/url] - Modifies all instant restoration potions to heal over time and makes them non-stackable. If a new potion with the same effect (heal, stamina or magicka restoration) is used, it will overwrite the current potion. There are a couple of mods with the same features, but this one is unique in several aspects. Totally script-free 7kb download.\r<br />[/size]\r<br />\r<br />\r<br />\r<br />[b][size=3]Enjoy[/size]&#33;[/b]",
  "categoryId": "24",
  "version": "3",
  "author": "Nastakanoth",
  "createdUnix": "1421947717",
  "updatedUnix": "1422304462",
  "containsAdultContent": false,
  "uploadedBy": "nastakanoth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144719",
      "name": "Realistic Movement Speed Reduction v.3",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Realistic Movement Speed Reduction 3.0-61922-3.rar",
      "uploadedUnix": "1422292958",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/017db781109d6aef49a6c1fc1a96ec425341298a08a0a4bb1bc71f7ba8a78888/analysis/1422292986/",
      "changelogHtml": " Increased movement speed while attacking from -25 % to -15 %. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Movement%20Speed%20Reduction%203.0-61922-3.rar?fid=1000144719&ttl=1535850531&ri=8192&rs=8192&setec=265ef9a3309edb5eb57011aac8396aa7"
    },
    {
      "fileId": "1000144745",
      "name": "Realistic Movement Speed Reduction With Faster Walking v.3",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Realistic Movement Speed Reduction With Faster Walking 3-61922-3.rar",
      "uploadedUnix": "1422304462",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/d6f6266fb0d85b5b6b44fb29ba1db3de056be7bcee64b816791a704bfc67a4b8/analysis/1422304503/",
      "changelogHtml": " Increased movement speed while attacking from -25 % to -15 %. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Movement%20Speed%20Reduction%20With%20Faster%20Walking%203-61922-3.rar?fid=1000144745&ttl=1535850532&ri=8192&rs=8192&setec=17e0fe39f2908bf4e1e3303e63b499a5"
    }
  ]
}