{
  "modId": 61921.0,
  "modName": "Improved Magic Settings",
  "summary": "Changes Dualcasting cost from 2.8 to 2.5 and effectiveness from 2.2 to 2.5. Basically a must to make dual casting Alteration, restoration, destruction etc worth picking by itself. This mod also changes Combat magicka regeneration to 50% instead of 33%, so that you can rely slightly more on Magicka regen instead of -100% cost enchantments.",
  "descriptionHtml": "[b][u][size=5]QUICK OVERVIEW\r<br />[/size][/u][/b][size=3][b]\r<br />[/b]1) Changes Dualcasting cost from 2.8 to 2.5 and [size=3]effectiveness from[/size] 2.2 to 2.5. Basically a must to make dual casting restoration, destruction etc worth picking and using by itself.\r<br />\r<br />2) Combat magicka regeneration has been increased to 50% (up from 33%) to make Magicka regen more viable, so that you can rely slightly more on Magicka regen instead of -100% cost enchantments.\r<br />\r<br />3) Max resistances reduced to 70% (down from 85%) so that enemy spells are not trivialized with 97% (0.15*0.15) reduction. Now if you stack Magic and Elemental resistances you can reach a maximum of 0.3*0.3= ~90% reduction. Still a lot, but 3 times more damage taken compared to Vanilla.\r<br />\r<br />\r<br />\r<br />[b][u][size=5]RECOMMENDED TO USE WITH\r<br />\r<br />[/size][/u][/b][url=http://www.nexusmods.com/skyrim/mods/61919/?][b]Improved Mage Armor Spell[/b] [/url]- Adds 25% duration to all Mage armor spells. Adds +20 Armor rating to each spell level (scales with Mage armor perk) and changes Dragonhide to add 150 Armor rating over a longer duration instead of the 80% reduction.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/61927/?][size=3][b]Improved Mage Light (Candlelight and Magelight)[/b][/size] [/url][size=3]- Reduces the magnitude (brightness) of Candlelight and Magelight with 50 % to avoid the blinding effect, but doubles the radius. Vanilla settings are too bright when looking at a short distance, and you can&#39;t see far at all because of the low radius. Also increases the duration of Candlelight with 25 %. Does not modify the cost or color of the spells at all. Allows you to see clearly at any time or place in Skyrim - without getting a headache.[/size]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/30073/?][size=3][b]Immersive Potions[/b][/size][/url][size=3] - Modifies all instant restoration potions to heal over time and makes them non-stackable. If a new potion with the same effect (heal, stamina or magicka restoration) is used, it will overwrite the current potion. There are a couple of mods with the same features, but this one is unique in several aspects. Totally script-free 7kb download.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/61922?][b]Realistic Movement Speed Reduction[/b][/url] - This mod aims to bring backwards- and sideways running movement speed closer together and reach more realistic levels. This mod slows the backwards movement speed by roughly 15 % - but the sideways and sidestepping movement speed is reduced by 33 %. It also reduces movement during combat to more realistic levels&#33;\r<br />\r<br />\r<br />\r<br />[b]Enjoy&#33;[/b][/size][/size]",
  "categoryId": "93",
  "version": "1",
  "author": "Nastakanoth",
  "createdUnix": "1421947707",
  "updatedUnix": "1421942016",
  "containsAdultContent": false,
  "uploadedBy": "nastakanoth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144051",
      "name": "Improved Magic Settings",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Improved Magic Settings-61921-1.rar",
      "uploadedUnix": "1421942016",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4020878224000651ec4a8e98f97b4de78bfdda505d8116450737f8c04642cdd5/analysis/1421942046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Improved%20Magic%20Settings-61921-1.rar?fid=1000144051&ttl=1535850530&ri=8192&rs=8192&setec=b15904027d2bada680360cc4cb179003"
    }
  ]
}