{
  "modId": 61936.0,
  "modName": "Draconian Race",
  "summary": "*Female version now out* Adds a (Vampire Compatible) Draconic race to the game. Choose between Tail with Argonian Powers, No Tail With Argonian Powers, Tail with Draconian Powers, and No Tail With Draconian Powers",
  "descriptionHtml": "[b][u][size=6]Draconian Race[/size][/u][/b]\r<br />I always thought that it was a bit boring that the Dragonborn looks just like the common Man/Mer/Cat/Lizard, so when I stumbled across Drachis&#39; amazing Argonian Re-texture, I decided to make it into a custom race. This is what crawled out of my computer 17 hours later (I didn&#39;t know how to mod, and baptism by fire seems to have worked). It is Vampire compatible and is modular with a choice of [u][b]four versions[/b][/u], Tail and Argonian Powers, No Tail and Argonian Powers, Tail with Draconic Powers, and (My personal favorite) No Tail with Draconic Powers. All four versions come with custom made textures for both the body [b][u]and[/u][/b] eyes (Female version uses vanilla argonian eyes).\r<br />\r<br />EDIT: This has been out for over a year now and none of you told me I spelled Argonian as Argonain. To think that I trusted you...\r<br />\r<br />[s]Sorry ladies, but I didn&#39;t create a female version. If I get any requests, then I will make one, but I don&#39;t play female characters so it wasn&#39;t a priority and I&#39;m a wee bit lazy.\r<br />[/s][b][size=3]Female version now out&#33;[/size][/b]\r<br />\r<br />[size=3]Credit for all textures goes to Drachis here on the Nexus. Find his mod [url=http://www.nexusmods.com/skyrim/mods/981/?]Here[/url].[/size]\r<br />\r<br />[size=5][b][u]Powers (Requires Dragonborn):[/u][/b][/size]\r<br />[size=2]When[/size] I made the powers I was balancing them for myself (I&#39;m greedy like that I guess), so if they seem a bit OP it&#39;s because I use ASIS, Perkus Maximus, WTF Encounter Zones, and a boatload of other combat mods that make the game a LOT harder. The Greater power is a bit strong, but I really wanted the Dragon Aspect magic effect, and I couldn&#39;t figure out how to create a new effect that uses those. If I figure it out then I will update the mod, but don&#39;t count on it because I&#39;m not too concerned with it since I almost never remember to use active abilities anyway. Also, I know that they&#39;re probably somewhat op in vanilla*, but I honestly haven&#39;t played vanilla in so long that I don&#39;t know what [i]would[/i] be balanced.\r<br />*Vanilla meaning you don&#39;t have a racial overhaul such as SkyRe-Races installed.\r<br />\r<br />EDIT: I have been told that several individuals think the powers are balanced as-is, thus I am adding the &#34;Fair and Balanced&#34; tag to this mod.\r<br />[u][size=3]Active - Draconic Wrath (Once a Day):[/size][/u]\r<br />[i][b]For 30 seconds:[/b][/i]\r<br />[size=2]Power attacks do 25% more damage\r<br />25% Fire and Frost Resistance\r<br />10% Cooldown reduction on shout timer\r<br />Fire cloak does 15 Points Fire Damage/Second to nearby enemies[/size]\r<br />50 Armor Rating (on top of Hardened Scales passive)\r<br />\r<br />[size=3][u]Passive - Hardened Scales:[/u][/size]\r<br />50 Points bonus Armor Rating\r<br />\r<br />[size=3][u]Passive - Reflective Scales:[/u][/size]\r<br />15% Magic Resistance\r<br />\r<br />[size=5][u][b]Skill Bonuses:[/b][/u][/size]\r<br />I wanted to give the player as many options as possible and keep on par with other races by giving the player 35 bonus skill points just like the vanilla races, and since the vanilla Argonians have horrendous skill bonuses (+10 lock-pick? Really Bethesda?), I went with a good &#34;Jack-of-all-trades&#34; skill bonus, so you get:\r<br />[b]+15 Smithing\r<br />+15 Enchanting\r<br />+5 Speech[/b]\r<br />(The speech bonus was influenced by the D&D Dragonborn race. If you&#39;ve never played it I highly recommend trying it with friends.)\r<br />\r<br />[size=5][b][u]Installation:[/u][/b][/size]\r<br />Download with NMM or MO\r<br />Activate the mod (File structure should be fine already, but checking it is good practice)\r<br />Check [u][b]ONE[/b][/u] Esp (If you pick more than one then you&#39;ll get multiple copies of the race in race select and you won&#39;t be able to tell which version you are choosing)\r<br />Done.\r<br />[size=5]\r<br />[b][u]Compatibility:[/u][/b][/size]\r<br />It&#39;s [s]literally[/s] technically a re-skinned copy of the Argonian race (without a tail and/or with new powers and skill bonuses depending the version you installed), so it should be compatible with everything. You shouldn&#39;t get any clipping or invisible armor issues with anything that would work on a standard Argonian, in fact I guarantee you won&#39;t because I used Argonian as the Armor Race; the body you see is considered by the CK to be an armor set that is equipped as the skin for the race (this is literally the only way to give your custom race a custom texture. I personally think it&#39;s kind of stupid that we have to do it this way, but it&#39;s the only way so whatever lol). The only reason you would get a bug with this is if a custom armor mod doesn&#39;t have Argonian checked as a valid race. If that&#39;s the case then you will be able to equip it, but you will be invisible wherever the mod would cover your body because the texture will fail to render.\r<br />\r<br />EDIT: I suppose anything that changes the flame cloak magic effect and dragon aspect magic effect will also affect this, but I can&#39;t think of a mod that directly alters either of these things, and I would assume that the changes would be purely cosmetic due to the method in which I utilized these resources.\r<br />\r<br />It will also work with anything that modifies vampires as long as it doesn&#39;t [i]really[/i] muck up the scripting involved in changing into/out of vampirism (since turning into/out of a vampire is actually just a race change). The vampire compatibility script was, for the most part, made as a modding resource by Expired6978 (the RaceMenu guy), and if you don&#39;t trust me you sure as hell can trust him.\r<br />[size=4][b]\r<br />TL;DR[/b][/size]\r<br />I bet my back-most left molar that this thing is compatible with everything.\r<br />\r<br />[u][b][size=5]Bugs:[/size]\r<br />[/b][/u]I didn&#39;t find any, and I played 8 hours into a character (Who is a vampire) before uploading. I was using a boatload of mods as well, so the compatibility was reassured to me.\r<br />\r<br />Credit for all textures goes to Drachis here on the Nexus. Find his mod [url=http://www.nexusmods.com/skyrim/mods/981/?]Here[/url].",
  "categoryId": "34",
  "version": "1.1",
  "author": "Tango Drango",
  "createdUnix": "1421992030",
  "updatedUnix": "1422083802",
  "containsAdultContent": false,
  "uploadedBy": "TangoDrango",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144159",
      "name": "Draconic Race v1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8726",
      "fileName": "Draconic Race v1.0-61936-1-0.zip",
      "uploadedUnix": "1421988605",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7ea004a75108323945ab0b0a66c6c23a11a25f0a2adbc7b4fbe7b95eb8398345/analysis/1421988667/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draconic%20Race%20v1.0-61936-1-0.zip?fid=1000144159&ttl=1535850558&ri=8192&rs=8192&setec=2a9e647d1ac4fa0b3aa1ae8d7eb82694"
    },
    {
      "fileId": "1000144321",
      "name": "Draconic Race v1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11807",
      "fileName": "Draconic Race v1.1-61936-1-1.zip",
      "uploadedUnix": "1422083802",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b6efded0d77ba51aef676f731e3e5afe4cddafa84d11fa4ddd06a252fabce0f2/analysis/1422083826/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draconic%20Race%20v1.1-61936-1-1.zip?fid=1000144321&ttl=1535850558&ri=8192&rs=8192&setec=b9cc69b03da4cf5c1df617b2d8d6e574"
    }
  ]
}