{
  "modId": 61960.0,
  "modName": "Friend Or Enemy",
  "summary": "FOE is a mod that allows the player to look at a character or enemy in-game and obtain some useful information about him, her or it. The information is displayed on the top left corner of the screen. This mod is for people who want immersive information before attacking an unaware target. This prevents you from attacking an innocent or somebody or ",
  "descriptionHtml": "FOE is a mod that allows the player to look at a character or enemy in-game and obtain some useful information about him, her or it. The information is displayed on the top left corner of the screen. \r<br />\r<br />All of this is done in an immersive way. \r<br />\r<br />All you have to do is press the configurable Perception hotkey. \r<br />\r<br />Indeed, FOE adds a configurable hotkey through a MCM config menu. Once it is configured by you, what you just need to do is aim at the character or enemy you want information about and press the perception hotkey to check whether the target looks for instance peaceful or hostile to the player. \r<br />\r<br />Maybe you want to know if the target is stronger or weaker than you? Well pressing the perception hotkey will let you know whether your target will be more or less dangerous. Whether you want to fight or not is your choice. \r<br />\r<br />This mod is for people who want immersive information before attacking an unaware target. This prevents you from attacking an innocent or somebody or something too powerful for you.\r<br />\r<br />Requirements: \r<br />\r<br />Skyrim \r<br />Dawnguard\r<br />Hearthfire\r<br />Dragonborn\r<br />SKSE (latest version possible) \r<br />Sky UI with MCM (latest version possible)",
  "categoryId": "24",
  "version": "1.0",
  "author": "Hjorr",
  "createdUnix": "1422049181",
  "updatedUnix": "1422049144",
  "containsAdultContent": false,
  "uploadedBy": "Hjorr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144261",
      "name": "Friend Or Enemy",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Friend Or Enemy-61960-1-0.7z",
      "uploadedUnix": "1422049144",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/206acaddc3ec371dca16526a73fc0896741eb56f3154853e88c4f57c951f43c1/analysis/1422049202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Friend%20Or%20Enemy-61960-1-0.7z?fid=1000144261&ttl=1535850595&ri=8192&rs=8192&setec=12d6ea4a8a8788bcc5318b9d61f50764"
    }
  ]
}