{
  "modId": 61982.0,
  "modName": "Specialised Faction Services",
  "summary": "This mod adds two unique services provided by every faction such as assassination by the dark brotherhood or moneylending by the thieves guild.",
  "descriptionHtml": "[b][center][/center][size=5]Warning&#33;[/size]\r<br />[/b]This mod is still in alpha and as such much is uncompleted, many things might still have temporary names and you may experience issues. This mod also makes heavy use of scripts and I am fairly new to modding and scripting (some of the first scripts I ever wrote are in this mod), if you don&#39;t know what dangers that entails you should find out. The current version of this mod is not necessarily aimed at the casual modded TES player but instead mostly aimed at providing this mod to those who really want something like this and don&#39;t want to wait, to have people do more testing for me because I&#39;m a lazy bastard and I may have overlooked problems in my own testing and finally to see if people have suggestions or other feedback for this mod (such as functions they want to see). As such I highly encourage people to post any suggestions they have in the posts section of this mod even if the service seems to already be taken by something else you like. In addition this is the first time I&#39;ve uploaded a mod of this size, so anything I missed uploading in the 7zip file should be mentioned immediately. Any issues experienced can be posted in the posts section.\r<br />\r<br />[center][img]http://i58.tinypic.com/1zzja7k.png[/img][/center]\r<br />\r<br />\r<br />[b]\r<br />[img]http://i61.tinypic.com/314e0qx.png[/img]\r<br />[/b]This mod adds 2 unique services that are provided by each of the various guilds of Skyrim. Personally, I was tired of being able to join guilds and yet never being able to make use of their services and like many others ever so easily accumulated wealth, well this mod aims to change both. You also gain a bonus for the services (such as a discount) when you become a member of a guild and another when you become the leader. It should be noted that some NPCs like the jarl of Whiterun can refuse you their services if their disposition towards you is too low, or you do not have sufficient speechcraft (in the future you will hopefully be able to turn this feature on or off with the MCM menu). This mod has an MCM menu (provided of course that you have SKSE and SkyUI installed) that allows it to be heavily adjusted to your preference (things such as the cost of services can be adjusted) though this menu is currently limited to adjusting the squire, page-boy, the mechanics of the moneylender and adjusting the prices of the Dark Brotherhood services. If there are any functions you&#39;d like to see for this mod, feel free to post them in the posts section too. I cannot make any promises as to how much support I can give for this mod or how much I&#39;m going to improve it/add to it in the future since it&#39;s been a while since I&#39;ve modded and busy times are ahead of me.\r<br />Currently the following versions work: The Page-Boy (Incomplete), The Squire (Incomplete), The Moneylender (Complete), Assassinations (Incomplete) and Kidnapping (Incomplete).\r<br />\r<br />\r<br />\r<br />[b][img]http://i59.tinypic.com/2iij4p5.png[/img]\r<br />Servants[/b]\r<br />The Jarl can provide you with one of three servants (though currently only 2 have been added) who are weak in combat but can preform unique functions and do not add to follower count (though you can only have one servant at a time):\r<br />*The Page-Boy: This NPC will follow you around and can carry a torch for you, hold some of your things in his backpack, make you dinner once every day and hold your favourite weapon or shield which can be retrieved with a single dialogue option (in the future I might have it auto-equippable when you enter combat).\r<br />*The Squire: This NPC will follow you around and can carry a torch for you, hold more of your things in his backpack, make you dinner three times every day, grant you a potion once every day, grant you a lower tier levelled weapon or shield or staff once every day, hold your favourite weapon or shield which can be retrieved with a single dialogue option, can retrieve your horse for you (though this function is currently incomplete) and can be commanded to go sell everything you put in his backpack and then return (though this function is currently also incomplete). In the future I hope to figure out how to give him a limited levelled ability to improve your weapons for you.\r<br />*The Henchman: An improved version of the above with limited combat abilities. Currently not in the game and may be scrapped.\r<br />\r<br />[b]Armies[/b]\r<br />The Jarl of Whiterun might eventually be able to provide you with an army in a location for a limited duration as well. Though this is currently not in the mod and may be scrapped.\r<br />\r<br />\r<br />\r<br />[b][img]http://i60.tinypic.com/23tm329.png[/img]\r<br />Moneylending[/b]\r<br /> A new NPC called Lilide the Moneylender will appear in the thieves&#39; guild&#39;s hideout and can provide you with money that you pay back within a certain alloted time with interest. A more advanced description can be obtained in game by asking her for an explanation of what she does (at which point you will recieve a note) or can be read off of the screenshot with the note above.\r<br />\r<br />[b]Procuring[/b]\r<br />Currently the theives guild has no second function. One idea I had was to add a &#34;procurer&#34; of objects, however I was unsure of how I could do this. If anyone has any hints on that or any alternative ideas, please leave them in the posts section.\r<br />\r<br />\r<br />\r<br />[b][img]http://i62.tinypic.com/4v4kns.png[/img]\r<br />[/b][b]Assassination[/b]\r<br />If you preform the black sacrament by gathering the necessary ingredients (nightshade, a human heart, human flesh and a human skull) and then reading the book &#34;A Kiss Sweet Mother&#34; the next time you sleep you&#39;ll be visited by the speaker. If you are a Dark Brotherhood member simply walking up to Astrid and asking to make use of the guild&#39;s services is now possible instead of preforming the black sacrament. Regardless of the way you contact the speaker after talking to her you can then choose to have her assassinate someone of your choosing whom you select with a scroll that you are given (called &#34;Assassination Contract&#34;). Lower value targets (like beggars or citizens without businesses) cost little, mid value targets (like citizens who own property or guild members) cost more and high value targets (like guards and guild leaders) cost a lot. After the scroll is cast you will have to wait a while and will eventually be delivered a note that says the job is done. \r<br />Though the normal version of this can no longer be used after Astrid dies, the listener of the dark brotherhood will now be granted &#34;Mark for Assassination&#34; as a lesser power instead. This lesser power can be cast at will (though only one target can be chosen at a time) and will automatically select the cheapest option (lowest cost will always be paid for a low level target, middle cost will always be paid for a mid level target and high level cost will always be paid for a high level target). The listener also gets a further discount for the service and doesn&#39;t have to pay upfront, instead paying the required amount to the courier after the job is done.\r<br />Currently assassinations will always succeed, however I hope to eventually add a risk factor with a chance of them failing and in addition to that another, smaller chance that the guards will even track the contract to you. The chance of failure would be higher, the more high value the selected target was and adjustable with the MCM menu.\r<br />The MCM menu also allows you to set the prices of each level of target, set the discounts of both members and the listener and grant yourself the listener lesser power or ingredients for the black sacrament at will (though this is intended only for troubleshooting).\r<br />\r<br />[b]Kidnapping[/b]\r<br /> If you preform the black sacrament by gathering the necessary ingredients (nightshade, a human heart, human flesh and a human skull) and then reading the book &#34;A Kiss Sweet Mother&#34; the next time you sleep you&#39;ll be visited by the speaker. If you are a Dark Brotherhood member simply walking up to Astrid and asking to make use of the guild&#39;s services is now possible instead of preforming the black sacrament. Regardless of the way you contact the speaker after talking to her you can then choose to have her assassinate someone of your choosing whom you select with a scroll that you are given (called &#34;Assassination Contract&#34;). Lower value targets (like beggars or citizens without businesses) cost little, mid value targets (like citizens who own property or guild members) cost more and high value targets (like guards and guild leaders) cost a lot. After the scroll is cast you will have to wait a while and will eventually be delivered a note that says the job is done at which point you can travel to and enter the abandoned shack near Solitude. You can then go inside and see the kidnapped target with a bag over his head. You can then do whatever you wish to them and even talk to them to try and procure various things such as a permanent discount at their store (though this torture system is currently unfinished) through intimidation attempts. The chance of them giving you what you want depends on their health percentage, your intimidation and speech.\r<br />Though the normal version of this can no longer be used after Astrid dies, the listener of the dark brotherhood will now be granted &#34;Mark for Kidnapping&#34; as a lesser power instead. This lesser power can be cast at will (though only one target can be chosen at a time) and will automatically select the cheapest option (lowest cost will always be paid for a low level target, middle cost will always be paid for a mid level target and high level cost will always be paid for a high level target). The listener also gets a further discount for the service and doesn&#39;t have to pay upfront, instead paying the required amount to the courier after the job is done. Currently kidnapped targets are still brought to the abandoned shack, however in the future I hope to be able to change this to the Dark Brotherhood torture chamber in the Dawnstar sanctuary instead.\r<br />Currently kidnappings will always succeed, however I hope to eventually add a risk factor with a chance of them failing and in addition to that another, smaller chance that the guards will even track the contract to you. The failure might then also cause the kidnapped target to have lowered disposition towards you permanently. The chance of failure would be higher, the more high value the selected target was and adjustable with the MCM menu.\r<br />The MCM menu also allows you to set the prices of each level of target, set the discounts of both members and the listener and grant yourself the listener lesser power or ingredients for the black sacrament at will (though this is intended only for troubleshooting).\r<br />\r<br />\r<br />[b][img]http://i59.tinypic.com/o89e77.png[/img]\r<br />Mercenaries[/b]\r<br />One idea I had was that the companions guild would temporarily send either some people to a specific location or give you some temporary extra followers that can exceed the follower limit. This function is not currently in the game and alternate suggestions are appreciated.\r<br />\r<br />[b]Clearing Out[/b]\r<br />One idea I had for this was that the fighters guild clears out a dungeon for you, killing every being inside for a high price. It would then remain clear until the game refreshed it. This function is not currently in the game and alternate suggestions are appreciated.\r<br />\r<br />\r<br />\r<br />[b][img]http://i62.tinypic.com/nd05n4.png[/img]\r<br />Enchanting[/b]\r<br />One idea I had was the ability for them to enchant things that would depend on their skills and perks rather than yours. Not currently sure of how to accomplish this however and not sure whether that would make enchanting too useless. Alternate suggestions are appreciated.\r<br />\r<br />[b]Clairvoyance[/b]\r<br />One idea I had for it was that they can basically find a random quest for you for a small amount of pay. I don&#39;t know how to make this work yet and I&#39;m certainly not married to this idea, as such alternate suggestions are once again appreciated.\r<br />\r<br />\r<br />\r<br />[b][img]http://i58.tinypic.com/6pol51.png[/img]\r<br />Travelling Bard[/b]\r<br />This servant, who doesn&#39;t add to follower count (but instead a servant slot like the page-boy or squire), can be engaged in dialogue and ordered to perform a song for you (with different songs giving you different boosts similar to what a shrine may confer) outside of battle or to go off and spread your legend throughout the hold (conferring discounts, unique dialogue options and causing guards to pass up minor crimes). You can choose to have him spread a different legend depending on the dialogue option you choose (the dialogue options available depend on feats you&#39;ve accomplished such as ending the stormcloak rebellion or becoming the leader of the college of winterhold). Partial credit to [url=http://www.nexusmods.com/skyrim/users/9937060]GrimmRex[/url] and [url=http://www.nexusmods.com/skyrim/users/13069030]AiD72[/url] for the second idea.\r<br />\r<br />[b]Tall Tales[/b]\r<br />You can call upon the collective travelling experiences of the bards within the college in order to locate a random area on the map of a single type (you can choose to locate a cave, Dwemer ruin, Nordic ruin, Camps, Daedric Shrines, Standing Stones or Land Marks) which will then be marked on your map. The amount of gold required depends on the rarity of the place (with the common caves costing the least and standing stones the most). For extra gold the bard personally guides you there, fast-travelling you to the location. The Bard can also tell you the exact route to journey to any of the major cities or villages in the land (allowing you to fast travel there immediately). Thank you to [url=http://www.nexusmods.com/skyrim/users/1104613]damijanx[/url] for giving me this idea.\r<br />\r<br />[img]http://i61.tinypic.com/23w9lqe.png[/img]\r<br />[b]Major Incompatibilities[/b]\r<br />These are incompatibilities which will cause CTDs or otherwise make the game and/or mod(s) unplayable.\r<br />-None currently known.\r<br />\r<br />[b]Minor Incompatibilities[/b]\r<br />These are incompatibilities which may cause minor glitches.\r<br />-[url=http://www.nexusmods.com/skyrim/mods/51473/?]iNeed[/url]: May interfere with the ability to sell drinking water to the player. Reported by [url=http://www.nexusmods.com/skyrim/users/372640/?]yzerman19[/url]. \r<br />\r<br />[size=5]My other mod(s):\r<br />[/size][b][url=http://www.nexusmods.com/skyrim/mods/61533/?][img]http://i61.tinypic.com/2nbhe7c.png[/img][/url]         [/b][url=http://www.nexusmods.com/skyrim/mods/75059/?][img]http://oi64.tinypic.com/351ednb.jpg[/img][/url]",
  "categoryId": "25",
  "version": "1.3",
  "author": "OneOnOne1162",
  "createdUnix": "1422126782",
  "updatedUnix": "1422976057",
  "containsAdultContent": false,
  "uploadedBy": "OneOnOne1162",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144395",
      "name": "Specialised Faction Services 1.1 Alpha",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "71",
      "fileName": "Specialised Faction Services 1.1 Alpha-61982-1-1.7z",
      "uploadedUnix": "1422126775",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/bbe86d26af0a8f192521ae3bcb96531f079bc2af6670e13465dc5bfa7a00668a/analysis/1422126783/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Specialised%20Faction%20Services%201.1%20Alpha-61982-1-1.7z?fid=1000144395&ttl=1535850628&ri=8192&rs=8192&setec=862a22792666ffffb2f147b6bd5b7a7d"
    },
    {
      "fileId": "1000145418",
      "name": "Specialised Faction Services 1.2 Alpha",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74",
      "fileName": "Specialised Faction Services 1.2 Alpha-61982-1-2.7z",
      "uploadedUnix": "1422729907",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/21d1deaf82f5d145e06543dd43be65b764e565ac435b5e83e9890eec332430b4/analysis/1422729963/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Specialised%20Faction%20Services%201.2%20Alpha-61982-1-2.7z?fid=1000145418&ttl=1535850628&ri=8192&rs=8192&setec=42bac19108f7167f5205ea6448914a17"
    },
    {
      "fileId": "1000145884",
      "name": "Specialised Faction Services 1.3 Alpha",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79",
      "fileName": "Specialised Faction Services 1.3 Alpha-61982-1-3.7z",
      "uploadedUnix": "1422976057",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/50845676ce739e7c794e54fcaee4b79e38690b3513fbdbcea44eb6e234f93d9a/analysis/1422976084/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Specialised%20Faction%20Services%201.3%20Alpha-61982-1-3.7z?fid=1000145884&ttl=1535850629&ri=8192&rs=8192&setec=aa605cd5b68124431026277230d4a1c8"
    }
  ]
}