{
  "modId": 62044.0,
  "modName": "New Followers Chip and Tyrone",
  "summary": "This mod adds two new marriage enabled followers based off of my characters to the game, a nord warrior and a khajiit rouge. ",
  "descriptionHtml": "Major update coming soon&#33; In the next few days I will be working on custom silent dialog for both Ty and Chip. There is tons of work to be done so it could be up to a week or more, but things are soon starting to go more smoothly. The drawback to this update is they won&#39;t have a voice, but the silent voice file I am using gives plenty of time to read it. But they will feel more like a real pair of friends with their own story and desires and a reason how a khajiit and nord befriended each other. \r<br />\r<br />Hello all and thank you for viewing. This is my first follower mod but I have been testing, tweaking and improving it for about two weeks before I decided to upload it. This mod adds two followers based off of my main characters in Skyrim, one a nord the other a khajiit. \r<br />\r<br />They are camping up at High Hrothgar, to the left before you enter the monastery. You will see their tent and campfire.They wear normal clothes when you meet them, but they also carry magical weapons and armor. If you think the equipment is overpowered you can just take it from them and give them what you wish.\r<br />\r<br />The Khajiit, Chip is a dual weilding archer, though she prefers her bow first. She won&#39;t effect your stealth meter and has the lightfoot perk, so she won&#39;t set off pressureplate traps. She can also shout a few limited shouts. You may marry her as well.\r<br />\r<br />The Nord, Tyrone is a two handed warrior, but prefers light armor. He can also shout and you may marry him. He will effect your stealth meter though, as I figured it would seem more realistic considering his size and all. But he won&#39;t set off pressureplates either. I have made him a bit taller then most nords, but after weeks of playing with him at that size, I haven&#39;t had any problems yet.I tried my best to make them bug-free, but if you run into any problems feel free to let me know. Both of them shouldn&#39;t die on you. \r<br />\r<br />I hope you all enjoy. \r<br />\r<br />There shouldn&#39;t be any requirements as they are just using the main game assets. At one point I did load the esp in the CS with the DLCs, but they use no assets so hopefully it won&#39;t mess with anything if you don&#39;t have all the DLCs.",
  "categoryId": "96",
  "version": "1.0",
  "author": "Wolflady500",
  "createdUnix": "1422311839",
  "updatedUnix": "1422311205",
  "containsAdultContent": false,
  "uploadedBy": "Wolflady500",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144756",
      "name": "Main File.",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13391",
      "fileName": "Main File.-62044-1-0.zip",
      "uploadedUnix": "1422311205",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eaa6d3939c305b00a0ee7c9092194df1657026724738a11831fc4b42083031ce/analysis/1422311230/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File.-62044-1-0.zip?fid=1000144756&ttl=1535850736&ri=8192&rs=8192&setec=79e776b16e256690b2e8369511678109"
    }
  ]
}