{
  "modId": 62066.0,
  "modName": "Smaug&#39;s Wrath",
  "summary": "This mod adds a new spell to the game called Smaug&#39;s Wrath.",
  "descriptionHtml": "Ever wanted to feel like Smaug? Well now you can&#33; \r<br />I&#39;ve added a spell to the game called: Smaug&#39;s Wrath. Its a reworked version of Firestorm, dealing alot more damage and ignoring wards and reflects. To balance the damage, the casting time is 11.2 seconds, effectively making it a high risk, high reward spell, as most mages dont have alot of armor or health. It also adds a new line to the game. \r<br />\r<br />[b][i]Where to find the spell book:\r<br />[/i][/b]To find the book, go to Riverwood Trader in, you guessed it, Riverwood. In the shop, under the stairs to the left you will find some barrels. On top of the barrels is Smaug&#39;s Wrath&#39;s Spell book.\r<br />\r<br />\r<br />Please take in consideration that this is my first mod, so be nice, but critique is welcome. \r<br />\r<br />If you find any bugs or other peculiar things, leave a comment down below or pm me and I will look into it. \r<br />\r<br />Have fun&#33;\r<br />\r<br />EDIT: For people saying that 11.2 seconds casting time is too long to be justified, allow me to explain my reasoning behind it.\r<br /> The main reason I made this mod was to add Smaug&#39;s &#39;&#39;I am fire, I am death&#39;&#39; into the game. Yup it takes 11 seconds to say that. To justify such amount of casting time, I upped the damage by alot, and it also ignores wards and reflects, which makes it an uncounterable spell to most enemies, except if they have a crapload of magic resist. This kinda makes it a high risk, high reward spell. I dont really want people spamming it in battles, since there is no counterplay to it and it deals tons of damage.\r<br />\r<br />But thats just my two cents on my own mod. Feel free to leave comments debating this, but I cant nor will I make promises that I will change it in the future. (But im not saying I wont change it in the future)\r<br />\r<br />Yours truly,\r<br />\r<br />FryingDutchman",
  "categoryId": "75",
  "version": "1.0",
  "author": "FryingDutchman",
  "createdUnix": "1422365783",
  "updatedUnix": "1422365776",
  "containsAdultContent": false,
  "uploadedBy": "FryingDutchman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144832",
      "name": "Smaug&#39;s Wrath",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3252",
      "fileName": "Smaug's Wrath-62066-1-0.rar",
      "uploadedUnix": "1422365776",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4a872670decf0f9e5386f8acda832f8e60b5a491c7b356614165ed56ac2145d1/analysis/1422365825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smaug%27s%20Wrath-62066-1-0.rar?fid=1000144832&ttl=1535850771&ri=8192&rs=8192&setec=087d371f2bfce0937df7f4c5838a1473"
    }
  ]
}