{
  "modId": 62077.0,
  "modName": "Ingredient Potency Reworked",
  "summary": "Makes rarer ingredients more useful for alchemy.",
  "descriptionHtml": "Does it make sense to you that the heart of a daedra, a powerful inhabitant of another dimension, has the same healing power as blisterwort, a mushroom that you can find growing inside the safety of city walls; or that by using a thistle branch, a common weed, and a white cap, another mushroom, you can create a fortify heavy armor potion that is just as strong as one made from ice wraith and sabre cat teeth? If not, and you want alchemical rewards to be more in line with the difficulty of obtaining them, or just want an actual reason to pay a few hundred gold for an ingredient when you can get one that&#39;s less than ten that has the same effect, you&#39;ve come to the right place. This mod tweaks the strength of ingredients based of difficulty of acquiring them. Plants at the bottom, butterflies and fish a bit better, prey animals (elk, deer etc) stronger than butterflies and fish, aggressive animals (bear, sabre cat etc.) stronger than prey, and a few hard to get ingredients are even more powerful. \r<br />\r<br />This mod only changes vanilla ingredients, as such DLC ingredients, and ingredients added by other mods should not be affected.\r<br />\r<br />Questions or comments, let me know.",
  "categoryId": "94",
  "version": "",
  "author": "Irishlutheran",
  "createdUnix": "1422416483",
  "updatedUnix": "1422416388",
  "containsAdultContent": false,
  "uploadedBy": "irishlutheran",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000144900",
      "name": "Ingredient Potency Reworked",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Ingredient Potency Reworked-62077-.zip",
      "uploadedUnix": "1422416388",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4717ab782bc1ba416c3fa3dfd54041e37c67184177678e3058afe2e816bc14d5/analysis/1422416343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ingredient%20Potency%20Reworked-62077-.zip?fid=1000144900&ttl=1535850786&ri=8192&rs=8192&setec=74bcee6bfe6980839cac7db39911d570"
    }
  ]
}