{
  "modId": 62124.0,
  "modName": "Deadly Mutilation Turkish Translation",
  "summary": "Deadly Mutilation V1.3.3 CORE Turkish Translations",
  "descriptionHtml": "Warning: this mod contains excessive violence and gore. \r<br />\r<br />[size=3][b]Introduction:[/b][/size]\r<br />This mod’s main goal is to give a new more spectacular look to Skyrim’s combat, without intervention into basic game-play balance. No tricks like damage, skills, perks or AI modification. Only visual ice-cream on the cake. \r<br />More intensity, realism and new feeling while fighting. Make NPCs die in various ways depending on the cause of the death. Feel the power in your weapon: dismember, decapitate, eviscerate. Spill blood of your enemies, make them scream out of pain, spread their intestines and brains all over the place. Burn them to charred corps, freeze into ice block and smash in pieces. Cause terrible wounds, convulsions, head explosion or carbonization with lightning. \r<br />All this is present in this mod. Enjoy.\r<br />\r<br />\r<br />\r<br />[size=3][b]How it works :[/b][/size]\r<br />The chance of the mutilation is configurable through MCM menu, yet there are certain limitations and conditions to fill. All depend from weapon you carry and movement you execute.\r<br />\r<br />[i][u]Moving power attack:[/u][/i]\r<br />-   Sword, axe, dagger, mace, war hammer   –&gt;   cut off arm\r<br />-   Great sword, great axe   –&gt;   cut in half horizontally\r<br />-   Werewolf   –&gt;   everything is possible\r<br />\r<br />[i][u]Stand power attack:[/u][/i]\r<br />-   Sword, axe, dagger, great sword, great axe   –&gt;   eviscerate vertically\r<br />-   mace, war hammer   –&gt;   eviscerate vertically or/and crush head\r<br />-   Werewolf   –&gt;   everything is possible\r<br />\r<br />[i][u]Normal attack:[/u][/i]\r<br />-   Any melee weapon   –&gt;   cut off arm\r<br />\r<br />* Moving and standing attack detection system is not yet 100% certain. You may trigger moving power attack effect when execute standing power attack and inverse. However it works correctly in most cases. It takes a little second for script to realize that actor is not moving.\r<br />* Enchanted weapons will diminish a bit your chances to trigger mutilation. Because enchantment can kill the actor before physical damage and prevent script executing.\r<br />* Any actor equipped with matching weapon can cause gory death. But player must be near.\r<br />* Magic is not affected by random chance and works all the time if possible.\r<br />\r<br />[size=3][b]Other useful information and functionality:[/b][/size]\r<br />-   Works for all NPCs of all humanoid races except old people, children, essential and protected.\r<br />-   Player is immunised to all kind of effects(for being too buggy)\r<br />-   Cut in half, evisceration and dismemberment may occur only on NPCs wearing one of the \r<br />supported armors such as:[u]Fur, Elven, Forsworn, Hide, Studded, Imperial, Iron, Stormcloaks\r<br />and guards armors, Necromancer and Warlock robes.[/u]\r<br />-   Some of the effects can stack and replace one each other.\r<br />-   Bodies cut in half or smashed in pieces can not be reanimated.\r<br />-   Head crush works on any character\r<br />-   To work properly Thalmor robe was split. Hood and robe can be worn separately.\r<br />\r<br />[size=3][b]Requirements: [/b][/size]\r<br />[size=3][u]SKSE[/u][/size]\r<br />[size=3][u]SkyUi 3.4 [/u][/size]\r<br />\r<br />\r<br />[size=3][b]Installation[/b][/size]\r<br />1.Remove older version if you have any.\r<br />2.Go to isolated(preferably interior) place with no NPC around dead or alive. Also fire your follower or leave him/her outside.\r<br />3.Save game\r<br />4.Install main core of the mod first. Copy files in your Skyrim “Data” folder or use Mod Manager. \r<br />5.Install one of the meshes pack at you choice. CBBE or Vanilla. Symply copy to Data folder.\r<br />6.(Optional) Install alternative skeletons from skeletons packs, for compatibility with other mods you use.\r<br />7.Do &#34;reset players effects&#34; through MCM configuration menu first time you run Skyrim and save game.\r<br />6.That&#39;s it, enjoy\r<br />\r<br />[size=3][b]*Important*[/b][/size]\r<br />Mod will be automatically applied on all new coming characters, but it will effect already existing NPCs later. After NPC was reset and reloaded. Simply travel far enough , it should be good at your return. Still not working? Try to do reset player’s effects throught configuration menu. Make sure you have all files copied where they should. Try to reinstall it manually. Still nothing? Track down the incompatibilities.\r<br />\r<br />[size=3][b]Performances[/b][/size]\r<br />This mod will NOT cause a serious FPS drop but high performance configuration is recommended. \r<br />\r<br />[size=3][b]Recommended mods:[/b][/size]\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=601]Realistic Ragdolls and Force[/url] (don&#39;t forget compatible skeleton provided here)\r<br />[url=http://skyrim.nexusmods.com/mods/17214]No Spinning Death Animation[/url] \r<br />[url=http://skyrim.nexusmods.com/mods/60/?]Enhanced Blood Textures[/url] or [url=http://skyrim.nexusmods.com/mods/12798/?]Crimson Tide[/url] \r<br />Whant more blood? You may also like : [url=http://skyrim.nexusmods.com/mods/35318/?]BLEED - A Blood Overhaul[/url] \r<br />\r<br />[size=3][b]Compatible:[/b][/size]\r<br />-Compatible with Dance of death\r<br />-Compatible with Burn, freeze, chock effects.\r<br />-Supports alternative blood and decals textures. \r<br />-Supports any armor retexture mod.\r<br />-Works with custom weapons and spells.\r<br />-Supporting CBBE bodies and outfits.\r<br />-No full support for UNP and Better males yet, but it works together. Deadly mutilation does not replace body meshes.\r<br />-Supports XP32, 1HD Full, ATTT, DSpSoB skeletons(patch is provided here)\r<br />\r<br />[size=3][b]Non compatible:[/b][/size]\r<br />-Will conflict with any mod replacing skeleton. Game will crash if using improper skeleton.\r<br />-Will conflict with mods modifying races. In that case be sure to put Deadly Mutilation at the end of the load order.\r<br />\r<br />\r<br />\r<br />[size=3][b]Known bugs[/b][/size]\r<br />-NPC wearing some kind of suit covering all body and head will end up butt naked upon head crush.\r<br />-Remains of the bodies may stuck floating in the air when game loaded. Reload you save game right away should fix that and make it fall to the ground as it should.\r<br />-Burned corpses are skinned in a rush. Raised as zombies they will look weird while holding weapons.\r<br />-When looting corpses they may disappear for a little moment before reappear naked.\r<br />\r<br />[size=3][b]Credits and contributions:[/b][/size]\r<br />Alternative skeletons pack by skulltyrant, SM4SHaZ\r<br />Thanks to Doraks for soundFX\r<br />Thanks to pauderek for help in compatiblity improovment and bugs hunting.\r<br />Female body and armor meshes used – Calientes Female Body Mod Big Bottom Edition\r<br />\r<br />[size=3][b]Permissions [/b][/size]\r<br />You MUST contact me and obtain my explicit permission before re-upload, modify or use any of the assets.",
  "categoryId": "28",
  "version": "1.3.3",
  "author": "tomriddle",
  "createdUnix": "1422625114",
  "updatedUnix": "1422625025",
  "containsAdultContent": false,
  "uploadedBy": "tomriddle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000145206",
      "name": "Deadly Mutilation Turkish Translation",
      "version": "1.3.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6296",
      "fileName": "Deadly Mutilation Turkish Translation-62124-1-3-3.zip",
      "uploadedUnix": "1422625025",
      "modVersion": "1.3.3",
      "virusScanUrl": "https://www.virustotal.com/file/c3c749b9f5e1a55358d999368125edb4b6e73bbf66aa1706b092ab02dde7d772/analysis/1422625086/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Deadly%20Mutilation%20Turkish%20Translation-62124-1-3-3.zip?fid=1000145206&ttl=1535850842&ri=8192&rs=8192&setec=6c904313c7b10e2a8f48c7da6dd19ec2"
    }
  ]
}