{
  "modId": 622.0,
  "modName": "Immersive 360 Controller with 8 Hotkeys - Expanded Edition",
  "summary": "Now you can finally seamlessly access all 8 hotkeys, quicksave and access the Magic, inventory, Map and Perk menu from the 360 controller with just the push of a button.\r\n\r\nWho needs a keyboard when you can do it all from your controller?",
  "descriptionHtml": "Immersive 360 Controller with 8 Hotkeys - Expanded Edition v1.5\r\n\r\n\r\n\r\nInstalling and Updating: Extract the file on the \\\"The Elder Scrolls V Skyrim\\\" directory, overwriting the old file if updating, then once in game go to options, controls and click Y to restore the controls to the defaults settings to enable the hot keys.\r\n\r\n\r\n\r\n---Description---\r\nFor some reason us poor 360 owners are left with only 2 hotkeys, how can a company\r\nmake such an amazing game and make such a horrible easily avoidable decision is beyond me, this mod \r\naddresses that issue by enabling all 8 hotkeys with the 360 controller, now you can finally seamlessly\r\naccess all 8 hotkeys, use the quicksave feature and access the Magic, Inventory, Map and Perk menu from the 360 controller with\r\njust the push of a button.\r\n\r\n\r\nWhat this file does is:\r\n\r\n1.Change the D-PAD on the 360 controller to be able to activate all 8 Hotkeys, you will\r\nnow have to use the Left control stick to navigate the favorite menu, the D-Pad will still\r\nscroll on all other menus normally.\r\n\r\n\r\n2.The hotkey can be activated by just pressing the D-pad, the\r\nother 4 are activated by pressing the D-Pad direction while holding the \\\"LB\\\" key.\r\n\r\n\r\n3.Disabled the \\\"wait\\\" button on the main version, I always found it unrealistic that you could rest 4 feet away\r\nfrom a hostile enemy for many many hours to regenerate life, magic and stamina and the enemy\r\nwould never notice you, don\\'t they patrol the area? I guess trying to figure out if they left\r\nthe iron on back at home is more important than the 7 foot, 600 pound orc wearing full plate armor and\r\nwielding a 12 foot axe forged from the very fire of hells that is very obviously giving you the\r\n\\\"Once I regenerate I am going to use your and your childrens head as a cup\\\" look.\r\n\r\n\r\n4.The \\\"back\\\" button is now used to manage the \\\"Favorites\\\" menu.\r\n\r\n\r\n\r\nD-Pad Hotkey Assignment:\r\nLeft=1\r\nRight=2\r\nUp=3\r\nDown=4\r\n\r\nLB+Left=5\r\nLB+Right=6\r\nLB+Up=7\r\nLB+Down=8\r\n\r\nA+Start=Quicksave\r\n\r\nIf using the rest enabled version: \r\nLB+Back=Wait\r\n\r\nIf using expanded version:\r\nA+Left=Inventory Shotcut\r\nA+Right=Magick Shortcut\r\nA+Up=Perk Shortcut\r\nA+Down=Map Shortcut\r\n\r\nVersion history:\r\n1.5 Added 2 new version, these extended versions can access the Map, inventory, perk, and magic menu by pessing A pluse\r\nthe appropiate direction. \r\n1.3 Changed the button presses to quicksave as it was causing sprinting problems with LB, quicksave has\r\nnow been changed to A+Start\r\n1.2 Added quicksave function by pressing LB+Start.\r\n1.1 Added optional file with wait enabled by pressing LB+Back.\r\n1.0 Initial Release\r\n\r\n\r\n\r\nUninstall:\r\nRemove the file, and go to control options and restore they buttons to default. \r\n\r\n\r\n\r\nThanks:\r\ncrazy-g, NVShacker. Without them I would still be using the favorites menu with only 2 hotkeys.\r\n",
  "categoryId": "78",
  "version": "v1.5",
  "author": "Beyonder",
  "createdUnix": "1321675256",
  "updatedUnix": "1321800984",
  "containsAdultContent": false,
  "uploadedBy": "Beyonder",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1988",
      "name": "Immersive 360 Controller with 8 Hotkeys - Expanded Edition",
      "version": "v1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "89",
      "fileName": "Immersive 360 Controller with 8 Hotkeys - Expanded Edition-622-v1-5.zip",
      "uploadedUnix": "1321800984",
      "modVersion": "v1.5",
      "virusScanUrl": "https://www.virustotal.com/file/462c56fe65ece8cb1e7890752d3625477de788ee171923ed4155de5b05d8c715/analysis/1406425323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20360%20Controller%20with%208%20Hotkeys%20-%20Expanded%20Edition-622-v1-5.zip?fid=1988&ttl=1535753640&ri=8192&rs=8192&setec=b6ab08fbaa88353a513cc84f089ea044"
    }
  ]
}