{
  "modId": 62239.0,
  "modName": "Vlammenzee&#39;s Glass weapons retextured",
  "summary": "This is a retexture of the Glass weapon set.",
  "descriptionHtml": "After having played skyrim over the years, I never really liked the look of the glass weapons, they just looked too plain to me, and I never used them on any of my playthroughs.\r<br />\r<br />That changes now after my retexture, be gone with the dull looking glass weapons&#33; I&#39;ve spent a painstaking amount of time on each weapon separately to get them to my liking, I quite like a realistic look to my modded skyrim, not too much of a bright/oversaturated world, just keeping it real, so I made the weapons as close as possible to those specifications.\r<br />\r<br />Glass weapons are made out of refined malachite, the malachite has a blue/green glow to it, so I wanted to make the weapons look more like that.\r<br />\r<br />First of all the green glass is replaced with a blue glass, but I didn&#39;t want to just get rid of ALL the green, no no, I wanted to keep a good mixture of blue/green with blue being the main color, this effect ended up really nice in game, when the reflection of the sun hits it, or just any lighting reflection a nice shade of green glows over the blue color, just to add more depth really.\r<br />\r<br />The metal is also retextured, I didn&#39;t want to just do some simple contrast/saturation balancing, no I wanted to give the metal a lot more detail.\r<br />\r<br />I&#39;ll definitely be using glass weapons now in my current/future playthroughs, as it brings a whole different dimension to the game. \r<br />\r<br />This is my first retexture that I&#39;m uploading, I will probably do the Glass armor set aswell to match the weapon set, this will have to wait for now though, \r<br />but I&#39;ll start working on that within the next month or so, after all modding is addictive, I just want to get back to playing now lol :).\r<br />\r<br />\r<br />[b]Installation:[/b]\r<br />\r<br />Just drop the downloaded files in your skyrim folder.\r<br />\r<br />[b]Additional information:[/b]\r<br />\r<br />Extracted the textures from the Official skyrim HD texture pack.\r<br />\r<br />I&#39;m not using a Enb in my skyrim, i&#39;m using [url=http://www.nexusmods.com/skyrim/mods/13049/?]Imaginator[/url] instead, i&#39;ve added a text file with my imaginator settings, just in case.",
  "categoryId": "55",
  "version": "v1",
  "author": "Vlammenzee",
  "createdUnix": "1422873471",
  "updatedUnix": "1422873366",
  "containsAdultContent": false,
  "uploadedBy": "Vlammenzee",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000145712",
      "name": "Vlammenzee&#39;s Glass Weapons Retexture v1",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29723",
      "fileName": "Vlammenzee's Glass Weapons Retexture v1-62239-v1.zip",
      "uploadedUnix": "1422873366",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/69b831f3a4d56e0ec8840b74bfcf3d4f285d3cc8e730562bfb23f6bfec589c28/analysis/1422873443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vlammenzee%27s%20Glass%20Weapons%20Retexture%20v1-62239-v1.zip?fid=1000145712&ttl=1535850952&ri=8192&rs=8192&setec=f52e69cd3bc8ff7422446c61ff3f32a3"
    }
  ]
}