{
  "modId": 62326.0,
  "modName": "Skyrim Guardians",
  "summary": "Adds 21 stalwart defenders to towns",
  "descriptionHtml": "_______________________________________________\r<br />\r<br />** BOTH Dawnguard and Dragonborn DLC&#39;s are required&#33; **\r<br />\r<br />_______________________________________________\r<br />\r<br />Get the second part of the mod here&#33; http://www.nexusmods.com/skyrim/mods/62475/?\r<br />_______________________________________________\r<br />\r<br />What is this?\r<br />\r<br />This mod adds 21 unique NPCS to all the main cities and all settlements in Skyrim; I felt that when vampires or dragons came around and murdered everyone in the village, I felt like I was missing out on storyline. \r<br />\r<br />So, in a completely lore friendly way, I added these NPCS to the game so that they can protect the villages and towns, but they don&#39;t get in your way.\r<br />\r<br />Each NPC added by this mod is a seasoned adventurer, so don&#39;t think &#34;Oooh&#33; She&#39;s/He&#39;s got an ebony sword&#33; Let me kill him/her and take it.&#34;\r<br />\r<br />Don&#39;t do it; there are no words to describe what they will do to you. Not that they will outright, remember: they are there to PROTECT the town. :)\r<br />\r<br />Each NPC is at level 35 and levels up from there, so they never become obsolete.\r<br />\r<br />________________________________________________\r<br />\r<br />FLUFF N STUFF\r<br />\r<br />An unlikely band of adventurers, soldiers, mercenaries, and even assassins have banded together in the face of terrible news: Dragons running amok, vampires murdering people openly on the streets, and rumors of people losing their wills completely to a faceless menace wielding the power of a daedric lord, these brave individuals have rallied together to ensure that, relatively at least, Skyrim will be defended from all attacks.\r<br />\r<br />\r<br />1. Hundur Avhallen (Male Nord, Whiterun): A Nord to the core, Hundur has taken it upon himself to use his awesome strength to defend his hometown of Whiterun from attack. Hundur has mixed feelings about the civil war plaguing his homeland, and expresses great regret in not choosing sides; his loyalty to the empire is tested against his feelings over what he believes is the Nord right to rule Skyrim ...\r<br />\r<br />2. Gaius Upremo (Male Imperial, Riften): A former captain of the Imperial army, Gaius killed many elves during the Great War, saving a fellow orcish soldier from the sword thrust of a Dominion footman. As a reward, the orc forged Gaius a suit of personalized orcish armor which has kept him safe since.\r<br />\r<br />3. J&#39;zahnyu (Male Khajiit, Shor&#39;s Stone): Very little is known about this pale-as-the-snow cat, who speaks in riddles. One thing is for sure, though: the blade he wields is exceptionally deadly, capable of carving through armored foes as though they were nothing. Even more mysterious still is the fact that he never seems to sharpen it ...\r<br />\r<br />4. Koronos Tsumarak (Male Dark Elf, Ivarstead): A former initiate of the Morag Tong, Koronos slew the master training him for an unknown reason. The event has left the dark elf scarred, and Koronos know seeks redemption by ridding evil from the land. Young by dunmer standards and of fiery temperament, he hopes to gain wisdom from the masters of the tongues themselves, all to become a more balanced -and deadly- warrior.\r<br />\r<br />5. Frakk Fire-Eye (Male Orc, Markarth): Ruthless, deadly, and unforgiving, Frakk represents the hatred of the Guardians. He thinks nothing of crushing those who run afoul of him, his friends, or the law. He says little, preferring to let his mace do the talking. You cross this orc at your peril.\r<br />\r<br />6. Ariel Moonbeam (Female Wood Elf, Falkreath): A former hunter, Ariel has taken up bow and dagger against the forces of darkness that shroud Skyrim. After finding the daemonic weapons that marked her flesh with strange red runes in an explosion of daedric power, Ariel now fights two battles: The battle for the security of Falkreath from those that lurk within its dark forests, and the evil spirit that now lurks within her soul.\r<br />\r<br />7. Wardruna Ice-Flesh (Female Nord, Riverwood): Wardruna has known conflict all her life. A former imperial conscript, Wardruna soon turned into a vigilante, hunting down and slaying bandits whereever she found them. She wears her scars with pride, and is as hard as they come. Many men have thought less of her because of her gender, and have attempted to take her by force. They now wait in the afterlife to apologize to her in passing when her time finally comes.\r<br />\r<br />8. Hosou Hlaalu (Female Dark Elf, Snow Shod Farm): Born with unusually colored eyes, Hosou was destined for great mastery over magic. She instead took up the blade after studying the ways of combat under the skaal, honing her blade all over Solstheim. She escaped after she too feared the loss of her mind and her will.\r<br />\r<br />9. Arinolonar (Male High Elf, Solitude): A massive warrior who has taken up blade over spell, Arino harbors feelings of mistrust and even hatred towards the Nords. In his mind, they are all barbarians who have only brought suspicion and ruin to Tamriel. He defends Skyrim not for the Nords, but for all others who live under their oppression.\r<br />\r<br />10. Frees-The-Rudder (Male Argonian, Karthwasten): A former assassin, Frees has decided to put his blade to better use after his last assignment had him kill a dwemer research fanatic. After this mad scientist nearly ended his life, Frees decided that the life of a guard was preferable to being carved up a second time by a Dwemer construct. His former assassin&#39;s guild, however, is not pleased.\r<br />\r<br />11. Nianah (Female Khajiit, Dawnstar): Nianah pursued an assassin deep inside a crypt once, but what she found inside forever changed her. Although she is young, she speaks with the wisdom of one double her age. Nianah was the one who originally developed the idea of the guardians, an idea she holds as true as her blade.\r<br />\r<br />12. Yenazzah (Female Khajiit, Kynesgrove): A merciless killer, Yenazzah adopted the ways of the Code of Malacath and lives by them like a creed. Only those who are worthy of her blade are felled by it, a practice that makes even her allies wary of her. Consequently, She and Frakk developed a friendship.\r<br />\r<br />13. Raven Corax (Female Imperial, Winterhold): A saucy imperial war mage, Raven has pulled from active service and now resides in Winterhold. Perhaps a bit condescending, her insecurities rival her prickliness. Of absolute certainty is her command of magic, and there are none who wish to push her too far.\r<br />\r<br />14. Fiona Drakkengard (Female Breton, Dragonbridge): A breton of Highrock, Fiona comes from an influential family. Wanting little of betrothal and marriage politics, Fiona ran away from home and became an adventurer. Her breton blood and noble upbringing have given her a mastery of magic few mages can contend with, which she uses upon her enemies with extreme prejudice.\r<br />\r<br />15. Swims-The-Streams (Female Argonian, Rorikstead): Very little is known about this argonian, only that she keeps her gaze to the north, as though posessed. She speaks in short phrases when asked a question, but never truly answers. \r<br />\r<br />16. Skjoll Stonegaze (Male Nord, Windhelm): A hardy and war-like Nord, there are few who can cross blades with Skjoll. Named after his piercing stare, Skjoll oddly does not share the racist views of the other Nords of Windhelm towards anyone who isn&#39;t a Nord. He does, however, fall to casual racism but without malice, only jest.\r<br />\r<br />17. Kai Marro (Male Redguard, Morthal): Originally part of Kematu&#39;s crew, Kai was seperated from his brothers after a bandit raid and, barely clutching to life, managed to survive the wilds of Skyrim using nothing more than his wits. After such a close brush with death, Kai has come to find peace and solitude within the marshes of Morthal, a peace he will defend with his life.\r<br />\r<br />18. Eywyver Bronze-Eye (Male Wood Elf, StoneHills): Eywyver is an old wood elf who has embraced the traditions of his people, including the cannibalism that so many outsiders view as sickening and appalling. A veteran of three wild hunts, Eywyver was included only out of desperation, as most of the other guardians eye him with suspicion. His conniving smile belies an inner hunger, not unlike the grin a wolf would give to a flock of sheep.\r<br />\r<br />19. Saahra the Whisperer (Female Redgaurd, Nightgate Inn): An adventurer from the sands of Hammerfell, Saahra&#39;s inspiration is that of gold, not of honor. As such, she distastes the post she has been given in the frozen north of the Pale, but every now and then a bandit raid serves to boil her blood by spilling theirs. \r<br />\r<br />20. Athera Sunyearn (Female High Elf, DarkWater Crossing): Athera commands a mastery of magic that is far more than someone her age should have been able to achieve, but despite this fact Athera is quite modest, an exceptionally rare quality for a high elf.  Athera makes no secret of her amorous interest in Nord men, despite the irony of their racial histories. Truly unique.\r<br />\r<br />21. Bendyne Thunderfingers (Male Breton, Old Hroldan): A kind and if somewhat aloof wizard from High Rock, Bendyne is really more of a curiousity among the guardians than a true stalwart protector. He often speaks to himself as though engaged in actual conversation, but one thing all those who know of him agree on is this: he has a most unusual and uncanny ability to predict where trouble will happen, and exactly what to expect. Perhaps his \r<br />invisible friend that he speaks to is not simply a figment of his imagination ...  \r<br />\r<br />____________________________________________________\r<br />\r<br />Installation:\r<br />\r<br />Drag and Drop\r<br />\r<br />I am using Xenius&#39; High Quality Eyes mod, so ... It&#39;s not required, but if you want them to look like they do in the screenshots, GO GET IT.\r<br />\r<br />I also added a bat file; this way you can summon all of them with console command, you know, just for fun. (You have to modify the bat file in order to get it to work, though. No biggy, just type in help in the console command and see where SoG is in the load order, then replace the XX with the number of that load order)\r<br />\r<br />___________________________________________________",
  "categoryId": "33",
  "version": "2.2",
  "author": "DaveEscape",
  "createdUnix": "1423097726",
  "updatedUnix": "1425526786",
  "containsAdultContent": false,
  "uploadedBy": "DaveEscape",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000150190",
      "name": "Guardians V 2.2",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3478",
      "fileName": "Guardians V 2.2-62326-2-2.rar",
      "uploadedUnix": "1425526786",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/e80831ddea1d68baf5ab9b9ac954580e0a4ba54d86649e0e32a6383ab3bfaef0/analysis/1425526804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guardians%20V%202.2-62326-2-2.rar?fid=1000150190&ttl=1535851030&ri=8192&rs=8192&setec=b590f733057460253c6e56cc1df14e62"
    }
  ]
}