{
  "modId": 62341.0,
  "modName": "Legacy of the Dragonborn (Dragonborn Gallery) FR",
  "summary": "Traduction de l&#39;excellent mod Legacy of the Dragonborn (Dragonborn Gallery) de l&#39;excellent icecreamassassin.",
  "descriptionHtml": "[center][color=#ffff00][size=6]L&#39;héritage de l&#39;enfant de dragon[/size][/color][/center][center]Traduction de l&#39;excellent mod Legacy of the Dragonborn (Dragonborn Gallery) de l&#39;excellent icecreamassassin.[/center][center]Vous trouverez le mode original ici / Original mod here : \r<br />[url=http://www.nexusmods.com/skyrim/mods/52248/?] Original Mod [/url][/center]\r<br />10/09/2015\r<br />[size=2]Le mod évolue très régulièrement et malgré ce que m&#39;avait indiqué le modeur, la structure à complément changé ce qui fait que la \r<br />traduction à du repartir de zero.\r<br />Aussi, au lieu de me lancer dans un travail que je devrais mettre à la poubelle, j&#39;ai décidé d&#39;attendre que le mod soit terminé avant de traduire les lignes supplémentaires (le mod à doublé depuis sa version 12&#33;)\r<br />En attendant, je vous propose si vous êtes pressés, une version ALPHA. Elle contient tout ce qui à été traduit pour la version 12 du mod  et que j&#39;ai réussit à injecter dans la nouvelle structure a grand mal. Vous aurez donc 50% du mod traduit. Je n&#39;ai pas abandonné, il vous faudra juste être patients. Pour la version Alpha, il vous faudra télécharger en intégralité le mod sur la page du modeur puis la version alpha ici même dans la section fichiers. \r<br />\r<br />[/size][size=3]\r<br />\r<br />\r<br />\r<br />Avertissement: Ce mod est conséquent et vous demandera de télécharger environ 1go. Une fois activé il prendra 2,5go sur votre disque dur.\r<br />\r<br />\r<br />L&#39;héritage de l’Enfant de Dragon est ancré dans les prophéties, les mythes, les légendes ainsi que l&#39;histoire elle-même. \r<br />Explorez un passé oublié et découvrez les reliques perdues des 7 enfants de Dragon de Tamriel en provenance de toutes les ères connues. \r<br />\r<br />L’histoire que vous découvrirez est celle de ceux qui utilisaient le pouvoir de la voix.\r<br />\r<br />Le dernier enfant de dragon va enfin pouvoir découvrir ceux qui, avant lui, portaient le titre d’Enfant de Dragon ainsi que l&#39;alliance perdue d’Akatosh.\r<br />\r<br />L’Héritage de l’Enfant de Dragon ajoute à votre jeu un contenu conséquent en commençant par un Musée dans Solitude et son conservateur Auryen Morellus.\r<br />Avec  l’aide de celui-ci vous pourrez stocker, exposer et utiliser toute votre collection comme bon vous semble, tout le tout en étant aidé et guidé par Auryen entre vos aventures. \r<br />\r<br />Auryen vous demandera d’accomplir un bon nombre de quêtes plus ou moins complexes pour vous aider à remplir le musée. La plus remarquable étant &#34;Héritage Brisé&#34;, une série de quêtes, qui propose également tout une variété de récompenses pour remplir les diverses expositions du musée. \r<br />\r<br />A vous de découvrir plus de 1000 affichages pour les armes uniques, la centaine d’exploration et autres quêtes, les centaines de nouveaux objets, les nouveaux livres, les nouvelles peintures, les secrets du musée et des tas d’autres choses … \r<br />[/size]\r<br />\r<br /> \r<br />\r<br />[center]Description et installation ici:\r<br />\r<br />[youtube]o_wKi96Ex_0[/youtube][/center]\r<br />\r<br />[color=#ffff00][size=5][u]Pré requis[/u][/size][/color]\r<br />-Skyrim 1.9.29.0.8+\r<br />-SKSE 1.7.0+\r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Incompatibilités[/u][/size][/color]\r<br />\r<br />Voir la page principale du mod pour les détails, surtout si vous utilisez Perkus Maximus, ELE lighting et ELFX, Weapons and armor stats redone, Enhanced Cities, Solitude Capitol edition, Open Cities Skyrim\r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=5][u]Installation[/u][/size][/color]\r<br />\r<br />Allez sur la page du mod en anglais\r<br />Allez dans l&#39;onglet fichier\r<br />Prendre  Dragonborn Gallery V12A et cliquez sur Download with manager et activez&#33;\r<br />Sur cette page, dans l&#39;onglet fichier, prendre Dragonborn Gallery V12.10 mise a jour FR\r<br />puis Download with manager et activez&#33;\r<br />Faites Yes to mod quand NMM vous pose la question.\r<br />\r<br />\r<br />[line]\r<br />\r<br />\r<br />[center][color=#ffff00][size=5]Autres Traductions[/size][/color] \r<br />[url=http://www.nexusmods.com/skyrim/users/6376874/?tb=mods&pUp=1] [size=4]Cliquez ici pour les consulter [/size][/url][/center][center]\r<br />\r<br />\r<br />[color=#ffff00][size=5]Chaine Youtube / Mods Traduits et bien plus[/size][/color]\r<br />[url=https://www.youtube.com/user/FloydNexus/][size=4] Floyd&#39;s NEXUS[/size][/url][/center]\r<br />\r<br />[line]\r<br />\r<br />\r<br />[center][color=#ffff00][size=5][u]Autorisations et Autre[/u][/size][/color][/center]\r<br />-Tous mes mods traduits sont traduits avec l’autorisation explicite de leur auteurs respectifs et à leur conditions (hébergement ect...). \r<br />Il est donc interdit d’héberger ma traduction ailleurs.  Dans le cas ou cette traduction ne serait plus à jour, libre à vous d’en refaire une autre si l&#39;auteur vous le permet mais il est interdit de prendre celle-ci comme base avec ou sans réponse de ma part.\r<br />\r<br />-Si vous avez des soucis techniques, c’est au modeur original qu’il faut s’adresser, le forum mis à votre disposition ici est juste pour les remerciements, les questions d’ordre générales ou les soucis liés à la traduction. Je vous aiderais néanmoins avec plaisir si je le peux mais le modeur est bien plus compétent sur son travail.\r<br />\r<br />-Comme ceux qui suivent mon travail et les dizaines de mods que j&#39;ai traduit le savent, je traduis et teste seul. Je fais mon possible pour être le plus rigoureux possible mais il reste parfois des coquilles mineures que je corrige au fur et à mesure. \r<br />\r<br />\r<br />[line]\r<br />\r<br />[center]N&#39;oubliez pas de cliquer sur Endorse sur la page du mode original si vous aimez le mod et ici même pour la traduction.\r<br />Cela est un encouragement pour le modeur ainsi que pour moi même.\r<br />\r<br />[color=#ffff00] [size=5]Bon Jeu&#33;[/size][/color][/center]",
  "categoryId": "92",
  "version": "14.9",
  "author": "icecreamassassin Trad par Floyd",
  "createdUnix": "1423502263",
  "updatedUnix": "1441878362",
  "containsAdultContent": false,
  "uploadedBy": "Floyd2099",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000146402",
      "name": "Patch Fr Legacy of the Dragonborn v12",
      "version": "12.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "827843",
      "fileName": "Patch Fr Legacy of the Dragonborn-62341-.rar",
      "uploadedUnix": "1423321141",
      "modVersion": "12.10",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20Fr%20Legacy%20of%20the%20Dragonborn-62341-.rar?fid=1000146402&ttl=1535851040&ri=8192&rs=8192&setec=d3496e4ebe6343fed504dd82fd391aae"
    },
    {
      "fileId": "1000175494",
      "name": "Legacy of the Dragonborn v14 point 9 Alpha FR",
      "version": "14.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6964",
      "fileName": "Legacy of the Dragonborn v14 point 9 Alpha FR-62341-14-9.rar",
      "uploadedUnix": "1441878362",
      "modVersion": "14.9",
      "virusScanUrl": "https://www.virustotal.com/file/c3822d9226e982e7409f9c2891d5bfe98900ea6c5478f02b52a617242a184bc9/analysis/1441878429/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legacy%20of%20the%20Dragonborn%20v14%20point%209%20Alpha%20FR-62341-14-9.rar?fid=1000175494&ttl=1535851041&ri=8192&rs=8192&setec=8dc7695511378e8cfee189c53129e8f7"
    }
  ]
}