{
  "modId": 62475.0,
  "modName": "Skyrim Guardians - Strongholds",
  "summary": "Adds another 4 NPCs for the orcs",
  "descriptionHtml": "Skyrim Guardians Strongholds - Readme\r<br />________________________________________\r<br />\r<br />I didn&#39;t want to leave the Orc Settlements undefended, so I gave each of the four Orc strongholds their own personal champion.\r<br />\r<br />Other than that, they are rated the same as the Skyrim Guardians Mod that you can find here:\r<br />http://www.nexusmods.com/skyrim/mods/62326/?\r<br />________________________________________\r<br />\r<br />FLUFF N STUFF\r<br />\r<br />1. Pagra the Giant-Killer (Female, Largashbur): Charged with keeping the temple of Malacath safe from all invaders, Pagra fled when the giants attacked Fallowstone Cave. Pagra has spent much time lamenting her cowardice inside of Largashbur, where she has tried to redeem herself in the eyes of Malacath by defending it against more Giant incursions. Her heart aches for forgiveness, yet she will not travel back to the shrine and face the giants alone for fear that her death will be swift and wasteful. As she waits within the walls of the fortress with it&#39;s withering tribe, she silently prays to her Lord for help, any help, be it from within Largashbur or without.\r<br />\r<br />2. Chorruz the Wise (Male, Dushnikh-Yal): An old orc who, by blessing of Malacath or by spiritual intervention, has retained all the strength and vigor of his younger self. Scars criss-cross his body, regaling tales of battles and adventures long past. Many within Dushnikh-Yal wonder why Chorruz has not assumed the mantle of Chieftain for himself, but he recounts that his days will one day come to a swift and beautiful end, and that his time as Chieftain expired long ago. His duty now is the defense of the stronghold and it&#39;s culture, as tales of bravery and courage are told by him every night around the campfire.\r<br />\r<br />3. Gigro the Beautiful (Male, Mor-Khazgur): A massive orc who was born with unusual features, Gigro almost appears man-like under closer inspection. Although relatively unskilled and unscarred in battle, Gigro&#39;s inexperience has been balanced by wise teachings from older, wiser warriors and his own titanic strength. \r<br />\r<br />4. Ruutz gra-Gashlukk (Female, Narzulbur): Cantankerous and gruff, even by Orcish standards, Ruutz is seen by most as thorny, anti-social, and indifferent. This opinions change, however, once nord mead begins making its way down into her stomach. Ruutz feels that the only way to spend life is with her blood burning with the fires of combat, scented with the sweet herbs and spices of a fine mead. It is in these two things where Ruutz is truly happy, and whenever she is without one or the other, she is in a foul mood indeed. Perhaps a weary wanderer would do well to remember this one facet of her personality, and they might find themselves welcomed within the stronghold. Maybe.\r<br />_______________________________________\r<br />\r<br />I am, again, using Xenius&#39; High Quality Eyes mod; Not required but recommended&#33;\r<br />\r<br />________________________________________\r<br />By DaveEscape",
  "categoryId": "33",
  "version": "2.2",
  "author": "DaveEscape",
  "createdUnix": "1423451605",
  "updatedUnix": "1425527419",
  "containsAdultContent": false,
  "uploadedBy": "DaveEscape",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000150193",
      "name": "GuardiansStrongholds v2.2",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "800",
      "fileName": "GuardiansStrongholds v2.2-62475-2-2.rar",
      "uploadedUnix": "1425527419",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/8d8273899cc48e794f3e3996c74ee0996c20e25de0327bcea129491a11d289ad/analysis/1425527464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GuardiansStrongholds%20v2.2-62475-2-2.rar?fid=1000150193&ttl=1535851143&ri=8192&rs=8192&setec=9b2b9367ecc4dd5581bb978313dcc96d"
    }
  ]
}