{
  "modId": 62491.0,
  "modName": "Auriel&#39;s Bow Enhanced",
  "summary": "General improvements to Auriel&#39;s Bow and its sunstorm effect: higher damage, unlimited charge, longer sunstorm duration, better friendly fire immunity",
  "descriptionHtml": "This mod makes some improvements to [color=#f1c232]Auriel&#39;s Bow[/color] that I&#39;ve been using for a while on my character, but I figured I&#39;d share them with everybody. [color=#ffd966]I&#39;ve increased its base damage to 20, 1 higher than a daedric bow[/color] to better reflect its status as a legendary aedric artifact. Previously it just had the damage of a normal elven bow. I&#39;ve also doubled the damage of the enchantment from 10(30) to 20(60) and removed the enchantment charge capacity entirely; you will always get bonus sun damage and [color=#ffd966]never have to worry about recharging it with soul gems.[/color]\r<br />\r<br />The biggest change is to the[color=#ffd966] sunstorm[/color] that gets triggered when you shoot the sun with a sunhallowed arrow. Originally it only lasted 15 seconds, [color=#ffd966]but in my mod it will last for a full minute.[/color] I&#39;ve also significantly increased the damage the sunbeams do: each beam deals [color=#ffd966]88[/color] damage to normal enemies and [color=#ffd966]120 [/color]to undead ones. I&#39;ve balanced this for high-level play on legendary difficulty where damage dealt is divided by 4 so it may be a tad overpowered on lower difficulties. Considering you have to be fairly far into the main quest to even unlock the weapon at all I think it&#39;s appropriate to be catered towards high levels.\r<br />\r<br />The final change improves the [color=#ffd966]friendly fire immunity[/color] of the sunstorm. While Bethesda actually did try to implement it so friendly targets won&#39;t be aggroed by the beams originally, I&#39;ve found that in my game people would still aggro anyway somehow and I&#39;d randomly end up with a bounty and guards attacking me. With the changes I&#39;ve made, [color=#ffd966]you can be certain that the sunstorm will never damage or aggro anyone who wasn&#39;t already going to attack you anyways.[/color] Try using it in towns, it&#39;s fun&#33; Don&#39;t worry though, if you&#39;ve already got a bounty or just want to kill a ton of guards for whatever reason, the beams will start to work on them if they&#39;re attacking or searching for you. I&#39;ve also made non-hostile animals immune to it, so you don&#39;t have to feel guilty about seeing a bunch of poor deer and bunny lifebars constantly draining down to 0 on your screen whenever you use it in the wild. It will still work on predatory animals that attack you, although if you use the [color=#6aa84f]Kyne&#39;s Peace [/color]shout [color=#ffd966]any animal affected by it will temporarily become immune.[/color]\r<br />\r<br />Obviously you need to have [color=#e06666]Dawnguard DLC[/color] for this mod to work. Also remember you need to be using the special [color=#ffd966]sunhallowed arrows[/color] to trigger the sunstorm. You can get them from our friend at the [color=#ffd966]Temple of Auri-El[/color] in the Forgotten Vale. I haven&#39;t changed anything about the way the Eclipse with bloodcursed arrows works in this mod, as there really isn&#39;t much to alter. Let me know if you have any ideas. Thanks and enjoy&#33;",
  "categoryId": "55",
  "version": "1.0",
  "author": "EbonAE",
  "createdUnix": "1423512095",
  "updatedUnix": "1423503311",
  "containsAdultContent": false,
  "uploadedBy": "guerillamoderno",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000146805",
      "name": "Auriel&#39;s Bow Enhanced",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Auriel's Bow Enhanced-62491-1-0.zip",
      "uploadedUnix": "1423503311",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9b6045c06d9a5b7905b401a0eb1ededd7aa16d08f112a6a31603b41a7b68c87b/analysis/1423503362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Auriel%27s%20Bow%20Enhanced-62491-1-0.zip?fid=1000146805&ttl=1535851162&ri=8192&rs=8192&setec=0e63d80af0d1911fb46f44c1d826cfbd"
    }
  ]
}