{
  "modId": 62535.0,
  "modName": "Elewin Jewelry CBBEv3M body conversion",
  "summary": "Conversion mod of Elewin&#39;s Jewelry piercing for CBBEv3M female bodies. Still requires main mod, plus Caliente&#39;s Beautiful Bodies and CBBEv3M variant.",
  "descriptionHtml": "[b][size=4][color=#ff0000]DISCLAIMER: I AM NOT THE ORIGINAL AUTHOR OF THIS MOD. THIS IS ONLY A CONVERSION OF AN &#34;ELEWIN&#39;S JEWELRY PIERCING&#34; MOD. ALL THE CREDITS GOES TO THE ORIGINAL AUTHOR.\r<br />\r<br />[/color]\r<br />[/size][/b]***UPDATE***\r<br />I have just realized that im not being using CBBE &#34;curvy&#34; variant, but CBBEv3M body instead.  That may have been the reason for issues some of you had with this mod. My deepest and sincere apologizes for any inconvenience, this might have caused.\r<br />\r<br />\r<br />\r<br />[i][color=#ff00ff]About the mod:[/color][/i]\r<br />\r<br />It was about couple of weeks ago, that i got bored and started browsing the &#34;Nexus mods&#34; website for various Skyrim mods, mostly the ones with the accessories/jewelry and other stuff for my female character. I was amazed with the Elewin&#39;s original mod and his work, and at the same time, to be honest, a little bit dissapointed that there is only an UNP variant of it, for i mainly used Caliente&#39;s CBBE body mod, for my female characters. Searching trough the internet, i tried to find if an CBBE conversion for it exists, and i had no luck. However, i tried to screw around with a Bodyslide and Outfit studio these days, and i figured out how can this mod be converted.\r<br />\r<br />Those navel piercings, as of now, works nice with most of mods and outfits, based on MAK07&#39;s 3M variant of Caliente&#39;s CBBE body mod. However, should you decide to use them with more customized Bodyslide variants, there will probably be some displacement issues, or similar. At one point, i will provide an Outfit Studio tutorial on about how to tweak these piercing models, in order to fit those bodies correctly.\r<br />\r<br />Nothing, considering the original mod, is changed (i.e. item locations, stats, crafting recipes etc.).\r<br />\r<br />\r<br />\r<br />[i][color=#ff00ff]Requirements:[/color][/i]\r<br />\r<br />Caliente&#39;s Beautiful Bodies Edition -CBBE- By Caliente [url=http://www.nexusmods.com/skyrim/mods/2666/?]Link\r<br />[/url]CBBEv3M Body Replacer by MAK07 [url=http://www.nexusmods.com/skyrim/mods/13180/?]Link[/url]\r<br />Original mod by Elewin [url=http://www.nexusmods.com/skyrim/mods/30571/?]Link[/url]\r<br />\r<br />\r<br />\r<br />[i][color=#ff00ff]Installation:[/color]\r<br />\r<br />[/i]Just unzip the archive and drop all the files and folders into your skyrim&#92;data folder and overwrite when asked. Make sure that you have installed original mod beforehand.\r<br />\r<br />IMPORTANT NOTE:\r<br />If you are updating from previous version, please remove all its the files and folders, before installing this one (see &#34;Uninstallation&#34; section, on how to do it). Otherwise, you will experience glitches, and game may crash.\r<br />\r<br />\r<br />\r<br />[i][color=#ff00ff]Uninstallation:\r<br />\r<br />[/color][/i]Delete, from your Skyrim&#39;s &#34;Data&#34; folder, following folders and files:\r<br />\r<br />meshes&#92;elewin&#92;elewin jewelry\r<br />textures&#92;elewin&#92;elewin jewelry\r<br />Elewin Jewelry.esp\r<br />\r<br />\r<br />\r<br />[i][color=#ff00ff]Changelog:\r<br />[/color][/i]\r<br />0.2\r<br />- Fixed issues with texture paths and file structure, that caused model to glitch and lose it&#39;s proper material textures.\r<br />- Fixed issue with model losing its texture, if weight slider is set to 100.\r<br />- Tweaked model positioning, in order to fit CBBEv3M body a bit more.\r<br />\r<br />\r<br />\r<br />[i][color=#ff00ff]Known issues:\r<br />\r<br />[/color][/i]- Some &#34;default CBBE&#34; - based outfits may have piercing displacement, cliping, or similar issues.\r<br />- Issues with the original mod still persists, for this conversion doesnt change the original mod script in any way.\r<br />\r<br />\r<br />\r<br />[i][color=#ff00ff]In the end:\r<br />\r<br />[/color][/i]This is still WIP version, so bear in mind that it might not be perfect. I would be more than happy, if someone report any issue, or bug that he encounter. An endorsement would be also appriciated. Anyway, my grattitudes and kudos goes to:\r<br />\r<br />Elewin for making of an awesome mod.\r<br />Caliente for CBBE and Bodyslide, and to MAK07 as well.\r<br />Bethesda for awesome game franchise and its modding support, that lasts for decades now.\r<br />\r<br />P.S. also many thanks to authors named amesake and its &#34;amk Border Lace Lingerie&#34; mod [[url=http://www.nexusmods.com/skyrim/mods/14431/?]Link[/url]] and to Ruhandre and its conversion for it [[url=http://www.nexusmods.com/skyrim/mods/61658/?]Link[/url]] (the Lingerie i used for screenshots)",
  "categoryId": "102",
  "version": "0.2",
  "author": "Dzoni87",
  "createdUnix": "1423613222",
  "updatedUnix": "1425016457",
  "containsAdultContent": false,
  "uploadedBy": "dzoni87",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000149302",
      "name": "Elewin Jewelry piercing for CBBE",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2100",
      "fileName": "Elewin Jewelry piercing for CBBE-62535-0-2.rar",
      "uploadedUnix": "1425016457",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/75f1ec90b68fd797d38df232a71441def995d072f353c944594cb69efc422de9/analysis/1425016505/",
      "changelogHtml": " - Fixed issues with texture paths and file structure, that caused model to glitch and lose it&#39;s proper material textures. <br/> \n - Fixed issue with model losing its texture, if weight slider is set to 100. <br/> \n - Tweaked model positinoing, in order to fit CBBE body a bit more. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elewin%20Jewelry%20piercing%20for%20CBBE-62535-0-2.rar?fid=1000149302&ttl=1535851209&ri=8192&rs=8192&setec=2c6d6d09802deaccb9638e8f282659e2"
    }
  ]
}