{
  "modId": 62566.0,
  "modName": "Foon&#39;s Mod (More followers)",
  "summary": "This is a mod with followers and NPCs.",
  "descriptionHtml": "Oh boy.\r<br />\r<br />Greetings &#33;&#33;\r<br />My name is ThexFoondom (A.K.A. Foon), and this is my first Skyrim mod ever. The name of the mod is, as it says above, Foon&#39;s Mod.\r<br />\r<br />[b]But what is Foon&#39;s Mod?[/b] Well&#33; I&#39;m going to tell you my questioning little friend&#33;\r<br />It&#39;s a mod. Which .. doesn&#39;t quite really have a description. It doesn&#39;t do anything special, it&#39;s nothing specific, it&#39;s just a mod.\r<br />I [i]would[/i] end my description here, but then I would not get alot of downloads now would I?\r<br />Currently, all this mod does is to add a few followers. But there&#39;ll be more (mixed) content. And standalone files. For example if the mod ever gets to the point where there are NPCs, items, buildings, etc. I will have standalone files incase you don&#39;t want ALL of it. Some of them might be required for another file to work though.\r<br />[size=4]\r<br />[b]Before you ask-questions:[/b][/size][b]\r<br />[/b]Q: Can you make an NPC that [insert suggestion here]\r<br />A: I don&#39;t know, probaly. As Alvor says: &#34;By Ysmir, if it&#39;s [i][b]simple [/b][/i]and strong then I can forge it&#33;&#34;.... I&#39;m not that good of a modder just yet.\r<br />\r<br />Q: My game crashes.\r<br />A: No idea. Mine doesn&#39;t. Put the mod up or down in the load order (In the launcher - it&#39;s data files). Maybe it&#39;s not even my mod.\r<br />\r<br />Q: How to install?\r<br />A: Great question&#33; I can answer this one&#33; Put the files from the .zip file into your data folder which is located in ProgramFiles-&gt;Steam-&gt;SteamApps-&gt;Skyrim\r<br />\r<br />Q: How to open the .zip file? ;-;\r<br />A: Download WinRAR or something similar.\r<br />\r<br />Q: Help?\r<br />A: Ok.\r<br />\r<br />Q: Can I make a video of this mod?\r<br />A: Yeh sure. But put a link in the description.. No-one likes non-linking videos.\r<br />\r<br />Q: Why do the NPCs look glitched?\r<br />A: Because you messed up your installation.\r<br />\r<br />Q: Are you out of before you ask-questions?\r<br />A: Yes.\r<br />\r<br />Q: Hug?\r<br />A: Yes. ;-;",
  "categoryId": "96",
  "version": "0.1",
  "author": "ThexFoondom",
  "createdUnix": "1423693690",
  "updatedUnix": "1423693690",
  "containsAdultContent": false,
  "uploadedBy": "xFoondom",
  "primaryFile": null,
  "files": []
}