{
  "modId": 62609.0,
  "modName": "Spears By Soolie",
  "summary": "This mod adds a variety of 1 handed spears and throwable javelins into the game.\r<br />\r<br />-Spears and javelins have their own unique animations without replacing any other animations\r<br />-This mod comes with a patcher that will seamlessly add spears and javelins to npc&#39;s containers and merchants without any compatibility problems\r<br />",
  "descriptionHtml": "[u][center][size=5]Spears By Soolie\r<br />\r<br />[/size][/center][/u][center][u][size=5][/size][/u][youtube]GHaxiqlAQ8Q[/youtube]\r<br />[/center]========\r<br />Description\r<br />========\r<br />This mod adds a variety of 1 handed spears and throwable javelins into the game.\r<br />-Spears and javelins have their own unique animations without replacing any other animations\r<br />-This mod comes with a patcher that will seamlessly add spears and javelins to NPC&#39;s containers and merchants without any compatibility problems\r<br />-There is a variant in each base material. i.e Iron, Steel, Elven, forsworn, imperial, draugr, etc..\r<br />-They are fully craftable and can be upgraded\r<br />\r<br />\r<br />=====\r<br />Details\r<br />=====\r<br />The spear has been used by almost every civilization. They are cheap, easy to make and require little training. They are essentially the perfect weapon for the battle field.\r<br />And in the words of wikipedia &#34;The spear was the most common weapon of the peasant class of Scandinavia and also throwing spears may have been used by the warrior class....  Compared to a sword, the spear can be made with inferior steel and far less metal overall. This made the weapon cheaper and probably within the capability of a common blacksmith to produce. Despite this, the spear held great cultural significance to the Viking warrior&#34;\r<br />....So you would have thought that bethesda would have included spears and javelins in skyrim right???? Well no, unfortunately not. But your wait is over, this mod will completely integrate spears and javelins into the game. I have designed the mod to make it almost indestinguishable from vanilla gameplay, after a while you will forget the spears were from a mod and it&#39;ll feel like they have always been there :)\r<br />\r<br />===Spears====\r<br />The spears are all 1 handed with custom animations. They do more damage than swords, however they are also a little bit slower so the Overall damage per second is slightly lower than a sword of the same material. HOWEVER, they do more critical damage, have a much longer reach and ignore 25% of armor. So overall they are essentialy equivalent to swords. There is a spear in every material type. ie. iron,steel,dwarven,orcish,imperial,forsworn,draugr,etc.\r<br />\r<br />--Power Attacks--\r<br />The power attacks all have new thrusting animations. Power attacks with a spear will not do as much extra damage as with other weapons, however the stamina cost is significantly lower. Most of your attacks should be power attacks when using a spear. NPC&#39;s will mostly use power attacks when using a spear\r<br />\r<br />--Regular Attacks--\r<br />regular attacks do not have thrusting animations, they will use the vanilla 1 handed animations. regular attacks do less damage, however they have a large reach and can hit opponents within 80 degrees from where the player is aiming. Regular attacks should only really be used if you are low on stamina.\r<br />\r<br />--Crafting--\r<br />All spears are craftable at forges, They require the same ingredients as swords with the following modifications, 1 less ingot, 1 extra leather strips, 2 firewood. They can also be upgraded.\r<br />\r<br />--NPC&#39;s-- \r<br />The chance of a NPC having a spear is slightly higher than other weapons, however this only applies to NPC&#39;s that would normaly have a 1handed weapon. NPC&#39;s that would normally have 2 handed weapons will not have spears.\r<br />\r<br />--Skills--\r<br />Spears will use the 1 handed skill and will benefit from all its perks\r<br />\r<br />===Javelins===\r<br />Javelins have custom throwing animations and are equiped as seperate weapons. They function kind of like arrows that don&#39;t need a bow. When you equip javelins they will appear on your back in the game. If you click and hold the left mouse button, you will draw a javelin and hold it over your shoulder. You can then aim until you release the left mouse button, when you do you will then throw the javelin. They will stick into the environment and NPC&#39;s and there is a high chance of being able to recover thrown javelins.\r<br />Javelins do 2x the amount of damage as an arrow of the same material as well as staggering your opponent, they also ignore 25% of armor. The downside is that each javelin has a weight of 3 units, and they are 3x as expensive as arrows.\r<br />There are javelins in every material type.ie. iron,steel,dwarven,orcish,imperial,forsworn,draugr,etc.\r<br />\r<br />--Crafting--\r<br />Javelins can be crafted at the forge in bundles of 3. (they appear in the miscelaneous category)\r<br />\r<br />--NPC&#39;s-- \r<br />NPC&#39;s that would have a bow in the vanilla game will have a chance of having a few javelins with this mod. Unlike arrows, NPC&#39;s will not have infinite javelins, and they will usualy throw about 2 or 3 before switching to a bow.\r<br />\r<br />--Skills--\r<br />Javelins will use the archery skill tree, which also means they will benefit from all the archery perks.\r<br />\r<br />NOTE: Unfortunately I have been unable to get 1st person animations to work, so the vanilla 1st person animations will still play.\r<br />However, I strongly suggest you download Immersive 1st person view http://www.nexusmods.com/skyrim/mods/49036/? so that the 3rd person spear animations will play in 1st person\r<br />\r<br />\r<br />=====\r<br />Install\r<br />=====\r<br />Please don&#39;t be intimidated by all these installation instructions. It&#39;s not hard to install or anything, I just separated the process into as many steps as I could so that people won&#39;t get confused or lost :)\r<br />\r<br />\r<br />\r<br />IMPORTANT NOTICE&#33;&#33;&#33;\r<br />Please follow these instructions fully and carefully, I have been as precise as I can so please don&#39;t skip any steps.\r<br />\r<br />1. Open up SpearsBySoolie.zip, the first thing you will see in the .zip is a folder called &#39;Spears By Soolie&#39;\r<br />\r<br />2. Copy/extract this folder to your desktop \r<br />\r<br />This mod requires some files from the mod PCEA to work properly, we will now download these files\r<br />\r<br />3. Go to this page http://www.nexusmods.com/skyrim/mods/14871/?\r<br />\r<br />4. Click on the files tab and download &#39;PCEA 3-5-2 NMM Installer&#39; NOTE: Do NOT&#33; download this with the nexus mod manager, you must download this file manually\r<br />\r<br />5. Open the compressed PCEA folder you just downloaded.\r<br />\r<br />6. Navigate to the following location &#39;01 main&#39; ---&gt;  &#39;meshes&#39;  ----&gt;  &#39;actors&#39; ----&gt;  &#39;character&#39;\r<br />\r<br />We will now copy the files we need into our temporary &#34;spears by soolie&#34; folder\r<br />\r<br />7. Select ONLY the following files/folders  &#34;behaviors&#34;,&#34;characters&#34;,&#34;characters female&#34;,&#34;defaultmale.hkt&#34;,&#34;defaultfemale.hkt&#34;\r<br />(Make sure you select the files with .hkt not .hkx) (Also do NOT copy the PCEA animations folder)\r<br />\r<br />8. Extract these files/folders to the following location, &#34;YourTemporarySpearsBySoolieFolder&#92;Meshes&#92;actors&#92;character&#92;&#34;\r<br />\r<br />9. Check that this location now has the following files/folders &#34;animations&#34;, &#34;character assets&#34;, &#34;behaviors&#34;,&#34;characters&#34;,&#34;charactersfemale&#34;,&#34;defaultmale.hkt&#34;,&#34;defaultfemale.hkt&#34;\r<br />\r<br />We will now copy the files to your Skyrim folder\r<br />\r<br />10. Select all the files and folders in your Temporary SpearsBySoolie folder\r<br />\r<br />11. Copy them to the following location &#34;YourSteamFolder&#92;steamapps&#92;common&#92;Skyrim&#92;Data&#92;&#34;\r<br />\r<br />To make the animations work correctly we must download and run FNIS\r<br />\r<br />12. Go to this page http://www.nexusmods.com/skyrim/mods/11811/?\r<br />\r<br />13. Click on the files tab and manualy download &#34;FNIS Behavior V5_2 -- ALWAYS necessary&#34;\r<br />\r<br />14. Open up the compressed folder you just downloaded and navigate to &#34;FNIS Behavior 5.2&#92;Data&#92;&#34;\r<br />\r<br />15. Select all the folders in this location and extract them to &#34;YourSteamFolder&#92;steamapps&#92;common&#92;Skyrim&#92;Data&#92;&#34;\r<br />\r<br />We&#39;ve almost finished, next we need to run FNIS\r<br />\r<br />16. Go to the following folder &#34;YourSteamFolder&#92;steamapps&#92;common&#92;Skyrim&#92;Data&#92;tools&#92;GenerateFNIS_for_Users&#34;\r<br />\r<br />17. Open GenerateFNISforUsers.exe\r<br />\r<br />18. Under Available Patches, place a tick next to &#34;xp32&#39;s PC Exclusive Animation Path (PCEA)&#34; [Do NOT&#33; tick any other boxes unless you know what you are doing]\r<br />\r<br />19. Click on &#34;Update FNIS Behavior&#34;, when it has finished, close FNIS\r<br />\r<br />The last thing we need to do is run a patcher to integrate Spears by Soolie into Skyrim\r<br />\r<br />20. First we need to Open the skyrim launcher, go to data files and enable &#39;SpearsBySoolie.esp&#39; after you have done this, close the launcher\r<br />\r<br />21. Go to the following location &#34;YourSteamFolder&#92;steamapps&#92;common&#92;Skyrim&#92;Data&#92;SkyProc Patchers&#92;Spears By Soolie&#92;&#34;\r<br />\r<br />22. Run &#39;Spears by Soolie Patcher.jar&#39; and press the patch button in the top right corner\r<br />\r<br />23. If any messages pop up just close them with the red &#39;x&#39; button\r<br />\r<br />NOTE: you will need to run this patcher again any time you install a new mod that adds ANY new NPC&#39;s or adds any new weapons (If your not sure, just run it anyway)\r<br />Also, before you run the patcher after the first time. make sure you delete &#39;Spears By Soolie Patch.esp&#39; first, so it can generate a new one.\r<br />\r<br />24. Open the skyrim launcher again, go to data files and enable &#39;Spears By Soolie Patch.esp&#39; Make sure it is ALWAYS at the bottom of your load order\r<br />\r<br />25. It would be best if you start a new game after installing this mod. It should work with old saved games, but I can&#39;t guarantee it.\r<br />\r<br />26. Make sure you read the Known Issues or bugs section of this readme, so you know how to fix some problems that may occur.\r<br />\r<br />Congratulations, You have now Installed Spears by Soolie, :)\r<br />\r<br />\r<br />======\r<br />Uninstall\r<br />======\r<br />......why would you even want to uninstall this :armscrossed:\r<br />But if you must here&#39;s what to do :P\r<br />1. Redownload the mod and open the compressed folder\r<br />2. The files in the compressed folder are the ones you must delete from your skyrim folder\r<br />3. Also delete &#39;Spears by soolie patch.esp&#39;\r<br />\r<br />\r<br />============\r<br />Recomended Mods\r<br />============\r<br />Realistic Ragdolls and Force (http://www.nexusmods.com/skyrim/mods/601/?)\r<br />This should stop NPC&#39;s from flying off in a unrealistic manner when killed by javelins\r<br />\r<br />Immersive first person view (http://www.nexusmods.com/skyrim/mods/49036/?)\r<br />So that the 3rd person animations play in first person\r<br />\r<br />\r<br />===============\r<br />Known Issues or Bugs\r<br />===============\r<br />1.For some reason the game will struggle to load the custom animations if you are running low on ram. If this happens you will see things like NPC&#39;s having to play the throwing animation multiple times before the javelin is actualy thrown. Also the first time an animation is played it may not work  i.e the first time you use a thrust animation it may skip it, however it should work fine after that.\r<br />To fix this problem make sure you always close background programs before playing the game to free up ram. \r<br />2. Very rarely the game will crash when a NPC equips or unequips javelins, the chance of this happening is slightly higher if there are many NPC&#39;s attacking you with a spear or javelins, such as if you are being attacked by many guards. As a precaution, make sure you do a quicksave before entering such situations.\r<br />3. Sometimes if a NPC equips a spear or javelin, the color of their face may not match the color of their body. I haven&#39;t been able to find a way to fix this. I don&#39;t think it&#39;s terribly noticable, especialy if the NPC is wearing a concealing helmet, or no skin is visible on their body. [This is only temporary and the colors will be fixed when they equip a normal weapon] [Also this does not effect the player]\r<br />\r<br />\r<br />============================\r<br />Making Custom Spears or Javelins\r<br />============================\r<br />\r<br />If you have made a spear or javelin and you would like it to use the animations from this mod, simply make sure the word &#34;spear&#34; or &#34;Javelin&#34; is either in the items ingame name or it&#39;s editorID also, the inside the .nif, the weapon should be sheathed in the regular 1handsword weapon spot, not on the players back. Also it must be set as a 1 handed sword for spears, or an arrow for javelins.\r<br />When you run the patcher it will look for weapons that meet these conditions and configure them to use the right animations\r<br />\r<br />\r<br />\r<br />========\r<br />Compatibility\r<br />========\r<br />The mod has a patcher that should make it compatible with just about everything.\r<br />However it is possible that any mod that effects equipping or unequipping could cause javelins to behave strangely\r<br />Also since this mod uses PCEA to switch between spear animations and non spear animations, you will be unable to use PCEA for other things\r<br />\r<br />\r<br />=====\r<br />Credits\r<br />=====\r<br />Thankyou to the following users for allowing me to use assets from their mods :) :)\r<br />L0rd0fWar - Forward spear power attack animation\r<br />PrivateEye - Spear models\r<br />\r<br />\r<br />====\r<br />Legal\r<br />====\r<br />You may not upload this mod to any website without my permission.\r<br />You may not upload or use any of the assets from this mod.\r<br />You may upload translated versions of this mod provided it is made clear that you are NOT the original author of the mod and that you contact me afterwards.",
  "categoryId": "77",
  "version": "1.0",
  "author": "Soolie",
  "createdUnix": "1423805119",
  "updatedUnix": "1423813598",
  "containsAdultContent": false,
  "uploadedBy": "Soolie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000147233",
      "name": "Spears By Soolie",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6108",
      "fileName": "Spears By Soolie-62609-1-0.zip",
      "uploadedUnix": "1423813598",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/872f5d701447a0ba3e317d0e2207560dc27021e0bb6d104d2fc456783b971d76/analysis/1423813627/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Spears%20By%20Soolie-62609-1-0.zip?fid=1000147233&ttl=1535851282&ri=8192&rs=8192&setec=98320eecd8eb582033b1856616937905"
    }
  ]
}