{
  "modId": 62640.0,
  "modName": "EHSE - Reactive Combat",
  "summary": "A modified version of a mod by the modder proksi, which i modded.\r<br />Adds attack tiring, dual wield combos, knockouts, unarmed combat, and COMBAT DIVERSITY.",
  "descriptionHtml": "[center][size=4][size=6]Every Hit Staggers Extended[/size]\r<br />[size=3][/size]Reactive Combat\r<br />[size=4][size=2][color=#FFFF00]New in Version 1.1250[/color]\r<br />*Improved Performance*\r<br />*Rebalanced weapon stagger strength progression*[/size][/size][/size][size=4][size=4][size=1][size=4][size=4][size=2][size=1]\r<br />[/size][/size][/size][/size][size=4][size=4][size=2][size=1][size=4][size=4][size=1][size=4][size=4][size=2][size=1][color=#FFFF00]*SEE COMMENT SECTION STICKY FOR STATUS ON FUTURE UPDATES*[/color][/size][/size][/size][/size][/size][/size][/size][/size][/size][/size][/size][/size][/size][/size]\r<br />[color=#FF0000]*Added a patch for Brawl bugs patch([/color][color=#FF00FF] Brawl Bug Patch works perfectly, BUT ONLY IF YOU DON&#39;T GET HIT&#33;\r<br />This patch fixes that[/color][color=#FF0000][color=#FF00FF]. Also, this patch doesn&#39;t just work for EHSE. In theory it should make Brawl Bug Patch more compatible with other mods. [/color])*[/color][/center][center][/center][center]\r<br />\r<br />\r<br />\r<br />\r<br />Ever noticed combat in Skyrim felt like fighting air?\r<br />Getting tired of swinging your greathammer right in front of someones face,\r<br />then having them pretend like they&#39;re butterfly kisses?\r<br />Well you&#39;re in luck&#33;\r<br />With[url=http://www.nexusmods.com/skyrim/mods/60930/?] proksi[/url]&#39;s all new patented stagger technology YOU will finally feel like you&#39;re actually fighting something&#33;\r<br />\r<br />A modified version of a mod by the modder [url=http://www.nexusmods.com/skyrim/mods/60930/?]proksi[/url]\r<br />Adds attack tiring, dual wield combos, knockouts, unarmed combat, and COMBAT DIVERSITY.\r<br />\r<br />\r<br />\r<br />\r<br />[size=4]For anyone who still cares about 1.1250b test version 5[/size]\r<br />[Changed up attack speed mechanics]\r<br />[Instead of a complete slowdown, attacks become progressively more telegraphed]\r<br />[Adds a viewable spell effect so you know when you should start another combo]\r<br />[youtube]tkFVy8y1fGY[/youtube]\r<br />[size=4]New in 1.1200[/size]\r<br />[Regular unarmed attacks are now affected by attack speed]\r<br />[Cloak spells are now useful for staggering, especially with high level destruction. Watch out for them wizards&#33;]\r<br />[Onehand perks that now work with unarmed:  dual savagery, dual flurry, and bonebreaker]\r<br />[youtube]KfeCY87W1bQ[/youtube]\r<br />[size=4]Performance Update 1.1250 - 30 Enemies[/size]\r<br />[youtube]HpnsGm67DPM[/youtube][youtube]1QdgkKfHm4Y[/youtube]\r<br />[More videos at the bottom] [/center]\r<br />\r<br />\r<br />\r<br />[size=4]What it does: [/size]\r<br />\r<br />[[color=#00FF00]stagger[/color]]\r<br />-attacks flinch and stagger with no RNG\r<br />-1h, 2h, Bows, and Elemental Destruction Magic all have different different flinching/staggering capabilities\r<br />-depending on skill level you can increase the strength of your stagger\r<br />-channeling spells stagger, but only once a second or two depending on which hand you use\r<br />-magic uses the same poise-like stagger mechanic as unarmed :NEW\r<br />[color=#FFAAAA]*As mentioned by mark85m, friendly fire from mage followers can get really crazy in high level play, it is recommended you install &#34;no friendly fire addon&#34; from the &#34;amazing follower tweaks&#34; if your followers get too annoying. Thanks mark85m for pointing that mod out*[/color]\r<br />\r<br />[[color=#00FF00]attack speed[/color]]\r<br />-consecutive attacks will slow you down, by the fourth hit you will be so slow that the enemy will be able to get a free hit on you (if you have a good combat AI mod) \r<br />-with dual wield you can alternate between hands to prevent slowdown until the fourth strike\r<br />-added some dual wield combos, certain sequences of attacks will provide less slowdown, some even give a slight speed-up\r<br />-compatible with other mods that add spells/items/perks/abilities that change attack speed\r<br />[color=#FFFF00]Note: The attack speed mechanic is conditioned so that Elemental Fury will still give you increased attack speed even after the fourth hit. It will still feel like you&#39;re slowing down from your initial strikes, but it will also feel like you&#39;re tireless since your attack speed doesn&#39;t drop below the regular rate.[/color]\r<br />\r<br />[[color=#00FF00]Shaky Cam[/color]] :Can be toggled On/Off\r<br />-the camera will now shake after landing attacks/power attacks\r<br />[color=#FFAAAA]*A big thanks to Jasagna for suggesting this feature*[/color]\r<br />\r<br />[[color=#00FF00]unarmed[/color]] :Can be toggled On/Off\r<br />-unarmed is now governed by onehand skill, it is also enhanced by onehand perks/enchantments if you use the new Monk spell, which mimics a weapon\r<br />-you will gain experience with onehanded skill while using unarmed\r<br />-Actors now gain stagger resistance to unarmed attacks if you attack them too many times in a short duration\r<br />-this is meant to simulate tiredness of unarmed attacks \r<br />-stagger resistance doesn&#39;t last that long, eventually actors will start flinching again\r<br />-unarmed stagger resist only applies to attacks FROM non NPCs and left hand attacks from leftunarmed+rightmagic wielding\r<br />-as of 1.1200 unarmed is affected by attack speed\r<br />-a number of onehanded perks will affect unarmed combat as it would with other onehanded weapons\r<br />-four unarmed auras in total\r<br />-each one emulates mace damage of a different material quality\r<br />-each lasts for about 5 minutes\r<br />-they can be found in certain Dragon Priest Lairs, and Dwarven Auomaton sites\r<br />-the weakest spell can be found in helgen\r<br />-the clue to the location of the strongest spell is located in a city/town/village near the dungeon\r<br />\r<br />[[color=#00FF00]recoil[/color]]\r<br />-interrupting an enemy as they attack will cause them to recoil\r<br />-they will be completely defenseless and unable to defend or attack while recoiling\r<br />-this applies to you too of course, so watch your butts\r<br />\r<br />[[color=#00FF00]weapon bash knockdown[/color]]\r<br />-strength and chance of knockdown is affected by skill\r<br />-you can only knockdown using bash attacks\r<br />-chance of knockdown depends on weapon, 2h,1h, dagger, or fist\r<br />-knockdowns only work with undefended power attacks\r<br />-if you want to knockout an enemy who is defending, you must first break their guard\r<br />-to do this you mush bash them multiple times and eventually the will lose the ability to resist knockdown\r<br />-actors can regain their knockdown resistance after a certain amount of time has passed without taking hits from power attacks\r<br />-Different weapon types have different knockout and guardbreak abilities\r<br />-only 2H weapons can guardbreak\r<br />-dual wield can naturally guardbreak because their bash has multiple hits\r<br />[color=#FFFF00]Note: unarmed bash works the same way (trolls love to abuse this)[/color]\r<br />[color=#FFAA00]KO chance tier: Warhammer&gt;Battleaxe&gt;Greatsword&gt;Fists&gt;Mace&gt;Waraxe&gt;Sword&gt;Shield(With Deadly Bash Perk)&gt;Knife[/color]\r<br />[color=#FFAA00]Guardbreak ability tier: Greatsword&gt;Battleaxe&gt;Warhammer\r<br />[color=#FFAA00]Chance to KO%: Onehanded Weapons=Onehanded skill/4, Twohanded Weapons=Twohanded skill/2, Knife=Onehanded skill/6.66[/color][/color]\r<br />[color=#FFAA00]Bonus Chance to KO%: Mace+10, Axe+5, Warhammer+15, Battleaxe+5, Hand to Hand+15[/color]\r<br />[color=#FFAAAA]*A big thank you to Sydroxia for suggesting this feature*[/color]\r<br />\r<br />[[color=#00FF00]blocking[/color]]\r<br />-blocking attacks will give you a speed advantage\r<br />-depending on the situation this will allow you to make an effective reposte\r<br />\r<br />[[color=#00FF00]combat variety[/color]]\r<br />-1h + magic is now a viable combat option. You can open up enemies at a range with magic,\r<br />then move in with melee.\r<br />-Regular 2h strikes have lengthy stagger when not blocked\r<br />-2H has great defensive and offensive capabilities with the reposte feature\r<br />-1h+shield naturally has much higher atk speed when attacking after block, compared to 2h\r<br />-you no longer need a mod to block with dual wielding, since you can just interrupt your enemy before they land an attack\r<br />-dual wield has great advantages over other weapons in higher levels because of their high attack speed and ability to combo\r<br />-dual wield maces/axes are great for knocking down enemies\r<br />-1h+unarmed is now a viable combat style\r<br />-summoned animals can KO enemies, especially ones with high onehanded skill\r<br />\r<br />\r<br />[center][size=3]BIG thanks to proksi for letting me share this mod. The newer version of EHS can be found [url=http://www.nexusmods.com/skyrim/mods/62856/?]here[/url][/size]&#33;[/center]\r<br />\r<br />[[color=#00FFFF]bloat prevention[/color]]\r<br />-confirmed fully functional via [url=http://www.nexusmods.com/skyrim/mods/52363/]Save Game Script Cleaner[/url]\r<br />-actors out of range from the player will automatically remove the script\r<br />-the script is removed on cell transition\r<br />-the script is automatically removed on death\r<br />-also works on summons after they expire\r<br />\r<br />[[color=#00FFFF]tested to work with[/color]]\r<br />-Ultimate Combat (turn NPC stagger resist on, and set bow stagger % to 0 for maximum compatibility)\r<br />-Dance of Death\r<br />-TK Dodge/TK Combat\r<br />-TK Hitstop - RECOMMENDED :) (please read the performance tweaking section of this description)\r<br />[color=#FFFF00]Note about perks:\r<br />-none of the vanilla perks have been changed or altered\r<br />-all the tweaks to unarmed and attack speed is done with ehse&#39;s own perks and condition\r<br />-I also HIGHLY recommend using the Attack Commitment mod by taro8\r<br />[/color]\r<br />[[color=#00FFFF]compatibility patches[/color]]\r<br />-SPERG (onehand/restoration perks should now work with EHSE&#39;s unarmed combat and monk auras)\r<br />-PerMa (same as above, perks from PerMa should apply to unarmed now)\r<br />-Ordinator (same as above)\r<br />-Requiem (same again, also fixes the weird value set in armsman20)\r<br />-Bleed Them Dry\r<br />-Duel\r<br />-Violens\r<br />\r<br />[[color=#00FFFF]requirements[/color]]\r<br />-SkyUI or MCM \r<br />-SKSE (For SkyUI)\r<br />\r<br />[[color=#00FFFF]Performance tweaking[/color]]\r<br />-With version 1.1250, EHSE should be running well even with 30+ enemies on screen. But your FPS, and enb preset can effect EHSE&#39;s performance. \r<br />-If you&#39;re using a graphics intensive preset or get &gt;40fps, then I recommend using EHSE with TK Hitstop. EHSE was made with using TK hitstop, dodge, and Ultimate combat in mind. \r<br />-For FPS&lt;40 With hitstop, set the stoptime value to around 0.8 - 1.6 (if it&#39;s still sluggish, then just max it out) \r<br />-For ENB with FPS&gt;40  stoptime value to around 0.3 works great\r<br />-Setting blur to 0 also helps\r<br />-In skyrim.ini in the &#34;papyrus&#34; section, set bEnableLogging, bEnableTrace, and bLoadDebugInformation to 0\r<br />-You don&#39;t need them on unless you are debugging.\r<br />[s]-If you&#39;re not satisfied with the mod&#39;s performance you can tweak your skyrim.ini to make it a bit faster\r<br />-to do this go under the &#34;[Papyrus]&#34; section\r<br />-edit &#34;fUpdateBudgetMS=1.2&#34; to a value LESS than 2\r<br />-if you wish to go a little bit above (don&#39;t do it man), i highly recommend keeping it below 1.6 \r<br />-DO NOT CHANGE ANY OF THE MEMORY SETTINGS, or [i]fPostLoadUpdateTimeMS[/i]\r<br />-[i]fExtraTaskletBudgetMS [/i]takes time out of other script tasklets under high stress situations\r<br />-by default it is equal to [i]fUpdateBudgetMS[/i], so it can potentially stop other script tasklets\r<br />-im not sure if that&#39;s a good thing, but I have no idea how the game decides which scripts to take time out of and why\r<br />-conclusion: you should probably set [i]fExtraTaskletBudgetMS [/i]to equal [i]fUpdateBudgetMS[/i] (but i usually leave it at 1.2, it&#39;s default value)[/s]\r<br />\r<br />[[color=#00FFFF]uninstall[/color]]\r<br />-Use the brawl spell to switch off EHSE\r<br />-Wait until it expires\r<br />-Save\r<br />-Remove &#34;Every Hit Staggers.esp&#34; \r<br />-Remove &#34;Every Hit Staggers.bsa&#34;\r<br />-Remove all scripts with a filename starting with &#34;ehs_&#34; if you use the non bsa version\r<br />\r<br />[[color=#00FFFF]plans for future updates[/color]][s]\r<br />-Make slowdown mechanic compatible with all mods that change attack speed[/s]\r<br />[s]-The next release will be 1.0. All the major mechanics are complete and all the bugs I&#39;ve found have been taken care of plus I&#39;ve implemented as much anti save bloat as I can. 1.0 will also have better knockdown mechanics. Warhammers/Maces/Waraxes/Battleaxes will have different bonus chance to KD. Greatswords will have stronger guardbreak, Battleaxes will be a mix of both guardbreak and KD chance. 1H Swords won&#39;t have any bonuses except their natural fast animation speed and reach.[/s]\r<br />[s]-Will implement camera shake on hitting enemies \r<br />-LeftHandWeapon+UnarmedRight, and H2H is missing out on all the fun, damage for unarmed is worthless, so I&#39;m cooking up an optional add-on for unarmed.\r<br />-Keeping in line with EHS principles, I&#39;ll be sure it will be compatible with other unarmed mods. \r<br />-I overlooked magic when I reimplemented recoil. Magic will be able to disrupt enemies the way weapons and H2H does in the next release.\r<br />-I feel like the balancing on spell stagger isn&#39;t good enough. I&#39;ll have to implement a poise-like mechanic like i did with unarmed. [/s][s]\r<br />-In the next version I will make your total unarmed damage viewable on the MCM \r<br />-Going to have to add a toggle switch for unarmed damage and onehanded exp gain\r<br />-Versions after 1.1010 will include both a BSA and non BSA version of the mod[/s]\r<br />[s]-Will add more monk spells, Occult Fists is meant to emulate a steel grade mace.[/s]\r<br />-Will add more dual wield combos, probably (someday)\r<br />\r<br />\r<br />[center][Random gameplay 0.9600 + speed compatibility demonstration][/center][center][youtube]_m_RRuNmbgo[/youtube][youtube]X_0LaBxlIXU[/youtube][/center]\r<br />\r<br />[center][size=4]NEW FEATURES IN 1.1000[/size]\r<br />[Unarmed damage is now affected by Onehand skill level]\r<br />[Attacking with unarmed wlll train your Onehand skill]\r<br />[New spell for Monk type players: Will allow you to improve unarmed damage using Restoration skill level]\r<br />[The spell strength will also be improved with onehanded damage modifiers, like enchantments and perks&#33;&#33;]\r<br />[The spell is basically a buff that acts like a normal onehanded weapon, instead of improving it with Smithing, you improve it with Restoration]\r<br />[Keeping in line with EHS, NONE of the vanilla perks were altered or modified]\r<br />[Reimplemented recoil from EHS, stagger will now have more variety against NPC type Actors]\r<br />[Recoil triggers when an attacker is interrupted, except for when interrupted by a bash]\r<br />[Each weapon type now has different staggering capabilities, it&#39;s not judged by just 1h or 2h anymore]\r<br />[Enemies gain resistance to stagger against unarmed if they take too many hits in a short amount of time]\r<br />[So if you keep spamming unarmed on enemies they will eventually get tired of your bull and will smack you across the face]\r<br />[This isn&#39;t exclusive to enemies though, so feel free to smack a troll across the face if they hit you too many times]\r<br />[Added shaky cam]\r<br />[youtube]f2cD2h3gGNY[/youtube]\r<br />\r<br />\r<br />[size=4]NEW IN 0.9700[/size][size=4]\r<br />[/size][Weapon bash knockout mechanics]\r<br />[youtube]hOs3G8fsA-8[/youtube]\r<br />\r<br />\r<br />[size=4]EHSE with Ultimate Combat and Dance of Death 1.1020[/size] \r<br />[youtube]3SZZSrTVZ3w[/youtube]\r<br />\r<br />\r<br />[size=4]New in 0.9600[/size]\r<br />[size=2][Reworked attack speed mechanics now affect characters that miss attacks][/size]\r<br />[youtube]2PJfm1n6pqI[/youtube]\r<br />\r<br />\r<br />[Demonstration with Twohanded around lvl 40]\r<br />[youtube]FKNUOJGSU44[/youtube]\r<br />[Onehanded with skill level around 40, can bash stagger but normal hits require more skill to flinch]\r<br />[youtube]S4bhW3MCj6g[/youtube][youtube]AX2cKQAGiR4[/youtube]\r<br />Note, even with low level skill you can still stagger humans and mer every time. Unless their weight is ridiculously high.[/center]\r<br />\r<br />\r<br />1.1250\r<br />-greatly improved performance\r<br />-rebalanced stagger strength progression\r<br />1.1200\r<br />-Added visual tweaks to the Unarmed spells :From 1.1100 tweak patch\r<br />-Removed Image space mod on Occult Fist\r<br />-rebalanced cloak spell stagger, they are now useful in combat ESPECIALLY with high level destruction\r<br />-adds unarmed attack speed\r<br />-dual savagery, dual flurry, and bonebreaker perks now work on Unarmed\r<br />-dual savagery and dual flurry act like how they would with dual wield weapons (must equip both unarmed or unarmed + lefthand weapon)\r<br />1.1100\r<br />-new dungeon, and new spells for unarmed combat\r<br />1.1020\r<br />-fixes some glitches where certain types of enemies can get staggered while already knocked down\r<br />-Draugr&#39;s are a pain in the butt, had to rework the scripts just to get them to recoil since for some reason GetAnimationVariableBool() doesn&#39;t work on them\r<br />-it might have just be a compatibility problem, but it&#39;s been solved anyways\r<br />-Most of the Papyrus runtime warnings/errors are gone for good this time. I think. \r<br />1.1015\r<br />-bugfixes\r<br />-unarmed damage modifications can now be toggled off in the MCM\r<br />-new option in MCM to reverse the effects of the bugs in 1.1010, and 1.1000 (for users of 1.0000 and below, you can ignore this option)\r<br />1.1010\r<br />-fixes the bug where you stagger yourself after hitting an enemy with a killing blow\r<br />-adds mcm toggle option for shaky cam, more options to come (probably)\r<br />-unarmed recoiling, magic recoiling, and magic stagger is now affected by the poise-like mechanic\r<br />-other bugfixes and compatibility tweaks\r<br />1.1000\r<br />-beta release, adds unarmed\r<br />1.0000\r<br />-Different weapon types now have different knockout and guardbreak abilities.\r<br />0.9702\r<br />-Again, more anti savebloat. Have to be 100% sure this mod won&#39;t ruin anyones savefile.\r<br />0.9700\r<br />-NEW FEATURE, added weapon bash knockdown\r<br />-Bethesda made horses immune to knockdown for some reason, so this feature won&#39;t work on them\r<br />-Brawl mode spell is now fully functional, this spell makes it easier for updating. \r<br />-Upon updating, if some enemies won&#39;t stagger, then use the brawl spell to switch off EHS, then use the brawl spell again to reactivate\r<br />-balance tweaks for the new knockout mechanics\r<br />-even more anti bloat features\r<br />0.9602\r<br />-Cleaned up all the Papyrus Runtime Errors\r<br />-Rebalanced reposte on block so it doesn&#39;t do crazy stacking (It now works the same way the rest of the speed mechanics does)\r<br />-Everything is packed into the BSA now, so if you still have scripts with [ehs_], I suggest you delete them\r<br />-Fixed all the bugs I could find by myself, If you find any bugs please report them so I can fix them\r<br />0.9601\r<br />-Bugfixes\r<br />0.9600 -MAJOR UPDATE\r<br />-Animation tracking and slowdown is now completely different\r<br />-If there was save bloating problem before this version, they should be gone now\r<br />-Slowdown should now be compatible with all mods, even ones that affect attack speed\r<br />-Fixed a bug where allies and other NPCs can break your combo string\r<br />0.9503\r<br />-Rebalances slowdown on two handed weapons to feel more weighted\r<br />0.9502\r<br />-Removed some unintended combos\r<br />0.9501\r<br />-Added skill based stagger strength on power attacks",
  "categoryId": "77",
  "version": "1.1250",
  "author": "Spezzy",
  "createdUnix": "1423911965",
  "updatedUnix": "1457203299",
  "containsAdultContent": false,
  "uploadedBy": "hokujin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000148854",
      "name": "Bleed Them Dry compatibility patch for BTD3.2",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "17",
      "fileName": "Bleed Them Dry compatibility patch for 3.2-62640-.zip",
      "uploadedUnix": "1424732211",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ddbf3f59d5cb8c2376d8d8adfce8b4c20dd9297a52b76846eb5ce773c51a8745/analysis/1424732222/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bleed%20Them%20Dry%20compatibility%20patch%20for%203.2-62640-.zip?fid=1000148854&ttl=1535851310&ri=8192&rs=8192&setec=8ad41f780cf9ab979d7681bb227762c5"
    },
    {
      "fileId": "1000149120",
      "name": "Duel Compatibility Patch for Duel 7.6.3.1",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Duel Compatibility Patch-62640-.zip",
      "uploadedUnix": "1424899562",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/69a3ea9974713ff1cc5637bd4c80aeb9511d214574178c8e223f419c651be1b2/analysis/1424899623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Duel%20Compatibility%20Patch-62640-.zip?fid=1000149120&ttl=1535851311&ri=8192&rs=8192&setec=b7bedab5db97234520df289d36756dfc"
    },
    {
      "fileId": "1000149122",
      "name": "Violens Compatibility Patch for Violens 2.0",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Violens Compatibility Patch-62640-.zip",
      "uploadedUnix": "1424899729",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0f1eb3ec398ccaa59c0015b4e79e399aaaf6f0ba9c71a81a46e1324eb329fc36/analysis/1424899683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Violens%20Compatibility%20Patch-62640-.zip?fid=1000149122&ttl=1535851311&ri=8192&rs=8192&setec=50e95a2d4014019c87bb194acf61dbac"
    },
    {
      "fileId": "1000150887",
      "name": "EHSE 1.1100 (update11)",
      "version": "1.1100",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "175",
      "fileName": "EHSE 1.1100 (update11)-62640-1-1100.zip",
      "uploadedUnix": "1425956277",
      "modVersion": "1.1100",
      "virusScanUrl": "https://www.virustotal.com/file/a0327c3e6b8a6af85fc52229a5a3787e438fc590e7cc5ecd2a53668f4982c35b/analysis/1425956283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1100%20%28update11%29-62640-1-1100.zip?fid=1000150887&ttl=1535851311&ri=8192&rs=8192&setec=af072135c75da2f8722b3d92e1fe33fb"
    },
    {
      "fileId": "1000151443",
      "name": "EHSE 1.1200 (update12)",
      "version": "1.1200",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "180",
      "fileName": "EHSE 1.1200-62640-1-1200.zip",
      "uploadedUnix": "1426331950",
      "modVersion": "1.1200",
      "virusScanUrl": "https://www.virustotal.com/file/99b3071b1c1a3fd707017504d316adebacb70e87845ce5eae26551e8976159da/analysis/1426332003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1200-62640-1-1200.zip?fid=1000151443&ttl=1535851312&ri=8192&rs=8192&setec=3e3ea554c67d68d20e393144e101ea24"
    },
    {
      "fileId": "1000151545",
      "name": "ab_Alternate Occult Fist graphics for 1.1200",
      "version": "1.1200",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "73",
      "fileName": "Alternate Occult Fist graphics for 1.1200-62640-1-1200.zip",
      "uploadedUnix": "1426384971",
      "modVersion": "1.1200",
      "virusScanUrl": "https://www.virustotal.com/file/1df860e060a4c286883a3fe983a313834a59a5771f0ae39419a4200b8816cfbe/analysis/1426384983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Occult%20Fist%20graphics%20for%201.1200-62640-1-1200.zip?fid=1000151545&ttl=1535851312&ri=8192&rs=8192&setec=30202c53934b0a6e2cda5e2b07b71a2f"
    },
    {
      "fileId": "1000153264",
      "name": "aa_Patch for Brawl Bugs Patch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Patch for Brawl Bugs Patch-62640-.zip",
      "uploadedUnix": "1427505323",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/09b7f058d2e0cd6e788b0acd06efa96a48c017b640b23171c04801f5a9ca3b32/analysis/1427505362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20Brawl%20Bugs%20Patch-62640-.zip?fid=1000153264&ttl=1535851313&ri=8192&rs=8192&setec=f14261cbb452e071b576f063242b1ede"
    },
    {
      "fileId": "1000174817",
      "name": "EHSE 1.1250 (update13)",
      "version": "1.1250",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "256",
      "fileName": "EHSE 1.1250 (update13)-62640-1-1250.zip",
      "uploadedUnix": "1441500651",
      "modVersion": "1.1250",
      "virusScanUrl": "https://www.virustotal.com/file/c0365e3f0b1c3a24953a66b94c0679d6dff0399289f12c729e020097ce45060c/analysis/1441500663/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1250%20%28update13%29-62640-1-1250.zip?fid=1000174817&ttl=1535851314&ri=8192&rs=8192&setec=f54fbb95c0c723d34e38882350938d5c"
    },
    {
      "fileId": "1000175894",
      "name": "ab_SPERG compatibility patch",
      "version": "1.1250",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "ab_SPERG compatibility patch-62640-1-1250.zip",
      "uploadedUnix": "1442163618",
      "modVersion": "1.1250",
      "virusScanUrl": "https://www.virustotal.com/file/696bad21951a7c15a7308062e8650a706f82df47423e685bf4e8c174dd5b930e/analysis/1442163664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ab_SPERG%20compatibility%20patch-62640-1-1250.zip?fid=1000175894&ttl=1535851314&ri=8192&rs=8192&setec=43ce9eba80b81b1c8d1bda2badaf6ad8"
    },
    {
      "fileId": "1000175967",
      "name": "ac_PerMa compatibility patch",
      "version": "1.1250",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "ac_PerMa compatibility patch-62640-1-1250.zip",
      "uploadedUnix": "1442191019",
      "modVersion": "1.1250",
      "virusScanUrl": "https://www.virustotal.com/file/109cb89a79a6cae6fe9295aa7f09781c3a48f248d1ab5791ea0d0be5b7749a72/analysis/1442191023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ac_PerMa%20compatibility%20patch-62640-1-1250.zip?fid=1000175967&ttl=1535851314&ri=8192&rs=8192&setec=514fe8332b700c20db118f85911fb61c"
    },
    {
      "fileId": "1000175975",
      "name": "ab_SPERG compatibility patch2",
      "version": "1.1250",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "ab_SPERG compatibility patch2-62640-1-1250.zip",
      "uploadedUnix": "1442192800",
      "modVersion": "1.1250",
      "virusScanUrl": "https://www.virustotal.com/file/8686c014ea8faa3932ffebef7df50b9809c0bd6bc0d6eb189e8ab8b0075acf8d/analysis/1442192823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ab_SPERG%20compatibility%20patch2-62640-1-1250.zip?fid=1000175975&ttl=1535851315&ri=8192&rs=8192&setec=8fc104bb29dd70f35eac7a197ac9e536"
    },
    {
      "fileId": "1000176093",
      "name": "ab_SPERG compatibility patch3",
      "version": "1.1250",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "ab_SPERG compatibility patch3-62640-1-1250.zip",
      "uploadedUnix": "1442272936",
      "modVersion": "1.1250",
      "virusScanUrl": "https://www.virustotal.com/file/516a59d3c637e9b7df5fd4e3c3431499c2b18f413b6e0f8f44de2a5171314fe7/analysis/1442272983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ab_SPERG%20compatibility%20patch3-62640-1-1250.zip?fid=1000176093&ttl=1535851315&ri=8192&rs=8192&setec=9562b12cce7f701a8c1e57b2af230006"
    },
    {
      "fileId": "1000176094",
      "name": "ad_Ordinator compatibility patch",
      "version": "1.1250",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "ac_Ordinator compatibility patch-62640-.zip",
      "uploadedUnix": "1442273035",
      "modVersion": "1.1250",
      "virusScanUrl": "https://www.virustotal.com/file/9d836c34d08ac0948f692f1180c04e112c7b4bbe961aee86174f584b8e6284eb/analysis/1442273047/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ac_Ordinator%20compatibility%20patch-62640-.zip?fid=1000176094&ttl=1535851316&ri=8192&rs=8192&setec=649ed3b4d1ad6c3c5f2d50fe1211a272"
    },
    {
      "fileId": "1000176891",
      "name": "ae_Requiem compatibility patch",
      "version": "1.1250",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "ae_Requiem compatibility patch-62640-1-1250.zip",
      "uploadedUnix": "1442723659",
      "modVersion": "1.1250",
      "virusScanUrl": "https://www.virustotal.com/file/8998cfbaf49aafbe4ea2c7e850f888d8055022be015fe3b3a13b15322a3fa268/analysis/1442723703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ae_Requiem%20compatibility%20patch-62640-1-1250.zip?fid=1000176891&ttl=1535851317&ri=8192&rs=8192&setec=58ada04a1ea117b89689fe70823a319c"
    },
    {
      "fileId": "1000178475",
      "name": "EHSE 1.1250b Test Version 1",
      "version": "1.1250b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "EHSE 1.1250b Test Version 1-62640-1-1250b.zip",
      "uploadedUnix": "1443495565",
      "modVersion": "1.1250b",
      "virusScanUrl": "https://www.virustotal.com/file/d226716071af09b2e0af59a8f16e56f330f2ed9878cbac081ef135b1d8c04f09/analysis/1443495604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1250b%20Test%20Version%201-62640-1-1250b.zip?fid=1000178475&ttl=1535851317&ri=8192&rs=8192&setec=d311e1e2773b289de808dac299bbb032"
    },
    {
      "fileId": "1000178569",
      "name": "EHSE 1.1250b Test Version 2",
      "version": "1.1250b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "EHSE 1.1250b Test Version 2-62640-1-1250b.zip",
      "uploadedUnix": "1443550780",
      "modVersion": "1.1250b",
      "virusScanUrl": "https://www.virustotal.com/file/bdeb8e54cc2b5db2aa22255d9294f60d1edced49d9efb37306ec8115269120c5/analysis/1443550804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1250b%20Test%20Version%202-62640-1-1250b.zip?fid=1000178569&ttl=1535851318&ri=8192&rs=8192&setec=771b42279386226cba732fdf80838ed6"
    },
    {
      "fileId": "1000178610",
      "name": "zz_Brawl Bugs Patch for 1.1250b",
      "version": "1.1250b",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "Brawl Bugs Patch for 1.1250b-62640-1-1250b.zip",
      "uploadedUnix": "1443567238",
      "modVersion": "1.1250b",
      "virusScanUrl": "https://www.virustotal.com/file/fce64b818e48a53672fb818b78ce32bd7bf505860d4555d32d60e2d73f1955be/analysis/1443567303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Brawl%20Bugs%20Patch%20for%201.1250b-62640-1-1250b.zip?fid=1000178610&ttl=1535851318&ri=8192&rs=8192&setec=e4f93c5b85154fa2e70d48b3465691da"
    },
    {
      "fileId": "1000178740",
      "name": "EHSE 1.1250b Test Version 3",
      "version": "1.1250b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "EHSE 1.1250b Test Version 3-62640-1-1250b.zip",
      "uploadedUnix": "1443652669",
      "modVersion": "1.1250b",
      "virusScanUrl": "https://www.virustotal.com/url/125d1e8f25abbccf299691a7ef1e0c9de7a94cd8972d63387e78bcc72d44dba3/analysis/1443652683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1250b%20Test%20Version%203-62640-1-1250b.zip?fid=1000178740&ttl=1535851318&ri=8192&rs=8192&setec=4004f20fa9bba75dbf6734f11f295c59"
    },
    {
      "fileId": "1000178919",
      "name": "EHSE 1.1250b Test Version 4",
      "version": "1.1250b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "92",
      "fileName": "EHSE 1.1250b Test Version 4-62640-1-1250b.zip",
      "uploadedUnix": "1443753017",
      "modVersion": "1.1250b",
      "virusScanUrl": "https://www.virustotal.com/url/75c1430f313f3f171b24d841147c657ddbd3cc8b9785f2f419aa1623d3305744/analysis/1443753073/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1250b%20Test%20Version%204-62640-1-1250b.zip?fid=1000178919&ttl=1535851319&ri=8192&rs=8192&setec=973727c4207a8b7e95ce1bec4d9b0031"
    },
    {
      "fileId": "1000179678",
      "name": "EHSE 1.1250b Test Version 5",
      "version": "1.1250b",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "92",
      "fileName": "EHSE 1.1250b Test Version 5-62640-1-1250b.zip",
      "uploadedUnix": "1444142531",
      "modVersion": "1.1250b",
      "virusScanUrl": "https://www.virustotal.com/url/df81272d91c567c7453ec4911610c7782c612fb374a8d5784ba2f27d668620bc/analysis/1444142583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1250b%20Test%20Version%205-62640-1-1250b.zip?fid=1000179678&ttl=1535851319&ri=8192&rs=8192&setec=1115d424f589017e30d47c3a28d4e982"
    },
    {
      "fileId": "1000198280",
      "name": "EHSE 1.1250b Test Version 5 attack telegraphing patch",
      "version": "1.1250b",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "75",
      "fileName": "EHSE 1.1250b Test Version 5 attack telegraphing patch-62640-1-1250b.zip",
      "uploadedUnix": "1457203299",
      "modVersion": "1.1250b",
      "virusScanUrl": "https://www.virustotal.com/file/c9774e3150c22b9361be83afd62f3279c06bed8947a8a4dfc574a2efe49be4c7/analysis/1457203384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EHSE%201.1250b%20Test%20Version%205%20attack%20telegraphing%20patch-62640-1-1250b.zip?fid=1000198280&ttl=1535851320&ri=8192&rs=8192&setec=a4b2a17b66b698a51bbd353f23476b32"
    }
  ]
}