{
  "modId": 62736.0,
  "modName": "Eldergleam Shieling",
  "summary": "A loadscreen-free house in the Eldergleam Sanctuary.",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center]\r<br />\r<br />[center][img]http://i.imgur.com/Zd6dbdS.png[/img][/center]\r<br />\r<br />Hello everybody&#33; This small mod adds a loadscreen-free house in the Eldergleam Sanctuary, and is my entry for the [url=https://www.reddit.com/r/skyrimmods/comments/2vbwtq/skyrim_modding_contest_1_build_a_home/]Skyrim Modding Contest[/url] over at r/SkyrimMods.\r<br />\r<br />The file has been cleaned with TES5EDIT, [b][u]REQUIRES HEARTHFIRE[/u][/b], is fully navmeshed and has no scripts, so it should be safe for everybody to use. Still, you should always make a backup save before installing ANY mod, in case something goes wrong. French translation by Shangara available [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/bordeciel/habitations/maison_de_primarbor]here[/url]. Thank you&#33; \r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/3McsrqD.png[/img][/center]\r<br />The house is free to take once you have the key, which I deviously hid somewhere near the vicinity (hint: I am not good at hiding things). It has a map marker visible from the start, so you can fast travel to it immediately. The Eldergleam Sanctuary worldspace data has also been edited (one setting was ticked off) to allow fast travel back and forth.\r<br />\r<br />The place was navmeshed carefully with plenty of navcut boxes in order to avoid deleted navmesh reports and has some idle markers, but it&#39;s really meant as a house for one. The aggressive spriggans have been disabled, but the pilgrims are still around. I&#39;d recommend installing the mod once you&#39;ve finished the quest [url=http://www.uesp.net/wiki/Skyrim:The_Blessings_of_Nature]The Blessings of Nature[/url] to prevent issues.\r<br />\r<br />You will find all vanilla and Hearthfire crafting stations here - tanning rack, smelter, chopping block, armor workbench, anvil, cooking pot, sharpening wheel, oven, enchanter and alchemy lab. Many of them, however, have unique looks which means they will not play the regular animation when activated, but they will work normally otherwise. There is one player-owned bed. 8 planters, an apiary and a fully-functional hatchery are also available.\r<br />\r<br />As an added bonus, you will also find a custom dagger with a unique look, a usable fishing rod and a book written by yours truly. All containers [b][u]except for the apiary[/u][/b] are safe for storage and will not respawn.\r<br />\r<br />\r<br />Here&#39;s a beautiful video by [url=http://www.nexusmods.com/games/users/9742829/?]Ondrea[/url]. Thank you&#33;\r<br />\r<br />[youtube]hTQj7ceKSKQ[/youtube]\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/otrw7yS.png[/img][/center]\r<br />Followers will have a lot of trouble entering the house and will most likely just wait outside. I didn&#39;t want to risk chopping away at the navmesh so they&#39;d enter it normally, because the risk of disaster is too high and the house is meant for one anyway.\r<br />\r<br />As this is an open house there is a good chance that you&#39;ll take a performance hit. Nothing I can do there, sorry. My clutter-happy self already showed quite a bit of restraint while decorating, and there is a grand total of 3 lights illuminating the whole place (and two of them are outside over the enchanter and alchemy lab, so it is basically one light source for the whole house). Without at least one light source, the place would be too dark.\r<br />\r<br />The file should be compatible with other mods that edit the Eldergleam Sanctuary worldspace, as I tried to keep the edits to existing objects to a minimum.\r<br /> \r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/RsTIlbL.png[/img][/center]\r<br />\r<br />To install, extract the contents of your downloaded file to your &#34;Steam/SteamApps/Common/Skyrim/Data&#34; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Or you can use the Mod Manager to download the mod automatically. To uninstall, simply delete the files from your Data folder, and you&#39;re good to go. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/6ppPbRY.png[/img][/center][b]- [u]02/16/2015:[/u][/b] Initial release.\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://i.imgur.com/W4TQSi4.png[/img][/center]\r<br />[b]\r<br />- LORE&#33;&#33;&#33;1 NOT LORE FRIENDLY&#33;&#33; DEAD ANIMALS IN KYNARETH&#39;S SANCTUARY AND STUFF&#33;&#33; RARGH&#33;&#33;[/b]\r<br />- [url=http://i.imgur.com/NIXnCtS.gif]Indeed.[/url]\r<br />\r<br />[b]- I hate [thing] and [thing] and [thing]&#33; You should have done [thing] and [thing] instead&#33; And while you&#39;re at it remove [thing] and [thing] and add [thing] and [thing]&#33; And [thing] is NOT LORE FRIENDLY&#33; FIX THIS&#33;[/b]\r<br />- This isn&#39;t a restaurant. If you don&#39;t like something, use the console to disable it, remove it with the Creation Kit or TESEDIT, or sell it off. [url=http://i.imgur.com/XumZOt2.gif]In other words...[/url]\r<br />\r<br />[b]- HEARTHFIRE WORST DLC EVER&#33; Non-Hearthfire version pls&#33;[/b]\r<br />- No. I wanted planters and the hatchery. [url=http://i.imgur.com/Jw9VaAX.gif?1]In other words...[/url]\r<br />\r<br />[b]- THERE IS CLIPPING EVERYWHERE&#33; When I open the doors they clip through stuff and things&#33;[/b]\r<br />- Yep. Again, there&#39;s not that much room in the house so not much I can do. You can live with a bit of clipping while animations play, surely. [url=http://i.imgur.com/O4tVc4m.gif?1]In other words...[/url]\r<br />\r<br />[b]- I don&#39;t like the new crafting stations&#33; They make no sense or something&#33; Change them&#33;[/b]\r<br />- Nah. Using the same furniture every single time gets boring, and I was having trouble fitting everything in. [url=http://i.imgur.com/ymt1qd1.jpg?1]In other words...[/url]\r<br />\r<br />[b]- I hate everything being static&#33; I wanna pick things up&#33;[/b]\r<br />- There are three main reasons why things are static. First, the house is tiny and clutter would be flying around all the time. Second, it would greatly hurt framerate to have so many little things moving around at once and the house is already rather demanding, being in the open and all. And third, it gives me much more freedom when it comes to decoration. [url=http://i.imgur.com/AYOKaDI.gif]In other words...[/url]\r<br />\r<br />[b]- Can I use some of these files on my own mod?[/b]\r<br />- A bunch of things I&#39;m using are already modder&#39;s resources, so just look around the credits tab to look for what you&#39;d like to use. If you cannot find the thing you want there, it probably means I made it myself. Feel free to ask if you&#39;re not sure.\r<br />\r<br />[b]- The house is too small, make it bigger&#33;[/b]\r<br />- Nope. I wanted it to be a house for one. If you want to put more beds or whatnot, do it yourself with the Creation Kit or TESEDIT. [url=http://i.imgur.com/6DdDc.gif]In other words...[/url]\r<br />\r<br />[b]-Add children&#39;s beds and stuff&#33;[/b]\r<br />- I&#39;ve never managed to successfully add children&#39;s beds to mods (and yes, I&#39;m talking about [url=http://www.nexusmods.com/skyrim/mods/29249/?]Hearthfire Multiple Adoptions[/url] - I&#39;m just really, really dumb). So I won&#39;t be doing it, but if someone else wants to, they certainly can. [url=http://i.imgur.com/ulMiiOj.gif]In other words...[/url]\r<br />\r<br />[b]- Is this compatible with [mod]?[/b]\r<br />- If you have a mod that makes heavy changes to the Eldergleam Sanctuary, there could be issues, although my mod is as clean as I could make it. If you find any conflicts, please let me know so I can list them here.\r<br />\r<br />[b]- How come the mod looks different in my game than your screenshots?[/b]\r<br />- I am using several retextures in my own game and my own SweetFX preset, so results may vary.\r<br />\r<br />[b]- The mod is awful/glitchy/buggy/etc. I am going to uninstall it and I must let everybody know&#33;[/b]\r<br />- Sad to see you go~\r<br />\r<br />[b]- The mod sucks&#33;[/b]\r<br />- So does a vaccuum cleaner ;)\r<br />\r<br />[size=4][center][color=#1E90FF]FOR THE FULL LIST OF CREDITS, PLEASE CHECK THE &#34;CREDITS AND PERMISSIONS&#34; TAB [img]http://forums.nexusmods.com/public/style_emoticons/dark/wub.gif[/img]\r<br />[/color][/center][/size]\r<br />[center][url=http://www.nexusmods.com/games/users/donate/?mode=straight&id=2543917][img]http://i.imgur.com/V6qmsU9.png[/img][/url][/center]\r<br />[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Jokerine",
  "createdUnix": "1424115121",
  "updatedUnix": "1424107913",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000147718",
      "name": "Eldergleam Shieling v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17448",
      "fileName": "Eldergleam Shieling v1-62736-1-0.rar",
      "uploadedUnix": "1424107913",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c99151cf39cc0bb9dc13498a108358b6c14ceb7b047083b1c844a826bfb3febe/analysis/1424107940/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Eldergleam%20Shieling%20v1-62736-1-0.rar?fid=1000147718&ttl=1535851426&ri=8192&rs=8192&setec=9b52d7b90806a4886c0df4ea95704ceb"
    }
  ]
}