{
  "modId": 62753.0,
  "modName": "Lee Standalone Follower",
  "summary": "A martial artist follower from Cyrodiil, specialized in twin dagger fighting style.",
  "descriptionHtml": "[color=#E42217][b]Lee Standalone Follower[/b][/color]\r<br />\r<br />By: JetRock\r<br />\r<br />\r<br />\r<br />[center][/center]   Born in Cheydinhal, Lee name indeed not sound as a native Imperial name, it&#39;s a family name that passed down from his father that also passed down many generation from his long lost ancestor. When Lee have reached teen age his parents enrolls him at a fighter guild to be trained there, today Lee Draconius or often called Dragon Lee by his friends and opponent whom he has beat them on a duel, has become a martial artist expert, he nearly always participated on official or underground gladiatorial tournaments, other than that, he life by teaching martial arts to many youths. Also for him,doing heavy physical exercises everyday is the most beloved activity.\r<br />\r<br />   According to some veterans at fighter guild, although Lee was born in Imperial land and his mother was a native Imperial, his blood was not a pure Imperial, they says his father rumoured as a descendant of an Akavirii explorer who survived from Tsaesci invasion, because the explorer and his crews were in the middle of the ocean at time when the invasion begin, an oracle among the crew directly shows the explorer his vision, the scene of how terrifying Tsaesci horde and their raid on the explorer&#39;s hometown that leaves only rubble and corpses there. Despite mixed of sad, anger, and confusion feeling, they continue to sail over 2500 miles to west, after a bad day of being caught in a terrible storm in the middle of nowhere, they luckily washed ashore on Morrowind coast, because their ship has gone, they later decide to retired, they blend with the native and settled in secret in Tamriel forever with no intention to go back home.\r<br />\r<br />   Recently, Lee want to improve his skill and knowledge more and see the real battle himself on the war zone, also searching for a new opportunities, friends and even opponents, so he decide to travel to Skyrim know that a civil war is happening there, while on the trip to Solitude, he stop by at Four Shield Tavern, and after having a chit chat about local legends with another customer there, he fascinated with the story that the legendary Dovahkiin has arrived at Skyrim to fulfill his/her prophecy, of course after that, meet the Dovahkiin is become his priority, he realize if he could spend a time with the Dovahkiin, he would learn many things about dragon which have close relation to his other half origin as an Akavirii.\r<br />\r<br />\r<br />\r<br />[center][color=#FFD700][b]==Basic Info==[/b][/color][/center]\r<br />Name: Lee Draconius a.k.a. Dragon Lee\r<br />Race: Imperial\r<br />Sex: Male\r<br />Body Style: SOS Default\r<br />Armor Style: Light Armor\r<br />Weapon Style: Dual Daggers\r<br />Location: Four Shields Tavern in Dragon Bridge\r<br />\r<br />Other Notes:\r<br />-He is essential and level up with player,\r<br />-He is marriageable,\r<br />-He was made from monk class with dual wielder combat style, and given some perks which related to them,\r<br />-Give him a pair of daggers so he can use his full potential and fight beside you like a maniac,\r<br />-My original vision was to makes him as an unarmed fighter, but we all know how Skyrim vanilla unarmed combat system is, which would makes him a burden rather than a support to dovahkiin,*\r<br />-If you noticed any differences of Lee&#39;s body with the screenshots, that&#39;s because I doesn&#39;t have any permission yet from the body textures mod authors to use their assets, maybe I would add it on later update if the permission has been granted, and for now it&#39;s just SOS default textures.\r<br />\r<br />*It turns out dr0neshuffler can made the vision to become reality, please check his [url=http://www.nexusmods.com/skyrim/mods/63863]Brawler Lee[/url] version. Also, for anyone who feels Lee stole the show in battle, Nacke has created a [url=http://www.nexusmods.com/skyrim/mods/65313]non-OP version of Lee[/url] who more suitable to be your sidekick rather than a competitor in enemy killing business (his version also have some nice additions).\r<br />\r<br />\r<br />[center]\r<br />[color=#FFD700][b]==Installation==[/b][/color][/center]\r<br />1. Extract the downloaded file, copy the contents of the extracted files (meshes, textures, and .esp) to the Data folder in your Skyrim installation folder,\r<br />2. Activate the corresponding (.esp) on your Data Files in Skyrim launcher or using Nexus Mod Manager.\r<br />\r<br />\r<br />\r<br />[center][color=#FFD700][b]==Uninstallation==[/b][/color][/center]\r<br />1. Just delete all the files that come from this mod in the Data folder in your Skyrim installation folder, and beware that Lee should be dismissed and your character should be in different cell from Lee on the latest save before uninstalling.\r<br />\r<br />\r<br />\r<br />[center][color=#FFD700][b]==Compatibilities==[/b][/color][/center]\r<br />-Tested and works great with [url=http://www.nexusmods.com/skyrim/mods/14037]UFO[/url] (Recommended),\r<br />-So far, this mod doesn&#39;t cause any trouble with 207 active mods at my Skyrim.\r<br />\r<br />\r<br />\r<br />[center][color=#FFD700][b]==Credits==[/b][/color][/center]\r<br />-[url=http://www.nexusmods.com/skyrim/mods/12951]ECE Team&#39;s Enhanced Character Edit[/url],\r<br />-[url=http://www.nexusmods.com/skyrim/mods/10168]Apachii&#39;s Sky Hair[/url],\r<br />-[url=http://www.nexusmods.com/skyrim/mods/38301]Drumber&#39;s Realistic Male Face[/url],\r<br />-VectorPlexus&#39;s SOS,\r<br />-[url=http://www.nexusmods.com/skyrim/mods/5588]LordOfWar&#39;s The Witcher 2 Models[/url],\r<br />-dr0neshuffler,\r<br />-Nacke,\r<br />\r<br />And, of course\r<br />\r<br />-Bethesda Softworks.",
  "categoryId": "96",
  "version": "1.0a",
  "author": "JetRock",
  "createdUnix": "1424266389",
  "updatedUnix": "1424631599",
  "containsAdultContent": false,
  "uploadedBy": "JetRock",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000147932",
      "name": "Lee Standalone Follower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20200",
      "fileName": "Lee Standalone Follower-62753-1-0.rar",
      "uploadedUnix": "1424257864",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/27c929d68331e2575e86539f62e8960f0f123b48694cdb4b15ee3199e06ae2b9/analysis/1424257931/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lee%20Standalone%20Follower-62753-1-0.rar?fid=1000147932&ttl=1535851443&ri=8192&rs=8192&setec=bd3241143d6c12bd162d7a00da0ce9cf"
    },
    {
      "fileId": "1000148622",
      "name": "Lee Standalone Follower - Alternative",
      "version": "1.0a",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "24668",
      "fileName": "Lee Standalone Follower - Alternative-62753-1-0a.rar",
      "uploadedUnix": "1424631599",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/8a2827bb500af47b53c22c756dd6d182faa1897661e92e385472ae018b0256d2/analysis/1424631614/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lee%20Standalone%20Follower%20-%20Alternative-62753-1-0a.rar?fid=1000148622&ttl=1535851443&ri=8192&rs=8192&setec=4124f4a8b7213af78aae161aafa746b0"
    }
  ]
}