{
  "modId": 62755.0,
  "modName": "Combat Evolved - Portuguese - Brazil",
  "summary": "Tradução do mod Combat Evolved para Português do Brasil.",
  "descriptionHtml": "[size=5]\r<br />[size=6]- [color=#ffff00]Port[/color][color=#00ff00]uguês[/color][/size][/size]\r<br />\r<br />[color=#ffff00][size=4]NOVA VERSÃO 2.4&#33;&#33; (18/03/2015)[/size][/color]\r<br />\r<br />[size=4]Descrição do mod original por [url=http://www.nexusmods.com/skyrim/users/3822090/?]CrushBoss[/url][/size]\r<br />\r<br />[size=3]Este é um mod leve sem script de combate e porporciona um aumento na dificuldade. Ele é feito para complementar e trabalhar com os três grandes reparadores de combate: [url=http://www.nexusmods.com/skyrim/mods/2700/?]Duel - Combat Realism[/url], [url=http://www.nexusmods.com/skyrim/mods/5485/?]Deadly Combat[/url], e [url=http://www.nexusmods.com/skyrim/mods/36006/?]Ultimate Combat[/url] . Ele pode ser executado por conta própria e é equilibrado por conta própria, mas você vai perder várias características que as revisões de combate apresentam. Ele ainda funciona bem com Skyrim Redone (Skyre) e ASIS mas existem menores.\r<br />\r<br /> Este mod foi projetado para ser compatível com quase tudo. Nenhum registro NPC foi modificado, vantagens, ou listas nivelamento. Toda a magia deste mod é realizada através de estilos de combate, as configurações do jogo, e as Magias dos NPC (feitiços do Jogador não são afetados).\r<br />\r<br /> Combat Evolved muda quase todos os aspectos de combate. O combate é mais difícil, realista e desafiador&#33; Os inimigos são mais agressivos e são mais espertos. Os inimigos irão geralmente apresentam um maior nível de desafio para o jogador a todos os níveis.\r<br />\r<br /> Esta modificação torna o combate mais perigoso e implacável. Uma das minhas maiores queixas em vanilla Skyrim e até mesmo com os mods de combate populares lá fora, é que uma vez que você bate no nível 30 ou acima, o combate é uma piada e que o jogador é quase invencível. Com os meus inimigos modernos são uma ameaça em qualquer nível. Já não se pode ter quatro inimigos todos lutando com você.\r<br />\r<br /> Atordoar, derrubar, habilidades inimigas e danos dos inimigos (e muito mais) são todos aprimorados para serem mais envolventes e realistas. Se você não se movimentar, rodeá-los, e usar ativamente seu cérebro, você terá uma morte dolorosa. Combate furtivo também foi melhorado para ser mais difícil. Já não se pode eliminar os inimigos à distância e acabar com todos eles.\r<br />\r<br /> Os inimigos vão tentar ativamente para cercar o jogador e ataque. Eles também Bash e bloquear mais vezes e tentar se esquivar de ataques. Ataques mágicos não são mais uma piada sobre o nível 30. Você vai sentir isso quando atacado com magia agora. Resistência mágica máxima e classificação armadura foram reduzidos. Criatura veneno também é muito mais perigoso. Sendo envenenado por uma aranha gigante já não é menos prejudicial do que derramar uma bebida quente no seu colo&#33;\r<br />\r<br /> A fim de manter o equilíbrio com as revisões de combate populares eu tive que substituir algumas de suas configurações. No começo eu tentei evitar isso e não tocar em qualquer das suas configurações, mas o equilíbrio do mod tornou-se impossível. Sim, este mod poderia ser melhorado se eu tivesse editado os registros NPC e listas niveladas, no entanto, todo o objetivo deste mod era ter que adaptar-se a praticamente qualquer ordem de carregamento e não ser um pesadelo de compatibilidade.\r<br />\r<br />Limitações:\r<br /> Há alguns encontros que têm níveis fixos e serão substancialmente menores em nível do que o jogador. Este é um problema conhecido e não serão corrigidos por este mod, uma vez que está fora do seu alcance. Inimigos que estão nivelados com o jogador devem representar um desafio maior.\r<br />\r<br /> No mod fará comportamento inimigo 100% realista. Existem inúmeras limitações com o motor AI Skyrim nos deu&#33; Tudo o que posso esperar fazer é melhorar a experiência.\r<br />\r<br /> Mágica:\r<br /> Feitiços NPC são mais poderosos ainda que as magias do jogador são deixadas inalteradas. A fim de equilibrar mágica do jogador com a magia doNPC. Eu recomendo que os jogadores instalem um dos mods de mágicas populares. O mais leve deles é Scaling Simples Magia que eu tenho usado por vários anos com um bom sucesso. Soluções mais elaboradas estão disponíveis, tais como Empowered Mágica e Melhor Mágico que funcionam bem também.\r<br />\r<br /> Importante:\r<br /> Muitos usuários vão achar que eles precisam para diminuir a dificuldade do jogo por um cenário que irá, na maioria dos casos, ainda proporcionar um aumento na dificuldade geral com este mod ativado. Não há mais a necessidade de aumentar o nível de dificuldade para ter um combate desafiador. Eu recomendo que a maioria dos usuários jogar na dificuldade Adepto ou menor quando se inicia um novo jogo e, em seguida, bater o nível de dificuldade um ponto, uma vez que chegar ao nível 20-30. Eu costumava jogar no nível de dificuldade Master ou Legendary antes de desenvolver este mod e agora jogo no Expert. Por favor, baixe a dificuldade do jogo por um ponto após a instalação Combat Evolved. Se o combate ainda for muito difícil, então baixe-a mais um degrau. A maioria dos usuários vão descobrir que, se reduzir o nível de dificuldade do jogo por um ponto o mod ainda fornece a 25% - aumento de 50% em dificuldade geral do jogo a partir do que eles estavam usando na dificuldade mais alta.\r<br />\r<br /> Os jogadores que têm dificuldade com a magia causando muito dano deve ler e seguir este guia: [url=http://www.nexusmods.com/skyrim/mods/31793/?]Magic Resistance Primer[/url]\r<br />\r<br /> \r<br />- Notas\r<br />\r<br />* Requer o mod original para funcionar corretamente :[url=http://www.nexusmods.com/skyrim/mods/56147/?] Combat Evolved[/url]\r<br />\r<br />* Requer Skyrim versão 1.9.32 ou acima\r<br />  Dawnguard\r<br />  Dragonborn\r<br />\r<br />Aprovem se gostarem da tradução(Botão Endorse).\r<br />Não se esqueça de aprovar o mod original também, vai ajudá-lo muito.\r<br />Este mod tem um monte de arquivos opcionais, se necessário vou traduzi-los também.\r<br /> Por favor, informe qualquer bug ou o texto não traduzido.\r<br />\r<br />Cheque a descrição do mod original em inglês para mais informações: [url=http://www.nexusmods.com/skyrim/mods/56147/?]Combat Evolved[/url]\r<br />\r<br />Todos os créditos para [url=http://www.nexusmods.com/skyrim/users/3822090/?]CrushBoss[/url]\r<br />\r<br />Aproveite a experiência do Combat Evolved&#33; Prepare-se para ter sua bunda chutada várias vezes&#33;\r<br />\r<br />[/size][size=5][i][size=3]Aproveitem&#33;&#33;[/size]\r<br />[/i][/size]",
  "categoryId": "77",
  "version": "2.4a",
  "author": "Vulthoryu",
  "createdUnix": "1424152163",
  "updatedUnix": "1433131045",
  "containsAdultContent": false,
  "uploadedBy": "Vulthoryu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000162488",
      "name": "Combat Evolved - PT-BR",
      "version": "2.4a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Combat Evolved - PT - BR-62755-2-4a.rar",
      "uploadedUnix": "1433130876",
      "modVersion": "2.4a",
      "virusScanUrl": "https://www.virustotal.com/file/45dc0e4fd568bca93cbc410f3cb79ff1d72e0e35fb26c3415d5fd0e3025c0bc1/analysis/1433130902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Combat%20Evolved%20-%20PT%20-%20BR-62755-2-4a.rar?fid=1000162488&ttl=1535851445&ri=8192&rs=8192&setec=acdad13798790aa5b1b61c550ddc3539"
    },
    {
      "fileId": "1000162489",
      "name": " Combat Evolved v2.4a - Base Game Version - PT-BR ",
      "version": "2.4a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": " Combat Evolved v2.4a - Base Game Version - PT-BR -62755-2-4a.rar",
      "uploadedUnix": "1433131045",
      "modVersion": "2.4a",
      "virusScanUrl": "https://www.virustotal.com/file/2bfc06a799354d658ff8ad835e725d73d71329eb9955e98e3861b95ec5a2b6d1/analysis/1433131082/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/%20Combat%20Evolved%20v2.4a%20-%20Base%20Game%20Version%20-%20PT-BR%20-62755-2-4a.rar?fid=1000162489&ttl=1535851446&ri=8192&rs=8192&setec=b549de8fb96b498d94732395914bfa2c"
    }
  ]
}