{
  "modId": 6281.0,
  "modName": "Logan - An Alternative RP Start",
  "summary": "An Alternative start to Skyrim",
  "descriptionHtml": "[IMG]http://i280.photobucket.com/albums/kk200/Jonezy264/ScreenShot16-1-2.jpg[/IMG]\r\n\r\n[color=DarkRed][b]- NOTE[/b][/color] Apologies to the first few downloaders, I misplaced the ess. file, I deleted the old one and uploaded the rar with the ess. file in it. Sorry for any inconvenience caused\r\n \r\n[FONT=Verdana][color=DarkRed][b]THE SETTING[/b][/color] \r\nYou\\'re a proud and strong Nord named Logan, for the past few years you had been a mercenary protecting travellers and caravans from bandits and thieves, when one day whilst protecting a caravan three Imperial soldiers had set a toll on the road, the merchant you\\'re protecting doesn\\'t have the septims to pay and you don\\'t want to give your hard earned gold to some Imperials abusing their power. So you place your hand on the hilt of your sword and prepare for bloodshed, the Imperials unsheathe their swords and begin charging, you scream out a battle cry and they begin to flee, you chase the Imperial soldier nearest to you and thrust your sword into his back, immediately pulling it out without a second thought. You then begin charging at the second Imperial soldier who was limping from a battle wound, you catch up to him and again thrust your sword into his back, the third one is a good 20 metres ahead, you decide this a good opportunity to see if the archery practice has paid off. You sheathe your sword take the long bow from your back, you keep your eyes on the soldier even as you take an arrow from your quiver, in a matter of seconds you had already noted the soldiers distance and the speed of the wind. You nock the arrow with ease and pull the string back letting the force build until the string was in line with your cheek, you move your aim to make sure the arrow lands in the soldiers upper body and release. The arrow flies with the power of galloping horse and lands in the back of the soldiers neck killing him on impact, forcing him to the ground. You take a seat on a nearby rock to catch your breath and reflect on your skillful kills, the merchant thanks you but reiterates the fact that you must press on. You stand up, wipe the blood off your sword and sheath it.\r\n\r\nAfter travelling undisturbed for a few hours night begins to fall so you decided to set up camp, you ask the merchant to take first watch, lay out your bedroll and begin to fall asleep. You open your eyes the next morning only to see the merchant with a sword through his stomach, you go to grab you sword but it isn\\'t where you left it. As your eye sight begins to clear you see a group of five Imperial soldiers, two of them on horseback and the other three  walking towards you. Being unarmed you see no point in trying to resist and with a sigh you place your hands out for the solider to tie them. One soldier takes food from the caravan and  places some in his own satchel. The Imperials on horseback ride on but the other three pull you up and begin walking. You ask them where you\\'re being taken to and they tell you you\\'re being escorted to the Castle Dour Dungeons. \r\n \r\n[color=DarkRed][b]INFORMATION[/b][/color] \r\n[color=DarkRed][b]- NOTE[/b][/color] This does disable the main Dragonborn questline. To enable it Open the console and type in \\\"setstage MQ102 30\\\" although I haven\\'t done so yet, so I don\\'t know the outcomes.\r\n\r\n[color=DarkRed][b]- NOTE[/b][/color] You can serve your time in jail or you can use the \\'Crumbling Mortar\\' in the cell to escape, sometimes the guard will chase you and sometimes they won\\'t. There are also some belongings in the chest to right as soon as you have gone through the broken wall.\r\n\r\nI do recommend watching Roggvir\\'s execution, for the more RP type. It will add more depth into the characters hatred for the Imperials and then go to Windhelm and join the Stormcloaks as all true Nords should ;) \r\n\r\nI have raised the characters level to 27 considering he is experienced in battle, I have also increased the One-handed skill by 32 (Overall 52), the Light Armor skill by 37 (Overall 52), the Marksman (Archery) skill by 37 (Overall 52) and increased the Block skill by 32 (Overall 52) and added a 26 perks that I saw fit to add. However if you want a more challenging approach you can of course decrease the level of your Skills (player.modav \\'skill\\' \\'amount\\' (Light Armor default is 15, One-handed and Block defaults are 20) and remove the perks (player.removeperk [Perk ID]) [url=http://elderscrolls.wikia.com/wiki/Console_Perk_Codes_%28Skyrim%29]Perk ID\\'s[/url]\r\n \r\n [color=DarkRed][b]RECOMMENDATIONS[/b][/color] \r\nI do recommend disabling the compass and crosshair and downloading a \r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=2075]No Fast Travel mod[/url]\r\n \r\n[color=DarkRed][b]HOW TO[/b][/color] \r\nYou can remove the crosshair via the In-game settings, however this doesn\\'t disable the sneak crosshair, to do that you can decrease the HUD opacity slider which is also in-game. \r\n \r\n[color=DarkRed][b]INSTALL[/b][/color] \r\nPlace the ess. file in C:\\\\Users\\\\(USERNAME)\\\\Documents\\\\My Games\\\\Skyrim\\\\Saves \r\n \r\n[color=DarkRed][b]CHARACTER FEATURES(MODS USED)[/b][/color] \r\n[url=http://www.skyrimnexus.com/downloads/file.php?id=30]No More Blocky Faces[/url]  by Xenius \r\n \r\n[color=DarkRed][b]ADDITIONAL INFORMATION[/b][/color] \r\nThis is my second upload to SkyrimNexus, my previous one is also an Alternative RP Start, [URL=http://www.skyrimnexus.com/downloads/file.php?id=6174]Imola[/URL]  \r\n\r\nThe name isn\\'t very Nord-ish I know but I named him Logan after a character in the Guild Wars 2 book trilogy \\'Edge of Destiny\\' that has the name Logan, It just seemed to fit at the time, but by all means if the name isn\\'t suitable just change it (showracemenu in console) :) I hope you took the time to read the setting, perhaps I went too far with it but I enjoyed doing it nonetheless, thanks. \r\n \r\n[color=DarkRed][b]NOTES[/b][/color] \r\nI haven\\'t changed the mods in any way, all I have done is combined them together.\r\n\r\nDo feel free to comment and/or make requests, they\\'re all appreciated and I will probably end up making a few more settings for both male and female characters (e.g. people who prefer playing Imperial over Stormcloak).\r\n\r\nAlso feel free to upload images of what you have done with the character, it\\'d be interesting to see the differences in players :) [/FONT] \r\n ",
  "categoryId": "43",
  "version": "",
  "author": "QUANT45",
  "createdUnix": "1326642086",
  "updatedUnix": "1326644692",
  "containsAdultContent": false,
  "uploadedBy": "QUANT45",
  "primaryFile": null,
  "files": [
    {
      "fileId": "20068",
      "name": "Logan - An Alternative RP Start",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8764",
      "fileName": "Logan - An Alternative RP Start-6281.rar",
      "uploadedUnix": "1326643300",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5e395ee91beab8e7416d65bdec8de505d3313b554015337c41884148498728fb/analysis/1406613195/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Logan%20-%20An%20Alternative%20RP%20Start-6281.rar?fid=20068&ttl=1535763587&ri=8192&rs=8192&setec=f3ce52e4fceb7c48326ac6401e0e7acd"
    },
    {
      "fileId": "20073",
      "name": "Logan - An Alternative RP Start - JUST THE ESS FILE",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1003",
      "fileName": "Logan - An Alternative RP Start - JUST THE ESS FILE-6281-1.rar",
      "uploadedUnix": "1326644692",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2f61f92db9057fdc0a7972c9df176fe063a61a1a2f2d865790479e2a24c83848/analysis/1406613197/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Logan%20-%20An%20Alternative%20RP%20Start%20-%20JUST%20THE%20ESS%20FILE-6281-1.rar?fid=20073&ttl=1535763588&ri=8192&rs=8192&setec=3201da91df7e02e3963c022bfa2fdd8a"
    }
  ]
}