{
  "modId": 6298.0,
  "modName": "Regnaut RP start",
  "summary": "Your Regnaut a poor nord who comes from white-run. Your fed up with your life of begging in white-run and decide to travel on to riften to join the thieves guild and steal his way to a life of wealth...",
  "descriptionHtml": "Story so far-\r\nYour Regnaut a poor nord who comes from white-run. Your fed up with your life of begging in white-run and decide to travel on to riften to join the thieves guild and steal his way to a life of wealth. As your setting out to riften you stumble upon the ritual stone and see a Adept necromancer who attacks you on sight you being unarmed run and jump off the nearest cliff as you land you stumble and fall to the ground as the necromancer draws closer to finish what he started, a troll comes up from behind the necromancer and swiftly punches him right in the head killing him, in fear you attempt to run as you run another troll strikes you and you pass out and awake later in side a cave not to far from were you passed out dazed, confused and in pain you rise up. You look around and find a few dead bandits and a troll preparing to cook them up. you grab a ax and shield  off of one of the bandits and slay the troll with a swipe of the ax. admiring your new weapon you look down and notice another troll is guarding the entrance... there is only one way out. good luck!\r\n",
  "categoryId": "43",
  "version": "1.00",
  "author": "Cuttcut",
  "createdUnix": "1326652421",
  "updatedUnix": "1326652655",
  "containsAdultContent": false,
  "uploadedBy": "Cuttcut",
  "primaryFile": null,
  "files": [
    {
      "fileId": "20121",
      "name": "regnaut save",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1054",
      "fileName": "regnaut save-6298.rar",
      "uploadedUnix": "1326652655",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/3fa641d8e7dc9ef9dd35f0022e2808fbaf402bdaf8b059f647fd63cf9959453e/analysis/1406613499/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/regnaut%20save-6298.rar?fid=20121&ttl=1535763609&ri=8192&rs=8192&setec=5bb2442e96504d3006837db5cc6055c1"
    }
  ]
}