{
  "modId": 62986.0,
  "modName": "Taste of Death - Namira Alternative",
  "summary": "Gives you an alternative to the Namira Daedric Quest",
  "descriptionHtml": "This mod gives you an alternative &#34;good&#34; way to complete The Taste of Death, without sacrificing Verulus and partaking in cannibalism.\r<br />\r<br />There is a similar mod on the Nexus, but it involves &#34;fooling&#34; Namira with a dummy body, which I thought was kinda far-fetched. I mean, fooling a Daedric Prince?\r<br />\r<br />With my mod you are able to either kill Eola in the Hall of the Dead and fail the quest, like in vanilla, OR - you can proceed with the quest until you clear the Reachcliff Cave with her. Then, after you are tasked with bringing Verulus to the shrine, you have a choice of killing Eola there and then, and the objective is changed accordingly. \r<br />If you do that, you complete the quest and receive the ring of Namira. The quest journal entry explains it - Namira is cunning, she saw that you were uncertain and helped Eola at first, so she is trying to seduce you by granting you the ring. \r<br />\r<br />If you kill her before clearing the cave or after bringing Verulus to her, the quest is failed, like in vanilla.\r<br />\r<br />The alternative way still counts toward Daedric quests and Daedric artifacts (Oblivion Walker) achievements.\r<br />I have also made sure that Eola will be killable if you attack her in those instances, as some people (including me) encounter a bug where she is essential.\r<br />\r<br />Installation:\r<br />Unpack in Skyrim/Data folder, enable ZZ_NamiraAlt.esp in your preferred launcher.\r<br />\r<br />Uninstallation:\r<br />Disable the esp in your launcher. The mod contains no loose files, no additional action is required.",
  "categoryId": "35",
  "version": "1",
  "author": "Me",
  "createdUnix": "1424611129",
  "updatedUnix": "1424610843",
  "containsAdultContent": false,
  "uploadedBy": "Every single username is taken",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000148571",
      "name": "Namira Alternative",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Namira Alternative-62986-.rar",
      "uploadedUnix": "1424610843",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/eb5718c8ae46b66f354706ffed518cfd457f8a40f9fdc28315d1fcaf36857710/analysis/1424610902/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Namira%20Alternative-62986-.rar?fid=1000148571&ttl=1535851667&ri=8192&rs=8192&setec=be076627a7d85a154f134021ecabf58d"
    }
  ]
}