{
  "modId": 63018.0,
  "modName": "Amanchumba Mod Experiment",
  "summary": "This is just the result of me learning how to use the Creation Kit.",
  "descriptionHtml": "[size=5][u]Yadda:\r<br />[/u][/size]Well, this is just an experiment, very incomplete and absolutely buggy I am sure.\r<br />\r<br />I have lost many files in recent computer crashes and my current laptop can&#39;t handle Skyrim very well. Considering all this, I have decided to just release this mod as is, without further improvements. Please note that it may behave rather, uh, quirky. I don&#39;t know when I will be able to get a new computer so this is all I can do for now.\r<br />\r<br />[u][size=5]Commpatibility:[/size][/u]\r<br />This mod changes quite a few things from the vanilla. Be careful as this mod may conflict with ones that:\r<br />[list][*]Change how bookcases/bookshelves and books work;\r<br />[/*][*]Change the factions of some creatures... Uh, actually, I can&#39;t remember but be careful.[/*]\r<br />[*]Change places such as (all coordinates are just approximations):[/*]\r<br />[/list]      The road towards Riften just before the stables (40,-20)\r<br />      The area around the road from Falkreath to Hammerfell (-12,-24 to -8,-24)\r<br />      That place just down Solitude&#39;s stables, by the fjord-like river thingy or whatever (-20,20 I think)\r<br />      The first ruined house of Winterhold (24,24)\r<br />      Well, the eastern face of Whiterun&#39;s wilderness, by that road and secret exit (4,-4)\r<br />\r<br />[size=5][u]Requirements:[/u]\r<br />[/size]As far as I know, this only needs Skyrim.esm and Update.esm to exist. But I may be being naïve and missing something.\r<br />\r<br />[size=5][u]Background and Information:[/u]\r<br />[/size]I just used my mother and constructed languages, along with the mythos of my stories and slapped them into Skyrim. Don&#39;t expect immersion here, this thing here encourages meta-analysis of your character in the world of Skyrim/Tamriel versus the contrast with Bareinú, a fictitious place that controls fictitious places.\r<br />\r<br /> But I digress. It will probably look like a weird surreal trip into glitchworld until I have the resources to turn it into a metafictitious dadaist travel into glitchworld. There&#39;s a whole puzzle thing going on, something about doors being unlocked and finding their keys. There are shortcuts by the way. Inside Bareinúazo Ireu you can just jump down to another corridor. Just be sure you have the key to come back though. Or just jump into the void and pray you spawn somewhere convenient.\r<br />\r<br />Oh, and I have a little video thing from an old version. Seizure warning, as my video editor was utter crap and couldn&#39;t synch frames quite well. And yeah, the dungeon is not very friendly to the bear in that version, and slightly better now. Also, I&#39;ve been working on this since October 13 2014 or something. Shrugs.\r<br />\r<br />[youtube]TEFU4SJxuME[/youtube]",
  "categoryId": "89",
  "version": "25.Jun.15",
  "author": "Djsedj",
  "createdUnix": "1424658310",
  "updatedUnix": "1435210081",
  "containsAdultContent": true,
  "uploadedBy": "Minefis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000165348",
      "name": "Amanchumba 02 25-Jun-2015",
      "version": "25.Jun.15",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "607",
      "fileName": "Amanchumba 02-63018-25-Jun-15.rar",
      "uploadedUnix": "1435210081",
      "modVersion": "25.Jun.15",
      "virusScanUrl": "https://www.virustotal.com/file/982d56a1596fe89634acc350cef3b3b76475df6ff61df281fedd98d6905e7738/analysis/1435210143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Amanchumba%2002-63018-25-Jun-15.rar?fid=1000165348&ttl=1535851702&ri=8192&rs=8192&setec=594cdad2db05280f0656caa7a2dd9dda"
    }
  ]
}