{
  "modId": 63074.0,
  "modName": "Hoth - Portuguese - Brazil",
  "summary": "Tradução do mod Hoth para Português do Brasil.",
  "descriptionHtml": "[size=5]- [color=#00ff00]Port[/color][color=#ffff00]uguês[/color][/size]\r<br />\r<br />[size=4]- Descrição por [url=http://www.nexusmods.com/skyrim/users/3656551/][b]hothtrooper44[/b][/url] [/size]\r<br />\r<br />[size=3]Hoth é um velho aventureiro caçador de recompensas, e um companheiro brutal para se viajar. Você percebeu ... Hoth tem um passatempo original - ele usa suas mortes mais honrosas como troféus. Ele reuniu algumas das maiores recompensas de monstros e homens em seus dias vagando pelas terras do norte de Skyrim - e ele quer mostrar o seu trabalho.[/size]\r<br />\r<br />[size=4]- Detalhes[/size]\r<br />\r<br />[color=#ff7700][size=3]Quem é Hoth?[/size][/color]\r<br />[size=3]- Hoth é um seguidor Nórdico que pode ser recrutado na Pousada de Morthal para se juntar a suas viagens. Ele luta no estilo duas-mãos, bem como com um arco.[/size]\r<br />\r<br />[color=#ff7700][size=3]O que faz o Hoth ser especial?[/size][/color]\r<br />[size=3]- Hoth é o único companheiro que gera missões para o jogador dinamicamente com base em sua localização no mundo. Como um caçador de recompensas, Hoth está sempre pegando novos contratos. Fale com Hoth e ele irá compartilhar seus contratos com você&#33; Uma vez que você terminar uma missão dada por Hoth, ele sempre terá um outro para oferecer (missões infinitas). Há sempre alguma coisa a fazer com Hoth ao redor&#33;\r<br />- Hoth é tem a missão radiante habilitada. Isso significa que ele vai oferecer missões dentro de locais de outros mods dinamicamente&#33; Explore novos mods juntos.\r<br />- Hoth é 100% personalizado, dublado com voz de alta qualidade e sons totalmente únicos.\r<br />- Hoth é um personagem que tem sua própria história totalmente desenvolvida dentro do jogo. O que você espera que um velho caçador de recompensas grisalho tem a dizer? Hoth não irá decepcionar.\r<br />- Hoth é talvez o único seguidor mais visualmente personalizado já feito para Skyrim.\r<br />- Hoth tem uma armadura única feita sob encomenda.\r<br />- Hoth tem luvas personalizadas exclusivas.\r<br />- Hoth tem uma capa personalizada exclusiva.\r<br />- Hoth tem uma arma feita sob encomenda original.\r<br />- Hoth tem único corpo personalizado com pinturas de guerra e insígnias.\r<br />- Hoth tem texturas únicas de pele, personalizadas com decalques, como cortes, arranhões, cicatrizes e pontos.\r<br />- Hoth tem texturas nos olhos personalizadas e exclusivas.[/size]\r<br />\r<br />[size=4]- Perguntas Frequentes[/size]:\r<br />\r<br />[color=#ff7700][size=3]P[/size][/color][size=3]: Tem algum requerimento para utilizar esse mod?\r<br />[color=#ff7700]R[/color]: Não. Instale e jogue.\r<br />\r<br />[color=#ff7700]P[/color]: O equipamento do Hoth não aparece no inventário - ajuda?\r<br />[color=#ff7700]R[/color]: As coisas dele não são feitas para serem utilizadas pelo jogador. Isso não é um bug.\r<br />\r<br />[color=#ff7700]P[/color]: Eu tentei forçar Hoth a entregar seu equipamento customizado com o UFO, Amazing \r<br />Follower Tweaks, ou outro mod de seguidores. Não funcionou, e agora Hoth\r<br />está pelado&#33;\r<br />[color=#ff7700]R[/color]: Tentar roubar as coisas de Hoth sempre irá resultar em lágrimas.\r<br />\r<br />[color=#ff7700]P[/color]: O download desse arquivo pelo Nexus Mod Manager trava antes de acabar&#33; Ajuda&#33;\r<br />[color=#ff7700]R[/color]: Esse é um problema do programa Nexus Mod Manager, e não está relacionado com esse mod. \r<br />Navegue para C: -&gt; Games -&gt; Skyrim -&gt; mods -&gt; downloads. \r<br />Delete qualquer coisa com o nome HothFollower encontrado na pasta. Faça o mesmo\r<br />com a pasta de cache encontrada nos mods. Agora baixe de novo.[/size]\r<br />\r<br />[size=4]- Notas[/size]\r<br />[color=#ffff00][size=3]Por favor, vocês são livres para postar fotos com os textos traduzidos, fiquem a vontade&#33;[/size]\r<br />[/color][size=3][color=#ffff00][size=4]Requer o mod original para funcionar corretamente: [url=http://www.nexusmods.com/skyrim/mods/24666/?]Hoth[/url][/size][/color][color=#ffff00]\r<br />Não se esqueça de endossar se gostou do mod e da tradução.\r<br /> Por favor, informe qualquer bug ou o texto não traduzido.[/color]\r<br />\r<br />Cheque a descrição do mod original em inglês para mais informações:[/size] [size=3][url=http://www.nexusmods.com/skyrim/mods/24666/?]Hoth[/url][/size]\r<br />\r<br />[size=3][size=4]- Instalar[/size]\r<br />Use o Nexus Mod Manager ou extraia os arquivos para a pasta de Skyrim / Data e selecione-o no Launcher do Skyrim.[/size]\r<br />\r<br />[size=3]Todos os créditos para [url=http://www.nexusmods.com/skyrim/users/3656551/][b]hothtrooper44[/b][/url] pelo majestoso trabalho.[/size]\r<br />\r<br />[size=3]Aproveitem&#33;&#33;[/size]",
  "categoryId": "66",
  "version": "3",
  "author": "Vulthoryu",
  "createdUnix": "1424809490",
  "updatedUnix": "1424809485",
  "containsAdultContent": false,
  "uploadedBy": "Vulthoryu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000148965",
      "name": "Hoth - Traducao PT-BR",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Hoth - Traducao PT-BR-63074-3.rar",
      "uploadedUnix": "1424809485",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/e0943cb367e036f182a81b9d1a110c44a5983fb1ff05cf18d0c5f1f7575f1e64/analysis/1424809502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hoth%20-%20Traducao%20PT-BR-63074-3.rar?fid=1000148965&ttl=1535851772&ri=8192&rs=8192&setec=b100bf8fda24cc1100e5070c6ad49452"
    }
  ]
}