{
  "modId": 6312.0,
  "modName": "Skyrim Save Files Utility",
  "summary": "This application manages save files and profiles (collections of save files, or PCs to us DnD types).",
  "descriptionHtml": "TESVSFU\r\nThe Elder Scrolls V Save File Utility\r\n-------------------------------------------------------------\r\nby astr0wiz\r\n\r\n[size=5][color=#add8e6]Version 2 is dead[/color]\r\n\r\n\r\n[color=#ff8c00]July 12, 2013: This project has been dropped.  Between work and school, I had to drop some of my projects, and this one got the axe.[/color][/size]\r\n\r\n[size=6][color=#ff2208]Nooooooooo![/color][/size]\r\n\r\n[size=5][color=#ff8c00]I apologize to all who are waiting for this to finish, but I have to get a few things done first.  Boy, I had some great ideas.  Too bad they\\'ll have to wait.  :( [/color][/size]\r\n\r\n\r\n\r\n\r\nVersion 1.0.4412\r\n\r\nThank you for downloading TESVSFU.  This utility automates one of the most\r\nimportant missing features from Skyrim: Profile management.  This application\r\nwill create, rename, and delete PC profiles, as well as move or copy save game\r\nfiles anywhere on the file system.  It also makes profile selection very\r\neasy, which means less time putzing around with Explorer and more time with\r\nSkyrim.\r\n\r\nOne thing I like doing is creating one save game right before my character\r\nis created, and then using it as the launching pad for all my other profiles.\r\nFor instance, in this app I can create a new profile called \\\"Newguy\\\", then\r\ncopy the \\\"Prisoner\\\" save file from the default profile into that one.  After\r\nthat, I can click on Newguy in the list, set it as my current active profile,\r\nand then when I next run Skyrim, I can just continue and I will be at the \r\npoint where I can start a new adventure without going through the boring cart\r\nride.\r\n\r\nIt also enables Skyrim to be launched from the application.  It will run SKSE\r\nif you have it loaded, or just the basic Skyrim executable if you do not.\r\n\r\n\r\nInstallation:\r\n-------------\r\n1.  Extract the contents of the downloaded file into a temporary directory.\r\n2.  Run TESVSFU.msi.\r\n3.  Follow the installation instructions.\r\n\r\n\r\nStartup:\r\n--------\r\nWhen the application first starts, it will attempt to detect the location of\r\nboth your save files and the Steam runtime executable.  If it succeeds, you\r\nwill see a list of profiles on the left, the save games list in the middle, \r\nand some save game information on the right.\r\n\r\nThe default profile will be automatically chosen.  It shows up as\r\n\\\"__default__\\\", but really has no name on your system.  The save game files\r\nlist in the middle will hold the files in your default profile, and the\r\ninformation from the topmost save game will be shown on the right: the \r\nplayer name (and level), the player location, the amount of time played in\r\nthe game, the screenshot of the save point, and a list of dependent mods\r\n\r\nYou will also see the button to launch Skyrim in the lower right-hand corner.\r\n\r\n\r\nProfile Actions:\r\n----------------\r\nClicking on the Profiles menu or right-clicking on the list brings up a\r\nmenu with the following choices:\r\n\r\n\tNew - Lets you create a new empty profile.\r\n\tDelete - Lets you delete the profile and all its save files.\r\n\tRename - Renames the profile (but not the actual character)\r\n\tArchive - Archives all the save files for the selected profile.\r\n\tSet Current Profile Active - Sets the selected profile as the Skyrim PC.\r\n\t\r\nThe default profile cannot be deleted or renamed.  The archives show up as\r\nZIP files in the parent directory of your save files location, usually\r\n{username}\\\\My Documents\\\\My Games\\\\Skyrim.\r\n\r\n**IMPORTANT: Zipping up a large collection of large game files takes a\r\nlong time, so exercise caution when choosing to archive.  In the case of\r\nsave game files, that could mean several minutes for only 30 files.\r\n\t\r\n\r\nSave Files Actions:\r\n-------------------\r\nClicking on the Save Files menu or right-clicking on the save files list\r\nbrings up a menu with the following choices:\r\n\r\n\tDelete - Deletes the selected save files.\r\n\tRename - Opens a tool window to let you rename each selected file.\r\n\tMove To - Lets you move the selected save files to a different directory.\r\n\tCopy To - Lets you copy the selected save files to a different directory.\r\n\tAnalysis - In development.  Intended to show many details of the save game files.\r\n\t\r\n\t\r\nOptions:\r\n--------\r\nThere are two directory entry boxes here which are necessary for proper \r\noperation:\r\n\r\n\tSave Files Location\r\n\tSteam Location\r\n\t\r\n**IMPORTANT: The Save Files Location directory is the one that holds Skyrim\\'s\r\nuser data.  This is usually found at {username}\\\\My Documents\\\\My Games\\\\Skyrim.\r\n\r\nThe Steam Location text box holds the directory to the Steam executable.\r\nThis is often in C:\\\\Program Files\\\\Steam, but can be anywhere.  TESVSFU will\r\nattempt to auto-detect the location of Steam, but it will only work if Steam\r\nis already running in the background.  This is normally not an issue, but\r\nthis will also accommodate test environments or multiple installations (if\r\nsuch a thing can exist with Steam).\r\n\r\nThere are also several options which can be toggled on or off:\r\n\r\n\tAlways archive prior to Profile Deletion\r\n\tShow Tool Tips\r\n\tEnable Logging\r\n\tForce file rename to end with .ESS\r\n\t\r\nSetting \\'Always archive prior to Profile Deletion\\' will cause the profile to\r\nbe archived after the delete selection has been verified.  The \\'Show Tool\r\nTips\\' option switches tool tips on and off.  \\'Enable Logging\\' will enable \r\nthe Logging Level indicator, letting you set the level of logging. \\'Force\r\nfile rename to end with .ESS\\' makes sure that the game save files end with\r\n\\\".ESS\\\".  If this extension is left off the file, Skyrim cannot load it.\r\n\r\n\r\nFeatures:\r\n---------\r\n* The application remembers the previous size and location of the screen.\r\n* You cannot delete the default profile, as that would delete the Saves \r\n  directory.\r\n* It will launch SKSE if you have it installed, instead of just TESV.\r\n* Archives are saved in standard ZIP format for easy management.\r\n\r\n\r\nMiscellaneous:\r\n--------------\r\nThe Analysis selection for the save files brings up a window that shows \r\nonly a few bits of information.  This section will be embellished in \r\nfuture releases.\r\n\r\n\r\nChange Log:\r\n-----------\r\n1.0.4412:\r\n    * Update\r\n    * Fixed compatibility issue with Wrye Bash.\r\n\r\n1.0.4411:\r\n    * Update\r\n    * Fixed problem with screenshot aspect ratio causing failure.\r\n    * Improved error handling and reporting.\r\n\r\n1.0.4406:\r\n    * General Release\r\n    * Added version information in Options window.\r\n    * Fixed Steam directory search to always pull from INI file first.\r\n\r\n1.0.0:\r\n    * General Release\r\n    * Fixed all options so they work.\r\n    * Archiving now shows progress.\r\n    * Archived files are placed under a single directory (profile name) in \r\n      the ZIP file.\r\n    * Moved all text to the Resources file.  Multi-language releases now possible.\r\n    * Added Force rename to have ESS extension option.\r\n    \r\n0.92.0:\r\n    * Beta release\r\n    * Changed the UI so it looks Skyrim-like (black backgrounds with white lettering)\r\n    * Enabled a button to run Skyrim or SKSE if you have that loaded.\r\n    * Replaced a menu option iwth an option window\r\n    * Options added but no effects coded.\r\n    * Directory choice now uses text boxes with auto-populating directory hints\r\n    * Many bugs squashed.\r\n\r\n0.90.1:\r\n    * Unreleased\r\n    * Fixed Skyrim.INI modifier task when selected profile is default\r\n    * Resolved bad reference issues for profile pathnames (double \\\"\\\\\\\").\r\n    * Linked actions to all profile menu options (dropdown).\r\n\r\n0.90.0:\r\n    * Initial beta release.\r\n\r\n\r\nAuthor:  astr0wiz @ TES Alliance",
  "categoryId": "39",
  "version": "1.0.4412",
  "author": "astr0wiz",
  "createdUnix": "1326668962",
  "updatedUnix": "1328062582",
  "containsAdultContent": false,
  "uploadedBy": "astr0wiz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24791",
      "name": "TESVSFU Installer v1dot0 rev 4412",
      "version": "1.0.4412",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1173",
      "fileName": "TESVSFU Installer v1dot0 rev 4412-6312-1-0-4412.zip",
      "uploadedUnix": "1328062582",
      "modVersion": "1.0.4412",
      "virusScanUrl": "https://www.virustotal.com/file/f55f5973eb27c5599f3044271a322fc86a009465e83c10a73401ae3dbea19fdb/analysis/1406647654/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TESVSFU%20Installer%20v1dot0%20rev%204412-6312-1-0-4412.zip?fid=24791&ttl=1535763635&ri=8192&rs=8192&setec=1546bb3eeb03317ec705f121fe75bc78"
    }
  ]
}