{
  "modId": 63186.0,
  "modName": "Female Ancient Nord Armor Retexture",
  "summary": "Just a retexture of female draugr armor with some enchantments.",
  "descriptionHtml": "I do seriously apologize to everyone who first downloaded this mod but couldn&#39;t get the textures to load. My skyrim crashed and I had to reload it and downloaded this file and it happened to me. So what I have done, is redo everything basically.  The textures are the same, but the file will need to be manually downloaded. I should also mention that this is a standalone mod.\r<br />Just place the esp file in skyrim/data folder.\r<br />The texture file will need to go into skyrim/data/textures/armor folder.\r<br />\r<br />This is a retexture of female draugr heavy armor with some ridiculous enchantments on it. I made this for myself and I play with requiem and I am always getting spanked, so I figured this would be a nice addition for myself. The armor is in a chest on the island in Riverwood near the tree stump where Faendal sits. This is FEMALE ONLY. It should work with all races, but I can&#39;t guarantee the beast races. \r<br />\r<br />UPDATE\r<br />\r<br />I have packaged the esp and the textures into a single file for download. Just download them and activate them through the add file option on nmm. The armor was very shiny before, so I have taken care of that.\r<br />\r<br />I would love to hear peoples comments, so please drop me a line.",
  "categoryId": "54",
  "version": "",
  "author": "flyingmushroom00",
  "createdUnix": "1425062087",
  "updatedUnix": "1425586339",
  "containsAdultContent": false,
  "uploadedBy": "flyingmushroom00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000150281",
      "name": "ancient nord female armor retexture",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1514",
      "fileName": "ancient nord female armor retexture-63186-2.rar",
      "uploadedUnix": "1425586339",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/0936288104918b7d49992634ab9769ad4669f5705395be42b662aae453e56222/analysis/1425586384/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ancient%20nord%20female%20armor%20retexture-63186-2.rar?fid=1000150281&ttl=1535851870&ri=8192&rs=8192&setec=3ad6e101ea7ff3761f4666278ea3ffc1"
    }
  ]
}