{
  "modId": 6320.0,
  "modName": "Purified Dragonbane Armor",
  "summary": "Compilation of my Purified Daedric armor and mace, matching Spellbreaker, and the Dragonslayer sword.",
  "descriptionHtml": "Ever get tired of having to look demonic and evil to use the best gear in the game? I know I did, which is why I made this mod. It recolors the evil Daedric armor into a glorious and heroic white and blue, (very) loosely inspired by the Quincy from Bleach. This also has a recolored Daedric Mace, War Axe, and Sword, Dagger, Greatsword, and Battleaxe. However, including 2 handed weapons was not needed, because of the included Dragonslayer Zanbato. Created by Phate3 and recolored by me. With +50 damage to Dragons enchanted onto the blade, it is the ultimate weapon for bringing swift justice to the Dragons.  This glorious blade can be forged using 20 Iron Ingots and 2 Leather Strips (Found in the Daedric catagory) or purchased from Eorlund Grey-Mane at the Skyforge.\r\n\r\nNot an ounce of focus was spared while creating this mod, I have combed it over- quite literally -pixel by pixel to make sure there are no miscolors or anything else.\r\n\r\nYou may have noticed something missing with other people\\'s retexture mods...what\\'s missing? Attention to detail. Recolored Dragonplate without changing the color of the bone on the belt, Mage robes with splotchy colors between cloth, and so on. With me, The Fat Swordsman, you can be sure you\\'re getting the details you deserve.\r\n\r\nI am by no means saying my retextures are flawless, but I can promise you that I work over them pixel by pixel to make sure YOU aren\\'t stuck staring at ugly, overlooked textures on pieces of armor.\r\n\r\n\r\nI hope all you good characters enjoy your new Purified Daedric gear, and Phate\\'s Dragonslayer.",
  "categoryId": "36",
  "version": "1.0",
  "author": "Will Keith",
  "createdUnix": "1326679737",
  "updatedUnix": "1326679886",
  "containsAdultContent": false,
  "uploadedBy": "Fatswordsman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "20229",
      "name": "Purified Dragonbane Armor",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20898",
      "fileName": "Purified Dragonbane Armor-6320-1-0.zip",
      "uploadedUnix": "1326679886",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4d44f5985c3b4d03fc3aacd434125b6b6565fa5224f784f91d867a5a29bf5ab5/analysis/1406614706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Purified%20Dragonbane%20Armor-6320-1-0.zip?fid=20229&ttl=1535763650&ri=8192&rs=8192&setec=afeeaf2f6cabc9f746720bdc513b8e49"
    }
  ]
}