{
  "modId": 6328.0,
  "modName": "Favoritesmenu for Categorized Favorites Menu",
  "summary": "A revamped favoritesmenu file configured to work with Better Sorting and Categorized Favorites Menu. \r\nv1.6 Add compatibility and proper sorting of Deadly Dragon spells\r\nv1.4 Layout adjusted for better access of all favorites\r\nv1.2 added support for Crafting 300\r\nv1.1 now compatible with Jaysus\\' Swords. ",
  "descriptionHtml": "First, I personally use JSwords, Crafting300, Better Sorting, and Deadly Dragons as these are the only mods I think that I have that changes names from the Vanilla list.  I would GREATLY appreciate any simple help such as if anyone who finds stuff missing from my intentional lists to either post a message in my discussion or PM me names (as you see them in your list) that you find in the Others category instead of the proper one :)\r\n\r\n\r\nBelow is the description of the mod.  For those who use deadly dragons there are new spells that I have to add and sort once I get them, patience please :)\r\n\r\n=========================================================================================\r\nI want to use this segment to explain how to counter the wretched steam mannerisms of botching up the load order in the following steps\r\n\r\n- Run BOSS.  \r\n\r\n- Copy paste the list into both your plugins.txt and loadorder.txt.  Keep in mind that unrecognized esm files will appear under unrecognized mods so copy and paste those under your other esm files.\r\n\r\n- For those that use Wrye Bash like myself, put a # in front of the merged esp files\r\n\r\n- Save then right click each file, go to properties and check them as read only.\r\n\r\n- Now steam won\\'t *&#$ up your load order :)\r\n\r\n\r\nI also want to add another \\\"fixer\\\" for a problem I have been experiancing with Skyrim.  It seems that when changing zones from interior to exterior cells, my game will suddenly drop to a dismal 9-14fps which isn\\'t really playable.  This can happen with either just 1 transition from an inside to outside cell or after several.  I did much internet searching and found a solution (FINALLY).  If anyone else is experiancing this, simply press Ctrl+Alt+Delete, then press escape after you hit the welcome screen.  This seems to clear up the ram, or cache or whatever is causing the problem :)\r\n=========================================================================================\r\n\r\n\r\nThe interface works well for 1680x1050 resolution and should be fine with larger resolutions as well.\r\n\r\nI haven\\'t updated the screenshot since 1.4 as the layout has stayed the same.\r\n\r\nThis config is not class specific and should work well for any style of play.  The only one problem I can\\'t fix is the Invisibility spell appearing under the Utility section of potions as both the potion and spell have the same name. *FIXED\r\n\r\nPotions are divided into the following sections;Health, Magicka, Vigor, Fortify Stats, Fortify Skills, Resistances, Soups & Stews, Utility, Poisons and Other.\r\n\r\nMagic falls into 2 different lists.  Destruction gets its own list with spells being separated by element in matching colored sub-lists.  Everything else falls under Support Magic.\r\n\r\nWHAT IS NEEDED\r\nYou will of course need Headbomb\\'s awesome Better Sorting Mod\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=2730\r\n\r\nAnd lastly, Favemenumodder\\'s Categorized Favorites Menu\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=4862\r\n\r\nOPTIONAL\r\nThe font I am using is Valister\\'s Main Font Replacement - Magic Card Font\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=95\r\n\r\nINSTALLATION:\r\nsimply extract to steamaapps/common/skyrim or let Nexus Mod Manger do that for you :)\r\n\r\nOn a separate note, when you open the file, you will have to use the exact spelling of items when entering them into the equipment sets.\r\n\r\nIf you guys have any suggestions, please let me know :)\r\n\r\nCHANGELOG\r\nVersion v1.7\r\n    added latest Deadly Dragon Spells\r\n    added minor powers from the mods Fix Targets Stats, Deadly Dragons, Make New Home, and  Summon IMAGINATOR Helper\r\n\r\nVersion v1.6\r\n\r\n    added compatibility for Deadly Dragon spells\r\n    added compatibility for PISE, headbomb\\'s crafting overhaul\r\n\r\nVersion V1.5\r\n\r\n    minor fixes such as placing some missed items in the proper lists eg Krosis mask now in apparel list\r\n\r\nVersion V1.4\r\n\r\n    fixed the 1.3 screw ups, sorry for any that downloaded it\r\n    Much improved layout\r\n    Seperated Shouts and Powers into different headings\r\n    Seperated magic into support and destruction categories. Destruction magic also sorted by element.\r\n\r\nVersion v1.3\r\n\r\n    Seperated Shouts and Powers\r\n    Tweaked weapons and poison lists to display properly for longer lists\r\n\r\nVersion V1.2\r\n\r\n    added support for Crafting 300\r\n\r\nVersion v1.1\r\n\r\n    - Made Compatible with Jaysus\\' Swords, should have all of his weapons appear in proper lists\r\n    - Added vanilla Daedric Artifacts and Uniques to filters for proper display in lists\r\n    - Small change to apparel list from v1.0, should now scroll properly\r\n\r\nAllow discussion of your file\r\nAllow users to start new comment topics\r\nAllow users to tag your file",
  "categoryId": "42",
  "version": "v1.7",
  "author": "Megiddon",
  "createdUnix": "1326697248",
  "updatedUnix": "1332539515",
  "containsAdultContent": false,
  "uploadedBy": "Megiddon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "46121",
      "name": "favoritesmenu for Categorized Favorites",
      "version": "1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "favoritesmenu for Categorized Favorites-6328-1-7.7z",
      "uploadedUnix": "1332539460",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/c5d07ce14e878b5e1a5acda9e7338138130507718d6e499cd18ff85eb19fcdeb/analysis/1406775575/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/favoritesmenu%20for%20Categorized%20Favorites-6328-1-7.7z?fid=46121&ttl=1535763663&ri=8192&rs=8192&setec=99fed7db30bd32b057addf1ffdaab83e"
    },
    {
      "fileId": "46122",
      "name": "Favoritesmenu for Categorized Favorites with more color",
      "version": "1.7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Favoritesmenu for Categorized Favorites with more color-6328-1-7.7z",
      "uploadedUnix": "1332539515",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/01f8e984748c2be1aa1a3a1de0d32a83397e56c77ecae9db6b357d1420195a49/analysis/1406775575/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Favoritesmenu%20for%20Categorized%20Favorites%20with%20more%20color-6328-1-7.7z?fid=46122&ttl=1535763664&ri=8192&rs=8192&setec=3ee7012e4743cadb18e530888289b233"
    }
  ]
}