{
  "modId": 63319.0,
  "modName": "Daedric Retexture",
  "summary": "Redone Daedric Texture",
  "descriptionHtml": "Hi everyone, I know that there are many, many retextures out there of all the different types of armor.  If I knew how to create things in blender and not just blow them up, I would create new armor, but that for now eludes me.\r<br />Anyway, out of all the armors in Skyrim, daedric is my favourite. It is a very well made armor, but very plain and not all that evil looking. So I have tweaked it. Fires from oblivion and all that. If I knew had to add an overall glow like flames or something, I would, but I don&#39;t know how.\r<br />So here it is. I have put the textures into a rar file, just download them and unpack them to skyrim/data/textures/armors(or weapons, depending on which you are extracting at the time, I have done them all)/daedric.\r<br />As I am very new to modding, I hope that somewhere, someone will enjoy this.  These are just the textures which should be applied to vanilla armor, so no stat changes or anything.\r<br />If there are any issues, please let me know. \r<br />\r<br />UPDATE.\r<br />I think I have successfully managed to get everything into one file. It will still need to be downloaded manually but if you use nmm just go to your downloads and add mod from file in the nexus mod manager. I have experimented, and that works for me, but for some reason I can&#39;t get the download button to work properly. Must be all my inexperience and newness to the whole process.\r<br />Again, if there are problems, please let me know. I don&#39;t know much but I might be able to help or ask a wiser head than I.\r<br />\r<br />YET ANOTHER UPDATE\r<br />I have spent far too much time on this, but I have time. So I have gone through the comments and yes this armor would look better 2k or 4k, unfortunately I can&#39;t do that as of yet.  BUT, what I have done is gone through everything I can think of and try to improve it. There is another file now, this one has some changes. I have added new glow maps, the armor now glows in places where the firey bits are. Again, just download the rar file and activate it through the mod manager or extract it and place the folders in the appropriate area.  The weapon retexture has been done, but there is just the standard glow on them, I didn&#39;t change that. Yet. I have changed the maps, before the armor and weapons had a ridiculous shine, they no longer have that.\r<br />\r<br />I would love to hear peoples comments. Please drop me a note and let me know what you think or where I can improve things.\r<br />Much appreciated.",
  "categoryId": "29",
  "version": "2",
  "author": "flyingmushroom00",
  "createdUnix": "1425350870",
  "updatedUnix": "1425581004",
  "containsAdultContent": false,
  "uploadedBy": "flyingmushroom00",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000150269",
      "name": "daedric armor and weapons retexture armor glow",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5152",
      "fileName": "daedric armor and weapons retexture armor glow-63319-2.rar",
      "uploadedUnix": "1425581004",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/6246a0ef6c4b531f295e5abc0fae90a06e88858cfdf7b328f8e2a5567d80b1ee/analysis/1425581047/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/daedric%20armor%20and%20weapons%20retexture%20armor%20glow-63319-2.rar?fid=1000150269&ttl=1535852019&ri=8192&rs=8192&setec=eb2b3b2102522a8bc2a1e184a6cf27ed"
    }
  ]
}