{
  "modId": 63341.0,
  "modName": "ImprovedCombatStealthPerks.esp",
  "summary": "Mod to Improve the combat and stealth perks.  No new perk is introduced.  Many perks are now available 10 or 20 levels earlier.  It started with the premise of jealousy vis-a-vis the daggers 15x multiplier in sneak mode when compared the bow&#39;s 3x multiplier.  ",
  "descriptionHtml": "Mod to Improve the combat and stealth perks.  No new perk is introduced.  Many perks are now available 10 or 20 levels earlier.  It started with the premise of jealousy vis-a-vis the daggers 15x multiplier in sneak mode when compared the bow&#39;s 3x multiplier.  At the same time, I did not want to make it overpowered.  So in fact, I kept the 3X multiplier, but overdraft perks are now in increments of 30% damage improvement, up to 150%.  As enemies become harder, your shot becomes deadlier both in and out of sneak as long as you invest in the perk.  All in all, I looked every perk and changed it to what I thought it should be in effect and level requirement while keeping balance in mind.  For example, the gold and treasure perk are now available 10 levels earlier as to give a chance for all players to see and incentive to keep playing when you reach 50.  Also many perks were crap like poisoner 25%; big whoopididoo.  That&#39;s now 50% as to be more faithful to its title and not being overly poweful.  Speech perks are improved especially on the buying end because a friend will only pay so much for an item, but if your buying from them they will often cut you a deal.  A lot of small but very appreciable improvements to perks.  I&#39;m not saying it&#39;s perfect, but it&#39;s certainly improved and certainly welcome to anyone who wants to play with a bow and be taken more seriously.  \r<br />\r<br />Distribution to sites other than nexusmods.com is forbidden.",
  "categoryId": "73",
  "version": "1.00",
  "author": "ericore",
  "createdUnix": "1425400259",
  "updatedUnix": "1425400250",
  "containsAdultContent": false,
  "uploadedBy": "ericore",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000149991",
      "name": "ImprovedCombatStealthPerks",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "ImprovedCombatStealthPerks-63341-1-00.7z",
      "uploadedUnix": "1425400250",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/3d7267681f8b7062c5beff17e4eca5171f5aba012a82aa7e2802f0f3a611cde5/analysis/1425400267/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ImprovedCombatStealthPerks-63341-1-00.7z?fid=1000149991&ttl=1535852036&ri=8192&rs=8192&setec=82903a2518658fa987f1513ca39bc19d"
    }
  ]
}