{
  "modId": 63592.0,
  "modName": "Palidell - A Treehome in the Rift",
  "summary": "A barely lore-friendly treehouse in the Rift. My very nearly late entry into the r/skyrimmods contest.",
  "descriptionHtml": "[b][i][color=#6aa84f][size=3]Do you like trees? Does wandering the massive and open tundra of Skyrim make you feel exposed? Want something that [/size][size=3]will only just make you miss the graht-oaks of Valenwood? Have a need for a house where you can easily fall to your death? Then maybe, just maybe, Palidell is for you. [/size][/color][/i]\r<br />[/b]\r<br />[size=2]Because I like lore and stories, this house comes with a badly implemented backstory. [i]As many mages are wont to do, Paligorn of Elden Root left his home in pursuit of knowledge, towing along his unenthused niece and nephew, Cyllaena and Bleddyn. Cyrodiil couldn&#39;t sate his appetite, as the Synod and the College of Whispers are incredibly tight-lipped and rather unwelcoming to those not in their circles. With the destruction that was still making Morrowind and Vvardenfell barely habitable, it seemed unlikely he&#39;d find any living or suitable peers there. So, he set his sights on Skyrim to learn and share his knowledge at the College of Winterhold.[/i][/size][i]\r<br />[size=2]And then he was promptly disappointed. With the local Nords demonization of the College and its residents, the number of yearly applicants had dropped to 1, if even that. Not to mention that they managed to put their college in the coldest part of Skyrim imaginable. Needless to say, Paligorn thought better of living in the blizzard-prone ruin known as Winterhold, and decided to find a location more suitable for living. After all, he&#39;d gone through all the trouble of going to Skyrim, no point in leaving.[/size]\r<br />[size=2]So, his search for an appropriate location to house himself led him to nice spot around the Treva River. Seeing very few other places that he&#39;d be welcomed as warmly, he planted the seed that would become his home. A magical seed that grew within a few hours. After much toil and labor, mostly on Bleddyn&#39;s part, they&#39;d built for themselves a house suitable for a small group of displaced Bosmer. \r<br />[/size][/i]\r<br />[color=#6aa84f][size=5][u][b]Requirements:[/b][/u][/size][/color]\r<br />[size=2]Skyrim (obviously), Dragonborn, and Hearthfire\r<br />[/size]\r<br />[color=#6aa84f][size=5][b][u]Features:[/u][/b][/size][/color]\r<br />[list][*]A laboratory that includes bookshelves, a good amount of storage, a custom shrine to the elven deity Xarxes, an alchemy lab, an enchanting table, a staff enchanter, and a soul gem font where one can finally use all those flawless amethysts that seem to be so commonplace in Skyrim (Seriously, Talen, try looking under your bed. They are everywhere.)\r<br />[/*]\r<br />[*]A master bedroom with a mannequin, a bookshelf, a little chest to stores your treasures, some weapon racks, and a bed (who would&#39;ve thought?)\r<br />[/*]\r<br />[*]A lounge with pipes for smoking, a couch for sitting, and a tub for bathing (that does, indeed, work with Bathing in Skyrim)\r<br />[/*]\r<br />[*]A kitchen with some storage here and there, a stove and a sort of oven (that&#39;s not really an oven but a plate on some coals), two custom drinks of the Bosmeri variety, and a table with chairs\r<br />[/*]\r<br />[*]A workbench and a grindstone on the guard&#39;s balcony\r<br />[/*]\r<br />[*]A guard that will hopefully be wandering around patrolling and should probably be able to follow you (unless I mangled up his AI packages and factions as I imagine I did) \r<br />[/*]\r<br />[*]Around six planters dotting the exterior and many harvestable potted plants as well\r<br />[/*]\r<br />[*]A decently textured set of custom armor with a matching bow inside of the guard&#39;s room\r<br />[/*]\r<br />[*]A mediocre view since I didn&#39;t think about the awesome possibilities until halfway through\r<br />[/*]\r<br />[*]Unique music inside and around the house\r<br />[/*]\r<br />[*]An odd choice to make the lighting almost exclusively torchbug and lunar moth jars\r<br />[/*]\r<br />[*]The possibility of of painful fall death with a wrong step (have fun on the spiral stairs I somewhat regret using)\r<br />[/*]\r<br />[/list]Currently two options for the spare room: an extra bedroom where you can throw your followers, or an armory with a few trophy bases\r<br />\r<br />[color=#6aa84f][size=5][u][b]How to obtain:[/b][/u][/size][/color]\r<br />[size=2]The house is already marked on your map and I believe you can fast travel to it. I don&#39;t recommend fast travelling to it. Really, don&#39;t, unless you are prepared for pain. The key will be on the body of poor Paligorn, and you will have to retrieve it if you want to get inside. \r<br />[/size]\r<br />[color=#6aa84f][size=4][u][b]Other things about the house:[/b][/u][/size][/color]\r<br />[size=2]There are many irksome things about this house that I&#39;ll apologize for in advance. The branches clip into just about everything. I couldn&#39;t figure out how to make the Y&#39;ffre shrine functional despite making it an activator.  When the doors open you can see the wall behind it. The house is actually quite a pain to navigate. I have been trying to get a Multiple Adoptions version working, but I keep getting CTD when I enter the house. (If someone&#39;s willing to help me on that bit, you would be a golden god.) But, I also wanted to submit this into the [url=http://www.reddit.com/r/skyrimmods/comments/2vvsr2/skyrim_modding_contest_1_submission_thread/]r/skyrimmods contest[/url] and ran out of time to really figure some things out. This is my first time building a house and as much as I love this house, I also really wanted to be finished with it for a bit. I&#39;ll fix things, and if they&#39;re gamebreaking I will definitely try to fix them right away. But, I also want to stop looking at that Creation Kit for a while because it upsets me so greatly sometimes.\r<br />[/size]\r<br />[color=#6aa84f][size=5][u][b]Thanks:[/b][/u][/size][/color]\r<br />[size=2]Before the credits, I&#39;d first like to thank every single person whose ever made mod resources, whether I&#39;ve used them or not. Without generous people like you, people who can&#39;t do very many things, like me, would never be able to make cool things like this house. You are a boon to the Skyrim mod community and I thank all of you.\r<br />[/size]\r<br />[color=#6aa84f][size=5][u][b]Credits: [/b][/u][/size][/color]\r<br />[size=2]By Y&#39;ffre, so many.\r<br />[/size]\r<br />[size=2]InsanitySorrow - the huts and clutter[/size]\r<br />[size=2]Elianora - various clutter and inspiring houses[/size]\r<br />[size=2]Elinen - leaf textures [/size]\r<br />[size=2]Stroti - various clutter[/size]\r<br />[size=2]Tamira - various clutter [/size]\r<br />[size=2]Jokerine - various clutter[/size]\r<br />[size=2]Blary - various clutter[/size]\r<br />[size=2]Pendraia - basket textures[/size]\r<br />[size=2]Saerileth/Tueffel - windchimes[/size]\r<br />[size=2]GenunDrup - Spriggan Statue[/size]\r<br />[size=2]Angilla - Forest throne[/size]\r<br />[size=2]Nuska - Bleddyn&#39;s hair[/size]\r<br />[size=2]Nevenbridge81 - Original eye textures[/size]\r<br />[size=2]Mr. Dave - eye normal map fix [/size]\r<br />[size=2]Cursist - Hood of Stranger[/size]\r<br />[size=2]TheDNighstade - Hair feathers[/size]\r<br />[size=2]Thusky - Netch Leather Armor[/size]\r<br />[size=2]Ghosu - horker dagger[/size]\r<br />[size=2]Andrew210488 - elven bow[/size]\r<br />[size=2]OrganicView - Music\r<br />[/size]Dualstein - For being my moderately supportive boyfriend that tested and this mod and took the first three pictures in the gallery as well ",
  "categoryId": "67",
  "version": "1.0",
  "author": "Luna Solaris",
  "createdUnix": "1425948609",
  "updatedUnix": "1425948571",
  "containsAdultContent": false,
  "uploadedBy": "dualstein",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000150868",
      "name": "Palidell",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "283150",
      "fileName": "Palidell-63592-1-0.rar",
      "uploadedUnix": "1425947938",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Palidell-63592-1-0.rar?fid=1000150868&ttl=1535852257&ri=8192&rs=8192&setec=59dd5888c261948bd2a715d5ebb1bcb9"
    },
    {
      "fileId": "1000150870",
      "name": "Palidell - Armory Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "283157",
      "fileName": "Palidell - Armory Version-63592-1-0.rar",
      "uploadedUnix": "1425948571",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Palidell%20-%20Armory%20Version-63592-1-0.rar?fid=1000150870&ttl=1535852257&ri=8192&rs=8192&setec=72a6fcd604aee2889661ea004e30557b"
    }
  ]
}