{
  "modId": 63631.0,
  "modName": "More Dwemered Textures - LOD textures",
  "summary": "Provides LOD textures for Markarth to fit the style of the mod More Dwemered Textures. Requires Tes5LODGEN to use",
  "descriptionHtml": "[font=Verdana][center][b][size=1]This is a nexusmods.com exclusive mod, I do not give permission for it to be uploaded to any other website, domain name or file sharing resource.\r<br />Anyone who sees this file on another website has full permission to file a DMCA against it on my behalf, and please notify me of it directly.[/size]\r<br />\r<br />[font=Georgia][size=6][color=#e69138]More Dwemered LOD Textures[/color][/size][/font][/b]\r<br />\r<br />Requires [url=http://www.nexusmods.com/skyrim/mods/5827/?]More Dwemered Textures[/url] to match and [url=http://www.nexusmods.com/skyrim/mods/62698/?]Tes5LODGEN[/url] or [url=http://www.nexusmods.com/skyrim/mods/59721/?]DynDOLOD [/url]to be placed into the game.[/center][/font]\r<br />\r<br />More Dwemered Textures is my favorite retexture of Markarth and the Dwemer ruins. It makes those areas so much brighter and more vibrant, especially when combined with a city overhaul. However, the problem remained that the LODs for Markarth still showed them as being primarily stone, so as you got closer to the city or to one of the ruins, there would be this awful pop when all of the high quality textures came into view and all the stone got replaced by gold. \r<br />\r<br />Now with Tes5LODGEN having been released, users can generate their own LODs to fit their worldspace and as such I decided to make this, for myself and for others, so that we could all have matching textures. \r<br />\r<br />[u]Please note[/u] that there are some small limitations. I have only done the textures for the close up LODs, not the extreme distance ones, primarily because I&#39;m not sure where to find the other set of textures or how they work. \r<br />There will also still be some popping in of the gold because of the limitations of the LOD textures. There are over twenty textures for Markarth when its fully loaded. There are only three LOD textures for the same area and they are a tiny tiny size, 256 x 256. This means that I cant get the same amount of detail in as I would like, and also that a lot of places that have gold on the normal textures, don&#39;t even have areas assigned to them on the LOD textures, or they have areas that also cover other parts of the LOD, which would result in weird lines going through some surfaces where there is not meant to be gold. I have done the best I could to match up the full textures and the LOD textures, but it&#39;s not perfect. \r<br />\r<br />[img]http://static-1.nexusmods.com/15/mods/110/images/63631-1-1426059584.png[/img]\r<br />[center][size=1]Please note : Pictures were taken with an alpha version of the mod, I have already made corrections and improvements since then.\r<br /> The pictures are purely for demonstration purposes. [/size][/center]\r<br />\r<br />[color=#BF9000][size=3]Installation Instructions[/size][/color]\r<br />   1. Install [url=http://www.nexusmods.com/skyrim/mods/5827/?]More Dwemered Textures[/url]\r<br />   2. Install [url=http://www.nexusmods.com/skyrim/mods/62698/?]Tes5LODGEN[/url]\r<br />   3. Install this file\r<br />   4. Run Tes5LODGEN\r<br />   5. Ensure created files are installed properly\r<br />   6. Enjoy.\r<br />\r<br />[color=#BF9000][size=3]Credits and Permissions[/size][/color]\r<br />All assets used in the creation of this mod were from the vanilla game and then edited by me.\r<br />I don&#39;t allow this file to be uploaded to ANY other sites under any situation, but if you would like to take these files and edit them and improve upon them to use in your own mod, please ask me first. ",
  "categoryId": "29",
  "version": "1.0",
  "author": "Nazenn",
  "createdUnix": "1426060234",
  "updatedUnix": "1426059976",
  "containsAdultContent": false,
  "uploadedBy": "Nazenn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000151015",
      "name": "More Dwemered LODs",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "More Dwemered LODs-63631-1-0.zip",
      "uploadedUnix": "1426059976",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/03ed4246137010ad382b4067b6f96c8c902ac905957ebc8785f1c95def002136/analysis/1426060022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Dwemered%20LODs-63631-1-0.zip?fid=1000151015&ttl=1535852303&ri=8192&rs=8192&setec=d726c24c1ee20bd4ef000f24dccd7e8f"
    }
  ]
}