{
  "modId": 63739.0,
  "modName": "Mkyi&#39;s Archer Bundle",
  "summary": "Adds craftable arrows to the game&#33;",
  "descriptionHtml": "This mod adds 8 different arrows: \r<br />-Fire Arrows \r<br />-Force Arrows (Creates an explosion at the point of impact that knocks down all characters within a certain distance.) \r<br />-Gas Arrows - Creates a giant poisonous cloud that does slow damage over a longer period of time \r<br />-Ice Arrows \r<br />-Contact Exploding Arrows \r<br />-Proximity Exploding Arrows \r<br />-Shock Arrows - Does Shock damage \r<br />-Timed Expoding Arrows \r<br />-Contact Poison Arrows \r<br />-Proximity Poison Arrows \r<br />\r<br />Next Update \r<br />-De Buffing Arrows - Makes the target weak to the specified damage type \r<br />-Storm Arrows - Creates an elemental (Fire / Frost / Shock) storm centered on the point of impact \r<br />\r<br />Future Arrow Plans \r<br />-Hunter&#39;s Arrows - Cause extra damage to the specified enemy type \r<br />-Light Arrows - To light up dark rooms \r<br />- Mass Frenzy - Send all npc&#39;s in a large area into a frenzy \r<br />-Summon Arrows - Summons a leveled Atronach and the point of impact \r<br />\r<br />The arrows can be crafted at any forge. \r<br />All arrows require 1 iron ingot and 2 fire wood to craft, as well as a specialty ingrediant depending on the type of arrow. \r<br />\r<br />NOTE: The Fire, Ice, and Poison arrows will damage any NPC&#39;s close to the target&#33; \r<br />\r<br />DLC: This mod requires NO DLC&#33; \r<br />\r<br />If you have any thoughts to make this mod better, please comment them below. I will gladly accept requests for new arrows. If you have any requests for other mods, feel free to list them in the comments. I would rather attempt something people want, rather than make something people hate :P \r<br />\r<br />I am also trying to decide my next mod. Below are some possible ideas. If you have a preference, along with thoughts on one or more of the possible ideas, comment it below. \r<br />---Hunter Perk Tree--- \r<br />[The Hunter Perk Tree would have things like extra damage against certain animals, starting for small game, up to bears and trolls. Other ideas for this are extra arrow damage and fortify sneaking.] \r<br />---Dragon Perk Tree--- \r<br />[The Dragon Perk Tree would have perks such as increasing health, magika, and stamina, lowering spell costs further, reduced shout recharge, and extra damage against dragons.] \r<br />---Attribute/Perk Points--- \r<br />[This would change the amount of attribute(from 1 to 3) and perk(from 1 to 2) points given for each level.] ",
  "categoryId": "55",
  "version": "",
  "author": "Mkyi",
  "createdUnix": "1426332581",
  "updatedUnix": "1426332581",
  "containsAdultContent": false,
  "uploadedBy": "Mkyi",
  "primaryFile": null,
  "files": []
}