{
  "modId": 6374.0,
  "modName": "Dalls_Mage_Apprentice",
  "summary": "Mage_Apprentice is clothes / robes custom re-texturing (n not simple -in part - recolor) mod which changes how novice college mages and some other (Winterhold staff) Mages / their attires / robes look.*",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Mage_Apprentice\r\n\r\nv1.1\r\n\r\n04/02/2012\r\n\r\nMage_Apprentice is clothes / robes custom re-texturing (n not simple - in part - recolor) mod which changes how novice college mages and some other (Winterhold staff) Mages / their attires / robes look.*\r\n\r\n* Word of warning - my work actually do changes how these items look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers!\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nMages in Skyrim - especially Winterhold Collage academics n students - are for some reason made to look as quite motley n in-rags crew. Journeymen attires with furred hoods are interesting idea if you want to see (collage) mages as consummate travellers but - in my opinion unnecessary - addition of beggars\\' bandages / wrap-arounds (mages robes n boots) makes them look plain silly. \r\n\r\nThese (item) models being what they are were not easy to convert into something a bit more sensible and still Skyrim lore-friendly but as far as I\\'m concerned, it was worth effort as this new (mod) lot gives college serving mages and novices - student mages their dignity n appropriate (serious student) collage looks back. \r\n\r\nLower / collage staff mages and new mage recruits - collage novices (their outfits) were made on purpose to look more like real school uniforms - so if you (while wearing them) feel somewhat strange or you remember how it was first time ever in new school - don\\'t you worry - it just means that I have done my job quit well. ;)\r\n\r\nAnd if you don\\'t mind that, you might be as well interested in my High Mage (higher level / collage instructor mages) and my optional add-on Mage Statue (Winterhold Collage yard) which will push this feeling - of being / studying in serious n proper (High Magics) institution / your in-game immersion - a \\\"little\\\" bit further.\r\n       \r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my texture files from Data/textures/clothes/mageapprentice - after that original look will be restored to your game. \r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!\r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nNote on v1.1: All robe textures have been redone to make them behave better under all in-game light conditions. Some minor esthetical changes otherwise very similar to previous version. \r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.\r\n\r\n\r\n\r\n",
  "categoryId": "60",
  "version": "1.1",
  "author": "Dall",
  "createdUnix": "1326758170",
  "updatedUnix": "1328365740",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "20494",
      "name": "Dalls_Mage_Apprentice",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12187",
      "fileName": "Dalls_Mage_Apprentice-6374.7z",
      "uploadedUnix": "1326758499",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2f8ea74520563e91b52b3bc01fbe15bd1cdce8454e05f5cd4575cd00dace916c/analysis/1406617509/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Mage_Apprentice-6374.7z?fid=20494&ttl=1535763743&ri=8192&rs=8192&setec=c09362b1f1be5e535f08ee1826a15949"
    },
    {
      "fileId": "25803",
      "name": "Dalls_Mage_Apprentice_v11",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13192",
      "fileName": "Dalls_Mage_Apprentice_v11-6374-1.7z",
      "uploadedUnix": "1328365740",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f71e880340117dc6bc643bd3c1690f222b8ae62d9dd442c2b808544f2481004b/analysis/1406653158/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Mage_Apprentice_v11-6374-1.7z?fid=25803&ttl=1535763743&ri=8192&rs=8192&setec=73c31af5814123f2576141c1e732edb5"
    }
  ]
}