{
  "modId": 63809.0,
  "modName": "A Cannibals Shack",
  "summary": "This mod adds a little Shack you can claim for yourself. It&#39;s just outside of Riverwood behind the Saw Mill on the other side of the River. It includes a Bed and a no respawn Chest. There is also a special surprise for Cannibals in the Basement. Includes new Kidnapping feature.\r<br />\r<br />Very handy if you are just beginning your Journey and ",
  "descriptionHtml": "[u]Description:[/u] \r<br />\r<br />This mod adds a little Shack you can claim for yourself. It&#39;s just outside of Riverwood behind the Saw Mill on the \r<br />other side of the River. It includes a Bed and a no respawn Chest and \r<br />some other Sacks to store all your Stuff. There is also a special \r<br />surprise for Cannibals in the Basement. \r<br />\r<br />Very handy if you are just beginning your Journey and need a safe place to store your belongings. \r<br />Or if you are a Cannibal and/or enjoy punching people in the face. \r<br />\r<br />Should be compatible with every mod because it just adds stuff and doesn&#39;t \r<br />remove anything. If it isn&#39;t please tell me and I will try to adjust \r<br />things. \r<br />\r<br />Btw. I&#39;m still gonna update this Mod so any ideas/wishes are very welcome. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />15.03 Update2: Release Spell, Vivisection Dagger with Msg. \r<br />\r<br />15.03 Update: little Quest and new Armor Set \r<br />\r<br />14.03 Update: Vivisection Dagger (Tutorial down below) \r<br />\r<br />12.03 Update: Kidnapping Spell (be sure not to be detected while casting) \r<br />\r<br />10.03 Update: 3 new recepies \r<br />\r<br />\r<br />\r<br />\r<br />[u]Tutorial Vivisection Dagger:[/u] \r<br />\r<br />you first have to learn the Spell Vivisection knowledge found in a Book upstairs (it will not appear in you Skill menu) Once you learn propper vivisection you need to grab yourself one of the 2 Vivisection Daggers (the one with an &#34; &#33; &#34; at the end of the description text has a little Message when you harvest Meat) and start Chopping one of your Victims (they still have to be alive) the Meat will be added to your inventory. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[u]Please note [/u]\r<br />- Please excuse any bugs. If you report them I&#39;ll try to fix it right away. \r<br />- There is a secound Ring of Namira found in a Chest downstairs. If you use it dont equipt the Ring of Namira you get through the quest this will resault in both of them not working anymore. ",
  "categoryId": "35",
  "version": "1.5",
  "author": "Schmornoff",
  "createdUnix": "1426469395",
  "updatedUnix": "1427830792",
  "containsAdultContent": false,
  "uploadedBy": "Schmornoff",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000153748",
      "name": "smfCannibalsShack",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "316",
      "fileName": "smfCannibalsShack-63809-1-5.rar",
      "uploadedUnix": "1427830792",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/ce57d10f5a31ffd6ace26b3a62f467c21903d991ed5d081fabe0507f5c7eea26/analysis/1427830802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/smfCannibalsShack-63809-1-5.rar?fid=1000153748&ttl=1535852503&ri=8192&rs=8192&setec=6db8ea4b43af2d1803acb2589b505d11"
    }
  ]
}