{
  "modId": 63844.0,
  "modName": "Flora Respawn Fix - Traduzione italiana",
  "summary": "Importantissimo bugfix che risolve il grave problema della mancata rigenerazione di piante e risorse naturali.",
  "descriptionHtml": "[center][color=#93c47d][size=5][b]Flora Fespawn Fix[/b][/size][/color]\r<br />[b][color=#6d9eeb]Un lavoro di Bluedanieru[/color][/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/31268/?][color=#ff0000]Link alla mod originale[/color][/url][/center]\r<br />\r<br />[center][color=#d5a6bd][b]T R A D U Z I O N E     I T A L I A N A[/b][/color][/center]\r<br />\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/31268/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D31268&pUp=1][b][color=#ff7700]IL FILE È DISPONIBILE ANCHE NELLA PAGINA ORIGINALE, FILES, SEZIONE MISCELLANEOUS.[/color][/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/31268/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D31268&pUp=1][color=#ff7700][size=1]This file is also available in the original Download page, Miscellaneous section.[/size][/color][/url]\r<br />\r<br />Quasi tutti abbiamo questo bug, ma magari non molti ne sono realmente consapevoli. Vi è mai capitato di raccogliere un fiore e di notare che, anche a distanza di &#34;settimane&#34;, questo fiore non risbocci? Oppure di raccogliere una treccia d&#39;aglio in cucina e che questa non si rigeneri? O di avere nella vostra tenuta una zangola che non produce più il burro?\r<br />\r<br />Ecco, questo è il bug in questione, che a lungo andare può potenzialmente portare a un grave impoverimento di tutte le risorse naturali di Skyrim. Probabilmente molti giocatori danno talmente per scontato questo comportamento che potrebbero persino pensare che sia un effetto voluto, che alcune piante, funghi, mirre e orecchie di elfo, conigli e fagiani appesi, la zangola e le botti di idromele di HearthFires, siano semplicemente sfruttabili una volta sola. [color=#ea9999][u]NO[/u][/color]. Si tratta di un bug. Molto molto subdolo.\r<br />\r<br />Affinché le condizioni per il bug si presentino, basta raccogliere una risorsa naturale (fiori, uova, funghi, cirripedi, ma anche trecce d&#39;aglio e conigli appesi nelle cucine) e poi ritornare nella stessa zona prima che sia trascorso il periodo necessario (di solito qualche giorno) affinché la risorsa si rigeneri. Una volta effettuato un salvataggio in queste condizioni e riavviato il gioco per la sessione successiva, tutte queste risorse spariscono per sempre. Questo perché si crea un errore tale per cui il gioco si &#34;dimentica&#34; indefinitamente di rigenerare le risorse. Questo bug è presente fin dalla patch 1.3 e non è mai stato risolto né dalle patch ufficiali successive, né dalla Unofficial Skyrim Patch.\r<br />\r<br />[color=#f4cccc][b]L&#39;unico modo per risolvere il bug è installare questo fix[/b].[/color]\r<br />\r<br />[color=#93c47d][size=3][b]FUNZIONAMENTO E INSTALLAZIONE[/b][/size][/color]\r<br />\r<br />Questo fix, a detta dell&#39;autore originale, altera il modo in cui flora e fauna sono processate dall&#39;eseguibile di Skyrim, in modo tale da non risentire più di questo bug. Per la sua installazione, basta scaricare il file originale [url=http://www.nexusmods.com/skyrim/mods/31268/?]a questo indirizzo[/url], quindi sostituire il file .esp con la versione in italiano. Non serve ripulirlo con TES5Edit, è già pulito e [i]qualsiasi modifica ulteriore rischia seriamente di corromperne le funzioni[/i].\r<br />\r<br />Questo fix funziona sia per risorse regolarmente &#34;funzionanti&#34;, sia per risorse già corrotte e non più rigeneranti.\r<br />Le risorse regolarmente &#34;funzionanti&#34; vengono automaticamente aggiustate con l&#39;installazione del fix e non c&#39;è più pericolo.\r<br />Discorso diverso per le piante e le risorse corrotte. Questo fix funziona anche per loro, ma affinché ciò accada è necessario dar loro una mano: una volta che si osserva che una risorsa (una pianta, un fungo...) si è rigenerata, occorre infatti raccoglierla immediatamente; lasciandola non raccolta, al successivo caricamento del gioco quella specifica risorsa apparirà ancora corrotta e bisognerà aspettare che si ripristini nuovamente. Non è un grave problema di per sé, ma le risorse appunto continueranno a essere non funzionanti in modo corretto finché non le si raccoglie. Una volta raccolte, si aggiusteranno automaticamente.\r<br />\r<br />Un ulteriore aiuto nel caso in cui la risorsa si trovi nei pressi di una località frequentata molto spesso (ad esempio vicino alla casa principale del giocatore) può essere aprire la console, selezionare la risorsa, digitare [color=#ffff00]disable[/color], chiudere la console ([i][b][color=#f4cccc]mantenendo la risorsa selezionata&#33;&#33;&#33;[/color][/b][/i]), riaprirla subito e digitare [color=#ffff00]enable[/color]. Quindi attendere la rigenerazione e raccoglierla.\r<br />\r<br />Se si vuole avere un aiuto ulteriore per evidenziare il comportamento e il buon funzionamento del Fix, si può provare a installare [url=http://www.nexusmods.com/skyrim/mods/63014/?]questa mod[/url] che modifica il tempo di rigenerazione delle risorse e dei contenitori dai 10 o 30 giorni (a seconda delle risorse) impostati dal gioco ad appena 2 e 3 giorni rispettivamente. Si eviterà così di dover attendere troppo a lungo. Questa mod non ha bisogno di traduzione. Occhio che questo influenzerà anche la rigenerazione dei banditi e dei [i]dungeon[/i] (ma ciò può anche essere un bene, se si amano le sfide...).\r<br />\r<br />[size=3][b][color=#93c47d]DISINSTALLAZIONE[/color][/b][/size]\r<br />\r<br />[color=#f4cccc][u][b]La disinstallazione non è supportata[/b][/u][/color]: il minimo che possa capitare è che tutte le risorse raccolte da quando il fix è attivo spariscano per sempre. Anche altre risorse non raccolte potrebbero presentare strani comportamenti. La soluzione ideale in effetti è semplicemente installare questo fix e dimenticarsi di esso.\r<br />\r<br />[size=3][b][color=#93c47d]COMPATIBILITÀ[/color][/b][/size]\r<br />\r<br />Controllando nel forum annesso a questo fix, risulta che sarebbe compatibile con Skyrim Flora Overhaul (posizionando il caricamento di FroraRespawnFix in basso rispetto ad esso), mentre la compatibilità con Harvest Overhaul è garantita solo installando l&#39;apposito fix modificato (non ancora tradotto in italiano, come del resto non lo è Harvest Overhaul). In generale, Flora Respawn Fix è compatibile con qualsiasi mod che però non alteri pesantamente i registri FLOR e TREE.\r<br />\r<br />Se non si è sicuri o si temono particolari incompatibilità con delle mod che modificano pesantemente i codici delle risorse affette da questo bug, basta fare un salvataggio manuale, quindi installare il Fix e provare il gioco per un po&#39; (magari senza fare nulla di impegnativo, senza portare avanti missioni gravose, ma soffermandosi sulle risorse e osservandone il comportamento); se tutto andrà bene (e nella gran parte dei casi probabilmente andrà bene) basterà andare avanti. Se emergeranno problemi, basterà ripristinare il salvataggio sicuro (privo del Fix).\r<br />\r<br />Come detto sopra, per evidenziare più velocemente le incompatibilità può essere d&#39;aiuto  [url=http://www.nexusmods.com/skyrim/mods/63014/?]questa mod[/url] che modifica il tempo di rigenerazione di risorse e contenitori.\r<br />\r<br />[color=#93c47d][size=3][b]PERFORMANCE[/b][/size][/color]\r<br />\r<br />Dalla pagina originale non risultano assolutamente esistere cali di performance, questo fix è difatti molto &#34;silenzioso&#34;. Le dimensioni del file di salvataggio potrebbero aumentare fino a un massimo di 5kB per ogni pianta raccolta finché resterà in attesa di rigenerarsi (circa 1MB per 200 piante); una volta rigenerate, lo spazio viene liberato.\r<br />\r<br />\r<br />[center][color=#ff7700][size=3][b]RINGRAZIAMENTI - ACKNOWLEDGEMENTS[/b][/size][/color][/center][color=#ff0000]\r<br />\r<br />[/color][color=#fce5cd]Un sincero e sentito grazie a Bluedanieru per questo fantastico fix. A me personalmente ha reso l&#39;esperienza di gioco molto più piacevole, eliminando quella fastidiosissima resistenza che provavo ogni volta che volevo raccogliere una risorsa naturale, per paura di non rivederla mai più&#33;\r<br />\r<br />Many sincere thanks to Bluedanieru for this fantastic fix. My personal game experience became really more pleasant, getting rid of that damning annoying resistance I felt every time I desired to harvest a natural resource, fearing that it never would have been returned.[/color]",
  "categoryId": "95",
  "version": "2.1.2",
  "author": "Bluedanieru",
  "createdUnix": "1426579355",
  "updatedUnix": "1426682530",
  "containsAdultContent": false,
  "uploadedBy": "Ro84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000152003",
      "name": "FloraRespawnFix - ITA",
      "version": "2.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "FloraRespawnFix - ITA-63844-2-1-2.rar",
      "uploadedUnix": "1426682530",
      "modVersion": "2.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/23aa6e6fa2fd64c73b680be0d96403287c273c36d7fae3bd8d496937fc5d67b5/analysis/1426682582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FloraRespawnFix%20-%20ITA-63844-2-1-2.rar?fid=1000152003&ttl=1535852535&ri=8192&rs=8192&setec=f03d87f88c594fe61eadbc5cdb5b1e62"
    }
  ]
}