{
  "modId": 63887.0,
  "modName": "Chris the Ripper - In Memoriam of Warlocktheripper",
  "summary": "Adds a new companion to the game called &#34;Chris the Ripper&#34; located in The Frozen Hearth Inn, in Winterhold. Immortalization of the now deceased YouTuber warlocktheripper.",
  "descriptionHtml": "Firstly, let me just state that i have made a somewhat notable return to making Skyrim Mods after going a long period without \r<br />making any. I have some big plans in mind, so do keep a look out for those :) -Japanga\r<br />[b][font=Georgia][size=6][u][color=#cc0000]\r<br />-~Description~-[/color]\r<br />[/u][/size][/font][/b][size=3]This mod, quite simply adds a new Nord follower to The Frozen Hearth Inn, in Winterhold named &#34;Chris the Ripper&#34;. It may not seem like much, but there&#39;s a deeper meaning present. After seeing the mod called &#34;Bear - In Memory of Taylor&#34; which was a mod dedicated to a fallen gamer, it motivated me to make this mod, and help spread the trend of making mods for gamers that have passed. \r<br />\r<br />Recently, i started listening to a variation to my all-time favorite song, Sweet Dreams by Marilyn Manson. It was an acoustic instrumental variant of it, and i loved it so much, but then realized the composer of it, warlocktheripper(also known by his real name Chris) died in 2012 of a heart attack. He mainly uploaded song recordings and stories, but he did also do gaming videos as well, and it was a deeply effecting thing to see him pass.[/size]\r<br />\r<br />[b][font=Georgia][size=6][u][color=#cc0000]-~Follower Stats~-\r<br />[/color][/u][/size][/font][/b][size=3]Chris the Ripper is an essential follower, meaning he cannot be killed under any circumstance. He levels with the player until the player reaches level 100, afterwards he quits leveling with the player, and stays at 100.\r<br />\r<br />Chris, when in combat uses a mix of his one-handed weapon and several Conjuration and Destruction spells(a usage of the name, warlocktheripper, in which he regularly has an axe, which i associate with rippers, and spells, to tribute to the &#34;warlock&#34; in his name)\r<br />He&#39;s also suppose to be marriageable, although i&#39;m unaware of this works or not as i haven&#39;t tested it in-game.[/size]\r<br />\r<br />[b][font=Georgia][size=6][u][color=#cc0000][b][font=Georgia][size=6][u][color=#cc0000]-~F.A.Q~-\r<br />[/color][/u][/size][/font][/b][/color][/u][/size][/font][/b][size=3][b][color=#999999]Q.Why are you ripping off the &#34;Bear - In Memory of Taylor&#34; mod?[/color]\r<br />[/b][b][i]A.I am not ripping off the maker of that mod&#39;s work and it is redundant to acuse me of doing such. This mod is inspired by that idea, but is by no means ripping it off or copying it.\r<br />\r<br />[/i][/b][b][color=#999999]Q.Who is warlocktheripper?[/color]\r<br />[/b][b][i]A.warlocktheripper is a now deceased YouTuber who the mod is based upon. [url=https://www.youtube.com/user/warlocktheripper/videos]His channel can be viewed here[/url]\r<br />\r<br />[/i][/b][b][color=#999999]Q.Why the name &#34;Chris the Ripper&#34;?[/color]\r<br />[/b][b][i]A.warlocktheripper&#39;s real life first name was &#34;Chris&#34; and it seemed a bit more lore-frjendly to use the name &#34;Chris the Ripper&#34; instead of &#34;Warlock the Ripper&#34; just so there&#39;s at least some brief [/i][/b][b][i]lore-integration\r<br />\r<br />[/i][/b][b][color=#999999]Q.Why does the in-game version hardly look like the real version of him?[/color]\r<br />[/b][b][i]A.I&#39;ve tried as hard as i possibly could to recreate his real life appearance, and do keep in mind there are some pretty large limits as to what you can and can&#39;t recreate through the Creation Kit without using any secondary mods. This is about as close as i could(and probably most modders without the usage of other [/i][/b][b][i]secondary mods) get to recreating it.\r<br />\r<br />[/i][/b][b][color=#999999]Q.Why make a mod for a deceased member of the CreepyPasta community?[/color]\r<br />[/b][b][i]A.Well he wasn&#39;t only apart of the CreepyPasta community, as stated somewhere above, he was also a gamer and did gaming recordings. \r<br />\r<br />[/i][/b][/size][b][font=Georgia][size=6][u][color=#cc0000][b][font=Georgia][size=6][u][color=#cc0000]-~Installation~-\r<br />[/color][/u][/size][/font][/b][/color][/u][/size][/font][/b][size=3]The mod is incredibly simple on terms of installation. For manual installation, simply drag the .esp and the two folders in the .zip into your regular Skyrim Data folder(which if you know your modding basics, you should know where that is) and merge the textures and the meshes with the currently existing ones(if there is already &#34;textures&#34; and &#34;meshes&#34; in the data folder)\r<br />\r<br />[/size][size=3]Or you could just click &#34;Install with NMM&#34; that works too.\r<br />\r<br />[/size][b][font=Georgia][size=6][u][color=#cc0000][b][font=Georgia][size=6][u][color=#cc0000]-~Thank you~-\r<br />[/color][/u][/size][/font][/b][/color][/u][/size][/font][/b][size=3]I give you my thanks for viewing this mod or even downloading and installing it and allowing this fellow gamer to properly live on through this mod. If you like the mod, be sure to leave an endorsement or even leave a comment. Thank you and have a nice day.[/size]",
  "categoryId": "66",
  "version": "1.0",
  "author": "Japanga",
  "createdUnix": "1426730035",
  "updatedUnix": "1426729983",
  "containsAdultContent": false,
  "uploadedBy": "Japanga",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000152081",
      "name": "Chris the Ripper - In Memoriam of Warlocktheripper",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "236",
      "fileName": "Chris the Ripper - In Memoriam of Warlocktheripper-63887-1-0.zip",
      "uploadedUnix": "1426729983",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9a6c6c3898e5fb0ee7d994a6f96de3cabd57323a583c5a26b137582507648820/analysis/1426730043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chris%20the%20Ripper%20-%20In%20Memoriam%20of%20Warlocktheripper-63887-1-0.zip?fid=1000152081&ttl=1535852574&ri=8192&rs=8192&setec=882511d5d554898971ef2179c36355d7"
    }
  ]
}