{
  "modId": 63888.0,
  "modName": "A Beggars Home",
  "summary": "Just a simple mod to add a place for sleeping and stashing gear when starting a new game.\r<br />Its under the bridge inside Whiterun at the entrance.",
  "descriptionHtml": "Just a simple mod to add a place for sleeping and stashing gear when starting a new game.\r<br />Its under the bridge inside Whiterun at the entrance.\r<br />\r<br />Inspired by BarronTV1&#39;s awesome Whiterun bridge den mod. A very nice mod.\r<br />[url=http://www.nexusmods.com/skyrim/mods/26409/?]http://www.nexusmods.com/skyrim/mods/26409/?[/url]\r<br />\r<br />&#33;Also, its not compatible with the above mod and any that edit the same area.&#33;\r<br />In case it wasnt obvious. xD\r<br />\r<br />But his mod is a little too... nice for my taste, considering the location. xD\r<br />Its not what im looking for nor could i find any other mod like this so i made my own.\r<br />The idea behind it is, im always playing on uber hard difficulity with many mods that add even more hard gameplay.\r<br />The only problem with that is that earning gold for a house,\r<br />you need lots of work and time to get enough gold... or be the Kings cousin. xD\r<br />And there is no real place to stash stuff, while its absolutlly vital.\r<br />You tend to look for a place to stash when even gold and arrows have weight. xD\r<br />So i wanted something that wont replace a house, be as less intrusive as possible and rather make you work even harder for one,\r<br />yet provide the most basic needs, sleep and stash.\r<br />The bed is more or less needed here but it made it look much better, otherwise would be too empty.\r<br />Didnt want to add any clutter, because i imagine you could actually take stuff and place real clutter around.\r<br />More immersive in my opinion.\r<br />And because its abbandoned and its you who settels in, you are supposed to make it clutter and not me. If you get the idea.\r<br />Rather than convince you like any other game that you or any other person lived there all along even if its empty for years.\r<br />Game logic does that sometimes. Or rather, all the time. xD\r<br />\r<br />I know there are lots of home mods, but i needed something specific for the start off.\r<br />And you will travel to whiterun a lot and with, for instance, fast travel disabled,\r<br />you will appriciate something nearby.\r<br />\r<br />In any case, enjoy.\r<br />\r<br />Free Content\r<br />Do what ever you want with it.\r<br />\r<br />Monetized Content\r<br />You are not permitted to re-upload this to any other site or\r<br />use any part of this mod in your own mod.",
  "categoryId": "74",
  "version": "1.0",
  "author": "theimmersion",
  "createdUnix": "1426732881",
  "updatedUnix": "1426732875",
  "containsAdultContent": false,
  "uploadedBy": "theimmersion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000152084",
      "name": "A Beggars Home v1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "235",
      "fileName": "A Beggars Home v1.0-63888-1-0.rar",
      "uploadedUnix": "1426732875",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/08370437bcae79089417f72c2183f95680792424c1310fc3d13fd582bff6591a/analysis/1426732923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Beggars%20Home%20v1.0-63888-1-0.rar?fid=1000152084&ttl=1535852575&ri=8192&rs=8192&setec=aabffdd62876ade0442028f40f78f787"
    }
  ]
}