{
  "modId": 63950.0,
  "modName": "Dark_wizzie&#39;s Vanilla Completionist Save File With USLEEP Fixes",
  "summary": "Vanilla save file with all quests done and all unique items for Skyrim Legendary Edition... with USLEEP&#39;s none-retroactive fixes AND max dungeon level lock.",
  "descriptionHtml": "This is a save file collection inspired by heatedsun&#39;s very nice 99% complete Vanilla save file here: http://www.nexusmods.com/skyrim/mods/27357/?\r<br />It&#39;s not made to compete with his/her file... It&#39;s to give players more options. I made a save file to my requirements and I am posting it here in case it helps others.\r<br />\r<br />[b][color=#ff0000][size=4]Included Saves:[/size][/color][/b]\r<br />1. Celapaleis\r<br />2. Celapaleis (Script Cleaned)\r<br />3. Celapaleis (Before Civil War quest)\r<br />\r<br />[size=4][b][color=#ff0000]Requirements:[/color]\r<br />[/b][/size]USLEEP is required. The save file was done before USLEEP existed, but has been saved over for USLEEP. The script cleaned version includes havoc resetting and removal of the old Unofficial Patch stuff. It is very likely that it makes no difference which one you choose. The Unofficial Patch team know what they&#39;re doing, so transition from the old, multiple patch system to USLEEP system should work flawlessly.\r<br />\r<br />TL;DR - Meant to be run with USLEEP and Skyrim Legendary Edition.\r<br />\r<br />Name: Celapaleis\r<br />Sex: Female\r<br />Race: Nord\r<br />Level: 150 (Advskill&#39;ed to level 81, then SetLevel 150 to make Miraak max strength.)\r<br />Hours Played: 44 hours\r<br />Playstyle: Dual-wielding warrior\r<br />\r<br />[b][color=#ff0000][size=4]Quest Paths:[/size][/color][/b]\r<br />Civil War: Stormcloaks\r<br />Thirsk Mead Hall: Rieklings\r<br />Dawnguard: Vampire Hunters\r<br />\r<br />[color=#ff0000][size=4][b]Features:[/b][/size][/color]\r<br />-Completed all Quests.\r<br />-Completed all misc. objectives. Most repeatable misc radiant quests have been completed at least once, but not all.\r<br />-Almost all Skyrim areas are cleared. All map markers discovered without using tmm 1 to increase player statistics.\r<br />-All skills at level 100.\r<br />-All enchantments known.\r<br />-All alchemy ingredient effects known.\r<br />-All houses owned.\r<br />-Thane of all holds.\r<br />-All spells known.\r<br />-All books owned AND READ. (No spell tomes but why the hell do you want that if you have all the spells?)\r<br />-All treasure maps found\r<br />-All shouts unlocked\r<br />-All active effects unlocked\r<br />-Thieve&#39;s Guild has been fully unlocked. Crown, all unique items on display, and all 125 job rewards are displayed.\r<br />-Invested in all possible shops.\r<br />-Deathbrand treasure has been found.\r<br />-All followers have been paid and set to allies, so blades for hire will join you for free.\r<br />-Sold produce to farmers, sold ores to all miners, sold logs to all loggers so they have positive disposition towards the player.\r<br />-All dragon priest masks.\r<br />-All unique weapons and armor, basically.\r<br />-Dawnguard Rune Axe and Bow of Stag Prince has been fully charged at 100 kills.\r<br />-Ebony Blade has been fully charged at 20 kills.\r<br />-Karstaag has been defeated but never summoned. Miraak and Alduin has been defeated. Please note: It&#39;s very easy to summon Karstaag and Alduin with console commands to fight them again, but Miraak needs four times its HP and his weapons back if you choose to fight him again (since he heals during the legit fight.) Ebony Warrior is also easily summoned with commands and has been defeated.\r<br />-The locations the items are stored are shown in one of the mod pictures.\r<br />-No children have actually been adopted but that ability has been unlocked for the orphanage.\r<br />-All perks unlocked, including werewolf perks and vampire perks.\r<br />-Contains min-maxed armor and weapons. They have the highest stats possible with USLEEP. (To get maximum melee DPS, use Jarrin Root poison + Ultima Weapon (for non-Frost-resistant enemies) or Omega Weapon (for Frost-resistant enemies), Ahzidaal (or Dukaan), OneHanded named items, Cicero&#39;s Top, and Fortify One-Handed potion. Damage should be far north of 3000.\r<br />-All skills have gone Legendary exactly once.\r<br />[i][u]This was achieved with legendary skills. However, the level is set back to 150 AND the magicka, health, and stamina are set back to level 150 values, spread out over all three stats. You can easily change this if you don&#39;t like this. The normal perks were done with advskill which acts like normal leveling up so no perk order problems, but the werewolf perks were done with addperk but tested to verify that the effects are working correctly.[/u]\r<br />[/i]\r<br />-All houses fully furnished and designed in a way so that every single room possible is in one of the three houses.\r<br />\r<br />1. Lakeview Manor - Kitchen, storage, bedroom. The family house. Small entrance room while other houses have a hallway.\r<br />2. Heljarchen Hall - Armory, trophy room, enchanting room.\r<br />3. Winstad Manor - Library, alchemy room, greenhouse. The alchemy warehouse.\r<br />\r<br />\r<br />[size=2]-Character has not married and that is technically a quest.\r<br />-The quests you have to do when kicked out of a guild have not been done because I&#39;ve never committed a crime against them.\r<br />[/size]-Paarthurnax has not been killed and that is a quest. And if you want to kill him, you&#39;re a bad person and you should feel bad.\r<br />-The Night Mother and Collect Pendant and Talk to Companion Person for Work quests are never-ending and thus are not &#39;finished&#39;.\r<br />-No unsafe ini tweaks have been done. Don&#39;t worry, I didn&#39;t touch Ugrids, etc.\r<br />-Quests have been checked off with UESP, Skyrim Official Guide (the book), and SkyComplete. Various player choices can affect the maximum amount of quests possible, so please don&#39;t compare save &#39;complete-ness&#39; by staring at our Quest Completed stat.\r<br />-Most items are placed in the same room as the character is in when the save file is loaded. Check the pictures to see where the items are. In addition, every single piece of clothing is placed in the dresser of the master bedroom in the same house. Every single piece of jewelry has been put in the bedside table next to it. Every single smithing supply item, normal armor, and weapon has been placed in different containers in the cellar.\r<br />-Both of the boys are saved from Diplomatic Immunity.\r<br />\r<br />\r<br />[color=#ff0000][size=4][b]Min-Maxed Setup:\r<br />[/b][/size][/color]The min-maxed setup includes Elven armor, because it is the lightest light armor. Light armor is generally superior to heavy armor. Both hit the armor rating cap, but light armor gives a 10% chance to dodge enemy attack, while heavy armor gives a 10% damage reflection (you still get hit) and a lesser chance of stagger. Another factor is weight; while wearing each set renders the set weightless, carrying multiple sets for magic, range, and melee builds uses up a lot of carry weight.\r<br />\r<br />The enchanting, smithing, and alchemy values were min-maxed with their appropriate Black Book bonus, potions, and equipment setup (Ahzidal&#39;s armor set, 41% alchemy pieces, etc). I did not forget about Notched Pickaxe when smithing. There are two swords: Omega Weapon, which are Dragonbone swords with fire and shock damage, and UltimaWeapon, which are Stalhrim weapons with fire and ice damage. Stalhrim improves frost enchantments but most enemies are resistant to frost in Skyrim. Wearing Dukaan or Ahzidal will further improve weapon enchantments. For maximum damage output, drink one of the fortify one-handed potions, wear the One-Handed set with dual-wield Ultima Weapons, Dukaan, and Cicero&#39;s top. You can hit a maximum of 6792 displayed damage rating.\r<br />\r<br />For archery, Ichaival is the DPS weapon due to its firing speed. Artemis&#39; Bow is for sneak attacks.\r<br />\r<br />For magic, realize that magicka regen enchantments are superior to fortify magicka. (This has been tested by me.) With destruction spells being without cost in the right outfit, it&#39;s rare to ever run out of magicka. This is why many of the magic armor pieces have fortify health, to prevent sudden death. And finally, the reason why none of the armor pieces have any magic resistance is because the player can easily reach past cap with the correct potions.\r<br />\r<br />And finally, against an enemy that doesn&#39;t just use melee or range (and doesn&#39;t use enchantments), usually the corresponding outfit + Miraak&#39;s robes and gloves is best. 100% spell absorption protects the player against all sorts of &#34;non magical damage&#34;. With just the helmet and boots, it is possible to achieve armor effect cap.\r<br />\r<br />\r<br />[color=#ff0000][size=5][b]So what are the differences between heatedsun&#39;s save file and mine?[/b][/size][/color]\r<br />[color=#00ff00][size=4]Pros:[/size][/color]\r<br />-My save file is started without any mods other than the Unofficial Skyrim, Dawnguard, and Dragonborn patch while heatedsun&#39;s was totally vanilla. This means I can have all of the non-retroactive fixes of those patches while Heatedsun&#39;s save file cannot (from June 2015 and earlier). Official Texture DLC and the Unofficial Texture DLC Patch were not loaded because none of the changes were none-retroactive. This is to ensure as clean-save as possible.\r<br />\r<br />-The character was leveled to 150 BEFORE touching a single dungeon or leaving Helgen. Dungeons are PERMANENTLY LEVEL-LOCKED based upon your level when you first entered the dungeon. If you visit every dungeon at level 1, your dungeons will all forever suck. There are ways around this. Deleting all encounter zones in a 99% completed save *seems* safe, but to be sure we have to make an identical encounter zone as the vanilla one used for a cell (to get the game to stop using the level-locked data as there is no way to directly reset that data). This is obviously extremely time-consuming as there are many cells in the game and to my knowledge no such mod exists. No legit player can get max-level dungeons for all dungeons like I can.\r<br />\r<br />-My save file has been Havoc-resetted. I also offered script-cleaned ones but I recommend using just the normal Havoc-resetted one. The script-cleaned version has the havoc resetting in addition to many more cleaning options but I think it is unnecessary. While Havoc-resetting is great, it is not perfect in that it doesn&#39;t reset every single item every time. Because of this I did my best to minimize bumping into clutter on my playthrough.\r<br />\r<br />-I have respawned various NPCs that I had to kill/found dead/found in the wiDeadBodyCleanupCell. Gotta revert the dragon attacks and Dark Brotherhood casualties. This doesn&#39;t break anything and if you don&#39;t like it, go ahead and disable them or kill them again.\r<br />\r<br />-In my opinion this is a pro. All of the Unusual Gems are not picked up and instead I finished the quests with commands. You can now see those pretty little things everywhere. :)\r<br />\r<br />-I have all of the normal perks while heatedsun&#39;s save file has a limited number of perks.\r<br />\r<br />-Contains min-maxed armors and weapons.\r<br />\r<br />-Civil War damage in towns have been reverted via console commands.\r<br />\r<br />-Tons of items placed in Lakeview Manor, taking the work of adding items via console away.\r<br />\r<br />[color=#00ff00][size=4]Neutral:[/size][/color]\r<br />-Almost all locations can be cleared. This is neutral because I bet heatedsun&#39;s save can do the same if you input the correct console commands. (SetLocationCleared command works, Google it and look up the code for the cell.)\r<br />\r<br />-You can turn into a Werewolf legitly with my save file, while heatedsun&#39;s save cannot. But it&#39;s trivial if you console commands. Still, nothing is smoother and less glitchy and more happy-feels than doing it legitly I guess?\r<br />\r<br />-Since I sided with the Dawnguard, I have all of the Dawnguard-only spells. But you could have just cheated on heatedsun&#39;s save to get the same effect.\r<br />\r<br />-Please note that you lose more quests that can be done than earn by siding with the Rieklings. I sided with the Rieklings because the Nords there were a bunch of whiners, and if you help them and remain honest, the people there don&#39;t like you either. And the rewards sucked.\r<br />\r<br />-heatedsun&#39;s save file is totally legit. Mine is not. I no-clipped everywhere, setspeed to 250, tgm, coc Riverwood, etc to get things done ASAP. I made sure all of my cheats used like this were not permanent and did not have any lasting negative effects. I didn&#39;t touch timescale or spawn new NPCs, for example. However, some dungeons will not be &#34;completed&#34; in that the dungeon puzzles are not-finished. This is visible when visiting a non-respawning dungeon.\r<br />\r<br />-The Update and DLC files have been cleaned with TES5Edit prior to starting the character.\r<br />\r<br />[color=#00ff00][size=4]Cons:\r<br />[/size][/color]-If you are adamant about having a clean-save and not having DLC, I can&#39;t help you.\r<br />\r<br />-I did not get any of the treasure map treasures because A) I suck at finding them even with guides and B) the loot sucks. I already collected all of the maps legitly, so the treasure chests are there if you want them. But IMO you are not missing out on much.\r<br />\r<br />-On a similar note, none of the paragon treasures have been found because I don&#39;t care about them. You can spawn your own Ebony bow of frost or something on your own time, ok? However, all paragons have been collected.\r<br />\r<br />-Want an Imperial-sided save file? TOO BAD&#33; Screw the Thalmor, screw the Empire&#33; TROO SUNS AND DAWTURS OF SKIREEM&#33;&#33;&#33;&#33;&#33;&#33;&#33; Want to side with the Nords instead of the Rieklings? Too bad&#33; Wanted to destroy the Dark Brotherhood? Too bad&#33;\r<br />\r<br />-One misc quest at Markarth where you are supposed to rat out a Talos worshipper to the stationed Thalmor was never completed. However, Thalmor sux, the character is a Stormcloak so it&#39;s out of character, the reward sux, and I forgot to do it before Markarth got taken over, so yeah. It&#39;s just one quest out of hundreds, you&#39;ll be fine lol.\r<br />\r<br />-If you want all the map markers discovered and cleared, you won&#39;t get that here. I did it for most of the Skyrim dungeons, but not for Dragonborn. You can just use TMM 1.\r<br />\r<br />[color=#ff0000][size=4]Misc:[/size][/color]\r<br />I am open to suggestions but please bear in mind that the save was created for ME primarily. There is no way I am going to make a completed Imperial save for you at this time. You can ask for one, I&#39;ll just probably say no.\r<br />\r<br /> Did you discover that I missed a quest or item? Please notify me&#33;\r<br />\r<br />[color=#ff0000][size=4]Usage Rights:[/size][/color]\r<br />This is my typical set of terms. You are allowed to modify it or post it anywhere you like but I ask that you credit my name if you choose to upload it somewhere else and the like.\r<br />\r<br />[color=#ff0000][size=4]Credits:[/size][/color]\r<br />kefka95 for SkyComplete\r<br />heatedsun for the inspiration to create a complete vanilla save file (can&#39;t believe I never thought of doing that...)\r<br />\r<br />\r<br />\r<br />[b][color=#ff0000][size=4]You Might Also Like:[/size][/color][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/64610/?]Encounter Zone Levels Set to 150\r<br />[/url][url=http://www.nexusmods.com/newvegas/mods/61211/?]Completionist Save File with YUP Fixes (New Vegas)[/url]",
  "categoryId": "43",
  "version": "1.10",
  "author": "Dark_wizzie",
  "createdUnix": "1426899899",
  "updatedUnix": "1459070690",
  "containsAdultContent": false,
  "uploadedBy": "dark_wizzie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000152381",
      "name": "Celapaleis",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8356",
      "fileName": "Celapaleis-63950-1-0-1.7z",
      "uploadedUnix": "1426903279",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/c397ee25c17c2528084b844cf29d1bce7b76ee463c626e1d1d2ccf0580ccc9e2/analysis/1426903332/",
      "changelogHtml": " Hired followers have been paid so they are now free. All 5 paragons are added to the inventory. Player inventory cleaned slightly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-0-1.7z?fid=1000152381&ttl=1535852634&ri=8192&rs=8192&setec=d5c399a5fbab59cb9e12ec091f7004fe"
    },
    {
      "fileId": "1000152939",
      "name": "Celapaleis",
      "version": "1.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8353",
      "fileName": "Celapaleis-63950-1-0-2.7z",
      "uploadedUnix": "1427272408",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/73189525ccdd6b850f3841cc52cde6afb44d8f273f0d3497a8075303e9b6db53/analysis/1427272447/",
      "changelogHtml": " Added Slow Time shout and Chaos Damage enchantment which I forgot to add. Cleaned player inventory slightly again. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-0-2.7z?fid=1000152939&ttl=1535852635&ri=8192&rs=8192&setec=e36dac20c3760a8e8d70c3c1c57c8161"
    },
    {
      "fileId": "1000153015",
      "name": "Celapaleis",
      "version": "1.0.21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9070",
      "fileName": "Celapaleis-63950-1-0-21.7z",
      "uploadedUnix": "1427337902",
      "modVersion": "1.0.21",
      "virusScanUrl": "https://www.virustotal.com/file/37d56d77d4e5803bf680f3fd37b28c346ea555dc6cccbd88585b374691fe5a77/analysis/1427337967/",
      "changelogHtml": " Small improvements in Havoc reset-ing. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-0-21.7z?fid=1000153015&ttl=1535852636&ri=8192&rs=8192&setec=7401c5f75cd20288ae13c8eafd727b60"
    },
    {
      "fileId": "1000187511",
      "name": "Celapaleis",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10265",
      "fileName": "Celapaleis-63950-1-03.7z",
      "uploadedUnix": "1449829826",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/33d23f00dfdc935613bea430f1674e9770a51de523a76c147fa18f9f80581ce6/analysis/1449829873/",
      "changelogHtml": " Script Cleaned version of the save file has been modified to expect USLEEP instead of USKP, etc. <br/> \n Readded the save file before Civil War quests. Seems like that last version left it out on accident. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-03.7z?fid=1000187511&ttl=1535852636&ri=8192&rs=8192&setec=37466c7c93cbefae59a8101e17efe96c"
    },
    {
      "fileId": "1000194108",
      "name": "Celapaleis",
      "version": "1.04",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7540",
      "fileName": "Celapaleis-63950-1-04.7z",
      "uploadedUnix": "1454556129",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/6423cd313aba1587ba6821a52b79ce32743952e054ab29ebf50926d1f73d13d0/analysis/1454779674/",
      "changelogHtml": " Added min-maxed armors and potions for smithing/enchanting. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-04.7z?fid=1000194108&ttl=1535852637&ri=8192&rs=8192&setec=d522b85dd7c6446d1cf2841e41fa4682"
    },
    {
      "fileId": "1000196921",
      "name": "Celapaleis",
      "version": "1.05",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7477",
      "fileName": "Celapaleis-63950-1-05.7z",
      "uploadedUnix": "1456287878",
      "modVersion": "1.05",
      "virusScanUrl": "https://www.virustotal.com/file/100891d7ecfb682802491aaaa80883c18e94a6311a49d0d43f911d51fe761ea4/analysis/1456287907/",
      "changelogHtml": " Fixed Apocrypha visual effect showing when player jumps into water. This was result of entering Apocryphia via Black Book but CoCing out of there. This was only a visual and auditory effect.\r<br />\r<br />Serana is currently the follower, to prevent player confusion. (She goes to Darkfall Cave instead of Dawnguard like she says when she leaves.) \r<br />\r<br />Ate Wisp Wrappings. Somehow it was left out and its alchemical properties weren&#39;t known. \r<br />\r<br />Fixed min-max armor; Mage armor didn&#39;t give 100% Destruction cost decrease. Min-max armors have been drastically improved. I&#39;ve planned out everything. Description page will be updated to explain. \r<br />\r<br />All vampire lord perks added. \r<br />\r<br />Grimsever quest finished. It was glitched but now for fixed. \r<br />\r<br />The fishery from Hearthfire has been fully populated. \r<br />\r<br />Greenhouse and farm areas of all Hearthfire locations have been populated. \r<br />\r<br />Stewards hired for all 3 Hearthfire houses. Stewards are the Housecarls for their related hold. Steward upgrades all done. \r<br />\r<br />Player location and items moved to Lakeview Manor. \r<br />\r<br />All stone powers from Dragonborn are added. \r<br />\r<br />ww*insert shout name here* variables all set to 3. (Exceptions: DLC shouts.) \r<br />\r<br />Some min-maxed potions added. \r<br />\r<br />Known Glitch: Word Wall near Shrine of Meridia doesn&#39;t contain a word but acts like it does. \r<br />Known Glitch: Deer antlers in the kitchen of Hearthfire homes will sometimes fall onto the ground. This is a game bug and may fix itself if the player lets the house reset by stay outside of it for long enough. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-05.7z?fid=1000196921&ttl=1535852638&ri=8192&rs=8192&setec=1ee9ce8952b77a2e1b20feb73f8374a5"
    },
    {
      "fileId": "1000197230",
      "name": "Celapaleis",
      "version": "1.06",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7567",
      "fileName": "Celapaleis-63950-1-06.7z",
      "uploadedUnix": "1456461637",
      "modVersion": "1.06",
      "virusScanUrl": "https://www.virustotal.com/file/0f5fba752814422f84ffb73f4a101cbfccf552e824acb8a4b971cf1a98bc2f97/analysis/1456461669/",
      "changelogHtml": " Civil war damage has been reverted in Whiterun and Solitude via console commands. <br/> \n Tons of items have been added to Lakeview Manor. All the ingredients, ingots, etc, you&#39;ll ever need. Check description. <br/> \n Lakeview Manor is now fully decorated, with shields and swords on the plaques. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-06.7z?fid=1000197230&ttl=1535852638&ri=8192&rs=8192&setec=51315fe68220ab438309755ec3f9cd61"
    },
    {
      "fileId": "1000198378",
      "name": "Celapaleis",
      "version": "1.07",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7726",
      "fileName": "Celapaleis-63950-1-07.7z",
      "uploadedUnix": "1457245547",
      "modVersion": "1.07",
      "virusScanUrl": "https://www.virustotal.com/file/04383a022e1914617a3c73f3803f9e6d99eddcde4ab067e793f60705e60f5c77/analysis/1457245385/",
      "changelogHtml": " Serana was set as isghost 1 for some reason. Reverted. Now she can be damaged in combat. <br/> \n Killed all Imperials in the Imperial camps post-civil-war. <br/> \n Follower armor has been min-maxed. <br/> \n Discovered all map markers legitly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis-63950-1-07.7z?fid=1000198378&ttl=1535852638&ri=8192&rs=8192&setec=0cbae708facf90dbc6da0d124230024e"
    },
    {
      "fileId": "1000198566",
      "name": "Celapaleis v1.08",
      "version": "1.08",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7701",
      "fileName": "Celapaleis v1.08-63950-1-08.7z",
      "uploadedUnix": "1457344011",
      "modVersion": "1.08",
      "virusScanUrl": "https://www.virustotal.com/file/ea0a8a6f978fad550f8f7184f9c7d7e2a7f8fdf14b798468887be050c6e6adbf/analysis/1457344146/",
      "changelogHtml": " Placed Miraak outfit in inventory, since it is part of Min-Max outfit now (with 100% spell absorption, player is immune to everything but arrow and melee damage). <br/> \n Picked Atronach Stone standing stone. <br/> \n Removed passive 50% frost resistance a Nord has, added Berserker Power which Orcs have. Default racial abilities can&#39;t be removed even with console commands, so yeah. <br/> \n Decorated a mannequin I forgot existed in Lakeview Manor. <br/> \n Found and recruited Meeko. Woof&#33; <br/> \n Markfordelete&#39;d a giant dragon corpse in Riften. It&#39;s gone now. <br/> \n Unlocked various player owned house doors. <br/> \n Decorated every single mannequin and display plaque for every house. <br/> \n Finished Carlotta&#39;s quest. <br/> \n Player height adjusted to Orc&#39;s default height. <br/> \n Invested in Glover Mallory, Lod, Zaria, Ghroza, Moth gro-Bagol, and Filnjar&#39;s stores. <br/> \n Told Lod the dog is more trouble than its worth. <br/> \n Finished Berit&#39;s Ashes miniquest. <br/> \n Finished Runil&#39;s miniquest. <br/> \n Cleaned inventory slightly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis%20v1.08-63950-1-08.7z?fid=1000198566&ttl=1535852639&ri=8192&rs=8192&setec=59657c09d6008479a31271dd110dc8d3"
    },
    {
      "fileId": "1000199373",
      "name": "Celapaleis v1.09",
      "version": "1.09",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7795",
      "fileName": "Celapaleis v1.09-63950-1-09.7z",
      "uploadedUnix": "1458031106",
      "modVersion": "1.09",
      "virusScanUrl": "https://www.virustotal.com/file/4b57dc4acad88a1a51ec5b11f784587c3b2cdfe9bb85f3b835b3b768ac0faa5f/analysis/1458031145/",
      "changelogHtml": " Min-maxing improved once again. Weapons now use Chaos Damage. Testing has shown it to be higher DPS. Some other weapon tweaks. <br/> \n Re-learned Chaos enchantment. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis%20v1.09-63950-1-09.7z?fid=1000199373&ttl=1535852639&ri=8192&rs=8192&setec=8119a5aca73b301ff7dc86d7db97aade"
    },
    {
      "fileId": "1000200738",
      "name": "Celapaleis v1.10",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7797",
      "fileName": "Celapaleis v1.09-63950-1-10.7z",
      "uploadedUnix": "1459070690",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/dd44ac20c25af9b1be0e3819249d9bccb329252514dc5878e1764cac6258d315/analysis/1459070716/",
      "changelogHtml": " Fixed MG07Vision script spam. Somehow this vanilla script got stuck in a loop, firing many times a second. This has been fixed via save game cleaner by removing the script. The quest was long done anyways. This script removal was not done in previous script cleaned versions either since it wasn&#39;t orphaned. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Celapaleis%20v1.09-63950-1-10.7z?fid=1000200738&ttl=1535852640&ri=8192&rs=8192&setec=fd7033b392a59158d5d10f01aa513b6a"
    }
  ]
}