{
  "modId": 64038.0,
  "modName": "Orc Hearthfires",
  "summary": "Build your own Stronghold the same way Hearthfires homes are made - once you&#39;ve earned the right.",
  "descriptionHtml": "Provides Orcs with the same ability to build their own home that the other races get from the Hearthfires DLC. You build your own stronghold, at a central site on the plains. However, there is no restriction on who can build it. It&#39;s not [i]only[/i] for Orcs, or males, for that matter.\r<br />\r<br />The player must complete the quest &#34;The Cursed Tribe&#34; at Largashbur, and make friends of five Orcs to qualify for the site, much like the &#34;help my people&#34; quests for the Jarls that get you Thaned. This time however, your reward is the right to build an Orc Stronghold of your own near Greenspring Hollow.\r<br />\r<br />Since this leverages the existing quests, and the announcement of your land ownership comes by courier, it needs no new dialog (or voice acting).\r<br />\r<br />You create a small hut, which will just contain bedrolls to start with, but a proper bed and Alchemy/Enchanting tables can be added later for a Wise Woman to use. The Longhouse proper will be built close by, and contain a double bed and two child beds on the ground floor, and a further double and a single bed in the basement. The child beds, chests and other amenities qualify it as a home for the [url=http://www.nexusmods.com/skyrim/mods/29249]Hearthfire Multiple Adoptions[/url] mod.  \r<br />\r<br />The blacksmith facilities: forge, armorer workbench, tanning rack and grindstone must be built outside, as must the smelter. The back half of the basement is instead fitted with extra shelves for storage, and closed off by doors. The usual shrine base and coffin are not available, and the extra beds take their place. The other basement items, like safes, weapon racks and plaques, and of course the mead barrels, are retained.\r<br />\r<br />Furniture is &#34;noble&#34; standard, like the DLC homes, rather than Orcish-style, as an adventurer has presumably learned higher tastes in his or her travels.\r<br />\r<br />The most significant difference from a traditional Orc Stronghold is that there is no &#34;Chief&#34;, who would be a male Orc, and so no chief&#39;s wives and mother holding WiseWoman, Smith, or other jobs. The player character building this can be a female Khajiit. But because this is not a Nord home, there is no steward, so no bard or carriage driver either. That also means no cow or chickens, but a goat will appear if you build the garden. The slope of the land precludes providing a plantable garden, so this just has leeks and cabbages (for the goat?)\r<br />\r<br />Much more detail (in UESP wiki style) at [url=http://ghastley.org/Skyrim/Docs/OrcHearthfires.html]its home page.[/url] The same content is included in the download, see the Docs folder.\r<br />\r<br />There is now an optional file that provides an Orc child to adopt. This is independent of the main mod, but obviously intended to be used with it. \r<br />\r<br />It is my hope to add optional esp&#39;s in future to provide:\r<br />[list]\r<br />[*] A recruitable Wise Woman (with a quest of her own)\r<br />[*] Hunters who will join as guards\r<br />[/list]Q: Do I have to play as an Orc for this?\r<br />A: No, you just need to be Blood-kin, to get entry to the other Strongholds.\r<br />\r<br />Q: What if I already did the quest &#34;The Cursed Tribe&#34; before installing the mod?\r<br />A: Just go back to Largashbur, and leave again. You don&#39;t need to have taken Volendrung, either. If the quest is complete in your journal when you leave Largashbur, that&#39;s enough.\r<br />\r<br />Q: How do I &#34;Make friends and influence Orcs&#34;?\r<br />A: Mining ore for them - and this includes at Shor&#39;s Stone - or brawling with the chief, or doing the quests for the smith siblings in Markarth. Plenty of options. Even in an existing game, there should be enough you haven&#39;t done.\r<br />\r<br />Q: Can I bring my spouse here, or adopt a child?\r<br />A: The Stronghold has been tested with Hearthfires Multiple Adoptions and can be blessed as a home. Moving your spouse and child here is then possible. You can adopt little Uzgash, or bring any other adoptable child to the Stronghold. I have reports that [url=http://www.nexusmods.com/skyrim/mods/18045]My Home is Your Home[/url] will let followers take up residence, too.\r<br />\r<br />Translations:\r<br />[url=http://www.nexusmods.com/skyrim/mods/65003]Portuguese (Brazil)[/url]",
  "categoryId": "35",
  "version": "1.0",
  "author": "ghastley",
  "createdUnix": "1427155578",
  "updatedUnix": "1436572442",
  "containsAdultContent": false,
  "uploadedBy": "ghastley",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000152794",
      "name": "Version_10",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2576",
      "fileName": "Version_10-64038-1-0.7z",
      "uploadedUnix": "1427153747",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9f7a0cb5ec26cd8c93c16a51f574f6b8755a4f530c54d4ac56a621323e662aa2/analysis/1427153764/",
      "changelogHtml": " Release version <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version_10-64038-1-0.7z?fid=1000152794&ttl=1535852741&ri=8192&rs=8192&setec=63ed32f809eae43b42d2ccb90ceaa194"
    },
    {
      "fileId": "1000167394",
      "name": "OrcChild10",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2118",
      "fileName": "OrcChild10-64038-1-0.7z",
      "uploadedUnix": "1436572442",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fe26a2fc7b28ebb91020f34ada3db25a726fc7c735c1a096e91870c1700f732e/analysis/1436572503/",
      "changelogHtml": " Release version <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OrcChild10-64038-1-0.7z?fid=1000167394&ttl=1535852741&ri=8192&rs=8192&setec=646623cad551ae653ca633e7d8e6fa64"
    }
  ]
}