{
  "modId": 64213.0,
  "modName": "Vampire home_Tomb of Pelagius Septim",
  "summary": "Adds a larger graveyard district to Solitude with the Tomb of the mad Emperor as secret home for all your character&#39;s dark needs.... A lot of costum storage included.",
  "descriptionHtml": "[b][i][font=Arial][u][size=5][color=#00ff00]Check out my other House mod; Colored Rooms [/color]\r<br />http://www.nexusmods.com/skyrim/mods/66931/\r<br />\r<br />\r<br />\r<br />UPDATE 1.2 RELEASED, ADDED TELEPORT MARKER, FIXED BUGS AND YOU SHOULDN&#39;T GET STUCK WHEN LEAVING THE HOUSE&#33; [/size][size=2]Sorry for that :) Such a small simple mistake..[/size][/u][/font]\r<br />\r<br />[size=5]&gt;&gt;CTD FIX: DOWNLOAD GENERAL DISPLAYS AT http://www.nexusmods.com/skyrim/mods/32550/? AND YOU SHOULD HAVE NO PROBLEMS RUNNING THIS MOD, SORRY FOR THE INCONVENIENCE.&lt;&lt;[/size][/i][/b]\r<br />\r<br />\r<br />\r<br />\r<br />[b]THE PICTURES ARE VERY BRIGHT, THIS IS INTENDED, THE HOUSE HAS A NATURAL DARK LOOK INGAME&#33;&#33;[/b]\r<br />\r<br />\r<br />Tomb of Pelagius Septim\r<br />\r<br />Adds a new crypt to the Solitude graveyard with a secret passage that holds a playerhome for vampire players. \r<br />I created this home because I like to mod and I couldn&#39;t find any nice vampire home to my liking. \r<br />\r<br />The tomb belongs to the Pelagius Dynasty but is haunted for years, nobody knows that in secret there is an entire construction of hallways, rooms and even a personal mortuary created for Emperor Pelagius 3. It is the perfect dark hideout to store all Skyrim&#39;s if not Tamriel&#39;s rarest treasure&#39;s safely. Not even the vampire court of Volkihar has any knowledge of the whereabouts of this forgotten crypt.\r<br />\r<br />The house contains:\r<br />1: A small living room\r<br />2: A crafting area for enchanting, smithing, alchemy and spiderscroll crafting\r<br />3: A bedroom\r<br />4: A small garden inside and a garden outside with planter soils\r<br />5: A secret door in the living room that leads to the treasury room\r<br />6: A living prisoner and 2 vampire slaves to soak blood from\r<br />7: A lot of costum storage\r<br />8: Obiously normal storage aswell.\r<br />9: A few weapon and shield displays\r<br />10: NO MANNEQUINS, I can&#39;t stand it that they have a chance to move, so no. \r<br />\r<br />\r<br />The following items have their own storage displays\r<br />1: All thieves guild treasure&#39;s. ( The wooden boat can be placed above the bookcase at the office)\r<br />2: All dragonmasks and DragonbornDLC masks.\r<br />3: All daedric artifacts except the two armor tokens.\r<br />4: All claws and the DragonbornDLC claw ( which can be placed in the treasure room above the door)\r<br />5: The initiate&#39;s ewer ( I love it&#33;, can be placed at the goldpile in the treasure room)\r<br />6: Haelga&#39;s Dibella Statue ( can also be placed at the goldpile in the treasure room)\r<br />7: The two candlesticks that belong to the mold ( Place at the goldpile in the treasure room)\r<br />8: Pelagius&#39;s Hipbone ( place in his personal coffin)\r<br />9: The 5 paragons from Dawnguard\r<br />10: The three Elderscrolls\r<br />11: Auriel&#39;s bow \r<br />12: Auriel&#39;s shield ( just on the shield plaque, no costum for now due to the enchanting glow vanishing)\r<br />13: The 4 falmer books frol Dawnguard DLC ( English translation, can be placed in the hallway)\r<br />14: Kolbjorn&#39;s Skull from Dragonborn DLC (can be placed in the bedroom at the dresser area)\r<br />15: The two skull keys ( can be placed in the hallway)\r<br />16: All 7 blackbooks from Dragonborn DLC ( Can be placed inside the bookcase at the enchanter table)\r<br />17: Dreamstride + Boethia&#39;s calling + Opium Infinium books, ( Also can be found near the enchanter area)\r<br />18: All 4 Mythic Dawn Commentaries ( Can also be stored near the enchanter area)\r<br />19: All critters in a jar ( can be placed near the alchemy station)\r<br />20: The white Phial ( On a small table near the spider crafting station) \r<br />\r<br />The house is navmeshed but there are no extra beds for followers, nor do I feel like I want to create such in the near future.\r<br />\r<br />[b][u]\r<br />I stand open for idea&#39;s but I find this house finished. I don&#39;t want the space to get laggy, it is pretty on the limit at this moment.\r<br />\r<br />[/u][/b][b]And yes, I will add similiar storage displays to my Archmagequarter mod, so we can all get rid of the buggy treasure safe&#33; :) [/b]\r<br />\r<br />\r<br />[b]SPECIAL THANKS TO [url=http://www.nexusmods.com/skyrim/users/3231858]Elianora[/url] FOR HELPING ME REGARDING CUSTOM DISPLAY, I SUGGEST YOU CHECK HER AWESOME MODS&#33;&#33;&#33;&#33;&#33;\r<br />SPECIAL THANKS TO [url=http://www.nexusmods.com/skyrim/users/17279409]MrDanSG1[/url] FOR HIS AWESOME COSTUM DISPLAY SCRIPTS.\r<br />\r<br />\r<br />I WOULD LIKE TO THANK THE FOLLOWING PEOPLE FOR CREATING AWESOME SCRIPTS AND MESHES THAT HELPED ME TO CREATE MY MOD[/b]\r<br />\r<br />Bethesda\r<br />[url=http://www.nexusmods.com/skyrim/users/285029]Ithlia\r<br />[/url]AARS Resource mods\r<br />[url=http://www.nexusmods.com/skyrim/users/1981866]Grantyboy050[/url]\r<br />Oaristys\r<br />Tony67\r<br />Runspect\r<br />Blary\r<br />stoverjm\r<br />Darkfox127\r<br />Insanity\r<br />LilaMue\r<br />Stroti\r<br />Flintstone\r<br />Lilith\r<br />Tesa\r<br />\r<br />Did I forget to mention you? Then I am really sorry, My mesh and resourcefolders are a mess :( , Let me know so I can add you asap&#33;\r<br />\r<br />Happy Creeping Vampires.",
  "categoryId": "67",
  "version": "1.0",
  "author": "MrKoekie",
  "createdUnix": "1427638353",
  "updatedUnix": "1427736392",
  "containsAdultContent": false,
  "uploadedBy": "Mrkoekie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000153636",
      "name": "Vampire1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "43221",
      "fileName": "Vampire1.2-64213-1-2.rar",
      "uploadedUnix": "1427736392",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6bf460673bfb0e698bc24ce7008f82d731da164da60d5ecf2465cfb90ec3a89c/analysis/1427736428/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampire1.2-64213-1-2.rar?fid=1000153636&ttl=1535852888&ri=8192&rs=8192&setec=1a64e2a8734bf3f4248e082f0972db02"
    }
  ]
}