{
  "modId": 64211.0,
  "modName": "Valiant Volkihar WIP",
  "summary": "Ever thought it was a waste that once you finish Dawnguard after siding with the vampire hunters that there was a huge castle going to waste? This mod changes that&#33;",
  "descriptionHtml": "*I AM CURRENTLY LOOKING FOR HELP FROM SOMEONE WITH BETTER SCRIPTING ABILITIES THAN MYSELF TO ADD IN NPCS (SUCH AS GUARDS, MAGE, SMITH ETC) AND HELP FINISH THIS MOD. I ALSO APOLOGISE FOR MY SLOW SPEED IN UPDATING THIS MOD AS I AM CURRENTLY WINDING DOWN MY STUDIES FOR MY PRACTICAL PHASE AT SEA (WHERE I WILL BE UNABLE TO WORK ON MODS DUE TO WORKLOAD AND A LACK OF INTERNET CONNECTION).*\r<br />\r<br /> This is my first mod and overhauls the Volkihar castle to being a worthy home for the Dragonborn&#33; \r<br />\r<br />In its current state you should only install this AFTER COMPLETING DAWNGUARD. Because reasons.\r<br />\r<br />Fleshes out and redecorates the interior of the Volkihar Castle, and turns the cathedral into a vault for all your display and storage needs&#33; Adds various displays and mannequins throughout the castle and Npcs such as maids and a bard. Plenty of room for followers and fully navmeshed. Requires Dawnguard, Hearthfires and Dragonborn.\r<br />\r<br />As it stands currently this mod consists of:\r<br />\r<br />-Renovated and re-imagined Great Hall\r<br />-Renovated Smithy with smelter, forge, leatherworking stand, workbench and grinding wheel\r<br />-Renovated and re-imagined Wizarding Quarter with alchemy, enchanting and staff enchanting stations\r<br />-Cleaned and redesigned kitchens with two maids\r<br />-Cleaned and chilled Castles Stores\r<br />-Tranquil Private Quaters, complete with its own interior garden, Lab and four poster bed\r<br />-Follower/guard quarters with 6 beds\r<br />-a new secret area/bolt hole with displays and a mannequin (check the wardrobes&#33;)\r<br />-A re-imagined cathedral, now as a museum/vault with extensive displays and mannequins\r<br />\r<br />there are currently 24 mannequins and many more weapon displays throughout.\r<br />\r<br />In the future I hope to add a castle blacksmith, court wizard and guards, aswell as makin the changes only occur when Harkon is defeated.",
  "categoryId": "67",
  "version": "",
  "author": "Eldaryn",
  "createdUnix": "1427635627",
  "updatedUnix": "1427635496",
  "containsAdultContent": false,
  "uploadedBy": "Eldaryn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000153476",
      "name": "Valiant Volkihar",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "351",
      "fileName": "Valiant Volkihar-64211-.zip",
      "uploadedUnix": "1427635496",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/94f312a7d4e31ce4875ed55e12a8b59761b972b0b3afa2f6b0ff7c725ca7cced/analysis/1427635563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valiant%20Volkihar-64211-.zip?fid=1000153476&ttl=1535852886&ri=8192&rs=8192&setec=c4851fd90be7dabea0fb90232bf0880f"
    }
  ]
}