{
  "modId": 64218.0,
  "modName": "NO JUMP LANDING SOUNDS",
  "summary": "Simple audio replacement file to stop the annoying continual &#39;landing&#39; sounds when NPC&#39;s or enemies are stuck.",
  "descriptionHtml": "Objective-----------Stop the annoying jump landing sound that you often get for any followers or npc&#39;s and enemies that are temporarily stuck in the game trying to traverse some obstacle and reach you.  Always hated that sound and really breaks the immersion when the offending npc or enemy is nowhere to be found but the annoying jump/land sounds continually plays because they are stuck somewhere.Maybe it doesn&#39;t annoy you or you haven&#39;t noticed - in which case just don&#39;t use this mod (sound replacement files)Absolutely no bugs or conflicts possible with this mod as it is a simple sound replacement arrangement and so easy to install or remove.Yes you lose the &#39;landing&#39; sound but i really don&#39;t notice this and i much prefer to terminate the glitchy repeating sound you sometimes get when characters are trying to join or attack you but are stuck.Been using it in my game for weeks now and i love it and thought i would share it with you all as it really helps with immersion.Hope you like it and look forward to any feedback.Please leave an endorsement if you get a chance and you like it.This is my second mod for the excellent Skyrim - woohoo - i&#39;m motoring now - LOL.All the best - PEACE,Mark.Tech----Removed all the sounds from the game of &#39;landing&#39; - like from a jump or from falling etc by replacing all the associated files with a 86.2 KB 1 second blank audio file.",
  "categoryId": "61",
  "version": "1.0",
  "author": "Mark Hambly",
  "createdUnix": "1427651220",
  "updatedUnix": "1427651005",
  "containsAdultContent": false,
  "uploadedBy": "sniggles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000153505",
      "name": "NO JUMP LANDING SOUNDS",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "NO JUMP LANDING SOUNDS-64218-1-0.7z",
      "uploadedUnix": "1427651005",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/02a6a2d7000df69e8abaa65539ede58f5b6c3dad7cf6806cbdc7869ef37651c1/analysis/1427651044/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NO%20JUMP%20LANDING%20SOUNDS-64218-1-0.7z?fid=1000153505&ttl=1535852895&ri=8192&rs=8192&setec=3baff847b88d033e2bb706ca52903097"
    }
  ]
}