{
  "modId": 64254.0,
  "modName": "LadyDB",
  "summary": "A 3 cell player house in the dwemer style. This is a vanilla skyrim mod. includes dwemer farmhouse, with small sitting garden, a display room, temple, crafting area, stables and a jacuzzi.\r<br />What does a female Dragonborn do when your queen of the thieves guild, the Night Mother&#39;s favorite speaker, Arch-Mage of Winterhold, Member of Companio",
  "descriptionHtml": "This is a 3 cell player house in dwemerand with a little Whiterun and Jorvaskr style. On the ground level,\r<br />you have two stables for Shadowmere. The tower has a balcony. Inside\r<br />is the first floor / house with a small sitting garden. The east\r<br />hallway leads to the display cell. the hallway to the west takes you\r<br />to the lift down to the crafting zone. \r<br />the house cell has 11 clothes/book/safechests, 1 jewelry box. all norespawns.\r<br />The display cell has 52 mannequins, 88weapon racks, 13 weapon shield plaques, 8 dagger displays, 20 weapon\r<br />display cases. A small temple with 9 shrines and one spare room,\r<br />Which i call the junk room. A bad habit i picked up from the\r<br />Rieklings on the island of Solstheim.\r<br />The crafting zone has 10 Armour chest,9 hold chest, 1 artifact chest, 15 player chest, 16 dwe chest, 18\r<br />food barrels, 7 soul gem chest, 1 potions, 1 staves, 1 recipes, 1\r<br />jewelry, 1 enchanted jewelry, 1 scrolls, 3 mines for each ore. 1\r<br />spell tomes, 1 enchanted weapon/Armour, 1 gem stones chest. and 1\r<br />merchant/blacksmith. she does move around in the cell, you may have\r<br />to look for her. i have seen her in the jacuzzi.\r<br />This place is on the world map and cantravel to it any time, it&#39;s in the Falkreath hold, southeast of\r<br />Helgen, southwest of Southfringe Sanctum. \r<br />\r<br />Things i have notice, when entering thetower open the wall chest so the items on shelf can settle and do the\r<br />same in the bedroom. when entering the display cell, wait till after\r<br />the auto save is done before moving around. all weapon racks work,\r<br />mannequins do move a little but only on their rugs, they float up\r<br />sometimes or disappear/to fix take a item off of them and put it back\r<br />on. but none of the stuff I’ve put on them has disappear or is\r<br />gone. the Skull of Corruption and Volendrung won&#39;t stay in the weapon\r<br />racks, but volendrung will stay in the weapon shield plaque by itself\r<br />with shield. i just lean skull of corruption up against the racks. No\r<br />problems with follower following you around from cell to cell.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Blutregen",
  "createdUnix": "1427768725",
  "updatedUnix": "1427768704",
  "containsAdultContent": false,
  "uploadedBy": "blutregen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000153674",
      "name": "LadyDB",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "139",
      "fileName": "LadyDB-64254-1-0.zip",
      "uploadedUnix": "1427768704",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b325e590d2bda015ad958de94c80101fb6f75a75a82adb8d673095b2e91bc1c9/analysis/1427768763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LadyDB-64254-1-0.zip?fid=1000153674&ttl=1535852929&ri=8192&rs=8192&setec=b030ec35ab4b20361314c1cbd320b501"
    }
  ]
}