{
  "modId": 64351.0,
  "modName": "Skyrim Random Charactor and Face Generator -WIP-NonOperational-",
  "summary": "NonOperational&#33;&#33;&#33;",
  "descriptionHtml": "There are a few random character generators online that will generate names or bios. However if you need all the performance you can get you don&#39;t want to have a browser open when you are playing skyrim. This is where my new idea for a program comes in.\r<br />This program will be a lightweight visual basic program that will run a C++ program on the backend to generate a random character, much like this one: [url=http://hrpg.ca/test/gen.php]http://hrpg.ca/test/gen.php[/url]. But it will be more role playering. It won&#39;t tell you who your spouse is or kids are but focus more on the character traits and motives. But thats not all. It will also give you a random name based on your race like this[url=http://www.tamriel-rebuilt.org/?q=namegenerator]http://www.tamriel-rebuilt.org/?q=namegenerator[/url]. And I want to take this even one step further. Using the .jslot format for Race menu I want this program to also generate a random face based on other values, like race, character traits (Friendly, Anger issues, motives) and basicly have the program completely generate a character for you at the press of a button. Then all you have to do is start a new game and load up the preset it generated in race menu and you are off to go role playing your brand new char without having to put a ton of effort into coming up with another boring reflection of yourself. And you can leave this program running in the background because the c++ part will only run when its generating the character. And the rest of the time the window will just be a formated sheet of your characters traits and skills.\r<br />There will also be a built in launcher to launch SKSE w/ or w/o Mod Organizer, but also load a nVidia inspector OC profile and Game Boaster game mode from IO Bit.\r<br />Thoughts? Other ideas to add? Keep in mind I have only done work with the launcher interface so far but I am familiar enough with visual basic and C++ that I am fairly comfortable making the program I am thinking of.",
  "categoryId": "39",
  "version": "0.0000001",
  "author": "wSedlacek",
  "createdUnix": "1428009179",
  "updatedUnix": "1428009179",
  "containsAdultContent": false,
  "uploadedBy": "cool098",
  "primaryFile": null,
  "files": []
}