{
  "modId": 64418.0,
  "modName": "Drizzt - Adventure Series",
  "summary": "Play as drizzt and his magical items through skyrim&#33;",
  "descriptionHtml": "                  [color=#3d85c6][size=6]:: Adventure Series - Drizz&#39;t Do&#39;urden ::[/size][/color]\r<br />Drizzt is the first in line of my Adventure Series, I am unsure who i am going to do next so if you have a suggest leave it in the comments&#33; Drizz&#39;t is added in his glory to skyrim&#33; This mod does the best it can to bring you as close to a real Drizzt character as possible. Below is what the mod currently includes and JUST below that will be a section of what I hope to add&#33;\r<br />\r<br />[color=#00ff00]Note:[/color] The Esp is named after the bow, I will eventually change it when I update this mod soon :)\r<br />\r<br />[youtube]FtaHvv6fVdc[/youtube]\r<br />\r<br />[color=#3d85c6][size=4]:: Installation and in game attainment ::[/size][/color]\r<br />Install through the Manager, and you can find the adventure series book on farengar the mage in the whiterun keep for sale. Open reading it you will recieve all the items and perks for Drizz&#39;t. The Preset for racemenu so you can look like drizz&#39;t has a read me in the file and you download that seperately.\r<br />\r<br />[color=#3d85c6][size=4]:: Features ::[/size][/color]\r<br />[color=#00ff00]Note:[/color] Sword textures really are not overly great, if someone is able to improve them please let me know&#33;\r<br />\r<br />[color=#00ff00]Sword Enchants:[/color] To customize your sword enchants to your taste use  http://www.nexusmods.com/skyrim/mods/searchresults/?\r<br />[color=#00ff00]\r<br />Icingdeath:[/color] The sword is based on Ebony Swords damage, gives 50% fire resist when worn, deals 20 frost damage, and a additional 30 frost damage to daedra.\r<br />\r<br />[color=#00ff00]Twinkle:[/color] Gives you 5% damage reduction to simulate it&#39;s parrying enchantment.\r<br />\r<br />[color=#00ff00]Heart Seeker:[/color] When Equip it will automatically bring forth its arrows, you will never run out. The arrows like in the book burst into light and do fire damage when striking something.\r<br />\r<br />[color=#00ff00]Guen:[/color] What is drizzt with out his faithful side kick, but to be honest I borrowed this system from another author who just did a EXTREMELY amazing job. I was blown away. Check out his page for details on how Guen works and if you like this part of the mod guys PLEASE PLEASE Endorse this guy he really deserves it. http://www.nexusmods.com/skyrim/mods/11036/?\r<br />(Note: Also the model for this was replaced by Animallica&#39;s Panther http://static-8.nexusmods.com/15/mods/110/images/57413-4-1408810835.jpg) Be sure to stop by and download his animallica pack as it add&#39;s a ton of amazing creatures to teh world :) http://www.nexusmods.com/skyrim/mods/57413/?\r<br />\r<br />[color=#00ff00]Drow Ability:[/color] So right now it only gives drow magic resistance, if I ever find a GREAT way of putting in globe of darkness I will.\r<br />\r<br />[color=#00ff00]Preset for Drizz&#39;t: [/color]You will need better male bodys, and eyes of beauty as well as installing the preset in the racemenu. (this will be a seperate download and have instructions for installing it so be sure to check the files for it if you want it)\r<br />\r<br />[color=#00ff00]To Come:[/color]\r<br />I am trying to get permission to use the Unicorn mount so i can add it in along with the whistle to summon it.\r<br />\r<br />I will be adding his anklets if i can get armor to getting permission to use some armor and if i can manage to texture a good set of armor for him.\r<br />\r<br />His Mask that changes him to a elf I will add here probably pretty shortly :)\r<br />\r<br />[color=#ff0000][size=4]:: Credits ::[/size][/color]\r<br />[color=#00ff00]Icing Death Model:[/color] This is a mesh I updated into skyrim from morrowind. By the author: Thann I had to retexture it but I think it was worth it, if you still play morrowwind be sure to look out for this he also has twinkle.\r<br />\r<br />[color=#00ff00]Guen&#39;s system: [/color]By Volek, honestly I was going to make my own but this system is just amazing I am pretty sure it could not be improved upon if I tried, as I said above if you like the system in this mod please visist his page and endorse he really deserves it. http://www.nexusmods.com/skyrim/mods/11036/?\r<br />\r<br />[color=#00ff00]Guen&#39;s Mesh:[/color] By SliceandKill truly a REALLY amazing mesh one of a ton actually from his mod http://www.nexusmods.com/skyrim/mods/57413/? If you really enjoyed the mesh stop by and endorse his mod and download it there are just a ton of really great animals that are added from it :)\r<br />\r<br />\r<br />\r<br />[color=#ff0000][size=4]:: Requirements ::[/size][/color]\r<br /> I have not been able to get ahold of Ghosu to see if I could get permission to use his Twinkle sword. I could have just converted Thann&#39;s Twinkle but, I do believe that Ghosu should get credit as his has been around for quite sometime so if anyone knows him if they could let him know I am trying to get ahold of him, but until than guys his twinkle mod is a required file, and if you like his sword like above please endorse him :) \r<br />http://www.nexusmods.com/skyrim/mods/9916/?",
  "categoryId": "34",
  "version": "1.0",
  "author": "Haytur",
  "createdUnix": "1428176867",
  "updatedUnix": "1428177030",
  "containsAdultContent": false,
  "uploadedBy": "haytur",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000154270",
      "name": "Adventure Series Drizzt",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6034",
      "fileName": "Adventure Series Drizzt-64418-1-0.rar",
      "uploadedUnix": "1428176839",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3d480f43b3f93c459450f31ef52ee5b4a6391692f74f0bdf72bca24c3ae7058c/analysis/1428176885/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adventure%20Series%20Drizzt-64418-1-0.rar?fid=1000154270&ttl=1535853075&ri=8192&rs=8192&setec=29b1895f59676e1e7a0f15ef852fcc10"
    },
    {
      "fileId": "1000154271",
      "name": "Drizzt Preset",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Drizzt Preset-64418-1-0.rar",
      "uploadedUnix": "1428177030",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6357a6ad55f2c4944c0bfc67e307533279e597312d1f35c2e247039a65b33f5f/analysis/1428177062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Drizzt%20Preset-64418-1-0.rar?fid=1000154271&ttl=1535853075&ri=8192&rs=8192&setec=bbb4fb02a9a09c8ffc4d37c74c947d29"
    }
  ]
}