{
  "modId": 64419.0,
  "modName": "ECE - Shaydow&#39;s Werewolf Overhaul compatibility patch for custom races",
  "summary": "ECE - Shaydow&#39;s Werewolf Overhaul compatibility patch for custom races",
  "descriptionHtml": "This is a very simple patch that fixes a bug with custom races when using ECE (Enhanced Character Edit) with Shaydow&#39;s Werewolf Overhaul. \r<br />The bug being, that if you use ECE, play a custom race and use the overhaul, your face will get really messed up in werewolf form. \r<br />As far as I know, this mod works universally for all custom races, but I have only tested it with my own completely unique, unbelievably sexy private races that will never be released. \r<br />\r<br />This is a private file I made just for myself ages ago and published it here on my other race mod&#39;s page so I&#39;d have a backup. And now I&#39;m transferring it here so it&#39;s easier to remember where I put it. Also [u]you[/u] will now find it more easily in the unlikely case that you will actually need it. I mean really, did you even know of that overhaul before reading this? And if you did, you&#39;re most likely already registered on LoversLab, and would have found identical fix by someone else in the support topic and therefore didn&#39;t really need to waste two minutes of your life reading this crap.\r<br />\r<br />Anyhow since someone new actually might now need this due to having just learned of the overhaul, I&#39;ll explain the technical parts. I personally haven&#39;t used the werewolf overhaul for a while, due to some other LoversLab&#39;s werewolf related mods that shouldn&#39;t be mentioned in a tasteful description such as this, and as such I can&#39;t remember all the fine details of how this mod works. But that&#39;s probably good for you, as no-one likes a snarky smartass talking technical mumbo-jumbo that you probably don&#39;t understand a word of anyway. \r<br />\r<br />So from a technical point of view the overhaul does stuff, ECE does stuff and custom races do stuff. Together stuff gets messed up. And this mod sorts out the mess. How it does it? Well the werewolf race creation kit has one dropdown menu that had something selected when it should have none. Think it was face data or something. Either way it caused the overhaul to load a wrong head. Telling the game to load no head causes the game to load the right head. Logical yes? Oh btw did you know that real head transfer surgery will become reality very soon? Scientists are testing it on volunteers on 2017&#33; Soon you can replace that hideous thing too&#33; But in summary I pressed one button and now all&#39;s well and dandy.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />TLDR: Well good for you, skipping my carefully written description that I made just for you. Do you have any idea how much work went into this text just so you could skip it thinking it&#39;s all meaningless garbage&#33; I put massive effort into making this mod and writing this description and you think it&#39;s garbage?&#33; Maybe you&#39;d like it if I just stopped doing nice things like this altogether huh?? Let&#39;s see how you like modding the game yourself and writing a description that people don&#39;t want to skip&#33;&#33; You&#39;re a jerk&#33; [spoiler][img]https://phoenixajournal.files.wordpress.com/2013/05/sad_anime_girl_crying_2.jpg[/img] [/spoiler]",
  "categoryId": "84",
  "version": "1",
  "author": "Kuunkulta",
  "createdUnix": "1428180523",
  "updatedUnix": "1428180324",
  "containsAdultContent": true,
  "uploadedBy": "kuunkulta",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000154275",
      "name": "Patch for SWO-ECE-custom races",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Patch for SWO-ECE-custom races-64419-1.zip",
      "uploadedUnix": "1428180324",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/bf6acd31cdcea32e775af5751fe84088de23e87ed6e0f922b569d75fccaf04a8/analysis/1428180363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20SWO-ECE-custom%20races-64419-1.zip?fid=1000154275&ttl=1535853078&ri=8192&rs=8192&setec=2ea0f4b1a2613c5b5d661ab23b9cac54"
    }
  ]
}