{
  "modId": 6445.0,
  "modName": "Mjoll Proper",
  "summary": "Mjoll is a Nord. So I gave her Nord armor and an Ancient Nord Amulet. ",
  "descriptionHtml": "Hi, folks, Talon Company here. I haven\\'t posted in a while and wasn\\'t going to, but I felt like Mjoll was done an injustice. This is my attempt to correct that.\r\n\r\nMjoll is now trained in One Handed rather than Two, with slightly upped Archery and Heavy Armor skills. I attempted to balance her to my character\\'s fighting ability, not overpowered but not a wimp either. It feels more like fighting alongside someone rather than dragging a weight around. Her default outfit is the Ancient Nord (Draugr) armor with no enchantments and the Ancient Nord Amulet. They are not part of her inventory. You may have to take the Banded Steel (iron?) armor from her to see it. Also she has Heal (who doesn\\'t?), her eyes are blue, her hair is red, and she has freckles. More befitting a true Nord I think. Nothing else (that I remember) has changed.\r\n\r\nThis mod was only tested after Mjoll was my active companion. Heaven knows what will happen in any other situation. Use at your own risk.\r\n\r\nOh, she might have things in her inventory, I can\\'t remember if I gave them to her before or after and I\\'m too lazy to check. Sorry.\r\n\r\nI used the NPC editor to do this, you can get it here:\r\n\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=4554\r\n\r\nThanks to the Nexus for hosting us and thanks to Bethesda for another great game.\r\n\r\nINSTALL: Extract to Skyrim directory. Check Mjoll.esp. Enjoy.\r\n\r\nUNINSTALL: Delete Mjoll.esp.\r\n\r\nThank you for shopping Talon Company. Have a nice day.",
  "categoryId": "66",
  "version": "0.1",
  "author": "Talon Company",
  "createdUnix": "1326845729",
  "updatedUnix": "1326845863",
  "containsAdultContent": false,
  "uploadedBy": "Talon Company",
  "primaryFile": null,
  "files": [
    {
      "fileId": "20764",
      "name": "Mjoll Proper",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Mjoll Proper-6445.7z",
      "uploadedUnix": "1326845863",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/d053d8643c0ca107892a33130070bf7c845db97a5c9ddb3d8963215e1cb6ddbc/analysis/1406619792/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mjoll%20Proper-6445.7z?fid=20764&ttl=1535763848&ri=8192&rs=8192&setec=8c3878be53e1e55d04028747275cca11"
    }
  ]
}