{
  "modId": 64591.0,
  "modName": "Pirates of Skyrim FR",
  "summary": "Traduction du mod Pirates of Skyrim - The Northern Cardinal under the Black Flag de BigBizkit / French translation of Pirates of Skyrim - The Northern Cardinal under the Black Flag by BigBizkit",
  "descriptionHtml": "[center][size=6]Pirates de Bordeciel - Le Cardinal du Nord sous le drapeau noir[/size][/center]\r<br />\r<br />Categorie : Habitations\r<br />Auteur : BigBizkit\r<br />Traducteur : Sylom\r<br />Prérequis :\r<br />- Dawnguard ;\r<br />- Dragonborn ;\r<br />- Hearthfire (un patch pour jouer au mod dans Hearthfire est dispo) ;\r<br />- Fuz Ro D&#39;oh : http://www.nexusmods.com/skyrim/mods/14884\r<br />\r<br />[b][u]Description[/u][/b]\r<br />&#34;Pirates de Bordeciel - Le Cardinal du Nord sous le drapeau noir&#34; est une extension massive du superbe mod de swordboy, le &#34;Cardinal du Nord&#34; (Northern Cardinal en VO.), créé en prenant comme base - justement - le Cardinal du Nord..\r<br />\r<br />Il introduit la piraterie dans Skyrim. Vous pourrez ainsi naviguer sur la mer des Fantômes, explorer les fonds marins, participer à des batailles navales, piller des trésors uniques et les exposer fièrement dans votre cabine, gérer votre équipage et bien plus.\r<br />\r<br />[b][u]Caractéristiques détaillées[/u][/b]\r<br />a)La mer des Fantômes\r<br />Naviguez avec le Cardinal du Nord (c&#39;est le nom du vaisseau au cas où vous n&#39;auriez pas utilisé le mod auparavant) jusqu&#39;à la mer des Fantômes et explorez les fonds marins. Plongez à la recherche de perles ayant la taille de votre tête et découvrez des épaves de navires ayant des trésors n&#39;attendant que vous pour les récupérer. Secourez un forgeron rescapé d&#39;une mort lente et faites-en un membre de votre équipage. Les &#39;fonctionnalités de l&#39;océan&#39; (dénomination de l&#39;auteur) comme les épaves et les trésors apparaissent et disparaissent de manière aléatoire à chaque vois que vous vous rendez sur la mer des Fantômes, créant ainsi l&#39;illusion d&#39;un véritable océan sur lequel vous naviguez.\r<br />(Vous aurez besoin d&#39;un équipage d&#39;au moins 3 membres pour pouvoir naviguer jusqu&#39;à la mer des Fantômes)\r<br />\r<br />b)Batailles navales\r<br />Utilisez un des 3 téléscopes (un près de la barre, un près de la carte sur le pont et un dans la vigie) à bord pour voir les navires ennemis attendant d&#39;être abordés et pillés de leur butin\r<br />\r<br />Abordez des navires marchands, impériaux, Sombrages, de pirates, de Serpents des mers (des pirates argoniens cannibales ajoutés par ce mod), de Thalmor ayant des prisonniers et/ou des trésors et d&#39;explorateurs.\r<br />\r<br />Leur cargaison est entièrement aléatoire : de belles fourrures, de beaux tapis, de l&#39;or, des trésors et même du rhum ou de l&#39;argenterie &#33;\r<br />\r<br />Dites à certains membres de votre équipage qui doit faire partie de l&#39;équipe d&#39;abordage, garantissant ainsi qu&#39;ils seront en première ligne lorsqu&#39;il y aura de l&#39;action.\r<br />\r<br />c)Système de moral de l&#39;équipage\r<br />(qui peut, de facto, être désactivé en tapant dans la console &#34;set aacrewmorale to 999&#34;)\r<br />\r<br />Votre équipage n&#39;acceptera plus de naviguer gratis à présent. De temps en temps, vous devrez soit partager avec eux une partie du butin obtenu, soit - et c&#39;est mieux pour eux - leur fournir des bouteilles de rhum &#33; La gestion de votre équipage se fait en parlant avec votre second-capitaine.\r<br />\r<br />Il est possible via une amélioration (une table, en fait) d&#39;organiser une réunion de l&#39;équipage.\r<br />\r<br />d)Extension de la cabine du capitaine : Salle des trophées et expositions\r<br />Il est maintenant possible d&#39;acheter des améliorations pour votre cabine pour une coquette somme et de &#39;fabriquer&#39; des stands pour exposer les trésors uniques que vous avez récupérés.\r<br />Chaque stand fournit un bonus spécial thématique et, plus important, il est super classe. \r<br />\r<br />[u]Installation[/u]\r<br />1. Installez d&#39;abord le mod en VO.\r<br />2. Dézippez les fichiers vers un dossier temporaire.\r<br />3. Copiez les fichiers vers (dossier d&#39;installation)&#92;Skyrim&#92;Data&#92; (REMPLACEZ SI DEMANDÉ)\r<br />4. Démarrez le launcher de Skyrim, cliquez sur &#39;Fichiers de données&#39;, et cochez la case près du fichier NorthernCardinal.esp.\r<br />\r<br />[u]Désinstallation[/u]\r<br />Supprimez les fichiers venant du mod.\r<br />\r<br />[u]FAQ[/u]\r<br />Q: Comment puis-je faire pour obtenir un équipage / je n&#39;arrive pas à faire rejoindre mon compagnon dans l&#39;équipage, pourquoi ?\r<br />R: Afin que des PNJs ne rejoignent votre équipage, ils doivent être des compagnosn et être SUR/DANS le bateau ET/OU avoir un journal de l&#39;équipage dans leur inventaire. Ce qui veut dire que leur donner un journal de l&#39;équipage (inventaire/console/vol à la tire inversé) est la moyen de recruter un compagnon si celui-ci a des soucis avec ses dialogues. Vous pouvez théoriquement rendre N&#39;IMPORTE QUEL PNJ membre de l&#39;équipage en lui donnant un journal de l&#39;équipage. Ce n&#39;est pas conseillé pour les PNJs importants comme Ulfric, etc. IL VOUS FAUDRA AUSSI ACQUÉRIR L&#39;AMÉLIORATION DES QUARTIERS DE L&#39;ÉQUIPAGE.\r<br />\r<br />Q: Je ne peux pas naviguer jusqu&#39;à Corberoc, pourquoi ?\r<br />R: Pour pouvoir vous rendre à Corberoc (Solstheim) vous devrez :\r<br />a) Y avoir été au moins une fois auparavant et avoir lancé la quête de Dragonborn\r<br />b) Parler au capitaine qui vous y a emmené et le convaincre de vous donner la route (NB du traducteur : pas sûr de comment il vous la donne, j&#39;ai pas encore fait Dragonborn)\r<br />c) Si le dialogue avec le capitaine n&#39;apparaît pas, tapez dans la console &#34;set 0ShipEnableDragonborn to 1&#34;\r<br />d) Si vous avez tout ça, vous pourrez vous rendre à Corberoc via la barre/carte\r<br />\r<br />\r<br />Q: J&#39;ai installé le mod, mais mon jeu crash après le logo Bethesda. Qu&#39;est-ce que je fais ?\r<br />R: OK écoutez, un crash est démarrage est quasiment toujours toujours toujours toujours dû à un fichier maître manquant. Cela signifie qu&#39;il vous manque un des fichiers suivants : Skyrim.esm, Dragonborn.esm, Hearthfire.esm, Dawnguard.esm et &#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;UPDATE.esm&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;, et si ça crash malgré tout, c&#39;est que vous avez installé la version General Sotres nécessitant évidemment GeneralStores.esm.\r<br />\r<br />Q: Est-ce que ça risque d&#39;endommager mon jeu ? / Ehrmagerd, t&#39;as cassé mon jeu&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;11111111\r<br />R: Je tourne avec plus de 300 mods et j&#39;ai installé, merde quoi, j&#39;ai CRÉÉ ce mod à mi-parcours dans le jeu et ma sauvegarde se porte très bien. Si vous parvenez à endommager votre sauvegarde en utilisant ceci, je suis surpris que vous ne vous êtes pas briser les jambes en allumant votre ordinateur.\r<br />\r<br />Q: Est-ce compatible avec SkyRe/Requiem/PerkusMaximus etc.?\r<br />R: Bien sûr que si.\r<br />\r<br />Q: Comment dois-je désactiver le système de moral ?\r<br />R: tapez &#34;set aacrewmorale to 9999&#34; dans la console. Cela ne le désactivera pas, mais ça fera en sorte que vous puissiez naviguez 10000 fois sans que le système ne vous enquiquine.\r<br />\r<br />Q: J&#39;ai utilisé le téléscope quelque fois, et maintenant il n&#39;y a plus qu&#39;un message disant qu&#39;il n&#39;y a pas d&#39;autres navires aux alentours &#33;?\r<br />R: Pour des raisons d&#39;équilibrage, vous ne pouvez &#34;relancer&#34; que 3 fois. Après ça, vous devrez retourner à l&#39;un des ports et retourner en mer afin de pouvoir relancer. La nombre de fois que vous pouvez relancer peut être modifié en tapant &#34;set aaRerollTimes to X&#34; et &#34;set aaRerollTimesCustom to X&#34; dans la console (remplacez X par le nombre de fois voulu).\r<br />\r<br />Q: Pourquoi pas de MCM pour vos features ??\r<br />R: Je n&#39;y connais rien en création de menu MCM. Personnellement, je n&#39;en ai pas besoin d&#39;un vu que je sais comment modifier certains points dans le CK. Le fait que je tente l&#39;incorporation d&#39;un menu MCM dans e mod dépend de comment se déroulera cette première expérience de release.\r<br />\r<br />Q: J&#39;aimerais que les marchands/pirates/impériaux/etc apparaissent plus/moins souvent.\r<br />R: tapez dans la console &#34;help aachance&#34;, ça vous donnera la liste des probablités. Vous pouvez régler les valeur en mettant celles que vous voulez à présent. Le script de téléscope fera le calcul à votre place et répartira les probabilités en pourcentages. Grand merci à cdcooley qui m&#39;a aidé là-dessus et sur comment faire les majs des valeurs.\r<br />\r<br />Q: Je n&#39;ai pas Dawnguard/Dragonborn/Hearthfires.Ferez-vous une version qui ne nécessite pas les DLC ?\r<br />R: Il y a une version sans Hearthfire maintenant.\r<br />Pour Dragonborn et Dawnguard, les 2 sont supers et donnent aux moddeurs de superbes ressources en plus d&#39;être pas chers. Achetez-les.\r<br />(NB du traducteur : bien que je n&#39;approuve pas la ligne &#34;ils sont pas chers&#34;, pour le reste je suis d&#39;accord. De plus, la Legendary Edition est sortie il y a déjà pas mal de temps, donc si j&#39;étais vous j&#39;essaierai de me procurer les DLC, histoire de ne pas rater certains bon mods)\r<br />\r<br />Q: Pourquoi pas de patch pour Falskaar/Wyrmstooth ?\r<br />A: (NB du traducteur : là j&#39;ai complètement zappé l&#39;ancienne réponse de l&#39;auteur, mais si vous prenez les patchs de Falskaar/Wyrmstooth et que vous les fusionnez à l&#39;esp du mod - comme avec l&#39;ancien Cardinal du Nord - ça passe. Du moins, ça le fait pour certains utilisateurs.\r<br />Petit rappel : le Cardinal du Nord avec les patchs traduits est dispo ici en version traduite : http://www.confrerie-des-traducteurs.fr/skyrim/mods/bordeciel/habitations/cardinal_du_nord\r<br />N&#39;OUBLIEZ PAS DE LIRE LES INDICATIONS DE FUSION POUR CES PATCHS)\r<br />\r<br />Q: Quelque chose ne marche pas, corrigez ça &#33;\r<br />R: (NB du traducteur : envoyez un explication détaillée de votre problème sur la page VO, je pourrais pas vous aider là-dessus)\r<br />\r<br />Q: Vous acceptez les demandes ?\r<br />R: Si vous sous-entendez par là que vous me dites quoi faire et que je le fasse, non. Si toutefois vous désirez me suggérer des idées, bien sûr. Je suis ouvert aux suggestions, en particulier sur les nouveaux types de butin. Je ne suis pas un modeleur alors ne demandez pas des choses pour lesquelles il n&#39;y a pas de modèle existant.\r<br />\r<br />Q: Pourquoi il y a un marqueur de carte au milieu de la map ?\r<br />R: Parce que vous n&#39;avez pas mis à jour. C&#39;est inoffensif, par contre.\r<br />\r<br />Q: Vous devriez vraiment faire un dragon des mers et un kraken ainsi que rendre le bateau entièrement dirigeable et des requins et des licornes qui tirent des lasers  &#33;\r<br />R: Les choses dont vous parlez AURAIENT pu être possible en mettant en place une équipe entière de développeurs, de modeleurs, un département d&#39;animations... Et même avec ça, vu les limitations du moteur de Skyrim, ça serait bien plus facile de recréer un nouveau eu. Vous devez comprendre que modder Skyrim ne se limite pas à cocher une case disant &#34;Ajouter un superbe combat contre un kraken&#34;.\r<br />\r<br />Q: Les Arizona Cardinals ? Je ne télécharge pas &#33;\r<br />R: Quelqu&#39;un en parlé sur Youtube en disant en gros &#34;c&#39;est le drapeau des Arizona Cardinals, je ne téléchargera pas&#34;. Écoutez, je ne suis pas des States, je n&#39;y connais RIEN en football américain et vous pouvez changer la bannière.\r<br />\r<br />Q: Je ne veux pas de fusils dans mon jeu &#33;\r<br />R: Vous pouvez remplacer les fusils portés par les explorateurs en activant la miniature du bateau dans la cabine du capitaine. C&#39;est là que vous trouverez les options du mod.\r<br />\r<br />Q: J&#39;ai toutes les indications de la carte. Comment me rendre sur l&#39;île ?\r<br />R: Si vous jouez normalement c&#39;est impossible d&#39;obtenir les 5 fragments de la carte en moins d&#39;une semaine. Et il n&#39;y a pas encore d&#39;île.\r<br />\r<br />Q: J&#39;ai lu toute la description, la FAQ, les stickies, etc mais mon problème n&#39;est mentionné nulle part, donc je fais quoi ?\r<br />R: Bravo &#33; Postez votre problème avec une description détaillée en ajoutant le nom de code &#34;me hartey&#34;. et j&#39;essaierai d&#39;y jeter un oeil.\r<br />(NB du traducteur : je passe plus de temps à traduire qu&#39;à jouer donc niveau suivi technique, je risque d&#39;être un peu à la ramasse niveau soucis techniques. Donc vous pouvez soit poster sur le topic SAML du mod sur la Confrérie, soit aller directement sur la page VO et poster votre prob en anglais. Navré.)\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />\r<br />[u]Crédits[/u]\r<br />Blary pour Open Books, Alchemy Clutter, food containers etc.\r<br />Stoverjm pour Open Books Library.\r<br />yourenotsupposedtobeinhere pour Rug Resource.\r<br />BrettM pour Experiment Pack & Aquarium Kit.\r<br />InsanitySorrow pour toutes ses ressources Skyrim.\r<br />Oaristys pour son Modder Resource Pack (NB du traducteur : big up o/).\r<br />Ghosu pour son sabre de pirate de son mod Weapon Pack et pour les Flintlock Rifles.\r<br />Horrorview pour les textures provenant de Sexy Boats.\r<br />Daemonjax pour ses scripts de Just In Time Lighting Scripts.\r<br />TESA pour le Skyrim Resource Kit Project.\r<br />Tamira/Stroti pour Assorted Resources.\r<br />Khugan (nom d&#39;utilisateur : Conifer) pour les couronnes.\r<br />La texture de la pièce est faite par Bartalon.\r<br />LordKarnak pour le drapeau de pirate.\r<br />hothtrooper44 pour l&#39;armure de loup de mer et les coutelas d&#39;acier/d&#39;ébonite/de capitaine.\r<br />747823 pour le coutelas de fer.\r<br />swordboy pour le mod d&#39;origine, le Cardinal du Nord.\r<br />Harvey2112 pour les ressources utilisées par la version GeneralStores.\r<br />Mr.Dave pour les tricorne et le tricorne à plume, tous les supers chapeaux, le mão esquerda, la raîère et le glaive.\r<br />TH3WICK3D1 pour l&#39;armure à rayures bleues et la retexture redanienne de celle-ci (Explorer&#39;s armor).\r<br />Détails en anglais sur la page :\r<br />&#34;Meshes and textures belong to CDProjektRED, the developer of The Witcher 2 (http://www.thewitcher.com/)\r<br />These models and textures were not created by me (unless specified otherwise), it was simply used to create this mod.\r<br />the models were edited in Blender to adjust to the Skyrim set of bones.&#34;\r<br />markusliberty pour la ressource de bateau cyrodilique.\r<br />Luddemann pour le &#34;béret à plume&#34; aka chapeau de barde.\r<br />Teh-Husky pour sa superbe armure en cuir de netch.\r<br />monk_ide pour les nouveaux meubles (table et stands).",
  "categoryId": "67",
  "version": "1.51",
  "author": "BigBizkit - traduit par Sylom",
  "createdUnix": "1428601643",
  "updatedUnix": "1430326405",
  "containsAdultContent": false,
  "uploadedBy": "Sylom",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000155034",
      "name": "Fchier principal",
      "version": "1.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1442",
      "fileName": "Fchier principal-64591-1-5.7z",
      "uploadedUnix": "1428601638",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/26f0bdfcea260c4cbe8182320713b7a7dfc2f7c4fa9221e2936a57bdb31dde88/analysis/1428601685/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fchier%20principal-64591-1-5.7z?fid=1000155034&ttl=1535853227&ri=8192&rs=8192&setec=ddc0d078eb47a2a147278724db148f64"
    },
    {
      "fileId": "1000155037",
      "name": "Patch pour GeneralStores",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1000",
      "fileName": "Patch pour GeneralStores-64591-1-5.7z",
      "uploadedUnix": "1428602203",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/da9f06c3f429d87b12b0a340dad1f42a483f36b8262ab2e4e9f2f5db27e581c7/analysis/1428602229/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20pour%20GeneralStores-64591-1-5.7z?fid=1000155037&ttl=1535853227&ri=8192&rs=8192&setec=f174d351ec02cf17756d5acbb6b30a07"
    },
    {
      "fileId": "1000155038",
      "name": "Patch No Hearthfire",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1007",
      "fileName": "Patch No Hearthfire-64591-1-5.7z",
      "uploadedUnix": "1428602611",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/af088658ffb715cdbf1978f10cec7f1627397b51ff50593d87ae620e0919bbd5/analysis/1428602646/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20No%20Hearthfire-64591-1-5.7z?fid=1000155038&ttl=1535853227&ri=8192&rs=8192&setec=c99eb15ea0857b086caf07bfa7671f27"
    },
    {
      "fileId": "1000157854",
      "name": "Fichier principal 1.51",
      "version": "1.51",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2687",
      "fileName": "Fichier principal 1.51-64591-1-51.7z",
      "uploadedUnix": "1430326405",
      "modVersion": "1.51",
      "virusScanUrl": "https://www.virustotal.com/file/ade0c8a0b11e09e090b39e06baa3ddcfd97e2be1342bad1cf192d81a0ec2e2b8/analysis/1430326445/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fichier%20principal%201.51-64591-1-51.7z?fid=1000157854&ttl=1535853228&ri=8192&rs=8192&setec=6998c27ef248300600c4ab0f7d6f1a59"
    }
  ]
}