{
  "modId": 6461.0,
  "modName": "3 new Khajiit races - Ohmes Ohmes-raht and Suthay",
  "summary": "Adds 3 new Khajiit races all with their own racial bonuses and unique greater power, and changes the Vanilla Khajiit to Suthay-raht",
  "descriptionHtml": "Greetings!\r\n\r\nThis mod was formally Real Ohmes Khajiit -sort of- replacer, but it\\'s alot more than that now.\r\n\r\n------------------\r\nDESCRIPTION\r\n------------------\r\nAdds 3 new mostly lore friendly Khajiit races; the Ohmes, Ohmes-raht, and Suthay, and also changes the Vanilla Khajiit to Suthay-raht.  All four have night-eye and claws plus one greater power.  All races have a mostly lore accurate discription (i took some small but believable creative license so having 4 unique greater powers would make sense.\r\n\r\nThe Ohmes and Ohmes-raht have new textures - the female body is an edited version of Thepal\\'s Nude Females, and everything else is mine.  The Suthay is only physically different from the Suthay-raht in stature, but otherwise looks the same.\r\n\r\nEach race has different bonuses, all centered around stealth.  Now Suthay-raht is geared towards a light armored fighter, but still a good theif, while the Suthay is the ideal setup for a theif.  Ohmes-raht is good as a hunter and Ohmes work well as merchants or thieves.\r\n\r\n------------\r\nPOWERS\r\n------------\r\nSUTHAY-RAHT - Feline Agility; increases running speed by alot for 3 minutes.  The speed is just less than unmanageable.  Great for getting somewhere fast, escaping a bad situation, or bum-rushing your enemies.\r\n\r\nSUTHAY - Chameleon; really just an invisibility with a little extra fx that last for 30 seconds.\r\n\r\nOHMES-RAHT - Dexterity; increases critical hit rate to almost 100% for 60 seconds.  Great with a bow.\r\n\r\nOHMES - Honeyed Words; buffs speechcraft for 5 minutes.  Make prices better and have better luck with persuasion.  \r\n \r\n\r\n--------\r\nBUGS\r\n--------\r\n\r\nThere\\'s a bunch of extra hair slots in the character menu that are unused (The creation kit seems alot more confusing than the oblivion construction set was), and a few other non-game breaking quirks in the character menu.\r\n\r\n------------------------\r\nADDITIONAL INFO\r\n------------------------\r\nCustom meshes and armor will not work unless you mod the esp in creation kit.  It isn\\'t too hard to do but it can be a pain if you have alot of custom armor like me.\r\n\r\n----------\r\nCREDIT\r\n----------\r\nThanks to Bethesda for an amazing game.\r\nThanks to Thepal for his fine texture.\r\n\r\n---------\r\nUsage\r\n---------\r\nFeel free to use, edit, and improve my work as you wish, just give me credit.  The body texture is edited from Thepal\\'s, so you probably need his permission to modify that texture.  ",
  "categoryId": "34",
  "version": "0.8",
  "author": "CapAm",
  "createdUnix": "1326865378",
  "updatedUnix": "1329380159",
  "containsAdultContent": false,
  "uploadedBy": "CapAm",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31965",
      "name": "New Khajiit Races",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38163",
      "fileName": "New Khajiit Races-6461-1.zip",
      "uploadedUnix": "1329380159",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/bfb271cda203d4e15a5d5a4d2e90f0494e0357010efbde59b1883d7916f49130/analysis/1406686817/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Khajiit%20Races-6461-1.zip?fid=31965&ttl=1535763868&ri=8192&rs=8192&setec=eeb24bdd23825d81af6388fd90764481"
    }
  ]
}