{
  "modId": 64623.0,
  "modName": "Old-School Booze",
  "summary": "Requirements: Skyrim and Dragonborn \r<br />\r<br />So alcohol, especially of the mead variety, is a central tenet of nordic culture, however its pretty pointless. In all my time playing Skyrim I never found a reason to drink unless role-playing as a nord or heavy drinker. I never found myself in the situation that I needed more stamina desperately e",
  "descriptionHtml": "Requirements: Skyrim and Dragonborn \r<br />\r<br />[font=Arial, Helvetica, Verdana, sans-serif][color=#acb2b8]So alcohol, especially of the mead variety, is a central tenet of nordic culture, however its pretty pointless. In all my time playing Skyrim I never found a reason to drink unless role-playing as a nord or heavy drinker. I never found myself in the situation that I needed more stamina desperately enough to warrant taking a penalty to future regeneration. But I tolerated until I really thought about Dragonborn. The unique local brews of the dunmer were reduced to pointless beverages like most others in the game. I am releasing this mod to fix this perceived issue. [/color][/font]\r<br />\r<br />[font=Arial, Helvetica, Verdana, sans-serif][color=#acb2b8]Based on previous games, I modified the effects of several beverages to offer benefits, and in some cases detriments, similar to the booze of old. Also I spelled mazte right as opposed to matze. [/color][/font]\r<br />\r<br />Changes: \r<br />Argonian Ale- Variant, Restore Stamina 15 points, Health regen +5/s \r<br />Black-Briar Mead- Fortify barter 10%, restore stamina 30 pts \r<br />Black-Briar Reserve- Fortify Barter 20% restore stamina 30 pts \r<br />Cliff Racer- Resist Fire 25%, One-Handed is 10% stronger \r<br />Cyrodilic Brandy- Fortify Stamina/Health 25 pts, slow Magika/Stamina Regen 30% \r<br />Flin- Fortify One/Two Handed 10%, Fortify Stamina regen 20% \r<br />Honningbrew Mead- Restore Stamina 20 pts, Fortify Persuasion 20% \r<br />Juniper Mead (Formerly Mead with Juniper Berries)- Restore Health/Stamina 20 pts, Weakness to fire 30% \r<br />Mazte- Fortify One/Two Handed 20%, Damage magika 20 pts, Slow stamina regen 20% \r<br />Nord Mead- Fortify Two-Handed 15%, Restore Stamina 30 pts \r<br />Shein- Fortify Health 25 pts, Damage Magika 25 pts \r<br />Skooma- Craftable at Cooking pot, damage magika regen 100 pts, fortify one/two-handed 25%, Speed boost drugged \r<br />Skooma Max- A more potent varaint of skooma, craftable (alternate name suggestions are welcome) \r<br />Spiced Wine- Restore 25 pts of Stamina, Fortify Stamina regen rate 30% \r<br />Sujamma- Fortify One/Two Handed 50%, Damage Magika 50 pts, Slow Magika regen 50% \r<br />Velvet LaChance- Fortify Sneak/Lockpick 10% \r<br />White-Gold Tower- Fortify Persuasion/Barter 10% \r<br />\r<br />As with all my mods, I welcome constructive criticism and ideas, just allow me to discuss them with you. Also this can be considered a WIP and am always interested in new ideas for other beverages or completely new ones to add. \r<br />Also available on Steam Workshop\r<br />\r<br />Change Log:\r<br />4/10/15- Original posting\r<br />\r<br />The following providing everything needed for the mod:Bethedsa, for creating the game series and the creation kitValve, for making it easy to acquire the creation kit and providing the WorkshopThe Unofficial Elder Scrolls Pages, for confirmation of informationThe Creation Kitten, for being a great tutorial\r<br />\r<br />Feel free to modify this file to fit your needs, I just ask that you credit it me in some way.",
  "categoryId": "24",
  "version": "1.0",
  "author": "risenO",
  "createdUnix": "1428678470",
  "updatedUnix": "1428678470",
  "containsAdultContent": false,
  "uploadedBy": "tfard1532",
  "primaryFile": null,
  "files": []
}