{
  "modId": 6465.0,
  "modName": "Elemental Gauldur Amulet v1",
  "summary": "This mod gives better stats to \\\"The Gauldur Amulet\\\" and renames it to \\\"Amulet of Gauldur\\\" so that it sorts better with other amulets in the inventory.",
  "descriptionHtml": "Elemental Gauldur Amulet v1\r\n\r\nThis mod gives better stats to \\\"The Gauldur Amulet\\\" and renames it to \\\"Amulet of Gauldur\\\" so that it sorts better with other amulets in the inventory. The new stats are:\r\n\r\nResist Magic 15%\r\nResist Fire  35%\r\nResist Frost 35%\r\nResist Shock 35%\r\n\r\n\r\nThe old stats with Health, Magicka and Stamina has been removed. The gauldur amulet fragments has not been changed in this mod.\r\n\r\nGet the item by completing the Forbidden Legend quest. For more detail, see here: www.uesp.net/wiki/Skyrim:Forbidden_Legend\r\n\r\nor use the console: player.additem 2d773 1\r\n\r\n\r\nThe Forbidden Legend quest can be started several different ways and can bug out if you are careless. The best way to avoid problems is to make sure you start the quest by reading a book named Lost Legends. An easy to find copy of that book is in the arrogant court wizards quarter in Dragonsreach, Whiterun, in the room to the left of the enchanting table, under a beer flagon.\r\n\r\nThe quest has a good plot and lots of combat. Take the time to read the lore, well worth it. The final reward in vanilla skyrim, The Gauldur Amulet, is hardly worth wearing though, considering how much better items you can make through enchanting/alchemy. I felt the stats needed to be adjusted, and I choose to do so by giving it elemental resists. \r\n\r\nElemental Resistance caps at 85%, and is applied after Magic Resist. This means it is well worth getting your resists up to 85% but pointless to get them higher than 85%.\r\n\r\nMagic Resistance: Lord Stone gives 25. Agent of Mara gives 15. The three Alteration perks gives 10 each. With the 15 from Gauldurs Amulet in this mod, you reach the hard cap at 85%. I choose to raise Alteration to 70 and spend 3 perk points rather than making this amulet stronger. This way it doesn\\'t feel like I am cheating with godlike items.\r\n\r\nNords gets 50% Frost Resistance for free and with the 35 from this mod, you reach the hard cap at 85%. This means you only need to enchant a ring, boot or shield with 50% Fire Resistance and 50% Shock Resistance to reach cap for all resistances.\r\n\r\n\r\nCompatibility: This mod changes two records:\r\n\r\n0x0002D773 dunGauldurAmulet\r\n0x00106FCC dunEnchGauldurAmuletFortifyStats\r\n\r\nAny mod that changes these two records will be incompatible. Make sure you load this mod after any mod that do so.\r\n\r\n\r\n\r\nThis mod was inspired by Legendary Gauldur Amulet by Zaldir. Thanks Zaldir!\r\nhttp://www.skyrimnexus.com/downloads/file.php?id=3392\r\n\r\nNo rights reserved. Feel free to do anything you want with this mod.",
  "categoryId": "40",
  "version": "v1",
  "author": "Eiwyn",
  "createdUnix": "1326871911",
  "updatedUnix": "1326872106",
  "containsAdultContent": false,
  "uploadedBy": "Eiwyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "20841",
      "name": "Elemental Gauldur Amulet v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "276",
      "fileName": "Elemental Gauldur Amulet v1-6465-1.7z",
      "uploadedUnix": "1326872106",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/3e4ed3ac5ed0ac60a5dbaa67def2f6dd8448f8740192938a101dabdb8643bd8a/analysis/1406620410/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Elemental%20Gauldur%20Amulet%20v1-6465-1.7z?fid=20841&ttl=1535763877&ri=8192&rs=8192&setec=720dbb4dd05039b1bb4740974375622e"
    }
  ]
}