{
  "modId": 64654.0,
  "modName": "Extra Bandits",
  "summary": "Adds extra NPCs to the bandit levelled lists to mix things up a little.",
  "descriptionHtml": "[center]THIS MOD IS OUTDATED PLEASE USE [url=http://www.nexusmods.com/skyrim/mods/85229/?]Extra NPCs[/url] THANK YOU :D[/center]\r<br />\r<br />\r<br />Thank you for checking out this mod. :3 This mod will never be uploaded to Steam and I will never give permission for anyone to use anything from it on a mod they intend to make money from.\r<br />\r<br />[center]== Description ==[/center]Ever since I got Skyrim a few years back I was a little peeved about the bandits not being as diverse as Oblivion. I searched for some mods that fixed this little problem but they either came with features I didn&#39;t want (said features couldn&#39;t be removed either) or just didn&#39;t work the way I wanted them to. So I just left this matter alone, until I downloaded the CreationKit and started fiddling around with creating NPCs and altering levelled lists.\r<br />And now with this mod, the bandit crews of Skyrim now get to have sultry Argonian ladies, badass Orc females and fluffy Khajiit women fighting alongside them&#33; Hooray&#33;\r<br />[center]==Added by this mod==[/center][i][b][color=red]Male and female Breton warriors[/color][/b][color=red]:[/color][/i]\r<br />No longer solely relegated to being the squishy mage, some Breton bandits have donned a suit of armour and taken up a weapon to help their fellows pillage and burn&#33; Breton bandit warriors will wear either light or heavy armour and will always use a one-handed weapon. VoiceTypes: MaleBrute and FemaleYoungEager.[color=#ffff00] VERSION 2: [/color]Bretons will now also spawn as spellswords and bandit chiefs.\r<br />[i][b][color=red]Female Argonian mages:[/color]\r<br />[/b][/i]Magical lizard ladies&#33; Will they zap you with lightning or lay an egg in the midst of combat? Who knows&#33; (They won&#39;t.) VoiceType: FemaleArgonian. [color=#ffff00]VERSION 2: [/color]Argonian males and females will now also spawn as archers.\r<br />[i][b][color=red]Female Khajiit warriors and archers:[/color][/b][/i]\r<br />Intense cat girl action; these fluffy terrors will join their manly kitties in their mad quest to loot your corpse and will fight you with bows or one-handed weapons and will only wear light armour. VoiceType: FemaleKhajiit.\r<br />[i][b][color=red]Female Orc Chiefs and regular warriors:[/color][/b]\r<br />[/i]Orcs are badass, and so are female Orcs. Joining the fray, these green women will help their comrades pummel you into the ground or maybe they will actually lead the effort as a viscious Bandit Chief. VoiceType: FemaleOrc. NOTE: It seems as though female Orcs were slated to be part of bandit crews during Skyrim&#39;s development as the VoiceType has unique bandit quotes, such as &#34;Gonna split your belly like and old woman&#39;s purse&#33;&#34;\r<br />[i][b][color=red]Male and female High Elf spellswords:[/color][/b]\r<br />[/i]No longer excluded from the ranks of common brigands, the bandit high elves couldn&#39;t decide to be either mage or warrior and decided to become both. Wearing heavy armour, they will buff themselves with a spell such as Stoneflesh and pelt you with fire, frost or lightning as they charge in to bash you into red goo with sword, axe or mace. If they suffer dire wounds in the fight, they&#39;ll simply heal themselves continue the assault. VoiceTypes: MaleCondescending and FemaleCoward. [color=yellow]NOTE:[/color] For whatever reason, Bandit Marauder spellswords will not use their Alteration spell (Ironflesh) despite my efforts to fix the problem. I&#39;m just going to assume that they are so eager to take your gold that they can&#39;t be bothered buffing themselves. Also, some of the early bandit spellswords will appear in the CK as something like EncBandit01Nightblade. Reason being, I was originally going to have them wear light armour instead of heavy but I couldn&#39;t be bothered going back and changing them. [color=#ffff00]VERSION 2: [/color]High Elves now have a small chance of spawning as mages and warriors in addition to spellswords and their voices are now MaleElfHaughty and FemaleElfHaughty.\r<br />\r<br />[color=#ffff00]VERSION 2 CHANGES NOT LISTED ABOVE: \r<br />[/color]Vanilla Bretons have had their voices changed to match the Breton warriors and the new Breton chiefs. MaleBrute has been swapped out for MaleSlyCynical.\r<br />\r<br />Imperial mages and Spellswords.\r<br />\r<br />Dunmer male and female mages, spellswords, chiefs and warriors. MaleDarkElf and FemaleDarkElf have generic bandit dialogue so I thought I&#39;d add them in. :3 I didn&#39;t in Version 1 because the Reavers are exclusively Dunner, but I obviously changed my mind.\r<br />\r<br />Nord Spellswords.\r<br />\r<br />Spellswords in general will now spawn in either a suit of light armour or heavy armour - but never will the two mix (ie, fur cuirass with steel boots).\r<br />\r<br />Redguard mages.\r<br />\r<br />Higher level bandits:\r<br />\r<br />[i]Bandit Raider - Level 31\r<br />Bandit Despoiler - Level 37\r<br />Bandit Vagabond - Level 46\r<br />Bandit Ravager - Level 60\r<br />\r<br />[/i]Forsworn Warlords have been added to Forsworn levelled lists (for some reason they were left out entirely by Bethesda).\r<br />\r<br />New Reaver names to set them apart from the bandits:\r<br />\r<br />[i]Reaver\r<br />Reaver Freebooter - Level 5\r<br />Reaver Corsair - Level 9\r<br />Reaver Hijacker - Level 14\r<br />Reaver Picaroon - Level 19\r<br />Reaver Buccaneer - Level 25\r<br />Reaver Rover - Level 31\r<br />Reaver Harrier - Level 37\r<br />Reaver Privateer - Level 46\r<br />Reaver Scourge - Level 60\r<br />\r<br />[/i]Face changes: Some bandits showed signs of laziness in their development; they were simply implemented with the default CK face for their race (as were some vanilla game NPCs like Erikur) I have changed the bandit faces to something more pleasing and less default-y.\r<br />\r<br />Mage spells: Bandit and Reaver mages and spellswords will now use cloak spells starting from level 19.\r<br />\r<br />Reaver bosses have been made stronger and given different perks - they were simply using the bandit mage perks and their magicka was awful. They now have relevant perks (such as weapon damage) and should now be much more of a challenge.\r<br />\r<br />Ultimate bandit/reaver bosses:\r<br />\r<br />At level 64 the ultimate baddass bandits/reavers will spawn as crew leaders. These chiefs are at level 72 and will wear a full set of ebony (reavers will also use stalhrim armour) and will use ebony and glass weapons with a small chance to use a daedric weapon and/or shield (reavers will use stalhrim weapons instead of daedric). I did this because these chiefs are, to me, the most successful pillagers of their time and would be equipped accordingly. They have 1200 HP and alot of perks to make the fight a serious challenge - they&#39;re not overpowered, just very difficult.\r<br />\r<br />\r<br />\r<br />[center]== FAQ ==[/center]\r<br />\r<br />[b]Q. One of the new bandits&#39; faces is brown&#33;\r<br />[/b]\r<br />[b]A.[/b] Please let me know if you find this happening. I feel I was pretty dilligent in importing the new NPCs faces from the CK, but I may have missed one or two. If you find this has happened and you yourself have the CK, simply open the mod up in it, select the offending NPC (EncBandit03SpellswordHighElfM had this problem for me during testing) and press Ctrl+F4 and click OK on the first window that pops up and then again on the confirmation one that appears after the little process is done. If not, then again, let me know and I&#39;ll fix it.\r<br />\r<br />[b]Q. Why didn&#39;t you use the regular bandit voicetypes?\r<br />[/b]\r<br />[b]A.[/b] Because I wanted to give some love to the voicetypes that either don&#39;t or hardly appear in combat situations (FemaleYoungEager and FemaleCoward don&#39;t appear in ANY combat situations unless you attack them, which results in bounties.) Besides I think the bandit crews would sound a bit bland if they all used MaleBandit and FemaleCommoner, etc.\r<br />\r<br />[b]Q. Is this a bandit replacer?\r<br />\r<br />A. [/b]No. This does not replace any of the vanilla bandits, so rest assured, you will find refined (and heavily armoured) High Elf ladies fighting alongside the scruffy Redguards, Nords, Khajiit, Orcs and Imperials we all know and love.\r<br />\r<br />[b]Q. Why is the .esp named &#34;Orc Female Bandits&#34;? I thought this included bandits from other races (and some males too).\r<br />\r<br />A. [/b]Early in the development of this mod (like a month or so ago) I only wanted to put in Orc females. Obviously I branched out and added in some more when I started thinking about adding in some more from other races. :3\r<br />\r<br />[b]Q. Does this add in a higher set of bandits? IE, bandits that are higher level than Marauders?\r<br />\r<br />A. [/b]No, but I have thought about doing that. I&#39;m not too sure how to go about it to be perfectly honest.\r<br />\r<br />[b]Q. What does this mod require to run?\r<br />\r<br />A. [/b]Nothing, except a working and up-to-date version of Skyrim. I do have the Unofficial Patches, so I&#39;m not sure if they&#39;re needed or not.\r<br />\r<br />[b]Q. What is the future of this mod?\r<br />\r<br />A. [/b]Nothing. Mod is futureless. :3 JK, I&#39;m not sure. I might add some more Reavers to the Dragonborn Reaver lists, or I might add in higher level bandits to keep them challenging as the player levels up. Or I may not. Future isn&#39;t clear. :P\r<br />\r<br />[b]Q. A question I have about this mod wasn&#39;t in your FAQ&#33;\r<br />\r<br />A. [/b]That&#39;s ok, you can leave a comment and/or message me with your grievances, but please don&#39;t cuss me out, my self esteem is lower than the bottom of the Mariana Trench. :D\r<br />[center]== Credits ==[/center]\r<br />\r<br />Zenimax and Bethesda for creating Skyrim and the Elder Scrolls series.",
  "categoryId": "24",
  "version": "2",
  "author": "NitroGoose",
  "createdUnix": "1428769974",
  "updatedUnix": "1436202729",
  "containsAdultContent": false,
  "uploadedBy": "NitroGoose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000155398",
      "name": "Extra Bandits",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8832",
      "fileName": "Extra Bandits-64654-.zip",
      "uploadedUnix": "1428817987",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b7c6f361c631cba62acb9595f91fd7d331d5ecd7a40b1d3538aaaa8cec8af206/analysis/1428818047/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extra%20Bandits-64654-.zip?fid=1000155398&ttl=1535853285&ri=8192&rs=8192&setec=216ef10cb681a583b5973a7530870d25"
    },
    {
      "fileId": "1000166857",
      "name": "Extra Bandits version 2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "138814",
      "fileName": "Extra Bandits version 2-64654-2.zip",
      "uploadedUnix": "1436202729",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/edad7ad2e1d875a9559bf0f9bbe850d73b55aa1011ee8ea704b23e6c324f0356/analysis/1436202813/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extra%20Bandits%20version%202-64654-2.zip?fid=1000166857&ttl=1535853285&ri=8192&rs=8192&setec=7f353520530b1bde1b98fe453e2704b4"
    }
  ]
}