{
  "modId": 6469.0,
  "modName": "Game Setting Customizer",
  "summary": "Make Skyrim settings work for you. Allows you to set tons of base values: Regen rates for HP, Magicka, and Stamina (seperate values for in-combat and non-combat), Horse speed, potency for crafting skills, leveling speed (modifying the experience curve), deciding how many perks you get per level, and MANY MORE options.",
  "descriptionHtml": "------------------------------------------------------------------------------------- IMPORTANT ------------------------------------------------------------------------------------\r\n\r\nThis information is about the latest version and pertains to any Perk Related Settings. I had to switch to a dirtier way of adding new perks for leveling up cause the old way of doing it doesn\\'t work any more. Because of this, whenever you level up and should have gotten more than 1 perk, you have to close the skills menu and reopen it. It\\'s not a big problem, just a slight inconvenience.\r\n\r\nIf you have a problem with Hotkeys not working, hold the key combination down for 2-3 seconds and see if that works. I don\\'t know how to fix the delay.\r\n\r\n------------------------------------------------------------------------------------ DESCRIPTION ------------------------------------------------------------------------------------\r\n\r\nHello everyone. This mod is almost completely based off of Xodarap777\\'s XSO mod ([url=http://skyrim.nexusmods.com/downloads/file.php?id=1992]XSO - Tweaker Customizer Extender Awesomizer[/url]). They appear to have abandoned it, since they haven\\'t been active in over 2 weeks (as of the posting of this). They\\'re original mod is totally awesome in my opinion, but it had a few bugs with the latest version which made it almost completely unusable for me. Due to their permissions on that mod (which I haven\\'t been able to contact them about), I\\'ve had to code this mod completely from scratch.\r\n\r\nI have managed to replicate almost all the features in Xodarap777\\'s original mod, which can be read in the INI or on the page for their version. In order to make the transition easy, I\\'ve decided to exactly copy the variable names and sections in his INI (and actually using that as a \\'guide\\' to be sure I include everything). Doing this allows anybody that has used XSO before, to easily switch to using mine just by renaming their INI file, deleting XSO.asi, and adding mine to their Skyrim folder. If you\\'re one of these people, be sure to check the INI files that come with it for any new features that you may want to use.\r\n\r\nI usually try to test out every feature that I make, so that I know it\\'s working. If it\\'s not, please contact me and I\\'ll try to fix it.\r\n\r\nWARNING: Changing the level curve (which is determined by changing  level_base and/or level_mult in the INI), WILL cause leveling problems on characters created BEFORE using this mod. To fix this, you must use the Add Pacing Key (even if you\\'re not using perk settings) at least once EVERY TIME you change the level curve.\r\n\r\nHere are the differences between mine and Xodarap777\\'s mod:\r\n[list]\r\n[*]Mark your Follower feature was left out. I couldn\\'t figure out how he did that, but I have a feeling it was very buggy.\r\n[*]Perks at Creation works perfectly. Comments on Xodarap\\'s mod stated that it wasn\\'t working. I have recently tested it, and it works as it should.\r\n[*]Perks for bonus levels works correctly as the INI says it should. (Also stated as broken on Xodarap\\'s mod)\r\n[*]Fixed the Add Pacing Key (default CTRL+O). Xodarap\\'s version only worked on chars made before the mod (I\\'m guessing that. I\\'ve tried it on a new char, and it gave me a completely wrong result). Mine checks how many perks you have and how many unspent points you currently have and gives you any points you might be missing.\r\n[*]Max Pickpocket chance and Max Runes didn\\'t work in Xodarap\\'s mod. I have them working in mine.\r\n[/list]\r\n\r\nHere are some features I have added to my version that Xodarap777\\'s mod doesn\\'t have:\r\n[list]\r\n[*]Added a Perk Reset Key (default F12). This will completely remove all your perks, and give you the amount of perk points you should have, according to your settings in the INI file.\r\n[*]A couple features rely on checking how many perks you have currently used, but that can be broken by mods that add completely new perks (Perks that have been changed will still have the same ID, meaning it\\'s not a new perk). To fix that, there\\'s a New Perks section (with a tutorial in the ReadMe to set it up) where you set the IDs of any new perks that have been added by mods.\r\n[*]Option to disable Auto Aim.\r\n[*]Change the chance for enemies to drop weapons when dieing (Not entirely sure if this setting works right).\r\n[*]Options to change the price of each house individually.\r\nNOTE: The price stated in the dialog for buying houses will not change, but the amount of gold they take WILL match what\\'s in the INI file you use.\r\nNOTE2: The change is permanent on your save file. If you\\'re going to uninstall this mod and have changed the prices, load your game once with the GSC.ini file that came with the mod. This has all default Skyrim settings. Save your game, and the prices will be set back to normal.\r\n[*]Option to change Horse Price. I haven\\'t tested, but I\\'m pretty sure it follows the same rules as House Prices (Read the 2 notes above).\r\n[*]Customize-able difficulty if Master just isn\\'t hard enough for you =P\r\n[/list]\r\n---------------------------------------------------------------------------------- REQUIREMENTS ----------------------------------------------------------------------------------\r\n\r\nThe only thing this mod needs is [url=http://alexander.sannybuilder.com/?category=other&altname=skyrim_script_dragon]Script Dragon[/url].\r\nWithout it, no part of this mod will work.\r\n\r\n----------------------------------------------------------------------------------- INSTALLATION -----------------------------------------------------------------------------------\r\n\r\nI have packed 2 different INI files with the mod. GSC.ini has ALL default Skyrim settings. Using that file without changing anything won\\'t effect your game at all except for some of the HotKey functions. The Recommended Config file has settings changed while keeping balance in mind (Most of them were set by Xoda. Any new settings I did).\r\n\r\n1. Download Main Files. (If using Nexus Mod Manager, skip to step 3)\r\n2. Copy ASI folder into Skyrim/Data folder.\r\n3. Pick an INI file to modify. (If you want to keep the default Recommended settings, then skip to step 6)\r\n4. Copy that file and paste it in the Skyrim/Data/asi folder. (1 directory backward from where you find it)\r\n5. If you want, modify the settings in the INI. Make sure you read the comments.\r\n\t(If using the Recommended INI, don\\'t forget to rename it to GSC.ini)\r\n6. You\\'re done! Launch Skyrim and enjoy!\r\n\r\n------------------------------------------------------------------------------------ CHANGELOG ------------------------------------------------------------------------------------\r\n\r\n1.4 2/12/2012 12:40 AM\r\nFixed minor bug with Horse Speed and Whistling.\r\nAdded optional Difficulty Increase setting.\r\n\tNOTE: Only use if you want the game to be harder than Master Difficulty\r\nAdded compatability with old versions for Perk Settings.\r\n\t(Works like it used to, no need to reopen skills menu on Skyrim versions earlier than 1.3.10.0)\r\n\r\n1.3e 2/8/2012 4:48 PM\r\nFixed summon follower key and added an option to disable it.\r\n\t(Description added in updated INI files).\r\nFixed minor bug related to Perks at Creation.\r\nDownloads reorganized.\r\n\r\n1.3d 2/4/2012 11:39 PM\r\nAdded extra check to prevent negative values when using Add Pacing Key.\r\n\r\n1.3c 2/4/2012 9:13 PM\r\nFixed a minor problem related to perk settings.\r\n\r\n1.3b 2/4/2012 5:21 PM\r\nFixed minor coding issues.\r\nFixed crashed caused by Verbose messaging.\r\nLevel curve now gets updated every time GSC loads.\r\n\t(I\\'ve noticed leveling inconsistencies, but this should fix that. Using Add Pacing Key also updates it.)\r\n\r\n1.3 2/3/2012 1:28 AM\r\nAdded support for Skyrim Version 1.4.21\r\nShould be compatible with Nexus Mod Manager.\r\n\r\n1.2c 1/23/2012 9:03 PM\r\nMinor update to prevent crashing, based on user settings.\r\n\r\n1.2b 1/22/2012 11:26 PM\r\nFixed slight problem with changes to Add Pacing Key.\r\n\r\n1.2 1/22/2012 9:27 PM\r\nINI file is now optional. If you only copy the .asi file to your skyrim folder, the settings in Recomended Preconfig will be set automatically.\r\nFixed Max Pickpocket Chance and Max Runes settings. They now work as intended.\r\nAdded horse cost, house prices, drop weapon chance, and disable auto aim.\r\n\tNOTE: If you change house prices, the number in the dialog option won\\'t change, but it will take the amount of gold you set.\r\nFix for leveling bug. Add Pacing Key now fixes it and fixes your number of perks. (if use_perk_settings is set to 0, Add Pacing Key will only fix the leveling bug)\r\nModified and cleaned up some of the coding.\r\n\r\n1.1 1/20/2012 2:44 PM\r\nDiscovered timing problem with calling your horse, which causes it not to move. Fixed it now.\r\nFixed minor bug that may or may not cause you to get 0 perks when leveling up (depends on your INI).\r\n\r\n1.0b 1/19/2012 5:07 PM\r\nQuick fix\r\nMessed up something minor on Force Follower Key\r\n\r\n1.0 1/19/2012 4:42 PM\r\nInitial Release\r\nFinished testing for stability",
  "categoryId": "24",
  "version": "1.4",
  "author": "ShadowKitty42",
  "createdUnix": "1326882892",
  "updatedUnix": "1329036693",
  "containsAdultContent": false,
  "uploadedBy": "ShadowKitty42",
  "primaryFile": null,
  "files": [
    {
      "fileId": "26061",
      "name": "GSC v1_3d - Full",
      "version": "1.3d",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "187",
      "fileName": "GSC v1_3d - Full-6469.zip",
      "uploadedUnix": "1328427796",
      "modVersion": "1.3d",
      "virusScanUrl": "https://www.virustotal.com/file/e74aa406416ed3381c36a6d5628e651b127092533937ac805edec8b9f73ebae2/analysis/1406654703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GSC%20v1_3d%20-%20Full-6469.zip?fid=26061&ttl=1535763881&ri=8192&rs=8192&setec=d4f79ed048dba08c25525965595adea7"
    },
    {
      "fileId": "26062",
      "name": "GSC v1_3d - Updated ASI only",
      "version": "1.3d",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "77",
      "fileName": "GSC v1_3d - Updated ASI only-6469.zip",
      "uploadedUnix": "1328427877",
      "modVersion": "1.3d",
      "virusScanUrl": "https://www.virustotal.com/file/17cb233f72fdb8811401f03c12c3f9f27340d52bdf4a731480113f262b756259/analysis/1406654704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GSC%20v1_3d%20-%20Updated%20ASI%20only-6469.zip?fid=26062&ttl=1535763882&ri=8192&rs=8192&setec=dc2138d9c20b77e46043e4190105c313"
    },
    {
      "fileId": "27458",
      "name": "GSC v1_3e - Main Files",
      "version": "1.3e",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "90",
      "fileName": "GSC v1_3e - Main Files-6469.zip",
      "uploadedUnix": "1328751537",
      "modVersion": "1.3e",
      "virusScanUrl": "https://www.virustotal.com/file/30ed31d1465271e837cbae8ebcab9eb713f93467aeb805dcae90776e74e97d75/analysis/1406662803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GSC%20v1_3e%20-%20Main%20Files-6469.zip?fid=27458&ttl=1535763882&ri=8192&rs=8192&setec=6f71637f71ef0f75a35c762132d0fb4e"
    },
    {
      "fileId": "29476",
      "name": "GSC v1_4 Main Files",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92",
      "fileName": "GSC v1_4 Main Files-6469-1-4.zip",
      "uploadedUnix": "1329036628",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/fcdfc8cf02e12c6b254a0980a0a1986ad11cfc285af79de41a892d61dc270eb2/analysis/1406672589/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GSC%20v1_4%20Main%20Files-6469-1-4.zip?fid=29476&ttl=1535763883&ri=8192&rs=8192&setec=fbceb3b27c660dd9bac296c09d777cbc"
    },
    {
      "fileId": "29477",
      "name": "GSC v1_4 Optional Files",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "98",
      "fileName": "GSC v1_4 Optional Files-6469-1-4.zip",
      "uploadedUnix": "1329036693",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/d75ea3c055e747dfe902c858ab1c0a864aadde50ea885171921182893e42a152/analysis/1406672590/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GSC%20v1_4%20Optional%20Files-6469-1-4.zip?fid=29477&ttl=1535763883&ri=8192&rs=8192&setec=8c98c8d3704484ae06d8bdd83cd9d0e2"
    }
  ]
}