{
  "modId": 64724.0,
  "modName": "CBM - Cybernetic Companion VIKI",
  "summary": "Share your adventures with this one of a kind companion named VIKI. She may be a &#34;cyborg&#34; but she does have a mind and voice of her own.",
  "descriptionHtml": "[size=4][i][color=#f1c232][u]STATUS:[/u][/color][/i][/size]\r<br /> \r<br />- Receiving updates.\r<br />\r<br />[color=#f1c232]\r<br />[size=4][i][u]COMPATIBILITY:[/u][/i][/size][/color]\r<br />\r<br />- Hard data changes:\r<br />\r<br />* This mod only includes additions with the exception of minor changes to Riverwood, therefore compatibility should not be an issue in most cases.\r<br />\r<br />\r<br />[size=4][i][color=#f1c232][u]CONTENT GUIDE:[/u][/color][/i][/size]\r<br />\r<br />1. Mod Details\r<br />2. Planned Updates\r<br />3. Install/Uninstall\r<br />4. Bugs/Fixes\r<br />5. Q&A\r<br />6. Best Comments Wall\r<br />\r<br />\r<br />[color=#f1c232][size=5][b][u][MOD DETAILS][/u][/b][/size][/color]\r<br />\r<br />- Here are the detailed details:\r<br />\r<br />* Name = VIKI (Virtual Interactive Kinetic Organism)\r<br />\r<br />* Age = Unknown (appears to be part machine and part organic, a cyborg thus age has no meaning)\r<br />\r<br />* Personality = Enhanced Artificial Intelligence, suffers with form of amnesia however\r<br />\r<br />* Class = Techno Magus (combining magic with technology)\r<br />\r<br />* Location = Riverwood settlement\r<br />\r<br />* Requirements = VIKI will only show herself after you have the Dragonstone (is their a connection?). VIKI is no mere follower, she has a mind of her own and will often have important quests for you to complete\r<br />\r<br />* Dialogue = Inventory, Follow/Wait, Manage Arsenal, Manage Outfits, Protocols (combat tactics and spells etc), Discussions (chatter and options) and Audio Wave (play sounds)\r<br />\r<br />* Spells = Dual Sparks, Reanimation, Heal Other and Summon Elements (all configurable)\r<br />\r<br />* Perks = Mastermind, Light Footed, Critical Shot, Custom Fit, Well Fitted, Impact and Silent Roll (most perks must first be unlocked)\r<br />\r<br />* Options = Needs, Sandbox Mode, Teleport (toggles)\r<br />\r<br />* Lore = Unknown, somehow connected to the Dwemer race\r<br />\r<br />- What is VIKI?\r<br />\r<br />* Just ANOTHER drone follower to follow you around and carry all your burdens.... joke. But seriously VIKI is designed (no pun intended) not to be a mere follower but to be an actual companion with a voice and mind of her own. Even so she is also capable of adapting to be the kind of companion that YOU require... at least most of the time (she does make mistakes).\r<br />\r<br />- What is VIKI&#39;s backstory?\r<br />\r<br />* VIKI is physically fit, however the same cannot be said for her mental state. Even though she is not completely human somehow her &#34;mind brain&#34; is suffering from a form of amnesia (memory loss). The only way to learn about VIKI and recover her memories is to assist her with the quests and other tasks she hands out to you over time.\r<br />\r<br />- What are Needs?\r<br />\r<br />* Unlike most companions VIKI has a special &#34;need&#34; of you, the 4 needs are Sustenance, Energy, Temperature and Mood.\r<br />\r<br />* She must be given food now and then to satisfy her Sustenance or else her health regen will deteriorate. Should this need reach 0 then VIKI will crash requiring you to revive her.\r<br />\r<br />* During the day while outside her Energy need will recharge, however at night her Energy need will decrease. Should this need reach 0 then VIKI will crash requiring you to revive her.\r<br />\r<br />* Temperature is more dynamic and reacts to weather conditions, typically Skyrim is a cold climate hence while outside this need will slowly decrease. While inside this stat will slowly increase. This stat also rapidly increases during combat.\r<br />\r<br />* Mood is affected indirectly by your choices. While VIKI is in a good mood she will be cooperative and often humorous, however should her mood become less than satisfactory then she can be quite stubborn and vulgar.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][PLANNED UPDATES][/b][/u][/size][/color]\r<br />\r<br />[size=4][u]Official[/u][/size] \r<br />\r<br />- These are changes I will definitely include as future updates\r<br />\r<br />* \r<br />\r<br />[size=4][u]Feedback[/u][/size] \r<br />\r<br />- These are changes based on feedback which I may or may not include as updates\r<br />\r<br />* \r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][INSTALL/UNINSTALL][/b][/u][/size][/color]\r<br />\r<br />[size=4][u]Install[/u][/size]\r<br />\r<br />- Simply copy the files of your choice from the downloaded zip folder and paste them to your Skyrim application Data folder located in the Steam root directory.\r<br />\r<br />[size=4][u]Uninstall[/u][/size]\r<br />\r<br />- Delete all installed files which should be easy due to how I have organized them.\r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][BUGS/FIXES][/b][/u][/size][/color]\r<br />\r<br />* \r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][Q&A][/b][/u][/size][/color]\r<br />\r<br />- Here is where you can find the answers to the most commonly asked questions (this also means that if these questions are asked in the comments section you will be directed to this page).\r<br />\r<br />Q: VIKI allows music tracks to be played but theirs no such audio files in your download, what gives?\r<br />A: Simple, I don&#39;t and will not include any music files, you&#39;re supposed to add your own COPIES of audio files to the &#34;Data&#92;Sound&#92;fx&#92;Candoras Box&#34; folder directory (audio file must be renamed to &#34;CyberneticCompanionMusicTrack01&#34; and so on).\r<br />\r<br />Q: Sometimes when I ask VIKI to follow me she disobeys the order and even wanders off ignoring me completely, fix your damn bugs&#33;\r<br />A: Yeah-no they are not bugs, VIKI has a mind of her own and should her mood become too low she WILL start to rebel against you. Try giving her some sweetrolls or even a mug of ale ya cheap laggard.\r<br />\r<br />Q: Are you using ENB in the images that you upload for this mod?\r<br />A: Nope.\r<br />\r<br />Q: \r<br />A: \r<br />\r<br />\r<br />[color=#f1c232][size=5][u][b][BEST COMMENTS WALL][/b][/u][/size][/color]\r<br />\r<br />- A compilation of the best quotes of user comments.\r<br />\r<br />&#34;&#34;",
  "categoryId": "96",
  "version": "0.1",
  "author": "-KC",
  "createdUnix": "1428928453",
  "updatedUnix": "1428928453",
  "containsAdultContent": false,
  "uploadedBy": "Enix031798",
  "primaryFile": null,
  "files": []
}