{
  "modId": 64841.0,
  "modName": "Hunters Cabin of Riverwood - Extended",
  "summary": "Hunters Cabin of Riverwood by Okiir with a few minor changes and a few functional additions. Now requires Hearthfires DLC&#33;",
  "descriptionHtml": "This is an extension of [url=http://www.nexusmods.com/skyrim/users/1758195]Okiir[/url]&#39;s amazing [url=http://www.nexusmods.com/skyrim/mods/15878]Hunters Cabin of Riverwood[/url] with a few minor changes and additions.\r<br />It keeps the intended, simple design, without clutter and fluff. The changes are mostly functional in terms of custom storage which everyone is kinda used to nowadays (yes I blame Elianora for this trend =P)\r<br />\r<br />[b]Changes / Additions:[/b]\r<br />\r<br />[list]\r<br />[*][size=1]Lighting adjusted for ENB. I use my own customised version of [url=http://www.nexusmods.com/skyrim/mods/40088]Ruvaak Dahmaan ENB Redone[/url] so it might not look good with your ENBs. I also use monitor settings that might be different to yours as well as full RGB range setting with the new nVIDIA drivers. If you have basic CK knowledge you can just open the mod and adjust the lighting to your liking and save.[/size]\r<br />[/list][size=1]\r<br />[/size][list]\r<br />[*][size=1]Firewood pile inside, next to the fireplace is now a container for firewood.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Fireplace now has a Baking Surface which you can use to make Hearthfires DLC oven food. It is not animated. This obviously makes the Hearthfires DLC a requirement now. Special thanks to [url=http://www.nexusmods.com/skyrim/users/3231858]Elianora[/url] for coming up with this idea for her [url=http://www.nexusmods.com/skyrim/mods/58689]Eli&#39;s Shack[/url] mod. [color=#ff0000][b]Please note:[/b][/color] I did not use any of the assets from that mod. The original Baking Surface only inspired me and I made one myself, from scratch, in a similar fashion for this mod.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]The Strongbox from the loading screen treasure model on the open cupboard next to the bed was turned into an actual usable strongbox.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]The pelts inside the open cupboard next to the bed were rearranged and made into a container for such things.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]The drum next to the pelts cupboard was replace with a safe to store your valuables.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]The water keg under the bookshelf was replaced with a few alcohol bottles and turned into drinks storage.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added a knapsack and a static lute next to the bed.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added a butter churn between the bear trophy and chest. I suggest while in game replacing it with a churn from [url=http://www.nexusmods.com/skyrim/mods/25239]Berts Hearthfire Dairy Goods Upgrade[/url] using [url=http://www.nexusmods.com/skyrim/mods/52583]Jaxonz Positioner[/url].[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added 2 sacks between the bear trophy and the fireplace.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added a salt jar on top of the fireplace.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Moved the cupboard with the book shelving a bit away from the wall as it was clipping through it.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]A few tweaks related to the position of some items.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Most things are static so you don&#39;t knock them around.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added a barrel for animal remains outside next to the mammoth skull. Intended for [url=http://www.nexusmods.com/skyrim/mods/33201]Hunterborn[/url] users.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added a lantern on the table next to the tanning rack.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added a barrel for crafting supplies next to the grinding stone. Added a lantern behind it.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Replaced the anvil outside with a workbench. I think a hunter would likely repair their equipment rather than do smithing. I recommend [url=http://www.nexusmods.com/skyrim/mods/51024]Honed Metal -NPC Crafting and Enchanting services-[/url] which works well with this mod since the blacksmith is just down the road.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]The open cupboard at the stairs that had one pelt on it has been turned into a fish preparing table with some static fish and fishing items placed (unskillfully lol) on it for the aesthetics.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Turned the barrel next to the new fish table into a Fish Barrel to store your whole fishies.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Turned the sack next to the new fish barrel into storage for your raw fish meat.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added a fish rack with some harvestable fish just above the fish table area.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Removed the boat from outside as I think most users use a mod that animates those boats so it looks silly slowly bobbing upside down on land. lol[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Redid the inside Navmesh from scratch and tried to tidy up the existing one outside around the house. I think followers now move better inside the house as well as a bit more freely outside. They seem to be able to go up and down the stairs more times than not now. They still sometimes prefer to go around the long way. Tweaked the Navmesh trianle marker at the door outside so the follower enters with the player more reliably.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Changed house marker from (i forget) to the usual player home icon (shack). Made it non public as I think it might&#39;ve helped keep some of the weirdos from Riverwood walking around the house.[/size]\r<br />[size=1]\r<br />[/size][*][size=1]Added custom location in CK for the home to be able to add the right keywords so that [url=http://www.nexusmods.com/skyrim/mods/59702]I&#39;m a Customer Dammit[/url] can recognize it properly as a player home (thank you [url=http://www.nexusmods.com/skyrim/users/487712]lofgren[/url] for the tip)[/size]\r<br />[/list][size=1]\r<br />[/size][list]\r<br />[*][size=1]Changed music in the house to the default one that plays in other homes.[/size]\r<br />[/list]\r<br />All storage is safe, it will not respawn.\r<br />\r<br />This is my first mod and definitely my first attempt at most of the things I have done in this mod. I personally have no bugs in my game with the mod, inside nor outside the house. This is not to say that your game won&#39;t cause a nuclear reaction or something. &#92;_o_O_/\r<br />Same with the lighting change. It was done to work with the way my game looks so it might look like a terrible disco-tech in your game. -__- \r<br />I guess try it and see. Don&#39;t shoot the noob. :s\r<br />\r<br />[color=#8e7cc3][size=3]Acquisition[/size][/color]\r<br />\r<br />For information on how to obtain the key for the house, please visit the original mod&#39;s page [url=http://www.nexusmods.com/skyrim/mods/15878]Hunters Cabin of Riverwood[/url].\r<br />\r<br />[b][color=#6aa84f][size=3]Installation[/size]\r<br />\r<br />[/color][/b]It&#39;s just one .esp. Just drop it into your Data folder and enable it using your favorite mod manager.\r<br />\r<br />[color=#ff7700][size=3]Compatibility[/size][/color]\r<br />\r<br />The mod does not use any assets other than vanilla, thus why it only comes as an .esp, no BSAs or anything.\r<br />It should be compatible with any texture replacers and whatnot.\r<br />It most likely wont be compatible with mods that do things to the area where the house is located.\r<br />\r<br />Yes, I know my description page looks absolutely uninspiring, boring and LOL worthy... I&#39;m not creative with description pages. More of a document writing person. If I have time and I&#39;m not lazy I might make it look better in the future.\r<br />\r<br />[color=#f1c232][size=3]Known issues[/size][/color]\r<br />\r<br />None, except if you get the same weird thing I got while making this. The safe next to the bed is facing right (the small cupboard) instead of straight (the bed). This is in game, in the CK it&#39;s facing the right way. Yeah... I dunno. Maybe because my save game was in the house while I kept editing... who knows. Anyway, the fix is super easy if you use [url=http://www.nexusmods.com/skyrim/mods/52583]Jaxonz Positioner[/url] or the not-available-anymore iWant. Just select it and turn it the right way. lol\r<br />\r<br />[color=#a64d79][size=3]Permissions[/size][/color]\r<br />\r<br />For any permission regarding this mod, please ask the original author [url=http://www.nexusmods.com/skyrim/users/1758195]Okiir[/url]. As did I.\r<br />I personally don&#39;t mind whatever you might want to edit in my version yourself, but since 99.9% of the mod is not mine, you should ask the original author.\r<br />\r<br />[color=#1e84cc][size=3]Credits[/size][/color]\r<br />\r<br />Bethesda - for the game and CK\r<br />[url=http://www.nexusmods.com/skyrim/users/1758195]Okiir[/url] - for his [url=http://www.nexusmods.com/skyrim/mods/15878]Hunters Cabin of Riverwood[/url] and the permission to upload this version of his mod.\r<br />ElminsterAU, Hlp, Zilav and Sharlikran - for [url=http://www.nexusmods.com/skyrim/mods/25859]TES5Edit[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/58689]Eli&#39;s Shack[/url] by [url=http://www.nexusmods.com/skyrim/users/3231858]Elianora[/url] - for the Baking Surface inspiration\r<br />[url=http://www.nexusmods.com/skyrim/users/487712]lofgren[/url] - for his help in pointing out how to make this mod work properly with his [url=http://www.nexusmods.com/skyrim/mods/59702]I&#39;m a Customer Dammit[/url]\r<br />[url=http://www.nexusmods.com/skyrim/users/4672007]DarkFox127[/url] - for his invaluable CK tutorials which helped me a great deal.\r<br />\r<br />Hope you like the extended features of this awesome player home.\r<br />If you have any request it would have to be very minimal as I want to keep the original concept and intended look as much as possible. Keep in mind that I&#39;m a sub-amateur modder. I wouldn&#39;t even call myself modder yet. lol\r<br />Regarding any bugs, it&#39;s highly unlikely I&#39;ll be able to help unless it&#39;s something super simple. I would have to ask around myself how to do things. &gt;.&gt;\r<br />\r<br />If you like the mod and you would like to endorse, please go to [url=http://www.nexusmods.com/skyrim/mods/15878]Hunters Cabin of Riverwood[/url] and endorse there as well&#33; :D\r<br />\r<br />Cheers&#33;",
  "categoryId": "67",
  "version": "1.0",
  "author": "UV777",
  "createdUnix": "1429290945",
  "updatedUnix": "1429281249",
  "containsAdultContent": false,
  "uploadedBy": "UV777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000155974",
      "name": "Hunters Cabin of Riverwood - Extended",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "105",
      "fileName": "Hunters Cabin of Riverwood - Expanded-64841-1-0.7z",
      "uploadedUnix": "1429281249",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5a93faf6f10600731cb4f2118eb2fe81a98deeae2a6dc11f45a85f10af0642c6/analysis/1429281303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hunters%20Cabin%20of%20Riverwood%20-%20Expanded-64841-1-0.7z?fid=1000155974&ttl=1535853440&ri=8192&rs=8192&setec=41c585c0c15bdfb1a54c48496105b49e"
    }
  ]
}