{
  "modId": 64925.0,
  "modName": "The Daedra Returns",
  "summary": "The Daedra are making their move by opening a gate near Whiterun. Your help is needed Dragonborn. Give a hand to the City Watch and save the city one more time. Or play as a Dremora in Skyrim. The choice is yours.",
  "descriptionHtml": "[img]http://static-8.nexusmods.com/15/mods/110/images/64925-1-1429485427.jpg[/img]\r<br />\r<br />The next chapter can be found here: [url=http://www.nexusmods.com/skyrim/mods/78330/?]The Daedra Return 2: A Prince&#39;s Revenge\r<br />\r<br />[/url]You can watch the videos made by Serisegala to see what it looks like at run time. Thank you for posting these great videos&#33;\r<br />\r<br />[b][size=3][u]Notice[/u][/size][/b]\r<br />\r<br />[b][s]I will be uploading The Dead Deed horror quest very soon[/s] and I will work on my last mod for Skyrim, [s]Castlevania Memories Part 2 [/s]. which will be decided through a poll in my last mod. I thank all of you who endorsed and commented on my mods, to those who found bugs or incompatibility issues and such. It was great having you by my side. Now, I am in need of new equipment to work efficiently without any data loss, so as of 03/10/2015 I am accepting donations of any value as a sign of appreciation and support from fellow players. Thanks for taking time to read this notice. Happy Gaming&#33;[/b]\r<br />\r<br />[b][size=3]Update[/size][/b]\r<br />I hope I fixed the bug where soldiers of Whiterun would attack the messenger and/or the other guards. I made them neutral to the Civil War so that nothing happens if you take a side in it.\r<br />\r<br />[b][size=3]Translation[/size][/b]\r<br />For a french translation by Firt2000 visit this page: [url=http://www.nexusmods.com/skyrim/mods/71532/?]Le Retour Des Daedras[/url]\r<br />\r<br />[color=#ffff00][s]I need some of you to confirm this so that I can tell it&#39;s fully patched.[/s][/color]\r<br />\r<br />[b][size=3]Description:[/size][/b]\r<br />\r<br />[center]The Mythic Dawns are working secretly to restore the Oblivion Crisis we encountered during the previous Elder Scrolls installment. They managed to collect materials enough to open a gate to Mehrunes Dagon&#39;s Realm and they chose Whiterun as their target.[/center]\r<br />\r<br />\r<br />[b][color=#ffff00]Note: You must have completed &#34;The Way of the Voice&#34;  main quest part in order to start this quest. If you are in a new game and you speak with the Mythic Dawn traveler, just complete the above quest and load your game. It should start as expected.[/color][/b]\r<br />The basic idea is that you should know a shout or two before going in this Oblivion Gate. Some enemies are not leveled, therefore it would be difficult to 1v1 them at level less than 10. Sorry for not mentioning it from the start, I completely forgot about this detail.\r<br />\r<br />1.You will start the quest by going to a camp  outside Whiterun, just opposite of Chillfurrow farm and below the bridge that crosses the road to Riverwood/Whiterun&#39;s farms. It&#39;s the area shown in the below image. If you find it&#39;s too easy for you, just change your game difficulty. If I get many requests though, I may upload a harder version for the hardcore players.\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/64925-1-1429484964.jpg[/img]\r<br />\r<br />2.If you want to play as a Dremora, just use the console command: [b]ShowRaceMenu[/b] , or start a new game and select the Dremora as your race. \r<br />[u][color=#ffff00]You cannot do the quest if you are a Dremora, because it would be lore breaking.[/color][/u]\r<br />\r<br />See this well made trailer, made by AusGigo, to understand the concept even better : \r<br />\r<br />[youtube]-ZT0qiQQY8Y[/youtube]\r<br />\r<br />[b][size=3]Requirements:[/size][/b]\r<br />\r<br />The original Skyrim with the latest update, currently version 1.9.32.08 and the Dawnguard DLC.\r<br />\r<br />[b][size=3]Includes:[/size][/b]\r<br />\r<br />*About two hours of gameplay or less, depends on your equipment and your follower ;)\r<br />*Leveled creatures and npcs\r<br />*Four guards as companions\r<br />*An Oblivion Realm to explore\r<br />*A retextured daedric set [u][color=#ffff00]Available only to a Dremora player as he/she can buy the materials required[/color][/u]\r<br />*The option to take a follower with you during your exploring\r<br />*Rewarding chests and sacks, mostly random though\r<br />\r<br />[b][size=3]Install:[/size][/b]\r<br />\r<br />Manually: Download manually and extract the contents of the archive to your Skyrim data folder, usually found at:\r<br /> ...&#92;Steam&#92;Steamapps&#92;common&#92;Skyrim&#92;data&#92;\r<br />\r<br />NMM: Download and activate through the Nexus Mod Manager build-in system.\r<br />\r<br />[b][size=3]Uninstall:[/size][/b]\r<br />Delete the DaedraReturns.esp and DaedraReturns.bsa from your Skyrim data or deactivate the plugin-whole folder through NMM\r<br />\r<br />[b][size=3]Compatibility:[/size][/b]\r<br />\r<br />It should be compatible with any mod except the ones that alter the region near Chillfurrow and Battleborn farm.\r<br />\r<br />It is also compatible with followers from mods, but the whole system is designed for only one follower. (I don&#39;t know if there are mods with more than one follower at a time)\r<br />\r<br />About the ENB filters, I personally am not using them so I don&#39;t know if they can/will ruin or enhance the experience inside the Oblivion Gate.\r<br />\r<br />It may not be compatible with Frostfall as my exterior will not be recognized by Frostfall&#39;s mechanics (I only tested it with this at medium survival difficulty)\r<br />\r<br />[b][size=3]Known Bugs/Issues:[/size][/b]\r<br />\r<br />[s]-If you have completed the Civil War from the Stormcloacks&#39; side and Whiterun has Stormcloacks as guards, they will attack the Messenger and/or the guards outside the Oblivion Gate. This one is critical so it&#39;s advised to have a save without the Civil War quest done, until I patch it.[/s]\r<br />\r<br />-Although you can take your follower inside the Oblivion Gate, he may hit one of the guards by chance and start fighting them but they&#39;ll stop eventually.If you hit a guard two or more times, he may start fighting you without accepting a yield. Just reload your last autosave to fix this.\r<br />\r<br />-Your follower/guards may load at the Molten Caves entrance instead of the Tower of Sin entrance when exiting the said Tower. Not a serious one but I encountered it during my testings.\r<br />\r<br />-Although you get a reward for saving the guards, one or two may die by fall or burn in the lava. Consider it bad luck because this could happen even to the player.\r<br />\r<br />[b][size=3]Credits:[/size][/b]\r<br />\r<br />-To Bethesda Softworks for this awesome game\r<br />-To the Creation Kit tutorials\r<br />-To the Nifskope team\r<br />\r<br />[b][size=3]Special Thanks[/size][/b]\r<br />\r<br />Goes to Chris Wielink (sheogorath19) from TESAlliance, for his excellent nordic voice act.\r<br />To Vicn for his awesome Scamp and his Flame Elemental models.\r<br />To lati100 for his lava textures ([url=http://www.nexusmods.com/skyrim/mods/27118/?]Lava textures Resource[/url])\r<br />To MavroshStock for his lava variant ([url=http://mavrosh-stock.deviantart.com/art/Lava-Texture-Stock-197645173]Lava Texture Variant Page[/url])\r<br />To Hanaisse for her Oblivion Gate meshes and textures ([url=http://www.nexusmods.com/skyrim/mods/18957/?]Oblivion Gate Resource[/url])\r<br />\r<br />[b]Happy gaming&#33;[/b]",
  "categoryId": "35",
  "version": "1.0",
  "author": "LordKarnak",
  "createdUnix": "1429485190",
  "updatedUnix": "1436212676",
  "containsAdultContent": false,
  "uploadedBy": "LordKarnak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000156356",
      "name": "Daedra Returns v1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "120381",
      "fileName": "Daedra Returns v1.0-64925-1-0.zip",
      "uploadedUnix": "1429483023",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/98579052387966671129a7f18b9a650ae6b9df82c010705129b864fd20113128/analysis/1429483103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedra%20Returns%20v1.0-64925-1-0.zip?fid=1000156356&ttl=1535853526&ri=8192&rs=8192&setec=53c42fa754c8c0ae36159b1f46bef55b"
    },
    {
      "fileId": "1000166868",
      "name": "Daedra Returns Update",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1049",
      "fileName": "Daedra Returns Update-64925-1-1.zip",
      "uploadedUnix": "1436212676",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2c93983ec2706fafa2bd9fbd90b67d26e4df9c6e637ba8936e25dc855c96bfc4/analysis/1436212683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daedra%20Returns%20Update-64925-1-1.zip?fid=1000166868&ttl=1535853526&ri=8192&rs=8192&setec=e0cd19520a61894a99ef06e8909a2672"
    }
  ]
}