{
  "modId": 65026.0,
  "modName": "Dying Torches",
  "summary": "A FREE mod that tweaks torches to last far less than 240 seconds. This will force you to keep track of torches you have, especially in dark areas. It&#39;s a small tweak with a few options, nothing much.",
  "descriptionHtml": "Simple mod. All torches take 240 seconds to burn out and die. The problem? You&#39;re never going to hold a torch for 240 seconds. You pull it out for a bit, you see what you need to see, and you put it back in your inventory. Then when you pull it out again it lasts for another 240 seconds. I won&#39;t argue realism because Elder Scrolls has never been realistic but it&#39;s bad gameplay. You only ever need one torch to last you the entire game. So if you like the concept of prepping for adventures, being an adventurer who has to take care of their supplies rather than have the world give you infinite light and fire, this is the mod for you.\r<br />\r<br />All it does is tweak the life of torches. I got different versions too. I might implement this into bigger mods since it&#39;s such a small tweak. So for now, pick from one of many versions.\r<br />\r<br />Dying Torches 5 - lasts only 5 seconds (for those who want to be extra spooked)\r<br />Dying Torches 30 - lasts only 30 seconds (see a pattern here?)\r<br />Dying Torches 60 - lasts only 60 seconds (probably more realistic but I don&#39;t know anything about torch physics so whatever)\r<br />Dying Torches 80 - lasts only 80 seconds\r<br />Dying Torches 120 - lasts only 120 seconds\r<br />\r<br />If you have any suggestions or notice any problems, feel free to post. I&#39;ve checked the mod via Tes5Edit and everything seems ready to go.\r<br />\r<br />NOTE: Just in case one of you modders are stupid enough to not tweak basic torch settings, this mod is free and while people can do whatever they want, the only thing I will not permit is it being used in any paid mod. This mod and all mods I make will be free, stay free, and will not suffer any early access setup, timed exclusivity releases, and no money will be involved. I want people to know that my mods will always be free, no matter how big or small they get. Even if I make Akavir: Kirkbride&#39;s LoveLoreBaby DLC that surpasses all other mods, I will not accept a cent or a donation(unless someone is going to waste &#036;100 via donation on my stinking tweak mods, then I have no choice but to accept.)",
  "categoryId": "24",
  "version": "1.0",
  "author": "LegitOgre",
  "createdUnix": "1429835412",
  "updatedUnix": "1429835412",
  "containsAdultContent": false,
  "uploadedBy": "LegitOgre",
  "primaryFile": null,
  "files": []
}