{
  "modId": 65128.0,
  "modName": "Sir. Rodney Longbars Big Book of Cheats - Nexus Edition",
  "summary": "Hello, I am Ceranoe, formerly known as Sir. Rodney Longbar. This is my cheat/guide modification to skyrim that adds a set of 10 custom selections under the help menu.",
  "descriptionHtml": "This mod is a specially designed (yet slightly unorganized) set of help menu items listing from 1-10 containing all of the console commands, item id codes and small instructions on how to use them. I have personally taken all of this information from the skyrim wiki website, and compact it for easy use.\r<br />\r<br />NOTE: This is not compatible with SKYUI\r<br />\r<br />NOTE: If not all of the console commands are working/up to date, please let me know which command and/or id code is false and i shall correct it and even place your name in a credit function.\r<br />\r<br />NOTE: If there is enough demand, I shall make an abriged edition containing only mainstream cheats, and a compact edition being more organized and easier to use.",
  "categoryId": "40",
  "version": "1.0",
  "author": "Ceranoe",
  "createdUnix": "1430017217",
  "updatedUnix": "1430017145",
  "containsAdultContent": false,
  "uploadedBy": "cerano",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000157191",
      "name": "Sir Rodney Longbar&#39;s Big Book of Cheats - Nexus Edition",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "Sir Rodney Longbar's Big Book of Cheats - Nexus Edition-65128-1-0.rar",
      "uploadedUnix": "1430017145",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/41d452a0ba47b1d3ca9579072531f0470c8ae9999991bdaef0a834339e9a3469/analysis/1430017202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sir%20Rodney%20Longbar%27s%20Big%20Book%20of%20Cheats%20-%20Nexus%20Edition-65128-1-0.rar?fid=1000157191&ttl=1535853701&ri=8192&rs=8192&setec=8b5c5c3ec8684b90ec1133f65fa736ae"
    }
  ]
}