{
  "modId": 65131.0,
  "modName": "Whitewatch Outpost",
  "summary": "A modification to Whitewatch Tower - including a player home, merchant, dungeon, and 2 custom items&#33; ",
  "descriptionHtml": "[center][font=Georgia][size=6][u]WHITEWATCH OUTPOST[/u]\r<br />[/size][/font][/center]\r<br />\r<br />[center]One of my favorite early mods was making a home in that small Whitewatch patch of land near Loreius Farm or however you call it where Cicero is having a panic attack. An important part of making a new mod for me is location, location, location&#33; I&#39;m still in love with this bit of dirt, and I hope to share something grand with all of you&#33; \r<br />\r<br />The new [b]Whitewatch Tower[/b] includes now a player home fit for a Thane (and any number of titles you get). \r<br />\r<br />[img]http://i.imgur.com/Bg5JvuA.gif[/img]\r<br />[color=#1e84cc]The Whitewatch Cabin includes: [/color]\r<br />-Several functioning weapon racks and displays and shield holders. Hopefully enough for the more conservative collector.\r<br />- Four mannequins in the dining hall. Too few maybe?\r<br />- Large library in the Tower, including a regular bookcase and 3 glass cases, enchantment and alchemy tables.\r<br />- Static decor objects, such as plants and books.\r<br />- Functioning bathroom, with silly toilet and on/off shower. \r<br />- Three follower beds in the basement. Not enough for an army, but good for friends and family.\r<br />- Cooking station and several chairs for the dining table. With throne.\r<br />- Wood chopping block on the porch.\r<br />[color=#1e84cc]\r<br />Whitewatch Tower modifications - [/color]\r<br />- Besides for some minor shifting in the terrain, the original layout remains much the same.\r<br />- A well has been added, as well as a market stand and rainbarrel. Navmesh is typically the same.\r<br />- Behind the original layout I&#39;ve added a pond, curtain wall, and a Whitewatch Outpost that comes with its own Merchant.\r<br />- A big tree has also been added. We need more trees.\r<br />- I did not include things like forges or smelters, feeling that it would distract from visiting the city proper.\r<br />\r<br />[color=#1e84cc]Abandoned Mines - [/color]\r<br />- A small zone underneath Whitewatch Tower exists to store siege supplies for Whiterun, including old Ebony mines.\r<br />- Beneath the hostile zone, Lost Order Barrow exists for you to explore.\r<br />(The Barrow is exceptionally dark, I&#39;ve placed torches and Candlelight spellbooks)\r<br />- The ruins contain a special sword&#33; Only one exists, so you might need to add another to the CK if you lose it.\r<br />\r<br />The mod contains 3 custom items:\r<br />- Amulet of the High Cleric, an amulet which increases the wearer&#39;s healing rate, made to look like fine Labradorite.\r<br />- Sword of Lost Order, a 1-handed glass-level blade (although Daedric) forged from a Heart of Order.\r<br />- A newly textured door to the cabin using Dragonborn resources (hopefully doesn&#39;t need dragonborn, should be stand-alone).\r<br />[color=#ff0000]Now I do apologize [/color]if anything goes amiss, as these are my first custom item textures and meshes I&#39;ve ever worked on. I do hope they work for everyone.\r<br />\r<br />Here&#39;s a lovely video from AusGigo showcasing the lot of it&#33; ^^ Thank you&#33;\r<br />\r<br />[youtube]XX7wQNDmYdg[/youtube]\r<br />\r<br />And here&#39;s another from my favorite showcaser, Nozi87&#33;\r<br />\r<br />[youtube]dlPMddMeoV0[/youtube]\r<br />\r<br />\r<br />Installation:\r<br />- Requires the most recent Skyrim update\r<br />- No DLC&#39;s Required&#33;\r<br />- One batch to drop into your Data folder; Many meshes and texture folders to follow, hopefully in the proper order as provided.\r<br />\r<br />[color=#ff0000]Incompatibilities:[/color]\r<br />- Any mod that modifies the zones surrounding Whitewatch Tower.\r<br />\r<br />Special Thanks\r<br />- Thank you to the fine Mod Resource generals of the Nexus, including NewSeverin for static resources, Darkrdr for his paintings, Phitt and Tamira for their Sheogorad resources, the NifSkope team, and those who&#39;ve helped me piece together a smidgeon of skill to make custom items of my own.\r<br />\r<br />\r<br />I hope you enjoy, and please be forward with questions or comments on this one&#33; [/center]",
  "categoryId": "67",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1430025096",
  "updatedUnix": "1430023726",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000157197",
      "name": "Whitewatch Outpost",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18881",
      "fileName": "Whitewatch Outpost-65131-1-0.zip",
      "uploadedUnix": "1430023726",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3017a9ec62e77cc390fa8b08da2eeaeb1cbf8da74a3d69c1f46924649f20dcdb/analysis/1430023751/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Whitewatch%20Outpost-65131-1-0.zip?fid=1000157197&ttl=1535853703&ri=8192&rs=8192&setec=2e5a3c33bab43d0267ad21ce9a216b37"
    }
  ]
}