{
  "modId": 65193.0,
  "modName": "Conjure Draugrs",
  "summary": "Gives player an option to conjure draugrs in a vanilla way",
  "descriptionHtml": "[left][color=#00ff00][size=5]What the mod does[/size][/color]\r<br />[/left][size=3]Add three new conjuration spells [/size]\r<br />[size=3]-conjure Draugr (novice)[/size]\r<br />[size=3]-conjure Restless Draugr (apprentice)[/size]\r<br />[size=3]-conjure Draugr Wight (adept)[/size]\r<br />\r<br />[color=#00ff00]Features\r<br />[/color]-Summoned draugrs are undead and are influenced by respective perks\r<br />[size=3]-Spell tomes cannot be bought and can only be found in different corners of skyrim. You can find the tomes as you progress through the main and dlc questlines. (For those eager to know where the tomes are, read the readme file)[/size][size=5][left][color=#00ff00]Requirement[/color]\r<br />[/left][/size][size=3]-Dawnguard DLC [/size]\r<br />\r<br />\r<br />[size=4][left][color=#ff0000]Q:What is the purpose of this mod?\r<br />[/color]Short Answer: To provide a tank for players at the early stage of the game.\r<br />[/left][/size]\r<br />[size=3]Long Answer: Conjure Wrathman is my favorite conjuration spell. [/size]The feeling of hiding behind a strong tank and casting destruction spell is great. However, this spell comes late in the game. I always have trouble finding suitable tank to conjure before acquiring the Conjure Wrathman spell, because f[size=3]amiliar are too weak, flame Atronach tend to flee from melee battle and Frost Atronach are big and clumsy.[/size]\r<br />\r<br />[size=4][left][color=#ff0000]Q:There are other mods that add the same spell, how is this mod different from them[/color][/left][/size][size=4]I know there are already few other mods offering the same spells, but I do not like the way the spells are added to the game (not very &#34;vanilla&#34;). Moreover, the draugrs from these mods are not influenced by the conjuration perks that affect the undead, which doesn&#39;t make sense.[/size]\r<br />[size=4][left][color=#ff0000]Q: Are there expert level draugr spell?[/color][/left][/size][size=4][left]The Vanilla Wrathman is an excellent expert level undead to summon, so there is no need for expert level draugr spell.[/left][/size]",
  "categoryId": "75",
  "version": "0.9",
  "author": "soching1",
  "createdUnix": "1430111834",
  "updatedUnix": "1430111834",
  "containsAdultContent": false,
  "uploadedBy": "soching1",
  "primaryFile": null,
  "files": []
}