{
  "modId": 65214.0,
  "modName": "Bleak Falls Rest",
  "summary": "Bleak Falls Rest transforms the bandit tower outside of Bleak Falls Barrow into a live-able and cozy player-home&#33;",
  "descriptionHtml": "[center][b](This is my first uploaded mod and was something I made for myself, but I loved it so much and thought maybe some other people would like it too, so I decided to upload it. I like converting pre-exsisting structures into liveable spaces so let me know if there&#39;s a place you want me to do something similar with and I might get to do it for you&#33;)[/b]\r<br />\r<br />This mod turns the bandit tower just before reaching Bleak Falls Barrow into an abandoned, live-able player home, Bleak Falls Rest, out in the white mountain snow.\r<br />\r<br />[size=5][b]-FEATURES-[/b][/size]\r<br />\r<br />-No more bandits. Bleak Falls Rest is abandoned and yours for the taking&#33;\r<br />\r<br />-Now has location marker for easy fast travel&#33;\r<br />\r<br />-All containers are non-respawning. Light, modest amount of storage, but should be plenty for you&#33;\r<br />\r<br />-Bedroll is player-owned. Why take up space with a huge bed when a bedroll is all that is needed?\r<br />\r<br />-Small stable behind tower to keep your horse. Unfortunately, fast-traveling to BFR does not put your horse in the stable. Ride him/her to it&#33; Removed some rocks between the bridge and the mountain to make it passable on Horse.\r<br />\r<br />-Functional cooking pot to cook all of your favorite foods&#33;\r<br />\r<br />-Lovely furniture and decor like a chair looking out the window for that lovely Skyrim view, and a ornate deer skull on the outside of the threshold/doorway&#33;\r<br />\r<br />-Lots of firelit Nordic torches inside AND they have &#34;Wet and Cold&#34; heat-detection support, to help stave off the snow on your clothes and armor&#33;(There may be a spot or two inside the tower where snow will still be visible on player... sorry&#33;)\r<br />\r<br />[size=5][b]-Requirements-[/b][/size]\r<br />There should be no requirements needed. Latest Skyrim is usually a good idea though.\r<br />\r<br />[b][size=5]-Bugs/Known Issues-[/size][/b]\r<br />If you can help me figure out how ti fix an issue with an asterisk * then please tell me&#33;\r<br />\r<br />/There are a couple of small &#34;blind spots&#34; inside the tower where the &#34;Wet and Cold&#34; heat detection from the torches may not melt the snow off of the player...\r<br />\r<br />*/When fast travelling to the tower, your horse does not go to the stable, but goes awkwardly next to the player.\r<br />\r<br />[b][size=5]-Compatability/Incompatability-[/size][/b]\r<br />This should be compatable with whatever, except for other mods that alter/change the tower and it&#39;s info, area, etc. Let me know if you find any specific incompatabilities so I can list them&#33;\r<br />\r<br />[b][size=5]-Reccomended Mods-[/size][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/27563/?]Wet and Cold[/url][/center]",
  "categoryId": "67",
  "version": "1.0",
  "author": "WolffeHalon",
  "createdUnix": "1430167624",
  "updatedUnix": "1430167995",
  "containsAdultContent": false,
  "uploadedBy": "wolffehalon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000157579",
      "name": "BleakFallsRest",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "BleakFallsRest-65214-1-0.rar",
      "uploadedUnix": "1430167995",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dcac7bbdabd8577c4193125aa97938238a83d67a16e08cd91f5180c9009fd668/analysis/1430168043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BleakFallsRest-65214-1-0.rar?fid=1000157579&ttl=1535853819&ri=8192&rs=8192&setec=746bb4e871b29982246eafe2eb3f6105"
    }
  ]
}