{
  "modId": 65226.0,
  "modName": "Svalkjavik- Richards Retirement Island",
  "summary": "This is an island called Svalkjavik, owned by the Nords but located in the bay of High Rock.* \r<br />Dedicated to Gopher, and Richard. \r<br />\r<br />*According to my imagination, not Elder Scrolls lore. \r<br />",
  "descriptionHtml": "I made this mod just to test my skills as a mod maker. I mostly do landscaping and the like, so I here it is: my first upload to Nexus. Like i said in my little description, it is an island called Svalkjavik in the bay of High Rock. Its not too cold, but not too warm. But it is owned by the Nords. Hence the nordic name. I decided to dedicate this mod to Gopher; my favorite Youtuber, and wise man. So Gopher, if you&#39;re ever reading this, thanks for all you&#39;ve done&#33; Whenever Richard is ready to retire, let him know I mad him an island close to his homeland of High Rock (But not too close to the college). Let me know what you think&#33; \r<br />To everyone else: I made this for all of you as well, so feel free to make into your characters retirement island if you want. :)\r<br />\r<br />To get to Svalkjavik, there is a boat behind the mill in Riverwood that will take you there. Also, if you find the cave, the big crazy thing in the back doesn&#39;t actually do anything. It just looks cool. Gopher, if you can&#39;t seem to find Kharjo&#39;s bed, just look outside your bedroom window. P.S. I really do love Kharjo. :)\r<br />\r<br />Thanks for taking the time to whoever has read this, keep in mind this is my first mod, so if there are any mistakes or glitches or anything like that, let me know so I can fix it. There are some that I&#39;m already aware of, such as the lack of any LOD, stuck bears due to incomplete navmeshing, and the boat ride being auto load. These will be fixed soon&#33; I&#39;ll have more time in a few weeks, college life you know... Thanks, enjoy&#33;\r<br />\r<br />Warning: There is much foliage, FPS might go down a bit if your PC is not fairly decent. \r<br />\r<br />More back-story:\r<br />This island was originally made as a sample of things to come, so I will be making more mods at some point. This was the player home island that would be near the mainland, which would eventually be pretty big and have quests and NPCs and all that good stuff. I might not get around to that until the next Elder Scrolls game comes out along with its Creation Kit. We shall see.\r<br />The current NPC, Eli the Good, is a character of my own creation that will play a pretty big part of the quest. For now, he just sits in his cave. (He does act as a simple follower as well.) \r<br />I know some of you are thinking &#39;We get a tiny little shack when there&#39;s a giant temple on the other side of the bridge with a bunch of plants in it?? I&#39;m the Dragonborn&#33;&#33;&#33;&#33;&#39; Well yeah, the Greenhouse is an ancient temple that belonged to the monks*, so it&#39;s sacred ground. Eli will tell you all this one day. For now, I might write a little book and put it in the cabin explaining everything.\r<br />But for now, just enjoy the scenery&#33; :)\r<br />\r<br />*These monks don&#39;t actually exist yet, they will be in the quest line as well.\r<br />\r<br />\r<br />\r<br />\r<br />",
  "categoryId": "30",
  "version": "V1.4372.1",
  "author": "LaughingShepard",
  "createdUnix": "1430191809",
  "updatedUnix": "1430191798",
  "containsAdultContent": false,
  "uploadedBy": "laughingshepard",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000157611",
      "name": "Svalkjavik- Richards Retirement Island",
      "version": "V1.4372.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "495",
      "fileName": "Svalkjavik- Richards Retirement Island-65226-V1-4372-1.rar",
      "uploadedUnix": "1430191798",
      "modVersion": "V1.4372.1",
      "virusScanUrl": "https://www.virustotal.com/file/d300bbf0c25becc9ee540651f69d9b1df8dc947649aee0819463cc1a621ca6e3/analysis/1430191806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Svalkjavik-%20Richards%20Retirement%20Island-65226-V1-4372-1.rar?fid=1000157611&ttl=1535853829&ri=8192&rs=8192&setec=84a21c0a624d8d44d959f22c3fc37e57"
    }
  ]
}