{
  "modId": 65233.0,
  "modName": "Lvl60 Clean game save - Asswipe the High Elf Archer",
  "summary": "A clean (No Mods) level 60 gamesave with 1018 hours of play extracted from my XBOX360 after the GPU died. Legendary edition game save (ALL DLC required). Great for testing as no mods are required.\r<br />",
  "descriptionHtml": "After using mods for some time I now understand the importance of a clean high level game save and decided to share my save with the community.\r<br />This save was extracted from my 360 console after the GPU threw in the towel one night and as such has had no console commands or mods applied, as a result this save does not require any mods.\r<br />The preview image of the save even captured how the screen looked as I freaked out and saved my game. Nevertheless the save loads perfectly on PC.\r<br />\r<br />Save date 1st of July 2014. Load info is wrong as the XBOX clock was wrong. Only issue with this save is I have Draugr eyes. (Fixed with USKP)\r<br />Legendary edition so all DLC is required and no other requirements.\r<br />Follower is Illia who is heavily OP for a standard follower and she&#39;s nuts.\r<br />Dismiss her and she cant be used as a follower again, without console commands or mods such as Amazing Follower Tweaks.\r<br />I&#39;m still playing from this save today although with a female character and a lot more fun stuff :)\r<br />NOTE: If you use body mods a lot of the women will be naked, this is due to being on an xbox and finally getting the Steal Equipped Items perk.....I have some excuses but none that would stand much scrutiny.\r<br />\r<br />[b][u]BACK STORY (Just for laughs)[/u][/b]\r<br />The name Asswipe (Pronunciation: /ha:swype/) was given to him by his Khajiit foster father Fa&#39;nir who had a somewhat warped sense of humour.\r<br />He was found as a baby amongst a slaughtered carriage of high elf nobles by Fa&#39;nir and Saraya who were part of a traveling Khajiit trading caravan.\r<br />By the few dead who werent high elf one can only assume the nobles were attacked by bandits.\r<br />They decided to adopt him and raise him as their own.\r<br />As he aged with the Khajiit he learned in their ways and became proficient in their stealth abilities.\r<br />This would lead him as an adult to the career of a thief, and he was a good one, however one day he gets caught with his hands in the safe of a high nobleman with connections in the guards.\r<br />This in turn leads to the prison cart at the start of the game we all know to well....\r<br />\r<br />[b][u]STATS[/u][/b]\r<br />Level 60 High Elf male    Name: Asswipe             Play time: 1018 Hours\r<br />\r<br />Archery: 100                   Sneak: 100                   Pickpocket: 100   \r<br />Enchanting: 100              Speech: 100                 Smithing: 100\r<br />Block: 71                        Heavy Armour: 62         Lockpicking (Legendary): 74 \r<br />Light Armour: 61            Alchemy: 48                  Illusion: 46\r<br />Conjuration: 37              Destruction: 50             Restoration: 34\r<br />Alteration: 58                Two Handed: 49            One Handed 38\r<br />Carry weight: 725\r<br />Gold on hand: 123410 (another 313682 in the safes)\r<br />Follower: Illia           Player Home: Windstad Manor (and well stocked with loot)\r<br />\r<br />Quests completed:   Dragonborn, Thieves Guild, Dark Brotherhood, College of Winterhold....many many side quests.\r<br />Mainquest:   Almost-Up to Twilight Sepulcher, I couldnt bring myself to give back the skeleton key.\r<br />Quests unstarted:   Dawnguard, Companions and the whole warewolf thing.\r<br />\r<br />[b][u]INSTALLATION\r<br />[/u][/b]Extract the contents of the ZIP to your &#92;Documents&#92;My Games&#92;Skyrim&#92;Saves folder.\r<br />\r<br />I uploaded this save for testing purposes but is also useful for play with vanilla custom high level enchanted weapons and armour.\r<br />Enjoy&#33;&#33;",
  "categoryId": "43",
  "version": "",
  "author": "EutecticEuphoria",
  "createdUnix": "1430224892",
  "updatedUnix": "1430224460",
  "containsAdultContent": false,
  "uploadedBy": "EutecticEuphoria",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000157653",
      "name": "Save759 Asswipe the High Elf",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7824",
      "fileName": "Save759 Asswipe the High Elf-65233-.zip",
      "uploadedUnix": "1430224460",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c7ba328bf0bc3c6e37971cecd384ea21a364be6a16259f5a6de0ab1691ca7859/analysis/1430224508/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Save759%20Asswipe%20the%20High%20Elf-65233-.zip?fid=1000157653&ttl=1535853840&ri=8192&rs=8192&setec=23dd0565bee135f8b7784f521e90e752"
    }
  ]
}