{
  "modId": 65270.0,
  "modName": "Books of Treeton",
  "summary": "Adds a few books as a teaser for a larger mod I am working on. The aim of these books is to set the tone for the mod, and to provide some lore to perhaps provoke some interest. ",
  "descriptionHtml": "[size=5]Books of Treeton[/size]\r<br />\r<br />   [size=4]What is a Treeton and is this a Pokemon Mod?[/size]\r<br />\r<br />      Treeton is the name of a town mod I am working on, Treeton being the town. I have been working on the lore, story, characters and quests for a long time and finally decided to do something about it rather than continue writing fake history books in notepad. The town is a long way off, as I am still learning the ropes of Skyrim modding, going from something like Source into the Creation Kit hasn&#39;t been the smoothest transition but I&#39;m determined to get this mod out there. \r<br />\r<br />\r<br />   [size=4]Okay that&#39;s great, so where is it and what will it be about?[/size]\r<br />\r<br />      Treeton is a small Breton settlement off the shores of Lake Ilinalta, underneath a gigantic tree which became the focal point of the settlement. The books go into greater detail of the Tree&#39;s history and the settlement (at the moment there are only two implemented but more will be coming while I fumble my way through the Creation Kit). The mod itself will revolve around two factions within the town and a conflict with the nearby Falkreath. At the moment it has 15 planned main characters, four planned endings and a lot of quests. \r<br />\r<br />   [size=4]So what is this mod then? [/size]\r<br />\r<br />      This mod is pretty much a teaser, a quick little taste of what&#39;s to come. Hopefully, if I can get it together. When I need it, I may well enlist the help of any volunteers, voice actors and the like. If not then I&#39;ll take the more traditional approach of text walls, either way this remains as just a little taste, like if a chef came out and gave you a morsel of food and you were like &#34;hey man, that&#39;s cool, where&#39;s the rest&#34; and the chef is like &#34;haven&#39;t made it yet, I mean I am planning on making it but I thought I&#39;d do a little morsel to entice you&#34; then you punch the chef in the face. There are two books in the mod so far but I am planning on adding more as I write and edit some more fake history books and even some stories/legends. But for now, I ask you to have faith, and not get outraged because a free mod only added two books to the game.\r<br />\r<br />   [size=4]HOLD THE DAMN PHONE&#33; Where did you put the books?&#33;[/size]\r<br />\r<br />      [size=2]The books can be found in the Sleeping Giant Inn in Riverwood, they&#39;re sitting on the tables in the inn (kill me) and are available for light reading.[/size]",
  "categoryId": "98",
  "version": "0.2",
  "author": "The Level 99 Woodcutter",
  "createdUnix": "1430274707",
  "updatedUnix": "1430276987",
  "containsAdultContent": false,
  "uploadedBy": "SergeantWTF",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000157758",
      "name": "Books of Treeton 0.1",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Books of Treeton-65270-0-1.zip",
      "uploadedUnix": "1430274694",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/c444314f9c25d19516142cf9a29fd2ac9347bb2f2bccfbae4c6d89a453676f80/analysis/1430274722/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Books%20of%20Treeton-65270-0-1.zip?fid=1000157758&ttl=1535853876&ri=8192&rs=8192&setec=16bf3c268d99fbf21ce4102a8edbf03c"
    },
    {
      "fileId": "1000157759",
      "name": "Books of Treeton 0.2",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Books of Treeton-65270-0-2.zip",
      "uploadedUnix": "1430276987",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/06139a0bb931c567c7e326ce6f45c6f944a92cfd531059990f58ce7e81bd2cc9/analysis/1430277002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Books%20of%20Treeton-65270-0-2.zip?fid=1000157759&ttl=1535853877&ri=8192&rs=8192&setec=aa5e7132f31c88bf360e6a8f8f3a3669"
    }
  ]
}