{
  "modId": 65315.0,
  "modName": "Paid Mod War Memorial",
  "summary": "Collaboration of mods remembering the paid mods of 2015",
  "descriptionHtml": "There has been lots of strong feelings over the weekend people feeling angry and betrayed, some of this anger unfortunately taken out on other modders who didn&#39;t deserve the hate they were receiving. There were also some really hilarious mods made in protest of this and now that it&#39;s finished a few of us just wanted to make a little memorial of the event with a collection of some of the mods involved. The point of these joke mods that were made was not to attack actual mod makers who put hours or days into their mods but rather to point out how the system put in place was a bad idea and how, as proven before with green light, unmoderated content leads to a lower quality of items. \r<br />This mod is just a bit of fun and you shouldn&#39;t take it too seriously, download it, save it, do whatever you want but don&#39;t dwell on it too long we don&#39;t want to be taking attention away from actual mods that people have spent time on. The voice of everyone (even bob) was heard and all we can do is hope that the reason for taking this down was genuine and Lord GabeN has not forsaken us, but for the future please think about what content you are supporting and make sure that things you are buying is actually worth it and deserving of your money, lest something like this happen again. And as for the modders who did try out this new system, I am sure many would have taken the offer if given to them so don&#39;t go attacking them and do still support their content. Hopefully this event has encouraged people to support content creators more and they will be seeing an increase to their personal donation pages. \r<br />\r<br />So anyway, on with the mod&#33; \r<br />\r<br />=====Paid Mod War Memorial===== \r<br />\r<br />Currently in this mod is: \r<br />\r<br />Rubbish&#33;- Ever feel that skyrim is too neat? particularly in one specific area of the game? Well no longer is that the case&#33; Rubbish adds 6 new useless items and even a bucket to keep them in&#33; \r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=431321757]http://steamcommunity.com/sharedfiles/filedetails/?id=431321757[/url] \r<br />\r<br />Extra and outstanding apples- Ever feel you are losing immersion and have no idea why? Well 1337sc0p3s figured out why in his incredible mod. The whole time it was the lack of apples&#33; This his mod he adds an extra apple to the game, however, this was taken further with the outstanding update where the apple now stands proud and defiant. \r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=432039604]http://steamcommunity.com/sharedfiles/filedetails/?id=432039604[/url] \r<br />\r<br />Gaben&#39;s Deuce- An item you will also find is knivesalot&#39;s Gaben&#39;s Deuce. Handling Gaben&#39;s Duece used to be an easy task, but with this money grabbing update, you&#39;ll learn that Gaben&#39;s Duece is one heavy load. Ask yourself, how much are you willing to pay to carry Gaben&#39;s Duece? \r<br />[url=http://steamcommunity.com/sharedfiles/filedetails/?id=433462481]http://steamcommunity.com/sharedfiles/filedetails/?id=433462481[/url] \r<br />\r<br />Give Me Money For No Reason- Tired of carrying all that gold? Well the poor beggar Beth has turned up at the memorial with nothing but her fine clothes and jewelry. Rain or shine you can find nerdofprey&#39;s beloved beggar out there begging for more money with a smile on her face. \r<br />[url=https://steamcommunity.com/linkfilter/?url=http://www.nexusmods.com/skyrim/mods/65034/?]http://www.nexusmods.com/skyrim/mods/65034/?[/url] \r<br />\r<br />Golden Potato- Enjoy a potatoes but feel like a peasant or console gamer for eating them. Want something more fitting for a glorious PC gamer? Well worry not, in this mod you can find yourself a gleaming 24 karat(potato) potato to satisfy your hunger. \r<br />\r<br />These items are added to a location known as &#34;Paid Mod War Memorial&#34; (once known as Gjukar&#39;s Monument) to the west of whiterun. The memorial holds reminders of each of the mods involved and plays &#34;The Force Theme&#34; when you are near by. \r<br />\r<br />=====To other mod makers===== \r<br />\r<br />Thanks to the creators of theses mods, some who did not want to be mentioned by name, and thanks to everyone else who created some hilarious content. \r<br />\r<br />Due to the nature of steam I did try, but struggled, to contact some people so if you made a mod and would like to add it to the memorial please contact me, though if it is a mod that changes large amounts of the game I will have to find a why to mention it without including the full mod as we wanted this to be something people could have on without affecting the rest of the game",
  "categoryId": "28",
  "version": "1",
  "author": "cheapbuster",
  "createdUnix": "1430362987",
  "updatedUnix": "1430362987",
  "containsAdultContent": false,
  "uploadedBy": "cheapbuster",
  "primaryFile": null,
  "files": []
}