{
  "modId": 65383.0,
  "modName": "Breezehome TNF Expanded",
  "summary": "Yet another Breezehome mod based off of GoatK&#39;s Breezehome The Noble Family.  Now its a little bigger, sleeps eleven and redecorated.  A true home for a thane, friends and family.",
  "descriptionHtml": "                            \r<br />                I know I know, yet another Breezehome mod\r<br />\r<br />\r<br />\r<br />                                                                                 Breezehome - The Noble Family Expanded\r<br />\r<br />                                                                                                 by Woodtortiose\r<br />\r<br />\r<br />  \r<br />                   I have always preferred living in Whiterun, with its central location and plenty of vendors close by, but vanilla Breezehome left alot to be desired.  Of all the Breezehome mods out there, I always preferred GoatK&#39;s Breezehome The Noble Family.  It gave you plenty of extras while still feeling cozy and warm, a home fit for a Thane.  Alas I am a greedy person, and after a playthrough with BHTNF, I couldn&#39;t help wanting just a bit...more.  More beds, more room, and a pool you could actually swim in.  Yeah, a pool, sue me.  I wanted a home that felt decadent yet lived in, where the furniture was nice but there were clothes strewn on the floor.  A house I could populate with my spouse, kids and companions (especially with all those great mods out there like Vilja and Interesting NPCs).  I wanted all this without a sprawling McSkmansion, something that still felt small and cozy.  However, I was a complete Creation Kit noob, so I posted a mod request to see if anyone else was interested.  I was lucky enough to get a response&#33;  Proxy7Proxy graciously agreed to take on the effort, and he spent a week or two working on it before real life stuff demanded his time.  He passed it back to me, and I was left with the choice to let it die or man up and learn the CK.  So, after lurking here on the Nexus since almost the day it started, enjoying everyone elses wonderful work on many different games, I decided to make an attempt to contribute.  A hundred plus hours later, here it is.  Please bear in mind that for the most part this is simply a redecoration to my own personal tastes.  There are no tricked out wizard auto sorters, teleporters, bold original textures, special quests, or original anything.  Everything not vanilla is from one of the popular modders resources listed below, so you&#39;ll likely see something that you&#39;ve seen in other house mods.  That said this is pretty much my vision of a perfect cozy home where eleven people can live comfortably. Multiple adoption compatible.\r<br />\r<br />       *Some of the screenshots were taken using the textures from the &#39;Sexy Whiterun&#39; mod.\r<br />       *Cleaned with TES5Edit\r<br />\r<br />\r<br />  Features:\r<br />\r<br />      *Note/Disclaimer - Most of these &#34;Features&#34; are static and are there for role-playing purposes and atmosphere only&#33;  They can&#39;t be interacted with.  The telescope does not actually zoom in on the Whiterun plain, and there are no clothes washing animations to go along with the scrubby tub (though how cool would that be?).  \r<br />\r<br />\r<br />   - Unsatisfied with their Breezehome purchase, our Dragonborn hired some miners to delve beneath the streets of Whiterun and enlarge their home.  Now the home is about 50% bigger.\r<br />\r<br />   - Bathing area - This area is a spot to soak after a hard day adventuring, dip into the pool, clean those damn blood stains out of your clothes, etc, etc.  Includes a small pool and bathroom with a toilet.\r<br />\r<br />   - Crafting area - with the &#34;magic room&#34; (containing the alchemy and enchanting stations) now adjacent to the smithing room, making and enchanting that iron helm is convenient and easy.\r<br />\r<br />   - Companions room - An expansion of Lydia&#39;s quarters, this is now a space for up to five of your adventurer friends to hang their hats, wipe off the dust of the latest dungeon, repair their armor, and most importantly, let off steam&#33;  Full of food, alcohol, instruments, etc, this is a room of merriment and joy.  Kids are welcome of course, but you might want to send them to bed early&#33;\r<br />\r<br />   - Kitchen - As dragonborn, the person personally responsible for saving Whiterun from the dragon onslaught, naturally the farmers from the surrounding areas are extremely grateful.  As a result of their  daily contributions, you now possess a larder that&#39;s the envy of every inn in the land&#33;  Since your companions love to cook in their downtime, expect plenty of delicious treats around&#33;\r<br />\r<br />   - Kids Room - Truly tricked out kids bedroom with beds for four adopted children (I know the multiple adoption mod allows you to adopt six kids, but really, even the orphanage only has five kids, and you&#39;re the Dragonborn with more stuff to do then spend all your time raisng kids - that and I couldn&#39;t really find a way to fit six beds in without just cramming them in there.  Cross your fingers that someone someday will make working bunkbeds&#33;).  Actually feels like a kids room, full of toys and clutter and everything your own kids room has, including a working fishtank&#33;\r<br />\r<br />   - Master bedroom - not all that different from the original BHTNF, except no swords on the headboards (who are we, Damocles?), no bowl of potatoes on the end table (really?  Are they sex toys?  Potatoes?  Raw potatoes as a bedtime snack?)\r<br />\r<br />   - Secret Room - With ...\r<br />\r<br />   - Lots of clutter, plants, and small details to make thorough exploration fun&#33;\r<br />\r<br />   \r<br />\r<br />\r<br />\r<br />   Requirements\r<br />\r<br />   This mod requires the latest Skyrim and all the DLCs.\r<br />\r<br />\r<br />\r<br />   Installation\r<br />\r<br />   Pretty basic, just put the esp and mesh, texture, script and sound folders into your data folder and tick the esp from your launcher menu or wrye bash or whatever.  I haven&#39;t tested adding this mod midgame, but as long as you remove all your stuff, uncheck the previous Breezehome mod (if you used one), make a clean save, you should be fine.  Remember to keep a clean save, just in case something goes terribly, terribly wrong.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />   Conflicts\r<br />\r<br />   This will obviously completely conflict with any mod making changes to Breezehomes interior, so pick only one.  This mod does not require the original BHTNF mod (though I strongly suggest checking it out, as well as the two or three other remakes out there).  Also, this mod may conflict with any mod making changes to the exterior immediately surrounding Breezehome.  For example, the &#39;Towns and Villages Enhanced - Whiterun&#39; mod adds lots of trees and flora to Whiterun, so you will find trees in your veggie garden and inside the tower.  If you have basic familiarity with the CK, you can open up that mod and delete the trees surrounding Breezehome and the two will play nicely together.  This is highly recommended because TAVE-Whiterun is an awesome mod that greatly improves the Whiterun atmosphere.  Mods that are just texture replacers, like &#39;Sexy Whiterun&#39; (also highly recommended, see screenies) won&#39;t conflict at all.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />    Known Issues/Bugs\r<br />\r<br />\r<br />    1.  You must become Thane and purchase Breezehome and all of its upgrades before entering for the first time&#33;  You also have to pick the childrens room instead of the alchemy room&#33;\r<br />\r<br />    Again, you must become Thane and purchase Breezehome and all of its upgrades before entering for the first time&#33;  You also have to pick the childrens room instead of the alchemy room&#33;\r<br />\r<br />\r<br />    Why can&#39;t I enter after purchasing a few or no upgrades?  This isn&#39;t an issue in the original BHTNF mod, nor with the BedsPlus or Elianora&#39;s versions&#33;  \r<br />     \r<br />    The answer is simple.  Those guys are immensely better modders than me. You see, I couldn&#39;t find a tutorial explaining how events work.  Buying an upgrade is an event, and this event triggers things like furniture and statics popping into place in the home. So purchasing the home without all the upgrades and entering will make things that I placed on a table, one that isn&#39;t there yet, fall to the floor or simply float.  I realize this is a pretty big flaw, and should I ever come across a decent tutorial I will address it.  For now it is what it is.  You must become Thane so the stuff in the housecarls room shows up.  Also, for some reason in my game I&#39;ve had the problem with Proventus Avenicci not selling me all the upgrades at once.  If you buy the home and upgrades when they first become available, just after the Jarl tasks you with investigating the western watchtower, he won&#39;t offer the bedroom upgrade, nor the choice to turn the kids room into an alchemy room.  If you wait until you&#39;ve killed the dragon and become thane, this isn&#39;t an issue.\r<br />\r<br />  \r<br />  2.  That&#39;s all I can think of.  Please let me know if you discover another.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />         Credits and Thanks\r<br />\r<br />     This is important, because its these folk&#39;s hard work that made this mod possible.  I was truly standing on the shoulders of giants.  Should you like this mod enough to want to give an endorsement or kudos, don&#39;t worry about me, send it to these guys and their mods instead.  All of the resources listed below can be found here on the Nexus or at TESAlliance in the resources category.\r<br />\r<br />     *Another disclaimer - having never actually met or spoken with any of these people, should I improperly use a gender specific pronoun (his, hers etc), please forgive me (and let me know so I can correct it).  I&#39;m going by instinct here.\r<br />\r<br />\r<br />   - Proxy7Proxy - Even though I ended up starting over from scratch (twice&#33;) and none of his work actually ended up making it into the final version, without his effort I never would have found the motivation to finish it.  This mod exists because of him.  Cheers amigo&#33;\r<br />\r<br />\r<br />   - GoatK - Obviously.  The creator of the original and incredible BHTNF mod, his work and gracious permission to allow anyone to tinker with it, what can you say?  Helluva guy, Thanks&#33;\r<br />http://www.nexusmods.com/skyrim/mods/31222/?\r<br />\r<br />\r<br />  - Nonoodles - For answering my mod request and altering the outhouse mesh by Stroti and turning it into an indoor stall.  This  pioneer singlehandedly brought indoor plumbing to Skyrim&#33;  She was also kind enough to beta test and solved a huge bug for me, for which I am incredibly grateful.  Kudos&#33;\r<br />\r<br />\r<br />   - Tamira - For all her work, particularly the windchimes, and for being kind enough to answer a noobs question or two.  She has collaborated with all these folks to bring all these cool things to    Skyrim.\r<br /> \r<br />   Tamira & Arion - Teddy bears.  Gotta love these things.\r<br />http://tesalliance.org/forums/index.php?/files/file/1232-teddybears/\r<br />\r<br />   Tamira & Stroti - The outhouse, craftsmens tools (the woodworker in me was so stoked to find these),  kitchen tools, bathroom mirror, kitchen sink, log cabin, pears, chairs, etc, etc.\r<br />http://tesalliance.org/forums/index.php?/files/file/1591-strotis-kitchen-tools/\r<br />http://tesalliance.org/forums/index.php?/files/file/1527-stroti-resource-pack/\r<br />http://tesalliance.org/forums/index.php?/files/file/1519-strotis-manor-resource/\r<br />http://tesalliance.org/forums/index.php?/files/file/1503-strotis-castle-furniture-resource/\r<br />http://tesalliance.org/forums/index.php?/files/file/1472-strotis-outdoor-toilet-resource/\r<br />http://tesalliance.org/forums/index.php?/files/file/1607-strotis-craftsman-tools/\r<br />http://tesalliance.org/forums/index.php?/files/file/1333-strotis-old-cabin-resource/\r<br />http://www.nexusmods.com/skyrim/mods/35838/?\r<br />\r<br />   Tamira & Walery Nowak - The adorable rocking horse\r<br />http://tesalliance.org/forums/index.php?/files/file/1240-rockinghorses/\r<br /> \r<br />   Tamira & Phitt - The fishtank.  Seriously.  See if you don&#39;t stop for a minute or two everytime you pass it.                                \r<br />http://tesalliance.org/forums/index.php?/files/file/1833-phitts-fishtank/\r<br />    \r<br />   Tamira & Yughues - For the bamboo\r<br />http://tesalliance.org/forums/index.php?/files/file/1305-new-plants/\r<br />\r<br />   Tamira & Lycanthrops - The roses.  And another shout out to Lycanthrops for his work on the incredible Vilja mod.\r<br />   Tamira & McMuffin - Skooma pipes.  Can&#39;t go wrong with anything from Morrowind.\r<br />http://tesalliance.org/forums/index.php?/files/file/1789-assorted-resources/\r<br />http://tesalliance.org/forums/index.php?/files/file/1861-static-dishes-and-food-resource/\r<br />\r<br />\r<br />  - InsanitySorrow - The wealth of resources this guy has given the community is staggering.  Look for his stuff everywhere in the house, stuff like blankets, pillows, soap, towels, sofa, washing stuff, clutter, tapestries, etc, etc.\r<br />http://tesalliance.org/forums/index.php?/files/file/1464-insanitys-sofas-chairs/\r<br />http://tesalliance.org/forums/index.php?/files/file/1452-insanitys-folded-blankets/\r<br />http://tesalliance.org/forums/index.php?/files/file/1448-insanitys-bath-towels/\r<br />http://tesalliance.org/forums/index.php?/files/file/1433-insanitys-rugs/\r<br />http://tesalliance.org/forums/index.php?/files/file/1429-insanitys-pillows/\r<br />http://tesalliance.org/forums/index.php?/files/file/1427-insanitys-junk-yard/\r<br />http://tesalliance.org/forums/index.php?/files/file/1325-insanitys-washing-stuffs/\r<br />http://tesalliance.org/forums/index.php?/files/file/1319-insanitys-clutter-stuffs/\r<br />http://tesalliance.org/forums/index.php?/files/file/1203-insanitys-food-stuffs-resource/\r<br />http://tesalliance.org/forums/index.php?/files/file/1182-soap-resource/\r<br />http://tesalliance.org/forums/index.php?/files/file/1771-tapestry-stuffs/  \r<br />\r<br />\r<br />  -Lazz - For the Display modders resource that solved a big headache for me\r<br />http://www.nexusmods.com/skyrim/mods/59596/?\r<br />\r<br />\r<br />  - Darkrider, Windmill Tilter, Howard David Johnson & Schattenlos - The very cool Celtic Decor paintings\r<br />http://www.nexusmods.com/skyrim/mods/12394/?\r<br />\r<br />\r<br />  - FPI team - Experiment Pack1 1.1 - an immense resource, these guys have given us so much.  A small sampling of the resources I used include the nord warhorn, dragonstone, dwemer lexicon, goat cheese wheel, terrarium, gildergreen bonsai, etc etc.  Seriously, if your a modder check these guys out.\r<br />http://tesalliance.org/forums/index.php?/files/file/1597-fpi-experiment-pack-1/\r<br />\r<br /> \r<br />  - Blary - For the food containers, potion shelf, ingredients in a jar.  Made the kitchen and alchemy rooms so much cooler.\r<br />http://www.nexusmods.com/skyrim/mods/14133/?\r<br />http://www.nexusmods.com/skyrim/mods/30601/?\r<br />http://www.nexusmods.com/skyrim/mods/14136/?\r<br />\r<br />\r<br />  - Artisanix - Cool paintings with your choice of frames&#33;\r<br />http://www.nexusmods.com/skyrim/mods/17423/?\r<br />\r<br />\r<br />  - Oaristys & Tony67 - Modders Resource Pack, lots of cool stuff in here, including the junk chest, flower baskets, dwemer head, key rack, dish and cup sets, cheeseboard, ingredients shelf, planters, etc, etc.  This awesome resource pack should be part of every house modders collection.\r<br />http://www.nexusmods.com/skyrim/mods/16525/?\r<br />\r<br />\r<br />  - Lilith - For the fantastic veggie and sewing baskets \r<br />\r<br />\r<br />  - Hoddminir - For the awesome plant and tree pack.  Look for the junipers and lilac outside, the birch and water lilies inside.\r<br />http://www.nexusmods.com/skyrim/mods/38651/?\r<br />\r<br />\r<br />  -Tueffelachtein - For the Modular Crafting Table.  Thanks for making this great resource so user friendly.\r<br />http://www.nexusmods.com/skyrim/mods/36499/?\r<br />\r<br />\r<br />  -Stoverjm - for the very cool open book meshes and textures.  Something sadly lacking in vanilla.\r<br />http://tesalliance.org/forums/index.php?/files/file/1605-open-books-library/\r<br />\r<br />\r<br />  - WillieSea - For the mirror sculpt script and a few paintings from his mind boggling levellers tower.\r<br />http://www.nexusmods.com/skyrim/mods/14152/?\r<br />\r<br />\r<br />  -Jackstar - For the ABCs for Barbarians book\r<br />http://www.nexusmods.com/skyrim/mods/12270/?\r<br />\r<br />\r<br />    And of course, Bethesda.  Been with you guys since Morrowind, which btw is still the best game ever made&#33;\r<br />\r<br />    *I made a sincere effort to credit everyone but if I missed someone, please let me know and I will correct it.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />              Permissions\r<br />\r<br />         Under no circumstances can this priceless and completely original work be altered, used as a resource, copied, pasted, uploaded, or looked at funny.  Its has been copyrighted and patented in 47 countries and all violators of said contract will be subject to full criminal prosecution, the penalty being sentenced to five years to the tiny room underneath my privy.  In fact, don&#39;t even download it&#33;\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />      Nah, just kiddin.  Do whatever you want with it, provided you credit any of the folks whose resources you use.",
  "categoryId": "67",
  "version": "1.1",
  "author": "Woodtortiose",
  "createdUnix": "1430576243",
  "updatedUnix": "1437670674",
  "containsAdultContent": false,
  "uploadedBy": "woodtortiose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000168950",
      "name": "Breezehome The Noble Family Expanded Ver. 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "154893",
      "fileName": "Breezrhome The Noble Family Expanded Ver. 1.1-65383-1-1.7z",
      "uploadedUnix": "1437670674",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/cbe917425c3c1c655d722cbefa608129e8d755923afbd70b5004b975a7cacd14/analysis/1437670834/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezrhome%20The%20Noble%20Family%20Expanded%20Ver.%201.1-65383-1-1.7z?fid=1000168950&ttl=1535853986&ri=8192&rs=8192&setec=15bd22fc8943c1a2d4709afc1f7e3906"
    }
  ]
}