{
  "modId": 65436.0,
  "modName": "Seasons of Tamriel and Fantasy SweetFx Presets",
  "summary": "This is a set of SweetFx presets that are based on AceeQs Climate overhuals and some Fantasy Based ones Like DreamLike ",
  "descriptionHtml": "This is my own SweetFx Presets based on AceeQ Climate overhuals With presets like Tropical Winter and Summer as well as some other Presets like Dreamlike and Cinematic. \r<br />\r<br />these presets can run on low End pcs like mine and don&#39;t use effects like HDR and Bloom which are high performance taxing and \r<br />when used in combination can be about the same performance as high performance enbs. \r<br />\r<br />\r<br />my computer is a Mac mini &#34;Core i5&#34; 2.3 Mid-2011/Aluminum Unibody with a HD 3000 Graphics card and 16 GB ram so you see not that great. but remember as long as you can play this game with thirty fps you should not see any fps drop \r<br />\r<br />\r<br />Currently i have the summer tropical winter and Dreamlike ready and are working on new versions \r<br />\r<br />\r<br />i love feed back if anyone has ideas or has made some changes to the presets that they think is good then send then my way\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />installation \r<br />\r<br />first download manual and extract main files into skyrim install directory not data folder\r<br />\r<br />Then select the preset you want to use and extract it to the install directory \r<br />\r<br />Then Enjoy\r<br />\r<br />\r<br />\r<br />\r<br />Q&A\r<br />\r<br />Q i can&#39;t take screen shots with this preset without it looking like Vanilla Game \r<br />\r<br />A you can&#39;t take screen shots with the Print screen button for some reason i&#39;m working on fixing that but you can take screen shots with software like Fraps\r<br />\r<br />Q it&#39;s not doing anything and it looks the same \r<br />\r<br />A make sure you extracted all the files into the install directory not the data folder the install directory is also where the TESV.exe is \r<br />\r<br />\r<br />Q i want to get rid of Vignette\r<br />\r<br />A go into the SweetFX_Settings_ file and edit #define USE_VIGNETTE           1            // [0 or 1]\r<br />                                                              to  #define USE_VIGNETTE           0            // [0 or 1]\r<br />\r<br />\r<br />\r<br />Credits \r<br />\r<br />Kputt and Elsopa for there presets i used some of the settings for my presets \r<br />Ceejay for Sweetfx\r<br />\r<br />anyone i forgot \r<br />\r<br />\r<br />(man making mods are tough)",
  "categoryId": "62",
  "version": "1.0",
  "author": "Angel j",
  "createdUnix": "1430622651",
  "updatedUnix": "1430622651",
  "containsAdultContent": false,
  "uploadedBy": "Angelfireslassers",
  "primaryFile": null,
  "files": []
}