{
  "modId": 65439.0,
  "modName": "WIP ETca and JK Merge and Visual Compatibility Fix",
  "summary": "I hated that both mods together looked wired and everything is overlapping and there shields floating around and moss just hanging mid air. Also the random rocks and fences that break the flow and does not belong when combining the two. There should not be any stability problems. Riverwood is the only one done for now.",
  "descriptionHtml": "I hated that both mods together looked wired and everythingis overlapping and there shields floating around and moss just hanging mid air.\r<br />Also the random rocks and fences that break the flow and does not belong when\r<br />combining the two. There should not be any stability problems. Riverwood is the\r<br />only one effected for now.\r<br />\r<br />[b][u]Installing Instruction:[/u][/b]\r<br />1)Download [url=http://www.nexusmods.com/skyrim/mods/61035/?tab=3&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D61035%26gid%3D110]Jk&#39;s Skyrim by Jkrojmal and Teabag86[/url]I and [url=http://www.nexusmods.com/skyrim/mods/13608/?tab=3&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D13608%26gid%3D110]Expanded Towns and Cities by [b]missjennabee[/b][/url] (complete edition)and ETca and JK Merge and Visual Compatibility Fix  (this mod =) )\r<br />2)Install all three mods\r<br />3)Then make sure that only ETac-JK M&VCF.esp is active and JKskyrim.esp and ETac -\r<br />Complete.esp are not activated leave Etac-Resources.esm active.\r<br />4)Then play the game and enjoy the beauty of the two mods.\r<br />[u]\r<br />[size=4]Done[/size]:[/u]\r<br />Riverwood 90% ( It is pretty much done but there maybe some more polish and testing the navmesh)\r<br />Whiterun 99.9% (I combed through all of white run and it looks good)\r<br />\r<br />\r<br />[b][u][size=4]Working On Now:[/size]\r<br />[/u][/b][size=3]Falkreath: \r<br />All I have to say is dam theirs a lot of work here. Both mods add tons of stuff here\r<br />If anyone is interested I need help documenting (with pictures hopefully all the stuff that needs to be done). \r<br />Update:\r<br />[/size]Got most of falkreath done now just need to navmesh it which will take some time.\r<br />\r<br />[size=5][u]Warning[/u]:[/size]\r<br />This mod is a wip.\r<br />This mod is just an.esp and nothing more there are no assists to support this mod because I am only working to make the two mods visually work together. Also if some one can tell if there is a way to edit the two esp with a third I would do that but I\r<br />have no clue how to do that and everything I tried just  failed. Therefore, I just merged the two together and stared working from there. The mods is\r<br />currently in a state that is just for show and to show it off and see anyone wants to do some checking and see if I did everything correctly and did not\r<br />leave something floating around or if something is miss placed (please comment and leave screenshots of anything that is off or wrong (note I only did\r<br />Riverwood for now so that&#39;s the only one that should have been visually fixed)). The mod is stable form what I have played plus I have cleaned it up\r<br />for the few things that had to be removed. \r<br />Also comment other towns, cities that need to be  fixed and I will start there next.",
  "categoryId": "84",
  "version": "0.1",
  "author": "Mafiaking101",
  "createdUnix": "1430629786",
  "updatedUnix": "1430629783",
  "containsAdultContent": false,
  "uploadedBy": "MafiaKing101",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000158453",
      "name": "Etac and JK Skyrim Merge and Visual Compatibility Fix",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5851",
      "fileName": "Etac and JK Skyrim Merge and Visual Compatibility Fix-65439-0-1.zip",
      "uploadedUnix": "1430629783",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/afd7c37a2d62b640bd5271e11cf583ef3d9c330b2338aadf67887501157701cd/analysis/1430629806/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Etac%20and%20JK%20Skyrim%20Merge%20and%20Visual%20Compatibility%20Fix-65439-0-1.zip?fid=1000158453&ttl=1535854044&ri=8192&rs=8192&setec=91edc6d04919727e0ef6bf17e68cb7d1"
    }
  ]
}