{
  "modId": 65508.0,
  "modName": "Whiterun Watch",
  "summary": "Small, atmospheric and lore-friendly player home for the modest adventurer, located just north of Whiterun. Great view, some crafting and storage.",
  "descriptionHtml": "[color=#1e84cc][size=4][b]Description:[/b][/size][/color]\r<br />\r<br />Whiterun Watch is a small, lore friendly player home. Located on a windy hilltop just north of Whiterun, the shack offers -as the name so subtly hints at; a great view towards Whiterun/Dragonsreach, and the surrounding plains.\r<br />\r<br />Since the player home is rather small and located in a rural area it is best suited for up and coming Dragonborns who like to live in the wilderness and travel alone without wife, kids and 3 followers. Despite that, and the fact that there&#39;s only one single bed in the shack, the home is navmeshed, so followers will follow inside, horses will wait outside.\r<br />\r<br />It is intended as a more modest, down-to-earth player home, but I&#39;ve tried to make it a good combo of atmosphere and functionality, and fitted in some practical features. If you want more features than what&#39;s mentioned below, you&#39;ll either need to travel to the nearest town...or find another player home.\r<br />\r<br />[color=#1e84cc][size=4][b]Features:[/b][/size][/color]\r<br />\r<br />Cooking Pot\r<br />Bookshelves (30 books)\r<br />Enchanting Table\r<br />Alchemy Table\r<br />Workbench\r<br />Weapon Racks (4 weapons)\r<br />\r<br />Tanning Rack (outside)\r<br />Chopping Block (outside)\r<br />\r<br />This mod also features a Super Deluxe Bonus for Dragonborn only: a unique fast travel point&#33;\r<br />All inside furniture and storage chests, barrels and sacks are no-respawning. The barrels outside are respawning.\r<br />\r<br />[color=#1e84cc][size=4]How to aquire it:[/size][/color]\r<br />The home is located north of Whiterun, west of Loreius Farm, between Halted Stream Camp and Korvanjund. Find your way there, and look for a journal. If you can solve it&#39;s mind bending puzzle, you&#39;ll find the key, and all the glory of this player home will be yours to keep.\r<br />\r<br />\r<br />[color=#1e84cc][size=4][b]Requirements:[/b][/size][/color]\r<br />\r<br />Skyrim.esm\r<br />No DLC is required. \r<br />\r<br />[color=#1e84cc][size=4]Compability:[/size][/color]\r<br />\r<br />This mod edits exterior cells Tamriel 3,6 and 5,6, and will conflict with other mods who do the same. \r<br />Cell 3,6 is the one with the player home, so if the other cell is overwritten after you&#39;ve acquired the key, it might theoretically go well, I haven&#39;t tested that.\r<br />\r<br />\r<br />[color=#1e84cc][size=4][b]Other Technical info:[/b][/size][/color]\r<br />\r<br />The mod is navmeshed and cleaned withTESVEdit. \r<br />The mod uses vanilla assets only, so just drag and drop the .esp-file to your data folder.\r<br />The mod has been moderately tested by myself.",
  "categoryId": "67",
  "version": "",
  "author": "Chiaro22",
  "createdUnix": "1430738074",
  "updatedUnix": "1430738074",
  "containsAdultContent": false,
  "uploadedBy": "Chiaro22",
  "primaryFile": null,
  "files": []
}