{
  "modId": 6557.0,
  "modName": "Schoolgirl Clothes - ANIMEISH NOT LORE FRIENDLY NO IMMERSION",
  "summary": "from oblivion",
  "descriptionHtml": "***THIS IS NOT LORE FRIENDLY! THIS ARMOR IS MADE TO MY OWN PERSONAL TASTES, IF YOU DO NOT LIKE IT FEEL FREE TO WALK AWAY AND LEAVE***\r\n\r\n***the shoes on the other pic is just a tease guys sorry :P nice shoes I know it is from a mod called \\\"converse shoes\\\" on tesnexus by keisun83 but he doesnt want it redistributed.***\r\n\r\nnot sure why this topic is locked but... cant post comments :S - if any of the admins read this please unlock it lol.\r\n\r\nAnother one of my oblivion ports that I could actually find some copyright stuff on.\r\n\r\nFemale only clothes, replaces hide armor set minus the helmet. (this one actually fits on vanilla skyrim bodies skin color, unless I screwed something up)\r\n\r\nTo install extract the data folder inside the .rar into your skyrim folder\r\n\r\nOriginals from TES4: Oblivion modders:\r\nBoots and Clothing: Hentai/zotman12\r\nKneesocks and Underwear: Tona/toshizo7\r\n\r\nThe clothing is super skinny because I like skinny girls pretty much made everything skinnier than they came in, there are no weight sliders, so if you like big girls this probably isnt for u.\r\n\r\nTheres probably a lot of bugs on this so if you find something let me know (should be better than my last release).\r\n\r\nI originally made this out of random pieces I had in my oblivion folder so I\\'m rly sorry if you made anything in this and I didn\\'t mention you, or I\\'m not supposed to release your stuff (but im pretty sure i got every1)\r\n\r\nI originally intended to use another set of shoes for this but it was copyrighted.\r\n\r\npermission:\r\ndo whatever\r\n\r\ncredits:\r\nexnem for the original eyecandy body in oblivion\r\nRAIAR for the HGEC body\r\ntona\r\nhentai\r\n",
  "categoryId": "60",
  "version": "",
  "author": "me",
  "createdUnix": "1326989826",
  "updatedUnix": "1326990379",
  "containsAdultContent": false,
  "uploadedBy": "person123456789",
  "primaryFile": null,
  "files": [
    {
      "fileId": "21182",
      "name": "schoolgirl uniform",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15760",
      "fileName": "schoolgirl uniform-6557-1.rar",
      "uploadedUnix": "1326990379",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/eddb51a1d38ad0a47063c5e791385ef6ac41d4b9b453fae5362a0096ae6c79ee/analysis/1406623632/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/schoolgirl%20uniform-6557-1.rar?fid=21182&ttl=1535764062&ri=8192&rs=8192&setec=e7dc4dc2a4d82f5b2b749e274ee38285"
    }
  ]
}