{
  "modId": 65626.0,
  "modName": "Admeri Dominion Thalmor Banner",
  "summary": "A simple retexture of the vanilla Thalmor banner with Aldmeri Dominion charge.",
  "descriptionHtml": "The purview of this simple mod is to replace the the vanilla Thalmor banner with one displaying the coat of arms of the Aldmeri Dominion.\r<br />\r<br />Based on my own huble opinion, as much as the Thalmor is the govermental represntation of the third Aldmeri Dominion, its banners\r<br />shall herald the insignia of the Dominion, the stylized golden falcon displayed being charged against sable field.\r<br />\r<br />The fabric of the flag appears to be the same leather material with the golden finish and details that Thalmor robes exhibit. I could not\r<br />help myself but constantly reailsing when seeing a Thalmor banner that it seems to be the result of some othervise environment-friendly-like\r<br />up-cycled mass-production of reject and leftover fabric flung over a suspended horizontal support, and sewn to be held in place. The very concept seems to be in antagonistic order however with the need and zeal for nothing less than perfection what charaterizes both the Altmeri culture and the Thalmor (with its personnel excessively dominated by Altmer). Long story short, it seemed just not right that the banners are so much austere as they are, and decided that they need to be a heraldic device truly fitting the Dominion&#39;s projected grandeur - by charging the golden coat of arms right in the middle of the banner. I kept elements of the second &#34;layer&#34; on the banner, but it is only slim fabrics with lined edges suspended at the upper hoist of the banner, framing the charge from both sides making the field around it trimmed distantly resembling an archway. The stylized falcon is of the same design whish was the standard of the first Aldmeri Dominion (actually derived from the crest designs of the The Elder Scrolls Online faction crests - so it might be a consistent element being a design development by Bethesda). The golden falcon charge itself and the golden linings are embossed on the flat surface of the banner&#39;s fabric givin these metallic surfaces a proper relief-like look.\r<br />\r<br />Installation:\r<br />Either simply install by using the Nexus Mod Manager,\r<br />or put the two dds files within the archive to your The Elder Scrolls V: Skyrim-installation folder&#92;Data&#92;textures&#92;architecture&#92;solitude&#92;\r<br />\r<br />Compatibility:\r<br />As a simple texture replacement this mod should not conflict and should be compatible with anything that does not change the Thalmor banner precisely.",
  "categoryId": "29",
  "version": "1.0",
  "author": "EIestar",
  "createdUnix": "1431013118",
  "updatedUnix": "1431030545",
  "containsAdultContent": false,
  "uploadedBy": "EIestar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000159182",
      "name": "Aldmeri Dominion Thalmor Banner",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "130",
      "fileName": "Aldmeri Dominion Thalmor Banner-65626-1-0.zip",
      "uploadedUnix": "1431030545",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6ce3d856d39d8264bf4de3a18580b1a75943a45b1b71055437d9b5adaffc059b/analysis/1431030603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aldmeri%20Dominion%20Thalmor%20Banner-65626-1-0.zip?fid=1000159182&ttl=1535854200&ri=8192&rs=8192&setec=d929c8fce239bbb4708d7474e4d430d9"
    }
  ]
}