{
  "modId": 6573.0,
  "modName": "Skyrim Book List",
  "summary": "*Not a Mod* This file is intended for use by Skyrim Book Collectors like me. It lists all of Skyrim\\'s many books in a well formatted Word document. In addition to listing all readable books, it also includes spell tomes, and a section to list the books you don\\'t have yet.",
  "descriptionHtml": "\r\nThis is a list of all Skyrim\\'s many readable books, as well as spell tomes. It is a well formatted Word document (in my opinion at least) and presented in an aesthetically pleasing form. Basically, I got tired of not being able to find a decent list of Skyrim\\'s multitudes of books that could be edited to check off which ones I already had. Thus, I crafted this file for all the Skyrim book lovers/collectors out there!\r\n\r\nThe books are in sections, which are as follows:\r\n\r\n  1.  Needed Books. This first section is where you list which books you don\\'t already have. For personal use, of course - you have to fill it in yourself!\r\n\r\n  2.  All Books. This second section lists all the \\\"books\\\" in Skyrim (the key is Red = not owned;    Blue = Debatable if it\\'s a book, and Crossed Out = owned - feel free to change it as you like). No journals or notes were listed, as they are not books! The exception is personal books various NPCs wrote about their work, and formatted it to look like every other book, with a title page. I marked such books, as well as all the Home Decorating Guides in blue so you can take them off if you don\\'t agree with me ;)\r\n\r\n  3. Skill Books. This third section lists all the books that give you skill level increases, categorized by the individual skill.\r\n\r\n  4. Functional Books. This fourth mini section under the Skill Book section lists all the books with a functional use, i.e. starting quests and adding map locations.\r\n\r\n  5. Spell Tomes. This firth section lists all the obtainable spell tomes.\r\n\r\n  6. Pre-formatted misc page for whatever you may want to add. Yes, you can add anything you like! *GASP*\r\n\r\n*Part of what I mean when I say pre-formatted is that page breaks are in place to prevent the different sections from being messed up by editing. I\\'m pretty sure it works ok, but if not let me know!\r\n\r\n*If I missed any books, please let me know and I will try to add them. I made this list based off what I\\'ve already found in the game, and what I\\'ve read on wiki pages. Also if there are spelling errors, whether or not they are real words or Skyrim words let me know as well :]\r\n\r\n*Please don\\'t ask for updates adding item IDs. I made this list to be used for people who can\\'t remember which books they already have, not to let people spawn all the books. If you want that I\\'m sure you could find them all, as well as some that weren\\'t supposed to be in the open game (QA testing books) in the Skyrim Testing Hall. Go find out how to get there on your own though, since I don\\'t endorse cheating ;P",
  "categoryId": "28",
  "version": "1.0",
  "author": "UlithiumDragon",
  "createdUnix": "1327012280",
  "updatedUnix": "1327012505",
  "containsAdultContent": false,
  "uploadedBy": "UlithiumDragon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "21265",
      "name": "Skyrim Book List",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27",
      "fileName": "Skyrim Book List-6573-1-0.7z",
      "uploadedUnix": "1327012505",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a23e646174d443521fc6cc06e0c3743f34a7fda7c5bd56521fe85332cfb3eb9f/analysis/1406624283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Book%20List-6573-1-0.7z?fid=21265&ttl=1535764091&ri=8192&rs=8192&setec=b887520419f0f6fee78fd657b32242f9"
    }
  ]
}