{
  "modId": 65753.0,
  "modName": "Ulda - Normal and Dovahkiin version - DELETED - DELETED",
  "summary": "This is a follower mod&#33;  This mod was made for some sort of &#39;reward&#39; for the winner of a Competition. Ulda&#39;s level 43&#33;",
  "descriptionHtml": "[size=3]   This follower mod is the reward for the winner of the Dead is Dead Competition.If you want to see the competition go [/size][url=http://forums.bethsoft.com/topic/1516828-did-competition/]HERE[/url][size=3].[/size]\r<br />\r<br />[size=3]   Ulda is level [/size][u]43[/u][size=3] and she&#39;s in the Bannered Mare.[/size]\r<br />\r<br />[size=4]   [b][u]The mod worked fine for me but in case something happens to your game after you install the mod, be warned: You installed this mod, you know what could happen. I&#39;m not responsible your game breaks. I also want to warn that this is also my first mod (edit: my first mod that ADDS something in-game).[/u][/b][/size]\r<br />\r<br />[size=3]   Sorry if my english sucks :)\r<br />\r<br />\r<br />\r<br />[/size]   No, you cannot upload this mod anywhere else, modify and upload without my authorization but, if you do, remember that asking to upload the mod somewhere else isn&#39;t a big of a deal. I&#39;ll probably say yes if you give me the credits for it.\r<br />\r<br />\r<br />\r<br />   [size=5][center]Just so you guys know, from this point on, the page was edited&#33;[/center][/size]\r<br />\r<br />\r<br />[size=3]\r<br />   [/size][url=http://www.nexusmods.com/skyrim/users/6873585][size=3][b]Dferstaf[/b][/size][/url][size=3][b] said some things that i want to talk about. You might want to read them.[/b][/size]\r<br />\r<br />   [b][size=3]1 [/size][/b]- He said that i should make the page super beautiful and epic. I don&#39;t see the reason why. I have my game heavily modded and when i see a new mod i go and check it out, see how it looks like. The only problem that i had was that sometimes those mods didn&#39;t had any pictures/didn&#39;t said what they were nor did they gave a clue of it. Those who DID had a picture mod-related or told me what they were/ gave me a clue of what they where, i taught to myself &#39;[i]Will I need this mod? It does seem cool... Eh, i guess i&#39;ll just favorite it&#39;[/i] (which i did to a lot of mods). I didn&#39;t care if they had a cool mod page, i wasn&#39;t using the mod page, i was using the mod itself. The mod is important, not the mod page&#33;\r<br />\r<br />   [b][size=3]2 [/size][/b]- He also said that its my fault 100% if the mods didn&#39;t work. I mean, come on&#33; If your car stops working 4 months later after you bought it and modified it, would you blame the person that sold you the car or yourself? Its the same with mods. You choose to install the mod, you know what the mod might do but you install it anyway and it works well&#33; But you have something installed that is conflicting with the mod you just installed (in this case, Ulda). You can&#39;t blame the modder that he broke your game. You knew what you where doing and you probably knew that it would conflict but you didn&#39;t care. This actually happens to me a lot. I install mods, my game my break and i know that. I also know that its my fault because i chose to install them. You should take responsibility of your actions and not blame everyone around you.\r<br />\r<br />   [b][size=3]3 [/size][/b]- If you ARE new at modding your game, be sure to read what the mod does first and see if it conflicts by playing the game after you install a mod. If you don&#39;t (or you do and you just don&#39;t care) the mod that your installing might conflict with the others. Its your fault, as i said above. Simple as that. You should also run if you want BOSS (Google it) but i don&#39;t recommend, seeing as he might break your organized mod list. I don&#39;t use because my mods are very sensitive, to say the least, so i do it by hand ;)\r<br />\r<br />   [b][size=3]4 [/size][/b]- &#34;You say this is your first mod. In that case, you should look at what other modders have done, not just with the mods themselves, but with their documentation.&#34; This. This is my first mod that adds something in-game&#33; I have a modified uncapper .ini file (that i hid because i have to modify that a little bit more) with 28 endorsements, 8422 views and 384 downloads (better then this mod and way better compared to the things dferstaf ever made&#33; Heck, even a joke mod is better&#33;) Also, what you are saying is that i copy a mod page from a well known mod to this one? Why? Its a MOD PAGE&#33; You aren&#39;t going to see the page in-game, your ARE going to see the mod though&#33; (You should also read the first part).\r<br />\r<br />   [size=3]5[/size][size=2][b] - [/b]Dferstaf also said that i needed to tell you guys if the mod needed another mod for it to work. He is half-right and half-wrong on that. For the long time modders (game modders, not mod makers) such as myself, did you ever saw a mod that worked on Skyrim &#39;vanilla&#39; saying that it needed something else to work? You did? Its normal? Of course it is&#33; You just need Skyrim for the mod so why would you tell people that they need the game if their downloading the mod? I think its pretty obvious but hey&#33; Maybe you though you could have this mod in Morrowind/Oblivion/Fallout/Dragon Age Origins/Dragon Age 2. I don&#39;t blame you Dferstaf. I mean, your intelligence must be like Half-Life 3 (Everyone will understand this one and you should use this) ;)[/size]\r<br />\r<br />   [size=3][b]6[/b][/size][b] [/b][size=2]- I just want you to know that even if you ARE a premium/supporter/moderator or anything above the regular members of this website, you can&#39;t talk to people like dferstaf did (or, if you want, like a smart ass). We, the members (some of us modders who reached success because of their awesome mod)  are letting those sometimes annoying ads to play so this website can exist. I probably come to this website 5 times+ per week to see what mods have been released. Thats a lot of ads to be displayed and they probably can get to 2 euros (I live in Europe, in Portugal to be more specific) for the 5 times that i come here. Now, 2x30 = 60. Thats 60 euros that this website gets from me. I know that 15 (average) pages that i visit per day might not make 2 euros, but you know what i mean ;)\r<br />\r<br />[/size]   I just want to thank everyone that read all of it :)",
  "categoryId": "96",
  "version": "1.0",
  "author": "MrBattleAxe with the help of ladyonthemoon",
  "createdUnix": "1431279331",
  "updatedUnix": "1431278831",
  "containsAdultContent": false,
  "uploadedBy": "MrBattleAxe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000159582",
      "name": "Ulda - Dovahkiin Version ",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "142",
      "fileName": "Ulda - Dovahkiin Version -65753-1-0.rar",
      "uploadedUnix": "1431278818",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3ed8d3e13d9ea144d5bdb77aea2c40a6499c3c2122a20ba7a0b06e35d0688e83/analysis/1431278833/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ulda%20-%20Dovahkiin%20Version%20-65753-1-0.rar?fid=1000159582&ttl=1535854295&ri=8192&rs=8192&setec=8b0ed14cad8f5be3542b6ba25a503498"
    },
    {
      "fileId": "1000159583",
      "name": "Ulda - Normal Version",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "142",
      "fileName": "Ulda - Normal Version-65753-1-0.rar",
      "uploadedUnix": "1431278831",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/62dfe586222273b4e6811c5f5988a502b117d1d5f9edf658b909ec0cad39630c/analysis/1431278884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ulda%20-%20Normal%20Version-65753-1-0.rar?fid=1000159583&ttl=1535854295&ri=8192&rs=8192&setec=3229bf8a485a81bf05ac7de8d55d51ef"
    }
  ]
}