{
  "modId": 65780.0,
  "modName": "Detailed Ferns by An Old Fool",
  "summary": "Replaces the vanilla ferns with more detailed meshes, featuring thicker growth and optional size increases. Compatible with any texture pack.",
  "descriptionHtml": "[color=#f6b26b][size=3][b]What&#39;s this?[/b][/size][/color]\r<br />This is a small mod that simply replaces the vanilla ferns with more detailed meshes. Adult ferns and fern clusters have more branches and more volume. Unfurled ferns are now meshes instead of simple planes. The unfurled &#34;eye&#34; remains a plane to avoid clipping issues with the animation.\r<br />\r<br />[b]There are two versions of this mod: [/b]\r<br />\r<br />[list]\r<br />[*][size=2]One that increases the size of adult ferns and adult fern clusters (unfurled ferns and standing single-leaf ferns are not affected)[/size]\r<br />[*][size=2]One that attempts to match the vanilla sizes [/size]\r<br />[/list]\r<br />I prefer the increases sizes, but each to zir&#39;s own.\r<br />\r<br />[color=#f6b26b][size=3][b]Things to keep in mind[/b][/size][/color]\r<br />These meshes have roughly 5-10 times the amount of polygons as the vanilla ferns. I did not experience any FPS drops on my system (GTX970, i7-something-or-other). Depending on your system, you may experience a decrease in performance. If that&#39;s the case, let me know in the comments/forum and don&#39;t forget your post your specs - this will help me compile a list of expected performance across various hardware configurations.\r<br />\r<br />The animation should look fine. If it doesn&#39;t, please let me know.\r<br />\r<br />[color=#f6b26b][size=3][b]Plans for the future[/b][/size][/color]\r<br />[list]\r<br />[*][size=2]Update and/or add vertex coloration - some of this information was lost during export.[/size]\r<br />[*][size=2]Create new textures[/size]\r<br />[/list]\r<br />Enjoy, \r<br />An Old Fool",
  "categoryId": "85",
  "version": "1.0.0",
  "author": "An Old Fool",
  "createdUnix": "1431355612",
  "updatedUnix": "1431355612",
  "containsAdultContent": false,
  "uploadedBy": "AnOldFool",
  "primaryFile": null,
  "files": []
}