{
  "modId": 6582.0,
  "modName": "The Witcher 2 Assassins of Kings - Menu music",
  "summary": "Music for Main Menu",
  "descriptionHtml": "The Witcher 2: Assassins of Kings music for Main Menu.\r\n\r\n\r\n\r\nCurrent Version 1.1\r\n\r\nIf you like this mod then press ENDORSE ME\r\n\r\nV 1.1 I replaced Gothic 4 theme (which i added by mistake instead of W2 theme) with The Witcher 2 main menu theme.Now everything should work.\r\n\r\nCOMMENT TERMS AND CONDITIONS\r\n\r\nBefore leaving a comment or rating please be sure you have read and understood our terms and conditions for using the commenting system. We have a strict zero-tolerance policy for the breaking of our terms and people can and will be banned from the site without warning if they ignore them. Remember; ignorance is not an excuse.\r\n\r\nThe commenting and rating system is available on this site to provide users with:\r\n\r\nan interface to offer positive feedback on the functionality of the file in question based on the author’s initial intentions\r\n\r\nthe ability to offer constructive criticism on aspects of the file that could be improved\r\n\r\nthe chance to ask for feature requests and discuss such requests with other users of the site or the author\r\n\r\nthe ability to ask for help in troubleshooting problems with the file in question\r\n\r\n\\\"If your comment does not fit in to the above criteria then do not post. If you disagree with the content of a file on the site then do not post.\\\"",
  "categoryId": "61",
  "version": "1.1",
  "author": "EvilPhoenix",
  "createdUnix": "1327017168",
  "updatedUnix": "1328428257",
  "containsAdultContent": false,
  "uploadedBy": "EvilPhoenix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "26063",
      "name": "The Witcher 2 Main Menu Theme",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "745",
      "fileName": "The Witcher 2 Main Menu Theme-6582-1-1.rar",
      "uploadedUnix": "1328428257",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d240c25707cb932aacee300c4aeb08953abd7ed3d02319cada8e6d7a3703db8f/analysis/1406654705/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Witcher%202%20Main%20Menu%20Theme-6582-1-1.rar?fid=26063&ttl=1535764111&ri=8192&rs=8192&setec=76b1ef459c3f718c2a68734f0a82c2ac"
    }
  ]
}