{
  "modId": 65828.0,
  "modName": "Better Game Performance for Skyrim v2",
  "summary": "This is a remake of my Better Game Performance mod for Fallout 3.\r<br />It was listed on the Fallout 3 Master List, which is basically a list of must - have mods.",
  "descriptionHtml": "[b]Better Game Performance[/b]\r<br />\r<br />It came to my attention that performance can be improved by using the undelete and disable function. This should improve stability in most users games while retaining performance.\r<br />As such, I sought permission from falloutperson416 to upload this update. As he accepted, it means that &#39;Better Game Performance V4&#39; is no longer supported, and that it should be replaced with this file.\r<br />So, enjoy this mod&#33;\r<br />\r<br />[b]Description[/b]\r<br />\r<br />This is a remake of my Better Game Performance mod for Fallout 3.\r<br />It was listed on the Fallout 3 Master List, which is basically a list of must - have mods.\r<br />\r<br />[b]Details[/b]\r<br />\r<br />This removes a couple unused items from the game to create a better performance. To better explain hat I mean by unused I mean literally unused. For example, the GECK showed the items being used in the world 0 times, with 0 references, and no forms of quests using it. So, completely unused. This DOES NOT REMOVE any items that you might use in some shape or form. One rock type was removed. It was used thousands of times. It was a small cave rock. Useless. The rock was NOT used to cover up landscape clipping.\r<br />This removes some objects that the game does not use in any way. By doing this, the game has less data to process, and a better performance is created (More FPS & less lag). Although my computer is very powerful, the mod still helps it out. I go crazy if I can get my hands on something that makes something better.\r<br />\r<br />[b]Install[/b]\r<br />Run the bat in the zip file and then run the game.\r<br />\r<br />[b]Known Issues and Bugs[/b]\r<br />\r<br />Some people have been saying that the mod has been causing a common load fail. The bug I am referring to is the one where you just fall through the floor out of nowhere. Here&#39;s the deal: You can fix it by simply fast travelling far away, and then going back. There is no possible way this mod could cause a fail, either. My reasons being, the mod doesn&#39;t add anything. No meshes or textures have been messed with. There is absolutely nothing that could possibly cause the floor to not load, except for the game itself. This bug has been talked about on the forums, images have been uploaded, and the answer that is drawn: THE GAME&#33; So, if you’re going to complain, blame it on the game, not my mod.",
  "categoryId": "84",
  "version": "2",
  "author": "netherlander",
  "createdUnix": "1431450806",
  "updatedUnix": "1431450806",
  "containsAdultContent": false,
  "uploadedBy": "netherlander",
  "primaryFile": null,
  "files": []
}