{
  "modId": 65957.0,
  "modName": "Trainwiz&#39;s Miscellaneous Mod Compilation",
  "summary": "A bunch of smaller, inconsequential mods that I never fully released or released elsewhere, including a ride-able netch, Sotha Sil&#39;s mask, and a candlelight replacer. ",
  "descriptionHtml": "These are a bunch of mods that, for one reason or another, never ended up on Nexus. None of them are very large or extensive, and all are free to be used as modder&#39;s resources. I&#39;ll have the description of each mod in its own individual section.\r<br />Each is in its own separate folder, and all are compatible with each other.\r<br />\r<br />\r<br />[size=5][b]Ridiculously Marvelous Magelight Replacer[/b][/size]\r<br />So God descended from the heaven on the back of some angels, and was like &#34;Yo TW I&#39;m a big fan of yo mods and all but there needs t&#39;be something that gets all up and making that candlelight a fireball, y&#39;know what I&#39;m saying.&#34; God talks like this because he is old and old people think this is how young people talk. \r<br />But, I decided sure, why not, and used my arcane modding powers (that you will never have because you&#39;re you), and replaced said magelight with a fireball. God then gave me a smoothie. All-in-all, it was a fair trade. \r<br />Yes, that&#39;s right. This mod replaces the candlelight ball, with a fire ball. It also changes the actual light of said candlelight to be closer to that of a torch. \r<br />This mod will conflict with anything that modifies the candlelight SPELL, but not the magic effect. Those are two different things, if you want to know the difference just ask your parents. \r<br />Note that I called it Magelight Replacer because I wanted to, shut up. \r<br />\r<br />[b][size=5]Rideable Netch[/size][/b]\r<br />[size=2]Requires Dragonborn, because DUH. \r<br />This mod adds a rideable netch near the bulwark of Raven Rock named &#34;Mister Jellacles&#34; \r<br />Mr. Jellacles is not aggressive, but not loyal, however he has deemed you worthy of riding him, seeing as you are without a mount otherwise. \r<br />He is invulnerable to damage, but will not follow you if you stop riding him, so be careful. \r<br />Mr. Jellacles has the same stats as normal netches, which is quite high and decent. He is also qualified to perform Cathoic baptisms, and has a master&#39;s degree in civil engineering. Please note that despite this, Mr. Jellacles is not a member of the Netch Architecture Union (NAU) and any views or advice he gives does represent that of the union, and the contractor is using him at their own risk. Please also note that a &#34;Mr. Jellacles&#34; who was brought up on charges of harassment against a group of betty netch calves last year is not related to the person mentioned within, as Jellacles is a common last name of southern born Solstheim Netches.\r<br />[/size]\r<br />[size=5][b]Mask of Sotha Sil[/b][/size]\r<br />[size=2]You&#39;ve probably been playing Skyrim for a while now, and as you&#39;ve shouted at dragons and killed Nazeem before reloading a save so you can kill Nazeem again, you&#39;ve no doubt thought to yourself &#34;You know, Skyrim is really missing Sotha Sil&#39;s mask. What a pity I have absolutely no skill in anything whatsoever, or I would add that mofo into the game right away&#33;&#34; \r<br />Well fear not, I have heard you prayers, and bestow upon you Sotha Sil&#39;s mask, totally not ripped straight from Morrowind&#33; \r<br />I&#39;m serious it wasn&#39;t, that wouldn&#39;t work. \r<br />Do amazing things with it&#33; Put it on, take it off, then put it on AGAIN. It&#39;s that incredible&#33; Each polygon is lovingly hand-crafting to your unrealistically high standards, and it can even be enchanted with whatever stupid magic you think is good enough for the mask of a god (Here&#39;s a hint, your enchantment will never be good enough). \r<br />Now you can only get the mask through the use of your console. Type &#39;help Sotha&#39; to see the item&#39;s code, then type player.additem &lt;Whatevertheitemscodeis&gt; 1, to gain your incredible new trophy&#33; \r<br />DISCLAIMER: Trainwiz takes no responsibility for injury, loss of fertility, or otherwordly Chronographer helicarrier fleets bursting out of Ur-Sotha doors to take back the stolen mask of their creator. If you are pregnant, might become pregnant, or know what pregnancy is, MASK OF SOTHA SIL is not for you. [/size]\r<br />\r<br />CREDITS:\r<br />Haishao for some conversion\r<br />Saint_Jiub for his textures.",
  "categoryId": "28",
  "version": "1.0",
  "author": "Trainwiz",
  "createdUnix": "1431751652",
  "updatedUnix": "1431751528",
  "containsAdultContent": false,
  "uploadedBy": "trainwiz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000160268",
      "name": "Ridiculously Marvelous Magelight Replacer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Ridiculously Marvelous Magelight Replacer-65957-.rar",
      "uploadedUnix": "1431751438",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c19418ef094e17e0c6f34e068a9f8b61664fcd823e4e21c0538fa0be806e7fb4/analysis/1431751443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ridiculously%20Marvelous%20Magelight%20Replacer-65957-.rar?fid=1000160268&ttl=1535854494&ri=8192&rs=8192&setec=89e8cd5ca8e5211701a39946e7c73574"
    },
    {
      "fileId": "1000160269",
      "name": "Rideable Netch",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Rideable Netch-65957-.rar",
      "uploadedUnix": "1431751454",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a37834a3587d65d5b34aaa79731121bdde93dc3d3dc2a0b85bebf965a31d9a29/analysis/1431751503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rideable%20Netch-65957-.rar?fid=1000160269&ttl=1535854494&ri=8192&rs=8192&setec=a3132c4ce77cd6ec700131dbae567f9f"
    },
    {
      "fileId": "1000160271",
      "name": "Mask of Sotha Sil",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4051",
      "fileName": "Mask of Sotha Sil-65957-.rar",
      "uploadedUnix": "1431751528",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/93aff25fbe531b2923699ed55a5ce6fc9289d567c394931ccc94d45e5d7ab311/analysis/1431751575/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mask%20of%20Sotha%20Sil-65957-.rar?fid=1000160271&ttl=1535854495&ri=8192&rs=8192&setec=9f13bd90043ddce2fb84979bcd4a7375"
    }
  ]
}