{
  "modId": 6598.0,
  "modName": "ULFRIC STORMCLOAK MUST DIE  Roleplaying RP Alternate Start",
  "summary": "You are a Nord archer whose family has been murdered by the Stormcloaks. You will not rest until you have Ulric\\'s blood.",
  "descriptionHtml": "True, this is a savegame, but it is designed for heavy-duty RP. The main quest has been disabled (you can re-enable by typing \\\"setstage MQ102 30\\\" in the console) and you have almost nothing to start with. This is your story...\r\n\r\nHaving lived your whole life by the skill of your bow, it is no secret why the Empire has called on you time and time again to help train their new archers. General Tullius has always had a high regard for your abilities, even though you continue to refuse him when he has offered you a place in his legion!\r\n\r\nThings have changed, however. While selling your pelts from a successful hunting trip near Falkreath, an old man told you that Ulric Stormcloak had escaped the Empire\\'s clutches, aided by a monster he had summoned from the distant past. \\\"T\\'were a dragon, I tell you!\\\" the old man exclaimed. You smiled indulgently while you counted your new-won gold, and then turned out of town for the trek back to your home, just south of Helgen. You were eager to get there... you had been away hunting for weeks and you keenly missed your wife and two young sons.\r\n\r\nYou first noticed something amiss when you smelled and then saw a smudge of smoke on the horizon. Jogging ever and ever more quickly, your concern turned to anxiety and then full-blown panic as you sprinted  into your yard and saw your cabin in flames!\r\n\r\nBursting in, you saw at a glance that your sons were dead, throats cut by some remorseless sword. Your wife, bloodied and battered, stirred faintly as you tried to drag her from the burning house. With her dying breath she whispered, \\\"It was Ulfric and his cutthroats\\\" before before beginning her long journey to Sovngarde.\r\n\r\nLurching from the burning house, you were smashed on the head with a wooden club. As you slipped into unconsciousness, the last words you heard were, \\\"Shall I dispatch him, my Lord Ulfric?\\\"   \\\"No... let Talos decide if he lives or dies.\\\"\r\n\r\nYou lived. \r\n\r\nThat was two weeks ago. Left only in rags, weapons and money taken, you staggered to Solitude, hatred for the Stormcloaks keeping you on your feet and moving. Upon reaching Solitude, you requested an audience with General Tullius and Legate Rikke. After hearing your story, the General asked what you wanted. You replied, \\\"I want to join the Legion. I want to kill Stormcloaks. I want to hear Ulfric beg for his life before I send him to Hell.\\\"\r\n\r\nThis is where you take over! General Tullius has generously arranged a 250 Septim signing bonus and promised to induct you into the Imperial Legion (so long as you clear a fort that the legion will be needing for Legate Rikke). You have your skills, 250 septims to buy basic equipment, and your hatred of the Stormcloaks to see you through. Gods be with you!\r\n\r\n=====  Since you have never served in combat, you have no perks; your skills however, are quite deadly.   I designed this character for heavy-duty Roleplaying, using food mods and limiting his carry weight to provide a more realistic experience. I encourage you to do the same!\r\n\r\nIf you don\\'t like the way he is set up, you can use the showracemenu command in the console to tweak him to your likes. Since you are level 1 and have no perks there is no penalty.\r\n\r\nHappy hunting and Long Live the Emperor!!!\r\n\r\nSkill Set-- Sneak 30, Light Armor 40, Archery 50, One-handed 35, Two-handed 10, Block 35, Smithing 40. Perks- none.\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "BosmerSpock",
  "createdUnix": "1327029416",
  "updatedUnix": "1327037373",
  "containsAdultContent": false,
  "uploadedBy": "BosmerSpock",
  "primaryFile": null,
  "files": [
    {
      "fileId": "21366",
      "name": "Ulfric",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1216",
      "fileName": "Ulfric-6598-1-0.zip",
      "uploadedUnix": "1327037373",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2a24162589ac675254ef5ce3bb98315fcf728f2dd2f5a4329034d244e6dc2036/analysis/1406625009/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ulfric-6598-1-0.zip?fid=21366&ttl=1535764140&ri=8192&rs=8192&setec=0f4b2c9ad183665cedba68ab5becba50"
    }
  ]
}