{
  "modId": 66005.0,
  "modName": "USURE20 - OVERHAUL - FRANCAIS - FRENCH",
  "summary": "L&#39;Overhaul &#34;USURE20&#34; est un projet de regroupement de tous les mods de la série USURE avec exigences de configurabilité via un Menu MCM, afin que chacun puisse construire son propre jeu.\r<br />",
  "descriptionHtml": "[center][size=4]***************************************************************************\r<br />*** BIENVENUE DANS L&#39;OVERHAUL &#34;USURE20&#34; ***\r<br />***************************************************************************[/size][/center][size=3]\r<br />L&#39;Overhaul &#34;USURE20&#34; est un projet de regroupement de tous les mods de la série USURE avec exigences de configurabilité via un Menu MCM, afin que chacun puisse construire son propre jeu.\r<br />CONTEXTE de Création\r<br />Les mods de la série USURE s&#39;efforcent de rendre au volet SKYRIM des Elder Scrolls, le minimum de contraintes &#34;évolutives&#34; réalistes qu&#39;il lui faut pour rendre au jeu ses défis et combattre l&#39;ennui &#33;\r<br />Injecter un peu de durée aux choses, laisser les choses évoluer, avoir une fin &#34;s&#39;user&#34; pour obliger le joueur à les gérer, voilà le but de cette série.\r<br />En y jouant la première fois, j&#39;ai trouvé le jeu trop propre, trop poli, trop brillant de facilité. Au niveau 30 avec tous les chevaux d&#39;acquis, tous pareils, toutes les maisons toute meublée, et des réserves de 30000 or dans mes coffres. Pas la peine de se nourrir, des chevaux impérissables, des squelettes avec des armes flambantes neuves, les followers vous offrant leurs vies pour une défense de mamouth etc.. Tant d&#39;incohérences &#33; \r<br />Si tout cela vous a irrité aussi, Bienvenue dans le vrai monde de skyrim, celui où les choses ne perdurent pas...Mais se renouvellent.\r<br />\r<br />[b][u]Requiert:[/u][/b]\r<br />- Skse, les extensions du jeu, SkyUI pour le MCM.\r<br />\r<br />[b][u]Installation:[/u][/b]\r<br />- Lisez ici les recommandations avant de foncer dans une installtion chaotique &#33;\r<br />- Franchement, vaut mieux recommencer une partie lors dune première installation. À tous ceux qui auraient des problèmes sans avoir suivi ce point, svp ne demandez pas d&#39;aide, merci.\r<br />- Configurez les mods selon vos préférences en ouvrant les MCM Menus , une fois le joueur ayant les mains libérées &#33;\r<br />- Lors de la configuration des mods, veillez à ce que le mod soit activé si l&#39;option est proposée AVANT de choisir les valeurs des échelles proposées &#33;\r<br />\r<br />[b][u]Upgrade[/u][/b]\r<br />\r<br />**** NOUVEAU EN VERSION 1.3 ****\r<br />   1) Les objets en dégradant perdront d&#39;abord leur affûtage (Supérieur, raffiné, etc...) puis dégraderont ensuite jusque    perdre toute leur valeur.\r<br />\r<br />   2) Réparer en utilisant les listes des objets: \r<br />   -&gt; Sélectionnez la meule ou l&#39;établi ou l&#39;option depuis le menu des marteaux et  une liste s&#39;affichera avec tous les items    devant être réparés &#33; \r<br />   Cliquez ceux-ci pour lancer la réparation.\r<br />\r<br />   3) Réparer puis Ré-affûter les objets aux meules ou établis afin de les aiguiser &#33;\r<br />\r<br />\r<br />[/size]\r<br />[center][b][u][size=4]Le catalogue des Mods:[/size][/u][/b]\r<br />\r<br />[b][u][size=4]1) DEGRADATION:[/size][/u][/b][/center]\r<br />[size=2]\r<br />- Vos items équipés dégraderont: (configurable)\r<br />   -&gt; une dégradation d&#39;usure quotidienne de port.\r<br />   -&gt; une dégradation lors des combats, plus intense, bien sûr.\r<br />   Les armes sont + ou - solides selon leur poids et leur matériel et le type de coup recu ou donné.\r<br />**** NOUVEAU EN VERSION 1.3 ****\r<br />   -&gt; Les objets en dégradant perdront d&#39;abord leur affûtage (Supérieur, raffiné, etc...) puis dégraderont ensuite jusque perdre toute leur valeur.\r<br />   \r<br />\r<br />- Réparation à la meule pour les armes, à l&#39;établi pour les armures. Deux possibilités:\r<br />   1) Depuis votre inventaire:\r<br />   -&gt; Déplacer votre perso devant l&#39;établi ou la meule ou sélectionner un marteau pour entrer en mode &#34;réparation&#34; marqué par des frappes sonores        en arrière plan de marteaux de forgeron - ou bruit de meule.\r<br />   -&gt; Ouvrez votre inventaire et sélectionner les unes après les autres toutes les armes et armures à réparer.\r<br />   -&gt; Un message vous informera sur l&#39;état de l&#39;item, ses coûts de réparation, les options etc..\r<br />   -&gt; Selon vos compétences en forge, il faudra payer de l&#39;or au forgeron contre son aide...(en option)\r<br />   -&gt; Réparer tous vos objets depuis l&#39;inventaire, une fois terminé, quittez le mode réparation en vous éloignant de la meule, l&#39;établi ou en          sélectionnant les marteaux.\r<br />*** NOUVEAU EN VERSION 1.3 ***\r<br />   -&gt; Ré-affûter les objets aux meules ou établis afin de les aiguiser &#33;\r<br />\r<br />*** NOUVEAU EN VERSION 1.3 ***\r<br />   2) En utilisant les listes des objets: \r<br />   -&gt; activer la meule ou l&#39;établi ou l&#39;option depuis le menu des marteaux et  une liste s&#39;affichera avec tous les items devant être réparés &#33;    Sélectionnez ceux-ci pour lancer la réparation.\r<br />\r<br />- Le mod est entièrement configurable: Vitesse de degradation, Forge (compétences, lingots requis), Marteaux (cassables, compétences, lingots) dans le    MCM Menu.\r<br />- En chemin, équipez-vous de marteaux pour effectuer les reparations (à la oblivion..)\r<br />   Les marteaux de forgeron sont mis en vente chez les marchands. Vous pourrez aussi les créer à la forge.\r<br />   Vos marteaux peuvent se casser, plus ou moins fréquemment, selon votre abilité en forge. (en option)\r<br />- Toutes les réparations coûtent des lingots. (en option)\r<br />- Pas de réparation possible durant les combats.\r<br />- Les réparations effectuées à la forge augmenteront votre compétence &#34;forgeron&#34; un peu, contrairement à celle au marteau.\r<br />   Préférez donc la forge &#33;\r<br />- Vous pourrez réparer vos items enchantés par vous-même, sans la compétence forge arcane.\r<br />   Au contraire des armes magiques trouvées qui devront être réparées contre de l&#39;or à la forge ou bien requiert la competence forge arcane. (en    option)\r<br />- Les armes et armures seront marquées dans votre inventaire &#34;[neuve]&#34; ou &#34;[inconnu]&#34;:\r<br />-&gt; Les armes &#34;inconnues&#34; sont celles trouvées dans le monde, sur les adversaires, dans les coffres etc...\r<br />   Vous les dévoilerez en les équipant simplement; \r<br />   Tous les items trouvés ne sont plus flambants neufs, ce qui à mon goût ajoute beaucoup en réalisme. Ils auront un état de santé compris entre 80%    et 100% de leur état initial.\r<br />   Les items inconnus dévoilés apparaitront cependant parfois déjà améliorés, à différents niveaux, par leurs prédecesseurs.\r<br />   Vous ne pourrez ni vendre, ni améliorer, ni enchanter une arme marquée inconnue, découvrez-la d&#39;abord.\r<br />-&gt; Les armes &#34;neuves&#34; sont celles fabriquées à la forge, ou vendue par les vendeurs.\r<br />   équipez-les avant de les enchanter, améliorer.\r<br />- Vos armes et armures équipées découvertes pourront être enchantée ou améliorée par vos soins.\r<br />- Pour chaque type d&#39;item (ex: &#34;épée de fer d&#39;incandescence&#34;), seulement trois exemplaires de chaque type présents dans l&#39;inventaire seront jouables.\r<br />   Au-delà de trois exemplaires, vous ne pourrez équiper/dévoiler le quatrième item du même type sans devoir vous séparer d&#39;un des trois premiers    exemplaires. \r<br />   (Limite certes absurde mais incontournable pour la réalisation de ce mod, ceci n&#39;étant pas très gênant dans le jeu..)\r<br />- La détérioration dans ce mod n&#39;est &#34;que&#34; statistique &#33;&#33; Ne vous attendez pas à du spectacle graphique &#33;\r<br />   Ce mod inclut la degradation et reparation des items importés par d&#39;autres mods &#33;[/size]\r<br />\r<br />[b][u][center][size=4]2) LES TRANSPORTS:[/size][/center][/u][/b][size=2]\r<br />Les transports en charettes vous coûteront plus d&#39;or. Au choix:\r<br />Trajet avec retour possible: 50 or\r<br />Trajet sans retour en charette possible: 100 or\r<br />   Mod Configurable en MCM Menu.[/size]\r<br />[center][u][b][size=4]\r<br />3) LES TORCHES:\r<br />[/size][/b][/u][/center]- Construisez des torches aux forges &#33;\r<br />- 2 Versions: Une nécessitant de la graisse de troll dans la recette, l&#39;autre non.\r<br />- Configurable en MCM\r<br />\r<br />[b][u][center][size=4]4) SILENT FIGHTS:[/size][/center][/u][/b]\r<br />- Marre d&#39;entendre votre perso râler comme un boeuf (ou une boeuve) à chaque coup d&#39;épée, ce mod est pour vous car il supprime les râlements pour les coups simples, seuls les gros coups restent comme original.\r<br />- Configurable en MCM\r<br />\r<br />[size=4][center][b][u]5) REDUXCOSTMAGIE[/u][/b][/center][/size]\r<br />- Marre en tant que mage au niveau 50 de balancer deux grosses boules de feu et .. Oh ?&#33; Mana vide...\r<br />- Comparée aux guerriers qui donne autant de coups d&#39;épées efficaces qu&#39;ils veuleunt, les mages deviennent injouables.\r<br />- Donc ce mod réduit le coût des sorts, voilà et augmente la récup de magie.\r<br />- Configurable en MCM: Seule la vitesse de récup de la magie (* 2) ou originale.\r<br />\r<br />[center][size=4][b][u]6) ALDUINS NIGHTMARE[/u][/b][/size][/center]\r<br />- COMPATIBLES AVEC TOUS LES MODS\r<br />- DURANT VOTRE AVENTURE VOUS CROISEREZ ALDUIN PRÉPARANT UNE ATTAQUE COMME A HELGEN MAIS DANS D&#39;AUTRES  ENDROITS DU MONDE.\r<br />- IL VA INVOQUER DES CRÉATURES ANCESTRALES DONT LE SEUL BUT SERA DE DÉTRUIRE LE MONDE.\r<br />- LES CRÉATURES SONT LEVELÉES.\r<br />- ALDUIN VA COMBATTRE L&#39;ENDROIT QUELQUES SECONDES PUIS S&#39;ENFUIR POURSUIVRE AILLEURS; VOUS NE POURREZ PAS LE TUER.\r<br />- Les créatures invoquées vont combattre tout ce qu&#39;elles rencontrent dans le monde et rester dans le monde jusque ce qu&#39;elles soient éliminées.\r<br />- Retrouvez le combat contre les Dremoras &#33;\r<br />- Choississez le respawn des dragons et leur nombre &#33;\r<br />- Vous devrez tuer Alduin par la quête principale pour cesser ce cauchemar.\r<br />- Mod conçu pour tous ceux qui trouvent Alduin et les dragons beaucoup trop pacifiques (hormis Helgen...)\r<br />&#34;On regrette presque de les tuer, qui sait c&#39;est peut-être une espèce protégée ?&#33; lol&#34;\r<br />- AVEC MENU MCM:\r<br />-&gt; Configurez quel type de créatures aparaissent, combien, seulement des dragons, et leur fréquence d&#39;apparitions &#33;&#33;\r<br />\r<br />[center][size=4][u][b]7) COMPAGONS RÉMUNÉRÉS:[/b][/u][/size][/center]\r<br />1) Rémunérer vos compagnons de 100 septims pour 2 jours de service.\r<br />2) Acheter des chiens aux fermiers et aux étables pour 200 septims, puis nourrissez les régulièrement de repas à base de viande.\r<br />La force et résistance des chiens diminuées, ils étaient en original plus fort que les ours &#33;\r<br />3) Changements depuis les dernières versions:\r<br />- Retour dans cette version à pouvoir engager trois compagnons à la fois (+ un chien et une invocation si vous le voulez)\r<br />- les services rendus par les compagnons ne sont PAS payants.\r<br />4) Un livre menu dans votre inventaire pour:\r<br />- Renvoyer illico des compagnons (pratique en cas de bug)\r<br />- Rappeler instantanéement votre compagnon, chien ou cheval à vos côtés (pratique surtout pour les chevaux qui se barrent Dieu sait où à chaque combat...) \r<br />5) En combat vos compagnons tombés ne se relàvent plus avant la fin du combat. (Et ne seront pas tués non-plus, mais plus en état de battre)\r<br />Trop bête sinon que l&#39;IA ne les tuent pas et les laissent se relever 50 fois par combat ;)\r<br />- Configurable en MCM\r<br />\r<br />[center][size=4][u][b]8) FIGHT SPEED MOD[/b][/u][/size][/center]\r<br />- Sélectionner et règler votre vitesse de combat, \r<br />- Sélectionner et règler la vitesse de combat pour vos adversaires,\r<br />- Jouez des combats très ralentis ou super rapides à votre guise &#33;\r<br />- ATTENTION: Ce mod requiert pour fonctionner pleinement d&#39;éteindre sous le mod &#34;Combat&#34;, l&#39;option &#34;Vitesse de Combat&#34; (voir description plus loin) à laquelle il est sub-ordonné &#33;&#33;\r<br />\r<br />[center][u][b][size=4]9) Main Quest Alternative[/size][/b][/u][/center]\r<br />- Mod compatible avec la plupart des mods, random alternate start également.\r<br />- Jouer la quête principale telle que vous la connaissez...EN arrivant chez les Grises-Bardes, vous aurez la (bonne) surprise de constater qu&#39;ils vous donneront un exercice à remplir avant de vous reconnaitre enfant de dragon...\r<br />Disons que l&#39;absorption des âmes des dragons n&#39;est plus évidente et demande de l&#39;exercice: Un peu similaire au jeu de Morrowind, devenir la légende doit se mériter &#33;\r<br />- Vous trouverez aussi dans les dragons des coeurs de dragons sorte de pierres qui vous permettront, (similaires aux pierres sigilaire d&#39;oblivion) d&#39;enchanter un item.\r<br />Ou que vous pouvez vendre pour fortune, au choix.\r<br />- Tant que vous n&#39;êtes pas célébré(e) enfant de dragon par les Grises-Bardes, vous ne pouvez pas utiliser vos cris (une fois oui, et puis le temps de rechargement sera beaucoup trop long)\r<br />Ceci constituera la phase de jeu &#34;anonyme&#34; pendant laquelle vous travaillerez à votre légende.\r<br />- Une fois dans le temple des grises Bardes, adressez vous à l&#39;un d&#39;eux qui va, sur demande, vous remettre une amulette et un pouvoir magique.\r<br />En tant qu&#39;enfant de dragon, vous absorbez dès lors les âmes de toutes les créatures que vous achevez. Ces âmes s&#39;accumuleront et constituent un potentiel;\r<br />- En utilisant l&#39;amulette reçue vous pourrez investir immédiatement cette &#34;énergie&#34; pour récupérer au choix de la santé ou de la magie ou de l&#39;endurance, ou récupérer quasi instantanément votre potentiel de cri draconique.\r<br />- Si vous avez l&#39;amulette présent dans l&#39;inventaire , les cris se rechargeront &#34;automatiquement&#34;, à condition bien sûr que vous l&#39;ayez rempli suffisamment...\r<br />Essayez ce mod, il changera complet votre gameplay, rajoute un côté gestion aux cris.\r<br />\r<br />[size=4][center][u][b]10) CRÉATURES RÉALISTES:[/b][/u][/center][/size]\r<br />- Change au hasard la santé des creatures pour obtenir des créatures variées et &#34;réalistes&#34;.\r<br />- Ainsi finis les loups que vous battez tous pareils en 3 coups d&#39;épées, il y aura des loups faibles et forts, par exemple.\r<br />- La santé varie de 50% à 150% de la valeur innitiale.\r<br />- Configurable en MCM.\r<br />\r<br />[center][u][b][size=4]11) COMBAT[/size][/b][/u][/center]\r<br />-&gt; Effet de parade totale:\r<br />Parer au bouclier vous couvrira de presque tous les dégats, ainsi que pour vos adversaires. Le challenge des combats est changé rien que par cela.\r<br />Les premières compétences dans l&#39;arbre en attribut &#34;Blocage&#34; ne rajoutent donc pas des % de blocage, mais des % de dégats lors de coup de bouclier &#33;\r<br />Cette option est désactivable; Arbre de compétence  &#33;&#33;\r<br />-&gt; Effets de combats:\r<br />- Un coup puissant attribué ou reçu et non paré déclenche un effet lumineux + sonore et paralyse la victime pendant une petite seconde.\r<br />- Un coup puissant paré avec succès déclence ce même effet chez l&#39;acteur du coup puissant.\r<br />- Un coup normal paré avec succès crée chez l&#39;acteur du coup un petit ralentissement sans effet graphique.\r<br />Cette option est entièrement désactivable.\r<br />-&gt; Effets d&#39;armures lourdes et légères:\r<br />- Les armures lourdes vous ralentissent mais vous offrent une protection significativement supérieure.\r<br />- Les armures légères pareillement mais vous êtes moins ralenti et moins protégé.\r<br />- Les robes et vêtements ne changent rien.\r<br />Cette option est entièrement désactivable.\r<br />-&gt; Vitesse de combat:\r<br />- Votre vitesse de combat dépend de votre compétence correspondante à l&#39;arme choisie. Meilleure vous êtes par exemple en arme à une main, plus vite vous manierez l&#39;épée. Au début, vous êtes novice, vous serez plus ralenti qu&#39;à l&#39;habitude; Une fois maître, vous serez plus rapide (jusque 1.5 x plus rapide qu&#39;à la normale) la progression se fait toute seule au fur et à mesure que votre compétence augmente.\r<br />Cette option est entièrement désactivable.\r<br />-&gt; Matériel des armes et armures nivelé:\r<br />- Trouvez un livre dans votre inventaire qui vous décrit le concept.\r<br />- Le principe c&#39;est: Une arme ou une armure de qualité se mérite: Passez des niveaux pour pouvoir les utiliser convenablement. Un arc d&#39;ébonite par exemple requiert une valeur en compétence archerie de 60 pour être bien utilisé sans quoi il ralentira votre bras.\r<br />Cette option est entièrement désactivable.\r<br />\r<br />[center][u][b][size=4]12) CLASSES ET LEVELLING:[/size][/b][/u][/center]\r<br />1) Ouvrez en jeu le Menu MCM &#34;Classes&#34;, sitôt les mains libérées à condition que vous souhaitiez une classe déterminante pour votre perso.\r<br />2) Cochez 7 compétences entièrement au choix qui constitueront vos compétences majeures, les autres seront les mineures.\r<br />3) Finaliser / enregister:\r<br />-&gt; La finalisation détermine l&#39;activation de votre classe.\r<br />ATTENTION: Au niveau d&#39;installation du mod la finalisation pourra être décochée gratuitement et les compétences majeures redistribuées aussi souvent que vous le voudrez, MAIS, passé un niveau de jeu, re-définir les compétences majeures pour votre perso - cad le changer de classe - coûtera 10.000 septims &#33;\r<br />4) En jeu, augmenter 7 fois les compétences majeures pour obtenir un atout de compétence à placer où vous voulez.\r<br />Attention: l&#39;augmenation de niveau ne donnera plus de point de compétence &#33;\r<br />5) Vous pouvez activer dans le menu l&#39;option compétences mineures ce qui permettra à deux passages de compétences mineures d&#39;équivaloir l&#39;augmentation d&#39;une majeure. Cependant il faudra alors 10 passages de compétences majeures pour un point de compétences. Cette option peut être changée comme vous le voudrez tout au long du jeu.\r<br />-&gt; Le mod est calculé pour offrir autant de points de compétences que l&#39;original (80 atouts en tout)\r<br /> -&gt; Un livre-option dans votre inventaire nommé &#34;Bilan des compétences&#34; vous indique combien de passages de compétences il vous reste jusquau prochain point.\r<br />-&gt; En plus trouvez des livres de compétences à vendre chez les marchands ordinaires pour obtenir des atouts en plus &#33; (ils sont assez chers)\r<br />\r<br />[size=4][center][u][b]13) CHEVAUX[/b][/u][/center][/size]\r<br />- Diversifie les chevaux de part santé et vitesse et prix d&#39;achat.\r<br />Possibilité d&#39;essayer une monture aux étables avant de l&#39;acheter.\r<br />Pour cela, demander d&#39;abord si vous pouvez acheter le cheval, ensuite vous pourrez demander à essayer le cheval, ce qui rendra un cheval disponible à essayer pour quelques minutes de jeu, après quoi il sera à nouveau à vendre (ou à voler), et retournera toujours à son étable.\r<br />Ainsi on peut tester le cheval, sa vitesse etc avant de payer le prix fort, et ce sans avoir à le voler.\r<br />\r<br />[center][b][u][size=4]14) CHASSE[/size][/u][/b][/center]\r<br />Chasser des animaux ne vous pernettra plus sitôt de les dépecer, mais vous devrez apprendre à dépecer:\r<br />Trouver au &#34;chasseur ivre&#34; à blancherive des livres de compétences mise en vente pour acquérir les connaissances nécessaires.\r<br />-&gt; apprenez à obtenir les fourrures,\r<br />-&gt; les ingrédients alcimiques\r<br />-&gt; les ossatures et autres trophées ajoutées...\r<br />\r<br />[b][u][size=4][center]15) CHASSE[/center][/size][/u][/b]\r<br />Petit Mod s&#39;adressant à ceux qui comme moi privilégient l&#39;utilisation de la vue en première personne pour \r<br />- l&#39;utilisation de l&#39;arc, la camera passera grâce à ce mod automatiquement en première personne à chaque utilisation de l&#39;arc.\r<br />- la magie pour mieux viser les sorts.\r<br />En MCM option l&#39;un, l&#39;autre, ou les deux ou aucun.\r<br />\r<br />[b][u][size=4][center]16) BOIRE-MANGER-DORMIR[/center][/size][/u][/b]\r<br />- Gestion de la faim, soif, et sommeil.\r<br />- En vampire, pas besoin de nourriture ni de sommeil.\r<br />- Affichage régulière de l&#39;état de vos besoins par petites barres graphiques en haut a gauch de l&#39;écran de jeu.\r<br />- Fabriquer des sacs de couchages à la forge et utiliser les partout dans votre aventure &#33; \r<br />  Jetez le parterre depuis votre inventaire et il s&#39;étendra parfaitement devant vous, utilisable.\r<br />- La consommation de boisson ou potions est animée, on voit son perso boire ou manger.\r<br />  En combat, ceci se déoule dans une bulle temporelle de ralentissement, \r<br />  ce qui empêche de vous faire assomer le temps d&#39;avaler une boisson.\r<br />- Ajout d&#39;un gameplay bucheron, allumage de feu, feu de camp avec grillades, \r<br />  partout où vous voudrez au cours de votre avenure:\r<br />  Équipé(e) d&#39;une hâche de bucheron, frappez sur les arbres en pleine nature et en quelques coups récupérez du petit bois pour allumer un feu. \r<br />  Ou fabriquez du petit bois en frappant avec votre hache sur les morceaux de bois qu&#39;on récupère habituellement des souches de coupes. \r<br />  Placez ensuite parterre n&#39;importe où 5 morceaux (au moins) de &#34;petit bois de feu&#34; en un petit tas, \r<br />  et lancez dessus le sort de flammes du tout début du jeu. Attendez quelques secondes, arrosez toutes les bûchettes de feu.\r<br />  Un vrai feu de camp va apparaître &#33;\r<br />  Vous pourrez griller vos viandes (sans sel) en utilisant la casserole.\r<br />  Attention: Fonctionne seulement avec les bûchettes &#34;petit bois de feu&#34;, pas les buches vanilla &#33;&#33;\r<br />\r<br />[b][u][size=4][center]17) ARENA:[/center][/size][/u][/b]\r<br />Découvrez grâce à ce mod l&#39;arène de Vendeaume:\r<br />Passez le pont de Vendeaume en quittant la ville, prenez à gauche aux écuries, passez la première ferme sur votre droite puis montez montez un petit chemin, sillon de traces pour rejoindre un camp chasseur sur les hauteurs.\r<br />Dominant une vue splendide, voici l&#39;arène.\r<br />Parlez au maître de l&#39;arène assis devant le grand feu.\r<br />-&gt; Gagnez de l&#39;or en combattant toutes sortes de créatures, choississez quel adversaire et leur nombre.\r<br />-&gt; Pariez sur des combats entre deux équipes.\r<br />Regardez le spectacle de sauvages créatures s&#39;affrontant et remportez (ou non..) votre pari.\r<br />\r<br />[b][u][size=4][center]18) TENUES-RPG[/center][/size][/u][/b]\r<br />Si vous aussi Vous vous êtes étonnés..\r<br />..d&#39;apparaître devant Ulfric en tenue complète impériale sans pour autant qu&#39;il ne bronche,\r<br />..de pouvoir traverser un camp militaire impérial en tenue de sombrage sans que personne de bouge,\r<br />..de vous faire attaquer par des archers parjures à 50 mètres alors que vous portez une tenue parjure &#33;\r<br />(Mince suis-je si connu que tous me reconnaissent sous mon casque ?)\r<br />Ou bien auriez-vous souhaiter pouvoir jouer un moment en tant que bandit, voire traverser tout le jeu comme parjure ou nécromancien ?&#33;\r<br />---&gt; Ce mod est fait pour vous.\r<br />En effet ce mod donne des conséquences très RPG à votre accoutrement, reliant votre identité dans le jeu à votre tenue. Ainsi déguisez-vous, imposez-vous ou camouflez-vous en bandit, impérial, sombrage, thalmor, mage-sorcier, parjure, nécromancien, à votre guise: Enfilez simplement leur tenue &#33;\r<br />Attention:\r<br />- chaque faction va réagir à votre accoutremement de facon conséquente: Amis/ennemis, peu importe le fil de votre histoire, de facon réaliste, si vous vous trouvez parmi des impériaux, ne mettez pas une tenue sombrage devant eux sous peine de les provoquer; ils engageront immédiatement le combat &#33;\r<br />- Vous pourrez désormais traverser pacifiquement un camps de bandit, parjure ou nécromanciens, revêtu de leur accoutrememnt typique: ils vous considéreront dès lors comme l&#39;un d&#39;entre eux.\r<br />- Si un groupe d&#39;une faction particulière a engagé un combat avec vous, cela ne vous sauvera PAS d&#39;enfiler à la va-vite leur accoutrement sous leur yeux; une fois repéré, ils continueront de vous attaquer..Pensez-donc à vous camoufler caché, avant le combat &#33;&#33;\r<br />- Un accoutrement, pour être reconnu complet par la facion auquel il appartient, doit se composer de la cuirasse de la faction (équipée) et de deux pièces au moins de l&#39;armure au choix: Bouclier, gants, casque, bottes.\r<br />- Chaque changement d&#39;appartenance de votre tenue vous sera signaler en cours de jeu par un son caractéristique et une info écrite au coin supérieure gauche de l&#39;écran.\r<br />- Votre accoutrememnt si incomplet ou composé de différentes pièces sera considéré comme &#34;neutre&#34;.\r<br />- Cliquez sur un vieux livre appelé &#34;check Outfit&#34; que vous trouverez dans les &#34;autres objets&#34; de votre inventaire pour consulter quelle tenue vous affichez actuellement.\r<br />Vous voilà désormais un guerrier anonyme, capable de se dissimuler, de tromper amis comme ennemis sous l&#39;apparence. Vraiment, l&#39;habit ne fait pas le moine...\r<br />\r<br />[b][u][size=4][center]19) MORE WORLD INTERACTIONS:[/center][/size][/u][/b]\r<br />   - Ah la guerre civile en Bordeciel c&#39;est fou ce que ca se dispute ;)\r<br />   - Ce mod génère des batailles alétoires autour de vous entre sombrages et    Impériaux.\r<br />   - Prenez-y part ou non c&#39;est votre choix.\r<br />   - MCM: Configurez la fréquence d&#39;apparition, le nombre d&#39;adverasires prenant part.       Attention à votre configuration PC, cela coute en RAM.\r<br />\r<br />[b][u][size=4][center]20) Commerce difficile[/center][/size][/u][/b]\r<br />   - Le seul Mod pas configurable Ingame.\r<br />   - Il empêche l&#39;enrichissement trop rapide du joueur en rabaissant tous les prix de    vente de vos biens chez les marchands.\r<br />   - Force à l&#39;aventure pour la richesse.\r<br />\r<br />ENJOY IT,\r<br />[u]Marcoousik[/u]",
  "categoryId": "79",
  "version": "1.5",
  "author": "Marcoousik",
  "createdUnix": "1431862343",
  "updatedUnix": "1460010851",
  "containsAdultContent": false,
  "uploadedBy": "marcousik",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000160455",
      "name": "USURE_OVERHAUL",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1523",
      "fileName": "USURE_OVERHAUL-66005-1-1.zip",
      "uploadedUnix": "1431862333",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e24eb070da0ef80922ce9850e2c21c553116f5f980aaf0ddb0618bc94c05ef0f/analysis/1431862383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/USURE_OVERHAUL-66005-1-1.zip?fid=1000160455&ttl=1535854544&ri=8192&rs=8192&setec=fa00bca8b137db75c7c38b4e372ce2f8"
    },
    {
      "fileId": "1000161444",
      "name": "USURE_OVERHAUL_V1.2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1293",
      "fileName": "USURE_OVERHAUL_V1.2-66005-1-2.zip",
      "uploadedUnix": "1432495152",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/8dc838c35367b5af0285338636b952673630889c4fd66962d681ca52c5d4ec95/analysis/1432495206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/USURE_OVERHAUL_V1.2-66005-1-2.zip?fid=1000161444&ttl=1535854545&ri=8192&rs=8192&setec=cf75ba5053baac6c2ffdced3476a291f"
    },
    {
      "fileId": "1000163382",
      "name": "USURE_OVERHAUL_V1.4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1526",
      "fileName": "USURE_OVERHAUL_V1.4-66005-1-4.zip",
      "uploadedUnix": "1433777427",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/02c9164b7338403e4e8094b8f8a2916d9cb26ad8b6987fbf2e907119b4b68dbd/analysis/1433777463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/USURE_OVERHAUL_V1.4-66005-1-4.zip?fid=1000163382&ttl=1535854545&ri=8192&rs=8192&setec=6ad6ece431a2ff21fc59a1cb621432eb"
    },
    {
      "fileId": "1000202053",
      "name": "USURE_OVERHAUL_V1.5",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1527",
      "fileName": "USURE_OVERHAUL_V1.5-66005-1-5.zip",
      "uploadedUnix": "1460010851",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/d877c4abd3628a6eacd158c925f643dcaa3eddfe624ed94e97dfa7c2a08f6022/analysis/1460010910/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/USURE_OVERHAUL_V1.5-66005-1-5.zip?fid=1000202053&ttl=1535854546&ri=8192&rs=8192&setec=35ea67c2b68c2f058c4bedd1cf234486"
    }
  ]
}