{
  "modId": 66029.0,
  "modName": "Little Lair",
  "summary": "Requires Dawnguard. This is a small vampire themed home made for my vampire character. There are two versions:\r<br />Pureblood and Halfblood. The Halfblood version is tailored to my character, while the Pureblood is a bit more on the vampire side of things. Please see the rest of the description for more information.",
  "descriptionHtml": "Requires Dawnguard. This is a small vampire themed home made for my vampire character. There are two versions: Pureblood and Halfblood. The Halfblood version is tailored to my character, while the Pureblood is a bit more on the vampire side of things. Just choose one version only to use. None of the meshes used from resources were directly modified in my mod. I either used null texture or texture sets within the CK to get things to look the way they do.\r<br />\r<br />Features:\r<br />For both versions:\r<br />-A small wolf pet/follower named Fluff (named after what I call my cat at times).\r<br />-A spell tome that adds a summonable Fiery Bone Horse based off the game jam texture (though slightly altered) included in the high res texture pack. Spell tome is inside the books container.\r<br />-A vampire amulet and vampire ring (silver and red gem versions), without enchantments, found in the Jewelry container. \r<br />-A unique fountain/crafting station for blood potions, and two new plants with a new food and ingredient to be used as ingredients for the blood potion recipe. Blood Flower has an ingredient with restore health, fortify health, regenerate health, and fear. Blood Berry has a food item that can sate your vampire&#39;s thirst on the spot. \r<br />-Working Well Rested bonus. \r<br />-Several custom containers including Food, Ingredients, Potions, Books, Equipment, Jewelry, and an End Table. \r<br />-Fast Travel Marker that you can already travel too\r<br />-An alchemy workstation (no other crafting aside from the fountain)\r<br />-Navmeshed inside\r<br />-Cleaned with Tes5Edit\r<br />\r<br />For Halfblood:\r<br />-There is a small plate of food on the table in front of the fireplace. This is the food container. \r<br />-There is a bed without the vampire bonus, but working well rested bonus.\r<br />-The alchemy lab, bottle, and flask, is green.\r<br />\r<br />For Pureblood:\r<br />-The food on the table in front of the fireplace is replaced with the blood potion on the floor. This is the food container.\r<br />-There is a coffin with the vampire bonus, and working well rested bonus.\r<br />-The alchemy lab, bottle, and flask, is red.\r<br />-Sweetrolls have a bloody frosting\r<br />\r<br />Known Issues:\r<br />The crafting station can be a bit hard to click on. The &#34;use&#34; shows up near the top of the chalice. \r<br />The blood berry plant may be hard to click on near the bed/coffin. Try clicking above the sweetrolls.\r<br />The animation from the alchemy lab is a little off center due to the fact its slightly smaller.\r<br />\r<br />Compatibility:\r<br />Not compatible with Dark Lair. Same exterior location. Dark Lair has an extra room for a follower though.\r<br />Might be incompatible with other pet mods and follower mods. I added some dialouge to the DialougeFollower quest for the wolf pet, and altered a message to be more generic (AnimalDismissMessage specifically).",
  "categoryId": "67",
  "version": "1.0",
  "author": "Faelrin",
  "createdUnix": "1431907831",
  "updatedUnix": "1484952685",
  "containsAdultContent": false,
  "uploadedBy": "Faelrin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000234239",
      "name": "Little Lair Half-Blood Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18655",
      "fileName": "Little Lair Half-Blood Version-66029-1-0.rar",
      "uploadedUnix": "1484952616",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2c67527c6092fa3efd8903ec9d20c08af3479b6ebde483c14d7771f34dbe98d9/analysis/1484952967/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Lair%20Half-Blood%20Version-66029-1-0.rar?fid=1000234239&ttl=1535854568&ri=8192&rs=8192&setec=550702cb9e80c0053c08814283b4f253"
    },
    {
      "fileId": "1000234240",
      "name": "Little Lair Pure-Blood Version",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18657",
      "fileName": "Little Lair Pure-Blood Version-66029-1-0.rar",
      "uploadedUnix": "1484952685",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cce87e514f2d58deee35793d5b73c1338aa65e0322de0aa54e77602893b2bd92/analysis/1484952972/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Lair%20Pure-Blood%20Version-66029-1-0.rar?fid=1000234240&ttl=1535854568&ri=8192&rs=8192&setec=d68f0eb66b9e4ef8d99690dc76414e30"
    }
  ]
}