{
  "modId": 66031.0,
  "modName": "Ancient spells with some necromancy spells and scribing desk",
  "summary": "complication of the features of ancient spells of morrowind and oblivion mod, the scribe lectern, some necromancy spells mod, and resurrect the dead spell. all of these spells have been integrated into one file, distributed to appropriate vendors and loot containers, and listed in new crafting station called the scribing desk, which is found in all",
  "descriptionHtml": "whew&#33; alright. first of all: ALL CREDITS GO TO THE FOLLOWING MOD AUTHORS FOR THEIR MODS: \r<br />[url=http://www.nexusmods.com/skyrim/users/3948747]KaptenVit[/url] for the Resurrect Dead Spell mod, [url=http://www.nexusmods.com/skyrim/users/2808920]mcxar[/url] for the Ancient spells- morrowind and oblivion spells, [url=http://www.nexusmods.com/skyrim/users/402499]Saverok007[/url] for the Some Necromany Spells mod,  and [url=http://www.nexusmods.com/skyrim/users/96778]diamok[/url] for The Scribes Lectern mod.\r<br />and also for the resources: [url=http://www.nexusmods.com/skyrim/users/6973877]RefurbMadness[/url] for the Refurb&#39;s Resources, and [url=http://www.nexusmods.com/skyrim/users/2250922]Blary[/url] for the openbook Resource.\r<br />if any of you guys are reading this, thanks for creations\r<br />\r<br />now that that&#39;s out of the way,\r<br />\r<br />DESCRIPTION:\r<br />\r<br />first off: all spells in the vanilla game and in ancient spells of morrowind and oblivion have been made craftable at a new station called the scribing desk, similar to the scribe lectern mod, only with new model (thx to refurbmadness) and lack of scripts. you now don&#39;t need inkwell and quill to make the spelltome (since they are part of the model for the desk, seems redundant). \r<br />also, all vanilla skyrim scrolls can be crafted at the scribing desk\r<br />\r<br />the desk itself is [u]located in every hold of skyrim[/u], in places i feel should be there. they are also in most dungeons with rogue mages, such as sunderstone gorge or hob&#39;s fall cave. one is also in the bard&#39;s college .... cause what kind of a bard doesn&#39;t craft spells..... darn now i feel like i should remove it from there as i&#39;m writing this.....\r<br />and of course they are in the arcaneum and the archmage quarters in winterhold.\r<br />\r<br />the reasoning behind this is that there has to be some way that court wizards make the spell tomes and scrolls so that they can sell them to you, just as \r<br />blacksmiths need forges to make armor, and alchemists need the alchemy lab. while there is no practical reason for you to make spell tomes, this is just to create immersion. idk maybe u can sell them back to vendors for gold. make a library of spell tomes in your home? go nuts.\r<br />\r<br /> to [u][b]craft the spelltomes[/b][/u], you need to KNOW the spells already&#33; yea, no cheating your way to get the spell beforehand&#33; you also need a roll of paper (for scrolls) or unenchanted spell tome (for spell tomes). you also need a filled soul gem equal to the level of the spell being made, and the enchanter perk of that level. \r<br />      ex: creating a flames spell tome requires you knowing the spell, a petty soul gem, and the first enchanter perk. \r<br />now you can play as a complete enchanter that uses scrolls to kill people, rather than the actual spells (even though you know them but have no magicka for them)\r<br />the [b][u]unenchanted tomes [/u][/b]can be crafted at the scribing desk with some leather strips, paper rolls, or crafted from ruined books (but they have to be in your inventory so as to not clutter up the menu), OR you can buy them from court wizards and other vendors, as will as paper rolls. \r<br />one soul gem is needed per one tome, while one is needed for every 3 scrolls. didnt seem fair to waste a grand soul gem for only one scroll of fire storm.\r<br />\r<br />(i may do a dawnguard and dragonborn compatiblity in the future, but eh, i feel like spells in those dlcs are more of &#34;reward&#34; for exploring a specific area, rather than commonly known spells in skyrim. we&#39;ll see)\r<br />\r<br />- next: due to the problems in the ancient spells mod, such as the non-working unlock spell, or spells that i think don&#39;t make sense to exist 200 years after the oblivion crisis, they have been cut out (such as conjure spider, or conjure golden saint). so if you want an unlock spell that works, there are many mods for those, but i recommend lock overhaul mod since it lets you use destruction spells to destroy locks.\r<br />anyway, those spells have been replaced with necromancy spells, such as reanimate undead (thx to [url=http://www.nexusmods.com/skyrim/users/402499]Saverok007[/url] and his necromancy mod)\r<br />\r<br />-RESTRICTIONS: because of how necromancy is, and how enthralling the dead works, i have placed restrictions on some of the necromancy spells. just hear me out and dont flip your s#@t:  \r<br />-In order to summon a skeleton, you need to have a human skull on you, some bone meal, and a filled soulgem of the level of the spell (novice = petty, apprentice = lesser, adept = common, etc). \r<br />however, SUMMONED SKELETONS LAST PERMANENTLY, or until they get killed. remember, skeletons suck in skyrim, so it makes sense that a novice conjurer can summon a permanent skeleton from a petty soul gem and the bone meal and skull.\r<br />same applies to corrupt shade thrall, ghost thrall, and the reanimate undead spells.\r<br />all conjuration spells that last for a few minutes are untouched. dead thrall is also left alone. i only focused on the mod spells.\r<br />\r<br />that said, remember that quest in windhelm where  #SPOILER calixto butchered all those women to try and bring back his sister? well, based on the resurrect dead spell by KaptenVit, you can now bring back the dead the same way calixto intended ...... sort of. the spell tome (well, more of a power tome) is located in #SPOILER calixto&#39;s house, next to his locked chest that can only be opened with his key. \r<br />   to resurrect the dead, you need to place a filled black soul gem and a human heart on the corpse, while wearing the necromancer amulet. the spell is in the form of a power and can only be used once a day. i made it into a power since calixto is not a necromancer, let alone knows anything about conjuration, and yet he was planning on bringing back his sister. also, you&#39;re not turning the corpse into a zombie, or controlling it, its just resurrected to the same npc it was. this power only works on npcs, and cannot be turned into a spelltome using this mod. \r<br />\r<br />on the subject of necromancy, i also fixed sild&#39;s staff to actually conjure a ghost, like it was intended in the vanilla game. yay.\r<br />\r<br />finally: all the requirements for your necromancy spells are listed in the spell description, so no need to list them all here.\r<br />all the spells in this mod have been added to the level loots throughout \r<br />skyrim, and added to vendors that make sense to sell them. immersion, \r<br />and lore friendly an wat not. \r<br />[u][i][b]\r<br />In version 2, [/b][/i][/u]i changed the vanilla thrall spells, so if you dont want those spells changed, dont download it. the changes are that in order to permanently summon a thrall (dead, frost, flame, or storm), you will need proper ingredients with you. you need a daedra heart in your inventory, and fire salts for flame thrall, void for storm, and frost for frost. for dead thrall, you need to have  afilled black soul gem in your inventory, and the corpse must have nightshade and namira&#39;s rot. furthermore, i added nightshade as a requirement for all the new conjuration spells that last permanently, such as ghosts, and skeletons. \r<br />temporary spells are untouched&#33;\r<br />my reasoning is that these thrall spells last forever, even the skeletons and ghost thrall. in the lore, this is impossible without the proper ritual to make them last. also, daedra cannot be bound forever to nirn, so it makes sense that ingredients are needed to keep the atronachs permanent\r<br />oh. i also fixed that error in the original game with storm atronach was summoned instead of potent storm thrall.\r<br />\r<br />[b][i][u]version 3:[/u][/i][/b] same as version 2, but no enchanting tree required. i felt that it was too much required to recreate a tome you already read, so yea, no more enchanting perks needed, just the spell known. the enchanting tree is back to normal. i also added a new ghost thrall spell, using any vanilla skull, and lowered the cost for the original ghost thrall that used the ancient guardian skull. i also brought in the transmogrify and conjure arrow spells from the vanilla game, but tweaked them to make sense. the transmogrify is now alteration and is found on [url=http://www.uesp.net/wiki/Skyrim:Brelyna_Maryon]Brelyna Maryon[/url]&#39;s dresser in the college of winterhold. i replaced the shadow shape spell with the conjure arrow, and made it an illusion spell instead, since no arrow is actually fired, um yea thats it\r<br />\r<br />version 4, sigh, yes, another version: I added 2 spells conjure wispmother and wispmother thrall, because in the lore they are technically ghosts, with greater souls, I made it an expert spell to summon the thrall, and a adept to conjure it for a short time. the thrall requires wisp wrappings, glow dust, nightshade, and a greater filled soul gem. furthermore, to balance out all the conjures for necromancy, the ghost thrall spell is now a master spell, and summon ghost is expert. the thrall requires a grand soul gem, just like that necrophilic elf in yngvild used for his ghost harem. also some minor grammar fixes, again, yes, I cant get them all, damit I&#39;m sry okay&#33;&#33;&#33;\r<br />\r<br />now maybe some of you argue that this was too much, and that wispmothers are elemental aspects of snow and not actually ghosts. yea. yea. you maybe right, but  no one really knows as mentioned in the lore article here [url=http://www.uesp.net/wiki/Skyrim:Wispmother][u][color=#0066cc]Skyrim[/color][/u][/url] so yea. if you think they are not ghosts, then don&#39;t download, but I just wanted an inferior transition between conjuring ghosts and conjuring skeletons, that required a greater soul. so boom, wispmothers. \r<br />\r<br />again if you dont want changes to vanilla thrall spells, dont download version 2 or 3, but if you are cool with thrall requirements and want scribing free from requiring enchanting perks, enjoy version 3 :)\r<br />\r<br />\r<br />OKAY FINAL VERSION.... until I make a final final version:\r<br />I added a conjure ice wraith spell and ice wraith thrall spell, and conjure familiar thrall spell. obviously the thrall spells last permanently, and need my obligatory requirements such as nightshade, a soul gem, etc. ice wraith thrall requires essence of ice wraith, nightshade, a common filled soul gem, and ice wraith teeth. familiar thrall needs a wolf pelt (not an ice wolf pelt, a normal one&#33;) , nightshade, ectoplasm, and a filled lesser soulgem.\r<br />\r<br />my insane reasoning behind the ice wraith is that it is an ethereal spirit made of ice. it is a spirit, therefore conjurable, like the wispmothers and the familiar. my reasoning behind the wispmother is that she is a lich form of a female snow elf (which explains why she has elf ears and is pale white, no racist).\r<br />\r<br />\r<br />[i][u][b]6/2016 version ([/b][/u][/i]idk, is it 7? probably version 7)\r<br />   added two spells to fill my need for something darker behind the midden: a soul trap that damages the targets, adept, conjuration, not too strong, not too weak, with a tiny story behind it. another is a light beam spell, restoration, novice, found in the augur&#39;s chamber on a pedestal behind him, pretty weak, but does more damage to undead.\r<br />did this because I wasn&#39;t happy with my &#34;tiny midden improvement&#34; mod, so did this instead.\r<br />also fixed that recipe for the familiar thrall spell not showing.\r<br />\r<br />\r<br />\r<br />on a side note, i recommend using Cutting Room Floor by[url=http://www.nexusmods.com/skyrim/users/684492] Arthmoor[/url] for the ancient traveler ghost that  is found at wayward pass, just so that the conjure ghost thrall makes sense, found here: http://www.nexusmods.com/skyrim/mods/47327/?\r<br />i also recommend corpse preparation by mojo since it inspired me to add more requirements to thrall spells, such as night shade, soul gems, skulls, etc. http://www.nexusmods.com/skyrim/mods/35378/?  \r<br />\r<br />and as always, report any bugs, because i myself will be using my own mod for my playthrough, so yea, i&#39;ll always be updating this in case i find any problems. so yea. report dem bugs if u find any. \r<br />\r<br />dam that was a long description&#33; like it took me a good half hour to write dis. how long did it take you to read it?  you didnt read it? u so bad, bro XD",
  "categoryId": "75",
  "version": "8",
  "author": "me",
  "createdUnix": "1431915225",
  "updatedUnix": "1468167209",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000160573",
      "name": "version 1 ancient spells with necromancy and a scribing desk - outdated",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1847",
      "fileName": "ancient spells with necromancy and a scribing desk-66031-1.rar",
      "uploadedUnix": "1431915220",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/757b6ee70f88f59acff33f16a644cf17db80691349b820aa2ee030173a954950/analysis/1431915243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ancient%20spells%20with%20necromancy%20and%20a%20scribing%20desk-66031-1.rar?fid=1000160573&ttl=1535854570&ri=8192&rs=8192&setec=0dd106791983e2a282f789c603c10c40"
    },
    {
      "fileId": "1000161058",
      "name": "version 2 editted the vanilla thrall spells",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1847",
      "fileName": "alternate file-66031-2.rar",
      "uploadedUnix": "1432267081",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/1f7b30909309b32d9b2911b4223432ce4c1c4da699a1e0fbe0dbb2d5fb2d78b8/analysis/1432267145/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alternate%20file-66031-2.rar?fid=1000161058&ttl=1535854571&ri=8192&rs=8192&setec=dd0b79c5f4ede7e4e99f17e444546111"
    },
    {
      "fileId": "1000162883",
      "name": "version 3 no enchant requirements",
      "version": "3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1849",
      "fileName": "alternate version with no enchant requirements-66031-3.rar",
      "uploadedUnix": "1433379738",
      "modVersion": "3",
      "virusScanUrl": "https://www.virustotal.com/file/aef3c7c9f68a5e888db25dc44c805d8b502abb16ac6f4afbfda7141445fbf65b/analysis/1433379785/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alternate%20version%20with%20no%20enchant%20requirements-66031-3.rar?fid=1000162883&ttl=1535854571&ri=8192&rs=8192&setec=8855787351bbe2ab323bf0240d6c8656"
    },
    {
      "fileId": "1000164504",
      "name": "version 5 no enchanting skill req added wispmother ice wraith familar thrall",
      "version": "5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1853",
      "fileName": "final version no enchanting skill req added wispmother ice wraith familar thrall-66031-5.rar",
      "uploadedUnix": "1434573972",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/ab0528ead64d338bb3745a1e8154083d8bb5db75b05d876b713aa8981465f82f/analysis/1434574023/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/final%20version%20no%20enchanting%20skill%20req%20added%20wispmother%20ice%20wraith%20familar%20thrall-66031-5.rar?fid=1000164504&ttl=1535854572&ri=8192&rs=8192&setec=577486aecc5435ff9470e26e04916f00"
    },
    {
      "fileId": "1000212804",
      "name": "version 8",
      "version": "8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1859",
      "fileName": "version 8-66031-8.rar",
      "uploadedUnix": "1468167209",
      "modVersion": "8",
      "virusScanUrl": "https://www.virustotal.com/file/3c47ef7b588489752819cd6b988fe39c160691fbd44363a308f2bba5910c5a44/analysis/1468167243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/version%208-66031-8.rar?fid=1000212804&ttl=1535854572&ri=8192&rs=8192&setec=d942e3934fb0ee824ef7d15f62eca0b1"
    }
  ]
}