{
  "modId": 66051.0,
  "modName": "JB Dwemer Quest - The Dwemer Mystery",
  "summary": "The Dwemer yet live&#33;  Ok, this is my first attempt at serious modding.  The quest and dungeon(s) are all original, just my humble attempt at game concepts.",
  "descriptionHtml": "[center]\r<br />[u][font=Imprint MT Shadow][size=6]The Elder Scrolls V: Trorlatz[/size][/font][/u]\r<br />[img]http://staticdelivery.nexusmods.com/mods/110/images/66051-0-1456683177.png[/img][/center][center]\r<br />____________________________________________________________________________________________________________________________\r<br />[font=Imprint MT Shadow][size=5][u][img]http://i.stack.imgur.com/Pm296.png[/img][/u]   [u]DESCRIPTION[/u][/size][/font]     [img]http://i.stack.imgur.com/Pm296.png[/img]\r<br />____________________________________________________________________________________________________________________________[/center]\r<br />Hello All, This is my W.I.P. quest called the Dwemer Mystery. My idea is that the player meets, Geamer Banner-Spear, an explorer of Dwemer ruins.  He has part of a book that claims there are surviving Dwemer, though they are few and dwindling.  He asks the player to help him find an undamaged copy of the book. Outline is, find the book, take it back to Geamer. Go with, or meet Geamer at location X. Find the living Dwemer.  They are imprisoned, if they leave their enchantment protected area they become\r<br />afflicted or die.  They ask for the player’s help in getting a lexicon that holds a possible cure to their\r<br />predicament. And so forth.  At the moment, I have made Geamer, made the first part of his book.  I’ve created the Dwemer race (playable as well as NPC).  And made the dungeon where the lexicon is.  I haven’t started on putting the quest together yet, figuring the rest needs created first. Geamer is in Winterhold College in the Arcanaeum at the moment.  I hope to give him unique voiced dialogue.  He has the damaged version of the book on him.  The Dwemer Vault dungeon is a little obscure to find (it wouldn&#39;t be a mystery otherwise).  So, I’d suggest if you want to try it out to coc jbdhiddenpasslostdwemervault.  I know that’s kind of long, but I felt it was easier to find and identify if I gave the cell names longer titles. Things I haven’t put into the game yet the Dwemer NPC (tested them but not put them in) or the afflicted Dwemer I hope to make as enemy NPC’s.  Haven’t made the Dwemer camp, or the secondpart of the book.  And none of the quest is hooked up yet. I appreciate any thoughts or suggestions you all might have.   \r<br />   Thank you.\r<br />\r<br />[center][/center][center]_____________________________________________________________________________________________________________________________\r<br />\r<br />[u][font=Imprint MT Shadow][size=5][font=Imprint MT Shadow][size=5][u][img]http://i.stack.imgur.com/Pm296.png[/img][/u][/size][/font][/size][/font][/u][font=Imprint MT Shadow][size=5][font=Imprint MT Shadow][size=5]    [/size][/font][/size][/font][size=5][u][font=Imprint MT Shadow]UPDATE LOG[/font][/u]  [/size]   [img]http://i.stack.imgur.com/Pm296.png[/img]\r<br />_____________________________________________________________________________________________________________________________[/center][center][/center]\r<br />Just a note to let people know that the mod is still in progress. The great SpikeDragonLord has been a real boon to the mod project. We plan to broaden the quest and make it a little more believable. Since the dungeons will be on the difficult side, we are also going to make it so that the quest won&#39;t be available until the player character has become the archmage. Also, there will be some interesting side quests in the dwemer city. And the introduction of the half-dwemer race, the Khazad&#33;\r<br />\r<br />[u][size=4]Version .30[/size][/u]\r<br />\r<br />Great news, I&#39;m still here&#33;  And even better news, the talented SpikeDragonLord has joined me on making this mod great.  He&#39;s got an amazing eye for clutter&#33;  There is still tons left to do, but it&#39;s looking impressive and I just wanted to share the update.\r<br />\r<br />Addendum 3,\r<br />\r<br />Still around&#33;  I know, I&#39;ve been terribly lax with updates.  While I still have plans for this mod, other mods have demanded more of my time and energy.  The great Spikedragonlord and I have been busy making a new gorgon race(he&#39;s tinkering with the textures as we speak), they look awesome and you will be impressed with several features(the snake lower body has physics making it look like they are slithering).  So, hopefully, after we have the gorgons up, have the items for the atmora expedition mod finished, we&#39;ll take some time to add a little more to the mod.  Mostly, I believe, it is just the new quest stuff that needs to be added(not to mention the voice acting if I ever can find any one to do the job).\r<br />\r<br />[size=4][u]Version .21[/u][/size]\r<br />\r<br />Well, I think the mod is coming together nicely.  Still have a huge amount of cluttering to do.  And then there is all the fixtures(working sinks and bathrooms).  I&#39;m looking around for voice actors(I tried it myself and remembered I suck at it), but I can&#39;t afford to pay, so it&#39;ll have to be out of the kindness of their heart.  Still have to add the custom AI to the Dwemer leader, figure out how to make Geamer&#39;s AI a little more combat friendly(as is he tends to draw all the enemies attention at the same time - can be overwhelming), make the custom outfits for Bthurlac and the tonal architects, add more healthy Dwemer to the city.  And so much more. :)\r<br />\r<br />[b]Addendum 2,[/b]\r<br />\r<br />Well, still around, but I had a major set back.  I forgot that the archiver with creation kit is dangerous if you have the bsa file loaded anywhere near where your mod file is saved.  It ate my mod&#33;  Just gone, I had to get an old version and start doing a bunch of stuff all over again.  Some of which I don&#39;t remember how I got to work in the first place.  It has been very frustrating.  I&#39;ve got to get the npc to wear their outfit again, I&#39;ve got to figure out why Monrein is not doing what he&#39;s supposed to.  Good news though, I&#39;ve got the sprinkler system sort of working in the garden area and started work on the Mayor&#39;s/dwemer leader&#39;s house.  And I&#39;ve made it so that you can travel from inside Trorlatz.  Hopefully, I&#39;ll be posting version .21 soon.\r<br />\r<br />[size=4][u]Version .18[/u][/size]\r<br />\r<br />Still around&#33;  I know, a complete shocker right?  Anyway, I&#39;ve got one of the ambushes set up.  For some reason on my test play through, one of the npc&#39;s wasn&#39;t wearing the clothes I assigned.  Let me know if that&#39;s the case for any of you.  Yes, I know, I still need to do a lot of cluttering.  But all the things I&#39;ve got going, the serious cluttering is way down on the list.  I&#39;ve built a large Jacuzzi like bathtub in Monrein&#39;s home (cell jbdsecrethome), it works pretty good.  Some of the immediate things I&#39;m still working on.  I want to texture some custom outfits for the enemy npcs as well as the surviving dwemer.  I&#39;m still trying to figure out how to take existing dialogue and edit it to make the voice acting - my voice acting is horrible and I have no desire to subject you all to it.  Have to figure out why the lexicon cube no longer enters the lexicon stand.  When I fixed the quest so using the stand moved it to the next stage, the lexicon cube no longer works.  Anyway, here is the most recent mod, let me know what you think.\r<br />\r<br />\r<br />[b]Addendum,[/b]\r<br />\r<br />Well, I hope you all don&#39;t think I&#39;ve abandoned this project.  If you did, good news, I haven&#39;t.  The bad news, I&#39;ve just been struggling for the last two weeks with different issues.  I decided that since I had all of the shells to the dungeon and secret places made, I should create the quest.  First, I needed scripts that would make my end device work.  Once I solved that, which took a long time, I started on making the quest.  I&#39;ve now made the stupid thing 4 times, and only on this last attempt has it worked at all.  But it is buggy as all get out.  The NPC&#39;s talk, but since I haven&#39;t gotten around to recording any voice stuff yet, there are no words. I thought there would at least be text to read, but there&#39;s nothing.  I&#39;m not sure why.  And the trigger box doesn&#39;t work.  The player is supposed to be teleported to an x marker outside the city once they enter the trigger box.  Nothing happens.  And while the device works pretty good, the quest doesn&#39;t progress to the next part.  So, I&#39;m having a time trying to get this thing to work.  Once I do, I&#39;ll post it up here.  (Then it&#39;s back to cluttering and adding more icing to the mod - lots of time consuming stuff.)\r<br />\r<br />[size=4][u]Version .16[/u][/size]\r<br />\r<br />The quest should work(fingers crossed).  I&#39;m still trying to figure out how to get the teleport to blackreach trigger box to work.  So, when Monrein tells you he&#39;ll teleport you, he won&#39;t.  Sorry.  Also, only the vault has enemy npc&#39;s as of the moment.  Since I&#39;m still working out the kinks of the quest, I haven&#39;t put in the rest yet.  I have plans for an ambush from the afflicted Dwemer.  I&#39;d also like to make it so that Geamer and/or Monrein can join you on the quest without replacing the player follower.  If I can figure that out, there will be changes to the quest dialogue.  Oh, and I&#39;m planning on making them fully voiced - don&#39;t worry that horrible voice acting that Geamer has in those two lines were just tests.  I intend to use the nord voice bsa recordings to edit and get what I want him to say.  We&#39;ll see.  I hope you enjoy the quest.  Please, let me know what you think.\r<br />[color=#000000]\r<br />[/color][size=4][u]Version .04[/u][/size]\r<br />\r<br />Well, the shell to the dwemer city is built.  If you are one of the people who downloaded it before I caught the seam issues, sorry.  And sorry for not putting a map marker in.  If you download it now the map marker works.  the coc is jbdfreeholdercitytrorlatz.  For some reason though, it will spawn you in front of a farm overseers house, which is a little to the right and slightly down hill from the hidden entrance.  It&#39;s in the side of the ruined building, almost completely hidden in the rubble.\r<br />\r<br />[size=4][u]Version .06[/u][/size]\r<br />\r<br />I&#39;ve got the shell of the residential area put together.  I&#39;ve laid out one possible set up for the sleeping areas, give me your thoughts, should I go with it or come up with something else.  I&#39;ve got the start for the garden area - the big tree in the middle of the one room.  I&#39;ve also thrown in some more clutter to the first dungeon.  It probably needs more, but at the moment I can&#39;t think of what to add.  Any and all suggestions are appreciated.  I&#39;d have more, but I spent a couple days fighting with the warning that the cell was too big.\r<br />\r<br />[size=4][u]Version .10[/u][/size]\r<br />\r<br />I think this one is pretty impressive.  I&#39;ve got one of the residents&#39; bathroom working.  The shower turns on, the sink turns on.  Of course, I&#39;ve got some tweaking to do, but I think it looks pretty good.  I do have a concern that, since I haven&#39;t archived it into a bsa the textures I made for the soap and towel might not work.  So, if you do get the ugly pink empty texture map - it&#39;s just temporary.  And it&#39;s possible that you might not even get the soap and towel anyway.  Let me know what you all think.\r<br />\r<br />[size=4][u]Version .11[/u][/size]\r<br />\r<br />Okay, it&#39;s come to my attention since I didn&#39;t archive the files into a bsa, the scripts don&#39;t work.  So here is the set where the bathroom stuff actually works.  It still needs some tweaking though, because you have to turn the tap twice to get anything to work.  But it does work.  Also, I&#39;ve added the shell of the home where the npc who found the dwemer lives.  It&#39;s in bleak coast cave, you&#39;ll need the silver necklace that is sitting on the table in the Arcanaeum to open it.  It&#39;s glitch though, instead of making it where you can open the door, the door is just open.  I&#39;ll look into scripting that later.  Enjoy.\r<br />\r<br />[size=4][u]Version .13[/u][/size]\r<br />\r<br />Well, the shell of all my dungeons and special locations are done.  I&#39;m about ready to start making the quest, but I&#39;m having some scripting issues.  If you look at the new screenshots, you&#39;ll see a device activator.  I want it to be one of the last parts of the quest, but for the life of me, I can&#39;t figure out how to make it activate at all, let alone in the way that I want.  Things that have come(belatedly) to my attention.  I forgot to post all the scripts for the bathroom.  I believe I&#39;ve added them all to the file this time, so hopefully, they&#39;ll work.  Things that I plan to do still, there is a whole ton of cluttering still left to do.  I want to make a sprinkler system for the garden area.  I need to figure out how to script the door/entrance to one of the dungeon/secret areas so that it will only open if player has an item.  I have a couple of the enemy npc&#39;s I&#39;ve created, still need to work on a couple texture issues.  I&#39;ve got to create all the living dwemer npc&#39;s.  So, as you can tell, still have a lot to do.  But I&#39;d really like to have the quest at least roughed out for you all.  I&#39;m open for any suggestions and any help you all want to give.  Thanks, and I hope you enjoy what I&#39;ve made so far.  Cheers&#33;",
  "categoryId": "35",
  "version": ".30",
  "author": "jeffboyd4 And SpikeDragonLord",
  "createdUnix": "1431984023",
  "updatedUnix": "1454119254",
  "containsAdultContent": false,
  "uploadedBy": "jboyd4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000193323",
      "name": "jbdwemerquest",
      "version": ".30",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "21355",
      "fileName": "jbdwemerquest-66051--30.zip",
      "uploadedUnix": "1454119254",
      "modVersion": ".30",
      "virusScanUrl": "https://www.virustotal.com/file/a29b20508b2d13ccbd2d33aa4661dd122ffef1dd4c4d0ae05fb1cd7765684b9d/analysis/1454119274/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/jbdwemerquest-66051--30.zip?fid=1000193323&ttl=1535854588&ri=8192&rs=8192&setec=039b8f683e6b08b1ca612ca9a6fffbc8"
    }
  ]
}