{
  "modId": 66182.0,
  "modName": "Legend of Luchian Mildenhall - The Gameplay Machinima Series",
  "summary": "Since I am Working with making videos, After Effects Pictures, etc. Mods, never my specialty. I have Decided to work on a Skyrim Series (Gamplay/Machinima). Luchian Mildenhall the Lykaio Tribal Warrior",
  "descriptionHtml": "[size=6][u][b]About the Series:[/b][/u][/size][size=4]   \r<br />I never was one to take mods (tried to but gets frustrating, but for now I&#39;ll keep at it till I can figure it all out uploading wise) So using what I remembered from making World of WarCraft Machinimas, and experimenting with some videos (don&#39;t care to show). I figured I&#39;d put my attempt into action in the series &#34;Legend of Luchian Mildenhall&#34; which was inspired by VoicesFromTheDark&#39;s &#34;K&#39;joor&#34; series, but However different story aspect, and interpretation for it. [size=4]Legend of Luchian Mildenhall[/size] is a Lykaio (A race mod that I enjoy playing as) Warrior who decided to travel alone. Yet, skyrim is still in mental termoil after the Dovah Crisis, and (hate to mention VFTD again but ah well) the Doben Invasion. He must not only achieve his traveling goal in skyrim outside of his Lykaio Pack (Located East of Bruma in the highly floral part of the mountains), but go on a heroic quest to cure effects left by countless blows in each crisis, and rid the Nord Province of Skyrim from a dark unknown force (to his point of view) that seeks to succeed, where Alduin, and Doben had failed times before.\r<br />\r<br />[size=4][size=6][u][b]Luchian&#39;s Biography:[/b][/u][/size][/size]\r<br />Name: Duskpaw\r<br />Preferred name: Luchian Mildenhall\r<br />Age: 24\r<br />Class: Tribal Warrior (possible shaman further along into the story)\r<br />Pack: Sentinel-Crag Pack\r<br />\r<br />[size=4][size=6][u][b]Luchian&#39;s Story:[/b][/u][/size][/size]\r<br />Luchian is the Current Generation (as to the number I cannot say since the \r<br />years would have to be looked up for generational purposes) in the \r<br />family of the Sentinel-Crag Pack which have been nomads for the the many\r<br /> Eras since the Evaluational Interference caused by the first Falmer to \r<br />come to skyrim named &#34;Scath&#34; that got him corrupted by three Daedric \r<br />Princes, hoping to undo the divines work, and the arrival of the Nords \r<br />of Atmora and their conquest. The Nords had forced the Sentinel-Crag \r<br />Pack out of the land to assume complete occupation of the province. \r<br />\r<br />After the Pack had gone from province to province, Era after Era as nomads \r<br />avoiding confrontation from the locals, Young Duskpaw (a.k.a. Luchian \r<br />Mildenhall) decides to travel skyrim as his pilgrimage to adulthood, and\r<br /> seek the location where the Sentinel-Crag Pack once resided before \r<br />being kicked out of their territory. However, before he could even \r<br />start, he was captured by Imperial Legionaries at the Skyrim Border. \r<br />Although he wasn&#39;t supposed to be on the carriage, he was taken to \r<br />Helgan where the Dovahkiin first came. When it came to his turn to be \r<br />beheaded by the block, a Scath Dragon interrupts allowing him to escape \r<br />along with a Legionnaire after Helgan had rebuilt from the Dragon Crisis\r<br /> years before. \r<br />\r<br />Months after emptying the mine near Riverwood, he sets off a Nordic Ruin to re-retrieve the Golden Claw of Bleakfalls \r<br />Burrow. At the same time, Scath has taken notice from the news about his\r<br /> mine being emptied by Luchian, and has some Bandits search Riverwood \r<br />for him at any cost. When Luchian Returns to riverwood, the township is \r<br />killed except the Blacksmith and his family taken only bruises. Luchian \r<br />Must now Travel Skyrim to protect Riverwood from a second attack by \r<br />finding assistance, and make his way to Find Scath and take him down.\r<br />\r<br />[size=5][u][b]Trailer:[/b][/u][/size]\r<br />[youtube]lfY1M5upQh0[/youtube]\r<br />\r<br />[u][size=5]Episode 1 Pilot:[/size][/u]\r<br />[youtube]x_G0HqHcHRY[/youtube]\r<br />\r<br />[size=5][u][b]Episode 2 Part 1 The Claw of Bleakfalls Berrow:[/b][/u][/size]\r<br />[youtube]u_p02wMGyAg[/youtube]\r<br />\r<br />[u]Legend of Luchian Mildenhall Episode 2 Part 2 In Search of Riverwood&#39;s Aid Part 1:[/u]\r<br />[youtube]m4i4rjpaxlI[/youtube]\r<br />\r<br />[/size]",
  "categoryId": "45",
  "version": "V1",
  "author": "LepidusofRunetotem2014",
  "createdUnix": "1432388284",
  "updatedUnix": "1432388284",
  "containsAdultContent": false,
  "uploadedBy": "LepidusofRunetotem2014",
  "primaryFile": null,
  "files": []
}