{
  "modId": 66255.0,
  "modName": "No more microphone wind",
  "summary": "Removes the constant rumbling wind sound cause ears aren&#39;t microphones.",
  "descriptionHtml": "For some reason, Skyrim is cluttered with noise. Followers talk, bark and howl every three seconds, Dungeons sound like orchestra training grounds, even cobwebs make a sound when you slash through them. At least you can mute the music. It&#39;s as if the developers want to remind us incessantly that the world is alive by not giving us a moment of silence - while for some reason they muffled natural sounds like waterfalls to the point of where you can stand next to a waterfall and hear the ambient wind sound OVER the thundering water. \r<br />\r<br />However, that is the wind sound as a microphone records it. It&#39;s not what you really hear when you&#39;re in a forest or on a mountain. Wind isn&#39;t a constant rumbling noise pollution, it&#39;s a swishing sound in the grass or a whisper in the trees. \r<br />\r<br />I have muted almost every ambient wind sound I could find. Now you can stand in the tundra and actually hear other sounds in the distance.\r<br />\r<br />It&#39;s a simple mod, no esp, I just used Audacity to mute the sound files. I also replaced the snowfall sound with the sound of a real snowfall, which is a very quiet icy tingling sound, not a howling rumble (unless you&#39;re out in a snowstorm). I left the storm sounds untouched and I can&#39;t find a particular rumbling soundfile, so you may still hear the occasional microphone sound.\r<br />\r<br />[b]Install: [/b]\r<br />\r<br />Use NMM or MO and activate it.\r<br />\r<br />The mod only influences wind soundfiles in sound&#92;fx&#92;amb&#92; and sound&#92;fx&#92;ambr. All others remain untouched.\r<br />\r<br />[b]Compatibility:[/b]\r<br />\r<br />No DLC required because I didn&#39;t touch any DLC content.\r<br />\r<br />This works well with [url=http://www.nexusmods.com/skyrim/mods/43773/?]Audio Overhaul For Skyrim 2[/url].\r<br />\r<br />Load my mod after other audio mods.\r<br />\r<br />[b]Incompatibility:[/b]\r<br />\r<br />Any mod that modifies wind soundfiles in sound&#92;fx&#92;amb&#92; or sound&#92;fx&#92;ambr. Place my mod at the end of your load order to keep it from being overwritten.\r<br />\r<br />[b]Credits:[/b]\r<br />\r<br />Bethesda for the game.\r<br />www.freesound.org and www.soundbible.com for the snowfall soundfiles.",
  "categoryId": "61",
  "version": "0.9",
  "author": "Teria23",
  "createdUnix": "1432548432",
  "updatedUnix": "1432548419",
  "containsAdultContent": false,
  "uploadedBy": "Teria23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000161510",
      "name": "No More Microphone Wind",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "44487",
      "fileName": "No More Microphone Wind-66255-0-9.7z",
      "uploadedUnix": "1432548419",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/f4922a20872b140b15221e5a9cd579b8848312e68c3b2e0f7e4998c224491332/analysis/1432548430/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20More%20Microphone%20Wind-66255-0-9.7z?fid=1000161510&ttl=1535854776&ri=8192&rs=8192&setec=a1aa6997ae74353a6b3b1fb549ec736d"
    }
  ]
}