{
  "modId": 66316.0,
  "modName": "Potion crafting and retort alchemy station",
  "summary": "You know that one potion that exists but you can&#39;t make? phantom of the philter? skooma? balmora blue? ever wonder why all apothecaries have the same exact potions, with the same name and effect? well this mod lets you make those potions, with lore friendly restrictions.",
  "descriptionHtml": "   OBSOLETE&#33; THE IMPROVED VERSION IS RIGHT HERE [url=http://www.nexusmods.com/skyrim/mods/66426]Infusing Alembic (Craf...[/url]  the only differences are that the menu is a lot cleaner, skill increases, better textures, more potions and poisons, better lore friendlyish recipes ..... yea you know what, just download that other one, its puts this one to shame\r<br />\r<br />\r<br />I dont always make skyrim mods, but when i do, 83% of the time it&#39;s a crafting mod. no srsly, i did the math.\r<br />so why not make another one:\r<br />\r<br />First of all: NOTHING IS CHANGED IN THE VANILLA GAME&#33; EVERYTHING IS THE SAME, all ingredients are the same, all potions, all effects, everything.\r<br />what this mod does is let you craft potions and poisons already in the game, but at a new crafting station called the Alchemical Retort.\r<br />(i was gonna call it the alembic, but uh, i&#39;m using another mod that adds that, so yea, retort is the next best thing, for when you want to bring back the oblivion and morrowind days)\r<br />\r<br />the pictures i used have different names because of another mod i have that makes finding the potions easier. i think it was removed from steam, so idk where it is. but there are plenty of name changing potion mods out there.\r<br />\r<br />sigh and before you ask: YES, THAT IS JUST A RETEXTURED VERSION OF THE ALCHEMY LAB-TABLETOP. maybe if someone would make a kewler looking alchemy lab or alembic that i can use as a model, but til then, enjoy the lousy retex \r<br />\r<br />[u][b]SO WHAT DOES THIS MOD DO EXACTLY?[/b][/u]\r<br />\r<br />It adds a new station distributed to all apothecaries in skyrim, and valerica in dawnguard. oh yea, dawnguard is required, forgot to mention that minor detail[b][u][i].  DAWNGUARD IS REQUIRED. th[/i][/u][/b]ere we go.\r<br />\r<br />all potions and poisons in the game (excluding thieves guild potions and quest related items like Vaermina&#39;s torpor) are now craftable from their INFERIOR forms. \r<br />[b]\r<br />[u][i]example:  [/i][/u][/b]with an alchemy skill of 20, you can create a stronger healing potion from 2 weaker healing potions. or stamina, or magicka potions, or whatever. with a skill of 40, you can do the same to an even stronger potion. \r<br />say i have 2 potions of strength, but i want a stronger potion of strength. if i have an alchemy skill of 20, i can now take those two potions at the alchemical retort, and make one draught of strength. if i have 40 skill, and 2 draught of strength, i can make one solution of strength.\r<br />\r<br />it&#39;s as simple as that.\r<br />\r<br />BUT THE MOST IMPORTANT PART OF THIS MOD, and the reason i made it in the first place (besides the fact that i was bored), IS THAT YOU CAN MAKE THE POTIONS AND POISONS YOU COULDNT MAKE AT AN ALCHEMY LAB.\r<br />this includes:\r<br />SKOOMA\r<br />DOUBLE DISTILLED SKOOMA\r<br />BALMORA BLUE&#33;&#33;&#33;&#33;\r<br />PHILTER OF THE PHANTOM&#33;&#33;&#33;\r<br />NIGHTSHADE EXTRACT\r<br />LOTUS EXTRACT&#33;\r<br />ICE WRAITH BANE&#33;\r<br />um, what was that one potion called? the one that valerica made, um OH SOUL HUSK EXTRACT&#33;&#33;&#33;&#33;&#33;&#33;\r<br />PHILTER OF THE PHANTOM&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33; o wait i said that already\r<br />um.\r<br />STALLION&#39;S POTION&#33;&#33;&#33;&#33;\r<br />POTION OF BLOOD&#33;  -if ur on the vampire side of dawnguard\r<br />um uh AND MANY MORE&#33; i think. i pretty much listed the important ones.\r<br />\r<br />\r<br />best of all: THIS MOD IS LORE FRIENDLY ..... to the best i can make. \r<br />i mean, you need good skill in alchemy to make some of these potions,\r<br />and you do need the right ingredients for the specified potions listed above, so its not that hard.\r<br />\r<br />\r<br />o yea, U DONT GET ANY ALCHEMY SKILL INCREASES FROM DOING THIS&#33; i mean, i could make a version that gives skill increase, but why should you get any skill increases from mixing two things together? what  do you think dis is, alchemy? ..... ohh. okay i&#39;ll make a skill increasing version if its requested in the comments. deal? \r<br />\r<br />remember: DAWNGUARD IS REQUIRED&#33; IF U NO HAVE DAWNGUARD, THEN GET THE F.... i mean, dont download my mod. sry scrub. ",
  "categoryId": "94",
  "version": "1",
  "author": "paulhanna",
  "createdUnix": "1432665954",
  "updatedUnix": "1432665920",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000161732",
      "name": "alchemical retort version 1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "alchemical retort version 1-66316-1.rar",
      "uploadedUnix": "1432665920",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/2bd0d5f494c3756a96cafa63e6126df453cbf6ff9ac1c798af5f3c7fbcad6df0/analysis/1432665962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/alchemical%20retort%20version%201-66316-1.rar?fid=1000161732&ttl=1535854826&ri=8192&rs=8192&setec=a22aefdbb8aea86a59b181f9e43f1865"
    }
  ]
}