{
  "modId": 66413.0,
  "modName": "A.G.A.B.",
  "summary": "Guards have been trained so hard, so now they can knock out Dragonborn with their power attacks, and put him to prison. They also became a little more stronger.",
  "descriptionHtml": "[b][size=3][center][color=#ff7700]Description:[/color][/center][/size][/b]\r<br />[color=#00ffff][b]They was ignorant.[/b]\r<br />[b] Their sense of humour was terrible.[/b]\r<br />[b] They was annoying. [/b]\r<br />[/color][b][color=#00ffff]But they was helpless against your 9000 lvl. UBERDragonborn.[/color]\r<br />[/b]\r<br />[center]Well, this mod will will change that. Now guards can really beat you up and throw into jail, no matter, how badass you are. Yup, thats right, just like the real police.\r<br />You defeated Alduin, and saved the world? They don&#39;t care. You killed Miraak? They don&#39;t care. If you stole that cabbage- you will most probably get your ass kicked. Throw your trash somewhere in the city? You will [b]definitely[/b] get your ass kicked.\r<br />Just watch this video, if you wanna now, how to avoid this.\r<br />[youtube]P2plo4FOgIU[/youtube][/center]\r<br />\r<br />[size=3][b][color=#ff7700]Realization:[/color][/b]\r<br />\r<br />[/size]If any NPC having a Guard Shield of any Hold in his inventory, (exept Winterhold) he actually will be able to knock out your character with his power attacks, and, after that, your Dragonborn will woke up in a dungeon of the appropriate hold. After that, you can serve your sentence, or escape the jail, just like in the original game.\r<br />They will knock you out, no matter, how much health and armor you&#39;ve got. And they don&#39;t care, if you are blocking, or not.\r<br />\r<br />\r<br />[left][i]Lydia: &#34;You&#39;re drunk, Dovakin, stop beating up this little girl, and dress up&#33;&#34;\r<br />You: &#34;NO&#33; WHERE DID YOU TOOK MY SKOOMA, WOMAN?&#33;&#34;\r<br />Lydia: &#34;I&#39;m sorry, my Thane, but I have no other option.&#34; *knocks you out*[/i][/left]\r<br />The fun part is you can give the Guard Shield of the appropriate hold to any of your followers, and they will be able to knock you out too, of course, if they will be mad on you. Just for fun, the script works this way, this feature was unexpected surprise, and I don&#39;t want to change that.\r<br />\r<br />Guards also became a little stronger, and now they can advance their level until 80, and they always be a little higher level, than you. Just a small addition, that makes a big sence.\r<br />\r<br />[color=#ff7700][size=3]Installation:\r<br />\r<br />[/size][/color]Put everything from the archive into your Skyrim directory. Activate [b][i]SuperGuards.esp[/i][/b] in your launcher.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Gr1n",
  "createdUnix": "1432928765",
  "updatedUnix": "1432928611",
  "containsAdultContent": true,
  "uploadedBy": "Gr1n",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000162168",
      "name": "A.G.A.B",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "A.G.A.B-66413-1-0.rar",
      "uploadedUnix": "1432928611",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d2b9d155075ccd19bfbe5877e9227a8477bbf479091a80a454b7b80112f93443/analysis/1432928642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A.G.A.B-66413-1-0.rar?fid=1000162168&ttl=1535854931&ri=8192&rs=8192&setec=337884d389b4b0ff3d6d475f77abe3bd"
    }
  ]
}