{
  "modId": 66425.0,
  "modName": "ClefJ&#39;s Darkwater Crossing",
  "summary": "An updated and fortified version of Darkwater Crossing, the mining settlement in Eastmarch.",
  "descriptionHtml": "[center][color=#00ffff][u][b][font=Georgia][size=6]ClefJ&#39;s Darkwater Crossing [/size][/font][/b][/u][/color]\r<br />\r<br />There was some lore, somewhere, that Ulfric and his men were passing through Darkwater Crossing when they were ambushed by the Empire. It was a small mining settlement of one house and a few tents. I was heavily inspired by JK&#39;s magnificent town work, so I decided to work on something similar, rather than create a whole new town as I had before. \r<br />\r<br />I have redesigned Darkwater Crossing into a real settlement, though still small. I had attempted to model the place like a medieval Scottish hamlet, that hopefully brings some flare into the landscape in south Eastmarch, and a reason for you to come by here now and then.\r<br />\r<br />[color=#00ffff]The mod now adds: [/color]\r<br />- A small settlement wall, with an extra guard (that rotates with the civil war quest like the others&#33;), with 2 gates to the settlement.\r<br />- An outdoors ingredients merchant for passerby&#39;s.\r<br />- A new General Goods store with dunmer merchant.\r<br />- A new Inn and Tavern, with working bard and innkeeper (The larger room can be rented&#33;), and a large patio overlooking the lake.\r<br />- Many aesthetic details around the town, with added flora and architecture.\r<br />- Much of the navmesh remains the same, creating a lack of conflicts, if any at all. \r<br />- Most importantly, a [color=#00ffff]new player home[/color]&#33; Darkwater Keep just outside of the settlement offers a small residence of a Scottish tower-house, with a main hall, laboratory and trophy room, and master bedroom. All follower beds inhabit the main hall, Beowulf style. There are 2 mannequins, but many weapon displays. And a privy. The house is yours as soon as you arrive, as the previous resident was taken along with Ulfric in the beginning of the game. \r<br />[color=#ff0000]\r<br />Requirements:\r<br />[color=#ffffff] - Dragonborn. I might go back and give it some Hearthfire if desired.[/color]\r<br />\r<br />Known Conflicts: [/color]\r<br />-Mods that edit the cells immediately around Darkwater Crossing, such as the Fort Darkwater file.\r<br />- Some clipping with the carriage from Better Fast Travel.\r<br />- The quest/spell mod [color=#00ffff]Spectraverse [/color]has a location dependency that this town blocks. Turning the mod on/off to complete this part of Spectraverse solved it for me. \r<br />\r<br />Thank you for your time and downloads&#33; [/center]",
  "categoryId": "53",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1432948534",
  "updatedUnix": "1432948413",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000162190",
      "name": "ClefJ&#39;s Darkwater Crossing",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6351",
      "fileName": "ClefJ's Darkwater Crossing-66425-1-0.zip",
      "uploadedUnix": "1432948413",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f698fe2d87a6c8c635a56483a3c39b9caca51f783bda2a8493b854e4ab718230/analysis/1432948451/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ClefJ%27s%20Darkwater%20Crossing-66425-1-0.zip?fid=1000162190&ttl=1535854941&ri=8192&rs=8192&setec=5b8154e9ca3b75a460d6f0dc19bb028a"
    }
  ]
}