{
  "modId": 66426.0,
  "modName": "Infusing Alembic (Craftable Standard Potions)",
  "summary": "craft the potions you cannot make, like nightshade extract, lotus extract, philter of phantom and more. turn potions into draughts, draughts to solutions, solutions to etc. upgrade your potions to stronger forms, all at the Infusing Alembic, which is added everywhere around Skyrim&#33;",
  "descriptionHtml": "yes, before you ask, this is my Alchemical Retort mod with a better name\r<br />difference is: ALEMBIC HAS BETTER TEXTURES, ITS ADDED ALL AROUND SKYRIM&#33; (and dawnguard. yea dawnguard is still required. still sorry, you scrubs).\r<br />and YOU CAN MAKE MORE POTIONS AND POISONS\r<br />\r<br />SPECIFIC DESCRIPTION:\r<br />\r<br />this mod adds a new crafting station around places where alchemy labs are (not all of them, but to places that make sense, like wizard dungeons, apothecary shops, valerica&#39;s room in volkihar castle, etc. all up to 55 locations found around skyrim. no, i didnt add them to any jarl palace or player homes.) \r<br />the purpose of this mod is to explain how and why apothecaries and rouge wizards have the same exact potions with the same name, and now you can make those same exact potions and poisons at the Infusing Alembic ( yea, i&#39;m still working on a better name. was gonna call it imbuing chamber, but that&#39;s taken, lol)\r<br />\r<br />anyway, depending on your skill at alchemy, you can turn weak potions and poisons into stronger ones. \r<br />you can also make the weakest potion and poison from COMMON ingredients (look up on the UESP site to find which those are if ur so curious), but only if you have the right perk. YES, THIS MOD DEPENDS ON PERKS, ALSO. \r<br />\r<br />if you have the BENEFACTOR perk in alchemy, you can make the weakest fortifying potion, such as fortify enchanting, or resisting potions, like resist frost.\r<br />if you have the POISONER perk, you can make the weakest poisons, all from weakness to fire to lingering poison damage. \r<br />finally, with the PHYSICIAN perk, you can make potions that restore health, stamina, and magicka, from common ingredients.\r<br />\r<br />what do i mean by common ingredients? stuff like salt pile, mountain flowers, wheat, etc. no rare stuff like nightshade or void salts, or so on.\r<br />\r<br />-note that the pictures i use are with a mod that changes the names of the potions to make it easier to find. this mod doesnt do that\r<br />\r<br />the second part of this is that you can turn the potions into stronger forms, just like my old mod\r<br />with a skill of 20, you can turn 2 potions of strength into one draught of strength. with a skill of 40 .... then 60 .... etc etc, for any potion/ poison.\r<br />\r<br />NOTE THAT I MADE IT A REQUIREMENT FOR YOU TO HAVE AT LEAST ONE OF THE POTIONS IN YOUR INVENTORY, SO IT DOESNT CLUTTER UP THE MENU\r<br />\r<br />fnally, THE REAL PURPOSE OF THIS MOD, you can make potions you normally cannot, including:\r<br />\r<br />persuasion potion\r<br />cure poison potion\r<br />philter of phantom\r<br />nightshade extract\r<br />skooma, double distilled skooma, red water skooma, and balmora blue\r<br />lotus extract,  and all the rest.\r<br />and NO, YOU DO NOT SUDDENLY KNOW HOW TO CREATE THESE POTIONS&#33; YOU HAVE TO DO THE REQUIRED QUEST THAT INTRODUCES THEM, or THE REQUIRED SKILL LEVEL or perk, as mentioned above. \r<br />\r<br />oh yea, i also um, well, changed a few things with the potions, so they dont all give the same generic effect, like the stallion&#39;s potion was a direct copy of the weak stamina potion, and nightshade extract is a copy of the weak lingering poison. i just made them a teeny bit stronger, feel free to storm me with hate comments for that.\r<br />also i gave skooma, double distilled, and all kinds of skooma (and balmora blue) with drugged effect, like sleeping tree sap and redwater skooma, but i made it weaker since skyrim skooma is, as the bandits say, &#34;watered-down crap.&#34;\r<br />\r<br />one last thing: i made this mod increase your alchemy skill slightly. yay :D\r<br />also if u downloaded my first mod, alchemical retort, just replace it with this one. enjoy",
  "categoryId": "94",
  "version": "1",
  "author": "paulhanna",
  "createdUnix": "1432950307",
  "updatedUnix": "1432950302",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000162194",
      "name": "infusing alembic",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49",
      "fileName": "infusing alembic-66426-1.rar",
      "uploadedUnix": "1432950302",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/20f7a5f49d2deaf8006e2825d1a9455ff174e0c90c29b35264e3a6776bb94f47/analysis/1432950363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/infusing%20alembic-66426-1.rar?fid=1000162194&ttl=1535854942&ri=8192&rs=8192&setec=4536a6cccb38609b9d5c774aa3f1d911"
    }
  ]
}