{
  "modId": 6645.0,
  "modName": "Dalls_Draugr",
  "summary": "Draugr is custom texture remake (n not some simple - in-part - recolour) mod which changes how Skyrim restless undead - Draugr - look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Draugr\r\n\r\nv1.1\r\n\r\n21/01/2012\r\n\r\nDraugr is custom texture remake (n not some simple - in-part - recolor) mod which changes how Skyrim restless undead - Draugr - look.*\r\n\r\n* Word of warning - my work actually do changes how these items look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers.\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nBody / armor models used for these vicious humanoid - creatures are great but their in-game textures - being very dark and murky spoil final effect - thus this total (bodies n armors) remake of their scary - \\\"good\\\" - looks. \r\n\r\nSo what makes my Draugr (Skyrim ancestral zombies) different from Bethesda\\'s / in game ones - firstly they are made to look more human or at least as something, that - before entombment - used to be ordinary (Skyrim lore) human, their \\\"new\\\" armors n attires are made to reflect that fact - as they now wear better clothes / better preserved gear and finally their actual sex / M/F gender attributes n (previous) social status are made to be (more) obvious. All games will benefit but this last bit (gender / status) might come in quite handy to all of you which love to hang around / deal n rise or conjure their own private armies of undead. \r\n\r\nIf you want to see them in their full \\\"glory\\\" check / use my Draugr n Nord Hero Weapons mod as well. Regardless of your choice - be positive that your dungeons / underground catacombs crawls (with this mod/s in place) will not be same - repetitive n listless run of mill - any more! ;)\r\n\r\nAnd finally if you are wondering, why they were made to look as they do - know (if you don\\'t) - real / historical (M/F) dignitaries n warriors were traditionally buried / entombed in their (best) finery and not in some dirty / torn rags and underground catacombs (like Draugr ones) indeed do preserve everything - for quite while - in reasonable / still useable condition.\r\n\r\nThese armors / textures used for them - are (game) Draugr only! Similar Draugr armor (three-piece) set - one which can be worn by PC / your character - unfortunately uses entirely different model meshes and textures.   \r\n\r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my (check for names my mod) texture files from Data/textures/actors/draugr - and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!\r\n\r\nNote on v1.1: Brand new M/F Draugr skin textures! Base (body/face) skins in v1.0 are still reasonably close to Bethesda\\'s dramatic originals and as such, I find them having too much unnecessary contrast - thus these new more even-toned ones. Draugr - zero-sized dead-chicks have received a bit of \\\"beautifying plastic surgery\\\" - but don\\'t you worry they still won\\'t win any beauty contest. ;) As Armors are same in both versions - if you want them to look more dramatic keep on using / use v1.0 - if not - try this new, ones as they - in my opinion - offset their clothes / armors much better.\r\n\r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.\r\n\r\n",
  "categoryId": "33",
  "version": "1.1",
  "author": "Dall",
  "createdUnix": "1327096028",
  "updatedUnix": "1327181033",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "21537",
      "name": "Dalls_Draugr",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "18537",
      "fileName": "Dalls_Draugr-6645.7z",
      "uploadedUnix": "1327096498",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ccc33a869e6fb88e8408ea885bd263da47996d83f764724c424d37fe5d03188e/analysis/1406626075/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Draugr-6645.7z?fid=21537&ttl=1535764187&ri=8192&rs=8192&setec=0c953c4799e8f3488f3cf65d8035f14e"
    },
    {
      "fileId": "21830",
      "name": "Dalls_Draugr_v11",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "18267",
      "fileName": "Dalls_Draugr_v11-6645.7z",
      "uploadedUnix": "1327181033",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/08b5eb3dbb76c9b056e433aa09a19dbfc6e07939624c4b07f6ea04de9f42e1f8/analysis/1406628309/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Draugr_v11-6645.7z?fid=21830&ttl=1535764188&ri=8192&rs=8192&setec=ef862455cce1acdbad07cc053b20ee8a"
    }
  ]
}