{
  "modId": 6648.0,
  "modName": "The Elder Scrolls Skyrim 1-4 Patch - DELETED",
  "summary": "View Description",
  "descriptionHtml": "Installation:\r\n\r\nJust unpack all files, copy them into your skyrim install directory and launch the game as you always did.\r\n\r\nBug Fixes\r\n\r\n        General optimizations for memory and performance\r\n        PlayStation Note Fixed occasional issue with armor and clothing not displaying properly when placed on mannequin’s in player’s house.\r\n        PC Note Improved compiler optimization settings\r\n        PlayStation Note Long term play optimizations for memory and performance\r\n        Memory optimizations related to scripting\r\n        Fixed crashes related to pathing and AI\r\n        Fixed crash in Haemar’s Shame if player had already completed A Daedra’s Best Friend\r\n        Fixed rare crash with loading saved games\r\n        Fixed issue with accented characters not displaying properly at the end of a line\r\n        Master Criminal achievement/trophy unlocks properly in French, German, Spanish and Italian\r\n        Fixed issue where dragon priest masks would not render correctly\r\n        Fixed issue where quests would incorrectly progress after reloading a save\r\n        Fixed issues with placing and removing books from bookshelves in the player’s home\r\n        Fixed issue where weapon racks and plaques would not work correctly in player’s house if player immediately visits their house before purchasing any furnishing.\r\n        Fixed issue where the player house in Windhelm would not clean up properly\r\n        Fixed crash related to giant attacks and absorb spells\r\n        Fixed issue with ash piles not cleaning up properly\r\n        Fixed occasional issue where overwriting an existing save would fail\r\n        Fixed memory crash with container menu\r\n        Fixed infinite loop with bookshelves\r\n        Fixed issue where traps in Shalidor’s Maze would not work properly in French, German, Spanish and Italian versions\r\n        Fixed issue where transforming back to human from werewolf would occasionally not fail\r\n        Bows and daggers will display properly when placed on weapon racks\r\n\r\n Quest Fixes\r\n\r\n        The Unusual Gem inside the Thalmor Embassy is now accessible after finishing Diplomatic Immunity\r\n        In Breaching Security, the quest token is no longer required to receive a fortune reading from Olava the Feeble\r\n        Fixed issue where Galmar would not complete Joining the Stormcloaks properly if Season Unending was an active quest\r\n        Fixed issue where starting Season Unending after finishing Joining the Stormcloaks would prevent The Jagged Crown from starting properly.\r\n        Fixed issue progressing through Message to Whiterun while Season Unending was still open would block progression for both quests.\r\n        In Arniel’s Endeavor, fixed issue where a quest journal would trigger multiple times\r\n        In Forbidden Legend, the amulet fragment can no longer disappear after player leaves a dungeon without taking it\r\n        Fixed rare issue in Forbidden Legend where killing Mikrul Gauldurson while sneaking would make his corpse unaccessible\r\n        In The White Phial, the phial can no longer disappear if player leaves dungeon without taking it\r\n        The White Phial will now start properly if player already has a briar heart in their inventory\r\n        Player can no longer get stuck in Misty Grove after completing A Night to Remember\r\n        Fixed issue where leaving Riften during A Chance Arrangement would prevent quest from progressing\r\n        In Darkness Returns, a door in Twilight Sepulcher will properly open if the player leaves the dungeon for an extended period of time before completing the quest\r\n        In Under New Management, if the player leaves the Oculory for an extended period of time after placing the focusing crystal and returns, the quest will proceed correctly\r\n        Onmund’s Request will now start properly if player has already found Enthir’s staff before receiving this quest\r\n        Fixed instance where Tonilia would stop buying stolen items and also would not give Guild Leader Armor\r\n        Repairing the Phial will start properly if player already has unmelting snow or mammoth tusk in their inventory\r\n        Finding Pantea’s Flute before speaking with Pantea no longer prevents her quest from updating\r\n        In the Coming of the Dawn, fixed rare instance where a quest object would spawn incorrectly on the Katariah during Hail Sithis!\r\n        Fixed rare issue in The Mind of Madness where player is unable to equip the Wabbajack\r\n        Fixed issue in Pieces of the Past where Mehrunes Dagon’s Razor will not trigger properly if player leaves the cell for extended period of time before activating it\r\n        Blood’s Honor will start properly if you visited and completed Driftshade and an extended period of time passes before starting the quest.\r\n        Fixed rare issue where Dampened Spirits would not start properly\r\n        Fixed issue where player would be unable to become Thane of Riften if they purchased a home first\r\n        Fixed issue where killing guards in Cidhna Mine woud block progression for No One Escapes Cidhna Mine\r\n        Fixed numerous issues with Blood on the Ice not triggering properly\r\n        In Blood on the Ice, Calixto can now be killed if player owns a house in Windhelm\r\n        In The Cure for Madness, killing Cicero then resurrecting him no longer impedes quest progress\r\n        Fixed rare issue in To Kill an Empire where an NPC would fail to die properly\r\n        Clearing Knifepoint Ridge before starting Boethiah’s Champion no longer prevents quest from starting.\r\n\r\n",
  "categoryId": "84",
  "version": "1.4",
  "author": "Bethesda",
  "createdUnix": "1327096815",
  "updatedUnix": "1327096815",
  "containsAdultContent": false,
  "uploadedBy": "reverticalman",
  "primaryFile": null,
  "files": []
}