{
  "modId": 66504.0,
  "modName": "Skyrim Better Vanilla Homes",
  "summary": "Shrines and ovens in all the vanilla homes and children&#39;s room won&#39;t make you give up alchemy or enchanting anymore.",
  "descriptionHtml": "If you want children but also want to do alchemy and enchanting comfortably in your own home, then this mod is for you. If you don&#39;t want children&#39;s room maybe not so much, because you will have two of alchemy table or enchanter. The mod also adds an oven, shrines and some decoration in all the vanilla homes, even Severin Manor is Solstheim. I didn&#39;t touch any quest things in Severin Manor, so it should be safe to install even before the related quest but do save before installation just to be sure. And while we are at quests there is one for Hjerim in Windhelm also, when you have to go in before you get and furnish the house, but my changes will be there and that will result in some levitating shrines and decorations, sorry about that. I added two more child&#39;s bed to Hjerim if you have Multiple Adoptions Mod. And if you have a mod that only changes the children&#39;s room I think that&#39;s compatible with my mod, since I didn&#39;t touch the children&#39;s room (only in Honeyside I put a goblet on the corner shelf next to the door so mark for delete it if it&#39;s in the way). I also added a cooking spit to Proudspire Manor in Solitude, because there wasn&#39;t any and all smithing stuff except smelter to the basement. I tried to put down the kind of shrine in the homes that isn&#39;t in the local temple or Hall of the dead, that&#39;s why there isn&#39;t any Arkay shrine, because that&#39;s in the Hall of the dead. Also unfortunately with this mod you can&#39;t have children in Severin Manor but at least you can bake there now.\r<br />Change: I removed the static goblet from the child room of the Riften playerhome, so I think now it&#39;s fully compatible with mods that only change the children&#39;s room.",
  "categoryId": "67",
  "version": "2",
  "author": "FarrinRacer",
  "createdUnix": "1433164308",
  "updatedUnix": "1434554048",
  "containsAdultContent": false,
  "uploadedBy": "FarrinRacer",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000162527",
      "name": "Better Vanilla Homes",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "Better Vanilla Homes-66504-1.zip",
      "uploadedUnix": "1433164303",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f99b5a45c1e4c38c0f494f487e3d8cdf66e3696b005984af3a398c784a76412c/analysis/1433164323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Vanilla%20Homes-66504-1.zip?fid=1000162527&ttl=1535855004&ri=8192&rs=8192&setec=79d542031d8e04a8f3e349d647b30d9f"
    },
    {
      "fileId": "1000164472",
      "name": "Better Vanilla Homes 2",
      "version": "2",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "11",
      "fileName": "Better Vanilla Homes 2-66504-2.zip",
      "uploadedUnix": "1434554048",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/d878bb7fca92033e50c7f8d5297f493090885ddf6e04aa568c0f7d5c30fc5783/analysis/1434554102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Vanilla%20Homes%202-66504-2.zip?fid=1000164472&ttl=1535855005&ri=8192&rs=8192&setec=edb001cc8d3bcb3074bd7ab173239b9f"
    }
  ]
}