{
  "modId": 66643.0,
  "modName": "Imperial Fortress Castra Hiberna",
  "summary": "Adds a new imperial fortress east of Solitutde.  ",
  "descriptionHtml": "Description:\r<br />\r<br />Castra Hiberna is an Imperial base located east of Solitude built for the sole purpose of reminding the Nords how superior the Empire is when compared to their sad excuse for a civilization. This mod caters to players who role play as staunch legion supporters. I don&#39;t consider it to be a proper player home, but it could function as such if you really want it to. If you play as a Stormcloak supporter, I suppose you could just sack the place.  \r<br />\r<br />The fort was intended to replace the aging Castle Dour as the Legion&#39;s headquarters in Skyrim. Castra Hiberna also serves as an ideal staging ground for large scale Legion operations both on land and at sea. The fort is comprised of barracks, stables, workshops, a command center (main office), storage buildings, a bath house (kind of), small farm, and a prison. There are roughly over 125 npc&#39;s stationed at this fort. \r<br />\r<br />This mod contains three small scripts. The first is very basic and allows you to earn a daily wage of 25 septims for your service in the Legion. The other two allow the player to purchase special dividend paying shares of East Empire Company Stock made available to Legion Soldiers as a stock option with a strike price of 100 septims per share. Think of it as a kind of reward for supporting an empire that&#39;s down on it&#39;s luck. Your wages and dividends can be collected from a lock box and safe located in the main office. \r<br />\r<br />To purchase shares simply activate the east empire company ledger located on a table in the main office. Once activated you will be presented with a message box and a list of options for the quantity of shares to purchase. Each share pays a one septim dividend daily. Check the screenshots if you&#39;re not sure what to look for.\r<br />\r<br />Requirements:\r<br />\r<br />Sorry to say it, but this mod does require the Dawnguard, Heartfires, and Dragonborn DLC&#39;s. \r<br />\r<br />Planned features:\r<br />\r<br />Other than the occasional update to give it a little more polish this mod should be considered complete. \r<br />\r<br />Possible issues:\r<br />\r<br />There is some small issue with the navmesh that I don&#39;t fully understand how to fix. It may have something to do with the way exterior cells are set up but I&#39;m not to sure. This problem isn&#39;t serious, just a little annoying. \r<br />\r<br />   ",
  "categoryId": "68",
  "version": "1.0",
  "author": "CouriersGambit",
  "createdUnix": "1433539845",
  "updatedUnix": "1433539835",
  "containsAdultContent": false,
  "uploadedBy": "CouriersGambit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000163097",
      "name": "Imperial Fortress Castra Hiberna",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3639",
      "fileName": "Imperial Fortress Castra Hiberna-66643-1-0.zip",
      "uploadedUnix": "1433539835",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/21a0f1f18f93b994f8d6792a6cf4b885fd84809ca85ead0f6f496f6b65bfbfb3/analysis/1433539864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Fortress%20Castra%20Hiberna-66643-1-0.zip?fid=1000163097&ttl=1535855121&ri=8192&rs=8192&setec=f9a2751528659e936f99314d228eb6ce"
    }
  ]
}