{
  "modId": 66640.0,
  "modName": "Necrosarian - Undead Playable Race",
  "summary": " Those of which have a physical presence on the mortal plane, while their soul walks eternally in the Soul Cairn. ",
  "descriptionHtml": "[font=Trebuchet MS][size=2]The Necrosarian race was created by the necromancer, Mevara, in the Fourth Era, year 122. \r<br />\r<br />It began when Mevara joined the College of Winterhold, she seamlessly excelled in all the schools of magic, but she had the most interest in conjuration magic. She started research in the dark arts on Necromancy and soul gems. Mevara, always had a fascination of where the souls went after being captured.\r<br />\r<br />Mevara began research into the plane of  Oblivion, known as the Soul Cairn, the realm of eternal undeath. She was seeking an able way to creation eternally undead being, through necromancy. A devastating collapse occurred in 4E122, known as the Great Collapse of Winterhold, but no one knowing the real cause. She created a portal to the Soul Cairn, not knowing it would cost many lives of those townsfolk of WinterHold. \r<br />\r<br />Her portal now open, sucked away many parts of the city, but left the College quite intact. Mevara entered the portal, planning to acquire power and make a deal with the Ideal Masters, the mysterious ruler over the plane. Not knowing once she entered, she would be subject to becoming undead. But her hunger for power made her overlook any consequences.\r<br />\r<br />After striking a deal with Ideal Masters, trading souls for power. She unknowingly tied her own soul into the deal. So when she tried to return to Nirn, her now undead soul had no anchor to the mortal plain. She then created a body, sewing together various bodies, not of her own, creating the first undead being known as the Necrosarian. \r<br />\r<br />Now able to return to Nirn, she began building more beings. An army of stitched undead corpses, all having an anchor in the realm of Nirn. Her Necrosarian beings, those of which have a physical presence on the mortal plane, while their soul walks eternally in the Soul Cairn. [/size][/font]",
  "categoryId": "34",
  "version": "",
  "author": "SkylaSkyrim",
  "createdUnix": "1433528942",
  "updatedUnix": "1433528942",
  "containsAdultContent": false,
  "uploadedBy": "Skylaskyrim",
  "primaryFile": null,
  "files": []
}