{
  "modId": 66681.0,
  "modName": "Playable Ghosts and other Spirits",
  "summary": "Allows you to play as four different kinds of spirit&#33;",
  "descriptionHtml": "This mod adds four new blessing shrines to the game, each shrine turns you into one of four different kinds of spirit. The spirits include: Ghost (classic blue), Shade (dark purple), phantom (light purple), and Spectre (red). All four shrines are found in the second (or first if you went with Ralof) room in Helgen Keep and also in the lowest room of the Whiterun temple of arkay catacombs.\r<br />\r<br />All spirits are: 100% resistant to poison and disease, able to breathe underwater, muffled, and weak to shock damage.\r<br />\r<br />To dispel the spirit effect simply activate any of the other skyrim shrines.\r<br />\r<br />I&#39;ve tweaked some spells which glitched the spirit effect, so don&#39;t be concerned when you cast muffle or something and seemingly nothing hapens (it still works the same i&#39;ve just removed the visual effect).\r<br />\r<br />I&#39;ve not done extensive testing for this mod but if anything glitches the effect simply return to one of the shrines and recast it.\r<br />\r<br />If you find any bugs or have any good ideas to improve the mod please comment.\r<br />\r<br />Enjoy&#33;\r<br />\r<br />Also I should add (if you haven&#39;t looked at all the images), the effect stays fully active after becoming a werewolf or vampire lord :)",
  "categoryId": "34",
  "version": "1.0",
  "author": "Eriol12",
  "createdUnix": "1433673981",
  "updatedUnix": "1433673305",
  "containsAdultContent": false,
  "uploadedBy": "Eriol12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000163261",
      "name": "Playable Spirits",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Playable Spirits-66681-1-0.rar",
      "uploadedUnix": "1433673305",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/357b232e04e21f2b0173d7d0ec91635d5ad190cfff3346754cc93af31002040e/analysis/1433673363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Playable%20Spirits-66681-1-0.rar?fid=1000163261&ttl=1535855158&ri=8192&rs=8192&setec=86d15870be131aff4c5fb3abf9c15379"
    }
  ]
}