{
  "modId": 66695.0,
  "modName": "Better Soldiers",
  "summary": "Adds much needed variety to the Imperial Legion and the Stormcloak Army&#33;",
  "descriptionHtml": "Thanks for checking out this mod. :D\r<br />\r<br />[color=#ff0000]What does this mod do?\r<br />[/color]This mod adds some much needed (in my opinion) variety to the ranks and loadouts of the Legion and Stormcloaks&#33; Armour, weapons and races are all added to give the civil war a better feel without buggy scripts and whatnot. \r<br />\r<br />[color=#ffff00]Additions to the Imperial Legion:\r<br />\r<br />[/color]Races.\r<br />The vanilla game only had Breton, Imperial, Nords and Redguards in the Legion levelled lists, despite the fact that there are two elven Legates (Fasendil, commander of the Rift Legion forces and Sevan Telendas, commander of the Winterhold Legion forces). Added to the mix are Altmer, Bosmer and Dunmer soldiers as well female soldiers to all races. Imperial-aligned towns will now have female guards serving alongside their male counterparts.\r<br />\r<br />Loadouts.\r<br />All Imperial Soldiers will now wear heavy armour. Also added to their armoury are warhammers&#33; \r<br />\r<br />Voices.\r<br />The vanilla game only had [i]two[/i] voicetypes, which got a bit stale after a while. Added by this mod are MaleNord (Nords only), MaleNordCommander (Nords only), MaleCommander (non-Nord male soldiers), FemaleCommander (non-Nord female soldiers) and FemaleNord (Nords only). MaleSoldier and MaleYoungEager are still the most common voicetypes but it won&#39;t be as noticable and yes, the new voicetypes have generic Imperial Soldier dialogue so they won&#39;t seem out of place when you see some Imperial soldiers out on patrol. :D\r<br />\r<br />Battlemages&#33;\r<br />That&#39;s right&#33; The Legion FINALLY has magical support. Battlemages have their place in the Lore (battlemages are present in Oblivion, guarding the Arcane University, for example) and will sit back, activate Oakflesh and then pelt the enemy with either fire, frost or lightning. They will also employ Fast Healing if injured and will switch to their swords if out of magicka. They use the TrainerDestructionMaster NPC class, which levels their one-handed, heavy armour, alteration, destruction and restoration skills.\r<br />\r<br />Commanders.\r<br />During the Siege of Whiterun (both sides) you come across the rather generic &#34;Imperial/Stormcloak General&#34; enemy. I decided to have the General spawn from a specially made list consisting of named officers. (Note, the Commanders of both sides might spawn more than once, and there&#39;s nothing I can do about that, sorry) The Imperial officers consist of both warriors and battlemages and are named as follows:\r<br />\r<br />Captain Sorcalin - Altmer\r<br />Commander Faerahil - Altmer\r<br />Captain Foronir - Bosmer\r<br />Commander Faysallenth - Bosmer\r<br />Captain Guilbert Maric - Breton\r<br />Commander Diane Montrose - Breton\r<br />Captain Daynasa Drethan - Dunmer\r<br />Commander Garyon Norvayn - Dunmer\r<br />Captain Andromeda Flaccus - Imperial\r<br />Commander Janus Faustinius - Imperial\r<br />Captain Havilstein Deep-Cups - Nord (special guest voice, MaleDrunk)\r<br />Commander Helgi Windrunner - Nord\r<br />Captain Perizada - Redguard\r<br />Commander Pyke - Redguard\r<br />\r<br />[color=#ffff00]Additions to the Stormcloaks:\r<br />\r<br />[/color]Loadouts.\r<br />Instead of the generic gear they all seem to sport in the vanilla game, Stormcloak soldiers will now equip hide, scaled (helmets only), leather, iron or steel helmets, boots and gauntlets&#33; They might also equip the sleeved version of the Stormcloak cuirass. In addition to these, the Stormcloaks will also use either hide, iron, banded iron or steel shields; at range they will use either a long bow, a hunting bow or (small chance) a Looted Imperial Bow, which looks exactly the same as a regular Imperial Bow but does slightly less damage. In melee, the Stormcloaks will now use both iron [i]and [/i]steel weapons (swords, arrows, battleaxes, etc.).\r<br />\r<br />Voices.\r<br />Like the Imperials, the Stormcloaks only used two voicetypes in vanilla. Added are MaleNordCommander and MaleGuard. Now you won&#39;t be hearing a million Ralofs and Mjolls screaming as you take the fight to the Empire/rebels&#33;\r<br />\r<br />Commanders.\r<br />The Stormcloaks also get commanders, all of them warriors. They are:\r<br />\r<br />Bittneld the Unbearded\r<br />Bjerke the Bear\r<br />Brynhildr Heartsbane\r<br />Emfrid Axe-Wife\r<br />Freya the Red\r<br />Gerhardt Elfkiller\r<br />Svana the World Breaker\r<br />Sven Maulhand\r<br />Valdemar the Highlander\r<br />Vigdis Curse-Bringer\r<br />[color=#ff0000]\r<br />Q and A:\r<br />\r<br />[/color]Q: Why no Orcs, Argonians, Khajiit added to the Legion?\r<br />A: I wasn&#39;t sure if their voicetypes worked with the Legion (it&#39;d be pretty wierd, in my opinion, having an argonian with a vocie like MaleSoldier, for example.) I tried putting MaleGuard into the Legion, but he had no Legion-specific dialogue (he has Stormcloak-specific dialogue though).\r<br />\r<br />Q: Should I start a new game to play with this mod?\r<br />A: If you want to see the additions to the civil war, then I recommend you do so, but it&#39;s not required. If you add the mod while you&#39;re in the middle of the civil war quest you&#39;ll see some glitching soldiers, but that&#39;s about it judging from what happened when I tested this.\r<br />\r<br />Q: Why isn&#39;t Rikke/Galmar finishing their speech at the start of the Siege of Whiterun?\r<br />A: I spent so much time trying to fix this (many a swear word was shouted), and I do believe I have fixed it; during testing a few hours ago as of this mod being uploaded, Rikke and Galmar finished their speeches and the battle commenced. I tested this mutliple times to confirm it was fixed. If on the off chance their speech doesn&#39;t finish, just attack them until they aggro onto you then yield to them and the battle will proceed normally. This shouldn&#39;t happen, but I&#39;m adding this here just in case it does.\r<br />\r<br />Q: Are vanilla soldiers removed/drastically changed?\r<br />A: No. The only changes to the vanilla soldiers are to the Nord Imperial soldiers to give them MaleNord and MaleNordCommander voices (and to remove them from voicetype specific levelled lists) while I crated two new Stormcloaks with the MaleNord voice and one new female with the FemaleNord voice as I changed a few Stormcloak soldiers&#39; voices to MaleGuard and MaleNordCommander.\r<br />\r<br />Q: What mods do I need for this to work?\r<br />A: No mods, but you will need the Dragonborn DLC. I used the unofficial patches for both Skyrim and Dragonborn, but whether or not you need them is unclear.\r<br />\r<br />Q: Imperial battlemages are using bows and arrows, hammers and swords and shields at Korvunjund?\r<br />A: Frustrating problem really, but it only happens at lower levels; beginning at around 8-10 they should exclusively rely on their magic.\r<br />\r<br />[color=#00ff00]Credits:\r<br />[/color]Bethesda for Skyrim and the CK.\r<br />My desk for enduring my frustration, and my cat for enduring my angered groans and swearing during testing.",
  "categoryId": "33",
  "version": "1",
  "author": "NitroGoose",
  "createdUnix": "1433699078",
  "updatedUnix": "1433698272",
  "containsAdultContent": false,
  "uploadedBy": "NitroGoose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000163299",
      "name": "Better Soldiers",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8854",
      "fileName": "Better Soldiers-66695-1.rar",
      "uploadedUnix": "1433698272",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4fd9d9e801ba153106157f18266fac54ab5fe8f21638be8dc4f54f0bc28084e4/analysis/1433698335/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Soldiers-66695-1.rar?fid=1000163299&ttl=1535855174&ri=8192&rs=8192&setec=576d13cbb355758ddba714161ebef5f2"
    }
  ]
}