{
  "modId": 6682.0,
  "modName": "Craftable Psiijic Robes",
  "summary": "Adds craftable Psiijic Robes to the forge in cloth, light, and heavy armor versions for all types of characters.",
  "descriptionHtml": "CRAFTABLE PSIIJIC ROBES\r\nby Horolet\r\nv 1.2\r\n---\r\nDescription\r\nUpdated - Now full sets available for all three versions! You can find all of them craftable at the forge - cloth version in the misc section requiring no perks, light version in dragon smithing, and heavy version in daedric smithing. Also fixed materials, you should now be able to craft and upgrade the majority of the items with leather strips, garnets and a couple charcoal. Weight for the armor should now be the same as their daedric and dragonscale counterparts for all pieces.\r\n\r\nThis mod adds craftable stand alone versions of the Psiijic set in cloth, light and heavy armor versions to make them accessible to any character that wishes to effectively use them throughout the game. The original Psiijic items are not changed in any way. The new items however use the same model as them, so any replacer mod you run will affect these items as well.\r\n\r\nI mirrored the stats of the Daedric set (heavy version) and Dragonscale set (light version) and put them in their respective perk areas at the forge - in other words you\\'ll need the corresponding smithing perk to craft your armor version. They are all fully upgradeable at the workbench.\r\n\r\nI made this because I loved the looks (perhaps not the default color schemes, though...) of the Psiijic outfit ever since I witnessed them during the College quests the first time (spoiler?), and I\\'m sure many other players did as well. While you can spawn the clothing version of  it with the console in the game for your mage character, it\\'s far from optimal for most other playstyles.\r\n\r\nOther Notes: I haven\\'t tested it myself, but theoretically all of the items should be compatible with \\\"full set\\\" related perks as long as you wear the rest of the sets the items were based on (Daedric for heavy, Dragonscale for light). Don\\'t take my word on this however.\r\n\r\nThis mod is not a retexture! The recolor you can see in the screenshots is referenced in the credits at the bottom of this page!\r\n\r\nIf you for some reason hate smithing but still want to adorn these items, you can grab the ID for them from the console with the help search function:\r\nhelp \\\"psiijic\\\" 0\r\nItems are as follows:\r\nChest: Psiijic Vestments (Heavy) - Psiijic Raiments (Light) - Psiijic Clothing (Cloth)\r\nHelm: Psiijic Heaume (Heavy) - Psiijic Cover (Light) - Psiijic Shroud (Cloth)\r\nGloves: Psiijic Handguards (Heavy) - Psiijic Handbraces (Light) - Psiijic Silk Gloves (Cloth)\r\nBoots: Psiijic Greaves (Heavy) - Psiijic Striders (Light) - Psiijic Shoes (Cloth)\r\n---\r\n\r\n---\r\nInstallation: Just drop the CraftablePsiijicRobes.esp file into your Skyrim\\\\Data folder and you\\'re done. You may have to check the list in \\\"Data Files\\\" in your Skyrim launcher to make sure its activated. Delete the file if you wish to uninstall the mod.\r\n---\r\nCredits\r\nI whipped this together with SkyEdit after finding a wonderful retexture of the Psiijic Robes into a black colored variant here on the nexus. You can see it on the screenshots, and the link to it is here - all credit goes to the author:\r\nDarker Psiijic Robes by TheClassyPython - http://www.skyrimnexus.com/downloads/file.php?id=2170",
  "categoryId": "54",
  "version": "1.2",
  "author": "Horolet",
  "createdUnix": "1327134387",
  "updatedUnix": "1327186485",
  "containsAdultContent": false,
  "uploadedBy": "Horolet",
  "primaryFile": null,
  "files": [
    {
      "fileId": "21663",
      "name": "Craftable Psiijic Robes v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Craftable Psiijic Robes v1-6682.zip",
      "uploadedUnix": "1327134489",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fa1e6cb51027bb4a1547258c4c8688793eda2eb43fbc541b1d94805aec4ec752/analysis/1406627106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Psiijic%20Robes%20v1-6682.zip?fid=21663&ttl=1535764251&ri=8192&rs=8192&setec=130b4d332168b8fa63d3878b78cdd90f"
    },
    {
      "fileId": "21848",
      "name": "Craftable Psiijic Robes v12",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Craftable Psiijic Robes v12-6682-1-2.zip",
      "uploadedUnix": "1327186485",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6d157602b328f72384ce17dec0f2405d4751b6cffbcc04cc9d818fb87f84898d/analysis/1406628486/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Craftable%20Psiijic%20Robes%20v12-6682-1-2.zip?fid=21848&ttl=1535764251&ri=8192&rs=8192&setec=d8beeb4766caddf832f476f58ff67033"
    }
  ]
}