{
  "modId": 66907.0,
  "modName": "One Handed Perk Tree",
  "summary": "Changes the one handed perk tree to have more skills, support daggers, and generally make the one handed tree a lot more effective, and maybe just a bit more fun.",
  "descriptionHtml": "WHAT IT DO:\r<br />-Changes the One-Handed Perk Tree\r<br />WHAT IT DON&#39;T:\r<br />-Change anything else\r<br />\r<br />   This is a very simple mod that I made in the Creation Kit. It changes a lot of the things that I thought were very annoying when playing the vanilla tree.\r<br />\r<br />PERK TREE:\r<br />Armsman(1-5): Increases Damage in increments of 25% (25%-50%-75&)\r<br />Special Armsman: Your one handed attacks have special effects&#33; (Axes bleed, Maces ignore armor, and swords crit. This is for the three level 30 special perks. I didn&#39;t like that you had to get the smallest versions of each effect separately\r<br />(When I say same as vanilla I mean I tweaked everything a bit to match with not being able to do twice as much damage.(Crit chance is higher and maces end up ignoring all armor by the end.))\r<br />BoneBreaker(1-2): Same as vanilla.\r<br />Bladesman(1-2): Same as vanilla.\r<br />HackAndSlash(1-2): Same as vanilla.\r<br />FightingStance: Power attacks cost 45% less stamina\r<br />Critical Charge: Same as vanilla.\r<br />Savage Strike: Standing Power attacks do 30% bonus damage and have a chance to decapitate. This doesn&#39;t apply to maces because ignoring armor and decapitating and doing bonus damage is too OP\r<br />Berzerker: One Handed Power Attacks cost 80% less and deal 15% more damage.\r<br />While your weapon is out in combat, take 30% less damage from one handed weapons.\r<br />Does not apply to daggers.\r<br />Dagger Proficiency(1-3): Daggers do (30/60/90)% more damage while sneaking. \r<br />Penetrating Strike: Daggers ignore 25% armor while sneaking.\r<br />Lucky Dervish: While in combat, your dagger always critically strikes, but your attacks only do 75% damage. (While in combat the dagger&#39;s stats in your inventory will only show 75% of the damage your weapon has.\r<br />\r<br />Dual Flurry: Unchanged.\r<br />Dual Savagery: Unchanged.\r<br />Dual Impact: Dual handed attacks ignore 25% armor.\r<br />\r<br />INSTALLATION:\r<br />With NMM:\r<br />Just click download with NMM and let it work itself.\r<br />\r<br />Without NMM:\r<br />Unzip the file, put the esp file in your skyrim data folder.",
  "categoryId": "73",
  "version": "1.0",
  "author": "DAGGERDOG",
  "createdUnix": "1434325499",
  "updatedUnix": "1434325499",
  "containsAdultContent": false,
  "uploadedBy": "DAGGERDOG",
  "primaryFile": null,
  "files": []
}