{
  "modId": 66931.0,
  "modName": "The Colored Rooms",
  "summary": "A player house inspired by one of the crafting area&#39;s in ESO. This magical playerhouse is being rewarded to the dragonborn for purging the necromancer that defiles Meridia&#39;s temple, and thus allowing you to live in her Realm; The Colored Rooms. ",
  "descriptionHtml": "[font=Comic Sans MS][color=#38761d][size=4]REQUIRES Dawnguard,Heartfire,Dragonborn and the General Display MOD&#33;[/size][/color]\r<br />\r<br />[size=6]Welcome Dragonborn, into my Realm. [/size]\r<br />\r<br />[/font][size=2]For cle[color=#f4f4f4]ansing my temple, a[/color]nd destroying the vile necromancer [/size][size=2]Malkoran, I grant you my artifact; Dawnbringer. [/size][size=2]Take the mighty Dawnbreaker and with it purge corruption from the dark corners of the world. Wield it in my name, that my influence may grow.&#34; For doing this, I shall grant you a place you can call home,[/size][b] [size=3]into my Realm; The Colored Rooms[/size][size=2].[/size][/b][size=2] - Here you can store the most dangerous artifacts and your valuables safely, for none but you can enter. May my realm&#39;s beauty inspire you, Dragonborn. [/size][size=1]- Meridia[/size]\r<br />\r<br />\r<br />[size=3]The colored rooms is a playerhouse that is inspired by one of the crafting area&#39;s in The Elderscrolls Online. [/size][color=#ff0000]The Colored Rooms can be accessed infront of Meridia&#39;s Shrine at Kilkreath. There is a portal stone there that you can use after obtaining the key in the room where you would fight the necromancer Malkoran and obtain Dawnbreaker.[/color][color=#f4f4f4][size=2][b] [/b]If the key is somehow unobtainable you can always unlock the stone or simply cheat the key.[/size][/color]\r<br />\r<br />\r<br />[size=3]The house stands in a cave which is totally safe to use for any kind of storage. It has a lot of costum storage and I find it to believe it is very lorefriendly. Do note due to the extreme hard work and placement, not all computers might be able to handle a mod like this, I have no problem at all running it myself, but I can imagine that some pc&#39;s will have.\r<br />\r<br />The house contains:\r<br />1: Living space/kitchen\r<br />2: A crafting area for enchanting, smithing, alchemy and spiderscroll crafting\r<br />3: A bedroom\r<br />4: A Garden with 7 planters to grow your own alchemy ingredients.\r<br />5: A secret door in the bedroom that leads to a costum storage room.\r<br />6: A beautiful vieuw&#33;\r<br />7: A lot of costum storage\r<br />8: Obiously normal storage aswell.\r<br />9: A weapon  displays (arround 15) \r<br />10: NO MANNEQUINS, I can&#39;t stand it that they have a chance to move, so no.[color=#ff0000] -NEVER-[/color]\r<br />\r<br />[color=#f4f4f4]\r<br />\r<br />The following items have their own storage displays\r<br />1: All thieves guild treasure&#39;s. ( Living room, the wooden boat can be placed above the fireplace, burst at the desk area upstairs. and both the eyes in the secret costum display room)\r<br />2: All dragonmasks and DragonbornDLC masks.( secret room)\r<br />3: Most daedric artifacts. (secret room)\r<br />4: All claws and the DragonbornDLC claw ( Secret room)\r<br />5: The initiate&#39;s ewer ( I love it&#33;, can be placed at the dining area on a sidetable)\r<br />6: Haelga&#39;s Dibella Statue ( Can be placed at the dining area on a sidetable)\r<br />7: The two candlesticks that belong to the mold ( Can be placed at the dining area on a sidetable)\r<br />8: Pelagius&#39;s Hipbone ( beneath the Elderscrolls in the secret room)\r<br />9: The 5 paragons from Dawnguard ( secret room)\r<br />10: The three Elderscrolls (secret room)\r<br />11: Auriel&#39;s bow (pedestal in secret room)\r<br />12: -\r<br />13: The 4 falmer books from Dawnguard DLC ( English translation, can be placed in the dining room on a sidetable)\r<br />14: Kolbjorn&#39;s Skull from Dragonborn DLC (can be placed on the empty table next to the entrance door)\r<br />15: The two skull keys (can be placed on the empty table next to the entrance door)\r<br />16: All 7 blackbooks from Dragonborn DLC ( secret room)\r<br />17: Dreamstride + Boethia&#39;s calling + Opium Infinium book, ( Can be placed at the enchanting area)\r<br />18: All 4 Mythic Dawn Commentaries ( Can be placed at the enchanting area)\r<br />19: All critters in a jar ( can be placed on a side table at the alchemy station)\r<br />20: The white Phial (can be placed on a small sidetable next to the alchemy station) [/color][/size]\r<br />\r<br />\r<br />[color=#ff0000]The house is navmeshed but there are no extra beds for followers, nor do I feel like I want to create such in the near future.\r<br />\r<br />[b][u]I stand open for idea&#39;s but I find this house finished. I don&#39;t want the space to get laggy, it is pretty on the limit at this moment.[/u][/b][/color]\r<br />\r<br />\r<br />[b]SPECIAL THANKS TO [url=http://www.nexusmods.com/skyrim/users/3231858]Elianora[/url] FOR HELPING ME REGARDING CUSTOM DISPLAY, I SUGGEST YOU CHECK HER AWESOME MODS&#33;&#33;&#33;&#33;&#33;\r<br />SPECIAL THANKS TO [url=http://www.nexusmods.com/skyrim/users/17279409]MrDanSG1[/url] FOR HIS AWESOME COSTUM DISPLAY SCRIPTS.[/b]\r<br />\r<br />[size=4]\r<br />I WOULD LIKE TO THANK THE FOLLOWING PEOPLE FOR CREATING AWESOME SCRIPTS AND MESHES THAT HELPED ME TO CREATE MY MOD[/size]\r<br />\r<br />Bethesda\r<br />[url=http://www.nexusmods.com/skyrim/users/285029]Ithlia\r<br />[/url]AARS Resource mods\r<br />[url=http://www.nexusmods.com/skyrim/users/1981866]Grantyboy050[/url]\r<br />Oaristys\r<br />Tony67\r<br />Runspect\r<br />Blary\r<br />stoverjm\r<br />Darkfox127\r<br />Insanity\r<br />LilaMue\r<br />Stroti\r<br />Flintstone\r<br />Lilith\r<br />Tesa\r<br />\r<br />Did I forget to mention you? Then I am really sorry, My mesh and resourcefolders are a mess :( , Let me know so I can add you asap&#33;\r<br />\r<br />\r<br />I hope you all will enjoy my mod, I DO :) \r<br />\r<br />Please leave a comment, I love to read them&#33; \r<br />Please Endorse if you like it, it makes me very happy, I spend over 30 hours into this mod.\r<br />\r<br />Greetings,\r<br />\r<br />MrKoekie\r<br />\r<br />[color=#38761d][size=5]Need a place for your vampire? Check my other mod; Tomb of Pelagius. \r<br />[/size][/color]http://www.nexusmods.com/skyrim/mods/64213/?",
  "categoryId": "67",
  "version": "1.0",
  "author": "MrKoekie",
  "createdUnix": "1434395116",
  "updatedUnix": "1434395108",
  "containsAdultContent": false,
  "uploadedBy": "Mrkoekie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000164280",
      "name": "Colored Rooms",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29031",
      "fileName": "Colored Rooms-66931-1-0.rar",
      "uploadedUnix": "1434395108",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3e9ddb7d4de9c4947c959e2469a92b5e34df5c1389d42337ee64db8a42d9310c/analysis/1434395171/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Colored%20Rooms-66931-1-0.rar?fid=1000164280&ttl=1535855386&ri=8192&rs=8192&setec=d7ddf2305c098df3ce9dce383e0edcbf"
    }
  ]
}