{
  "modId": 66933.0,
  "modName": "MTNPC",
  "summary": "A mod that will add a bunch of new NPCs, followers, and quests as time goes on. Currently this mod focuses on the lovable follower Buffscale McThundertail.",
  "descriptionHtml": "M.T.NPC is a mod that aims to add a bunch of new NPCs to the dull and empty world of Skyrim. I plan on updating this mod with more and more npcs, events, possible quests, and more.\r<br />\r<br />That&#39;s what&#39;s planned, so what&#39;s done? One follower. This follower is custom voiced, comments on your surroundings, tells some jokes, gives you some insight on what he&#39;s thinking, and even sings a little song now and then. This follower is Buffscale McThundertail.\r<br />\r<br />This mod is going to change and will have more added to it, so it is considered a WIP.\r<br />\r<br />[color=#ffff00][size=3][b][u]FEATURES[/u][/b][/size][/color]\r<br />-One custom voiced Argonian follower that will comment on his surroundings, tell jokes, sing, and more.\r<br />-A fort belonging to said Argonian follower that you can use as a player home... If you can figure out how to get back in. Hope you don&#39;t mind his other house guests.\r<br />\r<br />[color=#00ff00][size=3][b][u]Meet BuffScale McThundertail\r<br />[/u][/b]\r<br />[/size][/color]The main thing in this mod right now is the follower it adds. The Argonian Buffscale McThundertail. He&#39;s an adventurer and as such he loves women, gold, and ale.  Not much else to say. You&#39;ll find this stuff out when you use him. \r<br />\r<br />[color=#ffff00]Where do I find him?\r<br />[/color]Buff is hanging out at the Bee and Barb in Riften at the moment. (Subject to change at a later date)\r<br />\r<br />[color=#ff7700]The Fort\r<br />[/color][size=3]You can find Buff&#39;s fort just west of Dawnstar in the mountains. You can either walk there or fast travel using the icon that is added to your map when you install the mod.\r<br />[/size]\r<br />[color=#ffff00][size=4]Why is this marked Adult Only?\r<br />[/size][/color]I honestly don&#39;t know for sure if I should mark this Adult Only. It does contain some skimpy outfits in Buff&#39;s fort and the &#34;house guests&#34; in Buff&#39;s fort might not be for everyone. Don&#39;t judge the Argonian. It&#39;s all he knows. If I could take the Adult Only tick off I would, but for now I&#39;m not risking any trouble.\r<br />\r<br />[u]Installation\r<br />[/u]Download the file, unpackage it and put the contents in your Data folder. \r<br />\r<br />[size=3][u]Issues?[/u][/size]\r<br />Because I know I&#39;m bound to have screwed something up please report any issues with the mod to me. Did I make a spelling error somewhere? Buff not following? Something else not working? Just tell me and I&#39;ll get right on that.\r<br />\r<br />\r<br />[u]Special Thanks\r<br />[/u]Thanks to the voice actor who helped me out with Buff: John Doe \r<br />Thanks to Mr Casual/Buffscale McThundertail for helping me make this craziness.\r<br />\r<br />",
  "categoryId": "33",
  "version": "v0.10",
  "author": "kekechi",
  "createdUnix": "1434400759",
  "updatedUnix": "1434400759",
  "containsAdultContent": true,
  "uploadedBy": "kekechi",
  "primaryFile": null,
  "files": []
}