{
  "modId": 6696.0,
  "modName": "Tsavhira Save Game",
  "summary": "Young, slender, sexy and cute Khajiit female save game.",
  "descriptionHtml": "So after browsing the Nexus and downloading some awesome mods. I figured I\\'d put my skills to the test and contribute something back. I\\'m horrible at modding so I figured on sharing my wonderful Khajiit creation with any and all!\r\nTsavhira, a play on Khajiit names and Baghira, is a young and slender kitten on the run from a band of cut throat bandits she once called family in Elsewyr. After a horrible and bitter betrayal from the bandit leader, she found herself a ride on a caravan bound for Skyrim.\r\nNow, like I said. Only her creation is my own doing. But it was only made possible by the awesome mods found on here and I give major props and kudos to their creators! In order for my little kitty here to look as good as she does, you have to have the following mods downloaded or else you\\'re screwed!\r\nBright Eyes:\r\nhttp://skyrimnexus.com/downloads/file.php?id=2464\r\nCBBE slender option\r\nhttp://skyrimnexus.com/downloads/file.php?id=2666\r\nCover Khajiits:\r\nhttp://skyrimnexus.com/downloads/file.php?id=5941\r\nNo More Blocky Faces:\r\nhttp://skyrimnexus.com/downloads/file.php?id=30\r\nKiller Keos Skimpy Armor:\r\nhttp://skyrimnexus.com/downloads/file.php?id=3654\r\nNude Female Khajiit Skin for CBBE:\r\nhttp://skyrimnexus.com/downloads/file.php?id=5857\r\n\r\nThe nude one is optional. Since I have the furry inside, rawr, I use it myself. But otherwise, the others are needed to get her looking exactly like her snapshots. And again, major kudos and full credits to the creators of the mods I used and thanks to them as well for their creation. It allowed me to make a character that I can actually be happy with and enjoy playing.\r\n\r\nA few more details:\r\nI saved her at level 1. She\\'s equipped with dual Imperial Swords, a Long Bow and some Iron Arrows. She has lockpicks and various food items and potions to help you on your way. I modded her health from 100 to 150. Her Stamina from 100 to 250 and the same with her Magicka. She\\'s got a Thousand Gold on her to help out as well. As for armor, she\\'s got on the Stormcloak Cuirass and Imperial Studded Bracers and Boots. You can switch that out to the Novice Robes and Hood she has in her inventory.\r\nWhile you can take her in any direction obviously, she was intended to be my thief character. So that being said, I\\'d love to hear how others take her storyline to new heights. \r\n\r\nThanks again to this awesome modding community and site. Thanks again to the creators of those awesome mods! Thanks to Bethesda for making this completely sick game! I hope you all enjoy. Please comment, endorse, rate! I\\'d love to hear from you all!\r\n\r\nAdded: 21st, Jan. 2012\r\nI\\'m taking custom character requests to continue contributing to the Nexus. Feel free to drop in any messages with personal requests!",
  "categoryId": "43",
  "version": "",
  "author": "Me",
  "createdUnix": "1327149528",
  "updatedUnix": "1327149603",
  "containsAdultContent": true,
  "uploadedBy": "Tidewalker117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "21707",
      "name": "Tsavhira Save Game",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1027",
      "fileName": "Tsavhira Save Game-6696-1.rar",
      "uploadedUnix": "1327149603",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e47c8797bd64f91a968424702fa9d291ba2f82c93d131178a06d74ab2613e3c0/analysis/1406627408/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tsavhira%20Save%20Game-6696-1.rar?fid=21707&ttl=1535764274&ri=8192&rs=8192&setec=d7dbce1a05369ca2607b6f1ab725bdf9"
    }
  ]
}