{
  "modId": 66979.0,
  "modName": "follower    Feiyang  Ink  dress up float in the sky  snow wave not to walk this paragraph of memory",
  "summary": "      I am a newcomer, there are many things also please advice, support.\r<br />      I in this website first MOD follower    Feiyang.",
  "descriptionHtml": "         [size=4][i][b]  I am a newcomer, there are many things also please advice, support.\r<br />     Maybe some people think that the virtual world, no matter what emotions are virtual.I have to say no, no, because I and friends, is a brothers has experienced the ups and downs of gang together, drifting, during which is full of laughter is full of tears, which made the front of the gang laugh tears a indelible milestone.\r<br />      Produced in a single shot transition, name is also, according to a friend in the game has to be honest, now feel quite live up to her.\r<br />[quote][/quote]\r<br />       Under simple say the story, is I the past passed by, may be in everyone&#39;s eyes are dull, willing to listen to please continue, don&#39;t want to listen to please direct attention to look down.\r<br />      Were playing games we all know that in the old DaiGuan dull, previously fought together friends gradually withdrew from the games.So in the sophomore summer holiday, I a person silently to a new city.\r<br />      The total strangers in the new area after all, no matter be to brush or battlefield many things very inconvenient.My gang help even if is a death, on the basic is a loner, no matter what my own play is like the plain boiled water.Until one day a WeiOu dart car by a hostile camps, only saw a nurse with a dozen people to come to the rescue, this very insipid life in this area to be broken.\r<br />      Tidy up after the enemy, one of the wet nurse is feiyang, play with me, in a battle, I&#39;m almost beat her, then she said: &#34;look, you are a veteran, equipment can also be, why stay in a death to help, not to us this?&#34;Originally a person play very boring, is simply to their gang.It can be a pleasure to tell you the truth, I go there\r<br />     When a gang of courtesy is the best, not everyone welcomes me, even feiyang wet nurse to sing a song for me personally.\r<br />      I was playing in the game is female, is commonly known as the queen, has experienced many ups and downs in old, in the new area only can live safely.Feiyang has been asked me in the real world is male or female, I said: &#34;in the university, I am living boys dormitory.&#34;During the gang to find my chat is feiyang, always ask me in this acquisition not accustomed to, you are good.I will also be in some old photo album, all the experience to share with her, she always said, envy my brother in the old.\r<br />      This time is the most happy time in the new area.Everyone was together, gang is also booming.Gang came after a man named &#34;Stephen&#34;, married feiyang.I don&#39;t have the game, when the summer vacation to go to my dad went to company internship.A few days later I was in the game, such as listen to feiyang cry unto me, say to want to give me the number, she isn&#39;t going to play, I am very depressed, ask to help the people in, to help the people in a star ye want to looking at the photos in feiyang reality results feiyang didn&#39;t agree with, two noisy up.I a friend said: &#34;feiyang, it is a good girl, points of the game and reality, if we help sugar sugar (to help a woman who will only tease), fruit according to send out.&#34;I sighed, comfort the feiyang, feiyang said: &#34;number to you.&#34;\r<br />       This period of time every day I in addition to finish their own task, he connected feiyang nurse, the task is done together.Until one day, a dog blood happens, star ye know me on the number of feiyang, doubt is I had an affair with her.The truth, the old married once in the game, the injury is quite heavy, that girl are big me a few years old, in the new area is so flat play a woman. \r<br />Feiyang know later to had a quarrel with star ye, the left, really gone.(good with words, memories are so much)[/b][/i][/size][b][size=3][quote][/quote][/size][/b][color=#ff00ff][b][size=4]Name: Feiyang\r<br />Location: Dragon Palace in the WhiteRun city \r<br />Requirements: with the latest game version\r<br />Combat: one hand, remote bows and arrows\r<br />[/size][/b][b][size=4]Size: unpb\r<br />[b][size=4]Need to Dawnguard[/size][/b]\r<br />[/size][/b][/color][quote][/quote][b][color=#ff0000][size=5]Note:\r<br />1. Everyone see, followed with the gloves, because no matter how have broken hand phenomenon, so gloves when FIG leaf, well, I admit not harmonious\r<br />2. The file has two esp file, be sure to point\r<br />3. Don&#39;t play for a long time, rusty, the same as a beginner, have what problem please timely feedback.4. The attendant bring facelight, thanks to cyjjyg tutorial.\r<br />4. My English is very rotten, translation is a mechanical translation, compare the Mars, please understanding.\r<br />[/size][/color][/b][quote][/quote][b][size=4]Credits\r<br />Elven Dresses by Naihaan\r<br /> Facelight by tktk\r<br />The eyes of beauty by Gabriel Mailhot\r<br />Eye Normal Map Fix by ALMIGHTY DAVE\r<br />[url=http://skyrim.nexusmods.com/mods/12951/?]Enhanced Character Edit[/url] by tktk1\r<br />[url=http://skyrim.nexusmods.com/mods/6709/?]DIMONIZED UNP female body[/url] by dimon99\r<br />[url=http://skyrim.nexusmods.com/mods/26800/?]XP32 Maximum Skeleton -XPMS[/url] by xp32\r<br />[url=http://www.nexusmods.com/skyrim/mods/51602/?]Fair Skin Complexion[/url]by HHaleyy\r<br />[url=http://www.nexusmods.com/skyrim/mods/52287/?]Asian Doll Face[/url]by Lumina\r<br />[url=http://www.nexusmods.com/skyrim/mods/56056/?]Mikan Eyes[/url]by nerune\r<br />[url=http://www.nexusmods.com/skyrim/mods/55364/?]Kijiko Hair[/url]by Kijiko and Goldiocks\r<br />[url=http://www.nexusmods.com/skyrim/mods/24747/]High Definition Leather Undergarments - UNP UNPB[/url] by [b]crispiniscool[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/57440/?]Enhanced Character Edit - More Body Sliders[/url] by [b]Septfox\r<br />[/b][/size][/b][b][size=4][b][list]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36213]HDT HighHeels System[/url] by [url=http://www.nexusmods.com/skyrim/users/3701232]HydrogensaysHDT[/url][/list][/b][/size][/b]",
  "categoryId": "96",
  "version": "2015.6.17",
  "author": "azzozza",
  "createdUnix": "1434556256",
  "updatedUnix": "1434555713",
  "containsAdultContent": false,
  "uploadedBy": "azzozza",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000164476",
      "name": "feiyang english",
      "version": "2015.6.17",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "66083",
      "fileName": "feiyang english-66979-2015-6-17.rar",
      "uploadedUnix": "1434555713",
      "modVersion": "2015.6.17",
      "virusScanUrl": "https://www.virustotal.com/file/362f271109dc014584c3d63667f92373514d0b28a529a40b9fc0d05774ef8662/analysis/1434555792/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/feiyang%20english-66979-2015-6-17.rar?fid=1000164476&ttl=1535855429&ri=8192&rs=8192&setec=84b3b62879835b0a3f8fd3de3420b28f"
    }
  ]
}