{
  "modId": 6718.0,
  "modName": "Orsinium Tribes v1 by TDPrince",
  "summary": "This WIP mod will be finished once the CK comes out (shortly..); It\\'s lore-specific and is made to add immersion to those beautiful \\\"small cities\\\" of Orcs that are in Skyrim. For now it\\'s 4 strongholds with vanilla, my plan is to make a world-specific Orc village. Same plans for the other races.",
  "descriptionHtml": "ORSINIUM TRIBES v1  By   TDPrince\r\n\r\n\r\nProgress:\r\nLore (100%)\r\nStory (100%)\r\nVoices (60%)\r\nWorld & Quests (0% cause of the CK)\r\n\r\n\r\n\r\n\r\n\r\nINTRODUCTION:\r\n\r\n\r\nLet me welcome you to my WIP, Orsinium Tribes v1! This mod is all about lore; you may have noticed the four strongholds of the Orcs that are present in Skyrim vanilla version. My idea is to make the world of Skyrim a bit more enjoyable and fashinating by adding immersion to those races that fit well in the game as it is but still need (at least for what I think) to be expanded by various point of views.\r\nIn this mod you will find various camps of Orcs that left the stronghold for their young spirit of adventure; new strongholds and new areas. A lot more for a more immersive Skyrim.\r\n\r\nPreview of adds:\r\n- 2 new strongholds, bigger than the already existing ones.\r\n- 20 specific NPCs  +  50 Random NPCs within and outside strongholds\r\n- 15 new buildings (at least)  +  10 Orc camps throughout Skyrim lands\r\n- 10 new pieces of Orsinium manufacture (swords, armors etc..)\r\n- New chiefs, one that is above all.\r\n- New poisons, new potions, new ingredients.\r\n- New title that the player can acquire once he has become a Bloodkin of the tribes.\r\n- 3 more companions (possibly with unique features...)\r\n....and more to see...\r\n\r\n\r\nSame things are planned for the other races that comes with the Elder scrolls series. The mod will be uploaded shortly after the CK. Maybe in 4 or 5 days (with the hope that I pass my university exams without any problems.)\r\n\r\nThank you for reading and for (possibly) liking the idea. I repeat, this is still a WIP. Excuse my elementary english and have a nice fight ;)\r\n\r\n\r\n\r\n\r\nMORE TO COME:\r\n\r\nThalmor embassies and ships v1\r\nWoodelf Treeland v1\r\nBreton village, caravaners and mage towers v1\r\nRedguard desert v1 (small desert to be created on borders) v1\r\nHighelf neutral villages v1\r\nDarkelf fungis and cave retreats v1\r\nKhajiit Warmlands v1\r\nArgonian swamp village v1\r\n\r\nNotice: TITLES MAY VARY. To those that might borrow my ideas for mods, please, give credit even tho it\\'s still ideas I\\'d like to be credited.\r\n\r\n\r\n\r\nNOTES:\r\n\r\n- Argonian Swamp Village v1 Mod will be made from the inspiration given to me by the old game for PC   GOTHIC (I SAID INSPIRED, NOT COPIED. I don\\'t want any problems or ban for copyright issues). If you want a fast screenshot of how it would look like when the time comes you can swiftly google it without problems.\r\n- Khajiiti Warmlands will be set in a small created desert, the rest will be known when it\\'s ready ;)\r\n\r\n\r\nSTAY TUNED FOR NEWS.\r\n\r\n\r\n\r\n\r\nRE-NOTE: This mod is for now WITHOUT FILES. Simply because I want the community to know about what I\\'m working on. Thank you for understanding. \r\n\r\n\r\nCREDITS:\r\nTDPrince (me)",
  "categoryId": "78",
  "version": "1",
  "author": "TheDarkPrince",
  "createdUnix": "1327173826",
  "updatedUnix": "1327173826",
  "containsAdultContent": false,
  "uploadedBy": "TheDarkPrince",
  "primaryFile": null,
  "files": []
}