{
  "modId": 67214.0,
  "modName": "No More Bug in Jar Sounds",
  "summary": "Removes the buzzing noises for the bugs in jars.",
  "descriptionHtml": "From the mod author who brought you &#34;No More Bee Sounds&#34;, I present, &#34;No More Bug in Jar Sounds&#34;.\r<br />\r<br />When I first made the No More Bee Sounds mod, I did it out of annoyance at the droning noise in my Hearthfire greenhouse, and assumed that others were annoyed too. However, I have come to understand that a lot of people who downloaded that mod did so not only out of annoyance, but out of a real life dislike of bugs and bees. That said, I hope this is another modification that will help some of you breathe easier while playing. If you have anything similar to this you&#39;d like to see, please feel free to contact me.\r<br />\r<br />If you play an alchemist, apothecary, nature-loving character, or just enjoy adding some entomologic decor to your home, but don&#39;t enjoy the constant buzzing noise that the bugs-in-jars make, this mod is for you. Like my previous mod, I&#39;ve simply gone into the Creation Kit and removed the actual sound that the bugs in jars make. If you want them back, just uninstall the mod. It&#39;s compatible with everything and shouldn&#39;t alter any gameplay. \r<br />\r<br />Note that this mod leaves in the regular bee sounds. (The ones that aren&#39;t in a jar.)\r<br />If you want those removed too, please see [url=http://www.nexusmods.com/skyrim/mods/67215/?]No More Bee Sounds[/url].\r<br />\r<br />Thank you, and enjoy&#33;\r<br />\r<br />Note: I&#39;m the original author of this mod, but I&#39;ve switched to this account and reuploaded because there is no way to change usernames in Nexus.",
  "categoryId": "61",
  "version": "1.0",
  "author": "GracefulGopher",
  "createdUnix": "1435215094",
  "updatedUnix": "1435215079",
  "containsAdultContent": false,
  "uploadedBy": "GracefulGopher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000165355",
      "name": "No More Bug In Jar Sounds",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "No More Bug In Jar Sounds-67214-1-0.rar",
      "uploadedUnix": "1435215079",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fd2364bfc5af5faedfedac42b991f48d9821ac44dcf5cf839a68f1e020ae915e/analysis/1435284073/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20More%20Bug%20In%20Jar%20Sounds-67214-1-0.rar?fid=1000165355&ttl=1535855666&ri=8192&rs=8192&setec=ccde8a5a891b441a9748d95a82134921"
    }
  ]
}