{
  "modId": 67216.0,
  "modName": "Invisiarmor (Armor Switching Tool)",
  "summary": "This is a single armor piece that occupies every armor slot for your character.",
  "descriptionHtml": "[size=5]Requirements: Skyrim, nothing else needed\r<br />Use: Tool To Get All Armor Off Character Before Equipping New Set[/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />This is a single armor piece that occupies every armor slot for your character.\r<br />\r<br />Why make this?\r<br />\r<br />It is always troublesome needing to go into your inventory to change your armor and spell sets. Luckily SkyUI, Jaxon&#39;s Outfitter, and Loadout are great methods to switch between armor sets with just the press of a hot key. However, there are numerous armors made by our skilled community of modders that contain multiple pieces that occupy special locations on the character&#39;s body. So when we switch to a vanilla armor sets some of the pieces from the new armor stay on our character. This is of course problematic and forces us to go into our inventory to unequip the rogue pieces that wont come off.\r<br />\r<br />This mod offers a very simple solution to always get it right. This is a single piece of armor that when equipped occupies every possible slot on your character. So now when switching between armor sets all we need to do is first equip the invisiarmor then equip our other set. No hassle, no fuss, and all is good.\r<br />\r<br />Special note to add is there is no head, hands or feet will appear for your character while this armor is equipped due to the fact that I am too lazy to create a new full(body, head, hands, feet) mesh and instead just used the single body mesh.\r<br />It isn&#39;t pretty but it gets the job of switching armors done.\r<br />\r<br />[size=5]To get this piece of armor open the console\r<br />Then add it to your inventory by typing  player.additem ##000d65 1[/size]\r<br />(the ## is the number of the file in your loadorder, or you can simply search for invisiarmor1shot to find the item code)\r<br />Once its added to your inventory you can add it to your favorites and equip it between switching armor sets&#33;\r<br />\r<br />It was an idea I just had after thinking about the mod Invisible Armor Crafted by PhoenixSky\r<br />http://www.nexusmods.com/skyrim/mods/47499/? and it took me like 2 minutes to make. (I DIDN&#34;T USE ANY ASSETS)\r<br />\r<br />I checked it in game and it worked just fine, completely unequiped DeserterX&#39;s Merta Assasin Armor http://www.nexusmods.com/skyrim/mods/60195/? and allowed me to equip the Cultist Amor from Killer Keo&#39;s Skimpy Armors http://www.nexusmods.com/skyrim/mods/3654/? No problems whatsoever&#33;&#33;&#33;&#33; yay&#33;\r<br />\r<br />Enjoy&#33;\r<br />\r<br />-Dreezy",
  "categoryId": "54",
  "version": "0.5",
  "author": "DreezNation",
  "createdUnix": "1435220138",
  "updatedUnix": "1435217426",
  "containsAdultContent": false,
  "uploadedBy": "DreezNation",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000165359",
      "name": "Invisiarmor",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Invisiarmor-67216-0-5.zip",
      "uploadedUnix": "1435217426",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/a998119fd3b5f230d6b11257640a30f8ee24000327f570315d7cac224a39999e/analysis/1435328763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Invisiarmor-67216-0-5.zip?fid=1000165359&ttl=1535855668&ri=8192&rs=8192&setec=570e4d638714dde89a564d66a6a26626"
    }
  ]
}