{
  "modId": 67269.0,
  "modName": "Instant Perks",
  "summary": "Instantly add perks - 3 levels to choose from - basic, medium and master.",
  "descriptionHtml": "[b][u][color=#00ff00][size=4]Description / Instructions[/size][/color][/u][/b]\n<br />\n<br />Fed up of trying to level up your perks, or cheating the hard way looking for console codes for perks and adding them one by one. It takes forever! You would need to reach level 273 to get all of the perks in Skyrim!\n<br />[size=4][color=#6fa8dc]Now you can cheat the easy way just by typing one console command[/color] [/size]- great for when you've played Skyrim several times and you just want an easy life! Or if you set up multiple profiles with mod organizer and want to progress quickly. There are 3 levels of perks to add (each level will give you several perks for all skill trees) and one perk removal file in case you decide you're too powerful. Removing your perks later in the game will also give you more of a challenge when your weapons and armor are too advanced, or maybe you just want more of a challenge with lockpicking, etc.\n<br />\n<br />[u][color=#00ff00][size=3]Installation[/size][/color][/u]\n<br />This is a set of 4 files that you simply copy into your [u]Skyrim[/u] directory (where you installed Steam - not the data directory as you would with normal mod files). \n<br />Once the files are in the right place, simply open the console by pressing the tilde key (`) and type in the command bat filename...\n<br />for example...\n<br />bat PerksBasic (although the files have the .txt extension you must not include this - just \"bat PerksBasic\" will do the job)\n<br />[i][color=#cc4125][size=3]Now you have most of the perks up to approximately level 40 or 50 on ALL skill trees! [/size][/color][color=#9fc5e8]You can then change your mind and type \"bat PerksMedium\" and get all perks up to level 60 (ish) or \"bat PerksMaster\" and get ALL perks!!! (Don't include the quotation marks).[/color]\n<br />\n<br />If you're not happy, just type bat PerksRemove and ALL of your perks will be removed (please note that this will also remove any perks you had before using the first console command).\n<br />\n<br />Please also note that the perks will not show up until you refresh the Skills page and that there is no notification that the skills have been added or removed - it just happens like magic![/i]\n<br />\n<br />[b][u][color=#00ff00]FILES INCLUDED IN ZIP FILE[/color]\n<br />[/u][/b]\n<br />[i][size=3]PerksMaster      - adds all perks\n<br />PerksMedium    - adds perks from approx level 60 (varies depending on skill)\n<br />PerksBasic        - adds all perks up to level 50 (varies depending on skill)\n<br />PerksRemove    - removes all perks (ALL of them) whether you had any before or not. You will still keep any unspent perks.\n<br />[color=#d5a6bd]IMPORTANT - you will lose any perks that you had already assigned if you use PerksRemove - I haven't worked out how to keep them yet. You're still able to add as many perks as you want afterwards using these commands so you won't lose anything in the long run. \n<br />Any perks that you earn the normal way (from experience and hard work) can still be spent as before - these commands just give you a massive head start.[/color]\n<br />\n<br />[/size][/i]If you want to change the perks that you get, simply edit the text files and delete the ones you don't want, or add the ones you do. The PerksMaster file contains all the perks codes (with a few extra ones at the end that aren't updated - I think these were experimental and I haven't tried them out yet) so editing this file might be your quickest solution).\n<br />\n<br />There are 251 standard perks (not including the 22 vampire and werewolf perks which are not included in these mods) so 273 in total. Perksbasic gives you 110 of them, perksmedium gives you 196 (86 more) and perksmaster gives you all 251. It takes a very very long time to reach level 251 so using these commands makes getting all of the perks in skyrim much more achievable.\n<br />\n<br />[u][color=#00ff00][size=4]Using mod managers[/size][/color][/u]\n<br />[color=#b4a7d6]If you use profiles with Mod Organizer, don't put them in the profile folder, just the main Skyrim folder. I don't think any mod manager will install this for you - you have to do it manually! If someone knows how to get a mod manager to do this please feel free to edit at will...[/color]\n<br />\n<br />[color=#ffff00][u]Compatibility[/u][/color]\n<br />Shouldn't clash with anything as far as I know - these files don't use any resources or scripts and aren't installed like normal mods in the data folder so they shouldn't cause any problems. It should also count as an extra mod you can have without adding to the limit that mod organizer can handle!\n<br />\n<br />[color=#ffff00][u]Incompatibility[/u][/color]\n<br />Nothing as far as I know - please let me know if this mod crashes your game, causes glitches in the matrix or steals your girlfriend.\n<br />\n<br />[u][color=#ffff00]Uninstallation[/color][/u]\n<br />Simply delete the files and refrain from using the bat command anymore. Alternatively, delete the files, use the bat command and ponder why it's not working.\n<br />\n<br />Feel free to copy, hack, exploit, edit, reverse engineer, infringe copyright (there are none) upload to other sites, or do whatever else you want with the files, with the exception of charging for them or uploading them to a site that will charge for them. These files are free to anyone and everyone who wants them!\n<br />\n<br />CREDITS\n<br />Bethesda, Steam, Nexus - you rock!\n<br />Me!!!\n<br />My family for putting up with my computer and gaming addictions! (The wife said why haven't I done the dishes instead of doing this?) pfffft!\n<br />:D\n<br />\n<br />[color=#cc4125][size=4]Please see my other mods...[/size][/color]\n<br />[color=#6d9eeb]Instant Potions... http://www.nexusmods.com/skyrim/mods/67308/?\n<br />Instant Smithing... http://www.nexusmods.com/skyrim/mods/67304/?\n<br />Instant Shouts... http://www.nexusmods.com/skyrim/mods/67318/?\n<br />Instant Skyrim spells... http://www.nexusmods.com/skyrim/mods/67322/?\n<br />Super Powerful Weapons and Armor... http://www.nexusmods.com/skyrim/mods/68236/?[/color]\n<br />\n<br />This is my first mod so please be patient, support isn't going to be that great. If you can't get them to work, please read the instructions again. It's not too difficult.",
  "categoryId": "40",
  "version": "1.0",
  "author": "NexusNexus5",
  "createdUnix": "1435354281",
  "updatedUnix": "1435354231",
  "containsAdultContent": false,
  "uploadedBy": "NexusNexus5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000165522",
      "name": "Perks.zip",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Perks.zip-67269-.zip",
      "uploadedUnix": "1435354231",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fc3f4279fbaf7f600470996e27a402165ddc5e3c25547e712c4d903936428542/analysis/1435361943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perks.zip-67269-.zip?fid=1000165522&ttl=1535855705&ri=8192&rs=8192&setec=f21e28fd1a5c5541b2f4aba804206ee2"
    }
  ]
}