{
  "modId": 67318.0,
  "modName": "Instant Shouts",
  "summary": "Instantly add first, second or third words of all shouts in Skyrim!",
  "descriptionHtml": "[b][u][color=#00ff00][size=4]Description / Instructions[/size][/color][/u][/b]\n<br />\n<br />Fed up of trying to level up your shouts, running all over Skyrim looking for words or dragon souls. Or cheating the hard way looking for console codes for shouts and adding them one by one. It takes forever! There are 60 standard shouts in Skyrim - a lot of hard work.\n<br />[size=4][color=#6d9eeb]Now you can cheat the easy way just by typing one console command[/color] [/size]- great for when you've played Skyrim several times and you just want an easy life! Or if you set up multiple profiles with mod organizer and want to progress quickly. There are 3 levels of shouts to add (each level will give you either the first, second or third words for ALL shouts).  \n<br />\n<br />[u][color=#00ff00][size=3]Installation[/size][/color][/u]\n<br />This is a set of 3 files that you simply copy into your [u]Skyrim[/u] directory (where you installed Steam - not the data directory as you would with normal mod files). \n<br />Once the files are in the right place, simply open the console by pressing the tilde key (`) and type in the command bat filename...\n<br />for example...\n<br />bat 1stWord (although the files have the .txt extension you must not include this - just \"bat 1stWord\" will do the job)\n<br />[i][color=#cc4125][size=3]Now you have the first word of ALL shouts! [/size][/color]You can then change your mind and type \"bat 2ndWord\" and get the 2nd word of all shouts or \"bat 3rdWord\" and get ALL shouts fully unlocked!!! (Don't include the quotation marks).\n<br />\n<br />\n<br />[/i][b][u][color=#00ff00]FILES INCLUDED IN ZIP FILE[/color]\n<br />[/u][/b]\n<br />[i][size=3]1stWord     - adds the 1st word of all shouts \n<br />[i][size=3]2ndWord     - adds the 2nd word of all shouts [/size][/i]\n<br />[i][size=3]3rdWord     - adds the 3rd word of all shouts [/size][/i]\n<br />\n<br />[/size][/i]If you want to change the shouts that you get, simply edit the text files and delete the ones you don't want, or add the ones you do. The 3rdWord file contains all the shout codes so editing this file might be your quickest solution).\n<br />\n<br />[u][color=#00ff00][size=4]Using mod managers[/size][/color][/u]\n<br />If you use profiles with Mod Organizer, don't put them in the profile folder, just the main Skyrim folder. I don't think any mod manager will install this for you - you have to do it manually! If someone knows how to get a mod manager to do this please feel free to edit at will...\n<br />\n<br />[u][color=#ffff00]Compatibility[/color][/u]\n<br />Shouldn't clash with anything as far as I know - these files don't use any resources or scripts and aren't installed like normal mods in the data folder so they shouldn't cause any problems. It should also count as an extra mod you can have without adding to the limit that mod organizer can handle!\n<br />\n<br />[u][color=#ffff00]Incompatibility[/color][/u]\n<br />Nothing as far as I know - please let me know if this mod crashes your game, causes glitches in the matrix or steals your girlfriend.\n<br />\n<br />[i][color=#cc0000][size=4]IMPORTANT - DO NOT USE THESE COMMANDS IF YOU HAVE JUST LOADED YOUR GAME OR GONE THROUGH A DOOR OR SWITCHED LOCATION WITH FAST TRAVEL! You must wait for a minute for the game to load fully, especially if you have lots of mods activated. If you do, you will have problems - the shouts won't be activated and you won't be able to activate them in future - you will have to load a previous save from before you typed the command!!! \n<br />\n<br />Please also read the posts and refer to the comment by Amborgeson who says having some shouts before completing quests may cause glitches. I haven't had chance to investigate this but you may want to edit the downloaded files to leave these out (use a semicolon before each one and it will be regarded as a comment, not a command).\n<br />Don't say you wasn't warned.[/size][/color][/i]\n<br />\n<br />[u][color=#ffff00]Uninstallation[/color][/u]\n<br />Simply delete the files and refrain from using the bat command anymore. Alternatively, delete the files, use the bat command and ponder why it's not working.\n<br />\n<br />Feel free to copy, hack, exploit, edit, reverse engineer, infringe copyright (there are none) upload to other sites, or do whatever else you want with the files, with the exception of charging for them or uploading them to a site that will charge for them. These files are free to anyone and everyone who wants them!\n<br />\n<br />[color=#b6d7a8]CREDITS[/color]\n<br />Bethesda, Steam, Nexus - you rock!\n<br />Me!!!\n<br />My family for putting up with my computer and gaming addictions! (The wife said why haven't I done the dishes instead of doing this?) pfffft!\n<br />:D\n<br />\n<br />[color=#cc4125][size=4]Please see my other mods...[/size][/color]\n<br />[color=#6d9eeb]Instant Potions... http://www.nexusmods.com/skyrim/mods/67308/?\n<br />Instant Smithing... http://www.nexusmods.com/skyrim/mods/67304/?\n<br />Instant Perks... http://www.nexusmods.com/skyrim/mods/67269/?\n<br />Instant Skyrim spells... http://www.nexusmods.com/skyrim/mods/67322/?\n<br />[color=#6d9eeb]Super Powerful Weapons and Armor... http://www.nexusmods.com/skyrim/mods/68236/?[/color][/color]\n<br />\n<br />This is my fourth mod so please be patient, support isn't going to be that great. If you can't get them to work, please read the instructions again. It's not too difficult.",
  "categoryId": "40",
  "version": "1.0",
  "author": "NexusNexus5",
  "createdUnix": "1435501192",
  "updatedUnix": "1435501162",
  "containsAdultContent": false,
  "uploadedBy": "NexusNexus5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000165758",
      "name": "AddShouts",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "AddShouts-67318-1-0.zip",
      "uploadedUnix": "1435501162",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/72a9bdcc0b825f369963d294a1508300995e11d29ba04be1cc1f8f20535c2e1d/analysis/1435501202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AddShouts-67318-1-0.zip?fid=1000165758&ttl=1535855749&ri=8192&rs=8192&setec=2923f20b4b91841874720f63ef1ec3d0"
    }
  ]
}