{
  "modId": 67322.0,
  "modName": "Instant Skyrim Spells",
  "summary": "Instantly add most of the spells in Skyrim with a single console command!",
  "descriptionHtml": "[b][u][color=#00ff00][size=4]Description / Instructions[/size][/color][/u][/b]\n<br />\n<br />Fed up of running around in Skyrim trying to find all the books or magicians you need to learn spells, or cheating the hard way looking for console codes and adding them one by one. It takes forever! There are 100 standard spells in Skyrim.\n<br />[size=4][color=#76a5af]Now you can cheat the easy way just by typing one console command[/color] [/size]- great for when you've played Skyrim several times and you just want an easy life! Or if you set up multiple profiles with mod organizer and want to progress quickly. As an added bonus if you find you have too many spell tomes or scrolls you can sell them to merchants, make loads of money and buy Skyrim!\n<br />\n<br />[u][color=#00ff00][size=3]Installation[/size][/color][/u]\n<br />Simply copy the file into your [u]Skyrim[/u] directory (where you installed Steam - not the data directory as you would with normal mod files). Then open the console by pressing the tilde key (`) and type in the command bat AddSpells\n<br />[i][color=#cc4125][size=3]Now you have most of the spells you will need to get you through[/size][/color][color=#cc4125].[/color] It takes a minute or so to add all of the spells to your inventory. If you need any spells that aren't included (or wish to exclude certain spells)[/i], just edit the text file and include or exclude whichever ones you want - using a semicolon before a command will exclude the spell (it will just be treated as a comment instead of a command).\n<br />For example to remove the command to conjure a dragon priest, simply type a semicolon before the command \"player.addspell 10FC16; Conjure Dragon Priest\" which would look like ;player.addspell 10FC16; Conjure Dragon Priest\n<br />\n<br />[b][u][color=#00ff00]FILES INCLUDED IN ZIP FILE[/color]\n<br />[/u][/b]\n<br />[size=3][i]AddSpells     - adds \"most\" spells found in Skyrim (DLC's excluded)[/i]\n<br />[/size][u][size=4]\n<br />[color=#ffff00]Using mod managers[/color][/size][/u]\n<br />If you use profiles with Mod Organizer, don't put the file in the profile folder, just the main Skyrim folder. I don't think any mod manager will install this for you - you have to do it manually! If someone knows how to get a mod manager to do this please feel free to edit at will...\n<br />\n<br />[u][color=#ffff00]Compatibility[/color][/u]\n<br />Shouldn't clash with anything as far as I know - these files don't use any resources or scripts and aren't installed like normal mods in the data folder so they shouldn't cause any problems. It should also count as an extra mod you can have without adding to the limit that mod organizer can handle!\n<br />\n<br />[u][color=#ffff00]Incompatibility[/color][/u]\n<br />Nothing as far as I know - please let me know if this mod crashes your game, causes glitches in the matrix or steals your girlfriend. \n<br />\n<br />[color=#cc4125][size=4]Please note that I have always played as a warrior and have NO experience of playing the magic side of the game. Adding some of these spells may break quests or cause other undesired effects. If any of you guys could give me pointers I'll be happy to edit the file to exclude certain spells.[/size][/color]\n<br />\n<br />[size=4]Please let me know if there are any spells you feel I've missed.[/size]\n<br />\n<br />[u][color=#ffff00]Uninstallation[/color][/u]\n<br />Simply delete the files and refrain from using the bat command anymore. Alternatively, delete the files, use the bat command and ponder why it's not working.\n<br />\n<br />Feel free to copy, hack, exploit, edit, reverse engineer, infringe copyright (there are none) upload to other sites, or do whatever else you want with the files, with the exception of charging for them or uploading them to a site that will charge for them. These files are free to anyone and everyone who wants them!\n<br />\n<br />[u][color=#b6d7a8]CREDITS[/color][/u]\n<br />Bethesda, Steam, Nexus - you rock!\n<br />Me!!!\n<br />My family for putting up with my computer and gaming addictions! (The wife said why haven't I vacuumed the house instead of doing this?) pfffft!\n<br />:D\n<br />\n<br />[color=#cc4125][size=4]Please see my other mods...[/size][/color]\n<br />[color=#6d9eeb]Instant Smithing... http://www.nexusmods.com/skyrim/mods/67304/?\n<br />Instant Perks... http://www.nexusmods.com/skyrim/mods/67269/?\n<br />Instant Shouts... http://www.nexusmods.com/skyrim/mods/67318/?\n<br />Instant Potions... http://www.nexusmods.com/skyrim/mods/67308/?\n<br />[color=#6d9eeb]Super Powerful Weapons and Armor... http://www.nexusmods.com/skyrim/mods/68236/?[/color][/color]\n<br />\n<br />This is my fifth mod so please be patient, support isn't going to be that great. If you can't get them to work, please read the instructions again. It's not too difficult. \n<br />Other mods on the way - please check my page for new and exciting things to make Skyrimming easier!!!",
  "categoryId": "40",
  "version": "1.0",
  "author": "NexusNexus5",
  "createdUnix": "1435507790",
  "updatedUnix": "1435507781",
  "containsAdultContent": false,
  "uploadedBy": "NexusNexus5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000165769",
      "name": "AddSpells",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "AddSpells-67322-1-0.zip",
      "uploadedUnix": "1435507781",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/08b23ed35e74a0caedd7107204d08c9a19b883a91c1c83689e2b4b294d5c2579/analysis/1435507803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AddSpells-67322-1-0.zip?fid=1000165769&ttl=1535855752&ri=8192&rs=8192&setec=46b2eeb348bd38f39be938ba27a2f43c"
    }
  ]
}