{
  "modId": 67337.0,
  "modName": "Friendly Animals of Skyrim",
  "summary": "This mod simply adds a few types of friendly animals and creatures around skyrim, including a species of friendly winter werewolves, spotted wolves, rivercrabs, ice mammoths and a feathered dragon. ",
  "descriptionHtml": "Newest Update&#33; Added three new creatures, living mushrooms, grass hounds and slver foxes. Added a few more optional files, ability to summon some of the creatures in the mod, fixed a few annoying issues and added a esp version of no feathered dragons. In the optional files folder there is silent house cats, grounded feathered dragons and more.\r<br />\r<br />A optional file has been added as well. This is for removing creatures individually along with a store that sells the missing creature parts for those who don&#39;t want to lose the ability to use the recipes. The shop owner can be found at the Windpeek Inn at Dawnstar. When using the esm main file, please keep in mind that anyone already using the esp may possibly lose all items gathered and also that you should remove or deactivate the main esp file if using the esm.\r<br />\r<br />Hello dragonborns from all around&#33; Thank you for viewing, I do hope you will enjoy.\r<br />\r<br />Oh goodness, thank you all for the support and endorsements, 23?&#33; I never seen that on any other of my mods&#33;Important note: Now don&#39;t let this worry you, but this was put together by a young teen girl on her own time, thus I/she has a lot to learn still and this is my first major skyrim mod. I have made some mods for oblivion but anyone who came from there modding knows that it isn&#39;t the same, I am learning the best I can but I also want this to be fun for me too, I don&#39;t mind hearing suggestions, ideas maybe even simple requests, but please realize I have very simple knowledge of the CK and nifskope only and I never touched Blender or any other program, that and I do also want to have time to do my daily chores and such and still play skyrim some. You may be better off asking the people in the credits at the bottom here about changes to the creatures themselves like how bright they are as they do belong to them. Also note though that I made sure it was okay or that it was open source for other modders. This doesn&#39;t mean I won&#39;t try of course and maybe even come with results, this mainly means don&#39;t expect a miracle. Thank you for reading and I&#39;m sorry. \r<br />\r<br />This mod simply adds various friendly creatures, all handplaced around the world of Skyrim. If you are the hunter type, they give valuable items and ingrediants or if you are simply a observer, they will hopefully add a bit of charm and peace to the world of skyrim. The included creatures and animals are as following.\r<br />\r<br />Living Mushrooms. These little creatures are about the size of a chicken and they are and can only be found around the basic mushrooms that can be found around Skyrim. They are docile, harmless creatures that are fairly helpless but can make good pets. \r<br />\r<br />Grass Hounds. These crosses between dog and grasshopper are a little bit like the spotted wolves, they hang out in a small pack and can give a fairly evl look but they are usually very relaxed animals. They mainly hang around grass and avoid the snow, but there has been those that wander from this rule. \r<br />\r<br />Silver foxes. These pretty animals are really shy and will usually flee on sight. Their fur is very soft and valuable and they run faster then any other fox. They can be found in the snow, grass and the more moist places of Skyrim.\r<br />\r<br />Ice Mammoth. These are bigger and stronger then the normal ones, but much more rare and docile. They usually avoid giants and other mammoths and are only in a group when with their babies.\r<br />\r<br />Winter Werewolves. They are people that were cursed and slipped too far into the beast side. Yet they still retain their peaceful human nature from before, thus turning their fur white. \r<br />\r<br />Spotted wolves.Unlike most wolves of skyrim that are violent and aggressive, the spotted wolf is strangly more docile, simply ignoring passing travelers but they will defend themselves fiercly if attacked. \r<br />\r<br />Rivercrab. Bright orange and smaller then mudcrabs, these curious but calm creatures of course enjoy being by the river. They are not strong by any means but they give fishermen good company.\r<br />\r<br />House Cats. Even the nords of skyrim need some fluffy companions and a small feline can be easier to take care of and keep the mice down. While you won&#39;t find anyone talking about their cat, that doesn&#39;t mean they are not lurking in the cities...\r<br />\r<br />Forest Spiders. They are the more curious and less violent brethern of the frostbite spider, smaller but they can pack more of a punch, they enjoy the daylight but some lurk in caves for safety.\r<br />\r<br />Wooly Rhino. A rare sight to behold, the wooly Rhino is bigger and stronger then any bull, but many of skyrim&#39;s people can pet one out in the ild if they are careful. Their horns and hide are valuable but few have the bravery to hunt them.\r<br />\r<br />Black & White Bear. These bears seem to be the result of a snow bear and cave bear mixed. But strangely these large clawed beasts are more of a grazer then a predator. They enjoy the fall leaves around the city of Riftin.\r<br />\r<br />Bunnies. These adorable little rodents come in many different colors and are valued for their hide and eyes. they are faster then the regualr rabbits but possibly easier to spot as they like to wander in places they don&#39;t blend in to. \r<br />\r<br />Mice and Albino mice. These little guys seem to be almost like mini skeevers, but a closer look at one will tell you otherwise. They enjoy old forts and cities to roam and live in, doing their best to stay clear of their aggressive brothers the skeever. \r<br />\r<br />Feathered Dragon. These mighty feathered dragons are generally feared, but few really have anything to be afraid of. these dragons enjoy high up in the mountains but they always find the nords and other folk of skyrim to be pecular and sometimes like to observe. there are legends that these dragons carry eggs, but few belive it. \r<br />\r<br />Anyhow that&#39;s the basic rundown of them, if you ever have any questions please ask. this mod is script free so it should be safe to add and remove mid-game but I still wouldn&#39;t encourage it, I am hoping peeps won&#39;t want to remove it heheh. My own game is pretty heavily modded so capability is pretty good I think, but if you run into a conflict please tell me and I will see what I can do. \r<br />\r<br />Known bugs and issues: The feathered dragon may be hard to start a battle with if you wanted to fight it, as they fly around up pretty high. The house cats don&#39;t have any special ingrediants but this is from assuming people won&#39;t want to kill them.... if that assumption is wrong I can change that. As far as I know these should be capible with any mod, as they are handplaced and thus deal in nothing of leveled lists. \r<br />\r<br />There are recipes for the hide and two powerful mixtures at the tanning rack, though the potion and poison does take a little bit of work to create them. To install simply drop the sounds, meshes, textures and esp into your data folder, then make sure the esp is checked before starting the game, then wander around and see if you can find any of these creatures.I&#39;m sorry but this is possibly not really lore friendly, but I don&#39;t think it&#39;s so far out there to list it as not lore friendly... I was just gonna leave that up to you guys. I am very open to suggestions and feedback, it helps me improve&#33; \r<br />\r<br />Update: Added a optional esp file to add dragon egg nests around feathered dragons, the main file is still required if you don&#39;t  have it already.\r<br />\r<br />Credits:\r<br />\r<br />White Werewolf: Aikospacerogue\r<br />Feathered Dragon: milisot1325\r<br />Ice Mammoth: exray catt \r<br />Spotted Wolf, Forest Spider and Rivercrab: muppetpuppetCat, \r<br />Mouse and Albino Mouse: Hissssa\r<br />Nix Hound/Grass Hound: Dogtown1\r<br />Living mushrooms: Vicn [url=http://www.nexusmods.com/skyrim/mods/65134/?tab=4&&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D65134%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D2801374&pUp=1]http://www.nexusmods.com/skyrim/mods/65134/?tab=4&&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D65134%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D2801374&pUp=1[/url]\r<br />Silver Fox: renthal311 \r<br />Wooly Rhino: viltuska \r<br />Black & White Bear: scot\r<br />Dreamcatcher Shield: denkigroove\r<br />Gear Blades: Mysteryman88\r<br />Dwemer Crab UlithiumDragon",
  "categoryId": "83",
  "version": "1.0",
  "author": "Wolflady500",
  "createdUnix": "1435547295",
  "updatedUnix": "1439923661",
  "containsAdultContent": false,
  "uploadedBy": "Wolflady500",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000165826",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "108082",
      "fileName": "Main File-67337-1-0.zip",
      "uploadedUnix": "1435543933",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6ba9aded7ac37ae455f3d83ccf1c4497dd41ffb6081b97e09011e86b88330bd6/analysis/1435543997/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-67337-1-0.zip?fid=1000165826&ttl=1535855773&ri=8192&rs=8192&setec=33d19e58d9eb4930da5b0c432093bf21"
    },
    {
      "fileId": "1000165940",
      "name": "Feathered dragon eggs.",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "189",
      "fileName": "Feathered dragon eggs.-67337-1-1.zip",
      "uploadedUnix": "1435621323",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9d4e8577ca572f52c684a5cfc54e7c45fd00143637111e36a2ef9e6dde729801/analysis/1435621382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Feathered%20dragon%20eggs.-67337-1-1.zip?fid=1000165940&ttl=1535855774&ri=8192&rs=8192&setec=1433b57072b5a271fccb61b29f641aeb"
    },
    {
      "fileId": "1000165941",
      "name": "No Feathered Dragons",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "188",
      "fileName": "No Feathered Dragons-67337-1-1.zip",
      "uploadedUnix": "1435622800",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/052cadf921ad48cc406c53b55c1b6c36e8d037484fccf6acd2d34708934f9025/analysis/1435622823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Feathered%20Dragons-67337-1-1.zip?fid=1000165941&ttl=1535855774&ri=8192&rs=8192&setec=3ac95966cd3f09a5872b34263ce1fc06"
    },
    {
      "fileId": "1000166790",
      "name": "Old",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "144592",
      "fileName": "Most up to date file-67337-2-2.zip",
      "uploadedUnix": "1436151271",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/65345ff0862687b907bee9a62adec0c3e090a4b5c65e9c2fb559a02231a97cf3/analysis/1436151326/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Most%20up%20to%20date%20file-67337-2-2.zip?fid=1000166790&ttl=1535855775&ri=8192&rs=8192&setec=6545e54534d7de4a0a9af7260ec6d782"
    },
    {
      "fileId": "1000167352",
      "name": "Old",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "583",
      "fileName": "Optional Files-67337-1-0.zip",
      "uploadedUnix": "1436546822",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/68ecb61aa74c80756b38947fcd349693924d6305f50b564a8e0eb2822e854bc4/analysis/1436546883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20Files-67337-1-0.zip?fid=1000167352&ttl=1535855775&ri=8192&rs=8192&setec=cb6fa7813533d42d4254443b22ed3132"
    },
    {
      "fileId": "1000172417",
      "name": "Main File",
      "version": "2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "203927",
      "fileName": "Main File-67337-2-3.zip",
      "uploadedUnix": "1439923661",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/624609f7420ac2fcc9d1d2cec4ed91901b876be45c8721f695d530c5a769206f/analysis/1439923772/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-67337-2-3.zip?fid=1000172417&ttl=1535855776&ri=8192&rs=8192&setec=2f85671b5d1511984da667bdc6cb5f1c"
    }
  ]
}