{
  "modId": 67343.0,
  "modName": "Fort Dawnguard But Wait There&#39;s More",
  "summary": "Tired of cobwebs and old barrels cluttering up fort dawnguard? Ever noticed how messy the dining room is? Do the tower entrances seem too close together to you? Does it seem like there could be more space in there? Well I have just the thing for you right here&#33; Includes swords by zikoru and four new npcs with their own living spaces.",
  "descriptionHtml": "I hate the CK:-(\r<br />\r<br />If you have an npc open in the ck and just looking at their settings but click cancel or the x mark as in you don&#39;t want to change them guess what? the ck changes them anyway&#33;&#33;&#33;&#33; \r<br />\r<br />I had to go back with TES5EDIT and get rid of the weird edits of five npcs, ysolda and that annoying guy that hangs out with belethor... belethor and kleppr and his wife in markarth. I don&#39;t know why they were changed but the ck is a sadistic evil thing it really is. So if you are using the first version of this mod what you can do to salvage your save game is to go to these npcs and use addtofaction console commands to add their factions back one at a time. I had to do this too since this is how I discovered this bug the hard way same as anyone else using this mod. \r<br />\r<br />The latest version is fixed the npcs are back to normal and I have changed some things in fort dawnguard. I added a few more lights than the first version and I extended the range of the existing lights here and there. I got the bard to sing FINALLY by changing the cell music from that annoying dragonsreach music to tavern music. So the bard can now be asked to sing and she will beat on drums play flute and play lute by herself. Unfortunately like all other bards in the game she doesn&#39;t sleep unless you request a song, wait a while then ask her to take a break. I even selected must complete flag on her sleep package and she still performs forever unless you do the above listed. \r<br />\r<br />I had to change how the new npcs packages worked so they would work at all and spent many hours reading guides and trying things out to find a way to get these new npcs to do things correctly. So now the vigilants go on patrol and they eat breakfast and dinner and sleep and the vendor eats sleeps sells etc. EVERYTHING should work CORRECTLY now sorry for the bugs:-) \r<br />\r<br />\r<br />\r<br />This mod REQUIRES the use of the unofficial skyrim patch and the unofficial dawnguard patch it will NOT work without them so make sure you are using those patches when using this mod. This mod has been cleaned properly with TES5EDIT latest version at the time of this writing. There is no need to re clean the file.\r<br />\r<br />I got tired of how lacking the inside of this fort looks and the first time I played through the DLC I did not even know I could sleep in that upstairs player room. I wanted to make the inside look more architecturally correct and have some more space to move around in as well as secondary crafting areas so I didn&#39;t have to step around the dawnguard npcs so much. I also wanted a general merchant to buy all the crap I might have picked up along the way back to the fort between quests.\r<br />\r<br />I remodeled the interior of fort dawnguard to add more space and move things around slightly. The entrances to the guard towers were too close together all three of them&#33; So I moved them farther away and there is now a right side to the fort. The right side is the same size as the left side check the pics for more info. The right side is kind of a civilian area there is a merchant who kinda sorta doubles as a bartender and a bard who sings at the dawnguard dinner table. There is a personal space area for those two vigilants that you see outside earlier in the quest. They move in after their exterior refs are disabled and have their own little space complete with shrine of stendarr and storage containers and stuff. \r<br />\r<br />The merchant has his own sleeping area in that right side and the bard has her sleeping area in there too. There are places for these npcs to eat and sandbox. The two vigilants will go out on patrol with durak during the day and then return to the right side for sandboxing and dinner then sleep. These two vigilants are also followers. \r<br />\r<br />There is a crafting area behind the right wing in that back hallway which has been extended and has space for food and resource storage. The sandbox for the merchant and bard allow for sandboxing in that hallway and crafting areas so they should use it in their afterhours before sleeping.\r<br />\r<br />There is an upstairs area for sleeping and eating with six beds and some storage too. The chests should be non respawn up there. This area is kind of a civilian guest quarters area with the idea that visiting allies of importance or who could be of great help to the dawnguard have a place to stay no crappy cots for them only the best noble furniture septims can buy.\r<br />\r<br />There is a treasure chest in the player room now that should be non respawn so feel free to use it instead of those two crappy chests in the back hall as you did before like everyone else.\r<br />\r<br />ALL THE COBWEBS BE GONE&#33; isran finally gets out the broom and cleans the place before the player returns from walking serana home to daddy. Cobwebs, old boxes and junk are cleared away at stage 70 of that new order quest so when you get back to the fort and get through the isran speech and he lowers the gates you will see a cleaned up and upgraded fort dawnguard. The stuff that I added will be enabled at stage 70 including the four new npcs but not before that so initially the fort will have cobwebs but not after stage 70 as it should be. The dawnguard dining area has been cleaned up only slightly to remove those turned over plates and goblets and stuff. So it is still a man cave but not so messy in there now.\r<br />\r<br />I have added two swords to the dawnguard merchant and leveled lists from zikoru&#33; The venus and mars swords just screamed dawnguard so they are now buyable from dawnguard merchants and some dawnguard members should be carrying them around. The venus sword comes in two forms called the dawnguard sword which is 1h and the dawnguard long sword which is 2h. The mars sword comes in two forms called the dawnguard sterling sword which is 1h and the dawnguard sterling long sword which is 2h. They have the same stats as skyforge steel swords and greatswords. They also have the same additional damage effect against vampires while also able to be enchanted.\r<br />\r<br />There are additional occlusion planes to help cut down on the huge rendering hit this fort interior normally causes so things should be faster now in there. \r<br />\r<br />\r<br />I plan on adding two mercenaries who will sleep upstairs and sandbox downstairs in the right side then patrol after the vigilants get back in. These two mercenaries will also be hirelings. At some point I will figure out how to put those two vigilants at the final battle with the vampires too. \r<br />\r<br />The textures for the zikoru swords are the 2k textures he offers, so if you want to use smaller textures from his mods just get those and put them in the folders under the fdbwtm folder which has the sword names venus and mars there easy to find.\r<br />\r<br />I expect there may be some bugs, specifically the new npcs may not load. I could not get the script for the quest which adds some upgrades to accept any edits it would fail to compile every time. So instead I have those new npcs set to initially disabled and their enable parent is the initially disabled marker for the upgrades. If these new npcs fail to show up for anyone please post about it here so I can try to fix it thanks.",
  "categoryId": "68",
  "version": "v1.1",
  "author": "Dragonslayer2k12",
  "createdUnix": "1435558697",
  "updatedUnix": "1438578504",
  "containsAdultContent": false,
  "uploadedBy": "dragonslayer2k12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000170364",
      "name": "FortDawnGuardBWTM",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "66064",
      "fileName": "FortDawnGuardBWTM-67343-v1-1.rar",
      "uploadedUnix": "1438578504",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/703d4034611ddeb92cdbe636586e51c35dfad83fda8b7bc82885be423f9764fc/analysis/1438578568/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FortDawnGuardBWTM-67343-v1-1.rar?fid=1000170364&ttl=1535855781&ri=8192&rs=8192&setec=8a124922fe76dd996eed5d8cdc6996ad"
    }
  ]
}