{
  "modId": 67454.0,
  "modName": "Weapon Variants Modders Resource",
  "summary": "A Non-Playable Resource for Modders. It contains all the Models from my planned mod of which I have no intention of finishing",
  "descriptionHtml": "[center][b][i][color=#cc0000][s]EDIT: I will not be returning to modding for the foreseeable future, due to my current occupation of Indie Game development, and the four or so projects occupying my every waking hour. As such, I hereby bestow all rights to my Variants resource mod unto Philipix99, seemingly my most loyal follower, and the only person who kept me from packing up modding long before now, and all rights to my other mod unto Frankfamily, because He probably knows what to do with them best.\r<br />\r<br />It&#39;s been a good Run, with its ups and downs, and about eight hundred hours clocked on the creation kit, but it is at an end\r<br />Cheers to everyone who made it bearable\r<br />\r<br />Peace&#33;\r<br />EliteTJB98\r<br />\r<br />[/s][/color][/i][/b][/center][color=#ff7700][center]UPDATE 06/07/2016: I Have returned to Modding and I&#39;m working on a few bits and bobs, but I [b][u]WILL NOT[/u][/b] be returning to this specific project. So, go nuts...[/center][/color]\r<br />\r<br />Just a collection of tweaked vanilla Iron weapon meshes. I was going to make this into a massive mod, but have since lost all my passion for this project, and modding in general\r<br />Use however you like, just remember to give credits. \r<br />\r<br />[list]\r<br />[*]No Help will be given in the use of this resource, and it is provided as is.\r<br />[*]It also contains all my In-progress parts to this mod\r<br />[*][s]It is not correctly formatted for &#34;Drag and Drop&#34;. Do it yourself.[/s] &lt;- Badly Worded. What I meant was that the file structure in the .zip file cannot just be dragged straight into your skyrim Directory, as I Could not be bothered to sort it out as such.\r<br />[/list]",
  "categoryId": "82",
  "version": "1.0",
  "author": "EliteTJB98",
  "createdUnix": "1435849633",
  "updatedUnix": "1435849618",
  "containsAdultContent": false,
  "uploadedBy": "EliteTJB98",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000166309",
      "name": "Variants",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3713",
      "fileName": "Variants-67454-1-0.rar",
      "uploadedUnix": "1435849618",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3386f65f6750484729d1b164f24428988e0638683b724849484423412da1af32/analysis/1435849623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Variants-67454-1-0.rar?fid=1000166309&ttl=1535855887&ri=8192&rs=8192&setec=36d5343af175e706e962629cc48d497b"
    }
  ]
}