{
  "modId": 67510.0,
  "modName": "Arachnomancer",
  "summary": "Use the spiders from Dragonborn as ordinary spells, plus two spiders that weren&#39;t previously playable&#33;",
  "descriptionHtml": "[i][color=#93c47d]This mod is free\r<br />The way is should be\r<br />This mod is free\r<br />And will always be~[/color][/i]\r<br />\r<br />--- Arachnomancer Version 1.0 ---\r<br />\r<br />Arachnomancer is a mod that expands on the spider scrolls from the Dragonborn DLC, allowing players to cast them as spells from their magicka pool rather than as consumable scrolls from their inventory. Also included are scrolls and spells for the pack spider and glowing spider, which were included in the files of the Dragonborn DLC but unavailable without use of the console. \r<br />\r<br />- Spider Spells -\r<br />\r<br />The spider scrolls included in the Dragonborn DLC are great fun to play with but they get used up very quickly and are time consuming to replenish. Spider spells allow you to throw spiders around as much as you like, so long as your magicka pool doesn&#39;t run dry.\r<br />\r<br />The spell tomes can be acquired in a couple of ways. First, they can be created using the Imbuing Chamber in White Ridge Barrow on Solstheim. You will need to include a Ruined Book as a reagent to the base recipe. Where applicable you will also need a flawless gemstone, not a regular one. For example, if you wanted to make a Spell Tome: Flame Cloaked Spider, you would need to put a Flawless Ruby, an Albino Spider Pod, a Salt Pile and a Ruined Book into the Imbuing Chamber before pulling the lever. A full list of spider scroll recipes can be found on [url=http://www.uesp.net/wiki/Dragonborn:Spider_Scrolls]UESP[/url].\r<br />\r<br />If that sounds like too much work, the second method is to grab them out of a barrel in the test cell that contains all of the spell tomes. Use the console command &#34;coc qasmoke&#34; and look under one of the tables with chests on top of it. Or you could use the [url=http://www.nexusmods.com/skyrim/mods/64905/?]AddItemMenu[/url] mod and not have to fiddle with the console at all.\r<br />\r<br />There&#39;s also an optional .esp available to download (Version 1.01) identical to the main .esp except that it adds a random selection of Spider Spell Tomes and Scrolls to the vendor inventories of Fethis Alor in Raven Rock, Reveyn Sadri in Windhelm, and Brand-Shei in Riften. Fethis has the best selection and Brand-Shei&#39;s only got a handful of the tomes, but the stock all three have available will be randomised.\r<br />\r<br />- Pack Spider -\r<br />\r<br />A spider that can carry up to 60 pounds of equipment for you. If it dies, you can recover your items off it&#39;s body, but this shouldn&#39;t happen too often as it tries to keep out of harm&#39;s way during combat. You can only have one following you at a time. It&#39;s scroll can be made at the Imbuing Chamber from an Albino Spider Pod and some Bone Meal.\r<br />\r<br />- Glowing Spider -\r<br />\r<br />A spider with a yellow, illuminating glow to light up dark places. Like the Pack Spider, it too shies from combat, and you can only have one following you at a time, though you can have a Pack Spider and a Glowing Spider follow you simultaneously. It&#39;s scroll can be made at the Imbuing Chamber from an Albino Spider Pod and a Glowing Mushroom.\r<br />\r<br />--- Requirements ---\r<br />\r<br />Dragonborn.esm\r<br />\r<br />--- Manual Installation ---\r<br />\r<br />Take the Arachnomancer.esp file you downloaded and drop it into Skyrim/Data\r<br />Make sure Arachnomancer.esp is active in your mod manager and then launch the game&#33;\r<br />\r<br />--- NMM installation ---\r<br />\r<br />It&#39;s one file dude. I believe in you. You can do this without a mod manager.\r<br />\r<br />--- Changelog ---\r<br />\r<br />Version 1.0\r<br />- General Release\r<br />\r<br />Version 1.01\r<br />- Added Spider Spell Tomes and Spider Spell Scrolls, available for purchase from Fethis Alor in Raven Rock, Reveyn Sadri in Windhelm, and Brand-Shei in Riften.\r<br />\r<br />--- Credits ---\r<br />\r<br />Big thanks to Flavo and Brave for playtesting. \r<br />Big thanks to Tan for the CK assistance.\r<br />\r<br />---\r<br />\r<br />Love,\r<br />\r<br /> - novajam",
  "categoryId": "75",
  "version": "1.0",
  "author": "novajam",
  "createdUnix": "1436024328",
  "updatedUnix": "1436082217",
  "containsAdultContent": false,
  "uploadedBy": "Novajam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000166592",
      "name": "Arachnomancer 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Arachnomancer 1.0-67510-1-0.7z",
      "uploadedUnix": "1436024177",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5b3bd6c152a3ac0aa7cd9cc22aa1c3c88174e0b3dd317824efd2874eebcf4fb4/analysis/1436024223/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arachnomancer%201.0-67510-1-0.7z?fid=1000166592&ttl=1535855936&ri=8192&rs=8192&setec=722ecbf67b6e2f9254fb3b00b587daa0"
    },
    {
      "fileId": "1000166686",
      "name": "Arachnomancer 1.01",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Arachnomancer 1.01-67510-1-01.7z",
      "uploadedUnix": "1436082217",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/bfa80f88e8e4c635779069d1ca694a7a59f7602e33548de7a75a7a691b310ada/analysis/1436082243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arachnomancer%201.01-67510-1-01.7z?fid=1000166686&ttl=1535855936&ri=8192&rs=8192&setec=486a0a037f2f0ddc869e0bedfc3d74bd"
    }
  ]
}