{
  "modId": 67581.0,
  "modName": "The Amazing Guide to Gray Face Cures",
  "summary": "If you have been modding Skyrim for a while, you may have come across the Gray Face.  This guide is to help you fix it.",
  "descriptionHtml": "*Holy crap it&#39;s been a long time. I honestly completely stopped playing Skyrim and modding completely for like...years. Anyway, I&#39;ve noticed that since the Special Edition came out, my downloads have gone up again so I&#39;m going to qualify, that this is a use at your own risk for the special edition. I&#39;ve heard they messed a little bit with how exports work, specifically that they&#39;re separated by mod. I&#39;m not sure if this is true, but the statement stands. I might get around to oking this for the special edition, but that&#39;s highly dependent on if skse64 ever releases to help rekindle my interest in a remastered skyrim. Crappy answer I know, but having a playground I can only look at through a window bugs me. I&#39;d say give it a shot, and if it doesn&#39;t work just delete the export files. No harm no foul. I don&#39;t really check my mods anymore for comments so if you&#39;re having trouble feel free to pm me.*\r<br />\r<br />So, I&#39;m going to start by saying that THIS ISN&#39;T A MOD THAT WILL CHANGE YOUR GAME.  This is a .txt file that will help you fix issues of ongoing Gray Face problems.  I originally made it for my Allfem mod, because due to the way the game works Gray Face issues are pretty much guaranteed, and decided that people may or may not appreciate it on a fuller scale since I doubt many of the average Nexus goers have seen my mod.  Also, I&#39;m going to start with my disclaimers.\r<br />\r<br />\r<br />WARNING:\r<br />\r<br />THIS MOD DEALS WITH CHANGES TO YOUR INI.  NO, NOT YOUR SKYRIM INI, BUT YOUR CREATION KIT INI.  JUST LIKE WITH YOUR SKYRIM INI THOUGH, YOU CAN AND PROBABLY WILL BREAK YOUR CREATION KIT IF YOU FUCK AROUND IN IT.  IF YOU ASK ME WHY THINGS ARE HAPPENING, AND IT HAS TO DO WITH YOUR INI, 98% OF MY ANSWERS WILL BE TO UNINSTALL, AND THEN REINSTALL THE CREATION KIT AND START OVER. On a less CAPS lock note, the only reason I&#39;ll hit you up on these on a personal level, is if you don&#39;t have all the DLC and you&#39;re confused on what to put in.  If you just aren&#39;t following my directions for changing the INI, or you fucked with things, and are trying to blame me for it, than I either ignore you, or tell you to reinstall, depending on how accusatory you are about it.  It&#39;s not that I&#39;ll be but hurt, but it&#39;s annoying when people try to blame issues on you that you&#39;ve had nothing to do with.\r<br />\r<br />I used to have a link at the bottom of the guide, but the file has been hidden by the author, and I can&#39;t rightly remember where it used to go. Sorry folks.  ",
  "categoryId": "29",
  "version": "1.1",
  "author": "Nojanath",
  "createdUnix": "1436219188",
  "updatedUnix": "1436839605",
  "containsAdultContent": false,
  "uploadedBy": "nojanath",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000167769",
      "name": "Gray Face Medication Guide",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Gray Face Medication Guide-67581-1-1.zip",
      "uploadedUnix": "1436839605",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2e81991551af1f89a831017d70da996431964920e58bd863b6936726634e04c3/analysis/1436839622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gray%20Face%20Medication%20Guide-67581-1-1.zip?fid=1000167769&ttl=1535856039&ri=8192&rs=8192&setec=53121e9ef90ce3b6a615a43644e0120a"
    }
  ]
}