{
  "modId": 67597.0,
  "modName": "Friends in Skyrim",
  "summary": "Friends in Skyrim is a mod that adds followers, spouses, trainers, and merchants around Skyrim. It is meant to be helpful for new players or when starting a new character. There are new books and spells, too, you just need to look.",
  "descriptionHtml": "Friends in Skyrim is a mod that adds followers, spouses, trainers, and merchants around Skyrim. It is meant to be helpful for new players or when starting a new character. There are new books and spells, too, you just need to look&#33; You can finally have an Altmer/Bosmer spouse and follower, too&#33;\r<br />\r<br />[b][center][url=http://www.nexusmods.com/skyrimspecialedition/mods/553]Click here[/url] for the Skyrim Special Edition version.[/center][/b]\r<br />\r<br />[color=#9fc5e8][size=4][b]What&#39;s new, what&#39;s changed?[/b][/size][/color]\r<br />Friends in Skyrim makes changes to the area across the bridge in Riverwood, by adding a Shack. A couple NPCs live there. Whiterun is the most populated at the moment with 5 NPCs that hang around the Plains District and the Drunken Huntsman. The Drunken Huntsman has also been modified to add an Alchemy Lab and Arcane Enchanter to the back room. The old pantry area is now is small sleeping area, if the Dragonborn ever gets sleepy and needs to rest for a while. Look around the area for some books that let you get to know more about the NPCs. There is a new storage area just behind Warmadien&#39;s, a convenient spot for storing supplies.\r<br />[b]\r<br />[color=#9fc5e8][size=4]Followers, spouses, trainers, merchants, oh my&#33;[/size][/color][/b]\r<br />All are trainers and some are merchants. There are two marriageable and follower capable Bosmer, a male and female, and two marriageable and three follower capable Altmer, two males and one female, as well. Other races that are also amongst the marriageable, follower, trainer, and merchants, are two Dunmer and two Redguards.\r<br />\r<br />[color=#9fc5e8][size=4][b]Meet your friends&#33;[/b][/size][/color]\r<br />Please visit [i][b][url=https://sites.google.com/site/friendsinskyrim/friends]Friends in Skyrim[/url][/b][/i] for pictures and detailed information.\r<br />\r<br />While there are only 12 new &#34;Friends in Skyrim&#34;, I have done my best to make marriageable and follower NPCs who were not able to be married or become followers in vanilla Skyrim. Not all of your friends can be married, but some of them can. It is now possible to marry a female and male Bosmer and Altmer. All of your friends that are merchants have leveled gold. As you level up, so does their gold. Each friend has a preference in what they sell. If your friend is a Sneak trainer, they will mainly sell Sneak items, such as Fortify Sneak enchanted items and ingredients that can be used to create Fortify Sneak potions. All friends that are followers have the Light Foot perk, so they won&#39;t set off traps while adventuring with you.\r<br />\r<br />Look around the area where your friends reside, and you may find books and journals lying about. Read them to learn more about that person. Some of the books you find will even give you a skill increase depending on the topic being discussed in the book, some of these books will even mark locations on your map.\r<br />\r<br />[color=#9fc5e8][size=4][b]New books and spells&#33;[/b][/size][/color]\r<br />There are 5 new skills books and 3 new spell tomes. Two skill books can be found in Riverwood, just look around outside the shack. Three skills books can also be found in Whiterun, just wander around the Plains District and check the Drunken Huntsman. Russi, an Altmer mage, sells three new powerful spell tomes.\r<br />\r<br />Have fun, and get to know your new friends&#33;\r<br />\r<br />[color=#9fc5e8][size=4][b]Compatibility[/b][/size][/color]\r<br />The most recent official patch (Version 1.9). DLC not required.\r<br />\r<br />Mods that make changes to the outside area across the bridge in Riverwood may be incompatible. There are minor changes made to the cells: WhiterunWorld, WhiterunDrunkenHuntsman, WhiterunUthgerdTheUnbrokensHouse, AlchemistsShackExterior, IvarsteadVilemyrInn, ReachwindEyrieExterior, and SolitudeRadiantRaiment.\r<br />\r<br />[color=#9fc5e8][size=4][b]Main Webpage[/b][/size][/color]\r<br />[url=https://sites.google.com/site/friendsinskyrim]https://sites.google.com/site/friendsinskyrim[/url]",
  "categoryId": "96",
  "version": "1.1",
  "author": "TombRaiser",
  "createdUnix": "1436292408",
  "updatedUnix": "1438453081",
  "containsAdultContent": false,
  "uploadedBy": "TombRaiser",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000166971",
      "name": "Friends in Skyrim",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7526",
      "fileName": "Friends in Skyrim-67597-1-0.rar",
      "uploadedUnix": "1436291966",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/831ab060112243fab084cb9e6b3a4f8730cda47de6be0fec48ff382883b32598/analysis/1436292006/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Friends%20in%20Skyrim-67597-1-0.rar?fid=1000166971&ttl=1535856067&ri=8192&rs=8192&setec=7298a02c473172f70c1cda69be2b2a2a"
    },
    {
      "fileId": "1000170179",
      "name": "Friends in Skyrim",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7734",
      "fileName": "Friends in Skyrim-67597-1-1.rar",
      "uploadedUnix": "1438453081",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/562c7bbbb9ea76688dfbf5e2a35c59a73c46c5628e66a41c98fee9aae31d53d0/analysis/1438453148/",
      "changelogHtml": " Cleaned a few unwanted edits with TES5Edit.\r<br />\r<br />Fixed Erassarie&#39;s Bannered Mare (Loredas) Sandbox package.\r<br />\r<br />Added a Sleep package for Alawen and Arathor. They will sleep on bedrolls on the top room of the Drunken Huntsman.\r<br />\r<br />Changed Russi&#39;s sleeping area to the top room master bed of the Drunken Huntsman to be more compatible with Immersive Citizens - AI Overhaul, which switches Elrindir&#39;s and Anoriath&#39;s beds.\r<br />\r<br />Removed Chain Lightning, Fireball, Lightning Cloak, Frost Cloak, and Flame Cloak spells from Magic followers (Friendly fire problems). Substituted with Powerful Sparks, Powerful Flames, and Powerful Frost. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Friends%20in%20Skyrim-67597-1-1.rar?fid=1000170179&ttl=1535856067&ri=8192&rs=8192&setec=6ceaf22aee634d3df07dd13c7abebda9"
    }
  ]
}