{
  "modId": 67629.0,
  "modName": "Kainalten Keep",
  "summary": "A small castle next to the Solitude Sawmill, with dungeon to acquire ownership.",
  "descriptionHtml": "[center][img]http://i.imgur.com/MZy8NLN.jpg[/img]\r<br />\r<br />Welcome to Kainalten Keep, a player home&#33; You will find it located next to the Solitude Sawmill right on the Karth river.\r<br />I really liked my design for the Darkwater Keep mod, so I kept it overall and made small modifications to make it adoption-friendly.\r<br />\r<br />This Keep has been made for those that want wealth, but not opulence. A knight or merchant, dawnguard or vampire, may call this place home. It&#39;s my new base of operations against the Thalmor but close the the heart of the Empire in Skyrim.\r<br />\r<br />Lore-wise, an old Thane had been accused of treason and sent to life imprisonment in Starfall Cave. The Dawnguard had been tasked to keep watch, and maintain the Thane&#39;s estate until a new lord had been appointed. The keep itself was built to defend the Solitude Docks and other outposts from threats along the river. The Thane is still alive, as a vampire, and paces, awaiting his chance to be released and holds with him a key to the keep.\r<br />\r<br />Thank you for downloading, I hope you enjoy&#33;\r<br />\r<br />[color=#1e84cc]The file comes with: [/color]\r<br />- 2 mannequins, several weapon racks, and a lot of storage for a small space.\r<br />- 5 beds + master bed for followers and/or children. \r<br />- Hearthfire amenities, such as an oven.\r<br />- Functional shower in the bathroom.\r<br />- Cleaned with TESVEdit.\r<br />- Multiple Adoption mod friendly, navmeshed with many markers.\r<br />- Alchemy and Enchanting workstations inside, and an anvil and weapon/armor furnishings outdoors.\r<br />- Large main hall and round table for your followers and family, with a cozy separate master bedroom.\r<br />- Great view of the Solitude Bay, and the tower offers a 360 view of the region.\r<br />- A new cave to explore, including a high-level boss vampire (The entrance is a well between buildings at the Solitude Sawmill).\r<br />- The mill right outside the keep is a nice place for family and followers, with a lot of food and flora. Also nice if you like hard work. \r<br />\r<br />[color=#ff0000]Dungeon Spoiler if you are having difficulty: [/color]The cave with the house key is in a well-door by the fence near the sawmill house and road. To get behind the locked door in the cave, there is a pressure plate puzzle; all pressure plates must have an item dropped on them, then the one on the door must be shot at.\r<br />\r<br />[color=#1e84cc]Installation: [/color]\r<br />- One .esp file with a Mesh and Texture folder to be placed in your Skyrim &gt; Data folder. \r<br />[color=#00ffff]Thank you Darkrider for these wall painting resources&#33; \r<br />\r<br />[color=#ffffff][color=#1e84cc]Incompatabilities:[/color]\r<br />- Anything modifying the Solitude Sawmill area might have issues. \r<br />[/color][/color]\r<br />(Not only the Nexus, but my CK have been a tad glitchy. Let me know if you have any issues.)[/center]",
  "categoryId": "67",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1436318865",
  "updatedUnix": "1436318589",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000167011",
      "name": "Kainalten Keep",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5987",
      "fileName": "Kainalten Keep-67629-1-0.zip",
      "uploadedUnix": "1436318589",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d48779673ef1ba643cf757e11703b19d1a0b2d5ae41672eba72a12f59318e569/analysis/1436318644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Kainalten%20Keep-67629-1-0.zip?fid=1000167011&ttl=1535856102&ri=8192&rs=8192&setec=7dbc3f9cd4f59472ea4c6286f45481fe"
    }
  ]
}