{
  "modId": 67701.0,
  "modName": "Hunterborn . Traduzione Italiana by DesRPG",
  "summary": "Mi sono limitato a tradurre il file Hunterborn_ITALIAN.TXT che trovate sotto Skyrim/Data/Interface/translations dopo aver installato la MOD Hunterborn. Per installare la traduzione basterà fare un copia incolla del mio file con quello presente in origine.",
  "descriptionHtml": "Hunterborn - Traduzione Italiana by DesRPG\r<br />\r<br />INTRO\r<br />\r<br />Hunterborn è una mod molto divertente, ma purtroppo non aveva alcuna traduzione, spulciando fra le cartelle di Skyrim e seguendo il percorso Skyrim/Data/Interface/translations ho scoperto che l&#39;autore della MOD Hunterborn ha predisposto una serie di file .TXT per ciascuna lingua supportata dal gioco, i file originali ovviamente sono tutti in inglese, ma basta tradurne il contenuto e salvare il file per potersi godere la completa traduzione della MOD. Così mi sono dato da fare ed ho tradotto tutto quanto. Non sono un esperto di traduzioni e non ho mai modificato MOD di Skyrim, però posso dirvi che a me la traduzione funziona perfettamente e non da alcun problema, fin&#39;ora almeno non ho incontrato parti che risultassero non tradotte.\r<br />\r<br />INSTALLAZIONE\r<br />\r<br />Dovete semplicemente installare Hunterborn e scaricare il mio file Hunterborn_ITALIAN.TXT ed andare ad incollarlo in Skyrim/Data/Interface/translations per sostituire il file omonimo lì presente. Et voilà traduzione installata&#33; Enjoy&#33;\r<br />\r<br />NB\r<br />\r<br />Potrebbe essermi sfuggita qualche riga qua e là, ma penso che il 99% della MOD sia stato tradotto in maniera corretta. I nomi delle nuove risorse aggiunte da Hunterborn non credo siano traducibili dal file .TXT predisposto dall&#39;autore per cui non verranno tradotte.\r<br />\r<br />PS\r<br />\r<br />Se qualcuno volesse utilizzare la mia traduzione per realizzare una mod/traduzione completa magari compatibile con il NMM è libero di farlo ricordandosi però di creditarmi :P",
  "categoryId": "78",
  "version": "v.0.1",
  "author": "DesRPG",
  "createdUnix": "1436528483",
  "updatedUnix": "1436528483",
  "containsAdultContent": false,
  "uploadedBy": "DesRPG",
  "primaryFile": null,
  "files": []
}