{
  "modId": 67715.0,
  "modName": "Simple Alternate Start Mod",
  "summary": "for those who want to have a skyrim alternate start the old fashioned workaround way: no modding required.",
  "descriptionHtml": "simple alternate start-by niv lev ari gatenio\r<br />--------------------------------------------------------\r<br />Background(For making the mod)\r<br />in the past i have tried plenty of alternate start methods: alternate start creator, altered beginings,alternate start-a new life,skyrim unbound: and they were all great and peachy. but they all seemed to share the same annoying reoccuring glitch: they,at times,worked fine but in most times: rendered my skyrim incapable of booting a new game....this had annoyed me to no avail.\r<br />i have heard about the sstartingcell command of skyrim and i have used it in the past but i never made it into an archived modding package.\r<br />this mod is for people who want an alternate start(That is: to skip the whole &#34;you were trying to cross the border,right?&#34; crap) but don&#39;t want to fuff about with anything bombastic,game changing or downright glitchy.\r<br />descripition:\r<br />---------------\r<br />this mod is a simple alternative to all alternate start mods: it doesn&#39;t require any DLC&#39;s nor does it require you to do anything special: its a simple\r<br />workaround us old skyrim users used before the great mods like &#34;a new life&#34; &#34;unbound&#34; or even &#34;Altered beginings&#34; came out. the idea of it\r<br />is pretty straight-forward: the mod changes a parameter within skyrim&#39;s skyrim.ini file in the &#34;my games&#34; folder. the parameter basicly tells the game &#34;Alright pal,here&#39;s the deal: from now on: i want you to load up skyrim for me but skip the main menu screen,put me in a basic e3 nord dovahkin character and load me into the specific cell i tell you so i can do some alpha testing on my game,capich?&#34;. i have also created 3 custom bat files to make sure that you game runs smoothly with the main quest and everything.\r<br />to install the mod:simply place the my games folder in your &#34;my documents folder&#34;\r<br />and 1.txt,2.txt and 3.txt at your skyrim root folder(were the launcher and game executable are.\r<br />to play the game afterwards,you will need to follow 6 very quick and very simple steps:\r<br />1)boot up the game\r<br />2) like said in the description of the mod: the game will boot up but skip the main menu entirely: instead,you will start as an e3 dragoborn character(you know: the blond nord in the iron armor) right outside the gate leading to riverwood\r<br />3)you will now have to rebuild your character by getting rid of your helmet and gear and triggering the race menu: i have simplified this process for you: simply load up the console with the tild key (~) and type in :\r<br />bat 1\r<br />the game will then.....umm.......disrobe you.....and then immediately load up the race menu to allow you to build your character.\r<br />4) build your character,name him and select ok\r<br />5) now you will need to get yourself some clothes(we wouldn&#39;t want you running naked in the skyrim winter now,would we?): again,simplified with bat command. simply open the console with the tild key(~) again and type in:\r<br />bat 2\r<br />the game will then give you and auto equip your character with some starter gear: clothes,boots and a simple iron sword(the reason i don&#39;t want to go giving your character insta-loot is because unlike my other mods: this isn&#39;t a cheat mod and i don&#39;t want you to feel like i&#39;m controlling your character creation and gameplay more then i need to). there will also be a small iron dagger added to your inventory for simple close quarter combat. \r<br />PLEASE NOTE: to allow you to compensate for your skipping of the helgen dungeon: i have made an optional alternative to bat 2 called &#34;bat 2p5&#34;. this is  a slightly different version of bat 2 that you can use the same way as bat 2,but instead of just giving clothes and some basic armaments: it also gives you 15 lockpicks(to compensate you for not gaining lockpicks the usual way) and 500 gold to start you adventures with.\r<br />just a heads up for those interested.\r<br />6) finally: you will need to enable the main quest by telling the game you want to start right after you SPOLIER ALERT&#33; either talk to gerdur or alvor about the dragon attack and they tell you to talk to the jarl.\r<br />to do this: simply load up the console with the tild key (~) for one final time and type in:\r<br />bat 3\r<br />the game will then set the stage for you to SPOLIER ALERT&#33; go to whiterun and tell jarl baalgruuf about the dragon attack on helgen.\r<br />7)thats it:your all set: now just contiune your entry into riverwood and go enjoy your adventures.\r<br />known issues:\r<br />---------------------\r<br />1) there is the slight problem with this workaround where your game will continue to load your game the same way in riverwood no matter what.\r<br />if you want to get rid of that: you will need to manualy go to my documents&#92;my games&#92;skyrim&#92;skyrim ini: look over at your [general] section and remove the Sstartingcell=riverwood command from there. NOTE: ONLY REMOVE THAT COMMAND: i am not liable for you destroying you skyrim.ini the process.\r<br />2)SPOILER ALERT&#33; your balgruuf and ireleth dialoge in &#34;before the storm&#34; will,naturally,be slightly different since your skipping certain parts of the main quest with this mod. don&#39;t panic&#33; there will be fewer options to choose from but you will still be able to complete the quest.\r<br />and that&#39;s pretty much it.\r<br />Special Thanks:\r<br />----------------------\r<br />Bethesda Softworks-for making the elder scrolls v skyrim\r<br />the internet&#92;my personal experience: for teaching me the basics of editing skyrim and creating bat files\r<br />modding community-for modding awesomeness\r<br />community love-for being such lovely people.\r<br />enjoy and have fun&#33;\r<br />",
  "categoryId": "24",
  "version": "1.5",
  "author": "nivlevarigatenio",
  "createdUnix": "1436556401",
  "updatedUnix": "1436556574",
  "containsAdultContent": false,
  "uploadedBy": "nivlevari123456789",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000167360",
      "name": "Simple Alternate Start",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Simple Alternate Start-67715-1-5.rar",
      "uploadedUnix": "1436556574",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/3c6ce786681440a086fd66f65d9971701fea5aca37dd74f3d682a924ff164ad5/analysis/1436556423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Alternate%20Start-67715-1-5.rar?fid=1000167360&ttl=1535856165&ri=8192&rs=8192&setec=b646a0537051cfd81c4058454ce1068d"
    }
  ]
}