{
  "modId": 67869.0,
  "modName": "Fierce Fireball Blast",
  "summary": "This spell allows the caster to do a BUTT ton more damage with a slight casting time boost of 3 seconds.\r<br />CAUTION&#33;&#33;&#33; it is very overpowered.  Do not use in small spaces and near anyplace you don&#39;t want to kill inocent npc&#39;s or set on fire anyone that you know will try to kill you. esp. Comander Caias of Whiterun. ",
  "descriptionHtml": "This is a spell I created with the creation kit.  It is located in Whiterun as you walk in through the main gate to the left side on the wall near the light lamp.\r<br />\r<br />Sorry I have no pic yet but I hopefully will be adding some soon.  Also I&#39;m  planning on making morespells in the future like Alteration, Illusion, Conjuration.  Also I&#39;m planning on making an additional perk tree that deals in rune usage.  I&#39;m thinking of calling it &#34;Rune Master&#34; it deals in runes that will level up with the player and grow stronger with each perk invested i&#39;d also like to make it accessable to vanilla Skyre and Perkus Maximus. I&#39;d like to get permission from the mod authors to do this but making the tree and the spell tomes might take a while. I am still a kind of Novice at making spells so please try them out and tell me what you think.  I also have 2 Followers witch integrate awesomely with follower mods like AFT and EFF.  \r<br />\r<br />Hope you all enjoy my first try at this mod making stuff.",
  "categoryId": "75",
  "version": "1.1B",
  "author": "Viper1475",
  "createdUnix": "1437014394",
  "updatedUnix": "1437015406",
  "containsAdultContent": false,
  "uploadedBy": "AndrewMekelski",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000168030",
      "name": "Fire Spell v1.1A",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "Fire Spell v1.0A-67869-.zip",
      "uploadedUnix": "1437015406",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/05fb03b50d371d9b07a958565d0cc2b9341bc5de150a38c011e1539b577ec538/analysis/1437015423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fire%20Spell%20v1.0A-67869-.zip?fid=1000168030&ttl=1535856288&ri=8192&rs=8192&setec=20a2bab1316e5a1b75e00c9f03acd757"
    }
  ]
}