{
  "modId": 67909.0,
  "modName": "New Amberguard",
  "summary": "A small, fortified town in Hjaalmarch near Rorikstead.",
  "descriptionHtml": "[center][font=Georgia][color=#f1c232][size=6]~New Amberguard~\r<br />\r<br />[/size][/color][/font]Thank you for visiting my latest town experiment, New Amberguard. It is a small fortified castle-town at the beginning of the River Hjaal, along the road immediately [b]North of Rorikstead[/b]. It was established decades ago as a first-response outpost at the intersection of Hjaalmarch, Whiterun and the Reach, with a great sweeping view of Robbers Gorge in order to protect the surrounding settlements and travelers. The Thane has lately busied himself with digging below the city in order to find new Mer relics; as the surface is abundant in Snow Elf masonry and Dwemer machinery, as evidenced by the towns magnificent clock tower. It can be fast-traveled to as soon as it is installed. This is a bit larger of a project than I hoped, so please let me know if anything goes wrong, and hopefully everyone will enjoy the views and location&#33;\r<br />\r<br />[color=#93c47d]Town Amenities: [/color]\r<br /> - A fully stocked Blacksmith, including indoor forge. \r<br />- A new merchant Tradehouse, with two resident traders with their son who wanders about.\r<br />- A new, functioning Tavern with a room to rent from the proprietor, and a custom bard for entertainment.\r<br />- An Apothecary at the base of the castle keep (it&#39;s a little hidden).\r<br />- Several guards, a working portcullis, three watchtowers and a horse stable. \r<br />- A random-encounter zone just outside the town gate.\r<br />- Some Radiant quest markers for the Thieves Guild.\r<br />- A custom, stained-glass door for most buildings (standalone).\r<br />- A small dungeon beneath the tavern with leveled vampires.\r<br />- A new, medium-sized player-owned castle keep (Multiple Adoption Friendly&#33;)\r<br />\r<br />The Keep contains several weapons displays, 5 beds for followers/children, a master bedroom with crafting stations, 3 mannequins and a cookery. I pride myself with working with vanilla resources, so let me know if you think the place is a little too sparse for a castle keep. I might expand on it in the future.\r<br />\r<br />[color=#93c47d]Troubleshooting:[/color]\r<br />Q: How do I get into the town with the closed gate?\r<br />A: There is a pullchain mechanism on your right that activates the portcullis. \r<br />Q: Can I get into the player home without going through the dungeon?\r<br />A: Besides that the front keep door is a master lock, you can console command, click the door for the code, and type &#39;unlock&#39;, and it should let you in.\r<br />Q: So the door is locked, how do I get a key to it?\r<br />A: It is held by the previous Thane; You must go into the tavern, and in the basement there is a key on a stool to open the door right next to it for the dungeon. The Thane is at the end in a nook that you must swim under water to get to. \r<br />Q: Can I have some help on that pressure-plate puzzle?\r<br />A: It&#39;s not necessary for the key, but it has more loot behind it. An item must be placed on every plate before shooting the one above the gate. The second puzzle following must have the plate shot at, then you must run through the gate before it closes behind you. There are levers to open them again from the other side. \r<br />[color=#93c47d]\r<br />Requirements:[/color]\r<br />- Dawnguard (Mostly for aesthetics)\r<br />- Hearthfire (For the Multiple Adoption optional mod)\r<br />\r<br />[color=#93c47d]Incompatabilities: [/color]\r<br />- Elianora&#39;s [url=http://www.nexusmods.com/skyrim/mods/57371/?]Elisdriel[/url].\r<br />- Oblivionlaserie&#39;s [url=http://www.nexusmods.com/skyrim/mods/35200/?]Death Mountain[/url].\r<br />- MannyGT&#39;s [url=http://www.nexusmods.com/skyrim/mods/16197/?]The Secret of Dragonhead[/url].\r<br />\r<br />\r<br />Thank you again for trying this out, and I hope everyone enjoys what I&#39;ve put together&#33; [/center]",
  "categoryId": "53",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1437096140",
  "updatedUnix": "1437168147",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000168242",
      "name": "New Amberguard",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1055",
      "fileName": "New Amberguard-67909-1-0.zip",
      "uploadedUnix": "1437168147",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/de6da30c617fb601da0057d0345e2a90376f99de0a4b0f2e246ee709155bc6ef/analysis/1437168182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Amberguard-67909-1-0.zip?fid=1000168242&ttl=1535856332&ri=8192&rs=8192&setec=bfecdea0bfb5d54d3d18d6ca29d67851"
    }
  ]
}