{
  "modId": 6816.0,
  "modName": "Cassiah Save Game",
  "summary": "Cassiah, a young sexy Mage for you magicka addicts.",
  "descriptionHtml": "So I present for your downloading pleasure my second creation. Cassiah. She\\'s an Imperial Mage on the run from Cyrodiil from a horrible accident that wasn\\'t her doing. (Presented in the backstory that comes in the .rar.)\r\nShe\\'s young, only 20 seasons experience under her belt. But as far as Mages go, she\\'s got an awesome power that is not be reckoned with. \r\nNow, as with my previous Khajiit character, I\\'ve altered Cassiah a bit also.\r\nHer Destruction skill has been augmented to 40, and I\\'ve given her the following perks in the Destruction tree:\r\nNovice and Apprentice Destruction\r\nAugmented Flames 1/2\r\nDual Casting\r\nHer backstory fits her as a Fire Mage, but that can be easily changed with some console commands.\r\nHer Speechcraft has been increased to 25.\r\nAnd as before. I\\'ve increased her Health from 100 to 125. Her Magicka from 100 to 350. And her Stamina from 100 to 225. \r\nAlso as before, I\\'ve given her a Thousand gold to help you on your way. She also has lockpicks, food items and various potions on her. She is currently equipped in the Novice Robes of Destruction set found in Helgen Keep. I\\'ve also sent her to follow Ralof, seeing as how the Empire, well...you get the idea, especially if you read her back story.\r\n\r\nSo please add all of your comments. I do take requests. And I\\'ll be adding many more save games in the days to come. I hope you all enjoy my characters and their stories! If you like my creations, please endorse and rate. I\\'d love some feedback as well on where I can improve on everything!\r\n\r\nNow. Thanks again to all the awesome mods that made her creation possible. Full kudos and props and brownie points to the creators of those mods and I give their creators full credit for their creation. I only take credit for my character.\r\nAs with my Khajiit, you\\'ll need the following mods to have Cassiah look the way she does or else you\\'re screwededed:\r\nCBBE Slim option:\r\nhttp://skyrimnexus.com/downloads/file.php?id=2666\r\nDetailed Faces:\r\nhttp://skyrimnexus.com/downloads/file.php?id=26\r\nDetailed Lips:\r\nhttp://skyrimnexus.com/downloads/file.php?id=689\r\n (You can choose your female face option. There are a few to choose from. I can no longer find the link to the mod I used and might be changing it in the very near future.)\r\nNo More Blocky Faces:\r\nhttp://skyrimnexus.com/downloads/file.php?id=30\r\nKiller Keos Skimpy Armor:\r\nhttp://skyrimnexus.com/downloads/file.php?id=3654\r\n\r\n\r\nAgain. Full credits go to the creators of the mods that allowed me to create such an awesome character. Thank you!\r\n\r\n",
  "categoryId": "43",
  "version": "",
  "author": "Me",
  "createdUnix": "1327257877",
  "updatedUnix": "1327258075",
  "containsAdultContent": false,
  "uploadedBy": "Tidewalker117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "22131",
      "name": "Cassiah Save Game",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1047",
      "fileName": "Cassiah Save Game-6816-1.rar",
      "uploadedUnix": "1327258075",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e2d1f33a360358e4fdea2e6111e3a664f92e50a37a2e0130b00ce585c1afc4f3/analysis/1406631247/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cassiah%20Save%20Game-6816-1.rar?fid=22131&ttl=1535764490&ri=8192&rs=8192&setec=dd7fcb35be02671ccbf1af15d16525ae"
    }
  ]
}