{
  "modId": 68197.0,
  "modName": "Epic Music Overhaul - A Mixture of Stuff",
  "summary": "Tracks implemented into Skyrim, from games including World of Warcraft, Guild Wars 2, The Elder Scrolls Online, Diablo 3, Inquisition, the Witcher 3, and also TSFH and Audiomachine.",
  "descriptionHtml": "Inb4, sorry if there&#39;s any grammatical mistake, GRAMMATIK MACHT FREI.\r<br />\r<br />\r<br />Tracks implemented into Skyrim using EMO, from:\r<br />World of Warcraft: Warlords of Draenor (No track from other expansions/vanilla)\r<br />Guild Wars 2\r<br />Diablo 3: Reaper of Souls (No track from Act I to Act IV)\r<br />Dragon Age: Inquisition\r<br />The Elder Scrolls Online\r<br />The Witcher 3\r<br />Oblivion (Only a few)\r<br />Morrowind (Only a few)\r<br />Two Steps From Hell\r<br />Audiomachine\r<br />Other tracks composed by Jeremy Soule, that I don&#39;t know which games or films or purpose were they composed for.\r<br />\r<br />Requirement:\r<br />[url=http://www.nexusmods.com/skyrim/mods/53888/?]EMO original mod (for its esp and scripts)[/url]\r<br />Everything that EMO requires\r<br />\r<br />Compatibility:\r<br />Incompatible with any other mod that modifies soundtracks (except EMO base mod), that&#39;s for sure.\r<br />\r<br />\r<br />Sometimes there might be disparity between tracks in a zone, but I didn&#39;t find it disturbing or critical; these tracks actually immersed me into the game a lot, as I got quite bored of the vanilla tracks which mostly feature serenity. But EMO allows users to retain vanilla tracks (also to prevent them from playing).\r<br />\r<br />One thing worth mentioning, is that I picked some sad-themed-yet-still-epic tracks (eg. Red Sorrow) for civil war, as I find this war pointless and foolish, only making innocent men die and bleed for it, while the Nords have to fight their own brethren and once-comrades; the war will still leave its mark on the history, that&#39;s why the tracks should be both sad and epic.\r<br />\r<br />Also, besides the tracks that EMO offers spaces for, I also replaced the Level-Up, Absorb Dragon Soul, Learn Word of Power, Monumental Moments (Alduin&#39;s downfall, go to Skuldafn, which use level-up tracks) tracks with &#34;new&#34; tracks from vanilla and ESO tracks edited by myself. If you don&#39;t want them, simply remove every file except those in the EMO folder.\r<br />\r<br />I did find some tracks as awesome as those in the package, but I think they&#39;re not suitable (eg. &#34;cute and lovely&#34; tracks, tracks by guitar) for a game like Skyrim, or any zone or moment in Skyrim, so I didn&#39;t add them.\r<br />\r<br />I&#39;ve checked all tracks and there should be no mismatch - at least for my taste. lol\r<br />\r<br />Jeremy Soule is one of the best modern musicians, without a doubt. He&#39;s capable in all criteria of music, and I adore most of his work (I don&#39;t like some due to my own taste, it&#39;s personal and has nothing to do with Jeremy&#39;s own talent).\r<br />\r<br />\r<br />[b][size=5]If there&#39;s any legitimacy problem, please inform. I don&#39;t want to be banned without knowing the problems and being given a chance to fix them.[/size][/b]\r<br />\r<br />Credits:\r<br />Microsoft for Windows\r<br />Betheada for the game itself\r<br />Jeremy Soule for Vanilla Skyrim tracks and most of the new tracks in the package\r<br />Apollodown for EMO\r<br />JohnB for Skyrim Audio Converter\r<br />Aldmeri Dominion and its Archon(s) for giving me LOTS of inspiration when I decide what tracks should be put into where\r<br />Myself for finding, locating, renaming and turning the tracks\r<br />World of Warcraft: Warlords of Draenor\r<br />Guild Wars 2\r<br />Diablo 3: Reaper of Souls\r<br />Dragon Age: Inquisition\r<br />The Elder Scrolls Online\r<br />The Witcher 3\r<br />Oblivion\r<br />Morrowind\r<br />Two Steps From Hell\r<br />Audiomachine",
  "categoryId": "61",
  "version": "1",
  "author": "MANY people",
  "createdUnix": "1437902587",
  "updatedUnix": "1437853118",
  "containsAdultContent": false,
  "uploadedBy": "kahasana",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000169261",
      "name": "Music Package (added this line because Nexus demands me to do so)",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "719664",
      "fileName": "Music Package (added this line because Nexus demands me to do so)-68197-.rar",
      "uploadedUnix": "1437853118",
      "modVersion": null,
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Music%20Package%20%28added%20this%20line%20because%20Nexus%20demands%20me%20to%20do%20so%29-68197-.rar?fid=1000169261&ttl=1535856580&ri=8192&rs=8192&setec=26f443f387d4ce65439155891faae6fe"
    }
  ]
}