{
  "modId": 68198.0,
  "modName": "Dragon Forged Ancient Nord Armor by Natterforme",
  "summary": "A new armor based on the Draugr Armor",
  "descriptionHtml": "Name:  by Natterforme\r<br /> Version: 1.0\r<br /> Date: 7/25/2015\r<br /> Category: \r<br /> Recommended: Nexus Mod Manager or Mod Organizer\r<br /> Author(s): Natterforme\r<br /> Description\r<br /> ===========\r<br /> This is a Nexus Exclusive. \r<br /> \r<br />Location\r<br /> ======== \r<br />This armor can be crafted at any forge. \r<br />Details\r<br /> =======\r<br /> THIS IS A NEXUS EXCLUSIVE&#33; NO STEAM SUPPORT WILL BE OFFERED AT THIS TIME&#33; IF I FIND THAT THIS HAS BEEN UPLOADED TO STEAM WITHOUT MY PERMISSION I WILL NOT BE LENIENT TOWARDS THE UPLOADER(S). YOU HAVE BEEN WARNED&#33;&#33;&#33; \r<br /> \r<br /> Lore:\r<br /> \r<br /> Many Nords believe that the Draugr were cursed with Undeath for being servants to the Dragons. This was not so. The Dragon Priests took their followers with them to serve them in the afterlife. It was no curse, it was a blessing. Those trusted with protecting the Dragon Priests in Death were known as the Dovah Sonaak Zin Dein, or Dragon Priest Honor Guard. They were masters of all forms of combat. Each carried Dragon blood in their veins and were masters of the Thu&#39;um. As a symbol of their position and authority, the Dragons bequeathed to them discarded bones, scales, and teeth which were then incorporated into an armor that was a beautiful as it was deadly. The centuries have worn and rusted this symbol of the Dragons&#39; favor but not even time could take away its superior defensive properties.   \r<br /> \r<br /> The armor consists of four items: Gauntlets, Boots, Helmet, and two versions of the Cuirass ( one with pauldrons and one without). Each piece  has a unique body item and a unique ground/worldspace item when you drop it from your inventory. The armor can be found under the steel category at the blacksmith forge. You will need the Ebony perk to craft it. Each piece of the armor will require some dragonbones and dragonscales to craft. They can be upgraded with steel ingots. The armor is only fitted to the male_0 body. There is no current support for beast races, male orcs, or the female gender. The helmet, boots, and gauntlets will fit on the human female but the cuirass is not formatted to fit the female body. I am actively looking for someone with previous experience in body morphing to help me create the _1 weights for the male body, beastrace support, and body morph for the vanilla_0 and _1 female bodies. This armor is not added to the leveled lists so for now it can only be obtained by going to the forge and crafting it.\r<br /> \r<br /> The textures for the armor are in 2K HD with DTX1 for the diffuse maps and DTX3 interpolated alpha for the normals to support specularity.\r<br /> \r<br /> If you are using Grovetama&#39;s Extended skeleton with weapon placement support, I would highly recommend you move your weapons forward to about 4.5-4.6 on the scale, to keep your greatswords from hanging off of your back in space.\r<br /> \r<br />Install\r<br /> =======\r<br /> You can either download this mod with the Nexus mod manager or Mod Organizer or download the files and extract into the Skyrim data folder. Be sure to check the tick box in your data files section on the Skyrim launcher.\r<br /> \r<br />Uninstall\r<br /> =========\r<br /> Either use Nexus Mod Manager to remove the files or manually remove them from you Skyrim/Data folder. \r<br />Upgrade\r<br /> =======\r<br /> I plan to upgrade and improve this mod over time as I fix bugs, think of new ideas, become more adapted to the CK, and so on. Be sure to check back in once and awhile for updates. Be sure to completely uninstall any previous versions of this mod before upgrading though.\r<br /> \r<br />I will not take responsibility for corrupted save games or lost save games. Get into the habit of backing up your saves to protect your game data. Ignore at your own risk&#33;\r<br />Incompatibility\r<br /> ===============\r<br /> \r<br /> This mod should be compatible with all other mods as it does not take or change existing files. If you are using overhaul mods such as SkyRe or Perkus Maximus, it will need to be patched in a future update of this mod or in one of those mods. \r<br />  \r<br />Known Issues or Bugs\r<br /> ====================\r<br /> \r<br /> -Bending over or sneaking/crouching will cause parts of the armor to stretch incorrectly and will bend through the lower half of the cuirass. This cant really be fixed so much as it can be reduced. I am looking for help on this front.\r<br /> -No support for human/elf female bodies or beast races. Willing to add support for these if I can get help with it.\r<br /> -No weight slider support. (yet) \r<br /> \r<br />History\r<br /> =======\r<br /> \r<br /> 7/25/2015 - Version 1.0\r<br />  \r<br />Contact\r<br /> =======\r<br /> You can find me on the Nexus Forums here as Natterforme.\r<br /> \r<br />Credits\r<br /> =======\r<br /> -Thanks to Bethesda for creating Skyrim.\r<br /> -Thanks to SkyrimNexus.com for the a one-stop-shop resource for authors and players.\r<br /> -Thanks to LHammonds for the Readme Generator this file was based on.\r<br /> -Thanks to all of you who have encouraged me and have supported this armor mod since I first put up screenshots of it back in December 2011 and January 2012.\r<br /> -I thank you all for your patience with me^^.\r<br /> -Thanks to God for creating us all. Amen.\r<br /> \r<br />Tools Used\r<br />==========\r<br />Marmoset Toolbag\r<br />Quixel Suite \r<br />Zbrush 4r7\r<br />7-Zip - http://www.tesnexus.com/downloads/file.php?id=15579\r<br />Blender - http://www.tesnexus.com/downloads/file.php?id=12248\r<br />NIFSkope - http://niftools.sourceforge.net/wiki/NifSkope\r<br />Paint.NET - http://www.tesnexus.com/downloads/file.php?id=11909\r<br />Photoshop CS6- http://www.adobe.com/products/photoshop/\r<br />Readme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r<br /> Licensing/Legal\r<br /> ===============\r<br /> This is a Skyrim Nexus Exclusive.\r<br /> You MUST contact me before you do anything with this mod in any form for any reason. This includes language translations. I will NOT be providing Steam Workshop support at this time. I do not feel comfortable with their legal policies towards modding so I will not use it. I will not support or endorse its use at this time. If I want it to be on Steam, I will do so myself. If you see this on Steam, LET ME KNOW&#33; I will not support any version of this mod found on Steam. I will not accept any childish excuse about &#34;sharing&#34; with the community. If you refuse to respect my wishes, I can not, in good faith, respect yours.\r<br /> -Natterforme\r<br /> ",
  "categoryId": "54",
  "version": "1.0",
  "author": "Natterforme",
  "createdUnix": "1437852111",
  "updatedUnix": "1437852068",
  "containsAdultContent": false,
  "uploadedBy": "Natterforme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000169260",
      "name": "Dragon Forged Ancient Nord Armor by Natterforme",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21524",
      "fileName": "Dragon Forged Ancient Nord Armor by Natterforme-68198-1-0.zip",
      "uploadedUnix": "1437852068",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1f8d85775b50ee1834339a3d2963f4982ef6db40ce8412e9f8110e1d19a37e14/analysis/1437852146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragon%20Forged%20Ancient%20Nord%20Armor%20by%20Natterforme-68198-1-0.zip?fid=1000169260&ttl=1535856581&ri=8192&rs=8192&setec=9ed1cbdbdf7d5603e32aee8b1cc276ae"
    }
  ]
}