{
  "modId": 68201.0,
  "modName": "The Elder Notes REUPLOAD",
  "summary": "It was taken down, for &#34;copyright&#34;.  Now the file is a notepad.  No copyright if it&#39;s just a notepad.",
  "descriptionHtml": "[center]\r<br />\r<br />[font=Verdana][size=3][b][i]I&#39;m New\r<br />[/i][/b][/size][/font]\r<br />[font=Verdana]Hello, this is the first mod I&#39;ve ever created and release on the Nexus.  I hope you guys like the mod and maybe even use it =D.[/font]\r<br />\r<br />\r<br />[font=Verdana][size=3][b][i]What Is This Mod?\r<br />[/i][/b][/size][/font]\r<br />[size=3]This mod adds in around 4 hours worth of hand chosen and hand sorted nostalgia and great memories for some, but its overall purpose is to give Skyrim a new feeling of variety in the category of music.  Skyrim already has a breathtaking and magical music track, but is only around 3.5 hours in length, and that&#39;s while it&#39;s being spread out over locations and player activities.\r<br />\r<br />This mod will give users the choice of adding in music from Daggerfall, Morrowind, Oblivion, and even TES Online.  Users will get the option to pick and choose a variety of combinations of music such as combat, exploration, dungeons, and misc per game they decide they want music from.  Users will also get the option to completely replace their vanilla game&#39;s music with their selections, or simply have their selections added to the vanilla game.\r<br />\r<br />Each category of music has multiple sub categories related to it behind the scenes.  So for exploration, different music will be played based on the time of day it is in your game.  For combat, it is based on what the enemy is, so for some bosses, there are new songs added in.  For dungeons, there are different songs based on the kind of dungeon it is, whether it be a normal dungeon, a fort, a cave, or an ice dungeon.  For misc, it contains songs for castles, taverns, towns, and temples.[/size]\r<br />\r<br />\r<br />[font=Verdana][size=3][b][i]Why This Over Other Music Mods?\r<br />[/i][/b][/size][/font]\r<br />[font=Verdana]This mod isn&#39;t aimed at pulling people from their current music mod setups if existing.  Its intention is simply to give users more options for music in their game without breaking total immersion.  Some music mods may be great as far as the immense amount of extra music they add, but many break immersion quite easily because they aren&#39;t songs made for The Elder Scrolls series; this leads to taking the player&#39;s mind out of the game and back to the realization that they&#39;re playing a game.  We play these kinds of games in order to lose ourselves and feel as if we are in another world, but if you break that connection with poor music choices, it ruins the point.[/font]\r<br />\r<br />\r<br />[font=Verdana][size=3][b][i]Compatibility[/i][/b][/size][/font]\r<br />\r<br />[font=Verdana]Unfortunately, just like every other music mod, this is not compatible with other music mods.[/font]\r<br />\r<br />\r<br />[font=Verdana][size=3][b][i]Credits[/i][/b][/size][/font]\r<br />\r<br />[list]\r<br />[*][font=Verdana][size=2]Bethesda - For all of their Elder Scrolls songs WHICH I DID NOT CREATE, ALL CREDITS TO THEM[/size][/font]\r<br />[*][font=Verdana][size=2]No_Aardvarks_Allowed - This mod was created with the framework of Personalized Music[/size][/font]\r<br />[/list][/center]",
  "categoryId": "61",
  "version": "1.0",
  "author": "lilquickguy",
  "createdUnix": "1437854125",
  "updatedUnix": "1437854125",
  "containsAdultContent": false,
  "uploadedBy": "lilquickguy",
  "primaryFile": null,
  "files": []
}