{
  "modId": 68238.0,
  "modName": "Massive NPC Facelift Project (MNFP)",
  "summary": "This mod alters most of the NPCs&#39; facial appearances throughout the lands of Skyrim. The NPCs are altered based on the character, backstory, and status. Followers, Marriage Candidates, Main Quest Line Characters, Civil War Generals, Jarls,  Merchants, Guild Members, Farmers, ect. ",
  "descriptionHtml": "[center][/center]           [center]  [/center]             [img]http://i.imgur.com/3YkElNv.jpg[/img]\r<br />\r<br />[center][size=4]This old mod is finally brought back again to Nexus (Last seen in 2012) Massive NPC Facelift Project aims to alter most of the NPCs&#39; appearances throughout the land of Skyrim. Such as Followers, Marriage Candidates, Essentials, Beast Races, Elves, Orcs, Miners, Civil War Leaders, Jarls, Farmers, Guild Members, Wizards, ect.  NPCs are altered based on numerous factors like backstory, status, voice, and morphology. My aim is to be Vanilla Friendly, while  drastically changing the NPCs to look more naturally attractive without the need to apply anime or makeup like characteristics (aesthetics, anime hairstyles)  This is my own artistic interpretation of the characters, and I hope to achieve [/size][size=4]making all characters in Skyrim look a lot more believable and appealing.\r<br />\r<br />[img]http://i.imgur.com/oWf9Agr.jpg[/img][img]http://i.imgur.com/MOqhaQa.jpg[/img]\r<br />[img]http://i.imgur.com/tjfWCMG.jpg[/img]\r<br />\r<br />[/size][b][color=#ffff00]What exactly does this mod change?[/color][/b]\r<br />\r<br />Rather than listing every NPC that was changed, you have to believe me that nearly 500 or more have been redesigned in Skyrim. [size=2]Such as Followers, Marriage Candidates, Essentials, Civil War Leaders, Jarls, Farmers, Guild Members, Wizards, ect.[/size]\r<br />\r<br />I am a fan of the Elder Scrolls Lore and this mod makes some characters fit more to the lore and setting of Skyrim.   \r<br />\r<br />There are some faces that might not be to your liking. But remember this is my own interpretation of the characters. And being that there are more than 500 NPCs that were altered, you don&#39;t expect to appease everyone&#39;s certain taste;l try to keep it diverse... you know? So in short, I saw it and I tried to fix it the best of my ability.  I do not do requests for I simply do not have the time these days. But this is a project that I want to share with you, so it is for your own personal use and you can freely do what you please. If you do want to help me out on certain matters to make this mod work better. Please kindly message and and share it with the NEXUS community :D\r<br />[size=4]                  [/size][/center][center][size=4][b][u]Contents\r<br />[/u][/b]Features\r<br />Installation\r<br />Uninstalling\r<br />Licensing/Legal\r<br />Credits/Thanks\r<br />\r<br />[/size][/center][size=6]FEATURES\r<br />[/size]\r<br />[list]\r<br />[*][size=3]Alters NPCs facial morphology and clothing[/size]\r<br />[*][size=3]It removes some of the awkward skin tones, and facial structures of the Vanilla versions. Re-textures NPC&#39;s skin tone, makeup, wrinkles, scars, and dirt[/size]\r<br />[*][size=3]Fixes animation walks for women (Women who walk like Men)[/size] It will only work with NEW games. For whatever reason this flag for using opposite sex animations is saved to your save games.\r<br />[*][size=3]Some NPC&#39;s have been altered and fixed to fit better with the mythos or backstory. For ex. Ysgramor looks more like the statue. Olaf One-Eye is different from his Draugr Counterpart (Different armor and hairstyle) All Stormcloak Jarls wear proper Jarl clothing, ect. [/size]\r<br />[*][font=Trebuchet MS][size=3]Sovngarde adds Nordic Heroes and characters from Lore, current, and previous Elder Scrolls games. [/size][/font]\r<br />[/list][font=Lucida Sans Unicode][size=6]\r<br />INSTALLING[/size]\r<br />[size=3][color=#ff0000]*Side Note[/color]\r<br />   It is important to know that this mod could [/size][/font][size=3]conflict with other mods that  change the same character. It is       recommended to load this last in your mod list[/size][font=Lucida Sans Unicode]\r<br />[/font][b][u]\r<br />   Manual Installation[/u][/b][font=Lucida Sans Unicode][list=1]\r<br />1. First, install the required files by following the instructions on the download page. \r<br />2. Extract the files to a temporary location.\r<br />3. Copy/paste all the files into your Skyrim data folder. Normaly: Steam/SteamApps/common/Skyrim/Data\r<br />4. Launch Skyrim and before you click on &#34;Play&#34; click on &#34;Data Files&#34; and make sure that the plug-in is checked and move it to the bottom of the list.\r<br />5. Play the game.\r<br />\r<br />[color=#ff0000]*Important Note [/color][color=#ffff00]it is recommended to &#34;wait&#34; or play several hours in order for the NPCs to change clothes, otherwise you might encounter a rare random NPC&#39;s walking naked.  If they still do not wear their clothing as intended, go to console by clicking &#34;~&#34; and then click on the  NPC and type disable. Then enable again.  [/color]\r<br />\r<br />[b][u]With NMM\r<br />[/u][/b]For Nexus Mod Manager simply click the “Download with Manager” button and activate the mod to initialize the installer. Make sure to move it at the bottom of the load order or below other mods like UFO.\r<br />[/list][/font]\r<br />[size=6]UNINSTALLING[font=Lucida Sans Unicode]\r<br />[/font][/size]\r<br />[b][u]   Manual Uninstall[/u][/b]\r<br />   1. Start Skyrim Launcher, click Data Files and uncheck the associated .esp files\r<br />   2. Delete all the files from your Skyrim data folder. \r<br />\r<br />[b][u]   Uninstall with NMM[/u][/b]\r<br />   1. Simply open NMM and double click on the mod to uninstall.\r<br />   2. The same applies if you want to uninstall the required files. \r<br />\r<br />[size=6]\r<br />MODS USED IN SCREENSHOTS[/size]\r<br />\r<br />If you want the NPCs to look like the ones in the screenshots you will need to download and install the following mods. These mods are [b][u]NOT[/u][/b] required but very much recommended. You could could use other mods that alter skin, body, and hair. \r<br />\r<br />[size=3][url=http://www.nexusmods.com/skyrim/mods/25588/?]Women of Skyrim female face textures[/url]\r<br />   [/size][url=http://www.nexusmods.com/skyrim/download/1000155528][color=#ffffff]-[/color][size=3]WOS Less Makeup Version[/size][/url][size=3]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36510/?]Superior Lore-Friendly Hair - HD textures[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/36510/?]   [/url]-[url=http://www.nexusmods.com/skyrim/download/1000032567]SLF-Hair Less Saturated texture - HD 2K - For Straight Version[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/2666]Calientes Beautiful Bodies Edition -CBBE-[/url]  \r<br />[url=http://www.nexusmods.com/skyrim/mods/498]High Quality Eyes[/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/30411]Brows[/url] and [url=http://www.nexusmods.com/skyrim/mods/28363]Beards[/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/4784]High Resolution Scars[/url] \r<br />[url=http://www.nexusmods.com/skyrim/mods/2488]YoungerFacesMergedWithMenByGeonox[/url] \r<br />[/size][url=http://www.nexusmods.com/skyrim/download/18933][size=3]coverkhajiits female version\r<br />[/size][/url][size=3][url=http://www.nexusmods.com/skyrim/download/18932]coverkhajiits male version\r<br />[/url][url=http://www.nexusmods.com/skyrim/download/1000169430]Autoinstaller for RealVision ENB v279b[/url][/size]\r<br />\r<br />\r<br />[size=6]FAQ\r<br />[/size][color=#ffff00][b]Q:[/b] How come this mod was deleted on Nexus for a long time?\r<br />[/color]A: Well to be quite honest, I deleted the mod in order to revamp and update it. However, my computer crashed and it caused me to lose everything. Didn&#39;t want to start all over again, and was busy with life and other personal matters, so I never came around to it. But I was determined to eventually redo everything from scratch. \r<br />\r<br />[color=#ffff00][b]Q:[/b] A lot of NPCs appear to be pale. [/color]\r<br />[b]A:[/b] If you are using another mod that changes the NPCs in any way those NPCs will be overwritten to their original look. It is highly recommended to load this last to avoid this issue.\r<br />\r<br />[color=#ffff00][b]Q:[/b] A lot of NPCs  don&#39;t have that cool armor in that screenshot...what gives?[/color]\r<br />[size=2][b]A:[/b] I did alter some NPC&#39;s clothing but using only Vanilla Based Assets.[/size] These mods replace the clothing and armors for NPCs, such as [size=3][url=http://www.nexusmods.com/skyrim/download/1000156922]WARZONES 2015.2 - Civil Unrest[/url] [/size]and [url=http://www.nexusmods.com/skyrim/download/1000100490][size=3]Immersive Armors  [/size]\r<br />[/url]    \r<br />[color=#ffff00][b]Q:[/b] I experience CTDs when I installed this. [/color]\r<br />[b][size=2]A: This is a massive mod, so make sure your PC can handle it.[/size] Or[/b] try uninstalling other mods to find the incompatibility. If you are experiencing major lags or eternal loading screens then I would suggest to get [size=3][b] [/b][/size][url=http://www.nexusmods.com/skyrim/download/1000054383]ENBoost 5_0[/url] [size=3]and [/size][url=http://www.nexusmods.com/skyrim/download/1000093611]SSME - Skyrim Startup Memory Editor[/url][size=3]\r<br />[/size][size=2]for these might help with your problem. Or it could be that you are missing a required mod. But this mod does NOT require any mods. [/size]\r<br />\r<br />[color=#ffff00][b]Q:[/b] I really like some of your NPCs but I dislike some of the looks you have chosen for other NPCs. [/color]\r<br />[b]A:[/b] “Beauty itself is but the sensible image of the infinite,&#34; I made this mod for my own personal taste, everyone has their own interpretation of aesthetic beauty.Also it is rather difficult to make everyone attractive and keep it diverse. So I’m sorry you dislike some of the NPCs but I am not going to change them. \r<br />\r<br />[color=#ffff00][b]Q:[/b] Is this mod compatible with Ethereal Elven Overhaol (EEO)?[/color]\r<br />[b]A:[/b] Since both mods are changing elf NPCs they will directly conflict. Depending on the load order one mod will overwrite the other. But I am currently making it compatible at the moment. \r<br />\r<br />[b][color=#ffff00]Q: How is this mod any different to IoS (Inhabitants of Skyrim)? [/color]\r<br />[/b]A: In a lot of ways, both mods modify NPCs to be more attractive. IoS tries to keep the &#34;essence&#34; of the NPC&#39;s vanilla look, with the option of adding the Apachi Hair option. This mod however, tries to change some NPCs completely but keeps it Vanilla Friendly hair. When it comes down to it, it is more to your personal preference. \r<br />\r<br />[b][color=#ffff00]Q: Are you going to implement Apachi Hairstyles and EEO?[/color]\r<br />A: Despite me loving Apachi Hairstyles for my own characters, marriage candidates or followers, I feel like it should not be applied to every NPC, as some hairstyles make NPCs look like glamorous supermodels rather than believable characters. Which destroys the purpose of having a vanilla and lore friendly mod. Like how can a old farmer have some kind of anime like hair? Also it doesn&#39;t work well with NPCs who wear helmets (baldness issue). EEO is on the works however. [/b]\r<br />\r<br />[b][color=#ffff00]Q:[/color][/b][color=#ffff00] I thought this only changes NPCs not adding new ones...what NPCs were added?[/color]\r<br />A: Well like I mentioned above, small improvements to make the NPCs consistent with the story-line or Lore. But. this in turn made me add new NPCs in the game but only in Sovngarde. For Ex.You the player will discover a Dead Corpse in the Imperial Fort, Ralof will say, &#34;We will meet again in Sovngarde, brother.&#34; But he is no where to be found. Also,  Lilija Snow-Shod was mentioned to be killed in the Civil War but was never shown in Sovngarde. I want you to discover what is hidden in Sovngarde, nord characters you probably met in previous titles, but wondered why they are not there.\r<br />\r<br />[color=#ffff00][b]Q:[/b] This mod is not lore-friendly and I don’t like it.[/color]\r<br />[b]A:[/b] I&#39;m sorry to hear about that. :C But everyone is entitled to their own opinion. It is rather difficult to fit to everyone&#39;s taste. \r<br />[size=6]\r<br />LEGAL\r<br />[/size]\r<br />If you want to use this mod for your own personal use, go right ahead. Just send me a message or an e-mail to let me know that you like my mod. A link to this page will also be appreciated. \r<br />\r<br />Credits/Thanks\r<br />[size=2]I want to thank personally to all these modders to make this mod possible, and helping with making the screenshots look gorgeous. [/size]\r<br />\r<br />Skyrim by Bethesda\r<br />Immersive Armor by Hothtrooper44\r<br />Women of Skyrim female face textures by zzjay\r<br />Ethereal Elven Overhaul by nuskaSuperior \r<br />Lore-Friendly Hair - HD textures by skyrimaguas\r<br />Rise of the legend - Ysgramor by NewerMind43",
  "categoryId": "33",
  "version": "1.1",
  "author": "koryotiger",
  "createdUnix": "1477646901",
  "updatedUnix": "1512039099",
  "containsAdultContent": false,
  "uploadedBy": "egpants",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000225889",
      "name": "Other NPCs",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "201023",
      "fileName": "Other NPCs-68238-.rar",
      "uploadedUnix": "1477646584",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/adb7378a6a258dd1cf0db7e0e202b42a3d0f1ed7acca6ceba6b29f1c859b45c8/analysis/1477657708/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Other%20NPCs-68238-.rar?fid=1000225889&ttl=1535856615&ri=8192&rs=8192&setec=c1fe294739c912f6fb4015e87a89806b"
    },
    {
      "fileId": "1000225890",
      "name": "Followers",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14845",
      "fileName": "Followers-68238-1-1.rar",
      "uploadedUnix": "1477646676",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/11c11504b0f8628e3f0ff452ff2cd22ed90f8256f3240f7ddc6bf08ef467b31b/analysis/1477646720/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Followers-68238-1-1.rar?fid=1000225890&ttl=1535856615&ri=8192&rs=8192&setec=9f5c04704703905eeac981d12035043c"
    },
    {
      "fileId": "1000260927",
      "name": "Other NPCs",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "201047",
      "fileName": "Other.rar-68238-1-1.rar",
      "uploadedUnix": "1512039099",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ad97281a284cd7665855d2aaef4328b63b6e79d4ca1f87b523d161885d4d1c11/analysis/1512039144/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Other.rar-68238-1-1.rar?fid=1000260927&ttl=1535856616&ri=8192&rs=8192&setec=5beeec89048dab0b1b6378fbfb93d827"
    }
  ]
}