{
  "modId": 68236.0,
  "modName": "Super Powerful Weapons and Armor",
  "summary": "Adds the ingredients and armor to make incredibly powerful weapons that will defeat any enemy in Skyrim or Sparta!",
  "descriptionHtml": "[b][u][color=#00ff00][size=4]Description / Instructions[/size][/color][/u][/b]\n<br />\n<br />For those of you who are having difficulty creating incredibly powerful weapons and armor (or for those of you who simply want to make the process easier), this mod adds all of the ingredients and armor required to forge incredibly powerful ones that will defeat any enemy or boss in Skyrim. You can now scream \"THIS IS SPARTA!!!!!\" and mean it! Detailed instructions for creating super powerful weapons and armor can be found below. If you've downloaded mods with extremely powerful dragons and characters (such as Inferno, envoys of time etc), have a laggy computer or lots of followers these super weapons and armor are a must. \n<br />\n<br />I found that after updating to the latest version of Skyrim I could no longer create super powerful weapons and armor (I think it was patched) but found a way around it by using armor from a couple of mods that use different body slots. By combining and wearing these you can then create incredibly powerful potions to boost your smithing skills. This will also work for other potions such as invisibility or fortify health etc. Please note this is an example only and you can edit the file included to suit your needs (you may use different mods with other pieces of armor but I found this to work the best after installing several hundred mods). Please note that this uses female armors for the UNP body - you may wish to find male armors to suit your character or other armors to suit your body type.\n<br />\n<br />To date I have managed to equip, upgrade and use 15 items to boost alchemy and enchanting potions and 17 items to boost smithing potions simultaneously - using standard body slots you can only use 8 items simultaneously.\n<br />\n<br />[color=#00ff00]Recommended Mods and credits to...[/color]\n<br />Aradia Kato Armor\n<br />Ribbon Armor\n<br />Tania The Hermit Follower\n<br />UNP Pantyhose\n<br />Sweet And Sexy Lingerie\n<br />Left Hand Rings\n<br />[color=#ffff00](at least one of the above mods is necessary - the more you have the stronger your potions, weapons and armor will be)...\n<br />[/color]\n<br />Can I also recommend Longer Lasting Crafting Potions (http://www.nexusmods.com/skyrim/mods/8161/?) by GeeGee or any other mod that increases the duration of potions.\n<br />AddItemMenu by Towawot (http://www.nexusmods.com/skyrim/mods/64905/?)\n<br />Full four item effect Alchemy and Smithing fortify skill on one ring by [b]ClackingKeys (http://www.nexusmods.com/skyrim/mods/38055/?)[/b]\n<br />\n<br />[color=#ffff00][u]Forthcoming Updates for v1.3 [/u][/color](when I have the time)\n<br />Lustmord brooch (from Lustmord Vampire Armor)\n<br />Lustmord Noir Clock (from Lustmord Vampire Armor)\n<br />Maids Apron (from Maids II Deception) (Smithing only)\n<br />\n<br />[color=#fff2cc]IF YOU DON'T HAVE THE PERKS REQUIRED TO UPGRADE YOUR POTIONS AND ARMOR, PLEASE SEE MY OTHER MOD \"Instant Perks\" (details are at the bottom of this page) TO GIVE YOU WHAT YOU NEED. Alternatively there is another version in the files section which adds ALL perks to smithing, enchanting and alchemy. [/color]\n<br />\n<br />[color=#cc4125]IMPORTANT[/color] - you will need to destroy certain items to enable fortify alchemy and fortify smithing in the enchanting table if you don't already have them. You will also need to destroy other items when enchanting your final super powerful weapons at the end of this process, for example to discover fire damage, shock damage etc. You will need to find these items for yourself but they are all over skyrim or can be bought from any vendor. A search on your browser should give you the information you need if you can't find them.\n<br />\n<br />\n<br />[size=3][u][color=#00ff00]Installation[/color][/u]\n<br />[color=#cc4125]Please note you will have to extract the file manually - I don't think it will work with a mod manager.[/color][/size]\n<br />Extract the file into your [u]Skyrim[/u] directory (where you installed Steam - not the data directory as you would with normal mod files). \n<br />Once the file is in the right place, simply open the console by pressing the tilde key (`) and type in the command \"bat SuperWeapons\"\n<br />(don't include the quotation marks). \n<br />\n<br />\n<br />[b][u][color=#00ff00]FILES INCLUDED IN ZIP FILE[/color]\n<br />[/u][/b]\n<br />[i][size=3]SuperWeapons     - adds the following quantities of ingredients and armor...\n<br />\n<br />[color=#dd7e6b][u]Armor Required[/u][/color]\n<br />[/size][/i][color=#ffff00]Alchemy only[/color]\n<br />Daedric Helmet 20\n<br />[color=#ffff00]Smithing Only[/color]\n<br />Daedric Armor 20\n<br />Pantyhose1 20                                (UNP Pantyhose)\n<br />WhiteStockingsT1 20                      (Sweet And Sexy Lingerie)\n<br />Tania's Bag 20                                (Tania The Hermit Follower)\n<br />[color=#ffff00]Smithing and Alchemy together[/color]\n<br />Daedric Gaunlets 20\n<br />Flowergirls Light Bangles 20\n<br />Gold Diamond Necklace 20\n<br />Gold Sapphire Ring 20\n<br />Kato Armstraps 20                          (Aradia Kato Outfit)\n<br />Kato Boots 20                                 (Aradia Kato Outfit)\n<br />Kato Bra 20                                    (Aradia Kato Outfit)\n<br />Kato Corset 20                               (Aradia Kato Outfit)\n<br />Kato Legwarmers 20                       (Aradia Kato Outfit)\n<br />Kato Skirt 20                                  (Aradia Kato Outfit)\n<br />Ribbon Armor Nails 20                    (Ribbon Armor)\n<br />Gold Diamond Ring (Left) 20           (Left Hand Rings)\n<br />Dummy Ring 20                              (Tania The Hermit Follower)\n<br />\n<br />[i][color=#dd7e6b][size=3][u]Alchemy Ingredients Required[/u][/size][/color][/i]\n<br />[color=#ffff00]Fortify Enchanting[/color]\n<br />Blue Butterfly Wing 15\n<br />Hargraven Claw 15\n<br />Snowberries 15\n<br />[color=#ffff00]Fortify Restoration[/color]\n<br />Abecean Longfin 20\n<br />Cyrodilic Spadetail 20\n<br />[color=#ffff00]Fortify Smithing[/color]\n<br />Blisterwort 100\n<br />Glowing Mushroom 100\n<br />\n<br />[i][color=#dd7e6b][size=3][u]Enchanting Ingredients Required[/u][/size][/color][/i]\n<br />Black soul gems 1000\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[color=#ffd966][size=4][u]DETAILED INSTRUCTIONS FOR CREATING SUPER POWERFUL WEAPONS AND ARMOR[/u][/size][/color]\n<br />Go to dragonsreach and use the alchemy and enchanting tables - they're better than other tables around Skyrim as you can sell unwanted potions and armor to Farengar to save confusion later. Please note that the strength of your potions will depend on your levels in alchemy, enchanting and smithing, even if you have the required perks. You may want to use the console command several times to add more ingredients to boost your levels. Alternatively you can edit the text file to include the correct amount of ingredients as otherwise you will have too much armor.\n<br />[color=#ff7700]STEP 1 - First potions[/color]\n<br />Go to the alchemy table of your choice and click on \"ingredients\". Combine blue butterfly wing, hargraven claw and snowberries to make a fortify enchanting potion. Combine Acecean Longfin and Cyrodilic Spadetail to create a fortify restoration potion. When you get to step 5 you will need to combine blisterwort and glowing mushroom to make a fortify smithing potion to create your super weapons. Exit the alchemy table.\n<br />\n<br />[color=#93c47d]STEP 2 - Creating more powerful potions[/color]\n<br />Drink a fortify restoration potion and use the alchemy table again. Create another restoration potion and 16 enchanting potions (one for each type of armor you wish to enchant). You may need less if you're using a mod that prolongs potion duration). These potions will now be more powerful than the first ones you created. I have no idea why you use a fortify restoration potion, it just works - this is how bethesda created the original game. Drop or sell the weaker potions to Farengar - you won't need them any more and you will get confused if you have lots of potions of different strengths. I find selling them to be better so you won't have so much clutter.\n<br />[color=#93c47d]STEP 3 - Enchanting your armor[/color]\n<br />Now go to the enchanting table (before using it drink one of your new most powerful enchanting potions). Enchant one Deadric Helmet with fortify alchemy and enchant one of each of the following with fortify alchemy and fortify smithing. You will need a black soul gem for each enchantment and you will need to exit the enchanting table and drink a new fortify enchanting potion for every item you wish to enchant. \n<br />[color=#93c47d]STEP 4 - Equipping your armor[/color]\n<br />Now equip the armor you just created (I find adding them to favourites is the best way but you will need to remove previous weaker armor from the favourites menu each time). Press \"F\" within your inventory to add or remove armor from the favourites menu. You can also add potions to your favourites menu. Go back to step 2 and create even more powerful potions - repeat steps 2 to 4 until your potions are super powerful (I normally find potions at about 400% are good enough for even the most powerful bosses but the choice is yours). Remember to unequip weaker potions and armor each time and equip the stronger ones.\n<br />\n<br />[color=#ff7700]STEP 5 - CREATING YOUR SUPER WEAPONS OR ARMOR[/color]\n<br />Finally use the alchemy table to create as many super powerful fortify smithing potions as you will need (you may wish to create super powerful armor and weapons for your followers as well so the more you have the better). Go to the enchanting table to enchant the daedric armor with fortify smithing (you cannot enchant this armor with alchemy). Go to any forge in Skyrim and create the weapons or armor that you wish to use in your game for fighting your enemies. Any weapon will do, any armor will do - the choice is yours.\n<br />Now drink your most powerful fortify smithing potion, equip your daedric armor and other armors created above (not the daedric helmet as this is for alchemy only) and go to the grindstone and the workbench to improve your items.\n<br />If you're using normal weapons you can then go back to the enchanting table and enchant your armor with powers like fortify archery, fortify two handed etc. If you're using staffs you can enchant your armor with fortify destruction etc. This makes your weapon of choice even more powerful.\n<br />\n<br />[color=#fff2cc]IF YOU DON'T HAVE THE INGREDIENTS REQUIRED TO CREATE THE WEAPONS AND ARMOR YOU WANT, PLEASE SEE MY OTHER MOD \"Instant Smithing\" (details are at the bottom of this page) TO INSTANTLY ADD MOST OF THE THINGS YOU WILL NEED.[/color]\n<br />\n<br />[u][color=#cc4125]If anyone finds or can create armor that uses different body slots please could you leave a message in the comments/posts section and I'll add them to the mod. [b]Are there any modders out there who would be prepared to make a single set of armor/clothing that use all of the body slots? Please could you contact me?[/b][/color][/u]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[color=#00ff00][size=5][u]IMPORTANT MESSAGE!!![/u][/size][/color]\n<br />This mod is dependant upon the other armor mods you have installed. You can edit the text file to add whatever armor you wish - this version works for me and only for those people who have aradia kato armor and Ribbon armor installed (although you may have to change the ID codes of the armor)! If you use other mods, please edit the text file to suit your needs. [color=#ffff00][size=3]PLEASE DO NOT[/size][/color] message me claiming it doesn't work for you. I've simply set up the framework for you to do this if the vanilla version of Skyrim you're using no longer lets you create powerful weapons and armor. It's a long-winded process to create your weapons and armor - this is how Bethesda created the game, [u]it's not my fault.[/u] You could always make your own weapon and armor mods with super powerful stats if you know how to mod!\n<br />[color=#cc4125][size=3]Once you've installed the mod you can use it again and again if you wish to start a new game or if you have multiple characters or profiles created with mod organizer. [/size][/color]\n<br />\n<br />\n<br />\n<br />[u][color=#00ff00][size=4]Using mod managers[/size][/color][/u]\n<br />If you use profiles with Mod Organizer, don't put them in the profile folder, just the main Skyrim folder. I don't think any mod manager will install this for you - you have to do it manually! If someone knows how to get a mod manager to do this please feel free to edit at will...\n<br />\n<br />[u][color=#ffff00]Compatibility[/color][/u]\n<br />Shouldn't clash with anything as far as I know - these files don't use any resources or scripts and aren't installed like normal mods in the data folder so they shouldn't cause any problems. It should also count as an extra mod you can have without adding to the limit that mod organizer can handle!\n<br />\n<br />[u][color=#ffff00]Incompatibility[/color][/u]\n<br />Lustmord Noir Garter causes potions to become much less effective although Lustmord Noir Cloak and Lustmord Noir Brooch increase potion stats. Even adding the garter to your inventory will cause less effective potions even if you don't enchant them or equip them. \n<br />\n<br />[u][color=#ffff00]Uninstallation[/color][/u]\n<br />Simply delete the files and refrain from using the bat command anymore. Alternatively, delete the files, use the bat command and ponder why it's not working.\n<br />\n<br />Feel free to copy, hack, exploit, edit, reverse engineer, infringe copyright (there are none) upload to other sites, or do whatever else you want with the files, with the exception of charging for them or uploading them to a site that will charge for them. These files are free to anyone and everyone who wants them!\n<br />\n<br />[color=#ffff00]CREDITS[/color]\n<br />Bethesda, Steam, Nexus - you rock!\n<br />Me!!!\n<br />My family for putting up with my computer and gaming addictions! (The wife said why haven't I put the shelves up instead of doing this?) pfffft!\n<br />:D\n<br />\n<br />\n<br />\n<br />[color=#cc4125][size=4]Please see my other mods...[/size][/color]\n<br />[color=#3c78d8]Instant Potions... http://www.nexusmods.com/skyrim/mods/67308/?\n<br />Instant Smithing... http://www.nexusmods.com/skyrim/mods/67304/?\n<br />Instant Shouts... http://www.nexusmods.com/skyrim/mods/67318/?\n<br />Instant Skyrim spells... http://www.nexusmods.com/skyrim/mods/67322/?\n<br />Instant Perks... http://www.nexusmods.com/skyrim/mods/67269/?[/color]\n<br />\n<br />This is my sixth mod so please be patient, support isn't going to be that great. If you can't get them to work, please read the instructions again. It's not too difficult.",
  "categoryId": "40",
  "version": "V1.2",
  "author": "NexusNexus5",
  "createdUnix": "1437959539",
  "updatedUnix": "1438198475",
  "containsAdultContent": false,
  "uploadedBy": "NexusNexus5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000169818",
      "name": "SuperWeapons (No Perks) V1.2",
      "version": "V1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "SuperWeapons (No Perks) V1.2-68236-V1-2.zip",
      "uploadedUnix": "1438198185",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/7671f479b102f6e531eaca64e4338b8116ffb0db5d55a7c70908fe72fc3c3da8/analysis/1438198203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SuperWeapons%20%28No%20Perks%29%20V1.2-68236-V1-2.zip?fid=1000169818&ttl=1535856613&ri=8192&rs=8192&setec=1122162d65161ca524cf574fc96fb82d"
    },
    {
      "fileId": "1000169819",
      "name": "SuperWeapons (Perks Included) V1.2",
      "version": "V1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "SuperWeapons (Perks Included) V1.2-68236-V1-2.zip",
      "uploadedUnix": "1438198475",
      "modVersion": "V1.2",
      "virusScanUrl": "https://www.virustotal.com/file/aa255fa04892849722aca0f3b6c8d0be85389d8348d3931a9d17515296f43c8d/analysis/1438198503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SuperWeapons%20%28Perks%20Included%29%20V1.2-68236-V1-2.zip?fid=1000169819&ttl=1535856613&ri=8192&rs=8192&setec=2bfd8ab7dd871dbb1c70714d43819267"
    }
  ]
}