{
  "modId": 68391.0,
  "modName": "Better Stalhrim Weapons And Armor",
  "summary": "Increases the base damage of Stalhrim Weapons to be slightly better than Dragonbone weapons while adding a frost explosion effect to Stalhrim Arrows upon contact. Increases the overall armor rating of both heavy and light variants of Stalhrim Armor to be slightly better than Daedric and Dragonscale Armors",
  "descriptionHtml": "Increases the base damage for the Stalhrim weapons to make each weapon three damage points higher than the Dragonbone weapons and increases the weapon speed of each weapon while slightly decreasing the weight of the weapons. The Stalhrim Arrow now has a frost explosion on impact and also does two points of more damage than a Dragonbone Arrow. Better Stalhrim also increases the armor rating for both light and heavy armor variants of Stalhrim making the heavy variant five points higher than daedric armor and the light armor variant five points better than dragonscale armor allowing Stalhrim to be the best armor and weapons in the game, because well afterall Stalhrim is enchanted ice so why not make the weapons and armor the best in the game\r<br />\r<br />This is my first armor and weapon mod that I have released to the public I made a new save and ran through the Dragonborn DLC once more and paid a little more attention to the details of the story and thought of creating this mod. Because of the way Stalhrim is described you would think that it would be the best armor and weapon set in the game since it is known to be &#34;enchanted ice&#34; and a lost art that is kept a secret for hundreds of years and you have to complete half a questline to learn how to craft.\r<br />\r<br />Anyways I hope you guys like this I have become really interested in modding and I am learning my way around the Creation Kit let me know if you guys would like to see anything else, and I hope to be making my own custom weapon and armor mods in the future and I am thinking about releasing one of my follower mods that I made for personal use but he is pretty badass and has a cool name that is lore friendly with the Elder Scrolls. Again enjoy&#33;",
  "categoryId": "36",
  "version": "1.0",
  "author": "Vizions",
  "createdUnix": "1438416440",
  "updatedUnix": "1438416440",
  "containsAdultContent": false,
  "uploadedBy": "Vizions",
  "primaryFile": null,
  "files": []
}