{
  "modId": 6839.0,
  "modName": "Salrundel Save Game",
  "summary": "Slender, natural Dark Elf Archer female.",
  "descriptionHtml": "So I\\'ve seen a lot of Nords. A lot of Bretons and Imperials. A few Wood Elves. But very few good Dark Elves. So! I give you Salrundel. An ancient, yet young and supple in appearance \\\"natural\\\" Dunmer woman. Highly skilled with the bow, her marksman skills are not to be trifled with. Gifted with other formidable abilities as well, it\\'s the less known gifts you have to be weary about with this one.  \r\n(You\\'ll find a better glimpse and understanding of her traits with the back story that comes with her download.)\r\n\r\nContinuing with the tradition of making better characters. I\\'ve taken the liberty of making the following improvements to her skillset:\r\nHer Health has been modified from 100 to 175.\r\nHer Magicka is at 120 up from 100.\r\nHer Stamina is at 375 up from 100.\r\n\r\nHer Archery has been modified to 45, with the following perks:\r\nOverdraw 1/5\r\nEagle Eye\r\nCritical Shot 1/3\r\nQuick Shot\r\n\r\nHer Sneak has been modified to 35 and her Speech has been modified to 20.\r\nIn keeping with the \\\"natural\\\" statement I made earlier, she currently has only Imperial Bracers and Boots equipped, with an Imperial Long Bow and Steel Arrows she managed to plunder just before escaping Helgen Keep. In her inventory however, is a set of Imperial Studded armor in case we get any squeemish peeps downloading her, so you can easily cover her up. Maintaining my hate for the Empire, she\\'s also followed Ralof and is ready to head down the road into Riverwood.\r\nI\\'ve gifted her as well with a Thousand gold and various goodies and potions to help you start her adventure. \r\n\r\nAs before, you\\'ll need the same mods I listed in the creation of Cassiah to be able to see Salrundel in all of her sexy glory. You can find a list of those mods here:\r\nhttp://skyrimnexus.com/downloads/file.php?id=6816\r\nJust scroll down and you\\'ll see what you need.\r\nThanks again to all the creators of those awesome mods that allowed me to create yet another lovely character.\r\n\r\nI\\'m still taking requests and am working on a few special ones that I\\'ve been graciously asked to do!\r\nPlease review, comment and if you like. Endorse! I also welcome all feedback to help me improve in areas that I\\'m lacking in.\r\n\r\nThanks again to the mod creators and to Bethesda for making all of this possible!",
  "categoryId": "43",
  "version": "",
  "author": "Me",
  "createdUnix": "1327277018",
  "updatedUnix": "1327277146",
  "containsAdultContent": true,
  "uploadedBy": "Tidewalker117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "22240",
      "name": "Salrundel",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1171",
      "fileName": "Salrundel-6839-1.rar",
      "uploadedUnix": "1327277146",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e2ec66d3f92df1c1de389a692d068002f3af72f7bc3c4e7f0c6f09933c5c9b09/analysis/1406632341/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Salrundel-6839-1.rar?fid=22240&ttl=1535764516&ri=8192&rs=8192&setec=c648ee3b31bae8fddeb9b527d1f2e172"
    }
  ]
}