{
  "modId": 68425.0,
  "modName": "Ordinator - Perks of Skyrim",
  "summary": "Ordinator overhauls the perk trees of Skyrim, replacing them with ~400 new perks to improve the depth and fun of building and playing your character. It accomplishes this in a lightweight, compatible and clean fashion.",
  "descriptionHtml": "[size=4][size=4][color=#cccccc]Skyrim Special Edition version available [url=http://www.nexusmods.com/skyrimspecialedition/mods/1137?]here[/url].[/color][/size][/size]\n<br />\n<br />[url=https://www.patreon.com/EnaiSiaion][img]https://staticdelivery.nexusmods.com/mods/110/images/68425-0-1489347895.png[/img][/url][size=4][color=#dd7777]Support Enai Siaion on Patreon![/color][/size]\n<br />[size=4][color=#7799dd]Discuss this mod on the Posts tab, [url=http://www.reddit.com/r/EnaiRim]/r/EnaiRim[/url] or [url=https://discord.gg/GfYzjPm]the Enairim Discord[/url][/color][/size]\n<br />[size=4][color=#AAAAAA]25/02/2018 Thanks to everyone who donated![/color] [color=#AA7777]♥[/color][/size]\n<br />\n<br />[youtube]PDbfXoFlEXk[/youtube] [youtube]RNI45dNdCaY[/youtube]\n<br />\n<br />[size=5][color=#9999AA]Features[/color][/size]\n<br />\n<br />All perk trees overhauled: over 400 new perks.[/*]\n<br />Enables many new viable character builds.[/*]\n<br />Compatible with almost everything, easily made compatible with the rest.[/*]\n<br />Lightweight scripts, no save bloat.[/*]\n<br />\n<br />[size=5][color=#9999AA]Perk trees[/color][/size]\n<br />\n<br />[size=4][color=#88aa88]Alchemy\n<br />[/color][/size]\n<br />[size=2][b]0 - Alchemy Mastery (2)[/b] - Potions and poisons you make are 20/40% stronger.[/size][/*]\n<br />[size=2][b]20 - Physician[/b] - You may choose a type of beneficial potion: Health, Magicka or Stamina. Potions you mix that restore or fortify the chosen attribute are 50% stronger.[/size][/*]\n<br />[size=2][b]20 - Stimulants[/b] - When you use a beneficial potion or ingredient, you regenerate 2% of your Magicka and Stamina per second for 30 seconds.[/size][/*]\n<br />[size=2][b]30 - Advanced Lab[/b] - You may choose to upgrade one alchemy lab to an Advanced version for 2500 gold. Potions you mix are 25% stronger at an Advanced Lab. Can be \"Disassembled\" by sneaking, allowing you to upgrade another.[/size][/*]\n<br />[size=2][b]30 - Experimenter[/b] - Eating an ingredient reveals all effects.[/size][/*]\n<br />[size=2][b]30 - Poisoner[/b] - Poisons you mix are 1% more powerful per level of Alchemy.[/size][/*]\n<br />[size=2][b]40 - Bottomless Cup[/b] - Poisons applied to weapons last for one additional hit per 10 levels of Alchemy.[/size][/*]\n<br />[size=2][b]40 - Crimson Haze[/b] - Stimulants also increases movement speed by 10% for its duration.[/size][/*]\n<br />[size=2][b]40 - Elemental Oil[/b] - You may choose a power: \"Fire Oil\", \"Frost Oil\" or \"Shock Oil\". At will, create a pool of oil that lasts 20 seconds. It reacts violently when struck by a projectile or explosion, exploding and dealing damage equal to your Alchemy skill level.[/size][/*]\n<br />[size=2][b]50 - Alkahest[/b] - Your poisons are highly corrosive, enabling you to ignore 40% of the armor rating of an affected target for their duration.[/size][/*]\n<br />[size=2][b]50 - Lab Skeever[/b] - For 20 seconds after using any alchemy lab, beneficial potions you drink last 15 times longer and are 25% stronger.[/size][/*]\n<br />[size=2][b]60 - Green Thumb[/b] - Twice as many ingredients are gathered from most harvestable objects.[/size][/*]\n<br />[size=2][b]60 - Maenad[/b] - Magicka and Stamina are increased by 50 points when you are under the effect of a beneficial potion or ingredient, but reduced by 25 points when you are not.[/size][/*]\n<br />[size=2][b]60 - The Alchemist's Cookbook[/b] - You may choose a second Elemental Oil power. In addition to \"Fire Oil\", \"Frost Oil\" and \"Shock Oil\", you may also choose \"Calming Oil\", \"Frenzy Oil\", \"Paralysis Oil\" or \"Hallowed Oil\".[/size][/*]\n<br />[size=2][b]70 - Double Toil and Trouble[/b] - You mix twice as many potions at your Advanced Lab.[/size][/*]\n<br />[size=2][b]70 - Pure Mixture[/b] - All negative effects are removed from created potions, and all positive effects are removed from created poisons.[/size][/*]\n<br />[size=2][b]80 - Amplify Lethality[/b] - Grants the \"Amplify Lethality\" power. Once a day, point at a victim to silently reduce their poison resistance by 250% for 10 seconds.[/size][/*]\n<br />[size=2][b]80 - Witchmaster[/b] - When you use a beneficial potion or ingredient, 50% chance to receive a powerful side effect, randomly chosen from a range of 40 side effects.[/size][/*]\n<br />[size=2][b]90 - Chymical Wedding[/b] - Witchmaster side effects have 50% chance to cause side effects themselves.[/size][/*]\n<br />[size=2][b]90 - Walking Disaster[/b] - In combat, periodically spill a random oil puddle on the ground. Puddles last 60 seconds.[/size][/*]\n<br />[size=2][b]90 - World Serpent[/b] - When you shout, your blood turns poisonous for 15 seconds. The next time you get hit with a weapon, retaliate with a powerful poisonous strike that deals 50 points of poison damage per second for 10 seconds.[/size][/*]\n<br />[size=2][b]100 - That Which Does Not Kill You…[/b] - Upon learning this perk, you imbibe a deadly toxin, taking 150 damage per second. If you survive for 60 seconds, you receive 3 perk points and a permanent 25% bonus to all potions and poisons you make.[/size][/*]\n<br />\n<br />[size=4][color=#8888aa]Alteration\n<br />[/color][/size]\n<br />[size=2][b]0 - Alteration Mastery (2)[/b] - Cast Alteration spells for 35/50% less Magicka, and Alteration spells last 0.5/1% longer per level of Alteration.[/size][/*]\n<br />[size=2][b]20 - Alteration Dual Casting[/b] - Dual casting an Alteration spell empowers it, increasing effectiveness and cost.[/size][/*]\n<br />[size=2][b]20 - Mage Armor (3)[/b] - Protection spells like Stoneflesh are 100/150/200% stronger if not wearing armor.[/size][/*]\n<br />[size=2][b]30 - Geomancer[/b] - If wearing robes and no light or heavy armor, you take 30% less damage from attacks while charging or concentrating on a spell.[/size][/*]\n<br />[size=2][b]30 - Philosopher's Stone[/b] - Once a day, generates gold equal to four times your Alteration skill level.[/size][/*]\n<br />[size=2][b]30 - Vancian Magic[/b] - Cast magic like the wizards of old. Your next 20 spells do not use Magicka and are twice as effective. When you run out of spells, you are unable to cast spells until you rest by sleeping at an inn or in your home.[/size][/*]\n<br />[size=2][b]30 - Wild Shrines[/b] - Five shrines dedicated to nature's mysteries can be found in Skyrim. Each shrine grants a permanent bonus to one school of magic, making all spells from that school 15% more powerful or last 30% longer.[/size][/*]\n<br />[size=2][b]40 - Alter Self: Resistances[/b] - You may choose two resistances to increase by 25%.[/size][/*]\n<br />[size=2][b]40 - Distorted Shape[/b] - When you gain an armor spell in combat (or enter combat with an active armor spell), you become intangible and unable to be affected by spells or attacks for 10 seconds or until you perform an offensive or defensive action.[/size][/*]\n<br />[size=2][b]40 - Spellblade[/b] - Whenever you cast a spell with one hand, you deal 20% more attack damage for 4 seconds.[/size][/*]\n<br />[size=2][b]50 - Command Lock[/b] - Once every 6 ingame hours, you can weaken an Expert or lower lock, reducing its difficulty to zero.[/size][/*]\n<br />[size=2][b]50 - Energy Shield[/b] - If wearing robes and no light or heavy armor, reduces incoming attack and elemental damage by 35% but you lose Magicka equal to the amount of Health lost. The damage reduction gradually diminishes as Magicka falls below half. The energy shield is disabled when your hands are lowered.[/size][/*]\n<br />[size=2][b]50 - Intuitive Magic (2)[/b] - Novice/ and apprentice spells of any school cost 100% less Magicka to cast.[/size][/*]\n<br />[size=2][b]50 - Quadratic Wizard[/b] - Whenever you recharge your Vancian Magic spells, you gain 1 additional Vancian Magic spell for each 10 points of base Magicka.[/size][/*]\n<br />[size=2][b]60 - Alter Self: Attributes[/b] - You may choose an attribute (Health, Magicka, Stamina) to increase by 50 points.[/size][/*]\n<br />[size=2][b]60 - Home Mythal[/b] - Summons a permanent magical field at the location where you learn this perk. Alteration spells gain x2 duration if cast within 5000 feet, and x20 duration if cast within 250 feet. Additionally, Vancian Magic can be recharged by sleeping within 250 feet.[/size][/*]\n<br />[size=2][b]60 - Welloc's Dormant Arcana[/b] - Choose a spell type (Armor, Cloak, Conjure Daedra, Conjure Undead, Invisibility) and 3 magic effects (Fortify, Regenerate, Waterwalking, ...). The chosen magic effects will activate when you are affected by the chosen spell type.[/size][/*]\n<br />[size=2][b]70 - Dungeon Master[/b] - Whenever you recharge your Vancian Magic spells, you may choose less or more spells in exchange for increased or decreased spell effectiveness, and/or choose one of three metamagic enhancements. Your choice remains in effect until your next rest.[/size][/*]\n<br />[size=2][b]70 - Energy Roil[/b] - Whenever you cast a spell with one hand, reduces the armor of nearby enemies within 10 feet by 150 points for 4 seconds.[/size][/*]\n<br />[size=2][b]70 - The Monarch[/b] - You cannot regenerate Magicka and lose 10 points of Magicka per second but absorb 25 points of Magicka per second from living creatures within 20 feet, whether friend or foe.[/size][/*]\n<br />[size=2][b]80 - Aurification[/b] - Once every 12 ingame hours, activate a paralyzed target below half Health to transmute its body into gold worth 100 times its level, killing the target. Has a 50% chance of creating gold ore. No effect on essential targets.[/size][/*]\n<br />[size=2][b]80 - Dimension Door[/b] - Grants the \"Dimension Door\" power. At will, creates a magical doorway that teleports you to the location of your Home Mythal.[/size][/*]\n<br />[size=2][b]80 - Throne of Nirn[/b] - Standing still for 5 seconds while holding a spell summons a pillar of earth under your feet that carries you into the air and out of melee range. While standing on the pillar, your spells are 20% more powerful or last 40% longer. This effect is disabled when your hands are lowered.[/size][/*]\n<br />[size=2][b]90 - Emergency Teleport[/b] - When you fall below 15% Health due to combat damage, you briefly turn invulnerable and teleport back to the location where you entered combat.[/size][/*]\n<br />[size=2][b]90 - Nullifier[/b] - You radiate a dampening field, preventing enemies within 25 feet from regenerating Magicka and Stamina.[/size][/*]\n<br />[size=2][b]90 - Rend Resistances[/b] - Whenever you attack with a weapon, reduces the magic resistance of nearby enemies within 10 feet by 15% for 4 seconds.[/size][/*]\n<br />[size=2][b]100 - Arcane Thesis[/b] - Grants the \"Arcane Thesis\" power: use it to master the spell you are dual casting. A mastered spell is 20% more powerful or lasts 40% longer. Only one spell can be mastered.[/size][/*]\n<br />\n<br />[size=4][color=#aa8888]Archery\n<br />[/color][/size]\n<br />[size=2][b]0 - Archery Mastery (2)[/b] - Bows and crossbows deal 25/50% more damage./, and critical strikes with bows and crossbows do 2% more critical damage per level of Archery.[/size][/*]\n<br />[size=2][b]20 - Clean Kill[/b] - Bows and crossbows deal 20% more damage to a target at full Health.[/size][/*]\n<br />[size=2][b]20 - Wingstrike (2)[/b] - Bashing with a bow or crossbow always staggers the target. Bows and crossbows deal 20/40% more damage to that target for 10 seconds.[/size][/*]\n<br />[size=2][b]30 - Long Shot (3)[/b] - Bows and crossbows deal up to 40/60/80% more damage to targets beyond 50 feet. The damage bonus increases as distance increases.[/size][/*]\n<br />[size=2][b]30 - Steady Hand (3)[/b] - Pressing Block while aiming will zoom in your view/ and slow time by 25/50%.[/size][/*]\n<br />[size=2][b]40 - Crippling Shot[/b] - Arrows and bolts slow a target within 25 feet by 10% for 20 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]40 - Hunter's Discipline[/b] - Recover twice as many arrows and bolts from dead bodies.[/size][/*]\n<br />[size=2][b]40 - Thread the Needle (2)[/b] - Bows and crossbows ignore 25/50% armor if the target is not moving.[/size][/*]\n<br />[size=2][b]50 - Pinning Shot[/b] - Arrows and bolts have a chance to stagger a target within 50 feet. More effective against targets with a lower remaining Health percentage. No effect on massive targets.[/size][/*]\n<br />[size=2][b]50 - Ranger[/b] - Can move at full speed with a drawn bow.[/size][/*]\n<br />[size=2][b]70 - Focus on the Prey[/b] - Cannot be staggered while holding a drawn bow or reloading a crossbow.[/size][/*]\n<br />[size=2][b]60 - Quick Shot[/b] - Can draw a bow or reload a crossbow 30% faster.[/size][/*]\n<br />[size=2][b]60 - Snipe[/b] - Shooting targets you haven't shot within the past 10 seconds inflicts a critical strike that deals three times critical damage, and any weapon enchantments applied by the shot are twice as effective.[/size][/*]\n<br />[size=2][b]70 - Ambush Predator[/b] - After standing still for 6 seconds with a bow or crossbow out, it does 25% more damage until you move.[/size][/*]\n<br />[size=2][b]70 - Beak and Talon[/b] - Your shots disrupt targets within 25 feet, disarming them if they are power attacking and knocking them down if they are staggered.[/size][/*]\n<br />[size=2][b]80 - Hailstorm[/b] - Attack 8% faster with bows and crossbows for 10 seconds after shooting a fully drawn bow or crossbow in combat. This effect stacks.[/size][/*]\n<br />[size=2][b]80 - Hawkeye[/b] - Grants the \"Hawkeye\" power. Once a day, slow time and focus on your foes for 10 seconds, looking for opportunities for a killing shot. Finding their vulnerability takes 1 second per 125 Health. Once you do, you may shoot them for an instant kill.[/size][/*]\n<br />[size=2][b]80 - Trick Arrows[/b] - Able to upgrade many types of arrows at a forge or anvil, adding a bonus effect (Force, Immolation, Freezing, Grounding, Maze or Death) based on its material.[/size][/*]\n<br />[size=2][b]90 - Hunt Together[/b] - When fighting only one enemy, hitting the target with a bow or crossbow manifests a Spirit Wolf for 30 seconds. The wolf deals damage equal to 15% of your current Stamina. This effect has a 30 second cooldown per target.[/size][/*]\n<br />[size=2][b]90 - Lion's Arrow[/b] - Grants the \"Lion's Arrow\" power: use it to store the spell you are dual casting. Shooting a fully drawn bow in combat also releases the stored spell in the direction of the crosshair. Only works with spells that affect other targets.[/size][/*]\n<br />[size=2][b]90 - Three Crows[/b] - Shooting a target beyond 25 feet three times in rapid succession, leaving less than 2.75 seconds between each hit, deals bonus damage equal to 15% of the target's current Health (max. 150 damage) and knocks the target to the ground.[/size][/*]\n<br />[size=2][b]100 - Perfect Aim[/b] - Bows deal 25% more damage if the shot strikes a target within 2 seconds after the bow is fully drawn. Crossbows deal triple damage to targets with 20% or less Health remaining.[/size][/*]\n<br />\n<br />[size=4][color=#aa8888]Block\n<br />[/color][/size]\n<br />[size=2][b]0 - Block Mastery (2)[/b] - Block 10/20% more damage.[/size][/*]\n<br />[size=2][b]20 - Timed Block (2)[/b] - Assume a defensive position for 1 second after raising your shield or weapon, blocking 30% more damage and staggering attackers in melee range. (If you do not block an attack during this time, you cannot attempt another Timed Block for 2 seconds/1 second.)[/size][/*]\n<br />[size=2][b]30 - Deflect Arrows[/b] - While blocking with a shield or weapon, arrows do half damage. Arrows that hit the shield do no damage.[/size][/*]\n<br />[size=2][b]30 - Poke the Dragon[/b] - After a successful Timed Block within 8 feet, you may retaliate with increased strength, increasing your attack damage and critical strike damage against the attacker by 25% for 5 seconds.[/size][/*]\n<br />[size=2][b]40 - Apocalypse Proof (2)[/b] - Perform a Timed Block to mitigate incoming fire, frost and shock spells and effects, reducing their damage by 50%/to zero.[/size][/*]\n<br />[size=2][b]40 - Power Bash[/b] - Able to do a power bash by holding down Attack while blocking.[/size][/*]\n<br />[size=2][b]40 - Quick Reflexes[/b] - Time slows down if you are blocking during an enemy's power attack.[/size][/*]\n<br />[size=2][b]50 - Dominion[/b] - Take 25% less attack damage from any direction when blocking in combat.[/size][/*]\n<br />[size=2][b]50 - Skull Rattler[/b] - Bashing deals 3% more damage per point of Stamina.[/size][/*]\n<br />[size=2][b]60 - Dragon Tail[/b] - After a successful Timed Block, bashing the attacker within 5 seconds deals double damage.[/size][/*]\n<br />[size=2][b]60 - Timing Streak[/b] - Performing 3 successful Timed Blocks in a row completes a Timing Streak, restoring 75 points of Stamina. (Taking an unblocked attack or blocking an attack outside the timed block window breaks the combo.)[/size][/*]\n<br />[size=2][b]70 - Block Runner[/b] - Can move at full speed while blocking.[/size][/*]\n<br />[size=2][b]70 - Mocking Blow[/b] - Power bashing with a weapon infuriates living targets for 30 seconds. They won't flee from combat but can't regenerate Stamina, lose 15 points of Stamina per second and you take no damage from their attacks during a Timed Block.[/size][/*]\n<br />[size=2][b]80 - Break Their Teeth[/b] - Completing a Timing Streak violently disarms the last attacker, staggering all within an 8 foot radius.[/size][/*]\n<br />[size=2][b]80 - Cast Aside[/b] - Interrupting an attack with a power bash with a shield knocks the attacker to the ground. Targets can only be affected once every 30 seconds.[/size][/*]\n<br />[size=2][b]90 - Deliverance[/b] - Completing a Timing Streak grants 10% extra attack damage for 90 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]90 - Hold the Line[/b] - During a Timed Block, allies within 10 feet gain 250 points of armor rating.[/size][/*]\n<br />[size=2][b]90 - Unstoppable Force[/b] - Able to sprint with a shield raised. This knocks enemies in your path to the ground, but costs 10 points of Stamina per second. Enemies can only be affected once every 10 seconds.[/size][/*]\n<br />[size=2][b]100 - Dragon Scales[/b] - You take no damage from attacks during a Timed Block as long as you have Stamina remaining.[/size][/*]\n<br />\n<br />[size=4][color=#8888aa]Conjuration\n<br />[/color][/size]\n<br />[size=2][b]0 - Conjuration Mastery (2)[/b] - Cast Conjuration spells for 35/50% less Magicka, and Conjuration spells last 0.5/1% longer per level of Conjuration.[/size][/*]\n<br />[size=2][b]20 - Bone Collector[/b] - Find 11 types of bones on humanoid corpses. 4 Bone Altars are marked on the map. At a Bone Altar, convert 1 of each bone into a Skeleton Warrior. Skeletons do not count against your summon limit. Enemies can only temporarily defeat them, not destroy them.[/size][/*]\n<br />[size=2][b]20 - Conjuration Dual Casting[/b] - Dual casting a Conjuration spell empowers it, increasing effectiveness and cost.[/size][/*]\n<br />[size=2][b]20 - Mystic Binding[/b] - Bound Weapon spells now summon Mystic Weapons which deal more damage.[/size][/*]\n<br />[size=2][b]30 - Dead Tide (2)[/b] - Maximum number of Skeletons increased by 1 for each 75/50 points of base Magicka.[/size][/*]\n<br />[size=2][b]30 - Planemeld[/b] - Able to summon Daedra and other non-undead minions five times farther away.[/size][/*]\n<br />[size=2][b]30 - Ravenous Dead[/b] - Reanimated minions receive a brief burst of strength, dealing 200% extra attack damage for 15 seconds after being reanimated. The level cap of reanimation spells and effects is increased by 1% per level of Conjuration.[/size][/*]\n<br />[size=2][b]30 - Soul Raider[/b] - Bound weapons cast Soul Trap on targets for 5 seconds. After trapping 250 souls, all bound weapon perks last twice as long.[/size][/*]\n<br />[size=2][b]40 - Atromancy[/b] - Summoned Daedra and other non-undead minions last three times as long (or five times at night).[/size][/*]\n<br />[size=2][b]40 - Barrow Lord[/b] - You may give commands to all Skeletons within 150 feet at once, instead of one at a time. Skeletons take 25% less damage from attacks.[/size][/*]\n<br />[size=2][b]40 - Preservation[/b] - Summoned and reanimated undead last three times as long (or twenty times if you place Hagraven Feathers into their inventory or use the Dread Zombie or Dead Thrall spells). Reanimated undead also gain 500 armor for 60 seconds after being reanimated.[/size][/*]\n<br />[size=2][b]40 - Rat King[/b] - When entering combat, creates 3 undead Skeevers under your control. Their corpses can be raised, but they dissipate when combat ends. Use the \"Merciful King\" power to temporarily prevent this ability from activating.[/size][/*]\n<br />[size=2][b]40 - Reap and Sow (2)[/b] - You loot 60/100% more bones from corpses and recover 50% more/all bones when you destroy a created Skeleton. Created Skeletons last 75/200% longer.[/size][/*]\n<br />[size=2][b]40 - Rend From This World[/b] - Bound weapons banish conjured Daedra, turn reanimated undead and deal 100 extra damage to non-conjured Daedra.[/size][/*]\n<br />[size=2][b]40 - Signed in Blood[/b] - When a friendly conjured Daedra within 15 feet is below full Health, it absorbs your lifeforce to heal itself, preventing you from regenerating Health but regenerating 10 points per second (increased by 4% of its maximum Health when out of combat).[/size][/*]\n<br />[size=2][b]50 - Edge of Oblivion[/b] - You can summon or reanimate 1 additional minion and they last 50% longer. When you do not command a summon or reanimated minion, you lose 250 points of armor and 50% magic resistance.[/size][/*]\n<br />[size=2][b]50 - Pact Magic[/b] - Destruction spells and effects are 10% more effective for each friendly conjured Daedra within 30 feet.[/size][/*]\n<br />[size=2][b]50 - Skeleton Mages (2)[/b] - Able to create Skeleton Mages (Fire, Frost, Shock/, Poison, Drain Armor, Stagger) at a Bone Altar. /You may choose their element at the time of creation.[/size][/*]\n<br />[size=2][b]50 - Undead Crown[/b] - Restores 10 points of Health and Magicka per second to summoned or reanimated undead within 15 feet.[/size][/*]\n<br />[size=2][b]50 - Void Burn[/b] - Bound weapons brand victims with unholy energy for 5 seconds, halting Magicka and Stamina regeneration while draining 15 points per second. When both are depleted, the energy starts devouring their flesh, dealing 15 points of magic damage per second.[/size][/*]\n<br />[size=2][b]60 - A Plague Upon Thee[/b] - If a reanimated undead is destroyed within 20 seconds, the attacker is stricken with a Daedric disease that deals 40 damage per second for 20 seconds. Those who have this perk are immune.[/size][/*]\n<br />[size=2][b]60 - Conjure Altar[/b] - Grants the \"Conjure Altar\" power. At will, summons a Bone Altar for 60 seconds.[/size][/*]\n<br />[size=2][b]60 - Fire Ritual[/b] - Able to ritually burn 1 of each bone at a Bone Altar, strengthening all Skeletons within 150 feet. Lasts until the Skeleton is destroyed and increases weapon damage by 15%, spell damage by 30% and Health by 50 points. This effect stacks.[/size][/*]\n<br />[size=2][b]60 - Hollow Binding[/b] - Bound weapons cut through flesh and spirit, reducing magic resistance by 30% for 5 seconds.[/size][/*]\n<br />[size=2][b]60 - Maelstrom[/b] - While you charge or concentrate on a spell, friendly conjured Daedra within 30 feet gain 30% extra attack damage.[/size][/*]\n<br />[size=2][b]70 - Corpse Gas[/b] - If your reanimated undead is destroyed while on fire within 30 seconds, it explodes, dealing up to 300 points of fire damage to targets without this perk. You deal five times as much fire damage to your reanimated undead.[/size][/*]\n<br />[size=2][b]70 - Dark Whispers[/b] - Bound weapons induce a battle rage in their wielder, granting 20% extra attack damage and 100 points of armor rating for 5 seconds when a target is struck.[/size][/*]\n<br />[size=2][b]70 - Elemental Potency[/b] - Atronach conjurations now call Potent Atronachs that are higher level and more powerful.[/size][/*]\n<br />[size=2][b]80 - Brand of the Necromancer[/b] - Brand a corpse by striking it with a bound weapon or by delivering the killing blow with a bound weapon attack. The brand grants 25% attack damage and 100 points of Health when reanimated or resurrected. Undead and automatons cannot be branded.[/size][/*]\n<br />[size=2][b]80 - Feed the Monster[/b] - Able to feed Human Flesh to summoned or reanimated creatures, healing them and increasing Health, Magicka and Stamina by 200 points for 600 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]80 - Necromaster[/b] - Grants finer control over creatures reanimated with powerful reanimation spells (Dread Zombie, Dead Thrall). Able to manipulate their inventory and equip items (if they are humanoid) and they emit a glow when slain that can be seen through walls. The level cap of those spells is also increased by 100%.[/size][/*]\n<br />[size=2][b]80 - Unleash Hell[/b] - Conjured Daedra within 75 feet gain additional spells on a 30 second cooldown (Flame Atronach: fire explosion. Frost Atronach: reduced armor/magic resistance curse. Storm Atronach: magnetic knockdown. Dremora: increased attack damage and movement speed).[/size][/*]\n<br />[size=2][b]90 - Covenant of Coldharbour[/b] - Hollow Binding reduces magic resistance by an additional 30% if you control a summoned Daedra or other non-undead minion.[/size][/*]\n<br />[size=2][b]90 - Puppet Master[/b] - Your created Skeletons take 25% less damage when you are blocking, deal 25% more attack damage when you are attacking, and their spells are 25% more powerful when you are casting a spell.[/size][/*]\n<br />[size=2][b]90 - Shocked to Life[/b] - If your reanimated minion is struck by a shock spell within 30 seconds after reanimation completes, it attacks 250% faster and moves 50% faster for 10 seconds. You deal no damage to your reanimated minions with shock spells.[/size][/*]\n<br />[size=2][b]90 - Summon Resist[/b] - Friendly conjured Daedra and other non-undead minions within 75 feet gain 50% magic resistance and 300 points of armor.[/size][/*]\n<br />[size=2][b]100 - King of Bones[/b] - Assume Control of a Skeleton while becoming invulnerable. The Skeleton does quadruple damage and takes half damage. Unless commanded to remain passive, it automatically attacks foes in range. Lasts up to 45 seconds.[/size][/*]\n<br />[size=2][b]100 - March of Oblivion[/b] - You can summon or reanimate 1 additional minion per 250 points of base Magicka, up to 3 additional minions.[/size][/*]\n<br />\n<br />[size=4][color=#8888aa]Destruction\n<br />[/color][/size]\n<br />[size=2][b]0 - Destruction Mastery (2)[/b] - Destruction spells cost 35/50% less Magicka, and Destruction spells are 0.25/0.5% more powerful per level of Destruction.[/size][/*]\n<br />[size=2][b]20 - Combustion (2)[/b] - Fire spells and effects cast on others are up to 20/30% more powerful, based on the target's missing Health percentage.[/size][/*]\n<br />[size=2][b]20 - Destruction Dual Casting[/b] - Dual casting a Destruction spell empowers it, increasing effectiveness and cost.[/size][/*]\n<br />[size=2][b]20 - Ionized Path (2)[/b] - Shock spells and effects cast on others are up to 20/30% more powerful, based on the target's missing Magicka percentage.[/size][/*]\n<br />[size=2][b]20 - Merciless Cold (2)[/b] - Frost spells and effects cast on others are up to 20/30% more powerful, based on the target's missing Stamina percentage.[/size][/*]\n<br />[size=2][b]30 - Force of Nature[/b] - Elemental spells and effects cost 30% less Magicka to cast in favorable weather: fire spells in sunlight, frost spells during snowfall, shock spells in the rain.[/size][/*]\n<br />[size=2][b]30 - Frostfall[/b] - Frost spells reduce the attack damage of their targets by 25% for 5 seconds.[/size][/*]\n<br />[size=2][b]30 - Scarring Burns[/b] - Fire spells reduce the fire resistance of their targets by 20% for 5 seconds.[/size][/*]\n<br />[size=2][b]30 - Static Field[/b] - Shock spells that would leave their target above 75% Health deal enough additional damage to make up the difference.[/size][/*]\n<br />[size=2][b]40 - Arc Burn[/b] - Shock spells hitting targets that are not fire resistant cause a plasma that deals 5 points of unresistable fire damage per second for 4 seconds.[/size][/*]\n<br />[size=2][b]40 - Conflagration[/b] - Fire spells ignite the ground underneath their targets for 30 seconds. The burning ground deals 8 points of damage per second for 3 seconds on contact.[/size][/*]\n<br />[size=2][b]40 - Crystalize[/b] - Frost spells freeze the blood of their targets, halting Stamina regeneration for 5 seconds. If the targets are not resistant to frost, frost spells also reduce armor by 125 points for 5 seconds.[/size][/*]\n<br />[size=2][b]40 - Harsh Lesson[/b] - Destruction projectile spells interrupt targets that are casting a spell. Does not work on massive targets.[/size][/*]\n<br />[size=2][b]40 - Runecaster[/b] - Can place runes 75 feet farther away, and place three times as many runes at a time.[/size][/*]\n<br />[size=2][b]50 - Flash Fire[/b] - Fire spells have 15% chance to ignite the target for 2 seconds. The next instance of fire damage that hits an ignited target (except burning ground) detonates, dealing 100% more damage and causing a living target to flee the flames for 4 seconds.[/size][/*]\n<br />[size=2][b]50 - Magnetize[/b] - Shock spells have 15% chance to lift the target into the air for 2 seconds, preventing movement.[/size][/*]\n<br />[size=2][b]50 - Robe of the Magi[/b] - If wearing robes and no light or heavy armor, Destruction spells are 30% more powerful.[/size][/*]\n<br />[size=2][b]50 - Shatter[/b] - Frost spells that hit a frost resistant target fragment and explode in a 15 foot area, reducing frost resistance by 25% for 10 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]60 - Iced Earth[/b] - Dual casting frost spells freezes the earth under your feet. The frozen ground deals 40 points of damage per second to Health and Stamina for 4 seconds on contact. Frost spells and effects are 50% more powerful against affected targets.[/size][/*]\n<br />[size=2][b]60 - Nova Charge[/b] - Dual casting 6 shock spells in combat triggers a shock nova that deals 200 points of shock damage to nearby enemies and staggers them. This can only occur once per battle.[/size][/*]\n<br />[size=2][b]60 - Pyromancer Ascension[/b] - Dual casting 6 fire spells in combat unleashes your power for 20 seconds: fire spells and effects are 50% more powerful and cost half Magicka, and you leave burning ground in your wake that deals 30 damage per second. This can only occur once per battle.[/size][/*]\n<br />[size=2][b]70 - Ancient Seals[/b] - Destruction runes no longer deal instant damage, but inflict a stacking 10 second elemental burn that deals 15% damage per second.[/size][/*]\n<br />[size=2][b]70 - Electroconvulsions[/b] - Shock spells incapacitate living targets below 25% Health if they are not shock resistant.[/size][/*]\n<br />[size=2][b]70 - Hypothermia[/b] - Frost spells paralyze living targets below 25% Health if they are not frost resistant.[/size][/*]\n<br />[size=2][b]70 - Scorched Earth[/b] - Fire spells (except concentration spells) burn corpses to cinders, creating a pyre that burns for 30 seconds. The burning ground deals 50 points of damage per second for 5 seconds on contact.[/size][/*]\n<br />[size=2][b]70 - War of the Elements[/b] - You deal 40% more attack damage to targets that are taking damage from the burning ground created by Conflagration, Scorched Earth or Pyromancer Ascension or are being affected by Electroconvulsions or Hypothermia.[/size][/*]\n<br />[size=2][b]80 - Elemental Specialization[/b] - You may choose one element (fire, frost, shock). Spells and effects of that element are 15% more powerful, while spells and effects of the other two elements are 15% weaker.[/size][/*]\n<br />[size=2][b]80 - Exhaust[/b] - Frost spells and effects drain 50% more Stamina.[/size][/*]\n<br />[size=2][b]80 - Show Them All[/b] - Shock spells and effects drain 50% more Magicka.[/size][/*]\n<br />[size=2][b]80 - World in Flames[/b] - The burning ground created by Conflagration, Scorched Earth and Pyromancer Ascension deals 25% more damage. Additionally, other fire spells and effects are 25% more powerful against targets affected by burning ground.[/size][/*]\n<br />[size=2][b]90 - Outburst[/b] - When you fall below 75 points of Health, the fiery energy within you explodes and ignites nearby enemies, dealing 30 points of fire damage per second for 4 seconds and applying fire spell perks. This effect has a 180 second cooldown.[/size][/*]\n<br />[size=2][b]90 - Stormblast[/b] - You accumulate static energy from the ambient air. Every 6-12 seconds in combat, your next shock spell triggers a ground discharge that radiates outward from the target. All enemies in the area take 60 points of shock damage to Health and Magicka.[/size][/*]\n<br />[size=2][b]90 - Winter's Majesty[/b] - You radiate freezing cold, reducing the frost resistance of enemies within 25 feet by 50%. This penalty is applied on top of Shatter.[/size][/*]\n<br />[size=2][b]100 - Absolute Power[/b] - Aiming a Sparks, Lightning Bolt, Chain Lightning, Thunderbolt or Lightning Storm spell directly at a target will magnetically levitate them in front of you for 6 seconds, reducing magic resistance by 25%. This effect has a 45 second cooldown.[/size][/*]\n<br />[size=2][b]100 - Cataclysm[/b] - Fire spells that hit targets affected by burning ground explode for 20% of their current Health (max. 250 damage), blasting them into the air and reducing magic resistance by 25% for 6 seconds. This effect has a 45 second cooldown.[/size][/*]\n<br />[size=2][b]100 - Glacial Prison[/b] - Frost spells immobilize (non-essential) targets in a block of ice for 6 seconds, reducing magic resistance by 25%. This effect has a 120 second cooldown, but killing a victim affected by Glacial Prison or Hypothermia immediately ends the cooldown.[/size][/*]\n<br />\n<br />[size=4][color=#8888aa]Enchanting\n<br />[/color][/size]\n<br />[size=2][b]0 - Enchanting Mastery (2)[/b] - New enchantments are 20/40% stronger. Soul gems provide 2/4 extra weapon charge points per level of Enchanting.[/size][/*]\n<br />[size=2][b]20 - Last Word (3)[/b] - Scrolls are 2/4/6% more powerful or last 4/8/12% longer per level of Enchanting.[/size][/*]\n<br />[size=2][b]20 - Soul Siphon[/b] - Death blows with enchanted weapons to creatures, but not people, trap 5% of the victim's soul, recharging the weapon. Does not apply to staves.[/size][/*]\n<br />[size=2][b]30 - Staff Channeler[/b] - When a staff is equipped, all weapon enchantments drain 25% less charge and you gain a small amount of Enchanting experience in combat.[/size][/*]\n<br />[size=2][b]30 - Thunderstruck[/b] - Weapon enchantments are 25% more effective when delivered by a power attack (or 50% for a two-handed power attack).[/size][/*]\n<br />[size=2][b]40 - Gem Dust[/b] - You may choose to destroy a Flawless Gem when you begin the enchanting process and sprinkle its dust on the Arcane Enchanter. New enchantments are 25% stronger when placed upon an item of the type corresponding to the gem.[/size][/*]\n<br />[size=2][b]40 - Secretkeeper[/b] - When a staff is equipped in your left hand, your attacks deal 25% more damage and critical damage. When a staff is equipped in your right hand, your spells and scrolls are 25% more effective.[/size][/*]\n<br />[size=2][b]40 - Spellscribe[/b] - Grants the \"Spellscribe\" power: use it to store the spell you are dual casting. Your power attacks and power bashes unleash the stored spell for free, with a cooldown based on Enchanting skill. Only works with spells that affect other targets.[/size][/*]\n<br />[size=2][b]50 - Flame of Magnus[/b] - While casting or concentrating on a staff in your left hand, you may attack with your right hand, dealing 50% more damage and critical damage.[/size][/*]\n<br />[size=2][b]50 - Preserver[/b] - Learning an item's enchantment does not destroy it.[/size][/*]\n<br />[size=2][b]60 - Might and Magic[/b] - You are adept at weaving blade and magic. Spells cast with your left hand are 10% more effective if you are wielding a weapon in your right hand. Attacks with a weapon in your right hand deal 10% more damage if you are holding a spell in your left hand.[/size][/*]\n<br />[size=2][b]60 - Regalia[/b] - New enchantments placed upon robes, circlets, hoods and necklaces are 30% stronger.[/size][/*]\n<br />[size=2][b]60 - Staff Recharge[/b] - Equipped staves regenerate 5 points of charge per second, up to their charge level when you last equipped them or recharged them with a soul gem.[/size][/*]\n<br />[size=2][b]70 - Attunement[/b] - All enchantments on equipped weapons and armor are 10% more powerful and last 10% longer.[/size][/*]\n<br />[size=2][b]70 - Charge Tap[/b] - Grants the \"Charge Tap\" power. At will, drains a quarter of your current weapon charge to restore Health by 15% of the amount drained and Magicka and Stamina by 25% of the amount drained. (If you have two enchanted weapons equipped, the drain is split.)[/size][/*]\n<br />[size=2][b]70 - Power Echoes[/b] - Spellscribe activates twice before going on cooldown.[/size][/*]\n<br />[size=2][b]80 - Heart of the Sun[/b] - Use an equipped staff as an energy source, causing it to lose charge at a rate of 15 points per second but making your weapon enchantments 1% more effective per 50 points of charge remaining in the staff. (This effect stacks if more than one staff is equipped.) Sheathe to cancel.[/size][/*]\n<br />[size=2][b]80 - Twin Enchantment[/b] - Can place two enchantments upon the same item.[/size][/*]\n<br />[size=2][b]90 - Arcane Nexus[/b] - You may choose to upgrade one arcane enchanter to an Arcane Nexus for 2500 gold. New enchantments created at an Arcane Nexus are 25% stronger. Can be \"Disassembled\" by sneaking, allowing you to upgrade another.[/size][/*]\n<br />[size=2][b]90 - You Shall Not Pass[/b] - Simultaneously (within 1 second) using an enchanted staff in your left hand and striking with an enchanted weapon in your right hand releases a flash of light that staggers enemies and deals damage equal to half your Enchanting skill level.[/size][/*]\n<br />[size=2][b]100 - Miracle[/b] - You put your heart and soul into the next item you enchant at an Arcane Nexus, placing up to three enchantments upon it that are 25% stronger. Try as you might, you will never be able to repeat this feat.[/size][/*]\n<br />\n<br />[size=4][color=#aa8888]Heavy Armor\n<br />[/color][/size]\n<br />[size=2][b]0 - Heavy Armor Mastery (2)[/b] - Armor rating of Heavy Armor increased by 20/40%. You gain a small amount of Heavy Armor experience when wearing at least two pieces of Heavy Armor in combat.[/size][/*]\n<br />[size=2][b]20 - Cushioned (2)[/b] - You take half/no damage from falling if wearing all Heavy Armor.[/size][/*]\n<br />[size=2][b]30 - Battle Weary[/b] - Tired enemies have a harder time defeating your armor. You take up to 20% less attack damage from enemies with half or less Stamina, if wearing all Heavy Armor. The lower their Stamina, the less damage you take.[/size][/*]\n<br />[size=2][b]30 - Heavy Armor Fit[/b] - Armor rating of Heavy Armor increased by 25% if wearing all Heavy Armor.[/size][/*]\n<br />[size=2][b]40 - Defiance[/b] - You are trained to deflect incoming attacks while wearing all Heavy Armor. Whenever an enemy attacks you, you gain 15 points of armor rating for 10 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]40 - Face of Death[/b] - You no longer need to wear a helmet to benefit from perks that require \"wearing all Heavy Armor\". If you are not wearing a helmet, Heavy Armor pieces have 20% increased armor rating.[/size][/*]\n<br />[size=2][b]40 - Rallying Standard[/b] - Grants the \"Rallying Standard\" power. Once a day, place a banner that grants 150 points of armor and 25% melee damage to allies within 25 feet wearing all Heavy Armor (including you) and prevents them from fleeing. Lasts 60 seconds.[/size][/*]\n<br />[size=2][b]50 - Born to Fight[/b] - Heavy Armor weighs half as much and slows you down half as much when worn.[/size][/*]\n<br />[size=2][b]50 - Revel in Battle[/b] - Defiance also increases melee weapon damage by 3% for 10 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]60 - Bedrock[/b] - If wearing all Heavy Armor, you have 20% chance to brace for impact when attacked by an enemy, becoming immune to stagger for 4 seconds.[/size][/*]\n<br />[size=2][b]60 - Break Upon Me[/b] - You are immune to basic melee weapon perks (Clash of Champions/Heroes, Denting/Crushing Blows, Bleed Like a Lamb/Dog, Bite Marks). If wearing all Heavy Armor, you take 10% less attack damage from enemies affected by one or more of these perks.[/size][/*]\n<br />[size=2][b]60 - Never Kneel[/b] - If wearing all Heavy Armor, take 30% less attack damage from power attacks.[/size][/*]\n<br />[size=2][b]70 - Lead the Tempest[/b] - Sprinting in combat increases the armor of allied people within 20 feet by 25% of your own armor, and the armor of allied Skeletons created by Bone Collector within 20 feet by 15% of your own armor. Lasts 30 seconds.[/size][/*]\n<br />[size=2][b]70 - Reap the Whirlwind[/b] - When struck by a power attack or power bash, your attacks deal 125% more damage to the attacker for 5 seconds if wearing all Heavy Armor.[/size][/*]\n<br />[size=2][b]80 - Out of the Inferno[/b] - Incoming fire, frost and shock damage reduced by 0.02% per point of armor if wearing all Heavy Armor.[/size][/*]\n<br />[size=2][b]80 - Rise Above[/b] - If wearing all Heavy Armor, you intimidate enemies within 15 feet. They lose 5% attack damage and you gain 5% attack damage for each enemy affected.[/size][/*]\n<br />[size=2][b]80 - Warbringer[/b] - Raising your hands (to draw a weapon or spell) places a Rallying Standard at your location for 120 seconds. This does not count against the limit of one Rallying Standard at a time.[/size][/*]\n<br />[size=2][b]90 - Doombringer[/b] - Rallying Standard also improves Destruction spells and effects by 15%.[/size][/*]\n<br />[size=2][b]90 - Immortal[/b] - If wearing all Heavy Armor, take 75% less damage from attacks below 15% Health (or 20% Health if you are affected by Rallying Standard).[/size][/*]\n<br />[size=2][b]90 - Primal Fear[/b] - If wearing all Heavy Armor, walking (but not running) towards living enemies within 30 feet in front of you may break their confidence, causing them to flee for 8 seconds.[/size][/*]\n<br />[size=2][b]90 - Sovereign[/b] - When struck by an attack, subsequent attacks are deflected if wearing all Heavy Armor. You take 75% reduced damage from attacks for 1 second.[/size][/*]\n<br />[size=2][b]100 - Face of the Mountain[/b] - When struck by a power attack or power bash, the attacker's strike rebounds forcefully as if striking solid rock, staggering them and potentially knocking them to the ground if wearing all Heavy Armor.[/size][/*]\n<br />\n<br />[size=4][color=#8888aa]Illusion\n<br />[/color][/size]\n<br />[size=2][b]0 - Illusion Mastery (2)[/b] - Illusion spells cost 35/50% less Magicka, Illusion spells last 0.5/1% longer per level of Illusion, and mind affecting Illusion spells (Calm, Fear, Frenzy, Rally) are 0.1/0.2 points stronger per level of Illusion.[/size][/*]\n<br />[size=2][b]20 - Dream Thief[/b] - Activate sleeping victims to steal their dream, increasing the effectiveness of your Illusion spells by 50% for 3600 seconds. Chance to fail and alert the victim, based on Illusion skill.[/size][/*]\n<br />[size=2][b]20 - Illusion Dual Casting[/b] - Dual casting an Illusion spell empowers it, increasing effectiveness and cost.[/size][/*]\n<br />[size=2][b]30 - Commanding Presence[/b] - In combat, you radiate an aura of mystical nobility that touches allied creatures and people within 40 feet. Those affected gain 20% extra attack damage and have 20% chance of a critical strike.[/size][/*]\n<br />[size=2][b]30 - Entice Barter[/b] - Activate any target under the effect of a Calm spell to initiate trade.[/size][/*]\n<br />[size=2][b]30 - Imposing Presence[/b] - You radiate an aura of mystical charisma that touches all within 40 feet. Any Illusion spell you cast on those affected is 25% more powerful and lasts 30% longer.[/size][/*]\n<br />[size=2][b]30 - Night Eye[/b] - Grants the \"Night Eye\" power. At will, grants improved night vision for 120 seconds.[/size][/*]\n<br />[size=2][b]40 - Crown of the False King[/b] - Commanding Presence also increases armor by 80 points and magic resistance by 20%.[/size][/*]\n<br />[size=2][b]40 - Kindred Mage[/b] - Mind affecting spells and effects are 15 points stronger (or 30 points if you are the same race as the target).[/size][/*]\n<br />[size=2][b]40 - Quiet Before the Storm (2)[/b] - All spells you cast from any school of magic/, as well as all shouts, are silent to others.[/size][/*]\n<br />[size=2][b]40 - Wilting[/b] - Those affected by a Calm spell or effect within the radius of Imposing Presence lose 200 points of armor and 50% magic resistance.[/size][/*]\n<br />[size=2][b]50 - Fickle Fate[/b] - Mind affecting spells and effects cast on others are between 1 and 40 points stronger, chosen at random.[/size][/*]\n<br />[size=2][b]50 - Nemesis[/b] - Activate any hostile creature or humanoid in combat to summon an illusion of the target with 1% extra attack damage per Illusion level. The illusion relentlessly attacks the target for 30 seconds. This effect has a 180 second cooldown.[/size][/*]\n<br />[size=2][b]50 - Terror[/b] - Those affected by a Fear spell or effect within the radius of Imposing Presence drop their weapon.[/size][/*]\n<br />[size=2][b]60 - Imperious Splendor[/b] - Commanding Presence and Crown of the False King are twice as powerful as long as you remain above 75% Health.[/size][/*]\n<br />[size=2][b]60 - Master of the Mind[/b] - Mind affecting spells (Calm, Fear, Frenzy, Rally) and Commanding Presence also work on undead, daedra and automatons.[/size][/*]\n<br />[size=2][b]60 - Pandemonium[/b] - Those affected by a Frenzy spell or effect within the radius of Imposing Presence gain 50% extra attack damage.[/size][/*]\n<br />[size=2][b]70 - Dream Charm[/b] - Activate sleeping victims to project yourself into their dream, improving their disposition towards you. High disposition may earn you quests, discounts and gifts. Chance to fail and alert the victim, based on Illusion skill.[/size][/*]\n<br />[size=2][b]70 - Neverworld[/b] - Those affected by a Calm spell or effect within the radius of Imposing Presence are enraptured by a lotus dream from which they may refuse to return to reality. When the Calm is broken due to an attack, they may become Calmed again for 30 seconds.[/size][/*]\n<br />[size=2][b]70 - Shadow Refuge[/b] - While affected by an invisibility spell or effect, you take 35% less damage from attacks and sneaking is 15% better.[/size][/*]\n<br />[size=2][b]70 - The Reaper Comes[/b] - Activate any non-essential humanoid (only) under the effect of a Calm spell to send a wraith to slay the target within 15 seconds. This counts as an assault, if you get seen. This effect has a 180 second cooldown and can only affect one target at a time.[/size][/*]\n<br />[size=2][b]80 - Lamb to the Slaughter[/b] - Activate any humanoid (only) under the effect of a Fear spell to compel the target to stand motionless for 30 seconds. Your attacks against this target ignore armor. This effect has a 180 second cooldown and can only affect one target at a time.[/size][/*]\n<br />[size=2][b]80 - Protect Your God[/b] - When struck by a weapon, may compel a nearby ally affected by Commanding Presence to engage your attacker, dealing 250% extra attack damage for 5 seconds.[/size][/*]\n<br />[size=2][b]80 - Soulcrusher[/b] - Feast upon the minds of those affected by a Fear spell or effect within the radius of Imposing Presence, absorbing 25 points of Magicka per second.[/size][/*]\n<br />[size=2][b]90 - Blind Guardian[/b] - Activate any non-hostile creature or humanoid in combat to summon an illusion of the target. The illusion fights for the target for 60 seconds and the target won't flee for its duration. This effect has a 300 second cooldown.[/size][/*]\n<br />[size=2][b]90 - Dream Geas[/b] - Activate sleeping victims to send a dream that compels them to fight at your side until released. You can only have one Dream Thrall at a time. Chance to fail and alert the victim, based on Illusion skill.[/size][/*]\n<br />[size=2][b]90 - Ghost of the Tenth Eye[/b] - Sneaking while under the effect of the Vision of the Tenth Eye spell will summon a disembodied eye under your control. The eye has 1 point of Health, but is invisible and silent. You must know the Vision of the Tenth Eye spell to learn this perk.[/size][/*]\n<br />[size=2][b]90 - Heavy Weighs the Tapestry[/b] - Activate any humanoid (only) under the effect of a Frenzy spell to incapacitate the target with magical exhaustion for 30 seconds and drain 500 points of Magicka and Stamina. This effect has a 180 second cooldown and can only affect one target at a time.[/size][/*]\n<br />[size=2][b]90 - Nightfall[/b] - Those affected by a Frenzy spell or effect within the radius of Imposing Presence are consumed by battle hunger when there are no other enemies remaining, taking 40 points of damage per second.[/size][/*]\n<br />[size=2][b]100 - Wraithwalker[/b] - After using an Activate perk (Blind Guardian, Heavy Weighs the Tapestry, Lamb to the Slaughter, Nemesis, The Reaper Comes), Illusion spells are 50% more powerful and last 50% longer for 10 seconds. The cooldown of Activate perks ends after 8 seconds out of combat.[/size][/*]\n<br />\n<br />[size=4][color=#88aa88]Light Armor\n<br />[/color][/size]\n<br />[size=2][b]0 - Light Armor Mastery (2)[/b] - Armor rating of Light Armor increased by 20/40%. You gain a small amount of Light Armor experience when wearing at least two pieces of Light Armor in combat.[/size][/*]\n<br />[size=2][b]20 - Iron Fist (3)[/b] - Increases unarmed damage by 5/15/25% of your current Stamina, and you gain Light Armor experience when using unarmed attacks in combat. Requires two free hands.[/size][/*]\n<br />[size=2][b]20 - Annoying Mosquitoes (2)[/b] - You take 10/20% less attack damage from enemies with full Health if wearing all Light Armor.[/size][/*]\n<br />[size=2][b]30 - As a Leaf[/b] - While sprinting in Light Armor, you cannot be staggered and take 50% less damage from power attacks.[/size][/*]\n<br />[size=2][b]30 - Light Armor Fit[/b] - Armor rating of Light Armor increased by 25% if wearing all Light Armor.[/size][/*]\n<br />[size=2][b]40 - Initiative (2)[/b] - When you enter combat, if wearing all Light Armor, regenerate up to 10/20% of your maximum Stamina per second. This bonus gradually diminishes over the course of 15 seconds.[/size][/*]\n<br />[size=2][b]40 - Keen Senses[/b] - You no longer need to wear a helmet to benefit from perks that require \"wearing all Light Armor\". If you are not wearing a helmet, Light Armor pieces have 20% increased armor rating.[/size][/*]\n<br />[size=2][b]40 - Sweeping Wind[/b] - Unarmed power attacks do 25% more damage. Additionally, if your movement speed is increased, they do 2% damage per 1% movement speed. Requires two free hands.[/size][/*]\n<br />[size=2][b]50 - Rushing Tide[/b] - Unarmed attacks grant 10% increased Stamina regeneration and 5% movement speed for 8 seconds. This effect stacks. Requires two free hands.[/size][/*]\n<br />[size=2][b]50 - Unhindered[/b] - Light Armor weighs nothing and doesn't slow you down when worn.[/size][/*]\n<br />[size=2][b]50 - Windrunner[/b] - Move 10% faster in combat if wearing all Light Armor.[/size][/*]\n<br />[size=2][b]60 - Evasive Leap[/b] - If wearing all Light Armor, jump in combat to cause all incoming attacks and spells to miss for 1 second. This effect has a 5 second cooldown.[/size][/*]\n<br />[size=2][b]60 - Into the Maelstrom[/b] - You take 10% less attack damage when fighting more than one enemy if wearing all Light Armor.[/size][/*]\n<br />[size=2][b]70 - Fight or Flight[/b] - When struck by an unblocked attack or spell in combat, an adrenaline rush regenerates 5% of your maximum Stamina per second for 6 seconds if wearing all Light Armor.[/size][/*]\n<br />[size=2][b]70 - Hissing Dragon[/b] - You may choose a damage type (fire, frost, shock, poison, disease or sun). Unarmed attacks unleash a shockwave that deals the chosen damage type to all targets in front of you. Requires two free hands. Does not activate while sneaking.[/size][/*]\n<br />[size=2][b]70 - Wardancer[/b] - Your agility enables you to strike more effectively, granting 20% more attack damage and critical damage if wearing all Light Armor. This effect is lost for 6 seconds whenever you get struck by an unblocked attack or a hostile spell in combat.[/size][/*]\n<br />[size=2][b]80 - Spelldancer[/b] - Wardancer also improves elemental (fire, frost and shock) spells and effects by the same amount.[/size][/*]\n<br />[size=2][b]80 - Survival Instinct[/b] - When you get struck by an unblocked attack or hostile spell in combat, gain 10% movement speed for 6 seconds if wearing all Light Armor.[/size][/*]\n<br />[size=2][b]80 - Wild and Free[/b] - While sprinting in Light Armor, you take 50% less damage from attacks.[/size][/*]\n<br />[size=2][b]90 - Breaking Waves[/b] - Unarmed attacks have 15% chance of a critical strike that deals critical damage equal to 40% of your current Stamina. If you are affected by Wardancer, every hit is a critical strike. Requires two free hands.[/size][/*]\n<br />[size=2][b]90 - Glancing Blows[/b] - You take 30% less damage from blocked attacks while Wardancer is active. When you lose the Wardancer effect due to an unblocked attack, it also deals 30% less damage.[/size][/*]\n<br />[size=2][b]90 - Lightning Strike[/b] - Your critical strikes deal 75% more critical damage for 10 seconds after entering combat while wearing all Light Armor.[/size][/*]\n<br />[size=2][b]100 - Tempting Fate[/b] - You gain 20% movement speed if you are not blocking during an enemy's power attack. If the power attack misses, the effect lasts until combat ends or until you get struck by a power attack.[/size][/*]\n<br />\n<br />[size=4][color=#88aa88]Lockpicking\n<br />[/color][/size]\n<br />[size=2][b]0 - Lockpicking Mastery (2)[/b] - Weaker/all locks are easier to pick.[/size][/*]\n<br />[size=2][b]20 - Bear Traps[/b] - Able to pick up Bear Traps or create them at a Forge or Anvil, and drop them from your inventory to place them. The teeth of placed Bear Traps deal 2 points of damage per level of Lockpicking. You can only pick up and carry two Bear Traps at a time.[/size][/*]\n<br />[size=2][b]20 - Game of Fate[/b] - There are 5 Dragons of Fate hidden in random locked containers in Skyrim. Each grants 15000 gold and a free perk point when removed from its container. The name of the container changes to indicate the treasure inside.[/size][/*]\n<br />[size=2][b]30 - Lockdown[/b] - Activate a hostile automaton to lockpick your way into its engine. Lock difficulty is based on its current Health. Pick its lock within 15 seconds to reduce its Health to 1 and shut it down for 60 seconds. If you fail, you can't try again for 30 seconds.[/size][/*]\n<br />[size=2][b]30 - Robber's Eye[/b] - When you enter a dwelling you don't own, illuminates a locked container for 120 seconds. During this time, it contains valuable items (based on your Lockpicking skill and the difficulty of its lock). This can only occur once every 12-60 ingame hours.[/size][/*]\n<br />[size=2][b]30 - Wax Key[/b] - Gives you a copy of a picked lock's key if it has one.[/size][/*]\n<br />[size=2][b]40 - Gone in Fifteen Seconds[/b] - Taking 15 seconds or less to pick the lock on a container illuminated by Robber's Eye improves the added treasure by an average of 50% based on the level of the lock and resets the cooldown of Robber's Eye.[/size][/*]\n<br />[size=2][b]40 - Lockjaw[/b] - Your Bear Traps stagger victims struck by the teeth, reducing their armor rating by 10 points per level of Lockpicking for 5 seconds.[/size][/*]\n<br />[size=2][b]40 - Locksmith[/b] - Pick starts much closer to the lock opening position.[/size][/*]\n<br />[size=2][b]50 - Big Game Hunter[/b] - Placed Bear Traps are 20% bigger and more likely to successfully hit small or fast moving targets. They also rearm themselves 2.5 seconds after being triggered.[/size][/*]\n<br />[size=2][b]50 - Hotwire[/b] - Activate an automaton under Lockdown to lockpick its brain. Succeed within 15 seconds to hack the automaton, forcing it to follow you and fight for you. If you fail, you can't try again for 30 seconds. You can only have one Hotwired Automaton at a time.[/size][/*]\n<br />[size=2][b]50 - Nose for Treasure[/b] - You may choose an item type (gold, jewelry, books, ingredients, potions, ingots, weapons, armor, scrolls). Containers illuminated by Robber's Eye are three times more likely to contain items of your chosen type over other types.[/size][/*]\n<br />[size=2][b]60 - Dungeoneer[/b] - Robber's Eye also works in dungeons and lasts three times as long.[/size][/*]\n<br />[size=2][b]60 - Golden Touch[/b] - Find 20-100 more gold in many dungeon chests and 2-10 more gold in some corpses, urns, etc.[/size][/*]\n<br />[size=2][b]70 - Bait[/b] - Grants the \"Bait\" power. At will, lures the nearest hostile target within 75 feet to the location of the nearest Bear Trap placed within 50 feet (not during combat or conversation). Lasts 30 seconds.[/size][/*]\n<br />[size=2][b]80 - Bushwhack[/b] - If the victim of your Bear Trap is not detecting you, the trap is five times as effective.[/size][/*]\n<br />[size=2][b]80 - The Revenge[/b] - You can pick up and carry 3 Bear Traps.[/size][/*]\n<br />[size=2][b]90 - Percussive Maintenance[/b] - Your Hotwired Automaton moves 30% faster and attacks 20% faster. Hitting your Hotwired Automaton with a mace or warhammer repairs it 150 points (or 300 points on a power attack) and further increases attack speed by 50% for 10 seconds.[/size][/*]\n<br />[size=2][b]90 - Treasure Hunter[/b] - Increases the chance of finding an additional weapon or armor item in many dungeon chests from 10% to 15%.[/size][/*]\n<br />[size=2][b]100 - Dragon's Teeth[/b] - When placing a Bear Trap, you may choose to add an extra effect: Poison, Drain Magicka, Drain Stamina, Slow, Banish or Turn Undead. This effect is triggered when a victim is struck by the teeth and takes damage.[/size][/*]\n<br />[size=2][b]100 - Seen This Before[/b] - Your skill at lockpicking is such that you may bypass locks of Expert or lower level without using a key or manually picking the lock. After picking or bypassing at least 100 locks, you gain 2 perk points.[/size][/*]\n<br />\n<br />[size=4][color=#aa8888]One-Handed\n<br />[/color][/size]\n<br />[size=2][b]0 - One-Handed Mastery (2)[/b] - One-handed weapons do 25/50% more damage./, and critical strikes with one-handed weapons do 2% more critical damage per level of One-Handed.[/size][/*]\n<br />[size=2][b]20 - Disciplined Fighter[/b] - Reduces the Stamina cost of power attacks with one-handed weapons by 15 points.[/size][/*]\n<br />[size=2][b]30 - Bite Marks (3)[/b] - Unblocked attacks with daggers deal an additional 1/2/3 point/s of bleed damage per second for 30/45/60 seconds to living targets. This effect stacks.[/size][/*]\n<br />[size=2][b]30 - Bleed Like a Lamb (3)[/b] - Attacks with war axes deal an additional 1/2/3 points of damage per second for 3 seconds to living targets. When the bleeding stops, they take damage equal to 15/20/25% of the Health they lost while bleeding.[/size][/*]\n<br />[size=2][b]30 - Clash of Champions (3)[/b] - Attacks with swords reduce the target's attack damage by 10/15/20% for 3 seconds.[/size][/*]\n<br />[size=2][b]30 - Denting Blows (3)[/b] - Attacks with maces reduce the armor rating of armored enemies by 50/75/100 points for 15 seconds.[/size][/*]\n<br />[size=2][b]30 - Ravage (2)[/b] - Dual wielding attacks are 20/35% faster.[/size][/*]\n<br />[size=2][b]40 - Cross Cut (2)[/b] - Unblocked regular attacks with a sword increase the damage of your power attacks against the target by 25/50% for 4 seconds.[/size][/*]\n<br />[size=2][b]40 - Furious Strength[/b] - Power attack damage with one-handed weapons increased by 15% plus 0.1% per point of Stamina. Unlocks decapitations.[/size][/*]\n<br />[size=2][b]40 - Mangle (2)[/b] - Attacks with a war axe ignore 25/50% armor if the target is staggered.[/size][/*]\n<br />[size=2][b]40 - Savage (2)[/b] - Attacks with a dagger deal 25/50% more damage if you rapidly hit the target three or more times. Resets when 2 seconds pass between hits.[/size][/*]\n<br />[size=2][b]40 - Smite (2)[/b] - Power attacks with a mace deliver a critical strike that deals three/six times critical damage (four/eight times against the undead). Targets can only be struck by Smite once every 30 seconds.[/size][/*]\n<br />[size=2][b]50 - Falling Sword[/b] - Forwards power attacks with a sword cause targets to bleed for 20 seconds. When a bleeding target falls below 25% Health, your attacks against that target are critical strikes that deals ten times critical damage.[/size][/*]\n<br />[size=2][b]50 - Overrun[/b] - Can perform a one-handed sprinting power attack that deals up to 50% more damage and critical damage to a target above half Health. The higher its remaining Health percentage, the more damage and critical damage is dealt.[/size][/*]\n<br />[size=2][b]50 - Rise Kinsmen[/b] - Forwards power attacks with a mace inspire nearby allies, granting them 20% extra attack damage for 15 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]50 - Rogue's Parry[/b] - When wielding a one-handed weapon and an empty other hand, attacking with the weapon while the opponent is winding up their attack or drawing a bow deals 40% more damage and delivers a critical strike.[/size][/*]\n<br />[size=2][b]50 - Shieldbiter[/b] - Forwards power attacks with a war axe smash through a block, causing the target to drop their shield and take a critical strike that deals five times critical damage.[/size][/*]\n<br />[size=2][b]50 - Twin Fang[/b] - Forwards power attacks with a dagger impale the target, dealing double Bite Marks damage, whether or not the attack is blocked.[/size][/*]\n<br />[size=2][b]60 - Man O'War[/b] - While dual wielding in combat, build up a battle rage with each attack, gaining 1% extra attack damage and 1% bonus attack speed for 20 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]60 - Swaying Cobra[/b] - Sideways power attacks with a dagger inflict distracting wounds, draining 100 points of Magicka and Stamina and halting regeneration for 5 seconds.[/size][/*]\n<br />[size=2][b]60 - Toll the Bell[/b] - Sideways power attacks with a mace deplete all of your Stamina on impact, dealing 1% more damage per point of Stamina depleted and doing a critical strike.[/size][/*]\n<br />[size=2][b]60 - Windswept[/b] - Sideways power attacks with a sword fling targets backwards up to 6 feet, dealing up to 40% more damage based on distance traveled.[/size][/*]\n<br />[size=2][b]60 - Wolfstooth[/b] - Sideways power attacks with a war axe grant 15% extra attack damage for 30 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]70 - Death Adder[/b] - Standing power attacks with a dagger ignore armor.[/size][/*]\n<br />[size=2][b]70 - Go for the Throat[/b] - Standing power attacks with a war axe remove all active instances of Wolfstooth on the user, dealing 50% bonus damage and a critical strike for 250% bonus critical damage for each instance consumed.[/size][/*]\n<br />[size=2][b]70 - Into the Dust[/b] - Repeated standing power attacks with a sword against a target do escalating damage if no more than 3 seconds pass between each. This effect stacks up to three times, each doing 15% more damage. Reaching four stacks knocks the target off their feet.[/size][/*]\n<br />[size=2][b]70 - Meteor Storm[/b] - Each standing power attack with a mace that hits a target empowers subsequent standing power attacks with a mace within 20 seconds, increasing their damage and Stamina cost by 15%. This effect stacks.[/size][/*]\n<br />[size=2][b]70 - Thundering Blow[/b] - Whenever you perform a total of 8 or more one-handed regular attacks in combat, your next one-handed power attack is a Thundering Blow that deals double damage and costs no Stamina, resetting the counter.[/size][/*]\n<br />[size=2][b]80 - Apex Predator[/b] - Attacks with war axes deal bonus damage to living targets equal to 4% of their current Health (max. 40 damage).[/size][/*]\n<br />[size=2][b]80 - Coiling Python[/b] - Hitting a target with a forwards, sideways and backwards power attack with a dagger within 30 seconds paralyzes the target for 20 seconds. Your attacks against the paralyzed target are critical strikes that deal nine times critical damage.[/size][/*]\n<br />[size=2][b]80 - Judgment[/b] - Slaying an enemy under the effect of Clash of Champions restores 100 points of Stamina.[/size][/*]\n<br />[size=2][b]80 - Skull Crack[/b] - Attacks with maces interrupt spellcasting. Does not work on massive targets.[/size][/*]\n<br />[size=2][b]90 - Aftershock[/b] - After a Thundering Blow, attack speed is increased by 75% for 3 seconds.[/size][/*]\n<br />[size=2][b]90 - Unleash the Beast[/b] - While dual wielding in combat, enter a murderous frenzy every 20 to 40 seconds. For 8 seconds, dual wield power attacks deal 50% more damage and 100% more critical damage.[/size][/*]\n<br />[size=2][b]100 - Wandering Warrior[/b] - Whenever you defeat at least 4 humanoids and/or animals in a single battle, you gain a permanent +1% bonus to one-handed damage. This effect stacks up to +20%.[/size][/*]\n<br />\n<br />[size=4][color=#88aa88]Pickpocket\n<br />[/color][/size]\n<br />[size=2][b]0 - Pickpocket Mastery (2)[/b] - Adds 20/40% to your pickpocket chance and increases carry weight by 50/100 points.[/size][/*]\n<br />[size=2][b]20 - Blood Money[/b] - You find 10-100 more gold when looting humanoid corpses you have slain in an especially violent fashion (with an attack that dealt at least 100 more damage than their remaining Health or a killmove).[/size][/*]\n<br />[size=2][b]20 - Trained Rabbit[/b] - Grants the \"Trained Rabbit\" power. At will, silently sends out a trained rabbit to lead you to the nearest loose valuable item (armor, weapon, key, book, soul gem, ingredient). It then returns to you.[/size][/*]\n<br />[size=2][b]30 - Cutpurse[/b] - Adds 25% to your chance to pickpocket gold, keys and jewelry.[/size][/*]\n<br />[size=2][b]30 - Thief's Eye[/b] - When you enter a major city, illuminates a random citizen on the streets for 300 seconds. If you interact with the target during this time, they will carry valuable items (based on your Pickpocket skill). This can only occur once every 12-60 ingame hours.[/size][/*]\n<br />[size=2][b]40 - Brotherhood Cocktail[/b] - Silently harm enemies by placing poisons in their pockets while pickpocketing.[/size][/*]\n<br />[size=2][b]40 - Death's Emperor (2)[/b] - A cursed septim appears in your inventory. When someone else is in possession of the coin, your attacks deal 100/200% more damage and critical damage to them.[/size][/*]\n<br />[size=2][b]40 - On the Run[/b] - After you successfully pickpocket someone, sneaking is 200% more effective and movement speed is increased by 25% for 10 seconds.[/size][/*]\n<br />[size=2][b]50 - Lawless World[/b] - Petty crimes are slowly forgotten, allowing your bounties for non-violent crimes to decay at a rate of 50% of your Pickpocket skill level each day.[/size][/*]\n<br />[size=2][b]50 - Thief's Luck[/b] - You may choose an item type (gold, jewelry, books, ingredients, potions, ingots, scrolls). Those illuminated by Thief's Eye are three times more likely to carry items of your chosen type over other types.[/size][/*]\n<br />[size=2][b]60 - Stalk the Prey[/b] - Preparing to pickpocket (sneaking behind a victim with the pickpocket message displayed) for at least 10 seconds adds 20% to your chance to pickpocket any item.[/size][/*]\n<br />[size=2][b]70 - Doomed to Plunder[/b] - Killing a victim in possession of the Death's Emperor grants 100-300 more gold.[/size][/*]\n<br />[size=2][b]70 - Trickster[/b] - Can pickpocket equipped weapons. If the target is sleeping, can pickpocket any equipped item.[/size][/*]\n<br />[size=2][b]80 - Crime Wave[/b] - Shortly after you pickpocket or speak with the target illuminated by Thief's Eye, a new victim is illuminated, up to 4 times in a row.[/size][/*]\n<br />[size=2][b]80 - You Saw Nothing[/b] - Grants the \"You Saw Nothing\" power. Once a day, distract a target and others in a 40 foot radius around the target. For 45 seconds, you will not receive a bounty if they are the only witness of your crimes. Does not prevent them from defending themselves.[/size][/*]\n<br />[size=2][b]90 - Mutiny[/b] - Grants the \"Mutiny\" power. At will, activates the curse of the Death's Emperor, causing whoever is in possession of the coin to attack randomly for 30 seconds. Any deaths resulting from this can't be traced back to you.[/size][/*]\n<br />[size=2][b]90 - Robbed Blind[/b] - Adds the Thief's Eye effect to You Saw Nothing.[/size][/*]\n<br />[size=2][b]100 - Dragon Hoard[/b] - Whenever you sleep with 50000 or more gold in your inventory, you may choose to spend it to purchase a perk point.[/size][/*]\n<br />\n<br />[size=4][color=#8888aa]Restoration\n<br />[/color][/size]\n<br />[size=2][b]0 - Restoration Mastery (2)[/b] - Cast Restoration spells for 35/50% less Magicka, and Restoration spells are 0.25/0.5% more powerful per level of Restoration.[/size][/*]\n<br />[size=2][b]20 - Descending Light[/b] - When you enter combat, rapidly regenerate points of Magicka equal to half of your Restoration skill level per second. This effect gradually diminishes over the course of 15 seconds. The regeneration does not stop while casting.[/size][/*]\n<br />[size=2][b]20 - Restoration Dual Casting[/b] - Dual casting a Restoration spell empowers it, increasing effectiveness and cost.[/size][/*]\n<br />[size=2][b]30 - Edgewalker[/b] - Restoration spells are up to 30% more powerful if the recipient is below half Health. The bonus increases as Health decreases.[/size][/*]\n<br />[size=2][b]30 - Hallowed Burial (2)[/b] - Your attacks and Restoration spells and effects are 20/30% more powerful against undead enemies.[/size][/*]\n<br />[size=2][b]30 - Spirit Tutors[/b] - Two spirit tutors roam Skyrim. Find them and speak with them to receive a permanent blessing that makes Restoration spells 1% stronger per 20 points of Magicka. Each spirit tutor grants one blessing.[/size][/*]\n<br />[size=2][b]30 - Vigilant[/b] - The first ward you cast in combat costs no Magicka to maintain.[/size][/*]\n<br />[size=2][b]40 - Necromanticon[/b] - Study the arts of disease, learning the \"Putrefy\" spell. When your Restoration skill reaches 50, you learn \"Death Cloud\". When your Restoration skill reaches 75, you learn \"Carrion Wind\". These spells deal disease damage to nonmechanical targets.[/size][/*]\n<br />[size=2][b]40 - Exorcist[/b] - Study the arts of destroying the undead, learning the \"Sunblast\" spell. When your Restoration skill reaches 50, you learn \"Holy Hands\". When your Restoration skill reaches 75, you learn \"Stellar Core\". These spells deal damage to the undead.[/size][/*]\n<br />[size=2][b]40 - False Light[/b] - While in combat, you may cast targeted healing spells and effects on enemies to inflict damage equal to 75% of the heal amount.[/size][/*]\n<br />[size=2][b]40 - Respite[/b] - Healing spells also restore Stamina equal to their power.[/size][/*]\n<br />[size=2][b]50 - Antimagic Field[/b] - Staying within 8 feet of an enemy while maintaining a ward prevents them from casting spells. No effect on massive targets.[/size][/*]\n<br />[size=2][b]50 - Overflowing Cup[/b] - Receiving a healing spell or effect when you are already at full Health overheals you, fortifying Health by 1 point per level of Restoration for 20 seconds.[/size][/*]\n<br />[size=2][b]50 - Pilgrim[/b] - Shrine blessings you receive are 1% stronger per level of Restoration.[/size][/*]\n<br />[size=2][b]50 - Warrior's Flame[/b] - In combat, the Warrior's Flame periodically touches a random target within 100 feet (including you). Friendly targets are blessed, restoring 20 points of Magicka and Stamina for 5 seconds. Hostile targets are cursed, draining the same amount instead.[/size][/*]\n<br />[size=2][b]60 - Ashes to Ashes[/b] - Your Warrior's Flame carries the essence of death. Hostile undead cursed by Warrior's Flame take 30 points of damage per second.[/size][/*]\n<br />[size=2][b]60 - Crusader's Fire[/b] - In combat, targets within 30 feet affected by a Turn Undead spell or effect burn with divine fire, taking 10 points of damage per second for 10 seconds. Your attacks and critical strikes deal 25% more damage to targets affected by Crusader's Fire.[/size][/*]\n<br />[size=2][b]60 - Forbidden Sanctuary[/b] - When your ward blocks a spell, you gain Magicka equal to 25% of that spell's cost (or 100% if you are blessed by Warrior's Flame).[/size][/*]\n<br />[size=2][b]60 - Lightwielder[/b] - Increases False Light damage by 10% and allows the perks Sacred Guardian and Under my Wings to hit and damage enemies.[/size][/*]\n<br />[size=2][b]60 - Sacred Flame[/b] - Your Warrior's Flame carries the essence of life. Living allies blessed by Warrior's Flame are healed 20 points per second.[/size][/*]\n<br />[size=2][b]70 - Bastion Ward[/b] - Wards reduce incoming attack damage by 40% (or 20% for wards generated by Spellbreaker and Mage Ward).[/size][/*]\n<br />[size=2][b]70 - Chalice of Tears[/b] - If you are diseased or undead, your Restoration spells are 15% stronger and last 50% longer.[/size][/*]\n<br />[size=2][b]70 - Plague Doctor[/b] - Radiate a zone of pestilent death that reduces the poison and disease resistance of enemies approaching within 40 feet by 50% for 30 seconds.[/size][/*]\n<br />[size=2][b]70 - Under my Wings[/b] - Dual casting a healing spell on yourself also casts it on nearby nonmechanical allies within 20 feet. Does not apply to concentration spells.[/size][/*]\n<br />[size=2][b]70 - Wheel of Life[/b] - In combat, gradually accumulates ambient lifeforce from the environment and releases it in periodic bursts, healing you 100 points every 30 seconds. Becoming affected by a different healing spell or effect restarts the cycle from the beginning.[/size][/*]\n<br />[size=2][b]80 - Battle Cleric[/b] - When Warrior's Flame blesses or curses a target, it also increases or reduces armor by 200 points and magic resistance by 25% for its duration.[/size][/*]\n<br />[size=2][b]80 - In Thy Name[/b] - Increases False Light damage by 15% when you are affected by a shrine blessing.[/size][/*]\n<br />[size=2][b]80 - Mage Ward[/b] - Casting a spell also raises a ward that increases armor rating by 100 and negates up to 100 points of spell damage and effects.[/size][/*]\n<br />[size=2][b]80 - Sacred Guardian[/b] - Emanate a 20 foot aura of protection. Any living allies within range who fall below 30% Health are automatically healed 150 points. This effect has a 30 second cooldown per target.[/size][/*]\n<br />[size=2][b]90 - Enduring Ideal[/b] - Wheel of Life heals 25% more and each new cycle is 5 seconds faster than the last.[/size][/*]\n<br />[size=2][b]90 - Eternal Flame[/b] - Warrior's Flame lasts twice as long.[/size][/*]\n<br />[size=2][b]90 - Gods and Mortals[/b] - Shrine blessings last 50% longer, and the blessings of the Divines (Akatosh, Arkay, Dibella, Julianos, Kynareth, Mara, Stendarr, Talos, Zenithar) confer powerful additional effects.[/size][/*]\n<br />[size=2][b]90 - Tome of Many Pages[/b] - Teaches 18 different Restoration spells. Each fortifies a single skill by 15 levels for 120 seconds.[/size][/*]\n<br />[size=2][b]100 - Apotheosis[/b] - Grants the \"Apotheosis\" power. Once a day, casts Warrior's Flame on all nearby for 20 seconds. Costs 250 Magicka.[/size][/*]\n<br />\n<br />[size=4][color=#aa8888]Smithing\n<br />[/color][/size]\n<br />[size=2][b]0 - Smithing Mastery (2)[/b] - You can create Novice (Steel/Bonemold) items at a forge or anvil, and improve them twice as much./All items can be improved 10% more.[/size][/*]\n<br />[size=2][b]20 - Dwarven Autocannon (2)[/b] - You can create Dwemer Autocannons at a forge or anvil. Use the \"Dwarven Autocannon\" power to deploy them. Cannons fire parallel to your crosshair for 30/60 seconds, dealing damage equal to 30/40% of your Smithing skill, if you are within 12 feet.[/size][/*]\n<br />[size=2][b]30 - Advanced Workshop[/b] - You may choose to upgrade one grindstone or workbench to an Advanced version for 2500 gold. It improves items one tier higher (items can be improved beyond Legendary). Can be \"Disassembled\" by sneaking, allowing you to upgrade another of the same type.[/size][/*]\n<br />[size=2][b]30 - Meric Smithing (2)[/b] - Choose an item type: Contemporary Meric (Elven/Chitin), Dwarven. You can create items of the chosen type at a forge or anvil, and improve them twice as much. Investing a second perk point lets you choose both./You can create both Contemporary Meric (Elven/Chitin) and Dwarven items at a forge or anvil, and improve them twice as much.[/size][/*]\n<br />[size=2][b]40 - Arcane Blacksmith[/b] - You can improve enchanted weapons and armor.[/size][/*]\n<br />[size=2][b]40 - Electrobolt (2)[/b] - Every fifth Dwarven Autocannon shot is an electromagnetic blast that moves slower than a regular shell but deals shock damage to Health and Magicka equal to 80/240% of your Smithing skill level.[/size][/*]\n<br />[size=2][b]40 - Recycle Materials[/b] - 50% chance to retain any materials you spend at an Advanced Grindstone or Advanced Workbench.[/size][/*]\n<br />[size=2][b]50 - Remote Control[/b] - Your Dwarven Autocannon now fires regardless of the distance between it and you.[/size][/*]\n<br />[size=2][b]50 - Expert Smithing (2)[/b] - Choose an item type: Hard Steel (Scaled/Plate/Nordic), Orcish. You can create items of the chosen type at a forge or anvil, and improve them twice as much. Investing a second perk point lets you choose both./You can create both Hard Steel (Scaled/Plate/Nordic) and Orcish items at a forge or anvil, and improve them twice as much.[/size][/*]\n<br />[size=2][b]60 - Sandstone Sheath[/b] - When you draw a weapon, it is automatically sharpened, granting 25% extra attack damage for 10 seconds. This can only occur once every 30 seconds.[/size][/*]\n<br />[size=2][b]60 - Smithing Specialization[/b] - You may choose an item type: One-Handed, Two-Handed, Light Armor, Heavy Armor or Archery. Items of the chosen type can be improved 20% better at a grindstone or workbench.[/size][/*]\n<br />[size=2][b]70 - Exotic Smithing (2)[/b] - Choose an item type: Glass, Crystalline (Ebony/Stalhrim). You can create items of the chosen type at a forge or anvil, and improve them twice as much. Investing a second perk point lets you choose both./You can create both Glass and Crystalline (Ebony/Stalhrim) items at a forge or anvil, and improve them twice as much.[/size][/*]\n<br />[size=2][b]70 - Firing Line[/b] - Your Dwarven Autocannon now deploys two cannons side by side.[/size][/*]\n<br />[size=2][b]80 - Iron Lore[/b] - If you Specialized in an armor type, your attacks ignore 15% of the armor rating of enemies wearing items of the chosen type. If you Specialized in a weapon type, you take 10% less damage from weapons of the chosen type.[/size][/*]\n<br />[size=2][b]80 - Spin Up[/b] - Your Dwarven Autocannon gradually shoots faster over time, gaining 2% firing speed per shot, up to 200%.[/size][/*]\n<br />[size=2][b]90 - Planar Smithing (2)[/b] - Choose an item type: Daedric, Dragonbone. You can create items of the chosen type at a forge or anvil, and improve them twice as much. Investing a second perk point lets you choose both./You can create both Daedric and Dragonbone items at a forge or anvil, and improve them twice as much.[/size][/*]\n<br />[size=2][b]90 - Fuel the Inferno[/b] - When activating an Advanced Grindstone or Advanced Workbench, you may choose to sacrifice a Dragon Soul to improve items by a further one tier during that session.[/size][/*]\n<br />[size=2][b]100 - Heart of Creation[/b] - Pour your Dragonborn blood into the fire at one forge. Forging an item in this forge empowers you, increasing attack damage and critical strike damage by 15% and reducing attack damage taken by 15% for 1800 seconds.[/size][/*]\n<br />\n<br />[size=4][color=#88aa88]Sneak\n<br />[/color][/size]\n<br />[size=2][b]0 - Sneak Mastery (2)[/b] - Sneaking is 15/30% more effective. Sneak success depends on visibility (movement and light level), sound (movement and armor weight), skill level and distance.[/size][/*]\n<br />[size=2][b]20 - Sneak Attack[/b] - Sneak attacks with one-handed weapons deal 100% more damage. Sneak attacks with any other weapon or fists deal 25% more damage.[/size][/*]\n<br />[size=2][b]20 - Tripwire[/b] - Grants the \"Tripwire\" power. At will, places a tripwire in front of you for 120 seconds. It snaps when tripped, knocking all targets hit by it to the floor.[/size][/*]\n<br />[size=2][b]30 - Demolition Job[/b] - All Destruction spells and scrolls are 1% more powerful per level of Sneak if the target is not detecting the caster (2% for rune spells).[/size][/*]\n<br />[size=2][b]30 - Fog of War[/b] - Sneaking is 15% more effective against targets that are in combat with you, or 30% if they are in combat with someone else.[/size][/*]\n<br />[size=2][b]30 - Silent Roll[/b] - Sprinting while sneaking executes a silent forward roll.[/size][/*]\n<br />[size=2][b]30 - Spot Detection[/b] - Grants the \"Spot Detection\" power. At will, outlines all humanoids within 150 feet that are detecting you with a green glow. Lasts 30 seconds.[/size][/*]\n<br />[size=2][b]40 - Assassin's Blade[/b] - Sneak attacks with daggers deal 1% more damage per level of Sneak.[/size][/*]\n<br />[size=2][b]40 - Dynamic Entry[/b] - Performing a silent roll increases your weapon damage by 40% and unarmed damage by 40 points for 3 seconds.[/size][/*]\n<br />[size=2][b]40 - Infiltrator[/b] - Your footsteps and equipped armor make 75% less noise when sneaking.[/size][/*]\n<br />[size=2][b]40 - Whiplash[/b] - Tripwire also reduces armor rating by 1000 points for 5 seconds.[/size][/*]\n<br />[size=2][b]50 - Backstab (2)[/b] - You deal 25/50% more damage and critical damage with daggers when striking a target from behind.[/size][/*]\n<br />[size=2][b]50 - Light Foot[/b] - You won't trigger pressure plates.[/size][/*]\n<br />[size=2][b]50 - Right Behind You[/b] - You are adept at hiding in your target's blind spot. Sneaking is 15% more effective within 30 feet and 30% more effective within 15 feet.[/size][/*]\n<br />[size=2][b]60 - Disengage[/b] - Grants the \"Disengage\" power. Once a day, all enemies within 100 feet who are attacking you or searching for you instantly stop and resume their normal activities.[/size][/*]\n<br />[size=2][b]60 - Dodge Roll[/b] - Performing a silent roll makes you ethereal for 1 second, causing all incoming attacks and spells to miss.[/size][/*]\n<br />[size=2][b]60 - Smokescreen[/b] - Grants the \"Smokescreen\" power. Once a day, creates a 35 foot cloud for 180 seconds that blinds those in the cloud, preventing them from seeing sneaking targets. Sneak attacks against them deal 50% more damage.[/size][/*]\n<br />[size=2][b]70 - Backup Plan[/b] - After being out of combat for at least 5 seconds, entering combat will place a Tripwire behind you for 60 seconds. This does not count against the limit of one Tripwire at a time.[/size][/*]\n<br />[size=2][b]70 - Clean Escape[/b] - When you stand still for 8 seconds while sneaking, enemies within 150 feet no longer search for you.[/size][/*]\n<br />[size=2][b]80 - Behind Enemy Lines[/b] - Sneaking is 15% more effective for each enemy within 100 feet that is not detecting you.[/size][/*]\n<br />[size=2][b]80 - Partystarter[/b] - When you gain invisibility, places a barrel of flammable booze at your location. When you lose invisibility, it explodes, dealing fire damage equal to 200% of your Sneak skill level and staggering targets. This effect has a 15 second cooldown.[/size][/*]\n<br />[size=2][b]80 - Problem Solver[/b] - Sneak attacks deal 10% more damage for each 200 points of Health the target has, up to 50% more damage.[/size][/*]\n<br />[size=2][b]90 - Cloak and Dagger[/b] - Breaking invisibility with a power attack is a guaranteed critical strike that deals 50% more critical damage.[/size][/*]\n<br />[size=2][b]90 - Greased Lightning[/b] - A hidden bottle enables you to leave a trail of grease whenever you perform a silent roll in combat. The grease lasts for 10 seconds and staggers running enemies, while sprinting enemies slip and fall to the ground.[/size][/*]\n<br />[size=2][b]90 - Shadow Warrior[/b] - Entering sneak mode in combat grants 2 seconds of invisibility, briefly leaving combat and forcing distant opponents to search for you. This effect has an 8 second cooldown.[/size][/*]\n<br />[size=2][b]100 - Laughing Ghost[/b] - Grants the \"Laughing Ghost\" power. At will, while sneaking, teleport through the shadows behind a target to attempt a sneak power attack with your right weapon that deals double sneak attack damage. The target must be out of combat.[/size][/*]\n<br />\n<br />[size=4][color=#88aa88]Speech\n<br />[/color][/size]\n<br />[size=2][b]0 - Speech Mastery (2)[/b] - Sell items for 10/20% more. Your intimidation attempts are twice/four times as likely to succeed.[/size][/*]\n<br />[size=2][b]20 - And the Universe Listens[/b] - Shouting restores points of Health, Magicka and Stamina equal to your shout cooldown in seconds. You gain Speech experience when shouting based on your shout cooldown.[/size][/*]\n<br />[size=2][b]20 - Performer[/b] - Grants the \"Perform\" power. Once a day, play a song to entertain up to five people within 50 feet and collect a donation from each, based on your Speech skill and the amount of gold they are carrying.[/size][/*]\n<br />[size=2][b]30 - Bribery[/b] - Can bribe guards to ignore crimes.[/size][/*]\n<br />[size=2][b]30 - Kinship[/b] - Buy items for 15% less when trading with the same race.[/size][/*]\n<br />[size=2][b]30 - Irresistible Dance[/b] - Can Perform in combat to force the two nearest enemy people within 100 feet to dance spellbound, preventing them from acting and reducing their armor skills by 50 levels. Use again to stop.[/size][/*]\n<br />[size=2][b]30 - Serenade[/b] - Performing to members of the opposite sex yields twice as much gold and potentially small items.[/size][/*]\n<br />[size=2][b]40 - Business Relation[/b] - Create a bond with the next merchant you speak with. Buy items for 30% less from that specific merchant.[/size][/*]\n<br />[size=2][b]40 - Encore[/b] - Able to Perform multiple times per day.[/size][/*]\n<br />[size=2][b]40 - Golden Fiddle[/b] - Irresistible Dance now also forces daedra, undead and animals to listen spellbound.[/size][/*]\n<br />[size=2][b]40 - Windborne[/b] - Shouting summons up a divine wind, granting 30% extra attack damage and 15% increased movement speed for 15 seconds. This effect stacks.[/size][/*]\n<br />[size=2][b]50 - Force Redoubled (2)[/b] - 25/50% chance to reduce the cooldown of any shout to 3 seconds.[/size][/*]\n<br />[size=2][b]50 - Salesman[/b] - Can sell any type of item to any kind of merchant.[/size][/*]\n<br />[size=2][b]50 - Speak with Animals[/b] - Can Activate animals to tame them, forcing them to follow you anywhere you go and fight for you until released. You can only have one Wild Companion at a time. Use the \"Release Companion\" power to release your Wild Companion.[/size][/*]\n<br />[size=2][b]60 - Earthquake Drum[/b] - Can Perform in combat to unleash shockwaves. Each drumbeat deals 50 points of damage to nearby enemies within 30 feet. Use again to stop.[/size][/*]\n<br />[size=2][b]60 - Hurricane Force[/b] - Shouts that affect others are 1% more powerful per level of Speech.[/size][/*]\n<br />[size=2][b]60 - Investor[/b] - Can invest 500 gold with a shopkeeper to increase his or her available gold by 500 permanently.[/size][/*]\n<br />[size=2][b]70 - Fence[/b] - Can barter stolen goods with any merchant.[/size][/*]\n<br />[size=2][b]70 - Horn of Sovngarde (2)[/b] - Grants the \"Horn of Sovngarde\" power. Once a day, blow a horn to call the nearest three friendly people (except followers) within 200 feet to follow you for 600 seconds/one ingame day.[/size][/*]\n<br />[size=2][b]70 - Thu'um of War[/b] - Your shouts stagger nearby enemies within 25 feet, reducing armor rating by 300 points for 10 seconds and knocking enemies below 25% Health to the ground.[/size][/*]\n<br />[size=2][b]80 - Gift of Kynareth[/b] - Improves your Wild Companion. Wolves gain 100% extra attack damage. Spiders gain magic immunity. Bears gain 150 points of Health. Chaurus gain 300 points of armor. Saber cats gain 40% movement speed and move silently.[/size][/*]\n<br />[size=2][b]80 - Merciless Storm[/b] - Grants the \"Merciless Storm\" power. Once a day, cancels an active shout cooldown, allowing you to shout again immediately afterwards.[/size][/*]\n<br />[size=2][b]80 - Witching Rhythm[/b] - Earthquake Drum deals 50% more damage. Each beat of Earthquake Drum also briefly reduces the magic resistance of affected enemies by 200% for 0.4 seconds.[/size][/*]\n<br />[size=2][b]90 - Lord of the Dance[/b] - Irresistible Dance can affect up to five enemies.[/size][/*]\n<br />[size=2][b]90 - War Drummer[/b] - Each beat of Earthquake Drum also heals nearby allies by up to 20 points based on their missing Health percentage, and grants them 100% extra attack damage for 0.4 seconds.[/size][/*]\n<br />[size=2][b]90 - Trade Prince[/b] - Every merchant in the world gains 1000 gold for bartering.[/size][/*]\n<br />[size=2][b]100 - Dovahzulaan[/b] - For 120 seconds after using Merciless Storm, any shout you use also carries the previous shout.[/size][/*]\n<br />\n<br />[size=4][color=#aa8888]Two-Handed\n<br />[/color][/size]\n<br />[size=2][b]0 - Two-Handed Mastery (2)[/b] - Two-handed weapons do 25/50% more damage./, and critical strikes with two-handed weapons do 2% more critical damage per level of Two-Handed.[/size][/*]\n<br />[size=2][b]20 - Trained Fighter[/b] - Reduces the Stamina cost of power attacks with two-handed weapons by 20 points.[/size][/*]\n<br />[size=2][b]30 - Bleed Like a Dog (3)[/b] - Attacks with battle axes deal an additional 2/3/4 points of damage per second for 3 seconds to living targets. When the bleeding stops, they take damage equal to 20/25/30% of the Health they lost while bleeding.[/size][/*]\n<br />[size=2][b]30 - Clash of Heroes (3)[/b] - Attacks with greatswords reduce the target's attack damage by 15/20/25% for 3 seconds.[/size][/*]\n<br />[size=2][b]30 - Crushing Blows (3)[/b] - Attacks with warhammers reduce the armor rating of armored enemies by 75/100/125 points for 15 seconds.[/size][/*]\n<br />[size=2][b]40 - Batter (2)[/b] - Power attacks with a warhammer have 15/25% chance of a critical strike. All critical strikes with a warhammer deal double critical damage.[/size][/*]\n<br />[size=2][b]40 - Ferocious Strength[/b] - Power attack damage with two-handed weapons increased by 15% plus 0.1% per point of Stamina. Unlocks decapitations.[/size][/*]\n<br />[size=2][b]40 - Maul (2)[/b] - Power attacks with a greatsword destabilize a target, increasing the damage of your regular attacks against the target by 25/50% for 5 seconds.[/size][/*]\n<br />[size=2][b]40 - Rive (2)[/b] - Power attacks with a battle axe ignore 25/50% armor.[/size][/*]\n<br />[size=2][b]50 - Avalanche[/b] - Forwards power attacks with a warhammer daze a target for 10 seconds, causing the target to stagger when struck by any unblocked attack.[/size][/*]\n<br />[size=2][b]50 - Breach the Wall[/b] - Forwards power attacks with a greatsword that would leave the target above 60% Health deal enough additional damage to make up the difference.[/size][/*]\n<br />[size=2][b]50 - Execute[/b] - Forwards power attacks with a battle axe execute targets below 30% Health, delivering a critical strike that deals twenty times critical damage.[/size][/*]\n<br />[size=2][b]50 - Trample[/b] - Can perform a two-handed sprinting power attack that deals up to 50% more damage and critical damage to a target above half Health. The higher its remaining Health percentage, the more damage and critical damage is dealt.[/size][/*]\n<br />[size=2][b]60 - Death or Glory[/b] - Two-handed power attacks deal up to 100% more damage below half Health. The damage bonus increases as your Health decreases.[/size][/*]\n<br />[size=2][b]60 - Decimate[/b] - Sideways power attacks with a battle axe hit all targets in front of you. This deals 20% more damage for each enemy within 8 feet.[/size][/*]\n<br />[size=2][b]60 - Subjugate[/b] - Sideways power attacks with a greatsword hit all targets in front of you, lowering attack speed to 50% for 10 seconds. This effect has a 20 second cooldown per target.[/size][/*]\n<br />[size=2][b]60 - The Pendulum[/b] - Sideways power attacks with a warhammer hit all targets in front of you. When this hits a target twice within 10 seconds, the second hit knocks the target to the ground, dealing 50% more damage and a critical strike that does double critical damage.[/size][/*]\n<br />[size=2][b]70 - Bisect[/b] - Standing power attacks with a battleaxe deal bonus damage equal to 15% of a target's current Health (max. 150 damage).[/size][/*]\n<br />[size=2][b]70 - Grand Slam[/b] - Whenever a standing power attack with a warhammer inflicts a critical strike, it deals 3% more critical damage per point of Stamina.[/size][/*]\n<br />[size=2][b]70 - Humiliate[/b] - Standing power attacks with a greatsword fatigue a target, draining 150 points of Magicka and Stamina and halting regeneration for 5 seconds.[/size][/*]\n<br />[size=2][b]70 - Massacre[/b] - In combat, swinging a two-handed weapon has 10% chance to increase attack speed by 175% for 3 seconds.[/size][/*]\n<br />[size=2][b]80 - Deadfall[/b] - Bashing with a warhammer to interrupt an attack before it hits allows you to follow up with a power attack within 2 seconds to crush the attacker, reducing their armor by 500 points for 5 seconds.[/size][/*]\n<br />[size=2][b]80 - Overthrow[/b] - Bashing with a greatsword to interrupt an attack before it hits allows you to follow up with a power attack within 2 seconds to deliver a critical strike that deals three times critical damage and disarms them.[/size][/*]\n<br />[size=2][b]80 - Ram's Head[/b] - Bashing with a battle axe to interrupt an attack before it hits allows you to follow up with a power attack within 2 seconds to knock them to the ground.[/size][/*]\n<br />[size=2][b]80 - Wolfkin[/b] - After performing 2 or more consecutive two-handed power attacks in combat, your next two-handed regular attack manifests a Spirit Wolf for 30 seconds that deals 15 bonus damage for each power attack.[/size][/*]\n<br />[size=2][b]90 - Bear Hide[/b] - You take half damage from enemy attacks while power attacking with a two-handed weapon.[/size][/*]\n<br />[size=2][b]90 - Enter the Arena[/b] - Massacre always activates when you take your first two-handed swing in combat. This effect has a 30 second cooldown.[/size][/*]\n<br />[size=2][b]90 - Voice of Rage and Ruin[/b] - In combat, swinging a two-handed weapon has 4% chance to activate your currently equipped power.[/size][/*]\n<br />[size=2][b]100 - Slayer of a Thousand Sons[/b] - In combat, two-handed weapons deal 5% more damage for each humanoid or animal you have slain in the previous battle, up to 40%.[/size][/*]\n<br />\n<br />[size=5][color=#9999AA]Other features[/color][/size]\n<br />\n<br />[size=4][color=#AA8877]Optional thief skills rebalance[/color][/size]\n<br />\n<br />To go with the new thief perks, there is an optional file available on the downloads page that modifies many game settings related to sneaking, lockpicking and pickpocketing to improve the thief experience: the effectiveness of sneaking now depends more on light level and movement and less on skill level, the pickpocket cap is 95%, and more. A full list of changes is in the Readme.\n<br />\n<br />This file is optional. If you want to use a different thief skills overhaul, a combat overhaul that includes stealth changes or if you prefer the vanilla settings, do not use this file.\n<br />\n<br />[size=4][color=#AA8877]NPCs gain Ordinator perks[/color][/size]\n<br />\n<br />Ordinator replaces vanilla perks used by NPCs with equivalent new weapon, magic and/or armor perks. For instance, if a spellcaster has Intense Flames level 1 in vanilla, this perk is replaced with Combustion level 1 and Scarring Burns level 1 from Ordinator.\n<br />\n<br />[size=5][color=#9999AA]FAQ[/color][/size]\n<br />\n<br />[size=4][color=#AA8877]Compatibility notes[/color][/size]\n<br />\n<br />See [url=http://www.nexusmods.com/skyrimspecialedition/articles/22/?]here[/url] for a list of (in)compatible mods.\n<br />\n<br />[size=4][color=#AA8877]How to install or uninstall[/color][/size]\n<br />\n<br />[color=#777777][b]To install:[/b][/color] Add the mod to your load order and activate it. If your character is level 2 or up, installing the mod will start a perk refund process. This can take up to several minutes, so sit back and wait until the game displays a message telling you that the process is complete. This process will not refund perks from other mods; if you are switching from a different perk mod, follow the instructions it provides to cleanly uninstall it first, or make every skill legendary before uninstalling it to get your points back.\n<br />\n<br />[color=#777777][b]To uninstall:[/b][/color] Manually respec (see below) to get all your perk points back, then remove the mod.\n<br />\n<br />[size=4][color=#AA8877]Troubleshooting\n<br />[/color][/size]\n<br />[size=2][color=#777777][b]Can I manually respec (refund my perks)?[/b][/color] Bring 5 Daedra Hearts to a cooking pot and craft a Scroll of Legends. Alternatively, you can make the skill legendary or use the built-in respec feature in Dragonborn.[/size][/*]\n<br />[size=2][color=#777777][b]I can't put a point into some perks even though I meet the requirements:[/b][/color] You have another mod loaded below Ordinator that modifies those perks, reverting their prerequisites to vanilla Skyrim. In most cases, the perk modifications in said other mod are not that important and you can load it above Ordinator and let Ordinator take precedence.[/size][/*]\n<br />[size=2][color=#777777][b]Some perks or skill trees are still vanilla:[/b][/color] You have another mod loaded below Ordinator that modifies the same perks or skill trees, overriding them with the vanilla ones. Load it above Ordinator.[/size][/*]\n<br />[size=2][color=#777777][b]There are several perks named \"NPC Perk\":[/b][/color] You have another mod loaded below Ordinator that modifies the same skill trees, overriding them with the vanilla ones. Load it above Ordinator.[/size][/*]\n<br />[size=2][color=#777777][b]The perks Ranger, Quick Shot and Block Runner have no effect:[/b][/color] These are vanilla Skyrim perks with a peculiar bug. If you had those perks at any point during your playthrough, removing them does not remove the effect. Additionally, Ranger in particular has another bug where it has no effect if you take the perk while sneaking. Note that all of this also applies to the same perks in the vanilla game. See [url=http://www.uesp.net/wiki/Skyrim:Archery]the UESP page[/url] for more information.[/size][/*]\n<br />[size=2][color=#777777][b]Fistfights (brawls) immediately end or turn into a real fight:[/b][/color] The \"[b]Brawl Bug[/b]\" is a common issue with many gameplay mods and hard to avoid due to the way Skyrim brawls are implemented. Ordinator comes with a copy of the [color=#aaffaa]Modern Brawl Bug Fix[/color] included to solve this issue. If it does not, you may have the outdated [color=#ffaaaa]Brawl Bugs Patch[/color] in your load order after Ordinator (as a standalone mod or included with another mod such as Enhanced Blood Textures). Either remove it or add the [url=https://www.nexusmods.com/skyrim/mods/77465]Modern Brawl Bug Fix[/url] to the end of your load order.[/size][/*]\n<br />[size=2][color=#777777][b]Perk descriptions are truncated on 4:3 aspect ratio monitors:[/b][/color] This is a limitation of Skyrim. Use the [url=http://www.nexusmods.com/skyrim/mods/57873/?]Extended UI[/url] mod.[/size][/*]",
  "categoryId": "79",
  "version": "9.26",
  "author": "Enai Siaion",
  "createdUnix": "1438523134",
  "updatedUnix": "1506707508",
  "containsAdultContent": false,
  "uploadedBy": "EnaiSiaion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000189159",
      "name": "Ordinator v516",
      "version": "5.16",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9365",
      "fileName": "Ordinator v516-68425-5-16.zip",
      "uploadedUnix": "1451177134",
      "modVersion": "5.16",
      "virusScanUrl": "https://www.virustotal.com/file/792b6ca124b1f5028fff4371a16d84c74d4337817cd4b2fa448917ca76e0d670/analysis/1451177264/",
      "changelogHtml": " Customary music video: https://www.youtube.com/watch?v=f2yJzMgaUAk \r<br />\r<br />Alteration \r<br />- Intuitive Magic: now reduces the cost of the player version of Vampiric Drain instead of the NPC version. \r<br />- Reverie: now works correctly with Lover&#39;s Comfort. \r<br />\r<br />Conjuration \r<br />- Rend From This World: now uses vanilla soul trap mechanics, allowing Acquisitive Soul Gems to affect it. \r<br />\r<br />Destruction \r<br />- Unlinked Ancient Seals. (Redundant with Demolition Mission.) \r<br />\r<br />Enchanting \r<br />- Wonderseeker: changed description. \r<br />\r<br />Illusion \r<br />- Added Ghost of the Tenth Eye. \r<br />- Removed Mortal Fear. \r<br />- Renamed Quiet Casting to Whispers of Doom. (Modified vanilla perks should have a different name than the corresponding vanilla perk, so when another mod changes the same perk and causes a conflict, players are aware of it before they run into it 20 hours later when trying to acquire the perk.) \r<br />\r<br />- Crown of the False King: updated description. \r<br />- Mind Killer: corrected description. \r<br />- Pandemonium: corrected description. \r<br />- Protect Your God: ability is now disabled during brawls. \r<br />- Psychic Vampire: corrected description. \r<br />\r<br />Sneak \r<br />- fCombatSearchExteriorRadiusMin: 1280 -&gt; 1536 \r<br />- fCombatSearchExteriorRadiusMax: 2048 -&gt; 2560 \r<br />- fCombatSearchInteriorRadiusMin: 768 -&gt; 1024 \r<br />- fCombatSearchInteriorRadiusMax: 1280 -&gt; 1536 \r<br />- fCombatSearchWanderDistance: 512 -&gt; 768 \r<br />\r<br />- Added Right Behind You. \r<br />- Renamed Quiet Before the Storm to Infiltrator. (Overly dramatic name for a simple effect.) \r<br />\r<br />- Behind Enemy Lines: Disengage is no longer an optional requirement, but Right Behind You is. \r<br />- Demolition Mission: now makes an exception for runes, boosting them x3 -&gt; x5. \r<br />- Smoke Curtain: changed requirement from level 50 -&gt; 60. \r<br />- Spot Detection: changed requirement from Silent Roll -&gt; Sneak Mastery. \r<br />\r<br />For fun, here are a few perks that didn&#39;t make it into the mod, but still have some resources lying around: \r<br />\r<br />- (Alchemy) Peryite&#39;s Perfume: the ability to craft thrown grenades; cancelled due to overlap with alchemy mods.\r<br />- (Alteration) Bioluminescence: glow in the dark, much like Arkenlight from Dwemertech; cancelled because annoying.\r<br />- (Alteration) College Life: gradually gain permanent Alteration bonuses for being in Winterhold College, and when going afk in Winterhold College, your character would autonomously do research and study; cancelled because permanent stacking bonuses make people nervous.\r<br />- (Alteration) Transmute Clutter: when picking up clutter objects, offered a second option to turn them into their corresponding gold value; cancelled because constant popups are annoying.\r<br />- (Alteration) Winterhold Express: casting specific spells on the Winterhold College grounds launched you into the air, where you could either teleport to a target location or just flew to a chosen city; cancelled after I fell through the Windhelm bridge because it didn&#39;t load fast enough in front of me.\r<br />- (Archery) Blanket Shot: shooting an arrow also fires a cone of damage in front of you; cancelled because the cone did 0 damage.\r<br />- (Archery) Strafe (called Snipe for no reason): pulling and holding an arrow would rapidly shoot a stream of ghost arrows until you fired the arrow; cancelled because the arrows were shot at 0 pull strength, so I had to replace them all with custom arrows that fly straight, leading to compatibility issues with third party bow mods.\r<br />- (Destruction) Signature Spell: increased the power and mana cost of any chosen spell to master level.\r<br />- (Heavy armor) Swagger: take half damage while staggered.\r<br />- (Illusion) Dream Disguise: yes, I considered this, no, I didn&#39;t do it for reasons stated elsewhere. \r<br />- (Illusion) Precipice of Madness: applying multiple mind affecting spells in a row would cause the AI to perform random actions; cancelled because there aren&#39;t enough things for the AI to do.\r<br />- (Illusion) The Reaper Comes: a deadly ghost would hunt you down and try to kill you, but also attack your enemies; cancelled because waiting would teleport the ghost to you and instantly kill you.\r<br />- (Pickpocket) The Tail: periodically summons assassins that track you down, but drop nice loot; cancelled because constant attacks while waiting was annoyung.\r<br />- (Pickpocket) Trouble Magnet: would split up enemy camps by having one enemy from each camp actively seek you out and attack you; cancelled because you could just sit and repeatedly wait and draw them out one by one.\r<br />- (Smithing) Daughter of the Forge: the idea was that newly forged weapons would be stronger for 1 hour after forging them; cancelled because the game had no way to accomplish this. \r<br />- (Sneak) Rappel: the ability to pull yourself up on a rope to become undetectable but immobile; cancelled because no good animation.\r<br />- (Sneak) The Box: when sneaking and not moving, turned you into an inconspicuous crate; cancelled because no way to turn player invisible but not an attached art object.\r<br />- (Speech) Power Word Kill: the ability to kill NPCs through the dialogue system; cancelled because adding dialogue options led to tons of complaints when it was Nord Kinship in Excellent. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v516-68425-5-16.zip?fid=1000189159&ttl=1535856768&ri=8192&rs=8192&setec=1032eb2bb97e87a28f0e21f231dd6e9d"
    },
    {
      "fileId": "1000195809",
      "name": "Ordinator v600",
      "version": "6.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "10193",
      "fileName": "Ordinator v600-68425-6-00.zip",
      "uploadedUnix": "1455601521",
      "modVersion": "6.00",
      "virusScanUrl": "https://www.virustotal.com/file/6d9e43b19c1d112b14f4f23bd299162a7accf5f75dc0dbbd56c6c40bf15db06d/analysis/1455601577/",
      "changelogHtml": " Massive bugfix for one-handed weapons, overhaul of all combat trees and stealth. Critical strike is now a valid stat, due to the addition of a +2%/level multiplier on the second level of each tree&#39;s Mastery. Music video: https://www.youtube.com/watch?v=Uo5yd1LNALg (this guy needs more attention)\r<br />\r<br />Alchemy\r<br />- Advanced Lab: can now be disassembled within 1.5 seconds after sneaking (but now you have to remain in sneak mode for 0-1 seconds first) to fix a race condition where slow script execution may result in the sneak state being removed before it is actually checked; updated description.\r<br />\r<br />Alteration\r<br />- Added Throne of Nirn.\r<br />- Removed Mana Shield. (You can give yourself a copy with the console.)\r<br />- Geomancer, Philosopher&#39;s Stone, Stability: changed prerequisite to Alteration Mastery.\r<br />- Philosopher&#39;s Stone: improved gold gain from 50% -&gt; 100% of your alteration level. (Not retroactive.)\r<br />\r<br />Archery\r<br />- Archery Mastery; second level now also increases crit damage by 2% per level of Archery.\r<br />- Snipe: increased crit multiplier from x1 -&gt; x5 but removed bonus damage.\r<br />- Takedown: increased crit multiplier from x1 -&gt; x3.\r<br />\r<br />Block\r<br />- Mocking Blow: updated to accomodate Overthrow/Ram&#39;s Head/Deadfall.\r<br />- Poke the Dragon: now includes +25% critical strike damage.\r<br />\r<br />Conjuration\r<br />- Added Rat King.\r<br />- Bone Collector: improved bone drop rate. thank mr skeltal\r<br />- Edge of Oblivion: now reduces armor and magic resistance instead of dealing damage; changed prerequisites to Atromancy or Ravenous Dead; updated description; removed sound effect.\r<br />- Reap And Sow: improved level 1 from 50% -&gt; 60% drop rate.\r<br />\r<br />Destruction\r<br />- Nova Charge: now easier to use (threshold: 40 -&gt; 25, reset: 25 -&gt; 15).\r<br />- Pyromancer Ascension: now easier to use (threshold: 40 -&gt; 25, reset: 25 -&gt; 15).\r<br />\r<br />Enchanting\r<br />- Arcane Nexus: can now be disassembled within 1.5 seconds after sneaking (but now you have to remain in sneak mode for 0-1 seconds first) to fix a race condition where slow script execution may result in the sneak state being removed before it is actually checked; updated description.\r<br />\r<br />Heavy Armor\r<br />- Break Upon Me: updated to reflect functionality changes of other perks.\r<br />\r<br />Illusion\r<br />- Added Unto The Masses.\r<br />- Removed Incubus. (You can give yourself a copy with the console.)\r<br />- Renamed Whispers of Doom -&gt; Quiet Casting and changed prerequisite to Illusion Mastery.\r<br />- Fear the Reaper: changed prerequisite to Psychic Vampire.\r<br />- Heavy Weighs the Tapestry: changed level requirement from 80 -&gt; 90.\r<br />- Lamb to the Slaughter: changed level requirement from 90 -&gt; 80.\r<br />\r<br />Light Armor\r<br />- Lightning Strike: now correctly multiplies critical strike damage instead of chance (which made it almost entirely useless); reduced multiplier from x2 -&gt; x1.5.\r<br />\r<br />One-Handed\r<br />A major overhaul to most weapon types.\r<br />\r<br />- Changed the priorities of many Combat Hit Spells. Duplicate priorities would prevent one of them from working EVEN when the other one doesn&#39;t activate because its conditions are not met. This led to several perks not working if you took another perk on the same row (now you know why Toll The Bell failed for some people). A full list of priorities is in the Readme.\r<br />- Cleaned up many NPC perks.\r<br />- Added And Stay Down.\r<br />- Added Bleed Like a Lamb.\r<br />- Added Clash of Champions.\r<br />- Added Claw Marks.\r<br />- Added Into the Dust.\r<br />- Added Man O&#39;War.\r<br />- Added Windswept.\r<br />- Removed Among Mere Mortals.\r<br />- Removed Cripple.\r<br />- Removed Iron Law.\r<br />- Removed Open Wounds.\r<br />- Removed Tiring Assault.\r<br />- Renamed Crimson Glory -&gt; Apex Predator.\r<br />- Reworked Attack of Opportunity: is now a different perk with only one level and much more effective, including a critical strike if you match your hit with the target.\r<br />- Reworked Onslaught -&gt; Overwhelm: changed from 50% -&gt; 100% crit chance but reduced duration from 5 -&gt; 2 seconds and power from x2/4 -&gt; x1.5/3 (due to One-Handed Mastery buff); now only works if unblocked; no longer dispelled on the first power attack; updated description.\r<br />- Reworked Smite: changed from crit damage vs undead -&gt; large crit on your first power attack with a mace against a target, improved vs undead.\r<br />- Apex Predator: now only works on living targets.\r<br />- Cross Cut: reduced duration from 5 -&gt; 4 seconds; reduced damage bonus from 50% -&gt; 40%; removed annoying shader.\r<br />- Go for the Throat: now also deals a critical strike with a multiplier equal to double the power attack damage bonus.\r<br />- Mangle: improved damage bonus from 15/30% -&gt; 20/40%. (Note: getting Mangle off with a regular axe is a matter of precise timing, but dual wield makes it easy.)\r<br />- One-Handed Mastery; second level now also increases crit damage by 2% per level of One-Handed.\r<br />- Shieldbiter: improved crit multiplier from x3 -&gt; x5.\r<br />- Thousand Cuts: reduced threshold from 15 -&gt; 10 cuts; changed description to reflect its disconnect from Tiring Assault.\r<br />\r<br />Restoration\r<br />- Mage Ward: no longer requires &#34;dual&#34; casting; description is now correct.\r<br />\r<br />Smithing\r<br />- Advanced Workshop: can now be disassembled within 1.5 seconds after sneaking (but now you have to remain in sneak mode for 0-1 seconds first) to fix a race condition where slow script execution may result in the sneak state being removed before it is actually checked; updated description.\r<br />\r<br />Sneak\r<br />- fCombatDetectionLostTimeLimit: 120 -&gt; 45 (vanilla 10)\r<br />- fCombatStealthPointRegenAttackedWaitTime: 300 -&gt; 25 (vanilla 15)\r<br />- fDetectionStateExpireTime: 180 -&gt; 90 (vanilla 30)\r<br />- fDetectionUpdateTimeMaxComplex: 2 -&gt; 3.5 (vanilla 5)\r<br />- fDetectionUpdateTimeMinComplex: 1 -&gt; 1.5 (vanilla 2.5)\r<br />- fSneakLightMult: 0,55 -&gt; 0.4 (vanilla 0.33)\r<br />- fSneakSkillMult: 0,25 -&gt; 0,4 (vanilla 0.5)\r<br />- Changed layout of perk tree to offer more guidance.\r<br />\r<br />- Added Escape Artist.\r<br />- Added Mystery Killer.\r<br />\r<br />- Behind Enemy Lines: no longer also drains a target&#39;s SneakPowerMod by 15%; no longer erroneously causes a sound event.\r<br />- Cloak and Dagger: now also increases crit damage.\r<br />- Disengage: improved description.\r<br />- Infiltrator: changed from 50% noise reduction (+50% when not running) -&gt; 75%.\r<br />- Leaping Shadow: no longer available to NPCs.\r<br />- Shadow Warrior: fixed description.\r<br />\r<br />Two-Handed\r<br />A major overhaul to most weapon types.\r<br />\r<br />- Changed the priorities of many Combat Hit Spells. Duplicate priorities would prevent one of them from working EVEN when the other one doesn&#39;t activate because its conditions are not met. This led to several perks not working if you took another perk on the same row. A full list of priorities is in the Readme.\r<br />- Cleaned up many NPC perks.\r<br />- Added Bleed Like a Dog.\r<br />- Added Clash of Heroes.\r<br />- Added Deadfall.\r<br />- Added Enter the Arena.\r<br />- Added Overthrow.\r<br />- Added Ram&#39;s Head.\r<br />- Removed Exhausting Assault.\r<br />- Removed Falling Star.\r<br />- Removed Gnarly Wounds.\r<br />- Removed Hemorrhage.\r<br />- Removed Into The Dust.\r<br />- Renamed Grindhouse -&gt; Massacre.\r<br />- Renamed Razor Wind -&gt; Decimate.\r<br />- Batter: reduced level 2 chance from 30% -&gt; 25%.\r<br />- Bear Hide: removed prerequisite link from Massacre.\r<br />- Execute: reduced crit damage multiplier from x30 -&gt; x20 (still freaking good).\r<br />- Grand Slam: reduced crit damage multiplier from 4% -&gt; 2% to account for Two-Handed Mastery; no longer erroneously reduces crit damage at low Stamina.\r<br />- Maul: updated description.\r<br />- Rive: removed useless conditions.\r<br />- Steel of the Ancients: now correctly excluded by ASIS.\r<br />- The Pendulum: no longer erroneously applies a 75% bonus to not just the second hit but also the initial hit and any other power attacks for its duration (NO ONE NOTICED WTF); added critical strike; increased knockdown force.\r<br />- Two-Handed Mastery; second level now also increases crit damage by 2% per level of Two-Handed.\r<br />\r<br />Note about Overthrow/Ram&#39;s Head/Deadfall: these perks are a little more picky than the usual &#34;while attacking&#34; condition. They only work if you bash the target during the wind-up of their attack and not if they already hit you and are finishing their swing. I intend to use this a lot in Swordfall to reward timing instead of random flailing. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v600-68425-6-00.zip?fid=1000195809&ttl=1535856768&ri=8192&rs=8192&setec=23a95144c39f56082acc09e817fb1191"
    },
    {
      "fileId": "1000211236",
      "name": "Ordinator v745",
      "version": "7.45",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11801",
      "fileName": "Ordinator 745-68425-7-45.zip",
      "uploadedUnix": "1466966322",
      "modVersion": "7.45",
      "virusScanUrl": "https://www.virustotal.com/file/26c8abb24df4696d421725edfce61621e4f17ca21b878f6d402dd9af67eb7953/analysis/1466966345/",
      "changelogHtml": " Music video: https://www.youtube.com/watch?v=c_vYIT2sxo0\r<br />\r<br />Archery\r<br />- Perfect Aim: improved script speed.\r<br />\r<br />I tried Arcane Archer, a perk that adds elemental damage of your choice to arrows. It worked fine, but the effect felt so underwhelming that I got rid of it again.\r<br />\r<br />Block\r<br />- Apocalypse Proof: improved script speed in most situations by fast failing non-hostile spells at the cost of minor speed loss when struck by an elemental spell.\r<br />- Mocking Blow: added ASIS exclusion suffix; updated description.\r<br />- Poke the Dragon: removed stagger effect; added range limit.\r<br />- Timed Block: added stagger effect; block effectiveness bonus reduced from 40% -&gt; 30%.\r<br />- Timing Streak: slightly improved script speed.\r<br />\r<br />Note: reducing elemental damage with Apocalypse Proof counts as a successful timed block for the purpose of resetting the cooldown on Timed Block and applying Poke the Dragon to a target within 8 feet, but will not stagger the attacker and will not trigger the sound or message.\r<br />Note: your timing streak is not reset when you get bashed, regardless of whether or not you (attempt to) block the bash.\r<br />\r<br />Conjuration\r<br />- Renamed Sympathetic Magic -&gt; Puppet Master.\r<br />- King of Bones: now correctly reduces damage taken by half instead of 40%.\r<br />\r<br />Destruction\r<br />- Conflagration: reduced ground fire damage from 15 -&gt; 10 damage per second, but the duration is now correctly 3 seconds instead of 2.\r<br />- Force of Nature: no longer increases spell magnitude.\r<br />- Scarring Burns: reduced fire resistance penalty from 30% -&gt; 25%.\r<br />- Stormblast: increased delay between procs from 2-15 seconds -&gt; 4-15 seconds.\r<br />\r<br />One-Handed\r<br />- Man O&#39;War: stacks fall off after 30 -&gt; 20 seconds.\r<br />\r<br />Sneak\r<br />- Renamed Escape Artist -&gt; Clean Escape.\r<br />\r<br />Dragonborn Respec\r<br />- Smithing material perks are no longer refunded twice. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20745-68425-7-45.zip?fid=1000211236&ttl=1535856768&ri=8192&rs=8192&setec=eb534228de178dae43317c782dae8000"
    },
    {
      "fileId": "1000228061",
      "name": "Thief Skills Rebalance for Ordinator",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Thief Skills Rebalance for Ordinator-68425-.zip",
      "uploadedUnix": "1479064651",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c389e5f5db488e0360cffc9178e5e7c8502e734317339bca321c14a867eec3ec/analysis/1479064682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thief%20Skills%20Rebalance%20for%20Ordinator-68425-.zip?fid=1000228061&ttl=1535856769&ri=8192&rs=8192&setec=6128232e5c3a7b8cd923d5febc955cae"
    },
    {
      "fileId": "1000229305",
      "name": "Ordinator v816",
      "version": "8.16",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12366",
      "fileName": "Ordinator v816-68425-8-16.zip",
      "uploadedUnix": "1480276785",
      "modVersion": "8.16",
      "virusScanUrl": "https://www.virustotal.com/file/18468b4a1a639926f163268ab2949a43e26bb73ce56f52332a41e53a2c614026/analysis/1480276805/",
      "changelogHtml": " Alteration\r<br />- Wild Shrines: fixed ability descriptions.\r<br />\r<br />Archery\r<br />- Three Crows: first hit is free instead of attempting to do hit detection, making it more reliable.\r<br />\r<br />Enchanting\r<br />- Spellscribe: no longer disabled while using an unarmed weapon, due to side effects.\r<br />\r<br />Pickpocket\r<br />- Thief&#39;s Eye: now uses a keyword check instead of a magic effect check.\r<br />\r<br />Speech\r<br />- Horn of Sovngarde: added error when carrying a shield.\r<br />- Performer: added error when carrying a shield. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v816-68425-8-16.zip?fid=1000229305&ttl=1535856770&ri=8192&rs=8192&setec=aa2a413ebaa7715ea5efa89ee9d314a7"
    },
    {
      "fileId": "1000232309",
      "name": "Ordinator v830",
      "version": "8.30",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12403",
      "fileName": "Ordinator v830-68425-8-30.zip",
      "uploadedUnix": "1483114164",
      "modVersion": "8.30",
      "virusScanUrl": "https://www.virustotal.com/file/f4b2dbbc29c4dd0b3bbb791cc39d09850f372bba8a1cd449f838db8e8e43c0a3/analysis/1483114206/",
      "changelogHtml": " You may want to respec before updating if you have any of these perks.\r<br />\r<br />The new Vancian Magic implementation is highly experimental. It works on a technical level, but may need some tuning in later updates if spells are too plentiful. \r<br />\r<br />Alteration \r<br />- Added Vancian Magic. \r<br />- Added Quadratic Wizard. \r<br />- Added Dungeon Master. \r<br />- Removed Innate Magic. \r<br />- Removed Chosen One. \r<br />- Removed Warrior-Prophet. \r<br />\r<br />Pickpocket \r<br />- Pickpocket Mastery: changed to an addition instead of multiplication. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v830-68425-8-30.zip?fid=1000232309&ttl=1535856770&ri=8192&rs=8192&setec=358cc57c5e975a87051c0159a6dc98a2"
    },
    {
      "fileId": "1000237811",
      "name": "Ordinator v906",
      "version": "9.06",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12417",
      "fileName": "Ordinator v906-68425-9-06.zip",
      "uploadedUnix": "1488481788",
      "modVersion": "9.06",
      "virusScanUrl": "https://www.virustotal.com/file/4eecdd6effc64140d44d3eebe6be3c5c59e3f861dd0492e500d8a198179c30fd/analysis/1488482085/",
      "changelogHtml": " I broke my vow not to update any more perks, due to one perk being broken and the other being utterly unwanted. Music video: https://www.youtube.com/watch?v=CMmYTSH2j2o\r<br />\r<br />Conjuration \r<br />- Replaced Daedra&#39;s Due -&gt; Summon Resist. \r<br />\r<br />- Corpse Gas: corrected description. \r<br />- Edge of Oblivion: corrected description. \r<br />- March of Oblivion: corrected description. \r<br />- Preservation: corrected description. \r<br />- Undead Crown: corrected description. \r<br />\r<br />(Boneman/Mistman/Wrathman go under &#34;conjured undead&#34;. Seeker isn&#39;t anything.) \r<br />\r<br />Restoration \r<br />- Replaced Duel Ward -&gt; Antimagic Field. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v906-68425-9-06.zip?fid=1000237811&ttl=1535856771&ri=8192&rs=8192&setec=761cda9a9371913de7443538d41309a5"
    },
    {
      "fileId": "1000240798",
      "name": "Ordinator v824",
      "version": "8.24",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12388",
      "fileName": "Ordinator v824-68425-8-24.zip",
      "uploadedUnix": "1491262763",
      "modVersion": "8.24",
      "virusScanUrl": "https://www.virustotal.com/file/1e9ddb5e128cb6ba4fed0af49e6a5213c0026ef8e95d31022f5e4ea45af48871/analysis/1491263087/",
      "changelogHtml": " Alteration\r<br />- Innate Magic: now reduces Magicka cost by half instead of full.\r<br />\r<br />Archery\r<br />- Archery Mastery: fixed description.\r<br />\r<br />Pickpocket\r<br />- Thief&#39;s Eye: no longer spams the Thief&#39;s Luck dialogue. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v824-68425-8-24.zip?fid=1000240798&ttl=1535856771&ri=8192&rs=8192&setec=28f8c6073307a50c3ffe765b0ba8df6c"
    },
    {
      "fileId": "1000244197",
      "name": "Ordinator v915",
      "version": "9.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12685",
      "fileName": "Ordinator v915-68425-9-15.zip",
      "uploadedUnix": "1494681619",
      "modVersion": "9.15",
      "virusScanUrl": "https://www.virustotal.com/file/6b96f0325235309359431138e2e7fbc319669cd4250dba8329e4da913ee5bc3a/analysis/1494681947/",
      "changelogHtml": " Minor fixes.\r<br />\r<br />Misc\r<br />- Sneak detector: implemented a failsafe in case of slow script execution.\r<br />\r<br />Alchemy\r<br />- Green Thumb: fixed description.\r<br />\r<br />Archery\r<br />- Hunter&#39;s Discipline: fixed description.\r<br />\r<br />Conjuration\r<br />- Bone Collector/Barrow Lord: increased duration of commands from 5 -&gt; 15 minutes. (Note that if skeletons would get unloaded, commands on them are lost.)\r<br />\r<br />Destruction\r<br />- Magnetize: fixed race condition that caused Magnetize to become permanent on dead actors if script execution lags behind.\r<br />\r<br />Enchanting\r<br />- Spellscribe: now only grants Enchanting experience in combat.\r<br />- Thunderstruck: changed enchantment bonus on power attacks from 30% -&gt; 25% (1H weapon)/50% (2H weapon).\r<br />\r<br />Heavy Armor\r<br />- Immortal: changed damage reduction from 75% below 15% (20%) Health -&gt; 25-75% below 30% (40%) Health, using a curve similar to Death or Glory.\r<br />\r<br />Lockpicking\r<br />- Percussive Maintenance: now also negates your critical damage and Denting Blows/Crushing Blows when hitting an automaton to repair it.\r<br />\r<br />One-Handed\r<br />- Into the Dust: reduced damage bonus per stack from 20% -&gt; 15%. (This was strictly better than Meteor Storm in most use cases.)\r<br />- Toll the Bell: improved script execution speed. (Many people would expect a nerf instead, but this has such a severe drawback that it risks becoming one of those perks constantly people want to respec out of if it loses its one hit power, which would be a terrible state for a mainline perk to be in.)\r<br />\r<br />Restoration\r<br />- Mage Ward: no longer causes invalid or negative WardPower values if interrupted early (not retroactive; respec).\r<br />\r<br />Speech\r<br />- Gift of Kynareth: now works correctly on Chaurus Reapers. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v915-68425-9-15.zip?fid=1000244197&ttl=1535856772&ri=8192&rs=8192&setec=16dbf93f257323f6421c4f8a4ef1ffb5"
    },
    {
      "fileId": "1000248161",
      "name": "Ordinator v918",
      "version": "9.18",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12686",
      "fileName": "Ordinator v918-68425-9-18.zip",
      "uploadedUnix": "1498763171",
      "modVersion": "9.18",
      "virusScanUrl": "https://www.virustotal.com/file/2e4ac6fdda6c51c71643bf051192184a101d297e160d416198f1438396d431ee/analysis/1498763448/",
      "changelogHtml": " I didn&#39;t plan on this update, but it seems like an easy win.\r<br />\r<br />Conjuration\r<br />- Bone Collector: skeletons now have a minimum level of 2 -&gt; 5 and maximum level of 20 -&gt; 30.\r<br />- Skeleton Mages: skeletons now have a minimum level of 7 -&gt; 8.\r<br />\r<br />Illusion\r<br />So many people have no idea what illusion magnitude means.\r<br />- Fickle Fate: now also affects Rally spells and effects; updated description.\r<br />- Illusion Mastery: now also increases the level cap of mind affecting spells by 0.1/0.2 per level.\r<br />- Kindred Mage: updated description to clarify that it affects spells and effects; now works correctly on shouts; now changes the spell description of your mind affecting spells to reflect the magnitude bonus against a target that is not the same race. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v918-68425-9-18.zip?fid=1000248161&ttl=1535856772&ri=8192&rs=8192&setec=e1dc43d9d46c47c6b4201fc0e2a1ceb5"
    },
    {
      "fileId": "1000248245",
      "name": "Ordinator v753",
      "version": "7.53",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12116",
      "fileName": "Ordinator v753-68425-7-53.zip",
      "uploadedUnix": "1498881780",
      "modVersion": "7.53",
      "virusScanUrl": "https://www.virustotal.com/file/4357be96a53314961f1afdcbb2a69b5964cecf0ccbdc44e2ab87cc901df94a04/analysis/1498882123/",
      "changelogHtml": " General\r<br />- Updated the included copy of the Modern Brawl Bug Fix to 1.04. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v753-68425-7-53.zip?fid=1000248245&ttl=1535856773&ri=8192&rs=8192&setec=bf0fa2aede96289f75b90c79b81a9537"
    },
    {
      "fileId": "1000248593",
      "name": "Ordinator v919",
      "version": "9.19",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12684",
      "fileName": "Ordinator v919-68425-9-19.zip",
      "uploadedUnix": "1499265672",
      "modVersion": "9.19",
      "virusScanUrl": "https://www.virustotal.com/file/260936e67bc90a89f00d4fc3f130ab394f614270e73860fd35450ada216b4d7c/analysis/1499266006/",
      "changelogHtml": " A smaller update than it looks, but with three major improvements:\r<br />- You can now farm bones regardless of how the NPC died;\r<br />- Thief&#39;s Eye is more foolproof;\r<br />- There&#39;s a new addon that offers an alternate way to get additional perk points.\r<br />Music video: https://www.youtube.com/watch?v=-FVnH-OcwNk\r<br />\r<br />Misc\r<br />- There is now an optional addon to give yourself more perk points whenever a skill reaches level 50, 75 or 100.\r<br />\r<br />Archery\r<br />- Three Crows: updated description for clarity.\r<br />\r<br />Conjuration\r<br />- Bone Collector: updated description to reflect correct level scaling; corpses can now be looted for bones regardless of who lands the killing blow, meaning you can now use any number of minions and mercs and still loot bones. There is a 200 foot range limit to this effect for performance reasons. (Revert to previous behaviour by typing &#39;set ORD_Con_BoneCollector_Global_UseAddLeveledList to 1&#39; into the console.)\r<br />- Conjure Altar: is now a lesser power (no cooldown).\r<br />- Skeleton Mages: reduced their spell cost from 10 -&gt; 5 so they don&#39;t get shut down by mods that force NPCs to have realistic mana costs; changed Destruction scaling from 0-300% -&gt; 100-300%; fixed glowing eye glitch.\r<br />\r<br />Enchanting\r<br />- Spellscribe: updated description to indicate that it now also triggers out of combat.\r<br />\r<br />Heavy Armor\r<br />- Immortal: removed sliding scale, now grants its full bonus at 15% Health (20% with Rallying Standard). (This perk used to crash. There is no reason why a perk that only contains entry points and no script or ability should ever crash, but it is not the first time, which seems to point to a perk related bug in the game engine itself. Since there is no hope of debugging this, the perk has been reworked to circumvent it.)\r<br />\r<br />Illusion\r<br />- Illusion Mastery: effects now correctly replace each other instead of stacking.\r<br />\r<br />One-Handed\r<br />There have been some complaints about &#34;random&#34; perks. The idea is not that every perk must make sense from a realistic standpoint, but that the perks encourage you to do cool or tricky stuff in battle. They are the equivalent of style bonuses.\r<br />- Coiling Python: updated description for improved immersion.\r<br />- Cross Cut: no longer requires the follow-up attacks to be specifically a sword.\r<br />- Split the Heavens: removed damage bonus; added 40 bleed damage over 20 seconds; updated description for improved immersion.\r<br />- Thundering Blow: updated description for improved immersion.\r<br />\r<br />Pickpocket\r<br />- Thief&#39;s Eye: removed &#34;player is arrested&#34; failure condition. (The game seems to get stuck in that state even when you are not in fact arrested until you pay off all bounties, causing the mark to escape every time.)\r<br />\r<br />Speech\r<br />- Earthquake Drum: reduced level requirement from 70 -&gt; 60.\r<br />- Encore: reduced level requirement from 60 -&gt; 50.\r<br />- Golden Fiddle: reduced level requirement from 50 -&gt; 40.\r<br />- Irresistible Dance: increased radius from 40 -&gt; 100 feet; reduced level requirement from 40 -&gt; 30.\r<br />\r<br />Two-Handed\r<br />- Avalanche: duration increased from 8 -&gt; 10 seconds; damage bonus removed; stagger strength doubled; no longer requires the follow-up attacks to be specifically a warhammer.\r<br />- Bear Hide: updated description for clarity.\r<br />- Bisect: increased damage cap from 112.5 -&gt; 150.\r<br />- Decimate: updated description to match other similar descriptions.\r<br />- Enter the Arena: updated description to match other similar descriptions.\r<br />- Execute: updated description for improved immersion.\r<br />- Flee Fool: no longer requires the follow-up attacks to be specifically a greatsword.\r<br />- Maul: no longer requires the follow-up attacks to be specifically a greatsword; updated description for improved immersion.\r<br />- Rise and Fall: updated description for clarity.\r<br />- Subjugate: improved script execution speed.\r<br />- The Pendulum: updated description for clarity. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v919-68425-9-19.zip?fid=1000248593&ttl=1535856773&ri=8192&rs=8192&setec=901457978ebe678c14cc213286818811"
    },
    {
      "fileId": "1000248594",
      "name": "Perk Points at Skill Levels 50-75-100",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Perk Points at Skill Levels 50-75-100-68425-.zip",
      "uploadedUnix": "1499265829",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/50a2e89deb5eefb52c19e0bf9fb44aa8604bf10a6b270f926e0a0518c6c4b143/analysis/1499266007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perk%20Points%20at%20Skill%20Levels%2050-75-100-68425-.zip?fid=1000248594&ttl=1535856774&ri=8192&rs=8192&setec=8a4dadcd85959b5316f25fbac411d54a"
    },
    {
      "fileId": "1000249417",
      "name": "Ordinator v920 - No DLC",
      "version": "9.20",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12688",
      "fileName": "Ordinator v920 - No DLC-68425-9-20.zip",
      "uploadedUnix": "1500058773",
      "modVersion": "9.20",
      "virusScanUrl": "https://www.virustotal.com/file/0496c0fc6513bf53c918929d0604aead661e4457679d8fda65f337b5675d9264/analysis/1500059187/",
      "changelogHtml": " Block\r<br />- Deflect Arrows: now reduces arrow damage by 25% -&gt; 50%.\r<br />\r<br />One-Handed\r<br />- Renamed Split the Heavens -&gt; Falling Sword. (This tree needs less dramatic names. This perk makes a lot of sense if you assume it is a powerful overhead swing that causes internal damage, but the name made it out to be something else entirely.)\r<br />- Swaying Cobra: reduced Magicka/Stamina drain from 150 -&gt; 100 but added a 5 second regeneration stop.\r<br />- Wandering Warrior: now correctly gives one-handed damage instead of two-handed damage. (Not retroactive, but since no one noticed in a year, I&#39;m assuming it&#39;s not important. If it is for you, the perk now modifies OneHandedPowerMod and used to modify TwoHandedPowerMod.)\r<br />\r<br />Pickpocket\r<br />- Death&#39;s Emperor: now also affects critical strike damage.\r<br />\r<br />Two-Handed\r<br />A common beef people have with this tree is that it &#34;makes no sense&#34;. It is true that some perks are there to enable gameplay moments instead of appealing to realism, but there is still some work that can be done.\r<br />- Replaced Flee Fool -&gt; Tooth for Tooth\r<br />- Replaced Rise and Fall -&gt; Hero&#39;s End.\r<br />\r<br />MCM/globals\r<br />- Added MCM option (ORD_Bck_TimedBlock_Global_SquelchTimedBlockMessage) to disable the timed block message.\r<br />- Added MCM option (ORD_Enc_Spellscribe_Global_EnableSelfCastSpells) to reenable self cast spells. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v920%20-%20No%20DLC-68425-9-20.zip?fid=1000249417&ttl=1535856774&ri=8192&rs=8192&setec=59b3124bf765d7b1baf60983e9b07551"
    },
    {
      "fileId": "1000250115",
      "name": "Ordinator v923 - No DLC",
      "version": "9.23",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12689",
      "fileName": "Ordinator v923 - No DLC-68425-9-23.zip",
      "uploadedUnix": "1500830314",
      "modVersion": "9.23",
      "virusScanUrl": "https://www.virustotal.com/file/c9bfe015add1bde365d4e6d9ee1f97ba653f321c77742238fd4005dc7afb39e9/analysis/1500830627/",
      "changelogHtml": " Pickpocket\r<br />- Mutiny: now causes the target to frenzy.\r<br />\r<br />Two-Handed\r<br />- Breach the Wall: improved threshold from 70% -&gt; 60%. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v923%20-%20No%20DLC-68425-9-23.zip?fid=1000250115&ttl=1535856775&ri=8192&rs=8192&setec=800643b0d74a8c343ebcd000133513ce"
    },
    {
      "fileId": "1000250116",
      "name": "Ordinator v923",
      "version": "9.23",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12690",
      "fileName": "Ordinator v923-68425-9-23.zip",
      "uploadedUnix": "1500830372",
      "modVersion": "9.23",
      "virusScanUrl": "https://www.virustotal.com/file/7237dec0c0d8a38b16245c7fcc09fb40f4f775357f9b0adcdff587a5ddb2afc6/analysis/1500830670/",
      "changelogHtml": " Pickpocket\r<br />- Mutiny: now causes the target to frenzy.\r<br />\r<br />Two-Handed\r<br />- Breach the Wall: improved threshold from 70% -&gt; 60%. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v923-68425-9-23.zip?fid=1000250116&ttl=1535856775&ri=8192&rs=8192&setec=69440ae7885d27d94562025cea4e8910"
    },
    {
      "fileId": "1000256027",
      "name": "Ordinator v925",
      "version": "9.25",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "12690",
      "fileName": "Ordinator v925-68425-9-25.zip",
      "uploadedUnix": "1506641113",
      "modVersion": "9.25",
      "virusScanUrl": "https://www.virustotal.com/file/36b0f51d8b56a45068993a18a0c77879298b199d4f44f74736ad5f065d6732cb/analysis/1506641249/",
      "changelogHtml": " Alchemy\r<br />- Fixed name of &#34;The&#34; Alchemist&#39;s Cookbook.\r<br />- Lab Skeever: now also increases the magnitude of beneficial potions by 25%. (If using a compatibility patch for another alchemy overhaul, this may not show up until the patch is updated; but it works regardless.)\r<br />\r<br />Alteration\r<br />- Home Mythal: reduced home duration bonus from x50 -&gt; x20.\r<br />- Rend Resistances: reduced resist pierce from 25% -&gt; 15%.\r<br />- Welloc&#39;s Dormant Arcana: reduced Regenerate Health effect from 2%/sec -&gt; 1%/sec.\r<br />\r<br />Conjuration\r<br />- Bone Collector: Skeleton Mage minimum level increased from 5 -&gt; 8. (+30 HP)\r<br />- March of Oblivion: changed from +1 minion and a further +1 per 250 mana -&gt; +1 minion and -50 Health. (This perk was insanely overpowered.)\r<br />- Pact Magic: reduced Destruction spell bonus from 15% -&gt; 10%.\r<br />\r<br />Destruction\r<br />- Absolute Power: reduced duration from 10 -&gt; 6 seconds.\r<br />- Ancient Seals: reduced total damage from 200% -&gt; 150%.\r<br />- Combustion: reduced bonus from 30/50% -&gt; 20/30%.\r<br />- Electroconvulsions: reduced threshold from 33% -&gt; 25%.\r<br />- Flash Fire: reduced bonus from 125% -&gt; 100%.\r<br />- Glacial Prison: reduced duration from 8 -&gt; 5 seconds.\r<br />- Hypothermia: reduced threshold from 33% -&gt; 25%.\r<br />- Ionized Path: reduced bonus from 30/50% -&gt; 20/30%.\r<br />- Magnetize: removed shock damage bonus to disabled target.\r<br />- Merciless Cold: reduced bonus from 30/50% -&gt; 20/30%.\r<br />- Robe of the Magi: reduced bonus from 25% -&gt; 20%.\r<br />- Scarring Burns: reduced fire resistance pierce from 25% -&gt; 20%.\r<br />- Shatter: duration in mod description is now correct.\r<br />\r<br />Enchanting\r<br />- Attunement: reduced enchantment effectiveness bonus from 15% -&gt; 10%.\r<br />- You Shall Not Pass: description now tells you how much damage it deals.\r<br />\r<br />Heavy Armor\r<br />- Doombringer: is now correctly removed when you respec.\r<br />\r<br />Illusion\r<br />- Commanding Presence: now only activates in combat (reducing script load when using unstable mods that run scripts whenever actors are affected by a magic effect).\r<br />\r<br />Lockpicking\r<br />- Nose for Treasure: added Scrolls option.\r<br />\r<br />Pickpocket\r<br />- Thief&#39;s Luck: added Scrolls option; fixed issue with Ingots option.\r<br />\r<br />Restoration\r<br />- Sacred Flame: reduced heal amount from 30 -&gt; 20 per second.\r<br />- Under My Wings: description now correctly says it doesn&#39;t work on mechanical targets.\r<br />\r<br />Sneak\r<br />- Backstab: no longer causes a guaranteed critical strike (apparently this overrides a sneak attack??&#33;?) but buffs critical strike damage by the same amount as it buffs regular damage instead.\r<br />- Demolition Job: reduced spell damage bonus from 3% (5% for runes) -&gt; 1% (2% for runes).\r<br />\r<br />Speech\r<br />- Encore: reduced level requirement from 50 -&gt; 40.\r<br />- Horn of Sovngarde: no longer blocks scenes from running on affected actors for its duration. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v925-68425-9-25.zip?fid=1000256027&ttl=1535856776&ri=8192&rs=8192&setec=a2889c9a4623ac77ec25bc5d5e8dd40c"
    },
    {
      "fileId": "1000256078",
      "name": "Ordinator v926",
      "version": "9.26",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12690",
      "fileName": "Ordinator v926-68425-9-26.zip",
      "uploadedUnix": "1506707462",
      "modVersion": "9.26",
      "virusScanUrl": "https://www.virustotal.com/file/0244dbf32e05a8c959920922d273e9c110bb5747a58fe476e14bd38d915ee3a9/analysis/1506707492/",
      "changelogHtml": " Conjuration\r<br />- March of Oblivion: changed from +1 minion and -50 Health -&gt; +1 minion per 250 mana, up to +3 minions. (The 9.23 version that tied minion count to Magicka was valid, enabling &#34;I may be weak...&#34; summoner specialist builds, but the implementation was overpowered because you could trivially get +2 for no meaningful cost. This rework brings back the pre-9.25 version of the perk in a slightly nerfed state, eliminating the easy +2 while offering a payoff for builds that go balls deep on minions.)\r<br />- Summon Resist: increased armor bonus from 200 -&gt; 300.\r<br />\r<br />Destruction\r<br />- Glacial Prison: increased duration from 5 -&gt; 6 seconds. (This perk falls apart if the duration is too low.)\r<br />- Nova Charge: increased damage from 150 -&gt; 200. (A static damage spell is hard to balance due to the tension between too weak and too strong, but the current version should have much more potential and is more conductive to being picked. (Sorry.))\r<br />- Robe of the Magi: increased bonus from 20% -&gt; 30%. (While Destruction did need significant nerfs, this was the wrong perk to nerf. Robes should remain the best option for pure mages.)\r<br />- War of the Elements: increased attack damage bonus from 30% -&gt; 40%. (Compensation for the Hypothermia and Electroconvulsions nerfs.) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v926-68425-9-26.zip?fid=1000256078&ttl=1535856776&ri=8192&rs=8192&setec=58c4eee4fae7b92556f6701468d19587"
    },
    {
      "fileId": "1000256079",
      "name": "Ordinator v926 - No DLC",
      "version": "9.26",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12689",
      "fileName": "Ordinator v926 - No DLC-68425-9-26.zip",
      "uploadedUnix": "1506707508",
      "modVersion": "9.26",
      "virusScanUrl": "https://www.virustotal.com/file/67a8558e3e63c3df1b93fa0a1b4a71ca65e261feecd58901554b043b517cc42b/analysis/1506707848/",
      "changelogHtml": " Conjuration\r<br />- March of Oblivion: changed from +1 minion and -50 Health -&gt; +1 minion per 250 mana, up to +3 minions. (The 9.23 version that tied minion count to Magicka was valid, enabling &#34;I may be weak...&#34; summoner specialist builds, but the implementation was overpowered because you could trivially get +2 for no meaningful cost. This rework brings back the pre-9.25 version of the perk in a slightly nerfed state, eliminating the easy +2 while offering a payoff for builds that go balls deep on minions.)\r<br />- Summon Resist: increased armor bonus from 200 -&gt; 300.\r<br />\r<br />Destruction\r<br />- Glacial Prison: increased duration from 5 -&gt; 6 seconds. (This perk falls apart if the duration is too low.)\r<br />- Nova Charge: increased damage from 150 -&gt; 200. (A static damage spell is hard to balance due to the tension between too weak and too strong, but the current version should have much more potential and is more conductive to being picked. (Sorry.))\r<br />- Robe of the Magi: increased bonus from 20% -&gt; 30%. (While Destruction did need significant nerfs, this was the wrong perk to nerf. Robes should remain the best option for pure mages.)\r<br />- War of the Elements: increased attack damage bonus from 30% -&gt; 40%. (Compensation for the Hypothermia and Electroconvulsions nerfs.) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ordinator%20v926%20-%20No%20DLC-68425-9-26.zip?fid=1000256079&ttl=1535856776&ri=8192&rs=8192&setec=67b44814daa79805847acfc64e03dc4d"
    }
  ]
}