{
  "modId": 6852.0,
  "modName": "Fearabbit Smithing BETA",
  "summary": "Detaches improvement bonuses from forging perks and puts them in one 5 tier perk, similar to the Alchemist perk or the Enchanter perk.",
  "descriptionHtml": "Fearabbit\\'s Smithing BETA\r\n============================\r\nby Fearabbit\r\nabout Smithing\r\nit\\'s Beta\r\n\r\n\r\n1. INSTALLATION:\r\n---\r\nI\\'m actually not very used to this whole mod manager thing. What I\\'d do is this:\r\n- Download the file\r\n- Extract it to Steam/SteamApps/common/skyrim/Data folder\r\n- Activate it in the Skyrim Launcher\r\nBut I\\'m sure you know hundreds of other ways that are more convenient than this. ;)\r\n\r\n\r\n2. DESCRIPTION:\r\n---\r\nMany people try to improve the Smithing skill tree, and well, here\\'s my suggestion. I have removed the \\\"you can improve them twice as much\\\" part of the forging perks and instead created a 5 tier perk which gradually goes from \\\"improve weapons and armor 20% more\\\" to eventually \\\"twice as much\\\".\r\nThis system is used in many other skill trees for the most basic use of the skill. For Alchemy, it\\'s the strength of created potions in the Alchemist perk; for Enchanting, it\\'s the strength of created enchantments in the Enchanter perk; and now Smithing has a similar perk at the bottom of its tree.\r\n\r\nThe perk is called \\\"Tempering\\\" and is divided as follows:\r\n1. No skill requirement: Can improve weapons and armor 20% more.\r\n2. Skill 20: Can improve weapons and armor 40% more.\r\n3. Skill 40: Can improve weapons and armor 60% more.\r\n4. Skill 60: Can improve weapons and armor 80% more.\r\n5. Skill 80: Can improve weapons and armor twice as much.\r\n\r\nAll other perks are now simply being used for forging the new armor and weapons. We\\'ll see how balanced this is, it will probably have to be adjusted.\r\n\r\nIMPORTANT: I have completely removed any material requirements from the Tempering perk - that means you can improve EVERY weapon and armor you find in the game. For example, Leather, Fur and Hide armor benefit from this perk as much as any other material! You will also be able to create Legendary Daedric weapons even though you specialized yourself in the Light Armor branch of the skill tree - since that is all handled by the small perk at the bottom.\r\n\r\nI imagine this system to be:\r\na) more balanced (as a Light Armor wearer you had a severe disadvantage before because most light armors in the game could not be improved properly, especially the more stylish and less clunky armors)\r\nb) more in line with what Smithing is all about (improving armor and weapons is the most important aspect of it and it wasn\\'t really adressed as such in the original skill tree)\r\nc) more FUN. It\\'s not all about bonuses and calculating now.\r\n\r\n\r\n3. PLAYING WITH THE MOD:\r\n---\r\nIf you already have a character who invested in Smithing, that\\'s fine. But of course it\\'s not optimal as you will have used the new skill tree inefficiently, maybe, a little. In any case, there won\\'t be any problems. (Or if there are, well, it\\'s a beta! Tell me about it!)\r\n\r\n\r\n4. SO WHY\\'S THIS ONLY A BETA?\r\n---\r\nWell, because it really is only a very half-arsed attempt to create a more interesting skill tree. I\\'M ACTUALLY FAR FROM FINISHED. This is just the most important change, and I\\'m glad that I\\'ve been able to do this already.\r\nCurrently, my \\\"Tempering\\\" perk is simply taking the place of the Steel Smithing perk. Which actually means that as soon as you activate its first level, you\\'ll be able to forge Steel, just like before. To my knowledge, it\\'s currently not possible to add new nodes to the skill trees or change the arrangement in any way, which is why I had to do it like this.\r\n\r\nSo what am I planning to do here?\r\nWell, we have the root of the tree already, but how should it spread from there? Just like before? No way. But I\\'m not quite sure how it should be done, and any feedback would be appreciated. Currently, I\\'m thinking about this:\r\n\r\n- one branch for Light Armor that also includes Fur, Imperial and Leather Armor\r\n- one branch for Heavy Armor that puts Steel one level higher so that it\\'s more difficult to get\r\n- one branch for all weapons. So that people who don\\'t use Heavy Armor can still get \\\"Daedric Weapon Forging\\\".\r\n- Light and Heavy Armor branches will lead together to Dragonscale again, but Daedric won\\'t be a mandatory step in between for Heavy Armor, instead it will be another Master perk itself that comes after Ebony. That way Heavy Armor has the same amount of steps until it gets to the top.\r\n\r\nWhat do you think?\r\n\r\n\r\nCREDITS:\r\nDave Humphrey for SkyEdit - such a great tool! Thanks a lot!",
  "categoryId": "73",
  "version": "0.1",
  "author": "Fearabbit",
  "createdUnix": "1327282435",
  "updatedUnix": "1327282573",
  "containsAdultContent": false,
  "uploadedBy": "Fearabbit",
  "primaryFile": null,
  "files": [
    {
      "fileId": "22275",
      "name": "Fearabbit Smithing BETA",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Fearabbit Smithing BETA-6852-0-1.7z",
      "uploadedUnix": "1327282573",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/b79779bbcd3705eea03d68ed3227ea7fdaac6c0552cf9543fb5342f2eb71c543/analysis/1406632562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fearabbit%20Smithing%20BETA-6852-0-1.7z?fid=22275&ttl=1535764538&ri=8192&rs=8192&setec=1fdd87e581f6b7e3c1afa89ce6fe1919"
    }
  ]
}