{
  "modId": 68810.0,
  "modName": "Aftermath",
  "summary": "Multiplayer online mod for Skyrim",
  "descriptionHtml": "[b]Aftermath[/b] is a mod that brings multiplayer into Skyrim. It is something between a multiplayer game for tens players and a MMO game for millions. The game world will be hosted by a 3rd party in a [u]single[/u] instance, the goal of the mod is to create an online game where each player matters for evolution of the world.\r<br />\r<br />[color=#ffff00]The mod is being in development.[/color] At this stage all major technical issues are solved and now it is a good moment to find those who will play Aftermath. [u]And ask them what they want this world to be[/u][b].[/b]\r<br />\r<br />Aftermath storyline begins soon after the final fight between Dovahkiin and Alduin. Magical power released during the fight wiped out all living beings from the lands of Skyrim. Empty houses, ships, forts and dungeons are waiting for new inhabitants. There will be no NPCs, every character will be controlled by a player. Players will be grouped into political factions depending where they live - in a town, in a cave, etc. - and players will play their roles of citizens, brigands, members of well-known guilds like Dark Brotherhood.\r<br />\r<br />Housing is a very important part of the gameplay. Alpha versions of the mod will show an empty world and if you are willing to live there then find a place where you would like to settle and check if the cleaning procedure correctly removed unnecessary stuff like furniture, items, different elements of landscape. When the mod is released in beta version you will be able to make your place the most cozy place in Skyrim by decorating it with a fireplace, furniture, fences and [u]all this will be crafted by real players[/u]...\r<br />\r<br />\r<br />[b][color=#00ffff]Installation[/color][/b]\r<br />\r<br />- Download the file and drop it into the folder where TESV.exe is situated\r<br />- Launch AftermathInstaller.exe\r<br />- Find Skyrim.ini and add &#34;SStartingCell = Sovngarde01&#34; into &#34;[General]&#34; section\r<br />\r<br />\r<br />[b][color=#00ffff]Deinstallation[/color][/b]\r<br />\r<br />- Remove all files that begin with &#34;aftermath&#34;\r<br />- Remove &#34;SStartingCell = Sovngarde01&#34; from &#34;[General]&#34; section of Skyrim.ini\r<br />\r<br />\r<br />[b][color=#00ffff]Launch[/color][/b]\r<br />\r<br />- Disable all mods except official DLCs\r<br />- Enable &#34;Aftermath&#34; mod\r<br />- Run aftermath.exe which is situated next to TESV.exe\r<br />- Wait for a minute until Skyrim window appears\r<br />- Enter &#34;bat aftermath&#34; into the console and check if you see your current coordinates displayed in the bottom right corner\r<br />\r<br />\r<br />[b][color=#00ffff]Creation of a new character[/color][/b]\r<br />\r<br />- Open console and type &#34;incarnate [email] [password] [name] orc male 1&#34; replacing parameters in square brackets with corresponding data\r<br />Note: other races can be used too\r<br />\r<br />\r<br />[b][color=#00ffff]Usage of an existing character[/color][/b]\r<br />\r<br />- Open console and type &#34;reincarnate [email] [password]&#34; replacing parameters in square brackets with corresponding data\r<br />- Close console\r<br />- Wait until a new location loads\r<br />\r<br />\r<br />[b][color=#00ffff]Chatting[/color][/b]\r<br />\r<br />- Open console and type &#34;z [text]&#34;\r<br />- Close console\r<br />Note: Only players few steps away will see your text\r<br />\r<br />\r<br />[i]Once you are in the game explore the world trying to find unnaturally looking artifacts left after the cleaning procedure. Report them, please. By doing this you will be increasing your rating that will be taken into account if more than 3000 players want to play Aftermath.\r<br />\r<br />\r<br />[/i][b][color=#00ff00]Change log[/color][/b]\r<br />\r<br />[u]Version 0.0.1[/u]: Total cleanup of unnecessary objects. Character creation and authorization. Actor synchronization without animation. Chatting.",
  "categoryId": "84",
  "version": "0.0.1",
  "author": "Bargheimer",
  "createdUnix": "1439745417",
  "updatedUnix": "1439745417",
  "containsAdultContent": false,
  "uploadedBy": "Bargheimer",
  "primaryFile": null,
  "files": []
}