{
  "modId": 68816.0,
  "modName": "Hotsprings Shack",
  "summary": "A small shack in the hotsprings area of Eastmarch.",
  "descriptionHtml": "[font=Georgia][size=4][center][color=#a4c2f4]HOTSPRINGS SHACK[/color][/center][/size][/font]\r<br />[center][size=3]Version 1.0\r<br />[/size][/center][size=3]\r<br />A small modest shack, my first house mod. Aspiring members of the Thieves Guild or those who are married to Ysolda in game can easily recognise it, since it is basically a modified copy of Ysolda&#39;s home in Whiterun. I have placed it outside Eldergleam Sanctuary not far from the couple of hunters (aka werewolf/vampire breakfast) chilling out in the hotsprings nearby. I like nice weather and beaches, and since there are no decent beaches in Skyrim (by decent I mean ones where the water won&#39;t turn you into a human-shaped piece of ice or where you won&#39;t immediately get lungs full of ash), I thought that the hotsprings area in Eastmarch will do. I also have tremendous luck and unique talent to plan mod building in nicest locations, so this one later turned out to be very close to dragon spawn location. Yay&#33;\r<br />\r<br />I always wanted to use elven furniture from Dragonborn DLC in my home in Skyrim and dig up that epic Telvanni banner from the game files (I learned about its existence thanks to ClefJ). I planned to make a morrowindish home fitting for my character (who is a Morrowind native High Elf), and of course, picked nothing but Whiterun shack exterior. That set me on path of building some weird mixed crap, neither Nord nor elven. So brace yourselves.\r<br />\r<br />Huge thanks to [url=http://forums.nexusmods.com/index.php?/user/16520804-kunkel2016/]kunkel2016[/url] (CosmicWonder) and [url=http://www.nexusmods.com/skyrim/users/18957554]ThatYoutubeGamer[/url] (Lankyy J) for the cool video showcases of this mod, you rock, guys&#33;\r<br />\r<br />[youtube]wEpFNIDUUfs[/youtube]\r<br />[youtube]dKRHzheNr4o[/youtube]\r<br />\r<br />[font=Georgia][color=#a4c2f4]-REQUIREMENTS-[/color][/font]\r<br />\r<br />*Skyrim version 1.9.32.0.8 (the one this mod was made with)\r<br />*Dawnguard DLC\r<br />*Hearthfire DLC\r<br />*Dragonborn DLC\r<br />\r<br />[font=Georgia][color=#a4c2f4]-FEATURES-[/color][/font]\r<br />\r<br />-&gt; Custom enchanting and alchemy workstations with vanilla animation\r<br />-&gt; Custom bed (well, to some extent)\r<br />-&gt; Hearthfire oven\r<br />-&gt; Custom named storage\r<br />-&gt; Custom wardrobe built by me from vanilla pieces and with help of modder&#39;s resource\r<br />-&gt; Wind chime with sound outside the house (courtesy of Tamira). I managed to make the sound fade away with distance\r<br />\r<br />[font=Georgia][color=#a4c2f4]-KNOWN ISSUES-[/color][/font]\r<br />\r<br />-&gt; For now this mod is tested only by me. I don&#39;t even know if it will work for other people, even though I tried my best to do everything properly. If you see any purple textures, floating stuff and similar heresy in the house, don&#39;t worry it only means that I am a noob. Let me know and I&#39;ll try to fix it. As long as you have a backup of the save you made before installing the mod, you are okay.\r<br />-&gt; For now — no navmesh of exterior area. I was too afraid to make unnecessary edits, so until I learn how to do it properly, it stays this way. I left default interior navmesh, since my layout does not differ drastically from the original, and my followers sandboxed there properly. Except for Serana. She likes to climb atop alchemy lab. One more thing to note here — followers will follow you into the house, but won&#39;t follow outside. You&#39;ll have to move them to you with the following console commands:\r<br />\r<br />prid [follower&#39;s ref id]\r<br />moveto.player\r<br />\r<br />I apologise for the inconvenience. I will fix this as soon as I&#39;m able to. If anyone can point me to the solution, please feel free to do so in the comment section of my mod, or via PM on nexus.\r<br />-&gt; I tried to set most of the clutter to static, but the two books are pickable, this is intended. If you find any flying containers though, please, report it to me and I&#39;ll fix it. Same with respawning. The cell is set to non-respawn, but you know... weird things sometimes happen.\r<br />-&gt; I assume the deathbell in the house won&#39;t respawn once you harvest it, so if you want to keep it for decoration, do not harvest it.\r<br />-&gt; I don&#39;t know how to clean mods with TES5Edit yet, so this one is not cleaned. I don&#39;t mean that there must be something wrong with it, but anyway. Just a warning.\r<br />\r<br />[font=Tahoma][color=#a4c2f4]-INSTALLATION-[/color][/font]\r<br />\r<br />Just drop .bsa and .esp in your Skyrim Data folder\r<br />\r<br />[color=#a4c2f4]-UNINSTALLATION-[/color]\r<br />\r<br />Uncheck the mod in the Skyrim launcher and remove both files from your Data folder. You can also use Savegame Cleaner or SKSE setting to clear invalid script registrations. No idea if it really helps, but my saves are intact by far.\r<br />[color=#ff7700]AND I REPEAT IT AGAIN, FOR THE SAKE OF SWEET TALOS KEEP A BACKUP OF THE SAVE MADE BEFORE YOU INSTALLED THE MOD&#33; [/color]I am not responsible for your game. You always take a risk when installing a new mod.\r<br />\r<br />[color=#a4c2f4]-CREDITS-[/color]\r<br />\r<br />&bull; Blary for alchemy scale (Alchemy Clutter Resourse: http://www.nexusmods.com/skyrim/mods/30599/?) and open book (OpenBooksResource: http://www.nexusmods.com/skyrim/mods/14134/?)\r<br />&bull; Tamira for wind chime and complementing sound, and for the voodoo doll (Assorted Resources: http://www.nexusmods.com/skyrim/mods/57394/?)\r<br />&bull; Tamira and Mc Muffin for skooma pipe\r<br />&bull; Elianora for weapon barrel, alchemy and enchanting markers, alchemy apparatus, super-awesome and easy instructions on how to bada-boom with CK wizardry and for her mods, which always were and are a great inspiration (Elianora&#39;s Extra Resources: http://www.nexusmods.com/skyrim/mods/14134/?)\r<br />&bull; InsanitySorrow for folded blankets (Insanity&#39;s Folded Blankets: http://tesalliance.org/forums/index.php?/files/file/1452-insanitys-folded-blankets/) and pillows (Insanity&#39;s Pillows: http://tesalliance.org/forums/index.php?/files/file/1429-insanitys-pillows/)\r<br />&bull; Jokerine for small flower arrangements (Jokerine&#39;s Misc Resources: http://www.nexusmods.com/skyrim/mods/53022/?)\r<br />&bull; lolikyonyu for static elven armor, ingredients basket, soul gem basket, potion and poison crate (Lolicept Resources: http://www.nexusmods.com/skyrim/mods/62733/?)\r<br />&bull; Oaristys and Tony67 for linen, mortar and dishes (Modders Resource Pack: http://www.nexusmods.com/skyrim/mods/16525/?)\r<br />&bull; Tlaffoon for the breathtaking tapestry (Tlaffoon&#39;s Rugs and Tapestries: http://www.nexusmods.com/skyrim/mods/68040/?)\r<br />Special thanks to ClefJ, who inspired me with their awesome work. Be sure to check out their mod gallery&#33; http://www.nexusmods.com/skyrim/users/6747156/?tb=mods&pUp=1\r<br />\r<br />[color=#a4c2f4]Thanks to Bethesda for creating this wonderful game, and to the modders for their kindness, who share their work with us. Anything I&#39;ve made and will possibly make in the future will always be free, because I learned from free tutorials (namely ones by [/color][url=https://www.youtube.com/channel/UCSGI8N4IeT0Xc3YUCGceZAQ]WitchOfTheWinds[/url][color=#a4c2f4] and [/color][url=https://www.youtube.com/channel/UCtYB2iX9_52X_DNtSIJXyWg]Darkfox127[/url][color=#a4c2f4]), took inspiration from free mods and used free-to-use modders&#39; resources. This wouldn&#39;t be possible without the generosity of people who share their work and knowledge with modding community. Thank you all people, you are amazing.[/color]\r<br />[color=#00ffff]\r<br />[font=Georgia]Special thanks also to my good friend [url=http://charming-mushroom.deviantart.com/]charming-mushroom[/url] for the mind-blowing screenshots that made this mod shine and for testing. You are super-fantastically-unbelievably awesome&#33;[/font][/color][/size]\r<br />\r<br />[font=Lucida Sans Unicode][color=#ff0000][size=4]This mod is NEXUS EXCLUSIVE. If you see it elsewhere, it means it was STOLEN.[/size][/color][/font]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Aneksunamun",
  "createdUnix": "1439758210",
  "updatedUnix": "1439757740",
  "containsAdultContent": false,
  "uploadedBy": "Aneksunamun",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000172176",
      "name": "Hotsprings Shack 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28137",
      "fileName": "Hotsprings Shack 1.0-68816-1-0.zip",
      "uploadedUnix": "1439757740",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/98187d180a86e7c03b1511dab7aafb75199b1b1294ec6ecffb27311fcc1ac6fb/analysis/1439757793/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotsprings%20Shack%201.0-68816-1-0.zip?fid=1000172176&ttl=1535857132&ri=8192&rs=8192&setec=8f0de701d1b271cb31644e900c9fb790"
    }
  ]
}