{
  "modId": 68852.0,
  "modName": "Garrett Dark-Thief - Follower and Sneak Trainer",
  "summary": "Follower mod for Garrett Dark-Thief, a character based on the protagonist of the popular &#34;Thief&#34; game series. Garrett will join the Dragonborn on their adventures... if the price is right.",
  "descriptionHtml": "[img]http://www.oddkid.com/crmods/gdt/Header_GDT_Main-Image-Description_FINAL.png[/img]\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_About-This-Mod2.png[/img]\r<br />Garrett Dark-Thief is a Skyrim follower mod based on the protagonist of the legendary [i]Thief[/i] game series. This mod was inspired by h34dup’s [url=http://www.nexusmods.com/skyrim/mods/45509]Garrett Thief Armor[/url] mod and braigus09’s [url=http://www.nexusmods.com/skyrim/mods/33185/]Lara Croft – The Tomb Raider[/url] mod; both available here on the Nexus.\r<br /> \r<br />I started out making this mod for myself, because I wanted to build the character of Garrett into Skyrim. I thought about what Garrett might look like and be like if he was in Tamriel instead of in the world of [i]Thief: The Dark Project[/i]. I also wanted to learn how to create mods, and using one of my favorite game characters became the perfect training ground. Since Garrett has grown and changed over the course of the build, I’ve decided to share this mod with the community and any other [i]Thief[/i] fans out there.\r<br /> \r<br />Future versions of this mod will include a standalone option, custom voice, custom weapons, and a follower quest to be completed before Garrett will become your follower (this will require me to figure out how to create meshes and textures, re-texture vanilla assets, and possibly how to write more advanced Papyrus scripts. It will be awhile before I can do any of that).\r<br /> \r<br />This is the first mod that I have released to the community, so please let me know if you run into any issues.\r<br /> \r<br /> \r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Features2.png[/img]\r<br />- Essential follower with a max level of 100\r<br />- Master level Sneak trainer\r<br />- Custom armor provided by h34dup’s [url=http://www.nexusmods.com/skyrim/mods/45509]Garrett Thief Armor[/url] (a required download)\r<br />- Custom class with bonuses in sneak, archery, lockpicking, light armor and one-handed\r<br />- A variety of perks including Lightfoot, Muffled Movement, and all lockpicking perks (these will be available as he levels up)\r<br />- A journal and a letter in his inventory which relates his backstory\r<br />- Find him in The Bee and Barb in Riften\r<br /> \r<br /> \r<br />This mod has been cleaned by [url=http://www.nexusmods.com/skyrim/mods/25859]TES5edit[/url].\r<br /> \r<br />Check out the video below for a look at Garrett Dark-Thief in action:\r<br />\r<br />[youtube]k4x0izeFJbs[/youtube]\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Requirements2.png[/img]\r<br />Skyrim.esm\r<br />Update.esm\r<br />Garrett Thief Armor mod by h34dup - [url=http://www.nexusmods.com/skyrim/mods/45509]http://www.nexusmods.com/skyrim/mods/45509[/url]\r<br />\r<br />\r<br />[u][img]http://www.oddkid.com/crmods/gdt/Header_Installing-The-Mod2.png[/img][/u]\r<br />[i]NMM and manual instructions for the Garrett Thief Armor mod are included on h34dup’s page.[/i]\r<br />\r<br />[b]NexusMod Manager (NMM):[/b]\r<br />Download the Garrett Thief Armor mod and install with NMM.\r<br />Download the Garrett Dark-Thief mod and install with NMM.\r<br />[i]Place the armor mod above the follower mod in your load order, as the follower mod depends on the armor pieces.[/i]\r<br /> \r<br />[b]Manual Installation:[/b]\r<br />Manually install the Garrett Thief Armor mod per h34dup’s instructions.\r<br />Drop the Garrett Dark-Thief mod files (.esp and .bsa) into the Data folder of your Skyrim folder (for Steam users, this is usually C:&#92;Program Files&#92;steam&#92;steamapps&#92;common&#92;skyrim&#92;Data)\r<br />\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Uninstalling-The-Mod2.png[/img]\r<br />[i]This mod does add new scripts to the game. These scripts control Garrett’s introductory conversation and his trainer dialogue, and they may affect your save game file if you uninstall this mod in the middle of a playthrough.[/i]\r<br />[i] [/i]\r<br />[i]If you have taken the journal and letter from Garrett, return them to him before uninstalling the mod. I’m not sure if this will make a difference or not, but just in case. (there are no scripts attached to these items, but these are items added by the mod)[/i]\r<br />[i] [/i]\r<br />[b]Nexus Mod Manager (NMM):[/b]\r<br />Deactivate the Garrett Dark-Thief Mod in NMM.\r<br /> \r<br />[b]Manual Uninstall:[/b]\r<br />Delete the “GarrettDarkThief”.esp and .bsa files in your Data folder.\r<br /> \r<br />Keep the armor mod –it’s seriously good and has several pieces not seen in the Garrett Dark-Thief mod. (or you can follow h34dup’s instructions if you wish to uninstall)\r<br />\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Compatibilities-and-Possible-Issues2.png[/img]\r<br />I’m running about 80+mods on my machine (which is not a lot compared to some users, but is more than others), and so far I have not encountered any problems or issues.\r<br /> \r<br />[b]Garrett is compatible with:[/b]\r<br />[url=https://www.nexusmods.com/skyrim/mods/15524]Amazing Follower Tweaks[/url] (original version by Dheuster)\r<br />[url=https://www.nexusmods.com/skyrim/mods/14950]Convenient Horses[/url]\r<br /> \r<br />[b]Garrett may be incompatible with:[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/28880]Destroy the Thieves Guild[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50378]Disband the Thieves Guild[/url]\r<br />\r<br />[b]Garrett is NOT compatible with:[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/71689]Immersive Amazing Follower Tweaks[/url] (looking into this as of 10/23/2017)\r<br /> \r<br />[i](if you run into a compatibility issue, or another follower mod with which Garrett is compatible, please let me know so I can update this section. If you use the “Destroy…” or “Disband…” mods noted above, please let me know if Garrett causes any issues in your game.)[/i]\r<br />\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Notes2.png[/img]\r<br />[b]Weapons (in game)[/b]: if you want Garrett to use his ebony bow and arrows, be sure to remove the hunting bow and iron arrows from his inventory. The game automatically gives these items to any follower you recruit, so I didn’t want to edit the vanilla script and potentially cause a bug in someone’s game. Just remove them once you recruit him, unless he feels overpowered in your game and you want him to deal less damage.\r<br /> \r<br />[b]Friends (Creation Kit)[/b]:Garrett has a “Friend” relationship to Brynjolf and to Delvin Mallory; however, Garrett’s combat AI is set to “Helps Allies” instead of “Helps Friends and Allies”. If for some reason you attack Brynjolf or Delvin, Garrett should defend you and not them.\r<br /> \r<br />[b]Factions (Creation Kit)[/b]: Garrett is part of the ThievesGuildFaction, CrimeFactionThievesGuild, and TownRiftenFaction. This should not cause any issues unless you have a mod that makes the player or NPCs hostile to anyone in these factions.\r<br />\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Recommended-Mods2.png[/img]\r<br />[i]Mods that really make this character feel more like our old friend Garrett.[/i]\r<br />[i] [/i]\r<br />[u][b][i]ARMOR[/i][/b][/u]\r<br />h34dup did an excellent job with the standalone armor mod called [b][url=http://www.nexusmods.com/skyrim/mods/45509]Garrett Thief Armor[/url][/b], and [u]it is required[/u] for the Garrett Dark-Thief mod[b]. [/b]([url=http://www.nexusmods.com/skyrim/mods/45509]http://www.nexusmods.com/skyrim/mods/45509[/url])\r<br /> \r<br />The armor is a standalone retexture of protese’s [b][url=http://skyrim.nexusmods.com/mods/43649]Hunter Archer Armor[/url][/b], available in two variants. ([url=http://skyrim.nexusmods.com/mods/43649/]http://skyrim.nexusmods.com/mods/43649[/url])\r<br /> \r<br />(I use both armor mods in my game, but only my player character and the follower Garrett gets the Thief armor.)\r<br /> \r<br />[u][b][i]CLOTHING & ACCESSORIES[/i][/b][/u]\r<br />[b][url=http://www.nexusmods.com/skyrim/mods/12092]Cloaks of Skyrim[/url][/b] by Nikinoodles – one of my favorite mods, it makes craftable burlap, linen and hide cloaks and capes available, and has 3 different options for installation: from random NPCs throughout the world to player only. Garrett looks great in black linen or black burlap. ([url=http://www.nexusmods.com/skyrim/mods/12092/]http://www.nexusmods.com/skyrim/mods/12092[/url])\r<br /> \r<br />[u][b][i]WEAPONS[/i][/b][/u]\r<br />[b][url=http://www.nexusmods.com/skyrim/mods/12555]Water Arrows[/url][/b] by angryegret ([url=http://www.nexusmods.com/skyrim/mods/12555]http://www.nexusmods.com/skyrim/mods/12555[/url]) for those of us who miss those handy arrows anytime we pass through brightly-lit caverns, dungeons and halls. (now we just need moss arrows, noisemaker arrows, fire arrows, blunt arrows, rope arrows….)\r<br /> \r<br />[u][b][i]AESTHEICS[/i][/b][/u]\r<br />If you want Garrett as he was originally built, use the vanilla meshes and textures.\r<br />\r<br />If you want Garrett to have a higher-resolution face than vanilla but still maintain a rugged and natural look, use the [b][url=http://www.nexusmods.com/skyrim/mods/38301]DCE - Realistic Male Face[/url][/b] mod by Drumber ([url=http://www.nexusmods.com/skyrim/mods/38301]http://www.nexusmods.com/skyrim/mods/38301[/url])\r<br />\r<br />If you want a more handsome, smoother and/or younger-looking Garrett, use the [b][url=http://www.nexusmods.com/skyrim/mods/2488]Better Males[/url][/b] mod. ([url=http://www.nexusmods.com/skyrim/mods/2488/]http://www.nexusmods.com/skyrim/mods/2488[/url])\r<br /> \r<br />Better Males “Faces –Geonox Faces” has high resolution textures and lets the men keep some of their natural vanilla look while improving their overall facial features. It also works well with the vanilla body if you don’t want to install one of the body replacers.\r<br />\r<br />The Better Males body replacers that contain “Lips, dirty faces and scars improved by Xenius” will lessen the appearance of Garrett’s facial scars, to the point of being almost invisible (I think all options have this included, possibly all but one). Just a note if you prefer seeing the familiar scar near Garrett’s right eye.\r<br /> \r<br />[i]See the screenshots above for a comparison between Vanilla, Geonox and Xenius; and a comparison between Vanilla and Drumber.\r<br />[/i]\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Permissions2.png[/img]\r<br />[i]If you have any questions about the following permissions, please send me a PM here on the Nexus. I’m pretty reasonable, but I do have some ground rules. :-)[/i]\r<br /> \r<br />The Garrett Dark-Thief mod MAY NOT be used for any commercial purpose, including paid mods, subscriptions or compilations. This mod uses elements of others’ work whose permission was granted before release, and it also contains original written works that are not to be separated from this mod.\r<br /> \r<br />The Garrett Dark-Thief mod MAY NOT be posted anywhere on the Steam Workshop. This mod is a Nexus exclusive, and if it released on the Steam Workshop under any user’s name other than Clockwork Raider, then it was done without my permission.\r<br /> \r<br />Please contact me if you wish to do a translation of the Garrett Dark-Thief mod. I’ll be happy to link to your file from the main mod page or upload it to the page, provided you contact me first. I also don’t want someone to be doing double work if someone else has already started working on one. Please note that any translations of the Garrett Dark-Thief mod may only be posted to the Nexus.\r<br /> \r<br />The journal and letter in Garrett’s inventory are original written works; you MAY NOT use them elsewhere. The only exception to this is if these two works are part of a translation of the Garrett Dark-Thief mod. In any case, the journal and letter cannot be separated from the mod itself.\r<br />\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Feedback2.png[/img]\r<br />Yes, please&#33; Constructive criticism, suggestions, recommendations and helpful comments are always appreciated. Negative and/or inflammatory comments will be ignored.\r<br />\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Special-Thanks-and-Credits2.png[/img]\r<br />[b][i]Bethesda Game Studios[/i][/b], for allowing players to create their own versions of Skyrim.\r<br /> \r<br />[b][i]Looking Glass Studios and Ion Storm[/i][/b], for creating a character and a series that became the grandfather of the stealth genre and inspired other developers as well as fans.\r<br /> \r<br />[b][i]Stephen Russell[/i][/b] for bringing Garrett to life in the original trilogy. His name and voice will always be synonymous with Garrett for me.\r<br /> \r<br />[b][i]Romano Orzari[/i][/b] for bringing a new Garrett to a new audience. No, he’s not Stephen; but then again, the new Garrett is not supposed to be the original Garrett (it’s really 300 or 400 years after the events of the first three games).\r<br /> \r<br />[b][i]h34dup[/i][/b] for the Garrett armor mod, his permission to include pieces of his armor mod into this follower mod, and for the inspiration to build Garrett into Skyrim.\r<br /> \r<br />[b][i]protese[/i][/b] for the original Hunter Archer armor that h34dup retextured.\r<br /> \r<br />[b]braigus09[/b] for his Lara Croft follower mod that inspired me to write Garrett into Skyrim, similar to what he did with Lara.\r<br /> \r<br />[b][i]Robin Scott and the NexusMods team[/i][/b] for providing a repository for video game mods and a gathering place for modders.\r<br /> \r<br />[b][i]Skyrim’s experienced mod authors[/i][/b] for posting and answering questions on various forums, making tutorials on YouTube and their own webpages, and building tools to make the process less complicated. I learned much from the trails blazed by others, and I am very grateful for their work and their willingness to teach. [u]I couldn’t have done this without you&#33;[/u]\r<br /> \r<br />[i]A detailed list of helpful tutorials and utilities can be found at the bottom of this page, for those interested in the resources used to create this mod.[/i]\r<br /> \r<br />Writing editor and best friend [b]Kaylie Jayne[/b] for editing the original written works included in this mod.\r<br /> \r<br />Beta tester [b]husqvarna82[/b] for testing the mod in both modded and vanilla Skyrim setups.\r<br /> \r<br />[b][i]Anyone who downloads this mod[/i][/b] –whether you keep using it or just try it out, you took the time to download and install it. You gave it a chance, and that means something. Please be sure to give the suggested mods here a chance too.\r<br />\r<br /> \r<br />Hope you enjoy adventuring with Garrett Dark-Thief&#33;\r<br />\r<br />       [img]http://www.oddkid.com/crmods/gdt/CR_signature_SDG2.png[/img]\r<br />\r<br />\r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Change-Log.png[/img]\r<br />Version 1.0 – initial release  (08/20/2015)\r<br />\r<br /> \r<br />[img]http://www.oddkid.com/crmods/gdt/Header_Tutorials-and-Utilities-for-Mod-Authors2.png[/img]\r<br />Here’s just a few of the excellent resources out there – and I’m sure you’ll find more as you search for specific troubleshooting related to your mod. The Nexus and Bethesda forums contain a wealth of information related to modding.\r<br /> \r<br />[url=http://hubpages.com/hub/Hot-to-Turn-Your-Skyrim-Character-into-a-Follower][b]j-u-i-c-e at hub pages[/b] - How to Create a Custom Follower and Marriage Partner for Skyrim[/url]\r<br /> \r<br />[url=http://wiki.tesnexus.com/index.php/Adding_a_Trainer_NPC_to_Skyrim][b]NexusWiki[/b] - Adding a Trainer NPC to Skyrim[/url]\r<br /> \r<br />[url=http://deck16.net/post/22645519500/making-a-unique-voiced-follower-in-skyrim-part-1#_=_][b]Deck16[/b] - Making a Unique-Voiced Follower for Skyrim[/url]\r<br /> \r<br />[url=https://youtu.be/tLgSYzOaTnA][b]DarkFox127[/b] - Detailed Follower Tutorial Video[/url]\r<br /> \r<br />[url=https://youtu.be/AMi_21Kt-lQ][b]BestInSlot[/b] - Skyrim Creation Kit Tutorials -Episode 14: Quest Dialogue[/url]\r<br /> \r<br />[url=http://tesmods.blogspot.com/2012/02/tutorial-creating-new-book.html][b]Skyrim Modding Blog Tutorial[/b]- Creating a new book[/url]\r<br /> \r<br />[url=http://www.creationkit.com/Bethesda_Tutorial_Planning_the_Quest][b]Bethesda Tutorials at CreationKit.com[/b]- Quest Design Fundamentals Series[/url]\r<br /> \r<br /> \r<br />These utilities made by other modders were a great help:\r<br /> \r<br />[b][url=http://www.nexusmods.com/skyrim/mods/19242]Unfuzer[/url][/b] by greentea101\r<br /> \r<br />[b][url=http://www.nexusmods.com/skyrim/mods/4804]BSA Unpacker[/url][/b] by wookied\r<br /> \r<br />[b][url=http://www.nexusmods.com/skyrim/mods/8303]Skyrim Audio Converter[/url][/b] byJohnBSkyrim\r<br /> \r<br />The responses on [url=http://forums.nexusmods.com/index.php?/topic/2840879-adding-follow-me-option-when-quest-is-over/]this forum thread[/url] got me started on how to write the Papryus scripting for Garrett’s introductory conversation, as well as someone’s\r<br />advice of checking out the build for the Eola follower (DA11 Quest - Namira), and [url=https://youtu.be/AMi_21Kt-lQ][b]BestInSlot[/b]’s Quest Dialogue[/url] video tutorial helped make the Papyrus scripting language click for me.",
  "categoryId": "96",
  "version": "1.0",
  "author": "Clockwork Raider",
  "createdUnix": "1440046742",
  "updatedUnix": "1440045767",
  "containsAdultContent": false,
  "uploadedBy": "ClockworkRaider",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000172611",
      "name": "Garrett Dark-Thief follower - v 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1288",
      "fileName": "Garrett Dark-Thief Follower - v 1.0-68852-1-0.zip",
      "uploadedUnix": "1440045767",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4ab20b74cfc32793d4c2117a50dd0e10be7e7545ead6e1030f352224a5be9db5/analysis/1440045784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Garrett%20Dark-Thief%20Follower%20-%20v%201.0-68852-1-0.zip?fid=1000172611&ttl=1535857171&ri=8192&rs=8192&setec=580d27a4a1a450b7d6b93798a3b9a450"
    }
  ]
}