{
  "modId": 68921.0,
  "modName": "Warm Fantasy ENB",
  "summary": "This is a SweetFX/ENB combination I happened to create while trying to get a nice, performance friendly graphical setup for Skyrim. This is somewhat performance friendly - I usually get drops that dip down to 30 - 40 fps, but most of the time - it sticks around 50 -55. Enjoy&#33;",
  "descriptionHtml": "[center][font=Comic Sans MS][color=#9900ff][size=6][u]Welcome to Warm Fantasy ENB\r<br />[/u][/size][/color][/font]This ENB is a SweetFX/ENB combination that I happened to stumble upon while trying to create a nice and warm graphical\r<br />setup for my modded Skyrim. It uses the general effects from SweetFX, including bloom, HMR, vibrance effects, and SMAA.\r<br />The included ENB ( which utilizes the latest v.279 ENB binary by Boris Voronstov which can be downloaded [url=http://enbdev.com/mod_tesskyrim_v0279.htm]here[/url]) is used for a wide range of things, from MOAR bloom,\r<br />godrays, additional lighting, reflections, Bokeh DoF effect, and ambient occlusion.\r<br />\r<br />Thusly, it is not all that performance friendly. In the more graphically intensive areas, for example -- standing at the top of the Dragonsreach Stairway overlooking Whiterun -- there will be a substantial 10 - 15 frame drop, however most of the time it will be pretty stable. Indoor areas are typically around 55FPS - 60FPS, and outdoors are usually from 40 - 55 frames.\r<br />\r<br />Keep in mind that my PC is in NEED of a new cpu, as I have a GTX 960 along with an old quad core Intel Core i7 930.\r<br />Taking that into account, if your CPU is  ad least an i5 with 3 Ghz, or more, you&#39;ll probably do just fine -- even with a 700 series GPU.\r<br />\r<br />Feel free to leave suggestions, and questions about the setup -- this is actually my first post, so I&#39;m sure I missed some things.[/center]",
  "categoryId": "97",
  "version": "1.0",
  "author": "Zhalek",
  "createdUnix": "1440054707",
  "updatedUnix": "1440054707",
  "containsAdultContent": false,
  "uploadedBy": "Zhalek",
  "primaryFile": null,
  "files": []
}