{
  "modId": 68933.0,
  "modName": "Dragons Palace",
  "summary": "A buildable Palace for the Dragonborn that&#39;s far more than just a Player Home&#33;\r<br />Buildable through Quest",
  "descriptionHtml": "[img]http://static-4.nexusmods.com/15/mods/110/images/68933-0-1440098401.png[/img]\r<br />\r<br />[center][color=#38761d][size=5][b]A playerhome in the Reach and much more&#33;\r<br />[/b][/size][/color][size=1](&#34;playerhome&#34; may not be the best one-word-description, cause its definately more than that...)\r<br />[/size][/center]\r<br /> \r<br />\r<br />[img]http://static-6.nexusmods.com/15/mods/110/images/68933-0-1440100089.png[/img]\r<br />\r<br />[center][size=3]Ever wondered how the Dragonborn manages to build a damn big house with like 10 Stones and 20 Iron Bars? \r<br />Taking no longer than an hour to construct a whole house from scratch? You are High-Level and got no idea what to do with all your Money and/or your overwhelming amount of metal?\r<br />Yes? Well, than this Mod is definitely for you&#33; \r<br />[/size][/center]\r<br />This is Intended to be a player house for High-Level chars, so this won&#39;t be cheap&#33;  - 5000 Gold to start the quest, about 30.000 Gold overall and about 300 pieces of Iron, Corundum and Dwarven Metal.\r<br />\r<br />\r<br />This mod started as a little private addition for the popular [url=http://www.nexusmods.com/skyrim/mods/14308/]Riverside Lodge[/url], soon expanded to an completely standalone player home. After building for some time, the concept of a house simply plopping out of nowhere in the game kept nagging me. So I decide the house won&#39;t be simply standing there after installing, but instead built by yourself&#33; Let&#39;s be honest: The Heartfires building system is neither the smartest, nor very realistic in any way. For such a big house you&#39;d need workers and TONS of resources to build it. However, the Dragonborn of course can&#39;t stay at the construction site and keep an eye at the ongoing work. Who&#39;s supposed to defeat Alduin then?&#33; \r<br />\r<br />[center][color=#38761d][size=4][/size][/color][img]http://static-4.nexusmods.com/15/mods/110/images/68933-0-1440106770.png[/img][/center]\r<br />[list]\r<br />[*][size=3]A Player Home (obviously) in &#34;Heartfires - Lakeview Manor&#34; Style:[/size]\r<br />[*][size=3]Fully and dynamicaly Navmeshed - your followers always will walk the right way&#33;[/size]\r<br />[*][size=3]Safe Storage[/size]\r<br />[*][size=3]Master Bedroom[/size]\r<br />[*][size=3]Beds for spouses and follower[/size]\r<br />[*][size=3]Crafting: Forge, Smelter, Tanning Rack, Workbench, Sharpening Wheel, Enchanting Table, Alchemy Station, Staff-Making and Spider Crafting Station (Dragonborn DLC&#33;)[/size]\r<br />[*][size=3]Quest to build the Home[/size]\r<br />[*][size=3]Old Mike, as the coordinator of the building process and the one who maintains and repairs the technical devices build into the palace[/size]\r<br />[*][size=3]Construction suites and various construction stages, so you can actually see the building process @ exterior and interior[/size]\r<br />[*][size=3]Your personal guard station: 6 Dwarven Spheres with charging stations, so they&#39;ll never run out of steam[/size]\r<br />[*][size=3]A display room were you can display your greatest Rewards[/size]\r<br />[*][size=3]A sauna/whirlpool to relax (automatic equip/unequip system for NPC&#39;s AND player)[/size]\r<br />[*][size=3]Lots of of new objects (in fact 1.2GB of new meshes and Textures :P) from various Resources and of course some created by myself[/size]\r<br />[*][size=3]Locations in Skyrim, Solstheim and a completely new Worldspace located between Skyrim and Solstheim [color=#ff0000]//evtl am anfang noch ned verfügbar&#33;[/color][/size]\r<br />[*][size=3]A lore friendly system to produce steam for the various dwemer constructs, such as the goods elevator or the Sphere Guards (the background story of the Dwemer Generator can be found trough the quest and trough a book in the engine room)[/size]\r<br />[*][size=3]5 more unique NPCs all fully voiced (no followers)[/size]\r<br />[*][size=3]A dynamical interior (for example the light-beams trough the windows at the entrance hall are synced with the time and weather outside)[/size]\r<br />[*][size=3]Some secrets and eastereggs[/size]\r<br />[/list]\r<br />\r<br />\r<br />[center][b][color=#cc0000][size=4]PLEASE REPORT ALL BUGS UNDER THE &#34;BUGS&#34; SECTION&#33;\r<br />\r<br />[img]http://static-3.nexusmods.com/15/mods/110/images/68933-0-1440507061.png[/img]\r<br />\r<br />\r<br />[/size][/color][/b][/center][size=3]There is a big number of player homes out there and I have a lot of them installed myself. But every time i visit them, it feels like theres a dark empty atmosphere towards them... Sure, many have bards or spouses, but you can&#39;t say much to them. The goal is to make Dragons Palace different, to make a home were you can feel that you are at home. So Dragons Palace should be a place were you can manage your things. A lot of such &#34;things&#34; is provided by other mods. This goal is different and it clearly can&#39;t be reached without the community. So, [/size][color=#38761d][size=3]if [b]YOU[/b] think there have to be a integration/hook into another mod, please post it ito the posts section or make a thread[/size][/color][size=3], Mike or cad will give response and try to make an esp if some usefull connections can be seen.[/size]\r<br />[size=3]To get startet i&#39;ve written two hooks, one for Windstad Mine and one for Nock to Tip, explained below:[/size]\r<br />\r<br />\r<br />[size=4][center]List of Integrations:[/center][/size]\r<br />[list]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/57879/?]Windstad Mine[/url]: Enables a new dialog on Ellina, wich will make her travelling to the mine and transport the ore to your palace[/size]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/65317/?]Nock to Tip[/url]: will change some stuff at the crafting area inside to place the two new workbenches from Nock to Tip[/size]\r<br />[*][size=3]HDT-Hook: HDT-Hair for Ellina and Carol + HDT-Body-Physics for Ellina. Requires  [url=http://www.nexusmods.com/skyrim/mods/53996/?]HDT Physics Extensions[/url] and [color=#1e84cc][url=http://www.nexusmods.com/skyrim/mods/36213/?]HDT HighHeels System[/url][/color].[/size]\r<br />[/list]\r<br />\r<br />\r<br />\r<br />[color=#ff0000][img]http://static-3.nexusmods.com/15/mods/110/images/68933-0-1440108265.png[/img]\r<br />[/color]\r<br />[list]\r<br />[*][size=3]Heartfires DLC[/size]\r<br />[*][size=3]Dawnguard DLC[/size]\r<br />[*][size=3]Dragonborn DLC[/size]\r<br />[*][size=3][url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url] (Seriousley, who don&#39;t have SKSE theese days?)[/size]\r<br />[*][size=3][size=3]I STRONGLY recommend to use [/size][url=http://www.nexusmods.com/skyrim/mods/7059/]Sexy Whiterun[/url][size=3] to get the blue/gold look from the screenshots[/size][/size]\r<br />[*][size=3][size=3]Approximately 1.5 GB on your Harddrive[/size][/size]\r<br />[/list]\r<br />\r<br />\r<br />[size=3][img]http://static-4.nexusmods.com/15/mods/110/images/68933-0-1440109807.png[/img][/size]\r<br />[center][color=#f1c232]Specs and Infos - Seriously, [b]READ IT[/b][/color][/center]\r<br />[list]\r<br />[*][size=3]I recommend 2.5 GB RAM or more (min 1.5 GB RAM) [/size](if you are not sure if your PC can handle it, open console and type &#34;coc 003_DPHouse&#34;, i&#39;ll teleport you directly into the finished interior)\r<br />[*][size=3]The main interior is kinda open and light, so its not possible to use more load doors and different cells. Skyrim will take a little time on enter the main hall, but after entering you&#39;ll have very short loading time.[/size]\r<br />[*][size=3]Main interior is divided with 4 separate room bounds to keep the GPU load as low as it is possible with the amount of models. If requested i&#39;ll eventually will create a fifth room bound, currently I&#39;m not sure if this is needed.[/size]\r<br />[*][size=3]Using an ENB inside the building may cause strange behaviors due to the room bounds. Turning the ENB off (don&#39;t need to uninstall&#33;) inside the house should fix all disappearing objekts etc. I have no idea why, sorry...[/size]\r<br />[/list]   [size=1](After testing a few other interiors it happens in some Vanilla interiors to, so it seems not to be directrly a problem from this modification. Anyway if you know how to fix it, drop a comment :))[/size]\r<br />[list]\r<br />[*][size=3]Over 500 new nif-files and over 700 new Texture Files (thats over 1GB of textures&#33;)[/size]\r<br />[*][size=3]Compressed from nearly 1.8GB to about 600MB using 7zip. NMM will need some time to extract the files, just let it do its thing[/size]\r<br />[*][size=3]Incompatibilitys: This Mod will be probably conflicting with mods that modificates: Cells in Tamriel around -35, -2 (ReachwaterRockExterior01 and ReachwindEyrieExterior01); Cell -35, -4(&#34;ReachwindEyrieExterior&#34;, I moved a Forsworn Camp to this cell&#33;); SolstheimWorld Cell  16, 5[/size]\r<br />[/list]\r<br />\r<br />\r<br />[color=#cc0000][b][center]Credits under &#34;Credits&#34;-Section&#33;[/center]\r<br />IMPORTANT:\r<br />If I&#39;ve forget to credit someone OR you are not happy the way i credit you, PLEASE SEND ME A PM&#33;\r<br />I&#39;m not the one who don&#39;t wanna respect work from others.\r<br />I&#39;ve downloaded nearly 20GB of resources, it can be a bit of a mess, even if I always take a note whenever i download some pieces...\r<br />[/b][/color]",
  "categoryId": "67",
  "version": "1.0",
  "author": "cad435 and DosMike",
  "createdUnix": "1440094866",
  "updatedUnix": "1440094866",
  "containsAdultContent": false,
  "uploadedBy": "cad435",
  "primaryFile": null,
  "files": []
}