{
  "modId": 69054.0,
  "modName": "Gwent Hearth",
  "summary": "A Witcher 2 Home in Skyrim",
  "descriptionHtml": "[center][img]http://i.imgur.com/WWo5Uxj.jpg[/img][/center]\r<br />\r<br />\r<br />This mod adds a small home from Witcher 2 along the creek in Eastmarch Hold next to Darkshade. It&#39;s named after the card game in The Witcher. Most of the meshes are from it and were ported by myself and some of them are ported by Oaristys and are from the Modders&#39; Resource Pack - The Witcher Extension. \r<br />\r<br />It&#39;s a simple home with one room, one bed, cooking pot, alchemy and enchanting stations inside, and all the smithing stations outside. There&#39;s plenty of storage and the interior and exterior have been set to no reset zones so you shouldn&#39;t lose any of your stuff. When you use the alchemy lab, you&#39;ll notice that it shoots you over to the side of the table. This is intentional. Otherwise, you&#39;d be pounding herbs while hovering over the table. There is no marker for the smelter so it is a static station. For lighting outside, there are two lanterns that you can toggle on and off. It is navmeshed inside so followers can go in with you and you can make it their home if you wish. They seem to have trouble using the alchemy station but all the other stations tested out fine. \r<br />\r<br />Using this mod requires the latest updated version of Skyrim. \r<br />\r<br />This is a mod that definitely looks better with ENB. Some of the Witcher textures are a bit lacking and I&#39;ve replaced a few of them with better quality texture resources but I wanted to keep everything as close as I could so I kept that to a minimum. \r<br />\r<br />Installation: \r<br />\r<br />Can be installed with your favorite mod manager or by manually unpacking the bsa and esp into your Skryim Data folder. \r<br />\r<br />Issues: \r<br />Everyone using the high density grass mods, you more than likely will have grass coming up through the smithing deck outside. I&#39;ve tried to tame that down as much as I could but it seemed to be a losing battle. Hopefully it won&#39;t harsh your home buzz too much. \r<br />\r<br />Permissions: \r<br />Anything I&#39;ve ported or hacked together in Nifskope is available to be used in other mods provided those mods are distributed for free.  They are not to be used for anything part of a paid mod system. \r<br />\r<br />Credits:  (Please, see permission section for full links to resources)\r<br />Gwent Hearth features the talents of -\r<br />CDProjekt RED\r<br />Tamira\r<br />Kraeten\r<br />Phitt\r<br />Elianora\r<br />Mrpdean\r<br />Blary\r<br />Darkrider\r<br />Darkfox127\r<br />Langley\r<br />Stoverjm\r<br />Refurb\r<br />MrSiika\r<br />Oaristys\r<br />Tony67\r<br />Lillith\r<br />Raiserfx\r<br />\r<br />Additional Photos provided by Nanoman&#33;",
  "categoryId": "67",
  "version": "1.1",
  "author": "mellowtraumatic",
  "createdUnix": "1440450549",
  "updatedUnix": "1440449845",
  "containsAdultContent": false,
  "uploadedBy": "mellowtraumatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000173239",
      "name": "Gwent Hearth",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34805",
      "fileName": "Gwent Hearth-69054-1-1.rar",
      "uploadedUnix": "1440449845",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5913e5db7b7e68fa787639aab6802cc1a9062679ae42c2651c4256ef582b5c4a/analysis/1440449891/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gwent%20Hearth-69054-1-1.rar?fid=1000173239&ttl=1535857388&ri=8192&rs=8192&setec=f1bb333d55eb6124ee46a759690c4342"
    }
  ]
}