{
  "modId": 69061.0,
  "modName": "Argonian Hearthfires",
  "summary": "A build-your-own home for Argonians (or for those who have the same tastes), with a slight twist. You don&#39;t build any exterior structure, because it&#39;s all underground, and the entrance is underwater.",
  "descriptionHtml": "A build-your-own home for Argonians (or for those who have the same tastes), with a slight twist. You don&#39;t build any exterior structure, because it&#39;s all underground, and the entrance is underwater. The location is the submerged ruin at the Eastern end of Lake Ilinalta, and it will be called Ilinalta Den when you find it. \r<br />\r<br />You do have to dig out the rubble from the larger rooms before you can start furnishing, but that will pay you back by providing some of the materials you need. Once you&#39;ve made enough of the furnishings for it to be a home, you&#39;ll get the chance to add another door on land, so your spouse and kids won&#39;t have to swim in. This is concealed by a large fallen log added when the mod is loaded.\r<br />\r<br />The interior has all the needed amenities, such as a forge and a kitchen, with associated crafting stations. There are beds for player and spouse, and two for adopted children. Alchemy and Enchanting labs are each in their own rooms. The home is relatively small, but cozy. If you do wish to adopt, you&#39;ll need [url=http://www.nexusmods.com/skyrim/mods/29249]Hearthfire Multiple Adoptions[/url] to &#34;bless&#34; the location. \r<br />\r<br />Everything has to be made by the player, and you have to do some Argonian-related quests before the site is available, but you don&#39;t need to buy it. That may make this a suitable choice as a starter home, but to offset that, the prerequisite quests have a minimum level of 14.\r<br />\r<br />More detail is in the fake [url=http://ghastley.org/Skyrim/Docs/ArgonianHearthfires.html]Wiki Page[/url] (also included in the download).\r<br />\r<br />Thanks to Grits for all the testing work, (and to Jensa, Spreads-her-Thighs, Hot-lips, Floozy de Fault, and all the test characters who labored to construct it, some of them multiple times&#33;)\r<br />Thanks to Arthmoor for the idea of clearing rubble with a pickaxe.\r<br />\r<br />Requires: \r<br />[list]\r<br />[*]Hearthfires, mostly for the building materials. A few of the original scripts are used, but most needed to be cloned to new ones. \r<br />[/list]\r<br />\r<br />Known compatibility issues:\r<br />[list]\r<br />[*]Orcs should be using my other mod - [url=http://www.nexusmods.com/skyrim/mods/64038]Orc Hearthfires[/url] - but they&#39;re welcome to use this one too. Anyone who does use both mods may find two options to buy lumber from the mills, if they haven&#39;t build any DLC homes.  This won&#39;t cause any problems, because the homes all share the same lumber stock with the DLC, it will just look confusing if you&#39;re in that situation. If any DLC homes are in progress or built, the DLC dialog replaces all the others.\r<br />[*]Anything changing the piece of land next to the ruin could block the log pile or entrance. I don&#39;t know of any at present.\r<br />[*]Khaiit merchants may prefer to build a wagon instead - [url=http://www.nexusmods.com/skyrim/mods/71553]Khajiit Hearthfires[/url] lets them do so. The same lumber mill dialogue issue applies\r<br />[/list]",
  "categoryId": "67",
  "version": "1.0",
  "author": "ghastley",
  "createdUnix": "1440463021",
  "updatedUnix": "1440459864",
  "containsAdultContent": false,
  "uploadedBy": "ghastley",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000173252",
      "name": "Version 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "817",
      "fileName": "Version 1.0-69061-1-0.7z",
      "uploadedUnix": "1440459864",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/71ab4b2498bba9c45eecc40e5e8d36f0cc66a223076a2ce50923a81f4d087513/analysis/1440459904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%201.0-69061-1-0.7z?fid=1000173252&ttl=1535857397&ri=8192&rs=8192&setec=1c64db87e55052aab8241a2dcd989fe9"
    }
  ]
}