{
  "modId": 69202.0,
  "modName": "Valkoinen Lodge",
  "summary": "A medium-sized player home for a Thane of Winterhold.",
  "descriptionHtml": "[font=Verdana][color=#6d9eeb][size=6][center][u]~Valkoinen Lodge~[/u][/center][/size][/color][/font][center]\r<br />[color=#a4c2f4]A WINTERHOLD THANE&#39;S HOME\r<br />[/color]\r<br />I&#39;ve recently had to do a hard new save for Skyrim, and I was looking for a nice new place for this character. I noticed that in neither vanilla nor Hearthfire that there was a player home for being Thane of Winterhold (But honestly, there isn&#39;t much there anyways). But after downloading JK&#39;s Winterhold and the new Winterhold Rebuilt mods, it sounded right to make something for everyone who might want to stay near the College. \r<br />\r<br />Valkoinen Lodge is a home for warriors or mages, hunters or librarians, and Multiple Adoption friendly (although it only comes with 2 children beds). A note by the chickens state that the lodge is the new home of the Thane (whether that is you or another tenant who never arrives).\r<br />\r<br />[color=#00ff00][size=4]Noteworthy Features: [/size][/color]\r<br />- Aesthetic Dragonborn resources; including basalt cliff face, dark elf furniture, and a couple Netches.\r<br />- Adoption Friendly, and compatible with JK&#39;s Winterhold among other city mods.\r<br />- A (currently static) lighthouse off the coast, providing you as a safe harbor for the town.\r<br />- Sheltered rowboat dock, and fully navmeshed. \r<br />- Six Hearthfire planters, and an oven inside.\r<br />- Beautiful hotsprings aesthetic, a bit to keep you warm on the Broken Coast. \r<br />- Unique interior layout, and a bathroom&#33; \r<br />\r<br />I tried making the interior as artistic, yet rustic and spartan as I could; The home is inspired by my love for the Myst games. Admittedly I held off on using modder&#39;s resources for additional clutter and containers, but I may go back and add a few things sometime. I hope everyone enjoys&#33;\r<br />\r<br />[color=#00ff00]Requirements: [/color]\r<br />- Hearthfire\r<br />- Dragonborn\r<br />\r<br />[color=#00ff00]Compatibility and Location:[/color]\r<br />- It runs far down to the coast west of the College, near Ysgramor&#39;s tomb. It does not change anything about Winterhold, but it modifies the trail leading from the college down to the coastline. [/center]",
  "categoryId": "67",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1440890140",
  "updatedUnix": "1440890080",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000173884",
      "name": "Valkoinen Lodge",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "239",
      "fileName": "Valkoinen Lodge-69202-1-0.zip",
      "uploadedUnix": "1440890080",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f261afd3a0825fde5c06bc5991710a0f3c8f38d04d22f00732a3381e2d035661/analysis/1440890104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Valkoinen%20Lodge-69202-1-0.zip?fid=1000173884&ttl=1535857737&ri=8192&rs=8192&setec=ccec41608f0678a0ff5c3e6094eac2ed"
    }
  ]
}