{
  "modId": 69234.0,
  "modName": "Bau Pet Supplies for Skyrim",
  "summary": "Adds a tiny pet shop in Solitude.",
  "descriptionHtml": "[center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]\r<br />[center][url=http://www.nexusmods.com/skyrim/mods/65163/?][img]http://i.imgur.com/QtD7v94.png[/img][/url][/center][i][center]\r<br />[url=http://gamer-mods.ru/load/tes_v_skyrim/doma_i_lokacii/the_golden_hen_restaurant/15-1-0-3323][/url][/center][/i]\r<br />Hello everybody&#33; This little mod adds a tiny, tiny pet shop in Solitude, to the left of Angeline&#39;s Aromatics, where you can buy clutter and food for your animal friends.\r<br />\r<br />The file has been cleaned with TES5EDIT, [b]requires no DLC[/b][i](although there is a DLC version available too)[/i], is fully navmeshed and has no scripts, so it should be safe for everybody to use. Still, you should always make a backup save before installing ANY mod, in case something goes wrong.\r<br />\r<br />\r<br />\r<br />[color=#1E90FF][size=5][center]== WHAT ==[/center][/size][/color]As stated above, this mod adds a very small pet shop where the player can find assorted pet-themed clutter, food, and perhaps a pet or two. I attached the building to Angeline&#39;s Aromatics, in a small corner that, as far as I can see, has not been touched by any big mods that I am aware of.\r<br />\r<br />Most of the things you can buy are misc items, and they range from pet beds to collars and toys. A few consumables are also available. [b]I am not going to make any patches for needs mods[/b], because who wants to eat pet food, really? Yuck&#33; I&#39;d rather starve to death...\r<br />\r<br />The merchant here works all day, and has what I feel is a decent amount of gold available for bartering. If you have Hearthfire, he has a chance of selling straw, too, but in that case you could just use the Hearthfire version so he&#39;ll be sure to sell it alongside some crafting materials.\r<br />\r<br />\r<br />\r<br />[color=#1E90FF][size=5][center] [img]http://i.imgur.com/vmVELjH.gif[/img] == A WORD OF WARNING  == [img]http://i.imgur.com/vmVELjH.gif[/img] [/center][/size][/color]\r<br />[i]I had [b]a lot[/b] of trouble getting this to work (I am very, very dumb) and got lots of crashes with both the CK and the game itself. As far as I can see, the issues have now been fixed, but still. [b]Download and use at your own risk&#33;[/b] The mod comes packaged into a handy .bsa for easy removal if issues arise. Please let me know if any particular mesh gives you trouble and I&#39;ll see what I can do. Thank you~[/i]\r<br />\r<br />\r<br />\r<br />[color=#1E90FF][size=5][center]== WHY ==[/center][/size][/color]Because I wanted to celebrate the two-year anniversary of my [url=http://www.nexusmods.com/fallout3/mods/19473/?]Bau Pet Supplies[/url] mod for Fallout 3. I have made many mods since then, but that one remains one of my all-time favorites and holds a dear place in my heart. The chew toy I included here is basically the same as the one from that mod.\r<br />\r<br />\r<br />\r<br />[color=#1E90FF][size=5][center]== KNOWN ISSUES AND COMPATIBILITY ==[/center][/size][/color]This mod should be compatible with other mods that edit Solitude, as I am using several (including all of my Solitude merchants) with no problems. But, if you find some issues with other mods you may be using, please let me know so I can list them here.\r<br />\r<br />I have confirmation that this mod works perfectly alongside [i]Dawn of Skyrim[/i] (full pack), the [i]Skyrim Romance Mod[/i] (adds a new shop in town plus a party area and ballroom by the Blue Palace), [i]Holidays [/i]and, conveniently, [i]Pets of Skyrim[/i].\r<br />\r<br />Some of the new items have finicky collision, and may sink through the floor or roll around. I tried to fix them, but just so you know, sometimes they may require some roughhousing in order to stand upright. Lifting them above the ground and dropping them seems to work.\r<br />\r<br />You cannot move the large pet bed once you drop it. This is an issue with the mesh that I was unable to figure out, so you&#39;ll have to add it to your inventory and drop it until you get it where you want it to be. At least this way it won&#39;t get kicked around by NPCs.\r<br />\r<br />The new consumables are compatible out-of-the-box with [url=http://www.nexusmods.com/skyrim/mods/60270/?]RND - Universal Compatibility Patch[/url]. [i][b]I will not make a dedicated patch for it or any other needs mods.[/b][/i] If you want to make one, feel free to do so. You are welcome to send it to me, if you&#39;d like to have it uploaded here -- with credits, of course. \r<br />\r<br />[color=#1E90FF][size=5][center]== HOW ==[/center][/size][/color]To install, extract the contents of your downloaded file to your &#34;[font=Courier New]Steam/SteamApps/Common/Skyrim/Data[/font]&#34; folder. Then activate the mod through your preferred launcher by ticking the checkbox next to the esp. Or you can use your Mod Manager of choice to download the mod automatically. To uninstall, simply delete the files from your Data folder, and you&#39;re good to go. \r<br />\r<br />\r<br />\r<br />[color=#1E90FF][size=5][center]== FAQ ==[/center][/size][/color]\r<br />[color=#F9C7FF][b]- I hate [/b][font=Courier New][thing][/font] [b]and [/b][font=Courier New][thing][/font][b] and [/b][font=Courier New][thing][/font][b]&#33; You should have done [/b][font=Courier New][thing][/font][b] and [/b][font=Courier New][thing][/font][b] instead&#33; And while you&#39;re at it remove [/b][font=Courier New][thing][/font][b] and [/b][font=Courier New][thing][/font][b] and add [/b][font=Courier New][thing][/font][b] and [/b][font=Courier New][thing][/font][b]&#33; And [/b][font=Courier New][thing][/font][b] is NOT LORE FRIENDLY&#33; FIX THIS&#33;[/b][/color]\r<br />- You don&#39;t get to make demands. If you don&#39;t like something in the mod, use the console to disable it, remove it with the Creation Kit or TESEDIT, or sell it off. [url=http://i.imgur.com/XumZOt2.gif]In other words...[/url]\r<br />\r<br />[color=#F9C7FF][b]- I NEED A PATCH FOR [/b][font=Courier New][some needs mod][/font][b]&#33; [b]DO IT&#33; [/b][/b][/color]\r<br />- No. Feel free to make one yourself if you really wanna, upload it to the Nexus and send me a link. Or send me the file directly if you&#39;d like me to upload it here, with credits of course. [url=http://i.imgur.com/Jw9VaAX.gif?1]In other words...\r<br />[/url]\r<br />[color=#F9C7FF][b]- Do these things even do anything? Can you gift them to kids, pets or whatever with Hearthfire?[/b][/color]\r<br />- No, they&#39;re just for decoration. I did give them the existing  &#34;[font=Courier New]GiftChildSpecial&#34; [/font]keyword just in case, but I&#39;m not sure if that will work. I don&#39;t care about the adopting mechanics in Hearthfire so I didn&#39;t implement those, sorry.\r<br />\r<br />[color=#F9C7FF][b]- What do you mean, you can buy pets? Are they followers or what?[/b][/color]\r<br />- No, they&#39;re misc items. You&#39;ll see what I mean when you check the wares that are for sale.\r<br />\r<br />[color=#F9C7FF][b]- The new textures are too low res and ugly&#33; I cannot stand this&#33;[/b][/color]\r<br />- It&#39;s what I had. I downscaled several textures to help reduce the file size, but when it comes to upscaling textures, I am at a loss because I am no good at texturing, so what you see is what you get. [url=http://i.imgur.com/xe2OsXx.gif]In other words...[/url]\r<br />\r<br />[color=#F9C7FF][b]- I hate everything being static&#33; I wanna pick things up&#33;[/b][/color]\r<br />- There are three main reasons why things are static. First, we all know how fidgety collision is in this game and clutter would be flying around all the time. Second, it would greatly hurt framerate to have so many little things moving around at once and the place is already rather demanding, with all of the NPCs inside and all. And third, it gives me much more freedom when it comes to decoration. [url=http://i.imgur.com/AYOKaDI.gif]In other words...\r<br />[/url]\r<br />[color=#F9C7FF][b]- I&#39;m lagging all over the place&#33; Help&#33;[/b][/color]\r<br />- I tested this mod on a heavily modded setup, on a mid-range gaming laptop. I had no performance issues. But, due to all the stuff on the shelves, if you&#39;re playing on a coal-powered machine you will definitively have some performance loss. Feel free to edit the mod and remove some things if you cannot stand it.\r<br />\r<br />[color=#F9C7FF][b]- Can I use some of these files on my own mod?[/b][/color]\r<br />- A bunch of things I&#39;m using are already modder&#39;s resources, so just look around the credits tab to look for what you&#39;d like to use. If you cannot find the thing you want there, it probably means I made it myself. Feel free to ask if you&#39;re not sure.\r<br />\r<br />[color=#F9C7FF][b]- Is this compatible with [/b][font=Courier New][insert mod here][/font][b]?[/b][/color]\r<br />- If you have a mod that makes heavy changes to Solitude there could be issues, although the mod is as clean as it could be. If you find any conflicts, please let me know so I can list them here.\r<br />\r<br />[color=#F9C7FF][b]- How come the mod looks different in my game than your screenshots?[/b][/color]\r<br />- I am using several retextures in my own game and my own SweetFX preset, so results may vary.\r<br />\r<br />[color=#F9C7FF][b]- The mod is awful/glitchy/buggy/etc. I am going to uninstall it and I must let everybody know&#33;[/b][/color]\r<br />- Sad to see you go~\r<br />\r<br />[color=#F9C7FF][b]- The mod sucks&#33;[/b][/color]\r<br />- So does a vaccuum cleaner ;)\r<br />\r<br />[size=4][center][color=#1E90FF]FOR THE FULL LIST OF CREDITS, PLEASE CHECK THE &#34;CREDITS AND PERMISSIONS&#34; TAB [img]http://forums.nexusmods.com/public/style_emoticons/dark/wub.gif[/img]\r<br />[/color][/center][/size][center][center][url=http://www.nexusmods.com/games/users/donate/?mode=straight&id=2543917][img]http://i.imgur.com/V6qmsU9.png[/img][/url][/center][/center][center][/center][center][img]http://i.imgur.com/UJ12AJk.png[/img][/center]",
  "categoryId": "69",
  "version": "1.0",
  "author": "Jokerine",
  "createdUnix": "1441818312",
  "updatedUnix": "1441113422",
  "containsAdultContent": false,
  "uploadedBy": "Jokerine",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000174202",
      "name": "Bau Pet Supplies for Skyrim v1 - No DLC",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22348",
      "fileName": "Bau Pet Supplies for Skyrim v1 - No DLC-69234-1-0.rar",
      "uploadedUnix": "1441110568",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e77454df4d4eb8db618d03ac2fb9370e830a68d599a47687aeac14fd503d07f6/analysis/1441110612/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bau%20Pet%20Supplies%20for%20Skyrim%20v1%20-%20No%20DLC-69234-1-0.rar?fid=1000174202&ttl=1535857766&ri=8192&rs=8192&setec=cf85387603d54d9bed86998589814949"
    },
    {
      "fileId": "1000174207",
      "name": "Bau Pet Supplies for Skyrim v1 - Hearthfire",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22348",
      "fileName": "Bau Pet Supplies for Skyrim v1 - Hearthfire-69234-1-0.rar",
      "uploadedUnix": "1441113422",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e85f3c734d534b2ada45100114a0e3deb9ece61fcaf4ab05bbe905afcb128890/analysis/1441113490/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bau%20Pet%20Supplies%20for%20Skyrim%20v1%20-%20Hearthfire-69234-1-0.rar?fid=1000174207&ttl=1535857766&ri=8192&rs=8192&setec=749dd4b5cbf8080fed4da2d7f1f4fd26"
    }
  ]
}