{
  "modId": 6925.0,
  "modName": "5 alternate starts",
  "summary": "Gives 5 new starting locations and characters.",
  "descriptionHtml": "The blades apprentice: Just crossed the border into skyrim looking for his lost master, but fears the worst for his master left him a mysterious note...\r\n\r\nBeast tamer: Lives off of the bountiful land of skyrim and is skilled in calling on the help of the creatures in the land.  However, as trouble stirs in the land, the humble forest dweller may fill a role that is less...humble.\r\n\r\nPaladin: As a member of the Vigilantes, it is his duty as to protect innocent people from the thralls of evil, he may have to destroy more than evil spirits in the near future.\r\n\r\nThe Drunk: Seemigly useless, except for the endless amout of booze he/she can consume is actually a master of the \\\"drunken fist\\\" hand to hand tequnique.  The drunk seems harmless until trouble is brewed, then they become a flury of fists. But will alchohol and fists be enough to face the dangers in the near future.\r\n\r\nThe soul Harvester: Frowned appon by society the soul harvester is actually a benevolent creature that captures souls to enforce the balance of spiritual energy in the realm of the humans.  The powers of the soul harvester are only limited by the strength and number of souls they can collect, theirs weapons and armor often are of legendary status.  The soul harvester will be a fitting match for the soul eater, Alduin.\r\n\r\nCurrently in beta stages until the construction kit is realeased, then each character will have a full quest line to integrate them fully into the game.\r\n\r\nUse my files freely but if you are to share them, at least give credit where credit is due.",
  "categoryId": "24",
  "version": "1.0",
  "author": "novicemodder215",
  "createdUnix": "1327371680",
  "updatedUnix": "1327372861",
  "containsAdultContent": false,
  "uploadedBy": "novicemodder215",
  "primaryFile": null,
  "files": [
    {
      "fileId": "22542",
      "name": "Alternate Start",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Alternate Start-6925-1-0.rar",
      "uploadedUnix": "1327372861",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c477f34a648e7b6d9ee79068c634a7b65e83e0177b723d1e256d7b970dd6ddd5/analysis/1406634483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternate%20Start-6925-1-0.rar?fid=22542&ttl=1535764663&ri=8192&rs=8192&setec=848d00b326e6a044a4a1cedd7cd78fbd"
    }
  ]
}