{
  "modId": 69391.0,
  "modName": "Skyrim Mod Initializer",
  "summary": "SMI is a program used to automate the installation of a mod list. It is currently in development and is not feature complete.",
  "descriptionHtml": "[center]Officially discontinued, at least for the foreseeable future.\r<br />[url=https://www.reddit.com/r/skyrimmods/comments/3qa854/smi_project_status/]https://www.reddit.com/r/skyrimmods/comments/3qa854/smi_project_status/[/url]\r<br />If you want to continue developing SMI grab the source code and implement whatever you need.\r<br />\r<br />Skyrim Mod Initializer is currently in development. Many features are not implemented yet and although it has been tested it may be unstable. These builds are primarily for testing purposes. They may be useful for end users - see the limitations section for more information.\r<br />Source code: [url=https://github.com/stalblar/SkyrimModInitializer]https://github.com/stalblar/SkyrimModInitializer[/url][/center]\r<br />\r<br />[b]Description[/b]\r<br />SMI is a program to install a mod list as specified in a json file without human intervention. It is designed to work with Mod Organizer but may function with other mod managers in the future. Currently an x86_64 linux build and a 32bit windows build are available. OSX and 32bit linux builds are planned. Please report any problems you encounter and make feature requests here and/or on github. Post complete terminal output along with any bug reports - if anything failed or returned 1 something broke.\r<br />\r<br />[b]Usage[/b]\r<br />SMI is run in a terminal with the name of the json file to use as an argument. It must be run from the directory the executable is in and the json file must be in the same directory as the SMI executable. For example, &#34;smi.exe example.json&#34; would execute SMI using example.json for instructions.\r<br />\r<br />You will be prompted to enter the location of the archives of the mods you are installing, the location of MO&#39;s data directory, and the location of MO&#39;s loadorder.txt file. The information your enter here will be stored in config.txt and automatically used if SMI is executed again; you will be prompted for the information again if config.txt is deleted. That is all the input SMI needs - after you enter it everything in the json file is processed to install the specified mods.\r<br />\r<br />The included example.json file will install Arissa and SkyUI. Only name, archiveName, and lofiles are currently used. The contents and structure of input files will change as I implement more features.\r<br />\r<br />[b]Limitations[/b]\r<br />1. Currently SMI can only handle mods with simple file structures where everything to go in your data folder is on the top level of the archive. Any other file structure (fomod etc) will not install properly.\r<br />\r<br />2. Automatically downloading any mods in the input file that you don&#39;t already have is a planned feature but probably won&#39;t be implemented for a while. The same goes for version tracking, updates, and any other online functionality.\r<br />\r<br />[b]Dependencies\r<br />[/b]Almost all of SMI&#39;s dependencies are statically or dynamically linked and packaged with the program. You shouldn&#39;t need to install anything else.\r<br />\r<br />[b]Licensing[/b]\r<br />SMI is released under the MIT license. Use, modify, and redistribute it as you see fit. LICENSE.txt contains the full text of all relevant licenses.\r<br />\r<br />[b]Credits[/b]\r<br />steelblue - SMI\r<br />Milo Yip and other contributors - rapidjson, used for parsing json\r<br />Tim Kientzle and other contributors - libarchive, used for extracting archives\r<br />Boost developers - boost, used for filesystem functions",
  "categoryId": "39",
  "version": "v1",
  "author": "steelblue",
  "createdUnix": "1441394987",
  "updatedUnix": "1441394987",
  "containsAdultContent": false,
  "uploadedBy": "stalblar",
  "primaryFile": null,
  "files": []
}