{
  "modId": 69410.0,
  "modName": "Uchiha Clan Nagato path",
  "summary": "Simply put this is a bat file I made for users of the Uchiha Clan mod but who don&#39;t have or want MCM.",
  "descriptionHtml": "Simply put this is a very simple bat file I made for users of the Uchiha Clan mod, but who don&#39;t have or want MCM. Note that if you want it to work you must either make sure the Uchiha clan mod is the 27th loaded mod or change the bat file&#39;s module numbers accordingly. Also all modifications this bat file does are considered cheats and will not be supported by the original mod author.\r<br />\r<br />Changes the bat file does:\r<br />\r<br />Sets the player in Nagato&#39;s path and adds the Rinnegan: awakening spell. Works on any race. It also multiplies the gravitational powers by 10 from their original settings making them generally one shot. I also modified the cooldown time to account for spell charging so you should have a 5 second delay.\r<br />\r<br />Secondary Notes:\r<br />The rinnegan will not automatically activate. Upon use of the Bat file. I only made and published this mod because I wanted an immersion experience from the beginning as Nagato without having to do a bunch of stuff before hand that ruins the experience for me. The power boost is 10 times so it is easy to renumber it relative to the original power.",
  "categoryId": "40",
  "version": "1",
  "author": "LordCruaver",
  "createdUnix": "1441443095",
  "updatedUnix": "1441443046",
  "containsAdultContent": false,
  "uploadedBy": "LordCruaver",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000174703",
      "name": "NagatoPath.zip",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "NagatoPath.zip-69410-1.zip",
      "uploadedUnix": "1441443046",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ad526ec372fafff35e25083743cf99284ab0c280802bfec5d5f6596d43e14fdd/analysis/1441443063/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NagatoPath.zip-69410-1.zip?fid=1000174703&ttl=1535857924&ri=8192&rs=8192&setec=6187e49ba6171485aaa7fdfcac2a5033"
    }
  ]
}