{
  "modId": 69459.0,
  "modName": "The Staff Of Magnus - Truly The Most Powerful Staff In Tamriel",
  "summary": "This Small Mod increases the power of the staff of Magnus in order to make the staff truly the strongest staff in the game.",
  "descriptionHtml": "NOTE:\r<br />If anyone would like to take in game screenshots of their character using the mod, please feel free to send them to me through PM, and I will put them on the page and Credit you.\r<br />\r<br />\r<br />When I first played through the College of Winterhold questline, I was rather excited to see what the supposedly &#34;Most Powerful Staff in all of Tamriel&#34; Would be like, and was completely disappointed. As a result of this, I have created a mod that alters the effects of the staff so that it truly is a force to be reckoned with. The new staff has unlimited charge so that Soul Gems are never needed with it. Another feature is that when attacking enemies with the staff, the player&#39;s vision will go dark as a result of the complete and utter power that resonates from the staff. \r<br />\r<br />New effects of the staff include:\r<br />-   The Original enchantment of magicka drain, but boosted to be more powerful (I had to leave this in as to not result in any bugs with the college story.)\r<br />-   Spark damage, strong enough to disintergrate the most dangerous of foes.\r<br />-   Deep Freeze Paralysis, to slow and hold back your foes whilst you carry on to destroy them.\r<br />\r<br />An Extra Feature Of The Mod:\r<br />\r<br />The Ring of Magnus:\r<br />\r<br />The long lost sister artefact of the Staff of Magnus has recently been located by some of the scholars at the College of Winterhold, and the location has been revealed to be the Dragon Priest Sanctuary at Labyrinthian. It has been agreed upon the scholars to only disclose this information to YOU, the Dragonborn, as they believe you are the only one who could wield that power. Just approach the Sanctuary at Labyrinthian and put on the Wooden Mask in order to gain access to the room. You will find the ring inside one of the Chests. \r<br />\r<br />Effects of the ring include:\r<br />\r<br />-   Invisibility whilst wearing the ring.\r<br />-   Summoning an Ancient Hero whilst wearing the ring.\r<br />\r<br />\r<br />If you have any questions: Post in the Comments section.\r<br />If you have any suggestions for the mod: PM me on Nexus.\r<br />\r<br />Installation:\r<br />\r<br />-   Option 1: Download through NMM and activate on there to start the mod.\r<br />-   Option 2: Download manually, and place all files in your Skyrim - Data Folder.\r<br />\r<br />Future Plans For The Mod:\r<br />\r<br />- Fix Invisibility so that it is on permanently whilst wearing the Ring Of Magnus, ie does not go off once activation or attacking.",
  "categoryId": "55",
  "version": "1.0",
  "author": "TiNyTeRRoR180",
  "createdUnix": "1441555484",
  "updatedUnix": "1441558474",
  "containsAdultContent": false,
  "uploadedBy": "TiNyTeRRoR180",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000174916",
      "name": "Staff Of Magnus - Truly The Most Powerful Weapon In All of Tamriel 1.2",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Staff Of Magnus - Truly The Most Powerful Weapon In All of Tamriel 1.2-69459-1-0.rar",
      "uploadedUnix": "1441558474",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/57a8c70a955ca3d9e8840bd6febeb61d7bfd4732a7d43d1ab8b1bed047345cfb/analysis/1441558503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Staff%20Of%20Magnus%20-%20Truly%20The%20Most%20Powerful%20Weapon%20In%20All%20of%20Tamriel%201.2-69459-1-0.rar?fid=1000174916&ttl=1535857971&ri=8192&rs=8192&setec=4d0f8c1d3d06c7ada572bd7e1a247fea"
    }
  ]
}