{
  "modId": 69526.0,
  "modName": "The Blade of Awe (AdventureQuest)",
  "summary": "A strong sword of many magical powers.",
  "descriptionHtml": "STEAM VERSION: [url=http://steamcommunity.com/sharedfiles/filedetails/?id=514884991]http://steamcommunity.com/sharedfiles/filedetails/?id=514884991[/url]\r<br />\r<br />\r<br />\r<br />The [b]Blade of Awe[/b] is a weapon of legend, said to be from a foreign land.\r<br />\r<br />[b]--Backstory--[/b]\r<br />Only adventurers (or treasure hunters) with persistence, and patience, will be able to traverse Skyrim in search for this weapon. The said legend describes the weapon as being broken into pieces that were then scattered far and wide. It also explains that there are a total of 4 pieces, as well as a stonewrit (a mould in which the sword is forged). No one truly knows where they are, but those who found the pieces, and kept them secret, hidden from the rest.\r<br />\r<br />[b]--Mod Summary--[/b]\r<br />The Blade of Awe is a strong sword of many magical powers that isn&#39;t easy to obtain (unless you cheat, of course). The blade requires 5 items to be created: the Stonewrit, the Blade, the Hilt, the Handle, and finally, the Runes. All 5 pieces can be found in most dungeon chests and dungeon boss chests with a 25% chance of finding one. Once you&#39;ve found them all, head to your local forge and craft it. (Requires Arcane Blacksmithing and Daedric Smithing.)\r<br />\r<br />The signature ability of the Blade of Awe is that it has a small chance of casting one of six (I only was able to create 4/6 of them, as two are technically complex, and possibly not possible.) special powers when an enemy is hit. These include: Health Vampire, Mana Vampire, summon the Guardian Dragon, and Powerword Die (summons Death). There is a 10% chance of them even being cast. If the 10% is reached, then each special power has a percent chance out of 100% to be picked over the others.\r<br />\r<br />If you manage to complete the Blade of Awe, two other important items can be found to further enhance the sword. These items are two books, having a loot rate of 50%, and are in the same treasure chests as the pieces of the sword. These spells allow the player to alter, or revert, the Blade of Awe into one of seven forms. Those include: Fire, Water, Wind, Energy, Ice, Light, and Dark. Most of them, their effects are pretty self-explanatory, but I&#39;ll allow you to find out for yourself. The books are dubbed &#34;The Secrets of the Blade of Awe,&#34; (or vol. 2), so keep an eye out.\r<br />\r<br />The Blade of Awe is originally from the 2D online adventure game AdventureQuest. I was always fascinated by the idea of the sword and its design. That being said, I created a 3D version of it. Enjoy&#33;\r<br />\r<br />\r<br />\r<br />\r<br />[b]--Found a Bug?--[/b]\r<br />Don&#39;t hesitate to share it with me&#33; Please post a comment describing the bug&#33; If you&#39;re just lazy, post it anyway&#33;you&#39;re just lazy, post it anyway&#33;",
  "categoryId": "36",
  "version": "1.1",
  "author": "Kyle8497",
  "createdUnix": "1441744578",
  "updatedUnix": "1442119154",
  "containsAdultContent": false,
  "uploadedBy": "Kyle8497",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000175804",
      "name": "The Blade of Awe",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9558",
      "fileName": "The Blade of Awe-69526-1-1.zip",
      "uploadedUnix": "1442119154",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/57c8bc3d335f49502a80dc72f1f2c43311ad04d86b7b97373b9d3331ca068026/analysis/1442119219/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Blade%20of%20Awe-69526-1-1.zip?fid=1000175804&ttl=1535858060&ri=8192&rs=8192&setec=ec674513d79fbba10493af87abdfd31c"
    }
  ]
}