{
  "modId": 69543.0,
  "modName": "Lepidoptera Of Skyrim",
  "summary": "A total rework of the base meshes and textures of the moths and butterflies of Skyrim. Includes all new ingredient meshes as well as ingredient jars. Textures are 4x the size of the originals.",
  "descriptionHtml": "[url=http://s1072.photobucket.com/user/Donald_Edwards/media/main_zpszr9g200l.jpg.html][img]http://i1072.photobucket.com/albums/w374/Donald_Edwards/main_zpszr9g200l.jpg[/img][/url]\r<br />\r<br />Hello everyone. Sorry that the mod was down for a period of time. I wanted to verify that the meshes work in \r<br />SSE before re-posting it. I have been testing my various mods in SSE to ascertain what if anything needs to be done. \r<br />I am happy to say that an SSE version will ready, although it will be under a new name. I feel the present name \r<br />causes some confusion as to what its all about and it think it also why the mod was not excepted at G.E.M. \r<br />For Skyrim players wanting an SSE version look for a mod called &#34;True Butterflies & Moths Of Skyrim&#34; in the \r<br />next day or so. Thanks for the support and I am back to modding Skyrim. \r<br />\r<br />[b]Description:\r<br />\r<br />[/b]Lepidoptera, pronounced [lep-i-dop-ter-uh]is the family of insects that contains Butterflies and Moths. \r<br />This mod has been a work in progress on and off for over three years. I was always very disappointed \r<br />and shocked that Bethesda gave us the game with a horribly distorted and unnatural Monarch butterfly, \r<br />but also simply chose not to take the time to make the Luna or the Blue/moth butterfly at least correct also\r<br />bothered me. Having a background in the study of these magnificent creatures and seeing the total lack of \r<br />care that went into the creation of them never sat well with me. I mean other game studios can do them \r<br />right, so why did Bethesda drop the ball. I wanted them fixed and tried various mods over the years. But\r<br />none of them did it quite right and they never really addressed the textures and other elements of the \r<br />meshes involved. I will be the first to admit that mine are far from perfect either, at least my answer for \r<br />the Monarch is a bit closer to the real thing even though it is a bit chubby. The Luna and Blue moth were \r<br />simply badly textured from the start. They simply took the upper wing texture and mirrored it to the lower \r<br />wing. The end result looked bad and we all know what it did to the Monarch ingredient wings. \r<br />\r<br />My answer was to create all new textures 4X the resolution of the originals, and to alter the UV-mapping of \r<br />the meshes so that they would fit the wings in the right way, but to also add an Alpha channel to the mix so \r<br />that the edges of the wings are more natural and don’t look like they were cut out with a pair of scissors.\r<br />The end result was a much more natural looking and dare I say better. As time went on I started to create \r<br />many more Butterflies and Moths for the game, but I never took the next step of getting them into the game. \r<br />\r<br />Along the way I also decided to tackle the worst offender of them all, the Ancestor Moth. For the first part \r<br />it is simply shaped like no real moth in the world, and the texture used was very low quality. Again this mesh \r<br />was using the mirrored trick to UV-map both wings. The first thing I did was to fix that. Then I wanted the \r<br />Ancestor moth to be based on something that had a powerful historical lore to it, and to make a statement. \r<br />There is no other moth that does this better than the Deaths Head moth. Throughout history it has had a \r<br />reputation as a harbinger of war, pestilence, and death to man and beast alike. If there was going to any \r<br />moth that the famous Moth Priests held in esteem it would be this one. I then UV-mapped each and every one \r<br />of the moths in the cloud assets used in the DLC to match as close as possible to the single free flying moth.\r<br />\r<br />That pretty much covers what this mod is going to do. It is going to substitute my altered versions of the stock\r<br />meshes with new more accurate textures. The Blue moth/butterfly has been completely re-textured and it now \r<br />based on a Philippine Swallowtail. You will find that it is very reflective and shiny in game. This is intentional as \r<br />I have set this moth to have environmental shaders to give i a bit of an iridescent look. I re-textured the moth \r<br />and butterfly in a jar as well and they are also included in this release. \r<br />\r<br />I originally did a simple re-texture of the ingredient wings. But after entering into collaboration with Kryptopyr \r<br />we came up with the idea to replace the wings with actual ingredient meshes that are based on the whole body, \r<br />instead of just the wings. So with this mod you find that you no longer just get a set of wings when you catch a \r<br />moth of butterfly. Instead you get a whole butterfly or moth instead, just like you get with \r<br />the Dragonfly and the Bee ingredients. It really does make more sense.\r<br />\r<br />The rest of the various moths and butterflies I made I handed off to Kryptopyr to add to her upcoming mod. \r<br />She will be releasing it very soon and is designed from the beginning to work hand in hand with my mod. No \r<br />patches will be needed to use the mods together, this mod covers the base meshes hers will cover and extend \r<br />on that. I will also be releasing all the moths and butterflies I have made as resources so that mod makers can \r<br />add then as they see fit. Some mod makers may also wish to re-texture the assets, but be forewarned that the \r<br />way I have separated the fore and hind wings UV-map makes lining up these wings a bit of a tedious task.\r<br />\r<br />One last note, this mod adopts wiseman303&#39;s Critter Fixes, which means that the collision meshes have adopted \r<br />his settings so that the butterflies and moths do not bump you out of the way when you come into contact with them.  \r<br />\r<br />[b]Installation:[/b]\r<br />\r<br />Installing the mod can’t be any simpler than downloading it and using your mod manager of choice and letting it put \r<br />everything in place. This is a simple replacement mod so no special FOMOD scripting needs to be done. If you are using \r<br />any mod that changes the moths and butterflies they will be overwritten by this mod. I have changed the location of the \r<br />mods texture paths so that they will not impact stock texture locations. If you are using another mod that alters the\r<br />butterflies and moths you may want to remove it first. [b]\r<br />\r<br />Compatibility: \r<br />\r<br />[/b]It should be compatible with any mod out there as long as it does not alter the base butterfly and moth’s meshes and \r<br />textures in game. If you are using Wiseman303&#39;s Critter Fixes they should work fine. My mod will overwrite Wiseman303’s\r<br />meshes, but mine have the same settings so that should not be an issue.\r<br />\r<br />As for 83Willows 101BugsHD, you need to remove it. Because my meshes have entirely new UV-maps her mod will simply \r<br />not look right. Her textures will not line up properly and there is nothing I can or will do to fix this. 101BugsHD does not \r<br />use custom meshes, but the original base meshes and all re-texture work was done from inside the Creation Kit.\r<br />I am confident that once Kryptopyr’s mod is released 101 bugs simply will not be needed anymore. It is a 4 year old \r<br />mod and has not seen any updating in a very long time. And because of the way it was made it would tend to hold back \r<br />other mods that need to replace those meshes. Such as in the way mine does. I simply could not make the meshes work \r<br />with my textures and not break any other mods out there that do simple re-textures in engine. If this is a problem than \r<br />“Lepidoptera Of Skyrim” is simply not going to be for you.  [b]\r<br />\r<br />Future:\r<br />\r<br />[/b]This is a one shot deal. I handed over all the other Butterflies and Moths to Kryptopyr so she could integrate them into her mod. \r<br />She is making even more to add to what I gave her. So her mod is going to be pretty big. I still of course still own all of my\r<br />original meshes and textures and will be releasing them as resources once she has her mod released. That way other mod \r<br />makers can use the assets in future mods and if they have the skill and time to learn how I UV-mapped the textures to the\r<br />meshes they can make their own. I have another big project I have been neglecting as of late and I need to get back to work\r<br />on it and finish it. I think spending 3 years on and off on this mod is more than enough time spent.\r<br />It’s been a learning experience and I hope everyone enjoys it. [b]Credits and \r<br />\r<br />Permissions:\r<br />\r<br />[/b]I must give credit toWiseman303 for fixing the collision glitch with these meshes. I had already made most of them when \r<br />I was asked about the collision issue by Kryptopyr. She pointed me to his mod and instead of having to rebuild everything \r<br />on his .nif files I simply duplicated his collision code into the ones I had already made.It worked. And of course to Kryptopyr, \r<br />if not for her interest in a picture of the moths and butterflies I had posted this simply would have never been released. \r<br />Thanks for prodding me into it. And of course Bethesda for giving us a great game, even if the meshes are not perfect. \r<br />Hey they get it 95% right most of time. \r<br />\r<br />Updates:\r<br />Version 2.0b\r<br />\r<br />Complete Alchemy and Cooking Overhaul  compatibility version added. This version simply removes the esp file\r<br />as it is simply not needed do to CACO taking over and handling this issue. You will still need to use the main mod \r<br />to cover the base Butterflies and Moths as Kryptopyr does not include them in her mod. \r<br />This is only for the Dawnguard version as it is required for Complete Alchemy and Cooking Overhaul. \r<br />If you already  using the Dawnguard version version you can simply turn off the esp file to get the same result.\r<br />\r<br />\r<br />Version 2.0\r<br />\r<br />Fixed the CTD crash bug that occurred while trying to gather Ancestor moths in the Glade in Dawnguard. I also was informed by\r<br />Kryptopyr I had missed a moth mess that is used in the Glade, the mesh has been given the same treatment the others have and is \r<br />now included in the mod. I was also informed that when killing and harvesting moths and butterflies either by melee weapons or\r<br />by shouting that you would receive two moths or butterflies instead of one. This was simply something that had slip by and I had \r<br />not even given it a thought too. In my games I have just never thought to use shouts or weapons on these critters, I just walk up and \r<br />gather them myself. Kryptopyr was aware of this and quickly made a patch for the mod, thanks once again Kryptopyr. Do to this,\r<br />I have separated the mod into to two forms now, one for the base game and one for Dawnguard. Included in each will be the .esp\r<br />file to adjust the harvest amounts. The .esp files are only required if you want to apply this fix. So if you want to use this mod and\r<br />are running close to the 256 mod limit, no problem just don&#39;t activate the .esp file in your load order. The mod will work fine, but \r<br />be aware that you you will get two moths or butterflies for each single one harvested. I believe that covers all the changes for now.",
  "categoryId": "29",
  "version": "V2.0",
  "author": "Impulseman45",
  "createdUnix": "1441783795",
  "updatedUnix": "1443757585",
  "containsAdultContent": false,
  "uploadedBy": "Impulseman45",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000177679",
      "name": "Lepidoptera Of Skyrim for Base Game",
      "version": "V2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "612",
      "fileName": "Lepidoptera Of Skyrim for Base Game-69543-V2-0.7z",
      "uploadedUnix": "1443078061",
      "modVersion": "V2.0",
      "virusScanUrl": "https://www.virustotal.com/file/5ade5d8c40414175df7c882af5ff2962e9b081e392a9146e36c910e3ac3f8482/analysis/1443078124/",
      "changelogHtml": " Separated the mod into two distinct versions, one of for Base game and for Dawnguard users. Also implemented a fix for the Crash To Desktop (CTD) bug that was discovered when gathering the Ancestor moths in the Glade when doing the main Dawnguard quest. I was was also informed about and issue when harvesting moths and butterflies while using Melee weapons and shouts that gave you two full moth or butterfly bodies. This was simply and oversight on my part. I had forgotten that when when you harvest butterflies and moths the game would give you two sets of wings, but since my mod replaced the wings with full body meshes the player was getting two of these new meshes instead of just one. Kryptopyr was aware of this this issue and had already implemented a fix in her mod. She was able to make two patches to fix this issue. One for the Base game and one for Dawnguard. I have rolled these into the newest version of the mod and in so doing split the mod into two versions that cover either the Base game of the Dawnguard versions. The ESP files are strictly optional and do not have to be used if you are short on load order space. They have no barring on the mod other than fixing the harvesting issue. One last thing was brought to my attention while Kryptopyr and I were were working on the CTD issue with the mod, and it was I had missed a mesh that is used in the Glade. The Mesh that had moths flying in a column of light. I have since made the proper alterations to the mesh so that is matches the others and it has been tested and past without any CTD bugs.   <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lepidoptera%20Of%20Skyrim%20for%20Base%20Game-69543-V2-0.7z?fid=1000177679&ttl=1535858073&ri=8192&rs=8192&setec=b13228dc23204d95d7e7ad1f47c7cbb4"
    },
    {
      "fileId": "1000177680",
      "name": "Lepidoptera Of Skyrim for Dawnguard DLC",
      "version": "V2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "922",
      "fileName": "Lepidoptera Of Skyrim for Dawnguard DLC-69543-V2-0.7z",
      "uploadedUnix": "1443078239",
      "modVersion": "V2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e12bef3aa1c6cd4eec174e337f8ba4e38324eee95e473df9b20cc0128bae1c9d/analysis/1443078244/",
      "changelogHtml": " Separated the mod into two distinct versions, one of for Base game and for Dawnguard users. Also implemented a fix for the Crash To Desktop (CTD) bug that was discovered when gathering the Ancestor moths in the Glade when doing the main Dawnguard quest. I was was also informed about and issue when harvesting moths and butterflies while using Melee weapons and shouts that gave you two full moth or butterfly bodies. This was simply and oversight on my part. I had forgotten that when when you harvest butterflies and moths the game would give you two sets of wings, but since my mod replaced the wings with full body meshes the player was getting two of these new meshes instead of just one. Kryptopyr was aware of this this issue and had already implemented a fix in her mod. She was able to make two patches to fix this issue. One for the Base game and one for Dawnguard. I have rolled these into the newest version of the mod and in so doing split the mod into two versions that cover either the Base game of the Dawnguard versions. The ESP files are strictly optional and do not have to be used if you are short on load order space. They have no barring on the mod other than fixing the harvesting issue. One last thing was brought to my attention while Kryptopyr and I were were working on the CTD issue with the mod, and it was I had missed a mesh that is used in the Glade. The Mesh that had moths flying in a column of light. I have since made the proper alterations to the mesh so that is matches the others and it has been tested and past without any CTD bugs.   <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lepidoptera%20Of%20Skyrim%20for%20Dawnguard%20DLC-69543-V2-0.7z?fid=1000177680&ttl=1535858073&ri=8192&rs=8192&setec=a337bc170af164cd558e3e8d8d103f08"
    },
    {
      "fileId": "1000178939",
      "name": "Lepidoptera Of Skyrim for Complete Alchemy and Cooking Overhaul",
      "version": "V2.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "922",
      "fileName": "Lepidoptera Of Skyrim for Complete Alchemy and Cooking Overhaul-69543-V2-0b.7z",
      "uploadedUnix": "1443757585",
      "modVersion": "V2.0b",
      "virusScanUrl": "https://www.virustotal.com/url/7e9d7657ec4edf23b92193aa94d37be859ace1ebd89efbed33df6dd69cd221c3/analysis/1443757625/",
      "changelogHtml": " Added Complete Alchemy and Cooking Overhaul or CACO mod compatibility. My mod was and is compatible from the start as it was designed that way in cooperation with Kryptopyr. All this additional version does is removed the added ESP that was included in the Dawnguard version of the mod. By doing this it allows CACO to handle the problem of the double body harvest issue. If you already have the Dawnguard version installed you can simply deactivate the esp and let CACO do the job. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lepidoptera%20Of%20Skyrim%20for%20Complete%20Alchemy%20and%20Cooking%20Overhaul-69543-V2-0b.7z?fid=1000178939&ttl=1535858074&ri=8192&rs=8192&setec=abeb7a2487820549060ec20cb5c82328"
    }
  ]
}