{
  "modId": 69686.0,
  "modName": "Soul Gems Craftable With Fragments",
  "summary": "This mod adds crafting recipes for soul gems as well as the use of soul gem fragments for crafting. ",
  "descriptionHtml": "This mod adds crafting recipes for soul gems based on the formulas from Requiem which use Moonstone and Quicksilver. I always thought that system made sense as a viable system for creating soul gems, as the materials are used by the Elves who have an affinity for magic. \r<br />\r<br />In Requiem, the creation of soul gems is tied to perks. In this mod, there is a skill level requirement in order to be \r<br />compatible with any perk overhaul mod. \r<br />\r<br />The skill and material requirements are as follows:\r<br />\r<br />[list]\r<br />[*]4 Petty Soul Gems: 1 Refined Moonstone Ingot, 1 Quicksilver Ingot, 15 Smithing and Enchanting\r<br />[*]2 Lesser Soul Gems: 1 Refined Moonstone Ingot, 1 Quicksilver Ingot, 30 Smithing and Enchanting\r<br />[*]1 Common Soul Gem: 1 Refined Moonstone Ingot, 1 Quicksilver Ingot, 45 Smithing and Enchanting\r<br />[*]1 Greater Soul Gem: 2 Refined Moonstone Ingots, 2 Quicksilver Ingots, 60 Smithing and Enchanting\r<br />[*]1 Grand Soul Gem: 4 Refined Moonstone Ingots, 4 Quicksilver Ingots, 75 Smithing and Enchanting\r<br />[*]1 Black Soul Gem: 1 Filled Grand Soul Gem, 1 Daedra Heart, 95 Smithing and Enchanting\r<br />[/list]\r<br />Additionally, Soul Gem Fragments are added for crafting purposes. Due to Bethesda so generously including 5 types of soul gem fragments, the Smelter is used to create &#34;Soul Gem Basic Fragments&#34; at a 1 to 1 ratio. The skill requirements to create any level of soul gem are the same as to create with Moonstone and Quicksilver. Black soul gems must be crafted with the previous requirements. \r<br />\r<br />Soul Gem Basic Fragments required for each level of soul gem are as follows:[list]\r<br />[*]Petty - 3 Fragments\r<br />[*]Lesser - 4 Fragments\r<br />[*]Common - 5 Fragments\r<br />[*]Greater - 8 Fragments\r<br />[*]Grand - 10 Fragments\r<br />[/list]\r<br />Finally, each level of soul gem is able to be broken down into fragments, at a loss compared to what is required for creation. Grand and Black Soul \r<br />Gems get the same number of fragments as Greater Gems. \r<br />\r<br />Soul Gem Basic Fragments given on breakdown for each level of soul gem are as follows:\r<br />\r<br />[list]\r<br />[*]Petty - 2 Fragments\r<br />[*]Lesser - 3 Fragments\r<br />[*]Common - 4 Fragments\r<br />[*]Greater - 5 Fragments\r<br />[*]Grand - 5 Fragments\r<br />[*]Black - 5 Fragments\r<br />[/list]Now, it is accurate that 5 Petty Soul Gems can be broken down to create 1 Grand Soul Gem. However, the skill level requirements are included as \r<br />balance. Further, for Grand Soul Gems in particular, fresh ingots are added as a requirement due to the complexity of Grand Gems (and adds the\r<br /> element of scarcity of Quicksilver in particular). \r<br />\r<br />I&#39;m aware that there are other mods that do similar things. However, I was personally not satisfied with the systems used. I believe that Moonstone\r<br /> and Quicksilver are a reasonable source for soul gems, and that a high knowledge of Smithing and Enchanting are required to create soul gems. \r<br />\r<br />This mod should be compatible with all mods including crafting and perk overhauls. [url=http://www.nexusmods.com/skyrim/mods/8421/?]\r<br />[/url]",
  "categoryId": "100",
  "version": "1.0",
  "author": "feanarosurion",
  "createdUnix": "1442186710",
  "updatedUnix": "1442186698",
  "containsAdultContent": false,
  "uploadedBy": "feanarosurion",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000175952",
      "name": "soulGemCrafting.7z",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "soulGemCrafting.7z-69686-1-0.7z",
      "uploadedUnix": "1442186698",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/432c9601349cb70648c1a0cde5c912d6b4616086b02279fcb5f1ed9a5e1e9099/analysis/1442186704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/soulGemCrafting.7z-69686-1-0.7z?fid=1000175952&ttl=1535858220&ri=8192&rs=8192&setec=3b5bc9710ae783be3c6b8e4df49de8f0"
    }
  ]
}