{
  "modId": 69725.0,
  "modName": "Large Mountain Island",
  "summary": "Large Island/ New Lands Mod I&#39;ve been working on. The map is 1024x1024, so pretty big. It has wildlife and is currently suited for people who like to play hunter/survival style. Add Hunterborn, Frostfall, and Realistic Needs and Diseases to have a nice survival/ hunter game. Currently no fantasy elements. I wanted to release a basic Landmass fi",
  "descriptionHtml": "\r<br />UPDATED: \r<br />\r<br />- Fixed more floating objects\r<br />- Added four small caves (small cave 01, plains cave 01, valley cave, plains cave 03) Some still need a little work.\r<br />- Added a way to get to the island from Skyrim. There is a ship at the docks of Solitude at the end of the docks.\r<br />- Reorganized Cell View in creation kit. Labeled certain areas of the island for ease of editing.\r<br />- Created the LOD again to include updates.\r<br />\r<br />I will try to update once a week or so. From here on out I will be adding Manmade objects, places, and things to the map. I will also add monsters and a small village.\r<br />\r<br />New Large Island to explore or take and add towns, npcs, quests, and whatever else you want to add. I like landscape editing/ level design but don&#39;t care for scripting, creating quests, or stories and npcs. I&#39;ve taken Chiarro22&#39;s heightmap that he uploaded to nexus and created a nice landscape. It has two nice sized forest areas, a large plains type area, and some good mountainous areas. I&#39;ve made my own heightmaps before but when I recently wanted to start a new land mod I just downloaded his to be able to start quicker. I also usually make the landmass around 4096x4096 cause I want it to be huge but I never finish it. So I started with a smaller map to make myself finish. There are no interior dungeons/caves yet. There are a couple exterior caves i made that are small but look kind of cool. To get it to look like it does in the pics you&#39;ll need:\r<br />\r<br />amidianborn caves\r<br />amidianborn landscape\r<br />better landscape textures\r<br />hd enhanced terrain\r<br />hybrids hd plants\r<br />project parallax remastered\r<br />Purity\r<br />Realvision enb (i edited mine a bit to get it how i like it)\r<br />static mesh improvement mod\r<br />Tamriel reloaded\r<br />Tamriel reloaded trees\r<br />unbelievable grass two (load my esp after this)\r<br />verdant a skyrim grass mod \r<br />all vivid landscape mods.\r<br />\r<br />(none of these are required for this mod to work)\r<br />\r<br />The texture mods are really up to you. I don&#39;t think they will cause any problems if you have your own favorite texture mods.\r<br />\r<br />\r<br />I&#39;ve played it for a few hours as a hunter/survival game and it was pretty fun. Just download these mods to have the best experience in my opinion.\r<br />\r<br />SKY UI (you need this to get these other mods to work)\r<br />Hunterborn (has crafting and hunting stuff)\r<br />Campfire (allows you to build campfires and other survival stuff)\r<br />Realistic Needs and Diseases \r<br />Frostfall (Turn off exposure because this isnt a cold environment. Use it for crafting and campfire building and foraging)\r<br />Harvest Overhaul (allows you to get more than one item per harvestable object)\r<br />Harvesting Animation (adds an animation to harvesting for immersion)\r<br />\r<br />Go into Mod settings in skyui ingame to set up realistic needs, hunterborn, frostfall, and campfire. You can make it as hard or as easy as you want. Besides those mods, you may want to add a small town or something. In order to craft one of the basic bedrolls you need cowhides. I didn&#39;t put cows on the island. So adding a small town with a vendor will make it a bit easier. Otherwise you&#39;ll have to kill a lot of animals to get a bedroll. Or turn the need for sleep off until you get the items needed to make a tent/ bedroll. \r<br />\r<br />I recommend starting a new game and drop all of your gear except basic clothes if you want to play survival. You will be able to craft armor and weapons and a bunch of other stuff. Otherwise it&#39;d be too easy. \r<br />\r<br />To get to the island hit the ~ key. type: [i]cow island03 -10,-1  [/i]    This will bring you to a good starting area. From here you can explore the island. I will add a teleport from skyrim later. \r<br />\r<br />To open in Creation Kit: open creation kit and click the open folder. Select Skyrim.esm, Update.esm, Dragonborn.esm, and world.esp. Set world.esp as active. In order to open Skyrim.esm and Dragonborn.esm together make sure you do this; In SkyrimEditor.ini (Skyrim folder) under[b] [General][/b]  set  [b]bAllowMultipleMasterLoads=1[/b]. This allows multiple master files to be opened. \r<br />\r<br />You are free to do whatever you want with this. I&#39;m currently running out of time to work on it now because of work and real life. I will probably add monsters and dungeons if I get time to. I wanted to upload a basic landscape though in case anyone wanted to create their own towns/ dungeons/ or whatever but didn&#39;t want to go through creating an entire landscape. As I find time I will go back through and get rid of all the floating objects and mountain pieces that aren&#39;t set completely right. I know I&#39;ve missed a good bit probably. \r<br />\r<br />Upcoming additions: \r<br />\r<br />- Small Village with a couple npcs. At least a general goods vendor.\r<br />- More predator animals to make it harder.\r<br />- Better beach areas. They are kind of bland. But Skyrim doesn&#39;t have a lot of beach/ ocean objects so it gets really repetitive quickly.\r<br />- I&#39;d like someone to script a start game that starts the player on the island instead of having to get there through skyrim.\r<br />\r<br />\r<br />\r<br />\r<br /> ",
  "categoryId": "30",
  "version": "1.2",
  "author": "aaronbrown9898",
  "createdUnix": "1442326900",
  "updatedUnix": "1442847548",
  "containsAdultContent": false,
  "uploadedBy": "aaronbrown9898",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000176264",
      "name": "Large Island World",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "73087",
      "fileName": "Large Island World-69725-1-0.7z",
      "uploadedUnix": "1442367721",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f09526fdbdea3031f946d479d91388c5f811606efca3979379ce193c5c1c44b6/analysis/1442367797/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Large%20Island%20World-69725-1-0.7z?fid=1000176264&ttl=1535858274&ri=8192&rs=8192&setec=a78afd81c021cbc35e354e2f5de1d85f"
    },
    {
      "fileId": "1000177142",
      "name": "The Island (Update)",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48787",
      "fileName": "The Island (Update)-69725-1-2.7z",
      "uploadedUnix": "1442847548",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/905f7a259dc2fd991ddb1ae9c7556d303faf7fe1197ad2c803071677b6052a20/analysis/1442847621/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Island%20%28Update%29-69725-1-2.7z?fid=1000177142&ttl=1535858275&ri=8192&rs=8192&setec=809be0a2c5003aa86a388b8abde87d07"
    }
  ]
}