{
  "modId": 69788.0,
  "modName": "Grimy Combat Patcher",
  "summary": "a TES5Edit Patcher for Attribute Offsets and Combat Styles",
  "descriptionHtml": "[b]Requirement:[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49373/?]TES5Edit Automation Tools[/url]\r<br />[url=https://github.com/matortheeternal/TES5EditScripts/blob/master/trunk/Edit%20Scripts/mteFunctions.pas]Updated mteFunctions.pas[/url]\r<br />\r<br />This tool accomplishes what no other mod can offer: [u]revamped AI and enemy stat distribution[/u] for [i]every single mod[/i] in your load order, with no need to download a breadth of compatibility patches. By scanning all of your enabled mods, Grimy Combat Patcher creates a new esp in your load order, leaving your mods intact while making enemies more aggressive and rebalancing their health, magicka, and stamina.\r<br />\r<br />The problem with the stats of enemies in vanilla gameplay is how tedious it is to fight certain enemies – like you’re trying to whittle down a piñata with a toothpick. They also seem to have infinite resources at their disposal, able to spam magic and power attacks at no penalty. This makes it difficult to properly balance your game – making regular enemies feel challenging makes the harder enemies tiresome to fight. Grimy Combat Patcher will allow you to get rid of these attribute offsets, or merely reduce them if that’s what you prefer.\r<br />\r<br />It is strongly recommended you use this in conjunction with [url=http://www.nexusmods.com/skyrim/mods/33395/][color=#faebd7]SkyTweak[/color][/url] to balance your gameplay. Enemies will be more fragile with their health bonuses gone, so reducing your outgoing damage is essential. (Reduce the damage you do by 50% if you must have a recommended number.) Remember, the smoother enemy health progression makes the effort worth it.\r<br />\r<br />[color=#ff8c00][b]Installation and Use[/b][/color]\r<br />1. Install TES5Edit.\r<br />2. Download and save the most recent version of mteFunctions.pas from [url=https://raw.githubusercontent.com/matortheeternal/TES5EditScripts/master/trunk/Edit%20Scripts/mteFunctions.pas][color=#faebd7]this location[/color][/url] into TES5Edit’s “Edit Scripts” folder. Make sure it is not saved as a text document or it will not work.\r<br />3. Extract the GrimyCombatScript.pas file into the &#34;Edit Scripts&#34; folder.\r<br />4. Open your load order in TES5Edit. (Make sure to delete old combat patcher ESP files before creating a new one.)\r<br />5. Right click [i]any[/i] mod in your load order, click Run Scripts.\r<br />6. Select GrimyCombatScript from the dropdown box.\r<br />7. Scroll down to the INPUT PARAMETERS section and look at the settings. If there’s anything you want to change, make those changes and click Save. Click Ok to continue.\r<br />8. With Create New File selected, click Ok, and name your new ESP file anything you want.\r<br />9. Let the script run. When it’s done, close TES5Edit – it will prompt you to save, and of course you’ll want to save.\r<br />10. You will now have a new plugin in your load order. Enable it and you&#39;re done.\r<br />\r<br />[color=#ff8c00][b]Compatibility[/b][/color]\r<br />This patcher is technically compatible with everything. However to avoid unwanted behavior, when loading your load order in TES5Edit, you should uncheck any mod that focuses on editing the vanilla combat style records that enemies use to make them more aggressive, such as Combat Evolved and Ultimate Combat.\r<br />\r<br />Note that there’s not much point in using Combat Evolved and Grimy Combat Patcher together, since Grimy Combat Patcher does most of what Combat Evolved already does anyway.\r<br />\r<br />[color=#faebd7][u]Special Instructions for Revenge of the Enemies[/u]:[/color] This mod edits NPC records and must remain enabled. It uses its own combat styles, preceded with “aaa”. After Grimy Combat Patcher’s script runs, open the Combat Style dropdown in the new ESP, and find these records (they should all be grouped up). Simply select, right click, and remove the records that begin with “aaa” from the ESP.\r<br />\r<br />Similar mods that edit both combat styles and NPC records can be made compatible the same way: by simply looking up what combat styles they change and removing them from the Patcher esp. Alternatively you can set all the “combat style parameters” in GrimyCombatScript to 1, essentially leaving the combat styles the way they were, while still benefiting from the removal/reduction of the attribute offsets.\r<br />\r<br />[color=#ff8c00][b]Frequently Asked Questions[/b][/color]\r<br />[color=#faebd7][i]I still don’t understand. What are attribute offsets and why change them?[/i][/color]\r<br />NPC&#39;s get additional health, magicka, and stamina from attribute offsets\r<br />The way Bethesda designed the game, health offsets ramp up extremely quickly in the first 15-20 levels\r<br />Health offsets continue increasing past level 20, but at a substantially slower rate\r<br />Zero-ing health offsets like Logical Health Limits does provides smoother enemy health progression\r<br />Zero-ing health offsets also substantially decreases enemy health, so you probably want to decrease your damage dealt in SkyTweak to compensate\r<br />\r<br />[color=#faebd7][i]In what way does this affect enemy AI? Does it use scripts?[/i][/color]\r<br />Grimy Combat Patcher does not use scripts to affect enemy AI, instead it edits Combat Style entries.\r<br />Combat Styles are basically how most &#34;Combat AI&#34; mods like Combat Evolved edit enemy AI\r<br />Combat Styles determine things like how aggressive or defensive an AI will be, or how often they&#39;ll block or power attack\r<br />There&#39;s a few other ways to edit &#34;Combat AI&#34; (such as gamesettings), but Combat Styles are the main factor\r<br />\r<br />[color=#faebd7][i]Why use a patcher?[/i][/color]\r<br />This patchers, unlike typical combat mods will affect all NPC and combat style records from all mods and DLC\r<br />Whereas most combat style mods are only designed to work with vanilla combat styles\r<br />The patcher also isn&#39;t hardcoded, so you can fine tune the health offset and combat style settings to better fit your tastes\r<br />Combine this with SkyTweak and you very quickly make a combat mod for yourself that affects all NPC&#39;s and is fine tuned to your own preferences.\r<br />\r<br />[color=#ff8c00][b]Credits[/b][/color]\r<br />Special thanks to Xgatt for basically taking over this mod after its initial beta release on the SkyTweak page.",
  "categoryId": "77",
  "version": "1.03",
  "author": "Grimy Bunyip",
  "createdUnix": "1442539365",
  "updatedUnix": "1442548272",
  "containsAdultContent": false,
  "uploadedBy": "GrimyBunyip",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000176585",
      "name": "Grimy Combat Patcher",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Grimy Combat Patcher-69788-1-1.rar",
      "uploadedUnix": "1442548272",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/f54a7a54b1bedfab2b6513c6db637fb125babd3c8d2deab669e72d98fee287ab/analysis/1442548323/",
      "changelogHtml": " A user requested I add an option for enabling dual wielding for certain combat style records. I did this, and it works based on an NPC&#39;s defensive Mult. If it is below a certain threshold, they will be allowed to dual wield. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grimy%20Combat%20Patcher-69788-1-1.rar?fid=1000176585&ttl=1535858345&ri=8192&rs=8192&setec=a45636b6b1d03477ac4d61989fb5d8dd"
    }
  ]
}