{
  "modId": 69787.0,
  "modName": "BethINI",
  "summary": "Bethesda's INI configuration files are a mess. BethINI optimizes the game for increased graphical fidelity and performance.",
  "descriptionHtml": "[font=Lucida Sans Unicode][color=#e06666][size=6]BethINI[/size][/color][/font]\n<br />\n<br />[u][url=http://wiki.step-project.com/BethINI]STEP Wiki Link[/url]\n<br />[/u][url=http://forum.step-project.com/topic/13322-] [u]STEP Forum Thread[/u]\n<br />[/url]\n<br />BethINI (pronounced \"Bethany\") is an attempt to restore decency to the INI configuration files for games created by Bethesda, while optimizing your game settings for optimal graphical fidelity and performance. It currently supports Oblivion, Skyrim, Skyrim Special Edition, Fallout 3, Fallout New Vegas, and Fallout 4. It arose out of my research into the Skyrim INI files over on [url=http://wiki.step-project.com/Main_Page]STEP[/url].\n<br />\n<br />[font=Lucida Sans Unicode][color=#a4c2f4][size=5]Why You Need This[/size][/color][/font]\n<br />\n<br />There are many advantages to using BethINI:\n<br />1. It automatically reorders your INI files into a sensible order, making them much easier to navigate for manual tweaking.\n<br />2. It automatically fixes common errors, including some that can cause CTDs.\n<br />3. It automatically detects mods you have installed and makes changes recommended by the mod authors where deemed appropriate. If your mod or a mod you know of requires such support, please contact me, as this is the easiest thing in the world to implement.\n<br />4. It's presets are superior in graphical fidelity and performance (95% of the time) to the official presets one can create via the game launcher.\n<br />5. It allows for the modification of more settings than is accessible via native game settings, and provides explanation for each setting and what it does.\n<br />6. It automatically backs up your INI files.\n<br />7. For Skyrim, it automatically configures the Creation Kit to support multiple masters and any installed DLC, if enabled.\n<br />\n<br />[font=Lucida Sans Unicode][color=#c27ba0][size=5]TL;DR[/size][/color][/font]\n<br />\n<br />BethINI fixes your INI files and lets you tweak your INI files to improve performance and quality.\n<br />\n<br />Installation:\n<br />BethINI is a portable application. You can run it anywhere. Simply extract and run. Do NOT run through Mod Organizer!\n<br />\n<br />Recommended usage:\n<br />1. Please do not delete your INI files prior to running this!\n<br />2. Run BethINI \n<br />3. Mod Organizer users should go to the Setup tab and select the profile they wish to use via the ''INI Path'' setting. Your profiles should be autodetected. It is highly recommended to close Mod Organizer if open.\n<br />4. Click Default. This will refresh your INI files to the default state.\n<br />5. Original Skyrim ENB users should tick the ''ENB Mode'' checkbox . This does not apply to users who ONLY use the ENBoost portion of ENB. This should be autodetected, so if you are unsure, leave this alone!\n<br />6. Click your desired preset.\n<br />7. Tick the ''Recommended Tweaks'' checkbox to apply tweaks recommended for all users.\n<br />8. Click the Save and Exit button.\n<br />\n<br />[font=Lucida Sans Unicode][color=#b4a7d6][size=5]Testimonials[/size][/color][/font]\n<br />\n<br />[quote]Fantastic!!!! You have made my Skyrim SE graphics run like greased goose poop (but look a lot better than goose poop). THANK YOU!!!![/quote]\n<br />[quote]Wow this is awesome. It worked perfectly for me and also now I noticed lights and shadows are working alot better then they used to.[/quote]\n<br />[quote]This is truly an impressive set of ini tweaks. My game is running a lot smoother now and I got a boost of 10-20 FPS in some places. Interiors are almost always at the 60FPS cap, and I'm running on a laptop on Ultra Settings.[/quote]\n<br />[quote]All I can say is wow.. I didn't think something like this could change the fact I only get 8-12 fps on average in the game. But after using this, this has nearly doubled my FPS and now get about 22. Just Wow, thank you much.[/quote]\n<br />\n<br />[youtube]LZHh39Zt6I8[/youtube]\n<br />\n<br />[youtube]KHsPP_uT8_g[/youtube]\n<br />\n<br />[youtube]ECDgl5xfMKc[/youtube]\n<br />\n<br />[font=Lucida Sans Unicode][color=#f6b26b][size=5]FAQ[/size][/color][/font]\n<br />\n<br />Q: Why aren't comments open?\n<br />A: It's easier to keep all my forum work all in one place, so I use my [url=http://forum.step-project.com/topic/8987-skyrim-project-ini-spini-by-doubleyou/]thread on STEP for support.\n<br />\n<br />Q: The program will not load. The cursor spins, but the program does not load and the process is not created.\n<br />A: Add BethINI.exe to your antivirus exclusion list.\n<br />\n<br />Q: Virus!\n<br />A: False positive. See the VirusTotal report.\n<br />\n<br />Q: Should I delete my INI files before running this?\n<br />A: No! Indeed, it is likely the game launcher shall kill your INI files if you do this!\n<br />\n<br />Q: Why is my savegame crashing?\n<br />A: Not all INI settings can be changed mid-game (e.g., uGridsToLoad). If you used some bad INI tweaks (e.g., Ewi's INIs) on a save, they can cause your save not to work with good INIs. Either copy some of the problematic lines back into your INI, stick the old INIs back, or start a new game.\n<br />\n<br />Q: Does it work with ENB?\n<br />A: Yes! Skyrim users can simply tick the ENB Mode checkbox (should be autodetected) to ensure that all necessary tweaks are applied. ENB users of other games may need to check to make sure that they haven't accidentally disabled any necessary settings (as I currently don't know what settings are necessary for the other games, as I haven't used them. Sorry.)\n<br />\n<br />Q: If I use ONLY the ENBoost part of ENB, do I need to tick the ENB Mode checkbox?\n<br />A: No. Again, this should be autodetected.\n<br />\n<br />Q: I get an error when I start the game that says, \"failed to initialize renderer.\"\n<br />A: Your screen resolution is incorrect. Please change your resolution to one that your monitor supports. Custom resolutions can be manually typed into the Resolution box.\n<br />\n<br />Q: I want to go back to the way my INIs were before I used BethINI. Is that possible?\n<br />A: Simply go to the setup tab and select \"Before BethINI\" in the \"Restore Backup\" dropdown.",
  "categoryId": "39",
  "version": "2.7.1",
  "author": "DoubleYou",
  "createdUnix": "1442753660",
  "updatedUnix": "1533415913",
  "containsAdultContent": false,
  "uploadedBy": "Vuud",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000236842",
      "name": "BethINI",
      "version": "2.5",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "709",
      "fileName": "BethINI-69787-2-5.zip",
      "uploadedUnix": "1487618526",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/f08db4662f90194f97f32df37c17f28ff793b3afb833c93c079c80bd7c1ef52a/analysis/1487618586/",
      "changelogHtml": " -Behind the Scenes: Added support for Mod Organizer 2. Please treat Mod Organizer 2 exactly the same as the original Mod Organizer. The INI files will be duplicated to the relevant Documents&#92;My Games folder for Fallout 4 and Skyrim Special Edition as a temporary workaround until profile INIs are fixed. This will need to be done manually if you are using Mod Organizer 2 for the older games (recommended to stick with Mod Organizer 1.3.11 for them atm).\r<br />-Behind the Scenes: INI Path under Setup will now reduce Mod Organizer profile paths to ModOrganizer &gt; Profile-Name if the current INI Path is set to a Mod Organizer profile.\r<br />-Behind the Scenes: INI Path will always display the Documents&#92;My Games location as an option.\r<br />-Behind the Scenes: If you select &#34;Browse...&#34; for the INI Path and select the same location that is currently the INI Path, BethINI will no longer reload.\r<br />-Captions: Improved description for Flickering Light Distance dropdown.\r<br />-Controversial Tweaks: Added iNumThreads:HAVOK, iPreloadSizeLimit:General, uExterior Cell Buffer:General, uInterior Cell Buffer:General as controversial tweaks for Fallout 3, Fallout New Vegas, Fallout 4, and Skyrim Special Edition. Added iPreloadSizeLimit:General, uExterior Cell Buffer:General, uInterior Cell Buffer:General as controversial tweaks for Oblivion. Do note that Fallout 4 does raise the default values for iNumThreads:HAVOK from 1 to 7 and iPreloadSizeLimit:General from 25MB to 400MB.\r<br />-GUI Messages: Disable Tutorials message of &#34;The game will no display tutorial pop-ups.&#34; was fixed to say &#34;The game will no longer display tutorial pop-ups.&#34;\r<br />-GUI Change: Renamed the Foliage tab Visuals, since there are not enough foliage-related settings, and I need more space to place settings that affect the visuals.\r<br />-GUI Change: Moved all the Grass and Tree settings to the right side of the tab.\r<br />-Harmful Tweaks: Added bForcePow2Textures:Display 1 (CTD), bUse Shaders:Display 0 (CTD), uExterior Cell Buffer:General &lt; 0 (CTD), uGridsToLoad:General &lt; 5 (CTD or simply invalid), uInterior Cell Buffer:General &lt; 0 (CTD), and iMinGrassSize:Grass &lt; 0  (can cause CTD) as harmful tweaks for Oblivion.\r<br />-New Tweak: Gamma under the Visuals tab for Oblivion, Fallout 3, Fallout New Vegas, Skyrim, and Skyrim Special Edition.\r<br />-Tweaked tweak: Flickering Light Distance dropdown now has better numerical preset options in the dropdown. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BethINI-69787-2-5.zip?fid=1000236842&ttl=1535858341&ri=8192&rs=8192&setec=7c9d0d2bea83ec3c326c229f63e4d84a"
    },
    {
      "fileId": "1000255644",
      "name": "BethINI",
      "version": "2.5.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "709",
      "fileName": "BethINI-69787-2-5-1.zip",
      "uploadedUnix": "1506198355",
      "modVersion": "2.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/e8bde0735fe468c15abd66a88190aa06ed7224a4c7bc08cc762c6c3f8d0d968f/analysis/1506198414/",
      "changelogHtml": " -Bugfix: If the Mod Organizer path was not found, and the user browsed to its location, INI Path would not be updated to include the profiles indicated by the Mod Organizer path, and could also display items duplicated.\r<br />-Bugfix: Skinned Trees and Tree Animations are no longer on top of each other (Thanks synthtech0).\r<br />-Bugfix: Remove Grass tooltip now correctly indicates that it changes bAllowCreateGrass and bAllowLoadGrass as necessary in Skyrim, Skyrim Special Edition, and Fallout 4.\r<br />-Decided to upload the utility to the relevant Nexus site for each game to make it easier for people who have never heard of it to find. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BethINI-69787-2-5-1.zip?fid=1000255644&ttl=1535858342&ri=8192&rs=8192&setec=8483a7fe40154bf085ad0612c18b2888"
    },
    {
      "fileId": "1000262953",
      "name": "BethINI",
      "version": "2.6",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "720",
      "fileName": "BethINI-69787-2-6.zip",
      "uploadedUnix": "1514647857",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/6dfdd14638c86f8b47144dd45a1ccf94191aa1263b780858e7634a9aa839d206/analysis/1514647864/",
      "changelogHtml": " -New Tweak: Bethesda Modding Platform under Interface for Fallout 4.\n<br />-New Tweak: Half Hertz under Basic for Skyrim Special Edition.\n<br />-Bugfix: The FPS tweak for Skyrim Special Edition now shows the correct FPS value that Havok is set to.\n<br />-Bugfix: The Clamped tweak for Skyrim Special Edition could be labeled the value it is set to instead of being called Clamped.\n<br />-Bugfix: The Disable Tutorials tweak does not work for Skyrim Special Edition, so it has been removed.\n<br />-Bugfix: The Intro Music tweak now will show if it is disabled in Skyrim and Skyrim Special Edition.\n<br />-Bugfix: The VSync tweak could be labeled the numerical value it is set to instead of being called VSync.\n<br />-Tooltip Change: The tooltip for VSync incorrectly said that VSync stood for \"video synchronization\" instead of \"vertical synchronization.\" Also, noted that VSync helps eliminate screen tearing.\n<br />-GUI Change: Preset dropdown (for LOD levels) has been improved to include BethINI presets. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BethINI-69787-2-6.zip?fid=1000262953&ttl=1535858342&ri=8192&rs=8192&setec=6bf965b2c3ed991444f1798a34802ef1"
    },
    {
      "fileId": "1000265062",
      "name": "BethINI",
      "version": "2.7",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "721",
      "fileName": "BethINI-69787-2-7.zip",
      "uploadedUnix": "1517180962",
      "modVersion": "2.7",
      "virusScanUrl": "https://www.virustotal.com/file/d4c536efc6654aee53c2c8698c14bc10ab7a597a21b496db89a6f46ccb217376/analysis/1517180524/",
      "changelogHtml": " -Behind the Scenes: Fallout New Vegas can now use a FalloutCustom.ini file if using the JIP LN NVSE Plugin (https://www.nexusmods.com/newvegas/mods/58277/?). This file will now be backed up if present. Functionally, the mod description says that the file will overwrite settings in FalloutPrefs.ini as well as Fallout.ini. This behavior is different than the other games, so BethINI will cause FalloutCustom.ini to contain ALL settings from both Fallout.ini and FalloutPrefs.ini as a workaround.\n<br />-Bugfix: Poor preset button is now disabled when switched to use Vanilla Presets in Skyrim Special Edition since there is no poor vanilla preset, which would prompt a message saying \"You should not receive this error. Inform me if you do.\"\n<br />-GUI change: Moved the Wetness toggle (Fallout 4) in the Detail tab to a different location in the same general vicinity.\n<br />-GUI change: Moved the Lens Flare toggle (Fallout 4 and Skyrim Special Edition) in the Detail tab to a different location in the same general vicinity.\n<br />-New Tweak: Anamorphic Lens Flare under Detail for Skyrim Special Edition.\n<br />-New Tweak: Interior Godrays toggle under Detail for Skyrim Special Edition.\n<br />-Presets: BethINI Presets (Skyrim Special Edition) for High and Ultra have been changed to set bVolumetricLightingDisableInterior to 0 due to reports about it causing interiors to look strange.\n<br />-Tweak changed: Godrays dropdown (Skyrim Special Edition) has been modified to remove the option to turn on Godrays indoors due to reports about it causing interiors to look strange. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BethINI-69787-2-7.zip?fid=1000265062&ttl=1535858343&ri=8192&rs=8192&setec=7a54e82bfa1635b8706edf5dcc6bb9ee"
    },
    {
      "fileId": "1000278877",
      "name": "BethINI",
      "version": "2.7.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "724",
      "fileName": "BethINI-69787-2-7-1.zip",
      "uploadedUnix": "1533415913",
      "modVersion": "2.7.1",
      "virusScanUrl": "https://www.virustotal.com/file/b7df59bb50b963d1379a76117376e8686054153cc32e294190906f2fb8e16f0c/analysis/1533416225/",
      "changelogHtml": " -Behind the Scenes: BethINI now will remember the INI Path last used when switching between games.\n<br />-Bugfix: Changing the Game, Game Path, or INI Path in the Setup tab when the Always Select Game toggle is on will now skip the \"Choose Game\" dialog box upon reloading.\n<br />-Bugfix: If the Always Select Game toggle was enabled and a previous use of BethINI had used a different game, the Game Path and INI Path would erroneously default to that of the previous game.\n<br />-Bugfix: If the Default button was pressed after the Recommended Tweaks checkbox was checked, not all the recommended tweaks would be applied, but yet the checkbox would indicate that they still were applied.\n<br />-Bugfix/Harmful Tweaks: Added checks for the archive lists for Skyrim, Fallout 3, and Fallout New Vegas (the only games that do not have the correct lists by default), fixing any that were left at their default values.\n<br />-Harmful Tweaks: Added checks for sFontFile_2 and sFontFile_7 to ensure that they are pointing to font files (CTD will occur otherwise). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BethINI-69787-2-7-1.zip?fid=1000278877&ttl=1535858343&ri=8192&rs=8192&setec=38fd720522a2d9179ae7ac85f7db0551"
    }
  ]
}