{
  "modId": 69808.0,
  "modName": "Repel Rain - magical umbrella for Frostfall 2.6 and 3.0",
  "summary": "Adds several spells to combat rain and cold in Chesko&#39;s Frostfall 2.6 and 3.0+, including: a magical ward-like umbrella, conjurable bubble of air and more&#33;",
  "descriptionHtml": "[size=6][b]Repel Rain - spell pack for Frostfall\r<br />[size=6][b][size=2][line][/size][/b][/size][/b][/size][b][size=4][youtube]na59RnfUhyM[/youtube]\r<br />[line]\r<br />\r<br />[size=5]Introduction[/size][/size]\r<br />\r<br />Repel Rain [/b]begun its life as a simple mod for Frostfall 2.6. In Chesko&#39;s mod one of the player&#39;s biggest enemy is the rain, which can increase player&#39;s exposure. There wasn&#39;t, however, any way for mages to prevent getting wet. And so, one day whilst playing my ward-using character, I asked myself: why can&#39;t I cast it [i]upwards[/i]? And thus, Repel Rain was born. Once the Frostfall 3.0 hit, I immediately rewrote the code to be compatible with the new CampUtil and FrostUtil API. \r<br />\r<br />[i]Previous updates can be read in the changelog and in the Archived Updates article.[/i]\r<br />\r<br />[size=3][b][color=#ff0000]Edit [/color](08-09-2016): Thanks to [url=http://www.nexusmods.com/skyrim/users/7021459]Segolia94[/url], a bug has been found which prevented players from sleeping or waiting if you were using a non-explosive heatball. It turns out that a spell that has no active effects still may count as active. Bloody magic, I tell ya. 2.00a is up. In order to fix the problem, cast Heatball one more time. Updating to 2.01 will also dispel the debuff spells once, just to be sure.  \r<br />\r<br />Edit 2 (16-09-2016) Version for Frostfall 2.6 Legacy is up, with all of the new features&#33;\r<br />[/b][/size]\r<br />[size=6][b][size=2][line][/size][/b][/size][b][size=5]Repel Rain [/size][/b]\r<br />[color=#6aa84f]Alteration[/color]/[color=#c27ba0]Illusion[/color]/[color=#8e7cc3]Conjuration[/color], Concentration/Fire-and-Forget/Staff/Scroll (2.0 onwards) \r<br />\r<br />The spell this mod takes its name from creates a ward that protects you from rain and getting wet. It won&#39;t warm you, and it may help you drying off, if you are near a heat source. Otherwise, it will simply prevent you from getting more wet than you were at the start of casting the spell. \r<br />Originally it was created to be a concentration-type only, but after a tremendous number of requests here and on Reddit I have added a fire-and-forget version (1.1). Version 2.0 introduces also Repel Rain Scrolls. The default duration is 1 minute, but it can be extended up to 6. \r<br />\r<br />Another way of repelling rain for non-mages is using a magical staff from the times of the dragon priests, which is said to create a shadow made of magic (Umbraa Lah in the dragon language), able to repel rain. \r<br />\r<br />Repel Rain won&#39;t prevent you from getting wet through swimming or standing near waterfalls.\r<br />\r<br />Where to find it?\r<br />[spoiler]If you select the option to have the spell distributed, it will appear in various magical vendors list. Scrolls will also appear in some random loot.\r<br />A free copy of a spell, as well as the Umbraa Lah can be found at the top of the [b]Falkreath Watchtower[/b], usually occupied by a Warlock, Necromancer or a Vampire. ([url=http://srmap.uesp.net/?centeron=Falkreath+Watchtower]map[/url]) [/spoiler]\r<br />[line]\r<br />\r<br />[b][size=5]Air Bubble\r<br />[/size][/b][color=#6aa84f]Alteration[/color], Fire-and-forget/Scroll (2.0 onwards)/Staff (2.01 onwards)\r<br />\r<br />In version 1.1 I&#39;ve also added a spell that creates a wet dream (no pun intended) of any explorer of the Sea of Ghosts - Air Bubble&#33; It combines Repel Rain&#39;s drying off effect with water-breathing and Snowberry Extract. In other words, you can dive deep underwater without having to worry about getting wet, (too) cold or having no air to breathe. The original version used an ugly cloak mesh as an effect, its textures were later replaced by ones created by [b]reaperix[/b], author of [url=http://www.nexusmods.com/skyrim/mods/66919/?]Water Destruction Magic[/url]. In version 2.0 I used the Stendarr&#39;s Aura mesh as a base, finally proving that I&#39;m not as incompetent in using Nifskope (hopefully), so that it will look more like an actual bubble. \r<br />\r<br />The default duration is 1 minute, though it can be extended up to 6; the bubble effects can be toggled to active always or only in water (2.02 onwards). \r<br />\r<br />Where to find it?\r<br />[spoiler]If you select the option to have the spell distributed, it will appear in various magical vendors list. Scrolls will also appear in \r<br />some random loot. A free copy, together with Hsaarik&#39;s staff (2.01 onwards) can be found on Hsaarik&#39;s Head, north of Ysgramor&#39;s Tomb, in a sunken chest just west of the Talos&#39; Shrine and Isla-Tei&#39;s resting place ([url=http://srmap.uesp.net/?locx=99283&locy=128587&zoom=17]map[/url]).    [/spoiler]\r<br />[line]\r<br />\r<br />[b][size=5]Wayfarer&#39;s Tempo [size=3](2.0 onwards)[/size]\r<br />[/size][/b][color=#ffd966]Restoration[/color], Fire-and-forget/Scroll (2.0 onwards)/Staff (2.01 onwards) \r<br />\r<br />First new spell added in 2.0 is Wayfarer&#39;s tempo. Originally thought as a meditation-like power, it turned into a spell that allows the user to concentrate their voice on proper breathing, and by slowing down (i.e. not running or sprinting) slowly restores their exposure. The trade-off, however is that it leaves the user unable to use their voice for some time. Both the amount of exposure restored, frequency of breathing, as well as the duration of voice penalty can be adjusted in the MCM. \r<br />\r<br />Where to find it?\r<br />[spoiler]If you select the option to have the spell distributed, it will appear in various magical vendors list. Scrolls will also appear in some random loot. A free copy, as well as Greybeards&#39; Staff (2.01 onwards) can be found inside [b]High Hrothgar[/b], near the Greybeards&#39; beds. [/spoiler]\r<br />[line]\r<br />[b][size=5]Heatball [size=3](2.0 onwards)[/size]\r<br />[/size][/b][color=#cc0000]Destruction[/color], Concentration/Staff (2.01 onwards) \r<br />\r<br />If the tempo of the Wayfarer&#39;s Tempo is too slow, then Heatball may be a spell for you. It conjures a ball of heat which will quickly warm AND dry you off&#33; The longer you cast it the faster it does that&#33;.\r<br />...the catch is, the ball may explode. Violently. The chance for the Heatball to explode is tied to your Destruction skill - the higher it is, the less likely you are to have your face blown up. \r<br />\r<br />If, however, suffering the Red Mountains&#39; fate is not to your liking, you can switch off the explosion in the MCM; the spell will now apply a constant fire damage to you if it backfires. MCM will also allow you to set how fast Hetaball will warm you. \r<br />\r<br />\r<br />Where to find it?\r<br />[spoiler]If you select the option to have the spell distributed, it will appear in various magical vendors list. Scrolls will also appear in some random loot. A free copy, as well as Yisra&#39;s Staff (2.01 onwards) can be found south of Yngvild, in Yisra&#39;s Knapsack next the burned corpse of Yisra, who should have thought twice before casting fire spells. ([url=http://srmap.uesp.net/?centeron=Yisra]map[/url]) [/spoiler]\r<br />[line]\r<br />[b][size=5]Warming Cloak[size=3] (2.0 onwards)[/size]\r<br />[/size][/b][color=#cc0000]Destruction[/color], Concentration /Staff (2.01 onwards)\r<br />\r<br />A counterpart to Repel Rain, Warming Cloak traps the heat around you, preventing it from dropping below level it was at the start of casting it. It is not, however, instantaneous. The caster first have to concentrate, possibly losing a few precious exposure points, and only once the concentration is finished, the cloak starts its effect. The longer you concentrate, the longer it will last. The multiplier of that duration can be configured in MCM. The spell way warm you up completely if standing near the heatsource. \r<br />\r<br />Where to find it?\r<br />[spoiler]If you select the option to have the spell distributed, it will appear in various magical vendors list. Scrolls will also appear in some random loot. A free copy as well as Arcwind Staff (2.01 onwards) can be found in a Nordic shelter, half buried in snow near Arcwind Point, in the canyon leading to the road to Autumnwatch Tower ([url=http://srmap.uesp.net/?centeron=Arcwind+Point]map[/url]).[/spoiler]\r<br />[line]\r<br />[b][size=5]Other Tweaks[/size][size=3] (2.01 onwards)[/size][/b]\r<br />[size=2]\r<br />In 2.01 I&#39;ve added a few tweaks:\r<br />\r<br /> First of all, all spells have configurable cost, ranging from 0.25x to 3.00x of the original, to provide some support for overhauls which may have inadvertently make them too cheap/expensive to cast. \r<br />\r<br />The chests found in the wild can now be disabled if for some reason you don&#39;t want to find the freebies. \r<br />\r<br />I&#39;ve also added option for staffs to give the same bonus as Campfire&#39;s Walking Staff (Fortify Stamina). In the version for Frostfall 2.6 Legacy it adds another 10% Speed buff bonus when you hold any staff in any hand unsheathed. \r<br />[/size]\r<br />Thanks to FC4&#39;s suggestion, I&#39;ve added support for [url=http://www.nexusmods.com/skyrim/mods/42552/?]Oriental Umbrellas by denkigroove[/url] and [url=http://www.nexusmods.com/skyrim/mods/34786/?)]Umbrella by seanbonaker[/url] which add actual umbrellas (only the &#34;open&#34; ones will work) (2.02 onwards)\r<br />\r<br />Added Dragon Soul Absorption monitor - absorbing dragon soul from dying dragon or from quest NPCs will now fully warm you up (disabled by default, 2.02 onwards)\r<br />\r<br />Added Become Ethereal monitor - Become Ethereal shout can now work as Rain Repel, Air Bubble and/or Warming Cloak (disabled by default, 2.02 onwards)\r<br />\r<br />[b][size=5][line][/size][/b][size=5][b]Inspiration[/b][/size]\r<br />\r<br />The direct inspiration for both Repel Rain and Air Bubble is one of the best animated shows of all time, [i]Avatar The Last Airbender[/i] (or [i]Avatar: Legend of Aang[/i] in Europe). One of the main characters, Katara, was a self-thought waterbending prodigy and has managed to master both of these movements:\r<br />\r<br />[img]http://38.media.tumblr.com/9a0938ccc7307aa8e563391af1bf40d1/tumblr_n6rftspiZE1rozvtbo1_250.gif[/img] [img]http://38.media.tumblr.com/tumblr_mbx1anTRpg1rfr4i6o1_500.gif[/img]\r<br />\r<br />And if by any chances you haven&#39;t seen the show (or its successor, [i]Legend of Korra[/i]), give yourself a treat and watch it. You will not be disappointed. \r<br />\r<br />[line]\r<br />[size=5][b]Installation[/b][/size]\r<br />\r<br />[list]\r<br />[*][size=2]Download and use your favourite mod managing tool to install. [/size]\r<br />[*][size=2]There are two versions of a main file now; one needs Frostfall 2.6, and the second one Campfire and Frostfall 3.0. Obviously, use only one.[/size]\r<br />[/list]\r<br />If you find any bugs or problems, leave a comment or message me. \r<br />\r<br />If you want to test the mod, you can turn on the debug mode and then click &#34;Add debug items&#34; to get a supply of scrolls, spell books and staves. \r<br />\r<br />I recommend using it alongside [url=http://www.nexusmods.com/skyrim/mods/11811/?]FNIS[/url] and [url=http://www.nexusmods.com/skyrim/mods/28428/?]packages from xp32[/url] for better, more relaxed animations (obviously, this mod doesn&#39;t require either of them).\r<br />[line]\r<br />[size=5][b]Troubleshooting[/b][/size]\r<br />[size=2]\r<br />[/size][list]\r<br />[*][size=2]Umbraa Lah: the staff&#39;s animation is a bit buggy, since I believe there are no spell animations for self-aimed staff poses.[/size]\r<br />[*][size=2]Previous versions of this mod introduced a bug related to improperly accumulating wardpoints when casting the Repel Rain Spell. The bug has been ironed out, but just to be sure, an option still remains in the MCM (in the debug mode), allowing you to clear this value (Bug was found thanks to observation by [url=http://www.nexusmods.com/skyrim/users/3633379]hucifer[/url]).[/size]\r<br />[*][size=2]if for some reason you do not see the effects of spells, then you might need to re-add the monitors which govern them; head onto the troubleshooting in MCM, turn on debug options, and click Re-add Monitors. [/size]\r<br />[*][size=2]If you have installed one of the compatible umbrella mods AFTER you updated to 2.02, the compatibility won&#39;t start; enter the debug mode and click &#34;Readd monitors&#34;[/size]\r<br />[*][size=2]The Dragon Soul Absorption will not trigger until the entire dragon dying process ends; as a result the warming effect may happen a few seconds after the animation ends. [/size]\r<br />[/list][line][size=5][b]Translations [/b][/size]\r<br />The mod has been localised in TesVedit, translated in [url=http://www.nexusmods.com/skyrim/mods/29148/?]TesVTranslator[/url]; all of the Strings files are included in the archive. MCM is translatable as well.\r<br />Currently supported languages: [b]English, [/b][b]Polish and Japanese (from 1.43 onward, thanks to [b]BowmoreLover[/b][/b]). Other languages use English as base. If you are expecting instant CTDs because of my mod and you are not playing any of the translated languages, contact me; it might have some missing strings. If you would like to translate the mod, contact me, so I can credit you and include your strings in my mod&#33;\r<br />\r<br /> [img width=67,height=45]https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Flag_of_the_United_Kingdom.svg/1200px-Flag_of_the_United_Kingdom.svg.png[/img] [img width=67,height=45]https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Flag_of_Poland.svg/800px-Flag_of_Poland.svg.png[/img] [img width=67,height=45]https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/900px-Flag_of_Japan.svg.png[/img] \r<br />[line]\r<br />[b][size=5]Other mods you might want to try\r<br />[/size][/b][list]\r<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/59982/?]Bound Pickaxe and Woodcutter&#39;s axe [/url]by [b]illgirni,[/b]                                    [/size]\r<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/71371]Hearthcraft [/url]by DrMonops[/size]\r<br />[/list]\r<br />[line]\r<br />\r<br />[size=5][b]Mods used in the videos[/b] [/size]\r<br />[list]\r<br />[*] [size=2][url=http://www.nexusmods.com/skyrim/mods/3222/?]iHud[/url][/size]\r<br />[*][size=2][url=Http://www.nexusmods.com/skyrim/mods/20861/]Horns Are Forever[/url][/size]\r<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/55475/?]Screenshot Hotkeys - SHOT[/url][/size]\r<br />[/list]",
  "categoryId": "78",
  "version": "2.02",
  "author": "piotrmil",
  "createdUnix": "1442602359",
  "updatedUnix": "1475085530",
  "containsAdultContent": false,
  "uploadedBy": "piotrmil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000176647",
      "name": "Repel Rain 1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "62",
      "fileName": "Repel Rain 1.0-69808-1-0.7z",
      "uploadedUnix": "1442600664",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6e10695f8ce6bcfa31f476204d167bae4ea17b0b22f79d4a99c8dfae6e3e38de/analysis/1442600705/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%201.0-69808-1-0.7z?fid=1000176647&ttl=1535858371&ri=8192&rs=8192&setec=a46188b87544e2fe88e42ae58477c3d7"
    },
    {
      "fileId": "1000176819",
      "name": "Repel Rain 1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "68",
      "fileName": "Repel Rain 1.1-69808-1-1.7z",
      "uploadedUnix": "1442678777",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/641a816cfffa6679782203dc41dbb12b686b532954a007b174c6e43f1c608260/analysis/1442678825/",
      "changelogHtml": " Fire-and-forget versions added, as well as different types for three different schools of magic. \r<br />\r<br />Spells will now dispel when it&#39;s sunny. \r<br />\r<br />All Rain Repel spells are now Apprentice-Leveled and FF versions can be dual casted to prolong the effect. \r<br />\r<br />Air Bubble spell added, combining standard waterbreathing and Snowberry Extract effect, allowing you to breath and swim in frigid water.   <br/> \n MCM menu added. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%201.1-69808-1-1.7z?fid=1000176819&ttl=1535858371&ri=8192&rs=8192&setec=476efd1b5939dffa8c3898489b5f7fc9"
    },
    {
      "fileId": "1000177440",
      "name": "Repel Rain  1.2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "232",
      "fileName": "Repel Rain  1.2-69808-1-2.7z",
      "uploadedUnix": "1442954263",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/3beddc5f7ef465a00278c0cabb4cc9163932eda4a653f5afdd54d561ad333789/analysis/1442954284/",
      "changelogHtml": " Fixed the monitor effect that should stay hidden <br/> \n New Air Bubble animation, thanks to assets by reaperix <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20%201.2-69808-1-2.7z?fid=1000177440&ttl=1535858372&ri=8192&rs=8192&setec=a54ad3e812372e58d0d7c8c3fe698866"
    },
    {
      "fileId": "1000181796",
      "name": "Rain Repel 1.3 for Frostfall 2.6",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "234",
      "fileName": "Rain Repel 1.3-69808-1-3.7z",
      "uploadedUnix": "1445456331",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/30cf302524276db7e996b73e67a979a4798e83fe4714a3d9ce0146c330bd8d16/analysis/1445456344/",
      "changelogHtml": " Added sliders to change the default duration of both Air Bubble and the Repel Rain. Default is still 1 minute, it can go up to 6. <br/> \n Fixed the Ward effect a little bit; the concentrated one is still slanted, the fire-and-forget is straight.  <br/> \n Fixed the stacking ward effect by overhauling how the effect is being added; it is now a separate dummy ability, that activated only when the actual scripting spell is being cast. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rain%20Repel%201.3-69808-1-3.7z?fid=1000181796&ttl=1535858372&ri=8192&rs=8192&setec=5f9d83a8cb3aefaff9cfef128e606abd"
    },
    {
      "fileId": "1000184666",
      "name": "Rain Repel for Frostfall 3.0",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "235",
      "fileName": "Rain Repel for Frostfall 3.0-69808-1-3.7z",
      "uploadedUnix": "1447313883",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/f9541dfc13c944e1b18934ce1d8a77a7c58a38d50bf0dd48709901e43b3c0273/analysis/1447353365/",
      "changelogHtml": " Added sliders to change the default duration of both Air Bubble and the Repel Rain. Default is still 1 minute, it can go up to 6. <br/> \n Fixed the Ward effect a little bit; the concentrated one is still slanted, the fire-and-forget is straight.  <br/> \n Fixed the stacking ward effect by overhauling how the effect is being added; it is now a separate dummy ability, that activated only when the actual scripting spell is being cast. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rain%20Repel%20for%20Frostfall%203.0-69808-1-3.7z?fid=1000184666&ttl=1535858373&ri=8192&rs=8192&setec=cc0a3be532522877ae7d6e84b545be36"
    },
    {
      "fileId": "1000184779",
      "name": "Rain Repel 1.3.1 for Frostfall 2.6. Critical update.",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "234",
      "fileName": "Rain Repel 1.3.1 for Frostfall 2.6. Critical update.-69808-1-3-1.7z",
      "uploadedUnix": "1447452061",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/707daf7a18da5b9cb64cd894b3cf616233102e982ad4a1ac7bd81aae36a7022c/analysis/1447452126/",
      "changelogHtml": " Critical update - the previous version had a very counter-intuitive bug that made player get stunned after getting hit by a spell. And option has been added in MCM to fix that issue.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rain%20Repel%201.3.1%20for%20Frostfall%202.6.%20Critical%20update.-69808-1-3-1.7z?fid=1000184779&ttl=1535858373&ri=8192&rs=8192&setec=05f2ac83361eb7bb7c7aa6b9f7fef4bf"
    },
    {
      "fileId": "1000184780",
      "name": "Rain Repel 1.3.1 for Frostfall 3.0. Critical update",
      "version": "1.3.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "234",
      "fileName": "Rain Repel 1.3.1 for Frostfall 3.0. Critical update-69808-1-3-1.7z",
      "uploadedUnix": "1447452141",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/94c213a8c29de59b817df2be8d7da4b382887cc600ab6528ab8dd4aae7b2f8f3/analysis/1447452186/",
      "changelogHtml": " Critical update - the previous version had a very counter-intuitive bug that made player get stunned after getting hit by a spell. And option has been added in MCM to fix that issue.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rain%20Repel%201.3.1%20for%20Frostfall%203.0.%20Critical%20update-69808-1-3-1.7z?fid=1000184780&ttl=1535858374&ri=8192&rs=8192&setec=9ac9baf9cd98d732fb80734261dc746c"
    },
    {
      "fileId": "1000184849",
      "name": "Repel Rain 1.3.2 for Frostfall 2.6",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "235",
      "fileName": "Repel Rain 1.3.2-69808-1-3-2.7z",
      "uploadedUnix": "1447507964",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/ed25a5e89d16d1dc50ee8bcedef20751049c0392a92610fbde2a816827f76f5d/analysis/1447507985/",
      "changelogHtml": " Fixed the model and texture of the umbrella-like dome of the spell.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%201.3.2-69808-1-3-2.7z?fid=1000184849&ttl=1535858374&ri=8192&rs=8192&setec=043060454c6d52125ec86b7b28c99840"
    },
    {
      "fileId": "1000184850",
      "name": "Rain Repel 1.3.2 for Frostfall 3.0",
      "version": "1.3.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "234",
      "fileName": "Rain Repel 1.3.2 for Frostfall 3.0-69808-1-3-2.7z",
      "uploadedUnix": "1447508063",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/83d2e7272ce90edbe16c82eb4c524127d57f4bf69b6537064ca3faed6ef01f47/analysis/1447508105/",
      "changelogHtml": " Fixed the model and texture of the umbrella-like dome of the spell.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rain%20Repel%201.3.2%20for%20Frostfall%203.0-69808-1-3-2.7z?fid=1000184850&ttl=1535858375&ri=8192&rs=8192&setec=beda8b3e29aee0bad6fb47ba7647f02c"
    },
    {
      "fileId": "1000214573",
      "name": "Repel Rain for Frostfall 3.0",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "237",
      "fileName": "Repel Rain for Frostfall 3.0-69808-1-4.7z",
      "uploadedUnix": "1469572666",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/8c482e27e12009f413d4abbc29a43f86d11c19d7a8f217f221d2dec3873b10b3/analysis/1469572682/",
      "changelogHtml": " Fixed a bug which, for some reason prevented you from making the entire mod functional. That might had to something with FrostUtil being released. Now the mod properly utilised these functions.\r<br />\r<br />Added a fire-and-forget version of the staff.\r<br />\r<br />ESP has been localised; currently supports Polish and English. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20Frostfall%203.0-69808-1-4.7z?fid=1000214573&ttl=1535858375&ri=8192&rs=8192&setec=772bfd1ab7a77883d4dcedce03618ff8"
    },
    {
      "fileId": "1000214582",
      "name": "Repel Rain for Frostfall 3.0 - 1.41",
      "version": "1.41",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "237",
      "fileName": "Repel Rain for Frostfall 3.0 - 1.41-69808-1-41.7z",
      "uploadedUnix": "1469579257",
      "modVersion": "1.41",
      "virusScanUrl": "https://www.virustotal.com/file/71570d42b7fc1c57fc660deb3cffc82f0c1ee9047294898bb3875dbc623c9bee/analysis/1469579282/",
      "changelogHtml": " Just when you thought that you have everything under control... Air Bubble had the same problem. Now it is fixed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20Frostfall%203.0%20-%201.41-69808-1-41.7z?fid=1000214582&ttl=1535858376&ri=8192&rs=8192&setec=912df15359fbbdb0a4140a102566a949"
    },
    {
      "fileId": "1000214584",
      "name": "Repel Rain for old Frostfall 2.6 - 1.41",
      "version": "1.41",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "238",
      "fileName": "Repel Rain for old Frostfall 2.6 - 1.41-69808-1-41.7z",
      "uploadedUnix": "1469581708",
      "modVersion": "1.41",
      "virusScanUrl": "https://www.virustotal.com/file/c2044751faec37b5cae3f594d3e0182a02f808fea0c0e64469ebedc2b433619a/analysis/1469581742/",
      "changelogHtml": " Just when you thought that you have everything under control... Air Bubble had the same problem. Now it is fixed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20old%20Frostfall%202.6%20-%201.41-69808-1-41.7z?fid=1000214584&ttl=1535858376&ri=8192&rs=8192&setec=18dc97af8d14925549e43ce50d26c5e2"
    },
    {
      "fileId": "1000214713",
      "name": "Repel Rain for Frostfall 3.0 - version 1.42",
      "version": "1.42",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "237",
      "fileName": "Repel Rain for Frostfall 3.0 - version 1.42-69808-1-42.7z",
      "uploadedUnix": "1469668168",
      "modVersion": "1.42",
      "virusScanUrl": "https://www.virustotal.com/file/2a0e141ba9cb4de2ee8a000a6244c91c2fcd8f2660eb60344e916e192cdd7ad8/analysis/1469668202/",
      "changelogHtml": " Fixed the bug that prevented MCM from loading. <br/> \n Added proper keywords to staff&#39;s fake spells, so that it will be affected by the option that prolongs the duration of them. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20Frostfall%203.0%20-%20version%201.42-69808-1-42.7z?fid=1000214713&ttl=1535858376&ri=8192&rs=8192&setec=812dcec9f9f1aeb9754f174543a80378"
    },
    {
      "fileId": "1000214715",
      "name": "Repel Rain for old Frostfall 2.6 - version 1.42",
      "version": "1.42",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "238",
      "fileName": "Repel Rain for old Frostfall 2.6 - version 1.42-69808-1-42.7z",
      "uploadedUnix": "1469669497",
      "modVersion": "1.42",
      "virusScanUrl": "https://www.virustotal.com/file/0f2c087fa26969028986d847e29858962f7e080e74da14b5411af549e3061b50/analysis/1469669522/",
      "changelogHtml": " Fixed the bug that prevented MCM from loading. <br/> \n Added proper keywords to staff&#39;s fake spells, so that it will be affected by the option that prolongs the duration of them. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20old%20Frostfall%202.6%20-%20version%201.42-69808-1-42.7z?fid=1000214715&ttl=1535858377&ri=8192&rs=8192&setec=79e8e778c4d1754c9cf6513a58011dd9"
    },
    {
      "fileId": "1000214878",
      "name": "Repel Rain for Frostfall 3 version 1.43",
      "version": "1.43",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "239",
      "fileName": "Repel Rain for Frostfall 3 version 1.43-69808-1-43.7z",
      "uploadedUnix": "1469799250",
      "modVersion": "1.43",
      "virusScanUrl": "https://www.virustotal.com/file/a8a62b33c3353517b53d4c1b1a007d85495cd07732dbb62b4e09ff3e479e34ce/analysis/1469799302/",
      "changelogHtml": " Fixed another bug that might have prevented MCM from loading. <br/> \n Consolidated the magic effects, since some could be cast at the same time. <br/> \n Fixed a bug where an pseudo-ward effect would persist even if player was swimming. <br/> \n (29.07.2016) Added Japanese strings, thanks to BowmoreLover <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20Frostfall%203%20version%201.43-69808-1-43.7z?fid=1000214878&ttl=1535858377&ri=8192&rs=8192&setec=bcdf5d0607f03fcf9707746375021841"
    },
    {
      "fileId": "1000219858",
      "name": "Repel Rain for Frostfall 3 version 2.0",
      "version": "2.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "300",
      "fileName": "Repel Rain for Frostfall 3 version 2.0-69808-2-0.7z",
      "uploadedUnix": "1473193863",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/f2c5fc9258e522ddc4eaf6a031e3e37a93ad81a29903713a2c9f648bdfc59cd6/analysis/1473193923/",
      "changelogHtml": " (version for Frostfall 3.0+)\r<br />\r<br />Changed the FX on Repel Rain to look like a full ward, not a feeble one;\r<br />\r<br />Change the FX of the Air Bubble - it uses Stendarr&#39;s Aura as a base model;\r<br />\r<br />Reworked how monitors work to work alongside the new scrolls. Now the monitor has the script that dries the player, the spells are truly dummies;\r<br />\r<br />Three new spells added;\r<br />\r<br />The spells and scrolls can be distributed through the levelled lists now.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20Frostfall%203%20version%202.0-69808-2-0.7z?fid=1000219858&ttl=1535858378&ri=8192&rs=8192&setec=5848874833e8fe9c5a344eb498082d37"
    },
    {
      "fileId": "1000220089",
      "name": "Repel Rain 2.00a for Frostfall 3.0",
      "version": "2.00a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "300",
      "fileName": "Repel Rain 2.00a for Frostfall 3.0-69808-2-00a.7z",
      "uploadedUnix": "1473356989",
      "modVersion": "2.00a",
      "virusScanUrl": "https://www.virustotal.com/file/b3b8bd27f7ccce3ae3b2ef2e0139eceb9955d8b91a0ab3e533707a9d31598242/analysis/1473357003/",
      "changelogHtml": " Thanks to Segolia94, a a bug with Heatball&#39;s non-explosive debuff is found. The bug prevented the player from waiting or sleeping, because a spell that should be removed was not removed even though it obviously should not be present.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%202.00a%20for%20Frostfall%203.0-69808-2-00a.7z?fid=1000220089&ttl=1535858378&ri=8192&rs=8192&setec=7ad730fc17979fb13aa278340e52f25a"
    },
    {
      "fileId": "1000220710",
      "name": "Rain Repel 2.01 for Frostfall 3",
      "version": "2.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "306",
      "fileName": "Rain Repel 2.01 for Frostfall 3-69808-2-01.7z",
      "uploadedUnix": "1473844771",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/17a4cf81d2b1815fd590b588795f4ed10f29882f2922ff43a0c4a75e9670d54e/analysis/1473844802/",
      "changelogHtml": " Added staffs for other spells\r<br />\r<br />Placed Umbraa Lah and the free copy of Rain Repel in separate chest, next to the old one. \r<br />\r<br />Added ability to disable chests\r<br />\r<br />Added walking staffs monitors\r<br />\r<br />Added Option to control cost of the spell\r<br />\r<br />Fixed The Warming cloak monitor effect being visible in UI\r<br />\r<br />Changed Hand effect on heatball\r<br />\r<br />Fixed Wayfarer&#39;s tempo debuff bug causing the debuff dummy magic effect lingering \r<br />\r<br />\r<br /> <br/> \n Per suggestion, I changed the name &#34;Warmth Cloak&#34; to &#34;Warming Cloak&#34;. <br/> \n (16-09-2016) Version for Frostfall 2.6 Legacy added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rain%20Repel%202.01%20for%20Frostfall%203-69808-2-01.7z?fid=1000220710&ttl=1535858379&ri=8192&rs=8192&setec=c9efc2bf67a4f68a6fddd5473a55fe0f"
    },
    {
      "fileId": "1000220960",
      "name": "Repel Rain for old Frostfall 2.6 - version 2.01",
      "version": "2.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "308",
      "fileName": "Repel Rain for old Frostfall 2.6 - version 2.01-69808-2-01.7z",
      "uploadedUnix": "1474037292",
      "modVersion": "2.01",
      "virusScanUrl": "https://www.virustotal.com/file/261ad0af3752c4d92c43d0c3d3f172063bbdd3facc30b64330f6a92fe468d287/analysis/1474037342/",
      "changelogHtml": " Added staffs for other spells\r<br />\r<br />Placed Umbraa Lah and the free copy of Rain Repel in separate chest, next to the old one. \r<br />\r<br />Added ability to disable chests\r<br />\r<br />Added walking staffs monitors\r<br />\r<br />Added Option to control cost of the spell\r<br />\r<br />Fixed The Warming cloak monitor effect being visible in UI\r<br />\r<br />Changed Hand effect on heatball\r<br />\r<br />Fixed Wayfarer&#39;s tempo debuff bug causing the debuff dummy magic effect lingering \r<br />\r<br />\r<br /> <br/> \n Per suggestion, I changed the name &#34;Warmth Cloak&#34; to &#34;Warming Cloak&#34;. <br/> \n (16-09-2016) Version for Frostfall 2.6 Legacy added <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20old%20Frostfall%202.6%20-%20version%202.01-69808-2-01.7z?fid=1000220960&ttl=1535858379&ri=8192&rs=8192&setec=08623501c3166cf85f97a3a6d4e95810"
    },
    {
      "fileId": "1000222283",
      "name": "Rain Repel 2.02 for Frostall 3",
      "version": "2.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "311",
      "fileName": "Rain Repel 2.02 for Frostall 3-69808-2-02.7z",
      "uploadedUnix": "1475085486",
      "modVersion": "2.02",
      "virusScanUrl": "https://www.virustotal.com/file/94b9df638119e74021e720b7f9b675cae05ac6aa0a7bccf1ebe3d50fff9db473/analysis/1475085542/",
      "changelogHtml": " Thanks to FC4&#39;s suggestion, added support for Oriental Umbrellas by denkigroove and Umbrella by seanbonaker\r<br />\r<br />Added an option to toggle Air Bubble&#39;s FX when not swimming\r<br />\r<br />Added Dragon Soul Absorption monitor - absorbing dragon soul from dying dragon or from quest NPCs will now fully warm you up (disabled by default)\r<br />\r<br />Added Become Ethereal monitor - Become Ethereal shout can now work as Rain Repel, Air Bubble and/or Warming Cloak (disabled by default)\r<br />\r<br />\r<br />Fixes: thanks to Crogon77 one unused property was found and removed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rain%20Repel%202.02%20for%20Frostall%203-69808-2-02.7z?fid=1000222283&ttl=1535858380&ri=8192&rs=8192&setec=34a2cb22d6a766c93af60aac59de8780"
    },
    {
      "fileId": "1000222284",
      "name": "Repel Rain for old Frostfall 2.6 - version 2.02",
      "version": "2.02",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "313",
      "fileName": "Repel Rain for old Frostfall 2.6 - version 2.02-69808-2-02.7z",
      "uploadedUnix": "1475085530",
      "modVersion": "2.02",
      "virusScanUrl": "https://www.virustotal.com/file/2a068ac0618f0dfe5b7e7fc22c01a4788f90c0e1a3a082ef36505cf9b50c621f/analysis/1475085543/",
      "changelogHtml": " Thanks to FC4&#39;s suggestion, added support for Oriental Umbrellas by denkigroove and Umbrella by seanbonaker\r<br />\r<br />Added an option to toggle Air Bubble&#39;s FX when not swimming\r<br />\r<br />Added Dragon Soul Absorption monitor - absorbing dragon soul from dying dragon or from quest NPCs will now fully warm you up (disabled by default)\r<br />\r<br />Added Become Ethereal monitor - Become Ethereal shout can now work as Rain Repel, Air Bubble and/or Warming Cloak (disabled by default)\r<br />\r<br />\r<br />Fixes: thanks to Crogon77 one unused property was found and removed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Repel%20Rain%20for%20old%20Frostfall%202.6%20-%20version%202.02-69808-2-02.7z?fid=1000222284&ttl=1535858380&ri=8192&rs=8192&setec=d1be531cc962345adc912947a085fec4"
    }
  ]
}