{
  "modId": 69924.0,
  "modName": "(REMASTERED) Dragonlord Xuru Boss Battle",
  "summary": "ALL NEW Dragonlord Xuru is a boss that challenges your skills, and abilities you&#39;ve developed throughout your time on Skyrim. If you want a real challenge, install this mod. You will need Dawnguard and Dragonborn. Install simply by dropping the ESP file into your Skyrim&#39;s Data folder.",
  "descriptionHtml": "This is a much better version of the mod, as I&#39;ve included much more interesting and better prizes for killing the boss, plus I nerfed him the tiniest bit, however you still may die in one slash of his sword. Remember: blocking is imperative. He has not only been nerfed, but buffed as well. He is now immune to all magic, and your followers will run away and tremble in fear the second his sword touches them. This boss really forces you to melee with him one on one to the death, or all there will be IS death. Make sure to bring a lot of health potions and stamina potions. His location is shown in the JPEG image you will find in the archive.\r<br />\r<br />Hint: He&#39;s actually undead. Spells made for fighting the undead may have effect on him.\r<br />Hint 2: Use Marked For Death shout on him as much as you can. It&#39;ll stack, and it&#39;ll weaken him, his health, everything.",
  "categoryId": "33",
  "version": "1.9",
  "author": "Vigland",
  "createdUnix": "1442937404",
  "updatedUnix": "1443013815",
  "containsAdultContent": false,
  "uploadedBy": "Vigland",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000177530",
      "name": "Dragonlord Xuru Boss Battle Update",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "269",
      "fileName": "Dragonlord Xuru Boss Battle Update-69924-1-9.zip",
      "uploadedUnix": "1443013815",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/2bf0c52db0430a00b6681be280853d1bc26cdc56cd3f28a01a8c138ca3aa37a7/analysis/1443013864/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonlord%20Xuru%20Boss%20Battle%20Update-69924-1-9.zip?fid=1000177530&ttl=1535858516&ri=8192&rs=8192&setec=19303dcf9cebb5878ea33154e43f73d2"
    }
  ]
}