{
  "modId": 700.0,
  "modName": "Mikael Jeran - Nord Neer-Do-Well",
  "summary": "A custom character with a lore-based, too-detailed back story. Both his skills and starting equipment have been modified to reflect this back story.",
  "descriptionHtml": "\\\"A native of Markarth, Mikael wanted nothing more than to get out of the city. As soon as he came of age he enlisted in the Imperial Army. It was during a time of peace and so his first two years of service were filled with utter boredom - boredom he was being paid for. But then Ulfric Stormcloak murdered the High King of Skyrim, and everything started to go wrong.\\\"\r\n\r\nThis Save Game file puts you in control of Mikael Jeran, a young Nord man who deserted from the Imperial Army and who, through a series of unfortunate events, is set to be executed for the second time in three days.\r\n\r\nMikael\\'s skills have been modified to reflect his military background and expertise, as well as his background as a child in Markarth. His starting equipment has also been modified to fit his backstory, which ends exactly where the save file begins. The full backstory (and a whole bunch of other totally unnecessary crap) can be read in \\'Mikael Jeran README IF YOU\\'RE BORED.doc\\' contained in the .rar file. As a disclaimer I\\'m not insane, I\\'m just very, very tired. o_o;\r\n\r\nTo install, simply place \\'Mikael Jeran.ess\\' in your /My Games/Skyrim/Saves/ folder and voila. This save is numbered \\'32,\\' so look for that if your save game numbers are substantially higher or lower than that. \r\n\r\n*** Please note that when loading this save game you may/will receive a prompt notifying you that the save relies on content unavailable in your game. None of the mods that I have applied to my game affect this savefile in any way, shape, or form. ***\r\n\r\n*** Please also note that there was no way for me to force him to equip his modified armor. You will have to equip it manually via the Items console. ***\r\n\r\n*** Skyrim is my very first Elder Scrolls game. I\\'m not as well-versed in the lore as I probably should be. If I\\'ve made any grievous errors in my fanboy-itude, please let me know. ***",
  "categoryId": "43",
  "version": "1.00",
  "author": "Blankstate",
  "createdUnix": "1321734456",
  "updatedUnix": "1321734606",
  "containsAdultContent": false,
  "uploadedBy": "blankstate",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1738",
      "name": "Mikael Jeran - Nord Neer-Do-Well",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1081",
      "fileName": "Mikael Jeran - Nord Neer-Do-Well-700.rar",
      "uploadedUnix": "1321734606",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/71ead00624bd6821edae26ff6c3d80b64c54739e28460ac5322781d5917a18e7/analysis/1406422280/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mikael%20Jeran%20-%20Nord%20Neer-Do-Well-700.rar?fid=1738&ttl=1535753772&ri=8192&rs=8192&setec=09dc8a6bf5ebb0561417e0596b2fbf74"
    }
  ]
}