{
  "modId": 70008.0,
  "modName": "Silenced Combat Music - DELETED",
  "summary": "Silences music during combat sequences, but doesn&#39;t touch ambient exploration, town music, etc., so no need to edit in-game audio settings to quiet the combat sequences down.",
  "descriptionHtml": "[b][size=3]Overview:[/size][/b] Silences the default music during combat. All other music still plays, but fades into silence during combat. Also, you can still know when you&#39;re entering or leaving combat because the ambient music still fades out and in.\r<br />\r<br />[b][size=3]Why make this mod?:[/size][/b] While I adore the genius that is Jeremy Soule, I got tired of the blaring trumpets and screaming chorus during long fights, but still wanted the spontaneous, ambient music of exploration, cities, etc. without having to remember to turn my music setting back on. I also find that combat without music lends a certain intensity to the experience anyway, so if that&#39;s your thing, I hope you find some pleasure from this mod.\r<br />\r<br />[b][size=3]Compatibility:[/size][/b] This only replaces the sound files in data/music/combat with silent .xwm&#39;s that I created by silencing original files in Audacity. Does not touch other ambient music, etc., and so should be compatible with any music replacer mods. \r<br />\r<br />[b][size=3]***Installing these sound files will naturally replace any modded [u]combat[/u] music you have, so be sure to back that up before using this.***[/size][/b]\r<br />\r<br />[b][size=3]Installation:[/size][/b] First, make a back-up of any combat music you currently have installed. Then, just drag the &#34;music&#34; folder into your Skyrim/Data folder and allow it to merge folders and replace files as necessary. Play and enjoy.\r<br />\r<br />Feel free to comment with feedback/questions, etc.\r<br />\r<br />[b][size=3]Credits:[/size][/b] Thanks to Jeremy Soule for his one-of-a-kind music, to all the folks at Bethesda for the game, to the brilliant folks who created Audacity (http://audacityteam.org/), and to JohnBSkyrim for his superb Skyrim Audio Converter (http://www.nexusmods.com/skyrim/mods/8303/?).",
  "categoryId": "61",
  "version": "1.00",
  "author": "randperry",
  "createdUnix": "1443120380",
  "updatedUnix": "1443120326",
  "containsAdultContent": false,
  "uploadedBy": "randperry",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000177754",
      "name": "Silenced Combat Music",
      "version": "1.00",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "4263",
      "fileName": "Silenced Combat Music-70008-1-00.zip",
      "uploadedUnix": "1443120326",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/d0f51f819c06082bc26bc5bd27236e277cbc32ac07dd5648c4fa0957c2d70451/analysis/1443120365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silenced%20Combat%20Music-70008-1-00.zip?fid=1000177754&ttl=1535858592&ri=8192&rs=8192&setec=34c9bfa5f1e5f42f161a6625f5d003df"
    }
  ]
}