{
  "modId": 70007.0,
  "modName": "SAM Light - Armor Refits",
  "summary": "Not just for SAM users, these refits reshape some of the male armors to be less barrel, and somewhat more athletic looking.",
  "descriptionHtml": "This mod is meant to be used with SAM Light, which I recently made available at the Hall of Torque, where the main SAM download can be found.\r<br />\r<br />However, because of the nature of SAM Light, these refits are not dependent on using SAM of any kind.\r<br />This is an ongoing (at a slow pace) project to refit vanilla clothing and armor to the basic SAM body, so just the _0 and the _1 included in the main mod. Despite helping develop SAM, I was never overly fond of the two larger body types, and so now that I am playing somewhat more, I find myself wanting to refit the vanilla stuff to match the changes made to the base male body, but without the added features of Samuel and Samson (the fat and bury body types of SAM, respectively)\r<br />\r<br />You can use these refits without any body mod though, just be aware that I refit them to the main sam body, which has a substantially more refined and athletic physique than the vanilla or any other male body currently available. The hips are narrower, the pectorals more pronounced, the biceps, forearms and thighs a little larger and the, er, posterior more shapely. This when wearing these refits you will appear to have these qualities but they will not remain when you remove the armor.\r<br />Such is the way of armor in Tamriel.\r<br />\r<br />I am not taking requests, this is something I am doing for myself in my spare time, and I can neither promise nor predict what I will do next nor when. I will update this file when something is finished, so I suggest tracking it to be sure you catch any new armors I add.\r<br />\r<br />The current list included is;\r<br />Glass (I can make the files for the BoS GlassVariants pack available on request)\r<br />Nightingale\r<br />Dark Brotherhood (sleeved and sleeveless)\r<br />Bonemold (All 3 variants)\r<br />Telvanni Robes\r<br />Temple Robes (This one is a little bit of a cop out...BS never included a _0 file with the DLC so I just made one based on the SAM _0, however the nature of the robe is such that you would be hard pressed to notice any difference, because the shawl thing blocks the entire body, so _0 or _1, you kinda just look square.)\r<br />\r<br />Update 0.2\r<br />Adds a few new armors\r<br />Leather\r<br />Wolf Armor\r<br />2 of the fur armors (the ones that show the upper body)\r<br />Skaal clothing (This one is a little more subtle, but it gives the _0 and _1 meshes somewhat distinct profiles and theres a bit more of a cinch at the waist)",
  "categoryId": "54",
  "version": "0.2",
  "author": "Earrindo",
  "createdUnix": "1443121070",
  "updatedUnix": "1443455070",
  "containsAdultContent": false,
  "uploadedBy": "Earrindo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000178426",
      "name": "SAM Light Refits 0.2",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2478",
      "fileName": "SAM Light Refits 0.2-70007-0-2.7z",
      "uploadedUnix": "1443455070",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/4ce6c91024defc03398499551b408c2d5dd38c1338fa52032df8b7ac2dbd840f/analysis/1443455944/",
      "changelogHtml": " Added leather <br/> \n Added Skaal clothes <br/> \n Added Wolf Armor <br/> \n Added the two fur armors that show the body <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SAM%20Light%20Refits%200.2-70007-0-2.7z?fid=1000178426&ttl=1535858590&ri=8192&rs=8192&setec=6f932db459c16f2f992513154de7ba1f"
    }
  ]
}