{
  "modId": 7002.0,
  "modName": "Medieval II Total War Music",
  "summary": "Adds music from the fantastic turn-based/real-time strategy game to Skyrim, giving it a gritty, serious feel.",
  "descriptionHtml": "Medieval Music in Skyrim version 1.0\r\nA MOD for TES V: Skyrim by LieutenantHawk\r\n\r\nA preview video of this MOD can be watched here: http://www.youtube.com/watch?v=UNAFHgHb8ik&feature=channel_video_title\r\n\r\nI absolutely love Skyrim\\'s soundtrack; there\\'s not a thing about it that I would change! However, it is nice to change something in the game every once in a while to make the experience a bit different. That was my goal with this MOD; while the music in Skyrim is excellent, replacing it with the soundtrack from a more realistic Medieval game gives the land of the Nords a very gritty, serious feel.\r\n\r\n\r\n--{Features}--\r\n\r\nPart of the soundtrack from Medieval II Total War added into Skyrim. The combat, exploration, dungeon (most of them, at least), village and town tracks have been replaced, as well as the menu theme. I used music from MIITW as well as its Teutonic expansion.\r\n\r\nThere are certain sections of the soundtrack that I didn\\'t replace: dread, reveal, tavern, etc. This is because I didn\\'t have enough songs from MIITW to fill all of them, and because I wanted to focus mainly on the more common tracks anyway.\r\n\r\nThe tracks aren\\'t the highest quality, but you can\\'t really tell through all of the other sound effects in the game. \r\n\r\n\r\n--{Installation}--\r\n\r\nCopy the \\\"Music\\\" folder to your \\\"Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\" folder. If you are prompted to overwrite files, say yes. \r\n\r\nIf you don\\'t like the music or you just want to go back to Skyrim\\'s original soundtrack, delete all of the music files located in the included folder from your Skyrim/Data folder. The game will revert to using the original files located in \\\"Skyrim - Sounds.bsa\\\".\r\n\r\n\r\n--{Bugs/Conflicts}--\r\n\r\nThis MOD is not compatible with other music replacers. \r\n\r\n\r\n--{Copyright}--\r\n\r\nI do not own or claim liscensed rights to Medieval II Total War and/or its soundtrack. It was composed by Jeff van Dyck, and is owned by The Creative Assembly.\r\n\r\nThe music is being used under the Fair Use policy. I am distributing it solely for use in Skyrim; the files are encoded in a format that does not allow easy reuse elsewhere.\r\n\r\nDo NOT redistribute this MOD.\r\n\r\n\r\n--{Credits}--\r\n\r\nBethesda Softworks for making the epicness that is Skyrim. The Creative Assembly and Jeff van Dyck for MIITW and its soundtrack.\r\n\r\nI merely cut apart the game\\'s audio files and converted them to the proper format.\r\n\r\nTo contact me: The most obvious way would be via Skyrim Nexus, but I am also on DeviantART and Yahoo under the same name.\r\n",
  "categoryId": "61",
  "version": "1.0",
  "author": "LieutenantHawk",
  "createdUnix": "1327460217",
  "updatedUnix": "1327460434",
  "containsAdultContent": false,
  "uploadedBy": "LieutenantHawk",
  "primaryFile": null,
  "files": [
    {
      "fileId": "22820",
      "name": "Medieval Music",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31799",
      "fileName": "Medieval Music-7002-1-0.7z",
      "uploadedUnix": "1327460434",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/52cf732660397c37f79c8a45be365e98a3967a0734dd2f7837d61887f7027027/analysis/1406636076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Medieval%20Music-7002-1-0.7z?fid=22820&ttl=1535764782&ri=8192&rs=8192&setec=f2cd80130cd79e70b3858a29e4614e83"
    }
  ]
}