{
  "modId": 70063.0,
  "modName": "Zerelda the Unsworn",
  "summary": "Breton Female with Advanced Skills",
  "descriptionHtml": "This is a saved game that has been [i]modified[/i] to give the player a character that has some [i]advanced ski[/i]lls and a quick start to a new game.\r<br />\r<br />Zerelda the Unsworn is a Breton that has allied herself with Madanach at Druadach Redoubt. The Silver-Blood family are not pleased with your actions at this point. She has advanced skills in Archery, Light Armor, Destruction, Alchemy, One Handed, Enchanting and knows two Destruction Spells Flames and Frost Rune.\r<br />\r<br />[b]WARNING: If you walk into another Forsworn Camp DO NOT EXPECT a nice greeting. Druadach is the only faction of Forsworn that likes you.\r<br />[/b]\r<br />She is Level 103 and equipped with a full set of Armor of the Old Gods and normal Forsworn weapons. She does have a set of Boneclaw jewelry (added by console) that if enchanted looks great with the vanilla armor set.\r<br />\r<br />No scripted mods used, you may get a &#34;missing content warning&#34;. This will not effect the saved game.\r<br />\r<br />QUESTS COMPLETED: Main Quest, A Return To Your Roots, The Forsworn Conspiracy and No One Escapes Cidhna Mine (Allied with Madanach)\r<br />\r<br />There are several quests in journal that you need to investigate: Dawnguard and Dragonborn\r<br />\r<br />All Current Quest Items are in Breezehome.\r<br />\r<br />Recommend the following mods: Winter is Coming, Purity, Better Females by Bella, Better Brows and Superior Lore Friendly Hair to get the exact look. But your mod list maybe be better, change her as you see fit.\r<br />\r<br />Dawnguard and Dragonborn and all unofficial patches were used.",
  "categoryId": "43",
  "version": "1.0",
  "author": "vanhoy5",
  "createdUnix": "1443313157",
  "updatedUnix": "1443313080",
  "containsAdultContent": false,
  "uploadedBy": "vanhoy5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000178081",
      "name": "Zerelda the Unsworn",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3019",
      "fileName": "Zerelda the Unsworn-70063-1-0.zip",
      "uploadedUnix": "1443313080",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5f109965e0603cea068704054196d0664bf05639cb9c65cb4b6fe86deb6104fa/analysis/1443313146/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Zerelda%20the%20Unsworn-70063-1-0.zip?fid=1000178081&ttl=1535858634&ri=8192&rs=8192&setec=047d6b0d8383636030ac679bb66d7b6e"
    }
  ]
}