{
  "modId": 70078.0,
  "modName": "Tavern Games - Gluecksspiele in Himmelsrand",
  "summary": "Tavern Games - Glücksspiele in Himmelsrand [Deutsch]",
  "descriptionHtml": "[b]NEUE VERSION VOM 29.05.2016 - UPDATE AUF 1.4 &#33;\r<br />\r<br />Dies ist eine Übersetzung der [url=http://www.nexusmods.com/skyrim/mods/68553/?] [u]&#34;Tavern Games - Mini-Games in Skyrim&#34;[/u][/url] Modifikation von [b]Sagittarius22.[/b]\r<br />\r<br />Link zur originalen, englischen Version:[i] http://www.nexusmods.com/skyrim/mods/68553/?[/i]\r<br />\r<br />&#33;&#33; ORIGINAL WIRD NICHT BENÖTIGT &#33;&#33;\r<br />\r<br />[b]BITTE DRAN DENKEN DEN SKYRIM SCRIPT EXTENDER (SKSE) ZU LADEN&#33; - SKSE ist sicher und VORAUSSETZUNG für diese Modifikation.[/b]\r<br />\r<br />[url=http://skse.silverlock.org/] [img]http://cdn.akamai.steamstatic.com/steam/apps/365720/header.jpg?t=1440050150[/img] [/url]\r<br />\r<br />Die Steam-Version von SKSE ist nur einen Klick entfernt: [i]http://store.steampowered.com/app/365720/[/i]\r<br />\r<br />\r<br />\r<br />Diese Mod fügt die Möglichkeit hinzu, [b]Glücksspiele in Himmelsrand[/b] zu betreiben. Wie in den meisten Mini-Spielen der [b]Witcher[/b] oder [b]Fable[/b] Serie, spielt Ihr auch hier in einer &#34;Top-Down&#34; Perspektive. Alle verfügbaren Glücksspiele könnt Ihr unter folgenden Voraussetzungen spielen:\r<br />\r<br />*Ihr und Euer Gegner müsst mindestens 10 Goldstücke zur Verfügung haben.\r<br />\r<br />*Ihr seid in einer Taverne. Funktioniert ebenso mit anderen Tavernen aus diversen Modifikationen, z.B. Falskaar.  Funktioniert auch in der &#34;Zersplitterten Flasche&#34;.\r<br />\r<br />* Euer Gegner ist kein Kind. Der originale Autor hat sich dagegen entschieden, da Glücksspiel mit einem Kind wenig Sinn ergibt.\r<br />\r<br />*Euer Gegner ist kein Bettler.\r<br />\r<br />\r<br />[b]Die enthaltenen Glücksspiele sind folgende:[/b]\r<br />\r<br />\r<br />Lotterien:\r<br />Lotterien werden von Zeit zu Zeit in allen Tavernen organisiert. Kauft Ihr ein Los, habt Ihr die Chance etwas zu gewinnen, zum Beispiel: Schriftrollen, Tränke, etwas Gold. Ihr könnt auch besondere Preise gewinnen, wie zum Beispiel: einen Gutschein, welcher Euch drei kostenlose Übernachtungen in dem Gasthaus Eurer Wahl gewährt. Um einen Gutschein gültig zu machen, sprecht mit einem der Gasthausbesitzer und wählt den entsprechenden Dialog.\r<br />\r<br />Die Schlacht der Helden:\r<br />Die Schlacht der Helden, von manchen auch &#34;Die Regel der Drei&#34; genannt, ist ein neuartiges Kartenspiel in Himmelsrand, welches wahrscheinlich von einigen gelangweilten Leuten in einer Taverne erfunden wurde.\r<br />Die Regeln sind ziemlich simpel. Das Spiel erfordert nicht nur ein glückliches Händchen, sondern auch etwas strategisches Verständnis des Spielers. Das Spiel lässt sich wie folgt aufteilen.\r<br />Zuallererst, platzieren die Spieler ihre Wetteinsätze. Wie hoch diese Wetteinsätze ausfallen, hängt davon ab, wie gut betucht die Teilnehmer sind.\r<br />Hiernach, zieht jeder der Spieler drei Karten. Jede dieser Karten ist mit einer Nummerierung versehen, welche von 1 bis 10 reicht. Die Gesamtsumme der Karten entscheidet über die Stärke der Hand. Als Beispiel, sollte ein Spieler diese Karten besitzen:\r<br />* 1.\r<br />* 5.\r<br />* 7.\r<br />Würde die Stärke seiner Hand bei 13 liegen. Ab diesem Zeitpunkt wird das Spiel zunehmend interessanter. Jeder der teilnehmenden Spieler hat die Freiheit mit zwei Würfeln zu würfeln, was zu einer Steigerung der sogenannten &#34;Angriffspunkte&#34; führt. Sollte der Spieler eine 7 gewürfelt haben, würde seine Handstärke bei 13+7 liegen, demnach 20. Zu würfeln erfordert jedoch den Einsatz von Gold, und dieses Gold geht umgehend an den Gegner. Nur der Spieler alleine entscheidet, ob es sich lohnt dieses Gold zu opfern. Die Kosten des würfelns werden durch folgende Formel bestimmt:\r<br />\r<br />(Wette des Spielers x 45 / 100).\r<br />\r<br />Gehen wir in unserem Falle davon aus, dass der Spieler 80 Goldstücke gesetzt hat. Demnach würde die Rechnung folgendermaßen aussehen:\r<br />\r<br />(80 x 45 / 100). Dies würde die Summe von 36 Goldstücken ergeben.\r<br />\r<br />Die beiden Spieler legen dann ihre Karten offen auf den Tisch. Derjenige mit der höchsten Handstärke, gewinnt die Schlacht der Helden. Sollte das Spiel unentschieden enden, würden die Teilnehmer - bei meiner Laute -  ihr Gold zurückerhalten.\r<br />\r<br />[h1]Würfel-Olaf:[/h1]\r<br />Würfel-Olaf, benannt nach dem sagenumwobenen Nordhelden &#34;Olaf Ein-Auge&#34;, ist ein weiteres Würfelspiel welches sich großer Beliebtheit in Tavernen erfreut. Die Regeln dieses Spieles könnten einfacher nicht sein. Einer der Spieler, würfelt mit zwei Würfeln. Die hieraus resultierende Punktzahl wird mal drei genommen. Die Punktzahl welche Ihr dann erhalten werdet, ist die Höchstpunktzahl welche unter keinen Umständen überschritten werden darf. Sofern Euch euer Gold lieb ist.\r<br />Folgend einige Beispiele:\r<br />\r<br />Die Höchstpunktzahl beträgt 21.\r<br />Der erste Spieler würfelt dreimal, und erreicht eine Punktzahl von 18.\r<br />Der zweite Spieler würfelt, und erhält eine perfekte Punktzahl von 21.\r<br />\r<br />Eine perfekte Punktzahl gewährt ihm das Doppelte seines ursprünglichen Wetteinsatzes. Hätte er die Höchstpunktzahl überschritten, hätte er das Doppelte des ursprünglichen Wetteinsatzes an seinen Gegner verloren.\r<br />\r<br />Von Zeit zu Zeit ist es sogar ratsam, sein Gegenüber gewinnen zu lassen. Solltet Ihr nämlich das Spiel verlieren ohne dabei die Höchstpunktzahl zu überschreiten, verliert Ihr lediglich Euren ursprünglichen Wetteinsatz - und nicht das Doppelte.\r<br />\r<br />Prophetenwürfel:\r<br />Prophetenwürfel ist ein Würfelspiel über Gefahren und Wahrscheinlichkeiten. Der Spieler der als Erster würfeln darf, würfelt mit zwei Würfeln. Hiernach muss er einschätzen, ob die Punktzahl seines Widersachers niedriger, höher oder gleich ist.\r<br />Sollte er die kühne Vermutung an den Tag legen dass die Punktzahl gleich ist, wird der Wetteinsatz verdreifacht. Dies ist ein äußerst simples Würfelspiel, und ebenso beliebt bei Personen, welche den Verlust einiger Goldstücke ertragen können.\r<br />\r<br />Die Daedra-Herausforderung:\r<br />Die &#34;Daedra-Herausforderung&#34;  ist - bei allem Respekt - nicht das beliebteste Glücksspiel. Es wird meist gespielt um die Zeit totzuschlagen, und seine Regeln sind mehr als nur einprägsam. Es wird oftmals mit Betreibern einer Taverne im Austausch für Gold gespielt. Sollte der Kunde gewinnen, wird er mit einem Geschenk vom Inhaber belohnt. Sollte er nicht gewinnen, könnte man dies ebenso als reine Goldverschwendung betrachten.\r<br />\r<br />\r<br />[b]==================================================================[/b]\r<br />\r<br />\r<br />Voraussetzungen\r<br />Bitte ladet den [url=http://store.steampowered.com/app/365720/] [u]Skyrim Script Extender[/u][/url] (SKSE) und installiert diesen mit dem Mod Organizer, Nexus Mod Manager oder einem anderen Mod Manager.\r<br />\r<br />Steam-Version: http://store.steampowered.com/app/365720/\r<br />\r<br />Falls Ihr keinen Mod Manager benutzen wollt, könnt Ihr SKSE auch manuell installieren indem Ihr das [url=http://skse.silverlock.org/] [u]WinRar/7-Zip Archiv[/u][/url] entpackt und es in Eurem Hauptverzeichnis von Skyrim intalliert. Für Personen welche noch keine Erfahrung mit dem installieren von SKSE haben, empfehle ich sich vorher ein kleines [url=https://www.youtube.com/watch?v=p_xL6C9D1jw] [u]Tutorial[/u][/url] zu betrachten.\r<br />\r<br />Originale SKSE Homepage: http://skse.silverlock.org/\r<br />\r<br />\r<br />[b]==================================================================[/b]\r<br />\r<br />\r<br />Credits & Mitwirkende\r<br />Vielen Dank an [b]Sagittarius22[/b] für das kreieren dieser wundervollen Modifikation und seiner bereitwilligen Einverständniserklärung für das übersetzen eben jener.\r<br />\r<br />Persönliche Anmerkung\r<br />Es ist mir eine große Freude einen qualitativ hochwertigen Teil zur deutschen Skyrim-Community mit dieser Modifikation und deren Übersetzung beitragen zu können. Ich habe einiges an Zeit und Herz investiert um Euch ein fehlerfreies, erheiterndes und komplett verdeutschtes Spielerlebnis bieten zu können, und ich hoffe Ihr habt Eure Freude daran. Somit wünsche ich noch immer und weiterhin viel Spaß mit [i]The Elder Scrolls: Skyrim &#33;[/i]\r<br />\r<br />\r<br />[i][b]Made by Sagittarius22, translation by CaptainCrackhorse alias. MajorBlunderbuss.[/b][/i][/b]",
  "categoryId": "24",
  "version": "1.4",
  "author": "CaptainCrackhorse",
  "createdUnix": "1443354042",
  "updatedUnix": "1464526094",
  "containsAdultContent": false,
  "uploadedBy": "CaptainCrackhorse",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000208130",
      "name": "TavernGamesDV",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7305",
      "fileName": "TavernGamesDV-70078-1-4.rar",
      "uploadedUnix": "1464526094",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/4613ca4b9b6de5abd324fdbc22aa4e27d5ae3d0b2eed4cf935a74c425ae15958/analysis/1464847204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TavernGamesDV-70078-1-4.rar?fid=1000208130&ttl=1535858645&ri=8192&rs=8192&setec=bceb3071b45f1b62cdbc0564d7ffc661"
    }
  ]
}