{
  "modId": 7008.0,
  "modName": "Cracked Tusk Keep to Dovakiin Palace",
  "summary": "A complete overhaul of cracked tusk keep.",
  "descriptionHtml": "*Update: Hi guys and gals, I have some good news and some bad news, The bad news is that this mod is gonna have to be redone after creation kit is released. The good news is that when creation kit comes along, I will make it compatible with You\\'re saves so you don\\'t have to use mine, I will be making the palace even better, with weapon racks, display cases and mannequins and also I will make other hideouts, castles and palaces. Until then I will be listening to you\\'re guy\\'s input and taking suggestions on how this could be better \r\n\r\n(please leave you\\'re suggestions in the comment\\'s)\r\n\r\nCracked Tusk Keep is now Dovakiin Palace, Overhaul includes all of the testing hall containers located in the main hall, A custom throne so the dragonborn can sit in style, complete refurnishing and flooring to give the palace a gothic ancient feel, peronal crafting room with: Forge, workbench, grinding wheel, tanning rack, enchanter, alchemy table and even a cooking spit. (there is a smelter outside)\r\nAlso the vault under the palace is cleaned up to look less dumb, and has two safes and four chests for personal use.\r\n\r\n\r\nHow to use: Just go to documents, my games, skyrim, my saves, and paste my file in the folder.",
  "categoryId": "68",
  "version": "1.0",
  "author": "Darklord0013",
  "createdUnix": "1327471152",
  "updatedUnix": "1327477601",
  "containsAdultContent": false,
  "uploadedBy": "darklord0013",
  "primaryFile": null,
  "files": [
    {
      "fileId": "22863",
      "name": "Temporary Test File in save form",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2473",
      "fileName": "Temporary Test File in save form-7008-0-1.zip",
      "uploadedUnix": "1327477601",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/956552bdc18b4b09476fc069a33eae81cfe20d54eb406d2c396deda2b01e3980/analysis/1406636464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Temporary%20Test%20File%20in%20save%20form-7008-0-1.zip?fid=22863&ttl=1535764791&ri=8192&rs=8192&setec=6250bf75bec62d6b9e03d74d82e21a64"
    }
  ]
}