{
  "modId": 70089.0,
  "modName": "Gunzle&#39;s Skill - Perktree leveling - God Mode mod.",
  "summary": "100% Creation Club friendly&#33; This mod advances your perk tree skill levels by 5,000+ making you stronger in each skill. Updated; Gunzle&#39;s Skill Leveling mod includes undo file that allows you to lower the value&#39;s as well.",
  "descriptionHtml": "[b][u][center][b][u][i][b][u][i][color=#00ff00][size=4]100% Creation Club friendly&#33; \r<br />Keep playing as a bad a&#036;&#036; without losing your achievement earning ability.[/size][/color][/i]\r<br />[/u][/b]\r<br />[color=#00ffff]Saying &#34;THANKS FOR THE FREE STUFF&#34; is easy,[/color]\r<br />[color=#00ffff]just click on the Endorse button [/color][/i]\r<br />[/u][/b][/center][/u][/b][size=4][center][color=#ff0000]\r<br />ENDORSE [/color][color=#ffff00]ENDORSE [/color][color=#0000ff]ENDORSE [/color][color=#00ff00]ENDORSE[/color][/center]\r<br />[/size][b][i][size=4][color=#00ffff]This mod is also included in my mod &#34;[/color][url=http://www.nexusmods.com/skyrim/mods/70769][color=#6d9eeb]Rock Me Gunzle[/color][/url][color=#00ffff]&#34;, I highly recommend using it rather than this mod because it offers so much more. The [url=http://www.nexusmods.com/skyrim/mods/70769]Rock Me Gunzle[/url] mod gives you shouts and dragon souls to unlock them with, more gold than you will use in the game, a bunch of ingredients, spell tomes and armor, it shows all map markers in game (you still have to discover the place to fast travel to it) and more. I have not tested these together so please do not use both at the same time or you risk overpowering.[/color][/size][/i]\r<br />\r<br />[color=#ff7700]This will advance your skill level by more than 5 thousand in each perk tree making you stronger in each skill (see images for the before and after shots). Those skills are [/color][color=#00ffff]destruction, restoration, alteration, enchanting, smithing, heavy armor, blocking, two handed, one handed, archery, light armor, sneak, lockpicking, pickpocket, speech craft, alchemy, illusion and conjuration.[/color][color=#ff7700] This will not advance you up the tree nor add perk points but it will make you a stronger player in all skill sets. The skills will reflect the rise in their respective level, an example, by raising the enchanting level by more than 5 thousand you will find that [/color][color=#00ffff]your items will be enchanted with much stronger abilities, your archery will be deadlier, your sneak will be sneakier, etc..[/color][color=#ff7700] I use the option when I start a new game, I do that often enough that I became tired of typing this at the start of each new game so I put it all into a simple bat executable file, I am sharing because I am sure I am not the only one who would use this.[/color][/b]\r<br />\r<br />[size=2]Once downloaded you&#39;ll need to unzip the folder then copy the text files to your Skyrim Data folder [i][color=#00ff00][u][b](Typically found in C:Program Files&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim&#92;Data) [/b][/u][/color][/i]to complete the installation, do not copy the Read Me file to the data folder.\r<br />[/size]\r<br />While in game simply use the Tilde key ~ to bring up the console commands ability then type &#34;[color=#00ff00]bat gunzlesperks[/color]&#34; and press the enter key. Note; do not include the quotation marks &#34; &#34;.\r<br /> \r<br />The undo file lets you lower your skills back like they were before, to activate it  use the Tilde key ~ to bring up the console commands and type &#34;[color=#ffff00]bat undogunzlesperks[/color]&#34; and press enter. Note; do not include the quotation marks &#34; &#34;. \r<br />\r<br />[size=2] [/size][size=2][b][u][i][color=#e06666]Caution[/color][/i][/u][/b][color=#f4cccc]; These can be done more than once but there is a risk of overpowering (or underpowering using the undo command) thus defeating the purpose of adding this mod and could result in unwanted game behavior.\r<br />[/color]\r<br />\r<br />[color=#f4f4f4]Remember to say &#34;Thanks for the free stuff&#34; by clicking the ENDORSE button on all mods you use.[/color][/size]",
  "categoryId": "40",
  "version": "2.0",
  "author": "Gunzle",
  "createdUnix": "1443373232",
  "updatedUnix": "1444951196",
  "containsAdultContent": false,
  "uploadedBy": "Gunzle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000180941",
      "name": "Gunzles Perk Skills Complete - Undo now included with this file.",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Gunzles Perk Skills Complete - Undo included with this file.-70089-2-0.zip",
      "uploadedUnix": "1444951196",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/e6f66e80c0762ff44a05b1dc4583b307ae7afe82007ab4843f6c5fe2d43aa3e3/analysis/1444951204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gunzles%20Perk%20Skills%20Complete%20-%20Undo%20included%20with%20this%20file.-70089-2-0.zip?fid=1000180941&ttl=1535858667&ri=8192&rs=8192&setec=c78d5ecefc22c733d07fc044e84a1ccf"
    }
  ]
}