{
  "modId": 70179.0,
  "modName": "Sky-Male Improvement Mod Benor",
  "summary": "Sky-Male Improvement Mod is a series of Mods that aim to improve a few of Skyrims Male followers and NPCs using only vanilla assets while keeping true to both the characters of the NPCs themselves, and making sure they still “Fit” in the vanilla game. This mod edits the look Benor.",
  "descriptionHtml": "Sky-Male Improvement is a series of Mods that aim to improve a few of Skyrims Male followers and NPCs using only vanilla assets while keeping true to both the characters of the NPCs themselves, and making sure they still “Fit” in the vanilla game. These mods are Lore Friendly, and should be compatible with every skin/texture mod out there, as they ONLY tweak the characters with vanilla assets. (IE: You will not need a hairpack or any other mod to run these.)\r<br />\r<br />I have done my best to avoid making another “Pretty Boy” mod because A. There are already plenty of those, and they did “Pretty” right if that is your thing and B. It always kills my immersion to have a bunch of teenage looking Nords with gruff voices that belong on a 40 year old running about my game. This project started originally out my own desire to tweak a few characters that just seemed to miss the mark of “Hot” by a fraction... and to fix a few that looked downright odd-in-a-not-good-way. (Looking at you Benor and Balmund&#33;)I will try to give you a rundown of what I change on every character (hair, facepaint, scars) but sometimes all I really have to do is work around what is already there by moving eyes into proper placement, changing the length of the nose, and making sure they don’t have a horrible over/underbite. I am trying VERY hard to keep things like face shape intact so that these tweaked characters still feel like the same characters in game, and not new-faced strangers talking with familiar voices&#33;\r<br />\r<br />PLEASE NOTE: This file contains an ESP only. There are no outside, non-vanilla meshes or textures used to fix these guys, and I always, ALWAYS make sure the skin colors and such match. If you are getting the Grey-Face bug, it is likely because of another mod conflicting with this one. (It happens.)\r<br />\r<br />So lets talk about Benor... Or rather, let&#39;s talk about Benors face. Im not sure whether it was his mother or father that allowed him to get drop kicked in the face by a Mammoth when he was a child, but poor Benor has had to walk around with that sad mug every since. Ill be honest... There is not *much* of Vanilla Benor left in there. I fixed the position of his eyes, fixed his underbite, fixed his eyebrows as well as I could, and got rid of that ridiculous hair. However, Benor himself insisted that he stay rough to look at, so he kept is ruddy complexion and even earned a new scar. \r<br />\r<br />So here is new and improved Benor&#33; Still tough, still wants to be a guard, and still looking like the rough critter that he really is... without the whole mammoth-smashed face thing. ",
  "categoryId": "33",
  "version": "",
  "author": "AleniaVamp",
  "createdUnix": "1443645505",
  "updatedUnix": "1443645501",
  "containsAdultContent": false,
  "uploadedBy": "AleniaVamp2000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000178726",
      "name": "Sky-Male Improvement Mod Benor",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Sky-Male Improvement Mod Benor-70179-.zip",
      "uploadedUnix": "1443645501",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/url/cbb8d268c2838084190f1687e070a9ba4bdf5e090ee1462bcc894745dc275a2b/analysis/1443645542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sky-Male%20Improvement%20Mod%20Benor-70179-.zip?fid=1000178726&ttl=1535858744&ri=8192&rs=8192&setec=f5be5dfce758a93f89514161a4a457f5"
    }
  ]
}