{
  "modId": 70188.0,
  "modName": "My Cat",
  "summary": "In memory of my cat, Rosco.",
  "descriptionHtml": "Hello there, would you like some tea? TO BAD&#33; I have no tea&#33; \r<br />\r<br />Anyway this is a simple companion mod I made for my cat Rosco, who is sadly no longer with me today. And I deiced to immortalize him in Skyrim, so he may live forever in the games of other players. You can find him in a house near Riverwood, you can use this as an early player home if you so choose. \r<br />\r<br />I will now tell you his story. \r<br />\r<br />(Real world)- Rosco was born right under my bed, among his siblings he was the only cat with a black coat, most of his brothers and sisters were adopted or sadly, ran away. Rosco was the only cat of the litter we had. Rosco spent most of his life outside, learning about the world around him, but every night he would snuggle up to me in my bed. He was a great hunter and would catch mice on a daily basis and always got along with the dogs I adopted. His mother on the other hand went crazy and would periodically attack Rosco, the mother soon ran away. Rosco was the best cat I could ask for. He never destroyed anything, sharped his claws on my couch or stole food, he did however like to lick plastic bags for some reason. A few weeks back two kittens appeared outside my home, I learned they were brothers and kept them around. I was worried Rosco would have gotten territorial and attack them, but instead he would catch mice and give them to the brothers. And just a week ago Rosco was sadly hit outside my home, I don&#39;t know how after 7 years of wandering he got hit this time. BUT HE LIVES ON IN SKYRIM&#33; Also a tragic tale, I once went outside to get the mail when I saw a cat that looked just like Rosco on the road, dead. I was so sad, I started digging a hole for him when I heard a &#34;meow&#34;. Rosco was right behind me, I was burying a cat I did not even know :P.\r<br />\r<br />(Skyrim Story)- Rosco was born in Skyrim in a community of bandits. When he was still a boy he was ditched by the bandits. Rosco made his way to Riverwood and now makes a living there as a hunter. He has heard that the Dragonborn is in Riverwood, and thinks Dragons will fetch a good price, will you take him on the hunting trip of a lifetime? \r<br />\r<br />&#34;Say Banana? Who is that handsome purple guy next to Rosco?&#34;\r<br />\r<br />That my friend is Inigo, the best Companion mod ever made&#33; ",
  "categoryId": "66",
  "version": "1",
  "author": "BananakillerBRO",
  "createdUnix": "1443661346",
  "updatedUnix": "1443661328",
  "containsAdultContent": false,
  "uploadedBy": "bananakillerBRO",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000178754",
      "name": "Rosco The Cat",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "Rosco The Cat-70188-1.zip",
      "uploadedUnix": "1443661328",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/url/7a43c56d8d2bf453f6f471d50ed01f86f2faed83b69964328d34d5c10907c983/analysis/1443661387/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rosco%20The%20Cat-70188-1.zip?fid=1000178754&ttl=1535858750&ri=8192&rs=8192&setec=a29376de93035c7a0e01e64a546643df"
    }
  ]
}