{
  "modId": 70218.0,
  "modName": "The Broken Blade",
  "summary": "A short quest exploring player immersion in Skyrim.",
  "descriptionHtml": "**UPDATE**\r<br />\r<br />After a file archive snafu, I have uploaded a new zip with the correct mod files. Sorry for the inconvenience, I still hope everyone enjoys this quest.\r<br />\r<br />\r<br />===================================== \r<br />\r<br />About the Author \r<br />\r<br />Hello&#33; I am Derek Holson, a Level Designer currently working in the gaming industry. I am an experienced video gamer with over 15 years of gaming under my belt. My favorite genres are role-playing games and shooters. \r<br />\r<br />===================================== \r<br />\r<br />About the Quest \r<br />\r<br />This quest is the result of a few months of planning and contruction on a thesis project. The thesis focused on creating quests without relying on the user interface to deliver quest information to the player in the hopes of increasing player immersion. \r<br />\r<br />My initial release of this quest put a full emphasis on this focus and did not use any quest markers at all. However, as a result of a lot of user testing I came to realize that some quest markers are needed, especially in instances where the player needs to traverse a great distance over a large game world. What this means is that for this version of the quest, I chose to add in some quest markers where I felt they were needed, but still left them out in some areas where I wanted the player to investigate and explore. \r<br />\r<br />Overall, I think the quest is a much better representation of my skills as a designer, and it&#39;s a heck of a lot more fun. I hope you enjoy this quest as I spent a lot of time and effort making it awesome. \r<br />\r<br />===================================== \r<br />\r<br />**NOTE: SINCE THIS WAS A SCHOOL PROJECT, I MOST LIKELY WILL NOT HAVE TIME TO GO THROUGH AND FIX ANY OUTSTANDING BUGS. IF YOU FIND ONE THAT PREVENTS YOU FROM COMPLETING THE QUEST LET ME KNOW AND I WILL WORK ON FIXING IT.**",
  "categoryId": "35",
  "version": "1.1",
  "author": "Derek Holson",
  "createdUnix": "1443748693",
  "updatedUnix": "1443837243",
  "containsAdultContent": false,
  "uploadedBy": "drholson",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000179148",
      "name": "Broken Blade - Final",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54671",
      "fileName": "Broken Blade - Final-70218-1-1.zip",
      "uploadedUnix": "1443837243",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/url/dc8f88aff9fa90237f8cb43f275a19ee55a4f74da4fa75e7f838e7fecbbbdee5/analysis/1443837312/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Broken%20Blade%20-%20Final-70218-1-1.zip?fid=1000179148&ttl=1535858788&ri=8192&rs=8192&setec=40eb4a2bc68ea621b73819d2ffc1a23e"
    }
  ]
}