{
  "modId": 70301.0,
  "modName": "Project Arc",
  "summary": "Hello there weary traveller&#33; please come an take a seat while I tell you the tale of Falsenvale... \r<br />\r<br />This &#34;city&#34; if that&#39;s what you want to call it, contains many secrets and a swift and strict justice system, however traveller there have been whispers on the winds of a mighty wall, one that hides those thought lost to t",
  "descriptionHtml": "[b]NO DLC REQUIRED[/b] \r<br />\r<br />This is a project I&#39;ve been working on for 3+ months as part of a project I had to do for my school work. However this is not the finished product and I will be updating it as soon as I can, but remember I test everything new all by myself before one update is released but I can&#39;t spot everything, so please keep your eyes peeled for any problems in Arctain then let me know of them in the bugs and problems fourm so that I can either fix or work around the problem \r<br />\r<br />Why is it here if it&#39;s not done? \r<br />I&#39;ve put this on the workshop so that I can get feedback and information on any bugs and glitchs I didn&#39;t notice in my tests. If you happen to find a bug please put where you found it (or a nearby location) and a description of the problem (I can&#39;t fix it if I don&#39;t know the details) \r<br />\r<br />Where is it? \r<br />To get to the city Look for a teleport marker called Arctain docks on your map northwest of Solitude. \r<br />\r<br />For those of you that like making maps for skyrim and the planet of Nirn and wish to add my island it&#39;s located near Aldmeris and Pyandonta \r<br />\r<br />Hello there&#33; \r<br />I just wanted to let you guys know that I&#39;m going to have a series of videos put onto my Youtube channel that basically allows you guys to have input and see the development of The Phoenix Update as I work on it. The first of these video should be up sometime this weekend, if not it&#39;ll be up on Monday. Can&#39;t wait to work with you all :D \r<br />\r<br />[b]Special thanks:[/b] \r<br />Reddit users: \r<br />Tx12001 for writing The history of Falsenvale \r<br />Kaocmasu for writing Eltheric&#39;s Pride ",
  "categoryId": "89",
  "version": "V3.0",
  "author": "Killertube ",
  "createdUnix": "1443981536",
  "updatedUnix": "1443981536",
  "containsAdultContent": false,
  "uploadedBy": "killertube",
  "primaryFile": null,
  "files": []
}