{
  "modId": 70357.0,
  "modName": "A Werewolf&#39;s Enlightenment",
  "summary": "",
  "descriptionHtml": "Ever wonder why Sinding mauled that little girl? A wolf loves a free meal, and Hircine loves &#34;the hunt.&#34; So why stop there?\r<br />\r<br />A Werewolf&#39;s Enlightenment seeks to enhance Werewolf gameplay by adding a little RP flavor. It also makes werewolves more compatible with mods, especially difficulty overhauls like [url=http://www.nexusmods.com/skyrim/mods/12452/?]Sands of Time[/url] and [url=http://www.nexusmods.com/skyrim/mods/27866/?]High Level Enemies[/url]. Oddly enough, it seems nobody actually took the time to scale werewolf armor and damage other than tacking on a few perks.\r<br />\r<br />\r<br />\r<br />[size=5][b][u]Mod Components:\r<br />\r<br />[/u][/b][/size][size=2][b][u]Hircine&#39;s Domination:[/u][/b] You may want to go attack someone, but your Werewolf instincts are telling you &#34;FRESH MEAT&#33;&#34; So of course you gotta go eat that dead body. Hircine can&#39;t compel you to rage in the middle of a city, but he&#39;s not gonna let you off entirely.[/size][size=1]\r<br />\r<br />[/size][size=2][b][u]Armor/Damage Scaling[/u][u]:[/u][/b] The beast within grows stronger as you yourself become tougher. As you level up or consume dead bodies, your beast form gains additional damage and/or armor. And don&#39;t worry, those hearts - I mean perks - you collected still add the usual benefit.\r<br />\r<br /> [b][u]Size Scaling:[/u][/b] You start off a small and timid Werewolf, but as you feed, your prowess and fearsome visage gr[/size]ows to match your body count.\r<br />\r<br />\r<br />Q.F.A.:\r<br />\r<br />- All of the components can be toggled on or off, as well as tweaked to your liking.\r<br />- The mod itself can even be enabled or disabled in the middle of a game regardless of whether or not you are currently a werewolf.\r<br />- It is compatible with [b][i]everything [/i][/b]because I hate making compatibility patches. It literally edits [b][i]nothing[/i][/b] from the base game. There should be no conflicts. \r<br />- The core mod launches hundreds of scripts, but they load themselves into a callback array and then shut down. This is a method known as &#34;caching&#34; which helps cut down on script usage, and this is why it&#39;s compatible with Sands of Time, despite SoT&#39;s famous (no, not infamous) script burden.\r<br />- Q.F.A. stands for Questions, Facts, and Answers. I skimped on the questions part because reasons.",
  "categoryId": "78",
  "version": "0.91",
  "author": "Zatronium",
  "createdUnix": "1444112074",
  "updatedUnix": "1444112074",
  "containsAdultContent": false,
  "uploadedBy": "Zatronium",
  "primaryFile": null,
  "files": []
}