{
  "modId": 70501.0,
  "modName": "NPC presets for RaceMenu",
  "summary": "You want to play as Ralof´s twin brother or as his father? Then this could be something for you. My file is a collection with over 80 presets for RaceMenu by expired from NPCs of the main game, and now also from DLCs.",
  "descriptionHtml": "[size=4]NPC presets for RaceMenu[/size]\n<br />\n<br />First I appologize if my discription appears strange, clumsy and contains mistakes. English is not my first language.\n<br />\n<br />My file is a collection with over 80 presets for RaceMenu by expired from NPCs of the game.\n<br />This is not new. I noticed some time ago an unlocker mod here on nexus that\n<br />allows you to use every NPC as a preset. To the moment I was not able\n<br />to find this mod for comparison.\n<br />The advantage here are the presets as they come with expireds RaceMenu themselve. You can activate /\n<br />deactivate or install / deinstall them as you like just in the midth of a play through and need not worry about that.\n<br />\n<br />I made the presets using a ModOrganizer profile very close to vanilla. So there are no further requirements\n<br />aside from SKSE and RaceMenu by expired6978.\n<br />You can use these presets to create your character as a twin of an NPC, you can use them to give your\n<br />character recognizable kinship to an NPC (father, brother...) or just\n<br />use them to start your own charakter creation as you do with the default presets.\n<br />You can use them as a sort of modders recource, if you want to overhaul an NPC and want to make only little changes to him / her. Just use a preset,  start your creation and export it out of RaceMenu to apply it with nifmerge on your mod.\n<br />\n<br />\n<br />For the screenshots here I used also a vanilla setting. NPCs may appear very different according to the mods\n<br />you have installed. So is my thought that vanilla gives a good reference because every one has experienced that.\n<br />I hope veterans in using mods can remember how vanilla looks like. ;)\n<br />\n<br />\n<br />Presets in expireds RaceMenu allow a lot of flexibility. In order to create a twin you have to match race\n<br />and gender. Aside from this you can use them to different races or even apply them to the opposite gender.\n<br />Because male and female characters have their own sets of eyes, brows, lips and noses it is not possible to create a twin having the opposite gender.\n<br />\n<br />\n<br />But...\n<br />\n<br />\n<br />[size=4]May I introduce...[/size]\n<br />\n<br />\n<br />[size=5]Elrik, [/size][size=4]Lydias brother[/size]\n<br />\n<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/70501-0-1444569154.jpg[/img]\n<br />\n<br />\n<br />He is not a twin, but similar enough to reflect kinship to Lydia.\n<br />This was made by applying Lydias preset on a male charakter using only vanilla recources and the additional\n<br />sliders coming from expireds RaceMenu.\n<br />After applying Lydias preset I got a displacement with the make up.  I could get this fixed by:\n<br />Saving what I got as a new preset and leaving the game. Then starting the game loading a save before I applied Lydias preset and\n<br />loading this new preset in RaceMenu.\n<br />I had to do a lot manually to get the result above. Lydias preset can be seen here more as a suggestion from RaceMenu. I kept the eyes and brows for example but had to select lips and nose new.\n<br />At the end there is the question: Was it necessary or helpful to apply Lydias preset?\n<br />Necessary... no, But I think it was helpful for the start.\n<br />\n<br />\n<br />\n<br />\n<br />[size=4]Requirements[/size]\n<br />\n<br />\n<br />[url=http://skse.silverlock.org/]SKSE (Skyrim Script Extender)[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/29624/?tab=4&amp;&amp;navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D29624%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D879577&amp;pUp=1]Racemenu expired6978[/url]\n<br />\n<br />[size=4]Installation[/size]\n<br />\n<br />I recommend to install the file with a Modmanager. This way you prevent yourself from sorting over 80 presets out from your own, when you want to uninstall them.\n<br />\n<br />NMM / MO: Just install them like any other Mod. \n<br />I recommend only to activate them if you want to use them and letting them unactivated otherwise.\n<br />Over 80 presets can clutter up your menu and makes it not easy to find your own presets.\n<br />\n<br />Manual Installation (not recommended)\n<br />\n<br />Extract the downloaded archieve to your DATA folder in your Skyrim directory, and select merge.\n<br />\n<br />\n<br />[size=4]Uninstallation[/size]\n<br />\n<br />\n<br />NMM / MO: Deactivate the file, if it is not already, and uninstall it just like any other mod.\n<br />\n<br />When you did a manual installtion you have to take the folderpath: Skyrim&#92;DATA&#92;SKSE&#92;Plugin&#92;CharGen&#92;Presets.\n<br />There you have to delete manually over 80 presets. So take a cup of tea or coffee, get some cookies, it will take a while ;)\n<br />\n<br />\n<br />\n<br />[size=4]Conflicts[/size]\n<br />\n<br />There should be no conflicts, because they were made under close to vanilla conditions.\n<br />The only conflict I can imagine could be: You have made own presets and named them by chance the same way as some of\n<br />mine. That can be easily checked.\n<br />\n<br />\n<br />[size=4]How to use the presets[/size]\n<br />\n<br />In RaceMenu select race and gender first. Then click on the preset tab\n<br />and choose load preset F9 and select the preset you want to apply.\n<br />In order to create a twin it is important to have race and gender matching.\n<br />If you are not sure about this you can relate the race from the presets name.\n<br />For example Lydias preset is named: LydiaNord.\n<br />Some of the preset need further adjustments by yourself.\n<br />For example Karliah has violet eyes which cannot be found under vanilla character creation conditions.\n<br />Therefore I gave her red ones. If you want o create a twin of her, you have to adjust the eye colour manually using a mod\n<br />that provides this colour.\n<br />Nocturnal is a redguard with special pale skin colour. In order to achieve that I used the colour sliders in racemenu.\n<br />From PC to PC the result may vary and needs perhaps additional adjustment.\n<br />[color=#ffe599]Edit:\n<br />Serana´s hair and her eyes are not available under vanilla charakter creation conditions, so I made defaults from vanilla in order to keep the requirements to the basics. In order to make a twin you need a hair mod that provides her hairstyle or a mod that unlocks her hairstyle. The similar has to be done to achieve her eyecolour. I just (16.12.2015) noticed this mod: [url=http://www.nexusmods.com/skyrim/mods/71945/?]Playable Serana eye texture[/url].The vanilla way of becoming a vampire will drift your appearance away from the original. In this case you need a mod that makes vampire to look more alike human.[/color]\n<br />\n<br />\n<br />[size=4]How are these presets made[/size]\n<br />\n<br />\n<br />The making of these presets is based on the tutorial \"How to apply any custom NPC's face to your character with Racemenu 3.0\"\n<br />by choko2114.\n<br />There you take the mesh- and texture files of an NPC and import them into expireds RaceMenu. Afterwards\n<br />you have to apply make up, hair and brows manually.\n<br />As a Noob I haven´t installed the creation kit and my current knowledge about it is:\n<br />I know how it is spelled and that´s it.\n<br />So I made a workaround using the NPC Editor by foretrenty. I wrote down hair, brows and make up and selected „create mod“.\n<br />The result was a esp- and a bsa file. I needed something to extract the bsa file.\n<br />This was done by ModOrganizer. It is a recomended setting to have MO extracting bsa files.\n<br />So I insalled the NPC as a mod; picked out the required files and deleted the mod afterwards. The rest was done as\n<br />depicted in choko2114´s tutorial. The disadvantage of the NPC Editor is, that it has been never updated to handle the DLCs.\n<br />So I could only make presets from NPCs of the main game.\n<br />[color=#ffe599]Edit:\n<br />Meanwhile I installed the creation kit and got it handle the DLCs and leveled myself up from Noob to beginner. So I was able to make presets of some NPCs from the DLCs.\n<br />[/color]\n<br />\n<br />[size=4]My file contains the following presets[/size]\n<br />\n<br />Mainfile 1: NPC Presets for RaceMenu\n<br />[size=3][size=2]Aela, Aerin, Ahtar, Alva, Alvor, Anneke, Argis, Arnbjorn, Astrid, Balgruuf, Beleval, Brelyna, Brynjolf, Calder, Camilla, Carlotta, Celann, Cicero, Delphine, Delvin, Durak, Elisif, Eola, Erik, Faleen, Falk, Farengar, Farkas, Fastred, Freya, Gabriella, General Tullius, Golldir, Gormlaith Golden Hit, Gregor, Grelka, Gunmar, Hadvar, Hakon One Eye, Harkon, Hroki, Illia, Ingjard, Irileth, Isran, Jonna, Jordis, Kaie, Karita, Karliah, Kodlak, Lisette,\n<br />Lydia, Lynly, Madanach, Maven, Mirabelle, Mjoll, Muiri, Nazir, Nocturnal, Olfina, Onmund, Ralof, Rayya, Rikke, Roggi, Saadia, Saphir, Serana, Sigrid, Sorine, Sven, Sylgja, Titus Mede, Tonilia, Tsun, Ulfric, Uthgerd, Valdimar, Vilkas, Ysolda.\n<br />\n<br />[color=#00ffff]It is a selection of what could be of interest. If your wanted NPC is not included let me know and i will try to add him / her.\n<br />[/color][/size][/size]\n<br />\n<br />\n<br />[size=4]Credits[/size]\n<br />\n<br />Bethesda for Skyrim\n<br />The nexus community for the largeamount of shared mods, tutorials and advice\n<br />Patterson, Abel, Connelly  for SKSE\n<br />expired6978 for RaceMenu\n<br />seb263 for ShowRaceMenu Alternativ\n<br />choko2114 for How to apply any custom NPC's face to your character with Racemenu 3.0\n<br />foretrenty for NPC Editor\n<br />\n<br />[size=4]Permissions[/size]\n<br />\n<br />I like to see this file staying here on Nexus.\n<br />Aside from this you can use it as you like without making money from it. This is free content.",
  "categoryId": "26",
  "version": "0.2",
  "author": "Imrazon",
  "createdUnix": "1444569631",
  "updatedUnix": "1468674249",
  "containsAdultContent": false,
  "uploadedBy": "Imrazon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000213347",
      "name": "NPC Presets for RaceMenu",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "626",
      "fileName": "NPC Presets for RaceMenu-70501-1-0.7z",
      "uploadedUnix": "1468674249",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4618183b37356a1c170c9207bb3e5bc2b067e453fef467460e7204b3c864307b/analysis/1468674305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NPC%20Presets%20for%20RaceMenu-70501-1-0.7z?fid=1000213347&ttl=1535859051&ri=8192&rs=8192&setec=af32b1e348aa0a315ff6267a5ea2a334"
    }
  ]
}