{
  "modId": 70521.0,
  "modName": "Destrier Mill and Winery",
  "summary": "A small player home in Ivarstead, if the Dragonborn wanted a day job. ",
  "descriptionHtml": "[center][color=#ffff00][size=6]Destrier Mill & Winery\r<br />[/size][/color][color=#f1c232]- A small player home in Ivarstead -[/color]\r<br />\r<br />I was in the process of making a big castle for the season. It&#39;s on the backburner, idk why I felt the need to downsize again. However, whipping this up was very satisfying and I&#39;ll enjoy using this for a while&#33; Ivarstead is a beautiful town, and my last high-class home here was well received. \r<br />\r<br />Here, we have a lower- to mid-class home for the Dragonborn that matches the aesthetic of the town. Destrier Winery is a place for the Dragonborn to run their own small wine operation- the only kind in Skyrim&#33; (Besides wherever Solitude Spiced Wine is brewed.) The mill comes with the usual bells and whistles of a starter home with a few unique items and static artifacts, and a garden in the back for proper wine-making. There is no map-marker to the home, as it&#39;s right on the south side of Ivarstead&#39;s bridge. No need to further clutter the map with markers, methinks. It is Extremely vanilla, using only the original in-game parts without DLC, but can work well with mods like MHIYH. \r<br />[color=#00ffff]\r<br />The home comes with: [/color]\r<br />- Several weapon racks and displays with 1 mannequin\r<br />- Alchemy and Enchanting workplace with 1 large bookshelf\r<br />- 3 beds of varying class for self and followers\r<br />- Unique statics often featured in my homes\r<br />- Substantial storage inside, and a woodchopping block outside\r<br />- [color=#00ff00]Several unique respawning wine barrels containing Destrier Wine&#33;[/color] \r<br />[color=#00ffff]\r<br />Thank you Hodilton for this video&#33;\r<br />[youtube]kZj8Z3h0pW0[/youtube]\r<br />\r<br />Thank you RavegedPyro for this one&#33; \r<br />[youtube]MMGk6d1E3gU[/youtube]\r<br />\r<br />Compatibility:[/color]\r<br />- It blends seamlessly with JK&#39;s Skyrim/Ivarstead, which makes the town even more beautiful I say.\r<br />- Apparently works fine with Expanded Towns and Cities.\r<br />- No problem with my previous Teonas Manor; Not the same location.\r<br />\r<br />Thank you for taking the time with this mod, it might be a while before I get back into modding. There&#39;s a lot on my plate, but I hope for something much bigger in the making&#33; [/center]",
  "categoryId": "67",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1444606792",
  "updatedUnix": "1444606590",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000180491",
      "name": "Destrier Mill",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "197",
      "fileName": "Destrier Mill-70521-1-0.zip",
      "uploadedUnix": "1444606590",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14c7f5b3063bf5bc8b171e87adf74edb99a382b9133af53e0b71524c40d1db62/analysis/1444606624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Destrier%20Mill-70521-1-0.zip?fid=1000180491&ttl=1535859072&ri=8192&rs=8192&setec=bd2fa8ed60cc0e6cdc91c6a57487908a"
    }
  ]
}