{
  "modId": 70663.0,
  "modName": "Ygrid The Vampire Follower",
  "summary": "Nord vampire mage follower located in Abandoned House in Markarth, has custom conjuration spells and somewhat lore friendly behavior. Custom spells can be used by the player as well.",
  "descriptionHtml": "Ygrid is a Nord vampire mage that resides in Abandoned House in Markarth which means you need to be at least level 10 to obtain her. \r<br />\r<br />Why Abandoned House in Markarth? Because it contains the altar of Molag Bal who is connected with vampires, and it is only natural that she would reside in an abandoned place with an altar to Molag Bal, she can live there mostly undisturbed and worship at the altar of the father of vampires.\r<br /> \r<br />Stats wise she is pretty much the same as Skyrim mages (CombatMageConjurer) but she wields a better arsenal of spells (Restoration/Alteration/Conjuration/Destruction), attacks with ice and shock, uses vampiric drain and can conjure unique undead:\r<br />\r<br />Skeleton-Apprentice level spell, 2H armed with greatsword and a bow.\r<br />\r<br />Skeleton Warrior-Adept level spell, 2H armed with greatsword and a bow.\r<br />\r<br />Necrolord-Expert level spell, 1H armed with a sword as well as Ice Spike and Reanimate Corpse spells.\r<br />\r<br />Creatures are modeled to be balanced but generally more useful than vanilla summons. For example Necrolord has much less HP than Wrathman, but can attack with Ice Spike and reanimate corpses (one only) to compensate, that gives him ranged attacks and an extra helper (if corpses are available) to make him more useful than Conjure Wrathman.\r<br />\r<br />Dragonborn can use these spells, check her inventory for spellbooks.\r<br />\r<br />She is outfitted with Vampire Robes of Recharging, and a cloth version of Vampire Gauntlets and Vampire Boots.\r<br />\r<br />She is essential, starts at level 10 and can level up to level 300, and you can marry her.\r<br />\r<br />Also she is a vampire which means she will be weaker in sunlight, be vulnerable to fire damage and resistant to frost and poison. That means she will be especially useful in Dwemer ruins. She also has light foot perk so that she does not trigger traps in dungeons, after all vampires have keen senses dont they :)\r<br />\r<br />Compatible with Ultimate Follower Overhaul, but she will likely work with other overhauls as well. If dismissed she will return to the Abandoned House.\r<br />\r<br />[b]Important-she will attack Vigilants of Stendarr and Dawnguard on sight as befits a vampire. This means she will attack Tyranus immediately upon entering Abandoned House. After all she needs to protect her master&#39;s altar and her lair :) House Of Horrors will nevertheless start normally. She will not however attack Dawnguard members during the quest to join the Dawnguard so you can take her with you when you need to talk to Isran, as Dawnguard members arent hostile to vampires at that point, they dont even recognize the player is a vampire.\r<br />\r<br />Requirements:[/b]\r<br />\r<br />Skyrim 1.9\r<br />Dawnguard\r<br />\r<br />[b]Important-screenshots were made with Bella&#39;s Better Females installed, if you dont use that mod she will look differently. This mod does not contain Bella&#39;s textures. If you want her to look the same as in screenshots you will need to download Better Females and install it on your computer.[/b]\r<br />\r<br />You can find her great mod here http://www.nexusmods.com/skyrim/mods/2812/?\r<br />\r<br />[b]Installation:[/b]\r<br />\r<br />Copy meshes, textures and YgridTheVampire.esp to your Skyrim/Data directory.\r<br />\r<br />[b]Uninstallation:[/b]\r<br />\r<br />Delete YgridTheVampire.esp and associated data.",
  "categoryId": "96",
  "version": "1.0",
  "author": "Darth Sidious",
  "createdUnix": "1445095432",
  "updatedUnix": "1445092696",
  "containsAdultContent": false,
  "uploadedBy": "Darth Sidious",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000181160",
      "name": "Ygrid The Vampire",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122",
      "fileName": "Ygrid The Vampire-70663-1-0.rar",
      "uploadedUnix": "1445092696",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f5dbdfb4c085b4fd01f64dcc8eb84a78ec7c9254b9a1545c621d6b042524b6ae/analysis/1445092745/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ygrid%20The%20Vampire-70663-1-0.rar?fid=1000181160&ttl=1535859210&ri=8192&rs=8192&setec=966318081a1bc4f837520faffc321b0c"
    }
  ]
}