{
  "modId": 7070.0,
  "modName": "Realistic Lighting Profile for FXAA Plugin for Realistic Lig",
  "summary": "Requested config file for the \\\"FXAA Plugin for Realistic Lighting..\\\" mod by tj990, also requires the original \\\"Realistic Lighting without Post-Processing\\\" mod by 747823 and Pluto.",
  "descriptionHtml": "--------------------------------------------------\r\n0. Necessary Mods\r\n--------------------------------------------------\r\nRealistic Lighting without Post-Processing (by Pluto and 747823) - http://www.skyrimnexus.com/downloads/file.php?id=4323\r\nFXAA for Realistic Lighting without Post Processing (by tj990) - http://www.skyrimnexus.com/downloads/file.php?id=4749\r\n\r\n--------------------------------------------------\r\n1. Highly Recommended\r\n--------------------------------------------------\r\nTESV Acceleration Layer (by Arisu and others, requires SKSE) - http://www.skyrimnexus.com/downloads/file.php?id=4387\r\n\r\n--------------------------------------------------\r\n2. Credits\r\n--------------------------------------------------\r\nAll credit goes to Pluto, 747823, and tj990 for their hard work. This is just a configuration file, considering how much I\\'ve benefited from the work of these modders and many others in the community, I figured it was the least I could do.\r\n\r\n--------------------------------------------------\r\n3. Description\r\n--------------------------------------------------\r\nThis is a replacement for the injFX_settings.h configuration file for the FXAA plug-in. Personally, I found the nights and dungeons on the original mod not quite dark enough so I went looking for a plug-in. tj990\\'s FXAA plug-in is specifically designed to work with the original lighting mod, but a lot of people (including myself) found the nights awfully blue.\r\n\r\nWhile this can be manually adjusted (the process for which is detailed below) this takes a lot of experimentation. As a general note, this config file in particular *does* use bloom -- there will be some performance drop over the original mod. This can be manually adjusted in the config file to taste.\r\n\r\nThis will most likely not be updated unless there are significant changes to the original mods that require me to re-configure this for myself: these are, essentially, settings I am very happy with and are likely to remain unchanged.\r\n\r\n--------------------------------------------------\r\n4. Install\r\n--------------------------------------------------\r\nDownload the rar, unpack it, and place it in your /skyrim/ folder. This is already assuming you have both of required mods.\r\n\r\nNote: This will over-write the original settings file.\r\n\r\n--------------------------------------------------\r\n5. Tweaking\r\n--------------------------------------------------\r\nFirst, find the file \\\"injFX_settings.h\\\" (note -- I\\'m not sure, but you may need an IDE to read header files, you can find Visual Studio for free at Microsoft\\'s website if necessary). The file should be in your /skyrim folder, typically found at \\\"C:/Program Files (x86)/Steam/SteamApps/common/skyrim.\\\"\r\n\r\n-How I made these changes-\r\nOnce the file is open, look for the section labelled \\\"TECHNICOLOR\\\" where you can fine tune the colour balance between the three channels -- lowering the values under red and green will increase their presence ingame, reducing the incursion of too much blue. Under \\\"TONEMAP\\\", there\\'s a variable called \\\"BlueShift\\\" which increases the amount of blue in the image and is set at 0.10 by default if I recall correctly. Reduce this or change the value to 0 to shut this function off.\r\n\r\nMost importantly, at the top of the file there is the all-important \\\"FILTER SELECTION\\\". I turned off all of the filters except for tonemap and bloom, with BlueShift set to 0.00.\r\n\r\nFile location: http://imgur.com/51mWB\r\nMy current settings: http://imgur.com/lMsGw\r\n(A note about the bloom settings: decreasing the number of samples to 2 makes the effect too dark, and increasing it to 6 or more completely blows out the sky)\r\n\r\n--------------------------------------------------\r\n6. Uninstall\r\n--------------------------------------------------\r\nThe \\\"injFX_settings.h.default\\\" in the FXAA Plug-In mod contains the default settings for restoration. If you\\'re unfamiliar with header files, just open the original rar for the FXAA Plug-In mod and overwrite the file from this download with the original. This will restore your settings to the default.\r\n\r\n--------------------------------------------------\r\n7. Screenshots\r\n--------------------------------------------------\r\nhttp://imgur.com/2eCwQ <-- Adrianne at midday\r\nhttp://imgur.com/Z3HEW <-- Approaching Dragonsreach\r\nhttp://imgur.com/smFth <-- The Jarl\\'s Palace\r\nhttp://imgur.com/nilO0 <-- Inside the Grand Hall\r\nhttp://imgur.com/Hl6mT <-- A beautiful evening in the north\r\nhttp://imgur.com/N4YLo  <-- The same location at noon. Note: the snow is ludicrously bright. As someone who\\'s spent their entire life in Canada, I will say this is quite realistic. It\\'s called snow blindness for a reason: you head outside on a clear day with a heavy blanket of snow on the ground, and your eyes will feel like they\\'re exploding.\r\nhttp://imgur.com/SXrhS <-- Chatting with some Khajit friends\r\nhttp://imgur.com/2SCuh <-- Minerva, Altmer Dragonborn\r\nhttp://imgur.com/01wWf <- No I didn\\'t go spelunking to take this. But you could convince your friends you did!\r\nhttp://imgur.com/n31o8 <- More spelunking.\r\nhttp://imgur.com/erAzl <- Dungeons get dark -- bring a torch.\r\nhttp://imgur.com/4iGh1 <- Well, at least it\\'s a nice day.\r\nhttp://imgur.com/MbckE <- Dragon fire\r\nhttp://imgur.com/PwIcf <- Some more dragon fire\r\nhttp://imgur.com/gzibo <- Appeal to the Jarl -- my favourite shot. Beyond wow. \r\n\r\n--------------------------------------------------\r\n8. Notes\r\n--------------------------------------------------\r\nThere are a lot of changes from the vanilla in my screenshots. I\\'ll compile a full list of currently used mods if anyone wants it (just PM me) but even attempting to list them here is just ridiculous. Generally, I have a few large overhaul mods overlapped by a bunch of smaller, single-category replacements. Some under the hood stuff too, but you can\\'t really see that in the screenshots.\r\n\r\nAlso, if you\\'re impatient and don\\'t want to wait for me to reply by PM -- admittedly, something I am not prompt with -- you can check out the imgur links. Several of the mods are detailed in the image descriptions, though this is mostly true in older screenshots. However, if you go to my imgur page, you can see several older screenshots. I\\'ve been fairly consistent with the armours and character mods, the only thing I\\'ve really changed a lot is the lighting, and a switch from the Improved Armor set to the Weapons and Armor Fixes set underlying the individual retexes and replacements.\r\nhttp://camelface.imgur.com/all/",
  "categoryId": "62",
  "version": "1.0",
  "author": "becauseIhadto",
  "createdUnix": "1327554111",
  "updatedUnix": "1327554340",
  "containsAdultContent": false,
  "uploadedBy": "becauseIhadto",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23072",
      "name": "injFX_Settings Config File Replacement",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "injFX_Settings Config File Replacement-7070-1-0.rar",
      "uploadedUnix": "1327554340",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5b466acd7105f0e3a0727de7da17404acf31993c4c5d1f7e35e946bc1c68026b/analysis/1406637909/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/injFX_Settings%20Config%20File%20Replacement-7070-1-0.rar?fid=23072&ttl=1535764902&ri=8192&rs=8192&setec=d02f24a0b28d8423e85abf2f53130e28"
    }
  ]
}