{
  "modId": 7072.0,
  "modName": "Shipwreck_By_Dragon",
  "summary": "Level 1 Save game. Main quest done. Start on shipwreck. Dragon waiting outside.",
  "descriptionHtml": "Save game By Request - Made for friend - He liked it ...someone else might.\r\n\r\nMain Quest done - Just wants to be challenged, explore and kill dragons.\r\n\r\nHates fast travel and the main quest requires way too much walking.\r\nWants to play without using it.\r\nI warned him the whole game is not very \\\"No Fast Travel\\\" friendly.\r\n\r\nFrightened woman: \\\"Help\\\"\r\n\r\nDragonborn: \\\"First tell me why you traveled half way across the map to ask me.\r\n...Did you miss the four of five towns and two borders on the way here.\r\nJust saying, looks kind of foolish.\\\"\r\n \r\nFrightened woman: \\\"Really, the programmers did not think so. So, help or not.\\\"\r\n\r\nDragonborn: \\\"Sure, why not. This Jarl just gave me a job in someone else\\'s hold.\r\nI don\\'t think he has jurisdiction there but I am doing it anyway. ...Is it a rush job\r\nbecause it will take me three or four days to get there walking.\\\"\r\n\r\nFrightened woman as she runs off: \\\"No, take your time. They will wait for you.\\\" \r\n\r\nAnyway ...\r\n\r\nLevel 1 - Save game (Nord male) … Fresh install of game (No Mods)\r\nPut it in your save game folder ...load up Skyrim and look for \\\"Shipwreck_By_Dragon\\\"\r\nGame 25 on mine\r\n\r\nSet for Sword and Bow ... His play style\r\n\r\nSmithing, one handed, light armor, speech craft, marksman, & sneak at 30\r\nEverything else is default 15\r\n\r\nStart inside shipwreck, somewhere on north coast of Skyrim. \r\nLost your map and got hit in the head too many times, so you\r\nare not sure exactly where you are : ) \r\nRead as \\\"all map markers off\\\" ... explore to find them again.\r\nYou remember passing Dawnstar to the east so it will be the closest town.\r\n\r\nBeing hit in the head too many times is probably the reason you are level 1 again\r\n(requested low level character ...Level one is low)\r\n\r\nThe Story:\r\nAfter main quest you just wanted to get away to a sunny beach.\r\nYou bought a secondhand ship, hired a crew, found some women/men\r\nfor a party on board and sailed away.\r\nIt was not a very good ship or crew but all you could afford.\r\n(have to work on your speachcraft)\r\n\r\nThe party on board was amassing, if you ever recall it.\r\nYou decided to take a nap below deck. \r\n\\\"Too much mead\\\" is what was said when you left the party on the deck. \r\n \r\nWhen the crew you hired saw the dragon in the distance they took to the rowboats.\r\nSad to say … They took all your good stuff and the women/men from the party with them.\r\nApparently holding a grudge for just you, an unnamed dragon watched your hired help\r\nleave before shouting your ship to pieces and landing it on shore.\r\nThis woke you up.\r\n\r\nThe dragon waiting outside now has his own plan for you.\r\n(If the dragon did not kill them, a couple of small angry mud crabs \r\nwill be waiting to chew at your feet while you fight the dragon.)\r\n\r\nExiting the ship though the hole in the hold makes the dragon go away.\r\n(Do not do that ...It will bite you in the ass later and I have no idea where he goes.)\r\n \r\nYou are currently wearing nothing because you just woke you up.\r\n(People do not really sleep in their armor … Do they?)\r\nParty Clothes and boots from main quest by bed if you are shy \r\nor don\\'t want to fight a dragon naked.\r\nNot much difference with \\\"Party clothes\\\" on or naked. \r\nI am sure there are some weapons of your liking around somewhere.\r\n\r\nHope for good loot from the first dragon because there is a harder one \r\nto the east and the bandits in their camp do not even soften him up for you. \r\nTo the west there may be some dueling mages and wolves. \r\nMore wolves and a Frost troll east if you get by the second dragon.\r\n\r\n(First play though went to level 4 by the time I reached Dawnstar ...Needed some Ale by then)\r\n\r\nNo undone quests in the journal as requested, even miscellaneous ones clear.\r\nUsed sneak and invisibility to get by most enemies and did not loot chests.\r\n\r\nexample: bandits and Draugr at Bleak Falls Barrow will still be there as well as loot.\r\n\r\nToo many spoilers to explain choices made in main quest. \r\nSee readme file with save game for who, what, where, and why if it matters to you.\r\n\r\nA word of warning : This is a very dangerous area for a level 1 character and \r\nit is said dragons are harder to kill after the main quest ...unconfirmed ...\r\n\r\nHave fun, don\\'t waste arrows and remember you have shouts from the main quest,\r\nuse them or die easy!\r\n",
  "categoryId": "43",
  "version": "1",
  "author": "A wanderer",
  "createdUnix": "1327562612",
  "updatedUnix": "1327615860",
  "containsAdultContent": false,
  "uploadedBy": "wandererathome",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23098",
      "name": "Shipwreck_By_Dragon",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1403",
      "fileName": "Shipwreck_By_Dragon-7072-1.7z",
      "uploadedUnix": "1327563000",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/597a4bf84d5531b65bf5aa7044c9609be2d487f2a2a4d9c57f6c89c9572a882b/analysis/1406638208/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shipwreck_By_Dragon-7072-1.7z?fid=23098&ttl=1535764907&ri=8192&rs=8192&setec=7f4ce35e8ddbe6bc4a7097d67707bd8c"
    },
    {
      "fileId": "23265",
      "name": "Updated_What_txt ",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Updated_What_txt -7072-1-1.7z",
      "uploadedUnix": "1327615860",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/7f4d8b2a6cb3eacea40a93118615e5a33b012b2c43af027e78f00c6608af4e07/analysis/1406639698/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated_What_txt%20-7072-1-1.7z?fid=23265&ttl=1535764908&ri=8192&rs=8192&setec=64e794424e090528603d6728144b41f5"
    }
  ]
}