{
  "modId": 70734.0,
  "modName": "Lore Patch - Daedric armor forging",
  "summary": "Customized Daedric crafting that requires you to meet the conditions specified within the lore to be able to craft Daedra weapons and armors.",
  "descriptionHtml": "[font=Georgia][b][color=#ff7700][size=5]&gt;What is this mod?[/size][/color][/b]\r<br />[/font]\r<br />It is an amateur endeavor in modding and lore research. It is the result of my first attempts into the Creation Kit and the thrill it is to mod my own game. I ask you to use this mod with discretion and to please leave a comment elaborating why it misses the point or suggest the optimum directions one should take to achieve stable modding, technically, and lorewise speaking. Thank you.\r<br />\r<br />[font=Georgia][color=#ff7700][size=5][b]&gt;What made this mod happen?[/b][/size][/color]\r<br />[/font]\r<br />I came to love TES lore and my game tries to stick to it as much as I can, bringing immersion and realism together with some hardcore tweaks to make Skyrim a long term challenge.\r<br />\r<br />- Unfortunately, I started the game on the day it was released, and right now, after countless hours on it, I have done almost everything the game has to offer. And here comes the point: what still makes Skyrim a pleasant experience for me, is being able to modify it, and what once it took me one hour to accomplish, say, go from Riverwood to the High Hrothgar, today, it can take limitless time, huge thanks to the mod authors, from small under the radar, simple plugins, to the big ones that everybody has heard about, downloaded and endorsed.\r<br />\r<br />- The thing is, I am always willing to start this journey all over again, but at this time, I want to look at the core concepts of the TES universe: two decades of writings and development for the setting filled it with fantasy, immersion, realism, challenge, erotism, depth and pretty much everything we may find the vanilla game lacks of- and through modding, if we can implement those features, I speak for myself but I talk directly to my heart&#39;s content, we in no way stand as a waning community against the rise of new game releases.\r<br />\r<br />[size=6][b][center]***[/center][/b][/size][b][b][b]&gt; So here is what this mod is about: I am gathering information on how to bring core concepts found within the lore to Skyrim, and I&#39;d like you to join and share what you have found, in the comments section, about inconsistencies the game lore has, and if we can, work around to patch them.[/b]\r<br />[/b]\r<br />[/b]\r<br />\r<br />[img]http://www.makeathumbnail.com/thumbnails/image416484.jpg[/img][img]http://www.makeathumbnail.com/thumbnails/image416474.jpg[/img][img]http://www.makeathumbnail.com/thumbnails/image416487.jpg[/img]\r<br />[center][b][color=#ff7700][size=5][font=Georgia]&gt;Ehm... right but, what do we have so far? aka[/font] [/size][/color][color=#00ff00][size=6]TL;DR[/size][/color][color=#ff7700][size=5]&lt;[/size][/color][/b][/center][size=3]&gt; well... daedric crafting according to the book &#34;heavy armor forging&#34; by Sven Two-Hammers is a legendary knowledge that requires several conditions regardless of the blacksmith skill and materials. Within the book, the author mentions about every type of heavy armor available in Skyrim, and states that himself has not ever seen Daedric armors nor met anyone who has, but rumors the following: [spoiler][i]&#34;[/i][i]stories say that it should always be worked on at night... ideally under a new or full moon, and never during an eclipse. A red harvest moon is best.&#34;[/spoiler][/i]\r<br />[/size][color=#ffff00][b][center][font=Georgia][size=4]&gt;You must attend to these conditions to be able to craft Daedric armos and weapons&lt;[/size][/font][/center][/b][/color]\r<br />[img]http://www.makeathumbnail.com/thumbnails/image416486.jpg[/img][img]http://www.makeathumbnail.com/thumbnails/image416481.jpg[/img][img]http://www.makeathumbnail.com/thumbnails/image416482.jpg[/img]\r<br />[b][size=4]And finally, big [/size][color=#9900ff][size=6]thanks[/size][/color][size=4] to every game modder out there, for sharing your work, and making the game much better. This mod is my way of thanking you - sharing something I&#39;ve discovered with your help and that I hope might help others to make their games better as well.[/size][/b]",
  "categoryId": "95",
  "version": "1.0",
  "author": "wgperi",
  "createdUnix": "1445311299",
  "updatedUnix": "1445311299",
  "containsAdultContent": false,
  "uploadedBy": "wgperi",
  "primaryFile": null,
  "files": []
}