{
  "modId": 70755.0,
  "modName": "Requiem - Addendum",
  "summary": "Small fixes and addition for an enjoyable Requiem gameplay.",
  "descriptionHtml": "[b][size=6]Requiem - Addendum[/size][/b]\r<br />\r<br />This mod adds some crafting recipes to Requiem, changes some small gameplay aspects and improves the general atmosphere.\r<br />\r<br />[size=5]Gameplay Tweaks[/size]\r<br />\r<br />[list]\r<br />[*][url=http://www.uesp.net/wiki/Skyrim:Nimhe]Nimhe[/url] now always spawns as a Giant Frostbite Spider.\r<br />[*]Collision for Dead Bodies (Makes Dead body Collision obsolete)\r<br />[*]Enemy AI (Same as Hard-Times/ERSO)\r<br />[*]No Glowing effect on your body when you have an active Magic Effect\r<br />[*]NPCs Walk up and downstairs now in buildings\r<br />[*]Remove Delay between lines when talking to NPCs. This makes conversation flow more Naturally\r<br />[*]More Active AI in Combat\r<br />[*]No more 5 Free Skill points on every skill you have. You still get your Racial Bonus.\r<br />[*]No weird Dance Animations for People/Creatures/Dragons/Riekling deaths\r<br />[*]No Music Reward Sounds anymore\r<br />[/list]\r<br />\r<br />[size=5]Brews and Tonics[/size]\r<br />\r<br />It adds two recipes that are very similar to Healing Poultices: Arcane Brew and Stamina Tonic. They can be crafted at any Cooking Pot, and regenerate (respectively) Magicka and Stamina, in a similar way to what a poultice does. Just like a poultice, they won&#39;t work in combat (they will work, however, while sprinting or swimming).\r<br />\r<br />Keep in mind that in order to create these 2 items, you&#39;ll need to know how to make them. The old &#34;Healing Poultice&#34; recipe note (you can find one on Arcadia&#39;s counter) was changed to accommodate also these 2 new recipes. Read it, and you&#39;ll be good to go (no, you don&#39;t need to steal or buy it, just read it to acquire the required knowledge).\r<br />\r<br />[color=#1e84cc][size=4]Arcane Brew[/size][/color]\r<br />[i]Only mages could think of mixing salt with boiled wine... Add to that mixture a couple of mountain flowers, and you&#39;ll get a disgusting (yet slightly) alcoholic beverage that will keep your mind more focused, allowing you to recuperate magicka faster.[/i]\r<br />\r<br />Recipe (Cooking Pot): Wine (any non-DLC wine) (1), Salt (1), Red Mountain Flower (3)\r<br />\r<br />[color=#93c47d][size=4]Stamina Tonic[/size][/color]\r<br />[i]A tasty infusion obtained by mixing and mead, snowberries and mountain flowers. The result is a sweet, energetic drink that can greatly boost your endurance for around one hour. It is usually taken as a remedy against fatigue and stress.[/i]\r<br />\r<br />Recipe (Cooking Pot): Mead (any non-DLC mead) (1), Snowberries (2), Purple Mountain Flower (3)\r<br />\r<br />[size=5]Other Crafts[/size]\r<br />\r<br />[size=4]Powdered Mammoth Tusk[/size]\r<br />It always bothered me that you could find Mammoth Tusks but you won&#39;t be able to grind them to powder... This recipe will yield 3 Powdered Mammoth Tusk\r<br />\r<br />Recipe (Smelter): Mammoth Tusk (1)\r<br />\r<br />[size=5]Load order[/size][list]\r<br />[*]&lt;Other mods&gt;\r<br />[*]Requiem\r<br />[*]&lt;Requiem patches&gt;\r<br />[*][color=#ff0000][b]Requiem - Addendum (this mod)[/b][/color]\r<br />[*]Alternate Start - Live Another Life\r<br />[*]Requiem for the Indifferent\r<br />[/list]\r<br />\r<br />[size=5]Installation[/size]\r<br />Add and activate the Requiem - Addendum.esp file.\r<br />It is completely safe to add the plugin mid-game.\r<br />\r<br />[size=5]Uninstallation[/size]\r<br />Deactivate and/or delete the Requiem - Addendum.esp file.\r<br />It is completely safe to remove the plugin mid-game.",
  "categoryId": "27",
  "version": "1.0",
  "author": "sh0uzama",
  "createdUnix": "1445433635",
  "updatedUnix": "1445433635",
  "containsAdultContent": false,
  "uploadedBy": "sh0uzama",
  "primaryFile": null,
  "files": []
}