{
  "modId": 70765.0,
  "modName": "Reliable Merchants - The Whiterun Edition",
  "summary": "Whiterun&#39;s merchants will now always carry the items you need",
  "descriptionHtml": "This is a simple mod, requiring no script extenders, SkyUI, or DLCs.\r<br />\r<br />[size=6]PROBLEM TO BE FIXED[/size]\r<br />Shopping in Skyrim is a pain in the butt. Shopping is supposed to be an easier way to obtain items without having to go plundering, if you&#39;ve got the coin.  This purpose, however, is defeated by the fact that merchant inventories are just as random as loot chests in dungeons.\r<br />\r<br />Is it immersive?  I suppose it is, considering the technological limitations of the time significantly hamper a merchant&#39;s ability to obtain goods for re-sell, but any immersion stemming from this matter is outweighed by the sheer tedium.  I mean... imagine if you had to know how to actually use the forge and anvil to put new weapons and armor together, instead of just navigating a menu? THAT would be immersive too, but sometimes immersion really does just need to take a hit for the sake of gameplay.\r<br />\r<br />In the real world, if I go to a store that typically sells the items I need, I know that they&#39;ll have the items I need.  Furthermore, if it&#39;s something I buy frequently (such as a grocery item), I know from memory exactly what isle it&#39;s going to be on, and even in what spot on said isle it can be found. If I know exactly what I&#39;m getting and there isn&#39;t a line at the check-out counter, I can be in, out, and on with my day in a few minutes.\r<br />\r<br />Skyrim&#39;s lack of merchant reliability is the most glaring when we&#39;re dealing with ingredients and supplies.  I mean... sure, maybe the weapons and armor have to be manufactured on-sight, so perhaps it makes a little sense there, but aren&#39;t the ingots supposed to be mass-produced?  Warmaidens has a smelter, but not a nearby mine, so where do they get the ores to smelt with?  They simply HAVE to buy the ores from a different mine&#33;  At which point, why can&#39;t they be reliable in their stock?\r<br />\r<br />This problem is rectified, to some extent, by the &#34;supplies chests&#34; mods created by Tanis Half-Elven, over on Steam Community. For those who don&#39;t know, here are some links to his mods:\r<br />\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=80659553\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=81224868\r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=81234470\r<br />\r<br />However,there was only one problem with these mods:  They are unabashed cheat mods.  they give you these items, 100% no-strings attached.  It breaks the game.\r<br />\r<br />Another attempt to rectifythis problem was made, right here on the Nexus, by alexbull_uk, with his &#34;Order My Items&#34; mod.  With that mod, you still have to pay for your items, so you aren&#39;t going to be at 100 smithing, alchemy, and enchanting in the first hour of the game (unless you use console commands to give yourself the needed money, at which point, why not just use console commands to boost up your skills directly). However, this mod is incomplete and he hasn&#39;t updated it in over a year. You can&#39;t order soul gems from court wizards, potions from apothecaries, or leather/leather strips from blacksmith merchants.  That&#39;s infuriating.\r<br />\r<br />So, I made this mod. It changes the merchant chests for Warmaidens, Eurlond, Arcadia&#39;s Cauldron, and Farengar, so they carry steady  supplies.\r<br />\r<br />[size=6][b]CHANGES MADE[/b][/size]\r<br />Warmadienswill now have for sale ...\r<br />1. One enchantment type of every commonenchantment effect (in other words, 1 &#34;fire damage&#34; weapon,\r<br />1 &#34;fortify health&#34; apparel, etc.) for you to disenchant.\r<br />2.Unenchanted, steel varieties of every weapon type (you&#39;re not getting dragonbone weapons at level 1 with this mod).\r<br />3. A full set ofunenchanted hide, leather, steel, and Dwarven armors (complete with shields, where shields with those materials exist). Again, no higher than Dwarven/Leather for early game balance&#39;s sake.\r<br />4. 1,000 ofevery type of ingot except iron.\r<br />5. 2,500 iron ingots\r<br />6. 2,500Leathers\r<br />7. 2,500 leather strips\r<br />8. 1,000 of every gem type,flawed and flawless.\r<br />\r<br />Eurlond has the same thing as Warmadiens,except replace the Dwarven armor with Companions armor.  He also continues to sell skyforge steel weapons.\r<br />\r<br />Arcadia&#39;s Cauldronwill now have for sale ... \r<br />1. 100 of each ingredient in thevanilla game (keywords have been added to ingredients that are needed so they appear for sale without the Merchant perk).\r<br />2. 1,000Daedra Hearts. I&#39;ve included so many because they&#39;re needed for Daedric Smithing, but they do not normally appear in Warmadiens because they&#39;re alchemy ingredients).\r<br />3. 10 of most types ofpotions, except as explained below:\r<br />[font=Tahoma]   [/font](a) 50 each for Potions of Minor Healing/Magicka/Stamina\r<br />   (b) 30 each for the second-weakest healing/magicka/stamina potions\r<br />   (c) 20 each for the middle-of-the-line of those potions (e.g. Potion of Vigorous Healing)\r<br />   (d) 10 each forthe second strongest potions that restore attributes\r<br />   (e) 1 Potion of Ultimate Healing, Potion of Ultimate Magicka, and Potion of Ultimate Stamina\r<br />\r<br />Future editions of this mod may includerecipes also.\r<br />\r<br />Farengar will now have for sale:\r<br />1. 1,000 ofeach type of soul gem, filled and empty (with the exception of filled black soul gems).\r<br />2. 1 of each enchantment type of ring ornecklace. This is so you can have access to disenchant effects that normally don&#39;t appear on armor pieces (and thus, will not be sold by Warmadiens), such as Fortify Barter.\r<br />3. 1 of each generic stafffound in the game.\r<br />4. 1 of each magic robe for you todisenchant.\r<br />5. 10 of each scroll that is normally found in randomloot.\r<br />\r<br />[size=6]FAQ[/size][size=2]\r<br />[/size][size=3][b]Why not include filled black soul gems?\r<br />[/b][/size][size=2]Because buying them is pointless, compared to buying filled grand soul gems. If you want to buy pre-filled soul gems to save you the trouble of having to fill them yourself, grand soul gems are just as powerful as black ones, but are at 2/3 the price. Black soul gems only have an advantage over grand ones if you&#39;re buying them empty and filling  them yourself.[/size]\r<br />\r<br />[b][size=2]Can you include Azura&#39;s/Black Star in Farengar&#39;s chest too?[/size][/b]\r<br />[size=2]I considered that. After all, the one disadvantage to the Azura/Black Star is that you only have one of them, so using it for anything other than recharging requires you go out, fill the star, return, make a single enchantment, go back out, fill the star, ram your head against the wall, return to city, etc.  Being able to purchase numerous Black Stars would give you the best of both worlds, wouldn&#39;t it?[/size]\r<br />\r<br />[size=2]However,when I playtested that, I found a pretty annoying glitch:  When I filled a stack of Black Stars and went to the enchanting table to make enchantments with them, using one filled black star caused the entire stack to be rendered empty, on a single enchantment.[/size]\r<br />\r<br />[size=2]It&#39;s apparently an anomaly in the Black Star&#39;s scripting that Bethesda never though to patch up because they didn&#39;t expect you to ever have more than one Azura/Black star at a time.[/size]\r<br />\r<br />[size=2]So,unfortunately, I can&#39;t give you multiple black stars.  Sorry.[/size]\r<br />\r<br />[b][size=2]Why didn&#39;t you change the merchant&#39;s chests for other cities, too?[/size][/b]\r<br />[size=2]If this mod goes over well, I might. I didn&#39;t do so this time because I only made enough changes to satisfy me personally.  I&#39;m not going to bother with the tedium for any other merchants chests, unless this mod gains some popularity.[/size]\r<br />\r<br />[size=2]In fact, this upload is just as much for my convenience as it is for your consumption. It&#39;s basically me making a back-up copy of this mod, so that, in the event of a system failure, I can just download it again and I don&#39;t have to create the mod all over again from scratch.[/size]\r<br />\r<br />[b][size=2]Why 2,500 iron ingots,leathers, & leather strips, but 1,000 of everything else?[/size][/b]\r<br />[size=2]Two reasons:[/size]\r<br />\r<br />[size=2]1. It will take you 2,486 iron daggers to get your smithing up from 15 to\r<br />100, without standing stones or rested bonuses. Giving you access to 2,500 iron ingots and leather strips enables you to make you smithing legendary and instantly get it back up to 100 in a single day (although it will take about an hour real-time).[/size]\r<br />[size=2]2.Iron & leather items are abundant loot, even at high levels. Being able to purchase tons and tons of tempering materials will allow you to increase the value of this loot before selling it.[/size]\r<br />\r<br />[b][size=2]How do you expect me tocarry enough loot back to Whiterun that I&#39;ll need 2,500 ingots to\r<br />temper them all?[/size][/b]\r<br />[size=2]Plenty of ways to do that. Horses, mods that increase carry weight, the Bag of Holding mod, dead thralls, and let&#39;s not forget good ol&#39;e fashioned console commands&#33;[/size]",
  "categoryId": "69",
  "version": "",
  "author": "stebbinsd",
  "createdUnix": "1445452190",
  "updatedUnix": "1445452190",
  "containsAdultContent": false,
  "uploadedBy": "stebbinsd",
  "primaryFile": null,
  "files": []
}