{
  "modId": 70842.0,
  "modName": "Scottish Celtic Reachmen",
  "summary": "Reachmen wear Kilts and Tartan",
  "descriptionHtml": "(German description below / Deutsche Beschreibung unten)\r<br />\r<br />\r<br />Hello everybody\r<br />\r<br />I found the Reikmannen (citizens of Reach) compared to the Imperial and \r<br />the North for extremely primitive, especially considering that they have\r<br /> common roots with the highly cultivated Bretons. Ok the Bretons are fused with an elf people, but that makes it even more incredible that they are still in the Stone Age&#33;\r<br />I thought: The Imperial correspond to the Romans, the North to the viking, the Akaviri to the Japanese .... and so on. Which people are based, the citizens of Reach and the Bretons?\r<br />The Bretons of our world live in France in Brittany. They came from the British Isles on the run from the Angles and Saxons. Against this background, the Bretons would be the British Celts correspond to Merlin and King Arthur. The Forsworn cases on their special Painting. In Britain there was a nation that was even named thereafter. The Picts&#33;\r<br />They were opposed by the Romans, but the emperor Hadrian had Caledonia (Scotland) left to the Picts, and built Hadrian&#39;s Wall. With the Irish Scots they founded in the early Middle Ages the Kingdom of Dalratien to can fight together against the Vikings who settled at the \r<br />time in the north of Scotland and raided the British Isles. For this kingdom Scotland emerged as we know it.\r<br />=&gt; So I think the Forsworn and Reach Shared is an allusion to the ancient Scottish highlands.\r<br />\r<br />My Mod brings the Reach so technically a little further.\r<br />\r<br />It is divided in order to give you the opportunity to adapt it.\r<br />\r<br />1. Main part clothes:\r<br />There are the Forsworn armor replaced, zievielclothes inserted and added new armor in the Scottish stem.\r<br />The armor of the ancient gods is only slightly changed.\r<br />\r<br />2. Weapons:\r<br />The normal forsworn weapons be replaced, no esp necessary, you will only need the Meshes and Textures.\r<br />The ESP &#34;Forsworn Claymore&#34; adds a Klaymore\r<br />The ESP &#34;forsworn Red Eagle&#34; replaced the sword of Red Eagle.\r<br />\r<br />I&#39;ve done this because there are already quite a few mods for weapons and the sword of the Red Eagle. Sorry, but I want things as simple as possible.\r<br />\r<br />\r<br />I have worked for over a year ON THIS MOD BUT I find always resist BUGS&#33; Showing ALSO certainly new versions arrive.\r<br />\r<br />I tried to work on the basis of another Modder: http://www.nexusmods.com/skyrim/mods/60027/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D60027%26preview%3D1\r<br />Unfortunately gabs no way the mod with my ideas to unite, but who finds out how to \r<br />get my can replace rock through this, without it I would be glad if \r<br />crashes to get help.\r<br />_______________________________________________________________________________________________________\r<br />\r<br />Hallo zusammen\r<br />\r<br />Ich fand die Reikmannen (Einwohner von Reach) im vergleich zu den Kaiserlichen und den Nord für extrem primitiv, \r<br />besonders wenn man bedenkt, dass sie mit den hochkultivierten Bretonen \r<br />gemeinsame Wurzeln haben. Ok die Bretonen sind mit einem Elfenvolk \r<br />verschmolzen, aber das macht es noch unglaubwürdiger, dass sie noch in \r<br />der Steinzeit sind&#33;\r<br />Ich habe mir gedacht: Die Kaiserlichen entsprechen den Römern, die Nord den Wickingern, die Akaviri den \r<br />Japanern.... und so weiter. Auf welchem Volk basieren die Einwohner von \r<br />Reach und die Bretonen?\r<br />Die Bretonen unserer Welt leben in Frankreich in der Bretagne. Sie kamen von den Britischen Inseln auf der Flucht vor\r<br /> den Angeln und Sachsen. Vor diesem Hintergrund würden die Bretonen den \r<br />Britischen Kelten um Merlin und König Artus entsprechen. Die \r<br />Abgeschworenen fällen durch ihre besondere Bemahlung auf. In Britanien \r<br />gab es ein Volk, dass sogar danach benant wurde. Die Pikten&#33;\r<br />Sie wurden von den Römern bekämpft, aber Kaiser Hadrian mußte Kaledonien \r<br />(Schottland) den Pikten überlassen und baute den Hadrianswall. Mit den \r<br />Irischen Scoten gründeten sie im frühmittelalter das Königreich \r<br />Dalratien um sich gemeinsam gegen die Wickinger wehren zu können die zu \r<br />der Zeit die Britischen Inseln überfiehlen und im Norden Schottlands \r<br />siedelten. Aus diesem Reich entstand Schottland wie wir es kennen.\r<br />=&gt; Ich denke also die Abgeschworenen und Reach algemein ist eine Anspielung auf das antike schottische Hochland.\r<br />\r<br />Mein Mod bringt die Reach also technisch etwas weiter.\r<br />\r<br />Er ist geteilt, um euch die Möglichkeit zu geben ihn anzupassen.\r<br />\r<br />1. Hauptteil Kleidung:\r<br />Es werden die Abgeschwohrenen Rüstungen ersetzt, zievielversionen \r<br />eingefügt und Neue Rüstungen im Schottischen Stiel hinzugefügt.\r<br />Die Rüstung der alten Götter ist nur leicht verändert.\r<br />\r<br />2. Waffen:\r<br />Die normalen abgeschwohrenen Waffen werden ersetzt, keine esp nötig nur die Mesh und Texturen müssen kopiert weden.\r<br />Die esp &#34;Forsworn Claymore&#34; fügt ein Klaymore hinzu\r<br />Die esp &#34;forsworn Roter Adler&#34; ersetzt das Schwert des roten adlers.\r<br />\r<br />Ich habe das gemacht, da es für Waffen und das Schwert des Roten Adlers \r<br />bereits etliche Mods gibt. Sorry, aber ich möchte die sache so einfach \r<br />wie möglich halten.\r<br />\r<br />\r<br />ICH ARBEITE SEIT ÜBER EINEM JAHR AN DIESER MOD ABER ICH ENTDECKE IMMER WIDER BUGS&#33; ES WERDEN ALSO SICHER \r<br />NOCH NEUE VERSIONEN KOMMEN.\r<br />\r<br />Ich habe versucht auf basis eines anderen Madders zu arbeiten: \r<br />http://www.nexusmods.com/skyrim/mods/60027/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D60027%26preview%3D1\r<br />Leider gabs keine Möglichkeit den Mod mit meinen Vorstellungen zu vereinen, \r<br />aber wer rauskriegt, wie man meinen Rock durch diesen ersetzen kann, \r<br />ohne dass es abstürzt würde ich mich freuen wenn ich hilfe bekomme.",
  "categoryId": "79",
  "version": "1",
  "author": "BerndR",
  "createdUnix": "1445722670",
  "updatedUnix": "1445720831",
  "containsAdultContent": false,
  "uploadedBy": "BerndR",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000182259",
      "name": "Schottisch Forsworn",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "53536",
      "fileName": "Schottisch Forsworn-70842-1.7z",
      "uploadedUnix": "1445720831",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/65835c1387c4208e080f6b484519d2d97f944aba2645a6848b7e092e30f124b7/analysis/1445720909/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Schottisch%20Forsworn-70842-1.7z?fid=1000182259&ttl=1535859372&ri=8192&rs=8192&setec=b47924a08ac7d73d70cd18e6013f4b21"
    }
  ]
}