{
  "modId": 70974.0,
  "modName": "E725 - Edgy Omegasteel Katana",
  "summary": "[Epic death metal music begins] A katana crafted from raw Titansteel and bathed in the blood of a thousand Omega demons harvested in fifteen minutes from the darkest of hells from the edgiest of alternate universes by one very bored Unicorn with a slaugher-factory demon farm and a very specific clientèle in mind. This sword can slice easily throug",
  "descriptionHtml": "[Epic death metal music begins] A katana crafted from raw Titansteel and bathed in the blood of a thousand Omega demons harvested in fifteen minutes from the darkest of hells from the edgiest of alternate universes by one very bored Unicorn with a slaugher-factory demon farm and a very specific clientèle in mind. This sword can slice easily through flesh and bone and soul alike, and doesn&#39;t even need to hit them directly to kill them. Just point it at your target and swing down, and BOOM, you&#39;ve got yourself some death&#33;\r<br />\r<br />Some people have wondered how many times this was folded. The answer? None. That unicorn NEVER folds. He wants profit, he&#39;ll get profit, and he&#39;s a vicious little bugger when it comes to killing evil things and profiting from it. I&#39;m not joking. Don&#39;t let him near the modding department, ok? We&#39;re still recovering from his last visit. And if you&#39;re wondering how many times this weapon was folded... None, because Silver never folds.\r<br />\r<br />Because landmarks and clear screenshots aren&#39;t enough: IT&#39;S IN FRONT OF RIVERWOOD&#33; IT&#39;S RIGHT IN FRONT OF OBLIVION-DAMNED RIVERWOOD&#33; Walk into Riverwood when you start the game, and POMF, THERE IT IS&#33; IT&#39;S RIGHT&#33; IN&#33; FRONT&#33; OF&#33; RIVERWOOOOOOD-AH&#33; *Guitars explode*",
  "categoryId": "55",
  "version": "1.00",
  "author": "Epsilon725 AKA SilverStarApple",
  "createdUnix": "1446137189",
  "updatedUnix": "1446137183",
  "containsAdultContent": false,
  "uploadedBy": "Epsilon725",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000182964",
      "name": "E725_Edgy_Omegasteel_Katana",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "E725_Edgy_Omegasteel_Katana-70974-1-00.7z",
      "uploadedUnix": "1446137183",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/0835798ae561a13c87621fc89f64269bdd2ba058870963ff0ee97efd146e7899/analysis/1446137225/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/E725_Edgy_Omegasteel_Katana-70974-1-00.7z?fid=1000182964&ttl=1535859489&ri=8192&rs=8192&setec=7966e4ff4474cc009c5fbbd41dfc1477"
    }
  ]
}