{
  "modId": 71032.0,
  "modName": "Skyrim Immersive Creature Stormcloak Wolves Faction Fix",
  "summary": "Puts Stormcloak Wolves in the StormCloak Faction, removes them from Wolves Faction and Animals yada yada.  Without this Stormcloak Wolves will attack you because Wolf Faction is hostile to player by default.  Requires Skyrim Immersive Creatures (SIC)",
  "descriptionHtml": "For a long time I thought, &#34;Its just me, my load order has something wrong.&#34;\r<br />\r<br />But as you can see from the pictures I have provided, its not just me....\r<br />\r<br />Its effecting everyone that uses Skyrim Immersive Creatures.\r<br />Although there are modifications to make SIC work with Skytest-Realistic Wildlife Overhaul and the like, using those with the corresponding patches &#34;should&#34; eliminate the problem, but what about people that only want to use SIC maybe cause their Load Order is stressed enough already eh?  Well without this patch your going to run into a StormCloak Patrol with a Wolf out there sometime or another...Once that happens you become an enemy of the StormCloak faction even if you were avoiding the Civil War the whole time &gt;:-((\r<br />\r<br />\r<br />Do you use SIC?\r<br />\r<br />Ever wonder why the Stormcloak Wolves suicide on your Dragonborn?\r<br />\r<br />Well don&#39;t wonder about it anymore, in fact it was all a secret plot to turn the Dragonborn against the rightful rulers of Skyrim, that&#39;s right Thalmor Agents used Illusion magics on Stormcloak Wolves to get bereeved soldiers to cry &#34;U killed mah dog, now I kill U&#33;&#34;\r<br />\r<br />All joking aside without this mod you will be at war with Stormcloaks very soon when using SIC, Skyrim Immersive Creatures.\r<br />\r<br />_______________________\r<br />\r<br />Contents\r<br />1 ESP\r<br />\r<br />Installation: Drag into Data Folder\r<br />\r<br />Load this after SIC, or merge it into SIC.\r<br />\r<br />I don&#39;t know if this requires a new game but if you happen to have seen a patrol and didn&#39;t get close enough to set off the wolf you might want to console kill the wolf and then you should be good as all Stormcloak Wolves before you load the fix should have the old faction data saved into their AI until they die or despawn.  New wolves after this modification will be in the Stormcloak faction and not a member of the Wolves Faction.",
  "categoryId": "78",
  "version": "1.0",
  "author": "Gamefever",
  "createdUnix": "1446312101",
  "updatedUnix": "1446312095",
  "containsAdultContent": false,
  "uploadedBy": "gamefever",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000183267",
      "name": "Skyrim Immersive Creatures StormCloak Wolves Faction Fix",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Skyrim Immersive Creatures StormCloak Wolves Faction Fix-71032-1-0.rar",
      "uploadedUnix": "1446312095",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4c79926db4b80e1dafac621cbe0d5de6946a4962051635c6ce7979cf6e1c8b4e/analysis/1446312122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Immersive%20Creatures%20StormCloak%20Wolves%20Faction%20Fix-71032-1-0.rar?fid=1000183267&ttl=1535859538&ri=8192&rs=8192&setec=08c4434c28c688a6eb77c5e1083e56b7"
    }
  ]
}