{
  "modId": 7104.0,
  "modName": "Star Wars Force Abilities Mod",
  "summary": "A collection of Force Abilities.",
  "descriptionHtml": "Star Wars Force Abilities Mod\r<br />\r<br />I&#39;m sorry, but I feel that I have done all I can with this mod. There is a new mod that I am currently working on with SephDragoon. Here is the link to the new mod. \r<br />\r<br />http://skyrim.nexusmods.com/mods/24585\r<br />\r<br />\r<br />Please download the new mod and endorse it if you like it.\r<br />\r<br />\r<br />\r<br />UPDATE 3.6\r<br />Fixes problems for those who didn&#39;t get new Force Abilities in the last update. Also adds the ability Force Wave. You should really look these powers up on Wookieepedia and see just how close I got them 8-)\r<br />\r<br />\r<br />UPDATE 3.5\r<br />Adds three more Force Abilities, Chain Lightning, Destruction and Lightning Shield. Changed the Force Ability &#34;Wave&#34; to be called &#34;Push Sustained&#34;. I recommend looking these powers up on &#34;Wookieepedia&#34; and see how close I got them to Star Wars lore. :-) I&#39;ll be uploading the optional files for no jump setting change and jump settings lowered to 350. I&#39;ve used the 350 jump setting for over 50 hours and found no flaws. If any are found, please by all means let me know so I can fix ASAP. I hope you all enjoy the mod, I&#39;ve spent many long hours this past week working on it, so I hope its liked.    ;-)\r<br />\r<br />\r<br />UPDATE 3.0\r<br />Big update&#33; I&#39;ve added four more Force Abilities, now there&#39;s 15. The new abilities are Deflection, Persuasion, Drain and Corruption. I&#39;ve also strengthened the ability Force Push and removed the hostility from Drain, Stasis and Push. I&#39;ve added all the Holocrons to Urag gro-Shub&#39;s inventory in the College of Winterhold Arcanaeum. I&#39;d like to thank Nexus user phenderix for telling me how to add the Holocrons to merchant inventory. I hope everyone enjoys the new update and I&#39;ll also be adding an option for no jump height change.\r<br />\r<br />\r<br />SMALL UPDATE 2.2\r<br />I&#39;ve added an optional file that leaves the jump settings unchanged, per request. So if you prefer to use your own jump settings, download the main file, then download the optional file and overwrite.\r<br />\r<br />UPDATE 2.2\r<br />I forgot to add the meshes and texture in version 2.0, sorry. I&#39;ve got them up now in 2.2, so try it out and let me know what you think \r<br />\r<br />\r<br />UPDATE 2.0\r<br />I&#39;ve added Holocrons for the abilities that act as spell tomes. They may be able to be bought from a vendor, but I&#39;m not sure. I haven&#39;t seen them in anyone&#39;s inventory. So a far as I know, they must be aquired through console commands. I&#39;ve also increased the max jump height and I&#39;ve re-calculated the fall damage accordingly. So now you should be able to jump like a Sith or Jedi. I&#39;ve also changed the Force Ability: Stasis to be non-hostile, so now you can use it on friendly npc&#39;s and if you use it on non-friendly npc&#39;s, when they come back to, they just go back to what they were doing before you paralysed them. It also work great if you use it with Force Cloak, I haven&#39;t been caught yet using the two together. I&#39;ve also made a new ability &#34;Force Stasis Field&#34;. It has an area of 300, so you can paralyze multiple npc&#39;s at once without consequence. It&#39;s perfect for escaping groups of npc&#39;s quickly and pain free. Again, I hope you like and please endorse if you do&#33;\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />SMALL UPDATE\r<br />I just wanna say that I hope everyone is enjoying the mod. I&#39;ve been working on it for the past few days as much as I could in my free time. I&#39;ve got some changes up coming as you can tell from the pics. I&#39;m making Holocrons for the abilities and then I&#39;ll be adding new abilities as my skills progress. Remember, I&#39;m still a noob :-p So like I said, I hope you are enjoying this mod and if you are, please come back and endorse. \r<br />\r<br />\r<br />Update 1.2\r<br />I&#39;ve changed the Telekinesis hand effects so they seem more &#34;Force-like&#34;\r<br />\r<br />\r<br />\r<br />This is still a work in progress. Currently the only way to get the spells is through console commands. Sorry about that, but I&#39;m still new to this. Which is why this is a WIP. The magicka usage is currently not balanced, but that should change once the Creation Kit comes out. There are also more abilities to come, as soon as I work out the bugs. \r<br />\r<br />\r<br />\r<br />\r<br />Force Ability: Cloak\r<br />Uses the Force to photo-kinetically bend light waves around the user, rendering them invisible to others, both visually and through Force.\r<br />\r<br />(This is spell the combines the Invisibility spell and Muffle. It costs 7 magicka to use.)\r<br />\r<br />\r<br />Force Ability: Fear\r<br />Strikes directly at the deepest parts of the target&#39;s mind causing an uncontrollable shaking fear. Causing them to cower defenselessly or outright flee.\r<br />\r<br />(This causes the target to run away from battle in fear. It is a projectile spell and costs 7 magicka to use.)\r<br />\r<br />\r<br />Force Ability: Healing\r<br />A power that uses the Force to accelerate the natural healing process rapidly.\r<br />\r<br />(A powerful sustained restoration spell the restores health and stamina rapidly. It costs 7 magicka per sec to use.)\r<br />\r<br />\r<br />Force Ability: Lightning\r<br />A purely offensive, energy-based attack that channels Force energy, hurling arcing bolts of electricity from the fingertips or palms.\r<br />\r<br />(A sustained shock spell, similar to sparks, that is powerful and costs 7 magicka per sec to use.)\r<br />\r<br />\r<br />Force Ability: Push\r<br />Creates telekinetic impulse via the Force, launching a concussive burst of pressurized air, impacting a target with enough force to knock it over.\r<br />\r<br />(A projectile version of the shout Unrelenting Force 02 that can be used with either hand. It costs 14 magicka per sec to use)\r<br />\r<br />\r<br />Force Ability: Pyrokinesis\r<br />Force power that allowes the Force-user to manipulate and create fire.\r<br />\r<br />(This is like the spell Wall of Flames. It is a sustained spell and costs 7 magicka per sec to use.)\r<br />\r<br />\r<br />Force Ability: Sight\r<br />Enhances the bearer&#39;s visual and spatial perception even in the dark or behind walls.\r<br />\r<br />(This combines the spells Detect Life, Detect Undead and Night Eye. This is a sustained spell that has an area of 100ft inside and 200ft outside. It costs 7 magicka to use.)\r<br />\r<br />\r<br />Force Ability: Stasis\r<br />Uses the Force to deaden the senses of an enemy, inducing a near-catatonic state and in effect freezing that person or being in place.\r<br />\r<br />(This causes stagger and then paralysis for 60 seconds. It is a projectile spell and costs 7 magicka to use.)\r<br />\r<br />\r<br />Force Ability: Telekinesis\r<br />A neutral ability that most Force-sensitives have. With it, they can lift objects according to their concentration and move them, hovering the items in any direction. \r<br />\r<br />(Basically just the vanilla spell, Telekinesis. It is a sustained spell and costs 7 magicka per sec to use.)\r<br />\r<br />\r<br />Force Ability: Wave\r<br />A wave of pure Force-energy that pulses out from the Force user, knocking back anything within the power&#39;s blast radius.\r<br />\r<br />(A sustained version of the shout Unrelenting Force 03 that can be used with either hand. It costs 14 magicka per sec to use)\r<br />\r<br />\r<br />If you want to use my work in any of your stuff, please give me credit for what I&#39;ve done ;-)\r<br />\r<br />I&#39;d like to give credit to Bethesda, Skyedit and Wookieepedia.\r<br />http://starwars.wikia.com/wiki/Force_power\r<br />\r<br />-avenger86",
  "categoryId": "75",
  "version": "3.6",
  "author": "avenger86",
  "createdUnix": "1327606644",
  "updatedUnix": "1328304735",
  "containsAdultContent": false,
  "uploadedBy": "avenger86",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25150",
      "name": "Star Wars Force Abilities Mod WIP _No Jump Change",
      "version": "3.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Star Wars Force Abilities Mod WIP _No Jump Change-7104-3-5.zip",
      "uploadedUnix": "1328161418",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/cb624c2cf708641bd2f2e2951116bd85f39e5dd36977e2a12ef29d2ed84ad290/analysis/1406649555/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Star%20Wars%20Force%20Abilities%20Mod%20WIP%20_No%20Jump%20Change-7104-3-5.zip?fid=25150&ttl=1535764961&ri=8192&rs=8192&setec=1e0f57fdda5780b922583cca857cc5cf"
    },
    {
      "fileId": "25152",
      "name": "Star Wars Force Abilities Mod WIP _Jump Settings 350",
      "version": "3.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "6",
      "fileName": "Star Wars Force Abilities Mod WIP _Jump Settings 350-7104-3-5.zip",
      "uploadedUnix": "1328161701",
      "modVersion": "3.5",
      "virusScanUrl": "https://www.virustotal.com/file/d26d22c404703db587998e0e8f4b16aacf55028d0789647b553157bdf86c09dc/analysis/1406649606/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Star%20Wars%20Force%20Abilities%20Mod%20WIP%20_Jump%20Settings%20350-7104-3-5.zip?fid=25152&ttl=1535764962&ri=8192&rs=8192&setec=e25dbc418f868e51da96a261174d90ca"
    },
    {
      "fileId": "25629",
      "name": "Star Wars Force Abilities Mod WIP",
      "version": "3.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11598",
      "fileName": "Star Wars Force Abilities Mod WIP-7104-3-6.zip",
      "uploadedUnix": "1328304735",
      "modVersion": "3.6",
      "virusScanUrl": "https://www.virustotal.com/file/4aadad54b87e365afb4be6945b68a93ce441cb4d2ab8c46e6139b10689f9b70f/analysis/1406652136/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Star%20Wars%20Force%20Abilities%20Mod%20WIP-7104-3-6.zip?fid=25629&ttl=1535764962&ri=8192&rs=8192&setec=8e88ff66f0755a0295052b3ae8764aea"
    }
  ]
}