{
  "modId": 71089.0,
  "modName": "Alvos Tomb",
  "summary": "A small dungeon in southern Skyrim",
  "descriptionHtml": "Hello all&#33;&#33;\r<br />\r<br />Just finished reading the comments and I must say I am blown away. I honestly did not think anyone would like this and I am very happy that people did. I am working on some of the changes that were posted. I am the stage manager at my school theater and we are currently 3 days away from opening so I have been extremely busy and have not had a large amount of time. After this coming weekend however I will not have to be at school until the late evening so I can take some time and put some of these comments into practice :). \r<br />\r<br />If you are looking for more info on the dungeon I will be adding more screenshots along with my mod setup so you guys have an idea of what I am working with. \r<br />\r<br />As for location, the dungeon is located just past the Guardian Stones at the bottom of the lake. Ill upload a photo with the location of the map. Not exact but it should get you close enough until I can figure out how to actually add a quest, location marker etc. \r<br />\r<br />Special thanks to the user Vlammenzee for uploading a picture of the location on the map. I uploaded it to the main photos of the mod but all photo credit \r<br />to him for that photo. Cheers m8&#33;\r<br />\r<br />Again, Thank you all so much for your feedback and I will be working on fixing it up in the coming weeks :)\r<br />",
  "categoryId": "88",
  "version": "1.0",
  "author": "ShadyCornerz",
  "createdUnix": "1446478304",
  "updatedUnix": "1446478299",
  "containsAdultContent": false,
  "uploadedBy": "ShadyCornerz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000183471",
      "name": "Alvos Tomb",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91",
      "fileName": "Alvos Tomb-71089-1-0.rar",
      "uploadedUnix": "1446478299",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/44200ba0ac1c5b97cfa3e4e1c30feee9e62c0017f3194df59a8d8051a181c264/analysis/1446478322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alvos%20Tomb-71089-1-0.rar?fid=1000183471&ttl=1535859598&ri=8192&rs=8192&setec=ff7912f73cc2d0b85dc60202e67a844d"
    }
  ]
}