{
  "modId": 71135.0,
  "modName": "ClefJ&#39;s Half-Moon Mill",
  "summary": "A small but stylish transformation of the Half-Moon Mill, with Inn and Player Home&#33; ",
  "descriptionHtml": "[center][font=Georgia][color=#ff0000][size=6]Half-Moon Mill[/size][/color][/font]\r<br />~A Fantasy Addition~\r<br />\r<br />Remember when I said I might be done with modding for a bit? I lied.\r<br />\r<br />Half-Moon Mill was a tiny location with a wonderful lakeside view, and technically in a strategically important location in Falkreath Hold now that Helgen bit the dust. I did not turn it into a fort town, but rather a passerby&#39;s trading town. People would come from Falkreath to Rorikstead, trading foods and lumber, or rather will now. It uses unique static meshes, such as snow-free Windhelm buildings, and blending them with Markarth and Whiterun architecture to make for something small but spectacular. \r<br />\r<br />Thank you Hodilton for a wonderful new video&#33;\r<br />[youtube]EyvshhKUheg[/youtube]\r<br />\r<br />And thank you Pixelgamer&#33;\r<br />[youtube]HNNhj770Gcs[/youtube]\r<br />[color=#d9ead3]\r<br />[color=#a2c4c9]The new town comes with: [/color][/color]\r<br />- An Inn, the [color=#ff00ff]Crescent Stage and Tap[/color], where you can get your drinks and live entertainment from a uniquely lit performance stage, crafted by magicka from the Inn&#39;s owners, who barter just about everything that passes through. The Innkeeper will rent out the tap&#39;s only guest bedroom to you, and her husband (normally sulking in his room) will buy and sell properly leveled spells and magic items. The inn itself I tried to model after the Milk Bar from one of my favorite games, TLOZ: Majora&#39;s Mask.  \r<br />- A new home,[color=#ff00ff] Secunda Cabin[/color], for the town&#39;s sellsword, Herzog. Alternatively, you can use this cabin to house your followers with any number of mods on the Nexus that&#39;ll allow you to do so&#33;\r<br />- Outside, crafting stations are here and there, with some of the missing amenities added in the shed by the mill, which has been expanded into being the lake&#39;s lighthouse&#33; Certain ambience mods like SoS are compatible with the relatively unchanged location. The Inn has a lovely deck with a fisherman overlooking the lake, which moves around to the large iron ore vein left there originally. \r<br />- A new Player Home, [color=#ff00ff]Masser Manor[/color], who&#39;s previous tennant has been captured by Vampires and holds the key to the house. The accompanying dungeon, who&#39;s entrance is by the outdoor bench by the smaller cabin, is small but stylish, and can be challenging to lvl15 characters. The home itself has only a single mannequin, but several weapon displays, and works with the word &#39;cozy&#39;. The home also has a small garden and cow pen.\r<br />- Navmeshes were only very lightly edited for the territory, with more &#39;preferred&#39; zones added on existing triangles. \r<br />- Cleaned with TES5Edit&#33; \r<br />- Player Home works with Hearthfire Multiple Adoptions&#33; \r<br />\r<br />[color=#ff0000]Compatibility:[/color]\r<br />- This mod is certainly Not Compatible with major town modifications in this zone, including the lovely Wolvenna&#39;s Half-Moon Vampire Town.\r<br />- Certain player homes are compatible, such as those outside the creek&#39;s bridge, like Half-Moon Chalet.\r<br />\r<br />\r<br />[color=#a2c4c9]Requirements: [/color]\r<br />- Needs the latest version, and Hearthfire.\r<br />-Everything is created with vanilla assets, and only contains a single .esp to install.\r<br />\r<br />Thank you for stopping by, I hope you enjoy&#33; [/center]",
  "categoryId": "53",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1446607414",
  "updatedUnix": "1447722862",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000183693",
      "name": "ClefJ&#39;s Half-Moon Mill",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "328",
      "fileName": "ClefJ's Half-Moon Mill-71135-1-0.zip",
      "uploadedUnix": "1446607312",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/eb322e6f07018c111147a400df3eb87c65491c1e3cd9a668f1fca4eecddde16e/analysis/1446607323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ClefJ%27s%20Half-Moon%20Mill-71135-1-0.zip?fid=1000183693&ttl=1535859657&ri=8192&rs=8192&setec=5c95e758028c4b30ed4b2a59b7459d22"
    },
    {
      "fileId": "1000185162",
      "name": "ClefJ Half Moon Mill- No House Ver",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "325",
      "fileName": "ClefJ Half Moon Mill- No House Ver-71135-1-0.zip",
      "uploadedUnix": "1447722862",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7f11c8631061b73a1a9093c4d7943ac2c428462311262857878e0f132c03e811/analysis/1447722904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ClefJ%20Half%20Moon%20Mill-%20No%20House%20Ver-71135-1-0.zip?fid=1000185162&ttl=1535859658&ri=8192&rs=8192&setec=aaf06201508e4a387813f218f017879f"
    }
  ]
}