{
  "modId": 71152.0,
  "modName": "Dalakyne&#39;s Breezehome",
  "summary": "A simple and inviting Breezhome. No clutter, no enchanting and no alchemy lab. Decoration can be bought from the steward in Dragonsreach like before.",
  "descriptionHtml": "[size=5]Description[/size]\r<br />\r<br />This is a simple lore-friendly Breezehome mod that makes the Dovahkiin&#39;s home in the central Whiterun a worthy abode, while not upgrading it too much.\r<br />All decorations are purchasable from the steward in Dragonsreach, like before (instead of war room it might say &#34;alchemy lab&#34; in the dialogue, I just didn&#39;t want to alter anything other than Breezehome).\r<br />\r<br />[youtube]--isNb0uJfs[/youtube]\r<br />[i](Inlined the video, for people who don&#39;t click on the Video tab...)[/i]\r<br />\r<br />[size=5]Updates[/size]\r<br />\r<br />I have cleaned the file (previously required masters included Dragonborn and Dawnguard for some reason, but no longer), but didn&#39;t alter anything.\r<br />This was previously known as Parochy&#39;s Breezehome, but I changed my user since.\r<br />\r<br />[size=5]Requirements[/size]\r<br />\r<br />You need Hearthfire.\r<br />You shouldn&#39;t have any other mod that alters the Breezehome interior. This includes lighting mods, such as &#34;RLO City Interiors&#34;.\r<br />\r<br />\r<br />[size=5]Features[/size]\r<br />\r<br />[list][*]A cozy feel with correct navmeshing (NPCs will walk around objects)\r<br />[*]Items intended for decoration are static (you can&#39;t knock them over or take them)\r<br />[*]Non-respawning storage (everything, including the barrels)\r<br />[*]Talos shrine on a large working bookcase\r<br />[*]Oven\r<br />[*]Cooking pot\r<br />[*]Separate master bedroom with a washing area, and a small office with a hidden safe behind a working bookcase\r<br />[*]Mannequin\r<br />[*]Weapon racks (2 at the entrance, 1 in the loft)\r<br />[*]Lydia&#39;s room is downstairs\r<br />[*]Upstairs you will find either a war room or (if you so choose) the kid&#39;s room\r<br />[/list]\r<br />\r<br />[size=5]Not Included[/size]\r<br />\r<br />There is no enchanting table (I use one added next to the Skyforge instead, from a different mod), and no alchemy lab (for my rare alchemical practices I use Arcadia&#39;s shop). If more people request it however, I might be inclined to add it.\r<br />\r<br />\r<br />[size=5]Installation[/size]\r<br />\r<br />Simply extract the archive to your Skyrim Data folder and enable the Breezehome.esp in your game&#39;s launcher.\r<br />The load order doesn&#39;t matter.\r<br />\r<br />\r<br />[size=5]Requests[/size]\r<br />\r<br />I&#39;m purely sharing the mods I made a long time ago. I don&#39;t intend to change them, since I like them the way they are. If you find bugs however, I might take a look. Other than that, no one&#39;s stopping you from making requests, and in the same manner I&#39;m also not required to heed them.\r<br />I will not alter the lighting however, since I intentionally made light sieve through the roof, cuz I think it&#39;s pretty.",
  "categoryId": "67",
  "version": "1.1",
  "author": "Dalakyne",
  "createdUnix": "1446659392",
  "updatedUnix": "1446659384",
  "containsAdultContent": false,
  "uploadedBy": "dalakyne",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000183767",
      "name": "Breezehome",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "113",
      "fileName": "Breezehome-71152-1-1.zip",
      "uploadedUnix": "1446659384",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2076fa29571f9aa6fe16a9b2b84c6a0435290abed7be8f978e0cc0ae85f55404/analysis/1446659402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Breezehome-71152-1-1.zip?fid=1000183767&ttl=1535859671&ri=8192&rs=8192&setec=1deb27eefe14ef8f9a9c37a001829cef"
    }
  ]
}