{
  "modId": 71181.0,
  "modName": "Kurzgesagt -- A House Mod for Techmaturgists",
  "summary": "Kurzgesagt is a lore-friendly dwemer house located just outside of Markarth. The house is designed with a Techmaturgist character in mind, but should be a functional living space for just about anyone. All assets are vanilla and no DLC is required. ",
  "descriptionHtml": "[img]http://i.imgur.com/V7zr8bF.jpg[/img]\r<br />\r<br />\r<br />\r<br />\r<br />Kurzgesagt is an innocent looking player home just outside Markarth. The house looks innocent enough on the outside, but inside you will find that there is more to the home than meets the eye. The previous owner of the home has completed an excavation into the mountain where the home was built and uncovered a small part of the ancient dwemer ruins of Kurzgesagt. The home features a living quarters, cave, small underground pond, and techmaturgy lab. The actual house part of Kurzgesagt is rather plain, containing only a bedroom and simple dining area, but the lab in the back is sure to provide everything an aspiring Techmaturgist, wizard or smith should need. \r<br />\r<br />\r<br />The house does not require any DLC and should not impact performance too much. Followers should be able to roam about the home with no issue, however may have trouble getting in the bed due to the bed&#39;s activation points being placed in very awkward locations. \r<br />\r<br />\r<br />This is my first ever mod and I would appreciate any comments and criticism. If you find any bugs, please let me know and don&#39;t forget to endorse the file if you enjoy the house. \r<br />\r<br />Thank you for reading, and enjoy Kurzgesagt&#33;",
  "categoryId": "67",
  "version": "1.0",
  "author": "Pilkie",
  "createdUnix": "1446786386",
  "updatedUnix": "1446786753",
  "containsAdultContent": false,
  "uploadedBy": "Pilkie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000183941",
      "name": "kurzgesgatHome",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "36",
      "fileName": "kurzgesgatHome-71181-1-01.zip",
      "uploadedUnix": "1446786753",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/4a45c46042d32efc1531dc2f4ec855d6bbf665341a0d071caeec466b08aa0ed7/analysis/1446786782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/kurzgesgatHome-71181-1-01.zip?fid=1000183941&ttl=1535859703&ri=8192&rs=8192&setec=3bad2a4baebbf00cef00950f09a2c20e"
    }
  ]
}