{
  "modId": 71219.0,
  "modName": "Skyrim Modding and Troubleshooting Notes",
  "summary": "A small document with listed self-made tips on modding and troubleshooting specific problems with Skyrim.",
  "descriptionHtml": "This document I&#39;ve made over the years playing and modding Skyrim, including all its ups and downs and frustrations after hours of mixing and matching, trying mods together and other times removing them when they have problems. This is not a full guide with general instructions; these are SPECIFIC problems that I&#39;ve solved myself. For reference, there is a load order I posted at the end of it to show you some of the mods I troubleshooted on my computer. My machine is only average: an HP Pavilion dv7, AMD HD 6770 adapter, i7 processor and 8GB of RAM. It often has links to other pages when that website has a better explanation than I do. If anyone finds any one of these tips useful, uploading this document would be worth it.\r<br />If you&#39;d like me to explain any of the problems in detail and how I solved them; if for example, you have the exact same problem, I&#39;d be happy to share my experience... so long as I remember it. Skyrim&#39;s been out for four years now, remember?\r<br />If there ever comes a time when I have a 100% modded, stable game with 100+ plugins acitvated, and all working, I&#39;ll be updating this to \r<br />detail the EXACT steps of how to do this. Still, results vary from machine to machine, inevitably.\r<br />Thanks to basically all the modders whose mods I used, including Gopher who has a whole tutorial series to boot, and Bethesda for making Skyrim and supporting the modding community.\r<br />",
  "categoryId": "82",
  "version": "1.0",
  "author": "Soulfire72",
  "createdUnix": "1446937788",
  "updatedUnix": "1446937773",
  "containsAdultContent": false,
  "uploadedBy": "mhasemore",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000184130",
      "name": "Skyrim General Notes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Skyrim General Notes-71219-1-0.7z",
      "uploadedUnix": "1446937773",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0cdf5f0a9ef187f3167ea5bb06d885faccaba1aaa294ac5df74a341430ca8553/analysis/1446937804/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20General%20Notes-71219-1-0.7z?fid=1000184130&ttl=1535859736&ri=8192&rs=8192&setec=0df9daa950dcb116e000bfab69c566b9"
    }
  ]
}