{
  "modId": 71212.0,
  "modName": "Better Daedric Blades for Automatic Variants",
  "summary": "The first ever Automatic Variants package targeting weapons.",
  "descriptionHtml": "   [center][b]---------------------\r<br />THIS MOD REQUIRES AUTOMATIC VARIANTS. GET IT HERE: [/b][b]http://www.nexusmods.com/skyrim/mods/21377/[/b]\r<br />[b][b]---------------------[/b]\r<br />I DID NOT CREATE THESE TEXTURES.\r<br />DIRECT YOUR ENDORSEMENTS TO MIKEANDIKE&#39;S ORIGINAL RELEASE: http://www.nexusmods.com/skyrim/mods/24074/[/b]\r<br />[b]---------------------[/b]\r<br />[b]YOU CANNOT REUPLOAD THIS MOD WITHOUT MY PERMISSION AND MIKEANDIKE&#39;S PERMISSION. PLEASE READ THE PERMISSIONS SECTION ABOVE&#33;[/b][/center]\r<br />[center][b]Description[/b][/center]\r<br />Automatic Variants is well known as an excellent mod for making your Skyrim games more immersive and interesting, as every new attacker looks different enough to keep you from running into the &#34;Attack of the Clones&#34; problem, where you find yourself wondering if this is the same mudcrab you JUST KILLED or if there was one you missed.\r<br />\r<br />It&#39;s had somewhat hidden, completely undocumented support for Weapon Variants for some time (since Version 2.0, in fact&#33;) but due to lacking a wizard for Weapon Variants and having absolutely no documentation for the Specifications.json files included, no one has ever even bothered making a package.\r<br />\r<br />As it happens, none of the popular mods would even work as a package for it. New meshes don&#39;t play well with the Variant Builder, for currently unknown reasons. (Note: This IS being worked on&#33;) But retextures do work, with a few caveats. The trouble is finding a weapon retexture pack that would appeal to most players&#33; While there are many colored glass and Daedric retextures, and plenty of high res textures, the former are abomination to lorehounds and the latter would be pointless to anyone -- they&#39;d just give you a random chance of getting either the hideous blurry ones or the nice crisp ones.\r<br />\r<br />But I found one that seemed ideal.\r<br />\r<br />I contacted the original author of the Better Daedric Blades mod, the incomparable [url=http://forums.nexusmods.com/index.php?/user/159722-mikeandike/]mikeandike[/url], and asked him if he would like to upload the first and (currently) only Weapon Variant package for Automatic Variants. Instead, he graciously gave me permission to do so myself, as he has little interest or time for Skyrim modding these days.\r<br />\r<br />And that&#39;s what this is.\r<br />\r<br />Now, when you craft a Daedric Sword or Dagger or Greatsword, you&#39;re still always going to get the Vanilla version. This isn&#39;t a perfect solution, obviously. And hand placed ones are still going to be vanilla as well.\r<br />\r<br />But when a Daedric Sword of Ice pops up in a chest, half of the time it will now look different -- alien and twisted, more like the Daedric weapons of Morrowind and Oblivion. When you come across a bandit swinging wildly at your face with a Daedric Dagger, your second thought after &#34;Where did you get that?&#34; will be &#34;Goodness gracious that&#39;s nothing like any Daedric Dagger I&#39;ve ever seen&#33;&#34;\r<br />\r<br />Have mods that add new Daedric Swords that use the Vanilla meshes? Extend the number of enchanted variations? Change everything about them but the FormID and the nif? Those will sometimes pop up with these new meshes. No patches needed, no fussing with settings. Just use Automatic Variants and run the patcher. No problem.\r<br />\r<br />[center][b]Future Additions[/b][/center]\r<br />I intend to expand the style to cover all of the Daedric weapons, but I&#39;m not a good texture artist by any means. mike_and_ike is busy with newer mods, and is therefore unavailable to expand upon the package.\r<br />\r<br />So I won&#39;t give a time to completion or anything like that, and I will accept help from anyone in the community willing to offer it.\r<br />\r<br />Currently this package only covers those vanilla weapons that use the daedricsword.dds, daedricsword_m.dds and daedricsword_n.dds files, and any modded weapons that use those and vanilla meshes. This WILL, for example, add variations of Hunterborn&#39;s Daedric Hunting Knives&#33; If you know of mods that use modified meshes but the daedricsword.dds, etc textures, let me know and I can add them to the package&#33;   \r<br />\r<br />Lastly, I intend to add an optional file that will make these into functional variants with the &#34;Elder&#34; prefix. So, Elder Daedric Greatsword, Elder Daedric Hunting Knife, etc. They&#39;ll be smaller, have increased reach, slightly higher level, weigh a bit less, and worth a bit more gold. This is based on fully-implemented functionality in Automatic Variants. The AV Weapons Tutorial I will be releasing will be the first attempt at making it work, using this package&#39;s Daedric Dagger as a basis.\r<br />[b]\r<br />[/b][center][b]Known Issues[/b][/center]\r<br />This AV package is using something that was implemented but apparently never tested. It has issues. None of these issues are dangerous to your game to my knowledge, but they can be really annoying to have to look at. Later versions of Automatic Variants will ALMOST CERTAINLY fix some of them. Others will probably remain issues till Skyrim is nothing more than bitrot.\r<br />\r<br />1: Crafted Daedric Swords, Daggers and Greatswords will ALWAYS look like Vanilla Daedric weapons. ALWAYS. This is because there was never any attempt made to add functionality to avoid this. It is doubtful it will be added. It is NOT an issue with this mod, but an issue with the utility required FOR this mod.\r<br />2: 3D Preview for the inventory will still display vanilla textures. This is still an issue with Automatic Variants and not something I can fix. Your world models and equipped models will work fine still.\r<br />3: For the techies in the house. Automatic Variants in its current form doesn&#39;t properly support meshes of any type for weapons despite explicitly saying that it does. Vanilla meshes are at least handled mostly correctly, but third-party meshes make it choke and die. Vanilla meshes will still cause some annoying but fully harmless errors in your SkyProcDebug/=-- Debug Overview --=.txt log. Keep in mind this is being worked on by Dienes (the curator of Automatic Variants) and will be fixed in future versions, including full variant mesh support&#33;\r<br />\r<br />If you see something like the following, probably repeated 3 times: [quote][250]                                [EXCEPTION]  java.lang.IndexOutOfBoundsException: Index: 255, Size: 35\r<br />    at java.util.ArrayList.rangeCheck(Unknown Source)\r<br />    at java.util.ArrayList.get(Unknown Source)\r<br />    at skyproc.NIF.loadHeader(NIF.java:159)\r<br />    at skyproc.NIF.parseData(NIF.java:66)\r<br />    at skyproc.NIF.&lt;init&gt;(NIF.java:62)\r<br />    at automaticvariants.VariantFactory.loadNif(VariantFactory.java:100)\r<br />    at automaticvariants.VariantProfile.catalogNif(VariantProfile.java:96)\r<br />    at automaticvariants.VariantFactory.loadProfileNifs(VariantFactory.java:84)\r<br />    at automaticvariants.VariantFactory.prepProfiles(VariantFactory.java:72)\r<br />    at automaticvariants.VariantFactory.createVariants(VariantFactory.java:38)\r<br />    at automaticvariants.AVFileVars.setUpFileVariants(AVFileVars.java:55)\r<br />    at automaticvariants.AV.runChangesToPatch(AV.java:520)\r<br />    at skyproc.gui.SUMGUI&#036;ProcessingThread.run(SUMGUI.java:952)\r<br />    at java.lang.Thread.run(Unknown Source)[/quote]That&#39;s because AV handles nif files wrong. It will still work, won&#39;t hurt your game any, etc. as long as below all those IndexOutOfBounds errors you see this: [quote][266]                               [Mod Export]  Exporting Automatic Variants.esp\r<br />[267]                              [Consistency]  Exporting Consistency file.\r<br />[268]                                      [SUM]  Closing program after successfully running patch.\r<br />[269]                                      [SUM]  Closing program normally from thread.\r<br />[270]                                    [DEBUG]  Closing Debug File.  Time was: 329334[/quote][b][center]Last Words[/center][/b]\r<br />Special thanks to Dienes for his hard work in continuing Leviathan&#39;s legacy for Automatic Variants, and Mikeandike for giving me permission to upload this. Very appreciated&#33;\r<br />\r<br />That&#39;s all for now. Endorse both this and mikeandike&#39;s original mod if you enjoy it, and drop one for Automatic Variants while you&#39;re at it&#33; Please see the PERMISSIONS SECTION UP TOP for permissions.",
  "categoryId": "55",
  "version": "0.1",
  "author": "mikeandike",
  "createdUnix": "1446912196",
  "updatedUnix": "1446912196",
  "containsAdultContent": false,
  "uploadedBy": "cassycade",
  "primaryFile": null,
  "files": []
}