{
  "modId": 71278.0,
  "modName": "Dreamboy&#39;s Revenge - Unfinished Interactive Dreaming Mod Resource",
  "summary": "Now when you sleep, you have a chance to receive a random, fully interactive dream scene&#33;\r<br />Or you would have, but I&#39;ve lost any real motivation to work on this mod, and thus releasing all of it as a resource for anyone interested in picking it up.",
  "descriptionHtml": "To those who are aware, a while back I started a mod called Dreamboy&#39;s Revenge. The design was simple. Whenever the player went to sleep, they had a chance of having a fully interactive dream. Nightmares, prophetic visions, and race specific stuff were all planned.\r<br />So... what happened?\r<br />Well, for quite a while now I&#39;ve been going to into actual game design, making my own games under my own company, as well as doing work and research for virtual reality. Not only has that consumed most of my time, but pretty much all of my interest. I like doing my own stuff more. \r<br />\r<br />Luckily, I hadn&#39;t any real projects going at this point, except of course, for Dreamboy&#39;s Revenge.\r<br />Now I can&#39;t have all the fun, so at this point, I&#39;ve decided that I&#39;d like to give it to you as a free resource, for any and all to finish if they want.\r<br />\r<br />\r<br />[u][b]OVERVIEW[/b]\r<br />[/u]This mod contains all the work I&#39;ve done, which includes the basic scripts and cells for the dreaming system and the individual dreams. Source files for the scripts are included, as well as a detailed document outlining how it works, and what the eventual plans were. People who need a more detailed explanation on how stuff works or what dreams specifically were planned can PM me. However, be aware that you&#39;ll need a decent knowledge of scripting if you want to finish this in the first place, and I&#39;m not going to teach you that.\r<br />\r<br />Otherwise, you&#39;re free to gut this mod and use it as you wish.\r<br />\r<br />[u][b]CREDITS[/b][/u]\r<br />Me, for existing.",
  "categoryId": "82",
  "version": "0.1",
  "author": "Trainwiz",
  "createdUnix": "1447142337",
  "updatedUnix": "1447142299",
  "containsAdultContent": false,
  "uploadedBy": "trainwiz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000184452",
      "name": "Main Resource File",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Main Resource File-71278-0-1.zip",
      "uploadedUnix": "1447142299",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/2f99eaaac2a4b7229943eca1adb1850c07b3044162eac71e50e0d1b6fb14939f/analysis/1447142343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20Resource%20File-71278-0-1.zip?fid=1000184452&ttl=1535859821&ri=8192&rs=8192&setec=e670044f839a1c9731d2794daade7962"
    }
  ]
}