{
  "modId": 71287.0,
  "modName": "Eidolon ENB",
  "summary": "Eidolon ENB was inspired by and renders homage to the old 8mm Hammer Studio monster movies, which contained some of the most visually striking colors and cinematic effects. Eidolon ENB carefully blends realistic lighting and effects with just enough saturation and toning to create some of the best graphics enhancements for Skyrim. It also supports ",
  "descriptionHtml": "[center][img]http://staticdelivery.nexusmods.com/mods/110/images/71287-3-1447186841.jpg[/img][/center][color=#e69138][size=3][b]\r<br />[color=#f1c232]Eidolon ENB[/color][/b][/size][/color]\r<br />With Eidolon ENB, the world of Skyrim becomes richly colored and believable, and not shiny or dead (like vanilla Skyrim). Dungeons are dramatically darkened, but not so much that you can’t see in them. The same goes for interiors, night time, and the deep, dark woods. Shadows are ominous, fog is perilous and spooky (especially in the dead hours of the night), and the moons color the clouds, sunrises and sunsets. Days are warm and vibrant unless the rains come, and nights are realistically bright or dark depending on the weather. The clouds are dramatic and the auroras are sights to behold just as in real life—especially when the night is foggy and cloudy.\r<br />\r<br />During the day, Skyrim looks very inviting. But as the sun sets, its darker, more ominous sides awaken. The torches and bonfires drive back the gloom only so far. In the cities and towns, fires and torches make not only a warm and cozy setting, they offer security. But on the roads and in the wilds, the flickering pinpoints of distant lights do not always spell safety or a beacon to set your course to.\r<br />\r<br />Monsters don’t look like they’re made out of plastic with Eidolon ENB. They look like monsters with scars, colors, and all. With Eidolon ENB, it’s like seeing the denizens of Skyrim for the first time. More, there is no shine or strange glows found on your character or NPCs. And, there are no colored fogs or shadow effects that follow your character here and there.\r<br />\r<br />[color=#e69138][size=3][b][color=#f1c232]Eidolon ENB Features[/color][/b][/size][/color]\r<br />Eidolon ENB was not designed to look like a picture (photorealism) or patterned on this or that other game (Crysis, Battlefield, and so on). I went old school on it, and wanted to create something unique that captured the spirit of a world that is mysterious, enticing, and dangerous, yet visually fascinating in its subtly muted colors.\r<br />\r<br />Very few ENBs support night vision, such as Vampire Sight or Kajiit Night Eye. Nor is there support for Night Eye potions or ingredients that give Night Eye when they are eaten. Eidolon does not suffer this problem. Eidolon supports night vision (by race or ingredient), and vision enhancing potions do work properly.\r<br />\r<br />Also, Skyrim&#39;s vanilla night sky is lack-luster to say the least. The stars are too dull, too big, and too sparse. And the galaxy can be barely seen. I did something about this and now the stars are plentiful, and they twinkle&#33; And the galaxy is gorgeous&#33; This extra touch was done by creating a stars and galaxy compilation titled Skyrim Enhanced Night Sky. While it was made specifically for Eidolon ENB and is optional, it is recommended. It is also available as a standalone mod, [url=http://www.nexusmods.com/skyrim/mods/71638/?]which you can get at its Nexus page[/url].\r<br />\r<br />With Eidolon ENB, Skyrim can be beautiful and eerie at the same time—especially when adventuring or at night&#33;\r<br />\r<br />\r<br />[color=#f1c232][size=3][b]Performance And System Recommendations[/b][/size][/color]\r<br />Eidolon ENB does not cause a huge performance hit on your PC. With no mods or retextures, you can consistently range from 35 fps to 55 fps with an average PC and video card, and this depending on whether you are in a city or in the wilds. The more texturing mods you use, the more fps you will lose, and this depending on your GPU and system RAM. While each user is different, I would suggest a PC have the following at a minimum:\r<br />\r<br />[list]\r<br />[color=#cc0000]6-Core CPU running at a minimum of 3.5 GHz. Intel or AMD, it doesn’t matter\r<br />8 GB of system RAM\r<br />3 GB of GPU RAM[/color][/list]\r<br />With this hardware you will be able to use Eidolon ENB without issue, with a decent number of mods and texture packs. You will even be able to run really large HD texture packs and lots of mods (for example, Vivid Landscapes AIO all 4K used with maxed SMIM and Skyrim HD, 180-200+ esm’s/esp’s), but your fps will drop into the 20’s and you will see the occasional momentary freeze. If you want to boost your performance, cut back on the mods and definition of the textures you use, or increase your system RAM and get a bigger video card.\r<br />\r<br />[color=#ff0000]Remember: [/color]Eidolon ENB is not that hardware-intensive. Your limitations will come from the number and kinds of mods you use.\r<br />\r<br />\r<br />[color=#f1c232][size=3][b]Installation and Removal[/b][/size][/color]\r<br />Eidolon ENB installation is straightforward, and detailed instructions are included in the download. The same manual is available separately as an optional download should you decide you want to peruse it prior to installing Eidolon ENB. The installation manual also contains a number of images that are not found in the online gallery.\r<br />\r<br />You will also need ENB binary v0.279, which you can download from [url=http://enbdev.com/download_mod_tesskyrim.htm]here[/url]. Unpack this archive, and copy only the d3d9.dll and enbhost.exe files from the WRAPPER folder, and place them in your root Skyrim folder with the Eidolon ENB files.\r<br />\r<br />As for editing your video card parameters, your Skyrim Launcher, and your .ini files, everything you need to know is in the manual. You will need to make one simple calculation for your video RAM and enter this value in your enblocal.ini file (included in the Eidolon ENB download). Other than that, you do not need to do anything else to the ENB files.\r<br />\r<br />[color=#ff0000]With the inclusion of the removal utility, uninstalling Eidolon ENB is simple. Just read the file prior to use to set the path to the enbseries directory, and start the utility. It does all the work for you.\r<br />[/color]\r<br />\r<br />[color=#f1c232][size=3][b]Compatibility And Mod Recommendations[/b][/size][/color]\r<br />Eidolon ENB should be compatible with any mod that was made correctly. I don’t want to go into an extensive list of the mods I think should be used because if you’re like me, you want YOUR version of Skyrim to reflect YOUR tastes. It’s no fun to make your Skyrim look like everyone else’s Skyrim. Be original. Be different. Make Skyrim yours by using the mods YOU like and not the mods someone else recommends to make YOUR Skyrim look like THEIR Skyrim.\r<br />\r<br />That stated, there are some constants to consider. To really bring out the best in Skyrim and Eidolon ENB, I have listed a selection of mods for your consideration in the included manual. This includes scenery and immersion mods, some of which aren&#39;t well-known. [color=#ff0000]See the manual for details&#33;[/color]\r<br />\r<br />Add your own mods to the the ones I recommend (you can use something else if you want), which serves to enhance what is already there, and not deviate from Skyrim’s original feel. As for me, I make a lot of my own mods, either through compilation or from scratch – sometimes both. So beyond vanilla, your Skyrim won’t look exactly like mine – and that’s a good thing.\r<br />\r<br />\r<br />[color=#f1c232][b][size=3]Selecting a Version of Eidolon ENB[/size][/b][/color]\r<br />There are currently two versions of Eidolon ENB. Selection will depend largely on your rig and play style.\r<br />\r<br />[color=#ff0000]Version A[/color] uses ENB for all of the Antialiasing and effects. Its for rigs that fall just below the minimum recommendations, or for gamers who want to keep a light load on their CPU and GPU.\r<br />[color=#ff0000]\r<br />Version B[/color] uses SMAA to aid ENB in Antialiasing. Its for rigs that meet the minimum requirements or exceed them, and for gamers who don&#39;t mind pushing their CPU and GPU a little.\r<br />\r<br />[color=#f1c232][size=3][b]Stay Informed About Eidolon ENB[/b][/size][/color]\r<br />If you&#39;re a fan of Eidolon ENB then check the Posts section of this page for news about updates and changes&#33;\r<br />\r<br />[color=#f1c232][size=3][b]Plans for Eidolon ENB[/b][/size][/color]\r<br />I plan on further tweaking and refinement in the near future. I also plan to add version C, which will use SweetFX.\r<br />\r<br />[color=#ffd966][size=3]My Other Mods[/size][/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/71638/?]Skyrim Enhanced Night Sky[/url] - A colorful and visually stunning overhaul of Skyrim&#39;s night sky. Twinkling stars and a new galaxy that will melt your face&#33;\r<br />[url=http://www.nexusmods.com/skyrim/mods/71649?]Skyrim Complete Weather Overhaul[/url] - A complete overhaul of Skyrim&#39;s weather. One ESP, no need for patches, compatible with just about everything&#33;\r<br />\r<br />[color=#f1c232][size=3][b]Credits[/b][/size][/color]\r<br />Last but certainly not least, I’d like to thank the following for making Eidolon ENB possible:\r<br />\r<br />[color=#00ffff]Boris Vorontsov[/color], who created ENB.\r<br />[color=#00ffff]Tapioks[/color], whose work with palettes and colors gave me a lot of ideas when I had lost my way.\r<br />[color=#00ffff]Mindflux[/color], whose generosity concerning the bundled patches he made freely available help make Gothic ENB what it is.\r<br />[color=#00ffff]scegielski[/color], whose generosity and help made Night Eye support possible&#33;\r<br />[color=#00ffff]CptJoker[/color], who allowed me to use the AWESOME star field&#33;\r<br />[color=#00ffff]Yuril[/color], for that incredibly galaxy replacer&#33;\r<br />[color=#00ffff]Bethesda[/color], for creating Skyrim&#33;",
  "categoryId": "97",
  "version": "3.7",
  "author": "Visitant",
  "createdUnix": "1447187341",
  "updatedUnix": "1447187341",
  "containsAdultContent": false,
  "uploadedBy": "Visitant",
  "primaryFile": null,
  "files": []
}