{
  "modId": 71301.0,
  "modName": "Uthgerd NPC Remake",
  "summary": "A simple, lore-friendly appearance replacer for Uthgerd the Unbroken.",
  "descriptionHtml": "[size=4]Basic Description\r<br />\r<br />[/size]This is a very simple, lore-friendly, scriptless mod that replaces the appearance for Uthgerd the Unbroken.  And that&#39;s it.  All her stats, clothing, etc. remain exactly the same.  She is set to protected, and can therefore die per usual.  If you do want her to be essential, let me know, and I&#39;&#39;ll upload an alternate version.\r<br />\r<br />This mod came about after a few bad run-ins with other appearance altering mods that for some reason caused by game to have the eternal loading screen glitch (horrors), or just created massive instability (for some reason specifically around Whiterun), so I took matters into my own hands and created my own, because after all the mods you download to make your character gorgeous, it&#39;s kinda awkward being the only pretty one in the room :D.\r<br />\r<br />[size=4]Requirements\r<br />\r<br />[/size]Must have [url=http://www.nexusmods.com/skyrim/mods/10168/?tab=1&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmoddescription%2F%3Fid%3D10168%26preview%3D&pUp=1]ApachiiSkyHairFemale_v_1_5[/url].  Used with permission.\r<br />\r<br />[size=4]Compatibility\r<br />\r<br />[/size]Any mod that changes Uthgerd&#39;s appearance will most likely conflict.  Other than that, it should be compatible with any other type of mod.\r<br />\r<br />After testing in-game, it is confirmed to be 100% compatible with other NPC-altering mods such as Inhabitants of Skyrim and the Eyes of Beauty NPC Replacer.  It is also 100% compatible with follower-altering mods such as EFF.\r<br />\r<br />[size=4]Bug Report\r<br />\r<br />[/size]None so far.  If you encounter any bugs, just let me know, and I&#39;ll look into it. :)\r<br />\r<br />[size=4]Recommended Mods\r<br />\r<br />[/size]By no means are these required, but they&#39;re mods I use that up the whole Skyrim experience as far as NPCs go.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/23755/?]Inhabitants of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/12933/?]Extensible Follower Framework[/url]",
  "categoryId": "66",
  "version": "1",
  "author": "AnarielAnastil",
  "createdUnix": "1447234068",
  "updatedUnix": "1447234068",
  "containsAdultContent": false,
  "uploadedBy": "AnarielAnastil",
  "primaryFile": null,
  "files": []
}