{
  "modId": 71317.0,
  "modName": "Skyrim Smart Launcher",
  "summary": "A tool for launching Skyrim through Mod Organizer, that was made with both convenience and extra features in mind.",
  "descriptionHtml": "[size=5][center][color=#3c78d8][i][b]SKYRIM SMART LAUNCHER[/b][/i][/color][/center][/size]This utility is very simple. It is designed for people who launch their Skyrim through Mod Organizer by Tannin. Its purpose was originally to make sure Steam was running (and get it going if it isn&#39;t) before launching your game through MO. Now it has several other functions, including a relaunch button for all those times skyrim keels over unexpectedly (heres hoping you saved recently), a button to launch your mod organizer so you can proudly count your mods, and a direct link to the nexus so you can search for more mods to test the limits of your souped up potato. There are some other small features that you may or may not use. I am very open to suggestions for features. If I can find a way to implement them and they will be a positive addition to the program I will do my best to make an update (hopefully with several new features).\r<br />\r<br />[size=4]Instructions:\r<br />[/size][size=2][i]Install:[/i]\r<br />[u]Prior to v1.0.2:\r<br />[/u]Extract anywhere and run the setup. After you launch the program it will ask you for directories. Just tell it where your programs are and it will do the rest.\r<br />[/size][b][u]v1.0.2 or Newer:[/u][/b]\r<br />use the download manually link. Then just extract the file, open it, and run the application MO Skyrim Launcher (Sorry about the name... I haven&#39;t actually changed it from what I originally called it when it was just me using it. I should do that... Skyrim Smart Launcher sounds a lot cooler.) \r<br />\r<br />[img]http://staticdelivery.nexusmods.com/mods/110/images/71317-0-1448386856.png[/img]\r<br />\r<br /> It doesn&#39;t matter where you put it on your computer as long as all the files stay together.\r<br />\r<br />[size=2][i][b]Setup:[/b][/i][/size] When you first run the program you are going to need to go into the settings and give it three file paths, Steam, Mod Organizer, and skyrim/SKSE or whatever you use in its place. By the file path I mean the whole thing, not just the folder. The name of the .exe is important. Version 1.1.0 will try to find the files so you have less work to do.\r<br />[img]http://staticdelivery.nexusmods.com/mods/110/images/71317-0-1447347679.png[/img]\r<br />Keep in mind that you can change these at any time. After you save your changes, you can simply launch skyrim. The program will remain running in the background (it only takes up about 18 mb of ram). It will keep an eye on skyrim so that if you crash a relaunch button will become available to get you right back into the game. With version 1.1.0 and newer you can change profiles in the settings as well. If you scroll down, there is a section where I go over all the buttons and what they do.\r<br />\r<br />[size=4]Future Plans:[/size]\r<br />Currently taking suggestions. (like always)\r<br />\r<br />[size=4]Updating:[/size]\r<br />[u][b]Prior to v1.0.2:[/b][/u]\r<br />Just uninstall the old version, then install the new one in its place.\r<br />[u][b][u]v1.0.2 or Newer:[/u][/b][/u]\r<br />You could just delete everything and install the new version.\r<br />OR\r<br />If you wanted to, you could keep all your settings by saving the file: filePaths.txt (if you have v1.1.0 you might also want to keep activeProfile.txt and otherPrograms.txt). Then delete the old version. When you download the new version you can paste the files with your settings in the programs folder and hit replace. Then you will have all your settings saved in the new launcher.\r<br />[size=4]\r<br />Requirement Notes:\r<br />[/size]You need [u]Mod Organizer[/u]... that&#39;s important.\r<br />\r<br />[size=4]Uninstallation:\r<br />[/size][u][b]Prior to v1.0.2:[/b][/u]\r<br />Go to programs and features, find the program in that list, select the program, press delete. Poof&#33; Its Gone...\r<br />[u][u][b]v1.0.2 or Newer:[/b][/u][/u]\r<br />Go to the place you installed it, select all the stuff, press delete. Less professional Poof&#33; Its Gone...\r<br />[size=4]\r<br />Bugs:\r<br />[/size]There will probably be bugs. In fact there will be bugs. I have not met any yet that bite (this program does not touch your skyrim so if your game starts crashing I am not the one to ask). If you encounter any of these menacing creatures please do your best to give me the information I need to replicate the issue so I can fix it (version, what the status textbox says, etc.). I have been using this program since it was just an adorable little baby batch file with no extra features, now its a little more grown up (not full grown yet, think more awkward teenager). With the help of the modding community I hope it will be able to reach its full potential.\r<br />\r<br />[size=4]What the heck is the lite version?\r<br />[/size]Its just a stripped down and far more conventional version of the main program. I questioned how useful it would actually be. The main version which has all the cool features only uses a little bit of ram while your in your game. But whats the harm in uploading it. So thats the lite version. Just a launcher. It will make sure steam is running, launch Skyrim through Mod Organizer, then go away like a good launcher should.\r<br />\r<br />[size=4]All the BUTTONS&#33;&#33;&#33;\r<br />[/size] [img]http://staticdelivery.nexusmods.com/mods/110/images/71317-0-1450845654.png[/img] This is the bug report button. It takes you to the bug report tab on this page so you can give me more things to do.\r<br /> [img]http://staticdelivery.nexusmods.com/mods/110/images/71317-6-1450845653.png[/img] This button is the equivalent of opening up the task manager and stopping TESV.exe (For when skyrim wants to play &#34;see how long the player waits  for the loading screen this time.&#34;)\r<br /> [img]http://staticdelivery.nexusmods.com/mods/110/images/71317-3-1450845653.png[/img] This ones just a cool icon. It also opens the skyrim folder when you click it.\r<br /> [img]http://staticdelivery.nexusmods.com/mods/110/images/71317-2-1450845653.png[/img] This is a direct link to the skyrim nexus. In case you like to mod skyrim or something.\r<br /> [img]http://staticdelivery.nexusmods.com/mods/110/images/71317-1-1450845653.png[/img] This opens mod organizer. FOR ULTIMATE MODDING POWER&#33;\r<br /> [img]http://staticdelivery.nexusmods.com/mods/110/images/71317-5-1450845653.png[/img] These are your settings. Go here to tell SSL where you keep your files. And as of v1.1.0, pick a different profile to use. This button is to serious for  me to try and be funny. Like... its on an ice cube level of seriousness.\r<br /> [img]http://staticdelivery.nexusmods.com/mods/110/images/71317-4-1450845653.png[/img] This is a v1.1.0 or newer feature. It opens another window where you can run other programs you want to use. (its actually part of v1.0.2,  but I  made it invisible cause it broke stuff.)\r<br />\r<br />[size=4]Thanks:\r<br />[/size]Bethesda cause they made my favorite game ever.\r<br />mfcfbro for giving me a solution to fix some really messy code.\r<br />Tannin for helping with profile switching features. And for Mod Organizer, obviously.",
  "categoryId": "39",
  "version": "1.1.0",
  "author": "PMOMods",
  "createdUnix": "1447353845",
  "updatedUnix": "1451321772",
  "containsAdultContent": false,
  "uploadedBy": "PortugueseManOWar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000185042",
      "name": "Skyrim Smart Launcher Lite",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1240",
      "fileName": "Skyrim Smart Launcher Lite-71317-.rar",
      "uploadedUnix": "1447629810",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/25d6395e3fb12f0c67c918200101eb90f64c18b02aba7ec598e9bac6e5fe62f2/analysis/1447629871/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Smart%20Launcher%20Lite-71317-.rar?fid=1000185042&ttl=1535859857&ri=8192&rs=8192&setec=f5faf455f5c3e305b8081ec1570c8219"
    },
    {
      "fileId": "1000185744",
      "name": "Skyrim Smart Launcher",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2858",
      "fileName": "Skyrim Smart Launcher-71317-1-0-1.rar",
      "uploadedUnix": "1448226719",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/bf3fdea9da2bb93e617f81d2146031dc18eb0169a777de83b31da456816913b2/analysis/1448226726/",
      "changelogHtml": " Added keyboard shortcuts (alt+r to run, and alt+x to exit) <br/> \n Bug report button now opens the default browser to the bugs tab on the mod page <br/> \n No longer needs SKSE to find the Skyrim folder. <br/> \n Minor graphical changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Smart%20Launcher-71317-1-0-1.rar?fid=1000185744&ttl=1535859858&ri=8192&rs=8192&setec=6046c90a50d577c64c998aa92ce0758f"
    },
    {
      "fileId": "1000185931",
      "name": "Skyrim Smart Launcher",
      "version": "1.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1256",
      "fileName": "Skyrim Smart Launcher-71317-1-0-2.rar",
      "uploadedUnix": "1448388861",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/a2ea8a5980199bdf4d3df7d6428ad7a6beb5e16c11474b557b54b359d4a74cdc/analysis/1448388904/",
      "changelogHtml": " Made the main program an exe. So it can be run as admin if needed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Smart%20Launcher-71317-1-0-2.rar?fid=1000185931&ttl=1535859858&ri=8192&rs=8192&setec=e8060cd29eccd83f482075673e2919e0"
    },
    {
      "fileId": "1000189328",
      "name": "Skyrim Smart Launcher",
      "version": "1.1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1269",
      "fileName": "Skyrim Smart Launcher-71317-1-1-0.rar",
      "uploadedUnix": "1451321772",
      "modVersion": "1.1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e911b7c084222f6c5c5a0e2764b76a8be3c41fcf34c80a2bd817cdfee221b909/analysis/1451321829/",
      "changelogHtml": " SSL will automatically find as many of the needed file paths as it can when you open the settings window.  <br/> \n Added a tool to launch any exe (does not launch through MO yet) <br/> \n SSL can now switch between MO profiles (in settings). <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Smart%20Launcher-71317-1-1-0.rar?fid=1000189328&ttl=1535859858&ri=8192&rs=8192&setec=041b5fd2f70508d911cafe076752001a"
    }
  ]
}