{
  "modId": 71383.0,
  "modName": "MOO - Mod Organizer Organiser",
  "summary": "-Tidy your Mod Organizer&#39;s downloads into a custom folder while retaining the ability to reinstall them at any time in MO.\r<br />\r<br />-Hide profiles and mods from Mod Organizer easily without messing up your load orders or mod installations.",
  "descriptionHtml": "[b][size=5]MOO - Mod Organizer Organiser\r<br />[/size][/b]\r<br />[size=1][b]If you don&#39;t know what Mod Organizer is, you really should. It will make your life easier.\r<br />MOO is not officially part of Mod Organizer, and any support issues about this utility should not be directed there.[/b][/size]\r<br />\r<br />\r<br />[size=4]WHAT MOO DOES:[/size]\r<br />[size=2][i]Ever tried to reinstall a mod in Mod Organizer and seen &#34;Installation file no longer exists&#34;?[/i][/size]\r<br />\r<br />[color=#fff2cc][size=3]-Moves installed archives [/size][/color][color=#fff2cc][size=2]([i].7z[/i]/[i].zip[/i]/[i].rar[/i] and the [i].meta[/i] files)[/size][/color][color=#fff2cc][size=3] from your Mod Organizer&#39;s downloads to a custom folder but allows you to reinstall it at any time.\r<br />\r<br />-View and manage your newly moved archives in a color coded list.\r<br />\r<br />-Hide profiles and mods from Mod Organizer without messing up your installation data or load orders.\r<br />\r<br />-Batch modifications to mod categories, ignored versions and shown endorsement status.\r<br />[i](Does not actually affect your real Nexus endorsement status. Only affects how Mod Organizer displays it which can sometimes be out of sync with Nexus)[/i][/size][/color]\r<br />\r<br />[size=3][b]WHAT MOO IS NOT:\r<br />[/b][/size]MOO is NOT a replacement of Mod Organizer. It is not intended to be used all the time just simply every now and again when you want to sort your downloads or hide mods and profiles. Mod Organizer is a fantastic utility that I feel would benefit greatly from the features the MOO provides. Until these features are implemented in MO, let MOO be a helpful companion to your already overcrowded Mod Organizer list.\r<br />\r<br />[b][u]MOO will NOT alter or affect your Skyrim installation at all, only move around the mods and downloads within Mod Organizer.\r<br />[/u][/b]\r<br />[size=3][b]\r<br />DOWNLOADS & ARCHIVES:[/b][/size]\r<br />Mod Organizer downloads fill up quick, and while you can remove them from view in MO it still becomes unmanageable. A quick fix is to move installed mods out of your downloads folder into a custom folder and they will no longer show up in Mod Organizer.\r<br />\r<br />Now it&#39;s all good until you try reinstall a mod and then you&#39;re told the installation file no longer exists.\r<br />\r<br />MOO fixes this, like above it moves the already installed files to a custom folder but then automatically changes each installed mod&#39;s &#34;meta.ini&#34; file which actually stores the location of the installation file. This will mean you can still right-click and reinstall that mod in Mod Organizer but now it will not be cluttering up your downloads tab. You can still view them in a sorted list in the Archives tab in MOO.\r<br />\r<br />[b][size=3]HIDING STUFF[/size]:\r<br />[/b]Do you have particular mods or a profile you don&#39;t wish to be shown every time you run Mod Organizer?\r<br />\r<br />Of course not. But if you did MOO could effectively hide that profile and selected mods from Mod Organizer while preserving it&#39;s load order and skyrim/skyrimprefs files. It does this by either setting the folder attribute to hidden which MO will usually not see. For those wanting to go an extra step, MOO can move them from the mods folder and into a hidden folder of your choice.\r<br />\r<br />This feature is not always about naughty things but can also be used for other purposes too. For example I have found it useful when creating a merged patch. I don&#39;t want already merged mods filling up Mod Organizer yet I don&#39;t want to delete them either. So I simply hide them and anytime in the future I can restore them with their original load order back into Mod Organizer.\r<br />\r<br />[b][size=3]HOW TO HIDE MODS[/size]:\r<br />[/b][size=2]First create a new profile and set it up as you would want it. Open Mod Organizer settings and edit your categories. Add a new category, give it a unique number you can remember and then assign all mods you wish to hide to that category.\r<br />\r<br />Now close Mod Organizer and open MOO. \r<br />\r<br />If the hide and unhide buttons are not visible press Ctrl-H.\r<br />\r<br />Click Hide and a new window will open. Check the categories you want and click hide. Now you can close MOO and open up Mod Organizer again. You&#39;ll be on the Default profile and no longer see those hidden mods. To restore the hidden profile again close MO, open MOO, Ctrl-H and click Unhide. Select the profile and click Unhide and it should be back again.\r<br />\r<br />[/size]\r<br />[size=5]INSTALLATION:[/size]\r<br />[color=#fff2cc][size=4]For best results unzip the moo folder into Mod Organizer&#39;s folder so that the executable path will be in &#34;../ModOrganizer/moo/moo.exe&#34;. This is optional however and MOO should still work no matter where you install it.\r<br />\r<br />[/size][/color][b][size=3]NOTES:[/size]\r<br />[/b][color=#fff2cc][size=3]Run &#34;moo.exe&#34; while Mod Organizer is not running, you can reopen MO when you&#39;re finished. [/size]\r<br />[size=3]It is not recommended nor necessary to add MOO as an executable in Mod Organizer, as it does not affect your Skyrim data folder.[/size]\r<br />[size=3]You will most likely need administrator privileges for MOO to function properly.[/size]\r<br />[size=2]Oh and the .NET framework but if you&#39;re running Mod Organizer then you should already have that.[/size][/color]\r<br />[b]\r<br />\r<br />CREDITS[/b]\r<br />A huge thank you to the developers of Mod Organizer for being awesome and they are more than welcome to implement any features that my utility provides. It would be great if MOO would be made redundant by any Mod Organizer updates.",
  "categoryId": "39",
  "version": "1.1",
  "author": "Amadar",
  "createdUnix": "1447619456",
  "updatedUnix": "1506599470",
  "containsAdultContent": false,
  "uploadedBy": "Amadar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000185179",
      "name": "MOO-0.9.0.3",
      "version": "0.9.0.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "74",
      "fileName": "MOO-0.9.0.3-71383-0-9-0-3.7z",
      "uploadedUnix": "1447739285",
      "modVersion": "0.9.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/20c91a175f6be9589987c5ff382a9e18943fcd5583c967b9b188c5b1d7149815/analysis/1447739343/",
      "changelogHtml": " Fix for custom Mod Organizer downloads folder location <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MOO-0.9.0.3-71383-0-9-0-3.7z?fid=1000185179&ttl=1535859939&ri=8192&rs=8192&setec=67902062a811baa738d2a51ffcf9005e"
    },
    {
      "fileId": "1000186442",
      "name": "MOO-0.9.9.1",
      "version": "0.9.9.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "78",
      "fileName": "MOO-71383-0-9-9-1.7z",
      "uploadedUnix": "1448834377",
      "modVersion": "0.9.9.1",
      "virusScanUrl": "https://www.virustotal.com/file/2939a2d481decd692e83bb69e521b551a0ea75883a240017360b6a8f4ef6b568/analysis/1448834284/",
      "changelogHtml": " Fixed reinstalled archived mods sometimes being flagged as external <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MOO-71383-0-9-9-1.7z?fid=1000186442&ttl=1535859939&ri=8192&rs=8192&setec=040fa44befcf9bd32807e7a177d5086f"
    },
    {
      "fileId": "1000187540",
      "name": "MOO-1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "79",
      "fileName": "MOO-71383-1-0.7z",
      "uploadedUnix": "1449854215",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bfac2fe5b721dc4236916ee72307acaca676c30fba499d56e220fd2e2e88288d/analysis/1449854223/",
      "changelogHtml": " Added search filter textbox to mod and archive list. <br/> \n Not much else changed but officially no longer beta. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MOO-71383-1-0.7z?fid=1000187540&ttl=1535859940&ri=8192&rs=8192&setec=1b1b46de3ef9ff44a840e01e179bbce1"
    },
    {
      "fileId": "1000255980",
      "name": "MOO",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79",
      "fileName": "MOO-1.1-71383-1-1.7z",
      "uploadedUnix": "1506599470",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e120e2b9c4b6a688b28f514bad8cce9b709d7c3ae413b186810d80bc3cf55fd0/analysis/1506599762/",
      "changelogHtml": " Should remember whether to show hidden files or not on launch <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MOO-1.1-71383-1-1.7z?fid=1000255980&ttl=1535859940&ri=8192&rs=8192&setec=979f42b07a8cf876d044e98e2930b433"
    }
  ]
}