{
  "modId": 71389.0,
  "modName": "Immersive Kill Moves",
  "summary": "A mod to make kill moves more immersive, essentially edits the kill move function so that they are performed in 1st or 3rd person without the cinematic, they now act as finishers for every npc you fight.",
  "descriptionHtml": "Hi All,\r<br />\r<br />This is essentially my first mod, although i have been messing around in the creation kit for nearly 4 years and i am hoping to release a big DLC in the next 6 months. Immersive Kill Moves is something i kind of stumbled upon really and decided to release it to the community. what it does is to make the kill moves less cinematic and play them for every kill, giving the player a look of skill when finishing off a bad guy and adding another dimension to the hack and slash engine we currently have.\r<br />\r<br />It is rather hard to explain so i am hoping the pictures will help but to sum it up this mod makes kill moves happen more often (virtually every npc you kill, but not always)  and it removes the slow motion cinematic so will just play in whichever view mode you wish, though some may not agree i believe it adds an extra dimension to combat.\r<br />\r<br />For some reason there is a bug with god mode where you keep dying but i am trying to work on that and if close to a building some clipping can occur but other than that i have not experienced any problems (please post a comment if you find any and i&#39;ll do my best to work on it).\r<br />\r<br />Finally im must admit that the dual wielding animations are not working very well (the same animation repeats) and this mod does deactivate normal kill moves so if this is a problem i would advise against using it.\r<br />\r<br />For everyone else enjoy&#33; \r<br />\r<br />\r<br />As videos not working here are the URL&#39;s:\r<br />\r<br />https://www.youtube.com/channel/UCAgXtSk8CubjihZ1esqsdzA\r<br />\r<br />all videos on this channel",
  "categoryId": "51",
  "version": "V1.0",
  "author": "Perry92",
  "createdUnix": "1447631577",
  "updatedUnix": "1447631573",
  "containsAdultContent": false,
  "uploadedBy": "perry92",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000185048",
      "name": "Immersive Kill Moves",
      "version": "V1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "Immersive Kill Moves-71389-V1-0.rar",
      "uploadedUnix": "1447631573",
      "modVersion": "V1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a874ee665b34b81b4a948e9b7733ff0a557ac05d0392e319ddce5cb23cc9b30e/analysis/1447631583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Kill%20Moves-71389-V1-0.rar?fid=1000185048&ttl=1535859950&ri=8192&rs=8192&setec=bd10ee29f29c37e9e4a48cc7819cab14"
    }
  ]
}