{
  "modId": 7146.0,
  "modName": "SGE-Skyrim Global Evolution",
  "summary": "It\\'s not my mod I just see there isn\\'t this mod.So here it is.It\\'s just a collection of bat commands for all you to have fun with Skyrim.",
  "descriptionHtml": "[img]http://img191.imageshack.us/img191/2139/sgelogo.png[/img] \r\n\r\nInfluence the fate of Skyrim by taking part in an adventure unlike any other seen in the Elder Scrolls series. Build, manage, and rule your lands. Wage war on other rules and factions. Forge alliances and trade partners from all across Tamriel. With new skills, equipment, NPCs, creatures, and items, SGE will offer an unparalleled sandbox experience. Whether you create a small forest camp or a metropolis to rival the Imperial city, the choice will be yours. \r\n\r\n\r\nVillage Management \r\n· Crime system with working jails. \r\n· Guards can increase protection at increased cost. \r\n· Treasury management, pay goes in and out. \r\n· NPC schedules and homes. \r\n· You can accept deliveries or trades from other provinces and jarls. But they will only aid you if you aid them. You give them ingots, they give you food. \r\n· Defending the village from dragon, bandit, wolves, etc. \r\n· Squabble system. Having things like clinics, wells, and sewer systems improve public health. \r\n· Align with global factions(Bandits, Imperials, Stormcloaks, Aldmeri, Evil mages, vampires, necromancers, etc) \r\n\r\n\r\nEngineering Skill \r\n· New NPC, Engineer. He will sell you parts essential for engineering. \r\n· Craft traps, contraptions, war engines, and dwemer construct companions and guards. \r\n\r\nConstruction Skill \r\n· New NPCs, furniture makers and architects. \r\n· New skill allows players to construct buildings and craft furniture. \r\n· Tiered system like the other crafting. \r\n· Expand to include things crafted from other systems. \r\n· Construction is done by using a wooden, stone, iron or steel mallet. Wood taking the longest to build and steel the fastest. Building is done by striking/attacking the space in which the construction is taking place. Each strike at the space will advance the building in stages. 1st stage will have the framing, 2nd stage adds the actual material (cloth,wood,stone) and the 3rd stage is it complete. When buildings are in construction they have a construction bar. A wooden mallet may increase it by 1 point each strike and a steel mallet 10 points each strike. A tent may have 100 total points until its complete, but something like a stone house may have 10000 total points which will take someone 10000 strikes with a mallet to build. That is why it is essential to hire construction workers that can do this for you or with you if you want the experience points to level up your construction skill. \r\n\r\n\r\nTrade and Economy \r\n· NPCs with tradeskills that contribute to your village, ie hunters, miners, smiths, farmers, etc. \r\n· Hire adventurers to seek magical items for you. \r\n· Trade with other cities. \r\n· Player driven economy. \r\n· Caravans and expeditions into other provinces. \r\n· Ships for coastal cities. \r\n· Livestock. \r\n· Farms. \r\n· Harvest trees and stone. \r\n\r\n\r\nPolitics and War \r\n· Prestige. Use the Radiant AI to recognize certain deeds of your town. \r\n· Thanes can be added to your retinue. \r\n· Retinue system, court mages, tinkerers, stewards, harems, etc. \r\n· Family with kids. \r\n· Aid from friendly Jarls. \r\n· Civil Wars \r\n· Become the High King. \r\n· Foreign mercenaries. \r\n\r\n\r\nOther Ideas \r\n· Village raids and defense. \r\n· Random events like disease, famine, and bad crops. \r\n· Voice actors for custom NPCs. \r\n\r\nOriginal File:\r\nhttp://planetelderscrolls.gamespy.com/View.php?view=SkyrimMods.Detail&id=14",
  "categoryId": "39",
  "version": "0.5",
  "author": "Bongfu Sgtpepperslhcb Hrusai",
  "createdUnix": "1327691619",
  "updatedUnix": "1327691838",
  "containsAdultContent": false,
  "uploadedBy": "Aquul",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23481",
      "name": "Skyrim Global Evolution",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Skyrim Global Evolution-7146-0-5.rar",
      "uploadedUnix": "1327691838",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/53f41e8c4f316323bc219efe966a44106635e6b0ba991feddb656f515bb37d21/analysis/1406640660/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Global%20Evolution-7146-0-5.rar?fid=23481&ttl=1535765028&ri=8192&rs=8192&setec=90d1fff9aa83cef05e82c8c4149bcb46"
    }
  ]
}