{
  "modId": 71490.0,
  "modName": "Riverwood Fortress",
  "summary": "Welcome to the Riverwood Fortress&#33; A large and very immersive playerhome located near riverwood, was once home to a genius inventor and his gang of rebels. The tides of war have sent them on the run again however, and he has decided to leave their hillside fort in your care. to actually get the house, simply hang out in any city or town the Cou",
  "descriptionHtml": "Welcome to the Riverwood Fortress&#33; A large and very immersive playerhome located near riverwood, was once home to a genius inventor and his gang of rebels. The tides of war have sent them on the run again however, and he has decided to leave their hillside fort in your care. to actually get the house, simply hang out in any city or town the Courier can get to you in, wait for him to deliver the letter and then follow the instructions inside. \r<br />\r<br />*********************Attributes included********************************************\r<br />\r<br />-Both indoor and outdoor alchemy and enchanting workstations\r<br />\r<br />-Vast main Hall with many tables, and two full balconies\r<br />\r<br />-12 beds for followers plus a large bed in the master bedroom\r<br />\r<br />-Full kitchen with cooking spit and plenty of pantry space\r<br />\r<br />-Full treasure room with various chests to organize all your goodies in\r<br />\r<br />-Full armory with specific chests and wardobes for different kinds of weapons and armor plus 16 display cases, 11 mannequins and 20+ weapon racks and plaques around the room not to mention an indoor smithing station(anvil, workbench, sharpening stone, tanning rack as well as ample space to store and organize crafting supplies)\r<br />\r<br />-A large downstair tavern for shits and giggles\r<br />\r<br />-Full library with ample bookshelf space for every book in the game plus more (if you&#39;re like me and carry duplicates) \r<br />\r<br />-Master bedroom downstairs (this is where in the indoor alc. and ench. workstations are located) \r<br />\r<br />-portal room off the corridor in the master bedroom with 9 warp doors, one for each hold in skyrim.\r<br />\r<br />-Outdoor shack (outdoor alc and ench stations)\r<br />\r<br />-Yuan archer barracks ( the place the fortress&#39; security team gets their rest.)\r<br />\r<br />-full outdoor smithing station \r<br />\r<br />--Wife or hubby friendly. (As i said im still new to this so as soon as i figure out how to make it child friendly too i&#39;ll add childrens bedrooms and update)\r<br />\r<br />This is my very first mod and i&#39;ve worked on it religiously the past two months, (the first month was mostly spent bumbling aroung the creation kit trying to figure out which way was up) Shoutout to DarkFox127, without his Tutorials i would&#39;ve been completely lost. if you have any questions comments concerns or criticisms, please feel free to comment below as i hope to better my still very fresh modding skills and bring you guys some kick-ass work in the future. Thanks for Downloading and endorse it if you like it&#33; if not, we can still be friends.",
  "categoryId": "67",
  "version": "",
  "author": "marrojohn8",
  "createdUnix": "1448146787",
  "updatedUnix": "1448146787",
  "containsAdultContent": false,
  "uploadedBy": "marrojohn8",
  "primaryFile": null,
  "files": []
}