{
  "modId": 7154.0,
  "modName": "Dovah Luft Heim - Custom Dragon Masks Complete",
  "summary": "Smithable, Upgradable, and Enchantable - Fully Customizable Dragon Masks. Includes Horned variants of all masks. Unarmored, Light, Heavy, and Material determined versions all standalone. Now available in all 11 food groups.",
  "descriptionHtml": "[IMG]http://i41.tinypic.com/ejyao3.png[/IMG]\r\nForge the mask, upgrade the mask, enchant the mask, any way you like it.\r\nThe most realistic and organized Dragon Mask forging mod available and the only one with each mask available in the \\\"Ultra\\\" mesh. Each texture for the horned masks was created by me using the Bethesda base and I plan to work on each of them over time to make them all look even better, currently they are all first and second passes that were deemed acceptable for release by a group of people I trust.\r\nEvery mask is a standalone item and the base masks are all compatible with texture packs available to modify them save the \\\"Golden\\\" mask, as that is a custom, non-vanilla mask which I added myself as a standard version of the base \\\"Ultra\\\" mask.\r\n**New video and pictures to show off the new features to come soon.**\r\n\r\n[center][youtube]vgPn8bJ5bm8[/youtube][/center]\r\n\r\nBoring-ass news...\r\n***I am working on the mod, very slowly. There\\'s a lot going on for me, I have cancer (I\\'m not ask risk of dying since it was caught pretty much as early as possible and the tumors are benign (nested parenthesis... so I guess it\\'s technically not cancer by definition, but it\\'s still serious business.) but it\\'s expensive and exhausting and causing blackouts and seizures due to where the tumors are located) and am in and out of the hospital for surgery this week, and it looks like I\\'m losing my job... so most days I just don\\'t feel like working on the textures.\r\n\r\nI\\'ve redone two of them and started work on a real/actual daedric mask which looks pretty good in-game so far, however I\\'ve mostly lost motivation to work on the mod. I\\'m not getting any satisfaction out of it, it satisfies what I wanted from it and more, barely anyone uses it despite it being the best of its type available, and I haven\\'t gotten much of anything in terms of feedback which kind of made it hard to figure out how to improve the mod or even the textures in general since I\\'m not a modder or an artist or any of these things; I\\'m a writer, programmer, voice actor and a general audio person in so many more ways than I am a digital artist (past pixel art) and this was the first mod I ever worked on like I\\'ve said; I\\'ve edited countless mods for F3, FNV, and TES4 for compatibility and balance but never built anything from the ground up until now.\r\n\r\nAnyway, I\\'m sure the mod satisfies the needs of everyone using it right now so no one should be upset in me saying that I don\\'t plan to update the mod anytime soon. It\\'s currently the best mod available for standalone dragon masks, anyway, even without all the improvements I was planning.\r\n\r\nEventually the new textures will get done, the new daedric mask along with it, the masks will be resorted into more fitting categories, the .esm will be outdated and removed since the resources will probably just get packed in .bsa\\'s instead of being referenced out of the .esm file like I have it set up now for my own convenience, probably combined .esps implemented, and maybe some special things like alt textures or other mask types like a falmer-based mask. So maybe in a few months all of this will be done and I\\'ll just do the full-jump update at that point.\r\n\r\n[b]I am not abandoning the mod, at most consider this a hiatus[/b], all I know for sure is that I probably won\\'t have any updates ready for the mod in the near future. Thank you for your understanding.***\r\n\r\n\r\n[IMG]http://i40.tinypic.com/152z4sz.png[/IMG]\r\nI want to expand on this mod, and I would also like user input to add to this list.\r\nSo tell me what you want to see done and I\\'ll try to accommodate it. If it\\'s not too complicated I\\'ll do special request versions under optional files and name them after you.\r\n[list]\r\n[*]Updates to the current textures to improve them over time. (3rd week of Feb?)\r\n[*]Different textures available optionally for ALL masks, starting with reworking my horned textures and then moving onto the standard masks. This includes texture packs down the road, things like dragon material masks that look more dragon-like. (Some of it 3rd week of Feb?)\r\n[*]Develop working merged versions of every combination to keep the esp count down. (Whenever I can work out why merging the esps causes such huge issues, the CK will help hopefully. Also then I have to work out the flags in the FOmod script so it installs the exact right .esp for the options picked at the end of selection, but that comes even later.)\r\n[*]Make some changes as to what some masks are called and where they appear in the forge, such as Daedric changing to Studded.\r\n[*]Add new mask types, possibly, such as a true Daedric mask. (Once everything else gets squared away.)\r\n[*]Many many small changes I want to make over time. (Constantly.)\r\n[/list]\r\n\r\n\r\n\r\n[IMG]http://i39.tinypic.com/scewph.png[/IMG]\r\n[list]\r\n[*]v0.5a - Headless problem for Heavy and Light horned masks should be fixed now.\r\n\r\n[*]v0.5 - That\\'s right we\\'re skipping straight to v0.5, because I went through half a dozen unreleased versions, and I have stacks of handwritten notes to prove it. Also, v0.5 sounds like a nice place to put myself since I still need to accomplish merged .esps and better textures before I consider this a v1.0. On to the show:\r\n--- Wooden Equivalency is gone, it\\'s part of the main mod files now, wood is equal to everything else. Everything has been updated to reflect that. While it\\'s incredibly simple to update, it\\'s pointless. If people really want weaker, cheaper wooden masks then it post in the comments and I\\'ll bring it back.\r\n--- Unarmored Masks are fully released, weight was balanced for squishy-arm mages.\r\n--- Light Armor Masks are released.\r\n--- Heavy Armor Masks are released.\r\n--- All versions have a matching JewelCraft Compatibility esp.\r\n--- All versions can be run at the same time with no conflict whatsoever.\r\n--- Oh so many small changes to crafting formids and background mod things, for my own benefit. They don\\'t affect play at all, except maybe causing problems to be less likely.\r\n\r\n[*]v0.2a - A few hotfixes, CK is coming out and I\\'m waiting for that, also I have a break from work (but not the hospital) coming starting the 12th so expect some texture work done then. Also before that I might have light and heavy independent done, I\\'m having problems when all of them are active together where I shouldn\\'t be having them so that\\'s taking longer to bugtest and fix than I thought. JC Compatible Elven Standard mask now shows inventory item. Golden Horned Mask now shows in temper menu. Some meshes were installing to the wrong folder, that\\'s fixed.\r\n\r\n[*] v0.2 - First off, as I mentioned before --[b]Sadly this update will remove any masks you\\'ve crafted with the previous update, however this should never happen again in future updates. Unless there\\'s a really big change. [/b]\r\n--- Restructured to a .esm base for resources used in individual .esps, making drastic, large scale, armature changes later on will be easier now that this is established.\r\n--- JewelCraft compatibility fixed; I noticed Dwemer masks should be referred to as \\\"Dwarven\\\", so I fixed that.\r\n--- Wooden Horned masks are now properly referred to as \\\"Wooden\\\" instead of wood.\r\n--- Made a small change to the female meshes; there was something about them that was bothering me, you probably won\\'t notice.\r\n--- A huge stack of little things that you won\\'t notice since it\\'s all background stuff in the mod and doesn\\'t affect how the mod plays.\r\n--- A much nicer FOmod installer.\r\n--- Lastly but most importantly: [b]A first version of unarmored masks is now available for this release[/b], I figured I\\'d get that done early for two reasons: because it helped me test my ideas about the .esm base and because mages need the love. The FOmod options for it don\\'t install the necessary resources because it still has some work to be done before I put it as a full version, minor revisions, but you can manual install it alone or just delete the regular install .esps and it\\'ll run fine, just don\\'t delete the .esm.\r\n--- You\\'ll need to reorder your plugins list after the install because it puts the optional files above their referenced files for some reason. I\\'m not sure if it\\'s possible for me to do anything about this.\r\n--- Please report any bugs you notice while using the mod in the comments; I try to go through everything before release to make sure that there aren\\'t any and everything works as intended but there\\'s a lot to go through so I might miss things.\r\n\r\n[*]v0.1 - Initial Release, includes revamped/updated version of old mod\\'s files.\r\n[/list]\r\n\r\n\r\n[IMG]http://i43.tinypic.com/9vjcbr.png[/IMG]\r\nNexus Manager:\r\nPick your poison: Just run yourself through the installer, it\\'s not so hard. Make sure the files are proper in the load order, anything with an \\\"- xxx\\\" appended to it goes after the others.\r\n\r\nManual Install:\r\nFor a *manual install* this is what you need to know:\r\nOpen the archive and place DovahLuftHeim.esm in your data folder. After that grab CustomDragonMasks.esp and/or CustomHornedDragonMasks.esp or any of the different versions of them. After [i]that[/i], pick the relevant bonus esp if you want any. CustomDragonMasks and CustomHornedDragonMasks, and different versions, must be placed before any .esp that references them.\r\nOn to the details:\r\nJC stands for JewelCraft, which means that some item names have been changed be compatible with JewelCraft.\r\nAll the meshes and textures required are located in the Resources folder.\r\n[b]CustomDragonMasks.esp and its related .esps, including CustomDragonMasksCloth.esp, require the files:[/b]\r\ntextures\\\\gig\\\\customdragonmasks\\\\dragonpriesthelmdaedric.dds\r\ntextures\\\\gig\\\\customdragonmasks\\\\dragonpriesthelm_n.dds\r\nmeshes\\\\gig\\\\customdragonmasks\\\\dragonhelm_daedric_go.nif\r\nmeshes\\\\gig\\\\customdragonmasks\\\\f\\\\dragonhelm_daedric_0.nif\r\nmeshes\\\\gig\\\\customdragonmasks\\\\f\\\\dragonhelm_daedric_1.nif\r\nmeshes\\\\gig\\\\customdragonmasks\\\\m\\\\dragonhelm_daedric_0.nif\r\nmeshes\\\\gig\\\\customdragonmasks\\\\m\\\\dragonhelm_daedric_1.nif\r\n*******************************************************************\r\n[b]CustomHornedDragonMasks.esp and its related .esps, including CustomHornedDragonMasksCloth.esp, require all of the files *except* the files required by CustomDragonMasks.esp.[/b]\r\n\r\n\r\n[IMG]http://i41.tinypic.com/nzjfnm.png[/IMG]\r\nThis mod should be fully compatible with any mod that replaces mask textures. I haven\\'t tested it since I\\'m not using custom ones myself at this point, but there should be no conflict.\r\n\r\nI\\'m not a modder, I need input. Please leave a comment about things you like and dislike about the mod and realistic changes I could make to improve or rebalance it.\r\n\r\n\r\n\r\n[IMG]http://i42.tinypic.com/13z4cj9.png[/IMG]\r\nDave Humphrey for SkyEdit.\r\nCorwin and the contributors for NifSkope.\r\nTheFigment for his fork of TESsnip; TESVSnip.\r\nThe Nexus and all it\\'s staff for allowing us to find the mods we want so easily.\r\nBethesda for making a great game.\r\nPerraine, without his help explaining how to attach .dds files to .nif files I never would have been able to create the custom horned masks.\r\n",
  "categoryId": "54",
  "version": "v0.5a",
  "author": "Gigify",
  "createdUnix": "1327697792",
  "updatedUnix": "1328438966",
  "containsAdultContent": false,
  "uploadedBy": "Gigify",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23492",
      "name": "Dovah Luft Heim v0_1",
      "version": "v0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3446",
      "fileName": "Dovah Luft Heim v0_1-7154.zip",
      "uploadedUnix": "1327697890",
      "modVersion": "v0.1",
      "virusScanUrl": "https://www.virustotal.com/file/849ab71d913cc859943a423acb98215764f46e2eb4e3b5d3a345e635db890d92/analysis/1406640727/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovah%20Luft%20Heim%20v0_1-7154.zip?fid=23492&ttl=1535765038&ri=8192&rs=8192&setec=d1f0e353a461e34f6c4b070de1608316"
    },
    {
      "fileId": "24626",
      "name": "Dovah Luft Heim v0_2",
      "version": "v0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3737",
      "fileName": "Dovah Luft Heim v0_2-7154.zip",
      "uploadedUnix": "1328019925",
      "modVersion": "v0.2",
      "virusScanUrl": "https://www.virustotal.com/file/675da60864fb914b8d73279be8380d004f3faa11c7a2f3395c480b7f06385c74/analysis/1406646739/",
      "changelogHtml": " Restructured to a .esm base for resources used in individual .esps, making drastic, large scale, armature changes later on will be easier now that this is established. <br/> \n JewelCraft compatibility fixed; I noticed Dwemer masks should be referred to as \\\"Dwarven\\\", so I fixed that. Also, Wooden Horned masks are now properly referred to as \\\"Wooden\\\" instead of wood. <br/> \n Made a small change to the female meshes; there was something about them that was bothering me, you probably won\\'t notice. Also, a huge stack of little things that you won\\'t notice since it\\'s all background stuff in the mod and doesn\\'t affect how the  <br/> \n A much nicer FOmod installer. <br/> \n Lastly but most importantly: [b]A first version of unarmored masks is now available for this release[/b], I figured I\\'d get that done early for two reasons: because it helped me test my ideas about the .esm base and because mages need the love. The FOmod <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovah%20Luft%20Heim%20v0_2-7154.zip?fid=24626&ttl=1535765038&ri=8192&rs=8192&setec=7e645bca2aed8131a14bd33157ae7dd8"
    },
    {
      "fileId": "25763",
      "name": "Dovah Luft Heim v0_2a",
      "version": "v0.2a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3736",
      "fileName": "Dovah Luft Heim v0_2a-7154.zip",
      "uploadedUnix": "1328348355",
      "modVersion": "v0.2a",
      "virusScanUrl": "https://www.virustotal.com/file/65d1b0b7d32397160a576a7055a9e4ade98a17fed7ce9274dc8f59c5feff2e53/analysis/1406652890/",
      "changelogHtml": " Hotfix update. <br/> \n JC Compatible Elven Standard mask now shows inventory item. <br/> \n Golden Horned Mask now shows in temper menu. <br/> \n Some meshes were installing to the wrong folder, that\\'s fixed. This may be the cause of a problem one user was having. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovah%20Luft%20Heim%20v0_2a-7154.zip?fid=25763&ttl=1535765039&ri=8192&rs=8192&setec=79dd0b492f07d9e6947b73fbd54eeb4f"
    },
    {
      "fileId": "26090",
      "name": "Dovah Luft Heim v0_5a",
      "version": "v0.5a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3744",
      "fileName": "Dovah Luft Heim v0_5a-7154-v0-5a.zip",
      "uploadedUnix": "1328438966",
      "modVersion": "v0.5a",
      "virusScanUrl": "https://www.virustotal.com/file/6863b3224551171744aaaef64c9e6bca4d924af81362586dd09681787cedbbff/analysis/1406654778/",
      "changelogHtml": " Headless problem for Heavy and Light horned masks should be fixed now. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovah%20Luft%20Heim%20v0_5a-7154-v0-5a.zip?fid=26090&ttl=1535765039&ri=8192&rs=8192&setec=1b2f0a83b810a2c59b01505f037f3119"
    }
  ]
}