{
  "modId": 71540.0,
  "modName": "Higher Magic Blackreach Lift Switches",
  "summary": "This mod adds 3 switches. These switches control the stairways for the doors to Blackreach, from the other side.",
  "descriptionHtml": "This mod adds 3 Dwemer switches (Each are half size). These switches control the stairways for the doors to Blackreach, from the other side. If you go through the door from Blackreach, they will be found in various places, but they will ALL be on the Right hand side, as you look at the staircase that lowers.\r<br />\r<br />Note : There will be no pics on this. All they will be are half sized dwemer switches on the wall. You don&#39;t need a pic for that. \r<br />\r<br />Note : You STILL need to get to Blackreach, somehow. They do not stop that requirement.\r<br />\r<br />Note : The stairs are set to LOCK after either one is used (Top or bottom). You can&#39;t close them behind you.\r<br />\r<br />Note : You still need the Sphere to trigger the switches. ... Of course, that should be a non-issue, since you need it to get there anyway. Besides, if you are in the home that is there, he has one there as well, should you misplace it somehow, so it shouldn&#39;t be an issue, either way.\r<br />\r<br />Note : Once you are through, there has been NOTHING done. If you need a key to pass a door, you will STILL need to go get that key. It will still be held by someone on the other side, so you may need to go through the other way, just to get it. Still, it gives you the options to go through, from down below.\r<br />\r<br />I have tested it, and it works as I have described.  Enjoy :)",
  "categoryId": "85",
  "version": "1.0",
  "author": "Rex1029 aka Pan Dragondagger",
  "createdUnix": "1448375853",
  "updatedUnix": "1448375841",
  "containsAdultContent": false,
  "uploadedBy": "Rex1029",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000185907",
      "name": "HM Lift Switches",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "HM Lift Switches-71540-1-0.zip",
      "uploadedUnix": "1448375841",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7d20dbc4a47d4be627a9a36ac9c231b1cc86c4202b288811d9f5e71eee9f5063/analysis/1448393283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HM%20Lift%20Switches-71540-1-0.zip?fid=1000185907&ttl=1535860079&ri=8192&rs=8192&setec=ed4f6e2c2707370adaa64d32cb425c14"
    }
  ]
}