{
  "modId": 71546.0,
  "modName": "Stonehills Redone - Evervale Lodge",
  "summary": "A remake of the small Hjaalmarch mining settlement, Stonehills, just north-east of Morthal.\r<br />\r<br />Expanding the area into a walled hamlet with many new buildings such as an inn and general store as well a a new medium sized player home, Evervale Lodge.",
  "descriptionHtml": "IF YOU USE ANOTHER MOD THAT MODIFIES STONEHILLS THEN IT WILL LIKELY CONFLICT WITH THIS MOD AND CAUSE ISSUES.\r<br />\r<br />Stonehills in vanila skyrim is a small mining settlement consisting of a house the mine and a campfire with a bunch of tents. This mod changes it drastically adding 4 new buildings, one of which being a small/medium sized player home.\r<br />\r<br />\r<br />\r<br />[size=5]Stonehills:[/size]\r<br />\r<br />\r<br />[size=4]Perimeter Walls:[/size]\r<br />The whole settlement is protected behind a wall. There are 2 gates, though the back gate is locked by default. There is a lookout tower at the front gate where 1 guard is posted in. The walls are fully and easily accessible by the player and most of it is nav meshed well enough for npcs. 2 more guards are posted on the walls, the last 1 guard is in the town.\r<br />\r<br />[size=4]Guard Barracks:[/size]\r<br />Number of Hjaalmarch guards at the settlement increased from 1-(2)? to 4. This building has beds, a kitchen area and an armory like any barracks would have. They sleep in the building but are posted outside during the day. It is the only building in the settlement which you aren&#39;t allowed in without being told to leave. The guards will respond to crime and if caught the jail you would be sent to is Morthal.\r<br />\r<br />[size=4]Sorli&#39;s House (Default Building):[/size]\r<br />Building containing the base game mine supervisor npcs, nothing really but the exterior changed here.\r<br />\r<br />[size=4]Rockwallow Bunkhouse:[/size]\r<br />Instead of tents outside the miners now sleep inside this building. The quality of furnishings is that of what you&#39;d expect for miners. Also can be used for the player to sleep in, if somehow you couldn&#39;t afford a stay at the inn... or you own house.\r<br />\r<br />[size=4]Helesa&#39;s Goods (Store):[/size]\r<br />Just a general store really... Adds 1 new npc who buys and sells (weps/armor/food/potions/scrolls/spells/misc) and the building is furnished like a normal shop.\r<br />\r<br />[size=4]Ironfrost Inn:[/size]\r<br />A new inn at the far end of the settlement. Adds 1 new npc barkeep who rents out rooms and sells (food/drink). Has quite a nice atmosphere. Many npcs will gather here, after working for a few hours, to relax and hang out.\r<br />\r<br />\r<br />[size=4]Evervale Lodge (Player Home):[/size]\r<br />The new player owned home located at the top outside the mine.\r<br />Outside it has all the mine&#39;s smelting equipment (smelter/anvil/workbench/grindstone/tanning rack), some of this equipment is also in various other places in the settlement.\r<br />Inside, the house has a downstairs and an upstairs/attic. Other than the front door, there are two hatches - one through the back wall and one through the ceiling. These lead outside to the grounds above and bellow.\r<br />The house has everything you would need including alchemy and enchanting stations, many chests, safes and strongboxes, kitchen and dining areas, places for sitting down, 1 main double bed and 1 small bed under the stairs, a bookshelf area and bookcases for excess books and finally shrines to Akatosh, Talos and Mara in the house.\r<br />\r<br />The key for the house is located with the &#39;previous owner&#39; in a wagon which is leaving town and just down the road. Upon arrival, the group of travelling conjurers at the wagon are attacked by bandits and so is quite easy to kill them all. I wanted to make the house purchasable from an npc but I&#39;m not very good with quest/scrips. The picture bellow shows where to go to get the key to get in Evervale Lodge.\r<br />\r<br />Another thing, the lighting in all the buildings changes on the time of day, as you would expect:\r<br />\r<br />\r<br />\r<br />              :) Thanks a bunch for viewing and if so downloading my mod, if you like what you see it would be great if you could endorse it :)\r<br />\r<br />                                            If you have any problems or requests for this mod or any of mine, feel free to ask.",
  "categoryId": "67",
  "version": "1.0",
  "author": "bluehound12",
  "createdUnix": "1448998076",
  "updatedUnix": "1478690248",
  "containsAdultContent": false,
  "uploadedBy": "bluehound12",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000227528",
      "name": "Stonehills Redone",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "253",
      "fileName": "Stonehills Redone-71546-1-1.zip",
      "uploadedUnix": "1478690248",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e523a91f589716fbe96b4c83556bc141c9592141cf00f6522c2b6f12a4c0bbc2/analysis/1478690282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stonehills%20Redone-71546-1-1.zip?fid=1000227528&ttl=1535860086&ri=8192&rs=8192&setec=54b2fe74510198d91be0d2b134129d5b"
    }
  ]
}