{
  "modId": 71567.0,
  "modName": "The Dovahkiin",
  "summary": "",
  "descriptionHtml": "Like you, I always played Skyrim in many different ways, different race, different class, different quests. The problem is when you want to start all over again and think &#34;Oh God, let&#39;s kill Alduin again&#34;. Naturally, I used to search for saves on Nexus, but the thing is, I never really liked to do it, since many saves already have a story behind it, chosen paths (Dawnguard or Vampires, for example), perks/points spent and also, many players, in order to quickly complete the Main Quest, spawn the Elder Scroll (just an example). To avoid these problems, I created a Nord that looks like the Dovahkiin we all know from the trailer, equipped him with the same armor and weapons and completed the Main Quest. Also, I named the character Dovahkiin because if you want to change his name or sex, it would not be weird if a NPC refered to you as &#34;Dovahkiin&#34; in a letter or a note, for example, because that&#39;s who you are, right? The thing is, I never leveled up, so you are free to spend perks and Health/Magicka/Stamina points&#33; \r<br />Note: \r<br />1.You will start at level 1, inside Breezehome. \r<br />2.All collected itens can be found in the chest that&#39;s in the bedroom. \r<br />3.The only extra quest I completed was In My Time Of Need. \r<br />4.I used cheats for screenshots ( tcl and tfc ) and for gold, since I HATE saving money in Skyrim. It won&#39;t break the story or leveling up system. \r<br />5.You can customize your character using &#34;showracemenu&#34; command or download any mod that allows you to do that, while preserving your skills and perks. \r<br />6.I set dificulty to Novice because I never leveled up and also, I would finish the Main Quest quickly.",
  "categoryId": "43",
  "version": "",
  "author": "eldestdragonborn ",
  "createdUnix": "1448462460",
  "updatedUnix": "1448462455",
  "containsAdultContent": false,
  "uploadedBy": "eldestdragonborn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000186031",
      "name": "The Dovahkiin ",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2172",
      "fileName": "The Dovahkiin -71567-.rar",
      "uploadedUnix": "1448462455",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5fa22be66e1d7fb7724f14b9be32395e22417bc22b2a6107d43c8794d5fa940e/analysis/1448462466/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Dovahkiin%20-71567-.rar?fid=1000186031&ttl=1535860110&ri=8192&rs=8192&setec=c6e5b173bfa843e203ce4a7944ac43a8"
    }
  ]
}