{
  "modId": 7170.0,
  "modName": "Dalls_Nord_Hero",
  "summary": "Nord_Hero is custom texture remake mod which changes how Nord_Hero / Ancient Nord (M/F) Armors in Game - look.",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Nord_Hero\r\n\r\nv1.0\r\n\r\n21/01/2012\r\n\r\nNord_Hero is custom texture remake mod which changes how Nord_Hero / Ancient Nord (M/F) Armors in Game - look.\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nNord_Hero Armors are must-have for all Skyrim want-to-be Real Nord Heroes / Tough Nord Barbarians but regardless of your personal preferences they are simply too good to miss. This applies specially to exquisite female set which is - in my opinion - best Skyrim (female) armor model.\r\n\r\n(Ancient) Nord Heroes are de facto \\\"present-day\\\" Draugr so don\\'t be surprised by my mod name and obvious (in-between) similarities. These (Nord_Hero / Ancient Nord) Armors differ from usual Draugr ones - which can not be used (as wearable clothing items) - as they can be used (worn) by PC - your character. \r\n\r\nIf you want matching, weapons check / use my Draugr n Nord Hero Weapons mod and if you want to see (real) Draugr similarly dressed check my Draugr mod as well. \r\n\r\nWord of warning: If you don\\'t already have them (Hero / Ancient Nord Armor bits) - know that you might have to wait for quite while until - you stumble on the right spot / location where they - these Armors in full - can be found! If inpatient and (uninhibited) user of (game) console you might find these (item ID) codes of some use / help:\r\n\r\n00018388     - Ancient Nord armor\r\n00056A9D   - Ancient Nord Boots\r\n00056A9E    - Ancient Nord Helmet\r\n00056B17     - Ancient Nord Gauntlets\r\n\r\n To install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my (check for names my mod) texture files from Data/textures/armors/draugr - and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!\r\n\r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nEnjoy! \r\n\r\nThanks to Bethesda for really great game.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Dall",
  "createdUnix": "1327709578",
  "updatedUnix": "1327709963",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23548",
      "name": "Dalls_Nord_Hero",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13437",
      "fileName": "Dalls_Nord_Hero-7170-1.7z",
      "uploadedUnix": "1327709963",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/12394f45fa09969398192a7bdfcc7b104726836ec00940408587062df25b376b/analysis/1406640927/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Nord_Hero-7170-1.7z?fid=23548&ttl=1535765067&ri=8192&rs=8192&setec=70e3fb67251eb18c601e6852ce42e346"
    }
  ]
}