{
  "modId": 71722.0,
  "modName": "Skyrim Mass Overhaul",
  "summary": "Skyrim Vanilla Overhaul",
  "descriptionHtml": "[quote]This Overhaul completely changes your files. I looked everywhere to find the best\r<br />&lt;br /&gt;mods and configurations that I were online for years, then I tried them all out in \r<br />&lt;br /&gt;different ways for the type of Skyrim I wanted to feel like. There&#39;s several bug \r<br />&lt;br /&gt;fixes and gameplay features were never fixed or added in the update. New animated \r<br />&lt;br /&gt;movements and abilities that make the game feel better but still vanilla. Better \r<br />&lt;br /&gt;visuals on everything without ruining performance. I know it&#39;s a lot to read but \r<br />&lt;br /&gt;its really simple. (Also already cracked and updated).\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;As long as you have Skyrim correctly installed through steam or manually this \r<br />&lt;br /&gt;will work.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;So you&#39;ll need to delete everything from your /Documents/My Games/Skyrim\r<br />&lt;br /&gt;path first. The same folder where tesv.exe and the Data folder are found in. \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Once you&#39;ve done that then copy all of my Skyrim files into the same folder.\r<br />&lt;br /&gt;Afterwards you&#39;ll want to copy my skyrim.ini and skyrimprefs.ini into your\r<br />&lt;br /&gt;/My Documents/My Games/Skyrim folder.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;This Overhaul is extremely compatible with itself. There are no problems or\r<br />&lt;br /&gt;glitches between the mods I&#39;ve placed that I can tell. You can always contact me if \r<br />&lt;br /&gt;there is an issue. \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;It also already has script extenders and other commonly required content when \r<br />&lt;br /&gt;adding mods that alter animation, gameplay, dialogue, sounds, whatever it may be.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Everything is already set up for you, the only thing you might need to do is\r<br />&lt;br /&gt;turn up/down the Texture Quality in the options menu or some of the other Qualities.\r<br />&lt;br /&gt;It&#39;s the menu when you launch SkyrimLauncher.exe (NOT skse_loader.exe).\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Don&#39;t mess the distances in the View Distance tab unless your game is seriously\r<br />&lt;br /&gt;running too slow. \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Part of this Overhaul is that it puts in a lot different features to make the \r<br />&lt;br /&gt;game feel more real. While also adding a lot of cool things to make the game even\r<br />&lt;br /&gt;more enjoyable without making it any easier. Take a look at the different features \r<br />&lt;br /&gt;from the mod list. I haven&#39;t had any trouble with compatibility.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;You&#39;ll have a lot of fun with this, so try it all out before you begin adding \r<br />&lt;br /&gt;anything to it.\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;After that you can just start the game. The skse_loader.exe is the launcher you \r<br />&lt;br /&gt;need for Skyrim to launch now. The SkyrimLauncher.exe won&#39;t do anything other than \r<br />&lt;br /&gt;show you the options menu before the game starts.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;As always, give the game time when installing mods. Once you&#39;ve finally gotten to a\r<br />&lt;br /&gt;spot out of the intro, Wait for a Day or so in GameTime. It just helps everything\r<br />&lt;br /&gt;settle and prevents crashing. \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;P.S. As a lovely gift, Don&#39;t go too crazy when you see Serana... New look, More Dialogue, New Ablities, and now Marriable. \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;I will add a F.A.Q. once I get some questions\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;I don&#39;t know much about computers but I&#39;ll give you the basic specs I see.\r<br />&lt;br /&gt;With my Computer specs this game runs more than perfect so don&#39;t worry if you have \r<br />&lt;br /&gt;less. And be happy if you have more, because you can turn up the quality even more.\r<br />&lt;br /&gt;Motherboard: Asus ASUS M5A97 LE R2.0\r<br />&lt;br /&gt;Processor: AMD FX-4350 Vishera Quad-Core 4.2 GHz\r<br />&lt;br /&gt;Graphics Card: MSI GeForce GT 730 DirectX 12 N730K-1GD5LP/OC Core Clock 1006 MHz\r<br />&lt;br /&gt;               1GB 64-Bit GDDR5\r<br />&lt;br /&gt;Memory: G.SKILL Ripjaws X Series 16GB (2 x 8GB) Speed 1866\r<br />&lt;br /&gt;[/quote]",
  "categoryId": "2",
  "version": "V1.0",
  "author": "Not My Mods Just My Mix",
  "createdUnix": "1448864052",
  "updatedUnix": "1448864052",
  "containsAdultContent": true,
  "uploadedBy": "mjbabyface",
  "primaryFile": null,
  "files": []
}