{
  "modId": 71744.0,
  "modName": "Riverwood Home A Playerhome",
  "summary": "A small house in the town Riverwood.",
  "descriptionHtml": "Riverwood home is a player home located in the small town of Riverwood. The house is directly behind the Sleeping Giant Inn in Riverwood.\r<br />\r<br />   The house has a small yard in front with a forge, armorer bench,grindstone and a tanning rack for your blacksmithing needs. Inside the house is a small alchemy workbench a enchanting table and a area for storing armor and weapons. the alchemy area has quite a few ingredients laying around for potion crafting. there&#39;s a barrel and two satchels in the alchemy area that respawn with alchemy ingredients. The enchanting area is a bit small but has a satchel for storing soul gems and a chest under the enchanting table. the area for storing weapons and armor has four manniquins and 20 weapon racks there is also a small table in the middle with lots of items you may find useful.\r<br />\r<br />   This is my first mod so I&#39;m still learning to use the creation kit and such. So ill be happy to hear your feedback about what you think of the mod.\r<br />If there are any issues ill try to fix them to the best of my abilities.\r<br />\r<br />This mod should be compatible with any other mod unless they modified the same area.\r<br />   \r<br />   ",
  "categoryId": "67",
  "version": "1.0",
  "author": "Aeonfinis",
  "createdUnix": "1474086674",
  "updatedUnix": "1449294891",
  "containsAdultContent": false,
  "uploadedBy": "Aeonfinis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000186897",
      "name": "Riverwood Home A Playerhome",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "135",
      "fileName": "Riverwood Home A Playerhome-71744-.zip",
      "uploadedUnix": "1449294891",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/addaa8ac3ee94faf05273f204d53ccb38ac3418b10d76e8cc4d016c861df6fa0/analysis/1449294907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverwood%20Home%20A%20Playerhome-71744-.zip?fid=1000186897&ttl=1535860300&ri=8192&rs=8192&setec=af1ed62487f5f946fd610048e8f89a3e"
    }
  ]
}