{
  "modId": 7178.0,
  "modName": "Sexy Windhelm v2",
  "summary": "Sexy Windhelm v2 - A retexturing of the ugliest city in Skyrim - Sexy Cities Style, yo!",
  "descriptionHtml": "[center][img]http://jamesfreilly.com/sexy-windhelm.jpg[/img][/center]\r\n\r\n[b] [color=red]Update: 4/18/12 - Released Sexy Windhelm 2.0 [/b][/color]\r\n\r\nIn my continuing quest to Sex-ah-mah-fy Skyrim, I give thee Sexy Windhelm 2.0! This is a retexturing of the ugliest city in all of Skyrim. This is meant to accompany my other Sexy Cities mods, including:\r\n\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12308]Sexy Solitude v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7484]Sexy Winterhold[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7241]Sexy Riften[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7059]Sexy Whiterun[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7583]Sexy Villages and Towns[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12928]Sexy Boats [/url] \r\n\r\nThey\\'re like Pokemon! Collect them all! If you use any of these and like them, an endorsement would be much appreciated :)\r\n\r\nThis time out, I actually chose to keep a place kind of ugly. Yeah, the textures are sharper, cleaner, and not quite as \\\"slimy\\\", but, all in all, Windhelm still looks like a dump, and I wouldn\\'t have it any other way.\r\n\r\nSexy Windhelm 2.0 replaces original version 1.0, which was, essentially, a saturation mod with some new low-res wood and stone textures. This time out, it\\'s 90% retextured (probably more like 93%, but who\\'s counting?), in glorious 1024x1024, with a handful of original textures sharpened, recolored, and/or enhanced with various amounts of brushing, dodging, burning, and, in some cases, cleansing with fire.\r\n\r\nThe thing about Windhelm is, it\\'s not only the ugliest city in the game; it\\'s the worst textured part of the game, period. The ground textures are horribly stretched and distorted, many stone textures are used in several areas regardless of size (resulting in blur), and the weathering job made it look more like a landfill than a kingdom shrouded in snow and ice.\r\n\r\nIt took me ages, but I finally found a ground texture that didn\\'t make me ill, and, after much trial and error, I managed to make it somewhat sharp (at least when compared to the vanilla version). I did the same for the stonework, bricks, ruined bits, etc. Instead of saturating everything, I desaturated and brightened my textures to make it feel/look even colder. (For maximum frostiness, I recommend one of the many cool snow mods, which change the snow meshes to actually look like real puffy snow instead of toxic Troll jizz.)\r\n\r\nThis is probably the only Sexy Cities mods purists might actually like. I really tried to stay true to the dark spirit of Windhelm while still making it look a bit cleaner and sharper. There\\'s still muck and dirt, but I just felt it was so overdone in vanilla that it made going to Windhelm a chore.\r\nSo, what\\'s new? Once again, pretty much everything. Interiors are no longer so bright/saturated as to burn your eyes. Woods are more subdued and dark. Rock/Stone/Brick is sharper and gray as opposed to the blue of the previous version. The doors, gates, and windows have been completely redone, as have the sculptures and etchings (that was hard, man...). I\\'ve also changed up the wall of the dead, sort of basing it on the Vietnam Memorial in Washington D.C.. \r\n\r\nAlso, thanks to a few very generous folks who donated to me, I was able to purchase a copy of nDo2 - a really fantastic normal map generator that\\'s made a tremendous difference in my textures. A few folks have complained about the \\\"flat\\\" textures of some of my previous mods, but, seeing as how I\\'m still basically a total noob and lacked the powerful tools the pros use, I was pretty much stuck making basic maps. NOW, thanks to nDo2, I\\'m really jazzed about the depth and dimension the textures have! I think a lot of folks will be pleased, and I want to extend my sincerest gratitude to the people who helped me purchase it! :)\r\n\r\nNow, onto the \\\"stuff\\\":\r\n\r\n[b] [color=red]READ THIS BEFORE YOU BLAME THE MOD!!![/color] (aka: Issues and Glitchery) [/b]\r\n\r\nIn addition to being the worst textured city in the game, Windhelm is full of visual glitches you may not notice if you don\\'t spend dozens of hours pouring over every detail of it (the way I did!). I\\'ve discovered myriad mesh issues and \\\"holidays\\\", and, [B] BEFORE ANYONE BLAMES THE MOD FOR THESE THINGS [/B] I thought it best to point a few out. \r\n\r\n1) Over near the player home, the house next to it has a clearly visible purple line (it\\'s a normal map) that\\'s a result of the original texture not covering the mesh properly. It\\'s there in Vanilla and in Sexy Windhelm 2.0, and I couldn\\'t fix it as I have no clue how to mesh things.\r\n\r\n2) Climbing the steps from the docks into the city, you may pass a point where you can \\\"see through the wall\\\". Once again, bad mesh job. Not my fault!!\r\n\r\n3) If you stand in the center of the gates just right, you can see through the split into a wonderous void of nothingness...again...yada yada yada. \r\n\r\n4) There are more. Find them all and win a prize. (no).\r\n\r\n[B] TECHNICAL MUMBO JUMBO [/B]\r\n\r\n[b]To Install:[/b] Use NMM or download manually, unzip, and stick the \\\"windhelm\\\" folder in your Skyrim/Data/textures/architecture folder.\r\n\r\n[b]To uninstall:[/b] Simply delete the windhelm folder from Skyrim/Data/textures/architecture.\r\n\r\n[B] OTHER CRAP I HAVE TO SAY[/B]\r\n\r\nAs always, this mod has been made for my own enjoyment. I\\'m sharing it with folks because, hey, I like sharing. If you like it, AWESOME (endorse please!); if not, that\\'s fine. Just please keep the criticism constructive! \r\n\r\nThanks to Bethesda for giving us the ability to mess around with their game. All rights are theirs. \r\n\r\nIf you want to use bits of this mod, just be sure to credit me for them! Otherwise, I\\'m cool.\r\n\r\nDO NOT POST THIS OR ANY SEXY CITIES MOD ON OTHER SITES!!! These mods are Nexus exclusives. \r\n\r\nOnce again please check out:\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12308]Sexy Solitude v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7484]Sexy Winterhold[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7241]Sexy Riften[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7059]Sexy Whiterun[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7583]Sexy Villages and Towns[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12928]Sexy Boats [/url]",
  "categoryId": "53",
  "version": "2.0",
  "author": "horrorview",
  "createdUnix": "1327715190",
  "updatedUnix": "1334761832",
  "containsAdultContent": false,
  "uploadedBy": "horrorview",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23576",
      "name": "Sexy Windhelm v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "41114",
      "fileName": "Sexy Windhelm v1-7178.zip",
      "uploadedUnix": "1327715321",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a968029a300cb4c5e5573c196113025df9446219eff0a5445e966e0815942214/analysis/1406641173/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Windhelm%20v1-7178.zip?fid=23576&ttl=1535765078&ri=8192&rs=8192&setec=874e19e3e815fe0c08e04e9cc074577a"
    },
    {
      "fileId": "54268",
      "name": "Sexy Windhelm v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "143446",
      "fileName": "Sexy Windhelm v2-7178.zip",
      "uploadedUnix": "1334761832",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/25601c9036dd0f28a5845d86ed557fd8f0757b1044285d172eb745dd7f323588/analysis/1406821877/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Windhelm%20v2-7178.zip?fid=54268&ttl=1535765078&ri=8192&rs=8192&setec=38125fc2e6c46758b77a0eeed8c82151"
    }
  ]
}