{
  "modId": 71818.0,
  "modName": "Blood of Olympus-Zeus",
  "summary": "Long ago, tales told of mysterious heroes who held the power of the Olympians. These heroes were called Demigods and were believed to be descendant from the gods themselves. Half mortal and half god, these heroes were the finest warriors in all the land.",
  "descriptionHtml": "[b][font=Courier New][size=4]-Contents--[/size][/font][/b]\r<br />\r<br />1- Overview\r<br />2- Powers and Abilities\r<br />3- Requirements\r<br />4- FAQ\r<br />5- Future Plans\r<br />6- Uninstallation\r<br />7- Credits\r<br />8- Permissions\r<br />[b][size=4]\r<br />[font=Courier New]--Overview--[/font][/size][/b]\r<br />Long ago, tales told of mysterious heroes who held the power of the Olympians. These heroes were called Demigods and were believed to be descendant from the gods themselves. Half mortal and half god, these heroes were the finest warriors in all the land. Bested by no one but the gods themselves. Over time, the Olympians were forgotten and so were their offspring. Now, such stories are considered legends. However, some believe that Demigods still walk the lands, among the common folk.\r<br />[size=4][b]\r<br />[font=Courier New]--Powers and Abilities-- [/font][/b][/size]\r<br />1- Electromagnetics: Shock spells do 10% more damage and cost 15% less to cast\r<br />2- Aerokinesis: Levitate spell\r<br />3- Electromancer&#39;s Knowledge: Learn Destruction 10% faster\r<br />4- Blood of Olympus: 100% resistant to disease\r<br />5- Battle Reflexes: +25 stamina and regenerate stamina 5% faster\r<br />6- Zeus&#39; Heritage: 50% resistant to shock damage\r<br />7- Clear Sight: Night eye and Clairvoyance effect\r<br />8- Cloak of Zeus: Enemies within 15 feet take 15 damage and are flung away\r<br />9- Fury of Zeus: Enemies take 35 shock damge per second (Note: spell is weaker early game to not make it OP)\r<br />10- Spontaneous Combustion: Teleport spell\r<br />11- Tempest Invocation: Strom call effect: lighting does 40 shock damage per hit and effect lasts 3 minutes\r<br />12- Perspicuous Skies: Clear Skies effect\r<br />13- Blessings of the Sky: Flight spell\r<br />14- Unleash Divinity: Ethereal Form effect; all hostile npcs withing 5ft take 5 damage per sec. Lasts for 30 sec. (total of 150 damage.)\r<br />15- Silvered: Weakness to silver; weapons do 25 more damage.\r<br />16- Celestial Bronze Sword: Bound Celestial Bronze Sword; lasts for 3 minutes (180 seconds).\r<br />\r<br />***[size=4]Note[/size]: The levitation animations used in the photos are NOT included in the mod. If you want the same animations download the mod Pretty Combat Animations by dualsun: http://www.nexusmods.com/skyrim/mods/15703/?\r<br />(Remember to pick Version 1.436 which is the one with the MagCast you are looking for)***\r<br />\r<br />***[size=4]Note[/size]: Do not fly over any city gates unless you have Open Cities Skyrim (OCS) installed. I will not address any comments about the mod breaking the game because you flew over the city gate.***\r<br />\r<br />[font=Courier New][size=4]Flight Controls[/size][/font]\r<br />1- Activate the flight power (Blessings of the Skies)\r<br />2- Fly around with normal movement keys\r<br />3- Sprint activation with V key or Lft-Shoulder\r<br />4- Activate the flight power again to stop flying\r<br />[b][size=4]\r<br />[font=Courier New]--Requirements--[/font][/size][/b][font=Courier New] [/font]\r<br />Required: Skyrim 1.9.29.0.8+\r<br />Required: Dawnguard DLC \r<br />Required: SKSE 1.7.3+\r<br />Required: FNIS 6.2+\r<br />Recommended: Caliente&#39;s Vanilla Outfits for CBBE\r<br />Optional: SkyUI\r<br />\r<br />[font=Courier New][size=4]To install the mod[/size][/font]:\r<br />1- Download Blood of Olympus\r<br />2- Put the ESP and BSA into the proper Skyrim Directory\r<br />3- Place the loose FNIS files in the proper Skyrim Directory\r<br />4- Place the loose INI into the proper Skyrim Directory\r<br />5- Run FNIS for Users\r<br />6- Launch Skyrim\r<br />\r<br />[font=Courier New][size=4]To upgrade the mod[/size][/font]:\r<br />1- Change your race to something other than Zeidaen\r<br />2- Upgrade the mod\r<br />3- Launch Skyrim and use the race menu to return to being a Zeidaen\r<br />[b][size=4]\r<br />[font=Courier New]--FAQ--[/font][/size][/b][font=Courier New] [/font]\r<br />Q: Do I need SKSE and FNIS?\r<br />A: Yes.\r<br />\r<br />Q: What happens if I don&#39;t have FNIS?\r<br />A: The flying animations will not play; you will be stuck in &#34;T pose&#34; while you fly.\r<br />\r<br />Q: The animations don&#39;t play help&#33;\r<br />A: 99.997% of the time its on your end, that you didn&#39;t install the mod properly, I tested this mod on different types of computers and it always worked for me.\r<br />\r<br />Q: I can&#39;t fight while flying help&#33;\r<br />A: You can&#39;t fight while in the air, as of this moment the only abilities that do work in the air is Powers and Shouts. They activate much easier if you are standing still in flight.\r<br />\r<br />Q: How do I become a Demigod?\r<br />A: Its a race that you start the game with.\r<br />\r<br />Q: Why is the race named Zeidaen?\r<br />A: Zeidaen is an ancient greek word that translates into &#34;the family of Zeus&#34;.\r<br />\r<br />Q: Can you change the bodies used to X?\r<br />A: No, I spent a lot of time finding the right combination of parts (more so on the male body) and then texturing certain differences to it. This is the body in its finished state and this is what I&#39;m sticking with, that isn&#39;t to say that I won&#39;t improve upon it in updates.\r<br />\r<br />Q: I don&#39;t like the body&#33; How do I change it?&#33;\r<br />A: Create this path in your data folder: meshes/bloodofolympus/actors/character/female(or male). Place the body meshes, hand meshes and feet meshes inside this path and it will overwrite the custom default body that the mod uses. For Texutres: textures/bloodofolympus/actors/character/female(or male).\r<br />\r<br />Q: Why does my hair disappear/clip when I wear a helmet?\r<br />A: This has nothing to do with my mod. The hairstyles were taken from KS Hairdos Renewal, therefore I can&#39;t change the way she set up her hairstyles. Sorry.\r<br />\r<br />Q: X hairstlye clips with X armor set. Can you fix it?\r<br />A: Some hairstyles clip with some armors. It&#39;s impossible to make that all haristyles don&#39;t clip with all armors. If it really bugs you, adjust it yourself.\r<br />\r<br />Q: Can you add X hairstyle?\r<br />A: If enough people ask for it then yes. If not, please add it yourself. It&#39;s not that difficult.\r<br />\r<br />Q: Why do the hairstyles look horrible.\r<br />A: Select the hairstyle you want. Then equip a helmet. When you remove the helmet, the hairstyle will look proper.\r<br />\r<br />Q: Why does my body mod not replace this body?\r<br />A: I have added a custom body to the race. If you wish to change the body, replace my meshes/textures with the ones you want.\r<br />\r<br />Q: Do I need Pretty Combat Animations to use Aerokinesis?\r<br />A: No, the spell will work just fine without it.\r<br />\r<br />Q: Do I need FNIS if I don&#39;t use Pretty Combat Animations?\r<br />A: Yes\r<br />\r<br />Q: Can you add X demigod to the mod?\r<br />A: I&#39;m planning to have a race for each Olympian. Each race will be a seperate mod (for those who don&#39;t want all of them).\r<br />\r<br />Q: When casting the Bound Weapon spell the game crashes&#33;? HELP&#33;\r<br />A: The CTD with Bound Weapons is a regular Skyrim bug. To fix it follow these steps: Put everything from your inventory into a chest and then save the game. Open the console and type Player.ResetInventory. You may have to drop quest items manually with Player.Drop &lt;ID#&gt; but I don&#39;t believe that reset inventory removes quest items which renders this step null and void, still that is why you save just to be sure. Once you&#39;ve reset your inventory the spell should work, so just pick up everything you have dropped and continue on your way.\r<br />\r<br />\r<br />Q: &#34;Insert rude/pointless/dumb hate comment here&#34;\r<br />A:  [img]http://i.imgur.com/5vnbL0j.gif[/img]\r<br />[b][size=4]\r<br />[font=Courier New]--Future Plans--[/font][/size][/b]\r<br />- Level up system\r<br />- Custom Spell Art\r<br />[size=4][b]\r<br />[font=Courier New]--Uninstallation--[/font][/b][/size][font=Courier New] [/font]\r<br />1- Change your race to something other than Zeidaen\r<br />2- Delete the ESP and BSA\r<br />3- Delete the loose FNIS files\r<br />4- Delete the loose INI file\r<br />5- Run FNIS for Users\r<br />[b][size=4]\r<br />[font=Courier New]--Credits--- [/font][/size][/b]\r<br />- Caliente for the mod Caliente&#39;s Beautiful Bodies Edition -CBBE-: http://www.nexusmods.com/skyrim/mods/2666/?\r<br />- Chris57 & FavouredSouls for the mod Better males - Beautiful nudes and faces: http://www.nexusmods.com/skyrim/mods/2488/?\r<br />- hellosanta for the mod SG Female Textures Renewal: http://www.nexusmods.com/skyrim/mods/35267/?\r<br />- Kalilies for the mod KS Hairdos: http://www.nexusmods.com/skyrim/mods/68311/?\r<br />- Urshi for the mod Smooth Male Body - textures for Better Males - SOS Schlongs of Skyrim: http://www.nexusmods.com/skyrim/mods/26145/?\r<br />- Svarog for the mod Dry Skin: http://www.nexusmods.com/skyrim/mods/31782/?\r<br />- LogRaam for the mod The Eyes Of Beauty: http://www.nexusmods.com/skyrim/mods/13722/?\r<br />- PorroOne for the mod Flying Mod Beta: http://www.nexusmods.com/skyrim/mods/15775/?\r<br />- J3X for script used in Aerokinesis \r<br />- 747823 for the mod Weapons of the Third Era: http://www.nexusmods.com/skyrim/mods/3871/?\r<br />- Developers of Gimp which was used to create the texture files \r<br />- Nif-Tools team for making NifSkope \r<br />- FNIS because without them this mod wouldn&#39;t have been possible at all\r<br />- The SKSE Team for SKSE because without that this mod wouldn&#39;t be possible\r<br />- Bethesda for the Game and Creation Kit\r<br />\r<br />***[size=4]Note[/size]: If you feel I used your work and did not give proper credit let me know in the comments or by PM.***\r<br />[b][size=4]\r<br />[font=Courier New]--Permissions-- [/font][/size][/b]\r<br />Blood of Olympus may be translated into another language without my permission as long as you credit me as the original creator. \r<br />Blood of Olympus may NOT under any circumstances be hosted or uploaded by anyone but me, anywhere, ever. (With the explicit exception of translations) \r<br />Reviewers, spot-lighters, and critics are free to use and record footage of the mod so long as proper crediting is made clear. \r<br />Blood of Olympus may be modded in a similar manner to Skyrim under the following conditions: \r<br />- No files that are packaged as part of Blood of Olympus may be redistributed in any way shape or form. This includes the ESP and any files contained within the BSA. The reason for this is because I am not the creator of quite a few assets used in the mod, I have permission from the original creators to use their assets but that doesn&#39;t mean that you do. \r<br />- Your mod must require Blood of Olympus as a master. You are not allowed to repackage BloodofOlympus.esp. Just like with Skyrim, direct people to this page to download Blood of Olympus, then they may download your child-mod separately. \r<br />- You must make it abundantly clear that I am the author of Blood of Olympus and preside over it&#39;s files. \r<br />- You must make it clear that your mod is not supported by me in any way shape or form, and is an independent mod with it&#39;s own responsibilities and faults.\r<br />- Your mod MUST BE FREE.\r<br />\r<br />[size=4]--My Other Mods--[/size]\r<br />Adrian Standalone Male Follower: http://www.nexusmods.com/skyrim/mods/74474/?\r<br />                                                      [b][size=5]  [font=Lucida Sans Unicode]***Mod Cleaned With TesVEdit***[/font][/size][/b]",
  "categoryId": "34",
  "version": "1.50",
  "author": "Enrico Marrocco",
  "createdUnix": "1449524863",
  "updatedUnix": "1467760305",
  "containsAdultContent": false,
  "uploadedBy": "RicoPietro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000203638",
      "name": "Blood of Olympus Hairstyles Unlocked",
      "version": "1.00",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "0",
      "fileName": "Blood of Olympus Hairstyles Unlocked-71818-1-00.zip",
      "uploadedUnix": "1461010584",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/96a8dd5f161232a256f1481f9f05dc3ebe8ae69aae4ec3637901fb4beb18427c/analysis/1461010624/",
      "changelogHtml": " **INITIAL RELEASE** <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20of%20Olympus%20Hairstyles%20Unlocked-71818-1-00.zip?fid=1000203638&ttl=1535860370&ri=8192&rs=8192&setec=a0cc4998cfb57de33b71d68bfb54938f"
    },
    {
      "fileId": "1000203639",
      "name": "Blood of Olympus Eyes Unlocked",
      "version": "1.00",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "0",
      "fileName": "Blood of Olympus Eyes Unlocked-71818-1-00.zip",
      "uploadedUnix": "1461010675",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/3cfc80c2f0203db0c2635813ffe1c75053d3fff91dcba970e060f7598d713fd8/analysis/1461010699/",
      "changelogHtml": " **INITIAL RELEASE** <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20of%20Olympus%20Eyes%20Unlocked-71818-1-00.zip?fid=1000203639&ttl=1535860371&ri=8192&rs=8192&setec=478947ae50a0771d6551685b3c38a45a"
    },
    {
      "fileId": "1000212250",
      "name": "Blood of Olympus v1.50",
      "version": "1.50",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "123875",
      "fileName": "Blood of Olympus v1.50-71818-1-50.zip",
      "uploadedUnix": "1467760305",
      "modVersion": "1.50",
      "virusScanUrl": "https://www.virustotal.com/file/8bcadad9136454dc9f857f9e75e3eb0adfe873d6fa047bb79246e5935c71103f/analysis/1467771380/",
      "changelogHtml": " -Replaced Male Face Textures\r<br />\r<br />-Added Vampire Compatibility\r<br />\r<br />-Added Werewolf Compatibility\r<br />\r<br />-Replaced Female Textures\r<br />\r<br />-Upgraded flight scripts (more animations)\r<br />\r<br />-Fixed bug which allowed player to contract diseases\r<br />\r<br />-Upgraded tattoo textures (both male and female)\r<br />\r<br />-Rebalanced Powers (Tempest Invocation, Cloak of Zeus, Fury of Zeus)\r<br />\r<br />-Added Celestial Bronze Sword <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blood%20of%20Olympus%20v1.50-71818-1-50.zip?fid=1000212250&ttl=1535860372&ri=8192&rs=8192&setec=dc13610932f11dd02ce76ae010f2515a"
    }
  ]
}