{
  "modId": 71826.0,
  "modName": "Madgod&#39;s Holiday",
  "summary": "Ever wanted to play as Sheogorath? Want a mod that upholds some sense of lore and isn&#39;t insanely overpowered? We&#39;re the mod for you&#33; Entrails not included, some assembly required&#33;",
  "descriptionHtml": "UPDATE: Woww. Totally forgot about this mod&#33; Check the article section for a small update that I feel I should mention.\r<br />\r<br />Hello&#33; Welcome to Madgod&#39;s Holiday, my first Nexus mod that I decidedly brought over from my Steam workshop&#33; This mod&#39;s main purpose isn&#39;t necessarily new - play as Sheogorath. But I figured to myself, &#34;If I could make my own, how could I make it better?&#34; Well, I figured that I&#39;d make something a bit more balanced but still powerful, and thus Madgod&#39;s Holiday was born&#33; \r<br />The main perk about this mod is that it isn&#39;t insanely overpowered. You&#39;re not able to be killed easily, but that doesn&#39;t mean you can slay Miraak in one hit though. This mod also adds a few things for a genuine Sheogorath experience, such as some items and spells carried over from Oblivion&#39;s Shivering Isles and such.\r<br />\r<br />[size=4]Full List of Madgod&#39;s Holiday&#39;s features: [/size]\r<br />\r<br />1. Blessing of Mania: Based on the spell you get by entering the gates of Mania in the Shivering Isles, it will make anybody nearby go into a fit of frenzy. Pretty powerful, considering it works on up to level 75 people, but I tried to balance it out as a greater power, restricting it to one use a day. Also, do keep in mind you&#39;ll get assault bounty for using it. \r<br />\r<br />2. Blessing of Dementia: Based on the spell you get by entering the gates of Dementia in the Shivering Isles, it serves the same purpose as Mania&#39;s blessing does, save for panic rather than frenzy. Also, careful of the ensuing bounty. \r<br />\r<br />3. Summon Haskill(?): This is mostly a little joke on my part. It serves no purpose, really, and is merely there to show that piece of lore that people tend to forget - Haskill does NOT leave the Shivering Isles. You couldn&#39;t summon him in Cyrodiil, Skyrim goes no differently. Use it at your own risk, maybe even as a toy. \r<br />\r<br />4. Playing as Sheogorath: He&#39;s listed as a Madgod race, (because I felt savegames labeled Sheogorath, Level XX Sheogorath sounded ridiculous), and should be right above Nords. No need to customize him, he&#39;ll be all suited up to go in the character creator, all you need to do is name him. \r<br />\r<br />5. The Sword of Jyggalag: It&#39;s not much, but I figured it was a cute addition. It&#39;s a slightly more powerful Dwarven Greatsword that ignores damage resistance - practically the same as it was from Oblivion. \r<br />\r<br />6: Soul Tomato: I made a tomato that works in the same way as the Black Star, much like the item from Oblivion&#33; Steal souls and ketchup to the lead&#33;\r<br /> \r<br />7: Calming Pants: Considering there&#39;s no attributes in Skyrim such as Speed, Agility, or more specifically, Personality, the Calming Pants increase your bartering skills by 25%. \r<br />\r<br />8: Charity of Madness: It increases your shock, ice, and fire resistances by 10%&#33; \r<br />\r<br />9: Haskill&#39;s Barrel: Look for it in Helgen Keep, where you enter as a Stormcloak and where you fight Stormcloaks as an Imperial. Be sure to check out the letter, too&#33; \r<br />\r<br />10: Fork of Horripilation: It lacks the damage-magicka thingie, but it&#39;s perfectly functional&#33; Find it inside Haskill&#39;s Barrel. (Script needs to be fixed.)\r<br />\r<br />[size=5]FAQ: [/size]\r<br />\r<br />1. Will this mod be incompatible with my x mod or y plugin? \r<br />A: It shouldn&#39;t be&#33; I still consider myself a newbie at modding, so if there&#39;s any incompatibilities, let me know, but I didn&#39;t do much except add things rather than change them. o-o \r<br />\r<br />2. SUMMON HASKILL DOESN&#39;T WORK NOOB&#33;&#33;&#33;\r<br />A: Please don&#39;t ask this. I stated above that Haskill does not leave the Shivering Isles, and it&#39;s merely a joke. I&#39;m not planning on adding Haskill to the mod, if you want to do so, go hire his voice actor or something and I&#39;ll consider it.\r<br />\r<br />3: It&#39;s not enough&#33; We need more Sheogorath&#33; D: \r<br />A: Calm thyself, loyal denizen of the Shivering Isles&#33; I WILL be adding on to this mod. I have a lot of plans for it and it&#39;s merely just begun. \r<br />\r<br />4: Where&#39;s the Sword of Jyggalag or Sheogorath&#39;s clothes? \r<br />A: The Sword of Jyggalag and Sheogorath&#39;s clothes, as well as some other Shivering Isles items can be found in Helgen Keep, inside the round tall room where you enter as a Stormcloak or pass through as an Imperial. \r<br />\r<br />5: The Sword of Jyggalag is supposed to be white/silver&#33;&#33; \r<br />A: The Sword of Jyggalag turned gold after Jyggalag&#39;s defeat. Nothing to fix here.[url=https://steamcommunity.com/linkfilter/?url=http://images.uesp.net/thumb/c/ce/SI-item-Sword_of_Jyggalag.png/180px-SI-item-Sword_of_Jyggalag.png]http://images.uesp.net/thumb/c/ce/SI-item-Sword_of_Jyggalag.png/180px-SI-item-Sword_of_Jyggalag.png[/url] \r<br />\r<br />[size=5]Plans:[/size]\r<br />[size=1](not necessarily in order of development)\r<br />[/size]\r<br />1. Gatekeeper follower and summonable Mazken and Auriel.\r<br />\r<br />2. Cheese-related things - The most important part&#33;&#33; \r<br />\r<br />3. More balance-tweaking if I can. \r<br />\r<br />4. Possibly, I&#39;m shooting out the door here, but POSSIBLY, a questline based around the fact you&#39;re playing as Sheogorath. Might be a seperate mod, may not happen, but I think it&#39;d be cool if it did. x3\r<br />\r<br />5. Amber and Madness Armor.\r<br />\r<br />6. Player dialogue overhaul, to sound more like Sheogorath. Examples: &#34;What have you got for sale?/Show me your wares, OR I&#39;LL PLUCK OUT YOUR EYES&#33;&#34; &#34;I&#39;d rather die than go to prison&#33;/This is going to be fun&#33;&#34; &#34;Have a drink on me./Tell Sanguine I said hello, ahaha&#33;&#34;\r<br />\r<br />Enjoy the mod&#33; -Shanemagi ",
  "categoryId": "34",
  "version": "2.0",
  "author": "Shanemagi",
  "createdUnix": "1449573784",
  "updatedUnix": "1449573536",
  "containsAdultContent": false,
  "uploadedBy": "Shanemagi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000187214",
      "name": "Madgod&#39;s Holiday",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "56",
      "fileName": "Madgod's Holiday-71826-2-0.zip",
      "uploadedUnix": "1449573536",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/aac8b902b2ebc1081de023a02a39162dfb4cfc5305f38395f54cce4867136a5c/analysis/1449575703/",
      "changelogHtml": " First release&#33; <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Madgod%27s%20Holiday-71826-2-0.zip?fid=1000187214&ttl=1535860383&ri=8192&rs=8192&setec=baeccb11223db419f65bb9d2ac4a30c5"
    }
  ]
}