{
  "modId": 7196.0,
  "modName": "Mhenlos Custom Spells Updated",
  "summary": "13 new spells made by me.",
  "descriptionHtml": "Optional Plugin added.  It is the same as 1.02 but the catapult knocks enemies away insted of catching them on fire.  Knockback still does no damage.  Only load one of the files loading both could cause problems since they both have the same thing except catapult effect.\r\n\r\n-----Version 1.02 Update-----\r\n---Fixed sound for all spells\r\n---Fixed spell levels (read below for details)\r\n---Spells can now only be bought from Faralda at the college of winterhold. (removed from riverwood)\r\n---Changed catapult blast effect---removed knockback effect and added fire explosion.  couldn\\'t get knockback to do any damage.\r\n\r\n-----Spell Levels-----\r\n-----Novice-0\r\n-Tar Spray\r\n-Spider Web\r\n-Green Beam\r\n-----Apprentice-25\r\n-Force Push\r\n-Spriggan Blast\r\n-Trap Darts\r\n-----Adept-50\r\n-Ballistic Shot\r\n-Matron Spriggan Blast\r\n-Holy Orb\r\n-----Expert-75\r\n-Unholy Orb\r\n-Nightingale Blast\r\n-Ghostly Arrows\r\n-----Master-100\r\n-Catapult\r\n\r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------\r\n-----Version 1.01 Update -----\r\n---Fixed smoke effect on ballistic shot.  Changed it to same effect as unholy orb.\r\n---Spider Web name is now fixed can be found with console\r\n---Added all spell tomes to the Riverwood Trader.  So now they can be bought instead of added with console.\r\n\r\n\r\nI know the CK is about to be released and more than what i have done here will be possible.  But with that out of the way I have created 13 new spells for the game.  They only use projectiles and effects from the game itself so nothing new is used.  The spells are all stable and none will crash the game that i know of.  The big one being my own custom version of the arrow spell that has been seen made by someone else (their name i do not remember).  A big thanks to that person for giving me the idea behind it which lead to me making my own spells.  Each spell is balanced atm but some may find them weak.  I will take ideas on how strong i need to make them to improve the mod.  Each Spell is able to be used in either hand.  And all are single hand use only.  Some you can just hold the button down and they will keep firing away.  While others are like normal spells you can hold to build up or just click to use.  I will explain each spell as i list them.  ATM they are only accessible through the console, so use the help \\\"spellname\\\" 0 option to find them.  Then use player.addspell  xxxxxxxx to give them to your character.  When the CK comes out or if i can find a way to add them in game with the Sky Edit program then i will do so and update.   Anyways enjoy my mod and now to the list. :)\r\n\r\n----Link to vid of them being used.  I forgot to use the spider web spell.\r\nhttp://www.youtube.com/watch?v=jqCt6BGhop0&feature=youtu.be\r\n\r\n-----SPELL LIST-----\r\n\r\n---All Spells Listed Under Destruction\r\n---(N) = Normal Click or hold to build\r\n---(H) = Hold button to continuously fire\r\n\r\n\r\n---Force Push (N) - I know star wars name bla bla....  This is by far my fav.  Its basicly Unrelenting Force but in spell form.  So no longer do you need to wait for a shout to cooldown.\r\n---Ghostly Arrows (H) - This is the spell idea i took from another modder.  The only problem i saw with his was that when shot the arrows were able to be picked up which caused game crash.  Since i couldn\\'t find a way to fix this i changed the projectile to the bound arrows.  So no longer do you have to worry about which arrows you have shot from bow and not the spell.\r\n---Ballistic Shot (N) - Pretty much just a huge ballistic arrow that you can shoot from your hand.  Pretty nice effects upon hit.\r\n---Catapult (N) - Shoots a catapult ball from your hand with a nice explosion radius.  Only problem is the shot only does damage when aimed at something.  The explosion will knock enemies away or sometimes into the air.  But only damage they suffer from this is if they take a nice fall to the ground.  Tried to fix by increasing blast radius but no luck.  Maybe i can fix with CK.\r\n---Nightingale Blast (N) - Another of my favs.  This shoots a pretty cool looking effect from your hand.  Kinda looks like a unrelenting force wave but diff colors and such.\r\n---Holy Orb (N) - Shoots a kinda small ball from your hand that when hits makes the enemy turn a very bright white color.\r\n---Unholy Orb (N)- Same as holy but when hits the enemy turns black and has smoke coming from their body.  Same effect as when changing into a werewolf.\r\n---Tar Spray (N) - Pretty much just the spit effect from the chaurus.  Has a cool effect upon hit.  Kinda looks like tar is coming off of the enemy.\r\n---Spider Web (N) - Names says it all.  Shoots the spider web that the spiders in game do.  Has cool looking web effect upon hit.\r\n---Matron Spriggan Blast (H)- Shoots the golden leaf effects that the matron spriggan uses.\r\n---Spriggan Blast (H) - Same as matron just uses the normal green spriggan leaf effect.\r\n---Trap Darts (H) - Doesn\\'t it just annoy the hell out of you when your exploring places and the damn poison darts go off.  Well now you can return the favor with your own shootable trap darts.\r\n---Green Beam (N) - I have no clue what uses this.  Basically just a weird looking green beam that you can shoot at enemies. ",
  "categoryId": "75",
  "version": "1.02",
  "author": "Mhenlo The Insane",
  "createdUnix": "1327736698",
  "updatedUnix": "1328265203",
  "containsAdultContent": false,
  "uploadedBy": "xxcthomasxx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25049",
      "name": "CustomSpells_Mhenlo_V1_02",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "CustomSpells_Mhenlo_V1_02-7196-1-02.zip",
      "uploadedUnix": "1328133110",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/f65030251abe4f42b979ea99fbf3e67852ba19a1e2e625e4238eda47d4e35008/analysis/1406649021/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CustomSpells_Mhenlo_V1_02-7196-1-02.zip?fid=25049&ttl=1535765107&ri=8192&rs=8192&setec=3cab95ef9bd371ab4dd593970f819d74"
    },
    {
      "fileId": "25498",
      "name": "CustomSpells_Mhenlo_V1_02 Optional",
      "version": "1.02",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "CustomSpells_Mhenlo_V1_02 Optional-7196.zip",
      "uploadedUnix": "1328265203",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/f69aeccc8e962f53e1f372cb24f7a7ab21f4dd03b4f5ccd81df97aa136f5d1b5/analysis/1406651607/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CustomSpells_Mhenlo_V1_02%20Optional-7196.zip?fid=25498&ttl=1535765107&ri=8192&rs=8192&setec=9f805ede9b4bc41e4ac6ba63bcf5995d"
    }
  ]
}