{
  "modId": 71983.0,
  "modName": "Niv&#39;s Skyrim Mods Regailed",
  "summary": "My Mods: Fully Remasterd,Fixed And Complied.",
  "descriptionHtml": "so,by popular demand: here is the repaired mod descripition:\r<br />\r<br />\r<br />this mod is essentially  a compilation of all my other mods: my alternative start mod,my ring of invisibility and muffle mod and my retro cheats mod\r<br />\r<br />as well the following additions exclusive to this mod package:\r<br />\r<br />\r<br />1) a new vamp mode- a mod that lets you play as a vampire with all the vampire lord perks(and no vampire lord ability,sadly) and have a perpetual dark night effect so: Be a vampire and get non of the stamina decreases......there is also a werewolf version of this mod that adds the werewolf perks aswell as\r<br />the beast form and abilities\r<br />\r<br />2)an EXCLUSIVE Vanila Companion Mod called &#34;a tale of clan roggstag&#34;: a vanila companion mod that adds two vanila modified orcs: one warrior and one mage:that can&#39;t be given commands but are deadly and efficent bad-guy-swatting machines....they will follow you as soon as you first reach whiterun\r<br />\r<br />3)3 new orc cheat bat files: \r<br />\r<br />bloodoftheorsimer=become a blood kin(Able to enter the orc strongholds)\r<br />orcborn=become a bloood kin and get orcish gear\r<br />truetribesman=become blood kin and get orcish and forsworn armors\r<br />\r<br />4) a modified version of my alternate start mod: with a repaired bat 1 file that&#39;s designed to remove you clothes this time and  new remastered bat 2 and \r<br />bat 2p5 command sets which now add the clothes and iron weapons but also a full set of steel gear and if you use the 2p5 version: a 500 lockpicks and 5000 septims\r<br />\r<br />\r<br />all of this: plus the original readme&#39;s in the readme file,exclusive text to speech interviews with myself,a set of extra files and the best part of all: all my older mods combined under one roof.\r<br />\r<br />\r<br />since you probably won&#39;t read every readme individually,here&#39;s the skinny:\r<br />\r<br />1) simple alternate start mod:\r<br />-------------------------------------\r<br />this mod allows you to skip the helgen starter mission by using the old method of adding a starting cell command to the game&#39;s ini file and using 3 bat files: the first which removes all your items and lets you choose your race,the second and 2p5 varient which either add starter gear and cloth you or add starter gear,cloth you and give you lockpicks and gold to start off with and the third one which initiates the balgruuf meetup quest.\r<br />\r<br />this version already has the bat files set-up: all you gotta do is put the my games folder from the alternate start folder in your my documents folder and overwrite it,then boot up the game.\r<br />\r<br />the game will then ALWAYS skip the main menu and start you off as a basic E3 nord Dragonborn,just outside riverwood: all you will have to do then is:\r<br />\r<br />1) open the console through the tild key (~) and type &#34;bat 1&#34; without quotes,then press ENTER\r<br />\r<br />2) the game will remove all your items and will let you choose your race: make your race and character and then move to part 3\r<br />\r<br />3) open the console once again and type &#34;bat 2&#34; without quotes(if you want to have clothes,basic gear and no money) or &#34;Bat 2p5&#34; without quotes(if you want the gear and clothes,but also 5000 septims and 500 lockpicks) then press ENTER\r<br />\r<br />4) your character will then be dressed up in steel gear,don&#39;t worry: you can remove that later. all you gotta do now is type &#34;Bat 3&#34;  without quotes and then you character will speed up through the quest to the point you met one of the riverwoodians and has to talk to the jarl about the dragon attack.\r<br />\r<br />\r<br />that&#39;s it.......alternate start.\r<br />\r<br />\r<br />2)skyrim retro cheats:\r<br />--------------------------\r<br />the goal of this mod was to remake the old style of cheating of games like vice city,age of empires 2 and age of mythology to the skyrim gameplay scene.\r<br />\r<br />there&#39;s fully detailed manuals with the how&#39;s and whats of the cheats in the extras folder as there are 70+ cheats to choose from,but if you want the newer cheats you have these:\r<br />\r<br />*bat orcborn-orc gear and bloodkin rank\r<br />*bat truetribesman: orc armor,forsworn armor and all dragon masks\r<br />*bat vampmode+your characters vanila race: perminent auriel&#39;s night effect,turn into vampire and get all vampire lord perks(NO VAMPIRE LORD FORM ADDED&#33;)\r<br />*bat winterofhtewolf: get werewolf form,abilities and perks\r<br />*bat bloodoftheorsimer: get blood kin rank-only\r<br />*bat andindarknessbindthem: adds the black bandannas of POWER&#33; as well as other cool stuff\r<br />\r<br />\r<br />3)easy ring of invisiblity and muffle:\r<br />------------------------------------------\r<br />very simple: by typing &#34;bat pcd&#34; without quotes: you get a simple gold ring which is enchanted with invisbility and muffle effects: so long as you don&#39;t punch or open or get to close: you&#39;ll be perfectly concealed with the ring one in STEALTH MODE\r<br />\r<br />4)a tale of clan roggstag-companion mod\r<br />======================\r<br />\r<br />this mods adds 3 companions: 2 modified orc companions and one invinceable and superfast clone of shadowmere\r<br />\r<br />the shadowmere clone is called &#34;shieldrend&#34; and you have to add him through the console by typing &#34;help shieldrend&#34; and then typing &#34;player.placeatme -insert shieldrend&#39;s id in your game- 1&#34; without quotes\r<br />\r<br />then there are 2 orcish companions: thorgash: a giant,superstrong mixbreed of a redguard and orc which is superpowerful and an invicibile superfast melee warrior\r<br />\r<br />and gilgesh: a superpowerful mage character that can shout and cast high powered spell and also,like thorgash: can&#39;t die and runs fast\r<br />\r<br />\r<br />you can&#39;t control them directly as followers but:as soon as you enter whiterun: they will come to you and follow and protect you to the death......\r<br />\r<br />\r<br />\r<br />and that&#39;s pretty much it..........\r<br />\r<br />special thanks to:\r<br /> \r<br />the people who made  skyrim npc editor=for giving me the tool to make my companions and horse\r<br />\r<br />the internet=for sharing the art of bat file command making\r<br />\r<br />bethesda softworks=for the game and vanila assets and commands\r<br />\r<br />and the modding community= for being great&#33;\r<br />\r<br />\r<br />thanks endose and enjoy\r<br />",
  "categoryId": "40",
  "version": "1.5",
  "author": "niv lev ari gatenio",
  "createdUnix": "1450277167",
  "updatedUnix": "1450277153",
  "containsAdultContent": false,
  "uploadedBy": "nivlevari123456789",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000188025",
      "name": "Niv&#39;s Skyrim Mods Regailed",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32173",
      "fileName": "Niv's Skyrim Mods Regailed-71983-1-5.rar",
      "uploadedUnix": "1450277153",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/c15da13c61b0022c98f2ba1485a6a535e65dca6e56c91c8f5f780fc516f0fc78/analysis/1450277171/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Niv%27s%20Skyrim%20Mods%20Regailed-71983-1-5.rar?fid=1000188025&ttl=1535860526&ri=8192&rs=8192&setec=ffe21a63ca8bf001fe9b8420362a1f34"
    }
  ]
}