{
  "modId": 71987.0,
  "modName": "Master&#39;s Flesh",
  "summary": "Master&#39;s Flesh is an Alteration perk that increases your unarmed damage. Like the Mage Armor perks, works when unarmored. However, the Master&#39;s Flesh perk is increased with taking Mage Armor. \r<br />\r<br />Drop your arms and raise your fists.",
  "descriptionHtml": "Master&#39;s Flesh is a perk aimed towards playing without arms or armaments. \r<br />\r<br />Even when a master is captured, stripped of their gear, the master can wreak havoc. This is a plays style I have done with my conjurer, thief, and a light warrior. However, one thing was always missing. Why can&#39;t I just punch and body slam my way out?\r<br />\r<br />\r<br />\r<br />[b][u]The way I have it set up:[/u][/b]\r<br />\r<br />The granted ability increases your unarmed damage with the flesh spells. Oak, Stone, Iron, Ebony, Dragonhide. The conditions set check for if you are wearing armor, which spell you are protected by, and which Mage Armor perk you have. Without the Mage Armor perks, you still get a base bonus to unarmed. However, due to Mage Armor increasing the power of the spells, your unarmed damage will increase as well.\r<br />\r<br />After all, you are mastering the arcane arts of alteration.\r<br />\r<br />\r<br />[u][b]Some Numbers:[/b]\r<br />\r<br />[/u]Spell      Base      MA 1   MA2   MA3\r<br />\r<br />Oak         6          8           10           14\r<br />Stone           9                  11           13          17\r<br />Iron            12                  14           16          20 \r<br />Ebony                  15                  17           19          23\r<br />Dragonhide          20                  22           24          28\r<br />\r<br />\r<br />\r<br />[u][b]Future Plans (Why it is an Alpha) :\r<br />\r<br />[/b][/u]As of now, it works for me, yay&#33; However, I would like to make sure it is balanced enough for others to enjoy it. \r<br />\r<br />I may do a simpler version of the perk, for OP fun time. Meh, lets make Dragonhide a 50 point bonus.  ;)\r<br />\r<br />Also, when I have time I will make a version without changing the perk tree. I know it is a HUGE problem, but that is because it is a\r<br />  nice seamless way to add abilities. (Within a week.)\r<br />\r<br />\r<br />[u][b]Why I made this mod:\r<br />\r<br />[/b][/u]Frustrated on why others haven&#39;t done this before, duh.  :P\r<br />\r<br />Seriously though, I really wanted to do a rouge monk character. After going through the nexus, and forums. My choices were either cast yet another spell, as if we have time for that. Equip..... EQUIP, invisible weapons. Use other magics.... To punch stuff?\r<br />\r<br />There are options out there. However, I just feel if Flesh Spells make us strong enough to deflect damage, why don&#39;t our punches hit harder? Instead of adding, why not enhance.\r<br />\r<br />I just think there is a great base to build off of. Alteration. My ability is based right off of the Fists of Steel, but a bit more complex.\r<br />\r<br />\r<br />\r<br />[b]Looking for Feedback.[/b]",
  "categoryId": "75",
  "version": "Alpha",
  "author": "AggressivePassivist",
  "createdUnix": "1450288487",
  "updatedUnix": "1450288487",
  "containsAdultContent": false,
  "uploadedBy": "aggressivepassivist",
  "primaryFile": null,
  "files": []
}