{
  "modId": 72038.0,
  "modName": "Save Game Ready to Add Mods",
  "summary": "Your Skyrim save file messed up and you don`t have any backup? want to try various mod and start over from beginning but don`t want to spend more times to customize your champion from beginning? or do you simply want the moment before facing alduin without any mod or patch? don`t worry, this save file ready for you to use.",
  "descriptionHtml": "      This is my first upload at nexus, I`m not modder, I`ve played the games countless times with different mods downloaded from nexus from time to time, but each time I want to start over with clean save, I had to start everything from beginning (including setting up my character abilities, level, and basic quest which is kinda frustating and wasting time from directly install mod and start the journey half-way).\r<br />      Therefore I played this game once again from beginning without using any patch or mods, but using a bit of console help to raise the character`s ability :D . the character are male nord with equipment just like the one from Skyrim`s trailer. The game`s 70% Completed, here`s the list of completed quest :\r<br />\r<br />* Companion quest completed\r<br />* Winterhold College Quest Completed\r<br />* Thieves Guild Quest Completed\r<br />* Dark Brotherhood Quest Completed\r<br />* Daedric Quests Completed\r<br />* In My Save File &#34;after Alduin Slain&#34; All Dragon Priest Mask Collected (kohnariik included)\r<br />* Shout are 50% Unlocked\r<br />* Spells Not Completed Yet\r<br />* Stath full (even +100, but through console :D)\r<br />* No longer Werewolf, but has the ring of hircine ability throught non-console trick (but can regain that ability if you install Dragonborn DLC)\r<br />* 100% Vanilla version 1.2.14.0, No Patch, Not even once used mod, and no quest-scripting completed, all progressed through play.\r<br />\r<br />   This was played without Dawnguard or Dragonborn DLC. So you can still play the DLC quest from beginning if you put it. I`ve prepared 2 save files; one before reading the Elder Scroll at the throat of the world, and the other are after slain Alduin.\r<br />\r<br />(P.S) Sorry for your trouble reading such a text for just 2 file, please enjoy. don`t forget endorse :D\r<br />\r<br />\r<br />\r<br />\r<br />#Credits to Me for playing it half-way, to Nexus for provide it for downloads, and to Bethesda for making the coolest game ever :D#",
  "categoryId": "43",
  "version": "1.1.2.0",
  "author": "Siegme",
  "createdUnix": "1450522521",
  "updatedUnix": "1450521975",
  "containsAdultContent": false,
  "uploadedBy": "siegme",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000188295",
      "name": "Moderated Save File",
      "version": "1.1.2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7893",
      "fileName": "Moderated Save File-72038-1-1-2-0.7z",
      "uploadedUnix": "1450521975",
      "modVersion": "1.1.2.0",
      "virusScanUrl": "https://www.virustotal.com/file/557e712f36a8001c8b939a9f5fa0d568e499a73bf97251889f5ce0630e9e2ae5/analysis/1450522025/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Moderated%20Save%20File-72038-1-1-2-0.7z?fid=1000188295&ttl=1535860579&ri=8192&rs=8192&setec=fc624e16d15164ee4090069168204c17"
    }
  ]
}