{
  "modId": 72036.0,
  "modName": "Renewed Skyrim Child Overhaul WIP",
  "summary": "children overhaul they look like there parents and have there race.",
  "descriptionHtml": "[color=#ff0000]\r<br />[size=4]Attention earlier i upload the wrong rar just fixed that so the right file is in they should not need unofficial skyrim patch now for sure and i put both in one rar. sorry for the goff up. all i can say is this is my first time thanks for putting up with me.[/size][/color]\r<br />\r<br />Ok I like this overhaul but it was abandoned and not compatible with skyrim any more due to its need for Unofficial skyrim patch. so all i did to this mod was change that enjoy its return if anyone knows how to improve this give it ago. if anyone has advice on how i could improve it send me a mail that be greats as i&#39;m still working on my first mod this was just a edit so i could use it with out crashing my game.\r<br />\r<br />all credit to Hallgarth for original mod\r<br />\r<br />sorry for miss spelling I&#39;m not to good even though this is my native language. spell check is my friend ;)\r<br />\r<br />Renewed Skyrim Child Overhaul: Update v1 12-19-2015 made compatibility with skyrim again - unofficial skyrim patch + unofficial skyrim legendary \r<br />patch. that&#39;s all i did.\r<br />\r<br />[color=#ffff00][size=4]Credits for helping me out with this mod[/size][/color]\r<br />\r<br />[url=http://forums.nexusmods.com/index.php?/user/23519989-kageredux/]KageRedux[/url]\r<br />\r<br />[size=4][color=#0000ff][size=5]compatiblity[/size][/color]\r<br />[size=3]incompatible with TK Children.\r<br />[/size][/size][color=#9900ff]\r<br />[/color][color=#ffff00][size=4][color=#9900ff]All that follows is from original mod page.[/color]\r<br />[/size][/color]\r<br />Update Regarding Mod\r<br />\r<br />\r<br />Just a warning. Make sure you have a save file well away from any place children are, or else there might be some issues as I&#39;ve altered some of their clothing. Once loaded with the mod, everything should be fine.\r<br />\r<br />An overhaul of the children, adding morphs, new clothes and children of the Mer kind, to create better immersion.\r<br />\r<br />Now this mod began a while ago. The goal was simple. Can I make an elven child mod, that retains the vanilla aesthetic. It would be simple, just alter the default child .nif and give it pointed ears.\r<br />\r<br />Doing this caused issues, of course, but since I had worked with .tri&#39;s before I decided to see if I could create morphs to create the elven children. Turns out I could. With six eye morphs, I patted myself on the back.\r<br />\r<br />But I wasn&#39;t satisfied with that. I expanded it to the vanilla children, creating a set of morphs (that took forever, and still have a few issues) that covered everything that the adult morphs had.\r<br />\r<br />\r<br />There are a few children mods out there. This is a video showcases some of them.\r<br />\r<br />\r<br />Cells affected by this mod\r<br />\r<br />Skyrim:\r<br />-Mor Khazghur longhouse, mine and exterior\r<br />-Dushnikh Yal Longhouse and exterior.\r<br />-New Gnisis Corner Club \r<br />-Atheron Household \r<br />-Radient Raiment\r<br /> \r<br />Dragonborn (Raven Rock)\r<br />-Ienth Farm\r<br />-Crescius Residence\r<br />-Retching Netch.\r<br />\r<br />\r<br />This mod is not compatible with any mod that affects children.\r<br />\r<br />I hope I remembered all the files. If I forgot any, then there might be issues.\r<br />\r<br />FAQ\r<br />\r<br />1 Q-Can you make a patch/make it so I can use it with x child mod.\r<br />A-This is unlikely. Mainly because they use the vanilla children&#39;s assets. They are tied together, and to separate them would require a lot of additional work.\r<br />\r<br />Anticipated Questions\r<br />\r<br />1 Q-Why don&#39;t the Orc kids speak?\r<br />A-Because a human child voice coming out of an Orc child sounds stupid.\r<br />\r<br />2 Q-Some of them are ugly.\r<br />A-That&#39;s not very nice. Besides, I tried with greater or lesser success (you decide) to try and make them look like their parents.\r<br />\r<br />3 Q-I think there should be more Orc children in the strongholds, and more than just in two.\r<br />A-I know of one that&#39;s under attack, so I wanted to avoid that one, and another has a weak old chief, who&#39;s youngest daughter (It&#39;s implied) is an adult. Also, I didn&#39;t want to risk breaking things with adding too many.\r<br />\r<br />4 Q-Their textures are bad.\r<br />A-Sorry. I&#39;m not really a texture guy. I did the best I could.\r<br />\r<br />5 Q-The Dunmer eyes in the images are too grey/gray&#33;\r<br />A- I use an eye texture mod I should have uninstalled before taking those screenshots. They use whatever eye/brow/hair/teeth textures the adults use.\r<br />\r<br />6 Q-Not as good as X child mod&#33;&#33;&#33;11\r<br />A-Use whatever mod you feel is right for you. ",
  "categoryId": "79",
  "version": "v1new2",
  "author": "FaulFreya",
  "createdUnix": "1450512865",
  "updatedUnix": "1450535483",
  "containsAdultContent": false,
  "uploadedBy": "Faulfreya",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000188326",
      "name": "Renewed Skyrim Child Overhaul",
      "version": "v1new2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23330",
      "fileName": "Renewed Skyrim Child Overhaul-72036-v1new2.rar",
      "uploadedUnix": "1450535483",
      "modVersion": "v1new2",
      "virusScanUrl": "https://www.virustotal.com/file/d255fa41fe7b513583196d3f120025e8f9bcc682ac92728b1c1626edd0633b8a/analysis/1450535529/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Renewed%20Skyrim%20Child%20Overhaul-72036-v1new2.rar?fid=1000188326&ttl=1535860577&ri=8192&rs=8192&setec=6212b6ac2ba628d5cc6f064454c66609"
    }
  ]
}