{
  "modId": 72040.0,
  "modName": "Heart of the Beast",
  "summary": "It is just a small story inspired by what I experienced, witnessed, learned, and, hope.\r<br />",
  "descriptionHtml": "&#34;They hunted them into extinction, until the last Beast\r<br />Escaping deep into the forest, yet the hunters pursuited relentlessly\r<br />It was frightened, the Beast was calling out for its lost kinsmen\r<br />The hunters followed\r<br />\r<br />The Beast&#39;s heart beated faster, it was bleeding\r<br />Its blood touched the ground, withered flowers bloomed\r<br />And the dying beetles flapped its wings again\r<br />The hunters followed the trail of blood\r<br />\r<br />There, under the great blue moss tree, the Beast rested\r<br />The hunters were getting closer\r<br />And the tree wrapped the Beast in its roots\r<br />So the hunters burned the tree\r<br />\r<br />With its last strength, the Beast pulled out its heart\r<br />The fire died down, the tree was young again\r<br />And the hunters left\r<br />The silent white eagle came\r<br />\r<br />With its gentle touch, the bird lifted the body of the Beast\r<br />It flew over the hunter&#39;s village, and the headman was weeping\r<br />Weeping over his dying daughter, for he sold the last slice of the hearts, in his greed\r<br />The eagle flew on\r<br />\r<br />The white mountain greeted them, under the rising dawn\r<br />And the eagle settled the Beast down, with that gaping hole in its chest\r<br />Those familiar shadows gathered silently around its body, they chanted\r<br />\r<br />The Beast lifted its head, and smiled&#34;\r<br />\r<br />I know it seems to have some religious theme, or some elements similar to &#34;Princess Mononoke&#34;.\r<br />\r<br />Myself is of mixed races, and I have my own believe. Even without knowledge of what stated abover, it would still have the same themes and ending. \r<br />All cultures share many similar tales, wisdoms, its own version of Romeo and Juliet.\r<br />\r<br />I downloaded GBs of files, over 1000 mods, 99.9% are of Skyrim. I have inspired by so many great people, like our Good brother &#34;Gopher&#34;, and Irresistible &#34;Vilja&#34;, so many brothers and sisters.\r<br />\r<br />This is my Nexus.\r<br />\r<br />\r<br />Sorry if I sound a little sentimental, because I am.",
  "categoryId": "35",
  "version": "",
  "author": "austiger",
  "createdUnix": "1450528812",
  "updatedUnix": "1450528812",
  "containsAdultContent": false,
  "uploadedBy": "tastiger",
  "primaryFile": null,
  "files": []
}