{
  "modId": 72072.0,
  "modName": "Valynie Milvyn&#39;s Spellbook",
  "summary": "Valynie Milvyn was the most powerful magister durring the 3rd era, this mod contains some of her spells&#33;",
  "descriptionHtml": "Welcome to my second mod. :D This one is nicer. It took me awhile to make these spells mostly Spell of the Berserker and POWERWALK&#33; (Thanks Skyrim wiki for the name) They can be found in the Sleeping Giant Inn at Riverwood, Or at any spell merchant. Also, there all found in under restoration, to get them to work, I need to have them in a spell tab. So I used one I was able to make not work, ie healing health for 1k points for 0 seconds, it will not work, allowing me to add potion effects. (it goes by the highest effect in it) \r<br />\r<br />POWERWALK&#33; (thanks wiki for the name) \r<br />This is a spell that gives you fortify carry weight of 500 for 10 seconds, giving you enough time to fast travel. :D It costs 120 magika to cast.\r<br /> \r<br />Spell of the Berserker \r<br />It is a spell that Summons a bound battle axe and fortified 2-handed skill for 50 points for 50 seconds. It costs 100 magika to cast. Also, once you have mystic battleaxe, you get it for 100 seconds. :P \r<br />\r<br />Robin Hood&#39;s Knowledge \r<br />This summons a Bound Bow, fortify&#39;s your archery for 50 points and gives you invisibility for 50 seconds&#33; \r<br />\r<br />Vampire&#39;s Bane \r<br />No it doesn&#39;t do extra damage to vampires, again don&#39;t have DLCS, but if you send me the code needed to I will. Anyhow, this is special it can be found in the Kilkreath Ruins, now, I never did the quest that takes you there, but the spell has to do with something there&#33; It shoots beams of light out&#33; Doing damage to health and magicka&#33; Again it&#39;s found in Kilkreath Ruins by a pedestal with the beacon&#33; \r<br />\r<br />J&#39;zargo&#39;s Flame Cloak IN SPELL TOME FORM&#33; \r<br />No one else did it so I did, can be found in shops \r<br />\r<br />I will add more spells. If you got a potion effect and and spell name, add me and will talk about it. :D",
  "categoryId": "93",
  "version": "6.6.6",
  "author": "EVIL DR VON TACOS",
  "createdUnix": "1450682154",
  "updatedUnix": "1450682141",
  "containsAdultContent": false,
  "uploadedBy": "cman2410",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000188583",
      "name": "The mod betoch",
      "version": "6.6.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "The mod betoch-72072-6-6-6.rar",
      "uploadedUnix": "1450682141",
      "modVersion": "6.6.6",
      "virusScanUrl": "https://www.virustotal.com/file/d4b7f13c426eec960797b3da03d9d13f0de1747b3bb7ad0ef31df93ff16d1a9b/analysis/1450682163/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20mod%20betoch-72072-6-6-6.rar?fid=1000188583&ttl=1535860611&ri=8192&rs=8192&setec=8baf256a8fb8a1b299a66a563db1f23b"
    }
  ]
}