{
  "modId": 7214.0,
  "modName": "Bingles Buff Male Dragon Armors",
  "summary": "Removes the sleeves\\\\Shoulderpads from the Dragonbone\\\\Dragonscale Armors.",
  "descriptionHtml": "Bingles Buff Male Dragon Armors:\r\n\r\nUPDATE: 1.1\r\nFixed the clipping issues with the Arm Bands on the DragonBone Armor.\r\nRemoved the Sleeves from Dragonscale in 1st Person Mode.\r\n\r\nThis is a mesh replacer for the dragon armors in Skyrim. It comes in two versions: Pants and NoPants. You can only use one at a time. This is a proper mesh edit version of my Buff Armor mod, which can be found here: http://skyrim.nexusmods.com/downloads/file.php?id=6795\r\n\r\nNote:\r\nThis is an improvement over my original mod, so always override with this file AFTER installing the original. Or wait a week and I\\'ll finish making a proper Version 2 of all the armors.\r\n\r\nThe Textures used in the screenshots are:\r\nDragonscale and Dragonplate Recolors by Shinokage\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2103\r\n\r\nHowdy Y\\'all!\r\n\r\nSo I made this buff nord character. The vanilla armors make him look pudgy... so I let out the sleeves.\r\n\r\nThis is a replacer mod for the Dragonbone/Dragonscale armors. Simply combine the data folder in the RAR archive with the Data Folder in your skyrim directory. To uninstall, locate all of the meshes and delete them.\r\n\r\nQ&A:\r\n\r\nQ: Will this mod work with my custom armor textures?\r\nA: Yes!\r\n\r\nQ: Will this mod work with custom male bodies?\r\nA: Depends. If the custom body changes the alignment of the limbs, then no. but if its just a texture change or an added penis to the default body mesh, then there should be no issue.\r\n\r\nQ: Will there be a stand alone version?\r\nA: Yes. but I\\'m waiting for the CK.\r\n\r\nQ: Does this work with the body weight slider?\r\nA: Yes. However, it was designed for the largest muscle setting. So if your character is a scrawny little thing, he\\'ll look even scrawnier with his arms exposed.\r\n\r\nQ: Will there be a female version?\r\nA: Probably not. There\\'s plenty of armored swimwear already on the nexus. This mod attempts to give men a revealing option to lessen the absurdity of heavy dragonplate on a man becoming a scaly bikini on a woman.\r\n\r\nQ: Don\\'t you think revealing armor is a bit impractical?\r\nA: Not at all. Suits of full armor were incredibly rare in history, and once the technology was availible to build full plate more efficiently, it was quickly rendered useless by gunpowder. Besides, less bulky plates means better mobility.\r\n\r\nQ: When I look up my character\\'s skirt, there\\'s nothing there! Why?\r\nA: Because kids play these games.\r\n\r\nIf you find any tears or artifacts (Pixels floating near the body or holes in the mesh) please leave a comment on the nexus describing EXACTLY where it is located. Some of the meshes will have minor glitches that are beyond my ability to fix. \r\n\r\nCredits:\r\n\r\nBethesda, for creating the best game I\\'ve played in a long time and filling it with great armors to mod.\r\nNifskope, for making all this possible.\r\nFOMM and Blender: These tools are essential for modding, and free, so kudos to their developers.\r\nThe Nexus Forums: For occasionally having a quick answer to some of the obscure problems I ran into.\r\n\r\nI would also like to credit the tutorial that taught me how to do all of this, but I cannot for the life of me find the original link. If I stumble across it, I\\'ll add it to the readme.\r\n\r\nTerms of Use:\r\nDo whatever you want with this. I made it for my enjoyment, and I shared it for your enjoyment.\r\n",
  "categoryId": "54",
  "version": "1.1",
  "author": "Bingles",
  "createdUnix": "1327762040",
  "updatedUnix": "1328353517",
  "containsAdultContent": false,
  "uploadedBy": "bingles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25772",
      "name": "Bingles Buff Dragon Armor with Pants",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1035",
      "fileName": "Bingles Buff Dragon Armor with Pants-7214-1-1.rar",
      "uploadedUnix": "1328353423",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/a1656601847ac9520bd6d19991d8878fcc653841a95dc26e50d9df13c2231c48/analysis/1406652967/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bingles%20Buff%20Dragon%20Armor%20with%20Pants-7214-1-1.rar?fid=25772&ttl=1535765132&ri=8192&rs=8192&setec=2d7a14878953b37e1a6f13dfb0572285"
    },
    {
      "fileId": "25773",
      "name": "Bingles Buff Dragon Armor NO Pants",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1057",
      "fileName": "Bingles Buff Dragon Armor NO Pants-7214-1-1.zip",
      "uploadedUnix": "1328353517",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e5dfa1f81db2e2e20894757b56bc180174e86a61f25809f1b7cb6ee14847936f/analysis/1406652970/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bingles%20Buff%20Dragon%20Armor%20NO%20Pants-7214-1-1.zip?fid=25773&ttl=1535765132&ri=8192&rs=8192&setec=9c1595bbdbc5a3f47ffb06329764f0b9"
    }
  ]
}