{
  "modId": 7215.0,
  "modName": "Alternative Start - Thorogoth a bosmer hunter - RP",
  "summary": "Growing up in the forests of Valenwood made Thorogoth a great hunter but a strange letter from his long time friend, Alvor of Riverwood, will unwind a string of events that will test his skills to the limit.  ",
  "descriptionHtml": "Bosmer are most at home in the forests of Valenwood.  As a young lad Thorogoth would venture into the wilderness in search of adventure.  He quickly became very skilled with his bow.  This along with his great ability to sneak made him a great hunter.  Though Thorogoth\\'s heart was still in love with the great thrill of adventure.  Deciding to find new lands to hunt, he set out on a journey to one of Tamriel\\'s least tamed lands, Skyrim.  Upon arriving, Thorogoth traveled Northwards until he came upon a strange group of stones.  There were woods all around for hunting and a river for fishing.  To make things even better there was a little town to the north-east where he could sell his pelts.  He set up a little camp site and started to hunt.  Once he had enough pelts he took them into town to sell.  At first he figured the general goods store was his best bet.  Unfortunately the  merchant was a uptight imperial who wouldn\\'t pay more than 3 coins for Thorogoths pelts.  Saddened by this he decided he would have to take his pelts to the big city up north.  As he was leaving town the local blacksmith caught sight of him and called him over.  The smith was a good man and couldn\\'t stand to see another man down.  He took Thorogoth to the local tavern and they had some merry times.  After a day of mead and song the the smith, who\\'s name was Alvor Thorogoth discovered, offered to buy Thorogoth\\'s pelt.  Alvor said he was low on leather and would give Thorogoth a friendly price for any pelts he had.  After that day Thorogoth brought his pelts to Alvor.  Alvor\\'s business boomed too.  With all the leather and fur he was receiving, he was able to make tons of light armors.  The two became best friends and whenever Thorogoth was in town they would celebrate their friendship with a recreation of how it started, a day at the tavern.  A few years later Thorogoth received an urgent letter from Alvor saying his nephew, Hadvar, was staying at his house and that he needed a message delivered to the jarl.  Thorogoth gatered up some of his belonging and got ready to head into town.  \r\n\r\n\r\nThis is an alternative start save.  His skills are:\r\nSneak and Archery are at 40 because these are the true traits of the hunter\r\nAll magic skills are at 0\r\nLight Armor is a 30 for the occasional run in with a bear or bandits\r\nOne handed is at 20 just in case he needs to protect himself\r\nAlchemy is at 20 so he can create healing potions from wild ingredients\r\nSmithing is at 20 since he has to create his own armor out of his pelts\r\nSpeech is at 20 for selling his pelts\r\nLockpicking and pickpocket are at 0 because he has always earned an honest living\r\nTwo handed, block and heavy armor are at 0 because hunting takes patience, one cannot just run at a deer and expect to catch it\r\n\r\nRequirements:     \r\nJaySuS Swords (JaySuS created some hunting weapons, Thorogoth uses a Long Hunting Sword and a Hunting Knife from Jaysus.  If you don\\'t download this the only weapon Thorogoth will have is a hunting bow)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1002\r\n\r\nFur Hoods HD (You need this for the fur hood shown in the screenshot)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3201\r\n\r\nCredits:\r\nAOF Believable Hair-Female and Male- (I used this to boost the hair quality in the screenshot)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4307\r\n\r\nXCE - Xenius Character Enhancement (I used this to boost the characters looks in the screenshot)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2356\r\n\r\nRecommendations: (I, of course, recommend the mods I used above along with these)\r\nWeapons of the Third Era\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3871\r\n\r\nA Quality World Map - With Roads\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4929\r\n\r\nCompelling Treasure Maps\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6907\r\n\r\nDeadly Dragons\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3829\r\n\r\nDFB Companion Bow Visible\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6520\r\n\r\nDovahkiin Hideout\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6032\r\n\r\nFirewood For Sale\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5653\r\n\r\nI Put A Spell On You - More Enchanting Options \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3313\r\n\r\nLord Armor\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5853\r\n\r\nMidas Magic - Spells in Skyrim\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3413\r\n\r\nNPC Bartering\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6802\r\n\r\nPhenderix Magic Evolved - 144 New Spells\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5898\r\n\r\nPricier and Heavier Pelts and Hides \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7039\r\n\r\nQuick Tomb Looting\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6591\r\n\r\nSkyrim Performance PLUS\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6387\r\n\r\nSkyrim Nordplate Enhanced\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6804\r\n\r\nWars in Skyrim IV - Dark Rainbow is back-\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6176\r\n\r\nWitchers Blades\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6253\r\n\r\nVarious Guards Outfit for Every City TS Edition \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6770\r\n\r\n\r\nBugs/Issues/Questions\r\nIf there are any problems or general questions feel free to voice them in the comments section which I will try to check often\r\n",
  "categoryId": "43",
  "version": "1",
  "author": "SoldierForSkyrim",
  "createdUnix": "1327763442",
  "updatedUnix": "1327763686",
  "containsAdultContent": false,
  "uploadedBy": "SoldierForSkyrim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23701",
      "name": "Thorogoth",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1320",
      "fileName": "Thorogoth-7215-1.zip",
      "uploadedUnix": "1327763686",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/13e01ad08299e2fdb53481e3cec40d5db7d3c4f61bd93aeaa33c2757f882b639/analysis/1406642046/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thorogoth-7215-1.zip?fid=23701&ttl=1535765134&ri=8192&rs=8192&setec=cffbf41e239991a3c7fe8281bf2c1afa"
    }
  ]
}