{
  "modId": 72191.0,
  "modName": "Tava&#39;s Blessing",
  "summary": "Tavas Blessing is a new port city in the northern part of the Alikr Desert.",
  "descriptionHtml": "Tava&#39;s Blessing\r<br />[youtube]GsfBDwWwNNw[/youtube]\r<br />Thank you [url=https://www.youtube.com/channel/UCBRmzqswNKBPnUZW2df3DPw]VatiWah[/url]\r<br />[youtube]LWh8S6YvJNo[/youtube]\r<br />Thank you [url=https://www.youtube.com/channel/UCtcUKdcAXfVCo5YlgBMkfjA]theDeModcracy[/url]\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-05%2015-58-54-21_zpspmczheyt.jpg[/img]\r<br />[size=4]Introduction[/size]\r<br />Would you like to take a break from the cold lands of Skyrim, and experience warm desert sands. Well what are you waiting for.\r<br />\r<br />\r<br />[size=4]Description[/size]\r<br />Travel to Tava&#39;s Blessing the Northern part of the Alik&#39;r Desert, discover a new port city. Participate in new quests, take over the Skooma drug trade, become a villain or enforce the law. Join new factions, rise from rags to riches. Protect the city, take control. Save the princess and the citizens. Kill the desert bandits or join them. The possibilities will be many in this new DLC project for the Elder Scrolls V Skyrim. (Notice this is an ongoing project)\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/10_zpspzgm4gk4.jpg[/img]\r<br />How do I get to the Desert?\r<br />You have 3 options go to the throat of the world, take the airship there, or go to a statue near the Riverwood Sawmill and it will directly teleport you into the desert area, or you can do a quest and activate a wheel in the Windhelm dock area.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/20_zpsbetxczfl.jpg[/img]\r<br />[size=4]\r<br />Lore Story[/size]\r<br />Tava is a Yokudan spirit of the air. Tava&#39;s Blessing is a port city in the northern part of the Alik&#39;r Desert. A storm is brewing in the desert. Rabah desperately leads his men into battle against the Imperial Army, who are trying to control the city. Rabah is in control of the Skooma trade, the Imperials are trying to destroy his business. Meanwhile the Alikr warriors desperate for resources and gold wage war all across the wasteland. Desert Bandits have also risen and attack anyone on sight, Tava&#39;s blessing is about to turn into a curse but will you be the hero Tava&#39;s Blessing needs and will you bring the city to glory and help build it, or will you join the corruption. (Will be expanded.)\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/17_zpsrvxysrud.jpg[/img]\r<br />\r<br />[size=4]Main Characters.[/size]\r<br />\r<br />Rabah - Black Market, Drug Dealer, Enforcer, The Boss and Kingpin in Tava&#39;s Blessing. Some believe he is associated with the desert bandits and has direct ties with the Alik&#39;r Warriors. Rabah is brewing a war in Tava&#39;s Blessing.\r<br />\r<br />Musafa - Powerful Drug Lord \r<br />\r<br />Max - Influential Imperial Officer\r<br />\r<br />Sera - Rabahs girlfriend\r<br />\r<br />Tania The Black Market Merchant, potential girlfriend.\r<br />\r<br />much more\r<br />\r<br />\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-05%2015-55-46-29_zps2gb5keyr.jpg[/img]\r<br />\r<br />[size=4]Quests[/size]\r<br />\r<br />1. Breaking Point\r<br />Rabah is the most influential and powerful drug dealer in Tava&#39;s Blessing, the Imperials want to arrest him and bring order and stability to Tava&#39;s Blessing. It&#39;s up to you to help Rabah build his empire, or join the law and bring him down.\r<br />\r<br />2. Tania&#39;s Request\r<br />Tania has been robbed. She suspects that her rivals Malik & Badoo stole from her, find out who stole from Tania. \r<br />\r<br />\r<br />3. Skooma Shipment\r<br />Rabah owe&#39;s you money. He claims that some bandits stole his drug shipment, intercept the drug deal and retrieve Rabah&#39;s package.\r<br />\r<br />4. The Northern Badlands&#33;\r<br />I have agreed to take out Usama a Desert Outlaw who wants to control Tava&#39;s Blessing and distribute his product. He wants Rabah out of the picture. \r<br />\r<br />5. Mischief&#33;\r<br />Rabah thinks Musafa killed his own wife. I should dig deeper, and find out who really killed Musafa&#39;s wife. \r<br />\r<br />6. Skooma Shipment&#33;\r<br />I demanded more coin from Rabah&#33; I&#39;m dodging arrows left and right everyday. I&#39;m putting my life on the line, and I won&#39;t do it for a cheap price. He said that he would be glad to pay. Some bandits have stolen his drug shipment. He told me that if I retrieve it, he would be willing to split the shares.\r<br />\r<br />\r<br />7. Joining The Restless League&#33;\r<br />Rabah wants me to prove myself one more time, before he accepts into the Restless League. To join the guild I must retrieve a stolen crown, it&#39;s an heirloom from his father who was also a member of the Restless League. I must take the crown from Jafar, Rabah tells me that he is hiding like a coward in a cave.\r<br />\r<br />8. Blood Bath&#33;\r<br />I have met the elder of the Restless League, he has heard tales about me, and is very happy that I joined the league. Raziq is very worried, he asked me if I was followed, I told him that I wasn&#39;t, but he thinks I was followed, I should investigate the entrance.\r<br />\r<br />9. Frigid Assault&#33;\r<br />Tania told me that they are holding a funeral for Jafar the King of Bandits, this is my opportunity to send the desert bandits a message, to let them know that I&#39;m in control of this land now. I could be making major coin like Rabah, if I disrupt the funeral that would surely let the desert bandits know that Rabah is back in business and that they messed with the wrong crew.\r<br />\r<br />10. Beach Party&#33;\r<br />Rabah wants me to take out a fool, who owes him money. He told me the bandit is right around the corner.\r<br />\r<br />\r<br />11. Another Beach Party&#33;\r<br />Rabah has told his friends about me, and they are throwing me a party. Rabah tells me they are celebrating in a beach, called The Exotic Coast. I should meet up with Rabah&#39;s friends and socialize with his friends. Rabah tells me that they are eager to meet me. They have heard of all my accomplishments and the people I defeated in battle. I can&#39;t wait to see what this party has to offer.\r<br />\r<br />[size=4]Bonus Quest[/size]\r<br />\r<br />New Beginning&#33;\r<br />I have met a Redguard lady today. She was hanging out by the docks in Windhelm. Seems like some sort of criminal. She wants to steal a boat and sail to Tava&#39;s Blessing. But first she wants to kill her cheating husband. I have agreed to take him out.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-05%2015-54-26-45_zpsnr26t6gc.jpg[/img]\r<br />\r<br />[size=4]Climate[/size]\r<br />Tava&#39;s Blessing has it&#39;s own climate settings. The Sun begins to rise at about four ten. The sun begins to set around seven. It has an eighty percent chance of clear skies and a thirty percent chance of rain.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-05%2015-55-36-87_zpstbfiajtf.jpg[/img]\r<br />\r<br />[size=4]Features[/size]\r<br />Exotic Foods\r<br />New Port City Tava&#39;s Blessing\r<br />Has it&#39;s own LOD settings\r<br />Has it&#39;s own climate settings.\r<br />New lands, desert area\r<br />Merchants\r<br />Small Player home\r<br />New quests\r<br />More immersion\r<br />New NPC&#39;s \r<br />unique dialogue options\r<br />New Interiors\r<br />New girlfriend\r<br />Dock Area\r<br />Beach area\r<br />and much more\r<br />\r<br />[size=4]Requirements[/size]\r<br />Official copy\r<br />Skyrim.esm\r<br />Latest update\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-05%2015-55-32-53_zpsqp3t8dzi.jpg[/img]\r<br />\r<br />[size=4]Note from Cyber Network[/size]\r<br />We have received much inspiration from playing Tava&#39;s Blessing online, and want to provide a new immersive Desert area, the Cyber Network is a modding group. We are dedicated to the research of gaming and electronics. We create mods and music. We are here to share mods you otherwise could never have. Feel free to use any content and or music created by us, as long as you give us credit. Asset&#39;s not created by us, you must ask permission to the author, as we asked and received permission to use, everything used in our mods, it&#39;s free from copy righted content.\r<br />\r<br />Permission:\r<br />Note the author&#39;s of this mod have received permission to use certain asset&#39;s from other modders, via chat. You can&#39;t use any of the asset&#39;s used in this mod. you must ask proper permission to the rightful owners. Most of the resources used in the mod are free modder&#39;s resources, and exclusive and limited permission was given.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-05%2015-58-35-04_zpsa2098te1.jpg[/img]\r<br />[size=4]Disclaimer[/size]\r<br />This mod is free from copy righted content, all rights have been reserved and permission has been granted to use the custom asset&#39;s, we have spoken with Manny GT personally and other authors and they have given permission to use some of their asset&#39;s. We are working together to create big projects only. We don&#39;t use any asset&#39;s in which we don&#39;t have permission or aren&#39;t free modder&#39;s resource. \r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-05%2015-54-25-41_zpsgbwqfvzg.jpg[/img]\r<br />\r<br />[size=4]Credits/Hall of Fame[/size]\r<br />MannyGT - Modding resources, ruins, buildings etc. (I have spoken with MannyGT personally and he is aware and wishes us the best. Thank you MannyGT we appreciate you.  - CyberNetwork \r<br />CD Projekt & Oaristys- Modding resources\r<br />Antony Bellingham for his great tutorials on youtube, thank you sir. \r<br />[url=http://vindsvept.com/]Vindsvept [/url]- For the custom soundtrack. Thank you for sharing your music, and for giving permission under the terms. We love your music. \r<br />Ladyonthemoon - Level of detail expert. Vital Modding resource. Thanks for guiding us and helping us understand how to generate LOD.\r<br />bfadragon - For the resource extra food. Wonderful, thank you.\r<br />CAD345 - For The Airship. Big thanks.\r<br />MuppetPuppet - Modding resources, thank you.\r<br />Tamira - Modding resources \r<br />Markus Liberty (Tellmann) - for the modelling and texturing Cyrodiil Ship and boat resource rces, tropical plants, palm trees, flowers, etc\r<br />Stroti - Modding resources, Aladdin&#39;s lamp etc.\r<br />MJY - The Author of the mysterious Island personally gave Red Rayne permission to use his asset&#39;s & Modding resources. Thank you MJY.\r<br />Blackflag & Hyperactivechild - Landscape Textures\r<br />Celti Decor for Skyrim I by DarkRider \r<br />Wicker Set by Garnet edhildil - For the Camel resource, thank you.TesTiger - Royal Redguard Armor, Modding resources. Thank you.1shoedpunk - for assisting in merging collisions for the rowboats\r<br />Yuril - Various Barrels, modding resources\r<br />\r<br />(If you think you name belongs in the hall of fame, send me a pm and I will update the list, I hope you enjoy the mod. notice this project is ongoing - Cyber Network)",
  "categoryId": "30",
  "version": "2.6",
  "author": "Yasmina and Red Rayne The Cyber Network",
  "createdUnix": "1451078992",
  "updatedUnix": "1451233046",
  "containsAdultContent": false,
  "uploadedBy": "CyberNetwork",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000189062",
      "name": "Tavas Blessing",
      "version": "2.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "287350",
      "fileName": "Tavas Blessing-72191-2-5.rar",
      "uploadedUnix": "1451077359",
      "modVersion": "2.5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tavas%20Blessing-72191-2-5.rar?fid=1000189062&ttl=1535860720&ri=8192&rs=8192&setec=8f498d8324c70cf2c528214de0a64a97"
    },
    {
      "fileId": "1000189225",
      "name": "Tavas Blessing 2.6",
      "version": "2.6",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "826",
      "fileName": "Tavas Blessing 2.6-72191-2-6.rar",
      "uploadedUnix": "1451233046",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/7bae3ee8be7e64cebc0c3382fee3aefe8dacc9c610ba73cf740cd2acd772ce1e/analysis/1451233086/",
      "changelogHtml": " Water adjustments <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tavas%20Blessing%202.6-72191-2-6.rar?fid=1000189225&ttl=1535860720&ri=8192&rs=8192&setec=6e616eaf85659891fb70fa564c62d76b"
    }
  ]
}