{
  "modId": 72204.0,
  "modName": "Better Steel from Iron",
  "summary": "Create steel and Dwemer metal. ",
  "descriptionHtml": "This mod does two things.  \r<br />\r<br />First, it lets you create steel using iron ingots and charcoal which you can create from firewood.  However, unlike the other mods that do the same thing, this mod attempts to make the process much closer to the way it is done in real life.  In order to create this mod I visited a steel mill to learn about the process. 14 hours of instruction later I settled on the formula I put in the mod. \r<br />\r<br />Two Firewood = 1 Charcoal\r<br />20 Charcoal + 2 Iron Ingots = 1 Steel Ingot (Real life waste is less of course.)\r<br />\r<br />\r<br />Second, if your character has gained the Ancient Knowledge Perk by doing the related quest then this perk will now grant you the ability to create Dwarven metal ingots by creating an alloy.  Very Important: you need to already have at least one Dwarven Metal Ingot in order to start the process. \r<br />\r<br />1 Dwarven Metal ingot + 1 Gold ingot + 1 Silver ingot + 1 Steel ingot + 1 Corundum ingot = 5 Dwarven Metal ingots\r<br />\r<br />The idea here is that you are using the first Dwarven Metal ingot as a base and &#34;Growing&#34; the rest of the ingots on top of it.  Certain special grades of steel must be made in this way.  The first ingots of Dwarven metal probably required greater heat than current Skyrim smelters or forges can provide and the process probably had a lot of waste.  However, much less heat needs to be used and there will be much less waste by using an ingot that is already made to assist in making more. \r<br />\r<br />Anyway, I hope you all enjoy my first mod.  If you have any suggestions or if you notice any problems please let me know.  \r<br />\r<br />In case I can&#39;t specifically say elsewhere, anyone who wants to has complete permission to use this mod to do whatever they want.  I&#39;m not picky about it just so long as you don&#39;t just put your name on it and pass it off as yours. ",
  "categoryId": "78",
  "version": "1",
  "author": "Gill13",
  "createdUnix": "1451131197",
  "updatedUnix": "1451131193",
  "containsAdultContent": false,
  "uploadedBy": "Gill13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000189101",
      "name": "Better Steel and Dwemer Metal Smelting",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Better Steel and Dwemer Metal Smelting-72204-1.7z",
      "uploadedUnix": "1451131193",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b3e5d6e0e469feced3ce3a53d6fc2636981baa296c28267884227dd3886bddc3/analysis/1451131203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Steel%20and%20Dwemer%20Metal%20Smelting-72204-1.7z?fid=1000189101&ttl=1535860732&ri=8192&rs=8192&setec=b8f9896a93e803b31496146579480f41"
    }
  ]
}