{
  "modId": 72202.0,
  "modName": "Creature Mod - Degonians - v2.10",
  "summary": "This mod adds a bunch of very tough high level lizard werewolf type creatures around\r<br />Skyrim for you to kill :3.",
  "descriptionHtml": "[font=Lucida Sans Unicode][size=4][b]Description:[/b][/size]\r<br />[size=1]\r<br />[/size][list]\r<br />[*][size=1][i][u]Requires [b]Dragonborn DLC[/b], [b]Dawnguard DLC[/b] and [b]SKSE 1.7.3[/b][/u][/i][/size]\r<br />[*][size=1]So this mod is a simple one but it does have some neat little features in it. The name by the way is just a portmanteau of Deformed and Argonian - Creative, I know&#33;[/size]\r<br />[/list]\r<br />[size=1]\r<br />[/size][size=2][b]* New Additions in Version 2.1:[/b][/size]\r<br />\r<br />[list]\r<br />[*][size=1][b]New Enemy: [/b]So I wanted to add a new boss enemy that in my personal lore is the cause of the Degonians - essentially it mutates and corrupts Argonians that encounter it into a Degonian (They don&#39;t actually do this in game tho soz). The new enemy is a flightless dragon type enemy (kinda looks like the Lagiacrus from Monster Hunter totally a coincidence i swear&#33;) which I&#39;ve called a Basilisk. So right now this guy isn&#39;t totally completed since I wanted to fix a bug where some Degonians spawned but were invisible (not like a spell invisible I mean like they showed up on the compass as an enemy but otherwise weren&#39;t there) and get it uploaded fast, which I was about to do but I had to visit some family before I could. So yeah, they fight like a grounded dragon with some custom breath attacks ATM, in the future I plan to make his attacks a bit more interesting. On to their spawn points - right now they spawn after you reach level 150 in any place a Degonian can spawn - in the future I plan on making it so that you have to summon it, maybe a small quest or something.[/size]\r<br />[*][size=1][b]Perks: [/b]I&#39;ve added a few new perks that you can get. One is the Apex perk, this perk allows you to do double physical and magical damage and grants you the ability to spit poison in the form of a shout, it will also let you craft an Apex styled armor and weapon set which I will add later on (hopefully). The other perk is one you get from killing Lolong which in simple lets you do more damage, similar to the Apex perk I will add a themed armor and weapon set. In future I plan on adding more perks you get from killing other bosses.[/size]\r<br />[*][size=1]Minor [b]Additions[/b][b]: [/b]A fair amount more spawn points - around ~25 in total. [/size]\r<br />[*][size=1][b]Bugfixes: [/b]I managed to fix the problem that some people were having with some Degonians not spawning properly and being invisible. [/size]\r<br />[/list]\r<br />[b][size=2]* New Additions in Version 2.0:[/size]\r<br />[/b][size=1]\r<br />[/size][list]\r<br />[*][size=1][b]Variations for Days - Seriously: [/b]So in the future ideas I said that there were only ~8000 variations and that originally I wanted something like 60,000 variations. Well I reached that mark and then a bit - so to speak. So at this point we have 48,603,434,880 variations IE: 48 Billion friggin boom&#33; I did this buy adding 3 new misc slots and then converting the dorsal spines that originally were a part of the body slot into its own slot for a total of 9 slots, did I say slots enough? Alongside this as a minor bonus the original 5 slots that originally added up to only 8000 now add up to 960,960 combinations,  If you want to check out the numbers there&#39;s a slightly confusing excel spreadsheet that you can look at in the .rar file.[/size]\r<br />[/list][font=Lucida Sans Unicode][list]\r<br />[*][size=1][b]High Level Enemies and Apex Status: [/b]So I was watching a bunch of Monster Hunter 4U vids and got a little inspired and decided to add in a new status that can spawn on Degonians once your character passes level 120 which I just totally stole from MH4 and have called Apex. Degonians with Apex status like in MH4 are much tougher than regular ones to the point of being nearly broken alongside that they also gain a new vomit attack that does a fair amount of poison damage - so watch out yo&#33; In addition I added about 13 new NPCs, 6 are high level ones that spawn after you reach level 120 with the next 6 being &#34;apex variations&#34; (these ones always spawn with the Apex status instead of having a chance to spawn with it) of the aforementioned 6. The 13th NPC I added is a secret boss, he spawns anywhere a regular one spawns and at any level. In my opinion he is pretty stronk so anyone who has a non-godtier enlightened CHIMmed out character should probably take care. Also since he is fairly tough I did give him a weakness to a certain weapon material so try and find out which one it is since it does make it a whole bunch easier to fight him.[/size]\r<br />[/list][/font][font=Lucida Sans Unicode][list]\r<br />[*][size=1][b]Minor Additions: [/b]On spawn the size of the Degonian will get randomly adjust to a value between 0.85 and 1.25. So alongside the new high level NPCs I&#39;ve added in a chance of the already named bosses to spawn once you get past level 170 just for funsies :). Also you can now open your inventory while your transformed as a degonian. One last thing, I added purple in as a &#34;legendary&#34; eye colour.[/size]\r<br />[*][size=1][b]O[/b][/size][b]ther Stuff: [/b]I got rid of the &#34;assorted scales&#34; item since it was me just testing out a script and because I may have messed up said script beyond repair... Instead all the items drop when you kill a Degonian like any other creature.\r<br />[/list][/font][/font][font=Lucida Sans Unicode]\r<br />[b][size=2]* New Additions in Version 1.1:\r<br />[/size][/b][/font][font=Lucida Sans Unicode][b][size=1]\r<br />[/size][/b][list]\r<br />[*][size=1][b]Transformations: [/b]So a couple people wanted to be able to transform into a Degonian so I thought why not? I&#39;ve added 3 craftable spell tomes that let you transform into one. You craft them at a blacksmith forge like a lot of other items but they&#39;re a few special requirements. Firstly you need the Daedric Smithing Perk, secondly since the 3 tomes are actually 3 tiers you need a certain level of skill as well, specifically Alteration, you need a skill of 60 for the first tome, a skill of 80 for the next and a skill of 100 for the third and final. Alongside this there is a bug with the transformation spells where you don&#39;t transform back into your regular character if you haven&#39;t completed the Companion&#39;s Quest where you get to become a werewolf. To combat this I made it a requirement that you have completed the quest before you can craft anyone of the tomes. One last thing, the tomes do require some rare dropped items to craft them so in case some of you don&#39;t want to leave it up to chance when you kill a Degonian I have made 4 new bosses that have a guaranteed chance of dropping the required items.[/size]\r<br />[*][b][size=1]Quick Overview of the Bosses:[/size][/b]\r<br />[*][size=1]Chilled:[b] [/b]A frost based Degonian, he can freeze you and stuff&#33;[/size]\r<br />[*][size=1]Luminium: Similar to Chilled but lives somewhere deep and dark&#33;[/size]\r<br />[*][size=1]The Sentinel: A Degonian that has been tamed by the Forsworn and their Hargraven allies&#33;[/size]\r<br />[*][size=1]Lolong: A relatively peaceful goliath that roams near an ancient dwemer ruin&#33;[/size]\r<br />[*][size=1][b]Fatigue: [/b]Note: I&#39;m not sure if this part is actually working properly or not. Anyway this means that the less stamina a Degonian has the less damage it does. For example if the Degonian has 20% or less of its stamina remaining it will only be able to do 20% of its maximum damage.[/size]\r<br />[*][size=1][b]Misc: [/b]I made a goofy little thing where if your near a Degonian that for whatever reason isn&#39;t attacking you and you drop a deathbell flower, it will go and pick it up. This isn&#39;t anything special and aside from them picking the flower up it does nothing else, its just kind of a little test :) I made some of the Degonians a little bit bigger as well.[/size]\r<br />[/list][size=2][b]\r<br />Randomization:[/b]\r<br />[/size][i][b]What does this mean within the mod?[/b][/i]\r<br />\r<br />[/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1]Each Degonian spawns with a slightly different appearance. This system is the exact same one as the one used for humanoid NPC&#39;s randomized armour set-ups. It utilizes levelled lists with five in total that each correspond to a certain &#34;slot&#34; on the NPC&#39;s body. So the five slots are as follows: Eyes, Horns, Body, Claws and Misc. The first four are pretty easy to figure out and the last one is just simple cosmetic additions like more spikes. As of version 2.00 there are four new slots which now allows for 48,603,434,880 unique appearances without actually making anywhere near that many assets&#33;[/size][/font]\r<br />[/list][font=Lucida Sans Unicode][b][i]\r<br />What Effect does this have?\r<br />[/i][/b]\r<br />[/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1][b]Basics: [/b]The horns and misc slots dont do anything aside from changing the appearance of the NPC. On the other hand the Eyes, Body and Claw slots do do stuff&#33;[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1][b]Eyes[/b]: They&#39;re three types of eyes red, yellow and green. Red and Yellow are standard and the most common variation and dont have any effect on the NPC. Green is the rarest and has the biggest impact. If a Degonian spawns with green eyes it means that it is a &#34;Legendary&#34; (Fallout 4 much?) this means that it has a ton more health and has a reasonable resistance to all forms of magic and poison. It also means that the loot reward is better (that will be covered in the loot section).[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1][b]Body: [/b]This slot has about 11 variations and has the most visually noticeable effect on the NPC. The bodies function the same way as the various armour tiers work. Rarer and more extravagant types are stronger and provide better protection while more common simpler types are generally weaker - simple&#33;[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1][b]Claws: [/b]The claws define what type of damage the NPC does - just the same as the various weapons regular NPCs like bandits spawn with. For example glowing orange claws means that it will do fire damage. Alongside this the type of claw defines what type of ingredient you get - pretty simple: if one spawns with fire element claws it will drop fire element claws as an ingredient.[/size][/font]\r<br />[/list][font=Lucida Sans Unicode][size=1]\r<br />[/size][size=2][b]Spawning:[/b]\r<br />[/size][b][i]Where are they?:[/i][/b]\r<br />[size=1]\r<br />[/size][/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1]There really tough so I made them pretty rare, there are only about 10-12 spawn points around Skyrim. I&#39;ll tell you two of them cause I&#39;m nice :). One spawns around or under the bridge on the outskirts of Whiterun and another unique one spawns in the swamps near Morthal.[/size][/font]\r<br />[/list][font=Lucida Sans Unicode]\r<br />[size=2][b]Loot:[/b]\r<br />[/size][b][i]Anything Different?:\r<br />\r<br />[/i][/b][/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1][s][b]Scales: [/b]On death you&#39;ll find an item called &#34;Assorted Degonian Scales&#34; when you loot it you will be given a random selection and amount of various types of Degonian Scales (standard, red, blue and magenta) with differing values and a small amount of gold that managed to get lodged in the creature&#39;s body somehow. I decided on doing it like this (mainly to test out some simple scripting) because I wanted it to be like you were scratching of various scales off its body or something like that. Also there is a minor bug were the assorted scales item doesn&#39;t get removed when you loot it. Not too major you can sell or drop the item somewhere.[/s][/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1][b]Legendary and Mythical: [/b]So there&#39;s a ~1/100 chance that a Degonian will spawn as a &#34;Legendary&#34; type and there&#39;s a 10/100 chance that one will spawn as a &#34;Mythical&#34; type. Since both these effects make the NPC a fair amount stronger I thought that they deserve a special reward so thats what I did. So if one spawns with either of those effects they will also have a special token - a Legendary Token or a Mythical Token. These tokens when you pick them up add a bonus of gold that can range anywhere from the minimum value of the token itself to something like 1000 gold extra.[/size][/font]\r<br />[/list][font=Lucida Sans Unicode]\r<br />[/font][font=Lucida Sans Unicode][size=3][b]Installation:[/b]\r<br />[/size]\r<br />[size=2][i]Easy:[/i]\r<br />[/size]\r<br />[/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1]Download the mod with nexus mod manager and then activate the mod in NNM, simples&#33;[/size][/font]\r<br />[/list][font=Lucida Sans Unicode][size=2]\r<br />[/size][i][size=2]Manual:\r<br />[/size][/i][size=1]\r<br />[/size][/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1]Drag and Drop the BP_Degonian .esp and .bsa into your skyrim/data folder[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]For reference it should look something like this: C:&#92;Games&#92;Steam&#92;SteamApps&#92;common&#92;skyrim&#92;Data[/size][/font]\r<br />[/list][font=Lucida Sans Unicode] \r<br />[b][size=2]Uninstalling: [/size]\r<br />[/b]\r<br />[/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1]Move or delete the two files you put into your data folder earlier[/size][/font]\r<br />[/list][list]\r<br />[*][font=Lucida Sans Unicode][size=1]If you installed the mod using NNM, just deactivate the mod in NNM[/size][/font]\r<br />[/list][font=Lucida Sans Unicode] \r<br />[b][size=3]Feedback:[/size][/b]\r<br />\r<br />[list]\r<br />[*][size=1]Yeah so if you do download the mod be sure to tell me how broken and messed up it is so that I can try and un-break and un-mess it up in an update&#33;[/size]\r<br />[/list]\r<br />[b][size=2]Compatibility:[/size]\r<br />[/b]\r<br />[list]\r<br />[*][size=1]This should be compatible with basically all other mods. If you do find an issue in this area please tell me so I can try and fix it&#33;[/size]\r<br />[/list][size=1]\r<br />[/size][b][size=2]Bugs/Issues:[/size][/b]\r<br />\r<br />[/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1]Minor bug were the assorted scales item doesn&#39;t get removed when you loot it. Not too major you can sell or drop the item somewhere.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]Sometimes the Degonian will just move up to you and not attack just seems to have a stare down with you. This might just be in my game but I&#39;m not too sure. Either way not too game breaking but just a little immersion breaking.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]The tail is goofy as hell because it uses the werewolf rig and animations. Alongside this some of the fingers and spines are a little weirdly rigged which in turn makes them look weird in-game though its not too noticeable. This can be fixed if I feel like it and I may well do so but who knows&#33; [/size][/font]\r<br />[/list][font=Lucida Sans Unicode][size=1]\r<br />[/size][size=3][b]Notes:[/b][/size]\r<br />[b][size=1](Probably a bit of repetition here)[/size][/b]\r<br />\r<br />[/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1]Legendary ones can be distinguished by their green eyes and much higher level of difficulty.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]Mythical ones can be easily distinguished by the crazy green effects flowing around their body[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]Anyone of the various specific Degonian NPCs can spawn as a legendary or mythical version or even both[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]The models are reasonably high in poly-count ~18-20 thousand polygons so they don&#39;t spawn in groups larger than 2 maybe 3.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]The variations aren&#39;t very drastic but they are still there and defiantly noticeable if you pay close attention.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]They are like super tough, my cheaty character with ~3000 health and one handed damage at around 500-600 has a bit of trouble. The high damage my character has does make it a lot easier though. [/size][/font]\r<br />[/list][font=Lucida Sans Unicode][b]\r<br />[size=3]Future Ideas:[/size][/b]\r<br />\r<br />[/font][list]\r<br />[*][font=Lucida Sans Unicode][size=1][s]Originally around [i]12x19x3x8x11= 60,192[/i] different visual combinations (with different statistics) was intended but so far it&#39;s no were [i]near[/i] that amount, right now there are only 11x6x3x15x3 = 8910 combinations. In the future I might add more and reach (or even surpass&#33;) that original number since it&#39;s easy for me to add new variations in at this point so there&#39;s a good chance that I will update the mod with a few more (but no promises&#33;).[/s]  - lol[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]More variations, More&#33;, MORE&#33; [/size][/font][size=1]For example - High Level Claw types to keep things difficult after reaching level 100+.[/size]\r<br />[*][font=Lucida Sans Unicode][size=1]A full armour and weapon set with some unique sets based around the already existing bosses.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]A perk reward for killing certain bosses and high level NPCs - these can serve in a similar fashion to the various smithing material parks IE: once you kill a certain boss you gain the ability to craft higher level armours and weapons.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]A few more bosses maybe, possibly try out some more advanced scripting to make them interesting.[/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]Add an invisibility shout to the transformation and as something that can spawn on wild degonians as well. [/size][/font]\r<br />[*][font=Lucida Sans Unicode][size=1]Add a new boss creature...[/size][/font]\r<br />[/list]",
  "categoryId": "83",
  "version": "2.10",
  "author": "4017jman",
  "createdUnix": "1451464840",
  "updatedUnix": "1452263223",
  "containsAdultContent": false,
  "uploadedBy": "4017jman",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000189458",
      "name": "Degonian_v1.0",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49740",
      "fileName": "BP_Degonians_v1.00-72202-1-00.rar",
      "uploadedUnix": "1451464511",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/57287db9a093cae196c8bd56d5cfa45c5ede30affd6e694b4f7d732fc207cdf9/analysis/1451464583/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BP_Degonians_v1.00-72202-1-00.rar?fid=1000189458&ttl=1535860728&ri=8192&rs=8192&setec=f8b786439dedc8102de086aabbfb0766"
    },
    {
      "fileId": "1000189582",
      "name": "Degonian_v1.1",
      "version": "1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "58572",
      "fileName": "Degonian_v1.1-72202-1-10.rar",
      "uploadedUnix": "1451567104",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/150240010b2a63b377d34a66ffc8618eb26797607f956bd1b4c5744d3bb13f78/analysis/1451567177/",
      "changelogHtml": " Added 3 craftable spell tomes that allow you to transform into a Degonian <br/> \n Added 4 new unique Degonians <br/> \n Added a damage debuff based on stamina for the Degonians (Not sure if this is working properly yet) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Degonian_v1.1-72202-1-10.rar?fid=1000189582&ttl=1535860729&ri=8192&rs=8192&setec=fa8cd2941d5e29f5540b7757c194c6a7"
    },
    {
      "fileId": "1000189586",
      "name": "Readme for v1.10",
      "version": "1.10",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "4",
      "fileName": "Readme for v1.10-72202-1-10.rar",
      "uploadedUnix": "1451569144",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/e7db8d40bf75516f780069e2350fa91497dec93150a5a2e3547f366deeb9d699/analysis/1451569204/",
      "changelogHtml": " Added 3 craftable spell tomes that allow you to transform into a Degonian <br/> \n Added 4 new unique Degonians <br/> \n Added a damage debuff based on stamina for the Degonians (Not sure if this is working properly yet) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Readme%20for%20v1.10-72202-1-10.rar?fid=1000189586&ttl=1535860729&ri=8192&rs=8192&setec=7adb61f00774ad5535cc6dc1ec251006"
    },
    {
      "fileId": "1000189589",
      "name": "Degonian_v1.11 - Requires the main version be downloaded first",
      "version": "1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "51",
      "fileName": "Degonian_v1.11-72202-1-11.rar",
      "uploadedUnix": "1451572030",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/f8ae814efdcacd98202e321a51cbb4fa2eafb0f77af38000c4227a5bc9865f57/analysis/1451572085/",
      "changelogHtml": " Spelling Corrections <br/> \n Some item&#39;s weight reduced <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Degonian_v1.11-72202-1-11.rar?fid=1000189589&ttl=1535860729&ri=8192&rs=8192&setec=537880ec66cb2c5b3a69f10b68b89a75"
    },
    {
      "fileId": "1000190558",
      "name": "Degonian_v2.00",
      "version": "2.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "99875",
      "fileName": "Degonian_v2.00-72202-2-00.rar",
      "uploadedUnix": "1452263223",
      "modVersion": "2.00",
      "virusScanUrl": "https://www.virustotal.com/file/d043e4c04b3d7c20d87fae215be73da31765fc63779c5bbd77dbc940e6564957/analysis/1452263298/",
      "changelogHtml": " Added a lot more variations <br/> \n Added a new rank for Degonians (Apex) <br/> \n Added 13 new NPCs <br/> \n Added a random size script <br/> \n Fixed a few minor issues with some items and spells <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Degonian_v2.00-72202-2-00.rar?fid=1000190558&ttl=1535860730&ri=8192&rs=8192&setec=9c413ccab70262cb1ffc6f76c4917aec"
    }
  ]
}