{
  "modId": 72215.0,
  "modName": "The Paarthurnax Ultimatum",
  "summary": "Adds conversation options to Delphine (with short, fully voiced responses from her using her already existing voice clips) that allow you to complete the &#34;Paarthurnax&#34; quest and still be on good terms with both the Blades and the Greybeards.",
  "descriptionHtml": "A simple mod I made mainly for my own use since none of the existing mods that lets you spare Paarthurnax is quite what I&#39;m looking for.\r<br />\r<br />[size=5][i][u][b]Features:[/b][/u][/i][/size]\r<br />\r<br />Lightweight, with minimal edits. Basically, a bunch of &#34;setstage MQPaarthurnax 100&#34; attached to new dialogue lines so that you can complete the &#34;Paarthurnax&#34; quest (without breaking immersion by relying on the console) and still be on good terms with both the Blades and the Greybeards. Safe to install and uninstall at your leisure. You can try it out with minimal risks.\r<br />\r<br />Short, fully voice acted responses from involved NPCs using the game&#39;s original voice clips.\r<br />\r<br />Conversation branches built around those responses to sound as logical and flow as naturally as possible. I tried my best to seamlessly integrate them into the game. It is my hope that it&#39;s difficult to tell where the game&#39;s original lines end and the mod&#39;s begin.\r<br />\r<br />Different ways to deal with the situation depending on what kind of character you&#39;re role-playing:\r<br />\r<br />1. Secure Angeir&#39;s cooperation to open up the option to Lie to the Blades.\r<br />\r<br />2. Get your Speech skill above 70 to open up the option to Intimidate/Persuade Delphine, depending on your preference.\r<br />\r<br />3. Kill Alduin to open up the option to Intimidate Delphine. You killed Alduin, she really wants to risk you being &#34;against&#34; her?\r<br />\r<br />4. Fail to meet any of the requirements, have her laugh in your face, and stomp off in a rage to take it it out on poor Paarthurnax. :P\r<br />\r<br />\r<br />[size=5][i][u]Limitations:[/u][/i][/size]\r<br />\r<br />I couldn&#39;t do much for Esbern (can only Lie to him). Just couldn&#39;t find the right voice clips for him. You guys will have to settle for lecturing Delphine, lol.\r<br />\r<br />\r<br />\r<br />[size=5][i][u]Update:[/u][/i][/size]\r<br />\r<br />Added a compatibility version as an optional file for people who prefers my voiced dialogue but also loves the features of Arthmoor&#39;s &#34;The Paarthurnax Dilemma&#34;.\r<br />\r<br />Use that instead of the main one if you want to run Ultimatum and Dilemma together. \r<br />\r<br />You NEED to have his mod installed first to make the compatibility version work properly. Make sure Ultimatum comes AFTER Dilemma in Mod Organizer (if you use it) and in the load order.\r<br />\r<br />[size=3][u][i][b]Features of the Union:[/b][/i][/u][/size]\r<br />\r<br />My Intimidate options now come with Dragon Language, complete with the rumble effect when the Greybeards (other than Arngeir) speaks.\r<br />\r<br />I completely removed Arthmoor&#39;s dialogue (which is caption only, with no voiced responses (a little to VERY immersion breaking, depending on your taste), and has only one conversation tone and path, which again, might not be to everyone&#39;s taste) replacing it with mine while keeping his various other features and extras.\r<br />\r<br />If you&#39;ve never tried his mod, then the main ones are: Paarthurnax hanging around with dragon disciples after you&#39;ve killed Alduin instead of up and vanishing; more detailed quest objectives; and finally, the ability to kill the Blades and resolve the quest that way. The final one was something of a &#34;hidden&#34; feature of his mod, if you just decide to attack the Blades on a whim with his mod installed after you&#39;ve learned Odahving&#39;s name, you&#39;ll find out to your surprise that the Blades are no longer essential, and the &#34;Paarthurnax&#34; quest completes when they both die.\r<br />\r<br />That and the dragon disciples were my favorite features of his mod and why I made this. As an extra, I&#39;ve also added dialogue options set to become available when the Blades are no longer essential, making it more obvious that you CAN resolve the quest by killing them. Also a good opportunity to throw a few insults their way (if you wish) before sending them to the next world. Because, really? &#34;You&#39;re either with us or against us?&#34; I&#39;m sure there are many out there who just wants to shout &#34;I&#39;m against you&#33; B*tch&#33; Die&#33;&#34; in response to that. Now you can. :D\r<br />\r<br />[size=3][u][i][b]Limitations of the Union:[/b][/i][/u][/size]\r<br />\r<br />No longer lightweight, with minimal edits.\r<br />\r<br />There&#39;s no way I can keep up with Arthmoor&#39;s frenetic updating pace. And I&#39;m already happy with what I now have. So the Compatibility Version will be good for &#34;The Paarthurnax Dilemma&#34; version [b]1.2.9 ONLY.\r<br />\r<br />Sorry, that[/b]&#39;s just the way it is.",
  "categoryId": "35",
  "version": "1.0",
  "author": "Telamont",
  "createdUnix": "1451155716",
  "updatedUnix": "1452057785",
  "containsAdultContent": false,
  "uploadedBy": "telamont",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000189131",
      "name": "The Paarthurnax Ultimatum",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "162",
      "fileName": "The Paarthurnax Ultimatum-72215-1-0.7z",
      "uploadedUnix": "1451155770",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a1849eddd14862c5f4cab7bee3fe5589f1f11146db7deb1f2b75d37381b79c5b/analysis/1451155803/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Paarthurnax%20Ultimatum-72215-1-0.7z?fid=1000189131&ttl=1535860744&ri=8192&rs=8192&setec=c99abf222f28a237fbfa7f4a0bde7463"
    },
    {
      "fileId": "1000189521",
      "name": "The Paarthurnax Union",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "200",
      "fileName": "The Paarthurnax Union-72215-1-1.7z",
      "uploadedUnix": "1451521785",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/197f91c3484f64d46b7ba9ef9bfa47c367b226ad85a7be2c1fd441c30f15b42b/analysis/1451521813/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Paarthurnax%20Union-72215-1-1.7z?fid=1000189521&ttl=1535860744&ri=8192&rs=8192&setec=da75d70bdcc974ccb45d40513bdcb6cc"
    },
    {
      "fileId": "1000190340",
      "name": "FuzRoDoh Compatibility Patch",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "FuzRoDoh Compatibility Patch-72215-1-1.7z",
      "uploadedUnix": "1452057785",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/773e7dac8b7661a738dc94e0ced24c3e24fed73ee4fa6ff34452078dd953ca97/analysis/1452057844/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FuzRoDoh%20Compatibility%20Patch-72215-1-1.7z?fid=1000190340&ttl=1535860745&ri=8192&rs=8192&setec=5bf31f62e0a7ae2109fc72f176bbceaf"
    }
  ]
}