{
  "modId": 72273.0,
  "modName": "Mara&#39;s Island",
  "summary": "Maras Island is a new tropical DLC for the Elder Scrolls V Skyrim.",
  "descriptionHtml": "[size=4]Mara&#39;s Island\r<br />[/size]\r<br />\r<br />[size=4][img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-29%2018-52-23-23_zpsqqtgxyqf.jpg[/img][/size]\r<br />[size=4][youtube]PLxVvaIHX6g[/youtube]\r<br />Introduction[/size]\r<br />Travel to a new exotic location, experience life in a new tropical rain forest, set sail, start a new adventure, get shipwrecked near the Sea of Pearls. Experience the gift of being saved by a loving spirit, participate in new unique quests. Join new factions, your choices and actions make a difference.\r<br />[size=4][img]http://i81.photobucket.com/albums/j240/infam921/49_zpszbbcyhau.jpg[/img]\r<br />Description\r<br />[/size]Start a new adventure. Head on over to the Wind helm dock area. Activate the wheel in one of the ships stationed in the docks. After weeks of sailing the open sea, the player is shipwrecked and lands on an unknown mysterious Island, your whole crew dies in the tragedy. A loving spirit by the name of Razan came to your aid, and rescued you. She kept you safe and warm in her house, and gave you love and care. She brought you back to life. The player awakes in a new exotic, tropical Island. The options could be limitless. Discover a new world made from scratch. Join new factions, participate in the civil war brewing between the The Northern Fire Tribe and the Southern Water tribe. Build new relationships, feel loved and receive new girlfriends and gifts. Participate in gang wars and much more.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/rc_zpshklysxmp.jpg[/img]\r<br />[size=4]Civil War[/size]\r<br />The Restless League is a pirate band. They own the north side of the Island in Mara&#39;s Island, they are the most powerful and rich gang in Mara&#39;s Island, but the years have passed and the Southern Water Tribe has grown very powerful, the Restless League are now getting hammered in Mara&#39;s Island, this is where the player shines, Will you help the Restless League and the Northern Fire Tribe expand and take back their land, or will you join their enemy. The Southern Water Tribe and the Northern Fire Tribe don&#39;t mix and are at war with each other. The Southern Water Tribe are natives of Mara&#39;s Island, they are very poor, most of the members of the gang are hunters, drug dealers and farmers. They are ruthless but loyal. If you get on their bad side, they will prove to be your worse nightmare. The Gangs of Mara&#39;s Island are at war with each other, over small disputes, robbery, drug deals, prostitution, gang wars, and most important the turf and the coin.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/oioio_zpsznz6h0dt.jpg[/img]\r<br />[size=4]Features[/size]\r<br />Start a new adventure.\r<br />Large Tropical Island.\r<br />Main story line to follow.\r<br />Solve mysteries, help build Mara&#39;s Island.\r<br />Join two new factions, The Restless League and the Southern Water Tribe.\r<br />Drug Wars, Gang Wars.\r<br />A Civil War is breaking out in Mara&#39;s Island.\r<br />New Girlfriends.\r<br />Build relationships.\r<br />More immersion and fun\r<br />New books and letters.\r<br />Unique quests.\r<br />New Custom cave\r<br />Wind Chimes\r<br />New Beach areas.\r<br />New carpets and furniture\r<br />Exotic plants and trees.\r<br />New exotic foods, grapes, pineapple etc.\r<br />New version of Skooma, gives the player a visual effect.\r<br />Mara&#39;s Island has it&#39;s own Climate Settings. The Island glistens.\r<br />All crafting stations.\r<br />New interiors.\r<br />New player home\r<br />New player boat, Boat travel within the Island.\r<br />Much more.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/99_zps2asemacy.jpg[/img][size=4]\r<br />How do I join the Restless League?[/size]\r<br />Once you arrive in the Island, the first place you will visit after you get shipwrecked is Razan&#39;s house. You must talk to her and agree to help her defeat the Southern Water Tribe, if you don&#39;t talk to her or agree to join the Restless League, the Northern Fire Tribe will automatically try to kill you, you must join the guild. To join the guild talk to Razan and she will offer you a chance to join the guild.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/12_zpsa22esqzx.jpg[/img]\r<br />[size=4]How do I join the Southern Water Tribe?[/size]\r<br />To Join the Southern Water Tribe, when you visit Farid in his house, instead of killing him, accept his offer.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/15_zpsomq1v3ep.jpg[/img]\r<br />[size=4]How do I get to the Tropical Island?[/size]\r<br />To get to the Island, go the Wind helm dock area, in the ship you will see a wheel, activate the wheel and set sail. After months of traveling the open sea you will become shipwrecked and spawn in a new location called The Castaway Peninsula, there you must survive the exotic location and find the nearest refuge.[size=4]\r<br />\r<br />Main Characters\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/7_zpsjxjta41c.jpg[/img]\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/Razan2_zpsjk1q24rv.jpg[/img][/size]\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/Razy_zps1r13ax4o.jpg[/img]\r<br />Razan - Razan is a potential girlfriend. When the player becomes shipwrecked, Razan saves you from drowning. She is the leader of the Restless League in Mara&#39;s Island. She came from Stros Mkai in search for a better life and more coin. She brought the customs from Stros Mkai, and couldn&#39;t let go of her former association with the Restless League, and decided to start her own chapter in Mara&#39;s Island. The Restless League joined the Northern Fire Tribe and together they wage war against the Southern Water Tribe. Over the years they lost much power as they grew careless. The Southern Water Tribe tripled in power. Desperate for coin and resources they wage war against the most prominent gangs in Mara&#39;s Island, the Restless League and the Northern Fire Tribe. \r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/Nadia_zpszr5ohytl.jpg[/img]\r<br />Nadia - She is Razan&#39;s sister. She came from the mainland as well in search for a better life. She is also active in the Restless League. She decides to help her sister rise to power, and take control of the city.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/877_zpser7dhyc9.jpg[/img]\r<br />Farid - Farid is the leader of the Southern Water Tribe. He is very ruthless, but also likes to solve things in a diplomatic manner when it&#39;s convenient for him. When you meet him, he will invite you to join the Southern Water Tribe.\r<br />\r<br />Alain - Member of the Restless League, he mostly hangs out in Mara Central, making armor for the Restless League, he was also shipwrecked and lost his whole crew.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/M6_zps6zp20qz6.jpg[/img]\r<br />Mara - A potential girlfriend. Mara is a Merchant that hangs out by Mara&#39;s Harbor. As time progresses she becomes more into the player, if you join the Southern Water Tribe she will hate you and most likely try to kill you.\r<br />\r<br />Sanastasia - Member of the Southern Water Tribe, she works with Jayrod another thug from the Southern Water Tribe. They keep harassing Razan and send her death threats on occasions. She is also a potential follower if the player decides to join the Southern Water Tribe.\r<br />\r<br />Jayrod - Jayrod is a corrupted high elf. He was shipwrecked on the Island as well. Some say he hit his head, because the shipwreck he was never the same. Jayrod became addicted to Skooma and is very active in the Southern Water Tribe. He has a very strong temper and kills for mere pleasure, many believe that Jayrod lost his mind a long time ago. He has a thing for Razan, and wants Razan to resign and join the Southern Water Tribe, before he kills her. Razan totally blows him off, and denies his invitation, she also refuses to surrender. So Jayrod becomes determined to kill Razan. It&#39;s up to the player to save Razan.\r<br />\r<br />Sanushka - She owns a club in The Point. She is also a member of the Southern Water Tribe. If the player joins the Southern Water Tribe she will sell you many things. But if you side with the Restless League, they will attack you the moment you walk into the club.\r<br />\r<br />Zaki - His name means pure. Zaki is a former drug dealer who works for the Southern Water Tribe. He is under direct orders from Farid, which wants him to infiltrate and take over Mara&#39;s Key. Zaki is making deals in Mara&#39;s Key. He&#39;s keeping a very low profile, and sometimes poses as a member of the Restless League. He is destroying Razan and Nadia&#39;s drug trade in Mara&#39;s Island, he keeps stealing their customers and is distributing skooma at a very high rate. He was also foolish enough to steal from Nadia, Razan&#39;s sister. Zaki is a very troubled spirit. He spends his days selling and doing skooma. He also loves to spend his time around women, and visits the club often for a few shots.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/35_zpsagxyyu2j.jpg[/img]\r<br />Alina - She is a merchant in Mara Central. She sells plenty of fruits and potions.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-29%2019-07-47-72_zpscqfsgols.jpg[/img]\r<br />Lyla - A member of the Northern Fire Tribe. Her whole family was slain by the ruthless tyrant Farid. She hates the Southern Water Tribe. She attends the players private party. She only spawns after you complete certain quests for the Restless League.\r<br />\r<br />Ramzi - Member of the Northern Fire Tribe. Attends the players private party, he is very happy that the player defeated the leader of the Southern Water Tribe.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-29%2019-07-10-97_zpslmbzuhut.jpg[/img]\r<br />Nam - She arrives in Mara&#39;s Island when the player defeats Farid, the leader of the Southern Water Tribe. She has heard many tales about the players achievements and is willing to follow you, after you defeat Farid. Potential Girlfriend.\r<br />\r<br />Selma - Selma is loyal to the Northern Fire Tribe and hates the Southern Water Tribe, because they are responsible for the death of her parents. She is a hardworking merchant. After the player takes over the point and the Southern Refuge, Selma arrives in Mara&#39;s Island. She becomes the main merchant in the pearl.\r<br />\r<br />Rida - She was born in Mara&#39;s Island, she is an orphan, she looks for love and attention. She arrives in the Island after the player defeats Farid.\r<br />\r<br />Jason - A Southern Water Tribe thug, he stole a shipment from Mara. He is hiding in a cave in Mara Central. He is very powerful and controls the underground area in Mara Central. He wants to take over Mara&#39;s Key.\r<br />[size=4][img]http://i81.photobucket.com/albums/j240/infam921/ibt_zpsr83w92q7.jpg[/img]\r<br />Locations\r<br />[/size][img]http://i81.photobucket.com/albums/j240/infam921/MC_zpshh4nzduf.jpg[/img][size=4]\r<br />[/size]\r<br />Mara Central - Mara Central is the center of the Island, where everyone on the Island comes to the market, to get new supplies, others come for entertainment. Mara Central is controlled by the Restless League, the Southern Water Tribe keep assaulting Mara Central, and won&#39;t rest until they conquer the district.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-29%2019-00-56-62_zpsgtjyk6ng.jpg[/img]\r<br />Atlantica - A Small exotic Island near Mara&#39;s Island.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/cc_zpsutox65jy.jpg[/img]\r<br />Mara&#39;s Key - Mara&#39;s Key is where many natives live. It&#39;s also the center of Mara&#39;s Island. The area belonged to the Restless League, but the Southern Water Tribe, keep trying to take control.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/M8_zpsag55bfix.jpg[/img]\r<br />Mara&#39;s Harbor\r<br />A private dock area. Controlled by the Restless League and the Northern Fire Tribe.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/100_zps1efigx6l.jpg[/img]\r<br />The Point - The point is a beautiful location, and it&#39;s where the Northern Fire Tribe originated from. After years of having differences and small disputes the Southern Water Tribe decided to take action and take over the point. The Southern Water Tribe now own the point. It&#39;s up to you, to take it back for the Northern Fire Tribe and the Restless League or join the Southern Water Tribe.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/19_zps9sllowql.jpg[/img]\r<br />Sapphire Beach - One of the most beautiful beaches in Mara&#39;s Island. It&#39;s currently controlled by the Restless League, but gang members die every week defending the beach. The Restless League needs a new hero to help control the area. \r<br />\r<br />The Southern Refuge - This turf belongs to the Southern Water Tribe and it&#39;s where the gang originated from. Tired of looking up and depending on the Restless League and their imports from Hammer fell, they decided to rebel against the hand that fed them, to take control of the land. They got so greedy, that they declared war with them after a former thug, named Farid rose to power and raised a small army.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/sp_zpsvutneipf.jpg[/img]\r<br />South Port - The Southern Port. Where many boats and ships land.\r<br />\r<br />Bamboo Forest - Small Forest covered with bamboos.North Point - This is where many Islanders come to have a good time, go out fishing, socialize, or simply relax by the beaches that surround the point.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/war_zpsgunz7fjj.jpg[/img]\r<br />The Pearl - A beautiful beach, owned by the Southern Water Tribe, The point and the Pearl onced belonged to the Restless League, but a wave of thugs from the Southern Water Tribe went to war with the Restless League, and took over the point and the pearl. located in the North side of Mara&#39;s Island.\r<br />\r<br />Red Wood Cave - A cave in Mara Central. It&#39;s a local hideout for thugs.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/TESV%202015-12-29%2018-51-26-65_zpsjtea1oab.jpg[/img]\r<br />The Castaway Peninsula - It&#39;s a mysterious small Island. After becoming shipwrecked the player wakes up in this location.\r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/pe_zpsmgsvslgx.jpg[/img]\r<br />[size=4]Factions[/size]\r<br />\r<br />The Restless League - The Restless League is a band of pirates. Razan came from Stros M&#39;kai and started her own chapter in Mara&#39;s Island, she brought her customs and culture to the tropical Island. Razan seen that starting the Restless League in Mara&#39;s Island would be of great benefit. The Restless League once ruled Mara&#39;s Island, but they slowly grew careless, and started to party more, while their enemies lurked around in the shadows and grew stronger.\r<br />\r<br />The Southern Water Tribe - The Southern Water Tribe is the most powerful gang in Mara&#39;s Island. They are natives of the land, they are ruthless, vicious and very greedy. They we&#39;re once united with the Northern Fire Tribe and the Restless League, but they grew wicked and greedy. The gang was started by a rebel named Farid. After the Restless League helped them and fed them, the natives of the south wanted more, and got tired of receiving mere crumbs. They wanted the whole pie so they decided to go to war with the Restless League to gain it all.\r<br />\r<br />The Northern Fire Tribe - The Northern Fire Tribe used to be the most powerful gang in Mara&#39;s Island. They are the true natives of Mara&#39;s Island, most of the members of the Southern water tribe are escaped convicts, castaways, rebels and main landers who discover the Island and choose to stay. The Northern Fire Tribe are the forefathers the first gang that was formed in the Island. They are very powerful but lack unity. They have been getting hammered by the Southern Water Tribe, they decided to join the Restless League together they plan on defeating the Southern Water Tribe.\r<br />\r<br />[size=4][img]http://i81.photobucket.com/albums/j240/infam921/pppp_zpsvbzg5h5g.jpg[/img]\r<br />Quests[/size]\r<br />\r<br />2. Disruption\r<br />I have been shipwrecked, I somehow survived. It appears I&#39;m in a tropical rain forest. I was nearly lifeless but a loving spirit took me into her house and healed me. I told her if I could do anything to help her, and she said that the Southern Water Tribe took over the Point. Razan wants it back. I have decided to join the Restless League and take control of the point. To take control of the point I need to take out Jayrod, the High Elf who lead the attack.\r<br />\r<br />2. Joining The Southern Water Tribe (Optional) \r<br />To Join the Southern Water Tribe, you must take out Razan the leader of the Restless League. The Leader of the Southern Water Tribe is hiding in South port. Near the Southern Refuge.\r<br />\r<br />3. Nadia&#39;s Revenge\r<br />I have met Razan&#39;s sister, Nadia. Some thugs from the Southern Water Tribe, have harassed Razan and Nadia, the thugs also stole a big drug shipment. Nadia wants me to retrieve it. The drug dealer is hiding in Mara&#39;s Key.\r<br />\r<br />4. Never Bite The Hand That Feeds You.\r<br />Farid was once a loyal member of the Restless League. Farid grew wicked and decided to bite the hand that fed him and his entire village in the Southern part of the Island. He wanted power, and more riches. He decided to go to war with the Restless League and formed his own gang, the Southern Water Tribe. He has placed a bounty on Razan now. Things are getting hairy in Mara&#39;s Island. I have agreed to take out Farid, as he has gone too far.\r<br />\r<br />5. Private Party\r<br />The Restless League and the Northern Fire Tribe are celebrating in the pearl. Razan told me to attend the party. The main reason they are celebrating is because I killed Farid the leader of the Southern Water Tribe. \r<br />\r<br />6. Mara&#39;s Request\r<br />A Southern Water Tribe drug dealer stole a shipment from Mara, she wants you to retrieve it. The Thief is hiding in Red Wood Cave.\r<br />\r<br />[size=4]Soundtrack[/size]\r<br />Red Rayne made a few tracks for Mara&#39;s Island, he agreed to keep making more tracks for upcoming projects, we also use music from other authors like Vinsdsvept who kindly give permission, thanks you guys.\r<br />[size=4][img]http://i81.photobucket.com/albums/j240/infam921/kjk_zpsbe2mlkbx.jpg[/img]\r<br />Climate[/size]\r<br />Mara&#39;s Island contains it&#39;s own unique climate. The sun begins to rise around 6am. In Skyrim the sun begins to set at around 4pm. That is really low for a tropical Island, so we decided to spice things up and tweak up the climate in Mara&#39;s Island. The sun begins to rise around 4am to be exact at 3:50 am. the sun begins to settle at 7pm and sunset begins at seven twenty. There is a 80 percent chance of clear skies and a fifty percent chance of overcast rain, it rains almost everyday, as Mara&#39;s Island is a tropical Rain forest.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/69_zpslvcoqkkc.jpg[/img]\r<br />[size=4]Note From CyberNetwork[/size]\r<br />We have had fun crafting Mara&#39;s Island and hope you enjoy the mod. We are very happy to share this mod with you. Voice actors are welcomed. - CyberNetwork.\r<br />[size=4][youtube]nh1KZVEfPOc[/youtube]\r<br />\r<br />[/size]Vision/Inspiration\r<br />\r<br />[youtube]sNIlONRIZZE[/youtube]\r<br />[size=4]Permission:[/size]\r<br />Note me and the other mod author&#39;s of this mod have received permission to use certain asset&#39;s from other modders, via chat. I, Nina Sky have spoken directly with MannyGT. You can&#39;t use any of the asset&#39;s used in this mod. you must ask proper permission to the rightful owners. Most of the resources used in the mod are free modder&#39;s resources, and exclusive and limited permission was given.\r<br />[size=4][img]http://i81.photobucket.com/albums/j240/infam921/sss_zps24p4uqar.jpg[/img]\r<br />Compatibility[/size]\r<br />This mod should be compatible with all mods.\r<br />Mara&#39;s Island has it&#39;s own LOD settings.\r<br />Mara&#39;s Island has it&#39;s own climate settings.\r<br />This mod will not cause bugs or ruin your save games.\r<br />No new save game is required.\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/57_zpscygrpmcq.jpg[/img]\r<br />[size=4]Disclaimer [/size]\r<br />This mod is free from copy righted content, We are a modding group and all rights have been reserved, permission has been granted to use the custom asset&#39;s, we have received permission from MannyGT himself via chat. We are working together to create big projects only. We don&#39;t use any asset&#39;s in which we don&#39;t have permission or aren&#39;t free modder&#39;s resource. \r<br />\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/98_zpsdcdtifvk.jpg[/img]\r<br />[size=4]Credits/Hall of Fame[/size]\r<br />\r<br />MannyGT - Modding resources, ruins, buildings etc. (I have spoken with MannyGT personally. Thank you MannyGT.  - CyberNetwork\r<br />CD Projekt & Oaristys- Modding resources\r<br />Ladyonthemoon - Level of detail expert thank you for showing us how to understand and generate LOD.\r<br />Vindsvept - For the custom soundtrck http://vindsvept.com/\r<br />bfadragon - For the resource extra food. Wonderful, thank you.\r<br />CAD345 - For The Airship. Big thanks.\r<br />MuppetPuppet - Modding resources, thank you.\r<br />Tamira - Modding resources, tropical plants, palm trees, flowers, etc\r<br />Stroti - Modding resources, Aladdin&#39;s lamp etc.\r<br />MJY - The Author of the mysterious Island, Modding resources. Thank you MJY.\r<br />Blackflag & Hyperactivechild - Landscape Textures\r<br />Yuril - Various Barrels, modding resources\r<br />Markus Liberty (Tellmann) - for the modelling and texturing Cyrodiil Ship and boat resource \r<br />1shoedpunk - for assisting in merging collisions for the rowboats\r<br />Celtic Decor for Skyrim I by DarkRider \r<br />Wicker Set by Garnet \r<br />edhildil - For the Camel resource, thank you.\r<br />Ghosus - For the custom axe.\r<br />TesTiger - Royal Redguard Armor, Modding resources. Thank you.\r<br />Antony Bellingham\r<br />[img]http://i81.photobucket.com/albums/j240/infam921/41_zpsjopiadth.jpg[/img]\r<br />\r<br />(If you think you belong in the hall of of fame, please let us know, and we will place your name in the hall of fame.)",
  "categoryId": "30",
  "version": "1.5A",
  "author": "Yasmina and Red Rayne The Cyber Network",
  "createdUnix": "1451434339",
  "updatedUnix": "1451427852",
  "containsAdultContent": false,
  "uploadedBy": "CyberNetwork",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000189416",
      "name": "Maras Island",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "218115",
      "fileName": "Maras Island-72273-1-5.rar",
      "uploadedUnix": "1451423304",
      "modVersion": "1.5",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maras%20Island-72273-1-5.rar?fid=1000189416&ttl=1535860792&ri=8192&rs=8192&setec=85eb6f37c91016aa179d41ed79a7a991"
    },
    {
      "fileId": "1000189420",
      "name": "Maras Island Apachii Version",
      "version": "1.5A",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "221866",
      "fileName": "Maras Island Apachii Version-72273-1-5A.rar",
      "uploadedUnix": "1451427852",
      "modVersion": "1.5A",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Maras%20Island%20Apachii%20Version-72273-1-5A.rar?fid=1000189420&ttl=1535860793&ri=8192&rs=8192&setec=d8d0f60de7ba7d669973d5d6587a2974"
    }
  ]
}