{
  "modId": 7245.0,
  "modName": "Specialized Followers",
  "summary": "Gives most of the humanoid followers unique talents.",
  "descriptionHtml": "[font=verdana][center][img]http://img.photobucket.com/albums/v464/sushisquid/specializedfollowers.png[/img][/center]\r<br />[url=http://www.nexusmods.com/skyrimspecialedition/mods/7622/?]Now available for Special Edition[/url]\r<br />\r<br />There are plenty of interesting followers who can join you on your journey. Many of these characters have great personalities when you talk with them, but they leave these behind as soon as combat starts and just fight like anyone else.\r<br />\r<br />What if this didn&#39;t happen? What if followers had unique combat styles to match their unique personalities? What if each follower was specialized and worth using in different situations? I&#39;ve done this. I didn&#39;t cover them all, but I have covered 30 out of the 45 permanent humanoid followers. I think that&#39;s enough.\r<br />\r<br />Also, all of the new perks and spells are named after songs by Chevelle. Because I could.\r<br />\r<br />\r<br />[color=cyan][b]Install[/b][/color]\r<br />Unzip the files into your Data folder and activate the ESP using whatever mod manager you use. My data folder is located in &#34;C:/Program Files x86)/Steam/steamapps/common/skyrim/&#34; and I&#39;d imagine yours is something similar. Make sure to place the included facegen data or Brelyna Maryon&#39;s face skin will lose its blue hue.\r<br />\r<br />This mod is also available from the [url=http://steamcommunity.com/sharedfiles/filedetails/?id=8195]Steam Workshop[/url].\r<br />\r<br />[color=goldenrod]For current saved games,[/color] you will see the new perks and spells given to followers, and using the Resurrect console command will update their outfit if I changed it. However, class and maximum level changed will not update. You must start a new game or simply have never loaded the cell in which the followers exist to see those changes.\r<br />\r<br />I recommend using this with [url=http://skyrim.nexusmods.com/mods/12933]Extensible Follower Framework[/url] to improve your follower experience even more. [color=goldenrod]This will conflict with any other mods you have that change these same followers,[/color] but often simply loading this mod after them will be fine.\r<br />\r<br />The following list is a change log that details things I&#39;ve added, and occasionally a few things I removed. Many followers already had some perks or spells, most of which I didn&#39;t mess with.\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Aela the Huntress[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka F, Stamina S[/color][color=#333333]___[/color][color=lightgreen]Archery S, Light Armor A, One-Handed B, Sneak B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Clones[/b][/color] - Nearby animals are calmed.\r<br />[color=coral][b]Humanoid[/b][/color] - Transform into a werewolf. Lasts for 120 seconds, cooldown 10 minutes.\r<br />[color=#333333]_____[/color][color=lightblue]Aela is a master huntress at one with the wilds. Her beast blood gives her a unique kinship with animals that allows her to walk among them freely, or even to kill them without danger. She can also call upon her bestial nature when needed to transform herself. Hunter players or anyone who appreciates nature will want Aela as an ally.[/color]\r<br />[list][*][size=1]Clones constantly calms all animals within 60 feet of Aela. Stay near her and you can travel without fear of animal attacks. In fact, you can even beat animals to death without much danger.[/size]\r<br />[*][size=1]Humanoid triggers when attacked with low health. As a werewolf, Aela regenerates health. Her attacks in this form will hit everything in front of her and push back what she hits. Claw damage increases with her level.[/size]\r<br />[*][size=1]In order to fix an error that arose when dying in transformation, Aela is now essential.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Ahtar[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Heavy Armor A, Two-Handed A, Archery B, Block B, One-Handed C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Prove To You[/b][/color] - Melee strikes drain 1/5 your level in stamina.\r<br />[color=coral][b]Vitamin R[/b][/color] - Power attacks leave enemies temporarily slowed.\r<br />[color=#333333]_____[/color][color=lightblue]Ahtar is a master of crippling opponents. Every melee attack he makes will drain some stamina from targets, restoring his own energy. Power attacks he delivers will leave enemies temporarily slowed, reducing their ability to fight back. Ranged characters will especially appreciate Ahtar, whose crippling effects make enemies easy targets.[/color]\r<br />[list][*][size=1]The slow effect halves target movement and attack speed for 10 seconds.[/size]\r<br />[*][size=1]Ahtar has also been given Devastating Blow.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Aranea Ienith[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka S, Stamina F[/color][color=#333333]___[/color][color=lightgreen]Destruction A, Restoration A, Alteration B, Conjuration B, Sneak C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Midnight To Midnight[/b][/color] - Foresight provides a 30% chance to automatically dodge hostile damage spells.\r<br />[color=coral][b]Sleep Apnea[/b][/color] - Immune to paralysis and stagger.\r<br />[color=#333333]_____[/color][color=lightblue]Aranea is blessed by Azura with visions of the future, letting her dodge some incoming spells. Her careful meditations have made her immune to disabling effects that might otherwise stop her from her goals. Aranea is a very powerful mage who&#39;s perfectly suited for killing other mages. Players who like Unrelenting Force and Paralysis spells can appreciate the safety of not accidentally applying these effects to Aranea.[/color]\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Belrand[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka B, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Destruction A, Light Armor A, One-handed A, Restoration B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Saferwaters[/b][/color] - Ice spells used on weakened opponents can freeze them solid.\r<br />[color=coral][b]The Clincher[/b][/color] - Waraxe attacks on frozen opponents cause devastating critical damage.\r<br />[size=1]SPELLS[/size]\r<br />[color=springgreen][b]Roswell&#39;s Spell[/b][/color] - For 60 seconds, magicka is constantly damaged, but gain non-elemental magic damage on all attacks.\r<br />[color=#333333]_____[/color][color=lightblue]Belrand is an eccentric and ancient wizard who has spent several lifetimes becoming skilled with his craft. When his magicka runs low, he can use a mysterious power to channel the rest through his weapon, letting him cause magical damage with all weapon strikes. He&#39;s best when combining his talents in axes and ice together.[/color]\r<br />[list][*][size=1]Because Belrand is skilled in Light Armor only, the Heavy Armor has been removed from his outfit.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Borgakh the Steel Heart[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Block A, Heavy Armor A, One-Handed A, Archery B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Tug-O-War[/b][/color] - Damage increases as health drops, up to x2 damage when near death.\r<br />[color=coral][b]Well Enough Alone[/b][/color] - Constant health regeneration.\r<br />[color=#333333]_____[/color][color=lightblue]Borgakh is a blood boiler - an orc soldier trained to channel pain into power. The more wounds she has built up, the more damage she can cause. She shuns healing magic, preferring to rely on her own slow regeneration. This balance between needing pain and wanting to stay alive defines her battle presence.[/color]\r<br />[list][*][size=1]Well Enough Alone restores 2 health every second.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Brelyna Maryon[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka S, Stamina F[/color][color=#333333]___[/color][color=lightgreen]Restoration A, Alteration A, Destruction B, Sneak B, Conjuration C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />SPELLS[/size]\r<br />[color=springgreen][b]Anticipation[/b][/color] - Increases armor rating by 80 points and negates up to 80 points of spell damage or effects for the entire party.\r<br />[color=springgreen][b]Closure[/b][/color] - Heals the party 30 health per second.\r<br />[color=#333333]_____[/color][color=lightblue]Breylna is a master of using magic for defense, both of herself and others. She&#39;s resilient and has spells that let her shield and heal allies regardless of their type. Players who often find themselves in dangerous situations will be glad to have Brelyna.[/color]\r<br />[list][*][size=1]Because she uses Mage Armor, you&#39;ll want to leave her in her default outfit. To compensate, Brelyna&#39;s Warm Boots have 30% frost resistance and Brelyna&#39;s Robes have an enchantment that levels with her. At level 30 they reach full power, providing 25% magic resistance and +150% magicka regeneration.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Cicero[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka C, Stamina A[/color][color=#333333]___[/color][color=lightgreen]One-Handed A, Sneak A, Archery B, Light Armor B, Alteration C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Glimpse Of The Con[/b][/color] - When attacked in melee combat, have a 15% chance to briefly turn ethereal.\r<br />[color=coral][b]Open[/b][/color] - Attacking from an ethereal state causes a devastating critical hit.\r<br />[color=#333333]_____[/color][color=lightblue]Cicero is a master assassin who can use stealth in combat to get enemies to attack his last position, then open them up with deadly counter attacks. The man may be insane, but that doesn&#39;t make him any less effective of a killer.[/color]\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Derkeethus[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health A, Magicka F, Stamina A[/color][color=#333333]___[/color][color=lightgreen]Archery A, Light Armor A, Block B, One-Handed B, Sneak C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Jars[/b][/color] - Arrows have a chance to burst on impact.\r<br />[color=#333333]_____[/color][color=lightblue]Derkeethus the miner has spent a good deal of time testing different minerals and has come up with a compound that has the potential to explode. It doesn&#39;t always work, but when it does, his arrows will burst on impact, causing fire damage and staggering opponents.[/color]\r<br />[list][*][size=1]The chance for Jars to activate is (10+level/2), maxing at 35% at level 50. It causes 40 fire damage and staggers. Jars will have no effect on allies.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Eola[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka B, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Sneak A, Destruction B, Conjuration B, One-Handed B, Alteration C, Light Armor C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]An Evening with El Diablo[/b][/color] - Melee strikes on living creatures drain 1/5 your level in health.\r<br />[color=coral][b]Antisaint[/b][/color] - Nearby allied undead and daedra regenerate health in combat.\r<br />[color=#333333]_____[/color][color=lightblue]Eola is a lover of death. In combat, she constantly emanates an aura that heals non-living allies. When striking living targets, she&#39;ll drink drops of their life with each hit. Eola is best for darker players who like summoning and necromancy, and her aura will heal the player too if you&#39;re a vampire.[/color]\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Erandur[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health A, Magicka C, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Restoration A, One-Handed B, Destruction B, Heavy Armor B, Light Armor B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]To Return[/b][/color] - Attacks with melee weapons banish summoned creatures and destroy raised undead.\r<br />[color=coral][b]Family System[/b][/color] - Nearby allied living creatures regenerate health in combat.\r<br />[color=#333333]_____[/color][color=lightblue]Erandur knows how to deal with the unliving, and will remove any summoned or raised creatures he strikes. In battle, he radiates Mara&#39;s light to heal allies in combat, but this only affects the family of living creatures. Erandur is perfectly designed to fight conjurers and necromancers.[/color]\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Erik the Slayer[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Heavy Armor A, Archery B, Block B, One-Handed B, Two-Handed B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Peer[/b][/color] - Gain a +50% learning bonus to damage when attacking an enemy using the same kind of weapon.\r<br />[color=coral][b]Still Running[/b][/color] - Revive immediately when falling in combat. Activation uses 90 magicka.\r<br />[color=#333333]_____[/color][color=lightblue]Erik is inexperienced, but skilled. His enthusiasm makes him hard to keep down, and he will rise time and again to meet his challenges. Erik is a quick learner, and will pick up tricks from his enemies in combat. He may be a bit green, but no one can match Erik&#39;s tenacity.[/color]\r<br />[list][*][size=1]Peer activates based on weapon type, such as battleaxe, sword, dagger, bow, etc. If the target Erik is striking has at least one copy of a weapon equipped (not necessarily out) and it matches Erik&#39;s weapon type, Peer&#39;s damage bonus activates.[/size]\r<br />[*][size=1]Still Running recovers 100 health as soon as Erik falls to his knees. It uses 90 magicka for activation, which acts as something of a cooldown for it. Erik&#39;s base magicka is 100 and does not increase as he levels. Improving his magicka through potions and enchantments lets him use this more frequently.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Faendal[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka B, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Archery S, Light Armor B, Sneak A, Destruction A, Conjuration B, One-Handed C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Long[/b][/color] - Attacks with bows cause additional non-elemental magical damage equal to 1/5 of the user&#39;s destruction skill.\r<br />[size=1]SPELLS[/size]\r<br />[color=springgreen][b]Highland&#39;s Apparition[/b][/color] - Summons infinite arrows for 180 seconds.\r<br />[color=#333333]_____[/color][color=lightblue]Faendal does not cast traditional spells, but is skilled in a different form of magic. He&#39;s trained to use ancient Bosmer powers that channel through his bow. Each arrow he fires carries a charge, and he can create magical arrows whenever he wills. He&#39;s a skilled hunter capable of silently sneaking up on unaware animals, but this works equally well on anything else. Players who focus on stealth will greatly appreciate Faendal&#39;s affinity for sneaking and ranged combat.[/color]\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Farkas[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Archery C, Block A, Heavy Armor S, One-Handed C, Two-Handed A[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Bend the Bracket[/b][/color] - Blocking with a two-handed weapon reduces damage taken by 50% from any source and direction.\r<br />[color=coral][b]Send the Pain Below[/b][/color] - For 30 seconds, regenerate health, take 25% less damage, and Bend the Bracket provides immunity while blocking. Cooldown 180 seconds.\r<br />[color=#333333]_____[/color][color=lightblue]Farkas uses calm defense to overcome enemies, and can wrap himself in protection when using two-handed weapons. When needed, he clears his mind to bring out his potential. He&#39;s not as strong as his brother Vilkas, but he can outlast nearly anything.[/color]\r<br />[list][*][size=1]Send the Pain Below triggers when under 60% health and attacked in melee combat.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Ghorbash the Iron Hand[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health A, Magicka F, Stamina A[/color][color=#333333]___[/color][color=lightgreen]Archery S, Light Armor A, One-Handed B, Sneak B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Envy[/b][/color] - Blows back enemies. For 60 seconds, take halved damage and do doubled damage. Cooldown 10 minutes.\r<br />[color=#333333]_____[/color][color=lightblue]Ghorbash is a lightly armored archer, but he&#39;s still an orc. When wounded, he can trigger a raging effect to greatly empower his combat abilities. He&#39;s always talented, but this ability lets him take on powerful foes more easily. This makes Ghorbash especially talented for dealing with strong enemies.[/color]\r<br />[list][*][size=1]Envy triggers when under 60% health and attacked in melee combat. It throws nearby enemies and triggers a 60-second effect identical to Berserker Rage.[/size]\r<br />[*][size=1]Because Ghorbash uses Light Armor, his default outfit has been changed to match.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Housecarls[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Heavy Armor A, One-Handed A, Archery B, Block B, Two-Handed C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Arise[/b][/color] - Revives allies that fall below 20% health. Can be used on each ally once every ten minutes. Does not apply to the user.\r<br />[color=coral][b]Same Old Trip[/b][/color] - Bashing has a 30% chance to knock down targets. Chance is 100% when bashing with bows.\r<br />[color=#333333]_____[/color][color=lightblue]The Housecarls are all very competent fighters capable of disabling enemies. They are sworn protectors of their Thane, but they&#39;ll protect all nearby allies with their amazing ability to give a second chance to allies in combat. Players who summon or raise undead will especially appreciate this, but anyone can make use of the added safety.[/color]\r<br />[list][*][size=1]The cooldown for Arise is on each individual. You&#39;ll see it in your active effects, so you can check how long before you can be arisen again.[/size]\r<br />[*][size=1]Every Housecarl has also gained the perks Magic Resistance 1 and Fighting Stance.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Illia[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka S, Stamina F[/color][color=#333333]___[/color][color=lightgreen]Destruction A, Conjuration A, Alteration B, Sneak B, Restoration C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Interlewd[/b][/color] - Transform into a swarm of stinging insects. Lasts for 45 seconds, cooldown 6 minutes.\r<br />[color=coral][b]Prima Donna[/b][/color] - Regenerate health slowly. Can cast using health when low on magicka.\r<br />[color=#333333]_____[/color][color=lightblue]Illia is a reformed witch. She was never a full hag, but she still knows much of their arcane lore. Forgotten powers allow her to pull from her own life to cast spells - a truly dangerous form of magic. In dire moments, she can transform into a swarm of stinging insects to drain life from nearby enemies. Illia is going to make up for past deeds, even if she has to use her forbidden magics to do it.[/color]\r<br />[list][*][size=1]Prima Donna restores 1 health every second, except when transformed. When under 35% magicka and over 35% health, it drains health into magicka at a 2 to 1 ratio. This ability to efficiently use health for casting encourages giving her enchantments and potions that improve health.[/size]\r<br />[*][size=1]I&#39;ve corrected the issue that caused problems with rehiring her. She has also been added to the potential marriage list.[/size]\r<br />[*][size=1]Interlewd triggers when attacked with low health and magicka. While shifted, Illia is immune to all combat damage, but she has 100% weakness to fire and her magicka is ripped away to prevent casting. Her constant stinging poison attack drains 10 health per second from all nearby enemies to restore her. The range increases with her level.[/size]\r<br />[*][size=1]In order to fix an error that arose when dying in transformation, Illia is now essential.[/size]\r<br />[*][size=1]Because she uses Mage Armor, you&#39;ll want to leave her in her default outfit. To compensate, Illia&#39;s Warm Boots have 30% frost resistance and Illia&#39;s Robes are a clothing version of Ancient Nord Armor that have an enchantment that levels with her. At level 30 they reach full power, providing 100 health and 100 armor. My changes to Illia were based off of Morrigan from Dragon Age, so ideally you should use [url=http://skyrim.nexusmods.com/downloads/file.php?id=1920]Ancient Morrigan Armor[/url]. [color=goldenrod]This is featured in the screenshot.[/color][/size]\r<br />[*][size=1]Illia&#39;s appearance has been modified.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]J&#39;zargo[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka A, Stamina C[/color][color=#333333]___[/color][color=lightgreen]Destruction A, Light Armor A, Resoration B, Sneak B, One-Handed C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Wonder What&#39;s Next[/b][/color] - Firebolt weakens enemies to frost. Ice Spike weakens enemies to shock. Lightning Bolt weakens enemies to fire.\r<br />[color=coral][b]Skeptic[/b][/color] - Take 30% less damage from fire, frost, and shock spells.\r<br />[color=#333333]_____[/color][color=lightblue]J&#39;zargo has trained in quick and efficient elemental strikes. Each spell temporarily weakens targets to his follow-up hits, making his spell combos better than the sum of their parts. He&#39;s very confident in his own abilities, but oddly, his doubt about the abilities of others actually leads them to perform more poorly when fighting him, making him resistant to enemy magic.[/color]\r<br />[list][*][size=1]The weakness effect is 50% for 8 seconds. This stacks on other resistances and weaknesses (including itself) multiplicatively. Because it&#39;s weakening the enemy rather than empowering J&#39;zargo, you can make use of his weakness effects on your attacks. In combat, J&#39;zargo will rarely make use of the stacking. Instead he often switches spells rapidly to achieve the maximum damage from his combos.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Jenassa[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka C, Stamina A[/color][color=#333333]___[/color][color=lightgreen]One-Handed A, Light Armor A, Sneak A, Archery B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Dos[/b][/color] - Dual wielding daggers provides a 25% chance of a critical hit with each weapon.\r<br />[color=coral][b]A New Momentum[/b][/color] - Repeated melee attacks increase in speed with each hit.\r<br />[size=1]SPELLS[/size]\r<br />[color=springgreen][b]Letter From A Thief[/b][/color] - Disappear to briefly escape combat and recover.\r<br />[color=#333333]_____[/color][color=lightblue]Jenassa is a nimble dual-weapon fighter. Though fragile, her incredible speed and precision make her very deadly. If she gets into trouble, she can disappear and escape from combat to recover. Her quick guerilla strikes make her a hard target to pin down.[/color]\r<br />[list][*][size=1]A New Momentum&#39;s speed boost is 15% for 4 seconds. It builds up with each hit she performs on either hand, but as with all attack speed boosts, only increases the speed of her main hand strikes. In combat, Jenassa will often favor making repeated off-hand attacks, then she&#39;ll suddenly flip out and do like 4 main-hand strikes in a split second.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Kharjo[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Heavy Armor A, One-Handed A, Sneak A, Archery C, Block C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]The Gist[/b][/color] - Can sense nearby creatures when sneaking.\r<br />[color=#333333]_____[/color][color=lightblue]Kharjo is a capable warrior, but he understands the value of stealth. His soft fur lets him move silently even in bulky armor, and he can keep himself hidden well. His strong sense of smell lets him locate targets to let allies know their positions. Players who strongly value stealth will find no better ally than Kharjo.[/color]\r<br />[list][*][size=1]The Gist gives you constant detection of all creatures out to 100 feet when you are within 40 feet of Kharjo. You must be sneaking for it to to be active.[/size]\r<br />[*][size=1]Kharjo has also been given the perks Silence and Stealth rank 1.[/size]\r<br />[*][size=1]If Kharjo is your follower, [b]do not enter sneak mode during a brawl[/b]. This will force real combat.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Marcurio[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka S, Stamina F[/color][color=#333333]___[/color][color=lightgreen]Destruction A, Restoration A, Alteration B, Sneak B, Conjuration C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Face to the Floor[/b][/color] - Shock spells have a 5% chance to briefly paralyze.\r<br />[color=coral][b]Another Know It All[/b][/color] - Provides a 20% chance to absorb hostile spells.\r<br />[size=1]SPELLS[/size]\r<br />[color=springgreen][b]Blank Earth[/b][/color] - Throws a windstorm forward that causes light shock damage.\r<br />[color=#333333]_____[/color][color=lightblue]Marcurio is forceful mage. His lightning has a chance to knock enemies down, and he can generate powerful gusts of wind that can stagger enemies. Whether he&#39;s just confident or arrogant, he&#39;s certainly justified. He&#39;ll occasionally overpower enemy mages and absorb hostile spells. Few can match the raw power that Marcurio wields, and that&#39;s probably a good thing for the rest of us.[/color]\r<br />[list][*][size=1]Blank Earth has a long charge time and is costly to use, but if Marcurio decides to start using the spell in both hands... well, enemies don&#39;t move a whole lot.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Mjoll the Lioness[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Heavy Armor A, Two-Handed A, Archery B, Block B, One-Handed C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]PERKS[/size]\r<br />[color=coral][b]Until You&#39;re Reformed[/b][/color] - All weapon attacks have a 5% chance to cause Calm for 5 seconds.\r<br />[color=coral][b]The Meddler[/b][/color] - Weakens nearby enemies to damage.\r<br />[color=#333333]_____[/color][color=lightblue]Mjoll is on a mission to purge the world of evil. Her attacks have a chance to briefly break targets out of combat, and her crusading spirit weakens all evil around her. Her ability to weaken everything and break up groups makes Mjoll best against large groups of enemies, but combat players will always enjoy causing extra damage to enemies when Mjoll is with them.[/color]\r<br />[list][*][size=1]The Meddler reduces the armor of hostile targets in 100 feet by 100 points. It can reduce armor to negative values, so you&#39;ll always see the full benefit. It only affects hostiles, so targets that are calmed will lose this weakness.[/size]\r<br />[*][size=1]Mjoll&#39;s outfit no longer has some unenchanted ring included for no reason, so she will now wear whatever ring you give her.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Onmund[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health B, Magicka A, Stamina C[/color][color=#333333]___[/color][color=lightgreen]Destruction A, Illusion A, Heavy Armor B, One-Handed B, Restoration C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Brainiac[/b][/color] - All spells are 50% stronger while using a staff.\r<br />[color=#333333]_____[/color][color=lightblue]Onmund is a brilliant student. While he lacks the talent and experience to cast powerful spells himself, he still has a good understanding of the mechanics of magic. When using a staff, he can channel power through it, not only enabling him to cast spells he doesn&#39;t otherwise know, but empowering everything he does. Onmund&#39;s unique scholarly pursuits make him excellent for players who can afford to provide him the supplies he needs.[/color]\r<br />[list][*][size=1]Onmund has lost Augment Shock 1, Chain Lightning, and Lightning Bolt. He has gained Flames, Frostbite, and Sparks. This gives him very weak magical options for attack, which encourages him to use staves as much as possible, making for a more unique style of character. Whenever a staff is equipped, all of Onmund&#39;s spells (including those cast from staves) gain +50% duration and magnitude. This makes him potentially very powerful, but only if you seek out better staves and keep them charged for him to use.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Stenvar[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Heavy Armor A, Archery B, Block B, One-Handed B, Two-Handed B[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Piñata[/b][/color] - Heightened pain tolerance provides 20% reduction to all damage taken.\r<br />[color=coral][b]Indifference[/b][/color] - Battle training gives all weapons +20% critical hit chance.\r<br />[color=#333333]_____[/color][color=lightblue]Stenvar has seen plenty of combat, and has become accustomed to pain. In his long years of battle he&#39;s learned how to use just about anything as a weapon. He doesn&#39;t partcularly care what it is as long as it kills things. He doesn&#39;t use fancy tricks to win battles. This well-honed killing machine just fights harder than his enemies, and that&#39;s always been enough.[/color]\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Sven[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health A, Magicka F, Stamina A[/color][color=#333333]___[/color][color=lightgreen]Illusion A, Speech A, Light Armor B, One-Handed B, Block C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />[b]PERKS[/b][/size]\r<br />[color=coral][b]Ruse[/b][/color] - All weapon attacks have a 5% chance to cause Fear for 3 seconds.\r<br />[color=coral][b]Comfortable Liar[/b][/color] - Adds one third of Speech skill to the maximum level of all Illusion spells.\r<br />[size=1][b]SPELLS[/b][/size]\r<br />[color=springgreen][b]Forfeit[/b][/color] - Calm enemies within 40 feet up to level 10.\r<br />[color=springgreen][b]Shameful Metaphors[/b][/color] - Causes mental damage and fury in 15 feet, up to level 10.\r<br />[color=#333333]_____[/color][color=lightblue]Sven is a braggart and a liar, and I wanted this to show with abilities that mess with his enemies&#39; minds. He can convince targets their wounds are more dangerous than they really are, slip out of battle when wounded, or even turn his enemies against each other by throwing his voice with nasty comments. Sven is extremely useful when fighting enemies receptive to Illusion magic.[/color]\r<br />\r<br />\r<br />[size=5][color=darkkhaki][b]Vilkas[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health S, Magicka F, Stamina B[/color][color=#333333]___[/color][color=lightgreen]Archery B, Block B, Heavy Armor A, One-Handed C, Two-Handed S[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Revenge[/b][/color] - When struck in melee combat, instantly counter attack 20% of damage taken.\r<br />[color=coral][b]The Red[/b][/color] - For 30 seconds, regenerate health, cause 25% more damage, and Revenge power rises to 100%. Cooldown 180 seconds.\r<br />[color=#333333]_____[/color][color=lightblue]Vilkas uses his anger in battle, and automatically counter attacks every melee attack that hits him. When needed, he unleashes his rage, focusing his mind on nothing beyond the kill. He isn&#39;t as tough as his brother Farkas, but he&#39;ll end battles quickly, win or lose.[/color]\r<br />[list][*][size=1]The Red triggers when under 60% health and attacked in melee combat.[/size]\r<br />[/list]\r<br />\r<br />[size=5][color=darkkhaki][b]Vorstag[/b][/color][/size][size=1][color=#333333]___[/color][color=peachpuff]Health A, Magicka F, Stamina A[/color][color=#333333]___[/color][color=lightgreen]One-Handed A, Block A, Two-Handed B, Archery B, Sneak C[/color][color=#333333]___[/color][color=lightblue]Max level 50[/color]\r<br />PERKS[/size]\r<br />[color=coral][b]Hats Off to the Bull[/b][/color] - When unarmored, gain 15 points of armor for every 5 levels of Block skill.\r<br />[color=coral][b]Grab Thy Hand[/b][/color] - When blocking with a One-Handed weapon, gain a 30% chance to stop incoming combat damage.\r<br />[color=coral][b]Point #1[/b][/color] - When using a One-Handed weapon and an open left hand, gain +10% chance of causing devastating critical damage.\r<br />[color=#333333]_____[/color][color=lightblue]Vorstag is an incredibly talented duelist. Rather than use fancy things like spells or even armor, the man fights with nothing but a single weapon. His mastery of this stlye uses unfettered movement to defend and attack, making him surprisingly hard to kill. Players who want an ally as deadly as he is durable will appreciate Vorstag.[/color]\r<br />[list][*][size=1]Because he needs to remain unarmored, you should leave him in his default outfit. To compensate, Vorstag&#39;s Warm Boots have 30% frost resistance and Vorstag&#39;s Clothes have an enchantment that levels with him. At level 30 they reach full power, providing 100% poison resistance and +150% stamina regeneration rate.[/size]\r<br />[/list][/font]\r<br />\r<br />[right][img]http://img.photobucket.com/albums/v464/sushisquid/argorcajiit.png[/img][/right]",
  "categoryId": "66",
  "version": "1.01.2",
  "author": "Kevin Kidder",
  "createdUnix": "1327789769",
  "updatedUnix": "1344500412",
  "containsAdultContent": false,
  "uploadedBy": "sushisquid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23792",
      "name": "SpecializedFollowers09",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "SpecializedFollowers09-7245.zip",
      "uploadedUnix": "1327789843",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/b9a31ad3d6b974ebac51473add7fa50118a96be5b3e19007b7ae4e43f24f10ed/analysis/1406642616/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpecializedFollowers09-7245.zip?fid=23792&ttl=1535765172&ri=8192&rs=8192&setec=1982e3d4078cd7ff210279666a683380"
    },
    {
      "fileId": "24205",
      "name": "SpecializedFollowers091",
      "version": "0.91",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "SpecializedFollowers091-7245.zip",
      "uploadedUnix": "1327897212",
      "modVersion": "0.91",
      "virusScanUrl": "https://www.virustotal.com/file/b58795b38948e902ba2765456e785576c7e8892a8d0bd199d310d14f81d8886b/analysis/1406644683/",
      "changelogHtml": " Changed follower auras (Aela, Eola, Erandur, Housecarls, Kharjo, Mjoll) so they don\\'t conflict with brawls.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpecializedFollowers091-7245.zip?fid=24205&ttl=1535765172&ri=8192&rs=8192&setec=84c5030fcd4ffad393999f0a18ec8271"
    },
    {
      "fileId": "24534",
      "name": "SpecializedFollowers095",
      "version": "0.95",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22",
      "fileName": "SpecializedFollowers095-7245.zip",
      "uploadedUnix": "1327984798",
      "modVersion": "0.95",
      "virusScanUrl": "https://www.virustotal.com/file/b39c31c8554f679d66002a2f1c0cac88b11261295cfb2587a5caef085369c08b/analysis/1406646366/",
      "changelogHtml": " File structure changed to make compatibility patches simpler. <br/> \n Ghorbash the Iron Hand\\'s name has been corrected. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpecializedFollowers095-7245.zip?fid=24534&ttl=1535765173&ri=8192&rs=8192&setec=1d2541178c969c394cea316ca1f919eb"
    },
    {
      "fileId": "27241",
      "name": "SpecializedFollowers10",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "175",
      "fileName": "SpecializedFollowers10-7245.zip",
      "uploadedUnix": "1328728113",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6d70f6b52114919dc075155c445fe3a723079ee1536ae124c324b7b16af16bb3/analysis/1406661621/",
      "changelogHtml": " File structure changed back because it wasn\\'t necessary to change in the first place. <br/> \n Aela and Illia have learned their new transformations. <br/> \n Illia has a new appearance. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpecializedFollowers10-7245.zip?fid=27241&ttl=1535765173&ri=8192&rs=8192&setec=390ab532a675bdee0dcfc07c5fdd70ff"
    },
    {
      "fileId": "27663",
      "name": "specializedfollowers101",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "172",
      "fileName": "specializedfollowers101-7245-1-01.zip",
      "uploadedUnix": "1328782676",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/a2d8d08e2b4f4785b19553274a07bd34d9c47828ed9658e8b1cc9f4c5fd49905/analysis/1406663765/",
      "changelogHtml": " In order to prevent a potential problem, Aela and Illia now become momentarily invincible while transforming. <br/> \n Light Foot has been added to all affected companions. <br/> \n Now uses BSA file like the Steam Workshop version. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/specializedfollowers101-7245-1-01.zip?fid=27663&ttl=1535765174&ri=8192&rs=8192&setec=5ea2b15c54f6459ac77ef4fb32cac960"
    },
    {
      "fileId": "77551",
      "name": "SpecializedFollowers1011",
      "version": "1.01.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "173",
      "fileName": "SpecializedFollowers1011-7245-1-01-1.zip",
      "uploadedUnix": "1343618528",
      "modVersion": "1.01.1",
      "virusScanUrl": "https://www.virustotal.com/file/9ae04ab3d3fe7f47a85bac0a082d624faec0af25872437389192624b4931b50e/analysis/1407056583/",
      "changelogHtml": " Anticipation, Antisaint, Arise, Closure, and Family System no longer affect calmed targets. <br/> \n Arise cooldown dropped from 15 to 10 minutes. <br/> \n The Gist no longer stops working if you\\'re currently under Arise\\'s cooldown. <br/> \n Kharjo no longer reveals his own locaiton with The Gist. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpecializedFollowers1011-7245-1-01-1.zip?fid=77551&ttl=1535765174&ri=8192&rs=8192&setec=579dd37782efb4273b6ec5d9d0dd4c53"
    },
    {
      "fileId": "79986",
      "name": "SpecializedFollowers1012",
      "version": "1.01.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "173",
      "fileName": "SpecializedFollowers1012-7245-1-01-2.zip",
      "uploadedUnix": "1344500412",
      "modVersion": "1.01.2",
      "virusScanUrl": "https://www.virustotal.com/file/faa51962a1c2cb85ca2b918991eb053e16a94e28349b7352430e1872f08d64ef/analysis/1407082084/",
      "changelogHtml": " All allies with AoE spells were given special non-hostile versions of them to make them safer to use around other friendly targets. <br/> \n Eola\\'s spells were all moved to her left hand. She should act more like a spellsword now. <br/> \n General clean-up done on the file. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SpecializedFollowers1012-7245-1-01-2.zip?fid=79986&ttl=1535765175&ri=8192&rs=8192&setec=faf9db4d61df80ac09e3f0d9000c2930"
    }
  ]
}