{
  "modId": 7257.0,
  "modName": "Arthurs Menethil Start - Arthas Parody",
  "summary": "A saved file start for a parody of Arthas Menethil, the Lich King from Warcraft. The character is from Warcraft, copyrights blah blah blah. It\\'s a parody. Use recommended mods to increase playing experience.",
  "descriptionHtml": "This is a saved file which skips the annoyingly long prison quest at the start, and adds spell tomes for basic undead raising for those people who want to play a summoner. Spell Tomes in question are from Be A Better Mage by Concept83.\r\n\r\nStoryline:\r\n\r\nOk, what in the blue hell just happened?\r\n\r\nOne moment I lay dying in the hands of my obviously dead father, screwed by a bunch of level 80 fat neckbeards who obviously play too much online games. \r\n\r\nSo I died. Game over. End of story. Fade to black screen and let title credits roll please.\r\n\r\nNext thing I know, some neckbeard literally, LITERALLY walloped me over the head with an ugly stick. What happened next was really confusing. They put me in a cart with a duo of psychopaths babbling about people I know NOTHING about. The only thing I can agree with is the yellow-maned one\\'s point about those \\\"damned elves\\\". Oh you don\\'t know the stuff I\\'ve been put through by them, brother.\r\n\r\nThen suddenly, everyone, EVERYONE\\'S screaming their heads off about dragons. Pfft, bunch of women. In Northrend, I see them all the time. And, I keep an undead one as a pet. How do you like that?\r\n\r\nTo cut a long story short, I followed the polite soldier who was about to execute me for no reason at all, and after many trials and tribulations, he invited me over to his house for a cup of tea.\r\n\r\nWell, I am grateful for him returning me my sword. Maybe I\\'ll let him be a Death Knight when I get back to Northrend. Though it feels like a cheap 60 Gold imitation now. \r\n\r\nAnd either me dying or that wallop on the back of my head truly did a number or something, but I don\\'t feel as powerful as I used to be. It feels like when I first met that... that annoying vampire... What was his name again? I forgot.\r\n\r\nLuckily, as the ruler of the undead, I wrote some books on the subject.\r\n\r\nRight now, I\\'m standing in front of Hadvar\\'s town. Should I accept his invitation for tea? I should really be trying to get back home. I have minions to play Guitar Master with, a Necromancer turned Lich to be bored to death by, a Frost Wyrm to feed. Or should I just kill everyone I see and raise them as minions so they can draw my carriage back home?\r\n\r\nDecisions, decisions.\r\n\r\nRecommended Mods \r\nBe A Better Mage with Unique Spells by Concept83 (For the \\\"undead\\\" summons)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5283\r\n\r\nFrostmourne with and without scabbard by Jojjo by jojjo\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6348\r\n\r\nFrostmourne with Frost emanation effect by Elixiir\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6031\r\n\r\nIncreased Summoning Limit by foram\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1022\r\n\r\n",
  "categoryId": "43",
  "version": "1",
  "author": "Kid Taylor",
  "createdUnix": "1327799830",
  "updatedUnix": "1327799830",
  "containsAdultContent": false,
  "uploadedBy": "Kidtaylorx3",
  "primaryFile": null,
  "files": []
}