{
  "modId": 72587.0,
  "modName": "MissaNigra inimicos",
  "summary": "Мод расширяет большинство веток навыков, добавляя новые перки и меняя старые. На получение многих навыков установлены дополнительные условия. Вы не сможете встав у горна прокачать своего пе",
  "descriptionHtml": "- Замедлена скорость прокачки всех навыков в игре на 30-70%, в зависимости от созвездий навыков.\r<br />- Изменено большинство веток перков, добавлены новые. Добавлена масса новых способностей расширяющих геймплей.\r<br />- Магические скилы динамически увеличивают силу и продолжительность заклинаний. Чем выше ваш уровень прокачки скила, тем мощнее заклинания, длятся дольше или дают какие либо еще бонусы.\r<br />- Убрано ограничение по росту навыка во всех ветках перков.\r<br />- Кузнечное дело для получения большинства перков требует прохождения определенных квестов.\r<br />- В плавильне можно переплавлять в слитки практически все железяки, золото, тарелки и т.д.\r<br />- Добавлены условия на получение перков и в другие ветки. Большая часть не квестовые.\r<br />- Добавлено по 1000 монет каждому торговцу в игре, а суммы торговцев едой и трактирщиков увеличены втрое.\r<br />- В игру добавлены высоколевельные противники люди. На высоких уровнях появляются новые персонажи: Висельники, Садисты и прочее...\r<br />- Изменены все бандиты, драугры, вампиры и маги, став более жесткими противниками.\r<br />- Изменены Драугры. Получив максимальную сопротивляемость к холоду они стали более уязвимы к огню.\r<br />- Изменены все животные в игре. Увеличено здоровье и наносимый ими урон.\r<br />- Изменены драконьи жрецы и маски. Жрецы стали сильнее, а маски интереснее.\r<br />- Каждому именному жрецу добавлен том призыва. Когда убьете его сможете его призвать в помощь раз в день.\r<br />- Все живые существа в игре восстанавливают здоровье(люди, драконы, великаны, олени и т.д.)&#33; Вся нежить этого делать не может.\r<br />- Увеличен урон ловушек, но не до безумных величин. Они стали реально опасны для жизни, но есть шанс и уцелеть.\r<br />- Замки на сундуках стало сложнее взламывать.\r<br />- С большинства артефактов можно снимать зачарования и накладывать их по новой. Зачарования с масок только на обручи, с амулетов богов только на ожерелья.\r<br />- Из игры убраны ингридиенты влияющие на навык Зачарование и Кузнечное дело. Зелья зачарований и кузнеца можно только найти или купить.\r<br />- Все навыки стартуют с уровня 5, не считая расовых бонусов (Соответственно 10 и 15 ед.)\r<br />- Изменен урон оружия и защита брони в том числе и у заклинаний в Изменении.\r<br />- В Алхимии появилась масса новых ингридиентов которые можно снимать с животных или создавать самому. Количество ингридиентов с животных, великанов и прочей живности меняется случайным образом. Добытые слитки, камни, черепа и прочее можно дробить или растворять на ингридиенты.\r<br />- Добавлены новые рецепты еды и зелий.\r<br />- Добавлена возможность крафта свитков и Экстрактор для создания экстрактов и порошков. Для этого необходимо купить книгу Чертежи и создать их в кузнице. Из растений можно создавать экстракты с усиленными свойствами.\r<br />- Даэдрические артефакты можно перековать в кузнице атронахов. Для этого нужен сигильский камень и книга &#34;Артефакты Даэдра&#34;. Купить можно у Финиса Гестора(после того как пройдете ритуальный квест).\r<br />- Добавлен новый класс зачарованного оружия - отравленное.\r<br />Перечислены далеко не все изменения, только то, что смог вспомнить на вскидку Если вам слишком тяжело играть и вы очень быстро умираете, рекомендую снизить сложность в настройках игры.",
  "categoryId": "79",
  "version": "3.2.1",
  "author": "ceil100",
  "createdUnix": "1452488737",
  "updatedUnix": "1460648119",
  "containsAdultContent": false,
  "uploadedBy": "ceil100",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000203113",
      "name": "MissaNigra inimicos",
      "version": "3.2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6550",
      "fileName": "MissaNigra inimicos-72587-3-2-1.7z",
      "uploadedUnix": "1460648119",
      "modVersion": "3.2.1",
      "virusScanUrl": "https://www.virustotal.com/file/83fa7c3869af21eb8c401df4bf356b891ea57e0c0fa3b9067cb42c74b0cab18c/analysis/1460648166/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MissaNigra%20inimicos-72587-3-2-1.7z?fid=1000203113&ttl=1535861139&ri=8192&rs=8192&setec=85b4627bf773348ce318f8ee666657be"
    }
  ]
}