{
  "modId": 72601.0,
  "modName": "Fixed Drunkenhuntsman",
  "summary": "For players with OCD only.",
  "descriptionHtml": "Some might look at this and think &#34;this has to be the most pathetic and unrequested mod that no one was waiting for&#34;. I won&#39;t disagree, but \r<br />if you have OCD, like me, and have problems immersing yourself when there&#39;s holes in the ground and you&#39;re clipping through the floor as the food bounces around and eventually hits hit the floor, this is the mod for you. Like the majority of my mods, I never intended to release this, since it was just a personal mod, but hey, there must be ONE person who will appreciate it. And that&#39;s enough for me to upload it to the nexus. I will eventually fix Whiterun, which has huge problems. But that will take some time. \r<br />\r<br />\r<br />Also, for those wondering, are these images representative of all the things you fixed? NO. I fixed over a HUNDRED things, from the walls clipping through the floor, the doors clipping through the walls and not positioned correctly to simple things such as the fire wood, which had clipping issues. I&#39;ve also fixed path finding so NPCs lo longer stumble onto objects, food and doors. Obviously I won&#39;t take screenshots of everything I fixed, because that&#39;s just way too boring for my blood.",
  "categoryId": "95",
  "version": "1",
  "author": "DDVIL",
  "createdUnix": "1452566035",
  "updatedUnix": "1452566019",
  "containsAdultContent": false,
  "uploadedBy": "DDVIL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000191031",
      "name": "DrunkenHuntsmanFIX",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "DrunkenHuntsmanFIX-72601-1.rar",
      "uploadedUnix": "1452566019",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/18192e50d83d0b6bd56c71d13347c01dd9c08d2ea20e081ea32bbf411f888a5f/analysis/1452694327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DrunkenHuntsmanFIX-72601-1.rar?fid=1000191031&ttl=1535861158&ri=8192&rs=8192&setec=e225fb74db93724b767c4552d602c003"
    }
  ]
}