{
  "modId": 72622.0,
  "modName": "Katy hates fine hats (and now also other hats)-- fine hats to circlets",
  "summary": "Very simple .esp that makes all fine hats show up on characters/NPCs as circlets. Because fine hats are fugly as sin. New in v1.1, files that replace the merchant and farm hats with custom assets from ZZJay.",
  "descriptionHtml": "[b][size=3]This file is mostly (almost entirely) made obsolete by my newer mod, [url=http://www.nexusmods.com/skyrim/mods/73301/?]Katy&#39;s Un-derpified Nobles and Traders[/url]. But that mod does much, much more stuff, so for people who just want the quick and simple fixes, don&#39;t want my other mod but just (as we all should) hate fine hats, I&#39;m leaving these up. Also, this mod contains 2 files-- NoMoreUglyFineHats and Farmhat02replacer-- which are NOT included in the big mod or its optionals, so up it stays. Enjoy, redistribute, plagiarize, I don&#39;t really care what you do with it AS LONG AS IT NEVER GOES ANYWHERE NEAR THE WORKSHOP, that&#39;s my only rule, please respect it. I do check out the Workshop occasionally and will be SERIOUSLY PISSED if I see anything of mine there. Any foreign sites/LL/etc. are welcome to consider it an open modder&#39;s resource. Credit is appreciated.[/size][/b]\r<br />\r<br />The fine hats in Skyrim are lame. They just are. They&#39;re ugly, they don&#39;t go with anything, and if you use an NPC overhaul that gives custom hair to NPCs, they make that beautiful hair invisible. Which is extra fugly on females. I usually just make mods and patches for personal use that really would only work for me and my load order, but this one&#39;s so simple and doesn&#39;t need anything else, I thought maybe someone else could use it. \r<br />\r<br />[b][u]FineHatsToCirclets.esp--[/u][/b]\r<br />It makes all fine hats look like gold and emerald circlets. Works for beast races too. Only the appearance and the name are changed-- now it&#39;s a &#34;fine circlet&#34;-- it&#39;s got the same keywords as a fine hat (not treated as jewelry), the same value as a fine hat, same weight, same data all around. This way I didn&#39;t change any &#34;outfits&#34;, for compatibility, and any NPCs added by mods that would normally wear a fine hat will still benefit from the mod. And it won&#39;t unbalance anything by flooding the world with more valuable jewelry (no cheats or extra reasons to kill snooty nobles here). If you use any mesh/texture replacer for circlets it&#39;ll use that (I think, unless it does it in some weird way-- simple replacers will definitely work).\r<br />[u]\r<br />[b]NoMoreUglyFineHats2.esp--[/b][/u]\r<br />Removes the fine hats from all vanilla &#34;outfits&#34; they were in before. This will work for people who hate gold and emerald circlets, but it will (probably) need a patch to be compatible with anything else that alters the fine clothes outfits, and the fugly fine hats will still show up in game and on any NPC who gets it from a leveled list (not a vanilla outfit). So that would mostly include NPCs added by mods, I guess. I could add the option to take them out of the fineclothes leveled list but I&#39;m not sure how compatible that&#39;ll be, and since this is a mod for beginners I wouldn&#39;t want it to require a bashed patch to work.\r<br />\r<br />[b][u]MerchantHatReplacer.esp--[/u][/b] (NEW in v1.1)\r<br />Another piece of the clothing overhaul I&#39;m working on I decided to release early/standalone because I&#39;m busy and the big mod is taking forever with permissions and tweaks. This replaces the Merchanthat (the one that looks like the finehat without the triangle floppy thing) with a model from ZZjay&#39;s wardrobe (which he/she was awesome enough to give me permissions for already for the big mod), the &#34;huntress hat&#34;, and yes it looks fine on males, see screens. It&#39;s classified as a circlet so doesn&#39;t hide hair, but has the same keywords/name/data as the original Merchanthat, very much like FineHatsToCirclets.esp. I like this specifically because it doesn&#39;t hide hair, but if you use a bunch of anime hairstyles on your NPCs or they have big fat ponytails or something there WILL be some occasional clipping, this is unavoidable but I still think it&#39;s preferable to hiding hair and since this is not a model that&#39;s used a WHOLE bunch, it&#39;s unlikely to happen. Because it sits pretty high up, it doesn&#39;t clip with much. It will not clip with ANY vanilla hairs that I know of (except the elf pigtail thing).\r<br />\r<br />[b][u]FarmHatReplacer.esp and FarmHat02Replacer.esp--[/u][/b] (NEW in v1.1)\r<br />Same as above, but this replaces farmhat01 (ugly windsock looking hat) and farmhat02 (the hat the courier wears). This is a modified mesh without the feather. I&#39;ve split this into 2 .esps-- the first one replaces the windsock one, the second replaces the other one. FarmHat02Replacer.esp requires the other one as a master because I figured NO ONE would want to keep the windsock and it didn&#39;t warrant a separate mod. I split them up in case you don&#39;t hate farmhat02 OR you feel like the models are too common, which brings me to my warning. A LOT OF NPCS USE THESE MODELS (including some old people). YOU WILL SEE THEM [u]OFTEN[/u] IF YOU USE BOTH .ESPS. This is BY DESIGN, because I wanted to see more of ZZJay&#39;s awesome model (the merchanthat model is only used by a few vanilla NPCs, the only one I can think of off the top of my head is Angeline Morrard) and because these hats annoy the crap out of me. Personally, it doesn&#39;t bother me, I think the new models are more realistic than the game&#39;s (not to mention way better looking). I&#39;m not sure how this will work out since they are much more common and the models clip with some custom hair, but check it out and give me some feedback, I might change out which things it replaces.\r<br />\r<br /> ****About the 2 new files- Some extraneous files I haven&#39;t cleaned up yet will overwrite but don&#39;t worry about it, everything works fine in game, the important stuff is all compatible, merchant hats have the feather and farm hats don&#39;t. It doesn&#39;t matter which one you let overwrite, none of those files matter. I will clean both of these up but for right now trying to get rid of the extra stuff keeps breaking things for some unknown reason (by &#34;clean&#34; I don&#39;t mean TES5Edit, both are 100% squeaky clean of ITMs, but the files have some textures and meshes that aren&#39;t actually used by the .esp).\r<br />\r<br />[b][u]Compatibility/Merging--[/u][/b]\r<br />The [s]two[/s] four are 100% compatible. For maximum de-derpification/de-headgearination of nobles/others, you can use [s]both[/s] them all. You&#39;ll mostly see no headgear (on nobles), but if anyone does get a fine hat, it&#39;ll show up as a circlet. There&#39;s no conflict, so they can be merged in about 5 seconds in TES5Edit to save the .esp count, but if anyone asks reeeeeeally nicely I guess I&#39;ll do it for you and put it up. I chose to use an .esp for the replacers solely so I could rename them, and they look right in the inventory menu and when dropped, gives a little visual consistency which I&#39;m anal about. If you find a compatibility issue with another mod let me know, so far I don&#39;t know of any.\r<br />\r<br />Hope yall like it. Mod authors tend to forget not every mod USER is a mod MAKER, some people don&#39;t know how to do this stuff yet, so this is for them. A grand total of FIVE records have been changed between both .esps.... Requires no DLC, no mods, no nothing, as simple as it gets.\r<br />\r<br />Lol someone put me in a video, awwwww.... I&#39;m at the very end, about 10:10, for like 20 seconds. But hey, it&#39;s a teeny tiny mod-- he bothered to make the video, I have to bother to link it (plus I love his accent). Like it. Do it. \r<br />(uh, he seems to love HDT and bikinis so possibly NSFW-- I mean MY FILE is... but I have no control over men in general, I damn sure didn&#39;t make the spotlight.)\r<br />[youtube]yNqVxvxsCdY[/youtube]\r<br />\r<br />For further de-derpification, you can use a fine clothes replacer. Because they look like horse blankets--\r<br />http://www.nexusmods.com/skyrim/mods/63634/? Noblesse Oblige-- Changes male and female models but the dresses clip with a lot of custom hair. If you get this be sure to grab Noble Dress as well (linked in the page) to avoid a missing texture around the top of the dress.\r<br />http://www.nexusmods.com/skyrim/mods/35125/? Maid Outfits (zzjay and grace darkling) Changes female models only\r<br />[s]\r<br />I have a personal plugin that combines a lot of assets from uber talented modders to un-derpify the clothes in Skyrim, I wanted to upload it but couldn&#39;t get permission from a couple of the authors-- there&#39;s no point in doing it if I can&#39;t make it standalone, no one wants an attire pack with 6 or 7 required mods. I&#39;m working on an edited version for a later upload though.[/s][url=http://www.nexusmods.com/skyrim/mods/73301/?][s][/s] See the new Katy&#39;s Un-derpified Nobles and Traders\r<br />[/url]\r<br />[b]Q: Why do all of your files have your name in them?[/b] \r<br />A: Because I&#39;m vain. No, actually it&#39;s because I have 625 mods right now in MO and several profiles, so I name everything I make &#34;KatySomething&#34;-- it&#39;s easier to sort stuff and find my various merges/files by just typing &#34;Katy&#34;. Plus I&#39;ve been doing it since Morrowind.\r<br />\r<br />[b]Q: You talk too much.[/b]\r<br />A: This isn&#39;t a question.... but correction, I WRITE too much.\r<br />[b]\r<br />Q: Fine circlets are invisible on elf males&#33;[/b]\r<br />A: Again, you people suck at asking questions. I&#39;m not sure why this happens but playing with your load order fixes it, I&#39;ve only ever been able to reproduce it by putting my plugin at the VERY highest position possible. If you&#39;re merging my plugin with a bunch of tweaks and want to be sure you see Fine Circlets on elf males, put it near/at the bottom of your merge. I haven&#39;t found a single conflict with a single mod out there and I have no clue why it would work for other humanoid races but not elf races since all humanoid races use the same models-- only khajiit and argonian circlet models are different, so again, I&#39;m stumped. They do appear right 99% of the time.\r<br />\r<br />PS This seems to have to do with how USLEEP handles elven circlets. It&#39;s far from game breaking.\r<br />\r<br />[b][u]My other Skyrim file--[/u][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/72974]Katy&#39;s Markarth Textures[/url]",
  "categoryId": "60",
  "version": "1.1",
  "author": "Katy420",
  "createdUnix": "1452648736",
  "updatedUnix": "1454548528",
  "containsAdultContent": false,
  "uploadedBy": "Katy420",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000191137",
      "name": "No more ugly fine hats",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "No more ugly fine hats-72622-.zip",
      "uploadedUnix": "1452648458",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/26ddce552f51fbd43c9d008888df5e433392e8bf190336d6cc6c941472b61be7/analysis/1452651925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20more%20ugly%20fine%20hats-72622-.zip?fid=1000191137&ttl=1535861177&ri=8192&rs=8192&setec=00a274d42120f36c0f809ea3fa0fef3c"
    },
    {
      "fileId": "1000191171",
      "name": "Fine hats to circlets",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Fine hats to circlets-72622-.zip",
      "uploadedUnix": "1452663107",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7b7aa48b0294a9c2d02a366730c442b91703d9ff7d820996418789e71dc8b908/analysis/1452685997/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fine%20hats%20to%20circlets-72622-.zip?fid=1000191171&ttl=1535861177&ri=8192&rs=8192&setec=f396648df743c24a56528d90eec6ec40"
    },
    {
      "fileId": "1000194069",
      "name": "Merchant hat replacer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9239",
      "fileName": "Merchant Hat Replacer-72622-.zip",
      "uploadedUnix": "1454533607",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/25d97f6f06ac082e8b05caac9321508a5a7018a4d9821b9c39af73548fbc0235/analysis/1454778514/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Merchant%20Hat%20Replacer-72622-.zip?fid=1000194069&ttl=1535861178&ri=8192&rs=8192&setec=6fff38e426dc07530606bea2b9fc95e2"
    },
    {
      "fileId": "1000194096",
      "name": "Farm hat replacer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9239",
      "fileName": "Farm hat replacer-72622-.zip",
      "uploadedUnix": "1454548528",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6d75b131d46f608e1864926c5bf39eb0853d6f628f3c55fe54f6d4642056add3/analysis/1454779394/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Farm%20hat%20replacer-72622-.zip?fid=1000194096&ttl=1535861179&ri=8192&rs=8192&setec=cbe081c0ae4b7ab45efb8af7ef70dd8f"
    }
  ]
}