{
  "modId": 7265.0,
  "modName": "Thief RP Alternative Start - Aareiana",
  "summary": "",
  "descriptionHtml": "-Story-\r\nBorn in the town of Green Lake, you lived a very tough life. At the age of 3 your mother died of a sickening disease, leaving you at the will of your father. After the pass of your mother, your father grew very tired and angry, and turned to the relief of alcohol. As you grew up, your life became tougher and tougher, and the abuse became more and more. As you became angrier you picked up the fun of petty crimes and thievery. With your first minor jail sentence at the age of 10, the townsmen became less and less fond of you everyday. The physical and mental abuse became greater then on in. You found a hatred for your father and all of the townsmen. After poisoning your fathers drink you knew that you would be no longer welcome and could no longer stay in your home town. So you traveled to a town not far away called Pine Bough. 4 years of living off scraps and in poverty passed and you heard of a wonderful guild in Riften, Skyrim .. The Thieves Guild. So your adventure began to the glorious Thieves Guild, and after long 3 years of traveling you final arrived to your destination. As you entered the town and approached the town center you bumped into just the man you wanted to hear from; Brynjolf. He gave you a small initiation;  stealing Madesi\\'s Silver Ring and framing Brand-Shei with the crime. mission accomplished and you made your way to the Ragged Flagon in the Rat Way underneath Riften. With your dream of joining the Thieves Guild accomplished you must now become a true member or the Thieves Guild.\r\n\r\nYou are equipped with the beautiful \\\"thieves armor\\\" from Triss Armor Re-textured and an Iron Dagger, your journey of being the best thief awaits.\r\n\r\nThe main quest has been disabled and won\\'t start. you also won\\'t start with any map markers (only Riften once you step outside the Ratway). That is all and enjoy !!! =)\r\n\r\nThe character I DID NOT CREATE. She was initially created by cooljacker111 . I downloaded is mod and began to play and decided I wanted to make an alternative start. So made a new start and mimicked every setting that was in the original file (With permission to make this Alternative Start with cooljacker111\\'s permission). Tweak at your own risk! Its been known that \\\"showracemenu\\' can and may screw up the original design of your character forcing you to remake him/her.   \r\n\r\n-Suggestions-\r\n-Download and enable \\\"no more fast travel\\\" -> http://skyrim.nexusmods.com/downloads/file.php?id=2075\r\n-In you SkyrimPrefs.ini set the following to 0 ->bShowCompass=0 (under interface)\r\n-In game turn off cross hairs under options \r\n-in game turn off floating quest markers under options\r\n\r\n-Requirements-\r\n-Triss Armor Re-Textured by Psyke23: http://skyrim.nexusmods.com/downloads/file.php?id=4708\r\n-Face & Hair by FrankSunday (no longer available on the Nexus, it\\'s hosted elsewhere): http://www.mediafire.com/?u49oq6wa65tg4ao\r\n-High quality eyes by Xenius: http://www.skyrimnexus.com/downloads/file.php?id=498\r\n\r\n-Installation-\r\nDOWNLOAD FILES FROM LINK ABOVE BEFORE INSTALLING THIS RP START !! If you do not then your character will end up looking really ugly instead of beautiful =3\r\n-extract Save 74 - Aareiana The Ragged Flagon 01.24.29.ess into Documents/My Games/Skyrim/Saves\r\n-Start game\r\n-Load saved file\r\n\r\n-Credits-\r\ncooljacker111 for the character; I didn\\'t really create this character I just mimicked his design of her .\r\nXenius for the high quality eyes \r\nFranksunday for the cute face and cute hair =3\r\n\r\nTHANKS ALL =3",
  "categoryId": "43",
  "version": "1",
  "author": "SMDmcmuffin3",
  "createdUnix": "1327802334",
  "updatedUnix": "1327805381",
  "containsAdultContent": false,
  "uploadedBy": "SMDmcmuffin3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23841",
      "name": "Thief RP Alternative Start",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "996",
      "fileName": "Thief RP Alternative Start-7265-1.rar",
      "uploadedUnix": "1327805381",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b55e9c41494e9bb8c002e1a2c20aaecb2580e8887c2d6ca80e717bdeb41d30a2/analysis/1406642893/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thief%20RP%20Alternative%20Start-7265-1.rar?fid=23841&ttl=1535765194&ri=8192&rs=8192&setec=751c0861c01c6f0800abc38aafd825e5"
    }
  ]
}