{
  "modId": 72659.0,
  "modName": "More Dynamic Injuries - FR",
  "summary": "",
  "descriptionHtml": "[size=4][u][b]Description[/b][/u][/size]\r<br />\r<br />[size=2]Pour plus de détail vous référer à la page du mod original : http://www.darkcreations.org/files/file/244-more-dynamic-injuries/\r<br />\r<br />Et n&#39;oubliez pas d&#39;endorser le mod original&#33;\r<br />\r<br />[/size]__________________________\r<br />\r<br />Blessure Plus Dynamiques est un mod de gestion des blessures. Il introduit notamment des blessures tel que les brûlures, les engelures, les coupures, les hémorragies et les fractures. Par le fait même, il introduit un système de soins des blessures. Ce système s&#39;applique aussi, si désirée, aux compagnons&#33;\r<br />\r<br />Pour activer le mod vous devez trouver un livre intitulé Survivre en Bordeciel : Guide de soins. Ouvrez le livre une seconde fois pour configurer le mod\r<br /> ([color=#ff0000]VOIR NOTE PLUS BAS[/color]). Pour l&#39;emplacement du livre, vous pouvez le trouver dans les auberges, les marchands généraux ou chez les alchimistes.\r<br />\r<br />Vous obtenez 3 nouveaux sorts : Un pour se soignun autre pour soigner vos compagnons et un dernier pour fabriquer de l&#39;équipement médical. Si vous ne voulez pas fabriquez votre équipement, vous pouvez toujours en acheter chez les marchands. En général le matériel médical est vendu chez les alchimistes. Si l&#39;équipement médical n&#39;apparaît pas, fermer le menu de marchandage et ouvrez-le de nouveau. Sinon pouvez quittez la boutique et revenir. Il se peut que cela ne fonctionne pas du premier coup, par contre.\r<br />\r<br />[size=4][b][u]Pré-requis\r<br />\r<br />[/u][/b][/size]Skyrim 1.6.89.0.1 ou plus récent\r<br />\r<br />\r<br />[size=4][u][b]Installation\r<br />\r<br />[/b][/u][/size][color=#ff0000]LE MOD ORIGINAL DOIT ÊTRE INSTALLÉ&#33; LIEN ICI[/color] : http://www.nexusmods.com/skyrim/mods/53499/?\r<br />\r<br />- Installer le mod original\r<br />\r<br />- Installer la traduction soit via le NMM ou manuellement (Steam/Steam App/Common/Skyrim/Data)\r<br />\r<br />- Enjoy&#33;\r<br />[size=4][b][u]\r<br />Désinstallation \r<br />\r<br />[/u][/b][/size][color=#ff0000]*** Suivre la [size=2]procédure de désinstallation via le jeu[/size] pour une désinstallation sécuritaire&#33;*** [/color]\r<br />\r<br />Vous pouvez y accéder en allant dans le sous-menu de configuration des Options des Blessures.\r<br />\r<br />- Une fois la désinstallation via la jeu terminé, vous pouvez désinstaller le jeu dans le NMM ou le retirer manuellement.\r<br />\r<br />[u][size=4]Note [/size]\r<br />[/u][size=2]\r<br />[color=#ff0000]IMPORTANT&#33;&#33;&#33; À LIRE[/color]\r<br />\r<br />Il y a bug lorsque l&#39;on veut configurer le mod, via le livre. Ce n&#39;est pas un bug dû la traduction, car lorsque je le testais en anglais, ce bug était présent. Lorsque l&#39;on va dans les options : Taux de Soins ---&gt; Options des Compagnons ---&gt; Engelures. Lorsque je clique sur Engelures, le livre &#34; s&#39;ouvre et vous devez le refermer. Après je suis incapable d&#39;ouvrir le menu de configuration. Je peux toujours lire le livre, mais le menu de configuration n’apparaît plus. Il donc impossible de configurer cette valeur. Même si vous reloader votre partie ou que vous quittez le jeu et revenez ensuite, le menu n&#39;apparaît pas. Donc, vous ne pourrez plus changer AUCUNE autre valeur. Je vous conseille de NE PAS TOUCHER À CETTE VALEUR. Par contre si vous n&#39;avez pas sauvegarder votre partie après la configuration, il toujours possible de configurer le mod. :) Je vous conseille aussi de sauvegarder votre partie AVANT de configurer le mod, au cas où il y aurait des problèmes.\r<br />\r<br />[/size]*** Ce bug n&#39;arrive peut-être qu&#39;à moi, mais je voulais vous prévenir au cas où cela se produirait***\r<br />\r<br />Si vous voulez, vous pouvez me tenir au courant de ce bug dans les comentaires, le cas échéant, cela serait vraiment apprécier. Merci.\r<br />\r<br />[size=4][b][u]Compatibilité\r<br />\r<br />[/u][/b][/size]Ce mod est incompatible avec les mods de blessures.\r<br />\r<br />*** Cependant, j&#39;utilise le mod Locationnal Damage (Dégât localisé) et il fonctionne bien avec ce mod. Placer More Dynamic Injuries après Locationnal Damage dans le load order pour qu&#39;ils fonctionnent tous les deux.***\r<br />\r<br />[size=4][b][u]Permission\r<br />[quote]- You are free to alter, expand on, or destroy this mod in any way you see fit. If you wish to share your work, however, you MUST contact me and obtain my explicit permission before doing so. Any instances of severe mod destruction will not be eligible for technical support until restored to a functional state.\r<br />\r<br />- Any works that are found to be in breach of the above, the author will receive a single polite request from me to remove it from wherever it is being hosted (from all sites it is being hosted on). Failure to respond within 48 hours will result in more direct action being taken.\r<br />\r<br />- DO NOT upload this mod to any site other than those I have personally uploaded it to without my express permission given. Any user or site found in violation of this will be considered to be stealing intellectual property and will be treated as such. Just because this mod is free does not mean that gives you free reign over what you can do with it. My work, my rules.\r<br />\r<br />- If I fail to respond to your requests to expand or alter this mod within 30 days, you may consider yourself as having my approval to do as you wish, but please note that upload location restrictions still stand.\r<br />\r<br />- Translators: please simply PM me if you wish to translate this mod. If you wish to upload the translated version to one of my current mirrors, you may consider my answer to be “yes” outright. If you wish to upload elsewhere, though, you must obtain my permission to do so. All I wish to know is that the mod is being translated, and anyone who wishes to do so has my approval[/quote][/u][/b][u][b]Crédit\r<br />\r<br />[/b][/u][/size]Bethesda pour le jeu\r<br />Epervier 666 pour le ESP/ESM Tranlator\r<br />Prolix pour le mod ",
  "categoryId": "77",
  "version": "1.1.6",
  "author": "Prolix  Trad Zess1313",
  "createdUnix": "1452796700",
  "updatedUnix": "1452796675",
  "containsAdultContent": false,
  "uploadedBy": "Zess1313",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000191378",
      "name": "More Dynamic Injuries FR",
      "version": "1.1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "76",
      "fileName": "More Dynamic Injuries FR-72659-1-1-6.rar",
      "uploadedUnix": "1452796675",
      "modVersion": "1.1.6",
      "virusScanUrl": "https://www.virustotal.com/file/2ee190ce6f1568bcaf57b595a8d3fa431d85fe1b5aa030320c760d247ba3150c/analysis/1452796685/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Dynamic%20Injuries%20FR-72659-1-1-6.rar?fid=1000191378&ttl=1535861211&ri=8192&rs=8192&setec=569af5f9602731e39f4a001c16d60342"
    }
  ]
}