{
  "modId": 7271.0,
  "modName": "Silent Killer",
  "summary": "Removes the inexplicable fail sound from successful sneak-attacks.\r\nReplaces absurd \\\"bonk!\\\" sneak-attack sound with a silent wav file, or use your own.",
  "descriptionHtml": "Removes inexplicable fail sound from sneak attacks.  Actually, I think it\\'s a critical hit indicator, but whatever.  I can also read, and a lot better, it turns out, when nobody is being bonked over the head with a cartoon frying pan, of all possible distractions.\r\n\r\nWhen you execute a successful sneak-attack in Skyrim, why must the glorious whizzing sound of the arrow finding its target be drowned out by the sound of someone being bonked over the head with a cartoon frying pan?  Well, I got sick of it and so have you if you\\'re reading this.  If that\\'s the case, then you\\'ll be glad to know that we\\'ve murdered that sound in its sleep with a pillow.  Or, if you prefer, we sent it to a farm upstate where it can bark and chase cars.  (We didn\\'t.)  ...  You\\'re welcome!\r\n\r\nIf the thud of your victim\\'s dead weight alone is not enough audio cue for your play-style, you may substitute your own wav file and rename it to \\\"ui_sneakattack_01.wav\\\". Suggestions for sound fx sources: Quake III Arena, Super Mario, the \\\"DING!\\\" sound from Everquest that makes you lose bowel-control, etc.\r\n\r\nInstall:\r\n\r\nUnzip and copy Data folder to Skyrim installation folder, like any mod.\r\nSimply replaces the stock fail-sound with one second of silence.\r\n\r\nCredit goes to Strider for his Rambo II Sneak Attack Sound mod, for essentially showing me which file to replace, and to divyanthj for asking in the first comment on Strider\\'s mod for the specific thing I had been searching for at the time -- this mod.\r\n\r\nSo here it is.  Now, go forth quietly and listen to the gurgles and death-rattles of your fallen enemies that you\\'ve been missing.\r\n\r\n\\\"A man is known by the silence he keeps.\\\" ~Oliver Herford",
  "categoryId": "76",
  "version": "1.0",
  "author": "errtype11",
  "createdUnix": "1327812419",
  "updatedUnix": "1327812580",
  "containsAdultContent": false,
  "uploadedBy": "errtype11",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23854",
      "name": "Silent Killer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Silent Killer-7271.7z",
      "uploadedUnix": "1327812580",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4ca27d07346a633c8783aa827d58e882326e36962fcd6df1f54a4e5555666a9e/analysis/1406643064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Silent%20Killer-7271.7z?fid=23854&ttl=1535765210&ri=8192&rs=8192&setec=9f936f9907fcebf4c72cf28a976eee50"
    }
  ]
}