{
  "modId": 72756.0,
  "modName": "Holo The Wise Wolf Preset",
  "summary": "This is a save file so you can play as Holo The Wise Wolf from Spice and Wolf.",
  "descriptionHtml": "This is a save file so you can play as Holo The Wise Wolf from Spice and Wolf. I would love to make a preset for ECE or Race Menu, but I have absolutely no idea how to do that. The save starts right after you finish the vanilla character creation, so you will miss the very start of the game where you are in the wagon and obviously the character creation. The main reason why I made this is because I found a very good Holo creation on this site, but at the time it was only a picture. Luckily I was able to get in contact with the mod author who inspired this whole mod (2nd pic) and they released a preset for Holo that is 10 times better than mine&#33; Be sure to check it out&#33;&#33;&#33;\r<br />\r<br />http://www.nexusmods.com/skyrim/mods/73295/?\r<br />\r<br />Installation:\r<br />Go to Documents/ My Games/ Skyrim/ Saves/ and drop the save files in there.\r<br />\r<br />Requirements:\r<br />MaTera Race\r<br />Alluring Eyes\r<br />Any Brow\r<br />SG Hair Pack 268 Edition (Not found on Nexus. Look it up on Google.)\r<br />Enhanced Character Edit\r<br />\r<br />Just a quick side note- Race Menu did not work along side ECE for me when I made this character, so if you have that installed and she is not coming out like she looks in the pictures then try removing that and leaving ECE installed and that should work unless there is another mod conflicting. Also I am well aware that she is not exact. I did the best that I could do, so feel free to edit her if you want. If you do feel the need to edit her then just type in showracemenu in the console command activated by pressing the ` key, and edit to your hearts content.\r<br />\r<br />Permissions:\r<br />I know that there is another section for this, but just in case someone misses it then here is what you can do with this file. Literally anything you want. I do not care if this gets redistributed to other sites, or modified in any way. As a matter of fact if you can take this as a base and make her more spot on then more power to you&#33; One small restriction though, this mod is free. Do not go off and make this a paid mod on Steam or something.",
  "categoryId": "43",
  "version": "V1",
  "author": "mustang42",
  "createdUnix": "1453150880",
  "updatedUnix": "1453150872",
  "containsAdultContent": false,
  "uploadedBy": "mustang42",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000191910",
      "name": "Holo Save",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2269",
      "fileName": "Holo Save-72756-V1.zip",
      "uploadedUnix": "1453150872",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/e7c290dcf28764170534f0081e626474d80fe709b25006d43d8b7b30f6377c22/analysis/1453150925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Holo%20Save-72756-V1.zip?fid=1000191910&ttl=1535861319&ri=8192&rs=8192&setec=e167b72a909c8768656bbf09ccb64209"
    }
  ]
}