{
  "modId": 72778.0,
  "modName": "Hearthfire multiple adoptions Czech Localization by Slimak74.7z",
  "summary": "Czech Language:\r<br />Úplný překlad původního modu.\r<br />\r<br />English Language:\r<br />Full Translation on Original Mod to Czech Language.",
  "descriptionHtml": "Ahoj.\r<br />\r<br />Předně se musím omluvit týmu Nexus, že jsem neumístil můj překlad do správného umístění, ale protože mě uploadovací formulář neukázal kam přesně mám co přidat, musel jsem to nějak obejít.\r<br />Takže... Promiňte.\r<br />\r<br />Naučil jsem se jak se vrtat v původních souborech ESP a BSA a díky tomu jsem si pro sebe udělal spoustu českých lokalizací.\r<br />Některé jsou vypiplané a jiné zase méně, poněvadž neumím pořádně Anglicky a tak s tím má občas docela boj.\r<br />\r<br />Pokud budete chctít, nahodím sem seznam češtin, co jsem udělal.\r<br />\r<br />No a tady je konečně to, proč jste na této stránce...\r<br />\r<br />Jako zdroj jsem použil mod:\r<br />[color=#ff0000][b]Hearthfire multiple adoptions - Now with custom home support for kids and spouse[/b]                    by TMPhoenix ve verzi 2.0.15[/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/29249/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D29249&pUp=1][/url][url=http://www.nexusmods.com/skyrim/download/1000137927]Hearthfire multiple Adoptions V2_0_15[/url]\r<br />\r<br />ale ukázalo se, že nepostačí pozměnit soubory ESP, protože fůra dialogů byla v souboru BSA.\r<br />Takže jsem se jal upravovat i obsah BSA a výsledkem je, že [color=#ffff00][b][u]vůbec nepotřebujete originální mod.[/u]\r<br />\r<br />[/b][color=#ffffff]* Součástí mého balíčku je i dodatek, který všem adoptovaným dětem přidává počeštělé příjmení.\r<br />[/color][/color]Potíž je, že Angličtina v příjmeních nerozlišuje dívku od chlapce a tak se původně obě pohlaví jmenovali Dovakhiir.\r<br />Musel jsem to nějak obejít, protože překládaný text samozřejmě nebyl pro dvě pohlaví, ale jak už to Angličtina má - univerzální.\r<br />Takže jsem nakonec všem dětem dal přívladtek [b][color=#00ff00]Dračí[/color][/b].\r<br />\r<br />Když se to někomu nebude líbit, tak zkrátka ručně vymažte ze složky DATA soubor [color=#ff7700][b]HearthfireMultiKid_LastName.esp\r<br />\r<br />[/b][color=#ffffff]Tak doufám že se vám to bude líbit a že tam nenajdete moc textových nebo slohových chyb :-)\r<br />\r<br />\r<br />Vás Slikak74[/color][/color]",
  "categoryId": "99",
  "version": "1.0",
  "author": "Slimak74",
  "createdUnix": "1453216355",
  "updatedUnix": "1453216355",
  "containsAdultContent": false,
  "uploadedBy": "slimak74",
  "primaryFile": null,
  "files": []
}