{
  "modId": 72873.0,
  "modName": "Craftable Fort - Deutsch",
  "summary": "Mit dieser mod könnt ihr euch ein großes Fort von Grund auf selbst bauen. Um an das neue Grundstück zu kommen begebt ihr euch nach Rifton in die Festung Nebelschleier. Gleich links neben dem Jarl-Stuhl liegt ein Buch. Wenn ihr es aktiviert erscheint das Kaufmenü. Das Grundstück kostet 5000 Septime. Es liegt zwichen Rifton und Ivarstatt und ist",
  "descriptionHtml": "Zum Bau werden verschiedene Baumaterialien und Werkzeuge benötigt. Ihr könnt euch diese selbst an einem Arbeitstisch herstellen. Für die jeweiligen Bauphasen benötigt ihr verschiedene Baukits. Diese werden an den Ambossen für Baukits hergestellt. Die Baukits könnt ihr dann an den jeweiligen Werkbänken verwenden um die Bauphasen abzuschließen. Zum Fort gehören ein Haus das ihr selbst aufbaut und einrichtet, vier Wachtürme, ein Schmelzofen, ein Pferdestallt, ein Brunnen, eine Werkstatt, eine Gefährtenunterkunft, eine Gärtnerei, eine Imkerei, eine Fälscherwerkstatt, ein Bogen-Schießplatz und ein großer Turm mit Aussichtsplattform. Sobald ihr die Grundstrukturen des Forts errichtet habt, kann die Werkstatt im Aussenbreich abgebaut und im Inneren wieder aufgebaut werden. In der Werkstatt im Inneren findet ihr rechts von der Werkbank am Stützpfeiler VIER KNÖPFE. Diese dienen euch dazu um zwischen den verschiedenen Werkbänken und Ambossen UMZUSCHALTEN. Die erste Werkbank dient euch dazu den Innenhof zu gestalten, die zweite zum Hausbau, die dritte um das Fort zu erweitern und die vierte um die Erweiterung auszubauen. Wenn ihr einen Knopf drückt, werden sowohl die Werkbank als auch ein entsprechender Amboss bereitgestellt. Das heisst es wird immer der Amboss mit den passenden Baukits für die jeweilige Werkbank bereitgestellt. Um das Haus einzurichten erscheint im Inneren des Hauses eine Schmiedebank an der ihr die entsprechenden Baukits für die Inneneinrichtung herstellen könnt. Auch auf der Aussichtsplattform erscheint eine Schmiedebank an der die Plattform ausgestattet werden kann. Dort oben können einige Aufbauten, Ein Leuchtfeuer, Möbel, Container und einen Alchemie- und Verzauberungstisch gebaut werden. Sobald ihr die Aufbauten errichtet habt, erscheint Wild in der Nähe, viel Spass beim jagen. \r<br />\r<br />Baumaterialien: \r<br />\r<br />Espenholz: \r<br />Aus ihm werden Bauholz, Möbelholz und Werkzeuge gefertigt. Das Espenholz kann von den Espen in der Umgebung gesammelt werden. \r<br />\r<br />Bauholz: \r<br />Das Bauholz wird zum Bau der ganzen Strukturen und des Hauses benötigt und wird aus Espenholz hergestellt. \r<br />\r<br />Möbelholz: \r<br />Das Möbelholz wird zur Herstellung von Möbeln, Fässern und Kisten benötigt und wird aus Espenholz hergestellt. \r<br />\r<br />Felsgestein: \r<br />Das Felsgestein kann ein Stück unterhalb eures Grundstückes an einem Felsen abgebaut werden. Es kann am Arbeitstisch zu Mauersteinen weiterverarbeitet werden. Um das Felsgestein abzubauen, benötigt ihr die Spitzhacken Bau. \r<br />\r<br />Mauerstein: \r<br />Mauerstein wird aus Felsgestein hergestellt und zum Bau von Strukturen aus Stein benötigt. \r<br />\r<br />Eisennägel: \r<br />Die Nägel werden zur Herstellung aller Gebäude benötigt. \r<br />\r<br />Leinen: \r<br />Leinentücher werden zur Herstellung von Teppichen und Seilen benötigt. Leinen wird aus Tundrabaumwolle hergestellt. \r<br />\r<br />Seile: \r<br />Seile sind auch Bestandteil einiger Baukits. Z.B. die Wachtürme sind mit Seilen zusammengebunden. Seil wird aus Leinen hergestellt. \r<br />\r<br />Alle Baumaterialien und Werkzeuge können am Arbeitstisch hergestellt werden. \r<br />\r<br />Werkzeuge: \r<br />Werkzeuge sind Bestandteil aller Baukits. Je nach Objekt werden verschiedene Werkzeuge benötigt. Auch um die verschiedenen Hölzer zu bearbeiten braucht man sie. Alle Werkzeuge können am Arbeitstisch aus Eisenbarren und Espenholz hergestellt werden. Die herstellbaren Werkzeuge sind: Axt, Hammer, Schaufel, Säge, Spitzhacke Bau \r<br />\r<br />Balimund der Schmied in Rifton: \r<br />Bei Balimund könnt ihr euch alle Baumaterialien kaufen die ihr zum Bau benötigt. Er hat Espenholz, Bauholz, Möbelholz, Mauersteine, Leinen und Seil im Angebot. Ich empfehle euch, euch gleich von Anfang an mit den verschiedenen Baumaterialien bei Balimund einzudecken. Das ganze benötigte Holz von den Bäumen zu sammeln würde wohl ewig dauern. \r<br />\r<br />Die Stiefel des Baumeisters: \r<br />Mit dem Bau der ersten Werkstatt erhaltet ihr die Stiefel des Baumeisters. Wenn ihr diese Stiefel tragt, erhöht sich eure Tragkraft auf 8300. Da die Baumaterialien ein großes Gewicht haben, solltet ihr diese beim besorgen der selben tragen. \r<br />\r<br />Die Gärtnerei, die Imkerei und die Fälscherwerkstatt: \r<br />In der Gärtnerei kann aus einer beliebigen Pflanze zwei Samen extrahiert werden. Aus den Samen werden wiederrum Pflanzen nachgezüchtet. Also könnt ihr eure Zutaten beliebig vervielfachen. In der Imkerei können Honig, Honigwaben, Bienen und Bienenstockhüllen hergestellt werden. In der Fälscherwerkstatt kann aus Eisenbarren, Goldbarren und einem Goldschmelzmittel Falschgeld hergestellt werden. Mit den Münpressen presst ihr euch neue Münzen. Das Schmelzmittel besteht aus Honigwaben und Goldstaub. Den Goldstaub und das Schmelzmittel werden ebenfalls in der Fälscherwerkstatt hergestellt. Sie befindet sich links neben der Imkerei. \r<br />\r<br />Wichtiger Tipp: \r<br />Ich empfehle euch beim einsetzen der Baukits an den entsprechenden Werkbänken die Reihenfolge einzuhalten. Die Baukits sind nummeriert. Es wird immer wieder vorkommen, dass ihr mit euren Materialien ein Baukit herstellen könnt welches ihr erst später verwenden solltet. Ihr könnt es ja schon mal bauen, aber beim einsetzen an der Werkbank würde ich auf die Reihenfolge achten. Falls ihr die Reihenfolge nicht einhaltet kann es passieren, dass Gegenstände in der Luft stehen - Beispiel: Ihr verwendet ein Baukit Ausstattung Wachturm bevor ihr den Wachturm gebaut habt, dann werden Laternen und Kisten in der Luft hängen. Wem das nichts ausmacht der kann ja wild drauf los bauen, andernfalls sollte man darauf achten. \r<br />\r<br />Grafikauflösung: Ich spiele mit einer Auflösung von 1920 x 1080. Ich hoffe dass alle Menüs auch mit geringerer Auflösung angezeigt werden da sie so breit sind. \r<br />\r<br />Ich wünsche euch viel Spaß beim werkeln und freue mich über einen Daumen hoch&#33; \r<br />\r<br />chrysanthes77 \r<br />",
  "categoryId": "22",
  "version": "",
  "author": "chrysanthes77",
  "createdUnix": "1453572075",
  "updatedUnix": "1453572075",
  "containsAdultContent": false,
  "uploadedBy": "chrysanthes77",
  "primaryFile": null,
  "files": []
}