{
  "modId": 72902.0,
  "modName": "ENB Workshop",
  "summary": "A full featured ENB Preset editor.  Whether you are new ENB user who wants to get rid of some unwanted &#34;feature&#34; of your favorite ENB or a preset developer looking for an easy way to manage or upgrade your preset; there is something here for you.",
  "descriptionHtml": "[color=#00ff00][size=4][color=#e06666][size=5][b][color=#ffff00][size=4][size=5]NEW VERSION: [color=#999999][s]0.75 Beta[/s][/color] [color=#00ff00][size=4][color=#e06666][size=5][b][color=#ffff00][size=4][size=5]0.76 Beta[/size][/size][/color][/b][/size][/color][/size][/color].  Updated for ENB version 3.05.  Vivid Weathers ids are now available in Weather List (SEE NOTE BELOW).[/size][/size][/color][/b][/size][/color] \r<br />\r<br />[color=#ff7700][b]IMPORTANT NOTE: I have discovered some new ENB tags that are available but were NOT included in the default 3.05 series.ini file. They are Dawn/Dusk Tags used by Dawn/Dusk aware ENB presets such as the Vivid Weathers ENB.  They are NOT enabled by default which is why they were missed.  THESE NEW TAGS WILL REQURE INTERFACE CHANGES so I will need to modify at least one (probably two) of the basic controls.  This means that these changes will take some time to implement.  I will not do this immediately because I am actually trying to PLAY Skyrim a little while I update the ENB I am developing both as a test and because I don&#39;t like any current presets.  I will be getting to those changes AFTER I update the preset for Vivid Weathers and the new default tags.  Then I will learn how the new Dawn/Dusk system works so that I don&#39;t make mistakes on how I approach this.  **Please be patient**[/b][/color]\r<br />\r<br />[color=#dd7e6b]Please note that if you have not updated since before version 0.70, you need to update.[/color]\r<br />\r<br />[b]IMPORTANT NOTE: Max values have not been tested with new ENB 3.05 settings.  Please report any popups warnings that you encounter.  ALSO, functionality has not changed so the User Guide is up to date even though it states that it is for version 0.70b[/b][/size][/color][b]\r<br />[/b][u][b]\r<br />\r<br />Description:[/b][/u]\r<br />This “mod” was inspired by the [url=http://www.nexusmods.com/skyrim/mods/17400/?]ENB Customizer[/url] application by Dorian G.  It was independently developed by me from the ground up to replace and expand this outdated utility.  The final result is much more than its predecessor. It is also up to date and allows access to all current ENB settings.\r<br />This mod has a use for almost everyone who uses an ENB:\r<br />\r<br />[list][*][i]Casual ENB User:[/i] Toggle and customize the use of ENB effects to your liking; even if the ENB developer doesn’t provide a way to. (Use the first “Quick Settings” tab). Note that this can also be done in-game using Shift-Enter.\r<br />[*][i]ENB Enthusiast:[/i] Change presets to your liking or create your own based on your favorites.  Update old ENBs that are no longer maintained to the latest ENB version*\r<br />[*][i]ENB Preset Developer:[/i] Use this to modify EVERYTHING about your ENB preset.  At the press of two buttons, upgrade your ENB preset to the latest ENB version.  Quickly add weather based customizations.  Quickly add/change associated weathers ids from ALL popular weather mods without knowing the specific hex ids.\r<br />[/list]\r<br />[i][b]*Note: [/b][/i]that new settings may change the appearance somewhat.  This feature is currently experimental.Ultimately ENB Workshop is a complete utility for working with ENB presets or even building your own from the ground up.  It can be used alone or in conjunction with the ENB Manager by Legend Aeternus.  It can be installed in multiple places to manage ENB’s used for Skyrim, Fallout 4, and the ENB Manager independently.  \r<br />\r<br /> \r<br />[u][b]Requirements:[/b][/u]\r<br />[list][*]Microsoft .NET 4.0 or compatible framework for other operating systems\r<br />[*]Windows OS (optional – but required for application settings to be saved for each “installation”)\r<br />[*]Skyrim or Fallout 4 (duh…)\r<br />[*]An ENB version that supports the IgnoreWeatherSystem tag.\r<br />[/list] [b]\r<br />\r<br />[u]Features:[/u][/b][list][*][b]Modify an existing ENB preset to your liking.[/b]\r<br />[*][b]Create your own ENB&#33;  (From scratch or using an existing ENB preset as a template).[/b]\r<br />[*][b]Upgrade an ENB that is no longer maintained to the latest version. (See starred note above).[/b]\r<br />[*]Access to all ENB settings\r<br />[*]Backward compatible with previous ENB versions that support the IgnoreWeatherSystem tag (Though basic functionality exists, this feature is still under development).\r<br />[*]A User configured number of automatic backups of the current ENB settings in case you make a mistake and lose a setting you liked.&#92;\r<br />[*]A simple user interface similar to the one in ENB Customizer but uses coloring to be more informative.\r<br />[*]Puts most ENB settings in language that is easier to understand (like the original application)\r<br />[*]Embedded Help text that lets you know what each setting is for (similar to what was on the ENB Customizer web page).\r<br />[*]Support for the latest ENB tags and easily maintained for further enhancements.\r<br />[*]Support for multiple weather configurations\r<br />[*]Full support for configuring each weather configuration to your liking (Includes a weather list editor where weathers can be picked by name). \r<br />[*][b]Full list of ALL weather IDs by name from all DLCs and the following mods: Climates of Tamriel 5.0 and RCRN.  [/b]If you have posted a weather mod and would like these weathers added, please private message me.  (It is a fairly quick process to add new ones).[b] [/b]\r<br />[*]Allows linking of outdoor and indoor settings (where applicable) so that changing one changes all.  (NOTE: At the present time this linking is not saved in program settings, though that is a future plan).\r<br />[*]Create an ENB preset library for the current ENB version.  (For using multiple versions, see below).  \r<br />[*]REWORD: Completely compatible and complimentary to ENB Manager if you want to use ENB presets that use different versions of the ENB (or even if you would prefer to use ENB Manager. You will need to use ENB Manager to switch for this case).&#92;\r<br />[*]Automatically detects ENB Manager presets if run from the ENB Manager folder.\r<br />[*]No installation required.  Multiple installations possible.  (Just put executable from zip file in the same folder as any game or ENB Manager application folder/directory.  All settings specific to an installation folder will be saved in Windows on a per user basis).\r<br />[*]Automatically detects installation type and available resources by detecting folders and files in the installation folder.\r<br />[/list] [b]\r<br />\r<br />[u]Recent Fixes/Changes:\r<br />[/u][/b][list]\r<br />[*][color=#f6b26b][b][size=3][color=#f6b26b][b][size=3]Fixed Critical Issue[/size][/b][/color] that caused crash or incorrect assigning of a new weather preset to a slot when creating a new weather preset. (0.70b)[/size][/b][/color]\r<br />[*][color=#f6b26b][b][size=3]Updated ENB version to 3.05[/size][/b][/color]\r<br />[*][b][size=3]Added Weather ID Support for Vivid Weathers[/size][/b]\r<br />[/list]\r<br />[b][i]ADDED:[/i][/b][list]\r<br />[*]checkbox to allow extended selection options (key based) to selection mode in weather list\r<br />[/list][i]\r<br />[b]CHANGED:\r<br />[/b][/i][list]\r<br />[*]available weather list now (correctly) excludes all weathers assigned to a weather file and is updated when a weather is transferred. \r<br />[/list][i][b]\r<br />FIXED:[/b][/i]\r<br />[list]\r<br />[*]no longer puts &#34;IngnoreWeatherSystem&#34; tag in weather series files during upgrade\r<br />[*]interface would not update after the upgrade process\r<br />[*]some scale limits\r<br />[*]crashes and problems that occurred when transferring weathers between lists.\r<br />[*]linking night setting copies value from day setting\r<br />[/list][b][u]\r<br />Known Bugs:[/u]\r<br />[/b]How quickly bugs disappear depends on the type. [color=#ff7700]Orange bugs[/color] are critical and will be fixed as soon as I have enough information to fix them.  These bugs will usually not have a work-around.  [color=#ffff00]Yellow bugs[/color] are annoying but not critical.  They will often have a work-around.  They should be fixed soon as well. [color=#6fa8dc]Blue bugs [/color]are not actually an issue with the program but with an external cause.  These may or may not be fixed depending on the severity and/or complexity.  [color=#00ff00]Green bugs [/color]are minor inconveniences and do not affect general use of the program.  These will be fixed in a future update when I have time to address them.\r<br />\r<br />[list][*][color=#dd7e6b][color=#ff7700][b]Popup Message: There was an error while updating the interface with the ENB preset values:[/b][/color]  [/color]Occurs when either switching to a specific preset or when loading the default preset.  This is a built in message to let you know that the ENB preset contains a value out of what I considered to be an “appropriate” range for a particular setting.  Since I did not know all the accepted values for certain settings, I had to guess.  There is no workaround for this problem.  This is part of the “beta” process so that I can figure out where issues are.  [b]Please email/post this problem on the [url=http://forums.nexusmods.com/index.php?/topic/3720625-enb-workshop/]discussion thread[/url] and paste the contents of the ENBWorkship.log file found in the same folder [/b]as the executable.  This will allow me to clear up these problems quickly with an update.\r<br />[*][color=#6fa8dc][b]Program crash/Standards Conflict:[/b] [/color]Program crashes when loading some presets. Sometimes it will not crash but simply not update to the interface to the current preset.  If you look at the error message it says: [b]“Item has already been added.  Key in dictionary…”.[/b]  This is not a bug in the program.  This is a problem that results from the fact that the ENB preset author did not use any kind of appropriate syntax that is supposed to indicate that the line that caused the error is a comment.  The ini reader that comes with the program recognizes comments that are prefaced with a “//”, a semicolon, and a hash sign (#).    To fix this error you should go through all comments in the ini file have one of these symbols in front of them.  Preferably the double slash or the semicolon.\r<br />[*][color=#00ff00][b]Comments are not copied during ENB Update process:[/b][/color] this is a known issue that results from the algorithm being used.  Comments and whitespace are currently skipped because no in depth analysis of the lines is being performed that would indicate where the comment should go in the new file.  I may or may not choose to correct this issue in future versions.\r<br />[/list] [b]\r<br />[u]Under Development:\r<br />[/u][/b][list]\r<br />[*]A way to view the results of changes to settings in real time (in game).  It looks like this might be possible but you will need to run Skyrim in a Window rather than full screen.  We will see if it works.\r<br />[*]A new way of entering the color filters that makes a lot more sense given their use.\r<br />[/list][b][u]\r<br />Future Plans:\r<br />[/u][/b][list]\r<br />[*]Create a user guide.\r<br />[*]Implement Fallout 4 weathers and a way to distinguish which weathers should be used in a specific situation.\r<br />[*]Enable switching out the current ENB with a stored preset.  Possibly a different version of the ENB as well.  \r<br />[*]Improving some of the functionality/algorithms.\r<br />[*]Possibly create a way to recognize the ENB version and/or implementing a way to update to specific versions of the ENB software.\r<br />[*]Create a public version of the source code.\r<br />[/list][b][u]\r<br />\r<br />Choosing Where to Install:[/u]\r<br />[/b]This application is not intended to be installed with an installer.  Simply drop the executable into a folder where you wish to have it.  In addition, because of the nature of the program, it can be “installed” in multiple locations It is recommended that you put in one or all of the following folders: Skyrim, Fallout 4, and/or ENB Manager.  The application will detect it the nature of its location and act accordingly.  This behavior is based on three basic types of installations:\r<br />\r<br />[list][*][b][i]The Basic Setup:[/i][/b] this is where the executable is put in the game folder that also contains the ENB files.  This is usually the Skyrim or Fallout 4 folder.  You may upgrade a “basic” setup to a “preset” setup in the application itself by enabling presets.  (Note: the application will work somewhere where there isn’t a game/ENB but if this is done you will need to specify where the game/ENB is located.\r<br />[*][b][i]The Preset Setup:[/i][/b] this is the same as above except that the application creates a folder inside the ENB location that stores presets you create.  These modified presets may be activated at any time.  NOTE: This setup is not compatible with the ENB Manager setup.\r<br />[*][b][i]ENB Manager Setup:[/i][/b]  this setup is detected if the ENB Workshop executable is put in the same folder as [url=http://www.nexusmods.com/skyrim/mods/24402/?]ENB Manager[/url].  New presets that you create are automatically made compatible with ENB Manager; however, you are not given a choice over which ENB the preset will work with.  ENB workshop will use the ENB settings file that is embedded in the application OR it will use whatever version is used by the preset you are copying (if you are using another preset as a template).  NOTE: This setup is not compatible with the “preset setup” mentioned above.\r<br />[/list] [b]\r<br />\r<br />[u]Installation:[/u]\r<br />[/b][list=1][*]Be sure to install Microsoft .NET 4.0 for Windows (or .NET compatible framework such as Mono for Mac)\r<br />[*]Copy ENBWorkshop.exe from the zip file into any (unique*) game directory, ENB Manager directory, or any other directory that contains an ENB or ENB Manager setup.  \r<br />[*]The first time the application runs from a unique directory, it will ask you for some basic configuration information (make sure you supply the right information).  NOTE: if the folder you put it in does not contain the enbseries.ini file, you will be asked for the location of the enbseries.ini file for this particular setup.\r<br />[*]You are ready to go&#33;\r<br />[/list]\r<br />*NOTE: each installation must be put into a *UNIQUE folder name.  The folder you put the executable in cannot have the same name as another folder where you put the executable.  The program will not load if this is the case. For example, DO NOT put ENBWorkshop.exe in two different folders named Skyrim.  If you have already run the program from one of the folders, it will not allow you to run it from the other folder.  Instead it will give you an error message. \r<br />\r<br />[b]Note for Mod Organizer Users:[/b]At this point in time, this application does not change anything in the data folder so it has not been adapted for Mod Organizer.  Please install to the regular Skyrim folder.  This may change in the future as I am considering making sun-sprites available that replace the ENB sun renderer.  However, since that changes only 1-2 files, it does not make me too concerned about the fact that this application is independent of Mod Organizer.  The only thing you will need to keep in mind if I make those changes is that any mods you have installed may “overwrite” the active sun sprite. \r<br />\r<br />[u]\r<br />[b]First time Use (for each new folder location):[/b][/u]\r<br />The program will ask you for some basic information about settings to use for this particular location.\r<br />\r<br /> [list=1][*]The ENB location is usually detected automatically.  However, if the location cannot be determined this field will be editable and must be filled in before the application will work.\r<br />[*]Location of where you want backups to be stored.  It is recommended that you keep the automatic setting.\r<br />[*]Number of backups to be kept.  You may change this number as desired but the default is 5.\r<br />[*][Not yet implemented] Skyrim or Fallout?  This setting is only necessary because of weathers that may be supplied in current and future mods may need to be selected between.\r<br />[/list] [b]\r<br />\r<br />[u]Upgrading: \r<br />[/u][/b][list][*]If you have only installed the application in a single directory/folder, I recommend downloading the zip file and copying the new executable over the old one.\r<br />[*]If you have multiple copies, I recommend using the “Updater” for the appropriate version.  This is NOT a true installation program.  All it does is check the Windows registry for folders that the application has been installed to and attempts to replace the executable in each folder with the embedded update automatically.  This method may not work in a non-Microsoft version of .NET.  If you are using a Mac or non-Windows OS, you will probably need to copy the executable from the zip to the appropriate folders yourself.\r<br />[/list] \r<br />[b]\r<br />\r<br />[u]A Note About Backups:[/u][/b]\r<br />ENB Workshop will automatically create a backup of all files belonging to a particular ENB the immediately before the first time it is saved.  After that it will not back-up the current ENB again.  You may however click the button at the bottom right to manually back up the ENB again.  \r<br />\r<br />If you switch ENBs (only possible when you have either enabled ENB’s or an ENB Manager setup), the “first time” flag is reset so that a backup is created the first time you save the newly selected ENB\r<br />\r<br /> \r<br />\r<br />[b]Getting Started:[/b]\r<br />If you are using an ENB Manager installation, you may need to select the ENB you wish to modify.  However, if an ENB is already installed, it will load the current ENB by default.\r<br />\r<br />If you are using the app to modify some basic settings, use the first “Quick Settings” tab to modify basic ENB settings.  \r<br />\r<br />For Detailed walkthroughs and an in depth look at features, please download the User Guide from the files section [Coming soon].\r<br />\r<br />[u][b]Basic Navigation:[/b][/u]\r<br />The ENB Workshop User interface is divided into three basic parts.  \r<br />[list][*][b]The “Navigation bar”[/b] is the toolbar at the top. Use this to navigate to the appropriate preset file or to change the “navigation” abilities of the current installation.  This bar also has a save button for applying/saving the changes to the current preset file; and the application settings button.  Both of these are located in the upper right corner.\r<br />[*][b]The tab control[/b] is the main area where you can view and change settings.  \r<br />[*][b]The “Preset button bar”[/b] at the bottom provides basic buttons for actions that you may perform on the currently loaded preset file. \r<br />[/list][b]NOTE:[/b]  The tab control and Preset button have a background color that tells you the kind of preset file you are currently working on.  If the color is a [color=#b8b840]goldenrod-ish[/color] color that means that the currently loaded file is the main/master preset file (enbseries.ini).  If the color is [color=#778899]light slate grey[/b][/color][b] that means you are currently working on a weather preset.  The names of these preset files are given by the preset designer.  Both these names and the weathers associated with this preset are stored in the _weatherlist.ini file in the enbseries folder.  This file is automatically tracked and updated as needed.  You do not need to worry about this file if you use the software as it was intended to be used.  (Keep in mind that this is still a beta version). \r<br />\r<br />[b]\r<br />[u]Working with Existing ENBs and Weathers:[/u][/b]\r<br />Important Note About Weather based ENB Presets: Some ENB authors do not format the _weatherlist.ini properly.  If this is the case ENB Workshop will not count the number of currently used sections/slots properly (because weather slots are skipped).  As a result, the ENB may not work properly after being modified by ENB Workshop.  I plan to fix this in the future but for now, you may want to check and fix the weather file.  A weather section starts with square brackets around the section name.  Section declarations will always follow the format [WEATHERXXX] where XXX are three numbers and the settings for that section.  Unused sections (empty slots) only have a “FileName” line with no file name declared. Things to look out for:\r<br />\r<br />[list][*]Weather sections that are out of order.  (This shouldn’t cause a problem with existing weather slots but may result in weather slots not being available)\r<br />[*]Weather sections (slots) that are skipped; meaning that they have no file name declared and no ”WeatherIDs” line; but other sections with data exist below them.  (THIS WILL CAUSE A PROBLEM)\r<br />[*]Weather files that are declared but no “WeatherIDs” line exists (This will cause a minor problem in that the line will be overwritten.  Since no weather ids exist however, it will not change the way the ENB works).\r<br />[/list]\r<br />[i][b]When viewing a weather preset[/b][/i], the panels with plus and minus signs next to them will sometimes appear faded but not greyed out.  This means that the section is included in the weather file but the section is [b]not [/b]enabled in the master file.   All sections that can be enabled for weather will have a checkbox next to them EXCEPT for items on the &#34;Sky Coloring&#34; and most on the &#34;Celestial Objects&#34; tabs.  To enable a section with a checkbox make sure that the checkbox is in the &#34;third&#34; or boxed state.  (Not the checkmark state).  For the SKY related objects on the two tabs mentioned above, simply use the checkboxes under &#34;Enabled Settings&#34; on the &#34;Sky Coloring&#34; tab. \r<br />\r<br />\r<br /> [u][b]Removing:[/b][/u]\r<br />If you decide to remove this application, the best thing to do is to use the removal tool that is provided in the “Miscellaneous files” section.  Each user who has used this program must do this separately.  You may also remove the program manually using the steps below.  Keep in mind that the registry step is required only if you “install” the program in the given locations again.  Manual removal steps (must be done separately for each user):\r<br />[list=1][*]Remove the program from all folders that contain the executable\r<br />[*]For each user who has used the tool, log into their profile.\r<br />[*]Run regedit (from command box, command window, or using find)\r<br />[*]Find the “Computer&#92;HKEY_CURRENT_USER&#92;Software&#92;IMT” key\r<br />[*]If you have other IMT software, you must delete the “ENBWorkshop” sub-key.  Otherwise you can delete the entire IMT key.\r<br />[*]Repeat steps 2-6 for each user of the program.\r<br />[/list][u]\r<br />[/u][u] [b]Source Code:[/u][/b][u]  [/u]\r<br />If you are interested in the source code for this project, please message me.  I will eventually release it when I am ready to let others &#34;carry the torch.&#34;    \r<br />_________________________\r<br />[size=1]Composed/Posted with [url=http://www.shajul.net/]WYSIWYG BBCode Editor[/url][/size]",
  "categoryId": "39",
  "version": "0.76Beta",
  "author": "primem0ver",
  "createdUnix": "1453675066",
  "updatedUnix": "1460186394",
  "containsAdultContent": false,
  "uploadedBy": "primem0ver",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000196538",
      "name": "ENBWorkshop.zip (0.70 Beta)",
      "version": "0.70Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "857",
      "fileName": "ENBWorkshop.zip (0.70 Beta)-72902-0-70Beta.zip",
      "uploadedUnix": "1456043402",
      "modVersion": "0.70Beta",
      "virusScanUrl": "https://www.virustotal.com/file/c5cf0cc4826a8603080414ab6b80fe1f198514b816901bc9af12dbd07dbe8ccb/analysis/1456043416/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENBWorkshop.zip%20%280.70%20Beta%29-72902-0-70Beta.zip?fid=1000196538&ttl=1535861477&ri=8192&rs=8192&setec=8aa94702bfc46b3ac8366cf894e25906"
    },
    {
      "fileId": "1000196539",
      "name": "User Guilde 0.70b (PDF format)",
      "version": "0.70Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "938",
      "fileName": "User Guilde 0.70b (PDF format)-72902-0-70Beta.zip",
      "uploadedUnix": "1456043658",
      "modVersion": "0.70Beta",
      "virusScanUrl": "https://www.virustotal.com/file/2d26d065ad1da764153ccd7e53eb39f0af3627bbc46ec613098c8bf0c43a48e5/analysis/1456043704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/User%20Guilde%200.70b%20%28PDF%20format%29-72902-0-70Beta.zip?fid=1000196539&ttl=1535861477&ri=8192&rs=8192&setec=7edcf5cf84967d46ad854ff6c1b03bc9"
    },
    {
      "fileId": "1000200746",
      "name": "ENBWorkshop.zip (0.75 Beta)",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "863",
      "fileName": "ENBWorkshop.zip (0.75 Beta)-72902-.zip",
      "uploadedUnix": "1459083090",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d822578f11abd0b7353763215d3503e30f1372676bff8a53fc77b15fb035c414/analysis/1459083124/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENBWorkshop.zip%20%280.75%20Beta%29-72902-.zip?fid=1000200746&ttl=1535861478&ri=8192&rs=8192&setec=89a6faf77f7dca23097b99c7002d9d79"
    },
    {
      "fileId": "1000202359",
      "name": "ENBWorkshop.zip (0.76 Beta)",
      "version": "0.76Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "863",
      "fileName": "ENBWorkshop.zip (0.76 Beta)-72902-0-76Beta.zip",
      "uploadedUnix": "1460186394",
      "modVersion": "0.76Beta",
      "virusScanUrl": "https://www.virustotal.com/file/3846570febdb388a16e9c272e26f4efce3af5b5b9adecf137b633f8fba2e6335/analysis/1460186404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ENBWorkshop.zip%20%280.76%20Beta%29-72902-0-76Beta.zip?fid=1000202359&ttl=1535861478&ri=8192&rs=8192&setec=a26db0c8cfddfb561c2cf7877bcc8bc4"
    }
  ]
}