{
  "modId": 7297.0,
  "modName": "Alternative Start - Avikir a redguard sailor - RP",
  "summary": "Taking a break from the Sailors life, Avikir heads to Skyrim to visit his long time friend, Hadvar.  He recieves a letter that Hadvar is staying with his Uncle Alvor.  The life of a Sailor is a rough one and Avikir is happy to be back on solid land.  ",
  "descriptionHtml": "The smell of the sea is strong on the air of the port city, Stros M\\'kai.  Growing up, Avikir loved that smell and longed to sail the sea on day.  Every Fredas, his father would think about how Avikir had behaved that week.  If he had been good, he would get to go with his father on his weekend fishing trip, but if he had been bad he would have to stay home.  This quickly turned him into a very moral child.  The only other activity he looked forward to was sword training.  All Redguards are trained to use a sword growing up, so whenever he had time he would practice.  Avikir became extremely skillful with his sword, even for a Redguard.  Then the day finally came when he was old enough to sail.  He signed up for a rich merchant’s ship that was leaving Stros M\\'kai.  The night before his departure, his father gave him a present.  His father took the families silver scimitar out of its case on the wall and handed it to his son.  He said that this blade had been passed down from father to son since the ancient Redguards journey from Yokudan.  The next morning, Avikir loaded his supplies and sailed off with the ship.  The ship was sailing along when it was attacked by pirates.  The pirates charged and Avikir drew his scimitar.  All the sailors ran to the cabin for cover as the pirates boarded.  After downing a few pirates, Avikir noticed everybody running seeing that it was hopeless to try and defeat them all himself, he started running toward the cabin too.  Unfortunately just as he was about to get inside, they locked him out.  The pirates were advancing so Avikir turned to face them.  The first pirate slashed out.  Avikir dodged and sliced him in gut.  The second pirate swung and Avikir blocked and countered, stabbing him in the chest.  More pirates charged and they were cut down.  The remaining pirates jumped ship and swam back to theirs sailing off into the distance.  The rest of the crew came out cheering and praising Avikir.  Then the captain called him into his cabin.  He thanked Avikir and explained who he was.  He was actually a ranking official in the East Empire Company who was undercover as a merchant because of the important cargo they were hauling.  The pirates must have gotten wind of the operation and would have taken the cargo and killed everyone if Avikir hadn\\'t fought them off.  He then handed Avikir a large pouch full of gold and offered him a permanent job as a member of the East Empire Company.  Avikir accepted and his new life as an official sailor began.  A few years later Avikir was assigned to sail a ship carrying some imperial soldiers.  During the trip they were attacked by a Thalmor raiding ship.  The Thalmor boarded and there was a bloody battle.  Instead of heading to the barracks beneath with the other sailors, Avikir stayed up top to fight with the soldiers.  He hacked and slashed those Thalmor but more kept coming.  Out of the corner of his eye he saw a Thalmor knock down one a nord soldier.  The Thalmor was raising his sword to end the soldier’s life.  Without even thinking, Avikir threw his scimitar right into the Thalmor\\'s chest, pinning him to the mast.  Avikir then raced over, tore out his scimitar and threw the elf overboard.  He then regained his senses and helped the soldier up.  Soon after, the battle was won.  That night Avikir was invited to the soldier’s barracks for a night of songs and mead.  The soldier he had saved called him over.  They talked and sang and danced and eventually became great friends.  Hadvar, which was the soldier’s name, raised a toast to Avikir and the soldiers sang a song in his honor.  After that battle the ship made it to port smoothly.  A year later, Avikir had saved up enough money that he decided to take a vacation.  He sent the money to his parents and took a low maintenance shipping job to Skyrim, in hopes of finding his friend Hadvar.  He was told that Hadvar\\'s uncle, Alvor, would know where to find him.  Avikir took his pay and now starts off on his quest to find his friend.  \r\n\r\nThis is an alternative start.  Avikir\\'s skills are:\r\nOne handed is at 40 (with a few perks) because of his training with a sword\r\nAlchemy is at 20 for making medicine to cure diseases on the high seas\r\nSmithing is at 20 for fixing the ship\r\nBlock is at 10 since a swordsman needs to know how to block with his sword, but Avikir prefers to slash\r\nArchery is at 20 so he can shoot pirates off a ship\r\nSpeech is at 20 for selling items\r\n\r\nRequirements:     \r\nWeapons of the Third Era (Use this to get Avikir\\'s silver scimitar)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3871\r\n\r\nCredits:\r\nAOF Believable Hair-Female and Male- (I used this to boost the hair quality in the screenshot)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4307\r\n\r\nXCE - Xenius Character Enhancement (I used this to boost the characters looks in the screenshot)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2356\r\n\r\nRecommendations: (I, of course, recommend the mods I used above along with these)\r\nJaySuS Swords \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1002\r\n\r\nFur Hoods HD \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3201\r\n\r\nA Quality World Map - With Roads\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=4929\r\n\r\nCompelling Treasure Maps\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6907\r\n\r\nDeadly Dragons\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3829\r\n\r\nDFB Companion Bow Visible\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6520\r\n\r\nDovahkiin Hideout\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6032\r\n\r\nFirewood For Sale\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5653\r\n\r\nI Put A Spell On You - More Enchanting Options \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3313\r\n\r\nLord Armor\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5853\r\n\r\nMidas Magic - Spells in Skyrim\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3413\r\n\r\nNPC Bartering\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6802\r\n\r\nPhenderix Magic Evolved - 144 New Spells\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5898\r\n\r\nPricier and Heavier Pelts and Hides \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7039\r\n\r\nQuick Tomb Looting\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6591\r\n\r\nSkyrim Performance PLUS\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6387\r\n\r\nSkyrim Nordplate Enhanced\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6804\r\n\r\nWars in Skyrim IV - Dark Rainbow is back-\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6176\r\n\r\nWitchers Blades\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6253\r\n\r\nVarious Guards Outfit for Every City TS Edition \r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6770\r\n\r\n\r\nBugs/Issues/Questions\r\nIf there are any problems or general questions feel free to voice them in the comments section which I will try to check often\r\n",
  "categoryId": "43",
  "version": "1",
  "author": "SoldierForSkyrim",
  "createdUnix": "1327851372",
  "updatedUnix": "1327851419",
  "containsAdultContent": false,
  "uploadedBy": "SoldierForSkyrim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23970",
      "name": "Avikir",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1338",
      "fileName": "Avikir-7297-1.zip",
      "uploadedUnix": "1327851419",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/914332f0a67c0fb6f77dc7ded4a1ab656fc0a6237061201dd618a5e87bc3a146/analysis/1406643527/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Avikir-7297-1.zip?fid=23970&ttl=1535765243&ri=8192&rs=8192&setec=aa273054ee86a569b97fa8d0f2e4ecb8"
    }
  ]
}