{
  "modId": 72982.0,
  "modName": "Requiem - Rigmor Patch",
  "summary": "Requiem patch for Rigmor of Bruma",
  "descriptionHtml": "Rigmor of Bruma http://www.nexusmods.com/skyrim/mods/53068/?\r<br />Reqiem - The Roleplaying Overhaul  http://www.nexusmods.com/skyrim/mods/19281/?\r<br />\r<br />I decided to play Rigmor of Bruma mod one weekend, and being a Requiem must-have player, I took a look at both mods and tried to get them to work without Rigmor being overpowered.  Suprisingly I only needed to make the below changes.  I played this on a new game, minimal mods.  Purpose was to play this from start to end and decide at the end if I wanted to continue on.  It took me 30 hours from start to finish to complete Rigmor of Bruma.  It was a challenge from start to finish, never seemed unbalanced, loot was right in line with Requiem.  \r<br />\r<br />I did not start the game as a noob though, I saw videos of the mod so knew what was coming, and being level 1 in Requiem and starting this mod was certain death at every turn.  Thalmor, Thalmor wizards with their fire spells, and Orcs with Orc armor (all in great numbers) are the main challenge, so in an unleveled world, I needed to be able to deal with them at the start.  So I setup my character in this way:\r<br />I was a Nord, playing a warrior kidnapped from Helgen\r<br />I chose LAL Warlock Thrall start for the 20% magic resistance ring\r<br />I then gave myself the following at the start:\r<br />Lord Stone (15% more magic resistance) - Would need it against the spells\r<br />Skill 25 for Heavy Armor, One Handed, Marksman, Restoration, Smithing, Block - along with the perks available at those skill levels\r<br />Set of heavy plate armor, silver sword, steel crossbow\r<br />Heal Self and healing Hands spells\r<br />Disabled armor penalties for spell casting (I had no balance problems, it was more for convenience since those are the only spells I used)\r<br />Health 200, Stamina 140, magicka left at 80\r<br />\r<br />As Rigmor calls you the Dragonborn, I wanted to do the main quest up to where I get the 3rd word of Unrelenting Force.  I was powerful enough to do this from the start.  These were my steps:\r<br />Escape cave\r<br />Go to Riften\r<br />Go to Helgen, start main quest\r<br />Warn Alvor\r<br />Tell the Jarl\r<br />Go to BleakFalls\r<br />Kill the dragon (leave Lydia in Whiterun)\r<br />Go to High Hrothgar\r<br />Go to Ustengrav\r<br />Get the horn (don&#39;t talk to Delphine after she gives you the horn)\r<br />Return to Greybeards\r<br />I am now Dragonborn\r<br />Go to Riverwood and start Rigmor (you get a horse&#33;&#33;)\r<br />I then followed the quest.  Only side quest I did was White Phial as it was on the way during the Rigmor quest\r<br />At the end I was level 27\r<br />Armor rating was around 700-800 for most of the game.  With the numbers of archers and enemies, you get hit alot.  I would have died constantly.\r<br />As it was I only died a couple times from fire spells and one part toward the end I had to TGM as I would have to gain probably 20 more levels and find a bunch of items to deal with those Requiem powered enemies.  You will know of what I speak when you play it and you get to that part (AKA Oblivion).\r<br />\r<br />\r<br />The game was very balanced, engaging like no other mod I have played (except the first times I played Requiem), and I can only say, experience it yourself.  If you are interested in my load order for this game I will paste it in forums tab.\r<br />\r<br />Soooo......\r<br />This small patch for Rigmor of Bruma changes some weapon stats and NPC records to be in-line with Requiem (or close enough).  These are the changes made by the patch:\r<br />\r<br />Ammunition:\r<br />Khajit Long Bow Arrow - slightly better than steel arrow, weight light arrow\r<br />Silver arrows - made same as Requiem\r<br />\r<br />Weapons:\r<br />Angi&#39;s Bow - Made slightly better than Requiem (damage 25 instead of 20) - non-breakable\r<br />Angi&#39;s Special Bow - Made slightly better than Requiem (damage 25 instead of 20) - non-breakable\r<br />Rigmor Bastard Sword - damage same as Daedric Greatsword - but not the perks or keywords - still Steel\r<br />Azuras Bane - damage same as Daedric Greatsword - but not the perks or keywords - still Steel\r<br />Morganna - damage same as Daedric Greatsword - but not the perks or keywords - still Steel\r<br />Goldbrand - same as Dawnbreaker stats including Daedric and Silver keyword\r<br />Khajiit Long Bow - Made it light and non-breakable, same damage as a wooden long bow\r<br />Emperor - Slightly better than an Imperial Sword\r<br />Hammer Of The Gods - Slightly better than a steel warhammer\r<br />Xenia&#39;s Wrath - Same as Orc Bow just a bit lighter\r<br />\r<br />NPCs:\r<br />LvlBandiAmbushMelee1H - Made same as Requiem\r<br />LvlBanditAmbushMeleeEvenTonedM - Made same as Requiem\r<br />EncTroll - Same as Requiem\r<br />Rigmor_NPC - added some heavy armor perks, health and stamina offsets.  Added lighfoot perk late in playthrough so do not know if it works.  She keeps setting off traps, even with follower trap safety installed.\r<br />\r<br />\r<br />Load order (on my playthrough):\r<br />Skyrim\r<br />mods\r<br />..\r<br />Requiem\r<br />Requiem patches\r<br />Alternate Start\r<br />Rigmor.esp\r<br />Requiem-Rigmor Patch.esp\r<br />Requiem For The Indifferent.esp\r<br />DYNDOLOD.esp",
  "categoryId": "84",
  "version": "1",
  "author": "peter1962",
  "createdUnix": "1453940017",
  "updatedUnix": "1453939422",
  "containsAdultContent": false,
  "uploadedBy": "peter1962",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000193057",
      "name": "Requiem - Rigmor Patch",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Requiem - Rigmor Patch-72982-1.7z",
      "uploadedUnix": "1453939422",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/cef248214e72a616a9ce8e444f9def07567bdc5f4341710ecdf484e80b85b9f9/analysis/1453939443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Rigmor%20Patch-72982-1.7z?fid=1000193057&ttl=1535861579&ri=8192&rs=8192&setec=48dd0cf01eddc9fa4aa47634df534d91"
    }
  ]
}