{
  "modId": 72999.0,
  "modName": "Be With Healer",
  "summary": "You are able to choose companion who put healing spell on you like a cleric from your favorite followers. Your healer will cast healing spell on the person whom you selected not only your companions. Also you can set that any enemy might become the enemy side healer.",
  "descriptionHtml": "\r<br />[color=#d0e0e3][size=4]You are able to choose companion who put healing spell on you like a cleric from your favorite followers.\r<br />Your healer will cast healing spell on the person whom you selected not only your companions.\r<br />Also you can set that any enemy might become the enemy side healer.[/size][/color]\r<br />\r<br />[size=3]This mod enables a healing to any npc whom you selected from your favorite companion who has not special behavior in battle. The purpose of this mod is to make the journey with favorite follower who will assist player from time to time using healing and light magic like the cleric class. This mod is a part of my faction mod. I thought that I want more assistant for adventure. So I had duplicate a part of healer function as new mod.\r<br />Enjoy an adventure of the land of skyrim with your favorite companions.[/size]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]Features[/size][/color]\r<br />[list]\r<br />[*][size=3]Healer will try to cast healing spell to player, your follower and selected npcs.[/size]\r<br />[*][size=3]Healer will try to cast courage to player. (Dialogue and MCM configuration).[/size]\r<br />[*][size=3]Healer will try to cast courage to your follower or selected npcs who is under the influence of fear spell. (MCM configuration)[/size]\r<br />[*][size=3]Healer will try to cast protection spells (Oakflesh, Ironflesh, Stoneflesh, Ebonyflesh) to player, your follower and selected npcs. (MCM configuration).[/size]\r<br />[*][size=3]Healer will try to cast magelight continually to player, if player ask (Dialogue configuration)[/size]\r<br />[*][size=3]Healer not cast magelight continually at specific location that is castle, inn, guild, playerhouse. (Location that has keywords LocTypeInn, LocTypeGuild, LocTypePlayerhouse, LocTypeHouse)[/size]\r<br />[*][size=3]Healer will try to remove paralysis against player, your follower and selected npcs. (MCM configuration)[/size]\r<br />[*][size=3]Healer will try to cast hold planar(paralysis atronach) spell to hostile atronach. (MCM configuration)[/size]\r<br />[*][size=3]Healer will try to cast fear spell to humanoid type enemy around player in the limited situation. (MCM configuration)[/size]\r<br />[*][size=3]Player can call healer who is missing to player&#39;s place. (MCM configuration)[/size]\r<br />[*][size=3]Player can call heal target who is missing to player&#39;s place. (MCM configuration)[/size]\r<br />[*][size=3]Player can choose priority of healing target. Player or your companion(selected npc) group. (MCM configuration)[/size]\r<br />[*][size=3]Player can select healing target using spell. It means that target is not necessarily your companions. It is suitable, such as the mission to escort someone. If you choose at a minimum selection, players will be also included. (Use modify spell)[/size]\r<br />[*][size=3]If you can manage spellcasting voice file, put them to prepared folder and enable MCM item:&#34;Chant voice type&#34;. The folder location is data - sound - fx - mx2bwh - chant - type01 or type 02 or type03 or type04 or type05. [/size]\r<br />[*][size=3][color=#a2c4c9](version 1.3) [/color]Healer will try to cast healing spell to non hostile npcs(not follower, not playertammate). (MCM configuration)[/size]\r<br />[*][size=3][color=#a2c4c9](version 1.3) [/color]Illusionist will cast mainly illusion spells(Calm, Fear, Fury) to enemies.[/size]\r<br />[*][size=3][color=#a2c4c9](version 1.3) [/color]Illusionist will cast healother spell (MCM option: &#34;Allow healing work&#34;). Not cast grandhealing spell. Healing target is automatically selected. Target selection is not available. Also the illusionist will try to cast healing spell to non hostile npcs. (MCM configuration)[/size]\r<br />[*][size=3][color=#a2c4c9](version 1.3) [/color]Defender will prefer attack enemies that has attacking healer or illusionist or player(selection by dialogue). The enemy attacked might change target to the defender. Defender will assist the healer, but the role is NOT TANK.[/size]\r<br />[*][size=3][color=#a2c4c9](version 1.3) [/color]One of enemies might become the enemy side healer with a low probability. This is temporaly function. (MCM configuration)[/size]\r<br />[*][size=3][color=#a2c4c9](version 1.4) [/color]Healer will try to cast elemental resistration spells (Resist fire, Resist frost, Resist shock, Resist magic) to player, your follower and selected npcs. (MCM configuration)[/size]\r<br />[*][size=3][color=#a2c4c9](version 1.4) [/color]Player can apply medicine potion to your teammate and non hostile people by activating. In role play of a pure warrior build, player can go near the damaged healer and recover with medicine, not magic. (MCM configuration)[/size]\r<br />[/list]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]Update to v1.4 from v1.3 or v1.2 or v1.1[/size][/color]\r<br />[list=1]\r<br />[*][size=3]Before install v1.4, Enable MCM item:&#34;Uninstall&#34; and close MCM menu.[/size]\r<br />[*][size=3]Wait a sec.[/size]\r<br />[*][size=3]Save and quit Skyrim[/size]\r<br />[*][size=3]Uninstall old version and Install v1.4[/size]\r<br />[*][size=3]Start skyrim.[/size]\r<br />[*][size=3]Enable MCM item:&#34;Enable healer system&#34; and close MCM.[/size]\r<br />[*][size=3]Talk to your follower who you want to request healing work again.[/size]\r<br />[/list]\r<br />[size=3]If you do not feel that there are any problem on old version, it is not necessarily to update to v1.4.\r<br />Please check change log.[/size]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]Requirement[/size][/color]\r<br />[list]\r<br />[*][size=3]Skyrim 1.9.32 or latest[/size]\r<br />[*][size=3]Skyrim Script Extender (SKSE) 1.7.03 or latest[/size]\r<br />[*][size=3]SkyUI 4.1 or latest[/size]\r<br />[/list]\r<br />\r<br />[color=#a2c4c9][size=4]Installation[/size][/color]\r<br />[size=3]I highly recommend the following tools for install. NMM or MO or Wrye Bash.[/size]\r<br />\r<br />[size=3]Enter MCM menu and enable Item:Enable healer system.\r<br />Talk to your follower who you want to request healing work. Adjustment is available with dialogue and MCM.[/size]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]Uninstallation[/size][/color]\r<br />[size=3]Enter MCM menu and enable item:Uninstall. Close MCM menu and wait few seconds. Save and quit game.  Deactive MX2BeWithHealer.esp.[/size]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]Healer response[/size][/color]\r<br />[size=3]To expect more response, you are able to modify.[/size]\r<br />[list=1]\r<br />[*][size=3]MCM item:&#34;Combat update time&#34; value change to lower. [/size]\r<br />[*][size=3]Enable MCM item:&#34;Always CombatUdateTime&#34;.[/size]\r<br />[/list][size=3]Because there are a number of skyrim environment by players, the default setting is not high.[/size]\r<br />[size=3]When mod environment is heavy load and value of &#34;Combat Update Time&#34; is minimum, remember that there is a possibility that healer is no longer work right.[/size]\r<br />\r<br />[size=3]If healing target is player only and if you think that is not necessary to cast to enemy, healer action can change to ai package. Enable MCM item:&#34;Allow package driven&#34;. Although it is not constant monitoring with script, healer can cast healing, courage, magelight, protection, cure paralysis to player.[/size]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]Target selection[/size][/color]\r<br />[size=3]There are 3 method of target selection of the healer. &#34;Use target list&#34; or &#34;Auto finding&#34; or &#34;Vanilla follower only&#34;.[/size]\r<br />[size=3]To change this method, need to re-request as healer with dialogue.[/size]\r<br />[list]\r<br />[*][size=3]Use target list - Default setting. Need to add npcs that you want to recovery. Even if player is not listed, the player is included. This was default setting as version 1.0, 1.1, 1.2.[/size]\r<br />[*][size=3]Auto finding - NPC that have the following flag will selected. Follower or PlayerTeammate.[/size]\r<br />[*][size=3]Vanilla follower - Vanilla follower system only.[/size]\r<br />[/list]\r<br />\r<br />[color=#a2c4c9][size=4]How to modify healing target list (for &#34;Use target list&#34; method)[/size][/color]\r<br />[size=3]Selected healing target system require that the following MCM item state is enable. MCM Item:&#34;Alternate heal target&#34; list.[/size]\r<br />[size=3]When player equip modify spell - &#34;Be With Healer modify spell (MX2)&#34;, healer will grow orange and healing target grow purple effect.[/size]\r<br />\r<br />[size=3]To add specific npc to healing target list[/size]\r<br />[list]\r<br />[*][size=3]Talk to healer and select &#34;Check your recovery target.&#34;[/size]\r<br />[/list][size=3]or[/size]\r<br />[list=1]\r<br />[*][size=3]equip select spell - &#34;Be With Healer modify spell (MX2)&#34;[/size]\r<br />[*][size=3]cast the spell to healer.[/size]\r<br />[*][size=3]select &#34;Set neart targets&#34;[/size]\r<br />[/list][size=3]or[/size]\r<br />[list=1]\r<br />[*][size=3]equip select spell - &#34;Be With Healer modify spell (MX2)&#34;[/size]\r<br />[*][size=3]cast the spell to npc that you want to add to healing target list.[/size]\r<br />[*][size=3]select &#34;Add&#34;[/size]\r<br />[/list]\r<br />[size=3]To remove specific npc from healing target list[/size]\r<br />[list=1]\r<br />[*][size=3]equip select spell - &#34;Be With Healer modify spell (MX2)&#34;[/size]\r<br />[*][size=3]cast the spell to npc that you want to remove from healing target list.[/size]\r<br />[*][size=3]select &#34;Remove&#34;[/size]\r<br />[/list]\r<br />[size=3]To clear healing target list[/size]\r<br />[list]\r<br />[*][size=3]Talk to healer and select &#34;Special recovery target is not exist now.&#34;[/size]\r<br />[/list][size=3]or[/size]\r<br />[list=1]\r<br />[*][size=3]equip select spell - &#34;Be With Healer modify spell (MX2)&#34;[/size]\r<br />[*][size=3]cast the spell to healer or npc.[/size]\r<br />[*][size=3]select &#34;Clear list&#34;[/size]\r<br />[/list]\r<br />\r<br />[color=#a2c4c9][size=4]Enemy side healer[/size][/color]\r<br />[size=3]This function is a possibility that the enemies like bandits, forsworn, necromancer, warlock and vampire has a healer with a low probability. This feature add the healer ability temporary to enemy that already exist. It is recommended that use any enemy increase mod. When use this feature, enable mcm item &#34;Enable Enemy Healer&#34;. It is possible to disable this function at any time.[/size]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]To give medicine[/size][/color]\r<br />[size=3]This option allows you to give a recovery potion to your teammate and non hostile people by activating.[/size]\r<br />[size=3]It is available when target health is low or in combat condition.[/size]\r<br />[size=3]In role play of a pure warrior build, you can go near the damaged healer and recover with medicine, not magic.[/size]\r<br />[size=3]For use with EFF, this option works only on Dialogue menu mode.[/size]\r<br />\r<br />\r<br />[color=#a2c4c9][size=4]Note[/size][/color]\r<br />[list]\r<br />[*][size=3]Spellcasting will be interrupted when healer is attacked.[/size]\r<br />[*][size=3]Even if healer does not have healother spell and courage spell, healer can cast these spells.[/size]\r<br />[*][size=3]Healer who amount of magicka is 0 can&#39;t cast a healing spell. Enable mcm item:&#34;Additional magicka&#34;.[/size]\r<br />[*][size=3]To receive the recovery magic, targets including player must be within a distance set by MCM.[/size]\r<br />[*][size=3]Even if player is not listed when player check a target list, the player is included.[/size]\r<br />[*][size=3]When player is sneaking during 5 second, magelight that healer put on will disappear.[/size]\r<br />[*][size=3]When healing target dies, target will be removed from target list. If healer cast healing spell to dead npc repeatedly, try to use modify spell. Select &#34;remove&#34; or &#34;remove dead from list&#34;.[/size]\r<br />[*][size=3]The behavior of the healer is based also on his(her) own combat style.[/size]\r<br />[*][size=3](Option) Player can ask healer role to your follower. Also it is possible to ask healer role to some people who is not hostile by MCM configuration. For example, Adrianne and Balgruuf. Heimskr cannot become your healer. He has strong will. When MCM item:Force follow is enable, It it possible that any quest that healer belongs to may not continue properly.[/size]\r<br />[*][size=3](Option) Healer&#39;s AI value and Combat Style can be changed on MCM. By modified these values, it changes the behavior of the healer in combat. Do not melee attack or prefer melee attack and frequently shield bash or etc. It need to enable MCM item:Extended Info. Also please refer to [url=http://www.creationkit.com/index.php?title=AI_Data_Tab]AI Data Tab (Creation Kit)[/url] and [url=http://www.creationkit.com/index.php?title=Combat_Style]Combat Style (Creation Kit)[/url].[/size]\r<br />[*][size=3]&#34;Close Range Dueling Circle Mult&#34; and &#34;Close Range Fall back Mult&#34; belongs at &#34;Dueling&#34; on Combat Style Tab &#34;Close Range&#34;. Also &#34;Close Range Flank Distance&#34; and &#34;Close Range Flank Stalk Time&#34; belongs at &#34;Flanking&#34; on Combat Style Tab &#34;Close Range&#34;. Dueling or Flanking, either one is available and it is determined by npc own combat style data. It cannot change from mcm. It can check by Creation kit and TES5Edit. If you want to use &#34;Flanking&#34;, but current combat style is &#34;Dueling&#34;, you should change it on Creation Kit or TES5Elit, or find other follower who has &#34;Flanking&#34; in combat style.[/size]\r<br />[*][size=3]Remember that when player ask healer role to npc, AI values and some combat style values is memorized. when healer role is finished, memorized values will be recovered.[/size]\r<br />[*][size=3]When healing target is player only, it is possible to change healing method. Player can chosse ai package driven or constant monitoring with OnUpdate function. MCM item:&#34;Allow package driven&#34; mean change healing function by the number of targets. The default setting is enabled.[/size]\r<br />[*][size=3]If mcm item:&#34;Learned spell only&#34; has been enabled, healer can cast spell that has learned spells only except healother and courage and cure paralysis and hold planar. (Check target: GrandHealing, Oakflesh, Ironflesh, Stoneflesh, Ebonyflesh)[/size]\r<br />[*][size=3]When healing target is player only and MCM item:&#34;Allow package driven&#34; is enabled, healer would not cast fear spell.[/size]\r<br />[*][size=3]Defender is NOT TANK. Defender will not provoke enemies actively. If aggresive provoke is needed, it is better to use other mods. And it is not recommended that assign this function to teammate who has already similar function by other mod.[/size]\r<br />[/list]\r<br />\r<br />[color=#a2c4c9][size=4]Compatibility[/size][/color]\r<br />[size=3]For the followers that has their own behavior, there is a possibility that it does not work as expected.\r<br />I ordinarily use a not complex follower extension mod. I not use EFF and AFT. I tried to use EFF with my mod. It seem to work fine. Also AFT seem to work fine.\r<br />[/size]\r<br />\r<br />[color=#a2c4c9][size=4]Changelog[/size][/color]\r<br />\r<br />[size=3]v1.4 (20170225)[/size]\r<br />[list]\r<br />[*][size=3]Version 1.4 mainly fixes some problems that are not fatal.[/size]\r<br />[*][size=3]Modified the behavior of healer to reduce the unnatural movements than the old version.[/size]\r<br />[*][size=3]Modify: Healing logic and part of constant monitoring function.[/size]\r<br />[*][size=3]Modify: Spellcasting scene. Courage, Rally, Armor spells.[/size]\r<br />[*][size=3]Modify: Enemy healer function.[/size]\r<br />[*][size=3]Modify: Spellcasting voice folder with invisibility spell and muffle spell is prepared.[/size]\r<br />[*][size=3]Fix: Healer sometimes do not cast courage spell.[/size]\r<br />[*][size=3]Fix: Some problems that are not fatal.[/size]\r<br />[*][size=3]Add: Healer can cast elemental resistance spells on player and follower and selected npcs in combat. (MCM configuration)[/size]\r<br />[*][size=3]Add: MCM item:&#34;Give potion&#34;. This option allows you to give a recovery potion to your teammate and non hostile people. (MCM configuration)[/size]\r<br />[/list]\r<br />[size=3]v1.3 (20160910)[/size]\r<br />[list]\r<br />[*][size=3]Modify: Healing logic and part of constant monitoring function. Especially, behavior of healer in Soul Cairn.[/size]\r<br />[*][size=3]Modify: Healer and illusionist both can cast a healing spell to non nostile npcs(not follower, not playertammate). (MCM configuration)[/size]\r<br />[*][size=3]Add: Illusionist. Spellcaster for Calm, Fear, Futy and healing(Healother) spell only. (MCM configuration)[/size]\r<br />[*][size=3]Add: Defender. Prefer attack enemies that has attacking healer or illusionist or player(selection by dialogue).[/size]\r<br />[*][size=3]Add: Enemy healer. This function can add the temporary ability of behavior as the enemy side healer role to the enemy with a low probability, (MCM configuration)[/size]\r<br />[/list]\r<br />[size=3]v1.2 (20160506)[/size]\r<br />[list]\r<br />[*][size=3]Modify: Healing logic and part of constant monitoring function. Fluctuation of health value by Ring of Namira, Blessing of Arkay.[/size]\r<br />[*][size=3]Modify: When healing target is player only, player can choose healing function either continuous monitoring with script or ai package driven mainly. (MCM configuration)[/size]\r<br />[*][size=3]Fix: Missing textures for &#34;target selection spell&#34;.[/size]\r<br />[*][size=3]Fix: MCM item:&#34;Cast to emeny&#34;.[/size]\r<br />[*][size=3]Add: Healer can cast protection(flesh) spells on player and follower and selected npcs in combat. (MCM configuration)[/size]\r<br />[*][size=3]Add: Healer will try to cast fear spell to humanoid type enemy around player in the limited situation. (MCM configuration)[/size]\r<br />[*][size=3]Add: Healer can cast cure disease spell on player with dialogue. (MCM configuration)[/size]\r<br />[/list]\r<br />[size=3]v1.1 (20160304)[/size]\r<br />[list]\r<br />[*][size=3]Modify: Healing logic. Especially low level player state of vampiric disease.[/size]\r<br />[*][size=3]Modify: Non &#34;AlwaysCombatUpdateTime&#34; behavior.[/size]\r<br />[*][size=3]Modify: When player ask healer role to non teammate npc, PlayerTeammate flag and IgnoreFrindlyHit flag become true. When player dismiss healer, changed flag is restored. (MCM configuration)[/size]\r<br />[*][size=3](for advanced player) By using spell and MCM, player can modify healer AI value(aggression, Confidence, assistance, morality) and some Combat Style value. It need to enable MCM item:Extended Info. About AI and Combat Style, please refer to  [url=http://www.creationkit.com/index.php?title=AI_Data_Tab]AI Data Tab (Creation Kit)[/url] and [url=http://www.creationkit.com/index.php?title=Combat_Style]Combat Style (Creation Kit)[/url].[/size]\r<br />[*][size=3]Fix: Problem that are automatically dismissed when game load (for non teammate healer).[/size]\r<br />[*][size=3]Add: Dialogue type &#34;Neutral Good&#34; by dragomike. Player can change dialogue type on MCM.[/size]\r<br />[/list]\r<br />[size=3]v1.0 (20160214)[/size]\r<br />[list]\r<br />[*][size=3]Release[/size]\r<br />[/list]\r<br />\r<br />[color=#a2c4c9][size=4]Credits and thanks[/size][/color]\r<br />[list]\r<br />[*][size=3][url=http://www.nexusmods.com/skyrim/mods/3863/]SkyUI[/url][/size]\r<br />[*][size=3][url=http://skse.silverlock.org/]Skyrim Script Extender (SKSE)[/url][/size]\r<br />[*][size=3]Armor that uses on screen shot: [url=http://www.nexusmods.com/skyrim/mods/26983/]Crusaders Knights Templar Hospitaller Teutonic Medieval Armors[/url][/size]\r<br />[*][size=3]Armor that uses on screen shot: [url=http://www.nexusmods.com/skyrim/mods/14380/]Succubus Armor by Hentai 1dot2[/url][/size]\r<br />[*][size=3]NPC that uses on screen shot: [url=http://www.nexusmods.com/skyrim/mods/59449/]disciple of Anise[/url][/size]\r<br />[*][size=3]NPC that uses on screen shot: [url=http://www.nexusmods.com/skyrim/mods/69251/]Follower Soletta[/url][/size]\r<br />[*][size=3]NPC that uses on screen shot: [url=http://www.nexusmods.com/skyrim/mods/70721/]Airin Follower[/url][/size]\r<br />[*][size=3]Thanks to dragomike for lore friendly dialogue.[/size]\r<br />[*][size=3]Thanks to Bethesda.[/size]\r<br />[/list]",
  "categoryId": "66",
  "version": "1.4",
  "author": "musclex2",
  "createdUnix": "1455384554",
  "updatedUnix": "1490188185",
  "containsAdultContent": false,
  "uploadedBy": "musclex2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000195412",
      "name": "Be With Healer v1",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "397",
      "fileName": "Be With Healer v1-72999-1-0.7z",
      "uploadedUnix": "1455383895",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5c7f3562d9ec539c0f7c274478d4a1209f0647c3664d6f1074ba9e41779779d3/analysis/1455383946/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1-72999-1-0.7z?fid=1000195412&ttl=1535861597&ri=8192&rs=8192&setec=4d4a7a0a8af7286eaa766e8d3df6f6b1"
    },
    {
      "fileId": "1000198107",
      "name": "Be With Healer v1d1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "445",
      "fileName": "Be With Healer v1d1-72999-1-1.7z",
      "uploadedUnix": "1457105025",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2e59e9b735bbd9806a862892af3269ccea3782520dbc03f94160fa33096cc50d/analysis/1457105043/",
      "changelogHtml": " Modify: Healing logic. Especially low level player state of vampiric disease.\r<br />\r<br />Modify: Non &#34;AlwaysCombatUpdateTime&#34; behavior.\r<br />\r<br />Modify: When player ask healer role to non teammate npc, PlayerTeammate flag and IgnoreFrindlyHit flag become true. When player dismiss healer, changed flag is restored. (MCM configuration)\r<br />\r<br />Modify: (for advanced player) By using spell and MCM, player can modify healer AI value(aggression, Confidence, assistance, morality) and some Combat Style value. It need to enable MCM item:Extended Info. About AI and Combat Style, please refer to http://www.creationkit.com/index.php?title=AI_Data_Tab, http://www.creationkit.com/index.php?title=Combat_Style\r<br />\r<br />Fix: Problem that are automatically dismissed when game load (for non teammate healer).\r<br />\r<br />Add: Dialogue type &#34;Neutral Good&#34; by dragomike. Player can change dialogue type on MCM. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1d1-72999-1-1.7z?fid=1000198107&ttl=1535861597&ri=8192&rs=8192&setec=dfc37c99965faf179e153ddbb1a4f7ac"
    },
    {
      "fileId": "1000205594",
      "name": "Be With Healer missing textures for v1d0v1d1",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "42",
      "fileName": "Be With Healer missing textures for v1d0v1d1-72999-.7z",
      "uploadedUnix": "1462537634",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/699e80f6d4bb6cb3d010a4da6e1dfbb2a76ab35d9adea4b622e3218e398a0118/analysis/1462537682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20missing%20textures%20for%20v1d0v1d1-72999-.7z?fid=1000205594&ttl=1535861598&ri=8192&rs=8192&setec=5590e45af1265d0482fc271601c06782"
    },
    {
      "fileId": "1000205595",
      "name": "Be With Healer v1d2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "519",
      "fileName": "Be With Healer v1d2-72999-1-2.7z",
      "uploadedUnix": "1462537983",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/12bb2d0e5f50d9b0590742350fcd545860824a06054a63aaa9c01d2b3096ae52/analysis/1462538043/",
      "changelogHtml": " Modify: Healing logic and part of constant monitoring function. Fluctuation of health value by Ring of Namira, Blessing of Arkay.\r<br />\r<br />Modify: When healing target is player only, player can choose healing function either continuous monitoring with script or ai package driven mainly. (MCM configuration)\r<br />\r<br />Fix: Missing textures for &#34;target selection spell&#34;.\r<br />\r<br />Fix: MCM item:&#34;Cast to emeny&#34;.\r<br />\r<br />Add: Healer can cast protection(flesh) spells on player and follower and selected npcs in combat. (MCM configuration)\r<br />\r<br />Add: Healer will try to cast fear spell to humanoid type enemy around player in the limited situation. (MCM configuration)\r<br />\r<br />Add: Healer can cast cure disease spell on player with dialogue. (MCM configuration)\r<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1d2-72999-1-2.7z?fid=1000205595&ttl=1535861598&ri=8192&rs=8192&setec=a27188c879d20abe21f389613f8df580"
    },
    {
      "fileId": "1000220290",
      "name": "Be With Healer v1d3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "635",
      "fileName": "Be With Healer v1d3-72999-1-3.7z",
      "uploadedUnix": "1473519900",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/ce254609275cca5257b139c7991d69af9551ec91f2d401b604aeafcf2060db1b/analysis/1473519902/",
      "changelogHtml": " Modify: Healing logic and part of constant monitoring function. Especially, behavior of healer in Soul Cairn.\r<br />\r<br />Modify: Healer and illusionist both can cast a healing spell to non nostile npcs(not follower, not playertammate). (MCM configuration)\r<br />\r<br />Add: Illusionist. Spellcaster for Calm, Fear, Futy and healing(Healother) spell only. (MCM configuration)\r<br />\r<br />Add: Defender. Prefer attack enemies that has attacking healer or illusionist or player(selection by dialogue).\r<br />\r<br />Add: Enemy healer. This function can add the temporary ability of behavior as the enemy side healer role to the enemy with a low probability, (MCM configuration) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1d3-72999-1-3.7z?fid=1000220290&ttl=1535861599&ri=8192&rs=8192&setec=7d44786dd7227fe3c11df62fb84b7b50"
    },
    {
      "fileId": "1000228467",
      "name": "Be With Healer v1d3 esponly jp part",
      "version": "1.3jpesp",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "41",
      "fileName": "Be With Healer v1d3 esponly jp part-72999-1-3jpesp.7z",
      "uploadedUnix": "1479490888",
      "modVersion": "1.3jpesp",
      "virusScanUrl": "https://www.virustotal.com/file/d93b3a18baa494f467ab48cfaaf0977089b8d0873c809c7067a0d0c076079827/analysis/1479490923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1d3%20esponly%20jp%20part-72999-1-3jpesp.7z?fid=1000228467&ttl=1535861599&ri=8192&rs=8192&setec=49de25ed058366244bcd5f8658ce5e6e"
    },
    {
      "fileId": "1000237299",
      "name": "Be With Healer v1d4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "781",
      "fileName": "Be With Healer v1d4-72999-1-4.7z",
      "uploadedUnix": "1488033207",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/647386387aa0b1a91d37229ad1cbcc4ccf7ab00e7454523d9afa29a029fed74b/analysis/1488033482/",
      "changelogHtml": " Version 1.4 mainly fixed some problems that are not fatal. \r<br />Modified the behavior of healer to reduce the unnatural movements than the old version. \r<br />\r<br />Modify: Healing logic and part of constant monitoring function. \r<br />\r<br />Modify: Spellcasting scene. Courage, Rally, Armor spells. \r<br />\r<br />Modify: Enemy healer function. \r<br />\r<br />Modify: Spellcasting voice folder with invisibility spell and muffle spell is prepared. \r<br />\r<br />Fix: Healer sometimes do not cast courage spell. \r<br />\r<br />Fix: Some problems that are not fatal. \r<br />\r<br />Add: Healer can cast elemental resistance spells on player and follower and selected npcs in combat. (MCM configuration) \r<br />\r<br />Add: MCM item:&#34;Give potion&#34;. This option allows you to give a recovery potion to your teammate and non hostile people. (MCM configuration)  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1d4-72999-1-4.7z?fid=1000237299&ttl=1535861600&ri=8192&rs=8192&setec=84e8a2ef2e81b119b5a44592db9325f6"
    },
    {
      "fileId": "1000237313",
      "name": "Be With Healer v1d4 esponly jp part",
      "version": "1.4jpesp",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "58",
      "fileName": "Be With Healer v1d4 esponly jp part-72999-1-4jpesp.7z",
      "uploadedUnix": "1488041414",
      "modVersion": "1.4jpesp",
      "virusScanUrl": "https://www.virustotal.com/file/7f210e15bbeef7413aae046d2b952b10cf906b64e9d2b6a09b0f98386afb8116/analysis/1488041763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1d4%20esponly%20jp%20part-72999-1-4jpesp.7z?fid=1000237313&ttl=1535861600&ri=8192&rs=8192&setec=6e587f4168d5eabf3f20db9679f82649"
    },
    {
      "fileId": "1000239768",
      "name": "Be With Healer v1d4 fix 20170322",
      "version": "1.4.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "126",
      "fileName": "Be With Healer v1d4 fix 20170322-72999-1-4-1.7z",
      "uploadedUnix": "1490188185",
      "modVersion": "1.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/506e78f9ab222825b861b4c6da37b8e864e52eaa5c6b00fefa5979ea39b6e6c1/analysis/1490188503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Be%20With%20Healer%20v1d4%20fix%2020170322-72999-1-4-1.7z?fid=1000239768&ttl=1535861601&ri=8192&rs=8192&setec=448a3b8eac31b9e96e0384bedc3b9159"
    }
  ]
}