{
  "modId": 72998.0,
  "modName": "MLP FiM Golden Oaks Library Player Home",
  "summary": "This mod adds the Golden Oaks Library from the first four season of My Little Pony Friendship Is Magic to Skyrim. It is located North-West of Falkreath, and appears on the map as a grove icon (which looks like a pine tree) which has the name &#34;Golden Oaks Library&#34;. ",
  "descriptionHtml": "This is as close of a 1/1 replica of the Golden Oaks Library from the first four seasons of My Little Pony Friendship is Magic as I could build with just vanilla Skyrim meshes. \r<br />\r<br />The structure is located North-West of Falkreath, and has a grove map marker (in short, it looks like a tree on the map). The marker is automatically enabled, so you should be able to fast travel there once you first load up the mod and then every time afterward. \r<br />\r<br />Inside the building you&#39;ll find the central room (which uses College of Winterhold book cases instead of book shelves, as the book shelves that just store books are complicated to set up, and they lag on lower-end machines when filled with books), Twilight&#39;s loft which is at the top of the staircase, a dining room/cooking area to the right (which may not have been in the show, but the layout of that building seemed to change every now and then as it does in a lot of cartoon shows), and just to the right of the staircase is a doorway leading down into the basement, where Twilight&#39;s laboratory is (the lab is not a replica of the actual lab in Twilight&#39;s basement, but is essentially just one I threw together since I didn&#39;t have a clear image of the basement lab. It contains an alchemy table and an enchanting table, as well as some supplies for both). \r<br />\r<br />Just for the record, this mod was made to run on vanilla Skyrim, no other mods needed, no custom skeletons or meshes needed, no custom textures needed, no DLC&#39;s needed, no SKSE needed.\r<br />\r<br />This file is also available on my Steam page: http://steamcommunity.com/sharedfiles/filedetails/?id=610037011",
  "categoryId": "67",
  "version": "v1.00",
  "author": "ZeroCore",
  "createdUnix": "1454005968",
  "updatedUnix": "1454005946",
  "containsAdultContent": false,
  "uploadedBy": "ZeroCore",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000193136",
      "name": "Golden Oaks MLP.zip",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Golden Oaks MLP.zip-72998-v1-00.zip",
      "uploadedUnix": "1454005946",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/b377cfc36e006d802291d63c0ece6600ef78b05a4208f5a02dadf8fae957d684/analysis/1454005983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Golden%20Oaks%20MLP.zip-72998-v1-00.zip?fid=1000193136&ttl=1535861595&ri=8192&rs=8192&setec=bec961f3fb7f03efaafd8c8f3a00e5b6"
    }
  ]
}