{
  "modId": 73012.0,
  "modName": "Children Grown Up",
  "summary": "Changes all female children to hot teenagers.",
  "descriptionHtml": "ATTENTION; Please read the whole description if you have other mods so you know is something may be amiss&#33;\r<br />One day I wondered if there was a mod that added teenagers to the game... no there wasn&#39;t, at least not without doing something else I didn&#39;t want. So I decided to put my amateur skills to play and made the mod myself.\r<br />   This replaces ALL female children with teen versions of themselves. These new versions include tattoos, warpaint, skin retextures and resizes. I basically changed the children to adults and downsized them to 9/10th of the adult size. Imagine they&#39;re all 18 so do as you wish with them ;)\r<br />Currently all are changed to teens and two or three have custom faces. If you can use the Creation kit feel free to edit it to your preferences. This shouldn&#39;t conflict with anything as long as you load it last(except maybe mods that have the children say stuff, idk) as it only changes the female children&#39;s race, face, voice and size. However the voice is generic and so any old dialogue will be replaced so for example, when Braith bullies that kid she&#39;ll be silent but he&#39;ll still respond. If you want an immersive playthrough then this could be a little immersion breaking but is it worth it??? HELL YEAH.\r<br />FUTURE UPDATES.\r<br />I hope to add a custom voice to replace their original dialogue.\r<br />I WILL change all the faces.\r<br />I might edit their AI \r<br />I might edit their inventory more (I&#39;ve already changed their outfit, it&#39;s now the thieves guild master armour)\r<br />\r<br />THIS DOESN&#39;T CHANGE DLC CHILDREN, ONLY VANILLA&#33;&#33;&#33;\r<br />\r<br />Recommended Mods\r<br />CBBE \r<br />http://www.nexusmods.com/skyrim/mods/2666/?\r<br />Triss armour (change the guild master armour to change all the teens clothing to what you wish)\r<br />http://www.nexusmods.com/skyrim/mods/4708/?\r<br />PLEASE REPORT ANY AND ALL BUGS TO ME&#33;&#33;&#33; PLEASE&#33; This is very early stages and I don&#39;t even know if it&#39;ll work properly as my skyrim is heavily modded, but it should do as I only changed vanilla assets... I think. \r<br />If you&#39;re not sure GIVE IT A GO and if it doesn&#39;t work please tell me, I DO recommend manually saving first though.",
  "categoryId": "33",
  "version": "Earlystages",
  "author": "Rhykynok",
  "createdUnix": "1454041129",
  "updatedUnix": "1454041129",
  "containsAdultContent": false,
  "uploadedBy": "Rhykynok",
  "primaryFile": null,
  "files": []
}