{
  "modId": 73088.0,
  "modName": "High Elvar",
  "summary": "A portal opens to a realm once connected to The Summerset Isles, where a great evil resides in a tower inside the Elvar Great City. Adventurers beware, This mod requires Dragonborn DLC and a player at level 20+",
  "descriptionHtml": "[b][u][size=4]UNAVAILABLE FOR DOWNLOAD UNTIL FURTHER PROGRESS IS MADE\r<br />\r<br />Elvar - Basic Lore\r<br />\r<br />[/size][/u][/b]Once Upon A Time, The land of Elvar, A land of the Elves was run by a council of Elders in the Great City of Elvar. A peaceful land, full of wealth and content within the people and animals. However this soon changed, as happiness cannot last forever. A vast evil spread over the land, consuming it in war and terror. As the darkness grew in power, the military forces of Elvar realized it could not be beaten and so joined it in the aim of ruling the land of Nirn. The people of Elvar, terrified, began to form a rebellion against the darkness. They reached out to the Capital City of Alinor for help but the Mages instead sent them away. No help was coming.\r<br /> That is, until the Altmer Mage Elders sensed the Darkness as a growing threat. The darkness began to release legions of Orcs and used the once proud Elvar military to begin to overrun the Summerset Isles. Together the Mages repelled the dark forces as they defended their cities before constructing a spell to banish the Land of elvar from the realm of Nirn for eternity...   \r<br />The Dark force seethes and waits for a chance to return. It lays in its tower at the pinnacle of the land, watching, growing in power and numbers as it awaits the day an adventurer makes it into the realm. The day that the Dragonborn enters the realm of Elvar. When this day comes, the Darkness will be watching, and it will use and manipulate all of its assets to trick the Dragonborn into allowing its re-entry to the land of Nirn.\r<br />\r<br />You as the Dragonborn will be faced with a series of quests that will take you on an adventure through Elvar to the highest peaks, lowest depths and widest plains to meet the factions that reside there. You will be faced with a decision to aid the Rebellion, The Burnt or the Darkness in their very different goals. Each decision you make, changes the way the mod will end. \r<br />\r<br />[size=3]THIS IS A VERY HOPEFUL PROJECT THAT WILL REQUIRE A COMMITTED TEAM&#33; \r<br />[/size][b]Where can I come in?[/b]\r<br />[b]If you are handy in certain areas of scripting, voice acting and creating/implementing new models then we may have a job for you&#33; [/b]\r<br />The mod creator is capable of doing these things however the mod will be created much faster and probably much better with the aid of the community.\r<br />We have a list of jobs as follows; \r<br />- Scripting:\r<br />- Main and side Quest scripting\r<br />- Dialogue trees and creating relevant and interesting dialogue for the player\r<br />- Factions and merchants\r<br />- Town jails\r<br />- Event scripting\r<br />- Any scripting to be done concerning animals/creatures/Npcs that has not been listed above\r<br />\r<br />- Voice Acting:\r<br />- Male Elven voice actors - Main quests with lots of dialogue to smaller side quests\r<br />- Female Elven voice actors - Main quests with lots of dialogue to smaller side quests\r<br />- Orcish voice actors\r<br />- Creature/animal noises/voices (not a priority as base Skyrim sounds are fine) \r<br />- The Darkness voice acting - will probably require editing or pitch lowering for example audacity or another software \r<br />\r<br />- New models and textures:\r<br />- New weapons\r<br />- New armor\r<br />- New Creatures\r<br />- New misc items/ spells etc..\r<br />",
  "categoryId": "30",
  "version": "Beta",
  "author": "ByronHarrisModding",
  "createdUnix": "1454260043",
  "updatedUnix": "1454260043",
  "containsAdultContent": false,
  "uploadedBy": "ByronHarrisModding",
  "primaryFile": null,
  "files": []
}