{
  "modId": 73097.0,
  "modName": "Lilieah the Forgotten",
  "summary": "My first mod. Sorry if it sucks. It is voice acted.",
  "descriptionHtml": "[i]Hello. What a way to start. Alright well this is a simple follower mod, it is voice acted by myself, so sorry if it sucks. If i think that it sound horrendous i will change to a vanilla voice. I&#39;m not sure if I&#39;ll update it a lot.\r<br />\r<br />[size=6]Story\r<br />[/size] [font=Comic Sans MS]&#34;I don&#39;t come from Skyrim... I come from a diffrent world by the name of Alrikseai[/font][/i][i][size=2],perhaps you have heard of it, in your dreams. My parents [/size][font=Comic Sans MS]abandoned[/font][size=2][font=Comic Sans MS] me there, left me for dead. I was only 10. Before my mother left me she gave me a letter and told me to read it when they were gone. So I did and it read &#39;[/font][font=Times New Roman]My child forgive me for I have brought misery to you. Your father never wanted a child. He claimed it was to much of a burden to have one and a waste of resources. I would have left him and kept you in my arms for ever, but I couldn&#39;t. He had all the money all the fortune . He protected us from everything that came our the monsters and hate people gave us. I love you my child survive for me. I will contact you again, if i ever can. Love Reiseett.&#39; [/font][font=Comic Sans MS] I can&#39;t remember how she looks. How she speaks...not one detail. On my 16th birthday I got a letter from someone named &#39;[/font][font=Times New Roman]Reiseett&#39; [/font][font=Comic Sans MS]I knew the name sounded familiar. But I couldn&#39;t think at the moment of who it reminded me of. So I read it &#39;[/font][font=Times New Roman]My child . I am very sorry for just now contacting you. I know it has been forever,. I am currently in Skyrim, if you want to find me. Your father is no longer with me. Or here at all. I am all alone . Without anyone. Contact me in the Rat way if you ever want to see me again... -R.&#39; [/font][font=Comic Sans MS]. It took me a moment before I realized it was my mother. So that&#39;s how I came to Skyrim. If you care...&#34; -Lilieah the Forgotten...\r<br />[/font][/size][/i]\r<br />\r<br /> ",
  "categoryId": "96",
  "version": "1.0",
  "author": "MeowRawrLolNoIdea",
  "createdUnix": "1454274601",
  "updatedUnix": "1454274601",
  "containsAdultContent": false,
  "uploadedBy": "MeowRawrLolNoIdea",
  "primaryFile": null,
  "files": []
}