{
  "modId": 73090.0,
  "modName": "OHF Mannor",
  "summary": "WIP mod, a medium manor located in a hidden valley + extra assets",
  "descriptionHtml": "A WIP, but (mostly) working mod, released because I don&#39;t want it to sit unused on my HDD. I don&#39;t know if I&#39;ll ever finish it.\r<br />\r<br />I started and stopped several times, and due to time issues, I&#39;m not sure if I&#39;ll finish it.\r<br />\r<br />Check out the images and videos, but bare in mind the videos are somewhat outdated.\r<br />\r<br />CONTENTS:\r<br />- Mannor internal area (OHF_Mannor) - 2 floors + basement, walkmeshed, single area, no loading\r<br />Ground floor: kitchen, dining room, foyer, bar, shrines, toilet and your work room\r<br />Top floor: 3 bed servant room, your room, and 6-8 extra rooms for followers/spouses.\r<br />Basement: storage and all forging stations\r<br />\r<br />- The gorge/valley itself (OHF_Valley) - almost fully walkmeshed, entrance to valley is in the area above Falkreath, next to a road.\r<br />\r<br />EXTRA:\r<br />- Mannor exterior - contains the exterior of the manor building that I didn&#39;t end up using, since I was worried about performance\r<br />- Keep Exterior - just the exterior keep assembly for the knight order I planed to add\r<br />- Keep Interior (OHF_Keep) - interior of the keep. Was well on the way to finish it (ground floor fully walkmeshed, only upper floor needed final assemly and finishing), but ran into a problem with a central tile that Bethseda didn&#39;t test apparently, as it has a full collision (you can&#39;t actually walk on it).\r<br />- Farm house and Slavers Den - two areas that were supposed to be part of a quest to get the house. Slavers den is complete, but unused. The player was supposed to help the order investigate attacks and kidnappings of travelers and find and clear the den before he could buy the manor.\r<br />\r<br />\r<br />COMPATIBILITY:\r<br />- uses no scripts and only adds a single torch and door to the Tamriel worldspace, so should be compatible with everything and easy to remove.\r<br />\r<br />OTHER:\r<br />- The mini-moditself uses a few bits and pieces from other moders, such as statues from Malo and Tamira, a few pieces of furniture and 2 weapons. There are other things there were planed to be in (armor from Dark Souls and DA:I for the Order), but I removed them to save files size..and because they weren&#39;t necessary.\r<br />Also contains a bunch of pictures made by me to pretify the place\r<br />The hold shield in the bedroom were supposed to be invisible untill you become a thane of a hold, but I never got around to implementing that",
  "categoryId": "67",
  "version": "0.9",
  "author": "Ellderon",
  "createdUnix": "1454266072",
  "updatedUnix": "1454265867",
  "containsAdultContent": false,
  "uploadedBy": "Ellderon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000193602",
      "name": "OHF_Main",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "97781",
      "fileName": "OHF_Main-73090-0-9.rar",
      "uploadedUnix": "1454265867",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/32577cf069c0d407cf060dc380297877cf8c8214aa16369d71dcd382c15b607e/analysis/1454265923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/OHF_Main-73090-0-9.rar?fid=1000193602&ttl=1535861706&ri=8192&rs=8192&setec=b9505f1a7984359d9ffb2e1841fcb72f"
    }
  ]
}