{
  "modId": 73091.0,
  "modName": "Multiple Custom Markers with Notes - NOW WITH 61 custom markers",
  "summary": "JUST now Up to 61 custom markers. NO OTHER CHANGES UNTIL NOW",
  "descriptionHtml": "NEW VERSION 0.2: Several bug fixes and improvements. See changelog below. \r<br />\r<br />[b]IMPORTANT MESSAGE [august 2015]:[/b]\r<br />[quote]QUOTE\r<br />[size=2]Hi,\r<br />I have got many requests to improve, fix and update this mod. Sadly I am not capable of doing this. I don&#39;t even have Skyrim anymore&#33;\r<br />So I have a little announcement:\r<br />\r<br />[b]If you are a modder, feel free to improve this mod and make it up to date&#33; You have my permission to modify and publish this mod at your own.[/b]\r<br />\r<br />Sources of the mod consist of two parts :\r<br />[/size][list]\r<br />[*][size=2]Mod files itself: [url=https://github.com/falouu/Skyrim-MCMwN]https://github.com/falouu/Skyrim-MCMwN[/url][/size]\r<br />[*][size=2]Necessery modification of SkyUi: [url=https://github.com/falouu/skyui]https://github.com/falouu/skyui[/url][/size]\r<br />[/list][size=2][b]\r<br />Good luck improving this mod&#33;[/b][/size][/quote][size=2]\r<br />[/size]\r<br />\r<br />[b]INTRODUCTION:[/b]\r<br />With this mod you can place your own markers on the map. You can give your marker a name and write your own note to it. Up to 60 markers&#33;\r<br />This is my first mod. I made it for myself, because I can&#39;t play without this feature :) And nobody created it so far.\r<br />\r<br />\r<br />[b]FEATURES:[/b]\r<br />[list]\r<br />[*]You can place your own markers with your own, self-written notes attached to them.\r<br />[*]######## Up to 61 custom markers (if you want more, it&#39;s easy to add more in Creation Kit). ######## made by felix128\r<br />[*]You can fast travel to your markers.\r<br />[*]You can edit and remove your markers.\r<br />[*]Works with SkyUi&#39;s Location Finder.\r<br />[*]First line of your note become a marker name (displayed on the map and in Location Finder).\r<br />[*]English and Polish localizations.\r<br />[*]I only speak a little English. If you find language mistake, report it to me, I will fix it.\r<br />[*]This is very early release. It contains tons of bugs for sure. If you find one, report it to me.\r<br />[*]Limitations:\r<br />???- the spell works only in exteriors. Markers can only be placed on world map, not local map.???- As far as I know, there is no way to change default location name appearing on top-right corner in-game and in fast-travel messages. ????It will be always &#34;Marked Location x&#34;. However, on the map it will show your own custom location name.[/list]\r<br />[b]HOW TO USE:[/b]\r<br />[list]\r<br />[*]a spell &#39;Mark Location&#39; will be added to your spell book when you enable this mod.\r<br />[*]when you cast &#39;Mark Location&#39;, your current location will be marked on the map.\r<br />[*]go to map, click on one of your markers and you will be able to edit note attached to this marker. First line of the note become marker name.\r<br />[/list]\r<br />\r<br />[b]REQUIREMENTS:[/b]\r<br />[list]\r<br />[*]SkyUI 4.1\r<br />[/list]\r<br />\r<br />[b]COMPATIBILITY:[/b]\r<br />[list]\r<br />[*]NOT compatible with all mods that modify &#34;map.swf&#34; file. For example all &#34;Coloured markers&#34; mods are almost certainly not compatible.\r<br />[*]It should be compatible with every other mod.\r<br />[/list]\r<br />\r<br />[b]INSTALLATION:[/b]\r<br />[list]\r<br />[*]Nexus Mod Manager or manually.\r<br />[*]Manually: Only two files in archive: esp and bsa. Simply put them in Data folder.\r<br />[*]This mod needs to be loaded after SkyUI.\r<br />[*]If you upgrade from older version, see UPGRADING section\r<br />[/list]\r<br />\r<br />[b]UPGRADING:[/b]\r<br />[list]\r<br />[*]v0.1 cannot be upgraded. Disable mod, save game, and install new version of mod.\r<br />[/list]\r<br />\r<br />[b]BUGS:[/b]\r<br />[list]\r<br />[*]fixed or not yet reported :)\r<br />[/list]\r<br />\r<br />[b]TODO:[/b]\r<br />[list]\r<br />[*]change custom markers icon on compass. Now is &#34;AltairMarker&#34; icon (probably unused in game), but ultimate icon is &#34;PlayerSetMarker&#34;. &#34;PlayerSetMarker&#34; icon is currently displayed on the map, but not on the compass.\r<br />[/list]\r<br />\r<br />[b]PERMISSIONS:[/b]\r<br />This mod is based on the SkyUI mod: http://www.skyrim.nexusmods.com/mods/3863\r<br />You will need to seek permission from me and authors of SkyUI mod before you can modify, publish or re-upload this mod.\r<br />Refer to the SkyUI permission instructions.\r<br />\r<br />\r<br />[b]CHANGELOG:[/b]\r<br />[list]\r<br />[*]v0.2\r<br />- BUGFIX: Fixed crashing on other than English or Polish game versions. (only &#34;english version&#34; file)???- BUGFIX: Fixed bug where marking location with previously deleted marker is not working after game load. ???- BUGFIX: No more marker corruption when casting spell in interiors (casting spell in interiors do nothing now)???- improved English translation[*]v0.1\r<br />- Initial release[/list]\r<br />\r<br />This is the Credit, THE MOD IS from User falouu - i just edited it a little bit\r<br />\r<br />\r<br />Up to 61 custom markers (if you want more, it&#39;s easy to add more in Creation Kit). ",
  "categoryId": "42",
  "version": "0.3",
  "author": "falouu",
  "createdUnix": "1454266128",
  "updatedUnix": "1454266128",
  "containsAdultContent": false,
  "uploadedBy": "felix128",
  "primaryFile": null,
  "files": []
}