{
  "modId": 7312.0,
  "modName": "Fultheim the Blades Exile V1_0 Follower",
  "summary": "The true last member of the Blades comes to your aid.",
  "descriptionHtml": "This mod adds Fultheim, the last of the Blades as a following companion. He was an exile to the order during the Great War, having used the Thu\\'um, which he acquired during his pilgrimage to High Hrothgar when he was still young. \r\n\r\nHe can be found by the Nightgale Inn, drunk and apparently pissed at the world.\r\n\r\nHis default gear is a blades set with two Akiviri Katanas.\r\n\r\nI hope the CK comes out.\r\n\r\n\r\nHow to Install and use\r\n\r\n1. Extract Fultheim.espto your Skyrim Data Folder\r\n\r\n2. Extract Fultheim.txt and Open.txt to your Skyrim Folder, where the skyrim.exe is located. \r\n\r\n3. Using your NMM, or any mod managing tool, check or activate Fultheim.esp.\r\n\r\n4. Go to the Nightgale Inn, located Northwest near Forsaken Cave and find the drunken, naked breton with an Akiviri Katana.\r\n\r\n5. Using the Console, click him and type \\\"resurrect\\\". He will fade in and out as soon as you disable the console.\r\n\r\n6. Open the Console again and type \\\"bat Fultheim\\\". He should be following you around.\r\n\r\n         - To open his inventory, click him and using the console, type \\\"bat open\\\".\r\n         - He follows you around! No choice!\r\n         - He is using a different AI, don\\'t mess with it through the console.\r\n\r\nCongratulations and enjoy killing Delphine and Esbern without regrets because you technically have a senior member of the order by your side!\r\n\r\n\r\n\r\nFAQ\r\n\r\n1. Why Fultheim?\r\n\r\nhttp://www.uesp.net/wiki/Skyrim:Fultheim\r\nhttp://elderscrolls.wikia.com/wiki/Fultheim\r\n\r\nYou don\\'t just flaunt an Akiviri Katana during a Cold war between The Aldemeri Dominion and The Empire, even more so as a lowly bandit. :)\r\n\r\n2. Fultheim is so Overpowered! Why?\r\n\r\nYou must have probably installed this on a new game. Yes, he is overpowered because his stats are equal to a level 50 player, including his perks. But if you installed this in a current saved game, then he is overpowered due to the following factors:\r\n\r\n-Difficulty\r\n-Game Time\r\n-Mods Installed\r\n-Your honesty in using the Bat file included in the Mod\r\n\r\nPlaying with PISE, Duel, Deadly Dragons and Wars in Skyrim which makes him very vulnerable to many things which with the bat file, allows him to survive just a little longer and reflect his status as a surviving Veteran of the Order of The Blades in hiding.\r\n\r\n3. Fultheim is underpowered/weak! Why?\r\n\r\nDid you gear him up? He is an extension of your character. You need to gear him up. To open his inventory, click on him and using the console, type \\\"bat open\\\". If you have your Fultheim Geared, he is weak due to the following reasons\r\n\r\n- Mods installed\r\n- Poor Gear Selection (he dual wields!)\r\n- Tampering with his Bat File\r\n\r\n4. Why is his stats in the BAT file weak/strong/weird?\r\n\r\nFultheim is a level 50 breton who puts 25 points into health and magicka. He also invested in melee perks and slightly adept in magic. Because he is old, he has difficulty wearing armor, but because of his experience in battle, he has a few bag of tricks up in his sleeve that he still remembers. Level 50 is the softcap for players by the way, and the hardcap for Lydia. \r\n\r\nFultheim also doesn\\'t scale even through the console. It is best to leave his BAT file as it is.\r\n\r\n5. Why Unrelenting Force?\r\n\r\nUlfric Stormcloaks knows \\\"Fus\\\" \\\"Ro\\\". Fultheim is much older than Ulfric. Ulfric left for the war, Fultheim has senior knowledge of the Dovah. The Greybeards acknowledge that you, the Dovahkin is not the first to come to High Hrothgar. Fultheim came in earlier and with his Knowledge, learned all three words of the Shout.\r\n\r\nPlus its fun watching an burning, angry old man shouting, raging at the world.\r\n\r\n6.Why is Fultheim attacking my followers?\r\n\r\nYou must have unlimited followers installed. The problem of Friendly Fire is that even if you set sifh to 1 (which is included in the bat file). Your companion must have summoned a familiar/atronach which got hit by Fultheim\\'s shout. It then overrides the Bat commands and thus forces both NPCs to fight each other to the death.\r\n\r\nYour only choice is to revive whoever died through the console. Disabling their AI will not fix this problem.\r\n\r\n7. the BAT file can\\'t be edited. Why?\r\n\r\nIt is locked by default. If you know how to do it, then you are probably old enough to know that cheating is a sad, sad way to win a game. Be honest and trust the BAT file :)\r\n\r\n\r\n8. OMG you can make Lydia Shout!\r\n\r\nYes, you can using the BAT file. You have 100% freedom to use or not to use this properly but it is highly recommended to use it as intended since its tailored to be as lore-friendly as possible.\r\n\r\nI wish the CK would come out so we won\\'t have to rely on the console anymore.\r\n\r\n\r\nFUTURE PLANS\r\n\r\n- Make Esbern\\'s dialogue for dragon slaying radiant quests available to Fultheim\r\n\r\n- Make the recruiting for the blades quest available to Fultheim\r\n\r\n- More skills/perks to be added to Fultheim, balanced for \\\"dark-age mods\\\". He still has 25 unspent perks.\r\n\r\n- A better Backstory (I suck at writing)\r\n\r\n\r\nSpecial thanks to\r\n\r\nforetrenty, creator of Skyrim NPC Editor\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "miniminionette",
  "createdUnix": "1327855425",
  "updatedUnix": "1327855544",
  "containsAdultContent": false,
  "uploadedBy": "miniminionette",
  "primaryFile": null,
  "files": [
    {
      "fileId": "23990",
      "name": "Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Main File-7312-1-0.rar",
      "uploadedUnix": "1327855544",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/adfa1e9a3d2be2195c8f8f5d1b04a619f810cc65a0b09f95add33884f12badd2/analysis/1406643666/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Main%20File-7312-1-0.rar?fid=23990&ttl=1535765279&ri=8192&rs=8192&setec=0c62e5b1b7db23210403344e3aa17244"
    }
  ]
}