{
  "modId": 7313.0,
  "modName": "Alexandre - Roleplaying Character - An Alternate Start",
  "summary": "Start Skyrim differently, with the main quest disabled with the Redguard I created.\r\nBack story Included.",
  "descriptionHtml": "Story --\r\nYour name is Alexandre (Pronounced Alex on Druh), meaning \\\"Warrior\\\". And a warrior you are, raised in Hammerfell, in the town of Hegathe. Your parents were murdered while you were a child, during the Interregnum (A power struggle between the Crowns and the Forebears). You grew up on the streets, waiting days between meals and never having a roof to sleep under. After many years of this, you became of age to join the Navy, you seized this opportunity with both hands and joined, being placed on a ship called \\\"The BrineHammer\\\". However, several years into duty as a Rigger (working on the Rigging of the ship) your captain went rogue and offered everyone glorious loot if they stayed with him. Due to your poor upbringing, you couldn\\'t bring yourself to do the right thing and leave, so tempted by the offer of riches. So life went on as a Pirate, for the next decade or so. As promised, you did receive loot. Most of it was gold, which was spent on pleasures while the ship docked at ports, however there is one piece you could never get rid of. An ancient dagger, the only one of its kind, called DragonSting. \r\n\r\nHowever, on a plan to raid Solitude in Skyrim, things went wrong. One of the pirates told the guards the attack plan, leaving everyone to get slaughtered who went on the raid. Except you and the traitor, the traitor had fled before the battle, even though they had marched off with the rest of the crew. But on that night, you had sentry duty. Sitting on the deck and making sure no one tried to take over the ship.\r\n\r\nAfter the crew had been gone for a day, you started to grow worried about the safety of the crew. Though the next thing you knew projectiles and magic were being thrown at the hull, forcing the ship to sink. You did your best to land it on the coast, where they assumed it had been destroyed and didn\\'t come to check it. \r\n\r\nAfter lying in wait for them to come, and then realising they wouldn\\'t, you stepped out of the ship with your trusty dagger, and vowed revenge for what Solitude did to your crew, your family...\r\n\r\n(You start the game with 0 gold, a belted tunic, footwraps and the Dragonsting Dagger. You also have the starting spells, as I have not figured out how to remove them (Player.RemoveSpell (ID) doesn\\'t work.) This will be rectified as soon as possible).\r\n\r\nSkills --\r\nMagic; All Magic Skills Set To 0.\r\nCombat; Archery 0, Block 20, Heavy Armor 10, One Handed, 40, Smithing 10, Two handed 10.\r\nStealth; Alchemy 0, Light Armor 30, Lockpicking 10, Pickpocket 10, Sneak 10, Speech 10\r\n\r\nInstallation (If not using NMM) --\r\nExtract into your saves folder ( C:\\\\Users\\\\<Computer Account Name>\\\\Documents\\\\My Games\\\\Skyrim\\\\Saves )\r\n\r\nMODS Needed --\r\nJaysus Swords (Else you won\\'t start with the Dragonsting Dagger)\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1002\r\n\r\nCredits (I used these MODS and would recommend them) --\r\n\r\nCoolsims hair pack;\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3809\r\n\r\nDetailed Lips;\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=689\r\n\r\nBright purple and Deep indigo eyes;\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=1763",
  "categoryId": "43",
  "version": "1",
  "author": "Virtuallism",
  "createdUnix": "1327855641",
  "updatedUnix": "1327856220",
  "containsAdultContent": false,
  "uploadedBy": "Virtuallism",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24003",
      "name": "Alexandre Character",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "942",
      "fileName": "Alexandre Character-7313-1.rar",
      "uploadedUnix": "1327856152",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/e05b656e9dccf7259838e17afb47feec05c1bdb0ae8bae0b1468112932701c90/analysis/1406643702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alexandre%20Character-7313-1.rar?fid=24003&ttl=1535765280&ri=8192&rs=8192&setec=fac2918667f6f9334cb36f9339c95b23"
    },
    {
      "fileId": "24004",
      "name": "Alexandre Character Expanded",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "943",
      "fileName": "Alexandre Character Expanded-7313.rar",
      "uploadedUnix": "1327856220",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/5b6691c230301aa14243024ea135c1f10055c796343ecbbbb15fb52da51042bf/analysis/1406643704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alexandre%20Character%20Expanded-7313.rar?fid=24004&ttl=1535765280&ri=8192&rs=8192&setec=af04e8fe8e90edabdf0588390ace5eb4"
    }
  ]
}