{
  "modId": 73139.0,
  "modName": "Cannibal&#39;s Feast",
  "summary": "Various changes to the Vanilla Cannibalism features. Aimed to improve functionality, usefulness, and immersion.",
  "descriptionHtml": "[b][color=#ffe599][size=4]Short Description[/size][/color][/b]\r<br />\r<br />[size=3]Mod comes in two versions with an optional script edit. Lite version contains all vanilla effects with minor changes to wording, Full version contains extensive changes (See Long Description for details on both lite and full versions).[/size]\r<br />\r<br />\r<br />\r<br />[color=#ffe599][size=4]Long Description[/size][/color]\r<br />\r<br />[size=3]As a notice, this is my first real mod; the mod really doesn&#39;t add anything that could damage a savegame though. Annoyed by the vanilla message box pop-up and glancing around at the few cannibalism mod options that fixed it, I wasn&#39;t satisfied with what I found. I did like [/size][url=http://www.nexusmods.com/skyrim/users/851501]sushisquid[/url][size=3]&#39;s SneakNamira mod which was what inspired me to create this mod, but once I got started on creating a mod that fixed the message box pop-up how I liked I wanted to do more with the mod. This mod adds a Lite and Full version, with an optional script change. Both versions fix the message box issue, but the Full version is aimed at putting Cannibalism closer to being on-par with Vampirism and Lycanthropy with less commitment.[/size]\r<br />\r<br />\r<br />\r<br />[b][color=#ffe599][size=4]Script Edit:[/size][/color]\r<br />\r<br />[/b][size=3]The script edit simply edits the script that Ring of Namira uses to manage the Cannibalism perk, this does not add any additional scripts to the game and is as script heavy as the vanilla game. When the player equips the Ring of Namira they&#39;ll be granted the Cannibalism perk but will not lose the perk when the ring is unequipped. I personally found it limiting and annoying that the entire cannibalism feature functioned off using the ring; this should make cannibalism less intrusive to gear setups and stripped events (Such as prison or DAYMOYL&#39;s captured add-on). See Full version description for details on how this script effects ring usage.[/size]\r<br />\r<br />\r<br />\r<br />[b][color=#ffe599][size=4]Lite Version:[/size][/color][/b]\r<br />\r<br />[b]Message Box[/b][size=3] - Changed the pop-up menu to appear only when player&#39;s weapon in sheathed, this should greatly decrease the annoyance when looting while adding a little immersion (weapon gets sheathed for the animation anyways). Also changed the message box to say &#34;Feast&#34; instead of &#34;Feed&#34;, just sounds appropriate given the quest title and potential confusion with Vampirism.[/size]\r<br />\r<br />[b]Spell Effects[/b][size=3] - All spell effects are the same as vanilla but will appear in the spell effects section of the Magic tab as &#34;Namira&#39;s Health&#34; and &#34;Namira&#39;s Regen&#34; with the effect source &#34;Recent Feast&#34;. Ring of Namira&#39;s magic effect descriptions are unchanged.[/size]\r<br />\r<br />\r<br />\r<br />[b][color=#ffe599][size=4]Full Version:[/size][/color][/b]\r<br />\r<br />[b]Message Box [/b][size=3]-[/size][b] [/b][size=3]Same as Lite version with one difference, message box will only appear with weapons sheathed and &#34;Feed&#34; changed to &#34;Feast&#34;. Feasting is now on a cool down, with various functions associated to it; see further changes for details.[/size]\r<br />\r<br />[b]Spell Effects Buffs[/b][size=3] - Feasting now grants a buff called &#34;Namira&#39;s Gift&#34; which imrpoves Health, Magicka, and Stamina fortification and rate by 20 and 20% respectively with a 5 minute duration. I felt that Vanilla Cannibalism sort of left magic users wanting.[/size]\r<br />\r<br />[b]Spell Effects Debuffs[/b][size=3] - Yup, Cannibalism now has consequences. For half the duration of the buffs (150 seconds), the player is debuffed (&#34;Namira&#39;s Torment&#34;) for -50 restoration skill and 10 magnitude weakness to fire (Namira is the Deadric prince of darkness and revulsion, whose nemesis is Arkay; these two seemed fitting debuffs). The debuff only lasts half the duration of the buffs, this gives an up-period of 150 seconds (See ring description for further benefits). The previously mentioned cool down on how often a player can feast is attached to Namira&#39;s Torment; players can only feast if they do not have Namira&#39;s Torment.[/size]\r<br />\r<br />[u][b][color=#ffe599]Ring of Namira Changes (Full Version)[/color][/b][/u]\r<br />\r<br />[size=3]I felt that a lot of what I disliked about Cannibalism centered around the Ring of Namira&#39;s dependency; while I wanted to remove the dependency, I didn&#39;t want to diminish the significance of a Daedric artifact. With the script edit (or console commands) players can completely ditch the ring and use the full version as is; however, the ring now presents some rather interesting bonuses. When the player equips the ring they&#39;ll be given an enchantment based on whether or not they&#39;ve fed.[/size]\r<br />\r<br />[b]Unfed[/b][size=3] - If the player equips the ring and has not fed (Does not have the &#34;Namira&#39;s Gift&#34; buff), the ring will decrease damage resistance moderately and increase critical strike chance significantly (I felt this portrayed hunger cravings).[/size]\r<br />\r<br />[b]Fed[/b][size=3] - If the player has fed (has the &#34;Namira&#39;s Gift&#34; buff), the ring will absorb health from any enemy in melee range while in combat (Vampire Lord AoE drain); this lasts for as long as the player has the ring equipped and has Namira&#39;s Gift.[/size]\r<br />\r<br />[size=3]Only one effect will be active at a time dependent on whether the player does or doesn&#39;t not have the Namira&#39;s Gift buff.[/size]\r<br />\r<br />\r<br />\r<br />[b][color=#ffe599][size=4]Installation[/size][/color]\r<br />\r<br />[size=3]MO[/size][/b][size=3] - Just install the mod and activate it. Use LOOT as needed, etc etc. I use MO so this should be the easiest method for installing the mod.[/size]\r<br />\r<br />[b]NMM[/b][size=3] - Same as MO, you shouldn&#39;t have to overwrite anything unless you&#39;re using the script edit and have a .pex script from another mod installed already (I think Bloody Cannibalism may. See compatibility for more details).[/size]\r<br />\r<br />[b]Manual[/b][size=3] - Put the .esp file into your Data folder and activate the plug-in as needed. If you use the script edit, put the scripts folder into your Data folder as well. [/size]\r<br />\r<br />\r<br />\r<br />[b][color=#ffe599][size=4]Uninstallation[/size][/color][/b]\r<br />\r<br />[size=3]MO - Remove the mod from MO and double check the overwrite folder to ensure the script and .esp were removed.[/size]\r<br />\r<br />[size=3]NMM - Same thing as MO, just make sure that if you overwrote the .pex script to replace it with whatever other mod you were using.[/size]\r<br />\r<br />[size=3]Manual - Delete the .esp from the Data folder along with the DA11RingofnamiraScript.pex file from the scripts folder.[/size]\r<br />\r<br />\r<br />\r<br />[b][color=#ffe599][size=4]Compatibility[/size][/color][/b]\r<br />\r<br />[size=3]This mod is not compatible with Bloody Cannibalism, though I intend to look into making it compatible or creating something of the same nature.[/size]\r<br />\r<br />[size=3]Everything else should be fine, I have upwards of 180 or so mods installed and didn&#39;t run into any issues besides those that are already a problem in Vanilla. I suspect that since cannibalism uses the PlayerQuestVampireScript which contains feed duration calucations that it causes issues with cannibalism&#39;s animation not triggering with each corpse. The cool down I added to the Full version sort of aimed to fix the animation issue by limiting the number of times players feed in a given period.[/size]\r<br />\r<br />\r<br />\r<br />[b][color=#ffe599][size=4]Possible Future Changes[/size][/color]\r<br />\r<br />[/b][size=3]I&#39;d like to change the animation to something more interactive, I&#39;m not skilled with scripts though so I&#39;ll probably be asking around about that; don&#39;t expect this feature anytime soon. [/size]\r<br />\r<br />[size=3]I am considering some scaling buffs/debuffs based on how many corpses the player has cannibalised within a certain time frame. Likely increase the buff/debuff durations and add additional positively scaling effects if the player feeds again while they have Namira&#39;s Gift and do not have Namira&#39;s Torment (fading stages of cannibalism like how Vampirism works).[/size]",
  "categoryId": "24",
  "version": "1.0",
  "author": "Gisla",
  "createdUnix": "1454412495",
  "updatedUnix": "1454412411",
  "containsAdultContent": true,
  "uploadedBy": "Gisla",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000193867",
      "name": "Cannibal&#39;s Feast - Full",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Cannibal's Feast - Full-73139-1-0.rar",
      "uploadedUnix": "1454412214",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f274a7a88e045a63fe6c8b02f0318dd4ad2a3f453dee27d5c0298654d057bf81/analysis/1454771765/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cannibal%27s%20Feast%20-%20Full-73139-1-0.rar?fid=1000193867&ttl=1535861773&ri=8192&rs=8192&setec=80b9dd6aff179ef231518aa8ec599d25"
    },
    {
      "fileId": "1000193868",
      "name": "Cannibal&#39;s Feast - Lite",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Cannibal's Feast - Lite-73139-1-0.rar",
      "uploadedUnix": "1454412293",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c629801b7e3e836b21f3621abb2ca22ccd45e2d44de96d35e103c643b20068a0/analysis/1454426730/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cannibal%27s%20Feast%20-%20Lite-73139-1-0.rar?fid=1000193868&ttl=1535861774&ri=8192&rs=8192&setec=90f139668cbc3807635bc7eedfdfa68a"
    },
    {
      "fileId": "1000193869",
      "name": "Cannibal&#39;s Feast - Script Edit",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Cannibal's Feast- Script Edit-73139-1-0.rar",
      "uploadedUnix": "1454412411",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/dbc42c26784762a65448eab43ff34564cac7c0967cde047ff69e316a1af89dc0/analysis/1454771766/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cannibal%27s%20Feast-%20Script%20Edit-73139-1-0.rar?fid=1000193869&ttl=1535861774&ri=8192&rs=8192&setec=e70f5b5f049b394589159a8e26ef74c4"
    }
  ]
}