{
  "modId": 73235.0,
  "modName": "Your Skyrim Mother - Custom Voice Follower",
  "summary": "Ever hated how boring and one-dimensional \"family\" characters usually are? Now you can develop a lasting familial bond with your Skyrim Mother! She is fully custom-voiced and includes features that will allow her to react to your character in a myriad of ways.",
  "descriptionHtml": "[b][size=6]YOUR SKYRIM MOTHER[/size][/b]\n<br />\n<br />If you've ever been interested in having family in Skyrim, you'll know there aren't many mods that include them, and, if they do, their interaction is extremely limited. All other mods which add family situations for the player have consistently felt inadequate to me... Some people milling about, limited avenues for conversation, and a general lifeless feeling emanating from their blank faces.\n<br />\n<br />For a while, I got by just fine imagining my interactions with stock \"family\" characters, until I would make camp with them, or sit around an inn. Then... what do you do? You can't talk to them. Even though they're supposed to be family, in the end, they're just NPCs whose only dialogue options are  \"Hello\" and \"Follow me. I need your help.\"\n<br />\n<br />Thus, the idea for this mod was born... a familial character with meaningful interactions and an interesting level of randomness. This massive undertaking took me roughly two years to complete, but lo and behold-- Your Skyrim Mother is here!\n<br />\n<br />[size=5]REQUIREMENTS[/size]\n<br />\n<br />The latest version of beautiful basegame Skyrim.\n<br />\n<br />[i]As with any time you add or subtract mods from your load order, it's always safest to [b]start a new game[/b]. I'm not responsible if your game did a weird thing because you couldn't be bothered.[/i]\n<br />\n<br />[size=5]INSTALL INSTRUCTIONS[/size]\n<br />\n<br />Copy files into the Steam&#92;SteamApps&#92;common&#92;skyrim&#92;data folder.\n<br />Or, use whatever mod manager suits you.\n<br />\n<br />[size=5]UNINSTALL INSTRUCTIONS[/size]\n<br />\n<br />Delete files from Data folder.\n<br />\n<br />A new game is recommended, as there are scripts in this mod which will likely not be happy if you remove them mid-game.\n<br />\n<br />[size=5]CONFLICTS[/size]\n<br />\n<br />Any other mod that edits the Riverwood wilderness navmeshes will cause your game to crash.\n<br />This isn't a conflict, but follower managers will not work, since she has a standalone follower system.\n<br />\n<br />[b][size=6]OKAY, SO, WHAT IS THIS EXACTLY?[/size][/b]\n<br />\n<br />A new follower mod that adds a mother for your character in Skyrim. The focus of this mod is to facilitate roleplay and cultivate a relationship. There is nothing special about how she looks, no cool custom weapons or armor, no epic fighting styles. Just you and your mother, getting by the best you can in the harsh world of Skyrim.\n<br />\n<br />[size=5]FEATURES[/size]\n<br />\n<br />• 1000+ custom recorded lines\n<br />• Non-vanilla follower\n<br />• Custom home for you &amp; your mother, which can be upgraded\n<br />• Mother provides three square meals a day (of varying quality based on her situation)\n<br />• \"Chore\" quests\n<br />• Trust &amp; mood systems\n<br />• Mother can learn up to 8 personality traits about you\n<br />• Five possible histories regarding your father\n<br />• Learn skills from her, or teach her some of your own\n<br />• New custom songs\n<br />• MCM for a customizable experience\n<br />\n<br />[size=5]PLAYER ORIGINS[/size]\n<br />\n<br />When you first meet your Skyrim Mother, your beginning interactions will begin to shape your experience. There will be two important choices to make right away.\n<br />\n<br />CHOICE #1: are you (1: Close) a child currently living with your mother, (2: Reunited) a teen who is visiting after time away, or (3: Long Lost) an adult who never knew her at all?\n<br />\n<br />CHOICE #2: based on your previous choice, what were the circumstances of your separation? There are roughly four options each.\n<br />\n<br />[size=5]TRUST SYSTEM[/size]\n<br />\n<br />Trust is on a scale of 0-30, and you begin at zero. Based on how you interact with your mother, your actions will gain (or lose) trust. Certain thresholds of trust unlock interactions with your Mother, and influence her willingness to take instruction from you. All in all--\n<br />\n<br />Actions/dialogue which indicate that you are\n<br />[i]taking responsibility\n<br />providing for her needs\n<br />caring for her safety\n<br />abating her fears\n<br />or\n<br />otherwise demonstrating reliability[/i]\n<br />will [b]increase [/b]trust.\n<br />\n<br />Actions/dialogue which indicate that you are\n<br />[i]looking out for yourself\n<br />not taking her distress seriously\n<br />lacking maturity\n<br />ignoring her\n<br />not providing for her needs\n<br />or\n<br />otherwise demonstrating little concern for her welfare[/i]\n<br />will [b]decrease [/b]trust.\n<br />\n<br />Regarding crime, your mother will certainly not approve if your actions are against the law, and she will not actively participate, but she will not\n<br /> report you and her trust level will not be affected. Remember: your mother loves you, and it's your actions toward [i]her [/i]specifically which \n<br />increase or decrease trust. Whatever your play style may be, her favor can still be won.\n<br />\n<br />[size=5]TRUST REWARDS[/size]\n<br />\n<br />[size=4]• NO TRUST 0-4[/size]\n<br />[i]Default dialogue trees: Comment, Suggest[/i]\n<br />Comment - many, varied options for you to express your feelings, opinions, snark, etc.\n<br />Suggest - tell her your preferences regarding how she acts while following\n<br />\n<br />[size=4]• LOW TRUST 5-14[/size]\n<br />[i]Dialogue trees unlocked: Share, Question[/i]\n<br />Share - help your mother by providing food &amp; drink, or asking her to help with carrying firewood\n<br />Question - ask your mother all sorts of questions about herself, your father, or the world\n<br />\n<br />[size=4]• MID TRUST 15-24[/size]\n<br />[i]Dialogue trees unlocked: Provide, Discuss[/i]\n<br />Provide - exercise your generosity in supporting your mother and her enterprises with gold\n<br />Discuss - your Mother is willing to speak about more complex subjects in-depth\n<br />\n<br />[size=4]• HIGH TRUST 25-30[/size]\n<br />[i]Dialogue trees unlocked: Teach, Console[/i]\n<br />Teach - you can teach your mother various skills, based on your own level, she she will use these new skills to your benefit\n<br />Console - now that you know each other well, you are equipped to influence your Mother for the better when she's in a bad mood\n<br />\n<br />[size=5]AGE UNLOCKS[/size]\n<br />\n<br />In addition to trust unlocking topics, age will also do the trick. Based on your choices in the intro, your mother will understand that you are of a certain age, and each life stage comes along with a different topic. If you wish to change what your age is, it can be done through dialogue at any time, or via the MCM.\n<br />\n<br />CHILD: [i]Request\n<br />[/i]Request - you can ask your Mother for help, skill training, favors, or songs\n<br />\n<br />TEEN: [i]Express\n<br />[/i]Express - \n<br />\n<br />ADULT: [i]Advise\n<br />[/i]Advise - you are able to influence your Mother's decisions, since your words carry more weight now that you are grown\n<br />\n<br />[size=5]LEARNING TRAITS[/size]\n<br />\n<br />Even from your very first introduction, your Mother will begin to learn your character. Your dialogue choices will tally up points in certain \"traits\". Traits are paired against each other; so, you can have up to 8 traits at a time. These traits will unlock new things to say to your Mother, and influence how she responds in other situations.\n<br />\n<br />[size=4]ADVENTUROUS or MODEST[/size]\n<br />Those of [i]adventurous [/i]spirit are curious, fearless explorers. They adore daring quests and magnificent feats of heroism. They have a wandering heart, and they are picked up and scattered wherever the wind may take them.\n<br />\n<br />The [i]modest [/i]are stable as mountains, reliable as a sunrise on the horizon. They prefer a quieter life, free of danger and volatility. Home is their ultimate sanctuary, and they seek to find or build it up wherever they go.\n<br />\n<br />[size=4]KIND or UNYIELDING[/size]\n<br />People who are [i]kind [/i]are concerned with nurturing others, helping the helpless, and understanding their rivals. For them, benevolence is an art. They love people, and take great care to place smiles on faces at every opportunity.\n<br />\n<br />[i]Unyielding [/i]men and women are often called rude, thoughtless, and stubborn by their peers. The truth is, they are not concerned with the opinions of others. They speak their mind freely, and, if the clang of their words is harsh against the ears, they simply couldn't care less.\n<br />\n<br />[size=4]CONFIDENT or ANXIOUS[/size]\n<br />The [i]confident [/i]are highly motivated, self-assured citizens. What they lack in caution they make up for with raw mental fortitude. Skilled in leadership and possessing an uncanny ability to inspire, these people are the front runners of any endeavor they aspire to.\n<br />\n<br />Those who are [i]anxious [/i]are burdened with doubt, often holding themselves to a higher standard than they can reasonably reach. This perfectionism causes them to shrink before difficult challenges in their life. Still, their caution and attention to detail often keeps them out of trouble.\n<br />[size=4]\n<br />CHILDLIKE or CYNICAL[/size]\n<br />A [i]childlike [/i]mind is one that is light, innocent, and imaginative. Hopeful and joyous by nature, they see the world in all its majesty and beauty: bright skies, grand cities, mysteries to discover, and treasures to be found! Their inherent passion fuels their excitement for the future.\n<br />\n<br />The [i]cynical [/i]mind is one of darkness, despair, and skepticism. They see the dirt beneath the fingernails of the world; war, famine, poverty, murder... In a place like that, how can what is good and pure hope to thrive? They have a keen awareness of tragedy and pain, and the growing amount of it is embittering.\n<br />\n<br />[size=4]PLEASURE-SEEKING or SCHOLARLY[/size]\n<br />Those who are [i]pleasure-seeking[/i] love merry-making. Singing and laughter are the nourishment of their souls. They are happiest when there is plenty of food, drink and attractive admirers. To live freely and expansively is their philosophy, and they are governed by their desires.\n<br />\n<br />[i]Scholarly [/i]individuals are disciplined, thoughtful types who value knowledge. Studious and focused, they find empty amusements to be a waste of their valuable time. Seeking to become experts and masters of intellect, they are also masters of themselves, exercising control over their own desires in order to conquer  their goals.\n<br />\n<br />[size=4]LIAR or VULNERABLE[/size]\n<br />The [i]liar [/i]is a sly, guarded imp. They seek to manipulate, shaping the minds of others as if they were clay. The core of their dishonesty is protection; they do not wish to be perceived in a negative light, and a well placed lie can help evade any problem. Their true feelings lie in shadows, hidden from all-- perhaps even from themselves.\n<br />\n<br />Those of a [i]vulnerable [/i]disposition are open, honest creatures. They are willing to admit fault, weakness, and insecurity. Their emotions are always present and obvious, and they express hurt and offense in equal proportion with admiration and affection. They can be trusted to speak from the heart.\n<br />[size=4]\n<br />LOGICAL or CREATIVE[/size]\n<br />[i]Logical [/i]people are concerned only with things that are tangible before them. They think practically, and make judgments based on fact rather than fancy. Putting great stock in science, they are of the belief that everything has an order and a place, and this knowledge puts them at peace with their present situation.\n<br />\n<br />The [i]creative [/i]soul is stirred by thoughts which lie beyond the mortal realm. These people are spiritual (of a sort); with or without gods, they believe strongly in the power of creation, the process of conceiving of things which never were, and bringing them to fruition. Art, philosophy, and culture are the muses and the canvas of these visionary people.\n<br />\n<br />[size=4]NOBLE or REBELLIOUS[/size]\n<br />Those who are [i]noble [/i]respect leadership and value high society. They enjoy modern life, believing that they deserve the best of everything. They thrive in cities where innovation and commerce are rampant. Though they are polite and deferential to the law of the land, they can be shrewd and demanding, seeking to exercise their ambitions within the confines of their societal structure.\n<br />\n<br />[i]Rebellious [/i]people are unafraid to live on the fringes of society, carving their own path. Outcast and undesirable, they despise authority and seek to spit in the face of it at every opportunity. Unhindered by law or any form of social grace, they are governed only by their personal code of ethics, surviving on their own merits and wits.\n<br />[size=5]\n<br />MISCELLANEOUS[/size]\n<br />\n<br />Your mother will always defend you in any battle situation, and does not become hostile when you injure her. She is a protected NPC, and is not marriageable, for obvious reasons.\n<br />\n<br />Your mother has a mind of her own. Sometimes, she won't feel like following you, or won't want to talk about certain things. Sometimes, she'll just be in a bad mood and will respond negatively to you. Sometimes, she'll be frightened, or sad, and want to be left alone. Sometimes, she'll want excitement and adventure too! She's made with an element of randomness that gives her an organic unpredictability.\n<br />\n<br />[size=5]RECOMMENDED MODS[/size][url=https://www.nexusmods.com/skyrim/mods/56916/]\n<br />\n<br />Growing Up in Skyrim[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/55555/]RS Children Overhaul (Playable Child Edition)[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/16231/?]Reduced Gold Reward for Quests\n<br />[/url][url=https://www.nexusmods.com/skyrim/mods/51473]iNeed - Food, Water, and Sleep[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/3863]SkyUI[/url]\n<br />\n<br />[b][size=6]FUTURE PLANS[/size][/b]\n<br />\n<br />• Storyline Quests\n<br />• More conversations\n<br />• Discover Mother's family history\n<br />• Scenes with NPCs\n<br />\n<br />[b][size=6]QUESTIONS?[/size][/b]\n<br />[size=5]\n<br />How can I find her?[/size]\n<br />• When the mod starts, you will find a book in your inventory titled \"Mother's Old Journal\". Reading it will begin the quest.\n<br />Alternately, you can simply find her in Riverwood at the Sleeping Giant Inn.\n<br />\n<br />[size=5]Is she essential?[/size]\n<br />• Nope. She's protected by default. If you choose to travel with her, your job is to keep her safe, and making her immortal is just kind of cheating in my opinion.\n<br />\n<br />[size=5]Will you do x,y,z related to Skyrim SE?[/size]\n<br />• I don't own it (I'm pretty poor honestly); otherwise, I would try? Truthfully, I don't know the first thing about SE.\n<br />\n<br />[size=5]Will you add other family members?[/size]\n<br />• When I started this project, that was the original plan, but I don't think so. Adding a biological sibling to the mix changes the dynamic I was going for, and having no father lends more weight to the trust system... i.e. though your mother is taking care of you, she also has to rely on you for some things. And part of the point of this mod is to take a more active role in your relationships with family.\n<br />\n<br />That said, you can introduce your mother to spouses, children, and followers, thus expanding the family yourself.\n<br />\n<br />[size=5]Does this mod conflict with [insert mod here]?[/size]\n<br />• Unlikely, since the bulk of the content is related to a single character, and her house is positioned in a difficult locale to build on. Still, as I said at the top, any mod that also edits the Riverwood wilderness navmeshes will probably crash your game.\n<br />\n<br />[size=5]I don't like that she's always ordering me around. I'm a grown man/woman, I can do what I want!![/size]\n<br />• I like to think I've written her to be of a temperate disposition for the most part. If you don't want to do things for her, you have the option to refuse, or turn off chore quests in the MCM.\n<br />\n<br />That said, if there's some kind of mix-up where she [i]literally [/i]thinks you are a child, and not an adult, you can change that via the MCM as well.\n<br />\n<br />[size=5]Okay, but what about friendly fire?[/size]\n<br />• Hitting your mother does not affect her trust. This is not a bug, but a choice I made. Because there's basically no way of differentiating a stray arrow or an accidental sword slash from a purposeful punch in the face, I didn't want the player to lose trust just because she ran in front of them at the wrong time. As someone who is frequently causing followers accidental injury, I wanted to be fair in this situation. Since the player's intent cannot be surmised by the game, I decided that shouldn't unduly hinder your progress. I don't condone the abuse of your Skyrim mother, but it's up to your own discretion. That said... that doesn't mean doing so won't affect her mood or the traits she learns about you; so, I'd still be careful.\n<br />\n<br />[size=5]She's ugly. Can you make her prettier?[/size]\n<br />• Nah.\n<br />\n<br />[size=5]But I'm a Khajiit/Argonian/Orc... wait, am I adopted?![/size]\n<br />• There is no dialogue in game that confirms or denies whether or not she is your biological mother, and your father will never be present; so, you can roleplay it however you want.\n<br />\n<br />I also don't mind if people want to make patches for other races of mother, but the dialogue will sound the same. There's no way I could voice a beast race, and I definitely wouldn't want to considering the scope of the dialogue options.\n<br />\n<br />[b][size=6]CREDITS[/size][/b]\n<br />\n<br />Seeing as this is my first published mod ever, I had a lot of both direct and indirect help.\n<br />\n<br />• The Skyrim Creation Kit, for facilitating this mod's existence, and giving me the tools to make it\n<br />• All the tutorials on the Creation Kit wiki (I basically devoured all of them)\n<br />• MrAndersonLP, for his tutorial on creating a custom player home\n<br />• Darkfox127, for his tutorials on navmeshes &amp; scripting\n<br />• NeonFireModding, for a simple lil script to advance time\n<br />• zikul, for the tutorial on invisible activators\n<br />\n<br />• My husband, for being a huge goof\n<br />• My real life mother, for being a Skyrim nerd like me\n<br />\n<br />I was also (heavily) inspired by these mods in the community:\n<br />• Growing Up in Skyrim, for giving me the idea in the first place\n<br />• Interesting NPCs, for their brilliant writing\n<br />• INIGO, for being a good example that a single, lovingly crafted NPC can be rich and interesting\n<br />• Companion Vilja, for the sheer variety of her skillset and massive amount of dialogue and options",
  "categoryId": "96",
  "version": "0.0.1",
  "author": "dommiesgrl",
  "createdUnix": "1454689918",
  "updatedUnix": "1454689918",
  "containsAdultContent": false,
  "uploadedBy": "dommiesgrl",
  "primaryFile": null,
  "files": []
}