{
  "modId": 73243.0,
  "modName": "Centaur (both human and horse halves functioning)",
  "summary": "While this has functioning centaurs in it, it also has many modder resources because there were several ways I attempted to make the centaurs.  The way I finally got to work is only an npc/follower/enemy type.  But if someone with much more skill than me thinks they can take my failed versions and run with it, I&#39;m more than happy for them to tr",
  "descriptionHtml": "[center][b][u][font=Georgia][i][size=5][color=#ffffff]Centaurs in Skyrim&#33;  [/color]\r<br />[/size][/i][/font][/u][/b][/center]\r<br />[color=#ffffff]\r<br />[i][size=4]=============================\r<br />Description, Usage & Issues\r<br />=============================[/size][/i]\r<br />This is a special modders resource that anyone can use and improve upon so long as credit is given. The mod features two types of centaurs. One is meant as a playable race while the other serves as an enemy. I know what you are thinking; there are already two mods that add centaurs to the game. While they seem like perfectly fine mods to me, neither felt right. The human and horse halves are supposed to both move. \r<br />\r<br />Now this mod has some issues, but it does give the game functioning centaurs.  \r<br />[size=3]\r<br />[b][i]==============================\r<br />Update Log\r<br />==============================[/i][/b][/size]\r<br />[b][size=3][i][u]Log 1[/u][/i][/size][/b]\r<br />[/color][color=#ffffff][color=#ffffff]The top two issues, ones I’m still working on and plan to fix, are the arm and hand textures are off.  And the skeleton\r<br />currently causes the centaurs to tilt back and look at the sky – no idea why, yet.[/color][/color][color=#ffffff]\r<br />\r<br />[size=3][u][i][b]Log 2[/b][/i][/u][/size]\r<br />[/color][color=#ffffff][color=#ffffff]Spikedragonlord has kindly agreed to look at the textures and skeleton for me to see what I’ve done wrong, hopefully \r<br />he’ll figure it out.  If some\r<br />other industrious modder wants to tinker with it, by all means go right ahead.[/color][color=#000000] [/color][color=#ffffff]I’ve been working on getting functioning centaurs in the game for over six \r<br />months now.  In that time I’ve been close to getting them to work from \r<br />within a few weeks of starting.  But I could never get the player \r<br />version to\r<br />jump over that last hurtle.  So, I’ve come to the conclusion that it might very well be out of my reach.  Thus, I throw \r<br />out to the community all the\r<br />failed attempts as resources.  All I want is acknowledgement if you manage to make the mod work.  And as \r<br />always, I wish you luck and have fun.\r<br />\r<br />[size=3][b][i][u]Log 3[/u][/i][/b][/size]\r<br />[/color]Well, I&#39;ve uploaded a new version of the file after Spikedragonlord fixed the issues I was having with the textures and skeleton.  So, I hope you all enjoy. While I still have a few plans for my centaurs, I intend them to go into a new mod.  So, this mod will only be updated if myself or someone else figures out how to fix the player version of the centaur.  I will post links to the actual centaur mod that puts the centaur tribe(s) in the game when I&#39;ve gotten far enough along to make the mod.  Right now, I&#39;m working on making a gorgon statue curse script and I&#39;m very close to getting it perfect - so look for a mod by me and spike featuring gorgons and their terrible stare&#33;[/color]",
  "categoryId": "82",
  "version": "Alpha",
  "author": "jeffboyd4",
  "createdUnix": "1454721220",
  "updatedUnix": "1455111747",
  "containsAdultContent": false,
  "uploadedBy": "jboyd4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000195017",
      "name": "Centaurs",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "39579",
      "fileName": "Centaurs-73243-.zip",
      "uploadedUnix": "1455111747",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8f8f3ab7d6330131b9f0fd24b3b6c45352f12bf99fc0c326d37c7220b94c7a6e/analysis/1455111794/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Centaurs-73243-.zip?fid=1000195017&ttl=1535861906&ri=8192&rs=8192&setec=2688aedb39d5dcd6c67ecc3601e7c1e9"
    }
  ]
}