{
  "modId": 73301.0,
  "modName": "Katy's Un-derpified Nobles and Traders",
  "summary": "A WIP overhaul of Skyrim's derpy clothing (because someone had to do it)",
  "descriptionHtml": "[b][size=3][center]Please no reuploads to Steam. EVER. [/center]\n<br />[/size][/b]\n<br />[center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center]\n<br />\n<br />So one of the things that IMMEDIATELY bugged me about Skyrim was the horse-blanket female fineclothes models. One of the first things I did with modding this game was fixing those. But over time the teeny tiny plugin that I used to replace these models with custom dresses grew and grew and was tweaked, scrapped, and rebuilt about a zillion times..... And a few months ago I looked around my Skyrim and said, \"damn, that's sexy, I should upload this.\" And so I am.\n<br />[center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center]\n<br />[b][size=3]This mod REQUIRES [url=http://www.nexusmods.com/skyrim/mods/39922/?]Elven Dresses by Naihaan[/url].[/size][/b] Both the colored and standalone black and white files. This is NOT a soft requirement/recommendation, they're masters, the game will crash without them. I can't get ahold of Naihaan and so I haven't included any of her assets without permission. I will not be changing this requirement unless circumstances change! (She answers me and says it's OK) So don't ask! That is one of the biggest points to this mod! This is a WIP because I basically had to rebuild it from the ground up once I seriously decided to upload it, based on the permissions I could get and with compatibility in mind. Over time I'll be adding more aspects of my original personal plugin, but for now the assets used (included with the mod) are:\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/16438/?]Bandolier Bags and Pouches[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53442/?]ZZJay's Wardrobe[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/49130/?]Velvet Robes and Cloaks[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/26713/?]Grace Darkling's Attire Packs[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/67601/?]Triss' Dress[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/63634/?]Noblesse Oblige\n<br />[/url] [url=http://www.nexusmods.com/skyrim/mods/35125/?]Maid Outfits (new in 1.2)[/url]\n<br />\n<br />These are awesome mods and if you even THINK about endorsing mine you must endorse these! Especially because they were awesome enough to let me use them so my mod wouldn't have a billion required files. And if you feel like using my plugin as a base for your own upload, you MUST contact ALL of these authors too to avoid the banhammer and eternal hell. Stealing from awesome people is bad.\n<br />[center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center]\n<br />[u][b]Blah blah blah, but what does it DO, Katy?[/b]\n<br />[/u]\n<br />[list]\n<br />[*][size=2]Female fine clothes have been replaced. There are 4 female models in the game-- 2 have been replaced with Triss' Dress, 2 have been replaced with Elven Dresses. Triss' dress is no longer scripted-- in the original you can change the color, mine's plain old regular clothing. All of the colors I didn't use from Naihaan's mod have been added to the leveled lists, and some of Triss' Dress (there were a lot so if I added them all they'd be over represented). Because the male model for this dress is the vanilla fine clothes you MAY see some MALES wearing vanilla but I did that because I don't hate them on males and variety is the spice of life. See recommended mods.[/size]\n<br />[*][size=2]The Wedding Dress has been replaced with the white dress from Elven Dresses. The female yarlclothes03 has been replaced by the black dress-- this is unique to Elisif in vanilla, I wanted her to look more like a widow. For some reason she doesn't wanna change when I just change her outfit. The dress is beautiful, if you have any custom NPCs who get it they're lucky, I don't feel like this needs to change.[/size]\n<br />[*][size=2]Male fine clothes use models from Noblesse Oblige. Noblesse Oblige female dresses don't replace anything (because the models clip with some custom hair), but they've been added to the fineclothes leveled list (because they're still very cool).[/size]\n<br />[*][size=2]Cloaks from Velvet Robes and Cloaks have been added to half of the vanilla fine clothes outfits and the fineclothes leveled list.[/size]\n<br />[*][size=2]Added maid outfits (the less colorful ones, such as \"brown\" and \"old green\") to the clotheswork and clothesregular lists-- the male mesh is the barkeeper.[/size]\n<br />[*][size=2]The merchant clothes outfits now have The Old Earth Dress and The Imperial Dress from Grace Darkling's attire packs-- unlike the fine clothes, these don't replace the models, they'll actually have these in their inventory. The male model for these has been changed from the barkeeper mesh in the original mod to the merchant mesh, so the males will look the same. Also added a few to the work leveled list.[/size]\n<br />[*][size=2]Because the merchant clothes are kind of everyone's favorite common clothes, and to make the transition from rich/middle class/poor not so harsh, the original merchant clothes have not been replaced and are now distributed through the leveled lists clothesfarmall and clotheswork.[/size]\n<br />[*][size=2]Merchants and nobles now have stuff from Bandolier in their outfits. Merchants will have satchels, pouches, boxes.... I wanted them to look robbable and busy. Nobles will have much less clutter but they will carry the occasional pouch. The court wizard outfit has a book.[/size]\n<br />[*][size=2]Changes carried over from my teeny tiny mod, Katy Hates Fine Hats (if you have these you can disable them)-- [/size][size=2]the merchant hat has been replaced with ZZJay's huntress hat, [/size][size=2]farmhat01 (ugly windsock hat) has been replaced with a modified version of ZZJay's huntress hat without the feather, all fine hats are now called \"Fine Circlets\" and their model is replaced with a gold and emerald circlet. The hat does not hide hair so may cause clipping with custom hairs. I might move the male model up a smidge. Let me know.[/size]\n<br />[*][size=2]Removed the gloves from fine clothes outfits as they didn't go with the flashier models.[/size]\n<br />[*][size=2]Merchants and nobles will wear more jewelry-- with a few exceptions, merchants wear silver and nobles wear gold. I have not changed the value/data of vanilla jewelry, if you're in the habit of killing off tons of these NPCs that will be an exploit but I won't change them; for compatibility's sake, because tons of mods do that.[/size]\n<br />[*][size=2]The farmhat01 model (modified version of ZZJay's with this mod) has been added to one of the merchant outfits.[/size]\n<br />[/list][center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center]\n<br />[u][b]Some random changes from the original mods:[/b]\n<br />\n<br />[/u][list]\n<br />[*][size=2]Many things have been renamed to be more immersive or to make sure they're gender neutral. Bandolier stuff is simply \"pouches\" or \"satchel\" for example. Triss' Dress (all variants) is Elegant Garment. The Imperial Dress is Imperial Clothes. And etc.[/size]\n<br />[*][size=2]Saturation level in the male Noblesse Oblige textures has been toned down a bit. If you use the original one or the other of us will overwrite, pick the one you like more.[/size]\n<br />[*][size=2]The prices for lots of stuff (especially Bandolier) has changed to avoid unbalancing everything but it's still a bit pricier than vanilla clothes, let me know how successful that was.[/size]\n<br />[*][size=2]NONE OF IT IS CRAFTABLE. ALL COBJ RECORDS HAVE BEEN REMOVED. If you want to craft the stuff, download (and endorse) the originals, this mod was designed NOT to have that so your crafting menus stay nice and tidy, this is a clothing overhaul for NPCs, not a merge of the original mods. You can get the stuff anywhere you find normal clothes (dressers, chests, corpses etc.-- hopefully not TOO much) but you can not craft anything.[/size]\n<br />[*][size=2]Bandolier stuff will not have the fortify carry weight enchantment, it's just for looks. The EDIDs have been changed so if you use Bandolier it should not mess that stuff up.[/size]\n<br />[/list][center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center][u][size=2][b]The NPC Optional File[/b]\n<br />\n<br />[/size][/u][size=2]This file makes some direct edits to certain NPCs to reflect the changes in this mod. For example, Brina in Dawnstar looks ridiculous in a pretty dress talking about being a gruff veteran, so now she wears Jarl clothes, still classier but much less.... girly. This file will conflict with NPC appearance overhauls or anything else that modifies the NPCs in it directly. (Grey face bug will happen and/or you will lose other mods' direct edits)\n<br />\n<br />So far, these are:\n<br />\n<br />[/size][list]\n<br />[*][size=2]Maven Blackbriar- wears jarl clothes[/size]\n<br />[*][size=2]Voldsea Girion- wears jarl clothes[/size]\n<br />[*][size=2]Brina Merilis- wears jarl clothes[/size]\n<br />[*][size=2]Drifa- wears a merchant outfit[/size]\n<br />[*][size=2]Tova and Nilsine Shatter Shield- wear black dresses[/size]\n<br />[/list]\n<br />This list will grow as people give me more examples/I notice NPCs whose outfits no longer match their character because of the changes in this mod. So please, if you notice anything weird, tell me, I'm happy to fix it in this file.\n<br />\n<br />OK, I entertained the idea of making patches for this but I'm done. If I do that for everyone, that means every time I make a teeny tiny change to the NPC file I need to make it at least 4 times (and upload 4 more files) and since I plan to keep changing it pretty regularly I'm not doing it, sorry. BUT THERE'S GOOD NEWS, you can change outfits yourself in LITERALLY 2 steps. If you can clean your mods, you can handle this. I believe in you. The spoilers are links with big pretty pictures.\n<br />\n<br />1) Load the NPC file and your overhaul of choice in TES5Edit and open my file.\n<br />\n<br />[spoiler] [url=http://imgur.com/9v8c5ZW][img]http://i.imgur.com/9v8c5ZW.png[/img][/url] [/spoiler]\n<br />\n<br />2) Pick an NPC and scroll down to default outfit (it'll be highlighted)-- now drag and drop my mod's outfit into the overhaul. Don't be scared, it'll be OK.\n<br />\n<br />[spoiler] [url=http://imgur.com/6PrjMav][img]http://i.imgur.com/6PrjMav.png[/img][/url] [/spoiler]\n<br />\n<br />My bad, I guess it's 3 steps-- repeat for the other NPCs, exit and save. Now you can toss the NPC file since all it does is change default outfits. See, that wasn't so bad was it? OK, so I can focus on the rest of the mod now. Want to get the default back? Reinstall your overhaul-- or drag their default outfits from skyrim.esm in the same way. By the way doing that EXACT thing is how just about all compatibility patches are made-- usually it's more complicated (making a separate patch than dragging the changes together like that) and harder to tell what some of the things are, but the idea is the same. Yes, YOU too can patch your game. All by yourself like a big boy.[b][u][size=2]\n<br />\n<br />Sorry if this approach bums anyone out but I'm not doing it. I have to download your overhaul and all of its required files, and patch it every time I notice like ONE NPC I wanna change-- and I keep pretty on top of updates but that's too much. It's much less work for you to do than for me. Besides it's a good thing to learn even if you just bought the game. If I get to the point where I don't think I'll be updating it much more or the NPC list gets big then maybe I'll reopen the patch idea, for now this is easy and you can pull it off.\n<br />[/size][/u][/b][center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center]\n<br />So that's about it, give it a try, hope yall like it :) As you can see my screens suck, I am NOT a screenarcher and I'm on a mediocre machine right now. The tab is open though, please post your own, it'll get you kudos, I know I need better ones.\n<br />\n<br />Updates with more custom assets, changes, texture tweaks, and patches for other popular mods which edit outfits coming soon so track it.\n<br />[center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center]\n<br />[b]Q: Why do all your files have your name in them?[/b]\n<br />[b]A: [/b]Because I have a lot of mods and I make a lot of patches, it's easier to sort through 640 half unticked mods if they have a common name. Plus I've just been doing it that way for years.[b]\n<br />\n<br />Q: You know the acronym for this mod is....\n<br />A:[/b] .... Hilarious, ironic, and fitting? Thank you.\n<br />\n<br />[b]Q: Will you make a version without the Elven Dresses requirement?[/b]\n<br />A: [img]http://i.imgur.com/G78xgtA.jpg[/img]\n<br />\n<br />[b]Q: Blah blah IMMERSHUN blah blah LORE FRIENDLY[/b]\n<br />A: I play with SFO summer, and whatever, it's a fantasy game.... I'm working on tweaking the textures to be a little less clean. You don't like it, no one's forcing you to use it. I have no ****s to give. I like it :P That being said, I consider my setup and this mod pretty much fantasy cannon. If by lore friendly you mean realistic, no, it isn't, and neither are dungeons, dragons, or magic. I'm 100% willing to take suggestions, I want to improve it, and I love the lore, but I don't like women bundled like eskimos in MY fantasy game (even if it's certainly how I would dress in the Tundra). To each his own.\n<br />\n<br />[b]Q: Why don't you change the female shoes, vanilla ones are ugly with these clothes....[/b]\n<br />A:[img]http://i.imgur.com/D1kXcTu.png[/img]\n<br />\n<br />[size=2]Because some NPCs wear fine boots/shoes with other outfits. Find me a resource that works for both and I'll try to get permission for it, for now they stay. I've considered some boots from, of all things, the various TERA armor packs available, but most of the ones I tested have a foldover cuff type thing at the top that clips with dresses. And since they're one contiguous block I can't remove them in nifskope. But it's impossible for one person to go through the literally hundreds of thousands of boot models for Skyrim between the nexus, workshop, LL, and foreign sites, so if you have an idea please let me know. It bugs me too. Keep in mind this is supposed to be at least semi-\"lore-friendly\" and it will NEVER require HDT, I like to keep things clean and compatible so no \"real\" high heels will never have a place here.\n<br />\n<br />[b]Q: Why don't you include the belts that come with the elven dresses? They look way better that way....[/b]\n<br />A: Yes, they do, but NPCs do a lot of just sitting around and those belts don't bend. I'm thinking of adding a belt to the dress texture, it's on my mind. Or, I could just make the plain textures more interesting, like the black and white ones.\n<br />\n<br />Q: Why's the file so big? ARE YOU TAKING OVER MY COMPUTER?\n<br />A: I wish. No, it still has basically all the assets from the original mods whether I used them or not, because I want to keep it all packaged together and nice and neat while I'm working on it. Some stuff I haven't included yet but would like to. When it's a little closer to finished I'll do some trimming of things I didn't use. For now think of it as a bonus-- if you use AddItemMenu http://www.nexusmods.com/skyrim/mods/64905/? (love it for testing) you have access to almost everything whether you see it used in game or not.[/size]\n<br />[center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center]\n<br />[b][u]Recommended/Related Mods and Compatibility (everything linked I use and love):[/u][/b][list]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/19826/?]Elaborate Textiles[/url] [color=#00ff00]Compatible[/color] (the male fine clothes textures are my favorite on the nexus, I actually let them overwrite Rustic but use Rustic for most other things where they conflict, I know they're lower quality but I love them. I might retexture some choice pieces in 2k to go with this if I can get permission. Also cute kid clothes. Really they're all great, just low quality, I'd love to scale them up)[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/69784/?]Rustic Clothing[/url] [color=#00ff00]Compatible[/color][/size]\n<br />[*][size=2][color=#00ff00][color=rgb(255, 255, 255)][color=rgb(255, 255, 255)][url=http://www.nexusmods.com/skyrim/users/6129727/?tb=mods&amp;pUp=1]Anything from Lind001s robes series[/url] [color=#00ff00]Compatible[/color][/color][/color][/color][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/37764/?]Circlet Replacers for Women[/url] [color=#00ff00]Compatible[/color][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/51813/?]Common Clothes[/url] [/size][size=2][color=#00ff00]Compatible [color=#ffff00]if you load it before my mod, the version here is balanced to reduce but not completely remove the overuse of pants by females when loaded this way[/color] [/color][/size][size=2](In the future I'll have an optional patch that uses some of this mod's custom leveled lists IE LItemmerchant, renames the clothes for muh immershun, and gives a bit more color to the textures to match this stuff better-- waiting to hear back from the author about actually making some of it part of the mod, but a patch to tweak it at least will definitely happen. )[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/6770/?]Various Guard Outfits[/url] [color=#00ff00]Compatible[/color][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/19305/?]Digitigrade Khajiits[/url] [color=#00ff00]Compatible[/color][/size]\n<br />[*][size=2][color=#00ff00][color=rgb(255, 255, 255)][url=http://www.nexusmods.com/skyrim/mods/19305/?]Raptor Talon Argonians[/url][/color] Compatible [color=rgb(255, 255, 255)](I would like to add a file that combines the DGK and RTA changes but I'm not sure how popular that'd be, let me know. It seems kinda out of place here but IMHO it makes a huge difference cosmetically, and after all both are armor editing mods which is what this is, making your Skyrim more believable AND pretty, which is what this mod is all about.)[/color][/color][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/63834/?]Scarves of Skyrim Lore Friendly Remix[/url] [/size][size=2][color=#00ff00]Patch in optional files [/color][/size][size=2][s](Patch soon, for the moment load it before my mod and it'll show up on everyone but NPCs who wear vanilla outfits merchantclothes, merchantclothesvariant, or any of the fineclothes outfits-- NPCs who get merchant clothes or fine clothes from a leveled list don't count there[/s] )[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/12092/?]Cloaks of Skyrim[/url] [/size][size=2][color=#00ff00]Compatible, no patch needed [/color][/size][size=2][s](Patch soon, same deal[/s] )[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/42752/?]Seniors wear vanilla[/url] [/size][size=2][color=#ffff00]Compatible but won't take effect on the new models [/color][/size][size=2](Before I started using [url=http://www.nexusmods.com/skyrim/mods/56093/?]Realistic Body System[/url] this was my favorite way to un-CBBE-ify old ladies, it attaches a[/size][size=2] special mesh to the elder race overriding your clothing/body mods-- [/size][size=2]merge it with [url=http://www.nexusmods.com/skyrim/mods/19730/?]Consistent Older People[/url] for muh immershun, they don't conflict, but using them separately causes the grey face bug.)[/size]\n<br />[size=2][/size][*][size=2][b][u]NPC Overhauls, like Apachii Hair for NPCs, IoS, UNPCO, etc.[/u][/b] [color=#ff0000]Will conflict with the optional NPC file[/color]-- I put up instructions for how to apply the changes to your overhaul of choice yourself, this is how it's gonna work until everything else is done.[/size]\n<br />[*][size=2][b][u]Sexy mesh replacers, like a little sexy armor replacer, CBBE remodeled armors, etc.[/u][/b] whatever your booby mod of choice is-- [color=#ffff00]The two will be compatible based on what loads last[/color]. Some things won't work right depending on which file you let overwrite. I don't use these mods so, like above, haven't gotten around to patching for them yet. Eventually I will put up some optional meshes that are skimpier but for now you'll have to pick which models you like and use them.[/size]\n<br />[/list][center][size=2]--------------------------[/size][size=2]--------------------------[/size][size=2]--------------------------[/size][/center][u][b]My other Skyrim files:[/b][/u]\n<br />[size=2][url=http://www.nexusmods.com/skyrim/mods/72622/?]Katy Hates Fine Hats[/url] (has a couple options not included in this mod)\n<br />[/size][size=2][url=http://www.nexusmods.com/skyrim/mods/72974 ]Katy's Markarth Textures[/url][/size]",
  "categoryId": "60",
  "version": "1.2",
  "author": "Katy420",
  "createdUnix": "1454860272",
  "updatedUnix": "1455922672",
  "containsAdultContent": false,
  "uploadedBy": "Katy420",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000194660",
      "name": "Katy&#39;s Un-derpified Nobles and Traders-- Scarves of Skyrim Patch",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Katy's Un-derpified Nobles and Traders Scarves of Skyrim Patch-73301-.zip",
      "uploadedUnix": "1454867104",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4fe8e3dad342418d03436ffba6726c155946c04b4f1f44298eef7228eac28ec4/analysis/1454867106/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katy%27s%20Un-derpified%20Nobles%20and%20Traders%20Scarves%20of%20Skyrim%20Patch-73301-.zip?fid=1000194660&ttl=1535861974&ri=8192&rs=8192&setec=cd611b8a7f003fc42250d3c0cf4b4331"
    },
    {
      "fileId": "1000194683",
      "name": "Katy&#39;s Un-derpified Nobles and Traders-- Inhabitants of Skyrim Patch",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "Katy's Un-derpified Nobles and Traders Inhabitants of Skyrim Patch-73301-.zip",
      "uploadedUnix": "1454878971",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/85049ba032480f12c261a89a43df1ae418dd689c78d97975d3f300ad0baae8fa/analysis/1454878985/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katy%27s%20Un-derpified%20Nobles%20and%20Traders%20Inhabitants%20of%20Skyrim%20Patch-73301-.zip?fid=1000194683&ttl=1535861974&ri=8192&rs=8192&setec=4b1ab62221bb3a18098b24bdc333a143"
    },
    {
      "fileId": "1000196340",
      "name": "Katy&#39;s Un-derpified Nobles and Traders 1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "275537",
      "fileName": "Katy's Un-derpified Nobles and Traders 1.2-73301-1-2.zip",
      "uploadedUnix": "1455922017",
      "modVersion": "1.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Katy%27s%20Un-derpified%20Nobles%20and%20Traders%201.2-73301-1-2.zip?fid=1000196340&ttl=1535861975&ri=8192&rs=8192&setec=5e7b2012b75882a8ddddd1caabae4309"
    },
    {
      "fileId": "1000196342",
      "name": "Optional NPC File 1.2",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4",
      "fileName": "Optional NPC File 1.2-73301-1-2.zip",
      "uploadedUnix": "1455922672",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/27e03a91f2bdd0d020f33c11087e6731211156e784865f740152355f977c964c/analysis/1455922685/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Optional%20NPC%20File%201.2-73301-1-2.zip?fid=1000196342&ttl=1535861975&ri=8192&rs=8192&setec=9b377fde35b99dad597af6ea907d43e1"
    }
  ]
}