{
  "modId": 73327.0,
  "modName": "PC Innocent Voice Pack",
  "summary": "Custom voice pack for Player Voicesets by ChizFoShiz",
  "descriptionHtml": "[b][u]REQUIRED:[/u][/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/download/1000101249]Player Voicesets[/url] (Custom Voice Version)\r<br />\r<br />[b][u]DESCRIPTION:[/u][/b]\r<br />\r<br />This is a small addon for Player Voicesets by ChizfoShiz. I put this together since I always used this voice in Oblivion and missed my old characters. [s]It is adapted from an old voice mod which I can not for the life of me remember the name of apart so am unable to post any original credits (if anyone recognizes it I would happy to update with the relevant info&#33;)\r<br />[/s]\r<br />The voice is intended for a young & innocent female character.\r<br />\r<br />[youtube]jDRBJ_EyJNU[/youtube]\r<br />\r<br />[b][u]BUG:[/u][/b]\r<br />\r<br />Please note that there is currently a slight problem with Player Voicesets which prevents certain custom voice files from playing (most notable attack &#39;grunts&#39;). This is purely a scripting issue with Player Voicesets and so out of my hands so far remedies go.\r<br />\r<br />[b][u]DEVELOPMENT:[/u][/b]\r<br />\r<br />I had originally planned to rework this into a much more immersive voice mod in it&#39;s own right with quest & location aware commentaries (if you have ever travelled with a well voiced companion like Vilja or Sofia you will know what I mean), however my time is currently being prioritized over at the TESRenewal project so it is unlikely that will ever come to fruition. This means that this mod is as complete as it will be and since I took the time to make it for my own game I figured I may as well share it here :)\r<br />\r<br />That being said; if anyone feels so inclined as to take the reigns and continue such a development I will happily do my part as I still believe it is something sorely missing from this game&#33;\r<br />\r<br />[b][u]INSTALLATION:[/u][/b]\r<br />\r<br />1) Install Player Voicesets as per it&#39;s requirements\r<br />2) Install the content of this mod to your Data folder\r<br />3) Activate the &#39;Custom Voice&#39; voice option via the Player Voice MCM menu in game\r<br />4) Enjoy&#33;\r<br />\r<br />NB: Given the nature of the evented scripting within the orignal mod, many of this custom voice&#39;s comments are tied to a &#39;chit chat&#39; feature which is activated by the &#39;Taunt&#39; keybind in game (setup from the same MCM menu). Think of it less as a taunt and more like pulling the chord on the back of a talking teddy bear&#33; The default keybind for this is &#39;Esc&#39; so I recommend rebinding to something more amenable.  \r<br />\r<br />[b][u]UNINSTALLATION:[/u][/b]\r<br />\r<br />1) Remove all content from the Data/Sound/Fx/Custom Voice folder\r<br />\r<br />[b][u]CREDITS:[/u][/b]\r<br />\r<br />ChizFoShiz for the great Player Voicesets mod in the first place\r<br />BruceVayne for the original Oblivion voice set (and Valc for finding out this out for me&#33;)\r<br />\r<br />NOT me&#33; All I did was pack the files accordingly&#33;",
  "categoryId": "61",
  "version": "1.0",
  "author": "LegacyCloud",
  "createdUnix": "1454932306",
  "updatedUnix": "1454932293",
  "containsAdultContent": false,
  "uploadedBy": "LegacyCloud",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000194763",
      "name": "Player Voiceset Innocent",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2733",
      "fileName": "Player Voiceset Innocent-73327-1-0.7z",
      "uploadedUnix": "1454932293",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/88a8b98fa688c599d6a182d92fd0e48ace1f3a1867d3cd0163542c8424d33d2f/analysis/1454932327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Player%20Voiceset%20Innocent-73327-1-0.7z?fid=1000194763&ttl=1535862000&ri=8192&rs=8192&setec=333b005f0eae1309723473669ba9ce82"
    }
  ]
}