{
  "modId": 73342.0,
  "modName": "A Beginner&#39;s Guide To Modding Skyrim",
  "summary": "Overwhelmed by the vast world of Skyrim modding, but want to get in on it anyway? Then this is the guide for you&#33; \r<br />\r<br />A comprehensive tutorial covering the very basics of downloading and installing mods and tools and getting them to play nice with each other. ",
  "descriptionHtml": "Skyrim is over four years old now - it seems impossible that anyone could have made it this far without picking up on the intricacies of modding. And yet, those people exist. Be they migrating from consoles, or just got the game in a Steam sale, there are people just now getting into the world of modding without the faintest idea of where to start. It can be very overwhelming - at least, it was for me three years ago, and there&#39;s many more mods available now&#33; So I thought to myself, wouldn&#39;t it be useful if, instead of hunting all over for documentation on every mod utility out there, there was a guide covering every aspect a beginning modder might need to know? And then I made it. \r<br />\r<br />&#39;A Beginner&#39;s Guide To Modding Skyrim&#39; is a compilation of everything I&#39;ve picked up over three years of modding Skyrim without being a mod creator myself. As of v. 1.0, it provides guidance on:\r<br />\r<br />- Installing The Modder&#39;s Tool Set: [i]Nexus Mod Manager, SKSE, ENB Series / ENBoost, LOOT, TES5Edit, SkyUI, Wrye Bash\r<br />[/i]- Downloading And Installing Mods\r<br />- Sorting, Cleaning, Merging, And Patching Mods\r<br />\r<br />I&#39;ve also included a handy modding checklist and a list of mods I either use currently or have used frequently in the past, to serve as &#39;inspiration&#39; for people just setting out into the massive world of Skyrim modding. \r<br />\r<br />Future versions are planned to cover:\r<br />\r<br />- The Basics Of The Creation Kit (with the aid of someone far more CK-savvy than myself)\r<br />- Frequently Asked Questions\r<br />- Mod Troubleshooting\r<br />\r<br />The most recent version can be viewed through Google Docs: \r<br />\r<br />https://docs.google.com/document/d/1XPtVhSSxTcHv71NSVsK2v3R5VPTYsb9YVKzcYsig2BQ/edit?usp=sharing\r<br />\r<br />Hopefully some folks will get some use out of this guide - I know I would&#39;ve found it handy to have when I was starting out. Happy modding, and here&#39;s to a stable Skyrim&#33;",
  "categoryId": "82",
  "version": "1.0",
  "author": "SlavkaOfTheCouslands AKA Slavka13748",
  "createdUnix": "1454965777",
  "updatedUnix": "1454965737",
  "containsAdultContent": false,
  "uploadedBy": "SlavkaOfTheCouslands",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000194827",
      "name": "A Beginner&#39;s Guide To Modding Skyrim - PDF",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "650",
      "fileName": "A Beginner's Guide To Modding Skyrim - PDF-73342-1-0.rar",
      "uploadedUnix": "1454965737",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2afd0c71eabe42cc979c3ee29bca48afc0deb086a992c33dd78d9d848f96b954/analysis/1454965744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Beginner%27s%20Guide%20To%20Modding%20Skyrim%20-%20PDF-73342-1-0.rar?fid=1000194827&ttl=1535862015&ri=8192&rs=8192&setec=2e3d7c9fc65f5ed28b507eaa38966d7c"
    }
  ]
}