{
  "modId": 7336.0,
  "modName": "Raela Save Game",
  "summary": "Level 1, Sexy Young Nord Female Raela Save Game.",
  "descriptionHtml": "It\\'s time for another addition to my wonderful save games collection. Today, I present to you Raela. A young but highly skilled Nord Warrior gifted in the talents of seduction and sword play. When her father and older brothers went off to join Jarl Ulfric Stormcloak in the war against the Empire, she was stuck behind to contend with dealing with a protective husband who wouldn\\'t let her fight. With circumstances now changed, she finds herself dropped into a world she wasn\\'t completely prepared for. (You\\'ll have to read her back story included in the .rar! Muahaha!)\r\n\r\nFollowing my growing tradition of trying to present well made and playable characters for all types of players, Raela is modified in the following ways to give her more of a unique flavor:\r\n\r\nHer Magicka has been reduced from 100 to 75.\r\nHealth has been increased from 100 to 300.\r\nStamina has been increased from 100 to 500.\r\nAll to match her prowess and fearsome skill in hand to hand and armed combat with a blade.\r\n\r\nHer Smithing has been increased to 50 and her Speech has been increased to 40.\r\n\r\n(For this next part, you\\'ll have to read her back story to understand why I did it.)\r\nSince I sent her off to follow Ralof through Helgen Keep\\'s bowels. She found her old armor stowed away in a chest in the Dungeon.\r\nI have equipped her with Ancient Nord Boots, Gauntlets and Armor. A Steel Sword and Iron Shield.\r\nThe difference here is with my last characters, I always gifted them with a little something to help out. This time around, I thought against it, what with her unique story. She\\'s got on her only what she could plunder from the keep.\r\n\r\n\r\nAs with all three of my other saves, you\\'ll need to have the mods I\\'ve listed in my previous files in order to have her look. You can find the list of which mods to have by going here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6816\r\nSimply scroll down and you\\'ll see the list in the description.\r\n\r\nI\\'d like to also once again thank Bethesda for making such an awesome game. I\\'d like to extend full credit and thanks again to the creators of those wonderful mods that allowed me to create such a sexy and fun character. And I\\'d like to thank the Nexus for giving me a place to give back to a community that has helped me enjoy my gaming experience in Skyrim and make it much more enjoyable!\r\n\r\nAs always, I\\'d love to hear any and all comments and feed back on Raela, especially if I can improve her a bit more. I\\'d love to hear back on her back story, and I\\'d really like to hear from those of you who would like custom characters made for your enjoyment in Skyrim. If you like her, please rate me, endorse me and toss in some comments! <3\r\n\r\nThanks again to all and I hope you enjoy Raela!",
  "categoryId": "43",
  "version": "",
  "author": "Me",
  "createdUnix": "1327871233",
  "updatedUnix": "1327871393",
  "containsAdultContent": false,
  "uploadedBy": "Tidewalker117",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24082",
      "name": "Raela Save Game",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1061",
      "fileName": "Raela Save Game-7336-1.rar",
      "uploadedUnix": "1327871393",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e889f9772b10892234c2bd1fd13345b4423ec425d5d0288c5524aa08ed73fbd5/analysis/1406644143/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Raela%20Save%20Game-7336-1.rar?fid=24082&ttl=1535765314&ri=8192&rs=8192&setec=98d416c9aa963f05dda4d960bab39f1a"
    }
  ]
}