{
  "modId": 73406.0,
  "modName": "Fluffy Khajiit Tail",
  "summary": "Tail model replacer for male and female khajiit tails, adds a &#34;fluffy&#34; looking tail.",
  "descriptionHtml": "[color=#e69138][b][size=4]Description:[/size][/b][/color]\r<br /> \r<br />This is a simple replacer for the default khajiit tail model. It adds a &#34;fluffy&#34; khajiit tail to both male and female khajiit.\r<br />[list]\r<br />[*]The included texture is intended for the vanilla texture sets\r<br />[*]This will conflict with other mods that replace or modify the default khajiit tail models (.nif files)\r<br />[/list] \r<br />If you create more textures, you can send them to me if you&#39;d like and I&#39;ll start to create a real fomod thing.\r<br /> \r<br />\r<br />\r<br />[color=#e69138][size=4]Installation:[/size][/color]\r<br /> \r<br />The method of packing is rudimentary, no fomod or anything. It does have \r<br />the right structure for Mod Organize, NMM, and the like, to correctly \r<br />install from the .7z compressed file.\r<br /> \r<br />In the texture folder ( ./Data/textures/actors/character/khajiitmale or khajiitfemale )\r<br /> there are two other diffuse styles. Dark9 is a less uniform look, Dark4\r<br /> was an early attempt that looks more scraggly. Just rename them to \r<br />match the flufftail dds file to try them.\r<br /> \r<br />If you&#39;d like to only have the player affected, this can probably be changed to be an \r<br />equippable item, or something like Player Exclusive Armor could be used:\r<br /> [url=http://www.nexusmods.com/skyrim/mods/16815/?]http://www.nexusmods...im/mods/16815/?[/url]\r<br /> \r<br />\r<br />[color=#e69138][size=4]Detail:[/size][/color]\r<br />\r<br />[list]\r<br />[*]Replaces the mailtailkhajiit.nif and femaletailkhajiit.nif with new versions\r<br />[*]Creates a new texture set to use with the new .nif models.\r<br />[*]There are a few non-standard things done with this, like combining model-space and tangent space normal maps. Report problems, I suppose\r<br />[*]The darkened area near the base is a compromise with lighting. It seems that, since it is &#34;facing up,&#34; lights reflect from it in odd ways from \r<br />the rest of the body and tail. The dark color reduces the effect while not giving it a clearly different sheen.[/list] \r<br />\r<br />[color=#e69138][size=4]Attributions:[/size][/color]\r<br /> \r<br />This uses a few resources from &#34;Slof&#34;, created for oblivion originally. It \r<br />looks like they created the fluff texture/alpha, fluff normal, and fluff\r<br /> specular maps and used the fluff mesh idea from another mod from Nexus (\r<br /> [url=http://www.nexusmods.com/oblivion/mods/17088/%C2%A0]http://www.nexusmods...on/mods/17088/[/url] -- I think). I adjusted the mesh and model setup for skyrim (not entirely \r<br />straight forward :3 ) , created new diffuse texture, and combined the \r<br />things to work as a mod.\r<br />For my own parts, I don&#39;t care about distribution or if I&#39;m credited at all  and, indeed, please don&#39;t bother me about it. Just creates bureaucracy in something that&#39;s supposed to be fun.. Go ahead and edit / repost. ",
  "categoryId": "29",
  "version": "1.0",
  "author": "Finius",
  "createdUnix": "1455159026",
  "updatedUnix": "1455159026",
  "containsAdultContent": false,
  "uploadedBy": "Finius",
  "primaryFile": null,
  "files": []
}