{
  "modId": 73430.0,
  "modName": "Left Hand Crossing",
  "summary": "A transplant and recreation of Left Hand Mine and its residents&#33; ",
  "descriptionHtml": "[center][color=#efefef][u][b][font=Times New Roman][size=6]Left Hand Crossing[/size][/font][/b][/u][/color]\r<br />A re-imagining of Markarth&#39;s off-to-the-side iron mine.\r<br />\r<br />[font=Comic Sans MS][color=#ffff00]I would really like a new town that has interesting, talkative NPC&#39;s.[/color][/font]\r<br />You got it&#33;\r<br />[font=Comic Sans MS][color=#ffff00]\r<br />I really want to live in the Reach, but Markarth is filled with hateful people, murderers, cannibals and forsworn.[/color][/font]\r<br />Got ya covered&#33; \r<br />[font=Comic Sans MS][color=#ffff00]\r<br />[/color][/font][font=Comic Sans MS][color=#ffff00]My dragonborn would love a castle, but nothing that looks out of place.[/color][/font]\r<br />You&#39;ve come to the right place&#33;\r<br />\r<br />This is more of a proof-of-concept mod that may need extensive revisions. But, so far, it seems to be quite the success on my end&#33; I was sad that so many people in the Reach had to resort to living in cold Dwemer ruins. The people of Left Hand Mine in particular, with one of them the actual owner of the mine, lived in neat but tiny stone farmhouses.\r<br />\r<br />I have transplanted the entire mining hamlet further south, [color=#cc4125]across the river from Reachcliff Cave Secret Entrance[color=#f4f4f4], with fortified buildings. The new town, Left Hand Crossing, now serves the Reach as a waypoint between the Reach, Hammerfell and Orsinium (including the Orc stronghold just up the gorge from the town)&#33; The accompanying miners quest from Kolskegger works just fine, but if all the npc&#39;s don&#39;t gather outside the town right away for the accompanying scene, just wait an hour. The Miner&#39;s barracks has been set to unowned, so the miners may finally talk to you without a hassle once the forsworn-hunt is over. The former location of Left Hand Mine is now the site of a new small Dwemer ruin, where you may find the deed and key to the new player home&#33; Red Diamond Keep is set up for family or followers, and designed to be similar to a Scotland-style Highland castle.\r<br />\r<br />Everything is fully navmeshed, but if there are any extraordinary issues, let me know. Again, this is more of an experiment for me working with NPC&#39;s, locations and new architectural designs. \r<br />[color=#cccccc](Incompatible with Silverstead)[/color]\r<br />\r<br />[color=#ff0000]Requirements:[/color]\r<br />-Dawnguard\r<br />-Hearthfire\r<br />\r<br />Thank you so much for downloading my work, and thank you CoolJSaS for the new screenshots&#33;[/color][/color][/center]",
  "categoryId": "53",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1455262214",
  "updatedUnix": "1455262169",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000195231",
      "name": "Left Hand Crossing",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "256",
      "fileName": "Left Hand Crossing-73430-1-0.zip",
      "uploadedUnix": "1455262169",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/937ed3048e5c9aaf46801158b7c06a1b8601454e2abcf405df672fc5ec9adf37/analysis/1455262205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Left%20Hand%20Crossing-73430-1-0.zip?fid=1000195231&ttl=1535862110&ri=8192&rs=8192&setec=694fa212d703af0202f19424209bec5f"
    }
  ]
}