{
  "modId": 73480.0,
  "modName": "BETTER Better Skooma",
  "summary": "A remake of my &#34;Better Skooma&#34; mod from the Steam Workshop, with a few small improvements",
  "descriptionHtml": "Some time ago, I made a little mod for the Steam Workshop called &#34;Better Skooma.&#34; Despite being thrown together in 10 mins and being barely functional, a couple people apparently liked it and it got almost 200 downloads and around 25 favs. Some guy asked me to put it on the Nexus, so I put it on the Nexus and added a couple things to it (now that I kinda know my way around the Creation Kit).\r<br />\r<br />This mod makes a couple changes to Skooma. It was always played up in the game as some terrible drug that would do terrible things to your body, and you were a terrible person if you used this terrible drug. Then you got a hold of some, and it wasn&#39;t terribly different from a normal stamina potion. Now, the effects are a bit more... dramatic.\r<br />\r<br />You&#39;ll be seeing things, man.\r<br />\r<br />(I know it just says &#34;slows time for 60 seconds&#34;, but trust me, it does way more than just that. I would recommend using it in a place with a lot of items lying around)\r<br />\r<br />You can also make your own Skooma at cooking pots, if you have the Physician perk, using nightshade and moon sugar. Skooma also now has a dramatically increased value of 2000 gold, so you can cook a lot of Skooma, then become a drug dealer and sell it for quite the profit. This new value is much lower than with the first version of Better Skooma found on the Workshop, but if I had left it at 140,000+, this mod would be even more game-breaking.\r<br />\r<br />Link to the barebones Workshop version: http://steamcommunity.com/sharedfiles/filedetails/?id=227748584",
  "categoryId": "94",
  "version": "1.0.0",
  "author": "Toxikyle",
  "createdUnix": "1455391666",
  "updatedUnix": "1455389217",
  "containsAdultContent": false,
  "uploadedBy": "Toxikyle",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000195427",
      "name": "Bb-Skooma",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Bb-Skooma-73480-1-0-0.zip",
      "uploadedUnix": "1455389217",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b1e9fa9c5ea1321bff2ad8ea1be547f94cc39a06475bf843a741584f0e40af5/analysis/1455389226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bb-Skooma-73480-1-0-0.zip?fid=1000195427&ttl=1535862161&ri=8192&rs=8192&setec=9d4406736c4354845c6df667db6e0287"
    }
  ]
}