{
  "modId": 73538.0,
  "modName": "Ars Metallica - Smithing Enhancement  -Spanish Translation",
  "summary": "Spanish Translation from Ars Metallica - Smithing Enhancement by Arthmoor",
  "descriptionHtml": "[img]http://staticdelivery.nexusmods.com/images/110/15770119-1455534919.jpg[/img]\r<br />\r<br />[size=5]SABRINA DArKCLOuD te ofrece:[/size]\r<br />\r<br />[size=5][img]http://www.iguanadons.net/modbanners/ars-metallica-logo.jpg[/img][/size]\r<br />[color=#ff0000][size=2]by Arthmoor[/size][/color]\r<br />\r<br />[color=#ff7700]LEGENDARY EDITION[/color]\r<br />\r<br />[size=6]SPANISH TRANSLATION[/size]\r<br />\r<br />[size=2]El sistema de artesanía es una de las mejores características de Skyrim, pero para los ladrones y arqueros, no hay mucho uso para el sistema. La armadura ligera es súper fácil de encontrar en las formas ya terminadas, pero las flechas a veces pueden ser escasas igual que Ganzúas  y otros, sin embargo, son relativamente fáciles de construir.\r<br />[/size][size=2]\r<br />[/size][size=2]Ars Metallica pretende llenar algunas de las cuestiones básicas  con el sistema de artesanía de la siguiente manera:[/size][size=2]\r<br />[/size][size=2]\r<br />Para vainilla Skyrim:[/size][size=2]\r<br />[/size][size=2]* Permitir a los arqueros forjar sus propias flechas de los diversos materiales de mineral, madera, tiras de cuero y plumas. Indirectamente lo que es algo útil para cortar leña también.\r<br />[/size][size=2]* Permitir a los ladrones crear sus propias ganzúas de hierro o acero.\r<br />[/size][size=2]* Avance de habilidad para el uso de la fundición . Después de todo, eso es tan importante como saber cómo dar forma a una vez refinado.\r<br />[/size][size=2]* Proporcionar avance habilidad para la utilización del soporte para pieles para hacer de cuero. Eso es mucho más importante  el uso de la piel para hacer las cosas de la habilidad.\r<br />[/size][size=2]* Se necesita una pequeña cantidad de avance de habilidad de la extracción del mineral en sí de las venas de mineral.\r<br />[/size][size=2]* Proporcionar la capacidad para fundir piezas existentes de la armadura y algunos artículos de chatarra en lingotes de modo que puedes entonces utilizar esos lingotes para hacer piezas.\r<br />[/size][size=2]* Permitir a los miembros de las facciones  forjar un equipo apropiado para su gremio. Los ladrones pueden hacer la armadura del gremio. Asesinos pueden hacer  la armadura de la Hermandad. Legionarios pueden hacer armadura Imperial, y así sucesivamente.[/size][size=2]\r<br />[/size][size=2]\r<br />Para Dawnguard:[/size][size=2]\r<br />[/size][size=2]* Modifica recetas de las flechas de Dragón y las recetas de ballesta para ajustarse a las mismas fórmulas como en el juego &#39;vanilla&#39;. recetas nativas de  Dawnguard.[/size][size=2]\r<br />[/size][size=2]\r<br />Para Hearthfire:[/size][size=2]\r<br />[/size][size=2]* Proporciona experiencia de forja para el uso de los diversos bancos de trabajo utilizados para construir casas. La mesa de dibujo no cuenta .[/size][size=2]\r<br />[/size][size=2]Para DragonBorn:[/size][size=2]\r<br />[/size][size=2]* Modifica las recetas de flecha stalhrim y nórdicos para ajustarse a las mismas fórmulas que las flechas de vainilla.\r<br />[/size][size=2]* Agrega fórmulas de fundición para recuperar el mineral de equipos tallada stalhrim y nórdico.\r<br />[/size][size=2]* Agrega la elaboración de plumas al faisán.\r<br />\r<br />\r<br />[/size][color=#1e84cc][size=6]\r<br />[url=http://www.nexusmods.com/skyrim/mods/16084/?]Ars Metallica - Smithing Enhancement[/url] by Arthmoor[/size][/color]\r<br />\r<br />\r<br />[size=5][b]NOTAS PERSONALES:\r<br />\r<br />[/b][/size]Os traigo este fantástico mod que mejora todo el sistema de Herrería.\r<br />Me gustan las cosas sencillas y efectivas y este mod ofrece estas dos cosas sin muchas complicaciones.\r<br />\r<br />[b][u][color=#ff0000]NO requiere skse ni skyui.[/color][/u][/b]\r<br />\r<br />Te permite craftear cosas que antes no se podía, como todo tipo de flechas,ganzúas,antorchas y algunas armaduras. Además te permite fabricar todas las Armaduras y objetos de faccion (guild) Una vez hayas ingresado en el gremio o hayas cumplido alguna misión para ellos. \r<br />Permite fundir objetos para obtener lingotes (armaduras,armas,piezas dwemer...)\r<br />Ahora ganarás experiencia usando el horno de fundición o el soporte para curtir pieles (perfectamente lógico)\r<br />\r<br />No contiene scripts ni menús complicados\r<br />\r<br />He incluido todo lo necesario para hacer funcionar el mod\r<br />\r<br />[b][color=#ff0000][size=3]Requiere La última versión de Skyrim y los DLC[/size][/color][/b]\r<br />\r<br />No olvideis agradecer al autor del mod Arthmoor y &#39;endorsar&#39; su mod\r<br />\r<br />*Yo no formo parte del equipo de creación del mod y me limito simplemente a traducir y ofreceros el mod para que lo disfruteis en español.\r<br />\r<br />[size=4][b][u]INCLUYO EL ARCHIVO README Original del autor para darle el crédito que merece\r<br />\r<br />[/u][/b][/size]Gracias a arthmoor por este fantástico Mod.\r<br />\r<br />Un saludo a todos y todas&#33;&#33;&#33;\r<br />\r<br />Sabrina (Gualay)",
  "categoryId": "24",
  "version": "1.2.3",
  "author": "Sabrina DarkCloud La bruja del Norte",
  "createdUnix": "1455539431",
  "updatedUnix": "1455538188",
  "containsAdultContent": false,
  "uploadedBy": "gualay",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000195691",
      "name": "Ars Metallica - Legendary Edition -Spanish Translation",
      "version": "1.2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "77",
      "fileName": "Ars Metallica - Legendary Edition -Spanish Translation-73538-1-2-3.zip",
      "uploadedUnix": "1455538188",
      "modVersion": "1.2.3",
      "virusScanUrl": "https://www.virustotal.com/file/106e6e9bc432e8caa8256035b83430f7327693302438694a6240b345f705bc00/analysis/1455538204/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ars%20Metallica%20-%20Legendary%20Edition%20-Spanish%20Translation-73538-1-2-3.zip?fid=1000195691&ttl=1535862220&ri=8192&rs=8192&setec=ec4b177a283a8a4c6a725cf2ac818762"
    }
  ]
}