{
  "modId": 73548.0,
  "modName": "Follower Rewritten - an overhaul for vanilla characters&#39; stories and dialogues - Demo",
  "summary": "Demo of an overhaul for vanilla followers&#39; stories and dialogues. Currently, there&#39;s only a small portion of Onmund&#39;s story in the demo.",
  "descriptionHtml": "[b]There&#39;re currently about 1500 lines in the true mod, and the estimated total number of lines [b]by the time Onmund&#39;s story is done [/b]would be 2500-3000. If more characters are to be rewritten, it will be several times more, provided that I have the time.\r<br />\r<br />Progress:[/b]\r<br /> \r<br /> \r<br />[b]Onmund[/b]\r<br /> \r<br />[b]-Doing/Finished[/b]\r<br />[b]Main story plot 100%[/b]\r<br />[b]Onmund&#39;s Main Story dialogues 50%[/b]\r<br />[b]College quests comments 100%[/b]\r<br />[b]Civil War comments 100%[/b]\r<br />[b]Main quests comments 100%[/b]\r<br />[b]World interaction 75%[/b]\r<br />[b]World Encounter comments 25%[/b]\r<br />[b]Romance 20%[/b]\r<br />[b]Facelift for Onmund and some NPCs 70%[/b]\r<br />[b]Companions quests comments 100%[/b]\r<br />[b]Thieves Guild quests comments 100%[/b]\r<br />[b]Dark Brotherhood quests comments 65%[/b]\r<br /> \r<br />[b]-Not yet started, will do[/b]\r<br />[b]City Quests comments[/b]\r<br />[b]Zone creation[/b]\r<br />[b]DLC support, including comments, new scenes and Hearthfires functions[/b]\r<br /> \r<br />[b]-In plan[/b]\r<br />[b]Compatibility with Vilja and Sofia[/b]\r<br /> \r<br />[b]-Not in plan[/b]\r<br />[b]Misc quests comments (Letter delivery, fetch random things. f*** these kinds of quests. I won&#39;t do anything about them in this mod at all.)[/b]\r<br /> \r<br /> \r<br /> \r<br />[i][b]Originally, I only planned to make the romance part of Onmund and add some backstory, and some dirty things, nothing more than Amorous Adventures - I never imagined that I&#39;d be actually attempting something Vilja-sized (besides the AI and functions). I&#39;m still surprised by myself, frankly.[/b][/i]\r<br /> \r<br /> \r<br />[i][b]With the new aim, more challenges will come through, and I believe I will be needing much assistance. I&#39;m going to try to contact Emma and John, I hope that they too want to make the mods work together. I sincerely hope that Onmund will become another legend among the Dragonborn&#39;s followers. More and more ideas come out every time I open the esp, dozens and dozens of new sweet and harsh dialogues spoken by the player and Onmund appear in my brain each time I take bath. The amount of work is massive, and I won&#39;t release the mod until it&#39;s finished and perfect - at least for the Onmund part.[/b][/i]\r<br /> \r<br /> \r<br />[b]Demo is on.[/b]\r<br /> \r<br /> \r<br />[b]STTP:[/b]\r<br /> \r<br />[b]I&#39;m making a male romance/friendship mod. I write the stories and make the dialogues in CK, but I need voice actor(s) and voice actress(es), and possibly more people who know CK and script.[/b]\r<br /> \r<br /> \r<br />Brief introduction:\r<br /> \r<br />I am looking for people who know CK and scripts to make a follower romance mod, that adds in-depth romance and friendship for VANILLA followers. At first, I only knew a few about CK, the best I could do was doing facelifting; but thanks to WraithSlayer&#39;s guidance, I know how to make the dialogues and very basic scripts. My major talent is composing stories and doing writing stuff.\r<br /> \r<br />This mod will add new locations as well, and might involve complex scripts in the middle and after. If no one offered help in these parts, I would have to learn making new regions, but complex scripts might take me very much time to learn, which I might just cancel the parts that involve certain degree of complexity; so, your help is needed to make the mod more awesome, and to speed up the development.\r<br /> \r<br />In the mod, the player will get to truly romance some MALE followers (and some non-followers made followers). I don&#39;t plan to make female ones, at least for now, as Amorous Adventures had already added plenty of qualified female romances, such as Serana and Elisif.\r<br /> \r<br />[b]The mod is temporarily named Interesting Vanilla NPCs.[/b]\r<br /> \r<br />[b]We&#39;ll do Onmund first. If the Onmund romance is successful, then we&#39;ll proceed to other people, possibly Brynjolf or Marcurio.[/b]\r<br /> \r<br /> \r<br />[b]Features of the final product:[/b]\r<br />[b]- Enriched vanilla NPC personality and background story\r<br />- Realistic romance with vanilla NPC\r<br />- Player&#39;s decisions and words have impacts to your relationship with the NPC and the whole story\r<br />- Flirting, kissing, and sex[/b]\r<br /> \r<br /> \r<br />Why do I want to make this mod:\r<br /> \r<br />I know three mods that introduce male romance: Skyrim Romance Mod (SRM), Amorous Adventures, and Interesting NPCs.\r<br /> \r<br />In SRM, the PC is unnaturally attractive. Every man added by this mod has irresistible desire to bang the PC, and most of them are similar in a lot of ways. They also speak unnaturally sweet, and I&#39;m embarrassed whenever a man of SRM speaks to me. Only a teenage girl who fancy love stories like Twilight would find SRM exactly what she needs. The romance of SRM lacks depth as well.\r<br />(This is based on 1.0 of SRM. Hadn&#39;t got the time to try 2.0 yet)\r<br /> \r<br />Amorous Adventures adds 3 male romances: Vilkas, Farkas and Ralof. The &#34;romance&#34; of Ralof is not a romance at all, and that of Vilkas and Farkas lack depth; also, all three romances haven&#39;t even a single interesting point. In short, they&#39;re lame. But in fact, the author confessed that (s)he doesn&#39;t find making male romances easy or interesting, and won&#39;t do male romance in future; so we shouldn&#39;t demand too much in Amorous Adventures&#39; male romances, as the author didn&#39;t intend to make them in the first place.\r<br /> \r<br />As for Interesting NPCs, romance is neither a main part or an important feature, so it shouldn&#39;t be enlisted at all.\r<br /> \r<br />Meanwhile, I also noticed that the romances in SRM and AA didn&#39;t provide much choices for players to pick during the romances. All of the storylines are set and the players just need to follow. To make it sound clearer- you do realize that there&#39;s only one dialogue option for you to pick each time you&#39;re going to speak in SRM and AA, don&#39;t you?\r<br /> \r<br />Basically, I have few romance choices when I&#39;m roleplaying as a straight female, but to romance my badass Familiar Face character - in my brain only; and when I say romancing him, it&#39;s just imagining that we speak something about the last battle and then we feel quite horny and get laid. That&#39;s lame.\r<br /> \r<br />Therefore, I wish to add some solid male romance options, which are not overly-sweet, Twilight-ish or lame. I want to make male romances that are natural and realistic, interesting and not lackluster, and most importantly- they should have depth for players to think about and consider.\r<br />\r<br />And personally, as a game-lover and a high school student, I&#39;d love to gain experience of writing actual scripts and stories, so that I&#39;d be more likely to be able to apply to a writing job in a game firm.\r<br /> \r<br /> \r<br />[b]Whom I&#39;m looking for, desperately:[/b]\r<br /> \r<br />[b]A CK worker who knows how to script[/b]\r<br />[b]A CK worker who knows how to make new places[/b]\r<br />[b]Voice Actor(s)[/b]\r<br />[b]Voice Actress(es)[/b]\r<br /> \r<br /> \r<br />[b]Whom I&#39;m looking for, but not in urgent:[/b]\r<br /> \r<br />[b]Writer(s).[/b]\r<br />[b]Modeler(s).[/b]\r<br /> \r<br /> \r<br />What I&#39;ll do:\r<br /> \r<br />Writing stuff, NPC making (eg. Onmund&#39;s family), making dialogues and quests in CK, voice acting (better not, unless no one is offering to voice act).\r<br /> \r<br /> \r<br />If you&#39;re interested in helping, inbox me or leave a reply, and I&#39;ll inbox you.\r<br /> \r<br /> \r<br /> \r<br />[b]Demo:[/b]\r<br /> \r<br />[b]This is the very first part of the Onmund romance/friendship storyline. In the demo, you will know the basic concepts of the mod, but it&#39;s not everything we&#39;ll be doing (say, quests that require &#34;doing and killing something&#34;).[/b]\r<br /> \r<br />[b]Please also note that this mod is NOT to be used in a serious save (playthrough). Its purposes are to show players what this mod&#39;s concepts are, and to attract voice actors/actresses to help in this project. The content in the demo might change in the future, so what you see in the demo might not be the &#34;real&#34; story.[/b]\r<br /> \r<br />[b]This is an unfinished mod, and is supposed to be used in a separate test save. We hold no responsibility for breaking anyone&#39;s playthrough. Be sure to uninstall it after you finish the demo.[/b]\r<br /> \r<br />[b]And to clarify, there&#39;s NO sex and romance in the demo, just friendship. You&#39;ll become intimate with Onmund in the middle of the story.[/b]\r<br /> \r<br />[b]Lastly, all the dialogues are currently unvoiced, so it&#39;s strongly advised to use Fuz Ro D-oh while playing the demo. We&#39;re still looking for voice actors and actresses.[/b]\r<br /> \r<br /> \r<br />Credits:\r<br />Anbeegod for mod idea, story and dialogue writing, CK working\r<br />WraithSlayer for scripting,[b] teaching me to use CK (this is very important, without that, this mod won&#39;t even exist)[/b]",
  "categoryId": "33",
  "version": "demo",
  "author": "Anbeegod",
  "createdUnix": "1455554688",
  "updatedUnix": "1455554684",
  "containsAdultContent": false,
  "uploadedBy": "anbeegod",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000195729",
      "name": "Follower Rewritten",
      "version": "demo",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "152",
      "fileName": "Follower Rewritten-73548-demo.rar",
      "uploadedUnix": "1455554684",
      "modVersion": "demo",
      "virusScanUrl": "https://www.virustotal.com/file/5a9762bab597faa427ea4f9583d19a5fce7e358204d276e7ff3b415fa144ccc3/analysis/1455554706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Rewritten-73548-demo.rar?fid=1000195729&ttl=1535862238&ri=8192&rs=8192&setec=ca7891b63d9c6d22543a8eeda9344fa5"
    }
  ]
}