{
  "modId": 73563.0,
  "modName": "Ymir",
  "summary": "This is my save game Ymir All DLC except HeartFire ",
  "descriptionHtml": "[size=5] This is a Clean Saved Game [/size]\r<br />[size=4] Ideal for a new start - No console commands used - No Mods used[/size]\r<br />[i][b] \r<br />[/b] Backstory [/i](Just for fun)\r<br />\r<br />Ymir is a Male Nord who grew up in Cyrodiil, during the Oblivion crisis many refugees tried to take shelter in the confines of the Ayleid Ruins in an attempt to save their son from an unknown disease they asked for the help of a mysterious wizard who also took shelter within the ruins, in exchange of their time they asked for their beloved son to be saved. The wizard warned that the magic he would cast will change the destiny of this child either for good or the opposite but a parent&#39;s love knows no bound that they are willing to cut their own time line just to save their beloved son. In awe and in pity the wizard started the ritual within its confine he unfold a &#34;scroll&#34; in which he rewrites history. The earth trembled and in this swirling light and darkness they were consumed, from it appeared an embodiment of something they cannot understand, The wizard chanted in an ancient language saying &#34;In light of the morning dew, delves the warmth of destiny. And into toil the darkness that keeps peace, knowingly&#34; a catalyst was needed it seems that time wasn&#39;t enough and so the parents smiled as they offered their whole crumbling to dust.\r<br />\r<br />Even the wizard cannot contain the power of the scroll and in fear that he was blinded but as he heard the cries of a child his hope still rekindled. &#34;You shall walk among the gods as Heroes of old who lived for their purpose, fear not let me show you how to conquer your fate.&#34; In this long time the wizard taught the child everything he knew and as he was already reaching his end he told the child everything that transpired. As he breath his last &#34;Go, your Journey has begun.&#34; \r<br />\r<br />Ymir traveled far until he reach the borders of Cyrodiil and in this event that he would come to the continent of Skyrim.   \r<br />         ",
  "categoryId": "43",
  "version": "",
  "author": "masatoishikawa90",
  "createdUnix": "1455597710",
  "updatedUnix": "1455597706",
  "containsAdultContent": false,
  "uploadedBy": "masatoishikawa90",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000195801",
      "name": "Ymir",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1489",
      "fileName": "Ymir-73563-.zip",
      "uploadedUnix": "1455597706",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e4175d8b0e2b7757d3e3b35e855f3125d8cd806a513d203d168494026ba9d6dd/analysis/1455597732/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ymir-73563-.zip?fid=1000195801&ttl=1535862252&ri=8192&rs=8192&setec=ca48bff644cc6ea77d2c726f9fb4ecc4"
    }
  ]
}