{
  "modId": 73707.0,
  "modName": "New Companions Diamond",
  "summary": "This replace the companions vanilla for the ones i made.",
  "descriptionHtml": "First of all, English is not my native language, but i will try to do my best here. If you have any question, please post in english or in Brazilian Portuguese\r<br />\r<br />Let&#39;s go, this is not really a &#34;mod&#34; is just the vanilla npcs with a change of equipments, stats and hair. I used the Skyrim Npc Editor and its my first &#34;mod&#34; and post here.\r<br />\r<br />Only download this if you have the Apachii Sky Hair (the full version, Male version and female version), not sure if the wigs are necessary, but the npcs will have a bald head when using a helmet, so i think its best have that too. I think it will looks better if you use de CBBE face.\r<br />\r<br />I didnt changed Vignar Graymane, Skjor and Kodlok Whitemane because... well, i think its not really necessary and Vignar... because of the Stormcloak Whiterun.\r<br />\r<br />Changes: All the companions now can up to level 90, they are essencials too (needs to test yet)\r<br />\r<br />Aela The huntress: Okay, i must say that her vanilla armor was really sexy, but i changed for some reasons. 1 - I hate that the companions dont wear the Wolf armor. 2 - In some way... her armor is &#34;rare&#34;, right now i cant remember another NPC that uses the Ancient Nord Armor. Her hair is now longer, her eyes have another color and the warpaint is changed. I edit her face, i think she got a little pretty.\r<br />\r<br />Farkas: Something that bothered me a lot is that the silver hands says &#34;If he wear that armor, he dies.&#34; and Farkas is using the Steel armor... The silver hands hate steel? Anyway, now farkas have the wolf armor, i removed the dirty and changed is beard.\r<br />\r<br />Vilkas: This one i didnt changed much, only the status, hair and removed the dirty too.\r<br />\r<br />Njaada Stonearms: Must i say that i hate this girl? Anyway, now she wears the wolf armor, have a warpaint blue-purple, her hair is changed too and i blinded her. Yep, now she wont see my arround... nah, i though it looked cooler, and in some way, now she is cute.\r<br />\r<br />Athis: A dark elf companion... well, i changed the armor, his hair is a lot longer, his eyes are a little diferent and i got him a magelike beard. Also, his warpaint is red now.\r<br />\r<br />Torvar: Ah, i wanted this guy like the nord i like. Blond, Drunk, Uses heavy armor and heavy weapons, with a long hair and beard.\r<br />\r<br />Ria: Okay, this one is a lot diferent. Now she is more pale, have a long hair and blond ( I though that it would be cool to have a blond female) Her makeup is dark as her lipstick, she have a diferent imperial warpaint. She uses now the wolf armor.\r<br />\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />If you didnt liked someone in there, or only want one, thats fine. They are in the same zip but they are separated .bsa and .esm so if you only want Njaada, only instal her.\r<br />\r<br />[center][size=5]How to Install\r<br />\r<br />[/size][/center]Extract the zip and copy both files for the npc that you want and put inside the Data. Sometimes the mod will take sometime to load, so quit and load can help or simple take a time walking in someplace far.\r<br />\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Feel free to edit then or use in another mod, i only ask that you have fun ;)",
  "categoryId": "33",
  "version": "1.0",
  "author": "Diamond96",
  "createdUnix": "1456066359",
  "updatedUnix": "1456066359",
  "containsAdultContent": false,
  "uploadedBy": "Diamond96",
  "primaryFile": null,
  "files": []
}