{
  "modId": 73717.0,
  "modName": "Soljund&#39;s Sinkhole",
  "summary": "A simple village expansion for Soljund&#39;s Sinkhole.",
  "descriptionHtml": "[center][img]https://www.iguanadons.net/modbanners/soljunds-sinkhole-logo.jpg[/img][/center]\r<br />\r<br />A simple village expansion for Soljund&#39;s Sinkhole.\r<br />\r<br />Soljund&#39;s Sinkhole is another one of those places where it just seemed odd that more was not done. A mining operation that by all accounts would be thriving were it not for a draugr problem. An area that 3 people are effectively living in, with only two actually being housed, and one of whom is a marriage prospect for the player&#33; Such cramped conditions cannot stand, and so this small expansion has been done to relieve the crowding problem.\r<br />\r<br />* Guard barracks for the guards to live in, with one extra patroller added due to the dangerous area. The jail is just for show, sorry :P\r<br />* Perth can now share his house with you if you marry him.\r<br />* All added houses are radiant quest enabled, so you may get Companions missions and anything else that&#39;s properly configured to use NPC homes for quests.\r<br />* LOD has been generated for the area.\r<br />\r<br />[center][url=https://www.patreon.com/arthmoor]My Patreon Page[/url][/center]\r<br />\r<br />[u][b]Installation Requirements[/b][/u]\r<br />\r<br />Official Skyrim patch 1.9.32.0.8 or greater.\r<br />\r<br />[color=red]DO NOT extract the contents of the BSA file into your Data folder as loose files, or let your mod manager peform an equivalent function on the contents of the file. Doing so will cause things to load in the wrong order and break the game. Skyrim is intended to load a BSA alongside it&#39;s ESM/ESP file. Circumventing this causes issues which I will not provide support for. If you insist on going against this advice, you will receive no support for the problems you generate as a result of this.[/color]\r<br />\r<br />[u][b]Installation - Wrye Bash BAIN[/b][/u]\r<br />\r<br />Drop the archive into your Skyrim Mods&#92;Bash Installers folder, then install as usual.\r<br />Make sure the mod is active in the Wrye Bash mods tab.\r<br />\r<br />[u][b]Installation - Steam Workshop[/b][/u]\r<br />\r<br />Subscribe to the mod via the Workshop page, then use the Skyrim launcher to allow it to download and install.\r<br />Make sure it&#39;s active in the Data Files menu.\r<br />\r<br />[u][b]Installation - Nexus Mod Manager[/b][/u]\r<br />\r<br />Use the &#34;Download with Manager&#34; button on the  page at Skyrim Nexus. The installer should take care of things from there.\r<br />Then simply make sure NMM has the mod activated.\r<br />\r<br />[u][b]Installation - Manual[/b][/u]\r<br />\r<br />Drop the Soljund&#39;s Sinkhole.esp and Soljund&#39;s Sinkhole.bsa files into your Data folder.\r<br />Activate the mod using whatever management tool suits you.\r<br />\r<br />[u][b]Uninstalling[/b][/u]\r<br />\r<br />Due to the nature of Skyrim mods, especially those adding scripts, it is strongly discouraged to attempt uninstalling a mod from your active game. Any mod that is more than pure mesh or texture replacements has the possibility to leave behind permanent changes to your save that you may not want. This is not something modders can correct for. It is how the game was designed by Bethesda. No support will be provided for anyone who uninstalls this mod from an active game and continues on with that save.\r<br />\r<br />To remove the mod: Delete the Soljund&#39;s Sinkhole.esp and Soljund&#39;s Sinkhole.bsa from your Data folder. Then reload your game as usual.\r<br />\r<br />[u][b]Load Order[/b][/u]\r<br />\r<br />[url=https://loot.github.io/]LOOT[/url] should be used for optimal placement.\r<br />\r<br />[u][b]Compatibility[/b][/u]\r<br />\r<br />Fully compatible with Bring Out Your Dead.\r<br />\r<br />Will not be compatible with other mods that change the Soljund&#39;s Sinkhole exteriors.\r<br />\r<br />[center][url=http://store.steampowered.com/app/554570]Witanlore: Dreamtime - An RPG of Grizzly Proportions&#33;[/url][/center]\r<br />[center][img]https://www.iguanadons.net/DreamtimeSigBar.jpg[/img][/center]",
  "categoryId": "53",
  "version": "1.0.1",
  "author": "Arthmoor",
  "createdUnix": "1456104131",
  "updatedUnix": "1505848366",
  "containsAdultContent": false,
  "uploadedBy": "Arthmoor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000255202",
      "name": "Soljund's Sinkhole",
      "version": "1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "879",
      "fileName": "Soljund's Sinkhole.7z-73717-1-0-1.7z",
      "uploadedUnix": "1505848366",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/f16db96c766fa625c0beef1030089af00dae17ec61959cd09cfd9691cb0990f9/analysis/1505848385/",
      "changelogHtml": " The map marker was changed to a settlement icon. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Soljund%27s%20Sinkhole.7z-73717-1-0-1.7z?fid=1000255202&ttl=1535862433&ri=8192&rs=8192&setec=d2c664fa2d599f3f6860bac3ebc5bc93"
    }
  ]
}