{
  "modId": 73734.0,
  "modName": "Hearthfire Extended - German-Deutsch",
  "summary": "Die perfekte Erweiterung für das Hearthfire DLC\r<br />\r<br />Dieses Plugin fügt all die fehlenden Features ein, die das offizielle Hearthfire DLC nicht bietet.\r<br />\r<br />Jetzt auch mit Angestellten und Dienern.",
  "descriptionHtml": "[b]\r<br />This is only the GERMAN version of the mod. The original you can find [url=http://www.nexusmods.com/skyrim/mods/66783/?]here[/url]\r<br />[color=#f1c232][size=6]\r<br />Hearthfire Extended - DEUTSCH[/size][/color]\r<br />\r<br />[size=3]Beschreibung:[/size][/b][size=3] Die Modifikation [/size][i]Hearthfire Extended [/i][size=3]erweitert das offizielle Hearthfire DLC um viele neue Funktionen. Außerdem fügt das Plugin haufenweise neue Funktionen hinzu, die natürlich alle &#34;Lore Friendly&#34; sind. Betroffen sind natürlich nicht nur die Häuser von Hearthfire, sondern auch alle anderen Vanilla-Häuser. Die Mod fügt sich hervorragend in die Spielgeschichte von Skyrim ein. Außerdem kann sie jederzeit, auch mitten im Spiel installiert werden.[/size]\r<br />\r<br />[color=#f1c232][size=6]\r<br />Installation\r<br />[/size][/color]\r<br />1. Downloaded die deutsche Version der Mod (Original wird NICHT benötigt)\r<br />2. Kopiert alle Dateien in eueren &#34;Skyrim/Data&#34; Ordner\r<br />3. Aktiviert die Mod in euerem Launcher\r<br />4. Spaß haben\r<br />\r<br />\r<br />[color=#f1c232][size=6]Features[/size][/color]\r<br />\r<br />[size=4][b][u]Einrichtungsgegenstände herstellen[/u][/b][/size]\r<br />[size=3]Im Keller eures Hauses (Erweiterter Keller) befindet sich eine Spezielle Werkbank. Mit der könnt ihr Möbel und Einrichtungsgegenstände herstellen, die dann in euer Inventar verschoben werden. Diese Möbel könnt ihr überall in Himmelsrand platzieren. Um Die Einrichtung zu platzieren müsst ihr den Gegenstand droppen und könnt in dann mit der Taste &#34;R&#34; verschieben. Um einen Gegenstand zu entfernen oder in genau an die richtige Stelle zu bekommen benötigt man eine Mod die dies erlaubt. Der Autor empfielt die Mod [/size][size=3][url=http://www.nexusmods.com/skyrim/mods/52583/]Jaxonz Positioner[/url][i]. [/i]Doch auch damit können einige wenige Objekte nicht verschoben werden. Deshalb wird empfohlen vor dem Platzieren von Möbeln immer zu speichern.[/size]\r<br />\r<br />[size=4][b][u]Erweiterter Keller[/u][/b][/size]\r<br />[size=3]Der erweiterte Keller erlaubt es euch außerdem eine Reihe von weiteren Räumen hinzuzufügen, wie zum Beispiel einen Trainingsraum oder eine Folterkammer.[/size]\r<br />[b][u][size=4]\r<br />Bienenstöcke\r<br />[/size][/u][/b][size=3]Bienenstöcke sind keine Container mehr. Sie können nun immer wieder &#34;ausgebeutet&#34; werden. Außerdem können nun bis zu drei Bienenstöcke anstatt von Einem platziert werden.[/size]\r<br />\r<br />\r<br />[size=4][u][b]Butter Verarbeitung[/b][/u][/size]\r<br />[size=3]Nun kann Milch endlich zu Butter verarbeitet werden.[/size]\r<br />\r<br />[size=4][u][b]Kühe[/b][/u][/size]\r<br />[size=3]Mit diesem Plugin könnt ihr die Kühe melken. Geht zur Kuh hin und drückt auf &#34;Aktivieren&#34; und ihr erhaltet die Milch.[/size]\r<br />\r<br />[size=4][u][b]Brauen\r<br />[/b][/u][/size][size=3]Jetzt könnt ihr in Skyrim endlich selber eueren Met und eueren Wein brauen. Dazu geht ihr im Keller zu einem Braufass und geht in dessen Inventar wo ihr mit verschiedenen Zutaten Getränke herstellen könnt.\r<br />[/size]\r<br />\r<br />[size=4][u][b]Windmühlen[/b][/u][/size]\r<br />[size=3]Alle Hearthfire-Häuser können nun eine Windmühle haben. Der Autor empfielt füt die bessere Optik die Mods [url=http://www.nexusmods.com/skyrim/mods/8655/]SMIM[/url] und [url=http://www.nexusmods.com/skyrim/mods/40564/]SkyMills[/url]. \r<br />[/size]\r<br />[size=4][b][u]Brunnen[/u][/b][/size]\r<br />[size=3]Ihr könnt nun einen Brunnen zu euerem Haus bauen. Die ist allerding noch nur mit dem Haus Seeblick und dem Haus Heljarchen möglich.[/size]\r<br />[size=3](Credits an [/size][url=http://www.nexusmods.com/skyrim/users/6224624][size=3]detpak[/size][/url][size=3] für die Idee)[/size]\r<br />\r<br />[size=4][b][u]Angestellte / Diener[/u][/b][/size]\r<br />[size=3]Sprecht mit eurem Vogt, der euch eine Reihe von neuen Angestellten anheuern kann. Unter anderem eine Frau die euch regelmäßig Sachen von einer Farm bringt.\r<br />[/size]\r<br />[size=4][b][u]Wachen[/u][/b][/size]\r<br />[size=3]Heurt Wachen an um euer Haus zu schützen. Die Wachen werden abwechselnd vor eurem Haus patrullieren und Gegner in die Flucht schlagen.\r<br />[/size][size=2](Wachen NPCs wurden von [url=http://forums.nexusmods.com/index.php?/user/5718878-theobstinatenovicesmith/]TONS[/url] erstellt, Gesichter von [url=http://www.nexusmods.com/skyrim/users/4209270]Visdagon[/url] und die Vampir Idee ist von [url=http://www.nexusmods.com/skyrim/users/4723298]AEscraed[/url])[/size]\r<br />\r<br />[size=4][b][u]Mehr Pflanzen und Zutaten[/u][/b][/size]\r<br />[size=3]Jarinwurzel und andere Zutaten von Dawnguard und Dragonborn sind nun auch in Hearthfire erhältlich.[/size]\r<br />\r<br />[size=4][b][u]Straßen[/u][/b][/size]\r<br />[size=3]Baut eine Straße zu eurem Haus. Die basiert auf der Mod &#34;Lakeview Manor Road&#34; von [url=http://www.nexusmods.com/skyrim/users/1720648]themadpickler[/url]. (Momentan nur mit dem Haus Seeblick möglich)\r<br />\r<br />[size=4][b][u]Ladebildschirme[/u][b][b] - [color=#00ffff]Neu&#33;[/color][/b][/b][/b][/size]\r<br />[size=3]Von den 319 Ladebildschirme aus Skyrim sind nur 4 von Hearthfire. Dieses Plugin fügt noch einige mehr hinzu.[/size][/size]\r<br />\r<br />\r<br />[color=#f1c232][size=6]Credits[/size][/color]\r<br />[size=3]\r<br />Beta Tester - [url=http://www.nexusmods.com/skyrim/users/840127]Kursan[/url], [url=http://www.nexusmods.com/skyrim/users/8050206]fanuilh1[/url], [url=http://www.nexusmods.com/skyrim/users/4306486]Neshotah76[/url], [url=http://www.nexusmods.com/skyrim/users/21018464]Valestris[/url]\r<br />Ideen - [url=http://www.nexusmods.com/skyrim/users/13341870]LemonSquishie[/url], [/size][size=3][url=http://www.nexusmods.com/skyrim/users/6224624]detpak[/url], [/size][size=3][url=http://www.nexusmods.com/skyrim/users/4723298]AEscraed[/url], [url=http://www.nexusmods.com/skyrim/users/15792944]ArannorTreeStrider[/url][/size]\r<br />[size=3]Übersetzung ins Deutsche - [url=http://www.nexusmods.com/games/users/37288395/?]ModdyMC[/url]\r<br />[/size]\r<br />[color=#ffcc33][size=6]Weitere technische Informationen [/size][size=5](leider nur in Englisch)[/size][/color]\r<br />\r<br />[size=3]Cleaned with TES5EDIT. No bad records. No further cleaning required.\r<br />Relevant fixes from USKP forwarded. USKP is however not a requirement.\r<br />(While LOOT recognises that the mod is clean, cleaning with tes5edit actually does remove one record. This record is required for steward dialogue to function correctly, so I don&#39;t recommend you do this.)\r<br />[/size][size=3]This file shares some scripts with my other mod, [url=http://www.nexusmods.com/skyrim/mods/68221/]Complete Fast Travel Overhaul[/url]. Allow them to overwrite each other, the scripts are identical.[/size]\r<br />\r<br />[u][b][size=4]A note on compatibility[/size][/b][/u]\r<br />[size=3]This mod is designed to be lightweight and compatible with anything. This includes other mods that edit Hearthfire. However, because some other Hearthfire mods make huge changes to terrain, navmesh and layout, you may experience some unexpected results. These are not conflicts and will not cause crashes, they are merely cosmetic issues. For example, if another mod changes terrain this may result in new structures from this mod floating in the air.\r<br />The other cells edited by this mod are specifically chosen because other mods rarely edit them, for example farmhouse interiors. The changes made to them are so small that even if another mod does edit the same cell, it is extremely unlikely that there will be an incompatibility.\r<br />If you use any other Hearthfire mods alongside Hearthfire Extended, I&#39;d really appreciate it if you let me know what the situation is. However, please understand that I&#39;m spending a lot of time implementing exciting new features, and I&#39;m not going to waste any time making my mod compatible with other mods that defeat the purpose of what I&#39;m trying to achieve here. If a mod expands Hearthfire by doing everything for you and making massive changes to the world, I wonder why you&#39;re looking here anyway. If a mod expands Hearthfire in a lightweight, player-customisable, clean way as I have, then a patch shouldn&#39;t even be required.\r<br />[i]If a mod admits to breaking Hearthfire&#39;s construction system in its description (usually by saying &#34;install this mod after you have completely built your house and are happy with it&#34;) then it may well break my mod too. And there&#39;s nothing I can do about that.[/i][/size]\r<br />\r<br />[size=4][u][b]Complex Furniture[/b][/u][/size]\r<br />[size=3]Complex furniture can&#39;t be moved by Jaxonz Positioner, so you&#39;ll have to just place it in the right place first time. I recommend saving, placing the item, loading the earlier save and adjusting if necessary, then trying again. The following are considered complex furniture:\r<br /> - Braziers, firepits, fireplaces, candles (anything with fire or light attached)\r<br /> - Cookpot on stand, fireplace cookpot (cookpot without stand and fire spit should be ok)\r<br /> - Trophy bases cannot be moved once a trophy has been built on them\r<br />[/size]\r<br />[size=4][u][b]Extended cellar conflicts[/b][/u][/size]\r<br />[size=3]If you&#39;re planning on running another mod that edits homestead cellars alongside Hearthfire Extended, pick the cellar you want to keep and remove the cellar from the other mod using tes5edit. This is a very simple task, and is fully explained below. If there&#39;s anything here you don&#39;t understand, leave a comment and I can help you out.[/size]\r<br />\r<br />[i]It&#39;s best not to use the console for this. [/i][i]If you already tried to fix this using the console, go back to an earlier save from before you tried to use the console if possible, because it&#39;s likely you&#39;ve broken something by even trying to use the console. As a general rule, the console should not be used to fix mod compatibility issues (beyond disabling references that clip).[/i]\r<br />[size=3]\r<br />If you want to keep Hearthfire Extended&#39;s basement, open the other cellar mod in tes5edit and navigate to:\r<br /> - Cell -&gt; Block 5 -&gt; Sub-Block 0 and right click &#34;BYOHHouse1FalkreathBasement&#34;            (for Lakeview Manor)\r<br /> - Cell -&gt; Block 6 -&gt; Sub-Block 5 and right click &#34;BYOHHouse2HjaalmarchBasement&#34;         (for Windstad Manor)\r<br /> - Cell -&gt; Block 7 -&gt; Sub-Block 5 and right click &#34;BYOHHouse3PaleBasement&#34;                   (for Heljarchen Hall)\r<br />and click &#34;Remove&#34; (NOT remove filter). There will be a scary warning message, select &#34;Yes I&#39;m absolutely sure&#34;.\r<br />\r<br />If you want to keep the other cellar mod&#39;s basement, open hearthfireextended.esp in tes5edit and navigate to:\r<br /> - Cell -&gt; Block 5 -&gt; Sub-Block 0 -&gt; &#34;BYOHHouse1FalkreathBasement&#34;            (for Lakeview Manor)\r<br /> - Cell -&gt; Block 6 -&gt; Sub-Block 5 -&gt; &#34;BYOHHouse2HjaalmarchBasement&#34;         (for Windstad Manor)\r<br /> - Cell -&gt; Block 7 -&gt; Sub-Block 5 -&gt; &#34;BYOHHouse3PaleBasement&#34;                   (for Heljarchen Hall)\r<br />Right click &#34;Persistent&#34; and click &#34;Remove&#34; (NOT remove filter). There will be a scary warning message, select &#34;Yes I&#39;m absolutely sure&#34;.\r<br />Then open &#34;Temporary&#34; and remove all references under it except for:\r<br /> - &#34;BYOHMeadBarrel&#34; (there should be two of these)\r<br /> - &#34;KmodCraftingMeadBarrelSmall&#34; (there should also be two of these)\r<br />These should be the 8-10th references from the top of the list. You can use shift click to select and remove multiple references at once.[/size]\r<br />[i]Keeping these 4 references allows you to keep the new brewing barrels. However, if you don&#39;t mind losing the brewing barrels, or if the cellar mod you intend to use makes layout changes to the cellar in such a way that the brewing barrels would be in the wrong place, you can just remove the entire reference to &#34;BYOHHouse1FalkreathBasement&#34; or equivalent. You can always place new brewing barrels somewhere else by using the furniture crafting system.\r<br />[/i]\r<br />[size=4][u][b]Using apiaries[/b][/u][/size]\r<br />[size=3]The first time you activate an apiary you are given honey. A timer starts.[/size]\r<br />[size=3]Activating an apiary subsequent times gives honeycomb or a bee. The timer does not reset as a result of further activations.[/size]\r<br />[size=3]After 24 hours, the apiary resets and will give honey again when activated.[/size]\r<br />\r<br />[size=4][u][b]Hearthfire Lighting Mods[/b][/u][/size]\r<br />Most lighting overhauls (ELFX, RLO etc) don&#39;t improve Hearthfire at all, so you&#39;ll need a separate mod to make Hearthfire interiors look as nice as the rest of Skyrim. Here&#39;s the two main ones I recommend:\r<br />\r<br />[size=3][url=http://www.nexusmods.com/skyrim/mods/60637/]Improved Hearthfire Lighting[/url][/size]\r<br />This mod adds lights that are linked to furniture sets in the homestead. For example, unless you build the table in the bedroom wing, the room will be dark because the candle sitting on the table is required to light up the room. If you&#39;re going to build a regular Hearthfire home and only use the furniture crafting system to customise some things (or not use it at all), this is what I recommend. It makes the interior look very nice, all of the lights are shadow casting.\r<br />\r<br />[size=3][url=http://www.nexusmods.com/skyrim/mods/29020/]Hearthfire Homes - Interior lighting for ENB[/url][/size]\r<br />Despite the name, you don&#39;t need an ENB for this. It adds generic light to the entire interior. Regardless of what you build and where, your entire homestead will be fully lit up. If you&#39;re intending to design your home using the furniture crafting system, this is a better choice. However it doesn&#39;t look as nice IMO. Because the whole interior is filled with light, there are no shadows.\r<br />\r<br />[u][b][size=4]Other mods I recommend you use alongside Hearthfire Extended\r<br />[/size][/b][/u][url=http://www.nexusmods.com/skyrim/mods/68221/]Complete Fast Travel Overhaul[/url] (Also by me) - Allows you to build a jetty and hire a ferryman. Includes a patch for Hearthfire Extended.\r<br />[url=http://www.nexusmods.com/skyrim/mods/55555]RS Children Overhaul[/url] - Makes children less... generic\r<br />[url=http://www.nexusmods.com/skyrim/mods/60637/]Improved Hearthfire Lighting[/url] - Makes Hearthfire interiors beautiful, something most lighting mods miss\r<br />[url=http://www.nexusmods.com/skyrim/mods/2356/]XCE[/url], [url=http://www.nexusmods.com/skyrim/mods/36510]Superior Lore-Friendly Hair[/url], [url=http://www.nexusmods.com/skyrim/mods/28363]Beards[/url] and [url=http://www.nexusmods.com/skyrim/mods/30411/]Brows[/url] - Improved character textures and meshes featured in screenshots\r<br />[url=http://www.nexusmods.com/skyrim/mods/47327/]Cutting Room Floor[/url] - Adds Bethesda&#39;s cut content. Use it with the patch included in this mod.\r<br />[url=http://www.nexusmods.com/skyrim/mods/32309/]HD Noble Furniture[/url] - Improved textures for the noble furniture set used by Hearthfire\r<br />[url=http://www.nexusmods.com/skyrim/mods/65185]Servants Sort Loot[/url] - Allows Hearthfire Extended servants to sort loot, and adds new servants\r<br />\r<br />[i]If you want to uninstall this mod, make sure to wait at least 24 hours from when you last milked a cow or harvested an apiary. Remove hearthfireextended.esp and all scripts beginning with kmod. Also please leave a comment and let me know what I can do to improve the mod.[/i]",
  "categoryId": "79",
  "version": "1.0.3",
  "author": "Kinaga  -  Translation by ModdyMC",
  "createdUnix": "1456170300",
  "updatedUnix": "1456167107",
  "containsAdultContent": false,
  "uploadedBy": "Kinaga",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000196745",
      "name": "Hearthfire Extended - GERMAN-DEUTSCH",
      "version": "1.0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4623",
      "fileName": "Hearthfire Extended - GERMAN-DEUTSCH-73734-1-0-3.zip",
      "uploadedUnix": "1456167107",
      "modVersion": "1.0.3",
      "virusScanUrl": "https://www.virustotal.com/file/ce58d98deb80267498907a2b0849b9cf5cdeba389e5f24359194643eb52accaa/analysis/1456167151/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hearthfire%20Extended%20-%20GERMAN-DEUTSCH-73734-1-0-3.zip?fid=1000196745&ttl=1535862464&ri=8192&rs=8192&setec=34ae1de70ba17c6ed90e4bba9025d82a"
    }
  ]
}