{
  "modId": 73740.0,
  "modName": "Cynical Loading Screen Texts",
  "summary": "The mod that made it to the front page of the Steam Workshop for like three hours is at long last coming to Nexus. Witness the comedic glory that reviewers everywhere praised as &#34;Meh&#34; and &#34;Sorta chuckle-worthy&#34;. This mod replaces all loading screen texts to texts that are more entertaining. Fun for the whole family.",
  "descriptionHtml": "Basically Valve removed this mod from the Steam Workshop for being &#34;too offensive&#34;, and since Steam support is run by a gang of crayon-eating mongoloids, I was unable to appeal it. That being the case, I decided to upload it here. Go nuts.\r<br />\r<br />Have you ever grown tired of reading the same old loading texts repeatedly? Does it ever become tedious reading worthless lore and the endless amount of &#34;helpful hints&#34; while you&#39;re waiting for the game to load?\r<br />\r<br />This mod replaces all (and I mean ALL) loading screen texts with texts that are infinitely more interesting.\r<br />Plus I added in a secret loading screen art model that Bethesda didn&#39;t include in the game.\r<br />You&#39;re welcome.\r<br />\r<br />Frequently Asked Questions: \r<br />Q: This mod is stupid. None of the texts are funny and you&#39;re ruining the immersion of the game. \r<br />A: First of all, that&#39;s not a question. Second of all, if you don&#39;t like this mod then just follow the simple uninstall process. Step 1: Go to Home Depot and buy a rope. Step 2: Tie rope into a noose. Step 3: Find a nice sturdy ceiling fan. Step 4: Finish the uninstallation process by uninstalling yourself.\r<br />\r<br />Q: Are you going to be updating this mod to include even more of your comedy genius? \r<br />A: I updated it a couple times in the past, and at the time I intended to continue updating it, but I&#39;m in college now and don&#39;t really have time anymore. So as of right now I don&#39;t plan on releasing further updates. However, this decision is not permanent and it may change if I can find some time in my schedule.\r<br />\r<br />Q: Am I allowed to provide suggestions for future updates?\r<br />A: Sure, as long as I&#39;m allowed to totally steal your idea and give you absolutely no credit for it.\r<br />\r<br />Q: My computer loads the game too fast, so I can&#39;t read the loading screens. What should I do? \r<br />A: Fuck if I know. I&#39;m a comedy wizard, not a miracle worker. Maybe you shouldn&#39;t drop &#036;3000 on a gaming PC, faggot. Try running Internet Explorer and open up 25 tabs of hardcore gay porn. That should slow your processor down enough.\r<br />\r<br />Q: Does this mod require any DLC&#39;s?\r<br />A: Nope.\r<br />\r<br />Q: Is this mod compatible with Uncle Sheogorath&#39;s Really Helpful Hints and Tips?\r<br />A: I haven&#39;t tested it yet because I&#39;m lazy as all hell. You&#39;re welcome to try it. Let me know how it goes.\r<br />\r<br />Q: Hey, what gives? I thought you said you replaced ALL of the loading screen texts? I read a few that were a part of the original game&#33; \r<br />A: Thanks for being nit-picky, asshole. The mod needs a few seconds to initialize the first time you load it. After that, if you&#39;re still seeing vanilla texts then they&#39;re probably from Dawnguard or Hearthfire, and if I edited those then the DLC&#39;s would be required in order for you to even use the mod. I wanted to make it available to those select few cheap window-lickers who can&#39;t afford to shell out an extra couple bucks to get the DLC&#39;s. Unfortunately for you that means you&#39;ll have to suffer through a handful of loading screens that lack my comedic input. If this is too much for you to handle then I recommend drinking a gallon of bleach.\r<br />\r<br />Reviews: \r<br />&#34;10/10 like Skyrim with puns.&#34; -IGN \r<br />&#34;Mod of the Year 2014.&#34; -My friend Garrick \r<br />&#34;Your mod is amazing OMG let me have your babies.&#34; -Your girlfriend \r<br />\r<br />User Feedback\r<br />&#34;I have filed a report towards you not because of the mod I actually quite like it but you keep calling the people that had enough time in their day to at least look at your mod, although you seem to be repaying them by calling them &#39;faggots&#39; &#39;fags&#39; and &#39;gay&#39; and other offensive words please note that this might and possibly can ban you for a certain amount of time glad we straightend that out.&#34; -Ep1cXShAd0wHaWk\r<br />&#34;Wow. Talk about an asshole.&#34; -Steel Spirit\r<br />&#34;Idiot ethnic &#39;humor&#39; and &#39;hood-speak&#39; jokes fit for a suburbanite ten year old. -2/5 Star rating&#34; -Chaoward\r<br />&#34;why did this come up when I searched &#39;gay&#39;?&#34; -ayo boi u a hoe\r<br />&#34;You&#39;re a self centred, un-funny, rude, arse licking piece of shit. Treat people nicer.&#34; -michaeldean1997\r<br />&#34;Funny for a little while, but it got boring so I&#39;m deleting it. Oh, and the disgusting homophobic language. Thanks no thanks.&#34; -Moose Empire\r<br />\r<br />Updates: \r<br />v1.0: Release \r<br />v1.0.070: Added 5 new loading screen texts, one of which was contributed by [T-GK] Hyde. \r<br />v1.0.072: Added 2 new loading screen texts. One was contributed by (Mob)☣The Insane Doctor☣(¢λλ), and the other was contributed by Rise of the Bloodthirsty Potato. \r<br />v1.0.075: Added 3 new loading screen texts, two of which were contributed by Templar Gaming -=|NL|=-. \r<br />v.1.1.069: Removed 9 loading screen texts because they were cringeworthy. Added 3 new ones, one of which was contributed by ThePeanutBaron.",
  "categoryId": "28",
  "version": "1.1.069",
  "author": "Dong Expansion",
  "createdUnix": "1456178433",
  "updatedUnix": "1456178433",
  "containsAdultContent": true,
  "uploadedBy": "FearTheNorquist",
  "primaryFile": null,
  "files": []
}