{
  "modId": 73810.0,
  "modName": "Rogue&#39;s Retreat",
  "summary": "A player home built with the lawless in mind. Built to be small yet still usable.",
  "descriptionHtml": "[b]This is the first mod I&#39;ve ever made, so there is a possibility to improve the work I&#39;ve provided for you, if you have any suggestions, or find a bug I didn&#39;t, feel free to comment it.\r<br />\r<br />Version 1.0 - Initial Release\r<br />Version 1.1 - Couple changes, and the new Vanilla version\r<br />Version 1.2 - Fixing the facegen data\r<br />Version 1.3 - TES5Edit Cleaned Edition\r<br />Version 1.4 - Brightness adjusted, a little extra verticality. No more DLC version, I found some plain vanilla stuff to replace it so I only have to update one version.\r<br />[quote]Rogue\r<br />[list=1]\r<br />[*][b]1[/b].\r<br />a dishonest or unprincipled man.\r<br />[/list][/quote][/b]While a name containing &#34;Rogue&#34; may lead you to believe this is a home built for the ones who walk in the shadows, it is instead for any Player who wishes to play a more lawless character, even if they are an assassin, bandit, hunter or anything else that would either fall outside the law or just simply fall into the alignment of &#34;Chaotic Good/Neutral/Evil&#34;.\r<br />\r<br />Once installed you will notice a new map marker north of Riften, once you make your way there, there is a small unmarked quest to get the key to this new home, its in a nearby area and you may have passed it before getting to this house or even picked up the key already, if so no worries. If not then when you arrive at the house you&#39;ll find a clue outside on a &#34;friend&#34;.\r<br />\r<br />Once inside, you have all your normal amenities and plenty of storage, specific storage as well as one large storage area for anything else, or if you don&#39;t feel like using the labeled storage areas. There is also no &#34;auto-sort&#34; or anything like that, it doesn&#39;t fit this kind of home really so I decided to not include it.",
  "categoryId": "67",
  "version": "1.4",
  "author": "Plemith",
  "createdUnix": "1456408824",
  "updatedUnix": "1456484765",
  "containsAdultContent": false,
  "uploadedBy": "Plemith",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000197255",
      "name": "Rogue&#39;s Retreat",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8363",
      "fileName": "Rogue's Retreat-73810-1-4.7z",
      "uploadedUnix": "1456484765",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/0ddca7f54314d0a50c1657589c1ec4169769a81601f5fb6e831de82f0fe937e4/analysis/1456484827/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rogue%27s%20Retreat-73810-1-4.7z?fid=1000197255&ttl=1535862547&ri=8192&rs=8192&setec=02179503ae37770f7e2bea9a5dafe085"
    }
  ]
}