{
  "modId": 73833.0,
  "modName": "Materiel de Corbeau pouilleux",
  "summary": "maison de joueur de style japonais et bien d&#39;autres choses\r<br />a japan style player home and many other things",
  "descriptionHtml": "Ce mod est un petit florilège des éléments que j&#39;ai créé au fil du temps pour le personnage de je joue habituellement : corbeau pouilleux, un moine errant inspiré de la tradition zen japonaise. Il comporte notamment une habitation pour le joueur composée d&#39;une maison ouverte de style japonais avec jardin et bains (système de déshabillage automatique) sur laquelle j&#39;ai beaucoup travaillé et qui me semble trés aboutie, d&#39;un vaste chateau lui aussi de style japonais, de toute sortes de vétements, armes et armures adaptés et de bien d&#39;autres choses encore qu&#39;il serait trop long de détailler ici, et puis ça gacherait le plaisir de farfouiller pour les découvrir. Pensez juste à saluer le Tanuki (le voyageur doit toujours saluer les tanukis c&#39;est bien connu sinon ils lui jettent un sort). \r<br />Pour trouver l&#39;entrée de la &#34;maison&#34; suivez la cote à l&#39;ouest d&#39;Aubétoile, il y a un marqueur de carte.\r<br />Quelques indications s&#39;imposent toutefois. Les voici par ordre d&#39;importance :\r<br />Il est absolument nécessaire d&#39;installer ce petit mod correctif : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/24168/?&#34;&gt;RaceCompatibility&lt;/a&gt; avant d&#39;utiliser le mien, sans quoi votre jeu crashera au démarrage. A priori les fonctions que j&#39;ai utilisées pour mes scripts sont toutes des fonctions vanilla donc SKSE n&#39;est pas requis mais je serais assez tenté de vous en conseiller l&#39;utilisation par précaution.\r<br />le sort nommé Noburo vous transforme en ce grand monstre tatoué avec le masque et la perruque de Kabuki que vous pouvez voir sur la seconde image de présentation. Il utilise pour cela le mécanisme de la transformation en loup-garou. vous ne devez donc en aucun cas le lancer avant d&#39;etre devenu un loup garou, sans quoi vous resterez bloqué définitivement sous la forme de Noburo. le mieux est même à mon avis d&#39;avoir fini la quête pour se soigner de la lycanthropie afin d&#39;éviter les interférences entre transmutations. A noter par ailleurs que &#34;Noburo&#34; reproduit la morphologie générale du personnage qui se trasnforme en lui, si bien que si vous jouez une ablette vous obtiendrez un grand noburo maigrichon. je n&#39;ai simplement pas trouvé les réglages pour lui fixer une morphologie de grand balèze (si vous avez une idée je suis preneur). je n&#39;ai par ailleurs aucune idée de ce qui se passera si votre personnage est une femme.\r<br />Certains des artefacts disponibles ont pour double propriété de vous conférer d&#39;importants pouvoirs et de diminuer fortement votre capacité de port (ils sont juste trés lourds). ils participent d&#39;un trip survivaliste relativement perso et visent à vous empêcher de vous enrichir trop facilement (oubliez avec ça l&#39;idée de transporter trente os de dragons et dix armures daedriques pour les revendre). Dans cette optique le mod propose aussi un système qui vous permet de mendier à la porte de certaines maisons (trouvez le bol de mendiant et cherchez les amulettes de kinareth sur les maisons). evidemment tout celà n&#39;a de sens qu&#39;associé avec un mod de gestion des besoins de type Ineed. Si vous n&#39;etes pas intéressé un équivalent, sans poids, des artefacts en question est toujours disponible. Farfouillez et faites un peu attention aux caractéristiques des objets que vous prenez avant de crier au bug.\r<br />Concernant la question oh combien primordiale de la propriété intelectuelle, qu&#39;il soit clair une fois pour toutes que tous les éléments de ce mod (dessins etc) qui ne proviennent pas de Skyrim ou que je n&#39;ai pas créés avec mes petites mimines sont entièrement libres de droit. je ne reviens pas sur les raisons pour lesquelles je ne crédite pas Sen no Rikyu ou Miyamoto Musashi comme contributeurs de ce mod, je ne pense pas pouvoir le faire comprendre à ceux pour qui ce ne serait pas évident. Comme d&#39;habitude vous pouvez utiliser ou changer librement tout élément de ce mod sans autorisation préalable. sauf dans le cas d&#39;un mod payant, ce que je n&#39;autoriserai en aucun cas.l&#39;utilisation des certains éléments d&#39;architecture est cependant un peu délicate, en raison de la manière dont j&#39;ai traité, ou plutot esquivé, le problème des collisions. n&#39;hésitez pas à me contacter si vous bloquez, le cas échéant je ferais un petit tuto.  \r<br />Enfin n&#39;étant pas masochiste je n&#39;éprouve aucun plaisir à me faire insulter, menacer, humilier et cracher à la figure par les habituels inspecteurs des travaux finis, donc je ne participe jamais au discussions relatives à mes mods, ce qui a aussi pour conséquence regrettable de m&#39;empecher de répondre aux éventuelles questions, demandes ou remarques pertinentes qui pourraient m&#39;etre adressées par ce canal. Si vous avez quelque chose à me dire n&#39;hésitez donc pas à me contacter par mp.\r<br />Voilà, voilà. \r<br />this mod is a pack compiling various things i created for the character i&#39;m usally playing, dirty crow, a vagrant monk inspired in the japanese zen tradition. You will find a japan style player home with bath (auto-undress system) and garden, a japan style castle and many other things (clothes, armors, spells...). Player house entrance is located near dawnstar, just follow the coast to the west, there is a map marker.\r<br />A few important things :\r<br />You absolutely need to install this little patch mod : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/24168/?&#34;&gt;RaceCompatibility&lt;/a&gt;, otherwise skyrim will crash to desk at launch. SKSE is not necessary but could be helpfull.\r<br />the spell named Noburo transform you into the big tattoed monster with the kabuki mask you can see on the second picture. this spell use the gen script which allow you to transform into werewolf. So don&#39;t use this spell before finishing the quest to becoming a werewolf, otherwise you will stay as Noburo all time.\r<br />Some items available in this mod give you important powers but are very heavy. the idea is to impeach you to carry many things to sell and to becoming rich.There is also in this mod a &#34;system&#34; which allow you to be a beggar monk (just find the begging bowl and look for the kinareth amulets near houses doors). of course this game concept have no sense if you don&#39;t use mods like ineed. If you are not interested in you will also find no weight versions of these items.\r<br />every elements i used in this mod wich are not part of Skytim ressources and i didn&#39;t create myself (japanese pictures for example) are right free. Feel free yourself to use and change any element of this mod. No permission or credits are necessary. Some architectural elements are a little bit difficult to use, due to the way i managed, or not managed in reality, the collision problem. So don&#39;t hesitate to contact me for help.\r<br />I never partcipate to the discussions around my mods so if you want to tell me something contact me with mp  ",
  "categoryId": "28",
  "version": "v1",
  "author": "Leucippe",
  "createdUnix": "1456494089",
  "updatedUnix": "1456494058",
  "containsAdultContent": false,
  "uploadedBy": "leucippe",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000197264",
      "name": "Materiel de corbeau pouilleux",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49687",
      "fileName": "Materiel de corbeau pouilleux-73833-v1.7z",
      "uploadedUnix": "1456494058",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/2d6ef5195334fa7fb9daeded2e9af5e6873002e76907f1adf67d9ea10cede2a6/analysis/1456494142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Materiel%20de%20corbeau%20pouilleux-73833-v1.7z?fid=1000197264&ttl=1535862573&ri=8192&rs=8192&setec=707db09a44d6deec0d2b635f23046b3d"
    }
  ]
}