{
  "modId": 73855.0,
  "modName": "Snow Elf Resources",
  "summary": "Snow Elf resources of various meshes including buildings, tables candles etc. Note that when I was making these I still wasn&#39;t sure what I was doing. As such the collisions don&#39;t have materials assigned, so they won&#39;t react to sword strikes etc.",
  "descriptionHtml": "Note that when I was making these I still wasn&#39;t sure what I was doing. As such the collisions might not have materials assigned, so they won&#39;t react to sword strikes etc.\r<br />\r<br />I have a few meshes laying around here and there. I&#39;ve decided to finish them off and in some cases complete sets. Some of them were originally intended for my own mods, but they never got done due to various reasons.\r<br />\r<br />This features huts with exterior and interior. It also comes with some clutter pieces and furniture including beds, shelves, wardrobes, even a small Strong Box. I&#39;ve tested to see that there&#39;s no problems and I haven&#39;t seen any that stand out. There are loose textures mainly for the commoner set (which is incomplete) changes the brass textures to make them look more like Iron (I lazily greyscaled them) there&#39;s also textures for the bed sheets.\r<br />\r<br />The interiors are modular. There is the whole hut interiors, three of them one for commoner. (with the iron and triangular windows) one for the upper and one for the upper inn/tavern/3 tiered hut. The upper-class ones also have an interior cellar, which have no floor so that they can be stacked. My idea was that the Snow Elves lived in colder areas, so they built down instead of up. Of course building down too much may cause lighting issues as you can only have so many light sources overlapping before they start flickering.",
  "categoryId": "82",
  "version": "1",
  "author": "Hallgarth",
  "createdUnix": "1456589256",
  "updatedUnix": "1456589157",
  "containsAdultContent": false,
  "uploadedBy": "Hallgarth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000197403",
      "name": "Snow Elf Resource",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15032",
      "fileName": "Snow Elf Resource-73855-1.zip",
      "uploadedUnix": "1456589157",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1f54a283ce66cf040b4fda658cea814bea595e8b9d43a952b29ab9162452e90a/analysis/1456589169/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Snow%20Elf%20Resource-73855-1.zip?fid=1000197403&ttl=1535862593&ri=8192&rs=8192&setec=6d1c33103ef9d2e3315d172e02311cc3"
    }
  ]
}