{
  "modId": 73887.0,
  "modName": "Scent of Sex 1.4h",
  "summary": "For adults only: Scent of Sex allows you to define a set of &#34;Sex Rules&#34; to define what type of sex will be done, and under which conditions.\r<br />The rules can be fully defined by the user, and they can enable an enormous variety of different sex situations.",
  "descriptionHtml": "[b][color=#00ff00]Description of Scent of Sex - Version 1.4h[/color][/b]\r<br />This mod spices up the life in Skyrim, by adding a way to have controlled sex scenes.\r<br /> \r<br />[b][b][color=#ffd966]Scent of Sex[/color][/b][/b] allows you to define a set of &#34;Sex Rules&#34; to define what type of sex will be done, and under which conditions.\r<br />The rules can be fully defined by the user, and they can enable an enormous variety of different sex situations.\r<br />\r<br />This mod spices up the life in Skyrim, by adding a way to have controlled sex scenes.\r<br /> \r<br />[b]Scent[/b][b] of Sex[/b] allows you to define a set of Sex Rules to define what type of sex will be done, and under which conditions. The rules can be fully defined by the user, and they can enable an enormous variety of different sex situations.\r<br /> \r<br />Ask in the support topic if you need help in defining a specific rule, or check the examples provided in the documentation.\r<br /> \r<br />This mod requires SkyUI version 5.1 and SexLab version 1.62 or newer.\r<br /> \r<br />The full documentation to configure the mod and create the Sex Rules is available as PDF and Word document (right now is still for V1.3, I will update it in the next days.)\r<br />  \r<br />Rules and Config from version 1.3 are fully compatible. Of course, rules from version 1.4 will not work in version 1.3\r<br /> \r<br />Warning: a clean save is always better.\r<br />If you don&#39;t know how to do it follow the instructions in the spoiler\r<br />\r<br />[spoiler]\r<br />You can uninstall the mod, load a game, wait one minute, save the game, then install the new version.\r<br />Or you can use a Save Cleaner tool.\r<br />[list]\r<br />[*]Download a Save Cleaner tool like [url=http://www.nexusmods.com/skyrim/mods/52363/?]Save game script cleaner[/url]\r<br />[*]Duplicate your last save game, just in case\r<br />[*]Run the save cleaner tool, and open the file with your save game\r<br />[*]Click on &#34;Mod Editor&#34; and then select Scent of Sex and then click on &#34;Delete selected mods forms&#34; and &#34;Delete selected mod script&#34;\r<br />[*]Go back to the main window, and put &#34;ssx&#34; on the Scripts filter, select the first script and continue until all of them are deleted.\r<br />[*]Save the save game with the save button.\r<br />[/list][list]\r<br />[/list]At this point, your save game should be clean now, and you can install the new version of the mod.\r<br />[/spoiler]\r<br />\r<br />\r<br />[color=#93c47d]What is new?[/color]\r<br />[spoiler]\r<br />\r<br />V1.4h\r<br />[list]\r<br />[*][size=2]Fixed a small MCM error when the sexual preferences where importing some old config[/size]\r<br />[*][size=2]Now races for filters will not fail in case the name of the race is a sub-string of another race (e.g. &#34;NordRace&#34; is no more the same as &#34;myCustomNordRace&#34;)[/size]\r<br />[*][size=2]Actors not required in the scene (used just to start scenes) are no more involved when the scene starts, allowing other rules to run[/size]\r<br />[*][size=2]When a scene is started and the orgy mode is set, multiple instances of the rule can be started right away[/size]\r<br />[*][size=2]Fixed a problem when checking orgy mode rules when some of the actors were set as non-participating[/size]\r<br />[*][size=2]The cell scans (to find actors, or when opening the MCM) are now done using Miscutil actors scan, improving a lot the performance[/size]\r<br />[/list]\r<br />\r<br />V1.4g (only for LoversLab)\r<br />[list]\r<br />[*]actors should no longer teleport to scenes from miles away (even from different areas)\r<br />[*]fixed indexing of wearable start conditions - source and collaborator &#34;has to wear / not to wear&#34; clothes should now save correctly\r<br />[*]improved reliability of &#39;followup&#39; rules (rules that trigger immediately after another rule) - they should now only trigger as a followup\r<br />[*]improved reliability of event triggers\r<br />[*]improved reliability of aggression restore (restore combat after rule that stopped combat has finished) - actors should more reliably restart combat\r<br />[*]improved reliability of rule cooldown - sometimes rules that should only trigger once per X seconds, would trigger multiple times before cooldown\r<br />[*]rules now retain their ID through edits, thus followup rules should still work even if you edit the leading rule (should also let import/export recognize same rules)\r<br />[*]fixed an issue that could lock rule checking when checking from update was running at the time when an event triggered (probably introduced in g4)\r<br />[*]attempt to fix a rare lockup that seems to happen when source actor is chasing a target actor\r<br />[*]added warning into logs when an actor is not valid because it is flying (mostly for debugging troubles with dragons)\r<br />[*]fixed condition checking for specific NPCs, faction rules, and some others - some conditions like arousal checks, were broken for them\r<br />[*]attempt to fix the &#34;70% lockup&#34; in initializing the mod, which has been reported several times. If you still keep encountering this after switching to g7, let me know\r<br />[*]changed the way actor cache works. This shouldn&#39;t change anything visible, but hopefully, improves stability of rule checks\r<br />[*]reworked rule checker, it&#39;s hopefully faster when dealing with complex rules, or a large number of rules\r<br />[*]fixed beds, they had several issues that caused glitches like multiple scenes on the same bed, or beds stopping working for scenes at all\r<br />[*]hopefully fixed a deadlock that sometimes left an actor flagged &#39;involved in scene&#39;, preventing any scenes triggering for that actor\r<br />[*]rebalanced scheduler to be more responsive when switching tasks. This may cause more strain on papyrus when mod is busy with multiple tasks (scanning, checking rules, managing scenes, handling events...), but should make it work a lot more fluidly without choking down. If this causes problems, I&#39;ll try to tune it further, but initial results seemed good.\r<br />[*]there was rare case of MCM menu&#39;s &#34;actors editor&#34; faction list bugging out and locking up, added a check to try and prevent that from happening.\r<br />[*]fixed time based conditions for rules, start and end of &#39;valid time&#39; should now work right\r<br />[*]fixed &#39;but does not participate&#39; for target actor, scene should no longer instantly end when target is set to not participate in scene\r<br />[*]when an actor is near player and does looped &#39;greetings&#39; they were considered to be &#39;in dialogue&#39; with player which caused problems, this is fixed\r<br />[*]more balance updates to the scheduler in attempt to share time more evenly to various processes (scanning, rule checking etc)\r<br />[/list] \r<br />V1.4f (only for LoversLab)\r<br />[list]\r<br />[*](fix) There was a possibility of an infinite loop in searching for actors in collaborator position for relationship rank\r<br />[*](improved) Added a filter to the faction selection\r<br />[*](fix) Fixed many bugs in the edit of factions in Actor Editor, it is also faster now\r<br />[*](new) SkyUI is no more enforced, if you have the good version it will work, if not you will receive a warning message at game load. This may make the mod working with the integrated SkyUI of Enderal\r<br />[*](new) Added Cultist, Forsworn, and Dremora factions to the basic factions list\r<br />[*](fix) Solved a problem in saving the configuration where only the first item of the nudity list was actually saved\r<br />[*](improved) All known basic factions are added at game load time to the faction list\r<br />[/list]\r<br />V1.4e\r<br />[list]\r<br />[*](fixed) the function getActorArray() in ssxRule was never returning a value\r<br />[*](fixed) solved a problem on the Clothes that were used to start, in case there were no clothes defined as &#34;not to wear&#34; the checking was always false\r<br />[*](improved) Now the actors that are used in a rule, when the rule starts, will sheathe their weapons (no more walking to a bed with weapons)\r<br />[*](improved) Now combat rules are fully started by events before they were working only on normal checking\r<br />[*](improved) The combats are stopped on rules based on combat, according to the rule setting, and only when the rule starts\r<br />[*](improved) Better visualization of starting modes based on clothes, and now if you remove all wearables from the items to be wear/not wear, then the starting mode on wearables is removed\r<br />[*](fixed) Solved a problem that was making impossible to have the same faction for different participants\r<br />[*](fixed) Now the checking of clothes for Player and NPCs on the MCM works\r<br />[*](improved) Big performance optimization in checking if the clothes are valid\r<br />[*](fixed) In some cases the same actor was fit in two different positions, making SexLab fail to start an animation\r<br />[*](fixed) Was not possible to remove the first item to be worn during a sex scene by clicking on the remove button\r<br />[*](new) Now the rule checker can run as soon there is something to do, and stay quiet from all the time. It can be activated by a completed Scan or by ending of a scene\r<br />[*](fixed) Fixed a small problem on counting the animations when a race filter was set\r<br />[*](improved) Some &#34;human&#34; actors were added to the Creature factions (like Cultists), now they should be handled correctly\r<br />[/list]\r<br />V1.4d\r<br />[list]\r<br />[*](improved) Player sexual orientation is now specific\r<br />[*](improved) Re-wrote completely the sexual identification and possibility\r<br />[*](improved) Re-wrote the selection of potential gender for partners\r<br />[*](improved) Changed the way anims are found using the new sex value\r<br />[*](improved) Changed the orientation to be, for each of the genders\r<br />[*](new) The old orientation properties are converted when upgrading from version before 1.4d\r<br />[*](improved) Added a double confirmation to delete all rules\r<br />[*](improved) Added an extra message in case an actor cannot be found because the sexual orientations are not allowing the available actors\r<br />[*](improved) Removed some old, not used anymore, code\r<br />[*](improved) Removed allActorsNum and replaced by functions to improve reliability of the actor list\r<br />[*](improved) Added a better handling of combats\r<br />[*](fixed) Fixed a problem on checking if animations are available when saving the rule, the result (in some cases) was no animations also if animations were found by clicking the Count Anims button\r<br />[*](fixed) Fixed a big problem where the same actor was possible to be selected as source and collaborator, making the SexLab animation to fail\r<br />[*](fixed) Fixed a problem in the actor editor that was showing actors no more available in some cases\r<br />[*](fixed) Fixed a problem in showing the party in the logs in case of optional collaborators\r<br />[*](fixed) Fixed a problem of having &#34;I will not participate&#34; disabled for Player and Specific actors\r<br />[*](improved) Big improvement on the page of the MCM showing the initialization\r<br />[*](improved) Improved the management of beds, now you have 10 possible options for using bed, not using beds or asking for beds\r<br />[*](fixed) Player sexual orientation was not saved, and reset to Hetero at each game reload\r<br />[*](fixed) Fixed the automatic restart of the mod, in some conditions the initial stop event was received after the restart event after initialization completed\r<br />[*](improved) Reimplemented ValidActor function in ssxRule\r<br />[*](improved) Changed some notifErrors to use notifPlayerDetails in Rule Player\r<br />[*](improved) Changed aggression handling to faction instead of array\r<br />[/list]\r<br />V1.4c\r<br />[list]\r<br />[*](fixed) Fixed a problem on the races set as exclusive\r<br />[*](fixed) Fixed a small problem while loading a game where a previous race was no more available\r<br />[*](new) Added a warning in case PapyrusUtil version is too old\r<br />[*](improved) No more message boxes in case SexLab is not fully installed. Of course, the mod will not work, and you will see an explicit message only when opening the MCM\r<br />[*](improved) If the mod was in an active state during a save game, it will restart after it is fully initialized\r<br />[*](new) Added Japanese translation\r<br />[/list]\r<br />V1.4b\r<br />[list]\r<br />[*](improved) Better management of creatures identification\r<br />[*](improved) Cows and Chickens are no more considered humans if the NPC is not correctly defined\r<br />[*](improved) Spectators can be up to 15\r<br />[*](fixed) 8 spectators setting was not working\r<br />[*](fixed) creatures are no more possible spectators\r<br />[*](improved) in case the player is subject to a bleedout rule (or protected health), and no rule will start (for any reason), then the player is healed a little, just to avoid to be forever in bleedout\r<br />[*](improved) the small healing is no more done with a spell (it was not working in many cases)\r<br />[*](improved) Completely re-written the actorCache to be faster and handle better the creatures\r<br />[*](fixed) better management of bleedout\r<br />[*](improved) better recovery in case a rule was being edited and the MCM pages are skipped using the Esc key\r<br />[*](fixed) solved a small problem in case the previous cell was not yet found in the scan and it was interior\r<br />[*](improved) The documentation (Docx and PFD) is updated to the last version\r<br />[/list][size=1]\r<br />[/size]V1.4a\r<br />[list]\r<br />[*](fixed) Solved a problem on sorting names and tags, the items after &#34;Z&#34; where removed\r<br />[*](improved) re-added the Re-Scan tags button\r<br />[*](fixed) Solved a problem on calling spectators when they were not required (just a trace error) (satanfist)\r<br />[*](fixed) Fixed the problem that was making impossible to remove spectators once they were set in a rule (satanfist)\r<br />[*](fixed) In case Health, Arousal, Stamina, and Magicka were exactly the required value the rule was considered not good\r<br />[*](fixed) The preferred actors (for rules started by events) was lost in some cases\r<br />[*](fixed) Solved a small bug that was making the visible option for the strip mode to be always the default one, also if the option was saved (satanfist)\r<br />[*](fixed) Solved a problem where all possible trace notifications were printed, also if not enabled\r<br />[*](fixed) Fixed the actual results of the player asking for sex\r<br />[*](fixed) Actors were not highlighted with the chosen color for Asking, but with the rule color\r<br />[*](fixed) Solved a missing key for a Help Message (Set Avoid Tags)\r<br />[*](fixed) When refusing sex to the player, the masturbation case was picking the wrong actor (always source and not the player)\r<br />[*](fixed) In case the player was asked for sex, in some cases was impossible to set the percentage or rapes or masturbations. Because it was calculating the answer of the player (and of course it cannot be calculated)\r<br />[/list](improved) The &#34;What is going on&#34; notifications are a little bit clearer\r<br />[/spoiler]\r<br />\r<br />\r<br />[i]Enjoy this mod[/i].\r<br />[b][color=#6d9eeb]CPU[/color] & [color=#6d9eeb]TerraKitsune[/color][/b]",
  "categoryId": "35",
  "version": "1.4h",
  "author": "cpuLL",
  "createdUnix": "1456710914",
  "updatedUnix": "1505658980",
  "containsAdultContent": true,
  "uploadedBy": "cpuLL",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000198352",
      "name": "Scent of Sex 1.0a",
      "version": "1.0a",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "426",
      "fileName": "Scent of Sex-73887-1-0a.7z",
      "uploadedUnix": "1457231408",
      "modVersion": "1.0a",
      "virusScanUrl": "https://www.virustotal.com/file/f6205199058d96250fdd74b1441af4f41d412fc42902d3bab764dc37576ce4aa/analysis/1457231524/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scent%20of%20Sex-73887-1-0a.7z?fid=1000198352&ttl=1535862636&ri=8192&rs=8192&setec=a6f81715009a46dc659e6d02f7d6f357"
    },
    {
      "fileId": "1000199135",
      "name": "Scent of Sex 1.0b",
      "version": "1.0b",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "438",
      "fileName": "Scent of Sex 1.0b-73887-1-0b.7z",
      "uploadedUnix": "1457833638",
      "modVersion": "1.0b",
      "virusScanUrl": "https://www.virustotal.com/file/e0563ddeae2e338a7fa35a51817d8a9f118debccf99c2276e6d0660f03c9b097/analysis/1457833685/",
      "changelogHtml": " 1.0b\r<br />Fix: Fixed the export/import of rules to consider the specific actors\r<br />Improvement: Added Locations as possible rule filter\r<br />Improvement: Added Location types as possible rule filter\r<br />Improvement: Added interior/exterior cell as rule filter\r<br />Fix: On bleedout rules the health of the player is no more maxed to 20 points\r<br />Improvement: The health of actors involved in bleedout rules is restored using a silent spell\r<br />Fix: Probably fixed the problem of actors still asking for sex after the mod was stopped (the scene was re-started in case it was filled while the mod was in stopping phase)\r<br />Change: Items for nudity are now with mod aware IDs, so they can survive a change of load order or the disable of the mod that provides them (warning: previous config is different so you will lose the previous items)\r<br />Improvement: Nude items can now be pick from player, the actor under crosshair and also a container under crosshair\r<br />Big Improvement: The tags now are scanned asynchronously. No more wait time to scan te tags\r<br />Improvement: The normal humans (men + mer) races are added by default, no more requiring to meet them\r<br />Improvement: Added some basic checking when adding actors to avoid non valid ones (like 3D not loaded)\r<br />Improvement: Improved the stopping of scenes when going from one cell to another.\r<br />Fix: Fixed the problem of not saving/loading InteriorExterior cells preferences\r<br />Fix: Fixed a problem in considering a rule valid because the player was matching one of the position (that is not Player), it was a specific position, and were no other actors available\r<br />\r<br />1.0a\r<br />Fix: Fixed the problem of having the position set as &#34;The player&#34; to be not visible in some configurations\r<br />Improvement: Added the ability to set specific actors for a rule\r<br />Improvement: Added two quick participant settings: &#34;Every male&#34; and &#34;Every female&#34;\r<br />Improvement: Added a warning in case an array of 256 elements cannot be initialized (to solve the problem of not having the tags)\r<br />Improvement: In case tags cannot be initialized from SexLab a basic set is provided to enable the rules creation\r<br />Improvement: Added a warning if the running version of SKSE is not at least 1.7.3\r<br />Fix: Fixed the problem on rules starting when player is naked, in bleedout or sleeping may catch a wrong NPC\r<br />Fix: Fixed the problem on having the actor you request to sex to be the wrong one if the player is not the target\r<br />Fix: Fixed the problem on wrong starting modes reported when highlighting a rule (see sex and arousal were switched)\r<br />Fix: Fixed the huge waiting time on loading the MCM for the first time.\r<br />Improvement: Little speed up during the scanning of crowded areas, and speed up the re-scan of the same cell\r<br />Improvement: Improved the search for translated strings, if the string is missing it is reported only once\r<br />Improvement: Improved the auto generated rule names in case of specific actors\r<br />Fix: The saving of starting modes is fixed\r<br />Improvement: If the specific actor is defined in multiple positions a warning is shown\r<br />Fix: Fixed the problem on not seeing actors naked and having sex\r<br />Improvement: Added Spanish translation\r<br />Improvement: Added Chinese translation <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scent%20of%20Sex%201.0b-73887-1-0b.7z?fid=1000199135&ttl=1535862636&ri=8192&rs=8192&setec=3b2b49023125e4e98839a1d85a680ab4"
    },
    {
      "fileId": "1000202605",
      "name": "Scent of Sex 1.2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "496",
      "fileName": "Scent of Sex 1.2-73887-1-2.7z",
      "uploadedUnix": "1460301500",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/bb283da38646774ae3df646e3ea2b63256fcdcc2f78e0595bfe7412c1b2c3b38/analysis/1460301544/",
      "changelogHtml": " Improvement: Improved the stopping of the scenes in the MCM, now the actors will redress normally\r<br />Change: Restored the ForceStart() of scenes, or many of the NPCs were just not be involved in sex rules (sorry, that may break some vanilla quest.)\r<br />Improvement: Removed the double checking of the same actor for LOS and Relationship (small performance improvement)\r<br />Improvement: Actors that are swimming are no more included in the scan (to avoid them to die if involved in a sex scene underwater)\r<br />Fix: Fixed the problem of saving the configuration, that was altering the ssxr.doNotInvolve values\r<br />Improvement: If the debug notification are enabled, for the long actions (MCM Open, Config load, Config save, Tags scan) the actual time elapsed to complete the function is printed in the papyrus.log\r<br />Improvement: Added a new option to set if the position has to be undress at animation start and if has to redress at animation end\r<br />Improvement: Added a new option to wear a (set of) item(s) at animation start, and to wear some items when the animation ends (for DD lovers)\r<br />Improvement: Added a new way to filter participants by items that are wearing and not wearing\r<br />Improvement: Completely rewritten the way starting modes are stored and calculated, now they are 20 times faster\r<br />Improvement: Added the ability to set the starting filters also for Collaborators\r<br />Fix: Fixed a bug where a position was a specific actor, the position changed the value and the specific actor is now in a different position. It was not possible to save the rule.\r<br />Improvement: When an actor is involved the event catcher is put to sleep to improve performance and reduce side effects on some really special animations\r<br />Improvement: Improved the handling of menus. Now if any of the menu is open, the rules cycle will not start any rule (no more interruptions during dialogues)\r<br />Improvement: The values of Health, Stamina, and Magicka are now a possible starting filter\r<br />Improvement: Added a &#34;stop boring me&#34; option to defeat enabled, so the defeat warning will not be shown more than once if you like\r<br />Improvement: The vanilla human races are added by default when initializing/loading the human races\r<br />Improvement: When editing the starting modes and saving the rule, if the position selected is not active, a warning is shown\r<br />Improvement: When saving the starting modes, there is a check if the rule can actually start (a sleeping NPC cannot see anything or be in combat.)\r<br />Improvement: The new filters and Do Not Involve rules are completed\r<br />Fix: Fixed the problem on finding beds when there were more than 4 in the same cell\r<br />Big Improvement: Full re-write of the function to get the animations, now is 100% more reliable and can consider all possible cases of the rules, and also avoid to find bad animations when tags are mismatching the actual actors\r<br />Improvement: Added some checkings on tags to avoid to define not valid tags\r<br />Big Improvement: Re-structured the code. Now the scan cycle and the rule cycle are separated and more efficient\r<br />Improvement: Added a way in Tags to have the gender tags for the player done in 4 different ways\r<br />Fix: Fixed a problem on generating the rule name on threesomes\r<br />Fix: Fixed a problem of the player being ignored when using Every male and Every Female position types\r<br />Improvement: Significant speed up of enabling/disabling a race\r<br />Fix: Probably fixed the &#34;Player Asks for sex&#34; rules. Now the actor is picked quickly also if the scan is not completed.\r<br />Change: Removed the line &#34;Follower sex&#34; in the main MCM page, it was useless and was consuming time to open the MCM\r<br />Fix: Fixed the bleedout rules that were getting in many cases the wrong actor\r<br />Fix: Fixed the animation search when creatures were involved, and also for the Everyone position type\r<br />Change: Moved Rescan All Tags in the &#34;Stop Scenes&#34; page\r<br />Fix: Fixed the problem on Specific Actors and Relationship that were not usable in the MCM\r<br />Improvement: Added a main option to define the gender orientation play style to help in finding animations\r<br />Change: Renamed &#34;I will not participate&#34; to &#34;But actor will not participate&#34;\r<br />Improvement: Added an option to specify if the player can be included or not in position type Everybody, Every Male, Every Female.\r<br />Fix: Fixed the Followers, now they are recognized\r<br />Improvement: Rewrote the Scanner, now it always checks the full cell. The quick scanning was missing the new actors, and was only saving half a second on the scan.\r<br />Fix: Fixed the rape on denials, it uses aggressive animations (that are checked when you save the rule), and the player is correctly set as victim\r<br />Improvement: Gender Tags: Use strict gender tags, Use lazy gender tags, try strict but the go lazy, don&#39;t use gender tags\r<br />Improvement: Added a more sophisticated way to find gender tags. &#34;Lazy mode&#34; will ignore the actual sex of the participants.\r<br />Big Improvement: Added a way to add specific animations to the rule, inside the tags definition\r<br />Improvement: Added a warning in case the agressive anims are possible but there are no anims with aggressiveness\r<br />Improvement: Improved the notifications, with an &#34;Advanced Debug&#34; mode, and directly visible the &#34;Don&#39;t bother me&#34; for SLEN and Defeat\r<br />Fix: Fixed the &#34;Who has the active position&#34;. Source and Collaborator were swapped <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scent%20of%20Sex%201.2-73887-1-2.7z?fid=1000202605&ttl=1535862637&ri=8192&rs=8192&setec=bb5f2b1af22762a0d741f56485b8538a"
    },
    {
      "fileId": "1000230066",
      "name": "Scent of Sex Configuration Guide (Zipped PDF file)",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2980",
      "fileName": "Scent of Sex Configuration Guide (Zipped PDF file)-73887-1-4.7z",
      "uploadedUnix": "1480897961",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/2f77854f3fc0852b002721f515c7a201e5e252212d02497ac1ca0935cd596088/analysis/1480897983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scent%20of%20Sex%20Configuration%20Guide%20%28Zipped%20PDF%20file%29-73887-1-4.7z?fid=1000230066&ttl=1535862637&ri=8192&rs=8192&setec=f81f42bf1deb824fbf3fdf9545145055"
    },
    {
      "fileId": "1000230067",
      "name": "Scent of Sex Configuration Guide (Zipped Docx file)",
      "version": "1.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "20938",
      "fileName": "Scent of Sex Configuration Guide (Zipped Docx file)-73887-1-4.7z",
      "uploadedUnix": "1480898010",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/4fa390baf8e111c39664719167cb3d2de29bb2c2697315f68276b2f90ca6e60f/analysis/1480909027/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scent%20of%20Sex%20Configuration%20Guide%20%28Zipped%20Docx%20file%29-73887-1-4.7z?fid=1000230067&ttl=1535862638&ri=8192&rs=8192&setec=62f947975676442be8960ac24d584858"
    },
    {
      "fileId": "1000254998",
      "name": "Scent of Sex 1.4h",
      "version": "1.4h",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "791",
      "fileName": "Scent of Sex 1.4h-73887-1-4h.7z",
      "uploadedUnix": "1505658980",
      "modVersion": "1.4h",
      "virusScanUrl": "https://www.virustotal.com/file/81ae2fd37e35b57bb1bc452562c378a48938f9a5fcbde024f14afd7efe436b56/analysis/1505659264/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Scent%20of%20Sex%201.4h-73887-1-4h.7z?fid=1000254998&ttl=1535862638&ri=8192&rs=8192&setec=4ebb65079625c13d6e93cdc84ef4c0e8"
    }
  ]
}