{
  "modId": 7388.0,
  "modName": "Training Arrows",
  "summary": "Adds craftable Training Arrows so you can improve your aiming skills! ...or to just have fun and troll NPCs in Skyrim :P",
  "descriptionHtml": "[color=\\\"#FF8C00\\\"][u][b]Introduction - Long desciption[/b][/u][/color]\r\n\r\n- Are you tired of not being able to hit a deer or a rabbit because they always run away and your aiming skills are kinda bad with the bow? \r\n\r\n- Are you sick and tired of speaking to the same NPCs, listening to the same crappy lines every single time you go near them, and just want to grief them so much without having every single guard in the city hunt you down for it? \r\n[i]Example[/i]:\r\n- \\\"Do you get to the Cloud district very often? Oh, what am I saying, of course you dont.\\\" \r\n- \\\"OH SHUT UP ALREADY! I\\'ve been to every single place in all of Skyrim, unlike you, who\\'s been all your life in Whiterun you NOOB! \\\"\r\n\r\nIn any case, and whatever reason you may have (personally I just want to mess around and harass NPCs without having the city guards attack me), this mod adds standalone arrows that can be crafted at the forge, named Training Arrows.\r\nTraining Arrows are basically simple arrows that do 0 damage, while negating all damage done by your equipped bow (minus the enchantments), so neutral or friendly NPCs wont become hostile, and no bounty will be added for shooting people in the face (or in the knee for that matter :P)\r\n\r\nWhat does that mean? Well, it means you can use these non-lethal arrows any way you like. Do you want to paralyze an annoying NPC because you\\'re tired of listening to the same line every single time? \r\nDo you want to just train your aiming skills? After all, shooting poor citizens or cattle isnt so nice, plus you get a bounty on your head for doing so. Stationary targets, like a specific spot on a wall or any dummies/archery targets are good for that purpose, but come on: they are stationary targets, duh. My grandma can hit those with ease.\r\n\r\nSo next time you just want to train your aiming skills, shooting at an archery range for practice, and a retarded guard \\\"happens\\\" to walk right in front of you and taking that arrow in the knee, it doesnt mean that you\\'ll have every single person in the city trying to murder you because of that \\'accident\\'! :P \r\nWith training arrows, its like: - Guard: \\\"OMG I took an arrow in the knee! I\\'m gonna kill this m...oh wait, its just a Training Arrow :) \\\" *Guard keeps walking with an arrow stuck in his knee*\r\n\r\nKeep in mind that Training Arrows do make use of the Bullseye perk of the Archery skill, so you can paralyze NPCs just to harass them and have fun, and not get a bounty on your head. \r\nYou can also attack them with an enchanted Bow, and they wont become hostile, no bounty etc, but the enchantment effects will apply as normal, while doing 0 damage every time.\r\nThis means that you can do all kinds of stuff to people with enchantments, just make sure not to kill them because then you\\'ll be hunted down for that (fire, frost, shock enchantments do damage).\r\n\r\nThe Training Arrows use the same meshes and textures as vanilla Iron Arrows, but if you want, I can modify the plugin to use any vanilla textures you want (daedric arrow, dwarven, elven etc).\r\nI suck at texturing though, so dont ask me to create new textures and meshes because I cant.\r\n\r\n[color=\\\"#FF0000\\\"][u][b]Description[/b][/u][/color]\r\nAdds craftable standalone Arrows, that always do 0 damage regardless of the bow used. Enchantment effects of the bow do apply as normal, but without raising aggro. Archery perks apply as well, but no damage is done (duh).\r\n\r\nIt uses the vanilla Iron Arrow & Quiver textures, so this is a simple plugin that simply adds Training Arrows to the forge, that do no damage.\r\n\r\n-To get the arrows, go to any forge. The Training Arrows should be under the Misc category. They require 3 Firewood, and you can make 50 of them at a time. 3 Firewood = 50 Arrows.\r\n- Or just open the console, and type: help \\\"Training Arrow\\\" 0. The item ID should be visible now. Then type player.additem <item ID> <number of arrows you want>\r\n\r\nIf you like this mod, endorse it, leave a comment and tell me what you think. \r\nYou can also make requests, and if I can do what you\\'re asking I probably will, considering that it is relevant to this mod of course.\r\n\r\nAlso, be sure to check out [url=file.php?id=1590]Practice Bow and Arrows[/url]\r\n\r\n[color=\\\"#0000FF\\\"][b]Installation:[/b][/color]\r\n- If downloading with Nexus Mod Manager, simply activate the mod to install, and make sure TrainingArrow.esp is activated, in the Plugins tab.\r\n\r\n- If downloading manually, just drop the TrainingArrow.esp to your Data folder, which is located inside your Skyrim root folder. Your Skyrim root folder is where the TESV.exe file is located.\r\n\r\nTo uninstall, simply delete TrainingArrow.esp from the Data folder.\r\n\r\n\r\n[b]Permission[/b]\r\nDo whatever you want with this mod. Use it for your own mods, upload it in your website, whatever.\r\n\r\nThanks  :)\r\n\r\n-morpheas768",
  "categoryId": "27",
  "version": "1.0",
  "author": "morpheas768",
  "createdUnix": "1327909488",
  "updatedUnix": "1327909555",
  "containsAdultContent": false,
  "uploadedBy": "morpheas768",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24256",
      "name": "Training Arrows",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Training Arrows-7388-1-0.7z",
      "uploadedUnix": "1327909555",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/588e65f57951604591a08fcaa4379f0a2fd3b2863b15116d13125afcde5920f8/analysis/1406644924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Training%20Arrows-7388-1-0.7z?fid=24256&ttl=1535765397&ri=8192&rs=8192&setec=96d08ff70ddaebd394a6925f93d07bb5"
    }
  ]
}