{
  "modId": 73922.0,
  "modName": "Another CBBE body edit",
  "summary": "As requested, one of the bodies featured in my screenshots on the affinity",
  "descriptionHtml": "   \r<br />\r<br />   Ok so I had quite a few people asking me to upload a body to the nexus... so here&#39;s one I felt was the most complete. You&#39;re still going to need to edit the body in-game using racemenu sliders along with those from the new &#39;CBBE morphs&#39; tab and some from another mod that I will post a link to below. I&#39;ll post my slider settings as well to show you how I got  the look you see in the pictures. I&#39;m not sure if the mod load order will mean anything for racemenu and the joining mod, but In my experience, you first need to edit the body using the default racemenu sliders in the &#39;body scales&#39; tab, then move to the &#39;body&#39; tab to edit the other ones.\r<br />\r<br />[u]Mods you need: (aside from the obvious skyui and skse)[/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/2666/?]CBBE[/url] Make sure you get bodyslide as well\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/29624/?]Racemenu[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/26800/?]XP32[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/45235/?]Racemenu Skeleton Sliders[/url] (this one is tricky. I&#39;m not 100% sure what is good to install for it to work with the newer versions of the other mods but to be \r<br />                   safe, I downloaded both the &#39; Slider Complier Beta 6 &#39; as well as the &#39; Main file - xml Complier included &#39; follow the instructions \r<br />                   in the description with activating the mod manually and whatnot and you should be good. If you have any questions about it,                    don&#39;t hesitate to ask and I&#39;ll see if I can provide a more detailed explanation)\r<br />\r<br />[u]Mods that I use and are relevant:[/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/51602/?]Fair Skin Complexion[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/62574/?]Feminine Argonian Textures[/url]\r<br />\r<br />\r<br />You should be good to go to start in-game. If there are any issues with this crap then just ask. This is my first upload so I&#39;m hoping it goes pretty smoothly. If there aren&#39;t any issues, I&#39;ll start posting other bodies that I think are complete for you.\r<br />\r<br />[u]KEEP IN MIND\r<br />\r<br />[/u][size=4]THIS IS JUST THE BODY&#33; THERE ISN&#39;T ANY ARMOUR OR CLOTHES HERE SINCE I&#39;M JUST TESTING THE WATERS TO SEE IF IT&#39;LL WORK&#33;[/size]\r<br />\r<br />[size=2]THE SAME THING WITH OTHER BODIES BEING POSTED APPLIES HERE; I&#39;LL UPLOAD MORE IF EVERYTHING WORKS SO GET BACK TO ME IF YOU FIND SUCCESS.\r<br />\r<br />[/size]I already have an edit ready for [url=http://www.nexusmods.com/skyrim/mods/59202/?]Sotteta Necromancer Outfit[/url] that i can dish out whenever I here back from you guys.\r<br />\r<br />\r<br />[size=3][u]In case your&#39;e interested,[/u][/size] [url=http://www.furaffinity.net/user/snakermac/]here&#39;s[/url] some more screenshots of other bodies I can post here at some point.\r<br />\r<br />\r<br />A message to trolling and dickbagery, I don&#39;t make fun of your weird anime tentacle porn so just remember that when posting comments on other peoples work\r<br />\r<br />",
  "categoryId": "29",
  "version": "",
  "author": "snakermac",
  "createdUnix": "1456808356",
  "updatedUnix": "1456808356",
  "containsAdultContent": true,
  "uploadedBy": "snakermac",
  "primaryFile": null,
  "files": []
}