{
  "modId": 73959.0,
  "modName": "Stables in Towns",
  "summary": "This is a really simple mod that adds stables to Dawnstar, Falkreath, Morthal and Winterhold.",
  "descriptionHtml": "Woot&#33; First ever mod&#33;\r<br />\r<br />I felt so sorry for my horses who had to stand out in the wind, rain and snow without shelter or water whenever I visited the smaller hold capitals. It seemed odd to me that these places didn&#39;t have anywhere to keep horses, so I added some stables. You can&#39;t buy horses from them, they&#39;re purely cosmetic, really, but now your faithful companion can have a roof over its head while you&#39;re off adventuring&#33;\r<br />\r<br />Adds stables to the following locations:\r<br />\r<br />Dawnstar -- Due to the unevenness of the terrain the Dawnstar stable is located to the south slightly outside of the town, right next to where the kajiit caravans tend to hang out. An unsaddled brown horse makes its home here.\r<br />Falkreath -- Since Falkreath is bigger than the other towns, it also gets a bigger stable, located outside of the western gate. Two unsaddled horses hang out here, one palamino and one black and white.\r<br />Morthal -- The stable is located next to the house by the sawmill. An unsaddled black horse lives here.\r<br />Winterhold -- Once again, due to uneven terrain there aren&#39;t too many places to choose from, so the stable is located behind the jarl&#39;s longhouse. An unsaddled grey horse (the jarl&#39;s favourite steed, perhaps?) stands around here waiting for better weather.\r<br />\r<br />All the stables have hay and a water trough inside.\r<br />\r<br />The horses added by the mod have IDs unique to this mod, and should respawn if killed.\r<br />\r<br />The small stables look a little bit odd from some angles, as they were never really meant to be built this way, but I simply couldn&#39;t fit bigger ones, or the terrain would have made it look wonky.\r<br />\r<br />The horse textures in the pictures are from Alek&#39;s Convenient Horses alternative skin textures add-on. They are not included in the file, and the horses should show up vanilla in a vanilla game.\r<br />\r<br />Conflicts: There should be none, unless you have a mod that puts something else in the locations where I&#39;ve built the stables, in which case they&#39;ll probably overlap. You can always open the file in the creation kit and adjust the placement if you want.",
  "categoryId": "90",
  "version": "",
  "author": "MaiaMadness",
  "createdUnix": "1456933802",
  "updatedUnix": "1456933533",
  "containsAdultContent": false,
  "uploadedBy": "MaiaMadness",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000197892",
      "name": "Stables in Towns",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Stables in Towns-73959-.7z",
      "uploadedUnix": "1456933533",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ff918d2a90f4db6e27d6f6b7e0f9844ee79633ad9bf9dea068849d94855c190c/analysis/1456933563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stables%20in%20Towns-73959-.7z?fid=1000197892&ttl=1535862703&ri=8192&rs=8192&setec=999b9cf14efd18c4368647e229d0ea93"
    }
  ]
}