{
  "modId": 73964.0,
  "modName": "Path of Shadows - Stealth Perk Overhaul",
  "summary": "placeholder",
  "descriptionHtml": "[b][color=#6aa84f][size=6]Path of Shadows [/size][/color][/b]\r<br />[color=#6fa8dc][size=4]Stealth Perk Overhaul[/size][/color]\r<br />\r<br />\r<br />[b][color=#6aa84f][size=5]Overview:[/size][/color][/b]\r<br />\r<br />\r<br />[color=#6aa84f][size=5][b]Features:[/b][/size][/color]\r<br />\r<br />\r<br />[color=#6aa84f][size=5][b]Requirements:[/b][/size][/color]\r<br />[list]\r<br />[*][size=2]SKSE (version 1.7.3 or newer)[/size]\r<br />[*][size=2]Dawnguard[/size]\r<br />[*][size=2]Hearthfire[/size]\r<br />[*][size=2]Dragonborn[/size]\r<br />[/list]\r<br />\r<br />[color=#6aa84f][size=6][b]Perk Trees[/b][/size][/color]\r<br />\r<br />[color=#6d9eeb][size=5][b]Alchemy[/b][/size][/color]\r<br />\r<br />\r<br />Alchemist (0/30/60) &gt; Potions and poisons you craft are 0.5/0.75/1% stronger per Alchemy level; eating an ingredient reveals the first 2/3/all effects.\r<br />Physician (20) &gt; Beneficial potions you craft that restore or regenerate health, magicka, or stamina are 15% stronger. If your understanding of foul poisons has grown through the Poisoner perk, your are better able to heal the body, and your beneficial potions are 30% stronger.\r<br />Poisoner (30) &gt; Poisons you craft are 15% stronger. If you understanding of healing has grown through the Physician perk, you are better able to cause harm to the body, and your poisons are 30% stronger.\r<br />Distillation (30) &gt; Combine 3 of the same ingredient at the cooking pot to distill the essence of that ingredient. Essences are more potent than the base ingredient, and can be used to create more powerful potions and poisons. \r<br />Catalyst (40) &gt; Eating an ingredient increases the potency of potions and ingredients consumed for 60 seconds.\r<br />Green Thumb (40) &gt; Additional ingredients are gathered from harvestable ingredient sources.\r<br />Volatile Mixture (45/75) &gt; Bombs/advanced bombs can be crafted at the cooking pot. Bombs can be thrown and will explode on impact, releasing their effect. *Once crafted, bombs can be found under the &#34;Scrolls&#34; section of your inventory. Don&#39;t question, just accept.\r<br />Lingering Taint (50) &gt; Poisons last for 1 additional hit for every 10 levels of Alchemy. \r<br />Grim Harvest (55) Additional ingredients are recovered from the bodies of animals. If wielding a dagger or Alchemist&#39;s Scalpel, you can attempt to harvest human hearts, human flesh, and daedra hearts from slain humans and daedra. Chance to recover hearts and flesh increases with your Alchemy skill. \r<br />Wiccanlore (60) &gt; When harvesting, you have a small chance to receive a Pristine ingredient. Pristine ingredients have three normal effects and one rare mutated effect, and can be sold for a high value. *Higher chance to receive a Pristine ingredient from Hearthfire planters.\r<br />Mutation (70) &gt; The next ingredient you eat confers a small permanent bonus based on its beneficial properties. Pristine ingredients and distilled essences do not cause mutation.\r<br />Field Kit (70) &gt; Grants the lesser power &#34;Use Field Kit&#34;. When used, alembics and cooking pots can be used while out in the field to craft potions, poisons, and bombs and distill ingredients. You must have an alembic or pot in your inventory and be near a source of heat in order to begin crafting. *Pots and kettles can be found all over Skyrim. Alembics can be purchased from apothecaries. \r<br />Snakeblood (75) &gt; Confers 75% resistance to all poisons. Your blood does a small amount of poison damage to those who attack you or steal your health with a spell.\r<br />Eureka (80) &gt; 5% chance for any potion or poison you create to be twice as potent.\r<br />Waste Not (80) &gt; Volatile Mixture yields 2 bombs; Distillation only requires 2 of the base ingredient.\r<br />Kyne&#39;s Favor (85) &gt; Present an offering of a Pristine ingredient to the Eldergleam to receive a powerful spriggan mother to serve as your protector. *If your spriggan protector dies, you can present another offering to be granted a new one. \r<br />Purity (90) &gt; All negative effects are removed from created potions, and all positive effects are removed from created poisons.\r<br />Philosopher&#39;s Stone (100) &gt; Your mastery of the Alchemical arts has allowed you to create a one-of-a-kind Philosopher&#39;s Stone. Once a day, while the Phosopher&#39;s Stone is in your inventory, you will receive 200 gold and be saved from death.\r<br />\r<br />&#34;Volatile Mixture&#34; Bombs Mini-Guide\r<br />Rank 1:\r<br />-Fire\r<br />-Frost\r<br />-Shock\r<br />-Fear\r<br />-Frenzy\r<br />\r<br />Rank 2:\r<br />-Paralysis\r<br />-Concussive\r<br />\r<br />Alchemy Tweaks\r<br />Re-weighted and re-priced ingredients to make more sense. A set of moose antlers will no longer weigh the same amount as a bowl of salt; rare pearls can no longer be bought for the same price as a deathbell. This also opens up the option to actually make money as an ingredient harvester - it now pays off to hunt down those rare ingredients, because alchemist shops will be willing to pay through the nose to get them. On the flip side, you&#39;ll have to cough up a lot of septims if you want to buy those rare ingredients instead of finding them yourself. This helps to balance out the ridiculous amount of gold you can get for your potions. \r<br />Nerfed the price of created potions - no more becoming a millionaire in the first hour of the game. If you want to make potions that you can sell for some serious gold, you&#39;ll need to use distilled essences and hunt down rare pristine ingredients.\r<br />Mini harvest overhaul functionality\r<br />Ingredients added by Dawnguard and Dragonborn can now occasionally be found for sale in alchemist&#39;s shops. Skyrim has three large port cities - shops should be able to get imported ingredients. \r<br />\r<br />\r<br />\r<br />[color=#6d9eeb][size=5][b]Light Armor[/b][/size][/color]\r<br />[b]\r<br />[color=#6d9eeb][size=5]Lock-Picking[/size][/color][/b]\r<br />\r<br />\r<br />[color=#6d9eeb][size=5][b]Pick-Pocket[/b][/size][/color]\r<br />\r<br />\r<br />[color=#6d9eeb][size=5][b]Sneak[/b][/size][/color]\r<br />\r<br />[color=#6d9eeb][size=5][b]Speech[/b][/size][/color]",
  "categoryId": "79",
  "version": "1.0",
  "author": "steelfeathers",
  "createdUnix": "1456977758",
  "updatedUnix": "1456977758",
  "containsAdultContent": false,
  "uploadedBy": "steelfeathers",
  "primaryFile": null,
  "files": []
}