{
  "modId": 73969.0,
  "modName": "Grim's Miscellaneous Mods",
  "summary": "A collection of my miscellaneous mods hosted in one place for easy access: NPC Make-overs (Thrynn, Durak), Custom Followers (Garulf), Animal Followers (Rumper Bear), Main Menu Replacers (Manly Men and Winter Holidays), Men's waist wrap (by Aoki), Grim Tales (all 4 books), and a complete guide to all of Halo's Poses (Pinup Poses and Halo Pos",
  "descriptionHtml": "[center][img]https://c2.staticflickr.com/8/7655/27808013176_5927964577_o.jpg[/img][/center]\n<br />I have a collection of mods I have made for my own use and some I used to host on Nexus but took down because there was little interest in them. Every now and then I get a PM from someone asking \"what happened to so and so mod?\" and I then have to upload it someplace and share it. I decided I would just take all my little mods and share them in case any one had any interest in them. These are pretty much \"as-is\" but if there is a major bug in something I will look at it. Many I thought I had lost till I came across them on an old back-up drive I restored.\n<br />\n<br />Anyhow enjoy :-)\n<br />\n<br />[b][font=Comic Sans MS][color=#ffe599][size=5]Animal Followers[/size][/color][/font][/b]\n<br />\n<br />[size=4]Rumper [b]the Lil'Bear[/b][/size]\n<br />\n<br />Rumper is a small lil'bear who likes to sleep a lot. He uses the basic vanilla scripts that most animal followers use. He will use what ever bear textures and meshes you have installed. He was only for personal use but sharing him now. To find him leave Riverwood over the bridge that leads towards Whiterun (the first bridge out of Riverwood). On the other side you can turn right to Whiterun or left towards Bleak Fall Barrows. On the left side is a small area of land that is between the river bed and the path - Rumper is situated in that little plot of land. \n<br />\n<br />He acts like any basic animal follower - although he may be a bit happier, and more lethargic, than most of them. His size, scale, and mass are all smaller as he is a little cub. He has some perks and skills to help him fight and sneak better but don't expect miracles from the lil'bear. His audio has also been made much quieter. But if his woofing sounds still bother you there is a nexus mod to make bears quiet (but applies to all bears I believe).\n<br />\n<br />Lastly if using AFT to manage followers there is an issue with AFT in how it tracks followers by keeping the follower counts at zero. Consequently with an animal follower every time you talk to them via dialogue it can trigger the \"X is following you\" type of message which gets annoying very quickly. So there is am AFT friendly version of Rumper that removes that message. This means when you first meet him and hit the ENTER key he will join you but you won't see any message stating that. You can double check by hitting ENTER again to see if the dialogue options now show.  Note this does NOT mean he (or any basic animal companion) is totally compatible with AFT as they are not. I use AFT and it mostly works with animal followers. But sometimes you have to select the animal and then use the console commands DISABLE and ENABLE (one right after the other) to reset him. Or, sometimes, just fiddling with menu options will get them working again. I think they work best with vanilla or EFF or SFM but I prefer AFT so put up with it myself. All testing, however, was done with game saves with no AFT installed for the regular version, and with AFT for the AFT friendly version.\n<br />\n<br />\n<br />[font=Comic Sans MS][color=#ffe599][b][size=5]Custom Followers[/size][/b][/color][/font]\n<br />\n<br />[size=4][b]Garulf [/b][/size]\n<br />\n<br />Garulf Wild-Blood, twin brother of Wulf Wild-Blood. He can be found at the Dead Man's Drink in Falkreath. He looks pretty much like Wulf of the Skaal but is a stand alone follower focused on two-handed greatsword skill. He requires the Dragonborn DLC. You can marry him. See images of [url=https://www.flickr.com/photos/wolfgrimdark/sets/72157656087122643]Garulf on Flickr.[/url]\n<br />\n<br />\n<br />[font=Comic Sans MS][color=#ffe599][b][size=5]Grim's Tales of Adventure[/size][/b][/color][/font]\n<br />\n<br />For three years I wrote stories about my character Grimulfr Fenrirson, the Son of Fenrir the Winter Wolf (from Norse mythology), in the world of Skyrim. What started off as just a series of short random stories soon turned into a full-fledged project spanning three books. I created Grim with a very clear mission in mind - his arrival in Skyrim at age 16, how he learned that he was the son of a powerful nature deity named Fenrir, and that he had a destiny to free his father from his chains of bondage and destroy the Thalmor. It took three books to cover the entire saga. \n<br />\n<br />At the end of book 3 I still felt I had some stories to tell about Grim's struggle with his dragon souls and his destiny to one day take his father's place as a Guardian of Nirn. Thus book 4 was written.All of them have been converted to PDF files and uploaded here. I also have links to all his stories on Nexus, as well as the adventures of his mercenary band the Black Wolf Company, on this [url=http://www.nexusmods.com/skyrim/images/636693/?]Nexus Page[/url].\n<br />\n<br />[font=Comic Sans MS][color=#ffe599][size=5][b]Main Menu Replacers[/b][/size][/color][/font]\n<br />\n<br />[size=4][b]Manly Men[/b][/size]\n<br />\n<br />A collection of main menu replacers (1920 x 1080) for Skyrim featuring lots of men. Many images donated by the Nexus community as well as my own work. For instructions and using see the read me file in either the main download or the collected images. The readme is a little out of date since I have combined all the images into a single large ZIP file (versus having them as separate downloads) and no longer have samples uploaded but is otherwise correct. I did include three images that show of some of the wallpapers but no labels. Sorry but for now it is hit or miss unless you can view DDS files. Way too much work to recreate all those  images at the moment. If I add any new packs, however, I will include images.\n<br />\n<br />[size=4][b]Winter Holiday[/b][/size]\n<br />\n<br />Main menu replacers that focus on winter, especially the holiday season. These are also 1920 x 1080. There is a read me and some samples of the images used in the default main menu download for this menu replacer set. For now that is all I can provide - too much work to make new sample images.\n<br />\n<br />[font=Comic Sans MS][color=#ffe599][size=5][b]Outfits[/b][/size][/color][/font]\n<br />\n<br />[font=Comic Sans MS][size=4][b]Men's Revealing Prisoner Shorts by Aoki (NSFW)[/b][/size][/font]\n<br />\n<br />This is a replacement outfit for the prisoner tunic (Roughspun Tunic) made by [url=http://www.nexusmods.com/skyrim/users/513855/?]Aoki[/url] who was kind enough to grant me permission to host the mod on my page. The outfit was designed for the mod Nude Male with Import from Roberts New Vegas male v1.5 or higher by Sundracon. If using another body type (say SkySkins, SOS or SAM) the male-parts will look like a pale blob. I use a mix of SkySkins and SOS but the texture issue doesn't bother me as I am seldom looking up my characters shorts. There are so few good male shorts on Nexus (like maybe three) its worth it to me and I use this wrap all the time. So I wanted to host it for those who either don't care about male parts issue or happen to use a compatible body (Better Males Sundracon may work - no idea as I don't use it anymore). Anyhow credit for the mod goes to Aoki (for making it), AlienSlof (for male parts), jajajajaja (figlead mesh), and Sundracon (for nude male with import from Roberts New Vegas male). See images for what it looks like.\n<br />\n<br />\n<br />[font=Comic Sans MS][color=#ffe599][size=5][b]NPC Make Overs[/b][/size][/color][/font]\n<br />\n<br />[b][size=4]Thrynn[/size][/b]\n<br />\n<br />Thrynn the Rogue from the Thieves Guild. This mod lets you recruit Thrynn as a follower. I have tweaked his skills, how he goes up in levels, his perks, gave him custom armor (Lethos/Kingslayer armor), a taunt ability (dragon shout) based on \"Marked for Death.\"  This mod requires [url=https://drive.google.com/open?id=0B3q61pgFsYvzcE9uYzNkR09Vcmc]the archived MFVM mod by Mysticentity[/url] (only available now on google drive) as normally Thrynn does not have the voice set to be a follower (and the whole point of making him a follower was for his sexy voice). His looks have remained unchanged other than the fact I made him a bit beefier. See readme in download for more details. Obviously you need to get into the Thieves Guild to be able to meet him in the Cistern and recruit him. See images of [url=https://www.flickr.com/photos/wolfgrimdark/sets/72157654782605858]Thrynn on Flickr.[/url]\n<br />\n<br />[size=4][b]Durak[/b][/size]\n<br />\n<br />Durak of the Dawnguard. Slight change to his looks and stats. He is also marriageable.  He is overall the same follower with a small overhaul to looks and abilities. Requires the Dawnguard DLC. You still need to do the initial Dawnguard quests to get him as a follower. See images of [url=https://www.flickr.com/photos/wolfgrimdark/sets/72157657337210639]Durak on Flickr.[/url]\n<br />\n<br />\n<br />[font=Comic Sans MS][color=#ffe599][size=5][b]Storytelling Guide and Pose Guide[/b][/size][/color][/font]\n<br />\n<br />[size=4][b]Image Pose Guide by Anataron (NSFW) for Halo Poses and Pinup Poser[/b][/size]\n<br />\n<br />Thanks to Anataron we have a complete guide of every pose in Halo's posing and pin-up mods. This is a massive download as it contains literally thousands of images. They are all sorted by folders to relate to the various numbers on the mods. Many images are NSFW so keep that in mind. \n<br />\n<br />[b]\n<br />[font=Comic Sans MS][color=#ffe599][size=5]Help: Compatibility, Installing, Uninstalling, and Questions[/size][/color][/font][/b]\n<br />\n<br />These are pretty much all \"as-is\" and very basic mods I assume the majority will know how to use and install with NMM. When I have time I will add more instructions for each mod with more details but don't expect a lot. This is more of a self-serve mod page. If there is some bug I will check it out of course.\n<br />\n<br />I do still have most of my read me files for each mod so will include those in the download. They contain a lot of detail on what the mod does and how to use it.\n<br />[font=Comic Sans MS][color=#ffe599][b][size=5]\n<br />Credits and Permissions[/size][/b][/color][/font]\n<br />\n<br />No one has permission to upload these mods or use any of the assets without my permission. If interested in using something send me a PM. They are for Nexus only.\n<br />\n<br />Hopefully I will remember everyone who helped me out on the various mods. If I forget anyone just let me know. \n<br />\n<br />Anataron - for the image pose guide\n<br />LordOfWar - for porting over the King Slayer W2 armor that Thrynn uses and granting its use\n<br />Aoki - for permission to host his Men's Revealing Prisoner Shorts. Also to AlienSlof, jajajajaja, and Sundracon for the resources Aoki used in making the mod.\n<br />\n<br />Main Menu Replacers\n<br />\n<br /> - Hellstorm102 for permission to use their NIF file and help on creating the DDS files.\n<br /> - Binmaru (BI), ENB: Not Available/Unknown\n<br /> - Corfus (CO), ENB: Somber Lut Sepia by Tansarville and tweaked by Corfus\n<br /> - Diethardt (DI), ENB: Custom ENB tweaked by Diethardt\n<br /> - FatalisticZero (FZ), ENB: Somber ENB Lut Sepia by Tansarville\n<br /> - Greyblood (GR), ENB: Saraan Suum ENB by Machiimachii\n<br /> - Jessb81 (JE), ENB: Ascension ENB WIP by JoPineapple \n<br /> - Khajiitas (KH), ENB: Poupouri Extended ENB (First Seed) by Machiimachii\n<br /> - Lowol64 (LO), ENB: Somber Lut Sepia by Tansarville\n<br /> - OrcVakarian (OV), ENB: Kountervibe Enb Extensive by Kyo\n<br /> - Urshi (UR), ENB:  Pinapplevision ENBs - Synergy by JoPineapples68; Winterheart II - Atmospheric ENB by WoodManGamer\n<br /> - WolfGrimDark (WG), ENB: Somber Lute Sepia by Tansarville and True Vision by Bronze316\n<br /> - Sydney8 (SY), ENB: Phinix Natural ENB\n<br /> - ArticOcean (AO), ENB: Custom ENB\n<br /> - Ems60 (EM), ENB: RealVision ENB: ELFX Version Full from SkyrimTuner\n<br /> - Nataly1q2w3e4r5t (NA), ENB: None\n<br /> - HeavenThere (HT), ENB: Megatherium by DpSlothKing\n<br /> - Gucky2010 (GU), ENB: NA    \n<br /> - Basstos (BA), ENB: NA\n<br /> - MsFrankenstein (MF), ENB: Project ENB by Bronze316\n<br /> - Meviara (NE), ENB: NA\n<br /> - Stealthic Khaos (SK), ENB: Somber ENB by Tansarville\n<br /> - Pangallosr (PA), ENB: The Eye of the Beholder by Pangallosr\n<br /> - ForrestHome (FH), ENB: NA\n<br /> - Lowol64 (LO), ENB: Somber ENB by Tansarville\n<br /> - EMS60 (EM), ENB: NA\n<br /> - Pottoply (PO), ENB: NA\n<br /> - Renthal311 (RE), ENB: NA",
  "categoryId": "28",
  "version": "1.5",
  "author": "WolfGrimDark",
  "createdUnix": "1466623773",
  "updatedUnix": "1524002501",
  "containsAdultContent": false,
  "uploadedBy": "wolfgrimdark",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000198017",
      "name": "Halo Poser and Pinup Guide Update",
      "version": "1.0",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "36870",
      "fileName": "Halo Poser and Pinup Guide Update-73969-1-3.rar",
      "uploadedUnix": "1457034792",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f7f5acc901b500d9d6e4e6bb24633cb58de86f3f7512fb5969375dca031e47c4/analysis/1457034858/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Halo%20Poser%20and%20Pinup%20Guide%20Update-73969-1-3.rar?fid=1000198017&ttl=1535862716&ri=8192&rs=8192&setec=7a40a615651df70ad5fa19871c48a8b4"
    },
    {
      "fileId": "1000210634",
      "name": "Thrynn the Rogue",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15009",
      "fileName": "Thrynn the Rogue-73969-1-0.zip",
      "uploadedUnix": "1466549257",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/21d79930e58487c164e5596e1b9719fc7a43b3908719beb441c342c2ac71a1e2/analysis/1466549287/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thrynn%20the%20Rogue-73969-1-0.zip?fid=1000210634&ttl=1535862717&ri=8192&rs=8192&setec=ada967b1e04758dcd9eb9250f3ec3694"
    },
    {
      "fileId": "1000210635",
      "name": "Durak of the Dawnguard",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "185",
      "fileName": "Durak of the Dawnguard-73969-1-0.zip",
      "uploadedUnix": "1466549302",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0089990041305ecc4a38bb67da51895e18f1b6cb839948757f61c0e9c17f1a89/analysis/1466549343/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Durak%20of%20the%20Dawnguard-73969-1-0.zip?fid=1000210635&ttl=1535862717&ri=8192&rs=8192&setec=6f95b04803378f9b1b895a9df20cf493"
    },
    {
      "fileId": "1000210637",
      "name": "Garulf Wild-Blood Follower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "193",
      "fileName": "Garulf Wild-Blood Follower-73969-1-0.zip",
      "uploadedUnix": "1466549479",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/697722bc09aec927c3440fbdc53429984d73d7ffae8360ff1e5d0f1e01a7b05b/analysis/1466549524/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Garulf%20Wild-Blood%20Follower-73969-1-0.zip?fid=1000210637&ttl=1535862718&ri=8192&rs=8192&setec=c3567bd631c5309b21e85ced8e0699ef"
    },
    {
      "fileId": "1000210638",
      "name": "Men of Skyrim Main Menu Replacer",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "861",
      "fileName": "Men of Skyrim Main Menu Replacer-73969-1-0.zip",
      "uploadedUnix": "1466549591",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8b236c6cc660e037c2c02d8a006c5ffad02c540806d3682a61e0e264bb14706d/analysis/1466549644/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Men%20of%20Skyrim%20Main%20Menu%20Replacer-73969-1-0.zip?fid=1000210638&ttl=1535862718&ri=8192&rs=8192&setec=605cb26cc998d5b6b5ba731e05113f55"
    },
    {
      "fileId": "1000210639",
      "name": "Men of Skyrim - Image Pack",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "71407",
      "fileName": "Men of Skyrim - Image Pack-73969-1-0.zip",
      "uploadedUnix": "1466549935",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/079a0cdd73668b5cf1c4e2ba25f7213787b1c956bc93eddde6f41d180fc9a35e/analysis/1466560880/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Men%20of%20Skyrim%20-%20Image%20Pack-73969-1-0.zip?fid=1000210639&ttl=1535862718&ri=8192&rs=8192&setec=3d347aafffded57099a71f2fa6abc486"
    },
    {
      "fileId": "1000210640",
      "name": "Winter Holiday Main Menu File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1464",
      "fileName": "Winter Holiday Main Menu File-73969-1-0.zip",
      "uploadedUnix": "1466550043",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2179c3c67e4b986920786e22c371985e6035a8ecce06512ee57ae8a0f6fdb197/analysis/1466550065/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winter%20Holiday%20Main%20Menu%20File-73969-1-0.zip?fid=1000210640&ttl=1535862719&ri=8192&rs=8192&setec=de1a9b9afbd597f3dbbd2d5383fb7af1"
    },
    {
      "fileId": "1000210642",
      "name": "Winter Holiday Image Pack",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "31473",
      "fileName": "Winter Holiday Image Pack-73969-1-0.zip",
      "uploadedUnix": "1466550131",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/98e34c65283c531db23327362dc4747a6f2420109e3f947891796313a479615a/analysis/1466561055/",
      "changelogHtml": " UPDATE: 2016-06-22\r<br />- Released the mod, version 1.0 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Winter%20Holiday%20Image%20Pack-73969-1-0.zip?fid=1000210642&ttl=1535862719&ri=8192&rs=8192&setec=037489fc772738b4671d06b806321628"
    },
    {
      "fileId": "1000210850",
      "name": "Rumper the Bear",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Rumper the Bear-73969-1-1.zip",
      "uploadedUnix": "1466709990",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/27ead4a51cc50e0b6486bdb1845376973d8032fa1c4f46aabb9ce6a98815343d/analysis/1466710022/",
      "changelogHtml": " [b]UPDATE: 2016-06-23[/b]\r<br />- Rumper is all set and updated his files to 1.1. Figured out the faction/hostility issue. Also made some other improvements to make him more of a lil&#39;bear. I also reduced his audio sound levels (for some sounds at least) to &#34;quiet&#34; which should help with the loud grunting. He is also a very happy little bear with a cautious attitude towards combat. There is a regular and AFT friendly version.\r<br />- Added Revealing Prisoner Shorts for men by Aoki to download area.\r<br />- Men of Skyrim Main Menu Notice: Since someone asked, yes I am thinking of doing another community drive to collect sexy male images for an updated pack of images. \r<br />- I also hope to release at least a beta copy of the writing/image guide this summer as well.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rumper%20the%20Bear-73969-1-1.zip?fid=1000210850&ttl=1535862720&ri=8192&rs=8192&setec=c4015b0c3dd08333eb505f282face50e"
    },
    {
      "fileId": "1000210851",
      "name": "Rumper the Bear - AFT Friendly",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Rumper the Bear - AFT Friendly-73969-1-1.zip",
      "uploadedUnix": "1466710080",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d11b370dccd98e0e317ebc36679c1f353ab26e046694fb07c3b58f80fc9527c4/analysis/1466710083/",
      "changelogHtml": " [b]UPDATE: 2016-06-23[/b]\r<br />- Rumper is all set and updated his files to 1.1. Figured out the faction/hostility issue. Also made some other improvements to make him more of a lil&#39;bear. I also reduced his audio sound levels (for some sounds at least) to &#34;quiet&#34; which should help with the loud grunting. He is also a very happy little bear with a cautious attitude towards combat. There is a regular and AFT friendly version.\r<br />- Added Revealing Prisoner Shorts for men by Aoki to download area.\r<br />- Men of Skyrim Main Menu Notice: Since someone asked, yes I am thinking of doing another community drive to collect sexy male images for an updated pack of images. \r<br />- I also hope to release at least a beta copy of the writing/image guide this summer as well.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rumper%20the%20Bear%20-%20AFT%20Friendly-73969-1-1.zip?fid=1000210851&ttl=1535862721&ri=8192&rs=8192&setec=f984f0a6fcf190560b41285548c933c6"
    },
    {
      "fileId": "1000210852",
      "name": "Men&#39;s Revealing Prisoner Shorts by Aoki",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1314",
      "fileName": "Men's Prisoner Shorts by Aoki-73969-1-1.zip",
      "uploadedUnix": "1466710187",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/197178aa6a3a429ca8e79c8b994249c518ff33789b3399c54999f86ce309cbee/analysis/1466710204/",
      "changelogHtml": " [b]UPDATE: 2016-06-23[/b]\r<br />- Rumper is all set and updated his files to 1.1. Figured out the faction/hostility issue. Also made some other improvements to make him more of a lil&#39;bear. I also reduced his audio sound levels (for some sounds at least) to &#34;quiet&#34; which should help with the loud grunting. He is also a very happy little bear with a cautious attitude towards combat. There is a regular and AFT friendly version.\r<br />- Added Revealing Prisoner Shorts for men by Aoki to download area.\r<br />- Men of Skyrim Main Menu Notice: Since someone asked, yes I am thinking of doing another community drive to collect sexy male images for an updated pack of images. \r<br />- I also hope to release at least a beta copy of the writing/image guide this summer as well.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Men%27s%20Prisoner%20Shorts%20by%20Aoki-73969-1-1.zip?fid=1000210852&ttl=1535862721&ri=8192&rs=8192&setec=2f54df8cfea8f222b4df1d960400f031"
    },
    {
      "fileId": "1000212096",
      "name": "Grim Tales - Wolfborn - Book 1",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "61337",
      "fileName": "Grim Tales - Wolfborn - Book 1-73969-1-2.zip",
      "uploadedUnix": "1467653388",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/1c966a9c225312dabc049e80e54908d5933bdfcc0f7394fb982518363df2d694/analysis/1467664455/",
      "changelogHtml": " UPDATE: 2016-07-04\r<br />- Added Book 1 of Grim&#39;s Tales of Adventure to the mod page as version 1.2. I am slowly converting all the stories I wrote about my character Grimulfr Fenrirson to PDF books and will host them on this mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20Tales%20-%20Wolfborn%20-%20Book%201-73969-1-2.zip?fid=1000212096&ttl=1535862722&ri=8192&rs=8192&setec=bfce049479ff33dcf896ba399e7cfe32"
    },
    {
      "fileId": "1000215567",
      "name": "Grim Tales - Mother Grim - Book 2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "75521",
      "fileName": "Grim Tales - Mother Grim - Book 2-73969-1-2.zip",
      "uploadedUnix": "1470266920",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/fb49b48d2b35566d2839a31839b95cea4a21932337f944bd3ee255dd597d9a7d/analysis/1470277875/",
      "changelogHtml": " UPDATE: 2016-07-04\r<br />- Added Book 1 of Grim&#39;s Tales of Adventure to the mod page as version 1.2. I am slowly converting all the stories I wrote about my character Grimulfr Fenrirson to PDF books and will host them on this mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20Tales%20-%20Mother%20Grim%20-%20Book%202-73969-1-2.zip?fid=1000215567&ttl=1535862722&ri=8192&rs=8192&setec=7a73a3ed54c4a82d91404dac48133e8f"
    },
    {
      "fileId": "1000216645",
      "name": "Grim Tales -Fenrir Unbound - Book 3",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "90239",
      "fileName": "Grim Tales -Fenrir Unbound - Book 3-73969-1-2.zip",
      "uploadedUnix": "1470945517",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/5c47652539af5abf3b012e596e0f3c8a9804c3e54962db97c5bd72652e4ecb28/analysis/1470956477/",
      "changelogHtml": " UPDATE: 2016-07-04\r<br />- Added Book 1 of Grim&#39;s Tales of Adventure to the mod page as version 1.2. I am slowly converting all the stories I wrote about my character Grimulfr Fenrirson to PDF books and will host them on this mod page. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20Tales%20-Fenrir%20Unbound%20-%20Book%203-73969-1-2.zip?fid=1000216645&ttl=1535862723&ri=8192&rs=8192&setec=e0bfc660857f15ca1ee1d3ed7e9b3449"
    },
    {
      "fileId": "1000225262",
      "name": "Halo Poser and Pinup Guide",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "688412",
      "fileName": "Halo Poser and Pinup Guide-73969-1-0.rar",
      "uploadedUnix": "1477190013",
      "modVersion": "1.3",
      "virusScanUrl": null,
      "changelogHtml": " UPDATE: 2016-11-05\r<br />- Everyone give a huge thanks to Anataron (Alex) for updating the Halo Pinup Image Guide to version 1.5 last night. Lots of new pose in Halo&#39;s mod including another set for the men&#33; Also lots of fun stuff including a lot of beach accessory related poses. The image guide is now current with Halo&#39;s current release. Can find the updates under the updates section of the files.\r<br />- Have about 1/3 of Book 4 of Grim&#39;s Tales converted to PDF. It is the last, and largest, of his books. Just pecking away at it slowly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Halo%20Poser%20and%20Pinup%20Guide-73969-1-0.rar?fid=1000225262&ttl=1535862723&ri=8192&rs=8192&setec=c4ea074e2e222b88b18700a671ddf077"
    },
    {
      "fileId": "1000227004",
      "name": "Halo Poser and Pinup Guide - v1.5",
      "version": "1.3",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "137674",
      "fileName": "Halo Poser and Pinup Guide - v1.5-73969-1-3.rar",
      "uploadedUnix": "1478357497",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/935ed00275a8a88708bd002d294423c96a52747d65bb94e2de82eb15fd96ae83/analysis/1478357559/",
      "changelogHtml": " UPDATE: 2016-11-05\r<br />- Everyone give a huge thanks to Anataron (Alex) for updating the Halo Pinup Image Guide to version 1.5 last night. Lots of new pose in Halo&#39;s mod including another set for the men&#33; Also lots of fun stuff including a lot of beach accessory related poses. The image guide is now current with Halo&#39;s current release. Can find the updates under the updates section of the files.\r<br />- Have about 1/3 of Book 4 of Grim&#39;s Tales converted to PDF. It is the last, and largest, of his books. Just pecking away at it slowly. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Halo%20Poser%20and%20Pinup%20Guide%20-%20v1.5-73969-1-3.rar?fid=1000227004&ttl=1535862724&ri=8192&rs=8192&setec=a13318c67c6fd3ef5dcb3767b1150fc5"
    },
    {
      "fileId": "1000245411",
      "name": "Grim Tales - Champion of Fenrir - Book 4",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "130549",
      "fileName": "Grim Tales - Champion of Fenrir - Book 4-73969-1-4.zip",
      "uploadedUnix": "1495891150",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/fa9a57377d7fe990a22145d69e5ce4ec228095755356433f855a84c97c472322/analysis/1495891397/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grim%20Tales%20-%20Champion%20of%20Fenrir%20-%20Book%204-73969-1-4.zip?fid=1000245411&ttl=1535862725&ri=8192&rs=8192&setec=d2da33de9d37a4b54df15d6a887724ba"
    },
    {
      "fileId": "1000270943",
      "name": "Thrynn the Rogue - RDO version",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10298",
      "fileName": "Thrynn the Rogue - RDO version-73969-1-5.7z",
      "uploadedUnix": "1524002501",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/443314e8f7d12cd4177832fb72172c30b19724b46a1a6aaa9cfe630500afce96/analysis/1524002618/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Thrynn%20the%20Rogue%20-%20RDO%20version-73969-1-5.7z?fid=1000270943&ttl=1535862725&ri=8192&rs=8192&setec=a2177ade8028cc080a4d2de0f6e6a4bf"
    }
  ]
}