{
  "modId": 740.0,
  "modName": "Skyrim Retexturing Software Tutorial",
  "summary": "A Skyrim retexturing tutorial explaining how to use BSAOpt and Gimp so that you can change the color and appearance of items in the game.",
  "descriptionHtml": "This 19-page tutorial with 21 images comes in four formats to make it so almost everyone can open and read one of them.  It comes in .wps, .doc, docx, and txt.  The first three formats have embedded images to illustrate the text, show you how the computer screens will look, and indicate what you should click next.\r\n\r\nDownload the file to read the step-by-step tutorial as it was meant to be read.\r\n\r\nThe .txt version without embedded images follows.  The images it points to are numbered and correspond to the numbered screenshots uploaded for this file.\r\n\r\n#################################################################\r\n\r\nSkyrim Retexturing Software Tutorial\r\n    \tBy David Brasher\r\n\t     V 1.0 \r\n       \t    11-19-11\t\r\n\r\n\tThe purpose of this tutorial is to help you obtain the proper software and use it to unpack Skyrim .bsa files so you can get at the .dds files and retexture them in GIMP, and then use the retextured items in .espless replacer mods for Skyrim, so that you can see your recolored items in the game.\r\n\r\n______________________________________________________________________________________\r\n\t\tObtaining Software to Unpack the .bsa Files With\r\n\r\n\tSkyrim is not like Oblivion, and the modding software for Oblivion generally does not work on the new game.  If you are wanting to retexture items for Skyrim, the first obstacle you have probably run into is that you can\\'t open the .bsa files.  You may have tried to use BSA Commander, and OBMM and gotten error messages.  Some people have succeeded  with BSA_Unpacker or FOMM but they don\\'t seem to work for everybody.  The program used in this tutorial is BSAOpt.  Download it here:\r\n\r\nBSAOpt: http://www.skyrimnexus.com/downloads/file.php?id=247\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 1\r\n*\r\n*\r\n*******************************************\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 2\r\n*\r\n*\r\n*******************************************\r\n\r\n\tAfter downloading, follow normal software installation procedures and the instructions in the wizard to install the utility.  You do not need to install it in any specific directory.\r\n\r\n______________________________________________________________________________________\r\n\t\tPreparing to Unpack the .bsa Files\r\n\r\n\tA .bsa file is a Bethesda Softworks Archive file.  It is a package of compressed resources used by  Bethesda video games.  This type of file is used nowhere else.  The way texture replacer mods work is to give the computer some special textures to use instead of the original ones.  If no new textures made by modders are present, then the game will refer to the .bsa file and use the original ones.  If you create a new texture, then the game will see it first before looking at the .bsa, and use yours instead.  To put the texture in the game back to how it was originally, if you get tired of your new texture, you will need to go to the new texture file and delete it, rename it so that the computer can\\'t find it, or move it to a directory where the computer can’t find it.\r\n\r\n\tPeople install their games in different places, so you will have to remember where you installed your game or else search for it.  The .bsa file you need to unpack will be located here:\r\n\r\n\t*Installation Directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\Skyrim-Textures.bsa  \r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 3\r\n*\r\n*\r\n*******************************************\r\n\r\n\tThe place where you will eventually install your new texture will be here:\r\n\r\n*Installation Directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\Textures\\\\*Directory*\\\\*Directory*\\\\*YourNewFile.dds*\r\n\r\n\tThe .bsa files are huge.  They take forever to unpack, and take up a lot of space on your hard drive when unpacked.  I have heard that Skyrim loads slowly if the BSA files are unpacked.  So it would probably be best to only unpack the portions you need, and put the unpacked files in a directory where the game can’t see them, someplace other than:\r\n\r\n*Installation Directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\Textures\\\\\r\n\r\n\tSo if you wanted to retexture armor, then you might want to only unpack the armor folders from the .bsa.  You can always go back and unpack more files later.\r\n\r\n______________________________________________________________________________________\r\n\t\tPlanning a Destination Folder for Unpacked Textures\t\r\n\r\n\tYou need a plan for where you are going to put your unpacked textures.  As discussed above, these files are huge, hard to move, take lots of space, and may slow the game.  My plan is to go into File Manager and build a new folder in the same directory where the .bsa files are.  This will be easy to get to, but the game will not refer to these files, and their presence should not slow it down.  When I actually edit a texture, I will put it in the directory where the game will use it.\r\n\r\n\tHere is my new folder named \\\"Unpack:\\\"\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 4\r\n*\r\n*\r\n*******************************************\r\n\r\n______________________________________________________________________________________\t\r\n\t\tUsing BSAOpt to Unpack Textures\r\n\t\r\n\tOpen BSAOpt.  Do this by double-clicking on the icon, wherever you installed it.\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 5\r\n*\r\n*\r\n*******************************************\r\n\r\n\tUpon opening BSAOpt, you will see a window like this:\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 6\r\n*\r\n*\r\n*******************************************\r\n\r\n\tSelect the .bsa folder you want to unpack by clicking the \\\"Browse\\\" button.  \r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 7\r\n*\r\n*\r\n*******************************************\r\n\r\n\tSelect Skyrim - Textures.bsa from your directories.  It will be found in a place like: \r\n\r\n*Installation Directory*\\\\Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\Skyrim-Textures.bsa .  \r\n\r\n\tThen click the \\\"Open\\\" button.  You then wait while the computer processes. \r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 8\r\n*\r\n*\r\n*******************************************\r\n\r\n\tSelect the folder you want to extract the .dds texture files to.  Click the \\\"Browse\\\" button at the bottom of the window.\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 9\r\n*\r\n*\r\n*******************************************\r\n\r\n\tSelect your destination folder.  I am going to use the new folder I named \\\"Unpack\\\" to decompress the textures to.  When you have found and selected the folder you want, click \\\"Use Folder.\\\"\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 10\r\n*\r\n*\r\n*******************************************\r\n\r\n\tClick the drop-down menu in the middle of the window to choose whether you are unpacking .dds texture files or .nif mesh files.  We are doing .dds files in this tutorial.\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 11\r\n*\r\n*\r\n*******************************************\r\n\r\n\tIt is now time to select what files to unpack.  You might not want to have to wait a long time while the computer is processing or may not want to fill your hard drive up with a bunch of stuff.  You could just jump in and press \\\"Convert\\\" right now to extract all the textures, but I will show you how to limit what you unpack to what you really want and need.\r\n\r\nStep 1: Check the \\\"Show Recursive\\\" box to expand directories and see files in files.\r\n\r\nStep 2: Select the file that includes all the other files.  The one at the top of the directory.  In this case it is \\\"textures.\\\"  Click the red X icon to deselect all the textures all at once. \r\n \r\nStep 3: Find the directory that contains the textures you want to extract.  You can use the green check icon to select everything in a directory at once, or you can select individual files to check.\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 12\r\n*\r\n*\r\n*******************************************\r\n\r\n\tIn my example, I only want to unpack the armor textures right now.  So after deselecting all the textures in the last step, I select the armor folder, click the green checkmark to select everything in that folder, click the \\\"Convert\\\" button and then wait around a good long time for the computer to process if I have selected a lot of textures\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 13\r\n*\r\n*\r\n*******************************************\r\n\r\n\r\n______________________________________________________________________________________\r\n\t\tObtaining Free Software to Edit Textures\r\n\r\n\r\n\tIf you don’t have Photoshop or some other program already, than you need GIMP.  Download it here:\r\n\r\nGIMP:  http://getgimp.com\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 14\r\n*\r\n*\r\n*******************************************\r\n\r\n\tBut .dds texture files are weird and only certain video games use them.  So in order to make this fine general-purpose image editor work for Skyrim, you need to download an additional plugin:\r\n\r\nGimp-dds plugin:  http://code.google.com/p/gimp-dds/downloads/detail?name=gimp-dds-win32-2.0.9.zip&can=2&q=\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 15\r\n*\r\n*\r\n*******************************************\r\n\r\n\tDownload and install whatever software you don\\'t have and then you can do the retexturing.\r\n\r\n\r\n___________________________________________\r\n\t\tRetexturing In GIMP\r\n\r\nThis tutorial is primarily about getting the software set up for rexturing Skyrim.  So the part of the tutorial with the actual retexturing moves fast and assumes you know how to do this stuff or can learn elsewhere.  It will just use one example and won\\'t exhaustively cover all the steps.  This part of retexturing is very much like what you would do for retexturing in Oblivion.  There are many tutorials available.  Here is the link to one:\r\nhttp://cs.elderscrolls.com/constwiki/index.php/Better_Retextures_:_Detailed_Guide_For_NifSkope_and_the_GIMP\r\n\r\n\tIgnore what Oblivion tutorials say about NifSkope and just read what they say about GIMP, because this is Skyrim, and Nifskope does not currently work with it.\r\n\r\n\tWhen ready, find a .dds texture file to open and retexture with GIMP.\r\n\r\n\tDon\\'t  load mipmaps.  Uncheck that box.\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 16\r\n*\r\n*\r\n*******************************************\r\n\r\n\tFor my sample in this tutorial, I am going to take the iron helm that the hero wears in the Skyrim trailer and make the metal darker, the horns lighter in color, and the lining bright red.  There are all sorts of techniques you can use in GIMP.  I will just show you one really fast and easy one.\r\n\r\n\tClick the freeform lasso icon and draw a line all the way around the area you want to change with filters.  This area will now have a flashing dotted line around it and will stay selected until you do something to unselect it.  Here I have selected the metal.  I want to make it darker.\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 17\r\n*\r\n*\r\n*******************************************\r\n\r\n\r\n\tGo to Colors> Hue-Saturation:  Play around with the \\\"Hue\\\", \\\"Lightness\\\", and \\\"Saturation\\\", slider bars.  When you like how your selection looks, click \\\"OK.\\\"\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 18\r\n*\r\n*\r\n*******************************************\r\n\r\n\tTo deselect an area you have lassoed, you can use CTRL+SHIFT+A.  \r\n\r\n\tTo make the metal darker, I moved the Lightness lever and the Saturation lever further to the left.  I did not touch the Hue lever.  To recolor more stuff, select other areas the way you did the first one.  I am going to make the horns of the helmet lighter and the liner bright red.\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 19\r\n*\r\n*\r\n*******************************************\r\n\r\n\tHere is my finished texture.  Be sure to save your work. \r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 20\r\n*\r\n*\r\n*******************************************\r\n\r\n______________________________________________________________________________________\r\n\t\tPlacing Your New Texture in the Proper Directory\r\n\r\n\tNow you need to put your texture into the proper directory so that the computer will use it instead of the one in the .bsa.  Remember that this is a replacer type of mod, and that it will overwrite what was there before.  So you may want to make a backup.  For texture replacer mods without plug-ins, the names of files and their directory structure must remain exactly the same as you found them.  For other types of mods, you will rename your new textures, put them in any directory you feel like, and have the items in the game that use your textures be available alongside other items with the texture edited differently.  For example, there could be a brown shield, red shield, and blue shield.  But with the naming procedures used in this tutorial, you would only be able to choose one color of shield, and all the shields of this type in the whole game world will be that color. \r\n\r\n\tTo put the new texture into the proper folder, you may need to refer to the directory structure of the unpacked bsa or look in BSAOpt again.  For my iron helmet, it needs to go to:\r\n \r\ntextures\\\\armor\\\\iron\\\\m.  \r\n\r\n\tNote that I did not list anything before \\\"textures.\\\"  This is important.  When packaging files for upload, you should not go back any further than \\\"textures\\\" or \\\"data.\\\"  These directories are common to all Skyrim users.  But people have their software installed different ways.  Mine is like:\r\n\r\nC:\\\\Games\\\\Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\armor\\\\iron\\\\m\r\n\r\n\tBut other people might have theirs set up like\r\n\r\nE:\\\\Program Files\\\\Skyrim\\\\SteamApps\\\\common\\\\skyrim\\\\Data\\\\textures\\\\armor\\\\iron\\\\m\r\n\r\n\tThere are thousands of possibilities.  So your directory structure will be easiest for downloaders to use if you follow this advice.  And it becomes absolutely essential to follow this advice when you use things like Nifskope and Blender because otherwise you will make missing textures in your mod that casual gamers will have no way to fix.\r\n\r\n\r\n*******************************************\r\n*\r\n*\r\n*\tRefer to image 21\r\n*\r\n*\r\n*******************************************\r\n\r\n______________________________________________________________________________________\r\n\t\tGo Play Skyrim!\r\n\r\n\tSo now that you have placed your new texture properly, you can play-test your work in-game.\r\n\r\n\tHave fun with your new toy!\r\n\r\n\r\n\r\nContact Information:\r\n\tTo submit feedback and report errors found in this tutorial, contact David Brasher on TES \tNexus.\r\n\r\nCredits: \r\n\tbilarion for elucidating unpacking procedures.\r\n\tThe makers of BSAOpt, and GIMP for their fine software.\r\n\tBethesda for Skyrim.",
  "categoryId": "82",
  "version": "1.0",
  "author": "David Brasher",
  "createdUnix": "1321754719",
  "updatedUnix": "1321819958",
  "containsAdultContent": false,
  "uploadedBy": "David Brasher",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1860",
      "name": "Skyrim Retexturing Software Tutorial 1_0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1716",
      "fileName": "Skyrim Retexturing Software Tutorial 1_0-740.7z",
      "uploadedUnix": "1321754937",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d733be2486c2c2e776acf2690eefb11b32d09b98eeb0246ec3221ac28c2a010f/analysis/1406423884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Retexturing%20Software%20Tutorial%201_0-740.7z?fid=1860&ttl=1535753849&ri=8192&rs=8192&setec=4ce2fc328963f53bf46257be416688a3"
    },
    {
      "fileId": "2079",
      "name": "Skyrim Retexturing Tutorial PDF 1_0 Courtesy of Jahooba",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1582",
      "fileName": "Skyrim Retexturing Tutorial PDF 1_0 Courtesy of Jahooba-740-1-0.7z",
      "uploadedUnix": "1321819958",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d235c9a41ac454fecaece2a0076c4e2ebbd89bb44295a78b7ca1c0e34ae420df/analysis/1406426344/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Retexturing%20Tutorial%20PDF%201_0%20Courtesy%20of%20Jahooba-740-1-0.7z?fid=2079&ttl=1535753850&ri=8192&rs=8192&setec=05dd4d6740621f00b29dc73a50f691eb"
    }
  ]
}