{
  "modId": 74011.0,
  "modName": "LotD player wardrobe spells",
  "summary": "Patch/Addon for Legacy of the Dragonborn adding remote access to the player wardrobe",
  "descriptionHtml": "This is a small patch/addon for Legacy of the Dragonborn which adds two spell tomes into the Safehouse. Use of these tomes will grant the player the ability to manage the DovahCloset wardrobe feature whilst out in the world.\r<br />\r<br />Once installed you will find the two spell tomes laying open on your desk in the Safehouse bedroom (by the door leading to the hotsprings). Using the tomes will add two new abilities as lesser powers:\r<br />\r<br /> - Store Outfit (this will open the menu to remove your currently equipped gear back to the DovahCloset)\r<br /> - Change Outfit (this will open the menu to select a new outfit from the DovahCloset)\r<br />\r<br />\r<br />[b][u]Why?[/u][/b]\r<br />\r<br />As much as I love the DovahCloset, I found it impractical to keep returning to base every time I wanted to change outfits - and I&#39;m sure I am not the only one, hence the upload :)\r<br />\r<br />Adding these spells was a simple way to make this feature available for the adventurer on the go. Some may say it is not immersive to magically store/retrieve gear from a container far away, I say it&#39;s really not that much of a stretch in a world with the magical capabilities of the ES universe :p\r<br />\r<br />\r<br />[b][u]Why not a standalone mod?[/u][/b]\r<br />\r<br />In short; because the DovahCloset included in the latest versions of LotD has all the required features and works as one expects it to. I have neither the time nor desire to duplicate a perfectly good feature from an existing mod purely to gain appeal to a wider audience - this was made for personal benefit and is being shared as a courtesy to the community, so sorry to those of you who don&#39;t use LotD (for shame&#33;) but this is the way it is.\r<br />\r<br />\r<br />[b][u]Requirements:[/u][/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/52248/?]Legacy of the Dragonborn[/url]... obviously&#33; This addon was created and tested with the latest version (15.2) of LotD so that is recommended, though I see no reason it shouldn&#39;t work with earlier versions which also incorporate the DovahCloset (or even those using the independent DovahCloset addon).\r<br />\r<br />\r<br />[b][u]Installation:[/u][/b]\r<br />\r<br />Install via NMM or by manually extracting the archive then drag/drop the .esp & .bsa to your data directory. \r<br />\r<br />NB: The .bsa includes meshes & textures for the books although these should already be included with LotD.\r<br />\r<br /> (presumably MO friendly too but not tested since I don&#39;t use that one - if someone wants to test install with MO and inform me I can update here accordingly)\r<br />\r<br />\r<br />[b][u]Credits:[/u][/b]\r<br />\r<br />Icecreamassassin for the amazing mod to begin with as well as the continued support & development shown to it since release.\r<br />lofgren & JetSteele for assistance in troubleshooting the scripts in this mod for me\r<br />\r<br />\r<br />[b][u]Conflicts / bug reporting:[/u][/b]\r<br />\r<br />Whilst none are expected, there is always a possibility. Anything reported will be updated here upon confirmation, though I must insist that any issues reported here relating to LotD or the DovahCloset should be directed to the source of those mods. This page is purely for the spells :)",
  "categoryId": "75",
  "version": "1.0",
  "author": "L",
  "createdUnix": "1457174130",
  "updatedUnix": "1457174031",
  "containsAdultContent": false,
  "uploadedBy": "LegacyCloud",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000198214",
      "name": "Legacy Outfitter",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "365",
      "fileName": "Legacy Outfitter-74011-1-0.7z",
      "uploadedUnix": "1457174031",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/531afa5ea8229bf9a34d1ee96864fa6a3f908602976e2a2919be6af9128a57b2/analysis/1457174048/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legacy%20Outfitter-74011-1-0.7z?fid=1000198214&ttl=1535862758&ri=8192&rs=8192&setec=0620de16d15a98f46d875ab3dc3a4c0c"
    }
  ]
}