{
  "modId": 74085.0,
  "modName": "Skyforged- no more smithing",
  "summary": "Don&#39;t want to smith? Skyforged adds tiered, pre-improved weapons and armor into blacksmiths&#39; inventories.",
  "descriptionHtml": "OVERVIEW:\r<br />\r<br />Skyforged is a simple mod for anyone who finds smithing tedious, or does not want their character to be a smith for role-play reasons, but still wants to take advantage of the massive improvements to weapons and armor that the smithing skill affords. It adds tiered pre-improved weapons and armor into the inventories of selected blacksmiths across Skyrim, up to the level of super-legendary. The value of these items has also been adjusted accordingly. These items cannot be improved further, as they have already been stamped with their maker&#39;s mark.\r<br />\r<br />A few observations which inspired this mod:\r<br />1) Why is the dragonborn the only person in Skyrim capable of operating a grindstone or workbench? The blacksmiths are always sandboxing on these objects, but it never seems to have any effect&#33;\r<br />2) Why is everyone always going on about Eorlund Gray-Mane being the best blacksmith in Skyrim, when he doesn&#39;t offer anything better than any other blacksmith?\r<br />3) Why can&#39;t an immensely wealthy level 1 nobleman buy a bad-ass super-sharp sword if the whim takes him?  Do the blacksmiths hide their awesome weapons under the counter and only offer them to seasoned veterans? Nonsense&#33; If you&#39;ve got the gold, they&#39;d sell it to you&#33;\r<br />4) Skyrim as a nation is all about STEEL. In dialogue, the blacksmiths of Skyrim refer exclusively to working steel, thus I have only placed pre-improved steel weapons and armor into the game. Sorry if this bothers you, but it is both lore-friendly and far easier for yours truly.\r<br />\r<br />To determine maximum weapon and armor upgrades, I have referred to the UESP smithing page, which says &#34;With a base skill of 100, the relevant perk, four 29% enchantments, and a 130% potion, one&#39;s effective skill equals 874.84, which yields a bonus of +92 to armor and +46 to other items&#34;. I have also used the base damage and value of dragonbone weapons as my point of reference to ensure that you can still have &#34;the best weapon in the game&#34; without having to smith it yourself. As you might expect, these items can be enchanted. At the moment, all bladed weapons have 6 tiers of upgrade, but blunt weapons, bows and armor have only the maximum upgrade. (I will probably add tiers for these as well, eventually, but I am less motivated as I don&#39;t use them myself.)\r<br />\r<br />I have decided to leave it to you to find the improved weapons and armor, as I personally find it fun to discover new modded items by chance. However, for the avoidance of doubt, I can confirm that Eorlund Gray-Man IS the best blacksmith in Skyrim.\r<br />\r<br />INSTALLATION:\r<br />\r<br />Download with Nexus Mods Manager (NMM) and activate, or download manually and copy the .esp file into your skyrim/data folder.\r<br />\r<br />Requires SKSE.\r<br />\r<br />UNINSTALLATION:\r<br />\r<br />Deactivate and remove with NMM, or delete the .esp file from your skyrim/data folder.",
  "categoryId": "36",
  "version": "",
  "author": "LioraValkyrie",
  "createdUnix": "1457446791",
  "updatedUnix": "1457446611",
  "containsAdultContent": false,
  "uploadedBy": "fnbrown",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000198680",
      "name": "Skyforged",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Skyforged-74085-.7z",
      "uploadedUnix": "1457446611",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7c4ca0ff436066dada5c101628d566be0067bf7cff2e2c5a386b6ba0b1096f6c/analysis/1457446624/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyforged-74085-.7z?fid=1000198680&ttl=1535862840&ri=8192&rs=8192&setec=584130b2dcf6cc7fd00e0fcb531ce941"
    }
  ]
}