{
  "modId": 74102.0,
  "modName": "Skyrulianfield",
  "summary": "Adds a massive army of nocturnal zombies ghosts and skeletons that stalk the player if you forget to equip a torch while walking around at night at most places outside of cities. This makes exploring at night, frightening and dangerous. Most undead are numerous yet weak, the less numerous giant skeletons are very powerful, ghosts immune to normal w",
  "descriptionHtml": "[b][color=#00ffff][color=#ff0000]Note: A mod that makes all named NPCs protected/Essential is extremely recommended for this mod.  NPCs Protected Redux or Everyone is Essential - NPCs Protected I feel are a NEARLY mandatory combo for this mod, unless randomly dying named NPCs doesn&#39;t bother you. I then recommend you get Killable Essential Characters. Killable Essential Characters makes it where you can kill essential characters by power attacking them while they&#39;re on the ground. Anyways moving on...\r<br />[/color]\r<br />Suggested version: [b][color=#00ffff]If you have DLCs I recommend you DL SkyrulianFieldLuxuryEdition if you only have vanilla Skyrim I recommend downloading \r<br />SkyrulianFieldRedoneVanilla (Vanilla doesn&#39;t have the new lantern feature though, nor does it have the self res/fast respawn scripts).[/color][/b] More on suggested versions below in green text. As the best version for you... Does depend a lot on your individual tastes and preferences. \r<br />\r<br />Note: My mod does not alter vanilla Undead at all my Undead stalkers are different from vanilla undead.\r<br />\r<br />Update new: SkyrulianFieldLuxuryEdition released&#33; New feature added: Place Warding Lantern power added. This lantern will for 24 hours ward off the undead stalkers, HOWEVER, if you travel too far from the lantern as in travel more than 4096 units, or change a cell, or 24 hours pass the lantern will disappear and the undead stalkers will start hunting you down again. This new mechanic was created because the stalkers weren&#39;t supposed to follow the player inside of cities or inside their homes. Because of it being a GREATER POWER however, you&#39;re STILL probably gonna need some torches if you TRAVEL AROUND at night. [b]As you can only place down the lantern once every 24 hours.[/b]\r<br />\r<br />You can now FINALLY add a lantern to your home, or camp, to finally have somewhere to safely sleep or barricade yourself into, however of course, traveling at night is still going to be terrifying and dangerous, cause you can&#39;t take that lantern with you everywhere, and what with normal weapon immune ghosts, incredibly strong giant skeletons, and legions of weaker zombies, night exploration will still be very very dangerous if you don&#39;t take torches with you... And I trust your definition of &#34;Night Exploration&#34; isn&#39;t just exploring a single cell all night long.[/color]\r<br />[color=#00ffff]\r<br />Other new features... \r<br />\r<br />The AMOUNT of undead stalkers has been reduced with a smaller but still terrifyingly large legion of the dead, who utilize scripting to be both easier on the computer, more immersive, and more frightening. All skeleton stalkers with shields will upon death res themselves in 35 seconds if you don&#39;t flee the cell they&#39;re in before ressing. If you manage to flee in time they respawn in 10 minutes, the other undead cannot self res and instead quick res in 10 minutes if in the same cell or 20 if in another cell. All undead stalkers now disappear around 7-8 AM and are re-enabled at around 8-9 PM, though they start stalking the player at 11 PM. It takes about 32 seconds for the parent enabler marker to calculate the time of day- this is so because a script updating too frequently can be bad thing, so please exercise a tiny bit of patience. Also the giant skeletons do respawn BUT much much slower they take days/weeks or longer to respawn they have no fast respawn script.\r<br />[color=#00ff00]\r<br />[/color][/color][color=#00ff00]Lastly let me tell you the differences between the three newest esps, which I recommend for you, and why.\r<br />\r<br />Nightmare has RIDICULOUSLY powerful giant skeletons, like... Probably way more powerful than is lore friendly, and near impossible even for a stat stacking endgame powergamer pro to defeat- at least in theory. Plain ol Luxury Edition still has them very powerful- however an endgame character maxed melee stats and with the best gear AND wielding silver weapons or Dawnbreaker can kill these giant skeletons very very fast, not quite a one shot but close. And in Easymode there ARE NO giant skeleton stalkers.\r<br />\r<br />Regular Colossal Skeletons: 9000 health, 0 mitigation, 100 speed. 180% attack bonus. \r<br />Nightmare Colossal Skeletons: 227k health, 50% mitigation, 120 speed, 260% attack bonus,\r<br />Nightmare Giant Burning Skeleton: 231k health, 95% mitigation, 130 speed, 390% attack bonus.\r<br />\r<br />All modes: [b]4x weakness silver/8x weakness Dawnbreaker[/b], normal weapon immune ghosts.\r<br />\r<br />[b]SkyrulianFieldLuxuryEdition[/b]Nightmare: If you enjoy the thought of likely never being able to fight back against giant skeletons, being forced to flee fights you can&#39;t win, or you just want the hardest foes possible then maybe you&#39;ll like this mode... If you love being forced to flee some fights and not being able to kill everything, or if you just want some of the strongest foes imaginable.\r<br />\r<br />SkyrulianFieldLuxuryEdition: THIS is the version I made for myself and people with similar tastes I highly recommend this version. I consider it to be more exciting than Easy, but also more lore friendly than Nightmare, and I find eventually being able to defeat the skeletons a nice prospect.\r<br />\r<br />[b]SkyrulianFieldLuxuryEdition[/b]Easy: If super strong giant skeletons bother you because they&#39;re not your idea of fun, you prefer swarms of weak undead only, you&#39;re easily frustrated, or you think the giant skeletons are too powerful to be lore friendly then go ahead and choose this version,[/color]\r<br />[color=#00ff00]\r<br />Non-TLDR I recommend the one in the middle, but if you think easy or nightmare is right for you then go for it.\r<br />\r<br />[/color][color=#00ff00]If you&#39;re melee and want to be strong enough to realistically KILL Colossal Skeletons/Giant Burning Skeletons wait until your gear/stats are maxed out/at end game tier then get a Silver sword/Dawnguard, if you&#39;re a Thief or Archer type then simply download cat_woman1989&#39;s Silver Bows and Silver Arrows. If you&#39;re a mage then you will need maxed out Destruction, a very high Magicka pool, maxed out fire perks, and to craft a Divine Fireball tome to craft something strong enough that specifically counters Colossal Skeletons. Do note, that this spell tome is created via a tanning rack, it requires 1 fireball tome, 2 filled grand soul gems, and 10 bonemeal to make. Do note however, even though Colossal Skeletons are extremely hard to kill, they are very easy to temporarily banish so long as you have the required supplies. Have a Banishing Torch ready and they will be gone for about two real time minutes, giving you plenty of time to escape.[/color]\r<br />\r<br />[color=#00ff00]In normal mode you are intended to eventually have your silver bows/silver swords/divine fireball become so powerful endgame that eventually you can actually realistically defeat Colossal Skeletons, in Nightmare mode you&#39;re not meant to be able to become powerful enough to actually likely be able to eventually kill them. So in that sense, Regular Luxury version is like a classic RPG where you eventually become strong enough to outright kill them, where as Nightmare Mode is more like a horror game where there are some things you can&#39;t realistically kill. Do realize it&#39;s just as easy to BANISH them in Nightmare Mode, just they have way more health, are faster, and hit even harder.[/color]\r<br />[color=#00ff00][b]\r<br />Also FYI Divine Fireball does not exist in Easy mode, as it was specifically designed to provide a way to stand a higher chance of killing Colossal Skeletons who don&#39;t exist in Easy mode.[/b] Also DO NOTE, that Divine Fireball other than it&#39;s AOE is for the most part worse than the default Fireball, it does 20 more damage but is far more magicka inefficient and the bonus damage that makes it able to one shot Colossal Skeletons ONLY works on Colossal Skeletons, against ordinary undead it only does about 28 more damage, and against regular enemies it only does 8 more damage. This combined with it&#39;s Magicka inefficiency ensures it won&#39;t be overpowered or imbalance or break the game.[/color]\r<br />\r<br />[color=#ff00ff]New Spell: Divine Fireball radius of 45 feet, costs 900 Magicka without spell reduction. Does 68 damage to ordinary undead, and 677 extra damage to Colossal skeletons. Does only 48 damage to most targets. With the vanilla fire damage perk it does enough damage to two shot a Colossal Skeleton... Hence why it is so expensive in Magicka cost, and why it requires Master in Destruction. This creates an anti undead specialized spell that won&#39;t break or imbalance other mods or the vanilla game, because the damage bonus is so small/it&#39;s so inefficient, but at the same time will provide a way for endgame mages to be able to eventually be strong enough to be able to realistically outright kill Colossal Skeletons... Least outside of nightmare mode, and melee/archers don&#39;t have a realistic chance of actually killing them in Nightmare mode either.[/color]\r<br />\r<br />Update: Due to unpredicted bugginess the mechanics have changed just a tiny bit. You see, the zombies NEED to have a follow player function for this mod, yet that follow player function can get buggy, as in make encounters a bit random at times. To alleviate this issue, and try to make that randomness more fun/immersive/entertaining and less of a pain to deal with, I altered the torch mechanics a little bit.\r<br />\r<br />The SkyrulienFieldRedoneDLC requires Dragonborn, and it adds said undead stalkers to the island of Solstheim as well. Remember- ONLY use ONE esp at a time&#33;\r<br />\r<br />Carrying a regular torch severely reduces the chances of encountering them, but because of the way follow packages work changing cells can still make them show up, hence I created a new type of torch that banishes them for three minutes. You now have a spell to turn Regular Torches into Banishment Torches- and a spell to turn Banishment Torches back to regular torches, said Banishment torches have about a 88% chance to banish the hostile zombies for 180 real times seconds but also have a 40% chance to break each strike. \r<br />\r<br />I wanted a &#34;sweet spot&#34; where they came back quickly enough to add to suspense, but also to allow a chance of escape. I added a little bit of RNG to also add to unpredictability and make these encounters with said undead stalkers feel more dramatic. Sometimes you have to swing the torch more than once&#33; Almost always just twice and usually just once though. And the chance of breaking means you have to carefully monitor your torches collection and replenish them fairly frequently.\r<br />\r<br />You have to hold them in the left hand or else the visuals get buggy though (regretfully, I&#39;m not good with nifskope, and if someone is willing to upload me a version of the torch that can be wielded with the right hand, I&#39;ll cooperate use it for this mod, but I&#39;m just simply not good with Nifskope so sorry about that for now). Also I slightly improved the follow package by making it where these hostile undead probably won&#39;t follow players who are in the Necromancer faction. The giant skeletons also have a bit of a more prominent weakness to silver weapons as well as Dawnbreaker.[/b]\r<br />\r<br />Adds a massive army of nocturnal zombies ghosts and skeletons that stalk the player if you forget to equip a torch while walking around at night at most places outside of cities. This makes exploring at night, frightening and dangerous. Most undead are numerous yet weak, the less numerous giant skeletons are very powerful, the ghosts immune to normal weapons. With optional harder nightmare mode. Be forewarned the giant skeletons on nightmare mode are extremely powerful, to the point even a very powerful player character is suggested to just run away from them, it&#39;s called nightmare mode for a reason.\r<br />\r<br />\r<br />Most undead are numerous yet weak, the less numerous giant skeletons are very powerful, the ghosts immune to normal weapons.  The only places these undead won&#39;t follow you is into any town, city, store, temple, stewards dwelling, player house, orc stronghold, jail, inn, minor hold, major hold, castle, barrack, guild headquarters, city, barracks, military camp or military fort. Most of the undead are just regular mobs that stalk the player at night if you forget your torch and go too far from safer locations, though a few are colossal skeletons who are very very powerful, nightmare mode makes the colossal skeletons even more powerful doubling their massive health pool and giving them even higher damage. A Massive Burning Skeleton appears only on Fridays, that is a more powerful version of the Colossal Skeleton. Oh and if these undead for whatever reason somehow end up in sunlight, the damage from the sun will kill them.\r<br />\r<br />Recommended mods to combine with this include Scary Ghosts which make all ghosts immune to normal weapons, darker nights, and anything that makes undead thingies look more scary... I also highly highly recommend NPCs protected redux so the undead things don&#39;t kill named NPCs. Their tendency to avoid cities helps, but they are numerous, and some of them quite powerful, so I highly suggest something like NPCs Protected Redux mod to be combined with this mod just in case. Yes this mod is at least partially inspired by the Hyrule field in Zelda with the skeletons that attack you at night time in Ocarina Of Time for instance, and and perhaps a few other games not to mention numerous movies and stories where scary things come out at night.\r<br />\r<br />I also HIGHLY HIGHLY HIGHLY recommend you get the Craftable Torches mod, by [url=http://www.nexusmods.com/skyrim/users/477734]bluedanieru[/url]. \r<br />\r<br />Night time in Skyrim never felt scary enough to me, torches never felt important enough, and I wanted Skyrim to feel a little bit more like a scarier survival game, hence I created this mod. It always did feel strange to me that the undead didn&#39;t seem to journey around at night.",
  "categoryId": "24",
  "version": "",
  "author": "Lectra",
  "createdUnix": "1457531046",
  "updatedUnix": "1473643236",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000198746",
      "name": "SkyrulianField",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "135",
      "fileName": "SkyrulianField-74102-.7z",
      "uploadedUnix": "1457530985",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/b6d38452305098306688ed29a35036e37dbd424802241587372ad20f5409a049/analysis/1457531043/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrulianField-74102-.7z?fid=1000198746&ttl=1535862857&ri=8192&rs=8192&setec=99b0fff1cda847b8fa47672a6a398574"
    },
    {
      "fileId": "1000198747",
      "name": "SkyrulianFieldNightmareMode",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "135",
      "fileName": "SkyrulianFieldNightmareMode-74102-.7z",
      "uploadedUnix": "1457531042",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0c8ab10a176f5fc73584a9061e84be893d6216d34d551eec53d4edcbd2c2dc13/analysis/1457531103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrulianFieldNightmareMode-74102-.7z?fid=1000198747&ttl=1535862857&ri=8192&rs=8192&setec=a1e4057bdbb2c51a7ccd3ad93aa87277"
    },
    {
      "fileId": "1000213697",
      "name": "SkyrulianFieldRedoneVanilla",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "185",
      "fileName": "SkyrulianFieldRedoneVanilla-74102-.7z",
      "uploadedUnix": "1468905253",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1ac85e08a398dade9c913d6a1393dac005cf8f3588ee7aca5f9f421058b24011/analysis/1468905303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrulianFieldRedoneVanilla-74102-.7z?fid=1000213697&ttl=1535862858&ri=8192&rs=8192&setec=cfd515bb7263b1b314a44a70a1524885"
    },
    {
      "fileId": "1000213703",
      "name": "SkyrulianFieldRedoneDLC",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "241",
      "fileName": "SkyrulianFieldRedoneDLC-74102-.7z",
      "uploadedUnix": "1468909442",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3fb5aaa39b3373ef0a0d1f37c3138f5e0777a99f12d30b7a8cb7049672ae081e/analysis/1468909504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrulianFieldRedoneDLC-74102-.7z?fid=1000213703&ttl=1535862858&ri=8192&rs=8192&setec=fa07713acbe27faab6f1320b8bf10c8b"
    },
    {
      "fileId": "1000220282",
      "name": "SkyrulianFieldLuxuryEditionEasy",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "268",
      "fileName": "SkyrulianFieldLuxuryEditionEasy-74102-.7z",
      "uploadedUnix": "1473509382",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7d2721bd52cc66f39945233e5a9231f9c66d2c34c8dd56799385acade02f4364/analysis/1473509404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrulianFieldLuxuryEditionEasy-74102-.7z?fid=1000220282&ttl=1535862859&ri=8192&rs=8192&setec=0588d4951d27d0e7c1fbe92b2c35d894"
    },
    {
      "fileId": "1000220462",
      "name": "SkyrulianFieldLuxuryEdition",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "274",
      "fileName": "SkyrulianFieldLuxuryEdition-74102-.7z",
      "uploadedUnix": "1473642755",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/37b40593eb1eca4c242f287100a14efebfd48229d3e89cb3b4b5a85b4e0adfa6/analysis/1473642789/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrulianFieldLuxuryEdition-74102-.7z?fid=1000220462&ttl=1535862859&ri=8192&rs=8192&setec=2a85b3627e91d1a735fe21af74e01a19"
    },
    {
      "fileId": "1000220463",
      "name": "SkyrulianFieldLuxuryEditionNightmare",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "274",
      "fileName": "SkyrulianFieldLuxuryEditionNightmare-74102-.7z",
      "uploadedUnix": "1473643236",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e5b5b44d31d53709e80d3da1e412c84a78904c9cbcd831644907ef7deb0dfe05/analysis/1473643262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrulianFieldLuxuryEditionNightmare-74102-.7z?fid=1000220463&ttl=1535862860&ri=8192&rs=8192&setec=fc9bfef72cfff64f1cc35f626a02725d"
    }
  ]
}