{
  "modId": 74106.0,
  "modName": "Land of imagination (scenario)",
  "summary": "This is just scenario. It was written for Shard of oblivion mod. Sadly, developers of that mod decide to implement something different, so now you may read it as a tale or novel.",
  "descriptionHtml": "This is just scenario.\r<br /> It was written for Shard of oblivion mod. Sadly, developers of that mod decide to implement something different, so now you may read it as a tale or novel.\r<br />\r<br />Sorry for my English. It is REALLY BAD. Any help would be appreciated.\r<br />\r<br /> And I hope you enjoy&#33;\r<br />\r<br />\r<br />[color=#ff0000][size=3]\r<br />[/size][/color][center][/center][center][color=#ff0000][size=3]LAND OF IMAGINATION, LIES AND LOST SOULS[/size][/color][/center]\r<br />Characters:\r<br />\r<br />H – main Hero (Player)\r<br />P – princess, looks like arrogant beautiful young woman in white shining closes\r<br />S – skeever, looks like skeever, friendly to H :)\r<br />T – trader, looks like mid-age trader (on his mind)\r<br />E – Eleesse, looks like beautiful woman with red hair and scared face\r<br />Ta – Tahr, looks like old man in dirty rags\r<br />So – sorcerer, looks like sly sorcerer\r<br />G – grimalkin, looks like old woman in rags\r<br />L – little skarji, looks like skarji-baby\r<br />B – beggar, looks like poor girl in dirty closes\r<br />O – owner of the Tavern in Land of thieves, looks like tavern owner, nothing special\r<br />Z – Zangief, looks like Zangief :) … huge goon with a big hummer\r<br />N – necromancer, keeps entrance to Pyramid, looks like necromancer\r<br />\r<br />Locations:\r<br />\r<br />Deserted land – deserted area with no enemies and a tower with P waiting for H inside\r<br />Land of great warriors – area, filled with shrines, altars, monuments and statues; populated with extreme tough enemies\r<br />Temple of atonement – building in center of Land of great warriors\r<br />Land of garbage – area, filled with trash and ruins\r<br />Circle of lies – area, containing circular wall and monuments (grave stones or standing stones or something like that)\r<br />Land of forgiveness – area, looking like labyrinth\r<br />Land of thieves – land, populated with relatively weak enemies (thieves)\r<br />Tavern of thieves – tavern or saloon located in the Land of thieves\r<br />Pyramid – area with pyramid (must have a way in and a way out)\r<br />\r<br />Main concepts:\r<br />\r<br />Oblivion located on islands, floating in thick fog.\r<br />\r<br />Though some NPC may frighten H, it&#39;s not possible to fail Oblivion. H isn&#39;t limited by time, when defeated H respawns somewhere on the same area. Oblivion should be playable without saves.\r<br />\r<br />When H respawns, he may lose part of his inventory in place he was defeated (except what he wears, soul gem and skarji-dagger).\r<br />\r<br />Because Oblivion isn&#39;t real, it is not possible to bring something to or from the Oblivion except spells (these are in fact knowledge) and Skarji-dagger.\r<br />\r<br />Most NPCs in Oblivion wear very simple rough closes (not armor) and fight with basic weapons (like clubs or daggers) or with bare hands. Exception is Great warriors, who are well armed and wear heavy armors.\r<br />\r<br />When H enters new area or defeated, he may not appear like he was teleported, but instead he may stand up from the ground like he is waking up.\r<br />\r<br />Name of Egypt`s god of all dead Anubis may be changed to something more relevant (to Skyrim).\r<br />\r<br />\r<br />Episodes:\r<br />\r<br />[Meeting Shaman]\r<br />\r<br />H heard from someone, that there is a land or place, called Oblivion, where spell of Absolute calm is hidden. This spell freezes everything around caster (literally). There is also beautiful P, ruling that place or held there against her will (it is unclear). So, ultimately H finds a Shaman, who made a special potion from poison of all snakes, moon sugar and cocaine (you may choose your own recipe), and after giving to H enough of that soup, sends him wandering dirty cave.\r<br />This is where H enters the world of Oblivion (“drunk” shader would be handy).\r<br />\r<br />Q&A:\r<br />\r<br />If H asks Shaman about Oblivion, Shaman says that Oblivion is in fact a dream, the worst dream, dream you cannot awake from. And when you are waking up from that dream, you find yourself … 7still dreaming.\r<br />\r<br />\r<br />BTW:\r<br />\r<br />Shaman has a problem with his dog, that was recently attacked by lynx. Dog will barely survive.\r<br />\r<br />\r<br />[Deserted land]\r<br />\r<br />H finds himself in a Deserted land. This area is relatively dark. The whether is dry, but H may hear thunder-peals.\r<br />Dead trees, land, carved with deep canyons and empty rivers. Rivers are full of moodcrabs. Angry, but not following H. H has nothing: no inventory, no armor or weapons.\r<br />\r<br />There is nothing noticeable around, except broken tower with a bright light inside. This is where H meets P – a beautiful girl in shining clothes. She is arrogant about H. She saw a lot of such adventurers, seeking for treasures, secrets potions and spells, other useful and not very useful things. All of them are either thieves or just idiots. Most of them remain here forever.\r<br />\r<br />P: A new adventurer just arrived &lt;sarcasm&gt;.\r<br />\r<br />When she asks about what H is doing here, and H says about Absolute calm spell – she begins laughing.\r<br />\r<br />P: Ok, you really need it because it is a key to exit from here, but the problem is that this artifact is kept in Temple of atonement in the very center of the Land of great warriors – the most guarded place in the Oblivion.\r<br />It will be intriguing to see, how you steal from there, but first you need to remove from yourself your thief-aura. Then Great warriors will, at least, not attack you on sight. To do this, pass the Land of great warriors and find in Land of garbage someone, who will help you making your aura better. But remember, these warriors are extremely tough guys who HATE thieves, they call them “Skeevers”. So, hide better… and move faster. And hurry, you can get out of here while your body is physically alive, but if it dies then you remain here forever.\r<br />\r<br />H is teleported to the Land of great warriors.\r<br />\r<br />BTW: \r<br />\r<br />If H asks P about herself – she remembers nothing.\r<br />\r<br />If H asks P about Oblivion – she says: “Oblivion is land of imagination, lies and lost souls”.\r<br />\r<br />If H asks P why she treats him like a thief – She says: “because you looks like a skeveer and smells like a thief”.\r<br />\r<br />P wears silver coin on her neck.\r<br />\r<br />You may lay some closes just before the door, if you don&#39;t want H to meet P in underwear.\r<br />\r<br />\r<br />[Land of great warriors]\r<br />\r<br />Land of great warriors meets H with a heavy rain. It contains a lot of monuments, statues, live trees and looks like a cemetery or garden.\r<br />Passing this area first time is a stealth and run mission. Everyone will attack H on sight. No one will try to speak with him.\r<br />\r<br />BTW:\r<br />\r<br />Great warriors are warriors with strong principles and, possibly, high morale, but devoted themselves to wrong ideas or just committed something very bad. They were forgotten but not forgiven. And yes, they hate “adventurers” like H.\r<br />\r<br />When passing this area, H may pick some good cold weapons from the ground (without need to fight)\r<br />\r<br />\r<br />[Meeting Skeever]\r<br />\r<br />Ruins, trash, waste. In Land of garbage H fiends S, who is very friendly to H and first of all offers him some rags (if H didn&#39;t fiend yet any closes).\r<br />\r<br />S: Hi&#33;\r<br />H: Speaking skeever?\r<br />S: Yes, why not? Whom did you expect to see here, beautiful princess?&lt;sarcasm&gt;.\r<br />H: No, skeever is very expected. But what wasn&#39;t expected, is that skeever will speak.\r<br />S: It is just your imagination. And it doesn`t matter.\r<br />\r<br />S is in course of H quest for Absolute calm spell and his trouble with Great warriors.\r<br />\r<br />S: Before you can approach Temple of atonement, where Absolute calm spell kept, you definitely should improve your aura. And there is a way.\r<br />\r<br />Then S gives to H quest to meet Th and E and speak with them.\r<br />\r<br />S: You may find these two quite silly, but they are good souls. Sadly, you can`t help both, so choose one and because both of them are completely ignorant in magic, you need someone, who will help you improve your aura and your favorite – to leave this cursed place.\r<br />\r<br />Q&A:\r<br />\r<br />H: Are these two (Th and E) friends?\r<br />S: No, they are bitter enemies, they killed each other. But despite this fact, neither of them deserve staying here.\r<br />\r<br />H: Why Great warriors are so angry at me? (H may ask this question later from L, when he meet her first time).\r<br />S: They are not angry at you, they are protecting Absolute calm spell. In fact this spell is a key to the exit from the Oblivion and Great warriors do not want to allow thieves, bandits and other wrong guys... like you... to exit. They believe, such souls should stay here forever. They think it`s right.\r<br />\r<br />This question may be ask here or later from L (only once):\r<br />\r<br />H: Is it possible to die in Oblivion?\r<br />\r<br />?: Yes, but not from sword or poison or other common way. “It” may kill you, swallow your soul.\r<br />\r<br />H: What the “It”?\r<br />\r<br />?: “Shadow”. Nobody knows, what exactly it is, but it&#39;s supposed, that thinking of Shadows attracts them. Don&#39;t ask me about them anymore, don&#39;t ask others. Even if somebody knows something, he will not say. It is a forbidden knowledge, something, what is better to not know.\r<br />\r<br />If this question was already asked, then in following episodes H may ask: “What do you know about Shadows?”. L will refuse to speak about that, T and O will say, they know nothing.\r<br />\r<br />\r<br />[Meeting Eleesse]\r<br />\r<br />E tells her story. She was hungry, her family was starving and finally she committed a crime. She stole chicken. But when she was trying to escape, Th, dirty servant, rush on her... Finally they fight each other to the death. What is with her family now is unknown.\r<br />\r<br />\r<br />[Meeting Tahr]\r<br />\r<br />Th tells his story. Th adores his master. He knows him all the life. When they were young, they played together, master also was always very kind to his servant too, gave him a shelter, helped every time he was in need. And one day, this thief, E, appears on the road, on the land of master, kills chicken... what the f... crime, what the abuse?&#33;&#33; No, he didn`t intend to kill her, but ultimately everything gone wrong and all died. Th doesn`t worry about himself, he is worrying only about his master, hopes, everything is good with him.\r<br />\r<br />\r<br />[Meeting Little skarji]\r<br />\r<br />L may be found (after H has already meet E and Th) in a broken building (or similar place) playing magical toys on the floor. There are also some small animals (like rabbits) around her.\r<br />She explains, that to help to E or Th, H first need a soul gem.\r<br />\r<br />L: There is one, so called “Trader”, who keeps soul gem among other useless to him stuff. Try to exchange it for something. Then you will need to charge that soul gem in a Stream of life, which is located in Land of thieves. You need some mark to pass there. Take this.\r<br />\r<br />L gives to H silver coin from the neck.\r<br />\r<br />L: You may ask Trader about Land of thieves, he was there, but in no circumstances give him the coin. And keep an eye on him, he is a sly person. Being with a charged gem, you need to receive blessing at the altar of Anubis, which is inside Pyramid. There you`ll meet 2 challenges. First, entrance to Pyramid is guarded by powerful Necromancer. Very old soul. A long time ago he was known as a good guy, who was trying to make Oblivion better by gathering worst souls and sealing them inside Pyramid. And yes, this is your second challenge, because you are going directly into that place. Now intentions of N are unclear, but he is definitely not a good guy. Even though he is looking mainly for nobody to leave the Pyramid, he will barely allow you to get into. So try to sneak behind him. And try to not stick there…\r<br />And when you come back with a gem, blessing and one of E or Th, I promise you aura, shining like a sun&#33;\r<br />And one more thing. You have, probably, already know, that dieing in Oblivion isn&#39;t possible, but losing inventory in a battle is quite common. So, I give you this amazing dagger. You will barely find it a powerful weapon, but it has a very useful feature. No matter what happens, it will always stays with you.  Good luck.\r<br />\r<br />BTW:\r<br />\r<br />If H asks L, whether everybody here know about his problem with Great warriors, she answers: “No, only me &lt;sarcasm&gt;.” \r<br />\r<br />Before L gave to H coin, she was wearing it on the neck exactly like P do.\r<br />\r<br />\r<br />[Meeting Trader]\r<br />\r<br />Trader lives in a house, looking like tavern or shop or store with lots of barrels, boxes, books and other clutter inside. His voice sounds friendly and full of sarcasm.\r<br />\r<br />T: Hello, my friend. It seems that we are meeting for a first time. You know, people here, or what remains of them, call me a Trader, but I am rather collector, I sell nothing. Do you know why I sell nothing? – It`s because nobody buy anything. People here, in Oblivion, have everything they need. Thus they don`t need to eat, to drink, to sleep. Do you remember, when you was sleeping last time, my friend?”\r<br />H: I am not long enough here to get tired. But what is really strange, is that I am not breathing, nor feel the need to breath. And I am still alive.\r<br />T: You&#33;&#33;&#33; Alive&#33;&#33;&#33; Ha&#33; You are dead, my friend. Dead&#33; And buried. Or burnt. Or may be at this moment wild animals are finishing eating your corpse…”\r<br />\r<br />When H says, he is not yet dead, but rather in coma, T begins speaking seriously.\r<br />\r<br />T: Hmm... Then, we have a special case here. Very special. And may I ask you, my friend, what has caused you to come here. Are you looking for something?\r<br />\r<br />H explains, that T has a soul gem, he needs.\r<br />\r<br />T: And what do you plan to do with it?\r<br />H: I&#39;ll charge it in Stream of life, then get Anubis blessing and then Skarji will use it to improve my aura.\r<br />T: Aura? Who cares about your aura?\r<br />H: I need good aura to enter Land of Great warriors.\r<br />T: What? What have you forget in the Land of Great warriors? Like being a dummy for beating?\r<br />\r<br />H tells, he already was there and explains, that Great warriors keep the key to exit from the Oblivion. \r<br />\r<br />T: Charged soul gem with Anubis blessing is the key out of here. I traveled many places of Oblivion, gathered many items. But all, I know Great warriors keep beside enormous amount of weapons and armors, is Absolute calm knowledge.\r<br />But wait, I probably begin understanding... Can you explain how you get here?\r<br />\r<br />H: I have drink a potion.\r<br />T: No, no, already here, in Oblivion.\r<br />H: I have met beautiful princess…\r<br />T: Yes&#33; Right&#33; I knew that&#33; That arrogant bitch&#33; She is everywhere&#33; She is here, she is there and if you look under that pissed stone, then you`ll probably find she there too&#33; Want to hear my story, friend?\r<br />A long time ago I was an adventurer. Exactly like you. And exactly like you I have made a big mistake by getting here. And wow, magnificent monarch welcomes me. &lt;sarcasm&gt; You may find this ridiculous, but I completely forget my armor... and lose my underwear somewhere on the way here. But, you probably don’t know, my friend, that I have brought here something... something...\r<br />H: Soul gem?\r<br />T: What? No, not a soul gem. Something, such girls appreciate much and afraid of at the same time&#33; So, I am standing there, just before her, she is gazing on me. And then she starts ordering me where to go and what to do. Arrgghhh... I tell you, my friend, don&#39;t trust that bitch&#33; She is using you. All these obscure hints, strange advices… Nobody can say, she is lying to you, no, she is just saying a half of truth. And all, that she says, leads you to misunderstanding and finally – wrong decisions. \r<br />\r<br />H: Thank you for advice, but… couldn&#39;t you give me a soul gem or exchange it for something?\r<br />T: Ok, my friend. No matter, what she says about me, I&#39;ll help you. You know, after I have lost my body, this soul gem is not very useful to me. Take it. I am asking nothing from you in exchange, but don&#39;t give it to that arrogant bitch, you call “Princess”. After you charge soul gem and get Anubis blessing, just meet me, and I&#39;ll explain, what you can do with it.\r<br />\r<br />Q&A\r<br />\r<br />If H asks T about Land of thieves, T answers: “You need to locate Stream of life there. The easiest way is to go to the Tavern of thieves and ask somebody. Be cautious, these thieves will rather ignore you till they know, what you have. But after they discover you have a soul gem – get out of there as fast as possible. Soul gem is an item of strong magic, you can&#39;t lose it in a normal conditions. But these guys have an excellent knowledge of how to empty your pockets, so hold it stronger &lt;sarcasm&gt;.\r<br />\r<br />If H asks, whether T can go with him to the Land of thieves, T answers that “Princess” restricts him from getting there.\r<br />\r<br />H: Whether if was useful what you bring here with yourself?\r<br />T: No. You don&#39;t need to eat, to sleep, to drink, anything else. Thus it was useless. As useless, as your silly questions, my friend.\r<br />\r<br />These questions may be differed to the next time H meets T:\r<br />\r<br />H: What is your reason to help me?\r<br />T: I have read somewhere, that a right man may leave Oblivion by doing something good. No, not to real world, to Savngarden, may be.\r<br />\r<br />H: How did you get here?\r<br />T: I was searching for elixir of eternal life. Dirty joke… After investigating entire Oblivion, I find nothing, not even an evidence of its existence. But, at least I know now, what eternal life looks like. It is so long... There is already a wish to die.\r<br />\r<br />H: Do I need to hurry?\r<br />T: Time in Oblivion flows slowly. You may stay here for years or decades, until the day in real life get to the end. So, you probably have enough time to do all you businesses.\r<br />\r<br />H: Why Great warriors need so much weapons?\r<br />T: Who knows, why they gathering weapons. These warriors almost monopolize all good weapons and armors in Oblivion. Preparing to the war may be... &lt;sarcasm&gt;.\r<br />\r<br />H: how Absolute calm spell may be used to exit Oblivion?\r<br />T: Absolute calm spell may be used against Firebeast. Something, that guards exit from Oblivion. Do you know what F is? Everyone, who met him, tells different story. Insane stories. When I say “everyone who met him” I mean “everyone who failed to defeat him and stays here, in Oblivion”. But if you have a soul gem, then you don&#39;t need to go such a long and difficult way.\r<br />\r<br />\r<br />[Meeting beggar]\r<br />\r<br />No matter what H asks, B says either she doesn&#39;t know or asks to spare a coin. When H gives to her silver coin (from L), she teleports H to Land of thieves.\r<br />That is all, you&#39;ll never see her again.\r<br />\r<br />\r<br />[Land of thieves]\r<br />\r<br />Land of thieves contains plethora of barrels, boxes and sacks. Most are open, all are empty. This area is dark. Thieves are unfriendly and unhappy, they prefer to ignore H, not answering him.\r<br />When H enters Land of thieves, he sees Tavern of thieves. It&#39;s not required to go there to find Stream of life, H may find it accidentally when defeated and respawned, but the most obvious way is through Tavern.\r<br />\r<br />[Tavern of thieves]\r<br />\r<br />Tavern inside looks comfortable. Thieves here are content, but nobody is speaking with H except O.\r<br />\r<br />O: Glad to see new face here.\r<br />H: Hi, whats in menu?\r<br />O: I don&#39;t know. I have lost the menu. But we are playing games here. Very interesting.\r<br />\r<br />Then O offers to play with him a mini-game (card game or dices).\r<br />\r<br />H: Sorry, I am not a gambler. I am just searching for Stream of life.\r<br />O: I understand. But if you wish I say you how to find it, then you need to play with me. What can you bet?\r<br />H: I have nothing to bet...\r<br />O: No, no, no. Even if you have nothing useful, you may bet on your life. Or what remains form it. So... if you win – I&#39;ll say you, where it&#39;s located, if not – you go to the ring and fight with Z. But don&#39;t worry, it&#39;s a fair play and a fair fight.\r<br />\r<br />If H wins game, then O explains, how to find Stream of life, if not – two thieves take him by shoulders and drag directly to the ring, where Z smashes H by a single hit of hammer into the head (thieves still hold H by shoulders). All thieves laugh.\r<br />\r<br />Q&A:\r<br />\r<br />If H asks who is Z, why he is looking so different comparing to others, O answers: “He isn&#39;t a thief. This is what he says about himself, and I wouldn&#39;t argue with him. He just enjoy this place. I don&#39;t know why.”\r<br />\r<br />If H got his skarji-dagger out somewhere in the Land of thieves:\r<br />\r<br />O: May I look at your dagger?\r<br />\r<br />If H allows:\r<br />\r<br />O: Yes… It is. Valuable thing. I would steal it from you. Sadly this is the only thing in Oblivion I can&#39;t steal.\r<br />\r<br />O returns dagger to H.\r<br />\r<br />BTW:\r<br />\r<br />It&#39;s quite difficult to win in game with O, but if H supposes, that somebody is cheating, then he goes directly to the ring.\r<br />\r<br />If it&#39;s difficult to implement “To the ring” animation, then, after lose, doors get locked and Z just attacks H (some NPC may help him).\r<br />\r<br />\r<br />[Stream of life]\r<br />\r<br />Stream of life looks like a shining fountain. There are many thieves around wandering and boring. Some – lie, some – sit, other look like sleeping. They pay no attention to H until he put soul gem into Stream of life. After he do that, they all attack H. These foes are relatively weak, but they my easily take H by a number. The best strategy is to leave Land of thieves as soon as possible.\r<br />\r<br />If H is defeated by a thief, then he looses soul gem (H may don&#39;t even know about that), thieves stop attacking him and at exit he meets Z.\r<br />\r<br />Z: Want to exit?\r<br />H: Yes.\r<br />Z: You forget something.\r<br />\r<br />Z drops lost soul gem on the ground in front of H and goes away (returns to tavern).\r<br />\r<br />\r<br />[Meeting Necromancer]\r<br />\r<br />H fails sneaking behind N.\r<br />\r<br />N: You, there&#33;\r<br />\r<br />No matter, what H say, N is very aggressive.\r<br />\r<br />N: All of you don&#39;t understand one simple truth. If you are not inside the Pyramid, then you simply don&#39;t deserve being there. Want to leave the Oblivion – go and break the chain&#33;\r<br />\r<br />H: What the chain?\r<br />\r<br />N: Chain, that ties your soul. Chain, that holds you here. I am tired of you&#33;\r<br />\r<br />N attacks H.\r<br />At some moment T appears from nowhere and starts helping to H.\r<br />\r<br />After N defeated:\r<br />\r<br />T: Sorry, my friend, but you are not looking as strong as I supposed you are. Sure you ready to go there? Though it doesn&#39;t matter, because you must. You know, I was there. Sadly I have failed getting Anubis blessing, but at least I have got this excellent armor. Take it. Beside outstanding protection it has one feature, you will probably find very useful when investigating such a dark place, like a Pyramid. It&#39;s shining&#33;\r<br />You said, you have already met good souls of Oblivion? Great warriors, I mean… Now prepare to meet the BAD&lt;sarcasm&gt;&#33; And don&#39;t disappoint me, you are so close to the goal.\r<br />\r<br />T gives to H Anubis&#39;s armor.\r<br />\r<br />Q&A:\r<br />\r<br />If H asks, whether T could go with him into Pyramid, T says: “No, no, no. I already was there. Anubis refused to me with blessing, so now it&#39;s your turn.”\r<br />\r<br />If H asks, what is the chain, N was speaking about, then T says: “I don&#39;t know. Chains, auras… All you need to exit Oblivion, is Anubis blessing, and you are standing right before the door&#33;”\r<br />\r<br />\r<br />[Pyramid]\r<br />\r<br />Pyramid is extremely dark place. Only few rooms (the room with altar and room with armory, may be some other) have light sources. H fights in the light, given by his armor. Enemies jump onto him right from the dark.\r<br />\r<br />When H finds altar of Anubis and begins praying, something go wrong. Floor starts shaking, some statues may fall down, dust falls … It must be obvious he must leave this place.\r<br />On the way to the exit, H finds armory room. Different mannikins there depict different gods. All look fine except mannikin of Anubis, which has no armor on it. Obviously, this is what T has stolen form Pyramid.\r<br />\r<br />Now H should return Trader&#39;s armor back to Anubis.\r<br />\r<br />Close to the exit H sees dark silhouette on the bright doorway (Anubis?).\r<br />\r<br />A: Strange… How many are trying to steal from here, but I never saw somebody, returning something back… You are not from this place. Definitely.\r<br />\r<br />Silhouette disappears. H now possess Anubis blessing.\r<br />\r<br />BTW:\r<br />\r<br />Anubis blessing may be implemented as a spell, surrounding H with a light in dark places and giving additional strength against undead.\r<br />\r<br />“Bridge of belief” – concept from Indiana Johns movie, invisible bridge, H can pass, but dark souls from pyramid – can not. This may be implemented to explain why foes don&#39;t follow H and don&#39;t try to exit pyramid from the back door like H does.\r<br />\r<br />After this moment H may leave Oblivion by using soul gem.\r<br />\r<br />\r<br />-------------------------------------------- End of part I ------------------------------------------\r<br />\r<br />\r<br />[Aftermath] \r<br />\r<br />After exiting Pyramid H meets T (right at the exit).\r<br />\r<br />T: You know, my friend, I have changed my mind. And now I need my soul gem back.\r<br />H: Need for what?\r<br />T: To leave Oblivion, isn&#39;t it obvious?\r<br />H: But you have lost your body. How it&#39;s possible?\r<br />T: Who said, it&#39;s not possible? Your princess? - Another half-truth. Me, may be? Sorry, I lied. I have read from a book, that the right man, using strong magic, may leave Oblivion in a body, not belonging to him. Loosing body isn&#39;t a doom, my friend.\r<br />I&#39;ll just take yours. NOW, MY SOUL GEM&#33;&#33;&#33;\r<br />H: No. I&#39;ll give it to Skarji.\r<br />T: SHE IS NOT SKARJI&#33;&#33;&#33;\r<br />\r<br />T attacks H.\r<br />\r<br />BTW:\r<br />\r<br />H may end conversation at any moment by saying “No way”, or “F... off”. Then T stops speaking and attacks H.\r<br />\r<br />If T didn&#39;t say last phrase in conversation, then at the end of battle (no matter who wins), T says: “Don&#39;t give her soul gem. She isn&#39;t what you think&#33; SHE ISN&#39;T SKARJI&#33;&#33;&#33;”\r<br />\r<br />If T wins the battle then H loses soul gem, but mission objectives don&#39;t change (Take Th or E and go to L).\r<br />\r<br />\r<br />[Meeting Grimalkin]\r<br />\r<br />G: You, and your new friend T, you have broken Pyramid seals. Now dark souls from Pyramid are invading Land of great warriors, turning everything into the mess. You have broken balance&#33; One idiot is a problem, two idiots together is terrible power&#33; You entered Pyramid to deserve favor of Great warriors, but after your rough business with N, all you deserve is to stay there.\r<br />\r<br />BTW:\r<br />\r<br />G doesn&#39;t allow H to say a word. She just speaks off and disappears.\r<br />\r<br />If H chooses Th then he runs in front of H, attacking foes, close enough to him or H.\r<br />\r<br />If H chooses E then she runs a step behind him, fighting only when she or H was attacked directly.\r<br />\r<br />Th fights with bare hands, T may use a dagger. Both will take nothing from H. Exception is Th, who may take a soul gem (for a time), but both will say they have no knowledge of what to do with it.\r<br />\r<br />\r<br />[Meeting Little skarji 2]\r<br />\r<br />L: Glad to see you again.\r<br />\r<br />If H has lost soul gem, then L says: “I know you have lost a soul gem, but don&#39;t worry. Trader has overestimated his skills in magic. Or may be he wasn&#39;t a “Right one” to do what he want.”\r<br />\r<br />If H has a soul gem and Th or E is also here, then she says: “Do you bring soul gem?”\r<br />\r<br />After L receives soul gem, she do some magical manipulations with E or Th, who then disappears.\r<br />\r<br />L: You have just done, what Great warriors appreciate very much, but breaking Pyramid seals makes you rather intruder than a hero. I don&#39;t know, whether they will take this easy.\r<br />The best of what you may do now, is to use situation. While bad are fighting good and good are fighting bad, it is your best chance to sneak into Temple of atonement, into the basement, where Absolute calm kept. All you need then, is to touch the Magic stone. After that you may just keep absolute calm, while guards will teach you good manners, or you may test your new knowledge. It doesn&#39;t matter what you will do, you&#39;ll get the same results. You – won, guards – failed &lt;sarcasm&gt;.\r<br />\r<br />Q&A:\r<br />\r<br />These questions may be asked at any moment (even if H didn&#39;t take Th or E with himself):\r<br />\r<br />H: When T said you are not a skarji, what did he mean?\r<br />L: He probably meant, I am not a skarji.\r<br />H: And who are you?\r<br />L: I don&#39;t know, I told you. I simply don&#39;t remember, who I was before entering Oblivion. But I don&#39;t mind, if you&#39;ll call me skarji. You called me worse.\r<br />H: When?\r<br />L: When I was explaining, how you can find E and Th. You called me “Speaking skeever”, remember?\r<br />H: That was you?\r<br />L: Yes, and first time we meet, when you was just arrived, you called me “Princess”.\r<br />H: You are kidding&#33;\r<br />L: No. Here, in Oblivion, you can meet liars of all kinds, you probably know that already, but the biggest liar here is your imagination. You don&#39;t see things how they are, you see them how you expect them to be.\r<br />When you entered Oblivion, you, probably, were waiting to see somebody like a princess, and you have seen it. Then, after all that speeches about thieves and skeevers, you were imaging me as a skeever. I don&#39;t know why now you see me as a skarji. It is your imagination, not mine. \r<br />H: You see me different too?\r<br />L: Yes. This is why I gave you my medallion, when you were going to the Land of thieves. I didn&#39;t want Trader to get there. Can you say, how did you see me when I was asking my medallion back?\r<br />H: As a beggar.\r<br />\r<br />L starts laughing.\r<br />\r<br />H: So… You are trying to say, that how you see somebody else depends on your expectations?\r<br />L: Mostly.\r<br />H: When we meet first time, you called me “Another adventurer...”, or something like that. Doesn&#39;t that mean, all newbies look the same?\r<br />L: More or less.\r<br />H: And what do you see, when somebody arrives?\r<br />L: Sorry to say… but usually I see a skeever.\r<br />H: And now, you see skeever too?\r<br />L: No. Now I see a man.\r<br />\r<br />H: You used me?\r<br />L: May be. But don&#39;t blame me for that. I was trying to help to someone, who really in need.\r<br />You, may be, not the most powerful warrior and strongest magician, but you are good enough to leave the Oblivion as a hero. Then look at them: Th and E, they simply can not go this way.\r<br />Beside that, you were so eager for Absolute calm spell… I was just answering your questions, explaining how you may get it.\r<br />\r<br />H: When we meet first time, in the tower, you laughed at me. Why?\r<br />L: You said, you get into Oblivion to find Absolute calm spell. The valuable knowledge here, in Oblivion, I agree. But I am in doubt you will find it useful outside. Thus you have entered Oblivion just to find the a way out, isn&#39;t it funny?\r<br />H: Why do you think it&#39;s useless outside?\r<br />L: Because it freezes absolutely everything, including caster. Probably to the death.\r<br />\r<br />H: What is now with the Trader?\r<br />L: Wandering somewhere. It is everything OK with him. He didn&#39;t leave the Oblivion.\r<br /> \r<br />H: Just before fight N said me “Go and break the chain”. What is the chain, N was speaking about?\r<br />T: “Breaking the chain” is a colloquial phrase. There is no physical chain, you may slash with the axe or sword. It&#39;s rather chain of events. Don&#39;t think about it now, you will understand everything later.\r<br />\r<br />The following may be asked after L receives soul gem:\r<br />\r<br />H: Can you now improve my aura?\r<br />L: Truth to say, I don&#39;t know how to improve aura with a magic. But don&#39;t worry, now your aura is good, very good. Great warriors will appreciate what you have done. They try to not allow thieves, bandits, other bad guys to escape from Oblivion. But I doubt, they would stop someone, who gave the way to somebody else. Great warriors would gladly allow you to access Absolute calm spell, unless your fault at Pyramid. After now – I don&#39;t know… Go and do what you can.\r<br />\r<br />BTW: L now wears silver coin on the neck, like before.\r<br />\r<br />\r<br />[Land of great warriors 2]\r<br />\r<br />When H enters Land of great warriors, the battle is over. This place looks very peaceful now, enshrouded in white fog and has some destruction.\r<br />The first Great warrior, H sees, greets him.\r<br />\r<br />W: Good day, seal-breaker&#33;\r<br />Do you know what happened here? Yes… It was a great battle, all we were longing for&#33; A battle with pure evil. Some of us, Great warriors, have even earned atonement and were able to ascent. That was amazing.\r<br />No, I don&#39;t say you have done everything right. In fact you didn&#39;t. But I am not going to blame you for being a bad thief too. Finally, all we were making mistakes. So, despite your fault, Great warriors think you are good enough to leave Oblivion. If you wish.\r<br />But you have made a problem for yourself. When dark souls from Pyramid invaded our land, we moved Magic stone from basement to Catacombs. Now you need to go there, if you still need it.\r<br />\r<br />\r<br />Q&A:\r<br />\r<br />H: How do I find Catacombs?\r<br />W: Go to the basement, where Magic stone was before. There you will find a guard. He, probably, will help you.\r<br />\r<br />H: Why are you so rough with strangers?\r<br />W: Because most of them are thieves and bandits, we call them “Skeevers”.\r<br />You, probably, already know, that Oblivion is a trap. But it isn&#39;t just a trap, it&#39;s a prison. And both Necromancer and Great warriors here do the same thing indeed. While N locks darkest souls inside Pyramid, Great warriors don&#39;t allow souls, that are a bit better, to escape from Oblivion.\r<br />All they should stay here. The world is better without them.\r<br />\r<br />H: Is it really bad, what happened with N and his seals?\r<br />W: It&#39;s bad, but it isn&#39;t fatal. You didn&#39;t harm N and his seals are fixable. Then, we&#39;ll clean other areas, occupied by dark souls, like we did with our land. It&#39;s just a matter of time.\r<br />\r<br />H: What do you think about P?\r<br />W: Who?\r<br />H: Person, who meets newbies.\r<br />W: Bright soul? We call her Bright soul.\r<br />A bit naive, but she gives help to losers, Great warriors would never help to. You may find it&#39;s strange, but we respect her for that.\r<br />Beside that, she is very old soul. Many silly souls think, they will stay here forever, for eternity. Waiting for a good moment to escape. That&#39;s wrong. Nothing exists forever. We too. Conscious fades, memories shatter, soul disappears, dissolves into Oblivion. But that&#39;s good, that&#39;s right. What isn&#39;t good you&#39;ll see later, in Catacombs.\r<br />\r<br />H: What should I be waiting in Catacombs?\r<br />W: Great warriors. But they are different from us, living above. Ask guard in basement, he may explain better.\r<br />\r<br />H: Why Bright soul lives so long?\r<br />W: I don&#39;t know. May be she has a secret…\r<br />\r<br />\r<br />[Temple of atonement]\r<br />\r<br />In the basement of Temple of atonement H finds another Great warrior.\r<br />\r<br />H: Couldn&#39;t you explain me, how to get into Catacombs?\r<br />W: You ready to get there? I am asking because you should know, what you&#39;ll meet there.\r<br />\r<br />It doesn&#39;t matter, what H answer.\r<br />\r<br />W: Great warriors, but they are very different from us, anybody you have seen before.\r<br />H: What is the difference?\r<br />W: You know that souls in Oblivion live a long time before they vanish. Became the part of Oblivion, subtle matter, that gives everything you see around its form and content. This is how it should be. But some Great warriors have so strong sense of sorry, sorrow and disappointment, that it stays when memories already not. Such a soul doesn&#39;t already remember who she was and why she hates herself and everything around. There is no way to communicate with such a soul, comfort her or convince.\r<br />Pure madness…\r<br />H: Zombie.\r<br />W: You may call Zombie inhabitants of Pyramid, but Great warriors, even after they descend to Catacombs, remain Great warriors.\r<br />H: I understand. And I am ready.\r<br />W: Then let&#39;s go. I&#39;ll help you in your journey.\r<br />\r<br />BTW:\r<br />\r<br />Great warriors from Catacombs often say: &#34;Shadow will swallow you...&#34; before they attack.\r<br />\r<br />In this mission W isn&#39;t essential and may be defeated, but Catacombs are supposed to be a relatively small area and if one of H or W defeated then W moves toward H.\r<br />\r<br />Finally H and W should meet at Magic stone.\r<br />\r<br />\r<br />[Magic stone]\r<br />\r<br />Magic stone looks like ancient rough stone with strange sings, carved on it. Some signs emit blue-green light.\r<br />\r<br />H: Is this a Magic stone?\r<br />W: Yes, it is, but don&#39;t hurry touching it. Many think, once they touch the stone, they receive Absolute calm spell. That isn&#39;t true. The stone will move you to the Land of forgiveness, where you will need to put some efforts to get the knowledge. We call this process &#34;Finding weakest link&#34;.\r<br />H: What does it mean?\r<br />W: What do you think holds you here, in Oblivion? Great warriors? Bright soul? Necromancer? No. It&#39;s a chain. And each link of that chain is something, you have done wrong in your life. When you kill somebody or do heavy injury, the chain gets longer. And stronger. You forget that chain all your life.\r<br />There, in Land of forgiveness, you&#39;ll meet souls, you made harm to, some time ago. Do you know what should you do then?\r<br />H: Fight them again.\r<br />W: Yes, you will need to fight, but you go there not for a fight. You go there to get forgiveness. At least one soul should forgive you, or you&#39;ll stay there forever.\r<br />\r<br />Q&A:\r<br />\r<br />H: I heard, I need to break the Chain to leave the Oblivion.\r<br />W: Yes. You do, “Breaking Chain” is synonym of “Defeating Firebeast”. But first, you need to find the weakest link of that Chain. And this is exactly what you are going to do.\r<br />H: Why do Great warriors from Catacombs speak about Shadows?\r<br />W: Frighten, may be. Souls from above are in horror of Shadows. They are thinking, mentioning Shadows may attract them. A long, long time ago these Catacombs were known as &#34;Catacombs of shadows&#34;, it&#39;s supposed, that Shadows here are more often happening than above. This is why we moved Magical stone here, trying to protect is.\r<br />\r<br />H: But you don&#39;t afraid of Shadows?\r<br />W: No, I investigated this phenomenon. I don&#39;t think, mentioning Shadows or thinking about them somehow attracts them. I suppose, you have better chances to fall victim of Shadow here, in Catacombs, because Shadow is what remains from soul of a Great warrior in certain conditions after he completely losses his mind.\r<br />H: How did you investigate Shadows?\r<br />W: I have read the Book of shadows. Many above are afraid of that book as they are afraid of Shadows. But I found nothing bad there, just obscure explanation of what Oblivion is and some words about Shadows. The book itself is a strange thing. It&#39;s one of artifacts, that exist in Oblivion from the beginning of times. Like your dagger. But unlike the dagger the book can&#39;t stay in a single place for a long time. It just disappears and then appears somewhere else, where somebody may read it. Great warriors, who are thinking the book is evil, was trying to destroy it or put it under lock. Nothing helped.\r<br />\r<br />H: Why everybody is afraid of Shadows?\r<br />W: There are, probably, two reasons. First, it&#39;s a deadly power. This is the only power, that may kill you here, erase you, like you were never before. And it&#39;s strong enough to not only swallow some souls, but entire regions of Oblivion&#33;\r<br />Second, this is mysterious power. All we know about it is just a set of presumptions, guesses, nothing exact. The only soul, who saw the Shadow and was able to survive, is Bright soul, but she hates speaking about that. Shadow touched her, now she is afraid like all others. \r<br />\r<br />\r<br />[Land of forgiveness]\r<br />\r<br />Land of forgiveness looks like a labyrinth, which has no way in or way out. H moved here by a Magic stone and leaves this place after he receives forgiveness.\r<br />\r<br />H will fight NPCs, he has killed in regular game. H must use weapons to self-protect only, because one of souls, after a short conversation, will give him forgiveness.\r<br />\r<br />\r<br />[Temple of atonement 2]\r<br />\r<br />After getting from someone forgiveness and short “ascension” animation, H finds himself in main hall of the Temple of atonement. There are some Great warriors around.\r<br />\r<br />W1: This is supposed to be a ceremonial moment. But most warriors, usually participating in ceremony, are busy somewhere else and the place is a bit destroyed now. You know why. We respect strength here, but you could be a little more delicate with Necromancer.\r<br />H: Sorry for that. After I get Absolute calm spell, where do I find Firebeast?\r<br />W1: Look inside yourself...\r<br />W2: Go to the West gates. After passing them you&#39;ll see circular wall. This is the last wall between you and your life. Firebeast will wait you right behind that wall.\r<br />\r<br />BTW:\r<br />\r<br />West gates were chosen arbitrary. This may be something different, like standing stone, for example.\r<br />\r<br />\r<br />-------------------------------------------- End of part II ------------------------------------------\r<br />\r<br />\r<br />[West gates]\r<br />\r<br />At West gates H meets another Great warrior (now – female).\r<br />\r<br />W: Greetings, warrior&#33; Firebeast is waiting for you. Go and do, what you should.\r<br />\r<br />Q&A:\r<br />\r<br />H: What should I be waiting behind this gates for?\r<br />W: Nothing special. There is a circular wall. This wall has no gates, no doors or windows. You need to find a magical way to get inside. And there you&#39;ll find somebody, who will offer you solution. Many souls live there, in the Land of lies. Most of them are not trustworthy. So, if you don&#39;t believe to what you hear, just go further along the wall. \r<br />H: Why they are not trustworthy?\r<br />W: I don&#39;t know. They all were trying to defeat Firebeast, and now, probably, don&#39;t want you to do, what they failed.\r<br />H: Why so many where unable to defeat Firebeast?\r<br />W: Some were not strong enough. Others didn&#39;t have all, what required, a physical body I mean. What I really can not explain, is why some of them are trying, knowing, they&#39;ll fail.\r<br />H: Isn&#39;t it you again, Bright soul?\r<br />W: No, I am &lt;certain name&gt;, one of the Great warriors.\r<br />\r<br />\r<br />[Land of lies]\r<br />\r<br />The circular wall look old and rough, built from blocks of different size. Somewhere it it&#39;s unfinished, somewhere – destroyed. There are blocks, removed from the wall and just lying around.\r<br />\r<br />Close to the wall H finds Sorcerer, who gives him a mini-quest (and disappears). At the end of quest H must go to standing stone or grave plate or cross or something else near the wall and do something (pray, may be). If the quest was not a lie, then H is teleported inside the wall. H may skip the quest if he doesn&#39;t trust in what Sorcerer says and go further along the wall … to find similar Sorcerer.\r<br />\r<br />\r<br />[Inside the circle]\r<br />\r<br />In the very center, inside the wall, there is a stone, looking exactly like Magic stone from Catacombs, except signs on it now emit red light. There is no trees, no stones or buildings, but entire area is filled with various things: armors, weapons, other stuff.\r<br />P stands close to the stone.\r<br />\r<br />H: Bright soul?\r<br />P: Yes, learned to distinguish me from others? Never mind. After touching this stone you&#39;ll meet your Firebeast. It&#39;s a hard test. But before that you should do something, you will probably not understand.\r<br />H: What should I do?\r<br />P: Leave everything here. You should approach Firebeast as you were entered Oblivion. With no weapons, armors, anything. It&#39; s important. Don&#39;t be shy, nobody is looking at you. And if somebody looks, he will see something different from what you are seeing in a mirror.\r<br />Go. It&#39;s time to break the Chain of Oblivion.\r<br />\r<br />P disappears.\r<br />\r<br />\r<br />[Deserted land-2]\r<br />\r<br />H finds himself in Deserted land. This time he fights in body of NPC, he was fighting with in Land of forgiveness. The area is dark (as always) and there is a red light inside broken tower. Getting close, H sees Firebeast, sitting on iron throne, decorated with bones and sculls. He is in fire and everything around is in fire too. The Firebeast has body of H.\r<br />Because Firebeast is ignites everything around, H needs to activate Absolute calm spell to get close to him. But then he can&#39;t go to far from Firebeast, because Absolute calm will start freezing him, draining his health.\r<br />Absolute calm is deactivated automatically when Firebeast is defeated. Then H takes body of the next NPC from Land of forgiveness and Firebeast respawns in a broken tower. H fights with what that NPC has and may use Skarji-dagger as a spare weapon (Skarji-dagger always stays with him). \r<br />This continues until H gets body of NPC, who has forgiven him (in Land of forgiveness). When H activates Absolute calm spell close enough to Firebeast, both spells wear off. Camera moves slowly from NPC to Firebeast (now - H). NPC ascents. After short pause H ascents too.\r<br />After fight H receives &#34;Pure fire&#34; spell (spell of Firebeast). Any of them (Absolute calm and Pure fire) may now be deactivated by casting opposite spell.\r<br />\r<br />\r<br />[Book of shadows]\r<br />\r<br />After battle with Firebeast, instead of resurrection, H finds himself surrounded by a strange magical barrier. It has cylindrical black surface with bright signs on it. Signs are moving and changing. The place is foggy, what is above is hidden by fog. There is a book on the floor.\r<br />If H was defeated by a T in “Aftermath” episode, then T is also here.\r<br />\r<br />T: Should I now call you a &#34;Great warrior&#34;?\r<br />H: It&#39;s you...\r<br />T: Yes. It&#39;s me. But you better worry about your body.\r<br />H: What&#39;s wrong with my body?\r<br />T: How to say... We here, in Oblivion have no problems with that, I even forget the word... Ah&#33; Overdose&#33; You, my friend, when you are going next time to drink a poison, you better have some measure&#33;\r<br />H: You are not my friend&#33;\r<br />T: But I am not your enemy too. I am just trying to leave this cursed place. By all means. See that book, on the floor? It&#39;s waiting when somebody take it. Congratulations, you are the primary candidate.\r<br />\r<br />After H takes the book from the floor, magical barrier and fog disappear, H finds himself in the same broken tower in Deserted land. After a second, T disappears too. When H tries to exit tower, he is teleported to the Land of lies.\r<br />\r<br />Q&A:\r<br />\r<br />H: Where we are?\r<br />T: I don&#39;t know, but I have heard from someone or read somewhere that this book, on the floor, appears on the very edge of Oblivion. Don&#39;t ask me what does it mean. I was just trying take your body, but failed, it seems, that you – too. This is why we both are here. But I am sure, we are still in Oblivion.\r<br />\r<br />H: Why should you call me Great warrior?\r<br />T: Didn&#39;t they say you? Because getting Absolute calm knowledge and Pure fire knowledge are two parts of the same ritual. The rite of initiation into Great warriors. Very dangerous rite indeed. Many, who failed the first part, remained in Catacombs, the second - in the Land of lies. But you have passed the test.\r<br />H: And you - too.\r<br />T: Yes, but I am not a Great warrior. It isn&#39;t enough to learn two knowledge to became one of them. You need an invitation. This is what you have, but me - not. &#34;Thief always remains a thief&#34; – this is what they always say.\r<br />\r<br />H: Why don&#39;t you take the book?\r<br />T: Me? No, no... It is dirty.\r<br />H: It doesn&#39;t look dirty, what&#39;s wrong with this book?\r<br />T: It&#39;s that book... “Book of shadows”.&lt;whispering&gt;\r<br />\r<br />H: I am not going to take the book too.\r<br />T: Then we are going to stay here till the end of times.\r<br />\r<br />\r<br />[Land of lies 2]\r<br />\r<br />Land of lies looks exactly like before, except there is no circular wall now. Sorcerer is still here though.\r<br />\r<br />H: What&#39;s happened here?\r<br />So: Where? Nothing happened, since the time I remember.\r<br />H: But where is the wall?\r<br />So: The fact, you don&#39;t see the wall, means Oblivion doesn&#39;t hold you anymore. Congratulations, you have passed the test by Firebest. But it seems, that outside world is not ready to accept you. Probably, you simply don&#39;t have a suitable body to live in. But don&#39;t worry, Land of lies is a good place to stay. For me, and ... you.\r<br />\r<br />When H touches Magic stone, P appears.\r<br />\r<br />P: It wouldn&#39;t work. You already have Pure fire spell.\r<br />\r<br />This question line goes first, but may be skipped:\r<br />\r<br />H: What did it was?\r<br />P: What? Battle with Firebeast? This is how you were learning to keep balance between fire and ice, anger and calm. Learned to be in peace with yourself.\r<br />H: And who were all these souls? People, I maid harm to?\r<br />P: You know, I don&#39;t think they are souls of real people, waiting for you here, in Oblivion, just say, you were a bad boy.\r<br />H: But who?\r<br />P: Nobody, just another nightmare, assiduously created for you by Oblivion.\r<br />\r<br />H: How do I leave Oblivion now?\r<br />P: Oblivion doesn&#39;t hold you, but it seems, that your body has severe damages. I am not sure, but Necromancer could make a cure potion for you.\r<br />\r<br />Q&A:\r<br />\r<br />H: Cure... From Necromancer...\r<br />P: Yes, what&#39;s wrong? He is the best alchemist in entire Oblivion.\r<br />H: Beside, he wasn&#39;t happy, seeing me last time? I just wouldn&#39;t trust to Necromancer in such a deal.\r<br />P: Some time ago, similar potion was stolen by owner of tavern in Land of thieves. The fact he is still in Oblivion, gives us hope, the potion is still with him.\r<br />H: And he will kindly give it to me...&lt;sarcasm&gt;\r<br />P: I like your irony in question of whether you will survive, but I rather agree - he will barely give it to you for nothing. Frighten him&#33; Imagine yourself as a Great warrior from Catacombs.\r<br />H: But I am not a Great warrior from Catacombs.\r<br />P: Could be, if you fail quest for Absolute calm. You are in the world of imagination. Sometimes, even relatively weak people where able to became a strong warriors here. It depends on how you position yourself. I know, you have a book, a very bad book, but these, from the Land of thieves, are in horror of this book and everything, connected with it. Use this. Play with the mind of these thieves. \r<br />\r<br />H: Why do you think, the book is bad?\r<br />P: I don&#39;t like speaking about that, but… Do you know, how did I lose my memories?\r<br />H: No.\r<br />P: A long time ago, there was a holiday in Oblivion. We knew this book is evil and from time to time we were celebrating it&#39;s annihilation.\r<br />H: Annihilation?\r<br />P: Yes, we were burning it.\r<br />H: But it didn&#39;t burn.&lt;sarcasm&gt;\r<br />P: No&#33; It burned&#33; With a big beautiful flame. It didn&#39;t harm the book though. After some time, somebody always spot it somewhere, so we could celebrate again.\r<br />H: Sorry, but burning books doesn&#39;t seem a good celebration to me.\r<br />P: This was a very special case. And we were happy&#33; Here, in this world of darkness and hopelessness, it was like a ray of light, a sparkle of joy&#33;\r<br />Till the last celebration.\r<br />H: What happened there?\r<br />P: Shadow happened. Many souls were swallowed, vanished into darkness. I still remember that prickly cold sense, when Shadow tiers your conscientiousness. Fires are painfully bright, but don&#39;t give light to what&#39;s around, and you slowly delve into viscose, inevitable darkness.\r<br />But then … then Shadow just disappeared. Two things happened after that: I have lost all my memories and others begin to call me “Bright soul”.\r<br />\r<br />H: But you know, what was before the last celebration?\r<br />P: Others told me.\r<br />\r<br />H: As I can understand, Shadow changes lighting. Isn&#39;t it possible to escape when you feel something similar to what you describe?\r<br />P: Shadow doesn&#39;t affect lighting, it affects your conscientiousness. And nobody except me was able to escape.\r<br />\r<br />BTW:\r<br />\r<br />Book of shadows has black covers and written with sings, similar to signs on Magical stones and magical barrier in “Book of shadows” episode. It&#39;s unreadable for H.\r<br />\r<br />\r<br />[Tavern of thieves 2]\r<br />\r<br />This episode is skipped if H goes directly to N.\r<br />\r<br />O: Look who is coming&lt;sarcasm&gt;. Wanna play with me?\r<br />H: No. I need cure potion, you have stolen from somebody.\r<br />O: Sorry, I am not a healer, we are playing games here. Let as play. If you win, then I&#39;ll ask Z to not hit you into the head… too strong. If you lose – then… well, you know.\r<br />\r<br />If H agrees, then - as usually: “Ring – Zangief – back to Tavern”.\r<br />\r<br />H: I have a different proposition.\r<br />O: What the proposition?\r<br />\r<br />H takes Book of shadows out and loudly drops it on the table.\r<br />\r<br />H: S-H-A-D-O-W W-I-L-L S-W-A-L-L-O-W Y-O-U &#33;&#33;&#33;\r<br />\r<br />Everything around freezes and stops. Even fire seems to slower its moving. Dark, cold feeling falls down the tavern. After a second or two of absolute silence, all thieves jump on their places and run from tavern through doors and windows. Z leaves tavern with Olympic calm.\r<br />\r<br />O: &lt;with a broken voice&gt;What are you doing, bastard?\r<br />H: I am kindly asking you to give me the cure potion.\r<br />O: I have no cure, no cure. I was trying to use it. If you need a potion, go to N... He was searching for this … book. Get out of here&#33;\r<br />\r<br />\r<br />[Meeting Necromancer 2]\r<br />\r<br />Necromancer looks tensed but not aggressive.\r<br />\r<br />N: What do you need?\r<br />H: I have a problem with returning to real life. My body seems to be poisoned. And I know you are very good in making potions.\r<br />N: Why should I do something for you?\r<br />H: I have Book of shadows. I could give it to you in exchange.\r<br />N: Let&#39;s go.\r<br />\r<br />H follows N into his laboratory inside Pyramid. Enemies now rare, but more powerful. H fights together with N.\r<br />\r<br />Inside laboratory N gives to H cure and takes the book.\r<br />\r<br />N: Don&#39;t drink it inside Pyramid. If your body will be ultimately destroyed, then you&#39;ll stay here forever. This is how my seals work. Soul, not connected with outer world, can&#39;t leave Pyramid.\r<br />\r<br />Q&A:\r<br />\r<br />H: Sorry for what happened last time. Great warriors promised to help you gathering dark souls inside Pyramid.\r<br />N: Great warriors. &lt;angry&gt; These warriors spoiled Oblivion, poisoned with endless repentance, made it a prison for souls.\r<br />H: But one of them told me, you are doing the same work.\r<br />N: LIE&#33;&#33;&#33; I was always trying to make Oblivion a better place. Do you know, what Oblivion is? Did you read the book? Oblivion obeys rules of our collective imagination. It makes our dreams real, and if most of souls here conclude, they are in Heaven, Oblivion will make this real&#33;\r<br />But these “Great warriors” convince everyone, that Oblivion is a black dirty hole, that makes real only nightmares. Right, this is what we have.\r<br />H: But you are closing souls inside Pyramid.\r<br />N: I am trying to protect conscientiousness of others from influence of these souls. Dark souls in Pyramid may stay with their nightmares, but souls outside deserve something better.\r<br />\r<br />H: Do you know, what the Shadow is?\r<br />N: Nobody knows. But I know, that Shadows obey no rules. They don&#39;t depend on you, your magic or this book. They may appear at any place in any moment and look like just distraction of Oblivion space - there was something before and after a moment - there is nothing.\r<br />\r<br />After all questions are asked, N says: “Now go, I need to work.”\r<br />\r<br />BTW:\r<br />\r<br />If H drinks potion inside Pyramid, then he leaves Oblivion (potion is good).\r<br />\r<br />\r<br />[Meeting Princess]\r<br />\r<br />P: Did he give you potion?\r<br />H: Yes.\r<br />P: Well, you may try to leave Oblivion now.\r<br />\r<br />Q&A:\r<br />\r<br />H: Sure, it is safe to drink this?\r<br />P: This is the best, what you can do. Do you know, how N got here?\r<br />H: No.\r<br />P: He was searching for recipe of strong cure potion to save his beloved.\r<br />H: And what is now with his beloved?\r<br />P: I think she died. This is the only reason, why he is still here. I didn&#39;t ask N directly and he didn&#39;t told. But he learned good making such potions.\r<br />\r<br />H: And what about you? Do you want to leave Oblivion?\r<br />P: No. I think, my place is here. I don&#39;t know, who I am in real world, but know well, who I am here.\r<br />H: But… everyone want to leave Oblivion.\r<br />P: No. Not everyone. Remember Zangief? Everyone I know, got here for something. You – for Absolute calm spell, N – for cure, T – for enlargement of his … hmm… life. But Z entered Oblivion just to stay here. Strange man. You can&#39;t even imaging, how it was difficult, to convince him to not break into Pyramid “for a good fight”. Finally, he settled down in Land of thieves. I don&#39;t understand, what he is doing there.\r<br />\r<br />After drinking cure potion, H finds himself in the cave. He has all the inventory, he had before Oblivion, and he may take only 3 things from there: Absolute calm spell, Pure fire spell and Skarji-dagger (as a souvenir).\r<br />\r<br />\r<br />[Meeting Shaman 2]\r<br />\r<br />Shaman may be found at home. This episode may be skipped, if H don&#39;t want meeting him.\r<br />If H has chosen Eleesse, then Shaman says, he has just buried his dog.\r<br />If H has chosen Tahr, then Shaman says, his dog is much better. As you can understand, Tahr is the name of his dog.\r<br />\r<br />Q&A:\r<br />\r<br />H: What was the name of the lynx?\r<br />Sh: Who gives name to lynx? It was just lynx.\r<br />\r<br />H: What can you say about the cave, I was in?\r<br />Sh: A long time ago this was a holy place. I feel it. But then people made there a mine. They where digging soul gems out there. And they, probably, desecrated this place.\r<br />H: Did you find there soul gems?\r<br />Sh: No, not soul gems. Just some pieces. Almost useless. But you know, what is strange? When you usually find a soul gem, – it&#39;s empty. But these pieces…  Something was inside them already&#33;\r<br />H: And what did you do?\r<br />Sh: Nothing. I put them back. No need to anger goods without a reason.\r<br />\r<br />\r<br />-------------------------------------------- End of story ------------------------------------------",
  "categoryId": "82",
  "version": "32bit",
  "author": "and4",
  "createdUnix": "1457545171",
  "updatedUnix": "1457545171",
  "containsAdultContent": false,
  "uploadedBy": "and4",
  "primaryFile": null,
  "files": []
}