{
  "modId": 7412.0,
  "modName": "Volker An Alternative Start",
  "summary": "Volker is a Nord Knight Born and Raised in skyrim. (Read long Desc. Please i\\'ll include more Info there.",
  "descriptionHtml": "This is my first uploaded file, Its an Alternative start to skyrim and only Requiers you downloaders to make a few chages to the skyrim ini folder.\r\n[[Background]]\r\nVolker is a Nord Knight Born and raised in skyrim. When he was a boy he worked on his fathers mill. As a boy he was Facinated by the outside world (Which he never got to venture into) Untill he was 15. The mill was Raided by bandits, Volker ran and hid in the Celler for 4 days, When he came back up His house was destroyed and his father laid on the ground, Dead. Word got around that a boy named Volker was living alone in a Burnt down house, So a group of Nords took him in untill he was 21, Volker set out on his own and headed North, He finally got to the reach (One of the nine holds of skyrim) and set out for markarth where he then held up in an Abandoned House.\r\n\r\n[[Installation]]\r\nFor windows 7/Vista users Click on the Start icon down in the bottom left, Click on Documents, My games, Skyrim, Then click on the Skyrim .ini File it should be above another one called Skyrimprefs. under the Gerneral Header  type sstartingcell=Riverwood and save it. (Dont worry when you get to the main menu it will automatically take you to just outside riverwood) you can also use other ones by going to http://www.skyrimsearch.com/cells.php and Looking for a one you want.\r\nNext You can either download my saved game file or my bat file if you download my saved game File YOU DONT HAVE TO CHANGE THE SKYRIM INI FILE\r\nIf you load the bat file Download it and place it in you programfiles(x86)\\\\Steam\\\\Steamapps\\\\common\\\\skyrim DONT PUT IT IN THE DATA FOLDER and When you get into the game Open up the Console and type Bat Knight.\r\n\r\nNote. I will be uploading more Mods over the next while of Different classes if there is a certain Start you wouldent mind seeing Just Message me or comment.\r\nThanks :)\r\nand Happy hunting",
  "categoryId": "43",
  "version": "1.0",
  "author": "HochmeisterJR",
  "createdUnix": "1327941145",
  "updatedUnix": "1327942957",
  "containsAdultContent": false,
  "uploadedBy": "HochmeisterJR",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24355",
      "name": "Volker",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "920",
      "fileName": "Volker-7412-1.rar",
      "uploadedUnix": "1327942957",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/183214ce092a045983ec2b0911477b3d1ea4c3428ec523be5da288411d18b053/analysis/1406645429/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Volker-7412-1.rar?fid=24355&ttl=1535765428&ri=8192&rs=8192&setec=2aa28eb6f36bba0bf90d7dcbfe9306dd"
    }
  ]
}