{
  "modId": 7413.0,
  "modName": "Daighre Draconis True Follower V1_2",
  "summary": "Adds Daighre, the Pyromancer as an extra follower.",
  "descriptionHtml": "Daighre Draconis Version 1.0\r\n\r\n\r\n-------------------------------------------------------\r\n\r\nIntroduction\r\n\r\nI know there are lots of extra follower mods around, but I feel as if they\\'re missing something: character. This is one of the many mods I am planning to release (while waiting for the CK) that provides an alternative and fun extra follower you can play with while exploring Skyrim.\r\n\r\n-----------------------------------------------------------\r\n\r\nChangelog\r\n\r\n1.2\r\n- Replaced Fire Shout to Fire Breath (lore)\r\n\r\n\r\n1.1\r\n\r\n- Fix fast travelling issues. Reset Daighre using \\\"resurrect\\\" in the console.\r\n- Added Fire Resistance to Daighre.\r\n\r\n\r\n\r\n-----------------------------------------------------------------\r\n\r\nROLEPLAY\r\n\r\n\\\"You are not the first\\\"\r\n-Arngeir to the Dragonborn\r\n\r\nFor others, High Hrothgar is a place of mystery, a secluded solace for those seeking The Way of the Voice and the mastery of the Thu\\'um. But only few of those who had heard the Greybeard\\'s summons answer the call, let alone survive the seven thousand steps to High Hrothgar. Those that do survive, spend their days perfecting what they can learn, and over time, their numbers slowly dwindle, down to a select few individuals, leaving to seek out their own destiny outside the Walls of High Hrothgar.\r\n\r\nAmong such individuals who left High Hrothgar is Daighre Draconis, the Pyromancer. She came to High Hrothgar to quench her thirst for power, her insatiable desire for all things to burn cost her life, but through the ordeal she discovered her Thu\\'um, and through the Greybeards, learned silence and peace, and through their teachings, finally controlled her power and diverted it into something good - life, in the form of a humble beginning as a mother working in the Mines of Markarth.\r\n\r\nBut this simple life will not last, for Alduin the Destroyer, has arrived. But she is well aware, and has sensed the presence of another power, the Dovahkin, Dragonborn, the one that will vanquish the destroyer, and eversince she has been waiting for the moment when the Dovahkin will come to Markarth and when that day comes, she will take up arms against the threat of destruction, wielding the fury of flames, purging Tamriel of the danger that lurks in the skies of Skyrim, once and for all.\r\n\r\n--------------------------------------------\r\n\r\n\r\n\r\nInstallation\r\n\r\n1. Extract Daighre.esp to your Skyrim/Data Folder.\r\n\r\n2. Extract Daighre.txt to your Skyrim Folder.\r\n\r\n3. Activate the esp file through your Mod Manager.\r\n\r\n4. Go to Left Hand Mine in Markarth. When you go there you will find a naked girl.\r\n\r\n5. press the tilde or Esc key to open the console, click her and type \\\"resurrect\\\" she will fade in and out.\r\n\r\n6. Using the console again, type \\\"Bat Daighre\\\"\r\n\r\nCongratulations, you now have an extra follower, complete with Follower Dialogue.\r\n\r\n- Talk to Daighre to give her items! No need for the console!\r\n- She follows! No Choice!\r\n\r\n----------------------------------------------------------\r\n\r\n\r\n\r\nDaighre Draconis Stats\r\n\r\nLevel 50 Pyromancer\r\nHealth 200\r\nMagicka 500\r\nStamina 100\r\n38 perks allocated, 11 free\r\n\r\nPrimary Skills\r\nDestruction 75\r\nConjuration 80\r\nAlteration 75\r\n\r\nSecondary Skills\r\nIllusion 50\r\nRestoration 30\r\n\r\n- Sneak and Lockpicking are set to 100, for gameplay reasons\r\n\r\nSpellbook/Skillset\r\n\r\nPrimary Spells (what she will always use)\r\nIncinerate left hand/right hand\r\nFlame Cloak\r\nConjure Flame Atronach\r\nFire Shout 3/3\r\n\r\nSecondary Spells (what she will use w/ PISE AI against fire immune targets)\r\nIcy Spear left hand/right hand\r\nEbony Flesh\r\nFast Healing\r\nGreater Ward\r\n\r\nNotable Perks\r\n\r\nDestruction Tree\r\nNovice - Expert Destruction\r\nAugmented Flames 2/2\r\nIntense Flames\r\nAugmented Frost 2/2\r\nDeep Freeze\r\nDestruction Dual Casting\r\nImpact\r\n\r\nAlteration Tree\r\nNovice - Expert Alteration\r\nStability\r\nMage Armor 3/3\r\nMagic Resistance 3/3\r\n\r\nConjuration Tree\r\nNovice - Expert Conjuration\r\nSummoner 1/2\r\nAtromancy\r\nElemental Potency\r\n\r\nIllusion Tree\r\nNovice Illusion\r\nHypnotic Gaze\r\nAspect of Terror\r\n\r\nRestoration Tree\r\nNovice Restoration\r\nRecovery 1/2\r\nRegeneration\r\n\r\n--------------------------------------------------------\r\n\r\n\r\nFAQ\r\n\r\n\r\n1. What is your idea behind Daighre?\r\n\r\nThe Idea is to provide the community a Baldur\\'s Gate like experience using Extra Followers. I know many Skyrim Fans had experienced playing Baldur\\'s Gate Series, and that one of fun factors playing that game is the variety of characters you encounter and group with. \r\n\r\nVanilla Skyrim followers are generally, dull. They have no distinct flavor in them other than some basic spells/AI. With Foretrenty\\'s  NPC Editor, it allows us to have a temporary workaround with the follower selection, even up to the point where you can have a Baldur\\'s Gate like party travelling with you in Skyrim!\r\n\r\n\r\n\r\n2. Why A Fire Mage/Pyromancer? Why not just put all skills/spells?\r\n\r\nWhat fun would it be to have a follower that knows everything, does everything and much more than you? You might just as well toggle tgm and put all skills to your character. Like in real life, NPCs should have different skills and the aim of this mod is to provide an extra follower with an \\\"attitude\\\". I also have game balance in my mind. I do not want to provide a mod that would ruin the experience, though with the bat file included I am sure most of you will not use it as I intend it to be, but it is your prerogative and I ask for honesty in your game.\r\n\r\nHaving said that, the reason why I chose a fire mage is because fire spells provides the best DPS for generic fights and the worst output in dragon fights. For roleplaying reasons, fire is the most primal element not only in the world of fantasy but also in real life. It provides life (sun, volcanoes, heat, cooking) as well as death (destruction, explosion, burning). Thus it is a good contrast to the cold climate of Skyrim, and brings enough flavor for Daighre as a mage of high caliber (being able to produce such terrible display of fiery magic in winter conditions) as well as being in-line to be balanced in a variety of fights without trivializing the game.\r\n\r\n\r\n\r\n3. But uuhm, she one shots people in my game?\r\n\r\nI designed Daighre with a dark-age modded game in mind. I am playing with PISE, Deadly Dragons, Duel and Wars in Skyrim. For a Vanilla Game Daighre is indeed imbalanced, and if you prefer a vanilla-balanced extra follower then this mod is not for you.\r\n\r\n\r\n\r\n4. Why can\\'t I tweak the Bat file?\r\n\r\nIt is very easy to unlock. It is intended that way so as to filter out the \\\"cheaters\\\". I figure that if you know how to use this mod, how to unlock the bat file, then you are old/mature enough to not use the bat file to buff/nerf your character, Daighre or any follower you may have, and are well aware that cheating to win is a sad way to play the game. \r\n\r\nBut I have no other control other than this lock, and like I said earlier, the use of this mod, especially the Bat file is your choice. I only wish that you use it as intended (to complete the setup) or just feel that a 200 hp mage is not a good idea on your hardcore settings.\r\n\r\n\r\n\r\n5. Why the 200/500 health/magicka split and why not set all skills to 100?\r\n\r\nLydia and the rest of the Housecarls stop levelling with you at level 50. Level 50 provides 49 points to allocate between Health, Magicka and Stamina. An additional 1 point is added to Daighre to even out the stats. Daighre is level 50, and I tailored her skills to match a level 50 PC.\r\n\r\nI also want to provide an incentive to players to actually plan how they are going to gear up their followers instead of randomly just putting gear at them. \r\n\r\n\r\n\r\n6. I like how you create flavor in your followers, is there any more upcoming mods from you?\r\n\r\nI have released Fultheim, you can find him here in Nexus. I haven\\'t been able to convert him as a true follower, so the V1 Fultheim, imbalanced he may be, is still up for grabs. I will release Mena the Nightgale soon, I think I broke her while playtesting her (she keeps casting those darn bound bows! >.<) and I ran out of time so I will release her sometime soon instead of later along with Daighre.\r\n\r\nI am also tweaking Lydia, but Lydia mods are so abundant I feel as if I would eventually just make a shield/blocker follower from scratch.\r\n\r\n--------------------------------------------------------\r\n\r\n\r\n\r\nIssues\r\n\r\n- Daighre can sometimes charge in melee. It just means she ran out of mana, give her potions.\r\n\r\n- She doesn\\'t seem to follow you inside cities. It is a vanilla issue, just pretend she went of to do her businesses. (possibly fixed in 1.1)\r\n\r\n- She can friendly fire with her spells/shout! Watch it! :)\r\n\r\n-----------------------------------\r\n\r\nCredits\r\n\r\nForetrenty, creator of Skyrim NPC Editor\r\n\r\n----------------------------------\r\n\r\nWANT MORE FRIENDS FOR DAIGHRE?\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7545 <- Teeba-Ei, Phantom of the Marsh\r\n\r\n\r\n",
  "categoryId": "33",
  "version": "1.1",
  "author": "miniminionette",
  "createdUnix": "1327941656",
  "updatedUnix": "1328121297",
  "containsAdultContent": false,
  "uploadedBy": "miniminionette",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24348",
      "name": "Daighre Draconis",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Daighre Draconis-7413.rar",
      "uploadedUnix": "1327941844",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fbab0ddf12cf6f5d5690eefac3bdd56d333ba781fba0f70b6ae3469ef1e6edd6/analysis/1406645421/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daighre%20Draconis-7413.rar?fid=24348&ttl=1535765429&ri=8192&rs=8192&setec=0bbe67c2a3b2ba0d643bd33277e0cfde"
    },
    {
      "fileId": "24407",
      "name": "Daighre Draconis 1_1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Daighre Draconis 1_1-7413.rar",
      "uploadedUnix": "1327955329",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/18b7be729fbf1e243bcb25d50cc88bf67c011516f2871f6b1e7e0080695b118d/analysis/1406645769/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daighre%20Draconis%201_1-7413.rar?fid=24407&ttl=1535765430&ri=8192&rs=8192&setec=c7dd4d0025727a43cd886ce2447940ac"
    },
    {
      "fileId": "24879",
      "name": "Daighre Draconis 1_2",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "Daighre Draconis 1_2-7413.rar",
      "uploadedUnix": "1328091459",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/4ea558a0c58002dea8b9ced2637a5047cf9e81c3108df4da0f351dc011752a73/analysis/1406648104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daighre%20Draconis%201_2-7413.rar?fid=24879&ttl=1535765430&ri=8192&rs=8192&setec=d0101b7ef9366a4ac37f0e0744840424"
    },
    {
      "fileId": "25015",
      "name": "Daighre Draconis 1_2b",
      "version": "1.2b",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "Daighre Draconis 1_2b-7413-1-2b.rar",
      "uploadedUnix": "1328121297",
      "modVersion": "1.2b",
      "virusScanUrl": "https://www.virustotal.com/file/403d47c4a3776e932e93bf461b530dc2ae12e73768a0430952589e63f748cd7a/analysis/1406648853/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daighre%20Draconis%201_2b-7413-1-2b.rar?fid=25015&ttl=1535765431&ri=8192&rs=8192&setec=657c898458ef3a1af2856a0c1a9b6f1d"
    }
  ]
}