{
  "modId": 7420.0,
  "modName": "Burkart An Alternative start to Skyrim",
  "summary": "Burkart and Alternative start to Skyrim, Read more for Extra Details",
  "descriptionHtml": "[[Description]]\r\nBurkart is a hunter living in one of skyrims many forests He has never lived in one place for more then a week and has been hunting since he was 10 He is currently living just outside a Shack With an Old man and an eleven year old kid named Hamming (From Helgan) Burkart has been saving up  some money From selling pelts to merchants.\r\n[[Installation]]\r\nFor windows 7/Vista users Click on the Start icon down in the bottom left, Click on Documents, My games, Skyrim, Then click on the Skyrim .ini File it should be above another one called Skyrimprefs. under the Gerneral Header type sstartingcell=Riverwood and save it. (Dont worry when you get to the main menu it will automatically take you to just outside riverwood) you can also use other ones by going to http://www.skyrimsearch.com/cells.php and Looking for a one you want.\r\nNext You can either download my saved game file or my bat file if you download my saved game File YOU DONT HAVE TO CHANGE THE SKYRIM INI FILE\r\nIf you load the bat file Download it and place it in you programfiles(x86)\\\\Steam\\\\Steamapps\\\\common\\\\skyrim DONT PUT IT IN THE DATA FOLDER and When you get into the game Open up the Console and type Bat Burkart\r\nHappy Hunting",
  "categoryId": "43",
  "version": "1.0",
  "author": "HochmeisterJR",
  "createdUnix": "1327948694",
  "updatedUnix": "1327948954",
  "containsAdultContent": false,
  "uploadedBy": "HochmeisterJR",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24378",
      "name": "Burkart",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "912",
      "fileName": "Burkart-7420-1-0.rar",
      "uploadedUnix": "1327948954",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14e04c59254eaf381c74dc87b86d43eba5e161c4787db327461b564e73034bd6/analysis/1406645585/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Burkart-7420-1-0.rar?fid=24378&ttl=1535765443&ri=8192&rs=8192&setec=71f78fc205b8877fda2c2c12d6717e8d"
    }
  ]
}