{
  "modId": 74229.0,
  "modName": "VS Paige Hood FOR HAIR USE",
  "summary": "Adds eleven standalone hoods, that can be used with female hairs. UNP and Vanilla, may possible work with CBBE base body.",
  "descriptionHtml": "VS Paige Hood v1.0. Adds eleven Standalone female hoods.\r<br />\r<br />[center][color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]      MY MODS [u]MAY NOT[/u] BE FEATURED ON OTHER SITES FOR REDISTRIBUTION. THEY [i]ARE NEXUS EXCLUSIVE AS STATED IN THE PERMISSIONS AND ONLY AVAILABLE THROUGH NEXUS[/i]. NO PERMISSIONS WILL BE GRANTED OTHERWISE. [color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]ALL VIOLATORS WILL BE NAMED AND SHAMED PUBLICLY... and reported of course :)\r<br />[color=#ff0000][size=4][color=#00ffff][color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]This includes uploading translations without my permission&#33;&#33;&#33;[/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/center]\r<br />\r<br />[size=5]Cape and Breast flaps for the poncho will be coming soon. Bear with me. \r<br />[/size]\r<br />\r<br />[color=#ffff00][size=4]Hey Ladies&#33;&#33;&#33;\r<br />Are you tired of going bald everytime it rains or snows in Skyrim... because you had to put a hood on? Does it come down to that age old question, &#34;Do I put on that hood again and get mistaken for a scrawny bandit? Or do I dare tip the fate of Realistic Needs and Diseases, embrace the Wet and Cold, and die of the Rattles? Yeah... I guess I could risk it... one time?&#34;\r<br />\r<br />Well... no more&#33;\r<br />\r<br />Introducing the Paige Hood&#33; This is an extra large hood meant to allow you to keep your hair while you cover up in the rain and cold of Skyrim. YES&#33; HOOD ALLOWS FOR HAIR&#33;&#33;&#33;&#33; Damned be the Ashes, damned be the rain, and damned be that awful cold of Skyrim. We need hair&#33; We&#39;re women. Our grandfathers always said &#34;A woman&#39;s hair is her crown.&#34; And it is&#33; It&#39;s meant to be there for the whole world to gaze upon and be envious. So wear that crown all over Riften town and laugh at those men in ragged skin tight hoods.\r<br />[/size]\r<br />[/color]\r<br />[color=#ff0000][size=3]It does not, however, work with all hairstyles, though. There are clipping issues with some hairs (mainly around the neckline of the hood opening with longer styles). There are always limitations modders cannot get around. I designed it to work with many of the KS Hairdos, since they are the best dang hair meshes to date. Works also with Vanilla Hairs, Lovely Hairs, SC Hairstyles, and most likely Apachii and SG hairs.  This will not work well with hairstyles that are long in back. It&#39;s meant basically for those that are short or long in the front. I hope to add an additional hood in the future specially for the big and long hairs.\r<br />\r<br />A few examples:[/size][/color]\r<br />\r<br />     \r<br />  [img]https://56.media.tumblr.com/1120a1f70598cbe1b2cee7c2fd90e3b7/tumblr_o42bk8aJEF1v1phuro8_r1_1280.jpg[/img]  \r<br />\r<br />[color=#ffff00][size=4]AND..... Protects you from the elements of [url=http://www.nexusmods.com/skyrim/mods/31968]Wet and Cold[/url]. I&#39;d like to see a metal bikini armor do that. Actually, I wouldn&#39;t. No one needs to see frozen cheeks lying on the ground.[/size][/color]\r<br />[img width=559,height=314]http://staticdelivery.nexusmods.com/mods/110/images/74229-0-1458157105.jpg[/img]\r<br />\r<br />I purposely made the hood large to accommodate some of the crazier KS hairs without clipping through the hood exterior. So yeah, it&#39;s larger than other hoods. But hey, big hoods use to be in fashion in the 16th century. Because women had ridiculous big wigs under then.\r<br />\r<br />Female only, if that wasn&#39;t obvious. I will not be making a male version. Because seriously: one, it&#39;s ultra girly and two, men do not have big hairs. But us ladies certainly do, and we need more love in the mod department. Skyrim is too cold.\r<br />\r<br />This is for UNP and Vanilla with weight slider support. May work with CBBE base body, but I haven&#39;t tested it yet. This was designed around my [url=http://www.nexusmods.com/skyrim/mods/72966]Paige Cuirass[/url] mod, to fit that particular armor shape. But I have tested it with Witcher armors like Yennefer and Triss and it works just as well. The colours choices are also based on the Paige Cuirass. This is essentially an add-on for the Paige. So, I am not making additional colour choices beyond what I have already planned for this mod. And I will not be taking requests for any. And no requests for lore this or that. This is, as is, as it is meant to be.\r<br />\r<br />It&#39;s craftable at the tanning rack, can be upgraded and enchanted. It occupies body slot 45 so you can wear your earrings, necklaces, circlets, satchels... whatever doesn&#39;t take up body slot 45. And it has a light armor rating. There are currently eleven colours in the pack\r<br />\r<br />I will not be making body sliders, nor authorizing body sliders to be made. I will not be making other body conversions or allowing for body conversions. I&#39;ve seen enough unrealistic, jiggly HDT, ridiculous proportioned body mods to know that I do not want to see my meshes/textures on such said silliness. I make mods for the girls, and guys, who are fed up with that same silliness.\r<br />\r<br />[center][color=#ffff00][size=3]PLANNED FUTURE ADD-ONS:[/size]\r<br />This is suppose to have three variations total.\r<br />A standalone hood and caplet\r<br />Hood/caplet with cape\r<br />Hood/caplet, cape and poncho flaps for the torso front.\r<br />\r<br />Right now it is just the standalone hood and caplet. I am still working on the textures for the other parts \r<br />and planning the additional hood for larger and longer hairs. They are on a temporary hold. \r<br />As updates are available they will be posted through my[/color] [url=https://www.tumblr.com/blog/vicioussarr]Tumblr[/url].[/center]\r<br />\r<br />\r<br />[center][color=#1e84cc][size=5]INSTALLATION:[/size][/color]\r<br />Install manually if you like, or just use the standard NMM or MO. If you do not want to craft the items, you can use \r<br />[url=http://www.nexusmods.com/skyrim/mods/64905]AddItemMenu[/url] mod and search under &#34;Paige Hood&#34;\r<br />\r<br />\r<br />[color=#1e84cc][size=5]REQUIREMENTS:[/size][/color]\r<br />Hair.\r<br />\r<br />\r<br />[color=#1e84cc][size=5]CREDITS:[/size][/color]\r<br />These are my original meshes and textures, except for the tie at the neck. That came from Witcher 3. So 99% me, 1% CD Projekt Red.\r<br />So, thank you CD Projekt Red for making that cute little tie I could use with everything. Literally.\r<br />\r<br />\r<br />[color=#1e84cc][size=5]PERMISSIONS:[/size][/color]\r<br />Cannot be uploaded to other sites. This is for Nexus only. \r<br />Again, I am not allowing body conversions or body sliders\r<br />Cannot be used in other mods or altered without my expressed permission.\r<br />Cannot be used for monetary gain.\r<br />\r<br />\r<br />\r<br />[color=#ffff00]Check out my other mods[/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/72966]The Paige Cuirass[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/73952]VS Bella&#39;s Lingerie\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/74132]VS Witcher 3 Shani Standalone Colours[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/72509]VS WItcher 3 Ciri DLC Armor\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/72348]VS Witcher 3 Triss Recolour\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/72395]VS Witcher 2 Ves Recolour\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/74111]VS Witcher Yennefer Standalone Colours\r<br />[/url][url=http://www.nexusmods.com/skyrim/mods/73953]VS Silver Amulet of Mara[/url][/center]",
  "categoryId": "54",
  "version": "v1.0",
  "author": "ViciousSARR",
  "createdUnix": "1458017121",
  "updatedUnix": "1458016602",
  "containsAdultContent": false,
  "uploadedBy": "vicioussarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000199363",
      "name": "VS Paige Hood v1.0",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14250",
      "fileName": "VS Paige Hood v1.0-74229-v1-0.rar",
      "uploadedUnix": "1458016602",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3fb390bb7ee8437363b843228d4fd7d4f2a5c28f336541f5f66c2726fa169e69/analysis/1458016629/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VS%20Paige%20Hood%20v1.0-74229-v1-0.rar?fid=1000199363&ttl=1535863001&ri=8192&rs=8192&setec=4482f0df5dddc40315151e6472a65fe5"
    }
  ]
}