{
  "modId": 74223.0,
  "modName": "GroundUp - Anti Grass Clipping",
  "summary": "Should minimize clipping issues at some locations when using a grass mod...",
  "descriptionHtml": "Just a little fix that changes or replaces the ground textures on some spots around Skyrim to reduce grass clipping when using mods that change grass density.\r<br />[Some Grass Mods like Verdant or Unique Grass add Grass to texterues which originally came without grass. This makes the desired dense and  more varied appearance. Side effect of this are clipping issues of grass through buildings, tents, fire places etc.. On some of this places this mod solves that.]\r<br />\r<br />- No DLC covered and needed up to now  \r<br />\r<br />I made this just for myself and it&#39;s far away from a comlete solution. But maybe someone would like to have this too. Maybe It will be updated from time to time\r<br />\r<br />It should be compatible with everything and every texture and grass replacer out there.\r<br />\r<br />If you use DynDoLod, probably it should be updated. \r<br />\r<br />Load Order: Although not so important, load it at the bottom of your load order to make sure it works\r<br />\r<br />Most Changes were made around cities and villages. I also covered the Stormcloak and Imperial camps and some other spots like hunting camps, streambeds etc..\r<br />\r<br />You might notice some places without grass in the middle of nowhere. \r<br />It&#39;s because I use the Mod Corners of Skyrim, which I would recommend for all rangers out there:\r<br />\r<br />http://www.nexusmods.com/skyrim/mods/29824/?\r<br />\r<br />At last there is a place close to whiterun ready for your own camp. \r<br />\r<br />Everythig should look naturally without big barren areas.\r<br />\r<br />\r<br />Servus et salut&#33;\r<br />\r<br />novathule\r<br />\r<br />(Lore: \r<br />Shipped from the Dark Alchemists guild of Mondiabolo directly to Skyrim... Groundup can be used to eliminate every herb without any risk for your health...) - And yes there is really no chance of getting cancer from food ingame....",
  "categoryId": "62",
  "version": "1.0",
  "author": "novathule",
  "createdUnix": "1457994148",
  "updatedUnix": "1458069654",
  "containsAdultContent": false,
  "uploadedBy": "novathule",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000199430",
      "name": "GroundUP",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2785",
      "fileName": "GroundUP-74223-1-0.7z",
      "uploadedUnix": "1458069654",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/59c7ceeae0fd6001be74dcf8b372a2ea93b0d3c2463e681fd96c888f1383eb3e/analysis/1458069664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GroundUP-74223-1-0.7z?fid=1000199430&ttl=1535862993&ri=8192&rs=8192&setec=a18ed6b82e6d9e36fa99d9fc84d4fd7c"
    }
  ]
}