{
  "modId": 74306.0,
  "modName": "VS Bella&#39;s Lingerie V2 Spring Collection",
  "summary": "Adds 17 standalone undergarments for UNP and Vanilla female only. And an option of 17 files to choose from as Vanilla underwear replacer.",
  "descriptionHtml": "[color=#6d9eeb][size=3][center][color=#ff0000][size=4][color=#00ffff]      MY MODS [u]MAY NOT[/u] BE FEATURED ON OTHER SITES FOR REDISTRIBUTION. THEY [i]ARE NEXUS EXCLUSIVE AS STATED IN THE PERMISSIONS AND ONLY AVAILABLE THROUGH NEXUS[/i]. NO PERMISSIONS WILL BE GRANTED OTHERWISE. [color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]ALL VIOLATORS WILL BE NAMED AND SHAMED PUBLICLY... and reported of course :)\r<br />[color=#ff0000][size=4][color=#00ffff][color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]This includes uploading translations without my permission&#33;&#33;&#33;[/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/center]\r<br />\r<br />Well ladies.... it&#39;s Spring and time to celebrate the upcoming floral array.[/size][/color]\r<br />\r<br />[color=#ffff00][size=4]Standalone Pack:[/size][/color]\r<br />Version 2 of Bella&#39;s Lingerie features 17 new styles of undergarments all with full corsets and bikini style underwear.\r<br />They are craftable at the tanning rack. And since these are linen, as shown by their textures, you will need linen wraps and leather strips.\r<br />Upgrading at the workbench will only improve it&#39;s monetary value. It has no armor rating, because, well it&#39;s underwear. There will be no armor\r<br />rating applied to this in the future or by request because, again, it is underwear. You wear the underwear under ( &lt;---- operative word) the armor.\r<br />This is for aesthetics only, for those who are sick of the yellow Vanilla underwear caked with dirt. And meant primarily for Vanilla body users who cannot find underwear that works with the body.\r<br />\r<br />It&#39;s does come with the UNP body, which is only equipped when the undergarment is equipped. So no having to change your Vanilla body if you do not want to. It comes also with the Xenius XCE skin textures for clean skin. You&#39;re underwear are finally clean, your skin should be too&#33;\r<br />\r<br />[color=#ffff00][size=4]Replacer Pack[/size][/color] [color=#00ffff](VERY IMPORTANT INSTALLING INSTRUCTIONS FOR THIS ONE):\r<br />[/color][size=2]The replacer pack contains the same 17 undergarment sets; however, as these are replacers for the Vanilla underwear, you can only install one per game.\r<br />What you will download is an archive filled with 17 archives. Unzip the main archive with whichever program you have. DO THIS BEFORE YOU OPEN NMM OR MO. Once the main zip is unpacked you will be able to access the individual replacers. Choose the colour you want and add that one archive to your NMM or MO.\r<br />\r<br />The replacers will work with both Versions 1 and 2 of Bella&#39;s Lingerie.\r<br />\r<br />The replacer comes with a UNP body but will use your pre-installed skin textures. If you want the Xenius clean skin for the replacer, it can be obtained through Xenius or by manually unpacking the standalones and extracting the skin texture folder to install in your game engine.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][size=4]The Undergarments:[/size][/color]\r<br />\r<br />This is not meant to be lore-friendly to the actual Skyrim lore. And as such I will not be implementing any changes or taking requests to make it otherwise. I included 3 plain linens (Brown,Creme,Grey) for a somewhat lore fabric style, but that is all I am offering. The other 14 sets are brightly coloured floral and vintage patterns as would have been used in our own historical undergarments. So I went with real life lore. These garments look how I intended for them to be, so they are as is.\r<br />\r<br />\r<br />[center][i][color=#ff0000][size=4]And as always: if you do not like this mod, then do not use it. All negative comments will be ignored, or deleted if need be.[/size][/color][/i][/center]\r<br />\r<br />\r<br />[center][color=#6d9eeb][size=5]Installation:[/size][/color]\r<br />It was covered above but, just in case you skipped right down to this--- Standalone instant use for NMM or MO. Vanilla underwear Replacers--- go back up the page and read the instructions. Everything is pretty straight forward. I made it as user friendly as possible. \r<br />\r<br />[size=2][color=#6d9eeb][size=5]Credits:\r<br />[/size][/color][/size]The meshes/textures for the corset and bottoms are my original work. Patterns for textures from Photoshop.\r<br />UNP body: dimon99\r<br />XCE Skin Textures: Xenius\r<br />\r<br />[size=2][size=2][color=#6d9eeb][size=5]Requirements:[/size][/color][/size][/size]\r<br />Vanilla or UNP female body use. You do not have to download anything extra. The bodies and skin textures are already included. These packages are all inclusive to make things easier for everyone.[/center][/size][size=2][size=2][size=2][color=#6d9eeb][size=5][center]Permissions:[color=#ffffff][size=2]\r<br />Same as always: This mod MAY NOT be uploaded to other mod sites or blogs. Nexus exclusive.\r<br /> It may not be altered or used in other mods without my expressed permission\r<br />I am not authorizing body sliders, body conversions or HDT for all the jiggly bits.[/size][/color][/center][/size][/color][/size][/size][/size]",
  "categoryId": "60",
  "version": "v1.0",
  "author": "ViciousSARR",
  "createdUnix": "1458332893",
  "updatedUnix": "1458332558",
  "containsAdultContent": false,
  "uploadedBy": "vicioussarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000199742",
      "name": "VS Bella&#39;s Lingerie V2 Spring Collection Standalone Pack",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "34513",
      "fileName": "VS Bella's Lingerie V2 Spring Collection Standalone Pack-74306-v1-0.rar",
      "uploadedUnix": "1458330336",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ecbd4b866710a9e08ebfea68f138e29795ea3afe24a42c94b711ec5b2cd6a0bd/analysis/1458330370/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VS%20Bella%27s%20Lingerie%20V2%20Spring%20Collection%20Standalone%20Pack-74306-v1-0.rar?fid=1000199742&ttl=1535863091&ri=8192&rs=8192&setec=e63932eb18d31768575394a5c0023884"
    },
    {
      "fileId": "1000199744",
      "name": "VS Paige Hood v1.0",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79557",
      "fileName": "VS Paige Hood v1.0-74306-v1-0.rar",
      "uploadedUnix": "1458332558",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b023df01bb84942162a4f73ac3b1ccbdac368ccf8e9ad4749eceec074106b029/analysis/1458332595/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VS%20Paige%20Hood%20v1.0-74306-v1-0.rar?fid=1000199744&ttl=1535863092&ri=8192&rs=8192&setec=79d367e3123cb4881324badc2d81a5ef"
    }
  ]
}