{
  "modId": 74321.0,
  "modName": "Eldar",
  "summary": "Eldar the High Elf ",
  "descriptionHtml": "[b][size=5]Ideal new save game - includes the latest unofficial and official patches you can find them within the nexus - All DLC included - High Elf - Pure Magic User\r<br />[/size][/b][b][size=4]\r<br />Role Playing Purposes[/size] [/b][i][size=4]because I am bored&#33; [/size][/i]\r<br />\r<br />[size=4][b]The Fall of Eldar\r<br />[/b]\r<br />[/size][size=4]The Family of Eldarin was one of the last lineage who once lived and ruled peacefully at the Summerset Isle, the very first era of Altmers who retained most of their ancestor&#39;s &#34;Aldmer&#34; immortality. The City of Eldar prospered by the just and rightful rule of the The Family of Eldarin. In the time of Loredas in the afternoon an envoy from one of the Kingdoms challenged the seat of Eldarin questioning their tyranny over the other Kingdoms, The Family head was astounded by such statement for he knew nothing of what transpired in the other Kingdoms the envoy recounted how some of their territories destroyed in a single night without notice. The Seat of Eldarin explained that he is not aware of the things happening outside his Kingdom, the Envoy delivered a warning that if they have garnered enough proof they will have to forged alliances from other Kingdoms. \r<br />\r<br />Distraught of such events the Head of the Eldarin journeyed to visit his old friend from his neighboring Kingdom, The Head voiced his opinion before the council of Elin his old friend that he has no desire for conquest nor riches and never he instigated the raids of other Kingdom&#39;s territories. Elin in his trust forged an Alliance with Eldarin same with the smaller Kingdoms took part as well, until in one eventful day a peace summit was held at the Palace of the City of Eldar over all the Kingdoms of Summerset Isle are invited and only the Leaders of each Kingdom is allowed to take part and a small unit to accompany them to talk about peace, a grand gathering after such discussions and mutual understanding. A figure from the pedestal of the pantheon stood and said &#34;Fall&#33; You shall be the stepping stones for the Aldmeri Dominion to Flourish&#33; Hail the Dominion&#33;&#34;\r<br />\r<br />One by one they fall into their knees and later on succumbing to their deaths. &#34;The Wine they are poisoned?&#33; But how poison cannot harm us nor disease&#33;&#34; Elin, Eldarin and other leaders tried to put a fight but this event was planned they were outnumbered. Elin seeing a horrifying future and an end to their endeavors finally know the truth that his friend Eldarin would never betray him as the Aldmeri Dominion cornered them, a desperate flight she mustered all the magicka she can charged and let loose a flying thundering bolts in every direction killing many of the Dominion but she was struck by a fell arrow with the same poison that hastens her vulnerability. \r<br />\r<br />Eldarin quickly helped Elin out to the balcony running as fast as he can aiding his wounded friend, &#34;Dear friend I am sorry to have doubted you...&#34; in her weakening voice. &#34;I would never betray you my friend...&#34; and that instance when she said that words &#34;I still hold you in my heart, and shall it be may the Light redeem us...&#34; she breathe her last. Eldarin in a moment shed a tear for the life he have lost watching the place burn in the night sky as the stars stare down at him. The City of Eldar was engulfed by the flames of the Dominion killing those who are still loyal to the Family of Eldar, all his brothers, sisters and his parents was killed in the onslaught few vassals who remained loyal to him guided him and joined his little militia. At every turn the Dominion would always know their plans, they would always know when they will strike until they finally gave up. Bitter tears, sadness and loses he finally bid his loyal vassals to set on a new life, taking new identities and even joining the Aldmeri Dominion. He finally gave up himself and destined to be executed. In the place of the execution the Aldmeri Dominion have not expected of one Great Revolt. The old settlers of Eldar City begun to mustered themselves and many of the masses from neighboring kingdoms joined the cause saving the life of a righteous leader who lead them to peace and prosperity. \r<br />\r<br />His last loyal vassal was the one who planned the rebellion that is to take place &#34;Why? cease at once&#33; do not shed any more blood for me&#33;&#34; &#34;Your liege, It is my honor to serve you until my death and it shall be so...The Light will redeem us&#33; You must journey across Tamriel find your weaknesses and strengths, come back reclaim which is rightfully yours&#34; In the midst of the chaos his Vassal used a potion to let him sleep, &#34;Carry, the Lord to the port and protect him by all means he must reach the sea and land far away from here&#33;&#34; they tarry no longer and proceeded in the chaos without the Dominion knowing or following at last. Safe and sound the boat ferried him far away.\r<br />\r<br />When his eyes gained vision he looked up around him searched for water, food all that he can have to survive. Reminding him of what has transpired, his city, his siblings, parents, his vassals and Elin. \r<br />\r<br />&#34;From now on I am called...Eldar&#34;\r<br />[b]\r<br />Note: [/b]\r<br />This save file is where you can choose your race, High Elf of course as the story dictates or else if you want I put here because I am bored. If you are using High Elf path or like to role play as Eldar follow this...\r<br />\r<br />[b][i]Appearance[/i][/b]\r<br />To make Eldar look more like Aldmer original elves like look in Skyrim lore the chin need to go[i] \r<br />Chin width[/i] and [i]Chin length[/i] will do the trick as for the weight I set it in the middle, also a darker complexion would result a more human like as for me I choose the lightest complexion so I may look like less Ancient Aldmer, more like their descendants. I decided to have no eyebrows.\r<br />\r<br />[b][i]Combat\r<br />[/i][/b]In my game play I sold everything I have when I am out of Helgen&#33; also get the free items you were given. Do some little wood chopping sell the smith quest items collect ingredients in the surrounding get the gold&#33; get a ride to Winterhold from whiterun stables and join the Winterhold College. What I did is train in Illusion, Destruction, Restoration, Alteration, Conjuration and Alchemy. When you reach 100 of each skills go for Legendary&#33; purely magic as I say. Its a hard Journey but you can manage as long as you can live (I am 24 now and still not graduated, and even no job my sorry life&#33;) invest on magicka a lot when you reach legendary invest in health. After that you can go to your melee combat options it will be quite awhile to level up. (No cheats here ok? its the good gameplay)     \r<br />\r<br />\r<br />[/size]",
  "categoryId": "43",
  "version": "",
  "author": "Me",
  "createdUnix": "1458401362",
  "updatedUnix": "1458401362",
  "containsAdultContent": false,
  "uploadedBy": "masatoishikawa90",
  "primaryFile": null,
  "files": []
}