{
  "modId": 74371.0,
  "modName": "The Skyforge Project",
  "summary": "The Skyforge Project aims to ease the burden for any 3D modellers by providing various assets for universal usage. No promissory rights are required to use the issued files in your own published work and credential support is not required. Take what you need and use it&#33; ",
  "descriptionHtml": "[font=Trebuchet MS]                                                           [/font][font=Courier New][size=6]THE SKYFORGE PROJECT\r<br />[/size][/font]                                                                                                [font=Lucida Sans Unicode]Version 2.0\r<br />[/font][line]\r<br />\r<br />Welcome to the home of the most ambitious project for 3D design. Here, you will find countless modelling pre-sets to be used at your leisure and edited to your preferences. While containing many variations of weapons, the project will also be home to several miscellaneous item models, such as furniture and utilities. Our aim is to provide the best possible resources for many 3D designers out there, without handing across all of the work on a silver platter.\r<br />   As every model is [i]intentionally[/i] basic, we leave you to apply your very own textures and detailed features without the tedious task of creating a weapon template. In addition, you do not require any permission to use our files and publish your own versions, and we do not request credit for the use of our work. If you want it, use it. No strings attached.\r<br />   We know that it can severely downgrade your work if you credit another author in your mod description, and we want you to feel 100% satisfied with your mods. When we realised the number of mod recourse publishers requesting credit and sometimes even permission (I know, ridiculous right?) to even use their custom assets, we decided to make a stand. In doing so, we have made the first small steps towards something great. We hope you agree when you come to use our work.\r<br />     \r<br />                                                                                   [font=Times New Roman]   [size=5]How to use our files\r<br />\r<br />[/size][/font]When you install one of our files, you will be met with a compressed zip folder containing all sorts of funky file formats. Don&#39;t panic, this isn&#39;t an ENB. You don&#39;t have to be some rocket scientist to know what our files do. Each of them is exactly the same work, but we simply took the liberty of converting them for your convenience. The main formats inside are definitely the [b]3ds[/b] and [b]blend[/b] files, which are what you will be working with most of the time. Below, I have taken the liberty of listing every format we support and explaining exactly what they are used for.\r<br />\r<br />[b].blend files-\r<br />\r<br />[/b]These files are very simple, as they use a source code unique to the [i]Blender[/i] software. Since [i]Blender[/i] is a free program, we thought that it would be ideal to provide one for designers that do not have any alternatives.\r<br />\r<br />[b].3ds files-\r<br />[/b]\r<br />These files are very common among 3D designers, especially those implementing their work into games. For Skyrim, 3ds formats are required with their appropriate mesh when using a program capable of opening [b]nif[/b] files. This is also one of the file formats used by Autodesk 3ds Max 3D modelling, rendering and animation software. However, it is no longer its native format.\r<br />\r<br />[b].dae files-[/b]\r<br />\r<br />This is an interchanging format used for exchanging digital assets between graphics programs. It is very likely that you will not touch this format, but it is there just in case you need it for any reason.\r<br />\r<br />[b].fbx files-\r<br />[/b]\r<br />This is a proprietary format owned by Autodesk. It allows interoperability between digital creation applications. Again, it is very unlikely that you will even use this file.\r<br />[b]\r<br />.obj files-[/b]\r<br />\r<br />This is a widely accepted format, used for its advanced visualiser animation package. It is a very simple data format that represents 3D geometry alone. You will almost certainly not look at this twice, but some people may need it for personal reasons. After all, we never said you had to use our models for Skyrim...\r<br />\r<br />[b].ply files-[/b]\r<br />\r<br />This format is principally designed to store 3 Dimensional data from 3D scanners. They support a simple description of an object an a list of nominally flat polygons.\r<br />\r<br />[b].stl files-[/b]\r<br />\r<br />This format is native to the stereolithography CAD software created by 3D systems. If you want to print our work for some odd reason, this is the way to do it.\r<br />\r<br />[b].x3d files-[/b]\r<br />\r<br />This format supports multi-stage and multi-texture rendering, as well as shading with lightmap and normalmap. It is capable of importing SSAO, CSM and realtime environment lighting and reflection.\r<br />\r<br />\r<br />So, that is every possible file that you will see us publish. Many of them are quite complex to describe, but I hope that these vague descriptions provide some enlightenment. As I said before, the two that you will most likely be working with are the [b]blend[/b] and [b]3ds [/b]files, but we provided the rest for more advanced users that may wish to use our work for other purposes.\r<br />\r<br />                                                                                                  [font=Times New Roman][size=5]Can I help?\r<br />\r<br />[/size][/font]Of course you can. We welcome any volunteers to step up and submit their model pre-sets. However, they must meet the following conditions.\r<br />\r<br />- The file MUST be presented as one of our supported file types. If not, it is very likely that your work will not be added to our collection.\r<br />- No textures. The model must be a template with untouched normalmaps.\r<br />- No explicit sexual representation such as sex toys. That&#39;s naughty.\r<br />- No copyright material, such as work that belongs to another person on the nexus or elsewhere.\r<br />\r<br />If all of the requirements are met, you may see your submission appear on our list. If so, your username will be added to the description and the credits section. By submitting your work, you are giving us permission to publish it and thus any other user on the Nexus to download/edit it. To permission or credential support will be required. Please Email your work to josh.gorst54189@gmail.com for the chance to have your work involved with the project.\r<br />\r<br />                                                                                                 [font=Times New Roman] [size=5]Submissions\r<br />\r<br />[/size][/font]Simple Sword, By Nophatus\r<br />Simple Staff, By Nophatus\r<br />Simple Dagger, By Nophatus\r<br />Simple Mace, By Nophatus\r<br />\r<br />                                                                                                            [font=Times New Roman][size=5]FAQ\r<br />\r<br />[/size][/font]The FAQ is currently empty because nobody can be arsed to ask any questions.\r<br />\r<br />                                                                                                        [font=Times New Roman]  [size=5]Activity\r<br />\r<br />[/size][/font][b]20/03/16-[/b]\r<br />- 2 file(s) added: Simple Sword, Simple Staff\r<br />- 3 image(s) added: Simple Sword, Simple Staff, Project Logo\r<br />- Background changed: Project logo\r<br />- Hot files thumbnail changed: Project logo\r<br />- Short description changed\r<br />- Version set to 1.0\r<br />\r<br />21/03/2016-\r<br />- 1 file(s) added: Simple Dagger\r<br />- Noticeboard feature added\r<br />- Noticeboard updated\r<br />- 1 image(s) added: Simple Dagger\r<br />\r<br />22/03/2016-\r<br />- Noticeboard updated\r<br />- Maintenance initiated: 15:27\r<br />- Version set to 2.0\r<br />- File(s) removed: Simple Sword, Simple Dagger, Simple Staff\r<br />- File(s) added: Simple Sword, Simple Dagger, Simple Staff\r<br />- Maintenance Ended: 18:21\r<br />\r<br />23/03/2016-\r<br />- 1 file(s) added: Simple Mace\r<br />- 1 image(s) added: Simple Mace",
  "categoryId": "29",
  "version": "2.0",
  "author": "The Skyforge Project Team",
  "createdUnix": "1458504366",
  "updatedUnix": "1458749459",
  "containsAdultContent": false,
  "uploadedBy": "Nophatus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000200260",
      "name": "Simple Dagger",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "283",
      "fileName": "Simple Dagger-74371-1-0.zip",
      "uploadedUnix": "1458663811",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fa5d900c341ced2cfc73cc2bd3cc62a76fcbfb8a20fbef39c7ddad4ac2416e08/analysis/1458663843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Dagger-74371-1-0.zip?fid=1000200260&ttl=1535863165&ri=8192&rs=8192&setec=5a80a3585d4d33c2e65b69397ec69f6c"
    },
    {
      "fileId": "1000200262",
      "name": "Simple Staff",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17063",
      "fileName": "Simple Staff-74371-1-0.zip",
      "uploadedUnix": "1458664296",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2e21f918a9d6bc5483913bf1febaf94d04a26c3d00a974b94fc4cdb30250499d/analysis/1458664327/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Staff-74371-1-0.zip?fid=1000200262&ttl=1535863165&ri=8192&rs=8192&setec=3d8106accfb81331cebebf6da10023c3"
    },
    {
      "fileId": "1000200271",
      "name": "Simple Sword",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1958",
      "fileName": "Simple Sword-74371-1-0.zip",
      "uploadedUnix": "1458666617",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/53a16da7a4aa4df5dcecb2dd7e49308157ef28b29063e27aaa473da83792ca63/analysis/1458666665/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Sword-74371-1-0.zip?fid=1000200271&ttl=1535863166&ri=8192&rs=8192&setec=67edb49bffe591814396512a8addc870"
    },
    {
      "fileId": "1000200367",
      "name": "Simple Mace",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "277",
      "fileName": "Simple Mace-74371-1-0.zip",
      "uploadedUnix": "1458749459",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c7e7633ada10edb32fe9660344c9ff3898ccac5d4cfe0a9a03338345a63f6022/analysis/1458749463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Mace-74371-1-0.zip?fid=1000200367&ttl=1535863166&ri=8192&rs=8192&setec=4a03388793a5af533ab267490d5f3868"
    }
  ]
}