{
  "modId": 7447.0,
  "modName": "Better Hjomes and Manors",
  "summary": "Want to buy Hjerim, (or Proudspire Manor), but don\\'t want to start a war to get it? Have I got the thing for you.",
  "descriptionHtml": "INSTALL: Extract all files to the DATA folder of your Skyrim directory.\r\n\r\nUNINSTALL: Remove all files that were contain in this installation from your DATA folder.\r\n\r\n\r\n\r\nDescription:\r\n\r\n Recently I wanted to purchase Hjerim in Windhelm, it being, for my money, one of the nicest homes available in Skyrim. I didn\\'t want to get involved in the civil war yet just to buy the place, (I\\'m still on the fence on which evil is the better of the two). So, I did some research and a buttload of experimenting and I finally figured out how to purchase, clean up and decorate the whole thing, and now you can too.\r\n\r\n This is the culmination of many, many, (did I say many yet), hours of trial and error using BATch files. Ok, it didn\\'t take 2 months or anything, but OMG! Finally it paid off and then I just had to do Proudspire Manor as well. Wish I was more fond of Proudspire then Hjerim, \\'cause Proudspire was a breeze compaired to Hjerim. I had to pick up each little individual bone fragment, beer bottle, cobbweb...what a mess.\r\n\r\n Anyway, to get this party started, download the file and extract to the Skyrim DATA folder, then run and load the game. When you\\'re in, go into the console, \\\"~\\\", and type \\\"bat buyhj\\\" to buy Hjerim or \\\"bat buypm\\\" to buy Proudspire Manor. Once it\\'s done loading and you\\'re in the jarl\\'s throne room, you have a choice to make. You can go finish your purchase with clean ups and decorating or you can leave it alone and put in your own stuff. Now, for Hjerim, I\\'m not sure I\\'d suggest doing it yourself, it\\'s really a mess. If you want me to do the work for you, just go back into the console and type \\\"bat buyhj2\\\" to finish the Hjerim purchase or \\\"bat buypm2\\\" to finish the Proudspire Manor purchase. When it is done, you will be whisked away to your new home, no cost to you, all decorated and all messes neatly tucked away under the rug. The homes should be completely cleaned up and completely decorated, no blood, no bones, no boxes, etc. If they are not, (if you don\\'t see the gold being taken from you in the upper left hand corner after you do the second part), then try the last BAT command, the one with the 2 in it, again. This isn\\'t so much of an issue for faster computers, but on older computers it just might not get the decorations for you the first time, (second time should be a charm).\r\n\r\n The Hjerim purchase will complete the \\\"Blood on the Ice\\\" quest and the Proudspire Manor purchase completes the quest \\\"Return Torgg\\'s Horn\\\" for Jarl Elisif. I tried both of thees on an unpatched version of Skyrim many times, even from the very beginning, in Helgen, and they both hadn\\'t failed me once, (well, after I got them done up all proper).\r\n\r\n Hope you enjoy, and when I get a free minute, I might do the rest. Cheers.\r\n\r\nEDIT: OK, I completely flummoxed that last update. I had put the files in the wrong directory. I am sorry. Version 1.3 should now work on new and older computers. ",
  "categoryId": "53",
  "version": "1.3",
  "author": "TonyBalony",
  "createdUnix": "1327976188",
  "updatedUnix": "1327987858",
  "containsAdultContent": false,
  "uploadedBy": "TonyBalony1960",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24540",
      "name": "Buy Homes part 1",
      "version": "1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Buy Homes part 1-7447-1-3.zip",
      "uploadedUnix": "1327987858",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/417937c65bbd6accae875dcf6ca681249327732302a2abfd39a491ee386ada9e/analysis/1406646372/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Buy%20Homes%20part%201-7447-1-3.zip?fid=24540&ttl=1535765492&ri=8192&rs=8192&setec=0bb20272c4fc4de3a7e54a3e574e98bc"
    }
  ]
}