{
  "modId": 74474.0,
  "modName": "Adrian-Standalone Follower",
  "summary": "When the strong are not held accountable, the weak suffer the consequences. Knights represent the noblest of warriors who stand up against this sort of behavior and offer up their strength to stop those who abuse martial prowess.",
  "descriptionHtml": "[size=4]--Contents--[/size]\r<br />\r<br />1- Overview\r<br />2- Follower Details\r<br />3- Requirements\r<br />4- What&#39;s New&#33;\r<br />5- Future Plans\r<br />6- FAQ\r<br />7- Install, Upgrade, Uninstall\r<br />8- Credits\r<br />9- Permissions\r<br />\r<br />[size=4]--Overview--[/size]\r<br />When the strong are not held accountable, the weak suffer the consequences. Knights represent the noblest of warriors who stand up against this sort of behavior and offer up their strength to stop those who abuse martial prowess. Clad in shining armor, wielding razor sharp blades and mounted atop mighty steeds, knights selflessly serve the realm and swear oaths of fealty to uphold the ideals of society and serve their patron with unswerving loyalty. Let all monsters, outlaws and evildoers beware, for if they cross paths with a knight of honor they will not survive for long&#33;\r<br />\r<br />[size=4]--Follower Details--[/size]\r<br />[size=3]SKILLS[/size]\r<br />One-Handed\r<br />Heavy Armor\r<br />Block\r<br />Smithing\r<br />Speech\r<br />Illusion\r<br />\r<br />[size=2]Base Stats[/size]: 0:2:1 (Magicka, Health, Stamina)\r<br />\r<br />[size=2]Race[/size]: Nord\r<br />\r<br />[font=Courier New][size=4]THE CODE OF CHIVALRY[/size][/font]\r<br />\r<br />-Believe the Divines&#39; teachings and observe all the Temple&#39;s directions.\r<br />-Defend the Temples of the Divines.\r<br />-Respect and defend the weak.\r<br />-Love your homeland.\r<br />-Do not recoil before an enemy.\r<br />-Show no mercy to heretics. Do not hesitate to make war with them.\r<br />-Perform all duties that agree with the laws of the Divines.\r<br />-Never lie or go back on one&#39;s word.\r<br />-Be generous to everyone.\r<br />-Always and everywhere be right and good against evil and injustice.\r<br />\r<br />***[size=3]Note[/size]: Adrian can be found in the Bannered Mare. He is essential, therefore; he can&#39;t be killed by anyone without the use of console commands. He wears a set of Blades Armor and uses a Blades Sword. Adrian is also marriageable (any race/gender), all you need to do is complete the quest &#34;The Bonds of Matrimony&#34;. \r<br />\r<br />[size=3]***MOD CLEANED WITH TESVEDIT***[/size]\r<br />\r<br />[size=4]--Requirements--[/size]\r<br />Required: Skyrim 1.9.29.0.8+\r<br />Recommended: SKSE 1.7.3+\r<br />Recommended: SkyUI\r<br />\r<br />[size=4]--Future Plans--[/size]\r<br />[size=2]\r<br />-Custom Voice\r<br />-Expand on personality[/size]\r<br />\r<br />[size=4]--Install & Uninstall--[/size]\r<br />\r<br />To install the mod:\r<br />1- Download Adrian-Standalone Follower\r<br />2- Put the ESP and BSA into the proper Skyrim Directory\r<br />3- Launch Skyrim\r<br />\r<br />To uninstall the mod:\r<br />1- Dismiss Adrian from service\r<br />2- Delete the ESP and BSA\r<br />\r<br />*[size=3]NOTE[/size]: If you decide to marry Adrian and wish to uninstall, you can&#39;t keep the save file in which you married him&#33;*\r<br />\r<br />[size=4]--FAQ--[/size]\r<br />\r<br />Q: Where do I find him?\r<br />A: He is in the Bannered Mare, usually sitting opposite Uthgerd.\r<br />\r<br />Q: Why is he automatically a follower?\r<br />A: Adrian is a knight and knights are sworn to help whom ever requires his services. That being said, he will NOT attack citizens and WILL NOT steal anything.\r<br />\r<br />Q: Can you change the bodies used to X?\r<br />A: No, this is the body in its finished state and this is what I&#39;m sticking with, that isn&#39;t to say that I won&#39;t improve upon it in updates.\r<br />\r<br />Q: I don&#39;t like the body&#33; How do I change it?&#33;\r<br />A: Create this path in your data folder: meshes/adrianfollower/actors/character/adiran/body. Place the body meshes, hand meshes and feet meshes inside this path and it will overwrite the custom default body that the mod uses. For Textures: textures/adrianfollower/actors/character/adrian/body\r<br />\r<br />Q: Why does his hair disappear/clip when I give him a helmet?\r<br />A: This has nothing to do with my mod. The hairstyle was taken from KS Hairdos Renewal, therefore I can&#39;t change the way she set up her hairstyles. Sorry.\r<br />\r<br />Q: His hairstyle clips with X armor set. Can you fix it?\r<br />A: The hairstyle will clip with some armors. It&#39;s impossible to make that the hairstyle won&#39;t clip with all armors. If it really bugs you, adjust it yourself.\r<br />\r<br />Q: Can you change his hairstyle to X?\r<br />A: No, please change it yourself. It&#39;s not that difficult.\r<br />\r<br />Q: Why does my body mod not replace this body?\r<br />A: I have added a custom body to the follower. If you wish to change the body, replace my meshes/textures with the ones you want.\r<br />\r<br />Q: How do you marry someone in Skyrim?\r<br />A: First, visit the Temple of Mara in Riften and talk to the priest, Maramal. Buy the Amulet of Mara for 200 gold, then talk to Maramal about Skyrim&#39;s marriage traditions.\r<br />\r<br />Q: Where is the temple of Mara in Skyrim?\r<br />A: Located in Riften.\r<br />\r<br />Q: &#34;Insert rude/pointless/dumb hate comment&#34; here\r<br />A: [img]http://replygif.net/i/1279.gif[/img]\r<br />\r<br />[size=4]--Credits---[/size]\r<br />- Chris57 & FavouredSouls for the mod Better males - Beautiful nudes and faces: http://www.nexusmods.com/skyrim/mods/2488/?\r<br />- Kalilies for the mod KS Hairdos: http://www.nexusmods.com/skyrim/mods/68311/?\r<br />- Urshi for the mod Smooth Male Body - textures for Better Males - SOS Schlongs of Skyrim: http://www.nexusmods.com/skyrim/mods/26145/?\r<br />- LogRaam for the mod The Eyes Of Beauty: http://www.nexusmods.com/skyrim/mods/13722/?\r<br />- Developers of Gimp which was used to create the texture files \r<br />- Nif-Tools team for making NifSkope \r<br />- Bethesda for the Game and Creation Kit\r<br />\r<br />***[size=3]Note[/size]: If you feel I used your work and did not give proper credit let me know in the comments or by PM.***\r<br />\r<br />[size=4]--Permissions-- [/size]\r<br />Adrian - Standalone Male Follower may be translated into another language without my permission as long as you credit me as the original creator. \r<br />Adrian - Standalone Male Follower may NOT under any circumstances be hosted or uploaded by anyone but me, anywhere, ever. (With the explicit exception of translations) \r<br />Reviewers, spot-lighters, and critics are free to use and record footage of the mod so long as proper crediting is made clear. \r<br />Adrian - Standalone Male Follower may be modded in a similar manner to Skyrim under the following conditions: \r<br />- No files that are packaged as part of Adrian - Standalone Male Follower may be redistributed in any way shape or form. This includes the ESP and any files contained within the BSA. The reason for this is because I am not the creator of quite a few assets used in the mod, I have permission from the original creators to use their assets but that doesn&#39;t mean that you do. \r<br />- Your mod must require Adrian - Standalone Male Follower as a master. You are not allowed to repackage AdrianFollower.esp. Just like with Skyrim, direct people to this page to download Adrian - Standalone Male Follower, then they may download your child-mod separately. \r<br />- You must make it abundantly clear that I am the author of Adrian - Standalone Male Follower and preside over it&#39;s files. \r<br />- You must make it clear that your mod is not supported by me in any way shape or form, and is an independent mod with it&#39;s own responsibilities and faults.\r<br />- Your mod MUST BE FREE.\r<br />\r<br />[b][size=5]  [font=Lucida Sans Unicode]***Mod Cleaned With TesVEdit***[/font][/size][/b]\r<br />\r<br />[size=4]--My Other Mods--[/size]\r<br />Blood of Olympus: http://www.nexusmods.com/skyrim/mods/71818/?",
  "categoryId": "96",
  "version": "1.10",
  "author": "Enrico Marrocco",
  "createdUnix": "1458931037",
  "updatedUnix": "1477529371",
  "containsAdultContent": true,
  "uploadedBy": "RicoPietro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000200839",
      "name": "Adrian Standalone Follower v1.10",
      "version": "1.10",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30407",
      "fileName": "Adrian Standalone Follower-74474-v1-10.zip",
      "uploadedUnix": "1459135519",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/15c108b7e2589e29e8552a8e96c3a2ee027ee252a04db0cd2baea1b310b490bf/analysis/1459135569/",
      "changelogHtml": " -Gave Adrian Custom Face\r<br />\r<br />-Gave Adrian Custom Outfit\r<br />\r<br />-Gave Adiran Better Combat Style <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adrian%20Standalone%20Follower-74474-v1-10.zip?fid=1000200839&ttl=1535863309&ri=8192&rs=8192&setec=9a31abe83d16a9a1b58d7ef293b5bfc6"
    },
    {
      "fileId": "1000225702",
      "name": "Adrian Preset",
      "version": "v.100",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "7",
      "fileName": "Adrian Preset-74474-v-100.zip",
      "uploadedUnix": "1477529371",
      "modVersion": "v.100",
      "virusScanUrl": "https://www.virustotal.com/file/3d6fe6a9b7562b947e102efcc4b6541ffe4d64a3e03f7a318fde167de14ae6cc/analysis/1477529402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adrian%20Preset-74474-v-100.zip?fid=1000225702&ttl=1535863310&ri=8192&rs=8192&setec=816c0026cd8701bd1ddbb4dfd4000db9"
    }
  ]
}