{
  "modId": 7456.0,
  "modName": "Hotties of Skyrim",
  "summary": "A list of attractive female NPCs in Skyrim in spreadsheet form and information on them such as race, location, ID codes, my rating, etc.  Batch files to help ease the process.  An overview of the marriage system in Skyrim.  Helpful console codes.  My female Breton hottie starter save.  Lots of screenshots included!",
  "descriptionHtml": "Hotties of Skyrim by CrushBoss\r\n\r\nChange Log\r\n===========\r\n1.0 - Initial Release - Jan 30, 2012\r\n1.1 - Updated Description, Readme, made minor improvements to the Spreedsheet, added missing Fastred screenshots, added additional screenshots for Abelone, Lydia, Karita, Katana, and Sapphire.  Moved Katana (my female Breton hottie) screenshots to it\\'s own folder - Feb 1, 2012\r\n1.2 - Updated Description and Readme with web links to all the mods I used.  Updated Marriage section.  Added Divorce section.  Added two more console codes to spreadsheet and PDF file.  Fixed resurrect syntax - Feb 5, 2012\r\n\r\nWhat This Is\r\n===========\r\nA list of attractive female NPCs in Skyrim\r\nInformation and location codes of each hottie\r\nRating for each hottie based on their head appearance only\r\nRatings are based on my personal opinion\r\nThe first section contains marriable hotties - console codes may be required to activate\r\nThe second section contains non-marriable hotties of importance in Skyrim\r\nOnly hotties rated 7 or higher are listed (on a scale from 1 to 10)\r\nBatch files to simplify the process of using console commands to marry and divorce\r\nA copy of my female Breton hottie Katana (starter character)\r\n\r\nWhat This Isn\\'t\r\n==============\r\nA complete list of every female NPC in Skyrim\r\nA complete list of every marriable NPC in Skyrim\r\nA list of good looking male NPCs\r\nA compilation of meshes and textures\r\n\r\nConsole Codes - WARNING\r\n========================\r\nConsole codes have the potential to CRASH your game!  PLEASE make a backup copy of your Saves BEFORE using them.  You need to visit each hottie the old fashioned way (on foot) FIRST before using the console codes.  Not doing this may break the game and certain quests.\r\nYou have been warned.\r\n\r\nMarriage\r\n========\r\nIn order to marry in Skyrim you have to get and wear an Amulet of Mara and start the marriage quest from Maramal in Riften in the Temple of Mara.  Maramal will give you an Amulet of Mara as part of the marriage quest.  Some NPCs require that you complete a quest or series of quests for them or for the city\\'s Yarl in order for the marriage option to appear.\r\nHousecarls - Lydia, Iona, Argis the Bulwark, Calder, Jordis the Sword-Maiden (all require you to complete quests for the Yarl, Steward, Advisor, or Thane of the city).\r\nSome hotties require that you finish a faction quest line in order to become available such as those in the Companion\\'s, Thieves, and Dark Brotherhood guild.  After doing all relevant quests for the NPC, if the marriage option doesn\\'t appear you will need to use console codes to make it work.\r\n\r\nOnce you propose you will need to go back to Maramal to arrange the wedding.  It will be held the next day in the Temple of Mara in Riften and your bride will show up.  After the ceremony your bride will disappear, no honeymoon I guess.  She can be found in her usual location.  Go speak with her and select a home for her.  All homes you own are an option as well as her home in most cases.  UPDATE:  Your new wife will leave immediately after you say \\\"I do\\\".\r\nIf you are quick you can talk with her before she leaves the Temple of Mara (hit TAB quickly and talk with her after saying \\\"I do\\\").  You can then select which home you want her to live in without having to track her down at her usual location.\r\n\r\nNOTE:  Most people having trouble getting the marriage option to appear forget to wear the Amulet of Mara\r\n\r\nMarriage Benefits\r\n==============\r\nYour spouse will cook you a hot meal once a day when requested and give you an extra resting bonus if you spend the night.\r\n\r\nDivorce\r\n======\r\nIn order to divorce your wife you will need to open up the console and target her so that her ID shows up on the screen.  Type in \\'bat divorce\\' (see Batch Files section below) without the quotes or type in the console codes listed in the \\'Hotties of Skyrim\\' spreadsheet or PDF file.  You then need to drop or sell your Amulet of Mara (you cannot have one in your inventory).  Talk with Maramal in the Temple of Mara in Riften and purchase a new Amulet of Mara.  Put it on and you are now free to marry a new wife.\r\n\r\nSuggestions\r\n===========\r\nSuggestions are welcome as long as they are female, attractive, and have a unique look.  Flames and unprofessional comments will not be looked at.  I will only be looking at hotties that I consider to have a rating of 8 or higher.  There may have been a few that I missed.  Originally I had 5s and 6s listed but the list grew too large and might discourage people from using it.  I trimmed it down to what I feel is reasonable.  I don\\'t think anyone wants to track down 50 ladies to see which one they like the best.  For this reason I only listed those who I felt were the best looking in the game.\r\n\r\nHotties List\r\n===========\r\nThe hotties list is provided in Microsoft Excel and PDF format.  If you have Excel you can sort the list by rating, location, race, or anything you wish.  I have verified the NPC location codes from several sources.  For some reason in Skyrim the location codes don\\'t always work and I haven\\'t seen a rhyme or reason for it as one time they will work and another time they won\\'t.  If all else fails go to the area listed and then to their location on the list.  Most of the hotties roam and wander and aren\\'t always in the specified location.  Usually you can find them wandering around town, at the local Inn or Tavern, at the merchant booths in town, or at their home at night.\r\n\r\nScreenshots\r\n============\r\nThe screenshots are high quality close-ups of each hottie.  I converted them to JPG format to save space.  I have a high performance rig and used max graphic settings.  I had a difficult time getting good screenshots with good lighting.  For this reason some of the hotties (picture backgrounds) aren\\'t in their normal area in Skyrim.  The hotties also don\\'t always have their default outfits on.  I may fix this at a later time.\r\n\r\nBatch Files\r\n===========\r\nI included two batch files that will save you time when forcing the marriage option or divorcing someone is Skyrim.\r\n\r\nmarry - forces the marriage option to work on nearly any NPC\r\ndivorce - forces divorce on your current wife - you are then free to marry someone else\r\n\r\nTo install the batch files you will need to copy marry.txt and divorce.txt into your Skyrim Data folder (..\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\Data)\r\nTo use these batch files open up the console using the ~ key, click on the hottie once (so their code shows up on the screen) and then type in \\'bat marry\\' or \\'bat divorce\\' without the quotes.\r\n\r\nHotties Look\r\n============\r\nIn order to make the hotties look like they do in the screenshots you will need to have the following mods installed in this order:\r\n\r\nXCE - Xenius Character Enhancement - http://skyrim.nexusmods.com/downloads/file.php?id=2356\r\nXCE - CBBE compatibility patch - http://skyrim.nexusmods.com/downloads/file.php?id=2356\r\nSummer Fashion - http://skyrim.nexusmods.com/downloads/file.php?id=1384\r\nSummer Fashion - less version - http://skyrim.nexusmods.com/downloads/file.php?id=1384\r\nImproved NPC Clothing - High Res - http://skyrim.nexusmods.com/downloads/file.php?id=2674\r\nImproved NPC Clothing - INPCC Expansion Pack - http://skyrim.nexusmods.com/downloads/file.php?id=2674\r\nKiller Keos Skimpy CBBE Armor Set - http://skyrim.nexusmods.com/downloads/file.php?id=3654\r\nKiller Keos Silly Huge Pack Addon - http://skyrim.nexusmods.com/downloads/file.php?id=3654\r\nUKC Uglykidcids CBBE Armor and Clothing Replacers - http://skyrim.nexusmods.com/downloads/file.php?id=4043\r\nMillenia Weapon Retexture Project - http://skyrim.nexusmods.com/downloads/file.php?id=1754\r\nBeautiful Skyrim - HD Weaponry - http://skyrim.nexusmods.com/downloads/file.php?id=1377\r\nFemale Elven Cuirass - Skimpier - CBBE - http://skyrim.nexusmods.com/downloads/file.php?id=5111\r\nFemale Khajiit Skin for CBBE - http://skyrim.nexusmods.com/downloads/file.php?id=2679\r\nCatwalk - Normal - http://skyrim.nexusmods.com/downloads/file.php?id=5053\r\nSkimpy Falmer Armor CBBEv2compatible - http://skyrim.nexusmods.com/downloads/file.php?id=4129\r\nCBBE - Black Dragonplate - Top - http://skyrim.nexusmods.com/downloads/file.php?id=3867\r\nCBBE - Black Dragonplate - Main - http://skyrim.nexusmods.com/downloads/file.php?id=3867\r\nBlood Metal Daedric Armor and Weapons - http://skyrim.nexusmods.com/downloads/file.php?id=1722#content\r\nCover Khajiits - Female and Male - http://skyrim.nexusmods.com/downloads/file.php?id=5941#content\r\nPerfect Legionnaire - Imperial Armor Reforged - Male - http://skyrim.nexusmods.com/downloads/file.php?id=6085#content\r\nCBBEv3 Imperial Armor Replacer Female - http://skyrim.nexusmods.com/downloads/file.php?id=7096#content\r\nRevealing Skimpy Thieves Guild or GM Armor - Female - http://skyrim.nexusmods.com/downloads/file.php?id=4569\r\nDaedric Female Armor Replacer - http://skyrim.nexusmods.com/downloads/file.php?id=5162\r\nCBBE Daedric Female - http://skyrim.nexusmods.com/downloads/file.php?id=6316\r\nSomewhat Skimpy DragonScale Armor - http://skyrim.nexusmods.com/downloads/file.php?id=5411\r\nAOF Believable Hair - http://skyrim.nexusmods.com/downloads/file.php?id=4307\r\nCalientes Female Body Mod Big Bottom Edition - CBBE - http://skyrim.nexusmods.com/downloads/file.php?id=2666\r\nCalientes Female Body Mod Big Bottom Edition - CBBE - Silly Huge optional - http://skyrim.nexusmods.com/downloads/file.php?id=2666\r\nCalientes Female Body Mod Big Bottom Edition - CBBE - Hip textures fix for clothing still using version 2 CBBE - Curvy - http://skyrim.nexusmods.com/downloads/file.php?id=2666\r\nBetter Females by Bella - http://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nBetter Females by Bella - Makeup Version 3 - http://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nBetter Females by Bella - No Face Shine (most screenshots were taken without this mod) - improves look - http://skyrim.nexusmods.com/downloads/file.php?id=2812\r\nNo More Blocky Faces (most screenshots were taken without this mod) - improves look - http://skyrim.nexusmods.com/downloads/file.php?id=30\r\n\r\nIf you use other mods that affect appearance your hotties may look different.   I also couldn\\'t find certain armor types that looked good for the CBBE body type.\r\nI changed the following:\r\nFalmer -> Iron\r\nEbony -> Nightingale\r\nYou will need to copy files around in your meshes and texture folders in order to make this happen.  Don\\'t do this unless you feel comfortable (advanced users only).\r\nMake a backup copy of the Data folder first!  In other words if an NPC is wearing Falmer or Iron armor they look the same (Falmer meshes and textures).\r\nThe same goes for Ebony/Nightingale.\r\n  \r\nFacial and Hair Appearance\r\n==========================\r\nFor those who only want to match the facial and hair appearance of the hotties and aren\\'t concerned about the armor, clothing, or body type, you will need to install the following mods in this order:\r\n\r\nXCE Character Enhancement\r\nAOF Believable Hair\r\nBetter Females by Bella\r\nBetter Females by Bella - Makeup Version 3\r\nBetter Females by Bella - No Face Shine\r\nNo More Blocky Faces\r\n\r\nEnjoy,\r\n\r\nCrushBoss\r\n",
  "categoryId": "28",
  "version": "1.2",
  "author": "CrushBoss",
  "createdUnix": "1327979897",
  "updatedUnix": "1328489182",
  "containsAdultContent": true,
  "uploadedBy": "CrushBoss",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24521",
      "name": "Save 519 - Katana  Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1131",
      "fileName": "Save 519 - Katana  Skyrim-7456-1-0.rar",
      "uploadedUnix": "1327980710",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8ef3fe6b7c4f964c26a80f636a890c031435f17238a7eac27983a9aab31d1124/analysis/1406646362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Save%20519%20-%20Katana%20%20Skyrim-7456-1-0.rar?fid=24521&ttl=1535765502&ri=8192&rs=8192&setec=a3754f3f7518958aeb6a1c98fac32cca"
    },
    {
      "fileId": "25070",
      "name": "Hotties of Skyrim - Screenshots 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "50831",
      "fileName": "Hotties of Skyrim - Screenshots 1_1-7456-1-1.rar",
      "uploadedUnix": "1328138069",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fea3738202326ec1fdf0df87b9405897f282a2737de0ba15add368b095f76f05/analysis/1406649123/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotties%20of%20Skyrim%20-%20Screenshots%201_1-7456-1-1.rar?fid=25070&ttl=1535765503&ri=8192&rs=8192&setec=98a35f94ffef2626bde41b45d810fbeb"
    },
    {
      "fileId": "26285",
      "name": "Hotties of Skyrim 1_2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32",
      "fileName": "Hotties of Skyrim 1_2-7456-1-2.rar",
      "uploadedUnix": "1328489182",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d2410cccfd5c64923b88392bdbc735a5a399466f807b348626aab611af70806a/analysis/1406656029/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotties%20of%20Skyrim%201_2-7456-1-2.rar?fid=26285&ttl=1535765504&ri=8192&rs=8192&setec=ed89f3eb114995595add162fc3c5ef27"
    }
  ]
}