{
  "modId": 74620.0,
  "modName": "Athletics - a Skill for Campfire",
  "summary": "Introducing the first not-Chesko mod to take advantage of Chesko&#39;s skill system, and implement an Athletics system that&#39;s well-scripted&#33;",
  "descriptionHtml": "THE ONLY FILE CURRENTLY ON THIS PAGE IS AN APRIL FOOLS DAY JOKE THAT SPAWNS EPIC MUDCRABS IN EVERY CITY. DON&#39;T USE IT.\r<br />\r<br />This is the first mod to take advantage of Chesko&#39;s new Campfire perk tree system. Everybody go endorse Campfire.\r<br />\r<br />Second, back up all your saves, because this is the first release of this mod, and I will not pretend to be perfect with Papyrus.\r<br />\r<br />Alright, backed everything up? Good.\r<br />\r<br />This mod implements bonuses to sprinting and jumping based on factors like stamina percentage, carry weight and current inventory weight, the armor you&#39;re wearing, and new perks from a new skill tree using the Campfire skill system. The tree has two sides: running and jumping. The mod offers perks that implement bonuses affected by other gameplay elements and affecting other gameplay elements. The perks are listed below.\r<br />\r<br />[list]\r<br />[*]Athlete: Increase your sprinting speed by an amount based on your time spent sprinting, and your jump height by an amount based on the number of times you&#39;ve jumped. (Athlete serves as a prerequisite for both halves of the tree)\r<br />[*]Gotta Go Fast: Double your maximum sprinting speed.\r<br />[*]Marathon Man: Halves the stamina cost for sprinting.\r<br />[*]Breath and Focus: After sprinting, Stamina regen is increased based on the number of times you&#39;ve shouted.\r<br />[*]Reckless Charge: Melee weapons do more damage for a short time after sprinting.\r<br />[*]High Expectations: You can jump higher.\r<br />[*]Milk Drinker: Your bones are thicker, and you fall farther before taking fall damage.\r<br />[*]Sworn to Carry Your Burdens: stamina and carry weight are increased by the amount of time you&#39;ve spent with followers, up to 50 points each.\r<br />[*]Vantage Point: Ranged weapons and magic do more damage based off your height. (In outdoor cells, height is measured between sea level and the throat of the world, and indoors, height is measured between the highest and lowest reference in the cell.)\r<br />[*]Won&#39;t Let Nothing Weigh You Down: the armor penalty to speed and jump height is removed.\r<br />[/list]\r<br />Installation: Campfire is not directly required; you can&#39;t get perks without it (unless you want to play around in the console, but that&#39;s not necessarily a good idea). However, the basic bonuses should still apply.\r<br />\r<br />Removal: It&#39;s scripted. You probably shouldn&#39;t. Back up your saves first.",
  "categoryId": "73",
  "version": "",
  "author": "Epic Crab",
  "createdUnix": "1459481602",
  "updatedUnix": "1459481595",
  "containsAdultContent": false,
  "uploadedBy": "EpicCrab",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000201320",
      "name": "Immersive Murderous Crabs",
      "version": "0.4.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "16",
      "fileName": "Athletics - a Skill for Campfire-74620-4-1-16.7z",
      "uploadedUnix": "1459481595",
      "modVersion": "0.4.1",
      "virusScanUrl": "https://www.virustotal.com/file/8380b1eacb1c41865babbc8bb36b8446b2303e08343032225b4e3aaec394019d/analysis/1459481645/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletics%20-%20a%20Skill%20for%20Campfire-74620-4-1-16.7z?fid=1000201320&ttl=1535863432&ri=8192&rs=8192&setec=d2506b8e78bd09d1ab027dda90c58114"
    }
  ]
}