{
  "modId": 74661.0,
  "modName": "SkyWater",
  "summary": "SkyWater adds basic functionality for use and consumption of water to Skyrim without any needs, constraints or side effects.",
  "descriptionHtml": "[font=Verdana][size=2]Skyrim has such a beautiful landscape with so many lakes and rivers and there is not any possibility to pick up or to drink water. This mod will change that.[/size]\r<br />\r<br />\r<br />[/font]\r<br />[b][size=6][color=#00ffff][font=Comic Sans MS][center]S k y W a t e r[/center][/font][/color][/size]\r<br />[/b][font=Verdana][size=2]SkyWater adds basic functionality for use and consumption of water to Skyrim without any needs, constraints or side effects.[/size][/font][font=Verdana]\r<br />\r<br />\r<br />[size=4][u]Basics\r<br />\r<br />[/u][/size][size=2]SkyWater will give you the possibility to get water at any natural water source. Also, you can add your own water sources to the game.\r<br />\r<br />Likewise to mining or wood chopping you have to use an in-game item as a tool to get water. Valid items to get water are Buckets and Empty Bottles or, if you just want to drink, any kind of Goblets. \r<br />\r<br />Compared to wood chopping where you would activate the chopping block to start the process, with SkyWater you have to activate the item to start the process. Simply open your inventory menu and activate (equip) a valid item while being close to a water source or standing in water. This will start a get, pick-up or loot animation and fill your bucket / bottle. Or, if you use a goblet, it will play a drinking idle. \r<br />\r<br />This activation method is consistently used for all mod items and vanilla items supported by the mod. Besides the basic function of getting water, SkyWater adds the following basic items to the game:\r<br />\r<br />[/size][/font][list]\r<br />[*][font=Verdana][size=2]Water in Buckets for washing, crafting and cooking (Misc Item)[/size][/font]\r<br />[size=2]\r<br />[/size][*][font=Verdana][size=2]Water in Bottles for drinking and cooking (Potion/Food)[/size][/font]\r<br />[size=2]\r<br />[/size][*][font=Verdana][size=2]Water as distilled Pure Water for potion making or cooking (Ingredient) [/size][/font]\r<br />[size=2]\r<br />[/size][*][font=Verdana][size=2]Water Gems as magic stones housing a new water source (Gem Stone/Misc Item)[/size][/font]\r<br />[size=2]\r<br />[/size][*][font=Verdana][size=2]Water Sources which can be placed all over (Activator)[/size][/font]\r<br />[size=2]\r<br />[/size][*][font=Verdana][size=2]Water in Kettles and Cooking Pots for recipes and cooking (Misc Item)[/size][/font]\r<br />[/list][font=Verdana][size=2]\r<br />This mod serves as a simple immersion mod without any needs, constraints or side effects. You can also use it as a framework or resource for your own mods.\r<br /> [/size]\r<br />[size=3] [/size][/font]\r<br />[font=Verdana][size=4][u]Details[/u][/size][/font]\r<br />\r<br />[font=Verdana][size=2]Valid items to get water are Buckets, Empty Wine Bottles, Empty Water Bottles and Goblets. Using a Bucket at a water source will play an animation, and fill the empty Bucket with water. Same applies for empty Bottles. Depending on the bottle you use the mod replaces the empty bottle with either Drinking Water or Bottled Water or with a Big Water Bottle. Using Goblets at a water source will make your character play the drinking idle and refreshes their stamina a bit. (Using SkyWater as master for your own mod, you can make any in-game item a valid item by adding a Keyword and a Script coming with this mod.) \r<br />\r<br />Water in Bucket is the basic mod item for crafting and cooking. Filled Buckets have a weight of 6 or 10, depending on the bucket you use. You can fill any of the in-game Buckets with water. Having a Bucket with Water in your inventory you can refill your empty Water Bottles and fill Kettles and Cook Pots with water. You can store Water in Buckets in any container. If you drop a filled Bucket you will only throw out the water and receive an empty Bucket. Same logic applies if you use a Bucket with Water at a crafting station.\r<br />\r<br />You can use Empty Wine Bottles and fill them with water. Once filled with water you will get Drinking Water or Bottled Water, depending on the Bottles used. Consuming Water in Bottles will result in an Empty Water Bottle.\r<br />\r<br />Drinking Water, Bottled Water and Big Water Bottles are the basic food items. Drinking Water (slim bottle) has a weight of 1 and will give you some stamina restoration. Bottled Water (round bottle) has a weight of 2 and gives a doubled stamina restoration. The Big Water Bottle has a weight of 5 and gives a strong stamina restoration. Beside of drinking you can use the Water in Bottles for cooking.\r<br />\r<br />Empty Bottles will be sold by your trusted vendors or can be crafted at any smelter. To craft a bottle you need molten glass, which you can get by melting Empty Wine Bottles or Empty Water Bottles. \r<br />\r<br />If you want to use water for cooking, you have to fill it into a Kettle or into Cook Pots. A Kettle with Water has a weight of 10; so it can take any combination of water bottles or bucket as long as you have enough water in your inventory to fill the kettle. This logic is the same for the small Cook Pot (which has a weight of 1) and the medium size Cook Pot (which has a weight of 2). \r<br />\r<br />To fill water in Kettles or Cook Pots open your inventory menu and activate (equip) the Kettle or Cook Pot. This will fill the cookware with water and empty the Bucket or Bottles required for filling - meaning you will get empty Buckets and/or Bottles in return.\r<br />\r<br />You can use a filled Kettle or Cooking Pot for your custom made cooking recipes. If you do so, using a Kettle or Cooking Pod at any crafting station will replace it with an empty Kettle or Cooking Pod. Same logic applies if you drop a Kettle or Cooking Pod - you will only throw out the water and receive an empty Kettle / Cooking Pod. This mod does not add recipes for cooking (except for making Pure Water), but it provides the basic functionality for mods doing so. Beside of the cookware already included (Kettle and Cooking Pods) you can make any items (e.g. bowls, shells, mugs, etc.) to function and behave like the cookware included (by adding a Keyword and a Script coming with this mod). \r<br />\r<br />Pure Water is the basic ingredient. To make Pure Water you have to distillate water at a cooking station. Recipe: 1 Kettle with Water and 1 Empty Water Bottle. \r<br />\r<br />When you get water with a Bucket, likewise to mining, sometimes you may find a Water Gem. Water Gems look similar to Grand Soul Gems, but instead of housing a soul they keep a water source. Water Gems can only exist in water. To hold a Water Gem in your inventory you need to have a Bucket with Water in your inventory as well. You cannot store Water Gems outside your inventory without water. If you want to store a Water Gem in a container you have to put it into a Bucket with Water first. \r<br />\r<br />Breaking a WaterGem will mark a new Water Source (by dropping the Water Gem and activating it). You can mark whatever you want as a Water Source, e.g. wells, barrels, sinks, fountains. One problem with Water Gems is that they can only exist in water, so once you drop it you can&#39;t take it back and you have only 30 sec before it decomposes. \r<br />\r<br />The mod will detect gem-made water sources and handle them like any natural water source (and you can also fill Kettles and Cooking Pots). And, as such new water source can also be placed in player homes (e.g. a sink in the kitchen) you can also activate a Water Source to drink water even without having any valid item in your inventory (or if you want to disable and delete it). The filling process is the same as with naturel water sources (activate an item in your inventory).\r<br />[/size]\r<br />\r<br />[size=4][u]Compatibility and conflicts[/u][/size]\r<br />\r<br />[size=2]This modmakes use of vanilla meshes and textures only. It does not change any of the game assets. All mod items made make use of either vanilla meshes or modified copies of such meshes. All textures and texture paths are original. So, there should be no conflicts or incompatibilities&#33; \r<br />\r<br />SkyWater comes as a master file, so you have to place it before any esp’s in your plugins-list. [/size]\r<br />\r<br />\r<br />[size=4][u]Requirements[/u][/size]\r<br />\r<br />[size=2]Skyrim and Update\r<br />SKSE 1.73+ [/size]\r<br />\r<br />\r<br />[size=4][u]Permission[/u][/size]\r<br />\r<br />[size=2]Do not upload my files to other sites. Feel free to use my file as master for your mod or to modify my file; including releasing bug fixes or improving any of the features my file adds to the game, and upload it as a separate file. [/size][/font]",
  "categoryId": "78",
  "version": "1.1",
  "author": "7StarC",
  "createdUnix": "1459594397",
  "updatedUnix": "1460069887",
  "containsAdultContent": false,
  "uploadedBy": "7StarC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000201608",
      "name": "SkyWater",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "450",
      "fileName": "SkyWater-74661-1-1.7z",
      "uploadedUnix": "1459641623",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4fd7171af810a9d70d284a352c11ac5e5d9b14c68b4b3ccd3ecfa9f5e675f966/analysis/1459641666/",
      "changelogHtml": " deleted one property definition in quest script (no need to update from 1.0 to 1.1) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyWater-74661-1-1.7z?fid=1000201608&ttl=1535863478&ri=8192&rs=8192&setec=f33d4166aafda418b52d8baf99ef11d5"
    },
    {
      "fileId": "1000201841",
      "name": "Patch for iNeed",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Patch for iNeed-74661-.7z",
      "uploadedUnix": "1459798734",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/de3dcd95adb286291149b32ab908ad7c5dd2e9b897494e13e23d3bf540aedebd/analysis/1459798759/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patch%20for%20iNeed-74661-.7z?fid=1000201841&ttl=1535863479&ri=8192&rs=8192&setec=d901260552d499a4c8ab534b18728e92"
    },
    {
      "fileId": "1000202156",
      "name": "SkyWater Deutsche Version",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "451",
      "fileName": "SkyWater Deutsche Version-74661-1-1.7z",
      "uploadedUnix": "1460069887",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4fa1b50ea7cd73944604ddfe85e896af8dc1ea977b319d5f987033094e88bbf3/analysis/1460069943/",
      "changelogHtml": " deleted one property definition in quest script (no need to update from 1.0 to 1.1) <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyWater%20Deutsche%20Version-74661-1-1.7z?fid=1000202156&ttl=1535863479&ri=8192&rs=8192&setec=a637c4c7f17c75c7b351d174d211ccb3"
    }
  ]
}