{
  "modId": 74680.0,
  "modName": "Change Pronouns",
  "summary": "Let&#39;s your dovahkin be trans.",
  "descriptionHtml": "[size=5]What the Mod is[/size]\r<br />\r<br />[size=2]I created this mod because I wanted to extend the amount of body types your character could have without it be restricted to the assigned gender of the character. Since the only trans related mods I&#39;ve ever found are porn mods, I decided to make my own. Something that I should say right off the bat is that I could not find a way to change the gender of your character without changing their body as well, so I had to go down a far more complicated route.\r<br />\r<br />The way the mod works is that it changes how the game handles gendered dialogue directed towards the player. What usually happens is that the game checks whether your character is male or female, and then uses the appropriate dialogue. My mod removes the condition to check your character&#39;s gender on dialogue you want to be said to your character, and then adds an unfillable condition to the dialogue you don&#39;t want said to your character in order to skip it. This means that no matter your character looks like, npcs will always refer to your character as the binary gender you want them to (since those are the only ones available in the game). This also works with prompts, books, and notes in the game that refer to your character with the pronoun tags. Any piece of text that uses tags like &#34;&lt;Alias.Pronoun=Player&gt;&#34;, &#34;&lt;Alias.PronounObj=Player&gt;&#34;, etc... are replaced with the pronouns you want.\r<br />[/size]\r<br />[size=6][b]Instructions[/b][/size]\r<br />\r<br />[size=2]Given the nature of this mod, it wouldn&#39;t be great if it only worked on the main game and dlc, but not with mods. Finding, keeping up, and manually editing all these mods would be impossible, which is why this mod is built using a patcher. So, what you&#39;re downloading isn&#39;t the mod itself, but the resources to build it. Follow the instructions below and you should be fine.[/size]\r<br />\r<br />[size=5]Requirements\r<br />[/size]\r<br />[list]\r<br />[*][size=2]The most recent version of Java.[/size] \r<br />[/list][size=5]\r<br />If you use Nexus Mod Manager[/size]\r<br />\r<br />[list=1]\r<br />[*][size=2]Download from Nexus and install regularly.[/size]\r<br />[*][size=2][size=2]Activate mod in list.[/size][/size]\r<br />[*][size=2]At this point I recommend running LOOT.[/size]   \r<br />[*][size=2]Next, click on the Open Folders option and select [b]Open Game Folder[/b].[/size] \r<br />[*][size=2]Go into your data folder and go into [b]SkyProc Patchers/Change Pronouns/ChangePronouns.jar[/b] and double-click on the jar file.[/size]\r<br />[*][size=2]A window that says [b]Change Pronouns[/b] will open. Click on the [b]Pronoun Settings[/b] button and you&#39;ll see two check boxes. Check the one that has the pronouns you want[/size].\r<br />[*][size=2]Click the [b]Patch[/b] button in the upper-right corner to build the mod.[/size] [size=2]Depending on how many mods you have, this process can take a while. This patcher has to run through all the books and dialogue in all the mods you have installed, so just be patient and wait until the progress window closes.[/size]\r<br />[*][size=2]Once the patcher is finished, the plugin [b]Change Pronouns[/b] will be in your data folder. Activate the mod in your Plugins and you&#39;re set.[/size]\r<br />\r<br />[/list]\r<br />[size=5]If you use Mod Organizer[/size]\r<br />\r<br />[list=1]\r<br />[*][size=2]Download from Nexus and install regularly.[/size]\r<br />[*][size=2]Activate mod in list.[/size]\r<br />[*][size=2]Go into the data tab and go under [b]SkyProc Patchers/Change Pronouns/ChangePronouns.jar[/b].[/size]\r<br />[*][size=2]Right click on the jar file in the list and click [b]add as executable[/b].[/size]\r<br />[*][size=2]You should get a window asking you to name the executable. Call it whatever you like and click [b]OK[/b]. The patcher should now be in the list of executables. [/size]\r<br />[*][size=2]At this point I would recommend running [b]Sort[/b].[/size]\r<br />[*][size=2]Select the patcher from the list and click [b]Run[/b].[/size]\r<br />[*][size=2]A window that says [b]Change Pronouns[/b] will open. Click on the [b]Pronoun Settings[/b] button and you&#39;ll see two check boxes. Check the [/size]\r<br />[size=2]one that has the pronouns you want[/size].\r<br />[*][size=2]Click the [b]Patch[/b] button in the upper-right corner to build the mod. [/size][size=2]Depending on how many mods you have, this process can take a while. This patcher has to run through all the books and dialogue in all the mods you have installed, so just be patient and wait until the progress window closes.[/size]\r<br />[*][size=2]The last step is to right click on Overwrite and click on [b]Create Mod...[/b][/size]\r<br />[*][size=2]Name the mod whatever you like and activate it in the list.[/size]\r<br />[*][size=2]The freshly built plugin [b]Change Pronouns[/b] should now be in your load order list.[/size]\r<br />\r<br />[/list]    \r<br />[size=5]Additional Notes[/size]\r<br />\r<br />[list]\r<br />[*][size=2]If you install a mod that introduces more gendered dialogue after installing this mod, you will need to delete this mod and rebuild it again. That way it will work for new mod as well.[/size]\r<br />[*][size=2]I&#39;ve taken many pains to make sure this mod doesn&#39;t overwrite more than it should (which involved editing the skyproc library itself). Therefore, you should [b]NOT[/b] have to clean it in TES5Edit.[/size]\r<br />[*][size=2][size=2]I have not thoroughly tested this patcher in SUM (mostly because SUM hasn&#39;t worked for me) and would not recommend you using it in SUM. [/size][/size]\r<br />[/list]\r<br />\r<br />[size=5]Troubleshooting[/size]\r<br />\r<br />[size=2]If you&#39;re having issues with the patcher, the best ways to tell me what&#39;s wrong is to show me the debug file. When you run the patcher, a folder called [b]SkyProcDebug[/b] is created under [b]Skyrim/Data/SkyProc Patchers/Change Pronouns/[/b]. If you&#39;re using Mod Organizer, the debug folder will be under [b]Skyrim/Mod Organizer/mods/&lt;whatever you named the mod when you created created it&gt;/SkyProc Patchers/Change Pronouns/[/b].  There&#39;s a few files there that will tell you what happened, but the best one to show me is the [b]=--Debug Overview--=.txt[/b] file. I should be able to figure out what went wrong from there. \r<br />Below are some errors I&#39;ve run into while testing:[/size]\r<br />\r<br />[list]\r<br />[*][size=2][b]Missing masters and skipping mods:[/b][/size][size=2] The patcher sometimes doesn&#39;t read in a mod correctly and will decide to skip it. When this mod is required by another, you&#39;ll get an error message saying that you&#39;re missing a master, even though you aren&#39;t. When and why the patcher misreads a mod has been random in my experience. A mod that was misread one time I ran the patch will be perfectly fine another time. If you get this error, show me the contents of the debug file and I&#39;ll work on fixing it as best I can.[/size]\r<br />[*][size=2][b]Mod not showing up in Nexus Mod Manager: [/b][/size][size=2]This has happened to me before and if that&#39;s the case for you, just download the file manually from Nexus and open it using 7zip, Winrar, etc... and drop the folder called [b]Skyproc Patchers[/b] in your data folder. From there, just double click on the jar file and continue from step 6 in the NMM instructions above.[/size]\r<br />[/list]\r<br /> \r<br />[size=3]If there are any issues please let me know so that I can take care of them and add them to the troubleshooting section.[/size]",
  "categoryId": "24",
  "version": "1.0",
  "author": "GoesOnGhost",
  "createdUnix": "1459712380",
  "updatedUnix": "1459711243",
  "containsAdultContent": false,
  "uploadedBy": "GoesOnGhost",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000201719",
      "name": "Change Pronouns",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2458",
      "fileName": "Change Pronouns-74680-1-0.7z",
      "uploadedUnix": "1459711243",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f89fb7736c269b2b85cd71e5faf9e2c3fb2dfa34358ce76baa187fc56d01ca47/analysis/1459711267/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Change%20Pronouns-74680-1-0.7z?fid=1000201719&ttl=1535863496&ri=8192&rs=8192&setec=3dbf3c0774deeb7187e341b269dc9b8b"
    }
  ]
}