{
  "modId": 747.0,
  "modName": "Skyrim Reborn",
  "summary": "basically we are making a realism and sorta fix mod at this point.\r\ni will update the nexus post at: http://www.thenexusforums.com/index.php?/topic/463687-realism-mod/page__p__3820554__fromsearch__1#entry3820554\r\nthe post will be updated before anything else, check there first.",
  "descriptionHtml": "basically we are making a realism and sorta fix mod at this point.\r\ni will update the nexus post at: http://www.thenexusforums.com/index.php?/topic/463687-realism-mod/page__p__3820554__fromsearch__1#entry3820554 (have had reports on the link, let us know if it works or if it isnt working for anyone, better yet PM me with the information)\r\nthe post will be updated before anything else, check there first.\r\n\r\nGREAT NEWS: Bethesda has finally given us a basic time-frame for the release of the CK, it will arrive sometime in January... this will allow me to give an better ETA for release of the first version of the Skyrim Reborn mod, will most likely be 2-3 months after release. i know its a bit of a wait for the mod but there is a ton of stuff for us to work on once we get our hands collectively on the CK.\r\n\r\nwe are trying to work on stuff that we currently can, while waiting for the \\'official\\' tools from bethesda for skyrim.\r\n\r\nlist of changes planned:\r\n\r\n- nudity (male and female) when armor is removed etc. (this will be optional, either at install or as separate optional download)\r\n- give the animals and monsters anatomy (were do baby monsters come from mommy?!) (optional, same as nudity)\r\n- upgrade textures plus fixing texture and model glitches (as we find them and can fix)\r\n- tweaking spells and racial traits so that they make more sense, such as kahjiit night sight so that it is on or off and fix glare/color issues\r\n- make marriage more available to races like orc/argonian/kahjiit adding NPCs and/or tweaking existing ones\r\n- add more NPC\\'s to skyrim cities and areas that should be more populated\r\n- tweaking damage and defense (hoping to make more difference between certain armors and weapons)\r\n- make horses more resilient and maybe tweak AI a little (if possible) this is more for jumping falling than actual fighting.\r\n- tweaking dragon/giant/mammoth defense and attack dmg (and probably other monsters as well) etc.\r\n- maybe adding older versions of some of the creeps like ogres/trolls/minataur/spider deadra/etc.\r\n- upgrading eye/face/hair textures in general for most of the game\r\n- changing the look of some of the PC models like kahjiit and argonian... make them less skinny looking, specially for male models.\r\n- make wolves friendly if werewolf in human form, adding a few other changes to make it easier completing dungeons while in were form tweaking regen /feeding/etc. as needed to balance the werewolf and make it more balanced with the rest of the game...\r\n- fix the flying ragdoll issues when attacking or getting attacked\r\n- change some of the animations for the PC, starting with mining\r\n- fix tearing issues with walls/texture/model for some of the interiors and exteriors (the necro\\'s fort, a couple of inns)\r\n- fix other issues as we come accross them or have reported with place and pics or vids of issues encountered.\r\n- add in usable wagons for the PC, make it so that the companion characters can use wagons and horses when asking them to do something (might have to add it to talkmenu otherwise it will be same as \\'attack\\' command)\r\n- ability to create dwarven (dwemer) constructs as part of the smithing abilities and traits etc. once dwarven smithing is activated.\r\n- fix issues with items disappearing from inventory or if placed \\'in\\' display mount.\r\n- fix selecting or activating items or containers through walls\r\n- companion count\r\n- fix companion going back to wearing \\'default gear\\' instead of gear you have given them.\r\n- setup a system to make it so that hitting someone (or getting hit) in say the head will result in much more damage dealt maybe a crit depending on defenses and armor etc. head shots will be lethal.\r\n- farming for those so inclined to do so (buying land outside of holdings) also mines and people to mine them, plus buying out holdings/cities/etc., gaining control of certain castles or posts controlled by bandits and being able to customize them or at least re-build and re-arm them.\r\n- traps, disarming ads to appropriate skill... building and removing traps, possibly added to smith skill or have its own skill as trapper/hunter\r\n- (if possible) will add the mod to make for left-hand gameplay, and allow for buttons to work properly if changed and menu buttons properly (also another mod)\r\n\r\nIMPORTANT NOTE: any bugs or glitches you come accross in your gameplay please check out what has been reported or submit a bug report to the \\\"Unofficial Skyrim Patch\\\" guys here https://unofficialskyrimpatch.16bugs.com/projects/7078\r\nthese guys are good at what they do, we the gamers and modders thank them for their hard work and dedication.\r\n\r\ndepending on support and help in making the rest of the changes we plan to add Oblivion (Cyridil) and Marrowind areas to the game...\r\nwill add more as i remember and get input... yes i know some of these will have already been done by the time this will be finished.\r\n\r\ni am hoping that slilverlock will be releasing a skyrim script exctender to make life a bit easier for scripting new/rescripting items etc. (it will be supported at such time) if the nexus mod manager works to add skyrim (and the script extender) to the list we will support it.\r\n\r\nif other modders want to allow me to use their mods it will make things significantly easier (i hope) and i will be contacting them directly... even if you say that i can use your mods here.\r\n\r\nfor anyone interested in helping out on this project email me at sb.seed@gmail.com with \\'skyrim mod\\' in subject, thanks.\r\n\r\npremature thanks for use of mods etc.: svaalbard, Zalzama, JustinOther, adhome, Elsweyr project team, and others to come im sure. thanks for your work guys.\r\nthanks to the my team: DarkWolfV, Slayer_2, Werne, and others.\r\n\r\nthanks for the suggestions and comments/interest from the community.",
  "categoryId": "79",
  "version": "V0.01",
  "author": "Abyssal Games",
  "createdUnix": "1321765001",
  "updatedUnix": "1321765001",
  "containsAdultContent": true,
  "uploadedBy": "sbseed",
  "primaryFile": null,
  "files": []
}