{
  "modId": 7471.0,
  "modName": "Role Playing Alternate Start--Vjorn- Nord Silver Hand",
  "summary": "See Skyrim from a diffrent opinion, a citizen of Skyrim, Vjorn, joins the ranks of Silver Hand to avenge his father.",
  "descriptionHtml": "Story:\r\nVjorn was living with his father since he was born, he never met his mother because she died giving birth to Vjorn. His father taught him everything he knew, how to wield a sword, how to hunt... They had a house in Riverwood but because of debts they left it and start to live in the wilds near Riverwood when Vjorn was 17 years old. They made camps near a river, changing it occasionally.\r\n\r\nFor 3 years he hunted with his father, trying to survive in this savage land. He learnt how to treat wounds, and how to fight against bandits or wild animals. When he became 20, they nearly had enough money to buy a house again but one night something terrible had happened.\r\nWhile they were sleeping, Vjorn suddenly woke up and heard a terrible howl. It wasn\\'t just and ordinary wolf howl, it was different. He was afraid, he got up to get his sword yet the moment he got up, he saw its eyes. He was frozen in place. The Werewolf hit him in the face with its claw, with unnatural power; he flew in to the river. He saw his father getting torn up. He filled with rage and swam back. The werewolf attacked him once again but he evaded it. Before werewolf could attack once again he grabbed his sword, werewolf jumped on him again but Vjorn caught him on midair and thrust his sword to his chest. Werewolf howled in pain and transformed back to its human form. Vjorn saw its face, the face he will never forget. His father’s body was destroyed. Suddenly he heard another howl. He was terrified, he just ran, ran and ran... He wondered in wilds for days, his wound was not healing. But right when he was about to give up, a Vigilant of Stendarr found him. She carried him to Whiterun and attended his wounds.\r\nWhen he got up, he started to look for a job in Whiterun. His father was gone and he had lost all his gold. While he was talking to merchants, he saw the face of the man who killed his father. He was wearing an armor which The Companions wear. He recognized Vjorn too. He then understood that his father was murdered by a Companion, and he knew that companions were werewolves which was information that would lead to his death. He fled from the city at night but soon after 2 to 3 hours he realized that he was being followed. A woman and a man. He recognized the woman too, Aela she was called, she was a companion too. When they catch up with him he didn\\'t even try to fight, but something unexpected happened. When they were approaching him to kill, an arrow hit the man in the leg, which gave Vjorn an opportunity to flee. While he was running hell break loose and the companions fled. He learnt that his saviours were some people called The Silver Hand, who fight against werewolves. So he decided to join them and avenge his father!\r\n\r\nAllright this is a save game that I made by using console commands. \r\nYou are a nord-male. \r\nYou are friendly with Silver-Hand Faction and you start the game in Gallows Rock, which is a Silver-Hand location. \r\nYou have 140 gold which The Silver Hand gave you to survive. \r\nA Fur Armor set(common armor which low-ranking Silver Hands wear), two silver swords(1h and 2h-wanted to let you choose), a hide shield, a hunting bow-arrows. \r\nI used diffrent cell to start to so there is no main quest, but please avoid Helgen I checked there, there are some soldiers fighting in there, it is a little bit buggy.\r\nI tweaked its skills too for roleplaying. He got 0 pickpocket skill and a lowered lockpicking skill because he was an honest man.\r\nI lowered his illusion and destruction skill because he never needed them, and as he joined silver hand plus he hated unnatural things so conjuration is 0.\r\nHowever as he learned from Vigilant of Stendarr his restoration and alteration skills are a little bit heightened.\r\nHis other skills are a bit lowered, a bit heightened nothing important, I did it to give you different build choices but not to make you overpowered, you can change it if you want. You are level 1 and no perks. \r\n\r\nThere are no markings on map I hid them all u will need to discover.\r\nThere are no required mods, I disabled all .esp’s to avoid any kind of problem.\r\nYou are in Silver-Hand Faction. \r\nThis is my first contribution to nexus so if there is anything wrong just tell me, and I am not english so there may be some mistakes, I am sorry for them. \r\nIf you don’t like characters look just type in console showracemenu and change it, there were no mods included so will not be any problem.\r\nJust remember Vjorn hates unnatural things, werewolves first, also vampires, undead any type of monsters, he hates them, he hunts them. It is like beginning of a journey of a Witcher.\r\n\r\n         I highly RECOMMEND you to download: \\\"Wars in Skyrim IV\\\" mod because you will be able to find more monsters around with that mod, werewolves too which will help your role-play. \r\nLink: http://skyrim.nexusmods.com/downloads/file.php?id=6176  \r\n\r\nThanks to Virtuallism, I inspired by him to make a savegame like this, I recommend you to check his alternate starts too. \r\n\r\nAnd thanks to  Th3uNKn0wN for fixing grammar mistakes.\r\n\r\n\r\nInstallation: Extract into your saves folder ( C:\\\\Users\\\\<Computer Account Name>\\\\Documents\\\\My Games\\\\Skyrim\\\\Saves )\r\n\r\n\r\nEnjoy! -Elrondel",
  "categoryId": "43",
  "version": "v1.0",
  "author": "Elrondel",
  "createdUnix": "1328011927",
  "updatedUnix": "1328012147",
  "containsAdultContent": false,
  "uploadedBy": "Elrondel",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24603",
      "name": "Vjorn-Nord Silver Hand Male",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "982",
      "fileName": "Vjorn-Nord Silver Hand Male-7471-v1-0.rar",
      "uploadedUnix": "1328012147",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6f05604003a4b4aed8d40ccfe327334c7de588ec200f29cb3827b5c3036cdd3c/analysis/1406646664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vjorn-Nord%20Silver%20Hand%20Male-7471-v1-0.rar?fid=24603&ttl=1535765522&ri=8192&rs=8192&setec=5e8dd1f27420d670aaba240ab89a4956"
    }
  ]
}