{
  "modId": 74809.0,
  "modName": "Bellyaches New Dragon Species - Leveled List Version",
  "summary": "This is a mod I made for myself, that changes the way Bellyaches Dragon Species mod works.\r<br />\r<br />",
  "descriptionHtml": "I removed all the static spawns that bellyache had placed for his new dragons, and added his variants to the standard dragon level lists. So now the dragons only show up when there is supposed to be one, such as the random encounters and dragon word walls.\r<br />\r<br />The dragons are added based on their own levels so they are appropriate for the players current level +/- 5 levels.\r<br />\r<br />[b][u]Requires:[/u][/b] BellyAches New Dragon Species\r<br />http://www.nexusmods.com/skyrim/mods/20889/?\r<br />[u][b]\r<br />Installation:[/b][/u]\r<br />1. Install Bellyaches New Dragon Species from link above\r<br />2. Overwrite the ESP with my esp (MO users I assume its override or load this mod after the original)\r<br />3. Advanced users: Utilize Wryebash Bashed Patch to make a patch that blends the level lists together in the event you are using other mods that add new dragons to the Leveled Lists.\r<br />\r<br />[u][b]Compatibility:[/b][/u]\r<br />Should be compatible with any mods that change default dragon behavior such as Dragon Combat Overhaul or Ultimate Dragons.\r<br />Any dragon mods adding dragons that are not level list based.\r<br />Wrye bash can make a level list patch to work with other Level List adding mods.\r<br />\r<br />Note for Mod Organizer Users:  You can double click on Bellyaches New Dragon Species, go to the Optional ESPs tab and click the up arrow and \r<br />that will remove the conflict for this mods new ESP. -palentier                 \r<br />\r<br />Credits:\r<br />Wrig675 - really all the work is his, go endorse his mod.\r<br />All the people that helped Wrig675 make the original\r<br />\r<br />Also Image is random as there is no reason to have images for this edit.",
  "categoryId": "83",
  "version": "1.0",
  "author": "Wrig675",
  "createdUnix": "1460094325",
  "updatedUnix": "1460094322",
  "containsAdultContent": false,
  "uploadedBy": "jonusl2d",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000202194",
      "name": "BellyAches New Dragons LL",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "BellyAches New Dragons LL-74809-1-0.7z",
      "uploadedUnix": "1460094322",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d02ec591465e66f1d7d64d3fabd4715499d0ba6da1adf8aa72f132ffe40c60b4/analysis/1460094365/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BellyAches%20New%20Dragons%20LL-74809-1-0.7z?fid=1000202194&ttl=1535863609&ri=8192&rs=8192&setec=332ac32d189d295e7368e95b60b180a5"
    }
  ]
}