{
  "modId": 7484.0,
  "modName": "Sexy Winterhold College",
  "summary": "Here is Sexy Winterhold College, the latest in my series of Sexy Cities",
  "descriptionHtml": "[b][color=red]Update 3/16/12: [/color][/b] Added Version 2.0, which features minor fixes to Sexy Winterhold, including new white marble with more variety in striations to replace the old marble that many complained repeated to often. Also replaced the checkerboard floor with an all new, hi-res version that features a more three-dimensional look and greater detail. Enjoy!\r\n\r\n[center][youtube]AEY3mrCtAno[/youtube][/center]\r\n\r\nHere is Sexy Winterhold College, the latest in my series of Sexy Cities, joining \r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12308]Sexy Solitude v1[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7059]Sexy Whiterun v3.1[/url], [url=http://skyrim.nexusmods.com/downloads/file.php?id=7178]Sexy Windhelm v2[/url], and\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7583]Sexy Villages and Towns[/url] [url=http://skyrim.nexusmods.com/downloads/file.php?id=7241]Sexy Riften v2[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=12928]Sexy Boats[/url] \r\n\r\nWhat users of the other mods will notice right away is the fact that, with Winterhold, I\\'ve opted not to go too nuts with saturation or vibrance, but, rather, focus on retexturing the entire place to make it more regal and \\\"magical\\\". Anyone who\\'s been in the Winterhold folder will attest to the fact that their are merely a handful of files one can manipulate, and ALL of them are for the college, proper, meaning that this mod has no effect on the village of Winterhold. For me to edit the town, I will need to do an across the board edit of towns and hamlets, which I\\'ll probably end up doing down the line at some point! :P\r\n\r\nSo if there\\'s not a lot of files to mess about with, what, exactly, do you get with this mod? Quite a bit, actually, at least in terms of making Winterhold College look like a proper Mage\\'s college and not a prison for the criminally insane. Save for the windows and gates, the textures here are entirely new, including - \r\n\r\n[b]New Doors -[/b] I\\'ve replaced the boring faded brown doors with new higher resolution doors that I made with the assistance of stock photography and lovely images of medievel bric-a-brac I found online. In my opinion, a Mage\\'s college would have more vibrant and regal looking stuff like this, regardless of the state of disrepair of the town it\\'s located in (ever been to University of Massachusetts in Lowell? Nice, eh? Ever been to the city of Lowell, itself? It\\'s a pit that makes Mogadishu look like Cancun).\r\n\r\n[b]New Stone - [/b] I\\'ve also retextured pretty much every piece of stone in the folder. I went for upper-end stone, like White Marble and Black Granite, to give the college something of a two-tone trim look. \r\n\r\n[b]New Flooring-[/b] This is mirrored in the new checkerboard floor pattern, which also includes a sort of glazed marble trim. Once again, the ratty, cracked tiles just didn\\'t fit my personal vision of what a Mage\\'s college would look like. \r\n\r\n[b]Various Color Tweaks - [/b] I\\'ve also redone the Winterhold gates, windows, and floor emblem things, making them more of a solid silver, brightened up the Winterhold banner, and gave the remaining stone a darker, more moody color. \r\n\r\nFor people who liked my mods for excess saturation, well, this one may not be as eye-popping, but I wanted to try something a little different and be in keeping  with the harsh snowy climes of Winterhold. Those who hate my mods because of the saturation, well, you may like this, but it\\'s still a lot more festive than vanilla. People looking for super HD textures won\\'t find any here, but the hi-res ones included look pretty good to my eyes (at 1920x1200, which is my monitor\\'s native  resolution), so I don\\'t think you\\'ll be trading off much in terms of quality. \r\n\r\nAs always, I made this for my own enjoyment and wanted to share it with folks who, like me, think Skyrim\\'s a cold, drab place in need of a makeover. If you like and use the mod, an endorsement would be much appreciated. If you hate it, sorry. Can\\'t do much about that. However, if you could be constructive in your criticism\r\nit would als be appreciated.\r\n\r\nThis mod is meant as a companion piece to:\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7059]Sexy Whiterun[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7178]Sexy Windhelm[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7241]Sexy Riften[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=7583]Sexy Villages and Towns[/url]",
  "categoryId": "53",
  "version": "2.0",
  "author": "horrorview",
  "createdUnix": "1328027743",
  "updatedUnix": "1331926089",
  "containsAdultContent": false,
  "uploadedBy": "horrorview",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24660",
      "name": "Sexy Winterhold",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "11209",
      "fileName": "Sexy Winterhold-7484.zip",
      "uploadedUnix": "1328027816",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4b52e204eb73835183b3f17b9962c4f981331465f60c44a2a77f8948b0d3eacd/analysis/1406646870/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Winterhold-7484.zip?fid=24660&ttl=1535765556&ri=8192&rs=8192&setec=d9d40e86476498276a404df2bf558dd3"
    },
    {
      "fileId": "43901",
      "name": "Sexy Winterhold v2",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12559",
      "fileName": "Sexy Winterhold v2-7484-2-0.zip",
      "uploadedUnix": "1331926089",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/01da1751c8405345e52287124fcb541e9003d14e6420ac1226a7de47b7f2620c/analysis/1406751883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sexy%20Winterhold%20v2-7484-2-0.zip?fid=43901&ttl=1535765556&ri=8192&rs=8192&setec=37e4b192ea9119ab6adba2c0a1e9e9cb"
    }
  ]
}