{
  "modId": 74854.0,
  "modName": "VS Trek Wear Dress",
  "summary": "Dragon&#39;s Dogma inspired dress collection EXCLUSIVELY for UNP/Vanilla female bodies. May fit base CBBE.",
  "descriptionHtml": "[color=#ffff00][center][size=4][color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]   [/color][/size][/color][/color][/size][/color][color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]      MY MODS [u]MAY NOT[/u] BE FEATURED ON OTHER SITES FOR REDISTRIBUTION. THEY [i]ARE NEXUS EXCLUSIVE AS STATED IN THE PERMISSIONS AND ONLY AVAILABLE THROUGH NEXUS[/i]. NO PERMISSIONS WILL BE GRANTED OTHERWISE. [color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]ALL VIOLATORS WILL BE NAMED AND SHAMED PUBLICLY... and reported of course :)\r<br />[color=#ff0000][size=4][color=#00ffff][color=#ff0000][size=4][color=#ffff00][color=#ff0000][size=4][color=#00ffff]This includes uploading translations without my permission&#33;&#33;&#33;[/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color][/color][/size][/color]\r<br />\r<br />Thank you to everyone who has downloaded and endorsed so far. I never expected this one to make it near hotfile, and especially not within 24 hours. I&#39;m still in shock. [/size]\r<br />[url=http://s24.photobucket.com/user/raesam/media/hotfile2.jpg.html][img]http://i24.photobucket.com/albums/c2/raesam/hotfile2.jpg[/img][/url][/center]\r<br />\r<br />VS Trek Wear Dress, EXCLUSIVELY for female UNP and Vanilla. May fit base CBBE body. I get feedback typically saying my mods work also with CBBE.[color=#ffffff][size=3] I am working on an actual CBBE version.[/size][/color] It will be a little time before it is out. It requires weight painting the skirts from scratch. Weight painting can take time.\r<br />\r<br />\r<br /> This dress is meant to be a MODEST LOOK. I will not authorize conversions which steer from that ideal. You can present a conversion in private to me, but if it falls outside the guidelines of modest, the meshes had to be warped to covert it, alters the original look too much, or if it turns out skimpy it will be automatically be rejected. There are enough over-sexualized or skimpy mods already. I am not against the skimpy mods that are out, but my original work will not be part of it. I am stern on my mods being meant for the gamers (primarily the girl gamers) who are tired of seeing skimpy and over-sexualized outfits and female bodies. I actually made promises I would not allow this to happen and I am sticking to them.\r<br />\r<br />If you have alternate colour ideas you would like to release, present them to me. I am all for recolours. It just needs to fit the dress theme is all I ask. Green, Brown and Black variants are being worked on for the next update. I may be adding a violet as well. Still debating on it.\r<br />[/color]\r<br />\r<br />Inspired by the dress Madeleine wears in Capcom&#39;s Dragon&#39;s Dogma. This is NOT Capcom&#39;s meshes or textures. These are my original meshes and textures, I made them from scratch and altered the look a bit to suit my tastes. The dress itself features a texture weave and pattern that was never in Dragon&#39;s Dogma. The corset and sleeve ties come from Witcher 3. The boots are a Vanilla Skyrim asset. I do not make boots. I suck at footwear. I had actually made my own mesh for the corset initially, which looked like the original Madeleine corset. I hated it. Madeleine&#39;s corset was blah to begin with. I was given permission by zzjay awhile back to consider Yennefer&#39;s outfit as assets. If you want to reuse the corset you must contact zzjay. I also have permission from CDPR to use their meshes in Skyrim.\r<br />\r<br />Includes:\r<br />Four dress colours: Yellow (Madeleine&#39;s original colour combinations in DD), Blue, Red and White.\r<br />Two pairs of boots: The original light leather lace up boots from Skyrim and a set in dark brown to match the corset. (The Skyrim boots are exteremly close in appearance to what Madeleine actually wears)\r<br />[color=#3c78d8]The backpack featured in some of the images is not included. That is part of Wet and Cold.[/color]\r<br />\r<br />Craft at the forge under leather. It&#39;s a dress but I gave it an armor rating as DD&#39;s version was armored as well. It&#39;s light weight, will require linen wraps and leather for crafting. Upgrade at crafting bench and enchant if you like.\r<br />\r<br />FIRST PERSON VIEW:\r<br />Not that most people would catch this, but there&#39;s always someone who will... I actually made the sleeve slightly shorter for first person view. It was necessary to have a smoother look for first person animations. At the original length, thumb joints kept popping through. It was annoying. And that was after it had been skinned and weighted. \r<br />\r<br />There will be no leveled lists or option to use this as a replacer for Vanilla dresses. This is meant for the Dragonborn or a female follower. Not for Skyrim&#39;s &#34;common rabble&#34; as the Jarls would say.\r<br />\r<br />[color=#ffff00][size=4]Who is Madeleine? [/size][/color]\r<br />Madeleine is a traveling merchant you encounter in Gransys on your travels to Gran Soren. You do a few quests for her and eventually she opens her own shop in Gran Soren. Before she buys a shop front, she is always seen wearing a huge backpack of goods and you can barter with her for better equipment and supplies. She is a flighty, clumsy, misguided, blonde bimbo who is easily distracted by anything that catches her eye... even if goblins are attacking. In a nut shell: she is an airhead. BUT she had one of the best female outfits that later became available for the player to wear as part of the DLC expansion packs. The dress was called [i]Ladies Trek Wear[/i]. It was meant for travel through the rough Gransys terrain. Although Gransys in DD is a sunny, warm, coastal province the dress will be well-suited to the Skyrim climate. It&#39;s has layered long sleeves, three layers of skirt and bodice, and wool tights. She didn&#39;t dress in the linen summer wear most of the people in the surrounding area did.\r<br />\r<br />[img]https://40.media.tumblr.com/844e5e3f13e963b760903248ad3a37db/tumblr_o57d7m8HMf1v1phuro4_r1_500.jpg[/img]\r<br />[color=#ff0000][size=4]\r<br />Warning about the meshes:\r<br />The dress, mainly the torso portion, is a HIGH POLY MESH. There will not be a low poly version. If you experience any issues with lag in inventory scrolling or equipping the item, or any other performance related issue: It is not a BUG. It was tested on both a low end and high end PCs. Each having considerable amounts of mods installed. On the high end it worked seamlessly. On the low end PC it worked but with minor lagging. Depending on your setup and how many mods you have installed in your game, you may experience issues. If the issues become a big problem it may be best to just uninstall the mod completely. I will not be making a fix as it will reduce the overall quality of the outfit and textures.\r<br />\r<br />\r<br />[center][color=#ffff00][size=4]Thank you Skylaskyrim and Lepihwepach for featuring the VS Trek Wear Dress in your videos&#33;&#33;&#33;&#33;[/size][/color][/center]\r<br />[center][youtube]imNdh23REZY[/youtube]\r<br />\r<br />[youtube]4d7VlnbC_gY[/youtube][/center][/size][/color][center][/center][color=#3c78d8][color=#6d9eeb]\r<br />\r<br />\r<br />\r<br />[center][color=#ffff00][size=4][/size][/color][/center][center][/center][left]\r<br />\r<br />\r<br />[color=#6d9eeb][size=5]Q&A:[/size]\r<br />[color=#ffff00]\r<br />[/color][color=#6d9eeb][color=#ffff00]Q: I use base CBBE. Will I be able to use this?\r<br />A: Most likely, but while equipped you will have the appearance of the UNP body.[/color] [color=#ffff00][color=#ffffff][size=3]I am working on a CBBE version.[/size][/color] It will be some time before it&#39;s ready due to the extensive \r<br />weight-painting necessary to make the skirt flow naturally for \r<br />animations.[/color] [color=#ffff00]Applying it to a new body means starting from the beginning of weight painting in order to get the same fluid movement.[/color]\r<br />\r<br />[color=#ffff00]Q: Do I need a separate download for the Vanilla body?\r<br />A: No. It automatically works with the Vanilla body without permanently \r<br />changing what you have in your game. Just like CBBE users, you will have\r<br /> the appearance of a base UNP body while equipping this. UNP is very \r<br />similar to Vanilla. I kept the proportions on the modest side to suit \r<br />Vanilla users.[/color][/color]\r<br />\r<br />[color=#ffff00]Q: Is there weight slider support?\r<br />A: Not yet. I am hoping to add it later. But I will not add it unless it \r<br />is damn near perfect. If the weight slider has one minor fault it could \r<br />cause issues in your game and the mesh may even appear to &#34;explode&#34; on \r<br />your character. It is an aggravating mesh to make work properly. But I \r<br />hope to have it available at some point.[/color]\r<br />\r<br />Q: In certain lighting the colours do not look right. Is this a glitch?\r<br />A: No. If you are an ENB user, some ENBs may alter the look of the textures. This seems to be especially true of any texture that uses a cubemap/speculars to add a slight sheen. In the case of this dress mod it has cubemaps/speculars. In some ENBS it may look faded, like plastic, or appear to have no texture at all. I cannot fix this for you. Consult the ENB mod page (for whichever ENB you use) for troubleshooting. It may be a simple step of tweaking ini file settings, or just the case of how that ENB works itself. Either way, I cannot provide solutions as every ENB is different and affects Skyrim differently.\r<br />\r<br />Q: Can you make this more lore friendly?\r<br />A: No. It is designed this way for a VERY specific reason.\r<br />\r<br />Q: Can you change the colours?\r<br />A: Go back up and read the beginning of the mod description.\r<br />\r<br />Q: Can you make a male version?\r<br />A: Nope. \r<br />\r<br />Q: Can males equip this?\r<br />A: No. It&#39;s obviously a female only outfit.\r<br />\r<br />Q: Can you make other Dragon&#39;s Dogma items?\r<br />A: I addressed this in the POSTS section early on to another community \r<br />member. I am not adding additional DD items/armors/clothing. This is a \r<br />one off I made from scratch because I REALLY wanted it for my own game. \r<br />These aren&#39;t even Capcom&#39;s meshes or textures. Capcom has no tools for \r<br />unpacking their games. I honestly have no interest in making other DD \r<br />armors/clothes.\r<br />\r<br />Q: Can you remove this or that piece to make a skimpy version?\r<br />A: No. Will never happen with my mods. I am also not authorizing skimpy versions.\r<br />\r<br />Q: I don&#39;t like this mod. Can you alter it?\r<br />A: Nope. Just don&#39;t use it.\r<br />\r<br />Q: Can you upgrade or enchant?\r<br />A: Of course.\r<br />\r<br />Q: The hands disappear into the skirt, and even more so during certain poses. Is this a glitch?\r<br />A: No. It just has to do with the size of the skirt. I could not keep that\r<br /> from happening without destroying the look of the dress. It&#39;s just like\r<br /> equipping any other mod dress with a &#34;bell&#34; skirt. The hands usually \r<br />suffer a disappearing act.\r<br />\r<br />Q: My sword/axe/bow disappears into the skirt folds when equipped on the body. Is this a bug?\r<br />A: No, this is not a bug either. This is just the nature of weapons when \r<br />equipped, especially weapons from mods which may not account for added \r<br />clothing sizes. Weapons are set up for skinning separate from \r<br />outfits/armors. There is no way I can make every weapon work for this \r<br />outfit to be completely visible when equipped, it&#39;s just not feasible. \r<br />It&#39;s just the nature of an item with a fuller skirt.\r<br />\r<br />Q: Which ENB did you use?\r<br />A: Rudy\r<br />\r<br />Q: Is the backpack included?\r<br />A: No. That is from Wet and Cold. You will need to visit that mod&#39;s page to find out where it originally stems from.\r<br />\r<br />Q: Can you provide the console command codes to get this outfit?\r<br />A: No. Search under &#34;Trek Wear&#34; or craft it. Alternatively you can download AddItemMenu. \r<br />\r<br />Q; What is Rumarin wearing?\r<br />A: Ezio&#39;s outfit from Assassin&#39;s Creed. You can get it [color=#ffffff][url=http://steamcommunity.com/sharedfiles/filedetails/?id=637498454&searchtext=ezio]HERE[/url][/color][/color][color=#3c78d8][color=#6d9eeb][color=#6d9eeb]\r<br />\r<br />[color=#ffff00]Q: Why won&#39;t there be conversions to 7base or any other body?\r<br />A: [color=#ffffff]I am currently working on a CBBE version.[/color] As for other body types: Make a mock up and we&#39;ll talk. But I will \r<br />automatically reject anything that is on a body of ridiculous/scant \r<br />proportions or that offers bouncing breasts and butt, or on a body that \r<br />the dress just does not fit on and requires warping of the mesh and \r<br />textures. Skimpy modifications will be rejected no matter what. This \r<br />dress mod is meant to be a MODEST LOOK in accordance with the modest \r<br />look of the Vanilla Skyrim female commoners. If it falls outside that \r<br />ideal it will not be allowed. I will honestly admit to being at a point \r<br />where I am fed up with seeing breasts that are ten times to big for a \r<br />tiny body bouncing around and making &#34;swoosh&#34; noises. It&#39;s getting way \r<br />too out of hand guys. I will not have my original mods turned into \r<br />that. [color=#3c78d8][color=#6d9eeb][color=#ffff00]I&#39;m not trying to come off as a feminist because I am the furthest thing from it, but I am just sick of seeing it.[/color] [/color][/color][/color][/color][/color][/color][color=#3c78d8][color=#6d9eeb][color=#ffff00]I have also promised people my mods would not turn into that, and I am \r<br />upholding that promise. I am here to mod for myself and the other girl \r<br />gamers. Sorry guys. [/color]\r<br />\r<br />Q: I don&#39;t like your character. She&#39;s ugly.\r<br />A: That&#39;s not a question. I don&#39;t care. She&#39;s not part of your download anyway, she&#39;s just for me. Don&#39;t troll.\r<br />[/color][/color][/left]\r<br />\r<br />\r<br />[center][color=#ffffff]---------------------------------------------------------------------------------------------------------------------------------------------------------------[/color][/center][/color][/color][color=#3c78d8][size=4]                                                                            [center]Installation:[/center][/size][/color][center]Manual, MO or NMM\r<br />\r<br />[color=#3c78d8][size=4]Requirements:[/size][/color]\r<br />Vanilla or UNP base body. May work with base CBBE.\r<br />\r<br />[color=#3c78d8][size=4]Permissions:[/size][/color]\r<br />May not be uploaded to other sites. Nexus exclusive&#33;\r<br />May not be used in other mods.\r<br />Original meshes and textures may not be altered without my expressed permission. Body Slides will be declined.\r<br />The skirt has been painstakingly weighted to handle what physics Skyrim does have. It does not need any HDT physics.\r<br />[color=#3c78d8][size=4]\r<br />Credits:[/size][/color]\r<br />Dress and tights (meshes and textures) are mine (Property of ViciousSARR)\r<br />Corset and ties from Witcher 3 (Property CDPR), originally imported to Skyrim by zzjay by permission of CDPR\r<br />Boots from Vanilla Skyrim (Property of Bethesda)\r<br />\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------[/center][center][color=#ffff00][size=4]Check out my other mods:\r<br />[url=http://www.nexusmods.com/skyrim/users/14180385/?tb=mods&pUp=1]ViciousSARR[/url]\r<br />And for updates on future mods and WIPs\r<br />Visit [url=https://www.tumblr.com/blog/vicioussarr]Tumblr[/url][/size][/color][/center]",
  "categoryId": "54",
  "version": "v1.0",
  "author": "ViciousSARR",
  "createdUnix": "1460185664",
  "updatedUnix": "1460400558",
  "containsAdultContent": false,
  "uploadedBy": "vicioussarr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000202357",
      "name": "VS Trek Wear Dress",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19570",
      "fileName": "VS Trek Wear Dress-74854-v1-0.7z",
      "uploadedUnix": "1460185291",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f9cada62dc68cff54fabae8dc62e749cbf7ff27e56b2ee9a62c09a406d4d73d/analysis/1460185333/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VS%20Trek%20Wear%20Dress-74854-v1-0.7z?fid=1000202357&ttl=1535863639&ri=8192&rs=8192&setec=fd42f888bdd9d8690cf6b77c5744c109"
    },
    {
      "fileId": "1000202759",
      "name": "VS Trek Wear Dress 3 Colour Addon",
      "version": "v1.0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8317",
      "fileName": "VS Trek Wear Dress 3 Colour Addon-74854-v1-0-1.rar",
      "uploadedUnix": "1460400558",
      "modVersion": "v1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7c6972ab5d2eb0de23f50cbc226cb7c74a9985385697fa46117ce056dd056fd0/analysis/1460400609/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/VS%20Trek%20Wear%20Dress%203%20Colour%20Addon-74854-v1-0-1.rar?fid=1000202759&ttl=1535863639&ri=8192&rs=8192&setec=b29fefaf07a7a03c5e0ec38d22b9401c"
    }
  ]
}