{
  "modId": 74893.0,
  "modName": "Wearable Lanterns -- Spanish",
  "summary": "Esta es la traducción de este fantástico mod creado por Chesko que permite portar faroles para iluminar nuestro camino.",
  "descriptionHtml": "Esta es la traducción de este fantástico mod creado por Chesko que permite portar faroles para iluminar nuestro camino.\n<br />\n<br />[center][img]http://centostudios.com/Compatible.png[/img][/center]\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/55496/?]CORRECCIONES Y MEJORAS DE TEXTOS Y VOCES[/url][/center]\n<br />\n<br />Si te da miedo adentrarte en la oscuridad de Skyrim, este complemento te ayudará a superarlo. Ahora será posible equiparnos con faroles que nos permitirán ver alrededor sin tener que portar una antorcha. Además, los aventureros más sabios saben hacer un buen uso de las luciérnagas para ello, simplemente metiendo una en un tarro de cristal.\n<br />\n<br />Pero, ojo, tanto los faroles como las luciérnagas necesitarán suministros para continuar ofreciéndonos esa cálida luz. Los faroles necesitarán aceite, el cual se podrá comprar a los comerciantes, y las luciérnagas necesitarán polen, que extraerán de flores de montaña, cardos lanudos o lavanda.\n<br />\n<br />Para más información, acerca de los requisitos necesarios y características, puedes visitar la página del mod original y ya de paso, reventar el botón de endorse para animar a Chesko a que siga creando complementos tan buenos y de calidad como este. ¿¡A qué esperas!? ¡Destroza ese botón! y si de paso lo haces con el mío, pues eso ya sería la leche.\n<br />\n<br />[color=#93c47d]¿Por qué usar mis traducciones?\n<br />\n<br />- Porque no están hechas a base de copiar los textos en traductores online.\n<br />- Porque se usa el sentido común en todo momento para redactar palabras, frases y oraciones.\n<br />- Porque se ajustan fielmente a los conceptos del juego y en general, al mundo de Elder Scroll.\n<br />- Porque se redactan siguiendo nuestras reglas gramaticales y se evita crear frases robotizadas.\n<br />- Porque son actualizadas siempre que sea necesario para corregir errores y establecer mejoras.\n<br />- Porque se ajustan al proyecto \"Correcciones y mejoras de textos y voces\" para lograr una mayor inmersión.\n<br />- Porque todos los textos de configuración y jugabilidad se traducen siempre al 100%.\n<br />- Porque se realizan intencionadamente para que parezcan parte del propio juego y se enlazan conceptos similares con otras traducciones.\n<br />\n<br />Fe de erratas:\n<br />\n<br />Soy consciente que a veces puedo cometer algún error, por lo que si en tus partidas detectas alguna falta de ortografía, algún espacio de más, algo que te suene a chino o quisieras hacerme alguna sugerencia respecto a alguna frase traducida, no dudes en comentármelo. ¡Tu ayuda será siempre bien recibida![/color]\n<br />\n<br />¡Que lo disfrutes!\n<br />\n<br />[color=#f6b26b]¡Ah! y no te olvides de estas[/color] [url=http://www.nexusmods.com/skyrim/users/3198127/?tb=mods&amp;pUp=1]otras traducciones[/url][color=#f6b26b].[/color]\n<br />\n<br />[center][img]http://centostudios.com/Imagen.png[/img][/center]",
  "categoryId": "78",
  "version": "4.0.2",
  "author": "supercento",
  "createdUnix": "1460288561",
  "updatedUnix": "1495969576",
  "containsAdultContent": false,
  "uploadedBy": "supercento",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000245487",
      "name": "Wearable Lanterns",
      "version": "4.0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "Wearable Lanterns-74893-4-0-2E.rar",
      "uploadedUnix": "1495969576",
      "modVersion": "4.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/3318e6716070a85f3896ade6a0694511f657ce80d2e62de11502e460f8d67fbe/analysis/1495969862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Wearable%20Lanterns-74893-4-0-2E.rar?fid=1000245487&ttl=1535863678&ri=8192&rs=8192&setec=d8c9f4ea663a9c171025772b9c3ea41e"
    }
  ]
}