{
  "modId": 75014.0,
  "modName": "Unique Bodies by Race",
  "summary": "Gives each playable race in vanilla Skyrim their own body meshes, as well as their own clothing and armor meshes. This includes clothing and armor from Dawnguard and Dragonborn.",
  "descriptionHtml": "[size=5]Description\r<br />[/size][size=3]I know there are a number of mods that make custom bodies for each race out there, but I wanted to make my own. I also wanted to make my mod able to be easily integrated into other mods out there, or to be used to easily make totally new ones. The result is my mod here: Unique Bodies by Race.\r<br />\r<br />This mod gives each playable race in vanilla Skyrim their own body meshes for females. This mod also makes essentially all the clothing and armor in Skyrim, Dawnguard, and Dragonborn look different, making each race look unique in clothing. The Argonian meshes are designated by &#34;Beast,&#34; rather than Argonian. This is a remnant of the previous edition and was easier to keep that way than change the name. Also all records added by this file have &#34;_UBBR&#34; at the end to better find them. The naked meshes included are actual nude meshes. So if you do not like nudity in your game, this mod is not for you.\r<br />\r<br />This was done by building the meshes using the [url=http://www.nexusmods.com/skyrim/mods/49015/?]Bodyslide and Outfit Studio[/url] with different presets. The meshes built do not contain any physics to them. This means there is no BBP, TBBP, or HDT physics in the meshes. You can always build meshes with these physics  using Bodyslide given that you have the desired Bodyslide data. See the &#34;Customization&#34; heading below for more details on doing this. For the Elder race, I only built meshes for the armor and clothing that appear on Elder NPCs in vanilla Skyrim, Dawnguard, and Dragonborn.\r<br />\r<br />I also made some fixes to some of the clothing in the game while working on this mod. This includes making the Ulfric armor on females look similar to the Ulfric armor on males. This was done using, with permission, [url=http://www.nexusmods.com/skyrim/users/3761089/?]Saratje&#39;s[/url] assets in her [url=http://www.nexusmods.com/skyrim/mods/27673/?]Ulfric&#39;s Clothes for Women[/url] mod. Thank you again Saratje&#33;\r<br />\r<br />I have included the mod in a loose file version and a BSA version. You can download one or the other. DO NOT download both versions.\r<br />[/size]\r<br />[size=3]I NO LONGER HAVE THE MALE SKELETON CHANGE FILES UPLOADED&#33; See the &#34;Changelog&#34; section below for additional details as to why.\r<br />\r<br />I also uploaded an optional file named &#34;UBBR Unique Textures&#34; that gives each race their own set of body, head, and hand textures as well. I included in the file the vanilla Skyrim diffuse, normal, and specular maps for males, and the default CBBE diffuse, normal, and specular maps for females. All the NPCs of each gender will have the same texture when downloading this file, but you can change the textures to your own liking to make them different. Look under the &#34;Customization&#34; section for more details. The esp included overwrites the esp in the main file, allowing for fewer esp files&#33;\r<br />\r<br />[/size][size=3][size=3]I have included a file of the presets used in building the meshes in Bodyslide. These can be used to build meshes to custom \r<br />clothing or armors, or to customize the presets to your liking. The presets named &#34;NewPreset&#34; and &#34;NewPresetClothes&#34; were used to build the &#34;Default&#34; look. In order to access these presets, you must use the group (which I also included) named &#34;My Group.&#34;  From there you can save the preset and include any group you wish.[/size]\r<br />[/size]\r<br />[size=4]Just for reference[size=3] when I say &#34;Default&#34; meshes, I mean meshes that go in their natural directory (e.g. the Default hide armor goes into the file structure &#34;meshes/armor/hide&#34;). These meshes are only shown in game for non-playable races that do not use one of the playable races as a template. These races and the &#34;Default&#34; race are about the only races that use these meshes. Otherwise the meshes used come from the new meshes added for each race. This means the included file named &#34;Default Meshes&#34; will put meshes into their natural directory and should be used only if you wish to replace the vanilla meshes. Hope this clears things up&#33;[/size][/size]\r<br />\r<br />[size=5]Requirements\r<br />[/size][list]\r<br />[*][size=5][size=3]Dawnguard[/size][/size]\r<br />[*][size=5][size=3]Dragonborn[/size][/size]\r<br />[*][size=5][size=3]Hearthfire[/size][/size]\r<br />[*][size=5][size=3][url=http://www.nexusmods.com/skyrim/mods/71214/?]USLEEP[/url] by Arthmoor and the Unofficial Skyrim Team[/size][/size]\r<br />[/list]\r<br />[size=5][size=3][size=5][size=3][size=5][size=3][size=5]Recommended Mods\r<br />[size=3]-[url=http://www.nexusmods.com/skyrim/mods/7587/?]Height Adjusted Races[/url] by [/size][/size]EvilDeadAsh34 to add height variability to all races.[/size][/size][/size][/size][/size][/size]\r<br />\r<br />[size=5]Installation\r<br />[size=3]Extract the file into your Data folder for Skyrim.\r<br />\r<br />Or you can download it and install using NMM or MO.\r<br />\r<br />I would recommend installing with a mod manager because there are a lot of files. Unless you keep close track of all the files, it will be very difficult to uninstall or update the mod.\r<br />\r<br />[size=5]Updating\r<br />[size=3][u]For NMM or MO Users:[/u]\r<br />[/size][/size]-Uninstall the old version and install with the new version.\r<br />[u]Manual:[/u]\r<br />-[/size][/size][size=3]Delete all the old files from the old version, then extract the files of the new version into your Data folder.[/size][size=5][size=3]\r<br />[/size][/size][size=5][size=3] \r<br />[/size]Compatibility\r<br />[size=3]This mod [b]IS[/b] compatible with any retexture of the vanilla armors or clothing.\r<br />\r<br />It [b]IS NOT[/b], however, compatible with any remeshes of the vanilla armor. So if you have mods that skimpify or change the meshes of the armor in any way, they will not show in this mod. You can build the meshes of remeshed armor with Bodyslide, or copy and paste them into the correct folders to have them appear in game. See the &#34;Customization&#34; heading below for more details.\r<br />\r<br />Custom races should work fine with this mod. If the race uses one of the vanilla races as a template for its armor or clothing, then its meshes will match those of that race. Otherwise, it will use the &#34;Default&#34; meshes.\r<br />\r<br />The meshes used in this mod are CBBE based, so it [b]IS NOT[/b] compatible with any other body mods.\r<br />\r<br />It is also not compatible with any mod that changes the &#34;armor addons&#34; or the &#34;armors&#34; of the vanilla clothing and armor. They will overwrite the changes done by this mod. It is suggested to put the &#34;Unique Bodies by Race-Overhaul.esp&#34; file low in your load order to try and prevent these overwrites. I have recently uploaded some patches for certain mods. Look to the &#34;Patches&#34; section below for the current patches.\r<br />\r<br />I have just uploaded an esm file and standalone esp file that are both compatible with USLEEP. So all the fixes brought by USLEEP are now compatible with this mod&#33;\r<br />\r<br />[size=5]Customization\r<br />[size=3]You can fairly easily customize this mod to create the meshes you desire to see in game. You can use Bodyslide to create new presets, or alter the presets I have included, then build the meshes you want. Each race has its own directory. They will look something like the following: &#34;Data/meshes/xxx&#34; where &#34;xxx&#34; is the name of the race (e.g. Argonian, Dark Elf, etc.). Within these directories are the clothing and armor meshes which are built exactly the same as their &#34;Default&#34; counterparts. For example, the bandit armor has the following file structure: &#34;meshes/armor/bandit.&#34; The file structure for the Argonian bandit armor is the following: &#34;meshes/Argonian/armor/bandit.&#34; The only difference is the addition of the race folder. This allows for easier building of your own meshes.\r<br />\r<br />[size=3]As mentioned above, the mod contains an esm file. I have done it like this so that you can use my mod to make compatibility patches or other patches with my mod. This includes making custom armors or clothing use custom meshes for each race. All you have to do is open the UniqueBodiesbyRace-Master.esm file along with whatever mod you wish to include this mod into in the CK and make the changes. If you do no know how to do this, there are plenty of tutorials out there on how to use the CK. I want this mod to be able to be used with an innumerable amount of mods, so that&#39;s why I made it as a master.\r<br />\r<br />If you downloaded the optional file &#34;UBBR Unique Textures&#34; or &#34;UBBR Unique Textures and Male Skeleton Change,&#34; you can replace the textures included in that file to customize the textures to your liking. The female textures are within the file structure &#34;textures/actors/character/xxxfemale&#34; where xxx represents each race. The elder female textures are within their natural directory &#34;textures/actors/character/femaleold.&#34; Replace the textures &#34;femalebody_1.dds&#34; and &#34;femalebody_1_msn.dds&#34; within each race&#39;s folder to change the diffuse and normal map for each race. The male textures are built similarly as the female counterparts, only replace any &#34;female&#34; in the file name with &#34;male.&#34;[/size][/size][/size][/size][/size]\r<br />\r<br />[size=5]Future Plans\r<br />[size=3]I will make a few patches using this mod in the future, but I do not plan to make patches for many mods. I do not have the time to make patches for all the different mods out there. That&#39;s why I have left it open for easy integration into other mods. If you wish for this mod to work with another one, create a compatibility or other patch for it. I have detailed my permissions information for using this mod below in the &#34;Permissions&#34; section.\r<br />\r<br />[size=5]Changelog\r<br />[size=3][u]Version 2.0 Update:[/u] Removed the male skeleton change files because the mod [size=5][size=3][size=5][size=3][size=5][size=3][size=5][size=3][url=http://www.nexusmods.com/skyrim/mods/7587/?]Height Adjusted Races[/url] by [/size][/size]EvilDeadAsh34[/size][/size][/size][/size][/size][/size] does exactly what the male skeleton change files were intended to do. Instead you can just download that mod to have height variability in NPCs. Also the skeletons included were not compatible with many mods out there that require HDT skeletons (like the XPMSE skeleton) for animations or physics extensions. Doing this also makes this mod have better compatibility with other mods since it will no longer change the races. Sorry for any issues that this may cause, but I think this will be better in the long run.\r<br />\r<br />Version 2.0: Changed the mod setup to include an esm and esp file to make it work. Also made it compatible with USLEEP AND require USLEEP. Place the esp low in your load order.\r<br />\r<br />Version 1.12: Added both a standalone and integrated esp file to fix naked NPCs and cull records lower in the load order.\r<br />\r<br />Version 1.11: Added an esp file named &#34;UniqueBodiesbyRace.esp&#34; that can be downloaded to fix naked NPCs.\r<br />\r<br />Version 1.1: Made each race have their own hand and feet meshes. Also changed file location where the naked body of    each race comes from. They are located in the file structure &#34;meshes/actors/character/xxx&#34; where xxx represents each    race. Within the locations, was able to rename the body meshes to the default femalebody_0.nif and femalebody_1.nif    to make overwriting them easier.\r<br />\r<br />Version 1.01: Added hands and feet meshes to prevent misalignment issues.[/size][/size]\r<br />\r<br />[size=5]Patches\r<br />[size=3]I have included patches to the following mods under the &#34;Miscellaneous&#34; files section:\r<br />- [url=http://www.nexusmods.com/skyrim/mods/22650/?]ESF Companions[/url][/size][/size] by DreamKingMods\r<br />- [url=http://www.nexusmods.com/skyrim/mods/54387/?]Immersive Sounds Compendium[/url] by lazyskeever\r<br />- [url=http://www.nexusmods.com/skyrim/mods/8634/?]Legendary Artifacts[/url] by Goth79\r<br />- [url=http://www.nexusmods.com/skyrim/mods/23390/?]Guard Dialogue Overhaul[/url] by Eckss\r<br />- [url=http://www.nexusmods.com/skyrim/mods/8228/?]Skyrim NPC Immersion Mod[/url] by thelonewarrior\r<br />- [url=http://www.nexusmods.com/skyrim/mods/35841/?]Helgen Reborn[/url] by Mike Hancho\r<br />- [url=http://www.nexusmods.com/skyrim/mods/53767/?]DovahBling[/url] by testiger2\r<br />- [url=http://www.nexusmods.com/skyrim/mods/43053/?]Clothing and Clutter Fixes[/url] by kryptopyr\r<br />- [url=http://www.nexusmods.com/skyrim/mods/34093/?]Weapon and Armor Fixes Remade[/url] by kryptopyr\r<br />\r<br />If there are other patches that you guys make for this mod and wish to share it, PM me with your patch so that I can credit you for your work. I will include them along with the patches I made above.\r<br />\r<br />[size=5]Questions/Issues/Concerns\r<br />[size=3]Leave a comment with whatever question, issue, or concern you may have. I will respond as soon as I am able.\r<br />\r<br />[size=5]Photos\r<br />[size=3]I have uploaded some photos for each body type from the front and side. I have also included photos of examples of each body in clothing or armor standing side-by-side to compare to one another more easily, as well as to see how they look on NPCs. Even though the males of Skyrim were not changed as much as the females, I included photos of them side-by-side as well. The textures of the body used in the photos are not included in this mod. They are the body textures I use in my game. If you wish to, you can also upload your own photos. I have no problem with that (as long as they aren&#39;t inappropriate). I&#39;d love to see them&#33;\r<br />\r<br />[size=5]Permissions[/size]\r<br />You have my permission to use my mod and its resources to make your own mods, but I ask a few things of you:\r<br />\r<br />1. Give me credit for using my mod.\r<br />2. Only upload it to Nexus.\r<br />3. Send me a private message about your mod so that I can see what awesome mods you guys are making&#33;\r<br />\r<br />If you decide to make a compatibility patch for my mod, you obviously need to gain permission from the mod author of the mod you are making my mod compatible with.\r<br />\r<br />[size=5]Mods Used in Screenshots\r<br />[/size][/size][/size][/size][/size][/size][/size][size=3]-[url=http://www.nexusmods.com/skyrim/mods/71054/?]Bijin NPCs[/url] by rxkx22\r<br />-[/size][size=3][url=http://www.nexusmods.com/skyrim/mods/40038/?]Bijin Warmaidens[/url][/size][size=3] by rxkx22\r<br />-[url=http://www.nexusmods.com/skyrim/mods/63473/?]Bijin Wives[/url] by rxkx22\r<br />-[url=http://www.nexusmods.com/skyrim/mods/24909/?]aMidianBorn Book of Silence[/url] by CaBaL120\r<br />-[url=http://www.nexusmods.com/skyrim/mods/72857/?]Warmth[/url] by Ondrea\r<br />-[url=http://www.nexusmods.com/skyrim/mods/2674/?]Improved NPC Clothing[/url] by BaronDavid[/size]\r<br />[size=5][size=3][size=5][size=3][size=5][size=3]\r<br />[size=5]Credits[/size]\r<br />A special thank you so much to all of the following who made this mod possible&#33;\r<br />\r<br />-Bethesda for Skyrim and its DLCs\r<br />-Caliente and Ousnius for [url=http://www.nexusmods.com/skyrim/mods/2666/?]CBBE[/url] body and [url=http://www.nexusmods.com/skyrim/mods/49015/?]Bodyslide and Outfit Studio[/url]\r<br />-Chris57 and FavoredSoul for [url=http://www.nexusmods.com/skyrim/mods/2488/?]Better Males[/url] body mod\r<br />-Caliente, ChronoTrigger77, Ousnius, and Stuffed_bunny for their [url=http://www.nexusmods.com/skyrim/mods/32731/?]Bodyslide data[/url]\r<br />-Gosthy for [url=http://www.nexusmods.com/skyrim/mods/65831/?]Vanilla Outfits Bodyslided for CBBE[/url] mod\r<br />-wavion2 for [url=http://www.nexusmods.com/skyrim/mods/49286/?]OCR Omnisway Clothing Replacer[/url] mod\r<br />-Saratje for [url=http://www.nexusmods.com/skyrim/mods/27673/?]Ulfric&#39;s Clothes for Women[/url] mod\r<br />\r<br />[size=5]Special Thanks\r<br />[/size]-binq007 for all their help in testing my mod in its early stages.\r<br />-waggles516 for all their help in testing the mod in its later stages and sending screenshots of the mod in action.\r<br />\r<br />[size=5]Thank you for visiting my mod page&#33; I hope you enjoy the mod&#33;[/size][/size][/size][/size][/size][/size][/size]",
  "categoryId": "79",
  "version": "2.0",
  "author": "Twags514",
  "createdUnix": "1460770273",
  "updatedUnix": "1471463263",
  "containsAdultContent": true,
  "uploadedBy": "Twags514",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000203271",
      "name": "Default Meshes",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "25523",
      "fileName": "Default Meshes-75014-.7z",
      "uploadedUnix": "1460768520",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/9d10960c702bdb80ba4f22dcf1ebd53df181ea0b4d011ea8a6ab86ccc22c2950/analysis/1460768598/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Default%20Meshes-75014-.7z?fid=1000203271&ttl=1535863797&ri=8192&rs=8192&setec=e86e4f9dcbdf60a5de767808eea8b2bc"
    },
    {
      "fileId": "1000204617",
      "name": "UBBR Bodyslide Data",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "194",
      "fileName": "UBBR Bodyslide Data-75014-.7z",
      "uploadedUnix": "1461806776",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/031fe6a2dab54ef307c2dcf6d70a81f550047f21f35dff02a0265fa55980a17c/analysis/1461806823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UBBR%20Bodyslide%20Data-75014-.7z?fid=1000204617&ttl=1535863798&ri=8192&rs=8192&setec=ff1a356dee385edf9c27cf173777e9be"
    },
    {
      "fileId": "1000204622",
      "name": "Unique Bodies by Race v2.0-Loose files",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "250186",
      "fileName": "Unique Bodies by Race v2.0-Loose files-75014-2-0.7z",
      "uploadedUnix": "1461807527",
      "modVersion": "2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20Bodies%20by%20Race%20v2.0-Loose%20files-75014-2-0.7z?fid=1000204622&ttl=1535863798&ri=8192&rs=8192&setec=f78c873e9c34b155071a640e916b690f"
    },
    {
      "fileId": "1000204623",
      "name": "Unique Bodies by Race v2.0-BSA",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "484703",
      "fileName": "Unique Bodies by Race v2.0-BSA-75014-2-0.7z",
      "uploadedUnix": "1461808407",
      "modVersion": "2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20Bodies%20by%20Race%20v2.0-BSA-75014-2-0.7z?fid=1000204623&ttl=1535863799&ri=8192&rs=8192&setec=a7156d56c5db10ff482d85f51398313a"
    },
    {
      "fileId": "1000204626",
      "name": "UBBR Unique Textures",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "132751",
      "fileName": "UBBR Unique Textures-75014-.7z",
      "uploadedUnix": "1461808786",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/aa069f471c73a725c2de2cb3dcb422dd48b3877693da584fbc40e2b6f02c80ff/analysis/1461808816/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UBBR%20Unique%20Textures-75014-.7z?fid=1000204626&ttl=1535863799&ri=8192&rs=8192&setec=fffc1f5abd9aa194b0eee6517b50bd7d"
    },
    {
      "fileId": "1000204679",
      "name": "UBBR Unique Textures Hotfix",
      "version": "",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "23",
      "fileName": "UBBR Unique Textures Fix-75014-.7z",
      "uploadedUnix": "1461859539",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d3de01897d49871be36389bbdde73fc50aaae6310eb3165e8a67cfce89290395/analysis/1461859563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UBBR%20Unique%20Textures%20Fix-75014-.7z?fid=1000204679&ttl=1535863799&ri=8192&rs=8192&setec=81df4dd4c694011882f5a0a8ebe5a33d"
    },
    {
      "fileId": "1000214905",
      "name": "Guard Dialogue Overhaul Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "Guard Dialogue Overhaul Patch-75014-.7z",
      "uploadedUnix": "1469815189",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/705eb93101a10f34b6747ffb2a1771e3050f14434c68889282d5816a1e49410e/analysis/1469815205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guard%20Dialogue%20Overhaul%20Patch-75014-.7z?fid=1000214905&ttl=1535863800&ri=8192&rs=8192&setec=0c0368e91e802baffe046b85ee2cbd71"
    },
    {
      "fileId": "1000214906",
      "name": "ESF Companions Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "ESF Companions Patch-75014-.7z",
      "uploadedUnix": "1469815268",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d7978c418187c355c01eaac97386f67a687ea38d2955d106343d6b50c7357420/analysis/1469815323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ESF%20Companions%20Patch-75014-.7z?fid=1000214906&ttl=1535863801&ri=8192&rs=8192&setec=32be2afb4bac6f78b56d37cbfc8b9616"
    },
    {
      "fileId": "1000214907",
      "name": "Immersive Sounds Compendium Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "Immersive Sounds Compendium Patch-75014-.7z",
      "uploadedUnix": "1469815341",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8fc997af4020188dadd581ac6cae26fab712f28e48df42248fd6bc5dfb867c9f/analysis/1469815382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Sounds%20Compendium%20Patch-75014-.7z?fid=1000214907&ttl=1535863801&ri=8192&rs=8192&setec=3c7be84bb3f63331795d52fc35d5a55b"
    },
    {
      "fileId": "1000214908",
      "name": "Legendary Artifacts Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "Legendary Artifacts Patch-75014-.7z",
      "uploadedUnix": "1469815404",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/14a8f0f436ae884b41d1ad851c2ce31a8b957c53f4b79351f624abd710d24248/analysis/1469815442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Artifacts%20Patch-75014-.7z?fid=1000214908&ttl=1535863802&ri=8192&rs=8192&setec=98f9d7b0043d6539a14bc82b51e6bcbc"
    },
    {
      "fileId": "1000214909",
      "name": "Skyrim NPC Immersion Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "Skyrim NPC Immersion Patch-75014-.7z",
      "uploadedUnix": "1469815479",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5a1b51531ac2a50a380daf48c1a9616614c6e214918ca6169c327620d59888a1/analysis/1469815502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20NPC%20Immersion%20Patch-75014-.7z?fid=1000214909&ttl=1535863802&ri=8192&rs=8192&setec=5a40c9d9e69e89cb86c509af4e65e5c7"
    },
    {
      "fileId": "1000215244",
      "name": "Helgen Reborn Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "Helgen Reborn Patch-75014-.7z",
      "uploadedUnix": "1470046574",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/94f0b5e0bbe8bf950498807d2b546cca101a0e5ffed2717202fdae2428c1d630/analysis/1470046623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Helgen%20Reborn%20Patch-75014-.7z?fid=1000215244&ttl=1535863803&ri=8192&rs=8192&setec=37297864b77a5d80c4f51268cd670108"
    },
    {
      "fileId": "1000215330",
      "name": "DovahBling Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "DovahBling Patch-75014-.7z",
      "uploadedUnix": "1470104541",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/381709c6ee8d09f8f4ac371a2583122df1a01dd8909732c6cabf2a85904cfaa9/analysis/1470104582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DovahBling%20Patch-75014-.7z?fid=1000215330&ttl=1535863803&ri=8192&rs=8192&setec=26f40bec0d4ebf3d020080e139b89e02"
    },
    {
      "fileId": "1000216194",
      "name": "Clothing and Clutter Fixes Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "12",
      "fileName": "Clothing and Clutter Fixes Patch-75014-.7z",
      "uploadedUnix": "1470685539",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2888f1dd19a61834ecc717a0e7879450e86929a4b33476ece931f15167aa0b0f/analysis/1470685563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clothing%20and%20Clutter%20Fixes%20Patch-75014-.7z?fid=1000216194&ttl=1535863804&ri=8192&rs=8192&setec=d1a418dd72d66541d6b70bde9eeda65a"
    },
    {
      "fileId": "1000216195",
      "name": "Weapon and Armor Fixes Patch",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "12",
      "fileName": "Weapon and Armor Fixes Patch-75014-.7z",
      "uploadedUnix": "1470685591",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2e7954d2aee0c4aa824286288424a9aa437d3746b30f94d02f6dd457dd57b2fa/analysis/1470685622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Weapon%20and%20Armor%20Fixes%20Patch-75014-.7z?fid=1000216195&ttl=1535863804&ri=8192&rs=8192&setec=3a970f056ae44c1eb88ca57674caf6d5"
    },
    {
      "fileId": "1000217349",
      "name": "Unique Bodies by Race ReadMe v3",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Unique Bodies by Race ReadMe v3-75014-.7z",
      "uploadedUnix": "1471463263",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fcf9936b33babbf406f55cdd2ac17485aedbe15cb6a20ce9b399391f288b8de3/analysis/1471463283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unique%20Bodies%20by%20Race%20ReadMe%20v3-75014-.7z?fid=1000217349&ttl=1535863805&ri=8192&rs=8192&setec=9189be72c4051c734566389bfd0e2341"
    }
  ]
}