{
  "modId": 75028.0,
  "modName": "(FR) Voyage Rapide depuis les interieurs",
  "summary": "Un mod qui permet d&#39;effectuer les voyages rapides depuis les intérieurs, en Français &#33;",
  "descriptionHtml": "[size=4][size=2]Fr version[/size]\r<br />[b]\r<br />[color=#ff0000]AVANT TOUTES CHOSES, CE MOD [u]N&#39;EST PAS UNE TRADUCTION[/u], BIEN QU&#39;IL EN EXISTE DES SIMILAIRES SUR LE NEXUS, MAIS EN ANGLAIS. QUOIQU&#39;IL EN SOIT, CECI EST MA VERSION PERSONNELLE. L&#39;AVANTAGE PAR RAPPORT A UNE VERSION ANGLOPHONE EST QUE CELA VOUS PERMET D&#39;AVOIR LES NOMS DES ZONES, BÂTIMENTS, ETC. EN FRANÇAIS. [u]AUCUNE DONNÉE VENANT D&#39;UN AUTRE MODDEUR N&#39;A ÉTÉ UTILISÉE.[/u][/color]\r<br />[/b][/size]\r<br />\r<br />[b][i][u]Prérequis :[/u][/i][/b]\r<br />Ce mod requiert les 3 DLC : Dawnguard, Dragonborn et Hearthfires\r<br />\r<br />[u][i][b]Description :[/b][/i][/u]\r<br />Ce mod simple va vous permettre d&#39;effectuer des voyages rapides lorsque vous êtes à l&#39;intérieur des bâtiments/donjons/etc.\r<br />[u]\r<br />Exemple :[/u] vous êtes dans la longère du jarl d&#39;Épervine et souhaitez vous téléporter au Château Volkihar. Plus besoin de ressortir du bâtiment et d&#39;attendre un chargement long &#33; Vous avez simplement à prendre la carte quand vous êtes à l&#39;intérieur, et à cliquer comme pour un voyage rapide normal.\r<br />\r<br />Fonctionne dans tous les intérieurs du jeu vanilla et des DLC, soit :\r<br />- Maisons/bâtiments\r<br />- Donjons\r<br />- Ruines\r<br />- etc.\r<br />\r<br />Si vous êtes perdu dans un donjon, que vous en avez marre de faire des chargements tout le temps (en particulier sur un PC peu performant) ou simplement que vous utilisez des mods qui donnent des noms anglophones à certains lieux du jeu (voir plus bas), ce mod EST pour vous :)\r<br />\r<br />Si vous ne trouvez pas cela Lore-Friendly, rien ne vous empêche de ne pas l&#39;utiliser.\r<br />\r<br />/&#33;&#92; NE fonctionne PAS avec les intérieurs des mods (ex : vous ajoutez une maison, vous serez soumis aux règles normales)\r<br />[b]NOTE[/b] : Ce mod ne fonctionne pas dans Griffenoire, les mondes daedriques, Sovngarde et tous les mondes parallèles.\r<br />[b]NOTE 2 :[/b] Si vous n&#39;activez pas les 3 DLC, votre jeu va crash.\r<br />\r<br />[u][b][i]Installation/désinstallation :[/i]\r<br />[/b][/u]Glisser le fichier .esp vers le dossier data. Pour désinstaller, supprimer le fichier.\r<br />\r<br />[i][u][b]Compatibilité :[/b][/u][/i][b]\r<br />[/b]\r<br />Peut avoir des soucis de fonctionnement en cas d&#39;utilisation de Wrye Bash.\r<br />\r<br />Tous les mods devraient fonctionner avec, attention cependant vous ne serez pas en mesure de vous téléporter des intérieurs d&#39;un autre mod qui rajoute un lieu (comme une maison) vers l&#39;extérieur, car cela fonctionne uniquement sur les lieux de Skyrim / Dawnguard / HearthFires / Dragonborn.\r<br />\r<br />Également, pensez à charger ce mod APRES tout mod modifiant les noms des lieux vanilla (ex : si vous utilisez un mod qui modifie la Jument Pavoisée et lui met le nom en Anglais, chargez ce mod AVANT le Voyage Rapide d&#39;Intérieur pour avoir le nom de la taverne en Français). Le mod vous permet donc d&#39;utiliser n&#39;importe quel mod de modification des lieux vanilla sans pour autant compromettre votre cohérence linguistique dans le jeu.\r<br />[b][u]\r<br />[u][i][b]FAQ[/b][/i][/u]\r<br />[/u][color=#ffff00]Q : Puis-je me téléporter depuis l&#39;intérieur de la maison que j&#39;ai installé grâce à un mod ?[/color]\r<br />[/b]A : Non, c&#39;est malheureusement impossible, on ne peut se téléporter que depuis les intérieurs vanilla (sauf les mondes parallèles tels les plan d&#39;Oblivion)[b]\r<br />[color=#ffff00][u]\r<br />[/u]Q : J&#39;ai le jeu en Français mais certains bâtiments ont des noms anglophones &#33;[/color]\r<br />[/b]A : Dans ce cas, c&#39;est que vous avez des mods qui modifient le noms des lieux du jeu en leur noms Anglais (ça peut être tout simplement un mod qui change les intérieurs d&#39;une taverne). Dans ce cas, chargez ce mod APRES tous les mods modifiant les lieux vanillas.\r<br />\r<br />[color=#ffff00][b]Q : Mon jeu a crash après l&#39;installation du mod &#33;[/b][/color]\r<br />A : Avez-vous bien chargez les DLC AVANT le mod ? Sans les DLC, le mod fait crash le jeu.\r<br />\r<br />[color=#00ff00][size=4]Il est fortement recommandé de charger le mod en dernier, quoi qu&#39;indique votre gestionnaire de mod &#33;[/size][/color]\r<br />[b][size=4][b][color=#ff0000]\r<br />/&#33;&#92; [/color][/b][/size][color=#ff0000][size=4]Il existe un problème de compatibilité avec WryeBash[/size][/color][u]\r<br />\r<br />[i]Crédits :[/i][/u][/b]\r<br />Bethesda Softworks pour Skyrim et l&#39;univers des Elder Scrolls.\r<br />L&#39;auteur est noté Lazak, mais mon pseudo sur le Nexus est Valdsak.\r<br />Le mod existe sur la [url=http://www.confrerie-des-traducteurs.fr/skyrim/mods/jouabilite/amelioration_du_voyage_rapide]Confrérie des Traducteurs.[/url]",
  "categoryId": "39",
  "version": "1.0",
  "author": "Lazak - Valdsak",
  "createdUnix": "1460838376",
  "updatedUnix": "1460838369",
  "containsAdultContent": false,
  "uploadedBy": "Valdsak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000203364",
      "name": "Voyage Rapide d&#39;Interieur",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "68",
      "fileName": "Voyage Rapide d'Interieur-75028-1-0.7z",
      "uploadedUnix": "1460838369",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d08fbc04457d56306ebc46e80f3c93133657a0a7f1804cc6d8d892da84e41dee/analysis/1460838424/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Voyage%20Rapide%20d%27Interieur-75028-1-0.7z?fid=1000203364&ttl=1535863817&ri=8192&rs=8192&setec=183aa84719af801db6c4e2c9c845da59"
    }
  ]
}