{
  "modId": 75081.0,
  "modName": "Ragnar&#39;s Retreat",
  "summary": "Ragnar&#39;s Retreat is a fully-upgradeable player home in Rorikstead that grows as you progress through the game.",
  "descriptionHtml": "[color=#ff0000][center][img]http://i.imgur.com/Xwp4fTz.png[/img][/center]\r<br />A Hearthfire Multiple Adoptions-Compatible, game progression-enhanced player home.\r<br />-- Version One Release --\r<br />This version SHOULD have no bugs, but please report any in the comments&#33; Thanks :)\r<br />[/color]\r<br />[b]I. Summary\r<br />II. Details\r<br />III. Features\r<br />IV. Compatibility & Requirements\r<br />V. Upgrades List\r<br />VI. Notes\r<br />VII. Installation\r<br />VIII. Credits\r<br />\r<br />I. Summary[/b]\r<br />At the edge of Rorikstead perches a proud but empty house of traditional stone and thatch. Its large property looks over the vast cold tundra toward Whiterun. All that&#39;s missing is an owner: someone who wishes to see their house expanded as they themselves gain power, notoriety and wealth.\r<br />Ragnar&#39;s Retreat is a fully upgradeable, lore-friendly Skyrim player home that grows as you do. Modular upgrades can be purchased as you progress through the game, without the need for you to move out or reorganize, or gather building materials. The intent is to provide a player home that realistically matches what the Dragonborn might actually be able to purchase and acquire at any given time in the narrative.\r<br />\r<br />[b]II. Details[/b]\r<br />You begin by purchasing the home from the Innkeeper in Rorikstead for 5,000 gold. The house begins with four childrens&#39; beds (it is fully Hearthfire Multiple Adoptions compatible), a loft bedroom, a kitchen, a small loft office and a small amount of storage space. The intent is for it to feel like a true beginning home, without all the amenities a starter adventurer might have available.  In this way, rather than beginning the game with a mansion, or having to move home as you get money, you can have your home progress with you. \r<br />\r<br />As you become leader of each of the Guild/College etc., you&#39;ll be able to unlock additions to the home for extra fees. These upgrades merely add additional parts to the house, interior and external--they do not alter space you&#39;re already living in, so you DO NOT need to move out between upgrades. Upgrades include an Armory wing with weapons/armor storage and displays and mannequins, as well as a forge area and simple followers&#39; quarters; a Vault/Treasury, with Dragon Claw/Mask/Elder Scrolls/Thieves&#39; Guild etc displays; a Wizard&#39;s Tower with alchemy, staff enchanting and enchanting stations; a Dark Brotherhood Sanctum with an altar and alchemy table; a Library wing; decorations, and more. The entire home is in one cell, so there&#39;s no load screens from wing to wing, with the exception of the underground DB Sanctum and the Dawnguard hideout. The Armory, Library and Wizard&#39;s Tower also add external wings/towers to the home, so your progress is quite visible from the outside as well.\r<br />\r<br />[b]III. Features[/b]\r<br />- Fully navmeshed (of course)\r<br />- Ragnar&#39;s Rest is fully Hearthfire Multiple Adoptions compatible, and can be chosen as a &#34;Bless Home&#34; home; it has two childrens&#39; beds. \r<br />- All storage is completely safe storage (if you find an exception, please notify me, but there should be none). \r<br />- There are custom displays for almost all collectibles in the game, a shrine or two for curing diseases and blessings, and (eventually) all major crafting stations. The Armory offers custom and named storage for most types of weapons and armor. The mod also has a fast travel point with a horse stable, and a wood chopping block for Frostfall users.\r<br />- A really nice view (seriously, you can see Dragonreach on a clear day).\r<br />For individual in-game features please see the detailed list of purchaseable Additions below. While the home was intended specifically to be lore-friendly (in terms of not having a mansion at the start, or a shack at end-game), there are a couple &#34;special&#34; upgrades that some might find a bit over the top--see Spoilers below. \r<br />\r<br />What is NOT Featured: There are no custom meshes or textures and no General Stores integration. There is no magic spider crafting table. There are no Hearthfire planters. This is NOT a build-your-own-home mod; there&#39;s no gathering materials required, nor do you need to make choices about which module to put where. You simply unlock and purchase new wings as you progress.\r<br />\r<br />[b]IV. Compatibility/Requirements[/b]\r<br />Requires all DLC (Hearthfire, Dragonborn, Dawnguard) + Skyrim Update. Fully compatible with Hearthfire Multiple Adoptions; use that mod to move children to this home. It WILL work with Alternate Start - Live Another Life; you do not need to be the Dragonborn, nor are such things referenced until you&#39;re on the actual main quest, and no major upgrades require main quest progression.\r<br />\r<br />Any mods that modify the area just east of Rorikstead, south of the road, will likely be incompatible, due to home location. Any mods that modify or remove involved NPCs may force users to use console commands to purchase upgrades, etc (see Additions list below for NPCs).\r<br />I have done my best to optimize this mod so it will run quickly despite the large (eventual) interior.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/60906/]JK&#39;s Rorikstead[/url] is reported compatible, but Ragnar&#39;s Retreat -must- come before it in the load order to prevent CTDs. Two apple trees will stand in the path to the house, but otherwise there is no reported interaction. [url=https://www.nexusmods.com/skyrim/mods/12800/?]Enhanced Rorikstead[/url] is said to be compatible if Ragnar&#39;s Retreat comes -after- it in the load order.\r<br />\r<br />[b]V. Upgrades List and Details\r<br />(See ReadMe for more, including prerequisite quests, NPCs to speak to, and details)[/b]\r<br />\r<br />Addition: Thieves&#39; Guild Treasury / Vault\r<br />Prerequisite Quest: &#34;Under New Management&#34; / TGLeadership\r<br />NPC: Delvin Mallory (The Ragged Flagon, Riften)\r<br />Cost: 5000 Gold\r<br />Details: Adds a treasury and vault beneath the home (in the same cell) accessible past the childrens&#39; room. Includes all Thieves&#39; Guild treasure displays, Dragon mask and Claw displays, an Elder Scrolls display, Weapons displays, a mannequin, and storage. Note: the prerequisite quests requires FULL ownership of the Thieves&#39; Guild, which means you&#39;ll need to have run all of the additional radiant quests to gain influence in the various Holds.\r<br />\r<br />Addition:  Full Armory and Followers&#39; Quarters\r<br />Prerequisite Quest: &#34;Glory of the Dead&#34; / C06\r<br />NPC: Farkas (Jorrvaskr, Whiterun)\r<br />Cost: 5000 Gold\r<br />Details: Adds a large armory decorated with Jorrvaskr banners and rugs. This armory includes  a multitude of weapons displays and racks, mannequins, a werewolf statue, and a small followers&#39; quarters with five beds. It&#39;s all accessible through the childrens&#39; room to the left of the house, and adds an external wing to the rear left side of the home.\r<br />\r<br />Addition:  Library\r<br />Prerequisite Quest: &#34;Tending the Flames&#34; / MS05\r<br />NPC: Viarmo (Bard&#39;s College, Solitude)\r<br />Cost: 5000 Gold\r<br />Details: Adds a two-level library with a fireplace and a small &#34;office&#34; area on the right side of the house. Adds an external wing to the rear right side of the house.\r<br />\r<br />Addition: Wizard&#39;s Tower\r<br />Prerequisite Quest: &#34;The Eye of Magnus&#34; / MG08\r<br />NPC: Tolfdir (College of Winterhold)\r<br />Cost: 5000 Gold\r<br />Details: Adds a small Wizard&#39;s Tower on the left side of the house (if you&#39;re facing the front door), accessible through the little office. The tower features alchemy ingredients, Enchanting, Staff Enchanting and Alchemy tables, and storage, as well as an exit to a small balcony overlooking the tundra--which is added alongside an external Wizard&#39;s Tower to the left of the house.\r<br />\r<br />Addition: Dark Brotherhood Sanctum\r<br />Prerequisite Quest: &#34;Hail Sithis&#33;&#34; / DB11\r<br />NPC: Nazir (Dark Brotherhood Sanctuary)\r<br />Cost: 5000 Gold\r<br />Details: Adds a Dark Brotherhood altar/cave beneath the house which includes poison Alchemy plants, bookshelves, a chest and an Alchemy table. Accessible through new trap doors in the kitchen (to the right of the table) and outside, to the left of the farm beneath the pine tree.\r<br />\r<br />Addition: Dawnguard Safe Room / Vampire Lair (dependant upon faction)\r<br />Prerequisite Quest: &#34;Kindred Judgement&#34; / DLC1VQ08\r<br />NPC: Gunmar (Dawnguard side) or Vingalmo (Volkihar side)\r<br />Cost: 3000 Gold\r<br />Details: A near-hidden door will be placed at the back of the house (underneath the Library walkway, if that has been built). This will lead to either a Vampire Lair or a Dawnguard Safe Room depending upon which side the Dragonborn has sided with. The Vampire Lair has a small study and a &#34;feast&#34; room, with a cell that contains two Vampire Thralls, as well as a coffin to sleep in and a respawning Blood Potion. The Dawnguard Hideout has a useable Stendarr shrine, weapons racks and displays, a mannequin, food and storage, and two beds. Like the Dark Brotherhood addition, either of these hideouts is more aesthetic than utilitarian.\r<br />\r<br />Addition: Black Books Display\r<br />Prerequisite Quest: &#34;At the Summit of Apocrypha&#34; / DLC2MQ06\r<br />NPC: Mralki (Frostfruit Inn, Rorikstead)\r<br />Cost: Free\r<br />Details: Adds a Black Books display with a few Dragonborn-themed decorations to the left of your Main Hall, against the rear wall.\r<br />\r<br />Addition: Mirmulnir&#39;s Skull\r<br />Prerequisite Quest: &#34;Dragon Rising&#34; / MQ104\r<br />NPC: Jarl of Whiterun\r<br />Cost: Free\r<br />Details: Places the skull of Mirmulnir the dragon atop your home&#39;s front door. Mralki of the Frostfruit Inn in Rorikstead can remove and replace this as you wish, for a labor fee of 100 Gold. This is a reward for killing your first dragon, at the Whiterun tower, and can be obtained right after the quest by speaking to the Jarl.\r<br />\r<br />Addition: Imperial Banners, or Stormcloak Banners + Talos Shrine\r<br />Prerequisite Quest: &#34;The Battle for Solitude&#34; / &#34;The Battle for Windhelm&#34; /  CWSiegeObj\r<br />NPC: Mralki (Frostfruit Inn, Rorikstead)\r<br />Cost: 100 Gold\r<br />Details: Finishing the Civil War quest line will provide the option to set up either Imperial banners (if Imperial) or Stormcloak banners and a Talos shrine (if Stormcloak). It&#39;s two interior banners, several exterior, and an exterior shrine, and these can be removed or replaced via Mralki, for a labor fee of 100 gold each time.\r<br />\r<br />\r<br />Additional... Additions: (SPOILERS)\r<br />\r<br />* Finishing the main questline will add the Paarthurnax-loyal guardian dragon Vulonjunyol to the exterior of your home. He is friendly, and will simply perch on your roof and occasionally circle overhead, as well as aid you in combat should enemies approach your home. Vulonjunyol is currently set to Essential, and will also respawn if he flies too far and despawns. If this creates problems please let me know.\r<br />\r<br />* Entering your home for the first time after finishing Sheogorath&#39;s quest will provide you with a small additional surprise. If you install the mod having already done it, you may be startled on entering your home, but the letter should explain everything. For those concerned, it is entirely lore-accurate (I researched it thoroughly) and does not provide any tangible/overpowered reward, unless you are from Wisconsin, or perhaps Amsterdam or France.\r<br />\r<br />\r<br />[b]VI. NOTES: [/b]\r<br />* DO NOT STORE anything close to the EXTERIOR rear of the home, unless it is right on the benches or table there, when about to add the Talos shrine, Library, or Armory. You don&#39;t need to worry about anything in the interior.\r<br />\r<br />* Actually purchasing the home is a prerequisite to obtaining any upgrade--you can&#39;t unlock them until you&#39;ve actually bought the home, but you can unlock them retroactively. In other words, if you&#39;re already Archmage, you can buy the Wizard&#39;s Tower addon once you&#39;ve purchased the home--but not before.\r<br />\r<br />* For the purposes of this mod, Mralki of the Rorikstead Inn is best left alive. He&#39;s been set to Protected by this mod--so you can still kill him if you really want to, but he should be a little less likely to die at random. Mralki is the NPC you need to speak with to initially purchase the home, as well as to toggle later decor upgrades. \r<br />\r<br />* If Mralki or any other involved NPC have died (I took care to choose Essential ones, but some become non-Essential after completion of their quest lines), you can use console commands to either revive them or to set the quest stage. Note that doing the latter will grant the upgrade free of charge, and in some cases may be a little buggy due to some quest progression occurring via dialogue. Quest IDs can be found above, and generally the stage where you are granted the upgrade is stage 20. Use the command Setstage Questname 20 to get any particular upgrades if your NPC is dead. The purchase quest is RORMANBuyManor, and 20 will give you a letter with information, whereas 30 grants the home, deed and key.\r<br />\r<br />* The mod has been cleaned with TESV edit, but I&#39;m very new to that. If you see anything that needs further cleaning please contact me (be as detailed as possible&#33;) and I&#39;ll sort it out.\r<br />\r<br />[b]VII. Installation:[/b]\r<br />Unzip the included files into your Data folder. The information on this page is included in ReadMe format.\r<br />\r<br />[b]VIII. CREDITS:[/b]\r<br />* [url=http://www.nexusmods.com/skyrim/mods/62732/ ]http://www.nexusmods.com/skyrim/mods/62732/ [/url]- Modders&#39; Display Compendium by MrDanSG1 provided almost all of the custom Dragon Mask/Claw/Thieves&#39; Guild etc displays in the Treasury, as well as the Black Books displays and more. I altered their appearances but he&#39;s been kind enough to provide the activators and basic displays for any modder who needs them.\r<br />* [url=http://www.nexusmods.com/skyrim/mods/23254/?]http://www.nexusmods.com/skyrim/mods/23254/?[/url] - Buildable Home Resource and Tutorial by Supernastypants. This mod author&#39;s resource provides copyable bookshelves and displays which come in IMMENSELY handy. All of the bookshelves, mannequins and weapons racks were taken from here.\r<br />* [url=https://www.youtube.com/user/DARKF0X127 Darkfox127]https://www.youtube.com/user/DARKF0X127[/url] Darkfox127 is an incredible Youtube tutorial creator. He has a multitude of very well-organized videos and explains things in simple, clear but comprehensive terms. I highly recommend his videos for both beginner and advanced modders. I have to admit I&#39;d never have gotten anywhere without these. (Any failings, however, are my own&#33;)\r<br />\r<br />__________\r<br />\r<br />Like this mod? Try my other, simpler Nord/Warrior-themed home, the simple, open and cozy mead hall [url=http://www.nexusmods.com/skyrim/mods/61040/?]The Warrior&#39;s Abode&#33;\r<br />[/url]",
  "categoryId": "67",
  "version": "V1.000",
  "author": "Feralkyn",
  "createdUnix": "1460991461",
  "updatedUnix": "1461495632",
  "containsAdultContent": false,
  "uploadedBy": "Feralkyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000204167",
      "name": "Ragnar&#39;s Retreat",
      "version": "V1.000",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "361",
      "fileName": "Ragnar's Retreat-75081-V1-000.zip",
      "uploadedUnix": "1461495632",
      "modVersion": "V1.000",
      "virusScanUrl": "https://www.virustotal.com/file/df7c99c50d3fdab73bacc431237552ba6da9150418074180784a153555d5ebf9/analysis/1461495423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ragnar%27s%20Retreat-75081-V1-000.zip?fid=1000204167&ttl=1535863861&ri=8192&rs=8192&setec=4ef316f327224c804fd13f80f47fa2c4"
    }
  ]
}