{
  "modId": 7511.0,
  "modName": "Vinis Legit Food and Rest",
  "summary": "If you&#39;re looking for a needs mod that allows you to roleplay instead of micromanage, I urge you to read on.",
  "descriptionHtml": "[center]\r<br />[size=3]Nexus Exclusive[/size]\r<br />[img]http://img41.imageshack.us/img41/5602/titleit.png[/img]\r<br />\r<br />[size=5]Gives purpose to food and rest without adding tedious &#39;realism&#39;.[/size][/center]\r<br />\r<br />\r<br />\r<br />\r<br />[center]\r<br />[img]http://img4.imageshack.us/img4/7796/featuresh.png[/img]\r<br />\r<br />[size=5][color=yellow]No regeneration without food or rest&#33;[/color][/size]\r<br />Not always having maximum regeneration adds challenge.\r<br />\r<br />[size=5][color=yellow]Sleep is important for the body and mind&#33;[/color][/size]\r<br />Rested bonuses granted only if you get enough sleep.\r<br />\r<br />[size=5][color=yellow]Experience the joys of cooking&#33;[/color][/size]\r<br />New recipes and graphics for food.\r<br />\r<br />[size=5][color=yellow]Get plastered&#33;[/color][/size]\r<br />New immersive inebriation system.\r<br />\r<br />[size=5][color=yellow]Timescale friendly&#33;[/color][/size]\r<br />Scale duration of food effects to your timescale.\r<br />\r<br />[size=5][color=yellow]Customizable plugins&#33;[/color][/size]\r<br />Several optional features available to choose from.\r<br />\r<br />[img]http://img46.imageshack.us/img46/7281/image01n.png[/img][/center]\r<br />\r<br />\r<br />\r<br />\r<br />[center][img]http://img13.imageshack.us/img13/5981/detailse.png[/img][/center]\r<br />\r<br />[size=6]Overview[/size]\r<br />If you&#39;re looking for a needs mod that allows you to roleplay instead of micromanage, I urge you to read on.\r<br />\r<br />This mod turns off base regeneration for health, stamina, and magicka. In order to recover any stats, you will need to gain some additional regeneration from eating a piece of bread, sleeping, wearing mage robes, or drinking a regeneration potion. This adds challenge and improves roleplaying. The purpose of food and rest is tied directly into the game engine itself rather than being implemented as an additional layer of arbitrary stats to manage.\r<br />\r<br />\r<br />\r<br />\r<br />[size=6]Sleep[/size]\r<br />In addition to granting faster skill leveling, sleep is now important for your stamina and magicka regeneration.\r<br />\r<br />\r<br />[size=4]Lover&#39;s Comfort[/size]\r<br />For 16 hours, all skills improve 15% faster; stamina and magicka regenerate 50% faster.\r<br />[color=grey]Sleep in bed with your spouse for at least 8 hours to get the Lover&#39;s Comfort bonus.[/color]\r<br />\r<br />[size=4]Well Rested[/size]\r<br />For 16 hours, all skills improve 10% faster; stamina and magicka regenerate 50% faster.\r<br />[color=grey]Sleep in an inn or your house for at least 8 hours to get the Well Rested bonus.[/color]\r<br />\r<br />[size=4]Rested[/size]\r<br />For 12 hours, all skills improve 5% faster; stamina and magicka regenerate 30% faster.\r<br />[color=grey]Sleep anywhere else for at least 6 hours to get the Rested bonus.[/color]\r<br />\r<br />\r<br />You must sleep long enough or you will not get the best rested bonus possible. Sleeping fewer hours can give you lesser bonuses though. If you wake up feeling tired, you can go back to sleep for a few more hours. Try sleeping a little more until you get the bonus.\r<br />\r<br />While under the influence of the Lover&#39;s Sign, you will still be able to get the the regeneration bonuses from sleeping.\r<br />\r<br />\r<br />\r<br />\r<br />[size=6]Food and Drink[/size]\r<br />Food is no longer just clutter. Instead of being weak, instant recovery items, food now grants health, stamina, or magicka regeneration for a long duration.\r<br />\r<br />[b]Get a [url=https://docs.google.com/spreadsheet/ccc?key=0As0Zk8LnuY30dHNfZ3BUbTIwS00wZXllWWcwWGRjbEE]complete listing of food items and their effects[/url] on Google Docs.[/b]\r<br />\r<br />\r<br />[size=4]Health[/size]\r<br />Meat, fowl, and fish give health regeneration.\r<br />[color=grey]In general, health regenerates very slowly. However eating protein allows you to recover from injuries over a long period of time, such as while resting or just standing around.[/color]\r<br />\r<br />[size=4]Stamina[/size]\r<br />Bread, fruit and vegetables give stamina regeneration. \r<br />[color=grey]Carbohydrates, vitamins, and minerals give the body raw energy. They are especially beneficial when consumed in a cooked form.[/color]\r<br />\r<br />[size=4]Magicka[/size]\r<br />Cheese and sweets give magicka regeneration.\r<br />[color=grey]Fats are needed for peak mental function, while sweets can also provide a temporary boost.[/color]\r<br />\r<br />[size=4]Alcohol[/size]\r<br />Alcoholic beverages give various effects including high stamina regen or speechcraft.\r<br />[color=grey]Drinking too much lowers magicka regeneration and slows movement. As you become more inebriated, your vision will become blurry and you will stumble around until you sober up enough.[/color]\r<br />\r<br />\r<br />Certain food items are only partially consumed. Using a loaf of bread only consumes half of it. Using a cheese wheel only consumes a portion of it. The remaining portions are placed back into your inventory.\r<br />\r<br />Additionally, any effects from food will stack with those from potions, so feel free to use both&#33;\r<br />\r<br />\r<br />\r<br />\r<br />[size=6]Werewolves[/size]\r<br />[color=yellow]As of version 2.2.0, the optional werewolf plugin has been made obsolete and implemented in a new way for better compatibility with other mods that make changes to werewolves. Enjoy&#33;[/color]\r<br />\r<br />Werewolves have a constant 30% bonus to stamina and magicka regen. They still cannot get the rested bonuses. \r<br />\r<br />\r<br />\r<br />\r<br />[size=6]Vampires[/size]\r<br />Vampires can eat food, but they get no nourishment from it. Vampires must drink blood, which increases health, stamina, and magicka regen by 50% for approximately 18 hours game time (or 36 hours if you select the Double Duration option in the installer). The sun will still sap your regen like always, so avoid it.\r<br />\r<br />\r<br />\r<br />\r<br />[size=6]Optional Plugins[/size]\r<br />[size=4]Cooking[/size]\r<br />This plugin adds new recipes and modifies some of the vanilla ones. Some recipes may require ingredients that can only be obtained if you are also using the Loot or Vendor plugins.\r<br />\r<br />[size=4]Vendors[/size]\r<br />This plugin modifies some of the merchant lists and containers to include new ingredients for cooking recipes and other food items.\r<br />\r<br />[size=4]Loot[/size]\r<br />This plugin modifies some loot containers to include new ingredients for cooking recipes and other food items. Loot containers include things like barrels and dead animals.\r<br />\r<br />\r<br />\r<br />\r<br />[center]\r<br />[img]http://img716.imageshack.us/img716/7771/installation.png[/img]\r<br />[size=5][color=red]Please read carefully&#33;[/color][/size][/center]\r<br />\r<br />[size=6]Upgrading to a New Version[/size]\r<br />[color=yellow]IMPORTANT: Version 2.2.X requires full deactivation and a &#34;clean&#34; save if upgrading from version 2.1.2 or earlier.[/color]\r<br />\r<br />See the readme if upgrading from version 1.X.\r<br />\r<br />If you are upgrading from version 2.0 and later, it&#39;s not usually necessary to do a full deactivation and uninstall. The readme will indicate when it is required. If in doubt though, you can always follow the instructions for full deactivation. \r<br />\r<br />When full deactivation is required, you will need to follow the uninstall instructions below. Next you must create a &#34;clean&#34; save. That is, you must save your game WITHOUT the mod installed. Only then should you install the new version. \r<br />\r<br />When full deactivation is not required, simply install the new version as you normally would. \r<br />\r<br />[size=6]To Install[/size]\r<br />The easiest and best way to install is with [url=http://skyrim.nexusmods.com/mods/modmanager]Nexus Mod Manager[/url]. After you add the mod to Manager, select it in the list and click the Activate button. Manager will show you a dialogue that will prompt you with configuration options.\r<br />\r<br />See the readme for more information about these options and for manual installation instructions.\r<br />\r<br />[size=6]To Uninstall[/size]\r<br />[color=yellow]Before you remove the mod files, you MUST do the following&#33; Failure to take these steps can cause your character&#39;s actor values to be FUBARed. Don&#39;t say I didn&#39;t warn you&#33;[/color]\r<br />[list][*]Load up your save with the mod installed.[*]Open the console and enter &#34;[font=monospace][color=grey]bat killvf[/color][/font]&#34;. This will execute the command &#34;[font=monospace][color=grey]set _VF_GlobalInit to 0[/color][/font]&#34;, and signal to the scripts that the mod should be disabled.[*]Wait up to 10 seconds until you see a message box appear. It will indicate that the mod is deactivated and can be uninstalled.[*]Click &#39;Okay&#39; and save your game immediately.[*]Exit Skyrim and uninstall the mod.[/list]\r<br />\r<br />\r<br />\r<br />[center]\r<br />[img]http://img29.imageshack.us/img29/6061/compatibility.png[/img][/center]\r<br />This mod is compatible with Dawnguard, but does not require it.\r<br />\r<br />This mod is available in English and [url=http://skyrim.nexusmods.com/mods/15763]Russian[/url]. Thanks to TheWiseCat of [url=http://bit.ly/99PCA]Tamriel Chronicles[/url] for the Russian translation.\r<br />\r<br />The modified UI in the screenshots is not a feature of this mod. It is not required, but you should check out [url=http://skyrim.nexusmods.com/mods/3863]SkyUI[/url] and [url=http://skyrim.nexusmods.com/mods/2596]Kingthings Petrock font[/url].\r<br />\r<br />[size=6]Incompatibility Issues[/size]\r<br />Incompatibility issues are going to arise when using this with any other mods that change food items or the rested bonuses and scripts.\r<br />\r<br />This mod is not fully compatible with [url=http://skyrim.nexusmods.com/mods/9286]Skyrim Redone[/url], since it does modify food items. You can use both mods together as long as you load vinis_food_and_rest.esp [i]after[/i] the SkyRe plugins, but SkyRe&#39;s Wayfarer food perks won&#39;t function.\r<br />\r<br />This mod is mostly compatible with [url=http://skyrim.nexusmods.com/mods/8075]Realistic Wildlife Loot And Recipes[/url]. RWLR makes some minor modifications (such as name changes) to some vanilla food items. For the most compatibility possible, load vinis_food_and_rest.esp [i]after[/i] the RWLR plugins. However, the new food items added by RWLR will not have the regeneration food effects used by this mod. This can&#39;t be helped unless the author of RWLR creates a compatibility patch for this mod.\r<br />\r<br />By its very nature, [url=http://skyrim.nexusmods.com/mods/2730]Better Sorting[/url] sets itself up to have incompatibility issues with many mods. This one is no exception. And no, I won&#39;t be creating a compatibility patch, so don&#39;t ask. \r<br />\r<br />[size=6]Some Compatible Mods[/size]\r<br />These are some fully compatible mods. This list is by no means comprehensive.\r<br />[list][*][url=http://skyrim.nexusmods.com/mods/11163]Frostfall[/url][*][url=http://skyrim.nexusmods.com/mods/2700]Duel[/url][*][url=http://skyrim.nexusmods.com/mods/12687]Tales of Lycanthropy[/url][*][url=http://skyrim.nexusmods.com/mods/11919]Economics of Skyrim[/url][*][url=http://skyrim.nexusmods.com/mods/18866]Hunting in Skyrim[/url][*][url=http://skyrim.nexusmods.com/mods/21587]Character Creation Overhaul[/url][*][url=http://skyrim.nexusmods.com/mods/24222]Vampiric Thirst - Dawnguard Edition[/url][*][url=http://skyrim.nexusmods.com/mods/9717]Better Vampires[/url][/list]\r<br />This mod is also compatible with [url=http://skyrim.nexusmods.com/mods/5485]Deadly Combat[/url], however you may notice that your stamina sometimes regenerates even if you don&#39;t have any food or rest bonuses. This is caused by a feature of Deadly Combat that adds additional stamina regeneration when standing still.\r<br />\r<br />\r<br />\r<br />\r<br />[center]\r<br />[img]http://img36.imageshack.us/img36/5990/faqre.png[/img][/center]\r<br />[size=6]I ate fifty cabbages, but I don&#39;t regenerate stamina. Help&#33;[/size]\r<br />If your regeneration actor values are screwed up PRIOR to installing this mod, you might not be able to regenerate even after eating food or sleeping. By the way, the number of cabbages that you eat won&#39;t change anything.\r<br />\r<br />But that explanation probably doesn&#39;t help you to correct the problem. Let me first describe how regeneration works in vanilla Skyrim. You have three actor values that control how much health, stamina, and magicka you restore every &#34;tick&#34;: They are healrate (0.7 by default), staminarate (5), and magickarate (3). Next you have three more actor values that are percentage multipliers to the first three: They are healratemult (100 by default), staminaratemult (100), and magickaratemult (100). When you drink a potion of regeneration, for example, it will temporarily increase your healratemult value by 50.\r<br />\r<br />This mod does not change healrate, staminarate, or magickarate at all. However it DOES give you a hidden effect that reduces healratemult, staminaratemult, and magickaratemult by 100 each. Since those are 100 by default, decreasing them by 100 means that they would be 0. This causes you to not regenerate without some kind of additional effect, such as wearing mage robes, drinking a regeneration potion, eating a cabbage, or sleeping. So I&#39;ll say it again: If your regeneration actor values are screwed up PRIOR to installing this mod, you might not be able to regenerate even after eating food or sleeping.\r<br />\r<br />How do we fix it then? It&#39;s hard to give specific instructions for a general diagnosis, but you can take some steps toward finding a solution to the problem. It would be wise to make a backup save before trying this.\r<br />1) Use the following commands to check your base regen values:\r<br />[font=monospace][color=grey]player.getav healrate\r<br />player.getav staminarate\r<br />player.getav magickarate[/color][/font]\r<br />Unless you are expecting them to be different, they should be 0.7, 5, and 3 respectively.\r<br />2) You can use the following commands to check your regen multipliers:\r<br />[font=monospace][color=grey]player.getav healratemult\r<br />player.getav staminaratemult\r<br />player.getav magickaratemult[/color][/font]\r<br />These will be different depending on what active effects you have. If possible, unequip everything and wait for your active effects to wear off.\r<br />3) Now use the following commands to modify you regen multipliers:\r<br />[font=monospace][color=grey]player.forceav healratemult X\r<br />player.forceav staminaratemult Y\r<br />player.forceav magickaratemult Z[/color][/font]\r<br />You will want to replace X with 0 PLUS any bonuses to health regen that won&#39;t wear off and cannot be unequipped. Similarly, replace Y and Z with the appropriate numbers.\r<br />For example, let&#39;s assume my healratemult is currently at -44. I have unequipped everything and waited for food and rested bonuses to wear off. However, I have some other mod installed that is giving me an additional 25% to health regen. I will want to use the command &#34;[font=monospace][color=grey]player.forceav healratemult 25[/color][/font]&#34; to correct my health regen.\r<br />\r<br />\r<br />\r<br />\r<br />[center]\r<br />[img]http://img594.imageshack.us/img594/2596/changelog.png[/img][/center]\r<br />[list]2.2.3[*]Added a tiny speedmult hack so that the slow effect from inebriation gets applied and removed consistently. [*]Added new recipe for Cottage Pie (Leg of Goat + Potato + Carrot + Leek).[*]Added new recipe for Hard-Cooked Egg (Chicken Egg).[*]Fixed missing sound effects for several food items.[/list]\r<br />[list]2.2.2[*]Added basic support for vampires&#33; ~(-,,-)~[/list]\r<br />[list]2.2.1[*]Added new recipe for Mulled Wine (Wine + Juniper Berries + Elves Ear).[*]Cleaned up order ingredients are listed in recipes. [/list]\r<br />[list]2.2.0[*]The optional werewolf plugin has been made obsolete and implemented in a new way for better compatibility with other mods that make changes to werewolves. Enjoy&#33; [*]Fixed problem where player would retain rested bonuses after becoming a werewolf. [/list]\r<br />[list]2.1.2[*]Internal scripting for sleep now works properly in that you can now get the rested bonus by sleeping multiple shorter durations in succession (eg., sleeping for five hours, then another three hours shortly afterward). [*]Made minor changes to sleep messages. [/list]\r<br />[list]2.1.1[*]Fixed problem where the &#34;Beast Blood&#34; regen bonus was not being displayed in the active effects list. [*]Cleaned up some old entries. [/list]\r<br />[list]2.1.0[*]Fixed problem where the &#34;Invigoration&#34; rested bonus was not being removed after the rested bonuses were supposed to wear off.[/list]\r<br />[list]2.0.2[*]Fixed fomod packaging issue with deactivation batch not being installed in the right directory. You don&#39;t need this if you already have the mod, but to uninstall you will have to be extra careful because the console will not be able to find the killvf.txt file. Sorry about that.[/list]\r<br />[list]2.0.1[*]Should now be fully compatible with Frostfall. The &#34;Hearty Meal&#34; bonus now get&#39;s applied when eating several types of cooked meals, namely soups and stews. If you are not using Frostfall, there is no difference from version 2.0.[/list]\r<br />[list]2.0.0[*]Complete overhaul; new file system and many changes and additions[/list]\r<br />[list]1.2[*]Added regen for werewolves; arranged archive for easier manual installation[/list]\r<br />[list]1.1[*]Included batch files[/list]\r<br />[list]1.0[*]Initial release[/list]",
  "categoryId": "24",
  "version": "2.2.3",
  "author": "Vinifera7",
  "createdUnix": "1328053989",
  "updatedUnix": "1348081561",
  "containsAdultContent": false,
  "uploadedBy": "Vinifera7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81864",
      "name": "Vinis Legit Food and Rest 2_1_2",
      "version": "2.1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1485",
      "fileName": "Vinis Legit Food and Rest 2_1_2-7511-2-1-2.7z",
      "uploadedUnix": "1345060651",
      "modVersion": "2.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/ee48f6b7fd57bf0f25446153d2ccec0156a94d10cb643f034a29191ab5b34d87/analysis/1407099426/",
      "changelogHtml": " Internal scripting for sleep now works properly in that you can now get the rested bonus by sleeping multiple shorter durations in succession (eg., sleeping for five hours, then another three hours shortly afterward). Made minor changes to sleep messages. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vinis%20Legit%20Food%20and%20Rest%202_1_2-7511-2-1-2.7z?fid=81864&ttl=1535765603&ri=8192&rs=8192&setec=cc8e768353fbbb75bd8cbf3aa59fb7dd"
    },
    {
      "fileId": "88822",
      "name": "Vinis Legit Food and Rest 2_2_2",
      "version": "2.2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1485",
      "fileName": "Vinis Legit Food and Rest 2_2_2-7511-2-2-2.7z",
      "uploadedUnix": "1347798005",
      "modVersion": "2.2.2",
      "virusScanUrl": "https://www.virustotal.com/file/b6ad84d8bdd9ad3ff67a540753d49afef65c3c9a810b332f0493325bf6ad15f8/analysis/1407169323/",
      "changelogHtml": " Added basic support for vampires! ~(-,,-)~ <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vinis%20Legit%20Food%20and%20Rest%202_2_2-7511-2-2-2.7z?fid=88822&ttl=1535765603&ri=8192&rs=8192&setec=4368a0d44a4dd9d3669dd29900485056"
    },
    {
      "fileId": "89391",
      "name": "Vinis Legit Food and Rest 2_2_3",
      "version": "2.2.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1577",
      "fileName": "Vinis Legit Food and Rest 2_2_3-7511-2-2-3.7z",
      "uploadedUnix": "1348081561",
      "modVersion": "2.2.3",
      "virusScanUrl": "https://www.virustotal.com/file/0a743cee81623928a2633e2920cb706d7e46fdf29ecdbccac0411e02dc0052c2/analysis/1407175383/",
      "changelogHtml": " Added a tiny speedmult hack so that the slow effect from inebriation gets applied and removed consistently.  <br/> \n Added new recipe for Cottage Pie (Leg of Goat + Potato + Carrot + Leek). <br/> \n Added new recipe for Hard-Cooked Egg (Chicken Egg). <br/> \n Fixed missing sound effects for several food items. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vinis%20Legit%20Food%20and%20Rest%202_2_3-7511-2-2-3.7z?fid=89391&ttl=1535765604&ri=8192&rs=8192&setec=095ce5a0bbd1bd3ca873346e484fff39"
    }
  ]
}