{
  "modId": 75127.0,
  "modName": "Holds - Work Page",
  "summary": "Test",
  "descriptionHtml": "[img]http://i.imgur.com/zC6HbSQ.jpg[/img]\r<br />\r<br />\r<br />Holds is a city overhaul project which focuses on what I think are the weaknesses of \r<br />Skyrim compared to the older Elder Scrolls titles. The mod expands upon \r<br />the cities of Skyrim and adds more settlements, architecture, outfits, \r<br />books and named characters with their own backgrounds, homes and daily \r<br />routines while ensuring they feel natural and realistic.\r<br /> \r<br />Falkreath, Winterhold, and Dawnstar have been rebuilt from scratch with their own \r<br />unique designs. The mod also adds a bundle of new settlements like Amber\r<br /> Guard and Black Moor. Most of these new settlements have been placed \r<br />far out of the way and hidden from view to not ruin the expansive \r<br />wilderness theme of the game. The aim of all of this is to create a more\r<br /> memorable and diverse experience, making the cities actually feel like \r<br />cities hopefully without ruining the natural and realistic design of the\r<br /> vanilla game.\r<br /> \r<br />This is not a botanical garden mod, nor is it a beautification mod. Holds aims to stay as lore-friendly as possible and \r<br />at the same time expand on the backgrounds and stories for its \r<br />locations.\r<br /> \r<br />I started working on this project late November 2012 and have devoted averagely two hours a day to the creation kit. One of \r<br />the reasons I felt this project was necessary was the announcement of \r<br />various modding projects adding new content to the game. The problem, \r<br />for me was how expansive their cities looked compared to the cities in \r<br />Skyrim. Coming into Skyrim from Oblivion I was expecting there to be a \r<br />&#39;Better Cities&#39; mod available early on, but there wasn&#39;t and I missed \r<br />the features the Oblivion City Overhaul brought to the game.\r<br /> \r<br />The mod adds a variety of new books written by myself and Alfredasl which \r<br />attempts to flesh out the land and history of Skyrim. They are spread to\r<br /> three locations: the Book Store in Falkreath, the Haafingar Library in \r<br />Solitude and The Palace of Kings Library in Windhelm.\r<br /> \r<br />Any criticism, questions, and help will be greatly appreciated, even the \r<br />criticism. However I will have to ask that you make constructive \r<br />criticism; your opinion does matter and could very well inspire me to \r<br />make changes, however I have designed this project with myself in mind.\r<br />\r<br />\r<br />\r<br />\r<br />[b][u]Livestreams[/u][/b]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[b][u]Installation and Requirements[/u][/b]\r<br />\r<br />Make sure that you have a stable and performance friendly game.\r<br />\r<br />It is higly recommended to install ENBoost. Holds uses a lot of memory and might crash unless ENBoost is installed.\r<br />Check out the STEP guide on how to install ENBoost.\r<br />http://wiki.step-project.com/ENBoost\r<br />\r<br />Add:\r<br />[Memory]\r<br />DefaultHeapInitialAllocMB=768\r<br />ScrapHeapSizeMB=256\r<br />in SKSE.ini to make sure you don&#39;t get infinite loading screen.\r<br />\r<br />I advice installing the mod manually. I have no experience with the mod \r<br />installer tools and therefor I cannot be much help, and there have been \r<br />reported many problems from mod users when installing with these tools. \r<br />What is important is that Holds is loaded last, the only thing that \r<br />should be loaded after Holds.esp should be its compatibility patches and\r<br /> alternative performance patches. So an example:\r<br />\r<br />\r<br />Skyrim.esm\r<br />Dawnguard.esm\r<br />Hearthfire.esm\r<br />Dragonborn.esm\r<br />SkyrimFloraOverhaul.esp\r<br />Holds.esp\r<br />HoldsSkyrimFloraOverhaulCompatibilityPatch.esp\r<br />----bottom----\r<br />\r<br />Do let me know if your having any problems :)\r<br />\r<br />\r<br />\r<br />Naruto2698 has found a possible fix for those who are experiencing crashes and memory related problems (Experimental):\r<br />\r<br />Here&#39;s something that can help people finally get rid of their crashes while using skse and sheson memory patch&#33;\r<br />\r<br />http://forum.step-project.com/topic/6726-common-ctds-freezes-ils-and-memory-issues/\r<br />\r<br />add to your description for people to create a shortcut, and right click it to properties to add -forcesteamloader to the path\r<br />\r<br />so it looks like this:\r<br />&#34;C/users/blah/desktop/skse_loader.exe&#34; -forcesteamloader\r<br />\r<br />&#34;I just did this and I&#39;m roaming around solitude crash free upon npc load&#33; and my cells load quicker than before&#33;&#34;\r<br />\r<br />\r<br />\r<br />Install the meshes and textures from &#39;Winter Is Coming - Cloaks&#39; by Nivea. You \r<br />do not need the esp, but you do need the meshes and textures. Give her \r<br />an endorsement while you are at it.\r<br />http://www.nexusmods.com/skyrim/mods/13486/?\r<br />\r<br />Now install Holds into your data folder. Make sure you have compatibility \r<br />for the mods you suspect would conflict with Holds, see the map on the \r<br />description page if your unsure, the red marked area&#39;s are altered by \r<br />the mod. Make sure that Holds is at the very bottom of your load order, \r<br />and that your compatibility patches are beneath the Holds.esp. Now \r<br />activate Holds and whatever compatibility patches you choose to use in \r<br />your load order and launch the game. Any problems you encounter can be \r<br />discussed here on the mod discussion panel, or reported in the bug \r<br />report panel.\r<br />\r<br />It is advisable to start a new game after installing Holds to avoid annoyances such as the game remembering a bed \r<br />at a certain location which leaves it stuck in a wall or- something \r<br />because Holds changes the location. \r<br />\r<br />Hope you enjoy&#33; :)\r<br />\r<br />\r<br />\r<br />[b][u]How to use with Dyndolod[/u][/b]\r<br />\r<br />You will need to use the complete or modular version without the \r<br />compatibility patches activated when creating the LOD. Once that&#39;s done \r<br />you can safely activate the compatibility patches, and play. :)\r<br />\r<br />\r<br />\r<br />[b][u]Crash in Solitude[/u][/b]\r<br />\r<br />If your having crash issues near Solitude, here is the likely cause: \r<br />Immersive Creatures. I am not entirely sure why it happens, but by \r<br />disabling Immersive Creatures the crash ceased completely. Anywhere else\r<br /> the two mods work fine together, but just near Solitude it does not. I \r<br />will look into this, but consider the Immersive Creatures patch \r<br />incapable of resolving this issue. I would advice people who wish to use\r<br /> Immersive Creatures alongside Holds to play with modular, and leave \r<br />Solitude deactivated for now, or to make the choice on whether to use \r<br />Holds or Immersive Creatures. Will contact mod author and talk to him \r<br />about it and see if we can find a solution.\r<br />\r<br />\r<br />\r<br />[b][u]Crash Dawnstar / Falkreath due to Dragon Combat[/u][/b]\r<br />\r<br />Dragon combat that occurs within these city spaces have an odd habit of \r<br />causing a CTD, either just as the Dragon appears, or sometime later. It \r<br />also appears to be random which makes me believe that its caused by \r<br />memory and engine, and not a problem with the mod itself. When a dragon \r<br />appears it will prompt every NPC within a certain range to react, Holds \r<br />adding a lot of people may be too much for it to take. I thought at \r<br />first this was caused by the MHDT, but that&#39;s not the case. I managed to\r<br /> fight first 1, and then 3 at once later dragons in Falkreath with no \r<br />crash, but I also fought 1 dragon in Dawnstar and crash would occur \r<br />randomly. I will see about speaking with the author of Deadly Dragons \r<br />and see if he can share his knowledge with me, and maybe see if he can \r<br />help me with a patch. In his mod he uses a MCM system which allows you \r<br />to have &#39;Safe-Zones&#39; which means cities wont be attacked by dragons. \r<br />Maybe as a temporary workaround we can see about doing this until we can\r<br /> find a proper fix for it. Otherwise, if I&#39;m right and its engine \r<br />related, this might very well be solved in the Skyrim Remaster where we \r<br />will get a much more capable engine.\r<br />\r<br />\r<br />\r<br />[b][u]Arissa[/u][/b]\r<br />\r<br />Arissa&#39;s compatibility patch has a small issue where she will either leave the \r<br />inn when you first meet her and will have ninjaed off to the southern \r<br />city gate, or she will not leave the inn. I have tried to resolve this, \r<br />something is not clicking, but if you run out the southern city gate and\r<br /> down the road to where the road splits off between three directions and\r<br /> run around the grassy area on your right as you head from Falkreath, \r<br />you will prompt the &#39;Event&#39; which progresses Arissa and will from here \r<br />act normally. The area is just between the road from Falkreath and the \r<br />road on your right, so keep near both roads.\r<br />\r<br />\r<br />\r<br />[b][u]Current locations affected by Holds[/u][/b]\r<br />\r<br />[img]https://staticdelivery.nexusmods.com/images/110/610838-1459771619.jpg[/img]\r<br />\r<br />\r<br />[b][u]What to expect[/u]\r<br />[/b]\r<br />Memorable cities and new settlements, named individual characters with daily \r<br />routines and background stories. New shops and inn&#39;s, new designs and \r<br />new books, new outfits, and new locations and secrets to explore and \r<br />more content in the future, as well as focusing on the other weaknesses \r<br />that Skyrim has compared to the other games.\r<br />\r<br />\r<br />[b][u]Future Plans[/u][/b]\r<br />\r<br />Implementing modular versions of the mod, separating cities and settlements for \r<br />people who only wish to use parts of the mod, and perhaps combine them \r<br />with other City Overhaul Projects.\r<br />\r<br />Adding more compatibility patches.\r<br />\r<br />Implementing Dialogues for the characters.\r<br />\r<br />Adding Quests which will be added step-by-step as I complete them.\r<br />\r<br />Implementing new Guilds, as well as working on continuations/conclusions to the \r<br />vanilla guilds which I felt was left hanging on a poor note.\r<br />\r<br />Adding more Outfits.\r<br />\r<br />Implementing new systems such as Banking, alternative transportation with radiant events, and more.\r<br />\r<br />Finishing and implementing area&#39;s that were not included in the current iteration.\r<br />\r<br />Depending on the popularity of the mod I would consider adding more books, more \r<br />locations, dungeons and more. I have enjoyed modding this project and I \r<br />will gladly continue working on it for as long as people find my work \r<br />enjoyable. \r<br />\r<br />There are many features implemented in Holds already implemented, artifacts to be found, vaults to be looted and secrets to \r<br />be unlocked. I will at some point release a guide to all of this but for\r<br /> now I hope you will enjoy exploring on your own.\r<br />\r<br />\r<br />[b][u]Help[/u]\r<br />[/b]\r<br />I would welcome any help with open arms. I will also support anyone who \r<br />wishes to create patches/fixes/new content for Holds, provided they use \r<br />my mod as a dependency.\r<br />\r<br />Helping me get noticed, and perhaps volunteering yourself as a developer, writer or voice actor would be very appreciated&#33;\r<br />\r<br />\r<br />[b][u]FAQ[/u][/b]\r<br />\r<br />Q: Do you intend to make this modular?\r<br />A: Yes&#33; I do, but because of the deadline I did not have time to do so before release, expect it to be modular soon&#33;\r<br />\r<br />Q: I see purple textures on some of the outfits&#33;\r<br />A: Your likely missing the meshes and textures of the &#39;Winter Is Coming - Cloaks&#39; mod by Nivea.\r<br />http://www.nexusmods.com/skyrim/mods/13486/?\r<br />\r<br />Q: I have found a bug/problem&#33; What do I do?\r<br />A: Report the bug in the bug panel. And I will see what I can do.\r<br />\r<br />Q: This mod makes my frame-rate drop at &#39;X&#39; location(s).\r<br />A: This can be fixed by:\r<br />\r<br />1: Unchecking ObjectPostProcessing in your ENB, and lowering your ENB \r<br />quality. Seriously don&#39;t have your game looking like you&#39;ve lost your \r<br />contact lenses, its not good for your eyes and not good for your \r<br />performance.\r<br />\r<br />2: Evaluating your choice of texture and meshes. This is purely subjective as I use as much 4k resolution textures as I \r<br />can and have an average 57-60fps even in the heaviest area&#39;s (Falkreath,\r<br /> Solitude harbor). This depends completely on the quality of your \r<br />computer and is something your going to have to figure out how to deal \r<br />with on your own. Alternatively I could be persuaded to create a \r<br />performance version of Holds.\r<br />\r<br />Q: I crash instantly at &#39;X&#39; location. What do I do?\r<br />A: Report it in the bug panel and make sure you include a list of your Skyrim Load-list, and I will see what I can do.\r<br />\r<br />Q: Is &#39;X&#39; compatible with Holds?\r<br />A: Check the compatibility list: http://forums.nexusmods.com/index.php?/topic/4029295-installation-guide-and-more/?p=36835215\r<br />\r<br />Q: Can you make &#39;X&#39; compatible with Holds?\r<br />A: Sure, provided the mod author is okay with it. Ask away.\r<br />\r<br />Q: Can I make a compatibility for Holds?\r<br />A: Yes you may. Do ask if you have any questions.\r<br />\r<br />Q: I want to create a patch/fix/extra content for Holds, do I have your permission to do so?\r<br />A: Not only will I support you, but you do not need to ask me for \r<br />permission. Provided you make your mod dependent on Holds and do not \r<br />include any of the meshes, textures and scripts, or claim ownership of \r<br />Holds.\r<br />\r<br />Q: May I use your meshes and/or textures in my own mod?\r<br />A: Ask permission. I do not own everything in the mod, but even so I am \r<br />comfortable making sure I know who makes use of my own content.\r<br />\r<br />Q: May I re-upload your mod at another mod sharing website?\r<br />A: No. This mod is -Mine- and on the Nexus only. If I find out you&#39;ve \r<br />stolen this mod or uploaded it as part of some mod-pack then I will be \r<br />very angry with you.\r<br />\r<br />Q: I was wondering if I might share some idea&#39;s and perhaps things I want changed about Holds, where can I do so?\r<br />A: Either at a discussion forum, or in the comment section. I welcome new idea&#39;s :)\r<br />\r<br />Q: Would Holds be interested in benefiting from my talents? As a voice actor/level designer/writer/quest and dialogue designer?\r<br />A: Yes, but I will need to see examples of your previous work.\r<br />\r<br />Q: I&#39;ve uninstalled your mod but I still have your LOD, how can I fix this?\r<br />A: Use LOD generator to overwrite the Holds LOD. It is very easy to use, follow the instructions.\r<br />http://www.nexusmods.com/skyrim/mods/62698/?\r<br />\r<br />Q: I don&#39;t like this mod. It is not for me.\r<br />A: I am sorry to hear that. Holds is a Project that I have created with \r<br />myself in mind. I hope you find a City Overhaul that suits your \r<br />preferences.\r<br />\r<br />Q: I am having purple tree&#39;s, please help me&#33;\r<br />A: Try deleting the &#34;Trees&#34; folder inside Data/Meshes/Landscape. The old \r<br />assets accidentally included a few SFO trees which is causing the issue.\r<br /> And Nexus refuse to update to the new version properly even after \r<br />re-uploading the files.\r<br />\r<br />Q: I am having problems downloading the assets/Meshes, textures and scripts.\r<br />A: For some reason some are, some aren&#39;t. I am trying to fix this, if you \r<br />experience this problem then post it in the comment section so I know \r<br />the problem persists. I am trying to find ways to fix it&#33;\r<br />\r<br />\r<br />[b][u]Credits\r<br />[/u][/b]\r<br />First and foremost: A special thanks to Breti, the creator of the Rochester \r<br />mod, for providing me not only with 99% of the resources used, but also \r<br />for his help with the Solitude resource collisions. Without him, there&#39;d\r<br /> be no project. Thank You.\r<br />\r<br />Alfredasl deserves recognition for writing the books for Holds with me.\r<br />\r<br />I would also like to give a special thanks to Drakulux who created the mod [url=http://www.nexusmods.com/skyrim/mods/11534/?]http://www.nexusmods.com/skyrim/mods/11534/?[/url] which he has allowed me to implement into Holds. I have implemented it from \r<br />the ground up, with some minor changes. But I still think Drakulux \r<br />deserves recognition for his hard work&#33;\r<br />\r<br />Kalzim7878 also deserves recognition for allowing me to mimic parts of the Solitude harbor to his mod [url=http://www.nexusmods.com/skyrim/mods/22821/?]http://www.nexusmods.com/skyrim/mods/22821/?[/url] . I have of course implemented it from the ground up, with rather large \r<br />changes, Kalzim7878 nice harbor outlay was definitely inspirational, \r<br />thank you&#33;\r<br />\r<br />I also believe Rilax deserves a mention. He has at the time of this writing not released the work I was inspired from. He did \r<br />however upload a couple of screenshots from the Riften Waterfront that \r<br />inspired me to make similar changes. He deserves recognition for his \r<br />hard work&#33;\r<br />\r<br />Lastly a man called Reindeer51 deserves a big thank you for his understanding and permission. Reindeer51 is the author of \r<br />the &#34;SNOW CITY - Windhelm Unleashed&#34; mod:  was kind enough to grant me \r<br />permission to make a similiar design in my expansion of the city to the \r<br />west. Thank you&#33;\r<br />\r<br />If you&#39;ve granted me permission, and don&#39;t find your credits here, please do contact me, however there have been many \r<br />permissions granted, and I have yet to make use of all of it. However do\r<br /> know that your content is well appreciated all the same, and will \r<br />likely be used in the mod eventually. When it is used, the credits due \r<br />will of course be granted.\r<br />\r<br />Breti\r<br />http://www.nexusmods.com/skyrim/mods/52049/?\r<br />\r<br />Blary\r<br />http://skyrim.nexusmods.com/mods/14133\r<br />\r<br />Runspect\r<br />http://skyrim.nexusmods.com/mods/26132\r<br />\r<br />Oaristys\r<br />http://www.nexusmods.com/skyrim/mods/16525/?\r<br />\r<br />Insanitysorrow   \r<br />http://tesalliance.org/forums/index.php?/files/file/1325-insanitys-washing-stuffs/\r<br />http://www.nexusmods.com/skyrim/mods/57839/?\r<br />\r<br />Artisanix \r<br />http://skyrim.nexusmods.com/mods/17423\r<br />\r<br />Stroti\r<br />http://skyrim.nexusmods.com/mods/33948/\r<br />\r<br />Defunkt\r<br />http://www.nexusmods.com/skyrim/mods/56826/?\r<br />\r<br />Ga-Knomboe Boy\r<br />http://skyrim.nexusmods.com/mods/43204//?\r<br />\r<br />Vicn\r<br />http://skyrim.nexusmods.com/mods/45636/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D45636%26preview%3D&pUp=1\r<br />\r<br />Lazyskeever\r<br />http://skyrim.nexusmods.com/mods/40676//?\r<br />\r<br />Kraeten / Mr_Siika\r<br />http://skyrim.nexusmods.com/mods/41036/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D41036%26preview%3D&pUp=1\r<br />\r<br />Defunkt\r<br />http://www.nexusmods.com/skyrim/mods/22684/?\r<br />\r<br />PROMETHEUS_ts\r<br />http://www.nexusmods.com/skyrim/mods/40914/?\r<br />\r<br />Croc\r<br />http://www.nexusmods.com/skyrim/mods/30647/?\r<br />\r<br />L0rd0fWar\r<br />http://www.nexusmods.com/skyrim/mods/5588/?\r<br />\r<br />FranklinZunge\r<br />http://www.nexusmods.com/skyrim/mods/25868/?\r<br />\r<br />Gulchanar\r<br />http://www.nexusmods.com/skyrim/mods/2819/?\r<br />\r<br />MonsterMonkey\r<br />http://www.nexusmods.com/skyrim/mods/3896/?\r<br />\r<br />nouserhere\r<br />http://www.nexusmods.com/skyrim/mods/44167/?\r<br />\r<br />Clepsa\r<br />http://www.nexusmods.com/skyrim/mods/22473/?\r<br />\r<br />Merilia\r<br />http://www.nexusmods.com/skyrim/mods/38282/?\r<br />\r<br />TH3WICK3D1\r<br />http://www.nexusmods.com/skyrim/mods/7807/?\r<br />\r<br />Nivea\r<br />http://www.nexusmods.com/skyrim/mods/13486/?\r<br />\r<br />Nikinoodles\r<br />http://www.nexusmods.com/skyrim/mods/12092/?\r<br />\r<br />Drakulux\r<br /> http://www.nexusmods.com/skyrim/mods/11534/?\r<br />\r<br />JulianP\r<br />http://www.nexusmods.com/skyrim/mods/6575/?\r<br />\r<br />Omesean\r<br />http://www.nexusmods.com/skyrim/mods/35094/?\r<br />\r<br />Gamwich\r<br />http://www.nexusmods.com/skyrim/mods/62153/?\r<br />\r<br />nerdofpray + Tamira + InsanitySorrow\r<br />http://www.nexusmods.com/skyrim/mods/58084/?\r<br />\r<br />Tamira + Stroti\r<br />http://www.nexusmods.com/skyrim/mods/36969/?\r<br />http://www.nexusmods.com/skyrim/mods/42690/?\r<br />http://www.nexusmods.com/skyrim/mods/45540/?\r<br />\r<br />Cleanz0r\r<br />http://www.nexusmods.com/skyrim/mods/50005/?\r<br />\r<br />EcthelionOtW + Brokefoot + QTA\r<br />http://www.nexusmods.com/skyrim/mods/44592/?\r<br />\r<br />LilaMue\r<br />http://www.nexusmods.com/skyrim/mods/46454/?\r<br />\r<br />Jet4571\r<br />http://www.nexusmods.com/skyrim/mods/58262/?\r<br />\r<br />JulianP\r<br />http://www.nexusmods.com/skyrim/mods/6575/?\r<br />\r<br />Kalzim7878\r<br />http://www.nexusmods.com/skyrim/mods/22821/?\r<br />\r<br />Frankdema + CDProjekt + PhilSchmidheiny + L0rd0fWar + northborn + Lorenz Frølich\r<br /> http://www.nexusmods.com/skyrim/mods/20780/?\r<br />\r<br />UNI00SL\r<br />http://www.nexusmods.com/skyrim/mods/56846/?\r<br />\r<br />Johnchi\r<br /> http://www.nexusmods.com/skyrim/mods/14355/?\r<br />\r<br />ActusReus + Dejawolf\r<br />http://www.nexusmods.com/skyrim/mods/26321/?\r<br />\r<br />Nimezis\r<br />http://www.nexusmods.com/skyrim/mods/36738/?\r<br />http://www.nexusmods.com/skyrim/mods/54793/?\r<br />\r<br />Grace Darkling\r<br />http://www.nexusmods.com/skyrim/mods/14031/?\r<br />\r<br />Singlebelong\r<br />http://www.nexusmods.com/skyrim/mods/16977/?\r<br />\r<br />Rohganictus\r<br />http://www.nexusmods.com/skyrim/mods/29610/?\r<br />\r<br />Chinagreenelvis\r<br />http://www.nexusmods.com/skyrim/mods/71527/?\r<br />\r<br />Jacknifelee\r<br />http://www.nexusmods.com/skyrim/mods/49130/?\r<br />\r<br />Omegared99\r<br />http://www.nexusmods.com/skyrim/mods/10277/?\r<br />\r<br />Jedo-dre\r<br />http://www.nexusmods.com/skyrim/mods/32988/?\r<br />\r<br />Zzjay\r<br />http://www.nexusmods.com/skyrim/mods/35125/?\r<br />\r<br />Farinelli\r<br />http://www.nexusmods.com/skyrim/mods/60788/?\r<br />\r<br />Omesean\r<br />http://www.nexusmods.com/skyrim/mods/35094/?\r<br />\r<br />Kettlewitch\r<br />http://www.nexusmods.com/skyrim/mods/73175/?\r<br /> http://www.nexusmods.com/skyrim/mods/53774/?\r<br />http://www.nexusmods.com/skyrim/mods/53681/?\r<br />http://www.nexusmods.com/skyrim/mods/46916/?\r<br />http://www.nexusmods.com/skyrim/mods/44418/?\r<br />http://www.nexusmods.com/skyrim/mods/39939/?\r<br />http://www.nexusmods.com/skyrim/mods/38636/?\r<br />\r<br />Jackstarr\r<br />http://www.nexusmods.com/skyrim/mods/12270/?\r<br />http://www.nexusmods.com/skyrim/mods/34673/?",
  "categoryId": "53",
  "version": "0.0.1",
  "author": "Holds Team",
  "createdUnix": "1461167288",
  "updatedUnix": "1461167288",
  "containsAdultContent": false,
  "uploadedBy": "Exoclyps",
  "primaryFile": null,
  "files": []
}