{
  "modId": 75184.0,
  "modName": "Disney Like Follower Ariel",
  "summary": "Disney-Like Follower.  Not quite the Ariel you know and love... this is based on the original story with a few of my own twists.",
  "descriptionHtml": "[size=3][center][size=6][color=#00ffff]Ariel\r<br />[size=4]Like you&#39;ve never seen her before.[/size][/color][/size][/center][color=#00ff00][size=4]*Will be adding HDT bodies soon[size=3].  See Sticky.[/size][/size][/color]\r<br />\r<br />This is the latest follower to my collection of [color=#ff00ff]Disney Like Princesses[/color].  I present Ariel.  However, this is not the Ariel you know and love from the Disney film.   Truth be told, she didn&#39;t really do anything in the film, she was kind of just there.  Any heroism that took place was done by the Prince so it was hard for me to make a follower based on the character in the movie.  So I turned to the Lore.  The original story had no happy ending. [color=#00ff00] *If you want your childhood ruined you should look up the original stories of the characters Disney based their princesses off.  I don&#39;t recommend it.  But in future I may turn to these stories for inspiration of how to build my followers.* [/color] I don&#39;t wish to completely ruin your childhood so I will give you the option of reading a more or less version of the story at the bottom of the page.  Note that this is not the full story, it is just a summery but it might help explain why my builds for Ariel the follower are what they are.  I will post it at the bottom of the page so if you don&#39;t wish to ruin your child hood, sot reading after my other mods links.  [/size][size=3]\r<br />[size=3]I made two versions, One based on the story and one based on an alternate ending to the story I felt better about.  Ariel, Daughter of the Sky and Ariel the Daughter of Death.  Why a Daughter of Death?  For those who didn&#39;t read the story because you wish to keep your childhood intact, I explained why I made these two versions of her the way I did in the spoiler.  [/size]\r<br />\r<br />*I added the SKSE files and included them in the UNP Daughter of Sky V1.1.  See changelog for details.  These are not required files, they are just fixes IF she looks ugly in game and not like the screenshots. [/size][size=3]\r<br />\r<br />[size=3]*Note that in future I may tackle a project to give her a custom voice and custom lines to fit the Dead Inside Assassin with a Heart as cold as steel but for now, the vanilla skyrim voices will have to do and she is still friendly towards the Dragonborn. [/size]\r<br />\r<br />So, without further ado,  here are her stats and specifications:\r<br />\r<br />[/size][center][size=3]Ariel: Daughter of the Sky\r<br />Location: Riften Inside Honorhall Orphanage\r<br />Race: Nord but she has some Argonian abilities \r<br />to make her more like a humanized Mermaid.\r<br />Body Type: CBBE and UNP\r<br />Armor: Dynasty Armor Sapphire Sky\r<br />Class: Combat Monk\r<br />Attributes: Restoration, Illusion, Stealth.  \r<br />Spells: Bane of the Undead\r<br />Pacify\r<br />Heal Other\r<br />Turn Greater Undead\r<br />Fast Heal\r<br />*Whirl Wind Cloak [color=#00ffff](Requires DB, alternate ESP)[/color]\r<br />*Vampire Bane [color=#00ffff](Requires DG, alternate ESP)[/color]\r<br />*Sun Fire [color=#00ffff](Requires DG, alternate ESP)[/color]\r<br />Perks: Blademen\r<br />Light Foot\r<br />Muffled Movement\r<br />Stealth 80\r<br />Power Shot\r<br />Regeneration\r<br />Animage\r<br />Master Alteration and Restoration\r<br />She uses mainly non evil magic like Calming Illusion magic.  She is very strong against Undead.  She is meant to heal you while you are in combat and calm your enemies.\r<br />[b][color=#00ffff]There are two files.  One that does not require DLCs and one that requires Dawnguard and Dragonborn.[/color][/b]\r<br />\r<br />\r<br />\r<br />Ariel, Daughter of Death\r<br />Location: Sea of Ghosts, Serpent Ston.  See Screenshots.\r<br />Race: Nord but has some Argonian abilities and powers.\r<br />Body Type: CBBE and UNP\r<br />Armor: Ritter Armor Retextured\r<br />Class: Enc DraugrMagic\r<br />Attributes: Destruction, Conjuration, Stealth.\r<br />Spells: Incinerate\r<br />Icy Spear\r<br />Lightning Bolt\r<br />Paralyze\r<br />Conjure Dremora Lord\r<br />Dread Zombe\r<br />Perks: Stealth 80\r<br />Master Conjuration, Destruction, Alteration, Restoration\r<br />Light Foot\r<br />Muffled Movement\r<br />Assassins Blade\r<br />Shadow Warior\r<br />Savage Strike\r<br />Paralyzing Strike\r<br />She is overpowered because she is The Daughter of Death.  She is vicious.  \r<br />\r<br />\r<br />Credits:\r<br />[/size][url=http://www.nexusmods.com/skyrim/mods/2666/?]Caliente&#39;s Beautiful Bodies Edition -CBBE-                    by [b]Ousnius and Caliente\r<br />[/b][/url][url=http://www.nexusmods.com/skyrim/mods/6709/?]DIMONIZED UNP female body                    by [b]dimon99[/b][/url][b]\r<br />[/b][url=http://www.nexusmods.com/skyrim/mods/51602/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D51602&pUp=1]Fair Skin Complexion                    by [b]HHaleyy[/b][/url][b]\r<br />[/b][b][url=http://www.nexusmods.com/skyrim/mods/74017/?]Leyenda Body                    by [b]HeroedeLeyenda[/b][/url]\r<br />[/b][url=http://www.nexusmods.com/skyrim/mods/12951/?]Enhanced Character Edit                    by [b]ECE team[/b][/url][b]\r<br />[/b][url=http://www.nexusmods.com/skyrim/mods/29624/?]RaceMenu                    by [b]Expired[/b][/url][b][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/49015/?]BodySlide and Outfit Studio                    by [b]Ousnius and Caliente[/b][/url][b][/b]\r<br />[b][url=http://www.nexusmods.com/skyrim/mods/35327/?]SG Female Eyebrows                    by [b]Hello Santa[/b][/url][/b]                                                                           \r<br />                  [url=http://www.nexusmods.com/skyrim/mods/13638/?]R18Pn 04 - Ritter Armor for UNP and CBBE V3                    by [b]NPR[/b][/url][b][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14030/?]R18Pn 04 - Ritter Armor for UNP and CBBE Royal ReTexture                    by [b]Messias Mummo[/b][/url][b][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/7270/?]Ultimate Dynasty Armour Collection --CBBE--CBBE BBB--CHSBHC-                    by [b]Midnight Falcon[/b][/url][b]\r<br />[/b][url=http://www.nexusmods.com/skyrim/mods/13722/?]The Eyes Of Beauty                    by [b]Gabriel Mailhot as LogRaam[/b][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/68311/?]KS Hairdos - Renewal                    by [b]Kalilies Stealthic Khaos and Shocky\r<br />[/b][/url][url=https://www.nexusmods.com/skyrim/mods/25859/?tab=2&navtag=https%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D25859&pUp=1]TES5Edit                    by [b]ElminsterAU[/b][/url][b]\r<br />[/b]\r<br />Recommended:\r<br />[url=http://www.nexusmods.com/skyrim/mods/13457/?]Face Light                    by [b]tktk[/b][/url][b]\r<br />[/b][url=http://www.nexusmods.com/skyrim/mods/13531/?]ULTRA REALISTIC WORLD LIGHTING for Skyrim BETA                    by [b]Marco[/b][/url][b][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/13049/?]IMAGINATOR - Visual Control Device for Skyrim                    by [b]MyGoodEye and Gopher - with help from Vivanto and Deapri[/b][/url][b]\r<br />[/b](I do not use ENB becaseu my NVIDIA new update has issues with it.  Instead I use IMAGINATOR, tweaked with Cool Midnight 3 and Overall Nice Enchantment 1.  Adjust Brightness, Saturation and Contrast however you want.)\r<br />[url=http://www.nexusmods.com/skyrim/mods/35303/?]Female Facial Animation                    by [b]nao4288[/b][/url][b][/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/15524/?]Amazing Follower Tweaks                    by [b]Dheuster\r<br />[/b][/url]\r<br />\r<br />[size=4]My Other Mods:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/75321/?]Belle[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/75120/?]Cinderella[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/75032/?]Pocahontas[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/74914/?]Disney Princess Presets for RaceMenu and ECE[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/74804/?]Meggan the Nord and Epic Elf Preset for RaceMenu and ECE\r<br />[/url][/size][size=5]\r<br />I have no plans in the foreseeable future of making Elsa and Anna from Frozen into followers because you can find them at the following links:[b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/73282/?tab=3&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodimages%2F%3Fuser%3D0%26id%3D73282%26gid%3D110]DJQ Frozen                    by [b]Djacko Quatro[/b][/url][/b][url=http://www.nexusmods.com/skyrim/mods/54758/?][b]\r<br />[/b][/url]And Only Elsa here:\r<br />[url=http://www.nexusmods.com/skyrim/mods/51950/?tab=3&selected_game=110&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodimages%2F%3Fid%3D51950%26user%3D1%26gid%3D110&pUp=1]Elsa - Standalone Follower based on Frozen                    by [b]Jokerine\r<br />[/b][/url]Enjoy&#33;[/size][/center][size=3]\r<br />\r<br />\r<br />Ok, onto the original story of The Little Mermaid and my alternate ending. \r<br />\r<br /> The Little Mermaid (who didn&#39;t actually have a specified name but I will refer to her as TLM) was the daughter of the sea king had five older sisters.  It was tradition that when the mermaid turned 15 she may break the surface and see the world above.  TLM watched as one by one her older sisters came of age and broke the surface to see the world above.  Each time her sisters observed the world they would come back with such stories of things they had seen and TLM would grow more and more excited to see it for herself.  Her sisters would all go together and make a special bonding of it but by the time TLM had come of age, observing the world had become old news so she would go alone.  This fact played into her loneliness. \r<br />\r<br />She saw a ship and heard the music, went to instigate and saw the Prince whom she loved at first sight. This was all in the Disney movie so I will skip over it.... there was a fire, she saved him, swam away when someone approached.  The person that approached was a beautiful unknown woman. The Prince never saw TLM.  So she longs for him and wishes to be with him.  But Mermaids live for hundreds of years where humans live for only a few decades.  The trade off is that Humans have an immortal soul and when they die they ascend into Heaven.  Because Mermaids live so long, they have no immortal soul and when they die they become sea foam.  TLM consulted her grandmother about finding a way to be with her Prince.  If she could get the prince to love her more than he would his parents and himself then part of his immortal soul would fill her and when she died she would ascend to Heaven and be with him for eternity.  But they were worlds away and he had no memory of her.  \r<br />\r<br />So she went to the Sea Witch who made her a deal.  (This is where your childhood will really take a hit)\r<br />In exchange for The Little Mermaid&#39;s ability to speak, the Sea Witch would give her legs even though each step she took would feel like knives cutting into the bottom of her feet..  There was no time limit on this but it was also agreed that should she fail and if he marries another then the morning after his wedding she would die and become sea foam.  TLM agreed so the Sea Witch took a knife and cut out TLM&#39;s tongue and then cut off her tail so she grew human legs.\r<br />She was found by the Prince and was taken into his home where his parents treated her as an honored guest.  Over time she and the Prince grew closer but he had his royal obligations.  His parents wanted him to marry a The Lady of the Shrine from a neighboring country but the Prince confides in TLM that he is already in love with another and could not think to part with her.  TLM grew encouraged in her belief that he loved her. But his parents made him sail to the neighboring country anyways. When they arrived he realized that The Lady of the Shrine was the very same woman who found him on the beach after his ship wreck.  He agreed to marry her and TLM realizes that it was this unknown woman whom found the Prince that day that he has been in love with, not TLM.  \r<br />\r<br />TLM had failed.  She went to the sea and wept.  It was then she saw her sisters come up from the depths.  Just as TLM had longed for the prince, her sisters had longed for her once she left.  The sisters had gone to the Sea Witch and had each given their hair, cutting it short in exchange for a way to bring TLM back and save her from dying.  The Sea Witch gave them a dagger with the instructions that if TLM failed, she would have to stab the Prince in the heart with the dagger and spilled his blood on her feet, only then would her feet grow back into the fin she had sacrificed to be with him.  She went into the Prince&#39; room where he and his bride slept and as she held the dagger over him and readied herself to strike she realized that she could not do it because she still loved him, even more than she loved herself.\r<br />\r<br />So she went to the beach to meet the rising sun as she wasted away to sea foam.  But the story does not end here.  \r<br />Suddenly she was in another plain surrounded by immortal beings unseen by mortals.  They were The Daughters of the Sky.  They had no immortal soul but had the ability to obtain one through 300 years of servitude, doing good deeds and guiding children to be good but cannot directly interact.  More like a guiding feeling to behave.  There are conditions to this that have consequences as well...In a nut shell, for every good child The Daughters of the Sky would come across then one day would be deducted from their 300 year sentence.  But every naughty child they would come across would cause them to weep and every tear they shed would add one day.  So this entire story was just a long bed time story to make children feel sorry for TLM then guilt trip them into behaving. \r<br /> Childhood ruined.\r<br />\r<br />T[size=3]he Lore on Mermaids varies to include a version of them being beautiful creatures who capture and drown mortals they snare with their voice but whose tears have the power to heal any wound and grant immortal life.[/size]  \r<br />\r<br />That being said,  I hated the ending the story.  The only thing cool about The Daughters of the Sky is their name and they had the ability to obtain an immortal soul.  But honestly, why would Ariel have wanted one if not for the ability to stay with her Prince after death?  She never sought to obtain one for her own sake, never had any interest in going to Heaven other than the Prince would go there after death and she would not. \r<br />\r<br />So I made my own ending.  If I were Ariel, I would have felt betrayed after giving up my tongue and my fins and after every step I took for years felt like knives cutting into my feet only to have the man I sacrificed these things and endured this pain for suddenly marry a woman he saw only once before because she just happened to be the first person he saw on a beach after a ship wreck.  This woman was not the person who saved him, oh no.... She was the first person he saw.  \r<br />\r<br />So in my version, she did kill him and spilled his hearts blood on her feet.  She then returned to the sea.  Her sisters longed for her and sacrificed their hair to the Sea Witch (though why this is a sacrifice I don&#39;t know but for the sake of the sake we will say that a Mermaids hair gives the Sea Witch some type of power).  Her sisters were overjoyed to have her back but her father, The Sea King was less so.  TLM had given up her fin, cutting off her tie to his real forever for a man she had come into contact with only once before stalking him from afar.  To give up the love of her family and connection to the Sea so completely was seen as asign of betrayal to the Sea so she was banished from it.  The Sea King still loved her as a father would love his daughter and it was out of this love that he returned her tongue but he cursed her to live as an immortal human, forever cut off from the Sea.  She may still touch it and she has certain abilities that her Mermaid blood will always keep but she will never be able to rejoin the life of the sea again.  \r<br />\r<br />TLM has lost everything.... Betrayed by her &#34;true love&#34; and Banished from the Sea by her father, her heart could not bear to live out the rest of her long life with such pain.  So she summons the Sea Witch and trades her hair like her sisters had done, but TLM trades it for an end to the pain.  Her heart has become as cold and hard as stone, she has become a ruthless bringer of Death.  Ariel has become so vicious that Death itself has adopted her and made her one of His own.  [/size][size=3][size=3]She is not part of the Dark Brotherhood.  Sithis is but a Daedric Lord.  Ariel is the Daughter of Death itself.  [/size][/size][size=3][size=3]\r<br />[/size][/size]",
  "categoryId": "96",
  "version": "2",
  "author": "Meggan0401",
  "createdUnix": "1461546955",
  "updatedUnix": "1461871273",
  "containsAdultContent": false,
  "uploadedBy": "Meggan0401",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000204246",
      "name": "Ariel Daughter of the Sky CBBE",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "78019",
      "fileName": "Ariel Daughter of the Sky CBBE-75184-1.rar",
      "uploadedUnix": "1461545812",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f0531c52d359f28bfb4d996665cc930053a2d85abdb0412d94236e00b8954e9a/analysis/1461545893/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20the%20Sky%20CBBE-75184-1.rar?fid=1000204246&ttl=1535863958&ri=8192&rs=8192&setec=ecddd3c5d2db40125ed3ad23a22e4357"
    },
    {
      "fileId": "1000204247",
      "name": "Ariel Daughter of the Sky Alternate ESP CBBE",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ariel Daughter of the Sky Alternate ESP-75184-1.rar",
      "uploadedUnix": "1461545952",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/4dd0e85c08213a9e819b225e6602b36a9533b632c331780c743f1d4a9052a2b5/analysis/1461546003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20the%20Sky%20Alternate%20ESP-75184-1.rar?fid=1000204247&ttl=1535863958&ri=8192&rs=8192&setec=6ca5e262afd0016d8928c671c87fa80b"
    },
    {
      "fileId": "1000204248",
      "name": "Ariel Daughter of Death CBBE",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "75551",
      "fileName": "Ariel Daughter of Death CBBE-75184-1.rar",
      "uploadedUnix": "1461546162",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6384e240856a1bf822acbe33153395cccf18aea25ef610cc3b5fe54ba830b769/analysis/1461546192/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Death%20CBBE-75184-1.rar?fid=1000204248&ttl=1535863959&ri=8192&rs=8192&setec=5bc9d015c18261f310b6269bd7777420"
    },
    {
      "fileId": "1000204251",
      "name": "Ariel Daughter of Death UNP",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "29163",
      "fileName": "Ariel Daughter of Death UNP-75184-1.rar",
      "uploadedUnix": "1461546772",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/86b8bc257799884c8f7d468a8b2da284bb6e70cbe432427b9dc1d345659f34e6/analysis/1461546815/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Death%20UNP-75184-1.rar?fid=1000204251&ttl=1535863959&ri=8192&rs=8192&setec=c75c23a39fec4520e049ede5aefe8ea7"
    },
    {
      "fileId": "1000204341",
      "name": "Ariel Daughter of Sky UNP V1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40243",
      "fileName": "Ariel Daughter of Sky UNP V1.1-75184-1-1.rar",
      "uploadedUnix": "1461617135",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/37ad50fa3e841f3c44fec351646cb0201041b827c220d89c285f13cc2634ad53/analysis/1461617170/",
      "changelogHtml": " UNP Only.  Deleted extra eye parts.  <br/> \n Added SKSE nif and dds files used to create follower.  I&#39;ve done all I can from my end.  Sometimes files just don&#39;t read correctly.  If that happens to you, you have to make the nif Merge yourself. Will require SKSE and NifMerge here on the Nexus. <br/> \n Transparent Hair fix for ENB users.  CBBE body only.  UNP will be added tomorrow.  Changed Shader Flags 1 and 2.  Added/ &#34;Reinforced&#34; color and textures to custom colored hair.  Let me know if this does not work for your ENB. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Sky%20UNP%20V1.1-75184-1-1.rar?fid=1000204341&ttl=1535863960&ri=8192&rs=8192&setec=fb17147745432cf89764dc5c57b5c470"
    },
    {
      "fileId": "1000204342",
      "name": "Ariel Daughter of Sky Alternate ESP UNP V1.1",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ariel Daughter of Sky UNP Alternate ESP V1.1-75184-.rar",
      "uploadedUnix": "1461617276",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3a6852a64d12f9f4d098f6b524ebb06dbf679fbb3e8ff0f4a808f5901979ac16/analysis/1461617282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Sky%20UNP%20Alternate%20ESP%20V1.1-75184-.rar?fid=1000204342&ttl=1535863960&ri=8192&rs=8192&setec=1c5e0fb11b2f3cf0a6800e768a704e3e"
    },
    {
      "fileId": "1000204692",
      "name": "Ariel Daughter of Sky CBBE",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "78717",
      "fileName": "Ariel Daughter of Sky CBBE-75184-2.rar",
      "uploadedUnix": "1461870614",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/25fd4164333b546378f56f7dd8734119fca5ff251a6cbbc882c500ae82018a05/analysis/1461870673/",
      "changelogHtml": " Daughter of Death both UNP and CBBE: Changed Texture Paths so downloading both Daughters of the same body type will not interfere with eachother. <br/> \n Changed Hair BSLightShaderFor all files: Changed Hair and Hairline Property, Shader Flags 1 and 2.  Removed SLSF1_Vertex_Alpha.  Removed SLSF2_Assume_Shadowmask <br/> \n For all files: Changed Hair and Hairline NiAlphaPropeity, changed flags: Alpha Test Function-&gt;Greater or Equal, Threshold -&gt; 70  <br/> \n Reduced Armor Ratings: Chest 15, Boots and Bracers 4.   <br/> \n Increased Health, Magicka, Stamina to 500 and Stats that effect each follower to 100, depending on what that follower uses.  No more weaklings. <br/> \n Daughter of Sky both UNP and CBBE: Changed Combat Type to DraugerBoss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Sky%20CBBE-75184-2.rar?fid=1000204692&ttl=1535863960&ri=8192&rs=8192&setec=4871c115d6ae49a90e1b25ecfb2c4056"
    },
    {
      "fileId": "1000204693",
      "name": "Ariel Daughter of Sky DLC ESP CBBE",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ariel Daughter of Sky DLC ESP CBBE-75184-2.rar",
      "uploadedUnix": "1461870712",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/7a43055c6ab4b7b4e568ed672fbbeeaa5a4f5b21c8738030aab0e1b99950bc80/analysis/1461870724/",
      "changelogHtml": " Daughter of Death both UNP and CBBE: Changed Texture Paths so downloading both Daughters of the same body type will not interfere with eachother. <br/> \n Changed Hair BSLightShaderFor all files: Changed Hair and Hairline Property, Shader Flags 1 and 2.  Removed SLSF1_Vertex_Alpha.  Removed SLSF2_Assume_Shadowmask <br/> \n For all files: Changed Hair and Hairline NiAlphaPropeity, changed flags: Alpha Test Function-&gt;Greater or Equal, Threshold -&gt; 70  <br/> \n Reduced Armor Ratings: Chest 15, Boots and Bracers 4.   <br/> \n Increased Health, Magicka, Stamina to 500 and Stats that effect each follower to 100, depending on what that follower uses.  No more weaklings. <br/> \n Daughter of Sky both UNP and CBBE: Changed Combat Type to DraugerBoss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Sky%20DLC%20ESP%20CBBE-75184-2.rar?fid=1000204693&ttl=1535863961&ri=8192&rs=8192&setec=6be1c70f1806f1a811dfbeb94a63f44f"
    },
    {
      "fileId": "1000204694",
      "name": "Ariel Daughter of Sky UNP",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32816",
      "fileName": "Ariel Daughter of Sky UNP-75184-2.rar",
      "uploadedUnix": "1461870841",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/ff22176e26de996e06ae04c91680ad0682c5ecb599c457246ccf82d7b50c40c9/analysis/1461870908/",
      "changelogHtml": " Daughter of Death both UNP and CBBE: Changed Texture Paths so downloading both Daughters of the same body type will not interfere with eachother. <br/> \n Changed Hair BSLightShaderFor all files: Changed Hair and Hairline Property, Shader Flags 1 and 2.  Removed SLSF1_Vertex_Alpha.  Removed SLSF2_Assume_Shadowmask <br/> \n For all files: Changed Hair and Hairline NiAlphaPropeity, changed flags: Alpha Test Function-&gt;Greater or Equal, Threshold -&gt; 70  <br/> \n Reduced Armor Ratings: Chest 15, Boots and Bracers 4.   <br/> \n Increased Health, Magicka, Stamina to 500 and Stats that effect each follower to 100, depending on what that follower uses.  No more weaklings. <br/> \n Daughter of Sky both UNP and CBBE: Changed Combat Type to DraugerBoss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Sky%20UNP-75184-2.rar?fid=1000204694&ttl=1535863962&ri=8192&rs=8192&setec=8c5390abf5a1308254f96128a830e3d3"
    },
    {
      "fileId": "1000204695",
      "name": "Ariel Daughter of Sky Alternate ESP DLC UNP",
      "version": "2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "8",
      "fileName": "Ariel Daughter of Sky Alternate ESP DLC UNP-75184-2.rar",
      "uploadedUnix": "1461870948",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/6e08d9f78803bf4986c15c578f0248ebd3f9aa7fc8573311357f497d17c92a9c/analysis/1461870962/",
      "changelogHtml": " Daughter of Death both UNP and CBBE: Changed Texture Paths so downloading both Daughters of the same body type will not interfere with eachother. <br/> \n Changed Hair BSLightShaderFor all files: Changed Hair and Hairline Property, Shader Flags 1 and 2.  Removed SLSF1_Vertex_Alpha.  Removed SLSF2_Assume_Shadowmask <br/> \n For all files: Changed Hair and Hairline NiAlphaPropeity, changed flags: Alpha Test Function-&gt;Greater or Equal, Threshold -&gt; 70  <br/> \n Reduced Armor Ratings: Chest 15, Boots and Bracers 4.   <br/> \n Increased Health, Magicka, Stamina to 500 and Stats that effect each follower to 100, depending on what that follower uses.  No more weaklings. <br/> \n Daughter of Sky both UNP and CBBE: Changed Combat Type to DraugerBoss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Sky%20Alternate%20ESP%20DLC%20UNP-75184-2.rar?fid=1000204695&ttl=1535863962&ri=8192&rs=8192&setec=1cb1870648ffe608043821cd33eae563"
    },
    {
      "fileId": "1000204697",
      "name": "Ariel Daughter of Death CBBE",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "76247",
      "fileName": "Ariel Daughter of Death CBBE-75184-2.rar",
      "uploadedUnix": "1461871155",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/b8a9a8dd292917b8d120f42c906222e31f343355dc23b5a43d2ba88623f96a25/analysis/1461871212/",
      "changelogHtml": " Daughter of Death both UNP and CBBE: Changed Texture Paths so downloading both Daughters of the same body type will not interfere with eachother. <br/> \n Changed Hair BSLightShaderFor all files: Changed Hair and Hairline Property, Shader Flags 1 and 2.  Removed SLSF1_Vertex_Alpha.  Removed SLSF2_Assume_Shadowmask <br/> \n For all files: Changed Hair and Hairline NiAlphaPropeity, changed flags: Alpha Test Function-&gt;Greater or Equal, Threshold -&gt; 70  <br/> \n Reduced Armor Ratings: Chest 15, Boots and Bracers 4.   <br/> \n Increased Health, Magicka, Stamina to 500 and Stats that effect each follower to 100, depending on what that follower uses.  No more weaklings. <br/> \n Daughter of Sky both UNP and CBBE: Changed Combat Type to DraugerBoss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Death%20CBBE-75184-2.rar?fid=1000204697&ttl=1535863963&ri=8192&rs=8192&setec=b3b27dbe3f01da80a6ba8ed1e331ab17"
    },
    {
      "fileId": "1000204698",
      "name": "Ariel Daughter of Death UNP",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "30288",
      "fileName": "Ariel Daughter of Death UNP-75184-2.rar",
      "uploadedUnix": "1461871273",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/721627eaf7b484f513f8089b4cf1f5c3b9cc103cd1444343f74788160cad0594/analysis/1461871328/",
      "changelogHtml": " Daughter of Death both UNP and CBBE: Changed Texture Paths so downloading both Daughters of the same body type will not interfere with eachother. <br/> \n Changed Hair BSLightShaderFor all files: Changed Hair and Hairline Property, Shader Flags 1 and 2.  Removed SLSF1_Vertex_Alpha.  Removed SLSF2_Assume_Shadowmask <br/> \n For all files: Changed Hair and Hairline NiAlphaPropeity, changed flags: Alpha Test Function-&gt;Greater or Equal, Threshold -&gt; 70  <br/> \n Reduced Armor Ratings: Chest 15, Boots and Bracers 4.   <br/> \n Increased Health, Magicka, Stamina to 500 and Stats that effect each follower to 100, depending on what that follower uses.  No more weaklings. <br/> \n Daughter of Sky both UNP and CBBE: Changed Combat Type to DraugerBoss <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ariel%20Daughter%20of%20Death%20UNP-75184-2.rar?fid=1000204698&ttl=1535863963&ri=8192&rs=8192&setec=c5375dea27ac9ff53871c8b11fcdf3e3"
    }
  ]
}