{
  "modId": 7521.0,
  "modName": "Ethereal - Weapons",
  "summary": "(Re)modeled from scratch Weapons from various sets eg; Daedric and Dragonbone",
  "descriptionHtml": "UPDATE 4/2/12: I just got my hands on Max 2012 which is... Awesome. Just Awesome.\r\nSo I ended up nearly redoing the weapons (didn\\'t take long realy as I had the design already).\r\n\r\nAlso, I\\'ve cut down the poly count Alot. To give you an idea: The Dragonbone Longsword was around.. 50000 Polys Bahahahaa. Now its 3252 Poly, Massive change. If you have no idea what that means then I will clarify in a basic way: The more poly\\'s an object has the more thinking your PC will do to render the object on screen. So lower is better.\r\n\r\nThe reason for the high poly models I did previous is that I like to nail down a design first before refining it. So, 50000 poly models are not uncommon. If anything that is small compared to most of the stuff I make.\r\n\r\nSo anyway, what I might do soon is release at least one of the weapons. Just as a gift for waiting. Hope it is liked.\r\n\r\nRANT:\r\nIt has been a long time since I uploaded anything. I\\'ve done the whole retexture thang now I have delved into 3D.\r\n\r\nThis is a WIP, I don\\'t have as much time on my hands as I did back when I made Ethereal Eyes and the Imperial armor (as seen in OOO)\r\n\r\nINFO:\r\nThis little project focuses on remodeling or just plain modeling (Eg Dragon Bone) various weapons in skyrim. Right now I\\'m focusing on Dragon bone and Daedric, but, I\\'ll likely move onto other types. I\\'m generaly remodeling weapons that I\\'m not happy with. I never liked the Daedric swords for example. And the lack of Dragon Bone weapons always bugged me. so thats where I\\'ve started.\r\n\r\nAll of these models and textures are done from scratch. And the ones in the Images wont nessisarily be the ones that end up in the mod. I\\'m only starting out with modeling. I\\'ve only ever dabbled. So bare with me.\r\n\r\n\r\nStay Tuned.",
  "categoryId": "36",
  "version": "0.0",
  "author": "DagothBalls",
  "createdUnix": "1328062309",
  "updatedUnix": "1328062309",
  "containsAdultContent": false,
  "uploadedBy": "DagothBalls",
  "primaryFile": null,
  "files": []
}