{
  "modId": 75221.0,
  "modName": "new-enchantments",
  "summary": "This mod adds 56 new item enchantments to the game.\r<br />mod by Carrier of Echoes",
  "descriptionHtml": "This mod adds 56 new item enchantments to the game. \r<br />\r<br />Disenchantable items carrying the new enchantments are added to levelled lists, so they will show up in loot and in merchant inventories. \r<br />\r<br />The enchantments should be fairly balanced, but the gold value of the items might not be very consistent. \r<br />\r<br />Many of the new enchantments grant perks from the skill trees while the item is worn - so you may get access to some of the more fun high-level perks much earlier (and yes - wearing an item which grants a Perk DOES count as having that Perk, for the purposes of getting Perks which depend on it&#33;) \r<br />\r<br />Q/A---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Q. what if you have a mod that changes a perk? will the enchantment give you said replacer or will it act like normal/not at all?\r<br />\r<br />A. Depends how the other mod is implemented. If it directly makes changes to the perk in the base game, then the perk given by the item will be affected too. However if it actually adds a new perk and inserts that into the skill tree (perhaps being named the same as the one in the base game and replacing it in the skill tree, so that it looks to the player like the perk has been changed directly), then the enchantment will give you the original perk from the base game, not the changed one.\r<br />\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />New Weapon Enchantments: \r<br />\r<br />* Weakness to Magic \r<br />* Damage Armor \r<br />* Deny Magicka \r<br />* Deny Stamina \r<br />* Drain Unarmed \r<br />* Drain Melee Skill \r<br />\r<br />New Armor Enchantments: \r<br />\r<br />* Reflect Damage - Reflects a percentage of melee damage \r<br />* Spell Absorb - % chance to absorb magic attacks \r<br />* Fortify Alteration Strength - Increases the power of Alteration spells \r<br />* Fortify Conjuration Strength - Increases the duration of Conjuration spells \r<br />* Fortify Destruction Strength - Increases the power of Destruction spells \r<br />* Fortify Restoration Strength - Increases the power of Restoration spells \r<br />* Fortify Illusion Strength - Increases the power of Illusion spells \r<br />* Weapon Speed - Increases weapon swing speed. Note that the amount doesn&#39;t depend on Enchantment skill or perks, due to a quirk of the engine - so you might as well use petty souls to make this one, just like Waterbreathing. \r<br />* Eagle Eye - Grants the Eagle Eye perk while the item is worn \r<br />* Steady Hand - Grants the Steady Hand perk while the item is worn \r<br />* Hunter&#39;s Discipline - Grants the Hunter&#39;s Discipline perk while the item is worn \r<br />* Quick Shot - Grants the Quick Shot perk while the item is worn \r<br />* Ranger - Grants the Ranger perk while the item is worn \r<br />* Power Shot - Grants the Power Shot perk while the item is worn \r<br />* Soul Squeezer - Grants the Soul Squeezer perk while the item is worn \r<br />* Soul Siphon - Grants the Soul Siphon perk while the item is worn \r<br />* Perfect Touch - Grants the Perfect Touch perk while the item is worn \r<br />* Treasure Hunter - Grants the Treasure Hunter perk while the item is worn \r<br />* Green Thumb - Grants the Green Thumb perk while the item is worn \r<br />* Poisoned - Grants the Poisoned perk while the item is worn \r<br />* Purity - Grants the Purity perk while the item is worn \r<br />* Light Foot - Grants the Light Foot perk while the item is worn \r<br />* Silence - Grants the Silence perk while the item is worn \r<br />* Backstab - Grants the Backstab perk while the item is worn \r<br />* Deadly Aim - Grants the Deadly Aim perk while the item is worn \r<br />* Merchant - Grants the Merchant perk while the item is worn \r<br />* Intimidation - Grants the Intimidation perk while the item is worn \r<br />* Block Runner - Grants the Block Runner perk while the item is worn \r<br />* Deflect Arrows - Grants the Deflect Arrows perk while the item is worn \r<br />* Conditioning - Grants the Conditioning perk while the item is worn \r<br />* Unhindered - Grants the Unhindered perk while the item is worn \r<br />* Dual Flurry - Grants the Dual Flurry perk while the item is worn \r<br />* Dual Savagery - Grants the Dual Savagery perk while the item is worn \r<br />* Avoid Death - Grants the Avoid Death perk while the item is worn \r<br />* Necromage - Grants the Necromage perk while the item is worn \r<br />* Quiet Casting - Grants the Quiet Casting perk while the item is worn \r<br />* Master of the Mind - Grants the Master of the Mind perk while the item is worn \r<br />* Rune Master - Grants the Rune Master perk while the item is worn \r<br />* Necromancy - Grants the Necromancy perk while the item is worn \r<br />* Dark Souls - Grants the Dark Souls perk while the item is worn \r<br />* Atromancy - Grants the Atromancy perk while the item is worn \r<br />* Elemental Potency - Grants the Elemental Potency perk while the item is worn \r<br />* Twin Souls - Grants the Twin Souls perk while the item is worn \r<br />* Stability - Grants the Stability perk while the item is worn \r<br />* Elemental Protection - Grants the Elemental Protection perk while the item is worn \r<br />* Quick Reflexes - Grants the Quick Reflexes perk while the item is worn \r<br />* Shield Charge - Grants the Shield Charge perk while the item is worn \r<br />* Disarming Bash - Grants the Disarming Bash perk while the item is worn \r<br />* Deadly Bash - Grants the Deadly Bash perk while the item is worn \r<br />* Concentrated Poison - Grants the Concentrated Poison perk while the item is worn \r<br />\r<br />No DLC required.\r<br />mod by Carrier of Echoes",
  "categoryId": "75",
  "version": "",
  "author": "Carrier of Echoes",
  "createdUnix": "1461533347",
  "updatedUnix": "1461533338",
  "containsAdultContent": false,
  "uploadedBy": "ssbbssc",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000204225",
      "name": "new-enchantments.rar",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "new-enchantments.rar-75221-.rar",
      "uploadedUnix": "1461533338",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/012443d191271daea843c48beff5680cffbaa4f183cd170225d658ca0c2a6b90/analysis/1461533345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/new-enchantments.rar-75221-.rar?fid=1000204225&ttl=1535863997&ri=8192&rs=8192&setec=137adcaa3a8b06d5384b04350b8b0cf0"
    }
  ]
}