{
  "modId": 7526.0,
  "modName": "Jorrvaskr Companions are DWARVES",
  "summary": "Jorrvaskr made dwarvern ",
  "descriptionHtml": "       DESCRIPTION!\r\nImages don\\'t satisfy you? Watch the video http://www.youtube.com/watch?v=N2wuFagKXMQ\r\nI thought that i would be kind of cool to have dwarves around you but not everywhere no not that but just in Jorrvaskr. I at first wanted to replace the guards and some people at Markath but I coundn\\'t get the NPCs to work so i went for Jorrvaskr. The Companions still use the skyforge weapons. Some companions may look slightly different but i gave all male members a beard so they look like dwarves. I also shortened the npcs from 1.00 to 0.80 except farkas 0.83, kodlak at 1.00 and eorland at 0.95. I made Farkas a bit taller since hes just a strong guy and kodlak always sits down so i didnt bother, Eorland has some clipping issues if he is small because hes working at the forge. Also other members of companions may clip through chairs and things because their height.\r\nI still tried letting their be little variety by giving Aela and Skjor their default armor but skjor has a dwarven shield now. I am no good with making or replaceing textures/meshes so the building has not changed. I do not know how to merge esps so there are seperate esps in this, sry. =P\r\n\r\n\r\n              BUGS/Problems!\r\nWhen you come in the 1st time to Jorrvaskr Njada Stonearm runs for a weapon to spar Athis with but doesn\\'t use it on him.\r\nI cannot think of any direct mod for incompatibalily isssues but surely any mod changes the Companions\\' equipment won\\'t be comaptible.\r\n\r\n            NOTE!\r\n-Please report bugs in comments because i would like to see them so i can fix them. \r\n-THANKYOU!\r\n-Please rate and comment this is my 1st mod and i want to know what to improve on\r\n-Use this for your own pleasure, \r\n-no need to ask for permissions in for including in your own mods \r\n-Some mods may have \\\\The Elder Scrolls V Skyrim\\\\Data\\\\meshes\\\\actors\\\\character\\\\facegendata\\\\facegeom\\\\skyrim.esm this will replace the NPC\\'s file mesh in their.\r\n-This is no longer based of dwemer but just normal FANTASY DWARVES, theres been so much confusion sry for those who wanted dwemer. I just like shorter beared people with dwemer/dwarvern armour.",
  "categoryId": "33",
  "version": "",
  "author": "Juskin590",
  "createdUnix": "1328067954",
  "updatedUnix": "1328068170",
  "containsAdultContent": false,
  "uploadedBy": "Juskin590",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24804",
      "name": "DWarves return",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1971",
      "fileName": "DWarves return-7526-1.rar",
      "uploadedUnix": "1328068170",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d931c0b1d496d8be9f0827c8b302054fa539024f8fd485c9798ce9a98cf48d3b/analysis/1406647748/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DWarves%20return-7526-1.rar?fid=24804&ttl=1535765637&ri=8192&rs=8192&setec=84ce430104a0cf6da4d03d44fcf63e42"
    }
  ]
}