{
  "modId": 7545.0,
  "modName": "Teeba Ei Phantom of the Marsh True Follower V1_1",
  "summary": "Adds Teeba-Ei, Phantom of the Marsh as an extra follower",
  "descriptionHtml": "Teeba-Ei, the Phantom of the Marsh 1.1\r\n\r\n\r\n-------------------------------------------------------\r\nCHANGELOG\r\n\r\n1.1\r\n\r\n-Reduced HP from 550 to 450 (balance)\r\n-Removed J’zargo’s Flame Cloak (Friendly fire issues even if sifh 1 is set)\r\n-Removed Healing Spell (OP)\r\n-Added increased Combat Regen Multiplier (x5)\r\n-Added Ironflesh Spell\r\n-Added Stability Perk\r\n-Increased speedmult from 120 to 125\r\n\r\n-------------------------------------------------------\r\nDISCLAIMER\r\n\r\nYou are given freedom to use and edit the bat file as you see fit, however the author asks for honesty in using the bat file as intended, and appreciates you for doing so.\r\n\r\n“Cheating is a sad, sad way to win the game”\r\n- Ma’iq the Liar\r\n----------------------------------------------------------\r\n\r\nStory\r\n\r\n“Greater things were dreamt of”\r\n-Teeba, before the coming of Alduin\r\n\r\nThe Argonians are a mysterious race, best known as freed-slaves of the once mighty Dunmer Principalities of Morrowind. With their conquest of their fallen masters successful and the desolated Morrowind offer little opportunities even for this hardy race. They instead scattered with the four winds of Tamriel, some making their way up to Skyrim. Few of their kind rarely venture out into this cold country of man, and even fewer are those offered equal terms of a new life. For the surviving sojourners of their race could only look up to the skies of Skyrim through the shaft that their lives depend on – for the labor of the mines could only go deeper and harder as the day goes by, and the war a whisper in the dark.\r\n\r\nThe coming of the Dragon, Alduin heralds the doom of Tamriel. But for Teeba-Ei, Alduin’s coming is meaningless if at his prime he wastes himself away in constant labor, hoping that the debts he incurred from a betrayal of a friend would be paid with blood and tears working in Rockwallow Mine. He is different than the rest of the Argonians he encountered in Skyrim, for he was born as a Shadowscale, destined to be inducted into the Brotherhood at a certain age. But his training for that event fell abrupt when the entire order of the Shadowscales mysteriously vanished. Devoid of purpose, he volunteered to fight a Great War against the Dunmer Principalities of Morrowind. But whatever he could’ve done more after the war is only something he could only dream of, until now.\r\n\r\nFor within his heart burns a sensation, deeper than emotions themselves. It is a calling that haunts his dreams underneath the icy depths of Skyrim’s pits, warmth that beckons him to chase the fragments of light from beyond the dark corners of Rockwallow Mine, a fire that burns his pride to shame – and aspire to reclaim it once more. \r\n\r\nThe Dovakhin, so the traveler declared itself, the Dragonborn, destined to destroy the destroyer of worlds. Is it too good to be true? Teeba-Ei doubts such chances coming in such a remote and hostile region in Skyrim. But there can only be one chance for the dovahkin is always on the move, always on the hunt, always on the lookout to the skies, and Teeba-Ei, having dreamt of such visions of light, warmth and fire could not believe to have dragged himself out of the mines and behind the Dovahkin, ready to reclaim the glory of his days as the Phantom of Mer, the Shadow of Morrowind.\r\n\r\n“Whatever shadows our skies will find that the ground overshadows them.”\r\n-Teeba, after pledging allegiance to The Dragonborn\r\n----------------------------------------\r\n\r\nFollower stats\r\n\r\nLevel 50 Argonian 2h Warrior\r\nHealth: 450\r\nMagicka: 250\r\nStamina: 100\r\n\r\nPrimary Skills\r\nTwo-Handed 100\r\nAlteration 70\r\n\r\nSecondary Skills\r\nHeavy Armor 40\r\nRestoration 20\r\n\r\nAbilities\r\n\r\nBloodlust\r\nPassive/Active\r\nProlonged exposure to the Hist Tree grants Teeba-Ei increased battle-prowess\r\nPassive\r\n- 1.2x more damage with weapons (after perks and items)\r\n- 50% more attack speed w/ two handed weapons\r\n- Increased Combat Health Regen (x5 than normal)\r\nActive\r\n- Berserk Ability\r\n\r\nPhantom of Morrowind\r\nPassive/Active\r\nTeeba-Ei moves swiftly and can bend light at will to confuse his enemies.\r\nPassive\r\n-25% move speed (using 100 base from vanilla followers)\r\nActive\r\n-Special Invisibility Spell (AI will use this to remove aggro, best used w/ unlimited followers)\r\n\r\nBane of the Dunmer\r\nPassive\r\nTeeba’s experience fighting the Dunmer allowed his skin to temper, granting Fire Resistance. Additionally, he has learned to apply his experience to cast a protection spell around him.\r\nPassive\r\n - 75% Fire Resistance\r\nActive\r\n- IronFlesh Spell\r\n\r\nFlametongue\r\nUltimate\r\nKnowledge of Dunmer Magic and experience fighting dragons allows Teeba to imitate their Thu’um, allowing him to breathe fire at his enemies.\r\n- Fire Breath\r\n---------------------------------------------------------------------------\r\n\r\nInstallation\r\n\r\n1. Extract Teeba.esp to your Skyrim/Data Folder, and teeba.txt to you Skyrim folder.\r\n2. Activate the mod using the NMM or any mod management tool.\r\n3. Travel/Fast Travel to Rockwallow Mine and look for Teeba-Ei.\r\n4. Using the console click teeba and type “resurrect”\r\n5. After Teeba fades in/out, using the console type “bat teeba”\r\n6. Congratulations, you now have a Teeba as a permanent Follower w/ dialogue!\r\n\r\n---------------------------------------------------------------------------\r\n\r\nUninstallation\r\n\r\n1. Disable before Deleting teeba.esp and teeba.txt from your directories.\r\n2. Load the game; Teeba should return to his sandbox AI after fasttravel.\r\n\r\n----------------------------------------------------------------------------\r\n\r\nFAQ\r\n\r\n1. What is the concept behind your Follower Mods?\r\n\r\nThe idea is to provide an alternative extra follower mod for the community that has depth of character, akin to those we experienced playing Baldur’s Gate series. The truth is Vanilla followers are dull, having only basic spells/AI.\r\n\r\n Each of my Followers has an assorted selection of spells and abilities that fit their overall theme. For example, Teeba-Ei is a veteran of the Argonian Invasion of Morrowwind, as such his skills should reflect what he could’ve encountered and experienced fighting the Dunmer as well as describing him to be a Shadowscale-born Argonian to validate the concept of a “Phase-Dragon” warrior.\r\n\r\nThis isn’t balanced for vanilla gameplay, infact, this encourages you to install difficulty mods such as Wars in Skyrim, Deadly Dragons, PiSE and duel mods and design my followers with character to survive a little longer in a dark-age setting of Skyrim.\r\n\r\n2. Uhmm… What’s a Phase-Dragon?\r\n\r\nI planned the original Phasing concept to Mena Nightgale, but unfortunately aside from the fact that she is prone to the annoying “fast travel bug” (as well as Daighre unfortunately), she doesn’t seem to be able to use the invisibility spells as I want her to use it, no matter what combat AI I set her to use except when she is at a very low health and fleeing from combat, much like those vampires are doing. I imagine a Nightgale fading in-and-out of combat to capitalize on the sneak attacks but oh well, I hope we can do that once the CK comes out.\r\n\r\nThe irony is that I accidentally put Mena’s bat config to Teeba-Ei, who I originally designed as a DPS-brawler that uses fists (LOL) and has craptons of regen (fail, since the troll/werewolf abilities doesn’t work for them) and I discover that Teeba was using it in combat at 60% health to reposition himself (and unintentionally drawing more aggro to Lydia who I modified to be a good tank) and realized it’s a good concept to play around with: A shadow wielding Barbarian Lizard/dragon/dovahkin!\r\n\r\n3. Teeba-Ei’s teleport spell is loud and annoying! Please make it stop?\r\n\r\nHe must’ve been in a tight spot to spam it like that. The AI assigned to Teeba will only use it during the following scenarios:\r\n\r\n - teleport + fire shout is usually done when teeba has a healthy state\r\n- teleport spam is usually happening when he gets mobbed.\r\n- teleport spam + heal, nothing I can do, the AI has no way of dynamically using spells ATM.\r\n\r\nYou should be more worried of your group tactics and how you gear your followers than making a nice feature disabled &#61514;\r\n\r\n4. So why bother using him then?\r\n\r\nIf you reread his skillset, you will find that he is now a glass-cannon DPS machine that works great against mobs, which you will encounter a lot if you install the Dark-Age version of Wars in Skyrim. His modified attack speed and damage multipliers makes him perfect for a role as a burst DPS against bosses as well as penetrate the armor/health of Dragons modified by Deadly Dragons without much affecting or trivializing the difficulty. \r\n\r\n5. I like your followers, do you plan on releasing more soon before/after the CK comes out?\r\n\r\nI will continue doing “Followers with Character” mods for the community up until KoA arrives in March, or I find there are better people making more complex mods that share my ideas. I have released an overpowered Fultheim in Nexus, which I will review once the CK is out. For now he is available to download regardless.\r\n\r\nI have also released Daighre Draconis, who is a Pyromancer and I will be releasing shortly an experimental Alternative to Ysolda, as a mage w/ a twist!\r\n\r\n So with support and much appreciated downloading of my mod, I will continue to tweak and study Foretrenty’s NPC Editor and learn from Jet4571 so that I can make more complex and dynamic followers with character for you to play with in Skyrim!\r\n\r\n---------------------------------------------------------------\r\n\r\nKnown Issues\r\n\r\n- Teeba can sometimes go \\\"berserk\\\" when you cast rally/courage spell at him. This is intended for flavor, just let him cower if he gets into low-health-run state during dragon fights he\\'ll be back in action when he recuperates at full health.\r\n\r\n- He friendly fires! watch out! :)\r\n\r\n-------------------------------------------------------\r\n\r\nCREDITS\r\n\r\nForetrenty, creator of Skyrim NPC Editor\r\nJet4571, for the amazing unlimited follower mod tutorial and the extended support you are providing for simple modders like me!\r\n\r\n-------------------------------------------------------------\r\n\r\nWANT MORE FRIENDS FOR TEEBA?\r\n\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7413 < Daighre Draconis, the Pyromancer\r\n",
  "categoryId": "66",
  "version": "1.0",
  "author": "miniminionette",
  "createdUnix": "1328091599",
  "updatedUnix": "1328120989",
  "containsAdultContent": false,
  "uploadedBy": "miniminionette",
  "primaryFile": null,
  "files": [
    {
      "fileId": "24883",
      "name": "Teeba Ei 1_0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Teeba Ei 1_0-7545.rar",
      "uploadedUnix": "1328091646",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/71656d36faff51be39cc92ecca105f6a2215d88e4d22022b03a428a351fd801d/analysis/1406648105/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teeba%20Ei%201_0-7545.rar?fid=24883&ttl=1535765664&ri=8192&rs=8192&setec=78e8545f78befc2fa97ed617fb87a052"
    },
    {
      "fileId": "25013",
      "name": "Teeba Ei 1_1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "2",
      "fileName": "Teeba Ei 1_1-7545.rar",
      "uploadedUnix": "1328120989",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/31ed7d436c3e4148dbbd3be45996a3f7d7c8a4c8a4ec0fb89d53620fa57e7097/analysis/1406648852/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teeba%20Ei%201_1-7545.rar?fid=25013&ttl=1535765665&ri=8192&rs=8192&setec=ae5fcf4773d75414d30c6f482a12ab7c"
    }
  ]
}