{
  "modId": 7554.0,
  "modName": "Better Followers",
  "summary": "Fixes, inventory changes, &#34;Specialized Followers&#34; included, optional essential, lvlcap 100, more spells and perks for your followers, optional appearance changes. Female Stance for Female Companions, new armor, lore friendly, NMM or Manual, Class edits, Dual Wield and and and.",
  "descriptionHtml": "Note: As you may have noticed, I haven&#39;t had time to play or mod since a couple of months. Due to my work overwhelming me and my phd-thesis coming to an end, time is scarce and I do have to lay down my plans for my mods here. Nevertheless I hope you enjoy them. Sincerely, Uto\r<br />[center]\r<br />[img]http://static-8.nexusmods.com/15/images/110/1089738-1329139533.jpg[/img][/center]\r<br />[right][font=Impact][size=5][color=66BBFF]Thank you all for the endorsements&#33;[/color][/size][/font][/right]\r<br />\r<br />\r<br />[center][img]http://static-8.nexusmods.com/15/images/110/1089738-1333470102.png[/img][/center] \r<br />\r<br />Did you ever notice that Falkas has a two handed sword, although he can wield one handed swords better? And why isn&#39;t he wearing a companions armor? Or his brother, Vilkas, is a master in 2h weapons and his default equipment only gives him a 1h sword? Or why do orks have a lousy armor, although they have great smiths and mines in their villages?\r<br />\r<br />This mod aims to make followers better and more lore friendly. \r<br />\r<br />[center][/center]\r<br />\r<br />[list][*][color=66BBFF][b]Stat tweaks, new perks and new spells[/b][/color] corresponding to the lore of each and every character. Included ist the [color=66BBFF][b]Light Step Perk[/b][/color] for every follower, which prevents them triggering traps IF you&#39;re sneaking. I just hate it, you&#39;re going into a dungeon notice all traps and avoid them. And suddenly behind you, you can hear &gt;&gt;BOOM&#33;&lt;&lt;, &gt;&gt;KAWANG&#33;&lt;&lt;, &gt;&gt;UHG&#33;&lt;&lt;, etc. Nope. I&#39;m just one of those players, that doesn&#39;t want to stand around commanding my followers where to step next. In real life I just could point to trap and my follower would know not to step on it. And if I command them around, they will walk into the trap anyway... So, this was the first mod, that fixes that.[*][color=66BBFF][b]Dual Wield[/b][/color] for some classes. If the follower is provident in 2H weapons or is a magic user, he or she won&#39;t dualwield. Why? Well, think about it. ^^[*]An optional tweaked [color=66BBFF][b]Specialized Followers[/b][/color] from sushisquid [*][color=66BBFF][b]Classes[/b][/color] have been modified for better follower progression, consistancy, and where needed, new classes were added. I highly suggest using Better Followers with a mod, that levels follower skills appropriatly.[*][color=66BBFF][b]Inventory tweaks[/b][/color]. New Armor in Specialized Beauty Version for Annekke, Argis, Areana, Benor, Eola, Erandur, Erik, Iona, Jenassa, Jordis, Ghorbash, Golldir, Kharjo and Stenvar. If you want these armors in a different version, or altogether anyway, scroll down to the bottom of this page and follow the links. (These are work from others, and can&#39;t be accessed, sorry.)[*]All followers are either [color=66BBFF][b]Protected[/b][/color] (like essential) or you can choose Vanilla Settings (NP).[*]All followers level with you up to [color=66BBFF][b]level 100[/b][/color]. Or at least 81, since that&#39;s the default max. ;P[*][color=66BBFF][b]Followers get out of the way [/b][/color] a lot faster.[*][color=66BBFF][b]Sleeping Ai[/b][/color] for Housecarls.[*][color=66BBFF][b]Hunting Bow Fix[/b][/color].[*][color=66BBFF][b]Illia Rehire Fix[/b][/color] and she&#39;s marriagable.[*][color=66BBFF][b]Females have an appropriate stance[/b][/color] (not so hulky anymore).[*][color=66BBFF][b]Optional Beauty Versions[/b][/color]. ALL BODY MODS AND SKIN TEXTURES COMPATIBLE. I would go so far and tell you to download some if you haven&#39;t already.... Concerning non-beauty versions: They are Vanilla.[*][color=66BBFF][b]Optional Hairstyles[/b][/color]. FULL COMPABILITY with other hair mods. That was a lot of work. You will also be able to choose these&#33;&#33;&#33;[*][color=66BBFF][b]Faction NPCs edited[/b][/color] - optional. These factions are covered: Marriage Faction, Thievesguild, College of Wintherhold, Dark Brotherhood, Companions.[*][s][color=lightblue][b]Lydia Marriage Fix[/b][/color][/s]. Obsolete with patch 1.5[*]BOSS Support. I highly recommend for you to get BOSS. Load order is always important, esp. for newbies.[/list]\r<br />[center][color=lightblue][b]TO SEE THE PROGRESS/UPDATES OF BETTER FOLLOWERS LOOK AT THE LAST TAB (READ ME) ON THIS PAGE.[/b][/color][/center]\r<br />\r<br />[color=66BBFF][size=5][font=impact]Things to do[/font][/size][/color]\r<br />- Stuff that comes along the way.\r<br />\r<br />\r<br />[center][img]http://static-6.nexusmods.com/15/images/110/1089738-1333469981.png[/img][/center]\r<br />[list][*]Naked followers. [b]But:[/b] since I&#39;m changing some followers default equipment (e.g. Housecarl) it seems you can actually undress your follower, so they actually run around naked, after taking their equipment. Confirmed.[*]A better AI. This goes with Vanilla. BUT (sic&#33;) this mod should be compatible with AI Mods (like PISE, WARS IN SKYRIM, ETC). And yes, it sucks that followers don&#39;t heal you. I implemented spells like Healing Other, Grand Healing, etc. so that when somebody submits a good functioning Follower AI, your teammates (mainly the ones using magic) will be able to heal you. [*]Better follower stories with evolving friendship or the follower leaving. THIS IS what I miss in Skyrim. You do one lousy quest, and your followers are devoted to you for life. Since I can&#39;t provide help with exactly this problem (it is one), I at least try to give every follower a bit of flavour.[*]All marriagable non-Follower-NPCS to become Followers. Not gonna happen. (Use a different mod, if you want that)[/list]\r<br />\r<br />\r<br />[center][img]http://static-7.nexusmods.com/15/images/110/1089738-1333470382.png[/img][/center]\r<br />\r<br />For all:\r<br />- Skyrim.esm\r<br />- Update.esm\r<br />-&gt; If those two aren&#39;t checked, your game will crash.\r<br />\r<br />Not required but [b][color=FF6600#]HIGHLY RECOMMENDED[/color][/b]: \r<br />[list][*][size=2][url=http://skyrim.nexusmods.com/downloads/file.php?id=19]Unofficial Skyrim Patch[/url][/size] - get the BSA Version to have the best compability with all mods.[*][size=2][url=http://skyrim.nexusmods.com/downloads/file.php?id=14228]Big Dialogue Overhaul[/url][/size] - this mod is a dialogue compilation of Ask Follower Skills, CM Follower Levelup, Followers can Relax and Better Followers - Dialogue. Be sure to deactivate these mods if you&#39;re gonna use it.[/list]\r<br />\r<br />[color=66BBFF][size=5][font=impact]Installiaton[/font][/size][/color]\r<br />\r<br />[b]For the Regular &#39;Vanilla&#39; Version (no appearance changes):[/b]\r<br />\r<br />- Check any Non-Beauty or Non-Specialized Version in NMM or just drop non-beauty esp into Data&#92;\r<br />\r<br />[b]For the Beauty Version:[/b]\r<br />\r<br />- Check any Beauty Version in NMM. \r<br />\r<br />[b]For the Specialized Version[/b]\r<br />\r<br />- If you have Specialized Followers installed, delete it. Everything from sushisquid included. If specialized powers are &#34;faulty&#34;, that is most likely an issue of the original mod.\r<br />- If you choose any Specialized Beauty version you need Better Followers - Armor Pack I & II.\r<br />- Choose one version of &#34;Better Followers - S&#34; from the fomod.\r<br />\r<br />[b]Faction Pack[/b] - a beauty overhaul.\r<br />\r<br />- First you NEED to install a Beauty option in NMM. THEN it will show up. Just tick the box.\r<br />- You NEED to also install the Armor Pack II for the CBBE version. Not sure if it works with other body replacers... The new armors will only affect the female Thievesguild, Expert and Master Sorceresses from the Winterhold College. \r<br />\r<br />For Manual Installation or for viewing changes refer to the included Readme or to the Readme on this site (last tab; that&#39;s on the same line you choose images and comments) \r<br />\r<br />[color=66BBFF][size=5][font=impact]Uninstalliaton[/font][/size][/color]\r<br />\r<br />Regular Vanilla Versions:\r<br />- delete the esp.\r<br />\r<br />For Beauty Versions:\r<br />- delete the esp and the folder &#34;skyrim.esm&#34; in Data/meshes/actors/characters/facegendata/facegeom and Data/meshes/Better Followers\r<br />- delete folder &#34;Better Followers&#34; in Data/textures/\r<br />\r<br />\r<br />For Specialized Versions:\r<br />- delete perktransformeffectscript.pex and transformationsafetyscript.pex in scripts.\r<br />- delete  perktransformeffectscript.psc and transformationsafetyscript.psc in scripts/source\r<br />- delete esp.\r<br />- search Better Followers in skyrim/data and delete the folders.\r<br />\r<br />\r<br />[center][img]http://static-6.nexusmods.com/15/images/110/1089738-1333471667.png[/img][/center]\r<br />\r<br />[color=FF6600#]First make sure, there is NO OTHER MOD that edits Followers in any way. ANY ESP/ESM will ruin this mod, if it modifies Followers. Yes, appearance changes also. AND again: ANY MOD THAT ALTERS FOLLOWERS WILL MESS UP THINGS[/color]. [b]This mod works 100 %[/b]. Now, after you checked that, continue to read:\r<br />\r<br />[color=66BBFF][size=5][font=impact]Compabilities[/font][/size][/color]\r<br />\r<br />[color=33CC66][b]1. Full Compabilities[/b][/color][list][*]All hairmods: Coolsims, Lovely Hair, Apachii, etc. etc.[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=15524]Amazing Follower Tweaks[/url] - I like this more then UFO. As AFT is our competition I have to say: hats off for now. ;)[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=10675]Ask Follower Skills[/url] works like a charm together.[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=13102]Deadly Dragons Lite[/url][*][url=http://skyrim.nexusmods.com/downloads/file.php?id=9504]Followers can Relax[/url] is also fully compatible[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=11193]Horses for Followers[/url] is now fully compatible[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=12933]Extensible Follower Framework[/url] a good alternative and fully working solution if you want multiple followers.[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=13423]Mighty Dragons 2[/url] - a very, very good alternative for those, that don&#39;t want all the knick knack Deadly Dragons brings along[*][url=http://forums.bethsoft.com/topic/1345602-wiprel-multiple-followers/ ]Multiple Followers[/url].[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=9378]Multiple Marriage[/url] is fully compatible.[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=1269]PISE[/url][*][url=http://skyrim.nexusmods.com/downloads/file.php?id=11370]Spouses Can Live Everywhere[/url][color=33CC66][b]2. Semi Compabilities[/b][/color][*][url=http://skyrim.nexusmods.com/downloads/file.php?id=3829]Deadly Dragons[/url]&#39;  main mod is fully compatible, but not their follower file&#33; If you want essential followers, use the BAT provided here.[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=4020]Move it Dammit[/url] - added an own version of this. If you want the settings from Move it Dammit, make sure it&#39;s loaded AFTER &#34;Better Followers - (x)&#34;[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=6176]Wars in Skyrim[/url] is actually fully compatible, but, since it has so many issues and accidently edits things it doesn&#39;t want to edit, I&#39;ve put it here to semi, just to give you a heads up. Check Troubleshooting point 5 for further info.[*]UFO - place BF below UFO. There have been reports of clothing trouble -&gt; nakedness...[color=33CC66][b]3. Incompabilites[/b][/color][*]Any mod that changes your followers inventory, stats, appearence will be incompatible.[*][b]Fixed Followers Lite[/b] is [u]not compatible[/u]. All of the fixes and more are included in Better Followers. Furthermore, they were already included before.[*][b]Specialized Followers[/b], BUT: it is included in this mod. :D[/list]\r<br />\r<br />[color=66BBFF][size=5][font=impact]Other Questions[/font][/size][/color]\r<br />\r<br />[b][color=33CC66]4. &#34;My follower won&#39;t level correctly&#34;.[/color][/b] \r<br />Basically your savegame overwrites stats and perks. But there is a way around. (For problems with equipment see 3)\r<br />\r<br />If you have an attachment to a certain follower and wish to continue to use them after they have become obsolete, there are [u]two very good ways[/u] to do this:\r<br />\r<br />a) [b]Get[/b] [url=http://skyrim.nexusmods.com/downloads/file.php?id=14228]Big Dialogue Overhaul[/url]\r<br />With this mod you can ask your follower to level up, ask his skills, let them wander and and and...\r<br />\r<br />b) [b]Manual Levelup[/b]:[list][*]Get xx = Loadorder Number (you can see this in NMM or WryeBash). My loadorder suggests &#34;Better Followers - SBNP&#34; has the loadorder number 2A. Now, if I want Ahtar to level up his skills I click on him and type: &#34;Setclass 2A001826&#34;. So right this down&#33;[*]Open ingame the console.[*]Click your follower (so that her/his Id pops up) and write: [b]Setclass &lt;&lt;ClassID&gt;&gt;[/b][*]Close Console. Now go ahead and ask your follower for his skills. :D (As you noticed, you [u]don&#39;t need to disable[/u] anymore&#33;)[*][color=lightblue]The &lt;&lt;ClassID&gt;&gt; can be found in [b]&#34;The Guide to Better Followers&#34;[/b]. Check the download section.[/color] And for those still having issues: In console type: [b]help &#34;Riftwind&#34; 4[/b] =&gt; The first two digits of the number in CLAS is your load order. Now use those for xx. [color=33CC66][b]5. &#34;The NMM says it&#39;s not the current version of the mod.&#34;[/b][/color][*]NMM just gets confused, if there is more than one file availabe on the page. Just be sure, that you downloaded the current version and your fine. When installing with NMM and it pops up saying something like &#34;THIS IS NOT THE CURRENT VERSION. SHOULD NMM DOWNLOAD THE NEWEST VERISON?&#34;. Click: [color=FF6600#][b]No[/b][/color]Do not let NMM install a bogus &#34;new&#34; Version.[*]Or: You didn&#39;t uninstall the previous version &#34;correct&#34;, so that NMM still thinks you have the old version. YOU HAVE TO DELETE MODS VIA NMM, BEFORE YOU DOWNLOAD AND INSTALL. UPGRADING IS QUITE BUGGY WITH NMM AND CAN SHOW WRONG VERSION NUMBERS ALTHOUGH YOU HAVE THE CURRENT NEW VERSION. There is nothing I can do about that.[color=33CC66][b]6. &#34;NMM stops downloading after (x) percent. :/&#34;[/b][/color]This has something to do with your internet browser or with Nexus being overaccessed. If you&#39;re using Google Chrome, that is likely the issue. If not, then it&#39;s just too many people wanting mods. :D[color=33CC66][b]7. &#34;My Companions weapons keep spawning endlessly&#33; XX Follower has like 5000000000 bows&#33;&#34;[/b][/color]That&#39;s a classical vanilla bug. You most likely installed this mod after meeting follower X, eh? Well, you&#39;re savegame overwrites the fix. It says to your game: &#34;Hey, I KNOW THIS WEAPON HAS TO BE THERE. ALWAYS&#33;&#34; and my plugin says &#34;No, no, no, it&#39;s de-equibable...&#34;. And the savegame says to the mod: &#34;You listen, you stupid little mod, Bethesda said I&#39;m in charge, so shut up and make that damn thing to always be there, or else I&#39;ll forget myself&#34;. And so the mod does that, always putting a bow in the inventory of follower X. But this Vanilla bug (it happens in the unmodified game too) isn&#39;t such a common problem. To resolve: Try via console: (a) click follower and write: disable. (b) Then write  enable. Other than that, I can&#39;t help you, since I don&#39;t/can&#39;t/won&#39;t edit savegames.[color=33CC66][b]8. &#34;My Trainers don&#39;t work&#33;&#34; [/b][/color]Yes, they do. At least Better Followers isn&#39;t responsible. If you have Dovahkiin Hideout 0.9.2 installed, that is the mod that causes these issues. If not check other mods.If you need a good alterantive Hideout (I know I do), I&#39;d check out these mods by eldiabs:[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=11803]Deus Mons[/url] - I use this one, it&#39;s a nice allrounder[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=9064]Domus Dementis[/url] - good for mages[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=8197]DragonsReach Hideout[/url] - good for warriors[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=9904]Ranger Ridge[/url] - good for thieves[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=15029]Sleeping Tree Sanctuary[/url][/list]\r<br />\r<br />=&gt; And the best thing: They don&#39;t mess up trainers. :)\r<br />\r<br />[color=33CC66][b]9. &#34;Some Followers (esp. the Mage Guild) are naked.&#34; [/b][/color]\r<br />Do you have Wars in Skyrim installed? If so, there is the culprit. WIS does a lot of stuff - unintentionaly. It can break your savegame, it edits friendly npcs that it actually doesn&#39;t want to edit (causing conflicts), it causes quest to be unsolveable, etc. Don&#39;t get me wrong, I think the idea and work behind it so far is amazing. But I have the feeling it&#39;s still Beta and not 4.4.\r<br />If you don&#39;t have WIS, check if anything else edits the corresponding npcs. Again: DO NOT HAVE ANOTHER MOD INSTALLED THAT EDIT THE SAME NPCS. Because I have 50+ eps and a gazillion textures/meshes installed and they are not naked.\r<br />\r<br />[color=33CC66][b]10. All armors are normaly hardcoded[/b][/color] to the players to prevent them being naked, when they aren&#39;t with you. Because of that hardcoded armors like orcish and dwarven are going to prevent you from equipping lower gear like magerobes, studded armor and so forth. On the one hand you could say: stupid programming. On the other hand, you could think of it like this: If I was the follower, I wouldn&#39;t want someone giving me worse gear than I already have. I would be stupid to wear this in open combat... -&gt; Followers have fealings too... :D\r<br />\r<br />[center][b][size=3][color=lightblue]If there is a problem with a specific follower (like hair not right) or the light step perk doesn&#39;t work, write in the Bugsection (not Endorsement Section), and let me know - since there 11 esps -  [u]what character and exactly what esp.[/u] you&#39;re using. If you don&#39;t do this, I won&#39;t be able to help you and a response from me would be utterly meaningless.[/color][/size][/b][/center]\r<br />\r<br />[color=33CC66][b]11. &#34;My Followers and NPCs don&#39;t look like yours&#34;.[/b][/color]\r<br />If you want to have the same look, you&#39;ll have to do some manual work with these [b]Recommended Mods[/b].  How to do it exactly, you&#39;ll have to find out yourselves. I can only point you in the right direction. Install order:\r<br />[list][*][url=http://skyrim.nexusmods.com/downloads/file.php?id=2356]XCE[/url] - only the scars and headdirt&#33;&#33;&#33;[*]Get [url=http://skyrim.nexusmods.com/downloads/file.php?id=2666]CBBE[/url] (curvy)[*]Get [url=http://skyrim.nexusmods.com/downloads/file.php?id=2995]Best Race Beautiful[/url][*]Get [url=http://skyrim.nexusmods.com/downloads/file.php?id=5941]Coverkhajiits[/url] - Female[*]Get Better Males by Geonex (plus Faces and Khajiits)[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=3776]Argonian Improvements Horns[/url] - Better horns and feathers for argonians. Give it a shot. ;)[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=4869]Covereyes 1[/url] (only the vampire, orc and beast eyes)[*]Covereyes 2 (only the woodelf, darkelf)[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=3563]Coverwomen[/url] 1 for Nords and bretons[*]Coverwomen 2 for elves altogether[*]Coverwomen 3 for imperial female[*]Coverwomen lace warpaint (manually edit the desired warpaints for elven races)[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=5106]Female Face Texture[/url] for redguardfemale[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=6554]Cbbe skin texture cury[/url][*][url=http://skyrim.nexusmods.com/downloads/file.php?id=3589]Natural eyes[/url] (for high elves -&gt; yeah, they are finally blue and green .....)[*][url=http://skyrim.nexusmods.com/downloads/file.php?id=4307]AOF Believable Hair -Female and Male-[/url] -&gt; Good hair texture for stand hair.[/list]\r<br />[color=33CC66][b]12. &#34;I don&#39;t like your Beauty Versions.&#34;[/b][/color]\r<br />The Non-Beauty Versions have those, uhm, special vanilla features like: Pinocchio noses, cliffhanger cheekbones and facemorphs of the Klingon race :/... it&#39;s vanilla after all.\r<br />Concerning the Beauty Versions: Well, I guess I can&#39;t satisfy all tastes. If you don&#39;t like it don&#39;t install it. There are many good replacements on the site, use those. ;)\r<br />\r<br />If you still want to edit them, this is how:\r<br />\r<br />To get the best and unglitchiest, unbuggiest result, you have to do this:\r<br />[list][*]Open &#34;Better Followers - (x)&#34; in the CK.[*]Edit the Follower (or the npc from the packs). Save.[*]Open the modified &#34;Better Followers - (x)&#34; with NPC Editor.[*]Export (non BSA&#33;&#33;&#33;) to e.g. Desktop. Drop meshes and textures into data. Viola. [*]NEVER EVER USE THE ESP generated by NPC Editor. Refer to the first sentences of the Troubleshooting.[/list]\r<br />Now, you can do this: If you keep that version you modified, you can unpack the whole &#34;Better Followers - Main&#34; somewhere. Drop your esp into the corresponding folder (if you modified SBP, drop into SBP folder) so it overwrites. The same with meshes and textures. If it doesn&#39;t overwrite, you did something wrong.\r<br />Finally pack the whole &#34;Better Followers - Main&#34; with 7zip (it&#39;s best for file compression). Now you can install with NMM.\r<br />\r<br />[color=FF6600#]But be warned[/color]: Your modification will ruin any other Beauty version. You would have to make the whole thing from scratch. As long as you only use this one esp everything should be fine. \r<br />[color=lightblue]Do not, under any circumstances, ask for help on this subject. You are on your own, and the instructions are extremly clear. If you can&#39;t handle that, just don&#39;t edit. And do NOT load a &#34;Better Followers&#34; version of your own up, even if you call it something else.[/color]\r<br />\r<br />\r<br />\r<br />[right][img]http://skyrim.nexusmods.com/imageshare/images/2331822-1333520118.png[/img][/right]\r<br />[center]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=14412][img]http://skyrim.nexusmods.com/imageshare/images/1089738-1333641782.png[/img][/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=6335] [img]http://www.skyrimnexus.com/imageshare/images/1089738-1327074600.jpg[/img] [/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=14685][img]http://skyrim.nexusmods.com/imageshare/images/1089738-1334130855.jpg[/img][/url][/center]\r<br />\r<br />\r<br />[b]A thanks to:[/b]\r<br />\r<br />- all the people, who don&#39;t forget, that I&#39;m doing this voluntarely and that I&#39;m not their employee,\r<br />- everyone with a bit of a sense for humor and can laugh about themselves,\r<br />- everyone, who asks nicely,\r<br />- and all who read the description page. \r<br />\r<br />For Ai:\r<br />- sushisquid for the scripts, perks and spells from [url=http://skyrim.nexusmods.com/downloads/file.php?id=7245]Specialized Followers[/url]\r<br />- aBaDmAn91 for Housecarl AI from [url=http://skyrim.nexusmods.com/downloads/file.php?id=8477]Housecarls improved AI[/url]\r<br />\r<br />For Cosmetica:\r<br />- zn00p for letting me use [url=http://skyrim.nexusmods.com/downloads/file.php?id=7403]Lovely hairstyles[/url],\r<br />- newermind43, Bloodysunday and the asian uploaders for the [url=http://skyrim.nexusmods.com/downloads/file.php?id=3809]Coolsims Hair Pack[/url]\r<br />- Chris57 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=2488]Better Male Hairpack[/url]\r<br />- AnOldFriend for [url=http://skyrim.nexusmods.com/downloads/file.php?id=4307]Believalbe hair textures[/url]\r<br />- Apachii for [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]ApachiiSkyHair[/url]\r<br />- mistmoore for [url=http://skyrim.nexusmods.com/downloads/file.php?id=13278]Female Lacewarpaint[/url]\r<br />- Gizmodian and Xenius for letting me use [url=http://skyrim.nexusmods.com/downloads/file.php?id=3573]Gizmodian Warpaints[/url]\r<br />- Wyldsong for the marvelous [url=http://skyrim.nexusmods.com/downloads/file.php?id=13497]WyldTats Warpaint Edition[/url]\r<br />\r<br />Added Armors and Weapons:\r<br />- TH3WICK3D1 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=7807]Ves and Vernon Armors[/url]\r<br />- cokla for the [url=http://skyrim.nexusmods.com/downloads/file.php?id=8561]Mongol Armor[/url]\r<br />- DoODABoOM for the [url=http://skyrim.nexusmods.com/downloads/file.php?id=7109]Scout Armor[/url] and [url=http://www.skyrimnexus.com/downloads/file.php?id=5853]Lord Armor[/url]\r<br />- fume0101 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=9752]Masters of Death[/url]\r<br />- galy3 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=6908]Rose Geant Armor and Weapons[/url]\r<br />- Psyke23 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=4708]Triss&#39; Armor Retex[/url]\r<br />- person123456789 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=7010]Seraphim Armour[/url] and iLily for the [url=http://skyrim.nexusmods.com/downloads/file.php?id=7478]Retex[/url] \r<br />- Sader325 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=5600]Mystic Elven Armor[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=9109]Divine Aegis HD[/url]\r<br />- Snezko for [url=http://skyrim.nexusmods.com/downloads/file.php?id=6148]The Vicious Heart[/url]\r<br />- lKocMoHaBTl for [url=http://skyrim.nexusmods.com/downloads/file.php?id=6937]Armor of the Elven Guardian[/url]\r<br />- Omesean for the [url=http://skyrim.nexusmods.com/downloads/file.php?id=12693]Einherjar Armor[/url]\r<br />- Zonzai for [url=http://skyrim.nexusmods.com/downloads/file.php?id=1040]The Art of Magicka[/url]\r<br />- hothtrooper44 for [url=http://skyrim.nexusmods.com/downloads/file.php?id=14715]Baratheon Armor[/url], [url=http://skyrim.nexusmods.com/downloads/file.php?id=13961]Hedge Knight Armor[/url], [url=http://skyrim.nexusmods.com/downloads/file.php?id=13500]Redguard Knight Armor[/url] and [url=http://skyrim.nexusmods.com/downloads/file.php?id=13366]Warchief Armor[/url]\r<br />- echo 1162 for the [url=http://skyrim.nexusmods.com/downloads/file.php?id=14198]Field Mage Outfit[/url]\r<br />- Omegared 99 for the [url=http://skyrim.nexusmods.com/downloads/file.php?id=10277]Ranger Armor[/url]\r<br />\r<br />For the upcoming armors:\r<br />- fsdfsr for [url=http://skyrim.nexusmods.com/downloads/file.php?id=8729]Bright and Dark Tyrael Armor[/url]\r<br />\r<br />\r<br />For Misc:\r<br />- Findlkind, who sponsered the Video.\r<br />- foretrenty, who has helped me much and for making a special version of [url=http://skyrim.nexusmods.com/downloads/file.php?id=4554]NPC Editor[/url]\r<br />\r<br />[b]Tool used[/b]\r<br />\r<br />- Skyrim Creation Kit for just about everything\r<br />- BSA Unpacker for Sound file.",
  "categoryId": "66",
  "version": "1.4.50",
  "author": "Utopolyst",
  "createdUnix": "1328102466",
  "updatedUnix": "1335197387",
  "containsAdultContent": false,
  "uploadedBy": "Utopolyst",
  "primaryFile": null,
  "files": [
    {
      "fileId": "42966",
      "name": "Better Followers - Armor Pack v1_4_45",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "188987",
      "fileName": "Better Followers - Armor Pack v1_4_45-7554.7z",
      "uploadedUnix": "1331658741",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1d50e4ff2c7ae3fefcb02c1a8c70f9f14b7a66ea8c86c11fc262b82316b5d78b/analysis/1406746991/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Followers%20-%20Armor%20Pack%20v1_4_45-7554.7z?fid=42966&ttl=1535765683&ri=8192&rs=8192&setec=05e1869faf7cba742eed52d1fd18787e"
    },
    {
      "fileId": "47631",
      "name": "All Essential Followers - All Versions compatible",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "0",
      "fileName": "All Essential Followers - All Versions compatible-7554.rar",
      "uploadedUnix": "1332931097",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/26fb0bc2257ebde291119747684438ffdcb12eb6aab7ad9cb67239023172e70c/analysis/1406784007/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Essential%20Followers%20-%20All%20Versions%20compatible-7554.rar?fid=47631&ttl=1535765683&ri=8192&rs=8192&setec=3d8304b75aee259d8f05de4669e030bb"
    },
    {
      "fileId": "47896",
      "name": "Better Followers - Armor Pack II v1_4_45",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "65303",
      "fileName": "Better Followers - Armor Pack II v1_4_45-7554.7z",
      "uploadedUnix": "1333019984",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/35d591de45f650887dd25935bb2593d22157f943ada61499d32354b4f15307e8/analysis/1406785680/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Followers%20-%20Armor%20Pack%20II%20v1_4_45-7554.7z?fid=47896&ttl=1535765684&ri=8192&rs=8192&setec=c5e66ccc45fee663c86511b2f66f85ba"
    },
    {
      "fileId": "51908",
      "name": "Better Followers - Light",
      "version": "1.4.45",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5009",
      "fileName": "Better Followers - Light-7554.7z",
      "uploadedUnix": "1334053192",
      "modVersion": "1.4.45",
      "virusScanUrl": "https://www.virustotal.com/file/ab2a322f0b7758c96d2def8327461686492543d9a6d6fdd8d0039e147f13f106/analysis/1406807285/",
      "changelogHtml": " Fixed Lydias AI package; she will stay in Dragonsreach, if Breezehome is not bought.  <br/> \n Adjusted Faendals \\\"Summon Familiar\\\". Has now a cooldown of 10 minutes. Also added to all versions. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Followers%20-%20Light-7554.7z?fid=51908&ttl=1535765684&ri=8192&rs=8192&setec=b585c9a323eedcc3db5adbd4a4de6d4f"
    },
    {
      "fileId": "51913",
      "name": "Better Followers - Main v1_4_45",
      "version": "1.4.45",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "87236",
      "fileName": "Better Followers - Main v1_4_45-7554.7z",
      "uploadedUnix": "1334054191",
      "modVersion": "1.4.45",
      "virusScanUrl": "https://www.virustotal.com/file/2a854024a25933d6cd480d0a76ee47b28f649e0bdf35dd71034574b1793c52bd/analysis/1406807305/",
      "changelogHtml": " Fixed Lydias AI package; she will stay in Dragonsreach, if Breezehome is not bought.  <br/> \n Adjusted Faendals \\\"Summon Familiar\\\". Has now a cooldown of 10 minutes. Also added to all versions. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Followers%20-%20Main%20v1_4_45-7554.7z?fid=51913&ttl=1535765685&ri=8192&rs=8192&setec=c7442293e494242413c8eaeecee54d16"
    },
    {
      "fileId": "55123",
      "name": "Guide to Better Followers",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5698",
      "fileName": "Guide to Better Followers-7554.7z",
      "uploadedUnix": "1335025502",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2acf5438dbc2966c0bc892825db2113507e6fdd95adf05322094f4ba01159ca5/analysis/1406826861/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guide%20to%20Better%20Followers-7554.7z?fid=55123&ttl=1535765685&ri=8192&rs=8192&setec=9dd222eea0d318f657ba802e39834bce"
    },
    {
      "fileId": "55159",
      "name": "Better Followers - Armor Pack I",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "302600",
      "fileName": "Better Followers - Armor Pack I-7554.7z",
      "uploadedUnix": "1335032121",
      "modVersion": null,
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Followers%20-%20Armor%20Pack%20I-7554.7z?fid=55159&ttl=1535765686&ri=8192&rs=8192&setec=8e6d8db6f570840e99b317c1a9147905"
    },
    {
      "fileId": "55169",
      "name": "Better Followers - Main",
      "version": "1.4.50",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "92564",
      "fileName": "Better Followers - Main-7554.7z",
      "uploadedUnix": "1335033806",
      "modVersion": "1.4.50",
      "virusScanUrl": "https://www.virustotal.com/file/7fcc3c2e3c786e18c5c9a65e8ef93df75289b58e4275ef19b95dbbf4a25f6af1/analysis/1406827049/",
      "changelogHtml": " Added 4 new armors <br/> \n Updated Divine Armor. <br/> \n Updated some follower meshes. <br/> \n Minor Fixes. <br/> \n This update only concerns Beauty Versions.  <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Followers%20-%20Main-7554.7z?fid=55169&ttl=1535765686&ri=8192&rs=8192&setec=36106e8fc74f4302d7916c1ab4190118"
    },
    {
      "fileId": "55675",
      "name": "Better Followers - Armor Pack II",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42497",
      "fileName": "Better Followers - Armor Pack II-7554-1.7z",
      "uploadedUnix": "1335197387",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1a68b2d6c45f977cfad2adc6dfb4a36429331eb815e1c2e161e30f3e30521a70/analysis/1406831354/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Better%20Followers%20-%20Armor%20Pack%20II-7554-1.7z?fid=55675&ttl=1535765687&ri=8192&rs=8192&setec=1d126646084350900ed9c2b38e4c5358"
    }
  ]
}