{
  "modId": 75567.0,
  "modName": "Imperator Furiosa - All perks and spells - Everything at 1000",
  "summary": "Every skill at 100, every perk selected, every spells, enchantments, ingredient uses, health, stamina and Magicka at 1000.",
  "descriptionHtml": "This is a save game based on Imperator Furiosa, from Mad Max - Fury Road. She has every skill at level 100, every perk selected, and Magicka, health and stamina at 1000. That&#39;s why she has a lot of perks still available. I had to get to level 271.\r<br />&lt;br /&gt;&lt;br /&gt;She has no quests done, and only has that Boethiah miscellaneous quest because when I got to the Standing Stones there was a guy there. She&#39;s stopped at the Standing Stones, no stone selected.\r<br />&lt;br /&gt;&lt;br /&gt;The screenshots were done using mods, but I turned off every mod to save the game.\r<br />&lt;br /&gt;&lt;br /&gt;She has every spell, from every expansion(I&#39;m as old as The Sims, so I refuse to call it DLC), but I think there won&#39;t be any problem if you don&#39;t have any.\r<br />&lt;br /&gt;&lt;br /&gt;I didn&#39;t got every shout because it started to get bugged when I used console commands to get them. So consider getting all of them a... challenge.\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;I&#39;ve used the following mods and stuff to develop every skill and get everything:\r<br />&lt;br /&gt;&lt;br /&gt;http://www.nexusmods.com/skyrim/mods/50371 - Know-it-all Trainers: I went to the &#34;qasmoke&#34; room, summonned Vilkas and developed every skill. By the Nine, it took some time.\r<br />&lt;br /&gt;&lt;br /&gt;-Opened every spell tome chests and read all of them\r<br />&lt;br /&gt;&lt;br /&gt;-Got the Alchemy perks to learn every function of the ingredients I eat and ate all of them. Almost died and got some diarrhoea but, as a Brazilian superstar says, &#34;já diz aquele ditado, vamos fazer o quê?&#34;(it&#39;s what that saying talks about, what can we do?)\r<br />&lt;br /&gt;&lt;br /&gt;-Got every Talos damn enchanted armor and weapon and clothes and circlet and everything and disenchanted them, learning everything\r<br />&lt;br /&gt;&lt;br /&gt;-Used the Skyrim Creation Kit to change the price of the Gold Diamond Necklace from 1200 to 30000000 and did a lot of them, increasing from level 15 to level 100 in the blink of an eye, and raised from level 81 to level 271, getting every perk I needed and increasing Magicka, health and stamina to 1000. I didn&#39;t tried it, but I think you can non-stop run from Riften to Markarth. Run, Furiosa, Run&#33;\r<br />&lt;br /&gt;&lt;br /&gt;\r<br />&lt;br /&gt;&lt;br /&gt;So, that&#39;s what I&#39;ve done. I&#39;m thinking of putting the Gold Diamond necklace here too. Maybe in a few days I will. Have a nice overpowered game&#33; And good luck trying to defeat the Ebony Warrior, because I died around 30 times trying, with 2 Atronachs by my side&#33; He&#39;s overpowered too, and waitng for you in Whiterun...",
  "categoryId": "43",
  "version": "",
  "author": "Icaro Schuwartz",
  "createdUnix": "1462990735",
  "updatedUnix": "1462990735",
  "containsAdultContent": false,
  "uploadedBy": "icarothomas",
  "primaryFile": null,
  "files": []
}