{
  "modId": 75612.0,
  "modName": "College of Whispers - New Quest Line",
  "summary": "Combining different references from the Lore, I&#39;ve imagined a way where the College of Whispers could be inserted in Skyrim with it&#39;s own quest line and characters, but I will need help to make that mod.",
  "descriptionHtml": "[b][size=3]INTRODUCTION[/size][/b]\r<br />\r<br />[url=http://www.uesp.net/wiki/Lore:Books_by_Author#Seif-ij_Hidja]Seif-ij Hidja[/url], also know has [url=http://www.uesp.net/wiki/Lore:Morian_Zenas#Morian_Zenas]Morian Zenas[/url] apprentice, was an Argonian gifted in Conjuration. When his master when to the Oblivion Realms, their connection allowed him to hear Zenas talking to him, like whispers in his head. For years, he wrote books about his master and [url=http://www.uesp.net/wiki/Lore:Books_by_Author#Doctor_Alfidia_Lupus]Alfidia Lupus[/url] discoveries in the strange worlds of Oblivion, but most part of that knowledge was kept with him, like the method to access the different Oblivion Realms, which he promised to [url=http://www.uesp.net/wiki/Lore:Divayth_Fyr]Divayth Fyr[/url] that he would never reveal.\r<br />\r<br />When Hidja became really old and stopped to hear his master whispers, assuming then his death, he wrote a book containing all the knowledge that he had about Oblivion. He wrote [i]&#39;Whispers&#39;[/i] in the book cover and gave it to his son. For generations the book was preserved by Hidja family, keeping the promise the book would only be opened if it was extremely necessary. Then, the Oblivion Crisis came...\r<br />\r<br />The Hidja family was discovered by a group of members of the [url=http://www.uesp.net/wiki/Lore:Mages_Guild]Mages Guild[/url], which was about to be dissolved. They had read Seif-ij Hidja book, &#34;[i][url=http://www.uesp.net/wiki/Lore:The_Doors_of_Oblivion]The Doors of Oblivion[/url][/i]&#34;, and though he could teach them how to access the Oblivion Realms. They were convicted that if they could learn enough about the Deadra and Oblivion, they would be able to avoid catastrophes like the Oblivion Crisis. Agreeing with them, the head of the Hidja family decided that he would pass the knowledge of his ancestor to the students.\r<br />\r<br />During the first weeks he taught them simple things from the book, since he didn&#39;t knew much about conjuration and had to learn from the book before teaching them. After a year he became an expert in Conjuration and knew everything which was inside the book, and decided that he needed more students in order to prepare Tamriel in case another Deadric Prince decided to attack it again. He needed a college.\r<br />\r<br />With the knowledge of the book, he was capable of controlling Dremora and building a whole college in three weeks. As a tribute to his ancestor&#39;s legacy, he called it the [b][url=http://www.uesp.net/wiki/Lore:College_of_Whispers]College of Whispers[/url][/b].\r<br />\r<br />\r<br />[size=3][b]BACK TO THE PRESENT[/b][/size]\r<br />\r<br />Dragons are attacking Skyrim, and Wih-Ju Hidja, the actual headmaster of the College of Whispers, thinks that might the realization of a prophecy that Morian Zenas read in the [url=http://en.uesp.net/wiki/Lore:Apocrypha]Apocrypha[/url]: that two of the most powerful Deadric Princes, [url=http://en.uesp.net/wiki/Lore:Hermaeus_Mora]Hermaeus Mora[/url] and [url=http://en.uesp.net/wiki/Lore:Mehrunes_Dagon]Mehrunes Dagon[/url], would take the opportunity to join forces and attack Mundus. Mora would be looking for the &#39;Whispers&#39; book, which he desired more than any other, and Dagon would be looking for revenge for what happened during the Oblivion Crisis.\r<br />\r<br />With the rumors of a living Dragonborn in Skyrim, Wih-Ju Hidja remembers that [url=http://en.uesp.net/wiki/Lore:Martin_Septim]Martin Septim[/url], the last Dragonborn, was the only one capable of defeating Dagon 200 years ago. Then he invites the Dragonborn to visit the secret division of the College of Whispers in Skyrim so he could ask for his aid. In the meanwhile, the [url=http://www.uesp.net/wiki/Lore:Synod]Synod[/url] would be trying to persuade the Dragonborn, in order to get rid of the College of Whispers once for all.\r<br />\r<br />\r<br />[size=3][b]POSSIBILITIES (SPOILERS AHEAD)[/b][/size]\r<br />\r<br />The player should choose between helping one of the four sides. Each side has different bosses and different prices in the end.\r<br />\r<br />[b]- Helping the College of Whispers:[/b] The player would need to ignore the offers of the Synod, Mora and Dagon. His final boss would be Dagon in a dragon like form, the Giant Deadric Dragon, which he would be able to achieve thanks to Mora. The college would be preserved in the end, so the player would be able to learn multiple Conjuration spells in it. Also, he would learn a shout which would allow him to summon a Deadric Dragon after defeating Dagon.\r<br />\r<br />[b]- Helping the Synod:[/b] By joining the Synod the player would end up destroying the &#39;Whispers&#39; book, and Wih-Ju would die in combat while trying to protect the book from the player. Hermaeus Mora would lose interest in the attack to Mundus since the book would have been destroyed, so the final boss would be the original Dagon. Dagon is immune to common magic, so only Shouts would be able to damage him. After that the students would leave the college, and the Synod would take it for them, and destroy everything related to conjuration. The player would be able to learn more about Enchanting and receive unique items.\r<br />\r<br />[b]- Helping Hermaeus Mora:[/b] Helping Mora would be basically bringing him the &#39;Whispers&#39; book without being noticed, and in exchange Mora would not help Dagon to invade Mundus. Agreeing, Mora send the player back to Skyrim, where is surprised by the Synod. Despite the player efforts, Dagon managed to reach the Battlespire, and now that he was angry for Mora&#39;s betrayal he decided to anticipate his attack to Mundus. The Synod and the College of Whispers join forces to fight agains the Dremora army, but they know it&#39;s gonna be a really hard battle. In order to have a chance, the player backs to Apocrypha and ask for Mora&#39;s help. Mora then teaches the player a Banishment Shout, which can be used to send any Deadric being to the Deadlands. Mora also handles the player a [url=http://www.uesp.net/wiki/Lore:Daedric_Crescent]Daedric Crescent[/url], which was obtained during a trade from a man called [url=http://www.uesp.net/wiki/Lore:Nerevarine#Nerevarine]Nerevarine[/url] many years ago, and the [url=http://en.uesp.net/wiki/Lore:Scourge]Scourge[/url]. The player is then able to use any of the weapons in the combat against Dagon, which can be damaged by these Daedric Artifacts. Both the organizations will ignore the player after the events for joining Mora&#39;s side.\r<br />\r<br />[b]- Helping Mehrunes Dagon:[/b] By deciding to join forces with Dagon the player would have to kill all the College of Whisper members, and then bring the &#39;Whispers&#39; book to Dagon. Using the book, Dagon would open an Oblivion Gate to the ruins of the ancient Battlespire. Dagon would then ask the player to bring the &#39;Whispers&#39; book to Apocrypha, and destroy it there. Doing so would unleash the fury of Mora, which would summon lots of minions to fight the player. In the end, Dagon would open an Oblivion Gate so the player would be able to return to the Battlespire, now rebuilded. The player now would be able to use the Battlespire has a safe house. \r<br />\r<br />\r<br />[size=3][b]WHAT&#39;S NEEDED[/b][/size]\r<br />\r<br />I can write the history, but I don&#39;t know much about Skyrim modding or modeling, so I would need the 3D models of:\r<br />- College of Whispers (which I imagine has a short building in the middle of a distant island)\r<br />- The Battlespire (Ruined and Rebuilded)\r<br />- An Oblivion Gate\r<br />- Mehrunes Dagon in his physical form\r<br />- NPCs (specially Wih-Ju Hidja) \r<br />- Daedric Crescent\r<br />- Scourge\r<br />- The Deadric Dragon\r<br />- Someone who knows how to use the Skyrim modding programs\r<br />\r<br />\r<br />[size=3]SUGGESTIONS? OPINIONS?[/size]",
  "categoryId": "25",
  "version": "0.1",
  "author": "VitorMM",
  "createdUnix": "1463190699",
  "updatedUnix": "1463190699",
  "containsAdultContent": false,
  "uploadedBy": "torgola",
  "primaryFile": null,
  "files": []
}