{
  "modId": 7564.0,
  "modName": "Dalls_Noble_Furniture",
  "summary": "Noble_Furniture is custom re-texturing (n not some simple - in-part - recolor) mod which changes how Skyrim Noble (house) furnishings - and in-game wood barrels look.*",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Noble_Furniture\r\n\r\nv1.0\r\n\r\n01/02/2012\r\n\r\nNoble_Furniture is custom re-texturing (n not some simple - in-part - recolor) mod which changes how Skyrim Noble (house) furnishings - and in-game wood barrels look.*\r\n\r\n* Word of warning - my work actually do changes how these items look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers. \r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nWhat this mod delivers? Around sixty luxurious / \\\"noble house\\\" furniture items like beds, benches, chairs, tables, wardrobes, shelves, chests, coffins etc. and two - now almost mandatory ;) - barrels! As I was growing somewhat tired of my (bought) \\\"palaces\\\" n mansions looking more like ploughman\\'s dream - then Nord noblemen\\'s hall - new more appropriate high-definition (furniture) textures were made.\r\n\r\nNumber of models which use these (noble furniture) textures in-full or in-part is quite large and for their sake few more texture files - like (general) furniture wood were added. Two, included barrels beside being very nice actually have nothing to do with these (noble furniture) models or their new textures but as they are Bethesda\\'s favourite n indispensable furnishing highlight / unavoidable house storage feature - for any  in-game house - including all luxurious / noble ones as well - they must be treated accordingly - as integral part of noble (household) furnishings. \r\n\r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my (check for names my mod) texture files from Data/textures/clutter and furniture/noble - and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but take care not to overwrite them by accident!\r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nNote on Rough Barrel Fix: In main mod package, one of Barrels -Rough one - has control rather then final texture. Install this fix last!\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.\r\n",
  "categoryId": "68",
  "version": "1.0",
  "author": "Dall",
  "createdUnix": "1328117987",
  "updatedUnix": "1328119309",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25004",
      "name": "Dalls_Noble_Furniture",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13894",
      "fileName": "Dalls_Noble_Furniture-7564-1.7z",
      "uploadedUnix": "1328118360",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4dbbc3a9fc3fc4ab239c7799cbb48bd0997d95e19735619b2e602c2c66b16ac0/analysis/1406648833/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Noble_Furniture-7564-1.7z?fid=25004&ttl=1535765704&ri=8192&rs=8192&setec=e37f983ccbca028d296cba10febe4952"
    },
    {
      "fileId": "25007",
      "name": "Dalls_Noble_Furniture_Rough_Barrel_Fix",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "741",
      "fileName": "Dalls_Noble_Furniture_Rough_Barrel_Fix-7564-1.7z",
      "uploadedUnix": "1328119309",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/41052d1c624dc40309f45bc5fb78cd3db29f5f6038e0341affe6f7ed0241a79a/analysis/1406648838/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Noble_Furniture_Rough_Barrel_Fix-7564-1.7z?fid=25007&ttl=1535765705&ri=8192&rs=8192&setec=fde794544f04e5bf98ad672e9cac6b46"
    }
  ]
}