{
  "modId": 75716.0,
  "modName": "A Small Collection of Batch Files",
  "summary": "A few bat. files put together to save me some keystrokes.",
  "descriptionHtml": "This is nothing major, just a few bat files I put together to save me some keystrokes during play. Just unzip them into the main directory where other bat slash text files go.\r<br />\r<br />Quick explanations follow.\r<br />\r<br />epc  This one is enableplayercontrols. For me, when I&#39;m about out of memory to use often my character doesn&#39;t respond mouse keys and sometimes the keyboard too. This one sometimes helps.\r<br />\r<br />face  This one is for when the gray face bug hits and the face textures don&#39;t match the body ones anymore. It&#39;s just the setnpcweight 99 console command.\r<br />\r<br />mine   Just the setownership for mod items that are listed as steal instead of take.  Or if you really need that tomato for  a realistic needs mod...\r<br />\r<br />nude   Created for the Live Another Life mod, unequips the roughspun tunic the game gives you during character creation, letting you fiddle with body sliders and tattoos etc. without having to save the character and do showracemenu again.\r<br />\r<br />smith  I suppose this would be a cheat, but it just equips you with a basic stock of crafting ingots, leather, linen wraps etc. A fair amount of leather, leather strips, iron and steel ingots, with five of the more rare ones, but nothing exotic like gems, monster parts or the like.",
  "categoryId": "28",
  "version": "",
  "author": "oldfanboy",
  "createdUnix": "1463507279",
  "updatedUnix": "1463507266",
  "containsAdultContent": false,
  "uploadedBy": "oldfanboy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000206884",
      "name": "batfiles.zip",
      "version": "onlyone",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "batfiles.zip-75716-onlyone.zip",
      "uploadedUnix": "1463507266",
      "modVersion": "onlyone",
      "virusScanUrl": "https://www.virustotal.com/file/ef038c2ee1198570638a72d3b7fd8e3eaac279cf7ba6144ce39d4436716af14f/analysis/1463507284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/batfiles.zip-75716-onlyone.zip?fid=1000206884&ttl=1535864471&ri=8192&rs=8192&setec=ecf3b8959c567da7cfd30bb85f429b0c"
    }
  ]
}