{
  "modId": 7578.0,
  "modName": "Skyrim Weapon and Apparel Database and Tracker",
  "summary": "Searchable and editable database of Weapons and Apparel in Skyrim along with the ability to track items the player has found. As at this version ",
  "descriptionHtml": "Updated Version 1.03\r\n\r\nAdded a few missing items and deleted a few duplicates\r\nAdded ability to track up to 5 different games / profiles\r\nAdded Item ID\\'s\r\n____________________________________________________\r\n\r\nWhen it comes to single player RPG\\'s I am, among other things, a total kleptomaniac. Many players will immediately abandon the trusty Orcish Sword of Embers that has served them so well when they finally find a Daedric Sword or quickly don their new Elven Helmet and toss aside the old Steel one without a second thought - not I. I collect, sure I wear the best gear possible but the old gear, I store it [my wife would say \\\"what\\'s new?\\\" you do that in real life but that\\'s a thought for another day] and I record it and I look for the things I don\\'t own - kind of like a virtual stamp collector - the purpose of having the items is to have the collection - to get more - to get complete sets - owning is happiness.\r\n\r\nThe Skyrim Apparel & Weapon Tracker is basically a database [in Excel] of Weapons and Apparel - it currently lists 4725 items from the vanilla game and features the following:\r\n\r\n•\tRecord for each item contains:\r\n•\tName, Source, Class, Category, Type, Rating, \\\"Owned\\\" Flag, \\\"Favorite\\\" Flag, Storage Location, Enchantment, Notes\r\n•\tAll records are editable and there is a find function that allows them to be quickly located for reference or editing\r\n•\tNew items can be easily added accomodating a growing database as new items are added by mods\r\n•\tSeveral pre set sort options\r\n•\tSeveral pre set filter options, some detailed filter settings and fully customizable filtering using the Excel auto filter functionality\r\n•\tSimple one click clear function for setting up for a new game or profile\r\n\r\nI do not guarentee total accuracy though I think it is pretty darn close and I do not guarentee there are no items missing but if there are I think not many. If you do know of anything inaccurate or missing please let me know.\r\n\r\nIf you like it and find it of use that\\'s great - if not that\\'s cool too - we are all different and while it matches the game experience I want you might just think \\\"what a heap of garbage\\\". It was built for me and if no one ever uses it that is fine, it still served its purpose but I figured I may as well put it out there just in case it was of use to anyone else.\r\n\r\nIf you do happen to be at all interested watch for more - there will be additions for Locations, Quests, Ingredients & Recipes, Shouts and more - if it can be tracked I will be adding it in due course.",
  "categoryId": "28",
  "version": "1.02",
  "author": "TheGrumpyOldLimey",
  "createdUnix": "1328130704",
  "updatedUnix": "1328223043",
  "containsAdultContent": false,
  "uploadedBy": "thegrumpyoldlimey",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25368",
      "name": "Skyrim Weapon and Apparel Database and Tracker",
      "version": "1.03",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "447",
      "fileName": "Skyrim Weapon and Apparel Database and Tracker-7578.zip",
      "uploadedUnix": "1328223043",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/406a72e3a84329f28597efb1c3262be2a46dee178851d4de7b14473f077a05f0/analysis/1406650985/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Weapon%20and%20Apparel%20Database%20and%20Tracker-7578.zip?fid=25368&ttl=1535765728&ri=8192&rs=8192&setec=b7340b81752163016501010b4b7cc4eb"
    }
  ]
}