{
  "modId": 75792.0,
  "modName": "UT&#39;s Adjustments - Equipment Spells Crafting and More",
  "summary": "All fortify crafting skill effects no longer stack at all, buffs to underpowered equipment, 5 new perks, shrines don&#39;t remove diseases, pickpocket caps at 99% chance, 100% resistance cap, buffed food, and much more.",
  "descriptionHtml": "[size=5][size=3][size=5]Introduction[/size]\r<br />If you want an extremely well balanced Skyrim experience while keeping it pretty vanilla, you&#39;ve come to the right mod. This mod has good compatibility with other mods too (see the &#34;Installing this mod&#34; section for more details), so it doesn&#39;t have to be vanilla, though you may ruin the balance. The main thing to note is it is probably not compatible with mods like [url=http://www.nexusmods.com/skyrim/mods/68425/?]Ordinator[/url].\r<br />Let me know if you have an idea to improve balance more or something.\r<br />[size=2]Note: With this mod, you may find the overall difficulty has increased, mainly due to not having as much armor rating and OP crafted gear, so maybe don&#39;t play on legendary unless you&#39;re actually legendary.[/size][/size]\r<br />\r<br />\r<br />A tldr of what this does\r<br />[size=3]I tried to balance just about all aspects of the game (number-wise rather than adding/changing mechanics mostly), especially the three crafting skills: enchanting, alchemy and smithing. You can&#39;t get magicka costs to 0 anymore, and can make a meaningful choice about what kind of armor to wear, including clothing like robes. Unique equipment is no longer garbage. There&#39;s some not too big of changes to perks.[/size]\r<br />\r<br />\r<br />What does this mod really do?[/size]\r<br />[size=3]This mod does a great many things, ranging from unnoticeable to fairly major. I&#39;ll go in order from most important to least:\r<br />[/size][list=1]\r<br />[*][size=3]Fortify effects for the three crafting skills no longer stack, at all. Yes this includes Ahzidal&#39;s Genius, Notched Pickaxe, and the Seeker effects.[/size]\r<br />[*][size=3]Blacksmith potion&#39;s power reduced, both ones you find and ones you make.[/size]\r<br />[*][size=3]Magicka cost reduction enchantments can no longer be applied to necklaces. With this change and the not stacking thing, it actually becomes impossible to reach zero cost spells unless using Necromancer Amulet, making magicka actually matter.[/size]\r<br />[*][size=3][size=3]You are no longer able to learn the cost reduction + magicka regen enchantments, disenchanting robes with that stuff will instead teach you the just the cost reduction enchantment. There is one reason for this, which is to prevent the player from enchanting with one of these enchantments and the regular cost reduction version together. I would have liked to keep those enchantments, but as far as I can tell it&#39;s impossible in any way to prevent certain combinations of enchantments, even with scripting (tell me if I&#39;m wrong). I needed to do this to make change # 3 relevant. If you are going to use this mod with an existing save file, I would highly recommend you either remove these enchantments (hard to do) or simply don&#39;t use them.[/size][/size]\r<br />[*][size=3]The blacksmith perks, although they say they double your effectiveness, it is now actually 1.9x, and they provide unarmed damage. Also smithing levels up a bit faster.[/size]\r<br />[*][size=3]Light and heavy armor perks which increase armor rating have been nerfed pretty hard. You now will not reach the armor cap in light armor. The heavy armor perk Conditioning makes equipment weigh 25% instead of zero. Also wearing armor pieces no longer give a hidden armor rating, it&#39;s just what it shows.[/size]\r<br />[*][size=3]Taking the first perk in enchanting causes enchantments to heavy and light armor to apply at 90% power, and clothing at 110%. Jewelry is still 100%.[/size]\r<br />[*][size=3][size=3]The three Elemental enchantment perks have been combined into one (where the fire one was), and there are two new perks. One perk buffs scrolls, the other buffs staves. Also, I made sure scrolls are not affected by spell perks, and staves are.[/size][/size]\r<br />[*][size=3]One new perk in both light and heavy armor trees (the heavy armor one does not work as a werewolf or vampire lord, for balance reasons). Light armor: speed increase and reduced damage while sprinting. Heavy armor: Unarmed buff while dual wielding fists. I figured the armor rating bonus of heavy armor would be enough of an advantage on its own, even if you aren&#39;t going unarmed.[/size]\r<br />[*][size=3]One more new perk which is another rank of Conjuration&#39;s Mystic Binding.[/size]\r<br />[*][size=3]Buffs to underpowered unique weapons and armors. Which is the majority of them. Nothing crazy though, most of the time it&#39;s just like 1 or 2 base damage increase, or simply making the enchantment stronger. There are a very few items that were nerfed.[/size]\r<br />[*][size=3]Health, magicka and stamina regeneration rates are now the same in and out of combat, but have been slowed down a bit to compensate.[/size]\r<br />[*][size=3]Spells, scrolls, staves and enchantments which have a maximum level that their target can be have been buffed.[/size]\r<br />[*][size=3]Shrines no longer cure diseases (have to use a potion, or if you use my other mod, you can get a cure disease spell), some shrine effects buffed, one nerfed, one changed, and all effects last 12 hours now.[/size]\r<br />[*][size=3]Buffs to Destruction&#39;s master spells, as well as changing some of it&#39;s perks to add destruction damage. Also slightly buffed cloaks and Sun Fire and Vampire&#39;s Bane.[/size]\r<br />[*][size=3]Dual casting is slightly less effective and costs less magicka.[/size]\r<br />[*][size=3][size=3]With the first perk in One-Handed, Two-Handed or Archery, those weapons will have a 5% base chance to do a critical strike. Same with unarmed and the first perk in Smithing. Also critical damage is stronger overall.[/size][/size]\r<br />[*][size=3][size=3][size=3]Resistances cap raised from 85% to 100%.[/size] This is for elements and poison, and disease damage if you are using a mod that has that.[/size][/size]\r<br />[*][size=3][size=3]Changed minor restoring potions to restore 30 so they aren&#39;t as instantly useless, and ultimate restoring potions to 500, down from 9999, so you need to carry and use more at [size=3][size=3]very[/size][/size] high amounts of health or whatever. I also increased their weight to 1.[/size][/size]\r<br />[*][size=3][size=3]Changed the alchemy effects of Fortify Health/Stamina/Magicka to have a 2 minute duration, same with the existing potions. All lingering damage poisons now last 10 seconds for consistency (don&#39;t worry, I buffed the damage too).[/size][/size]\r<br />[*][size=3][size=3]Minor tweaks to vampires and werewolves. This Includes a slight downside to the human form of werewolves, so it is no longer purely an advantage to be one.[/size][/size]\r<br />[*][size=3][size=3]Weapon perks that cause bleeding have been overall buffed, the damage and duration is no longer dependant on the weapon&#39;s material type.[/size][/size]\r<br />[*][size=3][size=3][size=3][size=3]When enchanting, Fiery Soul Trap&#39;s fire damage will now be able change, while the soul trap time is stuck at 3 seconds.[/size][/size][/size][/size]\r<br />[*][size=3]Most Alteration spell&#39;s duration was changed, the perk Stability now gives a flat 30 second increase, also increased duration on Khajiit&#39;s Eye of Night power.[/size]\r<br />[*][size=3]Buffed the damage on Breath of Nchuak, and Ignite and Freeze.[/size]\r<br />[*][size=3]Augmented element perks slightly nerfed, and only buff elemental damage enchantments by 5% each. Also the perk Aspect of Terror no longer buffs the damage of destruction spells when paired with the Intense Flames perk.[/size]\r<br />[*][size=3]Some standing stones buffed, some nerfed.[/size]\r<br />[*][size=3]Pickpocket chance is now capped at 99%, also very slightly reduced difficulty multiplier with weight.[/size]\r<br />[*][size=3]The Pickpocket perks Keymaster and Poisoned have had their positions switched.[/size]\r<br />[*][size=3][size=3][size=3]The Restoration perk Respite, [size=3]the Pickpocket [size=3]perk Extra Pockets[/size][/size], and the Light Armor perk Wind Walker have been slightly nerfed[/size][/size][size=3]. They were just too good for 1 perk point, maybe Respite should be nerfed even more.[/size][/size]\r<br />[*][size=3]Dragonhide spell nerfed to 75% armor, but buffed duration to be the same as the other flesh spells.[/size]\r<br />[*][size=3]Dragons now have some armor rating, the amount depends on their level, which depends on your level. Did a few very minor things with other enemies as well such as Dwarven automatons being not quite as strong against lightning.[/size]\r<br />[*][size=3][size=3]Changed the description of several spells and perks to be more informative.[/size][/size]\r<br />[*][size=3][size=3]Horse&#39;s run speed increased, their stamina was also increased (was a pitiful 100).[/size][/size]\r<br />[*][size=3]Added an enchantment graphic effect for Hunter&#39;s prowess, as well as buffed the power of the Hunter&#39;s Prowess, Silent Moon and Fortify Unarmed enchantments. Also Bow of the Hunt can now be disenchanted to get Hunter&#39;s Prowess.[/size]\r<br />[*][size=3][size=3]Many foods have been buffed (not by much), one or two nerfed. Skooma gives a buff to speed.[/size][/size]\r<br />[*][size=3][size=3]All wedding rings now give a buff to Restoration magicka cost. Before they had no enchantment except for yours and your spouses. Also I changed Amulet of Mara in the same way I changed the shrine of Mara (mentioned above), which is to buff healing.[/size][/size]\r<br />[*][size=3][size=3]Gave Heimskr (the Whiterun Talos worshiper) an Amulet of Talos.[/size][/size]\r<br />[*][size=3][size=3][size=3][size=3]Maximum jail time increased to 20 days, some bounty amounts increased.[/size][/size][/size][/size]\r<br />[*][size=3]Loading screen text changed for a bunch of them so that they are more correct and helpful. One of them regarding stamina is only accurate if you are using the mod &#34;Power Attacks Require Stamina&#34; (link below).[/size]\r<br />[/list][size=3]\r<br />\r<br />[size=3]If there are any changes you disagree with, make a good argument and I may change it or make multiple versions.\r<br />By the way, there are currently 0 bugs that I know of in the mod. Any I find I try to immediately fix.[/size]\r<br />On all the things I edited, I also made the same changes as the Unofficial Skyrim Patch. There&#39;s even several minor new fixes that Arthmoor is too lazy or something to fix himself, he actually IP banned me for too many bug reports on his website thingy made for sending bug reports.\r<br />Speaking of which, little tip for those of you who care, if you go into TES5Edit you can delete EnchRobesFortifyMagickaRate02 and EnchRobesFortifyMagickaRate05, those have been there since combining the unofficial patches and currently do nothing. Also the change to fireball is incorrect and can be removed.\r<br />[size=5]\r<br />\r<br />[/size][size=5]Cost Changes[/size]\r<br />You may notice I have files which talk about cost changes. What that is, is an increase in the price for inns (20 G) and carriage rides (80 and 100 G). These changes will work on existing save files, but will not show the correct price in dialogue boxes unless you start a new game. Also included in these files is the following change [size=3](related to change # 38)[/size]: Heimskr will be wearing the Amulet of Talos as opposed to simply holding it. I&#39;m not sure why, but I found that trying this change in an existing save file resulted in him going naked. Maybe this fixes itself over time, but it didn&#39;t seem to for me. Maybe you can correct it with console commands.[/size]\r<br />[size=5]\r<br />\r<br />[/size][size=5]Must-have (not literally) comlplementary mods\r<br />[size=3]Power Attacks Require Stamina - [url=http://www.nexusmods.com/skyrim/mods/49428/?]http://www.nexusmods.com/skyrim/mods/49428/?[/url]\r<br />RACISM[size=5][size=3] -[/size][/size] [url=http://www.nexusmods.com/skyrim/mods/78634/?]http://www.nexusmods.com/skyrim/mods/78634/?[/url]\r<br />either [url=http://www.nexusmods.com/skyrim/mods/78635/?]Dragon Shouts Rebalanced[/url] or [url=http://www.nexusmods.com/skyrim/mods/17010/?]Dragonborn Ascendant[/url]\r<br />Better White Phial Effects[size=5][size=3] -[/size][/size] [url=http://www.nexusmods.com/skyrim/mods/14607/?]http://www.nexusmods.com/skyrim/mods/14607/?[/url][/size][size=3]\r<br />and my other mod, UT&#39;s Spells and Enchantments - [url=http://www.nexusmods.com/skyrim/mods/75828/?]http://www.nexusmods.com/skyrim/mods/75828/?[/url]\r<br />[size=5]\r<br />\r<br />[/size][/size][/size][size=5]Installing this mod\r<br />[/size][size=3]I don&#39;t know about Nexus Mod Organizer or whatever else there is as I have always manually installed my mods. It is very easy to do with my mod, just paste the files into the &#34;Data&#34; folder of the Skyrim directory. It should be somewhere around the middle-high up in the load order. This mod is perfectly safe to use with existing save files, just note that earlier on when I was making the mod, my ranks in the first heavy and light armor perks went away, but when I test now nothing happens. My mod should be compatible with most other mods since I didn&#39;t add much new things, but I wouldn&#39;t recommend trying with any that change perks in a significant way or rely on vanilla perks. Any other mods that change items or other things that this mod also changes will work fine, and whichever is lower in the load order will be the one who&#39;s changes you actually see.\r<br />[/size][size=5]\r<br />\r<br />Features I would like to add or find another mod for\r<br />[/size][list]\r<br />[*][size=3]Dialogue option to pay an NPC to improve an armor/weapon for you[/size]\r<br />[*][size=3]Dialogue option to pay an NPC to cure diseases you have[/size]\r<br />[/list]",
  "categoryId": "79",
  "version": "2.4.4",
  "author": "ut110",
  "createdUnix": "1463958292",
  "updatedUnix": "1481148338",
  "containsAdultContent": false,
  "uploadedBy": "ut110",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000230353",
      "name": "UT&#39;s Adjustments - using USLEEP and without cost changes",
      "version": "2.4.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65",
      "fileName": "UT's Adjustments - using USLEEP and without cost changes-75792-2-4-4.rar",
      "uploadedUnix": "1481148236",
      "modVersion": "2.4.4",
      "virusScanUrl": "https://www.virustotal.com/file/472eeb3bef42eb36a75718f5cf7c4b68d81fea1715b24ef2bc44a997d55c5dc6/analysis/1481148242/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UT%27s%20Adjustments%20-%20using%20USLEEP%20and%20without%20cost%20changes-75792-2-4-4.rar?fid=1000230353&ttl=1535864540&ri=8192&rs=8192&setec=b1c3c6fb756650ec69cee3524eb4cd8a"
    },
    {
      "fileId": "1000230354",
      "name": "UT&#39;s Adjustments - using USLEEP and with cost changes",
      "version": "2.4.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65",
      "fileName": "UT's Adjustments - using USLEEP and with cost changes-75792-2-4-4.rar",
      "uploadedUnix": "1481148281",
      "modVersion": "2.4.4",
      "virusScanUrl": "https://www.virustotal.com/file/427882758d2dc038b9f30938ae7e8390d71c7bb45124e3ea3ef2354e32c368dc/analysis/1481148302/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UT%27s%20Adjustments%20-%20using%20USLEEP%20and%20with%20cost%20changes-75792-2-4-4.rar?fid=1000230354&ttl=1535864540&ri=8192&rs=8192&setec=13d7ddfc8353af38dbc41f1b523ccfbf"
    },
    {
      "fileId": "1000230355",
      "name": "UT&#39;s Adjustments - not using USLEEP and without cost changes",
      "version": "2.4.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "66",
      "fileName": "UT's Adjustments - not using USLEEP and without cost changes-75792-2-4-4.rar",
      "uploadedUnix": "1481148311",
      "modVersion": "2.4.4",
      "virusScanUrl": "https://www.virustotal.com/file/aa22fa8ce1b17b45076d174a5f4fefb25d36b8600b9082e442c024e5220ee747/analysis/1481148362/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UT%27s%20Adjustments%20-%20not%20using%20USLEEP%20and%20without%20cost%20changes-75792-2-4-4.rar?fid=1000230355&ttl=1535864541&ri=8192&rs=8192&setec=4aa34a87b8f42406a0ec4e7dbdb95f6e"
    },
    {
      "fileId": "1000230356",
      "name": "UT&#39;s Adjustments - not using USLEEP and with cost changes",
      "version": "2.4.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "66",
      "fileName": "UT's Adjustments - not using USLEEP and with cost changes-75792-2-4-4.rar",
      "uploadedUnix": "1481148338",
      "modVersion": "2.4.4",
      "virusScanUrl": "https://www.virustotal.com/file/444fad42a00eb313468078fc620cb8014149474d21f6028cdca33ffe876af036/analysis/1481148363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UT%27s%20Adjustments%20-%20not%20using%20USLEEP%20and%20with%20cost%20changes-75792-2-4-4.rar?fid=1000230356&ttl=1535864541&ri=8192&rs=8192&setec=8b25dc457d518ff2ecd698ae5f18bcc6"
    }
  ]
}