{
  "modId": 7580.0,
  "modName": "Lost Isles -Wip-",
  "summary": "Over the time of the Elder Scrolls, is a lost, and peaceful Isle.",
  "descriptionHtml": "Much can be said out the Isles of the Forgotten, but as many know, it is a ghost. \r\n\r\nDue to many new events that have taken place, a sudden evil has risen. Only the toughest and most cunning should attempt to adventure, or even perhaps oversee this isle as their own.\r\n\r\nWill begin to start when Creation Kit has been released.\r\n\r\n[b][u]Coming in patch 0.1:[/b][/u]\r\n\r\nAdding the main Isle (Isles of the Forgotten)\r\nPopultating the Isle of trees,grass,rivers (if any), Animals, Monsters\r\nAdding the first town as well as the harbor to get from Skyrim, to the Isle\r\nAdding the first quest to get you more familer with the setting.\r\n\r\n[u][b]Looking for more Modders:[/u][/b]\r\nTexture artist for Armours and Monsters\r\nAnimations for the new Monsters\r\n\r\n[u][b]Another way to start:[/u][/b]\r\nhopefully after poking aroundthe new Script system might be able to alfter the beggining quest to \\\"ignore\\\" the main quest line of Skyrim till later on, Pre Dragon-born as we might call it. Which then once finishing the Isles will bring us to the Skyrim main quest line at a higher stage, more powerful monsters. This can be chosen to either start the normal by choosing a series of starts perhaps.\r\n\r\n[u][b]First Town:[/u][/b]\r\nWell be tested as a NON seperate cellto test how it runs.\r\nAdding a Black Smith, General Shop, Alchemy, Mage Quarter, Warrior Quarter, Assisian/Archery Quarter.\r\nSmall Island will be to the west, featuring Mage Guild of the Forgotten.\r\n\r\n[u][b]Mage Guild of the Forgotten:[/u][/b]\r\nOffers a new quest line with a new Arch Mage or even a mage that is the overseer of all others.\r\nNew Spells, Items, Scrolls, Armour.\r\n\r\n[u][b]Possible First Isle in the Expansion - Isle of Time (or a better name, open to ideas)[/u][/b]\r\nPossibe of taking back to a Oblivion gate type crisis, but on a different land,which will have a different story line behind it.\r\nMaybe one of the Demora princes have returned to finish with has been failed 200 years ago.\r\n\r\n[u][b]More to come[/u][/b]",
  "categoryId": "30",
  "version": "0",
  "author": "Elokaynu",
  "createdUnix": "1328133595",
  "updatedUnix": "1328133595",
  "containsAdultContent": false,
  "uploadedBy": "elokaynu",
  "primaryFile": null,
  "files": []
}