{
  "modId": 76.0,
  "modName": "Alchemy Assistant",
  "summary": "Program to help alchemists, multi-lingual support.",
  "descriptionHtml": "[b]SPECIAL NOTE:[/b] It has been brought to my attention that many websites are offering mods from this site, regardless of the author\\'s permissions. I do not endorse any of these other sites and recommend you download this from Skyrim Nexus before requesting support of any kind. I can not make any promises to the quality of the application offered elsewhere.\r\n\r\n[b]Version 1.4 Released, see changelog below![/b] \r\n\r\n[b]Languages Supported:[/b]\r\nAll that use CodePages: 1250, 1251, 1252, 1253, 1254, 1255, 1256, 1257 or 1258\r\n\r\n[b] Description [/b]\r\nThis tool is best suited for young alchemists who haven\\'t yet discovered all of the effects of each ingredient. It allows for multiple effects to be chosen with and/or logic. Feel free to post questions, comments or recommendations for future versions!\r\n\r\n[b] Usage [/b]\r\nIt\\'s pretty straight forward if you know how alchemy works in game. A brief run-down:\r\n\r\n- If you want to see what ingredients you need to make a specific potion, use the first tab (Effect Matching). For example, lets say you want to make a Health Potion that also Fortifies Health; in the first drop down box select \\\"Restore Health\\\", in the second select either \\\"and\\\" or \\\"or\\\" (I\\'d go with or myself), then in the 3rd drop down that is now enabled select \\\"Fortify Health\\\". That will give you a list of ingredients that has the effects you\\'re looking for, from there it\\'s just finding those ingredients in-game and making the health+ potion.\r\n\r\n- If you have a bunch of ingredients and want to know what you can make with them, use the second tab. Select an ingredient from the first drop down box, that will populate the second drop down box with other ingredients that can be paired with the first - and so on for the 3rd and 4th drop down boxes. After making your selections the bottom portion of the window will tell you what effects the potion will have by looking at the \\\"count\\\" column. A potion will only contain the effects where the count is 2 or more. For example, if you were to pick \\\"Charred Skeever Hide\\\", \\\"Hawk Feathers\\\", \\\"Mudcrab Chitin\\\" and \\\"Vampire Dust\\\" you would see that it would create a potion with these effects: \\\"Cure Disease\\\", \\\"Resist Poison\\\" and \\\"Restore Stamina\\\". \r\n\r\n[b]\\\"Not\\\", \\\"Or\\\" Mini-Documentation[/b]\r\nI wanted to give a brief description of how the \\\"Not\\\" logic works. If you\\'re wanting to eliminate multiple effects, use multiple \\\"not\\\" matches. If you use \\\"not\\\" followed by a single \\\"or\\\" the matches will include those that only match one of the selected effects in the \\\"or\\\" portion. Likewise, if you have a \\\"Not\\\" followed by \\\"Or\\\", \\\"Or\\\" the results may contain no more than two of the 3 available effects in the \\\"Or\\\" selections.\r\nExample: \r\nWhen you select \\\"Cure Disease\\\", \\\"Not\\\", \\\"Fortify One Handed\\\", \\\"Or\\\", \\\"Restore Health\\\", \\\"None\\\" you\\'ll get \\\"Hawk Feathers\\\" as a result, which does have the effect of \\\"Fortify One Handed\\\". This is perfectly normal because Hawk Feathers does not have \\\"Restore Health\\\". However, if you make the same selection but change the \\\"Or\\\" to \\\"Not\\\", Hawk Feathers will not be displayed. It works on the same basis for \\\"Not\\\",\\\"Or\\\",\\\"Or\\\" where it can match up to 2, but never 3.\r\n\r\n[b]Changelog:[/b]\r\n[b]- 1.32 - 1.4B[/b]\r\nThis is probably going to be the final release, and it will be released as a beta because I haven\\'t done a whole lot of testing with addition of ingredients that are not in the stock game. Here\\'s the changes:\r\n\r\n- Two .DB files come with the application now, Ingredients.DB and Effects.DB, both have a miniature \\\"readme\\\" section at the top that explains the usage.\r\n- I\\'ve removed all of the translations and it should now support all languages that Bethesda offers. On your first time running it asks you to choose your .strings file and the codepage to use when reading it. Because it sorts through all of the strings at run time it may take a tad longer to load than usual, but on my machine it wasn\\'t a noticeable difference. And before anyone says anything, English uses Latin characters, so you should use the Central Europe (1250) codepage. \r\n\r\n[b]- 1.31 - 1.32[/b]\r\n- General bug fixes\r\n- Removed 1 of the ingredient \\\"matchers\\\" from the 2nd tab, since you can only use 3 ingredients in-game, because of this I moved some stuff around a bit.\r\n- Added sorting capabilities to the items on the 2nd tab.\r\n- The \\\"Potion Info\\\" section now has 1 list box containing both matched and unmatched effects, they are separated into groups.\r\n- Added an update check, accessible by clicking Options -> Check for update\r\n[b]- 1.3 - 1.31[/b]\r\n- Russian was reparsed using the proper codepage and will display Cyrillic properly.\r\n- I really did set the default language to English this time, I promise!\r\n- Tweaking to the Potion Information box, you can now sort by: Effect name, Count (\\\"C\\\"), or a couple stats from the ingredients (Magnitude, Duration). The Magnitude/Duration values -are- the values used when calculating the overall potion effects along with your alchemy skill, I\\'m just missing a formula to get these values 100% correct. Also added the labels for the Potion Name, Value and Weight. The Name/Value are still out of operation, but should be filled in soon, otherwise the weight should be spot on.\r\n- Changed the ugly listboxes to listviews and added tabs to separate the name of the ingredient and the number of matches to previous selections they have. Looks a lot better imo. Sorting by matches is in the \\\"To do\\\" list.\r\n- Fixed a bug (hopefully) that causes some items to lose their formatting at various times.\r\n- I didn\\'t like the .net resize mechanics, so now the second tab (Ingrediens) has a custom resize handler.\r\n- Still waiting for the Swedish.STRINGS file parsing to be emailed to me, so next release I hope.\r\n- Fixed a typo in the spelling of the word \\\"French\\\" in French.\r\n\r\n[b]- 1.21 - 1.3:[/b]\r\n- Requested \\\"Always On Top\\\" implemented.\r\n- UI rehashed, still looks like crap but at least it\\'s not a steaming pile of crap now.\r\n- Languages supported: English, French, German, Italian, Spanish, Polish, Russian, Czech.\r\n- Added groundwork for character save game importing, and saving of settings between sessions (evident by language setting saved).\r\n- Completely recreated the Ingredients tab in order to show the most matches per ingredient selected, and show intent for the direction I want to take this project in the future.\r\n- The double-clicking feature has been around since the last release, but now it\\'s more evident by the underline and blue text. \r\n- As per evionify\\'s request I have added an automated tool that will make all potions for you in game while you go do other things. Thanks evionify, and no, Swedish is still not going to be implemented. ;)\r\nNotes: In the potion info\\'s listbox an effect will be listed as \\\"0\\\" if there\\'s only one occurrence of it because just like in game, the \\\"strength\\\" of that effect would be \\\"0\\\". This isn\\'t a bug.\r\n[b]- 1.2 to 1.21:[/b]\r\n-- Added \\\"Not\\\" to the logic dropdowns.  -- see the \\\"Not\\\",\\\"Or\\\" Mini-doc.\r\n-- You can now type in ingredient/effect names.\r\n-- Fixed a bug where \\\"or\\\" wasn\\'t working properly.\r\n-- All of the ingredients\\' effects are now known, as well as values and weights. Most of the locations are filled in also.\r\n\r\nFuture Versions:\r\n- A third tab where you can import your ingredient list from a saved game and SAA will show what potions you can make with those ingredients.\r\n- Potion Value (\\\"Ingredient Matching\\\" tab) - I\\'m not certain how the valuation mechanic works yet. If you have info please share!\r\n- Swedish requested (implemented in 1.31)\r\n- Do you have any ideas that would be beneficial? Let me know!",
  "categoryId": "39",
  "version": "1.4B",
  "author": "hexorcist",
  "createdUnix": "1321135844",
  "updatedUnix": "1346222823",
  "containsAdultContent": false,
  "uploadedBy": "hexorcist",
  "primaryFile": null,
  "files": [
    {
      "fileId": "2145",
      "name": "Alchemy Assistant",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "100",
      "fileName": "Alchemy Assistant-76.zip",
      "uploadedUnix": "1321832075",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/b38b378a9e3f93e4b63db486e511446f624baa4be54e45bbc48d7d7f19c0085b/analysis/1406427002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20Assistant-76.zip?fid=2145&ttl=1535752617&ri=8192&rs=8192&setec=dd199f14ee6c6e3534cd223ace62125f"
    },
    {
      "fileId": "3071",
      "name": "Alchemy Assistant 1_31",
      "version": "1.31",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "106",
      "fileName": "Alchemy Assistant 1_31-76.zip",
      "uploadedUnix": "1322036667",
      "modVersion": "1.31",
      "virusScanUrl": "https://www.virustotal.com/file/3f62fcc92ecfedada60d7e365f59eec20d447e288321dac7a0b66aa4f22123ae/analysis/1406437206/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20Assistant%201_31-76.zip?fid=3071&ttl=1535752618&ri=8192&rs=8192&setec=6e4867c98ca1e69a0ed83f99280c3672"
    },
    {
      "fileId": "13505",
      "name": "Alchemy Assistant 1_32",
      "version": "1.32",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "174",
      "fileName": "Alchemy Assistant 1_32-76.zip",
      "uploadedUnix": "1324730803",
      "modVersion": "1.32",
      "virusScanUrl": "https://www.virustotal.com/file/7b5238bf95e0169066e4793a3fdf494113330e0dd89d7388be633690a5355cb0/analysis/1406554392/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20Assistant%201_32-76.zip?fid=13505&ttl=1535752618&ri=8192&rs=8192&setec=c3045b45cb5ae4d8cb7f42e0419df396"
    },
    {
      "fileId": "13532",
      "name": "Alchemy Assistant 1_32-Czech Fix",
      "version": "1.32",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "174",
      "fileName": "Alchemy Assistant 1_32-Czech Fix-76-1-32.zip",
      "uploadedUnix": "1324741387",
      "modVersion": "1.32",
      "virusScanUrl": "https://www.virustotal.com/file/dbf84565a3bbe43e145187074f91fcce89541ca02d7ea6a1487f7ffa3cff93f5/analysis/1406554683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alchemy%20Assistant%201_32-Czech%20Fix-76-1-32.zip?fid=13532&ttl=1535752619&ri=8192&rs=8192&setec=efb172499a2f4fbe283f80d0a2c45750"
    },
    {
      "fileId": "85034",
      "name": "1_4 Beta",
      "version": "1.4B",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "105",
      "fileName": "1_4 Beta-76-1-4B.zip",
      "uploadedUnix": "1346222823",
      "modVersion": "1.4B",
      "virusScanUrl": "https://www.virustotal.com/file/b02fb4f318e17aa5488331252b95d4b2c053fe10fd0b3b15299f9e55006686bc/analysis/1407130323/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/1_4%20Beta-76-1-4B.zip?fid=85034&ttl=1535752619&ri=8192&rs=8192&setec=832a6cd143f235f1c1b9a05b089fd71a"
    }
  ]
}