{
  "modId": 76024.0,
  "modName": "Atronach Replacer",
  "summary": "Replaces all atronachs with the NPC + Outfit you like.",
  "descriptionHtml": "Hello everyone, after learning how to write SkyProc patchers I&#39;ve finally decided to upload my first patcher.\r<br />\r<br />What this mod does:\r<br />It allows you to replace all atronachs&#39; appearances with the NPC and outfit you specify. The appearances of Fire, Frost and Storm Atronachs are independent from each other.\r<br />\r<br />Requirements:\r<br />Java 1.8 or newer. You can download it [url=https://www.java.com/de/download/]-&gt;here[/url].\r<br />If you hate Java for trying to download toolbars, adware, not asking for an install directory, etc you really should check out, bookmark and download via this page [url=http://www.oracle.com/technetwork/java/javase/downloads/index.html]-&gt;here[/url]. Seriously, this is the better download source&#33;\r<br />\r<br />Installation:\r<br />Download and install via NMM, or download the zip file and drop it&#39;s contents into your Skyrim/Data folder.\r<br />Run the patcher that is located at Skyrim/Data/SkyProc Patchers/AtronachReplacer/Atronach Patcher.jar\r<br />\r<br />How to use the patcher:\r<br />[list=1]\r<br />[*]This is important: Wait until the patcher has imported all your mods. If you don&#39;t wait there&#39;s a possibility that the NPC or outfit you want don&#39;t show up in the patcher.\r<br />[*]Open the configuration page for any of the atronachs.\r<br />[*]Choose the NPC that your atronachs shall look like.\r<br />[*]Choose the outfit your atronachs shall wear. If you choose multiple outfits the atronach will randomly choose one every time it is summoned.\r<br />[*]Repeat Steps 3 and 4 for the other atronachs.\r<br />[*]Click Patch to create your patch.\r<br />[*]Activate the AtronachReplacer Patch.esp in your load order.\r<br />[/list]\r<br />But... why?\r<br />I was inspired to create such a replacer when I first saw loshirai14&#39;s Temptress of Flame and Temptress of Ice outfits. Considering that the Flame Atronach already looks female I decided to create a replacer (and even got loshirai14&#39;s permission at that time) only to run into compatibility issues with other mods and the problem that I&#39;d have to dictate the NPC that serves as a template. I didn&#39;t like that, so I put the project on ice. When I recently learned how to write patchers I realised, that a patcher can solve all these problems and picked the project up again.",
  "categoryId": "83",
  "version": "1.0",
  "author": "Drache198",
  "createdUnix": "1464776300",
  "updatedUnix": "1464776300",
  "containsAdultContent": false,
  "uploadedBy": "Drache198",
  "primaryFile": null,
  "files": []
}