{
  "modId": 76161.0,
  "modName": "Witcher Yennefer And Triss Armors As College Mage Robes",
  "summary": "Modified esp that enables you to craft college Novice to Master destruction robes versions of Yennefer and Triss outfits from zzjay&#39;s mod. Also converts them to cloth and makes them craftable in unenchanted version along with their amulets and other parts of outfits.",
  "descriptionHtml": "Modified esp that enables you to craft college Novice to Master destruction robes versions of Yennefer and Triss outfits from zzjay&#39;s mod. Also converts them to cloth and makes them craftable in unenchanted version along with their amulets and other parts of outfits.\r<br />\r<br />Those outfits look great in the original mod, and it already has cloth version, but since they are unenchanted you can only use them late in the game for your mages, my mod will enable you to craft college destruction robes versions of them, Novice to Master, to craft these you will need College Robe of appropriate rank, leather, leather strips, steel ingot and filled grand soul gem. That means you dont get any of them free, you need the regular robe and then craft Yennefer or Triss version using the robe as one of the ingredients. This way you can enjoy the look of those outfits early in the game, actually the moment you have enough gold to buy appropriate robes, filled grand soul gem and other ingredients. And you can keep using them as you level up and need more powerful robes.\r<br />\r<br />For enchanting convenience this mod will also allow you to craft unenchanted versions of the outfits.\r<br />\r<br />Note-this mod doesnt change anything else, the outfits can still be found in Alvor&#39;s house.\r<br />\r<br />Esp modified and uploaded as a separate mod with permission from zzjay.\r<br />\r<br />Requirements:\r<br />\r<br />Original zzjay&#39;s mod - http://www.nexusmods.com/skyrim/mods/69007/?\r<br />\r<br />Installation:\r<br />\r<br />Install original mod if you dont have it already, extract my esp to your Skyrim/Data folder, overwrite.\r<br />\r<br />Uninstallation:\r<br />\r<br />Overwrite my esp with one of the zzjay&#39;s esps.\r<br />\r<br />Obviously you will lose light armor versions of the outfits if you use my esp. I might make a version that has both light armors and my modified outfits if there is enough interest.\r<br />\r<br />Credits:\r<br />\r<br />CD Projekt Red for the armors.\r<br />Zzjay for the original mod and allowing me to modify and upload esp file.",
  "categoryId": "60",
  "version": "1.0",
  "author": "Darth Sidious",
  "createdUnix": "1465333410",
  "updatedUnix": "1465332938",
  "containsAdultContent": false,
  "uploadedBy": "Darth Sidious",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000209112",
      "name": "Yennefer And Triss Armors As Mage Robes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Yennefer And Triss Armors As Mage Robes-76161-1-0.rar",
      "uploadedUnix": "1465332938",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/42de0038310a7b445b08133071feaf3d2b535c3f29833763f847360c0e9aba54/analysis/1465332962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yennefer%20And%20Triss%20Armors%20As%20Mage%20Robes-76161-1-0.rar?fid=1000209112&ttl=1535864884&ri=8192&rs=8192&setec=ea1c3146398ba2e96f36a661e8cc53e7"
    }
  ]
}