{
  "modId": 7638.0,
  "modName": "INSS Improved New Skyrim Shadows for Ultra Settings",
  "summary": "This set of tweaks will make your Skyrim Ultra shadows look more detailed and less blocky. Also, here you can find some additional and useful information about tweaking Skyrim shadows in general.",
  "descriptionHtml": "Hey everyone!\r\n\r\nAfter finishing my work with Skyrim High shadows, I\\'ve decided to tweak Ultra shadows to my own preference. After that, I\\'ve decided to share my tweaks, as I did with Impoved New Skyrim Shadows for Medium-Range PC. Those tweaks are for those of you, that:\r\na) Don\\'t like blocky looks of default Skyrim Ultra shadows,\r\nb) want more detailed Ultra shadows and are fine with decreasing shadow draw distance in process,\r\nc) want more natural looking, fast updating, blurried shadows,\r\nd) want to optimize Ultra shadows for increased performance.\r\nThe downloadable file isn\\'t necessary, all the information will be posted in this description. This file was made from users request to be able to endorse this tweak.\r\n\r\n====================================================================================\r\nLINKS:\r\n\r\nHere\\'s a link to a video presentation: http://www.youtube.com/watch?v=mh45CUB3rwg&list=UU2X7I13W8rynWRCWX8cIX9A&index=1&feature=plpp_video\r\n\r\nHere\\'s a link to my previous tweak, Impoved New Skyrim Shadows for Medium-Range PC: http://skyrim.nexusmods.com/downloads/file.php?id=283\r\n\r\nHere\\'s a link to my newest tweak, Improved New Skyrim Shadows for Low-Range PC: http://skyrim.nexusmods.com/mods/19632\r\n\r\nIn my previous tweak, I with help of other users, made Skyrim High shadows (2048 resolution) look more acceptable. So, if you have any problems running Skyrim Ultra shadows, and don\\'t like the looks of default High shadows, you can check it out. If you want the best performance possible, you can also check out tweaks for Medium and Low shadow resolutions.\r\n\r\n====================================================================================\r\nTWEAK:\r\n\r\nAs usual, change this values in your SkyrimPrefs.ini file (it can be found in C:\\\\Users\\\\*USERNAME*\\\\Documents\\\\My Games\\\\Skyrim\\\\ directory).\r\n\r\nAlternatively, you can use a great tool called Skyrim configurator to change and manage your tweaks.\r\nhttp://skyrim.nexusmods.com/mods/814\r\n\r\nMEDIUM SHADOW DRAW DISTANCE\\\\VERY HIGH SHADOW SHARPNESS, MAX FOV UP TO 75 FOR BEST QUALITY (by defosh369)\r\niBlurDeferredShadowMask=5 (7 if you want more blurried shadows)\r\nfInteriorShadowDistance=3000.0000\r\nfShadowDistance=3000.0000\r\niShadowMapResolutionSecondary=4096\r\niShadowMapResolutionPrimary=4096\r\nfShadowLODStartFade=200.0000\r\niShadowMode=4\r\niShadowMapResolution=4096\r\nfShadowBiasScale=0.3500\r\niShadowMaskQuarter=3\r\niShadowFilter=3\r\n\r\nHIGH SHADOW DRAW DISTANCE\\\\HIGH SHADOW SHARPNESS, MAX FOV UP TO 68 FOR BEST QUALITY (by defosh369)\r\niBlurDeferredShadowMask=5 (7 if you want more blurried shadows)\r\nfInteriorShadowDistance=3000.0000\r\nfShadowDistance=3500.0000\r\niShadowMapResolutionSecondary=4096\r\niShadowMapResolutionPrimary=4096\r\nfShadowLODStartFade=200.0000\r\niShadowMode=4\r\niShadowMapResolution=4096\r\nfShadowBiasScale=0.3500\r\niShadowMaskQuarter=3\r\niShadowFilter=3\r\n\r\nHIGH SHADOW DRAW DISTANCE\\\\HIGH SHADOW SHARPNESS, MAX FOV UP TO 64 FOR BEST QUALITY (by defosh369)\r\niBlurDeferredShadowMask=5 (7 if you want more blurried shadows)\r\nfInteriorShadowDistance=3000.0000\r\nfShadowDistance=3800.0000\r\niShadowMapResolutionSecondary=4096\r\niShadowMapResolutionPrimary=4096\r\nfShadowLODStartFade=200.0000\r\niShadowMode=4\r\niShadowMapResolution=4096\r\nfShadowBiasScale=0.3500\r\niShadowMaskQuarter=3\r\niShadowFilter=3\r\n\r\nIf you didn\\'t notice any changes after adding my tweak, try setting your .ini file to read-only after adding my tweak and see if it works.\r\nIf you don\\'t have iShadowMapResolutionSecondary and iShadowMapResolutionPrimary in your SkyrimPrefs.ini, you can skip those.\r\n\r\n====================================================================================\r\nADDITIONAL BUGFIXES FOR SHADOWS:\r\n\r\nIf you wat to fix flickering shadows:\r\nShadow flickering is caused by updating sun shadows. When those shadows update, they move around causing visible flickering. This fix is making this update almost instant and takes care of any visible shadow flickering. Shadows from flowers, trees and characters will still have normal and dynamic shadows. If you want to set it to your own liking, remember that fSunUpdateThreshold is responsible for frequency of updates (higher values like 2.0 equals less frequent shadow movement, lower values like 1.0, 0.5, 0.2 or 0.0 equals more frequent shadow movement). Best stick with 1.0 or 2.0. fSunShadowUpdateTime on the other hand, is responsible for shadow movement speed, setting this value to 0 makes change instant, but if you want to shadows move when update, You can use settings like 0.15 or 0.25. Shadow update movement speed will be faster that in vanilla setting, minimizing any visible flickering. To fix this issue, edit your Skyrim.ini file (it can be found in C:\\\\Users\\\\*USERNAME*\\\\Documents\\\\My Games\\\\Skyrim\\\\ directory) and add this lines at the bottom of:\r\n[DISPLAY]\r\nfSunShadowUpdateTime=0.10\r\nfSunUpdateThreshold=2.0\r\n\r\nIf you want to minimize the shadows \\\"aura\\\" effect:\r\nNot recommended, but helpful. This will minimize shadows \\\"aura\\\" effect (small light glow around characters). To do that, you can set shadow mask quater above highest value, which is 4. In case of performance, it can cost about 4FPS, though, this loss entirely depends on your system.\r\niShadowMaskQuarter=6\r\n\r\nIf you want to fix shadows \\\"pop up\\\":\r\nNot recommended, but helpful. If you have a problem with shadows \\\"pop up\\\" in close range of the player (visible line of shadows changing their LOD), you can fix this by increasing shadow bias scale. However, increasing shadow bias scale can make character shadows a bit innacurate and slightly \\\"detached\\\". It\\'s not very noticeable and applies only in exterior, in interiors, changing shadow bias scale doesn\\'t take any effect.\r\nfShadowBiasScale=1.5000 (set to 1.5000 to completley remove the issue, but wwith detached shadows) \r\nfShadowBiasScale=1.0000 (set to 1.0000 for a good balance between fixing this issue and avoiding detached shadows)\r\n\r\n====================================================================================\r\nADDITIONAL EYE-CANDY FOR SHADOWS:\r\n\r\nPerformance cost: about 2FPS. Makes shadow filtering quality better, improves shadow quality at distance, making shadows less \\\"fuzzy\\\".\r\niShadowMaskQuarter=4\r\niShadowFilter=4\r\n\r\nPerformance cost: almost none. Helps with achieving better shadow quality. May not be compatible with ENB series.\r\nbShadowMaskZPrepass=1\r\n\r\nPerformance cost: about 4FPS to 8FPS. Better lighting quality, can be very hardware intensive on some systems. Set it at your own risk. May not be compatible with ENB series.\r\nbFloatPointRenderTarget=1\r\n\r\nPerformance cost: about 2FPS. Adds tree self-shadowing to make them look more \\\"deep\\\".\r\nbTreesReceiveShadows=1\r\n\r\nPerformance cost: none. Adds subtle shadows to land structure. It is bugged in game version above 1.8 and it may cause graphical glitches, if you have this turned on (1) you can turn it off (0) .\r\nbDrawLandShadows=0\r\n\r\n====================================================================================\r\nVERSION CHANGES:\r\n\r\nVersion 1.0 (02-02-2012) changes:\r\nRelease of my tweak with set of helpful images.\r\n\r\nVersion 1.2 (03-02-2012) changes:\r\nAdded a \\\"ground self-shadowing\\\" fix. Also, added a small notice about shadows performance after adding my tweaks and compatibility with ENB series of some additional eye-candy values. No changes to main tweak values where made.\r\n\r\nVersion 1.4 (12-02-2012) changes:\r\nAdded new, more distant version of main tweak. Use it, if you like to have more shadow draw distance and keep high shadow quality. In my new tweak, shadow draw distance will be the same as in Skyrim High shadow settings, but with Ultra quality resolution.\r\n\r\nVersion 1.6 (26-06-2012) changes:\r\nI\\'ve set interior shadow draw distance do game default Ultra value in my both tweaks:\r\nfInteriorShadowDistance=3000.0000 (from 3500.0000)\r\nDid a fine tune of \\\"more draw distance\\\" version of my tweak and I\\'ve slightly decreased shadow blurring with shadow draw distance, to increase speed of on-character shadows update time:\r\niBlurDeferredShadowMask=5 (from 7, added a note if you want more blurring)\r\nfShadowDistance=3750.0000 (from 4000.0000)\r\n\r\nVersion 1.6 (28-06-2012) additional changes:\r\nI\\'ve merged two tweak versions into one tweak and adjusted performance loss notes in \\\"ADDITIONAL EYE-CANDY FOR SHADOWS\\\" for patch 1.6 increased performance. Deleted \\\"ground sefl-shadowing\\\" bug section, it seems to be fixed now.\r\n\r\nVersion 1.6 (18-12-2012) additional changes:\r\nAdded an information about a great tool called Skyrim configurator.\r\n\r\nVersion 1.8 (01-03-2013) changes:\r\nAdded information about disabling land shadows(after newest patches, it may result in shadow glitches on ground). More importantly, I\\'ve discovered that field of view setting (FOV) may cause a significant shadow quality loss, so I\\'ve created three different tweaks and added small information about which is the max FOV for what setting, to avoid this king of shadow quality loses. For more information, I\\'ve made a video where I talk about this issue a bit more (video is based on High shadow setting and High shadow tweaks, still, this issue behaves the some for Ultra shadow resolutions), here\\'s a link:\r\nwww.youtube.com/watch?v=dc2FLhRnTLY\r\n\r\nVersion 2.0 (01-09-2013) changes:\r\nI\\'ve changed shadow bias scale to make shadow pop-up not as noticeable. Also, followed research on interior shadows of Skyrim Nexus User named Valorien, and increased interior shadows to their exterior values. Cleared things up a bit.\r\n\r\n====================================================================================\r\nFROM ME:\r\n\r\nIf you have any questions or suggestions about my tweak and Skyrim shadows in general, feel free to send me a message or leave a comment. Also, please tell me if you have any problems or if you like it or hate it :D. You can also share and use for you own tweaking as a good starting point.\r\n\r\n====================================================================================\r\nCREDITS:\r\n\r\nAuthor:\r\ndefosh369  (http://www.skyrimnexus.com/modules/members/index.php?id=3108981)\r\n\r\nFull credits list:\r\nhttp://skyrim.nexusmods.com/mods/283/?tab=1&navtag=%2Fajax%2Fmoddescription%2F%3Fid%3D283%26preview%3D&pUp=1",
  "categoryId": "62",
  "version": "2.0",
  "author": "defosh369",
  "createdUnix": "1328204771",
  "updatedUnix": "1383434987",
  "containsAdultContent": false,
  "uploadedBy": "defosh369",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000014122",
      "name": "INSS Improved New Skyrim Shadows for Ultra Settings V18",
      "version": "1.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "INSS Improved New Skyrim Shadows for Ultra Settings V18-7638-1-8.7z",
      "uploadedUnix": "1362142830",
      "modVersion": "1.8",
      "virusScanUrl": "https://www.virustotal.com/file/eb4db659d1fbcc0d57d0f5cab0d02a5f9d3c3831b79b494415520c29a5d12402/analysis/1407445784/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/INSS%20Improved%20New%20Skyrim%20Shadows%20for%20Ultra%20Settings%20V18-7638-1-8.7z?fid=1000014122&ttl=1535765824&ri=8192&rs=8192&setec=9dd099cc95ddec8e5a795e60d9dd7090"
    },
    {
      "fileId": "1000074260",
      "name": "Skyrim shadow tweaking guide - Full and updated version",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "97528",
      "fileName": "Skyrim shadow tweaking guide - Full and updated version-7638-1-0.7z",
      "uploadedUnix": "1383434987",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/14f4c27e95a54f95e65ef04a87bcfbcd0ab3b04da4b0bf4fc0adb09277c5721e/analysis/1407778953/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20shadow%20tweaking%20guide%20-%20Full%20and%20updated%20version-7638-1-0.7z?fid=1000074260&ttl=1535765824&ri=8192&rs=8192&setec=6d36b4c3b6980e75822998601f44c88a"
    }
  ]
}