{
  "modId": 76396.0,
  "modName": "Predators - The Lost Correspondence (Loadscreen mod for P-TLT)",
  "summary": "This mod adds a few loading screens dictated by an old Predator hunter by the name of Bonah Spinestrings.",
  "descriptionHtml": "Most of the information is in the readme, but here is the basics.\n<br />\n<br />I love Predators, The Lost Tribes by Roland113 (Link:http://www.nexusmods.com/skyrim/mods/24543)\n<br />\n<br />I dislike that not enough fans of Roland's delicious work are active modders. I am by no means, a good modder. As if I was, I would make a quest or some such. But to deepen the lore behind The Lost Tribes, I wanted to do SOMETHING. So, a simple mod is Loading Screen mods. I only did a few, to start a base. If you want to add to it, please go ahead and comment suggestions, and I'll add it in the next update. This is a beta, so please report the few bugs that happen. I can personally affirm that it works, and I'd like to thank a few people before I continue. \n<br />(BETA TESTERS HAVE NOT REPORTED IN, SO I DO NOT KNOW IF IT IS ONLY WORKING ON MY SYSTEM SO PLEASE LET ME KNOW IF IT ISN'T WORKING)\n<br />Roland - Lost Tribes Creator, a really great artist\n<br />Califurious - Beta Tester\n<br />YOU! - For taking the time to check out the mod\n<br />\n<br />So, yeah, obviously the loading screens are subjective and in first person. I am not the one dictating, it's a Hunter Elite in Skyrim by the name of Bonah Spinestring. He doesn't stay at the derelict ship, so that's why you won't see him. He hunts regularly, and he's the same age as the Elder of the ship. He was assigned to be your Director (this mod is very much based for a Predator character, so apologies, I may make a version for non-predators if asked), which is sort of like a mentor. As he likes to be indirect in his teaching, and his philosophy being that his student must survive by their own power, he sends you letters, hence, correspondence, discussing certain things, from Gods, to Factions, or ideas. He also talks about the Tribe here in skyrim, and how to help yourself in combat. He even addresses you as Dovahkiin, as he believes just because you're a hunter, means a lot less in comparison to the honorable title of Dragonborn. \n<br />(TL:DR version) Essentially, he's not me. He's an old, experienced, biased, and sometimes bigoted Hunter/Predator. \n<br />\n<br />(explaining File classification for those that are curious)\n<br />\n<br />It can be used by anyone, but isn't necessarily lore friendly, even though Roland has done a really good job integrating them, I know lore friendly differs from person to person, and I know some people don't consider The Lost Tribe lore friendly, so to avoid conflict, I did not put it under lore friendly. \n<br />Descriptions are quite graphic, so I did make it under extreme gore and adult only content.",
  "categoryId": "42",
  "version": "b3",
  "author": "Zorlin3321",
  "createdUnix": "1466225958",
  "updatedUnix": "1528076385",
  "containsAdultContent": true,
  "uploadedBy": "Zorlin3321",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000210202",
      "name": "The Lost Correspondence b1",
      "version": "b1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "The Lost Correspondence b1-76396-b1.rar",
      "uploadedUnix": "1466225953",
      "modVersion": "b1",
      "virusScanUrl": "https://www.virustotal.com/file/4ceec570768f7e7d3a0fb1613bf9ed9b4052e46b74a6f35cf56aec19d328c72b/analysis/1466226004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Lost%20Correspondence%20b1-76396-b1.rar?fid=1000210202&ttl=1535865130&ri=8192&rs=8192&setec=36c0c9d8d80f11c0430cc15ba039b35f"
    },
    {
      "fileId": "1000258735",
      "name": "Beta 2",
      "version": "b2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Beta 2-76396-.rar",
      "uploadedUnix": "1509631588",
      "modVersion": "b2",
      "virusScanUrl": "https://www.virustotal.com/file/a4e8dbcf112538cb46a1b897c2463da5a63f2942dd94d4f2bb44999d75abeee3/analysis/1509633602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beta%202-76396-.rar?fid=1000258735&ttl=1535865130&ri=8192&rs=8192&setec=72e5029669a78fedfd2843a9c40fd202"
    },
    {
      "fileId": "1000274464",
      "name": "Beta 3",
      "version": "b3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Beta 3-76396-b3.rar",
      "uploadedUnix": "1528076385",
      "modVersion": "b3",
      "virusScanUrl": "https://www.virustotal.com/file/e1210c652c3adac727a4a9c9d5745459b659db91f003038787137c41d692f27c/analysis/1528076463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beta%203-76396-b3.rar?fid=1000274464&ttl=1535865130&ri=8192&rs=8192&setec=d6699ff72cde9e358b37d98c179c0025"
    }
  ]
}