{
  "modId": 76431.0,
  "modName": "TrueMorrowindAtronachSign",
  "summary": "Makes the Atronach sign function just like Morrowind- with more Magicka, stunted Magicka- being unable to naturally regen magicka but also the ability to absorb Magicka from Magicka Wells- VERY similar in function to Morrowind&#39;s shrines as an Atronach sign character.",
  "descriptionHtml": "[color=#00ffff][b]Update: In the newest version TrueMorrowindAtronachDLCsFixd a script has been added to remove other doomstones so you permanently have the Atronach sign just like Morrowind, and can&#39;t accidentally mess things up anymore.\r<br />\r<br />How to Use: I recommend you use SOME mod or another that gives permanent doomstones, select a doomstone from said mod (like one of the three doomstones near the Chargen cave), activate said doomstone, then cast the &#34;Atronach Doomstone Status&#34; spell, and answer yes if you want the Atronach sign. This will make for the most Morrowind-Like experience possible, and will make this mod work properly. One such mod that does that is Requiem, though other permanent doomstone mods may exist.\r<br />[/b][/color][color=#980000]\r<br />[color=#00ffff][b]My Morrowind Atronach mod doesn&#39;t REQUIRE any other mods, just it helps to have another mod of your choice that will prevent a bug from happening if you try to activate a mundus stone after activating the Atronach sign from this mod.[/b][/color][/color]\r<br />\r<br />[color=#f1c232][i]Download TrueMorrowAtronachFullVanilla if you don&#39;t have Dragonborn or Dawnguard, TrueMorrowAtronachDragonborn if you only have Dragonborn, and DL [/i][/color][color=#f1c232][i]TrueMorrowindAtronachDLCs if you have both Dragonborn and Dawnguard.    [/i][/color]                                                                                                      \r<br />\r<br />[color=#00ff00][b]Short and simple version in bolded green.\r<br />\r<br />Makes the Atronach sign function just like Morrowind- with stunted Magicka- unable to naturally regen magicka but also the ability to absorb Magicka from Magicka Wells- VERY similar in function to Morrowind&#39;s shrines as an Atronach sign character. A permanent birthstone mod to go with this is also heavily recommended. You will start out with a spell called &#34;Atronach Doomstone Status&#34; the game will ask you if you want to have the Atronach or not, answer yes if you do... Note: If you DO use another mod for permanent signs I HEAVILY SUGGEST you activate a doomstone first- ANY doomstone to be honest, THEN cast this spell. From then on you will play just like how the Atronach sign functions in Morrowind.\r<br />\r<br />[b]The Atronach sign will also give you 350+ Magicka regardless of whatever mods you use.[/b] [/b][/color]\r<br />\r<br />Alright alright I&#39;ll be honest- this idea is 60% inspired by Morrowind as the Atronach sign 40% inspired by Deus Ex invisible War where you had to use Energy Cells like Magicka Potions, and go up to these Maintenance/Repair bots to get energy back- which works very similar to the Atronach sign from Morrowind. Some people believe it is a glitch or bug or oversight in Morrowind- me on the other hand, even if it was a bug, I think it&#39;s one of those rare bugs that is a good gameplay mechanic, making up for the Atronachs weakness of no auto regen or no regen from sleeping... And I think it actually makes sense a character who is more like an Atronach would absorb Magicka from their environment rather than naturally generate it themselves.\r<br />\r<br />Before you ask, I tried numerous times to make a Stunted Magicka effect, that goes on and off dependent on rather or not you have the Atronach stone, and other than a choice dialogue script every single other If thing was too buggy to work EVEN when it compiled properly and had properties, so the dialogue box thing is necessary, especially to ensure this mod is as compatible as possible. I choose Magicka Wells, because Ayleid Wells wouldn&#39;t be lore friendly, and altering vanilla shrines would be far likelier to conflict with other mods- and wouldn&#39;t make as much sense in the places I placed these shrines.\r<br />\r<br />This mod does NOT alter the vanilla Atronach perk or spell at all- so even hypothetically speaking the ONLY POSSIBLE thing this mod does that could even hypothetically cause conflicts- is it adding various Magicka Wells to various parts of Skyrim. Most of these are fairly close to if not inside major cities... A few are in certain dungeons that will only be mentioned in the Spoiler Readme. Part of the fun IMO is finding these Magicka Wells. Most of the ones in dungeons are in Draugr crypts- resembling a similar mechanic with shrines in Morrowind tombs, although not every single Draugr crypt has said shrine. Saying anything beyond that is spoiler territory... If you want to know where they all are, well then look at the Readme.\r<br />\r<br />I&#39;ll let you in on a little secret: It doesn&#39;t actually add the VANILLA Atronach sign, even though it acts exactly like Morrowind&#39;s pretty much, and this is how I have bypassed potential mod conflicts.\r<br />\r<br /> As a balancing factor I added an additional effect where whenever you withdraw Magicka from a Magicka Well you are 80% weaker to Magicka for about 1 minute... And if you SPAM this it will stack, so you have to at least use a TINY BIT of strategy with this.",
  "categoryId": "24",
  "version": "",
  "author": "Lectra",
  "createdUnix": "1466339859",
  "updatedUnix": "1467486434",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000210348",
      "name": "TrueMorrowAtronachFullVanilla",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "111",
      "fileName": "TrueMorrowAtronachFullVanilla-76431-.7z",
      "uploadedUnix": "1466336721",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8404b874694adc4ee3d6b6520875bc5dcf06a6d8d7770f6c7f7f42e2b29709b3/analysis/1466347742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TrueMorrowAtronachFullVanilla-76431-.7z?fid=1000210348&ttl=1535865165&ri=8192&rs=8192&setec=a969fa9bf24d530b1a3354da213b1bcd"
    },
    {
      "fileId": "1000210353",
      "name": "TrueMorrowAtronachDragonborn",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "114",
      "fileName": "TrueMorrowAtronachDragonborn-76431-.7z",
      "uploadedUnix": "1466339240",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/827c64221206cb313690ff89e1c9294894d6e85a7c4e2d17300648acb91dabc9/analysis/1466339283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TrueMorrowAtronachDragonborn-76431-.7z?fid=1000210353&ttl=1535865166&ri=8192&rs=8192&setec=0e1214dddf1d8e49335eab55ee70a44e"
    },
    {
      "fileId": "1000210354",
      "name": "TrueMorrowindAtronachDLCs",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "114",
      "fileName": "TrueMorrowindAtronachDLCs-76431-.7z",
      "uploadedUnix": "1466339308",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d7d4fe4434594e902e3eea9073ee237f71ddd2ba511c70f1d853a65c9205bb6e/analysis/1466339343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TrueMorrowindAtronachDLCs-76431-.7z?fid=1000210354&ttl=1535865166&ri=8192&rs=8192&setec=90abb0da38f7e56f19f0890ff5faeb1f"
    },
    {
      "fileId": "1000211888",
      "name": "TrueMorrowindAtronachDLCsFixd",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "121",
      "fileName": "TrueMorrowindAtronachDLCsFixd-76431-.7z",
      "uploadedUnix": "1467486434",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e42019ed7db99304a715ecd4a8e41dd1efa72f594b6bdb1a8e0893667281d0de/analysis/1467486484/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TrueMorrowindAtronachDLCsFixd-76431-.7z?fid=1000211888&ttl=1535865167&ri=8192&rs=8192&setec=67d019716ad7f37ab524a7e27b90c679"
    }
  ]
}