{
  "modId": 76450.0,
  "modName": "Master Craftsman",
  "summary": "This mod is a major enhancement to the crafting experience. A player can now advance through the crafting related skill trees by being trained. Some of the other activities that relate to crafting have also been modified. Some unique items have been added, as well as a player dwelling.",
  "descriptionHtml": "[color=#ffffff][font=Calibri][size=3]This mod is a major enhancement to the crafting experience. It impacts three aspects of the game. It alters the way a player can advance through the crafting related skill trees (ie Alchemy, Enchanting, and Smithing), including modifications to some of the other activities that relate to crafting,  it adds some unique items to the game that can be improved and enchanted, and it adds another player dwelling which has all the crafting stations.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Features:[/b][/size][/font]\r<br />[font=Calibri][size=3]Can buy crafting perks[/size][/font]\r<br />[font=Calibri][size=3]Enchanted pickaxe that adds twice as many ore, except for iron[/size][/font]\r<br />[font=Calibri][size=3]Unique Items that can be Enchanted and Improved[/size][/font]\r<br />[font=Calibri][size=3]Enchanted Arrows from Vendors, and enchanted arrows you can craft[/size][/font]\r<br />[font=Calibri][size=3]Can craft Lunar Forge weapons[/size][/font]\r<br />[font=Calibri][size=3]Bag of Holding for all your stuff[/size][/font]\r<br />[font=Calibri][size=3]Increased Vendor Gold for Whiterun vendors and some other major vendors[/size][/font]\r<br />[font=Calibri][size=3]Player dwelling, Sanctuary, with lots of space to move in and craftitems[/size][/font]\r<br />[font=Calibri][size=3]Dragon Priest Mask busts in Sanctuary for displaying the masks[/size][/font]\r<br />[font=Calibri][size=3]A number of unique items to find and display[/size][/font]\r<br />[font=Calibri][size=3]Optional method to complete the Unusual Stone quest[/size][/font]\r<br />[font=Calibri][size=3]Housecarls wearing leisure clothes[/size][/font]\r<br />[font=Calibri][size=3]Fixed the Lost Apprentice quest, and made their items enchanted.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[/color][color=#ffffff][font=Calibri][size=3]Playing Skyrim I was really interested in immersing myself within the crafting aspects of gameplay, but the longer I played the more frustrated I became that I only had one perk per level to apply to the many possible perk enhancements. I was forced to sacrifice becoming a better stealth/archer/mage type character in order to use my perks on becoming a master anything craftsman. I was also frustrated that there were prerequisite perks that I may not have wanted but that I had to use my precious one perk on in order to advance up the tree to a point where I could finally get a really desirable perk, especially true of Smithing.  So by level 50, I was not a master craftsman of anything (I spent some perks on character development) and had pretty much played most of the quests (there\r<br />were still a number of dungeons).[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3]These are the changes I made to the crafting experience. [/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Crafting Training (Perks)[/b][/size][/font]\r<br />[/color][color=#ffffff][font=Calibri][size=3]I took a minor character in Shor’s Stone, Filnjar, and made him a master craftsman, also essential. You can now go to him and buy training\r<br />(perks) in any of the three crafting skill trees. The only limitation, is that you still need to be the same skill level as required to gain the desired perk within the game, with a couple of exceptions for level 100. There are no longer any prerequisites, so now if you are Smithing level 90 and you want to be able to smith Daedric armor, you just go to Filnjar and pay 5000 gold to be trained. If that is the only smithing skill that you want then you do not need to be trained in any other smithing skills. And you can use all your level up perks on things like becoming a true dual wielding pickaxe Berserker.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Unique Items that can be Enchanted and Improved[/b][/size][/font]\r<br />[font=Calibri][size=3]I created some non-enchanted weapons and armor from the unique in game items and placed them around Skyrim, location can be found by looking at a map on the wall in the study of Sanctuary. By activating the location flag on the map it will add that location to your inventory map. Also, listed in the readme. Now you can double enchant some very nice stuff with the enchantments you want and call it that really cool name. [/size][/font][font=Calibri][size=3]I created some unique texture outfits. There are un-enchanted versions of the Phantom armor and Mesmer robes in the bedroom wardrobe in Sanctuary. These you can enchant, improve and rename to suit your character style.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Enchanted Pickaxe[/b][/size][/font]\r<br />[/color][color=#ffffff][font=Calibri][size=3]To be a Smith, you need to mine/obtain ore. It seemed to me that there were too few specialty ore veins, so you were left to buying all the ebony ore you could get your hands on, which to me was less satisfying than mining it for free. So I created an enchanted pickaxe that doubles the amount of ore one mines. Iron ore is excluded as it is plentiful and it is not much fun smithing iron items anyway. The pickaxe is located in Ustegrav, part of the main quest, in the area with the word wall. It is located near the silver ore vein and a skeleton (Ancient Miner). I created a new texture to make it more unique. The pickaxe head is made from forged malachite and it has a carved bone handle. You need to equip it to gain the extra ore benefit. While developing this mod I added a debug popup message to ensure that all was working correctly. When I went back to remove the message, it was no longer in the script, but it still popped up. So when you are mining with the enchanted pickaxe, you will have to OK the message, I apologize in advance, still it is not overly annoying. Just\r<br />an extra unneeded step.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Enchanted Arrows from Vendors[/b][/size][/font]\r<br />[font=Calibri][size=3]The arrow fletcher in Solitude now sells a couple of enchanted arrows, still not strong enough to take down a dragon. Likewise the owner of the Drunken Huntsman in Whiterun sells a couple of enchanted arrows. [/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Lunar Forge[/b][/size][/font]\r<br />[font=Calibri][size=3]Learn how (and when) you can craft lunar enchantment weapons. There is a book near the forge that provides the details. Weapons must be crafted at the Lunar Forge.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Bag of Holding[/b][/size][/font]\r<br />[/color][color=#ffffff][font=Calibri][size=3]To increase your skill level you can improve items, but you are really limited on how much you can carry. So if you have been doing a lot of mining and collecting items to improve, you soon, very soon, run out of strength to carry all that stuff. I also like to collect everything unique or cool or valuable or whatever and it just does not feel right to be looking for crafting stations all the time. So I created a bag of holding from the apothecary satchel. I am not an object oriented programmer so my implementation of the bag is pretty simple, unlike a couple of the other bags available on the Nexus. But it still works just fine for me. Basically, you must drop the bag from inventory and then pick it back up. When you add it to inventory it opens up a container inventory window and you can add and remove items from the bag. Just a word of caution, I dropped the bag a couple of times and it bounced off somewhere and I could not find it. I typically save often so it was not too much of a pain, but be aware that it may bounce off somewhere depending on where you drop it, like near a wall, and be difficult to find or see. I also created a unique texture for it, it is made from snow sabre cat hide and the hair is left on, there is also a hargraven claw that is used to secure it closed. The bag can be found on a Kahjiit thief named Abu bin A&#39;zar in Bleak Falls Barrow near Riverwood. He is in the last chamber with the word wall, off to the right side as you enter and up on a ledge, but not hard to find. He also has a complete set of enchanted leather armor, Phantom Armor, that is designed for a stealth type player, it is retextured to be darker. Abu also has an enchanted ring that allows breathing under water, an enchanted dagger that has soul trap and paralyze, and a spell tome that teaches Teleport to the player dwelling I created.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3] [/size][/font][font=Calibri][size=3][b]Increased Vendor Gold[/b][/size][/font]\r<br />[font=Calibri][size=3]I created a leveled item list for the amount of gold that vendors have to buy stuff from you. Since you have a bag of holding, you can collect a lot of stuff to sell. All the main vendors in Whiterun now have more gold to buy stuff. There are also one or two main vendors in the other major townships that will have extra gold. The amount of gold available depends on your level and it is not in the thousands, it is just two to four times what they would normally have, but it allows them to buy a lot of stuff.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Player Dwelling - Sanctuary[/b][/size][/font]\r<br />[/color][color=#ffffff][font=Calibri][size=3]I like to create my own dwelling in game, Sanctuary. Skyrim has a couple of nice dwellings but with the Teleport spell I can teleport back and forth to my dwelling at any time. To exit the dwelling you activate a teleport control panel on the teleporter. It can send you back where you came from or to the roof of a building in Whiterun. I like to sell a bunch of stuff after crafting it. If you teleport after going to Whiterun it will take you back to the place you originally teleported from. Sorry, but because I am teleporting, followers do not teleport, but they do remain where you were till you return without having to tell them to wait. Not sure I want them messing around my dwelling anyway helping themselves to my Laffy Taffy and Colovian Brandy.[/size][/font]\r<br />[/color][font=Calibri][color=#ffffff][size=3]Sanctuary is laid out with lots of storage and display space, includinga number of mannequins, bookcases and weapon racks. I even created one display case for daggers. There are also four pedestals that accept books for displaying unique books. Book shelves now need either large, regular or journal size books, as stated when you cursor over activator box. The weapons racks, mannequins, and book placers are in game items so they still occasionally act strange or are difficult to use, not my fault, it is a bug with the game whenever the game resets. Part of the reason I created three book shelf placers. If you cannot take a weapon from the rack, you can tcl from the console and should be able to grab the weapon from the backside, so it is not totally lost anyway.  [/size][/color][/font][color=#ffffff][font=Calibri][size=3]Sanctuary has one each of all the crafting stations. I also added an enchanted arrow crafting station for crafting a few unique arrows. There is a book and recipe list that tells you what ingredients you need. You place the ingredients in the Components for Arrows chest, use the Arrow Crafting Anvil, and collect your arrows from the Arrow chest. Some enchantments act a little funny, I guess because Skyrim was not designed to support them. The implementation is also a lot more cumbersome that Oblivion, which was straight forward and simple. For some reason the enchantment sometimes seems to attach to the bow, especially paralyze, at least momentarily, so that if you change arrow types it does not recognize the different enchantment right away. I also noticed that if you shoot an archer, for some reason they can now shoot you\r<br />with the enchanted arrow, though not always. Maybe some NPC&#39;s can shoot your arrows back at you, I do set the recover option so the NPC may can use the arrow also. If anyone knows if I may be causing it and what I am doing wrong, I might be able to fix the problem. [/size][/font]\r<br />[font=Calibri][size=3]There is also a brewing station, in the alchemy area, that can be used to make an elixir, Ichor of Mundane, that casts a storm cloak on your person with toned down visuals. It is not overly strong, but functions like any other cloak spell.  Place ingredients in the ichor barrel and retrieve the elixir from the other barrel. [/size][/font][font=Calibri][size=3]There is a Skyrim map in the study that will mark the location of unenchanted items and the three Dragon Priest masks that affect crafting on your map.[/size][/font]\r<br />[font=Calibri][size=3]Created a number of unique &#39;art&#39; pieces. Created some unique staff(mainhall) and weapon rack(enchanting area) textures. Modified the enchanting station bust. [/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[font=Calibri][size=3][b]Dragon Priest Masks[/b][/size][/font]\r<br />[font=Calibri][size=3]I added the Dragon Priest mask busts to the player dwelling, so now you can either display them in Sanctuary or leave them in Labyrinthian. I modified Moroki to increase enchanting by 20 percent, Vokun to increase smithing by 20 when worn, and their busts are near their respective crafting stations. Krosis already increased alchemy, so I did not change it.[/size][/font]\r<br />[font=Calibri][size=3] [/size][/font]\r<br />[/color][color=#ffffff][size=3][font=Calibri][b]Unique Items[/b][/font]\r<br />[font=Calibri]Phantom Armor is a darker texture of selected Thieves Guild and Mage armor pieces. The combined effect is an effective armor style for a Master Thief / Stealth character. Found on the Master Thief Abu bin A&#39;zur in Bleak Falls Barrow to the right on a ledge in the last area with the Word Wall. The enchantments are also suited for this style of character. Improve using leather.[/font]\r<br />[font=Calibri]Mesmer Robes are re-colored Psijic Monk robes with the belt buckle meant to look like an eye. For bathing enemies in hypnotic light. Enhancements are suited for an Illusionist type character, but still effective for any mage type.  These are found in Shrouded Hearth Barrow in the hidden room near all the skeletons. [/font]\r<br />[/size][/color][color=#ffffff][size=3][font=Calibri]Charlatan Outfit is taken from selected upper status outfits and re-colored to all match pretty well so that it looks very nice together.\r<br />Enhancements are suited for a charming character type that can influence NPC&#39;s perception of themselves. It is found in the wardrobe near you master bed in Sancutary.[/font]\r<br />[font=Calibri]Glamorous Garment is re-colored wench outfit with better matching boots. You can find it at Radiant Raiment in Solitude. Female followers will now be making a fashion statement. It is also enchantable. [/font]\r<br />[font=Calibri]I added a number of unique items to the game and scattered them around,the location and name of each item is provided in the readme file. As an example, I created miscellaneous items from the thieves guild jeweled tableware and added them to unique treasure chests. I did the same with the gold tableware from Sovengard. They are leveled lists so there is only a chance of obtaining any particular item. But now there is a chance that you can find a jeweled goblet to decorate your dwelling with. [/font]\r<br />[font=Calibri]After giving the requested items to the Bard’s at the college, they will give you a uniquely textured lute, flute and drum. [/font]\r<br />[font=Calibri]Four apothecaries now have a unique potion each that grants the drinker a frost cloak with toned downed visuals, poison cloak, the ability to walk on water, and nighteye. [/font]\r<br />[font=Calibri] [/font]\r<br />[font=Calibri][b]Daedric Quest Changes[/b][/font]\r<br />[/size][/color][color=#ffffff][size=3][font=Calibri]I like to collect unique items, but dislike being an evil aligned character to get it, I am not a Paladin either. So I changed a couple of the\r<br />Daedric quests. If Eola dies she will have the ring of Namira on her corpse. If you do not kill Erandor in order to obtain the Skull of Corruption, let him go ahead and think he is banishing it, it will appear in Sanctuary near the enchanting table, you teleported it there at the last second. The Oghma Infinium now remains in inventroy, but does not grant additional increases when read.[/font]\r<br />[font=Calibri] [/font]\r<br />[font=Calibri][b]Unusual Stone Quest[/b][/font]\r<br />[/size][/color][color=#ffffff][size=3][font=Calibri]I modified the way the Unusual Stone quest progresses. This quest was really frustrating for me, I mean you find this strange stone and once you pick it up, the only way to get rid of it is to join the Thieves Guild and work with Vex. So if you are like me and not interested in joining the Thieves Guild for my master archer elf, then you have to hack the game to remove the stones. Bethseda could have just had the stones disabled until you join the Guild and talk to Vex. So forget all that stuff, now you can go to Balimund the blacksmith in Riften and show him the stone. He will help you complete the quest. Complete the quest either way and the Crown will then be placed in Sanctuary where you can enjoy it.[/font]\r<br />[font=Calibri] [/font]\r<br />[font=Calibri][b]Housecarls[/b][/font]\r<br />[font=Calibri]Seemed odd to me that the housecarls default to wearing armor, for me one of the first things I did with the housecarl follower was to give them better armor and weapons. So I removed the armor and weapon for the housecarl and gave them casual clothing and a dagger. They look much better to me wandering around the in game dwellings in comfy clothes.[/font]\r<br />[font=Calibri] [/font]\r<br />[font=Calibri][b]Additional Enhancements[/b][/font]\r<br />[/size][/color][color=#ffffff][size=3][font=Calibri]I created some playable quest, now non-quest checked, items that are normally removed from play after completing the quest. They do not change the in game quest item that they represent. The Dragonstone that Arengar takes now shows up on his table where he studies it, and you can steal it. The elder scroll remains in your inventory after you read it during the main quest. It now just causes the disorienting effect without the quest related storyline, the scroll can also be dropped from inventory and placed in your dwelling, there is a display case sized to fit the scroll in the study. The Reachman Map is added to inventory when activated.[/font]\r<br />[/size][/color][color=#ffffff][size=3][font=Calibri]I fixed the broken mage guild quest for missing apprentices. Talking with Phinis Gestor after locating the remains of a student just completes that part and he gives you an item at the end. I also enchanted the unique items that you find and get to keep. Ysiri’s necklace has a fire cloak enchantment that is pretty fun to use. And Iles Tei’s ring has a frenzy spell associated with it, be careful around townsfolk.[/font]\r<br />[font=Calibri]At Silent Moons forge there is a Lunar Forge book that when read will teach you how to forge lunar weapons. I thought it was interesting that there were lunar weapons in game but no way to forge them. You can also improve them with iron or steel respecitvely. [/font]\r<br />[font=Calibri]Corrected a number of book titles, and mismatched multi-volume series, they now all have complementary book types and textures for each set of volumes.[/font]\r<br />[font=Calibri]Kilkreath spirits now have ectoplasm in inventory instead of bone meal.[/font]\r<br />[font=Calibri]Odfel now has Rocksplinter pickaxe like he was supposed to. [/font]\r<br />[font=Calibri]Changed the Radiant Raiment outfit you get during that quest to Yarl 3.[/font]\r<br />[font=Calibri]Changed the Argonian Ale and Dragon&#39;s Breath Mead textures. Since Argonian Ale is part of a quest, there are two slightly different bottles that you can get.[/font]\r<br />[font=Calibri]Placed sapphire Dibella statue in Temple Inner Santuary, near throne.[/font]\r<br />[font=Calibri]Fixed the world model for the Essence Extractor that you get to keep after Sergius quest for blood.[/font]\r<br />[font=Calibri]Renamed deer pelt and hide to elk.[/font]\r<br />[font=Calibri]Pumpkin the fox now has Pumpkin Pelt death item.[/font]\r<br />[/size][/color][font=Calibri][color=#ffffff][size=3]I created voice files for all the dialogue, sorry but I am not a good mimic of the in game voice actors, but at least the dialogue is there.\r<br />\r<br />This is a Big Dog Production.[/size][/color][/font]",
  "categoryId": "100",
  "version": "1.0",
  "author": "Balarithon",
  "createdUnix": "1466424231",
  "updatedUnix": "1466424209",
  "containsAdultContent": false,
  "uploadedBy": "balarithon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000210467",
      "name": "Master Craftsman",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "52056",
      "fileName": "Master Craftsman-76450-1-0.7z",
      "uploadedUnix": "1466424209",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6291d55da3c0c3d4bafab4f89619f226de494f28b8cb55427d1496d2a35097ad/analysis/1466435235/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Master%20Craftsman-76450-1-0.7z?fid=1000210467&ttl=1535865192&ri=8192&rs=8192&setec=2b6150bed2a1ba38e7f109f98e26076d"
    }
  ]
}