{
  "modId": 76535.0,
  "modName": "Tiny Midden improvement",
  "summary": "adds tiny details to the midden, including an anvil, arcane enchanter, and a new weapon.",
  "descriptionHtml": "when I say tiny, I mean it.\r<br />\r<br />This mod adds just a few things: an enchanter, a new weapon, a sarcophagus where the draugr is, an anvil and grindstone... yeah that&#39;s pretty much it. \r<br />\r<br />the weapon is an enchanted woodcutter&#39;s axe, which can&#39;t be disenchanted. it&#39;s unique in that it&#39;s stronger than the usual axe, with infinite charge absorb health enchantment. for balancing, the axe strikes slower than the normal one, and the absorb health enchantment is relatively weak. To temper it you need a steel ingot and bone meal. \r<br />\r<br />Idk, I was bored when I made this and I wanted something unique to the midden besides the atronach forge. I also added a torture chamber to the same room where you find the axe, nothing much, just a torture rack, some shackles, and a bloody wooden block to where the &#34;altar&#34; was in the vanilla game. (no seriously, what was that room with the deer skull on the wall supposed to be? cause it looked like an altar to me. now the room makes sense, at least in my opinion)\r<br />\r<br />\r<br />nothing required, just skyrim. no dlcs needed. and Idk about how compatible this is to other mods that change the midden, but it should be compatible. all I did was add the stuff you see in the pictures, so nothing should be messed up.",
  "categoryId": "91",
  "version": "1",
  "author": "yours truly ",
  "createdUnix": "1466623796",
  "updatedUnix": "1466623792",
  "containsAdultContent": false,
  "uploadedBy": "paulhanna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000210745",
      "name": "midden addon",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "midden addon-76535-1.rar",
      "uploadedUnix": "1466623792",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/56a64f4c48edc463871c12011d14e893f0df2277e9daca4faaa047695dda8698/analysis/1466623802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/midden%20addon-76535-1.rar?fid=1000210745&ttl=1535865263&ri=8192&rs=8192&setec=88e35b1f1e96a0afb0beb655f488fa94"
    }
  ]
}