{
  "modId": 76738.0,
  "modName": "The effects of death",
  "summary": "Instead of death, the hero will suffer its consequences ...",
  "descriptionHtml": "Author: [url=http://www.nexusmods.com/skyrim/users/3797651/?]wituswitus[/url]\r<br />Latest Version: 22.\r<br />English translation: [url=http://www.nexusmods.com/skyrim/users/8797611/?]Alexandriel.[/url]\r<br />Language: Russian, English.\r<br />\r<br />For the fans of hardcore games.\r<br />\r<br />Description (it&#39;s a short version of the description, because it&#39;s hard to translate some of the remarks from Russian to English, so I will describe the core functions of the mod):\r<br />\r<br />Instead of death, the hero will suffer its consequences ...\r<br />\r<br />Why do we need this?\r<br />- because of F5-F9 you never feel the fear to die. Indeed, casual gameplay.\r<br />- there are mods for ultimate hardcore like Dead is Dead, but it&#39;s very hurts to fully die in Skyrim, where you have already made and developed your character, especially from some random bug.\r<br />- with this mod you will feel the hardcoreness, but reasonable amount. Adrenaline in the battle will be several times higher, because you will think 7 times before doing any action, fear of losing armor and gold will make you think carefully, cautiously go through the game. Without even noticing, you will see the game in minute detail. Like in games like Diablo, DarkSouls.\r<br />\r<br />The idea of this mod is similar to [url=www.nexusmods.com/skyrim/mods/29312/]NoDeathMod[/url]. But the author of NoDeathMod forget about his mod long time ago. Because of this it contains errors.\r<br />\r<br />In the Effects Of Death mod, when you die, next steps happen:\r<br />1. You do not die, but start to &#34;bleed&#34;. This is where the scripts start working.\r<br />2. You will be teleported onto the one of the places of resurrection.\r<br />When ressurecting:\r<br />- you will observe some unusual effects;\r<br />- Aggression will be removed from all your opponents and companions (from everybody);\r<br />- Inventory will be cleaned (as you&#39;ve seted in the MCM-menu);\r<br />- Just in case the player will enter the invulnerability mode;\r<br />- Damage of attributes (as you&#39;ve seted in the MCM-menu);\r<br />- Damage of player&#39;s skills (as you&#39;ve seted in the MCM-menu);\r<br />- Starts quest for the retreiving your goods (or no quest starts) (as you&#39;ve seted in the MCM-menu);\r<br />Types of quest:\r<br />- no quest;\r<br />- Keepers and Chest;\r<br />- Skeleton of the Dovahkiin (Diablo-like feature);\r<br />\r<br />All these options you can look at and adjust in the MCM-menu. Fully translated as well.\r<br />\r<br />Some remarks:\r<br />- you better to not die in Helgen, because teleportation will be in this case as well;\r<br />- if you in location, where doors are locked for the time of the battle (f.ex. Companions quest, or in battle with Malkoran in the temple of Meridia), you better save before and load if you die, because, Vanilla scripts will be working and you will not be able to open the door.\r<br />\r<br />Compatible with Frostfall&#39;s and Realistic Needs and Diseases&#39; deaths (from cold and thirst).\r<br />\r<br />Required files:\r<br />- Skyrim 1.9+ plus all DLC\r<br />- [url=http://skse.silverlock.org/]SKSE 1.6+\r<br />[/url]- [url=http://www.nexusmods.com/skyrim/mods/3863/]SkyUI 5+[/url]\r<br />\r<br />[i]Russian description[/i]\r<br />[spoiler]\r<br />Автор: witus (www.nexusmods.com/skyrim/mods/76738/)\r<br />Версия: 22\r<br />Язык: русский, английский\r<br />\r<br />Любителям хардкора посвящается&#33;\r<br />\r<br />Описание:\r<br />Вместо смерти герой будет испытывать её последствия...\r<br />\r<br />\r<br />А оно нам надо?\r<br />- При смерти игрока мы обычно загружаем сохранение и идём пытаться преодолеть трудности снова. Таким образом умирать в принципе абсолютно не страшно. Т.е. можно в одних трусах мордовать скайрим-живность и путем сохранился-загрузился пройти всю игру. Также можно в куче дорогой экипировки и с тоннами драгоценного хабара слиться под драконом, а потом спокойно загрузиться и пройти игру дальше.\r<br />- Чтобы действительно почувствовать хардкор в игре некоторые игроки просто играют с одним сохранением, а при смерти начинают игру заново. Но помереть таким образом после месяца игры очень блин обидно. Также можно помереть от лагов, внезапных респов монстров и прочих не логичных явлений.\r<br />- С этим модом хардкор как раз появляется в разумной своей доле. Адреналин в битве будет уже в разы выше, ибо вы будете 7 раз думать, прежде чем кого-то один раз зарезать). Страх потерять шмот и золото заставит вас думать тщательнее, проходить игру осторожнее. Сами того не замечая вы увидите игру в мельчайших деталях. Подобное было в игре Diablo, DarkSouls.\r<br />\r<br />\r<br />Подробное описание.\r<br />Идея мода была взята у мода NoDeathMod (www.nexusmods.com/skyrim/mods/29312/). Но автор мода давно на него забил. Кроме того у данного мода не всегда всё нормально работает из-за неправильно выбранных событий и условий в скриптах.\r<br />\r<br />\r<br />В данном моде у нас при смерти будет следующее:\r<br />1. При вашей смерти вы не помираете, а начинаете &#34;истекать кровью&#34;. Тут-то и запускается скрипт для обработки &#34;смерти&#34;.\r<br />2. Далее вы телепортируетесь в одно из мест воскрешения.\r<br />При воскрешении:\r<br />- несколько эффектов делают появление немного необычным\r<br />- снимается агра с противников и ваших спутников (чтобы вас не продолжали убивать при появлении около места смерти)\r<br />- выпивается бутылка исцеляющего зелья (для снятия вредных эффектов, иначе можно от яда к примеру помирать бесконечно, пока яд не закончит действие)\r<br />- очищается инвентарь, согласно выбранному в меню\r<br />- на всякий случай игрок переходит в режим неуязвимости (скрипт редко, но не сразу телепортит из-за нагрузки других скриптов на игру)\r<br />- происходит повреждение атрибутов (здоровье, магия, выносливость), в зависимости от установленных настроек мода\r<br />- происходит повреждение навыков игрока (всех, которые в ванильном скайриме со всеми DLC), в зависимости от установленных настроек мода\r<br />- начинается или нет выбранный квест по поиску своих вещей\r<br />\r<br />\r<br />Типы повреждений:\r<br />1. На фиксированное количество.\r<br />При повреждении на 5 единиц повредится всё выбранное ровно на 5 единиц. Если повреждения велики, то останется 1 единица параметра.\r<br />2. На случайное фиксированное количество в некотором диапазоне от 1 до Х.\r<br />Вычисляется, согласно настройкам мода, случайная величина между 1 и указанной. Затем повредится всё выбранное ровно на вычесленное кол-во единиц. Если повреждения велики, то останется 1 единица параметра.\r<br />3. На фиксированное процентов.\r<br />При повреждении на 5% процентов повредится всё выбранное ровно на 5% единиц. Если повреждения велики, то останется 1 единица параметра.\r<br />4. На случайное фиксированное количество процентов в некотором диапазоне от 1 до Х.\r<br />Вычисляется, согласно настройкам мода, случайная величина между 1 и указанной. Затем повредится всё выбранное ровно на вычесленное кол-во процентов. Если повреждения велики, то останется 1 единица параметра.\r<br />5. Останется 1 единица параметров.\r<br />Т.е. просто у выбранных параметров останется единица.\r<br />\r<br />\r<br />Особенности расчётов повреждений.\r<br />Атрибуты (здоровье, магия, выносливость) повреждаются с накоплением, как к примеру в играх серии DarkSouls. Вешается (чисто для информации) отрицательный эффект.\r<br />Т.е. каждый раз после смерти вы будете повреждать базовый максимум атрибута на выбранное в меню мода количество.\r<br />Например, было 120 единиц здоровья. После первой смерти повреждения -5. Значит останется 115. После следующей смерти -7. Значит уже останется 108. И т. д.\r<br />При мего-повреждениях и микро-здоровье мод просто оставит у вас около нуля.\r<br />Навыки повреждаются просто на указанные величины.\r<br />Накопленные повреждения атрибутов можно развеять:\r<br />- приняв 7000 ударов по себе (7000 ударов, не важно чем - число ступенек к форту Высокий Хротгар).\r<br />- выждав, пока эффект развеется сам (7000 минут реального времени - число ступенек к форту Высокий Хротгар) (при смерти до развеивания эффекта он начинается заново).\r<br />- выпив зелье &#34;Излечение от проклятья Аркея&#34; (местоположение описано в одном из квестов или пункты ранее, если выбрали &#34;без квеста&#34;). Зелье может выпасть рядом с вами при ударе по вам с шансом 1 из 7000 (или новое максимальное показание счётчика).\r<br />\r<br />\r<br />Немного теории о расчётах повреждений.\r<br />Раньше атрибуты (здоровье, выносливость, магия) и навыки повреждались с учётом всяких модификаторов, т.е. с временными прибавками и штрафами. Смысл был в не перебарщивании повреждения. Но теперь я от этого отказался, ибо после повреждения может модификатор исчезнуть и вы помрёте. Или же повредить нельзя, так как модификатор мешает в рассчётах.\r<br />Теперь же я оставил повреждение только базовых значений (без учётов бафов и дебафов). Теперь следите, какое значение ставите в настройках повреждений. Не забудьте, что есть разные бонусы (бонусы расы, временные эффекты от предметов) и различные штрафы (аналогично).\r<br />Т.е., если у вас бонус к здоровью +30, и вы оставите в повреждениях &#34;1 ед.&#34;, то у вас всегда будет 31 минимум после смерти. Бонус не даст упасть ниже.\r<br />Но, если у вас штраф к расе -20 к какому-то атрибуту. То при выборе &#34;1 ед. после смерти&#34; у вас будет после смерти -19. Смотрите, чтобы было не здоровье))\r<br />\r<br />\r<br />Места воскрешений:\r<br />1. Храм Вайтрана.\r<br />2. Храм Виндхельма.\r<br />3. Случайный храм из списка: Вайтран, Маркарт, Солитьюд, Рифтен, Виндхельм.\r<br />4. Одно из 20 мест в Скайриме вне городов.\r<br />5. Ближайшая дикая местность из 20 точек пункта 4. Срабатывает, если померли в степях Тамриеля (т.е. на природе). Иначе работает пункт 4, ибо в интерьере невозможно определить дистанцию да точки респавна.\r<br />6. Точки воскрешения в дикой местности по порядку. Полезно тем, кто хочет пропрыгат все 20 точек и проверить совместимость с территориями из иных модов.\r<br />\r<br />\r<br />О квесте (всё будет иметь указатели на карте как и в других квестах).\r<br />Если помрёте во время квеста, то предыдущие вещи исчезнут&#33;\r<br />\r<br />Можно отметить (отмеченное суммируется), что всё равно останется после смерти при вас:\r<br />- всё экипированное\r<br />- золото\r<br />- остальной хлам инвентаря\r<br />Можно отметить (отмеченное суммируется), что всё равно уничтожится после смерти:\r<br />- всё экипированное\r<br />- золото\r<br />- остальной хлам инвентаря\r<br />При выборе меню MCM-меню не даст выбрать и то и то сразу, что не логично (вещи останутся у игрока и уничтожатся).\r<br />Опция &#34;Касание Аркея&#34; влияет на шанс полного уничтожения вещи независимо от выбранных настроек &#34;Оставить&#34;. Т.е., когда ваши вещи после смерти снимаются с Довакина, Аркей может с определённым шансом её забрать себе.\r<br />Если вещей несколько, то забирается их процент, равный проценту шанса Аркея, а если вещь одна, то шанс её исчезновения расчитывается согласно шансу Аркея (т.е. может и остаться, если &lt; 100%).\r<br />Опция &#34;Жадность Аркея&#34; даёт Аркею после вашей смерти забрать все предметы (кроме золота), стоимость которых больше указанного. Также не зависит от выбранных настроек &#34;Оставить&#34;.\r<br />\r<br />Квест даст возможность восстановить повреждение величин атрибутов.\r<br />Квест не даст восстановить навыки, ибо навыки можно просто вкачать, бегая по Скайриму.\r<br />Выбор квестов:\r<br />- без квеста (не оставленные вещи пропадают в никуда, зелья исцеления от проклятия Аркея также нет, жизнь - боль)\r<br />- квест &#34;Хранители и сундук&#34; (на месте смерти Хранители с ключом от сундука с вещами)\r<br />- квест &#34;Скелет Довакина&#34; (на месте смерти ваш скелет с вещами, т.е. упрощённый вариант)\r<br />Мод не даст переключить квест, если он запущен и не закончен или провален.\r<br />\r<br />\r<br />Язык сообщений в скриптах: Русский, Английский.\r<br />\r<br />\r<br />В исходниках скриптов многое закомментировано, так что кому интересно - правьте на здоровье.\r<br />\r<br />\r<br />Особенности в процессе игры:\r<br />- Если махач происходит в закрывшейся локации (в определённые моменты игры), то при смерти лучше нормально загрузиться, ибо двери уже не откроются. Просто это фишка самой игры, где в определённые моменты двери закрываются и выйти нельзя пока кого-нить не завалишь.\r<br />- Вначале игры лучше не помирать, пока из Хелгена не выйдете, иначе всё равно телепортнёт после смерти.\r<br />\r<br />\r<br />Насчёт сторонних убивающих модов:\r<br />- Frostfall. Убивает игрока холодом. Но после телепорта в храм мы отогреемся, а в других местах надо шустрее суетиться)).\r<br />- Realistic Needs and Diseases. Убивает жаждой (эт надо очень постараться чтобы иссохнуть до смерти). Можно выйти за водой на поиски.\r<br />\r<br />\r<br />Установка:\r<br />Скопировать папку Data в папку с игрой.\r<br />\r<br />\r<br />Требования:\r<br />- Skyrim 1.9 и выше + все DLC\r<br />- SKSE 1.6 и выше (http://skse.silverlock.org/)\r<br />- SkyUI 5+ (http://www.nexusmods.com/skyrim/mods/3863/)\r<br />\r<br />\r<br />История обновлений:\r<br />\r<br />22 - Зачарованные предметы (оружие) после смерти восстанавливали заряд - исправлено, теперь заряд будет исходным на момент смерти. Аркей и иные настройки MCM-меню теперь не будут уничтожать квестовые предметы. Подправил малость описание в MCM-меню и эффект воскрешения.\r<br />21 - Переделал эффект от проклятия Аркея. Теперь он только на теле игрока. Также можно вовсе отключить эффект крови на теле. Если эффект крови включен, то также будет работать и эффект испарения крови при ударе по вам, если вы под проклятием Аркея.\r<br />20 - Теперь здоровье Хранителей растёт, согласно уровню игрока. Ранее они имели здоровье курицы :)\r<br />19 - Исправил недоразумение, когда ключом открывали сундук и пытались ключ сунуть в сундук, а квест опять начинался без всяких причин. Теперь ключ после вскрытия сундука просто удаляется. Если ключ ещё так не пихали в сундук, то накатите свежую версию поверх предыдущей и всё будет нормально. Если пихнули и квест начался, то: загрузите сохранение более раннее, где всё нормально; провалите или завершите квест в консоли; в консоли закройте сундук и откройте вновь ключом и квест закончится; и т.д. Тут проблема не страшная.\r<br />18 - Написал всплывающие сообщения внизу в MCM-меню для удобства.\r<br />17 - Теперь, когда по вам бьют, не только уменьшается счётчик Аркея, но и есть шанс (1 из МАКССчётчика), что около вас выпадет зелье избавления от Аркея.\r<br />16 - Отключил управление игрока, пока срабатывает скрипт после смерти. Т.е. сразу бежать не получится. На всякий случай сделал, ибо хз куда игрок успеет угодить.\r<br />15 - Ранее использовал игровые маркеры для телепортации в храмы. Теперь добавил свои (в пять храмов).\r<br />14 - Добавил опцию &#34;Жадность Аркея&#34;. Теперь Аркей после вашей смерти забирает все предметы (кроме золота), стоящие больше указанного.\r<br />13 - Добавил опцию &#34;Касание Аркея&#34;. Теперь Аркей после вашей смерти с определённым шансом крадёт навсегда вашу вещь.\r<br />12 - Добавил возможность выбрать, что будет уничтожено после смерти вообще.\r<br />11 - Заменил, упоминаемое имя божества, Харон на Аркей (для вписывания в мир игры). Также счётчик Аркея увеличил до 7000 (число ступенек до Хротгар, как и для длительности эффекта 7000 минут), так как при получении урона от магии счётчик бодро уменьшается. Счётчик Аркея можно настроить.\r<br />10 - Добавил в MCM-меню счётчик Харона, чтобы знать прогресс полученных ударов.\r<br />9 - Косметические правки (воскрешение, эффект и шейдеры после смерти и т.д.)\r<br />8 - Добавил второй квест, а также выборку на счёт квестов.\r<br />7 - Изменил принцип повреждения атрибутов игрока (HP, MP, SP) как в игре DarkSouls (т.е. с накоплением). Вешается отрицательный эффект, который можно развеять (и снимется сумма повреждений атрибутов)\r<br />6 - Добавил еды воскресшему Довакину (для большей выживаемости, если кинет в хладные снега). Также товарищ Alexandriel (https://forums.nexusmods.com/index.php?/user/8797611-alexandriel/) с Нексуса перевёл мод для говорящих по английски.\r<br />5 - Починил количественный возврат предметов при выборке (так же с учётом квестовых и экипированных предметов).\r<br />4 - Починил воскрешение в ближайшей дикой области.\r<br />3 - Добавил пункт для воскрешения по порядку. Как вариант для тестеров точек воскрешения.\r<br />2 - Реализовал выбор потерь шмота. Далее нумерация версий будет просто числами.\r<br />1.9 - Добавил пункт воскрешения в ближайшей дикой местности.\r<br />1.8 - Установил по-умолчанию свои настройки для мода. Выключил пару неактивных чекбоксов.\r<br />1.7 - Сделал выбор потерь.\r<br />1.6 - Сделал 20 точек появления игрока в случайной дикой местности после смерти.\r<br />1.5 - Добавил квест возвращения вещей.\r<br />1.4 - Добавил возможность выбрать тип воскрешения.\r<br />1.3 - Добавил возможность выбрать язык сообщений.\r<br />1.2 - Добавил английский вариант для MCM-меню.\r<br />1.1 - Подправил скрипт МСМ-меню. Мод итак работает всё равно, но там чекбоксы просто деактивировали визуально ползунки. Мелочь в общем))\r<br />[/spoiler]",
  "categoryId": "24",
  "version": "22a",
  "author": "witus",
  "createdUnix": "1467312828",
  "updatedUnix": "1469646871",
  "containsAdultContent": false,
  "uploadedBy": "wituswitus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000211667",
      "name": "The effects of death 1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3492",
      "fileName": "The effects of death-76738-1-0.7z",
      "uploadedUnix": "1467312824",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/270fb9815ac0fec742e17433f054089e373ad80165ddd2d1e8a401db71964c31/analysis/1467320525/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death-76738-1-0.7z?fid=1000211667&ttl=1535865451&ri=8192&rs=8192&setec=c964c8d64b3de835be40571c31d583d9"
    },
    {
      "fileId": "1000211750",
      "name": "The effects of death 1.1",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3492",
      "fileName": "The effects of death-76738-1-1.7z",
      "uploadedUnix": "1467397293",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1eb4b46197280bed53e73741a5bba218a4a4ad7b87e9eb9daa9b03245496a68d/analysis/1467397324/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death-76738-1-1.7z?fid=1000211750&ttl=1535865452&ri=8192&rs=8192&setec=9908a28e4b98d564e5dac14fb50d6d9d"
    },
    {
      "fileId": "1000211768",
      "name": "The effects of death 1.3",
      "version": "1.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3493",
      "fileName": "The effects of death 1.3-76738-1-3.7z",
      "uploadedUnix": "1467407563",
      "modVersion": "1.3",
      "virusScanUrl": "https://www.virustotal.com/file/a0cc170945ae771737b66d294367c17092961f210047c030900d7dbe7e3d5a7f/analysis/1467408423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%201.3-76738-1-3.7z?fid=1000211768&ttl=1535865452&ri=8192&rs=8192&setec=c0b533fde512a3c3b13be36e2ff12a59"
    },
    {
      "fileId": "1000211788",
      "name": "The effects of death 1.4",
      "version": "1.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3530",
      "fileName": "The effects of death 1.4-76738-1-4.7z",
      "uploadedUnix": "1467418588",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/3a2a2cf74b16eb62b0e88b616061e80726c6941dad1f1e894df130665ca5a59a/analysis/1467418625/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%201.4-76738-1-4.7z?fid=1000211788&ttl=1535865453&ri=8192&rs=8192&setec=a7bd4fe084276c5a0141f694facfe3a6"
    },
    {
      "fileId": "1000212292",
      "name": "The effects of death 1.7",
      "version": "1.7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3553",
      "fileName": "The effects of death 1.7-76738-1-7.7z",
      "uploadedUnix": "1467787500",
      "modVersion": "1.7",
      "virusScanUrl": "https://www.virustotal.com/file/7246149ca515b8269cce6e7fdcf36cfa608aa48c54a3521acff06063f4730ac5/analysis/1467787505/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%201.7-76738-1-7.7z?fid=1000212292&ttl=1535865453&ri=8192&rs=8192&setec=d92713b869bb24493816317e948325a2"
    },
    {
      "fileId": "1000212374",
      "name": "The effects of death 4",
      "version": "4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2798",
      "fileName": "The effects of death 4-76738-4.7z",
      "uploadedUnix": "1467874711",
      "modVersion": "4",
      "virusScanUrl": "https://www.virustotal.com/file/a09d81fcf78bce73cf16c17d0cc95ebed892ad2976622a0343c9c339c958615f/analysis/1467874744/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%204-76738-4.7z?fid=1000212374&ttl=1535865454&ri=8192&rs=8192&setec=f1d443393124415a3c64c0980042c87d"
    },
    {
      "fileId": "1000212380",
      "name": "The effects of death 5",
      "version": "5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2798",
      "fileName": "The effects of death 5-76738-5.7z",
      "uploadedUnix": "1467881026",
      "modVersion": "5",
      "virusScanUrl": "https://www.virustotal.com/file/c082516b2e79470ca65ccd1a1f1ab2999067a675aef5cb3920d0465b3fe1b678/analysis/1467881045/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%205-76738-5.7z?fid=1000212380&ttl=1535865454&ri=8192&rs=8192&setec=b57227c2f419040cc56a4e5f650ff4e7"
    },
    {
      "fileId": "1000212473",
      "name": "The effects of death 7",
      "version": "7",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2803",
      "fileName": "The effects of death 7-76738-7.7z",
      "uploadedUnix": "1467947029",
      "modVersion": "7",
      "virusScanUrl": "https://www.virustotal.com/file/d9b299de0cf788846dd162b370f45aa5e951f2fb6d8178f6d4b3e012ca6ffb57/analysis/1467947883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%207-76738-7.7z?fid=1000212473&ttl=1535865455&ri=8192&rs=8192&setec=85cbe40be57455cc26444fd1e9515075"
    },
    {
      "fileId": "1000212589",
      "name": "The effects of death 9",
      "version": "9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2606",
      "fileName": "The effects of death 9-76738-9.7z",
      "uploadedUnix": "1468024224",
      "modVersion": "9",
      "virusScanUrl": "https://www.virustotal.com/file/b5ba511592186237216f8d4c9f718dc391bf6c346e5459368d87c360dbbe3088/analysis/1468024265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%209-76738-9.7z?fid=1000212589&ttl=1535865455&ri=8192&rs=8192&setec=27f796624dd3ace812f62692d6d3fbd0"
    },
    {
      "fileId": "1000212618",
      "name": "The effects of death 10",
      "version": "10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2947",
      "fileName": "The effects of death 10-76738-10.7z",
      "uploadedUnix": "1468046106",
      "modVersion": "10",
      "virusScanUrl": "https://www.virustotal.com/file/9fab727ff22b067ed0932b0cbcaaea61e89f9e5eb761a036445f02b162af1c08/analysis/1468046164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2010-76738-10.7z?fid=1000212618&ttl=1535865455&ri=8192&rs=8192&setec=579fb46d884712f9fcdb2ca3b77b4add"
    },
    {
      "fileId": "1000212740",
      "name": "The effects of death 13",
      "version": "13",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2852",
      "fileName": "The effects of death 13-76738-13.7z",
      "uploadedUnix": "1468109671",
      "modVersion": "13",
      "virusScanUrl": "https://www.virustotal.com/file/e94ce50bcc2cd31f5316726705ed3c844a47e2d660c9133551153c530be8a785/analysis/1468109704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2013-76738-13.7z?fid=1000212740&ttl=1535865456&ri=8192&rs=8192&setec=113715d5acdfe3074896ce6f21cfb47d"
    },
    {
      "fileId": "1000212755",
      "name": "The effects of death 16",
      "version": "16",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3201",
      "fileName": "The effects of death 16-76738-16.7z",
      "uploadedUnix": "1468132220",
      "modVersion": "16",
      "virusScanUrl": "https://www.virustotal.com/file/167aaadb9f4e2a527e76e852dbd601b151f5b07f8795d9dc6d225d20e8af94d2/analysis/1468132273/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2016-76738-16.7z?fid=1000212755&ttl=1535865456&ri=8192&rs=8192&setec=b693d88d72a8e76b551958bae5654941"
    },
    {
      "fileId": "1000212878",
      "name": "The effects of death 18",
      "version": "18",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3206",
      "fileName": "The effects of death 18-76738-18.7z",
      "uploadedUnix": "1468235436",
      "modVersion": "18",
      "virusScanUrl": "https://www.virustotal.com/file/a47a9bd3d9116eafc0128ad46b9ab2c6e7d1351ed0ccc186c542a9dfb7ed77ad/analysis/1468235464/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2018-76738-18.7z?fid=1000212878&ttl=1535865457&ri=8192&rs=8192&setec=4b6f0f4743c58cfbe8e0d50f67edcef0"
    },
    {
      "fileId": "1000213022",
      "name": "The effects of death 19",
      "version": "19",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3204",
      "fileName": "The effects of death 19-76738-19.7z",
      "uploadedUnix": "1468354094",
      "modVersion": "19",
      "virusScanUrl": "https://www.virustotal.com/file/3b1434bc87d2dc3a4f12da4bd6503e1a72dd51084c514544460988b563788de3/analysis/1468354144/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2019-76738-19.7z?fid=1000213022&ttl=1535865457&ri=8192&rs=8192&setec=738ecb33dae0db938272a7703b9535fc"
    },
    {
      "fileId": "1000213053",
      "name": "The effects of death 21",
      "version": "21",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3353",
      "fileName": "The effects of death 21-76738-21.7z",
      "uploadedUnix": "1468406100",
      "modVersion": "21",
      "virusScanUrl": "https://www.virustotal.com/file/b71c6be2254fbad37c26f7dd988f42ff0275337acade8d35fa69eb4c0c0224ee/analysis/1468406104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2021-76738-21.7z?fid=1000213053&ttl=1535865458&ri=8192&rs=8192&setec=9e14559330501debb1c334e8bd88f447"
    },
    {
      "fileId": "1000213797",
      "name": "The effects of death 22",
      "version": "22",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3033",
      "fileName": "The effects of death 22-76738-22.7z",
      "uploadedUnix": "1468973449",
      "modVersion": "22",
      "virusScanUrl": "https://www.virustotal.com/file/7cdb5f3706a851916ff5fd97a4586aaad6645e4167dfbaade5c29b9b3b5c3fbb/analysis/1468973285/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2022-76738-22.7z?fid=1000213797&ttl=1535865458&ri=8192&rs=8192&setec=46da4d101391faccb47e606cd9e29cb3"
    },
    {
      "fileId": "1000214688",
      "name": "The effects of death 22a",
      "version": "22a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3029",
      "fileName": "The effects of death 22a-76738-22a.7z",
      "uploadedUnix": "1469646871",
      "modVersion": "22a",
      "virusScanUrl": "https://www.virustotal.com/file/1ebebc8a89f7d78c2da9d5990c40e82e426ac8cfa2ddb03c5987226eea3c7ea1/analysis/1469646903/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20effects%20of%20death%2022a-76738-22a.7z?fid=1000214688&ttl=1535865458&ri=8192&rs=8192&setec=c0c1dab2a9d52196ad036dbe098bb777"
    }
  ]
}