{
  "modId": 76736.0,
  "modName": "Stones of Barenziah Cheat Batch Files",
  "summary": "This &#34;mod&#34; is simply a collection of batch files that can quickly warp your character to all 24 locations of the Stones of Barenziah. ",
  "descriptionHtml": "This &#34;mod&#34; is simply a collection of 24 Skyrim batch files that can be used to quickly warp your character to each of the 24 spots where the Stones of Barenziah are located. They will warp your character to the EXACT LOCATION of each stone, not just to the entrance of the cave or house or wherever, so be prepared for battle or for sneaking before you warp&#33; \r<br />\r<br />These batch files must be unzipped manually and placed in the same directory (folder) as your TESV.exe file. (The default location is C:&#92;ProgramFiles(x86)&#92;Steam&#92;steamapps&#92;common&#92;skyrim) \r<br />[size=4][b]\r<br />*YOU CANNOT USE NEXUS MOD MANAGER (NMM) OR MOD ORGANIZER (MO) TO INSTALL THIS MOD. YOU MUST UNZIP THE .7z FILE YOURSELF AND THEN MANUALLY PLACE ALL 24 SKYRIM BATCH FILES IN YOUR TESV.EXE FOLDER*[/b][/size]\r<br />\r<br />After placing these batch files in the appropriate directory, you use them by opening the console (usually by hitting the ~ key) and typing &#34;bat stone#&#34; without the quotes. Substitute the appropriate number (1 through 24) in place of the # symbol.\r<br />\r<br />Example: The first batch file is named &#34;stone1,&#34; and it only contains the following console command: player.moveto 0007F956. To use it, open the console and type &#34;bat stone1&#34; without the quotes. This command instantly moves your character to the exact location of the first Stone of Barenziah in Whiterun&#39;s Hall of the Dead.\r<br />\r<br />To move to the second stone&#39;s location, you open the console again and type &#34;bat stone2.&#34; And so on and so forth for each batch file (stone1 through stone24).\r<br />[b]\r<br />WARNING: Stone20 will place you right next to a Hagraven (witch) in Ansilvund tomb. DO NOT KILL HER because that will ruin a quest. Just warp in, grab the stone, and warp out without killing her. [/b]\r<br />\r<br />As a matter of fact, I recommend that you don&#39;t kill or interact with anybody or anything except the stones while warping. To make this easier (and since we&#39;re cheating already, why not make it easier?), I recommend that you turn yourself invisible and go into sneak mode before each warp, because each batch file will move you to the EXACT location of each stone, and there will usually be enemies there or people who you don&#39;t want catching you in the act of stealing a stone. I use these batch files in conjunction with meh321&#39;s &#34;[url=http://www.nexusmods.com/skyrim/mods/64541/?]Uninterrupted Invisibility[/url]&#34; mod, and then I create an invisibility ring by typing &#34;PlayerEnchantObject 1CF2B 1EA6A #Ring of Invisibility&#34; in the console. Then I equip that ring, go into sneak mode, and start warping all over the place like a crazy man. \r<br />\r<br />Credit for this mod is owed to [url=http://archive.is/w7hyW]Angela Giesen[/url] for providing all the [url=http://angela.giesen.org/2012/08/24-playermoveto-locations-to-stones-of.html]location codes of the Stones of Barenziah[/url]. Check out her website for detailed descriptions of the stones&#39; locations, as well as fixes if you encounter bugs during this quest. (This mod is not buggy. Skyrim is.)  ",
  "categoryId": "40",
  "version": "1.1",
  "author": "scooterrodriguez",
  "createdUnix": "1467307869",
  "updatedUnix": "1484583695",
  "containsAdultContent": false,
  "uploadedBy": "scooterrodriguez",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000211664",
      "name": "Stones Of Barenziah Cheat Batch Files v1.0",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Stones Of Barenziah Cheat Batch Files-76736-1-0.7z",
      "uploadedUnix": "1467307837",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4f16716c8860fde95ef040e6a1a3313c4be78f42cb85bd8930a5814fbaa41457/analysis/1467307863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stones%20Of%20Barenziah%20Cheat%20Batch%20Files-76736-1-0.7z?fid=1000211664&ttl=1535865448&ri=8192&rs=8192&setec=a736269d90f6d7e551dd2be82b4cbade"
    },
    {
      "fileId": "1000233803",
      "name": "Stones Of Barenziah Cheat Batch Files v1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Stones Of Barenziah Cheat Batch Files-76736-1-1.7z",
      "uploadedUnix": "1484583695",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f6499570986f1188dc35dcfd374ce3b3c8e29e7b3f29735b81c52103d9ce73a4/analysis/1484583962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stones%20Of%20Barenziah%20Cheat%20Batch%20Files-76736-1-1.7z?fid=1000233803&ttl=1535865449&ri=8192&rs=8192&setec=5f3058c24ebc6185a9a3b5430d8957ff"
    }
  ]
}