{
  "modId": 76949.0,
  "modName": "Equippable Tomes - Belt-Worn Books",
  "summary": "Equippable Tomes is a mod that adds tomes and books that can be worn on your character&#39;s belt in order to increase the power of their spells. Unenchanted versions are included as well if you just want to wear books that don&#39;t affect spell power or enchant your own.",
  "descriptionHtml": "[center][img]http://i.imgur.com/SSzS8mK.png[/img][/center]\r<br />[center][img]http://i.imgur.com/zqcq35H.png[/img][/center]\r<br />\r<br />Equippable Tomes is a mod that adds books that can be worn on the belt to increase the damage of your spells. Unenchanted tomes for you to enchant yourself are included as well, in case you just want to wear some books on your belt and don&#39;t want to increase spell damage. Support for both genders is provided. The tomes have also been integrated into the loot and vendor lists. There are also 8 unique tomes hand-placed in the world of Skyrim that you&#39;ll need to find. Included is a unique crafting station, the Sagecrafting table, an original crafting system that uses skill instead of perks, and the ability to scale your spell damage with equippable items rather than just a flat scale. Great for the mage, paladin, or other scholarly characters out there. \r<br />\r<br />[center][img]http://i.imgur.com/Y86qOub.png[/img][/center]\r<br />\r<br />[b][SIZE=7]What does this mod do?[/SIZE][/b]\r<br />\r<br />\r<br />Equippable Tomes adds tomes for every school of magicka that can be worn on your belt to augment your magical ability. Unenchanted varieties are of course, provided as well. Something I miss when I play mage characters is that satisfaction of finding or crafting a new weapon. I wanted tomes to feel like magical weapons that increase your magical damage instead of just lowering your magicka costs. Worthwhile loot for mages. Other spell scaling mods take many different approaches: perks, tweaks, or edits to the spells themselves to allow them to scale their damage over the course of the game. I believe I&#39;ve gone in a direction that has yet to be taken by providing specialized mage gear that has its own equip slot (back left and back right on your belt) and won&#39;t interfere with your other equipment. [b]The new Sagecrafting table will act as your hub when it comes to crafting tomes:[/b]\r<br />\r<br />[center][img]http://i.imgur.com/eRXu115.png[/img][/center]\r<br />\r<br />\r<br />\r<br />- Tomes that increase magic effectiveness ONLY affect spells, NOT enchantments, potions, or other magical effects.\r<br />\r<br />- Fully compatible with spells added by any and all other mods.\r<br />\r<br />- The Sagecrafting table can be found in Dragonsreach, and is used to craft new tomes. Tome crafting goes by your skill in a given school of magicka, not your Enchanting skill or other perks. Novice tomes are craftable by default, and the next tiers for each skill become available as you reach 25, 50, 75, and 100 in each school. \r<br />\r<br />- Tomes are added to loot lists and vendors dynamically via script to ensure full compatibility. A bashed patch is [b]not[/b] necessary. Wherever you could ordinarily buy robes or find enchanted jewelry as loot, you&#39;ll be able to stumble across tomes. When you first load the game with Equippable Tomes installed, you will receive a notification at the top-left of the screen informing you that they&#39;ve been added to the lists. This means that Equippable Tomes is installed correctly and functioning.\r<br />\r<br />- Unenchanted tomes are provided in case you&#39;re happy with your own spell scaling setup and just want to wear some books&#33;\r<br />\r<br />- 8 unique tomes have been hand-placed in locations around the world. Once you have one in your inventory, you can change which side it&#39;s worn on or craft unenchanted copies of them at the Sagecrafting table back in Whiterun.\r<br />\r<br />- Destruction and Restoration tomes increase magnitude, and the other tomes increase both magnitude and duration.\r<br />\r<br />- The five tiers range from a 10% increase in effectiveness to a 50%. Choose whichever tier is right for how you want to scale your spell damage.\r<br />\r<br />- Freely combine any two tomes at once. My initial idea was to restrict this to only one tome per school at once, but at the end of the day I&#39;d rather let people make that choice themselves. If you want to double up, double up, and if you think it&#39;s OP and don&#39;t want to do that, feel free to avoid it.\r<br />\r<br />- When crafting tomes, the soul gem in any given recipe must either be empty or one that the player has filled themselves. Pre-filled gems from merchants won&#39;t work.\r<br />\r<br />- I&#39;ve added recipes to break down ruined books into rolls of paper at the Sagecrafting table.\r<br />\r<br />- Back-left tomes use biped slot 48, and back-right tomes use slot 55.\r<br />\r<br />[b][size=7]Alternate Meshes[/size][/b]\r<br />\r<br />- In meshes&#92;armor&#92;Equippable Tomes you&#39;ll find a folder called Alternate Meshes. These are tighter meshes in case the books don&#39;t cling to your character tightly enough by default. They&#39;re numbered from least tight to most tight, with 0.5 folder being the least tight (but still tighter than default) and 2.0 being the most. You can use these by copy and pasting them into the meshes&#92;armor&#92;Equippable Tomes folder.\r<br />\r<br />- Note that books on the right side naturally hug a tiny little bit tighter than ones on the left, nothing I can do about that because I didn&#39;t make the meshes. Feel free to mix and match the alternate meshes, the right ones are marked BR and the left are marked BL. Just be sure to use both the ones that end in _0 and _1 or you&#39;ll break weight slider support. For instance, if you want to make JUST the tomes on the left tighter, move BOTH MODTomes_Book_BLm_0 and MODTomes_Book_BLm_1 from one of the alternate mesh folders and use them to replace the ones in meshes&#92;armor&#92;Equippable Tomes.\r<br />\r<br />\r<br />[img]http://i.imgur.com/L8jSzAt.png[/img]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/64798/?]Campfire[/url] users can use the Equippable Tomes Campfire add-on to be able to craft portable Sagecrafting tables to place anywhere in the world. Portable Sagecrafting tables can be crafted from both the normal Sagecrafting table in Whiterun, as well as by using the Survival Skill: Create Item added by Campfire.\r<br />\r<br />Campfire is a wonderful mod by Chesko that acts as a brilliant mod author framework, allowing seamless integration of items from other mods into the Campfire systems. All its features are purely optional and if you only want Campfire to be able to craft items in the world and want to ignore all the camping elements, you can do that with absolutely no problems whatsoever. I recommend checking it out and using the Equippable Tomes add-on&#33;\r<br />\r<br />[center][img]http://i.imgur.com/3VR9Wk8.png[/img][/center]\r<br />\r<br />[b][size=5]Book Covers Skyrim (BCS) Retexture by Lillharti[/size][/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/82732/?][img]http://i.imgur.com/ODivHFk.png[/img][/url]\r<br />\r<br />Lillharti has provided a retexture for Equippable Tomes utilizing Book Covers Skyrim&#39;s textures by DanielCoffey. It covers every tome for the schools of magicka, and looks great&#33; Click the image above to go to the mod page to see more images, or [url=http://www.nexusmods.com/skyrim/mods/82732/?]click here&#33;[/url] Thanks very much to Lillharti for the hard work and DanielCoffey for the textures as well as the permission to release them as a retexture. You guys are great&#33;\r<br />\r<br />[SIZE=7]Permissions[/SIZE]\r<br />\r<br />[url=https://robbiemod.wordpress.com/License]https://robbiemod.wordpress.com/License[/url]\r<br />\r<br />- Contact me before using anything from this mod. I will probably say yes.\r<br />\r<br />- If you contact me and I do not respond within 30 days, you have full permission to use this mod, in whole or in part, in any of your work. This includes compilations, conversions, and any derivative works.\r<br />\r<br />- No parts of this mod can be monetized under any circumstances. If you are caught monetizing this work, your permission to use any content from any of my mods is permanently revoked.\r<br />\r<br />- Credit me if you use something from this mod.\r<br />\r<br />- If you use something from this mod, your permissions should be open so other people can use it the same way you did.\r<br />\r<br />I can&#39;t give permission for the book meshes and textures, as they were created by Dragten. Please contact Dragten if you want to use them&#33;\r<br />\r<br />The Sagecrafting table was created using modders resources with open permission. See credits section of description for full details.\r<br />\r<br />\r<br />[b][SIZE=7]Installation[/SIZE][/b]\r<br />\r<br />I recommend installing with Nexus Mod Manager. Otherwise, extract the contents of the .rar file to your Skyrim/Data folder. The vendor distribution script is marked with MODTome for easy removal. The assets from Open Books Library have their own directories, and everything else is in the appropriate Equippable Tomes folders.\r<br />\r<br />[b][SIZE=7]Compatibility[/SIZE][/b]\r<br />\r<br />This mod is compatible with everything, it only adds new records and doesn&#39;t modify any. It will work with all spells added by mods, as it checks for skill, not keywords. It will also scale the magnitude of mods even with other scaling mods installed, and with the range of tomes going from a 10% increase to a 50%, plus the ability to double up, it should be easy to pick a tier that is right for your setup.\r<br />\r<br />As far as biped slots go, tomes on the back-left use slot 48, and back-right tomes use 55. Fully compatible with Bandolier, Warmonger Armory, Wearable Lanterns, and everything else.\r<br />\r<br />Leveled list edits are made via script when the mod is first loaded to ensure full compatibility, full stop. [b]No bashed patch required.[/b]\r<br />\r<br />Finally, this mod uses several modder&#39;s resources that may be used in other mods. I used the default directories for Open Books Library, so if you have another mod that uses those, it may ask you to overwrite. Do it or don&#39;t, it doesn&#39;t matter, it&#39;s just trying to put two of the same file in the same place. Absolutely no conflict.\r<br />\r<br />Some users have noticed strange behavior (tomes disappearing, being equipped but invisible) when using HDT mods. So far what has been mentioned is HDT Tails, HDT CBBE and Remodeled Vanilla Armors for CBBE. If you notice this behavior, the first fix is to try putting Equippable Tomes at the very bottom of your load order. If that doesn&#39;t fix it, unfortunately I don&#39;t have another fix at this time.\r<br />\r<br />[b][SIZE=7]Credits:[/SIZE][/b]\r<br />\r<br />[b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/16438/?]Dragten - Bandolier - Bags and Pouches[/url]\r<br />\r<br />Dragten made this mod possible by supplying the book meshes and textures that I modified to suit my needs. Thanks very much for graciously lending permission to use your assets.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/36499/?]tueffelachtein - Modular Crafting Table. [/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/16525/?]Oaristys - Modder&#39;s Resource Pack[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/42362/?]stoverjm and Blary - Open Books Library[/url]\r<br />\r<br />Thanks&#33; Couldn&#39;t have made my Sagecrafting table look nearly as cool without you&#33; You guys have done excellent work and modder&#39;s resources are a huge help to everyone in the community. \r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/64798/?]Chesko - Campfire[/url]\r<br />\r<br />For the framework that let me set up the Sagecrafting table for use with the Campfire object placement system. Fantastic mod and a brilliant tool for authors.\r<br />\r<br />[/b]\r<br />\r<br />[b][SIZE=7]My Other Mods:[/SIZE][/b]\r<br />\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/53751/?][center][img]http://i.imgur.com/kSAnZiF.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/65607/?][center][img]http://i.imgur.com/uX3g6JA.jpg[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/79045/?][center][img]http://i.imgur.com/bh3nfCC.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66995/?][center][img]http://i.imgur.com/0fPggDT.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/45780/?][center][img]http://i.imgur.com/Oh1KZft.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66055/?][center][img]http://i.imgur.com/KK7LOim.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50294/?][center][img]http://i.imgur.com/o1vzSpP.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66196/?][center][img]http://i.imgur.com/hObIhrQ.png[/img][/center][/url]\r<br />[center][img]http://i.imgur.com/V0ICmGW.png[/img][/center]",
  "categoryId": "102",
  "version": "v1.0.1",
  "author": "Robbie",
  "createdUnix": "1468022182",
  "updatedUnix": "1478651692",
  "containsAdultContent": false,
  "uploadedBy": "Robbie922004",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000212584",
      "name": "Equippable Tomes - Belt-Worn Books",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "17726",
      "fileName": "Equippable Tomes - Belt-Worn Books-76949-v1-0.rar",
      "uploadedUnix": "1468021457",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e52ea1336d4750d1b417ad41f1e23c3caa6f6842590fe12d395d088a18ffe367/analysis/1468021509/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equippable%20Tomes%20-%20Belt-Worn%20Books-76949-v1-0.rar?fid=1000212584&ttl=1535865623&ri=8192&rs=8192&setec=30639d36a234ceebac9ef38fe1327cc2"
    },
    {
      "fileId": "1000212794",
      "name": "Equippable Tomes - Campfire Add-On",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Equippable Tomes - Campfire Add-On-76949-v1-0.rar",
      "uploadedUnix": "1468162970",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c3aa3de56c8dba9694d5871e94f7ebba62a27ad4786104e2730975b70885c2d7/analysis/1468162983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equippable%20Tomes%20-%20Campfire%20Add-On-76949-v1-0.rar?fid=1000212794&ttl=1535865624&ri=8192&rs=8192&setec=06a6a3e1b29e397f40195b9aca6d0060"
    },
    {
      "fileId": "1000212812",
      "name": "Equippable Tomes - Campfire Add-On",
      "version": "v1.0.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Equippable Tomes - Campfire Add-On-76949-v1-0-1.rar",
      "uploadedUnix": "1468169867",
      "modVersion": "v1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/2ec0891a5afdd23336b7a36af12df954e88989138484bb5fd0c8f9035b1c7e6c/analysis/1468169883/",
      "changelogHtml": " - Fixed a critical issue (that somehow nobody told me about) that caused user-filled gems to not count for crafting of tomes. From now on, gems used in crafting must be empty or filled by the player. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equippable%20Tomes%20-%20Campfire%20Add-On-76949-v1-0-1.rar?fid=1000212812&ttl=1535865624&ri=8192&rs=8192&setec=bb4bb1b31c4ccbf5d03f250ca5f51b7e"
    },
    {
      "fileId": "1000227495",
      "name": "Equippable Tomes - Belt-Worn Books",
      "version": "v1.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17726",
      "fileName": "Equippable Tomes - Belt-Worn Books-76949-v1-0-1.rar",
      "uploadedUnix": "1478651692",
      "modVersion": "v1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/790a96a88effd760e1def49f55a62b8609d0ef5d89c567d2b567fe048f8e3fd9/analysis/1478651707/",
      "changelogHtml": " - Fixed a critical issue (that somehow nobody told me about) that caused user-filled gems to not count for crafting of tomes. From now on, gems used in crafting must be empty or filled by the player. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equippable%20Tomes%20-%20Belt-Worn%20Books-76949-v1-0-1.rar?fid=1000227495&ttl=1535865625&ri=8192&rs=8192&setec=ab63c71935830ab66df1dcefff9ae065"
    }
  ]
}