{
  "modId": 76999.0,
  "modName": "No Salty Food with touchups for Hunterborn",
  "summary": "Salt is a perk in cooking but not a necessity. A hungry person will not let a piece of meat rot because he&#39;s out of salt. Removes salt requirments from vanilla meat and stew recipes, 4 Hunterborn recepies and removes butter requirement from the mud crab and clam chowder recepies. Based on Grover Rockwood&#39;s No Salty Food mod.",
  "descriptionHtml": "Picture yourself huddled in a tent in the cold wilderness, starving after a long day of killing mud crabs and saber-tooth tigers. Are you going to let the meat in your inventory rot because you forgot to pack some salt or are you going to cook and eat it anyway? \r<br />\r<br />Back in 2012, Grover Rockwood made a mod called No Salty Food which removed the salt requirement from the vanilla meat and stew recipes.  This is a small touch up of his mod which adds a couple of recipes from HunterBorn which needed salt as well as removing the butter prereq from the clam chowder and mud crab legs recipes.\r<br />\r<br />Requirements: Hunterborn, DLCs. No need for SKSE (this mod has no scripts). No need for original plugin.\r<br />\r<br />If you don&#39;t have HB or the DLCs, you can find Grover&#39;s original mod here: http://www.nexusmods.com/skyrim/mods/25903/?",
  "categoryId": "24",
  "version": "1.0",
  "author": "thebunnyrules",
  "createdUnix": "1468199563",
  "updatedUnix": "1468198048",
  "containsAdultContent": false,
  "uploadedBy": "thebunnyrules",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000212848",
      "name": "No Salty Food Redux",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "No Salty Food Redux-76999-.7z",
      "uploadedUnix": "1468198048",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/172e2520d0f90ab6ccc99475d58c11d0daf3916506019d4da6343cbceebadaa9/analysis/1468198083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Salty%20Food%20Redux-76999-.7z?fid=1000212848&ttl=1535865659&ri=8192&rs=8192&setec=043fbf9b2c0b06114a473b05a3fa3f92"
    }
  ]
}