{
  "modId": 77048.0,
  "modName": "Delphi Scripts for TES5Edit",
  "summary": "Quickly add/remove/replace/pre-fix/post-fix/swap parts of string names for bulk record edits in TES5Edit.",
  "descriptionHtml": "Update: Fixed major issue where the GUI would force re-doing the input for every record, now properly takes input once to perform on all selected records. After finishing input, close the GUI to have it happen. You can try another action, but it will override the previous one. Only the last thing you pick will happen to the records. This is because everything is set to happen when the GUI closes now, rather than when you input text.\r<br />\r<br />[center][b]Quickly add/remove/replace/pre-fix/post-fix/swap parts of string names for bulk record edits in TES5Edit.[/b][/center]\r<br />Update: Just uploaded new GUI version, main file renamed to aaa_modifyStrings.pas and all string manipulation functionality merged into this one script. Still working on interface, then integrating misc2stat and other options.\r<br />\r<br />You can run the script by highlighting the records and pressing [b]Ctrl + M[/b] or selecting [i]aaa_modifyScripts.pas[/i] from the list. [i]If that hotkey conflicts with any other scripts/software any of you are using, post in the comments and I might change it or add instructions for customizing it.[/i]\r<br />\r<br />The text box area on the main window doesn&#39;t actually do anything yet; I was experimenting with how to make one and left it as a placeholder. I&#39;m not sure exactly what will go into it, but I have a vague idea of what to have display there eventually.\r<br />\r<br />I am open to adding new functions by request, or new options for the current ones, based on comment feedback. These started as separate scripts I made for a friend to use on his FO4 mod, and since I don&#39;t think mods can be set to show for both games, I&#39;ve gone ahead and added a Skyrim version.\r<br />[line]\r<br />Please only work on records of the same type during any single script run (from starting the script to closing the script&#39;s window after finishing an edit).\r<br />\r<br />I also don&#39;t know what happens if you work on records from multiple mods at once, even if they are the same type. I will test these scenarios at some point.\r<br />\r<br />[i]So for example, running the script on entries in Plugin-A.esp, you can change 985 MISC record names to have &#34;Junk - &#34; on the front of the name, and then 3 static objects to have &#34;Junk -&#34; on the front of the name, but please run the script on the first 985, close it, and run it again on the other 3 of a different type. And then if you want to change one more MISC record in Plugin-B.esp, run the script a third time (or do it manually, but I&#39;m using one as an example since its tedious to have to run it twice just for one more record etc).\r<br />\r<br />I may do testing and tweaking to allow multiple record types during one run possibly in the future, but for now, I wouldn&#39;t recommend trying it.[/i]\r<br />[line]\r<br />New Script: misc2stat by request, it will copy an existing MISC record to a new STAT record and copy the name, model filename, and object boundaries automatically. You must manually enter the new formid for each one, but it is much faster than copying the data all by hand as well. You can select multiple MISC records to be [i]transreplicated [/i](replicated to a transformed record type... TransReplicate™ Patent Pending) during a single script run, but I haven&#39;t added formid ranges so each one will ask for another formid.\r<br />[line]\r<br />DISCLAIMER: These are intended for people who have a decent idea on how to use TES5Edit already, but if you mess anything up just make sure to uncheck the boxes for saving when you close the program. Then it won&#39;t be saved and you can retry whatever you meant to do when you launch the program again. It&#39;s also a good idea to make sure &#34;backup plugins&#34; is always checked in the window that pops up when closing TES5Edit.\r<br />[line]\r<br />[center]Please post any bugs/issues you have or suggestions.[/center]",
  "categoryId": "82",
  "version": "1.0.beta3",
  "author": "eventHandler",
  "createdUnix": "1468343006",
  "updatedUnix": "1469705967",
  "containsAdultContent": false,
  "uploadedBy": "eventHandler",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000213005",
      "name": "FO4EditScripts",
      "version": "1.0.beta1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "FO4EditScripts-77048-1-0-beta1.7z",
      "uploadedUnix": "1468342998",
      "modVersion": "1.0.beta1",
      "virusScanUrl": "https://www.virustotal.com/file/4155d1c9d7cfc739fe5dedc7764ac2205e3daeff4fd023904ef96962308268bb/analysis/1468343042/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FO4EditScripts-77048-1-0-beta1.7z?fid=1000213005&ttl=1535865710&ri=8192&rs=8192&setec=e1ae23a29fccc17894f7a7873541113f"
    },
    {
      "fileId": "1000214513",
      "name": "TES5EditScripts",
      "version": "1.0.beta2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "TES5EditScripts-77048-1-0-beta2.7z",
      "uploadedUnix": "1469528602",
      "modVersion": "1.0.beta2",
      "virusScanUrl": "https://www.virustotal.com/file/587871687b062846e549bc858a15e62e6855e0c784bc7c4f69c5a3121784b248/analysis/1469528644/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TES5EditScripts-77048-1-0-beta2.7z?fid=1000214513&ttl=1535865710&ri=8192&rs=8192&setec=1ff37d62beb9040a35ca092c9d5a52f1"
    },
    {
      "fileId": "1000214760",
      "name": "TES5EditScripts",
      "version": "1.0.beta3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "TES5EditScripts-77048-1-0-beta3.7z",
      "uploadedUnix": "1469705967",
      "modVersion": "1.0.beta3",
      "virusScanUrl": "https://www.virustotal.com/file/76056ac93389189799ace99d5a73c53df0ba378edb49125c9497578b3853342e/analysis/1469706004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TES5EditScripts-77048-1-0-beta3.7z?fid=1000214760&ttl=1535865711&ri=8192&rs=8192&setec=da695c05ecfae0216fa57b0feb05ea14"
    }
  ]
}