{
  "modId": 77085.0,
  "modName": "Spice of Life - Mines",
  "summary": "Gives mines in Skyrim more texture variety depending on their geological location in Skyrim.",
  "descriptionHtml": "[Image Placeholder]\r<br />\r<br />[size=5]Spice of Life -Mines[/size]\r<br />\r<br />[size=3]Quick description:[/size]\r<br />\r<br />[list]\r<br />[*][size=3]Gives 18 mines in Skyrim new sets of textures. [/size]\r<br />[*][size=3]Gives furniture inside mines matching wood textures.[/size]\r<br />[*][size=3]Up to 4k resolution with parallax.[/size]\r<br />[*][size=3]Exteriors of mines also given variety.[/size]\r<br />[*][size=3]Continuity with Spice of Life - Orcs. (i.e. Orc wood used in Orc controlled mines)[/size]\r<br />[*][size=3]Mushrooms inside mines now match dirt and stones from that mine.[/size]\r<br />[*][size=3]Campfires now match mine rocks and floor. [/size]\r<br />[*][size=3]Ore now matches the material it&#39;s found on. (Previously, ore with dirt could be found placed in a rock wall, this makes no sense)[/size]\r<br />[*][size=3]Mines next to each use same textures. (Logically)[/size]\r<br />[/list]\r<br />Are you tired of seeing the same exact textures in every mine through Skyrim? Does it put you off that the same rock can be found in every mine? Well it bothered me enough I made this mod. I really disliked how the whole land of Skyrim used the same rock texture. It not only bothered me from a visual standpoint, that same rocks every place you go, but also a realism point of view. Skyrim, like and landmass has geology which means different types of rocks formed in different places throughout the land. This would be especially apparent when you enter an underground mine. \r<br />\r<br />That being said, in this mod there are 18 different styles sets of rock textures. Which I feel is more than enough to make all the mines in Skyrim feel diverse. On top of this, some external structures have also gotten some variety in mines where there are structures outside or example. All Orc mines also use the wood from my Spice of Life - Orc mod (not required download), so there is continuity there as well. \r<br />\r<br />\r<br />\r<br />Full list of mines that have been modified: \r<br />\r<br />Bilegulch Mine\r<br />Dushnikh Mine\r<br />Embershard Mine\r<br />Fenn&#39;s Gulch Mine\r<br />Goldenrock Mine\r<br />Gloombound Mine\r<br />Halted Stream Mine\r<br />Iron-Breaker Mine\r<br />Kolskeggr Mine\r<br />Left Hand Mine\r<br />Lost Prospect Mine\r<br />Mor Khazgur Mine\r<br />NorthWind Mine\r<br />Quicksilve Mine\r<br />Redbelly Mine\r<br />Sanuarach Mine\r<br />Streamscorch Mine\r<br />Soljund&#39;s Sinhole\r<br />\r<br />Things that are done: \r<br />\r<br />Mines have new textures.\r<br />Furniture in mines have new textures.\r<br />Mushrooms inside mines have matching textures.\r<br />Ores inside mines have matching textures.\r<br />Doors match the wood that is used inside the mines.\r<br />Exteriors (if applicable) match the interior&#39;s materials.",
  "categoryId": "29",
  "version": "1.0",
  "author": "steveowashere",
  "createdUnix": "1468492922",
  "updatedUnix": "1468492922",
  "containsAdultContent": false,
  "uploadedBy": "steveowashere17",
  "primaryFile": null,
  "files": []
}