{
  "modId": 77111.0,
  "modName": "Tamriel y mas alla",
  "summary": "Una aventura completamente nueva que abarca todo Tamriel, parte de Atmora y mucho mas.\r<br />Es un proyecto que busca otorgar a los usuarios mas de 1000 horas de juego.\r<br />Embarcate rumbo a Bosque Valen combate contra los Thalmor en una guerra sin precedentes... Asiste al rey Supremo y Convierte en Emperador",
  "descriptionHtml": "   Se añadira la opcion de donar para financiar el desarrollo de la expansion.( 2 de Enero de 2017)\r<br />Para trabajar en este proyecto,scripteando, testeando, o dando ideas, deben ponerse en contacto por medio del correo nacsozxproductions@gmail.com\r<br />           Un mod tamaño DLC, desarrollado usando Creation Kit, que busca otorgar a los usuarios más de 2500 horas de juego.\r<br />\r<br />   Abarca todo Tamriel e incluye el Dominio de Aldmer, parte de Atmora y muchos lugares por descubrir...\r<br />[img]http://img14.deviantart.net/043b/i/2011/114/2/b/tamriel_by_decadencenight-d3eqrzz.jpg[/img]\r<br />   Esta expansión NO OFICIAL nos permitira viajar por todo el Tamriel, desde las tundras heladas de Skyrim hasta la selva tropical de Elsweyr, desde la provincia Imperial hasta Bosque Valen.\r<br />\r<br />Explora la selva, el desierto,los valles y mucho más en esta unica e inigualable aventura.\r<br />\r<br />   La guerra civil en Skyrim a diezmado al Imperio,y la muerte del emperador Tito Mede II no ha hecho más que desestabilizar la precaria situación preexistente, esto ha dado la oportunidad a los Thalmor de atacar y doblegar los debilitados pueblos que conformaban el Imperio.\r<br />\r<br />   Combate a los Thalmor, y libera las provincias que habían caído bajo su yugo, recupera Elsweyr y Bosque Valen, defiende Skyrim y alcanza la gloria en esta cruel y sanguinaria guerra.\r<br />\r<br />   Restaura a la Hermandad Oscura a sus viejos y temidos dias de gloria, recupera el respeto hacia el Gremio de Ladrones...\r<br />Todo esto y mucho más estará disponible a la brevedad... Vuélvete temido o respetado... La decisión es tuya.\r<br />\r<br />Actualmente se encuentra en desarrollo; aun no hay una versión disponible  para descarga.\r<br />Es un trabajo en progreso que sera publicado a la brevedad; la siguiente versión incluirá (Fecha de lanzamiento 2 de Noviembre)\r<br />[list]\r<br />[*]1 Mision Principal\r<br />[*]Incluye el inicicio de la guerra contra los Thalmor\r<br />[/list]Para poder trabajar de forma más rápida y eficaz solicito ayuda de Scripters Experimentados.\r<br />GRACIAS.\r<br />CREDITOS:\r<br />   STORYBOARD/HISTORIA-NacsoZX\r<br />   TESTERS-Gamer Machine/javiergta\r<br />LOGO- Daheru\r<br />ASSETS DE ELSWEYR - muppetpuppet",
  "categoryId": "35",
  "version": "0.0.0.0.0a",
  "author": "NacsoZXProdudctions",
  "createdUnix": "1468606551",
  "updatedUnix": "1477420242",
  "containsAdultContent": false,
  "uploadedBy": "NacsoZX2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000225558",
      "name": "Tamriel y mas alla",
      "version": "0.0.0.01a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35",
      "fileName": "Tamriel y mas alla-77111-0-0-0-01a.zip",
      "uploadedUnix": "1477420242",
      "modVersion": "0.0.0.01a",
      "virusScanUrl": "https://www.virustotal.com/file/8cf85c3d7fd28b5087168a1864fb0ad1c2f0d05d4f53a1f5f6a4604145823fff/analysis/1477419905/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tamriel%20y%20mas%20alla-77111-0-0-0-01a.zip?fid=1000225558&ttl=1535865764&ri=8192&rs=8192&setec=8cc86cb627156aef341ec54553ce10b4"
    }
  ]
}