{
  "modId": 77129.0,
  "modName": "Tutorial - Creating a Follower with Mod Hairs and Eyes",
  "summary": "Creating a custom follower is easy, but creating one that uses the Racemenu mod and mod-added head parts is a little trickier. Here&#39;s how it&#39;s done.",
  "descriptionHtml": "I recently tried out the mod [url=http://www.nexusmods.com/skyrim/mods/54509]Familiar Faces[/url] and found that I loved having the ability to turn characters from other saves into followers. Unfortunately, the mod was a little buggy and I ended up running into so many problems that I had to uninstall it.\r<br />\r<br />However, now that I had gotten a taste of having custom followers in my game, I didn&#39;t want to go back. I had always avoided modding for the most part because it looks hard and I&#39;m lazy, but I nevertheless decided to try to learn how to create followers in the Creation Kit.\r<br />\r<br />It turns out that making a custom follower isn&#39;t very hard at all, but creating one that was designed using the [url=http://www.nexusmods.com/skyrim/mods/29624]RaceMenu [/url]mod or which uses mod-added parts such as eye colors, that is a little trickier. The information I needed was spread out over a few different sources, so I have written this tutorial to make things easier for newbie modders like myself. Have fun and consider uploading your character to the Nexus if you make someone good&#33;\r<br />\r<br />v1.5 - corrected the date and added a quick tip\r<br />v1.4 - fixed a few errors and added a couple tips\r<br />v1.3 - added more instructions for getting multiple masters to load\r<br />v1.2 - changed up the formatting a little and fixed a small error, also added instructions for editing the ini to allow multiple masters to load. Removed the tutorial from the main page to avoid having to make edits in two places.",
  "categoryId": "82",
  "version": "1.5",
  "author": "Panruru",
  "createdUnix": "1468683430",
  "updatedUnix": "1469488753",
  "containsAdultContent": false,
  "uploadedBy": "Panruru",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000214459",
      "name": "Tutorial - Making a Custom Follower with Racemenu",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "76",
      "fileName": "Tutorial - Making a Custom Follower with Racemenu-77129-1-5.7z",
      "uploadedUnix": "1469488753",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/1fc0e67e21fc782b1b3df6a80f44243a90500d85cbf4c45a5bea937a05c5e11a/analysis/1469488808/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tutorial%20-%20Making%20a%20Custom%20Follower%20with%20Racemenu-77129-1-5.7z?fid=1000214459&ttl=1535865788&ri=8192&rs=8192&setec=bee86c5270ae30aef42f641cb0bd2417"
    }
  ]
}