{
  "modId": 77148.0,
  "modName": "SoulPoweredDwemerHorse",
  "summary": "This mod adds a Dwemer Horse that is immune to fall damage, and moves very fast... Balanced out by the fact every 20 minutes it needs souls for fuel and the more damage it takes the shorter it lasts.",
  "descriptionHtml": "[b][color=#ff7700]New versions: SoulPowerDwemerHorseLuxuryEdition and SoulPowerDwemerHorseDynamoCoreOnly. Requires Dragonborn.\r<br />\r<br />Choose the first if you want your Dwemer Horse to be fueled by filled common soul gems combined with Centurion Dynamo Cores, the second if you only want it to require cores, the first version does give you an option to downgrade filled greater/black/grand soulgems to common soulgems each time you do this a grand black or greater shard is made so you can re-upgrade it back in case you regretted it for some reason. Other new features  listed below...\r<br />[/color]\r<br />[color=#00ffff]Dwemer Horse stats: Speed 305, Health 581, Stamina 674,\r<br />Grand Dwemer Horse stats: Speed 325, Health 1881, Stamina 4774.\r<br />\r<br />Both horses used to have very low health this has been fixed. Both require a Common Soul Gem and Centurion Dynamo core to be resurrected. An inbuilt feature converts Grand/Greater/Black soul gems to common so you can get a source of fuel for the horse, as well as the ability to convert downgraded Common soulgems back to more powerful ones.\r<br />\r<br />Other than those stats the only difference is that the Grand Dwemer Horse has two miniature ballistas as it&#39;s sentries or guardians, which can be summoned almost permanently for 5 scrap metal,\r<br />both of these dwemer sentinels are about half as powerful as a regular ballista. The Dwemer Utility Rod no longer resurrects but instead  gives you the option to either summon those sentinels, or\r<br />alternatively to summon the Dwemer Horses storage compartment from right underneath it.\r<br />\r<br />Also you can summon the Grand Dwemer Horse at the same place it spawns at in case you lose it- the top of Winterhold College... As well as it&#39;s container, in case you accidentally place the\r<br />Utility Rod inside of it. Lastly the Grand Dwemer Horse has two other rods, the Stealth Rod, and Dispel Rod, the Stealth Rod activates a cloaking device for three days, the Dispel Rod deactivates\r<br />said cloak. If you lose the horse due to it&#39;s sneakiness with such remember you can always summon it back. I did things this way because I wanted normal Dwemer Horses to still be useful to those\r<br />with the reagents to fuel them, but I also wanted the Dwemer Horse at the College Of Winterhold to feel more rewarding and special.\r<br />\r<br />Oh and also- while you still need the Arch-Mage key to get to the top of the tower where the Grand Dwemer Horse is by ORDINARY means, IF you use a mod that allows you to fly, levitate or climb, you could\r<br />hypothetically steal the Dwemer horse as an alternate way of getting it, as well as the rods and such where are locked in a master chest by the horse. Unless you get the Arch-Mage key, or unless you can\r<br />fly levitate or climb you won&#39;t be able to get the Grand Dwemer Horse or it&#39;s rods. If you use my mod OldschoolStatsClassesAndClimbing http://www.nexusmods.com/skyrim/mods/74918/? which adds climbing you can get the\r<br />Grand Dwemer Horse via theft/stealth simply by having extremely high stamina and climbing. So now you can either get it the legitimate/magey way via the quest line, or alternatively the thiefy way, which is intentional.\r<br />Either way you&#39;ll have to earn it I feel, unless you use a mod that like lets you fly around easily at level one or something. [/color]\r<br />\r<br />[color=#f4cccc]The other versions are now considered outdated, and I only recommend them if you either don&#39;t have DLC, or don&#39;t want to use a Dynamo Core.[/color]\r<br />\r<br />Outdated content in red...\r<br />\r<br />[color=#ff0000]Suggested version: [/color][/b][color=#ff0000]\r<br />                        [url=http://www.nexusmods.com/skyrim/ajax/downloadfile?id=1000213496]                              [/url]                                                                                                                                                                     \r<br />As a general rule of thumb I recommend SoulPoweredDwemerHorseDLCDYnamoCore, however if you want the Dwemer Horse to only require souls and not a centurion soul at the expense of the horse costing more soul energy and not lasting nearly as long I suggest [url=http://www.nexusmods.com/skyrim/ajax/downloadfile?id=1000213495]SoulPoweredDwemerHorseDLCHardcore[/url], I also possibly suggest the second if you have a mod that disables respawns in dungeons, as if you have such a mod you will truly run out of cores to power the horse at some point more than likely.\r<br />\r<br />SoulPoweredDwemerHorseVanilla is recommended to those without the Dragonborn DLC. [url=http://www.nexusmods.com/skyrim/ajax/downloadfile?id=1000213496]SoulPoweredDwemerHorseDLC [/url]is recommended for those who have DLC and want challenging the Dwemer Horse to be easier.\r<br />\r<br />\r<br />\r<br />Edit: I added a slightly modified version at z4x&#39;s request which has a longer duration and cheaper soul cost- still using the Dwemer Horse Rod,\r<br /> but now on top of the Dwemer Horse Rod you also need a Centurion Dynamo\r<br /> Core. So long as the Dwemer Horse doesn&#39;t get damaged the Dwemer Horse \r<br />should now last for about 5 real time hours, the cast time on the rod \r<br />was slightly increased, and so was the top charge of the rod. Try to use\r<br /> the Dwemer Horses extreme speed and fall damage immunity to avoid \r<br />getting hit, cause it only takes a few hits to bring it down.\r<br />\r<br />This mod adds a Dwemer Horse that is immune to fall damage, and moves very fast... Balanced out by the fact every 20 minutes it needs souls \r<br />for fuel and the more damage it takes the shorter it lasts. The dwemer horse automatically dies within seconds of being loaded, HOWEVER the \r<br />Dwemer Horse Rod will resurrect the horse, and keep it alive for 20 minutes assuming it takes no damage- the more heavily damaged the Dwemer\r<br /> Horse is the sooner you will have to resurrect it&#33; It has a lot of health but also constantly loses health as a balancing mechanic, so that it has limited usage/limited fuel to balance out how powerful it is in mobility.\r<br />\r<br />The Dwemer Horse Rod is in a non respawning chest in the exterior on the top balconey of the Arch Mages quarters of the College Winterhold, and requires completing the Winterhold questline to get the key.\r<br />\r<br />... YES your Dwemer Horse is supposed to die at some point, as it has no soul of it&#39;s own, that&#39;s when you&#39;re supposed to use the staff to resurrect it. Do note the Dwemer Horse still tends to lay down after being resurrected, but activating it will get it right sight up without anymore visual oddities. Oh, and the MAJORITY of Dwemer Ruins, although not EVERY SINGLE one of them has a Dwemer Horse at it&#39;s location. There is about a total of 11 Dwemer Horses, or about 13 with the Dragonborn DLC. Also with the Dragonborn DLC version Dwemer Horses can also run over water.\r<br />\r<br />There are three different versions of this mod, the non-DLC version, the DLC version with Dragonborn and the Hardcore version. The Hardcore version requires the DLC, and simply makes the staff require 3000 soul charge instead of 500. As in, the Dwemer Horse requires quite a bit more souls to stay up and running in the hardcore dlc version than the regular DLC version. There are a few Dwemer Horse mods out there, but I personally wanted one where the Dwemer Horse has limited fuel and is powered by souls, hence the creation of this mod.\r<br />\r<br />Considering how useful and powerful this horse can be from a mobility perspective, I consider the DLCHardcore version to be the most fair and balanced version, and the funnest version long term, but choose whichever version you personally want.[/color]\r<br />\r<br />Also credits to [url=http://www.nexusmods.com/skyrim/users/1083245]razorpony[/url] for making the modders resources for this mod. As in, the very thing that makes the Dwemer Horse a Dwemer Horse, you know the model. There were a few Dwemer Horse mods out there",
  "categoryId": "83",
  "version": "",
  "author": "Lectra",
  "createdUnix": "1468763358",
  "updatedUnix": "1473302743",
  "containsAdultContent": false,
  "uploadedBy": "Letrarunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000213494",
      "name": "SoulPoweredDwemerHorseVanilla",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "858",
      "fileName": "SoulPoweredDwemerHorseVanilla-77148-.7z",
      "uploadedUnix": "1468763264",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f14a468f57351761bb4469a910b429605166b9248550f7bcb68d5e9a378505b8/analysis/1468763288/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulPoweredDwemerHorseVanilla-77148-.7z?fid=1000213494&ttl=1535865806&ri=8192&rs=8192&setec=a4cd1e0df064faa91563fec19021039d"
    },
    {
      "fileId": "1000213495",
      "name": "SoulPoweredDwemerHorseDLC",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "859",
      "fileName": "SoulPoweredDwemerHorseDLC-77148-.7z",
      "uploadedUnix": "1468763311",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/48d2d1af51b0a2ff496b51df84bc9be741e3e5f84e49db0304e1098cc1416b74/analysis/1468763345/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulPoweredDwemerHorseDLC-77148-.7z?fid=1000213495&ttl=1535865807&ri=8192&rs=8192&setec=11d2dee6536a3971b7511b1a642272a5"
    },
    {
      "fileId": "1000213496",
      "name": "SoulPoweredDwemerHorseDLCHardcore",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "859",
      "fileName": "SoulPoweredDwemerHorseDLCHardcore-77148-.7z",
      "uploadedUnix": "1468763352",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1621f45a0a6d094ca20c69b078caea45a7d253ac5680c2cc72102798430ec5ac/analysis/1468763403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulPoweredDwemerHorseDLCHardcore-77148-.7z?fid=1000213496&ttl=1535865807&ri=8192&rs=8192&setec=8f2e6ee0e2bd065598eb9643ed677755"
    },
    {
      "fileId": "1000214120",
      "name": "SoulPoweredDwemerHorseDLCDYnamoCore",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "859",
      "fileName": "SoulPoweredDwemerHorseDLCDYnamoCore-77148-.7z",
      "uploadedUnix": "1469252501",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/a3e196bd3f469c3464c288c155ddc8383f83b90d6ff89fac518e4d791ccb3b24/analysis/1469252523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulPoweredDwemerHorseDLCDYnamoCore-77148-.7z?fid=1000214120&ttl=1535865807&ri=8192&rs=8192&setec=28d68506f63d3f3ce38fad346f031a25"
    },
    {
      "fileId": "1000214453",
      "name": "SoulPoweredDwemerHorseDLCDynamoCoreImproved",
      "version": "",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "859",
      "fileName": "SoulPoweredDwemerHorseDLCDynamoCoreImproved-77148-.7z",
      "uploadedUnix": "1469487499",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f4af8a24d640e0432ee00f862b3feac85221ac4b08b7a4d5fdc8857a11eceb9f/analysis/1469487550/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulPoweredDwemerHorseDLCDynamoCoreImproved-77148-.7z?fid=1000214453&ttl=1535865808&ri=8192&rs=8192&setec=bc6ccb0ced094bcea7f3a95128697641"
    },
    {
      "fileId": "1000220022",
      "name": "SoulPowerDwemerHorseLuxuryEdition",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "893",
      "fileName": "SoulPowerDwemerHorseLuxuryEdition-77148-.7z",
      "uploadedUnix": "1473302622",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/1bd2c28e78093b27b6374381981ae3836af18856ab1a14f17bed6f833bc753be/analysis/1473302642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulPowerDwemerHorseLuxuryEdition-77148-.7z?fid=1000220022&ttl=1535865808&ri=8192&rs=8192&setec=9ba261ccac599654a8371760c82a2d6e"
    },
    {
      "fileId": "1000220023",
      "name": "SoulPowerDwemerHorseDynamoCoreOnly",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "893",
      "fileName": "SoulPowerDwemerHorseDynamoCoreOnly-77148-.7z",
      "uploadedUnix": "1473302743",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/5a1bd00d69d1f291460d146ae90c6c0a9d94587890f2bdc592aa385a87c6eabe/analysis/1473302763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SoulPowerDwemerHorseDynamoCoreOnly-77148-.7z?fid=1000220023&ttl=1535865809&ri=8192&rs=8192&setec=af0f307eafdf4cb8e21c377fc3a7c84a"
    }
  ]
}