{
  "modId": 7714.0,
  "modName": "Ancient  Dwarven - Dwemer Armor Standalone HD",
  "summary": "Standalone.",
  "descriptionHtml": "      This is still an unfinished version, there will be more updates regarding the inventory image, drop/loot for the armor and more when we start managing the Creation Kit, so please keep tracking and endorsing.\r\n\r\nATTENTION:\r\n    I\\'ve uploaded a file cointaning different defense and weight values for the armor, download it and read the \\'READ ME\\' text included.\r\n\r\n-=IMPORTANT=-     <<<<<<<<<<<<<<<<<<<<<<=======READ  THIS!!!!!!!!!!!!!!!!\r\n   If you have the main file and already crafted the Ancient Dwemer Armor, be aware that if you overwrite with any of the new .esp files, you will lose your armor and materials used to craft it. BUT there is a way to recover the materials with simple console codes, so just leave a message on comment section and I\\'ll gladly help you with that.\r\n\r\n================================================================\r\nAbout lore subject:\r\n-------------------------------\r\nI do not like the default dwarven armor art, so I decided to use its mesh to create a whole new armor, looking for an art concept dwarven ancestors would have created /used before the dwarvens that created the armor placed in game had all of their \\'advanced metal ability\\', like if this armor was an obsolete version of it, a relic found by you. Just think about the evolution of human species for example, first we used stones, than we used metals.. and this can not be very different from the possible history of the race we are discussing about. My point is, (going deeper now) even if they were separeted from the other elven cultures in some point, a cultural differentiation had to be happening for a quite long time (and a huge, old one to cause such harm), that is why I think the dwemer culture was raising in a parallel line with the others (thing that causes some artistic and militaristic differentiation), but, in some point, they\\'ve discovered the use of metal and used this advanced tecnology to excel themselves aganist this races, and from that point ultil their disappearance I agree that they\\'ve only used metal craft tecniques. Furthermore, our mind (that may not be much different from the dwemers) is uncapable of thinking on perfect opposites without using previous knowledge and models, for example, try to create a functional terrestrial animal without using articulations, cartilages or a sidewinding sistem that is not carnivorous, herbivorous or omnivorous... it is impossible, that is why their culture had to be growing for a few centuries even with a life inside other cultural ideas, there is no logic in a complete and sudden rupture. But, I\\'ll not be discussing lore issues anymore, since I am truely satisfied with the retexture I\\'ve made knowing it makes sense.. And I do not understand why such harm happened as Skyrimnexus is fulfilled whit anime/manga, sexualized and imature modification files and no one (or just a few) is there to say that it does not makes sense. \r\n",
  "categoryId": "54",
  "version": "2.0",
  "author": "InwardScreams",
  "createdUnix": "1328305853",
  "updatedUnix": "1328306818",
  "containsAdultContent": false,
  "uploadedBy": "InwardScreams",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25641",
      "name": "Ancient Dwemer Armor HD",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "89406",
      "fileName": "Ancient Dwemer Armor HD-7714.zip",
      "uploadedUnix": "1328306818",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/6f96ec106cbcb384c9576be2ee0bc4be1b4dd79439d71daaea74cdaafa9a0792/analysis/1406652316/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ancient%20Dwemer%20Armor%20HD-7714.zip?fid=25641&ttl=1535765957&ri=8192&rs=8192&setec=e998eeaeb8d1bebc3e9c9286485d3c5e"
    }
  ]
}