{
  "modId": 77168.0,
  "modName": "Powerup Dragons",
  "summary": "",
  "descriptionHtml": "Powerup Dragons by TayusaiA new MOD to power up dragons.\r<br />\r<br />&lt;to install&gt;\r<br />After dropping “Powerup dragons.esp“ file into data folder in skyrim folder, turn it on with your MOD manager. I don’t recommend installing on a saved game.\r<br />\r<br />&lt;to uninstall&gt;\r<br />Remove “Powerup dragons.esp“ file from data folder in skyrim folder. Since leveled list has been edited, it might cause some CTD when spawning dragons.\r<br />\r<br />&lt;required DLC&gt;\r<br />・Dawnguard\r<br />・Dragonborn\r<br />\r<br />&lt;MOD contents&gt;\r<br />・Boosted dragons’ HP. Almost 1.5 times vanilla’s HP.\r<br />\r<br />・Powered up breaths. High level dragons’ breath has been highly powered up. Make sure you have enough potions before fighting.\r<br />\r<br />・Powered up melee and added stagger effect. It’s highly recommended to use dodging when fighting. \r<br />\r<br />・Edited leveled list to make ice related dragons spawn less. Frost breath will only be used by Frost Dragons or the legendary Serpentine Dragons.\r<br />\r<br />・Boosted dragons special perk “Dragonskin”. Damage dealt by NPCs will be reduced 90% making them almost useless when fighting a dragon.\r<br />\r<br />・Blood dragons now will use “Dismaying shout”. NPCs up to lv 50 will be affected. Player will only stagger.\r<br />\r<br />・Frost dragons will now use “Ice form shout”. Shout effect will last 3 seconds, but might be enough to be killed. I recommend using shield spells to avoid damage.\r<br />\r<br />・Elder dragons will now use “Unrelenting force shout”. Immediate death might be possible if thrown down a hill. Shield spells are recommended.\r<br />\r<br />・Frost dragons as strong as Ancient dragons will now spawn. They look pretty much the same as normal Frost dragons. Don’t let your guard down.\r<br />\r<br />・Legendary dragons will now use “Storm call shout”. This will make rays fall from the sky. It’s almost impossible to dodge them, so be sure to keep your health high.\r<br />\r<br />・Ancient dragons’ fire breath will now continue to burn the ground, and it will inflict damage to the player. Also a Frost dragon as strong as Ancient dragons will now spawn. When this Frost dragon’s frost breath hits the ground, it’ll freeze and it will cause damage.\r<br />\r<br />・Serpentine dragons will now use “Cyclone shout”. If hit, it will throw the target into the sky. The cyclone itself isn’t so fast, you may be able to avoid it.\r<br />\r<br />・Named dragons which would change their aspect depending on player’s level will now have a single aspect. They use the attacks that type of dragon would. Although, melee attacks, breaths and HP will increase with player’s level.\r<br />\r<br />Mirmulnir　→　Dragon\r<br />Sahloknir　→　Blood Dragon\r<br />Vuljotnaak　→　Frost Dragon\r<br />Nahagliiv　→　Elder Dragon\r<br />Viinturuth　→　Legendary Dragon\r<br />\r<br />・Vulthuryol will now use “Fire storm shout”. Also, places hit by fire breaths will now continue burning. Since it’s a hidden dragon, I made him stronger than others. This dragon’s strength will depend on player’s level.\r<br />\r<br />・Paarthurnax will now use “Clear skies shout”. He’ll be a good support to fight Alduin.\r<br />\r<br />・Naaslaarum and Voslaarum will now use “Drain vitality shout”. Also, Naaslaarum will use frost breath, Voslaarum will use fire breath. It might be hard to battle the two of them at once. Also their level will change depending on player’s level.\r<br />\r<br />・Odahviing will use “Unrelenting force shout”. His level will also depend on player’s level, making him a good support if you call him with “call dragon”.\r<br />\r<br />・Durnehviir’s HP & breath will change depending on the level. The battle at Soul Cairn will be harder, but he’ll also be a good support when you summon him.\r<br />\r<br />・Krosulhah will use fire and frost breath. Be sure to have protection from both elements.\r<br />\r<br />・Alduin will now use “Unrelenting force” and “Storm call” shouts. In addition, his Meteor attack will now have a larger range. Be sure to heal yourself every time you have a chance.\r<br />\r<br />・When you fight Alduin in Sovngarde, he will burn the ground with fire breath, and freeze it with frost breath. In addition, his defense against magic has been powered up, so Dragonrend’s effect will be shorter. You’ll have to use it more frequently.\r<br />\r<br />・Civilian NPCs will now flee when a dragon attacks. Only guards and soldiers will try to fight. This should lower NPC deaths, but there are some civilian NPCs who will try to fight anyway, so be careful.\r<br />\r<br />&lt;Compatibility&gt;\r<br />・UltimateDragons\r<br />It should be compatible. Put “UltimateDragons” down in your load order.\r<br />\r<br />I don’t think it’ll be compatible with other dragon MODs.\r<br />\r<br />&lt;Version info&gt;\r<br />V1.2\r<br />・Added perk to make NPC flee from dragon.\r<br />・Ancient dragon and high level Frost dragon’s frost breath will now freeze the ground.\r<br />・Boosted Alduin’s HP. Added “Storm call” to Sovngarde’s Alduin. Will explode when hit.",
  "categoryId": "24",
  "version": "1.2",
  "author": "Tayusai",
  "createdUnix": "1468813122",
  "updatedUnix": "1468812705",
  "containsAdultContent": false,
  "uploadedBy": "tayusai",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000213599",
      "name": "Powerup Dragons V1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Powerup Dragons V1.2-77168-1-2.rar",
      "uploadedUnix": "1468812705",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/e86fe79081fca02575119fc7712a2bebdac507f3d902145d190c1a8e162415ad/analysis/1468812723/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Powerup%20Dragons%20V1.2-77168-1-2.rar?fid=1000213599&ttl=1535865829&ri=8192&rs=8192&setec=73d2bc1e37cc2c16eea330323b747205"
    }
  ]
}