{
  "modId": 77253.0,
  "modName": "Tips for neck seams or texture mismatches between Head and Body of Custom Followers",
  "summary": "Some tips for fixing/reducing neck seams/texture mismatches between Head and Body of Custom Followers",
  "descriptionHtml": "Neck seams/texture mismatch\r<br />\r<br />Since I have spent some time trying to figure things out, I figured I would write down some of the things I&#39;ve done to try to reduce neck seams/texture mismatches, in particular for custom followers. \r<br />\r<br />I download a lot of followers and I take screenshots of them, especially close-ups of the face.  Unfortunately, I notice that sometimes the face/neck and body don&#39;t match in texture or there is even a black gap.  \r<br />\r<br />Tools that are needed for some of the steps\r<br />Creation Kit CK ([url=http://www.creationkit.com/index.php?title=Main_Page]http://www.creationkit.com/index.php?title=Main_Page[/url])\r<br />NifSkope ([url=http://niftools.sourceforge.net/wiki/NifSkope]http://niftools.sourceforge.net/wiki/NifSkope[/url])\r<br />NPC Nif Merge ([url=http://www.nexusmods.com/skyrim/mods/40494/?]http://www.nexusmods.com/skyrim/mods/40494/?[/url])\r<br />GIMP ([url=https://www.gimp.org/downloads/]https://www.gimp.org/downloads/[/url])\r<br />RaceMenu ([url=http://www.nexusmods.com/skyrim/mods/29624/?]http://www.nexusmods.com/skyrim/mods/29624/?[/url])\r<br />Bodyslide ([url=http://www.nexusmods.com/skyrim/mods/49015/?]http://www.nexusmods.com/skyrim/mods/49015/?[/url])\r<br />\r<br />Note: Some of the steps may make more sense if you have gone through the process of making a follower yourself using Make a Follower Kit MAFK by Ashes2Asherz\r<br />[url=http://www.nexusmods.com/skyrim/mods/76828/?]http://www.nexusmods.com/skyrim/mods/76828/?[/url] \r<br />or following video by Bad Apple Pie\r<br />[url=https://www.youtube.com/watch?v=3I1nvXOb3T4]https://www.youtube.com/watch?v=3I1nvXOb3T4[/url]\r<br />\r<br />which has detailed steps and instructions.  This tutorial will assume at least basic/intermediate knowledge of the tools, so I won&#39;t go into specific details about basic use of the tools themselves.\r<br />\r<br />Format will be in 2 sections, one for texture mismatch and one for neck gap, each with a list of things to check/repair. \r<br />\r<br />I&#39;ll use example of eriann follower from my game and reference the associated eriann.esp\r<br />\r<br />I. Texture mismatch\r<br />Ia. Path Issues\r<br />Probably one of the easier to fix issues if it is simply a texture path issue. \r<br />Open up xxxxxxxx.NIF (where x may vary and matches ID of follower) with NifSkope under the FaceGenData directory of the follower and \r<br />&#92;meshes&#92;actors&#92;character&#92;FaceGenData&#92;FaceGeom&#92;eriann.esp\r<br />Navigate as shown in Image 1 until you have selected BSShaderTextureSet for the head and see the texture paths. \r<br />If the follower is using the default skin\r<br />textures&#92;actors&#92;character&#92;female&#92;femalehead.dds\r<br />For custom skin\r<br />textures&#92;actors&#92;character&#92;eriann&#92;femalehead.dds\r<br />Check in CK to see if the follower is using default or custom skin for the head and rest of the body parts and all the texture paths match. Most commonly, the follower may have been set up with custom textures, but the paths in the FaceGenData NIF file was not updated with the custom texture paths.\r<br />\r<br />Ib. Change Entire set of textures\r<br />Sometimes if the skin textures is not from a complete set, such as different files from different sources, an easy fix may be to copy paste from a complete set of texture files for head, hands, body (4 each including the _msn, _sk, _s for 12 standard) to replace the texture files that were originally packaged with follower.  Alternatively, you can switch to using the default skin in CK by selecting the follower under Actor category and changing the &#34;Skin&#34; to &#34;SkinNaked&#34; in the &#34;Traits&#34; tab.\r<br />\r<br />As in Ia, any changes, have to make sure everything is consistent between CK and the head NIF in FaceGenData.\r<br />\r<br />Ic. Redo Head/Face\r<br />If the quick fixes don&#39;t work, the next thing to try is to redo the head/face.\r<br />First you&#39;ll take original FaceGenData &#92;meshes&#92;actors&#92;character&#92;FaceGenData&#92;FaceGeom&#92; under the follower&#39;s esp and import into RaceMenu (watch video https://www.youtube.com/watch?v=MGpnugyCOyk if you are not familiar with this process)\r<br />Of particular importance is to note the specific texture numbers for the skin and weight (refer to Make a Follower Kit MAFK website linked above) so that it can be matched in the CK.  Export the head using RaceMenu, make the necessary changes in CK to match, and then Ctrl-F4 to face gen data for the selected follower in actors.  Merge using the NifMerge with the RaceMenu export as source and the CK facegen as target. \r<br />\r<br />Id. Redo everything from scratch\r<br />If all else fails, may just be best to start over by importing the original FaceGenData NIF into RaceMenu and following one of the guides to create a standalone follower.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />-----------------------------------------\r<br />II. Neck Gap\r<br />If there is larger visible gap between head and body, more than just a thin line, there may have been a weight mismatch between the head and body.\r<br />IIa. Generate same weight body in Bodyslide\r<br />In Bodyslide, you can create a custom preset of your favorite body shape and use either the &#34;copy low weight&#34; or &#34;copy high weight&#34; arrows near bottom to generate a body that basically looks the same at weight 0-100 (except for the seams at the neck/hands/feet). *Note, this is also useful to customize the look of a followers body shape without touching the weight in CK.\r<br />IIb. Redo Head/Face\r<br />If the above doesn&#39;t work, will be similar to Ic above to make sure the weight is set to the same value in RaceMenu and CK before any exporting from RaceMenu/face gen from CK, ie weight 100. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />----------------------------------------\r<br />III. Potential issues\r<br />1. Pink/Red forehead on follower\r<br />You may need to manually edit the dds facegen textures located in \r<br />&#92;textures&#92;actors&#92;character&#92;FaceGenData&#92;FaceTint&#92; under the follower&#39;s esp name folder \r<br />using the tool GIMP.  You can use the color dropper to select the skin tone and use paint bucket tool to replace the red/pink section with the skin color.  Save/overwrite the original. \r<br />2. Different texture effects between different body parts\r<br />Make sure the &#34;BSLightingShaderProperty&#34; properties, in particular &#34;Glossiness, Specular Strength, Lighting Effect&#34; are same in NifSkope. See Image 2.",
  "categoryId": "82",
  "version": "1.0",
  "author": "pringles89",
  "createdUnix": "1469086301",
  "updatedUnix": "1469132685",
  "containsAdultContent": false,
  "uploadedBy": "pringles89",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000213974",
      "name": "Tips",
      "version": "1.01a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "320",
      "fileName": "Tips-77253-1-01a.7z",
      "uploadedUnix": "1469132685",
      "modVersion": "1.01a",
      "virusScanUrl": "https://www.virustotal.com/file/9c1ede6828c8cb507753e87c7ee1df05b8ebe448c50cb2940589bb4925519892/analysis/1469132706/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tips-77253-1-01a.7z?fid=1000213974&ttl=1535865907&ri=8192&rs=8192&setec=bcabd0dffaedc51a760eaeba66568c79"
    }
  ]
}