{
  "modId": 77260.0,
  "modName": "Diverse Civil War Soldiers",
  "summary": "Adds more diversity to the standard soldiers of the Civil War.",
  "descriptionHtml": "The title says it all.\r<br />\r<br />This mod adds variety to the civil war soldiers by increasing diversity in races and ranks in a lore friendly manner.\r<br />\r<br />[u]For the Legion[/u]:\r<br />-Significantly increase racial variety, the Legion is supposed to be the most diverse army in the whole of Tamriel, but in the vanilla game it only has 3 races, with this mod the Legion has soldiers of all the races in Tamriel, the new races still use the default soldier voices due to the lack of sufficient voices for the other races. now before you complain about certain provinces not being in the Empire anymore, it is stated in the game that the Legion recruits locally from time to time, and even if its just in Skyrim, its already more than enough to justify racial diversity.\r<br />\r<br />-Added female legionnaires\r<br />\r<br />-Added ranks, now instead of every Imperial Soldier essentially being the same kind of warrior with a sword and bow, there are now Soldiers, Archers, and Battlemages, as well as the addition of a new Centurion class of elite soldiers.\r<br />\r<br />-Standard soldiers will use the heavy version of imperial armor as well as the light versions\r<br />\r<br />-Changed names for Imperial Soldier to Imperial Legion Soldier\r<br />\r<br />-Boosted Stats (trained soldiers in the army should be far stronger than the average bandit)\r<br />\r<br />[u]For the Stormcloaks[/u]:\r<br />-Added a slight chance of a non Nord spawning but considering that the Stormcloaks are essentially a rebellious army of Nords, racial variety is unlikely to be high\r<br />\r<br />-Added ranks of Soldier, Archer, and the Stormcloak equivalent of the Centurion, the Warbear, I did not add any magic users because from the lore and opinions of the various nordic denizens of Skyrim, many Nords seem to be opposed and suspicious of magic and since the Stormcloaks seem to follow traditional Nord values, this would seem logical\r<br />\r<br />-Boosted Stats\r<br />\r<br />\r<br />[u]Additional Notes\r<br />[/u]-This mod uses entirely vanilla assets and only modifies the civil war soldiers and nothing else\r<br />\r<br />-No scripts are used in this mod\r<br />\r<br />-Feel free to report any bugs or give any suggestions\r<br />\r<br />\r<br />[u]Known bugs/issues\r<br />[/u]-Facegen data issues cause the colors of the face and body to be mismatched on some new npcs (as seen in some screenshots)\r<br />\r<br />-Some of the quest specific quotes/dialouge, such as the first mission in Korvanjund, won&#39;t work because the voices simply werent implemented for that specific voice type, this is mainly an issue with female Imperial soldiers\r<br />\r<br />[u]New in Version 1.1\r<br />[/u]-Added Imperial Captains and Stormcloak Shieldmaidens as per request\r<br />\r<br />-Fixed some of the facegen issues, not all but its only a visual problem, shouldent be too bad\r<br />\r<br />-Added some more races and more overall polish",
  "categoryId": "33",
  "version": "1.1",
  "author": "Opij",
  "createdUnix": "1469135330",
  "updatedUnix": "1469215854",
  "containsAdultContent": false,
  "uploadedBy": "opij",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000214078",
      "name": "Diverse Civil War Soldiers",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "Diverse Civil War Soldiers-77260-1-1.rar",
      "uploadedUnix": "1469215854",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1df72d5bb8def43900c5b2d71f229de74fa9197eb33f01374f1382d467c65645/analysis/1469215865/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Diverse%20Civil%20War%20Soldiers-77260-1-1.rar?fid=1000214078&ttl=1535865916&ri=8192&rs=8192&setec=452a74f3a5f3380c35da06a7ee9cd7b3"
    }
  ]
}