{
  "modId": 7737.0,
  "modName": "Imperial Templar Armor",
  "summary": "Adds Imperial Templar Armor to Skyrim",
  "descriptionHtml": "[img]http://img40.imageshack.us/img40/3318/templarbanner.png[/img]\r\n\r\nWhat this mod does;\r\n\r\nThis mod adds Imperial Templar Armor, ala Morrowind style, into the world of Skyrim. \r\n\r\n\r\nInstallation;\r\n\r\nJust open the .zip file and extract to your Skyrim directory.\r\n\r\n\r\nHow to get the armor;\r\n\r\nThe Templar Armor is easily obtainable, if you have the gold or materials. The Templar Armor can be obtained in these ways;\r\n\r\n-Buyable from Warmaiden\\'s in Whiterun and from the Blacksmith in Solitude\r\n-You can craft it yourself, and even temper the armor.\r\n\t-The materials needed for this are similar to the standard Imperial Armor, however, since\r\nthe Templar Armor is gold, gold ingots are required.\r\n\r\nThere are 2 types of cuirasses, the standard Imperial Templar Armor, and then the Imperial Templar Officer Armor.\r\n\r\nThe Imperial Templar Armor works with all races/genders.\r\n\r\nThere\\'s currently an problem with amulets clipping through the Officer Cuirass. Attempting to resolve that.\r\n\r\nAs for stats, the armor is heavy armor, and has the same stats as Dwarven Armor, with the exception of the Officer Cuirass and Full Faced Helmet, which have the same stats as Orcish armor. I thought this suiting as the Imperial Templar armor is supposed to be significantly stronger than it\\'s standard Imperial counterpart, but does not make to too overpowered, or improperly balanced against other armors (such as Ebony or Daedric)\r\n\r\nPermissions and Usage;\r\n\r\nFeel free to use this as you please, just remember to give credit where\\'s it due. If you do use this armor within a mod of yours, I would always enjoy a PM with a link to the mod so I can the different ways it\\'s being used.\r\n\r\n\r\nNotes;\r\n\r\nIf you notice any bugs with the mod, please report them. It would be much appreciated. Also, if you enjoyed the Imperial Templar Armor mod, check out Ethas: Embrace of Destiny, a modification Elijah Houck, the creator of the Alton, Il. mod for Fallout 3, and I are working together on. You can check it out at [url=\\\"http://www.ethasproject.com/\\\"][size=\\\"4\\\"]www.ethasproject.com[/size][/url] or check it out on the [url=\\\"http://forums.nexusmods.com/index.php?/topic/519199-wip-ethas-embrace-of-destiny/\\\"]Nexus Forums[/url]\r\n\r\n[img]http://dl.dropbox.com/u/6619370/EthasSig.png[/img]\r\n\r\n\r\nThanks for downloading, and if you enjoyed it, endorse! Have a pleasant day within the snow filled reaches of Skyrim!",
  "categoryId": "54",
  "version": "1.0",
  "author": "jhardingame",
  "createdUnix": "1328329467",
  "updatedUnix": "1328329597",
  "containsAdultContent": false,
  "uploadedBy": "jhardingame",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25715",
      "name": "Imperial Templar Armor",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7311",
      "fileName": "Imperial Templar Armor-7737-1-00.zip",
      "uploadedUnix": "1328329597",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/980afaebfb06bd19b053f4fb78800e955d3fe236782927db9e623316d8a534ed/analysis/1406652677/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Templar%20Armor-7737-1-00.zip?fid=25715&ttl=1535765993&ri=8192&rs=8192&setec=c5bdcf7de2dad83bb818c44366848cb1"
    }
  ]
}