{
  "modId": 77372.0,
  "modName": "O&#39;Sullivan&#39;s March The Chieftains",
  "summary": "Main menu theme music change",
  "descriptionHtml": "This replaces the main theme music of Skyrim with O&#39;Sullivan&#39;s March by The Chieftains. It&#39;s a traditional Irish song ...\r<br />\r<br />[youtube]mpkrr0-qut4[/youtube]\r<br />\r<br />The Beara Peninsula (Béarra) is a place of great natural beauty straddling the borders of West Cork and Kerry in the south west of Ireland. It is also part of the ancestral homeland of the O’ Sullivan clan who are able to trace their ancestry to the Eoghancht of Munster. The two main septs of the clan are the O’ Sullivan Mór and they held the area now known as the Ring of Kerry. The baronies of Beare and Bantry were held by the O’ Sullivan Beare who came to prominence during the 16th century. During the Elizabethan period the leadership of the sept had fallen to Domhnaill Cam Ó Súileabháin) through the English law of primogeniture, which asserts the rights of the first son to inherit titles and properties. He assumed the title Daniel Cam O’Sullivan, Prince and 1st Count of Berehaven in 1587 when he was approximately 26 years old. In 1600 O’Sullivan joined with Hugh O’Neill and Hugh O’Donnell against the English. They believed that Spain would be able to help them but after a Spanish force capitulated at Kinsale in 1601 the Irish were left to their own devices. The English under Sir George Carew, well known for his ruthlessness, moved against the O’ Sullivan castle at Dunboy in 1602. A fierce battle took place and they killed all 143 defenders. Daniell O’Sullivan was at the castle of Ardlea and realised what would now happen to him and his family. He decided that he would head north to O’ Neill lands.\r<br />\r<br />\r<br />[size=5][b]Historic March of 1603[/b]\r<br />[/size]\r<br />The Battle of Kinsale began on the 17th of October 1601 with the 3400 Spanish soldiers under the command of Aquilla supported by O&#39;Sullivan Bere, O&#39;Driscoll and the O&#39;Connors of Kerry. Aquilla surrendered on the 12th January 1602 and handed over the four Spanish defended castles along the South West Coast. Donal Cam, chieftain of the O&#39;Sullivan Bere Clan rushed back to Dunboy and began to fortify the castle against an attack that started on June 6th and lasted 11 days with the Crown forces finally storming the castle after bombarding it with cannon-fire.\r<br />\r<br />[b][size=4]Glengarriff[/size][/b]\r<br />\r<br />O&#39;Sullivan the Chieftain of Dunboy castle began his forced march from the woodland of Glengarriff. After his defeat and retreat from his fortress he sheltered for a time in the area known as Doire Na Fulla (The Oak Tree of the Blood). Legends will say that many of the primitive stone shelters encountered in the mountains, date from this settlement. There is no doubt however that the oak woodland, more extensive at that time, would have been an ideal base from which to regroup his forces. He left on December 31st and with him he had 400 soldiers and 600 women, children and servants. Their haste was so desperate that they had only one day’s provisions, to begin his retreat to Leitrim and it is said that his wife and young child stayed behind and sought shelter in a place known as Eagle&#39;s Nest, During this part of the march, O’ Sullivan’s wife had to give her 2 year old son into the safe-keeping of a servant. This servant was able to escape and afterwards get the child safely to Spain. O&#39;Sullivan past by Carriganass Castle, the last of the O&#39;Sullivan castles. He travelled over the hills onto Gougane Barra. From here he had the last view of the Beara Peninsula and Bantry Bay, which his family ruled for over 400 years.\r<br />\r<br />[size=4][b]Ballingeary[/b][/size]\r<br />\r<br />When O&#39;Sullivan Bere made his epic retreat in 1602, his first camp was An Teampaillin, Augheris, 5km north toward St. Gobnait&#39;s shrine in Ballyvourney, O&#39;Sullivan had his misfortune to lose his horse, known as An Cearc, drowned in a place known to this day as Poll an Circe (The Hole of the Hen). The first of the great many losses they suffered that winter.\r<br />\r<br />[size=4][b]Ballyvourney[/b][/size]\r<br />\r<br />O&#39;Sullivan Bere rested awhile in St. Gobnait&#39;s shrine, a pilgrimage site which had been granted a papal indulgence by Pope Clement the 8th in 1601. Here they prayed for a safe journey northwards but in spite of their best endeavours they were attacked in Ullanes by a garrison from the Mac Carthaigh castle from nearby Carrig a Phuca and although the enemy were defeated. The clan lost a lot of their baggage in the skirmish. Dunhallow From Muskerry, O&#39;Sullivan Bere traveled north east to ford the river Blackwater at Boinng Ford near Millstreet and was afforded food and hospitality by O&#39;Keefe at Boinng Castle. Some O&#39;Keefes attacked them nearby at Flintfield and the McCarthys of Drishane and Kilmeedy tried but also failed to ambush them. They traveled north to Clonfert (Newmarket) via Maher and Derrinaturbid and were welcomed by Mc Auliffe. On hearing of a threatened attack by Barrys of Buttevant they swung eastwards to Freemount, Ardfinnan and the Glen of Aherlow rather than risk a direct approach to the River Shannon.\r<br />\r<br />[size=4][b]Ballyhoura[/b][/size]\r<br />\r<br />O&#39;Sullivan Bere made his crossing through Ballyhoura country leading west past Kanturk and Newmarket. Here they fought their first major engagement against an English garrison who were also assisted by the Barrys when crossing a ford near Liscarroll. The Queen&#39;s army was forced to retire through hunger and fatigue. The column had now to cross the Golden Vale to get to the safety of the Slieve Felims. At Kilmallock, the &#34;White Knight&#34; and his mercenaries attacked. They were then attacked at the rear by the previous day&#39;s assailants but succeeded in avoiding a clash. Chief town of the Golden Vale is Kilmallock, capital of the Earls of Desmond. Mercenaries of the White Knight, the Gibbons, men from Limerick City and some Crown forces, in all making up more a mob than an army, came upon O&#39; Sullivan&#39;s host, making for the mountains. This battle may have been in the region of Knockany, Hospital or Emly. It was by far the fiercest battle that the refugees had suffered thus far.\r<br />\r<br />[size=4][b]O&#39;Sullivan Bere Walk Through the Slieve Felim Area[/b][/size]\r<br />\r<br />After their heavy losses O&#39;Sullivan and his men reached Slieve Felim, where the Twelve Peaks are seen. They camped at Solohead (sulchoik, the Sallow Wood) - a famous place, made famous by Brian Boru, Dan Breen and Sean Treacy. Here they recovered themselves and set off for Donohill (Dun Eochaille, fort of the Yew Wood) there was a considerable store of food. Their hunger gave them the courage to storm the place and gain access to the food-supplies. Onwards towards Cappawhite. So numerous were their attackers that the fugitives feared complete destruction. Ormond left them no choice but to defend themselves by attacking. This they did with some success, but also with more losses. Out of O&#39;Sullivans one thousand followers only two thirds now lived. On the way they marched the road which climbs the side of Knockafine, and on to the peak of Slieve Kimalta (Sliabh Coimealta, Keeper Hill) which is nearly the highest summit seen in all the march. That night they camped at Latteragh. Then onto Knockshegowna, Lackeen and towards the river Shannon where it enters Lough Derg.\r<br />\r<br />[size=4][b]Shannon Crossing[/b][/size]\r<br />\r<br />When O&#39;Sullivan reached the Shannon Crossing, there was no boats to be found. O&#39;Sullivan decided to kill his horses, which he ate and used the skins of the horses to make currachs. Two currachs were made. One by the Beara men, which was long and thin. The second by the Connaught men which was more traditional (a currach is a little tubby craft). The Connaught boat sank on its first crossing. O&#39;Sullivan got most of his followers across but was attacked by Donough MacEgan the sheriff of Tipperary from Redwood Castle on the Tipperary side and lost even more of his followers who were drowned in the river. O’Sullivan killed the sheriff himself and the pursuers fled leaving many dead.\r<br />\r<br />[size=4][b]East Galway[/b][/size]\r<br />\r<br />O&#39;Sullivan fought his way up to Aughrim, raiding villages along the way for food. O&#39;Sullivan was again attacked north of Aughrim and was outnumbered three to one but his soldiers were well trained and fought a daring battle and won the day.\r<br />\r<br />[size=4][b]O&#39;Sullivan Bere&#39;s March Through The Suck Valley[/b][/size]\r<br />\r<br />The River Suck Valley-Galway/Roscommon Border........\r<br />At nightfall on January 11th 1603 O&#39;Sullivan and his followers arrived on the Southern slopes of Sliabh Mhuire (Mt. Mary) between Ballygar and Creggs, tired and battle weary after their encounters at Aughrim they decided to set up camp for the night. When they awoke the following morning the whole area was covered in a thick blanket of snow. Many of his followers were to stay behind on the mountain while others died of exposure and exhaustion. The following day as O&#39;Sullivan Bere and thouse who continued to follow him moved Northwest to Glens castle they had hoped to get help from the locals but found that the landlord McDavid Burke had organised his people against him. They approached Glinsk Castle only to be turned away but later returned with flags and drums captured at Aughrim, but the Burkes were not to be fooled and O&#39;Sullivan and his men were chased to Sliabh O&#39;Flynn near Ballinlough.\r<br />\r<br />[size=4][b]North Roscommon[/b][/size]\r<br />\r<br />O&#39;Sullivan passed Lough Gara, travelled over the Curlew mountains and the Bricklieve mountains and on around Lough Arrow down to Knockvicar. It is claimed that O&#39;Sullivan Bere found the people of the Northwest friendly and more neutral than the people from other regions through which he had already passed. O&#39;Sullivan passed through the village of Knockvicar, passing by Lough Key - an area which Arthur Young referred to as the Killarney of the West -&#34;It is one of the most delightful scenes ever beheld - a lake of circular form, bordered very boldly by mountains....&#34; At Knockvicar O&#39;Sullivan&#39;s people rested for the last time and from here the warriors made their way through forested areas en-route to their final destination.\r<br />\r<br />[size=4][b]Leitrim[/b][/size]\r<br />\r<br />The last part of O&#39;Sullivan&#39;s long voyage took him from Knockvicar to Leitrim where he hoped to meet with O&#39;Rourke in O&#39;Rourke&#39;s Castle. However by this time only thirty-five of the original one thousand men had survived the journey. Fourteen days after he had led his convoy of 1,000 followers out of his own land, Daniell O’Sullivan reached the territory and protection of the O’Rourkes of Breffeny. Only 35 of them entered Leitrim Castle. Later a few more would drift in but the vast majority had fallen to their enemies, hunger and exposure. A stone has been erected on the ruined wall of the Castle with the O&#39;Sullivan and O&#39;Rourke coat of arms the inscription reads - &#34;Here on January 4th 1603, arrived Donal O&#39; Sullivan Bere and his followers after the epic march from Beara Peninsula in fourteen days....&#34;. O’Rourke sheltered O’Sullivan Beare and his band until he was able to help them obtain passage to Spain. In that country Daniel O’Sullivan was greeted by the King and who treated him as a royal prince.",
  "categoryId": "61",
  "version": "1.0",
  "author": "walshy71",
  "createdUnix": "1469471143",
  "updatedUnix": "1469471139",
  "containsAdultContent": false,
  "uploadedBy": "walshy71",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000214435",
      "name": "O Sullivan&#39;s March by The Chieftains",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2852",
      "fileName": "O Sullivan's March by The Chieftains-77372-1-0.zip",
      "uploadedUnix": "1469471139",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7c36ecf60af621f8739b0dcf7d64803d159087f20c6e5c9f93baa30e815e45ce/analysis/1469471164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/O%20Sullivan%27s%20March%20by%20The%20Chieftains-77372-1-0.zip?fid=1000214435&ttl=1535866027&ri=8192&rs=8192&setec=a2760be4ca6c93bd02019b9d3d56e86b"
    }
  ]
}