{
  "modId": 77383.0,
  "modName": "Granny Weatherwax outfit",
  "summary": "When I decided to try an Illusionist character build based on Terry Pratchett&#39;s Granny Weatherwax (unsurpassed Headologist, protector of children, terror of trolls, dwarves, and her neighbors) I wanted more suitable clothing than the basic game provides.  Granny didn&#39;t hold with witchy paraphernalia, but she did insist on a good hat, a serv",
  "descriptionHtml": "This mod is now included in &#34;Granny Weatherwax modular package&#34; (http://www.nexusmods.com/skyrim/mods/80298/?), which adds a cottage and herb garden, and the ability to fly a broomstick and turn people into frogs.\r<br />When I decided to try an Illusionist character build based on Terry Pratchett&#39;s Granny Weatherwax (unsurpassed Headologist, protector of children, terror of trolls, dwarves, and her neighbors) I wanted more suitable clothing than the basic game provides.  Granny didn&#39;t hold with witchy paraphernalia, but she did insist on a good hat, a serviceable black dress, and sturdy boots.  These plugins try to provide that.\r<br />The basic plugin is &#34;Granny_Weatherwax.esp&#34;  This will allow you to modify the appearance of Illusionist&#39;s robes to use the game&#39;s &#34;Black robe&#34; model.  It also allows you to modify the Novice&#39;s Robe from Helgen.  You&#39;ll find them at the forge under &#34;Misc&#34;; needed ingredients are an enchanted robe and several linen wraps.  (The Novice robe needs only the forge and the robe, so you can get a character started quickly.)  You&#39;ll find &#34;Sturdy Boots&#34; under leather. \r<br />For a hat, use sirwho&#39;s Wizard Hats mod:  http://www.nexusmods.com/skyrim/mods/75318/?  If you&#39;d like, you can also install the &#34;Grannys_Hat.esp&#34; plug-in, which allows you to modify the Novice Hood from Helgen into an enchanted black witch&#39;s hat, and also allows forging hats from enchanted circlets.  Don&#39;t try the &#34;Grannys_Hat&#34; plugin without the Wizard Hats mod; it depends on sirwho&#39;s models, and won&#39;t work without them.  (The mod offers Wizard Hats in a wide range of colors; if you want to stick to basic black, just install the mod but only enable the plugin.)\r<br />You can make a very nice black cloak using Noodles&#39; Cloaks of Skyrim:  \r<br />http://www.nexusmods.com/skyrim/mods/12092/?\r<br />Finally, I highly recommend Chesko&#39;s Frostfall:  http://www.nexusmods.com/skyrim/mods/12092/?\r<br />It adds very interesting features to game play, including an alchemist&#39;s mortar and pestle which suits this character build rather better than the standard alchemist&#39;s worktable.  You can also use the Frostfall crafting menu to turn old clothes into useful linen wraps...",
  "categoryId": "60",
  "version": "1",
  "author": "blueboar",
  "createdUnix": "1469497494",
  "updatedUnix": "1469497487",
  "containsAdultContent": false,
  "uploadedBy": "blueboar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000214475",
      "name": "Granny Weatherwax outfit",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "319",
      "fileName": "Granny Weatherwax outfit-77383-.7z",
      "uploadedUnix": "1469497487",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fb29da947e503179634c6f601e77306a38bdb0ea4328a0f3a464b6af7e340d21/analysis/1469497508/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Granny%20Weatherwax%20outfit-77383-.7z?fid=1000214475&ttl=1535866038&ri=8192&rs=8192&setec=25776f8244e28db68190eda34fe3b7f8"
    }
  ]
}