{
  "modId": 77388.0,
  "modName": "Torch Craft",
  "summary": "Currently in BETA - Craft and improve your torch as you gather more resources, with further options to increase variability and gameplay. Features 3 improvement ranks for torches, new models and different look and attributes for each rank.",
  "descriptionHtml": "[color=#cc4125][size=5][center]This mod is best enjoyed alongside other mod that completely disables/turns off all the light sources present in a dungeon.\r<br />\r<br />[color=#cc4125][size=6][color=#cc4125][color=#cc4125]*[color=#cc4125]**[/color][/color][/color][/size][/color][/center][/size][/color]\r<br />This mod is a compilation or standalonization of several mods related to torches and aims to offer the player not only a broader variety of assets and models but an intuitive way to create and enjoy them.\r<br />\r<br />It offers a different experience for each torch you craft, and the potential to improve them, via crafting, to further attend the user&#39;s demands when it comes to delving into the dark depths of Skyrim, or simply have some variation to break the bore of always looking to the same torch.\r<br />\r<br />At this moment Torch Craft includes(in a mix of standalonizing and enhancing the usage of torches) a portion(relevant to its mechanics) of the following mods, and their authors have contributed to this mod immensely by allowing me to include their work here, thus their generosity is the heart of Torch Craft.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/52941/][size=4]A Simple Mod - Torch As A Weapon by Meatbag101[/size][/url] [size=2](currently under testings and improvements)\r<br />[/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/4764/][size=4]Torch of Everlasting with Dynamic Shadows by [b]EvilDeadAsh34[/b][/size][/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/64798/][size=4]Campfire - Complete Camping System by [b]Chesko\r<br />[/b]\r<br />[/size][/url][size=4][url=http://www.nexusmods.com/skyrim/mods/39813/]Torch Design 3D by [b]HXP[/b][/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/35819/]Smoking Torches and Candles by [b]mindflux[/b] [/url]\r<br />\r<br />[/size][center][font=Georgia]My sincerest gratitude, Torch Craft is a tribute to their work, contribution and relevance to my gaming experience and I feel very happy to be able to have their assets featuring this mod.\r<br />\r<br />[size=6]***[/size][/font][/center][color=#ff7700][size=5][b]Core Mechanics - It all starts with a simple torch[/b][/size][/color]\r<br />\r<br />[list]\r<br />[*][b][size=2]Torch Craft makes the regular torch upgradeable.[/size][/b]\r<br />[*][size=2]Each upgrade will feature a different experience; improving your torch will make it last longer, have a bigger radius and slightly change the model to visually provide the impression of a better torch.[/size]\r<br />[/list][font=Trebuchet MS]\r<br />[b][size=5][color=#ff7700]Note:[/color] [color=#ff7700]You need to have a torch equipped to be able to improve them[/color][/size][/b][center](take this as a double feature that not only helps with decluttering the crafting menu but also enhances the experience of legitimately seeking ways to improve your torch as you look at it)[/center]\r<br />\r<br />The three ranks for the regular torch are: \r<br />\r<br />[list]\r<br />[*][b][color=#ff0000]Flickering:[/color][color=#ff7700][size=2] [/size][/color][/b][size=2]intended to be the weakest and more annoying ones, they flicker and fluctuate a lot. Short in lifetime and radius, are usually better than nothing but won&#39;t go much farther.[/size]\r<br />[*][color=#ff7700][size=4][b]Reliable:[/b][/size][/color][size=2] provide a good balance between light and duration, these are the torches expected of those who take the time to gather resources and plan their expeditions accordingly.[/size]\r<br />[*][b][color=#e69138][size=4]STURDY:[/size][/color][/b][size=2] the recommended ones if you spend days out in the wilderness or delve into dungeons and dark depths often. Plenty of light and duration, they are the pride of plunderers.[/size]\r<br />[/list][/font][center][font=Georgia][size=6][b]***[/b][/size][/font][/center]The second most relevant feature of Torch Craft is to be able to turn any torch into one that casts shadows(and back). This further improves the experience by offering a dramatic approach to light and darkness; fight enemies and their menacing shadows, see them bouncing and offering incredible depth to the whole scene.\r<br />[b][center][color=#ff0000][size=4]Note: I advise against this if you don&#39;t use any ENB or have performance concerns\r<br />[/size][/color][/center][/b]Since it increments the amount of load and resources your computer will require to process, it will inevitably dim your FPS. Still, the improvement is undoubtedly worth of at least eventually turn your torch into this mode, and immerse yourself in the experience, it is also great for screenshots. You can turn your torch back anytime.\r<br />\r<br />[list]\r<br />[*][b][color=#ff0000][size=4]Torch of Delving: [/size][/color][/b][size=2]This is the name of the torches that will cast shadows. You can turn any torch into this mode and back, they will carry their improvements(there are 3 ranks for them as well) and are free(require one regular torch).[/size]\r<br />[/list]\r<br />[center][font=Georgia][size=6][b]***[/b][/size][/font][/center]Torch Craft includes additional torches and models that aren&#39;t upgradeable at this moment but provide further variability to your demands, being warrior or mage. The following torches are present in the current version and are [b][color=#cccccc][size=4]exclusively craftable at a blacksmith forge[/size][/color][/b] due to its metal properties:\r<br />\r<br />[list]\r<br />[*][b][color=#cccccc][size=4]Hardened Steel Torch:[/size][/color][/b][size=2][b] [/b]Endure the depths of Skyrim with a torch worthy of armored knights. In its special recipient, it holds a rare ingredient that will burn almost indefinitely, offering great support to anyone resourceful enough to yield it.[/size]\r<br />[*][b][color=#e69138][size=4]Torch of Soul Light:[/size][/color] [/b][size=2]Fueled by the souls contained in a glowing gem, this magically infused torch provides a reliable source of light while maintaining its yielder inspired by its power.[/size]\r<br />[*][size=2][size=4][b]Burdensome Steel Torch:[/b][/size] A heavy steel torch based off the ones fixed on imperial ruins walls, following the request/suggestion of Foedawg user in the comment section.[/size]\r<br />[/list][font=Georgia][size=6][b][color=#f1c232][center]***[/center][/color][/b][/size][/font][center][b]I&#39;d like to take a moment, if you&#39;re up for the reading, to further introduce this mod concept, and how it came to be with this...\r<br />\r<br />\r<br /> [color=#ff7700][size=3]Story Mode:[/size][/color][/b]\r<br />\r<br />[font=Trebuchet MS]Is Immersion your game? Great, this mod is for immersion.[/font]\r<br />[font=Trebuchet MS]If you&#39;re anything like me, Skyrim is the immersion it offers, and this mod is not so much for the different torches that feature it, but the one that casts shadows.[/font]\r<br />[font=Trebuchet MS]I love [/font][url=http://www.nexusmods.com/skyrim/mods/72594]Dynamic Immersive Seriously Dark Dungeons - Eternal Darkness Redone by jbvertexx[/url][font=Trebuchet MS] and the Hardcore module of [/font][url=http://www.nexusmods.com/skyrim/mods/27043]Enhanced Lights and FX by anamorfus[/url][font=Trebuchet MS] and before these, [/font][url=http://www.nexusmods.com/skyrim/mods/70454/]Eternal Darkness by SOT Team and jbvertexx[/url][font=Trebuchet MS] and even before them [/font][url=http://www.nexusmods.com/skyrim/mods/34569]Sightless Senses by kuertee[/url][font=Trebuchet MS] and [/font][url=http://www.nexusmods.com/skyrim/mods/51957/]Immersive Dark Dungeons by JakeOberg[/url][font=Trebuchet MS] and [/font][url=http://www.nexusmods.com/skyrim/mods/27960/]Blackout - Simply Darker Dungeons by Anaphiel[/url][font=Trebuchet MS] and finally the [/font][url=http://www.youtube.com/watch?v=8PedZazWQ48&t=2m44s]DICE 2012 Skyrim Game Jam about dark dungeons[/url][font=Trebuchet MS] got my attention as well, so, if there is one thing that makes me interested, is a [color=#000000][size=4][b]pitch-black dungeon.[/b][/size][/color][/font]\r<br />\r<br />[font=Trebuchet MS]Thanks to all the awesome modders out there, we&#39;ve got plenty of options and approaches on how to run blind in forts, caves, and dungeons, but there is something that still bugs me - irk - lights that don&#39;t cast shadows. And about every mod and experience provided, despite the immense amount of time and effort the modder has put into turning the lights off, having a bubble of unnatural light around you is quite boring and most of the times immersion-breaker.[/font]\r<br />[font=Trebuchet MS]Not just coincidentally, the first mod I&#39;ve downloaded for Fallout 4 was pip-boy light casts shadows, and you can imagine the disappointment once the lights started to pop in and out :([/font]\r<br />[font=Trebuchet MS]... anyway... with the latest attempts to turn off the lights, we have saved the amount of energy and resources to turn that high-performance cost shadow casting feature back on, and, despite the engine being able to render up to 4 shadow-casting light sources at a time, if there&#39;s none on, we&#39;ll be safe with our good old shadow bouncing torch.\r<br />\r<br />[/font]\r<br />[size=3]This mod is designed around this, I&#39;ve tried to keep it immersive, lore and campfire-friendly, thus easy to use. The survival power provided by the ingenious Chesko&#39;s Campfire has made gathering resources and crafting a lot easier(very close to how Fallout 4 accomplished it, an improvement to the system, IMO) and so this mod is an attempt to provide a further module based on what torches can do and be when it comes to versatility.\r<br />[/size]\r<br />[b][font=Georgia][size=6]***[/size][/font][/b][/center][center][size=3]This mod was originally planned to be a personal patch but I&#39;m happy it didn&#39;t since it allowed me to get in touch with people I&#39;m sincerely a fan of, and thus get them to know how I appreciate their work.[/size]\r<br />[size=3]So by all means, this mod is for you, Chesko, whose Campfire is the framework of this patch, EvilDeadAsh34 and his [/size]mesozoic[size=3] Torch of Everlasting with Dynamic Shadows(the original inspiration for this mod), Meatbag101 and the creative simple torch as a weapon with special thanks to TJBEK and [/size]jhelzei[size=3] for their contributions to the latter and insights regarding making weapons into light sources, artem1s for countless reasons specially regarding smoking torches, and HXP for the distinct models offered for torches and inspiration to make different types available to the player.[/size]\r<br />\r<br />[color=#ff7700][size=4][b]A few technical considerations:[/b][/size][/color][/center]\r<br />The delving torch, or the torch which casts shadows, is generally suggested to be used for interiors only(thus, can only be crafted in interiors). They can be used in exteriors but won&#39;t work as intended unless you have [b][color=#ff7700]bDeferredShadows=0[/color][/b] in your [color=#e69138]SkyrimPrefs.ini[/color]. \r<br />[b][color=#ff0000]Note that having this turned off(=0) will make your ENB behavior weirdly[/color][/b], what to expect is the loss of interior/exterior settings(given you have distinct values for them) and other problems I didn&#39;t check in depth, this issue alone made me turn the bDeferredShadows= back on(=1).\r<br />If you intend to learn more about Skyrim shadows, I suggest taking a look at this [size=3][b][url=https://www.reddit.com/r/skyrimmods/comments/2yxfu9/ive_been_playing_with_the_shadow_settings_in_the/]Reddit post[/url]. \r<br />\r<br />[/b][/size]The Skyrim engine limits the way we can explore and expand this mod usage, so instead of making every torch dynamic, I&#39;ve chosen the less problematic ones(and I&#39;ve spent days trying to figure the horseback, still no fix). Shadows add a whole lot to the way we can enjoy lighting in Skyrim, so...\r<br />\r<br />[b][center][color=#ff7700][size=6]... I highly advise everybody to set a proper ENB with shadows to cover the horrible vanilla shadow rendering.[/size][/color][/center][/b]",
  "categoryId": "100",
  "version": "BETA2",
  "author": "org wgperi",
  "createdUnix": "1469932434",
  "updatedUnix": "1486400483",
  "containsAdultContent": false,
  "uploadedBy": "wgperi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000235609",
      "name": "Torch Craft BETA2",
      "version": "BETA2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9391",
      "fileName": "Torch Craft BETA2-77388-BETA2.7z",
      "uploadedUnix": "1486400483",
      "modVersion": "BETA2",
      "virusScanUrl": "https://www.virustotal.com/file/2f7b90b93e8f2e4fd705a8f7930fcb3480643ac3ce872a52ae8fb73477cf71c4/analysis/1486400571/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Torch%20Craft%20BETA2-77388-BETA2.7z?fid=1000235609&ttl=1535866042&ri=8192&rs=8192&setec=fc20070bb0f5372b5dfab5d184cdde74"
    }
  ]
}