{
  "modId": 77447.0,
  "modName": "Bloody WaterFalls",
  "summary": "Replaces some waterfall waters on the game with red bloody water like",
  "descriptionHtml": "[b]Hello everyone,[/b]\r<br />\r<br />I&#39;m [b]Maredark3d[/b] here on Nexus (in other sites I&#39;m [b]Medieval 3D[/b])\r<br />\r<br />First of all I want to say thanks to Tamira who make the resurce of bloody waterfalls: [url=http://www.nexusmods.com/skyrim/mods/39263/]Bloodfalls Link[/url]\r<br />\r<br />I use Creation Kit to add those textures and meshes and create a new esp file\r<br />\r<br />\r<br />[b]Brief Story:[/b]\r<br />\r<br />A strange event took place on Tamriel, in Skyrim people had report to the local Jarls red water on rivers and lakes, a strange looking such as blood. The first report was from a farmer who said it was coming from the mountains going down by the rivers, an strange looking of the water, also he said didnt smell well like a kind of &#34;metallic&#34; smell, also other people report to the Jarls some creatures lurking on the night. The most awful and terrible report was from a woman who said his husband went to the forest to get some logs to the house to make it warm, he usually doesn&#39;t take too long, the night started to fall down and he didn&#39;t return, she saw some days ago a red amount of water going dawn by the river, she talk about with his husband but he said must be just a death animal on the river. His husband didn&#39;t return until was late at midnight, she saw him approaching to her with a strange walking, smell too bad as death, grunting and moaning, he approaches and attack her, she took his shovel and hit him but he reached to bite his hand, then she ran away on direction to the Jarl&#39;s Hold. She didnt made it, but before fall spoke with a neighbor who report it to the Jarl. When the woman died, that&#39;s when the man ran to the Jarl to inform about, the one who report was sent to his house with some guards to see on the woman who fall, but she wasn&#39;t there anymore...\r<br />\r<br />Installation:\r<br />\r<br />simple just drag the files on your Data folder of the game\r<br />\r<br />\r<br />Requirements:\r<br />\r<br />Skyrim Base Game\r<br />\r<br />\r<br />\r<br />[b]Credits:[/b]\r<br />\r<br />-[url=http://www.nexusmods.com/skyrim/users/776954]Tamira[/url]\r<br />-Bethesda",
  "categoryId": "29",
  "version": "1.0",
  "author": "Maredark3d",
  "createdUnix": "1469707478",
  "updatedUnix": "1469707175",
  "containsAdultContent": false,
  "uploadedBy": "maredark3d",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000214762",
      "name": "Bloody Waterfalls",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1193",
      "fileName": "Bloody Waterfalls-77447-1-0.rar",
      "uploadedUnix": "1469707175",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/66375ef5f1a32f1c3a4d3722105b9c30222c26d536f4b2ed11889f5961159973/analysis/1469707203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bloody%20Waterfalls-77447-1-0.rar?fid=1000214762&ttl=1535866090&ri=8192&rs=8192&setec=ed7bda5e7cc2715500e727ddea4c6b08"
    }
  ]
}