{
  "modId": 7756.0,
  "modName": "Als Artifacts of Tamrielic Lore",
  "summary": "Remember Yagrum Bagarn&#39;s book in Morrowind? Me too&#33;",
  "descriptionHtml": "[b][i][u]NO LONGER SUPPORTED[/u][/i][/b]\r<br />\r<br />You can find much better versions of most of these artifacts elsewhere on the Nexus.\r<br />\r<br />[b][i]Daedric Crescent[/i][/b]: Try [url=http://skyrim.nexusmods.com/mods/29356]Nimezis[/url] or [url=http://skyrim.nexusmods.com/mods/31391]criswolf09[/url].\r<br />\r<br />[b][i]Daedric Scourge[/i][/b]: [url=http://skyrim.nexusmods.com/mods/11195]RonnieMagnum[/url] made an excellent new mesh and texture for his, unlike mine, which is a vanilla mesh.\r<br />\r<br />[b][i]Fang of Haynekhtnamet[/i][/b]: [url=http://skyrim.nexusmods.com/mods/19756]wulfharth[/url]&#39;s mod has a custom mesh and texture, unlike mine, which is vanilla.\r<br />\r<br />[b][i]Umbra[/i][/b]: There are a crapton of Umbra mods. Pick which one you like best. Several of them use brand new meshes, unlike mine.\r<br />\r<br />[b][i]Goldbrand[/i][/b]: There are not one, but three great Goldbrand mods, each of which adds a custom mesh and/or texture for the sword. [url=http://skyrim.nexusmods.com/mods/15431]InsanitySorrow[/url] or [url=http://skyrim.nexusmods.com/mods/13835]RonnieMagnum[/url] or [url=http://skyrim.nexusmods.com/mods/5830]CaoMengde777[/url]\r<br />\r<br />**********\r<br />\r<br />AL&#39;S ARTIFACTS OF TAMRIELIC LORE v1.1\r<br />\r<br />(current as of Skyrim Patch 1.3)\r<br />\r<br />--A special thanks to Armored Thirteen for his Daedric Crescent meshes and textures--\r<br />\r<br />--Check out his original Daedric Crescent replacer mod at http://skyrim.nexusmods.com/downloads/file.php?id=4025 --\r<br />\r<br />OTHER MODS BY ME:\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=9994]Al&#39;s Treasure Vault[/url] -- [i]Now you have a place to store all your gold and have it display as treasure&#33;[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/12859]Al&#39;s Thunder Smite[/url] -- [i]Insta-Kill Enemies, and ONLY Enemies[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/25824]Al&#39;s Elsweyr Rift[/url] -- [i]Teleport to and from a one stop shop for selling loot and crafting items from anywhere&#33;[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/19697]Al&#39;s Three Stone Watch[/url] -- [i]Lore friendly, non-cheaty, humble starter home[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/24486[/url]Al&#39;s Eclipse Bloodcurse[/url] -- [i]Tired of shooting arrows at the sun? Now you can get a true eclipse (including removed sun damage) as a power[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=13121]Al&#39;s Dead Dragon Giant Camp[/url] -- [i]Just as dragon lairs and giant camps are quick and easy (relatively) stops for a rich haul, so is this&#33;[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7756]Al&#39;s Artifacts of Tamrielic Lore[/url] -- [i]Remember Yagrum Bagarn&#39;s book from Morrowind? So do I[/i]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7444]Al&#39;s Starry Armor and Clothing Retextures[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=7648]Al&#39;s Virility - Nude Male - PC Only (Adult Content; NSFW)[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/downloads/file.php?id=13355]Al&#39;s -Get 80 Perk Points and All Skills 100- Cheat Ring[/url]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/7728]Al&#39;s &#34;Nothing Sells for Zero Gold&#34; Tweak[/url] -- [i]I bet you&#39;re tired of picking up loot that sells for nothing. So am I[/i]\r<br />\r<br />------\r<br />\r<br />UPDATE 1.1 -- I have added Goldbrand and Eltonbrand. The Staff of Hasedoki&#39;s enchantment has been modified, as I finally thought to look up its Morrowind enchantment on UESP.net (d&#39;oh&#33;). It should function a little like Spellbreaker now; let me know if it works. Skull Crusher has been modified as per TheClassyPython&#39;s suggestion, making it truer to its Morrowind lore. The Fang of Haynekhtnamet&#39;s ingame description has been corrected to the proper lore, and has been remeshed and reskinned.\r<br />\r<br />Some of you may remember Yagrum Bagarn from The Elder Scrolls III: Morrowind. And some of you may also remember his book, &#34;Tamrielic Lore&#34;, in which are described several potent artifacts - including several seen in Skyrim&#33; ^-^\r<br />\r<br />I have taken it upon myself to add some more to the game, and have successfully implemented nine fully craftable and improvable, standalone artifacts. A word of caution: this is a beta of sorts, so any feedback you can provide will be very helpful&#33;\r<br />\r<br />ARTIFACTS\r<br />\r<br />Daedric Scourge -- &#34;The Daedric Scourge is a mighty mace forged from sacred ebony in the Fires of Fickledire. The legendary weapon of Mackkan, it was once a fierce weapon used to send spirits of black back into Oblivion. The weapon has the ability to summon creatures from Oblivion. Once a tool used against the Daedric Lords in the Battlespire, it now roams the land with adventurers.&#34;\r<br />   --Skyrim translation -&gt; it banishes Daedra up to level 75, and has soul trap 20 seconds.\r<br />\r<br />Staff of Hasedoki -- &#34;Hasedoki was said to have been a very competitive wizard. He wandered the land in search for a wizard who was greater than he. To the best of all knowledge, he never found a wizard who could meet up to his challenge. It is said that he felt so lonely and isolated because so many feared his power, that he bonded his life-force into his very own staff, where his soul remains to this day. Magic users all over Tamriel have been searching for this magical staff. Granting its wielder a protection of magicka, it is a sure prize for any magic user.&#34;\r<br />   --Skyrim translation -&gt; It will grant you a potent Ward 75 effect whenever you are in combat and wielding this.\r<br />\r<br />Dragonbone Mail -- &#34;This cuirass is one of the greatest artefacts any collector or hero could own. It is constructed of real dragon bone and was enchanted by the first Imperial Battlemage, Zurin Arctus, in the early years of the Third Era. It is a truly exquisite piece of work and many have sought to possess it. The properties of the Cuirass allow the wearer to resist fire, and to damage an enemy with a blast of fire. Little is known about the involvement of Zurin Arctus with the enchantment of the cuirass, but an old tale speaks of a debt that he owned to a travelling warrior. Like the warrior, the Dragonbone Mail never stays put for long.&#34;\r<br />   --Skyrim translation -&gt; Real dragon bone? You don&#39;t say. This is dragonplate armor, enchanted with fire resistance 70% and a flame cloak that should *fingers crossed* activate whenever you&#39;re in combat, similar to the Poison Cloak of the Ebony Mail.\r<br />\r<br />Skull Crusher -- &#34;The Skull Crusher is an amazingly large, and powerful weapon. The Warhammer was created in a fire, magically fueled by the Wizard, Dorach Gusal, and was forged by the great weaponsmith, Hilbongard Rolamus. The steel is magically hardened and the weight of the weapon makes for more powerful swings and deadly blows. The Warhammer was to be put on display for a festival, but thieves got it first. The Skull Crusher still travels Tamriel in search of its creators.&#34;\r<br />   --Skyrim translation -&gt; A steel warhammer, but MUCH lighter and MORE damaging than a normal one. I tried to make it one-handed, in keeping with the lightness, but the game didn&#39;t like that very much. Altered in v1.1 to make it weight 15 but have a Feather 15 enchantment, in keeping with Morrowind lore.\r<br />\r<br />Fang of Haynekhtnamet -- &#34;Black Marsh was once known to be inhabited with what the Argonians called the Wamasus. Northern men considered them to be intelligent dragons with lightning for blood. One such mighty beast, Haynekhtnamet, was slain by the Northern men, though it took 7 days and nights, and a score of men. One of the surviving men took a fang home as a trophy. The fang was carved down into a blade and fashioned into a small dagger. The Dagger mysteriously houses some of the beast&#39;s magical properties and grants the user the ability to do shock damage on an opponent. This unique Dagger is seen occasionally by travelling heroes.&#34;\r<br />   --Skyrim translation -&gt; A dragon&#39;s tooth, eh? This gets better and better. Skinned as Mehrunes Razor but with gold textures, to resemble its picture on UESP.net. Plus a hefty Shock Damage enchantment (which has been dialed down in v1.1, to 40 damage, which was its top shock damage in Morrowind).\r<br />\r<br />Umbra -- &#34;The Umbra Sword was enchanted by the ancient witch Naenra Waerr, and its sole purpose was the entrapment of souls. Used in conjunction with a soul gem, the Sword allows the wielder the opportunity to imprison an enemy&#39;s soul in the gem. Naenra was executed for her evil creation, but not before she was able to hide the Sword. The Umbra Sword is very choosy when it comes to owners and therefore remains hidden until a worthy one is found.&#34;\r<br />   --Skyrim translation -&gt; It was in the past two games and should be in this one, too&#33; You know the drill - ebony bladed weapon with soul trap enchantment. I tried to find a way to attach the &#34;Soul Siphon&#34; perk to it, but no luck. Comes in one-handed (as in Oblivion) and two-handed (as in Morrowind) versions.\r<br />\r<br />Daedric Crescent Blade -- &#34;Probably the most rare and even outlawed item of all the great prizes is the Daedric Crescent Blade. The Blade was used by Mehrunes Dagon&#39;s Daedric forces in the capture of the Imperial Battlespire. These extremely unique Blades were gathered up and destroyed after the Battlespire was retaken by the Empire. All but one it seems. Though the Empire believes them all to be destroyed, it is rumored tha tone still remains in existence, somewhere in Tamriel, though none have ever seen it. The Blade lends its wielder the ability to do great damage on an enemy and allows him to paralyse and put heavy wear on his enemy&#39;s armor. Quite the prize for any mighty warrior, if it does indeed exist.&#34;\r<br />   --Skyrim translation -&gt; I tried to attach the Bone Breaker perk (ignores armor) to this, but no luck. Still, it has a potent base damage and paralyzes for 6 seconds. Plus, it uses the totally cool mesh developed by ArmoredThirteen&#33; All in all, I believe I made it an extremely kickass weapon.\r<br />\r<br />Goldbrand -- &#34;The sword Goldbrand is almost a complete mystery. Thieves tell tales about its golden make and how it was actually forged by ancient dragons of the North. Their tales claim that it was given to a great knight who was sworn to protect the dragons. The Sword lends its wielder the ability to do fire damage on an enemy. Goldbrand has not been sighted in recent history and is said to be awaiting a worthy hero.&#34;\r<br />   --Skyrim translation -&gt; Made to resemble the picture of its Morrowind incarnation at UESP.net. Does fire damage.\r<br />\r<br />Eltonbrand -- The classic easter egg from Morrowind. Those of you who are familiar with it will chuckle when you see the crafting requirements for it.\r<br />\r<br />All these artifacts are craftable at forges and improvable at workbenches/grinding stones.\r<br />\r<br />INSTALLATION\r<br />\r<br />You will need an unzipping utility such as IZarc to extract the contents of the Zip file you downloaded.\r<br />\r<br />Extract the contexts of the zip file into your Skyrim/Data folder, clicking &#34;Yes&#34; any time you are asked if you want to merge folders. It should NOT override any files, as the only new meshes and textures are those for the standalone Daedric Crescent.\r<br />\r<br />POSSIBLE CONFLICTS\r<br />\r<br />There shouldn&#39;t be any conflicts, as these are standalone items. Still, you never know.\r<br />\r<br />BUGS\r<br />\r<br />If you find any, please let me know&#33;\r<br />\r<br />FUTURE IDEAS (no promises&#33;)\r<br />\r<br />--place the artifacts in the game world, and have mini-quests to get them\r<br />--create more artifacts from Yagrum Bagarn&#39;s book\r<br />--figure out how to place perk effects on weapons\r<br />--get unique textures and/or meshes for the artifacts\r<br />\r<br />If anyone wants to help me with textures and/or meshes, that would be great&#33; ^-^\r<br />\r<br />CREDITS\r<br />\r<br />ArmoredThirteen, for his excellent Daedric Crescent meshes and textures. \r<br />\r<br />http://skyrim.nexusmods.com/downloads/file.php?id=4025\r<br />Bethesda for a great game\r<br />SkyrimNexus for a great site\r<br />SkyEdit and the people who are still hard at work on it\r<br />Nifskope\r<br />Steam (for giving me an easy way to take screenshots)\r<br />TheClassyPython, for pointing out the Skull Crusher&#39;s correct values from Morrowind, and inspiring me to look up these weapons on UESP.net.\r<br />\r<br />PERMISSIONS\r<br />\r<br />ArmoredThirteen does not require permission for his Daedric Crescent meshes and textures to be used in your mods, though he does ask that he be credited for them. If you modify this mod, I ask that you work with me so we can make an awesome combined mod; but it&#39;s not required.\r<br />\r<br />You may use any part of this mod in a mod of your own, as long as you fulfill all of the following conditions:\r<br />\r<br />1. You must credit me.\r<br />2. You must notify me via PM.\r<br />3. You must put a link to my original mod, here, on your info page, and in your readme.\r<br />4. Your mod must NOT be a reupload or exact copy of mine.\r<br />5. I retain veto power (but I doubt I would ever use it). ^-^\r<br />6. You may not use any assets from my mods in anything that you charge for&#33;\r<br />\r<br />CHANGELOG:\r<br />\r<br />v1.0 -- 2/3/2012 -- First release&#33;\r<br />v1.1 -- 2/4/2012 -- I have added Goldbrand and Eltonbrand. The Staff of Hasedoki&#39;s enchantment has been modified, as I finally thought to look up its Morrowind enchantment on UESP.net (d&#39;oh&#33;). It should function a little like Spellbreaker now; let me know if it works. Skull Crusher has been modified as per TheClassyPython&#39;s suggestion, making it truer to its Morrowind lore. The Fang of Haynekhtnamet&#39;s ingame description has been corrected to the proper lore, and has been remeshed and reskinned.",
  "categoryId": "55",
  "version": "1.1",
  "author": "AlCiao",
  "createdUnix": "1328366326",
  "updatedUnix": "1328386663",
  "containsAdultContent": false,
  "uploadedBy": "AlCiao",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25806",
      "name": "Als Artifacts of Tamrielic Lore",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3664",
      "fileName": "Als Artifacts of Tamrielic Lore-7756.zip",
      "uploadedUnix": "1328366407",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3c794b17c3e9288d8d287fdc4696ada014e04743207ca6e3c88e9c82d5cc1611/analysis/1406653211/",
      "changelogHtml": " 2/3/2012 -- First release! <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Als%20Artifacts%20of%20Tamrielic%20Lore-7756.zip?fid=25806&ttl=1535766026&ri=8192&rs=8192&setec=6799cbf03fb3772faa82d73bcd52d2e3"
    },
    {
      "fileId": "25911",
      "name": "Als Artifacts of Tamrielic Lore v1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5724",
      "fileName": "Als Artifacts of Tamrielic Lore v1-1-7756-1-1.zip",
      "uploadedUnix": "1328386663",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/003854cc7eed621f5cbe4cbe386f3af754002aba8dc1c528f3124af36e849a91/analysis/1406653900/",
      "changelogHtml": " 2/4/2012 <br/> \n I have added Goldbrand and Eltonbrand. <br/> \n The Staff of Hasedoki\\'s enchantment has been modified. <br/> \n Skull Crusher has been modified as per TheClassyPython\\'s suggestion. <br/> \n Fang of Haynekhtnamet corrected, reskinned, remeshed. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Als%20Artifacts%20of%20Tamrielic%20Lore%20v1-1-7756-1-1.zip?fid=25911&ttl=1535766026&ri=8192&rs=8192&setec=82c7e93263616df1155113c26a8a872a"
    }
  ]
}