{
  "modId": 7757.0,
  "modName": "Skyrim Total Control Utility",
  "summary": "It\\'s just a pre-alpha but guys I need your help !",
  "descriptionHtml": "I need your help, If you are using any kind of mod and you want to share it just upload in on some reliable FTP and send me a link that I will add to Mod Pack section. But inside .rar or .zip folder add text file with credits for the mod makers. (You will also need to provide me a description of your mod pack, and I will add it to the file. (pop up windows that will tell the use what is in the modpack). I will be giving credits to modpack\\'s makers.\r\n\r\nThis is just a simple program with integrated chat (Chat is working form now !!), for real time help, or just talking about game or guests.\r\nIn a few days I will add some game fixes for archers, custom ini configs for better shadows and all that stuff. With just one press of the button program will edit your skyrim.ini and add / change needed lines of settings. There will be Utilities starters for Wyre Bash, BOSS, or NMM, SKSE_loader, and normal TESV. No need to mess up your destkop with one milion scrouts.\r\n\r\nBut if you think that the whole idea is retarded just let me know in comment section and I will stop developing it, and relese the source code for chat server and utility.\r\n\r\nNote !: This was just one hour of coding. So dont expect to much. If you guys tell me what you want to heve in this utility I will add it, right away !",
  "categoryId": "39",
  "version": "1.0.0.1",
  "author": "barbieass",
  "createdUnix": "1328367435",
  "updatedUnix": "1328381360",
  "containsAdultContent": false,
  "uploadedBy": "barbieass",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25880",
      "name": "SkyrimTCU",
      "version": "1.0.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "82",
      "fileName": "SkyrimTCU-7757-1-0-0-1.exe",
      "uploadedUnix": "1328381360",
      "modVersion": "1.0.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3ae68220df9a3347e18c9a63b4d09e241fea5ca495172a63d4ad8bbc87898c1f/analysis/1406653688/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SkyrimTCU-7757-1-0-0-1.exe?fid=25880&ttl=1535766027&ri=8192&rs=8192&setec=66f138e99080faf399f46bd860311591"
    }
  ]
}