{
  "modId": 77591.0,
  "modName": "The Sprigkin",
  "summary": "The Sprigkin adds 26 druid themed spells from all schools, and a variety of radiant quests to Skyrim. Swarm your enemies in insects, entomb them in spider webs and drive the Hagraven scourge from the face of Skyrim&#33;",
  "descriptionHtml": "Ally yourself with the Spriggans of Skyrim, and defend the Forest from those who would see it destroyed. Exterminate the Hagravens and their Forsworn puppets, and hunt down the followers of Hircine who seek to kill Skyrim&#39;s animals for their personal gain. Do all this with a wide range of new Druid themed spells and items. \r<br />\r<br />When attempting a Druid themed playthrough I was disappointed with the amount of relevant mods on the Nexus. This mod adds 26 Druid/Spriggan themed spells to the game, for all schools, as well as a friendly Radiant Quest giving Spriggan Mother NPC. It also adds two legendary Druidic artifacts which you can find and use or disenchant. This mod is designed not to intrude too much on the main story so that the player can roleplay to the exact extent that they want. Content is distributed around the world, so it&#39;s not neccesary to do quests for the Spriggan Mother to gain new spells/items (although it does speed the process up).\r<br />\r<br />\r<br />[u][b]Spells:\r<br />\r<br />[/b][/u][b]Destruction:\r<br />[/b]\r<br />[b]Sprigkin Spray and Plague[/b]- Concentration spells that cause a swarm of insects to attack the enemy (think Spriggan/Spriggan Matron concentration attacks).\r<br />[b]Sporebomb[/b]- Ranged bomb attack that causes an explosion of poisonous spores to damage enemies in an area.\r<br />[b]Hivestrike[/b]- Ranged attack that causes a swarm of insects to attack a single enemy at distance, surrounding and poisoning them over several seconds.\r<br />[b]Hivebomb[/b]- Area equivalent of Hivestrike (think Fireball to Firebolt).\r<br />\r<br />[b]Conjuration:\r<br />\r<br />Sprigkin Bound Weapon[/b]- Conjures a bound weapon with increased attack speed, deals reduced damage to animals.\r<br />[b]Summon Wolf, Bear and Mammoth[/b]- Summons animals to fight by your side.\r<br />[b]Summon Elk Steed- [/b]Summons an Elk mount.\r<br />\r<br />[b]Alteration:\r<br />\r<br />Swarmshield I, II and III[/b]- A protective swarm of insects boosts damage and poison resistance, at the cost of an increased vulnerability to fire.\r<br />[b]Web Tomb[/b]- A spider web explosion entombs enemies in a given area and briefly paralyzes them.\r<br />[b]Transmogrify Spriggan[/b]- High cost, transforms a single enemy into an allied Spriggan. \r<br />\r<br />[b]Illusion:\r<br />\r<br />Phantom Wolf and Bear[/b]- Summons phantom creatures that deal no damage, but draw the fire of the enemy.\r<br />[b]Wolf Howl and Sabre Cat Roar[/b]- Generate noises that mimic terrifying roars, reducing enemy damage resistance and regeneration rates for a time.\r<br />[b]Natural Selection[/b]- Master level, causes enemies to attack each other and calls all animals in the surrounding area to join the battle together. \r<br />\r<br />[b]Restoration:\r<br />\r<br />Forest Saviour I, II and III[/b]- Spells that temporarily slow down time, render the caster invisible and heal a small amount of health. All effects are cancelled upon attacking, however. Useful for getting yourself out of tight spots in the style of your new Spriggan friends. \r<br />[b]Hagrend[/b]- A concentration spell that deals huge amounts of damage to Hagravens.\r<br />\r<br />\r<br />[b][u]Items:\r<br />\r<br />[/u]Boots of the Cat[/b]- Unique light armor boots that muffle the wearer and increase movement speed.\r<br />[b]Gauntlets of the Bear[/b]- Light armor gauntlets that increase the wearer&#39;s strength, resulting in fortified health, stamina, carryweight and melee damage.\r<br />[b]Amulet of the Spriggan[/b]- Allies the wearer with all animals and Spriggans.\r<br />\r<br />[b][u]Installation:\r<br />\r<br />[/u][/b]Download the ESP and activate it, or use your favored mod manager. I&#39;m aware of no major conflicts.",
  "categoryId": "25",
  "version": "1.0",
  "author": "ScarfedElectrode",
  "createdUnix": "1470174625",
  "updatedUnix": "1470174625",
  "containsAdultContent": false,
  "uploadedBy": "Illikoba",
  "primaryFile": null,
  "files": []
}