{
  "modId": 7766.0,
  "modName": "The Druids of Kyne",
  "summary": "The Greybeards weren\\'t the only order to harness the voice...\r\nA WIP druid mod for Skyrim that should add: Druid spells, tech trees, specialisations, farming, druidic alchemy, shapeshifting, pet system, a new faction + quests and much more!",
  "descriptionHtml": " [b] [color=grey] The Greybeards weren\\'t the only order to harness the voice... [/color] [/b]  \r\nAfter Kyne granted the power of the Thu\\'um to mortals, several orders sprang up dedicated to this new power; Among them were the [b] [color=green] Druids of Kyne [/color] [/b] , also known as Kynareth\\'s Wardens and Hircine\\'s Wildclan. The druids sought to use the voice to propagate and help nature wherever it could be found, and to this end, became masters of the wilds.\r\nLike many of the other Thu\\'um wielding orders, time slowly took its toll; without the reverance held by the Greybeards or the large following of the various mage\\'s guilds, people became suspicous of the powerful druids and they were virtually driven into hiding.  The deathknell for the druids sounded in 3E433 with the Oblivion crisis - most of the last holdouts of the druids were destroyed, even their power could not protect the weakened order from the hordes of Dagon\\'s daedra that poured into Nirn. And so the druids were consigned to legend.\r\n\r\nNow, with the dragon crisis, Nirn tremors and something has awoken; The wind whispers and the forests utter of its return, and the druids are the only ones who can stop it.\r\nKynareth must call on an ancient ally.\r\n [b] [color=#FF0000] Alduin is not the only danger Nirn shall face this age... [/color] [/b] \r\n\r\n  [u]  Features  [/u]  \r\n\r\nTo Do List\r\n\r\nVersion\r\n\r\nThe Legal Bit\r\n\r\nContributions\r\n\r\nPrograms Used\r\n",
  "categoryId": "25",
  "version": "0.0",
  "author": "aDownloader",
  "createdUnix": "1328375890",
  "updatedUnix": "1328375890",
  "containsAdultContent": false,
  "uploadedBy": "aDownloader",
  "primaryFile": null,
  "files": []
}