{
  "modId": 77673.0,
  "modName": "Nexus Modders Guild - Resources - Tutorials - Skyrim",
  "summary": "This is an attempt to organise and help independent modders in a clever fashion.",
  "descriptionHtml": "[center][img]https://staticdelivery.nexusmods.com/mods/1151/images/9699-0-1464231177.png[/img][/center][center]Special thanks to KingTobbe for sorting out the white field in the header. \r<br />Mind you, I suffered from malnourishment when I made the fix on my own, his looks better and can be downloaded.[/center]\r<br />[center][size=5]Before we begin, keep in mind that this page is under construction.\r<br />[/size][/center]\r<br />This is the Nexus Modder&#39;s Guild, Skyrim branch. What is the Nexus Modder&#39;s Guild? It&#39;s a way for independent modders to organise, and work together. Providing resources, utilities, advice and wisdom. Before I had my own team of modders, modding was a logistical nightmare. Keeping track of content, assets, permission rights, credits and attribution, and not to mention learning how to mod itself. It&#39;s a lot of take in. Obviously, these things exist for a reason. It&#39;s essential to respect the rights of any artistic material. But who said the process had to be so complicated? \r<br />\r<br />\r<br />[size=4][i]So, how do I join the modder&#39;s guild? \r<br />[/i][/size]\r<br />It works similarly to Forever Free. Just put the image on your modding page, and use our Terms of Use Framework in your permissions section. And thereby promise the following to the public: \r<br />[b]- Your mod contains NO copyrighted material that you lack the rights to publish. \r<br />- Your mod credits and provides attribution to ALL contributors. However minute. \r<br />- Your mod must respect the wishes of artists whose content is found in the mod. \r<br />- Your mod has content that meets the Guild Standard.\r<br />- Any original content you made for the mod, may be used by other Guild mods. \r<br />And if the image is too large, just use this logo: \r<br />[img]http://staticdelivery.nexusmods.com/mods/1151/images/9699-0-1455067586.png[/img]\r<br />Now in colour: \r<br />[img]http://staticdelivery.nexusmods.com/mods/1151/images/9699-0-1455067842.png[/img]\r<br />You can find the BB Code snippet for these images on the forums in the[url=http://www.nexusmods.com/fallout4/mods/9699/?tab=5&&navtag=http%3A%2F%2Fwww.nexusmods.com%2Ffallout4%2Fajax%2Fcomments%2F%3Fmod_id%3D9699%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D3783545&pUp=1] Terms of Use Framework section. [/url]\r<br />[/b][b]\r<br />[/b][i][size=4]Whoa&#33; Easy there&#33; What&#39;s up with these rules? Guild Standard, what&#39;s that?\r<br />[/size]\r<br />[/i]The guild standard is simple. It means your mod is a properly produced mod with quality content. That it&#39;s not a troll mod, or just a saved game file. It&#39;s really not such a big deal. We won&#39;t exclude anyone, or act like snobs. If you&#39;re new to modding, and your textures might look a bit oversaturated, or your scripts cause crashes. That&#39;s fine. We&#39;ve all been there. We&#39;re here to help then, if anything.\r<br />[i]\r<br />[size=4]Okay, fair enough. That&#39;s a minimum standard. But what&#39;s this about sharing assets with other guild modders?\r<br /> [/size]\r<br />[/i]Well, we&#39;ve all seen amazing armour mods where the armours simply end up in a box somewhere. The Market District in Oblivion would be littered with the same old wooden chest model, for instance. We&#39;ve all downloaded those amazing guns whose sole implementation into New Vegas was laying around in Doc Mitchell&#39;s house. Not to mention all the cool scripts and gameplay functions that recycles plain vanilla assets, or remain graphically inept. This is because there&#39;s a fissure between graphics developers, and gameplay developers. The guys who do 3d modelling, and textures, and the guys who write scripts, and design levels, rarely join together. There&#39;s usually a lack of commitment to larger projects, and people are more suited to work alone. Feels like the most logical course of action is therefore to create a network of independently made assets, where several individuals can organise and co-ordinate their work without ever so much as knowing one another. It&#39;s a self-sustaining system that assures mods are made more accessible, and easily found. Allowing everyone to join in and having fun modding. \r<br />\r<br />[i][size=4]But what about the developer&#39;s rights? Shouldn&#39;t they be respected? \r<br />[/size]\r<br />[/i]Absolutely, and it&#39;s one of the goals of the Modder&#39;s Guild. Because the Guild Rules themselves enforce that. If a mod was to be released without meeting the standards of the original publishers, it&#39;s a license violation like any other. If someone releases a Guild Mod that contains, say, an armour. And the author specifically asks that the armour should only be used for lore friendly mods, and someone publishes a lore breaking mod containing said armour, then, just report it and take it down like you normally would. Only difference is that since there&#39;s a network of people participating in an honour system, these rules will be more enforced, and the content will be made more accessible. \r<br />\r<br />[i][size=4]Huh, so people do have control over their content, the Guild Rules are just there to allow others to build upon it? \r<br />[/size]\r<br />[/i]Exactly. It&#39;s about time we got more organised, it benefits everyone. The modders who need content, the modders who make content, the players who get to enjoy the content, and therefore The Nexus as a whole. \r<br />\r<br />[i][size=4]So being part of the Modder&#39;s Guild not only protects my assets, but also allows me to find other cool assets for my mod?\r<br />[/size]\r<br />[/i]That&#39;s right. \r<br />\r<br />[i][size=4]Wow, Thumblesteen. A self-regulating honour code for modders. That&#39;s quite something. \r<br />[/size]\r<br />[/i]It&#39;s hardly my invention. Systems like these have existed for centuries amongst craftsmen. They worked perfectly well. I don&#39;t see why modding is so different. \r<br />\r<br />[i][size=4]Hold up a second Thumblesteen, what does all this have to do with this &#39;sunshinenbrick&#39; fellow?[/size][/i]\r<br />\r<br />Thumblesteen began [url=http://www.nexusmods.com/fallout4/mods/9699/?]Nexus Modders Guild - Resources - Tutorials - Fallout 4[/url] and sunshinenbrick is &#39;curating&#39; the Skyrim chapters of the guild. The pages should be seen as one in the same (Thumblesteen is also an admin here&#33;). If you would like to show support for, contribute and join in the fun, then be sure to check out the [url=https://forums.nexusmods.com/index.php?showtopic=4755660]Volunteers [/url]section in the forum section.\r<br />\r<br />[size=4][i]So what other benefits are there to being in the guild? [/i]\r<br />[/size]\r<br />Well, each branch will have it&#39;s own forum dedicated to providing guidance and tutorials to new modders. If you frequent the page and help people, I will make you a moderator. There&#39;s also pre-written permission licenses intended to simplify the process of distributor rights. As well as a streamlined credits formatting system to allow modders to easily credit people for their work. [b]To allow modders to easily credit you, for your work. [/b]This system will also help prevent plagarism. We will explain how in a moment. \r<br />[b]\r<br />[/b][i][size=4]But what do you know about copyright law, Thumblesteen? \r<br />[/size]\r<br />[/i]I&#39;ve learned a few things over my career as an indie game developer. Since with commercially made games, knowing who to attribute and which terms to comply to is key. I also know that in a lot of ways, copyright law is broken. Because the quality of it depends on the individual. A lot of people try to be their own lawyers, and as a result, things become confusing. I can&#39;t tell you how many times I&#39;ve tried to track down the Terms of Use for a picture or a piece of music, only to find self-contradictory statements. I&#39;ve met people who, on both ends, as users and claimants, will abuse the definition of Fair Use. People who don&#39;t know the difference between Freeware and Abandonware. It&#39;s a litigious minefield out there, and I&#39;ve seen it happen a lot on The Nexus too. I hope to help people communicate their terms of use in a clear and formalised manner. So everyone has a common frame of reference. This will benefit both users and claimants. As it is ridiculously easy to exploit loopholes in poorly written terms of use. I also have close family who are lawyers, and I take an interest in sociological literature which have helped me to gain a fair understanding of the legal system. That being said, I cannot offer specific legal advice. I can just explain how things work in general. Since The Nexus deals in non commercial content, and have a self contained system of regulation. You don&#39;t exactly need to be a lawyer. You just need to know how to communicate with the public, and the moderators, if need be\r<br />\r<br />[size=4][i]You mentioned plagiarism, how will The Guild fight plagiarism? \r<br />[/i][/size]\r<br />I think plagiarism is one of the biggest fears I&#39;ve seen on The Nexus. But there are two things people don&#39;t understand about it. First one being that plagiarism in modding is very rare, and most people are good. Second one is that restricting distribution rights for your mod makes it easier to plagiarise. If you only upload your assets on one page, and then make sure it remains only on one page, then people can fool anyone into thinking they made the content provided nobody visits that one particular page. If you, however, allow modders to incorporate your assets into their mods. So your assets end up on hundreds of pages, all crediting you for the work. Then suddenly your assets will be a matter of public knowledge. With every page that your attribution ends up; Your chances of people catching plagiarists increase. Flaunt your credit, don&#39;t hide it. \r<br />\r<br />[size=4][i]And do you have any demands on Guild Modders? [/i]\r<br />[/size]\r<br />Just follow the basic rules, and framework as you represent the guild, and be willing to share your assets with other guild mods, and you&#39;re golden. \r<br />\r<br />[size=4][i]Can&#39;t you make sharing assets optional? [/i]\r<br />[/size]\r<br />No. The whole idea is that, if one Guild Mod makes a good asset, then 20 modders will make mods incorporating that asset, sharing their files as well. This creates a virtually infinite network of assets for modders to use. Provided they respect the wishes of the authors. That&#39;s something that&#39;s going to bring in a lot more mods, and include a lot more modders to the community. Allowing seasoned modders like myself to give, and have their content protected. But also letting the newcomers have a bit of help. \r<br />\r<br />[i][size=4]Where can people find the templates for Terms of Use? \r<br />[/size]\r<br />[/i]They will be shared on the forums. They will be easy to copy and paste into the Nexus permissions field, and provide all the useful information in a clear manner that&#39;s easy to understand. As well as room for special author&#39;s requests. \r<br />\r<br />[i][size=4]But, hold on, you&#39;re reputed as an anarchist modder on The Nexus, and now you&#39;re helping enforcing the rules, what&#39;s up with that? \r<br />[/size]\r<br />[/i]It&#39;s true that in many ways I disagree with the current state of things. But that&#39;s all the more reason to understand the rules, and to interact with them. To help people understand their rights, is to give them as much freedom as possible. That&#39;s really what this is all about. Freedom to mod, and to publish.",
  "categoryId": "82",
  "version": "2.0",
  "author": "Everyone",
  "createdUnix": "1471168610",
  "updatedUnix": "1470492266",
  "containsAdultContent": false,
  "uploadedBy": "sunshinenbrick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000215908",
      "name": "Graphical Resources",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5607",
      "fileName": "Graphical Resources-77673-1-0.zip",
      "uploadedUnix": "1470492065",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cf10fe7dd545425089a1fe1253e1695c7ce73b23b96e98c08014faf09e7b6e73/analysis/1470492125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Graphical%20Resources-77673-1-0.zip?fid=1000215908&ttl=1535866299&ri=8192&rs=8192&setec=5e4a37042592d4b8907a173f82e35546"
    },
    {
      "fileId": "1000215909",
      "name": "King Tobbe Fix",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7339",
      "fileName": "King Tobbe Fix-77673-2-0.zip",
      "uploadedUnix": "1470492266",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/4ffea84ef7305befb82d08be55610df48f08aa1aee14c69bcc48bfb5f264098f/analysis/1470492303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/King%20Tobbe%20Fix-77673-2-0.zip?fid=1000215909&ttl=1535866299&ri=8192&rs=8192&setec=4eebc13900d6ade3bf48d2674b1adadf"
    }
  ]
}