{
  "modId": 7772.0,
  "modName": "Fantastic Shields III",
  "summary": "Read the Description!",
  "descriptionHtml": "Fantastic Shields III\n<br />\n<br />Many thanks to markofthedog who gave me the permission to make retextures\n<br />on his Nexus Shield and upload them. ^^\n<br />\n<br />[[[@To All\n<br />For a reason i don't know, markofthedog have removed his mod from skyrimnexus,\n<br />those who still have markofthedog's Nexus Shield are lucky and can use my mod anytime,\n<br />but those who did not get it yet can't use my mod by replacing one of my textures on the\n<br />Nexus Shield texture.\n<br />Well, there is something what you can do to use my mod, you can download and install\n<br />Abakus's A Steel Heater Shield:\n<br />http://skyrim.nexusmods.com/mods/5916\n<br />then choose a shield-folder of my mod, copy the nexusshield.dds from that shield-folder which is after texturesarmorsteel, paste it on Desktop, rename the nexusshield into Heatershield, copy or cut that Heatershield.dds, paste and replace at:\n<br />C:Program FilesSteamSteamAppscommonskyrimDatatexturesarmorheater\n<br />Now you can use my mod and use one of those textures i made anytime, with this method you can select and change any texture i made but only one.\n<br />*Before i make this mod, i took permission from markofthedog to make retextures for his Nexus Shield, he took permission from Abakus to make a remesh of the Steel Heater Shield and he told me that there is no problem if don't ask also permission from Abakus to make retextures for the Nexus Shield since its remade by markofthedog, but to be with the rules i asked Abakus and its ok.*\n<br />Well, to make standalone each texture i made, now i have to get permission from Abakus to duplicate his Steel Heater Shield, but i can't since Abakus does not reply anymore.\n<br />If you want to do it only for personal usage, feel free, but never upload the standalone version to nexus and to any other site, because since Abakus does not reply anymore and i don't give my permission!]]]\n<br />\n<br />Fantastic Shields III textures made by haldir307.\n<br />\n<br />Permissions:\n<br />1) Users/Modders are not allowed to upload my files to other sites!\n<br />2) Users/Modders are not allowed to convert my file so that it works on similar games!\n<br />3) Users/Modders are not allowed to modify my file including releasing bug fixes or improving on the features my file adds to the game and upload it as a seperate file!\n<br />4) Users/Modders are not allowed to use assets contained in my files in their own files!\n<br />[b][i]5) Translations are allowed, no need to ask me. [/i][/b]\n<br />[b][i][u]6) Users/Modders are not allowed to upload my mods on Steam Workshop as their own to obtain money and it means the same for Permissions 2/3/4, my mods will always stay on nexus for free![/u][/i][/b]\n<br />\n<br />Credits:\n<br />Credits goes Abakus who made the shield first, to markofthedog who made some changes\n<br />on the meshes and textures, to me that i made retextures too,\n<br />aslo can endorse my textures mod.",
  "categoryId": "54",
  "version": "III",
  "author": "haldir307 markofthedog and Abakus",
  "createdUnix": "1328380359",
  "updatedUnix": "1328390657",
  "containsAdultContent": false,
  "uploadedBy": "haldir307",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25931",
      "name": "Fantastic_Shields_III",
      "version": "Last",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1898",
      "fileName": "Fantastic_Shields_III-7772-Last.rar",
      "uploadedUnix": "1328390657",
      "modVersion": "Last",
      "virusScanUrl": "https://www.virustotal.com/file/b6cb0064b9084fdffd4fe97b445805268c5cadb6c928686e3764fa3a00824df7/analysis/1406654087/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fantastic_Shields_III-7772-Last.rar?fid=25931&ttl=1535766055&ri=8192&rs=8192&setec=9c0bb8b77cbe00680f30f1011f887b1f"
    }
  ]
}