{
  "modId": 7774.0,
  "modName": "An Alternative Start - Become a Hunter",
  "summary": "Tired of the same beginning? Start new with this mod!\r\nNot a save file.\r\nThis adds Chestermore, your own hunters lodge, and soon a questline.",
  "descriptionHtml": "[center][IMG]http://i44.tinypic.com/2qir7lc.jpg[/IMG][/center]\r\n\r\n[center][b]NOTE: I practically quit working on the mod, although I still have everything ready to start working on it again. If people come across a game breaking bug, contact me.\r\nSoon there\\'ll be a fix for the main questline though. [/b] [/center]\r\n\r\n\r\n[center] Version 2.0 has been released! No need for save files anymore!\r\nAlthough I\\'ve gotten word of missing dirt cliffs in Chestermore and at your Hunter\\'s Lodge, I am working on this but I can\\'t find the problem. But when you go into an interior and back to the exterior the cliffs should be there again.\r\n\r\nIf you like this mod, please endorse so more people will notice!\r\n\r\nYou could always change the story for yourself, be another race, be a smith instead of Hunter. Whatever you like, ofcourse![/center]\r\n[center][b]Story[/b]\r\n=======\r\n... You wake up with an awfull headache. Slowly you move yourself into a sitting position, but strong hands hold you back and lay you on your back. \\\"Hold it now, don\\'t rush it.\\\" You try to open your eyes, but you aren\\'t able to see, and close them again.\r\nYou wonder what had happened and doze back into sleep.\r\n\r\nIt\\'s a beautiful Morndas, just like any other.\r\nYou are playing around with your little borther, Eric, in the market, you laugh as you chase him.\r\nWhen you almost have him you bump into an old lady, you tell her you are very sorry and she hands you a sweetroll for your kind manners.\r\nYou find your little borther, and show him the sweetroll. He smiles brightly and you hand him a piece.\r\n\r\nYour memory fades into another memory...\r\n\r\nIt\\'s a windy Fredas and you are practicing archery on a wooden target.\r\nYou remember that you are about 15, placing arrow after arrow into the target.\r\nWhen you line up another arrow for a nice bulls-eye, the wind suddenly strikes when you release the arrow. Making the arrow go far beyond the target. The iron arrow flew with high velocity into a tree, just an inch away from Astall, your always angry neighbour.\r\nShe takes the arrow out of the tree and walks up to you, yelling that you are a lousy archer. She then takes it to your mother who punishes you with yet another week no bow and arrow.\r\n\r\nYour memory fades again...\r\n\r\nIt\\'s a rainy Tirdas, you are 19 and a capable hunter. You are eating dinner at your mother\\'s house with your mother and little brother.\r\nWhen suddenly you hear screaming outside. And the recognizable arrows flying by hitting the wood outside the house. You hear swords being unsheathed, a baby crying, a warrior screaming in pain.\r\nYour mom slightly opens the door and quickly ran back inside pushing me and my little brother into the secret room behind a false panel.\r\nSoon after we were hidden we heared the door breaking down. And soldiers walking in and take my mother away. She screamed and struggled they shut her mouth and we only heared soft muffled grunts, fading away.\r\nWe waited a while, waiting for our mother. But she never returned.\r\n\r\nYou opened the false panel and walked into the main room of the house. You saw blood spatters and two dead bodies. You immediately notice one of them is from town, but the other you don\\'t recognize. Must\\'ve been an attacker.\r\nYou walk outside and see loads of bodies. You look around and notice some friends. Dead and alive. You see a woman crying next to a tiny body.\r\nYou get approached by an old woman who tells you to help drag the bodies to one location.\r\nYou drag around with bodies for a few hours but still didn\\'t find your mother.\r\n\r\nAfter a while you start looking outside of the village, not long after you find your mother stripped down naked hanging on a tree. Her body was tortured, eyes were missing.\r\nYou quickly untied the ropes and covered the body. You walked back to the town to get your brother. You grab a shovel and some flowers. Crying all the way back you and your brother start digging a grave. You use the ropes to lower the body, and you start putting the dirt back to where it was before.\r\nYou and Eric stood there for a while, crying. You then remembered she had an amulet, an heirloom.\r\nYou weren\\'t able to find the amulet and sworn to yourself that one day you would be wearing the amulet.\r\n\r\nAfter a week you and your brother pack stuff to go to town. Heading for Falkreath.\r\nYour brother started working there as a local smith. You work brought the furs and meat for the people.\r\n\r\nAfter one year, while hunting in the woods, a wild sabre cat lurks from behind the trees.\r\nThe cat approached you from behind, silent as the night.\r\nHe cracked a dry branch under his paw and you turned around, the cat quickly jumped towards you and you got pushed onto your back. The cat clawed his way through your leather armor. You quickly grabbed the iron dagger stashed away in your boot. Just in time before he got to your flesh. You stabbed him repeatedly in its neck, it clawed in panick, hitting you in your face near your eye...\r\n\r\nYou wake up again with the same headache, but now you know what happened.\r\nYou try to open your eyes again and can see your brother cooking.\r\nYour brother noticed you and walked to you with a bowl of horker stew.\r\n\\\"Ha, you\\'re finally up again.\\\"\r\nAll you could produce was a silent noise.\r\n\\\"Hey, don\\'t talk. Just eat. Don\\'t want to waste this delicious stew.\\\"\r\nAfter you were finished eating the stew your brother helped you into a sitting position.\r\n\\\"hrmpf... Where am I? How did I get here?\\\" You said.\r\n\\\"One of your friends heared screaming and when he arrived saw the sabre cat attacking you. He quickly lined up an arrow to save you, killed the sabre cat, but you were already passed away when he approached you. Then he carried you back here, the smithy.\r\nHere, take this. That should help you get back on your feet.\\\"\r\nYou drink the potion he gave you and immediately you feel some power returning to your body. You stand up, get dressed and walk outside.[/center]\r\n\r\n[b]Progress[/b]\r\n=============\r\nFuture plans & progress:\r\n[list]\r\n[*]Build the hometown village --- Appears the cliffs and sawmill misses. At first visit per instance. / 100% [b] Done[/b]\r\n[*]Ability to start main-quest line without console --- 100% [b] Broken [/b]\r\n[*]Create all new start only using an .esp file --- You spawn in Falkreath near the Smithy you wake up at now. / 100%[b] Done [/b]\r\n[*]Possible quest-line --- Even more trouble! / [b][u]15%[/u][/b]\r\n[/list]\r\n[size=2](Bold/underlined percentage is what I\\'m currently working on)[/size]\r\n\r\n[b]Description[/b]\r\n==========\r\nGenerally what this mod does is offer the ability to start a game differently.\r\n[i]What I did:[/i]\r\n[list]\r\n[*]Disabled main quest line, and possibilty to start it.\r\n[*]Gave you different starting gear, fit for a hunter.\r\n[*]Added you to hunter faction, not yet implemented in the .esp\r\n[*]You start in Falkreath near your brother\\'s Smithy\r\n[*]Gave her specific skills on what she does and what she does not use. i.e, magical skills are 1, but archery is 45. [b](Not working with .esp yet)[/b]\r\n[/list]\r\n\r\nTo access the main quest line: Go to Whiterun, to Farengar\\'s room and look on his desk. You\\'ll find a note which requests that you go fetch a dragonstone tablet in Bleak Falls Barrow. That\\'s your first mission. [b]Doesn\\'t fully work yet, as it doesn\\'t continue the quest-line after fetching the dragon stone tablet[/b]\r\n\r\n[b]Installation[/b]\r\n============\r\nUse NMM or simply drag and drop AlternativeStart.esp into your Skyrim/Data folder.\r\nAnd activate it using the launcher, but I\\'d recommend using NMM\r\n\r\n\r\n[b]Recommended Mods[/b]\r\n===================\r\nI used these mods in early stage of this mod:\r\n[url=http://www.skyrim.nexusmods.com/downloads/file.php?id=820]Non-playable Armor by gibbed (For the head bandages)[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=30]No more blocky faces by Xenius[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=4784]High resolution scars by Xenius[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=2464]Bright Eyes by Skree000[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=26]Detailed faces v2 by Xenius[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=689]Detailed Lips v1.2 by Xenius[/url]\r\n\r\n[i]I recommend the following mods too:[/i]\r\nHIGHLY RECOMMENDED: [url=http://www.skyrim.nexusmods.com/downloads/file.php?id=9935]Portable Campsite[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=1002]JaySus Swords[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=2674]Improved NPC Clothing[/url]\r\n[url=http://skyrim.nexusmods.com/downloads/file.php?id=4929]A Quality World Map[/url]\r\n\r\nI also recommend for the sake of roleplay to turn off crosshair and compass. In the beginning it might get frustrating but it\\'s much more fun without them!\r\n\r\n[b]Thanks to[/b]\r\n=========\r\n[url=http://forums.nexusmods.com/index.php?/user/3707538-ruru111/]ruru111[/url] for helping me with how to spawn at a different location. BIG thank you!",
  "categoryId": "79",
  "version": "2.0",
  "author": "Th3uNKn0wN",
  "createdUnix": "1328381479",
  "updatedUnix": "1329411269",
  "containsAdultContent": false,
  "uploadedBy": "Th3uNKn0wN",
  "primaryFile": null,
  "files": [
    {
      "fileId": "25882",
      "name": "Arianne",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1050",
      "fileName": "Arianne-7774.rar",
      "uploadedUnix": "1328381641",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8b6c00a7c897efde3ad4c860a3dd14b15d7ca20bbc93899021fb662674a10650/analysis/1406653690/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arianne-7774.rar?fid=25882&ttl=1535766057&ri=8192&rs=8192&setec=ce85af7a6a30ad27ff3f76aaeb80706b"
    },
    {
      "fileId": "25902",
      "name": "Hjolnar",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1044",
      "fileName": "Hjolnar-7774.rar",
      "uploadedUnix": "1328384940",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/be2a86d324e3c78ed4044488666e433042ac2cea08fd6f58c13a92dd385ef0c6/analysis/1406653873/",
      "changelogHtml": " Added Male version, Hjolnar <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hjolnar-7774.rar?fid=25902&ttl=1535766058&ri=8192&rs=8192&setec=e9e953f1e85a362049ae1251ba31ad74"
    },
    {
      "fileId": "30529",
      "name": "Alternative Start EARLY STAGE",
      "version": "1.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "34",
      "fileName": "Alternative Start EARLY STAGE-7774.rar",
      "uploadedUnix": "1329165058",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/792fd939c836a46e062fcb93985ceebfae9575733df45601a193449933838816/analysis/1406679340/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternative%20Start%20EARLY%20STAGE-7774.rar?fid=30529&ttl=1535766058&ri=8192&rs=8192&setec=8c08561c0bdc6649b714d6c83256c6ce"
    },
    {
      "fileId": "32121",
      "name": "Alternative Start v2 FIX",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "674",
      "fileName": "Alternative Start v2 FIX-7774-2-0.rar",
      "uploadedUnix": "1329411269",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/04fb6c8c2ddafb0bc5576cc7a7acf511659c94983a1833682902f6bba469eda8/analysis/1406687528/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Alternative%20Start%20v2%20FIX-7774-2-0.rar?fid=32121&ttl=1535766059&ri=8192&rs=8192&setec=1cf62c3886121b692772422f0554560d"
    }
  ]
}