{
  "modId": 77771.0,
  "modName": "Follower Mage- Fareon",
  "summary": "Fareon is a new dark elf mage follower. He is found at the Sleeping Giant Inn in Riverwood. What is a follower if not a friend? He has all normal follower options and is made up of vanilla Skyrim Dark elf appearance settings SO he is entirely lore friendly. He starts at level 20 and levels with your character, he also has all the elf powers, high h",
  "descriptionHtml": "[size=3]Fareon is a new dark elf mage follower. He is found at the Sleeping Giant Inn in Riverwood. What is a follower if not a friend? He has all normal follower options and is made up of vanilla Skyrim Dark elf appearance settings SO he is entirely lore friendly. He starts at level 20 and levels with your character, he also has all the elf powers, high health and magicka settings that make him a perfect companion for those who like a little sparkle during combat.\r<br />[/size]\r<br />[b][u][i][size=4]As usual my ReadMe is all here and wont be uploaded seperately:[/size][/i][/u][/b]\r<br />[b][u][size=4]Details:[/size][/u][/b]\r<br />[size=3]Fareon is found at Sleeping Giant Inn in Riverwood. He levels with your character (his starting level is 20), he is a mage and will generally use magic and/or staffs in combat. He has high magicka and health and is an entirely functional, lore friendly character. (This mod may not be displayed elsewhere without my permission as mod author.) I have fine face textures for men (by [/size][size=3][url=http://www.nexusmods.com/skyrim/users/4184206]urshi[/url]) active in my screenshots.[/size]\r<br />[u]\r<br />[size=4]Compatibility:[/size][/u]\r<br />[size=3]This is a basic, stand alone mod that shouldnt have any problems with other mods. [/size]\r<br />\r<br />[b][u][size=4]Installation:\r<br />[/size][/u][/b][size=3]Allow new versions to over write old ones.\r<br />I always recommend using a clean save (Load save, delete loaded save and then save again) to prevent or solve common problems with most mods. \r<br />[/size]",
  "categoryId": "96",
  "version": "",
  "author": "Cher5",
  "createdUnix": "1470775890",
  "updatedUnix": "1470775883",
  "containsAdultContent": false,
  "uploadedBy": "Cher5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000216360",
      "name": "Follower Mage- Fareon",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Follower Mage- Fareon-77771-.zip",
      "uploadedUnix": "1470775883",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2737bb046aa245435c4b5f834cc0e1fdf0aeaeddbcde06680d3caa2ca905c7a7/analysis/1470775921/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Mage-%20Fareon-77771-.zip?fid=1000216360&ttl=1535866390&ri=8192&rs=8192&setec=7de0f06921bf80e7b0e4197cfa3a6fa6"
    }
  ]
}