{
  "modId": 77801.0,
  "modName": "NPC Enhancement Mod",
  "summary": "Equips the vulnerable NPC&#39;s of Skyrim against dragon and vampire attacks.",
  "descriptionHtml": "[size=2]The NPC Enhancement Mod does what it says on the package. Previously, everyone fled in panic whenever a dragon or vampire attacked. Lots of these people got killed before they had set two steps. This meant that the guards had to solve the issue at all times, but they can only be expected to do so much. There are never enough guards to defend everyone against certain death. So how are we going to solve that little problem? BY ARMING EVERYONE&#33;&#33;&#33;\r<br />\r<br />Oh yeah, NPC&#39;s have been given weapons and armour vastly superior to their original attire. Add to that a certain AI controlled deathwish to protect themselves and their friends and allies against anything that would seek to harm them, and you have a wonderful cocktail of oldschool street violence that completely destroys any invader of an otherwise peaceful settlement. Instead of watching half the population die, you now get to see the whole settlement taking up arms against their enemies. None shall be left standing, it&#39;s a virtually guaranteed survival.\r<br />\r<br />\r<br />\r<br />What is listed below is everything that this mod covers. Behind that is the version number that indicates from when it was included:\r<br />\r<br />At this moment, the following settlements are covered...\r<br />\r<br />-Riverwood (Since v1.0)\r<br />-Dawnstar (Since v1.0)\r<br />-Dragonbridge (Since v1.0)\r<br />-Morthal (Since v1.0)\r<br />-Falkreath (Since v1.0)\r<br />-Solitude (Since v1.0)\r<br />-Whiterun (Since v1.1)\r<br />-Karthwasten (Since v1.1)\r<br />-Ivarstead (Since v1.1)\r<br />-Shor&#39;s Stone (Since v1.1)\r<br />-Winterhold, college excluded (Since v1.2) /// Jarl&#39;s court under Korir not (yet) included.\r<br />-Rorikstead (Since v1.3)\r<br />-Windhelm (Since v1.3)\r<br />-Markarth (Since v1.3)\r<br />\r<br />\r<br />The following extra features are included as well:\r<br />\r<br />-Companions overhaul (They all have better equipment now, Kodlak and Skjor excluded.)\r<br />-Stormcloak Riften Guards overhaul (They all have Dawnguard equipment. A former Riften jarl founded that party gang after all...)\r<br />-Imperial Riften Guards overhaul (They have Dawnguard armour as well, but with a different Dawnguard cuirass.)\r<br />-Winterhold: Imperial & Stormcloak Guards overhaul (Stalhrim equipment)\r<br />-Dawnstar: Imperial & Stormcloak Guards overhaul (Ebony equipment)\r<br />-Windhelm: Imperial & Stormcloak Guards overhaul -[size=2]Since v1.3[/size] (Nordic equipment)\r<br />-Markarth: Imperial & Stormcloak Guards overhaul -[size=2]Since v1.3[/size] (Dwarven equipment, with only war axes and enhanced crossbows for a change.)\r<br />-Whiterun: Imperial & Stormcloak Guards overhaul -[size=2]Since v1.3[/size] (Combined custom set of armor, no distinctive type. This set *is* playable.)\r<br />\r<br />\r<br />[size=2]Included feature(s) not strictly necessary for this mod&#39;s original purpose:\r<br />\r<br />The College of Winterhold now has four guards of its own. This means that all college members now report to a different crime faction, and when arrested by the College Guards you&#39;ll be locked up in a cell inside of the college&#39;s Hall of Countenance located on the 2nd floor. The only thing that doesn&#39;t change, regardless of my added containers, is the fact that you&#39;re locked up with all your gear as if you&#39;ve been arrested by the standard Winterhold guards. That also means that the College Guards will also refer to &#34;The Chill&#34;, even though you won&#39;t be sent there at all.\r<br />\r<br />[/size]\r<br />\r<br />\r<br />Bonus plans:\r<br />\r<br />As an added bonus, housecarls and player-paid followers (the mercenaries in the inns) will also receive new equipment. For each hold, I will also have the[/size] guards wear new uniforms that better reflect the hold than a bit of leather with a dyed cloth. That goes for both the Imperial and Stormcloak side. No one is left out. The only downside is that I have to alter each guard individually. There seems to be no way to alter the base model of each guard, because I eventually managed to trace that back to a levelled character that doesn&#39;t have an inventory. But it&#39;s going to happen, that much is certain. It&#39;s just time-consuming.\r<br />\r<br />\r<br />\r<br />\r<br />Side note:\r<br />\r<br />This is not the only mod I&#39;ve created and released. If you take a look at the list, maybe you&#39;ll find something else you like as well.",
  "categoryId": "33",
  "version": "v1.3",
  "author": "King Rick",
  "createdUnix": "1470859067",
  "updatedUnix": "1479209065",
  "containsAdultContent": false,
  "uploadedBy": "King Rick",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000228213",
      "name": "NPC Enhancement Mod",
      "version": "v1.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "823",
      "fileName": "NPC Enhancement Mod-77801-v1-3.rar",
      "uploadedUnix": "1479209065",
      "modVersion": "v1.3",
      "virusScanUrl": "https://www.virustotal.com/file/bc04b2b97070e385819caa88caf65664b3534f2f759d1247db2f71be3fcfca7d/analysis/1479209122/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NPC%20Enhancement%20Mod-77801-v1-3.rar?fid=1000228213&ttl=1535866412&ri=8192&rs=8192&setec=881747c2d71170a0be5f53ad1c4240d0"
    }
  ]
}