{
  "modId": 77844.0,
  "modName": "Tiger and Dragon (Formerly Jeek Half-Drgaon) R6.2",
  "summary": "Punch cat and punch lizard.  Both are equipped with an invisible unarmed weapon to deliver deadly punches.  They only fight unarmed.",
  "descriptionHtml": "6.0 Big update for Jeek.  Fully overhauled the kill moves and added a punch cat, Death Mittens.  Jeek has a new look and a new name, Squeezes-His-Prey.\r<br />Both Squeezes-His-Prey and Death Mittens use the invisible unarmed weapon to deliver deadly punches.  You can use it too.  Just take it from their inventory.\r<br />\r<br />They fight well together&#33;   If you use EFF, AFT or another follow mod then recruit them both.  Or recruit just one if two followers isn&#39;t attractive.  Either one will happily punch a dragon to death for you.  You can find them waiting for you in The Sleeping Giant Tavern.\r<br />\r<br />This is a stand alone mod and requires nothing more than Skyrim and the official update.  The screen capture shows them with beast skeleton mod and texture mods found elsewhere on Nexus.  Without these mods they&#39;ll have a more plain vanilla appearance except for some minor tweaks.  Squeezes-His-Prey has forked horns and Death Mittens has a mustache and sideburns combination which isn&#39;t normally an option.\r<br />\r<br />6.1 Fixes missing kill move condition for back side kill moves.  Bandits kept stabbing me in the back and I used back side kill moves when I shouldn&#39;t oughta.  Squeezes-His-Prey comes equipped with the fear inducing Unarmed Master weapon.   Death Mittens comes equipped with the Unarmed Adept weapon which does not induce fear but he has the tiger growl for that. \r<br />\r<br />6.2 Fixes weaponpusheffect script db number that was broken during file merge.  Bad guys are flying again.  Also puts the DATA folder were it should be.\r<br />\r<br />Thank you to Ominousvoice who posted the WeaponPushEffect script for knock back without making some targets immortal.  It&#39;s much cleaner than the workaround I was using.  I make no claims on anything in this mod.  Use abuse, modify and enjoy, or not, as you see fit.",
  "categoryId": "96",
  "version": "R6.2",
  "author": "Grumpy Mule",
  "createdUnix": "1471064811",
  "updatedUnix": "1503800634",
  "containsAdultContent": false,
  "uploadedBy": "GrumpyMule",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000252997",
      "name": "Tiger And Dragon R6.2 (Formerly Jeek Half-Dragon)",
      "version": "R6.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "270",
      "fileName": "Tiger And Dragon R6.2 (Formerly Jeek Half-Dragon)-77844-R6-1.7z",
      "uploadedUnix": "1503800634",
      "modVersion": "R6.2",
      "virusScanUrl": "https://www.virustotal.com/file/b0ecea8974aef5138d35ab422c526e28a2078b77a446711003f79684060e5957/analysis/1503800943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tiger%20And%20Dragon%20R6.2%20%28Formerly%20Jeek%20Half-Dragon%29-77844-R6-1.7z?fid=1000252997&ttl=1535866458&ri=8192&rs=8192&setec=e0b1bb36d188e4ceaba99612dce69e2c"
    }
  ]
}