{
  "modId": 77861.0,
  "modName": "Bosmer Hearthfires",
  "summary": "A build-your-own home for the Bosmer who doesn&#39;t like to cut trees.",
  "descriptionHtml": "Another Hearthfires-based build-your-own-home mod with a twist. This one uses no logs, as it&#39;s intended for anyone who dislikes harming trees, such as a Bosmer. \r<br />\r<br />It is situated in the Rift, and encloses a vacant animal den with living vines. Furniture is built from bones, hides, antlers and tusks, and you use pottery for storage. As usual with Hearthfires homes, you&#39;ll also use a lot of iron, in the form of nails and fittings.\r<br />\r<br />Before you can start building, you have to do the regular quest &#34;Kyne&#39;s Sacred Trials&#34; given to you by Froki - Haming&#39;s grandfather, who lives in a shack up in the hills above the Rift. \r<br />\r<br />The mod adds Animal Bones as a death item to many of the larger animals, both predators and their prey. You&#39;ll also need to collect goat horns and mammoth tusks, mine stone and clay, and various ores. The construction of the home and its furniture must all be done by the player; no stewards to do the work in this one.\r<br />\r<br />Compatibility: Hunterborn changes the way hunted animals are processed. You will need to change its settings to allow the regular death items to be accessed, but can set that back afterward. Other mods that alter the death items of animals may conflict, but hopefully there will still be enough dropping bones.\r<br />\r<br />Requirements: Hearthfires, obviously, but also Dawnguard, as it relies on arrows being made constructible. \r<br />\r<br />If you&#39;re not playing a Bosmer, you might like:\r<br />[url=http://www.nexusmods.com/skyrim/mods/64038]Orc Hearthfires[/url] - build your own stronghold on the tundra in Whiterun Hold.\r<br />[url=http://www.nexusmods.com/skyrim/mods/69061]Argonian Hearthfires[/url] - dig out an old ruin beneath the lake and furnish it\r<br />[url=http://www.nexusmods.com/skyrim/mods/71553]Khajiit Hearthfires[/url] - build a wagon as a mobile home, and get a base workshop thrown in free&#33;\r<br />[url=http://www.nexusmods.com/skyrim/mods/74171]Dremora Hearthfires[/url] - refurbish a Nordic Tower and get a summonable Dremora Housecarl.",
  "categoryId": "67",
  "version": "1.0",
  "author": "ghastley",
  "createdUnix": "1471119022",
  "updatedUnix": "1471118847",
  "containsAdultContent": false,
  "uploadedBy": "ghastley",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000216850",
      "name": "BosmerHF_10",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2246",
      "fileName": "BosmerHF_10-77861-1-0.7z",
      "uploadedUnix": "1471118847",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f12ee5486b3069aef717cb1b1a940c956c04f0c8e0e372f957ba0f6d88539fd3/analysis/1471118883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BosmerHF_10-77861-1-0.7z?fid=1000216850&ttl=1535866474&ri=8192&rs=8192&setec=9be78493dd2cf0403b2c2e4724eda781"
    }
  ]
}