{
  "modId": 77902.0,
  "modName": "Bluecreek Estate v1.25",
  "summary": "Welcome to the remote grounds of Bluecreek Estate, a secluded player home situated on the north-eastern shore of Lake Ilinalta. The estate includes a wood mill, goldmine, hot tub, treasure vault, hunter’s shack, servant quarters and the main residence. All of this can be yours if you’ve got the gold – the mine even provides a source of income",
  "descriptionHtml": "[size=5]Note: This is a re-upload with full author permission from Tom[/size]\r<br />\r<br />I’ll let the screenshots do most of the talking for me, but some necessary information is listed below. Please note that this is a highly detailed, complete and lore-friendly modification. Both exterior and interior cells are fully navmeshed (and thus follower-friendly) and I’ve tried my very best to make the whole thing fit seamlessly into the game world. \r<br />\r<br />\r<br />Includes (shortlist, more details below): \r<br />\r<br />-   A long entrance-way \r<br />-        Wood mill \r<br />-   Goldmine (source of income) \r<br />-   Hot tub \r<br />-   Treasure vault \r<br />-   Hunter’s shack \r<br />-   Servant quarters \r<br />-   Main residence (entrance hall, living room, reading room, alchemy- and enchanting chamber, dining room, bar, housecarl / follower room, armory / weapon display, balcony, master bedroom, attic) \r<br />-   5 servants; a hunter, gardener, lumberjack and 2 miners \r<br />-   3 guards \r<br />-   All crafting, alchemy and enchanting necessities \r<br />-   Overall high attention to detail \r<br />-   Interior optimization \r<br />\r<br />\r<br />Location: \r<br />\r<br />As stated, the estate sits on the north-eastern banks of Lake Ilinalta, Falkreath hold. There are two map markers, one near the entrance and one directly in front of the main residence, but initially they are not visible. In order to get there, it is easiest to travel to the Guardian Stones, take the road up the hill, take the first road on the right and follow it downhill until you see two similar statues on your right hand side. Here starts the entranceway to the estate. \r<br />\r<br />\r<br />How to acquire: \r<br />\r<br />Make your way to the main residence atop the hill; there you will find a clue as to how to acquire the building. When you get to the salesman, be sure to bring enough gold (there’s quite a price tag, depending on your speech skill) and ask him what he’s got for sale. You ‘buy’ a purchase contract. \r<br />\r<br />\r<br />Storage: \r<br />\r<br />All containers are safe for storage, including those outside, except for the containers in the servant quarters. \r<br />\r<br />\r<br />Special Features: \r<br />\r<br />Goldmine: the goldmine consists of an entrance hallway, two smaller rooms and a central chamber, connected through short narrow passages. In this central chamber, you’ll find a treasure chest which stores the daily output of the mine; this may include gold ores, gems, or even mushrooms or moss the miners collected. \r<br />\r<br />Treasure Vault: this is a cave connected to a small ancient Nordic hallway, half collapsed, providing the player an opportunity to store and display his most valued treasures in safety. \r<br />\r<br />Hot tub: behind the main house; you and any actor entering the hot tub will instantly unequip all items – give your follower some clothing to make them automatically switch back to their best gear upon leaving the tub. There’s a small drawer nearby useful in case you’re out of spare t-shirts ;-) \r<br />\r<br />\r<br />NPCs: \r<br />-   Aldo, Nord, Hunter. He can sell you hunting game and poisons. \r<br />-   Layla, Breton, Gardener / Lumberjack. Will bring firewood uphill every day. \r<br />-   Hides-Her-Ore, Argonian, Miner. \r<br />-   Maleethus, Argonian, Miner. \r<br />-   Magronak, Orc, Lumberjack. Works the mill, but will guard the vault during the night. \r<br />-   Aelius, Nord, Sentry. He is an ex-legionnaire. \r<br />-   Gromm, Nord, Sentry. Quite the brute without brains, but truehearted nonetheless. \r<br />-   Nethwen, Wood elf, Sentry. Face-painted former treasure hunter who prefers to sleep in a tent underneath the stars. \r<br />All sentries can be asked to follow the player. \r<br />\r<br />\r<br />Followers / spouses: \r<br />\r<br />The estate is follower-friendly (in the sense that it is fully navmeshed) but you cannot move your spouse here. I recommend using another popular mod to be able to make your spouse live anywhere (see recommended mods). \r<br />\r<br />\r<br />Installation: \r<br />\r<br />Hit the green Subscribe button on this page. The next time you fire up Skyrim, give the launcher some time to actually download the mod. When this mod pops up under ´Data files´ you´re good to go. \r<br />\r<br />\r<br />Recommended mods: \r<br />\r<br />-   Spouses can live anywhere [url=https://steamcommunity.com/linkfilter/?url=http://(http://skyrim.nexusmods.com/mods/11370),](http://skyrim.nexusmods.com/mods/11370),[/url] to be able to move your spouse in. \r<br />-   Vanilla Mannequin Script Fix [url=https://steamcommunity.com/linkfilter/?url=http://(http://skyrim.nexusmods.com/mods/10652),](http://skyrim.nexusmods.com/mods/10652),[/url] to prevent problems with default mannequins \r<br />\r<br />\r<br />Downloadable content: \r<br />\r<br />No DLC Required&#33; \r<br />\r<br />\r<br />Compatibility: \r<br />\r<br />The mod should be compatible with any other mod except those who edit the same exterior cells (those around DragonLair03 and east up to the Guardian Stones). Those mods may actually be compatible (you will have to see for yourself, I cannot test them all) as long as you place this mod lower in your load order. \r<br />\r<br />\r<br />Known issues: \r<br />\r<br />-   Floating grass and rocks may appear in the area. This is a Skyrim bug, for which you can find the fix over here: [url=https://steamcommunity.com/linkfilter/?url=http://www.creationkit.com/Floating_Grass_Fix]http://www.creationkit.com/Floating_Grass_Fix[/url] \r<br />-   Vanilla mannequins sometimes tend to take on awkward poses and might wander off and what not. Use the Vanilla Mannequin Script Fix to prevent this if you experience any problems. \r<br />-   The estate is located rather close to a dragon lair. Chances are you may have killed the dragon there, and there is a small chance you might find its carcass lying somewhere on the estate grounds. Open the console, click the carcass and type ‘disable’ to remove it. \r<br />-   If you are using a realistic lighting mod or an ENB, chances are you might find the lighting inside simply too dark. In that case, you will want to download the Vanilla Lighting version from the Nexus. \r<br />- BOSS might give you an &#39;error&#39; about deleted Navmeshes. Ignore this, as it is no problem. I have deleted the Bethesda navmeshes in the area and redid them from scratch, because redoing them from scratch would take me less time than editing existing navmeshes. \r<br />\r<br />History: \r<br />\r<br />Rev 2: changed the preview picture. \r<br />Rev 3: changed the preview picture again to reflect more of the actual content, and changed the location / radius of the two map markers.",
  "categoryId": "67",
  "version": "v1.25",
  "author": "Tom",
  "createdUnix": "1471249860",
  "updatedUnix": "1471249860",
  "containsAdultContent": false,
  "uploadedBy": "TheOGYeezus",
  "primaryFile": null,
  "files": []
}