{
  "modId": 77928.0,
  "modName": "Skyrim Ultimate Modding Guide - Gameplay and Immersion",
  "summary": "Version 2.0 is here with a HUGE update and improvements!<br />Second guide in \"Skyrim Ultimate Modding Guide\" series.",
  "descriptionHtml": "[center][size=3]This video was made earlier, but since that not so much changed at YT for authors, and especially small channels like mine. Monetization income was severely cut and that raises a huge threat on my work as a part of modding community. But there's a way to help me keep running (which is completely up to you of course). Cheers![/size]\n<br />[youtube]hJ9vEi4IqFU[/youtube]\n<br />[font=Arial][size=3][color=#ff7700][b][font=Arial][size=3][color=#ff7700]Graphics guide is [/color][url=http://www.nexusmods.com/skyrim/mods/76373]here[/url][color=#ff7700].[/color][/size][/font][/b]\n<br />Ultimate Guide for [/color][url=http://www.nexusmods.com/skyrim/mods/82945]MAGES[/url][color=#ff7700] is here!\n<br />[url=https://www.nexusmods.com/oblivion/mods/48448][/url][url=https://www.nexusmods.com/oblivion/mods/48448][/url][url=https://www.nexusmods.com/oblivion/mods/48448]Oblivion GAMEPLAY GUIDE[/url]﻿﻿ is here.[/color]\n<br />[b]Have you ever thought:[/b]\n<br />[color=#ff7700]\"My game is boring!\"[/color]\n<br />[color=#ff7700]\"I've finished all the DLCs, what's next?\"[/color]\n<br />[color=#ff7700]\"The game should be more realistic.\"[/color]\n<br />[color=#ff7700]\"I want new game expirience and challenges.\"[/color]\n<br />[color=#ff7700]Search no more! Watch, read, choose, download, enjoy! :)[/color]\n<br />[/size][/font][font=Arial][size=3]Please read \"FAQ\" and \"How to start &amp; stability\" before start modding!\n<br />Join our [url=https://discord.gg/XjyJvxP]Discord server[/url] to have modding chatting and advices.[color=#ff7700][/color][/size][/font][/center][b][b][color=#ff7700][size=3]About this guide:[/size]\n<br />[/color][/b][/b][color=#9fc5e8][font=Tahoma][size=4]This is a second guide after Graphics one. Firstly I just wanted to share my combat mods loard order for immersive and challenging playthrough, but then, as well as with Graphics guide I decided to create a wide list of Gameplay &amp; Immersion mods for you guys, alongside with patches/fixes list and some my personal comments. This consists of three parts - Expansion, Gameplay and Immersion. Expansion contains list of mods that add new lands/dungeons/quests/armors and weapons and so on. Gameplay part is for magic/spells/perks/combat and many other mods that affect your gameplay variety and difficulty. Immersion part contains mods that makes your playthrough more atmospheric and realistic in overall.\n<br />To make guide navigation easier, I placed guide sections into so called \"spoilers\" - when you see Spoiler button - just click on it to expand corresponding group of mods. Click again to close it :)[/size][/font]\n<br />[/color]\n<br />[font=Tahoma][size=3]Ever wanted [/size][/font][font=Tahoma][size=3]to support me?[/size][/font][font=Tahoma][size=3]\n<br />[/size]\n<br />[url=https://www.patreon.com/SinitarGaming][img]https://i.imgur.com/1n5DoL7.png[/img][/url][/font]\n<br />\n<br />[color=#ff7700][size=5][b]Permissions:\n<br />[/b][/size][/color]\n<br />[size=4]I don't give a permission to re-upload this to other sites by any other person, if you like this guide and want to share it please just add a link to this thread instead or link the YT video.[/size]\n<br />\n<br />[b][color=#ff7700][size=5]Guide features:[/size][/color][/b]\n<br />\n<br />[list]\n<br />[*][font=Arial][size=3]Complete list of gameplay mods, more than 400 in total to drastically improve your Skyrim gameplay making it more than worthy of 2018. Better combat, magic, perks, AI, new monsters, quests, lands and settlements, immersion and survival realism, population, followers, armors and weapons - absolutely everything you may want.[/size][/font]\n<br />[*][font=Arial][size=3]Personal notes about mods.[/size][/font]\n<br />[*][font=Arial][size=3]Comfortable and easy-to-navigate design.[/size][/font]\n<br />[*][font=Arial][size=3]Patches/fixes included + my personal remarks for the best result.[/size][/font]\n<br />[*][font=Arial][size=3]My personal recommendations for making combination of combat/AI/magic/perk mods for interesting and challenging game.[/size][/font]\n<br />[*][font=Arial][size=3][url=https://www.nexusmods.com/skyrim/mods/1175]Uncapper[/url]﻿ .INI file already pre-tweaked for you - for rewarding and balanced leveling and skills progression.[/size][/font]\n<br />[*][font=Arial][size=3]Constant updates and support :)[/size][/font]\n<br />[/list][center][size=3][b]Gameplay Demonstration:[/b][/size]\n<br />[youtube]o705kwKT7aM[/youtube]\n<br />[size=3][b]Best WEREWOLF Mods:\n<br />[youtube]h8K9ZIr_-Sc[/youtube]\n<br />\n<br />\n<br />[/b][/size][size=3][b][img]https://i.imgur.com/zhePlyH.jpg[/img]﻿\n<br />[/b][/size][/center][list]\n<br />[b][size=5][/size][/b][/list][font=Arial][size=2][color=#ff7700]Q:[/color] What are your PC specs?\n<br />[color=#1e84cc]A: [/color]Intel i5 6600k, GTX 980 4GB, 16GB RAM, 1920x1080 Full HD monitor, Windows 7.\n<br />\n<br />[color=#ff7700]Q:[/color] So I should install ALL mods from this list?\n<br />[color=#3c78d8]A:[/color] No, definitely no. This is a guide - it gives you an ability to compare and choose. Moreover, when it comes to gameplay mods, they often change the same things in game, sometimes are script-heavy so you may think install them or no and so on, so you need to carefully choose each mod you like and read about it. Open mod pages, browse the images, read the description. Install what you like and don't install what you don't like, but remember to not overload your game, don't install mods blindly :)\n<br />\n<br />[color=#ff7700]Q:[/color] How about modded game stability in overall?\n<br />[color=#1e84cc]A:[/color] Please, follow \"How to start &amp; stability\" section in graphics guide. This is required. Mandatory. You can not skip this. Even if you don't plan to use graphics mods themselves, you still must follow all the steps from this section. \n<br />\n<br />[color=#ff7700]Q:[/color] Is installation order important for mods from this guide?\n<br />[color=#3c78d8]A:[/color] Unlike with texture mods, installation order doesn't matter in 99% of cases, but load order matters. Mostly you can trust LOOT automatic sorting, but still, read each mod page attentively as it may have special instructions for manual load order.\n<br />\n<br />[color=#ff7700]Q:[/color] I got infinite loading screen/my game crashes/I have enourmous stutters and FPS drops/I have some weird gameplay bugs.\n<br />[color=#1e84cc]A:[/color] Please read \"How to start &amp; stability\" section in graphics guide carefully and \"Before you start and essential mods\" section in this guide. Read it and install all the things needed before starting to install mods from the list themselves.\n<br />\n<br />[color=#ff7700]Q:[/color] That doesn't help!\n<br />[color=#1e84cc]A:[/color] Trust me, if you have read everything carefully and installed, it will solve all your problems in 99% of cases. If not, feel free to ask in comments, or better join our [url=https://discord.gg/PYNjv82]Discord server[/url] and community members or I will try our best to help you :)\n<br />\n<br />[color=#ff7700]Q:[/color] I expected to find this mod in this guide section/category, but it's not there. What to do?\n<br />[color=#3d85c6]A:[/color] Sometimes gameplay mods are really complex and its can category be pretty \"blurred\". For example, Revenge of the Enemies mod is in \"Gameplay Effects and Changes\" category on Nexus, but it can be easily called an Overhaul as well, as it's a complete overhaul of almost all enemies in the game in meaning if their abilities. So, just keep reading. With 99.9% chance you'll just find it in another section. But if not - feel free to suggest to add it in Discord.\n<br />\n<br />[color=#ff7700]Q:[/color] Where are you from? A few words about you?\n<br />[color=#1e84cc]A:[/color] Ukraine. 28 years old. Gamer, retarded slavic youtuber youtuber and gym addict. Web-developer in past, fitness trainer and nutritionist now (as hobby).\n<br />\n<br />[color=#ff7700]Q:[/color] Would you expand this guide and add this/that?\n<br />[color=#1e84cc]A:[/color] Sure! That's why I made version 2.0. And for sure, I will update and improve it. Unstoppably. :)\n<br />\n<br />[color=#ff7700]Q:[/color] Ok, guide just received massive update, but how can I see the little new additions?\n<br />[color=#1e84cc]A:[/color] I add mods and fix text errors few times per week. All the mods freshly added to the guide will be marked with red-colored \"[color=#ff0000]==[color=#ff0000]NEW==[/color][/color]\" sign.\n<br />\n<br />[color=#ff7700]Q:[/color] Can you just upload your Skyrim folder with all your mods somewhere so I can just download it and not to choose and install mods one by one?\n<br />[color=#3d85c6]A:[/color] Unfortunately, no. The reasons:\n<br />Firstly - I can't do this as many mods from the list are Nexus-exslusive and mod authors didn't give a permission to re-upload their works somewhere. I respect their work.\n<br />Secondly - everyone has absolutely different PC specs, and my setup can be absolutely unplayable for many people.\n<br />Trust me - when you're making your mod setup by yourself the result will be way better because most of mods are absolutely matter of taste.[/size][/font]\n<br />\n<br />[font=Arial][size=3][center][b]Now, the first and most important rule. Keeping it will drive you to the peaks of glory with 700 mods and 100% stable game[/b].\n<br />[img]https://i.imgur.com/EdnaAuf.jpg[/img]﻿[/center][/size][/font]\n<br />[center][img]https://i.imgur.com/XeJynR7.jpg[/img]﻿[/center]\n<br />[font=Arial][size=3][color=#ff7700]1) Carefully follow the \"How to start &amp; stability\" section in [url=https://www.nexusmods.com/skyrim/mods/76373]graphics guide[/url].[/color]\n<br />This is required. Mandatory. [color=#e06666]You can not skip this.[/color] Even if you don't plan to use graphics mods themselves, you still must follow all the steps from this section. This section is a base for a stable and comfortable game in overall no matter what mods you will install later.\n<br />\n<br />[/size][/font][font=Arial][color=#ff7700][size=3]2) Install [url=https://www.nexusmods.com/skyrim/mods/77465]Modern Brawl Bug Fix[/url]﻿.[/size][/color][/font]\n<br />The ultimate solution to brawls that break instantly or turn into real fights. Compatible with any mod. [color=#ff7700]Note:[/color] if you will use Ordinator perk overhaul mod or Wildcat combat mod, you can not install this mod as it's uncluded in these two (if you are not sure, install it now and just remove later).\n<br />\n<br />[font=Arial][size=3][color=#ff7700]3) Install[/color] [url=https://www.nexusmods.com/skyrim/mods/34093]Weapons and Armor Fixes[/url] [color=#ff7700]+[/color] [url=https://www.nexusmods.com/skyrim/mods/43053]Clothing and Clutter Fixes[/url][color=#ff7700].[/color][/size][/font]\n<br />Essential mods from amazing author. These 2 do exactly how they're called.\n<br />\n<br />[font=Arial][color=#ff7700][size=3]4) Install [url=https://www.nexusmods.com/skyrim/mods/49791]Complete Crafting Overhaul Remade[/url][/size][/color][/font][font=Arial][color=#ff7700][size=3].[/size][/color][/font]\n<br />Essential mod from author of previous two fixes. CCOR is reworking all vanilla craft recipes, offers many options for mining, chopping, smelting and so on - simply making everything crafting-related to be logical and really interesting. That's why you need it even if you never actually crafted a single thing in Skyrim - because now it's not that dull crafting system. Consider it as the vanilla part of the game as it always should have been from the release. Most of mod options can be enabled/disabled and configured via MCM menu.\n<br />\n<br />[font=Arial][color=#ff7700][size=3]5) Install [/size][/color][/font][font=Arial][color=#ff7700][size=3][url=https://www.nexusmods.com/skyrim/mods/70656]Wiseman303's Flora Fixes[/url] + [url=https://www.nexusmods.com/skyrim/mods/54485]Wiseman303's Critter Fixes[/url] + [url=https://www.nexusmods.com/skyrim/mods/75511]Better Harvesting[/url].\n<br />[/size][/color][/font]Tiny and not noticable in general, but also must-have mods that are fixing various little bugs and/or irrational things. Important: when you'll be insatlling Better Harvesting, go to \"Files\" tab and download \"Better Harvesting (for Wiseman's Flora Fixes)\" version, and only this one (main file is not needed).\n<br />\n<br />[font=Arial][color=#ff7700][size=3]6) Install [url=https://www.nexusmods.com/skyrim/mods/36334]Inconsequential NPCs[/url].[/size][/color][/font]\n<br />[font=Arial][size=2]This mod is something game should have from teh day one - it's simply essential. It's adding various NPCs here and there in Skyrim, greatly fitting the city/town/region - you will never even think these NPCs are from the mod as they are acting absolutely seamlessly.\n<br />Carriages now finally have guards, there are skooma dealers and flower girls in Riften, much more mercenaries, college studends, tavern patrons, workers, towncriers and much more.[/size]\n<br />\n<br />[color=#ff7700]7) Instal [/color][url=https://www.nexusmods.com/skyrim/mods/1175]Skyrim Community Uncapper[/url][color=#ff7700]﻿.[/color]\n<br />[/font]This amazing mod allows you to get rid of silly vanilla \"legendary\" skills system by simply uncapping your skills - so now you can raise skills above 100, and all related multipliers and modifiers (even enchanting and alchemy) will grow as well. Besides that, Uncapper does tons of oher useful things - you can determine leveling speed (strongly recommened to make it slower to not get lost on huge amount of new things in game if you have heavy-modded game), how many attributes you receive per at levelup (and at which level as well), how many perk points you receive at levelup (and at which level as well) and many other things. When just installed, it does nothing besides the very base. In \"Files\" tab section you can find archive with my Uncapper .INI files (different version for different tastes, also please be sure to read the readme) and use this .INI file, or just tweak it yourself, all lines in .INI file are pretty much self-explanatory.\n<br />\n<br />[font=Arial][size=3][color=#ff7700]8) Install[/color] [url=https://www.nexusmods.com/skyrim/mods/14884]Fuz Ro D-oh - Silent Voice[/url]﻿[color=#ff7700].[/color][/size][/font]\n<br />An SKSE plugin that adds support for unvoiced in-game dialog which will be very useful to you in heavy-modded game.\n<br />\n<br />[font=Arial][color=#ff7700][size=3]9) Install [url=https://www.nexusmods.com/skyrim/mods/10753]Auto Unequip Ammo[/url].[/size][/color][/font]\n<br />A must-have mod which is simply automatically unequips bow/crossbow ammo from your back after ranged weapon is unequipped.\n<br />\n<br />\n<br />[font=Arial][size=3][color=#ff7700]Congrats, you're ready now.[/color]\n<br />\n<br />[/size][/font]\n<br />[center][img]https://i.imgur.com/JhXjZzd.jpg[/img]﻿[/center]\n<br />[font=Arial][size=3]﻿Quests and new lands, dungeons, new armors, weapons and artifacts, followers and player homes. Many of quest/new land mods listed here are really big and complex and can give you dozens of interesting gameplay hours not worse then official Skyrim DLCs.\n<br />[/size][/font]\n<br />[center][img]https://i.imgur.com/Hg3uU6J.jpg[/img]﻿[/center]\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/37994]Falskaar[/url]\n<br />TOP-1 new lands mod at Nexus. And it's absolutely deservedly. Huge new land. Dozens of gameplay hours. Interesting and voiced questline. Amazing soundtracks, new spells/shouts and more! Be sure to install [url=https://www.nexusmods.com/skyrim/mods/84092]unofficial patch[/url]﻿, [url=https://www.nexusmods.com/skyrim/mods/51445]typo patch[/url], [url=https://www.nexusmods.com/skyrim/mods/70273]fixes and enhancements patch[/url], [url=https://www.nexusmods.com/skyrim/mods/38374]fast travel addon[/url], and [url=https://www.nexusmods.com/skyrim/mods/50246]wildlife addon[/url] for it.\n<br />[color=#ff7700]Optional patche/additions:[/color]\n<br />[url=https://www.nexusmods.com/skyrim/mods/90236]Falskaar - Climates of Tamriel Patch classic[/url]﻿\n<br />[url=http://www.nexusmods.com/skyrim/mods/38094]Training Dummies and Targets - Falskaar Edition[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70273]The Notice Board - Falskaar[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/60317]Falskaar - Realistic Needs and Diseases patch[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/82501]Falskaar Home - Huntsman's Hut[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/71332]Broken Sky Cottage - Falskaar[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/38427]Falskaar Home Improvement[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/57069]Improved Closefaced Helmets - Falskaar[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/54102]Falskaar - TK Children patch[/url]\n<br />\n<br />[url=https://archive.org/details/Wyrmstooth1.17B]Wyrmstooth[/url]\n<br />[color=#e06666]Note:[/color] mod is currently hosted not on Nexus, though it's official mod website hosted by mod author. Download the mod archive, put it into your mod manager mods folder (like [color=#00ffff]&#92;Games&#92;Nexus Mod Manager&#92;Skyrim&#92;Mods[/color] for NMM, for example), relaunch mod manager and install mod as usually.\n<br />Anoter amazing and well-known DLC-sized mod with dozens hours of great gameplay and storyline related with dragon hunt...but it's only a beginning! An absolutely qualitative mod of medium size is awaiting for you. Be sure to install [url=https://www.nexusmods.com/skyrim/mods/69501]tweaks and enhancements[/url] addon.\n<br />[color=#ff7700]Optional patches/additions:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/72991]Wiseman303's Flora Fixes for Wyrmstooth[/url] (install it AFTER both Wyrmstooth and Wiseman303's Flora Fixes).\n<br />[url=https://www.nexusmods.com/skyrim/mods/70635]Flora Respawn Fix for Wyrmstooth[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/88193]Dark Forests of Skyrim - Wyrmstooth[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/85428]Wyrmstooth Thunderchild Patch[/url]﻿\n<br />[url=https://www.nexusmods.com/skyrim/mods/74601]Paper World Map for Wyrmstooth[/url]\n<br />\n<br />[color=#ff7700]Now install this mod. Pick up version depending on what you have - Falskaar, Wyrmstooth or both.[/color]\n<br />[url=https://www.nexusmods.com/skyrim/mods/51339]Better Falskaar and Wyrmstooth Map With Roads[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/68406]Summerset Isle[/url]\n<br />Amazing DLC-sized mod that gives us a great adventure in the land of Altmer. Fully voiced. Unique items, dozens of towns, cities &amp; dungeons. New bosses and minibosses. Note: read compatibility section carefully. Also be sure to download and install patch for Verdant if you use it. Uninstall patch when you come back to Skyrim.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73341]Summerset Isle - Merged Patches[/url] it only doesn't contains RND patch, take it from [url=http://www.nexusmods.com/skyrim/mods/68602]here[/url].\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/67559]Darkend[/url]\n<br />Amazing new land mod inspired by Dark/Demon Souls series. Atmospheric, dark location, very detailed and interesting to explore. New creepy enemies, tough bosses and powerful weapons are waiting. For those who already have it - check out mod page for the new version.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74760]Typo Patch - Darkend[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/89807]Darkend Balance Patch[/url]\n<br />Balances some really overpowered artifacts from this mod. Matter of taste, ofc.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/18465]The Paarthurnax Dilemma[/url]\n<br />Disappointed with how ruthless and unforgiving the Blades were at the end of the main quest? Felt like you should have been able to put your foot down and make them see reason? Well now you can!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/35841]Helgen Reborn[/url]\n<br />Awesome mod for rebuilding Helgen.Fully voiced questline, great story.New dungeons, 3 new armor sets, private \n<br />tower player home. Interactive display room that transforms as you play the game.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87590]The Tools of Kagrenac[/url]﻿\n<br />Go on a quest to recover the legendary Tools of Kagrenac. Encounter new allies and enemies, explore sprawling dungeons and add powerful new artifacts and spells to your arsenal in this new and fully voiced quest mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90276]Project AHO[/url]﻿\n<br />A new and must-play quest mod. Don't you even dare to skip it Let me explain: if I would make my \"Top 10 Quest Mods\" video today, Project AHO definitelly would be in the list of 5 best quest mods ever made. Everything in this mod is just amazing - breathtaking detective storyline with multiple endings, brilliant voice acting, stunningly beautiful worldspace design and a lot of puns and references at the same time. I never felt such a deep and detailed recreation of Morrowind vibes as in this mod. Try it for sure! And don't forget to grab Dual Sheath Redux [url=https://www.nexusmods.com/skyrim/mods/90469]patch[/url] for it if you have or planning to have DSR.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/9782]Moonpath to Elsweyr[/url]\n<br />Amazing DLC-sized tropical/desert mod that give player a chance to travel into the lands of Elsweyr to explore, survive and enjoy amazing playthrough. It contains dozens of unique locations, new enemies, items, custom follower and a player home. Awesome and absolutely must-play mod.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/51556]Typo Patch - Moonpath to Elsweyr[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/67927]Moonpath to Elsweyr - Improved[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/81085]Moonpath - Lighting and Weather Patch[/url]\n<br />Compatible only with original version of the mod, not one included in Legacy of the Dragonborn (see below).\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/40607]Undeath[/url]\n<br />Ever wanted to be real necromancer in Skyrim? This mod is for you then! Fully voiced, interesting questline + custom soundtrack. 3 new dungeons. 2 necromancer lairs. New spells and powers. Become a fear. Become a Lich!\n<br />[color=#ff7700]Fixes/patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53589]Undeath Invisible Scrye Fix[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/60783]Undeath Immersive Lichdom V3[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/69868]Undeath Immersive Lichdom Perma and Ordinator Perktree Patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/77583]Path of Sorcery - Undeath Immersive Lichdom Perktree patch[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/71717/]Path of The Revenant[/url]\n<br />It seems that a powerful necromancer is hiding near Dawnstar, will you cleanse his lair for the good of Skyrim? Or perhaps you seek to take his power for your own?\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/25941]The Dark Brotherhood Resurrection[/url]\n<br />A great Dark Brotherhood expansion mod. 2 new custom followers. 22 new quests. 6 new words of power. 3 new spells, 2 new dungeons, new items and treasures. And of course, the biggest feature - 6 new death contracts. Kill the most powerful people of Skyrim!\n<br />If you will face bug that all dragons became invulnerable, use this [url=http://www.nexusmods.com/skyrim/mods/26559]fix[/url].\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/52397]Moon and Star[/url]\n<br />Amazing detective story. Interesting questline, 4 side quests, 9 voiced NPCs. New town, weapons and dungeons with new boss fights. Ingame aftermath events that take place after the main quest has been completed. Your actions have consequences!\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/68258]Moon and Star - RS Children Patch[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89857]The Brotherhood of Old - Open Beta[/url]﻿\n<br />Amazing, fully-voiced, thrilling Dark Brotherhood mod with multiple endings. Mod continues DB questline after you finished the vanilla storyline, giving you a lot of new opportunities to either destroy DB completely or bring it to absolutely new level of glory! [color=#e06666]Note:[/color] mod is still in beta so it have some bugs here and there. You already can complete it and it's not dangerous to your game, but if you don't want to be bothered by bugs at all, wait a bit until mod will go out of beta.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/64651]The Gray Cowl of Nocturnal[/url]\n<br />Amazing DLC-sized mod for all who like thief gameplay. Beautiful landscapes, amazing questline, dozens of traps and puzzles and finally an uiltimate prize - Gray Cowl of Nocturnal (Mask of Gray Fox).\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/64752]Gray Cowl of Nocturnal Alikr Flora Overhaul[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/68308]Al-Janna Player Home and Getaway[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74738]Footprints for The Gray Cowl of Nocturnal[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74780]Typo Patch - The Gray Cowl of Nocturnal[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/70219]The Forgotten City\n<br />[/url]Amazing, dynamic, incredibly detailed! Beautiful, intricately detailed new city to explore. Non-linear story with several endings. Amazing orchestral soundtrack, big community of fully-voicedNPC with backstories. Discover secrets, mysteries, and relics that are thousands of years old. Enjoy! You may also find RS Children [url=https://www.nexusmods.com/skyrim/mods/88278]patch[/url] for it useful if you're using RS Children mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/32458]Konahriks Accoutrements - Dragon Priest Armory[/url]\n<br />Atmospheric, challenging, rewarding and replaybale mod. Take a journey through time in the lost Dragon Priest temple, Revakheim. Unlock unique gear and create armor not seen since the First Era. Gain new powers and become stronger than ever. Fight ancient enemies and fulfill your destiny as the true \"Konahrik\" Warlord.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/70142]The Notice Board[/url]\n<br />Great immersion mod. Radiant quest overhaul and framework. This mod adds new and alternative radiant (and side) quests. It was inspired from other good games like The Witcher which make use of notice boards in their gameplay. There are two kinds of notice boards:\n<br />•    Quest notes Notice board  – always on a pole with and candles\n<br />•    Messages Notice board – it’s the one without the pole These notice boards can be found ouside inns in every town of Skyrim. A patch for Raven Rock in Solstheim is also available.\n<br />Patches:\n<br />[url=http://www.nexusmods.com/skyrim/mods/70260]The Notice Board Redefined - New Meshes and Textures[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70588]Notice Board - Dragonborn DLC - Better Solstheim Quests[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/85815]Missives[/url]\n<br />A good addition to previous mod if you liked it. Adds a large number of localized radiant quests found at Missive Boards of varying difficulty and with varying rewards. [color=#e06666]Note:[/color] still has some minor bugs, but mod author is actively updating the mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/37244]Missing Apprentices[/url]\n<br />Similar, old-but-good mod.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/52248]Legacy of the Dragonborn (Dragonborn Gallery)[/url]\n<br />This mod is something unique. Something incredible. It will make you to look at your playthrough from the absolute different view. This mod will inspire you to play Skyrim again and again. Mod features: Museum with 2263 displays, over 100 exploration quests. You can save your museum progress across multiple playthroughs. Displays of visited doomstones, custom paintings, basement store, MCM menu and (yes!) items from different mods support. 15 new dungeons, new guild - explorers guild, transmutation forge. This is only a part of full features list. Visit mod page to read more and of course to try it :)\n<br />[color=#e06666]Note:[/color] this mod already has [url=http://www.nexusmods.com/skyrim/mods/9782]Moonpath to Elsweyr[/url] included which means you don't need to install Moonpath separetely and remove it if you already have it.\n<br />[color=#ff7700]Patches/addons:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/72921]Legacy of The Dragonborn Patch Central\n<br />[/url]Main and official collection of various patches for dozens of popular mods.\n<br />[url=https://www.nexusmods.com/skyrim/mods/90837]Legacy of the Dragonborn - Craftable Black Soul gems[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/79168]The Lost Legacy of the Nine[/url]\n<br />A qualitative expansion to both Legacy of the Dragonborn and the Knights of the nine, adding items and unmarked quests.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/58672]The Wheels of Lull[/url]\n<br />Awesome questline with a lot of secrets an puzzles, related with TES lore. Five dungeons within the main quest, complete with fleshed out boss battles, and massive, unique locations. A new town, complete with extensive characters. 7 side quests, 10 new weapons, new armors and even a new custom race.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/77809]Clockwork (Clockwork Castle)[/url]\n<br />A fresh and brilliant quest mod. It was developed about 4 years, and the time spent is totally worth. Amazingly detailed cells design, interesting quests with unique creatures involved. Almost DLC-sized journey that will you will definitely like!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87099]Ravengate[/url]\n<br />Amazing and atmospheric arena/quest mod with challenging bossfights and thrilling characters backstories! Try it for sure, no matter which class you're playing.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/80639]Teldryn Serious - A Teldryn Sero Backstory Quest[/url]\n<br />Amazing small quest mod, absolutely lore-friendly, feels like initial part of the game and drastically expanding one of the most popular vanilla male followers.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/33766]Agent of Righteous Might[/url]\n<br />Fully voiced, lore-friendly questline. Play as Vigilant of Stendarr. 16 new quests, 5 new dungeons, 25 voices NPCs. Fight a dangerous cult and bring glory to Stendarr!\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/69832]Agent of Righteous Might - Tweaks and Enhancements[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/53068]Rigmor of Bruma[/url]\n<br />Please read \"note\" befoe installing it!\n<br />Awesome ang huge, DLC-sized mod. It’s really unique - it’s story is not about Dragonborn, but really about Rigmor. Become her friend, protector or even go through a love story. Amazing voice actors, great amount of NPCs, 18 quests. Amazing journey awaits!\n<br />[color=#e06666]Note:[/color] this mod has only one flow - it's pretty script-heavy and have plenty of bugs and crashes. But it's definitely worthy to play at least once! The recommendation here is to install it, play the mod directly, uninstall, and the start a new game.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/21256]The Oblivion Realms Serie - The Gate of Solitude[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/25676]The Oblivion Realms Serie - Morthal Pain[/url]\n<br />Original mod series that bring planes of Oblivion to Skyrim. Enter the gates and face hordes of dremoras and daedras in the lands of Oblivion. Enemies in this mod are pretty hard as well as in great numbers so your character needs to be very god prepared for this challenge. Also check files section to choose difficulty patch if playthrough is too hard/easy for you.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/48467]Beyond Reach[/url]\n<br />Huge area with the span of ~3 Skyrim Holds, rich detailed. New factions - Arnima, Evermore, The Witchmen, Orsinium's Sons, Dragonstar Mercenaries, The Exiles and The Afflicted. Voiced main quest with backstories as wel as 28 side quests, news spells, armors &amp; weapons, 25 new dungeons.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70590]Beyond Reach - Tweaks and Enhancements[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/67103]VIGILANT[/url]\n<br />Became a vigilant of Stendarr and go through an amazing dark story. This mod is just fantastic, inspired by Dark Souls series in meaning of locations design, but staying in terms of the Elder Scrolls lore at the same time! Amazing dark and creepy locations, hordes of new reatures, giant unique bosses. New unique weapons, rings, lanterns and so on. The only thing is original mod is japanese, but there are links to English and other tralnslations. One of the best ever made for Skyrim, this quest mod is absolutely worth to try - especially now it has the [url=https://www.nexusmods.com/skyrim/mods/83876]english-voiced addon[/url] made by professional and semi-professional voice actors.\n<br />If you like this mod, track his another very promising WIP project:\n<br />[url=http://www.nexusmods.com/skyrim/mods/77510]GLENMORIL[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/35200]Death Mountain[/url] and [url=http://www.nexusmods.com/skyrim/mods/58311]Death Mountain 2[/url]\n<br />In this mod you’ll need to pass through castle territory and the castle itself, beautifully designed. Study the history of Death Mountain, learn new spells and shouts in order to defeat hordes of enemies and the final dragon bosses. This mod difficulty is really hard so there are some options for difficulty.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/65259]Become a Skooma Drug Lord - Skooming Skyrim[/url]\n<br />Ever wanted to be a drug lord in Skyrim? Try this :) A fully functional scooma lab. Quests to improve your skooming skills and influence. The ability to grow Moon Sugar and thus your own supply of the all important moon sugar. The ability to sell skoom on the streets by talking to NPCs and some more features.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/72817]Blood of the Nord[/url]\n<br />Its a mid-sized quest mod that serves as the opening chapter in a series of plugins that explore the aftermath of Stormcloak victory, including the inevitable war with the Aldmeri Dominion. - Over 500 lines of dialogue - One new weapon - Includes several new dungeons and small worldspaces - The main quest provides roughly 2 hours of gameplay.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/74565]Invasion of Skyrim - Grand Admiral Thrawn[/url]\n<br />Awesome quest mod related with new race arrived in Skyrim. 15+ armor sets, a unique \"quest shell-system\" that enables dozens of radiant quests pertaining to the mod  to be active at a time, 26+ enchantments, 220+ NPCs, both enemy and ally. Enemies who can cripple you in a number of ways if your combat skills are poor. Enemies are tough, veterans, and skileld combatants. 2+ Wordlspaces, 15+ radian enabled locations, 2player bases, unique classes and combat AI for every character, many scenes and interactions. Travelling merchants, nasty assassins and much more. A player ranking system among the Resistance. Over a thousand handpicked lines of dialogue that plays both in combatm from enemies and followers, and much more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/47989]Legendary Cities - Tes Arena - Skyrim Frontier Fortress[/url]\n<br />Add 10 Historical cities (Sunguard, Pargran Village, Dunparwall, Granite Hall, Nimalten, Helarchen Creek, North Keep, Blackmoor and Vernimwood and Amol) from TES Arena game.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/86075]The Second Great War[/url]\n<br />In the aftermath of the Civil War, the Aldmeri Dominion is stirring. There are rumors of Dominion soldiers close to the border of Cyrodiil and increased numbers of Thalmor agents in the Imperial City. Are you prepared to defend Skyrim once more or are you drawn to the power and promise of the Dominion?\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/62844]Pirates of Skyrim - The Northern Cardinal under the Black Flag[/url]\n<br />Ever want to be a pirate? Search no more! Didn’t want? Try it whatever :) Just a brilliant mod. Treasure hunting, naval battles, unique loot, team morale system,ship player home and much more! This mod brings you defenitely unique expirience.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/86579]Dawnguard and Clan Volkihar Epilogues[/url]﻿\n<br />A must-have in my humble opinion. Adds an extra quest to each side of the Dawnguard questline to track down the artifacts exclusive to the other side.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/26359]The Choice is Yours - Fewer Forced Quests - Improved Dialogue Options[/url]\n<br />Stop quests from starting automatically. Pursue the quests you want, ignore the ones you don't. Make your choices matter. In addition, there are times when you are given a choice to refuse a quest, but the quest will automatically start regardless of your decision or you are forced to agree to do a job before hearing the details. Now quests won't start until you agree to them.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/31061]Dovahkiin and The Apprentice of Thuum[/url]\n<br />Adds a quest that will allow you to teach the way of the Thu'um to one of your followers.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/76673]The Azure Tree[/url]\n<br />Great exploration mod. Beautiful design. 5+ Dungeons. New Locations. New Content. Lots of loot. 5-7 Hours of Exploration. You’ll need to explore everything by yourself without quests - so if you like such a challenge, this mod is for you.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/51319]The Elder Scrolls V MIDDLE-EARTH -Lord of the Rings-[/url]\n<br />This mod adds a few new regions of JRR Tolkien's Middle-earth to the game. There are Moria, Mirkwood, Lothlorien and Rohan. This mod is not lore-friendly but it’s just stunning designed and may be an amazing land to explore for all LOTR fans.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/75451]Qaxe's Questorium[/url]\n<br />A really big quest pack that can give you hundreds of hours of gameplay. Over 100 quests, 9 world-spaces, 150+ interiors, 80+ custom voiced characters, 70+ custom spells, 70+ text items, new enemies and so on.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/53608]Shard of Oblivion WIP[/url]\n<br />This is a WIP (work in progress) mod that adds lands of Oblivion to Skyrim. It’s just amazingly detailed, and populated with new enemies, giving you a real feeling of being in Oblivion.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/35789]Shadow of Morrowind[/url]\n<br />Another amazing WIP mod. The goal is to create a lore friendly 4E Morrowind.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/80773]Sulfur and Fire- Trial of Mehrunes Dagon[/url]\n<br />Amazing new land mod, inspired by Oblivion. Complete the challenge of Mehrunes Dagon!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/76382]The Haven From The Cold And Dark[/url]\n<br />Beautiful new land mod that adds a set of Green Bosmer islands that are located between the Summerset Isles and Hammerfell. Player home, many shops and vendors, bath house and inn, many NPCs and guards. Working map and LOD and many beautiful places to explore/take screenshots.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/79826]Voyage to the Dreamborne Isles[/url]\n<br />Amazingly detailed new land mod. Beautiful for exploration and screenshots. Now has a questline as well.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/49723]Hidden Hideouts of Skyrim[/url]\n<br />Very immersive mod. It adds 21 new areas pread across Skyrim. You can use all of them as a hideout/player home. Mod also offers DLC/non DLC as well as modular versions.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/56084]SeaPoint Settlement[/url]\n<br />Awesome mod that adds new friendly location at the north-west coast part of Skyrim. Beautiful design, a lot of containers, new recipes, possibility to gain villagers favour, carriage system, new named horse and some more other features.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/38510]Dwarven Island[/url]﻿\n<br />Beautiful dwarven island which can serve you as huge homeland and residense. Has nothing special like quests or entounters, but has very beautiful design and great just to explore and make screenshots if you like this.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84460]The Shire[/url]\n<br />Obviously and definitely not lore-friendly, but beautiful new land/quest mod with original worldspace design influenced by LOTR/Hobbit titles.\n<br />\n<br />[/size][/font][font=Arial][size=3][/spoiler][/size][/font]\n<br />\n<br />\n<br />[center][img]https://i.imgur.com/cHcRXiB.jpg[/img]﻿[/center][font=Arial][size=3]Love exploring the world underground? Have new challenges, findings and ambient atmosphere? This section is for you :)[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/14351]Skyrim Sewers 4[/url]\n<br />Mod adds an accessible sewers system to the town of Solitude, Whiterun, Windhelm and Markarth and also small sewage tunnels to Fort Sungard and Greenwall + new custom weapons and unique books.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/64020]Skyrim Sewers Undeath Solitude Entrance Patch[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/69811]Molag Bal's Inferno[/url]\n<br />Winner of Reddit Skyrim dungeon competition. Amazing, exciting, atmospheric! Mod is a multi-level dungeon mod that takes place in a hellish Daedric realm, featuring 8 new dungeons complete with enemies, bosses, special rewards, and an overarching quest.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/36317]The Lost Wonders of Mzark[/url]\n<br />Amazingly atmospheric quest/dungeon mod for those who prefer a more puzzle-oriented game. The enemies you encounter within must be disposed of in careful ways, and you'll find more than just fights awaiting you in the depths of Mzarnumez. - 4 new fully voiced quests. - Huge, non-linear dungeon. - New enemies, weapons and spells. - New robe sets and special secret artifact.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/44916]Windcallers Pass[/url]\n<br />Great dungeon mod. It’s less fighting, more about exploring and finding best way to go through and this is its best feature.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/16197]The Secret of Dragonhead[/url]\n<br />Amazing, dark, greatly designed and challenging. Dungeon mod from famous mod author. Absolutely must-play!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/42616]Heimfeigr[/url]\n<br />The‘Hall of the Dead’. Beautiful and challenging dungeon mod. Immersive puzzles, a lot of enemies and tough custom bosses will give you an amazing time of playthrough.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/57979]Forgotten Dungeons[/url]\n<br />Mod adds 49 new radiant-quest enabled dungeons in Skyrim. Great design, tonns of enemies. All sizes - from little to huge. This mod will give you dozens of hours to explore. I personally recommend it for more extensive game.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/86630]Hammet's Dungeon Packs[/url]\n<br />Another great dungeon pack currently having 24 new dungeons in Skyrim and Soltheim. Dungeons in this pack are mostly oriented on high-level characters with level 40 and higher. Radiant-quest enabled. Some of dungeons contain new items and spellbooks.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/66021]Apotheosis - Lifeless Vaults[/url]\n<br />Another wesome mod inspired by Dark Souls. Winner of ‘boss battles’ competition at Reddit. Amazingly detailed cells with 5 giant and very hard boss fights that you’ll remember for sure for a long time. If you’re looking for new challenges - try this mod for sure! Also this mod mod is only a ‘preview’ of huge incoming ‘Apotheosis’ mod that would be released in autumn.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/34106]The Rabbit Hole[/url]\n<br />It’s just amazing and really unique dungeon mod! In my opinion it’s criminally underrated and absolutey must-play. Mod adds dungeon system, a ‘rabbit hole’ with 50!! levels with progressing difficulty. Also many secrets and hidden rooms to discover. Have fun!\n<br />\n<br />[color=#ff7700]‘Inferno’ trilogy:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/44922]First part[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/61776]Second part[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/36363]Third part[/url]\n<br />3 amazing mods inspired by Dark Souls. Interesting storylinem ‘hellish’ cells, giantic and hard bosses. You’ll remember this journey for sure!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/18772]The Temple of Black Rock[/url]\n<br />An unforgettable adventure through huge nordic ruins. Another deadly dungeon for heavy leveled characters.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/75004]Skyrim Underground[/url]\n<br />One of the most amazing dungeon mod I ever played! An underground dungeon system with currently 40 large and 26 small cells. Tunnels are connecting different Skyrim cities. Also constantly updated. Amazing design, dark atmosphere, tonns of new, creepy creatures to fight and just HUGE size in total. In my opinion, this mod is absolutely must-have. If you'll be exploring it really carefully, you can even stumble upon several NPCs voiced by your humble :)\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/58004]Immersive Dungeons (Episode1)[/url]\n<br />Mod adds 7 new dungeons with great design to explore and fight.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/68179]Demonika[/url]\n<br />VERY dark. VERY creepy. Full of enemies. Dungeon mod with 12 stages. This mod may even scare someone, it’s not for everyone. But if you like such kind of creepy playthrough - try it for sure!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/33692]Solstheim Dungeon Pack[/url]\n<br />Simple, but great dungeon mod. Designed especially for Solstheim. Aadds 6 new dungeons to diversify your solstheim exploration expirience.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/75137]Isle of Ashes[/url]\n<br />Awesome and very original mod. Features: Great design. Complicated puzzles to solve and secrets to find. Different greatly designed cells, enemies and bosses. Really unique atmosphere.\n<br />It’s main feature is there are no quests or markers here. You need to find journals, you need to read, you need to think. Playthrough is very rewarding, in the meaning of exploring first of all.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/80086]Crater of Exile for Vanilla and Requiem[/url]\n<br />Another awesome mod from the same author. Hardcore difficulty and hellish-styled locations!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/69610]Moonshimmer Mine[/url]\n<br />Medium-sized dungeon mod which takes the player on an adventure through an recently abandoned mine and unearthed Dwemer ruins.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83291]Solemn Keep Chronicles - Shimmerfall Springs[/url]\n<br />[/size][/font][font=Arial][size=2]Bandits from all around Skyrim have been gathering and digging out the once abandoned caves of Shimmerfall Springs, causing local concern. Venture deep into the caves to find what they are seeking and stop the mysterious bandit leader who wields a dangerous power. Also take a look on [url=https://www.nexusmods.com/skyrim/mods/86499]patches[/url] for it.[/size][/font]\n<br />\n<br />[font=Arial][size=3][/spoiler][/size][/font]\n<br />\n<br />\n<br />[center][img]https://i.imgur.com/cD2fEQC.jpg[/img]﻿[/center][font=Arial][size=3]For these mods, you can install as many as you want, technially but if mod that you're installing is affecting leveled lists, be sure to rebuild your Bashed Patch. Also take into account that leveled lists have own limitations in size, so it's not a good idea to install 5 biggest weapon packs at the same time, because most likely you'll never see many of items ingame even with Bashed Patch. Choose one or two big weapon/armor packs and polish this by several smaller mods you like. It's literally impossible to list absolutely all great mod of this category here as there are hundreds or even thousands of such mods, so that's just mostly my personal list of mods that are either beautiful and lore-friendly, or I admire them for really unique look and/or great textures quality. Still, there are many mods here that improves or rebalances vanilla items or add new, but absolutely immersive ones.[/size][/font]\n<br />\n<br />[font=Arial][color=#ff7700][size=4][b]Armor mods:[/b][/size][/color]\n<br />\n<br />[size=3][spoiler][/size]\n<br />\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/19733]Immersive Armors[/url]﻿\n<br />The most famous, big and endorsed armor pack ever made.It adds hundreds of various armors, from simple to absolutely epic, while still keeping lore-friendly look. If you're looking for the great base of your armors variety - don't even think, install IA.[/size]\n<br />\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/20077]Tribunal Robes and Masks[/url]﻿\n<br />Amazing robes pack that in addition comes in all 3 armor types - clothing, light and heavy. Also have masks collection for even more epic look. [color=#e06666]Note:[/color] this mod is included in Immersive Armors, so if you're using IA, don't install it separetely.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/37289]Bosmer Armor Pack[/url]﻿\n<br />A lore friendly Armor pack containing 5 main sets with 29 armor pieces and 6 weapon pieces. All races and sexes supported. [color=#e06666]Note:[/color] this mod is included in Immersive Armors, so if you're using IA, don't install it separetely.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/27028]ARMONIZER Armors Pack[/url]\n<br />Very old but still very good mod that adds various unique-looking, but still fitting armors to the game.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91248]Girl's Heavy Armors[/url]\n<br />Fresh and original armor mod that changes models of female vanilla heavy armors, making them much more beautiful, but still protective/lore-friendly, keeping the great balance.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/72857]Warmth - Light Armor Replacer[/url]\n<br />This mod adds sleeves and pants to hide, studded, leather, and scaled armors. Copatible with vanilla armors retexture mods such as AMB Book of Silence.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81123]Sithis Armour and Blades[/url]﻿\n<br />Absolutely badass DB-inspired armor set. Mod also has DB armor replacer version. Supports HDT physics.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/77667]Grandmaster Ursine Armour[/url]﻿\n<br />Beauitful Witcher-inspired armor set with HDT physics support.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81151]Manticore Gear[/url]﻿\n<br />Armor set from the same author based on Witcher 3 armor.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82543]DCR - King Crusader Armor[/url]\n<br />Epic and pretty much \"nazgul-like\" armor set.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/57908]Evil Incarnate Daedric Gear - Standalone[/url]\n<br />Very unique-looking and terrifying variation of daedric gear.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/30612]Glorious Daedric Retexture[/url]﻿\n<br />Another great daedric armor retexture.\n<br />\n<br />[url=https://www.nexusmods.com/users/3373573?tab=user+files&amp;BH=2]NSK13 profile[/url]﻿\n<br />Be sure to check it for many amazingly beautiful, mostly female armors (but Daedric Reaper armor is for both genders, for example). All of these armors are definitely not lore-friendly, but if that's not scaring you - grab some of them for sure.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/18028]Silver Dragon Armor[/url]﻿\n<br />Old mod, but still one of the most epic-looking heavy armor sets ever made.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/31229]Medusa Drakul armors and Thanatos dragon[/url]﻿\n<br />Female and male absolutely epic and unique-looking armors from the same author, Zerofrost.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/38386]Contractor and Mavari Armors[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/25476]Evil MasterMind Armor[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/36497]Raven witch armor and Apex Werewolf[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/21572]Blood Witch Armor[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82282]Zerofrost Mythical Armors and Dragon[/url]﻿\n<br />The latest armor mod pack from Zerofrost and that has definitely the absoutely amazingly armors - for male, female and both genders. Nightingale Prime armor also has replacer version for vanilla nightingale set.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/50459]Warmonger Armory[/url]\n<br />New lore friendly Armors, Weapons and Clothes for both Vanilla Game and DLCs. All the added content is inspired from the classic Elder Scrolls Archetypes and is made with compatibility in mind.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/35094]Aesir Armor[/url]\n<br />One of the most brutal lore-friendly armor sets I ever seen, with dozens of customization options.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80634]Volkihar Knight - Vampire Armor[/url]\n<br />A lore-friendly and badass-looking set of heavy vampire armor. Three variations can be crafted, each with a unique effect that is applied once wearing all four pieces. [color=#e06666]Note:[/color] sad thing is it's not compatible with Sacrosant by default, so if you want to use them both give Sacrosanct bigger load order priority (but one of armor features will be disabled).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/53442]Zzjay's wardrobe[/url]\n<br />Collection of various armor and clothes mashups, also has decent amount of civil-looking ones.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81073]Apachii Divine Elegance Store[/url]\n<br />Collection of clothing, armor and various little things, both looking civil and really epic, fitting warriors as well.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/77978]Legendary Armory[/url]\n<br />Pretty unique armor mod that adds new armors, but combined only from various vanilla meshes, with really beautiful results.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/9645]Black Mage Armor[/url]\n<br />Black Mage Armor is a standalone armor mod that includes Cloth, Light, and Heavy armor sets that are all craftable, enchantable, and upgradable; all sets can be used by every race, male or female.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/24814]Ritual Armor of Boethiah[/url]\n<br />Gloomy and simply epic-looking light armor set. [color=#e06666]Note:[/color] this mod is included in Immersive Armors, so if you're using IA, don't install it separetely.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/42169]Demon Hunter Armor by Jojjo[/url]\n<br />Beautiful, epic-looking and not skimpy light armor set for females.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/77171]SC - Witch of the Wilds[/url]\n<br />Recreation of Morrigan's outfit from Dragon Age series. Femaly-only.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78567]Master of Beasts Armor[/url]\n<br />Unique-looking and incredibly detailed light armor set.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/73040]Wayfarer's Coat\n<br />[/url]Great clothing/light armor set for mages.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/77215]UNP Ranger Armor﻿[/url]\n<br />Skimpy and very rich detailed female armor, inspired by Witcher series.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/39983]DreamBurrows Regal Huntsman Armor[/url]\n<br />An Assassin's Creed Inspired Mashup.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/38053]Northgirl Armor UNP[/url]﻿\n<br />Original female armor on the edge between beauty and lore-friendliness.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89811]Thalmor Armory[/url]﻿\n<br />Adds new Thalmor equipment set in 3 variations.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/36875]Armor Of Intrigue[/url]\n<br />Light armor set.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91850]Classic Morrowind Morag Tong armor replacer[/url]﻿\n<br />If you want it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/64069]Craftable Horse Barding[/url]﻿\n<br />Yep. Armor for your horses.[/size]\n<br />\n<br />[size=3][/spoiler]\n<br />[/size]\n<br />\n<br />[color=#ff7700][size=4][b]Weapon mods:[/b][/size][/color]\n<br />\n<br />[size=3][spoiler][/size]\n<br />\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/44179]Lore Weapon Expansion[/url]﻿\n<br />My personal favourite between all big weapon packs. Varietive but not too big and with qualitative textures for each weapons without exceptions. And what is good, it's really lore-friendly.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/33292]Unique Uniques[/url]\n<br />A mod fro mprevious mod author that makes unique weapons look really unique.\n<br />\n<br />[/size][size=2][url=https://www.nexusmods.com/skyrim/mods/27644]Immersive Weapons\n<br />[/url]The biggest weapon pack ever. Enourmous variety of weapons. This may act as a subjective disadvantage - some people don't want so much (as some weapons are looking not very immersive actually), but it's all a matter of taste. Be sure to grab [url=https://www.nexusmods.com/skyrim/mods/91105]USLEEP patch[/url] for it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/21120]Heavy Armory - New Weapons[/url]\n<br />One of my favourite wepon packs as well. This mod adds nearly 100 new weapons to Skyrim. You will find all new Halberds, Spears, Glaives, Shortswords, Quarter staves, Mauls, Hatchets and Clubs. Don't forget to grab a [url=https://www.nexusmods.com/skyrim/mods/83666]DSR patch[/url] for it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81118]Royal Armory - New Artifacts[/url]﻿\n<br />A must-have mod. Adds special weapons to the most important characters in Skyrim with unique effects and appearance. This may sound very simply, but it really changes the way you will look on many quests and NPCs - because now they will be a more than worthy targets.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82171]Legendary Skyrim Crossbows[/url]﻿\n<br />Amazing mod that adds dozens of new crossbows, some bows and unique arrows/bolts to the game. Crossbows have very qualitative models.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/50528]Scoped Bows[/url]\n<br />Simple, but brilliant mod that adds scopes to all vanilla bows making them look much more epic.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/57870]The Huntsman[/url]\n<br />Unique-looking UPGRADABLE bow.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/26261]Lost LongSwords[/url]\n<br />Medium-sized swords collection in order to recreate \"long\" swords category that was present in Oblivion but cut in Skyrim.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/57467]DCR - Blade Set Reloaded[/url]\n<br />\"Dark Crusader\" weapon pack with dark and unique design.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/1002]JaySuS Swords[/url]\n<br />Old but good weapon pack that adds 53 new craftable weapons to the game.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/28545]Ghosus Weapon Pack[/url]\n<br />Adds 18 new weapons in 32 variations and a shield to the game. Craftable at the forge, steel category.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/5727]Isilmeriel LOTR Weapons Collection[/url]\n<br />Old but good weapon pack for LOTR fans.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/42280]Warrior Within Weapons[/url]\n<br />If you like WW.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89250]Crossbows of Skyrim\n<br />[/url]One more great crossbow mod.﻿\n<br />\n<br />[url=https://www.nexusmods.com/users/3165110?tab=user+files&amp;BH=1]Johnskyrim profile[/url]﻿\n<br />Check this amazing author profile for stunningly beautiful weapons mods, mostly inspired by Wolrd of Warcraft and some other games. If you don't cave much about \"lore-friendliness\", many of his mods may be a must-have for you.\n<br />\n<br />[url=https://www.nexusmods.com/users/1734939?tab=user+files&amp;BH=0]Billyro profile[/url]\n<br />Check it for DOZENS of amazing weapons mods for any taste. You may also be interested in his [url=https://www.nexusmods.com/skyrim/mods/71031]all-in-one[/url] weapon pack.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/users/8601225?tab=user+files]JRC0011 profile[/url]\n<br />For some badass weapons mods as well. Also has beautiful armor mods with HDT support.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/61818]CL's Ebony Weapon's[/url]\n<br />Amazing ebony weapons variations. Has both standalone and replacer versions.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/60001]CL's Orcish Weapon Set[/url]\n<br />Similar mod from the same author for orcish weapons.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/73433]CL's Daedric Weapon's[/url]\n<br />And daedric weapons.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87069]CL's Lord Harkon's Vampire Blade[/url]\n<br />Because the main Dawnguard antagonist deserves this.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/3104]Daedric Armor and weapon Improvement[/url]﻿\n<br />Great retexture mod for daedric items with glowing and some variations.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90291]Radzig Longsword[/url]\n<br />This standalone sword mod is maybe literally the best work on weapon meshes and textures I ever saw in my life. For real. The level of deatils is not even incredicble, it's look just impossible. Take a look yourself.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/63623]Artifacts - The Ice Blade Of The Monarch[/url]\n<br />Pack of 3 absolutely beautiful weapons (sword, dagger and staff) with a lore-friednly quest to obtain them.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/52700]Sword of the Ancient Tongues[/url]﻿\n<br />Simply one of the most beautiful swords ever made.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76595]Lanfael by Vincent Dolan and Standalone09[/url]\n<br />Beatuiful and gloriously-looking sword mod. Has both 1h and 2h versions.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/85813]Blade of Intrigue[/url]﻿\n<br />Unique, rapier-like looking sword.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82544]Lorkhan Moonlight Greatsword Reborn\n<br />[/url]A legendary sword from Dark Souls series in several unique variatins, with custom meshes and visual effects. I also strongly recommend you to check out this author's other weapon mods, mostly inspired by DS as well.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76689]Darkburned Blade﻿[/url]﻿\n<br />A really unique-looking greatsword.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/64440]Real Bows[/url]\n<br />For realism fans.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78112]Fancy Bows[/url]\n<br />Fancy. Shiny. Shoot gloriously!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/74379]'The Elianora' Master Wizards Staff[/url]\n<br />Beautiful staff with dynamically-changing visual effects on its tip.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/15389]Insanitys Celtic Katana[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/19180]Insanitys Dragonbane[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/53872]Fudou Myouou Katana and Tachi[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/74728]Lux and Noctis Katanas[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/67987]Artifacts - The Tournament of the Ten Bloods[/url]﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89431]Elven Steel Weapons[/url]\n<br />Simple as that.\n<br />\n<br />[/size][url=https://www.nexusmods.com/skyrim/mods/16991][size=2]Witchers Silver Sword[/size]\n<br />[/url]\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/92604]Blade Of The Unredeemed[/url][/size]\n<br />\n<br />[size=3][/spoiler][/size]\n<br />\n<br />[color=#ff7700][size=4][b]Both weapons and armors, new artifacts or vanilla artifacts improvements:[/b][/size][/color]\n<br />\n<br />[size=3][spoiler][/size]\n<br />\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/81036]Zim's Immersive Artifacts[/url]﻿\n<br />I'd say an essential mod. It improves and rebelances almost all unique named items in the game, finally making them worth to hunt for and keep even at high levels and not thworing them to trash insantly after you found your first dragonbone weapon or daedric armor.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82152]Thane Weapons Reborn[/url]\n<br />Similar mod from the Legacy of the Dragonborn author which is focusing on thane rewards only, making the really unique. Compatible with previous mod. You can also install the patch (look in files section) from this [url=https://www.nexusmods.com/skyrim/mods/83806]patches collection[/url] to remove the minor incompatibility.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76154]The Gifts of Akatosh[/url]\n<br />One of my most favourite weapon and armor packs. Epic, detailed and lore-friendly.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/73007]Artifacts - The Breton Paladin[/url]\n<br />Beautiful paladin armor set, including an extra helmet, sword, mace, warhammer and ring. \n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/77315]Resplendent Armor and Greatsword[/url]\n<br />One of my favourite armor/weapon mods ever made. Heavily-inspired by Arthorias from DS series and with HDT physics support. You may also be interested in this [url=https://www.nexusmods.com/skyrim/mods/90531]retexture[/url] for it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78072]Stormcloak Hero Armory[/url]﻿\n<br />A must-have mod to any stormcloak player! Insanely beauitful models and textures for shield and sword.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78566]Imperial Dragonknight Armory\n<br />[/url]A mod from the same author, for imperials - badass-looking shield and sword as well.﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/66130]Dragon Carved Armor Set[/url]\n<br />Heavy armor set + weapons, looking epic and pretty much immersive.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84409]Rogue Blade Armor[/url]\n<br />Very cool looking and original mashup of Iron and Blades armor sets.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/users/2959649?tab=user+files&amp;BH=0]Nevermind43 profile[/url]\n<br />Check it for many absolutely amazing armor/weapon sets, often inspired by ESO.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/58656]Noldor Content Pack[/url]\n<br />Beautiful armor and weapon pack with LOTR-inspired items.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/69103]Nordic Wanderer Equipment[/url]\n<br />Immersive armor and weapon pack from Billyro.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/17582]Equipment Of Eternal Shine - Elven Overhaul[/url]\n<br />A mix of elven armor set and futuristic armor + weapon.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/18940]Knight Of Thorns Armor And Spear of Thorns[/url]﻿\n<br />Great armor and weapon set from Zerofrost.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/24806]Oblivion Artifact Pack V6[/url]\n<br />Adds various unique weapons and armor pieces from The Elder Scrolls IV Oblivion into Skyrim. Such as the Escutcheon of Chorrol, The Redwave, Blackwater Blade, Draconian Madstone And many more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91039]Staff of Sheogorath (Fully Voiced)[/url]\n<br />Yep. It all mad god shining glory.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90219]Everlight - Torches of Skyrim[/url]\n<br />10 Craftable Magic Torches with unique enchantments, light colors and sounds. Get also a custom spell to summon a Cold flame Atronach, or summon it with one of these torches.\n<br />\n<br />[url=https://www.nexusmods.com/users/2931683?tab=user+files&amp;BH=1]RonnieMagnum profile[/url]\n<br />[/size]For both various qualitative weapons and armors, or sets.\n<br />\n<br />[size=3][/spoiler]\n<br />[/size]\n<br />\n<br />[center][img]https://i.imgur.com/XgM6azf.jpg[/img]﻿[/center][/font][font=Arial][size=3]Skyrim modding stage is litereally swarmed by follower mods, the vastly majority of which are really dull and simply briefly imported racemenu presets with nothing more. That's why I decided I can't skip this part and show you some really worthy follower mods - interesting, funny, badass, with own temper and/or unique look, background stories and personal questlines and so on. Using mods from this section you will be sure your companions are not only \"I'm sworn to carry your burdens\".[/size][/font]\n<br />[font=Arial][size=3]\n<br />[spoiler][/size]\n<br />\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/12933]Extensible Follower Framework[/url]﻿\n<br />First of all, grab this mod if you will ever play with followers. It's amazing and complex mod that adds many features to skan, control, equip your followers, give them much more commands, teleport to you if they are stuck or lost and much, much more. With a cool UI in addition! [color=#e06666]Note:[/color] take into account that some complex follower mods, line INIGO, for example, are not compatible with EFF. That doesn't mean your game will crash or something. They just mostly have own customized controls system, so just use it and don't try to manage them with EFF, otherwise they may act weird. [color=#e06666]Another note:[/color] EFF has [url=https://www.nexusmods.com/skyrim/mods/57046]UIExtensions[/url] included, so don't install this mod if you need it, but will use EFF. Also take a look on this little [url=https://www.nexusmods.com/skyrim/mods/62188]patches collection[/url].\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/62040]My Home is Your Home (MHiYH 2plus)[/url]\n<br />This mod will be useful as well if you like to play with many followers or just to have many of them in overall and choose different companions from time to time.\n<br />\n<br />[color=#ff7700]Good, now let's look on followers themselves.[/color]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/40960]INIGO[/url]\n<br />The one brave khajiit to rule them all. The one companion to pun them all. In my opinion, Inigo, while having not the numerically biggest amount of endorsments, is the best follower mod ever made. If you never liked to play with followers and even if you hate followes/follower mods in principle, Inigo will change that once and forever after just a couple of hours played together with him. Or maybe even after a few minutes.\n<br />Inigo is a fully voiced khajiit adventuring companion with over seven thousands lines of unique dialogue - much of it about you. He doesn't just have some \"on-call phrase\" - he reacts on everything and everyone around you. He will comment, he will sing, he will scream, he will joke and he will troll. Both you and your followers as well. Inigo is one of those mods that make you give a complete new look on the game. Also, you may be interested in [url=https://www.nexusmods.com/skyrim/mods/70035]MCM addon[/url] for him for better control and customization.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/54527]Sofia - The Funny Fully Voiced Follower[/url]\n<br />\"The infamous Sofia needs little introduction as she causes trouble across Skyrim\". And that's all about her. The very original, funny and sarcastic follower voiced by professional voice actress.\n<br />Sofia is quite an unusual follower. She is tough, witty and just a little bit boastful. She has a strong fondness for the player character but her deliberate attempts to disguise the fact just leads to very awkward conversations especially as she usually says exactly what she thinks. Sofia is a tease and loves to wind people up which doesn’t make her very popular with people. Her rebellious spirit and careless attitude often gets her in trouble. Not to mention her constant inappropriate comments which easily offend or embarrass people.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/53754]Arissa - The Wandering Rogue[/url]\n<br />Arissa is an Imperial with an independent, rebellious spirit and a gift for making expensive things disappear. She is a Skyrim companion character with over 600 lines of dialogue voiced by professional voice actress. She has own questline, touching and funny at the same time.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/26393]Vilja in Skyrim[/url]\n<br />One of the most endorsed (well deserved) follower mods as well. Greatly done from all aspects, Vilja doesn't only have her own agenda - she also has her hopes and visions, her thoughts and opinions, and a background story that she will share with you over time.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83063]M'rissi's Tails of Troubles[/url]﻿\n<br />Half-khajiit, half-juman. Meet M'rissi and decide your own role in her life. Will you be a slaver, a saviour or a lover? That's for you to decide. Fully-voiced thrilling personal questline will also give you decent amount of enjoyable hours.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80283]Acalypha - Fully voiced follower[/url]﻿\n<br />Stunningly beautiful and seductive demoness follower with AMAZING voice acting, I'd say, one of the best voice acting I ever heard in overall. With personal questline in addition. If you like her, be sure to check out other mods of this author.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/24666]Hoth[/url]﻿\n<br />Brutal warrior companion with unique voice and amazing visual customization.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78797]Xanthys - A Custom Voiced Skeleton Pyromancer Follower[/url]﻿\n<br />Xanthys is badass. But you know what? He is also skeleton! Looking as a heavy-metal band leader from the depths of hell, he has own questline, a lot of unique functions and simply amazing voice acting, making him one of the most unique followers ever existed.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81656/]Jarek - The Custom Voiced Skeleton Necromancer Follower[/url]\n<br />Another unique skeletal follower, fully-voiced as well. He can also interat with Xantys!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87934]Maxine - Zombie Follower and Adoptable[/url]﻿\n<br />Another new and absolutely unique zombie child follower with unique combat system and thrilling, sorrowful, tragic story.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/68683]Recorder - Standalone Fully Voiced Follower[/url]\n<br />Definitely not very lore-friendly looking, but a great and original fully-voiced follower with own questline and various reactions of surroundings and your actions. If you'll decide to grab her, you may be interested in her [url=https://www.nexusmods.com/skyrim/mods/69086]customizer[/url]﻿, [url=https://www.nexusmods.com/skyrim/mods/70715]visual overhaul[/url]﻿ and a [url=https://www.nexusmods.com/skyrim/mods/91769]bugfix patch[/url].\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/25360]Companion Valfar[/url]\n<br />The ultimate Stormcloak. Fully voiced, hairy, intoxicated and ever happy to bash some Elf skulls in!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/users/20911049?tab=user+files&amp;BH=0]Dividedbythe9s profile[/url]\n<br />Check out this author profile for dozens of follower mods. These follower don't have custom va or personal storylines, but each of them has really unique visuall appearance, often even transforming him/her self into something completely different.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/users/2650523?tab=user+files&amp;BH=0]Rxkx22 profile[/url]\n<br />Check out the well-known \"Bijin\" series author for several follower mods - nothing special in them in meaning of voice acting or personal quests, but same as with Bijin series, they all are really beautiful, on the edge between stunningly beautiful and realistic appearance.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87644]Kamira - A Fully Voiced Companion[/url]﻿\n<br />Beauitul (not lore-friendly/skimpy armor, but that can be changed if you don't like it) and sarcastic, fully-voiced female follower with short personal quest. Author is currently working on the update that will bring a much more longer questline.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/75832]L u n a[/url]\n<br />Not custom-voiced, but absolutely unique-looking beautiful female follower with own combat style.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/54973]TDN Followers - Necromancer Follower - Xavier[/url]\n<br />Unique-looking and casting necromancer follower. Sadly he doesn't have custom voice, but he's still badass.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/33061]Garm the Husky Companion[/url]\n<br />Great companion if you like dogs, Garm also comes with pack with additional unique features for more comfortable gameplay, scales with your level and has several options for visual appearance.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/92258]Budy wolf companion[/url]\n<br />Nothing special in meaning of gameplay features, but absolutely beautiful wolf companion mod with amazing textures work.[/size]\n<br />\n<br />[size=3][/spoiler][/size][/font]\n<br />\n<br />[center][img]https://i.imgur.com/PLXMmC6.jpg[/img]﻿[/center][font=Arial][size=3]Drastically improved and beautified vanilla player homes, new player homes, castles, estates and hideouts. Player home is absolutely a matter of taste - size, style of design, features - that's all up to you, so here I've just listed a wide \"base\" of various beautiful and qualitative mods of this type to choose from. I'll gradually expand it - so feel free to suggest :)[/size]\n<br />\n<br />[size=3][spoiler][/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/10891]Unlimited Bookshelves[/url]\n<br />First of all, grab this essential mod - it does exactly how it's named and will be very useful for you, as it's compatible with modded homes as well.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/users/3231858?tab=user+files&amp;BH=0]Elianora profile\n<br />[/url]﻿That's with no doubts a first profile you may want to look at when it comes to player homes. Elianora is a godess of player homes, simple as that. She is specializing mostly on small and cozy player homes of absolutely various styles - so in her profile you most likely will find a mod for no matter what character type you are playing as.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/14308]Riverside Lodge[/url]\n<br />Useful, beautiful, lore-friendly and with a great view on Whiterun hold. One of my favourite player home mods on Nexus.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/34834]Legend of the Eagles Nest[/url]\n<br />A fortress with amazing level of details and with everything you may need in player home, located in snowy mountains between Riverwood and Whiterun. It also contains a questline to rebuild it to proper glory.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/59558]Tel Nalta II - Telvanni Home[/url]\n<br />One of the most original player home mods ever made, but simple and lore-friendly at the same time. Similar to Hearthfire gameplay, you need to construct this glorious telvanii catle, but to tell more precise - to grow it. Besides being unique, big and having everything you need for your game, it also has various bonuses like pool, greenhouse, fish hatchery, catacombs, new NPCs and so on.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76231]Caranthir Tower Reborn[/url]\n<br />While designed for a mage character initially, this amazing magic tower can actually serve as an epic base for anyone (but ofc without magic skills at all it will be very hard to complete its questline). Yes-yes, questline. It's not just a tower - it's like a complete new world inside it. It offers features never seen before, customisation, and is more than just a player home. The tower must be restored through a Hearthfire style crafting system or you can simply purchase everything you need. This mod is also based heavily around player choice.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/37450]Aemer's Refuge[/url]\n<br />One of my personal favourites between various player home mods. A big keep located high in mountains, with a lot of unique features, but what is the most important - unlike many other (even pretty popular) player home mods, each, even the tiniest details and clutter piece in this mod is placed exactly where it should be - and while being pretty huge, this keep is looking absolutely great with each detail on its own place.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/33661]Leaf Rest[/url]\n<br />An interactive &amp; customizable home located in the town of Riverwood. It contains a full forge &amp; crafting area, along with some unique features including: an interactive gardening system, a wood burning fireplace, quick access bookshelves, business ledger trading system, &amp; more. The entrance faces towards the west, overlooking the river.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/57141]Morskom Estate[/url]\n<br />This mod is a large player home with one purpose in mind; to provide a unique home in Skyrim that you the player must build. You will have a bare old house up in Dawnstar which you purchase and rennovate. The home includes support for your family and has more than enough storage for you hoarders out there.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/38392]Jaggarsfeld[/url]\n<br />A unique little house hidden in a beautiful valley. Can be great for Hircine fans.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/54535]Dread Prison[/url]\n<br />An own PRISON as player home/base? Yes! Definitely not even close to be cozy and comfortable, but definitely the one of the most original player home mods. Take people to prison to torture them or make gladiator fights and enjoy your power. Yes, you can jail and torture Nazeem. That's a must-have.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/57489]Knights of the Garter[/url]\n<br />Amazing castle mod inspired by medieval times, with everything needed, new armors, weapons, and custom heraldry.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/54956]Northern Cardinal[/url]\n<br />Add a unique medium-sized ship named Northern Cardinal as player home/guild base with crew system and fast travel system. The mod also comes with new quests, new dock locations, new npcs, new worldspace, new dungeon, new weapon and more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/13641]The Asteria[/url]\n<br />Dwemer airship as a player home? Now you can have that :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/15878]Hunter's Cabin of Riverwood[/url]\n<br />This mod original part is its size. Small cabin with minimalistic interior design - to have a rest and eat, located near riverwood with a great view on the town.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/59231]Raven Castle[/url]\n<br />Huge (really huge), dark, ambient castle in gothic style located in its own worldspace. Will fit great any vampire/necromancer/warlock characters.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/19037]The Shrouded Lair - A Vampire Home[/url]\n<br />A castle of pocket realms in your own plane of oblivion for your vampire or any evil character and followers. Mod has simply and amazing interior design fitting the vampire character greatly. Also install this [url=https://www.nexusmods.com/skyrim/mods/83960]expansion/fix[/url] addon for it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/65502]Castle Volkihar Rebuilt[/url]\n<br />Mostly never take as player home/base by players, not it can actually be. This mod allows the player to clean up the debris and rebuild Castle Volkihar to its former glory. The North Tower is also converted into a player home with safe storage.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/63947]The Ravens Breezehome[/url]\n<br />My personal favourite Breezehome overhaul.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/users/4138425?tab=user+files&amp;BH=0]Skyrimlazz profile[/url]\n<br />Check it for dozens of beautiful player castles and palaces.\n<br />\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/87131]Nevah's Keep[/url]\n<br />Middle-to-large very detailed and unique-styled player home with a lots of storages and places to rest.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/34368]Druid's Den - Collectors Edition[/url]\n<br />This mod is a fairly large nature-themed, very \"friendly\" in design meaning player home with new custom display mechanics for collectors and treasure hunters. It's located on a mountain slope just outside Whiterun with breathtaking view of the countryside.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91810]Kynesgrove Divayth Cottage[/url]\n<br />[/size]A beautiful and neat little cottage in Kynesgrove.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91304]Ebongrove - Recall and Teleport[/url]\n<br />Player home in the volcanic Eastmarch, its flora thriving under a dwemer sun. Teleport to all the main cities, and recall anytime thanks to the previous owners' magic experiments. All usual features of a home, and a bit of Dunmer lore.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/74368]Crystal Creek Mansion[/url]﻿\n<br />Beautifully designed middle-sized mansion near Pinewatch, with unique look and some custom features in addition. You'll like the guardian for sure :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76800]Whiterun Underground Lair[/url]﻿\n<br />Want something to fit shady character? Take a look on this one for sure.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/75903]Cliffside Cottage[/url]\n<br />Exterior house in the Tamriel worldspace with space for 6 kids (optional), 2-5 followers, and displays for all unique items (also optional). Compatible with Frostfall. Clean, comfortable and \"bright\" design.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76189]Riften Fishing Shack[/url]\n<br />A small, completely exterior cabin on the lake behind the Riften Stables.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/74823]Pinecrest Estate[/url]\n<br />Multiple adoption friendly player home with no loading doors and see-through windows - watch your kids playing in the yard from inside your home! Room for 6 kids and 9 followers, all vanilla crafting stations, named storage, 23 planting soils, bookshelves and custom displays for all unique items. It's located in own worldspace, has really unique design to say at least and it has no loading screen to enter it. [color=#e06666]Note:[/color] if you liked this and 2 previous mods, don't forget to check out this author profile in general, as he has much more player home mods.\n<br />\n<br />[/font][font=Arial][size=3][/spoiler][/size][/font]\n<br />\n<br />[center]﻿[/center][center][img]https://i.imgur.com/CX7sEys.jpg[/img]﻿[/center]\n<br />[font=Arial][size=3]Combat &amp; stealth, perks &amp; spells, AI &amp; animations, creatures &amp; factions. Different overhauls and improvements - everything that affects your game variety and difficulty.[/size][/font]\n<br />[font=Arial][size=3]Before installing the rest, let's do this. Don't be afraid. Do this. Now :) Remember one main rule: [color=#e06666]NEVER[/color] overwrite XPMSE. These pack of mods will make your character movement and animations look amazing, Each movement will be much more smoother and you'll be able to add any type of custom character animation.[/size][/font]\n<br />\n<br />[color=#ff7700][center][img]https://i.imgur.com/UknSITH.jpg[/img]﻿[/center][/color]\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/11811]Fores New Idles in Skyrim - FNIS[/url]\n<br />Mod for custom animation. Absolutely must-have. Required for most of animation mods. Basic installation: - Install FNIS Behavior V6_3 - Install Creature Pack V5_3 (optional,  necessary for creature animation mods) - Install FNIS Idle Spells V5_0_1 -- ADD-ON for the spells (optional, necessary for the spells) - Good, you’ll need to do only 1 move to finish it, but it will be later.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/34950]Immersive Animations[/url]\n<br />The most popular animation mod at Nexus. Installation is simple. Just do it :)\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/68000]XP32 Maximum Skeleton Extended - XPMSE[/url]\n<br />The one and only. King of skeleton mods. Install with mod manager. Everything is simple, I also strongly recommend to NOT install anything you are not aware of. Just do the basic installation and you’ll be fine. Do NOT overwrite XPMSE after this. Never. Also, keep in mind that XPMSE now has \"Realistic Ragdolls and Force\" included, so you don't need to install it separately.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/34155]Dual Sheath Redux[/url]\n<br />Why can’t you see your left-hand weapon on you? Why can’t you have shield on back? Why can’t you see your staves on you? Think no more! Install this! Just install the mod and advised mesh packs. Then run the installed Dual Sheath Redux Patch.jar located in Data/SkyProc Patchers/Dual Sheath Redux Patch Click ‘patch’. Activate mod in Skyrim Launcher/mod manager. Use patcher each time you install new armor/weapon mod.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/64647]A Lot of Dual Sheath Redux Patches[/url]\n<br />Tonns of DSR patches for many armor/weapon mods.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/71055]FNIS PCEA2 - Player Exclusive Animations (dynamic)[/url]\n<br />With this amazing mod you can simply switch between different animations for your character via MCM menu. Also it already has several amazing animation mods included. Just install and have fun!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/77343]Realistic Animation Project - Movement[/url]\n<br />Just an amazing and super-realistic movement animation mod.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/76862]Realistic Animation Project - Idles[/url]\n<br />Idles animation mod from the same author\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87102]Finally First Person Magic Animation[/url]\n<br />A must-have animation mod as it makes first-person spellcasting more more glorious.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89708]Animated Armoury - Rapiers Pikes and Halberds with third person animations[/url]﻿\n<br />[color=#e06666]This mod is optional.[/color] This amazing mod adds new, really working animations for rapiers, pikes and halberds, as well as adding those weapons to the game.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78347]True Spear Combat - Weapons and Animations[/url]\n<br />[color=#e06666]This mod is optional.[/color] Another original and constantly improved mod that adds new animations for spears, tridents, halberds and javelins. Plus some bound spears.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/9421]Martial Arts\n<br />[/url][color=#e06666]This mod is optional.[/color] New animations for unarmed combat and jumping.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/50416]Unarmed Warfare - New Animations For Hand To Hand Combat﻿[/url]\n<br />[color=#e06666]This mod is optional.[/color] The goal of this modification is to give the player more interesting unarmed combat animations. With this modification you can combine your unarmed attacks and create better looking combat with kicks and hits. You can hit, hit and then kick and hit again. Or you can just kick, kick and kick or hitm and so on.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/60934]Dragon Animation Replace[/url]\n<br />[color=#e06666]This mod is optional.[/color] More epic standing animations for dragons.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/62928]Dual Wield Improved Animation[/url]\n<br />[color=#e06666]This mod is optional.[/color] Cool looking, smooth and still pretty realistic animation mod for attacks and moves while dual wielding.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/64510]Blocking Animation Pack[/url]\n<br />[color=#e06666]This mod is optional.[/color] From the same author.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/69240]Light Foot - Jumping Animation[/url]\n<br />[color=#e06666]This mod is optional.[/color] From the same author.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90552]Character Behaviors Enhanced[/url]\n<br />[color=#e06666]This mod is optional.[/color] Unique mod that adds previously non-existing moves and animations - attacks in midair, underwater combat and so on. It's only (and the very major) disadvantage is [color=#e06666]no compatibility with FNIS[/color], which is very crucial choice to make.[/size][/font]\n<br />\n<br />\n<br />[font=Arial][size=3][color=#e06666]Important![/color] Now go to [color=#00ffff]Data/tools/GenerateFNIS_for_Users[/color] and start [color=#00ffff]GenerateFNISforUsers.exe[/color]. Be sure to check \"skeleton arm fix\" and \"gender specific animation\" options as well as options for any other mod you have (only if you have them!).\n<br />Run it, wait a few sedonds and that's it - you did it! [color=#e06666]Note:[/color] run GenerateFNISforUsers.exe each time you have installed or removed any FNIS-related mod.\n<br />\n<br />[/spoiler][/size][/font]\n<br />\n<br />[font=Tahoma][color=#ff7700][size=4][b][center][img]https://i.imgur.com/iSXphMe.jpg[/img]﻿[/center][/b][/size][/color][/font][font=Arial][size=3]Improved and smartened vanilla creatures, hundreds of new creatures, lore-friendly and not (up to your taste), new bosses and various improvements to vanilla guilds and factions - you will find them here.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/24913]Skyrim Immersive Creatures[/url]\n<br />Huge. Amazing. Immersive. Mod addz sozens of creatures to Skyrim. New monsters, factions battles, bosses and hundreds of encounters. All these things can be easily configured in the MCM menu. A must-have mod. Also be sure to install [url=http://www.nexusmods.com/skyrim/mods/83182]THIS AWESOME BUGFIX PATCH FOR IT[/url]!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/10175]SkyTEST - Realistic Animals and Predators[/url]\n<br />Best animal overhaul mod even existed. Immersive and lore-friendly. It gives animals amazingly improved AI - so giving you amazing new expirience. Haven’t asked yourself why wolf packs never hunted the mammoth? Or why mammoth attack don’t at least knockback you or why animals are never scared by dragons? Think no more. Install and have fun :)\n<br />[url=http://www.nexusmods.com/skyrim/mods/46495]SkyTEST Integration Project[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/3829]Deadly Dragons[/url]\n<br />Most popular dragons mod at Nexus. Adds 14 new dragons and unique skills to them. Adds amazing dragon ‘assault’ system. Via MCM menu you can configure dragons stats - health, damage and much more. Must-have one. Also install this small, but amazing [url=http://www.nexusmods.com/skyrim/mods/77547]patch[/url] that fixes some bugs in mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83559]Diverse Dragons Collection 3[/url]\n<br />Amazing mod that adds 28 new beautiful dragons to game, with 7 ranks for each dragon type, 16 new breath attacks and 19 new abilities. Greatly configurable MCM menu. Compatible with all dragon mods. My personal recommendation - it’s a great addition for other dragons mods.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/65816]Chaos Dragons[/url]\n<br />Mod adds 45 new unique dragons to game. It’s similar to Deadly Dragons, but much less lore-friendly. It’s compatible with Dragon Combat Overhaul and Ultimate Dragons BUT not compatible with Deadly Dragons itself so you’ll need to choose.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83352]Dragons Dawn[/url]\n<br />Pretty underrated mod that adds over 60 new types of dragons, with new abilities and dispersed through the leveled lists.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83543]Splendor - Dragon Variants[/url]\n<br />Simply a must-have mod, no matter which your \"dragon\" mod setup is. Drastically increases the visual diversity of enemy dragons, while using only vanilla resources, ending with 784 possible combinations. Fully compatible with other dragon mods\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/31264]OBIS - Organized Bandits In Skyrim[/url]\n<br />Definitely best bandits mod. It adds amazing variety of bandits (about 2500!! in total), dozens of bandit factions. Bandits are groupped, positioned, have unique skills and improved AI. There are also optional plugins, for example, plugin that will add bandit raids around the towns and villages. My personal recommendation. Also be sure to grab this tiny [url=https://www.nexusmods.com/skyrim/mods/88225]fix[/url] for it. [color=#e06666]Note:[/color] don't use OBIS and Immersive Patrols togehter - while being 100% stable and great mods themselves, when used together, sooner or later they case a game-breaking bug when random factions start attacking you on sight with no reason. I'm personally using OBIS.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/52067]OBIS Loot[/url]\n<br />Mod adds visual overhaul for OBIS bandits - outfits, unique items and much more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81462]DIVERSE SKYRIM[/url]﻿\n<br />Why you never saw even a single orc in imperial legion forces? Or a women? Why hunters were only elves and humans? If you want to change this aspect of the game - not just randomly, but absolutely logical and lore-friendly - get this mod for sure. Adds hundreds of new NPC:s with unique appearences to the levelled lists for added variety and diversity while staying lore friendly. Be sure to rebuild your bashed patch after installing this mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82128]Open Civil War[/url]﻿\n<br />Expands the civil war by many new battles and sieges.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/54090]One With Nature - Dynamic Animals and Creatures[/url]\n<br />This awesome mod gives you ability to configure how different types of animalswill act related to character - allied, cowardly, friendly of defensive.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/76203]Beasts of Tamriel[/url]\n<br />Awesome new standalone mod that adds dozens of new creatures, mostly lore-friendly. If you’re looking for even more expansion of your creatures variety, try it!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83564]Diverse Werewolves Collection[/url]﻿\n<br />Adds variety to enemy werewolf encounters. There are now 25 werewolves and 13 werebears, each leveled at 11 possible ranks for a total of 418 new enemies.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83565]More Werewolves[/url]﻿\n<br />If you want to meet more furry enemies.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/64067]Immersive Horses[/url]\n<br />Amazing and very immersive mod that offers a big improvement to vanilla horses system. Many new horses types, improved and balanced horses abilities, dozens of management options and (finally!) mounted spell casting. It's also much more new and stable than its predecessor, \"Convinient Horses\".\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/83202]The Four Horses of the Apocalypse[/url]\n<br />Amazing mod that adds 4 \"dark\" mounts, with unique appearance and abilities, perfect for any dark type of character - necromancer, assassin etc. And for anyone else too :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/73164]Horses of Skyrim[/url]﻿\n<br />These are lore-friednly, but beautiful new horses for you to ride.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/60584]Aeonbarr - a Unique and Summonable Horse (CH-Friendly)[/url]\n<br />Adds a unique, summonable horse with extensive customization features and Convenient Horses compatibility. Also adds a new quest called \"The Blacksted Legacy\", the reward for which is the ability to summon Aeonbarr.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84702]Thieves Guild For Good Guys - Taking Care of Business Redux[/url]\n<br />Amazing mod that in my opinion is how the vanilla Thieves Guild questline should have look like. Ever wanted to join the Thieves Guild without sending people to jail or bullying people for money? Want to tell Maven off? Want Mjoll to like you without having to lie to her about the Thieves Guild? Want to be a Robin Hood type thief? Now you can!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/61123]Dark Brotherhood for Good Guys[/url]\n<br />Another amazing mod from the same author. Don't worry, it doesn't transform DB to group of pacifists - but gives you various alternative choices.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87266]Stormcloaks For Good Guys - LESS RACIST[/url]\n<br />Similar mod, from the same author - does exactly how it's named.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/54244]Save the Dark Brotherhood[/url]\n<br />Simple as that! No more scripted deaths of your comrades - their survival now depends on you. Protect your Brothers and Sisters during \"Death Incarnate\" to reap their use as followers and spouses later.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/57817]Less Tedious Thieves Guild[/url]\n<br />Was 125 job requirement for the full experience annoying you? Well, forget about that now.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/14509]Localized Thieves Guild Jobs[/url]\n<br />This mod that allows you to choose where you want to get the target for your Thieves Guild job when talking with Vex and Delvin. Plus: timed missions, more target cities and special items related to the jobs.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/77078]Opulent Thieves Guild[/url]\n<br />A lavish, gaudy overhaul of the Thieves Guild HQ and the Ragged Flagon. Occurs gradually, attached to the four stages of upgrades existing in vanilla Skyrim.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/22650]Enhanced Skyrim Factions - The Companions Guild[/url]\n<br />Amazing and imo essential mod for everyone who plan to play through this guild questline. Adds realistic requirements for progressing in questline and ranks, new dialogues, new quests and lore information.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78344]Faction Vigilant of Stendarr[/url]\n<br />Adds a joinable Vigilant of Stendarr faction to the game, with ranks and radiant quest system.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/65636]Become a Bard[/url]\n<br />Mod lets you play all of the instrumental and voiced songs included with the game or choose from dozens of new songs. Adds new radiant quests to expand the options for a bard in Skyrim.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/52340]Glorious Fort Dawnguard[/url]\n<br />Beautiful and epic overhaul of Dawnguard fortress which adds new NPCs, patrols, structures, defences and much more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/52871]Sokco's Guild Starter[/url]\n<br />Start your own guild and choose its members, motives, and location. Simple and great at the same time.\n<br />\n<br />[/size][size=3][/spoiler][/size][/font]\n<br />\n<br />[color=#ff7700][size=4][b][center][img]https://i.imgur.com/i48GeXr.jpg[/img]﻿[/center][/b][/size][/color][font=Arial][size=3]Better enemies AI and skills, improvements in hunting, sneaking, questing, cut content restoration, various options to control what's happening around you in game and much, much more.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size]\n<br />\n<br />[size=2][url=http://www.nexusmods.com/skyrim/mods/34612]Trade and Barter[/url]\n<br />Light-weight but great (and I'd say essential) trade mod that offers prices dependency from your faction status, NPC relationship with you, race, region and speech etiquette as well as some other cool features. Playing with it, you will really feel trading mechanics in game having sense.[/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/40491]Revenge Of the Enemies 2016[/url]\n<br />Absolutely amazing and must-have mod for enemies. My personal recommendation. It improves enemis AI, scales ebemies level with yours, give unique skills to each enemy type, gives them strong cooperation and so on. Also the great advantage is that it’s very-light-weight and almost scriptless.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73369]Revenge of the Enemies Patches[/url]\n<br />Contains patches for other mods that works together with ROTE. Install patches after ROTE and other mods you'll use with it and place them after these mods using LOOT.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/64690]Advanced Adversary Encounters - Ultimate Edition[/url]\n<br />Similar mod with a different approach. It focuses mostly not on unique enemies abilities and skills, but on adding more realistic resistances. Skeletons are very resistant to arrows, automatons are very resistant to sharp weapons, shock and fire spells, but weak to ice spells, and so on. Also has [url=https://www.nexusmods.com/skyrim/mods/76757]dedicated patches page[/url] - don't forget to grab the patches you need. Bad part is this mod is not compatible with previous one, so here you need to choose. I personally use ROTE as it gives insanely challenging gameplay, while a lot of resistances can be added by the next little mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/69233]Enemy Enhancer[/url]﻿\n<br />This one, yes. It has flexible MCM where you can simple adjust resistances for most of the enemy types. This mod IS compatible with ROTE and basically with absolutely everything as it's adding resistances dynamically.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/13850]DSAMG - Dragon Soul Absorb More Glorious[/url]\n<br />This mod adds many amazing animations for absorbing dragon souls. Doing this won’t be boring anymore. Also check [url=http://www.nexusmods.com/skyrim/mods/35762]DSAMG - Dragonborn Patches[/url].\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/38129]WWLMG - Word Wall Learning More Glorious[/url]\n<br />Similar mod but for the world walls learning.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/38151]Timing is Everything - Quest Delay and Timing Control[/url]\n<br />Allows you to customize the starting conditions for various quests. You can choose to delay the start of Dragonborn, Dawnguard, or Hearthfire quests, as well as other quest events. Or you can also reduce the level requirements allowing a quest to start earlier than it normally would.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/33201]Hunterborn[/url]\n<br />Awesome and immersive mod that changes the simple routine of kill-and-loot on animals. Field dressing, skinning, butchering. Many new ingredients to loot from animals.Amazing mod for hunting roleplay.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/68822]Hunterborn SkyTEST Patch[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/18866]Hunting in Skyrim - A Hunting Guild[/url]\n<br />Amazing mod for hunting roleplay. It adds hunters guild, several quests, new perks, abilities to trap animals, increased skins/pelts prices and some more features. Also it’s fully compatible with Hunterborn.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/11941]ABT - Arrows and Bolts Tweaks[/url]\n<br />Faster arrows, ability to turn on progressive/increased damage for arrows, increase/decrease amount of arrows found in enemies and sold by merchants.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/65317]Nock to Tip[/url]\n<br />Awesome archery overhaul. Spinning arrows, realistic penetration, new workbench for bows crafting, perk and animation improvements. Great compatibility with other mods. If you use perk mod overhaul, place it AFTER this mod and you’ll be fine.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/60219]Nock to Tip Compatabilty Patches[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/63671]Nock to Tip - Perkus Maximus patch[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/69033]Archery Gameplay Overhaul[/url]\n<br />Popular and amazing archery mod. It adds great amount of features: - dozens of animations. - enchanted arrows - new bow camera mod - arm fatigue - really, really many overall archery improvements that make archer/hunter gameplay more interesting and realistic. Less compatible with other mods than Nock to Tip.\n<br />[color=#e06666]Note:[/color] it requires Skyrim - Enhanced Camera or Immersive First Person View mods (see further).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/74355]Realistic AI Detection (better sneaking)\n<br />[/url]Simple but absolutely essential mod that recalibrates sneaking, making it much mroe realistic. Compatible with almost everything, including lighting mods - just read the mod description page carefully to install a proper version for your mod setup.﻿\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/48869]More Interesting Loot for Skyrim[/url]﻿\n<br />Adds more interesting loot. For real.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/37277]Stealth Kills for Followers - Standalone[/url]\n<br />Very light-weight mod that allows your followers also be able to kill enemies silently.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/56980]VioLens - A Killmove Mod[/url]\n<br />Amazing mod that gives you full control of killmoves. Chance, immunity, camera view, new advanced killmoves and so on. This works for melee, ranged and stealth killmoves. Great working and must-have mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90457]Signature Equipment[/url]\n<br />Pretty original mod that may be very useful for some players, especially in roleplay purposes. The more you use the same equipment, the more potent and valuable that equipment becomes. It's a lot like tempering, but you do it by cleaving through your enemies gradually. This allows for a favorite early game weapon to become a signature weapon that scales with your character. Maybe your character might intentionally build up the reputation of a weapon to sell it for a profit. Or maybe you like the way a weapon looks, but its damage just can't keep up. That's no longer an issue now. It's also compatible will all possible weapon mods on fly.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/14559]Smart Souls[/url]\n<br />A SKSE plugin that shows petty souls who's boss. No more petty souls in your grand soulgems, wasting them.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76606]Mystic Condenser[/url]\n<br />Tired of piles of low-level potions/poisons/soul gems cluttering up your high-level inventory? Use the Mystic Condenser to combine them into their higher level counterparts.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/52283]Serana Dialogue Edit[/url]\n<br />If you like to play through Dawnguard DLC, this mod is just essential. Serana is a character with one of the most interesting backgrounds, but dialogues with her were always a bit dull and limited. This mod goal is to fix this problem, drastically expanding hear dialogues amount and giving a lot of reactions on the events around you when travelling together (especially noticable if played through Dragonborn DLC).\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/64021]Useful Dogs[/url]\n<br />Very useful mod that allows your dog to search and bring you keys, weapons, potions, ammo and so on.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/47327]Cutting Room Floor[/url]\n<br />This mod restores a lot of  content that was created but never implemented in the original game - quests, NPCs, building and other different little things. Also check patches:\n<br />[url=http://www.nexusmods.com/skyrim/mods/75469]Cutting Room Floor - Lighting Overhaul[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/62120]Cutting Room Floor - No Snow Under the Roof[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/23906]Run For Your Lives[/url]\n<br />A small but essential mod that makes citizens in a village or city run indoors during a dragon  or a vampires attack. Combatant NPCs will not run.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/34593]Loadout[/url]﻿\n<br />Small but genius mod that allows you to store 10 unique sets of your complete outfit including weapons, spells and shouts and swap to them without interruption using hotkeys.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/57376]Multiple Floors Sandboxing[/url]\n<br />Have you ever wonder why the NPCs mostly just stay at the same floor, even though the cell has multiple floors? This little mod will encourage NPCs to climb stairs around them and explore their surroundings more.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/17491]D13 Faster GET UP STAND UP[/url]\n<br />Mod that allows you to stand up faster after ragdoll effects. It’s absolutely must-have if you’re using mods that give knockback/ragdoll effects to enemies attacks (like DCO, SkyTest etc).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/61442]GuruSR's Werewolf Transformation Meter[/url]\n<br />Ver useful for werevolf players. The bar shows how much time left until transformation will fade off.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/85540]BUVARP - Barely Used Vanilla Actors Recycle Project[/url]\n<br />This mod repurposes several barely used NPCs that just get deleted by the game, after their quests.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84924]Encounter Zones Unlocked - Dungeons don't stop leveling after the first visit[/url]﻿\n<br />Useful mod for challenging gameplay. Does exactly how it's named.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90997]Mist Flight Mod[/url]\n<br />Simple as that. With pretty cool visuals.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/28456]Attack Speed Fix[/url]\n<br />Allows attack speed effects to stack, enables attack speed debuffs, and a MCM to set your own base attack speed. Obviously, can also lead to your character being OP. Matter of taste, ofc :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/88347]Equip Best Ammo (SKSE)\n<br />[/url]Simple as that and very useful.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83347]Suit Up[/url]\n<br />Tiny but pretty genius mod. Automatically equip clothes and armor on your character or other NPCs based on various configurable conditions about your surroundings and current activity.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/88000]Which quest's item - Show quest item owner (SKSE)﻿[/url]﻿\n<br />Shows the quest that owns quest items when you try to drop or store them.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87635]To Your Face - Sensible NPC commenting[/url]﻿\n<br />NPCs will not speak greetings towards the Dragonborn's back. Mod is SKSE plugin so it doesn't occupy .esp slot.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/73001]Sleep To Gain Experience[/url]\n<br />Any skill experience you gain is saved and later added after you've slept in-game.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/37358]Ultimate Spinning Arrows[/url]﻿\n<br />The see me spinnin'. They hatin'. Also grab this essential [url=https://www.nexusmods.com/skyrim/mods/48025]patch[/url] for it.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/55474]Jaxonz Lights Please[/url]\n<br />Simple but great mod that allows you to cast light spell instantly using a hotkey.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83175]Individualized Shout Cooldowns(SKSE Plugin)[/url]\n<br />You can change cooldown of any shout now for your ingame purposes. Can be pretty OP though, if used too wide.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/4020]Move it Dammit for NPC Companions and Followers[/url]\n<br />To avoid these annoying stucked-in-door issues.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/27189]Shortcuts - Secret Entrances For All Cities Plus Thieves Guild[/url]\n<br />Old but still good mod that adds many really cool secret entrances. May have compatibility issues with mods that modify towns/cities.\n<br />\n<br />[/size][size=3][/spoiler][/size][/font]\n<br />\n<br />\n<br />[size=4][center][img]https://i.imgur.com/Taxajlc.jpg[/img]﻿[/center][/size][font=Arial][size=3]New spells, shouts and improved vanilal ones, immersive magic additions, rebalances and changes, enchantments and much more.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/16225]Apocalypse - Magic of Skyrim[/url]\n<br />The biggest and greatest spells mod in history. While adding 155 new spells it’s still really well balanced and immersive. Absolutely any player will find something useful here - just for damage or for the immersive roleplay. It’s also very compatible with other magic/perk mods. You may use or not use another mods with it but  you just must use this one :) One of my two most favourite spellpacks for Skyrim.\n<br />[url=http://www.nexusmods.com/skyrim/mods/65527]More Apocalypse - An expansion for Apocalypse - Magic of Skyrim[/url]\n<br />Additional spell package for Apocalypse. It may contain unbalanced spells so it’s up to you - use it or not.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/60796]Lost Grimoire of Skyrim[/url]﻿\n<br />My second favourite spell mod between all existing spell mods at all. It's even hard to say that I like Apocalypse or this one more - this mod is as well a true masterpiece with more then 120 mostly really greatly balanced spells for al lmagic schools and all playstyles, drastcically increasing the amount of playstyles you can make as wel. If you want my personal opinion - install it for sure.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/35339]Forgotten Magic Redone[/url]\n<br />Mod add 39 new spells. Key feature is it allos adds 10 improvements for each of them, so 390 improvements in total.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/53780]Spectraverse - Magic of the Magna-Ge[/url]\n<br />Mod adds interesting questline during which you can obtain 42 new destruction spells. Questline is based on TES lore, it has 5 voiced NPCs, 6 locations and 6 quests.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/56037]Dwemertech - Magic of the Dwarves[/url]\n<br />Similar to previous mod, but this one is related with dwemer lore. - 42 new Alteration, Destruction and Restoration spells. - 14 bionic upgrades - Interesting queslite with voiced NPCs.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/31485]Wrath of Nature - The Path of the Druid[/url]\n<br />Immersive mod that adds series of trials. After finishing each of trials you can obtain a new druid form - frost, fire, eatch or nature. Each one has different unique abilities. Awesome mod for druid roleplay. Also check this [url=http://www.nexusmods.com/skyrim/mods/57906]typo patch[/url].\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/39928]Wrath of Nature - The Champion of Kynareth[/url]\n<br />Sequel of the previous mod with additional questline and 4 new transformation forms. If you liked ‘Path of Druid’ - try it for sure.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/69574]Coldharbour Resummoned[/url]\n<br />This mod that allows yo uto obtain new ‘cold’ spells, custom armors and of course to summon new types of draemoras. Great mod for Conjuration mage playthrough.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/77509]Shadow Spell Package[/url]\n<br />This mod adds \"shadow\" themed destruction/illusion spells and perks to Skyrim. These spells are based around drains, damage-over-time and debuff effects. Great mod for ‘dark’ mage playthrough. Compatibility patches for almost all known perks/spells mods are at mod page in files section.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/72910]Dawnguard Arsenal[/url]\n<br />Amazing mod for all who like Dawnguard and paladin/vampire hunter playthrough style. Mod adds new armors and weapons, new sun spells and also improves existing dawnguard sun spells.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/69474]Elemental Destruction Magic[/url]\n<br />Awesome mod that adds 30 new spells related with different element. Another mod feature is that different types of enemies are weaker/stronger to different elements. This can bring additional immersion to your mage playthrough. Also check this [url=http://www.nexusmods.com/skyrim/mods/74485]patch for Ordinator[/url].\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/77397]Skysunder Metamagics[/url]\n<br />Awesome mod that adds unique spell mechanics and improvements. Spell chargning, magic impacts, blinks, spell sharing, improved spell explosions and a few more features.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/5898]Phenderix Magic Evolved[/url]﻿\n<br />Maybe the biggest spell pack ever existed. Adds just enormous amount of new spells. The flaw is some spells are really overpowered. But, you can just not use them.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/92058]Dragon Age Spells Redux[/url]﻿\n<br />Pretty unique mod that adds 21 new spells from Dragons Age games with powerful effects and beautiful visuals. But the main feature is that spells now have cooldown, similar to Dragon Age series. So keep that in mind when installing the mod :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90834]Ace Blood Magic[/url]﻿\n<br />Unique mod that adds a real blood magic spells to your game - this spells cost your HEALTH to cast. Basically, an anti-vampire spell mod.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83842]Ace Active Necromancy[/url]﻿\n<br />Lightweight and useful mod that improves necromancy aspects by adding several specialized spells.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81600]Spellsword[/url]﻿\n<br />Sword or magic, why to choose? Install this mod and be able to launch prepared spells with weapon swings. Note: Ordinator has several spellsword perks and one of the perks is making almost literally the same, so if you're running Ordinator - you don't need this one for playing as spellsword character.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/63246]Awakened Magicka[/url]﻿\n<br />Simple but effective magic overhaul. [color=#e06666]Note:[/color] you don't need need if you're planning to use big overhauls like Ordinator.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/81214]Spell Research[/url]\n<br />Maybe the most interesting and unique mod of that type, and absolutely original. Adds a completely new system to research and discover spells from any supported spell mod. As well as adding an in-built spell tome and scroll crafting system, a Victorian-Era style alchemy system, where you can decompose items, and mix or analyze the resultant solutions, and expands the lore of magic with dozens of texts and artifacts to find. In this mod, spells are not simple mixtures of cantrips or effects, but each spell is a completely unique piece of art, and each mage casts each spell slightly differently. Instead of studying what spells are 'made' of, you study how to manipulate and invoke magic. This system is told in terms of [i]Archetypes[/i], the elements and techniques you need to understand in order to cast spells. You can discover and study these elements and techniques through several ways. You can spend several in-game days studying your own spells in a comfortable tower. You can decompose and analyze the tons of ingredients you have stored. Or you can go out to find and study ancient text, tomes, and artifacts.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80405]Better Spell Learning[/url]\n<br />Makes learning spells from tomes actually take time, ideally increasing your immersion. Compatible and recommended to be used together with Spell Research. You also may be interested in Lost Grimoire and Elemental Destruction Magic [url=https://www.nexusmods.com/skyrim/mods/86767]patches[/url] for it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87495]Spell learning and discovery[/url]﻿\n<br />Lightweight and configurable mod that prevens player form learning spells instantly, making player to study them by spending some ingame time. Mod also has other cool features like increased chances to learn spells the mor spells you casted, chances of learning about new spell when talking to mages and so on. compatible with spell mods. Use it as a more simpel alternative to Spell Research+Better Spell Learning combo.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/73094]Worlds Dawn - Enchanted loot and RPG attributes in Skyrim[/url]\n<br />Mod adds 124 armor and 48 weapons ehnchantments that are conceived to be more close to ‘old-school’ RPGs.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80918]Summermyst - Enchantments of Skyrim[/url]\n<br />Amazing mod from the author of Apocalypse spell package. It adds 120 new enchantments to the game, accessible through thousands of new enchanted items that are integrated seamlessly into loot lists and inventories. It also fixes many bugs related to vanilla enchantments. Amazing mod to increase your enchanting and overall game expirience. You may be also interested in this [url=https://www.nexusmods.com/skyrim/mods/83142]patch[/url] for it.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/41376]Thunderchild - Epic Shouts and Immersion[/url]\n<br />This mod adds 29 new shouts and new abilities to improve your shouts. It also adds 24 new variants of graybeards robes, some new weapons and items and good configurable MCM menu. If you were bored with vanilla shouts variety - this mod is definitely for you.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/17010]Dragonborn Ascendant[/url]\n<br />Awesome and criminally underrated mod. It’s main feature is boost to shouts cooldown per dragon killed (3% per 5 dragons, capped at 30%) Mod also balances and improves many shouts values and scales battle shouts damage each 10 levels. Don't use together with previous mod, choose one or another.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90786]VOID[/url]\n<br />9 new Dishonored-based powers. Obviously, mostly overpowered. Use with caution :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82441]Sleep Spells[/url]\n<br />Adds three new spells to the game that cause NPCs to lie down and fall asleep where they stand.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/14947]Teleportation Spell with Menu and Mark and Recall with Menu[/url]\n<br />Simple and very useful mod for more \"magical\" way \n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87944]Speed Casting - Changed spell charge times[/url]\n<br />Makes spellcasting (charging) faster. Can make you pretty overpowered, so use with caution. Mod is SKSE plugin so it doesn't occupy .esp slot.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/49983]Elemental Arrows[/url]\n<br />A lot of them. This said, may of these arrows can make you pretty OP, especially when playing with perk overhauls, so use with caution.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/62418]Alterion Wards[/url]\n<br />Simple as that. If you don't want to mess with Restoration for wards.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76988]Fast Cast - realistic auto casting hotkeys[/url]\n<br />A great utility mod adding 24 new hotkeys (keyboard and controller seperately) allowing you to equip, use and unequip a spell / shout / power / scroll / staff using any key (remappable).\n<br />\n<br />[/size][size=3][/spoiler][/size][/font]\n<br />\n<br />\n<br />[color=#ff7700][center][img]https://i.imgur.com/bXjiOR0.jpg[/img]﻿[/center][/color][font=Arial][size=3]Various amazing mods that can be classified as \"overhauls\" - a complex rework of some important game aspect, often with a lot of new cool features added.[/size][/font]\n<br />\n<br />[size=3][spoiler][/size]\n<br />\n<br />[font=Arial][size=2][url=https://www.nexusmods.com/skyrim/mods/89219]Andromeda - Unique Standing Stones of Skyrim[/url]\n<br />Mod replaces the default standing stone effects with tactical and interesting new powers and abilities. Each standing stone comes with one passive ability and one active power. While greatly increasing standing stones effects variety, mod is still balanced and great for immersive playthrough.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/68425]Ordinator - Perks of Skyrim[/url]\n<br />Perk overhaul mod that offers more then 400 perks to improve your game expirience \n<br />and class bulding. Mod is constantly updated - mod author improves existing and fixes bugged/opverpowered perks. To tell this is a great perk overhaul - means to tell nothing. It’s rich, brilliant and absolutely perfect for both casual roleplay. To make sure just visit mod page and read a few perks description. In addition to this it’s extremely light-weight compared to other perk overhaul mods and also greatly compatible with everything. If it’s your first try of perk overhauls - try it and you’ll enjoy it. If you’re using another similar mod - switch to Ordinator and you won’t go back. Perk overhauls are absolutely matter of taste, but this one’s quality is amazing. ‘How much did Enai Siaion pay you?’ - you may ask. I would also ask this, yes. Until I try this amazing mod. Even if you open comments section and see what people often write, you’ll see that many players switched from other perk overhauls and don’t want to go back. Of course, it’s only my personal opinion, but statistics don’t lie and one thing you definitely need to do is to try it :)\n<br />Patches:\n<br />[url=http://www.nexusmods.com/skyrim/mods/70272]CACO-Ordinatored[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/68587]Path of Sorcery - Magic Perk Overhaul[/url]\n<br />Fresh, constantly updated and just awesome magic per overhaul. It affects Alteration, Conjuration, Destruction, Enchanting, Illusion, and Restoration trees. The one disadvantage is it’s incompatible with some big and well-known perk overhauls, like SkyRE/Requiem/SPERG. But as it is developed only for mage perk trees and you play as mage you can simply choose to use this mod only. Also it’s compatible with Ordinator, so you can use both of them - just load this mod after Ordinator. To choose perk overhaul it’s absolutely matter of taste - so you are free to try them all anyway :)\n<br />Patches:\n<br />[url=http://www.nexusmods.com/skyrim/mods/74518]Path of Sorcery Assorted Patches[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73850]Path of Sorcery - Elemental Destruction Magic Patch[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/59849]T3nd0's Perkus Maximus[/url]\n<br />Amazingly thought-out perk overhaul mod. It completely overhauls all perk trees and give you great gameplay expirience improvement while being very immersive. This mod disadvantage is it’s size, installation process (for novices) and it also requires really many patches to work properly if you have big mod list. Also be sure to check this awesome [url=http://www.nexusmods.com/skyrim/mods/59257]patcher[/url].\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/19281]Requiem - The Roleplaying Overhaul[/url]\n<br />Requiem is a complete overhaul  for each piece of Skyrim - combat, magic, items and much more. Its main feature is ‘de-leveled’ world, like in classic RPGs. That means if you’ll go at some area at lvl 1 you’ll have zero chances to survive. If you like this idea - this overhaul is definitely for you. The disadvantage of de-leveled world is that game is most challenging at low lvls but still became boring at high lvls. Also many of mod parts are pretty outdated now compared to similar sdatndalon mods which you can combine. This choise is totally up to you :)\n<br />[color=#ff7700]Additional patches/improvement mods list:\n<br />[url=http://www.nexusmods.com/skyrim/mods/83146]Dark Souls Style Combat for Requiem[/url]\n<br />[/color]Light-weight, but just a great mod with A LOT of improvements to Requiem combat system. Without scripts :)\n<br />[url=http://www.nexusmods.com/skyrim/mods/61621]Requiem 2.0 Patch Central[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/61520]KFR - Kryptopyr's Fixes Reqtified (WAFR-CCF-Requiem)[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/91728]Requiem 1.9.4 and 2.0.1 - Mihailmods patches[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/90764]DarkShen's Requiem II - Patches[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/90561]Summermyst - Requiem Patch[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/61569]COR - Crafting Overhaul Reqtified[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/36849]Immersive College of Winterhold[/url]﻿\n<br />This mod a must-have. Yes, even if you're playing not as pure mage. You still will go through College questline sooner or later, and you still will be visiting it from time to time. This mod is just enormous in it's College overhaul aspect. Aesthetical visual overhaul of structures and building, new buildings, new cells, new dungeon, greatly improved College NPCs AI, new NPCs, imemrsive magic learning expirience, new dungeon, quest and dozens of other tiny details.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/66105]MorrowLoot Ultimate[/url]﻿\n<br />In-depth and, in my opinion, simply essential mod. It makes a complete rebalances of various game aspects, making it to play more similar to Morrowind leveled lists and leveling system - rare items like daedric or dwarven are REALLY rare now so you will not see each 2nd bandit in daedric gear when you'll reach lvl 80, enemies level scaling is much more balanced and challenging, and so on - many other mechanics such as leveling and alchemy were changed as well. [color=#e06666]Note:[/color] this is also the only \"flaw\" of this mod - it's too complex and will have compatibility issues with similar mods. That's why I'm personally using the \"simplified\" version of it, look below.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76753]MUS - Morrowloot Ultimate Simplified[/url]﻿\n<br />This version only rebalances rare items, loot and quest rewards - which is making it a perfect solution in terms of compatibility and still keeping the main feature of the mod. You may also be interested in patches for [url=https://www.nexusmods.com/skyrim/mods/87376]Summermyst[/url], [url=https://www.nexusmods.com/skyrim/mods/87405]Zim's Immersive Artifacts[/url] and [url=https://www.nexusmods.com/skyrim/mods/91189]Royal Armory[/url] (works with original mod too).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/59463]Moonlight Tales - Werewolf and Werebear Overhaul Essentials[/url]\n<br />Awesome overhaul for werewolves. Mod adds wide skins system, playable werebears,werebeast followers, different types of transformation, and werebeast/werebeast hunters encounter events.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/22611]Bloodmoon Rising[/url]\n<br />This is great werewolf mod that overhauls werewolf perks and stats. If you like to play as werewolf you should know that werewolf became wery weak versus high lelel enemies. Mod helps with this.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90263]Lupine - Werewolf Perk Expansion[/url]﻿\n<br />Tired of Bloodmoon Rising? Try this one! A new and absolutely badass werefolf perk overhaul which introduces absolutely new unique features, like two possible werevolf paths, completely new howls, looting as werevolf, werevolf armor etc.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/9717]Better Vampires[/url]\n<br />One of two greatest vampire mods evern made. Mod gives a wide overhaul for vampires. Perks and skills improvements, new skills, expanded system of vampire needs, blood storage system and much more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80159]Sacrosanct - Vampires of Skyrim[/url]\n<br />The second of the two greatest vampire mods and my personal favourite. Sacrosanct overhauls vampires and vampire lords. Reverse progression (stronger when fed), new abilities, powers, perks, hemomancy, various new progression systems, personal vampire questline and many gameplay tweaks for the discerning undead monster. It's main advantage over is while being absolutely revolutionary and all-embracing, it's very lightweight at the same time, and very easy to get used to all new features. [color=#e06666]Note:[/color] do not use both Sacrosacnt and Better Vampires. Choose one. Tehnically, they can be used together (patch available on BV page), but in this case many of Sacrosanct major features will be cut off.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/41634]DVA Dynamic Vampire Appearance[/url]\n<br />Dynamically changes the appearance of vampires to visually represent the different stages of vampirism. Compatible with previous 2 vampire overhauls.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/37658]True Hybrid - Tainted Blood of the Dragonborn - Werewolf and Vampire Hybrid[/url]﻿\n<br />Be both werewolf and vampire whilst using your favourite associated mods. Compatible with most vampire &amp; werewolf mods and also supports Undeath mod.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/18436]ASIS[/url]\n<br />Asis is a must-have mod for interesting and challenging playthrough. Its main feature is increased spawns, but it also offers tonns of other features. I personally advise to use ASIS only for 3 features: perks and spells distribution to NPC and NPC potion usage. With this you can have an amazing game where all new spells/perks from mod could be used by NPCs as well as potions. It’s AI option is pretty old and i don’t recommend to use it because modern combat mods have better AI improvements. Also it’s not needed to use its increased spawn features as game can became hard as hell (imagine 5 modded dragons with new spells and AI or 50 bandits with modded perks/skills). So once again, I recommend to use ASIS with 3 features: perks, spells &amp; potions. But of course it’s up to you :) Also, don’t forget to run ASIS patcher each time you installed mod that adds spells/perks.\n<br />[url=http://www.nexusmods.com/skyrim/mods/53047]ASIS Improved INI Files[/url]\n<br />Improved ASIS .ini files configured for proper use with most of popular mods. Be sure to install it - it's brilliant.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/61218]Imperious - Races of Skyrim[/url]\n<br />Awesome mod that overhauls Skyrim races abilities. Now each race has 3 passive abilities and ultimate active ability that can be unlocked through race quest. That also bring more immersion to playthrough. New races abilities are interesting and fit perfectly with each race.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/28418]Stealth Skills Rebalanced[/url]\n<br />Great mod that offers serious overhaul for stealth gameplay. Detection was reworked for more realistic stealth expirience. Fixes of vanilla stealth bugs and Stealth perk trees overhaul. It also has ‘perkless’ version for compatibility with other perk overhaul mods.\n<br />\n<br />[color=#ff7700]Dragon Combat Overhaul[/color]\n<br />Great mod that offers amazing overhaul for dragons. Dragon are DRAGON now - powerful, frightening monsters. AI improvements, unique skills and shouts and realistic physics. You’re fighting dragon, not a buttefly! If dragon lands close to you or makes a powerful tail/wing strike and you din’t block this - you’ll be ragdolled. Dragons also can grab other NPCs and just throw them in air and many more other immersive features. If you want to have a real challenge fighting dragons - this mod is for you! I'd say even more simply - this mod is absolutely essential, because no matter how beefy your dragons will be empowered by other mods, this still makes not much sense if they still have stupid vanilla AI and no realistic physics. This mod only disadvantage is you can' find it on Nexus as mod author deleted all his mods here. But you can try some luck elsewhere.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/55206]Ultimate Dragons[/url]\n<br />Another awesome dragon mod. It adds 20 new attacks for dragons, improves their AI and offers location damage for different parts of dragon body. Also dragon can enrage at low HP, becoming much more dangerous. It’s also compatible with most of other dragon mods.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/69306]Complete Alchemy and Cooking Overhaul[/url]\n<br />Amazing mod that completely overhauls Alchemy and Cooking. Alchemy has a great potential in Skyrim, but at the same time it was the most boring profession. And now CACO saves the day! Besides awesome overhauls mod even offers you to craft alchemical bombs as well as waxes, salves and bandages. You can also use field alchemy stuff to make potions &amp; poisons anywhere you want. CACO also offfers basic needs and even inebriation effects. It has MCM menu and most of new features can be configured and turned off if you don’t need them.\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70430]Extra CACO Compatibility Patches[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/72849]More Patches for CACO[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/47521]Dynamic Potions - Poisons - Ingredients - Food[/url]\n<br />Freedom to customize the duration &amp; strength of potions, poisons, food, and ingredients any way you like them, through a convenient MCM menu. You can also change the price &amp; weight of items, stackability of effects, and other unique settings, which is greatly increasing usability of all potions, potions and food in the game. Compatible with most of the mods and with CACO as well.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84872]Poisoning Extended[/url]\n<br />A simple but revolutionary mod that allows you to poison your weapons multiple times to not make this annoying \"menu-poison-back to game\" action after each swing or shot and to actually see which exactly poison is applied and how many stacks left via cozy UI.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89947]Experience[/url]\n<br />A complete overhaul to expirience system in Skyrim transforming it to classic RPG style. Compatible with mods as well. Gain expirience by completing quests, exploring wilderness, clearning dungeons and forts, killing enemies and so on.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/43773]Audio Overhaul for Skyrim 2[/url]\n<br />Amazing sound overhaul mod aiming to make Skyrim's soundscape more immersive, clear, responsive, impactful, while also aiming for maximum compatibility, performance and coherency with the original game. Ambience, weapons, magic, movement, \n<br />reverb system, sound propagation, creatures and the overall mix are key areas of change. Once you try it you most likely won’t go back to vanilla sounds anymore.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/73838]Lucidity Sound FX[/url]﻿\n<br />Amazing medium-sized sound mod of that, in by the way, can be used together with AOS2. Just install it after.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/54387]Immersive Sounds - Compendium[/url]﻿\n<br />Another complete overhaul for Skyrim sounds similar to AOS2. Can be also used alongside with minor overlaps.\n<br />\n<br />[color=#ff7700]Further mods can't be actually called \"overhauls\", but I keptm them here to not separate from other sound mods :)[/color]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/92587]Swords and Magic - Music Overhaul[/url] [color=#ff0000]==NEW==\n<br />[/color]Freshly released, constantly updated and simply amazing music overhaul for Skyrim which changes most of Skyrim tracks - combat, taverns, exploration, lvl-up and much more. You probably will hear a lot on GOT, Witcher and some other titles inspiration in it. Try it for sure!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89936]Dark Mode - Intense Combat Music - Sound[/url]﻿\n<br />If you want your combat to be more sound-badass.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/12053]Dragon Real Shout[/url]\n<br />Allows you to actually hear the words of power in dragon shouts.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78157]Immersive Dragon Sounds -iDS-[/url]﻿\n<br />Amazing overhaul for all dragons soudns making them REALLY scary and furious.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78517]Bow Before The Dead - Draugr Sounds Legacy Edition -[/url]﻿\n<br />Mod from the same author, for draugrs.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/78572]Falmer Sounds - the Betrayal Edition -[/url]﻿\n<br />Mod from the same author, for falmers.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91889]illy's High Quality Fire Audio[/url]﻿\n<br />Does exactly hwo it's called. Install and overwrite if asked. Best fire sounds ever made!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/55320]8-bit Skyrim Theme Music[/url]﻿\n<br />I was not able to NOT put it here, haha.\n<br />\n<br />[/size][/font][size=3][/spoiler][/size]\n<br />\n<br />\n<br />[color=#ff7700][center][img]https://i.imgur.com/l6HxmUt.jpg[/img]﻿[/center][/color][font=Arial][size=3]Everything about combat - better enemies AI and new skills, injuries, locational damage, unique player moves and overall combat improvements here and there to make dull Skyrim combat shine.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/56147]Combat Evolved[/url]\n<br />Light-weight, script-free and just amazing combat mod. Due to its great compatibility it just should be used alongside with other combat mods for even better combat expirience. Enemies are more agressive and smarter. Stagger, knockdown, enemy skills, and enemy damage are enhanced. But at the same time enemies are not ‘terminators’ - mod is good balanced. I strongly recommend to use it. I also advise to use modular version for more detailed installation process.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/36006]Ultimate Combat[/url]\n<br />Amazing combat mod that brings you totally new combat expirience. Enemies AI isnow better, they can cooperate, parry, dodge, counter \n<br />your attacks as well as having unique special spells and abilities. Mod modifies many combat stats for more realistic combat. Mod also adds timed block feature, stamina cost for regular attacks, headshots for archers (can be configured in MCM menu) and some even more things. Try it for sure!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/29137]TK Combat[/url]\n<br />Awesome mod that adds possibility to use series of special moves and attacks that consumes your Magicka. It’s a great mod for pure warriors playthrough who almost don’t use Magicka. It may look not very lore-friendly to someone, but it’s up to you - use it or not.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/23681]TK HitStop[/url]\n<br />This is a great mod for combat immersion. Ever asked yourself why weapon weights nothing? Why your character doesn’t feel any physics after swinging two-handed battleaxe? Then this mod is for you. When the player hits an actor or an object, a “hit-stop” (a tiny pause) is added along with camera shake and blur effects. This makes weapon strikes feel more solid and heightens the sense that a hit has actually been made.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/32769]TK Recoil[/url]\n<br />This mod is similar to previous one, just for the bows/crossbows. When the player shot a bow or crossbow or staff, a \"recoil\" (a tiny pause) is added along with camera shake and blur effects. This makes weapon recoil feel more solid and heightens the sense that a hit has actually been made. Mod also comes with an MCM menu.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/20923]TK Dodge[/url]\n<br />Very popular and must-have mod if you’re running several combat mods that increase game difficulty. Mod adds dodge rolls (forward-back-left-right) using hotkeys. Mod also has an MCM menu where you can re-configure the hotkeys and dodge roll stamina cost.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/75214]Lock-On - lock on mechanism[/url]\n<br />Simple mod that gives you \"lock-on\" feature (like in Dark Souls and many more RPG series) to increase your combat speed and accuracy. I personally think this mod is making your character pretty OP, but that's still a matter of taste.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/71666]Weapon Parry Standalone[/url]\n<br />Simply attack at the same time to block an enemy's attack with your attack! That's it!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/73921]Mortal Enemies - De-aimbot Your Foes[/url]\n<br />Remember how NPCs can turn to your direction just in the middle of weapon swing? Forget about this!\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/70079]Attack Commitment No turning during attacks\n<br />[/url]Amazing and immersive combat mod. If you're tired of NPCs auto-aiming (so it's almost impossible to dodge their attacks) and think that it's no realistic - install this mod for sure. But note that it also disables this for your character as well ;)\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/76529]Wildcat - Combat of Skyrim[/url]\n<br />New combat mod from the author of Apocalypse/Ordinator. This amazing mod makes combat more realistic, dynamic and brings more lethality into your game. Mod ipmroves combat AI that makes enemies more smart, initiative and dangerous. It’s biggest and greatest (in my opinion) feature is wide injures system. It’s really realistic and simple at the same time. It also modifies global difficulty levels in Skyrim and gives you possibility to configure these values in MCM menu. It also offers timed block feature as well as many other combat modifiers. It’s also pretty good compatible with all combat/magic/ perk overhaul mods and mod author also inlcuded detailed load order description list for this/that mod. Wildcat is pretty much similar to Vigor so basically you’ll need to choose between them, but of course with some efforts and a few time of customizing their MCM menus you can use them both. I personally prefer Wildcat as it’s more intuitive for me, but it’s up to you of course :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/74617]Wounds[/url]﻿\n<br />Simple mod focused exactly on injuries. More realistic/hard to heal comparing to Wildcat's injuries system (you should not use them both or disable WC injuries if you want this one, otherwise it will become messy).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90897]Critical Hit - Backstab and Parry in Skyrim[/url]﻿\n<br />Little, but jstu a badass mod that adds DS-like backstab and parry to the game. Absolutely stable and without cloak scripts! Moreover, all damage multipliers can be adjusted in MCM.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91505]Locational Damage(SKSE Plugin)[/url]﻿\n<br />Actually working, light-weight and finally really STABLE locational damage mod for Skyrim. Full configurable in .INI file. When using with combat mods like Ultimate Combat or Wildcat, either disable locational damage in UC and/or injuries in WC, or set this mod effect chances to very low - otherwise you'll be very OP.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80076]Realistic Melee Range[/url]\n<br />Simple as that. Decreases hit range for all melee weapons to be more realistic.\n<br />\n<br />[/size][size=3][/spoiler][/size][/font]\n<br />\n<br />\n<br />[size=4][center][img]https://i.imgur.com/rsqpBFe.jpg[/img]﻿[/center][/size][font=Arial][size=3]Please remember: big amount of population mods may overload your game and cause instability and FPS drops. To avoid this - install population mods one by one and check your performance ingame, testing affected areas like cities, forts or faction battles.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/12977]Immersive Patrols[/url]\n<br />One of the most popular mods at Nexus. And it absolutely deserved this. Mod adds really immersive patrols of almost every major faction across \n<br />all DLCs, including Stormcloaks, Thalmor, Imperials, Dawnguard, Travelers, Merchants, Bandits, Skaal, Redoran, Reavers and Rieklings. You will see small and bigger faction battles and even for sieges in absolutely each region of Skyrim! It’s also don’t use scripts - so you can install and uninstall it anytime without any worries and it’s pretty good compatible with almost everything. Note: there’s only 1 issue that can possibly happen when using this mod alongside with OBIS - some players reported that any faction can become agressive to the player. That can harm your playthrough so if you want not to worry for sure - make different saves from time to time or choose only one from this amazing mods. [color=#e06666]Note:[/color] don't use OBIS and Immersive Patrols togehter - while being 100% stable and great mods themselves, when used together, sooner or later they case a game-breaking bug when random factions start attacking you on sight with no reason. I'm personally using OBIS.\n<br />\n<br />[font=Arial][size=2][url=https://www.nexusmods.com/skyrim/mods/36334]Inconsequential NPCs[/url]\n<br />This mod is something game should have from teh day one - it's simply essential. It's adding various NPCs here and there in Skyrim, greatly fitting the city/town/region - you will never even think these NPCs are from the mod as they are acting absolutely seamlessly.\n<br />Carriages now finally have guards, there are skooma dealers and flower girls in Riften, much more mercenaries, college studends, tavern patrons, workers, towncriers and much more. This mod also plays great in pair with the next one. You may be also interested in [url=https://www.nexusmods.com/skyrim/mods/55668?tab=files]RS Children patch[/url] for it (look for it in files section, close to the end).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/8429]Interesting NPCs[/url][/size][/font]\n<br />The biggest NPC mod ever made, an absolute titan between all of them. While Inconsequential NPCs is focusing on \"no noticable\" immersive NPC addition to \"fill\" the gaps in game, Interesting NPCs adds characters with own stories, often with questlines and all are fully-voiced. Over 250+ fully voiced NPCs, 25+ followers, 15+ marriage NPCs, and 50+ quests. 3DNPC is like a game inside a game in meaning of size. The dialogue choices allow you to role-play, providing humor and depth to each conversation. You can be a jerk or a jester, a white knight or an assassin, as the most important character is you. [color=#e06666]Note:[/color] while the mod itself is stable, you should take into account that it adds really a lot of new NPCs and if you're planning to use many population mods at the same time, tes the game deeply before starting an actual walkthrough to be sure game performance is not affected badly with too many NPCs added. You may also be interested in [url=https://www.nexusmods.com/skyrim/mods/74250]visual overhaul[/url] for some of its characters, [url=https://www.nexusmods.com/skyrim/mods/83710]Amalee customizer[/url] and [url=https://www.nexusmods.com/skyrim/mods/80661]Zora customizer[/url] for it.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/9494]WARZONES 2015 - Civil Unrest[/url]\n<br />Great mod which does exactly what how it named. Mod adds ifferent, small and big - battles, ambushes, encounters and skirmishes throughout whole Skyrim. There are hundreds of dynamic spots now where you can see massive battles between different factions and, of course, take some action. Old version of the mod were unstable and caused crashes. Current version was improved a lot and now it’s stable. Also it now has MCM menu. Also check [url=http://www.nexusmods.com/skyrim/mods/71011]this\n<br />additional plugin[/url] for eve more epic expirience. [color=#e06666]Note:[/color] while the mod itself is stable now, it's not recommended to use it with heavy mod list in general as it sometimes adds too many NPCs at the same time.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/32394]DFB - Random Encounters - MCM[/url]\n<br />Great and stable encounters mod from Skyrim Immersive Creatures author with cozy MCM menu.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/34492]Northern Encounters[/url]\n<br />Awesome encounter mod that also adds lore-based storylines alongside with the new encounters.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/73186]Populated Lands Roads Paths Reborn[/url]\n<br />Great and immersive mod that adds Adventurers, Merchants with Body Guards, Refugees, Pilgrims, Assassins to the roads of Skyrim.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73167]Populated Cities Towns Villages Reborn[/url]\n<br />Similar mod that adds many new citizens to Skyrim towns and cities to make them more alive.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73212]Populated Dungeons Caves Ruins Reborn[/url]\n<br />Similar mod that add many additional creatures in Skyrim dungeons.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73177]Populated Forts Towers Places Reborn[/url]\n<br />Same features for forts, towers and different camps.\n<br />[url=http://www.nexusmods.com/skyrim/mods/74029]Populated Imperials Stormcloaks Battles[/url]\n<br />Mod adds 4 armies for Stormcloaks and Imperials that are patrolling Skyrim regions. When these armies met the great battle occurs. These armies also can siege bandits forts.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73221]Populated Skyrim Civil War Reborn[/url]\n<br />This mod is much similar to previous one - it adds big Stormcloak/Imperial armies that can meet and fight. It also adds several patrols near Skyrim hold borders.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73194]Populated Skyrim Prisons Cells Reborn[/url]\n<br />Mod adds many new prisoners to Skyrim prison cells for more immersive prison atmosphere.\n<br />\n<br />[color=#ff7700]P.S. there similar mods from SOT team, they are also great, but I personally advise ot use this \"Populated\" series because for more or less same amount of features these mods are more ligh-weight and mostly totally scriptless.[/color]\n<br />[/size][/font]\n<br />[font=Arial][size=3][/spoiler][/size][/font]\n<br />\n<br />[size=4][center][img]https://i.imgur.com/QfXHBSN.jpg[/img]﻿[/center][/size][font=Arial][size=3]Various completely new gameplay features and additions - many things that this game lacked, features inspired by other RPGs, vanilla mechanics expanded by new stuff. Combat and absolutely \"civil\" related as well.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/34583]Magic Duel - Reborn[/url]\n<br />This mod allows you to engage magic duels with your enemies. If you want some more epicness for your mage playthrough -  try it for sure. You can duel both NPCs and dragons. For dragon magic duel becomes shout duel and that’s pretty immersive. Mod also contains configurable MCM menu.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/57589]Mixed Unit Tactics - Dawnguard Edition - Skyrim meets RTS[/url]\n<br />This mod brings some strategy feature to Skyrim. You can create different squads of followers, give them wide amount of orders, use a shout as a signal for action, pay salary, order to make stealthy operations, write order on paper. Followers also can even steal horses to ride.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/55264]Hidespots[/url]\n<br />Awesome mod inspired by Assassins Creed. You can hide in different ontainers and then perform stealthy actions to nearby objects or NPCs.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/65607]Patron Gods of Skyrim[/url]\n<br />Mod that adds Blackfall Temple to the world of Skyrim, where players can visit the shrine within to choose one god as their Patron God. Each god grants a unique effect that will let the player further customize their character.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/68553]Tavern Games - Mini Games in Skyrim[/url]\n<br />Immersive mod inspired by Witcher series that adds several mini-games.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/49369]Trade Routes[/url]\n<br />Ever wanted to play as a traveling merchant, buying goods cheap where they're plentiful and selling them where they're rare for a modest profit? Than this mod is definitely for you :) Mod adds different trade aspect like regional prices, speech scaling, trade supplies, quests affeting on prices here and there and few more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87578]Daedric Shrines[/url]\n<br />Gives the Daedric Shrine locations in the world of Skyrim functioning shrines, providing Divine Blessings from the Daedric Gods that did not offer them before, as well as adding additional content throughout the various shrine locations to increase immersion.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/72610]Landlord[/url]\n<br />Amazing mod that allows you to invest in different business in Skyrim to receive long-term profit. You can also hire employees to increase you income and mercenaries to defend you business from bandits (if you are too cool to do this yourself).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/65519]Taxes of the Nine Holds[/url]\n<br />Addes taxes to Skryim holds.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/82660]Skyshards[/url]\n<br />Not-so-lore-friendly (because objects added never existed in Skyrim, but added from ESO), but pretty original mod.  This mod adds 108 Skyshards, which are objects containing a magical essence that can be absorbed, throughout the 9 holds. After X (deafult amount is 3 but can be configured) Skyshards are absorbed, you will gain 1 (default value, can be configured) perk point that you can invest as you please. This may make your character pretty OP in some conditions, but if used wisely with balanced settings (especially if you already have more perk points per level from Uncapper, or more perk points from Ordinator optional file), this mod can be really unique addition to your leveling and a good motivation for wilderness exploration.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/45894]Death Alternative - Your Money or Your Life[/url]\n<br />Immersive mod that allows you to pay money when you’re defeated or you’ll be killed. That brings another roleplay feature to your gameplay. It also offers much more features for even more RP game as well as  MCM menu to configure them.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/51673]The Elsweyr Trader[/url]\n<br />A criminally underrated mod. Khajiit Trader featuring goods from Elsweyr. Includes new merchants, new harvestables, new foods , new blessing altars, new standing stone, cheese/wine aging, new player homes and much more.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84604]Draw - A Dueling Mod[/url]\n<br />Settle your conflicts like a real Nord! Single combat with any npc, no damaged faction relations, no strings attached. Killing your opponent is optional.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/10012]Unread Books Glow[/url]\n<br />Simple as that. An essential addition for bookworms.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/65613]Art of the Catch[/url]\n<br />Immersive mod that  offers fishing system in Skkyrim. Simple and awesome!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/86263]Potions Animated Fix[/url]﻿\n<br />Realtime potions drinking animation, even when running.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/30290]Dark Souls Bonfires[/url]\n<br />Adds some cool features from dark souls such as bonfires, estus flasks, Humanity, Fire Keepers and kindling!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/37486]Hidden Treasures[/url]﻿\n<br />200 hidden lootable chests with a unique design for you to discover all around Skyrim.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/55375]The Egg Of Time - Dwemer artifacts from Morrowind[/url]\n<br />10 dwemer artifacts from Morrowind. Will you be able to find them all?\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90041]Display Enemy Level[/url]\n<br />Simple as that.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/10445]Improved Weapon Impact EFFECTS Correct Metal[/url]\n<br />Mod adds metal sparkles for all weapons hitting on each other.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89875]Super Simple Lock Bash[/url]﻿\n<br />Simple mod that allows you to bash lock with a success chances based on your level, weapon skill, weapon quality, lock difficulty and some luck.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/88289]Simply Climb[/url]﻿\n<br />Adds ability to climb. Doesn't have animations though.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/88884]Simply Tame[/url]﻿\n<br />Tame beasts. Simply indeed.\n<br />\n<br />[/size][size=3][/spoiler][/size][/font]\n<br />\n<br />[color=#ff7700][size=5][b][center][/center][/b][/size][/color][center][img]https://i.imgur.com/hRsTzqm.jpg[/img]﻿[/center][font=Arial][size=3]Immersion is very \"wide\" termin in gaming. Long story short, it's everything that makes your game realistic (i.e. similar to real life) in some way - needs system, camping, weather affecting character warmth and health, realistic physical abilities, AI packages and so on. Everything to make you feel not just playing a character in game, but to \"feel\" this game better and have better interaction with the world around you.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][url=http://www.nexusmods.com/skyrim/mods/64798]Campfire - Complete Camping System[/url]\n<br />[size=2]Definitive. Immersive. Amazing. Qualitative. That’s what Chesko’s work means. Amazing mod that adds camping system to Skyrim. [/size]\n<br />[size=2]Search or buy resources, improve your camping skills ( with a help of new custom perk trees), and make a camp with a warm fire to rest in any place of Skyrim. Also check this additional [/size][url=http://www.nexusmods.com/skyrim/mods/64798]patch for Hunterborn[/url][size=2].[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/72220]Tentapalooza for Campfire[/url]\n<br />[size=2]Great mod that adds many beautiful items compatible with Campfire and Frostfall: bedrolls, different tents great for rolepay, storages, follower tents, pet beds and shrines.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/75579]Skyrim Sleeping Bags - Sleep Under Blankets[/url]\n<br />[size=2]Another similar mod. It adds different types of bedrolls for you and your followers. You can sleep, lie down, sit and even meditate on them.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/85629]Immersive Stables 2.0[/url]\n<br />[size=2]Adds new stables to the stable-less cities and villages. CTF [/size][url=https://www.nexusmods.com/skyrim/mods/89564]patch[/url][size=2] is available for it as well.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/11163]Frostfall - Hypothermia Camping Survival[/url]\n<br />[size=2]Realistic survival expirience? Best immersion mod even created? Think no more. Look at Frostfall. Absolutely amazing survival expirience. Cold water, frosty winds, snow, low temperatures - everyting these now affect your health condition. Frostfall uses a sophisticated system to track your location, weather, time of day, worn clothing, and more, to determine your current condition, in a seamless and immersive way. Combined with Campfire, it also features a large variety of craftable camping equipment, including craftable torches. It is highly customizable, and very compatible with most other mods, including Real Shelter, Climates of Tamriel, Wet and Cold, worn cloaks, food, timescale, lighting, werewolf, and vampire mods.[/size]\n<br />[color=#ff7700]Personal note:[/color][size=2] If you never played any kind of survival games or just hardcore RPGs like Dark Souls - this mod can be really hard for you as it’s really realistic and most likely stared a new playthrough with its default settings you’ll die from cold more often then from [/size]\n<br />[size=2]enemies. But it’s not a reason not to use it if you like its idea in overall. Its MCM menu is really greatly customizable so you can decrease all negative effects power and increase your items/clothes values to play more simple.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/23771]SkyBirds - Airborne Perching Birds[/url]\n<br />Real flying interactive bird actors for Skyrim. New bird models that can sing, hop about, peck, fly dynamically and perch wherever they want. The birds will fly away from enemies, build nests in trees and eat insects. They can be killed and have new alchemy ingredients. It's also strongly recommended to grab of the performance patches for this mod [url=https://www.nexusmods.com/skyrim/mods/76065]here[/url], to prevent script lag with heavy-modded setup.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/32695]Even Better Quest Objectives - EBQO[/url][/size]\n<br />This mod enhances the quest descriptions in the vanilla game so that you have a clear sense of where your are supposed to go and what you are supposed to do besides looking at the quest markers. Let's face it - the quest descriptions were quite bad, not specifying where you are supposed to go by themselves, and forcing you to play with the quest markers on all the time. This affects nearly 250 quest objectives/descriptions, spanning over 160 quests, editing descriptions that were either really vague or didn't exist at all. \n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/51473]iNeed - Food Water and Sleep[/url]\n<br />[size=2]Awesome and light-weightbasic needs mod. It adds hunger/thirst/sleep system so finally food and drinks become valuable in your playthrough. It also offers intuitive system of widgets to inform you about current needs status. It’s very high-compatible with most popular mods and greatly customizable in MCM menu. It’s more immersive, has more features and have better design (Ninth bless widgets!) than Realistic Needs and Diseases in my opinion and also has much better compatibility with other mods, but if you like RnD more - install it instead. My only advice is to read mod description at original mod page (it’s abandoned from 2013) and download more fresh, 2016 year version of it.[/size]\n<br />[color=#ff7700]Some additional patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/77126]CACO - iNeed patch (choose second CACO file from Files section)[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/75876]Realistic Needs and Diseases All-In-One for USLEEP (2016 edition)[/url]\n<br />[size=2]Another great basic needs mod. Choose this one or INEED.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/36898]ZF Primary Needs[/url][/size]\n<br />Qualitative and pretty underrated mod that you can use as almost all-in-one simple immersion overhaul, with almost all needed features (if you don't want to combine many different mods or don't like them for some reasons). Read the mod description page carefully, it contains all needed information.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/55396]Toxicity - A Witcher-like Toxicity System[/url]\n<br />Adds a toxicity value to consuming potions based on the strength of the potion and effect types. Works with any potions from any mods. High toxicity produce visual effects and drunkenness. This put a soft limit on the number of potion that can be consumed in a row, making you to use potions much more wisely.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/18916]Lanterns of Skyrim - All In One[/url]\n<br />[size=2] Simple and immersive mod that add lanterns to main roads, villages, towns and settlements. The light sources of the lanterns are lit from 7pm to 7am. Once instlaled I just can’t play without it anymore. It’s especially good for people who play with weather/lighting mods/ENBs that have dark nights.[/size]\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/31431]Lanterns of Skyrim - All In One Compatibility Patches[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/63869]Lanterns Of Skyrim ELFX patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/66795]Skyrim Bridges Patch[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/27563]Wet and Cold[/url]\n<br />[size=2]Amazingly immersive mod. It adds touch of realism to your game. Drips, soggy feet, breaths, rain blind, snow accumulation on clothes, speed reduction during blizzard and so on. But it’s also pretty script-heavy so if you already runnin heavy-modded game think carefully before using it.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/64820]Holidays[/url]\n<br />[size=2]Mod from the same author that brings holidays to Skyrim settlements and will change their appearance based on TES lore.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/68221]Carriage and Ferry Travel Overhaul[/url]\n<br />[size=2]A lightweight but immersiove overhaul of both the vanilla Skyrim carriage system and Dawnguard's ferry system. Realistic and bug-free. Also install this minor [/size][url=https://www.nexusmods.com/skyrim/mods/89828]patch[/url][size=2] for it if you'll have clipping issues with towns/cities mods.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/14513]Khajiit Speak - Complete Dialogue Overhaul[/url][/size]\n<br />Complete overhaul of all the in-game dialogue to match Khajiit speech patterns. Now covers the vanilla game and all DLCs. If you're using it, don't forget to take a look on this new amazing [url=https://www.nexusmods.com/skyrim/mods/92392]addon[/url] for it which is supporting many popular mods :3\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/75296]Better Stealing[/url]\n<br />Simple but immersive mod. If you steal something and nobody sees you do it then the item will not be \"stolen\".\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/67763]Go to bed[/url]\n<br />This mod allows your character to actually sleep in bed.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/74355]Realistic AI Detection[/url]\n<br />Absolutely msut-have mod - lightweight, compatible with everything and great in overall.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/52612]Real Shelter - Full Release[/url]\n<br />[size=2]Ever asked yourself why rain and snow goes straight through roof and tents? Think no more, install Real Shelter. Its feature is exact and simple - when a player goes under shelter, rain and snow will stop ghosting through solid objects.[/size]\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73681]Real Shelter v1.4.0.7 USLEEP Patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/76368]Real Shelter Patches[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83379]SkyrimSouls - Unpaused Game Menus[/url]\n<br />[size=2]Does exactly how it's named. Now opening ingame menus won't pause the game. You can tweak which menus exactly will have this effect in .ini file. Also you may be interested in this [/size][url=https://www.nexusmods.com/skyrim/mods/83827]addon[/url][size=2] for it. Mod is SKSE plugin so it doesn't occupy .esp slot.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89516]3PCO - 3rd Person Camera Overhaul[/url]\n<br />[size=2]An absolutely must-have mod who players who spend most amount of time in 3rd person. This mod is just revolutionary! It imitates modern AAA games camera movement, which is based on player world coordinates, giving immersive smooth camera follow effect, especially noticable in combat.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/57859]Skyrim - Enhanced Camera[/url]\n<br />[size=2]It’ a SKSE plugin that enables a visible body while maintaining the look and feel of vanilla first person and requires minimal configuration. [/size][color=#ff7700]Choose[/color][size=2] this one or \"Imemrsive First Person View\".[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/58491]Left Hand Rings Modified[/url]\n<br />[size=2]Simple as it. Makes it possible to wear rings on left hand :)\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/62894]Not So Fast - Main Quest[/url][/size]\n<br />Introduces pauses in the otherwise hectic pace of the main quest and alters a few other plot points along the way. The actual time delays and whether the Season Unending negotiations are skipped can be configured with MCM or the console.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/49036]Immersive First Person View[/url]\n<br />[size=2]Unique and immersive mod that allows you to see exactly what your character sees.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/17416]Wearable Lanterns[/url]\n<br />[size=2]Another great immersion mod from Frostfall author. May the light be always with you!\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76949]Equippable Tomes - Belt-Worn Books[/url][/size]\n<br />Equippable Tomes is a mod that adds tomes and books that can be worn on your character's belt in order to increase the power of their spells. Unenchanted versions are included as well if you just want to wear books that don't affect spell power or enchant your own.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/93156]Gallows of Skyrim[/url]﻿ [color=#ff0000]==NEW==[/color]\n<br />Mod adds gallows to every city in Skyrim.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/34399]Animated Dwemer Lift Load Doors[/url]\n<br />[size=2]This mod adds a brief animation to the Dwemer Lift Load Doors found all over Skyrim.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/25029]Perseids Inns and Taverns - Realistic Room Rental Enhanced[/url]\n<br />[size=2]Ever wonder why in Skyrim all hotel rooms cost the same? For 10gp you can't even buy a cheese wedge, but you can get a luxury suite in the Winking Skeever. This mod makes rental more realistic.[/size]\n<br />[color=#ff7700]Patches:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/57725]Moonpath to Elsweyr - Realistic Room Rental Enhanced Patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53549]Realistic Room Rental Enhanced and No Snow Under the Roof Compatibility Patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/66164]Functional Homes and Realistic Room Rental Enhanced Patch[/url]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/58510]iActivate[/url]\n<br />[size=2]Simple but genious mod. It removes the small icon and adjacent text that indicates what action is available when activating an object, whether it is talking to a person, opening a door, searching a chest or what have you. [/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/73236]Simply Knock[/url]\n<br />[size=2]Simple but very immersive mod that will add an option to knock before trying[/size]\n<br />[size=2]enter the house or to lockpick the door.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/14513]Khajiit Speak[/url]\n<br />[size=2]Simple but absolutely must-have mod for any Khajiit roleplayer. The most obvious change is that Khajiit often refer to themselves in the third person, saying their name, or calling themselves \"Khajiit\" or \"This one\" instead of using \"I\". But this mod also offer much more Khajiit dialogue improvements.||[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/65013]Immersive Citizens - AI Overhaul[/url]\n<br />[size=2]Awesome mod that offers great improvement to friendly NPCs of Skyrim giving them much smarter behavior and survival instincts. It's maybe the one and big flaw is bad compatibility part when it comes to mods that affects cities/towns/villages. Though, you may be interested in separate [/size][url=https://www.nexusmods.com/skyrim/mods/76907]JK's Whiterun mod[/url][size=2] version which is compatible with it.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/30947]Dead Body Collision Fix[/url]\n<br />[size=2]All dead bodies are now solid and can collide with yourself and other NPCs - no more walking straight through corpses.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/29476]Pumping Iron - Dynamic Muscle Growth[/url]\n<br />[size=2]This mod was not updated for a very long time, but it’s still working great. It adds dynamic muscle growth system. Every time your character gets a skill increase in a combat skill (or smithing) his muscles will be considered to have been trained a little. The more skill increases, the more training. When a 'trained' character sleeps, his muscles will grow ever so slightly.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/67663]Religion - Prayer Meditation Worship[/url]\n<br />[size=2]Mod name exactly and shortly describes what it does. As for me, it’s amazing immersion mod. It add real religion to Skyrim. The player can now fully role play a priest, crusader, or demon worshipper, by praying to your preferred Divine or Daedra, and acting in their name. Character will receive bonuses or curses depending on relashionships with current Divine/Daedra. If you don’t want to rely on some other being you can also meditate to receive buff for Warrior/Mage/Stealth skills.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/71464]Real Names[/url]\n<br />[size=2]Mod adds names to most of generic NPCs of Skyrim.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/74568]Relationship Dialogue Overhaul - RDO[/url]\n<br />[size=2]Mod adds more then 5000 voiced lines of dialogues. All lines are voiced using the original voices from the game and consist of existing lines that have been added in new and suitable situations, as well as completely new dialogue created by editing multiple lines together to form brand new ones. Friends talk to you more like friends. Followers have more much to say when speaking to them. If your spouse is a follower, he/she will talk to like a spouse instead of a generic follower. NPCs who dislike you (not bandits and forsworn, but citizens of towns and cities) will have more insults to say and may even completely stop talking to you if you continue to pester them.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/79258]Hunters Not Bandits[/url]\n<br />[size=2]NPC's will not use taunts or insults when fighting animals. Especially hunters will behave in a more realistic manner, as well as fixing the odd behavior where enemies could start using greetings and other unfitting dialogues right after they killed you. Compatible with RDO (install RDO version).\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/51469]Immersive Player Dialogue[/url]\n<br />Simple as that. Makes player dialogues lines sound more...as said by human, not by a robot.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80355]Realistic Conversations[/url]\n<br />[size=2]Npc talk more often to each others. And will less likely greet to you from a distance, they will also greet less often too, making them to not act as much as robots. NPCs are also more clever and will know for example if they talked to a npc and will therefore talk to another or not talk at all. Compatible with RDO.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/66567]Imperial Stone-The Forts of Skyrim Redone[/url]\n<br />[size=2]The forts of Skyrim look as though they have been abandoned for 400 years. This mod aims to change that up a little. New structures and walls have been built in the major forts of Skyrim. Some walls are still wooden palisades until a civil war faction takes over from the bandits. The walls and decorations will dynamically change depending on which faction currently has ownership of the fort. Shrines to Talos dominate Stormcloak forts while shrines to Akatosh take up the mantle in Imperial held forts.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/64201]Skyrim Wayshrines - Immersive Fast Travel - SWIFT[/url]\n<br />[size=2]Mod adds a network of wayshrines across the world of Skyrim, Dawnguard, and Dragonborn that allows players to instantly travel from one wayshrine to another in a more lore-friendly way. The mod is balanced by forcing players to have to locate a wayshrine before they can gain access to its location for teleportation. The locations of the wayshrines are also not too close to major locations but close enough to maintain convenience, especially for no fast travel playthroughs, as well as compatibility. This also encourages the player to be more adventurous in their explorations.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87687]The People of Skyrim Complete Edition[/url]\n<br />[size=2]Explore Skyrim all over again’ An immersive world overhaul mod adding many new features throughout the world of Skyrim. Mod features: hundreds of new NPCs. More ruins, camps, mills, markets, graveyards and so on. Enemy encounters, hanged people from Thalmor persecution, new factions, cities visual improvements and much more. The only thing you shold take into account that it's not compatible with cities mods like JK's Skyrim, Dawn of Skyrim etc. Patches are available for [/size][url=https://www.nexusmods.com/skyrim/mods/88657]CTF[/url][size=2]﻿, [/size][url=https://www.nexusmods.com/skyrim/mods/88805]ICAO[/url][size=2]﻿, [/size][url=https://www.nexusmods.com/skyrim/mods/88472]Legacy of the Dragonborn[/url][size=2], [/size][url=https://www.nexusmods.com/skyrim/mods/88268]Falskaar[/url][size=2]﻿, [/size][url=https://www.nexusmods.com/skyrim/mods/88263]ASLAL[/url][size=2]﻿ and [/size][url=https://www.nexusmods.com/skyrim/mods/90650]Bells of Skyrim[/url][size=2].[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/55677]Loot and Degradation[/url]\n<br />[size=2]Great immersion mod that basically offers 2 main features: - enemies now can use enchanted weapons. - weapons and armors will now eventually degrade because of combat. You can repair and temper  your weapon/armor Mod also provides useful widgets to display your current armor/weapon status.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89035]Equipment Durability System[/url]\n<br />[size=2]This may be a more lightweight alternative to previous mod. It's also SKSE-only plugin so it doesn't occupy .esp slot.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/51024]Honed Metal -NPC Crafting and Enchanting services-[/url]\n<br />[size=2]Great mod that partially covers what Loot and DEgradation does, but it's focusing on this directly and adds much more features. Blacksmiths and mages all over Skyrim will be able to craft, temper and enchant your equipment, including any armor and weapons added by mods. The quality and price of their work will depend on their skill as blacksmiths and enchanters as well as your barter prowess. Fully customizable through an MCM menu.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87945]Destructible Display Cases[/url]\n<br />[size=2]Yes. finally. Break dat glass![/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/48375]Take Notes - Journal of the Dragonborn[/url]\n<br />[size=2]Ever wanted to write your own diary during playthrough for even much more immersion? Try this one.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/56929]Civil War-Destroyed Villages[/url]\n<br />[size=2]This mod ads destroyed Villages all around Skyrim for better Civil War immersion.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/60421]Bathing in Skyrim[/url]\n<br />[size=2]Bathing in Skyrim adds bathing and cleanliness to Skyrim. Over time, your character will [/size]\n<br />[size=2]become visually more filthy and you will receive a penalty to your Speechcraft and disease resistance. If you become exceptionally filthy, you will also receive a penalty to Sneak as enemies smell you coming. To avoid these penalties, you will need to bathe yourself regularly. Staying clean also awards small bonuses depending on what type of soap you use. All mod values can be configured via MCM menu.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/43493]Hold Border Banners[/url]\n<br />[size=2]This mod adds banners along roadsides at the boundaries of two holds. The banner you see will show you which hold you are entering. If you're not sure what the banner represents, just walk up to it and it will show the name of the hold.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/62735]Immersive hold borders[/url]\n<br />[size=2]This mod adds towers and guards to the major roads at the edge of a holds boundary. Also take a look on a [/size][url=https://www.nexusmods.com/skyrim/mods/88729]patch[/url][size=2] for it.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/52296]Unique Border Gates[/url]\n<br />[size=2]Compatible with previous mod, this one is overhauling vanilla border gates. A [/size][url=https://www.nexusmods.com/skyrim/mods/91297]patch[/url][size=2] for the Shire mod will be useful if you're using it.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/77135]Public Executions[/url]\n<br />[size=2]Adds public executions to Solitude after the initial vanilla execution event and the option to capture bandits for executions.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/33393]Point The Way[/url]\n<br />[size=2]Simple, but greatly immersive one. Road signs have been placed at several major intersections that were either lacking signs, or didn't have enough signs to indicate the full extent of where you could travel on a road.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/30533]Face to face conversation[/url]\n<br />[size=2]Automatically switch to first person when talking. You can also switch back and forth between first person and third person.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/31799]Traps Make Noise - More Dangerous Traps[/url]\n<br />[size=2]Enemy NPCs will now pay attention when trap is triggered near them. Also, as you can remember, vanilla traps damage was barely noticable. this mod fixes this and makes traps much more dangerous.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84740]Bells of Skyrim[/url]\n<br />[size=2]Mod adds bells to major skyrim towns and cities that will alarm citizens in case of danger, like dragon/vampire/bandit attacks.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/41809]Ovens and Churns of Skyrim[/url]\n<br />[size=2]This mod places ovens and churns added by the Hearthfire DLC throughout Skyrim. Main cities, settlements, and player houses are covered. Great mod if you're running needs mods.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/24282]Drinking Fountains of Skyrim[/url]\n<br />[size=2]Simple but very immersive mod. It does actually how it named :) Also check this [/size][url=http://www.nexusmods.com/skyrim/mods/34010]patch[/url][size=2] for Dragonborn support.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/85448]No More Ugly Effects[/url]\n<br />[size=2]If you are tired to see glowing visual each time you cast a spell on yourself - this mod is definitely for you.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/31325]Real-time Dragon Fast Travel - Dragonborn[/url]\n<br />[size=2]Allows to Fast Travel in Real-time while mounted on a Dragon, also adds a spell to call a Dragon to fast travel with from anywhere.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/77388]Torch Craft[/url]\n<br />[size=2]This mod offers a really esome variety of torches to craft. Great addition for your survival mod list.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/37104]Khajiit Merchants Buy Stolen Items[/url]\n<br />[size=2]Because stereotypes work.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83816]Realistic Capacity[/url]\n<br />[size=2]Much more realistic carry weight limits. Also fully configurable in MCM.[/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/73844]Improved Adoptions[/url]\n<br />[size=2]Ever was bored with vanilla adoption system? Try this!. It contains over a dozen dialogue scenes between the kids and others between your spouse and housecarl Your kids will hang out with other kids when they're in town, and join them in running around town. They'll actually visit the places they say they do. If you've been missing for 3 or more days they'll send the Courier packing with a message for you. You can ask your kids and spouse to accompany you to your new home and have them follow you there![/size]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/73916]Blowing in the Wind[/url] \n<br />[size=2]Just an amazing and must-have mod! Mod adds proper physics to lanterns and signs when it's a windy/storm weather. It also has compatibility with most of town overhauls and other immersion mods.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/80696]Customizable Lights[/url]\n<br />[size=2]Customize your torch, candlelight spell and more in-game with features like brightness, range and smart dynamic shadows.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/76176]COVERED ENTRANCES - Dark Brotherhood Sanctuaries-Twilight Sepulcher-Nightingale Hall[/url]\n<br />[size=2]Not so obviously noticable now.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90588]Basket Backpack[/url]\n<br />[size=2]Simple as that.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/86214]Vampires Cast No Shadow[/url]\n<br />[size=2]If you want that.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90659]Skydrown - Respiratory Impairment[/url]\n<br />[size=2]For MUCH more realistic drowning (you drown much faster while underwater).[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/87490]No Crime Teleport[/url]\n<br />[size=2]Makes impossible to fast travel when you have bounty.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/90048]Silenced Prisoners[/url]\n<br />[size=2]Finally.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91853]Remove Invisible Barriers[/url]\n<br />[size=2]A little mod that removed the invisible walls around some objects like the whiterun walls the solitude DB Escape Bridge.[/size]\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/23179]Sit Anywhere[/url]\n<br />[size=2]For real.[/size]\n<br />\n<br />[size=3][/spoiler][/size]\n<br />[/font]\n<br />[color=#ff7700][size=5][b][center][img]https://i.imgur.com/gdPON7z.jpg[/img]﻿[/center][/b][/size][/color][font=Arial][size=3]These patches/fixes/changes are absolutely not obligatory, but may be very useful. It's totally up to you - install them or not.[/size][/font]\n<br />\n<br />[font=Arial][size=3][spoiler][/size][/font]\n<br />\n<br />[font=Arial][size=2][url=http://www.nexusmods.com/skyrim/mods/26230]Sharlikrans Compatibility Patches[/url]\n<br />Wide list of compatibility patches for different mods.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/83806]Skylover's Compatibility Patches[/url]﻿\n<br />Another great collection of various little patches. May be very useful.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/86895]Quest Conflict Fixes[/url]﻿\n<br />Various fixes of rarely-happening bugs in quest that may lead these qeusts to stuck.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/21429]Wolf Queen Awakened and Letter From Falk Firebeard - Fixed[/url] \n<br />SImply AMAZING mod that fixes terrible bug with \"Wolf Queen Awakened\" quest (when it does not starts at all).\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/33395]SkyTweak[/url]\n<br />This mod allwos you to customize almost any ingame value. Very useful when you're running big list of gameplay mods and need to configure them to work properly and balanced.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/55100]Wiseman303's Trap Fixes[/url]\n<br />Fixes for  traps.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/54274]Dragon Stalking Fix[/url]\n<br />Install this if you have dead dragons \"stalking\" you across the world map.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/30080]Elemental Fury Fix with Offhand Update[/url]\n<br />Elemental Fury will work on enchanted weapons, bows, unarmed, and will now properly apply to your offhand when dual wielding.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/77791]No more Radial Blur[/url]\n<br />This mod removes radial blur completely from all effects and dlc's and also contain fixes from USLEEP.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/86900]Player Blink Fix[/url]﻿\n<br />If not-blinking character somehow bothers you - get this fix.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84238]Ferns Don't Writhe[/url]\n<br />If this bothers you as well.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/21429]Wolf Queen Awakened and Letter From Falk Firebeard - Fixed for old USKP saves[/url]\n<br />A small mod which makes it possible to start Wolf Queen Awakened if you&#92;'re at the level cap (or the courier simply won&#92;'t show up), and you&#92;'re playing a save file with an old version of USKP.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84474]Don't Talk With Your Mouth Full[/url]\n<br />A simple mod that prevents NPC eating and drinking animations while talking to the player.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/7901]No Menu and Loading Smoke[/url]\n<br />If this smoke annoys you or yo usomehow getting werid visuals in main menu - get rid of it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/68648]Candlelight Magelight No Ugly Glow FX[/url]﻿\n<br />Simple as that. If you find this effects ugly ofc.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/84913]Potema Fix (CTD - Crash)\n<br />[/url]In most of cases you won't have this issue at all because this bug is fixed by XPMSE, which I strongly recommend to use. But if for some reasons you don't have XPMSE - this will help.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/85285]Barter Fix(SKSE Plugin)[/url]\n<br />SKSE plugin which fixes an issue where the player can't get any money from selling when merchant's on-hand golds reach a certain value.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/89751]Armor Appearance[/url]\n<br />Changes the appearance of the player's armor. Open MCM menu and choose armor you want to change the model for - then just do it.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/91158]Open Inventory[/url]﻿\n<br />May be useful for I have no idea what cheating/testing purposes. But still, it may be.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/48645]Numerical Smithing Upgrades[/url]\n<br />Changes the naming system of upgraded equipment to a number-based system. So instead of items being amended with (fine), (superior), (exquisite), etc., you have (+1), (+2), (+3) and so on.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/33047]No player moans[/url]\n<br />If that's disturbing you for some reasons.\n<br />\n<br />[/size][size=3][/spoiler][/size][/font]\n<br />\n<br />﻿\n<br />[center][img]https://i.imgur.com/JdbEFR3.jpg[/img]﻿[/center][font=Arial][size=3]This list is, of course, not all mods I'm using for gameplay, but it will serve you as a great \"base\" if you are, same as me, aimed on really interesting, challenging and rewarding gameplay. So:\n<br />[/size][/font]\n<br />[font=Arial][url=http://www.nexusmods.com/skyrim/mods/68425]Ordinator - Perks of Skyrim[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/16225]Apocalypse - Magic of Skyrim[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/61218]Imperious - Races of Skyrim[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/89219]Andromeda - Unique Standing Stones of Skyrim[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/80918]Summermyst - Enchantments of Skyrim[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/31264]OBIS[/url]\n<br />[size=2]   - IA7 AND CLOAKS PATCH (or IA8 AND CCOR PATCH if you have CCOR)[/size]\n<br />[size=2]   - Bandit patrol updated for USLEEP\n<br />[url=https://www.nexusmods.com/skyrim/mods/49791]Complete Crafting Overhaul Remade[/url][/size]\n<br />[url=http://www.nexusmods.com/skyrim/mods/24913]Skyrim Immersive Creatures [/url][size=2](do NOT install ROTE patch from it's installer)[/size]\n<br />[url=http://www.nexusmods.com/skyrim/mods/10175]SkyTest - Realistic Animals and Predators[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/36006]Ultimate Combat[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/20923]TK Dodge[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/56147]Combat Evolved [/url][size=2](with enemies increased Poison and Magic damage)[/size]\n<br />[url=http://www.nexusmods.com/skyrim/mods/76529]Wildcat - Combat of Skyrim[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/3829]Deadly Dragons[/url]\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/73921]Mortal Enemies - De-aimbot Your Foes[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/76753]MUS - Morrowloot Ultimate Simplified[/url] + all ptaches needed from MUS and MLU page (MLU patches work fine with MUS).\n<br />Dragon Combat Overhaul[/size]\n<br />[url=http://www.nexusmods.com/skyrim/mods/40491]Revenge of the Enemies 2016[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/18436]ASIS[/url][size=2] + [/size][url=http://www.nexusmods.com/skyrim/mods/53047]ASIS Improved Ini Files[/url][size=2] (ONLY perks/spells/potions/ehcnant fix options are used)[/size]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73177]Populated Forts Towers Places Reborn[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73186]Populated Lands Roads Paths Reborn[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73212]Populated Dungeons Caves Ruins Reborn[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32394]DFB - Random Encounters with MCM[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/31799]Traps Make Noise - More Dangerous Traps[/url]\n<br />[size=2][url=https://www.nexusmods.com/skyrim/mods/36849]Immersive College of Winterhold[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/66567]Imperial Stone-The Forts of Skyrim Redone[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/43773]Audio Overhaul for Skyrim 2[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/11941]ABT - Arrows and Bolts Tweaks[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/60796]Lost Grimoire of Skyrim[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/80159]Sacrosanct - Vampires of Skyrim[/url]\n<br />[url=https://www.nexusmods.com/skyrim/mods/59463]Moonlight Tales - Werewolf and Werebear Essentials[/url]\n<br />+ patches for all mods needed from [/size][url=http://www.nexusmods.com/skyrim/mods/73369]HERE[/url][size=2] and [/size][url=http://www.nexusmods.com/skyrim/mods/46495]HERE[/url]\n<br />\n<br />[color=#ff7700][b][size=3]LOAD ORDER NOTES:[/size]\n<br />[/b][/color][size=2]Some of these should be loaded in strict order. Here's the list. For the rest of mods you can trust LOOT sorting.[/size]\n<br />[size=2]Skyrim Immersive Creatures[/size]\n<br />[size=2]Revenge of the Enemies[/size]\n<br />[size=2]OBIS[/size]\n<br />[size=2]Combat Evolved[/size]\n<br />[size=2]Ultimate Combat[/size]\n<br />[size=2]Wildcat[/size]\n<br />\n<br />[size=3][color=#e06666]Also![/color] You should disable the same features in different mods in MCM and leave only one you like the most. For example, both of Ultimate Combat and Wildcat have Timed Block features. Choose only one you like more and disable the another one, and so on. It's a good habit in overall to inspect all MCMs you have at least briefly to know how you can control your mods ingame :)\n<br />\n<br />[color=#ff7700]Now all you need to be sure to make is rebuild you [url=https://www.nexusmods.com/skyrim/mods/1840]Bashed Patch[/url] and [url=https://www.nexusmods.com/skyrim/mods/90987]Smashed Patch[/url] (optionally, but strongly recommended). If you still want more information about how to use them, refer to [url=https://www.nexusmods.com/skyrim/mods/76373]graphics guide[/url] \"How to Start &amp; Stability\" section ;)[/color][/size][/font]\n<br />                              [color=#ff7700][center][img]https://i.imgur.com/9HpoZ5Z.png[/img]﻿[/center][/color]\n<br />[color=#ff7700][size=3][b][center][font=Arial]WOW! We finished this. For now ;)\n<br />Modding Skyrim will be never enough. I want to say so much thanks to every modder who made nextgen Skyrim possible and also want to ask you guys don't forget to endorse their mods after you download :) Wish you challenging, immersive and stable game, may the Ninу bless you and have a good hunt!\n<br />\n<br />[/font][/center][/b][/size][/color][center][img]https://i.imgur.com/5oz7DTf.png[/img]﻿[/center]",
  "categoryId": "82",
  "version": "2.0",
  "author": "Sinitar Gaming",
  "createdUnix": "1471311946",
  "updatedUnix": "1529795770",
  "containsAdultContent": false,
  "uploadedBy": "DonProtein",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000217128",
      "name": "SKYRIM ULTIMATE MODDING GUIDE - GAMEPLAY and IMMERSION",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "27",
      "fileName": "SKYRIM ULTIMATE MODDING GUIDE - GAMEPLAY and IMMERSION-77928-1-0.zip",
      "uploadedUnix": "1471311943",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3576902a7ffc28aa9d3c2e7d946f7675d495925dbdc3c19d6e858378c0bd36f6/analysis/1471311966/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SKYRIM%20ULTIMATE%20MODDING%20GUIDE%20-%20GAMEPLAY%20and%20IMMERSION-77928-1-0.zip?fid=1000217128&ttl=1535866570&ri=8192&rs=8192&setec=cc7bf554b90e65830ab624a31920f74a"
    },
    {
      "fileId": "1000225364",
      "name": "my combat-AI-magic mods list and load order",
      "version": "",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1",
      "fileName": "my combat-AI-magic mods list and load order-77928-.zip",
      "uploadedUnix": "1477241515",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/7458a20d98aac030c937ec44a3f90c278e44dd1979078143628ee819ea1b845c/analysis/1477241522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/my%20combat-AI-magic%20mods%20list%20and%20load%20order-77928-.zip?fid=1000225364&ttl=1535866570&ri=8192&rs=8192&setec=dc1cc45d713187c450198e76daf9da7d"
    },
    {
      "fileId": "1000275943",
      "name": "My .INI settings for Uncapper",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "My .INI settings for Uncapper-77928-2-0.zip",
      "uploadedUnix": "1529795770",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/aee6195c80ebfe5cbfc96a77e0153ecb471a9dcb0d1dfbded0085c593228e77b/analysis/1529796724/",
      "changelogHtml": " - Added more than 300 new mods\n<br />- Completely reworked guide design, structure and readability \n<br />- Added several brand new sections like \"Amors, Weapons and Artifacts\", \"Followers\", \"Player Homes, Mansions and Castles\" \n<br />- Uploaded my Uncapper .INI file in 3 different versions to fit your taste so you don't need to tweak it yourself \n<br />- Removed broken links to the deleted/hidden mods \n<br />- Added section with a base of my gameplay mod list that you can use as a good start for your own load order \n<br />- Tons of other things I already forgot <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20.INI%20settings%20for%20Uncapper-77928-2-0.zip?fid=1000275943&ttl=1535866571&ri=8192&rs=8192&setec=5c5163d67b68b215cff9b77629babe11"
    }
  ]
}