{
  "modId": 77958.0,
  "modName": "Nimmervoller Beutel - Enderal - DV (German)",
  "summary": "Der bekannte Nimmervolle Beutel wurde jetzt auch in Enderal, der Total-Conversion von Skyrim, gefunden. Ihr könnt nicht genug von allem sammeln oder mitnehmen? \r<br />Dann ist es genau der richtige Gegenstand für euch.",
  "descriptionHtml": "Version for Enderal - German, not testet on english Version &#33;\r<br />\r<br />Vieleicht kennt ihr noch den nimmervollen Beute aus Oblivion, Skyrim oder ...\r<br />Siehe z.B. auch hier für Skyrim: [url=http://www.nexusmods.com/skyrim/mods/11785/?]Nimmervoller Beutel - German[/url]\r<br />\r<br />Der bekannte &#34;Nimmervolle Beutel&#34; wurde jetzt auch in Enderal, der Total-Conversion von Skyrim, gefunden. Ihr könnt nicht genug von allem sammeln oder mitnehmen? Dann ist es genau der richtige Gegenstand für euch.\r<br />\r<br />\r<br />&#34;Spoiler: nachdem ihr auf Vyn gelandet seit und das Festland erreicht habt, findet ihr nach einigen 100 Metern links eine Ruine und die Reste einer kleinen Werkstatt. Dort haben die Ratten wohl etwas vom Tisch gerissen^^, auf dem Fussboden liegt eine Landkarte mit Markierung &#34;findet den Sack&#34;, \r<br />die müsst ihr einfach anklicken, danach ist er in eurem Inventar als Misc-Item. &#34;\r<br />\r<br />\r<br />Benutzung:\r<br /> Dieses Item wird aus dem Inventar abgelegt wie gewohnt, danach anklicken. Ein grösserer Beutel erscheint, den ihr wie andere Lager-Container benutzen könnt.\r<br />Das Item ist automatisch wieder in eurem Inventar, falls ihr es mal verliert, müsst ihr leider zum Ursprungsort zurück und die Fahne erneut anklicken.\r<br />Wird der grosse Beutel im Schleichmodus aktiviert, verschwindet er danach ausser Sicht, bis ihr ihn wieder ruft, der Inhalt bleibt erhalten.\r<br />So habt ihr immer eine Möglichkeit, euer Inventar zu entlasten und müsst nicht jedes mal  erst zur sicheren Truhe. \r<br />\r<br />manuelle Installation:\r<br />entpacken, dann \r<br />- LM-NimmervollerBeutelDV-Enderal.esp und dazugehörige Dateien in den Spiele-Ordner-&gt;\r<br /> entsprechendes Laufwerk (...meistens C)/Programme/Steam/SteamApps/common/ kopieren\r<br />- LM-NimmervollerBeutelDV-Enderal.esp im Skyrim-Launcher aktivieren\r<br />\r<br />Verwendetes Tool: Creation Kit\r<br />\r<br />Lizenz:\r<br />Inhalte dieses Plugin können gerne weiterverwendet werden, allerdings nur mit Credits an alle Beteiligten.\r<br />Es dürfen keine kommerziellen Zwecke damit verfolgt werden.\r<br />\r<br />Danksagung an:\r<br />- Bethesda für dieses wundervolle Spiel und das Creation Kit&#33;\r<br />- Brausebart für die Erlaubnis, seine Skripte des Plugins \r<br />&#34;Abenteuerausstattung&#34; als Vorlage für den Nimmervollen Beutel verwenden\r<br /> zu dürfen und für die sehr guten einführenden Erklärungen bezüglich des\r<br /> Skriptens im CK\r<br />- Snusmumriken für die große Hilfe bei den Skripts und das Testen des Plugins&#33;\r<br />- PlanB für seine &#34;Fixed German Strings&#34;&#33;\r<br />- [b]LilaMue[/b] für die Übernahme des Beutels nach Skyrim\r<br />und natürlich  an [url=http://sureai.net/games/enderal/]SureAI[/url]  für Enderal\r<br />\r<br />\r<br />Viel Spaß mit dem Plugin&#33;         \r<br />eure Stefanie\r<br />\r<br />PS: bisher kleinere bis mitlere Umbauten von und für deutschsprachige Mods, z.B. bei: Morrowind, HDR, Myar Arnath, Arktwend, Oblivion, Nehrim, \r<br />allerdings meist nur im kleineren Kreis veröffentlicht.\r<br />\r<br />sorry, unfortunately I understand very little English",
  "categoryId": "106",
  "version": "1.51",
  "author": "Stefanie",
  "createdUnix": "1471395328",
  "updatedUnix": "1471393195",
  "containsAdultContent": false,
  "uploadedBy": "Stefania",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000217241",
      "name": "Nimmervoller Beutel-Enderal-DV",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33",
      "fileName": "Nimmervoller Beutel-Enderal-DV-77958-.7z",
      "uploadedUnix": "1471393195",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/adcac8baaf7937dd750b0528ef39deff5fa48b8f33254eb374e10c6993fdf77c/analysis/1471393202/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Nimmervoller%20Beutel-Enderal-DV-77958-.7z?fid=1000217241&ttl=1535866608&ri=8192&rs=8192&setec=f32fd2d516c3d8ecfc6841a2d969b0e4"
    }
  ]
}