{
  "modId": 77954.0,
  "modName": "Rune Runner Courier Sprint Cap and Running Shoes",
  "summary": "This mod was create for use in the Rune Runner Skyrim role play series on YouTube but is great for anyone who wants to role play the Courier&#39;s Life&#33;  It adds a blue Sprint Cap and Running shoes to the game that are classified as light armor and include a custom texture.  \r<br />\r<br />In the story, the Bosmer Courier Vander Nightbrook wears",
  "descriptionHtml": "[center][img]http://static1.squarespace.com/static/5439b943e4b0cf5af6b81b79/57b36859e58c62b96dfe539d/57b36888e58c62b96dfe5707/1471375501757/NexusFeatureImages.png[/img][/center]\r<br />\r<br />[size=4]ABOUT THIS MOD[/size]\r<br />In the story, the Bosmer Courier Vander Nightbrook wears these items has part of his Post Haste Delivery Service uniform and their status as Light Armor allows the courier to dress lightly while still taking advantage of many light armor perks. \r<br />\r<br />These items were designed primarily to complete the look of the character who features in my story.\r<br />\r<br />[center][youtube]7udVoOiIBBY[/youtube][/center]\r<br />\r<br />\r<br />[size=4]THE ITEMS INCLUDED[/size]\r<br />The sprint cap is a customized version of the leather cap worn by many NPCs in game. It has been converted to light armor and includes a custom texture to match the blue uniform worn by Vander in the story. The Sprint Shoes are a customized version of the Bar Keep shoes found in the vanilla game. They too are considered light armor, are blue and feature a small wing emblems at the heels.\r<br />\r<br />[center][img]http://static1.squarespace.com/static/5439b943e4b0cf5af6b81b79/57b36859e58c62b96dfe539d/57b3687ee58c62b96dfe5646/1471375489504/SprintShoes.png[/img][/center]\r<br />[center][img]http://static1.squarespace.com/static/5439b943e4b0cf5af6b81b79/57b36859e58c62b96dfe539d/57b36874e58c62b96dfe5570/1471375479690/SprintCap.png[/img][/center][size=4]WHERE TO FIND THE ITEMS[/size]\r<br />Once installed you will be approached by a courier who will give you a welcome letter from Post Haste Delivery Service. Follow the instructions to acquire your new company gear&#33;\r<br />\r<br />[size=4]RECOMMENDED MODS[/size]\r<br />\r<br />TH[size=2]E LOOK[/size]\r<br />To complete Vander&#39;s Rune Runner &#34;LooK&#34; I recommend a few mods:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/27028/?]Armonizer Armor Pack[/url] - by [url=http://www.nexusmods.com/skyrim/users/4932365/?]Ketaroz[/url]\r<br />Included in this excellent mod pack is the Marauder Armor set. I consists of many separate pieces that are used for Vander&#39;s uniform including the distinctive &#34;Short Pants&#34;. The armor is red and white by default and adapted from The Witcher 2 with accessories from Skyrim armors. If you prefer the blue Rune Runner textures, I will be uploading those to Nexus as an alternative very soon.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/5727/?]LOTR Weapon Collection[/url] - by [url=http://www.nexusmods.com/skyrim/users/1232514/?]Isilmeriel[/url]\r<br />Vander&#39;s &#34;Standard Issue&#34; Short Blade is taken from this collection and is the &#34;Sting&#34; short sword. I created my own small mod to only include Sting as I did not want the other weapons in the collection but I recommend just downloading the entire thing. Everything in it is awesome&#33;\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/29624/?]RaceMenu[/url] - by [url=http://www.nexusmods.com/skyrim/users/2950481/?]Expired6978[/url]\r<br />This mod is a must have for Role Players. It allows for very granular controls of your character&#39;s expression, physical stature, skin tone and much much more. This is the tool I use to give Vander is blue hair, sassy expression and smaller than normal size. The possibilities are endless with RaceMenu.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/50032/?]KJ Tattoos[/url] - by [url=http://www.nexusmods.com/skyrim/users/4727757/?]Khajiitas[/url]\r<br />These tattoo overlays for RaceMenu are excellent quality and what I use to create Vander&#39;s distinctive arm tattoos.\r<br />\r<br />[size=2]THE SPEED[/size]\r<br />There is more than one what to accomplish the enhanced speed effect that I am using in my story. If you are using [url=http://www.nexusmods.com/skyrim/mods/59849/?]Perkus Maximus[/url] there are Fortify Speed items available. These are nice in that they only effect your sprint speed. Another alternative is to use something like the[url=http://www.nexusmods.com/skyrim/mods/8160/?] Boots of Nimble Speed[/url] mod which provides fortify speed gear that you can disenchant allowing you to place that enchant on your own shoes.\r<br />\r<br />However, MY RECOMMENDATION is to install [url=http://www.nexusmods.com/skyrim/mods/33395/?]Sky Tweak[/url].  This handy mod will allow you very granular control of just about every aspect of your game right from the MCM menu.  Using Sky Tweak you can adjust your character&#39;s speed multiplier without the need for enchantments.  I recommend a speed multiplier between 130 and 140.  This allows you to feel epic while putting your top speed about even, or slightly below, the fastest deer in the game making for some fun wilderness races&#33;\r<br />\r<br />THE MAGIC\r<br />[url=http://www.nexusmods.com/skyrim/mods/68425/?]Ordinator Perks[/url] of Skyrim - by [url=http://www.nexusmods.com/skyrim/users/3959191/?]EnaiSiaion[/url]\r<br />Not only does Ordinator allow you to focus on Rune Magic more than the Vanilla game, it also provides the &#34;Vancian Magic&#34; option in the Alteration category that will allow you to cast a wider variety of Runes early in the game making you more effective at low levels.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/69474/?]Elemental Destruction Magic[/url] - by [url=http://www.nexusmods.com/skyrim/users/8245919/?]Reaperix[/url]\r<br />Adds additional runes for earth, water and wind. The Sun Rune by Elianora will also add a very cool rune in the restoration category as well. \r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/16225/?]Apocalypse[/url] - by [url=http://www.nexusmods.com/skyrim/users/3959191/?]EnaiSiaion[/url] \r<br />This mod adds some amazing firepower to the Rune Runner&#39;s arsenal with BLOOD, CHAOS, GREEN, MYST, NECRO, SUMMON, TELEKENISES and UNDEAD&#33;\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/68035/?]Rune Magic HD[/url] - by [url=http://www.nexusmods.com/skyrim/users/13341870/?]LemonSquishie[/url]\r<br />\r<br />[size=4]ABOUT THE STORY[/size]\r<br />Rune Runner is the story of a plucky and highly energetic Wood Elf who travels to Skyrim to find his fortune has a well paid and highly specialized courier. Arriving in Skyrim he takes a job for the [url=http://www.nexusmods.com/skyrim/mods/63247/?]Imperial Mail Service[/url] while secretly working for the upstart Post Haste Delivery Service and reporting to a mysterious boss known only as &#34;M&#34;.\r<br />\r<br />Racing across an unfamiliar and inhospitable Skyrim, Vander struggles to make his deliveries on time while, running from bandits, meeting new friends and fighting to control his inescapable curiosity. Rune Runner is a fun and light hearted Skyrim adventure filled with fun, humor, custom mods, experimentation and deep story. This tale is 100% ROLE PLAY&#33; \r<br />\r<br />If it sounds interesting you, you can check it out on the [url=https://www.youtube.com/playlist?list=PLq3QdWvJDnh2jr2H5_IPCSJYw4wwaP8SC]Couch Warrior TV YouTube channel[/url].\r<br />\r<br />[size=4]INSTALLATION[/size]\r<br />I recommend using a mod manager for installation. This mod includes a custom textures and an .esp file.\r<br />\r<br />-------------------------------------------------\r<br />\r<br />CHECK OUT CHARACTER CRUSADE SKYRIM PODCAST - [url=http://www.charactercrusade.com]www.charactercrusade.com[/url]\r<br />Skyrim, role play and character craft all in one great biweekly podcast. Interviews with Skyrim Fans, writers, modders and Let&#39;s Players.",
  "categoryId": "54",
  "version": "1.0.0.0",
  "author": "couchwarriortv",
  "createdUnix": "1471482596",
  "updatedUnix": "1471474052",
  "containsAdultContent": false,
  "uploadedBy": "couchwarriortv",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000217358",
      "name": "CW Mods - Rune Runner Sprint Cap and Shoes",
      "version": "1.0.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "227",
      "fileName": "CW Mods - Rune Runner Sprint Cap and Shoes-77954-1-0-0-0.zip",
      "uploadedUnix": "1471474052",
      "modVersion": "1.0.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/f94533a52d6b6ae92b99dac1266c51ca42ddb27c2d5e83a2c09e2dffe0ee7eab/analysis/1471474082/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CW%20Mods%20-%20Rune%20Runner%20Sprint%20Cap%20and%20Shoes-77954-1-0-0-0.zip?fid=1000217358&ttl=1535866604&ri=8192&rs=8192&setec=aeb1b38920d7dde96a45758a07db4ac0"
    }
  ]
}