{
  "modId": 78016.0,
  "modName": "Strategic Arrows Magic and Venom.",
  "summary": "Arrow damage, speed, and trajectory varies on arrow type. More lethal frostbite Venom, Spiders, and Charrus. Vanilla spells have been greatly changed in terms of added side effects, charge times, damage, and overall use. (Fire burns for a long time and has highest damage potential, ice can immobilize, lightning can launch players/enemies far away!)",
  "descriptionHtml": "You ever find yourself firing various arrows and realizing the difference in their strength is insane? An arrow is an arrow!\n<br />You ever use magic and find higher level humanoids shrugging them off and wish the vanilla spells were better?\n<br />Do you laugh every time a frostbite spider attacks you?\n<br />\n<br />This mod does 5 things\n<br />\n<br />*Arrow types are now split into 3 distinct damage ranges. 20 damage, 25 damage, and 30 damage. I get that a daedric arrow is better than a rusted arrow, but let's be for real... the damage should be mostly based on the quality of bow. Besides its fun to play the game where arrows are terrifying to take cover from and avoid. You gain too many levels, you can stand there and take a full quiver and laugh at your opponent. Enough of that! If you're not dodging, blocking, or taking cover from arrows you are Dead!\n<br />\n<br />*Various arrows have different range, trajectories, and speed! \n<br />\n<br />*Sure other magic mods are better and crazier, but did you wish vanilla spells were devastating in both your hands and the enemies? Standard spells now cause longer burn damage, better slow down, lightning disarm effects, various charge times, knock back effects, and much more. If you are a sword swinging warrior without any means of magic defense, now you must fear a spell caster or carry arrows on you. Some opponents may constantly knock you back with lethal spells and now your follower is your only means of escape! Vanilla Magic is truly terrifying now, but now have variously longer charge up times.\n<br />\n<br />*Frostbite spider venom. Venom is lethal... not some laughable early game poison.\n<br />\n<br />*Both Frostbite Spiders and the Charrus have toxic that will kill you if you are not careful. their bite and spit is now the thing of nightmares. No longer will fighting these monsters feel like a meaningless task of squashing bugs. Carry lots of cure poison or die!\n<br />\n<br />DOWNLOAD NOTES: It is easier to download the file manually and drag the file to the C:&#92;Users&#92;Program files x86 &gt; Steam &gt; Steam Apps &gt; \n<br />Common &gt; Skyrim &gt; Data &gt;",
  "categoryId": "55",
  "version": "2.0",
  "author": "Commandercoldz",
  "createdUnix": "1471564051",
  "updatedUnix": "1477137433",
  "containsAdultContent": false,
  "uploadedBy": "commandercoldz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000225172",
      "name": "Strategic Magic and Arrows and Spiders",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Strategic Magic and Arrows and Spiders-78016-2-0.rar",
      "uploadedUnix": "1477137433",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/57f8707fa76a2061e56d2874ced6912dec9c4489e5f8f7c1ca4a26d9fdeef984/analysis/1477137493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Strategic%20Magic%20and%20Arrows%20and%20Spiders-78016-2-0.rar?fid=1000225172&ttl=1535866670&ri=8192&rs=8192&setec=9ddd326eecf1c2096ddf1b89e1e66c4a"
    }
  ]
}