{
  "modId": 78028.0,
  "modName": "Hearthfire Extended - French",
  "summary": "The essential expansion for Hearthfire.\r<br />\r<br />New content for the Hearthfire DLC, integrated seamlessly with Hearthfire&#39;s construction system. Build any furniture in any room. Build additional wings off your cellar. Also includes bugfixes and enhancements to vanilla apiaries, butter churns and mead barrels.",
  "descriptionHtml": "[size=3][b]Hearthfire Extended[/b] adds all the little things that really should have been part of the official DLC. It also adds some new, lore-friendly functionality to each homestead, perfectly integrated with Hearthfire&#39;s construction system. \r<br />Hearthfire Extended allows you to build and place furniture anywhere, not just homesteads. Vanilla player homes and mod-added player homes can be customised too. Provided you have the Hearthfire DLC, this mod is perfect for any playthrough.\r<br />If you&#39;ve ever wondered why the butter churn is a plant, or what apiaries were even meant to do, then this mod is for you. If you&#39;ve never built a Hearthfire home before, install this mod and you won&#39;t be able to tell what&#39;s from the mod and what&#39;s vanilla.[/size]\r<br />[size=3]\r<br />With Hearthfire Extended installed, you&#39;ll be able to customise your home to whatever design you want. You can build any furniture in any room, build new rooms for your cellar, hire new types of servant for your homestead and hire guards to protect it. You&#39;ll also be able to brew mead, milk cows, build a well and much more. Have a look at the images tab to see what other users have created, and feel free to submit your own screenshots.\r<br />\r<br />I&#39;ve been careful to extensively research any lore related to each feature and test repeatedly for stability.\r<br />Install this mod at any time in a playthrough, the [b]new stuff won&#39;t be there until you build it yourself[/b].\r<br />\r<br />[i]What makes this mod different from other Hearthfire mods is that it seeks to stay true to the original concept of the Hearthfire DLC - customisation. [b]You [/b]decide what you want at your homestead. You can design rooms however you want to. If you&#39;re looking to make Hearthfire into a one-click player fortress that&#39;s already completed for you, you&#39;re in the wrong place.[/i]\r<br />\r<br />[/size][color=#ffcc33][size=6]Features[/size][/color]\r<br />\r<br />[size=4][b][u]Furniture crafting[/u][/b][/size]\r<br />[size=3]A special new carpenter&#39;s workbench allows you to make furniture that you can place anywhere. You can build this workbench in your basement, craft one at the regular workbench outside your homestead to place anywhere, or find one in the warehouses in Windhelm and Riften.[/size]\r<br />\r<br />[size=3]Most of the furniture you can build with Hearthfire is available to craft via this method, in common, upper and noble styles. Make tables, chairs, alchemy labs, arcane enchanters, ovens, churns, braziers, cookpots and more. You can even craft more new carpenter&#39;s workbenches to bring to mod player homes or vanilla homes so that you can make new furniture on location.\r<br />\r<br />Rugs can be placed the same way, but they cannot be crafted. Instead, you can purchase them from general goods merchants and Khajiit Caravans.\r<br />[/size]\r<br />[size=2][i]Placeable furniture is not suitable as a replacement for all default Hearthfire furniture. Unless you build the bedroom wing, two child beds, two child chests and a double bed for you and your spouse, you will not be able to move your family into the home. This may be changed in a future update.\r<br />\r<br />Placing furniture is done by clicking the inventory item or by dropping it (pressing &#39;r&#39;). Fine tuning position or removing placed furniture requires either a placement mod or use of the console (getpos, setpos and markfordelete). I recommend [url=http://www.nexusmods.com/skyrim/mods/52583/]Jaxonz Positioner[/url], but there are other alternatives available. Some furniture can&#39;t be moved by Jaxonz Positioner, so I recommend saving before redecorating in case you end up with a brazier stuck in the middle of a doorway for the rest of your playthrough. There&#39;s a list of what&#39;s affected at the bottom of the page under &#39;complex furniture&#39;.[/i][/size]\r<br />\r<br />[size=4][b][u]Expanded Cellar[/u][/b][/size]\r<br />[size=3]Choose from just one extra room or a hallway leading to two other wings. With a choice of 5 different room designs, and more still to come, there&#39;s definitely one to suit every playthrough:[/size]\r<br />[size=3] - Main hall with desk, shelves and a choice of alchemy lab or arcane enchanter[/size]\r<br />[size=3] - Brewery with brewers and barrels (North wing)[/size]\r<br />[size=3] - Torture chamber with racks, shackles and cages (North wing)[/size]\r<br />[size=3] - Vampire lair with thralls and a hireable thrallmaster to manage the operation (South wing)[/size]\r<br />[size=3] - Training room with archery targets, training dummies and some trophy and display cases (South wing)[/size]\r<br />[size=3]And if you can&#39;t find the perfect option, remember you can always design the rooms yourself by placing furniture manually&#33;[/size]\r<br />[size=2][i]\r<br />If you&#39;d rather use the extended cellar from a different mod, or if you&#39;re using a mod that extends the cellar and you&#39;re worried about conflicts, read the instructions at the bottom of the description. This is very easy to fix.\r<br />[/i][/size]\r<br />[b][u][size=4]Apiaries[/size][/u][/b]\r<br />[size=3]Apiaries are no longer a container. They can be harvested once a day for honey. Once you&#39;ve taken the honey, you can harvest them again for some honeycomb or maybe some bees. You only need to take the honey for the respawn timer to start. If you go near an apiary you&#39;ll hear the buzzing of bees, and you may see some flying around too.[/size]\r<br />\r<br />[size=3]All of the Hearthfire homes can now have an apiary. Lakeview Manor gets an extra two as its bonus.[/size]\r<br />\r<br />[size=4][u][b]Butter churns[/b][/u][/size]\r<br />[size=3]Butter churns now convert milk into butter. Because that&#39;s how they work in real life. Not sure what the plant thing was about...[/size]\r<br />\r<br />[size=4][u][b]Cows[/b][/u][/size]\r<br />[size=3]You can now milk cows. Just walk up to one and press &#39;activate&#39;. You&#39;ll probably need this feature if you want to keep using your new butter churn. Painted cows and dead cows can&#39;t be milked.[/size]\r<br />\r<br />[size=4][u][b]Brewing[/b][/u][/size]\r<br />[size=3]Those useless mead barrels in your basement finally have a purpose. You can brew ale and mead in them, including many of the mead variants. To keep it lore-friendly and realistic, only certain drinks are brewable. I&#39;ve also gone to the trouble of extensively researching each drink to try to simulate their recipe as best I can. You can see the list of recipes further down the page. If you have an idea for another recipe then let me know about it. If you want to add the ability to brew new drinks added by your own mod, watch out for the modder&#39;s resource.[/size]\r<br />\r<br />[size=4][u][b]Windmills[/b][/u][/size]\r<br />[size=3]All of the Hearthfire homes can now have a grain mill. Heljarchen Hall gets a full size windmill as its bonus. If you want to build the windmill, I recommend getting [url=http://www.nexusmods.com/skyrim/mods/8655/]SMIM[/url] and [url=http://www.nexusmods.com/skyrim/mods/40564/]SkyMills[/url] to make it a bit nicer looking.\r<br />[/size]\r<br />[size=4][b][u]Wells[/u][/b][/size]\r<br />[size=3]You can now build a well at your Hearthfire home (Lakeview Manor and Heljarchen Hall only, Windstad Manor will be added soon). Compatible with iNeed and RND.\r<br />[/size][i]Please note that this mod does not conflict with needs mods, the patch merely exists to allow you to use the well to fill your waterskins and bottles.[/i]\r<br />[size=3](Credit to [/size][url=http://www.nexusmods.com/skyrim/users/6224624]detpak[/url][size=3] for the idea)[/size]\r<br />\r<br />[size=4][b][u]Servants[/u][/b][/size]\r<br />[size=3]Talk to your steward about hiring servants. There are three unique servants available for each home. They will busy themselves inside and outside the house, using vanilla dialogue. The laborer will make building materials and, at Lakeview Manor, offer to remove the necromancy altar for you if you want. The servant will look after the farm and give you some produce each day. The cook will offer you several food items each day.\r<br />[/size]\r<br />[size=4][b][u]Guards[/u][/b][/size]\r<br />[size=3]Hire guards for your house. Each guard is a unique[/size][size=3]ly designed NPC, but none are overpowered. They use a variety of different fighting styles. They will patrol the house in shifts. If you&#39;re a vampire, you&#39;ll be able to hire vampire guards for your home. You can also hire a thrallmaster who will arrange for some vampire thralls to patrol your home.\r<br />[/size][size=2](Guard NPCs were made by [url=http://forums.nexusmods.com/index.php?/user/5718878-theobstinatenovicesmith/]TONS[/url], featuring additional faces by [url=http://www.nexusmods.com/skyrim/users/4209270]Visdagon[/url], vampire idea by [url=http://www.nexusmods.com/skyrim/users/4723298]AEscraed[/url])[/size]\r<br />\r<br />[size=4][b][u]More Plantables[/u][/b][/size]\r<br />[size=3]Plant Jarrin root and food and ingredients from the Dragonborn and Dawnguard DLCs in the hearthfire planters.[/size]\r<br />\r<br />[size=4][b][u]Roads[/u][/b][/size]\r<br />[size=3]Build a road at your homestead. Currently only Lakeview Manor. Loosely based on the original &#34;Lakeview Manor Road&#34; by [url=http://www.nexusmods.com/skyrim/users/1720648]themadpickler[/url].\r<br />\r<br />[size=4][b][u]Loading screens[/u][b][b] - [color=#00ffff]New&#33;[/color][/b][/b][/b][/size]\r<br />[size=3]Of Skyrim&#39;s 319 loading screens, only 4 are related to Hearthfire. Hearthfire Extended adds 4 new screens explaining some of Hearthfire&#39;s core features as well as features added by the mod.[/size][/size]\r<br />\r<br />[color=#ffcc33][size=6]Extra features[/size][/color]\r<br />\r<br />[size=2][i]These features involve editing cells outside of Hearthfire. I&#39;ve kept the edits as light as possible, so there shouldn&#39;t be conflicts even if you already have a mod that edits one of these areas. If you find a conflict, report it in the bugs section so I can release a patch or guide you through fixing it. Any of these features can easily be removed using tes5edit\r<br />[/i][/size]\r<br />[size=4][u][b]Hearthfire features for the original player homes[/b][/u][/size]\r<br />[size=3]The garden of Honeyside in Riften now has some Hearthfire planters and an apiary.[/size]\r<br />[size=3]The planters in the entrance to Vlindrel Hall in Markarth now use the Hearthfire planting system. If you purchase the alchemy upgrade, you get a brewing barrel too.[/size]\r<br />[size=3]Hjerim gets a brewing barrel when you purchase the kitchen upgrade.\r<br />[/size][i]If you&#39;re using a mod that overhauls one of these houses, Hearthfire Extended should still be fully compatible. However, if you want to remove Hearthfire Extended&#39;s changes, you can do so using tes5edit.[/i]\r<br />\r<br />[size=4][u][b]Bugfix for farm windmills[/b][/u][/size]\r<br />[size=3]Hearthfire added activators to windmills at farms so that you could use them to convert wheat into flour. Unfortunately, Bethesda put the activator in a place where it physically could not be reached. This mod fixes that issue. This issue has not been fixed by any other mod that I am aware of, including the unofficial patches.\r<br />[/size]\r<br />[size=4][u][b]Apiaries for Honningbrew Meadery, Black-Briar Manor and Thirsk Mead Hall (Dragonborn)[/b][/u][/size]\r<br />[size=3]Sabjorn always talks about how he only uses the finest honey to make mead. But where is he getting it from? This mod adds three apiaries to the back of Honningbrew Meadery. There&#39;s also a few new apiaries outside Black-Briar Manor, since they can&#39;t possibly source all of their honey from Goldenglow. And w[/size][size=3]here do the Nords get the honey to brew their own Ashfire Mead? This mod adds apiaries to the small wooded area next to Thirsk Mead Hall.[/size]\r<br />\r<br />[size=4][b][u]Distributed new furniture[/u][/b][/size]\r<br />[size=3]All of the farms in Skyrim that own a cow will now have a churn nearby. Most are inside the farmhouses, but some are in other outbuildings.\r<br />[/size][size=3]Riften warehouse and Windhelm warehouse now have furniture workbenches.\r<br />[/size][size=3]Jorrvaskr, The Ragged Flagon and Thirsk Mead Hall (Dragonborn) now have brewing barrels.[/size]\r<br />\r<br />[size=4][b][u]Cutting Room Floor - Optional Patch[/u][/b][/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/47327/][size=3]Cutting Room Floor[/size][/url][size=3] adds a new meadery with apiaries. This patch replaces those apiaries with the new improved ones. I highly recommend Cutting Room Floor - the content it adds was originally made by Bethesda.[/size]\r<br />[i][size=2]Please note that this mod does not conflict with CRF, the patch merely exists to replace the new apiaries.\r<br />[/size][/i]\r<br />[color=#ffcc33][size=6]Coming soon:[/size][/color]\r<br />[i]I&#39;ve already started work on these features, so they&#39;re guaranteed to appear in an upcoming version of the mod.\r<br />[/i]\r<br />[size=4][u][b]Extra Hearthfire buildings expansion pack[/b][/u][/size]\r<br />[size=3]Buy land in different parts of Skyrim and build new homes there. They use the Hearthfire construction system, but take on a variety of styles ranging from simple cabins to windmills and castles.[/size]\r<br />\r<br />[size=3][i]This feature was held up due to problems with .nif editing and time constraints. If you know of a good Nifscope tutorial please let me know. If you are a Nifscope pro and want to do some of the required models, that would be awesome.[/i][/size]\r<br />\r<br />[b][u][size=4]Fish Hatchery for Lakeview Manor[/size][/u][/b]\r<br />[size=3]Build a fish hatchery down at Lake Ilinata, if you want. Works the same as the one at Windstad Manor.[/size]\r<br />\r<br />[b][u][size=4]Lore-friendly food and drink expansion pack[/size][/u][/b]\r<br />[size=3]An optional add-on that includes new foods, beverages, and recipes for the brewing barrel, cookpot and oven.[/size]\r<br />\r<br />[size=4][u][b]Modder&#39;s Resource[/b][/u][/size]\r<br />[size=3]The modder&#39;s resource includes the required scripts for linking seamlessly with the Hearthfire construction system. Your mod could be anything from a new piece of furniture for Windstad Manor to a complete new player home. It will also allow you to add the new apiaries, churns and brewing barrels to your own mods, and add beverage recipes to the brewing system.[/size][size=3]\r<br />[/size][i][size=3]This feature is still a WIP. I intend to create a complete tutorial to accompany it.[/size]\r<br />\r<br />[/i]\r<br />[color=#ffcc33][size=6]Features I&#39;m considering:[/size][/color]\r<br />\r<br />[i]These are features I&#39;m not sure about including yet. If there&#39;s something here you really want to see, you can let me know on the posts tab. Some of these features are here because I&#39;m not sure how to implement them yet or because I&#39;m not sure whether including them in this mod is a good idea.[/i]\r<br />\r<br />[size=4][u][b]More adoptable children[/b][/u][/size]\r<br />[size=3]New orphan children to adopt. Multiple adoption functionality would be included. The children would be based on RSChildren overhaul, but the mod itself would not be a requirement. If you already use another multiple adoption mod, don&#39;t worry - it won&#39;t conflict with mine.\r<br />\r<br />[/size][size=4][u][b]Something Else?[/b][/u][/size]\r<br />[size=3]I&#39;m still taking feature requests. If there&#39;s something you feel Hearthfire is missing, head on over to the posts tab and let me know about it.[/size]\r<br />\r<br />[color=#ffcc33][size=5]Things I won&#39;t be doing:[/size][/color]\r<br />[size=3]\r<br />[/size][list]\r<br />[*][size=3]Anything that isn&#39;t lore-friendly.[/size]\r<br />[*][size=3]Anything unrealistic or ridiculous.[/size]\r<br />[*][size=3]Anything that goes too far and makes the homestead into a city.[/size]\r<br />[*][size=3]Anything that would require terrain edits or big edits. I want to keep this mod light and compatible with everything.[/size]\r<br />[*][size=3]Adding new furniture to the game. You can suggest recipes for vanilla furniture I may have missed though.[/size]\r<br />[*][size=3]Adding recipes for furniture from other mods. It is up to the author of the other mod to do this, or you can do this yourself.[/size]\r<br />[*][size=3]A wall. This would cause pathing issues. I know other mods do it, and I don&#39;t recommend using them.[/size]\r<br />[*][size=3]Recipe for weapon racks, until I find a way to fix them and stop them from eating weapons added to them (vanilla bug).[/size]\r<br />[*][size=3]Editing original Hearthfire mechanics. I&#39;d love to do this, but it&#39;s simply not possible. Bethesda have not provided the source code to the majority of Hearthfire scripts, so there&#39;s no way to see what&#39;s going on. Everything added by this mod is based on my own framework which replicates Hearthfire.[/size]\r<br />[/list]\r<br />[color=#ffcc33][size=5]Brewing Recipes:[/size][/color]\r<br />\r<br />[size=3]2 Ale - 4 wheat[/size]\r<br />[size=3]2 Nord Mead - 1 honey[/size]\r<br />[size=3]2 Honningbrew Mead - 2 green apples, 1 honey [/size][i][size=2](This is likely a cyser, which is made with green apples in real life)[/size][/i]\r<br />[size=3]2 Mead with Juniper Berry - 2 Juniper berry, 1 honey[/size]\r<br />[size=3]2 Dragon&#39;s breath mead - 2 Dragon&#39;s tongue, 1 honey[/size]\r<br />[size=3]Cliff racer - Flinn, Sujamma, Firebrand Wine and Cyrodilic Brandy [/size][size=2](From Talen-Jei&#39;s speech)[/size]\r<br />[size=3]White-Gold Tower - Milk, Dragon&#39;s tongue, mead and lavender [/size][size=2](From Talen-Jei&#39;s speech)[/size]\r<br />[size=3]2 Ashfire Mead - 1 Juniper berry, 1 ashen grass pod, 1 honey [/size][i][size=2](Juniper berry is explicitly mentioned by Elmus, ashen grass pod is based on spice pods used by the vikings in real life)\r<br />[/size][/i][size=3]\r<br />Ashfire Mead and Cliff Racer require the Dragonborn DLC\r<br />Ashfire Mead also requires the completion of &#34;Retaking Thirsk&#34; for the Nords[/size]\r<br />\r<br />[color=#ffcc33][size=5]Contributors:[/size][/color]\r<br />[size=3]\r<br />Beta testing - [url=http://www.nexusmods.com/skyrim/users/840127]Kursan[/url], [url=http://www.nexusmods.com/skyrim/users/8050206]fanuilh1[/url], [url=http://www.nexusmods.com/skyrim/users/4306486]Neshotah76[/url], [url=http://www.nexusmods.com/skyrim/users/21018464]Valestris[/url]\r<br />Ideas - [url=http://www.nexusmods.com/skyrim/users/13341870]LemonSquishie[/url], [/size][size=3][url=http://www.nexusmods.com/skyrim/users/6224624]detpak[/url], [/size][size=3][url=http://www.nexusmods.com/skyrim/users/4723298]AEscraed[/url], [url=http://www.nexusmods.com/skyrim/users/15792944]ArannorTreeStrider[/url][/size]\r<br />\r<br />[color=#ffcc33][size=6]Technical information:[/size][/color]\r<br />\r<br />[size=3]Cleaned with TES5EDIT. No bad records. No further cleaning required.\r<br />Relevant fixes from USKP forwarded. USKP is however not a requirement.\r<br />(While LOOT recognises that the mod is clean, cleaning with tes5edit actually does remove one record. This record is required for steward dialogue to function correctly, so I don&#39;t recommend you do this.)\r<br />[/size][size=3]This file shares some scripts with my other mod, [url=http://www.nexusmods.com/skyrim/mods/68221/]Complete Fast Travel Overhaul[/url]. Allow them to overwrite each other, the scripts are identical.[/size]\r<br />\r<br />[u][b][size=4]A note on compatibility[/size][/b][/u]\r<br />[size=3]This mod is designed to be lightweight and compatible with anything. This includes other mods that edit Hearthfire. However, because some other Hearthfire mods make huge changes to terrain, navmesh and layout, you may experience some unexpected results. These are not conflicts and will not cause crashes, they are merely cosmetic issues. For example, if another mod changes terrain this may result in new structures from this mod floating in the air.\r<br />The other cells edited by this mod are specifically chosen because other mods rarely edit them, for example farmhouse interiors. The changes made to them are so small that even if another mod does edit the same cell, it is extremely unlikely that there will be an incompatibility.\r<br />If you use any other Hearthfire mods alongside Hearthfire Extended, I&#39;d really appreciate it if you let me know what the situation is. However, please understand that I&#39;m spending a lot of time implementing exciting new features, and I&#39;m not going to waste any time making my mod compatible with other mods that defeat the purpose of what I&#39;m trying to achieve here. If a mod expands Hearthfire by doing everything for you and making massive changes to the world, I wonder why you&#39;re looking here anyway. If a mod expands Hearthfire in a lightweight, player-customisable, clean way as I have, then a patch shouldn&#39;t even be required.\r<br />[i]If a mod admits to breaking Hearthfire&#39;s construction system in its description (usually by saying &#34;install this mod after you have completely built your house and are happy with it&#34;) then it may well break my mod too. And there&#39;s nothing I can do about that.[/i][/size]\r<br />\r<br />[size=4][u][b]Complex Furniture[/b][/u][/size]\r<br />[size=3]Complex furniture can&#39;t be moved by Jaxonz Positioner, so you&#39;ll have to just place it in the right place first time. I recommend saving, placing the item, loading the earlier save and adjusting if necessary, then trying again. The following are considered complex furniture:\r<br /> - Braziers, firepits, fireplaces, candles (anything with fire or light attached)\r<br /> - Cookpot on stand, fireplace cookpot (cookpot without stand and fire spit should be ok)\r<br /> - Trophy bases cannot be moved once a trophy has been built on them\r<br />[/size]\r<br />[size=4][u][b]Extended cellar conflicts[/b][/u][/size]\r<br />[size=3]If you&#39;re planning on running another mod that edits homestead cellars alongside Hearthfire Extended, pick the cellar you want to keep and remove the cellar from the other mod using tes5edit. This is a very simple task, and is fully explained below. If there&#39;s anything here you don&#39;t understand, leave a comment and I can help you out.[/size]\r<br />\r<br />[i]It&#39;s best not to use the console for this. [/i][i]If you already tried to fix this using the console, go back to an earlier save from before you tried to use the console if possible, because it&#39;s likely you&#39;ve broken something by even trying to use the console. As a general rule, the console should not be used to fix mod compatibility issues (beyond disabling references that clip).[/i]\r<br />[size=3]\r<br />If you want to keep Hearthfire Extended&#39;s basement, open the other cellar mod in tes5edit and navigate to:\r<br /> - Cell -&gt; Block 5 -&gt; Sub-Block 0 and right click &#34;BYOHHouse1FalkreathBasement&#34;            (for Lakeview Manor)\r<br /> - Cell -&gt; Block 6 -&gt; Sub-Block 5 and right click &#34;BYOHHouse2HjaalmarchBasement&#34;         (for Windstad Manor)\r<br /> - Cell -&gt; Block 7 -&gt; Sub-Block 5 and right click &#34;BYOHHouse3PaleBasement&#34;                   (for Heljarchen Hall)\r<br />and click &#34;Remove&#34; (NOT remove filter). There will be a scary warning message, select &#34;Yes I&#39;m absolutely sure&#34;.\r<br />\r<br />If you want to keep the other cellar mod&#39;s basement, open hearthfireextended.esp in tes5edit and navigate to:\r<br /> - Cell -&gt; Block 5 -&gt; Sub-Block 0 -&gt; &#34;BYOHHouse1FalkreathBasement&#34;            (for Lakeview Manor)\r<br /> - Cell -&gt; Block 6 -&gt; Sub-Block 5 -&gt; &#34;BYOHHouse2HjaalmarchBasement&#34;         (for Windstad Manor)\r<br /> - Cell -&gt; Block 7 -&gt; Sub-Block 5 -&gt; &#34;BYOHHouse3PaleBasement&#34;                   (for Heljarchen Hall)\r<br />Right click &#34;Persistent&#34; and click &#34;Remove&#34; (NOT remove filter). There will be a scary warning message, select &#34;Yes I&#39;m absolutely sure&#34;.\r<br />Then open &#34;Temporary&#34; and remove all references under it except for:\r<br /> - &#34;BYOHMeadBarrel&#34; (there should be two of these)\r<br /> - &#34;KmodCraftingMeadBarrelSmall&#34; (there should also be two of these)\r<br />These should be the 8-10th references from the top of the list. You can use shift click to select and remove multiple references at once.[/size]\r<br />[i]Keeping these 4 references allows you to keep the new brewing barrels. However, if you don&#39;t mind losing the brewing barrels, or if the cellar mod you intend to use makes layout changes to the cellar in such a way that the brewing barrels would be in the wrong place, you can just remove the entire reference to &#34;BYOHHouse1FalkreathBasement&#34; or equivalent. You can always place new brewing barrels somewhere else by using the furniture crafting system.\r<br />[/i]\r<br />[size=4][u][b]Using apiaries[/b][/u][/size]\r<br />[size=3]The first time you activate an apiary you are given honey. A timer starts.[/size]\r<br />[size=3]Activating an apiary subsequent times gives honeycomb or a bee. The timer does not reset as a result of further activations.[/size]\r<br />[size=3]After 24 hours, the apiary resets and will give honey again when activated.[/size]\r<br />\r<br />[size=4][u][b]Hearthfire Lighting Mods[/b][/u][/size]\r<br />Most lighting overhauls (ELFX, RLO etc) don&#39;t improve Hearthfire at all, so you&#39;ll need a separate mod to make Hearthfire interiors look as nice as the rest of Skyrim. Here&#39;s the two main ones I recommend:\r<br />\r<br />[size=3][url=http://www.nexusmods.com/skyrim/mods/60637/]Improved Hearthfire Lighting[/url][/size]\r<br />This mod adds lights that are linked to furniture sets in the homestead. For example, unless you build the table in the bedroom wing, the room will be dark because the candle sitting on the table is required to light up the room. If you&#39;re going to build a regular Hearthfire home and only use the furniture crafting system to customise some things (or not use it at all), this is what I recommend. It makes the interior look very nice, all of the lights are shadow casting.\r<br />\r<br />[size=3][url=http://www.nexusmods.com/skyrim/mods/29020/]Hearthfire Homes - Interior lighting for ENB[/url][/size]\r<br />Despite the name, you don&#39;t need an ENB for this. It adds generic light to the entire interior. Regardless of what you build and where, your entire homestead will be fully lit up. If you&#39;re intending to design your home using the furniture crafting system, this is a better choice. However it doesn&#39;t look as nice IMO. Because the whole interior is filled with light, there are no shadows.\r<br />\r<br />[u][b][size=4]Other mods I recommend you use alongside Hearthfire Extended\r<br />[/size][/b][/u][url=http://www.nexusmods.com/skyrim/mods/68221/]Complete Fast Travel Overhaul[/url] (Also by me) - Allows you to build a jetty and hire a ferryman. Includes a patch for Hearthfire Extended.\r<br />[url=http://www.nexusmods.com/skyrim/mods/55555]RS Children Overhaul[/url] - Makes children less... generic\r<br />[url=http://www.nexusmods.com/skyrim/mods/60637/]Improved Hearthfire Lighting[/url] - Makes Hearthfire interiors beautiful, something most lighting mods miss\r<br />[url=http://www.nexusmods.com/skyrim/mods/2356/]XCE[/url], [url=http://www.nexusmods.com/skyrim/mods/36510]Superior Lore-Friendly Hair[/url], [url=http://www.nexusmods.com/skyrim/mods/28363]Beards[/url] and [url=http://www.nexusmods.com/skyrim/mods/30411/]Brows[/url] - Improved character textures and meshes featured in screenshots\r<br />[url=http://www.nexusmods.com/skyrim/mods/47327/]Cutting Room Floor[/url] - Adds Bethesda&#39;s cut content. Use it with the patch included in this mod.\r<br />[url=http://www.nexusmods.com/skyrim/mods/32309/]HD Noble Furniture[/url] - Improved textures for the noble furniture set used by Hearthfire\r<br />[url=http://www.nexusmods.com/skyrim/mods/65185]Servants Sort Loot[/url] - Allows Hearthfire Extended servants to sort loot, and adds new servants\r<br />\r<br />[i]If you want to uninstall this mod, make sure to wait at least 24 hours from when you last milked a cow or harvested an apiary. Remove hearthfireextended.esp and all scripts beginning with kmod. Also please leave a comment and let me know what I can do to improve the mod.[/i]",
  "categoryId": "79",
  "version": "1.0.3",
  "author": "Kinaga",
  "createdUnix": "1471591941",
  "updatedUnix": "1471591941",
  "containsAdultContent": false,
  "uploadedBy": "Kinaga",
  "primaryFile": null,
  "files": []
}