{
  "modId": 78045.0,
  "modName": "True Elk of Skyrim -TEOS v.3 for Enderal - DELETED",
  "summary": "Updated True Elk of Skyrim or TEOS v.3 Mesh for Enderal. Enderal already uses TEOS v.2 mesh for the Male Elk, so this gives it the new mesh. ",
  "descriptionHtml": "While probing through the meshes of Enderal, I always open mod files and have to look inside, I found that they used my True Elk of Skyrim v.2 or TEOS v.2 Male Elk mesh. As I have yet to get the game/mod started for myself, I have decided to use it as a means of bringing the TEOS v.3 Male Elk mesh out ahead of schedule and share it with everyone playing Enderal. The full TEOS update is still being worked on, allot of new meshes are being made and allot of new deer being added so it is taking time. That and working on another mod for that other Bethesda game. There is no reason you can&#39;t use this in Skyrim as the locations for the Elk meshes are the same for both Skyrim and Enderal. Just be aware that this only replaces one single mesh, the male elk mesh and will not contain anything else that is in the full TEOS v.3 mod when it comes out. I did look through and verified that Enderal doesn&#39;t use any other TEOS meshes so it is just the one mesh for now. You can treat it as a beta test of the mesh if you like. For those that have been following my posts on the TEOS mod page this is the male elk mesh with the properly proportioned antlers, not the overly large ones. So this is in fact a pre-release of the real TEOS v.3 mesh many have been waiting a long time for. \r<br />\r<br />I have been in touch with SureAI team and they do have my permission to roll this into the main mod itself so this may not be needed after a few updates have been made to Enderal. I will leave it up for those that want to use it in Skyrim for the time being. There is simply no way to make it an Enderal exclusive anyway. \r<br />\r<br />This will not overwrite the mesh included in Enderal, it will instead add the appropriate folder structure in order to over-ride the use of the mesh that came with Enderal. That way if there is any problem, uninstalling it will not effect Enderal at all. \r<br />\r<br />On a final note, if you are presently playing Enderal and use this mod and come across them in game, please take a few pictures of them so I can add them to images section. Since I have yet to get started on the game I don&#39;t have any in game pictures yet. \r<br />\r<br />I hope everyone enjoys the new Elk mesh and Have Fun.",
  "categoryId": "106",
  "version": "beta1",
  "author": "Impulseman45",
  "createdUnix": "1471674123",
  "updatedUnix": "1471673778",
  "containsAdultContent": false,
  "uploadedBy": "Impulseman45",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000217632",
      "name": "TEOS 3 for Enderal",
      "version": "beta1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "155",
      "fileName": "TEOS 3 for Enderal-78045-beta1.7z",
      "uploadedUnix": "1471673778",
      "modVersion": "beta1",
      "virusScanUrl": "https://www.virustotal.com/file/e2dbbf40aa9ea3e83219fb398283bd37396680cded08df255a7dafaa4ed62ef7/analysis/1471673822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TEOS%203%20for%20Enderal-78045-beta1.7z?fid=1000217632&ttl=1535866699&ri=8192&rs=8192&setec=f9d2d3a85222291d254335cdf8dc8b69"
    }
  ]
}