{
  "modId": 78074.0,
  "modName": "Hearthfire No Material Requirements",
  "summary": "A very basic mod that just removes the material requirements for building a house for the Hearthfire DLC.",
  "descriptionHtml": "A word of warning: This is my first mod ever uploaded to the Nexus.  I&#39;m pretty new to this so there might be some unexpected issues.  I have no idea how removing these requirements could affect other things, but I suspect that they shouldn&#39;t since they only affect Hearthfire things.  Swords, armor and other things should be untouched.  If any issues arise I&#39;ll try my best to resolve them, but I can&#39;t promise anything.  The testing I did for this mod was fully build two houses and completely furnish them.  As usual with mods, download at your own risk, and backup your saves.\r<br />\r<br />Building a house in the Hearthfire DLC can be a very tedious process with having to collect materials, building something, and then having to collect even more materials.  The back and forth can turn people off from building a completed product and using the house.  What this mod does is that it removes the material requirements for all of the things that can be created by the crafting workbenches inside and outside of the new houses added by Hearthfire.  The only things that haven&#39;t been altered are iron fittings, locks, hinges, and nails since they no longer have to be created to build a house.  Additionally the food items that can be made in the ovens still have their requirements, and I have also removed the salt requirements from them since it can be hard to find.  ",
  "categoryId": "40",
  "version": "1.0",
  "author": "Shah138",
  "createdUnix": "1471749776",
  "updatedUnix": "1471749763",
  "containsAdultContent": false,
  "uploadedBy": "feverwolf4",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000217749",
      "name": "HearthfireNoRequirments",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "HearthfireNoRequirments-78074-1-0.rar",
      "uploadedUnix": "1471749763",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fcc394c77dcaeace22b7e033b2240c703bb01e86d374368e805500fcb4ca3a37/analysis/1471749781/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HearthfireNoRequirments-78074-1-0.rar?fid=1000217749&ttl=1535866729&ri=8192&rs=8192&setec=7c38d3c3fa94872e8194eef59ae4b449"
    }
  ]
}