{
  "modId": 78123.0,
  "modName": "Quills - A Scroll Scribing Mod",
  "summary": "This mod makes it possible to scribe your own scrolls and spell tomes.  Just activate any Quill from your inventory, and a new crafting menu will open.  Includes support for Apocalypse, Beyond Reach, Falskaar, Frostfall, Ordinator, PerMa, SkyRe, SPERG, Requiem, and others.",
  "descriptionHtml": "This mod makes it possible to scribe your own scrolls and spell tomes.  Just activate any Quill from your inventory, and a new crafting menu will open...and from that menu, you can craft your own scrolls from rolls of paper and soul gem dust, and you can write your own spell tomes from blank books and research materials.  If you&#39;ve always wanted a portable, balanced, and immersive way to craft your own spell tomes and scrolls in Skyrim, I&#39;d like to invite you to give this mod a try.\r<br />\r<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/78123-0-1471988615.jpg[/img][/center]\r<br />\r<br />[b][color=#ffff00]HOW IT WORKS\r<br />============================================[/color][/b]\r<br />Find, buy, or craft a Quill and an Inkwell.  Then activate the Quill from your inventory.  A special craft menu will come up, showing you all of the scrolls and tomes that you can craft, and the items you will need to craft them.  At first level, you will probably only see Novice-level scrolls and spell tomes...but don&#39;t despair&#33;  As you build up your magic ability and invest in some spell perks, you will start to see more and more recipes in this menu.\r<br />\r<br />[b][u]Crafting Scrolls[/u][/b]\r<br />Scrolls are made from Rolls of Paper and Soul Gem Dust, which you can buy from your local spell vendor.  You can also make them yourself:  Rolls of Paper are made at the Tanning Rack from Linen Wraps or Ruined Books, and Soul Gem Dust can be made from soul gems at the Grain Mill.  Novice-level scrolls have no skill requirements, but higher-level scrolls require you to have 25, 50, 75, or even 100 points in the related magic skill.\r<br />\r<br />[b][u]Crafting Spell Tomes[/u][/b]\r<br />Spell Tomes are made from Blank Books and Research Material, which you can buy from your local spell vendor or bookstore.  You can make Blank Books yourself at the Tanning Rack from 1 Leather and 10 Rolls of Paper.  Unfortunately, you can&#39;t make Research Materials yourself...these can only be purchased from professors and spell vendors, or looted from the bodies of enemy spellcasters.  (It&#39;s a game balance thing.)  Novice-level spell tomes require the Novice Perk in the related school of magic, Expert spells require the Expert Perk, and so forth.\r<br />\r<br />Here&#39;s a complete breakdown of all of the crafting recipes. [SPOILER]\r<br />\r<br />[font=Courier New]Item                   Location         Ingredients\r<br />----------------------------------------------------------------------------------------------------\r<br />Quill                  Tanning Rack     Any feather (Hawk, Hagraven, Bone Hawk, or Felstaad Tern)\r<br />Inkwell                Cooking Pot      3 Powdered Charcoal + 1 Clay\r<br />Inkwell                Cooking Pot      3 Frostbite Venom + 1 Clay\r<br />Charcoal               Smelter          1 Firewood\r<br />Powdered Charcoal*     Grain Mill       1 Charcoal\r<br />Soul Gem Dust*         Grain Mill       Any soul gem, filled or empty\r<br />                                             3 Petty Soul Gems  = 1 Soul Gem Dust\r<br />                                             2 Lesser Soul Gems = 1 Soul Gem Dust\r<br />                                             1 Common Soul Gem  = 1 Soul Gem Dust\r<br />                                             1 Greater Soul Gem = 2 Soul Gem Dusts\r<br />                                             1 Grand Soul Gem   = 3 Soul Gem Dusts\r<br />                                             1 Black Soul Gem   = 3 Soul Gem Dusts\r<br />Roll of Paper          Tanning Rack     1 Linen Wrap\r<br />Roll of Paper          Tanning Rack     1 Ruined Book\r<br />Roll of Paper          Tanning Rack     1 Blank Book = 5 Rolls of Paper\r<br />Blank Book             Tanning Rack     2 Leather Strips + 10 Rolls of Paper\r<br />Research Material      --               [color=#b6b6b6]Research Materials cannot be crafted[/color]\r<br />\r<br />Novice Scroll          Quill            1 Roll of Paper + 1 Soul Gem Dust\r<br />Apprentice Scroll      Quill            1 Roll of Paper + 2 Soul Gem Dust + Skill 25\r<br />Adept Scroll           Quill            1 Roll of Paper + 3 Soul Gem Dust + Skill 50\r<br />Expert Scroll          Quill            1 Roll of Paper + 4 Soul Gem Dust + Skill 75\r<br />Master Scroll          Quill            1 Roll of Paper + 5 Soul Gem Dust + Skill 100\r<br />\r<br />Novice Spell Tome      Quill            1 Blank Book + 1 Research Material + Novice Perk\r<br />Apprentice Spell Tome  Quill            1 Blank Book + 2 Research Material + Apprentice Perk\r<br />Adept Spell Tome       Quill            1 Blank Book + 3 Research Material + Adept Perk\r<br />Expert Spell Tome      Quill            1 Blank Book + 4 Research Material + Expert Perk \r<br />Master Spell Tome      Quill            1 Blank Book + 5 Research Material + Master Perk\r<br />-----------------------------------------------------------------------------------------------------\r<br />*New alchemy ingredient.\r<br />[/font]\r<br />[/SPOILER][b][color=#ffff00]SO HOW IS THIS MOD DIFFERENT FROM ALL OF\r<br />THE OTHER SCROLL-SCRIBING MODS ON THE NEXUS?\r<br />==================================================[/color][/b]\r<br />The biggest differences between my mod and some of the other scroll-crafting mods you&#39;ve seen:\r<br />\r<br />1.  Everything is portable, no need for a workbench.\r<br />2.  More immersive and lore-friendly.\r<br />3.  Compatible with the most mods.\r<br />4.  More emphasis on game balance.\r<br />\r<br />[color=#ffff00][b]\r<br />REQUIREMENTS\r<br />============================================[/b][/color]\r<br />Skyrim Legendary Edition\r<br />\r<br />\r<br />[color=#ffff00][b]NOT REQUIRED BUT STRONGLY RECOMMENDED\r<br />============================================[/b][/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/71214/?]Unofficial Skyrim Legendary Edition Patch (USLEEP)[/url] - The ultimate bug-squashing patch for Skyrim\r<br />[url=http://www.nexusmods.com/skyrim/mods/59052/?]Jen&#39;s HD Inkwell and Quill[/url] For the excellent HD retextures of this mod&#39;s namesake, the Quill.\r<br />\r<br />\r<br />[color=#ffff00][b]COMPATIBILITY AND PATCHES\r<br />============================================[/b][/color]\r<br />Compatibility patches are included in the FOMod installer for the following mods:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/16225/?]Apocalypse - Magic of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/48467/?]Beyond Reach[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/37994/?]Falskaar[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/11163/?]Frostfall[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/68425/?]Ordinator - Perks of Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/59849/?]Perkus Maximus (PerMa)[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/19281/?]Requiem[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/24445/?]Skyrim Perk Enhancements and Rebalanced Gameplay (SPERG)[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/9286/?]Skyrim Redone (SkyRe)[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/25704/?]Wyrmstooth[/url]\r<br />\r<br />\r<br />[color=#ffff00][b]TROUBLESHOOTING\r<br />============================================[/b][/color]\r<br />Q:  How do I install and uninstall this mod?\r<br />A:  Just like any other mod.  Be advised that this mod uses scripts, so I recommend that you back up your existing savegame file before installing.  You can install it into an existing game as well, , or start a brand-new game.\r<br />\r<br />Q:  How do I get the Quill to work?  I click on it and nothing happens.\r<br />A:  Sometimes the script doesn&#39;t trigger properly and I&#39;m not sure why.  Try dropping the Quill and then picking it back up again.  If that doesn&#39;t help, check your mod list and make sure you aren&#39;t using anything that might change the vanilla Quill.\r<br />\r<br />Q:  Why is my crafting menu blank?  I meet all of the skill requirements.\r<br />A:  You also need to have an Inkwell in your inventory.\r<br />\r<br />Q:  I never run out of quills or ink.  Is that normal?\r<br />A:  Yes.  Quills and Inkwells are reusable, so they don&#39;t get used up as you scribe your scrolls and tomes.\r<br />\r<br />Q:  Why can&#39;t I craft my own Research Material?\r<br />A:  For game balance.  Crafting your own research material would make it too easy to get spells for free.\r<br />\r<br />\r<br />[b][color=#ffff00]ADVANCED INFO FOR EXPERIENCED MODDERS\r<br />============================================[/color][/b]\r<br />[SPOILER]Q:  I see you added new alchemy ingredients.  Are these new ingredients CACO-friendly?\r<br />A:  Yes.  The new alchemy ingredients were created using kryptopyr&#39;s guidelines, to make them suitable for use with CACO.  (You don&#39;t need CACO to use this mod; it is just ready for you if you do.)\r<br />\r<br />Q:  Why can&#39;t I earn Enchanting experience when scribing scrolls or tomes?\r<br />A:  I didn&#39;t want to create an exploit bug.  The enchanting skill already advances quickly enough on it&#39;s own; it really doesn&#39;t need help.  And besides: scribing isn&#39;t the same as enchanting, is it?\r<br />\r<br />Q:  Does this work with leveled-list utilities like Lootification or Morrowloot? \r<br />A:  Not really.  This mod adds items to certain leveled lists and containers, and any utility or mod that rearranges those Leveled Lists or reassigns treasure and loot will break this mod...it will either remove these new items, reassign them to nonsensical locations, or create duplicates.  So if you use such a utility or mod, I recommend you exclude Quills from it and then put this mod lower in your load order.\r<br />\r<br />Q:  Why does this mod want to overwrite assets from Campfire?\r<br />A:  This mod uses scripts from the Campfire extensible framework (thanks Chesko&#33;).  You might be prompted to overwrite them if you already have Campfire installed, or if you are using assets from the Campfire Extensible Framework; feel free to ignore it or overwrite, whichever you prefer.  The files are the same.\r<br />\r<br />Q:  Can you tell me more about all of these patches?\r<br />A:  Sure thing.\r<br />[SPOILER]\r<br />\r<br />The first thing you should know is that this mod adds skill requirements to all of the scroll crafting recipes, and adds perk requirements to all of the spell tome crafting recipes.  So if you are using a mod that changes the Alteration, Conjuration, Destruction, Illusion, or Restoration skill trees, or changes the vanilla perks for these skills, you are going to need a patch.  Otherwise, none of these recipes will show up.\r<br />\r<br />Second, this mod adds new ingredients and misc items to the game via the leveled lists, so that you can buy the new items from spell book vendors, and you can loot them from enemy spellcasters.  So if you are using any mod that changes these leveled lists, you will need to create a bashed patch.  And if you are using any reprocessor that will adjust the leveled lists, you will need to exclude Quills from it.  Not doing either step can have unpredictable results: your game could become unstable, new items might appear in places they shouldn&#39;t, or might be duplicated, or might be removed altogether.\r<br />\r<br />And finally, if you use a mod that adds new spell merchants or new enemy spellcasters, you will need a patch to get Quill&#39;s new items to appear in their inventories.  This is usually not a big deal, but some people find that it helps with immersion.\r<br />\r<br />So now that you know a bit about the nuts and bolts, here&#39;s some details about *my* patches.\r<br />\r<br />[color=#c9daf8][b]Apocalypse -[/b] adds recipes for all 115 of Apocalypse&#39;s new spells to the Quills crafting menu, so that you can make tomes and scrolls of them.  This patch is not mandatory; you only need to install it if you want to [u]scribe[/u] your own Apocalypse scrolls and spell tomes.  (You will still be able to buy and find Apocalypse spells normally without this patch.)\r<br />\r<br />[b]Beyond Reach - [/b]adds my new ingredients and raw materials to the vendor shopping lists of certain merchants.  This patch is not mandatory; you only need to install it if you wish to buy scribing materials from the new merchants or loot them from Beyond Reach monsters.\r<br />\r<br />[b]Falskaar - [/b]adds my new ingredients and raw materials to the vendor shopping lists of certain merchants and to the drop list for certain monsters.  This patch is not mandatory; you only need to install it if you wish to buy scribing materials from the new merchants or loot them from Falskaar monsters.\r<br />\r<br />[b]Frostfall - [/b]adds crafting recipes  for all of Frostfall&#39;s new spells to the Quills crafting menu, so that you can make tomes and scrolls of them.  This patch is not mandatory; you only need to install it if you want to [u]scribe[/u] your own Frostfall scrolls and spell tomes.  (You will still be able to buy and find these spells normally without this patch.)\r<br />\r<br />[b]Ordinator -[/b] changes Quill&#39;s requirements to use Ordinator&#39;s perk tree instead of the vanilla one.  This patch is mandatory if you use Ordinator; otherwise none of the scribing recipes will appear.\r<br />\r<br />[b]PerMa -[/b] changes Quill&#39;s requirements to use PerMa&#39;s perk tree instead of the vanilla one.  This patch is mandatory if you use Perkus Maxumus.  Be sure to add Quills to the PaMa block list to prevent leveled lists from being modified.\r<br />\r<br />[b]Requiem -[/b] changes my crafting requirements to use Requiem&#39;s perk tree instead of the vanilla one.  This patch is mandatory if you use Requiem; otherwise none of the scribing recipes will appear.\r<br />\r<br />[b]SPERG - [/b]changes Quill&#39;s requirements to use SPERG&#39;s perk tree instead of the vanilla one.  This patch is mandatory if you use SPERG; otherwise none of the scribing recipes will appear.\r<br />\r<br />[b]SkyRe -[/b] changes Quill&#39;s requirements to use SkyRe&#39;s perk tree instead of the vanilla one.  This patch is mandatory if you use Skyrim Redone; otherwise none of the scribing recipes will appear.  Add Quills to the SkyRe Reproccer block list to prevent it from modifying the leveled lists.\r<br />\r<br />[b]Wyrmstooth - [/b]adds my new ingredients and raw materials to the vendor shopping lists of certain merchants.  This patch is not mandatory; you only need to install it if you wish to buy scribing materials from the new merchants or loot them from Wyrmtooth monsters.[/color]\r<br />[/SPOILER]\r<br />\r<br />Q:  Can I merge all of these patches?\r<br />A:  Yes.  Once you have installed the patches that you wish to have, you can merge all of the .ESM files that begin with &#34;Quills_Patch_&#34; in the filename.  DO NOT combine them with the main file (Quills.esm), however, or you will ruin your FormIDs. [/SPOILER]",
  "categoryId": "100",
  "version": "1.0",
  "author": "TravLaney",
  "createdUnix": "1471909500",
  "updatedUnix": "1471909500",
  "containsAdultContent": false,
  "uploadedBy": "travlaney",
  "primaryFile": null,
  "files": []
}