{
  "modId": 78171.0,
  "modName": "Cooking In Skyrim",
  "summary": "Cooking In Skyrim aims to make cooking more interesting by giving you the feeling of progress, more useful and rewarding, but still balanced. Using a recipe book system, completely overhauls the vanilla food effects and adds new recipes.",
  "descriptionHtml": "[img]http://i.imgur.com/dlBhyM9.jpg[/img]\r<br />\r<br />\r<br />Cooking In Skyrim aims to make cooking more interesting by giving you the feeling of progress, more useful and rewarding, but still balanced. Using a recipe book system, completely overhauls the vanilla food effects and adds new recipes.\r<br />\r<br />[b][u][color=#e69138]DESCRIPTION:[/color][/u][/b]\r<br />\r<br />What Cooking In Skyrim DOES:\r<br />\r<br />1) Food now fortifies your attributes for some period of time and does NOT restore them.\r<br />In general cooked meat will fortify your stamina, fruit & vegetables fortify your health, cheese & sweets fortify your magicka.\r<br />Raw meat will damage your health & reduce your stamina & magicka regen, unless your character is beastial race (Orc, Khajiit, Wood Elf, Argonian).\r<br />\r<br />2) Your character needs to read the new Cooking Books first, before he can cook better meals. At the start of the game you can only cook raw meat and some simple vanilla soups (like Potato Soup or Cabbage Soup). There are 4 Cooking Books in total all purchasable from the Riverwood Trader and from Belethor&#39;s General Goods in Whiterun. The first book is available at level 1, but the rest three books will become available to you as you level up (at level 15, level 30 and level 40). That way your character won&#39;t have access to very powerful food recipes from the start of the game, making cooking a more interesting process and giving you the feeling of progress.\r<br />\r<br />3) Food usually gives you some kind of boost to one or more of your basic attributes and does NOT buff any of your skills, for that you have alchemy and enchanting. (There are only 3 recipes that gives you some poison/disease resist and fortify your carry weight. It makes more sense to me that a good meal keeps you healthy, rather that boosting for example your destruction spells).\r<br />\r<br />4) Same food effects don&#39;t stack.\r<br />\r<br />5) Only one food can be active at a time. Eating a different food will completely replace the effects of the previous one. So now, not only same effects don&#39;t stack together, but you can&#39;t eat 3 different food with different effect and have the benefits from all of them. That gives more balance and now you have to plan ahead what food you want to cook/eat according your needs, your character build and the situation you are facing.\r<br />\r<br />6) Salt Pile has been removed from all recipes.\r<br />\r<br />7) Consuming Ale or Mead will give you a boost to your stamina (adding 1 point/sec), but will slower your magicka regen by 75%.\r<br />Wine boost you magicka (by 1 point/sec), but damage your stamina regen by 75%. Milk removes the negative effects of alcohol (sorry to all the Nords out there, but milk is good for your health:)\r<br />\r<br />8) 15 new recipes have been added with new textures. Each recipe produce 2 meals.\r<br />\r<br />9) Available recipes will display in your cooking panel only when you have one of the major ingredients in your inventory (for example Beef Stew will be visible only if you have at least 1 Raw Beef in your inventory and if you know how to cook that meal from reading one of the required Cooking Books).\r<br />\r<br />\r<br />[color=#00ff00][size=4]Cooking in Skyrim is now also available for Skyrim Special Edition:[/size][/color] [color=#00ff00][size=4][url=http://www.nexusmods.com/skyrimspecialedition/mods/9070/?]CLICK HERE[/url][/size]\r<br />[/color]\r<br />\r<br />[b][u][color=#e69138]REQUIREMENTS:[/color][/u][/b]\r<br />\r<br />Latest Skyrim and ALL 3 DLC\r<br />\r<br />[b][u][color=#e69138]INSTALLATION:\r<br />[/color][/u][/b]\r<br />Extract the two files (Cooking_In_Skyrim.esp, Cooking_In_Skyrim.bsa) in your Skyrim&#92;Data folder or use your favorite mod manager.\r<br />\r<br />[b][u][color=#e69138]UNINSTALL:\r<br />\r<br />[/color][/u][/b]Just delete the two files (Cooking_In_Skyrim.esp, Cooking_In_Skyrim.bsa) from your Skyrim&#92;Data folder. Make sure that there is NO ACTIVE food effect in your character.\r<br />\r<br />[color=#e69138][b][u]COMPATIBILITY:\r<br />[/u][/b][/color]\r<br />Cooking In Skyrim is compatible with the latest version (v.1.602) of iNeed\r<br />\r<br />Cooking in Skyrim should be compatible with all mods since it only changes the food properties and effects. But it will probably conflict with any other mod that does the same. So, if you want to have the effects of cooking in Skyrim in your game make sure that it is last in the mod loading order. Any new food added by other mods won&#39;t have the &#34;One active food at a time&#34; effect and probably you will be able to stack food effects with any new added food.\r<br />\r<br />[b][u][color=#e69138]PERMISSIONS:[/color][/u][/b]\r<br />\r<br />Other mod authors may create and distribute patches to make their mods compatible with Cooking In Skyrim.\r<br />Feel free to alter the mod according to your needs and playstyle for personal use only.\r<br />Do NOT upload the mod on other sites or on steam workshop.\r<br />\r<br />[b][u][color=#e69138]CREDITS:[/color][/u][/b]\r<br />To Bethesda for creating Skyrim.\r<br />To NexusMods and its community.",
  "categoryId": "24",
  "version": "1.1",
  "author": "wcpaeb",
  "createdUnix": "1472065354",
  "updatedUnix": "1472552699",
  "containsAdultContent": false,
  "uploadedBy": "wcpaeb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000218859",
      "name": "Cooking In Skyrim v.1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7581",
      "fileName": "Cooking In Skyrim v.1.1-78171-1-1.7z",
      "uploadedUnix": "1472552699",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/32e3297d6332b83c3c9d9518354584273580a6b6d112a87ec7eb02a0ea1b0f23/analysis/1472553544/",
      "changelogHtml": " Added. Compatibility for iNeed. <br/> \n Fixed. Skooma now has a more reasonable price. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cooking%20In%20Skyrim%20v.1.1-78171-1-1.7z?fid=1000218859&ttl=1535866844&ri=8192&rs=8192&setec=3a7a7717d7045e971cd5f8042f1249ee"
    }
  ]
}