{
  "modId": 78199.0,
  "modName": "Vampire Knight Armor and Weapon Set",
  "summary": "New dark, heavy armor for the children of the night...",
  "descriptionHtml": "[color=#980000][size=4]Take your war to the retched Dawnguard in the Vampire Knight Armor and with the Vampire Knight Weapons. This set is the last remnants of a long lost, ancient royal vampire clan. Their memory has become whispers in the night and only the eldest of vampires still remember their ferociousness in battle along with the screams of the many victims unfortunate enough to cross their path... It is said they derived the power they had from secret blood rituals which they used to make their, now lost armor and weapons with. But as luck would have it, young child of the night, there have been rumors of a recent discovery in the depths of Potema&#39;s Catacombs. It is said that hidden within is one remaining set of the fabled armor and weapons used by the ancient bloodline... So set out and claim it for your own&#33; Conquer any who would see you falter in your quest.\r<br />\r<br />[/size][/color][color=#efefef][size=4]This mod adds an new, heavy armor & weapon set to Skyrim. It can be found hidden in Potema&#39;s Catacombs, so be sure to look everywhere :)\r<br />\r<br />The set can also be crafted once you have the Daedric smithing perk and has the same stats as the corresponding armor and weapons.\r<br />\r<br />The textures are 4K Armor, Shield, Sword and Bow. 2K Helm, Guantlets, Boots, Arrow and Quiver.\r<br />\r<br />There is no weight slider support [b][i][u]yet[/u][/i][/b], but it&#39;s being worked on... Slowly, but worked on :)\r<br />\r<br />If any bugs are found, let me know.\r<br />\r<br />Permissions: I give NO permission for the use of any of these assets without my consent. I also give no permission for any part of this mod to be uploaded to any other site. This is a Nexus exclusive&#33;\r<br />\r<br />Thanx and enjoy&#33; :)\r<br />\r<br />[/size][/color]",
  "categoryId": "36",
  "version": ".95c",
  "author": "Scroll Thief",
  "createdUnix": "1472155296",
  "updatedUnix": "1472165069",
  "containsAdultContent": false,
  "uploadedBy": "ScrollThief84",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000218344",
      "name": "Vampire Knight Armor and Weapon Set",
      "version": ".95c",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65980",
      "fileName": "Vampire Knight Armor and Weapon Set-78199--95c.zip",
      "uploadedUnix": "1472165069",
      "modVersion": ".95c",
      "virusScanUrl": "https://www.virustotal.com/file/1c68117e37d9632246868aaf205a279554784301b9687354eed3f5f3e5d17a65/analysis/1472176151/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vampire%20Knight%20Armor%20and%20Weapon%20Set-78199--95c.zip?fid=1000218344&ttl=1535866888&ri=8192&rs=8192&setec=65c885978bd2c3c857507ed4194c6d16"
    }
  ]
}