{
  "modId": 7820.0,
  "modName": "Dark Fantasy ENB_FXAA Profile",
  "summary": "Yet another one, so I\\'ll point out the strenghts and weaknesses so you can decide if you wanna try",
  "descriptionHtml": "Yes, this is another one of those files flooding the Nexus these days. I still decided to load it up because this one I believe has achieved something many other one didn\\'t. I\\'ll get to that in the description where I\\'ll tell you what this mod does and what it doesn\\'t, so you have an easy time deciding to use this or to close this tab and continue your day. ;)\r\n\r\n[b]INSTALLATION:[/b]\r\nUn-rar and drop all the files and folders into your skyrim installation folder, NOT the data folder. Then, if you donwloaded v1.0, you might delete following files since they\\'re not used: \r\nd3d9shader.dll\r\nd3d9DEX.dll\r\nd3d9BOP.dll\r\nd3d9inject.dll\r\nenbpatch.ini \r\nSorry, I didn\\'t know myself until after uploading ;) Original profile author is working a bit messily.\r\n\r\nTo enable the FXAA injector, open enbseries.ini and change following two lines:\r\nEnableProxyLibrary to \\\"true\\\"\r\nProxyLibrary to \\\"d3d9injFX.dll\\\"\r\n\r\nWith that done, you have a range of options:\r\nOpen infFX_settings.h to...\r\n\r\nenable FXAA: uncomment \\\"#define USE_ANTI_ALIASING\\\" (remove the \\\"//\\\")\r\nincrease saturation (=stronger colors): increase \\\"#define Saturation\\\"\r\nand many others, quite self explanatory.\r\n\r\nIn the screenshots I use NVIDIA SSAO. Mods you see are the sunflare from tapioks (get it from Skyrim Enhanced Shaders), Realistic Water, Better Mountain Textures, Vurts Skyrim Overhaul (Barks), and many others.\r\n\r\n\r\n[b]---What it does, or the pros---[/b]\r\n\r\n+++ The best part: a mostly balanced setting. This means:\r\nno strange distance\r\nno strange colors (among others achieved by no palette use)\r\nvanilla-like clouds (which is good, really)\r\nnice shadows and lighting\r\ngood-looking water (among others not bright at night)\r\nbalanced sky (no apocalyptic dusk, no caribic sky, I tried to stay close to vanilla sky)\r\nno dark fog which looks like smoke like with many other settings\r\n\r\n+++ Other features:\r\n+ dark night\r\n+ bright fog at night (fotos convinced me fog is bright even at night - maybe this is not right but that\\'s my opinion right now ;) ) Don\\'t worry, it\\'s not eye-killing bright, just brighter than the very dark environment, and also in the tweaking section I will tell you what to do to change that if you want\r\n+ very beautiful sky at night\r\n\r\n+++ A little tweaking guide where I tell you what you may try to tweak this mod to your liking. Will be of no value to anyone who is familiar with the enbseries.ini file, to many others it will be of use.\r\n\r\n[b]---What it does not, or the cons---[/b]\r\n\r\n- First of all, I will most likely not continue to update this mod for long. As new profiles get released, I\\'m waiting for the one which satisfies me more than my current setting, and I\\'ll move on. I advise you do the same ;)\r\n\r\n- This mod is not too fancy, this means it\\'s not as colorful as SES for example. But it\\'s not gritty either, that\\'s why I named it balanced ;) \r\n\r\n- A little overbloom during the night. Why, it makes the scene a bit blurry and vibrant which is nice, increased light intensity is the bad part of this. I\\'ll point out at the \\\"tweaking\\\" section what you can do to counter.\r\n\r\n- Caused by bloom, but bad enough to be a point of it\\'s own: icy caves are very shiny. Again, read further to learn how to remove this if it\\'s too much for you.\r\n\r\n- Many files, and since I used another mod as a starting point I don\\'t even know which ones are really needed. For example, changing settings in injFX_settings.h has no effetc O.O\r\n\r\n\r\n[b]### Tweaking section ###[/b]\r\nAlright, here we go. Here I will point out gripes I predict youmight have with my profile and how to counter that. The exact same section is included in the download, folder \\\"Tweaking guide\\\", so you don\\'t need to read it here. \r\n\r\nThe basics are: open the enbseries.ini with editor, notepad++ or something of your liking, which, if you installed correctly, should reside in your skyrim folder. Press ctrl+f and paste the lines I point out to find them and then change their values and see what happens. Works very well with alt-tabbing out of the game and going back after changing something.\r\nI will add the default values in brackets if you want to revert.\r\n\r\n\r\n\\\"!Your bloom is killing my eyes!\\\" (bright icy caves, very bright rooms where many light sources are, etc)\r\n\r\nWhere to go: [BLOOM]\r\nWhat to change: \r\nAmountDay (0.9)\r\nAmountNight (1.3)\r\nLowering these will reduce bloom and also decrease brightness. So if your game is too dark afterwards, you might want to change other settings. This brings us too...\r\n\r\n\r\n\\\"I can\\'t see anything you moron!\\\" (nights too dark, daytime too gritty)\r\n\r\nWhere to go: [ENVIRONMENT]\r\nWhat to change: \r\nDirectLightingIntensityDay (1.85)\r\nDirectLightingIntensityNight (1)\r\nAmbientLightingIntensityDay (1.3)\r\nAmbientLightingIntensityNight (0.5)\r\n\r\nLowering direct lightning affects how landscape looks overall. For example, if you lower the value for the daytime, ground will look darker, as if it was night and not very well lit. Increasing obviously makes the ground brighter, and I think more colorful. By increasing DirectLightingDesaturationDay or DirectLightingDesaturationNight, you can decrease saturation by increasing the direct lightning values.\r\n\r\nIncreasing Ambient Lightning will simply make shadows less intense and reduce contrast. This will increase visibility, especially at night, but also reduce realism and atmosphere. Most caves and indoors are affected by the night setting, so take care.\r\n\r\n\r\n\\\"Bright fog at night? U mad?\\\"\r\n\r\nWhere to go: [VOLUMETRICFOG]\r\nWhat to change:\r\nIntensityDay (1.5)\r\nIntensityNight (1.3)\r\n\r\nLowering these will make fog aroung mountain tops and fog generally (I guess) darker. \r\n\r\n\r\n\\\"I want more blue sky! Bring me my Pina Colada ASAP!\\\"\r\n\r\nWhere to go: [SKY]\r\nWhat to change:\r\nGradientTopIntensityDay (1.6)\r\nGradientTopCurveDay (1.1)\r\nGradientMiddleIntensityDay (1.5)\r\nGradientMiddleCurveDay (1.5)\r\nGradientHorizonIntensityDay (1.4)\r\nGradientHorizonCurveDay (1.8)\r\n\r\nThis will be a challenge, I assure you. Sky is a very delicate setting in skyrim, or as the nords would say, the most expensive woman in town. Generally, for more deep-blue skies you will have to increasy curve and intensity, but you will have a hard time making it look good. Try setting above values to 3 and go from there. Good luck ;)\r\n\r\n\r\n\\\"Sharpening sucks!\\\" (increased aliasing, scene seems less \\\"whole\\\")\r\n\r\nEither delete the effects.txt file or if you just want to reduce the sharpening amount, open it up and lower float SharpeningAmount. Default = 4.5\r\n\r\n\r\n\\\"Where\\'s my beloved SSAO?\\\"\r\nIt\\'s disabled because it destroys water. If you don\\'t care about that, change EnableAmbientOcclusion to \\\"true\\\". SSAO is not configured in my profile, so copy the values of an ENB profile you like to make SSAO look good, I have no clue. \r\nThe basics are:\r\nFor high quality SSAO you also need to set UseIndirectLighting to \\\"true\\\". Also, you\\'ll need 300 bucks for a new GPU :P\r\nAOAmount is the intensity of the shadowing applied. The higher, the more performance will suffer. \r\nFor further tweakings look up boris\\' ENB home page.\r\n\r\n\r\n\\\"I want more orange/less orange fires!\\\"\r\n\r\nWhere to go:\r\n[FIRE]\r\nWhat to change:\r\nCurveDay (0.7)\r\nCurveNight (1)\r\n\r\nIt\\'s simple: higher values = more orange, lower values = less orange. Yay!\r\n\r\n\r\n----CREDITS----\r\nBoris vorontsov for ENB\r\nSomeDude for FXAA injector\r\nguardiaodf1 for his profile from which I started\r\nTapioks and diiamondx for inspiration and help\r\nBethesda for my personal game of the year\r\nDarkOne for Nexus\r\nThe whole Nexus community for simply existing",
  "categoryId": "62",
  "version": "1.1",
  "author": "domanz",
  "createdUnix": "1328447485",
  "updatedUnix": "1328485056",
  "containsAdultContent": false,
  "uploadedBy": "domanz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "26112",
      "name": "Dark Fantasy ENB_FXAA Profile",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "498",
      "fileName": "Dark Fantasy ENB_FXAA Profile-7820.rar",
      "uploadedUnix": "1328447570",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5509bdfff4dcfb12fc3dc7cf6ab593ca392ec690e1f87ffaa91edf194f6d9fa1/analysis/1406655004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Fantasy%20ENB_FXAA%20Profile-7820.rar?fid=26112&ttl=1535766188&ri=8192&rs=8192&setec=d36516fc9fa151253fbb72ebfdce3948"
    },
    {
      "fileId": "26272",
      "name": "Dark Fantasy ENB_FXAA Profile 1_1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "583",
      "fileName": "Dark Fantasy ENB_FXAA Profile 1_1-7820-1-1.rar",
      "uploadedUnix": "1328485056",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5a1c179fb84cb026656d2eea58c66e5349c9b8105137c1f027235131183f0610/analysis/1406655995/",
      "changelogHtml": " Unnecessary files removed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Fantasy%20ENB_FXAA%20Profile%201_1-7820-1-1.rar?fid=26272&ttl=1535766188&ri=8192&rs=8192&setec=9a8d5f38ec3875134316d540e6a09ac2"
    }
  ]
}