{
  "modId": 78266.0,
  "modName": "Clean up your Corpses",
  "summary": "A Mod to treat corpses in multiple ways.",
  "descriptionHtml": "[center][img]http://i.imgur.com/bFSrj7g.gif[/img]\r<br />[youtube]vk9z61awvHQ[/youtube][/center]\r<br />[color=#00ff00][b][size=6][center]Requirements[/center][/size][/b][/color][size=6]\r<br />1. Skyrim with the most actual patch (1.9.32.8)\r<br />2. DLCs Dawnguard, Hearthfire and Dragonborn\r<br />[url=http://skse.silverlock.org/]3. Skyrim Script Extender[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/3863]4. SkyUI based MCM Menu[/url][/size]\r<br />\r<br />[color=#00ff00][b][size=6][center]How to install[/center][/size][/b][/color][size=6]Installation with NMM:[/size]\r<br />\r<br />[size=4]1.[/size] Press download with Manager button on the Nexus and confirm the requested programm\r<br />[size=4]2.[/size] Once downloaded open up NMM and click the mods tab to import the CUYCMod.7z\r<br />[size=4]3.[/size] After installation enable the plugin files in your prefered reorder tool or in data files when starting up Skyrim\r<br />[size=4]4.[/size] When starting Skyrim, click on data files, and make sure the &#39;CUYC_CleanUpYourCorpses.esp&#39; is checked. If you use Wrye Bash, make sure the file is activated and your load order corrected. Use [url=https://loot.github.io/]LOOT[/url]to automatically get the correct load order.\r<br />[size=4]5.[/size] Play the Game&#33;&#33;&#33;\r<br />\r<br />[size=6]Manual Installation:[/size]\r<br />\r<br />[size=4]1.[/size] Unzip the files anywhere\r<br />[size=4]2.[/size] Move the .esp and .bsa file &#39;CUYC_CleanUpYourCorpses&#39; to your &#39;x:...SkyrimData&#39; folder.\r<br />[size=4]3.[/size] When starting Skyrim, click on data files, and make sure the &#39;CUYC_CleanUpYourCorpses.esp&#39; is checked. If you use Wrye Bash, make sure the file is activated and your load order corrected. Use [url=https://loot.github.io/]LOOT[/url] to automatically get the correct load order.\r<br />[size=4]4.[/size] Run Skyrim&#33;&#33;&#33;\r<br />\r<br />[color=#00ff00][b][size=6][center]Detailed Instruction[/center][/size][/b][/color][color=#f1c232][size=3][b]Processing Corpses[/b]:[/size][/color]\r<br />\r<br />Searching Body: Is just like it was in Vanilla, you can open the inventory with any tool equipped without problems...but beware, with the Vampire resurrect option enabled, Vampires will resurrect if you don&#39;t open their inventory in sneak stance&#33;\r<br />\r<br />Remove Body: Removes the body by disintegrating it. You will need leach to do this. This does not destroy spawn points coming with leveled and not unique actors, like bandits or forsworn. Place the leach inside the body and then activate it. Leach can be crafted at cooking pots with the correct ingredients.\r<br />\r<br />Take Body: Puts a &#39;Corpse Dummy&#39; in your inventory representing the corpse/carcass weight and name. Once you&#39;ve dropped the corpse/carcass from your inventory, the dummy gets removed, and the corpse/carcass gets placed at your feet. To take a body you need to hit it with the Grappling Hook tool. Grappling Hooks can be crafted at a forge. You can then bring the corpse to any place you want to bury, burn, melt or process it any way that you decide is appropriate. From version 0.9.9, you can also give the corpse a honorable death at burial pyres sitting in every major town and village (toggleable inside MCM menu). There&#39;s also an MCM option to turn off the possibilitie to cheat by putting stuff into the inventory of corpses/carcasses and then carry them around. All items get removed from their body before you grab them with the hook.\r<br />\r<br />Burn Body: Has three flavors (only one on carcass). &#39;Barbecue&#39; with torches, which leaves a grilled body. &#39;Ashes to Ashes&#39; with fire based spells, will leaves an Ash Pile and is the prefered option if you want vampire ashes or bonemeal from human/creature corpses/carcass, and burning impaled detterence, which is considerably a burial option. You will need to hit the corpse/carcass with a torch or a fire spell and previously placed fire accelerant in their inventory. Putting bodys on fire will also add a hazard around them so be carefull and keep your distance. Torch and flame spells are Vanilla and you can find them everywhere in the world. From version 0.9.9 you can also burn corpses/carcasses with flame based staffs.\r<br />\r<br />Bury Body: You&#39;ll need to hit the corpse/charcass with a shovel, axe or scalpel to bury them. How you bury the body depends on what you use. If you use the Corpsecutter&#39;s Axe, an impaled detterent gets placed, which can be used as warning for intruders and enemies. It will spread an aura of fear if you choose so. Afterwards you can interact with the detterence, applie fire acceleratn to it, and ignite it with torch or fire spell. If you hit the corpse with a shovel, you will bury them with a tombstone, or under a heap of earth if you&#39;ve previously put clay into their inventory. And finally, if you previously put 5 linen wraps into their bodys, and use the scalpel, they will end as mummy. Animals/Creatures can only be processed with a shovel and will always leave a heap of earth, which you can then place a tombstone (fully interactable) or weapon at. The shovel and scalpel can be crafted at a forge. Corpsecutter&#39;s axes are craftable at forges with the vanilla Woodcutter&#39;s Axe as prerequisite. \r<br />\r<br />From version 0.9.9 you can also buy replacement tombstones at every Priest of Arkay at the corresponding Hall of Death in major settlements. Use the licenses they give you on tombstones you&#39;ve just placed. After 10 seconds you can&#39;t replace them, so you always want to carry around a license in case you want to replace an ordinary tombstone, before you even bury someone with tombstones. 10 seconds limit is inevitable due to bugs. Form version 1.0 you will be able to place the processed corpse in real time.\r<br />\r<br />Nail Body to the wall: ...or everywhere you want. Use a hammer and nails to nail every corpse at any wall or any place you want, even in mid air. Hiting the corpse with the hammer will &#39;freeze&#39; them, hit them again and they will be unfrozen. This is done in replacement of no longer being capable of placing corpses/carcasses inside containers.\r<br />\r<br />Burn the honorable Dead at burial pyres (optional): Every town and village no has a burial pyre where you can burn your most valued friends...or enemies...as honorable as possible. Just have a corpse in your inventory and activate the burial pyre. It will then process the corpse in your inventory. The person you&#39;re burning appears a last time as Ghost besides the ceremony to watch her/his own funeral, and will then be lifted to Sovngarde through a portal. Since version 0.9.9.4 there&#39;s an MCM option to turn burial pyres off to raise compatibility with mods that add new content to towns and cities. Since version 1.2 the actors will really go to Sovngarde Cell and since version 1.3 they will have a full fledged package to actually live in Sovbgard. No more standing around. Also in version 1.3 people in towns will actually atain to the burial.\r<br />\r<br />The Fleshsaw: ...is a special tool you&#39;ll get after killing one of the protagonists of the Cannibal mission in Markarth. You&#39;re able to dismember bodies with it, and it will grant you 4 pieces of human flesh, and 1 human heart. But beware using the fleshsaw in public will count as criminal act.\r<br />\r<br />The Broom: Another special tool, which you will get as reward when completing the DB quest line. You can disintegrate every corpse with it right away.\r<br />\r<br />Most of the placeable activators can be interacted with, like the detterence, tombstone and mummie. The interaction options allow you to write a notation, review the notation, replace the model of the activator, and remove it entirely. Heaps of Earth and Detterences will have special options, like placing the weapon, a tombstone, or fire accelerant at the activator to ignite it. Note that this is since version 1.2, and where you previously had to hold a torch in your hand when placing a detterence to ignite it, you&#39;ll now need to interact with the detterence once it&#39;s placed, applie fire accelerant, and ignite it with a torch or fire spell. \r<br />[color=#f1c232][size=3]\r<br />[b]Reward/Poaching System:[/b][/size][/color]\r<br />\r<br />Corpse processing reward system (optional): Simple idea. Dig the good ones, pike the bad ones and disallow going on a game rampage. The system however is far more complex then this. Basically every tool that places activators or similar (Axe, Shovel, Mummifier, Torch, Flame Spells) will grant you an increase or deduction of your reward counter (showen as widget available in oldschool and white color). Poaching passive animals will deduct from your reward count based on the animals (Level * FeeMoney), and processing corpses/charcass with the correct tool will increase your reward count. Rewards are to be collected at the local Steward, as well as fines to be payed and buying a Hunting License. This Hunting License will allow you to hunt as many passive animals as you like, in a time frame of 3 days, without deduction from your reward count. If you however deliberately hunt more then you&#39;re allowed without Hunting License, you sooner or later face the stigmatization of a Poacher and all guards of all holds will sooner or later try to arrest you. Don&#39;t mess with Jarl&#39;s game. All the settings are configurable inside the MCM menu. Which tool is correct for which actor type? Well, I don&#39;t want to spoil the experience of figuring out...;) \r<br />\r<br />[color=#f1c232][size=3][b]Additional Features:[/b][/size][/color]\r<br />\r<br />Fire hurts: Getting to close to corpses or charcasses when igniting them, or when they&#39;re burning will get your health damaged and set you on fire, so always keep your distance (150 game units). This is also true for NPCs, so you could use this as trap?\r<br />\r<br />Frostfall support: Burning corpses keeps you warm when using Frostfall. Once a body gets ignited a CampFireLight01(HeatSource) will be added to the corpse. This light is what Chesko uses to detect if a player is close to a heat source. Burning corpses will work like a regular campfire from Frostfall. To get the full benefit you&#39;ll need to have a tent build or warm clothes at your body. Additionally the range to the heat source defines the amount of exposure reduced. But don&#39;t get to close, or you get yourself grilled. If you use the bonfire option you will get longer burning corpses, which will warm you up longer.\r<br />\r<br />Vampires get special treatment (optional): Since version 0.8 Vampire treatment is in particular one of my favorit features of this mod. First, there&#39;s one thing to remember after you killed a Vampire&#33; If you approach them without sneaking, they WILL resurrect&#33; So you want to do the following:\r<br />\r<br />1. kill the Vampire\r<br />2. approach them sneaking to open their inventory\r<br />3. take all their loot if wanted, and either place garlic, brand accelerator or leach inside them\r<br />\r<br />If you did it correctly you can now take the corpse (garlic), burn it(fire accelerant), or remove/melt them (leach). For sure, you can just approach a Vampire while not sneaking and just burn or bury them. In both cases they will not resurrect. This all follows a simple logic and makes it a highly immersive interaction with Vampire, which is also highly compatible with other Vampire mods since version 0.8. From version 0.9.9 Vampires will scream in agony if you decide to burn them and deliver an enjoyable show.\r<br />\r<br />Dress up dead people: There&#39;s also a feature to put armor and weapons on corpses if you put said items in their inventory.\r<br />\r<br />Increase Grab Force: A function inside the MCM menu. You can adjust the grab force to your liking, if you experience any related bug, like not being able to lift corpses.\r<br />\r<br />Igniting actors: If you use the fire accelerant as poison applied to a weapon, you can ignite actors that are currently using fire magic, or under the influence of fire magic. This opens up whole new opportunities of killing fire mages. \r<br />\r<br />Make blood stew from human body parts: Something special for the cannibalists. Process any human body part at grain mills to blood stew...enjoy your meal&#33;\r<br />\r<br />[color=#f1c232][b][color=#00ff00][b][size=6][center]FAQ & Bugs[/center][/size][/b][/color][/b][color=#ffffff]- There&#39;s a bug with sometimes NPCs still having a dying voice when igniting them. This is because in order to get all of this working I need to resurrect them for a short period of time, and so they basically get grilled alived. It&#39;s also quite funny, so I have no intention to change it. This seems to only happen on leveled characters, so it probably is a problem related to the reference, not the base object aka Race or Actor.\r<br />- Another bug happens if you decide to replace several tombstones via licenses in a row with previously placed by the shovel tool. They will all share the same string text, because always the last tombstone placed with the shovel will occupie the string text quest. Process the corpses one by one to prevent this bug.\r<br />- small bug if you replace a detterence and save close to it while in the same cell. Once you&#39;ve reloaded the game, it will replace the model with the default one until you&#39;ve entered a new cell. This was inevitable due to a even more critical bug when using OnLoad() Event. This is considerably a minor bug and I think most people can live with it.[/color][b]\r<br />\r<br />[color=#00ff00][b][size=6][center]Credits[/center][/size][/b][/color][/b][color=#ffffff]In this case I&#39;ll have to thank Bethesda, the Creation Kit Wiki guys, the official forum guys and anyone sharing their knowledge about coding. Specially JustinOther and Chesko for their skills and code. Special thanks to @Schlangster and @MrPwn(MrJack) for the efforts on SkyUiLib, which is part of this download. All UiLib functions are created by those two modders, I&#39;m just using the tools they&#39;ve granted to us.\r<br />\r<br />DISCLAIMER:\r<br />\r<br />This software is provided &#39;as-is&#39;, without any express or implied\r<br />warranty. In no event shall the authors be held liable for any damages\r<br />arising from the use of this software.[/color][/color]",
  "categoryId": "24",
  "version": "1.3.1",
  "author": "CrEaToXx",
  "createdUnix": "1472374083",
  "updatedUnix": "1492947034",
  "containsAdultContent": false,
  "uploadedBy": "CrEaToXx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000218615",
      "name": "FISS Settings",
      "version": "1.3.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "FISS Settings-78266-1-3-1.7z",
      "uploadedUnix": "1472373841",
      "modVersion": "1.3.1",
      "virusScanUrl": "https://www.virustotal.com/file/d924f93e5877c9395d2cc20623296753e7b6893321278d3d5e2627207b919137/analysis/1472373902/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 6.10.2015, Version 1.3.1:[/color][/size][/b]\r<br />\r<br />- fixed player being affected by aura of fear spell on polearm detterence\r<br />- fixed potential dumb stack critical script bug on polearm detterence firing aura of fear spell when 3d is not loaded\r<br />- fixed two error log problems for cuyc_masterquestscript\r<br />- fixed various error log problems related to none\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2015, Version 1.3:[/color][/size][/b]\r<br />\r<br />- fixed being able to sell carcass to vendors\r<br />- fixed carcass/corpse respawning alive when dropped from your inventory\r<br />- finally and effectively fixed all corpse/carcass in your inventory bug, where a corpse/carcass would return to the living...they will now get killed and moved back to the trash cell when package change/respawn happens on unique characters. Non-unique and respawning actors will just return to their intial place, to prevent further bugs. This will also fix dropping corpses naked from your inventory. Ontop of that it will fix the bug with non-unique actors being dropped with completely different outfits. To give the player information and raise immersion, you will get a notification that the corpse/carcass started to smell and you&#39;ve dropped it from your inventory when not unique, which will effectively remove the corpse/carcass and remove the ability for further processing. This is dependend on how you set up the cell respawn/corpse removal interval...for vanilla this happens after 7-14 ingame days. No longer can you carry non unique corpses around for weeks. And yes, this will also fix any ctd&#39;s whenever you dropped a corpse/carcass from your inventory, though I&#39;m enirely sure, this was not related to CUYC as I was neber able to reproduce it, or experience it.\r<br />- fixed non-unique actors not respawning at their editor location when processed with the grappling hook\r<br />- added missing package evaluation to corpse/carcass aliases\r<br />- added missing touch warning when vampire corpse is burning\r<br />- fixed vampire context messages where still messageboxes instead of notifications\r<br />- reward formula now deducts player level from the reward sum, so basically if you have a higher level then your victim, you will likely not get any money at all...however, this can be compensated by simply raising the reward count in the MCM\r<br />- improved code related to rewards\r<br />- fixed all reward globals not synchronized to mcm values...they will now really have the correct values attached\r<br />- fixed all text related to reward in MCM\r<br />- added all sorts of malificiant cultists to the reward list\r<br />- new feature for cannibals: make blood stew at any grain mill from human parts\r<br />- fixed burial pyre in ivarstead not showing up\r<br />- added quest icons and miscellanous quest so you know where the stewards are to pay your fin/get reward\r<br />- third and hopefully final attempt to fix the stupid grab weight bug...grab force will now start on an absolute maximum on new games and savegames, please let me know if this keeps on happening, as I do not understand what&#39;s exactly causing this...tested this for over an hour on diverse actors with the new fix and it seems to work on new games as well as savegames...knocks on wood\r<br />- you can now set the duration of the hunting license (from 24 to 2160 hours, respectively 1 to 90 days)\r<br />- the hunting license is now a quest object to prevent dropping from inventory\r<br />- improved the widget appearance much\r<br />- widget now shows the days left until hunting license expires\r<br />- when burning carcass you will now get grilled food as drop\r<br />- fixed various name related problems for corpse/carcass in your inventory\r<br />- using the saw on corpses will now count as assault alarm...so do not do this where everybody can see you, canibals aren&#39;t very popular\r<br />- up to 20 actors are now allowed to attain to a ceremonial burial at pyres, the will be randomly put into an alias when the pyre sequence start and run a package...they can do idles like praying, playing the lute, blow a horn in honor of the dead, falling to their knees and do reverence\r<br />- fixed typo on gravestone\r<br />- fixed missing correct text on tombstone activator\r<br />- increased the time for being to replace tombstone to 30 seconds...but you still need to process every tombstone one by one to attach the correct strings, or the tombstones will show the incorrect name&#33;&#33;&#33;\r<br />- the impaled warning will now spread an aura of fear if you choose so. After placement activate the impaled body as usual and you will see a new option &#34;Add Aura of Fear&#34;. Pressing this menu button will add a spell that casts whenever a actor comes close to it (2048 units) and will then be struck by fear and run away in panic\r<br />- added missing sovngarde package behaviour for honored dead that go to sovngard, now they won&#39;t simply stand around in sovngard anylonger\r<br />- added text option in mcm to show reward count and lincense days left fir those that don&#39;t want to use the widget\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.1.2015, Version 1.2:[/color][/size][/b]\r<br />\r<br />- fixed weight still get set for vanilla woodcutters axe instead of corpsecutters axe\r<br />- removed feature to process creature corpses with axe, interaction will be postboned until proper &#39;head on spike&#39; creature polearms are available\r<br />- Draugr corpses can now be processed with corpsecutter axe to place polearm detterence\r<br />- added warning message when trying to process a carcass with corpsecutters axe\r<br />- added fully featured poaching/reward system, completely configurable in MCM, see description to see how system works\r<br />- added rewardcount widget, configurable in MCM menu\r<br />- you can craft clout shovel with normal shovels now\r<br />- corpsecutters axe now craftable in iron section of forge\r<br />- you can no longer burn non unique characters at burial pyres\r<br />- people you burn on pyres will now really go to Sovngarde\r<br />- fixed respawn bug, unique actors will now go to home cell/sovngarde, non-uniques will be processed as usual (needs varification)\r<br />- when your reward count is under -500 due to poaching, you will reported a crime and guards of all holds will arrest you\r<br />- added fugitives to detterence reward list\r<br />- added Thalmors to list of detterence reward\r<br />- added Arvel the Swift to detterence reward list\r<br />- added hawk to list of poaching crime\r<br />- fixed bug when accidentaly giving the hunting license to other containers\r<br />- animals no longer added to (shovel) reward list when previously poached\r<br />- added necromancers to list of axe reward\r<br />- added assassins to list of axe reward\r<br />- added hired thugs to list of axe reward\r<br />- when using Fire Accelerant as poison on weapons, you can ignite actors that are using fire magic, or under the influence of fire magic\r<br />- added delete option to interaction with detterences, tombstones etc.\r<br />- changed detterence ignition logic&#33;&#33;&#33; you no longer need to hold a torch when placing a détterence to ignite it...instead once the detterence is placed, you&#39;ll need to interact with it, apllying fire accelerant and then ignite the detterence with a fire based spell or torch\r<br />- applied all new reward system to torches and fire based spells\r<br />- burning victims can now reduce the amount of fee you get from poaching...hide your evidence\r<br />- effectively removed all animation, fade out and partialy sound whatsoever from any corpse processing feature, just useless and time consuming...I&#39;d like to keep it, but without proper animations and functions this is just useless\r<br />- all messages use notification instead of messageboxes now, to remove game interuption\r<br />- refined most of the scripts to use less code, effectively making them faster\r<br />- increased speed of all tools to improve convenience during processing\r<br />- added much more notifications to make things easier for new users\r<br />- fixed missing check for flame atronach when trying to burn flame atronachs with torches\r<br />- added dialogue option to pay fines at stewards\r<br />- fixed vampire feature still active when Mod turned off or vampire feature turned off\r<br />- when using leach to melt carcass on previously poached passive animals, the previously gained fee count gets deducted\r<br />- you can make fire accelerant from mead with juniper berries now\r<br />- fixed no messages available for mummifier option\r<br />- removed tons of dirty edits related to actors\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.12.2014, Version 1.1.1:[/color][/size][/b]\r<br />\r<br />- added experimental &#39;reward&#39; feature for processing corpses\r<br />- added a MCM option to adjust Grabbing Force\r<br />\r<br />[size=4][b][color=#00FF00]Release 28.9.2014, Version 1.1:[/color][/size][/b]\r<br />\r<br />- the polearm option no longer uses the vanilla woodcutters axe to improve compatibility with other Mods, the new tool is now crafted on a forge with the vanilla axe\r<br />- you can now customize text on almost all burial options (tombstones, mummys, deterrence)\r<br />- default text on said burial options only states name and date of death\r<br />- there&#39;s now 6 different variants of deterrences (including head on spike), you can change deterrence appearance after placement\r<br />- animals/creatures are now allowed to have a tombstone placed\r<br />- heap of earth is no longer a static object, but an activator which you can interact with, you can place a tombstone or your enemys last equipped weapon near the heap\r<br />- tombstones are now allowed to have the last equipped weapon of your enemy placed near them\r<br />- heap of earth is now placeable in real time\r<br />- fixed bug with burial interaction whilst placement, you can no longer interact with burial options whilst placement\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- cleaned the plugin\r<br />- various typo fixes\r<br />- added price option for replacement tombstone variants inside MCM menu\r<br />- when processing corpse with shovel, axe or scalpel, you will be able to poistion the corpse in real tíme where ever you want\r<br />- removed left over edit to vanilla cell\r<br />- all dialogue topics are voiced now\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.6:[/color][/size][/b]\r<br />\r<br />- fixed installer version\r<br />- removed SKSE maintenance code\r<br />- fixed information in MCM menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.5:[/color][/size][/b]\r<br />\r<br />- fixed another very persistent null error related to OnItemRemoved, hope this was the last\r<br />- fixed tools disenchantable on enchanting stations\r<br />\r<br />[size=4][b][color=#00FF00]Release 21.6.2014, Version 0.9.9.4:[/color][/size][/b]\r<br />\r<br />- fixed more scriptlog stack reports related to &#39;none&#39; errors making the fuzzy guys go all fuzzy\r<br />- added option to bury human NPC&#39;s under a heap of earth, place clay in their inventory to do it\r<br />- fixed cheat to put items inside corpses and then carry them, all items get removed now before grabbing them with the hook\r<br />- added MCM option to unclutter the crafting menus, the clutter is inside your head and named pedantism\r<br />- MCM option to turn off burial pyres in cities (they are now turned off by default)\r<br />- fixed various typos\r<br />- added hint for default settings inside the MCM descriptions\r<br />- fixed mummyfiyng tool craftable inside iron menu, it&#39;s now in the steel menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 18.2.2014, Version 0.9.9.3:[/color][/size][/b]\r<br />\r<br />- fixed various scriptlog stack reports causing &#39;none&#39; errors, which do nothing but make the fuzzy guys go all fuzzy^^\r<br />- fixed hotkey needing to save and reload before working\r<br />- fixed fire spells not creating ash piles but burned bodys on human corpses\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9.2:[/color][/size][/b]\r<br />\r<br />- Fixed Hammer tool not working like supposed to\r<br />- Fixed 4 tombstone varaints not correctly working when trying to replace\r<br />- Fixed time discrepancy when using flame based spells or staffs, let corpses stop to burn too earlie\r<br />- Added correct name to grappling hook (previously Body Hook)\r<br />- Fixed grappling hook not being affected by the no weight feature\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9:[/color][/size][/b]\r<br />\r<br />- Fixed bug with corpses/carcasses being placeable in containers\r<br />- corpses/carcasses can no longer be placed in containers\r<br />- Vampire resurrection now optional in MCM menu\r<br />- You can no longer sell any of the CUYC tools\r<br />- Add MCM otpion to toggle weight on CUYC tools, so they won&#39;t weight anything\r<br />- Fixed tombstones getting placed at players feet instead of corpse/carcass\r<br />- Flame based staffs will now burn corpses/carcasses\r<br />- Fixed corpse/carcass name not staying persistent in savegames\r<br />- Added feature to nail someone to a wall, respectively nail it anywhere, even in mid air\r<br />- Added feature to let Vampire die in agony when burned\r<br />- Added missing shovel sound when burrying animals\r<br />- Added option to buy 4 tombstone variants at any Priest of Arkay, you&#39;ll get a license for deliverence, activate regular tombstone with scroll in inventory to fire context menu\r<br />- Fixed various CUYC tool speeds\r<br />- Added burial option for the honorable dead, placed in every major town and village. Activate the Burial Pyre with a corpse/carcass in your inventory to fire context menu\r<br />- Fixed various smaller typos, thanks to a user&#39;s name I forgot\r<br />- Added option to dress someone who&#39;S dead and stripped naked\r<br />- Added .bsl file for translators/localizators\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9.1:[/color][/size][/b]\r<br />\r<br />- fixed NMM installer showing wrong version number\r<br />- fixed various recipes to not work like supposed to\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9:[/color][/size][/b]\r<br />\r<br />- Entirely removed any automatisms, mod completely works now through interaction in real time\r<br />- Length of burn time is now dependent on the quantity of brand accelerator placed into the victims body\r<br />- Flame Atronach and Automatons are now immune against burning, you can only melt, take or bury them\r<br />- Brand Accelerator is now a prerequisite in order to burn bodies...no brand accelerator = no burning\r<br />- burning is now only possible via torch, spell flames and wall of flames, new immersion made this inevitable, due to how other fire based spells applied force to dead bodies, which ruined the whole shaders\r<br />- New tool: &#34;All purpose Broom&#34;, available as reward when completing the Dark Brotherhood questline...this broom is capable of removing anything...immidiately\r<br />- New tool: Fleshsaw, available at the cannibal quest line by killing one of the main protagonists, using this tool on NPCs will remove them and grant you 1 human heart and 4 human flesh\r<br />- Added toggle option to MCM menu to turn on/off messages\r<br />- New tool: Grabbling hook, which is needed to take bodies, completely animated like a weapon\r<br />- New tool: Shovel, needed for burrying humans (tombstone) and creatures (heap), completely animated like a weapon\r<br />- Placing polearms is now done via using axes on corpse/carcass, hold a torch as well to get a burning polearm\r<br />- Added sound to all available options\r<br />- Vanilla Wood Cutters Axe does no longer cause damage on actors, it&#39;S a tool, not a weapon, this is to prevent bugs\r<br />- Leach and Brand Accelerator are poisons again\r<br />\r<br />[size=4][b][color=#00FF00]Release 5.1.2014, Version 0.8:[/color][/size][/b]\r<br />\r<br />- Complete recoding of all main features processed \r<br />- Removed all menu based functions, mod is now highly immersive\r<br />- Bonemeal when burning bodies is now dependend on the size of the creature\r<br />- All options are now more or less animated, you can turn the animations on and off in MCM menu\r<br />- Death Hounds now spawn vampire dust when burned\r<br />- To bury corpses with tombstone you&#39;ll need to place quarried stone from Hearthfire into their dead body\r<br />- Mod now needs all three DLCs\r<br />- Fixed ominous light bug once and for all (hopefully :D )\r<br />- Fixed ominous error log message spam, that did never happen for me in the first place (so I&#39;m not really aware if I fixed it and if there ever was something to fix^^ )\r<br />- Functions like this now: To bury you&#39;ll need pickaxe equipped in right hand, to burn you&#39;ll need torch equipped or fire magic equipped in both hands, to melt you&#39;ll need to place the leach in your victims inventory when dead, to prolong burn time, you&#39;ll need to place brand accelerator in your victims inventory when dead, to take a dead body, you&#39;ll need to equip your fists only, if you have non of either true, you will open their inventory like regular, the events will always fire true, so beware what you have in your hands before touching a body\r<br />- Fixed giant races takeable\r<br />- Brand Accelerator is now an ingredient and made less expensive\r<br />- Fixed respawning corpse containers\r<br />- Fixed barbecue corpses coliding with Nav Mesh\r<br />- You can no longer burn automatons or flame atronachs\r<br />- Fixed critical bug with occasionally freezing NPCs (enable they AI back idiot&#33;&#33;&#33;)\r<br />- Removed standalone remove feature\r<br />- No more interior restrictions (this might be changed in future again, dependent on user) feedback\r<br />\r<br />[size=4][b][color=#00FF00]Release 13.12.2013, Version 0.7.3:[/color][/size][/b]\r<br />\r<br />- If you have garlic in your inventory, it will be automatically placed on Vampire corpses, on ALL options, to prevent them from resurrecting\r<br />- Fixed various smaller bugs with Vampire checks in scripts not firing certain options\r<br />- Vampires will now be resurrected if you grab them\r<br />- Fixed bug being able to activate Vampires again, when they resurrect, melt or burn\r<br />- If you melt or burn NPCs/Vampires now, all their items will automatically placed in yourinventory \r<br />\r<br />[size=4][b][color=#00FF00]Release 7.12.2013, Version 0.7.2:[/color][/size][/b]\r<br />\r<br />- Fixed heat source/illumination staying persistent on heavily modded games, or with high script latency\r<br />- Added missing extra damage on carcasses when burned with brand accelerator\r<br />- Added missing bonemeal spawn for creatures/animal when burning them\r<br />\r<br />[size=4][b][color=#00FF00]Release 31.11.2013, Version 0.7.1:[/color][/size][/b]\r<br />\r<br />- Changed code to raise compatibility with Take Notes journal mod\r<br />\r<br />[size=4][b][color=#00FF00]Release 30.11.2013, Version 0.7:[/color][/size][/b]\r<br />\r<br />- New bury option &#34;Mummy&#34; preserving corpses, you&#39;ll need any embalming tool plus 5 linen wraps to mumify a corpse\r<br />- Added a digging sound for all bury options\r<br />- Finally and effectively fixed the vampire dust ingredient still present in vampire corpses after killing them, it&#39;s now done via special perk\r<br />- Vampire resurrection after disturbing their sleep now has a animation, shader effect and sound applied to it, looks much more better now\r<br />- Warning when disturbing sleep of a vampire is now a messagebox\r<br />- Vampire resurrection feature now also works when not activating vampire corpse in sneak stance\r<br />- Fixed leach not getting removed from player inventory when corpse is molden\r<br />- Fixed typo in warning option &#34;fade&#34; to &#34;fate&#34;\r<br />\r<br />[size=4][b][color=#00FF00]Release 2.02.2013, Version 0.6:[/color][/size][/b]\r<br />\r<br />- Hotkey is no longer O, it&#39;s unbound, so you&#39;ll need to rebind it when starting/updating the mod\r<br />- You&#39;re no longer allowed to sell carcasses at vendors. Reason: destroys respawn of leveled actors/creatures\r<br />- When using the Ahses to Ashes burning function either Bonemeal or Vampire Dust gets placed inside the Ash Pile\r<br />- Vampires will no longer drop Vampire Dust as death item, you&#39;ll need to burn them to get the ingredient\r<br />- Fixed the leach description so you&#39;ll actually know what it does\r<br />- The Fire Shout is no longer in the list of fire sources to burn bodies, reason: bugs, bugs, bugs\r<br />- Added new burial option: Stone Cairns\r<br />- Added new burial option: Polearm Deterrence\r<br />- Added new burn option: Burning Polearm Deterrence (made specially for interiors)\r<br />- Added new function to increase burning time on corpses/carcasses. You&#39;ll now need brand accelerator to increase burning time. Brand accelerator can be crafted from various ingredients at cookpots.\r<br />- New feature: Vampires resurrect if you disturb their sleep. How does it work? If you killed a Vampire and you do not choose to bury, burn, melt or just leave him alone, he will rise again. You will get a notification when distrubing his sleep. This will happen if you search his inventory, try to melt, burn or bury him with the fitting prerequisite in your inventory, or when you try to take the vampire corpse\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5.1:[/color][/size][/b]\r<br />\r<br />- Fixed NMM installer showing wrong version number\r<br />- Fixed not being able to take carcasses, except Dragons, Mammoth and Giants\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5:[/color][/size][/b]\r<br />\r<br />- Improved ReadMe for user convenience\r<br />- Cleaned the plugin removing 44 identical to master entries\r<br />- Fixed bug with carcasses having enormous prizes\r<br />- Fixed MCM menu not showing up when starting a new game\r<br />- Changed feature: Removing corpses/carcasses is now only possible with leach in your inventory (nice melting effect added). Craft leach at regular cooking stations from salt, spider poison and bonemeal\r<br />- Removed accidentaly leftover Debug.Notification from previous version\r<br />- Added a standalone &#39;remove only&#39; option in the mcm menu. Doesn&#39;t have any prerequisites. Can be used with or without the original features\r<br />- You can no longer sell humanoid corpses at regular vendors. Selling human corpses is preserved for future versions\r<br />- Taking corpses now adds a corpse dummy with the corpse/carcass name. Dropping the dummy out of your inventory will put the corpse/carcass at your feet and remove the dummy. So yes, this means you&#39;re now able to carry around corpses in your inventory. Only one corpse/carcass allowed\r<br />- Corpse/Carcass dummys now reflect their counterparts real weight\r<br />- Corpse/Carcass dummys now reflect their counterparts real name\r<br />- Corpse/Carcass dummys now reflect their counterparts real value depending on NPC/Creaure weight. Needs to be finetuned in future versions, but should be much more convenient then past versions\r<br />- You&#39;re no longer allowed to carry around Dragon, Giant or Mammoth carcasses. Future updates might contain even more limitations, like horses for example\r<br />- Partially restored the old fire effect, but it&#39;s a hazard now. This means entering any burning corpse/carcas will burn you and damage health. Be very carefull when using the Bonfire option&#33;&#33;&#33;\r<br />- Fixed tombstones not showing the correct DoD. It&#39;s still not 100% correct, but should be clother to the exact Dod +- 1 (or 2 in rare cases)\r<br />- Siginificantly raised health damage to bonfire option when entering the burn radius to close\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.01.2013, Version 0.4:[/color][/size][/b]\r<br />\r<br />- Fixed bug with &#39;FuneralDummys&#39; appearing in Karthwasten, Dragon Bridge and College of Winterhold\r<br />- Support for Frostfall added: Burning corpses now keeps you from getting colder. Burning Corpses work like campfires, in order to make complete use of them, you&#39;ll need to have a tent build or wear warm clothes. Additionally the amount of exposure rate reduction is dependend on how close to the heat source you are. Burning corpses to grilled body or ash pile will last 30 seconds, burning them to &#39;Bonfire&#39; will last 60 seconds, have higher exposure rate reduction, but needs dwarven oil.\r<br />- Changed &#39;let them burn&#39; to &#39;bonfire&#39;.\r<br />- Once a corpse is ignited you can no longer touch it aka modifie it in any way. Touching it will ignite you and damage your health. Additionally you&#39;ll now need to keep your distance when ignite a body or you get burned. Fire hurts now&#33;&#33;&#33; If you chose the bonfire option a puddle of oil will be placed at the corpse, entering it&#39;S radius will ignite you damage you.\r<br />- Fixed corpses being burnable again once ignited.\r<br />- Once ignited the corpse can no longer be moved.\r<br />- Added MCM support to turn the mod off and on at will.\r<br />- Added hotkey (default:o like onion, not null) to switch between turned off and on. Can be redefined inside the MCM menu.\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.01.2013, Version 0.3:[/color][/size][/b]\r<br />\r<br />- Fixed SKSE check not properly showing on init and loading game\r<br />- Fixed FOMM Installer showing wrong mod version for people that are all high on correct numbers\r<br />- Fixed critical bug when transfering to Solitude to bury a corpse where you ended somewhere in nowhere\r<br />- Changed feature: Bury corpses at home will now transfer you and the corpse to the cemetry without automatically placing a tombstone, instead you&#39;ll now need to place the corpse how you want it and then again activating the corpse while sneaking and choose &#39;Right here&#33;&#39;\r<br />- Fixed bug when taking a corpse/carcass and removing it from your inventory it showed the &#39;You can&#39;t carry anymore corpses/charcasses&#39; message. It will now only show this message when actually there&#39;s a corpse/charcass inside your inventory\r<br />- New feature: Bury any unique corpse in one of the major cities. Supported cities are: Whiterun, Riften, Windhelm, Solitude, Markarth, Dawnstar, Falkreath, Morthal\r<br />- You can now burn corpses if you have either a torch equipped, a fire related spell equipped, or a fire related shout equipped\r<br />- Removed equipping your torch when burning corpses\r<br />- Added a message so that you can no longer bury corpses/charcasses inside interiors (buildings)...which effectively means, you&#39;re no longer allowed to bury corpses in interior cells\r<br />- You&#39;ll now need a shovel in your inventory to bury corpses/charcasses\r<br />- Rearranged the message priorization like this: Search Corpse, Remove Corpse, Take Corpse, Burn Corpse, Bury Corpse...same if for charcasses\r<br />- Added two more tombstone variants, including a huge graveplate\r<br />- Added &#39;Bury at home&#39; support to Dragon Bridge, Karthwasten and Winterhold College\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.01.2013, Version 0.2:[/color][/size][/b]\r<br />\r<br />- Added feature: Bury Human Corpses. Comes in two versions, bury them right where they are, or, if unique actor, bury them at their hometwons. Supported places so far: Dawnstar, Ivarstead, Morthal, Riverwood, Rorikstead, Whiterun, Solitude, Windhelm, Winterhold, Riften, Markarth, Falkreath. The place where you bury the dead will then have a tombstone set. This applies to unique as well as leveled actors. Leveled actors can only be burried right in place as they usually have no name or hometown to determine. When burying the corpse their inventory will be burried with them, so make sure to get the inventory before you bury the bodies.\r<br />- Added feature: Bury Carcass. You&#39;re able to bury carcasess where you layed them down. A rubbel of dirt with a stone on top will hen placed where you burried the carcass.\r<br /> This applies to ALL creatures. \r<br />- Added feature: Burn corpses three variants. Barbecue -&gt; corpse will be burned and leaves a grilled body behind. Ashes to Ashes -&gt; corpse will be burned and leaves an ash pile behind. Just burn them -&gt; burns the corpse forever or until you decide to do something else with the corpse. When bunring the corpse their inventory will be burned with them, so make sure to get the inventory before you burn the bodies.\r<br />- Added feature: Burn carcass. Has only one flavor. Burn the carcass to an ash pile. Inventory will be burned with them so get it before you&#39;ll burn them.\r<br />- To burn corpses or charcasess you&#39;ll need a torch in your inventory.\r<br />- Completely removed disable/delete from the master perk script. This will effectively fix the bug of no returning leveled spawns.\r<br />- You can now take human corpses and sell them for a very high prize...well I guess you know where...not at vendors.\r<br />\r<br />[size=4][b][color=#00FF00]Release 4.01.2013, Version 0.1:[/color][/size][/b]\r<br />\r<br />- added feature to remove corpses or take them into your inventory to be sold at vendors\r<br />- human corpses can only be removed, not be sold\r<br />- corpses inventory weight when taken gets determined ony the creatures height / 10\r<br />- corpses gold value is determined on creatures height: height &lt; 35 = 10 gold, height &lt; 90 = 100 gold, height &gt; 90 = 200 gold <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FISS%20Settings-78266-1-3-1.7z?fid=1000218615&ttl=1535866964&ri=8192&rs=8192&setec=2bfb31b18988142f414c176d7e1bf3a2"
    },
    {
      "fileId": "1000242537",
      "name": "Clean up your Corpses",
      "version": "1.3.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1307",
      "fileName": "Clean up your Corpses-78266-1-3-2.7z",
      "uploadedUnix": "1492946922",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/a79425d4976b16781d5d8379f2f621cd33d1938a424fa55228c789627f5223b3/analysis/1492947127/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 23.4.2017, Version 1.3.2:[/color][/size][/b]\r<br />\r<br />- fixed various error log problems related to none entries\r<br />- fixed wild edit on navmesh(seriously i don&#39;t know where that came from???)\r<br />- forwarded all recent changes from USLEEP\r<br />- CUYC has USLEEP as master now\r<br />- fixed vampire thralls not being on the reward list\r<br />- added Helgen torturer and assistant to reward list\r<br />- actors will use voice and sound now when attaining a ceremonial burial\r<br />- fixed reward count deduction on to high player level, instead you will get a notification now, that you&#39;ve killed an unworthy enemy\r<br />- fixed mcm float numbers on sliders\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.10.2015, Version 1.3.1:[/color][/size][/b]\r<br />\r<br />- fixed player being affected by aura of fear spell on polearm detterence\r<br />- fixed potential dumb stack critical script bug on polearm detterence firing aura of fear spell when 3d is not loaded\r<br />- fixed two error log problems for cuyc_masterquestscript\r<br />- fixed various error log problems related to none\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2015, Version 1.3:[/color][/size][/b]\r<br />\r<br />- fixed being able to sell carcass to vendors\r<br />- fixed carcass/corpse respawning alive when dropped from your inventory\r<br />- finally and effectively fixed all corpse/carcass in your inventory bug, where a corpse/carcass would return to the living...they will now get killed and moved back to the trash cell when package change/respawn happens on unique characters. Non-unique and respawning actors will just return to their intial place, to prevent further bugs. This will also fix dropping corpses naked from your inventory. Ontop of that it will fix the bug with non-unique actors being dropped with completely different outfits. To give the player information and raise immersion, you will get a notification that the corpse/carcass started to smell and you&#39;ve dropped it from your inventory when not unique, which will effectively remove the corpse/carcass and remove the ability for further processing. This is dependend on how you set up the cell respawn/corpse removal interval...for vanilla this happens after 7-14 ingame days. No longer can you carry non unique corpses around for weeks. And yes, this will also fix any ctd&#39;s whenever you dropped a corpse/carcass from your inventory, though I&#39;m enirely sure, this was not related to CUYC as I was neber able to reproduce it, or experience it.\r<br />- fixed non-unique actors not respawning at their editor location when processed with the grappling hook\r<br />- added missing package evaluation to corpse/carcass aliases\r<br />- added missing touch warning when vampire corpse is burning\r<br />- fixed vampire context messages where still messageboxes instead of notifications\r<br />- reward formula now deducts player level from the reward sum, so basically if you have a higher level then your victim, you will likely not get any money at all...however, this can be compensated by simply raising the reward count in the MCM\r<br />- improved code related to rewards\r<br />- fixed all reward globals not synchronized to mcm values...they will now really have the correct values attached\r<br />- fixed all text related to reward in MCM\r<br />- added all sorts of malificiant cultists to the reward list\r<br />- new feature for cannibals: make blood stew at any grain mill from human parts\r<br />- fixed burial pyre in ivarstead not showing up\r<br />- added quest icons and miscellanous quest so you know where the stewards are to pay your fin/get reward\r<br />- third and hopefully final attempt to fix the stupid grab weight bug...grab force will now start on an absolute maximum on new games and savegames, please let me know if this keeps on happening, as I do not understand what&#39;s exactly causing this...tested this for over an hour on diverse actors with the new fix and it seems to work on new games as well as savegames...knocks on wood\r<br />- you can now set the duration of the hunting license (from 24 to 2160 hours, respectively 1 to 90 days)\r<br />- the hunting license is now a quest object to prevent dropping from inventory\r<br />- improved the widget appearance much\r<br />- widget now shows the days left until hunting license expires\r<br />- when burning carcass you will now get grilled food as drop\r<br />- fixed various name related problems for corpse/carcass in your inventory\r<br />- using the saw on corpses will now count as assault alarm...so do not do this where everybody can see you, canibals aren&#39;t very popular\r<br />- up to 20 actors are now allowed to attain to a ceremonial burial at pyres, the will be randomly put into an alias when the pyre sequence start and run a package...they can do idles like praying, playing the lute, blow a horn in honor of the dead, falling to their knees and do reverence\r<br />- fixed typo on gravestone\r<br />- fixed missing correct text on tombstone activator\r<br />- increased the time for being to replace tombstone to 30 seconds...but you still need to process every tombstone one by one to attach the correct strings, or the tombstones will show the incorrect name&#33;&#33;&#33;\r<br />- the impaled warning will now spread an aura of fear if you choose so. After placement activate the impaled body as usual and you will see a new option &#34;Add Aura of Fear&#34;. Pressing this menu button will add a spell that casts whenever a actor comes close to it (2048 units) and will then be struck by fear and run away in panic\r<br />- added missing sovngarde package behaviour for honored dead that go to sovngard, now they won&#39;t simply stand around in sovngard anylonger\r<br />- added text option in mcm to show reward count and lincense days left fir those that don&#39;t want to use the widget\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.1.2015, Version 1.2:[/color][/size][/b]\r<br />\r<br />- fixed weight still get set for vanilla woodcutters axe instead of corpsecutters axe\r<br />- removed feature to process creature corpses with axe, interaction will be postboned until proper &#39;head on spike&#39; creature polearms are available\r<br />- Draugr corpses can now be processed with corpsecutter axe to place polearm detterence\r<br />- added warning message when trying to process a carcass with corpsecutters axe\r<br />- added fully featured poaching/reward system, completely configurable in MCM, see description to see how system works\r<br />- added rewardcount widget, configurable in MCM menu\r<br />- you can craft clout shovel with normal shovels now\r<br />- corpsecutters axe now craftable in iron section of forge\r<br />- you can no longer burn non unique characters at burial pyres\r<br />- people you burn on pyres will now really go to Sovngarde\r<br />- fixed respawn bug, unique actors will now go to home cell/sovngarde, non-uniques will be processed as usual (needs varification)\r<br />- when your reward count is under -500 due to poaching, you will reported a crime and guards of all holds will arrest you\r<br />- added fugitives to detterence reward list\r<br />- added Thalmors to list of detterence reward\r<br />- added Arvel the Swift to detterence reward list\r<br />- added hawk to list of poaching crime\r<br />- fixed bug when accidentaly giving the hunting license to other containers\r<br />- animals no longer added to (shovel) reward list when previously poached\r<br />- added necromancers to list of axe reward\r<br />- added assassins to list of axe reward\r<br />- added hired thugs to list of axe reward\r<br />- when using Fire Accelerant as poison on weapons, you can ignite actors that are using fire magic, or under the influence of fire magic\r<br />- added delete option to interaction with detterences, tombstones etc.\r<br />- changed detterence ignition logic&#33;&#33;&#33; you no longer need to hold a torch when placing a détterence to ignite it...instead once the detterence is placed, you&#39;ll need to interact with it, apllying fire accelerant and then ignite the detterence with a fire based spell or torch\r<br />- applied all new reward system to torches and fire based spells\r<br />- burning victims can now reduce the amount of fee you get from poaching...hide your evidence\r<br />- effectively removed all animation, fade out and partialy sound whatsoever from any corpse processing feature, just useless and time consuming...I&#39;d like to keep it, but without proper animations and functions this is just useless\r<br />- all messages use notification instead of messageboxes now, to remove game interuption\r<br />- refined most of the scripts to use less code, effectively making them faster\r<br />- increased speed of all tools to improve convenience during processing\r<br />- added much more notifications to make things easier for new users\r<br />- fixed missing check for flame atronach when trying to burn flame atronachs with torches\r<br />- added dialogue option to pay fines at stewards\r<br />- fixed vampire feature still active when Mod turned off or vampire feature turned off\r<br />- when using leach to melt carcass on previously poached passive animals, the previously gained fee count gets deducted\r<br />- you can make fire accelerant from mead with juniper berries now\r<br />- fixed no messages available for mummifier option\r<br />- removed tons of dirty edits related to actors\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.12.2014, Version 1.1.1:[/color][/size][/b]\r<br />\r<br />- added experimental &#39;reward&#39; feature for processing corpses\r<br />- added a MCM option to adjust Grabbing Force\r<br />\r<br />[size=4][b][color=#00FF00]Release 28.9.2014, Version 1.1:[/color][/size][/b]\r<br />\r<br />- the polearm option no longer uses the vanilla woodcutters axe to improve compatibility with other Mods, the new tool is now crafted on a forge with the vanilla axe\r<br />- you can now customize text on almost all burial options (tombstones, mummys, deterrence)\r<br />- default text on said burial options only states name and date of death\r<br />- there&#39;s now 6 different variants of deterrences (including head on spike), you can change deterrence appearance after placement\r<br />- animals/creatures are now allowed to have a tombstone placed\r<br />- heap of earth is no longer a static object, but an activator which you can interact with, you can place a tombstone or your enemys last equipped weapon near the heap\r<br />- tombstones are now allowed to have the last equipped weapon of your enemy placed near them\r<br />- heap of earth is now placeable in real time\r<br />- fixed bug with burial interaction whilst placement, you can no longer interact with burial options whilst placement\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- cleaned the plugin\r<br />- various typo fixes\r<br />- added price option for replacement tombstone variants inside MCM menu\r<br />- when processing corpse with shovel, axe or scalpel, you will be able to poistion the corpse in real tíme where ever you want\r<br />- removed left over edit to vanilla cell\r<br />- all dialogue topics are voiced now\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.6:[/color][/size][/b]\r<br />\r<br />- fixed installer version\r<br />- removed SKSE maintenance code\r<br />- fixed information in MCM menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.5:[/color][/size][/b]\r<br />\r<br />- fixed another very persistent null error related to OnItemRemoved, hope this was the last\r<br />- fixed tools disenchantable on enchanting stations\r<br />\r<br />[size=4][b][color=#00FF00]Release 21.6.2014, Version 0.9.9.4:[/color][/size][/b]\r<br />\r<br />- fixed more scriptlog stack reports related to &#39;none&#39; errors making the fuzzy guys go all fuzzy\r<br />- added option to bury human NPC&#39;s under a heap of earth, place clay in their inventory to do it\r<br />- fixed cheat to put items inside corpses and then carry them, all items get removed now before grabbing them with the hook\r<br />- added MCM option to unclutter the crafting menus, the clutter is inside your head and named pedantism\r<br />- MCM option to turn off burial pyres in cities (they are now turned off by default)\r<br />- fixed various typos\r<br />- added hint for default settings inside the MCM descriptions\r<br />- fixed mummyfiyng tool craftable inside iron menu, it&#39;s now in the steel menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 18.2.2014, Version 0.9.9.3:[/color][/size][/b]\r<br />\r<br />- fixed various scriptlog stack reports causing &#39;none&#39; errors, which do nothing but make the fuzzy guys go all fuzzy^^\r<br />- fixed hotkey needing to save and reload before working\r<br />- fixed fire spells not creating ash piles but burned bodys on human corpses\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9.2:[/color][/size][/b]\r<br />\r<br />- Fixed Hammer tool not working like supposed to\r<br />- Fixed 4 tombstone varaints not correctly working when trying to replace\r<br />- Fixed time discrepancy when using flame based spells or staffs, let corpses stop to burn too earlie\r<br />- Added correct name to grappling hook (previously Body Hook)\r<br />- Fixed grappling hook not being affected by the no weight feature\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9:[/color][/size][/b]\r<br />\r<br />- Fixed bug with corpses/carcasses being placeable in containers\r<br />- corpses/carcasses can no longer be placed in containers\r<br />- Vampire resurrection now optional in MCM menu\r<br />- You can no longer sell any of the CUYC tools\r<br />- Add MCM otpion to toggle weight on CUYC tools, so they won&#39;t weight anything\r<br />- Fixed tombstones getting placed at players feet instead of corpse/carcass\r<br />- Flame based staffs will now burn corpses/carcasses\r<br />- Fixed corpse/carcass name not staying persistent in savegames\r<br />- Added feature to nail someone to a wall, respectively nail it anywhere, even in mid air\r<br />- Added feature to let Vampire die in agony when burned\r<br />- Added missing shovel sound when burrying animals\r<br />- Added option to buy 4 tombstone variants at any Priest of Arkay, you&#39;ll get a license for deliverence, activate regular tombstone with scroll in inventory to fire context menu\r<br />- Fixed various CUYC tool speeds\r<br />- Added burial option for the honorable dead, placed in every major town and village. Activate the Burial Pyre with a corpse/carcass in your inventory to fire context menu\r<br />- Fixed various smaller typos, thanks to a user&#39;s name I forgot\r<br />- Added option to dress someone who&#39;S dead and stripped naked\r<br />- Added .bsl file for translators/localizators\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9.1:[/color][/size][/b]\r<br />\r<br />- fixed NMM installer showing wrong version number\r<br />- fixed various recipes to not work like supposed to\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9:[/color][/size][/b]\r<br />\r<br />- Entirely removed any automatisms, mod completely works now through interaction in real time\r<br />- Length of burn time is now dependent on the quantity of brand accelerator placed into the victims body\r<br />- Flame Atronach and Automatons are now immune against burning, you can only melt, take or bury them\r<br />- Brand Accelerator is now a prerequisite in order to burn bodies...no brand accelerator = no burning\r<br />- burning is now only possible via torch, spell flames and wall of flames, new immersion made this inevitable, due to how other fire based spells applied force to dead bodies, which ruined the whole shaders\r<br />- New tool: &#34;All purpose Broom&#34;, available as reward when completing the Dark Brotherhood questline...this broom is capable of removing anything...immidiately\r<br />- New tool: Fleshsaw, available at the cannibal quest line by killing one of the main protagonists, using this tool on NPCs will remove them and grant you 1 human heart and 4 human flesh\r<br />- Added toggle option to MCM menu to turn on/off messages\r<br />- New tool: Grabbling hook, which is needed to take bodies, completely animated like a weapon\r<br />- New tool: Shovel, needed for burrying humans (tombstone) and creatures (heap), completely animated like a weapon\r<br />- Placing polearms is now done via using axes on corpse/carcass, hold a torch as well to get a burning polearm\r<br />- Added sound to all available options\r<br />- Vanilla Wood Cutters Axe does no longer cause damage on actors, it&#39;S a tool, not a weapon, this is to prevent bugs\r<br />- Leach and Brand Accelerator are poisons again\r<br />\r<br />[size=4][b][color=#00FF00]Release 5.1.2014, Version 0.8:[/color][/size][/b]\r<br />\r<br />- Complete recoding of all main features processed \r<br />- Removed all menu based functions, mod is now highly immersive\r<br />- Bonemeal when burning bodies is now dependend on the size of the creature\r<br />- All options are now more or less animated, you can turn the animations on and off in MCM menu\r<br />- Death Hounds now spawn vampire dust when burned\r<br />- To bury corpses with tombstone you&#39;ll need to place quarried stone from Hearthfire into their dead body\r<br />- Mod now needs all three DLCs\r<br />- Fixed ominous light bug once and for all (hopefully :D )\r<br />- Fixed ominous error log message spam, that did never happen for me in the first place (so I&#39;m not really aware if I fixed it and if there ever was something to fix^^ )\r<br />- Functions like this now: To bury you&#39;ll need pickaxe equipped in right hand, to burn you&#39;ll need torch equipped or fire magic equipped in both hands, to melt you&#39;ll need to place the leach in your victims inventory when dead, to prolong burn time, you&#39;ll need to place brand accelerator in your victims inventory when dead, to take a dead body, you&#39;ll need to equip your fists only, if you have non of either true, you will open their inventory like regular, the events will always fire true, so beware what you have in your hands before touching a body\r<br />- Fixed giant races takeable\r<br />- Brand Accelerator is now an ingredient and made less expensive\r<br />- Fixed respawning corpse containers\r<br />- Fixed barbecue corpses coliding with Nav Mesh\r<br />- You can no longer burn automatons or flame atronachs\r<br />- Fixed critical bug with occasionally freezing NPCs (enable they AI back idiot&#33;&#33;&#33;)\r<br />- Removed standalone remove feature\r<br />- No more interior restrictions (this might be changed in future again, dependent on user) feedback\r<br />\r<br />[size=4][b][color=#00FF00]Release 13.12.2013, Version 0.7.3:[/color][/size][/b]\r<br />\r<br />- If you have garlic in your inventory, it will be automatically placed on Vampire corpses, on ALL options, to prevent them from resurrecting\r<br />- Fixed various smaller bugs with Vampire checks in scripts not firing certain options\r<br />- Vampires will now be resurrected if you grab them\r<br />- Fixed bug being able to activate Vampires again, when they resurrect, melt or burn\r<br />- If you melt or burn NPCs/Vampires now, all their items will automatically placed in yourinventory \r<br />\r<br />[size=4][b][color=#00FF00]Release 7.12.2013, Version 0.7.2:[/color][/size][/b]\r<br />\r<br />- Fixed heat source/illumination staying persistent on heavily modded games, or with high script latency\r<br />- Added missing extra damage on carcasses when burned with brand accelerator\r<br />- Added missing bonemeal spawn for creatures/animal when burning them\r<br />\r<br />[size=4][b][color=#00FF00]Release 31.11.2013, Version 0.7.1:[/color][/size][/b]\r<br />\r<br />- Changed code to raise compatibility with Take Notes journal mod\r<br />\r<br />[size=4][b][color=#00FF00]Release 30.11.2013, Version 0.7:[/color][/size][/b]\r<br />\r<br />- New bury option &#34;Mummy&#34; preserving corpses, you&#39;ll need any embalming tool plus 5 linen wraps to mumify a corpse\r<br />- Added a digging sound for all bury options\r<br />- Finally and effectively fixed the vampire dust ingredient still present in vampire corpses after killing them, it&#39;s now done via special perk\r<br />- Vampire resurrection after disturbing their sleep now has a animation, shader effect and sound applied to it, looks much more better now\r<br />- Warning when disturbing sleep of a vampire is now a messagebox\r<br />- Vampire resurrection feature now also works when not activating vampire corpse in sneak stance\r<br />- Fixed leach not getting removed from player inventory when corpse is molden\r<br />- Fixed typo in warning option &#34;fade&#34; to &#34;fate&#34;\r<br />\r<br />[size=4][b][color=#00FF00]Release 2.02.2013, Version 0.6:[/color][/size][/b]\r<br />\r<br />- Hotkey is no longer O, it&#39;s unbound, so you&#39;ll need to rebind it when starting/updating the mod\r<br />- You&#39;re no longer allowed to sell carcasses at vendors. Reason: destroys respawn of leveled actors/creatures\r<br />- When using the Ahses to Ashes burning function either Bonemeal or Vampire Dust gets placed inside the Ash Pile\r<br />- Vampires will no longer drop Vampire Dust as death item, you&#39;ll need to burn them to get the ingredient\r<br />- Fixed the leach description so you&#39;ll actually know what it does\r<br />- The Fire Shout is no longer in the list of fire sources to burn bodies, reason: bugs, bugs, bugs\r<br />- Added new burial option: Stone Cairns\r<br />- Added new burial option: Polearm Deterrence\r<br />- Added new burn option: Burning Polearm Deterrence (made specially for interiors)\r<br />- Added new function to increase burning time on corpses/carcasses. You&#39;ll now need brand accelerator to increase burning time. Brand accelerator can be crafted from various ingredients at cookpots.\r<br />- New feature: Vampires resurrect if you disturb their sleep. How does it work? If you killed a Vampire and you do not choose to bury, burn, melt or just leave him alone, he will rise again. You will get a notification when distrubing his sleep. This will happen if you search his inventory, try to melt, burn or bury him with the fitting prerequisite in your inventory, or when you try to take the vampire corpse\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5.1:[/color][/size][/b]\r<br />\r<br />- Fixed NMM installer showing wrong version number\r<br />- Fixed not being able to take carcasses, except Dragons, Mammoth and Giants\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5:[/color][/size][/b]\r<br />\r<br />- Improved ReadMe for user convenience\r<br />- Cleaned the plugin removing 44 identical to master entries\r<br />- Fixed bug with carcasses having enormous prizes\r<br />- Fixed MCM menu not showing up when starting a new game\r<br />- Changed feature: Removing corpses/carcasses is now only possible with leach in your inventory (nice melting effect added). Craft leach at regular cooking stations from salt, spider poison and bonemeal\r<br />- Removed accidentaly leftover Debug.Notification from previous version\r<br />- Added a standalone &#39;remove only&#39; option in the mcm menu. Doesn&#39;t have any prerequisites. Can be used with or without the original features\r<br />- You can no longer sell humanoid corpses at regular vendors. Selling human corpses is preserved for future versions\r<br />- Taking corpses now adds a corpse dummy with the corpse/carcass name. Dropping the dummy out of your inventory will put the corpse/carcass at your feet and remove the dummy. So yes, this means you&#39;re now able to carry around corpses in your inventory. Only one corpse/carcass allowed\r<br />- Corpse/Carcass dummys now reflect their counterparts real weight\r<br />- Corpse/Carcass dummys now reflect their counterparts real name\r<br />- Corpse/Carcass dummys now reflect their counterparts real value depending on NPC/Creaure weight. Needs to be finetuned in future versions, but should be much more convenient then past versions\r<br />- You&#39;re no longer allowed to carry around Dragon, Giant or Mammoth carcasses. Future updates might contain even more limitations, like horses for example\r<br />- Partially restored the old fire effect, but it&#39;s a hazard now. This means entering any burning corpse/carcas will burn you and damage health. Be very carefull when using the Bonfire option&#33;&#33;&#33;\r<br />- Fixed tombstones not showing the correct DoD. It&#39;s still not 100% correct, but should be clother to the exact Dod +- 1 (or 2 in rare cases)\r<br />- Siginificantly raised health damage to bonfire option when entering the burn radius to close\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.01.2013, Version 0.4:[/color][/size][/b]\r<br />\r<br />- Fixed bug with &#39;FuneralDummys&#39; appearing in Karthwasten, Dragon Bridge and College of Winterhold\r<br />- Support for Frostfall added: Burning corpses now keeps you from getting colder. Burning Corpses work like campfires, in order to make complete use of them, you&#39;ll need to have a tent build or wear warm clothes. Additionally the amount of exposure rate reduction is dependend on how close to the heat source you are. Burning corpses to grilled body or ash pile will last 30 seconds, burning them to &#39;Bonfire&#39; will last 60 seconds, have higher exposure rate reduction, but needs dwarven oil.\r<br />- Changed &#39;let them burn&#39; to &#39;bonfire&#39;.\r<br />- Once a corpse is ignited you can no longer touch it aka modifie it in any way. Touching it will ignite you and damage your health. Additionally you&#39;ll now need to keep your distance when ignite a body or you get burned. Fire hurts now&#33;&#33;&#33; If you chose the bonfire option a puddle of oil will be placed at the corpse, entering it&#39;S radius will ignite you damage you.\r<br />- Fixed corpses being burnable again once ignited.\r<br />- Once ignited the corpse can no longer be moved.\r<br />- Added MCM support to turn the mod off and on at will.\r<br />- Added hotkey (default:o like onion, not null) to switch between turned off and on. Can be redefined inside the MCM menu.\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.01.2013, Version 0.3:[/color][/size][/b]\r<br />\r<br />- Fixed SKSE check not properly showing on init and loading game\r<br />- Fixed FOMM Installer showing wrong mod version for people that are all high on correct numbers\r<br />- Fixed critical bug when transfering to Solitude to bury a corpse where you ended somewhere in nowhere\r<br />- Changed feature: Bury corpses at home will now transfer you and the corpse to the cemetry without automatically placing a tombstone, instead you&#39;ll now need to place the corpse how you want it and then again activating the corpse while sneaking and choose &#39;Right here&#33;&#39;\r<br />- Fixed bug when taking a corpse/carcass and removing it from your inventory it showed the &#39;You can&#39;t carry anymore corpses/charcasses&#39; message. It will now only show this message when actually there&#39;s a corpse/charcass inside your inventory\r<br />- New feature: Bury any unique corpse in one of the major cities. Supported cities are: Whiterun, Riften, Windhelm, Solitude, Markarth, Dawnstar, Falkreath, Morthal\r<br />- You can now burn corpses if you have either a torch equipped, a fire related spell equipped, or a fire related shout equipped\r<br />- Removed equipping your torch when burning corpses\r<br />- Added a message so that you can no longer bury corpses/charcasses inside interiors (buildings)...which effectively means, you&#39;re no longer allowed to bury corpses in interior cells\r<br />- You&#39;ll now need a shovel in your inventory to bury corpses/charcasses\r<br />- Rearranged the message priorization like this: Search Corpse, Remove Corpse, Take Corpse, Burn Corpse, Bury Corpse...same if for charcasses\r<br />- Added two more tombstone variants, including a huge graveplate\r<br />- Added &#39;Bury at home&#39; support to Dragon Bridge, Karthwasten and Winterhold College\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.01.2013, Version 0.2:[/color][/size][/b]\r<br />\r<br />- Added feature: Bury Human Corpses. Comes in two versions, bury them right where they are, or, if unique actor, bury them at their hometwons. Supported places so far: Dawnstar, Ivarstead, Morthal, Riverwood, Rorikstead, Whiterun, Solitude, Windhelm, Winterhold, Riften, Markarth, Falkreath. The place where you bury the dead will then have a tombstone set. This applies to unique as well as leveled actors. Leveled actors can only be burried right in place as they usually have no name or hometown to determine. When burying the corpse their inventory will be burried with them, so make sure to get the inventory before you bury the bodies.\r<br />- Added feature: Bury Carcass. You&#39;re able to bury carcasess where you layed them down. A rubbel of dirt with a stone on top will hen placed where you burried the carcass.\r<br /> This applies to ALL creatures. \r<br />- Added feature: Burn corpses three variants. Barbecue -&gt; corpse will be burned and leaves a grilled body behind. Ashes to Ashes -&gt; corpse will be burned and leaves an ash pile behind. Just burn them -&gt; burns the corpse forever or until you decide to do something else with the corpse. When bunring the corpse their inventory will be burned with them, so make sure to get the inventory before you burn the bodies.\r<br />- Added feature: Burn carcass. Has only one flavor. Burn the carcass to an ash pile. Inventory will be burned with them so get it before you&#39;ll burn them.\r<br />- To burn corpses or charcasess you&#39;ll need a torch in your inventory.\r<br />- Completely removed disable/delete from the master perk script. This will effectively fix the bug of no returning leveled spawns.\r<br />- You can now take human corpses and sell them for a very high prize...well I guess you know where...not at vendors.\r<br />\r<br />[size=4][b][color=#00FF00]Release 4.01.2013, Version 0.1:[/color][/size][/b]\r<br />\r<br />- added feature to remove corpses or take them into your inventory to be sold at vendors\r<br />- human corpses can only be removed, not be sold\r<br />- corpses inventory weight when taken gets determined ony the creatures height / 10\r<br />- corpses gold value is determined on creatures height: height &lt; 35 = 10 gold, height &lt; 90 = 100 gold, height &gt; 90 = 200 gold <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clean%20up%20your%20Corpses-78266-1-3-2.7z?fid=1000242537&ttl=1535866964&ri=8192&rs=8192&setec=512703fd3af98acdf6b4b5eb60ac7cb8"
    },
    {
      "fileId": "1000242538",
      "name": "Source",
      "version": "1.3.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1165",
      "fileName": "Source-78266-1-3-2.7z",
      "uploadedUnix": "1492946977",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/63efb98337235094c6de63c98be090d56477a31c462af46708c73b796dfba046/analysis/1492947131/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 23.4.2017, Version 1.3.2:[/color][/size][/b]\r<br />\r<br />- fixed various error log problems related to none entries\r<br />- fixed wild edit on navmesh(seriously i don&#39;t know where that came from???)\r<br />- forwarded all recent changes from USLEEP\r<br />- CUYC has USLEEP as master now\r<br />- fixed vampire thralls not being on the reward list\r<br />- added Helgen torturer and assistant to reward list\r<br />- actors will use voice and sound now when attaining a ceremonial burial\r<br />- fixed reward count deduction on to high player level, instead you will get a notification now, that you&#39;ve killed an unworthy enemy\r<br />- fixed mcm float numbers on sliders\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.10.2015, Version 1.3.1:[/color][/size][/b]\r<br />\r<br />- fixed player being affected by aura of fear spell on polearm detterence\r<br />- fixed potential dumb stack critical script bug on polearm detterence firing aura of fear spell when 3d is not loaded\r<br />- fixed two error log problems for cuyc_masterquestscript\r<br />- fixed various error log problems related to none\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2015, Version 1.3:[/color][/size][/b]\r<br />\r<br />- fixed being able to sell carcass to vendors\r<br />- fixed carcass/corpse respawning alive when dropped from your inventory\r<br />- finally and effectively fixed all corpse/carcass in your inventory bug, where a corpse/carcass would return to the living...they will now get killed and moved back to the trash cell when package change/respawn happens on unique characters. Non-unique and respawning actors will just return to their intial place, to prevent further bugs. This will also fix dropping corpses naked from your inventory. Ontop of that it will fix the bug with non-unique actors being dropped with completely different outfits. To give the player information and raise immersion, you will get a notification that the corpse/carcass started to smell and you&#39;ve dropped it from your inventory when not unique, which will effectively remove the corpse/carcass and remove the ability for further processing. This is dependend on how you set up the cell respawn/corpse removal interval...for vanilla this happens after 7-14 ingame days. No longer can you carry non unique corpses around for weeks. And yes, this will also fix any ctd&#39;s whenever you dropped a corpse/carcass from your inventory, though I&#39;m enirely sure, this was not related to CUYC as I was neber able to reproduce it, or experience it.\r<br />- fixed non-unique actors not respawning at their editor location when processed with the grappling hook\r<br />- added missing package evaluation to corpse/carcass aliases\r<br />- added missing touch warning when vampire corpse is burning\r<br />- fixed vampire context messages where still messageboxes instead of notifications\r<br />- reward formula now deducts player level from the reward sum, so basically if you have a higher level then your victim, you will likely not get any money at all...however, this can be compensated by simply raising the reward count in the MCM\r<br />- improved code related to rewards\r<br />- fixed all reward globals not synchronized to mcm values...they will now really have the correct values attached\r<br />- fixed all text related to reward in MCM\r<br />- added all sorts of malificiant cultists to the reward list\r<br />- new feature for cannibals: make blood stew at any grain mill from human parts\r<br />- fixed burial pyre in ivarstead not showing up\r<br />- added quest icons and miscellanous quest so you know where the stewards are to pay your fin/get reward\r<br />- third and hopefully final attempt to fix the stupid grab weight bug...grab force will now start on an absolute maximum on new games and savegames, please let me know if this keeps on happening, as I do not understand what&#39;s exactly causing this...tested this for over an hour on diverse actors with the new fix and it seems to work on new games as well as savegames...knocks on wood\r<br />- you can now set the duration of the hunting license (from 24 to 2160 hours, respectively 1 to 90 days)\r<br />- the hunting license is now a quest object to prevent dropping from inventory\r<br />- improved the widget appearance much\r<br />- widget now shows the days left until hunting license expires\r<br />- when burning carcass you will now get grilled food as drop\r<br />- fixed various name related problems for corpse/carcass in your inventory\r<br />- using the saw on corpses will now count as assault alarm...so do not do this where everybody can see you, canibals aren&#39;t very popular\r<br />- up to 20 actors are now allowed to attain to a ceremonial burial at pyres, the will be randomly put into an alias when the pyre sequence start and run a package...they can do idles like praying, playing the lute, blow a horn in honor of the dead, falling to their knees and do reverence\r<br />- fixed typo on gravestone\r<br />- fixed missing correct text on tombstone activator\r<br />- increased the time for being to replace tombstone to 30 seconds...but you still need to process every tombstone one by one to attach the correct strings, or the tombstones will show the incorrect name&#33;&#33;&#33;\r<br />- the impaled warning will now spread an aura of fear if you choose so. After placement activate the impaled body as usual and you will see a new option &#34;Add Aura of Fear&#34;. Pressing this menu button will add a spell that casts whenever a actor comes close to it (2048 units) and will then be struck by fear and run away in panic\r<br />- added missing sovngarde package behaviour for honored dead that go to sovngard, now they won&#39;t simply stand around in sovngard anylonger\r<br />- added text option in mcm to show reward count and lincense days left fir those that don&#39;t want to use the widget\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.1.2015, Version 1.2:[/color][/size][/b]\r<br />\r<br />- fixed weight still get set for vanilla woodcutters axe instead of corpsecutters axe\r<br />- removed feature to process creature corpses with axe, interaction will be postboned until proper &#39;head on spike&#39; creature polearms are available\r<br />- Draugr corpses can now be processed with corpsecutter axe to place polearm detterence\r<br />- added warning message when trying to process a carcass with corpsecutters axe\r<br />- added fully featured poaching/reward system, completely configurable in MCM, see description to see how system works\r<br />- added rewardcount widget, configurable in MCM menu\r<br />- you can craft clout shovel with normal shovels now\r<br />- corpsecutters axe now craftable in iron section of forge\r<br />- you can no longer burn non unique characters at burial pyres\r<br />- people you burn on pyres will now really go to Sovngarde\r<br />- fixed respawn bug, unique actors will now go to home cell/sovngarde, non-uniques will be processed as usual (needs varification)\r<br />- when your reward count is under -500 due to poaching, you will reported a crime and guards of all holds will arrest you\r<br />- added fugitives to detterence reward list\r<br />- added Thalmors to list of detterence reward\r<br />- added Arvel the Swift to detterence reward list\r<br />- added hawk to list of poaching crime\r<br />- fixed bug when accidentaly giving the hunting license to other containers\r<br />- animals no longer added to (shovel) reward list when previously poached\r<br />- added necromancers to list of axe reward\r<br />- added assassins to list of axe reward\r<br />- added hired thugs to list of axe reward\r<br />- when using Fire Accelerant as poison on weapons, you can ignite actors that are using fire magic, or under the influence of fire magic\r<br />- added delete option to interaction with detterences, tombstones etc.\r<br />- changed detterence ignition logic&#33;&#33;&#33; you no longer need to hold a torch when placing a détterence to ignite it...instead once the detterence is placed, you&#39;ll need to interact with it, apllying fire accelerant and then ignite the detterence with a fire based spell or torch\r<br />- applied all new reward system to torches and fire based spells\r<br />- burning victims can now reduce the amount of fee you get from poaching...hide your evidence\r<br />- effectively removed all animation, fade out and partialy sound whatsoever from any corpse processing feature, just useless and time consuming...I&#39;d like to keep it, but without proper animations and functions this is just useless\r<br />- all messages use notification instead of messageboxes now, to remove game interuption\r<br />- refined most of the scripts to use less code, effectively making them faster\r<br />- increased speed of all tools to improve convenience during processing\r<br />- added much more notifications to make things easier for new users\r<br />- fixed missing check for flame atronach when trying to burn flame atronachs with torches\r<br />- added dialogue option to pay fines at stewards\r<br />- fixed vampire feature still active when Mod turned off or vampire feature turned off\r<br />- when using leach to melt carcass on previously poached passive animals, the previously gained fee count gets deducted\r<br />- you can make fire accelerant from mead with juniper berries now\r<br />- fixed no messages available for mummifier option\r<br />- removed tons of dirty edits related to actors\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.12.2014, Version 1.1.1:[/color][/size][/b]\r<br />\r<br />- added experimental &#39;reward&#39; feature for processing corpses\r<br />- added a MCM option to adjust Grabbing Force\r<br />\r<br />[size=4][b][color=#00FF00]Release 28.9.2014, Version 1.1:[/color][/size][/b]\r<br />\r<br />- the polearm option no longer uses the vanilla woodcutters axe to improve compatibility with other Mods, the new tool is now crafted on a forge with the vanilla axe\r<br />- you can now customize text on almost all burial options (tombstones, mummys, deterrence)\r<br />- default text on said burial options only states name and date of death\r<br />- there&#39;s now 6 different variants of deterrences (including head on spike), you can change deterrence appearance after placement\r<br />- animals/creatures are now allowed to have a tombstone placed\r<br />- heap of earth is no longer a static object, but an activator which you can interact with, you can place a tombstone or your enemys last equipped weapon near the heap\r<br />- tombstones are now allowed to have the last equipped weapon of your enemy placed near them\r<br />- heap of earth is now placeable in real time\r<br />- fixed bug with burial interaction whilst placement, you can no longer interact with burial options whilst placement\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- cleaned the plugin\r<br />- various typo fixes\r<br />- added price option for replacement tombstone variants inside MCM menu\r<br />- when processing corpse with shovel, axe or scalpel, you will be able to poistion the corpse in real tíme where ever you want\r<br />- removed left over edit to vanilla cell\r<br />- all dialogue topics are voiced now\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.6:[/color][/size][/b]\r<br />\r<br />- fixed installer version\r<br />- removed SKSE maintenance code\r<br />- fixed information in MCM menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.5:[/color][/size][/b]\r<br />\r<br />- fixed another very persistent null error related to OnItemRemoved, hope this was the last\r<br />- fixed tools disenchantable on enchanting stations\r<br />\r<br />[size=4][b][color=#00FF00]Release 21.6.2014, Version 0.9.9.4:[/color][/size][/b]\r<br />\r<br />- fixed more scriptlog stack reports related to &#39;none&#39; errors making the fuzzy guys go all fuzzy\r<br />- added option to bury human NPC&#39;s under a heap of earth, place clay in their inventory to do it\r<br />- fixed cheat to put items inside corpses and then carry them, all items get removed now before grabbing them with the hook\r<br />- added MCM option to unclutter the crafting menus, the clutter is inside your head and named pedantism\r<br />- MCM option to turn off burial pyres in cities (they are now turned off by default)\r<br />- fixed various typos\r<br />- added hint for default settings inside the MCM descriptions\r<br />- fixed mummyfiyng tool craftable inside iron menu, it&#39;s now in the steel menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 18.2.2014, Version 0.9.9.3:[/color][/size][/b]\r<br />\r<br />- fixed various scriptlog stack reports causing &#39;none&#39; errors, which do nothing but make the fuzzy guys go all fuzzy^^\r<br />- fixed hotkey needing to save and reload before working\r<br />- fixed fire spells not creating ash piles but burned bodys on human corpses\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9.2:[/color][/size][/b]\r<br />\r<br />- Fixed Hammer tool not working like supposed to\r<br />- Fixed 4 tombstone varaints not correctly working when trying to replace\r<br />- Fixed time discrepancy when using flame based spells or staffs, let corpses stop to burn too earlie\r<br />- Added correct name to grappling hook (previously Body Hook)\r<br />- Fixed grappling hook not being affected by the no weight feature\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9:[/color][/size][/b]\r<br />\r<br />- Fixed bug with corpses/carcasses being placeable in containers\r<br />- corpses/carcasses can no longer be placed in containers\r<br />- Vampire resurrection now optional in MCM menu\r<br />- You can no longer sell any of the CUYC tools\r<br />- Add MCM otpion to toggle weight on CUYC tools, so they won&#39;t weight anything\r<br />- Fixed tombstones getting placed at players feet instead of corpse/carcass\r<br />- Flame based staffs will now burn corpses/carcasses\r<br />- Fixed corpse/carcass name not staying persistent in savegames\r<br />- Added feature to nail someone to a wall, respectively nail it anywhere, even in mid air\r<br />- Added feature to let Vampire die in agony when burned\r<br />- Added missing shovel sound when burrying animals\r<br />- Added option to buy 4 tombstone variants at any Priest of Arkay, you&#39;ll get a license for deliverence, activate regular tombstone with scroll in inventory to fire context menu\r<br />- Fixed various CUYC tool speeds\r<br />- Added burial option for the honorable dead, placed in every major town and village. Activate the Burial Pyre with a corpse/carcass in your inventory to fire context menu\r<br />- Fixed various smaller typos, thanks to a user&#39;s name I forgot\r<br />- Added option to dress someone who&#39;S dead and stripped naked\r<br />- Added .bsl file for translators/localizators\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9.1:[/color][/size][/b]\r<br />\r<br />- fixed NMM installer showing wrong version number\r<br />- fixed various recipes to not work like supposed to\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9:[/color][/size][/b]\r<br />\r<br />- Entirely removed any automatisms, mod completely works now through interaction in real time\r<br />- Length of burn time is now dependent on the quantity of brand accelerator placed into the victims body\r<br />- Flame Atronach and Automatons are now immune against burning, you can only melt, take or bury them\r<br />- Brand Accelerator is now a prerequisite in order to burn bodies...no brand accelerator = no burning\r<br />- burning is now only possible via torch, spell flames and wall of flames, new immersion made this inevitable, due to how other fire based spells applied force to dead bodies, which ruined the whole shaders\r<br />- New tool: &#34;All purpose Broom&#34;, available as reward when completing the Dark Brotherhood questline...this broom is capable of removing anything...immidiately\r<br />- New tool: Fleshsaw, available at the cannibal quest line by killing one of the main protagonists, using this tool on NPCs will remove them and grant you 1 human heart and 4 human flesh\r<br />- Added toggle option to MCM menu to turn on/off messages\r<br />- New tool: Grabbling hook, which is needed to take bodies, completely animated like a weapon\r<br />- New tool: Shovel, needed for burrying humans (tombstone) and creatures (heap), completely animated like a weapon\r<br />- Placing polearms is now done via using axes on corpse/carcass, hold a torch as well to get a burning polearm\r<br />- Added sound to all available options\r<br />- Vanilla Wood Cutters Axe does no longer cause damage on actors, it&#39;S a tool, not a weapon, this is to prevent bugs\r<br />- Leach and Brand Accelerator are poisons again\r<br />\r<br />[size=4][b][color=#00FF00]Release 5.1.2014, Version 0.8:[/color][/size][/b]\r<br />\r<br />- Complete recoding of all main features processed \r<br />- Removed all menu based functions, mod is now highly immersive\r<br />- Bonemeal when burning bodies is now dependend on the size of the creature\r<br />- All options are now more or less animated, you can turn the animations on and off in MCM menu\r<br />- Death Hounds now spawn vampire dust when burned\r<br />- To bury corpses with tombstone you&#39;ll need to place quarried stone from Hearthfire into their dead body\r<br />- Mod now needs all three DLCs\r<br />- Fixed ominous light bug once and for all (hopefully :D )\r<br />- Fixed ominous error log message spam, that did never happen for me in the first place (so I&#39;m not really aware if I fixed it and if there ever was something to fix^^ )\r<br />- Functions like this now: To bury you&#39;ll need pickaxe equipped in right hand, to burn you&#39;ll need torch equipped or fire magic equipped in both hands, to melt you&#39;ll need to place the leach in your victims inventory when dead, to prolong burn time, you&#39;ll need to place brand accelerator in your victims inventory when dead, to take a dead body, you&#39;ll need to equip your fists only, if you have non of either true, you will open their inventory like regular, the events will always fire true, so beware what you have in your hands before touching a body\r<br />- Fixed giant races takeable\r<br />- Brand Accelerator is now an ingredient and made less expensive\r<br />- Fixed respawning corpse containers\r<br />- Fixed barbecue corpses coliding with Nav Mesh\r<br />- You can no longer burn automatons or flame atronachs\r<br />- Fixed critical bug with occasionally freezing NPCs (enable they AI back idiot&#33;&#33;&#33;)\r<br />- Removed standalone remove feature\r<br />- No more interior restrictions (this might be changed in future again, dependent on user) feedback\r<br />\r<br />[size=4][b][color=#00FF00]Release 13.12.2013, Version 0.7.3:[/color][/size][/b]\r<br />\r<br />- If you have garlic in your inventory, it will be automatically placed on Vampire corpses, on ALL options, to prevent them from resurrecting\r<br />- Fixed various smaller bugs with Vampire checks in scripts not firing certain options\r<br />- Vampires will now be resurrected if you grab them\r<br />- Fixed bug being able to activate Vampires again, when they resurrect, melt or burn\r<br />- If you melt or burn NPCs/Vampires now, all their items will automatically placed in yourinventory \r<br />\r<br />[size=4][b][color=#00FF00]Release 7.12.2013, Version 0.7.2:[/color][/size][/b]\r<br />\r<br />- Fixed heat source/illumination staying persistent on heavily modded games, or with high script latency\r<br />- Added missing extra damage on carcasses when burned with brand accelerator\r<br />- Added missing bonemeal spawn for creatures/animal when burning them\r<br />\r<br />[size=4][b][color=#00FF00]Release 31.11.2013, Version 0.7.1:[/color][/size][/b]\r<br />\r<br />- Changed code to raise compatibility with Take Notes journal mod\r<br />\r<br />[size=4][b][color=#00FF00]Release 30.11.2013, Version 0.7:[/color][/size][/b]\r<br />\r<br />- New bury option &#34;Mummy&#34; preserving corpses, you&#39;ll need any embalming tool plus 5 linen wraps to mumify a corpse\r<br />- Added a digging sound for all bury options\r<br />- Finally and effectively fixed the vampire dust ingredient still present in vampire corpses after killing them, it&#39;s now done via special perk\r<br />- Vampire resurrection after disturbing their sleep now has a animation, shader effect and sound applied to it, looks much more better now\r<br />- Warning when disturbing sleep of a vampire is now a messagebox\r<br />- Vampire resurrection feature now also works when not activating vampire corpse in sneak stance\r<br />- Fixed leach not getting removed from player inventory when corpse is molden\r<br />- Fixed typo in warning option &#34;fade&#34; to &#34;fate&#34;\r<br />\r<br />[size=4][b][color=#00FF00]Release 2.02.2013, Version 0.6:[/color][/size][/b]\r<br />\r<br />- Hotkey is no longer O, it&#39;s unbound, so you&#39;ll need to rebind it when starting/updating the mod\r<br />- You&#39;re no longer allowed to sell carcasses at vendors. Reason: destroys respawn of leveled actors/creatures\r<br />- When using the Ahses to Ashes burning function either Bonemeal or Vampire Dust gets placed inside the Ash Pile\r<br />- Vampires will no longer drop Vampire Dust as death item, you&#39;ll need to burn them to get the ingredient\r<br />- Fixed the leach description so you&#39;ll actually know what it does\r<br />- The Fire Shout is no longer in the list of fire sources to burn bodies, reason: bugs, bugs, bugs\r<br />- Added new burial option: Stone Cairns\r<br />- Added new burial option: Polearm Deterrence\r<br />- Added new burn option: Burning Polearm Deterrence (made specially for interiors)\r<br />- Added new function to increase burning time on corpses/carcasses. You&#39;ll now need brand accelerator to increase burning time. Brand accelerator can be crafted from various ingredients at cookpots.\r<br />- New feature: Vampires resurrect if you disturb their sleep. How does it work? If you killed a Vampire and you do not choose to bury, burn, melt or just leave him alone, he will rise again. You will get a notification when distrubing his sleep. This will happen if you search his inventory, try to melt, burn or bury him with the fitting prerequisite in your inventory, or when you try to take the vampire corpse\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5.1:[/color][/size][/b]\r<br />\r<br />- Fixed NMM installer showing wrong version number\r<br />- Fixed not being able to take carcasses, except Dragons, Mammoth and Giants\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5:[/color][/size][/b]\r<br />\r<br />- Improved ReadMe for user convenience\r<br />- Cleaned the plugin removing 44 identical to master entries\r<br />- Fixed bug with carcasses having enormous prizes\r<br />- Fixed MCM menu not showing up when starting a new game\r<br />- Changed feature: Removing corpses/carcasses is now only possible with leach in your inventory (nice melting effect added). Craft leach at regular cooking stations from salt, spider poison and bonemeal\r<br />- Removed accidentaly leftover Debug.Notification from previous version\r<br />- Added a standalone &#39;remove only&#39; option in the mcm menu. Doesn&#39;t have any prerequisites. Can be used with or without the original features\r<br />- You can no longer sell humanoid corpses at regular vendors. Selling human corpses is preserved for future versions\r<br />- Taking corpses now adds a corpse dummy with the corpse/carcass name. Dropping the dummy out of your inventory will put the corpse/carcass at your feet and remove the dummy. So yes, this means you&#39;re now able to carry around corpses in your inventory. Only one corpse/carcass allowed\r<br />- Corpse/Carcass dummys now reflect their counterparts real weight\r<br />- Corpse/Carcass dummys now reflect their counterparts real name\r<br />- Corpse/Carcass dummys now reflect their counterparts real value depending on NPC/Creaure weight. Needs to be finetuned in future versions, but should be much more convenient then past versions\r<br />- You&#39;re no longer allowed to carry around Dragon, Giant or Mammoth carcasses. Future updates might contain even more limitations, like horses for example\r<br />- Partially restored the old fire effect, but it&#39;s a hazard now. This means entering any burning corpse/carcas will burn you and damage health. Be very carefull when using the Bonfire option&#33;&#33;&#33;\r<br />- Fixed tombstones not showing the correct DoD. It&#39;s still not 100% correct, but should be clother to the exact Dod +- 1 (or 2 in rare cases)\r<br />- Siginificantly raised health damage to bonfire option when entering the burn radius to close\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.01.2013, Version 0.4:[/color][/size][/b]\r<br />\r<br />- Fixed bug with &#39;FuneralDummys&#39; appearing in Karthwasten, Dragon Bridge and College of Winterhold\r<br />- Support for Frostfall added: Burning corpses now keeps you from getting colder. Burning Corpses work like campfires, in order to make complete use of them, you&#39;ll need to have a tent build or wear warm clothes. Additionally the amount of exposure rate reduction is dependend on how close to the heat source you are. Burning corpses to grilled body or ash pile will last 30 seconds, burning them to &#39;Bonfire&#39; will last 60 seconds, have higher exposure rate reduction, but needs dwarven oil.\r<br />- Changed &#39;let them burn&#39; to &#39;bonfire&#39;.\r<br />- Once a corpse is ignited you can no longer touch it aka modifie it in any way. Touching it will ignite you and damage your health. Additionally you&#39;ll now need to keep your distance when ignite a body or you get burned. Fire hurts now&#33;&#33;&#33; If you chose the bonfire option a puddle of oil will be placed at the corpse, entering it&#39;S radius will ignite you damage you.\r<br />- Fixed corpses being burnable again once ignited.\r<br />- Once ignited the corpse can no longer be moved.\r<br />- Added MCM support to turn the mod off and on at will.\r<br />- Added hotkey (default:o like onion, not null) to switch between turned off and on. Can be redefined inside the MCM menu.\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.01.2013, Version 0.3:[/color][/size][/b]\r<br />\r<br />- Fixed SKSE check not properly showing on init and loading game\r<br />- Fixed FOMM Installer showing wrong mod version for people that are all high on correct numbers\r<br />- Fixed critical bug when transfering to Solitude to bury a corpse where you ended somewhere in nowhere\r<br />- Changed feature: Bury corpses at home will now transfer you and the corpse to the cemetry without automatically placing a tombstone, instead you&#39;ll now need to place the corpse how you want it and then again activating the corpse while sneaking and choose &#39;Right here&#33;&#39;\r<br />- Fixed bug when taking a corpse/carcass and removing it from your inventory it showed the &#39;You can&#39;t carry anymore corpses/charcasses&#39; message. It will now only show this message when actually there&#39;s a corpse/charcass inside your inventory\r<br />- New feature: Bury any unique corpse in one of the major cities. Supported cities are: Whiterun, Riften, Windhelm, Solitude, Markarth, Dawnstar, Falkreath, Morthal\r<br />- You can now burn corpses if you have either a torch equipped, a fire related spell equipped, or a fire related shout equipped\r<br />- Removed equipping your torch when burning corpses\r<br />- Added a message so that you can no longer bury corpses/charcasses inside interiors (buildings)...which effectively means, you&#39;re no longer allowed to bury corpses in interior cells\r<br />- You&#39;ll now need a shovel in your inventory to bury corpses/charcasses\r<br />- Rearranged the message priorization like this: Search Corpse, Remove Corpse, Take Corpse, Burn Corpse, Bury Corpse...same if for charcasses\r<br />- Added two more tombstone variants, including a huge graveplate\r<br />- Added &#39;Bury at home&#39; support to Dragon Bridge, Karthwasten and Winterhold College\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.01.2013, Version 0.2:[/color][/size][/b]\r<br />\r<br />- Added feature: Bury Human Corpses. Comes in two versions, bury them right where they are, or, if unique actor, bury them at their hometwons. Supported places so far: Dawnstar, Ivarstead, Morthal, Riverwood, Rorikstead, Whiterun, Solitude, Windhelm, Winterhold, Riften, Markarth, Falkreath. The place where you bury the dead will then have a tombstone set. This applies to unique as well as leveled actors. Leveled actors can only be burried right in place as they usually have no name or hometown to determine. When burying the corpse their inventory will be burried with them, so make sure to get the inventory before you bury the bodies.\r<br />- Added feature: Bury Carcass. You&#39;re able to bury carcasess where you layed them down. A rubbel of dirt with a stone on top will hen placed where you burried the carcass.\r<br /> This applies to ALL creatures. \r<br />- Added feature: Burn corpses three variants. Barbecue -&gt; corpse will be burned and leaves a grilled body behind. Ashes to Ashes -&gt; corpse will be burned and leaves an ash pile behind. Just burn them -&gt; burns the corpse forever or until you decide to do something else with the corpse. When bunring the corpse their inventory will be burned with them, so make sure to get the inventory before you burn the bodies.\r<br />- Added feature: Burn carcass. Has only one flavor. Burn the carcass to an ash pile. Inventory will be burned with them so get it before you&#39;ll burn them.\r<br />- To burn corpses or charcasess you&#39;ll need a torch in your inventory.\r<br />- Completely removed disable/delete from the master perk script. This will effectively fix the bug of no returning leveled spawns.\r<br />- You can now take human corpses and sell them for a very high prize...well I guess you know where...not at vendors.\r<br />\r<br />[size=4][b][color=#00FF00]Release 4.01.2013, Version 0.1:[/color][/size][/b]\r<br />\r<br />- added feature to remove corpses or take them into your inventory to be sold at vendors\r<br />- human corpses can only be removed, not be sold\r<br />- corpses inventory weight when taken gets determined ony the creatures height / 10\r<br />- corpses gold value is determined on creatures height: height &lt; 35 = 10 gold, height &lt; 90 = 100 gold, height &gt; 90 = 200 gold <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Source-78266-1-3-2.7z?fid=1000242538&ttl=1535866964&ri=8192&rs=8192&setec=ef35cbb654eef9f5e4bf9ffd2511e918"
    },
    {
      "fileId": "1000242539",
      "name": "Patches",
      "version": "1.3.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Patches-78266-1-3-2.7z",
      "uploadedUnix": "1492947034",
      "modVersion": "1.3.2",
      "virusScanUrl": "https://www.virustotal.com/file/7b0a9186bbd10785d412ed44f9bb67b6aa69c8c3a40572acf31531c4acf53525/analysis/1492947302/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 23.4.2017, Version 1.3.2:[/color][/size][/b]\r<br />\r<br />- fixed various error log problems related to none entries\r<br />- fixed wild edit on navmesh(seriously i don&#39;t know where that came from???)\r<br />- forwarded all recent changes from USLEEP\r<br />- CUYC has USLEEP as master now\r<br />- fixed vampire thralls not being on the reward list\r<br />- added Helgen torturer and assistant to reward list\r<br />- actors will use voice and sound now when attaining a ceremonial burial\r<br />- fixed reward count deduction on to high player level, instead you will get a notification now, that you&#39;ve killed an unworthy enemy\r<br />- fixed mcm float numbers on sliders\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.10.2015, Version 1.3.1:[/color][/size][/b]\r<br />\r<br />- fixed player being affected by aura of fear spell on polearm detterence\r<br />- fixed potential dumb stack critical script bug on polearm detterence firing aura of fear spell when 3d is not loaded\r<br />- fixed two error log problems for cuyc_masterquestscript\r<br />- fixed various error log problems related to none\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2015, Version 1.3:[/color][/size][/b]\r<br />\r<br />- fixed being able to sell carcass to vendors\r<br />- fixed carcass/corpse respawning alive when dropped from your inventory\r<br />- finally and effectively fixed all corpse/carcass in your inventory bug, where a corpse/carcass would return to the living...they will now get killed and moved back to the trash cell when package change/respawn happens on unique characters. Non-unique and respawning actors will just return to their intial place, to prevent further bugs. This will also fix dropping corpses naked from your inventory. Ontop of that it will fix the bug with non-unique actors being dropped with completely different outfits. To give the player information and raise immersion, you will get a notification that the corpse/carcass started to smell and you&#39;ve dropped it from your inventory when not unique, which will effectively remove the corpse/carcass and remove the ability for further processing. This is dependend on how you set up the cell respawn/corpse removal interval...for vanilla this happens after 7-14 ingame days. No longer can you carry non unique corpses around for weeks. And yes, this will also fix any ctd&#39;s whenever you dropped a corpse/carcass from your inventory, though I&#39;m enirely sure, this was not related to CUYC as I was neber able to reproduce it, or experience it.\r<br />- fixed non-unique actors not respawning at their editor location when processed with the grappling hook\r<br />- added missing package evaluation to corpse/carcass aliases\r<br />- added missing touch warning when vampire corpse is burning\r<br />- fixed vampire context messages where still messageboxes instead of notifications\r<br />- reward formula now deducts player level from the reward sum, so basically if you have a higher level then your victim, you will likely not get any money at all...however, this can be compensated by simply raising the reward count in the MCM\r<br />- improved code related to rewards\r<br />- fixed all reward globals not synchronized to mcm values...they will now really have the correct values attached\r<br />- fixed all text related to reward in MCM\r<br />- added all sorts of malificiant cultists to the reward list\r<br />- new feature for cannibals: make blood stew at any grain mill from human parts\r<br />- fixed burial pyre in ivarstead not showing up\r<br />- added quest icons and miscellanous quest so you know where the stewards are to pay your fin/get reward\r<br />- third and hopefully final attempt to fix the stupid grab weight bug...grab force will now start on an absolute maximum on new games and savegames, please let me know if this keeps on happening, as I do not understand what&#39;s exactly causing this...tested this for over an hour on diverse actors with the new fix and it seems to work on new games as well as savegames...knocks on wood\r<br />- you can now set the duration of the hunting license (from 24 to 2160 hours, respectively 1 to 90 days)\r<br />- the hunting license is now a quest object to prevent dropping from inventory\r<br />- improved the widget appearance much\r<br />- widget now shows the days left until hunting license expires\r<br />- when burning carcass you will now get grilled food as drop\r<br />- fixed various name related problems for corpse/carcass in your inventory\r<br />- using the saw on corpses will now count as assault alarm...so do not do this where everybody can see you, canibals aren&#39;t very popular\r<br />- up to 20 actors are now allowed to attain to a ceremonial burial at pyres, the will be randomly put into an alias when the pyre sequence start and run a package...they can do idles like praying, playing the lute, blow a horn in honor of the dead, falling to their knees and do reverence\r<br />- fixed typo on gravestone\r<br />- fixed missing correct text on tombstone activator\r<br />- increased the time for being to replace tombstone to 30 seconds...but you still need to process every tombstone one by one to attach the correct strings, or the tombstones will show the incorrect name&#33;&#33;&#33;\r<br />- the impaled warning will now spread an aura of fear if you choose so. After placement activate the impaled body as usual and you will see a new option &#34;Add Aura of Fear&#34;. Pressing this menu button will add a spell that casts whenever a actor comes close to it (2048 units) and will then be struck by fear and run away in panic\r<br />- added missing sovngarde package behaviour for honored dead that go to sovngard, now they won&#39;t simply stand around in sovngard anylonger\r<br />- added text option in mcm to show reward count and lincense days left fir those that don&#39;t want to use the widget\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.1.2015, Version 1.2:[/color][/size][/b]\r<br />\r<br />- fixed weight still get set for vanilla woodcutters axe instead of corpsecutters axe\r<br />- removed feature to process creature corpses with axe, interaction will be postboned until proper &#39;head on spike&#39; creature polearms are available\r<br />- Draugr corpses can now be processed with corpsecutter axe to place polearm detterence\r<br />- added warning message when trying to process a carcass with corpsecutters axe\r<br />- added fully featured poaching/reward system, completely configurable in MCM, see description to see how system works\r<br />- added rewardcount widget, configurable in MCM menu\r<br />- you can craft clout shovel with normal shovels now\r<br />- corpsecutters axe now craftable in iron section of forge\r<br />- you can no longer burn non unique characters at burial pyres\r<br />- people you burn on pyres will now really go to Sovngarde\r<br />- fixed respawn bug, unique actors will now go to home cell/sovngarde, non-uniques will be processed as usual (needs varification)\r<br />- when your reward count is under -500 due to poaching, you will reported a crime and guards of all holds will arrest you\r<br />- added fugitives to detterence reward list\r<br />- added Thalmors to list of detterence reward\r<br />- added Arvel the Swift to detterence reward list\r<br />- added hawk to list of poaching crime\r<br />- fixed bug when accidentaly giving the hunting license to other containers\r<br />- animals no longer added to (shovel) reward list when previously poached\r<br />- added necromancers to list of axe reward\r<br />- added assassins to list of axe reward\r<br />- added hired thugs to list of axe reward\r<br />- when using Fire Accelerant as poison on weapons, you can ignite actors that are using fire magic, or under the influence of fire magic\r<br />- added delete option to interaction with detterences, tombstones etc.\r<br />- changed detterence ignition logic&#33;&#33;&#33; you no longer need to hold a torch when placing a détterence to ignite it...instead once the detterence is placed, you&#39;ll need to interact with it, apllying fire accelerant and then ignite the detterence with a fire based spell or torch\r<br />- applied all new reward system to torches and fire based spells\r<br />- burning victims can now reduce the amount of fee you get from poaching...hide your evidence\r<br />- effectively removed all animation, fade out and partialy sound whatsoever from any corpse processing feature, just useless and time consuming...I&#39;d like to keep it, but without proper animations and functions this is just useless\r<br />- all messages use notification instead of messageboxes now, to remove game interuption\r<br />- refined most of the scripts to use less code, effectively making them faster\r<br />- increased speed of all tools to improve convenience during processing\r<br />- added much more notifications to make things easier for new users\r<br />- fixed missing check for flame atronach when trying to burn flame atronachs with torches\r<br />- added dialogue option to pay fines at stewards\r<br />- fixed vampire feature still active when Mod turned off or vampire feature turned off\r<br />- when using leach to melt carcass on previously poached passive animals, the previously gained fee count gets deducted\r<br />- you can make fire accelerant from mead with juniper berries now\r<br />- fixed no messages available for mummifier option\r<br />- removed tons of dirty edits related to actors\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.12.2014, Version 1.1.1:[/color][/size][/b]\r<br />\r<br />- added experimental &#39;reward&#39; feature for processing corpses\r<br />- added a MCM option to adjust Grabbing Force\r<br />\r<br />[size=4][b][color=#00FF00]Release 28.9.2014, Version 1.1:[/color][/size][/b]\r<br />\r<br />- the polearm option no longer uses the vanilla woodcutters axe to improve compatibility with other Mods, the new tool is now crafted on a forge with the vanilla axe\r<br />- you can now customize text on almost all burial options (tombstones, mummys, deterrence)\r<br />- default text on said burial options only states name and date of death\r<br />- there&#39;s now 6 different variants of deterrences (including head on spike), you can change deterrence appearance after placement\r<br />- animals/creatures are now allowed to have a tombstone placed\r<br />- heap of earth is no longer a static object, but an activator which you can interact with, you can place a tombstone or your enemys last equipped weapon near the heap\r<br />- tombstones are now allowed to have the last equipped weapon of your enemy placed near them\r<br />- heap of earth is now placeable in real time\r<br />- fixed bug with burial interaction whilst placement, you can no longer interact with burial options whilst placement\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- cleaned the plugin\r<br />- various typo fixes\r<br />- added price option for replacement tombstone variants inside MCM menu\r<br />- when processing corpse with shovel, axe or scalpel, you will be able to poistion the corpse in real tíme where ever you want\r<br />- removed left over edit to vanilla cell\r<br />- all dialogue topics are voiced now\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.6:[/color][/size][/b]\r<br />\r<br />- fixed installer version\r<br />- removed SKSE maintenance code\r<br />- fixed information in MCM menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 10.8.2014, Version 0.9.9.5:[/color][/size][/b]\r<br />\r<br />- fixed another very persistent null error related to OnItemRemoved, hope this was the last\r<br />- fixed tools disenchantable on enchanting stations\r<br />\r<br />[size=4][b][color=#00FF00]Release 21.6.2014, Version 0.9.9.4:[/color][/size][/b]\r<br />\r<br />- fixed more scriptlog stack reports related to &#39;none&#39; errors making the fuzzy guys go all fuzzy\r<br />- added option to bury human NPC&#39;s under a heap of earth, place clay in their inventory to do it\r<br />- fixed cheat to put items inside corpses and then carry them, all items get removed now before grabbing them with the hook\r<br />- added MCM option to unclutter the crafting menus, the clutter is inside your head and named pedantism\r<br />- MCM option to turn off burial pyres in cities (they are now turned off by default)\r<br />- fixed various typos\r<br />- added hint for default settings inside the MCM descriptions\r<br />- fixed mummyfiyng tool craftable inside iron menu, it&#39;s now in the steel menu\r<br />\r<br />[size=4][b][color=#00FF00]Release 18.2.2014, Version 0.9.9.3:[/color][/size][/b]\r<br />\r<br />- fixed various scriptlog stack reports causing &#39;none&#39; errors, which do nothing but make the fuzzy guys go all fuzzy^^\r<br />- fixed hotkey needing to save and reload before working\r<br />- fixed fire spells not creating ash piles but burned bodys on human corpses\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9.2:[/color][/size][/b]\r<br />\r<br />- Fixed Hammer tool not working like supposed to\r<br />- Fixed 4 tombstone varaints not correctly working when trying to replace\r<br />- Fixed time discrepancy when using flame based spells or staffs, let corpses stop to burn too earlie\r<br />- Added correct name to grappling hook (previously Body Hook)\r<br />- Fixed grappling hook not being affected by the no weight feature\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.2.2014, Version 0.9.9:[/color][/size][/b]\r<br />\r<br />- Fixed bug with corpses/carcasses being placeable in containers\r<br />- corpses/carcasses can no longer be placed in containers\r<br />- Vampire resurrection now optional in MCM menu\r<br />- You can no longer sell any of the CUYC tools\r<br />- Add MCM otpion to toggle weight on CUYC tools, so they won&#39;t weight anything\r<br />- Fixed tombstones getting placed at players feet instead of corpse/carcass\r<br />- Flame based staffs will now burn corpses/carcasses\r<br />- Fixed corpse/carcass name not staying persistent in savegames\r<br />- Added feature to nail someone to a wall, respectively nail it anywhere, even in mid air\r<br />- Added feature to let Vampire die in agony when burned\r<br />- Added missing shovel sound when burrying animals\r<br />- Added option to buy 4 tombstone variants at any Priest of Arkay, you&#39;ll get a license for deliverence, activate regular tombstone with scroll in inventory to fire context menu\r<br />- Fixed various CUYC tool speeds\r<br />- Added burial option for the honorable dead, placed in every major town and village. Activate the Burial Pyre with a corpse/carcass in your inventory to fire context menu\r<br />- Fixed various smaller typos, thanks to a user&#39;s name I forgot\r<br />- Added option to dress someone who&#39;S dead and stripped naked\r<br />- Added .bsl file for translators/localizators\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9.1:[/color][/size][/b]\r<br />\r<br />- fixed NMM installer showing wrong version number\r<br />- fixed various recipes to not work like supposed to\r<br />\r<br />[size=4][b][color=#00FF00]Release 12.1.2014, Version 0.9:[/color][/size][/b]\r<br />\r<br />- Entirely removed any automatisms, mod completely works now through interaction in real time\r<br />- Length of burn time is now dependent on the quantity of brand accelerator placed into the victims body\r<br />- Flame Atronach and Automatons are now immune against burning, you can only melt, take or bury them\r<br />- Brand Accelerator is now a prerequisite in order to burn bodies...no brand accelerator = no burning\r<br />- burning is now only possible via torch, spell flames and wall of flames, new immersion made this inevitable, due to how other fire based spells applied force to dead bodies, which ruined the whole shaders\r<br />- New tool: &#34;All purpose Broom&#34;, available as reward when completing the Dark Brotherhood questline...this broom is capable of removing anything...immidiately\r<br />- New tool: Fleshsaw, available at the cannibal quest line by killing one of the main protagonists, using this tool on NPCs will remove them and grant you 1 human heart and 4 human flesh\r<br />- Added toggle option to MCM menu to turn on/off messages\r<br />- New tool: Grabbling hook, which is needed to take bodies, completely animated like a weapon\r<br />- New tool: Shovel, needed for burrying humans (tombstone) and creatures (heap), completely animated like a weapon\r<br />- Placing polearms is now done via using axes on corpse/carcass, hold a torch as well to get a burning polearm\r<br />- Added sound to all available options\r<br />- Vanilla Wood Cutters Axe does no longer cause damage on actors, it&#39;S a tool, not a weapon, this is to prevent bugs\r<br />- Leach and Brand Accelerator are poisons again\r<br />\r<br />[size=4][b][color=#00FF00]Release 5.1.2014, Version 0.8:[/color][/size][/b]\r<br />\r<br />- Complete recoding of all main features processed \r<br />- Removed all menu based functions, mod is now highly immersive\r<br />- Bonemeal when burning bodies is now dependend on the size of the creature\r<br />- All options are now more or less animated, you can turn the animations on and off in MCM menu\r<br />- Death Hounds now spawn vampire dust when burned\r<br />- To bury corpses with tombstone you&#39;ll need to place quarried stone from Hearthfire into their dead body\r<br />- Mod now needs all three DLCs\r<br />- Fixed ominous light bug once and for all (hopefully :D )\r<br />- Fixed ominous error log message spam, that did never happen for me in the first place (so I&#39;m not really aware if I fixed it and if there ever was something to fix^^ )\r<br />- Functions like this now: To bury you&#39;ll need pickaxe equipped in right hand, to burn you&#39;ll need torch equipped or fire magic equipped in both hands, to melt you&#39;ll need to place the leach in your victims inventory when dead, to prolong burn time, you&#39;ll need to place brand accelerator in your victims inventory when dead, to take a dead body, you&#39;ll need to equip your fists only, if you have non of either true, you will open their inventory like regular, the events will always fire true, so beware what you have in your hands before touching a body\r<br />- Fixed giant races takeable\r<br />- Brand Accelerator is now an ingredient and made less expensive\r<br />- Fixed respawning corpse containers\r<br />- Fixed barbecue corpses coliding with Nav Mesh\r<br />- You can no longer burn automatons or flame atronachs\r<br />- Fixed critical bug with occasionally freezing NPCs (enable they AI back idiot&#33;&#33;&#33;)\r<br />- Removed standalone remove feature\r<br />- No more interior restrictions (this might be changed in future again, dependent on user) feedback\r<br />\r<br />[size=4][b][color=#00FF00]Release 13.12.2013, Version 0.7.3:[/color][/size][/b]\r<br />\r<br />- If you have garlic in your inventory, it will be automatically placed on Vampire corpses, on ALL options, to prevent them from resurrecting\r<br />- Fixed various smaller bugs with Vampire checks in scripts not firing certain options\r<br />- Vampires will now be resurrected if you grab them\r<br />- Fixed bug being able to activate Vampires again, when they resurrect, melt or burn\r<br />- If you melt or burn NPCs/Vampires now, all their items will automatically placed in yourinventory \r<br />\r<br />[size=4][b][color=#00FF00]Release 7.12.2013, Version 0.7.2:[/color][/size][/b]\r<br />\r<br />- Fixed heat source/illumination staying persistent on heavily modded games, or with high script latency\r<br />- Added missing extra damage on carcasses when burned with brand accelerator\r<br />- Added missing bonemeal spawn for creatures/animal when burning them\r<br />\r<br />[size=4][b][color=#00FF00]Release 31.11.2013, Version 0.7.1:[/color][/size][/b]\r<br />\r<br />- Changed code to raise compatibility with Take Notes journal mod\r<br />\r<br />[size=4][b][color=#00FF00]Release 30.11.2013, Version 0.7:[/color][/size][/b]\r<br />\r<br />- New bury option &#34;Mummy&#34; preserving corpses, you&#39;ll need any embalming tool plus 5 linen wraps to mumify a corpse\r<br />- Added a digging sound for all bury options\r<br />- Finally and effectively fixed the vampire dust ingredient still present in vampire corpses after killing them, it&#39;s now done via special perk\r<br />- Vampire resurrection after disturbing their sleep now has a animation, shader effect and sound applied to it, looks much more better now\r<br />- Warning when disturbing sleep of a vampire is now a messagebox\r<br />- Vampire resurrection feature now also works when not activating vampire corpse in sneak stance\r<br />- Fixed leach not getting removed from player inventory when corpse is molden\r<br />- Fixed typo in warning option &#34;fade&#34; to &#34;fate&#34;\r<br />\r<br />[size=4][b][color=#00FF00]Release 2.02.2013, Version 0.6:[/color][/size][/b]\r<br />\r<br />- Hotkey is no longer O, it&#39;s unbound, so you&#39;ll need to rebind it when starting/updating the mod\r<br />- You&#39;re no longer allowed to sell carcasses at vendors. Reason: destroys respawn of leveled actors/creatures\r<br />- When using the Ahses to Ashes burning function either Bonemeal or Vampire Dust gets placed inside the Ash Pile\r<br />- Vampires will no longer drop Vampire Dust as death item, you&#39;ll need to burn them to get the ingredient\r<br />- Fixed the leach description so you&#39;ll actually know what it does\r<br />- The Fire Shout is no longer in the list of fire sources to burn bodies, reason: bugs, bugs, bugs\r<br />- Added new burial option: Stone Cairns\r<br />- Added new burial option: Polearm Deterrence\r<br />- Added new burn option: Burning Polearm Deterrence (made specially for interiors)\r<br />- Added new function to increase burning time on corpses/carcasses. You&#39;ll now need brand accelerator to increase burning time. Brand accelerator can be crafted from various ingredients at cookpots.\r<br />- New feature: Vampires resurrect if you disturb their sleep. How does it work? If you killed a Vampire and you do not choose to bury, burn, melt or just leave him alone, he will rise again. You will get a notification when distrubing his sleep. This will happen if you search his inventory, try to melt, burn or bury him with the fitting prerequisite in your inventory, or when you try to take the vampire corpse\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5.1:[/color][/size][/b]\r<br />\r<br />- Fixed NMM installer showing wrong version number\r<br />- Fixed not being able to take carcasses, except Dragons, Mammoth and Giants\r<br />\r<br />[size=4][b][color=#00FF00]Release 26.01.2013, Version 0.5:[/color][/size][/b]\r<br />\r<br />- Improved ReadMe for user convenience\r<br />- Cleaned the plugin removing 44 identical to master entries\r<br />- Fixed bug with carcasses having enormous prizes\r<br />- Fixed MCM menu not showing up when starting a new game\r<br />- Changed feature: Removing corpses/carcasses is now only possible with leach in your inventory (nice melting effect added). Craft leach at regular cooking stations from salt, spider poison and bonemeal\r<br />- Removed accidentaly leftover Debug.Notification from previous version\r<br />- Added a standalone &#39;remove only&#39; option in the mcm menu. Doesn&#39;t have any prerequisites. Can be used with or without the original features\r<br />- You can no longer sell humanoid corpses at regular vendors. Selling human corpses is preserved for future versions\r<br />- Taking corpses now adds a corpse dummy with the corpse/carcass name. Dropping the dummy out of your inventory will put the corpse/carcass at your feet and remove the dummy. So yes, this means you&#39;re now able to carry around corpses in your inventory. Only one corpse/carcass allowed\r<br />- Corpse/Carcass dummys now reflect their counterparts real weight\r<br />- Corpse/Carcass dummys now reflect their counterparts real name\r<br />- Corpse/Carcass dummys now reflect their counterparts real value depending on NPC/Creaure weight. Needs to be finetuned in future versions, but should be much more convenient then past versions\r<br />- You&#39;re no longer allowed to carry around Dragon, Giant or Mammoth carcasses. Future updates might contain even more limitations, like horses for example\r<br />- Partially restored the old fire effect, but it&#39;s a hazard now. This means entering any burning corpse/carcas will burn you and damage health. Be very carefull when using the Bonfire option&#33;&#33;&#33;\r<br />- Fixed tombstones not showing the correct DoD. It&#39;s still not 100% correct, but should be clother to the exact Dod +- 1 (or 2 in rare cases)\r<br />- Siginificantly raised health damage to bonfire option when entering the burn radius to close\r<br />\r<br />[size=4][b][color=#00FF00]Release 19.01.2013, Version 0.4:[/color][/size][/b]\r<br />\r<br />- Fixed bug with &#39;FuneralDummys&#39; appearing in Karthwasten, Dragon Bridge and College of Winterhold\r<br />- Support for Frostfall added: Burning corpses now keeps you from getting colder. Burning Corpses work like campfires, in order to make complete use of them, you&#39;ll need to have a tent build or wear warm clothes. Additionally the amount of exposure rate reduction is dependend on how close to the heat source you are. Burning corpses to grilled body or ash pile will last 30 seconds, burning them to &#39;Bonfire&#39; will last 60 seconds, have higher exposure rate reduction, but needs dwarven oil.\r<br />- Changed &#39;let them burn&#39; to &#39;bonfire&#39;.\r<br />- Once a corpse is ignited you can no longer touch it aka modifie it in any way. Touching it will ignite you and damage your health. Additionally you&#39;ll now need to keep your distance when ignite a body or you get burned. Fire hurts now&#33;&#33;&#33; If you chose the bonfire option a puddle of oil will be placed at the corpse, entering it&#39;S radius will ignite you damage you.\r<br />- Fixed corpses being burnable again once ignited.\r<br />- Once ignited the corpse can no longer be moved.\r<br />- Added MCM support to turn the mod off and on at will.\r<br />- Added hotkey (default:o like onion, not null) to switch between turned off and on. Can be redefined inside the MCM menu.\r<br />\r<br />[size=4][b][color=#00FF00]Release 11.01.2013, Version 0.3:[/color][/size][/b]\r<br />\r<br />- Fixed SKSE check not properly showing on init and loading game\r<br />- Fixed FOMM Installer showing wrong mod version for people that are all high on correct numbers\r<br />- Fixed critical bug when transfering to Solitude to bury a corpse where you ended somewhere in nowhere\r<br />- Changed feature: Bury corpses at home will now transfer you and the corpse to the cemetry without automatically placing a tombstone, instead you&#39;ll now need to place the corpse how you want it and then again activating the corpse while sneaking and choose &#39;Right here&#33;&#39;\r<br />- Fixed bug when taking a corpse/carcass and removing it from your inventory it showed the &#39;You can&#39;t carry anymore corpses/charcasses&#39; message. It will now only show this message when actually there&#39;s a corpse/charcass inside your inventory\r<br />- New feature: Bury any unique corpse in one of the major cities. Supported cities are: Whiterun, Riften, Windhelm, Solitude, Markarth, Dawnstar, Falkreath, Morthal\r<br />- You can now burn corpses if you have either a torch equipped, a fire related spell equipped, or a fire related shout equipped\r<br />- Removed equipping your torch when burning corpses\r<br />- Added a message so that you can no longer bury corpses/charcasses inside interiors (buildings)...which effectively means, you&#39;re no longer allowed to bury corpses in interior cells\r<br />- You&#39;ll now need a shovel in your inventory to bury corpses/charcasses\r<br />- Rearranged the message priorization like this: Search Corpse, Remove Corpse, Take Corpse, Burn Corpse, Bury Corpse...same if for charcasses\r<br />- Added two more tombstone variants, including a huge graveplate\r<br />- Added &#39;Bury at home&#39; support to Dragon Bridge, Karthwasten and Winterhold College\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.01.2013, Version 0.2:[/color][/size][/b]\r<br />\r<br />- Added feature: Bury Human Corpses. Comes in two versions, bury them right where they are, or, if unique actor, bury them at their hometwons. Supported places so far: Dawnstar, Ivarstead, Morthal, Riverwood, Rorikstead, Whiterun, Solitude, Windhelm, Winterhold, Riften, Markarth, Falkreath. The place where you bury the dead will then have a tombstone set. This applies to unique as well as leveled actors. Leveled actors can only be burried right in place as they usually have no name or hometown to determine. When burying the corpse their inventory will be burried with them, so make sure to get the inventory before you bury the bodies.\r<br />- Added feature: Bury Carcass. You&#39;re able to bury carcasess where you layed them down. A rubbel of dirt with a stone on top will hen placed where you burried the carcass.\r<br /> This applies to ALL creatures. \r<br />- Added feature: Burn corpses three variants. Barbecue -&gt; corpse will be burned and leaves a grilled body behind. Ashes to Ashes -&gt; corpse will be burned and leaves an ash pile behind. Just burn them -&gt; burns the corpse forever or until you decide to do something else with the corpse. When bunring the corpse their inventory will be burned with them, so make sure to get the inventory before you burn the bodies.\r<br />- Added feature: Burn carcass. Has only one flavor. Burn the carcass to an ash pile. Inventory will be burned with them so get it before you&#39;ll burn them.\r<br />- To burn corpses or charcasess you&#39;ll need a torch in your inventory.\r<br />- Completely removed disable/delete from the master perk script. This will effectively fix the bug of no returning leveled spawns.\r<br />- You can now take human corpses and sell them for a very high prize...well I guess you know where...not at vendors.\r<br />\r<br />[size=4][b][color=#00FF00]Release 4.01.2013, Version 0.1:[/color][/size][/b]\r<br />\r<br />- added feature to remove corpses or take them into your inventory to be sold at vendors\r<br />- human corpses can only be removed, not be sold\r<br />- corpses inventory weight when taken gets determined ony the creatures height / 10\r<br />- corpses gold value is determined on creatures height: height &lt; 35 = 10 gold, height &lt; 90 = 100 gold, height &gt; 90 = 200 gold <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patches-78266-1-3-2.7z?fid=1000242539&ttl=1535866965&ri=8192&rs=8192&setec=ce00b664e365c734caf60da7421f5cd4"
    }
  ]
}