{
  "modId": 78267.0,
  "modName": "Male Argonian Throw Voice Fix",
  "summary": "Replaces missing male Argonian Throw Voice dialogue with that of male Orcs.",
  "descriptionHtml": "This is a simple fix made by me that replaces the male Argonian&#39;s Throw Voice lines with the male Orc&#39;s.\r<br />Male Argonians (among other sexes and races) in the vanilla game are lacking the dialogue completely. While they will whisper the words of power to the shout, the sound of the cheesy insults can not be heard, leaving enemies in the area to chase after an awkwardly silent ball that emanates sound waves. It looks weird and it feels weird. In fact, it makes the shout totally lacklustre in my opinion. Having subtitles on only makes it worse, as the insults appear in the subtitles but cannot be heard. I came up with this quick little fix specifically for male Argonians, since my current character happens to be one. I chose the male Orc voice because it blends in with the male Argonian voice better than the other voice types do. The Orcs have a low, rumbling voice that complements the Argonian voice type better than the higher-pitched and clear-sounding human voice, or the heavily-accented Khajiit voice, so I went with the Orc voice because, to me, it&#39;s the most immersive. \r<br />\r<br />If you wish to use this with a different race, you will have to change the name of the folder &#34;maleargonian&#34; to match the name of the voice type for that race. \r<br />\r<br />This mod should have no conflicts unless you have another mod that alters the Throw Voice lines for male Argonians. There should be no bugs, but if you discover one, please let me know.",
  "categoryId": "104",
  "version": "1",
  "author": "CosmicShadows",
  "createdUnix": "1472378455",
  "updatedUnix": "1472378435",
  "containsAdultContent": false,
  "uploadedBy": "CosmicShadows",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000218621",
      "name": "Throw Voice Fix (Male Argonian)",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "102",
      "fileName": "Throw Voice Fix (Male Argonian)-78267-.rar",
      "uploadedUnix": "1472378435",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d1eb2be8ec72a8e7cf8ef5dea017bd0992e18fc5a7a84b758842d4d96d8373e2/analysis/1472378462/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Throw%20Voice%20Fix%20%28Male%20Argonian%29-78267-.rar?fid=1000218621&ttl=1535866966&ri=8192&rs=8192&setec=2c9984c23ce910a7a604daa31be0abc6"
    }
  ]
}