{
  "modId": 78295.0,
  "modName": "Traps Make Noise - More Dangerous Traps- Traduzione Italiana",
  "summary": "Traduzione italiana della mod Traps Make Noise - More Dangerous Traps.",
  "descriptionHtml": "Questa è la traduzione italiana di Traps Make Noise - More Dangerous Traps.\r<br />[i]Installazione:[/i]\r<br />Traps Make Noise non necessita di traduzione, ma solo Traps Are Dangerous, quindi solo se installate questa versione della mod avete bisogno della traduzione. Dopo aver installato Traps Are Dangerous, sostituite l&#39;esp originale con quello tradotto.\r<br />\r<br />[center][size=3][b][i]Traduzione della descrizione della mod:\r<br />[/i][/b][/size][/center]Hai mai notato come i nemici non sembrano mai essere preoccupati quando scatta una trappola? Anche quando cadono una dozzina di grossi massi a pochi\r<br />metri da loro… nessuna reazione, nessun allarme quando qualcuno fa scattare una delle loro trappole, niente. Questo uccide all’istante la mia immersione, ancora di più quando gioco un personaggio furtivo. Ho visto mod che aumentano il danno provocato dalle trappole, ma non sono stato in grado di trovarne una sola che affronta questo problema… quindi eccolo qui.\r<br />\r<br />\r<br />Nel gioco vanilla,le trappole sono impostate per creare un piccolo evento di rilevamento, ma solo se effetivamente colpiti dalla trappola. Se si evita il danno, quel bandito che si trova a pochi metri di distanza continuerà come se non fosse successo niente. E anche se si subisce danni, l’evento di rilevamento creato è così piccolo da non avere molto importanza, a meno che il nemico non è vicino a voi.\r<br />\r<br />\r<br />Questa mod crea un evento di rilevamento qualora una trappola scatta. Ogni nemico vicino si allerterà e comincierà a cercarvi. Ho impostato diverse trappole per creare gradi differenti di allarme, così le trappole con i massi e quelle esplosive creeranno del rumore che allerterà tutti in zona, mentre le mazze oscillanti e le trappole per orsi creeranno solo un piccolo rumore che allerterà solo chi è vicino.\r<br />\r<br />[center][img]http://skyrimgems.com/images/badge_featured_500.png[/img][/center][b]\r<br />[/b][size=4][b]Opzioni aggiuntivi[/b][/size].\r<br />[color=#cfe2f3][b]TRAPS ARE DANGEROUS[/b][/color]:In aggiunta all’ evento di rilevamento, questa versione include anche un aumento di danno per molte trappole nel gioco. Questo file richiede sia Dawnguard che Dragonborn. Questo file include tutti i cambiamenti di Traps Make Noise, quindi installate solo uno dei due main file.\r<br />[color=#cfe2f3]\r<br />[b]MINING MAKES NOISE[/b][/color]:Questo è un add-on opzionale che aggiunge un evento di rilevamento anche quando si estrae i minerali. Questo è un semplice rimpiazzo di script e non c’è bisogno di un esp. Se usate la mia mod [url=http://www.nexusmods.com/skyrim/mods/49791/?]Complete Crafting Overhaul[/url], siate sicuri di scaricare la CCO version.\r<br />\r<br />[size=4][b]\r<br />Raccomandato[/b][/size].\r<br />Anche se non necessario, raccomando fortemente di usare questa mod con una che incrementa il tempo di allerta per gli NPC.\r<br />\r<br />[color=#cfe2f3][size=3][b]Raccomando altamente di installare [url=http://www.nexusmods.com/skyrim/mods/55100/?]Wiseman303s Trap Fixes[/url].[/b][/size][/color]\r<br />Rende alcuni migliormanti necessari alle trappole ed è pienamente compatibile con  Traps Make Noise e Traps Are Dangerous.\r<br />\r<br />Raccomando altamente anche [url=http://www.nexusmods.com/skyrim/mods/28418/?]Stealth Skills Rebalanced[/url] per un miglioramento alla furtività.\r<br />\r<br />Se non vuoi che i tuoi seguaci cadino nelle trappole e rovinino il vostro approccio furtivo, raccomando altamente la mod [url=http://www.nexusmods.com/skyrim/mods/11609/?]Follower Trap Safety[/url] di Alek. Potete anche prendere in considerazione [url=http://www.nexusmods.com/skyrim/mods/16531/?]Better Stealth AI for Followers[/url] per ulteriori miglioramenti al comportamento furtivo dei seguaci.\r<br />\r<br />[size=4][b]\r<br />Compatibilità[/b][/size].\r<br />Traps Make Noise dovrebbe funzionare bene con altre mod che alterano i danni delle trappole, il livello delle trappole,o i tassi di malattia.\r<br />Invece Traps Are Dangerous andra in conflitto con mod che alterano i danni delle trappole, il livello delle trappole,o i tassi di malattia.\r<br />\r<br />\r<br />Questa mod è soprattutto compatibile con Follower Trap Safety, però andrà in conflitto con un singolo script &#34;TrapBear.pex&#34;, così ho incluso una patch di compatibilità che combina le modifiche di entrambe le mod a questo script. Devi avere Follower Trap Safety installato per usare questa patch.\r<br />\r<br />\r<br />Mining Makes Noise andrà in conflitto con ogni mod che modifica “MineOreScript.pex”.",
  "categoryId": "78",
  "version": "2.1",
  "author": "kryptopyr",
  "createdUnix": "1472417582",
  "updatedUnix": "1472417580",
  "containsAdultContent": false,
  "uploadedBy": "NerdissimoPC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000218694",
      "name": "Traps Make Noise and Are Dangerous",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Traps Make Noise and Are Dangerous-78295-2-1.7z",
      "uploadedUnix": "1472417580",
      "modVersion": "2.1",
      "virusScanUrl": "https://www.virustotal.com/file/1b51a98a023b9aed73b12abfee2616b19aba8942b0ff0122fcbc6b7e798ab865/analysis/1472417582/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Traps%20Make%20Noise%20and%20Are%20Dangerous-78295-2-1.7z?fid=1000218694&ttl=1535866986&ri=8192&rs=8192&setec=d31becfad11fa35f339ac09f23bcf21e"
    }
  ]
}