{
  "modId": 78303.0,
  "modName": "Duke Patrick&#39;s Archery - H2H - Heavy - Light Weapons Combat",
  "summary": "Complete Combat Overhaul created by a &#34;real life&#34; western medieval melee weapons competitor of over 30 years&#33;",
  "descriptionHtml": "[color=#ff7700][size=4]Duke Patrick&#39;s Archery - H2H - Heavy - Light Weapons Combat [/size][/color]\r<br />\r<br />[color=#ff0000]This mod has been in constant work for many many years and only available on Tes Alliance. \r<br />But I promised that someday I would try offering it on this web site.[/color]\r<br />\r<br />\r<br />[list]\r<br />[*][color=#ffff00]SKSE  required.[/color]\r<br />[*][color=#ffff00]Keyboard and mouse required.[/color]\r<br />[*][color=#ffff00]60 frame rate or better required (100 recommended).[/color]\r<br />[*][color=#ffff00]English install required for some features such as arrow type accuracy bonuses.[/color]\r<br />[*][color=#ffff00]DawnGuard DLC is needed ONLY if you want the crossbows.[/color]\r<br />[*][color=#ffff00]This mod uses MCM for configuration.[/color]\r<br />[/list] \r<br />Test Video : [url=http://youtu.be/ZqYlTuptbxE]http://youtu.be/ZqYlTuptbxE\r<br />\r<br />[/url]\r<br />Dragon Fight using the mod : [url=https://www.youtube.com/watch?v=ZohpS3QhnHw]Dragon Fight[/url]\r<br />\r<br />\r<br />[color=#ff0000][size=5]ATTENTION&#33;[/size][/color]\r<br />[color=#ff7700][size=4]This mod for OldRim will no longer be updated.  I might move on to Skyrim64 once SKSE 64 is up to speed. The reason is a combination of being a little disillusioned with Bethesda these days and burned out after working on this same Skyrim mod for 6 years, 20 hours a week.[/size][/color]\r<br /> \r<br />\r<br />This mod and all it&#39;s features is a merged port of my Oblivion mods. It is intended to act as a combat simulator (as much as I can mod Skyrim to be anyway) based on my 30 years of western medieval heavy weapons (SCA tournament) fighting. I was King twice and hold the rank of Duke and Knight in the SCA.\r<br />\r<br />see here:[url=https://web.archive.org/web/20120618193610/http://www.spookyfx.com/book/tromp.html]https://web.archive.org/web/20120618193610/http://www.spookyfx.com/book/tromp.html[/url]\r<br />\r<br />Some of my original Oblivion combat features will not be possible in Skyrim unless SKSE can someday allow it. \r<br />\r<br />I will avoid game-ish features and contrived game balance mechanics when I possibly can. Please do not ask me to include such features. And the PACE of the combat will possibly be slower than you are use to in games. But it will also be brutal and you will actually feel the weight in your attacks and blocks&#33;\r<br />\r<br />\r<br />My game design philosophy is to (when possible) allow the player to try whatever they want to INSTEAD of telling the player &#34;you cannot do that until you are such and such skill level&#34;. You may find that you will not do well at what you are trying to do until you are such and such level, but you can still try to do it. You may even find creative ways to bypass the skill or attribute limitations using tactics or magic buffs&#33; So before you set your player preferences to EASIER levels (such as reducing the stamina cost to perform actions) try overcoming limitations with your other resources or clever techniques&#33; Or even just earn it by raising your stamina and health the hard way before trying to utilize the advanced features.\r<br />\r<br />\r<br />Real life SCA combat is wonderfully brutal, fascinatingly tactical and unbelievably FUN even when you lose the fight. There is no reason PC game combat cannot be the same way if it is designed to do so properly.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff0000]Below is only a brief list of the mod&#39;s features, refer to the ReadMe files for full details.[/color]\r<br />(My features work the same for all actors and the player except one were noted below.)\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Configuration File[/color]\r<br />Some players may need to more slowly adjust to the new deadly and brutal realism of the combat. So a MCM page is provided. You will need SkyUI or the MCM (without SkyUI) mod. You may set all your preferences in this file. Many of the features can be adjusted or turned off. However you can use this mod without either SkyUI  or the no SkyUI MCM mod but you will only be able to use the default settings. \r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Newest Features\r<br />\r<br />[/color]-&gt; H2H and Parkour skill Trainers that require more than just gold.\r<br />\r<br />-&gt; Grip change weapons (GREAT for bastard swords).\r<br />\r<br />-&gt; Duke Patrick Combat Achievements.\r<br />\r<br />-&gt; Combat Magic&#33; Spells that require you to utilize Range, Geometry and Timing&#33;\r<br />\r<br />-&gt; Parkour Wall Jumps&#33; Now you &#34;climb up&#34; walls and other obstacles that are taller than a few feet.\r<br />\r<br />-&gt; Falling from high places will now force actors to stumble or crash face first into the dirt when they land on the ground&#33;\r<br />\r<br />-&gt; Poisoned weapons do not take effect if their attack is blocked. However Poison will last longer on the weapons now. \r<br />\r<br />-&gt; Actors become more aggressive when your back is turned to them&#33;\r<br />\r<br />-&gt; Throw ANY weapon at your opponents&#33;  ANY melee weapon from ANY mod&#33; Spears are especially fun to throw.\r<br />\r<br />-&gt; Manual crossbow loading&#33; No more auto load, crossbows only nock a bolt when you want them to. I discovered a very simple way to do this.\r<br />\r<br />-&gt; Archery practice on the pells will raise skill. A follower can throw bottles up into the air for you to do some advanced level target practice&#33;\r<br />\r<br />-&gt; FEINT &#34;crafting&#34; and &#34;tempering&#34;. Now working a pell (hitting a practice dummy) will start a crafting system for the player to discover and improve \r<br />their feints (trick shots).\r<br />\r<br />-&gt; H2H Skill And Mechanics: \r<br />[list]\r<br />[*]A new H2H skill that is advanced when you fight H2H.\r<br />[*]Kick Animations. \r<br />[*]H2H blocking that will stop damage from kicks and punching and if your time blocking is good you can deflect light weapon attacks.\r<br />[*]H2H skill now effects how much damage you do with H2H kicks and punch.\r<br />[*]H2H perks that branch off of the light armor skill tree. However you will need H2H skill to advanced up this branch.\r<br />[*]Aikido like grapple throws. This Grapple Throw will cause a little damage depending on the size of the actor and force them to drop any weapon they have in their hands.\r<br />[/list]\r<br />-&gt; Comprehensive Light weapons mechanics and perks including blocking while in the middle of an attack, bonus to hitting gaps in armor as well as much faster combat than heavy weapons.\r<br />\r<br />-&gt; Depending on skill, stamina, distance and other factors it is possible for any attack to hit the gaps in armor thus ignoring it.\r<br />\r<br />-&gt; Locational Armor is 3x protection against tooth, claw and H2H attacks and 2x the protection against arrows.\r<br />\r<br />-&gt; If a dragon is killed while flying they will crash immediately tumbling from the sky rather then play the long death sequence.\r<br />\r<br />-&gt; Dragon&#39;s scales will protect them from arrows and melee unless you hit their soft underbelly or the gaps in their scale armor.\r<br />\r<br />-&gt; Long Jumps&#33; You will travel much farther forward now when you sprint and then jump&#33;\r<br />\r<br />-&gt; Silver poison shader effect and now silver weapons and silver arrows work for all actors not just the player.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff00ff]New-   C O M B A T    M A G I C[/color]\r<br />Combat Magic is still combat. The Combat Practitioner must understand the same fundamental truths of range, geometry and timing that are at the core of all martial arts. If you do not want this in your game you may turn it completely off at any time in the mod configuration file.\r<br /> \r<br /> \r<br /> \r<br /> \r<br />[color=#ff7700]Florentine Style (two weapon) Blocking[/color]\r<br />You can set what key you want to to use in the INI file. Default is the mouse 4th button.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Esoteric Combat Perks[/color]\r<br />All the combat perks have been overhauled. Combat Perks for the most part are now &#34;talents&#34; that one might develop from years of doing something and not a necessarily a &#34;skill&#34; that you normally could be taught to do. Many of the old vanilla perks that really should not have been perks are now just natural to all actors such as the shield charge and running with a bow.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Some Of The New Archery Features:[/color]\r<br />Strength will be more important than marksman skill for RAW massive damage with arrows. If you are not strong enough to effectively draw a powerful bow you will not do as much damage as those that are. However marksmanship will prevent you from missing what you aim at. So you will hit your critical shots more often and not miss the target as often. If you have very poor marksmanship your arrows will not hit where you aim. Many of the archery perks depend on you hitting where you aim. If you do not then the perk will not take effect.\r<br />\r<br />Strength will also help you to draw bows a little faster. And there is a perk to account for esoteric mechanical skill to draw the bow a little faster.\r<br />\r<br />All actors can now [i]RUN[/i] while drawing and shooting a bow. However your aim will be horribly affected unless your marksman skill is extremely high. Running is the worse movement. The moment after you fire a bow will add to your inaccuracy, each time you fire another shot too soon after the last one your aim gets progressively worse.\r<br />\r<br />Crouching (sneak mode) will double your aim effectiveness.\r<br />\r<br />Low stamina will be about the worse thing for your aim.\r<br />\r<br />When you are in 1st person and moving around while drawing your bow you will see &#34;bow sway&#34;. Marksman skill will reduce the amount of visual bow sway you see in first person.\r<br />\r<br />You will now have Locational Hits with bows up to 100 feet (and locational armor counts just like the melee weapons). For technical reasons after 100 feet it is always considered to be a body shot.\r<br />\r<br />A arrow in the head of an actor with no helmet can be a kill in one shot as you draw back arrow all the way first. However you will find that hitting the head in combat may not be so easy unless your target in close range.Bow Draw Stamina Consumption\r<br />Normal drawing of the bow now consumes stamina based on how strong the bow derived form the bows base damage.\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Dynamic Draw Time[/color]\r<br />The time it takes to fully draw the bow is derived form the bows base damage.\r<br />\r<br />\r<br />[color=#ff7700]Bow Draw Dynamic Damage[/color]\r<br />If the archer does not fully draw the bow they will not inflict full damage. As long as the archer fully draws back the bow they will do full damage based on their strength and the bows ability to store the potential energy no matter how much stamina is left with when the arrow is released.\r<br />\r<br />\r<br />\r<br />[color=#ff7700]100% Recovery Of Working Arrows Or Broken Arrows[/color]\r<br />I do not like seeing arrows stuck in dead opponents and yet when you activate them they have no arrows. It is now 100% arrow recovery but with a possibility of the arrows turning into objects called broken arrows.\r<br />\r<br />Thus if you see an arrow stuck in the targets body there will be one in their inventory. However that arrow may be broken.\r<br />\r<br />Calculations for this include:\r<br />[list]\r<br />[*]Stamina %\r<br />[*]Movement\r<br />[*]Body Size\r<br />[*]Attacking\r<br />[*]Falling\r<br />[*]Heavy (Ridged) Armor *\r<br />[/list]So the more stamina % they had, the more exaggerated their movements, the bigger they are and the heaver their ridged armor means the more likely something extreme happen to break the arrow. Your arrow supply will now depend on how you play and the conditions of combat.\r<br />\r<br />* Armor is locational&#33; Hit their unprotected leg instead of their closed face steel helm if you want to try to recover your arrow&#33;\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Some Of The New Melee Features:[/color]\r<br />Slower combat pacing and all attacks now consume stamina. The same factors for weapon speed are used to calculate for attack stamina consumption.\r<br />\r<br />Attack Force is calculated including factors such as actor size, health, actor&#39;s momentum and weapon size and balance. The more attack force that hits you the more stamina is consumed to block. If the Attack Force overwhelms the actor they will be staggered or knocked to the ground.\r<br />\r<br />Block skill will matter much more now to block. So although your shield and weapons can block a lot more damage you will not do so unless the actor has the skill to prevent stamina drain and you have the skill for timing and footwork. As a low skilled player and actor you will need to use large shields to make up for your lack of skill. The better you and your actor skills get the smaller the weapons that can be used to block.\r<br />\r<br />Swinging Balanced weapons like blades will use much less stamina than when your weapon actually hits a target. For technical reasons this feature only works on living targets not things like trees.\r<br />\r<br />Swinging without hitting a target with a Top Heavy weapon like a mace or axe will use much more stamina than when your weapon actually hits a target. For technical reasons this feature only works on living targets not things like trees.\r<br />\r<br />Combat stamina auto regeneration rate is now very low&#33; However you can FAST REST by not attacking. If you block this fast rest is a little slower and if you move around it is still slower. The fastest &#34;Fast Rest&#34; is achieved by not attacking nor blocking nor moving&#33;\r<br />\r<br />This means you need to use footwork and timing (timing attacks and timing blocks) to get your stamina back up to good levels. The higher your stamina % the faster the stamina rate runs. Good Stamina management will be necessary to keep up a higher rates of attacking.\r<br /> \r<br />Actors play a drink animation when they use potions. This completely changes how you play combat&#33; \r<br /> \r<br />Actors must have 25% or more Stamina or they will not be able to do a power attack nor a bash attack.\r<br />Normal attacks cannot be done unless you have more than 10% stamina.\r<br /> \r<br />IF YOUR STAMINA IS ZERO YOU WILL NOT BE ABLE TO FIGHT AND YOU WILL MOVE SLOWLY&#33;\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Serious Injury Before Death[/color]\r<br />Actors (with some exceptions) will stumble around and often fall to the ground crawling in pain if they make any effort to fight when they are at 15% health or less. So you will not have opponents standing tall holding their block or attacking with force when they are on the edge of life anymore. Attacks to the legs will in general not kill actors. Melee attacks can inflict this &#34;injured state&#34; quickly but actual death once the health is very low will take much longer in most cases. \r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Smash of the Titians[/color]\r<br />Any actor can be bat around like a rag-doll if the other actor is much bigger and stronger. The weapon mass you block with and the weapon mass that is used to hit you are factors in this as well. So if you have a large male Orc use a war hammer to smash a small female elf blocking with her shortsword she is going to get knock around the room.\r<br />\r<br />But if that same Orc is slapped by a dragon that Orc is most likely going to fly across the battlefield.\r<br />\r<br />Factors include: Weapons mass (modified by blocking skill), Strength (size of actors + 25% health), Stamina of the attacker\r<br />and Power Attack.\r<br />\r<br />This means weapon&#39;s no longer automatically stagger just because they are 2h war hammer or what ever. The stagger stats of all weapons is replaced with this new system.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Duke Patrick&#39;s Realistic Feint System&#33;[/color]\r<br />Now you and the other actors can be tricked into opening your defense with true to life feinting mechanics that is part player skill and part actor skill&#33;\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Timed Blocking[/color]\r<br />Timed Blocking can reduce the amount of stamina you burn and any stagger you may receive when you block an attack. Your actor&#39;s Block skill determines the time window, so the more block skill they have the easier the time block will be for you and also the more effective the time block can be.\r<br />\r<br />The bigger the weapon/shield is that you use to block the more stamina you will burn when you first move the weapon/shield into your block position. Blocking an attack with smaller weapon/shield will burn more stamina if the other weapon is larger, but holding a smaller weapon up in anticipation of the block will burn much less stamina. This means that static blocking with a shield is a better idea than static blocking with a sword but timed blocking with a sword is better than with a shield.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Dynamic Blocking Stamina Burn[/color]\r<br />Giant or extremely hard hitting attacks will still hurt and kill you through your shield or weapon blocks, however blocking can now stop almost all the damage as long as your stamina is not drained. The end result of how much stamina is burned to block will be a combination of:\r<br />\r<br />How hard you are hit. (attacker&#39;s strength, power attack, stamina, weapon size, momentum etcetera ).\r<br />Top heavy weapons used to attack get a bonus.\r<br />How strong the defending actor is.\r<br />How good the actor block skill is.\r<br />How big the weapon/shield used to block with is (bigger reduces ensuing stamina drain).\r<br />How big the weapon/shield moved for the block is (bigger burns more initial stamina).\r<br />How well the player Time Blocks.\r<br />Plus blocking perks that pertain to stamina burn. \r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Dynamic Shield Charge[/color]\r<br />&#34;Shield Charge&#34; has been overhauled and given to all actors that can use a shield including the player at level 1.\r<br />\r<br />The success and power of the shield charge is no longer static (in vanilla Skyrim it was a pushactoraway effect at power of 10 no matter who did it or what you hit as long as it was not a giant or a dragon). Now it is calculated including the following factors:\r<br />\r<br />- Momentum\r<br />- Strength\r<br />- Angle of collsion\r<br />- Shield charge PERK gives a bonus to momentum.\r<br />\r<br />Momentum factor will mean that this cannot be triggered until you have had a little run time first. Before the effect could triggered even if you only had 2 feet of &#34;sprinting&#34; before you hit the targets.\r<br />\r<br />And direction of the collision now is a consideration as before you could run into them while moving almost BACKWARDS and it would still work.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Weapon and Shields Blocks Arrows[/color]\r<br />Swords and other weapons by default can now deflect arrows IF the arrow hits the weapon with no perk needed&#33;.\r<br />This applies to the Player and only some actors as there is no working method to dynamically give actors Perks in this game.\r<br />\r<br />\r<br />[color=#ff7700]Shields Block Elemental Damage & Spit Attacks[/color]\r<br />Actors can block almost all the damage of Fire and Frost and creature spit attacks IF they use a shield and only if they are facing the attack while blocking.\r<br />\r<br />\r<br />[color=#ff7700]Shields Feel More Realistic[/color]\r<br />Shield and weapons block a LOT more damage now, you will now actually feel a difference when you allow a weapon to hit you or when you succeed with a block.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Dynamic Damage and Momentum Bonus.[/color]\r<br />Stamina now affects how much damage actors will do&#33; Rotational movement and Liner Movement in the direction of the attack will increase the damage done. This can be devastating if on a mount, spinning around to hit a rear flank opponent or when used with the supernaturally fast shout sprint and your timing is very good&#33;\r<br /> \r<br />Numerous real time factors are combined to calc the damage on an attack. Some of the more important variables are:\r<br />[list]\r<br />[*]Stamina (effects almost E V E R Y T H I N G &#33;)\r<br />[*]Strength\r<br />[*]Perks\r<br />[*]Quality of the weapon.\r<br />[*]Weapon Skill Level.\r<br />[*]Armor (can absorb up to 99% damage).\r<br />[*]Armor Gaps (ignores armor).\r<br />[*]Magic protection (reduces the vanilla, non scripted damage).\r<br />[*]Magic enhancement (increases the the vanilla, non scripted damage).\r<br />[*]Accuracy of the attacker (Important modifier for hitting the head, armor gaps etcetera.)\r<br />[/list]On top of all that …\r<br /> \r<br />Movement of the target and movement of the attacker combine (rotational, liner and angles of attack) to give you the following modifiers:\r<br />[list]\r<br />[*]Momentum (a significant damage modifier).\r<br />[*]What flank the attacker is on the target (around back can increase damage).\r<br />[*]What flank the target is on the attacker  (too far around to the left or right can reduce damage)\r<br />[*]Hit location (Leg = less &#34;damage&#34; and is very hard to kill the target, Head = Massive damage, instant death or other effects) \r<br />[*]Too close  (less damage but more hits, see Wrap Shots in the read me doc. But shorter range attacks makes hitting the gaps much easier.)\r<br />[*]Too Far (less damage can be inflicted at the weapon&#39;s maximum contact range, this is called a &#34;glancing&#34; shot).\r<br />[/list]See the read me docs for much more on this subject of Dynamic Damage.\r<br /> \r<br />Weapon Damage shown in the inventory is only a small part of the damage the weapon can do.\r<br />Note you can see additional weapons stats in the inventory by pressing your two weapon block button.\r<br /> \r<br />Difficulty needs to be set to Adept (dead center) and then use the Configuration file to &#34;ballance&#34; to your taste. \r<br />As your smithing and weapon skill go up to high levels it will take noticeably less hits to kill and one hit kills will be more frequent.\r<br /> \r<br />I am still making adjustments to how creatures can maul your flesh around your armor. Many creatures attacking you at one time should be able to rip you to shreds as they will find the gaps quickly as a group. But One bear for example should not be able to kill you as fast if you armor is really great.\r<br />\r<br /> \r<br /> \r<br /> \r<br />[color=#ff7700]Locational Damage and Locational Armor[/color]\r<br />A power shot to a head that is not protected by armor can be a fatal one shot&#33; A blow that does enough damage to the legs can trip your opponent.\r<br />\r<br />Head shots give the most damage, the body does about half of the head and the legs/feet do the least amount of damage. However the locational damage multipliers are player configurable in the Configuration file.\r<br />\r<br />So fights could be fast and brutal or go on for a long time depending on how well they block and what armor they are wearing versus what weapons you are using and where you hit them&#33;\r<br />\r<br />This mean weapon&#39;s no longer &#34;critical hit&#34; just because they are 2h blade or what ever. The critical damage stats of all weapons is replaced with this new system.\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Combat Endurance[/color]\r<br />This kind of combat is so physically intensive that sometimes the victor is not the most skilled, she or he may only be in much better condition than the loser. You can literally defeat your opponent by outlasting them as long as you make no mistakes in your defense. This fact will make building your stamina base up to high levels just as important as your health and skill.\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Combat Endurance Movement Speed[/color]\r<br />Actor&#39;s movement speed will be effected by their Endurance level. The lower the Endurance level the slower the movement speed. This will also act as another clue that your opponent is exhausted and it is time to use your weaker feints or any trick you have been saving in the fight for the best opportunity.\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Increased Backwards Speed Plus Trip And Fall Risk[/color]\r<br />THIS IS NOT DONE WITH RANDOM DICE THROWS&#33;\r<br />The fall results from running into or onto objects (and dead bodies). This happen most often when an actors stamina is low.\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Logical Health Limits[/color]\r<br />Now Mudcrabs (and all other small actors) do not take the same number of sword blows to kill as a troll just because you are playing a high level character. Actor health is limited by the size and strength of the actor. If an actor looks like it should die with 3 sword blows it will die with 3 sword blows (unless it is protected by magic means such as wards or spells or potions).\r<br />\r<br />\r<br />\r<br />[color=#ff7700]NPC Can Fumble&#33;[/color]\r<br />NPC might hit each other by accident if they miss hitting you and they are crowding in and around you.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Left Hand Weapon Attacks Are More Difficult To Defend Against&#33;[/color]\r<br />Forget all the movie and game nonsense you have heard about Florentine style (two weapons) the real reason fighters used this style when it was their choice to do so (not just out of necessity in the fog of battle) was because it can confuse and overwhelm the opponent adding effectiveness to the feints. When you or any actor attack with the left hand weapon this adds bonuses to your success to bypass their defense&#33;\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Hand to hand now has a chance to block a melee weapon attack[/color]\r<br />If you have the Block skill, you can do close in grapple blocks that can even stop a war hammer by impeding the limbs that swing the weapon instead of taking the force of the weapon from the weapon&#39;s head straight into your arm.\r<br />\r<br />\r<br />[color=#ff7700]Attack Blocks&#33;[/color]\r<br />If you attack with a normal or power attack while you have a melee weapon and while your opponents is attacking and you hit the weapon (aim at their arm) that is attacking you may be able to deflect their weapon attack depending on skill and stamina. This gives you an attack and block in one move.\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Actors Show Pain[/color]\r<br />All actors react to getting hit hard&#33; This is based on damage done not by a random dice throw&#33; If the player or other actors are hit with only a little damage no pain reactions (&#34;stagger&#34;) will trigger, but if hit with a lot of damage (20% of current health on each attack) actors will stagger.\r<br />This means anything that reduces the power of the attack (such as armor, magic or actor low stamina ...and more) could prevent the pain reaction.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Dynamic Weapon Speed and Less &#34;Arcade&#34; Like Weapons Speeds[/color]\r<br />Weapon stats including speed and damage are now calculated using many factors including stamina, weapon weight, weapon balance, weapon length. Weapon speed can often slow way down when stamina is under %25. This is a big clue to the player that the other actor is in a depleted state of stamina. Weapon length has a dramatic effect on the speed so longer weapons will tend to move slower than shorter weapons. This dynamic attack speed feature will work on all weapons even from other mods.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Combat Geometry[/color]\r<br />Rear Flank attacks do extra damage and get bonuses to tripling and other critical hits.\r<br />Low Blows (attacking under the block) can help get past shields and weapon blocks.\r<br />Tighter more realistic angles of attack and defense. Now side stepping and circling can help to get your weapon past blocks and evade incoming attacks.\r<br />\r<br />\r<br />[color=#ff7700]Realistic Attack Range[/color]\r<br />Melee combat range is set way down and now will play much more realistically and allow for more intuitive action. Each weapon&#39;s range is now directly set per the length of the 3d model of the weapon and not by the &#34;guess work&#34; of the weapon&#39;s artist. \r<br />\r<br />\r<br />\r<br />[color=#ff7700]No Auto Aim&#33; (the attack magnetism)[/color]\r<br />Attacks for all actors will miss more often making dodging a practical defense now.\r<br />\r<br />\r<br />\r<br />\r<br />[color=#ff7700]Ethereal Ghosts[/color]\r<br />Bethesda changed ghosts so any weapon can kill them now. This had to be &#34;fixed&#34;. Now when they are not attacking or blocking they will not be solid enough to hit. Magic and silver weapons do almost triple damage. So the end result will be that you will land blows a heck of a lot less, and using a silver/magic weapon is going to be very important to effectively “kill�� the ghost.\r<br />\r<br />\r<br />[color=#ff7700]Classic Vampires[/color]\r<br />Vampires will burn up quickly in the sun, holy water staggers them, wood stakes can kill them very quickly if you hit their heart, when they die they bust into dust, but they are supernaturally fast and strong with lighting quick dodging and can throw you into the walls and ceiling. Unlike the Ethereal Ghost feature this is an optional feature that can be turned off if you prefer the vanilla &#34;half&#34; vampires.\r<br /> \r<br /> \r<br />\r<br /> \r<br /> \r<br />[color=#ff0000][size=4]THIS IS NOT THE READ ME FILE&#33; YOU MUST READ THE READ ME FILE TO USE THIS MOD PROPERLY.[/size][/color]\r<br /> \r<br />\r<br /> \r<br />[color=#ffff00]Critical Advice For Low Level (1-15) Player Characters[/color]\r<br />---------------------------------------------------\r<br /> \r<br />Low level fighters will struggle a great deal. After you are above level 15 and have a few of the combat perks then you will start to feel more confident and dangerous. About level 30 (with at least half the combat perks) is when you will feel more like a bad-ass.\r<br /> \r<br />Keep in mind that &#34;stamina&#34; is no longer how exhausted you are (there is a new mechanic for that now).  It is now a combination of perception, opportunity and &#34;muscle memory&#34; (trained reflex) to act on what is happening in the fight. I would have preferred to keep theses as separate characteristics but Bethesda&#39;s simplification of the character stats took that nuance away in Skyrim.\r<br /> \r<br />Stamina management is extremely important. Most all the NPC actors do this well (they are forced to) however players tend to get &#34;overly excited&#34; and swing swing swing without using properly timed pauses.  \r<br /> \r<br />You must stop attacking and use more foot work&#33; Once your character’s skills (and your player skills) become much MUCH better you can then use light weapons and swing swing swing like a Nintendo ninja ( you can now achieve blinding fast attacks but with extremely lethal damage even to opponents in armor).\r<br /> \r<br />Stamina will regenerate faster the higher you maintain it. And it will regenerate much slower if you let it drop down too low. I personally have been trying a new thing (for me in my game) of not wearing any helmet in combat. This is dangerous but it gives me faster stamina regeneration because helmets have penalties for stamina (per my mod).\r<br /> \r<br />Part of the reason you are not doing a lot of damage is because you are not managing your stamina, low stamina means low damage. And if the targets wear good armor it can mean NO damage.\r<br /> \r<br />Armor gaps are NOT WYSIWYG (not what you see is what you get)&#33; They are calculated dynamically in real time, see read me for the details.\r<br /> \r<br />Keep in mind that just because you the player aim at something that does not mean your character hits that something. You may try to swing at the head for example and indeed you will see the swing pass by the head but the CALCULATED impact (Not the impact you may think you see on screen)  is often on the body not the head. Your characters aim will get better as they gain skill.\r<br /> \r<br />Don’t forget to load the “faster�� get up mod&#33;\r<br /> \r<br /> \r<br />Tip: as a low level character, If your opponent has a helmet on when you are attacking them from behind, it is best to hit their legs. This will do some of the lowest damage but will likely force them to fall to the ground. Otherwise you may waste the opportunity and only do a minimal damage anyway. Once they are on the ground swing high for their head a few times and then back away to regain stamina.\r<br /> \r<br /> \r<br /> \r<br />[color=#ff7700]F O O T   W O R K [/color]\r<br />--------------\r<br />This is an area that players tend to be weak in because most games ignore this as a mechanic. The basic strategy of all footwork is to arrange your positions (both your opponent and yourself) to best support your attacks and at the same time most hider theirs.\r<br /> \r<br />The simplest factors include range, combat geometry (heading angles), momentum and timing.\r<br /> \r<br /> Always try to maintain a distance that is just inside your &#34;effective&#34; range and yet outside of their effective range. Effective range is more complicated than just being too far away for your opponent to hit you (getting in very close can also be outside their effective range)  but I will not go very deep into that for now.  Start your attack out of range and step in so that your hit occurs just as you get in close enough to hit them with the sweet spot of your weapon. the sweet spot is always a few inches shorter than the full range. Hitting at full range will also reduce your damage.\r<br /> \r<br /> \r<br />Always maneuver to place your angle on their center but force the opposite on them. In many cases you can be hit but if you are far enough around to their side the damage will be very low. And naturally you can attack past their shield (or weapon) if you are far enough to one side of their flank.\r<br /> \r<br />Getting in very very close is good for performing wrap shots (a special way to defeat a block) and for hitting gaps. But it comes with disadvantages as well. Attacks will tend to be weaker, standard feints harder to perform, less opportunity for momentum, you lose your range advantage with long weapons and etcetera.\r<br /> \r<br />With multiple opponents move so that the other enemies are behind the one you are fighting.\r<br /> \r<br />Move into your attacks (this adds some damage and knockback force) both forward and/or sidestep. And then after the attack break away from them at an angle while blocking. Only attack while you have about 50 to 75% or more stamina. Do not attack again until your stamina is back up over 50%. Use your footwork time to regain stamina in between your attacks.\r<br /> \r<br /> \r<br /> \r<br /> \r<br /> \r<br />[color=#ff0000]THIS IS NOT THE READ ME FILE&#33; YOU MUST READ THE READ ME FILE TO USE THIS MOD PROPERLY.[/color]\r<br /> \r<br />\r<br />Table of contents for the FULL read me file includes but is not limited to:\r<br /> \r<br /> \r<br />C O N T E N T S\r<br />\r<br />·   Strength Attribute\r<br />·   Smash Of The Titans\r<br />·   Ground Fighting\r<br />·   Dragons\r<br />·   Serious Injury Before Death\r<br />·         Braced Blocking\r<br />·   Timed Blocking (Read this, it is not like all the others you have seen&#33;)\r<br />·   Dynamic Stamina Burn For Blocking\r<br />·   Block Coverage (Passive Defense)\r<br />·   Florentine Style (Two Weapon) Blocking\r<br />·   Shield Charge Is Now Combat Bump\r<br />·         Parkour Mechanics (jump and climb)\r<br />·   Locational Damage And Critical Hits\r<br />·   Armor Gaps\r<br />·   Dynamic Damage System\r<br />·   Logical Health Limits\r<br />·   Archery\r<br />·   Bow Draw Stamina Consumption And Damage\r<br />·   Archery Practice Shooting Bottles And Pells\r<br />·   Crossbows Game Mechanics\r<br />·   Silver Arrows And Bolts\r<br />·   Throwing Your Weapon\r<br />·   Momentum System\r<br />·        Combat Endurance And Movement Speed Reduction\r<br />·   Npc Fumbling\r<br />·   Feint System\r<br />·   Uppercuts (Attacking Under The Block)\r<br />·   Wrap Shots\r<br />·         Increased Backwards Speed Plus Trip And Fall Risk\r<br />·   Attack Blocks&#33; \r<br />·   Evasive Ducking     \r<br />·   Actors Show Pain         \r<br />·   Combat Pacing And Fast Rest\r<br />·   Light Weapons\r<br />·   Less Arcade Like Weapons Speeds\r<br />·   Auto Dropping Weapons That Are Too Big To Use\r<br />·   Grip change weapon \r<br />·   Dynamic Stamina Attack Consumption\r<br />·   Hand To Hand Skill And Combat Mechanics \r<br />·         Pell Work (Skill Advancement From Practice Dummies)\r<br />·   Combat Geometry     \r<br />·   New Additional Way To Improve Your Armor Skills             \r<br />·   Weapons Block Arrows                       \r<br />·   Shields Block Elemental Damage And Spit Attacks\r<br />·   No Skyrim Auto Aim&#33; (The Attack Magnetism)\r<br />·   No More &#34;Dice Throw&#34; Critical Chance                \r<br />·   Immersive Kill Move Events\r<br />·   Creature Combat Changes\r<br />·   Combat Opportunities\r<br />·   Extra Spawns\r<br />·   C O M B A T    M A G I C\r<br />·   Classic Vampire Weakness And Vampire Hunter Tools\r<br />·   Ethereal Ghost    \r<br />·   Silver Melee Weapons\r<br />·   Combat Wards\r<br />\r<br /> \r<br /> \r<br /> \r<br /> \r<br />Q&A \r<br />\r<br />Q- Why is 60 or more frame rate required? A-  Frame rate is directly tied to script lag. Low frame rate means more script lag. Read my read me file to see what you can do to get the most from lower FR but in the end 100 frame rate is recommended for the best experience. If you use this mod and do not follow the install directions or otherwise cannot maintain a high frame rate you will see annoying script lag. \r<br />Skyrim scripting management was implemented to help prevent low FPS but it is HORRIBLE for combat scripts that require more precise timing than 1/2 a second cycles. Bethesda&#39;s even says in their wiki that the combat in this game is not intended to be modded and that very little is intended to be done in that area of modding.\r<br />From the Skyrim CK wiki:\r<br />&#34;...the specific decisions made by the Combat AI cannot be controlled through the Creation Kit&#34;\r<br />&#34;...the mechanics of combat are not something you can control.&#34;\r<br /> \r<br />From  Papyrus DEV :\r<br /> \r<br />&#34;... the focus was on correctness, not optimization (and the game doesn&#39;t need extremely optimized script code anyway, since Papyrus has different design goals then, say, C)&#34;\r<br /> \r<br />This is for several reasons but one of the most annoying is the script lag (the way the game gives time to each script to execute.) My mod has more unique combat features than any other with calculations based on dozens of combat conditions not random dice throws. But I have been forced to drop many of my original (from my Oblivion mod) 300 to 1000 lines per script, physics and AI calculations and some of my preferred logic from my features. And I am forced to drop entire features I would like to include so that the ones I do have are not taking more than a 1/2 delay to execute.\r<br /> \r<br />It is impossible for Skyrim to run scripts &#34;instantly&#34; within the normal system. Read the installation read me to be sure your lag is as low as possible.  Set in the Skyrim.INI as per the read me file.\r<br /> \r<br />Script damage comes AFTER vanilla damage to give you a &#34;health drain&#34; from attacks. This is as intended to make the lag more &#34;acceptable&#34;.  In reality, in most cases a &#34;health&#34; drain that takes a moment is more realistic than instant &#34;health&#34; subtraction anyway. \r<br /> \r<br />Skyrim script lag is a very sour subject for me, so please do what you can on your end by following the mod read me file directions and making the ALL the needed changes to your Skyrim INI file (including turning off the console logging). This will help to prevent us both from unnecessary annoyance.\r<br /> \r<br />\r<br />\r<br />\r<br /> \r<br />Q- Is this mod compatible with...\r<br />\r<br />A- For the most part I only use my own game mechanic mods, so I have no idea and could not tell you myself. But you can ask on my thread and maybe other players can help to answer that. In general ANY mod that makes any changes to the vanilla combat records including combat animation conditions, combat perks, combat game settings, projectile speeds, stamina regeneration, combat styles, combat AI and any other record used to control the behavior of combat will not be compatible. This may not result in a CTD but you will not be seeing the mod work as intended. So if you insist on ignoring the directions and combining this combat overhaul mod with other combat mods please at least have the decency to not make any comments about your game experiences (even good ones) as that would be carelessly unfair to everyone.\r<br />\r<br />\r<br />\r<br />\r<br />Q- Why are the actors blocking so much?\r<br />\r<br />A- The actors are intended to block a lot more than in vanilla.\r<br />\r<br />So all the Combat Styles for actors that can use weapons have been changed with high preference for blocking. You need to find other ways to land a blow other than the actor moving their shield out of the way for you.\r<br />\r<br />Real life sword and shield combat is more about defense than offence unless you are in a large battle were you are crowded by dozens or hundreds of other fighters. The combat geometry in that situation changes a hell of lot of what you would normally do when you are in a fight with only a few opponents and have more room to maneuver and swing your weapon. In such a battle (crowded) you almost never get hit in the leg, and Head shots are a majority of what does strike you. It is too bad this is not seen in these games. We probably will not see this in games until weapons no longer pass thru walls, trees, people to your flanks and other obstacles for the entirety of the weapon swing.\r<br />\r<br />Circling shots, feints and counter attacks will be your best friends until you get up to higher skill levels and have perks that will provide alternative ways to defeat their defense.\r<br />\r<br />To do a circling attack you must throw the attack and move around them to their side or even their back if you get really good at it. If you are slow, this will take some practice to get the correct timing. To achieve the needed clearance past their defense you will need\r<br />to throw the blow first then move so that the attack lands just at the moment you arrive at the required minimum location and angle.\r<br />\r<br />\r<br />\r<br />Q- Why am I getting one shot killed all the time?\r<br />\r<br />A- The very first attack from an enemy will be their most powerful. After the first attack the stamina will almost never be 100% again during the fight unless both of you stand down long enough for one or both to regenerate your stamina to full again. When you first exchange blows be sure you are moving sideways (to make head shots harder to land). If you can do so, use a timed block to reduce the stagger force. And Keep in mind Head Shot damage can easily be reduced with a good helmet. If all else fails then maybe you need to turn down the head shot damage level in the configuration file.\r<br />\r<br />\r<br />\r<br />\r<br />Q- Why did you change the combat perks?\r<br />\r<br />A- At first I was just going to ignore the perk system because it was so broken. The original system was full of either perks that would break game play or had perks that should have been normal combat features such as blocking arrows with weapons. So I made my features with no consideration of the existing perks at all (at first). Eventually I realized I could not ignore the perks, so now I am trying to edit them, the problem is that I want the perks to be things that you would not normally learn from a trainer and instead only be the kinds of esoteric tricks and skills you would pick up from years of doing something. Coming up with those kind of perks is more difficult than it sounds.\r<br />\r<br />\r<br />Q- Why do all the features only use the same % of stamina? Why would I put any points in Stamina and not just put them all in Health?\r<br />\r<br />A- They do not. Sprinting, Dodging, Blocking, and Power attacks and several other features are flat costs to stamina where a high base is very important. But the bottom line is that Combat Endurance (unless you turn it off or down too low) has a profound effect on your combat (directly effecting ALL other stamina related calculations and features) and is almost completely dependent on your base stamina not the stamina %. If you try fighting opponents with 500 base stamina and you only have 100 you are going to find they survive longer, aim arrows better, dodge more, hit you harder, attack faster, feint you out more, get to use more finishing moves, stagger you more and get staggered less, attack block and bash more compared to your own attacks unless you become very good at finishing the combat very quickly before you become exhausted per the mod&#39;s endurance feature. Which is exactly how it is suppose to work. And if you turn the ENDURANCE feature in this mod off or too far down you need to reconsider your question.\r<br />\r<br />\r<br />\r<br />Q- Why would crouching with a bow make it a more accurate shot?\r<br />\r<br />A- In real life combat archery (unlike shooting at paper targets) going to one knee allows you more time to take aim as you are a smaller target to physically hit yourself. You will feel less panic and this helps to improve your shot. Practically speaking this is really only a small benefit and it is for the most part physiological with little mechanical advantage to the accuracy.\r<br />\r<br />However Skyrim (like Oblivion) also has this hard coded and cannot be changed. The NPC think that crouching improves accuracy and will sometimes stop moving to crouch if they are missing their shots&#33; And it is in fact a fair game mechanic (less mobility for more accuracy).\r<br />\r<br />\r<br />\r<br />\r<br />Q- Why do the wolves knock me to the ground all the time?\r<br />\r<br />A- The wolves in this game are almost the same size as humans (the mod checks their actual 3d model dimensions). Most players do not realize this because they are prone to the ground not standing on their hind legs. On top of that they are of a type of creature that has a special take down to the ground attack (see lions attacking a wildebeest bull that is twice their size/weight). However you will &#34;grow out of this&#34; both by learning not to let them get behind you, killing them fast before they can pounce on you and by getting stronger (raising your health).\r<br />\r<br />\r<br />\r<br />Q- Why are the actors dying in only a few shots?\r<br />\r<br />A- As of REV 10 my mod removes a vanilla perk that some actors (mostly Guards) got that could one shot kill. That Perk was not used in a way that worked well with my mod. However in my mod damage depends a LOT on stamina, location hit and the locational armor worn. So yes under the right conditions a few shots can kill or even just one shot. Lower the damage settings in the mod INI if you do not like this level of realism (see the read me files). Adjusting the game difficulty level has NO effect on my script damage only the vanilla damage.\r<br />\r<br />\r<br />\r<br />Q- Why am I getting pop up messages about conflicting mods? Is there any way to disable these messages?\r<br />\r<br />A- No. The message is triggered when it finds that the record that is needed has been changed from what is needed. If the message is popping up then you are overwriting the records my mods needs to work as intended. Even if you remove a mod some of the changes may stay in your game depending on how the mod made the changes in the first place. The TES games started as a combat game and latter had other systems added to that to become the TES games we see today. At this games roots the combat systems are a massive part of this game. As such there are numerous game conditions that must be working as expected and not changed. So my mod must be dead last no exceptions. Do not &#34;clean&#34; the mod. It has intentional ITMS and the mod is precleaned for unintentional ITMs before it is uploaded.\r<br />\r<br /> \r<br /> \r<br />\r<br />Q-Why do attacks sometimes stagger but cause no damage and sometimes do a lot of damage with no stagger? \r<br />\r<br /> \r<br />A-  &#34;Damage&#34; and the Knock force (&#34;stagger&#34;) is not the same thing. \r<br /> \r<br />Normal Melee weapons can inflict 2 kinds of damage: \r<br /> \r<br />Non-penetrating Trauma (derived mostly from the Momentum of the weapon) including:\r<br />Abrasions (skin layer damage)\r<br />Lacerations (shallow tears)\r<br />Contusions (damage to the flesh under skin)\r<br />Concussions (damage to the underlying organs with no significant external wound)\r<br /> \r<br /> \r<br />Penetrating Deformation (derived mostly from the weapon&#39;s Kinetic Energy) that reach down to the underlying tissue and organs:\r<br />Punctures\r<br />Stabs\r<br />Cuts\r<br />Lacerations (deep tears)\r<br /> \r<br /> \r<br />Trauma damage is more often associated with &#34;stagger&#34; and Knock Force. However DAMAGE in general is not necessarily going to transfer momentum to the opponent.\r<br /> \r<br />For example a mace could catch a section of your stomach and tear it open spilling your guts thus killing you without pushing your even a few inches.\r<br />Or that same mace could impact your head knocking you to the ground dead from the Concussion.\r<br /> \r<br />I struggled for a long time trying to craft the damage and knock back calculations to work properly. Something important but elusive was always missing in the final results. It all came together so clearly and so easy the day I finally realized that the two calculations were actuality two separate things.\r<br />\r<br /> \r<br /> \r<br /> \r<br /> \r<br />\r<br />Q-Why is this 20 unit mass 1h sword moving slower than the 2h 30 unit mass great sword and the 25 unit mass mace?\r<br /> \r<br />\r<br />A- All weapons speeds even from other mods are now modified by balance, length and weight. Total weight is not an omni important factor. Balance and length are just as important. Using two hands on a weapon can change the &#34;effective&#34; balance of a weapon by allowing the attacker more leverage on the grip side of the weapon. So 2h weapons can move faster than if you handle the same weapon with one hand.\r<br /> \r<br />Longer weapons will be a little slower than shorter weapons. So a 3 foot long 1h sword that weighs 3 pounds will swing slightly faster than a 3.5 foot long 1h sword that weighs 2.5 pounds.\r<br />\r<br />\r<br /> \r<br />\r<br /> \r<br />Q-  Can you use the &#34;weight&#34; of the actors as one of the factors for strength?\r<br /> \r<br />A- No.  &#34;Weight&#34; is a factor of how wide the mesh for the actor is scaled. It has nothing to do with the mass of the actor. I wish this setting had been given the name &#34;width&#34; not &#34;weight&#34;. You could have a 100 &#34;weight&#34; chicken and a 50 &#34;weight&#34; Nord but that dose not mean the chicken is stronger than the Nord, it just means it is a fat chicken. And even if I used a relativistic factor such as :\r<br /> \r<br />&#34;TARGET NORD ACTOR WEIGHT / NORMAL NORD WEIGHT&#34;  \r<br /> \r<br />this would make old tubby gals stronger than young athletic guys. \r<br /> \r<br />\r<br /> \r<br />Q-  Why do I move to the side slightly when I draw an arrow?\r<br /> \r<br />A- This is to prevent the game exploit with the cross hair for aiming the bow. With this feature each time you draw the bow or crossbow you must aim at your target again.  Otherwise (without this slight movement) all you would need to do is aim once and keep pressing your reload and fire button to hit the same exact spot over and over. In Oblivion there was a script extender function to move the mouse via scripting. There is none for SKSE. I have already requested this long ago and it would not help for me to keep requesting it myself. But it might help for you to add your voice requesting this on the SKSE thread to show there is a desire and need for it.\r<br /> \r<br /> \r<br /> \r<br />Q- Why was this mod not available on TesNexus for so long?\r<br /> \r<br />A- This mod is very important to me and I update it up to twice a week so I need the hosting site to keep up with me. I use to only upload to TesNexus exclusively because they were very fast to help me with issues and I liked their style. I am glad to see I my instincts about them were good as they quickly became the leviathan they are today&#33; But theses days they have become too big and have too much traffic to give me the fast and personal attention they use to afford when they were smaller. I do not mod for &#34;fame&#34; so the fact their site is the biggest and can get the most traffic is not what sways my choice. But I was convinced by some of my users to give this site another try because of the changes they have made and the new tools for mod authors for managing the mod&#39;s presence on TesNexus.\r<br /> \r<br /> \r<br />\r<br /> \r<br /> \r<br /> \r<br /> \r<br /> \r<br /> \r<br /> \r<br />\r<br />Q- Why?\r<br />A- Because&#33;",
  "categoryId": "77",
  "version": "47.9",
  "author": "Duke Patrick",
  "createdUnix": "1472436615",
  "updatedUnix": "1499822721",
  "containsAdultContent": false,
  "uploadedBy": "sca",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000249154",
      "name": "Duke Patricks Archery and Heavy Weapons Combat",
      "version": "47.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17015",
      "fileName": "Duke Patricks Archery and Heavy Weapons Combat-78303-47-9.7z",
      "uploadedUnix": "1499822721",
      "modVersion": "47.9",
      "virusScanUrl": "https://www.virustotal.com/file/7e3c3b42eb744aa9b0f5b9ee4034b7bfe6cb9bd93cd24ad81ea185dafcd23223/analysis/1499822941/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Duke%20Patricks%20Archery%20and%20Heavy%20Weapons%20Combat-78303-47-9.7z?fid=1000249154&ttl=1535866994&ri=8192&rs=8192&setec=398d6090c3ab2a35aa2b83165e36213b"
    }
  ]
}