{
  "modId": 78410.0,
  "modName": "Blacksmith Forge Water Trough Fix",
  "summary": "Real water in the forge trough&#33; Requires ENB.",
  "descriptionHtml": "Simply changes the forge trough mesh to use a water property instead of a texture property, like the horse trough. This should be compatible with just about anything as long as it doesn&#39;t alter the forge mesh.\r<br />\r<br />Requires:\r<br />[url=http://enbdev.com/download_mod_tesskyrim.html]ENB for TESV[/url]\r<br />ENB preset (any should be fine)\r<br />[url=http://www.nexusmods.com/skyrim/mods/58061/?]ENB Water on Horse Trough and Blacksmith Forge by Skysan4298[/url]\r<br />\r<br />[b]FAQ[/b]\r<br />Q: Can I use mods that add/move/remove blacksmith forges without problems?\r<br />A: Absolutely&#33; I altered the mesh rather than using an overlaying water so you can add/move/remove as many forges as you want and this mod will still work.\r<br />\r<br />Q: Can I use texture replacers for the blacksmith forges without problems?\r<br />A: Of course. By &#34;mesh alteration&#34; I really mean just going into nifskope and copy/pasting properties from the horse trough. The mesh itself (vertices) aren&#39;t touched at all other than removing vertex colors. If you want to keep the vertex colors, use the Blacksmith Forge Water Darker Version.\r<br />\r<br />Q: Doesn&#39;t Skysan4298&#39;s mod already do this?\r<br />A: Nope&#33; They made a plugin that lets ENB recognize when a water property is being used by mods like this one or [url=http://www.nexusmods.com/skyrim/mods/18818]Blacksmithforge water fix by hexaae/rolloLG[/url].\r<br />\r<br />Q: Do I really need ENB to use this mod?\r<br />A: Yes, otherwise the water won&#39;t display properly. [url=http://enbdev.com/download_mod_tesskyrim.html]Seriously just go download ENB why haven&#39;t you downloaded it yet.[/url]\r<br />\r<br />Blacksmith Forge Water Trough Fix is a pretty small mod, just a mesh alteration, so there isn&#39;t a very high chance of bugs or conflicts. However if you find any issues, please let me know and I will try and fix it&#33;\r<br />\r<br />This is my first public mod, I hope you like it&#33;",
  "categoryId": "62",
  "version": "1.0",
  "author": "yiffening",
  "createdUnix": "1472788391",
  "updatedUnix": "1472788391",
  "containsAdultContent": false,
  "uploadedBy": "yiffening",
  "primaryFile": null,
  "files": []
}