{
  "modId": 78538.0,
  "modName": "Sword Art Online Font (No copyright infringement intended)",
  "summary": "Hello everyone have you ever played Skyrim and thought this would the perfect game for Sword Art Online Mods. Well so did I unfortunately There are not very many hopefully this inspires people to make more. Introducing Sword Art Online Font replacement. I did not make this only Font I only set up a font replacement mod. (this is also my first mod)",
  "descriptionHtml": "Hello everyone have you ever played Skyrim and thought this would the perfect game for Sword Art Online Mods. Well so did I unfortunately There are not very many hopefully this inspires people to make more. Introducing Sword Art Online Font replacement. I did not make this only Font I only set up a font replacement mod. (this is also my first mod ever made) of course since I dont own this it doesn&#39;t matter what you do with it but prefereably dont reupload it onto nexus and say that you compiled it together. I do hope that someone can find a way to implement the sword art online user interface though I doubt it. If someone does find it please link me to it.  credits go to: darkblackswords for his/her font at http://darkblackswords.deviantart.com/art/Sword-Art-Online-Font-Download-426603647  and Elite Khajiit for his tutorial https://www.youtube.com/watch?v=pdc5NmaA_J0                                                          I did not change every font in the game but i will release seperate versions if you have any specific requests to which default fonts you would like changed then leave a comment.(post)",
  "categoryId": "42",
  "version": "1.0",
  "author": "Darkknife",
  "createdUnix": "1473185907",
  "updatedUnix": "1473185903",
  "containsAdultContent": false,
  "uploadedBy": "Darkknife0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000219844",
      "name": "Sword Art Online Font",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Sword Art Online Font-78538-1-0.zip",
      "uploadedUnix": "1473185903",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6f4a8a3756b6eb044dd506d0f4abb22c6e8b74d4c165eb7e51e10ec35a33f6ff/analysis/1473185943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sword%20Art%20Online%20Font-78538-1-0.zip?fid=1000219844&ttl=1535867233&ri=8192&rs=8192&setec=0b584ab4375d60eeed0dd9c749a3942d"
    }
  ]
}