{
  "modId": 78611.0,
  "modName": "Concise Skyrim Modding Guide 2018",
  "summary": "How to mod Skyrim (non-Special Edition). A quick step-by-step guide to performance-friendly modding in 2018. As simple and clear as possible. Includes a well curated mod list.",
  "descriptionHtml": "[font=Trebuchet MS][size=2]Note: this guide is for the original Skyrim, not the Special Edition.[/size][/font][font=Trebuchet MS]\n<br />\n<br />[color=#3c78d8][size=6][u][b]Introduction[/b][/u][/size][/color]\n<br />[size=2]This is a performance-friendly step-by-step guide to modding, based on over 1000 hours of researching and playing mods.\n<br />\n<br />I wrote this because (in my opinion) none of the other guides are clear or concise enough for the novice modder. Most other guides are only suitable for people with unlimited free time and very powerful PCs. Many are bloated with some poor mod recommendations (outdated, unbalanced, not lore friendly, script-hogs, and too much adult-only content etc). Some guides (like S.T.E.P. guide) are very comprehensive, but unnecessarily complex for most modders.\n<br />\n<br />So I felt the need to write a better, simple guide for novice modders (including those who don't have very powerful PCs), or those who just want to save time.\n<br />\n<br />To keep this guide simple and performance friendly, I will only cover the essentials, so no ENBs and no bashed patches etc. The mods listed in this guide improve the look and feel of Skyrim without the use of either. And you can always try ENBs and mods that need bashed patches later.\n<br />\n<br />[size=3][u][b]Prerequisites:[/b][/u][/size]\n<br />[/size][/font][list]\n<br />[*][font=Trebuchet MS][size=2] Skyrim and all DLC (or legendary edition) on Steam.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] Your PC should be able to run vanilla Skyrim at max settings smoothly.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] Windows 7 or higher with UAC disabled (if you keep UAC on for security reasons, you must install skyrim to a directory other than \"program files\")[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] nexusmods.com free account, for downloading mods.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] large amount of free time and perseverance.[/size][/font]\n<br />[/list][font=Trebuchet MS][size=2]\n<br />[color=#b6b6b6]a note about the screenshots:\n<br /> I know these visuals are not that impressive, but they are still significantly better than vanilla, with nearly no performance loss.[color=#b6b6b6]\n<br />[/color]Also note, I am not using a landscape texture pack in the screenshots. What you see is just the official HD DLC.[/color][/size][/font][font=Trebuchet MS]\n<br />\n<br />[color=#3c78d8][size=6][u][b]Preparing Skyrim for Mods[/b][/u][/size][/color]\n<br />[size=2]Before installing mods you must follow these steps:\n<br />\n<br />[/size][/font][list]\n<br />[*][font=Trebuchet MS][size=2] Download and install Skyrim Legendary Edition[/size][/font]\n<br />[*][font=Trebuchet MS][size=2](optional) delete the intro logo video in[/size][/font]\n<br />[font=Trebuchet MS][size=2]            C:&#92;Program Files (x86)&#92;Steam&#92;steamapps&#92;common&#92;Skyrim&#92;Data&#92;Video\n<br />[/size][/font][*][font=Trebuchet MS][size=2] Run Skyrim once - select \"Play\" in the launcher and exit from the main menu. (this is so the engine generates ini files).[/size][/font]\n<br />[font=Trebuchet MS][size=2]        (if the launcher did not auto select \"ultra\" graphics settings, your PC may not be powerful enough for propper Skyrim modding)\n<br />[/size][/font][*][font=Trebuchet MS][size=2] On the steam front page, do a search for \"SKSE\" (Skyrim Script Extender), and install it.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2]now enable the SKSE memory patch:[/size][/font]\n<br />[font=Trebuchet MS][size=2]            go to steamapps/common/Skyrim/Data, and create folder \"SKSE\".\n<br />            in new skse folder create \"skse.ini\" file.\n<br />            open \"skse.ini\" with any text editor and add the following lines:\n<br />\n<br />                    [General]\n<br />                    EnableDiagnostics=1\n<br />                    ClearInvalidRegistrations=1\n<br />\n<br />                    [Memory]\n<br />                    DefaultHeapInitialAllocMB=768\n<br />                    ScrapHeapSizeMB=256\n<br />\n<br />        save and close\n<br />\n<br />[/size][/font][*][font=Trebuchet MS][size=2] create a folder where modding resources will be installed (outside of skyrim's directory but on same drive). An example: \"C:&#92;Skyrim Mod\"[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] download and unzip [url=http://www.nexusmods.com/skyrim/mods/25859/?]Tes5Edit[/url] to your modding folder.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2]clean \"dirty edits\" from Bethesda's master files (this makes skyrim more reliable):[/size][/font]\n<br />[font=Trebuchet MS][size=2]                  open tes5edit, double click on update.esm, in left pane right-click update.esm and select [Apply Filter For Cleaning]\n<br />                  wait till done, then right-click update.esm and select [Remove \"Identical to Master\" records], confirming \"yes\" when prompted\n<br />                  wait till done, then right-click update.esm and select [Undelete and Disable References]\n<br />                  wait till done, close tes5edit, at prompt select Update.esm and check backup, then press OK.\n<br />            do the same for Dawnguard.esm, and then do it AGAIN for Dawngurad.esm,\n<br />            do the same for Hearthfire.esm, and Dragonborn.esm (no need to do twice for these)\n<br />            (make sure the new cleaned (smaller filesize) esm files are in Skyrim&#92;Data, the originals are in Data&#92;TES5Edit Backups)\n<br />     You may want to backup these \"cleaned\" esm files so you don't need to do it again in future.\n<br />[/size][/font][*][font=Trebuchet MS][size=2] Note: before installing \"Mod Organizer\", I recommend you edit graphics settings in the default launcher to your liking, as once MO is installed, you will have to edit graphics setting inside MO using a much more complicated interface (tools menu &gt; 'configurator'). Any changes made in the default launcher will not work when using MO.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] install [url=http://www.nexusmods.com/skyrim/mods/1334/?]MO - \"Mod Organizer\"[/url] in your modding folder. Also note: MO uses a virtual file directory system, so any utilities you may end up using must be run from within MO as shown with LOOT below. Also any ini file tweaks must be done inside MO as shown further down.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] open MO, press the spanner \"configure\" button, select workaround tab and click \"back date BSAs\"[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] download and unzip [url=https://loot.github.io/]LOOT[/url] - \"Load Order Optimisation Tool\" to your modding folder.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] To integrate LOOT with MO, press the \"modify executables\" button in MO (looks like 2 cog-wheels). In the blank title field type \"LOOT\", in the binary field enter the full path to the LOOT executable. example: \"C:&#92;Skyrim Mod&#92;LOOT.v0.8.1&#92;LOOT.exe\". Now press the \"Add\" button, then close that window.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] In MO, select \"LOOT\" from the drop down menu next to \"RUN\", and press \"RUN\". In LOOT press \"sort plugins\" (the button looks like a cellphone reception coverage icon). Observe that no warnings show asking you to clean the master files using tes5edit, as you have already done that. Close LOOT.[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] From now on, you will always start skyrim from within MO by selecting \"SKSE\" , and pressing \"Run\". Note: if you do not start skyrim this way, any mods installed through MO will not work! [/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) in MO, press \"tools\" button (looks like puzzle pieces) and select \"ini editor\". Edit/add the lines shown below. All of these are optional tweaks, but highly recommended. (be careful, any careless mistake or typo can cause severe problems)[/size][/font]\n<br />[font=Trebuchet MS][size=2]     Note: the skyrim ini files in your \"My docs\" don't work with MO. Only edit these ini files in MO.[/size][/font][/list][font=Trebuchet MS]---------------------------------------------------------------------------------------------------------------[/font]\n<br />[font=Trebuchet MS][size=2][b][color=#3c78d8]SKYRIM.INI:[/color][/b]\n<br />[General]\n<br />fFlickeringLightDistance=8192                 (fixes indoor light pop-in)\n<br />[Display]\n<br />fDecalLifetime=256.000                          (makes blood splat on ground stay longer)\n<br />iPresentInterval=0                                  (OPTIONAL! - this disables v-sync, which causes screan tear but lowers input lag. Limit fps to 60 or it bugs out)\n<br />fDefaultWorldFOV=76                              (good compromise for wider view, higher values can cause more problems)            \n<br />fDefault1stPersonFOV=76\n<br />fSunShadowUpdateTime=0.000                (less irritating updating of shadows as sun moves across sky)\n<br />fSunUpdateThreshold=0.200\n<br />[Combat]\n<br />f1PArrowTiltUpAngle=0.7                         (reduces how much an arrow overshoots where you aim)\n<br />f3PArrowTiltUpAngle=1.5\n<br />f1PBoltTiltUpAngle=0.7\n<br />f3PBoltTiltUpAngle=1.5\n<br />[VATS]\n<br />bVATSDisable = 1                                     (disables slow-mo kill cam so your controls don't lock up, but kill animations still play)\n<br />[Weather]\n<br />fSunBaseSize=150                                   (reduces how much the sun incorrectly penetrates through solid objects)\n<br />fSunGlareSize=150                                  (if using ELFX weathers, this reduces 1st person view sun glare if it was too much)\n<br />\n<br />[b][color=#3c78d8]SKYRIMPREFS.INI:[/color][/b][u]\n<br />[/u][General]\n<br />fDefaultFOV=76\n<br />[Display]\n<br />bDrawLandShadows=1        \n<br />fMeshLODLevel1FadeTreeDistance=6144   (fixes irritating transition from low detail tree to high detail tree)\n<br />fMeshLODLevel2FadeTreeDistance=4096\n<br />fTreesMidLODSwitchDist=8192\n<br />iMaxSkinDecalsPerFrame=100\n<br />iMaxDecalsPerFrame=250                        (allows more blood splat on ground at same time)\n<br />iShadowMapResolution=4096                   (OPTIONAL: lowering this to 2048 fixes fps slowdowns in some interiors, if you have that problem)\n<br />fShadowBiasScale=0.2500                       (OPTIONAL: if \"iShadowMapResolution=2048\", use \"0.5\". this seems to minimise moire patterns on terrain)\n<br />[Controls]\n<br />bMouseAcceleration=0                            (if you like tight responsive mouse control like in CounterStrike)\n<br />[Trees]\n<br />uiMaxSkinnedTreesToRender=200            (fixes irritating transition from low detail tree to high detail tree)\n<br />[Launcher]\n<br />bEnableFileSelection=1\n<br />[Water]\n<br />iWaterReflectHeight=1024                      (improves reflections in water)\n<br />iWaterReflectWidth=1024[/size][/font][font=Trebuchet MS]\n<br />[font=Trebuchet MS]---------------------------------------------------------------------------------------------------------------[/font]\n<br />\n<br />[color=#3c78d8][size=6][u][b]Installing Mods General Info[/b][/u][/size][/color]\n<br />[size=2]Remember to launch Skyrim from within MO by selecting \"SKSE\" and pressing \"RUN\".\n<br />(optional) You should first play vanilla skyrim till you exit the tutorial dungeon (Helgen), and then make a save. Use this save when testing new mods.\n<br />Most mods will be obtained from the nexusmods.com website. Before installing a mod, it is recommended you read it's description page.\n<br />\n<br />[u][b]The basic mod download and install process:[/b][/u]\n<br />[list]\n<br />[*] On a mod page, go to the download tab and click \"download manually\" for the file you wish to download. There is no need to \"extract\" or \"unzip\" the files.\n<br />[*] In MO, press the \"Install a new mod from an archive\" button (first button top left of window).\n<br />[*] Select the file you downloaded and press \"open\", then \"OK\".\n<br />[*] Once all files have been copied over, find the mod in the left window of MO and click the check mark box to activate the mod.\n<br />[/list]\n<br />[u][b]Load order and conflict theory[/b][/u]\n<br />Skyrim's game engine loads mods (plugins and other files) one by one in an order you control. If two mods edit the same thing, the mod loaded later will overwrite the change made by the other mod, thus taking priority. This is called a \"mod conflict\". As you install more mods, conflicts become inevitable. Most conflicts are harmless or only cause small problems, but some can cause serious problems, so you should be aware of them. Many problematic conflicts can be made harmless or \"resolved\" by changing the load order.\n<br />To avoid conflicts, try not to install mods that seem to do the same or very similar things, and always check the mod's description page on nexusmods.com for any \"conflict\", \"compatibility\" or \"load order\" information.\n<br />\n<br />[u][b]Automatic load order sorting:[/b][/u]\n<br />After installing new mods, click the \"sort\" button in MO (above the right window). Alternatively you can launch LOOT (from within MO) and run the \"sort\" function in LOOT which is more up to date. Both methods will sort most mods correctly and ensure most conflicts are not problematic.\n<br />\n<br />[u][b]Manual load order sorting:[/b][/u]\n<br />Sometimes the auto-sort function gets a few items wrong, so you may need to make adjustments manually afterwards.\n<br />In MO, the right window controls the order mod plugins are loaded. The left window controls the order other mod files are loaded. Mods at the top of a list are loaded first, those at the bottom last. Mods that only have a plugin file (.esp file) are sorted by the right side window. But a texture mod may not have a plugin, so it can only be sorted using the left window. Mods that have both plugins and other files are primarily sorted by the right window, but also the left sometimes. In MO you can see if a mod conflicts in the left window if it has a small yellow lightening bolt icon next to it. If you then select one of these mods, some other mods in that list light up as red or green. Red overwrites the selected mod, green is overwriten by the selected mod. (Note: This shows file overwrite conflicts but not other forms of conflicts). The official DLC (like dawnguard and dragonborn) tends to get overwriten, this is not a problem. Other overwrite conflicts are usually not a problem, but you should be aware.\n<br />\n<br />Manual sorting is done by dragging and dropping mods up or down.\n<br />\n<br />Sometimes MO makes a left window sorting suggestion. It is usually best to follow it.\n<br />\n<br />If this all sounds rather complicated, you're not alone. This is a fact of life for the Skyrim modder.\n<br />\n<br />If you install the suggested mods listed later in this guide, I have listed some manual load order adjustments for you at the end, so you do not need to figure them out yourself.\n<br />\n<br />[u][b]Other notes:[/b][/u]\n<br />If subscribing to steam workshop mods, first open the vanilla game launcher, wait for messages at the bottom to confirm mods are up to date, then close the launcher, and run MO to sort/activate if needed. Workshop mods in MO will show up as \"Unmanaged:\" and \"Non-MO\". This is fine, they will still usually work.\n<br />\n<br />note: some mods need to be repacked before installing. If this happens, \"unzip\" the downloaded mod and remove any duplicate esp files from the download. Then put everything in a \"data\" folder and re-zip that. Install in MO from the new ziped file. (if this happens and you are unsure, google it)\n<br />\n<br />In MO, some warning messages can be ignored, but if the large warning triangle in the top right corner lights up, pay attention!\n<br />    note: after much activity, sometimes MO shows out of date warnings that can be resolved simply by quitting and restarting MO.\n<br />\n<br />When in game, many mods have a MCM (mod configuration menu) that can be accessed from the game's system menu after loading a save.\n<br />\n<br />Still here? You are now ready to start installing mods.[/size]\n<br />\n<br />\n<br />[size=6][u][color=#3c78d8][b]Suggested Mod List[/b][/color][/u][/size]\n<br />[size=2]I have used all these mods together for hundreds of hours of gameplay, without any major problems.\n<br />They were carefully selected for best performance, stability, production quality, lore friendliness, and gameplay balance.\n<br />(no script hogs, no sex, no OP magic/weapons, no bling, and no hardcore mods etc)\n<br />This mod list is not an \"ultimate mod compilation\" for the elite few with beast PCs, but rather a strong general foundation for the average modder.\n<br />All these mods together total more than [b]15GB[/b] of data.\n<br />Mods are sorted below in an approximate install order. Start at the top.\n<br />\n<br />[u][b]To install first:[/b][/u]\n<br />[/size][/font][list]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/71214/?]Unofficial Skyrim Legendary Edition Patch[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/31255/?]unofficial high resolution patch[/url] (if you use the high resolution dlc)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/72725/?]Crash fixes[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/76747/?]Bug fixes[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/85443/?]Load game CTD fix[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/7901/?]No menu and loading smoke[/url] (even if you don't use an ENB, this speeds up loading times)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=https://steamcommunity.com/sharedfiles/filedetails/?id=8022]Detailed Cities[/url] (this is a basic, highly compatible, lightweight city overhaul)[/size][/font]\n<br />[/list][font=Trebuchet MS][size=2]\n<br />[u][b]Quest/New content mods (to install middle):\n<br />[/b][/u][b]Note: avoid installing all these quest mods at game start, as many are not suitable for low level characters, and it is harder to troubleshoot.\n<br />It is better to only install a few, or one by one when you intend to play through them.[/b][/size][/font][list]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/47327/?]Cutting room floor[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/8429/?]Interesting NPCs[/url] (huge amount of excellent new quest and character content)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/40960/?]INIGO[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/84946/?]Beyond Skyrim: Bruma[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/77809/?]Clockwork Castle[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/70219/?]The Forgotten City[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/35841/?]Helgen reborn[/url] (keep esp file disabled till you finish game intro sequence)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/37994/?]Falskaar[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/48467/?]Beyond Reach[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/36764/?]The Cheese of Ages[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=https://steamcommunity.com/sharedfiles/filedetails/?id=95716389]Sorcery[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/79826/?]Voyage to the Dreamborne Isles[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/30279/?]The Hanging Gardens[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/64401/?]Volundr[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/68605/?]Temple of Kruziik[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/40607/?]Undeath[/url] (needs community patches)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/71021/?]MediEvil - Hero of Gallowmere[/url] (has an alternate game start function, so is not compatible with other alternate start mods)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) Wyrmstooth (no official download link available, but you may find one with a google search. The v1.17 file should be ~189MB)[/size][/font]\n<br />[/list][font=Trebuchet MS][size=2]\n<br />[u][b]Other mods to install middle:[/b][/u][/size][/font][list]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/57859/?]enhanced camera[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/28170/?]Better messagebox controls[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/27371/?]Better dialogue controls[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/3222/?]immersive hud iHUD[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/51956]moreHUD[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/59171/?]AH Hotkeys[/url] (also get \"controlmap\" on it's download page - needed for spell autocast function)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/87635/]To Your Face - Sensible NPC commenting (SKSE)[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/14884/?]Fuz ro doh[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/4929/?]A quality world map and solstheim map[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/8655/?]static mesh improvement mod[/url] (I suggest you select lite performance option if your PC is not very powerful)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/48643/?]Lorkhans Vision - Night Sky V2[/url] (low saturation version recommended, even if not using ENBs)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/39870/?]Leanwolf's better shaped weapons[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/60/?]Enhanced Blood Textures[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/76529/?]Wildcat - combat of skyrim[/url] or [url=http://www.nexusmods.com/skyrim/mods/56147/?]Combat Evolved[/url] (this will make combat harder)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=https://www.nexusmods.com/skyrim/mods/61922]Realistic movement speed reduction[/url]﻿ (slows down how fast mages can retreat while firing at you)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/80076/?]Realistic melee range[/url] (stops enemies from hitting you when they should not, by matching visual weapon reach with actual reach)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/67017/?]combat behaviour improved[/url] (this fixes attack animations so you don't take damage before the enemy swings at you)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional!) [url=http://www.nexusmods.com/skyrim/mods/31593/?]Mitigate HDR eye adaptation[/url] (incompatible with all lighting/weather mods, like ELFX, unless you use the Tes5Edit script version to merge it with your lighting mods)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/16531/?]Better Stealth AI for Followers[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/12977/?]Immersive Patrols[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/64798/?]Campfire[/url] (you need this if you use a survival mod like \"Hypothermia\" or \"Frostfall\")[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/6745/?]Hypothermia[/url], and [url=http://www.nexusmods.com/skyrim/mods/67467/?]Hypothermia Plus[/url] (compatible with Campfire. more realistic, reliable, and customisable than Frostfall. be sure to enable the camera shake effects)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/68221/?]Complete Fast Travel Overhaul[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/45894/?]Death Alternative - Your Money Or Your Life[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=https://www.nexusmods.com/skyrim/mods/76130/?]Leave Combat[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/17491/?]D13 Faster get up stand up animation[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/601/?]Realistic Ragdolls and Force[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/40953/?]All Geared Up[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/51473/?]iNeed - Food, Water and Sleep[/url] (you can change the game timescale in it's MCM menu)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/63900/?]Paarthurnax Bypass[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/23600/?]Player Headtracking[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=https://steamcommunity.com/sharedfiles/filedetails/?id=15301]no Auto-Aim[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/33256/?]Richer merchants - With perks support[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/1175/?]skyrim community uncapper[/url] (for adjusting how fast you level up various skills)[/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/12933/?]extensible follower framework[/url] (and the \"EFF Patch\" on the Interesting NPCs mod page, note: mod followers can only be dismissed with the command wheel)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/64067/?]Immersive Horses[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/38151/?]Timing is Everything[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2](optional) [url=https://www.nexusmods.com/skyrim/mods/3829]Deadly Dragons[/url]﻿ + [url=https://www.nexusmods.com/skyrim/mods/77547]Deadly Dragons Script Patch[/url]﻿[/size][/font]\n<br />[*][font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/90041]Display Enemy Level[/url]﻿[/size][/font]\n<br />[*][font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/84394]Protect your people[/url]﻿[/size][/font]\n<br />[/list]\n<br />[font=Trebuchet MS][size=2][u][b]To install later:[/b][/u][/size][/font][list]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/27043/?]Enhanced Lights and FX[/url] (I recommend all the optional modules including ELFX Enhancer and ELFX Weathers)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/26359/?]The Choice is Yours[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/2674/?]Improved NPC Clothing[/url] (this overwrites some SMIM files)[/size][/font]\n<br />[/list][font=Trebuchet MS][size=2]\n<br />[u][b]To install even later:[/b][/u][/size][/font][list]\n<br />[*][font=Trebuchet MS][size=2] (optional) [url=http://www.nexusmods.com/skyrim/mods/72428/?]Another sorting mod-2017[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/65013/?]Immersive Citizens[/url][/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/41076/?]Realistic Waters Two[/url] (delete meshes/effects folder in mod if waterfall animations feel too fast)[/size][/font]\n<br />[/list][font=Trebuchet MS][size=2]\n<br />[u][b]To install last:[/b][/u][/size][/font][list]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/74355/?]Realistic AI Detection (better sneaking)[/url] (if using ELFX Enhancer+Weathers, get \"high/high\" version, otherwise get the \"lite\" version)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/43773/?]Audio Overhaul for Skyrim 2[/url][/size][/font]\n<br />[*][font=Trebuchet MS][size=2][url=https://www.nexusmods.com/skyrim/mods/24805]Better animal footsteps[/url]﻿ (load after audio overhaul)[/size][/font]\n<br />[*] [font=Trebuchet MS][size=2][url=http://www.nexusmods.com/skyrim/mods/32695/?]even better quest objectives[/url][/size][/font]\n<br />[/list][font=Trebuchet MS][size=2]\n<br />\n<br />[size=3][u][b]Load order tweaking:[/b][/u][/size]\n<br />Now run LOOT to sort your mods. Then make the following manual sorting tweaks. These are based on mod author instructions and my own testing.\n<br />\n<br />ELFX (main esp) -                before 3DNPC\n<br />3DNPC (interesting npc) -    load before immersive citizens\n<br />Immersive citizens -           after interesting npcs\n<br />ELFX enhancer -                  load after immersive citizens\n<br />realistic ai detection -         as close to bottom of load order as possible\n<br />\n<br />\n<br />[size=3][u][b]Done![/b][/u][/size]\n<br />You can now start playing (or install more mods).\n<br />Go find Rumarin and Inigo (two of the best lore-friendly custom followers with great unique dialogue) and start adventuring![/size]\n<br />[/font]",
  "categoryId": "39",
  "version": "3.01",
  "author": "Olivier Doorenbos",
  "createdUnix": "1473448763",
  "updatedUnix": "1523270801",
  "containsAdultContent": false,
  "uploadedBy": "OlivierDoorenbos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263100",
      "name": "Concise Skyrim Modding Guide 2017 v2.92",
      "version": "2.92",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "8",
      "fileName": "Concise Skyrim Modding Guide 2017 v2.92-78611-2-92.zip",
      "uploadedUnix": "1514763170",
      "modVersion": "2.92",
      "virusScanUrl": "https://www.virustotal.com/file/657d6ded70ad1de9043116795d5b392b82a15fcecdcb446d7d80a60eadf9cc58/analysis/1514761082/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Concise%20Skyrim%20Modding%20Guide%202017%20v2.92-78611-2-92.zip?fid=1000263100&ttl=1535867314&ri=8192&rs=8192&setec=07520c84edf61c0defb051586087dc1a"
    },
    {
      "fileId": "1000270350",
      "name": "Concise Skyrim Modding Guide 2018",
      "version": "3.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "8",
      "fileName": "Concise Skyrim Modding Guide 2018-78611-3-0.zip",
      "uploadedUnix": "1523269999",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/b78c1b6bc115c2918be966e92b1382161cfa02d97ceba3fbd170e99358a51000/analysis/1523270103/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Concise%20Skyrim%20Modding%20Guide%202018-78611-3-0.zip?fid=1000270350&ttl=1535867314&ri=8192&rs=8192&setec=0e70ae74ce0becdf2f6f50d22ccdd943"
    },
    {
      "fileId": "1000270351",
      "name": "Concise Skyrim Modding Guide 2018",
      "version": "3.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Concise Skyrim Modding Guide 2018-78611-3-01.zip",
      "uploadedUnix": "1523270801",
      "modVersion": "3.01",
      "virusScanUrl": "https://www.virustotal.com/file/d2e05bed60549284514b22aff4a022fc75c39d52d6aca847eb38c6ae1fabd60d/analysis/1523270882/",
      "changelogHtml": " Updated with some mods added to the list (some old mods and some new mods that were released recently)\n<br />added \"display enemy level\" to guide\n<br />added \"protect your people\" to guide\n<br />added \"deadly dragons\" + \"script patch\" to guide\n<br />added \"realistic movement speed reduction\" to guide\n<br />removed \"mortal enemies\" (while its a great concept, execution did not feel seamless enough, I may re-add it later if it gets improved)\n<br />added \"better animal footsteps\" to guide\n<br />minor wording changes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Concise%20Skyrim%20Modding%20Guide%202018-78611-3-01.zip?fid=1000270351&ttl=1535867315&ri=8192&rs=8192&setec=67d4b85d2a3b0002cff22957ee7657b9"
    }
  ]
}