{
  "modId": 78660.0,
  "modName": "Text to speech utility - numerous voices including child voices",
  "summary": "This is a third party text to speech utility which can be used by modders to create new voices for Skyrim mods without needing voice actors.  See description for information on how to use utility.",
  "descriptionHtml": "Acapela Group is a company which provides a variety of televoice services to corporations.  On their website is a demo utility which allows users to input text and generate a mp3 file with the spoken text in a variety of voices or even languages.  This guide will give tips on optimizing the process and on how to download the mp3 files using the Firefox browser.  I did not create this tool and am not responsible for its use or misuse by any party.\r<br />\r<br />\r<br />\r<br />(1) Start by getting the Mozilla Firefox browser.\r<br />\r<br />You can get the excellent and free Mozilla Firefox browser [url=https://www.mozilla.org/en-US/firefox/new/]here[/url] or at www.mozilla.org.  We will need a specific Firefox addon to grab and download media files from webpages.\r<br />\r<br />\r<br />\r<br />(2) In the Firefox Browser, install the Video DownloadHelper plugin.\r<br />\r<br />The Video DownloadHelper plugin can be installed [url=https://addons.mozilla.org/en-US/firefox/addon/video-downloadhelper/]here[/url] or at https://addons.mozilla.org/en-US/firefox/addon/video-downloadhelper/.  This addon has been around for years and is extremely useful.  It puts a small icon on your Firefox toolbar allowing you to download media files, including sound files which is what we will be using it for.\r<br />\r<br />\r<br />\r<br />(3) Visit the Acapela Group&#39;s demo utility page [url=http://www.acapela-group.com/voices/demo/]here[/url] or at http://www.acapela-group.com/voices/demo/.\r<br />\r<br />\r<br />\r<br />(4) Use the demo to generate voice file and download it.\r<br />\r<br />Type in your text and play it, and the file will show up in the Video DownloadHelper icon in your Firefox browser so you can download it.  It is in mp3 format, other utilities will be needed to convert it for use with a Skyrim mod.\r<br />\r<br />\r<br />\r<br />(5) Tips and miscellaneous.\r<br />\r<br />Be creative about how you input the text.  For example, I found that putting a ... in the text made the speaker pause at that point, which can be used to generate a more natural sounding, less rushed voice if used well.\r<br />\r<br />I also found that some words do get mispronounced.  One of the child voices kept pronouncing &#34;Dragonborn&#34; as &#34;Dragonburn.&#34;  I simply changed the text to &#34;Dragon born&#34; which sounded just perfect.  Names in particular are going to be tricky, try breaking them up phonetically as well.  For example &#34;Valerica&#34; did not sound right at all, but &#34;vah lair ick uh&#34; was pretty close to what I wanted to get.\r<br />\r<br />Lastly, some voices had noticeable pauses or tone differences between words which make them sound mechanical and unnatural.  Some voices may therefore require other tweaking with other tools for quality purposes.\r<br />\r<br />Anyways, have fun with it, hope it helps out our great modding community&#33; -mel",
  "categoryId": "61",
  "version": "v1.0",
  "author": "Melvinius",
  "createdUnix": "1473558457",
  "updatedUnix": "1473558401",
  "containsAdultContent": false,
  "uploadedBy": "melvinius",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000220351",
      "name": "General Info",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "General Info-78660-v1-0.rar",
      "uploadedUnix": "1473558401",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/baecc5639d70181d4eeb90e41cd611c533fa2b8d02fb36f58318ef11feb67b51/analysis/1473558422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/General%20Info-78660-v1-0.rar?fid=1000220351&ttl=1535867367&ri=8192&rs=8192&setec=862038565817936d908071f3082bb4fa"
    }
  ]
}