{
  "modId": 78688.0,
  "modName": "Hadariel High Elf Preset",
  "summary": "A High Elf preset of my character for Racemenu, for those not wanting to use Ethereal Elven Overhaul",
  "descriptionHtml": "This is a simple character preset of my character, a female Altmer/High Elf named Hadariel. I made this in Racemenu to get a good looking elf character without using Ethereal Elven Overhaul, which has conflicts with some popular NPC Overhaul mods like Foxy Skyrim but which virtually all other elf presets on the Nexus requires. Consider this a baseline or even example, feel free to make it your own after that, this is just to get you started with a good looking elf girl using vanilla head meshes and assets that won&#39;t have negative impacts on NPC appearances.\r<br />\r<br />This preset was made with the brilliant RaceMenu by Expired, and requires that to work, I have never used ECE and so won&#39;t make a ECE version, nor do I intend to upload a savegame version of the character. To use this, open Racemenu, switch to High Elf - Female (might work with Wood Elf also, note that some race overhauls changes like Disparity changes High Elf to it&#39;s lore race name of Altmer), enter Presets tab, hit F9, then load &#34;Hadariel Preset by Sacremas&#34; and then either hit R to name your character, or go back to the Sliders tab if you want to customize her.\r<br />\r<br />To get the same look as in my images, this mod requires [url=http://www.nexusmods.com/skyrim/mods/68311/?]KS Hairdos Renewal[/url] by Kalilies Stealthic Khaos and Shocky, without it you will get the first vanilla hair. It also uses [url=http://www.nexusmods.com/skyrim/mods/30411/?]Brows[/url] by Hvergelmir, and [url=http://www.nexusmods.com/skyrim/mods/59192/?]Eyes of Aber[/url] by Aberin. Again it will work without these, it will just default to the first standard eye and brows without them, at whic point as with the hair you can pick your own choice from what you have installed. I recommend Eyes of Aber for magical looking eyes that are really high quality, and Brows both for the new brows and the retexturing he does of all existing vanilla brows, which means even NPCs not using new brows get benefit of the mod.\r<br />\r<br />The Skin texture in the picture is [url=http://www.nexusmods.com/skyrim/mods/35267/?]SG Female Texures Renewal[/url] by Hello Santa with [url=http://www.nexusmods.com/skyrim/mods/31665/?]Better Makeup for SKSE[/url], but regular SG Textures should work fine, as would others like [url=http://www.nexusmods.com/skyrim/mods/70834/?]Demoniac[/url] SG based textures. I have not tried other textures like Fair Skin, Real Girl or Leyenda Skin with this preset so cannot say how the result will be. Feel free to upload user images if you make it look better with another skin. I am also using [url=http://www.nexusmods.com/skyrim/mods/34331/?]Hi-Res Vanilla Warpaint[/url] for the makeup (textures only, no plugin, also applies for NPCs), as her makeup is actually vanilla warpaints recolored and layered with RaceMenu. If you are using [url=http://www.nexusmods.com/skyrim/mods/60243/?]WellGram Warpaints Racemenu Plugin[/url] by Aydoo and [url=http://www.nexusmods.com/skyrim/mods/54118/?]The Neith Team Warpaints[/url] by ElaNeith the lips will look better automatically, but this is not required (screenshot is not with this mod active, so not having it does not have negative effects). These are good packs for making makeup stand out better, and has several great textures you can use to customize things. I also use normally [url=http://www.nexusmods.com/skyrim/mods/35677/?]The Coenaculi Racmenu Overlay[/url] with the optional Racemenu Overlay plugin for RaceMenu, but I made sure to set my overlays to &#34;Default&#34; for this upload, if requested I can upload a version that has my tattoos active also, which you can see in my previously submitted user image of the character [url=http://www.nexusmods.com/skyrim/images/625554/?]here[/url], and which I also uploaded as a sample image.\r<br />\r<br />Your body shape does not matter at all for this file, in the images included I am just using [url=http://www.nexusmods.com/skyrim/mods/69898/?]SFW UNP Body[/url] by Elianora, this will work with any body mesh you want that can also work with the skin texture it&#39;s made for, meaning any UNP or CBBE based body. In the sample image in Whiterun I am using the SevenBase body, along with the [url=http://www.nexusmods.com/skyrim/mods/68653/?]Cassandra Frost Witch[/url] outfit by Deserter X as well as [url=http://www.nexusmods.com/skyrim/mods/27668/?]HN66 Mage Nails[/url] by Humannature66. ENBs used are [url=http://www.nexusmods.com/skyrim/mods/36067/?]Vividian[/url] (Purity preset) in the first two images, [url=http://www.nexusmods.com/skyrim/mods/62667/?]Kinematic ENB Southern Light[/url] in the second image.",
  "categoryId": "26",
  "version": "1",
  "author": "Sacremas",
  "createdUnix": "1473692712",
  "updatedUnix": "1473691108",
  "containsAdultContent": false,
  "uploadedBy": "Sacremas",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000220536",
      "name": "Hadariel Racemenu Preset",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Hadariel Racemenu Preset-78688-1.7z",
      "uploadedUnix": "1473691108",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/741100d5cc55fe8b9f2024db65938482628f97f32d36cf17b83c66ac2c04621c/analysis/1473691142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hadariel%20Racemenu%20Preset-78688-1.7z?fid=1000220536&ttl=1535867388&ri=8192&rs=8192&setec=236736bde191605cfebad434bbfc1c9a"
    }
  ]
}