{
  "modId": 78745.0,
  "modName": "Y.A.L.O - Yet Another Landscape Overhaul",
  "summary": "A landscape texture mod that gives an extreme attention to detail to every landscape texture, including landscapes from all DLCs.",
  "descriptionHtml": "[center][b][color=#ff7700][size=4]Attention: This mod is no longer being supported or updated.[/size]\n<br />\n<br />This mod has been uploaded by \"The Care Taker\" at the request of its owner. The Care Taker account is run by Nexus Mods for the purpose of hosting mods created by authors who are no longer active in the community.\n<br />\n<br />If you are a mod author and would like to learn more about this service or have questions, you can find details regarding The Care Taker [url=https://forums.nexusmods.com/index.php?/topic/5792517-the-care-taker/]HERE[/url].\n<br />\n<br />Happy modding![/color][/b][/center]\n<br />\n<br />[center][img]http://i.imgur.com/40Qe1Wj.jpg[/img]\n<br />[size=5]What is this mod?[/size]\n<br />[i]\n<br />[size=3]Landscape textures for all of Skyrim, Hearthfires, Dawngaurd, and Dragonborn.\n<br />\n<br />[/size][/i][size=3][url=http://www.nexusmods.com/skyrimspecialedition/mods/1839/?]SE version of the mod is found here[/url]\n<br />[/size]\n<br />[size=5]What do these textures do differently?\n<br />[/size](Yes, despite the name, this mod does a few things other mods don't)\n<br />\n<br />[i][size=3]1) [u]All[/u] landscape textures from Skyrim and all DLC are covered. Yes, [u]All[/u]. \n<br />2) Many choices to fit your setup including full parallax or alpha.\n<br />3)  Patches for SMIM, Enhanced Wetness Project, Moss Rocks\n<br />3) The highest quality textures were used, 4k means 4k, not 2k stretched to be 4k. (No [url=https://en.wikipedia.org/wiki/Image_scaling]interpolation upscaling[/url]). \n<br />4) Extreme care and attention given to each texture.\n<br />5) Logic texture choices; textures that look like they belong in Skyrim\n<br />6) My own unique take on what landscape's in Skyrim ought to look like\n<br />7) Up to 4k textures for most areas (some are only max 2k)\n<br />8) Custom edited meshes and textures for streams and volcanic areas.\n<br />9) Fixes for a few issues in vanilla Skyrim (Explained in the FAQs)\n<br />10) Landscape Transition fix on landscape meshes.\n<br />11) Optional extras: So many optional extras.\n<br />[/size][/i][size=3]12)[url=https://youtu.be/qH6j2rMPh9c] Damn good glaciers[/url] with a damn good parallax icy effect.\n<br />13) No repeated textures.\n<br />[/size]\n<br />[size=5]What setup was used in the Screenshots?[/size]\n<br />\n<br />[size=3][url=http://www.nexusmods.com/skyrim/mods/73937/?]Vivid Weathers[/url] and ENB with some effects enabled. Everything else vanilla.\n<br />As of Update 1.1, all screenshots are taken with [url=http://www.nexusmods.com/skyrim/mods/79335/?]Snowfall ENB[/url]. \n<br />[/size]\n<br />[u][size=4]The textures will look different base on what visual setup you have. Don't just judge this mod by its screenshots, try it out in your game![/size][/u]\n<br />\n<br />\n<br />[img]http://i.imgur.com/fOZxfi6.jpg[/img]\n<br />[size=3]\n<br />I decided to create my own landscape textures because I was displeased with the lack of choice of landscape textures available. I think landscape textures are something that are deeply personal for users and there were none currently that satisfied my taste fully. My taste being based off of where I live; Denmark, which is roughly the geographic region Skyrim's land is akin to and keeping in mind the fantasy genre of Skyrim.[/size]\n<br />\n<br />[size=3]I set out not only to make textures I felt belong in Skyrim while being logical. Taking into account that Skyrim is a fantasy game but it's based on the real world. In the texture pack no texture was included just for the sake of being included, every part of every texture has a purpose and was chosen for a reason to follow a certain style. Lots of time and late nights were spent getting the best possible combination of textures together. If you look closely at any of the textures in this pack you will see that not only are they the material themselves but also include small details that make them fit in. For example, on muddy forest textures you might see a paw print from a wild animal or on a dirt texture near a farm you might see evidence of straw and hoeing, or in the Soul Cairn you might see a bone here or there among the dry dirt, ect. The emphasis is on small details that make a much bigger picture of the environment of Skyrim. [/size]\n<br />\n<br />[size=3]Just a disclaimer, as I said, landscape textures are very personal, I did what I felt is best and I decided to share my version of what Skyrim's landscapes ought to look like. Different people have different tastes and I encourage users to customize their landscape textures and blend my textures with other mod's textures to get the desired look. I personally feel anything from [url=http://www.nexusmods.com/skyrim/mods/49344/?]Vivid Landscapse[/url] will blend in nicely with my textures. \n<br />\n<br />This is also why I give permission to anyone who wants to take the diffuse maps from this mod and recolor, saturate, desaturate, darken, brighten, ect to work better with a specific ENB or visual setup permission to do so. Keep in mind, it's only the diffuse maps you have permission to use, everything else must be gotten from this mod, meaning this mod will always be required. You don't need to ask me before doing this, just maybe let me know so I can keep track of everything and also provide a link back to this page. [/size]\n<br />\n<br />\n<br />\n<br />[size=3][img]http://i.imgur.com/1IyrAsy.jpg[/img]\n<br />\n<br />I'll first explain all the download options for this mod\n<br />\n<br />Main Files:\n<br />\n<br />[u]YALO: Alpha (1k,2K,4K):\n<br />[/u]Complete package of landscape textures in the same manner as vanilla.\n<br />\n<br />[u]YALO: Parallax (1k,2K,4K):\n<br />[/u]Complete package of landscape textures setup for parallax use. You must have ENB and fixparallaxterrian=true. \n<br />\n<br />Optional Files:\n<br />\n<br />[u]YALO: Extras[/u]\n<br />This is an installer that contains patches for SMIM, Enhanced Wetness Project, and [url=http://www.nexusmods.com/skyrim/mods/11/?]Moss Rocks[/url] (Ruffled Feather) It contains plugins with various fixes regarding to landscape textures. It also has options for other things such as meshes to make glaciers less blue, matching leaves for Riften. The installer will explain what each thing does, so please read the descriptions and understand what you're installing. \n<br />\n<br />[u]YALO: Better Landscape Transitions[/u]\n<br />This is a unique fix for how terrible landscape texture transitions can look on meshes. On landscapes transitions are very smoothly but on meshes the effect is rather... harsh. This mod helps in making things better much better. [url=http://imgur.com/a/yvEv8]Here are screenshots of what this does.[/url] I recommend this fix highly for all parallax users, since it solves the problem of parallax textures not providing a good enough alpha transparency layer. Non-parallax users could use this as well, but they already have the advantage of proper alpha transparency so there's little gain plus all the meshes are setup for parallax. This mod does require editing on a bunch on landscape meshes and 11 more landscape textures to be installed. While perhaps one 2 or 3 are used at a time in game, this will increase your Vram by 33mb for 4k, 15mb for 2k and 7mb for 1k. \n<br />\n<br />Installing is pretty straightforward:\n<br />[font=Arial]\n<br />[/font]1) Download whatever you want to with your mod manager.\n<br />2) Install main files first, then overwrite with optional files installer\n<br />3) Activate plugins\n<br />4) Run Skyrim!\n<br />5) (Optional) Texgen from [url=http://www.nexusmods.com/skyrim/mods/59721/?]DynDOLOD[/url] will create correct LOD textures[/size]\n<br />[font=Arial][size=3]\n<br />This mod has no requirements, but I assume users have the Offical DLC and all the DLC textures are included in the main downloads by default. If you're just using vanilla, feel free to delete the 'byoh' , 'DLC01, and 'DLC02' folders inside the 'textures' fold.\n<br />\n<br />I strongly recommend using the following:[url=http://www.nexusmods.com/skyrim/mods/8655/?]\n<br />Static Mesh Improvement Mod[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/58666/?]ONE MOUNTAIN\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/55518/?]Real Roads\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/46915/?]Enhanced Wetness and Puddles[/url]\n<br />\n<br />[u][b]Do not run these textures through a texture 'optimizer' program.[/b][/u] I know what i'm doing, everything has been saved as it should be, 'optimizing' them may lead to an unintended look.\n<br />[/size][/font]\n<br />[size=3][img]http://i.imgur.com/LJJX2mh.jpg[/img][/size]\n<br />[font=Arial]\n<br />[size=3]You should experience little to no performance loss if you 1) use the correct textures for your system and 2) have everything set up they way it should be.[/size]\n<br />\n<br />[size=4]Picking correct textures for you system:\n<br />[/size]\n<br />[/font][list]\n<br />[*][font=Arial][size=3]If you have less than 2gb of Vram, [u]you can use[/u] the 1k verison.[/size][/font]\n<br />[*][font=Arial][size=3]If you have 2gb or more of Vram [u]you can use[/u] the 2k verison. [/size][/font]\n<br />[*][font=Arial][size=3]If you have 3gb or more of Vram [u]you can use[/u] the 4k.[/size][/font]\n<br />[/list][font=Arial]\n<br />[size=3]I say 'you can use', but this doesn't mean you [/size][u][size=3]should[/size][/u][size=3] use. If you have 2gb of Vram and are running several other heavy visual mods you might read this and think, 'I have 2gb of Vram, i'll take 2k.' however this would probably not be wise due to the fact you have many other visual mods already installed. If this was the case, 1k is more recommend. Similarly You might read this and think: 'I have 8gb of Vram, 4K all the way!'. However this probably isn't the best option either unless you plan to run a minimal load order. The point i'm making is, stop and take into consideration what you're already running or plan to run. Even if you can run 4K, should you run it? [/size]\n<br />\n<br />[size=3]I'll barrow the analogy: Skyrim modding is like a budget, you only have 'so much', and can invest in different mods before you're spent all you have. [/size]\n<br />\n<br />[size=3]2) Set up things 'properly'[/size]\n<br />\n<br />[size=3]Without question you need [url=http://www.nexusmods.com/skyrim/mods/38649/?]ENBoost[/url] (Not the same as ENB) and either [url=http://www.nexusmods.com/skyrim/mods/51038/?]SKSE memory patch[/url] or [url=http://www.nexusmods.com/skyrim/mods/72725/?]Crash Fixes[/url]. These are bare minimums needed for stability. If this is new information to you, i suggest reading the [url=https://www.reddit.com/r/skyrimmods/wiki/beginners_guide]Beginner's Guide[/url] from Skyrim Mods Sub-reddit[/size]\n<br />\n<br />\n<br />[size=3]A note about 4K textures and landscapes in Skyrim. [/size]\n<br />\n<br />[size=3]Simply put, 4k landscape textures are not needed. 2k textures are more than enough for Skyrim's landscapes. This comes down to [url=https://en.wikipedia.org/wiki/UV_mapping]UV Mapping[/url][/size][size=3] of the landscapes. To keep things simple, there's is not a huge benefit in terms of visual looks from 4k to 2k textures on landscapes. For this reason I will only recommend 2k and maintain that 4k is basically a waste of resources for landscape textures. \n<br />[/size][/font][size=3][font=Arial]\n<br />Despite this, 4k textures are provided as an optional download if you still need them for some reason. I personally don't believe there is any point, but the joy of modding is to determine what you want in your game and of course I support this freedom above all. I have also compiled a download which is called 'Author's choice', these are my personal picks and setup for landscape texture sizes. All landscape textures are 2k, mountains and roads are 4k because in these cases you can actually see the difference. I run a 3gb HD 7970 and a minimal load order with Vivid Weathers ENB and this suits me just fine. Your mileage may vary.\n<br />\n<br />Note: Not all textures have a 4k version, some are only available in maximum 2k resolution. This is due to the simple fact that not all source textures were available in greater than 4096x4096 resolution and I refuse to upscale a 3000x3000 image to 4k and still call it '4k'. [/font]\n<br />\n<br />[img]http://i.imgur.com/yJQkTlS.jpg[/img] \n<br />[b]Q: Should I pick Parallax or Alpha?[/b]\n<br />[i]A: Parallax is for users of ENB who want their landscapes to have parallax mapping. If you do want parallax or do not use ENB then choose alpha. NOTE: If ENB users wish to use parallax for landscapes, FixParallaxTerrain=true must be set in ENBlocal.ini\n<br />\n<br />[/i]Q: What is Parallax?\n<br />A: An old effect that is used to give things 'depth' without increasing they amount of polys on the model. It's very useful on landscapes because it makes them look less flat.\n<br />\n<br />[b]Q: What's the different between Parallax and Alpha Landscape Textures?[/b]\n<br />[i]A: The way transparency is handled for Skyrim's textures is by using the [url=https://helpx.adobe.com/photoshop/using/saving-selections-alpha-channel-masks.html]Alpha channel[/url] on the [url=https://www.youtube.com/watch?v=nVQX4vk8a7Q]diffuse map[/url]. However parallax for landscape also uses the alpha channel for height information. This conflicts so you can either have an alpha channel which gives the correct transparency information or height information. While the two may seemingly be similar, they are represented in different ways. You can either have parallax on your landscapes or proper alpha transparency. While this might not seem like a huge deal, a lot of the textures in vanilla rely on correct alpha transparency to look correct. \n<br />[/i]\n<br />[b]Q: What is the 'Better Landscape Transitions':[/b]\n<br />[i]A: For a simpler explanation, see above. This basically edits all the alpha transparency parts of the mesh to use a better blending mod with takes the alpha of the texture and blends it better with whatever texture is below it. This results in much better fading effect rather than the jaggy transparent effect with a regular alpha texture. No performance loss and it's a simple mesh tweak. \n<br />\n<br />[/i][b]Q: Does this mod support[url=http://www.nexusmods.com/skyrim/mods/61452/?] Parallax Fix Project[/url]?[/b]\n<br />[i]A: At the moment no. The original plan was to do so, but I realized that I had a better solution that's more performance friendly and I made the Better Landscape Transitions  which functionally does the same, looks better (imo) and is less performance heavy.\n<br />\n<br />[/i][b]What's with the permissions?[/b]\n<br />[i]Basically anyone can take the[url=http://docs.cryengine.com/display/SDKDOC2/Diffuse+Maps] diffuse maps[/url] and saturate, desaturate, recolor, darken, lighten, ect to make them fit in better with a specific ENB, Post processing, or other visual set up then post it to the Nexus so everyone can benefit. The original mod (this mod) will still be required, note how I said diffuse maps can be used, nothing else. I do this so these textures can have as wide of appeal to the community as possible. I set up the textures with Vivid Weathers and vanilla in mind, but not everyone likes or will use that. The only rules I have for this are: [u]you must not add or remove anything from  diffuse maps[/u] to make the materials different from what I have already (or else they won't match my normal and parallax maps) and [u]you must post your work on the Nexus[/u] and no where else. If you have any questions about this, please feel free to PM me. A bit of credit would also be nice :)\n<br />\n<br />For the Better Landscape Transitions the permissions are also fully open so anyone can use these files to make their own landscapes nicer. You may also have to seek permission from other users because their meshes are included as well.\n<br />\n<br />Full use of the mod is under different terms, which you'll need to write me a PM about.\n<br />[/i]\n<br />\n<br />[b]Q: What about USLEEP, ONE MOUNTAIN or SMIM?![/b]\n<br />[i]A: If you're using the parallax version, those meshes are already included. So it's best to overwrite with my mod. If you're using the alpha version, I recommend using them!\n<br />[/i]\n<br />[b]Q: My textures in game look too bright or too saturated, what can I do?[/b]\n<br />[i]A: I developed these textures with Vivid Weather's coloring and lighting in mind, however this doesn't mean it won't look great with other set ups. If you're keen, you can manually adjust the brightness and saturation to your liking in GIMP, Paint.net or Photoshop. The former two are free as well. I'd then highly encourage you to share your work so others can benefit :)\n<br />[/i]\n<br />[b]Q: Why are there plugins if this is a simple re-texture mod?[/b]\n<br />[i]A: The plugins fix a few problems I noticed during development that when fixed, improve visuals. They are not required at all, but recommend for best looks. They are likely not to conflict with anything and won't decrease performance. [/i]\n<br />\n<br />[i]1) Reach Roads and Fall Forest Roads now use their own normal map. Before they just used the default Road's normal.\n<br />2) Dawnguard's Forgotten Vale 'WinterForest02' texture shared a normal with another texture. It now has its own normal.\n<br />3) Dragonborn's AshRock landscape texture used the default RockGrass texture for its stones, it now has its own texture and mesh that match the landscape texture. \n<br />4) The SMIM fix not only uses my dirt for the trim on bridges but also uses the correct texture for the bridges location. meaning fall forest bridge will now have fall forest dirt trim.\n<br />[/i]5) A plugin is needed to assign parallax maps to their meshes if you're using the parallax version which is included by default with the parallax version.\n<br />\n<br />[i]All of the plugins in this mod can be safely merged. They can also be merged with any other mod, so don't complain about them taking up space in your load order.[/i]\n<br />\n<br />[b]Q: Your normal maps are compressed?! WHY?![/b]\n<br />[i]A: Right, so here's my take on it. Yes, saving textures with DXT compressing does cause artifacts, after all it's lossy compression. However, through my testing I haven't been able to notice any artifacting due to it. If a problem arises then i'll update the mod with the appropriate uncompressed normal map.[/i]\n<br />\n<br />[b]Q: I really don't like 'this' texture.[/b]\n<br />[i]A: Landscape textures are very personal and I highly encourage you to customize your own landscape texture pack. I personally think anything from [url=http://www.nexusmods.com/skyrim/mods/49344/?]Vivid Landscapes[/url] would blend perfectly in with my own textures. \n<br />\n<br />[/i][b]Q: The name of your mod is stupid. \n<br />[/b]A: Don't look at it then.\n<br />\n<br />[b]Q: Why didn't you call this mod 'Ultra HD REAL landscape texture overhaul SKYRIM 2016 4K immersive'[/b]\n<br />A: Because I hate clickbate. Let's be honest, if a mod has to resort to clickbate titles to get people to look at it, the quality of the work is probably not that great.\n<br />\n<br />[img]http://i.imgur.com/8NDWzKz.jpg[/img][/size][size=3]\n<br />Megascans.se\n<br />Gametextures.com\n<br />Textures.com\n<br />Texturelib.com\n<br />GoodTextures.com\n<br />\n<br />Tools used: \n<br />Photoshop\n<br />Crazybump\n<br />Quixel Suite\n<br />Megascans Studio\n<br />Substance Painter\n<br />Bitmap2Material\n<br />\n<br />I'd also like to credit [url=http://www.nexusmods.com/skyrim/users/5656572/?]Shutt3r[/url], [url=http://www.nexusmods.com/skyrim/users/3212020/?]Hein84[/url], and [url=http://www.nexusmods.com/skyrim/users/571605/?]Cabal120[/url]. While none of their work is included in this mod, their textures provided inspiration for some of my textures. And in general they make really good textures, please check their work as well!\n<br />\n<br />Thanks also to Nexus Mods for giving modders a place to call home.\n<br />[/size]\n<br />\n<br />\n<br />~~Made with love in Denmark~~[/center]",
  "categoryId": "29",
  "version": "1.1",
  "author": "steveowashere",
  "createdUnix": "1476111681",
  "updatedUnix": "1477120818",
  "containsAdultContent": false,
  "uploadedBy": "The Care Taker",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000223633",
      "name": "YALO Optional Extras Installer",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "151509",
      "fileName": "YALO Optional Extras Installer-78745-1-0.zip",
      "uploadedUnix": "1476034756",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cd651e61976fc996bcec4b3ea3672f821efbda2440b30a52383096fa44430640/analysis/1476034843/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Optional%20Extras%20Installer-78745-1-0.zip?fid=1000223633&ttl=1535867448&ri=8192&rs=8192&setec=2cced22911fd4ace3e54216e15f9ef6a"
    },
    {
      "fileId": "1000223705",
      "name": "YALO Parallax 4k",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1382850",
      "fileName": "YALO Parallax 4k-78745-1-0.zip",
      "uploadedUnix": "1476094097",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Parallax%204k-78745-1-0.zip?fid=1000223705&ttl=1535867449&ri=8192&rs=8192&setec=d49d2cfd126d0fc5db8485b2c6725480"
    },
    {
      "fileId": "1000223707",
      "name": "YALO Parallax 2k",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "482864",
      "fileName": "YALO Parallax 2k-78745-1-0.zip",
      "uploadedUnix": "1476094825",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Parallax%202k-78745-1-0.zip?fid=1000223707&ttl=1535867450&ri=8192&rs=8192&setec=cf437e144d9bbc415acba40933ea3fc1"
    },
    {
      "fileId": "1000223708",
      "name": "YALO Parallax 1k",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "157360",
      "fileName": "YALO Parallax 1k-78745-1-0.zip",
      "uploadedUnix": "1476095025",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ee103eb940596e2d3bf144ce27f8e896dfcd039a7b1df1013665078690cb0370/analysis/1476106101/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Parallax%201k-78745-1-0.zip?fid=1000223708&ttl=1535867450&ri=8192&rs=8192&setec=8c94c770aba558775a33c7832f12d98f"
    },
    {
      "fileId": "1000223745",
      "name": "YALO Better Transitions 1.0.2",
      "version": "1.0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "248015",
      "fileName": "YALO Better Transitions 1.0.2-78745-1-0-2.zip",
      "uploadedUnix": "1476117837",
      "modVersion": "1.0.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Better%20Transitions%201.0.2-78745-1-0-2.zip?fid=1000223745&ttl=1535867450&ri=8192&rs=8192&setec=b904dcaa13fb3e10ff895aaff5ac12d6"
    },
    {
      "fileId": "1000223824",
      "name": "YALO Just Glaciers 4k",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "33025",
      "fileName": "YALO Just Glaciers 4k-78745-1-0.zip",
      "uploadedUnix": "1476172266",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2759b37ad606e67cb8d5415ad2a4c6180aa3c6b93beabcec48082083fcdf0b80/analysis/1476183310/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Just%20Glaciers%204k-78745-1-0.zip?fid=1000223824&ttl=1535867451&ri=8192&rs=8192&setec=992dbe583e5af337bf497384a7cc7141"
    },
    {
      "fileId": "1000223825",
      "name": "YALO Just Glaciers 2k",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "12509",
      "fileName": "YALO Just Glaciers 2k-78745-1-0.zip",
      "uploadedUnix": "1476172338",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/905007ec1d2363acbac019c22844aa3593655cf45aac4e8446a440998e10532d/analysis/1476183314/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Just%20Glaciers%202k-78745-1-0.zip?fid=1000223825&ttl=1535867452&ri=8192&rs=8192&setec=0b068579ea74f12ff0df1a1d154b81fa"
    },
    {
      "fileId": "1000224920",
      "name": "YALO Parallax 2k - Update 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "479352",
      "fileName": "YALO Parallax 2k-78745-1-1.zip",
      "uploadedUnix": "1476978379",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Parallax%202k-78745-1-1.zip?fid=1000224920&ttl=1535867452&ri=8192&rs=8192&setec=022397173defb4046eac8d58099ce5c6"
    },
    {
      "fileId": "1000224922",
      "name": "YALO Parallax 4k Update 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1311275",
      "fileName": "YALO Parallax 4k-78745-1-1.zip",
      "uploadedUnix": "1476979705",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Parallax%204k-78745-1-1.zip?fid=1000224922&ttl=1535867453&ri=8192&rs=8192&setec=93bab55aa7954bf42d6c054e3f092a98"
    },
    {
      "fileId": "1000224924",
      "name": "YALO Parallax 1k - Update 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "159177",
      "fileName": "YALO Parallax 1k-78745-1-1.zip",
      "uploadedUnix": "1476980050",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/87e5e79fa287e184f29f90e7707f78bea9ce17ad910b43f59587a8592d31ee21/analysis/1476991163/",
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Parallax%201k-78745-1-1.zip?fid=1000224924&ttl=1535867453&ri=8192&rs=8192&setec=dfe360616a396287d2addb8b42254e4a"
    },
    {
      "fileId": "1000224925",
      "name": "YALO Better Transitions 1.0.2",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "253988",
      "fileName": "YALO Better Transitions 1.0.2-78745-1-1.zip",
      "uploadedUnix": "1476980368",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Better%20Transitions%201.0.2-78745-1-1.zip?fid=1000224925&ttl=1535867453&ri=8192&rs=8192&setec=64a30e8156c4f8bc2f202a17a534368a"
    },
    {
      "fileId": "1000225038",
      "name": "YALO Alpha 4k - Update 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1223784",
      "fileName": "YALO Alpha 4k-78745-1-1.zip",
      "uploadedUnix": "1477051540",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Alpha%204k-78745-1-1.zip?fid=1000225038&ttl=1535867454&ri=8192&rs=8192&setec=f74f72367962fe29d4163d7daf85f0aa"
    },
    {
      "fileId": "1000225039",
      "name": "YALO Alpha 1k",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "431233",
      "fileName": "YALO Alpha 1k-78745-1-1.zip",
      "uploadedUnix": "1477052120",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Alpha%201k-78745-1-1.zip?fid=1000225039&ttl=1535867454&ri=8192&rs=8192&setec=c232d362066cdd232f061bc89f039178"
    },
    {
      "fileId": "1000225040",
      "name": "YALO Alpha 1k - Update 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "125265",
      "fileName": "YALO Alpha 1k - Update 1.1-78745-1-1.zip",
      "uploadedUnix": "1477052543",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/94396b1a77ad20188e2e9f8f69cf1202f5abd1149017bf149ccf3514796985b4/analysis/1477063521/",
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Alpha%201k%20-%20Update%201.1-78745-1-1.zip?fid=1000225040&ttl=1535867455&ri=8192&rs=8192&setec=c3ef8b2d4d5c5d74005d70cafa04f750"
    },
    {
      "fileId": "1000225041",
      "name": "YALO Alpha 2k Update 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "431233",
      "fileName": "YALO Alpha 2k Update 1.1-78745-1-1.zip",
      "uploadedUnix": "1477053014",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/YALO%20Alpha%202k%20Update%201.1-78745-1-1.zip?fid=1000225041&ttl=1535867455&ri=8192&rs=8192&setec=1e330b428a14827beb5fc4750c9e869a"
    },
    {
      "fileId": "1000225153",
      "name": "Hotfix for update 1.1",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hotfix for update 1.1-78745-1-1.zip",
      "uploadedUnix": "1477120818",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9de2536cfc5e093c4b58986ff0640cafec5f878acac280cad960c516ffa34d34/analysis/1477120862/",
      "changelogHtml": " 1 - Increased ambient occlusion to all textures except snow (Not needed).\r<br />2 - Re-worked all dirt textures. Less brown more gray. Less ‘freshly dumped’ look.\r<br />3 - Re-worked FieldGrass01&02. FieldGrass02 looks less like green paint from a distance\r<br />4 - Re-worked Rocks01 texture.\r<br />5 - Re-worked Tundra textures. \r<br />6 - Re-worked Pineforest02. De-saturated and darken texture slightly.\r<br />7 - Re-worked Snow textures using Substance Snow.\r<br />8 - Calibrated textures for better use with NLVA and Snowfall ENBs. (Still compatible with Vivid Weathers)\r<br />9 - Improved alpha transparency on Fieldgrass01 and Fieldgrass01 in Alpha version\r<br />10 - Fixed Issue dirt cliff roots clipping through cliffs.\r<br />11 - Fixed issue with tundra stream mesh’s nodes being in wrong order and thus the game applying the wrong texture sets to the appropriate nodes. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hotfix%20for%20update%201.1-78745-1-1.zip?fid=1000225153&ttl=1535867456&ri=8192&rs=8192&setec=4505d5bad45fe7e76fc9d94d1bcb7ee1"
    }
  ]
}