{
  "modId": 78785.0,
  "modName": "Realistic Needs and Diseases 2.0",
  "summary": "This is a new and updated version of the very popular Mod [url=http://www.nexusmods.com/skyrim/mods/26228/?]Realistic Needs and Diseases[/url] by Perseid9. Ontop of the original features there has been some fine additions, like weight feature, widgets and various other changes.",
  "descriptionHtml": "[center][img]http://i.imgur.com/ku2h7fu.png[/img]\r<br />[color=#6aa84f][size=4][b]Logo by starfis, Thank you starfis&#33;\r<br />\r<br />Please, to honour my efforts and future endeavours, endorse the Mod&#33;[/b][/size][/color][/center]\r<br />This is a new and updated version of the very popular Mod [url=http://www.nexusmods.com/skyrim/mods/26228/?]Realistic Needs and Diseases[/url] by Perseid9. Perseid9 ended support for his Mod on 3/07/2014. Since then the Mod has not been updated, nor has it been maintained or supported. I had high hopes perseid9 would return and continue his work, but now after more then 1 year, I&#39;ve abandoned all hope for him to return. Perseid9 made his Mod public domain, and so I took the responsibility to step in his shoes and continue what might be the best and most convenient Needs Mod ever. Perseid9, if you read this and you disagree with my adoption, let me know and I&#39;ll hand over the source code including all the work on the widgets and MCM menu I&#39;ve done.\r<br />\r<br />[b][size=6][center][color=#00ff00][u]Difference to original version[/u][/color][/center][/size][/b][b][color=#f1c232]Version 2.2+ has:[/color][/b]\r<br />\r<br />- added widget support for hunger, thirst, sleep and inebriation, they can be static, hotkeyed and or auto-fading, they also come in two color variations\r<br />- all widgets are configurable in the MCM menu: position, size, transparency, turn on/off\r<br />- added FISS support for easy widget preset save/load\r<br />- configure auto update interval for widgets\r<br />- you can fill your waterskins/bottles on any well, troughs and waterwheels\r<br />- innkeepers will respond verbaly when buying drinks\r<br />- hotkey feature to customize food from other Mods...simply drop the fooditem to the floor, hover the mouse over and press the hotkey\r<br />- a MCM toggle feature to remove the nasty carry weight penalty on hunger and sleep...if you prefer cheating over suffering...;)\r<br />- added feature to allow grilling food (meat, leek, potatoe) on all campfires, embers and various other firesources\r<br />- a fully functional weight system...you will visually loose/gain weight based on your diet, this plays nicely with [url=http://www.nexusmods.com/skyrim/mods/29476/?]Pumping Iron[/url]...you will also get a weight widget showing your stature\r<br />- added hotkey based &#34;resting&#34; feature, replacing the vanilla wait system...you will regen health and get tired half as fast...for fun I also adapted the sleep/wait menu to allow for greater immersion\r<br />\r<br />[color=#f1c232][b]Things you will not see in this Mod&#33;[/b][/color]\r<br />\r<br />- water from rain or snow sources...this makes you sick, stop asking...this is unimmersive and unrealistic as it can get...troughs are an exception as you can see people will frequently put water in troughs when using a Mod like immersive Citizens...so they get actually refilled with river water\r<br />- automation of eating, drinking, sleeping...then why do a needs mod? if you can&#39;t be bothered to feed yourself, needs mods are likely not your cup of tea...one one of the reasons I&#39;m using actually is I have to interact with food in order to stay alive...to automate such a process is just nonsense\r<br />- follower/horse needs...not supposed to be a feature of a personal needs mod...this will go inside my follower mod instead, pretty much because my follower mod already has a wage feature, and also because I&#39;m planinghuge things with the follower/animal food feature...RNAD always was about personal needs and will stay this way\r<br />\r<br />[color=#f1c232][b]What&#39;s planed for future versions?[/b][/color]\r<br />\r<br />With the newest version 2.2 no further plans are made. If you bring good ideas on topic I will implement them. I will continue support in future and will also squish bugs I find or those you report. Patches for food mods are virtually obsolete with the new food customization feature. I will continue to raise compatibility in future updates.\r<br />\r<br />[b][center][color=#00ff00][size=6][u]Requirements:[/u][/size][/color][/center]\r<br />\r<br />[/b]1. Skyrim with all DLC&#39;s and the most actual patch\r<br />2. [url=http://www.nexusmods.com/skyrim/mods/71214/?]Unofficial Skyrim Patch[/url]\r<br />3. [url=http://skse.silverlock.org/]SKSE[/url]\r<br />4. [url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url]\r<br />5. (optional) [url=http://www.nexusmods.com/skyrim/mods/48265/?]FISS[/url] to save widget presets\r<br />\r<br />[b][color=#00ff00][size=6][u][center]Recommendations:[/center][/u][/size][/color][/b]\r<br />\r<br />I highly recommend the following Mods for higher immersion, realism and survival content added:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/60421/]Bathing in Skyrim[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/11163]Frostfall[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/9778/]Real Wildlife[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66417/]Coffee Mod[/url]\r<br />\r<br />[center][color=#00ff00][size=6][u][b]How to Install:[/b][/u][/size][/color][/center]\r<br />[color=#f1c232][size=4]\r<br />[/size][/color][color=#f1c232][size=4]Installation with NMM:[/size][/color]\r<br />\r<br />[size=4]1.[/size] Press download with Manager button on the Nexus and confirm the requested programm\r<br />[size=4]2.[/size] Once downloaded open up NMM and click the mods tab to import the RealisticNeedsAndDiseases.7z\r<br />[size=4]3.[/size] After installation enable the plugin files in your prefered reorder tool or in data files when starting up Skyrim\r<br />[size=4]4.[/size] When starting Skyrim, click on data files, and make sure the \r<br />&#39;RealisticNeedsAndDiseases.esp&#39; is checked. If you use Wrye Bash, make \r<br />sure the file is activated and your load order corrected. Use [url=https://loot.github.io/]LOOT[/url] to automatically get the correct load order.\r<br />[size=4]5.[/size] Play the Game&#33;&#33;&#33;\r<br />\r<br />[color=#f1c232][size=3]Manual Installation:[/size][/color]\r<br />\r<br />[size=4]1.[/size] Unzip the files anywhere\r<br />[size=4]2.[/size] Move the .esp and .bsa file &#39;RealisticNeedsAndDiseases&#39; to your &#39;x:...SkyrimData&#39; folder.\r<br />[size=4]3.[/size] When starting Skyrim, click on data files, and make sure the &#39;RealisticNeedsAndDiseases.esp&#39; is checked. If you use Wrye Bash, make \r<br />sure the file is activated and your load order corrected. Use [url=https://loot.github.io/]LOOT[/url] to automatically get the correct load order.\r<br />[size=4]4.[/size] Run Skyrim&#33;&#33;&#33;\r<br />\r<br />[center][color=#00ff00][u][size=6][b]Features:[/b][/size][/u][/color][/center]\r<br />\r<br />[center][color=#f1c232][size=5][b]Basic Needs: [/b][/size][/color][/center]\r<br />\r<br />When you start the mod, you will gain a “Check Needs” power, so you can bind it to a hotkey for quick checking. You can also enable debug mode to \r<br />have it display needs points. There are the needs hunger, thirst, sleep and the effect of inebriation. Hunger has 6 stages, all other effects have 5 stages. You will need to eat, drink and sleep in order to survive. Drinking alcohol will get you drunk. Suffering from any form of impairment due to hunger, thirst, sleep or inebriation, will lower your attributes/stats and have visual effects. The effect stages are:\r<br />\r<br />[center][color=#f1c232][size=3][b]Hunger has 6 stages:[/b][/size][/color][/center]\r<br />[b][color=#f1c232]Gluttony[/color][/b] - I have eaten too much. Speed -30%.\r<br />[b][color=#f1c232]Satiated [/color][/b]- Health, stamina regeneration +10%.\r<br />[b][color=#f1c232]Peckish [/color][/b]- Ready for a snack. (no bonus or negative effect)\r<br />[b][color=#f1c232]Hungry [/color][/b]- Health, stamina regeneration -30%.\r<br />[b][color=#f1c232]Very Hungry[/color][/b] - Health, stamina regeneration -60%. Sneak is 25% harder. Attack damage -25%.\r<br />[b][color=#f1c232]Starving [/color][/b]- Health, stamina regeneration -90%. Carry Weight -50. Attack Damage -50%.\r<br />[b][color=#f1c232]\r<br />Eating and drinking animations when you eat/drink:[/color][/b][i]Animations are disabled automatically while playing in first person view.[/i] New and modified recipes, alternative texture for stews.There is 15% chance eating raw food will catch diseases. Stale/spoiled food not only tastes disgusting, but will also give you diseases. Food items in barrels, sacks have been greatly reduced, and most of them you do find will be stale. Some large food items like cheese wheels will provide several servings, you don&#39;t finish the whole thing in one bite. You can also grill basic food on any campfire, fireplace and ember. Grillable food is: any meat, leek and potatoes.\r<br />\r<br />[b][color=#f1c232]For cooking:[/color][/b] you need to convert bottled water into plain “water” (flagon), I did this so I don&#39;t have to duplicate recipes for different types of water \r<br />containers. Water conversion gives you empty bottles back. Many innkeepers now also stock everyday cooking ingredients, things like salt, garlic, honey, chicken eggs, elves ears, frost mirriam, etc.\r<br />\r<br />[b][color=#f1c232]Food Spoilage: [/color][/b]if enabled, this mod will keep track of food items in player inventory,you can configure how long it takes for each type of food to spoil, youcan also collect (25% chance) molds and rotten flesh from those spoiledjunk, and use them in alchemy.\r<br />\r<br />[b][color=#f1c232]Seawater:[/color][/b] If you run out of salt, you can collect seawater using empty bottles along the coastline, boiling seawater gives you salt.\r<br />\r<br />[center][color=#f1c232][b][size=3]Thirst has 5 stages:[/size][/b][/color][/center]\r<br />[b][color=#f1c232]Quenched[/color][/b]- Magicka, stamina regeneration +10%.\r<br />[b][color=#f1c232]Slightly Thirsty[/color][/b] - Ready for a drink. (no bonus or negative effect)\r<br />[b][color=#f1c232]Thirsty[/color][/b] - Magicka, stamina regeneration -30%.\r<br />[b][color=#f1c232]Very Thirsty[/color][/b] - Magicka, stamina regeneration -60%. Time between shouts +25%. Spells 25% less effective.\r<br />[b][color=#f1c232]Dehydrated[/color][/b] - Magicka, stamina regeneration -90%. Time between shouts +50%. Spells 50% less effective.\r<br />\r<br />[b][color=#f1c232]Drinking ale/mead or wine will give you empty bottle, any vanilla &#34;empty wine bottle&#34; you pick up will also be converted into reusable ones:[/color][/b] You can refill empty bottles and waterskins in any river (stand in water then click the bottle), or you can ask for clean water in inns and taverns. Drinking river water directly can cause diseases, boil before drinking. Spring water (currently only available from drinking fountains) is safe to drink.Herbal Tea will give you +10 speech for 300 seconds, milk is also available if you don&#39;t mind being a milk drinker. If you have installed [url=http://www.nexusmods.com/skyrim/mods/24282/?]Drinking Fountains of Skyrim[/url], activate the fountain to refill all your empty bottles, or sneak-activate to drink directly from the fountains. You can also get dirty water, which you&#39;ll need to boil, from any well, trough and waterwheel. Simply activate it with a empty waterskin or bottle in your inventory. Buying water in Inns is also possible.\r<br />\r<br />[color=#f1c232][size=3][b][center]Sleep has 5 stages:  [/center][/b][/size][/color]\r<br />\r<br />[b][color=#f1c232]Well/Rested[/color][/b] - Same as in vanilla\r<br />[b][color=#f1c232]Slightly tired[/color][/b] - Ready for a nap. (no bonus or negative effect)\r<br />[b][color=#f1c232]Tired[/color][/b] - Carry Weight -30, Skills improve 25% slower.\r<br />[b][color=#f1c232]Very tired[/color][/b] - Carry Weight -60. Skills improve 50% slower. Speed -20%.\r<br />[b][color=#f1c232]Exhausted[/color][/b] - Carry Weight -90, Skills improve 75% slower. Speed -30%.\r<br />\r<br />[b][color=#f1c232][i]Werewolf will get a &#34;Restless Beast&#34; stage instead, just to keep it lore friendly[size=3]:[/size][/i][/color][/b] You must sleep for enough hours to get fully rested. There is no need to sleep consecutive hours though, if you wake up still tired, you can simply go back and take another nap. The &#34;dirty bedroll&#34; disease chance is actually location based, not which bedroll you use. The name itself is a bit misleading. Because if the place is filthy you bedroll is doomed to get dirty once you throw it down on the floor. ;) Avoid locations like dungeons, bandit camps, animal dens etc., pick a clean spot and you will be fine. \r<br />\r<br />If you don&#39;t like the carry weight malus on sleep and hunger, you can turn it off inside the MCM menu. \r<br />\r<br />[color=#f1c232][size=3][b][center]BodyWeight has 5 stages:[/center][/b][/size][/color]\r<br />\r<br />Will have a visual impact on your characters body. You will get thinner and loose weight when not eating enough, and get thicker and gain weight \r<br />when satiated or eating to much. Loosing weight will have an impact on your &#34;physical&#34; strength as you will likely resist blows much better when trained or muscular. This plays very well with [url=http://www.nexusmods.com/skyrim/mods/29476/]Pumping Iron[/url]. Can be toggled off and on in the MCM menu. It&#39;s off by default. The widget and text notification reflect your weight in kilograms, in MCM however it&#39;s counted in units. 1 kilogramm == 2 units. The weight changewill have the effects statet downside.\r<br />\r<br />[b][color=#f1c232]Muscular[/color][/b] - You&#39;re very strong and physically resistant, but your stamina and speed is low\r<br />[b][color=#f1c232]Trained[/color][/b] - You&#39;re fit, endurant and physically resistant\r<br />[b][color=#f1c232]Wiry[/color][/b] - You&#39;re fit, very endurant and fast\r<br />[b][color=#f1c232]Slender[/color][/b] - You gain on speed what you miss in strength and resistance, your stamina is fine\r<br />[b][color=#f1c232]Skinny[/color][/b] - You are not resistant and strong, but your speed and agility is unmatched\r<br />\r<br />[center][color=#f1c232][size=5][b]Negative Effects:[/b][/size][/color][/center]\r<br />[center][color=#f1c232][size=3][b]Inebriation has 5 stages: [/b][/size][/color][/center]\r<br />Has visual and stumbling effects. You can turn them off in MCM menu.\r<br />\r<br />[b][color=#f1c232]Sober[/color][/b] - I&#39;m sober. (no bonus or negative effect)\r<br />[b][color=#f1c232]Dizzy[/color][/b] - Good stuff, just a bit dizzy. Unarmed Damage +5, Damage Resist +10.\r<br />[b][color=#f1c232]Drunk[/color][/b] - My head is spinning. Unarmed Damage +10, Speech -15, Magicka regeneration -15, Spells 50% less effective, duration -50%.\r<br />[b][color=#f1c232]Wasted[/color][/b] - I&#39;m completely wasted...Magicka and Stamina regeneration -25, Spells 85% less effective, duration -85%.\r<br />[b][color=#f1c232]Blackout[/color][/b] - Knocks you out right on the spot, only to wake up 4 hours later head spinning. \r<br />\r<br />[center][color=#f1c232][size=5][b]Additional Features:[/b][/size][/color][/center]\r<br />[b][color=#f1c232]Camping Gear:[/color][/b] This mod provides a set of basic camping gear, including tent, bedroll,tinderbox, and cooking pot. The camping equipments are craftable, also available for purchase from general merchants. The bedroll can be used standalone, or with a tent. To use, drop it on the floor, sneak-activateto unpack the bedroll. To pitch a tent with a bedroll, you must have both Traveller&#39;s Tent and Bedroll in inventory, then pitch the tent. Drop it, sneak-activate to pitch, a cot will be placed inside the tent automatically. To build a campfire, you must have at least 3 firewoods and a tinderbox. Drop the tinderbox, sneak-activate to build campfire. If you have a Cast Iron Pot in inventory, a cooking pot will be placed by the fire as well. Campfire lasts for 6 hours, you can activate the fire to add more firewoods, add/remove cooking pot, or sneak-activate itto put out the fire. If left unattended, campfire will burn out then remove itself after 24 hours.\r<br />\r<br />[b][color=#f1c232]Beast Compatibility:[/color][/b] This mod is compatible with vampire, werewolves and cannibalism. Vampires have no need for food or water, and werewolves/cannibals feeding will satisfy hunger and thirst.\r<br />\r<br />[b][color=#f1c232]Progressive Diseases:[/color][/b] Diseases are no longer easily ignored nonsense. Initial syndromes are still mild (as in vanilla), but without treatment, things get worse, much worse, over time. Find a cure as soon as possible&#33; But if you can&#39;tafford a cure, you can always rest and hope for the best, there is a chance your body will slowly fight off the disease by itself if you get enough rest. By rest, I mean a clean bed and warm fire, you&#39;re likely tocatch more diseases sleeping in a dirty bandit camp&#33;\r<br />\r<br />[b][color=#f1c232]Disease Fatigue:[/color][/b] if enabled, you will get tired more quickly, also can&#39;t sleep well whendiseased. Please check for disease effects first if your character suffers sleep disorder.\r<br />\r<br />[b][color=#f1c232]Configuration:[/color][/b] You can configure Hunger/Thirst/Fatigue and weight rate, disease chanceand many other options in game, to better fit your timescale and play style. For whoever wants to do the math, here&#39;s the details: \r<br />\r<br />[color=#f1c232]Hunger:[/color] Gluttony(0) – Satiated(5) – Peckish(30) – Hungry(60) - Very Hungry (120) - Starving (240) (capped at 240)\r<br />Thirst: Quenched(0) - Slightly Thirsty(40) - Thirsty(80) - Very Thirsty(160) - Dehydrated(240) (capped at 240)\r<br />Sleep: Well/Rested(0) - Slightly tired(30) - Tired(60) - Very tired(120) – Exhausted(240) (capped at 240)\r<br />\r<br />Take hunger for example, hunger rate 6 means 6 hunger points per game hour, so it takes about 10 hours to go from full to hungry; if you put it on \r<br />1, it means 1 hunger point per game hour, that&#39;s 24 points a game day, and will take you about 3 days to get hungry. The same applies to thirstand sleep. This mod doesn&#39;t rely on timescale, because I use in-game time in scripts, not real time. No matter what timescale you use, a gameday is still 24 game hours. But timescale does affect player perception, how frequently you need to eat and such when you play the game. The weight slider defines the treshold how fast your weight lowers/raises. Lower numbers will increase weight gain/loss.\r<br />\r<br />[color=#f1c232]Inebriation:[/color] Sober(0) - Dizzy(30) - Drunk(60) - Wasted(90) - Blackout(150) (capped at 150)\r<br />\r<br />You can adjust alcohol level for weak/normal/strong alcoholic beverages, the higher the value the quicker you get drunk. Take weak alcohol mead \r<br />for example, the default is 10, which means, when you drink one bottle of mead, it increases your alcohol points by 10 (the actual number will vary slightly in game from bottle to bottle), when your alcohol points reach 30 (after about 3 meads), you get slightly tipsy, at 60 (after 6 meads) you get drunk. So if you lower the value from 10 to 5, you can drink approx. 12 meads before getting drunk.\r<br />\r<br />[color=#f1c232]Hotkeys:[/color] If you have SKSE, this mod also adds hotkeys for Check Needs &lt;default N&gt; and Drink from Stream&lt;default B&gt;, the drink key doubles as “empty” key, if you want to empty a bottle or waterskin without drinking its content, highlight the bottle/wine in inventory, then hit B; the keys are configurable in MCM.\r<br />\r<br />[color=#f1c232]Widget Support:[/color] Version 2.2 now features fully customizable HUD Widgets for hunger, thirst, sleep, weight and inebriation. The widgets are text based and will show exactly which current stage of effect you benefit/suffer from.Widgets are entirely configurable from inside the MCM menu. They come in two color variations, and can be set static, hotkey based and/or fading.\r<br />\r<br />[color=#f1c232]Third party Mod food customization:[/color] This will work virtually for every Mod that adds food. Define the hotkey inside the MC, then drop the food item to the floor, hover your mouse over the item, and hit the hotkey. This will fire a menu where you can give the food any designation you want it to be: raw food, snack, meal or abundant meal. You can also define beverages and alcoholic beverages.This will not work for the food/drinks that come by default. Once defined you can eat the food just as it was part of RNAD. You will have all the same benefits, and in case of alcohol and raw food, disadvantages.\r<br />\r<br />[color=#f1c232]Resting:[/color] You can define a hotkey inside the MCM that will allow you to rest. When resting the character will play an animation and the wait menu gets fired. The wait menu has been modified to allow for greater immersion. Resting will resore all health, which is specifically good when using Mods that turn off auto health regeneration. You will also tire half as fast when resting.\r<br />\r<br />[b][size=6][b][center][color=#00ff00][u]Compatibility&Patches:[/u][/color][/center][/b][/size]\r<br />This Mod is not compatible with same type needs/diseases mods of course. You&#39;ll also need to load this mod after any other mods that modify vanilla food.\r<br />\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/11163]Frostfall[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/41076]Realistic Water Two[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/13268]WATER - Water And Terrain Enhancement Redux[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/10175]SkyTEST - Realistic Animals and Predators[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/9717]Better Vampires[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/9286]Skyrim Redone[/url], please load this mod after SkyRe\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/12452]Sands of Time[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/16553]Harvest Overhaul[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/33201]Hunterborn[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/20721]Nature of the beast II[/url]\r<br />This mod is compatible with [url=http://www.nexusmods.com/skyrim/mods/16139]Fishing in Skyrim[/url]\r<br />\r<br />Patches for following mods also available under Optional Files or a packed inside the main file:\r<br />\r<br />Babettes Feast - Improved Cooking by Merilia\r<br />Destructible bottles Extended by lamer1000\r<br />Expanded Towns and Cities by missjennabee\r<br />Requiem - The Roleplaying Overhaul by Xarrian and Ogerboss\r<br />Unique Booze Bottles HD by XRC\r<br />Falskaar - Realistic Needs and Diseases Patch by Tom2681\r<br />Cooking Expanded - Realistic Needs and Diseases Compatibility Patch by born2bkilled\r<br />Improved Fish - Realistic Needs and Diseases Compatibility Patch by born2bkilled\r<br />Knapsack Enhanced by born2bkilled\r<br />Herbal Tea by Gustav Lundgren, RND Patch by Starfis\r<br />Collect water from wells - RND Compatible by Thicketford\r<br />\r<br />Optional third party patches:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/57142/]Patch for Farm Animals[/url][/b]\r<br />\r<br />[center][color=#00ff00][size=6][b][u]Translations:[/u][/b][/size][/color][/center]\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/31000]Brazilian Portuguese translation[/url] by Lanceras\r<br />[url=http://www.nexusmods.com/skyrim/mods/34676]Czech translation[/url] by wyruzzah\r<br />[url=http://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=195&t=14307]French translation[/url] by Oaristys\r<br />[url=http://skyrim.nexusmods.com/mods/27182]German translation[/url] by CreatorX\r<br />[url=http://www.nexusmods.com/skyrim/mods/49060]German translation[/url] by mditsch\r<br />[url=http://www.nexusmods.com/skyrim/mods/49327]Italian translation[/url] by improbabile\r<br />[url=http://skyrim.2game.info/detail.php?id=26228]Japanese translation[/url]\r<br />[url=http://skyrim.nexusmods.com/mods/30459]Polish translation[/url] by aragothestel\r<br />[url=http://www.nexusmods.com/skyrim/mods/50059]Spanish translation[/url] by criswolf09\r<br />[url=http://gamer-mods.ru/load/tes_v_skyrim/gejmplej_i_animacija/realistic_needs_and_diseases/16-1-0-1434]Russian translation[/url] by Kopasov\r<br />\r<br />[size=5][b][center][color=#00ff00][u][size=6]FAQ:[/size][/u][/color][/center][/b][/size]\r<br />[color=#f1c232][size=3][b]1. What&#39;s the difference between this and the original version?[/b][/size][/color]\r<br />\r<br />[color=#f1c232]Version 2.2 has:[/color]\r<br />\r<br />- added widget support for hunger, thirst, sleep and inebriation, they can be static, hotkeyed and or auto-fading, they also come in two color variations\r<br />- all widgets are configurable in the MCM menu: position, size, transparency, turn on/off\r<br />- added FISS support for easy widget preset save/load\r<br />- configure auto update interval for widgets\r<br />- you can fill your waterskins/bottles on any well, troughs and waterwheels\r<br />- innkeepers will respond verbaly when buying drinks\r<br />- hotkey feature to customize food from other Mods...simply drop the fooditem to the floor, hover the mouse over and press the hotkey\r<br />- a MCM toggle feature to remove the nasty carry weight penalty on hunger and sleep...if you prefer cheating over suffering...;)\r<br />- added feature to allow grilling food (meat, leek, potatoe) on all campfires, embers and various other firesources\r<br />- a fully functional weight system...you will visually loose/gain weight based on your diet, this plays nicely with [url=http://web.archive.org/web/20160116063049/http://www.nexusmods.com/skyrim/mods/29476/]Pumping Iron[/url]...you will also get a weight widget showing your stature\r<br />- added hotkey based &#34;resting&#34; feature, replacing the vanilla wait system...you will regen health and get tired half as fast...for fun I also adapted the sleep/wait menu to allow for greater immersion\r<br />\r<br />[color=#f1c232]Things you will not see in this Mod&#33;[/color]\r<br />\r<br />- water from rain or snow sources...this makes you sick, stop asking...this is unimmersive and unrealistic as it can get...troughs are an exception as you can see people will frequently put water in troughs when using a Mod like immersive Citizens...so they get actually refilled with river water\r<br />- automation of eating, drinking, sleeping...then why do a needs mod? if you can&#39;t be bothered to feed yourself, needs mods are likely not your cup of tea...one one of the reasons I&#39;m using actually is I have to interact with food in order to stay alive...to automate such a process is just nonsense\r<br />- follower/horse needs...not supposed to be a feature of a personal needs mod...this will go inside my follower mod instead, pretty much because my follower mod already has a wage feature, and also because I&#39;m planing huge things with the follower/animal food feature...RNAD always was about personal needs and will stay this way\r<br />\r<br />[color=#f1c232]What&#39;s planed for future versions?[/color]\r<br />\r<br />With the newest version 2.2 no further plans are made. If you bring good ideas on topic I will implement them. I will continue support in future and will also squish bugs I find or those you report. Patches for food mods are virtually obsolete with the new food customization feature. I wil continue to raise compatibility in future updates.\r<br />\r<br />[color=#f1c232][size=3][b]2. The Mod doesn&#39;t seem to work for me, what should I do?[/b][/size][/color]\r<br />You are using a conflicting Mod, didn&#39;t turned features on in MCM menu, didn&#39;t installed it correctly, enabled the Mod on a existing savegame and maybe at the same time removed older versions without appropriate &#39;clean save&#39; procedure, or did something uncomprehentable for me to fix.\r<br />[quote]QUOTE\r<br />Maybe turn off the Mod in MCM and then turn it back on? I&#39;d also start researching to why this happened in the first place? Added/removed Mods from your Mod list recently? Changed load order recently? Significantly increased the number of used Mods recently? Added a fair amount of texture related eye candy Mods recently?\r<br />\r<br />You see, there&#39;s tons of reasons why this happens. Usually it happens because the user did something unexpected.\r<br />\r<br />I&#39;d try fixing this by moving RNAD to the very bottom of the load order andsee if helps. You&#39;d probably need to save once after moving the mod to the bottom, and then see if it helps. [/quote][color=#f1c232][size=3][b]3. Will this work for controllers?[/b][/size][/color]\r<br />The Pagan&#39;s say yes&#33;\r<br />\r<br />[color=#f1c232][size=3][b]4. I&#39;m getting script lag with this. What can I do?[/b][/size][/color]\r<br />Try increasing the update timer interval in the widget section of the MCM menu.\r<br />\r<br />[color=#f1c232][size=3][b]5. Will there any problems with Mods that depend on this, will they still see it as master? How does LOOT treat it?[/b][/size][/color]\r<br />Just treat this new version as if it is an update to perseid9&#39;s work. No changes to name or plugin ID have been made. Other Mods that had RNAD as master will still detect it as master.\r<br />\r<br />[center][color=#00ff00][b][size=6][b][u]Credits:[/u][/b][/size][/b][/color][/center]\r<br />\r<br />Of course perseid9 deserves all the credit for the original Mod.\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/13687]Sabre Gear Backpack[/url]TreasureChest and DVAted are most generous to allow me use the waterskin from their backpacks, it&#39;s a shame to rip it off the pack, so in case you&#39;re not already using the backpacks, please download and endorse their wonderfulwork ;)\r<br />\r<br />[url=http://skyrim.nexusmods.com/mods/24282]Drinking Fountains of Skyrim[/url]\r<br />MannyGT has been very kind to allow me use the fountains. Please don&#39;t forget to endorse the fountains&#33; :)",
  "categoryId": "24",
  "version": "2.3.4",
  "author": "CrEaToXx",
  "createdUnix": "1474104522",
  "updatedUnix": "1474104189",
  "containsAdultContent": false,
  "uploadedBy": "CrEaToXx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000221058",
      "name": "Realistic Needs and Diseases 2.0",
      "version": "2.3.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5123",
      "fileName": "Realistic Needs and Diseases 2.0-78785-2-3-4.7z",
      "uploadedUnix": "1474104096",
      "modVersion": "2.3.4",
      "virusScanUrl": "https://www.virustotal.com/file/9372e353ae6934b6ee7e0fcc5c021aab0653a7af1ad1fe6a9e9670ba1b3bd628/analysis/1474104123/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release ?.?.2015, Version ?:[/color][/size][/b]\r<br />\r<br />- fixed problems related to setting up the widget via anchors...translators need to manually translate the MCM anchor names\r<br />- added missing anchor definition for weight widget, thus rendered positioning with anchor not working\r<br />- fixed error log issue related to assigning the wrong anchor alias, and thus rendering the anchor for weight and inebriation widgets not correctly working\r<br />- lifted Mod to unofficial patch legendary edition\r<br />\r<br />[size=4][b][color=#00FF00]Release 3.10.2015, Version 2.3.3:[/color][/size][/b]\r<br />\r<br />- fixed widgets not fading in when pressing hotkey under heavy script latency\r<br />- fixed weight feature ending to work after hunger status got updated...I&#39;m sorry for this mess...turns out weight is a hard nut to crack\r<br />- fixed sleep widget showing up when sleep status gets updated\r<br />- fixed weight update status get showen every new interval instead of every new weight update\r<br />\r<br />[size=4][b][color=#00FF00]Release 1.10.2015, Version 2.3.2:[/color][/size][/b]\r<br />\r<br />- fixed RegisterForSingleUpdate() position in hunger script, potentially messing up the weight code\r<br />- removed code related to returning your weight to default values, when disabling the weight feature...obsolete, since you can manually use MCM option to reset weight to your liking\r<br />- added MCM check to remove weight spells when unchecking weight feature in MCM\r<br />- fixed weight feature still active when turned off\r<br />- weight spells will now get removed if the needs are deactivated\r<br />- fixed being warped to cell entrance when animation played ontop of another...thanks to Axonis for pointing this out...I&#39;ve copypastaed his fix...please verify if it works, and if I nailed all animations\r<br />- removed the no USKP version for good...do not ask for it...I just haven&#39;t error checked the no USKP version before...using it is not recommended at all...if you refuse to use the USKP patch then it&#39;s your fault...I repeat...DO NOT ASK FOR IT&#33;\r<br />\r<br />[size=4][b][color=#00FF00]Release 9.9.2015, Version 2.3.1:[/color][/size][/b]\r<br />\r<br />- fixed occasionally getting switched to skinny spell causing the fast weapon bug\r<br />- weapon speed on weight state skinny is now 30% instead of 10.00 ( which equals 1000%)...I&#39;m sorry for the mess...:D\r<br />\r<br />[size=4][b][color=#00FF00]Release 7.9.2015, Version 2.3:[/color][/size][/b]\r<br />\r<br />- added check for first game start or starting mod on existing savegame to apply default weight when turning of weight feature...this requires new game start for people already have another version installed...I&#39;m sorry\r<br />- when turning off weight feature, player weight will now default to the value you had before installing this Mod...this shouldn&#39;t bother you if you never had it enabled though\r<br />- fixed game breaking bug that lets you flying on your horse for the lulz\r<br />- added MCM option to customize player weight (if you turn off weight feature, you want to customize this to your liking after turning off weight feature)\r<br />- weight change now has effects on your attributes (buffs and detrimentals)\r<br />- fixed weight widget not showing correct value when weight is 0.0\r<br />- fixed weight occasinally dropping to 0 when new weight is calculated\r<br />- reworked the weight deduction formular: when starving you will lose ~ 1.5 - 2.0 kg per 24 hours (with weight threshold set to 1.0)\r<br />- weight gets now displayed as number on the widget in real life kilograms\r<br />- weight now gets exactly displayed from a range of 100-50 kg on widget and text notification...formula: (weight + 100) * 0.5, so if your game engine weight is 100 it equals &#34;real life&#34; 100, if it is 0, it equals 50\r<br />\r<br />A little side note on this...A fully trained bodybuilder, lets take Arnold Schwarzenegger as example, has 108 kg at 1,88 m...so a range from 100-50 kg weight display is practical, realistic and immersive, given that the Dragonborn doesn&#39;t necessarily look like a full trained bodybuilder when muscular? Give your opinion on this what range of weight do you find appropriate?\r<br />\r<br />- restyled the weight notification to reflect the new information: &#34;Your weight is xx kg&#34;\r<br />- fixed typo in resting feature description\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2015, Version 2.2.1:[/color][/size][/b]\r<br />\r<br />- fixed weight widget settings not baking into FISS.xml\r<br />- fixed missing update on weight widget\r<br />- fixed new hotkey functions firing when in menu, on mount, swimming etc.\r<br />- fixed widgets not updating when entering any crafting menu\r<br />- fixed being forced to leave the crafting menu when exiting tutorial note\r<br />- reworked the rest function: only one animation, no more update code\r<br />- weight notification gets showen now only when first person messages are enabled\r<br />- added mcm option to turn on/off weight feature\r<br />- removed config tip in MCM for needs\r<br />- added point per hour text to mcm needs sliders as replacement for tip removement\r<br />\r<br />[size=4][b][color=#00FF00]Release 31.8.2015, Version 2.2:[/color][/size][/b]\r<br />\r<br />- fixed seconds text display at auto update interval\r<br />- fixed update timer configuration not correctly working\r<br />- added &#34;auto fade&#34; option for wigets, toggleable in MCM menu. It will have a 10 second timer before fading out, eating, drinking and sleeping will each individually fade in the widgets...however, you can only choose to fade all of them, or leave them static, as I didn&#39;t see a reason why people want a mixture of static/fading widgets?\r<br />- death hounds dropping rotten flesh instead of raw meat now\r<br />- added missing &#34;VendorItemFood&#34; keyword to all default and RNAD food items\r<br />- added function to allow customization of food/drinks that is not default or RNAD food/drink, via hotkey(configure hotkey in MCM)...you will need to do this only once for every third party Mod food item, as the base object will be modified, not the reference...this is virutally compatible with exceptionally every Mod that imports foods/drinks\r<br />- when customizing food items with hotkey, their name will also change accordingly...however, this does only work for the current game session and can not be baken into savegames...technically it&#39;s possible to do this via maintenance script, but since you had to maintain every single food object from every third party Mod, this is virtualy impossible (unless I found a solution in future updates...;) )\r<br />- eating customized food will feed you accordingly to the &#34;food class&#34; you&#39;ve added the food item to\r<br />- customized beverages will all have the same thirst satisfying factor (70, normal drinks)\r<br />- drinking customized alcohol beverages will now make you drunk\r<br />- added hotkey to fade in widgets, this will only work with fading widgets, static widgets stay untouched\r<br />- fixed text for mcm toggle inebriation counter\r<br />- moved some mcm toggle functions to the toggle page to make room for hotkeys\r<br />- added a mcm toggle option to turn off carry weight penalty when tired or starving (this is a cheat you scumback...:) )...notice that this will wrok only when your hunger/sleep state changes...so if you&#39;re planing to continously turn this feature on/off, know that this doesn&#39;t work instantly, the corresponding hunger/sleep spell has first to be applied to the player\r<br />- give name to all campfires, embers and giant campfires, as well as other fireplaces to make them interactable\r<br />- added mcm toggle option to allow grilling raw food on campfire and embers...this will cover meats, leeks and potatoes from vanilla and Realistic Wildlife...support for other Mods may follow in future...this will work on moveable statics only, if you stumble over a campfire that doesn&#39;t work, then this a static campfire...;)\r<br />- added fully functional weight system based on what you eat...visually gain/lose weight, fully MCM confirgurable and also comes with a nice widget...in case you do not understand what this means, this is extraordinary and unique feature to this Mod...you will have an optical effect on your character that will get thinner if you do not eat, and gain weight if you are satiated...this might be enriched in future updates, f.e I&#39;d like to see my character evolving a belly if he eats to much\r<br />- modified the sleep/waiting menu to allow for better view\r<br />- renamed the text for sleeping/waiting to create better immersion (fully translatable)\r<br />- added hotkey to &#34;replace&#34; waiting feature with a &#34;resting&#34; feature...during resting you will get tired half as fast\r<br />- added colored widgets to be used with [url=http://www.nexusmods.com/skyrim/mods/59361]Widget Mod[/url]\r<br />- fixed messed up master load order\r<br />- fixed all FOMOD installer related problems\r<br />- cleaned the plugin\r<br />- added version that doesn&#39;t need the USKP patch...this is the default core file now\r<br />- added missing translation text for previous version...note to translators: things you still need to translate manually\r<br />\r<br />1. RNDConfigQuest -&gt; RND_SkyUIMCMScript -&gt; all text inside &#34;Debug.Messagebox(&#34;&#34;)&#34; functions...plus also all mcm related text inside the script that isn&#39;t covered by the realisticneedsanddiseases_english.txt, like for example the sec. behind the update timer interval\r<br />2. all text inside the message type &#34;RND_CustomizeFoodMessage&#34;\r<br />\r<br />...if there are still missing translation parts, let me know in the comment section...;)\r<br />\r<br />[size=4][b][color=#00FF00]Release 23.8.2015, Version 2.1:[/color][/size][/b]\r<br />\r<br />- if you buy drinks from innkeepers they will verbaly respond with &#39;of course&#39; now...note that this is not the same as the Mod &#34;RNAD Of Course&#34;, as I was merely adding shared responses to all innkeepers, while the creator of &#39;Of Course&#39; added responses to every single dialogue for every single possible NPC type, making it necessary to pack 7 megabytes of voicefiles in the download package. I you happen to have this Mod installed...you do no longer need it&#33;\r<br />- you can fill waterskins and empty bottles for river water at any well, waterwheel and trough, water needs to be boiled in order to drink without getting disease\r<br />- added name to waterwheels in order to make them interactable\r<br />- replaced all vanilla wells with activator versions, so you can activate them to get water\r<br />- replaced all vanilla troughs with activator versions, so you can activate them to get water\r<br />- in order to make use of the &#39;get water from wells and trough&#39; feature you&#39;ll need to activate it from inside the MCM menu, once activated you&#39;ll be given a invisible perk that handles all the mechanics\r<br />- when deactivating the Mod in MCM, the perk will get removed and the get water from well feature is turned off\r<br />\r<br />sidenote: given how many types of wells, troughs and waterwheels there are in Skyrim, I decided against adding new water sources in order to lower navmesh bugs and raise compatibility...if for any reason you feel there are not enough water sources, let me know...;) also, if you had previously Mods installed that deal with adding new water sources, you will likely want to deinstall those...I see there is [url=http://www.nexusmods.com/skyrim/mods/38507/?]Collect Water from Wells[/url], but the creator uses a different approach by adding invisble activators, while I completely replaced any statics with activator versions and utilize a perk for the mechanics, so this Mod is incompatible...you do no longer need it...;) also, the well in Whiterun is no well, it&#39;s a static road that has a well integrated into its model.\r<br />\r<br />- fixed inebriation widget not correctly updating when wasted/drunk\r<br />- added localization for all new content so translators have a more easy job, in the plugin things to translate: 1 new perk(RND_WaterWellPerk), 5 new activators(Rnd_Well02-06)...the messagebox text when having no waterskin or bottle in inventory on activating water source needs to be manually translated by editing the script from inside the creation kit, the same is true for any other text utilized by Debug.Messagebox(like the one in the MCM menu script)...sorry, no other way to do it...;)\r<br />- fixed FOMOD installer version\r<br />\r<br />[size=4][b][color=#00FF00]Release 22.8.2015, Version 2.0:[/color][/size][/b]\r<br />\r<br />initial release:\r<br />\r<br />- added widget support for hunger, thirst, sleep and inebriation\r<br />- all widgets are configurable in the MCM menu: position, size, transparency, turn on/off\r<br />- added FISS support for easy widget preset save/load\r<br />- configure auto update interval for widgets <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Realistic%20Needs%20and%20Diseases%202.0-78785-2-3-4.7z?fid=1000221058&ttl=1535867492&ri=8192&rs=8192&setec=24360cb8b5d84c41ddfb3aaae9d7280d"
    },
    {
      "fileId": "1000221059",
      "name": "RNAD - FISS settings",
      "version": "2.3.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "RNAD - FISS settings-78785-2-3-4.7z",
      "uploadedUnix": "1474104161",
      "modVersion": "2.3.4",
      "virusScanUrl": "https://www.virustotal.com/file/5df0fc1e7cf8d6ac2f571ec9a4fc00bd600193e7e83471293228d0a848b3b52f/analysis/1474104182/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release ?.?.2015, Version ?:[/color][/size][/b]\r<br />\r<br />- fixed problems related to setting up the widget via anchors...translators need to manually translate the MCM anchor names\r<br />- added missing anchor definition for weight widget, thus rendered positioning with anchor not working\r<br />- fixed error log issue related to assigning the wrong anchor alias, and thus rendering the anchor for weight and inebriation widgets not correctly working\r<br />- lifted Mod to unofficial patch legendary edition\r<br />\r<br />[size=4][b][color=#00FF00]Release 3.10.2015, Version 2.3.3:[/color][/size][/b]\r<br />\r<br />- fixed widgets not fading in when pressing hotkey under heavy script latency\r<br />- fixed weight feature ending to work after hunger status got updated...I&#39;m sorry for this mess...turns out weight is a hard nut to crack\r<br />- fixed sleep widget showing up when sleep status gets updated\r<br />- fixed weight update status get showen every new interval instead of every new weight update\r<br />\r<br />[size=4][b][color=#00FF00]Release 1.10.2015, Version 2.3.2:[/color][/size][/b]\r<br />\r<br />- fixed RegisterForSingleUpdate() position in hunger script, potentially messing up the weight code\r<br />- removed code related to returning your weight to default values, when disabling the weight feature...obsolete, since you can manually use MCM option to reset weight to your liking\r<br />- added MCM check to remove weight spells when unchecking weight feature in MCM\r<br />- fixed weight feature still active when turned off\r<br />- weight spells will now get removed if the needs are deactivated\r<br />- fixed being warped to cell entrance when animation played ontop of another...thanks to Axonis for pointing this out...I&#39;ve copypastaed his fix...please verify if it works, and if I nailed all animations\r<br />- removed the no USKP version for good...do not ask for it...I just haven&#39;t error checked the no USKP version before...using it is not recommended at all...if you refuse to use the USKP patch then it&#39;s your fault...I repeat...DO NOT ASK FOR IT&#33;\r<br />\r<br />[size=4][b][color=#00FF00]Release 9.9.2015, Version 2.3.1:[/color][/size][/b]\r<br />\r<br />- fixed occasionally getting switched to skinny spell causing the fast weapon bug\r<br />- weapon speed on weight state skinny is now 30% instead of 10.00 ( which equals 1000%)...I&#39;m sorry for the mess...:D\r<br />\r<br />[size=4][b][color=#00FF00]Release 7.9.2015, Version 2.3:[/color][/size][/b]\r<br />\r<br />- added check for first game start or starting mod on existing savegame to apply default weight when turning of weight feature...this requires new game start for people already have another version installed...I&#39;m sorry\r<br />- when turning off weight feature, player weight will now default to the value you had before installing this Mod...this shouldn&#39;t bother you if you never had it enabled though\r<br />- fixed game breaking bug that lets you flying on your horse for the lulz\r<br />- added MCM option to customize player weight (if you turn off weight feature, you want to customize this to your liking after turning off weight feature)\r<br />- weight change now has effects on your attributes (buffs and detrimentals)\r<br />- fixed weight widget not showing correct value when weight is 0.0\r<br />- fixed weight occasinally dropping to 0 when new weight is calculated\r<br />- reworked the weight deduction formular: when starving you will lose ~ 1.5 - 2.0 kg per 24 hours (with weight threshold set to 1.0)\r<br />- weight gets now displayed as number on the widget in real life kilograms\r<br />- weight now gets exactly displayed from a range of 100-50 kg on widget and text notification...formula: (weight + 100) * 0.5, so if your game engine weight is 100 it equals &#34;real life&#34; 100, if it is 0, it equals 50\r<br />\r<br />A little side note on this...A fully trained bodybuilder, lets take Arnold Schwarzenegger as example, has 108 kg at 1,88 m...so a range from 100-50 kg weight display is practical, realistic and immersive, given that the Dragonborn doesn&#39;t necessarily look like a full trained bodybuilder when muscular? Give your opinion on this what range of weight do you find appropriate?\r<br />\r<br />- restyled the weight notification to reflect the new information: &#34;Your weight is xx kg&#34;\r<br />- fixed typo in resting feature description\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2015, Version 2.2.1:[/color][/size][/b]\r<br />\r<br />- fixed weight widget settings not baking into FISS.xml\r<br />- fixed missing update on weight widget\r<br />- fixed new hotkey functions firing when in menu, on mount, swimming etc.\r<br />- fixed widgets not updating when entering any crafting menu\r<br />- fixed being forced to leave the crafting menu when exiting tutorial note\r<br />- reworked the rest function: only one animation, no more update code\r<br />- weight notification gets showen now only when first person messages are enabled\r<br />- added mcm option to turn on/off weight feature\r<br />- removed config tip in MCM for needs\r<br />- added point per hour text to mcm needs sliders as replacement for tip removement\r<br />\r<br />[size=4][b][color=#00FF00]Release 31.8.2015, Version 2.2:[/color][/size][/b]\r<br />\r<br />- fixed seconds text display at auto update interval\r<br />- fixed update timer configuration not correctly working\r<br />- added &#34;auto fade&#34; option for wigets, toggleable in MCM menu. It will have a 10 second timer before fading out, eating, drinking and sleeping will each individually fade in the widgets...however, you can only choose to fade all of them, or leave them static, as I didn&#39;t see a reason why people want a mixture of static/fading widgets?\r<br />- death hounds dropping rotten flesh instead of raw meat now\r<br />- added missing &#34;VendorItemFood&#34; keyword to all default and RNAD food items\r<br />- added function to allow customization of food/drinks that is not default or RNAD food/drink, via hotkey(configure hotkey in MCM)...you will need to do this only once for every third party Mod food item, as the base object will be modified, not the reference...this is virutally compatible with exceptionally every Mod that imports foods/drinks\r<br />- when customizing food items with hotkey, their name will also change accordingly...however, this does only work for the current game session and can not be baken into savegames...technically it&#39;s possible to do this via maintenance script, but since you had to maintain every single food object from every third party Mod, this is virtualy impossible (unless I found a solution in future updates...;) )\r<br />- eating customized food will feed you accordingly to the &#34;food class&#34; you&#39;ve added the food item to\r<br />- customized beverages will all have the same thirst satisfying factor (70, normal drinks)\r<br />- drinking customized alcohol beverages will now make you drunk\r<br />- added hotkey to fade in widgets, this will only work with fading widgets, static widgets stay untouched\r<br />- fixed text for mcm toggle inebriation counter\r<br />- moved some mcm toggle functions to the toggle page to make room for hotkeys\r<br />- added a mcm toggle option to turn off carry weight penalty when tired or starving (this is a cheat you scumback...:) )...notice that this will wrok only when your hunger/sleep state changes...so if you&#39;re planing to continously turn this feature on/off, know that this doesn&#39;t work instantly, the corresponding hunger/sleep spell has first to be applied to the player\r<br />- give name to all campfires, embers and giant campfires, as well as other fireplaces to make them interactable\r<br />- added mcm toggle option to allow grilling raw food on campfire and embers...this will cover meats, leeks and potatoes from vanilla and Realistic Wildlife...support for other Mods may follow in future...this will work on moveable statics only, if you stumble over a campfire that doesn&#39;t work, then this a static campfire...;)\r<br />- added fully functional weight system based on what you eat...visually gain/lose weight, fully MCM confirgurable and also comes with a nice widget...in case you do not understand what this means, this is extraordinary and unique feature to this Mod...you will have an optical effect on your character that will get thinner if you do not eat, and gain weight if you are satiated...this might be enriched in future updates, f.e I&#39;d like to see my character evolving a belly if he eats to much\r<br />- modified the sleep/waiting menu to allow for better view\r<br />- renamed the text for sleeping/waiting to create better immersion (fully translatable)\r<br />- added hotkey to &#34;replace&#34; waiting feature with a &#34;resting&#34; feature...during resting you will get tired half as fast\r<br />- added colored widgets to be used with [url=http://www.nexusmods.com/skyrim/mods/59361]Widget Mod[/url]\r<br />- fixed messed up master load order\r<br />- fixed all FOMOD installer related problems\r<br />- cleaned the plugin\r<br />- added version that doesn&#39;t need the USKP patch...this is the default core file now\r<br />- added missing translation text for previous version...note to translators: things you still need to translate manually\r<br />\r<br />1. RNDConfigQuest -&gt; RND_SkyUIMCMScript -&gt; all text inside &#34;Debug.Messagebox(&#34;&#34;)&#34; functions...plus also all mcm related text inside the script that isn&#39;t covered by the realisticneedsanddiseases_english.txt, like for example the sec. behind the update timer interval\r<br />2. all text inside the message type &#34;RND_CustomizeFoodMessage&#34;\r<br />\r<br />...if there are still missing translation parts, let me know in the comment section...;)\r<br />\r<br />[size=4][b][color=#00FF00]Release 23.8.2015, Version 2.1:[/color][/size][/b]\r<br />\r<br />- if you buy drinks from innkeepers they will verbaly respond with &#39;of course&#39; now...note that this is not the same as the Mod &#34;RNAD Of Course&#34;, as I was merely adding shared responses to all innkeepers, while the creator of &#39;Of Course&#39; added responses to every single dialogue for every single possible NPC type, making it necessary to pack 7 megabytes of voicefiles in the download package. I you happen to have this Mod installed...you do no longer need it&#33;\r<br />- you can fill waterskins and empty bottles for river water at any well, waterwheel and trough, water needs to be boiled in order to drink without getting disease\r<br />- added name to waterwheels in order to make them interactable\r<br />- replaced all vanilla wells with activator versions, so you can activate them to get water\r<br />- replaced all vanilla troughs with activator versions, so you can activate them to get water\r<br />- in order to make use of the &#39;get water from wells and trough&#39; feature you&#39;ll need to activate it from inside the MCM menu, once activated you&#39;ll be given a invisible perk that handles all the mechanics\r<br />- when deactivating the Mod in MCM, the perk will get removed and the get water from well feature is turned off\r<br />\r<br />sidenote: given how many types of wells, troughs and waterwheels there are in Skyrim, I decided against adding new water sources in order to lower navmesh bugs and raise compatibility...if for any reason you feel there are not enough water sources, let me know...;) also, if you had previously Mods installed that deal with adding new water sources, you will likely want to deinstall those...I see there is [url=http://www.nexusmods.com/skyrim/mods/38507/?]Collect Water from Wells[/url], but the creator uses a different approach by adding invisble activators, while I completely replaced any statics with activator versions and utilize a perk for the mechanics, so this Mod is incompatible...you do no longer need it...;) also, the well in Whiterun is no well, it&#39;s a static road that has a well integrated into its model.\r<br />\r<br />- fixed inebriation widget not correctly updating when wasted/drunk\r<br />- added localization for all new content so translators have a more easy job, in the plugin things to translate: 1 new perk(RND_WaterWellPerk), 5 new activators(Rnd_Well02-06)...the messagebox text when having no waterskin or bottle in inventory on activating water source needs to be manually translated by editing the script from inside the creation kit, the same is true for any other text utilized by Debug.Messagebox(like the one in the MCM menu script)...sorry, no other way to do it...;)\r<br />- fixed FOMOD installer version\r<br />\r<br />[size=4][b][color=#00FF00]Release 22.8.2015, Version 2.0:[/color][/size][/b]\r<br />\r<br />initial release:\r<br />\r<br />- added widget support for hunger, thirst, sleep and inebriation\r<br />- all widgets are configurable in the MCM menu: position, size, transparency, turn on/off\r<br />- added FISS support for easy widget preset save/load\r<br />- configure auto update interval for widgets <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RNAD%20-%20FISS%20settings-78785-2-3-4.7z?fid=1000221059&ttl=1535867492&ri=8192&rs=8192&setec=605c9c7ab71ead85e91c8ecfe9d31f0e"
    },
    {
      "fileId": "1000221060",
      "name": "Complete source",
      "version": "2.3.4",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "4706",
      "fileName": "Complete source-78785-2-3-4.7z",
      "uploadedUnix": "1474104189",
      "modVersion": "2.3.4",
      "virusScanUrl": "https://www.virustotal.com/file/a0ed0006ab07b4f2b088b10054a7a0027ca061387af1673ab3765678f4cb1c02/analysis/1474104243/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release ?.?.2015, Version ?:[/color][/size][/b]\r<br />\r<br />- fixed problems related to setting up the widget via anchors...translators need to manually translate the MCM anchor names\r<br />- added missing anchor definition for weight widget, thus rendered positioning with anchor not working\r<br />- fixed error log issue related to assigning the wrong anchor alias, and thus rendering the anchor for weight and inebriation widgets not correctly working\r<br />- lifted Mod to unofficial patch legendary edition\r<br />\r<br />[size=4][b][color=#00FF00]Release 3.10.2015, Version 2.3.3:[/color][/size][/b]\r<br />\r<br />- fixed widgets not fading in when pressing hotkey under heavy script latency\r<br />- fixed weight feature ending to work after hunger status got updated...I&#39;m sorry for this mess...turns out weight is a hard nut to crack\r<br />- fixed sleep widget showing up when sleep status gets updated\r<br />- fixed weight update status get showen every new interval instead of every new weight update\r<br />\r<br />[size=4][b][color=#00FF00]Release 1.10.2015, Version 2.3.2:[/color][/size][/b]\r<br />\r<br />- fixed RegisterForSingleUpdate() position in hunger script, potentially messing up the weight code\r<br />- removed code related to returning your weight to default values, when disabling the weight feature...obsolete, since you can manually use MCM option to reset weight to your liking\r<br />- added MCM check to remove weight spells when unchecking weight feature in MCM\r<br />- fixed weight feature still active when turned off\r<br />- weight spells will now get removed if the needs are deactivated\r<br />- fixed being warped to cell entrance when animation played ontop of another...thanks to Axonis for pointing this out...I&#39;ve copypastaed his fix...please verify if it works, and if I nailed all animations\r<br />- removed the no USKP version for good...do not ask for it...I just haven&#39;t error checked the no USKP version before...using it is not recommended at all...if you refuse to use the USKP patch then it&#39;s your fault...I repeat...DO NOT ASK FOR IT&#33;\r<br />\r<br />[size=4][b][color=#00FF00]Release 9.9.2015, Version 2.3.1:[/color][/size][/b]\r<br />\r<br />- fixed occasionally getting switched to skinny spell causing the fast weapon bug\r<br />- weapon speed on weight state skinny is now 30% instead of 10.00 ( which equals 1000%)...I&#39;m sorry for the mess...:D\r<br />\r<br />[size=4][b][color=#00FF00]Release 7.9.2015, Version 2.3:[/color][/size][/b]\r<br />\r<br />- added check for first game start or starting mod on existing savegame to apply default weight when turning of weight feature...this requires new game start for people already have another version installed...I&#39;m sorry\r<br />- when turning off weight feature, player weight will now default to the value you had before installing this Mod...this shouldn&#39;t bother you if you never had it enabled though\r<br />- fixed game breaking bug that lets you flying on your horse for the lulz\r<br />- added MCM option to customize player weight (if you turn off weight feature, you want to customize this to your liking after turning off weight feature)\r<br />- weight change now has effects on your attributes (buffs and detrimentals)\r<br />- fixed weight widget not showing correct value when weight is 0.0\r<br />- fixed weight occasinally dropping to 0 when new weight is calculated\r<br />- reworked the weight deduction formular: when starving you will lose ~ 1.5 - 2.0 kg per 24 hours (with weight threshold set to 1.0)\r<br />- weight gets now displayed as number on the widget in real life kilograms\r<br />- weight now gets exactly displayed from a range of 100-50 kg on widget and text notification...formula: (weight + 100) * 0.5, so if your game engine weight is 100 it equals &#34;real life&#34; 100, if it is 0, it equals 50\r<br />\r<br />A little side note on this...A fully trained bodybuilder, lets take Arnold Schwarzenegger as example, has 108 kg at 1,88 m...so a range from 100-50 kg weight display is practical, realistic and immersive, given that the Dragonborn doesn&#39;t necessarily look like a full trained bodybuilder when muscular? Give your opinion on this what range of weight do you find appropriate?\r<br />\r<br />- restyled the weight notification to reflect the new information: &#34;Your weight is xx kg&#34;\r<br />- fixed typo in resting feature description\r<br />\r<br />[size=4][b][color=#00FF00]Release 6.9.2015, Version 2.2.1:[/color][/size][/b]\r<br />\r<br />- fixed weight widget settings not baking into FISS.xml\r<br />- fixed missing update on weight widget\r<br />- fixed new hotkey functions firing when in menu, on mount, swimming etc.\r<br />- fixed widgets not updating when entering any crafting menu\r<br />- fixed being forced to leave the crafting menu when exiting tutorial note\r<br />- reworked the rest function: only one animation, no more update code\r<br />- weight notification gets showen now only when first person messages are enabled\r<br />- added mcm option to turn on/off weight feature\r<br />- removed config tip in MCM for needs\r<br />- added point per hour text to mcm needs sliders as replacement for tip removement\r<br />\r<br />[size=4][b][color=#00FF00]Release 31.8.2015, Version 2.2:[/color][/size][/b]\r<br />\r<br />- fixed seconds text display at auto update interval\r<br />- fixed update timer configuration not correctly working\r<br />- added &#34;auto fade&#34; option for wigets, toggleable in MCM menu. It will have a 10 second timer before fading out, eating, drinking and sleeping will each individually fade in the widgets...however, you can only choose to fade all of them, or leave them static, as I didn&#39;t see a reason why people want a mixture of static/fading widgets?\r<br />- death hounds dropping rotten flesh instead of raw meat now\r<br />- added missing &#34;VendorItemFood&#34; keyword to all default and RNAD food items\r<br />- added function to allow customization of food/drinks that is not default or RNAD food/drink, via hotkey(configure hotkey in MCM)...you will need to do this only once for every third party Mod food item, as the base object will be modified, not the reference...this is virutally compatible with exceptionally every Mod that imports foods/drinks\r<br />- when customizing food items with hotkey, their name will also change accordingly...however, this does only work for the current game session and can not be baken into savegames...technically it&#39;s possible to do this via maintenance script, but since you had to maintain every single food object from every third party Mod, this is virtualy impossible (unless I found a solution in future updates...;) )\r<br />- eating customized food will feed you accordingly to the &#34;food class&#34; you&#39;ve added the food item to\r<br />- customized beverages will all have the same thirst satisfying factor (70, normal drinks)\r<br />- drinking customized alcohol beverages will now make you drunk\r<br />- added hotkey to fade in widgets, this will only work with fading widgets, static widgets stay untouched\r<br />- fixed text for mcm toggle inebriation counter\r<br />- moved some mcm toggle functions to the toggle page to make room for hotkeys\r<br />- added a mcm toggle option to turn off carry weight penalty when tired or starving (this is a cheat you scumback...:) )...notice that this will wrok only when your hunger/sleep state changes...so if you&#39;re planing to continously turn this feature on/off, know that this doesn&#39;t work instantly, the corresponding hunger/sleep spell has first to be applied to the player\r<br />- give name to all campfires, embers and giant campfires, as well as other fireplaces to make them interactable\r<br />- added mcm toggle option to allow grilling raw food on campfire and embers...this will cover meats, leeks and potatoes from vanilla and Realistic Wildlife...support for other Mods may follow in future...this will work on moveable statics only, if you stumble over a campfire that doesn&#39;t work, then this a static campfire...;)\r<br />- added fully functional weight system based on what you eat...visually gain/lose weight, fully MCM confirgurable and also comes with a nice widget...in case you do not understand what this means, this is extraordinary and unique feature to this Mod...you will have an optical effect on your character that will get thinner if you do not eat, and gain weight if you are satiated...this might be enriched in future updates, f.e I&#39;d like to see my character evolving a belly if he eats to much\r<br />- modified the sleep/waiting menu to allow for better view\r<br />- renamed the text for sleeping/waiting to create better immersion (fully translatable)\r<br />- added hotkey to &#34;replace&#34; waiting feature with a &#34;resting&#34; feature...during resting you will get tired half as fast\r<br />- added colored widgets to be used with [url=http://www.nexusmods.com/skyrim/mods/59361]Widget Mod[/url]\r<br />- fixed messed up master load order\r<br />- fixed all FOMOD installer related problems\r<br />- cleaned the plugin\r<br />- added version that doesn&#39;t need the USKP patch...this is the default core file now\r<br />- added missing translation text for previous version...note to translators: things you still need to translate manually\r<br />\r<br />1. RNDConfigQuest -&gt; RND_SkyUIMCMScript -&gt; all text inside &#34;Debug.Messagebox(&#34;&#34;)&#34; functions...plus also all mcm related text inside the script that isn&#39;t covered by the realisticneedsanddiseases_english.txt, like for example the sec. behind the update timer interval\r<br />2. all text inside the message type &#34;RND_CustomizeFoodMessage&#34;\r<br />\r<br />...if there are still missing translation parts, let me know in the comment section...;)\r<br />\r<br />[size=4][b][color=#00FF00]Release 23.8.2015, Version 2.1:[/color][/size][/b]\r<br />\r<br />- if you buy drinks from innkeepers they will verbaly respond with &#39;of course&#39; now...note that this is not the same as the Mod &#34;RNAD Of Course&#34;, as I was merely adding shared responses to all innkeepers, while the creator of &#39;Of Course&#39; added responses to every single dialogue for every single possible NPC type, making it necessary to pack 7 megabytes of voicefiles in the download package. I you happen to have this Mod installed...you do no longer need it&#33;\r<br />- you can fill waterskins and empty bottles for river water at any well, waterwheel and trough, water needs to be boiled in order to drink without getting disease\r<br />- added name to waterwheels in order to make them interactable\r<br />- replaced all vanilla wells with activator versions, so you can activate them to get water\r<br />- replaced all vanilla troughs with activator versions, so you can activate them to get water\r<br />- in order to make use of the &#39;get water from wells and trough&#39; feature you&#39;ll need to activate it from inside the MCM menu, once activated you&#39;ll be given a invisible perk that handles all the mechanics\r<br />- when deactivating the Mod in MCM, the perk will get removed and the get water from well feature is turned off\r<br />\r<br />sidenote: given how many types of wells, troughs and waterwheels there are in Skyrim, I decided against adding new water sources in order to lower navmesh bugs and raise compatibility...if for any reason you feel there are not enough water sources, let me know...;) also, if you had previously Mods installed that deal with adding new water sources, you will likely want to deinstall those...I see there is [url=http://www.nexusmods.com/skyrim/mods/38507/?]Collect Water from Wells[/url], but the creator uses a different approach by adding invisble activators, while I completely replaced any statics with activator versions and utilize a perk for the mechanics, so this Mod is incompatible...you do no longer need it...;) also, the well in Whiterun is no well, it&#39;s a static road that has a well integrated into its model.\r<br />\r<br />- fixed inebriation widget not correctly updating when wasted/drunk\r<br />- added localization for all new content so translators have a more easy job, in the plugin things to translate: 1 new perk(RND_WaterWellPerk), 5 new activators(Rnd_Well02-06)...the messagebox text when having no waterskin or bottle in inventory on activating water source needs to be manually translated by editing the script from inside the creation kit, the same is true for any other text utilized by Debug.Messagebox(like the one in the MCM menu script)...sorry, no other way to do it...;)\r<br />- fixed FOMOD installer version\r<br />\r<br />[size=4][b][color=#00FF00]Release 22.8.2015, Version 2.0:[/color][/size][/b]\r<br />\r<br />initial release:\r<br />\r<br />- added widget support for hunger, thirst, sleep and inebriation\r<br />- all widgets are configurable in the MCM menu: position, size, transparency, turn on/off\r<br />- added FISS support for easy widget preset save/load\r<br />- configure auto update interval for widgets <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Complete%20source-78785-2-3-4.7z?fid=1000221060&ttl=1535867493&ri=8192&rs=8192&setec=76bafc491c4162f57d64d8789c174629"
    }
  ]
}