{
  "modId": 78875.0,
  "modName": "Markarth Vampire Court",
  "summary": "This mod replaces the Vlindrel Hall in Markarth. \r<br />Its not completed, but it&#39;s functional. There might be some wonkiness in some areas and some other things not working as intended. \r<br />Use at your own risk. ",
  "descriptionHtml": "[b]I have since long abandoned Skyrim, modding for Skyrim and the world of Nirn. But someone asked me to upload this from an old screenshot of it so I thought, why not? [/b]\r<br />\r<br />I always felt that as a vampire you coud only live in one place, Castle Volkhiar. I wanted to change that and most places I found was either gory bloddy places looking like torture chambers. Instead I wanted to incorporate the story from the game in a player home somehow. I wanted to make something that could be used from a RP perspective so I started to do some reasearch. \r<br />\r<br />Obviously there are a lot lore to consider, and myself I have always had a fascination for ancient Egypt (who doesn&#39;t like pyramids and egypt gods?). Hammerfel is the closest to that you could come and there are quite some nice Hammerfel inspired clothing out there. There are also some vampire clans in Hammerfal and since there are a lot of warriors from Hammerfel in Skyrim, why no vampires also? Yu may view it as a vampire turf war&#33; :)\r<br />\r<br />Anyway, the idea behind the mod was to add some hammerfal warriors outside Markarth, a small &#34;trading outpost&#34; close to the khajit camping spot. I wanted to add one NPC that would, if you talked to him/her, give you a note and a key to a place in Markarth. The Markarth Vampire Court. That would be a house with some vampires, some hammerfel warrior thralls and you. \r<br />\r<br />[b][color=#cc0000]What you need to know[/color]\r<br />[/b]Well, I built a house, it will replace Vlindrel Hall.\r<br />It will have no crafting stations, there are plenty of those around anyway.\r<br />It will contain what&#39;s in the pictures though, minus NPC&#39;s. \r<br />Some of the pictures will show NPC&#39;s in various positions, they are &#34;activators&#34; in the mod.\r<br />There will be some wonkiness in the house because the mod was never completed.\r<br />There are some safe storage.\r<br />A coffin or two to sleep in and a bed.\r<br />There are no custom stuff in it.\r<br />The house is navmeshed.\r<br />You probably needs both Dawnguard, Dragonborn and Heartfire for it tow ork properly.\r<br />\r<br />I have changed nothing on the outside, except for I might have hidden the key just outside the door, I don&#39;t remember if I did it or not.\r<br />\r<br />Looks best with some kind of lignting mod&#33;\r<br />\r<br />Whit that said..\r<br />\r<br />[color=#cc0000][b]USE AT YOUR OWN RISK&#33;[/b]\r<br />\r<br />[/color][b][color=#cc0000]THERE IS NO SUPPORT WHAT SO EVER FROM ME ON THIS MOD.[/color]\r<br />[/b]However, if you want to complete it or use it, or make changes to it and feel you can complete it, feel free to do it. Just credit me in the end. And shoot me a message so I can at least have a look at your finished work&#33; :)",
  "categoryId": "67",
  "version": "1",
  "author": "wkstrm",
  "createdUnix": "1474471706",
  "updatedUnix": "1474456676",
  "containsAdultContent": false,
  "uploadedBy": "wkstrm",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000221581",
      "name": "Markarth Vampire Court",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "Markarth Vampire Court-78875-.rar",
      "uploadedUnix": "1474456676",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/c4c17fb311332442a7623205ac703a76d2b054c11a49ac2ef1adaa624017b84d/analysis/1474456682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Markarth%20Vampire%20Court-78875-.rar?fid=1000221581&ttl=1535867577&ri=8192&rs=8192&setec=912233d0e78727dd13a45e19d6b51b46"
    }
  ]
}