{
  "modId": 78888.0,
  "modName": "The Forgemasters Warforge",
  "summary": "This mod adds a complete forge and crafting room at the Dwemer War Quarters in Blackreach.",
  "descriptionHtml": "[font=Georgia][color=#ff7700][size=4]\r<br />\r<br />I present to you the Forgemasters Warforge, an ancient Dwemer forge located in the depth of Blackreach...\r<br />\r<br />[/size][/color][/font][color=#ffd966]This is a very small mod and hate to use that phrase, but I really did make this for my own convenience and share it with the community in case others like to hang out in Blackreach...\r<br />\r<br />This is really for people who like I said love to spend time in Blackreach or even start a Character in Blackreach via an alternate start mod. I did just that and found the lack of crafting stations very irritating and also nonsensical; you would think that all that metal forged technology of the Dwemer and there would be some remnant of a forge where they actually build the damned things and made their heavy armor.\r<br />The so called &#34;War Quarters&#34; in Blackreach are actually disappointingly empty and offered a logical location for a forge and processing center for ore; so that is what I did and I tried to adapt vanilla crafting stations to look and feel like something the Dwemer might have used.\r<br />The only piece that I did not adapt as such is a tanning rack, but there was some evidence of prior adventurer activity in there (candle placed on a rock ledge) and so I made it look like that is left from an adventurer. There is a knapsack and it is safe for storage&#33; \r<br />The GS version has a simple crafting supplies activator in addition.\r<br />\r<br />I hope you find this a useful addition to your game and enjoy discovering it. There are two complete sets of Dwemer armor around the crafting stations, one plain and the other enchanted at a high level; there are also several plain and enchanted Dwemer weapons about the forge and a bunch of raw material.\r<br />\r<br />COMPATIBILITY: \r<br />The only other mod I know of that uses this space is 3DNPC (Interesting NPCs) and my mod is fully compatible with it; the two mods occupy different areas of the War Quarters.\r<br />\r<br />INSTALLATION:\r<br />Install with your favorite MO and activate in your load order; no DLC required. For the GS version [url=http://www.nexusmods.com/skyrim/mods/18340/?]General Stores[/url] is obviously required.\r<br />\r<br />This mod has been cleaned with TES5Edit; load order does not matter but I recommend you run LOOT after installing it anyway.\r<br />\r<br />CREDIT:\r<br />Thanks to Bethesda for this awesome game and the tools to mod it.\r<br />[/color]",
  "categoryId": "78",
  "version": "V1",
  "author": "Kursan",
  "createdUnix": "1474508613",
  "updatedUnix": "1474509558",
  "containsAdultContent": false,
  "uploadedBy": "Kursan",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000221650",
      "name": "The Forgemasters Forge",
      "version": "V1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "The Forgemasters Forge-78888-V1.zip",
      "uploadedUnix": "1474508608",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/fa65d53d5f958099cb8f620344525319e7822b0783fbbd929948518971300898/analysis/1474508642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Forgemasters%20Forge-78888-V1.zip?fid=1000221650&ttl=1535867586&ri=8192&rs=8192&setec=894fb65fdc55140619713585433b3cf2"
    },
    {
      "fileId": "1000221651",
      "name": "The Forgemasters Forge GS",
      "version": "V1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "The Forgemasters Forge GS-78888-V1.zip",
      "uploadedUnix": "1474509558",
      "modVersion": "V1",
      "virusScanUrl": "https://www.virustotal.com/file/0c09a82dfb1a744a892d4bb5270953459851fb336b0c16fdfe7988e4ba5a1b3d/analysis/1474509602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Forgemasters%20Forge%20GS-78888-V1.zip?fid=1000221651&ttl=1535867586&ri=8192&rs=8192&setec=76296e08605181ca0cc0c9f170f5fc20"
    }
  ]
}