{
  "modId": 78889.0,
  "modName": "Shops Look Like Shops - Updated v1.1",
  "summary": "A mod that adds and changes stuff on shop shelves so it actually looks like a shop.",
  "descriptionHtml": "[i][b]Just letting everyone know I haven&#39;t given up on the mod. Things have been going horribly wrong lately and I just have not had time to work on it. But don&#39;t worry I will be back. I will also be startin from scratch. I have learned some things and changed my mind on some things and it really would be easier to just start over. Now however is the time for suggestions and request. Just post them in the comments.[/b][/i]\r<br />\r<br />\r<br />Ok so basically I was tired of entering a shop and seeing nothing on the shelves but baskets, pots, bowls, random books, and cups. Seriously do people in Skyrim really need that many pots and cups considering how loaded down every house is with them already? And lets not forget all the wasted space in corners full of useless barrels. What I did was add shelves and items that kinda go with the area and arranged things so it looks like you could enter the shop and browse around. This is just a test mod to see if people are interested, wanna make suggestions, leave feedback. I plan to do all the shops in a town at a time so I won&#39;t be skipping around. I will update the file every time I finish a town or shop by shop depending on my time. Sorry for shamelessly inserting my character in random pics but I have to get her in from time to time. Also for the record I have a saturation mod going so thats why my interiors are a little on the orange side. Looks amazing outside though.   \r<br />\r<br />New in version 1.1\r<br />\r<br />Sadri&#39;s Used Wears\r<br />The White Phial\r<br />\r<br />So far I have done\r<br />\r<br />The Riverwood Trader\r<br />War Maidens\r<br />Belethors General Good\r<br />Arcadias Cauldron\r<br />Sadri&#39;s Used Wears\r<br />The White Phial\r<br />\r<br />All DLC required.",
  "categoryId": "69",
  "version": "1.1",
  "author": "GrimKusanagi",
  "createdUnix": "1474510778",
  "updatedUnix": "1474731393",
  "containsAdultContent": false,
  "uploadedBy": "GrimKusanagi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000221863",
      "name": "Shops Look Like Shops 1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Shops Look Like Shops 1.1-78889-1-1.7z",
      "uploadedUnix": "1474731393",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f60a1174ba840b429623c71df20764b30ce5f20481e2b0d6122503241b77a679/analysis/1474731422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shops%20Look%20Like%20Shops%201.1-78889-1-1.7z?fid=1000221863&ttl=1535867588&ri=8192&rs=8192&setec=77afc851e5b75b19ed90fa8d1c694d44"
    }
  ]
}