{
  "modId": 78935.0,
  "modName": "Follower Mod",
  "summary": "A follower overhaul build from scratch inspired by [url=http://www.nexusmods.com/skyrim/mods/14037/?]Ultimate Follower Overhaul[/url]. Lots of new gameplay features, less micromanaging for higher immersion. Widgets, hotkeys, high customization via MCM.",
  "descriptionHtml": "[b][color=#ffff00][center]\r<br />[img]http://static-1.nexusmods.com/15/images/110/4205982-1418560160.png[/img][/center][/color][/b][center][b][color=#ffff00][u][size=5]\r<br />[center][youtube]o1GSuy39Wu8[/youtube][/center]\r<br />[url=http://gamer-mods.ru/load/tes_v_skyrim/gejmplej_i_animacija/upravlenie_kompanonami_follower_mod/16-1-0-2602]Russian Version[/url][/size][/u][/color][/b][/center]\r<br />\r<br />[center][color=#ffff00][u][b][size=5]Requirements[/size][/b][/u][/color][/center]\r<br />\r<br />1.Skyrim with the most actual patch and all DLC&#39;s (1.9.32.8)\r<br />2. Skyrim Script Extender\r<br />3. SkyUI\r<br />4. [url=http://www.nexusmods.com/skyrim/mods/57046/?]UIExtensions(optional)[/url]\r<br />5. [url=http://www.nexusmods.com/skyrim/mods/48265/?]FISS(optional)[/url]\r<br />\r<br />[size=10]How to install[/size]\r<br />\r<br />[color=#00ff00][size=4]Installation with NMM[/size][/color][size=4]:[/size]\r<br />\r<br />1. Press the download with Manager button on the Nexus and confirm the requested programm, or copy paste the url directly to Nexus Mod Manager\r<br />2. Once downloaded open up NMM and click this Mod to import the package.7z\r<br />3. After installation don&#39;t forget to enable the plugin file(s) in your prefered Mod organization tool\r<br />4. Use [url=https://loot.github.io/]L.O.O.T[/url] to automatically sort your load order\r<br />\r<br />[color=#00ff00][size=4]Manual Installation[/size][/color][size=4]:[/size]\r<br />\r<br />1. Download and unzip the file anywhere\r<br />2. Move the .esp and .bsa file(s) (if present) to your &#39;x:&#92;...Skyrim&#92;Data&#39; folder\r<br />3. Choose the patch file(s) (if present) you wish to use and copy to your Data folder\r<br />4. After installation don&#39;t forget to enable the plugin file(s) in your prefered Mod organization tool\r<br />5. Use [url=https://loot.github.io/]L.O.O.T[/url] to automatically get the correct load order\r<br />\r<br />[center][color=#ffff00][u][b][size=5]Important Information[/size][/b][/u][/color][/center]\r<br />\r<br />If you are using a new version of Follower Mod upon an existing character made with FM, make sure to make a clean save before playing on. How to do this? But remember, adding or removing Mods during serious gameplay is a VERY bad idea, no matter what kind of safety measures you&#39;ve prepared.\r<br />\r<br />1. Load your game and find an interior cell, save the game inside\r<br />2. Exit game, turn off the old .esp and load the previously made save, then save again inside\r<br />3. Exit game, install new version, turn on the new .esp, then go into the game and save again\r<br />4. Exit the game once more and then start playing with the clean save\r<br />\r<br />If you happen to have left over script artefacts in your savegames, I recommend using [url=http://www.nexusmods.com/skyrim/mods/52363/?]Script Cleaner[/url].\r<br />\r<br />[center][color=#ffff00][u][b][size=5]Description[/size][/b][/u][/color][/center]\r<br />\r<br />You ever wanted a Follower Mod with lots of features, awesome widgets, hotkey controlable and general convenience that other follower mods couldn&#39;t give you because of refusing to use SKSE, SkyUI and other third party Mods as resource? Well, then this is exactly the follower mod you&#39;ve been looking for. It has all the same basic features then all other prominent follower mods, plus it features complete DLC support, a MCM menu, follower widgets, custom skill and follower magic menu, the option to teach spells and powers to followers, setting their combat style and actor class from a range of 12 shemes, setting their carry weight, speed, aggression, confidence, assistance, morality and skills. It also features hotkeys for trading, commanding (including wait/follow), summoning, relaxing, combat avoidance, follower camera, drawing weapons, showing skills and exchange spells/powers. Widgets will show the name, health, magicka, stamina, carry-/inventory-weight, level and distance to the player. All Widgets are completely configurable via MCM and can also be turned off. They come in two color variations, white and the way I wanted them to be. The widget will also show you if your follower is waiting, relaxing or avoiding combat. Everything&#39;s summed up in a very convenient fashion and I promise it never felt better before. To round it all up from version 0.3 there&#39;s a wage system, configurable in MCM. Followers will now actually want money from you in order to stay with you. Now for in Detail descriptions:\r<br />\r<br />[color=#00ff00][size=4]Follower features:[/size][/color]\r<br />\r<br />- followers want money to stay with you, if you don&#39;t pay them, they&#39;ll leave\r<br />- recruit up to 5 followers\r<br />- followers can be interacted with via dialogue and hotkeys\r<br />- followers can be customized in MCM menu\r<br />- followers can learn spells and powers if their appropriate skill is high enough\r<br />- followers can dual wield\r<br />- followers no longer use default outfits and can be redressed to your liking, they will keep the clothes after dismisal\r<br />- all followers can be married\r<br />- all female followers have female animation\r<br />- occasional changes to follower outfits to make them less overpowered or look more appropriate\r<br />- housecarls will automatically sandbox at your home if not following you\r<br />- followers are now completely quest and area aware, this plays very nicely with Follower Commentary Overhaul\r<br />- followers wil now react to combat near you\r<br />- followers will no longer directly react to combat when the player is sneaking, this plays nicely with Better Stealth AI for Followers\r<br />- followers will use various idle animations when relaxing, sandboxing or not following you\r<br />- followers can relax, avoid combat and summoned\r<br />- follower camera showing the first follower looking at you\r<br />- diverse options for drawing weapon behaviour in MCM and via hotkey\r<br />- you can essentialize, ask for their skills and ignore friendly hits\r<br />- all followers from all DLC&#39;s supported as well as custom followers using vanilla follower system\r<br />- followers can be set to react faster when bumping into them\r<br />- followers will no longer trigger traps\r<br />- followers combat style is configurable in MCM menu\r<br />- followers actor class is configurable in MCM menu\r<br />- a completely customizable combat style for every follower\r<br />- option to make anyone a follower via spell or dialogue, this includes every single follower from every custom mod, yes, even Inigo, Vilja and Hoth\r<br />- dialogue option to make followers put away their torch when sneaking\r<br />- dialogue option for advanced stealth behaviour on followers\r<br />- give followers the light food perk via MC, so they will not trigger traps\r<br />- make any actor level with you by using the provided .bat file, see description further down\r<br />- custom menus to show follower statistics and follower spells/powers\r<br />\r<br />The first question you probably ask is, why only 5 followers, couldn&#39;t you have done more? Yes, I could have done this. The alias system allows up to hundreds of followers, and the way I rescripted the follower framework it would also be easily implementable. But given the fact that any system can barily handle more then 10 followers at best, and playing with so much followers is extremely inconvenient, I decided against it. It&#39;s quality rather then quantity. I also drew inspiration from games like Dragon Age, Dead Souls and old RPG&#39;s like Advanced Dungeons & Dragon Series, or Fallout. The maximum number of followers they allowed where somewhere between 4-6. You never got to gather a whole army behind your back. It&#39;s no fun either, since all the followers would block any entrance and the world around you. The second question you ask may be about why I&#39;m using hotkeys and widgets. Well, I&#39;m no immersion Nazi, but immersion, imho, can only be broken to a certain degree. I deem popping up message menus that unnecessarily pause the game, or complicated dialogue structures as extremely inconvenient, as well as functions that are only rarely used or never used at all. At the same time I wanted to have a convenient way of information and interaction options with followers, hence why I used widgets and hotkeys. If you think widgets and hotkeys break immersion inside a medieval themed world, you may be right, but I deem it even more unimmersive if I&#39;m constantly forced to enter dialogue or message menus to figure what my followers are about. Communication can be non-verbal. Soldiers in silent battle for example, never use any verbal communication. Why not simply think hotkeys like they were signal of hands?\r<br />\r<br />There&#39;s also the option to make anyone a follower by using a lesser power or via dialogue. You&#39;ll need to enable the feature in MCM. Unfortunately some NPC&#39;s are excluded by their voicetypes, and prone to bug out, specially elder people and children. So for now, I don&#39;t recommend recruiting them until I squished this bug. I don&#39;t want to exclude them per se, but if nothing else works, this is what&#39;s going to happen.\r<br />\r<br />About the wage system: This deserves a section on its own. The wage system is completely optional and can be toggled inside the MCM. You can set up the gold amount per hour in the MCM. Default is 1 Gold. It will multiply with the follower count. So if you have 2 followers and a loan count of 3, the amount of payment will raise by 6 Gold every hour, summing to a maximum of 144 Gold per 24 hours(1 day). I recommend using 1 Gold though, or you will be broke faster then Lehman Brothers. It will compare to a threshold, which can also be setup in the MCM. Once the payment amount reaches the threshold, your followers will leave your service...ALL of them, not just one. You can then pay the money to any follower you&#39;ve previously met and again will be able to recruit them. It&#39;s probably a good idea to not even let it come this far, I recommend checking dialogue with them at least once a day (depending on your MCM settings) and pay their loan...specially if you use Needs Mods where you need to sleep. The loan can be payed to all followers following you, but is isn&#39;t counted individualy, to reflect the how the followers group behind you for money. Future updates will import the need for food, drinks and time to relax. Maybe I can even implement a feature where followers are brawling each other for the money and treasures you give them, but for now I want to test out the wage only, to figure if the system is probarly running, and to squish bugs in the process. \r<br />\r<br />\r<br />About using the provided .bat file. Bethesda decided to remove the .setLevel() script function with Skyrim version 1.6, and thus removing any ability to directly customize actor levels via script. There are solutions to &#34;emulate&#34; manually leveling up actors, by raising their attributes/skills, but their actually level never changes. However, you can use a console command to make actors that you recruited as followers, which normally aren&#39;t followers, level up with you, just like the vanilla followers do. You can also customize their skills in MCM beforehand. Just download the provided .bat file and place it inside your Skyrim folder (not Data), then go ingame, open the console , click the follower you want to customize and write...\r<br />\r<br />setlevel 1000 0 1 100\r<br />\r<br />...without quotes. This will make every actor you&#39;ve previously recruited as follower, naturally level up with you.\r<br />\r<br />[color=#00ff00][size=4]MCM Functions:[/size][/color]\r<br />\r<br />- configure all wage related settings\r<br />- better follower response can be toggled\r<br />- vanilla follower draw weapon behaviour can be toggled\r<br />- option to reset all previously configured hotkeys\r<br />- configurable interval for widget information, to unburden poor systems\r<br />- load/save widget layout (thanks to FISS)\r<br />- 7 configurable hotkeys for basic and custom functions\r<br />- individually customize all 5 followers and their widgets\r<br />- choose and customize combat style, attributes, skills, as well as their classes\r<br />- give light food perk to followers\r<br />\r<br />The MCM menu is an awesome tool to customize Mods to your likings. In Follower Mod, it will enable some basic functions, adjust hotkeys and grant you the option to individualize all followers and their Widgets. You&#39;re allowed to configure follower carry weight, their speed and diverse other options, as well as reposition and rescale the Widgets and adjust them how you like it. MCM menu will ONLY work if you have both, SKSE and SkyUi installed, otherwise you&#39;re stuck with the default settings. Never ask to update the Mod for no SKSE and SkyUI version, isntead I ask you to buy all DLC&#39;s, install SKSE and SkyUI, and, if necessary, buy a better computer. Why would anyone even play this game without SKSE and SkyUI nowadays?\r<br />\r<br />[color=#00ff00][size=4]Hotkey Functions:[/size][/color]\r<br />\r<br />- hotkey to trade with all 5 followers without entering any dialogue or menu\r<br />- hotkey to combine wait/follow and command function\r<br />- hotkey to summon all followers\r<br />- hotkey to tell followers to relax\r<br />- hotkey to tell followers to avoid combat\r<br />- hotkey to go into follower camera mode\r<br />- hotkey to make followers draw weapon with you\r<br />\r<br />[color=#ff0000][size=3]Follower Trade Hotkey[/size][color=#cccccc]:[/color][/color] Which follower you do trade with depends on how long you press the key. If you tab the key, you do trade with the first follower, if you hold it 1 second, you&#39;ll do trade with the second follower, if you hold it 2 seconds, you&#39;ll do trade with the third and so on. You will need to be in range of your followers (500 units) to prevent cheating and keep it immersive. If you want to trade with any other then the first follower, don&#39;t be irritated that the first followers inventory will be opened first, this is a vanilla flaw I can&#39;t fix, and once you lift your finge after &gt; 1 secondm the inventory of the corresponding follower will open. \r<br />\r<br />[color=#ff0000][size=3]Follower Wait/Follow Hotkey[/size][/color]: You&#39;ll tap the hotkey once and the follower waits. You tap it again and the follower follows. This will work for all followers following you, not just one. You&#39;ll get a notification when a follower waits or follows you. The corresponding widget will also show your follower in wait stance. \r<br />\r<br />[color=#ff0000][size=3]Follower Command Favor Hotkey[/size][/color]: Basically this uses the same key as the wait/follow hotkey, but you&#39;ll need to hold the key for at least one second and then release it. Upon release of the hotkey the command favor state will be entered by the follower. The longer you press the key, the more followers will be involved in the favor state. So you can make a single follower open a container for you, OR make all followers gangrape a Bandit.\r<br />\r<br />[color=#ff0000][size=3]Follower Summon Hotkey[/size][/color]: Vanilla Followers navigation is flawed. They can&#39;t jump up, climb or move where there&#39;s no Navmesh. This often leads to extremely inconvenient situations, hence why this function is imported. Press they key once and all your followers will be warped to you and placed at your feet.\r<br />\r<br />[color=#ff0000][size=3]Follower Relax/Unrelax (Sandbox) Hotkey[/size][/color]: Works pretty much exactly like the wait/follow hotkey with the difference, that your followers will enter sandbox(relax) mode. Press the key once and your followers relax, press it again and the followers will follow again. You&#39;ll get a notification when followers relax or doesn&#39;t.\r<br />\r<br />[color=#ff0000][size=3]Follower Avoid Combat/Enter Combat Hotkey[/size][/color]: Works like relax hotkey. You&#39;ll get a notification. Press once for followers to ignore combat, press again to make them attack again.\r<br />\r<br />[color=#ff0000][size=3]Follower Camera Hotkey[/size][/color]: Has two functions. When taped shortly will jump to your closest follower, when taped again will jump back to you. If you hold the key for more then one second, it will flip back to you after releasing the key.\r<br />\r<br />[color=#ff0000][size=3]Follower Draw Weapon Hotkey[/size][/color]: This simply makes you and your followers draw weapons. If you draw your weapon with your followers, and then use the default draw weapon key, the feature of followers not automatically drawing weapons with you, will be bypassed. This is not a bug, but intention. You can set it back to default by pressing the follower draw weapon hotkey again. You need to enable the custom draw weapon function inside MCM menu.\r<br />\r<br />[color=#ff0000][size=3]Toggle Follower Widgets[/size][/color]: a hotkey to toggle Follower Widgets on and off. Simple as that.\r<br />\r<br />[color=#ff0000][size=3]Skill Menu Hotkey[/size][/color]: hotkey to activate the follower statistic menu, which can also be accessed via dialogue.\r<br />\r<br />[color=#ff0000][size=3]Magic Menu Hotkey[/size][/color]: hotkey to activate the follower magic menu, which can also be accessed via dialogue.\r<br />\r<br />[color=#00ff00][size=4]Widget Functions:[/size][/color]\r<br />\r<br />The Widgets are one part that make this Mod uniquely stand out. They come in a unique optical flavor. The Widgets will work with IHud by Gopher. Every follower has its own Widget showing name, health, magicka, stamina, inventory-/carry-weight, level and distance to the player. Widgets can be turned off/on, repositioned and their size and transparency changed inside the MCM menu. Distance will be showen in meters. Additionally there&#39;s a Widget for counting the wage you owe to followers. The upper number is the threshold, the lower is the amount of money you owe to them. I should also mention the new menus in version 0.5 showing your followers attribute/skills and the speels they possess, respectively you&#39;ve taught them.\r<br />\r<br />[center][color=#ffff00][size=5][u][b]Known Bugs:[/b][/u][/size][/color][/center]\r<br />\r<br />- no current bugs...please report any bug in the bug section, not the comments, or you will risk to get blocked, if you stay persistent&#33;\r<br />\r<br />[center][color=#ffff00][size=5][u][b]Compatibility:[/b][/u][/size][/color][/center]\r<br />\r<br />- Compatible with: Interesting NPC&#39;s, Immersive Creatures, Follower Commentary Overhaul, Frostfall, Real Needs and Diseases, Convenient Horses, My Home is your Home, Monster Mod, Live another Life, Apocalypse Spells, Thunderchild, Loot&Degradation, Dual Sheath Redux, any body type deriving from CBBE, Enhanced Blood, Immersive Citizens, Immersive Horses, Immersive NPC&#39;s in the Dark, NPC Overhaul, Real Wildlife, Revenge of the Enemies, Run for your Lifes, Tame the Beasts of Skyrim II, When Vampires attack, Ultimate Combat, Violenz, Wintermyst and many more you can find over here...[url=http://www.nexusmods.com/skyrim/mods/68599/?]Click me Hard&#33;[/url]\r<br />\r<br />- Incompatiblities: Ultimate Follower Overhaul, Amazing Follower Tweaks, Extensible Follower Framework, Kuertees Simple Followers.\r<br />\r<br />Tell me if you find more incompatibilities.\r<br />\r<br />[center][color=#ffff00][size=5][u][b]Appendix[/b][/u][/size][/color][/center]\r<br />\r<br />[color=#00ff00][size=4]Planed Features:[/size][/color]\r<br />\r<br />- the only thing that needs further attention is the follower needs feature\r<br />- another thing is giving followers perks via menu\r<br />\r<br />[color=#00ff00][size=4]Credits and Thanks:[/size][/color]\r<br />\r<br />In this case I&#39;ll have to thank Bethesda, the Creation Kit Wiki guys and the Official Forum Guys and especially the whole SkyUI-Team, specifically @Schlangster, @psychosteve and @Mardoxx which granted us the gift of cracking the Skyrim UI code open. Thanks to SKSE-Team as well. You guys rock&#33; Inspiration has been drawn from my long time favorit UFO made by Looki, as well as Dragon Age, Dungeons&Dragons and Dark Souls. Also, thanks to @LordConti2 for making his FISS library which files are partly included inside this Mod. Thanks to him we can easily save/load user presets. A huge thanks to @Atardecer for making the Requiem Patch, and finally I need to give gratitude to @Expired6978 for creating UIExtensions and uploading the source on Github...without him I would have never managed to create custom menus.\r<br />\r<br />[size=7]Enough talk now, lead your followers into battle&#33;[/size]\r<br />\r<br />[color=#00ff00][size=4]DISCLAIMER:[/size][/color]\r<br />\r<br />This software is provided &#39;as-is&#39;, without any express or implied\r<br />warranty. In no event shall the authors be held liable for any damages",
  "categoryId": "24",
  "version": "0.5.1",
  "author": "CrEaToXx",
  "createdUnix": "1474703908",
  "updatedUnix": "1474703735",
  "containsAdultContent": false,
  "uploadedBy": "CrEaToXx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000221836",
      "name": "Follower Mod",
      "version": "0.5.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3749",
      "fileName": "Follower Mod-78935-0-5-1.7z",
      "uploadedUnix": "1474703700",
      "modVersion": "0.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/fd9f0f9d1300afceff79080acce4aece2f9221af6561b0ad04390db3bc69b7e7/analysis/1474703703/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 17.10.2015, Version 0.5.1:[/color][/size][/b]\r<br />\r<br />- fixed various error log problems related to none entries\r<br />- fixed problems with widget anchors and combat styles/classes not working...unfortunately this means localizators have to translate the strings inside the script again...I&#39;m sorry\r<br />- fixed doubling follower notifications in the upper left corner\r<br />- fixed error log problems when using diverse commands on aliasarray instead of actorref\r<br />- fixed follower sneaking and moving to the player when in relax mode and the player is sneaking\r<br />- all follower widgets will round up inventory weight to one digit behind the comma now, for display convenience\r<br />- fixed none error log related to weight change when outfit check is applied\r<br />- forwarded USKP change to companionhousekeepinscript to prevent error log on vilkas sword quest\r<br />- follower stat menu will now show health, stamina, magicka and their respective regeneration rates in numbers instead of %\r<br />- removed celtic_icon.swf...sorry, forgot about that, wasn&#39;t supposed to pack this, data is inside SkyUI anyways\r<br />- follower stats menu will now also show maximum carry weight\r<br />- followers inventory/carry weight will be displayed in trade menu now\r<br />- hidding torches during stealth actions will now also check for lanterns from SI\r<br />- changed position of hotkey reset in MCM\r<br />- added missing notification for draw weapon function\r<br />- added whistle command to all hotkey functions, toggleable in MCM...this respectively means you can now enable your character to give orders by whistling\r<br />- fixed issue related to outfit script producing none inventory errors\r<br />- fixed light foot typo\r<br />- fixed light foot spell not applied correctly because you could not add perks to actors...instead I &#34;hacked&#34; the relevant trap scripts to check for a custom spell, so that pressure plates won&#39;t get activated...if you ask why? simple&#33; I had the choice to either add the perk to all followers in CK, and thus effectively excluding any custom follower, OR had the choice to do it the way I wanted it...so I choose the latter\r<br />- added compatibility scripts for Kryptopyrs Traps are Dangerous Mod\r<br />\r<br />[size=4][b][color=#00FF00]Release 27.09.2015, Version 0.5:[/color][/size][/b]\r<br />\r<br />- divided the MCM and Widget quest scripts, this should have an overall positive effect on various issues people reported, primarly related to widgets and the MCM...this should also fix combat styles/Classes not correctly baking into save, as well as other values that need to be transported via maintenance code...unfortunately this brings another issue...you need to start from a new game or the widgets will go all crazy&#33;&#33;&#33; \r<br />- fixed combat style of third follower greyed out when second follower alias wasn&#39;t filled\r<br />- followers will now hide their torches when sneaking with player if you tell them via dialogue\r<br />- added new dialogue option to make followers stay passive when player moves stealthy\r<br />- fixed occasional bug when dismissing a follower, it wasn&#39;t counting as dimsissed\r<br />- fixed widget still showing last follower when all followers are dismissed\r<br />- improved the appearance of all widgets much...see new screenshots, they all have a customized icon theme similar to old RPG&#39;s like AD&D\r<br />- fixed typos inside AS scripts to create wrong display of status\r<br />- fixed anchor MCM option for fourth and fifth follower widget not working correctly\r<br />- fixed hotkeys not working for non-vanilla followers...this will also fix non working hotkeys for INPC followers and any custom using the vanilla follower framework\r<br />- fixed hotkey trade acting sometimes wonky on first follower\r<br />- fixed wait hotkey not working all the time\r<br />- fixed all hotkeys potentially acting wonky sometimes\r<br />- which follower to command is now dependend on how long you press the command hotkey\r<br />- changed dialogue response when owing money to followers to something more appropriate aka they respond more angry\r<br />- teaching a spell to a follower is now skill level dependend...if the followers skill level in the particular school of magic then the required minimum for the spell you want to teach, the spell can&#39;t be tought\r<br />- fixed not being able to redress followers recruited via the &#34;recruit anyone as follower&#34; dialogue function\r<br />- added missing followers from DLC&#39;s to the list of aliases, so now every single follower is covered 100%\r<br />- fixed followers being naked after dismissal and any other occasion...this needs to be varified, as it was a pain in the ass implementing it, and I&#39;m unsure if it works for every occasion, specifically for followers that not have been recruited via the vanilla system\r<br />- added MCM toggle option to give followers the light food perk so they won&#39;t enable traps\r<br />- removed all extras: INPC-patch no longer needed, use the &#34;recruit all&#34; feature instead, requiem patch obsolete due to increasing incompatibility, white widgets obsolete due to widget improvement\r<br />- added a tag(FM) behind the &#34;recruit all&#34; dialogue so you know it&#39;s the correct dialogue to use from Follower Mod\r<br />- fixed all problems related to &#34;recruit all&#34; feature when recruiting via spell...this will effectively fix all problems related to third party follower mods...you can now safely recruit Inigo, Vilja, Hoth and all NPC&#39;s from Interesting NPC&#39;s...basically you can recruit any humanoid a follower now\r<br />- fixed wrong Erik assigned to follower alias section\r<br />- been searching my ass off finding a solution to compensate the deprecated .setLevel() function via script. There is no solution other then using the console with the command &#34;setlevel 1000 0 1 100&#34; (without quotes) after clicking the corresponding actor. I&#39;ve been searching for this in order to create a way to level up followers that do not have the PC Level Mult enabled, which are primarly those followers that are not followers by default...I&#39;m sorry, unless SKSE imports this setlevel command, there&#39;s nothing I can do...\r<br />- merged follower widget with widget section, and combat style section with follower section to make room for the new MCM follower skill level menus\r<br />- added full fledged attribute and skill customization to MCM menu, covering health, stamina, magicka and all of the 18 skills...you can use it without limits to customize, experiementation or cheating...your choice\r<br />- renamed Uthgerd the Unbroken to simply Uthgerd, due to annoyances with the widget and new menus to display her name\r<br />- added complete customized, hotkey based skill/stats menu for followers, it will inform you about attributes, resistances, combat-skills, stealth-skills and magic skills\r<br />- added hotkey based follower magic menu, both menus are derived from [url=http://www.nexusmods.com/skyrim/mods/57046/?]UiExtensions[/url] by Expired6978\r<br />- adapted skill display and spell teaching dialogue option to new menus\r<br />- first babysteps to create proper localization .txt file for easy translation...this will be forwarded in future versions\r<br />- and before you ask...no, no follower needs feature...I hate it to implement a feature that forces me to permanently micromanage my followers...this is just plain stupid...however, the promised relax feature, forcing you to give followers time to relax, or they will break down and eventually leave your group...this could be made in a fashion that it simulates the needs for food, drinks, sleep and sparetime\r<br />\r<br />[size=4][b][color=#00FF00]Release 24.12.2014, Version 0.4.1:[/color][/size][/b]\r<br />\r<br />- fixed wage counter not toggleable in MCM without having a follower\r<br />- improved Fomod installer\r<br />\r<br />[size=4][b][color=#00FF00]Release 21.12.2014, Version 0.4:[/color][/size][/b]\r<br />\r<br />- added mcm option to toggle &#39;make anyone follower&#39; feature, gives you the ability to make anyone follower via a lesser power or via dialogue\r<br />- removed teach shout feature, due to unfixable occasional savegame crashes, this was critical, I&#39;m sorry for any inconvenience\r<br />- fixed issues with using the widget toggle hotkey not changing menu functions\r<br />- added a completely customizable combat style for every follower, see screenshots for info\r<br />\r<br />[size=4][b][color=#00FF00]Release 20.12.2014, Version 0.3:[/color][/size][/b]\r<br />\r<br />- fixed widget hotkey not properly baking into savegames\r<br />- introduced wage system, see description, followers will now want money from you\r<br />- added default option for combat style and class selection\r<br />- fixed missing combat style setup on fifth follower in MCM\r<br />- fixed mcm dismisal feature not grayed out when no follower occupies the slot\r<br />- added mcm option to change distance between player and inbetween followers\r<br />\r<br />[size=4][b][color=#00FF00]Release 17.12.2014, Version 0.2.1:[/color][/size][/b]\r<br />\r<br />- removed accidential edits to vanilla combat styles\r<br />- added warning to description of combat styles/classes you can&#39;t return to default\r<br />- this time for real fixed the hotkey reset function\r<br />- added a warning description to reset hotkey if you leave menu without redefining keys\r<br />- if no follower follows, widgets no longer run update code to relief smaller systems\r<br />- added detailed description to follower adjustements in MCM menu\r<br />- added toggling widgets hotkey option\r<br />\r<br />[size=4][b][color=#00FF00]Release 16.12.2014, Version 0.2.0.1:[/color][/size][/b]\r<br />\r<br />- removed left over debug notification\r<br />- fixed restting hotkeys not working...I guess...it&#39;S late...so figure...:D\r<br />\r<br />[size=4][b][color=#00FF00]Release 16.12.2014, Version 0.2:[/color][/size][/b]\r<br />\r<br />- fixed hirelings not working for multiple follower framework\r<br />- fixed companionshousekeepingscript still setting follower count global to 0\r<br />- added option to dismiss followers via MCM menu\r<br />- if follower gets dismissed, corresponding widget will reset to 0\r<br />- changed combat style defintion from Berserk to Barbarian\r<br />- added MCM option to choose Actor Class for followers\r<br />- improved specialization for diverse combat styles, so for example archers will almost exceptionally use bows etc.\r<br />\r<br />[size=4][b][color=#00FF00]Release 14.12.2014, Version 0.1.1:[/color][/size][/b]\r<br />\r<br />- fixed teaching magic dialogue to not allow teaching shouts\r<br />- added notification when no spell/shout equiped to teach\r<br />- added notification which spell/shout has been tought\r<br />- no longer need to have spell or shout equiped in order to show magical teaching dialogue\r<br />\r<br />[size=4][b][color=#00FF00]Release 14.12.2014, Version 0.1:[/color][/size][/b]\r<br />\r<br />- recruit up to 5 followers\r<br />- full interaction via dialogue and hotkeys\r<br />- fixed follower iron arrow and hunting bow bug\r<br />- followers can dual wield\r<br />- all followers can be married\r<br />- all followers skills can be matched up to level via dialogue\r<br />- all followers wear what you give them and keep it after dismissing\r<br />- all female followers will have female animations\r<br />- Farkas now wears companion outfit\r<br />- housecarls will now automatically live at your homes when not in your service\r<br />- all followers are now fully quest and area aware\r<br />- followers will react to combat\r<br />- followers will now use various idle animations\r<br />- followers can relax via dialogue and hotkey\r<br />- followers can avoid combat via dialogue and hotkey\r<br />- followers will not enter combat when sneaking or provoke enemies if the player sneaks\r<br />- ask any NPC about their skills (not only followers, done for my overhaul that allows to make anyone follower)\r<br />- essentialize every follower via dialogue\r<br />- tell followers to ignore friendly hits via dialogue\r<br />- make followers learn spells when player has spell equipped\r<br />- make followers unlearn spells\r<br />- followers can learn any spell from any DLC and custom Mod\r<br />- full support for all DLC followers\r<br />- mcm menu options to configure follower carry weight, speed, aggression, confidence, assistance and morality\r<br />- hotkeys for: trade, wait/command, summon, relax, avoid combat, first follower camera, draw weapons\r<br />- toggle better response behaviour when running into follower in MCM menu\r<br />- Widgets for every follower showing: InventoryWeight/CarryWeight, Skill Level, distance to player, health, stamina, magicka and name\r<br />- all Widgets can be configured: scale, position, transparency, state\r<br />- Widgets have an update interval configurable in MCM for slower systems\r<br />- followers will no longer trigger traps \r<br />- you can set all followers combat style in mcm\r<br />- you can toggle followers automatically draw weapons in mcm\r<br />- Widget status letter shows if followers waits, relaxes or avoids combat\r<br />- followers can learn shouts from player now\r<br />- followers can unlearn shouts\r<br />- cleaned with TESVEdit <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Follower%20Mod-78935-0-5-1.7z?fid=1000221836&ttl=1535867627&ri=8192&rs=8192&setec=8bc3d86cab56e207677b8e46f30f4274"
    },
    {
      "fileId": "1000221837",
      "name": "Source",
      "version": "0.5.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3637",
      "fileName": "Source-78935-0-5-1.7z",
      "uploadedUnix": "1474703735",
      "modVersion": "0.5.1",
      "virusScanUrl": "https://www.virustotal.com/file/d0cec689c644f0cb94377e3e324ab80036ecd9c63f94a043a98b8082ec59dd3a/analysis/1474703762/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 17.10.2015, Version 0.5.1:[/color][/size][/b]\r<br />\r<br />- fixed various error log problems related to none entries\r<br />- fixed problems with widget anchors and combat styles/classes not working...unfortunately this means localizators have to translate the strings inside the script again...I&#39;m sorry\r<br />- fixed doubling follower notifications in the upper left corner\r<br />- fixed error log problems when using diverse commands on aliasarray instead of actorref\r<br />- fixed follower sneaking and moving to the player when in relax mode and the player is sneaking\r<br />- all follower widgets will round up inventory weight to one digit behind the comma now, for display convenience\r<br />- fixed none error log related to weight change when outfit check is applied\r<br />- forwarded USKP change to companionhousekeepinscript to prevent error log on vilkas sword quest\r<br />- follower stat menu will now show health, stamina, magicka and their respective regeneration rates in numbers instead of %\r<br />- removed celtic_icon.swf...sorry, forgot about that, wasn&#39;t supposed to pack this, data is inside SkyUI anyways\r<br />- follower stats menu will now also show maximum carry weight\r<br />- followers inventory/carry weight will be displayed in trade menu now\r<br />- hidding torches during stealth actions will now also check for lanterns from SI\r<br />- changed position of hotkey reset in MCM\r<br />- added missing notification for draw weapon function\r<br />- added whistle command to all hotkey functions, toggleable in MCM...this respectively means you can now enable your character to give orders by whistling\r<br />- fixed issue related to outfit script producing none inventory errors\r<br />- fixed light foot typo\r<br />- fixed light foot spell not applied correctly because you could not add perks to actors...instead I &#34;hacked&#34; the relevant trap scripts to check for a custom spell, so that pressure plates won&#39;t get activated...if you ask why? simple&#33; I had the choice to either add the perk to all followers in CK, and thus effectively excluding any custom follower, OR had the choice to do it the way I wanted it...so I choose the latter\r<br />- added compatibility scripts for Kryptopyrs Traps are Dangerous Mod\r<br />\r<br />[size=4][b][color=#00FF00]Release 27.09.2015, Version 0.5:[/color][/size][/b]\r<br />\r<br />- divided the MCM and Widget quest scripts, this should have an overall positive effect on various issues people reported, primarly related to widgets and the MCM...this should also fix combat styles/Classes not correctly baking into save, as well as other values that need to be transported via maintenance code...unfortunately this brings another issue...you need to start from a new game or the widgets will go all crazy&#33;&#33;&#33; \r<br />- fixed combat style of third follower greyed out when second follower alias wasn&#39;t filled\r<br />- followers will now hide their torches when sneaking with player if you tell them via dialogue\r<br />- added new dialogue option to make followers stay passive when player moves stealthy\r<br />- fixed occasional bug when dismissing a follower, it wasn&#39;t counting as dimsissed\r<br />- fixed widget still showing last follower when all followers are dismissed\r<br />- improved the appearance of all widgets much...see new screenshots, they all have a customized icon theme similar to old RPG&#39;s like AD&D\r<br />- fixed typos inside AS scripts to create wrong display of status\r<br />- fixed anchor MCM option for fourth and fifth follower widget not working correctly\r<br />- fixed hotkeys not working for non-vanilla followers...this will also fix non working hotkeys for INPC followers and any custom using the vanilla follower framework\r<br />- fixed hotkey trade acting sometimes wonky on first follower\r<br />- fixed wait hotkey not working all the time\r<br />- fixed all hotkeys potentially acting wonky sometimes\r<br />- which follower to command is now dependend on how long you press the command hotkey\r<br />- changed dialogue response when owing money to followers to something more appropriate aka they respond more angry\r<br />- teaching a spell to a follower is now skill level dependend...if the followers skill level in the particular school of magic then the required minimum for the spell you want to teach, the spell can&#39;t be tought\r<br />- fixed not being able to redress followers recruited via the &#34;recruit anyone as follower&#34; dialogue function\r<br />- added missing followers from DLC&#39;s to the list of aliases, so now every single follower is covered 100%\r<br />- fixed followers being naked after dismissal and any other occasion...this needs to be varified, as it was a pain in the ass implementing it, and I&#39;m unsure if it works for every occasion, specifically for followers that not have been recruited via the vanilla system\r<br />- added MCM toggle option to give followers the light food perk so they won&#39;t enable traps\r<br />- removed all extras: INPC-patch no longer needed, use the &#34;recruit all&#34; feature instead, requiem patch obsolete due to increasing incompatibility, white widgets obsolete due to widget improvement\r<br />- added a tag(FM) behind the &#34;recruit all&#34; dialogue so you know it&#39;s the correct dialogue to use from Follower Mod\r<br />- fixed all problems related to &#34;recruit all&#34; feature when recruiting via spell...this will effectively fix all problems related to third party follower mods...you can now safely recruit Inigo, Vilja, Hoth and all NPC&#39;s from Interesting NPC&#39;s...basically you can recruit any humanoid a follower now\r<br />- fixed wrong Erik assigned to follower alias section\r<br />- been searching my ass off finding a solution to compensate the deprecated .setLevel() function via script. There is no solution other then using the console with the command &#34;setlevel 1000 0 1 100&#34; (without quotes) after clicking the corresponding actor. I&#39;ve been searching for this in order to create a way to level up followers that do not have the PC Level Mult enabled, which are primarly those followers that are not followers by default...I&#39;m sorry, unless SKSE imports this setlevel command, there&#39;s nothing I can do...\r<br />- merged follower widget with widget section, and combat style section with follower section to make room for the new MCM follower skill level menus\r<br />- added full fledged attribute and skill customization to MCM menu, covering health, stamina, magicka and all of the 18 skills...you can use it without limits to customize, experiementation or cheating...your choice\r<br />- renamed Uthgerd the Unbroken to simply Uthgerd, due to annoyances with the widget and new menus to display her name\r<br />- added complete customized, hotkey based skill/stats menu for followers, it will inform you about attributes, resistances, combat-skills, stealth-skills and magic skills\r<br />- added hotkey based follower magic menu, both menus are derived from [url=http://www.nexusmods.com/skyrim/mods/57046/?]UiExtensions[/url] by Expired6978\r<br />- adapted skill display and spell teaching dialogue option to new menus\r<br />- first babysteps to create proper localization .txt file for easy translation...this will be forwarded in future versions\r<br />- and before you ask...no, no follower needs feature...I hate it to implement a feature that forces me to permanently micromanage my followers...this is just plain stupid...however, the promised relax feature, forcing you to give followers time to relax, or they will break down and eventually leave your group...this could be made in a fashion that it simulates the needs for food, drinks, sleep and sparetime\r<br />\r<br />[size=4][b][color=#00FF00]Release 24.12.2014, Version 0.4.1:[/color][/size][/b]\r<br />\r<br />- fixed wage counter not toggleable in MCM without having a follower\r<br />- improved Fomod installer\r<br />\r<br />[size=4][b][color=#00FF00]Release 21.12.2014, Version 0.4:[/color][/size][/b]\r<br />\r<br />- added mcm option to toggle &#39;make anyone follower&#39; feature, gives you the ability to make anyone follower via a lesser power or via dialogue\r<br />- removed teach shout feature, due to unfixable occasional savegame crashes, this was critical, I&#39;m sorry for any inconvenience\r<br />- fixed issues with using the widget toggle hotkey not changing menu functions\r<br />- added a completely customizable combat style for every follower, see screenshots for info\r<br />\r<br />[size=4][b][color=#00FF00]Release 20.12.2014, Version 0.3:[/color][/size][/b]\r<br />\r<br />- fixed widget hotkey not properly baking into savegames\r<br />- introduced wage system, see description, followers will now want money from you\r<br />- added default option for combat style and class selection\r<br />- fixed missing combat style setup on fifth follower in MCM\r<br />- fixed mcm dismisal feature not grayed out when no follower occupies the slot\r<br />- added mcm option to change distance between player and inbetween followers\r<br />\r<br />[size=4][b][color=#00FF00]Release 17.12.2014, Version 0.2.1:[/color][/size][/b]\r<br />\r<br />- removed accidential edits to vanilla combat styles\r<br />- added warning to description of combat styles/classes you can&#39;t return to default\r<br />- this time for real fixed the hotkey reset function\r<br />- added a warning description to reset hotkey if you leave menu without redefining keys\r<br />- if no follower follows, widgets no longer run update code to relief smaller systems\r<br />- added detailed description to follower adjustements in MCM menu\r<br />- added toggling widgets hotkey option\r<br />\r<br />[size=4][b][color=#00FF00]Release 16.12.2014, Version 0.2.0.1:[/color][/size][/b]\r<br />\r<br />- removed left over debug notification\r<br />- fixed restting hotkeys not working...I guess...it&#39;S late...so figure...:D\r<br />\r<br />[size=4][b][color=#00FF00]Release 16.12.2014, Version 0.2:[/color][/size][/b]\r<br />\r<br />- fixed hirelings not working for multiple follower framework\r<br />- fixed companionshousekeepingscript still setting follower count global to 0\r<br />- added option to dismiss followers via MCM menu\r<br />- if follower gets dismissed, corresponding widget will reset to 0\r<br />- changed combat style defintion from Berserk to Barbarian\r<br />- added MCM option to choose Actor Class for followers\r<br />- improved specialization for diverse combat styles, so for example archers will almost exceptionally use bows etc.\r<br />\r<br />[size=4][b][color=#00FF00]Release 14.12.2014, Version 0.1.1:[/color][/size][/b]\r<br />\r<br />- fixed teaching magic dialogue to not allow teaching shouts\r<br />- added notification when no spell/shout equiped to teach\r<br />- added notification which spell/shout has been tought\r<br />- no longer need to have spell or shout equiped in order to show magical teaching dialogue\r<br />\r<br />[size=4][b][color=#00FF00]Release 14.12.2014, Version 0.1:[/color][/size][/b]\r<br />\r<br />- recruit up to 5 followers\r<br />- full interaction via dialogue and hotkeys\r<br />- fixed follower iron arrow and hunting bow bug\r<br />- followers can dual wield\r<br />- all followers can be married\r<br />- all followers skills can be matched up to level via dialogue\r<br />- all followers wear what you give them and keep it after dismissing\r<br />- all female followers will have female animations\r<br />- Farkas now wears companion outfit\r<br />- housecarls will now automatically live at your homes when not in your service\r<br />- all followers are now fully quest and area aware\r<br />- followers will react to combat\r<br />- followers will now use various idle animations\r<br />- followers can relax via dialogue and hotkey\r<br />- followers can avoid combat via dialogue and hotkey\r<br />- followers will not enter combat when sneaking or provoke enemies if the player sneaks\r<br />- ask any NPC about their skills (not only followers, done for my overhaul that allows to make anyone follower)\r<br />- essentialize every follower via dialogue\r<br />- tell followers to ignore friendly hits via dialogue\r<br />- make followers learn spells when player has spell equipped\r<br />- make followers unlearn spells\r<br />- followers can learn any spell from any DLC and custom Mod\r<br />- full support for all DLC followers\r<br />- mcm menu options to configure follower carry weight, speed, aggression, confidence, assistance and morality\r<br />- hotkeys for: trade, wait/command, summon, relax, avoid combat, first follower camera, draw weapons\r<br />- toggle better response behaviour when running into follower in MCM menu\r<br />- Widgets for every follower showing: InventoryWeight/CarryWeight, Skill Level, distance to player, health, stamina, magicka and name\r<br />- all Widgets can be configured: scale, position, transparency, state\r<br />- Widgets have an update interval configurable in MCM for slower systems\r<br />- followers will no longer trigger traps \r<br />- you can set all followers combat style in mcm\r<br />- you can toggle followers automatically draw weapons in mcm\r<br />- Widget status letter shows if followers waits, relaxes or avoids combat\r<br />- followers can learn shouts from player now\r<br />- followers can unlearn shouts\r<br />- cleaned with TESVEdit <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Source-78935-0-5-1.7z?fid=1000221837&ttl=1535867627&ri=8192&rs=8192&setec=f78449d42dbc195b813895a0d7a56850"
    }
  ]
}