{
  "modId": 78945.0,
  "modName": "Clairvoyance Bug Fix",
  "summary": "After all years, since the game was published, there was no any fix or solution for this annoying clairvoyance glitch problem, finally this mod fix and solve this problem.",
  "descriptionHtml": "[b]                                                                     [color=#3d85c6] [/color][color=#3d85c6][size=5]CLAIRVOYANCE BUG - GLITCH FIX[/size][/color]\r<br />\r<br />[size=4]This mod attempts to fix something that has been broken since Skyrim&#39;s release. If you save a game while Clairvoyance is active, the game also saves the visual effect into the world as if it is a static object. The problem with this, is that it is impossible to remove the effect even after the spell is no longer active on the player. Save Cleaner, console commands, removing the spell from the player... none of them fix the problem. Any subsequent uses of the spell will create an entirely new effect aside from the original that is locked in place, rather than overriding the first effect. This can be very annoying and immersion breaking. These Clairvoyance lines are permanently visible.\r<br /> \r<br />What this mod does to fix this, is it edits the mesh for the effect to make it invisible. The lines are still there, but you can no longer see them. The drawback here is that it makes the Clairvoyance spell useless, as you would not be able to see any new lines. The purpose of this mod is for those that would rather stop using Clairvoyance altogether, than they would delete their save and start over. This is for existing saves only, and will not prevent the problem from happening if it does not already effect you.  You do not need this mod if you have never experienced this problem, you do not use Clairvoyance, or if you do not mind deleting your saves. This was made specifically for those people that have this problem, and would rather not lose their save due to its constant annoyance.\r<br />  \r<br />So far, fixing this issue has been impossible. Five years in, and this is the only mod that I&#39;m aware of that even attempts to address this issue. People have said things like &#34;don&#39;t save while casting Clairvoyance&#34;. This can be difficult to remember. Making sure you wait until the spell&#39;s effect has ended if it has been given a duration with a mod, or equipping and un-equipping an item that has a Clairvoyance enchantment, every time you save can be difficult to remember. Others have said &#34;delete your save&#34;, which we all know isn&#39;t as easy as it sounds. Spending hours on a role-play character, in the middle of a modded quest, whatever your game may be like at any given moment can be a very personal experience. Deleting your save should not be a solution unless your game is utterly broken and unplayable. \r<br />\r<br />This mod does not have an esp, and it is script free. It won&#39;t add anything to the game or take up space in your load order. It is a simple blank mesh that you drop in your Data folder, that overrides the original, to make the effect invisible.This is a temporary fix for existing saves only. Arthmoor (creator of nearly all Unofficial Patches on the Nexus), as well as many others, have stated that this bug is impossible to fix. So this is as good a fix as you&#39;re going to get.\r<br />\r<br />Once again, this mod is for those that are experiencing the Clairvoyance save bug, and are looking for a temporary fix that does not include deleting their saves. If you do not have this problem, this mod is not meant for you, and you do not need to use it.    \r<br />[/size]\r<br />[size=5][i]This mod havent esp, esm or script file, this mod have only mesh file that makes invisible the clairvoyance effect, so [u]THIS MOD 100% SAFE[/u] for use.\r<br />\r<br />[/i][/size][size=3][i]Install:\r<br />[/i][/size][size=3][i] \r<br />[/i][/size][size=3][i]Make a backup of the original mesh, then drop the new mesh into you Data folder.[/i][/size][size=3][i] \r<br />\r<br />[/i][/size][size=3][i]Uninstall:[/i][/size][size=3][i] \r<br />\r<br />[/i][/size][size=3][i]Delete the new mesh, and replace it with the original.\r<br />\r<br />[/i][/size][u][size=3]***** Thanks to [b][url=https://forums.nexusmods.com/index.php?/user/7431117-vanscythe/]VanScythe[/url] for helping to description page*****[/b][/size][/u][/b]",
  "categoryId": "95",
  "version": "Final",
  "author": "DeathMetalHHH",
  "createdUnix": "1474730471",
  "updatedUnix": "1474730450",
  "containsAdultContent": false,
  "uploadedBy": "DeathMetalHHH",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000221862",
      "name": "Clairvoyance Bug-Glitch Fix",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Clairvoyance Bug-Glitch Fix-78945-Final.rar",
      "uploadedUnix": "1474730450",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/50fe54dd9906be48641838f1636ba984281ee7a6aeabd8e1dc7a01317f57b526/analysis/1474730463/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clairvoyance%20Bug-Glitch%20Fix-78945-Final.rar?fid=1000221862&ttl=1535867636&ri=8192&rs=8192&setec=7a988b8c4b0455ad44f5b3d1f8428ca9"
    }
  ]
}