{
  "modId": 78958.0,
  "modName": "Immersive Civil War Cleanup",
  "summary": "Clean up the debris left by the Civil War by talking to either Ulfric or General Tullius at any time after the conclusion of the quest line.",
  "descriptionHtml": "This is a very simple mod that lets you repair the damage caused by the Civil War by talking to either Ulfric or General Tullius at any time after the conclusion of the quest line.\r<br />\r<br />I made this since the only way you can do this right now is to either use the console or rely on mods with tons of unnecessary edits that could very easily break your game.\r<br />\r<br />If you&#39;re already aware of how to repair the the Civil War damage via console, then my mod does the exact same thing, only via added dialogue lines for better immersion instead.\r<br />\r<br />Since the mod&#39;s very light weight, with zero edits to existing game assets, it should be compatible with everything and can be installed at any point in your playthrough. If you ever need to uninstall it for some reason (like hitting the game&#39;s 255 esp load limit for an example) it&#39;s fine to do so after getting your cities fixed with absolutely no risk to your game. \r<br />\r<br />Hope you all will find it useful. :)",
  "categoryId": "58",
  "version": "1.1",
  "author": "Telamont",
  "createdUnix": "1474754845",
  "updatedUnix": "1475021554",
  "containsAdultContent": false,
  "uploadedBy": "telamont",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000222209",
      "name": "Immersive Civil War Cleanup",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "29",
      "fileName": "Immersive Civil War Cleanup-78958-1-1.7z",
      "uploadedUnix": "1475021554",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/923989c92e0557ef40d824cc17147c23a0de169adaba79a101ed2d32e32ff148/analysis/1475021582/",
      "changelogHtml": " Updated to remove Heimskr&#39;s camp near Jorrvaskr. He&#39;ll now properly move back into his repaired home if you sided with the Stormcloaks. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Civil%20War%20Cleanup-78958-1-1.7z?fid=1000222209&ttl=1535867653&ri=8192&rs=8192&setec=1d6af17fe44d7ed80907f84d717294d4"
    }
  ]
}