{
  "modId": 7898.0,
  "modName": "Ethereal shields Beta",
  "summary": "This plugin adds 2 craftable shields, that you can use without sacrificing Mage Armor perk bonus (increased armor rating on \\\"magic flesh\\\" spells).\r\nIf you are mage and lack defensive, or you already have your daedric shield / spellbreaker and looking for upgrade...\r\nCheck it out !",
  "descriptionHtml": "Hai\r\n\r\npisk64 here.\r\n\r\nThis little plugin adds 2 craftable shields into game.\r\n(sadly they both have glass shield model right now, cause no better candidate, looking for someone to help me with retexture or new model) \r\n\r\none:\r\n\r\nEthereal shield\r\n\r\nSuper light shield for magic users, cannot be enchanted, doesnt have any magic enchants either\r\ndamage from bash like shield with 10 base armor rating.\r\nBUT you can use mage armor perk while using it...\r\nAnd you can use all block perks related to shield, so you have lot better survival in close combat, also against arrows.\r\nDoesnt slow you down like light / heavy shield while running.\r\n\r\nCan be crafted ONLY WITH SKYFORGE with arcane blacksmithing perk using 4 gems:\r\ndiamond\r\nemerald\r\nruby\r\nsapphire\r\n\r\nsecond:\r\n\r\nyeah this one is quite \\\"op\\\" but its not so easy to obtain...\r\nEth Bugged Stormshield\r\n\r\nStrong (in terms of bash damage), yet super light shield(no slowdown) , that has buffed (3x) Spellbreaker enchant.\r\nWhen you block it casts ward like spell which can absorb up to 150! damage.\r\nThis can help you avoid stunlock, and damage that you may experience with spellbreaker while fighting with magic users. \r\nAlso shield bash damage equals Daedric shield, which is highest in game.\r\nAnd still, you can benefit from Mage Armor perk...\r\n\r\nCan be crafted ONLY WITH SKYFORGE with arcane blacksmithing perk using:\r\nSpellbreaker - unique daedric artifact from quest\r\nEthereal Shield - meh\r\nSigil stone - item obtained in quest for master conjuration skills. (90+ skill, Phinis Gestor)\r\n\r\nIf you want to test this shield, but you dont have materials you can use console.\r\nType in console help bugged 0 or help ethereal 0 and use PageUP to scroll until you find either eth bugged stormshield or ethereal shield records. Then use command\r\nplayer.additem \\\"idyoufoundwithhelp\\\" 1 \r\n(without quotes)\r\n\r\nHope you like it and GL & HF!\r\n\r\n\r\nINSTALLATION:\r\n\r\nPut .esp file inside \\\"data\\\" in your skyrim directory ",
  "categoryId": "54",
  "version": "0.9a",
  "author": "pisk64",
  "createdUnix": "1328560989",
  "updatedUnix": "1328626622",
  "containsAdultContent": false,
  "uploadedBy": "pisk64",
  "primaryFile": null,
  "files": [
    {
      "fileId": "26636",
      "name": "EthShieldsv2",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "124",
      "fileName": "EthShieldsv2-7898-1-0.zip",
      "uploadedUnix": "1328626622",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2f762ecdad59e494cd08d976ab28c8be751acd02c1ddef43997bb3206b5bb604/analysis/1406657859/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EthShieldsv2-7898-1-0.zip?fid=26636&ttl=1535766323&ri=8192&rs=8192&setec=0b15b3aade3d868a95d9da0be8431eea"
    }
  ]
}