{
  "modId": 79057.0,
  "modName": "Lucid&#39;s Realistic preset",
  "summary": "",
  "descriptionHtml": "[b]50% this is a preset for Enderal and a white/colder filther for any enb made so far, another 50% is a guide I always wanted to do, since I have chronic amnesia  I&#39;ve put some knownledge I have on this Skyrim/Enderal game for me to remember (like fast fps boost).\r<br />\r<br />user quotes:[/b]\r<br />[quote]Zaksta said: (...) this is the only (...) preset on Nexus for Enderal featuring a truly dark night [/quote]======================================================================\r<br />                       PART I : TWEAK GUIDE FOR ENDERAL (+ SKYRIM) AND ENB [img]http://i68.tinypic.com/33k8093.png[/img]\r<br />=======================================================================\r<br />most of these works with oldrim btb \r<br />\r<br />\r<br />1) FPS BOOST VIA ENB EDIT:\r<br />\r<br />quality loss is negligible IMO, only texture size scale matters more.\r<br />\r<br />Before you proceed in-game I highly recommend that you put lower quality settings for bloom and dof in enb series ini, I tweaked around so it is not needed at that high value anymore and gives a huge boost in fps:\r<br />[BLOOM]\r<br />Quality=2\r<br />[DEPTHOFFIELD]\r<br />Quality=1 \r<br />\r<br />also disable any AA found in enblocal.ini (not necessary but might spare some fps) :\r<br />[ANTIALIASING]\r<br />EnableEdgeAA=false\r<br />EnableTemporalAA=false (I don&#39;t like it enable due to conflicts with ice/transparency)\r<br />EnableSubPixelAA=false\r<br />EnableTransparencyAA=false\r<br />\r<br />tweaking some SSAO enbseries.ini quality options can give alot more fps:\r<br />[SSAO_SSIL]\r<br />FilterQuality=2\r<br />SamplingQuality=2\r<br />SamplingPrecision=2\r<br />\r<br />Further diminishing texture size scale of [SSAO-SSIL] and [Reflection] can give significant fps boost (at a relatively minor cost ofc, I personally don&#39;t go below 0.7),\r<br />SizeScale=0.5 (or lower)\r<br />SourceTexturesScale=0.5 (or lower)\r<br />\r<br />or just keep at 0.7 or more if you still have room for quality\r<br />\r<br />======================================================\r<br />\r<br />2)  CRASH FREE EXPERIENCE FOR ENDERAL AND SKYRIM -  ENB MORE DETAILED MEMORY TWEAK, CRASHFIXES, WIN 7, HARDWARE: \r<br />\r<br />\r<br />\r<br />Before proceeding with enb tweaking Crash fixes mod is mandatory to prevent crashing [url=http://www.nexusmods.com/skyrim/mods/72725/?]CRASH FIXES[/url] \r<br />After all is installed go back to this page here and then download the crash fix ini setting in the optionals so the memory script hog is at 90% max. You can also just copy these values into crashfixplugin.ini : \r<br />\r<br />[spoiler] \r<br />\r<br />[Patch]\r<br />; Info: Completely disable Skyrim&#39;s memory allocator and use regular C malloc. That means memory blocks will not exist anymore\r<br />;       and game will not crash at some arbitrary limit. Theoretically it should also be faster (especially loading screens)\r<br />;       and eliminate most ILS or freezing issues.\r<br />; IMPORTANT&#33;&#33;: You NEED custom plugin loader to run this so CrashFixPlugin.dll gets loaded before the game initializes&#33;\r<br />;              Here is the link to &#34;SKSE Plugin Preloader&#34;: http://www.nexusmods.com/skyrim/mods/75795/?\r<br />; When this is enabled then Safety Load and SSME/SKSE memory patch are not needed, but they don&#39;t cause any trouble if you do have them.\r<br />UseOSAllocators=1\r<br />; Info: When the game crashes unexpectedly then write the relevant information from crash to Data/SKSE/Plugins/CrashLog/crash_time.txt\r<br />;       If game crashes when running out of memory or has other issues it&#39;s possible for the file to not appear or become empty&#33;\r<br />;       If the game crashes in SKSE dll or a SKSE plugin dll then it&#39;s possible for the crash information to not appear.\r<br />;       This setting&#39;s value is treated as flags where:\r<br />;       1 - enabled (TL;DR set this for normal enable)\r<br />;       2 - don&#39;t write timestamp into file name but instead always write to crash_last.txt (overwritten by default)\r<br />;       4 - don&#39;t ignore already known crashes, usually ones that display a message box are ignored\r<br />;       8 - append file if it already exists instead of replacing\r<br />;       16 - when the game crashes CTD without a message box about game stopped responding\r<br />RecordCrashInfo=0\r<br />; Write messages that appear in error box also to file in &#34;Data/SKSE/Plugins/CrashFixPluginLog.txt&#34;\r<br />LogMessageToFile=1\r<br />; Info: Warn user on startup if ENB settings are incorrect.\r<br />WarnBadENB=1\r<br />; Info: Crash happens unknown constructor (TESObjectLAND::unk_24 object), movaps instruction is used\r<br />;       but heap allocate did not allocate this object to have 16 align. Crash happens more frequently\r<br />;       with high Ugrids because more cells are loaded and greater chance to misalign.\r<br />; Solution: Could align only this object or align all objects. Trying with all to see what happens since\r<br />;       same error could be elsewhere as well and I think I have seen it elsewhere.\r<br />; Result: Fixes these type of crashes. Some people report longer loading times and higher memory usage with this enabled&#33;\r<br />; Update: Disabled by default since it&#39;s incompatible with some ENB settings, higher memory usage and longer loading times.\r<br />;         It&#39;s safe and probably good to enable if you are ok with those downsides. I have not personally experienced\r<br />;         any incompatibility with ENB, some people say it messes up their game that&#39;s why I wrote it here.\r<br />AlignHeapAllocate=1\r<br />; Info: Game crashes when strcmp is passed NULL char*\r<br />; Address: D573A8\r<br />; Cause: Most frequently happens in TthkbClipGenerator::activate (0xBF2FB3),\r<br />;        tracked issue to skeleton was deleted in another thread while\r<br />;        this function is attempting to use it. Have seen in other places\r<br />;        too.\r<br />; Solution: Unknown. This doesn&#39;t really fix it for BF2FB3 because it just pops up in foot IK.\r<br />;        If patched in foot IK it pops up in hand IK, the problem is larger than just this.\r<br />;        Still enabled because it may fix crashes in other places too this is a very common function.\r<br />;        There&#39;s really no reason not to have it since the game would crash certainly with this off.\r<br />; Enable one. NoTry may be slightly faster but catches less crashes.\r<br />StrCmp=1\r<br />;StrCmpNoTry=1\r<br />; Info: Game crashes when strlen is used on NULL char*\r<br />; Address: 46EDF0\r<br />; Cause: NiNode names are compared, one of the NiNode&#39;s name is NULL.\r<br />; Code:\r<br />;   NiNode ** v72 = NiNode::children.data - this is iterated until count\r<br />;   NiNode * v69 = ...\r<br />;   const char * v56 = v69-&gt;name;\r<br />;   if ( v56 )\r<br />;   {\r<br />;   const char * v57 = v72[v49]-&gt;name; // &lt;- v57 name is not checked for NULL for some reason ?\r<br />;   _strnicmp(v56, v57, strlen(v57)); &lt;- strlen on NULL, also result is not even used anywhere&#33;\r<br />;   }\r<br />; Solution: Unknown, temporarily bypass whole strcmp since it&#39;s unused.\r<br />; Result: Seems to have stopped the crash for me.\r<br />StrLen=1\r<br />; Info: Unknown, reported as loading save game.\r<br />; Address: 8B437C - vtable seems to be 0 or wrong pointer is used.\r<br />; Solution: Skip since this is the last part of the function and already has a check anyway\r<br />UnkUniqueId=1\r<br />; Info: Unknown, reported as loading save game. Possibly related to rendering. First\r<br />;       argument is gNiDX9Renderer-&gt;unk_650 which is a pointer.\r<br />; Address: CEC5EC - null pointer is passed as second argument to function, this function does not expect it\r<br />; Solution: Bypass using argument if it&#39;s null. Maybe doesn&#39;t fix.\r<br />Render650=1\r<br />; Info: Unknown, no info was provided. // char __thiscall TESObjectREFR::unk_4D4EB0(TESObjectREFR *this)\r<br />; Address: 4D4EB9 - vtable of base form is 0\r<br />; Solution: Bypass and pretend that base form is 0 since the function does this check itself already\r<br />UnkObjRef4D4EB0=1\r<br />; Info: Game is saving location&#39;s seen data to save game. The data is NULL.\r<br />; Address: 4C6031\r<br />; Cause: Game doesn&#39;t check for null pointer\r<br />; Code:\r<br />; TESObjectCELL * v3 = ...\r<br />; v5 = BaseExtraList::GetSeenData_40D980(&v3-&gt;extraData);\r<br />; result = (void *)(*((int (__thiscall **)(_DWORD, _DWORD))*v5 + 1))(v5, v2); // &lt;-- v5 can be null&#33; but not checked\r<br />; v5 is IntSeenData, size is known.\r<br />; Solution: Only solution seems to be temporarily creating an empty IntSeenData and writing this to stream instead.\r<br />NullSeenData=1\r<br />; Info: BSFixedString::Set is called with NULL argument.\r<br />; Address: A51285\r<br />; Solution: Ignore call when NULL argument. Not really a solution :P probably better than crashing though.\r<br />StringRefSetNull=1\r<br />; Info: This crash happens because StrLen crash was prevented.\r<br />; Address: 46EE1D\r<br />; Solution: Skip over it.\r<br />; Result: See StrLen.\r<br />SkipStrLenCrash=1\r<br />; Info: This crash happens because unknown reasons during loading. Something to do with behavior graph.\r<br />;       One of the more common crashes I get.\r<br />; Address: C27A8F\r<br />; Solution: Don&#39;t know, trying to let game think the value is 0 and see what happens.\r<br />; Result: Haven&#39;t had this crash since.\r<br />bhvGraphUpdateLoad=1\r<br />; Info: Crash happens during loading, no idea. Might be related to rendering.\r<br />; Address: D822D8\r<br />; Solution: Tried patch something but it probably doesn&#39;t work.\r<br />Unk11=1\r<br />; Info: Incompatible skeleton, but could be something else too.\r<br />; Address: 46ECF5 - NiNode children access\r<br />; Solution: No solution from here, but since it&#39;s going to crash anyway we could at least\r<br />;           warn user about possible incompatible skeleton and let them fix it. Shows messagebox\r<br />MissingNode=1\r<br />; Info: Crash, it&#39;s function array and index goes out of bounds which causes it to call invalid address.\r<br />; Address: 6F3A31\r<br />; Solution: Check index before calling.\r<br />; Result: Haven&#39;t had this crash since.\r<br />IndexError1=1\r<br />; Info: Crash happens in &#34;MovementPlannerAgentWarp&#34; function, unknown what it does. LookupFormById returns\r<br />;       NULL and game does not check or expect this to happen.\r<br />; Address: 76E358\r<br />; Solution: Game has a check for if returned isn&#39;t actor it sets 0 as value, we will do same if NULL is returned.\r<br />MovementPlannerAgentWarp=1\r<br />; Info: Crash happens in DDB0A0, seems to be used in some havok animated object&#39;s vtables.\r<br />;       Normally these crashes are fixed by aligning allocated memory with 16 bytes. But\r<br />;       this one isn&#39;t because it can be used on static memory locations which aren&#39;t using\r<br />;       Skyrim&#39;s allocator at all, this means that memory isn&#39;t guaranteed to be 16 byte aligned.\r<br />; Address: DDB0B2\r<br />; Solution: Use movups instruction instead of movaps.\r<br />UnallocatedMovaps=1\r<br />; Info: Weird crash with NULL ptr in TESWorldSpace::GetCellByCoordMask_4375D0, don&#39;t know why it happens.\r<br />; Address: 437604\r<br />; Solution: return 0 if this crash would happen.\r<br />; Result: Haven&#39;t had this crash since, but it&#39;s rare anyway so it could be coincidence.\r<br />CellNullCrash=1\r<br />; Info: Crash when trying to do: v14 = MagicItem::unk_406C70(a3)-&gt;properties.projectile;\r<br />;       This 406C70 function is something like &#34;GetMainMagicEffect&#34;. Sometimes though it may return\r<br />;       NULL and in 90% of places the game expects this and checks for NULL result, this patch will\r<br />;       fix the remaining locations.\r<br />; Address: 7E39EC, 657677, 6577D5, 65FEEC, 8127CF\r<br />; Solution: Check for NULL and skip (depends on location) if it is.\r<br />GetMainMagicEffect=1\r<br />; Info: Crash when game searches node &#34;NPC COM [COM ]&#34; on actor but the node was not found. This is unexpected\r<br />;       for game because it uses the result without checking for NULL. This whole thing has something to do\r<br />;       with mounting. The function that does this whole thing is present in &#34;StopMountCameraHandler&#34; and\r<br />;       &#34;MountInteraction&#34; vtable. Also it seems that this has something to do with updating position.\r<br />; More info: Was reported that this could happen if non-humanoid tries to mount a horse. This is a rather specific\r<br />;            error with a mod. Instead we will show error message to user when this happens so they can\r<br />;            fix or uninstall that mod.\r<br />; Address: 6E7F85\r<br />; Solution: Check for NULL and if it is NULL then use base node of actor instead of this. It&#39;s fine because\r<br />;           we only take X and Y position from it.\r<br />; Solution2: Show error message and crash after.\r<br />MountNodeCrash=0\r<br />MountNodeWarn=1\r<br />; Info: Crash when game is trying to setup foot IK but there&#39;s a problem. Real cause is unknown but for me.\r<br />;       So we will display a message box when this crash happens. Seems related to the\r<br />;       StrCmp crash in BF2FB3, maybe. Try reducing the amount of installed animations.\r<br />; Address: BFECC1\r<br />; Solution: No solution from here, display warning with helpful tips.\r<br />IKCrashWarn=1\r<br />; Info: Crash happens when rendering and saving. I think this is when it renders the save game image.\r<br />; if ( v8 ) // &lt;- not null\r<br />; {\r<br />;  if ( v8 )\r<br />;    v9 = *(v8 + 8); // &lt;- *(v8 + 8) is null\r<br />;  else\r<br />;    v9 = 0;\r<br />;  v10 = *(v9 + 140) * *(a2 + 4) // &lt;- crash because null\r<br />;    + *(v9 + 136) * *a2\r<br />;    + *(v9 + 144) * *(a2 + 8);\r<br />;  v21 = v10 - *(*(v8 + 8) + 148) * a3;\r<br />; }\r<br />; Address: CB051A\r<br />; Solution: We will skip this if block when *(v8 + 8) is null, as if v8 was null.\r<br />RenderSave=1\r<br />; Info: Crash was reported as casting spell. Only happens sometimes. Happens in movement controller.\r<br />;       Seems like vtable is NULL.\r<br />; Address: 76636B\r<br />; Solution: This happens in a for loop and it happens in if clause. We can skip if this crash would happen.\r<br />MoveControllerCast=1\r<br />; Info: Crash when saving game and trying to render (possibly save game image again?). It&#39;s trying to get\r<br />;       vtable of NULL pointer which will crash.\r<br />;   if ((*a2 + 76)(a2, a1)) // a2 is null\r<br />;   {\r<br />;     *(0x1BA9344) = a1;\r<br />;     *(0x1BA9340) = a2;\r<br />;   }\r<br />;   else\r<br />;   {\r<br />;     *(0x1BA9340) = 0;\r<br />;     *(0x1BA9344) = 0;\r<br />;   }\r<br />; Address: CAF9F7\r<br />; Solution: Skip function call and set return value to false so we don&#39;t have to use the NULL value.\r<br />SaveRenderCrash=1\r<br />; Info: Crash when game tries to get loaded node but it is set to NULL. Only ever seen this on two people.\r<br />;       It is most likely actually related to corrupted mesh being unable to be loaded and game does not expect it.\r<br />;       NiNode * node = a-&gt;GetLoadedStateNiNode();\r<br />;       v2 = node-&gt;(*(vtable+0x14))(); // &lt;- node is NULL\r<br />;       if(v2) { *((int*)(v2 + 212)) = 0; } // &lt;- we can skip this part since it has a check anyway\r<br />; Address: 4C119E\r<br />; Solution: Real solution would be to find the broken mesh and remove it. So lets notify user instead of ignoring this part.\r<br />; Enable one of the following, ignore problem and try to continue or show message box with object reference form ID and form Type.\r<br />NullLoadedNodeIgnore=0\r<br />NullLoadedNodeNotify=1\r<br />; Info: Crash in GarbageCollector::Add when actor argument&#39;s base form is NULL. Game does not check this, when in\r<br />;       some other places it does check for this possibility.\r<br />; Address: 690A69\r<br />NullActorBaseForm=1\r<br />; Info: Crash when modifying actor value but the pointer is bad, possibly due to actor being invalid. This happens often\r<br />;       when script engine is lagged and spells want to modify actor values a lot.\r<br />; Address: 6E07C6\r<br />AVSetCrash=1\r<br />; Info: If your scripts use more than 65535 different strings then the save game will be corrupt and not possible to load.\r<br />;       This fixes it by changing the save file format slightly if string count is higher than 65520. That means if you\r<br />;       have this option enabled and your save game would have become corrupt it changes format instead and vanilla game\r<br />;       or save game tools will not be able to open it&#33; Opposite is true as well, if the count goes below 65520 after\r<br />;       and you save again then the format reverts to vanilla.\r<br />; TLDR: Fix for https://forums.nexusmods.com/index.php?/topic/3924850-corrupt-saves-strcount-0xffff-ctd-on-load/\r<br />; Address: Around 30 different parts of code had to be patched.\r<br />StringCount32=1\r<br />; Info: Warn if SKSE memory patch is not active. This checks if default heap size is 256 or less and warns if you try to\r<br />;       click New, Continue or Load in main menu. Still lets you play the game, just shows a warning.\r<br />WarnSKSEMemoryPatch=1\r<br />; Info: If AlignHeapAllocate is disabled by user then fix that one movaps crash manually. There&#39;s no downside to having this enabled.\r<br />; Address: 4BD832\r<br />FixMovApsManuallyIfAlignedAllocateIsDisabled=1\r<br />; Info: Overwrite array allocator directly when UseOSAllocators is set to 1. Don&#39;t understand the code enough yet to\r<br />;       say if it&#39;s safe or not. At this point it&#39;s just here for testing.\r<br />OverwriteArrayAllocator=0\r<br />; Info: Player&#39;s NiNode (not necessarily same as loaded node) is NULL while drawing world.\r<br />; Address: 69B84B\r<br />NullPlayerNode=1\r<br />; Info: Function TESObjectREFR::CanBeMoved_4D9CF0 is called on an object reference that has NULL base form. This is not expected\r<br />;       and will crash. We will instead return false from that function if that&#39;s the case. The problem is most likely larger than\r<br />;       just this, if you prefer to crash instead disable it.\r<br />; Address: 4D9D09\r<br />NullBaseFormMove=1\r<br />; Info: Game tries to iterate child nodes of a NiAVObject but it&#39;s possible that the target is not a NiNode and can&#39;t have child nodes.\r<br />;       This ends up in a NULL pointer crash.\r<br />;  v26 = v22-&gt;vtable-&gt;sub_5EADD0(v22); // Returns &#34;this&#34; if v22 is a NiNode and returns &#34;NULL&#34; if not.\r<br />;  for ( i = 0; i &lt; v26-&gt;children.emptyRunStart; ++i ) // crash because v26 is NULL.\r<br />; Address: 46CA06\r<br />NullRefNode=1\r<br />; Info: Something is done with outfit of NPC, but one or more entry is NULL and game crashes.\r<br />; Address: 561FF7\r<br />NullOutfitEntry=1\r<br />; Info: Actor is being deleted and base form is NULL.\r<br />; Address: 6BAC9A\r<br />ActorDeleteNullBase=1\r<br />; Info: Does two things:\r<br />;    1. Tracks the last X files opened by game.\r<br />;    2. If the game crashes while reading binary data stream (e.g. NIF file but could be others too) then show message box listing\r<br />;       those files.\r<br />; This can be helpful to track down a corrupted NIF file.\r<br />DebugStream=1\r<br />; Info: When the game fails to create texture in memory should we display a warning and exit game? Recommended yes because you will\r<br />;       see purple textures couple of seconds and then the game will crash anyway since it&#39;s not expected for this to be a NULL value.\r<br />WarnTextureFailure=1\r<br />; Info: Something is done with face gen animation on BSFaceGenNiNode but the parent node is NULL which is unexpected.\r<br />; Address: 5A8808\r<br />NullParentNode=1\r<br />; Info: For debugging purposes, on game startup run allocator benchmark and write results to &#34;AllocatorBenchmark.txt&#34; in Skyrim root\r<br />;       directory. This compares vanilla, aligned vanilla, malloc, aligned_malloc and custom memory block implementation. When you reach\r<br />;       main menu the game will start the test, wait for a message box to say the test is completed, then close game and disable this option.\r<br />RunAllocatorBenchmark=0\r<br />; Info: How many objects to allocate and free for each size (8, 12 and 16).\r<br />CountAllocatorBenchmark=1000000\r<br />; Info: How many times to run each test.\r<br />TimesAllocatorBenchmark=2\r<br />; Info: How many threads to run concurrently. Most accurate is only running one thread, although you can also try 2 to see the performance\r<br />;       of thread-safe code.\r<br />ThreadsAllocatorBenchmark=1\r<br />; Info: Enable custom block allocator for small sizes. May help with memory fragmentation problem. This option does nothing if UseOSAllocators\r<br />;       is not enabled.\r<br />CustomMemoryBlock=1\r<br />; Info: Set total megabytes allocated for the custom block allocators. This amount is sensibly divided between each block.\r<br />;       Has no effect if CustomMemoryBlock is not enabled. The more you allocate here the less memory you have for other stuff&#33;\r<br />CustomMemoryBlockTotalSizeMb=118\r<br />; Info: Show usage of each memory block in per cent when you open console. Has no effect if CustomMemoryBlock is not enabled.\r<br />;       This can help you tweak the CustomMemoryBlockTotalSizeMb value.\r<br />MemoryInfoConsole=1\r<br />; Info: Fixes two crashes specific to Enderal mod. Seems like something to do with havok.\r<br />; Address: EBC0A6 and ECD92E\r<br />EnderalSpecific=1\r<br />; Info: Active effect list of actors is not thread safe but accessed and modified from multiple threads, this will add mutex to each actor&#39;s\r<br />;       effect list.\r<br />FixUnsafeEffectList=1\r<br />; Info: Game crashes when actor&#39;s combat style form is NULL for some reason. Warn the user and try to display the actor&#39;s reference and base ID.\r<br />; Address: 8368B1\r<br />WarnNullCombatStyle=1\r<br />; Info: Set OS update frequency to 1 millisecond (regular is around 16) and replace GetTickCount with timeGetTime. This is for debug only&#33; Don&#39;t use.\r<br />;       May reduce performance.\r<br />HighFrequencyOSTimer=0\r<br />; Info: Make game&#39;s update timer more accurate. This is for debug only&#33; Don&#39;t use.\r<br />HighFrequencyGameTimer=0\r<br />\r<br />\r<br />[/spoiler]\r<br />\r<br />time for enb, go into:\r<br />\r<br />[MEMORY] in enbolocal.ini (where skyrim.exe is): \r<br />\r<br />For a 980 ti (just an example) that has 6 gig of ram you need to insert an inferior value in the videomemorysize line (I tend to put zeros and substract values from 100 to even 200 for more stability), that way there is reduced share between Ram memory and video memory, only put superior values if you get constant CTD due to too many mods or low hardware memory, or other problems like texture pop-in/not appearing at all. If that is the case put high values with ram+vram but expect stutter similar to enablecompression=true. Also setting very high RAM+VRAM helps decreasing transition time (doors, world transition) but will always stutter more than values below you vram size. \r<br />\r<br />example of an ideal set for perfomance and quality:\r<br />\r<br />[MEMORY] in enbolocal.ini: \r<br />\r<br />OPTION 1 (preferred version for a smoother game)\r<br />\r<br />ExpandSystemMemoryX64=false (not recommended anymore, caused me several problems)\r<br />ReduceSystemMemoryUsage=true\r<br />DisableDriverMemoryManager=false\r<br />DisablePreloadToVRAM=false (causes stuttering)\r<br />EnableUnsafeMemoryHacks=false  (put true if you have at least 18 gig of vram, Crash fixes message in red told me that 17 vram was used and game crashed, this settings uses vram instead of ram and ignores other settings, causes ILS with small vram cards like 980 TI with 6 gig of vram&#33;)\r<br />ReservedMemorySizeMb=256 (no need to exaggerate, enb handles small values like 64-128 no problem, don&#39;t put 512-1024 it&#39;s stupid overdo, 384 has been tested for best performance but might crash your game&#33; try 384 then lower it if u CTD)\r<br />VideoMemorySizeMb=5900 (that&#39;s because 980 ti has 6 gig, if you have 8 gig put 7900, if serious problems listed above put ram+vram values)\r<br />EnableCompression=false   (causes stuttering if set to true)\r<br />AutodetectVideoMemorySize=false (fails to proper detect, don&#39;t use this)\r<br />\r<br />\r<br />OPTION 2 (if you crash)\r<br />\r<br />ExpandSystemMemoryX64=false (not recommended anymore, caused me several problems)\r<br />ReduceSystemMemoryUsage=true\r<br />DisableDriverMemoryManager=false\r<br />DisablePreloadToVRAM=false (causes stuttering)\r<br />EnableUnsafeMemoryHacks=false \r<br />ReservedMemorySizeMb=64 (that is enough, you will experience some stutter from time to time: very rarely though)  \r<br />VideoMemorySizeMb=15000 (leave zeroes ok?)\r<br />EnableCompression=true (you need to compromise)\r<br />AutodetectVideoMemorySize=false\r<br />\r<br />This is just an example for 980 ti, adjust accordingly or ask questions in the mod page, check how memory u can put: download VRamSizeDX9\r<br />\r<br />the option 1 and 2 can be inter-changed mid-game, If I run lower quality textures I use option 1 for max smoothness, if alot of textures 4k/2k I use option 2.\r<br />\r<br />proper load order and non-scripted mods are highly recommended, don&#39;t put 100 script heavy mods (or use non-scripted variants you will use 25% of the scripts anyway). Shadow in skyrim prefs.ini should be at 1024 or max 2048, use skyrimreleaded for shadows instead. Don&#39;t trust any mod author (not even me), read carefully in the comment section if s.o. spotted nasty script loops in one of these famous mods. Learn to clean your mods (save tool is essential), here is a good guide: http://warzones.skyrim.modunion.com//updating-wz-best-practices/\r<br />\r<br />download Insignificant Object remover to get rid of the nasty pebbles, also download to remove kelp and rock from underwater: https://www.nexusmods.com/skyrim/mods/55240/?\r<br />\r<br />you could try Tetrachromatic ENB performance patch OPTIMIZED FOR SLI by [b]PROPHET (good balance performance/quality), copy only his shadow, SSAO-SSIL, [/b]Reflection (and perhaps DOF and BLOOM for even more performance) in the enbseries.ini, http://www.nexusmods.com/skyrim/mods/77384/?\r<br />\r<br />Skyrim is the only game that will take advantage of any hardware improvement like gen 3.0 over 2.0 (3 FPS to 10-15 fps more in cities: I tested this), or alot of vram or ram, so yes it makes sense to buy a card with 20 gig of vram for skyrim and 64 gig for ramdisk, all advantages are used -  trust me. At least 16 gig of ram and 6 up to 11 gigs of vram are highly recommended. Skyrim will use at least 6 gigs of vram with 2k mods (I run with graph charts on my second monitor, I am just saying what I see). CPU is extremely important in Skyrim, I gained about 2-10 fps with skylake over i5-2500k and less stutter. All thx to mods and scripts... however some stutter will stay no matter what u throw at it, it&#39;s an old game and mods make that worse\r<br />\r<br />\r<br />=======================================================================\r<br />3) FIX FOR TOO BRIGHT WATERFALLS, FOGS AND OBJECTS [spoiler]\r<br />\r<br />go into enbseries.ini and put lower values for night/day/dawn/dusk sections in particles (especially night),  ignore weather system must be set to true to further enhance the fix, example: \r<br />\r<br />[PARTICLE]\r<br />IgnoreWeatherSystem=true\r<br />IntensitySunrise=0.5\r<br />IntensityDay=0.70\r<br />IntensitySunset=0.60\r<br />IntensityNight=0.25\r<br />IntensityInteriorDay=0.8\r<br />IntensityInteriorNight=0.8\r<br />LightingInfluenceSunrise=1.0\r<br />LightingInfluenceDay=1.0\r<br />LightingInfluenceSunset=1.0\r<br />LightingInfluenceNight=1.0\r<br />LightingInfluenceInteriorDay=1.10\r<br />LightingInfluenceInteriorNight=1.10 \r<br />IntensityDawn=0.8\r<br />IntensityDusk=0.8\r<br />LightingInfluenceDawn=1.0\r<br />LightingInfluenceDusk=1.0 [/spoiler]\r<br />\r<br />\r<br />=======================================================================\r<br />4) SKYRIM HIGHLY RECOMMENDED MODS COMPATIBLE WITH ENDERAL [spoiler]\r<br />A Matter of Time\r<br />Combat Evolved (or whatever combat mod), like Deadly Combat\r<br />Guess Distance (display information of NPC from a distance, works 30% only basic NPC info displayed and distance)\r<br />Hide Those Futile Quests (hides quest u don&#39;t want to display)\r<br />Just do It (eat instead of putting food in invetory and more)\r<br />Immersive Archery (adds stamina drain to your bow)\r<br />Vigor Combar and Injuries\r<br />Immersive Hud\r<br />Bloody Facials (adds blood on face)\r<br />Whistle.esp (call your horse using power button)\r<br />Realistic Regeneration (when u sit u regenerate stamina and more)\r<br />Insignificant Object remover + Remove Underwater Grass and other stuff too (huge fps boost)\r<br />\r<br />\r<br />Traps make noise (but not mining makes noise. it breaks stuff)\r<br />Enchanced Blood textures (I mix with crimson blood textures)\r<br />Watercolor for enb and realistic water two (compatible, does the job out of the box, haven&#39;t seen bugs, RW2 might give some small invisible conflict in some rare places, very rare)\r<br />Dyndolod for LODS\r<br />[/spoiler] \r<br />\r<br />=======================================================================\r<br />5) TIP TO HAVE CRYSTAL CLEAR/TROPICAL WATER AND MUDDY UNDERWATER (REALISM) [spoiler]\r<br />download Realistic Water Two and Watercolor for enb then go into enbseries.ini.\r<br />\r<br />enbseries.ini:\r<br />two variables govern the water cleariness: frennel amount, min max and muddiness (lower values:clearer water), sunscattering allows for more sun to enter the water and that produce a nice greenish effect on water surface (visible with displacement). You need to find balance between sunscattering and muddiness since the former requires higher values of the latter. For underwater: use high tint levels for more muddiness. For now I am using this settings with good results, example (but feel free to experiment):\r<br />\r<br />[WATER]\r<br />\r<br />FrennelMultiplier=0.8\r<br />FrennelMin=0.20\r<br />FrennelMax=0.5\r<br />SunScatteringMultiplier=14.0 (if that&#39;s to much lover to 10)\r<br />Muddiness=0.16\r<br />\r<br />[UNDERWATER]\r<br />IgnoreWeatherSystem=false\r<br />EnableDispersion=true\r<br />EnableParallax=true\r<br />EnableDisplacement=true\r<br />EnableSilhouette=true\r<br />EnableBlurring=true\r<br />EnableReflection=true\r<br />EnableShadow=true\r<br />ShadowQuality=1\r<br />DispersionAmount=0.33\r<br />ReflectionAmount=0.7\r<br />TransparencyFade=1.78\r<br />TransparencyCurve=1.00\r<br />DeepnessFade=0.5\r<br />DeepnessDarkening=1.50\r<br />TintAmount=1.51\r<br />TintFade=0.61\r<br />SunScatteringMultiplier=3.39 \r<br />[img]http://i66.tinypic.com/x5uyhv.jpg[/img]\r<br />\r<br />I highly recommend watercolor for enb: http://www.nexusmods.com/skyrim/mods/48938/?        (this is Enderal shot)\r<br />\r<br />[/spoiler]\r<br />=======================================================================\r<br />6) I want even more muddy realistic underwater - like real life nordic lakes\r<br />this will make the underwater dark but also realistic:\r<br />[spoiler]\r<br />[UNDERWATER]\r<br />IgnoreWeatherSystem=false\r<br />EnableDispersion=true\r<br />EnableParallax=false\r<br />EnableDisplacement=false\r<br />EnableSilhouette=false\r<br />EnableBlurring=false\r<br />EnableReflection=true\r<br />EnableShadow=false\r<br />ShadowQuality=2\r<br />DispersionAmount=1.0\r<br />ReflectionAmount=1.0\r<br />TransparencyFade=1.0\r<br />TransparencyCurve=1.0\r<br />DeepnessFade=1.0\r<br />DeepnessDarkening=0.5\r<br />TintAmount=1.0\r<br />TintFade=1.0\r<br />SunScatteringMultiplier=1.0\r<br />[/spoiler]\r<br />=======================================================================\r<br />7) I want to use Skyrim Reloaded+ ENB+  watercolor for enb/RW2 \r<br />This way all water effects works\r<br /> (works with Skyrim - oldrim, not just Enderal)\r<br />[spoiler]\r<br />put these values into skyrimreloaded.ini (don&#39;t enable other things like SSAO/Bloom, it will break stuff like fire mesh/campfires, SMAA is also problematic, and Enablewater kills water flow from RW2):\r<br />[Main]\r<br />WindowedMode             = 1 #(or 0, up to you)\r<br />FoV                      = 0 #(this way you can change FOV, I don&#39;t use it so 0)\r<br />WaterManagement          = 0\r<br />ScreenshotPath           = &#92;Screenshots\r<br />ScreenshotType           = 0\r<br />ScreenshotKey            = 87\r<br />FPSOverlay               = 0\r<br />CustomEffects            = 0\r<br />CameraMode               = 0\r<br />SleepingMode             = 0\r<br />ShadowMode               = 1\r<br />[CameraMode]\r<br />OffsetX                  = 0.0\r<br />OffsetY                  = 15.0\r<br />OffsetZ                  = 4.0\r<br />NearDistanceFirst        = 10.0\r<br />NearDistanceThird        = 15.0\r<br />[SleepingMode]\r<br />Rest                     = 0\r<br />RestMessage              = You must be in a bed to rest.\r<br />[ShadowMode]\r<br />NearQuality              = 2.0\r<br />[Shaders]\r<br />EnableWater              = 0\r<br />[Effects]\r<br />EnableUnderwater         = 1\r<br />EnableWaterLens          = 1\r<br />EnableGodRays            = 0\r<br />EnableDepthOfField       = 1\r<br />EnableAmbientOcclusion   = 0\r<br />EnableColoring           = 0\r<br />EnableCinema             = 0\r<br />EnableBloom              = 0\r<br />EnableBloodLens          = 1\r<br />EnableMotionBlur         = 0\r<br />EnableLowHF              = 0\r<br />EnableSharpening         = 0\r<br />EnableSMAA               = 0\r<br />[/spoiler]\r<br />\r<br />=======================================================================\r<br />8) OPTIONALS (increase/decrease image brightness) [spoiler] \r<br /> if you feel you have problems with screen image go into color correction settings of enb series: [COLORCORRECTION]\r<br />and increase brightness (values 1.0-1.25) or decrease (values below 1.0).\r<br />ex.\r<br />Brightness=1.05 \r<br />\r<br />just don&#39;t overdo or bright objects will be too bright. \r<br />\r<br />I recommend enb particle patches by Mindflux to fix brightness glitches, http://enbseries.enbdev.com/forum/viewtopic.php?t=1499[/spoiler]\r<br />=======================================================================\r<br />9) MAKE THE CLOUDS 3D-like BY GIVING THEM SHADOWS [spoiler]\r<br />by defaul this enb has 0.0 on cloudshadows, just change these values to:\r<br />enbseries.ini:\r<br />[CLOUDSHADOWS]\r<br />IgnoreWeatherSystem=false\r<br />EnableAtNight=true\r<br />OpacitySunrise=0.1\r<br />OpacityDay=0.1\r<br />OpacitySunset=0.1\r<br />OpacityNight=0.2\r<br />OpacityInteriorDay=0.1\r<br />OpacityInteriorNight=0.1\r<br />OpacityDawn=0.3\r<br />OpacityDusk=0.3\r<br />\r<br />example of cloudshadows (even higher coud opacity and generated shafts: opacity dawn/dusk: 1.1       (Enderal shot)\r<br />[img]http://i68.tinypic.com/174fah.jpg[/img]\r<br />[/spoiler]\r<br />\r<br />\r<br />\r<br />=======================================================================\r<br /> 10) INCREASE QUALITY, ADD TEXTURES/MESHES: [spoiler]\r<br />\r<br />download RUDY&#39;s enb for Enderal and copy only his textures and meshes content into data folder.  Or try his enb instead of this, but remember that it has a totally different feel than this mod..if you know Rudy u know what I mean (I am big fan of his dusks and dawns): goo.gl/12vtqa.\r<br />if you want to use textures/meshes from oldrim remember that Enderal hates new architecture folders from mods but is OK with grass/trees, if needed correct textures in paint.net giving them more brightness for instance, about 10-20% (pain.net should be downloaded by anyone wishing to do fast edits). This is how it looks on me with Renthal texture for flora: http://www.nexusmods.com/skyrim/images/632608/? \r<br />\r<br />download Insignificant Object remover to get rid of the nasty pebbles\r<br />\r<br />increase ssao ssil levels:\r<br />\r<br />This is an example of high ssao texture size from Skyrim: \r<br />[img]http://i68.tinypic.com/2roteeb.jpg[/img]\r<br />\r<br />put higher values for ssao-ssil in enbseries.ini: \r<br />[SSAO_SSIL]\r<br />SizeScale=0.7\r<br />SourceTexturesScale=0.7\r<br />~\r<br />I disagree with Boris Vorsontsov on this, texture scale does matter in Skyrim above 0.5 so\r<br />at least 0.7 for visible &#39;&#39;ball of light&#39;&#39; at night, ssao precision can be put lower for more perfomance: 2 or 0 instead of 1 or -1\r<br />~\r<br />I personally also love flare effect from sun rays and [u]spell effects[/u]:\r<br />\r<br />[EFFECT]\r<br />EnableLens=true [/spoiler]\r<br />=======================================================================\r<br />11) I highly recommend Dyndolod to generate proper lods for Enderal. There is pack designed for Enderal\r<br />=======================================================================\r<br />\r<br />\r<br />\r<br />PART II - THE PRESET - INSTALL INSTRUCTIONS AND DESCRIPTION\r<br />\r<br />\r<br />[b]* [u]A preset that requires Vivid Ender enb[/u][/b]\r<br />\r<br />[b]            DESCRIPTION[/b]:\r<br />It&#39;s a hit and miss with these presets, since the size and quality of monitor and colors can make it different between users\r<br />\r<br />\r<br />This is a  rework with complex recolor using a different framework so I didn&#39;t touch anything of Mangaclubs&#39;. I have some exp in modding battlefield with color presets but this one was very hard for me. 3 lift gamma levels, shadow, midtones, bluish highlights for skies, tonemap color removal and vibrance RGB complete rebalance, using only few effects for more perfomance. \r<br />[b]~\r<br />Cold color palette exteriors, warm yellow palette interiors, I enhanced the pros of Vivid Ender the best I could.[/b]\r<br />~\r<br />Bug fixes for Vivid Ender and the reason why [spoiler]\r<br />\r<br />I love Enderal and Sure AI team for Nehrim, I wanted an enb in Enderal with interesting weathers but Mangaclub&#39;s distinct green/yellow tint and overly high brightness level at night  was not reflecting my taste. There are things I like in that enb and I wanted to enhance them.  I wanted to retain the weatherlist from that mod and have something different while being compatible. Apart the mod I included a guide down below in the description: Vivid enb has nice warm colors for which I appreciate it, but clearly needs some bug fixes like bright waterfalls and fogs. [/spoiler]\r<br />\r<br />                                                  [url=https://postimg.org/image/vwqfg8dgj/][img]https://s13.postimg.org/vwqfg8dgj/79057_0_1475339564.png[/img][/url]\r<br />=======================================================================\r<br />            INSTALLATION FOR THOSE WHO DON&#39;T HAVE VIVID ENDER ENB [spoiler] : \r<br />\r<br />1) install Boris&#39; enb latest version (we will be loading sweetfx via enblocal.ini)\r<br />2) Install Vivid Ender Enb and overwright everything, after that\r<br />3) put &#39;&#39;sweet&#39;&#39; forlder in the main install of the game (not in data)\r<br />edit proxy in enblocal.ini to look like this\r<br />[PROXY]\r<br />EnableProxyLibrary=true\r<br />InitProxyFunctions=true\r<br />ProxyLibrary=sweet/d3d9.dll\r<br />\r<br />If you are new to this for reference there is an image for correct file structure in the image section. \r<br />\r<br />Don&#39;t forget to edit your skyrimprefs.ini and set the following values (valid for all enbs):\r<br />[Display]\r<br />bFloatPointRenderTarget=1 \r<br />bTreesReceiveShadows=1\r<br />bDrawLandShadows=1\r<br />bShadowsOnGrass=1\r<br />iMultiSample=0 \r<br />bFXAAEnabled=0 \r<br />iMaxAnisotropy=0\r<br />\r<br />or just download skyrimprefs.ini  from miscellaneous section\r<br />\r<br />correct folder structure:\r<br />[img]http://i63.tinypic.com/10yhn4l.jpg[/img]\r<br />\r<br />\r<br />[/spoiler]\r<br />\r<br />              INSTALLATION FOR THOSE WHO HAVE VIVID ENDER ENB [spoiler] \r<br />\r<br />put &#39;&#39;sweet&#39;&#39; forlder in the main install of the game (not in data)\r<br />edit proxy in enblocal.ini to look like this\r<br />[PROXY]\r<br />EnableProxyLibrary=true\r<br />InitProxyFunctions=true\r<br />ProxyLibrary=sweet/d3d9.dll\r<br />\r<br />correct folder structure:\r<br />\r<br />[img]http://i63.tinypic.com/10yhn4l.jpg[/img]\r<br />\r<br />[/spoiler]\r<br />\r<br />=======================================================================\r<br />           UNINSTALLATION:\r<br />simply delete &#39;&#39;sweet&#39;&#39; folder from the main folder of the game\r<br />=======================================================================\r<br />           EFFECTS USED:  \r<br />SMAA_ANTIALIASING -  TONEMAP - BLOOM- LIFTGAMMAGAIN - VIBRANCE - DITHER - CURVES - TV LEVELS - LUMA\r<br />subtle use of the effects, small dosage of luma, vibrance, tonemap. You can toggle other effects on (from 0 to 1) like define_HDR, Vignette (this is pre-made so you can add effect and improve image) in sweetfx_settings.ini. \r<br />\r<br />\r<br />CREDITS:\r<br />Guru3d, [url=http://forums.guru3d.com/member.php?u=247365]Boulotaur2024[/url], Christian Cann Schuldt Jensen aka CeeJay.dk (http://ceejay.dk), Andrej Dudenhefner, 3an and the team that worked on sweetfx 1.5.1.\r<br />[url=http://www.nexusmods.com/skyrim/users/1632043]Mangaclub[/url] for making Vivid Ender Enb and weatherlist.ini \r<br />Boris Vorontsov for enb\r<br />SureAI for Enderal/Nehrim\r<br />S.T.E.P. team\r<br />[url=http://www.nexusmods.com/skyrim/users/98045]spoonsinge[/url]r for image",
  "categoryId": "106",
  "version": "1.7",
  "author": "Lucidstorm1",
  "createdUnix": "1475192292",
  "updatedUnix": "1513863938",
  "containsAdultContent": false,
  "uploadedBy": "lucidstorm1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000229208",
      "name": "Lucid&#39;s realistic preset",
      "version": "final1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "874",
      "fileName": "Lucid's realistic preset-79057-final1.7z",
      "uploadedUnix": "1480196352",
      "modVersion": "final1",
      "virusScanUrl": "https://www.virustotal.com/file/cddd96924710d7a459fc456de1bf15b56e9e7713323320b58c7afd65c6d612d3/analysis/1480196402/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Lucid%27s%20realistic%20preset-79057-final1.7z?fid=1000229208&ttl=1535867756&ri=8192&rs=8192&setec=823eb45f5afcf8733cb50a974dec00a0"
    },
    {
      "fileId": "1000242266",
      "name": "sweetfx bare version for all enbs",
      "version": "1.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "885",
      "fileName": "sweetfx bare version for all enbs-79057-1-4.rar",
      "uploadedUnix": "1492691598",
      "modVersion": "1.4",
      "virusScanUrl": "https://www.virustotal.com/file/dc481d79d95b483e7b897d4db876729f00af42989fb9ae75492dbe19bde309d9/analysis/1492691884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/sweetfx%20bare%20version%20for%20all%20enbs-79057-1-4.rar?fid=1000242266&ttl=1535867756&ri=8192&rs=8192&setec=4393c08f54aa000096d53b5213e35c68"
    },
    {
      "fileId": "1000244389",
      "name": "skyrimreloaded compatibility preset",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "skyrimreloaded compatibility preset-79057-1-5.rar",
      "uploadedUnix": "1494842113",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/27ce11d5c623a463ad0df9ed59a9d80d5d3adbed893490010e2a22917aee1288/analysis/1494842282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/skyrimreloaded%20compatibility%20preset-79057-1-5.rar?fid=1000244389&ttl=1535867757&ri=8192&rs=8192&setec=c47368720e3765074f5ac58dfa7336e3"
    },
    {
      "fileId": "1000250503",
      "name": "Crash Fixes proper values",
      "version": "1.6.",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "7",
      "fileName": "Crash Fixes proper values-79057-1-6-1.rar",
      "uploadedUnix": "1501232765",
      "modVersion": "1.6.",
      "virusScanUrl": "https://www.virustotal.com/file/6494f3b58424d5aac4c17d8634565a2dd37aa5a9fcb4ab423b55fdd96e242c66/analysis/1501233002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Crash%20Fixes%20proper%20values-79057-1-6-1.rar?fid=1000250503&ttl=1535867757&ri=8192&rs=8192&setec=c8e82470a9854b20c8fd1401e6271944"
    },
    {
      "fileId": "1000256500",
      "name": "for modders",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63130",
      "fileName": "for modders-79057-1-0.zip",
      "uploadedUnix": "1507116991",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/60b29892187c5a591a5ca81cc2c358c11eba1d92a2d52051c9f2d9349018e7e9/analysis/1507117210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/for%20modders-79057-1-0.zip?fid=1000256500&ttl=1535867758&ri=8192&rs=8192&setec=9827f477c090224a24c1af7b931d2c7d"
    },
    {
      "fileId": "1000262397",
      "name": "experiments",
      "version": "final",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "34250",
      "fileName": "experiments-79057-final.zip",
      "uploadedUnix": "1513863713",
      "modVersion": "final",
      "virusScanUrl": "https://www.virustotal.com/file/ef458740dd93f24f0f2448b6611f2505216c6bb04d779cbc58643b315a061c8d/analysis/1513863725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/experiments-79057-final.zip?fid=1000262397&ttl=1535867758&ri=8192&rs=8192&setec=0c746f6aad20c9fa04a12fd992cfd002"
    },
    {
      "fileId": "1000262398",
      "name": "for modders 2 - photo.",
      "version": "final",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "34250",
      "fileName": "for modders 2 - photo.-79057-final.zip",
      "uploadedUnix": "1513863938",
      "modVersion": "final",
      "virusScanUrl": "https://www.virustotal.com/file/fd85856cdc1c0f26981a7f6d7aa1b63ec1ed28d9c257480d7999158eb295bb4a/analysis/1513863967/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/for%20modders%202%20-%20photo.-79057-final.zip?fid=1000262398&ttl=1535867759&ri=8192&rs=8192&setec=0d183c5644c8dd1055b2e5b4f916f745"
    }
  ]
}