{
  "modId": 79161.0,
  "modName": "The Beasts of Skyrim - Boss Encounters",
  "summary": "This mod adds 16 bosses that are buffed versions of vanilla enemies, 15 of which are found within the over world, and one is locked behind a dungeon that cannot be accessed until the others are dead.",
  "descriptionHtml": "You [b]don&#39;t[/b] need any DLC with this mod. \r<br />\r<br />There shouldn&#39;t be any compatibility issues.\r<br />\r<br />This mod adds 16 new bosses to the world of Skyrim, and is intended for high level players. These are in a a lot of different locations across the game. Each of these bosses have a detailed &#39;arena&#39; in which they are found, and a unique award for each one. \r<br />\r<br />This mod is about exploring Skyrim for the biggest challenges in the game, so I&#39;m not going to tell you where these bosses are, however, I&#39;ll tell you where to start, and where to finish. In the Labyrinthian, there&#39;s a room with the wooden Dragon Priest Mask, and going in there with the mask on teleports you to another area. Go to this area, and there will be a book, detailing the story of the mod, and giving you some directions on where to find these bosses. \r<br />\r<br />Now, when you kill a boss, not only will it have powerful and unique loot (either on its corpse or in a chest nearby, the key to which will be on the bosses corpse), and a key (if the boss hasn&#39;t got unique loot on the corpse, then there will be two keys). This key is important, as it opens one small area in the Crypt of the Fallen Cultist, the small dungeon added for the final boss fight. You&#39;ll need all 15 keys to open all areas, and therefore enter the correct code to access the boss fight. \r<br />\r<br />The mod will also add named items with powerful enchantments, new spells, and a book to add lore to the mod, all as rewards for killing these creatures. I&#39;m not very good with 3D modelling, so the bosses are just resized vanilla enemies (though when possible I used skins for the enemies rarely used (so using the model for Odahviing on one of the dragons, stuff like that)).\r<br />\r<br />These bosses are just generally enhanced versions of vanilla enemies, but I hope the buffs added to them make enough difference to add some fun and excitement to the game&#33; \r<br />\r<br />Also available on the Steam Workshop (it&#39;s actually the 5th most popular at the time of writing this): \r<br />http://steamcommunity.com/sharedfiles/filedetails/?id=728917152",
  "categoryId": "35",
  "version": "",
  "author": "TomThegamer01",
  "createdUnix": "1475595461",
  "updatedUnix": "1475595457",
  "containsAdultContent": false,
  "uploadedBy": "TomTheGamer01",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000222994",
      "name": "The Beasts of Skyrim -  Boss Encounetrs",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "229",
      "fileName": "The Beasts of Skyrim -  Boss Encounetrs-79161-.rar",
      "uploadedUnix": "1475595457",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0584b4dc8935bd8889433875b9556428aa5005611cc1d12b990e78c2717864ca/analysis/1475595483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Beasts%20of%20Skyrim%20-%20%20Boss%20Encounetrs-79161-.rar?fid=1000222994&ttl=1535867859&ri=8192&rs=8192&setec=a78a649b262e82b58dc2ff9eaee9064b"
    }
  ]
}