{
  "modId": 79291.0,
  "modName": "Sounds of Skyrim - The Wilds - Traduzione ITA",
  "summary": "Traduzione italiana della mod Sounds of Skyrim - The Wilds.",
  "descriptionHtml": "Questa è la traduzione italiana della mod Sounds of Skyrim - The Wilds\r<br />[i]Installazione:\r<br />[/i]Dopo aver scaricato la mod originale, sovrascrivete l&#39;esp originale con quello della mia traduzione.\r<br />\r<br />[center]\r<br />[size=3][i][b]Traduzione della descrizione della mod[/b][/i][/size][/center][center][size=3][i][b]\r<br />\r<br />[youtube]5fFZVF5iL18[/youtube]\r<br />[/b][/i][/size][/center][center][color=#ffff00]Sounds of Skyrim - The Wilds (Terre Selvaggie)[/color]\r<br />Versione corrente 1.13 – 06/05/2013[/center]\r<br />\r<br />[center][img]https://i.imgur.com/hXQSy.png[/img][/center]\r<br />\r<br />[b][color=#ff0000]Breve nota:[/color][/b][color=#ff7700] Sounds of Skyrim – Civilization  è ora bloat-free&#33; Il bug infame è stato corretto per bene. Puoi scaricarlo da [url=http://www.nexusmods.com/skyrim/mods/20193/?][color=#ff7700]qui.[/color][/url]\r<br />-Sono ora disponibili delle patch di compatibilità per diverse mod. Guarda nella sezione tecnica per ulteriori informazioni.\r<br />[/color][color=#ffff00][b]\r<br />Cosa fa?[/b][/color]\r<br />The Wilds è focalizzato nell’ aggiungere degli effetti sonori alle regioni selvaggie in Skyrim. Con 115 nuovi effetti sonori, lo scopo di “The Wilds” è aumentare la varietà sonora della fauna di Skyrim con l’aggiunta di vari  suoni di animali, uccelli e insetti che si riproducono a secondo del meteo, l’ora del giorno e regione in cui ti trovi. Nella foresta, per esempio, sentirai i versi delle volpi, cervi e corvi. Di notte, sentirai i lupi che ululano da lontano o le strolaghe che si chiamano tra loro. Nel Reach, si può sentire occasionalmente le capre di montagna o i falchi.\r<br />\r<br />In aggiunta agli animali, The Wilds aggiunge anche i suoni d’impatto della pioggia sulle tende e le strutture di legno, i suoni del fruscio dei cespugli per simulare i movimenti dei piccoli mammiferi che scompaiono lontano quando ci si avvicina e i suoni delle piccole onde che colpiscono i tronchi d’albero o le strutture che sono parzialmente sommerse dall’acqua.\r<br />\r<br />[color=#ffff00][b]Cosa è Sounds of Skyrim?[/b][/color]\r<br />\r<br />Sounds of Skyrim è un progetto diviso in tre parti che, alla fine, aggiunge circa 460+ effetti sonori al mondo di gioco. Riguarda quasi tutto le celle e regioni nel gioco. Il mio principale obiettivo è di non avere un ambiente silenzioso per migliorare l’immersione. I Suoni sono influenzati dall’ ora del giorno, dal meteo e dal luogo in cui ti trovi. Così quando cammini nelle strade delle città durante il giorno, sentirai l’eco delle porte che si aprono e chiudono, dei bambini che giocano e dei lavoratori che segano qualcosa. Mentre la notte, i gatti che combattono per il territorio e i cani abbaiare.\r<br />\r<br />Tutte e tre i moduli sono stati rilasciati e puoi ottenerli sul sito da dove hai scaricato questo modulo.\r<br />\r<br />\r<br />[color=#ffff00][b]Moduli di Sounds of Skyrim rilasciati[/b][/color]\r<br />\r<br />\r<br />[u]The Dungeons (Sotteranei/Segrete)[/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/8601/?]Pagina di download[/url]\r<br />\r<br />The Dungeons include 115+ effetti sonori che aggiungono vita ai dungeon. Il nemico che abita un dungeon si farà sentire. All’entrata, si sente anche il tempo esterno. Se c’è una tempesta furiosa fuori, sentirai il tuono rombare nel forte o nella caverna.\r<br />C’è un set di suoni per ogni tipo di dungeon: Caverna, Rovine Dwemer, Forti e Fogne. Questi suoni si riproducono in questi dungeon indipendentemente da chi o cosa vive dentro. Per renderlo più vivo, i dungeon abitati dai Falmer o dai Non Morti hanno il loro proprio set di suoni in aggiunta a quelli standard. I dungeon dei Non Morti hanno le grida o i lamenti degli zombie e spettri. Nei dungeon dei Falmer, sentirai occasionalmente le loro grida, un modo di comunicare con l’altro visto la loro natura cieca.\r<br />\r<br />\r<br />[u]Civilization (Civiltà)[/u]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/20193/?]Pagina di download[/url]\r<br />\r<br />Civilization è focalizzato sull’ aggiungere 223 nuovi effetti sonori alle città, villaggi, fattorie e luoghi remoti dove la civiltà è presente. Nelle città, puoi sentire il suono di un martello usato da un abitante che ripara qualcosa, i bambini che giocano, i cani che abbaiono o i gatti che combattono. Come ti avvicini alla porta principale di una taverna, i suoni dei clienti che chiaccherano da dietro la porta vengono riprodotti. Quando entri, alcuni clienti\r<br />rideranno ad alta voce, urleranno o romperanno qualcosa.\r<br />\r<br />Nelle fattorie o vicino, puoi sentire i suoni dei loro animali, se ne hanno alcuni. La maggior parte di questi effetti sonori possono essere sentiti  anche dentro gli edifici, collegando la cella interna con l’ esterno. Se prendo l’esempio della fattoria, puoi sentire la gallina se sei vicino alla finestra. Se piove, sentirai la pioggia colpire le finestre, se c’è una bufera, sentirai il fischio del vento freddo dalla finestra.\r<br />\r<br />\r<br />[color=#ffff00][b]Trailer[/b][/color]\r<br />\r<br />Ti invito a vedere e sentire il video trailer che mostra The Wilds in azione per avere un miglior panorama di quello che i suoni aggiunti fanno. Nota che i suoni riprodotti nel video sono molto più frequenti e ad alto volume allo scopo di mostrarti la varietà degli effetti sonori e per distinguerli facilmente da quelli vanilla. Nota anche che alcuni effetti sonori sono cambiati da allora.\r<br />\r<br />Finalmente, questa mod non sarebbe mai stato possibile senza il contributo di alcuni registratori audio e artisti da Freesound.org. C&#39;è un file nell&#39;archivio con i crediti di tutti quelli che hanno fatto i suoni. Un ENORME grazie a loro, altrimenti i suoni non sarebbero stati di così alta qualità.\r<br />Puoi vedere i crediti anche nella tabella Crediti sopra.\r<br />[color=#ffff00]\r<br />[b]Sezione Tecnica - Compatibilità Mod[/b][/color]\r<br />Alcune mod richiedono una patch di compatibilità per lavorare con Sounds of Skyrim – The Wilds. Puoi trovare le patch nelle pagine di download delle mod. Se riscontri un conflitto che non è in elenco qui, per favore fammelo sapere nella tabella Forum.\r<br />\r<br />Ciò che segue è una lista di mod conosciute per essere compatibili o incompatibili.\r<br />\r<br />[color=#00ff00]Compatibile– Nessuna patch necessaria.[/color]\r<br />Open Cities Skyrim\r<br />Real Lights Overhaul \r<br />\r<br />[color=#ff7700]Compatibile– Patch richiesta.[/color]\r<br />Sounds Propagation Overhaul\r<br />Realistic Colors and Real Nights (RCRN)\r<br />Climates of Tamriel\r<br />Climates of Tamriel-Sounds\r<br />Climates of Tamriel-WinterEdition\r<br />\r<br />[b][color=#ffff00]FAQ[/color][/b]\r<br />\r<br />[b]D:“I suoni nel video sono troppo forti o/e il ritardo tra loro è troppo breve.”[/b]\r<br />R:Ciò è stato fatto di proposito nel video. Il volume alto permette di dinstinguerli dai suoni predefiniti e l’alta frequenza ti permette di farti sentire il maggior numero di suoni possibili per dare una bella anteprima di quello che la mod fa. Nel gioco, il volume è molto più basso e i suoni non si riproducono così frequentemente.\r<br />[b]\r<br />D:“Non mi piace “quel” o “questo” suono. Cosa posso fare?”[/b]\r<br />R:Hai due opzioni disponibili per rimuovere un suono o gruppi di suoni. Primo, c’è un file di suono silenzioso nella cartella dei suoni della mod che puoi usare per sovrascrivere l’effetto sonoro che non desideri sentire. \r<br />[b][color=#ff0000][i](Nota del traduttore: Ok, e il secondo quale sarebbe? [/i](ಠ ͟ʖಠ)[i] )[/i][/color][/b]\r<br />\r<br />[b]D:“Sounds of Skyrim riduce le prestazioni?”[/b]\r<br />R:No. Il modo dei nuovi suoni di riprodursi è lo stesso modo dei suoni predefiniti del gioco.",
  "categoryId": "61",
  "version": "1.13",
  "author": "Cliffworms",
  "createdUnix": "1476037013",
  "updatedUnix": "1476183338",
  "containsAdultContent": false,
  "uploadedBy": "NerdissimoPC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000223833",
      "name": "Sounds of Skyrim - The Wilds 1_13 Full Version",
      "version": "1.13",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "234",
      "fileName": "Sounds of Skyrim - The Wilds 1_13 Full Version-79291-1-13.7z",
      "uploadedUnix": "1476183338",
      "modVersion": "1.13",
      "virusScanUrl": "https://www.virustotal.com/file/ff94266bf3dd9650fbedea8044662915ba3006af5aac1f802041938791b502e9/analysis/1476183363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sounds%20of%20Skyrim%20-%20The%20Wilds%201_13%20Full%20Version-79291-1-13.7z?fid=1000223833&ttl=1535867982&ri=8192&rs=8192&setec=55e5585fc2dd2c628d9ccdb749bb6346"
    }
  ]
}