{
  "modId": 79364.0,
  "modName": "Immersive Armors v8 - spanish",
  "summary": "Traducción al español de la versión 8 del mod Immersive Armors",
  "descriptionHtml": "Traducción al español de la versión 8 del mod Immersive Armors.\r<br />\r<br />[b][u]Cuestiones:\r<br />[/u][/b][b]\r<br />[/b][b]*[/b]Aún estoy pensando como corregir el nombre de los Yelmos de las armaduras Nórdicas puesto llevan lo que vendría a ser un &#34;espectáculo&#34;  es decir una protección en los ojos por lo que las opciones in-game quedan en Yelmo y Yelmo Espectáculo pero queda raro a la lectura aunque dado que es algo menor tal vez no le preste atención, se aceptan sugerencias. \r<br />\r<br />[b]*[/b]Los scripts no están traducidos, ni bien los edite surgieron un par de bugs ocasionados por la traducción. De todas formas son 4 lineas que no suelen verse salvo la primera vez que se inicia el mod, en la desinstalación o la actualización. \r<br />[b]\r<br />*[/b]Voy a destacar que le dedique bastante atención a los libros ya que en otras versiones estaban horriblemente traducidos, de todas formas el nivel de ingles de la armadura Ritual de Boethiah es bastante alto por lo que capaz en el vicio del ojo se me escapo algo, cualquier error me avisan.\r<br />\r<br />[b]*[/b]Aclaro que en el libro de la Armadura Ritual Boethiah por momentos se le menciona como hombre y por momentos como mujer, esto esta hecho adrede ya que a este &#34;Príncipe Daedra&#34; en el lore de TES no tiene un sexo definido y se presenta según como le apetezca/convenga por lo que en el libro decidí según en que momento se leía mejor escribir como si fuera masculino o femenino. Esto como varios sabrán es diferente en el idioma ingles ya que la mayoría de las palabras no tienen terminaciónes según el sexo del individuo. \r<br />\r<br />[b][u]BUG Carreta inicio del juego\r<br />[/u][/b]\r<br />Comparto esto que me ocurrió debido a que como experiencia personal coincidió con que instale el Immersive Armors 8 y llegue a creer que lo que causaba este problema era el propio mod o mi traducción.\r<br />\r<br />En fin, es un bug por lo visto bastante famoso que ocasiona que el carruaje del principio se descontrole y vuele para todos lados provocando todo tipo de situaciones, por lo visto esto sucede con juegos que tienen mods con scripts que entran en conflicto con los scripts vanilla o menos probablemente por una tasa de frames mayor a 60. Personalmente pude solucionarlo con este [url=http://www.nexusmods.com/skyrim/mods/65538/?]fix[/url], también tiene una opción de compatibilidad con SMIM y hay una versión para el mod Touring Carriages pero como no uso este mod no sabría decir si funciona.\r<br />\r<br />\r<br />No se olviden de darle endorse al mod [url=http://www.nexusmods.com/skyrim/mods/19733/?]original[/url] de [url=http://www.nexusmods.com/skyrim/users/3656551]hothtrooper44[/url]",
  "categoryId": "54",
  "version": "8",
  "author": "hothtrooper44",
  "createdUnix": "1476279794",
  "updatedUnix": "1476279852",
  "containsAdultContent": false,
  "uploadedBy": "baluson",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000223930",
      "name": "Immersive Armors v8 - spanish",
      "version": "8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "150",
      "fileName": "Immersive Armors v8 - spanish-79364-8.rar",
      "uploadedUnix": "1476279852",
      "modVersion": "8",
      "virusScanUrl": "https://www.virustotal.com/file/0c62722a523d75d8ec6c5bede14a9cc99fe6fc531fc2ad225db02a25e828e939/analysis/1476290943/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Immersive%20Armors%20v8%20-%20spanish-79364-8.rar?fid=1000223930&ttl=1535868037&ri=8192&rs=8192&setec=26aba4161768cd035b9d0257326d2792"
    }
  ]
}