{
  "modId": 79407.0,
  "modName": "Finnloch",
  "summary": "A small island with a Hogwarts style library at its top. This is not a completed mod, but I don&#39;t have time to keep working on this, so I thought I would put it up for others to check out. Feel free to use or expand on it if you want to. The worldspace is accessed by a linking book under a table in the Winterhold College Arcanaeum. ",
  "descriptionHtml": "A small island with a Hogwarts style library at its top. This is not a completed mod, but I don&#39;t have time to keep working on this, so I thought I would put it up for others to check out. Feel free to use or expand on it if you want to. The worldspace is accessed by a linking book under a table in the Winterhold College Arcanaeum. Just read it and you&#39;ll be whooshed away. Read the other book on the shore and you&#39;ll go back. Note that this does not support companion transport currently.\r<br />\r<br />This was originally going to be a large project, with a Myst style world traversing system. I always felt the Black Books in Dragonborn were a wasted opportunity, and instead of being mysterious puzzle filled worlds, they were just a small dungeon with some enemies to fight. So I wanted a system of strange worlds and magic that would be like a interlocking maze, connected by books. As it is, life caught up with me, and I gave up on making more than what is here. There are a few locations I made that aren&#39;t linked to the main world, like a slaver&#39;s compound, and the Worm Trench, and the Caul. If anyone wanted to make this work, they&#39;re welcome to. ",
  "categoryId": "89",
  "version": "0.1",
  "author": "Seelabin",
  "createdUnix": "1476403652",
  "updatedUnix": "1476403478",
  "containsAdultContent": false,
  "uploadedBy": "Seelabin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000224125",
      "name": "Finnloch",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1352",
      "fileName": "Finnloch-79407-0-1.zip",
      "uploadedUnix": "1476403478",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/683ca42369497723632eb9acd9f519d469e38a40d0b24bbebe2ff150d0931dd7/analysis/1476403504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Finnloch-79407-0-1.zip?fid=1000224125&ttl=1535868080&ri=8192&rs=8192&setec=33a88610ae27a0ae4a1b3af383fb057d"
    }
  ]
}