{
  "modId": 79424.0,
  "modName": "Xbox ini settings and tutorial",
  "summary": "Hello ladies and gentlemen.\r<br />\r<br />So for a while around the internet people have been asking what settings are skyrims settings on the xbox 360 version. So I looked into it and changed some ini settings. And by following this tutorial you can achieve this.",
  "descriptionHtml": "Hello ladies and Gentlemen\r<br />\r<br />[b]WARNING YOU MUST FOLLOW THESE STEPS TO GET THE PERFECT OUTCOME [/b]So for a while around the internet people have been asking what settings are skyrims settings on the xbox 360 version. So I looked into it and changed some ini settings only some for shadows. But it does set your shadows to low but they look pretty good because what I did in the ini. So this just changes your settings and some shadow options in your ini. Now another thing I would recommend doing is dowloading a simple mod that caps your FPS so if you have a PC that can&#39;t do 60 FPS all the time, or 50-60 when looking at the ground or sky but when looking forward it drops I would recommend using the cpping mod and cap it at 30 FPS the same as the xbox 360 version.Link to fps cap mod    http://www.nexusmods.com/skyrim/mods/34/?WARNING make backup of your current ini.Install/ 1) place the ini in C:&#92;Users&#92;Kris&#92;Documents&#92;My Games&#92;Skyrim2) If your setting are set to high change them to these.Resolution is up to you.Antialising should be 2 samplesAnisotropic filtering should be OffGO INTO ADVANCED SECTIONChangeTexture quality High but people have been saying xbox is medium but there is small differance.Radial Blur LowShadow detail low (don&#39;t worry the ini should make them look good)Decal quantity MediumNo FXAAAnd all water checkboxes offNow start skyrim and you are now playing 360 version.",
  "categoryId": "62",
  "version": "v1.00",
  "author": "Cutesie",
  "createdUnix": "1476452753",
  "updatedUnix": "1476452750",
  "containsAdultContent": false,
  "uploadedBy": "Cutesie",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000224185",
      "name": "Xbox ini setting tutorial",
      "version": "v1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Xbox ini setting tutorial-79424-v1-00.rar",
      "uploadedUnix": "1476452750",
      "modVersion": "v1.00",
      "virusScanUrl": "https://www.virustotal.com/file/4c8d022fd04aea74edcce5cbbbd5f371f1c14c7eda350c5d6298a020c8d3e135/analysis/1476452763/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Xbox%20ini%20setting%20tutorial-79424-v1-00.rar?fid=1000224185&ttl=1535868095&ri=8192&rs=8192&setec=54d4c05c24210ce09e922f9edc36d738"
    }
  ]
}