{
  "modId": 79586.0,
  "modName": "2k Lip Tints - All Races - Better Coverage",
  "summary": "Inspired by Seductive Lips HD. 2k lip tints for women of all races, traced over normal maps and designed for better coverage. Tested with Real Girls normals and SG normals.",
  "descriptionHtml": "I wanted a lip tint for my female characters that would cover the whole lip area without leaving any weird edges. So I made these.\r<br />\r<br />I have tried several high-res lip tints already only to find that they don&#39;t quite match up to the normal maps I favor, which are either Real Girls Realistic Textures normals or SG Textures Renewal normals (or the ones made by rxkx22 for the Bijin, Seranaholic, etc mods).\r<br />\r<br />I like to cover my entire lip area when I do my makeup in real life so seeing a conspicuous edge to a lip tint in Skyrim makes me want to fix the issue. I made these with Paint.net.\r<br />\r<br />To make it look right, you&#39;re going to want to use the SKSE ini tweak so that your facial tints will be 2k resolution. This obviously requires SKSE. Copy and paste the following into your SKSE ini:\r<br />\r<br />[Display]\r<br />iTintTextureResolution=2048\r<br />\r<br />I hope someone finds these useful and I mean no disrespect to other high-res tint creators with this mod... I just wanted to address something that has bugged me personally. The Seductive Lips screenshot is just an example of the issue I&#39;m seeking to address, not in any way an attack or discredit to that mod or its maker.",
  "categoryId": "62",
  "version": "2.0",
  "author": "Miriam",
  "createdUnix": "1476938226",
  "updatedUnix": "1477068049",
  "containsAdultContent": false,
  "uploadedBy": "evgirunslaad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000225075",
      "name": "2k Lips",
      "version": "2.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "39",
      "fileName": "2k Lips-79586-2-0.zip",
      "uploadedUnix": "1477068049",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/88ca55a94c0c1c596765ae5b6394f3b36a12c299086f0e6cbd7527de0a7a9020/analysis/1477068062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/2k%20Lips-79586-2-0.zip?fid=1000225075&ttl=1535868244&ri=8192&rs=8192&setec=974c0054bc1d2b44a5374b15d332e73f"
    }
  ]
}