{
  "modId": 79668.0,
  "modName": "Equal Racial Speed",
  "summary": "Make each race move at the speed of an altmer regardless of height.",
  "descriptionHtml": "Makes each race in Skyrim move at the same speed of an altmer regardless of height rather than being slower if they were shorter.\r<br />\r<br />In vanilla Skyrim, each race has a scale which multiplies their height (the default scale being 1.0) but also has the side effect of multiplying their speed as well.  This means that an Altmer with a scale of 1.08 is slightly faster than a female Khajiit with a scale of 0.95.  This difference is small, but to me it&#39;s actually rather noticeable, and I keep not wanting to play as the shorter races because they feel slower.\r<br />\r<br />This mod aims to fix this issue by giving each race (except for Altmer) a slight speed bonus to compensate for their scale, making each have an effective speed of 1.08.\r<br />\r<br />To facilitate this fix, I&#39;ve also made it so that males and females of the same race have the same scale.  This effects Khajiit (now 1.0), Redguards (now 1.0), Argonians (now 1.0), Bretons (now 0.98), and Bosmer (now 0.95).  So make sure this is loaded after any other mod that might change scale.\r<br />\r<br />Notes: since this works by adding abilities to preexisting races (and their vampire counterparts) this means that any custom race added will not gain any sort of speed bonus to compensate for their height.\r<br />I probably could have made it so that each race moves at 1.0, but I like being faster rather than slower.\r<br />Although the base game has no fortify speed effect, any fortify speed effect added by another mod will still be slightly more effective on races with a higher scale.",
  "categoryId": "84",
  "version": "1.0",
  "author": "Squid AKA Lorkrish",
  "createdUnix": "1477238791",
  "updatedUnix": "1477238774",
  "containsAdultContent": false,
  "uploadedBy": "Lorkrish",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000225358",
      "name": "Equal Racial Speed",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "98",
      "fileName": "Equal Racial Speed-79668-.zip",
      "uploadedUnix": "1477238774",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3f02e8db27a8504a6aa8d50a6c8780e6262dae61238e022c7c0862c5d3f89d93/analysis/1477238825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Equal%20Racial%20Speed-79668-.zip?fid=1000225358&ttl=1535868329&ri=8192&rs=8192&setec=6b8734490f0d5e031f4c7535f5dee01c"
    }
  ]
}