{
  "modId": 79661.0,
  "modName": "Greek Armor Upgraded",
  "summary": "An update to Sirwho&#39;s Greek Armor to add blacksmithing, upgrading, Dual Sheath Redux files and endgame version of his armors and weapons.",
  "descriptionHtml": "[center][size=4][b][u]THIS MOD NEED [url=http://www.nexusmods.com/skyrim/mods/64215/?]SIRWHO&#39;S GREEK ARMOR REVAMPED[/url], AND AN UP TO DATE SKYRIM TO WORK &#33;\r<br />UNP, CBBE and ADEC NOT SUPPORTED\r<br />\r<br />[/u][/b][/size][/center][size=4][b][u]\r<br />[size=2]\r<br />[/size][/u][/b][size=2]This mod is an update to Sirwho&#39;s mod. It adds the ability to forge the Greek armors, including clothing, and upgrade them. It also make some heavy armor part available also as light armor items to make a complete Greek light armor set. Finally, I added some [url=http://www.nexusmods.com/skyrim/mods/34155/?]Dual Sheath Redux[/url] files (improved over dptheslothking&#39;s &#34;[url=http://www.nexusmods.com/skyrim/mods/64647/?]a lot of dual sheath redux patches[/url]&#34;) for those who want to have the shield in the back (you need [url=http://www.nexusmods.com/skyrim/mods/34155/?]Dual Sheath Redux[/url] mod for that). A full log of what this mod add is available at the end of the page.\r<br />\r<br />I provide no support for UNP, CBBE and ADEC. It should work, but quite frankly I have no idea, since I don&#39;t use those mods myself.\r<br />\r<br />[u]How to install (using a mod manager, [b]recommended[/b]) :\r<br />[/u]-Download Sirwho&#39;s mod [url=http://www.nexusmods.com/skyrim/mods/64215/?]here[/url]\r<br />-Install following his instructions\r<br />-Download and install this mod\r<br />-If asked to replace some files, click yes\r<br />[/size][/size][size=2]-(optional) If using Dual Sheath Redux, run the Dual Sheath Redux patcher (for more information check the mod page [url=http://www.nexusmods.com/skyrim/mods/34155/?]here[/url]). \r<br />-Make sure my mod is loaded after Sirwho&#39;s, and after &#34;[url=http://www.nexusmods.com/skyrim/mods/64647/?]A lot of dual sheath redux patch[/url]&#34; if you have it.\r<br />-Launch the game\r<br />[/size][size=2]\r<br />[/size][size=2][u]\r<br />[/u][u]How to install (manually, [b]not recommended[/b]) :\r<br />[/u]-Download Sirwho&#39;s mod [url=http://www.nexusmods.com/skyrim/mods/64215/?]here[/url]\r<br />-Install following his instructions\r<br />-Download this mod and unzip it in your skyrim/data folder (C:&#92;Program Files&#92;Steam&#92;SteamApps&#92;common&#92;skyrim&#92;Data)\r<br />-If asked to replace some files click yes\r<br />[/size][size=2]-(optional) If using Dual Sheath Redux, run the Dual Sheath Redux patcher (for more information check the mod page [url=http://www.nexusmods.com/skyrim/mods/34155/?]here[/url]). \r<br />-Check my patch in the Skyrim launcher &#34;data files&#34; menu, and make sure my mod is loaded after Sirwho&#39;s mod and if you have it, dptheslothking&#39;s [size=2]&#34;[url=http://www.nexusmods.com/skyrim/mods/64647/?]A lot of dual sheath redux patch[/url]&#34;[/size]\r<br />[/size]-Launch the game\r<br />\r<br />\r<br />[u]How to craft the armors/clothing ?[/u]\r<br />The armors exists in 2 varieties now. The heavy armor is either steel or dragonplate for gameplay purpose. The light armor is either Elven or dragonscale. \r<br />\r<br />If you have the appropriate perks (steel, Elven or dragon armor smithing, depending), you can craft them at any forge. They use the same material than the vanilla equivalent. \r<br />\r<br />You can craft the clothing without any perks in any forge.\r<br />[u]\r<br />How to craft the swords ?[/u]\r<br />You can craft the falcata and the xiphos at any forge, if you have the perk (Dwemer or Daedric smithing). You can make either a Dwemer version or a Daedric version.\r<br />\r<br />[u]How to improve them ?\r<br />[/u]You can improve them at any grindstone, as long as you have the ingredient (they use the same than their vanilla equivalent). If you have the proper perk, you can improve them further (similar to vanilla).\r<br />\r<br />[u]I don&#39;t want to forge them &#33;\r<br />[/u]The Sirwho&#39;s original item are still in a chest in the Warmaiden and in the Blue Palace in Solitude. For my items, you&#39;ll have to cheat. Type help name of the item , search the code for it, and them type player.additem code 1 . For example, help falcata then player.additem 010a62 1 . That&#39;s just an example, the code will be different.\r<br />\r<br />\r<br />\r<br />\r<br />[b][u][size=4]Frequently Asked Question[/size]\r<br />\r<br />Do you have Sirwho&#39;s permission ?\r<br />[/u][/b]Yes I do. He told me it was OK. [b][u]\r<br />\r<br />[/u][/b][u]The shield on the back is cool, but it&#39;s not on the mod, the screens lies &#33;\r<br />[/u]They are part of the Dual Sheath Redux mod, which you can download [url=http://www.nexusmods.com/skyrim/mods/34155/?]here[/url]. My mod add the proper files to make it work.\r<br />\r<br />[u]I don&#39;t need the dual sheath redux files &#33;[/u]\r<br />Don&#39;t worry, they will not do anything on their own.[b][u]\r<br />\r<br />[/u][/b][u]I want those armor added to XXX faction &#33;[b] I want more stuff &#33;[/b][/u][b][u]\r<br />[/u][/b]I&#39;m sorry, I&#39;m only going to do bugfixing.\r<br />\r<br />[u]Why are you doing a patch, and not giving the files to Sirwho&#39;s or dptheslothking (for the DSR files) ?\r<br />[/u]Sirwho told me he was busy IRL, and allowed me to make this patch. I keep his files mandatory because otherwise I would have to copy his mod, and that wouldn&#39;t be nice on various level.\r<br />As for dptheslothking, I tried to contact him through his mod page and Nexus private message, and he never answered. The DSR files I added are also my own, his version was off by a large margin (like 50cm on the right and tons of clipping). I feel that having the DSR files directly from the mod is easier anyway.\r<br />\r<br />[u]Dptheslothking already made a DSR patch, why would I need yours ?\r<br />[/u]Because his version is off, to put it lightly.  The shield was very off center, and I worked to make it right. I also removed as much clipping as I could.\r<br />\r<br />[u]The shield clip sometimes with DSR, plz fix &#33;\r<br />[/u]The shield are very big. About twice the size of vanilla shields. I couldn&#39;t prevent clipping entirely without having the shield float far away from the body. That&#39;s the best I could do. The clipping is very limited, and the shield is not too far back.\r<br />\r<br />[u]Why no support for UNP, CBBE and ADEC ?\r<br />[/u]I don&#39;t own those mods, and I have no idea how they work. It&#39;s that simple.\r<br />\r<br />[u]Why the armor are dragon armor, while the weapon are Daedric and not dragon to ?\r<br />[/u]Dragon armor crafting was added to vanilla with a free patch. Dragon weapons are part of a DLC. I don&#39;t want to bother everyone with optional files and also I&#39;m lazy. Daedric is good enough.\r<br />\r<br />[u]Do the armor benefit from matching armor perks/smithing perk ?\r<br />[/u]They should. For the game they are similar to their equivalent in every way possible besides appearance.\r<br />\r<br />[u]I love this mod/armor &#33; I want to thank you/donate for it &#33;\r<br />[/u]This is Sirwho&#39;s work. Without him, you would not enjoy this mod. So, thank him first. I just did a patch to make it better.\r<br />\r<br />[u]How do I use a cool spear like in the screenshots ?[/u]\r<br />Check Soolie&#39;s spear mod or Soolie&#39;s reanimate mod.\r<br />\r<br />[u]There is an issue/bug &#33;\r<br />[/u]If it&#39;s gameplay related, then let me know. I&#39;ll try to fix it. There is a lot of items and each of them have 3entries minimum in the CK. That&#39;s a lot of item, and I can&#39;t possibly check them all 1 by 1.\r<br />If it&#39;s graphical related, that&#39;s Sirwho&#39;s.\r<br />\r<br />\r<br />\r<br />\r<br />[u][b][size=4]Complete changelog over Sirwho&#39;s mod :[/size]\r<br />[/b][/u]-added dual sheath redux files (cloak and no cloak files)\r<br />-added a light armor version for all the helmets, bracers and shields\r<br />-added a light armor version for the sandals\r<br />-added smithing for all the armor pieces, weapons and clothing\r<br />-added tempering for all the armor and weapons\r<br />-added a dragonscale light armor version, and a dragonplate armor version for all the armors\r<br />-added a daedric version of the weapons\r<br />-corrected some typos\r<br />\r<br />[u]\r<br />Known issues (minor, not going to be fixed):[/u]\r<br />-Some of the helmet picture is on the text on the forge menu\r<br />-The linothorax use a generic elven armor picture on the forge (doesn&#39;t affect the item once forged)\r<br />\r<br />\r<br />[u]License :\r<br />[/u]You are free to use this patch, as long as you you don&#39;t include Sirwho&#39;s files in it, and mention me. You are not allowed to publish it on steam or make a profit out of it.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Erei",
  "createdUnix": "1477728332",
  "updatedUnix": "1477728001",
  "containsAdultContent": false,
  "uploadedBy": "erei",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000226027",
      "name": "Greek armor patch",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59",
      "fileName": "Greek armor patch-79661-1-0.7z",
      "uploadedUnix": "1477728001",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/334289a92beb71c751403e0542185a03d6469f165a6b3e46340067ba0cce0973/analysis/1477728004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Greek%20armor%20patch-79661-1-0.7z?fid=1000226027&ttl=1535868322&ri=8192&rs=8192&setec=6da95c5d5aebfaff227401441d6a35d4"
    }
  ]
}