{
  "modId": 79712.0,
  "modName": "Norkers",
  "summary": "Adding some seafaring components to Skyrim&#39;s Nords.",
  "descriptionHtml": "First and most important, as of 10/25/2016 this mod is a WIP. I&#39;m posting the mod in this state in hopes of getting some feedback on the idea and to see if there is some glaring problem I might have missed.\r<br />\r<br />It frustrates me that many of the Nord ruin tile sets are termed &#34;dwelling&#34; in the CK, but the only thing inhabiting them are bandits, necromancers and the Forsworn. Also, I don&#39;t know how many of you played Morrowind but from what I remember of that game and what Tamriel lore says, the Nords are at home at sea. Skyrim, the game, didn&#39;t include much in the way of that. If the Nords are to be described from that game, they are a bunch of drunken, racist farmers whose ancestors were into unbelievably large underground earthworks dedicated to honoring corpses. \r<br />\r<br />What started as an attempt to build a Nord home out of Nord ruins turned into something else. I don&#39;t have the talent to build ship movement into the game or, sadly, to create whales to hunt. But I thought I might try to add some of the seafaring life back in. The goal of this mod will be to create some (faux) Nord ship traffic on the Sea of Ghosts, with occasional Nord hunting parties after horkers and to fish. One or two small, isolated communities whose livelihood centers around fishing and coastal living will be added. A vendor for fish, shellfish and horker meat will visit the Windhelm/Solitude docks on a periodic basis, much like the Khajit caravans. An old Nord dwelling on an island called Stormhaven will provide safety for fisherman during inclement weather, and possibly provide a quest. Some limited options for fast travel to Sea of Ghosts communities will be added. Near Pilgrim&#39;s Trench a hostel will be added to provide shelter for the Talos shrine there (replacing the unused Trius quest pieces).\r<br />\r<br />List of partially completed components:\r<br />\r<br />- Stormhaven, island construction. Stormhaven is built on a vanilla island almost directly north of Orphan&#39;s Tear, and (if you have Dawnguard) east of Castle Volkihar. I plan to build in a fast travel option via a dock, but right now you have to either swim out there, add in the map marker via console &#34;tmm 1,1,1&#34;, or coc travel there with &#34;coc asnorkerstormhavenext03&#34;.\r<br />\r<br />I&#39;ve modified Stormhaven since the initial release. Temple was reworked and main interior was reworked and expanded. Custom meshes were created for these cells. They&#39;re vanilla meshes that I&#39;ve attempted to clean up a little by removing the plant life and detritus. Stormhaven should look like an aged structure but still in use, so the ferns sticking out of the walls and ivy hanging down in the rooms needed to go. The plant life and ropes didn&#39;t have collision geometry anyway so that&#39;s not a problem, but the collision geometry for the big ceiling log is still there. In normal play I couldn&#39;t find where this caused a problem. Players can&#39;t normally jump that high, and if they could it would be no use in those tiles.\r<br />\r<br />Stormhaven is connected up and should be fine to run around in. Eventually there will be a temple priest NPC and a small family that acts as caretakers. I would like to have a set of NPC Nords visit Stormhaven every so often and utilize the community area, but we&#39;ll see if I&#39;m smart enough to script it. Should be fully navmeshed. I had some issues getting followers to follow me up the exterior steps to the tower, not sure if I got them fixed yet.\r<br />\r<br />- Talos shrine hostel, built on the cell where the unused quest for Trius&#39; camp was located, south of Pilgrims Trench. The plan is to add Nord NPCs to travel to the hostel occasionally. It can otherwise act as a freebie sleep area and shelter for players, with a very few options. I don&#39;t intend to turn it into a one-stop crafting shop. I thought I disabled the Trius camp map marker, but it might still be there if you&#39;re using something like Atlas. Whoever designed and built the landscape in that area needs a pat on the back. It&#39;s one of the most starkly beautiful areas in the game. Navmeshed.\r<br />\r<br />- Small coastal community east of Northwatch Keep and west of Broken Oar Grotto. Four homes spaced out, and an underground hovel on the island just offshore near the land grab flag. No NPCs yet, but plan to make one of them a blacksmith (already have the crafting area set up) and the rest fishing families. If you want to fast travel there, you can use &#34;coc asnorkerlandgrabext01&#34;: that&#39;s the vanilla coc marker. What I&#39;ve added here should be navmeshed.\r<br />\r<br />- One house across the river from the Windhelm docks. It shares the Hlaalu Farm cell so I won&#39;t add an additional map marker; might alter the name of the existing marker. House will be owned by a couple of Nord brothers, one who is a fisherman and the other a channel pilot. Custom boat reference created so I could add snow accumulation. Navmeshed.\r<br />\r<br />- One Morrowind-style shack along the river between the Solitude docks and the sawmill. This relies on resources from Phitt and Tamira (http://www.nexusmods.com/skyrim/mods/60125/?). Their conversions were excellent. The only thing I have attempted is tweaking some of the textures to help them fit into Skyrim. The current location for that shack might conflict with the more popular Solitude docks mods, and if so I&#39;ll try to make it fit with those. There will be one more shack like this one only smaller, and it will be somewhere in the swampy region between the Solitude docks and Morthal.\r<br />\r<br />The directory structure for the new meshes should be present in the zip file. Copy the &#34;meshes&#34; and &#34;textures&#34; directories to your Skyrim Data directory. If you&#39;ve already installed a previous version of Norkers, you can overwrite it. I&#39;ve cleaned this version with TESVedit, and I&#39;ve experienced no CTDs while testing it. The only requirement is vanilla Skyrim. USKP or USLEEP not required (but recommended whether or not you use this mod). Any feedback is encouraged and welcome. \r<br />\r<br />\r<br />KNOWN CONFLICTS with 0.262:\r<br />[url=http://www.nexusmods.com/skyrim/mods/34492/?]&#34;Northern Encounters&#34;[/url] :: no plans to change this, design choices are too radically different.\r<br />[url=http://www.nexusmods.com/skyrim/mods/28283/?]&#34;Inns and Taverns&#34;[/url] v2.3, which is excellent and should have been how the standard vanilla inns were built from the start. :: Right now it&#39;s mostly a conflict with navmeshing and cell naming. One of menathradriel&#39;s inns is across the road from one of my houses. No conflict there, but the navmeshing gets goofy. Her ghost&#39;s idle markers are at the land grab flag where I have a nord hut, and she renames one of the cells that I do. I&#39;d like to get Norkers working with her mod, because an inn at that location would work great with what I&#39;m building. Will see what I can work out. For now, load her mod *after* Norkers and avoid my structures if you have followers.\r<br />\r<br />POTENTIAL CONFLICTS with 0.262 and future versions\r<br />I&#39;m not going to add many more structures to the map. The plan is to add a ship or ships and some fishing boats that tie up at various points along the northern coasts and out on the Sea of Ghosts. Any mod that adds structures or spawns out there can potentially conflict. I haven&#39;t decided on locations yet. When I have time I am looking at some of the more popular mods (for example, &#34;Sea of Ghosts&#34; by thirteenoranges) to try an avoid a conflict. \r<br />\r<br />ps. the name comes from being unable to say &#34;Nords hunt horkers.&#34;\r<br />\r<br />Tools used (so far):\r<br />\r<br />CK\r<br />TESVEdit\r<br />Nifskope 1.2\r<br />Photoshop CS4\r<br />FO3 Archive Utility (to dig into the BSAs)\r<br />\r<br />Additional credits:\r<br />[url=http://www.nexusmods.com/skyrim/mods/60125/?]Phitt and Tamira&#39;s Sheogorad Resource[/url]",
  "categoryId": "89",
  "version": "0.262",
  "author": "anothersunday",
  "createdUnix": "1477429421",
  "updatedUnix": "1481768474",
  "containsAdultContent": false,
  "uploadedBy": "grimjaw5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000225570",
      "name": "norkers.esp",
      "version": "0.204",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "13",
      "fileName": "norkers.esp-79712-0-204.zip",
      "uploadedUnix": "1477429377",
      "modVersion": "0.204",
      "virusScanUrl": "https://www.virustotal.com/file/05957ebd23f71e3ee6445d23c358d7cc5b9667ce692f9a063a889edd1576a3c0/analysis/1477429383/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/norkers.esp-79712-0-204.zip?fid=1000225570&ttl=1535868372&ri=8192&rs=8192&setec=c73492b177073346449183761a3f5a21"
    },
    {
      "fileId": "1000226916",
      "name": "norkers.zip",
      "version": "0.244",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3068",
      "fileName": "norkers.zip-79712-0-244.zip",
      "uploadedUnix": "1478290547",
      "modVersion": "0.244",
      "virusScanUrl": "https://www.virustotal.com/file/c1959a4a69995ad9369ab26b188cee335df312e98bdf53c3ca4db45bb3a70c99/analysis/1478290565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/norkers.zip-79712-0-244.zip?fid=1000226916&ttl=1535868373&ri=8192&rs=8192&setec=acfedff64685309a5287cc277ba75872"
    },
    {
      "fileId": "1000228384",
      "name": "norkers.zip",
      "version": "0.251",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4636",
      "fileName": "norkers.zip-79712-0-251.zip",
      "uploadedUnix": "1479403048",
      "modVersion": "0.251",
      "virusScanUrl": "https://www.virustotal.com/file/c67ffeaa8885d862ffd2c8185cc74128d6dc2f5999c4b8cfefb991f06b336747/analysis/1479403083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/norkers.zip-79712-0-251.zip?fid=1000228384&ttl=1535868373&ri=8192&rs=8192&setec=1fc3fc8c9714d08fe402c062ff81dfe0"
    },
    {
      "fileId": "1000230930",
      "name": "norkers.zip",
      "version": "0.262",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6829",
      "fileName": "norkers.zip-79712-0-262.zip",
      "uploadedUnix": "1481768474",
      "modVersion": "0.262",
      "virusScanUrl": "https://www.virustotal.com/file/b2e3888159a495175e8f4e909eee30caac2b79060df0997943590e582758c022/analysis/1481768524/",
      "changelogHtml": " 0.262\r<br />- Added interiors to houses existing as of this version; clutter pending.\r<br />- Exteriors navmeshed, new interiors not navmeshed yet. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/norkers.zip-79712-0-262.zip?fid=1000230930&ttl=1535868374&ri=8192&rs=8192&setec=f044cdad750ad7393cdc499de5c0a85c"
    }
  ]
}