{
  "modId": 79784.0,
  "modName": "Athletik Combat - Realistic Movement and Dodging",
  "summary": "A modification of Vigor&#39;s movement tweaks to produce a more fluid and immersive experience.",
  "descriptionHtml": "[center][font=Tahoma][img]http://i.imgur.com/GkQGhDh.jpg[/img][/font][/center][center][/center][font=Tahoma]\r<br />\r<br />[size=6]\r<br />[/size][center][u][size=6]Description[/size][/u]\r<br />\r<br />[size=2]Explained @3:10: Thank you HX\r<br />[/size]Note: Movement speed now increased for mages in v1.1[/center][center][youtube]LvNQcG3y2ck[/youtube][/center]\r<br />\r<br />[size=3][b][u]Abbreviated:\r<br />[/u][/b]\r<br />This is a modification of Vigor&#39;s movement tweaks to produce a more fluid and immersive experience. Movement speed is mostly reduced but sometimes increased, depending on what direction you&#39;re moving (ie. backwards/forwards/strafe), if you have a weapon in hand, and what type of weapon. Additionally, the arc lengths of attacks are changed depending on the type of weapon and how fast you are moving. Although Athletik Combat makes fighting and movement feel more natural, the added realism increases the complexity of fights, making them more interesting and challenging in an intuitive and balanced manner for all combat styles. \r<br />\r<br />\r<br />[/size][b][u][size=3]Detailed:\r<br />[/size][/u][/b]\r<br />[size=3]   This is a simple script free mod that adjusts movement speeds and the amount that one can rotate mid swing or while casting. Rotational restriction might be one of the simplest and most significant improvements of Skyrim combat; without it, it&#39;s nearly impossible to dodge as NPCs will automatically spin in place. Imagine you teleport behind an NPC that&#39;s attacking you. In the vanilla game, the NPC will spin around like a ballerina and hit you. In contrast, with rotational restriction, when you execute an attack, you must aim at your target beforehand or you will miss and everyone will laugh at you. \r<br />\r<br />   I examined and tested several different mods available on the nexus with similar scope, and in my personal opinion, Vigor&#39;s movement tweaks produced the most dynamic and interesting combat. While sprinting, you could feel your inertia as you tried to change course. Blocking felt as if you were taking shelter behind your shield, bracing yourself with solid footing. Magic felt heavy and powerful, a force to be controlled. Archery felt cautious and steady. Each element of combat had unique movement and rotational settings, creating opportunities for the development of new strategies and tactics.\r<br />\r<br />   Overall, I felt Vigor&#39;s optional movement tweaks and attack commitment settings were excellent, but there were several things that I felt could be changed to significantly improve the combat experience (at least for me). Movement tweaks to draugr and mounted combat were left unchanged.[/size]\r<br />[size=3] \r<br />[/size][/font][color=#ffff00][size=4] Rotation: Attack Commitment[/size][/color]\r<br />[list]\r<br />[*][font=Tahoma][size=3]Rotation while attacking with 1 handed weapons is relatively less restricted  - basically, I figure that you should be able to twist at the waist to correct for a moving enemy. [/size][/font]\r<br />[*][font=Tahoma][size=3]Rotation while attacking with 2 handed weapons is more restricted than attacking with 1 handed weapons but less restricted than running and power attacks.[/size][/font]\r<br />[*][font=Tahoma][size=3]Rotation while performing a running attack is relatively more restricted.[/size][/font]\r<br />[*][font=Tahoma][size=3]Rotation while performing a power attack is relatively more restricted (though less so than vanilla because they are so easy to dodge). [/size][/font]\r<br />[*][font=Tahoma][size=3]Rotation speed while casting magic or drawing a bow is reduced (and further reduced when running)[/size][/font]\r<br />[/list][font=Tahoma][size=3]\r<br />[/size][color=#ffff00][size=4] [/size][/color][color=#ffff00][size=4]Movement Tweaks[/size]\r<br />[/color][list]\r<br />[*][size=3]Moving backwards was way too fast in vanilla, and way too slow in Vigor movement tweaks- as soon as you changed angles slightly, you moved quickly at the run left/run right speed. I increased the backwards movement speed back towards Vanilla to make this more fluid. It is still slower than side stepping or moving backwards at an angle, but not nearly so much. I didn&#39;t make them the same because having a slower backwards movement speed allows you to bait enemies into attacks which you can quickly sidestep. It also means that if you want to dodge an attack, running backwards isn&#39;t an option. You either need to side step, or turn around and expose your back (hits to that back result in increased damage received with both Wildcat and Vigor&#39;s conditional damage system). Overall though, the speed just feels more realistic.  [/size]\r<br />[*][size=3]Running with a two handed weapon is slightly slower than running with a bow, 1 handed weapon, or magic, because having to hold the weapon with two hands should slow you down some.[/size]\r<br />[*][size=3]Running with no weapon is slightly faster than running with a weapon/bow/magic[/size]\r<br />[*][size=3]Turning while running is slightly slower for a more natural feel. It also makes the running animation look more realistic when turning. [/size]\r<br />[*][size=3]Casting magic now slows you down[/size]\r<br />[*][size=3]Swimming is fairly fast, but turning while swimming is much slower. No more 360&#39;s in half a second. Again, this also makes the animations look better.  [/size]\r<br />[*][size=3]Walking is faster than vanilla and running can be either faster or slower depending on whether or not you have a weapon/magic sheathed, and the type of weapon.[/size]\r<br />[/list][/font]\r<br />[font=Tahoma][size=3][b]Required Mods[/b]\r<br />None\r<br />\r<br />[/size][/font][font=Tahoma][u][size=4][b]Recommended Mods\r<br />[/b][/size]\r<br />[/u][url=http://www.nexusmods.com/skyrim/mods/73921/?][size=4]Mortal Enemies[/size][/url][size=3]: this mod applies rotational restrictions to most enemies, not just NPC&#39;s. Load Athletik Combat after this mod. [/size]\r<br />\r<br />[b][size=4]Compatibility[/size][/b]\r<br />[list]\r<br />[*][size=3]Compatible with all combat mods, however, Athletik Combat must be loaded after them.[/size]\r<br />[*][size=3]Other movement tweak mods like Attack Commitment or Realistic Humanoid Movement Speeds will be overwritten by this mod.[/size]\r<br />[*][size=3]Note for Xbox Controller Users: Merging this mod or any mod which alters the Movement Type record may result in dysfunction of the sprint key. [/size]\r<br />[*][size=3]Safe to install or uninstall at anytime.[/size]\r<br />[/list]\r<br />\r<br />[u][b][size=4]Example Load Order\r<br />[/size][/b][/u]\r<br />[/font][size=3]1. Mortal Enemies.esp\r<br />[font=Tahoma]\r<br />[/font]2. Vigor.esp or W[/size]ildcat.esp[size=3]\r<br />[font=Tahoma]\r<br />[/font]3. Athletik Combat.esp[/size]\r<br />[font=Tahoma]\r<br />\r<br />[/font][center][font=Tahoma][u][size=4][b]Credits\r<br />[/b][/size]\r<br />[/u][size=3]I would like to give my thanks to the authors [color=#ffff00]Alx9ndre[/color], [color=#ffff00]ApolloDown[/color], and [color=#ffff00]taro8 [/color]whose mods served as the base for Athletik Combat. \r<br />\r<br />\r<br />[url=http://wiki.step-project.com/Guide:Open_Modding][img width=748,height=92]http://i.imgur.com/dhy1tdz.png[/img][/url]\r<br />[u]\r<br />[/u][/size][/font][size=6][u][color=#ffff00]My other Mods[/color]\r<br />\r<br />[/u][/size][/center][center][size=6][url=http://www.nexusmods.com/skyrim/mods/78936/?]SkyUI XL Font and Icons (with new default columns)[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/80352/?][img]http://i.imgur.com/BECDUIK.jpg[/img][/url]\r<br />[url=http://www.nexusmods.com/skyrimspecialedition/mods/4704/?][img]http://i.imgur.com/mDxyG7t.jpg[/img][/url]\r<br />[/size][url=http://www.nexusmods.com/skyrim/mods/75346/?][size=6][img]http://i.imgur.com/Hmp1Ln0.jpg[/img][/size][/url][url=http://www.nexusmods.com/skyrim/mods/79335/?]\r<br />[img]http://i.imgur.com/0XM14lH.jpg[/img][/url][/center]",
  "categoryId": "77",
  "version": "1.0",
  "author": "Megaloblast",
  "createdUnix": "1477696940",
  "updatedUnix": "1477696079",
  "containsAdultContent": false,
  "uploadedBy": "kojak747",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000225975",
      "name": "Athletik Combat",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "Athletik Combat-79784-1-0.7z",
      "uploadedUnix": "1477696079",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/73985958295611464ca57e57ec1b59aa0fed5ce928143b977b8a8a898cafe446/analysis/1477696083/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Athletik%20Combat-79784-1-0.7z?fid=1000225975&ttl=1535868440&ri=8192&rs=8192&setec=a4f396e434a8dcd335abf37a8babe4bc"
    }
  ]
}