{
  "modId": 79798.0,
  "modName": "GemCrucibleVanity",
  "summary": "Use a cooking pot to take gems out of jewelry and make more valuable ones.",
  "descriptionHtml": "Use a cooking pot to take gems out of jewelry (generally destroying the non-gem material, but in some cases you can choose between the non-gem material or the gem). Also use a cooking pot to combine 2 gems into a more valuable gem. Categories in order of increasing value are:\r<br />\r<br /> normal*\r<br /> flawless*\r<br />resplendent\r<br />radiant\r<br />brilliant\r<br />marquise\r<br />imperial\r<br />royal\r<br />spectacular\r<br />extraordinary\r<br />fabled\r<br />legendary\r<br />\r<br />*In the game normally, and only up to this level can be purchased.\r<br />\r<br />Gems cannot be broken down. Purely a mod for vanity and collecting, however I did make it slightly nicer on the formatting if anyone wants to use it for something else (by numbering the gems that aren&#39;t in the game from 0 to 9 in order of increasing value). Created other new items of onyx (a gem that 6 of which can be made from an ebony ingot), a copper ingot, a jade ingot, a small silver bar (when you convert a plain silver ring), and a small gold bar (when you convert a plain gold ring). 2 gems of a lower grade combine to make 1 gem of an upper grade.\r<br />\r<br />[size=4][u][b]WARNING[/b][/u][/size]: This mod can allow you to extract gems even from jewelry you have enchanted (though not from jewelry you haven&#39;t enchanted) and it will not use the name of that jewelry. So if you have a &#34;Player&#39;s ring&#34; renamed from a silver ring with an enchantment on it, it will still be in the pool for turning it into a small silver bar. I recommend taking off such jewelry before using the cooking pot to convert items.",
  "categoryId": "102",
  "version": "1.0",
  "author": "User_4079923",
  "createdUnix": "1477733234",
  "updatedUnix": "1477733221",
  "containsAdultContent": false,
  "uploadedBy": "User_4079923",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000226031",
      "name": "GemCrucibleVanity",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3",
      "fileName": "GemCrucibleVanity-79798-1-0.7z",
      "uploadedUnix": "1477733221",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/0a5569613b18b21aca6c7149063a0baff79ffd54661b4bb1aa232c18eea7f58d/analysis/1477733229/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GemCrucibleVanity-79798-1-0.7z?fid=1000226031&ttl=1535868455&ri=8192&rs=8192&setec=90f3c94896472309dca5fd9a4e94bccf"
    }
  ]
}