{
  "modId": 79813.0,
  "modName": "Extra Smooth Agence de Modele High Poly Mesh Mod with Mountains including Eyecandy Staff of Magnus Refracting Potions Parallax Soulgems and Ftoppka Smelter",
  "summary": "A mod to improve the appearance of those countless 3D models still not improved by SMIM",
  "descriptionHtml": "Adds high poly improvements to some game meshes (1000+ atm), ranged from custom work Eyecandy Magnus stuff, animated refracting \r<br />potions and open smelter with fire inside to simple meshsmoothed glaciers cliffs and mountains (made in 2013 just in case). No jewelry included.\r<br />XBONE version is supposed to be included here https://bethesda.net/en/mods/skyrim/mod-detail/4010110 unless it gets \r<br />whacked into 20 fps. Though 20 fps is what XBONE user usually gets used \r<br />to in most games\r<br />\r<br />- Creatures - chicken, elk, fox, skeever, goat, ashman, draugr skeleton. Bunny retexture friendly\r<br />- Driftwoods, branch piles, tundra trees, junipers, Whiterun big tree and roots\r<br />- Bones - dragon skeletons and trophy skull, bone traps, mamoth bones, troll and deer skulls, human and vampire remains, dungeon corpses and such\r<br />- Refracting animated transparent potions, poisons animation WIP. Refracting transparent wine and mead bottles. Empty bottles not refracting\r<br />- Magnus Staff with animated Magnus Orb (EyeCandy).\r<br />- Ftoppka Open Smelter (Khronos Group / AMD style. Open means you don&#39;t have to optimize nor provide any driver support lol)\r<br />- Riekling and falmer architecture stuff. Dunmer beds\r<br />- Candles round and fine, plenty. Lots of candles. Enchanting workbench part as well. Staff enchanter too. Wait, there&#39;s no candles... nvm\r<br />- Smoothed glaciers, mountains, icepiles and rocks in caves, geode veins, creeks and streams and woodfires, giant ones too. In tundra, \r<br />Blackreach, Skyrim, Dawnguard, Whiterun and Dragonborn, zillions. Heartstone stuff as well. Soul Cairn craters. Giant obelisks. Not ore veins because they&#39;s flat. SMIM hi-poly version (if present) would usually have the same triangle count but different shape and sometives fixed UV. Pick whichever you  like the most\r<br />- Solitude mountain base and Sovngarde base as well. Markath mountain cliffs\r<br />- Solitude mountain base and Sovngarde base as well. Markath mountain cliffs\r<br />- Mushroom plants (3 of 6), Solstheim mushroom trees, ash yam and creep clusters and trama roots and moar plants. Hearthfire homegrown stuff\r<br />- Stockade bridges pseudo-3D ropes. Raven Rock lanterns and some of the wood posts (not docks), docks in Solitude\r<br />- Sacks, satchels, coinbags and pouches. Bedroll and two tents for small rocks\r<br />- Alchemy ingredients (plenty)\r<br />- Statues vanilla style (no big boobs)\r<br />- Food and vegetables, firespit cooked food mesh as well. Not cabbages. Because we have SMIM\r<br />- Icicles, soulgems, atronachs, ice spears and gemstones transparent and refracting. Blackreach mushroom and crystal refraction (DX9 exclusive, for SE check Skysan&#39;s refracting mods with 3ds Max edited layers)\r<br />\r<br />There&#39;s another mod for the sake of smoothness http://www.nexusmods.com/skyrim/mods/76439/? seems we got BOWLZ yo and we got dat dish thang (with UV bugs sometimes) and we got shrines for g-ds sake. And nordic ruin rings too\r<br />\r<br /> For those familliar with SMIM one should install SMIM after my mod. Or install my mod after SMIM. I don&#39;t really care because there&#39;s not very much to conflict there and they conflict only because sometimes SMIM meshes of draugr or skeleton are sort of low poly and they mostly use models that are not retexture friendly so I had to make me a replacement. And SMIM could have better rocks but I got more of them along with a sweetroll so you should install both. I have installed both for instance\r<br />PS The Staff if from my http://www.nexusmods.com/skyrim/mods/41599/ in case you want custom esp for damage rate tweak\r<br />Also I&#39;ve heard Fallout 4 bottles are opaque as well so there goes my http://www.nexusmods.com/fallout4/mods/4884/?\r<br />[b]cuz everybody&#39;s sane until they break[/b]\r<br />[img]http://img00.deviantart.net/5cd6/i/2005/300/1/f/free_dominguez___pleasure_by_theyikes.jpg[/img]",
  "categoryId": "29",
  "version": "2.01",
  "author": "Renegade1979",
  "createdUnix": "1477756783",
  "updatedUnix": "1486864066",
  "containsAdultContent": false,
  "uploadedBy": "Renegade79",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000232828",
      "name": "Smooth Multilayer Parallax option for Rustic Soulgems",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "340",
      "fileName": "Smooth Multilayer Parallax option for Rustic Soulgems-79813-1-01.rar",
      "uploadedUnix": "1483569003",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/509c46d634af80140019269cb1f0548406ff21cda9e623259285f2602cc4cc7e/analysis/1483569307/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smooth%20Multilayer%20Parallax%20option%20for%20Rustic%20Soulgems-79813-1-01.rar?fid=1000232828&ttl=1535868465&ri=8192&rs=8192&setec=cffff9e394b042c1d44203d6fbb9aae6"
    },
    {
      "fileId": "1000236035",
      "name": "Extra Smooth Mesh Mod",
      "version": "2.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "276607",
      "fileName": "Extra Smooth Mesh Mod-79813-2-01.zip",
      "uploadedUnix": "1486864066",
      "modVersion": "2.01",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extra%20Smooth%20Mesh%20Mod-79813-2-01.zip?fid=1000236035&ttl=1535868466&ri=8192&rs=8192&setec=861319e58213330b8a2fa0ac3cd49018"
    }
  ]
}