{
  "modId": 79836.0,
  "modName": "Marcus Dal&#39;Verran - male follower for Enderal",
  "summary": "Marcus Dal&#39;Verran - Keeper of the Third Signet.\r<br />Voiced & summonable male follower for Enderal.\r<br />Options: follow/dismiss/carry loot/summon\r<br />Only his ring and amulet are set as outfit so you can change his equipment.\r<br />He will occasionally comment on you/situation/location/weather.",
  "descriptionHtml": "[b][color=#ffd966]Requirements[/color][/b]\r<br />============ \r<br />Skyrim\r<br />Enderal\r<br />\r<br />[color=#ffd966][b]Not required but highly recommended[/b][/color]\r<br />===================================\r<br />[url=http://www.nexusmods.com/skyrim/mods/77879/]Enderal Fast Travel by Tamira[/url]\r<br />This mod will save you a lot of fiddling around (dismiss/summon/follow command every time you attempt Enderal&#39;s means to travel).\r<br />Marcus will always fast travel with you.\r<br />[color=#ffd966]\r<br />[b]Details[/b][/color]\r<br />=======\r<br />Enderal is beautiful but scary place and I wanted a friend to watch my back (and carry loot for me).\r<br />On my first play through I rushed through the main quest only to find out that I&#39;ll never have a vanilla companion to explore Enderal with me.\r<br />So I fixed it.\r<br />\r<br />[b][color=#ff0000][size=4]Marcus Dal&#39;Verran - Keeper of the Third Signet\r<br />\r<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/79836-0-1477793470.jpg[/img][/size][/color][/b]\r<br /> \r<br />He is big, he is strong, he is a loyal friend, gifted arcanist and very capable warrior. \r<br />Will &#34;carry your burden&#34; if you ask him nicely.\r<br />\r<br />[b][color=#ff7700]WHERE TO FIND MARCUS[/color][/b]\r<br />As soon as you get access to the Sun Temple (main quest) you&#39;ll be able to ask Marcus to join you on your adventures.\r<br />You can find him in the Sun Temple, Quarters, Baths. Talk to him and head on outside. He will get dressed and follow you.\r<br />\r<br />[b][color=#ffd966][size=3]ABILITIES AND EQUIPMENT[/size][/color][/b]\r<br />He is essential (he can&#39;t die) and will level up with you.\r<br />Marcus will forgive friendly fire in the heat of the battle but won&#39;t tolerate if you abuse him.\r<br />He will heal himself so you do not need to worry about it.\r<br />He also has an enchanted ring and amulet as part of his outfit so he is immune to disease, can breathe underwater and he has some resistance to elements.\r<br />\r<br />[b][color=#ff7700]SUMMON MARCUS[/color][/b]\r<br />He has a book in his inventory - read it and learn how to call him to your side anytime, anywhere.\r<br />If he has already been following you, he will continue to follow.\r<br />If he was dismissed and you summoned him, talk to him and ask to follow.\r<br />You can dismiss him any time and he will return to the Sun Temple.\r<br />\r<br />[b][color=#ff7700]MARCUS&#39; GEAR[/color][/b]\r<br />Marcus wears a full set of Keepers heavy armor. He is also equipped with two Order swords, a cape, shield and backpack.\r<br />His gear is very high quality so there is no need to improve it or recharge it.\r<br />You can take all his items temporarily from him (in case you both need a bath or you want to give him a new outfit - you can&#39;t really go into Undercity wearing an Order armor, can you?) but you won&#39;t be able to sell his things.\r<br />\r<br />Marcus naturally prefers his Order armor and weapon but may occasionally equip some heavily enchanted loot you give him to carry.\r<br />If you don&#39;t like it - just take it out and give him something else to carry.\r<br />\r<br />Of course, he can lend you his stuff but if you really want a full Order armor set, weapons, cape and backpack \r<br />you can get it from my other mod [url=http://www.nexusmods.com/skyrim/mods/78238/]Enderal Sun Temple Quarters - Player&#39;s room[/url]\r<br />Cape and backpack also have very useful enchanted versions and all items can be improved and enchanted.\r<br />\r<br />[b][color=#ff7700]SKILLS AND COMBAT [/color][/b][color=#ff7700][b]STYLE[/b][/color]\r<br />Marcus is equally skilled in wearing heavy and light armor.\r<br />He can dual wield but usually prefers sword/shied or sword/spell combination depending on situation. For ranged attacks he uses Elementarism spells.\r<br />Do not give him a bow or staff. He will not use it.\r<br /> \r<br />Keep in mind that his favourite combat style is brutal offence.\r<br />So if you&#39;re a very sneaky type he is probably not the best companion for you but you still can give him a try.\r<br />He won&#39;t affect you stealthmeter, won&#39;t chat with you while sneaking and won&#39;t attack unless enemies have spotted you.\r<br />\r<br />[b][color=#ff7700]TALKING WITH MARCUS[/color][/b]\r<br />He has 180 lines from vanilla Skyrim maleBrute voice type but as he will tell you &#34;Do not expect much in the way of conversation&#34;.\r<br />Marcus has all proper and various responses with player dialog, all combat grunt and taunts and as much idle talk for different situations as I could find.\r<br />\r<br />Please understand that it is very hard to create a follower for Enderal.\r<br />Enderal creators had Skyrim followers system removed from the game completely.\r<br />Also the Skyrim location keyword system does not exist in Enderal. So it is a tedious job to set conditions to the follower&#39;s dialog.\r<br />Marcus might say some things in the places he was not meant to say. Don&#39;t be too harsh on him.\r<br />\r<br />[b][color=#ff7700]TRAVEL WITH MARCUS[/color][/b]\r<br />Best way to travel long distances with Marcus - fast travel. He will always fast travel with you.\r<br />I suggest [url=http://www.nexusmods.com/skyrim/mods/77879/]Tamira&#39;s Fast travel mod[/url] for that.\r<br />\r<br />Teleportation scrolls, Mark-Recall spells, Myrads and road sign travel are not recommended but you still can use them.\r<br />Dismiss Marcus first, then travel, then summon Marcus and ask him to follow you again.\r<br />\r<br />During some quests you&#39;ll have to use teleport scrolls or in some quests you will get force-teleported.\r<br />Mark will not teleport with you. Just summon him afterwards.\r<br />Use common sense and do not summon him in the areas where he is not supposed to be.\r<br />\r<br />[b][color=#ff7700]MARCUS AND THE MAIN QUEST[/color][/b]\r<br />I recommend to dismiss Marcus during any main quest missions where you&#39;ll be given a follower(s).\r<br />\r<br />Although I couldn&#39;t resist and took him to Old Dust Cave and then we travelled together to Starcity. \r<br />You can take him with you if you wish, he even has things to say there.\r<br />\r<br />[b][color=#ff7700]A MATTER OF LIFE AND DEATH[/color][/b]\r<br />As known, Enderal has two endings. You will have two choices with Marcus for each ending.\r<br />There are totally lore friendly means to save him so it&#39;s up to you to decide his fate.\r<br />\r<br />[SPOILER]\r<br />\r<br />[b][size=1]First Ending:[/size]\r<br />[/b]\r<br />1. Dismiss him before you do your heroic deed and he will escape with your other companion.\r<br />2. Otherwise, he will stay with you and will share your fate.\r<br />\r<br />[b][size=1]Second Ending:[/size][/b]\r<br />\r<br />1. Leave your friend behind if you&#39;re coldblooded heartless bastard.\r<br />2. Take Marcus with you and your other companion (yes, I made sure that there is room for everyone) and you all will live happily ever after.\r<br />\r<br />[b]Hint:[/b] \r<br />You can give your valuable possessions to Marcus for safekeeping before departure and call him when you&#39;re awake again and take your stuff back.\r<br />That way you will be able to dress properly for a few fabulous screenshots of your new life. \r<br />Otherwise all your stuff will be gone and you&#39;ll end up dressed like a glowdust addict from Undercity (this is Enderal feature). \r<br />So save your friend and even profit from it&#33;[/SPOILER]\r<br />\r<br />[b][color=#ffd966]FAQ[/color][/b]\r<br />================================================\r<br />Q. I can&#39;t find him&#33;\r<br />A. He is in Ark, Sun Temple, Quarters, Baths. Follow the main questline until you gain access to the Sun Temple. He is chilling in Quarters Baths after training.\r<br />\r<br />Q. I found Marcus but he doesn&#39;t speak to me.\r<br />A. Save. Exit. Reload.\r<br />\r<br />Q. He is blocking the doorway&#33;\r<br />A. Dismiss him, wait a few sec for him to step aside and free your path, then ask him to follow you again.\r<br />\r<br />Q. How can I summon him?\r<br />A. Take the book from his inventory. Read it. You&#39;ll gain the power that you can use as often as you need. \r<br />    Make sure there is some space in front of you so he won&#39;t fall off the cliff or something. Call him (press Z to activate the power).\r<br />\r<br />Q. Help&#33; I used a scroll (spell, flying animal, road sign) and lost Marcus&#33;\r<br />A. Summon him. Doesn&#39;t matter if he was following you or was dismissed before you lost him. \r<br />    You can do it a few times but if it&#39;s your playstyle I can&#39;t guarantee that it will not break something eventually.\r<br />\r<br />    Use this mod [url=http://www.nexusmods.com/skyrim/mods/77879/]Enderal Fast Travel[/url] by Tamira.\r<br />    Marcus will always fast travel with you.\r<br />\r<br />    If you insist on using vanilla Enderal travel follow these steps: dismiss him/travel alone/summon him/ask him to follow\r<br />\r<br />Q. I entered a cave (fort, castle, my home, any interior cell) and lost him&#33;\r<br />A. Give him some time to catch up with you - navmeshes are tricky. Or just summon him.\r<br />\r<br />Q. He is stuck&#33;\r<br />A. Some places are hard to navigate even for a player. Just summon him or fast travel.\r<br />\r<br />Q. He is stuck in stealth animation&#33;\r<br />A. It might happen (as it happened with Skyrim followers) if you were attacked by enemies while in stealth mode and Marcus started the fight in stealth mode. Changing cells usually helps if you&#39;re in the interior cell and fast travel fixes it if you&#39;re outside.\r<br />\r<br />Q. I accidentally hit him. And then I did it again. And again. And now he is angry and trying to kill me&#33;\r<br />A. Well, you had this coming, didn&#39;t ya? Reload previous save where you still were a decent person and didn&#39;t hit your friend.\r<br />\r<br />Q. Can you make him wait?\r<br />A. I tried. Didn’t work. Just dismiss him, he will return to the Sun Temple. You can summon him again when you need him.\r<br />\r<br />Q. Can you make him relax (sandbox, use chair, bed, markers, mine ore etc)?\r<br />A. I wish I could. Enderal has no follower system like Skyrim. If you know how to do it you&#39;re welcome to try and enhance this mod or create your own.\r<br />\r<br />Q. He is too strong&#33;\r<br />A. Try to play on Master or Iron Path difficulty.\r<br />Q. He is still too strong&#33;\r<br />A. Dismiss him. May be you do not need a companion after all.\r<br />\r<br />[color=#ffd966][b]Install[/b][/color]\r<br />=======\r<br />Mod is safe to install mid-game. Load order doesn&#39;t matter.\r<br />1. Drop bsa and esp files from the archive into your Skyrim&#92;Data folder.\r<br />2. Start Enderal Launcher and check Marcus Dal&#39;Verran.esp file.\r<br />    Enjoy&#33;\r<br />\r<br />[b][color=#ffd966]Update[/color][/b]\r<br />=========\r<br />Replace ESP file.\r<br />\r<br />[b][color=#ffd966]Uninstall[/color][/b]\r<br />=========\r<br />I only recommend uninstalling the mod before starting a new game or if you&#39;re loading a save that has never had this mod installed on it before.\r<br />\r<br />[b][color=#ffd966]Incompatibility[/color][/b]\r<br />===============\r<br />Probably not compatible with [url=http://www.nexusmods.com/skyrim/mods/78138/]Amanda - Enderal Follower[/url] by Larak.\r<br />If you prefer female companion - try Amanda.\r<br />\r<br />[b][color=#f1c232]Known Issues or Bugs[/color][/b]\r<br />====================\r<br />1. Do not attempt to use vanilla Skyrim commands for followers on Marcus&#33; (wait here, use objects etc)&#33;\r<br />Followers system doesn&#39;t exist in Enderal.\r<br />Using non-supported scripted commands will break Marcus quest.\r<br />If you accidentally entered quick command state - just press Tab and exit it.\r<br />If you broke Marcus quest and he is not following you - exit the game and load previous save (before you tried to boss him around).\r<br />\r<br />2. On some rare occasions when you draw you weapon and Marcus follows your suit a weird sound glitch may occur for a second.\r<br />It&#39;s a harmless Skyrim bug, nothing to worry about.\r<br />\r<br />[b][color=#ffd966]History[/color][/b]\r<br />=======\r<br />v-1.1, 12/10/2016 - Minor improvements\r<br />v-1.0, 30/09/2016 - Initial release.\r<br />\r<br />[b][color=#ffd966]Change Log[/color][/b]\r<br />==========\r<br />1. Fixed Enderal bugged Frost Cloak spell (Winter Skin Rank I). Now it will work properly and only hostile NPC will be affected by the spell. \r<br />    Marcus and all non-hostile NPC won&#39;t attack you anymore when you&#39;re wearing Frost Cloak.\r<br />\r<br />2. Friend Hits Allowed in Combat has been increased to 12 (default 4)\r<br />    Friend Hits Allowed Non-Combat has been increased to 3 (default 0)\r<br />    Marcus will be more patient with you and won&#39;t attack if you accidentally hit him a few times.\r<br />\r<br />3. His amulet is no longer a part of the outfit so if there is clipping with Enderal armor you can remove the amulet from his inventory.\r<br />\r<br />[b][color=#ffd966]Contact[/color][/b]\r<br />=======\r<br />Celestia212 at Nexus\r<br />\r<br />[b][color=#ffff00]*****If you like this mod please do not forget to endorse&#33;*****[/color][/b]\r<br />\r<br />[b][color=#ffd966]Credits[/color][/b]\r<br />=======\r<br />Thanks to Bethesda for creating Skyrim\r<br />Thanks to Sure AI for creating Enderal\r<br />Thanks to Larak for his mod [url=http://www.nexusmods.com/skyrim/mods/78138/]Amanda - Enderal Follower[/url] and permission to use it&#33; \r<br />Thanks to cdcooley for the summoning script, the only summoning script that worked in Enderal&#33;\r<br />Thanks to Hvergelmir for his beautiful [url=http://www.nexusmods.com/skyrim/mods/30411/]Brows[/url] mod\r<br />Thanks to LHammonds for the Readme Generator this file was based on\r<br />Thanks to my amazing husband for troubleshooting bugs and solving CK problems\r<br />\r<br />Thanks to anyone else I might have not credited accidentally (PM me&#33;)\r<br />Marcus&#39; eyes texture is the mix of different textures replacements I did in PhS and I can&#39;t remember where I got them. \r<br />If you recognize any part of eye texture in this mod as your work, please PM me and I will credit you properly.\r<br />\r<br />[b][color=#ffd966]Permissions[/color][/b]\r<br />===========\r<br />You&#39;re free to use it and modify it as long as you do not make money from it.\r<br />PM me if you publish your mod and credit Celestia212 and other authors of resources used in my mod.\r<br />Please do not redistribute my mods or upload on Steam.\r<br />\r<br />=========================================================================================\r<br />I apologize for any mistakes, English is not my native language, feel free to correct me.",
  "categoryId": "66",
  "version": "1.1",
  "author": "Celestia212",
  "createdUnix": "1477804487",
  "updatedUnix": "1478953922",
  "containsAdultContent": false,
  "uploadedBy": "Celestia212",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000226570",
      "name": "Marcus Dal&#39;Verran - Keeper of the Third Signet",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2863",
      "fileName": "Marcus Dal'Verran - Keeper of the Third Signet-79836-1-0.zip",
      "uploadedUnix": "1478056232",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c3a90391f9b9a4168a78620bc72aa402401090488d8204a518844b3547bfded5/analysis/1478056262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marcus%20Dal%27Verran%20-%20Keeper%20of%20the%20Third%20Signet-79836-1-0.zip?fid=1000226570&ttl=1535868490&ri=8192&rs=8192&setec=bdc3b2163bb6c509dd843cc1503c1696"
    },
    {
      "fileId": "1000227898",
      "name": "Marcus Dal&#39;Verran v-1.1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2864",
      "fileName": "Marcus Dal'Verran v-1.1-79836-1-1.zip",
      "uploadedUnix": "1478953576",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/5ae18ccaf0977d7bea474d480d8d1a8fe1979f4913e81d186ae6199224590472/analysis/1478953623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marcus%20Dal%27Verran%20v-1.1-79836-1-1.zip?fid=1000227898&ttl=1535868491&ri=8192&rs=8192&setec=0c656ede950516d114993ee863464f0a"
    },
    {
      "fileId": "1000227901",
      "name": "Marcus Dal&#39;Verran v-1.1 UPDATE ESP ONLY",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "13",
      "fileName": "Marcus Dal'Verran v-1.1 UPDATE ESP ONLY-79836-1-1.zip",
      "uploadedUnix": "1478953922",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/9c432d9482539f3aa2b1756e44f89b4a226ed09019d7d3d568fb04e09f469294/analysis/1478953982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Marcus%20Dal%27Verran%20v-1.1%20UPDATE%20ESP%20ONLY-79836-1-1.zip?fid=1000227901&ttl=1535868491&ri=8192&rs=8192&setec=5c4322430184be2b3df55e9e5d1061c2"
    }
  ]
}