{
  "modId": 79851.0,
  "modName": "Ivinso Island WIP Alpha 0.01",
  "summary": "Hello&#33; welcome Dragonborn, to Ivinso Island a land that has risen from the ocean and continues to do so. A number of brave Nords have started to make a home on this island far from war and dragons but will the Earth take the island as it has given the island or raise it to further glory? Only time will tell.\r<br />\r<br />",
  "descriptionHtml": "[size=3]Hello&#33; welcome Dragonborn, to Ivinso Island A land that has risen from the ocean and continues to do so. A number of brave Nords have started to make a home on this island far from war and dragons but will the Earth take the island as it has given the island? Only time will tell.[/size]\r<br />\r<br />[b][u][color=#ffff00][size=6]Note 11/6/16 I&#39;m taking a brake on active development of the mod / land for a week or three to learn how to develop new tree, buildings, rocks, ground and many other textures/objects I want this mod to utilize new assets besides the vanilla textures, I have been using so far for city&#39;s and mountains ect. This mod I hope to finish by spring (most likely not early spring) 2017 in at least a bata or open alpha...[/size]\r<br />\r<br />[size=4] but I want it to be an awesome experience for everyone&#33; I may rework the map depending on a few factors but this is my first mod and I feel like I have gotten a good handle on the CK over the past few days and a rework of the map will take vary little time if required or desired by me I want to make a better balance on beauty and performance of this mod and originality. so wish me luck on my learning adventures :)  \r<br />\r<br />Thanks to everyone who like this mod so far&#33;[/size][/color][color=#ffff00][size=6]\r<br />[/size][/color][/u][/b]\r<br />[color=#00ffff][size=4][b]11/2/16 added more new pics on my progress read the titles has some info on the pics note that the glitch&#39;s in some pics are caused by the SCK not handling 31 loaded grids too well the turain is not glitched from a reasonable height or loaded grids.[/b][/size][/color]\r<br />\r<br />Yo everyone my name&#39;s Conflict and I&#39;m working on a new land mod. Currently its nowhere near done but with the release of Skyrim special edition just happened and the fact that I don&#39;t have it I wanted to check and see how many people would be interested in Ivinso an Island Newlands mod that would add a large island and sub islands underground cave networks and dungeons and so much more&#33; a full WIP wish list is down below\r<br />\r<br />\r<br />[u]0.01[/u] [b][u]current phase some items are not listed that are underway.[/u][/b]\r<br />1. Finalize Island outline 85% done (some work on sea level/ depth and such remains save me the sea is killing me with boardroom&#33;&#33;&#33;&#33; hahah jk\r<br />[color=#00ff00]2. Add area for two large city&#39;s 100% Done&#33; yhay 10/31/2016 DONE[/color]\r<br />3. set up Biomes fully 15%\r<br />4. Set up rough road network 4%\r<br />[color=#00ff00]5. finish and name the massive Mountain 100%[/color] / carve network planed within 1%\r<br />[color=#00ff00]6. add small mountain range 80% remaining 20% is detail work[/color]\r<br />7. work on forest&#39;s 5% \r<br />[color=#00ffff]8. random things that amuse conflict 30% yes I referred to myself in the 3rd person.\r<br />[/color][color=#00ff00]9. Setup LOD 10%[/color] [color=#00ff00]and connect Ivinso/Skyrim 70[/color][color=#00ff00] (complete for this phase) \r<br />[/color]\r<br />\r<br />[u]0.02 Second phase[/u]\r<br />1. Start work on building out the 2 city&#39;s\r<br />2. add villages thinking of maybe 4+? [color=#00ff00]1 village 90% done[/color]\r<br />3. Add way by door temporally to visit island want to set up a trip via ship or quest)\r<br />4. add a 3rd city in main mountain&#39;s cave network Dwemer city (maybe?) \r<br />[color=#00ff00]5. add 3 more sub islands skiped ahead on this added a rough turain for 2 other islands I had to cut out 1 planed island :(  DONE[/color]\r<br />6. detail Island main lake\r<br />7. finish sea floor 20%\r<br />8. add animals birds deer fish ect.\r<br />9.just wanted to add a number ;)\r<br />10.post the first iteration of the mod on Nexus \r<br />\r<br />\r<br />Some things I&#39;d like to do in the future once I have some things worked out is to add in a movable boat mod to get to some of the sub islands not sure what my plan on this is yet Ideas are welcome on this or anything in this mod&#33;&#33;\r<br />\r<br />also please be patient on this as the mod has only been worked on for roughly 23 hours so far so..... lots more to go&#33;\r<br />more info will be added weekly/daily as RL allows :) as well as progress \r<br />\r<br />\r<br />Hey and if you have any costume textures&#92;assets&#92;creatures (please be somewhat lore friendly) you might be willing to share let me know I&#39;d love city buildings walls cave&#39;s or anything really I&#39;ll love ya long time lmao\r<br />\r<br />[color=#ffff00]I will be looking for vice actors at some point not at the moment but once the city&#39;s are done I&#39;ll want 50+ voiced NPC&#39;s I may reuse some from other parts of skyrim but I would love new voices&#33; I&#39;m thinking around Alpha 0.20 I&#39;ll start surching for pips so please keep this mod in mind if your interested \r<br />[/color]\r<br />[color=#ffff00][size=3]Aslo I am open to quest Ideas and such. I just love to build islands and city&#39;s and shit so although I want to make a few quests of my own, I&#39;d love to see some awesome creative minds help out full credit on all work, assets and things done for this mod will be given ofcorse&#33;[/size][/color]",
  "categoryId": "30",
  "version": "0.01",
  "author": "Conflict",
  "createdUnix": "1477844890",
  "updatedUnix": "1477844890",
  "containsAdultContent": false,
  "uploadedBy": "conflicting666",
  "primaryFile": null,
  "files": []
}