{
  "modId": 79863.0,
  "modName": "Skyrim Modding - Stability and Performance Guide 2016 - DELETED",
  "summary": "A detailed tutorial on how to create a stable and high performance Skyrim ready for intense modding.",
  "descriptionHtml": "[u]Skyrim Modding - Stability and Performance Guide 2016[/u]\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[size=4]This guide is aimed to create a stable and high performance Skyrim experience for those who wish to mod their game to high hell or simply wish to fix their problems of CTD&#39;s, stuttering, or general game performance. You do not have to be an experienced modder to follow this guide, but it is important that you read everything step by step.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/size]-Intro-\r<br />&lt;br /&gt;Skyrim is one of the most popular games to play for the PC, mainly due to the extensive mods and their communities. While you can create a whole new Skyrim experience with mods, it&#39;s important to know [u]how to mod your game properly.[/u] This is the most common downfall of many users&#39; modlists, where they add hundreds of mods just to find that the game won&#39;t even launch or they experience CTD&#39;s mid game, terrible performance, and/or stuttering. This guide aims to show you step by step on how to get the most out of your Skyrim when using mods.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;-Technical Background (TL;DR: Skyrim is an old game with a outdated engine and uses the DX9 runtime. We need to work around this)-\r<br />&lt;br /&gt;You don&#39;t need to read this, but it will give you some technical insight as to why we must install and adjust certain mods to create a stable Skyrim. Skyrim was released almost 5 years ago as of creating this guide and its age certainly shows today. The game runs off of the DirectX 9 runtime (DirectX is a collection of API&#39;s deigned to handle tasks related to rendering 2D and 3D graphics) which was first released back in 2002 and was last updated in 2008. In short, its old and outdated and limits the amount of performance and memory availability for Skyrim. If you&#39;re using Windows 8, 8.1, or 10, there is a limit that is set on DX9 on how much VRAM game applications can use; a max of 4064MB (or 4GB). If you hit this limit or go beyond it your game will crash. This obviously limits our Skyrim modding capability. In this guide there are several ways we can get around this limit and reduce our VRAM usage for better stability and performance.\r<br />&lt;br /&gt;-Prerequisites-\r<br />&lt;br /&gt;Before we start, you should always make sure that you \r<br />&lt;br /&gt;[u]-Scan your PC for and viruses or malware\r<br />&lt;br /&gt;-Check for updates to Windows\r<br />&lt;br /&gt;-Uninstall any unnecessary programs \r<br />&lt;br /&gt;-Defragment your hard drive or optimize your SSD\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]Believe it or not, these things can have an impact on the performance of your game, especially the viruses or malware. I personally use the Windows Defender which comes with Windows 10 itself and works just fine.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]-Steam should NOT be installed in the [Program Files (x86)] folder. It is recommended that you install Steam on a separate drive such as an SSD or at the very least in its own directory on your drive where Windows is installed.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]The Windows U.A.C. (User Account Control) is known to cause problems with modded Skyrim if it is installed in [Program Files (x86)]\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]-You should be following this guide on a fresh copy of vanilla Skyrim (no mods whatsoever)\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]This is to ensure proper installation of mods this guide wants you to use and may cause problems with your existing mods if not followed correctly.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[size=4][b][u]-CREATE A BACKUP OF VANILLA SKYRIM&#33;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u][/b][/size]I cannot stress this enough. Skyrim is a pain in the in the ass to uninstall, download, and install again. Make a copy of your vanilla Skyrim main folder and set it in a place where you can easily access it and replace the modded Skyrim main folder if you need to. It will save you a lot of time. \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]-Setup some Skyrim setting through NVIDIA Inspector[/u]",
  "categoryId": "84",
  "version": "1.00",
  "author": "Ender108",
  "createdUnix": "1477870081",
  "updatedUnix": "1477870081",
  "containsAdultContent": false,
  "uploadedBy": "Ender108",
  "primaryFile": null,
  "files": []
}