{
  "modId": 79875.0,
  "modName": "Multi-Position Elder Scroll on Back - Belt-Fastened Quivers Patch",
  "summary": "An unofficial self-made patch for these mods, made for my own purposes, shared in case someone else might want them.",
  "descriptionHtml": "[left]I really like the mod &#34;[url=http://http://www.nexusmods.com/skyrim/mods/24908/?]Multi Position Elder Scrolls on Back[/url]&#34; by sleepyneko, however I was heavily disappointed to find that the &#34;Maniac&#34; option (The option for wearing three Elder Scrolls at a time) was mounted to the Quiver spot. This mean that by adding Belt-Fastened Quivers, it totally ruined the intended position of the Elder Scrolls and made them clip horribly with the quiver.[/left]\r<br />As the whole point of using Belt-Fastened Quivers, for me, was so that my character had plenty of room on his back for the Elder scrolls, I was very disappointed by the outcome. So I popped the necessary files into NifSkope and changed the positioning of the scrolls to my liking. Such considered, this [color=#ff0000][size=4]REQUIRES [/size][/color][size=2]&#34;[/size][size=2][url=http://http://www.nexusmods.com/skyrim/mods/35717/?]Belt-Fastened Quivers[/url]&#34; or another mod which adds such, otherwise the scrolls will be positioned weird and this patch is totally unnecessary.\r<br />[/size]And if you couldn&#39;t tell that it requires &#34;Multi Position Elder Scrolls on Back&#34; then you should consult your doctor as you have seriously declining mental health.\r<br />\r<br />I&#39;m uploading this here because the original mod author has not been around for a while, and I figured someone else might like to use this.\r<br />\r<br />As of now, the scrolls are fit to be worn on the back of the Ebony mail with the Belt-Fastened Quiver and the fix is for males only. If there is request for a fix for females, I might do it.\r<br />\r<br />[color=#ffff00]NOTE:[/color] The screenshots were taken in Skyrim: Special Edition. It&#39;s pretty easy to convert small mods like this to work, but I don&#39;t feel comfortable uploading the whole converted mod without permission. It&#39;s pretty easy to figure out for yourself, though.\r<br />\r<br />[size=6]Installation:[/size] Idiots install manually, use your preferred mod manager to over-write the files in &#34;Multi Position Elder Scrolls on Back&#34; with the files from this one.\r<br />\r<br />[color=#ff0000][size=5]DISCLAIMER:[/size][/color]\r<br />I do not have explicit permission to manipulate assets from sleepyneko&#39;s mod (Although I&#39;m pretty sure it&#39;s all the same meshes from default Skyrim anyway) and sleepyneko has provided no specific permission guidelines regarding the usage or overtly repetitive mentioning of their mod. Therefore I have no idea if I&#39;m actually breaking any rules by uploading it. If you fancy Admins think I am, please don&#39;t ban me, I&#39;ll take the mod down without hesitation. Not that important. I don&#39;t really know what I&#39;m doing.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Raymus",
  "createdUnix": "1477910559",
  "updatedUnix": "1477910540",
  "containsAdultContent": false,
  "uploadedBy": "Raymus1449",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000226340",
      "name": "Initial Patch",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1133",
      "fileName": "Initial Patch-79875-1-0.zip",
      "uploadedUnix": "1477910540",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/02df30da5906fb06b568eb796a0b81759a50732b15fb79300b586802cc0f3e7b/analysis/1477910583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Initial%20Patch-79875-1-0.zip?fid=1000226340&ttl=1535868525&ri=8192&rs=8192&setec=587eca9c922f9ac3f3828d335d82e36a"
    }
  ]
}