{
  "modId": 79882.0,
  "modName": "Aurbic Alduin",
  "summary": "Fear the World-Eater",
  "descriptionHtml": "[b]Aurbic Alduin[/b]\r<br />a mod by Kohdi\r<br />\r<br />[b]-Description-[/b]\r<br />Mythically speaking, Alduin is not your average fantasy dragon. None of the Elder Scrolls dragons are. They are fragments of the Akatosh oversoul, shards of time given presence in the mortal plane. Alduin himself is less an entity and more of a cosmic force, the inescapable turning of time as the old world is recycled into the new. That is, until he was corrupted.\r<br />\r<br />Through the lust for power generated by cults of dragon worshipers, Alduin was given a dangerous burden - a will. And as we all know, that will pushed him to lead the other dragons in subduing and terrorizing mortal races across Nirn. His purpose was forgotten, changing him from an aspect of time into one of fear. He was banished long ago for these transgressions, but not all things can be swept under the rug.\r<br />\r<br />This is a fairly simple retexture mod which takes a bold new approach to the depiction of Alduin the World-Eater. Alduin is a force of Aetherius, a universal reset switch, but through intercession in Mundus he has been tainted by the influence of Padomaic thought. I have interpreted this as a glowing core, pure in Aetherial intent, covered by a thorny hide of star-pocked Oblivion. A rift in the sky itself, torn from the night and following a ravenous desire to consume and dominate. When you see him he will not appear as a normal dragon, and should not - you would do well to remember that the being you face has the potential to consume everything you ever knew, until there is nothing left but the shadow of night under black wings.\r<br />\r<br />Face him if you dare.\r<br />\r<br />[b]-Technical Details-[/b]\r<br />Includes full body textures, far-skins for distant sightings, and edited meshes to allow glowing stars and mouth. His body texture is a generous 4096x (4K), allowing for sharp and subtle stars even when your face is mashed right up in his armpit. Make sure your system can handle this before installing. It probably can.\r<br />\r<br />[b]-Installation-[/b]\r<br />NMM: Do the usual thing\r<br />\r<br />Manual: Make a backup if you want, then drag and drop. Overwrite as necessary.\r<br />\r<br />[b]-Uninstallation-[/b]\r<br />Do what you just did, but backwards\r<br />\r<br />[b]-Questions-[/b]\r<br />Q: Nothing has changed, he looks the  same&#33;\r<br />A: Make sure the meshes and textures folders were placed in the data directory, and overwrote the necessary files.\r<br />\r<br />Q: He looks different/darker/brighter/sexier than in your pictures&#33;\r<br />A: His appearance will vary greatly based on your graphics setup. For maximum effect I recommend an ENB, but it is not necessary.\r<br />\r<br />Q: Is this compatible with Other Alduin Mod?\r<br />A: Yes, as long as that mod doesn&#39;t change his meshes or textures. If, say, it only affects his fighting style or health, there should be no issue. If in doubt, try it out. My mod won&#39;t hurt anything.\r<br />\r<br />Q: I don&#39;t like it&#33; Change it&#33; Do the other dragons too&#33;\r<br />A: Naaah\r<br />\r<br />[b]-Credits-[/b]\r<br />Bethesda for Skyrim, going strong five years on\r<br />The lore community for being weird and awesome\r<br />\r<br />[b]-Contact-[/b]\r<br />Send me messages&#33; It&#39;s not my bite you should watch out for&#33;",
  "categoryId": "29",
  "version": "v1.0",
  "author": "Kohdi",
  "createdUnix": "1477961657",
  "updatedUnix": "1477961387",
  "containsAdultContent": false,
  "uploadedBy": "Kohdi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000226411",
      "name": "Aurbic Alduin",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3149",
      "fileName": "Aurbic Alduin-79882-v1-0.rar",
      "uploadedUnix": "1477961387",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8c8f389847d360ecec6fd0dfa70917fa125864b1df83df45a7545ad76074bc6b/analysis/1477961404/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Aurbic%20Alduin-79882-v1-0.rar?fid=1000226411&ttl=1535868531&ri=8192&rs=8192&setec=4e2c2ceca33c874025278ca06187c5af"
    }
  ]
}