{
  "modId": 80163.0,
  "modName": "Adia Star&#39;s Imperial Goddess",
  "summary": "REVEAL THE GODDES IN YOU using this expansion of Ashara&#39;s Imperial Outfit.",
  "descriptionHtml": "[font=Lucida Sans Unicode][i][center]\r<br />Goddess born lady you&#39;re a jealous one,\r<br />And Arachnea knows that you are watching her.\r<br />Will you take the weave and will you break the weft\r<br />Or will you let this lady spin her tapestry\r<br />Of a tale untold and then set her free?[/center]\r<br />[/i][center]\r<br />---[/center]\r<br />REQUIRES MESHES FROM ASHARA&#39;S IMPERIAL OUTFIT (http://www.nexusmods.com/skyrim/mods/51682/?)\r<br />\r<br />[center]---[/center]\r<br />[size=4][center]REVEAL THE GODDESS IN YOU&#33; [/center][/size]\r<br />Brave adventurer, head to Riften and locate Arachne Shadow-weaver to purchase her fine wares&#33; (you can&#39;t miss her, she&#39;s the only giant spider in town). She will sell you the recipes and materials you need to create a total of thirty-two togas, sleeves optional. You can also make yourself five sets of braces, belts and shoes - the latter in two models&#33; To finish it all off, there are a total of 4 different styles of laurel wreaths for your divine locks. Please see the ridiculous amount of screenshots to get a feel for what is available to you.\r<br />Everything is craftable at the tanning rack, provided that you have the correct books and dyes. Dyes can be created if you have the dye list, empty bottles, and the correct ingredients, all of which you can buy from Arachne. In total, there are eight colour options of both plain and patterned versions, long and short models. Basically, I&#39;m giving you a total of thirty-two choices (double that if you count the fact that the sleeves are standalone and can thus be removed). The only thing not included are the MESHES, you need Ashara&#39;s Imperial Mod for that. \r<br />\r<br />\r<br />[size=3]Recommended installation process:\r<br />1. install this mod with whichever mod manager you use (I use MO).\r<br />2. Download the latest version available of Asharas Imperial Outfit.\r<br />3. Extract ONLY THE MESHES from Asharas Imperial Outfit.\r<br />4A: If using MO, add the meshes to this mod&#39;s folder in the MO&#39;s mod folder.\r<br />4B: If installing with NMM or manually, add the meshes-folder to your skyrim data folder.\r<br />5: (optional) message me and complain because it didn&#39;t work. I&#39;ll help you. Unless you tell me that you did not add the meshes like I told you, in which I&#39;ll point, laugh, and feed you to Arachne.\r<br />6: go talk to the giant spider. Don&#39;t worry, she&#39;s the friendly sort.[/size]\r<br />\r<br />[center][/center]\r<br />[size=4]                         FAQ:[/size]\r<br />\r<br />Q: I&#39;m scared of spiders can you turn her into something else?\r<br />A: I already did. v2 has Arachne as a redguard woman at the Bee and Barb. \r<br />\r<br />Q: I&#39;m a guy, what if I want to reveal the goddess in me?\r<br />A: Don&#39;t worry, every single item has a male version (and if you feel like doing a spot of modeling that&#39;d be much appreciated).\r<br />\r<br />Q: There are 3 books, how do I know which one has which recipes?\r<br />A: You read them. I trust you know how to read.\r<br />\r<br />Q: I can&#39;t find the merchant&#33;\r<br />A: Go to Riften. Look at my screenshots for hints. She&#39;s not that hard to miss. Just look for the giant frostbite spider.\r<br />\r<br />Q: Why isn&#39;t Arachne black like in the screen shot?\r<br />A: Yeah... I have a retex that I can&#39;t remember where I found. Sorry about that.\r<br />\r<br />Q: Is this compatible with Dawn of Riften?\r<br />A: Yes, but the oxen are not happy. They don&#39;t understand that Arachne is a vegetarian.\r<br />\r<br />Q: Is this compatible with &lt;insert mod here&gt;?\r<br />A: Unless you decide to place something major in eastern Riften, then I am pretty sure the answer is yes. \r<br />\r<br />Q: OMG why are there so many steps to this? Do I really have to make the dyes first?\r<br />A: I was originally going to have you weave the fabric and spin the thread, too. Stop complaining.\r<br />\r<br />Q: Why can&#39;t Arachne just sell the finished garments?\r<br />A: Have you ever seen a gigantic frostbite spider sew a toga? It&#39;s not pretty.\r<br />\r<br />\r<br />This is the first mod I have uploaded, and I hope you will like it. There should be no problems, but if there are please let me know immediately&#33; I have tested it until my eyes bled on both an unmodded game and a heavily modded one, and I&#39;ve had no problems. \r<br />Plenty of love, bling, adventures and gigantic cuddly arachnoids,\r<br />\r<br />Adia Star\r<br />\r<br />[i][center](...For Arachnea weaves, and she weaves so well...)[/center][/i][/font]",
  "categoryId": "60",
  "version": "1",
  "author": "AdiaStar",
  "createdUnix": "1478918781",
  "updatedUnix": "1479024228",
  "containsAdultContent": false,
  "uploadedBy": "rivergenesis",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000227851",
      "name": "Adia Star&#39;s Imperial Goddess",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10811",
      "fileName": "Adia Star's Imperial Goddess-80163-1.7z",
      "uploadedUnix": "1478918498",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/12beff1a0b8c6d41f8e94af122600743b3c807046ec3f6be65f6b6cbacb719d0/analysis/1478929385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Adia%20Star%27s%20Imperial%20Goddess-80163-1.7z?fid=1000227851&ttl=1535868805&ri=8192&rs=8192&setec=d4b5e815dde13b3de42bd5571f325933"
    },
    {
      "fileId": "1000228003",
      "name": "Arachne v2",
      "version": "1.1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10811",
      "fileName": "Arachne v2-80163-1-1.7z",
      "uploadedUnix": "1479024228",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4813359852f126eaeac7248812e1a56d756d1ba7135ed3e8ed18b7c5c37e856f/analysis/1479024245/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arachne%20v2-80163-1-1.7z?fid=1000228003&ttl=1535868805&ri=8192&rs=8192&setec=a0624f3627a1db609b4a160ea879b5e7"
    }
  ]
}