{
  "modId": 80184.0,
  "modName": "Astoria and Caspian (CUSTOM VOICED FOLLOWER SIBLINGS)",
  "summary": "Two nord sibling followers. Fully voice acted. Quest Aware. Romance Questline/Marriageable.",
  "descriptionHtml": "[img]https://68.media.tumblr.com/2a280665970f5c3df476e90450d244d7/tumblr_ogk18vbufD1vqirzgo1_1280.png[/img]\r<br />[center][size=5]After the death of their parents at an early age they learned the hard way that the only ones they could count on were each other. But when Caspian goes missing Astoria is forced to seek out the help of the legendary Dragonborn in order to get him back. [/size][/center]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Fully Custom Voiced - Over 200+ lines of dialogue written per character. Voice acted by the amazingly talented NAME & NAME.\r<br />\r<br />Quest Aware - Both characters add commentary to the main quest as well as numerous side quests. Take them both along from the very beginning to best experience this mod. (Thieves Guild, College of Winderhold, and The Companions are fully supported. The Dark Brotherhood is to come in the next update.)\r<br />\r<br />Chatty - Bring Skyrim to life with their commentary about the world around them. Certain NPC&#39;s may also have conversational dialogue&#33;\r<br />\r<br />Pick and Choose - Travel with just one or with both. Although I recommend using both of them for the fullest experience, as they have dialogue together. :)\r<br />\r<br />Romance/Marriage - Are you tired of the boring vanilla marriages? Do you want a little more slow burn and depth? Well you&#39;re in luck, both Astoria and Caspian come with their own romance/marriage storylines. These are opened to characters of any gender/race&#33; Want to keep them both as your Dragonborn&#39;s friends and romance neither? No problem&#33; The romance is only started after very obvious dialogue options (and only after certain requirements are met. No jumping in to marriage without even knowing them.)\r<br />\r<br />Quests - They come with a short introduction quest involving both of them, and then an optional personal questline for each. More to come soon&#33;\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[center]FAQ\r<br />\r<br />[b]Will they ever interact with other voiced followers on the nexus?[/b]\r<br />\r<br />I&#39;d definitely be up for that, but the mod author of the other follower would need to be on board as well. If any of you are reading this and want this to happen, shoot me a message&#33;\r<br />\r<br />[b]Is this lore friendly?[/b]\r<br />\r<br />I tried my best to keep it that way&#33; There aren&#39;t any pop culture references if that&#39;s what you&#39;re asking.\r<br />\r<br />[b]Where can I find Astoria/Caspian?[/b]\r<br />\r<br />You can find Astoria in Dragonsreach. Caspian won&#39;t show up until you rescue him.\r<br />\r<br />[b]Is this incest-y? Is there any chance that they could date each other?[/b]\r<br />\r<br />No.\r<br />\r<br />[b]Can you romance both at the same time?[/b]\r<br />\r<br />No.\r<br />[b]\r<br />Can you romance one while being married to the other/married in general?[/b]\r<br />\r<br />No.\r<br />\r<br />[b]How do you get Astoria/Caspian to marry you?\r<br />[/b]\r<br />You have to complete their main quest along with the individual quest of whomever you wish to marry. You also have to have had spent at least 50 in game days with her/him to unlock the romance quest through dialogue options, and then after you complete that you should be able to marry her/him.\r<br />\r<br />[b]I don&#39;t like xyz about this mod, can you change it?\r<br />[/b]\r<br />It&#39;s impossible to make everyone happy. If I changed something for you and someone else asked me to change it back, we&#39;d be stuck in a loop. So I&#39;m going to have to say no to that. Depending on what it is, I could possibly make an optional patch though.[/center]\r<br />\r<br />CREDIT\r<br />NAME - Voice of Astoria\r<br />NAME - Voice of Caspian",
  "categoryId": "96",
  "version": "1.0",
  "author": "khaleesiing",
  "createdUnix": "1478997823",
  "updatedUnix": "1478997823",
  "containsAdultContent": true,
  "uploadedBy": "khaleesiing",
  "primaryFile": null,
  "files": []
}