{
  "modId": 80254.0,
  "modName": "Enchantments and Artifacts",
  "summary": "Overhaul vanilla enchantments and Artifacts effects, making then more balanced, interesting, unique and usefull along with some exploit and bug fixes.",
  "descriptionHtml": "[center][font=Verdana][color=#d0e0e3][b][i][size=6]Enchantments and Artifacts[/size]\r<br />\r<br />[/i][/b][/color][/font][size=3]This mod overhaul most of the vanilla effects for commom enchantments and almost all unique items effects, making then more interesting and balanced. Fully compatible with mods that edit armors/ weapons and leveled lists as this mod only touch the effects and enchantments records, greatly reducing the risk of conflicts.[/size]\r<br />\r<br />\r<br />[color=#fff2cc][size=4][b]Important Notes[/b][/size][/color]\r<br />\r<br />[size=3]- Crafting loop is gone&#33; Fortify smithing, alchemy and enchanting effects now increase the xp gained when performing these activities.[/size]\r<br />\r<br />[size=3]- Commom enchantments no longer stack if the very same effect is placed in two different pieces of armor, you only get the effect from the one with higher magnitude. Artifacts that might happen to have a similar effect will actually stack with commom enchantments though.\r<br />\r<br />- Many vanilla enchantments were totally remade but special care were took to make that the sufix names found in the preset enchanted gear found in the world, still match the new effects.[/size]\r<br />\r<br />[size=3]- Most artifacts and unique weapons no longer use charges and few cost magicka instead.[/size]\r<br />\r<br />[size=3]- Many powerfull artifacts, specially daedric ones have detrimental effects but they were not actually nerfed, their power might compensate the drawbacks.\r<br />\r<br />- Effects from Daedric artifacts are exclusive to the player&#33; They were meant to be a gift/ curse to the dragonborn, not your followers.\r<br />\r<br />- Absorb health enchantments no longer work on undeads, the exception is the Bloodthorn.[/size]\r<br />\r<br />[size=3]- Some alchemy effects related to fortify skills were also edited to match the enchanting effects.\r<br />\r<br />[/size]...\r<br />\r<br />See the full list bellow\r<br />\r<br />\r<br />\r<br />[color=#f4cccc][size=5][b]Commom Enchantments\r<br />\r<br />[/b][/size][/color]\r<br />[size=3][color=#c9daf8]Fortify Alchemy/ Enchanting/ Smithing[/color] -&gt; Increase skill increase rate in the corresponding activity by x%.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Alteration/ Conjuration/ Destruction/ Illusion/ Restoration[/color] -&gt; Increase spell magnitude or duration in the corresponding school by x%. (Potions not decrease the spell cost instead)[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Block[/color] -&gt; Block x% better and bashes/ power bashes deal +x% damage.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Speed[/color] (old fortify carry weight)-&gt; Increase movement speed by x%.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Armor[/color] (old fortify heavy armor) -&gt; Increase armor rating by x points.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Reflect Damage[/color] (old fortify light armor) -&gt; Reflect x% of the incoming physical damage back to the attacker.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Piercing[/color] (old fortify lockpicking) -&gt; Lockpicking is x% easier and bypass x% of the target armor protection.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Swift Hands[/color] (old fortify pickpocket) -&gt; Pickpocketing is x% easier and unnarmed attacks deal x% more damage.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Sneak[/color] -&gt; Sneaking is x% easier and deal +x% sneak attack damage.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Endurance[/color] (old fortify one-handed) -&gt; Power attacks cost x% less stamina.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Damage[/color] (old fortify two-handed) -&gt; Weapons deal x% more damage.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Archery[/color] -&gt; Ranged weapons have x% chance to score a critical hit for x% more damage.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fortify Speech[/color] -&gt; Buy and sell items for x% better prices and shouts deal x% more damage.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Fire damage[/color] -&gt; Now take effect over 5 seconds and deal more damage then other elemental effects of a similar rank.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Frost damage[/color] -&gt; Deal damage over 4 seconds and the stamina damage part of the effect is twice as strong.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Shock damage[/color] -&gt; Deal damage over 2 seconds and the magicka damage part of the effect is twice as strong.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Soul Trap[/color] -&gt; Now also deal untyped damage, not as strong as the elemental effects though and the soul trap duration is fixed in 3 seconds.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Turn Undead/ Fear[/color] -&gt; Now affect targets of higher lvls but the duration was decreased to 3 seconds only.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Silence[/color] (old magicka damage) -&gt; The target is unable to cast spells for x seconds.[/size]\r<br />\r<br />[size=3][color=#c9daf8]Weaken[/color] (old Stamina damage) -&gt; Reduce the target damage resistance by x points for 5 seconds. (This effect allow negative values)[/size]\r<br />\r<br />[size=3][color=#c9daf8]Chaos Damage[/color] -&gt; Random chance to deal x damage to health, magicka or stamina, consecutive hits increase the strengh of the effect. (This effect start relatively weak but can get really powerfull after 3 or 4 strikes but not as unbalanced as the old effect was).[/size]\r<br />\r<br />[size=3]...[/size]\r<br />\r<br />[size=3]Also, all other commom enchantments not mentioned have it`s magnitudes and cost tweaked in some way.[/size]\r<br />\r<br />\r<br />\r<br />\r<br />[color=#f4cccc][size=5][b]Artifacts\r<br />\r<br />[/b][/size][/color][color=#c9daf8]Amulet of Articulation[/color][color=#f4cccc] [/color]-&gt; Increase skill increase rate by x%.\r<br />\r<br />[size=3][color=#c9daf8]Bolar`s Oathblade[/color] -&gt; Reduce enemy damage resistance by 50 points each hit for 5 seconds. Cost no charges.\r<br />\r<br />[color=#c9daf8]Bow of the Hunt[/color] -&gt; Deal 4 bleeding damage for 10 seconds to animals. Cost no charges.\r<br />\r<br />[color=#c9daf8]Briarheart Geis[/color] -&gt; Deal 20 extra damage to nords. Cost no charges.\r<br />\r<br />[color=#c9daf8]Chillrend[/color] -&gt; Deal 1.5 damage and slowdown enemies by 50% for 5/ 10/ 15/ 20/ 25/ 30 seconds.\r<br />\r<br />[color=#c9daf8]Dragonbane[/color] -&gt; Deal 10 untyped damage and extra 20/ 25/ 30/ 35/ 40 damage to dragons. Cost no charges.\r<br />\r<br />[color=#c9daf8]Gauldur Amulet[/color] -&gt; When hit by fire, frost or shock spells, 25% chance to summon an atronach based on the elemental that damaged you for 30 seconds.\r<br />\r<br />[color=#c9daf8]Ghost Weapons[/color] (Drainblood Axe/ Drainspell Bow/ Drainheart Sword/ Ghostblade) -&gt; 10% chance to become ethereal for 5 seconds when hitting an enemy and restore 25 health along with the vanilla effects for each weapon. Cost no charges.\r<br />\r<br />[color=#c9daf8]Harkon`s Sword[/color] -&gt; Absorb 15 points of health. 30% chance to invoke a swarm of bats that damage hostiles in the area for 10 points of damage for 5 seconds (the wearer must be a vampire. Cost no charges.\r<br />\r<br />[color=#c9daf8]Kyne`s Blessing[/color] -&gt; Increase movement speed by 10% and reduce damage taken from animals by 30% when outdoors or in an animals den.\r<br />\r<br />[color=#c9daf8]Miraak Sword[/color] -&gt; Deal 15 untyped damage. Your unexpended Dragon Souls will empower this weapon even more, dealing 4 extra damage for each soul, up to +40 damage. Cost no charges.\r<br />\r<br />[color=#c9daf8]Necromancer`s Amulet[/color] -&gt; Spells are 35% more powerfull but also cost 50% more. 25% chance to proc a random effect while casting spells (Drain all your magicka/ Summon a strong skeleton/ Cast tentacles that deal poison damage/ Become etheral for 8 seconds/ Reanimate the dead around you with an explosion that will knock you down).\r<br />\r<br />[color=#c9daf8]Notched Pickaxe[/color] -&gt; Deal 5 points of shock damage and reduce armor rating of creatures made of stone by 50 points for 5 seconds. Cost no charges.\r<br />\r<br />[color=#c9daf8]Poachers Axe[/color] -&gt; Deal 1 bleeding damage for 10 seconds. Animals take extra 1 points of damage per each 5 animals you have slayed, up to +50 damage.\r<br />\r<br />[color=#c9daf8]Red Eagle Bane[/color] -&gt; Deal 10 fire damage or 40 fire damage while in the Reach. Cost no charges.\r<br />\r<br />[color=#c9daf8]Saarthal Amulet[/color] -&gt; Reduce your magicka by 100 points but spells cost 30% less to cast.\r<br />\r<br />[color=#c9daf8]Shield of Solitude[/color] -&gt; Grant the wearer +20/ 30/ 40/ 50 / 60 stamina. In combat while blocking and bellow 75% health, drain 1/ 2/ 3/ 4/ 5 stamina per second in order to restore the same amount of health.\r<br />\r<br />[color=#c9daf8]Trollsbane[/color] -&gt; Burn enemies for 1 points of damage for 5 seconds. Trolls receive five times as much damage. Cost no charges.\r<br />\r<br />[color=#c9daf8]Ysgramor Shield[/color] -&gt; Grant the wearer +200 armor rating and +20% Magic Resistance while blocking. Targets that hit the shield have 25% chance to stagger and have it`s stamina damaged by 50 points.\r<br />\r<br />[color=#c9daf8]Wuuthrad[/color] -&gt; Attacks hit all targets in front of you. +20% damage to elven races.\r<br />\r<br />...\r<br />\r<br />These are the most noticeable changes, other artifacts also have tweaked stats or effects replaced for better balance or because they felt too uninterresting in the first place.[/size]\r<br />\r<br />\r<br />[color=#f4cccc][size=5][b]Daedric Artifacts[/b][/size][/color]\r<br />\r<br />[size=3][color=#c9daf8]Dawnbreaker[/color] -&gt; Burn undeads for 10 points of damage plus 20% of their current health. Hits have a chance to cause an explosion that deal a burst light damage, stagger and turn any undead in the area (the chance for the explosion to proc is based on the undead lvl and their remaing health percentage, the stronger the enemy is, higher are the odds). Cost no charges.\r<br />\r<br />[color=#c9daf8]Ebony Blade[/color] -&gt; Drain up to 30 health each hit and silence the target for 5 seconds. Each hit cost 10 magicka to the wearer and the absorb health effect will only take effect if the wearer have enough magicka. Cost no charge.\r<br />\r<br />[color=#c9daf8]Ebony Mail[/color] -&gt; Grant the wearer 15% magic resistance and 30% fire resistance. Boethiah Challenger: Enemies that hit you in melee range have 25% chance take 50 points of untyped damage and have their damage increased by 100% for 5 seconds. If the target is slayed by the player during this effect, the player will gain +20% damage damage for 1min, this effect stacks.\r<br />\r<br />[color=#c9daf8]Keening[/color] -&gt; While equiped, this weapon will constantly drain your health by 5 points per second but will drain 10% of your target current health to replenish your own. Cost no charges.\r<br />\r<br />[color=#c9daf8]Mace of Molag Bal[/color] -&gt; Mark the target for 30 seconds while dealing 1 point of curse damage for 30 seconds, if the target is slayed by the player during this duration his soul will be absorbed by the mace (the soul charge is equal to the lvl of the enemy slayin) but if he survive the curse, the wearer will be damaged by a value equal to the number of soul charges the mace currently has. Once you have 50 soul charges you can release those souls into an explosion that damage equal to twice of soul charges the mace currently has (the mace can hold up to 100 charges). Cost no charges.\r<br />\r<br />[color=#c9daf8]Masque of Clavicus Vile[/color] -&gt; Spells power, weapon damage, stamina/ magicka regeneration rates are 25% stronger when above 60% health but 50% weaker when bellow 40% health. Trying to remove the mask in combat to prevent the harmfull effects will cause 100 damage to all stats.\r<br />\r<br />[color=#c9daf8]Mehrunes Razor[/color] -&gt; Target and wearer take 5 points of shock damage each hit. Targets also have their shock resistance reduced by 30% for 15 seconds (effects stacks) and 2% chance to be disintegrated. Cost no charges.\r<br />\r<br />[color=#c9daf8]Ring of Hircine[/color] -&gt; Allow additional werewolf transformation. Increase health and stamina by 50 points but magicka is depleted.\r<br />\r<br />[color=#c9daf8]Ring of Namira[/color] -&gt; Increase Stamina by 50 points and reflect 25% damage back to the attacker. Feeding on corpses grants you increased Health and Health regeneration.\r<br />\r<br />[color=#c9daf8]Sanquine Rose[/color] -&gt; Summons a Dremora for 60 seconds at the cost of 75 magicka (require 75 magicka to be used). Cost no charges.\r<br />\r<br />[color=#c9daf8]Savior Hide[/color] -&gt; +15% magic resistance or + 30% magic resistance while under the moonlight. Increase health regeneration by 200% but healing spells and potions are 75% less effective.\r<br />\r<br />[color=#c9daf8]Skull of Corruption[/color] -&gt; 15 points damage, increases to 30 if powered with dreams collected from sleeping people. Cost no charges.\r<br />\r<br />[color=#c9daf8]Spellbreaker[/color] -&gt; While blocking, creates a ward that protects against spells for 20 points of damage per 50 magicka the wielder have, up to 100 points at 200 magicka. While the ward is up, magicka will be drained by 5 points per second.\r<br />\r<br />[color=#c9daf8]Volendrung[/color] -&gt; Attacks stagger enemies that are not blocking, if the target is already staggered he will be knocked down and receive 50 points of damage at the cost of 50 stamina from the player. Cost no charges.\r<br />\r<br />[color=#c9daf8]Wabbajack[/color] -&gt; A blast from Wabbajack with an unpredictable effect at the cost of a random amount of magicka (1-50) and require 50 magicka to be used. Cost no charges.[/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[/center]",
  "categoryId": "75",
  "version": "1.0",
  "author": "Alex9ndre",
  "createdUnix": "1479259107",
  "updatedUnix": "1479259107",
  "containsAdultContent": false,
  "uploadedBy": "Alex9ndre",
  "primaryFile": null,
  "files": []
}