{
  "modId": 8029.0,
  "modName": "Darwins Nightmare",
  "summary": "The party\\'s over. Hardcore economic and survival system plus lots of realism tweaks.",
  "descriptionHtml": "[size=16][color=#ffcc66]===================[/color][/size]\r\n[size=16] [color=#66ccff] [b] DARWINS NIGHTMARE  [/b] [/color] [/size]\r\n[size=16][color=#ffcc66]===================[/color][/size]\r\n\r\nNOTE: THIS MOD IS CURRENTLY BEING OVERHAULED WITH MANY MORE ADDED FEATURESE.\r\n\r\n[size=3][color=#ffcc66] [b]  Other mods by bootliquor:[/color][/size]\r\n[size=3][color=#66ccff] [url=http://skyrim.nexusmods.com/downloads/file.php?id=8029] Darwins Nightmare[/url][/color][color=#cc6699] - The ultimate hardcore realism and survival experience. [/color][/size]\r\n[size=3][color=#66ccff] [url=http://skyrim.nexusmods.com/downloads/file.php?id=8363] Sacred Stones [/url][/color][color=#cc6699] - Overhauls shrine and standing stone buffs to be more useful, better balanced, and less overpowered.[/color][/size]\r\n[size=3][color=#66ccff] [url=http://skyrim.nexusmods.com/downloads/file.php?id=8029] Enchant Me Not [/url][/color][color=#cc6699] - An overhaul of Enchanting perks and Item Enchanting. [/color][/size]\r\n[size=3][color=#66ccff] [url=http://skyrim.nexusmods.com/downloads/file.php?id=8029] KoS - Alternate Adventures [/url][/color][color=#cc6699] Play against all of skyrim that was once your friend. Faction changes make you kill on sight.[/b] [/color][/size]\r\n\r\n[size=4] [b][color=#ffcc66]  Read Instructions Before Installing!  [/b] [/color] [/size]\r\nRefer to Section 3 on this page or INSTRUCTIONS.txt in the download for installation procedures. \r\n\r\n[size=4] [color=#ffcc66] [b]  HIGHLIGHTS  [/b] [/color] [/size] \r\n[list] [*] Makes the game much harder economically and introduces hardcore survival system. [/list] \r\n[list] [*] Skyrim is poorer - get less generic gold and loot. (magic/special loot unaffected) [/list] \r\n[list] [*]  Speech tree perks redone and provides an avenue to wealth in poor economy. [/list] \r\n[list] [*]  Food and sleep buff/debuff survival system that requires cooking, planning, and foresight. [/list] \r\n[list] [*] Player will struggle to survive without cooked food and sleep.[/list] \r\n[list] [*]  20 new recipes that require gathering an expanded ingredient base. [/list] \r\n[list] [*]  A real use for firewood and the cooking fire. [/list] \r\n[list] [*] Live in the wild - no need for player bed or inn. [/list] \r\n[list] [*] Disease and creature poison overhaul with chance of slow death (plague/toxicity). [/list]\r\n[list] [*]  Realistic wildlife movement - hunting is much harder, no longer outrun wolves, bears, etc. [/list]\r\n[list] [*] Increase the cost of carriage travel and room rental to be more realistic. [/list]\r\n[list] [*]  Lots more, read all below! [/list]  \r\n\r\n[size=4] [color=#ffcc66] [b]  CONTENTS  [/b] [/color] [/size] \r\n1) Introduction\r\n2) Structure and Component Overview\r\n3) Installation and Removal \r\n4) Compatibility\r\n5) Appendix\r\n\r\n[size=4] [color=#ffcc66] [b]  1) INTRODUCTION  [/b] [/color] [/size]\r\nDarwinian Nightmare is designed to bring challenge and realism to the game. For now, I\\'m considering it a beta release until it passes public muster without any major problems. Please read all documentation before installation AND uninstallation. While Darwinian Nightmare can be installed on an existing game, the experience is much better with a new game as many of the changes have long term in game consequences. If starting a new character, wait until exiting the tunnel from Helgen before installing (which is good practice with all mods).\r\n\r\n[size=4] [color=#ffcc66] [b]  2) STRUCTURE & COMPONENT OVERVIEW  [/b] [/color] [/size] \r\n[color=#ffcc66][b] Darwins Nightmare consists of two major components:[/b][/color] [color=#66ccff][b]HARD TIMES[/b][/color] and [color=#66ccff][b]PRIMITIVE TIMES. [/b][/color] Each component is available as an all-in-one plugin or as a group of plugins from which the player can choose which subcomponents to install, thereby making Darwins Nightmare highly configurable. Each subcomponent module can run standalone, but used together they greatly enhance each other. There are also several optional hardcore plugins (tweaks) that can be found in marked folders in the download.\r\n\r\n[color=#66ccff][size=2] [b]A. HARD TIMES [/b][/size][/color] main file: ([color=#66ccff]Darwins_Hard Times.esp [/color])     (includes Less Is More, Speech to Riches, Vendorspeak)\r\nHard Times creates economic hardship for the player by limiting the amount of gold and other items acquired from looting. At the same time it reworks the Speech perk tree to provide a path to wealth, making the Speech skill much more useful. Hard Times has three subcomponents: Less Is More, Speech to Riches, & Vendorspeak, which are available as separate modules. \r\n\r\nSubcomponents of Hard Times:\r\n\r\n[u]LESS IS MORE[/u]     (economic hardship) (Darwins_Less Is More.esp) \r\nThis subcomponent reduces the amount of gold, gems, jewelry, food, and soulgems obtained as loot from corpses, urns, furniture, barrels, and chests. Does not affect magic items. Includes individual plugins for each change so player can customize if desired.\r\n[list] [*] 50% less chance of looting generic gems from npc(s) and chests.[/list]\r\n[list] [*] 50% less chance of looting generic gems and jewelry from furniture.[/list]\r\n[list] [*]50% less chance of looting generic jewelry from chests and npc.[/list]\r\n[list] [*]75% less chance of finding generic non-leveled gold loot throughout the game world.[/list]\r\n[list] [*] Generic enemies are poor and only have a few gold each.[/list]\r\n[list] [*] Affects silverhand, hagraven, vampire, forsworn, warlock, draugr, bandit, imperials, stormcloaks.[/list]\r\n[list] [*]Increase the cost of carriage travel and room rental tenfold.  Room cost is 100, carriage 200/500. [/list]\r\n[list] [*] Optional file: 50% less chance of looting all types of soulgems in chest & npc.[/list]\r\n\r\n[u]SPEECH TO RICHES[/u]   (speech perks redone and a path to wealth)    (Darwins_Speech To Riches.esp)   \r\nThis subcomponent redesigns the Speechcraft perk tree to provide an avenue to wealth in a challenging economy. New perk rewards that greatly affect vendor prices and give bonuses to gold, gem, and special item loot.\r\n[list] [*]All the vanilla perks remain (location may be different in the tree). [/list]\r\n[list] [*] Haggler perk ranks have been spread throughout the right side of the tree (with increased bonuses).[/list]\r\n[list] [*]Left tree perks have extra benefits added creating increased gold, gem, and special item loot. [/list]\r\n--Perk Name --------------------------- Description ---------------------------- Level Required--\r\n---Haggler - Buying and selling prices are 10% better. Can sell any type of item to any merchant.  20\r\n---Bribery - Can bribe guards to ignore crimes. Prices are 20% better. 30\r\n---Persuasion - Persuasion attempts are 30% easier. Prices are 35% better. 50\r\n---Intimidation - Intimidation is 3x as likely to be successful. Prices are 50% better. 70\r\n---Investor - Find more gold. Can invest 500 gold with a shopkeeper to increase his available gold. 60\r\n---Fence - Can barter stolen goods with any merchant you have invested in. Greater chance of finding Special Loot 90\r\n---Master Trader - Every merchant in the world gains 1000 gold for bartering. Find more gems. 100\r\n\r\n[u]VENDORSPEAK[/u]  (merchant pricing rebalance)    Darwins_VENDORSPEAK.esp   \r\nThis subcomponent drastically changes selling and buying prices.  It rebalances prices to be more aggressive while at the same time giving Speech skill a bigger effect on prices.\r\n[list] [*] Changes merchant barter scaling to (Max=13.5, Min=4.5) from (Max =3.3, Min=2) vanilla.[/list]\r\n[list] [*] Merchant items cost more and player items sell for less. This is offset by Speech perks that move prices in the players favor.[/list]\r\n\r\n\r\n[color=#66ccff][size=2] [b]B. PRIMITIVE TIMES [/b][/size][/color] main file: ([color=#66ccff]Darwins_PRIMITIVE TIMES.esp[/color]) (includes East Sleep Die and Infected)\r\nPrimitive Times is a realism and survival system mod that mandates food and sleep for gameplay, which further mandates ingredient gathering, cooking, firewood, new recipes, firewood and more. Wildlife movement is more realistic making hunting harder, andmodified creature poisons and diseases have a chance to cause a slow horrible death. Both subcomponents are built on the same system of buffs and debuffs, thereby creating a synergy between them. (requires manual installation of bat file – see INSTRUCTIONS.txt)\r\n\r\nSubcomponents of Primitive Times:\r\n\r\n[u]EAT SLEEP DIE[/u] (survival mod mandates gathering, firewood, cooking, eating, sleeping)   (Darwins_Eat Sleep Die.esp)   \r\nThis subcomponent mandates cooking and sleeping to function, or even survive. It will require foresight and planning in regard to ingredient gathering and cooking. Without food and sleep, the player will become exhausted, moving and attacking slower. Sleep andfood also enable health, stamina, and magicka regeneration. \r\n[list] [*] Without sleep you will become Exhausted: moving 15% slower and attacking 40% slower.[/list]\r\n[list] [*] Works with Marriage Sleep. Werewolves must feed instead of sleep. [/list]\r\n[list] [*] Sleep provides 50% of player Health, Stamina, and Magicka (HSM) regeneration.[/list]\r\n[list] [*] The other 50% of player HSM regeneration comes from food.[/list]\r\n[list] [*] 20 new recipes created. Only the new recipes will provide the full 50% HSM regeneration. [/list]\r\n[list] [*] All other food items provide 25% HSM (and last half as long) making it essential to cook. [/list]\r\n[list] [*] Food benefits do not stack. Vanilla recipes have been removed.[/list]\r\n[list] [*] All recipes require 2 firewood each (for the fire), thereby creating a real need for it. [/list]\r\n[list] [*] The amount and frequency of food found in barrels has been decreased by roughly 65%.[/list]\r\n[list] [*] The Lover Stone provides the benefits of Sleep & Food as a way(cheat) to go without sleeping & eating.[/list]\r\n[list] [*] Alchemy is not affected in any way. Beverages are not affected in any way.[/list]\r\n[list] [*] Sleep and Food benefits last three hours real time. Sleeping can be done in any bed so player can live in the wild.[/list]\r\n[list] [*] Uses timescale 6 so that a Skyrim day is four hours, and sleeping and eating are necessary once per game day.[/list]\r\n[list] [*] Timescale is changed because at vanilla timescale a player has to sleep every 72 minutes to sleep once a day.[/list]\r\n[list] [*]See Appendix for ingredient base and recipes.[/list]\r\n\r\n[u]INFECTED[/u] (realistic wildlife with killer creature poisons, diseases, and plague)  (Darwins_Infected.esp)\r\nThis subcomponent modifies creature movement speeds to be more realistic, making hunting for food harder. Modifies creature disease effects and creates chance of Plague which will drain health until cured, possibly killing the player. Creature poisons are stronger and have chance of Toxicity, with the same effects as plague.\r\n[list] [*] Diseases and Poisons have a chance to apply a debuff, Infected (plague), which drains health over time until cured.[/list]\r\n[list] [*] Too many stacks (or even one) of Infected can kill, depending upon current health regen rate and difficulty setting.[/list]\r\n[list] [*] Creatures with Diseases: Bear, Wolf, Chaurus, Hagraven, Skeever, Sabrecat[/list]\r\n[list] [*] Now, creatures can transmit any disease type including plague.[/list]\r\n[list] [*] The disease changes also apply to diseases caused by traps.[/list]\r\n[list] [*] Some diseases have had their effects changed. (see below)[/list]\r\n[list] [*] Creature Poisons: Falmer, Spider, Chaurus, Spriggan[/list]\r\n[list] [*] Creature poisons in general have had their strength and duration buffed.[/list]\r\n[list] [*] Alchemy poisons are not affected in any way.[/list]\r\n[list] [*] Wildlife movement has been tweaked to be more realistic. [/list]\r\n[list] [*] You can no longer chase down wildlife for the raw meat you will need for Cooking.[/list]\r\n[list] [*] Aggressive wildlife will attack faster. No more outrunning a sabrecat or bear.[/list]\r\n[list] [*] Affected: Sabrecat, wolf, deer, chicken, goat, bear, rabbit, spider, elk, horker.[/list]\r\n[list] [*] Hardcore Optional : tweak player run and horse speed to make more realistic travel[/list]\r\n[list] [*] See Appendix for disease effects[/list]\r\n\r\n[size=4] [color=#ffcc66] [b]  3) INSTALLATION & REMOVAL  [/b] [/color] [/size]\r\n\r\n[color=#66ccff] [b] Update Instructions: If you are only updating, you DO NOT need to reinstall the darwins_primitive bat file. For update, just replace the old esp files in the Skyrim/Data directory with the new esp files.[/b] [/color] \r\n \r\nJust place the esp files in the Skyrim/Data directory. [b]Primitive Times and East Sleep Die require an additional install procedure below.[/b]\r\n\r\nPRIMITIVE TIMES or its subcomponaent EAT SLEEP DIE require the following additional manual installation AND uninstallation procedure. These instructions are ONLY for installing Primitive Times or its subcomponent Eat Sleep Die:\r\n\r\nCONSIDER\r\nYou may want to keep in mind that after installing, your character will move slower, attack slower, and will not regenerate health, stamina, or magicka until you sleep and eat. Some food ingredients will be placed in your inventory that you can cook a meal with, but you will need to find a cooking fire and a bed. So you may want to find a good location before you install. Any unowned bed will do. Bear in mind that gathering the items needed to cook meals may require some effort, especially until the player builds up a stock of ingredients. And you\\'ll need an axe for firewood.\r\n\r\nIT IS CRITICAL TO FOLLOW THE INSTRUCTIONS - You can break your game when uninstalling if you don\\'t follow step 1 of uninstall procedure.\r\nDO NOT INSTALL BEFORE CREATING A NEW CHARACTER - If you are starting a new character, then it is best to wait until you have exited the tunnel from Helgen before you install.\r\nMAKE A BACKUP OF YOUR CURRENT GAME PRIOR TO INSTALL - Back it up.\r\n\r\nINSTALLATION for PRIMITIVE TIMES - ONLY!\r\n1)  Place Darwins_Primitive_Times.esp (or Darwins_Eat_Sleep_Die)  into the Skyrim/Data directory.\r\n2) Place Darwins_primitive.txt and Darwins_UNprimitive.txt in the Skyrim root directory (where TESV.exe is located).\r\n3) Start your game.\r\n4) Make sure you do not have the Rested buff (the buff from sleeping.) Wait until it wears off if you do.\r\n5)  Open the console with the ~ key and type \\\"bat Darwins_primitive\\\" without the quotes.\r\n6) Save the game, then reload it.\r\n7) Congratulations, you are now tired and hungry!\r\n\r\nREMOVAL for PRIMITIVE TIMES - ONLY!  please follow step by step !\r\n1)  THIS STEP IS CRITICAL!!!!!  -  Make sure you do not have any Sleep/Rested or Disease/Poison effects !!!! - wait or cure until they are gone if you do.\r\n2)  Save the game when you do not have any of the effects named in step 1. Exit Skyrim.\r\n2)  Remove the Darwins_Primitive_TImes.esp file from the Skyrim/Data directory. Start Skyrim and load your savegame from step 2.\r\n2)  open the console and type \\\"bat Darwins_UNprimitive\\\"\r\n3)  Save game. Exit Skyrim.\r\n4)  Remove Darwins_primitive.txt and Darwins_UNprimitive.txt from the Skyrim root directory where TESV.exe is located.\r\n\r\n[size=4] [color=#ffcc66] [b]  4) COMPATIBILITY  [/b] [/color] [/size] \r\nCompatible with most popular mods, Darwin’s Nightmare makes no changes to Alchemy, Crafting, Combat, Magic, Graphics, NPC’s, Items (except food), AI, or quests. Listed below are incompatibilities.\r\n\r\nHARD TIMES\r\n[list] [*] Less is More  -  Small overlap with PISE on gold from urns. Load this after PISE if you want less gold.[/list]\r\n[list] [*] Speech to Riches - will conflict with other mods that change particular Speech Perks. Will work with mods like Auto-Perk,[/list]\r\n[list] [*] Vendorspeak  - PISE merchant pricing is easier. Load this after PISE if you want harder. [/list]\r\n\r\nPRIMITIVE TIMES\r\n[list] [*] Eat Sleep Die  -  Will conflict with any mod that modifies food items/ingreadients or sleeping. No conflict with mods that create new food recipes.[/list]\r\n[list] [*] Infected  -  will conflict with any mod that changes diseases or edits the RACE files of animals (bear, etc). Does not change NPC_ files.[/list]\r\n\r\n[size=4] [color=#ffcc66] [b]  5) APPENDIX [/b] [/color] [/size] \r\n\r\n[b]Optional Files:[/b]\r\n\r\nDarwinsPT_runspeed.esp\r\n* Changes player walk, run, and sprint speed to be more realistic. Much more realism with this.\r\nPlayer Walk Speed\t\t\t+10%\r\nPlayer Sneak Walk Speed \t\t+10%\r\nPlayer Run Speed\t\t\t-20%\r\nPlayer Sneak Run Speed\t\t-20%\r\nPlayer Sprint Speed\t\t\t-20%\r\n\r\nDarwinsHT_less_soulgems50.esp\r\n* 50% less chance of looting all types of soulgems in chest & npc.\r\n\r\n\r\n[b]DISEASE CHANGES[/b]\r\n==========================================================\r\nDisease\t\t\tDescription\r\n==========================================================\r\nPlague/Toxicity:\t\tdrain Health <x> points per second.\r\nAtaxia :\t\t\t-20% Attack Speed\r\nBoneBreak Fever :\t\tSneak reduced 50%. Bow speed reduced 50%.\r\nBrain Rot :\t\tYou are 50% less effective with Magic.\r\nRattles :\t\t\t-50 Poison and Magic Resistance\r\nRockjoint :\t\tYou are 50% less skilled with melee weapons.\r\nWitbane :\t\t\t-25% Stamina Regeneration -25%  Magicka Regeneration\r\n\r\n============================================================================\r\n[b]CHART of TIMESCALES[/b] - buffs last 3 hours\r\n============================================================================\r\n-------------------Timescale--------Game Day Length-----Need To Sleep/Eat  \r\n------------------------------------------(real hrs)------------(game days)-----\r\nxxxxxxxxxxx----------4--------------------6---------------------.66---------------\r\n[b]Mod Setting[/b]----------6--------------------4---------------------1---------------\r\nxxxxxxxxxxx----------8--------------------3---------------------1.33---------------\r\nxxxxxxxxxxx----------10------------------2.4-------------------1.66---------------\r\nxxxxxxxxxxx----------12------------------2---------------------2---------------\r\nxxxxxxxxxxx----------16------------------1.5-------------------2.66---------------\r\n[b]Vanilla Setting[/b]-------20-------------------1.2-------------------3.33---------------\r\n\r\n\r\n=============================\r\n[b]FOOD INGREDIENT BASE AND RECIPES[/b]\r\n=============================\r\nIngredient \r\n--------------\r\nfirewood (2 per meal)\r\nAle\r\nBread\r\nCabbage\r\nCanis Root\r\nCarrot\r\nCider\r\nEidar Cheese Wedge\r\nGarlic\r\nGoat Cheese Wedge\r\nGourd\r\nyellow Apple\r\nJazbay Grapes\r\nJuniper Berries\r\nLavender\r\nLeek\r\nMora Tapinella\r\nPotato\r\nRed Apple\r\nSalt Pile\r\nSnowberries\r\nTomato\r\nWheat\r\n\r\nRecipes \r\n---------------\r\nOmelete\t\r\nSeafood Gumbo\r\nFajitas\t\r\nSteak & Eggs\t\r\nHorsehead Soup\t\r\nBurrito\t\r\nRabbit Tenders\r\nQuiche\t\r\nMammoth Chili\r\nBraised Salmom\r\nCaviar & Crackers\t\r\nSausage& Cheese Plate\r\nDog\\'s Ear\tSandwich\r\nGoat Chop\r\nHorker on a Stick\t\r\nVeggie Burger\t\r\nHoney Glazed Salmon\t\r\nStuffed Chicken\r\nChicken Salad\t\r\nPheasant Burger",
  "categoryId": "78",
  "version": "beta.57",
  "author": "bootliquor",
  "createdUnix": "1328630425",
  "updatedUnix": "1332778230",
  "containsAdultContent": false,
  "uploadedBy": "bootliquor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "31892",
      "name": "Darwins Nightmare",
      "version": "beta.60",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "48",
      "fileName": "Darwins Nightmare-8029-beta-60.zip",
      "uploadedUnix": "1329364306",
      "modVersion": "beta.60",
      "virusScanUrl": "https://www.virustotal.com/file/f6fbe306b80db2498e92764586f62d302c5714af0b389d10ebfc3da5828fca92/analysis/1406686382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Darwins%20Nightmare-8029-beta-60.zip?fid=31892&ttl=1535766432&ri=8192&rs=8192&setec=026fe1d2dc79a19f9c0a880f07774e06"
    },
    {
      "fileId": "47078",
      "name": "olafs request",
      "version": "",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1",
      "fileName": "olafs request-8029-1.zip",
      "uploadedUnix": "1332778230",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d3931d690998353a319441b012c83f1ffc6533029f6ea7a8ff9c64cf90527404/analysis/1406781347/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/olafs%20request-8029-1.zip?fid=47078&ttl=1535766433&ri=8192&rs=8192&setec=73d6fc6a560eb595ea4048e481784639"
    }
  ]
}