{
  "modId": 80334.0,
  "modName": "Guide to Weather Creation and Realtime Snow Cover",
  "summary": "",
  "descriptionHtml": "[font=Tahoma][size=3]There were a thousand ENB presets for every weather mod made in Oldrim (Skyrim Classic). There wasn&#39;t even a category for weather mods on the nexus. You were essentially limited to choosing from several weather mods. I don&#39;t want this to happen for Skyrim SE. Although ENB is a powerful tool, it has its limitations. We now have many of the features of classic ENB integrated into Skyrim SE, and with the proper knowledge and practice, you can create your own weathers. [u]ENB and shaders should be used for polish only.\r<br />\r<br />[/u]Here are the advantages to having a community rich in weather mods.\r<br />\r<br />[/size][/font][list]\r<br />[*][font=Tahoma][color=#00ffff][size=3]You can have as many weather mods as you like. Fan of purity? Fan of CoT? Fan of VW? ELFX RLO or ELE Weathers (didn&#39;t they all have that option that no one ever chose?)? You can run them all at the same time, and I&#39;ll explain how. You can&#39;t with ENB&#39;s unless they are built from the same FX files (like NLA and it&#39;s NLVA child) without ruining the aesthetics of the ENB. [/size][/color][/font]\r<br />[*][font=Tahoma][color=#00ffff][size=3]Ever annoyed by annoyingly bright blue water lods? You can fix that with a weather mod, you can&#39;t with ENB.[/size][/color][/font]\r<br />[*][font=Tahoma][color=#00ffff][size=3]Ever annoyed by ugly horizons? You can fix that with a weather mod in ways you can&#39;t with ENB. [/size][/color][/font]\r<br />[*][font=Tahoma][color=#00ffff][size=3]Ever annoyed by ultra bright or dark tree lods? It shouldn&#39;t even be a problem with proper weather design. [/size][/color][/font]\r<br />[*][font=Tahoma][color=#00ffff][size=3]You can add custom snow, rain, and thunder.[/size][/color][/font]\r<br />[*][font=Tahoma][color=#00ffff][size=3]You can determine which weathers occur where and how often.[/size][/color][/font]\r<br />[*][font=Tahoma][color=#00ffff][size=3]You will maintain high performance.[/size][/color][/font]\r<br />[*][font=Tahoma][color=#00ffff][size=3]Perpetual summer days or winter nights???[/size][/color][/font]\r<br />[/list][font=Tahoma][size=3]\r<br />This is not a comprehensive guide, but it will cover everything you need to know to get started.\r<br />\r<br />A note on philosophy before we begin: Every one of these settings we will discuss has names. You will have to learn them, but you will then need to forget them. Each one of these settings may have been created for a specific purpose, but you should explore each one for ways in which it can be exploited to create new illusions. Weather creation is entirely about illusion. How are you going to make players feel that they are in an expansive country? How will you make them feel the warmth of a rising sun or the impending cold of sunset? How will you darken mountains at night so they&#39;re not lit up across the map? How will you capture the blinding brightness of snow on a sunny day? - the fear of storms and fogs? How will you accentuate each region for what it is through your weathers?\r<br />\r<br />Let&#39;s begin:\r<br />\r<br />1. First, you will need xEdit (SSEEdit) and the Creation Kit.\r<br />2. Open up xEdit and become familiar with the typical components of a weather mod and basic functions of xEdit.\r<br />\r<br />   Open up the skyrim.esm tree and find the weather record tree. Note the numerous records. A portion of those pertain to the weathers you experience outdoors. \r<br />[img]http://i.imgur.com/jUA6Nvp.jpg[/img]\r<br />The [color=#ffff00]&#34;copy as override into&#34;[/color] function will allow you to create modifications to the vanilla game that will show up without any additional steps. These are .esp equivalent of texture mods. \r<br />\r<br /> If you were to [color=#ffff00]&#34;copy as new record into,&#34;[/color] that would be like the equivalent of new armor mods. They&#39;ll require further steps to get them to show up in the game (ie. they&#39;ll need to be added to level lists). In the case of a weather mod, you will need to add new subrecords to the region subrecords in order for the weathers to appear in game. \r<br />\r<br />QUESTION: Note the formID column. When you &#34;copy as override into&#34; a new .esp, what will be the formID of these records?\r<br />ANSWER: They will be identical. When you &#34;copy as new record into&#34; a new .esp, the formID changes.\r<br />\r<br />Select &lt;new file&gt; and then name your weather mod. \r<br />\r<br />Make not of the ImageSpace, Region, and Volumetric Rays records. To summarize -\r<br />\r<br />[/size][/font][list]\r<br />[*][font=Tahoma][color=#ffff00][size=3]Weather records are for creating weathers.[/size][/color][/font]\r<br />[*][font=Tahoma][color=#ffff00][size=3]ImageSpace are like filters which allow you to add tint, contrast, brightness, saturation, focus (depth of field), and bloom.[/size][/color][/font]\r<br />[*][font=Tahoma][color=#ffff00][size=3]Region records define both the weathers and sounds that occur in that region (ie. Whiterun Tundra, Reach, Volcanic Tundra, Fall Forest, Snow, Marsh, and the various settlements)[/size][/color][/font]\r<br />[*][font=Tahoma][color=#ffff00][size=3]Volumetric rays govern the beams of sunlight that pierce through clouds. [/size][/color][/font]\r<br />[/list][size=3][font=Tahoma]\r<br />3. Open up the Creation Kit, open your mod, become familiar with navigation, and learn how to load modifications in-game (hot load plugin).\r<br />\r<br />Open the &#34;File&#34; drop-down menu in the top left and select data. Find your plugin, click active file, and then click okay. Then locate the cell view window and make note of the World Space tab. Select Tamriel.\r<br />\r<br />Next, select a place where you can see the horizon, water lod, distant mountains, and distant trees. Helgen exterior is a good location. Make note of the weather record under WordDate of the Object Window. \r<br />\r<br />[img]http://i.imgur.com/BsqJ9of.jpg[/img]\r<br />\r<br />Right click on the Render Window , select Render Window Properties, and under the LOD tab, enable landscape lod. Make sure Sky is enabled as well (this is one of the small icons at the top of the CK window).\r<br />\r<br />[img]http://i.imgur.com/7rmm8cI.jpg[/img]\r<br />\r<br />Okay, almost to the fun stuff. Writing this sucks. I hope someone finds this helpful. \r<br />\r<br />Open up the Skyrim SE launcher and select windowed mode. This will allow you to tab back and forth between the CK and Skyrim. The goal is to test any of our changes in game because it will look different than in the render window. Once you have booted up skyrim, go outside, open up the console by hitting &#34;~&#34; and type FCF. Hit enter. This will allow you to make saves in the CK while the game is running. Tab out of Skyrim and back to the CK. Click on a tree and then use the mouse wheel to move past it and get a good view. If you need to change angles, hold down the shift key while you move the mouse. If you want to recenter above the tree, hit the letter &#34;t&#34;. Once you have a good view, go back to the Object Window, find the ImageSpace record tree under Special Effects, and select ISSkyrimClearDay for this exercise. Play with saturation.\r<br />\r<br />[img]http://i.imgur.com/MCDRYwL.jpg[/img] \r<br />\r<br />Want to see how the changes look in game? His the save button. Tab back to Skyrim. Enter a building or cave. Open the console &#34;~&#34; and type\r<br />\r<br />hlp &#34;mod name&#34;\r<br />\r<br />\r<br />Include the parenthesis. You can find your mod name at the top of the CK window if you&#39;re unsure. Exit the interior and your changes should have taken effect. \r<br />\r<br />Open up the console again and type\r<br />\r<br />fw 81a\r<br />\r<br />in order to force SkyrimClear weather which uses the IISSkyrimClear image spaces.\r<br />\r<br />[img]http://i.imgur.com/iBsGYfM.jpg[/img]\r<br />\r<br />\r<br />\r<br />Next, note Sunlight Scale. Notice how the tree lods remain relatively dark, while the rest of the world becomes bright. A little less intense of a setting and the result is very beautiful. This is a powerful setting. Unfortunately, in Oldrim, bright ENB&#39;s were plagued with super bright tree lods because of how they applied lighting (NLVA included, as I tried to keep the lighting as close to NLA as possible). BUT NO. NO. NO. Make sure your tree lods and trees match in color and brightness for ALL weathers. I&#39;m hoping that you can see how important Sunlight Scale is.\r<br />\r<br />[img]http://i.imgur.com/d0YwVC0.jpg[/img] \r<br />\r<br />\r<br />The rest of the image space settings I&#39;ll leave you to tinker with. IMO SSE also uses too much tint, so be sure to experiment with that.\r<br />\r<br />Open up the Weather record tree under WorldData in the object window and find SkyrimClear 0000081a. \r<br />\r<br />Note the sky color for upper, lower, and horizon. \r<br />[img]http://i.imgur.com/1E4zR8j.jpg[/img]\r<br />\r<br />Note that lower sky color determines water lod color. \r<br />\r<br />[img]http://i.imgur.com/fdWbS6w.jpg[/img]\r<br />\r<br />Finally, let&#39;s look at cloud layer 28. This is the true horizon. Cloud layer 28 uses a cloud texture that you can change to your liking. In addition to setting the true horizon color, it also sets the color underneath the map in case a cell block of ocean doesn&#39;t load and you see through it. Pay attention to the horizons and water lod. Get you Lower Sky, Horizon, and Cloud Layer 28 colors right. They never have been done right before as far I know, and this is probably because there were only a few weather mods for Oldrim. Now you know&#33;\r<br />\r<br />[img]http://i.imgur.com/aDjhgDC.jpg[/img]\r<br />\r<br />[/font]Note the fog distance values: These are tricky AF to figure out so you&#39;re welcome.\r<br />The fog far color has been set to green. The near fog color is SSE vomit. Notice in the image on the right, the vomit fog has been pushed back. Thank Talos. Vomit tint, vomit fog... It all needs to go and now you know how. \r<br />\r<br />Fog distance determines when the fog starts. If you were to increase the fog far distance enough, you would see just the mountains with no fog, except for the vomit colored near fog in front of you of course.\r<br />\r<br />Fog power and Fog max are slightly confusing. Fog max is essentially the maximum thickness the fog can achieve, and fog power is how quickly the fog achieves that thickness. Imagine you wanted to create a wall of fog as solid as brick. You would need to set the max as high as possible and the power as high as possible. Fog distance would just move the wall forward and back in this case. \r<br />[img]http://i.imgur.com/HzvpXDP.jpg[/img]\r<br />\r<br />I hope the fog settings are clear because they are EXTREMELY important. These fog settings can be used to create the illusion of distance. They can make the mountains appear far off in the distance. They also help blend the sky, the horizon, and the distant terrain. They can be used to make magnificent sunsets and sunrises. They can also be used at night in order to make the mountains dark and fade into black as they should (set the fog color to black). It pains me to recall how many ENB&#39;s and weather mods had insanely bright mountains at night. I can&#39;t stress enough how important of a setting this is. \r<br />\r<br />Next: Sunset and Sunrise Clouds. Setting the alphas higher will make them opaque - lower will make them transparent. In my opinion, sunset clouds look best when kept slightly transparent to blend better with the atmosphere and slightly on the brighter side because they look flat and fake when too dark. \r<br />\r<br />[img]http://i.imgur.com/wzGgMjX.jpg[/img]\r<br />\r<br />Next: Sunlight Color is a powerful tool. This can create incredible immersion if done right. Some of my fondest memories of Skyrim were of feeling that warm, golden NLA sunrise.\r<br />\r<br />[img]http://i.imgur.com/xzuqijU.jpg[/img]\r<br />\r<br />Okay, the rest of the settings are pretty intuitive except for Cloud Lod Diffuse, Effect Lighting, and Directional Ambient Light Colors.\r<br />\r<br />[/size][list]\r<br />[*][size=3]I&#39;m pretty sure Water Multiplier and Trans Delta don&#39;t do anything, but I could be very, very wrong. [/size]\r<br />[*][size=3]Sun damage is how much damage Vampires take during that weather. [/size]\r<br />[*][size=3]Sun/star color is the color of the sun/star. [/size]\r<br />[*][size=3]Sky Statics determines the color of the distant mountain fogs[/size]\r<br />[*][size=3]Ambient lighting is the color of lighting that illuminates everything from all directions (if your shadows are too dark, you can try increasing this - not dark enough? consider decreasing this - just make sure you can at least clearly see your characters face in the shadow at 12 pm). [/size]\r<br />[*][size=3]Rain and snow can be added under precipitation. They are &#34;fixed&#34; camera effects, meaning that if you were to pause the game and move around, the rain and snow would move with you, instead of you moving through them. Particle Snows and ground fogs are done by using a mesh which emits &#34;particles&#34; that carry textures (ie. snowflake&#34;). They are difficult to create properly. A common problem of VW&#39;s particle snows is that when you run very fast, the emitter didn&#39;t have enough time to drop snow in front of you so it feels as if snow fall is only occuring directly on top of you, following you around. This can be mitigated by also attaching a &#34;fixed&#34; snow camera effect to create the illusion of consistent particle snowfall everywhere (ie. NLVA blizzard). The other problem with physical snow is that the trajectory speed slows down when moving, so if you are doing a lot of stopping and going, the illusion of true snowfall can break as you are rudely reminded of the limitations of Skyrim.[/size]\r<br />[*][size=3]Be sure to set the weather type - pleasant, extreme, etc - as these are the hook words that FrostFall looks for. [/size]\r<br />[*][size=3]Sounds? Look at true storms.[/size]\r<br />[/list][size=3]\r<br />So, what does Cloud Lod Diffuse do? Not sure, haven&#39;t tested it. Effect Lighting? Not sure, though I think this determines the illumination of particles, ie. waterfalls, physical snow, smoke, ground fogs. This setting was controlled by the ENB &#34;particles&#34; setting, so I never messed with it. \r<br />\r<br />Okay, so you&#39;ve spent 10 hours and made a perfect weather. 50-100 more to go. Open up tes5edit, right click on your weather you&#39;ve made, hit apply script, choose weather editor, and take a look. Hopefully this will help you organize all the settings in your head. You can copy your lighting, weather, and cloud values to a new record so you don&#39;t have to repeat all your work.\r<br />\r<br />Great, now you&#39;ve made all these awesome weathers, but you are so bummed to discover that in Winterhold, the region is set to have blizzard 100% of the time, and in Riften, the city is set to have OvercastRiftenFog 100% of the time. \r<br />\r<br />You can fix this in the CK, but I&#39;m a little tired of the CK by now and tes5edit is so neatly organized. Find your region record, in this case, WeatherTundra. Right click in the RDWT - Weather Types cell and click add. Find the null reference box it added, click on the weather cell, and add the weather of your choice. \r<br />\r<br />[img]http://i.imgur.com/r6SCGPN.jpg[/img]\r<br />[/size][size=3]\r<br />While we are here, we might as well patch your weather mod with whatever audio overhaul you are using, as they make edits to these records as well.\r<br />The key to understanding patching is understanding that the mod furthest on the right wins. If you want to see anything from the mods on the left in Skyrim, then you need to drag those things over. The example below demonstrates patch creation for AOS and a weather mod. \r<br />\r<br />[img]http://i.imgur.com/RjI8mtd.jpg[/img]\r<br />\r<br />This is also how you can combine weather mods, by adding the formIDs of the weathers to the region record so they both occur. If they share the same formIDs, you will need to copy that set of weathers in one mod into NEW records. Just right click on the selection and hit &#34;copy as new record into..&#34;. You&#39;ll get a new set of formIDs for which you can add to the region records. \r<br />\r<br />[/size]Change of topics - Perpetual summer days or winter nights to better reflect the northern nature of Skyrim (Loremongers go away. We know.).\r<br />\r<br />I haven&#39;t tried this before, but I suspect it can be done. You can change the sun position under the GameSettings record tree. Find the fSunX/Y/ZExtreme records and see what you can figure out. You&#39;ll want to change sunrise and sunset times. You can do so under the Climate record tree. Find the DefaultClimate and SkyrimClimate records and adjust to your liking. \r<br />\r<br />\r<br />So how about that Realtime Snow Cover? Just another illusion. This one requires ENB. The illusion exploits differences in directional lighting and image based lighting in order to photobleach all upward, and only upward, facing surfaces. I used the upper sky to create an artificial light source, and then I used mist and clouds to help hide it (I also used the letterbox effect to help keep the players&#39; eyes off of the upper sky). I tweaked ambient lighting to restore normal color tones to NPC skin and environment, and I used bloom to help smooth everything out. It took me forever to produce something I felt comfortable releasing, but with this information, and SnowFall weathers as a template, you can create your own.\r<br />\r<br />\r<br />[img]https://i.imgur.com/RcTupXt.jpg[/img]\r<br /> \r<br />[center]Goodluck. [/center]",
  "categoryId": "97",
  "version": "",
  "author": "Megaloblast",
  "createdUnix": "1479603166",
  "updatedUnix": "1479603166",
  "containsAdultContent": false,
  "uploadedBy": "Megaloblast",
  "primaryFile": null,
  "files": []
}