{
  "modId": 80348.0,
  "modName": "A Vanilla Female Player Custom Body",
  "summary": "A simple esp file that gives the Vanilla player character a custom body.",
  "descriptionHtml": "I&#39;m not sure if there is a mod like this yet and I&#39;ve been looking numerous sites and seem can&#39;t find anything like this, yet. So, here it goes. I&#39;ve done playing multiple times in Skyrim using custom races and I tend to get too many bugs after using them in a long play-trough, per say, playing multiple faction quests and playing in an uncapped level Skyrim. I do like using them, but sometimes I miss the fact that Npcs gives different reactions when you play the Vanilla player character. Then it got to me that with just using Bodyslide and some simple tinkering with the Creation kit you can actually use a custom body for your Vanilla female player character only.\r<br />\r<br />So, this simple esp file is actually a body suit for the player character, just like the Forsworn Briarheart or the Afflicted npcs. All you need to do is generate a body from Bodyslide and copy all the nif files into the folder that I use for this mod. I&#39;ve been using this file for almost a year now, and I have not yet gotten any weird bugs from it, yet. This file also includes the body for all other Vanilla races and the tails too, so you dont have to worry about having an Elf character with no body mesh at all. Hope this works for you too~",
  "categoryId": "29",
  "version": "",
  "author": "King Rooper",
  "createdUnix": "1479584347",
  "updatedUnix": "1479585312",
  "containsAdultContent": false,
  "uploadedBy": "MorganaLeFaye",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000228592",
      "name": "A Vanilla Female Player Custom Body",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "A Vanilla Female Player Custom Body-80348-.7z",
      "uploadedUnix": "1479585312",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f4c4eaa25e95dcb674ae194633f5d04cd1b50151a3aafadbf77cafd59f0a9398/analysis/1479585422/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Vanilla%20Female%20Player%20Custom%20Body-80348-.7z?fid=1000228592&ttl=1535868968&ri=8192&rs=8192&setec=f03aef313ca42a1a7b39634e42d9dd0e"
    }
  ]
}