{
  "modId": 8035.0,
  "modName": "THIRD PERSON CAMBAT CAMERA almost vanilla",
  "summary": "3rd person static combat camera, very close to non-combat vanilla",
  "descriptionHtml": "The 3rd person camera\\'s been bugging me from day 1, every time I pull out a spell, i feel like I\\'m back in Socom 2 again.  And all the other camera mods have the character jacked way off to the left, or the elevation is off or something. So, after playing around with the settings, I\\'ve gotten as close to vanilla as I could, its good enough for now. (for me anyway). Now a lot of people complain that the bow gets in the way of the reticle, or your noggin blocks your spells or whatnot. This is slightly true of the bow, but its not a huge issue, the arrow goes right above the upper needle of the reticle, so you can just use it like an ironsight, and spells go dead center. i don\\'t use a reticle, so i go 1st person to shoot anything really distant anyway, I just eyeball it otherwise. You can tweak it on your own if you want to make it more friendly for ranged combat.\r\n\r\n\r\nIf you want to undo these changes, simply go back to the INI file and delete the bit you added. And then of course draw you weapon in 3rd person again once you\\'re back in the game.\r\n\r\nIf you appreciated this, I also made a PROPER Third Person Horse Camera that you may like as well.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=10623",
  "categoryId": "24",
  "version": "1",
  "author": "mtgAzim",
  "createdUnix": "1328636846",
  "updatedUnix": "1328638806",
  "containsAdultContent": false,
  "uploadedBy": "mtgAzim",
  "primaryFile": null,
  "files": [
    {
      "fileId": "26667",
      "name": "cambat cam",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "cambat cam-8035-1.zip",
      "uploadedUnix": "1328638806",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/012d2d2352a6cd4a547af5d52e16aa2a027d1b7e705103f18398852fa30da1b2/analysis/1406658197/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/cambat%20cam-8035-1.zip?fid=26667&ttl=1535766443&ri=8192&rs=8192&setec=2b7301b3ad9bee7d375c62f8459743a3"
    }
  ]
}