{
  "modId": 80545.0,
  "modName": "Unbelievable Grass 3 - DELETED",
  "summary": "Enhanced Grass is a standalone version of the grass plugin from Enhanced Landscapes and the sucessor to the popular Unbelievable Grass Two mod. This mod overhauls all grasses of Skyrim with a lot of variety. It&#39;s also using a performance tweak for better performance, while providing high grass density.",
  "descriptionHtml": "[center][img]http://i.imgur.com/DF7rmxt.png[/img][/center]\r<br />[img]http://i.imgur.com/xLbWMf0.jpg[/img]\r<br />\r<br />[b]Unbelievable Grass 3[/b] is a [i][color=#ffd966]standalone version of the grass plugin from [url=http://www.nexusmods.com/skyrim/mods/68782/]Enhanced Landscapes[/url][/color][/i] and the sucessor to my [i]Unbelievable Grass Two[/i] mod.\r<br />\r<br />This version is build with the Grass on Steroids Performance Tweak and will provide high grass density with still enjoyable performance. This depends on the grass ini settings you will use. Read the performance part further down this page.\r<br />\r<br />This grass-plugin is using many different grasses from [url=http://www.nexusmods.com/skyrim/mods/42370/?]Unique Grasses[/url], [url=http://www.nexusmods.com/skyrim/mods/141/?]Skyrim Flora Overhaul[/url] and [url=http://www.nexusmods.com/skyrim/mods/55158/?]Hoddminir Grasses[/url]. It provides a high diversity of grasses with my own vision how grass should look in Skyrim. Remember this mod was created to my own preference and not everyone may like it.\r<br />\r<br />[img]http://i.imgur.com/QDrTQ3o.jpg[/img]\r<br />\r<br />Download manually or with NMM and install the mod with a Mod Manager of your choice.\r<br />\r<br />[size=4][u]Required Skyrim.ini Settings[/u][/size]\r<br />\r<br />Open your skyrim.ini and change under [Grass] this lines:\r<br />\r<br />[b][Grass]\r<br />\r<br />[/b]bAllowCreateGrass=1\r<br />bAllowLoadGrass=0\r<br />[b][color=#ffd966]iMaxGrassTypesPerTexure=10[/color] [/b]-&gt; this setting is very important&#33;\r<br />[b][color=#ffd966]iMinGrassSize=50[/color][/b] -&gt; set the number higher for less density (better performance) or lower for more density (worse performance).\r<br />\r<br />[img]http://i.imgur.com/YrjZaer.jpg[/img]\r<br />\r<br />[b]I want to clarify one thing:[/b] While this mods tries to be performance friendly, it doesn&#39;t mean that it will boost your FPS or increase your performance. It will absolutely affect your performance, especially on low iMinGrassSize settings. It will depend on your system, ENB and the settings you&#39;re using for this mod. Grass mods like this won&#39;t increase performance, they will always affect it a little bit. This mod uses the performance tweak and will provide better performance with higher grass density, but it won&#39;t increase it compared to vanilla grass density.\r<br />\r<br />You can change the iMinGrassSize setting up to 75 or 100. It will increase your performance immediately, but it will not look as intended. This mod is intended to look very dense and not spare. I recommend the setting &#34;50&#34;, but it&#39;s just a recommendation and can be changed to whatever you want.\r<br />\r<br />I&#39;d recommend to have a mid-range system for standard grass density of this mod and high-end systems for higher grass density. Keep in mind - if using such a grass mod you will have to have a good rig.\r<br />\r<br />[img]http://i.imgur.com/wTqsJEa.jpg[/img]\r<br />[size=2]\r<br />A special thanks goes to these awesome people (Josh Ezzell, elinen & vurt), which offer their grass textures & meshes as resources and allow the usage of them. Also ag thanks to vurt for the permission to use some of his grass meshes for this mod.\r<br />\r<br />[list]\r<br />[*][url=http://www.nexusmods.com/skyrim/users/934000/?]elinen[/url] for the [url=http://www.nexusmods.com/skyrim/mods/24735/?]hoddminir grass resource[/url]\r<br />[*]Bethesda for Skyrim and the Creation Kit\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/141/?]vurt for Skyrim Flora Overhaul[/url]\r<br />[*][url=http://www.nexusmods.com/skyrim/mods/42370/?]Josh Ezzell for Unique Grasses and Groundcovers[/url]\r<br />[/list][/size]\r<br />[center][img]http://i.imgur.com/n3r4Z8R.png[/img][/center]",
  "categoryId": "74",
  "version": "1.0",
  "author": "AceeQ",
  "createdUnix": "1480372673",
  "updatedUnix": "1480372673",
  "containsAdultContent": false,
  "uploadedBy": "AceeQ",
  "primaryFile": null,
  "files": []
}