{
  "modId": 80544.0,
  "modName": "Iron and Steel Armor Fixes - Open Source Templates",
  "summary": "Open source Blender 2.77 files containing mesh fixes and edits to the standard Steel, Iron (sleeveless), and Sleeves w/ Chainmail by defunkt. Also included is a bare-chested variant of the Steel armor.",
  "descriptionHtml": "Note: These are Blender 2.77 files, and aren&#39;t useable in-game until they are converted.\r<br />\r<br />A few things about the Steel and Iron armor sets bothered me. First, they had pouches on the waist, which is redundant if you use a pouch mod that adds carrying capacity and also gets in the way of waist belted quivers. The Iron Armor also has the fur wrap around the waist which makes the hips appear wider, which also gets in the way of pouch and belt quiver mods.\r<br />\r<br />The changes I&#39;ve made are covered in the pictures, but here&#39;s a quick rundown:\r<br />\r<br />Iron Armor\r<br />*The collar has been adjusted. It&#39;s smaller to make it compatible with more helmets and hoods; some more adjustments are needed.\r<br />*Fur elements around the waist have been reshaped to a slimmer profile.\r<br />*Removed pouch from rear belt.\r<br />*Minor clipping issues with the mesh have been fixed.\r<br />*Pant legs are adjusted to allow more boot compatibility.\r<br />*Iron Gauntlets and Farmer&#39;s Gloves are fixed to eliminate clipping with sleeves and chainmail.\r<br />\r<br />Steel Armor\r<br />*Removed the fur elements and pouch from the waist.\r<br />*Replaced the fur pants with the pants from the iron armor set. This breaks up the color and it has the same tweaks as mentioned above for better boot compatibility.\r<br />*Created a bare-chested variant.\r<br />\r<br />The Blender files contain all the edits I made, and the unedited armor set pieces. The armor is divided into multiple pieces so you can use it as a virtual paper doll to see different piece combinations.\r<br />\r<br />   CREDITS\r<br />\r<br />I used certain texture and mesh assets from some talented authors from the nexus while editing in Blender 2.77. These are mainly for illustrative purposes and should NOT be packed with any mods derived from these edits without specific permission from the original authors. The iron sleeves with chainmail mesh by defunkt and the Better Males feet mesh are both usable without permission so long as the original author is credited. Special thanks to:\r<br />\r<br />Feet meshes by FavoredSoul\r<br />aMidianBorn Iron Armor Vanilla Cut & Leather Armor textures by [b]CaBaL\r<br />Iron Armor Sleeves & Chainmail by defunkt\r<br />\r<br />I&#39;ll add more in case I missed anyone.[/b]",
  "categoryId": "29",
  "version": "",
  "author": "Maohur",
  "createdUnix": "1480368215",
  "updatedUnix": "1480368209",
  "containsAdultContent": false,
  "uploadedBy": "maohur",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000229414",
      "name": "Iron and Steel Armor Fixes",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5975",
      "fileName": "Iron and Steel Armor Fixes-80544-.zip",
      "uploadedUnix": "1480368209",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/d2622f7ddd66a247b810726dfe4e9dbced19bc299eb7345b1a7954e89b16b6bf/analysis/1480368246/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Iron%20and%20Steel%20Armor%20Fixes-80544-.zip?fid=1000229414&ttl=1535869182&ri=8192&rs=8192&setec=9d3b2b5b13f7e181985d50bf093901df"
    }
  ]
}