{
  "modId": 80642.0,
  "modName": "Talos Housecarl Armor Pack",
  "summary": "Adds 12 new items used by Talos&#39;s personal Housecarl during his rise to power.",
  "descriptionHtml": "Please upload any screenshots of the armors in game. I would love to see the great images you all can make and would like to use some of them on the mod pages :)\r<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/80642-1-1480764668.jpg[/img]\r<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/80642-0-1480763947.jpg[/img]\r<br />\r<br />At the end of the 2nd era, Talos or Tiber Septim as he would later be called, was forging his legend and securing his place in history . At only 20 years of age this great warrior had rapidly climbed to the position of General. But that was not enough for such an ambitious man. As the years passed he would eventually be crowned emperor of all Tamriel. Standing by his side from the very beginning, even before he was appointed General, were a handful of renowned and skilled Nord warriors, his personal Housecarl. These fearsome soldiers would help secure every victory credited to Talos. Leading his vanguard, even when the man himself was commanding the war efforts from the safety of the imperial capital.\r<br />With his Housecarl being a vital cog in the imperial war machine all of Tamriel was united under the dragon symbol.\r<br />As Talos ushered in the 3rd era, he commissioned some of the greatest smiths from across his new empire to forge sets of armor worthy of his loyal Housecarl.  The Housecarl would wear these new armor sets with pride. But with all Tamriel united and no more enemys to fight, the legendary Housecarl would slowly be forgotten and their great deeds lost to the pages history.\r<br />When you live under the shadow of a man like Talos, who ascended to Godhood, that is only expected.\r<br />\r<br />In current day skyrim, many Nords would disown the sacred imperial symbol of Akatosh embedded in the Housecarl&#39;s armor. But a true Nord and follower of Talos might wear it with pride. Not in support of the current weak empire, but instead wearing it to honor  the great empire that Talos forged (with the help of his fellow Nords). A reminder for those imperials they face of the Nord who created their empire and they now disown. Even if only briefly, before a hammer comes crashing down on their skull.\r<br />\r<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/80642-0-1480764668.jpg[/img]\r<br />ITEMS INCLUDED:\r<br />- Housecarl Cuirass\r<br />- Housecarl Boos\r<br />- Housecarl Gauntlets\r<br />- Housecarl Helmet\r<br />- Housecarl Stag Helmet\r<br />- Housecarl Bear Helmet\r<br />- Housecarl Shield\r<br />- Housecarl Cape\r<br />- Housecarl Bear Cape\r<br />- Housecarl Shield Cape\r<br />- Housecarl Hammer\r<br />- Housecarl Warhammer\r<br />\r<br />All items need to be crafted under the steel section and require the Advanced armors perk to access.\r<br />Stats of armor peices are based on Steel plate armor. Weapons are based on Glass.\r<br />All items excluding Capes can be upgraded.\r<br />All Races supported. Male and Female supported. 0 and 1 weights supported. Includes world objects.\r<br />\r<br />Permissions:\r<br />Assets from this mod can be used in large total conversion mods as long as a credit is giving somewhere.\r<br />If you want to use assets in a quest mod that is not a total conversion please make this mod a required download.\r<br />If you want to do a retexture of the armor please make this mod a required download as well.\r<br />Assets are not to be used in any armour packs or compilations or anything else not mentioned here.",
  "categoryId": "54",
  "version": "1.0",
  "author": "Maty743",
  "createdUnix": "1480764839",
  "updatedUnix": "1480764343",
  "containsAdultContent": false,
  "uploadedBy": "maty743",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000229858",
      "name": "Talos Housecarl Armor Pack",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59882",
      "fileName": "Talos Housecarl Armor Pack-80642-1-0.zip",
      "uploadedUnix": "1480764343",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2b100ff86d288c9ace0965ccd126ab0d592511006caee823f94c33af2b06b169/analysis/1480775319/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Talos%20Housecarl%20Armor%20Pack-80642-1-0.zip?fid=1000229858&ttl=1535869269&ri=8192&rs=8192&setec=080713615373e9d4106d9db2b1146bf5"
    }
  ]
}