{
  "modId": 80688.0,
  "modName": "OneHanded Ebony Blade Dawnguard Edition",
  "summary": "A simple aesthetic and performance change for the Ebony Blade, now a one-handed katana. REQUIRES DAWNGUARD.",
  "descriptionHtml": "&#34;The Ebony Blade, also known as the Vampire or the Leech, is a Daedric artifact created by the Daedric Prince Mephala. It resembles an ebony katana, and is considered to be an artifact of great evil, having the ability to absorb the life essence of those it strikes...&#34;\r<br />\r<br />This mod simply changes the Ebony Blade to a one-handed weapon and uses the model and textures for Harkon&#39;s sword as a replacement for the original. I thought the change was fitting considering the lore. I tend to play characters who use spells in one hand and a blade in the other so the default Ebony Blade was frustrating, especially considering it was 1H in Oblivion. Also, I don&#39;t particularly like the enchantment restriction present in Harkon&#39;s sword. I highly recommend using [url=http://www.nexusmods.com/skyrim/mods/52004/?]this retexture[/url] of Harkon&#39;s sword by Alana12 since the 1k version is what you see in my screenshots. The Dawnguard DLC is required to use this plugin.\r<br />\r<br />Please alert me of any bugs since I am not an experienced modder and I did this after reading about similar ventures on Reddit and the Nexus forums, so I expect there will be things I overlooked. Everything ran smoothly in my game but naturally others will have different setups and experiences.",
  "categoryId": "55",
  "version": "1.0",
  "author": "Miriam",
  "createdUnix": "1480949346",
  "updatedUnix": "1480949337",
  "containsAdultContent": false,
  "uploadedBy": "evgirunslaad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000230119",
      "name": "Ebony Blade 1H Dawnguard",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "145",
      "fileName": "Ebony Blade 1H Dawnguard-80688-.zip",
      "uploadedUnix": "1480949337",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/4ac0bf2a384cfbf9c0c9502b74d1e2cccd977b237fa905fc4d9d8b35b6aad171/analysis/1480949343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ebony%20Blade%201H%20Dawnguard-80688-.zip?fid=1000230119&ttl=1535869323&ri=8192&rs=8192&setec=1c6a66908bcd5de8fb97cbb67522121d"
    }
  ]
}