{
  "modId": 8068.0,
  "modName": "Dalls_Cooking_Spit_n_Real_Fire",
  "summary": "Cooking_Spit_n_Real_Fire is custom re-texturing (n not some simple - in part - recolor) mod which changes how Cooking Spit (food crafting) n in-game Fires look.*",
  "descriptionHtml": "---README---\r\n\r\nfor DALLs - Cooking_Spit_n_Real_Fire \r\n\r\nv1.0\r\n\r\n07/02/2012\r\n\r\nCooking_Spit_n_Real_Fire is custom re-texturing (n not some simple - in part - recolor) mod which changes how Cooking Spit (food crafting) n in-game Fires look.*\r\n\r\n* Word of warning - my work actually do changes how these items look - rather then \\\"polishes\\\" same / boring game \\\"apple\\\" a bit further as many other popular mods do - so it might not be fit for casual modders or more-of-same seekers.\r\n\r\nWhy my game textures look as they do: All textures I make are closer to original game Art / Game Art concept (short of some minor technical n aesthetic changes) then are those you have in your game. How is that possible? If you know process of texture (game Art) making that will be obvious but if you don\\'t it will suffice to say that this process (like any other) has various stages which serve different purposes. Brilliantly done - Original Art in game is \\\"covered\\\" in \\\"immersion\\\" grime n dirt probably out of necessity - as quite lot users / potential game buyers insist on low-key (dark) games - which they (users) find as more interesting / much more \\\"realistic\\\" (immersive). So if you want to \\\"see\\\", what you think is there you better avoid my re-texture mods - on other hand if you want to see what original Artists and I have (really) done there - go for them. ;)\r\n\r\nNowadays food making and cooking are very big thing - so it is not surprise to find it in Skyrim as craft (one of PC skills) as well. Skills like this one and ability to make something useful (in-game) should be every RPG-er\\'s dream but unfortunately for that genre - brave and adventurous RPG players - ones which were ready to try new / out-of-box things - obviously are thing of past - if (mod) popularity scores are to be believed. Regardless of that - to me - sad fact, this mod is still made primarily for them, but all others who care at least in a bit how their (in-game) food preparation / craft spit-\\\"bench/s\\\" n all (open) fires look will - visually - benefit as well.\r\n\r\nAs one of important component\\'s of this mod is (animated) Fire which works better then any other (presently available) I have had chance to try and as I don\\'t have time or will ;) to make my own presentation video for it or for cooking-craft actions / secret recipes - if anyone of you does it n post it (somewhere safe) - I\\'ll post link here with full credits given. Number of potential participants / links (or ingredients used) is not limited / more-the-merrier! ;)\r\n\r\nTo install you need to navigate to your Steam/SteamApps/common/skyrim - game folder and paste / drag n drop in it my Data (mod) folder. Allow overwrite!    \r\n\r\nIf you don\\'t like this new look, simply delete / remove my (check for names my mod) texture files from Data/textures/clutter/woodfires n architecture/whiterun - and original look will be restored to your game.\r\n\r\nBugs/conflicts: none known - but other mods which do change same files will be overwritten / will overwrite my files - so take care not to overwrite your choice - by accident!\r\n  \r\nUse:\r\nFree to use but if any files included (therein) are to be used for modding ask me for permission!\r\n\r\nEnjoy and try to remember - if you like it even in a part - to give endorsement! \r\n\r\nThanks to Bethesda for really great game.\r\n\r\n",
  "categoryId": "68",
  "version": "1.0",
  "author": "Dall",
  "createdUnix": "1328648378",
  "updatedUnix": "1328648738",
  "containsAdultContent": false,
  "uploadedBy": "Dall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "26726",
      "name": "Dalls_Cooking_Spit_n_Real_Fire",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12964",
      "fileName": "Dalls_Cooking_Spit_n_Real_Fire-8068.7z",
      "uploadedUnix": "1328648738",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/fd185f805a9d385dda3e7b6f7b51956aba918bb0ab32a5d3dc434ad729c3fba2/analysis/1406658610/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dalls_Cooking_Spit_n_Real_Fire-8068.7z?fid=26726&ttl=1535766494&ri=8192&rs=8192&setec=963167ac63c03aa81bd7a8f36ab843c2"
    }
  ]
}