{
  "modId": 80767.0,
  "modName": "Westworld Main Menu Music Replacer",
  "summary": "If you&#39;re a fan of the HBO series &#34;Westworld&#34; then you&#39;ll enjoy this mod which replaces the music played in the main menu.",
  "descriptionHtml": "[center][/center][left]If you&#39;re a fan of the new HBO show &#34;Westworld&#34; like me, then you will probably enjoy this simple music replacer for the main menu.\r<br />[/left]The main file is titled &#34;Sweetwater&#34; and it&#39;s the theme that plays in the background throughout most of the series, primarily when the focus is shifted to the town itself and periodically in other random parts of the show during various situations. \r<br />\r<br />This is not the music that one would hear during the opening credit sequence as I felt that the track I picked seemed to fit better with being a replacer for the main menu music.\r<br />\r<br />[i]One last thing I forgot to include in the &#34;Read Me Please&#34; text file - The track &#34;Violent Delights&#34; was another favorite of mine and I almost chose this track to replace the main menu music. Just a thought&#33;[/i] \r<br />\r<br />[b][u][color=#ff0000]BONUS&#33;&#33;&#33;[/color][/u][/b]\r<br />\r<br />I&#39;ve also converted and included the ENTIRE album from Season 1 of the show. \r<br />\r<br />In the optional files section, you&#39;ll find  &#34;Westworld - Music from Season 1&#34; archive. \r<br />\r<br />All you need to do is find a song you want as your main menu music and rename it to &#34;mus_maintheme&#34; without the quotes.\r<br />\r<br />Also make sure the extension is left as .xwm\r<br />\r<br />Simply drag the renamed file of your choosing into my mods folder and overwrite the old track with the new one. \r<br />\r<br />Below is the complete tracklist. I listed all the covers of various artists as best as I could with the knowledge I have in being a fan of the music in the first place. \r<br />\r<br />I was quite surprised that there wasn&#39;t much talk on the &#34;player-piano&#34; covers throughout the season and ever since watching the first episode when &#34;Black Hold Sun&#34; was played I knew I was on to something. \r<br />\r<br />Also, I&#39;m surprised that the cover of Johnny Cash - “Ain’t No Grave (Gonna Hold This Body Down)” wasn&#39;t included on the soundtrack? Maybe because of copyright issues or simply because it was only meant for the show itself. It was also played during episode one.\r<br />\r<br />[b][u][color=#00ff00]Tracklist:[/color][/u][/b]\r<br />\r<br />[color=#00ff00]1.    Main Title Theme – Westworld\r<br />2.    Sweetwater\r<br />3.    Black Hole Sun - Soundgarden Cover\r<br />4.    Paint it Black - The Rolling Stones\r<br />5.    This World\r<br />6.    Online\r<br />7.    No Surprises - Radiohead Cover\r<br />8.    Dr. Ford\r<br />9.    A Forest - The Cure Cover\r<br />10.   Reveries\r<br />11.   Nitro Heist\r<br />12.   Motion Picture Soundtrack - Radiohead Cover\r<br />13.   Freeze All Motor Functions\r<br />14.   Pariah\r<br />15.   Fake Plastic Trees - Radiohead Cover\r<br />16.   MIB\r<br />17.   The Maze\r<br />18.   House of the Rising Sun - The Animals (Also covered by The Rolling Stones)\r<br />19.   Trompe L’Oeil\r<br />20.   What Does This Mean\r<br />21.   Something I Can Never Have - Nine Inch Nails\r<br />22.   White Hats\r<br />23.   Back to Black - Amy Whinehouse Cover\r<br />24.   No One’s Controlling Me\r<br />25.   Memories\r<br />26.   No Surprises (Stride Piano) - Radiohead Cover\r<br />27.   Violent Delights\r<br />28.   Someday\r<br />29.   Sweetwater Stride\r<br />30.   Do They Dream\r<br />31.   The Stray\r<br />32.   Bicameral Mind\r<br />33.   Exit Music (For a Film) - Radiohead Cover\r<br />34.   Reverie[/color]\r<br />\r<br />[center][i][color=#ff0000]All Credit for the music goes to the artists who originally created the songs that were covered for the show and by the amazing composer Ramin Djawadi&#33;[/color][/i] [/center]\r<br />\r<br />He also scores HBO&#39;s Game Of Thrones and most recently scored the soundtrack to &#34;Gears Of War 4&#34; (Sadly I haven&#39;t listed to the Gears Of War 4 soundtrack yet and I also don&#39;t own an Xbox. I did always enjoy the music they used for each of the game trailers for the previous entries in the series.)\r<br />\r<br />[b][u]PLEASE DO NOT REUPLOAD THIS TO ANY OTHER SITE&#33; PLEASE DON&#39;T CONVERT TO ANY STANDARD AUDIO FORMAT AND REUPLOAD TO ANY SITE&#33;[/u][/b]\r<br />\r<br />XWM FORMAT, TO MY KNOWLEDGE ISN&#39;T USED FOR COMMERCIAL MUSIC RELEASES AND I HAVE ONLY EVER SEEN IT USED IN BETHESDA GAMES.\r<br />\r<br />IT COULD VERY WELL BE USED IN OTHER VIDEO GAMES BUT SINCE I HAVE NEVER MODDED ANY OTHER GAMES BESIDES SKYRIM AND FALLOUT 4 I HONESTLY DON&#39;T KNOW.\r<br />\r<br />IF YOU NEED A .XWM CONVERTER/PLAYER YOU CAN FIND ONE HERE ON THE NEXUS VERY EASILY. JUST SEARCH FOR ONE IN THE UTILITIES, AUDIO OR MODDERS RESOURCES CATAGORIES. \r<br />\r<br />IF YOU&#39;D LIKE TO LISTEN TO THE SOUNDTRACK WITHOUT HAVING TO DOWNLOAD AN XWM PLAYER YOU CAN LISTEN TO THE WHOLE ALBUM ON SPOTIFY FOR FREE. \r<br />\r<br />[b][u]I PERSONALLY PURCHASED THIS ALBUM MYSELF AND CONVERTED IT TO THE .XWM FORMAT TO BE USED AS THE MUSIC FOR THE MAIN MENU.[/u][/b] \r<br />\r<br />I WOULD LOVE TO GO THROUGH MORE OF THE GAMES AUDIO SOUNDTRACK AND MERGED THIS SOUNDTRACK WITH SKYRIM&#39;S AND I ALREADY HAVE IDEAS AS TO WHERE SOME OF THE TRACKS WOULD FIT NICELY. BUT SEEING HOW BETHESDA ISN&#39;T KNOWN FOR DOING SCRIPTED CUTSCENES IN THE TYPICAL &#34;AAA GAME&#34; FASHION LIKE OTHER DEVELOPERS, IT MIGHT NOT PLAY OUT THE WAY I WOULD HOPE IT WOULD.\r<br />\r<br />",
  "categoryId": "61",
  "version": "1.0",
  "author": "xXReDxSparoweXx",
  "createdUnix": "1481282129",
  "updatedUnix": "1481282129",
  "containsAdultContent": false,
  "uploadedBy": "xXReDxSparoweXx",
  "primaryFile": null,
  "files": []
}