{
  "modId": 80825.0,
  "modName": "The Skyrim Patch Collection",
  "summary": "TSPC is a collection of patches meant to fix incompatibilities between two or more mods. I plan to add support for popular mods that do not have patches for them in order to work correctly and not override or otherwise conflict with each other.",
  "descriptionHtml": "[center][color=#8e7cc3][b][size=5]The Skyrim Patch Collection\r<br />[color=#b4a7d6][size=3]A collection of patches to fix mod incompatibilities&#33;[/size][/color][/size]\r<br />[i][size=5][size=3][size=2]TSPC v1.0[/size][/size][/size][/i][/b][/color]\r<br />\r<br />[color=#8e7cc3][b][color=#ff0000][size=5]LOAD MY PATCHES AT THE [u]END[/u] OF YOUR LOAD ORDER, [u]NO EXCEPTIONS[/u]&#33;[/size]\r<br />[size=3][u]AFTER[/u] any Merged/Bashed patches UNLESS you re-create said patches with my patches present.\r<br />As well as [u]AFTER[/u] any other patches.\r<br />\r<br />[size=2]Please DO NOT listen to ANYONE else regarding the load order for MY patches. There is a TON of misunderstanding and misinformation being spread by those who do not understand how patches, in general, work. ALL my patches contain ONLY necessary edits to make two or more conflicting mods work together, any other incompatibilities needs to be addressed with ADDITIONAL patches as records OVERRIDE each other.[/size][/size][/color][/b][/color][/center]\r<br />[b][size=4][color=#8e7cc3]Description[/color][/size][/b]\r<br />\r<br />[color=#b4a7d6][size=2]Greetings Dovahkiin&#33; Are you tired of downloading and installing multiple mods and then realizing (or not) that certain functionality has stopped working? Are you unable to forward the changes yourself using the tools available to you, or simply lack the time/motivation needed to do so? Do you simply want a one-stop fix to get all your lovely mods to work nicely together the way they were meant to as envisioned by their respective modders? If you have answered &#34;YES&#33;&#34; to any of the above then The Skyrim Patch Collection has quite the surprise in store for you&#33;[/size][/color][color=#b4a7d6] If not, well, get it anyway as I can promise you it will enrich your Skyrim experience (in conjunction with the required mods for the patches to operate of course).\r<br />\r<br />As I find more incompatibilities with the more popular mods I will be releasing patches for them, and of course taking feedback from Nexus users on what they would like patched. So be sure to track this mod to be informed automatically when I do release new patches and updates&#33;\r<br />\r<br />[color=#ff0000][b]Cleaning Notes:[/b] DO NOT clean or edit any of the patches in ANY form. They contain NECESSARY records for them to operate and are FULLY clean. Any changes may break their operation and not produce the desired results. Similarly, if merging one or more of the patch plugins with other plugins, take care NOT to change or renumber the Form ID&#39;s as it can cause unwanted results. When in doubt; please ask.[/color]\r<br />\r<br />--\r<br />\r<br />[color=#8e7cc3][size=4][b]Requirements[/b][/size][/color]\r<br />\r<br />As this mod is based off of making changes to the original mod, you will of course need to have said mod installed before installing one of my patches.[/color][color=#b4a7d6]\r<br />\r<br />[b]Please note:[/b] If you do not have the mods required with their respective plugins, your game will CTD at the main menu. All original files are required.\r<br />\r<br />--\r<br />\r<br />[color=#8e7cc3][size=4][b]List Of Patches[/b][/size][/color][/color][size=3]\r<br />[/size]\r<br />[color=#b4a7d6][color=#b4a7d6][color=#b4a7d6][size=3][b][size=2]Please view the [url=http://www.nexusmods.com/fallout3/ajax/modchangelog/?id=21671&randomcode=423076&gid=120]change log[/url] to view the list of patches as well as additional information.[/size][/b][/size]\r<br />[/color][/color][/color][color=#b4a7d6]\r<br />--[/color]\r<br />\r<br />[color=#8e7cc3][size=4][b]Installation[/b][/size][/color]\r<br />\r<br />[color=#b4a7d6]I thoroughly recommend using [url=http://www.nexusmods.com/skyrim/mods/1334]Mod Organizer[/url] to help installing mods and managing your load order.\r<br />\r<br />[b]This mod is now fully installer friendly and has an easy-to-use interface for installing one or more patches if you use MO or NMM&#33;[/b]\r<br />\r<br />[b]For those of you who still prefer a manual approach the instructions are as follows:[/b]\r<br />\r<br />[color=#8e7cc3][b]Step 1)[/b][/color] Download the latest version of The Skyrim Patch Collection and extract the archive contents somewhere. Browse to the [i]Patches[/i] folder, and therein should be several additional folders with the names of mods that have patches available for them. Open each folder for the patches that you require and copy the contents of the [i]Data[/i] folder into the [i]Data[/i] folder in your root directory of Skyrim, overwriting any files if asked. Ensure you don&#39;t place the [i]Data[/i] folder inside the [i]Data[/i] folder of your Skyrim directory.\r<br />\r<br />[color=#8e7cc3][b]Step 2)[/b][/color] Make sure that any of my patches that you downloaded are enabled in your mod manager of choice, and that they are loaded at the END of your load order for changes to take affect. If changes are still not taking affect, either the mod was installed incorrectly, or there is another mod that is overwriting the changes. Please let me know either way and I will do my best to try and help you out.\r<br />\r<br />[b][i]MO users simply install the archive as a new mod as per normal and enable the mod, ensuring no other mods are overwriting any of my files.[/i][/b]\r<br />\r<br />--\r<br />\r<br />[b][color=#8e7cc3][size=4]Uninstallation[/size][/color][/b]\r<br />\r<br />To uninstall this mod, browse to your Data folder in your Skyrim root directory and remove any (TSPC) prefixed .esp&#39;s.[/color][color=#b4a7d6]\r<br />[i][b]\r<br />MO users simply disable and/or remove the mod as per normal.[/b][/i]\r<br />\r<br />--\r<br />\r<br />[b][color=#8e7cc3][size=4]Incompatibility[/size][/color][/b]\r<br />\r<br />This mod can possibly conflict with any mod that tries to alter, in any way, the same records that were modified by the mod that is receiving a patch by me. This won&#39;t cause any CTD&#39;s or anything, but may have undesirable affects such as the original mod not doing as it was intended due to being overridden by an incompatible mod of yours. So ensure my patches are loaded at the [u]END[/u] of your load order, [u]AFTER[/u] your Merged and Bashed patches&#33;\r<br />\r<br />If you find a mod that is causing an incompatibility between the core mods being patched by me then please let me know and I can make an additional patch as necessary. Else if said mod does not change (or supposed to be changing) the stuff it is affecting; simply load that mod before the core mods being patched and my patch.\r<br />\r<br />--\r<br />\r<br />[color=#b4a7d6][b][color=#8e7cc3][size=4]TWPC For Fallout 3[/size][/color][/b][/color]\r<br />\r<br />[center][url=http://www.nexusmods.com/fallout3/mods/21671][img]http://imgur.com/19Y2I8w.jpg[/img][/url][/center]\r<br />If you happen to be out in the Wastelands, be sure to check out my other [url=http://www.nexusmods.com/fallout3/mods/21671]patch collection[/url] on the Fallout 3 nexus&#33;\r<br />\r<br />[color=#b4a7d6]--[/color][/color]\r<br />\r<br />[color=#8e7cc3][b][size=4]Credits & Acknowledgement[/size][/b][/color]\r<br />\r<br />[color=#b4a7d6][list]\r<br />[*][url=http://www.nexusmods.com/skyrim/users/5919987]jayr848[/url] - the creator of the Extra Guards mod which my EG patches are based on.\r<br />[*][url=http://www.nexusmods.com/skyrim/users/4291352]kryptopyr[/url] - the creator of the Complete Crafting Overhaul Remade mod which my CCOR patches are based on.\r<br />[*][url=http://www.nexusmods.com/skyrim/users/2463779]terickson227[/url] - the creator of the Hold Guards Keep Armor mod which my HGKA patches are based on.\r<br />[*][url=http://www.nexusmods.com/skyrim/users/4817563]AKcelsior[/url] - the creator of the Guard Torch Remover - Reduced Light Flickering mod which my GTR patches are based on.\r<br />[*][url=http://www.nexusmods.com/skyrim/users/3900618]matortheeternal[/url] - for all his patience with me, answering questions, troubleshooting, as well as sharing knowledge to be self-proficient within xEdit.\r<br />[*][url=http://bethsoft.com]Bethesda Softworks[/url] - for making several engaging and captivating RPG&#39;s to date and bringing players closer as a community through modding&#33;\r<br />[*][url=http://www.nexusmods.com]Nexus Mods[/url] - of which this community wouldn&#39;t exist so well organized and staffed not to mention the plethora of mods hosted&#33;\r<br />[*][url=http://www.nexusmods.com/games/users/userarea/]You[/url] - for taking the time to read through this and/or trying out my mod and that of others thus ensuring the community lives on&#33;\r<br />[/list][/color]\r<br />[center][b][color=#8e7cc3]Additional credit and acknowledgement goes out to any and all persons who made the above mods, who without the patches I have made would not be possible. I am relying on those I have credited to have done the same on their own respective mod pages but mistakes and oversights do unfortunately happen. So to all you lovely people who made all the above mods possible, and to anyone I may have missed and not mentioned, THANK YOU&#33; Your work is deeply appreciated and I hope that in patching your efforts to work alongside other great mods I am doing you proud and allowing your mod to live on to withstand the test of time that is this modding community&#33;[/color][/b][/center]",
  "categoryId": "84",
  "version": "1.0",
  "author": "Deadmano",
  "createdUnix": "1481561257",
  "updatedUnix": "1481561257",
  "containsAdultContent": false,
  "uploadedBy": "Deadmano",
  "primaryFile": null,
  "files": []
}