{
  "modId": 80862.0,
  "modName": "Angi Follower - Essential Levelled",
  "summary": "Angi is one of the coolest characters in game. Too bad she can&#39;t be married or made a follower, because her voice type has no assets for it. With this mod, she can.",
  "descriptionHtml": "This little mod lets the player recruit Angi and marry her. It also gives her new hair and skin tone (or not, vanilla version optional), makes her essential and lets her level up when the player does.\r<br />Since she is now using a FemaleCommander voice, it&#39;s [b][color=#ff7700]best to activate this mod after having completed the entirety of her training quest[/color][/b] or you will experience broken dialogue.\r<br />\r<br />[youtube]zITykb3YKCs[/youtube]\r<br />\r<br />She sandboxes in spare time and will comment on most dangers / curiosities. Her maximum level is 99.\r<br />\r<br />I&#39;d apreciate feedback as this is my first mod ever. I should have done this one like, 5 years ago. Thanks to Bethesda for TES. Plx Valenwood kthx.\r<br />[color=#ff7700]\r<br />[b]Installation[/b]:[/color]\r<br />Extract the .zip into your Skyrim/Data folder. Enable the mod in the game launcher / mod manager AFTER having completed her quest (it is complete when you get her bow).\r<br />\r<br />[color=#666666]IMjoll uses the same voice type and the same actor, FemaleNord. Just like about 250 other women across Skyrim including generic Stormcloak and Imperial troops  :D Thing about FemaleNord voice though, it&#39;s lacking hundreds of lines of situational dialogue. I considered manually cloning individual lines but there&#39;s too much content simply missing - Bethesda only gave unique situational dialogue to some characters and some voicetypes (hey, there&#39;s a cave&#33; I hate Draugrs. Die, dragon&#33;) so if I use Nord voice, It will make the follower less &#34;alive&#34;. Sadly, only FemaleCommander and a couple other voicetypes by default react to a wide variety of locations and situations, so I went along with FemaleCommander (changes Angi&#39;s voice to the same voice actor who voices Uthgerd the Unbroken). It&#39;s a very tiny simple mod at this point, so if I ever get fired from my job and have a week, or six, I will go through the 1000s of uncompressed FemaleNord dialogues and see what can be done about Angi&#39;s original voice.\r<br />I&#39;m trying to experiment with SetOverrideVoiceType to switch her voice type after her quest is done, that would allow transition from her Nord voicetype to the new one. Since I&#39;m a total noob at scripting (do you even fragment bro), I don&#39;t promise anything. All suggestions are welcome. Have a good one&#33;[/color]",
  "categoryId": "66",
  "version": "0.1",
  "author": "BlueskiN1980",
  "createdUnix": "1481753760",
  "updatedUnix": "1481763021",
  "containsAdultContent": false,
  "uploadedBy": "blueskin1980",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000230911",
      "name": "Angi Follower - Essential Levelled",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Angi Follower - Essential Levelled-80862-0-1.zip",
      "uploadedUnix": "1481753752",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3f9f3d2f0c8d7fd39fd4eed93f4afa38c59fd956659b16eafa485fe32c371af2/analysis/1481753762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Angi%20Follower%20-%20Essential%20Levelled-80862-0-1.zip?fid=1000230911&ttl=1535869487&ri=8192&rs=8192&setec=a40238939c77fdbede16a3022d9b43c3"
    },
    {
      "fileId": "1000230920",
      "name": "Angi Follower - Essential Levelled with vanilla face",
      "version": "0.1b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Angi Follower - Essential Levelled with vanilla face-80862-0-1b.zip",
      "uploadedUnix": "1481763021",
      "modVersion": "0.1b",
      "virusScanUrl": "https://www.virustotal.com/file/af8d83cf006ca3e9a66a26a3686a664e2c910c5dbed8f921423e5ed06df43544/analysis/1481763062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Angi%20Follower%20-%20Essential%20Levelled%20with%20vanilla%20face-80862-0-1b.zip?fid=1000230920&ttl=1535869487&ri=8192&rs=8192&setec=cad07969e2c58def6a16443962f3ae0e"
    }
  ]
}