{
  "modId": 80972.0,
  "modName": "Werewolf Village Reboot (SUPPORT ENDED DO NOT DOWNLOAD)",
  "summary": "Adds a village near Dawnstar, a character called Edward, Edward&#39;s house near the Abandoned Shack, books and more will be coming up&#33; \r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------",
  "descriptionHtml": "NO LONGER SUPPORTED&#33; DO NOT DOWNLOAD THIS FILE&#33; GO TO THIS INSTEAD: http://steamcommunity.com/sharedfiles/filedetails/?id=821697418\r<br />\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />Welcome to my mod. This is a mod which tries to bring back some roleplay into Skyrim. I highly recommend you try it. Please understand that this mod is a small mod, it has many features that are yet to be added.\r<br />\r<br />The mod adds a little village in Dawnstar, just look on the map. \r<br />Development status: Incomplete, progress is haulted for now. \r<br />\r<br />The mod adds an NPC (character) called Edward, he can be found in his own house located near the Abandoned Shack. \r<br />Development status: Incomplete, work in progress. He is done, but the dialogue is constantly getting updated and patched. \r<br />\r<br />The mod adds a few books and items (vanilla items), which can be found in the village I added in Dawnstar. The Underforge in Whiterun, underneath the Skyforge has another book in there. \r<br />Development status: Completed, more books will be added soon. \r<br />\r<br />Will I add any knew weapons and armor? Yes, but I can&#39;t make my own textures for them. So I will be using vanilla assets to create my weapons and armor. Development status: Planning stage, not in development yet. \r<br />\r<br />Will there be any quests and new characters? Yes, so far I have only got the long awaited Edward into the game. I haven&#39;t planned or started planning the quests, because the development of this mod is far too early for the quests. \r<br />How many quests will be added? It depends on how people engage with my mod. I will be opening a discussion for players to give feedback and thoughts on my mod. \r<br />\r<br />Is there a team working on this mod? No, it&#39;s just me. I have no one who tests my mod, because I like to get updates out as fast and smoothly as possible. So I develop and test my mod myself.",
  "categoryId": "30",
  "version": "1.3.8",
  "author": "WolfGum also known as LynxGaming1507",
  "createdUnix": "1482185550",
  "updatedUnix": "1482185550",
  "containsAdultContent": false,
  "uploadedBy": "LynxGaming1507",
  "primaryFile": null,
  "files": []
}