{
  "modId": 81003.0,
  "modName": "HIGHLANDCOW",
  "summary": "Higland Cow texture overhauls",
  "descriptionHtml": "[size=3][img]https://staticdelivery.nexusmods.com/mods/110/images/81003-3-1482304314.gif[/img]\r<br />\r<br />\r<br />This is a Highland Cow texture overhaul. I started to work with vanilla files. Meshes haven&#39;t been touched and they are not in the packages, this mod is just textures and doesn&#39;t take any slot in your load order.\r<br />\r<br />The vanilla files edited were found inside:\r<br />[size=2]textures&#92;actors&#92;highlandcow (5 file)\r<br />meshes&#92;actors&#92;cow&#92;character assets (1 file)[/size]\r<br />\r<br />Cows are peaceful, vegetarian and they give anything to us.  Before start, as always, I searched the web to look for some photos as reference, I noticed that these Highland cows are funny, even more a newborn one. Too cute.\r<br />\r<br />[img]https://staticdelivery.nexusmods.com/mods/110/images/81003-0-1482388325.gif[/img]\r<br />[/size]\r<br />[size=3]About these textures, the first thing I noticed was that the texture was as small as 512 size. Do not seem that Bethesda authors put much effort on them. Of course these cows are not essential actors, just an ornament, although they appear often in the game. This texture was not that simple, another puzzle, it had and obvious seam along the body looking not too far, an overlapped mesh to the usual attached fur and a complicate alpha channel to simulate the fringe. I recreated them all, every layer at 4k. [size=3][size=3][size=3][size=3]To understand why I call these puzzle, just see this [url=https://staticdelivery.nexusmods.com/mods/110/images/81003-13-1482384420.jpg]UV polygonal map[/url] of the cow mesh to make an idea. [/size][/size][/size][/size]\r<br />I decided to edited the overlapping meshes and so I had to include the model file in the package as well. Indeed, I just wanted to make the fringes shaded, but not hidden, because they created a very fake and sharp overlap upon the base mesh. After a dozen tries within numbers I discovered that the settings wouldn&#39;t give me the wanted effect, it just went from visible to barely visible, to invisible by changing a single decimal. So I picked the barely visible [size=3]one.[/size][/size][size=3][size=3]Then I[/size] created a whole new diffuse alpha channel to adapt my fur with the fringes. Too patch the seam along the body I removed temporary the overlapped mesh and once done I did put it back.\r<br />\r<br />Do notice, the tail texture is taken from the body, so it cannot be cut or fringed, my bad. I really don&#39;t know why they did not add it separately on this texture, like in horses for example. Due to this, the tail was and still completely unreal, [size=3]sort of snake,[/size] and for all I know, there is nothing that can be done. Maybe, the authors had to use an additional fringe mesh right on its place at least, but they did not. The tail seams can&#39;t be avoided[/size][size=3][size=3] as well, for[/size] the above reason, because this would create strange fur lines along the body from where it take the texture. Maybe I had to solve it for first and then put the rest of the fur trying to merge with the rest.\r<br />\r<br />Once done the main cow, make the branded one was easy.\r<br />\r<br />[size=3]Looking to the original vanilla size I didn&#39;t feel to release a full 4k package because I wouldn&#39;t suggest it at all. I released a 2k, [/size][/size][size=3][size=3]gradually going down till the vanilla size (512). I guessed no one will stare at a cow inside the game as for the other creatures, to allow it to consume resources, even more that these cows are always around and, worse, in open big cells. Not less because also [size=3][size=3]the diffuse map[/size][/size] need a DTX5 compression due to its detailed alpha channel.[/size]\r<br />\r<br />\r<br />Have fun,\r<br />\r<br />Kaj \r<br />[/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=3][size=3][b]DOWNLOAD:[/b][/size][u][size=3]\r<br />\r<br />[/size][/u][size=3]This mod comes in different packages with a fomod installer :\r<br />\r<br />[/size][list]\r<br />[size=3][*][size=3][size=3][size=3]2K compressed diffuse and normal maps[/size][/size][/size]\r<br />[*][size=3][size=3][size=3]2k compressed and 1k compressed normal maps[/size][/size][/size]\r<br />\r<br />[/size][*][size=3][size=3]1K compressed diffuse normal maps.[/size][/size]\r<br />[*][size=3][size=3]512 compressed diffuse and normal maps. [/size][/size][size=3][size=3][size=3][size=3][size=3](Vanilla size)[/size][/size][/size][/size][/size]\r<br />[/list][u]\r<br />\r<br />\r<br />[/u][size=3][b]INSTALL and UNINSTALL:[/b][/size][u][size=3]\r<br />\r<br />[/size][/u][/size][size=3][size=3][size=3]As usual, they are 7zipped fomod installers.[/size][/size][u][size=3]\r<br />\r<br />\r<br />[/size][/u][size=3][b]COMPATIBILITY:[/b]\r<br />\r<br />They could not work as intended if you installed some different meshes then vanilla one.\r<br />\r<br />\r<br />[b]TOOLS USED:[/b]\r<br />\r<br />DDSopt to extract the textures.\r<br />Adobe Photoshop[/size][size=3][size=3] with the dds plugin [/size]to work on textures.\r<br />Nifskope to quick preview the textures over the meshes.\r<br />Notepad for the xml fomod package.\r<br />\r<br />\r<br />[b]CREDITS and THANKS:[/b]\r<br />\r<br />Bethesda.\r<br />Nexusmods.\r<br />The whole modding community.\r<br />[/size][size=3]\r<br />[/size]\r<br />[size=3][b]PERMISSION NOTES:[/b][/size]\r<br />\r<br />[size=3][size=2]If you show in same way my assets in public places you must and should always credit the author.\r<br />These files are Nexusmod exclusive unless I give specific permission and instructions. My files follow the Nexusmods rules.\r<br />Users cannot upload my files to other sites, any type of sites, included file sharing host. \r<br />Users cannot modify my file; including releasing bug fixes or improving on the features my file adds to the game, and upload it as a separate file.\r<br />Users cannot use my assets in any mods/files that are being sold, for money, on Steam Workshop or other platforms. \r<br />Users cannot use assets contained in my files in their own files without my permission.\r<br />\r<br />I saw someone breaking every rule. So if I&#39;ll give the permission now on, I&#39;ll report bottom here the site name that had my permission, about each mod, for real, automatically all the others haveto be considered cheating and will be reported:[/size][/size]\r<br />\r<br />\r<br />\r<br />MY RELEASES:[/size]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/6781714/?tb=mods&pUp=1][img]https://staticdelivery.nexusmods.com/mods/1704/images/6127-0-1481762487.jpg[/img][/url]",
  "categoryId": "29",
  "version": "1.0",
  "author": "Kajuan",
  "createdUnix": "1482304283",
  "updatedUnix": "1482304283",
  "containsAdultContent": false,
  "uploadedBy": "Kajuan",
  "primaryFile": null,
  "files": []
}