{
  "modId": 81043.0,
  "modName": "TTRSO - TheThirdRace Skill Overhaul - Modular Spanish",
  "summary": "Traducción al español de TTRSO - TheThirdRace Skill Overhaul - Modular ",
  "descriptionHtml": "[size=2][size=1]Quiero agradecer a [/size][url=http://www.nexusmods.com/skyrimspecialedition/users/146146/?tb=mods&pUp=1]TheThirdRace[/url][size=1] su amabilidad por permitirme traducir su gran mod.[/size]\r<br />[size=1]Si os gusta no olvidéis ir a su página y darle vuestro Endorse como reconocimiento a su trabajo.\r<br />[color=#76a5af]Gracias Modling por hacer el maravilloso trabajo de traducir. GRACIAS.\r<br />[/color][color=#ffff00]Lee el post para una explicación[/color][/size][color=#ffff00]\r<br />[/color]\r<br />[/size][color=#c27ba0][size=3][b]DESCRIPCIÓN\r<br />[/b][/size][/color][color=#ead1dc]TTRSO es una revisión completa, minimalista y modular del sistema de habilidades (perks), con el objetivo de equilibrar y mejorar sin apartarse del estilo original. En general estos ajustes harán el juego un tanto más difícil, pues se han solventado muchos &#34;superpoderes&#34;, pero sin hacer que te sientas abrumado por la dificultad, permitiendo que puedas convertirte en una leyenda.\r<br />\r<br />[/color][color=#c27ba0][size=3][b]AJUSTES\r<br />[/b][/size][/color][color=#ead1dc][color=#ffffff][color=#ffff00][b]En la pestaña de descargas adjunto un archivo con el listado completo de las habilidades del mod.[/b][/color] [/color]Aparte de los ajustes directos de la habilidades, el mod también hace algunos otros ajustes relacionados que producen mejoras y equilibran el juego. En general, los principales ajustes del mod son los que se resumen a continuación:\r<br />\r<br />[/color][b][color=#999999]GENERALES[/color][/b][spoiler][list][*][color=#d8d8d8]Enfoque minimalista fiel al estilo original del sistema de habilidades de Skyrim.[/color]\r<br />[*][color=#d8d8d8]Enfoque equilibrado que ofrece más estilos de juego, bajando las habilidades demasiado poderosas y subiendo las demasiado débiles.[/color]\r<br />[*][color=#d8d8d8]Las habilidades de Magia, Combate y Sigilo ahora tienen 100 habilidades cada una.[/color]\r<br />[*][color=#d8d8d8]Las principales habilidades de la mayoría de los árboles de habilidades aumentan de acuerdo a tus habilidades, sin aplicar la mejora adicional el 20%.[/color]\r<br />[*][color=#d8d8d8]Cada tipo de armadura (pesada, ligera y desarmado) tiene sus propias ventajas y desventajas.[/color]\r<br />[*][color=#d8d8d8]Los gritos pueden jugar un rol más importante, pero tienes que enfocar tus esfuerzos en ese poder.[/color]\r<br />[*][color=#d8d8d8]El daño que produces peleando con tus puños ha sido mejorado.[/color]\r<br />[*][color=#d8d8d8]Todos los objetos/hechizos añadidos por este mod son vendidos por un nuevo mercader en &#34;El Corazón Helado&#34; en Hibernalia.[/color]\r<br />[*][color=#d8d8d8]Permite resetear un árbol de habilidades si lo deseas.[/color][/spoiler]\r<br />[*]\r<br />[/list][color=#00ffff]MAGIA[/color][spoiler][list][*][color=#a2c4c9]Las habilidades principales de las escuelas de magia, ahora mejoran la magnitud o la duración.[/color]\r<br />[*][color=#a2c4c9]La habilidad Maestro de cada escuela de magia, ahora también afecta al lanzamiento doble (multiplicador uniforme de 2.5x por el cose, la duración y la magnitud).[/color]\r<br />[*][color=#a2c4c9]Ya no es posible lanzar hechizos sin costes.[/color]\r<br />[*][color=#a2c4c9]ALTERACIÓN: El equilibrio es ahora un &#34;estado&#34; donde tu magia es tu salud (parecido a los magos de sangre).[/color]\r<br />[*][color=#a2c4c9]ALTERACIÓN: Los hechizos de armadura de mago ahora dan menos protección, pero mantienen tu magia al completo y la velocidad de regeneración del aguante intactos.[/color]\r<br />[*][color=#a2c4c9]CONJURACIÓN: Las armas ligadas tienen nuevas habilidades para hacerlas tan poderosas como las armas físicas.[/color]\r<br />[*][color=#a2c4c9]CONJURACIÓN: Los cuerpos reanimados y los atronach conjurados serán más útiles para aquellos dedicados al arte.[/color]\r<br />[*][color=#a2c4c9]DESTRUCCIÓN: La mayoría de las habilidades tienen ahora una posibilidad de disparar, haciendo la Destrucción más divertida.[/color]\r<br />[*][color=#a2c4c9]ENCANTAMIENTO: Los bastones son ahora valiosos de ser usados si escoges determinadas habilidades.[/color]\r<br />[*][color=#a2c4c9]ILUSIÓN: Permite construir tu carácter alrededor de la ilusión y ser una fuerza poderosa una vez pasas el nivel 50.[/color]\r<br />[*][color=#a2c4c9]RESTAURACIÓN: Los escudos mágicos son ahora útiles contra cualquier estilo de combate.[/color][/spoiler]\r<br />[*]\r<br />[/list][color=#ff7700]GUERRERO[/color][spoiler][list][*][color=#f9cb9c]ARQUERÍA: Los arcos son ahora incluso más mortales que antes, especialmente con los objetivos desprevenidos.[/color]\r<br />[*][color=#f9cb9c]BLOQUEO: Bloquear es ahora un poco menos efectivo, pero ofrece un poco más ofensivamente.[/color]\r<br />[*][color=#f9cb9c]ARMADURA PESADA: La mayoría de las habilidades funcionan siempre que lleves al menos 3 piezas de armadura pesada.[/color]\r<br />[*][color=#f9cb9c]ARMADURA PESADA: Da la máxima protección, pero con el coste de bajar la velocidad de regeneración de la magia y el aguante.[/color]\r<br />[*][color=#f9cb9c]A UNA MANO: Las habilidades han sido reagrupadas por tipos de arma.[/color]\r<br />[*][color=#f9cb9c]HERRERÍA: Los árboles de habilidades reorganizados te ofrecen más opciones elegir sobre cuales son las habilidades en las que quieres invertir.[/color]\r<br />[*][color=#f9cb9c]HERRERÍA: Las habilidades de &#34;infusión&#34; te permiten producir equipamiento tan poderoso como el daédrico y el de dragón.[/color]\r<br />[*][color=#f9cb9c]A DOS MANOS: Las habilidades han sido reagrupadas por tipos de armas.[/color][/spoiler]\r<br />[*]\r<br />[/list][color=#00ff00]LADRON[/color][spoiler][list][*][color=#93c47d]ALQUIMIA: Reajustado para igualar o sobrepasar el poder de las pociones y venenos existentes manteniendo el equilibrio.[/color]\r<br />[*][color=#93c47d]ARMADURA LIGERA: La mayoría de las habilidades funcionan siempre que lleves al menos 3 piezas de armadura ligera.[/color]\r<br />[*][color=#93c47d]ARMADURA LIGERA: Ofrece menos protección que la armadura pesada pero la bajada de velocidad de regeneración de la magia y el aguante es menos drástica.[/color]\r<br />[*][color=#93c47d]ABRIR CERRADURAS: Aquellos que no dediquen tiempo en la tarea, tendrán muchas dificultades para abrir cerraduras.[/color]\r<br />[*][color=#93c47d]SIGILO: La detección ha sido mejorada, la luz tiene un mayor efecto y los enemigos te buscarán por más tiempo.[/color]\r<br />[*][color=#93c47d]SIGILO: Ahora es posible llevar a cabo un ataque sigiloso con armas a dos manos.[/color]\r<br />[*][color=#93c47d]ELOCUENCIA: Los gritos tienen habilidades que dan mayor duración, mayor magnitud y reduce los[/color]\r<br />[*][color=#93c47d] tiempos de espera entre lanzamientos.[/color]\r<br />[*][color=#93c47d]ELOCUENCIA: Comerciar es ahora más dependiente de tus habilidades de elocuencia.[/color][/spoiler]\r<br />[/list][color=#c27ba0][size=3][b]INSTALACIÓN\r<br />[/b][/size][/color][color=#ead1dc][b]REQUISITOS[/b]: Skyrim SSE1. \r<br />Descarga y descomprime el [url=http://www.nexusmods.com/skyrimspecialedition/mods/1808/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrimspecialedition%2Fajax%2Fmodfiles%2F%3Fid%3D1808&pUp=1]mod en Inglés[/url].\r<br />2. Copia la carpeta &#34;Scripts&#34; (entera incluyendo la carpeta) a la subcarpeta &#34;Data&#34; en el directorio de instalación de Skyrim.\r<br />3. Descarga y descomprime la traducción del mod en español.\r<br />4. Copia el archivo &#34;TTR_Skill_Overhaul.esm&#34;[color=#ead1dc] y la carpeta &#34;Scripts&#34; (traducidos) [/color] a la subcarpeta &#34;Data&#34; en el directorio de instalación de Skyrim, sobreescribiendo todos los archivos.\r<br />5. Escoge entre si instalar los archivos ESP &#34;SUELTOS&#34; o &#34;UNIDOS&#34; (vienen en carpetas separadas).\r<br />[b]SUELTOS[/b]: Incluye todas las habilidades en archivos separados para que escojas la combinación que quieras.\r<br />[b]UNIDOS[/b]: Incluye todas las habilidades en un solo archivo &#34;TTR_Skill_Overhaul_FULL.esp&#34;, Dentro de la carpeta hay otro archivo que contiene todas las habilidades unidas excepto la de alquímia para evitar  conflictos con el mod &#34;Complete Alchemy and Cooking Overhaul&#34; (CACO). Si escoges esta versión NO instales el archivo FULL.\r<br />\r<br />[b]INSTALAR/RESETEAR/DESINSTALAR\r<br />[/b]Hay un misión para gestionar la instalación, el reseteo y la desinstalación dentro de cada módulo ESP/ESM.\r<br />\r<br />La primera vez que cargas el juego con el TTRSO instalado, la fase de instalación comenzará tras 5 segundos. Después empezará la fase de reseteo y cada árbol de habilidades será reseteado, devolviéndote todos los puntos de habilidad.\r<br />\r<br />Esto sucederá solo una vez y es necesario para tener todos los ajustes correctos. Si una nueva versión necesita alguna inicialización, automáticamente resteará solamente los arboles de habilidades requeridas cuando cargues tu juego la primera vez después de una actualización.\r<br />\r<br />Si quieres resetear manualmente un módulo para recuperar los puntos de habilidad, abre la consola y escribe SetStage TTR_Reset_Module 50. Simplemente remplaza &#34;Module&#34; por el nombre en inglés del módulo que quieras resetear (Alteration, Archery, etc.). Esto puede ser hecho tantas veces como quieras. Puedes encontrar todos los comandos en el archivo TTR_Reset_Module.txt incluido en este mod.\r<br />\r<br />Como precaución mientras un módulo se instala/resetea por sí mismo, ES RECOMENDABLE ESPERAR HASTA QUE LOS MENSAJES TERMINEN antes de hacer nada.\r<br />\r<br />La misión de desinstalación se requiere para eliminar todos los rastros de este mod desde tu juego guardado (incluso los scripts). Para llevarlo a cabo, carga tu juego y abre la consola. El comando para lanzar la misión de desinstalación es el mismo que para la misión de reseteo, pero tienes que usar un &#34;stage&#34; de 100 en vez de 50: SetStage TTR_Reset_Module 100\r<br />\r<br />No olvides desinstalar el módulo ESM manualmente, es muy importante. \r<br />\r<br />Cuando todo termine, haz un NUEVO guardado manual de tu juego. El guardado rápido no sirve en este caso.\r<br />\r<br />Finalmente, cierra el juego y usa la función de desistalación del Nexus Mod Manage (NMM) o borra manual todos los archivos de este mod.\r<br />\r<br />Asegúrate de no encontrarte en la posada de &#34;El Coracón Helado&#34; cuando lleves a cabo estas acciones, porque el mod añade un mercader allí y puede crear problemas en tu partida guardada.\r<br />\r<br />Después de desinstalarlo, puedes volver a instalarlo como hiciste la primera vez, y luego lanzando la misión de instalación. Mientras que la misión de reseteo usaba un &#34;stage&#34; 50 y la de desinstalación un &#34;stage&#34; 100, la misión de instalación usa un &#34;stage&#34; 0: SetStage TTR_Reset_Module 0.\r<br />\r<br />Si por cualquier razón tienes cualquier problema después de desinstalar este mod, prueba a instalar sólo el módulo ESM y esto debería solucionar el problema. De todas formas, esto no debería ser necesario.\r<br />\r<br />[b]EL PROBLEMA CON LAS HABILIDADES LEGENDARIA Y LA OPCIÓN &#34;reset perks&#34; DE DRAGONBORN\r<br />[/b]Desafortunadamente, las habilidades legendarias y la opción &#34;reset perks&#34; de Dragonborn no resetean todo correctamente, incluso para las habilidades del juego base sin las tres expansiones. Consigues recuperar todos tus puntos de habilidad, pero algunas cosas no son resteadas, como la más alta habilidad de encontrar un tesoro especial con &#34;Cazador de tesoros&#34;. Esto significa que después de escoger &#34;Cazador de tesoros&#34; y usar cualquiera de esas dos opciones para recuperar tus puntos de habilidad, no tienes que invertir en estas dos habilidades de nuevo para beneficiarte de ello. Esta es una de las razones por las que incluyo la misión de reseteo. Desafortunadamente, yo no podría resetear todo tampoco, pero me encargo de muchas más cosas de las que esas dos opciones hacen por su cuenta.\r<br />\r<br />Para forzar un reseteo limpio despues de usar las habilidades legendarias o el &#34;reset perks&#34; de Dragonborn, simplemente guarda y reinicia tu juego. La misión de reseteo comenzará automáticamente tras 5 segundos, incluso si usaste la funcionalidad de &#34;Guardado rápido&#34; o &#34;Cargar&#34;. Si no quieres guardar/reiniciar, simplemente lanza el reseteo manualmente con la consola.\r<br />\r<br />[color=#c27ba0][size=3][b]COMPATIBILIDAD\r<br />[/b][/size][/color]Obviamente, el mod es incompatible con otros mods que cambian las habilidades pero no con los que hacen uso de las habilidadespor defecto del juego. Por fortuna, este mod es modular, permitiéndote decidir los módulos que quieras usar y poder combinarlos con otros mods similares que modifiquen solo habilidades específicas.Si usas el mod &#34;ACE - Combat Skills&#34;, existe un ajuste en la velocidad de las armas que es incompatible con este mod. Para desactivar este ajuste, simplemente abre la consola y escribe &#34;set WeaponSpeedBaseFix to 0&#34;, para hacer ambos mods compatibles.[/color]",
  "categoryId": "28",
  "version": "1.6.1",
  "author": "TheThirdRace",
  "createdUnix": "1482544882",
  "updatedUnix": "1482524920",
  "containsAdultContent": false,
  "uploadedBy": "linqueo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000231758",
      "name": "TTRSO - TheThirdRace Skill Overhaul - Modular Spanish",
      "version": "1.6.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "150",
      "fileName": "TTRSO - TheThirdRace Skill Overhaul - Modular Spanish-81043-1-6-1.7z",
      "uploadedUnix": "1482524920",
      "modVersion": "1.6.1",
      "virusScanUrl": "https://www.virustotal.com/file/9e962333f69f3ad1fed64b6ee3df66a0cb1edc12b02303f080b16ff54b126a33/analysis/1482524942/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TTRSO%20-%20TheThirdRace%20Skill%20Overhaul%20-%20Modular%20Spanish-81043-1-6-1.7z?fid=1000231758&ttl=1535869666&ri=8192&rs=8192&setec=5a247cf572a9a379d68d6fdc0fd41cf6"
    }
  ]
}