{
  "modId": 81065.0,
  "modName": "Clockville and the Betrayed - EN",
  "summary": "A new settlement and a few dungeons for Enderal&#33; ",
  "descriptionHtml": "[center][color=#a4c2f4][u][size=6]Clockville[/size][/u][/color]\r<br />[color=#3c78d8]And the Betrayed\r<br />\r<br />\r<br />[color=#ff0000]WARNING:\r<br />After Enderal patch 1.2.3.0, this mod of mine will likely cause a CTD. I will be attempting to solve this issue shortly.[/color]\r<br />\r<br />[/color]Welcome my friends, to my biggest mod yet&#33; Using Enderal&#39;s resources, I have crafted a whole new and vibrant settlement in Enderal, far up north in the Goldenforst. Included in it is a written history of the town, as well&#33; \r<br />I was inspired by the look of Majora&#39;s Mask, and loved the autumn nature of the region. I may come out with future updates of this mod, but we&#39;ll see; I know I need to get back into Skyrim proper some day for everyone.\r<br />Most notably, this mod supplies the player with \r<br />[color=#00ff00]- The town has 3 new merchants and several wandering npc&#39;s with basic packages\r<br />- A priest that can cure you of diseases\r<br />- A secure, beautiful castle-town as a home for exploring the rest of Goldenforst\r<br />- A new Player Home in a history square-tower style keep\r<br />\r<br />[color=#ffffff]Besides for by foot, there&#39;s no Myrad that travels to the town. Haven&#39;t figured that out. BUT, there is a new &#39;teleportation tome&#39; next to the Myrad tower at the Farmer&#39;s Coast that will take you right there&#33; \r<br />\r<br />\r<br />Besides the new town, the mod also comes with a new text-driven quest to discover the whereabouts of the castle&#39;s former tenant, the venerable Keeper of the Order, Myrrdin Dal&#39;Wylt, and the treasures he left behind&#33;\r<br />The quest starts once you enter the castle and discover the note left behind on the throne. Clues will lead you to the Lighthouse, and from there, there are 2 new worldspaces to explore. I recommend being at least level 10 or higher for the Rime worldspace. Admittedly, these are small things, and a little rough around the edges, but I hope everyone enjoys nonetheless&#33; \r<br />\r<br />*If you are having difficulty finding certain things for the quest, give me a personal message and I&#39;ll walk you through, no problem&#33;\r<br />\r<br />It is my thanks for SureAI doing such a remarkable job on this beautiful game. \r<br />I also hereby give SureAI permission to use what I have done for any future updates of theirs, if they so choose. \r<br />For now it is English Only, but I give permission to anyone who would want to translate&#33;\r<br />\r<br />Thank you everyone, and have a Merry Christmas and all other happy holidays&#33;\r<br />\r<br />[/color][/color][/center]",
  "categoryId": "106",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1482635277",
  "updatedUnix": "1482634877",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000231853",
      "name": "Enderal&#39;s Clockville - EN",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1133",
      "fileName": "Enderal's Clockville - EN-81065-1-0.zip",
      "uploadedUnix": "1482634877",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/49c2f21325650ca41473180670e9b4ac494d48df7326007a488d93e7f9ca4118/analysis/1482634922/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enderal%27s%20Clockville%20-%20EN-81065-1-0.zip?fid=1000231853&ttl=1535869685&ri=8192&rs=8192&setec=140b69feb42b1bbedb6f4fbca4222671"
    }
  ]
}