{
  "modId": 8108.0,
  "modName": "Vampire Annoyance Fix",
  "summary": "Fixes people attacking you at stage 4 vampirism.  ",
  "descriptionHtml": "Description:  \r\nI love being a fiend of the night but the one thing that annoyed me was being attacked as a stage 4 vampire.\r\nThis mod fixes the problem.  I have not tested it extensively but it seems to work for me. \r\nIf you like this mod please endorse.  I am also taking mod suggestions so if you have an idea for a mod\r\nfeel free to private message me and I will see what I can do to help.  Keep in mind that I have college and work\r\nso I may take a few hours to respond and creating the mod could take anywhere from a few minutes to a few days \r\ndepending on how extensive the suggestion is.\r\n\r\nBugs/glitches:\r\nIf you find any bugs please report them in the comments section.  I will try to check it regularly.  If you find\r\nsomething gamebreaking just private message me and I will probably react faster to fix the problem.  Please remember\r\nthat I am not a very experienced modder.  My knowledge is limited to playing around with the CK and some blender/nikscope\r\nknowledge from doing some BBB animation conversions for a few armors/clothing.\r\n\r\nConflicts:  Chances are this mod will conflict with most mods that alter vampirism.  It should be fine as long as you\r\nload my mod after the other vampire-altering mods.\r\n\r\nLicensing/Legal:  Feel free to upload this mod to any site or modify it any way you wish.  All I ask is for a private\r\nmessage stating what you are doing and to recievecredit as the original creator/author.",
  "categoryId": "24",
  "version": "1.0",
  "author": "kridlekid",
  "createdUnix": "1328663186",
  "updatedUnix": "1328840972",
  "containsAdultContent": false,
  "uploadedBy": "kridlekid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28162",
      "name": "Fixed Version",
      "version": "3.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Fixed Version-8108-3-0.zip",
      "uploadedUnix": "1328840972",
      "modVersion": "3.0",
      "virusScanUrl": "https://www.virustotal.com/file/52f06b04e0cab43ca511c5741016b12b89fed96626f834ed262e9d80f9733531/analysis/1406665924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fixed%20Version-8108-3-0.zip?fid=28162&ttl=1535766572&ri=8192&rs=8192&setec=cf9ee93d555fba210908d5a6e598133e"
    }
  ]
}