{
  "modId": 81115.0,
  "modName": "Slaymaker&#39;s Crafting and Item Overhaul",
  "summary": "Fixes many flaws in the crafting system, and adds a number of features.  Temper every material to Legendary, craft clothes, misc items, soul gems, and enchanted and unenchanted guild gear, wear circlets with hoods, and much more&#33;",
  "descriptionHtml": "[center][size=5]Slaymaker&#39;s Crafting and Item Overhaul[/size][/center][center][/center]\r<br />[size=3]Slaymaker&#39;s Crafting and Item Overhaul (SCIO) aims to rectify many of the limitations and annoyances of the crafting system without destroying balance, and to open up new options for roleplay while remaining true to lore.  It also fixes many inconsistencies and illogical values of items, such as burned up books weighing more than intact ones.  Several often requested features--soul gem crafting and upgrading, circlets worn with hoods, craftable and unenchanted guild armor--are included in this mod.\r<br />\r<br />SCIO was designed to be as unobtrusive and compatible as is possible for such a large mod.  Aside from the changes to the perk trees and the renamed items (which you will quickly get used to), most changes are &#34;behind the scenes&#34; things you will barely notice.  As with any mod this size, there are judgment calls, but I have done my best to stay true to lore and avoid immersion breakers, while keeping things somewhat simple and logical.\r<br />\r<br />This is the original Skyrim version.  [url=http://www.nexusmods.com/skyrimspecialedition/mods/8459/?]Click here[/url] for the Special Edition version.\r<br />[/size]\r<br />[center][size=3][b][u]FEATURES[/u][/b][/size][/center]\r<br />[size=3]SMITHING TREE\r<br />[list]\r<br />[*][size=3]Every material in the game is now improved by a smithing perk, so you aren&#39;t stuck with Flawless quality at Smithing 100.[/size]\r<br />[*][size=3]The new Guild Smithing perk lets you craft faction-exclusive gear (such as Dawnguard War Axe or Shrouded Armor) once you&#39;ve progressed far enough in that faction&#39;s questline.  Guild Smithing has two ranks--rank 1 lets you forge unenchanted versions of the gear, and rank 2 lets you forge the enchanted versions.[/size]\r<br />[*][size=3]The new Trinket Smithing perk allows you to craft Amulets of the Nine Divines, wooden swords, and silver weapons, and is now required to craft bone jewelry or jewelry with gems (such as Gold Diamond Necklace).  It also lets you craft circlets, and doubles the tempering of silver, gold, and wood.[/size]\r<br />[*][size=3]The new Artifact Smithing perk lets you craft replicas of unique items.  The replicas have 1/10 value to prevent crazy gold/XP gains and are unenchanted, but are otherwise identical (damage, armor rating, weight, etc).  The recipes won&#39;t appear unless you have the original in your inventory (it won&#39;t be consumed).  If it&#39;s a unique item you don&#39;t get to keep, such as the Jagged Crown, the recipe will appear once you&#39;ve completed the relevant quest.  This perk only works with items with unique graphics--unique variants of common items, such as Movarth&#39;s Boots or the Poacher&#39;s Axe, can&#39;t be replicated.[/size]\r<br />[*][size=3]Arcane Blacksmith (now called Arcane Smithing), in addition to its vanilla benefit, now allows you to craft soul gems and smelt them together into larger sized soul gems, and to create black soul gems.  The recipes give smaller soul gems more use and make stockpiling black/grand soul gems more viable, without ruining scarcity.[/size]\r<br />[*][size=3]Orcish Smithing and Dwarven Smithing have swapped places and prereqs on the tree, because Orcish was instantly obsolete before.[/size]\r<br />[*][size=3]Because people have complained about it for years, you can now travel in a circle outside the Smithing tree.  (You still have to begin at Steel Smithing, which is now called Basic Smithing.)[/size]\r<br />[*][size=3]Armor and weapon crafting recipes have been standardized to make the types and amounts of materials required more consistent.[/size]\r<br />[/list]\r<br />ALCHEMY TREE\r<br />[list]\r<br />[*][size=3]Perks have been buffed to make alchemist/poisoner builds more viable.  Poisoner now improves poisons you brew by 50%, to bring it in line with the combined 50% to healing potions from Benefactor and Physician.  Concentrated Poison now has two ranks, allowing poisons to last 3 hits (rank 1) or 5 hits (rank 2).[/size]\r<br />[*][size=3]Experimenter now has only two ranks, with much lower skill prereqs, so it&#39;s actually useful for rare ingredients.[/size]\r<br />[*][size=3]Snakeblood now grants 50% disease resistance as well as poison resistance.[/size]\r<br />[*][size=3]Green Thumb has been removed, because it was a bit ridiculous in conjunction with Hearthfires gardens.  In its place is Catalyst, a perk that increases the strength of potions you drink by 50%.  (They will display as 50% stronger in your inventory, but this is misleading--it just shows the improved benefit that you, and ONLY you, will get from drinking them.)[/size]\r<br />[/list]\r<br />ENCHANTING TREE\r<br />[list]\r<br />[*][size=3]The elemental branch of the Enchanting tree has been redone, ultimately allowing 5% stronger elemental enchantments at the cost of an additional perk point when compared to vanilla.  This is accomplished through removal of the Fire Enchanter, Frost Enchanter, and Shock Enchanter perks, and the addition of Elemental Attacker and Elemental Defender perks.  They have two ranks each, granting 15% stronger elemental enchantments per rank to weapons and armor, respectively.[/size]\r<br />[*][size=3]Soul Siphon and Soul Squeezer have had their skill prereqs raised slightly.[/size]\r<br />[/list]\r<br />HEAVY ARMOR and LIGHT ARMOR TREES\r<br />[list]\r<br />[*][size=3]Several armor sets are now keyworded as unique.  The Matching Set perks have been edited to check for this.[/size]\r<br />[/list]\r<br />WEAPONS\r<br />[list]\r<br />[*][size=3]Some weapons have been edited to adjust temper materials, keywords, and other attributes.[/size]\r<br />[*][size=3]Several sets of weapons are now craftable that weren&#39;t before, such as Falmer and Forsworn weapons.[/size]\r<br />[*][size=3]Skyforge weapons have been expanded to include a mace, warhammer, and arrows.  (Reuse the graphics for the generic Steel weapons.)[/size]\r<br />[*][size=3]Honed Falmer Arrows now exist, and can be crafted.  (Reuses the graphics for Falmer Arrows.)[/size]\r<br />[*][size=3]The Ebony Blade can no longer be tempered, because the lorebook sitting on the table next to it explicitly states that it cannot be.  (Reverts USLEEP&#39;s change in a safe manner.)[/size]\r<br />[/list]\r<br />ARMOR\r<br />[list]\r<br />[*][size=3]Many armor pieces have been edited to adjust temper materials, keywords, and other attributes, and to clarify them as unique sets for use with the Matching Set perks.[/size]\r<br />[*][size=3]Several shields have been corrected to use the proper bash/block sounds, and an erronious name (Daedric Shield of the Nullification) was fixed.[/size]\r<br />[*][size=3]To reflect the new perk placement on the Smithing tree, Dwarven and Orcish armor have swapped armor ratings, so that Dwarven is stronger.  (Dwarven weapons were already stronger, and Dwarven armor was already heavier.)[/size]\r<br />[*][size=3]Several armor sets are now craftable that weren&#39;t before, such as Morag Tong and vampire armor.  There are also (craftable) unenchanted versions of faction armor.[/size]\r<br />[*][size=3]Gilded Elven Armor is now a complete set, and is heavy armor.  (Still uses graphics for ordinary Elven armor.)[/size]\r<br />[*][size=3]Wolf armor and Steel Plate armor have been expanded to include shields.  (Reuse the graphics for Steel Shield and Orcish Shield respectively.)[/size]\r<br />[*][size=3]There are now heavy armor versions of the Chitin Shield and Stalhrim Shield.  (Reuse the light shields&#39; graphics.)[/size]\r<br />[/list]\r<br />CLOTHING\r<br />[list]\r<br />[*][size=3]Clothes can now be crafted at the tanning rack, if you have a Clothes Iron in your inventory.  (Serves as a poor man&#39;s toggle--drop the Clothes Iron to hide the recipes.)[/size]\r<br />[*][size=3]Clothes are made from Leather, Leather Strips, and Linen Wraps, the latter of which can be crafted from Tundra Cotton at the tanning rack.[/size]\r<br />[*][size=3]Several clothing sets are now playable and craftable that weren&#39;t previously, such as Greybeard robes and vampire clothes.[/size]\r<br />[*][size=3]Circlets can now be worn with mage hoods, most hooded robes, and a few random hoods (such as Greybeard&#39;s Hood and Shrouded Hood).  Those that don&#39;t work were excluded because they resulted in significant graphical errors.[/size]\r<br />[*][size=3]Many clothing items have been renamed for variety.[/size]\r<br />[*][size=3]Clothing weights and values have been standardized.  Fancier clothes are sturdier and weigh more, and professional clothes (ie Chef&#39;s outfit) are worth more than generic clothes.  Fancy clothes are now worth less, to balance being able to craft them from cheap materials, but still fetch a better price than commoner clothing.[/size]\r<br />[/list]\r<br />MISC ITEMS\r<br />[list]\r<br />[*][size=3]Junk items can now be crafted at the forge, if you have a hammer in your inventory.  (Serves as a poor man&#39;s toggle--drop the hammer to hide the recipes.)[/size]\r<br />[*][size=3]Many items have been edited to adjust weights and values that made no sense.  (Random jugs worth 0, burned books weighing more than intact ones, etc.)[/size]\r<br />[*][size=3]Silver items are now worth more, to make them more worthwhile targets for thief characters.[/size]\r<br />[*][size=3]Some items have been renamed for variety.[/size]\r<br />[/list]\r<br />LEVELED ITEMS\r<br />[list]\r<br />[*][size=3]Gem mining has been de-leveled--it is now possible to obtain any gem at any level through mining.  You still have a 10% chance to receive a gem per piece of ore mined, and more valuable and flawless gems are still rare.[/size]\r<br />[*][size=3]Unique leveled quest rewards (The Pale Blade, Nightingale gear, etc) have been de-leveled--you will receive the strongest version regardless of level.  If you install SCIO on an existing save, you can take weaker versions of these items to the smelter to exchange them for the strongest version.[/size]\r<br />[*][size=3]You can trade between the light armor and heavy armor versions of Miraak&#39;s mask at the smelter.[/size]\r<br />[/list]\r<br />[center][b][u]TECHNICAL[/u][/b][/center]\r<br />REQUIREMENTS\r<br />[list]\r<br />[*][size=3]The lastest version of Skyrim (v1.9.32.0.8).[/size]\r<br />[*][size=3]The official DLCs (Dawnguard, Hearthfires, Dragonborn).[/size]\r<br />[*][size=3]The latest version of the [url=http://www.nexusmods.com/skyrim/mods/71214/?]Unofficial Skyrim Legendary Edition Patch[/url] (USLEEP v3.0.7).[/size]\r<br />[/list]\r<br />COMPATIBILITY\r<br />[list]\r<br />[*][size=3]Edits the Alchemy, Enchanting, and Smithing trees, and numerous perks in them.  Do not use with any mod altering these trees or perks.[/size]\r<br />[*][size=3]Edits the Matching Set perks in the Light Armor and Heavy Armor trees, and therefore may conflict with mods altering those trees.[/size]\r<br />[*][size=3]Edits leveled lists affecting gems obtained by mining, and unique leveled quest rewards (The Pale Blade, Nightingale gear, etc).[/size]\r<br />[*][size=3]Does NOT edit vendor lists.[/size]\r<br />[*][size=3]Uses no scripts.[/size]\r<br />[*][size=3]SCIO edits and adds MANY items and recipes (over 1500) and needs to be loaded LAST.[/size]\r<br />[*][size=3]Should work with mods adding new items, weapons, and armor, provided they are loaded before SCIO and the authors have correctly keyworded their items.  If the items added by such mods are templated from existing items, they may not work as expected due to SCIO&#39;s changes.[/size]\r<br />[/list]\r<br />I highly recommend you use SCIO with a new game, and do not uninstall on that character.  This mod tested quite well with adding to/removing from existing saves, provided you follow the instructions below, but any change to your load order mid-game can have unintended consequences.  If you&#39;re uncertain how to perform a certain step, I&#39;ve posted an article on the mod page called Hand-holding with more detailed instructions.\r<br />\r<br />INSTALLING\r<br />1. Extract the contents of SCIOv1.7z.  Place SCIO v1.esp and the documentation in your Data folder for Skyrim.\r<br />2. (If installing on an existing save:) Make a backup of your character&#39;s save file(s).\r<br />3. (If installing on an existing save:) Make sure SCIO is NOT enabled, and go in-game.  Remove all perks from the crafting trees (Alchemy, Enchanting, and Smithing).  Save and exit to desktop.\r<br />4. Open Skyrim.  Before going fully in-game, click Data on the splash screen and make sure SCIO is enabled (the little box next to it should be checked) and make sure it&#39;s loaded last.  If you&#39;ve downloaded mods through Steam, wait until it finishes managing subscriptions (it&#39;ll say at the bottom), or changes to your load order may not stick.\r<br />5. Go in-game.  If you installed on an existing save, place your perks back into the crafting trees.  Save and enjoy.\r<br />\r<br />UNINSTALLING\r<br />1. Make a backup of your character&#39;s save file(s).\r<br />2. Go in-game.  Remove all perks from the crafting trees (Alchemy, Enchanting, and Smithing).\r<br />3. (Recommended:) Gather all items added by SCIO (replicas, unenchanted faction armor, etc) and sell them.  They&#39;ll vanish when you uninstall and cannot be recovered.  Save and exit.\r<br />4. Go into your Skyrim Data folder and delete SCIO v1.esp and the documentation.\r<br />5. Go in-game and place your perks back into the crafting trees.  Save and enjoy.\r<br />\r<br />UPGRADING FROM BETA\r<br />1. Make a backup of your character&#39;s save file(s).\r<br />2. Go in-game.  Remove all perks from the crafting trees (Alchemy, Enchanting, and Smithing).  Save and exit.\r<br />3. Go into your Skyrim Data folder and delete SCIOv0.5.esp and the old documentation.\r<br />4. Extract the contents of SCIOv1.7z.  Place SCIO v1.esp and the new documentation in your Data folder for Skyrim.\r<br />5. Open Skyrim.  Before going fully in-game, click Data on the splash screen and make sure SCIO is enabled (the little box next to it should be checked) and make sure it&#39;s loaded last.  If you&#39;ve downloaded mods through Steam, wait until it finishes managing subscriptions (it&#39;ll say at the bottom), or changes to your load order may not stick.\r<br />6. Go in-game.  Place your perks back into the crafting trees.  Save and enjoy.\r<br />\r<br />Removing the perks is very important.  If you fail to do so, things will not work as intended.  At best, you will have &#34;invisible&#34; perks, screwing up the balance of skills like Alchemy and Enchanting.  At worst, you may lose perk points altogether, or render certain perks nonfunctional.\r<br />\r<br />[center][b][color=#ff0000][u]KNOWN ISSUES[/u][/color][/b][/center]\r<br />[list]\r<br />[*][size=3]Circlets worn with hoods tend to clip through slightly.  This is quite minor in most cases, and since NPCs don&#39;t normally carry both hoods and circlets, you shouldn&#39;t ever see this if you play in first person.  If you play in third person and the clipping bugs you, you can simply choose not to wear circlets and hoods at the same time.  (NOTE: Circlets worn with Dunmer Outfits are invisible, but this is a vanilla issue.)[/size]\r<br />[*][size=3]Thalmor may spawn with the Gilded Elven Armor cuirass, which might make them a bit squishy since their skill is in Light Armor rather than Heavy Armor.  (Gilded has been expanded into a full set, and is now considered heavy armor.)  I decided that avoiding potential conflicts with mods altering enemies was more important than letting some snotty elf survive an extra axe swing, so this issue will go unaddressed.[/size]\r<br />[*][size=3]New items (such as Steel Plate Shield) are not integrated into vendor lists, enemy drops, treasure chests, and so forth.  Vendors will be addressed in version 2, but the rest will remain as-is to avoid the risk of conflict with mods focusing on enemies and treasure lists.[/size]\r<br />[*][size=3]Crafting clothing at the tanning rack does not grant Smithing XP.  If I learn how to change this, I&#39;ll fix it in version 2.[/size]\r<br />[*][size=3]Crossbow crafting uses vanilla prereqs rather than Guild Smithing.  The vanilla prereqs were set up strangely and I don&#39;t fully understand it, so I decided to leave it alone for now rather than risk breaking anything.  I&#39;ll see if I can figure it out for version 2.[/size]\r<br />[*][size=3]The recipe for the Gold and Emerald Circlet requires a ruby instead of an emerald.[/size]\r<br />[*][size=3]The Aetherial Crown cannot be tempered due to a bad condition in the recipe (vanilla issue).  The Aetherial Crown replica cannot be tempered, either, because I copied that bad condition into its recipe.\r<br />[/size]\r<br />[/list]\r<br />[center][b][u]CREDITS/THANKS[/u][/b][/center]\r<br />[list]\r<br />[*][size=3]Bethesda, for creating Skyrim and the Creation Kit, which made it possible for a noob like myself to mod Skyrim.[/size]\r<br />[*][size=3]The unofficial patch team&#39;s mod USLEEP, for fixing many items and adding numerous recipes so I didn&#39;t have to.[/size]\r<br />[*][size=3]Seb263&#39;s mod ShowRaceMenu Alternative, for making it much less time-consuming to check for graphical errors on different races/genders when making NPC gear playable or altering armor body slots.  (FYI for anyone using it--it doesn&#39;t like vampires, but will usually work anyway, applying the vampire changes shortly after exiting character creation screen.  If you get graphical errors, reload without saving.)[/size]\r<br />[*][size=3]TSuser&#39;s mod Quick Start--Skip the Opening Sequence, for saving me a good twenty minutes or so each time I had to start a new test character.[/size]\r<br />[*][size=3]Anyone who playtested, reported bugs, or gave feedback.[/size]\r<br />[/list][/size]\r<br />\r<br />",
  "categoryId": "100",
  "version": "1",
  "author": "SlaymakerHatesYou",
  "createdUnix": "1482914676",
  "updatedUnix": "1487719324",
  "containsAdultContent": false,
  "uploadedBy": "SlaymakerHatesYou",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000236980",
      "name": "Slaymaker&#39;s Crafting and Item Overhaul v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "81",
      "fileName": "Slaymaker's Crafting and Item Overhaul v1-81115-1.7z",
      "uploadedUnix": "1487719324",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/57c102a435cee9282cec27ff8325fc7a7f49c1e7dedc80b8d6ad56dd03b83f2b/analysis/1487719563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Slaymaker%27s%20Crafting%20and%20Item%20Overhaul%20v1-81115-1.7z?fid=1000236980&ttl=1535869736&ri=8192&rs=8192&setec=cef1a1bc95a212569f7209b03e1eb49e"
    }
  ]
}