{
  "modId": 8135.0,
  "modName": "The Elder Scrolls V Console Codes And Cheats Skyrim",
  "summary": "I thougt that most of the post that give you console codes werent complete enough so i made my own.",
  "descriptionHtml": "First of all open the conole by pressing \\\"ยบ\\\" (this only works for pc, in ps3 and 360 there arent any cheats, yet)\r\n\r\nConsole cammands that need a target (just click the target ,with the console open, that you want to)\r\n\r\nSetav  #: this will increase any skill\r\n\r\nsetav health 300: will change the targets health to 300\r\nsetav stamina #\r\nsetav magicka #\r\nsetav smithing 100: will chenge the targets skill in smithing to 100\r\nthe skills are:\r\n\r\nsmithing = smithing\r\nheavy armor = heavyarmor\r\nblock = block\r\ntwo handed = twohanded\r\none handed = onehanded\r\narchery = marksman\r\nlight armor = lightarmor\r\nsneak = sneak\r\nlockpicking = lockpicking\r\nspeech = speechcraft\r\nalchemy = alchemy\r\nconjuration = conjuration\r\nillusion = illusion\r\ndestruction = destruction\r\nalteration = alteration\r\nrestoration = restoration\r\nenchanting = enchanting\r\n\r\nsetscale #: is used to make npc bigger. 1 is normal 10 is the maximum\r\nkill: the word says it all doesnt it?\r\nresurrect: WARNING by using this you are restoring its inventory to default\r\nremoveallitems: it removeal all the items to oblivion, i mean they just disapear.\r\nremoveallitems: player it steals all the items from the npc, they dont disapear.\r\nresetinventory: if this will reset the npc inventory to the default inventory.\r\nreserhealth: this will recover the targets health, its like a ultimate healing potion.\r\n\r\nall  the codes listed above are for npc (non playable characters) now we will start with the codes for objects.\r\n\r\nsetownership: this will make almost any item yours.\r\nduplicateallitems: this works with chests,urns,barrels and npc.\r\nunlock: this will unlock any door or chest you target.\r\nlock: this will lock an unlocked door, lock level is between 1 (novice) and 1000 (master).\r\n\r\nNow we start with the codes that you need to have nothing selected.\r\n\r\ntgm: God Mode, you will hae infinite stamina, health, magicka, etc.\r\ntai: you kill the AI npc wont do anything, just stand there in there place.\r\ntcai: its like tai but this only affects the fighting npc will do everything exept fight.\r\ntcl: yo will be able to fly and pass trough walls.\r\nkillall: you will kill everything around you, i do not know wich is the range of effect but i only know that if you are at the entrace of whiterun near the blacksmith you will kill everything in the town.\r\ntmm,1: shows all the map tmm,1 activates it and tmm,2 desactivates it.\r\nplayer.setav carryweight #: set your own point of carriyng.\r\nplayer.setav smithing #: sets your skill in smithing to the number you replace the # for, use the skills listed in the npc part for this.\r\nplayer.setav health #: set your health\r\nplayer.setav stamina #\r\nplayer.setav magicka #\r\nplayer.setav dragonsouls #: changes your dragon souls to the value you put.\r\nplayer.teachword #: adds words of power to your character, change the # for the id found in this page http://elderscrolls.wikia.com/wiki/Console_Shout_Codes_%28Skyrim%29 , though you will need dragon souls to unlock the shouts.\r\nplayer.setscale #: changes your size.\r\nplayer.setrace #: changes your race (you must have no helmet on, it will bug if you have the helmet on) to anyone you tipe in, jusp pu the name, like: mudcrab, orc, highelf, dragon, etc.\r\ncoc qasmoke: it teleransports you to the test room.\r\ncoc riverwood: gets you out of the room.\r\nset timescale to #: changes the timescale of skyrim, 1 is real time.\r\nplayer.additem # $: adds any item you put the id in, change # for the id and $ for the cuantiti you want, use help \\\"item name\\\" 0 to view the id you need to put \\\"\\\". \r\nsexchange: changes your body sex, not your face.\r\nplayer.placeatme #: places any npc or object you want at your back, change # for the id, if you want more than one item added jus make a space between the id and add the nuber you want.\r\nplayer.modav smithing 100: WARNING this is a very diferent, thid will give you extra points, not normal ones.\r\nplayer.addperk #:change the # for the perk id to add it. search perks by using this. help \\\"perk name\\\" 0.\r\npsb: adds all spells.\r\nplayer.advlevel: this does not add a normal level, it just adds 1 level to your level, if you are lvl 7\r\nand have 4 perks to add, this wont add any perks to add ill just add a level.\r\ntdetect: you will kill the ai detection, just like if you were invisible.\r\nadvskill [skill name] #: this will increase your skills normaly.\r\n\r\n\r\n",
  "categoryId": "40",
  "version": "",
  "author": "EdricTheV",
  "createdUnix": "1328669664",
  "updatedUnix": "1328801604",
  "containsAdultContent": false,
  "uploadedBy": "EdricTheV",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27760",
      "name": "Codes",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Codes-8135-1.zip",
      "uploadedUnix": "1328801604",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f8ba2cc7064d8e0cf6a5da123f96c2e45f130d56da0ba6ff2bc163478e36be1d/analysis/1406664192/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Codes-8135-1.zip?fid=27760&ttl=1535766616&ri=8192&rs=8192&setec=bdeeef457f892aa99efc32a672fe6658"
    }
  ]
}