{
  "modId": 81367.0,
  "modName": "Beautiful Hroki",
  "summary": "This is a simple .esp and .bsa file for Hroki. I've got permissions for the hair by apachii but it is up to you to install them. Check the read me for what all this mod changes about her.",
  "descriptionHtml": "[size=4]About Mod[/size]\n<br />\n<br />[size=2]WORK IN PROGRESS!\n<br />\n<br />[/size]There is an issue where installing my mod creates a duplicate Hroki in game. Unfortunately, I do not know how to fix this issue. My only solution to this issue is to activate one Hroki as a follower and then disable the other. To do so, open the console, click on her and type \"disable\" without the quotations and that will fix your issue. I myself have done this and from what I've experienced, there are no negative effects in doing this. This is my first mod and I am sorry she has issues.. \n<br />\n<br />\n<br />Race: Nord\n<br />\n<br />Level: AutoLevel 25-100 (Her base level is 25)\n<br />\n<br />Class: Warrior\n<br />\n<br />Perks/Skills:\n<br />AdvancedArmors\n<br />Stealth80\n<br />crReducedDamage075\n<br />Bladesman90\n<br />AgileDefender80\n<br />Overdraw80\n<br />EagleEye30\n<br />QuickShot\n<br />Armsman80\n<br />FightingStance\n<br />CustomFit\n<br />MatchingSet\n<br />DeftMovement\n<br />\n<br />AI:\n<br />In battle Hroki will charge any enemy with a 1H weapon or stand back with a bow/crossbow. She is a really good shot with a bow.\n<br />She is not a spell caster.\n<br />I haven't tested her with shields but I'm confident she will use them.\n<br />\n<br />[size=2]Location: Markarth main area at front entrance during the day.[/size]\n<br />\n<br />[size=4]Requirements[/size]\n<br />\n<br />Since this mod is a fix for Hroki, the only requirement is Skyrim itself. If you don't have the DLC's she will still work.\n<br />\n<br />[size=4]Compatibility[/size]\n<br />[size=2]I personally use UNP body replacer so if you use CBBE or any other body replacer she should work since this is only for her face and actions.[/size]\n<br />\n<br />[size=4]Installation[/size]\n<br />\n<br />Just drag and drop both Hroki.esp and Hroki.bsa into your Skyrim data folder X:/Steam/steamapps/common/Skyrim/Data \"X\" being the hard drive that steam is installed on.\n<br />Run Skyrim Launcher and activate the Hroki.esp and there you go.\n<br />\n<br />[size=4]Load Order Warning!\n<br />\n<br />[/size]If you have a mod that allows you to marry Hroki, be sure to that after you run LOOT/BOSS to run the Skyrim Launcher and manually move the Hroki.esp to load right after the marry mod. If you don't do this, Hroki's face will be discolored and revert to vanilla. For some reason LOOT thinks her .esp should run first and it's wrong.\n<br />\n<br />[size=4]Uninstall\n<br />\n<br />[/size]Just remove the Hroki.esp and Hroki.bsa from your Data Folder. Once done Hroki will revert back to her old vanilla self.\n<br />\n<br />[size=4]Additional Information\n<br />\n<br />[/size]This mod is in \"beta\" at this time and I am working on body textures and adjustments to her face. Also, if you have an issue with purple/missing textures above her eyes, try downloading http://www.nexusmods.com/skyrim/mods/30411/? this should fix the issue. The next update should have fixes for all any issue involving missing textures.\n<br />\n<br />Have you ever just gone to Markarth and watched a person get murdered in front of your eyes and the only thing you care about is the lovely blonde in the tavern dress and once you speak to her you realize that she is as boring as walking up 7,000 steps? Look no further! This mod takes innocent Hroki the girl who never leaves Markarth and transforms her into a more beautiful warrior! To make I have modified her characteristics so that she is an ally to the player which is relationship rank 3 (Lover is 4) The Readme in the Data folder explains everything about her in full detail. This is the first mod I've ever made so feedback would be greatly appreciated! If the mod has any problems let me know and I'll work on it.\n<br />\n<br />\n<br />If you would like your Hroki to look like mine in the screenshots I suggest you check out these awesome mods. If you use these mods just know that they are NOT required, nor do I take ANY responsibility for their use by others. If you decide to use them, you should endorse them and support them. They are all extremely talented! My mod only requires apachii's hair. All the technical modifications to Hroki where done by me. These are ONLY cosmetic recommendations! I do not condone mod theft and I will never recommend a mod that has been stolen nor will I use any!\n<br />\n<br />The Eyes Of Beauty by [b]Gabriel Mailhot as LogRaam[/b] http://www.nexusmods.com/skyrim/mods/13722/?\n<br />Brows by [b]Hvergelmir[/b] http://www.nexusmods.com/skyrim/mods/30411/?\n<br />DIMONIZED UNP female body by [b]dimon99[/b] http://www.nexusmods.com/skyrim/mods/6709/?\n<br />SRG Female Textures by Seren4XX Can be found if you Google them.",
  "categoryId": "33",
  "version": "v1.1",
  "author": "DementedShadow23",
  "createdUnix": "1483814417",
  "updatedUnix": "1484599996",
  "containsAdultContent": false,
  "uploadedBy": "DementedShadow23",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000233074",
      "name": "Beautiful Hroki",
      "version": "v1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1344",
      "fileName": "Beautiful Hroki-81367-v1-0.rar",
      "uploadedUnix": "1483814071",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/842d1c7b8816d328a629244b21e2c730b8c7bef727709b04ece12544ec1fc67b/analysis/1483814284/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beautiful%20Hroki-81367-v1-0.rar?fid=1000233074&ttl=1535869974&ri=8192&rs=8192&setec=4b07f7bf967cd86ab0b71f8790b34232"
    },
    {
      "fileId": "1000233831",
      "name": "Beautiful Hroki",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1345",
      "fileName": "Beautiful Hroki-81367-v1-1.rar",
      "uploadedUnix": "1484599996",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/4738cb081f281c8e4277cd8b2d6ba9874a4588677011aa7b137ddccf550651fa/analysis/1484600164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Beautiful%20Hroki-81367-v1-1.rar?fid=1000233831&ttl=1535869975&ri=8192&rs=8192&setec=1178557f16ab5099faaef40c7ceb7fe1"
    }
  ]
}