{
  "modId": 8139.0,
  "modName": "XDrugs",
  "summary": "A mod which creates a new Skooma, Double-Distilled Skooma, and Moon Sugar. They are for sale at Arcadias Cauldren in Whiterun. The new Skoomas add the drugged effect from the sleeping tree sap. The XSkooma lasts 5 minutes, the XDouble-Distilled lasts 10 minutes, and the XMoon Sugar lasts 2.5 minutes. Their is also some smaller effects on your Healt",
  "descriptionHtml": "A mod which creates a new Skooma, Double-Distilled Skooma, Shrooms, and Moon Sugar. They are for sale at Arcadias Cauldren in Whiterun. The new Skoomas add the drugged effect from the sleeping tree sap. The XSkooma lasts 5 minutes, the XDouble-Distilled lasts 10 minutes, the Shrooms last 4 minutes, and the XMoon Sugar lasts 2.5 minutes because it is unrefined. Their is also some smaller effects on your Health and Magicka, but they will not kill you at full health, or probably even at half health. The effects of each item is listed in the description where you buy it. There are 10 XDDSkoomas, 20 XSkoomas, and 10 XMS. They are all for sale at Arcadias under Potions and Ingredients for under $250.\r\n\r\n\r\n\r\n-----TO DO-----\r\nMarijuana, Tobacco, Meth, LSD\r\nSkooma Pipe\r\nMore trippy visuals\r\nA questline for obtaining the drugs as opposed to blatantly buying them\r\n\r\n-----RECENT CHANGES-----\r\nv1.2 - Added XShrooms to Arcadia\\'s store",
  "categoryId": "94",
  "version": "1.2",
  "author": "bwhitley57",
  "createdUnix": "1328670258",
  "updatedUnix": "1328671970",
  "containsAdultContent": false,
  "uploadedBy": "bwhitley57",
  "primaryFile": null,
  "files": [
    {
      "fileId": "26891",
      "name": "XDrugsMod",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "19",
      "fileName": "XDrugsMod-8139-1-2.zip",
      "uploadedUnix": "1328671970",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/3aad4aed7a12cd5b5fe499e174651e5dcfc6385e89366c987b27f2b69194119e/analysis/1406659687/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/XDrugsMod-8139-1-2.zip?fid=26891&ttl=1535766621&ri=8192&rs=8192&setec=1fb80a23c7cdaa7453fac3096d2858c4"
    }
  ]
}