{
  "modId": 81433.0,
  "modName": "A Study In D",
  "summary": "A personal take on the dwemer dissapearance theme. Linear freeform adventure mod focused on story and puzzles.",
  "descriptionHtml": "Teaser.\r<br />\r<br />&#34;I have no idea what happened to the Dwemer. I have no sense of them in the timeless divine world outside of mortal time. And, in fact, if I did believe they existed, I would be in no hurry to make contact with them. They may, with some justice, hold the Dunmer race responsible for their fate. My intuition is that they are gone forever -- and that is perfectly fine with me.&#34; -- Vivec\r<br />\r<br />In late 3E&#39; 4th century, a series of discoveries made by a loose group of like-minded mages and scholars across Tamriel has led them to believe in a possibility of a new insight into the events that led to the disappearance of the ancient Dwemer race. The efforts of that group had resulted in an expedition that had found itself approaching the slopes of the Red Mountain on Vvardenfell in 3E 414 and shortly after, vanished without a trace. While this occurrence along with other large-scale efforts to unravel the great Dwemer conundrum have been all but forgotten and abandoned due to numerous turbulences in modern history and studies on the Dwemer per se have been reduced to isolated and misguided attempts of a few self-centered individuals of dubious skill and intentions, it may well be that it would fall to but a single person, albeit one of unfathomable talent and dedication, a champion, of a kind, to discern the elusive edge between a truthful path and a road leading to inevitable peril, discovering and possibly making use of, the nature of those world-shaping forces behind one of the greatest known mysteries of all time.\r<br />\r<br />Design.\r<br />\r<br />This mod primarily attempts at two things:\r<br />\r<br />- Providing a plausible from a lore point of view explanation to the Dwemer disappearance. The explanation comes mostly in form of text or unvoiced dialogue, uncovered during playthrough.\r<br />\r<br />- Increasing variety and challenge of stock gameplay by adding puzzles, that are essentialy fairly basic combinatorics with occasional lateral thinking involved. For puzzle commentary & solutions please refer to [url=https://forums.nexusmods.com/index.php?/topic/5251465-a-study-in-d/#entry46689820]this post[/url].\r<br />\r<br />The structure is basically a series of caverns/ruins with a freeform approach; no displayed quests or quest markers, but a self-evident objective of surviving and finding a way out. As such, the playthrough may have a bit of a no-frills old school feel to it: while attempting to remain as user-friendly as possible, the mod will not tolerate obvious or intentional mistakes (such as jumping into lava or locking oneself behind a magical barrier); hopefully, this will encourage the player to be more aware of his/her actions and their consequences.\r<br />\r<br />Beta status.\r<br />\r<br />No game-breaking issues have been found during testing, but making a save prior to installing this mod to revert to if something goes terribly wrong, is, as always, highly recommended.\r<br />\r<br />Requirements. \r<br />\r<br />Fuz Ro D-oh - Silent Voice by shadeMe with its required SKSE, Skyrim with Dawnguard and Dragonborn.\r<br />\r<br />In-game soft requirements.\r<br />\r<br />As it should be obvious from the mod&#39;s location and theme, the player character must be able to handle Blackreach on chosen difficulty/rebalance setting, and should express certain interest in Dwemer lore, in form of having completed most of vanilla Skyrim&#39;s Dwemer-related quests. There are no hard checks for those quests&#39; completion, but the story can become somewhat less meaningful from role-playing point of view.\r<br />\r<br />Installation.\r<br />\r<br />There are no installation flavors. Use whatever method you prefer, as long as mod&#39;s files end up in corresponding folders and its .esp is activated.\r<br />\r<br />Updating.\r<br />\r<br />Uninstall the old version and install the new one, while meeting the requirements for both installation and uninstallation.\r<br />\r<br />Beginning.\r<br />\r<br />Use a back door in cell &#34;War Quarters&#34; in Blackreach.\r<br />\r<br />Uninstallation.\r<br />\r<br />The mod should have no active scripts once its main quest (exsd_qmain) stops, which should happen at the end of the mod&#39;s storyline. After finishing it, exit any of the mod&#39;s cells as well as &#34;War Quarters&#34; cell, save and uninstall. As a general rule though, it is recommended to revert to a save made prior to mod installation.\r<br />\r<br />Compatibility.\r<br />\r<br />Any mod that overwrites the cell blackreachzcell03 (&#34;War Quarters&#34;) is expected to conflict. A possible workaround is &#39;coc exsd_blackreachpre&#39; at the console. Any mod that overrides this mod&#39;s behaviour, like interfering with scenes or substantially modifying stock gameplay, is a potential threat. \r<br />\r<br />Known issues.\r<br />\r<br />1. Distracting a certain NPC while he&#39;s casting a potent spell may get the player char hurt.\r<br />Severity: inconsequential. Consider it an immersion feature. May get randomly resolved during upcoming development.\r<br />\r<br />Changelog.\r<br />0-1-2\r<br /> - Added a button in War Quarters Backroom to turn puzzle content on/off\r<br /> - Added an optional puzzle in Bhhtmrdramz Repository (former Reservoir)\r<br /> - Tweaked most puzzles and clues to be less vague\r<br /> - Minor fixes and additions\r<br />0-1-1 \r<br /> - Added a small puzzle blocking the elevator\r<br /> - Tweaked the first combat encounter\r<br /> - Minor fixes and additions\r<br />0-1-0 Initial release\r<br />\r<br />Credits.\r<br />\r<br />Schlangster - skyui-lib 1. The lib is used to allow this mod to process numerical user input. Packed with this mod per instructions at GitHub and with Schlangster&#39;s explicit permission.",
  "categoryId": "35",
  "version": "0.1.2",
  "author": "dnoah",
  "createdUnix": "1484151227",
  "updatedUnix": "1484633517",
  "containsAdultContent": false,
  "uploadedBy": "dnoah",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000233413",
      "name": "A Study In D v0-1-1",
      "version": "0.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1057",
      "fileName": "A Study In D v0-1-1-81433-0-1-1.7z",
      "uploadedUnix": "1484150364",
      "modVersion": "0.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/943f209541f2a49423a054a49cd7a98e61074fe193fe8e006b617c788638fe68/analysis/1484150703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Study%20In%20D%20v0-1-1-81433-0-1-1.7z?fid=1000233413&ttl=1535870032&ri=8192&rs=8192&setec=8741accc9863fcec342fe71c6572d5e9"
    },
    {
      "fileId": "1000233414",
      "name": "A Study In D v0-1-1 source scripts",
      "version": "0.1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "A Study In D v0-1-1 source scripts-81433-0-1-1.7z",
      "uploadedUnix": "1484150449",
      "modVersion": "0.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/fb114e0a8a4945b85a9ae3ab323e9d56dab2e7f8e3a81cd239031f0c9058af0b/analysis/1484150707/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Study%20In%20D%20v0-1-1%20source%20scripts-81433-0-1-1.7z?fid=1000233414&ttl=1535870032&ri=8192&rs=8192&setec=552d62064f7f8e7e539d832e3b7f9bf1"
    },
    {
      "fileId": "1000233873",
      "name": "A Study In D v0-1-2",
      "version": "0.1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1074",
      "fileName": "A Study In D v0-1-2-81433-0-1-2.7z",
      "uploadedUnix": "1484633470",
      "modVersion": "0.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/06ddc515acacd9626aa52bb1e0b6cae2dd88c2a497ef337eee4f804c1280b986/analysis/1484633823/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Study%20In%20D%20v0-1-2-81433-0-1-2.7z?fid=1000233873&ttl=1535870033&ri=8192&rs=8192&setec=b8dcb3717ffa385f48dfbf13e5dc2ced"
    },
    {
      "fileId": "1000233874",
      "name": "A Study In D v0-1-2 source scripts",
      "version": "0.1.2",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "9",
      "fileName": "A Study In D v0-1-2 source scripts-81433-0-1-2.7z",
      "uploadedUnix": "1484633517",
      "modVersion": "0.1.2",
      "virusScanUrl": "https://www.virustotal.com/file/99fba65ccfb5f7974c4544cbd15a1c906e353322f0e32bff5a8e0cf5eddf45ff/analysis/1484633824/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Study%20In%20D%20v0-1-2%20source%20scripts-81433-0-1-2.7z?fid=1000233874&ttl=1535870033&ri=8192&rs=8192&setec=be952a3c9b6dd2e33264a67f304b4e08"
    }
  ]
}