{
  "modId": 81475.0,
  "modName": "Redoran architecture resource",
  "summary": "Edited Redoran architectures meshes. One main room, two sets of stairwell ends, one extended hallway and one extended alcove.",
  "descriptionHtml": "The standard tileset for Redoran architecture in Dragonborn was *very* sparse. This resource hopefully adds to the possibilities. It&#39;s still all in the bug hut theme, which I&#39;m lukewarm about. This is a resource only. You&#39;ll have to add the meshes in via the CK. Requires legal copies of Skyrim and Dragonborn DLC (see permissions tab).\r<br />\r<br />- One large room with a standard interior exit on either end.\r<br />- One alcove extended about 25%, making it more fit for a small bedroom than the standard alcove.\r<br />- One extended length hallway. Maybe not much use, but I had to create it anyway to get one of the stairwell pieces working.\r<br />- Two sets of stairwell exits/entrances. One is in a hallway with exits at either end of the hallway. The other is in an enclosed room. The enclosed version will work with 128 grid snaps, but you&#39;ll have to use 8 grid snaps to get the stairwell to fit it.\r<br />\r<br />All of the tiles fit 128 grid snaps except as noted above. In my testing there is probably a little bit of seam visible in the large room, but only if you&#39;re nitpicky.\r<br />\r<br />Editing was all done in Nifskope and collision added with Chunkmerge function of Nifutils. All hail that team of developers.\r<br />\r<br />",
  "categoryId": "22",
  "version": "1.0",
  "author": "anothersunday",
  "createdUnix": "1484317610",
  "updatedUnix": "1484317600",
  "containsAdultContent": false,
  "uploadedBy": "grimjaw5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000233550",
      "name": "redoranarchitecture.zip",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "324",
      "fileName": "redoranarchitecture.zip-81475-1-0.zip",
      "uploadedUnix": "1484317600",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3a85d92387daeffca8e80c4a7f5691f33d3571395ad22e2fb578b1d4c2c40264/analysis/1484317862/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/redoranarchitecture.zip-81475-1-0.zip?fid=1000233550&ttl=1535870084&ri=8192&rs=8192&setec=d0c5932580e5068a7c00d115f7960911"
    }
  ]
}