{
  "modId": 81512.0,
  "modName": "Do&#39;Bassa",
  "summary": "Very Stealthy follower that sometimes uses a bow but usually fights with his claws.",
  "descriptionHtml": "Do&#39; Bassa, your Khajiit Nightingale follower&#33;  Ok, he&#39;s not really a Nightingale.  He killed a Nightingale and thought the armor looked cool so now he&#39;s wearing it.  Except for the  helmet, he threw that away after exclaiming &#34;This headgear is crushing my ears.&#34;\r<br />\r<br />I like stealthy punch cats and punch lizards as followers but sometimes a follower with some archery skill is handy.  Do&#39;Bassa is just as sneaky as Do&#39;Shaar and punches almost as hard as Jeek.  \r<br />\r<br />Build up your own sneak skills and you&#39;ll find he&#39;s extremely efficient at eliminating any lone adversary.   Work your way behind someone then order Do&#39;Bassa to attack.  If he can he&#39;ll quietly dispatch his target with a choke hold without raising any alarms.  Do&#39;Bassa will use his bow if the enemy is far away.  \r<br />\r<br />Do&#39;Bassa uses some game setting adjustments, his own combat style and some kill move tweaks.  Other mods that alter these settings may cause a conflict.   Tested OK with Dawnguard,  Dragonborn, EFF and a long list of other mods.  Do&#39;Bassa is a modified version of Do&#39;Shaar whispering fangs and uses elements from Jeek Half-Dragon.  He may not play nicely with these mods.  Seems OK with Jeek haven&#39;t tested him with Do&#39;Shaar.\r<br />\r<br />Do&#39;Bassa requires nothing more than Skyrim with the official update.  Images show Do&#39;Bassa with these mods (I think)  Muscular Khajiit Textures http://www.nexusmods.com/skyrim /mods/40043/  and  Bulky Skeleton for Beast Race http://www.nexusmods.com/skyrim/mods/61132/.  \r<br />\r<br />To eliminate the arrow quiver on his back when invisible use the Auto Unequip Ammo mod http://www.nexusmods.com/skyrim/mods/10753/ with follower package box checked.\r<br />\r<br />You&#39;ll find Do&#39;Bassa in Bronze Water Cavern. \r<br />\r<br />Thank you to Ominousvoice who posted the WeaponPushEffect script for knockback without making some targets immortal.  It&#39;s much cleaner than the workaround I was using.  I make no claims on anything in this mod.  Use abuse, modify and enjoy, or not, as you see fit.",
  "categoryId": "96",
  "version": "R2",
  "author": "GrumpyMule",
  "createdUnix": "1484501961",
  "updatedUnix": "1485027527",
  "containsAdultContent": false,
  "uploadedBy": "GrumpyMule",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000234295",
      "name": "Do&#39;Bassa R2",
      "version": "R2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "175",
      "fileName": "Do'Bassa-81512-R2.7z",
      "uploadedUnix": "1485027527",
      "modVersion": "R2",
      "virusScanUrl": "https://www.virustotal.com/file/737ceaa48db4176e77999bd893ef4104e1e39d5227c8011a7abbe66435cd8d0a/analysis/1485027782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Do%27Bassa-81512-R2.7z?fid=1000234295&ttl=1535870127&ri=8192&rs=8192&setec=8351db40a9fcf1c3b2eb758740da666f"
    }
  ]
}