{
  "modId": 81529.0,
  "modName": "Slicker Dual Wield Animation",
  "summary": "All I have done here is put replaced three of the Dual Wield Animations with the One Handed one that corresponds to it. It might seem strange but if you look at the pictures you will see it is much better.",
  "descriptionHtml": "Basically I despise the crappy Ninja style animation with the rear sword held behind in the air like some eastern samurai. It is just crap and unrealistic but also I find it very distracting when playing because the character is adjusting to that position all the time to bring their hands up to that unnatural position.\n<br />\n<br />I did not replace the attack animations so the left hand ones will look slightly odd as the character brings their rear hand up at the very end of the animation then drops it down but it is barely noticeable because it happens very fast.\n<br />\n<br />Also I did not actually have to create a new animation but simply used already existing ones.\n<br />\n<br />So, if you don't want your Norse Warrior to look like some Naruto wannabe or if you just hate the distracting Preying Mantis Hidden Tiger animation but have not gone for a full on DW overhaul then this simple (esp-less) mod could be what you need :)\n<br />\n<br />Please see the images\n<br />\n<br />cheers\n<br />\n<br />Roh",
  "categoryId": "51",
  "version": "1",
  "author": "RohZima",
  "createdUnix": "1484567187",
  "updatedUnix": "1484592393",
  "containsAdultContent": false,
  "uploadedBy": "RohZima",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000233812",
      "name": "DW Anim Replacer",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40",
      "fileName": "DW Anim Replacer-81529-.zip",
      "uploadedUnix": "1484592393",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f806f113fa21d5e1e6f874485330b0f710888b260d022d05ccd3facfdc3dd34b/analysis/1484592550/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DW%20Anim%20Replacer-81529-.zip?fid=1000233812&ttl=1535870149&ri=8192&rs=8192&setec=43307cfda4a675b84bff9e3f47263832"
    }
  ]
}