{
  "modId": 8153.0,
  "modName": "Craftable and Upgradable Uniques",
  "summary": "Adds the ability to craft and upgrade armor and weapons which were previously not able to craft.",
  "descriptionHtml": "Hey guys, I appreciate the suggestions but I dont think I can update this mod with so many other mods doing the same thing better. I may have been first (or close to it) to the idea but other mods are far more comprehensive and balanced. Heck, I use them over my own mod! If you can suggest ways to make it different, then Ill be glad to work on it. : )\r\n\r\nCraftable Uniques\r\nCurrent Version: V b.04 (02.08.2012)\r\nAuthor: Cracka Jax (Thorhammer91)\r\nUploader: Cracka Jax\r\n\r\nATTN: If something is not upgradable or does not show up in inventory or is not enchantable PLEASE LET ME KNOW!! Also if there is something that is not on the list that you want added PLEASE LET ME KNOW!!\r\n\r\nAdds craftable and unenchanted unique and previously uncraftable items like the Ebony Mail and Wuuthrad to Skyrim\\'s forges. All items will be crafted as unenchanted and will have no visual effects but base stats will remain the same. Currently, the reciepes will be similar to comparable craftable items. Crafting will require applicable crafting skill in skill tree (Ebony Mail will require Ebony Smithing etc.)\r\n\r\nCurrently craftable:\r\nScimitar\r\nBlades Armor and Sword\r\nSilver Weapons\r\nDawnbreaker (as Soul Forged Sword, only craftable at Skyforge)\r\nEbony Mail\r\nHelm of Yngol (as Ornate Nordic Helm)\r\nWuuthrad (as Ornate Nordic Battleaxe)\r\nEbony Blade (as Ebony Katana)\r\nTheives Guild Set (as Full Leather set)\r\nTheives Guild Variant Set (as White Leather set)\r\nTheives Guild Leader Set (as Hardened Leather set)\r\nRueful Axe (as Heavy Battleaxe)\r\nNightingale Set (as Void Leather set) \r\nArrows\r\nMehrunes Razor (as Ornate Dagger)\r\nHeadsman\\'s Axe\r\n\r\nPlanned:\r\nDragon Priest Masks (as Corresponding Material Mask)\r\n\r\nChangelog (Newest to oldest):\r\nV b.05 02.11.2012 -- Added Arrows, Ornate Dagger, Headsman\\'s Axe, Soul Forge Sword, Void Leather set, Heavy Battleaxe, Blades Armor and Weapons, Silver Weapons, Scimitar\r\nV b.04 02.08.2012 -- Fixed an issue where some armors were not playable.\r\nV b.03 02.07.2012 -- Added Theives Guild sets, Ebony Katana, and Ornate Nordic Helm\r\nV b.02 02.07.2012 -- Added effectless Wuuthgrad (Appears as Ornate Nordic Axe to protect lore friendliness) and Temerping functionality for Ebony Mail and Ornate Nordic Axe\r\nV b.01 02.07.2012 -- Added effectless and unenchanted Ebony Mail to craft list. \r\n\r\nRequirements:\r\nNone\r\n\r\nPlease alert me of any incomplatibilities. \r\n\r\nCredits:\r\nBethesda Softworks\r\nValve",
  "categoryId": "36",
  "version": ".05b",
  "author": "Cracka Jax",
  "createdUnix": "1328676046",
  "updatedUnix": "1328995549",
  "containsAdultContent": false,
  "uploadedBy": "spartan 368",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29167",
      "name": "05b",
      "version": "05b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "05b-8153-05b.7z",
      "uploadedUnix": "1328995549",
      "modVersion": "05b",
      "virusScanUrl": "https://www.virustotal.com/file/65039fbc7cb26bf394006cc0167ce1026c5ecac8c377c940a246ce9f61cd1b4e/analysis/1406671092/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/05b-8153-05b.7z?fid=29167&ttl=1535766638&ri=8192&rs=8192&setec=aac0b1e2d51aeea117bc538353964c0b"
    }
  ]
}