{
  "modId": 81649.0,
  "modName": "kryptopyr&#39;s Patch Hub",
  "summary": "A central location for any compatibility patches I&#39;ve created for my mods.  I&#39;ll also try to provide updated links to patches available elsewhere.",
  "descriptionHtml": "\r<br />\r<br />[u]Abbreviations:[/u]\r<br />[b]WAFR [/b]= Weapons & Armor Fixes Remade\r<br />[b]CCF[/b] = Clothing & Clutter Fixes\r<br />[b]CCOR[/b] = Complete Crafting Overhaul Remade\r<br />[b]SPOR[/b] = Smithing Perks Overhaul Remade\r<br />[b]CACO[/b] = Complete Alchemy & Cooking Overhaul\r<br />\r<br />Patches listed in [color=#6aa84f]green[/color] can be found on the downloads section of this page.  When possible, I&#39;ve tried to provide links for other known patches.\r<br />Mods in red have known conflicts with the listed mod, but no patches currently exist. \r<br />\r<br />*Mod abbreviations followed by an asterisk indicate that the patch makes edits consistent with that mod, but the mod is not required to use the patch.\r<br />For example:  &#34;Immersive Weapons: [color=#38761D][color=#6aa84f]Patch for [b]WAFR[/b]/CCF*/CCOR*[/color][/color]&#34; means that this patch should definitely be used if Immersive Armors is installed alongside WAFR, but it will also resolve any inconsistencies directly related to CCF and CCOR.  However, CCF and CCOR are not required in order to use this patch.\r<br />\r<br />If a patched mod has a known conflict with another of my mods (which isn&#39;t included in the patch), then this will also be noted.  Therefore, if one of my mods is not mentioned with regard to the patch, then either it does not conflict or I am not aware of any conflict.\r<br />\r<br />DISCLAIMER:  All patches listed here are provided as-is.  I will attempt to maintain this page to the best of my ability, but I cannot guarantee that all information is 100% accurate and up-to-date.  In most cases, I have not personally reviewed those patches created by other people, and I do not provide support for those patches.  Links to other patches are provided here for your convenience only.  If you have questions or find bugs related to any patch not provided in the downloads section of this page, then please contact the patch author on the appropriate page with your questions or concerns.  \r<br />\r<br />Example format:\r<br />[mod name]: [color=#38761D][color=#6aa84f]Patch for WAFR/CCF/CCOR[/color]\r<br />[color=#38761D][color=#38761D][color=#6aa84f][color=#ffffff][mod name]: [color=#6fa8dc][u]Patch for WAFR/CCF (link to external patch)[/u][/color]\r<br />[/color][/color][/color][/color][/color][mod name]: [color=#38761D][color=#6aa84f]Patch for WAFR/CCF/SPOR[color=#ffffff], [color=#ff0000]no known patch for CACO[/color]\r<br />[mod name]: No patch needed, automatically compatible with WAFR/CCF/CCOR[/color][/color][/color]",
  "categoryId": "84",
  "version": "1.0",
  "author": "kryptopyr and others",
  "createdUnix": "1484938668",
  "updatedUnix": "1484938668",
  "containsAdultContent": false,
  "uploadedBy": "kryptopyr",
  "primaryFile": null,
  "files": []
}