{
  "modId": 81735.0,
  "modName": "Sonir-modified-TestMod",
  "summary": "This is a small mod that should be changing the hireable bard Sonir (Windstead) a little, along with the the other people and animals connected to the player homes.",
  "descriptionHtml": "Okay, this is my first mod and its a risky one. Risky because my computer isn&#39;t able to handle Skyrim properly so I can&#39;t test my mods myself. So if you test it out and find bigs please report them here. As soon as I have the time I will try to fix and improve this mod.\r<br />\r<br />What is this mod supposed to do?\r<br />Its main use is to improve the bard Sonir a little. Since I was already on it, I also modified the Hearthfire huscarls, Hearthfire-Children and pets a little. To be more specific: The huscarls, the HF-CHildren and their pets now level for a while with the player. Meaning when a giant, vampire, bandit or whatever attacks one of them there is an actuel chance for a real fight. Since I made not all level with the player I recommend that you only count on Sonir. Also they should ignor more likly crimes they witness the player doing. My original hope was to make them ignor the player transforming into a vampire lord or a werewolf. So this is the main change that I made on your staff and family. But I am not sure my changes were enough for that.\r<br />To make it clear, I changed nothing about looks or equitment to anyone else than Sonir.\r<br />\r<br />\r<br />Language note: Since my game is in german and I&#39;m new to modding there will may be german in the file as well. I tried to do everything in english but din&#39;t change any dialog or excisting texts.\r<br />\r<br />Hope their is still something to enjoy for all the brave downloaders. ;)",
  "categoryId": "67",
  "version": "",
  "author": "Diilsoszaam",
  "createdUnix": "1485271760",
  "updatedUnix": "1485271715",
  "containsAdultContent": false,
  "uploadedBy": "Diilsoszaam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000234548",
      "name": "Sonir-modifiedTestMod",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12",
      "fileName": "Sonir-modifiedTestMod-81735-.zip",
      "uploadedUnix": "1485271715",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/e8f1c7fcb1b775aa3cb1afec7390f631f801395c004d79f0a1bb8d3cd20612bc/analysis/1485271982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sonir-modifiedTestMod-81735-.zip?fid=1000234548&ttl=1535870356&ri=8192&rs=8192&setec=84c2cf3261fd332fcdd6eac8f2aabc5c"
    }
  ]
}