{
  "modId": 81809.0,
  "modName": "Skyrim Unbound (Alternate Start) FR",
  "summary": "Un autre mod de départ avec un large éventail d&#39;options, y compris la possibilité de jouer comme un personnage non-Enfant de dragon.",
  "descriptionHtml": "[b][color=#ffff00]Plutôt que de commenter, suivre, ou endorser ce mod, la chose que je vous demande le plus, c&#39;est de &#34;tester&#34; ce mod avec moi (je l&#39;ai testé de mon côté et j&#39;en ai fait la relecture comme j&#39;ai pu).\r<br />Si jamais des erreurs de traductions restent, merci de me le notifier par MP de préférence. Comme à chaque fois, j&#39;essaye de faire de mon mieux. Bon jeu à vous, et merci encore. - Setvi[/color]\r<br />\r<br />Un autre mod de départ avec un large éventail d&#39;options, y compris la possibilité de jouer comme un personnage non-Enfant de dragon.\r<br />\r<br />[color=#ffff00]Skyrim Unbound SE est maintenant disponible pour PC et XBox One via Bethesda.net&#33; (Pas de version SE traduite pour le moment, et je ne souhaite pas traduire ce mod SE pour le moment).[/color]\r<br />\r<br />Skyrim Unbound (Bordeciel Libéré dans cette présente traduction) est un mod de départ alternatif avec un large éventail d&#39;options. Il permet au joueur de sauter la séquence d&#39;ouverture, de choisir de jouer ou non comme Enfant de dragon et d&#39;avoir un contrôle total sur les générations de dragon. Les premiers chapitres de la quête principale ont été contournés (et effectivement supprimés), ce qui signifie que vous n&#39;avez plus besoin d&#39;obtenir la Pierre de dragon pour Farengar ou de vaincre Mirmulnir pour le Jarl de Blancherive. Si vous voulez jouer comme l&#39;Enfant de dragon et terminer la quête principale, tout ce que vous avez à faire est d&#39;absorber une âme de dragon et vous serez convoqué au Haut Hrothgar par les Grises-barbes.\r<br />\r<br />[color=#ffff00]Des questions? Lisez le reste de la description du mod et de la FAQ. Lisez les discussions au Workshop de Steam. (En Anglais).[/color]\r<br />\r<br />Bien que Skyrim Unbound ne soit pas conçu pour être utilisé avec des sauvegardes préexistantes, il doit fonctionner sans aucun Mot/mur de pouvoir ou d&#39;absorption d&#39;âme. Faites-le à vos risques et périls et sauvegardez une sauvegarde.\r<br />\r<br />Autres caractéristiques:\r<br />\r<br />-Choisissez vos armes de départ, votre équipement, vos sorts et votre capacité/pierre (MCM uniquement)\r<br />-Choisissez parmi des dizaines d&#39;emplacements de départ dans chaque châtellerie, ville, village et auberge (et plus)\r<br />-Basculer pour des dragons, dragon généré aléatoirement, absorption d&#39;âme de dragon, et cri ; ou non\r<br />-Évitez d&#39;être forcé à faire la quête principale pour les personnages non-Enfant de dragon\r<br />-Jouez la quête de la Guerre Civile dès le début du jeu\r<br />-Etre Enfant de dragon n&#39;est plus obligé pour terminer la Guerre Civile\r<br />-Les personnages non-Enfant de dragon peuvent utiliser les options pour &#34;devenir&#34; Enfant de dragon à n&#39;importe quel moment du jeu\r<br />-Suppression du dialogue PNJ référant le joueur comme &#34;Enfant de dragon&#34; sauf si la quête principale a été lancée\r<br />-Suppression du dialogue du joueur concernant l&#39;expérience de l&#39;attaque contre Helgen\r<br />-Commencez le jeu comme un vampire ou un loup-garou (MCM uniquement)\r<br />-Choisissez l&#39;heure de début de la journée (MCM uniquement)\r<br />-Changez dynamiquement votre faction entre Impérial, Sombrage, Bandit ou Parjure (MCM uniquement)\r<br />\r<br />[u]LE MENU DU MOD ET SA CONFIGURATION[/u]\r<br />\r<br />Le MCM est une caractéristique de SkyUI. Skyrim Unbound n&#39;exige pas que SkyUI fonctionne. Toutefois, avec lui correctement installé, vous pouvez plus facilement basculer les paramètres pendant le jeu et avoir un meilleur contrôle sur vos options de départ. Assurez-vous de bien lire la description du mod SkyUI.\r<br />\r<br />Si vous n&#39;utilisez pas SkyUI, vous obtiendrez un menu pop-up d&#39;options au début du jeu. Vous obtiendrez également un pouvoir qui vous permet de basculer les options pendant le jeu.\r<br />\r<br />[u]SPAWNS DE DRAGON[/u]\r<br />\r<br />Bien que Skyrim Unbound ne règle pas combien de fois les dragons spawns, le gameplay commence avec eux initialement désactivés. (Cela peut être modifié dans les options/MCM.) Par défaut, les dragons et les murs/mots de pouvoir deviennent actifs après quelques semaines de temps de jeu. Au bout de quelques semaines, les attaques au hasard deviennent actives. La longueur de ce délai peut également être modifiée dans le MCM.\r<br />\r<br />Au lieu d&#39;un retard temporisé, les dragons peuvent être réglés pour commencer à spawns quand le joueur atteint des niveaux spécifiés (MCM seulement).\r<br />\r<br />[u]PERSONNAGES NON-ENFANTS DE DRAGON[/u]\r<br />\r<br />Les joueurs qui ne veulent pas être l&#39;Enfant de dragon peuvent désactiver l&#39;absorption d&#39;âme. Les personnages non-Enfant de dragon ont encore la possibilité d&#39;apprendre à crier à partir des murs/des mots de pouvoir ; dans ce cas de nouveaux mots seront automatiquement déverrouillés au lieu de coûter des âmes de dragon.\r<br />\r<br />En bonus, il existe une option dans le MCM pour permettre le déverrouillage automatique de tous les cris, même pour les personnages Enfant de dragon. Vous trouverez peut-être cela utile si vous avez d&#39;autres mods qui utilisent des âmes de dragon de manières différentes. (MCM seulement).\r<br />\r<br />[u]THANE DE BLANCHERIVE[/u]\r<br />\r<br />Douce-brise est maintenant disponible à l&#39;achat dès le début du jeu, mais le prix a été doublé afin de compenser les quêtes contournées normalement requises pour la déverrouiller. Lorsque vous achetez Douce-brise, vous deviendrez Thane de Blancherive et Lydia deviendra votre husecarl.\r<br />\r<br />[u]FACTIONS[/u]\r<br />\r<br />Le menu d&#39;options spéciales MCM de Skyrim Unbound a quatre choix de faction disponibles à n&#39;importe quel moment pendant le jeu: Impérial, Sombrage, Bandit, ou Parjure. Si vous choisissez l&#39;une des factions de la guerre civile, l&#39;armée adverse vous attaquera à vue. Si vous choisissez Bandit ou Parjure, les gardes et les soldats deviendront hostiles envers votre personnage, mais les autres membres de la faction de laquelle vous faites partie vous traiteront comme l&#39;un des leurs. Ceci est entièrement compatible avec tout mod qui édite les factions. Le MCM peut et doit être utilisé chaque fois que des changements sont souhaités ou si la neutralité doit être restaurée. (MCM seulement).\r<br />\r<br />[u]DIFFÉRENCES ENTRE SKYRIM UNBOUND ET VIVRE UNE AUTRE VIE[/u]\r<br />\r<br />Skyrim Unbound\r<br />\r<br />-Conçus pour le jeu de rôle générique\r<br />-Plus de contrôle sur les détails de départ, plus de liberté de choix\r<br />-Ne permet que les personnages normaux\r<br />-Les quêtes de faction doivent être lancées normalement\r<br />-Contourne le début de la quête principale, active La technique de la voix quand un dragon est tué et l&#39;âme absorbée\r<br />-Le Joueur peut finir la quête de la guerre civile sans rencontrer de dragons ou être Enfant de dragon\r<br />\r<br />Vivre une autre vie\r<br />\r<br />-Comprend des backstories de personnages\r<br />-Les choix de départ peuvent avoir des effets durables ou permanents sur le jeu, les factions, les allégeances, etc.\r<br />-Permet de jouer comme des personnages inhabituels tels qu&#39;un Bandit, Thalmor, Parjure, et etc.\r<br />-Certains personnages commencent avec des quêtes de faction actives\r<br />-Active la quête principale entièrement quand le joueur visite Helgen\r<br />-Le Joueur doit battre Mirmulnir et devenir Enfant de dragon pour terminer la guerre civile\r<br />\r<br />-Aucun DLC n&#39;est nécessaire à l&#39;inverse je crois de Vivre une autre vie.\r<br />\r<br />[u]COMPATIBILITÉ DLC[/u]\r<br />\r<br />Skyrim Unbound est entièrement &#34;DLC compatible&#34;. Aucun DLC n&#39;est nécessaire à l&#39;inverse je crois de Vivre une autre vie.\r<br />\r<br />Dragonborn (DLC) = Bien que pour Dragonborn la quête ne puisse pas être complétée par un personnage non-Enfant de dragon, elle peut encore être lancée. Il est recommandé de changer votre personnage en Enfant de dragon une fois que la quête commence ou d&#39;utiliser un mod comme Timing is Everything pour le reporter indéfiniment.\r<br />\r<br />[u]MOD ET COMPATIBILITÉ[/u]\r<br />\r<br />Si vous pensez que Skyrim Unbound peut être incompatible avec d&#39;autres mods que vous exécutez, placez-les en dessous de ceux-ci dans votre ordre de chargement. Notamment: (Les noms FR peuvent varier) =\r<br />\r<br />-Patch non officiel Skyrim: Skyrim Unbound doit absolument être inférieur à l&#39;USKP ou USLEEP dans votre ordre de chargement. Si ce n&#39;est pas le cas, il y aura des conséquences en jeu.\r<br />-Révision du dialogue de garde: Comme avec l&#39;USKP, Skyrim Unbound doit être au plus faible. Vous pouvez entendre des références aléatoires concernant le Dragonborn dès le début du jeu, mais aucun d&#39;eux ne sera dirigé vers le joueur.\r<br />-Alternate Start - Vivre une autre vie: Skyrim Unbound n&#39;est pas compatible avec les autres mods de démarrage alternatifs. Si vous voulez jouer comme un personnage non-Dragonborn avec LAL, utilisez Vous n&#39;êtes pas le Dragonborn ou Dans votre ombre.\r<br />-Révision de la création de caractères: Skyrim Unbound inclut un check pour CCO. Bien que le système de «classe» dans Skyrim Unbound ne soit pas lié au système de classe de CCO, le menu des notions de naissance de Skyrim Unbound sera désactivé si CCO est installé afin d&#39;éviter les conflits.\r<br />-Open Cities Skyrim: Un patch de compatibilité peut être téléchargé ici. (Voir page Skyrim Unbound non traduit).\r<br />-Alchimie complète et révision de la cuisine: CACO ne modifie plus le NPC du joueur et devrait être entièrement compatible.\r<br />-Mods De Dragon: Placez Skyrim Unbound après tous les mods qui modifient les dragons, surtout si ces mods contiennent des modifications au fichier dragonactorscript.pex. Tout mod qui modifie ce fichier entraînera l&#39;échec des options dragon de Skyrim Unbound et empêchera la quête principale de démarrer. Skyrim Unbound inclut le Dragon Stalking Fix.\r<br />-Tous les mods qui éditent le NPC Player seront incompatibles, bien que très peu de mods le fassent. Il existe actuellement un script de compatibilité inclus pour Balanced Magic. Si vous avez un autre mod qui édite le NPC Player et nécessite que l&#39;édition fonctionne, chargez-le après Skyrim Unbound. (Les seules caractéristiques de Skyrim Unbound qui ne fonctionnera pas dans ce cas est l&#39;élimination des sorts de démarrage de la Flamme et de la Guérison/Soin pour les personnages non magiques. Voir l&#39;entrée Complète de l&#39;Alchimie et de la Révision de la cuisine ci-dessus pour des informations sur la façon de corriger cela.)*\r<br />\r<br />Si vous voulez vraiment savoir si un mod est compatible / incompatible, utilisez TES5Edit. N&#39;importe qui adepte de modding & de Skyrim sur PC devrait savoir comment utiliser cet outil.\r<br />\r<br />[u]LES DIRECTIVES QUI SUIVENT SONT PROPRES AUX MODDEURS ET/OU AUX GAMEURS\r<br />SACHANT CE QU&#39;ILS FONT MERCI D&#39;EN PRENDRE NOTES JE NE SAURAIS ETRE TENU RESPONSABLE\r<br />\r<br />TWEAKS[/u]\r<br />\r<br />Afin d&#39;éviter que vos mains soient liées pendant la création du personnage et de désactiver les messages du didacticiel au début du jeu, ajoutez les lignes suivantes à votre Skyrim.ini:\r<br />\r<br />[Interface]\r<br />sPosePlayerRaceSexMenu=\r<br />bShowTutorials=0\r<br />\r<br />[u]DÉMARRAGE RAPIDE[/u]\r<br />\r<br />La variable globale skyrimunboundquickstart a trois valeurs:\r<br />\r<br />0 - désactivé (par défaut)\r<br />1 - démarrage aléatoire complet, ignorant les titres d&#39;ouverture et les options\r<br />2 - départ normal, sauter les titres d&#39;ouverture\r<br />\r<br />[u]DÉPANNAGE[/u]\r<br />\r<br />À moins que je puisse reproduire le problème, votre configuration soit incorrecte ou que vous rencontrez un conflit de mod. Avant de demander de l&#39;aide, veuillez vous assurer que:\r<br />\r<br />Vous comprenez le problème de base du mod Skyrim. Si vous êtes nouveau en modding, vous voudrez bien commencer à &#34;googler&#34; des choses qui ne sont pas spécifiques à ce mod au lieu de demander de l&#39;aide ici.\r<br />Skyrim Unbound est téléchargé, installé, activé et vous utilisez la dernière version.\r<br />Skyrim Unbound est ci-dessous (chargé après) tous les mods potentiellement conflictuels dans votre ordre de chargement.\r<br />Si vous utilisez SkyUI, vous avez installé SKSE correctement et lancez le jeu avec skse_loader.exe.\r<br />Vous avez essayé de lancer un nouveau jeu (sans charger une sauvegarde, même si c&#39;est au début du jeu) pour vous assurer que les fonctionnalités fonctionnent (les mises à jour ne prendront parfois pas effet autrement).\r<br />Vous avez essayé de l&#39;exécuter avec tous les autres mods désactivés (RENOMMEZ TEMPORAIREMENT VOTRE DOSSIER SCRIPTS DANS CETTE SITUATION Et assurez-vous que vous avez le fichier Skyrim Unbound.bsa installé) pour vous assurer qu&#39;il n&#39;y a pas de conflits.\r<br />\r<br />Si vous avez des problèmes avec le mod après la mise à jour, essayez ce qui suit:\r<br />\r<br />Chargez vos dernières sauvegardes\r<br />Ouvrez la console et tapez &#34;stopquest SkyrimUnbound&#34; et &#34;stopquest SkyrimUnboundMCM&#34;\r<br />sauvegarder et quitter\r<br />Désactiver Skyrim Unbound\r<br />Charger la dernière sauvegarde\r<br />Sauvegarder et quitter\r<br />Activer Skyrim Unbound\r<br />Charger la dernière sauvegarde\r<br />Ouvrez le MCM (ou utilisez le pouvoir des options Skyrim Unbound si vous n&#39;êtes pas utilisateur de SkyUI)\r<br />Ajustez vos paramètres\r<br />\r<br />Obtenir que le Menu MCM soit rafraîchit peut prendre un moment ou alors l&#39;ouvrir et le fermer à nouveau.\r<br />\r<br />[u]DÉPANNAGE STANDARD DE SKYRIM[/u]\r<br />\r<br />Désactivez tous les mods sauf celui que vous souhaitez tester ou celui qui ne fonctionne pas correctement.\r<br />Commencer un nouveau jeu. Testez la fonction en question.\r<br />2a: Si cela fonctionne, passez à l&#39;étape 3.\r<br />2b: S&#39;il ne fonctionne pas, assurez-vous que vous n&#39;avez pas de scripts dans votre dossier de données / scripts autres que ceux requis par le mod (y compris les scripts SKSE). Commencez un nouveau jeu et testez à nouveau. Si cela fonctionne, passez à la section DÉPANNAGE DES SCRIPTS. Si cela ne fonctionne pas, il n&#39;y a pas de conflit clair et le mod peut avoir un bogue.\r<br />Activez la moitié de vos mods désactivés. Commencez un nouveau jeu et testez à nouveau.\r<br />3a: Si cela fonctionne, continuez l&#39;étape 3 jusqu&#39;à ce que vous puissiez recréer le problème.\r<br />3b: Si cela ne fonctionne pas, désactivez la moitié des mods que vous avez activés et continuez jusqu&#39;à ce que le problème s&#39;arrête.\r<br />\r<br />Grâce à ce processus, vous pouvez éliminer de grands groupes de mods qui ne sont pas en conflit jusqu&#39;à ce que vous pouvez commencer à tester celui en question contre lequel les mods individuels rencontrent un problème. \r<br />\r<br />Finalement, vous devriez être en mesure de trouver la source du conflit.\r<br />\r<br />[u]DÉPANNAGE DES SCRIPT[/u]\r<br />\r<br />Déplacez la moitié des scripts initialement installés dans votre dossier de scripts. Commencez un nouveau jeu et testez à nouveau.\r<br />1a: Si cela fonctionne, continuez l&#39;étape 1 jusqu&#39;à ce que vous puissiez recréer le problème.\r<br />1b: Si cela ne fonctionne pas, annulez le déplacement et répétez l&#39;étape 1 avec la moitié des scripts que vous avez essayés avant et continuez jusqu&#39;à ce que le problème s&#39;arrête.\r<br />\r<br />L&#39;objectif est d&#39;affiner rapidement les scripts potentiels jusqu&#39;à ce que vous trouviez la source du problème.\r<br />\r<br />[u]DROITS[/u]\r<br />\r<br />Ce mod & traduction est soumis aux droits en vigueur pour Skyrim Unbound.\r<br />Si la version actuelle de ce mod venait à changer et à restée non-traduite dans sa nouvelle version pendant des mois/années, vous avez le droit de mon côté de reprendre ma traduction et de la mettre à jour, sauf indication(s) contraire(s).\r<br />\r<br />[u]TEST[/u]\r<br />\r<br />[color=#ffff00]Plutôt que de commenter, suivre, ou endorser ce mod, la chose que je vous demande le plus, c&#39;est de &#34;tester&#34; ce mod avec moi (je l&#39;ai testé de mon côté et j&#39;en ai fait la relecture comme j&#39;ai pu).\r<br />Si jamais des erreurs de traductions restent, merci de me le notifier par MP de préférence. Comme à chaque fois, j&#39;essaye de faire de mon mieux. Bon jeu à vous, et merci encore. - Setvi[/color][/b]",
  "categoryId": "24",
  "version": "5.15TESTFR",
  "author": "chinagreenelvis et setvi pr la vf",
  "createdUnix": "1485562529",
  "updatedUnix": "1485714108",
  "containsAdultContent": false,
  "uploadedBy": "SETVI",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000234800",
      "name": "SU",
      "version": "5.15TESTFR",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4172",
      "fileName": "SU (FR)-81809-5-15TESTFR.rar",
      "uploadedUnix": "1485561440",
      "modVersion": "5.15TESTFR",
      "virusScanUrl": "https://www.virustotal.com/file/0eeaaaebdd11acc526b2b230ca04fc62c13b184174c45cc2817a1dc79b37c6d8/analysis/1485561723/",
      "changelogHtml": " Version 5.15TESTFR initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SU%20%28FR%29-81809-5-15TESTFR.rar?fid=1000234800&ttl=1535870439&ri=8192&rs=8192&setec=ed9bf0267513357586671bfae86c868f"
    },
    {
      "fileId": "1000234843",
      "name": "SU (ESP-BSA)",
      "version": "5.15TESTFR",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3506",
      "fileName": "SU (ESP-BSA)-81809-5-15TESTFR.rar",
      "uploadedUnix": "1485596271",
      "modVersion": "5.15TESTFR",
      "virusScanUrl": "https://www.virustotal.com/file/eb863dd31ec8183bb9d475496f2114f8e17bff43a7fdbf4825b6b750248b1001/analysis/1485596463/",
      "changelogHtml": " Version 5.15TESTFR initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SU%20%28ESP-BSA%29-81809-5-15TESTFR.rar?fid=1000234843&ttl=1535870439&ri=8192&rs=8192&setec=1644248d54ad1aa6c21806069c17522c"
    },
    {
      "fileId": "1000234952",
      "name": "SU (MCM)",
      "version": "5.15TESTFR",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4709",
      "fileName": "SU (MCM)-81809-5-15TESTFR.rar",
      "uploadedUnix": "1485714108",
      "modVersion": "5.15TESTFR",
      "virusScanUrl": "https://www.virustotal.com/file/a5f2a76a7b6e092eca830c4c59db372aef24aff84b7356e244225666ffd87c8f/analysis/1485714304/",
      "changelogHtml": " Version 5.15TESTFR initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SU%20%28MCM%29-81809-5-15TESTFR.rar?fid=1000234952&ttl=1535870440&ri=8192&rs=8192&setec=eafa1e39c275c0737adfdc73d6987f63"
    }
  ]
}