{
  "modId": 81832.0,
  "modName": "Naruto Ultimate Overhaul NEW - DELETED",
  "summary": "",
  "descriptionHtml": "[b]-ACTUAL MOD DESCRIPTION-[/b]\r<br />-The Naruto Overhaul adds over 100 new standalone eyes for every race and several spells from the Naruto anime along with an assortment of weapons and armour, and a few extra bits like miscellaneous items from the series. \r<br />\r<br />-As of 1.8 the Sharingan, Byakugan, Sage Mode and Kyuubi Mode powers will change your eyes while active, no need to permanently change them in the Character Creation Menu, they&#39;ll change back when the powers wear off or you turn them off manually. In order for this to work correctly you&#39;re required to have SKSE though.\r<br />\r<br />[b]-Naruto Jutsu-[/b]\r<br />-Here&#39;s a preview of the spells and powers contained in this mod:\r<br />Amaterasu - Shout that burns any target you aim at, will kill most things. \r<br />1st word is a single burst, 2nd word is more powerful, 3rd word is an AoE burst that kills anything around you. Better if aimed in first person. \r<br />Tsukuyomi - Paralyses any NPC. \r<br />Byakugan - Detect all creatures nearby, slowly drains magicka over time, can be deactivated at will.\r<br />Sharingan - Slows time, can be activated and deactivated at will, drains magicka over time. \r<br />Shinra Tensei - Knock back, now an alteration spell. \r<br />Shinra Tensei area - Knock back area, now an alteration spell. \r<br />Chidori Nagashi - AoE lightning spell. \r<br />Chidori Eisou - Lightning beam/spear. \r<br />Chidori - Short ranged attack. Benefits from novice destruction, dual cast & shock damage perks. \r<br />Rasengan - Short ranged attack. Pushes enemies away when struck. \r<br />Kirin - 1 Hit KO most NPCs, benefits from expert destruction & dual cast perks. Must be cast at close range. \r<br />8 Gates - Sacrifice your health in exchange for great boosts to physical skills. \r<br />Sage mode - Increases regeneration of all three main stats, last 5 minutes, leaves the user fatigued once it runs out and can be deadly if overused. \r<br />Kyuubi Mode - Greatly increases all main stats but drains health unless deactivated. Can be fatal if not used carefully. \r<br />Dragon Flame Jutsu - Constant gout of fire, each successive rank does more damage but costs more magicka. \r<br />Fire Ball Jutsu - Single large fire ball, each rank does more damage but costs more to cast. \r<br />Phoenix Flower Jutsu - Fires a large amount of small fireballs, costly but great for crowds. \r<br />Teleportation Jutsu - Teleports you a short distance away. Better if aimed in first person. \r<br />Kirin - Now has a lightning strike which can be avoided if under cover. \r<br />Bansho Ten&#39;in(Universal Pull) - Pull NPCs and throw them around like rag dolls. \r<br />Medical Ninjutsu - Ranked Healing, higher ranks cost more but heal more too. \r<br />RasenShuriken - Powerful ranged Rasengan, can destroy most enemies without much effort, very costly though. \r<br />Hidden Mist Jutsu - Makes you impossible to detect while you destroy your enemies from within the fog. \r<br />\r<br />-Along with these you get weapons from the Naruto series like Sasuke&#39;s Kusanagi and a few craftable armour pieces including Tobi&#39;s Mask as well as ninja Food Pills, headbands, and several others. \r<br />\r<br />[b]-How to get these and more?-[/b]\r<br />-Find the hideout near Riverwood and buy the spells or craft the weapons. ",
  "categoryId": "34",
  "version": "v2.4",
  "author": "Fahad Al",
  "createdUnix": "1485684938",
  "updatedUnix": "1485684934",
  "containsAdultContent": false,
  "uploadedBy": "Fahad42600",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000234930",
      "name": "Naruto Overhaul Ultimate NEW",
      "version": "v2.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "122555",
      "fileName": "Naruto Overhaul Ultimate NEW-81832-v2-4.zip",
      "uploadedUnix": "1485684934",
      "modVersion": "v2.4",
      "virusScanUrl": "https://www.virustotal.com/file/cbb968795c45c37e0debb7702172302cf89947e3194faebd9adbd9aa875c4edb/analysis/1485685216/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Naruto%20Overhaul%20Ultimate%20NEW-81832-v2-4.zip?fid=1000234930&ttl=1535870457&ri=8192&rs=8192&setec=bd19555bcd236baaab8591affdea0a8a"
    }
  ]
}