{
  "modId": 81931.0,
  "modName": "Hallgarth&#39;s Hair for NPCs",
  "summary": "Replaces some NPCs&#39; hair with hairs from Hallgarth&#39;s Additional (Vanilla) Hair.",
  "descriptionHtml": "[url=http://www.nexusmods.com/skyrim/mods/78669/?]Hallgarth&#39;s Additional (Vanilla) Hair[/url] is an amazing mod that adds lore-friendly(&#33;&#33;&#33;) hairstyles to Skyrim.  Unfortunately, before I made this mod, these hairstyles were only available for the player character; so it was completely possible to walk around as if you were the only person that existed that had ever thought to, say, put a braid in a certain part of your hair.  Weird, right? \r<br />So this mod replaces some vanilla NPC hairs to fix that&#33; (also I was annoyed with all redguard women having [i]that one hairstyle[/i])\r<br />\r<br />Unique as well as non-unique characters have been changed.  I&#39;ve been very mindful of character personalities and backgrounds where I&#39;ve made changes; for example, you&#39;ll find most &#34;Imperial&#34; hairstyles on actual Imperials and Imperial-aligned Nords (with some exceptions for the more generic-looking ones).  Speaking of which, most of the hairs in the game already appear to have been designed for Nords and are also marked as Nord hair in the CK, so I haven&#39;t changed very many Nords. \r<br />\r<br />While this mod will help you attain a feeling of diversity, it doesn&#39;t actually add new NPCs.  If diversity is what you&#39;re looking for, I&#39;d recommend supplementing this mod with [url=http://www.nexusmods.com/skyrim/mods/81462/?]this wonderful and aptly-named one[/url]. \r<br />\r<br />I had some grey face bugs in early testing but I think I&#39;ve squashed them all.  If you come across an NPC with a grey face [s]and not because they&#39;re a Dunmer[/s] and you think it&#39;s from my mod, please tell me and I&#39;ll get on fixing that. \r<br />\r<br />Oh, one last thing-- this mod will conflict with anything that changes any of the NPCs in it (which... are many in number).  Since hairstyles aren&#39;t too big of a deal, this is [probably] no biggie for you&#33;  Just be sure you load whichever file is more important to you last. \r<br />\r<br />Enjoy (and upload some pictures if you like)&#33; :)",
  "categoryId": "26",
  "version": "1",
  "author": "User_15571054",
  "createdUnix": "1486070140",
  "updatedUnix": "1486175829",
  "containsAdultContent": false,
  "uploadedBy": "User_15571054",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000235390",
      "name": "Hallgarth&#39;s Hair for NPCs (fixed)",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "91582",
      "fileName": "Hallgarth's Hair for NPCs (fixed)-81931-1.zip",
      "uploadedUnix": "1486175829",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/b2cbf0c8f20cb5093461666d55fafee0e2e9a98ef05d3ea73d7a41891e506805/analysis/1486176076/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hallgarth%27s%20Hair%20for%20NPCs%20%28fixed%29-81931-1.zip?fid=1000235390&ttl=1535870574&ri=8192&rs=8192&setec=0e1be074d2229c7054ff1b1c0736a223"
    }
  ]
}