{
  "modId": 81943.0,
  "modName": "Daniel The Gunner",
  "summary": "Adds a follower that uses a black powder rifle",
  "descriptionHtml": "[size=4]Description:\r<br />[/size]This mod essentially adds a new male follower that uses a black powder rifle as his weapon of choice. Daniel also has his own custom voice as well. If you want to add him to your collection of followers, you can find him in Riverwood at the Sleeping Giant Inn. \r<br />\r<br />[size=4]Requirements:\r<br />[/size]Dawnguard DLC\r<br />\r<br />[size=4]Backstory:\r<br />[/size]Daniel spent most of his life as a hunter in the forests of Skyrim. He was very skilled with a bow and was sometimes known to put a few arrows into some not-so-friendly bandits who harassed anyone who came near. Eventually, word spread of a mysterious bowman who would save innocent people from the clutches of dirty bandits. One day, Daniel received a message from the College of Winterhold saying that a few of the teachers and students were preparing an expedition into some newly discovered Dwemer ruins. The message said that the trip would be very dangerous and that they would like Daniel to accompany the expedition as a bodyguard. Daniel wasn&#39;t having much luck in tracking down animals, recently, and bandits almost never showed up near his hunting grounds anymore. So, he decided to pack his things and head to Winterhold to meet up with the expedition. Once he arrived, he noticed that he wasn&#39;t the only one acting as a bodyguard on this journey. Two mercenaries, one with a greatsword and another with a battle axe, were joining them as well. They eventually began their journey to the ruins, which became very uneventful. The other two mercenaries that were with them started to become restless and threatened to leave the group, unless they saw some action soon. They eventually reached the ruins and began exploring the inside. As they got deeper, they were eventually ambushed by a Dwarven Centurion and two spheres. The two mercenaries attempted to fight them off on their own, but there efforts were futile and both of them were killed, along with a few of the students and all of the teachers. Daniel grabbed the remaining students and attempted to find a way out. He eventually found an entrance to a room and tried his best to get everyone inside. The spheres were faster than the Centurion, so they were able to easily catch up and kill a few more of the students. Daniel had no choice but to shut the door and barricade it. The spheres did try to bash the door open, but they eventually left Daniel and the last surviving student from the college. Daniel then searched the room and found plans to an experimental weapon and the weapon itself, partially complete. Daniel and the survivor then quickly make their way out of the ruins and back to the surface. The last surviving student, who called herself Angela, thanked Daniel for saving her and began her journey back to Winterhold. Daniel examined the plans and partially complete weapon and saw that the Dwarves were experimenting with a new kind of powder that could be used to propel steel balls at speeds faster than arrows. The weapon could use this &#34;black powder&#34; and these special steel balls to easily pierce any kind of armor and kill the user&#39;s target. Amazed, Daniel took the plans and the weapon to a blacksmith to complete it. After many long weeks, the weapon was finished. Daniel then destroyed the plans and kept the weapon to make sure that no one else got their hands on what the Dwarves called &#34;The Boomstick&#34;.\r<br />[size=4]\r<br />\r<br />\r<br />Credits:\r<br />[/size][url=http://www.nexusmods.com/skyrim/mods/26653/?]Ghosu&#39;s Project Flintlock[/url] for Daniel&#39;s Rifle",
  "categoryId": "96",
  "version": "1.0",
  "author": "Stryker225",
  "createdUnix": "1486140000",
  "updatedUnix": "1486139995",
  "containsAdultContent": false,
  "uploadedBy": "stryker225",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000235336",
      "name": "Daniel The Gunner",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42172",
      "fileName": "Daniel The Gunner-81943-1-0.7z",
      "uploadedUnix": "1486139995",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e45165737b71289ebe9c50632280c31435492f5465f27a6dda2a21a2f2455a55/analysis/1486140253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Daniel%20The%20Gunner-81943-1-0.7z?fid=1000235336&ttl=1535870592&ri=8192&rs=8192&setec=e1584ea6ffc22968249543549ff483f2"
    }
  ]
}