{
  "modId": 82014.0,
  "modName": "Imperial Dragonknight Armory - Traduzione Italiana",
  "summary": "Questa è la Traduzione italiana della mod Imperial Dragonknight Armory.",
  "descriptionHtml": "Questa è la Traduzione italiana della mod Imperial Dragonknight Armory.\n<br />[i]Installazione:\n<br />[/i]Dopo aver installato la mod originale, sovrascriverla con la mia traduzione.\n<br />\n<br />[center][i][b][size=3]Traduzione della descrizione della Mod:[/size]\n<br />[/b][color=#ffd966][size=5]Imperial Dragonknight Armory (Armeria del Cavaliere del Drago Imperiale)[/size][/color][b] \n<br />\n<br />[youtube]8NYgb5DL6NI[/youtube]\n<br />\n<br />\n<br />[/b][/i][/center][center][i][size=3]Il  capitolo successivo di questa strana serie di armi e armature uniche:[/size][/i]\n<br />\n<br />\n<br />[img]http://orig12.deviantart.net/11db/f/2016/253/f/7/header_by_suran329-dah6o3q.gif[/img][/center]\n<br />\n<br />\n<br />[u][size=3]La Storia[/size][/u]\n<br />[i][size=3]Oh, c'era una volta un eroe di nome Octavus Merrill,\n<br />che venne a cavallo a Skyrim dalla grande Cyrodiil![/size][/i]\n<br />\n<br />[size=3]Un sacco di persone hanno richiesto un set imperiale. Quindi eccolo qui. Penso di aver superato il limite con il design ma hey, questo set è destinato ad essere usato soltanto dai veri eroi dell’ Impero! Questo set apparteneva originariamente al generale imperiale Octavus Meriil.\n<br />Alcuni voci dicono, che ha combattuto al fianco dell'imperatore Varen Aquilarios nella Seconda Era. I Cavalieri del Drago erano i guerrieri più potenti di allora e c’erano molti nemici da uccidere. È abbastanza ovvio che molte leggende vennero scritte in quel momento. Ma la storia insegna che anche i più potenti guerrieri non possono evitare la morte.\n<br />La sua leggenda narra che alcuni fedeli di Molag Bal evocarono un gigante Ogrim, grande come la nave dell'imperatore e forte come una valanga che viene giù da una montagna, Octavus sapeva che questa creatura avrebbe spazzato via la vita di centinaia di uomini e donne di Skyrim se non lo avrebbe fermato.\n<br />Ma quando arrivò l’ Ogrim aveva già causato un sacco di distruzione, era sul punto di mangiare tutti i cavalli delle stalle di Solitude, ma Octavus sfoderò la sua lama e si precipitò verso di lui, ma una mano gigante lo afferrò e Octavus scomparve. La spada e lo scudo caddero a terra. Pochi secondi dopo arrivarono due dozzine di maghi dalla Gilda che bandirono l’Ogrim con un incantesimo. Ci fù silenzio.\n<br />La popolazione locale così decise di costruire una tomba per il generale Octavus Meriil, ma seppellirono soltanto la spada e lo scudo. Il suo corpo lasciò Nirn insieme all’ Ogrim. I bardi cantarono le storie di Octavus il coraggioso per secoli. Oggi, nella quarta era, nessuno più ricorda il suo nome.[/size]\n<br />\n<br />\n<br />\n<br />\n<br />[center][img]http://orig05.deviantart.net/1c74/f/2016/253/4/b/fight_by_suran329-dah6o3i.gif[/img][/center]\n<br />\n<br />[u][size=3]Come installare?[/size][/u]\n<br />[size=3]Usa un mod manager come NMM o Mod Organizer. Tutti i giovani fanno questo. Ma se preferisci la vecchia scuola, puoi installarlo manualmente trascinando i file dentro la cartella di Skyrim.\n<br />\n<br />[i]FIGO[/i]: Questa mod è già compatibile con DSR! Caspita![/size]\n<br />\n<br />\n<br />[u][size=3]Come ottenere?[/size][/u]\n<br />[size=3]Questi oggetti non possono essere craftati. Puoi trovarli in una Tomba imperiale fra il cancello di Solitude e il faro dove Jaree- Ra vuole uccidervi. Ho aggiunto uno screen del luogo per i ragazzi pigri.[/size]\n<br />\n<br />\n<br />[u][size=3]Come usare?[/size][/u]\n<br />[size=3]Prendeli, equipaggiali e uccidi ogni cosa! Sia lo scudo che la spada possono essere temperati e migliorati. Le statistiche sono abbastanza alte, come le armi d’ebano.[/size]\n<br />\n<br />[img]http://orig05.deviantart.net/d800/f/2016/253/8/b/both_by_suran329-dah6o4h.jpg[/img]",
  "categoryId": "55",
  "version": "1.11",
  "author": "NerdissimoPC",
  "createdUnix": "1486402423",
  "updatedUnix": "1486402420",
  "containsAdultContent": false,
  "uploadedBy": "NerdissimoPC",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000235611",
      "name": "Imperial Dragonknight Armory 1.11",
      "version": "1.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "138",
      "fileName": "Imperial Dragonknight Armory 1.11-82014-1-11.7z",
      "uploadedUnix": "1486402420",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/768582a117d0d9d4d3b71b24eae103a3809ad5a5f89cf9deb7addd31d3fe40ca/analysis/1486402682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Imperial%20Dragonknight%20Armory%201.11-82014-1-11.7z?fid=1000235611&ttl=1535870668&ri=8192&rs=8192&setec=486c667f288eba485a44e73d3999525f"
    }
  ]
}