{
  "modId": 82037.0,
  "modName": "The Mask of time TestMod",
  "summary": "I tried to create a mask that stops time while it consumes the players health. It also comes with my try of a night eye.\r<br />Version 1.1: Since my original approach didn&#39;t work as it was supposed to instead of trying to stop time the mask now increases the speed of the player while moving.",
  "descriptionHtml": "I am still a beginner and still unable to test my mods myself. :(\r<br />To explain it. Unfortunaly my computer hasn&#39;t enough power to actually play Skyrim. Voice and image aren&#39;t synchron and already the first 15 minutes need at least 20 in reality. I normally play on PS4 and I just got the Legendary Edition to start modding, but now I can&#39;t test my own mods myself.\r<br />\r<br />So I present another of my tries and hope for your feedback to improve and bring you enjoyable mods in the future.\r<br />Now to this mod. I tried to create a mask that stops time while it consumes the players health. It also comes with my try of a night eye.\r<br />Version 1.1: Since my original approach didn&#39;t work as it was supposed to instead of trying to stop time the mask now increases the speed of the player while moving (so in relation the time seems to slow down instead of actually stopping). Night eye works permanent as long as the mask is equipped, while the speed should just change while moving (along with ii&#39;s costs).\r<br />Thanks to my pc the render window isn&#39;t easy to use so for this mod I gave the mask to Idolaf Battle-Born from Whiterun. To get the mask you guys have to ether steal it from him or kill him and take it out of his dead hands.\r<br />Especially the time manipulation seems tricky to me so I am not nearly as confident that it works as with my past work. Still hope there is something to enjoy. Oh, and bug reports are always welcomed. I will try to solve thinks as soon as I can.\r<br />\r<br />A side note. Since I hope to port future mods to ps4 i try to work without scripts. In case of this mod that looked impossible so i tried using only existing scripts and changing the properties. If one of you knows that this would also not work on PS4 please leave a post.",
  "categoryId": "40",
  "version": "1.1",
  "author": "Diilsoszaam",
  "createdUnix": "1486495616",
  "updatedUnix": "1490531450",
  "containsAdultContent": false,
  "uploadedBy": "Diilsoszaam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000240031",
      "name": "The Mask of Time TestMod",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "The Mask of Time TestMod-82037-1-1.zip",
      "uploadedUnix": "1490531450",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c7f59e7cc7aefd686d00efe47e3a9e4b84ee5ade0de2eadf7ab28fb5032e9cc3/analysis/1490531714/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Mask%20of%20Time%20TestMod-82037-1-1.zip?fid=1000240031&ttl=1535870696&ri=8192&rs=8192&setec=6e267b05af5cbed956757dec9aca93b4"
    }
  ]
}