{
  "modId": 8210.0,
  "modName": "Ingun Specialized Follower",
  "summary": "Adds Ingun as a companion/marriage candidate while giving her some extra abilities and perks. ",
  "descriptionHtml": "Heya!\r\n\r\nThis mod makes Ingun marriageable and enables her to be a follower. She levels with the PC and has extra abilities and perks that I thought would help bring her more to life as a follower. You will have to start a new game to get here to be updated, (I think) I\\'m sorry :<\r\n\r\nHer abilities are as follows:\r\n\r\nKryptonite:\r\nBeing an alchemist has allowed her to figure out any creature or mans weakness to use against them. Kryptonite is her breakthrough that will harness the weaknesses of the enemy allowing for more magic and armor penetration. \r\n-This spell has 5 levels and will (hopefully) level with her and the PC. \r\n\r\nDown Poison:\r\nWhile being an alchemist gives her knowledge on many plants and creatures it often means having to acquire dangerous and often poisonous ingredients. Putting these to good use she has a passive to occasionally poison whoever she is attacking.\r\n-This levels with her alchemy skill. It has five levels each level will apply a stronger poison with a greater chance of doing so.\r\n\r\nLive For Today:\r\nEvery so often while exploring she way be mortally wounded! To compensate for that she has developed a remedy. \r\n-This is a small AOE healing spell that she should use if she takes too much damage.\r\n(In this she is set to essential, however she still bleeds out)\r\n\r\nCitizen/Soldier:\r\nBeing from the Black-Briar means something. She will gain a small boost in one handed while in combat.\r\n-Just a passive\r\n\r\n------------------------\r\nHer skill set-up is one-handed/light armor/destruction/restoration\r\nShe also levels up her alchemy just for some realism.\r\nShe has a couple of other spells which include icesphere/vampire drain/chainlightning\r\nTo marry her or to make her follow you, you have to do her quest. \r\n------------------------\r\n\r\nBugs?!\r\n\r\nSo far I\\'m unaware of anything, I\\'ve only played it for about an hour and thought it was working well. The only thing I notice is that she is VERY reluctant on using Kryptonite. I\\'m fiddling with her combat AI to try and find one that fits...better.\r\n\r\nConflicts/Resolutions\r\n\r\nThis will most likely conflict with any other mod that changes Ingun. \r\n\r\nInspiration!\r\n\r\nI really enjoyed having Ingun as a vampire companion:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=2710\r\nI thought about keeping her a vampire since that\\'s how I played her, but I\\'m unsure so it might change in future versions, but thanks to this mod I fell in love with Ingun as a follower. Because of that! Check her inventory for a special surprise.\r\n\r\nAlso I got the idea to make custom perks/abilities from~!\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=7245\r\nGreat ideas in that one!",
  "categoryId": "66",
  "version": "v1",
  "author": "Nekocatz",
  "createdUnix": "1328692533",
  "updatedUnix": "1328692588",
  "containsAdultContent": false,
  "uploadedBy": "Nekocatz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27016",
      "name": "Ingun The Advanced Vampire Follower",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Ingun The Advanced Vampire Follower-8210-v1.rar",
      "uploadedUnix": "1328692588",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/01131e19389717813a41de2e40df833657ef69bf5eb52ef9ebefb35c7371f9bd/analysis/1406660406/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ingun%20The%20Advanced%20Vampire%20Follower-8210-v1.rar?fid=27016&ttl=1535766731&ri=8192&rs=8192&setec=9fd81faadff115b2d36ed7a1ca4e8abc"
    }
  ]
}