{
  "modId": 82191.0,
  "modName": "A Skyrim Dragon Mod - Draconic Mastery",
  "summary": "Have you ever dreamed about call/conjure/summon a type of dragon that suits every character in your playthrought?\r<br />Or have you ever you ever wanted to just send an army of dragons against your foes?\r<br />Then, this MOD is definitively for you&#33;",
  "descriptionHtml": "THE MOD HAS BEEN MOVED IN &#34;MAGIC SPELLS AND ENCHANTMENTS&#34;\r<br />\r<br />Have you ever dreamed about call/conjure/summon a type of dragon that suits every character in your playthrought?\r<br />I mean, Odahviing is unique, I just love to have a dragon different form the others after the Main Quest on my side, but for a two-handed warrior in full heavy stalhrim set with a stalhrim battleaxe, wouldn&#39;t suit better a Frost Dragon? Or if have some mods that provides you being a Dremora, shouldn&#39;t you ride Alduin himself? Or ride a Serpentine one for your Nazgul-like, from Lord of the Rings, character? Or have you ever you ever wanted to just send an army of dragons against your foes?\r<br />Then, this MOD is definitively for you&#33;\r<br />\r<br />The (not so) long description\r<br />\r<br />One of the main reasons I decided to play Skyrim (I&#39;m always been a fantasy games/books/films fan) was the Dragon Riding.\r<br />In the game, you only have one dragon, Odahviing, that is actually &#34;summonalbe&#34; and rideable, and that was a bit disappointing while exploring locations like BlackReach (okay, perhaps I&#39;ve a bit exaggerated) the Forgotten Vale or the Whole Solstheim Island. Okay, you can summon Durnehviir, but unfortunately he&#39;s not rideable.\r<br />\r<br />But there was another problem: even if I LOVE Odahviing, I started getting a bit bored about it, I needed something different (why not Paathrnax, for istance?) and/or something that could have suitted better any type of character.\r<br />For a stalhrim warrior wouldn&#39;t suit better a Frost Dragon?\r<br />A Revered for a mage?\r<br />A Serpentine for a Nazgul like?\r<br />Alduin if you play as a Dremora?\r<br />An amazing Elder Dragon for your Paladin?\r<br />An Ancient for your Dark Fire Lord? ...\r<br />So i decided to create\r<br />\r<br />ALL OF THEM&#33;\r<br />\r<br />Here what this mod does (all the dragons are fully rideable through the Bend Will Shout):\r<br />\r<br />- Summon Dragon (Fire)\r<br />- Summon Dragon (Fire) - Medium\r<br />- Summon Dragon (Fire) - Potent\r<br />- Summon Dragon (Frost)\r<br />- Summon Dragon (Frost) - Medium\r<br />- Summon Dragon (Frost) - Potent\r<br />- Summon Blood Dragon (Fire)\r<br />- Summon Blood Dragon (Fire) - Medium\r<br />- Summon Blood Dragon (Fire) - Potent\r<br />- Summon Blood Dragon (Frost)\r<br />- Summon Blood Dragon (Frost) - Medium\r<br />- Summon Blood Dragon (Frost) - Potent\r<br />- Summon Frost Dragon (Fire) *\r<br />- Summon Frost Dragon (Fire) - Medium *\r<br />- Summon Frost Dragon (Fire) - Potent *\r<br />- Summon Frost Dragon (Frost)\r<br />- Summon Frost Dragon (Frost) - Medium\r<br />- Summon Frost Dragon (Frost) - Potent\r<br />- Summon Elder Dragon (Fire)\r<br />- Summon Elder Dragon (Fire) - Medium\r<br />- Summon Elder Dragon (Fire) - Potent\r<br />- Summon Elder Dragon (Frost)\r<br />- Summon Elder Dragon (Fire) - Medium\r<br />- Summon Elder Dragon (Fire) - Potent\r<br />- Summon Ancient Dragon (Fire)\r<br />- Summon Ancient Dragon (Fire) - Potent\r<br />- Summon Ancient Dragon (Frost)\r<br />- Summon Ancient Dragon (Frost) - Potent\r<br />- Summon Serpentine Dragon (Fire)\r<br />- Summon Serpentine Dragon (Fire) - Potent\r<br />- Summon Serpentine Dragon (Frost)\r<br />- Summon Serpentine Dragon (Frost) - Potent\r<br />- Summon Revered Dragon (Fire)\r<br />- Summon Revered Dragon (Fire) - Potent\r<br />- Summon Reverd Dragon (Frost) *\r<br />- Summon Reverd Dragon (Frost) - Potent *\r<br />- Summon Legendary Dragon (Fire)\r<br />- Summon Legendary Dragon (Fire) - Potent\r<br />- Summon Legendary Dragon (Frost)\r<br />- Summon Legendary Dragon (Frost) - Potent\r<br />\r<br />*The mod is thought mainly for aestethical reasons, so I decided to create Frost Dragon that use FireBreath/FireBall and, because of CreationKit shows that Revered Dragon with FrostBreath/IceStorm were planned, but then non-added, I also made them. If you don&#39;t want these spell, just don&#39;t use their spell thomes :)\r<br />\r<br />And this named dragons FULLY RIDEABLE (once mounted you will be able to fast-travel wherever you want and to tell them to attack your foes)\r<br />- Summon Alduin (with all his shouts, AlduinFireStorm included)\r<br />- Summon Alduin - Potent\r<br />- Summon Durnehviir (with a more powerful Frost Breath - same as an Ancient Dragon)\r<br />- Summon Durnehviir - Potent\r<br />- Summon Paathurnax (added Frost Breath and Ice Storm, since he&#39;s the Master of the Voice, why should he only only Fire breath or Fire Ball?)\r<br />- Summon Paathurnax - Potent\r<br />- Summon Skeletal Dragon (no rideable, he will stay on the ground, like the Labyrithian one)\r<br />- Summon Skeletal Dragon - Medium\r<br />- Summon Skeletal Dragon - Potent\r<br />- Summon Skeletal Dragon Flying (yes, fully rideable like the others)\r<br />- Summon Skeletal Dragon Flying - Medium\r<br />- Summon Skeletal Dragon Flying - Potent\r<br />- Summon Odahviing (so you&#39;ll be able to bring it with you in locations where he can&#39;t be summoned like the Solstheim Island, The Forgotten Vale...; his Fire Storm as a bonus feature ;) )\r<br />- Summon Odahviing  - Potent\r<br />\r<br />WHAT DO &#34;Medium&#34; and &#34;Potent&#34; MEAN?\r<br />Since in late game and/or higher difficulties all the dragons become useless (except the Serpentine or the Legendary), I&#39;ve decided to add a Medium (for Normal, Blood, Skeletal, Frost and Elder) and a Potent version for every dragon, Odahviing included (so you&#39;ll be able to summon him on Solstheim or other locations): the dragon will keep his aspect, but will use stats, level and shouts of an Ancient Dragon for the Medium version, of a  Legendary for the Potent, without the Drain Vitality (that is increadibly boring and annoying in Legendary difficulty or against powerful enemies). Read the Dragon Voice parts of the Description below.\r<br />\r<br />ALL THE SPELL TOMES ARE IN RIVERWOOD, JUST FAST TRAVEL THERE AND YOU ARE SEEING THE CHEST ON YOUR LEFT, NEAR THE TREE\r<br />\r<br />EDITED STUFF (OPTIONAL)\r<br />- Call dragon -&gt; Cooldown reduced 1, 2, 5s\r<br />- Summon Durnehviir -&gt; Colldown reduced 5, 5, 30s\r<br />- Ben Will -&gt; Cooldown reduced 1, 2, 5s (I know it&#39; a great decrease, but I think it is necessary since it is very difficult hitting dragons while they&#39;re not hoovering and that is very important for make dragons work well, even if you don&#39;t want to ride them; read the section below)\r<br />- Dragon Aspect -&gt; No more once per day&#33; You can turn into a Vampire Lord everytime, if you have the Hircine Ring you can do the same thing as a Werewolf, but can only be a true Dovahkiin one time every 24h? Oh, come on...\r<br />\r<br />\r<br />CONCERNING DRAGONS BEHAVIOUR (with suggestion for modders)\r<br />If you travel for a while after having summoned your dragon you&#39;ll have a weird glitch: the dragon will be teleported underground, under your feet. To solve it just USE BEND WILL SHOUT even if you don&#39;t want to ride him, he will follow you like Odahviing or Durnehviir (it&#39;s a vanilla feature, you can test it without mods, just spawn a dragon, use all the 3 words of the bend will shout on him but don&#39;t ride him, and look what he does). That&#39;s the best solution I suggest you.\r<br />In this way infact your summoned dragon will behave like Arvak : he will disappear when his time will end, but if you are riding him, he will stay there.\r<br />\r<br />However it actually exist another possibility: the use of one of the Durnehviir Scripts, the DLC1DragonSummonScript, that provides the Dragon to follow you without troubles, like Durnehviir does, but the problem is that after 150 seconds (2.5 minutes, 1h in game), whatever he&#39;s doing(yeas, even if you are ridning him), THE DRAGON WILL LAND AND DIE.\r<br />\r<br />CONCERNING SCREENSHOTS:\r<br />I&#39;m having trouble taking screenshots, so I just used Images from the net. If someone wants to take some screenshots and send me I would be happy :)\r<br />\r<br />EDIT: I succeeded, now I added my screenshots. Hope you enjoy&#33;\r<br />\r<br />CONCERNING SCRIPTS:\r<br />This mod is ALMOST scriptless, the only scripts it uses are the dragon skyrim scripts, without them, dragons would be weird (just the &#34;dragoactorscript&#34;, edited so there is not the Dragon Soul Absorb when they disapper ;) )\r<br />\r<br />ENHANCING DRAGON RIDING EXPERIENCE:\r<br />One way is to add this line in Skyrim.ini and your SkyrimPrefs.ini; add under\r<br />[General]\r<br />bFlyingMountFastTravelCruiseEnables=1\r<br />This will make your dragon Real-Time fast traveling (it is a feature made by Bethesda), so when you&#39;ll open the MAP and click on a location or a custom location, instead of a black screen your dragon will fly in that derection and will tell you when arrived.\r<br />If you also want to discover location while real-time fast-travelling (e.g. you&#39;re Flying across Dawnstar and you&#39;ll see &#34;Dawnstar discovered&#34;) add this more line under your\r<br />[Gameplay]\r<br />bAllowDragonFlightLocationDiscovery=1\r<br />This is a video showing a mod that use those ini tweaks [url=https://www.youtube.com/watch?v=SYyobzcXvKU]https://www.youtube.com/watch?v=SYyobzcXvKU[/url]\r<br />But pay attention: even if I&#39;m using it for more then 100 hours gameplay, I&#39;ve seen lots of posts of player complaining about that not working. I suggest you doing it AFTER the Dragonborn Main Quest, anyway, so after you&#39;ve learnt Dragonrend and BendWill.\r<br />\r<br />If it doesn&#39;t work or mess up everything, or if you just want something better, I recomand you one of this two amazing mods:\r<br />[url=http://www.nexusmods.com/skyrim/mods/31325/]http://www.nexusmods.com/skyrim/mods/31325/[/url]?   (Mod shown in the previous Video)\r<br />[url=http://www.nexusmods.com/skyrim/mods/31697/]http://www.nexusmods.com/skyrim/mods/31697/[/url]?   (Video: [url=https://www.youtube.com/watch?v=lOa4if2Z_ok]https://www.youtube.com/watch?v=lOa4if2Z_ok[/url])\r<br />\r<br />CONCERNING DRAGON VOICES:\r<br />I need some help: if you ride a dragon not from the DLC (an Elder, for istance), or Odahviing, you&#39;ll notice that when he uses his shout there will be two sounds, one for the &#34;shout&#34; and one gor the &#34;effect&#34;. You&#39;ll also notice it be activating your subtitles: the dragon will say &#34;Yol...Toor Shul&#34; or &#34;Fo...Kraah Diin&#34;(even if they don&#39;t really say these words, as I said, it&#39;s just a sound, a kind of Roar). But if you now look at one from the DLC (a Legendary, for istance) or Alduin, you&#39;ll crealy hear the lack of the shout sounds, and if you active your subtitles, this dragon will not say anything. This is also a problem for &#34;Custom shout&#34; for dragons: I tried created a new one from the Ancient Dragon shout, which has the sounds, but when via CreationKit I switched his default one (DragonFireBreathShout05) with mine, again, no more second sound. I think the deafullt 5 version have something attached to them, but I didn&#39;t find a solution at the moment.\r<br />For these reasons since CreationKit reveals that the Serpentine and the Revered shout magnitude is the same of their cousins Ancient Dragons (you can check it here: [url=http://www.uesp.net/wiki/Skyrim:Dragon]http://www.uesp.net/wiki/Skyrim:Dragon[/url]), I&#39;ve decided to put that one in their spelllist, instead of the original one.\r<br />If someone has any ideas (or a link for a mod that solves that) his or help help would be really appreciated :)\r<br />\r<br />CONCERNING DRAGON VOICES AND THE POTENT VERSION:\r<br />If you agree there could be another solution: since the DragonFireBreathShout03 and the DragonFireBalShout03 are fully voiced but not used (those are the shouts that, in theory, should use a fire version of the White Dragon, that in the final version of the game became Frost Dragon, so it only exist that version) I could edit those magnitude for better shouts for the Potent Version of summoned Dragon (late game or higher difficulties). So this could solve the Fire type dragon shouts; regarding the Frost type I was thinking about use (edit) the DragonFrostBreathShout03 and the DragonFrostBall03 (used by default by Frost Dragon) and give the Frost Dragon  the 04 ones (used by their Elder cousins) or the 05 ones (used by the Ancients) because in my opinion Frost Dragon should be more powerful. Let me know what you think about that.\r<br />\r<br />TODO LIST:\r<br />Add a Master Version for all the spells and, if authors will give me persmission, add more dragons using skins from their mods.\r<br />Find a way to let Dragon use their Unrelenting Force Shout.\r<br />Maybe change the name of the Dragons and give them unique ones, suggestions are welcome&#33;\r<br />\r<br />INSTALLATION:\r<br />Put it in the Data folder, should be:\r<br />C:&#92;Program Files (x86)&#92;Bethesda Softworks&#92;The Elder Scrolls V Skyrim - Legendary Edition&#92;Data\r<br />\r<br />Check if active in your Skyrim Launcher -&gt; Data FIles\r<br />\r<br />\r<br />Or -&gt; use NMM\r<br />\r<br />\r<br />The MOD is now for the Legendary Edition.\r<br />I&#39;m going to release a Dawnguard ONLY version(the Dragons will use the Durnehviir script I wrote before, since you will not ride them, there will be no problems) and a Dragonborn ONLY one(like in the Legendary, as I wrote before, just use Bend Will on dragons even if you don&#39;t want to ride them to prevent weird things like dragons that fly underground). For those reasons I don&#39;t think I&#39;m releasing a NO DLC version.\r<br />\r<br />\r<br />Don&#39;t forget to endorse and check up my other mods&#33; :D : [url=http://www.nexusmods.com/skyrim/users/39122770/?tb=mods&pUp=1][u][color=#0066cc]http://www.nexusmods.com/skyrim/users/39122770/?tb=mods&pUp=1[/color][/u][/url]\r<br />\r<br />\r<br />Cheers, and good Skyrim you all&#33;&#33;&#33;\r<br />\r<br />CREDITS:\r<br />Bethesda Softworks\r<br />All the youtubers that provide CreationKit tutorials for beginners, in particular DarkFox127, without him I&#39;d still messing around trying to understand how the Renderer Window works.\r<br />And all the modders and their work I studied to create my own one.\r<br />So, last but not least, thanks Skyrim community&#33;\r<br />\r<br />\r<br />========================================================================================\r<br />========================================================================================\r<br />ITALIAN TRANSLATION\r<br />\r<br />\r<br />[font=Calibri]Hai mai sognato di chiamare/evocare un drago che fosse adatto ad ogni personaggio durante le tue [font=Calibri]a[/font]vventure?\r<br />Mi spiego, Odahviing è unico, I semplicemente adoro avere un drago differente dagli altri dopo la Trama Principale dalla mia parte, ma per un Guerriero specializzato nelle Armi a due mani, in un completo set di pesante di Stalhrim con una Ascia da Guerra Stalhrim, non si adatterebbe meglio un Drago el Gelo? O se usate MOD che vi permettono di essre un Dremora, non dovreste poter cavalcare Alduin stesso? O un Drago Serpente per il vostro personaggio in stile Nazgul, da “Il Signore degli Anelli”? O avete mai semplicemente voluto mandareun esercito di draghi contro orde di nemici?\r<br />Allora, questa [/font][font=Calibri]MOD è decisamente per voi&#33;\r<br />\r<br />[/font][font=Calibri]La (non troppo)lunga descrizione\r<br />\r<br />Una delle principali ragioni per cui ho deciso di giocare Skyrim (sono sempre stato un amante di giochi/film/libri fantasy)è stata la possibilità di cavalcare i draghi.\r<br />Nel gioco avete solo un drago, Odahviing, che sia effettivamente “evocabile” ecavalcabile, ed è un po’ deludente mentre si esplorano luoghi come il BlackReach(va bene lo ammetto, forse qui ho un tantino esagerato), la Valle Dimenticata o l’intera Isola di Solstheim. È vero, potete evocare Durnehviir, ma sfortunatamentenon è avalcabile.\r<br />\r<br />Ma c’era un altro problema: anche se ADORO Odahviing, cominciai un po’ adannoiarmene, avevo bisogno di qualcosa di diverso (perché non Paathurnax, per esempio?) e/o qualcosa che si potesse adattare meglio ad ogni tipo di personaggio.[/font]\r<br />[font=Calibri]Per un Guerriero Stalhrim nonera forse meglio un Bianco Drago del Gelo?[/font]\r<br />[font=Calibri]Un Venerabile per un mago?[/font]\r<br />[font=Calibri]Un Serpente per un Nazgul?[/font]\r<br />[font=Calibri]Un fantastico Anziano per unPaladino?[/font]\r<br />[font=Calibri]Alduin se giochi come un Dremora?...[/font]\r<br />[font=Calibri] [/font]\r<br />[font=Calibri]Cosìdecisi di creare\r<br />\r<br />TUTTI LORO&#33;\r<br />\r<br />Ecco cosa fa la mia MOD (tutti i draghi sono completamente cavalcabili per\r<br />mezzo dell’Urlo Piega Volontà):\r<br />\r<br />- Evoca Drago (Fuoco)\r<br />[font=Calibri]- Evoca Drago (Fuoco) - Medio\r<br />[font=Calibri]- Evoca Drago (Fuoco)[/font] - Potente[/font]\r<br />- Evoca Drago (Gelo)\r<br />[font=Calibri]- Evoca Drago (Gelo)[/font] - Medio\r<br />[font=Calibri]- Evoca Drago (Gelo)[/font] - Potente\r<br />- Evoca Drago del Sangue (Fuoco)\r<br />[font=Calibri]- Evoca Drago del Sangue (Fuoco)[/font] - Medio\r<br />[font=Calibri]- Evoca Drago del Sangue (Fuoco)[/font] - Potente\r<br />- Evoca Drago del Sangue (Gelo)\r<br />[font=Calibri]- Evoca Drago del Sangue (Gelo)[/font] - Medio\r<br />[font=Calibri]- Evoca Drago del Sangue (Gelo)[/font] - Potente\r<br />- Evoca Drago del Gelo (Fuoco) *\r<br />[font=Calibri]- Evoca Drago del Gelo (Fuoco) - Medio *\r<br />[font=Calibri]- Evoca Drago del Gelo (Fuoco) - Potente *[/font][/font]\r<br />- Evoca Drago del Gelo (Gelo)\r<br />[font=Calibri]- Evoca Drago del Gelo (Gelo)[/font] - Medio\r<br />[font=Calibri]- Evoca Drago del Gelo (Gelo)[/font] - Potente\r<br />- Evoca Drago Anziano (Fuoco)\r<br />[font=Calibri]- Evoca Drago Anziano (Fuoco)[/font] - Medio\r<br />[font=Calibri]- Evoca Drago Anziano (Fuoco)[/font] - Potente\r<br />- Evoca Drago Anziano (Gelo)\r<br />[font=Calibri]- Evoca Drago Anziano (Gelo)[/font] - Medio\r<br />[font=Calibri]- Evoca Drago Anziano (Gelo) - Potente[/font]\r<br />- Evoca Drago Antico (Fuoco)\r<br />[font=Calibri]- Evoca Drago Antico (Fuoco)[/font] - Potente\r<br />- Evoca Drago Antico (Gelo)\r<br />[font=Calibri]- Evoca Drago Antico (Gelo)[/font] - Potente\r<br />- Evoca Drago Serpente (Fuoco)\r<br />[font=Calibri]- Evoca Drago Serpente (Fuoco)[/font] - Potente\r<br />- Evoca Drago Serpente (Gelo)\r<br />[font=Calibri]- Evoca Drago Serpente (Gelo)[/font] - Potente\r<br />- Evoca Drago Venerabile (Fuoco)\r<br />[font=Calibri]- Evoca Drago Venerabile (Fuoco)[/font] - Potente\r<br />- Evoca Drago Venerabile (Gelo) *\r<br />[font=Calibri]- Evoca Drago Venerabile (Gelo)  - Potente *[/font]\r<br />- Evoca Drago Leggendario (Fuoco)\r<br />[font=Calibri]- Evoca Drago Leggendario (Fuoco) - Potente[/font]\r<br />- Evoca Drago Leggendario (Gelo)\r<br />[font=Calibri]- Evoca Drago Leggendario (Gelo) - Potente[/font]\r<br />\r<br />*La mod è pensata principalmente per ragioni estetiche, dunque ho deciso d[font=Calibri]i [/font]creare un Drago del Gelo che usasse Soffio di Fuoco/Palla di Fuoco e poiché il CreationKit mostra che Draghi Venerabili con Soffio di Gelo/Bufera erano pianificati, ma alla fine non aggiunti, ho creato anche loro. Se non volete questi incantesimi, semplicemente non usate i loro tomi magici :)\r<br />\r<br />E questi draghi nominati COMPLETAMENTE CAVALCABILI (una volta montati potrete viaggiare velocemente ovunque vogliate dirgli di attaccare i vostri nemici)\r<br />- Evoca Alduin (con tutti i suoi urli, Pioggia di Meteoriti inclusa)\r<br />[font=Calibri]- Evoca Alduin[/font] - Potente\r<br />- Evoca Durnehviir (con un Soffio di Gelo più potente – stesso di unDrago Antico)\r<br />[font=Calibri]- Evoca Durnehviir[/font] - Potente\r<br />- Evoca Paathurnax (aggiunti Disarma, Soffio di Gelo e Bufera, dato che è il Maestro della Voce, perché dovrebbe solo usare Soffio di Fuoco o Palla di Fuoco?)\r<br />[font=Calibri]- Evoca Paathurnax[/font] - Potente\r<br />- Evoca Drago Scheletrico (non cavalcabile, resterà a terra, come quello diLabyrithian)\r<br />[font=Calibri]- Evoca Drago Scheletrico[/font] - Medio\r<br />[font=Calibri]- Evoca Drago Scheletrico[/font] - Potente\r<br />- Evoca Drago Scheletrico Volante (sì, completamente cavalcabile come gli altri)\r<br />[font=Calibri]- Evoca Drago Scheletrico Volante[/font] - Medio\r<br />[font=Calibri]- Evoca Drago Scheletrico Volante - Potente[/font]\r<br />- Evoca Odahviing (così potrai porarlo con te in luoghi dove normalmente non può essere convocato, come l’Isola di Solstheim, la Valle Dimenticata...)[font=Calibri]\r<br />[font=Calibri]- Evoca Odahviing[/font] - Potente\r<br />\r<br />[/font]COSA SIGNIFICANO &#34;MEDIO&#34; E &#34;POTENTE&#34;?\r<br />Dato che durante un gioco avanzato, quando il vostro personaggio e di conseguenza tutto il mondo raggiungete un livello alto e/o con difficoltà maggiori (Ardua/Leggendaria) tutti i draghi diventano inutili (eccezion fatta per i Serpenti o i Leggendari), ho deciso di aggiungere una versione Media (per i Normali, del Sangue, Scheletrici, del Gelo e Anziani) e una Potente valida per tutti, Odahviing incluso (così potrai evocarlo a Solstheim oaltri luoghi): ogni drago manterrà il suo aspetto, ma userà statistiche, livello e urli di un Drago Antico per la versione Media, di un Leggendario per la Potente, senza Prosciuga Vitalità (che è incredibilmente noiosa e fastidiosa in difficoltà Leggendaria o contro nemici potenti). Leggi la sezione VOCI SUI DRAGHI della Descrizione che troverai più in basso.\r<br />\r<br />TUTTI I TOMI MAGICI SONO A RIVERWOOD, FATE UN SEMPLICE VIAGGIO VELOCE Lì E VEDRETE LO SCRIGNO SULLA VOSTRA SINISTRA, VICINO ALL’ALBERO\r<br />\r<br />EDITED STUFF (OPTIONAL)\r<br />- Chiama Drago -&gt; Cooldown ridotto 1, 2, 5s\r<br />- Evoca Durnehviir -&gt; Colldown ridotto 5, 5, 30s\r<br />- Piega Volontà -&gt; Cooldown ridotto 1, 2, 5s (so che può sembrare un’eccessivariduzione, ma credo sia necessaria in quanto risulta molto difficile colpire i draghi mentre non sono fermi a mezz’aria e che è un Urlo estremamentefondamentale per far funzionare bene i draghi, anche se non volete cavalcarli; leggi la sezione seguente)\r<br />- Aspetto del Drago -&gt; Non più una sola volta al giorno&#33; Puoi assumere la\r<br />forma del Signore dei Vampiri in ogni momento, se possiedi l’Anello di Hircinepuoi fare lo stesso da Lupo Mannaro, ma puoi assumere la forma di un vero\r<br />Dovahkiin una sola volta ogni 24h? [/font][font=Calibri]Oh, ma dai...\r<br />\r<br />\r<br />[/font][font=Calibri]RIGUARDO ALCOMPORTAMENTO DEI DRAGHI (con suggerimenti per modders)\r<br />Se viaggi per un po’ dopo aver evocato il tuo drago andrai incontro ad unostrano glitch: il drago serà teletrasportato sottoterra, sotto i tuoi piedi. Per risolverlo semplicemente USA L’URLO PIEGA VOLONTÀ anche se non vuoi cavalcarlo,ti seguirà come fanno Odahviing o Durnehviir (è una dinamica del gioco, puoi testarla anche senza mod, limitati a spawn un dragon, usa tutte e 3 le parole dell’urlo Piega Volontà su di lui ma non cavalcarlo, and osserva il suocomportamento). [/font][font=Calibri]È la miglior soluzione che possa suggerire.\r<br />[/font][font=Calibri]In questa maniera infatti il tuo drago evocato si comporterà come Arvak : sparirà quando sarà finito il suo tempo, ma se in quel momento lo stai cavalcando, resterà lì con te.\r<br />\r<br />Comunque esiste, in realtà, un’altra possibilità: l’utilizzo di uno degliscript di Durnehviir, il DLC1DragonSummonScript, che permette al drago di seguirti senza problemi, come Durnehviir, appunto fa, ma il problema è che dopo 150 secondi (2 minuti e mezzo, 1h in-game), qualunque cosa faccia (sì, anche lostai cavalcando), IL DRAGO ATTERERÀ E MORIRÀ.\r<br />\r<br />RIGUARDO AGLI SCREENSHOTS:\r<br />Sto avendo problemi nel catturare e recuperare screenshot, così mi son[font=Calibri]o [/font]limitato ad usare immagini dalla rete. Se qualcuno riuscisse e/o volesse scattare qualche screenshot e inviarmeli o aggiungerli personalmente, ne sarei lieto :)\r<br />\r<br />EDIT: Ok, ce l&#39;ho fatta. Ora ho aggiunto i miei screenshot. Spero li apprezziate&#33;\r<br />\r<br />\r<br />RIGUARDO AGLI SCRIPTS:\r<br />La mod è PERLOPIÙ priva di essi, utlizza solo uno degli script dei draghi, senza i quali, essi si comporterebbero stranamente (il &#34;dragoactorscript&#34;, modificato così che non ci sia assorbimento dell’anima di drago quando gli evocati spariscono;) )\r<br />\r<br />MIGLIORARE L’ESPERIENZA DEL CAVALCARE DRAGHI:\r<br />Una possibilità è quella di aggiungere questa riga nello Skyrim.ini e nel tu[font=Calibri]o [/font]SkyrimPrefs.ini; aggiungi [font=Calibri]sotto[/font]\r<br />[font=Calibri][General][/font]\r<br />bFlyingMountFastTravelCruiseEnables=1\r<br />Questo permetterà al tuo drago di effetuare un Viaggio Veloce in TEMPO REALE (è una possibilità creata dalla Bethesda), quindi quando aprirai la MAPPA e cliccherai su un luogo o una destinazione personalizzata, invece della solita schermata nera il tuo drago volerà in quella direzione e ti dirà anche quando sarete arrivati.\r<br />Se volessi anche scoprire luoghi mentre viaggi intempo reale (es. [/font][font=Calibri]Staivolando sopra Dawnstar e vedrai &#34;Dawnstar Scoperta&#34;) aggiungi questa ulteriore riga sotto [Gameplay]\r<br />bAllowDragonFlightLocationDiscovery=1\r<br />Ecco un video che mostra una famosa mod che usa questi “ini-tweaks”, omodifiche del file ini, se preferite [url=https://www.youtube.com/watch?v=SYyobzcXvKU][u]https://www.youtube.com/watch?v=SYyobzcXvKU[/u][/url][/font]\r<br />[font=Calibri]Ma fai attenzione: anche se io li ho usati per più di 100h di gameplay senza alcun problema, ho letto molti post di giocatori che se ne lamentavano in quanto non funzionasse bene per loro. In ogni caso vi suggerisco di fare queste modifiche DOPO la Trama Principale normale e dopo quella di Dragonborn, e dunque dopo aver appreso e sbloccato “Squarcio del Drago” e “Piega Volontà”.\r<br />\r<br />Se non volesse funzionare o rovinasse la vostra esperienza, o sesemplicemente voleste qualcosa di più meno rozzo, vi reccomando una di queste due fantastiche mod:\r<br />[/font][url=http://www.nexusmods.com/skyrim/mods/31325/][u][font=Calibri]http://www.nexusmods.com/skyrim/mods/31325/[/font][/u][/url][font=Calibri]?   (Mod mostrata nelVideo precedente)\r<br />[url=http://www.nexusmods.com/skyrim/mods/31697/][u]http://www.nexusmods.com/skyrim/mods/31697/[/u][/url]?   (Video: [url=https://www.youtube.com/watch?v=lOa4if2Z_ok][u]https://www.youtube.com/watch?v=lOa4if2Z_ok[/u][/url][/font][font=Calibri])\r<br />\r<br />RIGUARDO LE VOCI DEI DRAGHI:\r<br />Ho bisogno di aiuto: se cavalcate un drago che non sia dei DLC (an Anziano, per esempio), o Odahviing, noterete che quando utilizza i suoi Urli ci saranno due\r<br />suoni, uno dell’”urlo” e uno per l’ &#34;effetto&#34;. Lo noterete ancheattivando i sottotitoli: il drago dirà &#34;Yol...Toor Shul&#34; o &#34;Fo...Kraah Diin&#34;(anche se non dicono esattamente quelle parole, come ho precedentemente scritto, è solo un suono, una specie di secondo ruggito). Ma se si prende ora in esame uno dei DLC (un Leggendario, per esempio) o Alduin, sentirete chiaramente la mancanza di questi suoni, e se attiverete i sottotitoli, questo drago non dirà nulla. Questo è un ulteriore problema per gli &#34;Urli personalizzati&#34; per i draghi: ho provato a crearne uno partendo dall’urlodi un Drago Antico, che ha quei suoni, ma quando con il CreationKit ho scambiato il suo di default (DragonFireBreathShout05) con il mio, di nuovo, mancava il suono di cui ho parlato. Penso che le 5 predefinite abbiano qualcosa correlato ad esse, ma al momento non ho trovato soluzioni.\r<br />Per queste ragioni dato che il CreationKit rivela che la magnitudo degli urli dei draghi Serpente e Venerabile è la stessa dei loro cugini Draghi Antichi (puoi anche controllarlo qui: [url=http://www.uesp.net/wiki/Skyrim:Dragon][u]http://www.uesp.net/wiki/Skyrim:Dragon[/u][/url][/font][font=Calibri]), ho deciso di inserire questi nella loro SpellList, invece che gli originali.\r<br />Se qualcuno avesse una qualsiasi idea (o un link per una mod che lo risolva) il suo aiuto sarebbe molto apprezzato :)\r<br />\r<br />RIGUARDO ALLE VOCI DEI DRAGHI E ALLLA VERSIONE POTENTE:\r<br />Se siete d’accordo ci potrebbe essere un altra soluzione: dato che ilDragonFireBreathShout03 e il DragonFireBalShout03 sono completi di tutti i suoni (sono quelli che, in teoria,dovrebbe usare una versione di Fuoco dei Draghi Bianchi, che nella versione finale del gioco sono diventati Draghi del Gelo, e così ne esiste solo questa versione) potrei cambiare questa magnitudo per urli migliori finalizzati alla Potent Version dei draghi evocati (per un gioco avanzato o difficoltà più elevate). Dunque, questo per quanto concerne gli urli di fuoco potenziati; per quanto concerne quelli del Gelo type pensavo di usare (e quindi modificare) il DragonFrostBreathShout03 e il DragonFrostBall03 (usato di default dai Draghi del Gelo) e dare ai Draghi del Gelo gli 04 (usati dai loro cugini anziani) o gli 05 (usati dai loro cugini Antichi) anche perché nella mio opinione I Draghi Bianchi del Gelo dovrebbero essere più potenti. [/font][font=Calibri]Fatemi sapere che ne pensate.\r<br />\r<br />[/font][font=Calibri]COSE DA FARE:\r<br />Agiungere una versione Maestro per tutti gli incantesimi e, se gli autori mi concederanno i loro permessi, aggiungere più draghi usando le skin dalle loro mod.\r<br />Trovare una maniera per permettere ai Draghi di usare il loro Urlo di Forza Inesorabile.\r<br />Magari cambiare i nomi dei draghi e dargliene di unici, ed i suggerimenti saranno bene accetti&#33;\r<br />\r<br />INSTALLAZIONE:\r<br />Mettere il contenuro della mod, il file ESP, nella cartella Data, che dovrebbe\r<br />essere qui:\r<br />C:&#92;Program Files (x86)&#92;Bethesda Softworks&#92;The Elder Scrolls V Skyrim - Legendary Edition&#92;Data\r<br />\r<br />Controllate se la mod è attiva nello Skyrim Launcher -&gt; FILE DI DATI\r<br />\r<br />\r<br />Oppure -&gt; usate NMM\r<br />\r<br />\r<br />La MOD è attualmente per la Legendary Edition.\r<br />Ho intenzione di rilasciare una Dawnguard ONLY version (i draghi useranno lo script di Durnehviir di cui ho precedentemente scritto, dato che non saranno cavalcati, non ci saranno problemi) e una Dragonborn ONLY (come nella Legendary, come ho precedentemente scritto, usate sempicemente Piega Volontà sui draghi anche se non volete cavalcarli per prevenire cose strane come Draghi che volano sottoterra). Per queste ragioni non credo che rilascerò una NO DLC version.\r<br />\r<br />\r<br />Non dimenticatevi di dare un&#39;occhiata alle altre mie mod&#33; :D : [url=http://www.nexusmods.com/skyrim/users/39122770/?tb=mods&pUp=1][u][color=#0066cc]http://www.nexusmods.com/skyrim/users/39122770/?tb=mods&pUp=1[/color][/u][/url]\r<br />\r<br />\r<br />Saluti, e felice Skyrim a tutti&#33;&#33;&#33;\r<br />\r<br />Rirgaril[/font]",
  "categoryId": "75",
  "version": "0.9",
  "author": "Rirgaril",
  "createdUnix": "1487853529",
  "updatedUnix": "1487962350",
  "containsAdultContent": false,
  "uploadedBy": "Rirgaril",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000237091",
      "name": "Draconic Mastery 0.9__ITA",
      "version": "0.9",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "57",
      "fileName": "Dracoic Mastery 0.9__ITA-82191-0-9.rar",
      "uploadedUnix": "1487853505",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/88a9912149d0cba24e3c10371ef26c5d5f8d2239702783736d3af0b1774b97b7/analysis/1487853842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dracoic%20Mastery%200.9__ITA-82191-0-9.rar?fid=1000237091&ttl=1535870887&ri=8192&rs=8192&setec=459ea8ec4a5e39d50097cb4ace803d09"
    },
    {
      "fileId": "1000237139",
      "name": "Draconic Mastery Shouts__ITA",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Draconic Mastery Shouts-82191-.rar",
      "uploadedUnix": "1487880083",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/647b5d2cd8338f7d28cffb9e827e2c8e7e350b90b9a2298a0e1828fe132a558e/analysis/1487880305/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draconic%20Mastery%20Shouts-82191-.rar?fid=1000237139&ttl=1535870888&ri=8192&rs=8192&setec=42f447a8f01489580b8e88f9f013e098"
    },
    {
      "fileId": "1000237146",
      "name": "Draconic Mastery Shouts__ENG",
      "version": "",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Draconic Mastery Shouts__ENG-82191-.rar",
      "uploadedUnix": "1487889149",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/48eb848907d8f3624a50035e2bc22f0a88e71b592e672261e0dfe98604b52b61/analysis/1487889302/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draconic%20Mastery%20Shouts__ENG-82191-.rar?fid=1000237146&ttl=1535870888&ri=8192&rs=8192&setec=63be7c317ff0f9de21959fe8e5822c34"
    },
    {
      "fileId": "1000237169",
      "name": "Draconic Mastery 0.9__ENG",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "59",
      "fileName": "Draconic Mastery 0.9__ENG-82191-0-9.rar",
      "uploadedUnix": "1487932430",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/56166259fb3d9d2bf4c202b14191e223bce7c77fccfd16b73938003d93745a3c/analysis/1487932682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draconic%20Mastery%200.9__ENG-82191-0-9.rar?fid=1000237169&ttl=1535870889&ri=8192&rs=8192&setec=f6edce2054ff6ddfa30ceedbefa87acf"
    },
    {
      "fileId": "1000237197",
      "name": "Draconic Mastery 0.9__ITA fixed",
      "version": "0.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58",
      "fileName": "Draconic Mastery 0.9__ITA fixed-82191-0-9.rar",
      "uploadedUnix": "1487962350",
      "modVersion": "0.9",
      "virusScanUrl": "https://www.virustotal.com/file/a18dc95dd6e01a4a34df1b3393191997512f7e1d28fe5e371c9eb023e1da9a2e/analysis/1487962566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Draconic%20Mastery%200.9__ITA%20fixed-82191-0-9.rar?fid=1000237197&ttl=1535870889&ri=8192&rs=8192&setec=ca6f6285a478b34fcb16cd7f4d8c8d21"
    }
  ]
}