{
  "modId": 82204.0,
  "modName": "Mainland Stalhrim - Stalhrim Outside Solstheim",
  "summary": "Mainland Stalhrim adds over 30 Stalhrim deposits scattered throughout Skyrim&#39;s mainland, mostly in Nordic ruins, but with a few exterior veins as well. It also removes the quest restriction on crafting Stalhrim items, and allows you to craft Ancient Nordic Pickaxes so you can gather Stalhrim without ever having to go to Solstheim.",
  "descriptionHtml": "[center][img]http://i.imgur.com/aLzuKZa.png[/img][/center]\r<br />\r<br />\r<br />Mainland Stalhrim aims to bring more variety to Skyrim&#39;s mining and crafting, by scattering veins of Stalhrim all across the mainland. It never made sense to me that the ancient Nords entombed their dead in Stalhrim, but only on Solstheim and not in Skyrim itself&#33; Now, you don&#39;t always need to go to Solstheim in order to find Stalhrim and craft Stalhrim weapons. The addition of Stalhrim to the mainland is immersive and lore-friendly, and my hope is that this mod will feel like it was a part of the game all along. [b]This mod requires the Dragonborn DLC.[/b]\r<br />\r<br />With Mainland Stalhrim installed, you can craft an Ancient Nord Pickaxe and start mining the precious ore. It also removes the quest restriction on crafting Stalhrim gear, so you don&#39;t need to progress through the Skaal quests just to be able to make Stalhrim weapons and armor. Plus, adds a craftable heavy variant of the Stalhrim shield.\r<br />\r<br />[b][SIZE=7]What does this mod do?[/SIZE][/b]\r<br />\r<br />Mainland Stalhrim adds veins of Stalhrim ore to over 30 locations spread all across the mainland of Skyrim. They&#39;re mostly found in Nordic ruins, but there are a few veins that can be found in the exterior of Skyrim as well. For a full list of locations where Stalhrim has been added, check the Readme tab. \r<br />\r<br />You can also craft your own Ancient Nordic Pickaxe so you can start gathering the Stalhrim without heading to Solstheim and completing quests. There are two ways to craft one: either by having the Advanced Armor perk (or your perk overhaul&#39;s equivalent), or by obtaining the Nordic Pickaxe Manual, which can be found at the Skyforge. As long as the manual is in your inventory, you can craft an Ancient Nordic Pickaxe without the Advanced Armors perk. It requires one Steel Ingot, one Quicksilver Ingot, and one Ebony Ingot to craft, just like Nordic Carved items. [b][size=4]Once either of these conditions are met, you will be able to craft an Ancient Nordic Pickaxe under the Iron tab in your smithing menu.[/size][/b]\r<br />\r<br />[center][img]http://i.imgur.com/maoeyC2.png[/img][/center]\r<br />\r<br />This mod also removes the need to complete the Skaal quests in order to craft Stalhrim items. Now, as long as you have Ebony Smithing, you can craft Stalhrim weapons and armor at any time.\r<br />\r<br />There&#39;s also a tiny side-feature of the mod: a craftable heavy variant of the Stalhrim shield, called the Stalhrim Heavy Shield. Its stats are in line with the rest of the heavy Stalhrim gear.\r<br />\r<br />All of these features combined means you can use Stalhrim items without ever having to go to Solstheim, and I think it adds some additional variety to the game. \r<br />\r<br />The font used in my screenshots is the amazing [url=http://www.nexusmods.com/skyrim/mods/77036/?]Sovngarde by MistValkyrie.[/url] Best font ever released for Skyrim if you ask me, go check it out&#33;\r<br />\r<br />[SIZE=7]Permissions[/SIZE]\r<br />\r<br />[url=https://robbiemod.wordpress.com/License]https://robbiemod.wordpress.com/License[/url]\r<br />\r<br />- Contact me before using anything from this mod. I will probably say yes.\r<br />\r<br />- If you contact me and I do not respond within 30 days, you have full permission to use this mod, in whole or in part, in any of your work. This includes compilations, conversions, and any derivative works.\r<br />\r<br />- No parts of this mod can be monetized under any circumstances. If you are caught monetizing this work, your permission to use any content from any of my mods is permanently revoked.\r<br />\r<br />- Credit me if you use something from this mod.\r<br />\r<br />- If you use something from this mod, your permissions should be open so other people can use it the same way you did.\r<br />\r<br />[b][SIZE=7]Compatibility[/SIZE][/b]\r<br />\r<br />Should be compatible with everything. In addition, this is an .esp-only mod that will leave no scripts in your save file, so it will be as clean of an uninstall as you can get.\r<br />\r<br />[b][SIZE=7]My Other Mods:[/SIZE][/b]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/53751/?][center][img]http://i.imgur.com/kSAnZiF.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/65607/?][center][img]http://i.imgur.com/uX3g6JA.jpg[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/76949/?][center][img]http://i.imgur.com/wt24bOb.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/79045/?][center][img]http://i.imgur.com/bh3nfCC.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66995/?][center][img]http://i.imgur.com/0fPggDT.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/45780/?][center][img]http://i.imgur.com/Oh1KZft.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66055/?][center][img]http://i.imgur.com/KK7LOim.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/50294/?][center][img]http://i.imgur.com/o1vzSpP.png[/img][/center][/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/66196/?][center][img]http://i.imgur.com/hObIhrQ.png[/img][/center][/url]\r<br />[center][img]http://i.imgur.com/V0ICmGW.png[/img][/center]",
  "categoryId": "100",
  "version": "v1.0",
  "author": "Robbie",
  "createdUnix": "1487207743",
  "updatedUnix": "1487207736",
  "containsAdultContent": false,
  "uploadedBy": "Robbie922004",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000236393",
      "name": "Mainland Stalhrim",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57",
      "fileName": "Mainland Stalhrim-82204-v1-0.rar",
      "uploadedUnix": "1487207736",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cedd490b074d636e1eb1fa215ec3036a97a1eb9eebd0921a96bd8135721f600f/analysis/1487208003/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mainland%20Stalhrim-82204-v1-0.rar?fid=1000236393&ttl=1535870900&ri=8192&rs=8192&setec=2c561f0028e200b20f4e6c2c432106c0"
    }
  ]
}