{
  "modId": 82206.0,
  "modName": "Stories In Skyrim",
  "summary": "A mod that adds different stories to Skyrim",
  "descriptionHtml": "[size=5]I won&#39;t be updating this for a long time. Been working on a new project way more exciting than this. A full Witcher quest mod including Witcher signs, original characters, and more. That won&#39;t be the end either. This next project is basically a test project. If it&#39;s well received I&#39;ll be working on a second quest mod. One that revolves completely around Witchers. The one I&#39;m currently working on will have a marryable ghost follower. I wrote the script. It&#39;s very linear. Will fix that.[/size]\r<br />Hey. This is my first mod so there might be a few bugs. Highly doubtful but maybe.\r<br />\r<br />This mod adds four stories to various places around Skyrim. They were written by me and a friend. The ones that say &#34;By Pooldead&#34; my friend wrote.\r<br />\r<br />I only have one that I wrote, it&#39;s labelled &#34;Ryan&#34;.\r<br />\r<br />Most are not lore friendly. The three my friend wrote have a Witcher theme. The one I wrote takes place in Skyrim and mentions various factions such as the Thalmor. It&#39;s two of my Skyrim characters. I&#39;ll be writing more with them. This mod will be updated as me and my friends write new ones.\r<br />There is a really good one that tells the story of two of my friends characters, Witcher theme, but its like 12 pages on a PDF. Don&#39;t know how long it&#39;ll be in the game.\r<br />\r<br />I had an idea to make an NPC that travels about selling them, but he was really buggy and couldn&#39;t quite get him to work. As of now the only way to get the books is by cheating or going to the places to get them. I&#39;m not gonna tell you at the exact location, where the fun in that. I&#39;ll give some clues obviously. Clues are at the bottom.\r<br />\r<br />\r<br />\r<br />Requirements:\r<br />Just the base game. \r<br />\r<br />Current Features:\r<br />Four stories in the form of books. Titles are, A Chance Encounter, Give A Little, The Lesser Evil and Wages Of Sin. The last three are all themed around Witcher. My friend said he was gonna make a story about one of his characters, it will be more lore friendly. No ETA on that.\r<br />\r<br />\r<br />Planned Features:\r<br />Write and add more stories.\r<br />Add an NPC that sells them.\r<br />This is in the deep future once I get better at modding and know how to script, I want make an entire quest mod that has a central focus around these books. I have the framework of a story so that might happen some day. If I make it, my preference will have it fully voiced.\r<br />\r<br />\r<br />Installation:\r<br />Install with NMM or MO.\r<br />or\r<br />just drag the files inside the zip file to your skyrim data folder and enable the plugin.\r<br />\r<br />Uninstallation:\r<br />It doesn&#39;t have any scripts, so all you need to do is uninstall it with NMM or MO or delete the files from Data folder. \r<br />Check the zip files for the files.\r<br />\r<br />Compatibility:\r<br />This doesn&#39;t edit any vanilla assets, other than moving a few things on a table to make room for the books. Unless you have a mod that completely changes the looks of interiors I wouldn&#39;t worry about it. Should be compatible with everything. It doesn&#39;t have any scripts. If it&#39;s not working then its definitely something on your end.\r<br />\r<br />\r<br />\r<br />Bugs:\r<br />There shouldn&#39;t be any. I fixed the majority of them while testing. If you notice some spelling or grammar issues post in the comments with a screenshot and I&#39;ll fix it.\r<br />\r<br />One thing to keep an eye out for, there may be some boxes in the books, this happens because the text system Skyrim and CK uses are very different from Word and Google Docs and certain characters don&#39;t work. This creates a nasty box. I think I fixed them all but if I didn&#39;t, post a screenshot in the comments and I&#39;ll fix it ASAP.\r<br />\r<br />\r<br />Load Order: \r<br />Load order shouldn&#39;t matter too much since it doesn&#39;t edit anything other than moving some items on a few tables. No scripts. Just to be safe put it lower on the loader order. Or have LOOT sort it.\r<br />\r<br />\r<br />\r<br />Final notes: \r<br />I worked very hard on this. It took a while to get some sort of things worked out. I&#39;m still new to CK so if something is wrong, it might take a little time to work things out.\r<br />\r<br />If you like my work, give me an endorsement. \r<br />\r<br />I&#39;m also in the process of writing another Skyrim story. The brainstorming is almost done. \r<br />\r<br />Permissions: \r<br />You DO NOT have my permission to upload this to any other site. If you want to upload it somewhere else contact me and I&#39;ll consider it.\r<br />You can freely make translations of this as long as you send me a link, credit me and Pooldead, and link back to this page.\r<br />If you know your way around CK and want to fix any problems that may have appeared you have my full permission. Please credit me though. However, this does not include taking the text and putting it in your mod. If you fix any problems send me a link and I&#39;ll update this.\r<br />\r<br />\r<br />Credits:\r<br />My friend, Pooldead, he&#39;s a very talented writer. He wrote most of these.\r<br />Axhoff2007 for the book cover resource.\r<br />Bethesda for making CK and such a great game.\r<br />Nexus Community for being so helpful and kind to new people.\r<br />\r<br />\r<br />Clues:\r<br />Give A Little: I am on an altar. One where people join hands forever.\r<br />Wages Of Sin: I am in a hall where the Empire puts their dead.\r<br />The Lesser Evil: I am on a dresser in a building on a tall mountain.\r<br />A Chance Encounter: I am in a building in the mountains where elves hold parties.\r<br />\r<br />\r<br />\r<br />Exact Locations if you want to find them yourself don&#39;t look.\r<br />[spoiler]\r<br />Give a Little: Inside the Temple of Mara on top of the altar.\r<br />Wages of Sin: In Solitude&#39;s Hall of the Dead on a table a little past the main door,\r<br />The Lesser Evil: In High Hrothgar, It&#39;s on a dresser. When you enter you go left.\r<br />A Chance Encounter: In the Thalmor Embasssy. It&#39;s on a table after you go through the door during that one quest in the main story. The door after getting the smuggled items.\r<br />[/spoiler]",
  "categoryId": "98",
  "version": "1.0",
  "author": "Ryan",
  "createdUnix": "1487219805",
  "updatedUnix": "1487218942",
  "containsAdultContent": false,
  "uploadedBy": "Ryyz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000236399",
      "name": "Stories In Skyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7873",
      "fileName": "Stories In Skyrim-82206-1-0.zip",
      "uploadedUnix": "1487218942",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bef03383de312eb41ce3103daa692e805e5f4fca543cb3e3ddc9f881b988539f/analysis/1487219131/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Stories%20In%20Skyrim-82206-1-0.zip?fid=1000236399&ttl=1535870902&ri=8192&rs=8192&setec=9e1eb89bd7a0ad16c45eebc60f88acbe"
    }
  ]
}