{
  "modId": 8222.0,
  "modName": "Stealth Character Immersion Fix",
  "summary": "It was killing my immersion playing an assassin / stealth based character when an enemy would go back to standing around and chatting with his buddy a few seconds after I shot an arrow into his head...this mod fixes that and makes being stealthy require more finesse.",
  "descriptionHtml": "Adjusts the length of time before an enemy goes back to normal if he was attacked (10 real-time minutes - was 15 seconds in vanilla).  That doesn\\'t mean you can\\'t continue to evade detection and continue your sneaky assault, but at least he will continue searching for the person that shot the arrow into his face or stabbed him in the back.\r\n\r\nAdjusts the length of time before an enemy goes back to normal if he successfully detected the player (5 real-time minutes - was 10 seconds in vanilla). \r\n\r\nAdjusts the length of time before an enemy goes back to normal if he was alerted to something suspicious (1.5 real-time minutes - was 10 seconds in vanilla).\r\n\r\nTweaks various other settings so that being stealthy is more challenging overall...\r\n\r\n\r\nCREDITS---\r\nI would like to credit and thank Plutoman101 for his excellent PISE mod which made very nice improvements to stealth and through which I got the idea to further refine stealth. \r\n",
  "categoryId": "77",
  "version": "1.0",
  "author": "Abraxas",
  "createdUnix": "1328701043",
  "updatedUnix": "1328701574",
  "containsAdultContent": false,
  "uploadedBy": "Abraxas77",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27071",
      "name": "StealthImmersionFix V1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "StealthImmersionFix V1-8222-1-0.zip",
      "uploadedUnix": "1328701574",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4c05deea0c46f483594208aca6c4d95e074cdccf33ce91f9d8cd47f72ea92042/analysis/1406660586/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/StealthImmersionFix%20V1-8222-1-0.zip?fid=27071&ttl=1535766753&ri=8192&rs=8192&setec=cbd3c423eda09dfe48bfd893a14b3e12"
    }
  ]
}