{
  "modId": 82220.0,
  "modName": "Solomon",
  "summary": "lul",
  "descriptionHtml": "WIP by Tyhélior pour Integra Gaming.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;h3&gt;Dans cette série de guides, nous allons parler du modding de &lt;strong&gt;Skyrim&lt;/strong&gt; avec deux angles d&#39;attaque.&lt;/h3&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: justify;&#34;&gt;D&#39;une part, on va analyser, comparer, décortiquer, et comprendre les outils à utiliser pour être capable de modder Skyrim sur mesure selon vos envies. Et d&#39;autre part, on va tracer une façon de procéder étape par étape, vous permettant d&#39;obtenir un jeu moddé de façon classique très rapidement, pouvant servir d&#39;exemple d&#39;application, ou alors de raccourci si vous voulez un résultat immédiat sans forcément devenir un pro du modding. La liste des guides à suivre dans l&#39;ordre est disponible à la fin de chaque étape.&lt;/p&gt;\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;&lt;h1 style=&#34;text-align: center;&#34;&gt;&lt;strong&gt;Guide 1 : Les préparatifs avant de commencer à modder Skyrim\r<br />&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: justify;&#34;&gt;Avant de commencer, je vous recommande de protéger votre sauvegarde si vous souhaitez continuer avec une ancienne partie. Il faut pour cela la copier dans un dossier autre que celui d&#39;installation de Skyrim. Les mods peuvent ajouter, modifier et supprimer des objets existants, donc charger/sauvegarder une de vos parties après avoir changé vos pack de mods peut provoquer des conflits dans votre sauvegarde, donnant l&#39;impression lorsque vous la chargerez plus tard que votre sauvegarde est corrompue. Quoi qu&#39;il en soit, la meilleure méthode selon moi est de recommencer une partie lorsque vous moddez votre jeu. Vous pourrez ainsi  profiter des nouvelles fonctions dés votre entrée en Bordeciel, sachant que certains mods altèrent le jeu dés les premières minutes.&lt;/p&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: justify;&#34;&gt;Un autre prérequis à beaucoup de mods est de posséder la version complète de Skyrim, incluant les 3 DLC : Dawnguard , Hearthfire et Dragonborn. Ces DLC apportent des fonctions sur lesquelles beaucoup de mods se basent pour se construire. De plus, leur contenus changent beaucoup le gameplay, donc n&#39;hésitez pas à faire main basse : &lt;a href=&#34;https://www.kinguin.net/fr/category/25185/the-elder-scrolls-v-skyrim-3-dlc-pack-steam-cd-key/&#34; target=&#34;_blank&#34;&gt;DLC de Skyrim ICI&lt;/a&gt; . Le DLC gratuit des textures haute résolution disponible sur Steam est également nécessaire.&lt;/p&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: justify;&#34;&gt;Une dernière chose, probablement la plus longue, déplacer les fichiers de jeux. Pour cela il faut désinstaller Skyrim (après avoir mis de côté vos sauvegardes si nécessaire) puis le réinstaller là ou on veut qu&#39;il soit. Pourquoi le déplacer? Par défaut, Skyrim est installé dans C:&#92;Programmes files&#92;Steam&#92;steamapps&#92;common&#92;Skyrim. Et ce répertoire est généralement protégé, et il se peut que certains logiciels que nous allons utiliser par la suite ne parviennent pas à faire leur boulot. Dans le doute, on réinstalle Skyrim ailleurs. Le plus simple étant de rester sur le disque C:&#92; mais dans un autre dossier.&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;h2&gt;Step by Step :&lt;/h2&gt;\r<br />&lt;br /&gt;Premier objectif : Protéger vos sauvegarde(même si je recommande de lancer une nouvelle partie pour éviter des crashs).\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Créez un nouveau dossier sur votre Bureau, nommez le &#34;Anciennes sauvegardes de Skyrim&#34;.&lt;img class=&#34;alignright size-medium&#34; src=&#34;http://www.dicofr.com/def2/image/postedetravail.gif&#34; alt=&#34;&#34; width=&#34;332&#34; height=&#34;215&#34; /&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Allez dans Poste de travail ou Ordinateur . Ouvrez votre disque local C:&#92;Utilisateurs&#92;[le nom de votre session]&#92;Mes documents&#92;My Games&#92;Skyrim&#92;Saves .&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Sélectionnez les sauvegardes que vous voulez conserver, puis clic droit et copier.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: justify;&#34;&gt;Retournez dans le dossier Anciennes sauvegardes de Skyrim que vous avez créé sur le Bureau et collez-y vos sauvegardes. Vous pouvez désormais déplacer ce dossier ou vous le voulez. Vous n&#39;en n&#39;aurez besoin que si vous décidez de terminer vos anciennes parties, ce qui vous demandera de jouer à nouveau sans mods.&lt;/p&gt;\r<br />&lt;br /&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Deuxième objectif : Posséder les DLC.\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Si vous ne possédez pas les extensions du jeux, ajoutez-les à votre bibliothèque Steam, en utilisant ce &lt;a href=&#34;https://www.kinguin.net/fr/category/25185/the-elder-scrolls-v-skyrim-3-dlc-pack-steam-cd-key/&#34; target=&#34;_blank&#34;&gt;lien&lt;/a&gt; par exemple. Sans oublier d&#39;ajouter dans Steam le DLC gratuit pour les textures haute résolution.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;&lt;img src=&#34;https://upload.wikimedia.org/wikipedia/en/c/c5/Video_Game_Cover_Art_for_Dawnguard.jpg&#34; alt=&#34;Dawnguard&#34; /&gt;&lt;img src=&#34;https://upload.wikimedia.org/wikipedia/en/7/79/Hearthfire.jpg&#34; alt=&#34;Hearthfire&#34; /&gt;&lt;img src=&#34;https://upload.wikimedia.org/wikipedia/en/a/a9/Dragonborn_Cover_Art.jpg&#34; alt=&#34;Dragonborn&#34; /&gt;&lt;/p&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: justify;&#34;&gt;Troisième objectif : Déplacer le jeux dans un répertoire qui peut être modifié.&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Ouvrez votre disque local C:&#92;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Créez un nouveau dossier, nommez le Skyrim.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Dans Steam, allez dans votre bibliothèque et faites un clic droit sur Skyrim, puis cliquez sur &#34;supprimer le contenu local&#34; pour enlever votre ancienne installation de Skyrim.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Lorsque cette opération est terminée, installez de nouveau Skyrim à partir de votre blibliothèque Steam, en indiquant comme répertoire d&#39;installation C:&#92;Skyrim.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;Un dernier point important, est de vérifier le nom de votre session. Si votre nom de session sur votre machine contient des accents ou d&#39;autres caractères spéciaux, certains logiciels utilisés dans les autres guides pourraient mal le vivre. Donc je vous recommande de changer Édouard en Edouard, Anaïs en Anais, Amélie en Amelie, Tyhélior en Tyhelior, etc.\r<br />&lt;br /&gt;&lt;h3&gt;Vous êtes désormais prêt pour commencer à modder Skyrim en suivant les autres étapes de ce guide.&lt;/h3&gt;\r<br />&lt;br /&gt;&lt;h4 style=&#34;text-align: right;&#34;&gt;Guides Suivant : Les différentes façons de modder Skyrim&lt;/h4&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Toute les étapes :&lt;/p&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Les préparatifs |&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Les différentes méthodes pour modder votre Skyrim.&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Il existe plusieurs façon pour vous de modder votre jeu, avec des avantages et inconvénients différents.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;La première est de coller/installer les mods directement dans votre dossier de jeu. C&#39;est extrêmement barbare, et on a besoin d&#39;effectuer une réinstallation si on fait une erreur/veut changer un mod. On ne va pas faire comme ça.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;La seconde est d&#39;utiliser le Workshop de Steam. La solution la plus simple mais aussi la plus limitée. Avec cette technique on ne peut pas changer l&#39;ordre d&#39;installation après coup, on n&#39;a qu&#39;un seul profil de jeu sauvegardé (on ne peut pas changer de panoplie de mod en un clic), en cas de conflit on doit se débarrasser d&#39;un mod sans possibilité de le rendre compatible avec ceux déjà présent, et il faut charger tout les mods à chaque lancement du jeu, ce qui peut rendre le jeu très long à lancer.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;L&#39;utilisation du Worshop est l&#39;idéal si vous voulez jouer avec un nombre très réduit de mods, à partir de 10 ça commence à faire beaucoup. À éviter pour prendre tout de suite les bonnes habitudes.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;La troisième méthode est de passer par un gestionnaire de mods.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Les deux gestionnaires de mods principaux sont Mod Organizer et Nexus Mod Manager. Les deux se valent et ont des intérêts et inconvénients différents. Au fur et à mesures des mises à jours, ils tendent à se ressembler et à posséder de plus en plus de fonctions communes mais ma préférence personnelle est pour NexusMM car il est plus facilement compatible avec les autres logiciels que nous allons utiliser.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Je ne vais pas les comparer longuement car les différences sont vraiment minimes, mais je vais présenter quelques détails qui peuvent avoir leur importances pour vous.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;-Si on souhaite lancer le jeu en vanilla (vanilla signifiant sans aucun mods) et qu&#39;on est utilisateur de NMM, il faut demander à NMM d&#39;ouvrir un profil sans mod, alors qu&#39;avec MO on peut lancer le jeu en vanilla depuis Steam. Pour moi cet intérêt est mineur vu que le but est de jouer avec les mods.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;-En contrepartie, si on est utilisateur de NMM, et qu&#39;on lance Skyrim depuis Steam, le jeu se lancera avec le dernier profil moddé utilisé et sera donc moddé sans avoir à allumer NMM. Si on veut lancer le jeu avec les mods sous MO, on a besoin de d&#39;abords lancer MO, puis Skyrim.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;-Dernier point, à l&#39;heure actuelle le jeu a besoin de quelques secondes de plus pour se lancer si on utilise NMM (je parle bien de secondes, pas de minutes). Cela reste très très court comparé à lancer le jeu en utilisant les mods du workshop de Steam, et pour être honnête je n&#39;avais pas remarqué ce délai avant qu&#39;on ne me le fasse remarquer.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Ces différences au lancements sont minimes, donc le seul argument qui ait eu du poids pour moi est la meilleure compatibilité de NexusMM, qui est le gestionnaire de mod qui est employé pour l&#39;ensemble de ce guide.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;La technique consistant à se limiter au Steam Workshop étant très intuitive (ainsi que très limitée) , elle n&#39;est pas décrite ici. Je vous recommande d&#39;ailleurs de ne plus l&#39;utiliser et de profiter dés à présent du potentiel que vous offre NexusMM, surtout maintenant que vous avez ce formidable guide à disposition. Pour pouvoir avancer il vous faut donc créer un compte sur le site du Nexus puis télécharger le logiciel Nexus Mod Manager et ensuite l&#39;installer.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Step by Step :\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Premier objectif : Créer un compte\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Cliquez sur &lt;a href=&#34;http://www.nexusmods.com/&#34; target=&#34;_blank&#34;&gt;ce lien&lt;/a&gt; pour vous rendre sur le site du Nexus.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;En haut de la page, cliquez sur &#34;not logged in&#34; puis sur &#34;create an account&#34;.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Sur la droite, cliquez sur le bouton vert &#34;register&#34;.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Sur la page suivante, vous avez tout un choix d&#39;option payante. Libre à vous de soutenir le Nexus, mais il vous est possible de descendre tout en bas de la page et de cliquer sur &#34;create account&#34; sans cocher d&#39;option payante pour obtenir un compte gratuit. Un compte gratuit est suffisant pour le modding.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Pour la suite il s&#39;agit d&#39;informations classiques à entrer/cocher/décocher/retenir pour créer votre profil. Je précise qu&#39;il faut passer par votre boite mail pour confirmer votre compte.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;Deuxième objectif : Télécharger NMM\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;En premier lieu il faut se connecter sur &lt;a href=&#34;http://www.nexusmods.com/games/?&#34; target=&#34;_blank&#34;&gt;le site du Nexus&lt;/a&gt; avec le compte que vous venez de créer. Sans compte les téléchargement sont bloqués.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Ensuite passez par &lt;a href=&#34;http://www.nexusmods.com/games/mods/modmanager/?&#34; target=&#34;_blank&#34;&gt;ce lien&lt;/a&gt; ou cliquez sur &#34;Instal NMM&#34; disponible en haut de chaque page du site.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Sur la droite cliquez sur le bouton vert &#34;download&#34; correspondant à votre système d&#39;exploitation puis suivez les instructions pour finir le téléchargement selon votre navigateur.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;Troisième objectif : Installer NMM\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Lancez le fichier que vous venez de télécharger.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Laissez la langue d&#39;installation sur anglais.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Choisissez I accept the agreement, puis faites next plusieurs fois jusqu&#39;au choix des tâches.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Cochez Toutes les cases &#34;Associate xxx with Nexus Mod Manager&#34; pour permettre à NMM de gérer les mods qui seront apportés plus tard. Cochez également &#34;Create a desktop shortcut&#34; , vous pourrez supprimer le raccourcis plus tard lorsque le modding sera terminé.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Cliquez sur next puis sur Install pour finaliser l&#39;installation.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;strong&gt;De Steam Workshop à NexusMM\r<br />&lt;br /&gt;&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Maintenant que NexusMM est téléchargé nous allons pouvoir faire la transition avec le Steam Workshop. Si vous n&#39;avez aucun mods dans le Workshop vous allez gagner un peu de temps, mais vous trouverez tout de même ici quelques informations qui pourront vous servir plus tard. Une première chose intéressante est qu&#39;on peut avoir à la fois des mods actifs dans NMM et dans le Workshop. Mais c&#39;est sale. Pour éviter les crashs au démarrage du jeu, augmenter la compatibilité entre les mods et diminuer le temps qu&#39;il faut au jeu pour se lancer, c&#39;est préférable d&#39;avoir tout les mods dans NMM, en précisant que tout les mods du Workshop se trouvent dans le Nexus, à de très rares exceptions près (et souvent pour une raison qui fait que vous ne voulez pas de ce mod dans vos fichiers). Il faut donc se désabonner de vos mods sur le Workshop, éventuellement en relevant le nom de ces mods pour que vous puissiez les ajouter plus tard à nouveau en passant par le nexus. D&#39;ailleurs, lorsque vous aurez terminé ce guide, rien ne vous empêchera de regarder ce qui est nouveau ou populaire dans le Workshop, puis d&#39;aller rechercher les mods qui vous intéressent dans le Nexus.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Maintenant qu&#39;on a installé NMM et qu&#39;on a fait nos adieux au Workshop, il est temps de lancer le Nexus. Lors du premier lancement, NMM va chercher vos jeux Bethesda pour savoir se qu&#39;il peut modder pour vous. Vous pouvez lui redemander de faire cela à tout moment pour vos autres jeux donc dés qu&#39;il a trouvé Skyrim vous pouvez stopper la recherche pour passer à la suite.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Maintenant que NMM est lancé, on va faire un tour d&#39;horizon des fonctions disponibles. Il y a deux onglets d&#39;affichages, Plugins et Mods. Dans l&#39;onglet plugins, un logiciel extérieur va s&#39;occuper de choisir dans quel ordre lancer les mods, et globalement on ne promènera pas le curseur par ici sans être vraiment sur de se que l&#39;on fait. L&#39;onglet dans lequel tout va se jouer pour nous est l&#39;onglet Mods. Sur la gauche de l&#39;onglet mods, le bouton avec un  plus vert permet d&#39;ajouter des mods téléchargé dans votre NMM. Lorsque le premier mod aura été ajouté, il y aura en dessous un bouton pour activer/désactiver les mods sélectionné, ensuite le bouton avec la feuille et le crayon permet d&#39;obtenir des détails sur les fichiers d&#39;un mod, le bouton avec les jumelles et la flêche orange permet de demander à NMM de chercher les mis à jours pour vos mods puis de les installer, la main avec le pouce levé vous permettra de dire que vous aimez certains mods, les votes sont ensuite remonté sur le site du Nexus pour déterminer les mods les plus appréciés.Le boutons suivant avec une liste permet de changer les dossiers de rangement des mods et le dernier boutons avec les deux flêches sur font vert permet de changer le mode d&#39;affichage. Je vous suggère d&#39;appuyer sur ce bouton pour cacher les dossier, cela vous montrera directement vos mods lorsqu&#39;ils seront là.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Sur le haut de la fenêtre, un bouton permet de lancer Skyrim comme avec Steam, le suivant vous permet de gérer vos profils de modding (typiquement; un vanilla, un stable, un avec les mods fraichement ajoutés). Lorsque vous passez d&#39;un profil à l&#39;autre, il peut y avoir un chargement plutôt long car les mods doivent être chargé/désactivé selon les profils. Lorsqu&#39;un nouveau profil est créé, il apparait comme une copie du profil actuellement actif. Je vous propose dés à présent de créer un profil nommé &#34;Vanilla&#34; vous permettant de lancer à tout le moment le jeu sans aucun mod, puis de créer un autre profil nommé par exemple &#34;Integra gaming&#34; dans lequel vous pourrez modder Skyrim à la mode de chez nous en suivant ce guide. Le dernier bouton qu&#39;on va apprivoiser maintenant est celui avec deux roues dentées. Il sers à régler toute les options restantes et je vous conseil de cliquer et de lire se qui est disponible. Les options par défauts sont bonnes, et je vous suggère juste d&#39;aller dans l&#39;onglet &#34;Download Options&#34; et d&#39;aller appuyer sur &#34;Fix It&#33;&#34; si vous êtes un utilisateur de Chrome ou d&#39;Internet Explorer.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Pour les curieux : Un mot sur l&#39;onglet Plugins (esm/esp)\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Premier objectif : Retirer les mods du Workshop\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;En théorie, si vous avez réussi à utiliser des mods du workshop, vous savez comment les retirer, mais dans le doute on va faire ça bien. La première étape est de demander à steam de lancer Skyrim pour qu&#39;il ouvre le lanceur du jeu.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Lorsque le lanceur est ouvert, au lieu de faire &#34;jouer&#34;, appuyez sur &#34;fichiers de données&#34; pour ouvrir la liste des .esm et .esp.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Dans cette fenêtre, dans la colone Load, il faut tout décocher sauf &#34;Dawnguard.esm&#34;, &#34;EarthFires.esm&#34;, &#34;Dragonborn.esm&#34; et les 3 &#34;HighResTexturePackXX.esp&#34;. Donc en gros les fichiers représentant vos DLC sont cochés et seulement eux. Si vous n&#39;avez rien d&#39;autre dans la liste c&#39;est que vous n&#39;aviez pas de mods dans le Workshop et vous pouvez passer à l&#39;objectif suivant directement.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Lorsque tout les mods sont décochés, il faut appuyer sur Ok dans la petite fenêtre et quitter le lanceur du jeu.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Retournez dans votre bibliothèque steam, dans la page de Skyrim. En dessous de Jouer et des Succès il y a la zone Steam Workshop, appuyez sur Parcourir le Workshop.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Une fois dans le Workshop, vous avez sur la droite un encart &#34;Vos fichiers du Workshop&#34;. Dans cet encart, cliquez sur &#34;Vos fichiers&#34; puis sur &#34;Objets abonnés&#34;, toujours sur la droite.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Dans ce menu, vous devez cliquer pour vous DÉSabonner de tout. Si certains mods vous tiennent à coeur vous pouvez relever leur nom et les ajouter plus tard avec le Nexus quand vous aurez terminé de suivre ce guide. D&#39;ailleurs, si les mods que vous trouvez essentiels ne sont pas réinstallé avant la fin de ce guide, n&#39;hésitez pas à les proposer dans les commentaires, je les ajouterais pour que tout le monde puisse en profiter ou je les ajouterais dans la collection de ceux qui ne sont pas compatibles.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;Deuxième objectif : Paramétrer le Nexus\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Lancez Nexus Mod Manager avec l’icône qui a été créée lors de l&#39;installation.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;NMM va alors rechercher les jeux qu&#39;il sait modder sur votre ordinateur. Dés qu&#39;il a trouvé votre Skyrim il écrit &#34;Found&#33;&#34; en vert en dessous de &#34;Skyrim&#34;, vous pouvez alors cliquer sur le tick vert de Skyrim, puis tout en bas sur &#34;Stop searching&#34; et enfin sur &#34;Quick startup&#34;.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Sur la fenêtre qui s&#39;ouvre sélectionnez Skyrim, cochez &#34;Don&#39;t ask me next time&#34; et cliquez sur Ok.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Maintenant que NMM est lancé, cliquez sur l&#39;onglet &#34;Mods&#34; puis sur le bouton sur la gauche avec deux flêches blanches sur un fond vert, cela devrait faire disparaitre les dossiers.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Sur le haut de la fenêtre, cliquez sur la flêche pointant vers le bas, à gauche du tournevis et de la clef et cliquez sur &#34;New profile&#34; sur le menu déroulant. Dans le pop-up qui apparait tappez &#34;Vanilla&#34; puis ok. Répétez l&#39;opération et cette fois-ci nommez le profil &#34;Integra Gaming&#34;.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Cliquez sur le bouton avec deux roues dentées pour afficher les options, puis sur l&#39;onglet &#34;Download Options&#34; puis sur le bouton &#34;Fix It&#33;&#34;. Vous pouvez fermer la fenêtre des options.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;strong&gt;SkSE et SkUI&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Ajouter un mods : SKSE\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;SkSE sur Steam\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;SkSE lazy sur le Nexus\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;intro MCM\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;SkUI sur Nexus\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;SkUI Hidden\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Premier objectif : Installer SkSE\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Deuxième objectif : Installer SkUI\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Un mot sur le site des mods traduits et Loverslab.\r<br />&lt;br /&gt;&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Les mods traduits en français permettent de garder une meilleure immersion dans le jeu si on n&#39;est pas parfaitement bilingue, mais ils présentent un défaut. Ces mods ne sont pas aussi bien pris en compte que les autres par certains logiciels de gestion de mods. Un élément important qui sera étudié en profondeur plus tard dans ce guide est l&#39;ordre de chargement des mods lorsque le jeu démarre. Pour déterminer cet ordre, on va utiliser entre autre des listes pré-établis par la communauté du modding, et\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Les mods classiques&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Les mods sans lesquels il est peu concevable de jouer une fois qu&#39;on les a essayés, ils améliorent le jeu sans être des révolutions, ils forment le package de base que beaucoup de joueurs utilisent. Pas vraiment de contenu en plus, pas de nouveaux objets, de nouvelles quêtes ou de nouvelles textures, mais des petits plus qui rendent la vie en Bordeciel beaucoup plus agréable.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/71214/?&#34; target=&#34;_blank&#34;&gt;Unofficial Skyrim Legendary Edition Patch&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/31255/?&#34; target=&#34;_blank&#34;&gt;Unofficial High Resolution&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/98/?&#34; target=&#34;_blank&#34;&gt;Time on loading Screen&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;A matter of Time\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/9557/?&#34; target=&#34;_blank&#34;&gt;Alternate Start&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/4929/?&#34; target=&#34;_blank&#34;&gt;A quality World Map and solsthein&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/17802/?&#34; target=&#34;_blank&#34;&gt;&lt;span class=&#34;header-name&#34;&gt;Climates Of Tamriel&lt;/span&gt;&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/3708/?&#34; target=&#34;_blank&#34;&gt;Main menu Randomizer&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/23600/?&#34; target=&#34;_blank&#34;&gt;Player Headtracking&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/43493/?&#34; target=&#34;_blank&#34;&gt;Hold Border Banners&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/18916/?&#34; target=&#34;_blank&#34;&gt;Lanterns of Skyrim&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/59904/?&#34; target=&#34;_blank&#34;&gt;Stones of Barenziah Quest Markers (FR)&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/2873/?&#34; target=&#34;_blank&#34;&gt;Speed Revised&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Un mod nécessaire pour le modding des personnages mais qui remplis déjà des fonctions de son côté donc je le met ici: &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/601/?&#34; target=&#34;_blank&#34;&gt;Realistic Ragdolls&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Un mod qui permet d&#39;avoir beaucoup plus d&#39;animation lors des exécutions qui sont très répétitives de base : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/34917/?&#34; target=&#34;_blank&#34;&gt;Deadly Mutilation&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Certains personnages féminin ont des animations masculines. Ce problème est réglé par &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/35155/?&#34; target=&#34;_blank&#34;&gt;Correct Gender Animations&lt;/a&gt; . Enfin Lydia est considéré par le jeu comme une vraie femme, ainsi que toute la population des femmes Orcs.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Guide Loot&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Ordre d&#39;installations =/= ordre de chargement.\r<br />&lt;br /&gt;Skyrim.esm\r<br />&lt;br /&gt;Update.esm\r<br />&lt;br /&gt;Dawnguard.esm\r<br />&lt;br /&gt;Hearthfires.esm\r<br />&lt;br /&gt;Dragonborn.esm\r<br />&lt;br /&gt;Unofficial Skyrim Legendary Edition Patch.esp\r<br />&lt;br /&gt;[Your other ESM files]\r<br />&lt;br /&gt;HighResTexturePack01.esp\r<br />&lt;br /&gt;HighResTexturePack02.esp\r<br />&lt;br /&gt;HighResTexturePack03.esp\r<br />&lt;br /&gt;Unofficial High Resolution Patch.esp\r<br />&lt;br /&gt;[The rest of your mods]\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Décors/ENB/LOD&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/607/?&#34; target=&#34;_blank&#34;&gt;2k classique pour la base&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Un ENB est un mod qui modifie lourdement le rendu visuel du jeu. Il ne remplace pas les texture, mais ajoute des effets sur le rendu avec un travail post-processing sur le moteur du jeu. Ici je vais vous en proposer plusieurs pour que vous puissiez choisir selon vos goûts.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;: RealVision/Seasons of skyrim/Sharp vision/Snapdragon\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Un autre mod qui joue un grand rôle dans la qualité visuelle est SMIM, il augmente de beaucoup le nombre de polygones utilisés pour donner forme aux objets. Ce mod n&#39;est pas décrit dans cette étape car il a besoin d&#39;être installé dans un ordre très spécifique avec certains autres mods qui jouent sur les détails du décors, il est donc décrit avec ces mods ainsi d&#39;être beaucoup plus facile à gérer pour les autorisations de réécriture sur les fichiers déjà existant.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;DynDOLOD\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Logiciels et techniques de dépannage&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/50305/?&#34; target=&#34;_blank&#34;&gt;SSME&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Détails du décors&lt;/strong&gt;&lt;strong&gt;/SMIM&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Design of the nords\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Enhanced night\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Static Mesh Improvement : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/8655/?&#34; target=&#34;_blank&#34;&gt;SMIM&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;sons\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Skyfall\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;better dynamic snow\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;vibrant aurora\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;hd fire effect\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/60/?&#34; target=&#34;_blank&#34;&gt;Enhanced Blood&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Guide TES5Edit&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Texture/squelettes/personnages pour femme (CBBE/UNP) et hommes\r<br />&lt;br /&gt;&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Avant d&#39;engager sur les mods qui vont vous permettre d&#39;avoir des visages tout kawaï ou super crédibles, des explications sur le grand nombre de mod qu&#39;il faut pour les corps. En ce qui concerne les corps, on va avoir besoin de plusieurs ajouts pour avoir quelque chose de complet. Il faut un body replacer,  une map, une texture , une specular texture, et un squelette.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Le Body Replacer, pour simplifier à l&#39;extrême, c&#39;est ce qui va s&#39;occuper de mettre de la viande sur le squelette. Les plus répandus sont UNP et CBBE. Il en existe beaucoup d&#39;autres (ADEC par exemple)  mais la majorité des mods sont compatibles avec ces deux-ci. Pour choisir entre CBBE et UNP, le choix ne se fait pas cette fois sur la compatibilité. CBBE est celui qui dispose du plus grand nombre de mods de vêtements et d&#39;extensions, mais une très grande partie de ceux-ci se trouvent sur Loverslab et ne nous intéressent pas ici car CBBE tend à faire de toute les pnj des pin-up de l&#39;extrême. UNP dispose de moins de mods d&#39;armures (comprenez &#34;moins de mods qui changent les armures en bikini&#34;) mais a un résultat un peu plus crédible et au moins avec lui c&#39;est possible de trouver des mods d&#39;armures lourdes qui cachent le nombril. Il existe pas mal de variation à UNP, comme SevenBase (7B) et UNP Blessed (UNPB) qui ont généralement les même compatibilités (il y a toujours des exceptions) mais avec des nuances dans les formes.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Pour tout les personnages :&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un premier mod pour avoir un vrai menu de création de personnages, avec beaucoup plus d&#39;options et même des possibilités extrême vu que les jauges ne sont pas bloqué à des valeurs crédibles : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/29624/?&#34; target=&#34;_blank&#34;&gt;Racemenu&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod pour avoir une texture de base sur tout se qui ne sera pas couvert par la suite : XCE&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Deux mods pour les yeux. L&#39;un pour avoir plus de choix : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/13722/?&#34; target=&#34;_blank&#34;&gt;The Eyes of Beauty&lt;/a&gt; et un autre pour avoir plus de réalisme : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/49963/?&#34; target=&#34;_blank&#34;&gt;True Eyes&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Pour les hummains :&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Des dents. De vraies belles dents. C&#39;est tout. :  &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/34346/?&#34; target=&#34;_blank&#34;&gt;Smile in HD&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Et pour terminer avec le visage, un mod qui permet d&#39;ajouter et de gérer les tâches de rousseurs : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/52841/?&#34; target=&#34;_blank&#34;&gt;Freckle Mania&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Pour les hommes :&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Ce mods contient le body, les meshs pour mains et pieds, des textures, et des éléments de visages. C&#39;est ce mod qu&#39;il faut supprimer si un jour vous voulez vous amuser du côté d&#39;un autre mod très connu, SoS (Shlongs of skyrim), disponible sur Lovers Lab et qui est la base pour tout ce qui est parties génitales. Pour ce guide, on va se limiter à ce mod , qui propose même une option sous vêtements permanent pour éviter de se retrouver avec le chibre à l&#39;air.  &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/2488/?&#34; target=&#34;_blank&#34;&gt;Better males&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Dans ce mod il y a des textures pour un résultat plus aboutis qu&#39;avec Better males (il est nécessaire que Better males soit installé) : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/26145/?&#34; target=&#34;_blank&#34;&gt;Smooth Males&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Specular texture: un mods qui ne donnent pas l&#39;impression que le personnage vient de se doucher alors que vous êtes en plein dans l&#39;action : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/32851/?&#34; target=&#34;_blank&#34;&gt;Sporty Sexy Sweat (M)&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Pour les femmes:&lt;/p&gt;\r<br />&lt;br /&gt;Première méthode, courte, avec un pack. Ce pack contient un body (UNP), une texture, un correctif pour la forme des pieds. Si vous voulez un résultat très très Safe For Work (donc pas de nudité, pas de formes généreuses, aucun mouvement de bouncing, donc en bref pas de ça :&lt;img src=&#34;http://rs818.pbsrc.com/albums/zz106/Rafterman1/Anigifs/bounce.gif~c200&#34; alt=&#34;&#34; /&gt; ) vous pouvez passer par ce mod : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/69898/?&#34; target=&#34;_blank&#34;&gt;SFW Body Mod&lt;/a&gt; et le compléter par celui-ci si vous voulez que votre personnage soit un minimum crédible en Dovahkiin : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/32329/?&#34; target=&#34;_blank&#34;&gt;Battle Hardener&lt;/a&gt; . Donc deux mods en tout pour cette méthode.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Seconde méthode (en 6 mods) :\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Pour le body il faut essentiellement choisir entre CBBE et UNP, et ma préférence va à UNP car j&#39;aime pouvoir ajouter des armures féminines qui ne soient pas des bikinis. Parmi les variantes d&#39;UNP j&#39;utilise UNPB car il permet d&#39;avoir des résultats beaucoup plus variés en mordant un peu sur les plates-bandes de CBBE : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/37900/?&#34; target=&#34;_blank&#34;&gt;UNPBlessed&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Des textures pour apporter une joli peau sur tout ce qui sera ignoré ensuite : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/35267/?&#34; target=&#34;_blank&#34;&gt;SG Female Texture&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mapping pour le corps : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/13377/?&#34; target=&#34;_blank&#34;&gt;Sporty Sexy Map normal map&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Des mesh pour ne plus avoir les pieds en un seul bloc: &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/37022/?&#34; target=&#34;_blank&#34;&gt;Femfeet&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Specular texture : Enfin un mod qui ne donne pas l&#39;impression que votre personnage peut être en effort permanent sans y laisser quelques gouttes : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/28946/?&#34; target=&#34;_blank&#34;&gt;Sporty Sexy Sweat (F)&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod pour permettre aux corps d&#39;être pris en compte par les calculs d&#39;HDT (un mod qui sera présenté plus tard dans ce guide) : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/72030/?&#34; target=&#34;_blank&#34;&gt;HDT Bounce and jiggles&lt;/a&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Notice: Dans files, descendez jusque la section update et cherchez &#34;Bounce and Jiggles 7.7 UNPB HDT Body&#34; (le 7.7 peut avoir changé entre temps). C&#39;est ce truc qu&#39;on veut. Faites Download with manager.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt; Un mod pour que les armures soient plus adaptées aux nouveaux corps : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/7305/?&#34; target=&#34;_blank&#34;&gt;UNP Armors&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Pour les non-beasts (humains, elfs et orcs)&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Une collection de cheveux pour avoir un peu plus de choix : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/10168/?&#34; target=&#34;_blank&#34;&gt;ApachiiSkyhair&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui permet aux pnj d&#39;avoir des cheveux issus de ce pack. Ca met un peu de variété dans le paysage : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/15411/?tab=2&navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D15411&pUp=1&#34; target=&#34;_blank&#34;&gt;Apachii NPC&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Encore plus de poils&#33; Une autre collection par d&#39;autres modders : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/68311/?&#34; target=&#34;_blank&#34;&gt;KS Hairdos&lt;/a&gt; .Un autre mods plus loin dans le guide permettra de révolutionner tout ça avec plus d&#39;animation.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Pour les beasts (khajit, argonian) :&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod de base qui améliorent les beasts, permettant d&#39;avoir un résultat convenable même sur les points qui ne seront pas modifiés avec les autres mods : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/944/?&#34; target=&#34;_blank&#34;&gt;Better beast race &lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui améliorent encore plus les khajits avec beaucoup de textures : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/5941/?&#34; target=&#34;_blank&#34;&gt;Cover Khajiits&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Et pour terminer quatre autres mods qui changent complètement les femmes &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/62193/?&#34; target=&#34;_blank&#34;&gt;Khajiits&lt;/a&gt; et &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/62574/?&#34; target=&#34;_blank&#34;&gt;Argoniennes&lt;/a&gt; et les hommes &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/70481/?&#34; target=&#34;_blank&#34;&gt;Khajitts&lt;/a&gt; et &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/70164/?&#34; target=&#34;_blank&#34;&gt;Argoniens&lt;/a&gt;.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Des Dreads pour les Argoniens sont linkés dans la partie HDT car à ce stade du guide il manque des mods pour les installer.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;squelettes : -&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Guide FNIS&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/11811/?&#34; target=&#34;_blank&#34;&gt;FNIS&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;squelettes : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/68000/?&#34; target=&#34;_blank&#34;&gt;XP32&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;HDT&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Le mod de base : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/53996/?&#34; target=&#34;_blank&#34;&gt;HDT&lt;/a&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod important pour la compatibilité des mods qui permettent à vos armures de suivre la physique amélioré. Contrairement à ce que son nom indique, il ne fait pas que permettre de porter des hauts talons mais empêche aussi les crash lorsque vous enfilez n&#39;importe quelle paire de bottes qui a la physique HDT : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/36213/?&#34; target=&#34;_blank&#34;&gt;HDT High Heels&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui contient des cheveux avec la physique amélioré : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/70363/?&#34; target=&#34;_blank&#34;&gt;HDT KS Hairdos&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un autre&#33; &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/57179/?&#34; target=&#34;_blank&#34;&gt;HDT Hairs de Fuse00&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui reprend les cheveux installés plus tôt dans ce guide, notamment ceux de Apachii, et leur permet de profiter du HDT à eux aussi : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/47000/?#&#34; target=&#34;_blank&#34;&gt;HDT Sky Hair Phy Project&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Encore un mod avec des cheveux qui utilisent HDT : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/60730/?&#34; target=&#34;_blank&#34;&gt;HDT  HHairstyle&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Le mod qui ajoute la possibilité aux Argoniens d&#39;avoir des Dreads et d&#39;être moins fades : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/54586/?&#34; target=&#34;_blank&#34;&gt;HDT Dread Tentacles&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;Un mod qui permet à la viande d&#39;utiliser la physique amélioré : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/54044/?&#34; target=&#34;_blank&#34;&gt;HDT BBP&lt;/a&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui doit être installé avant HDT équipment, donc je le met ici même s&#39;il n&#39;est pas dans la bonne section du guide : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/17416/?&#34; target=&#34;_blank&#34;&gt;Wearable Lanterns&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/57408/?&#34; target=&#34;_blank&#34;&gt;HDT Equipment&lt;/a&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;On va maintenant terminer le mod qu&#39;on a commencé à installer dans la partie sur le design des personnages; celui qui permet le bouncing. Si lors de l&#39;installation des mods pour les corps de femmes vous avez choisi la première méthode avec SFW UNP, alors sautez tout ce morceau. Pour les vrais, ça se passe &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/72030/?&#34; target=&#34;_blank&#34;&gt;ICI&lt;/a&gt; et on a plusieurs fichiers à récupérer.\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Première étape cliquez sur ce lien puis sur &#34;files&#34; pour voir les fichiers disponibles.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Dans cette liste, on a déjà récupéré quelque chose dans &#34;updates&#34; avec un guide précédent, pour le moment allez dans &#34;Main files&#34; et prenez vers la fin de cette liste &#34;Bounce and Jiggles 7.7b - HDT Havok Collisions Object&#34; en cliquand sur Download with Manager. C&#39;est celui qui fonctionne avec les capes. Ca va donner aux PNJ un objet qu&#39;ils auront dans leur inventaire (un &#34;Havok&#34;) et leur permettra d&#39;être mieu calculés. Le joueur n&#39;en n&#39;a pas besoin, vous pouvez vous débarrasser de ceux que vous trouveriez. Si vos compagnons n&#39;en n&#39;ont pas, vous pouvez leur en donner un que vous trouverez.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Lorsque vous avez ajouté à votre NMM et installé le mod du Havok on reste dans &#34;Main files&#34; et on va chercher les deux derniers morceaux. L&#39;un d&#39;eux est &#34;Bounce and Jiggles 7.7a Required XML Kit&#34;, faites download with manager et installez-le. Ensuite prenez &#34;Bounce and Jiggles 7.7 BM2 Reduced TBBP_Only&#34; et installez-le de la même façon. Ici je fait un choix de gout, mais pour avoir essayé si on n&#39;est pas en &#34;reduced&#34; les mouvements sont vraiments trop persistant dans le temps et ça fait un peu cet effet là : https://www.youtube.com/watch?v=RQXzOE12xuM mais avec les fesses et les seins . Je préfère &#34;Only&#34; à &#34;Belly&#34; car je préfère me dire que le dovahkiin est plus du genre à avoir des abdos qu&#39;une bedaine et  &#34;BM2&#34; permet d&#39;avoir les effets verticaux en plus de ceux horizontaux. Donc dans la liste, je vous encorage à prendre BM2,Reduced,TBBP_Only comme indiqué au dessus.&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Maintenant, on va chercher les modes de compatibilité. Dans Miscelleanous, prenez et installez :\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Bounce and Jiggles 7.7 - Female Hairstyles With Physics Compatibility Patch&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Bounce and Jiggles 7.7 - HHairstyles Compatibility Patch&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Bounce and Jiggles 7.7 - Skyrim Hair Physics Project Compatibility Patch&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui permet à l&#39;eau d&#39;avoir la transparence de l&#39;eau : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/51505/?&#34; target=&#34;_blank&#34;&gt;HDT transparency&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Le mod qui permet aux capes d&#39;utiliser HDT a été déplacé pour être installé après les capes. Vous le trouverez en poursuivant ce guide.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Divers (animaux, adoptions, factions)&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/32723/?&#34; target=&#34;_blank&#34;&gt;Windy Skkyrim&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Construction : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/30948/?&#34; target=&#34;_blank&#34;&gt;Pocket Empire Builder&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Races\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;(compatibilité dans bounce and jiggle)\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Quêtes&lt;/p&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Le pack de Falskaar, avec une zone, des quêtes, de la musique, premier accès par un donjon puis par bateau. Le moins je vous en dit, le mieux se sera quand vous découvrirez : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/37994/?&#34; target=&#34;_blank&#34;&gt;Falskaar&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;p style=&#34;text-align: center;&#34;&gt;Faction : Vampire&lt;/p&gt;\r<br />&lt;br /&gt;Concernant les vampires il y a beaucoup de mods. D&#39;une part parce que les vampires ont tendance à intéresser les moddeurs, et d&#39;autres part parce que dans Skyrim il y avait de la place pour les améliorer.\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Pour commencer léger, les canines. Dans la version vanilla, les vampires hommes ont des canines mais pas les femmes. Ce mod corrige ce détail qui ne peut pas être ignoré une fois remarqué:  &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/22522/?&#34; target=&#34;_blank&#34;&gt;Female Vampire have fangs&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui revamp les mécanismes pour plus de profondeur dans le gameplay en vampire : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/9717/?&#34; target=&#34;_blank&#34;&gt;Better Vampire&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mode pour que les vêtements de vampire soient adaptés au body UNP : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/43741/?&#34; target=&#34;_blank&#34;&gt;Vamps UNP&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Équipement et Craft&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/19733/?&#34; target=&#34;_blank&#34;&gt;Immersive Armors&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/27644/?&#34; target=&#34;_blank&#34;&gt;Immersive Weapons&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Vêtements : &lt;a href=&#34;http://www.loverslab.com/files/file/813-empire-coat-a-hdt-test/&#34; target=&#34;_blank&#34;&gt;HDT Empire Coat&lt;/a&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui recalibre complètement le système de craft. Il inclus également un mod qui ajoute beaucoup de capes (cloaks of Skyrim) et un autre qui ajoute la possibilité de se crafter des sacs, ceintures, poches (Bandolier - Bags and Pouches) dans le but de pouvoir transporter plus de choses. &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/49791/?&#34; target=&#34;_blank&#34;&gt;Complete Crafting Overhaul&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un mod qui permet aux capes de cloaks of Skyrim (inclus dans Complete Crafting Overhaul) d&#39;utiliser la physique amélioré, mais sur le joueur uniquement. Il existe un équivalent qui applique l&#39;effet sur tout les PNJ mais il consomme beaucoup plus de ressources et provoque facilement des crash. Si vous donnez une cape à un compagnon, il aura aussi l&#39;effet car la cape sera passé par votre inventaire. &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/72581/?&#34; target=&#34;_blank&#34;&gt;Illustrious HDT Cloaks of Skyrim&lt;/a&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Un Fix de compatibilité avec un autre HDT : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/72030/?&#34; target=&#34;_blank&#34;&gt;cliquez sur ce lien pour le FIX&lt;/a&gt; puis sur files et dans Miscellaneous prenez et installez HDT Bounce and Jiggles 7.7 - Illustrious HDT Cloaks Patch.7z.&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/58704/?&#34; target=&#34;_blank&#34;&gt;Arbalètes&lt;/a&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Des vêtements steampunk, optionnel, mais j&#39;adore les colliers avec des clefs. &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/43609/?&#34; target=&#34;_blank&#34;&gt;Osare Culort Outfit&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Immersif&lt;/strong&gt;\r<br />&lt;br /&gt;&lt;ul&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Vous vous souvenez des packs de cheveux qu&#39;on a installé? Certaines coiffures sont prises en charge par HDT mais pas toutes. Ceci est la solution, qui permet d&#39;imprimer un mouvement aux cheveux en fonction du mouvement de la viande du corps, et seulement s&#39;ils sont longs. Il y a deux liens, car deux mods différents pour deux packs de coiffures différents. Il faut prendre les deux. Pour KS Hairdos : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/75915/?&#34; target=&#34;_blank&#34;&gt;Hairdos Weight&lt;/a&gt; et pour Apachii: &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/76059/?&#34; target=&#34;_blank&#34;&gt;Apachii Weight&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;     &lt;li&gt;Seulement 1 bague? Mais j&#39;ai dix doigts pourtant. : &lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/26355/?&#34; target=&#34;_blank&#34;&gt;Ringlimiter&lt;/a&gt;&lt;/li&gt;\r<br />&lt;br /&gt;&lt;/ul&gt;\r<br />&lt;br /&gt;&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/14950/?&#34; target=&#34;_blank&#34;&gt;Convenient horse&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;MCM&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;Enderal&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;&lt;strong&gt;OSA&lt;/strong&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;NB :Papyrus, T3nd0s, mode faux plein écran, Falskaar, Skyrim performance booster ,&lt;a href=&#34;http://www.nexusmods.com/skyrim/mods/64591/?&#34; target=&#34;_blank&#34;&gt;Pirates FR&lt;/a&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt; \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;WIP by Tyhélior pour Integra Gaming.",
  "categoryId": "94",
  "version": "",
  "author": "Tyhelior",
  "createdUnix": "1487284808",
  "updatedUnix": "1487284808",
  "containsAdultContent": false,
  "uploadedBy": "Tyhelior",
  "primaryFile": null,
  "files": []
}