{
  "modId": 8228.0,
  "modName": "SIM - Skyrim npc Immersion Mod",
  "summary": "A large project that will breathe new life into Skyrim and make it feel more like a living and realistic world adding new npcs such as adventurers,new random encounters and much more! Everything in this mod is OPTIONAL to suit your playstyle",
  "descriptionHtml": "[color=#01DF01] Skyrim immersion mod [/color]\r\n\r\nCompatible with [color=#01DF01] Wars in  Skyrim [/color] there have been no reports of conflicts\r\n\r\nhttp://skyrim.nexusmods.com/mods/26217 [color=#01DF01] (UPDATED VERSION) [/color]\r\n\r\nIf you do any videos or reviews on this mod, I ask you just let me know in a PM first\r\n\r\n1. Description and Version\r\n2. Next Release Contents and Currently working\r\n3. Installation\r\n4. Credits and Usage\r\n5. BUGS and Incompatibilties\r\n\r\nALL THE FILES RELEASED WILL BE OPTIONAL, SO DONT BE PUT OFF IF YOU DONT LIKE 1 PART, AS YOU CAN TURN IT OFF\r\n\r\n1. [color=#01DF01] Description[/color] \r\nThis mod adds many new features to skyrim, from hundreds of new NPCS (including travellers on the roads to adventurers in random dungeons to assasins furfilling contracts) plus many more things to make the game more exciting and more immersive for the player.\r\n\r\nNPCs will not be everywhere, as some gamers may not be able to handle the strain of so many NPCs, so there is an average amount of NPCs and random events going on\r\n\r\n\r\n[color=#FF4000] SIM- NPC Additions[/color] \r\n[color=#FF4000] SIM - NPCSUBMITTED[/color]\r\n[color=#FF4000] SIM - NPCAdditionsHOSTILEesp[/color]\r\n[color=#FF4000] SIM - NPCwerewolves.esp [/color]\r\n[color=#FF4000] SIM - Treasures Anywhere.esp [/color]\r\n[color=#FF4000] SIM - Water Bug fixes[/color]\r\n\r\n\r\nHeres the status so far:\r\n\r\n\r\n\r\n[color=#FF4000] SIM- NPC Additions[/color]  (adventurers and travellers added to Skyrim) \r\n\r\nAdventurers and Travellers moving through the land, there are not millions of them.\r\nCurrently only includes \\'adventuerers\\' and \\'travellers\\' of every race and a few player submitted characters.\r\nThere are also other things like nobles and bodyguards and other random people out there.\r\n\r\n\r\n\r\n[color=#FF4000] SIM - NPCSUBMITTED[/color]\r\nContains about 10 npcs going about their business, those in this file are ALL player submitted characters and all the credit for these goes to the people who submitted them.\r\n\r\n\r\n[color=#FF4000] SIM - Water Bug fixes[/color]\r\n\r\nFixes a bug in whiterun with the water\r\n\r\n[color=#FF4000] SIM - NPCAdditionsHOSTILEesp[/color] \r\n\r\nAdds thieves, assassins attacking other people and other fights such as vigilants of stendarr attacking vampire owned dungeons at random as well as a few other hidden surprises if your lucky enough (or unlucky enough) to stumble across them.\r\n\r\n[color=#FF4000] SIM - NPCwerewolves.esp [/color]\r\nAdds random werewolf attacks on towns (very rare though), a rare chance at finding a werewolf in the wilderness and makes werewolves just slightly tougher to kill.\r\n\r\n[color=#FF4000] SIMTREASURE anywhere.esp [/color] \r\nJust a little optional file I threw in\r\nAdds a small chance of finding any loot in ANY container, combined with enchanted items overhaul this will also include High level loot\r\nat any level\r\n\r\n\r\n\r\n[color=#01DF01]2. NEXT RELEASE [/color] \r\nI am no longer working on this mod at the moment but I WILL be coming back to it at some point in the future, as i am happy with the way it turned out and is now stable. There are plenty of adventurer type mods out there, but please continue to comment and if a universe destroying bug is encountered I will sort it out.\r\n\r\nAt the moment its stable and working good, and theres little more I can do without crowding up the game memory as theres enough NPCs running around\r\n\r\n\r\n[color=#01DF01]3. Installation [/color]\r\nSimply copy to you skyrim/data folder\r\nThen download the secondary file for [color=#01DF01] Water bugfixes [/color]\r\n\r\nDo not use Nexus Mod Manager, as it seems to have problems updating this mod, a manual install by copy and paste is recommended. I Use NMM for other mods, and just copy and paste this file and it works so theres no real need to use NMM with this mod.\r\n\r\nDue to the nature of the ai packages, I suggest you wait 24 hours in game for them all to load, otherwise you may (or may not) be flooded with 5-6 NPCs, once the 24hours has passed they will be less common, but the first 24hours may get crowded while they all load their packages\r\n\r\nI recommend completing the helgen start before activating this mod as it will interfer with the start of the game when starting a new game. Once you get to Riverwood, it will be ok\r\n\r\nDont forget to tick the water bug fix.esp.\r\nIf it doesnt work, untick all the esp files. Then save. Tick all the esps except waterbugfix.esp. Load the game. Save the game. enable waterbugfix.esp. Then save again. This should force the whiterun water to dissapear.\r\n\r\n[color=#01DF01] 4. Credits and Usuage  [/color]\r\n\r\nCredits go to those who have submitted their characters to this mod\r\n\r\nYou may NOT upload this mod anywhere else (including the steam workshop) You may not profit from it or use any of the files with it\r\nfor your own mods. If you wish to use something ask me first\r\nHowever if you wish to contribute, contact me on the Skyrim nexus and you get credit for your work on this mod\r\nOf course anything you contribute you are free to do with as you please, but some of the new meshes etc are not owned by myself and permission was obtained so you will need to contact the original author to see about those files\r\n\r\n\r\n[color=#01DF01] 5. Bugs  [/color]\r\n\r\nPossible bug with werewolves not attacking, this could be a mod conflict with something that either edits werewolves or adds the player to certain factions (causing the werewolf to be friendly)\r\n\r\n\r\n[color=#01DF01] Incompatibilities  [/color]\r\n\r\nNone have been reported, but if you find one ill be happy to try and resolve it with the auther of the other mod",
  "categoryId": "78",
  "version": "Version2.4",
  "author": "thelonewarrior",
  "createdUnix": "1328703721",
  "updatedUnix": "1331476697",
  "containsAdultContent": false,
  "uploadedBy": "thelonewarrior",
  "primaryFile": null,
  "files": [
    {
      "fileId": "39241",
      "name": "Version 2 point 2",
      "version": "2.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "275",
      "fileName": "Version 2 point 2-8228.zip",
      "uploadedUnix": "1330710658",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/6628caf25701431960255c6f97a7bb3653f07f7a5d989f98b2b0c3385421079e/analysis/1406725503/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%202%20point%202-8228.zip?fid=39241&ttl=1535766765&ri=8192&rs=8192&setec=5f2ca85d4e055a19a17904fdf75a4a43"
    },
    {
      "fileId": "40166",
      "name": "Version 2 point 3",
      "version": "2.3",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "376",
      "fileName": "Version 2 point 3-8228.zip",
      "uploadedUnix": "1330907635",
      "modVersion": "2.3",
      "virusScanUrl": "https://www.virustotal.com/file/5957264c1be1ef910c9681a2e58f2a64cb253ea92fa49e37218c1ec826b7cc45/analysis/1406731265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version%202%20point%203-8228.zip?fid=40166&ttl=1535766765&ri=8192&rs=8192&setec=9ebfe5f115ef9c34cb8224061a37053b"
    },
    {
      "fileId": "42309",
      "name": "Version2 point 4",
      "version": "2.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "389",
      "fileName": "Version2 point 4-8228-2-4.zip",
      "uploadedUnix": "1331476697",
      "modVersion": "2.4",
      "virusScanUrl": "https://www.virustotal.com/file/4e89e50b327d30a38cfaa0e81c54a9b54e0908fb6d26086435fb75f68dd68851/analysis/1406743328/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Version2%20point%204-8228-2-4.zip?fid=42309&ttl=1535766766&ri=8192&rs=8192&setec=cd61fba557d981047fd03b131ceda6fc"
    }
  ]
}