{
  "modId": 82290.0,
  "modName": "Requiem - Lost Grimoire Patch",
  "summary": "An attempt at patching Lost Grimoire for Requiem.",
  "descriptionHtml": "Hello, Requiem mages. \n<br />\n<br />I really do enjoy Steelfeathers' Lost Grimoire mod, but I adore Requiem as well. Therefore, I've done my best to balance the former to function in a way that is cohesive, balanced and enjoyable with the latter.\n<br />\n<br />To this end, I made many changes to the mod:\n<br />\n<br />- I have massively increased the magic costs of spells in most cases so that they are more in line with Requiem costs.\n<br />\n<br />- The prices of books have also been increased to a great degree, balanced around Requiem's costs.\n<br />\n<br />- Nerfed several previously strong spells in a logical way (Infestation no longer can be cast on Plague Spiders for infinite spiders; the spell Black Swarm no longer affects undead, machines, inorganic Daedra, dragons and so on, which it did previously; Divine Aegis (which negated two physical attacks completely) now only negates a single attack, costs a base 240 magicka and requires Stendarr's good graces to invoke; Shapeshift Wings no longer boosts your attack speed, among many, many others changes)\n<br />\n<br />- in general, spell effects will balance better with Requiem. For example: summoning spells now only last &lt;10 seconds before modifiers.\n<br />\n<br />- Removed several redundant spells, mostly summon animal ghost spells which Requiem already provides, but also Teleport, Open Lock and Greater Telekinesis. Featherlight is now Featherfalling II and provides immunity to fall damage in addition to slow-fall and waterwalking.\n<br />\n<br />- Changed the descriptions of spells to be more \"flowery\" to fit the spirit of Requiem. Most instances of \"you\" or \"your\" referencing the player have been removed, now referring to \"the caster\" instead. No crucial information has been compromised as a result of these revisions-- while Requiem has been known at times to be intentionally vague, no numbers have been left out here. Some names have been altered as well, such as \"Wyvern Scales\" simply becoming \"Dragon Scales\" , \"Dremora Seducer\" becomes \"Dark Seducer\", \"Medusa's Stare\" becomes \"Petrify\".\n<br />\n<br />- Kept clean of dirty edits. Makes minor changes to base Requiem (Featherfalling was renamed to Featherfalling I)\n<br />\n<br />- Dummied out the sneak damage perk. I did this for two reasons- as most spells are simple energy (and only two ice spells have a physical component) spells lack the precision required to deal lethal damage to unaware targets. Secondly, the implementation of the effect was rather busted-- all it did was multiply your spell magnitudes by 3.00 while isSneaking on the player returned to true. This could lead to all sorts of brokenness, so rather than leave that can of worms opened, I decided to remove the effect entirely (by changing the magnitude to 1.00)\n<br />\n<br />Version 1.2 has brought some new changes, and I see no reason why it should conflict with the additions of Requiem 2.0.\n<br />Of particular note, I have made some previously weak summons up to par with Requiem summons (The Desperate summons, Lingering Shade and Ghostly Skeevers in particular), nerfed Spectral Staff, rebalanced spell tome prices and fixed certain spell tomes appearing in the wrong Formlists, as well as making a few overly expensive spells more cheap to cast.",
  "categoryId": "84",
  "version": "1.2",
  "author": "anoobindisguise",
  "createdUnix": "1487575514",
  "updatedUnix": "1523235482",
  "containsAdultContent": false,
  "uploadedBy": "ANoobInDisguise",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000236781",
      "name": "Requiem - Lost Grimoire Patch",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "59",
      "fileName": "Requiem - Lost Grimoire Patch-82290-1-0.zip",
      "uploadedUnix": "1487575221",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/05db65f642b78f3979286733c48adb362aa514e0b8f8d633eae62de369958bc9/analysis/1487575385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Lost%20Grimoire%20Patch-82290-1-0.zip?fid=1000236781&ttl=1535870994&ri=8192&rs=8192&setec=8c1ba2c651dc8606174ca3ad1334d983"
    },
    {
      "fileId": "1000245862",
      "name": "Requiem - Lost Grimoire Patch",
      "version": "1.11",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63",
      "fileName": "Requiem - Lost Grimoire Patch-82290-1-11.zip",
      "uploadedUnix": "1496359323",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/99bdab30ce98b28bacf6c5c28189e05280126ae08b67e00c55b1dff9aa1d2251/analysis/1496359563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Lost%20Grimoire%20Patch-82290-1-11.zip?fid=1000245862&ttl=1535870994&ri=8192&rs=8192&setec=0f2c39013beabdf73fac1d3c17a69e70"
    },
    {
      "fileId": "1000270323",
      "name": "Requiem -- Lost Grimoire Patch",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "64",
      "fileName": "Requiem -- Lost Grimoire Patch-82290-1-2.zip",
      "uploadedUnix": "1523235482",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/b63bb9347f7aaf209df3e6300bfbbb342840d8f44df33baed750b5eff1e4ab20/analysis/1523235603/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20--%20Lost%20Grimoire%20Patch-82290-1-2.zip?fid=1000270323&ttl=1535870994&ri=8192&rs=8192&setec=7e51f4c93ecd6143104e9a171000fb76"
    }
  ]
}