{
  "modId": 82303.0,
  "modName": "This is Not a Mod",
  "summary": "This is a short story/character profile based on my use and enjoyment of various mods. It began as a showcase of in-game snapshots, but I decided to add a  story to thematically connect some of the pictures. It is intended as a love-letter to the Nexus and to modders everywhere.",
  "descriptionHtml": "[color=#efefef][u][size=5]INSTRUCTIONS[/size][/u]\r<br />\r<br />[size=2]If you&#39;re here looking for a Skyrim mod, please leave with my apologies. Truly, we need not be enemies. You only have to exit the page. It was wrong of me to post this / it was wrong of you to mistrust the title - it&#39;s fine. No hard feelings. [/size]\r<br /> \r<br />[size=2]If, however, you are open to the idea of staying here and NOT discovering a mod--if you are tough enough to handle that everything I am offering is featured on this page--you are invited on a journey. You are welcome, reader, to continue onward, beyond this very sentence and into the glory of my disclaimer.**[/size]\r<br />\r<br />[size=2]**Author&#39;s Note: Do not proceed if you are highly sensitive to disclaims.[/size][/color]\r<br />\r<br />[u][font=Tahoma][color=#ffe599][size=5]DISCLAIMER[/size][/color][/font][/u]\r<br />[size=2][font=Arial]\r<br />[/font][color=#ffd966]The following story is not to be taken seriously. Seriously. It was made over a very stony Saturday and in order to connect an eclectic arrangement of pictures. The writing found below is intended to entertain those interested, without taking up much of their time. [/color]\r<br />[font=Arial]\r<br />[/font][color=#ffd966]WARNING: there are (towards the end of the story) pictures with nudity for the sake of nudity, and I make no secret of depicting a way far-out, and totally excellent drug trip. There are also descriptions of acts of violence that may be considered gruesome or gratuitous (although I would be surprised to hear such an accusation). In short, the content found below is aimed at grown-ups, and not a lick of it is consistent with (or even relates to) Elder Scrolls lore.[/color]\r<br />\r<br />[color=#ffd966]Nothing depicted on this page is intended to disrespect/make suggestions for/mislead other people about the mod(s) that make each snapshot possible. The whole idea is, every picture you see is impossible without particular mods. For the sake of entertainment/compulsion, I decided to connect these pics with a sort of character profile, based on the play-through of a character I recently role-played as.[/color]\r<br />[color=#ffd966]Nearly all of the writing is contrived and unedited. I made this for the bored, not the critical (although I welcome all criticisms, constructive or otherwise). If you feel comfortable with everything stated in the disclaimer, please continue on to the story already mentioned.[/color]\r<br />\r<br />[color=#f9cb9c]\r<br />[/color][/size][color=#f1c232][size=6]SKY-MOD STORIES[/size][/color]\r<br />[size=4][color=#e69138]     THE WAY OF THE SWORD[/color]\r<br />[/size][left][color=#d8d8d8][u][font=Courier New][size=4]\r<br />OPENING SCENE[/size][/font][/u]\r<br />[/color]\r<br />[color=#ff7700][img]http://i1126.photobucket.com/albums/l616/ironprimate/01%20-%20thinking_zps5sl0qytk.png[/img][/color]\r<br />[font=Comic Sans MS]   For the moment, I am considering the nature of motivation. It is early; time dedicated to solitary thought has been unsatisfactory. \r<br />\r<br />Across the lake, a lone bird sings. I have assigned the intervals of its notes the power to impede me. So long as the song continues, I am closed to any sense of duty.\r<br />[/font][font=Comic Sans MS]\r<br />Oxgrave military deserters have reported an &#39;unchallengeable warlord&#39;  mysteriously claiming dominion over the entire Eastern settlement. It seems a humongous man wielding unrecognizable weaponry has begun &#39;exploding&#39; people, rapidly amassing a bodycount.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />The humongoid, apparently outraged that members of the Ox-Guard did not kneel before him upon a &#39;glorious and wrongly unsung return&#39;, demonstrated astounding levels of brutality and strength.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />When Oxgrave soldiers regarded their opponent as a derelict and  madman, the derelict approached the first to openly mock him, tearing the young soldier&#39;s jaw from his skull. The rest of the unit barely managed to draw their weapons before being &#39;wildly crushed and splattered like fodder&#39;. Within heartbeats, the mad warrior  had reduced a Xal-L&#39;am trained squadron to chunks of gore and metal.\r<br />[/font]\r<br />\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/02%20-%20alone%20closeup_zpsppr7b3ck.png[/img]\r<br />[font=Comic Sans MS]The tiny scavenger&#39;s song ends. Looking out on now-invisible starlight, I fail to locate the source of my inner contraventions.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]One half-moon ago, surviving witnesses described impossibly fast movement, given the immensity of his armor, and an extraordinary clawed gauntlet, massive and of unknown technological origins, capable of producing flashes of &#39;blue, focused lightning&#39;, burning and tearing apart targets who managed to escape his hand-to-hand range. More than ninety dead by the time Lith alerted me, mostly citizens. \r<br />\r<br />[/font][font=Comic Sans MS]The engineer responsible for this weapon&#39;s design had once explained to me the mechanics of his newly invented projectiles, though I am merely qualified to report that lightning is no way implemented. In any case, I am the closest operative fit to terminate the abuse of such power.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Standing above the water, I question myself as to why I informed Lith of nothing...decidedly, I was annoyed with her gadget-spliced Frost-wolf messenger: a gods-forsaken creature who, thanks to Lith&#39;s  maniacal merging of underdeveloped devices with remnants of repurposed flesh, has become more machine than beast.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/03%20Amatsu%20robo%20dog_zpstgjrse6b.png[/img]\r<br />\r<br />[font=Comic Sans MS][i]Yes[/i]. I assure myself I had been irritated with Matsu, the poor monstrosity. Lith engages in nauseating pastimes; there is no dishonor in withholding superfluous information from her.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]I brood with intent: festering on small matters distracts true dishonor. The omnipresent adaptations of such disgrace weave an eternal thread, a common strand connecting all of life to the shame of survival. [/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />I have learned about shame.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />Every moment I stare with each unaccomplished thought--every meal, [/font]orgasm, painting, or needless rest--more die. Children and their mothers die frightening deaths. They die a death I wield the power to prevent. This truth permeates each realm I have walked, and I am warned that no world baring intelligence exists free of such a law. [/left][left][font=Comic Sans MS]\r<br />Although I cannot shelter awareness for long, any manipulations of my own experience are irrelevant. Truth remains with or with out knowledge of the dead. [/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />On Ohni, the dead never fear for lack of company.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />The inhabitants of Oxgrave do not recognize their destroyer. They have already asked for his demands, for an identity. They have attempted to survive in every way that makes sense to them. Those who have witnessed his wrath have attempted surrender--pleaded and begged--desperately demanding to know what they must do to end the horror. [/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />Such pleas are tantamount to death rattles. To earn his favor, his victims must praise a name that he will not, in his madness, share with another being. [/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />As I reconstitute focus, I am offended to remember his name. I remember it well, and find it unworthy of my departure. Begrudgingly, I release unformed thought-activity, collecting food rations along with a fire-striker and steel.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />Preemptively, I am familiar with the worthlessness of this journey.\r<br />[/font]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/04%20Head%20shot%20Thoughts_zpsuovmmqjb.jpg[/img]\r<br />[font=Comic Sans MS]   I am called Ora. I was born on a world without language, raised to live as a starving beast lives. My people possessed no intentions. They were aimless creatures governed by instinct; ignorant of the stars, free of the bonds of concept. \r<br />\r<br />When I had barely approached womanhood, timeline-jumpers, interdimensional conquerors called the Akei, visited my homeworld. Few of us were spared. \r<br />[/font][/left][font=Comic Sans MS]The Akei assimilate only those individuals who, as they see it, demonstrate possession of a warrior&#39;s spirit. From their perspective, little effort was required in elevating us above the lowly, animalistic state in which I, and other useful specimens of our unnamed world, were discovered.\r<br />[/font][font=Comic Sans MS]\r<br />As a child, I was permitted to live. I was taught the way of the sword, indoctrinated and trained by Ora Greenstar, a grandmaster of the order of Akei. \r<br />[/font][font=Comic Sans MS]\r<br />As a young man, Greenstar succeeded in reaching Sukurai form; a feat considered impossible for his age and bloodline. As the overseer of dozens of conquests, Ora proved worthy of his power, quickly earning the title of Akeisai Grandmaster, soon ranking among the greatest known warriors in the omniverse. \r<br />[/font][font=Comic Sans MS]\r<br />With great mastery and calculation, he trained me as his apprentice, slave, and lover. \r<br />[/font][font=Comic Sans MS]\r<br />Under Ora&#39;s guidance and throughout scores of conquests, I grew skillful and accustomed to a sense of inherent glory. Many worlds were claimed before the Akei encountered a worthy foe, a race clever and willful enough to sacrifice themselves, trapping the entirety of Akei forces, along with their own civilization, in the Eathershpere. \r<br />\r<br />There, in constant combat, outside of the passage of time, I studied Ora. As he fought without restraint, battle after battle, I observed each triumph--his every application of force--and I began to learn. I learned until I understood, finally resolving to act on my understanding. With bodily preparations made, I meditated on my meticulously acquired knowledge, reaching closer to the source of my own formation, until I myself achieved a Sukurai state. \r<br />\r<br />My ascension was not forewarned. Neither Ora, nor any of my superiors could have calculated the possibility. Ages thereafter, I surpassed my master&#39;s skills, claiming his name, life, and sword as my own. Nameless and disgraced, he banished himself to the mystlands of the Earthersphere, and I inherited Greenstar&#39;s rule over the Akei. \r<br />\r<br />Countless enemies fell before I learned of the existence of spatial-rips, temporary tunnels connecting a vast system of planets; a system charted by interdimensional map-makers. Evidently, pollutants produced by the dimension-traversing vessels of these explorers had triggered unforeseen consequences within the Eathersphere, a plain intrinsically tied to all timelines. \r<br />\r<br />When a spatial-rip arose, embodying my only means of escaping the Eathersphere, I quietly chose to exploit it. Sending them on a fabricated assignment, I secreted myself away and betrayed the Akei. In an act of supreme cowardice, I rejected my role as grandmaster, abandoning them in an endless war, a construct of continual death and reincarnation without rest.\r<br />[/font]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/04B%20ScreenShot22_zpsguhnherr.png[/img]\r<br />\r<br />[font=Comic Sans MS]The spatial-rip was bridged to this world, Ohni, where I have subsisted for twelve rotations. Ultimately, I remain uncertain of my own agenda, and this planet offers little in the way of meditative conduction. \r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]There is much suffering here. After lifespans of survival, I chose to enter an unknown plain - anywhere to escape immortality and the Eather Wars. And though I am intimate with darker realms, I have come to a noisy world; a crowded planetoid whose capacity for cruelty reaches the farthest corners of its oceans. \r<br />[/font]\r<br />Blood lust and avarice drive the evolutionary engine of this land; it is a place of exploitation and dread.\r<br />\r<br />[font=Comic Sans MS][img]http://i1126.photobucket.com/albums/l616/ironprimate/05%20-%20Skyvengers%20assemble%20ScreenShot0_zps46rgexwn.png[/img]\r<br />Throughout my endeavours, I have taken interest in exceptional beings encountered, some of whom I&#39;ve worked alongside to establish an ongoing alliance. Pooled resources and our combined efforts and skills have proven essential in the prevention of otherwise unsolvable threats. \r<br />Over time, citizenry grown increasingly aware of our deeds popularized a moniker, in reference to recognizable members of our organization, &#39;The Sunkeepers: Protectors of the Star of Ohni&#39;. A pious and greatly inaccurate sentiment, it has nonetheless come to symbolize our group&#39;s largest-scale societal standards. \r<br />\r<br />While many of us have become petty offenders and corrupt individuals within our personal routines, it has remained clear each time a circumstance, an urgency of enormous scale, necessitates our concerted response.\r<br />\r<br />One lunatic laying waste to a single kingdom is hardly worth an organized undertaking.This morning, I am visiting Ra&#39;ina, though not as a fellow a Sunkeeper. Rather, I am seeking imparted wisdom.\r<br />\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/06%20-%20Raina%20the%20ghost_zpsc1uscoaz.jpg[/img]\r<br />Though the material relationships holding her &#39;consciousness&#39; in tact are less than consistent, Ra&#39;ina is a seer of ancient talents. She possesses a deep understanding of nature--far superior to my own--and is sometimes prone to sharing such understanding with an audience. \r<br />\r<br />She is shoveling glowing stones into a fire-pit producing dark blue flames. Though Ra&#39;ina senses I have arrived, she makes no adjustments to her task, and I adapt to dodging the loose stones violently spilled with each  rigid exertion.\r<br />\r<br />   &#34;Malthor Stoneskull has come to Ohni...how is this possible?&#34;\r<br />Ra&#39;ina laughs a disconnected chortle and remarks, &#34;He reignited your time-rip...I can&#39;t say what method was used, but it would&#39;ve been a collapsing bridge. Amazing that he survived.&#34;\r<br />Ra&#39;ina does not bluff. Hearing that she cannot theorize as to the means by which Malthor reopened the portal to Ohni, I let my curiosity wither.\r<br />   &#34;...It has fractured his mind. He wages war like this world should recognize him.&#34; She continues to laugh and shovel. \r<br />   &#34;And has he summoned you?&#34;\r<br />   &#34;No. Lith received reports of slaughter. I will investigate, and I will end him as I have always ended him...somehow, the idea that he cannot revive in this realm weighs on me.&#34;\r<br />   &#34;Would you like me to console you for pains of stupidity and grief?&#34;\r<br />   &#34;I want to understand the conflict. Tell me if my misgivings are true.&#34;\r<br />\r<br />Ra&#39;ina, with uncharacteristic cooperation, releases her corporeal influence to study my mind, focusing on the characteristics of my inner experience. \r<br />\r<br />She concludes her search and tells me, &#34;Your sparks are connected. You saw him rise to greater strength and purpose in a cycle marked by your unquestionable dominance....through his dance of defeat, rebirth, and heightened ambition, you grew to love him. Worse, you appear to pity the monster.&#34;\r<br />I am quietly wounded with Ra&#39;ina&#39;s confirmation, and adjust my will accordingly.\r<br />\r<br />   &#34;You were born with a great and foolish heart, Ora Greenstar.&#34; Ra&#39;ina taunts me, returned to her work. I nod with gratitude and give back her solitude. Exhausted and disinclined, I move on, towards Oxgrave.\r<br />\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/07%20-%20failure%20to%20reason%20-%20insanity_zpsaupx942b.jpg[/img]\r<br />Three and quarter Moons pass before I arrive. With depleted food rations, and more embittered to have taken up the task than when I began, I approach evidence of Malthor&#39;s work: burnt carcasses and pieces of animals and people haphazardly strewn....no damage to surrounding structures. Malthor appears to have retained his pathological love for all things architectural.\r<br />\r<br />By the time I reach him, I am disgusted by our history. I spit saliva like venom, and shout at him with no respect. &#34;Malthor Stoneskull&#33;&#34;He turns around clumsily, and I leap from the mountain slope to stand before him, glaring with the wrath of a wounded and foolish lover.\r<br />\r<br />   &#34;What treachery is this? You, who knows my greatness, challenges me? You question my dominion?&#34;\r<br />   &#34;You are lost and brain-damaged. In this realm, I am the only one who knows you...command your thoughts, Malthor Stoneskull. We duelled many times in the Eathersphere. Can you remember that I am Ora--can you remember the Akei warlords you swore vengeance on?&#34;\r<br />   \r<br />It seems the words bare meaning to him, but are quickly re-imagined.\r<br />   \r<br />   &#34;You jest, to suggest travel outside of my realm...you are the jester of a greater being...mmh-hahh, the whore of S&#39;yana&#33; Ah-ha-Haaa&#33; I recognize you now. I am amused, child.&#34;\r<br />   &#34;That doesn&#39;t make sense. What you are doing makes no sense. Look around, Malthor Stoneskull. You have no army, no servants. You&#39;ve gone mad in a completely useless way. Your legacy will only die here for it. But I can help you. I have allies who will try to repair your mind...journey with me, and you will meet them.&#34;\r<br />\r<br />Whatever he imagines is preconstructed. Now, he doesn&#39;t miss a beat.\r<br />\r<br />   &#34;Your accusations are laughable, whore&#33; I have slain those guilty of treason and sent for renewed forces. My dreadspores will multiply and impose rule. Go. Tell your master she is to pay tithing in ten moons time.&#34;\r<br />   &#34;A dreadspore is a diseased corpse programmed for planet-wide contagion. They cannot be organized or commanded as a force...dammit...where are they, Malthor? What have you done with them?&#34;\r<br />   &#34;You know nothing. From across all seas and distant lands, every being seeks loyalty to the Stoneskulls. To break with this is to welcome death.&#34;\r<br />   &#34;That was your world, fool. Before the Eathesphere, before - all of it. You came here in the name of revenge...Think, Malthor.&#34;\r<br />\r<br />I nearly believe in his thought activity before he gropes at his genitals, stating, &#34;Come, then. You&#39;ve done your duty to S&#39;yana. Follow me to the bath; I am weary from battle.&#34;\r<br />\r<br />I clear away feeling and scan for reflections of truth, briefly annoyed that, as Ra&#39;ina&#39;s student of the technique, she would see far deeper and with greater clarity than me. But I am capable. I am soulbound to this cretin...\r<br />   \r<br />&#34;I see that, before you escaped the Eathersphere, you captured a sporewalker, maybe several. You must have plotted to ravage this planet, as the Akei ravaged yours. Where are they? Where did you arrive?&#34;\r<br />He laughs with the purity of genuine delusion.\r<br />   &#34;My greatness is law and dominance absolute. You are confused, and mad. You speak of world destruction, though I am the arbiter of this world, to do with as I see fit. You insult me, whore. My affinity for S&#39;yana will not protect you.&#34;\r<br />   &#34;I&#39;ve been insulting you this entire discussion, you stupid, purposeless, bastard. There is no S&#39;yana, or any other ally. You are reconstructing your own memories to makes sense of a broken perception. I am mercy, Malthor: I am here to help you, but you are in a desperate position. You must demonstrate some awareness of your condition, or I cannot permit you to live.&#34;\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/08%20-%20Malthor%20showdown_zpsvrqxtt45.jpg[/img]\r<br />[font=Comic Sans MS]   &#34;Permit?&#34;\r<br />[/font][font=Comic Sans MS]Malthor clutches his dreadful cleaver and raises his clawed gauntlet, screaming &#34;You permit nothing&#33;&#34;\r<br />[/font][font=Comic Sans MS]It seems I have planted a thought to witch no alternative interpretation is available. \r<br />If I allow him to land an attack, I will be destroyed. One connection with his axe or a single charge of his blaster will cleave my soul from its mortal shell. Survival demands my lack of hesitation.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />Before he can aim, faster than he is capable of responding to the movement, I sidestep his approach, leaving Malthor vulnerable to a wide, uninterrupted strike. A single swipe of my blade disconnects his head from body. I have slain him similar movements in a dozen duels before, but for the first time, in a distant way, I am disturbed by the act. \r<br />\r<br />I sought to avoid his end, and am sick with resentment for the bond forged between us.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Weak and bitter, I collect my fallen foe&#39;s weapon, now a mere gadget for Lith to deconstruct and meddle with. I look away from Malthor&#39;s body and let go of the urge to desecrate it. I am certain he managed it; he has brought any number of sporewalkers with him, across a time-bridge into Ohni. \r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]A single untracked carrier is a planetary hazard. Without knowing where to focus efforts, each passing moment increases the chance of, not a collection of deaths, but the destruction and end of an entire evolutionary timeline.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Cursing his name quietly, I move at heightened speed towards the closest signal tower. I will need time to repair the damage done by elevating my energies to a Sukurai state, but organization is imperative. In order to preserve intelligent life on Ohni, all available Sunkeepers must be informed and positioned, prior to the outbreak. \r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]My allies have not witnessed the raw force and pure indifference with which a dreadspore infestation consumes a world. No amount of description will help our cause. We must wait for evidence of the epidemic, and prove capable of tracking, containing, and eliminating it without oversight.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/09%20-%20Assemble_zpsynyjjbay.png[/img]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/10%20-%20%20blue%20team_zpsmjynzznb.png[/img]\r<br />[font=Comic Sans MS]\r<br />Within a half-moon, I arrive at the Sunkeeper&#39;s Communications Outpost designed by Lith. Inside, I activate all emergency beacons and wait for the collection of devices to follow their programming. Moons pass, and members begin to arrive. Without delay, all those contacted are present, ready for briefing.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Neglecting to reveal the low odds of our success, I explain that an extinction-level disease will soon show activity, and that it must be followed and expertly wiped out when it does.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]I divide the twenty-two Sunkeepers in attendance into five teams, directing each team to occupy a specified region. Everybody&#39;s mission is the same: camp and scout until sporewalker populations grow large enough to be tracked effectively.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]All operatives depart according to their assigned regions; my own squad is invited to my homestead for the night. Along the way, staggering and drooling blood as I struggle to maintain consciousness, concealing the extent of my damage from the others becomes a futile effort. Offered assistance, I admit to underestimating the danger of sustaining Sukurai form for so long.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Heightening my speed during the trip to the signal tower has placed me in dire need of healing. Graciously, Semira reveals her supply of cyphollithyn mushrooms, a fungus with powerful medicinal properties. Cyphollithyn, properly developed, allows its user to repair mind and body at an incomparable rate. \r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]We stop by the lakeside and my allies watch quietly, waiting on me to slowly and shakily ingest several toadstools of the foul tasting medicine.\r<br />\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/11%20-%20shroom%20stage%201_zpsqvmrm7if.png[/img]\r<br />[font=Comic Sans MS]The effects of the fungi are underway.\r<br />\r<br />When we do arrive at our destination, I remain too weak to undress. Semira, bound by her nature, offers to collect and wash my apparel. I speak out to discourage such self-depreciating kindness, but find language has transmorphed. It exists in my head like a stream of silent colors; a wave of expression that cannot be directed.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/12%20%20-%20Shroom%20lvl%202_zpslsugw6bw.png[/img]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/13%20-%20shroom%20lvl%203_zpslsk5dm15.png[/img]\r<br />[font=Comic Sans MS]I grip the colors to dust, and feel self-hood melt into a vacuum. With a final conscious intention, I travel, free of resistance, into the reconstruction of experience. \r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Figments born of spiralling, breathing amalgams of light and texture shift shapes, assuming varying forms of ancient terrestrial creatures. \r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Surrounded by glowing wisps of inverted space, oscillating and dancing through crackling ribbons of raw energy, thoughts are not thoughts; everything is feeling. Everything is an impression: the awareness of plummeting towards and away from nothing.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/14%20-%20shroom%20lvl%20%204_zpstsdxhl83.png[/img]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/15%20-_zpssvpfqcvq.png[/img]\r<br />\r<br />[font=Comic Sans MS]Suddenly, a sense of self begins to take shape. Inhabitants of parallel spaces become visible and irresistible. Shadows and vibrations with no order mutate, collapsing and rising in an infinite orchestra of sensation. Perception slams into my waking reality, and my entire being radiates with wondrous euphoria and horror.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/16%20-%20Phyche-skulls_zpsvbpeab4k.jpg[/img]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/17%20-%20Phycedelia%20climactica_zpszzogtlo6.png[/img]\r<br />[font=Comic Sans MS]I find myself outside of time, beyond all recognizable influence.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Somehow, there is a choice to make. I am stabbed and burned with the knowledge that I must choose. I am too afraid to deliberate...I make the same choice that I have always made.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/18%20-%20ghostform_zpssimnbxbg.png[/img]\r<br />[font=Comic Sans MS]Eventually, the shame of my existence finds its way back to me.\r<br /> [/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Time realigns as a linear construct. The deepest deception of a conscious output, the illusion of separation, takes up its mantle.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />I am empty within a full universe.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/19%20-%20Strange%20light%20bright%20night_zpsr8ggwtjt.png[/img]\r<br />[font=Comic Sans MS]With the reforming of my consciousness, the night has passed. I allow the mushrooms to finish their course and meditate to assist my body&#39;s recovery. I am unsure for how many hours I have been seated. My team-mates are sleeping deeply.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Peering into the twilight, it occurs to me that I am a miserable spouse. Leta has been alone for more than ten moons. Discomfitingly, the sense that she has always deserved a more suitable partner sweeps across me. I have long-since been an unfit lover. I realize now that I am also a questionable friend.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/20%20-%20LEta%20and%20Ora_zps30ihhdok.jpg[/img]\r<br />\r<br />[font=Comic Sans MS]There is no one to whom I am greater indebted. Leta has loved me from the beginning. In all my undertakings, I have repeatedly failed to earn the quality of her love. I have received it like a mystic prize I possess no means of reciprocating.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]Her patience is profound and capacity for empathy greater than any other being I have known. \r<br />\r<br />She has tried to protect me from myself, tried to offer an escape from the trials and habits that overwhelm me. In return, I have spurned her. I have hurt her; abused her; forced myself on her when I needed only to act kinder.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]There is no simpler means of contacting a personal sense of inadequacy than to look upon Leta&#39;s beauty. Her sex and affection are greater than me; greater than anything I can offer in return. \r<br />[/font]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/21%20-%20try%20to%20breakthrough%20-_zpsjowhzisq.jpg[/img]\r<br />[img]http://i1126.photobucket.com/albums/l616/ironprimate/22%20-%20hurting%20leta_zpsgmwhkbij.jpg[/img]\r<br />[font=Comic Sans MS]Perceptive as she is curvaceous, Leta has only forgiven my excuses and weaknesses. She has seen when I mean to manipulate and dominate her; she has always seen and is only able to forgive. She only incentivizes me to be better, yet the basic conditions of my nature remain.[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]\r<br />She is a happiness I cannot pay back.\r<br />\r<br />[/font][img]http://i1126.photobucket.com/albums/l616/ironprimate/23%20-%20alone%20again_zpsxqnrsv4e.png[/img]\r<br />[font=Comic Sans MS]It is early in the morning. Leta remains protected in the inner sanctum of our home. My team-mates have slept through the night and will soon rise. There is much work and training to be done.\r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]For the moment, I am alone. Until the minutes pass, until my thoughts are slain and resurrected to be slain again, I will rebirth and burry myself beneath them. \r<br />[/font][font=Comic Sans MS]\r<br />[/font][font=Comic Sans MS]For the moment, I am considering the nature of motivation.[/font]",
  "categoryId": "28",
  "version": "1",
  "author": "Axanima",
  "createdUnix": "1487647199",
  "updatedUnix": "1487646295",
  "containsAdultContent": false,
  "uploadedBy": "axanima",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000236896",
      "name": "Sky-Mod Stories",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6143",
      "fileName": "Sky-Mod Stories-82303-1.7z",
      "uploadedUnix": "1487646295",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/020b1f2d2a8af6760c2bbf1530ce8a32cfa0117f9f4f1414083f7341fdab9b24/analysis/1487646489/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sky-Mod%20Stories-82303-1.7z?fid=1000236896&ttl=1535871013&ri=8192&rs=8192&setec=e95c612ee6cf2ae80d4ec6964baf7078"
    }
  ]
}