{
  "modId": 82418.0,
  "modName": "Tribunal Robes and Masks DV - Enderal Version",
  "summary": "Adds craftable robes suitable for battlemages in six different colours and three styles (clothing / light / heavy armour) as well as four different masks.\r<br />Fügt schmiedbare, für Kampfmagier geeignete Roben in sechs verschiedenen Farben und drei Kategorien (Kleidung / leichte / schwere Rüstung) sowie vier verschiedene Masken ein.",
  "descriptionHtml": "=== Kurzinfo ===\r<br />Version: 3.0\r<br />Datum: 26.02.2017\r<br />Kategorie: Rüstung\r<br />Autoren: Natterforme und Zairaam (EV), Nitha (DV)\r<br />\r<br />==== Beschreibung ====\r<br />Die Mod fügt neue craftbare Kampfroben für Magier ein&#33; Es gibt je eine schwere, eine leichte und eine Kleidungsvariante in den Farben Blau, Grün, Rot, Schwarz und Weiß - mit leichten Unterschieden im Look. Sie bestehen jeweils aus Handschuhen, Kürass bzw Robe (Kleidung), Stiefeln und Kapuzen.\r<br />Außerdem (separate esp) gibt es noch passende Masken in den &#34;Farben&#34;/Materialien Bronze, Silber, Gold und Ebenerz.\r<br />Die Rüstungen sind verbesserbar, auch wenn sie verzaubert sind. (Es nervt mich, dass das in Enderal nicht implementiert ist und man normalerweise eine Mod dafür braucht ...)\r<br />\r<br />=== Fundort ===\r<br />Die Roben können an jeder Schmiede ab einer Handwerkskunst von 40 geschmiedet werden, da ihre Werte den Wegestreuen- und Aeternarüstungen recht ähnlich sind. Dafür werden u.a. Schattenstahlerz (schwere Variante) bzw. Malachit (leichte Variante) benötigt, aber keine Baupläne.\r<br />Außerdem sind sie in den Leveled Lists ab Level 35 zu finden.\r<br />\r<br />=== Installation ===\r<br />Das Original von Natterforme und Zairaam wir benötigt: [url=http://www.nexusmods.com/skyrim/mods/20077]Link[/url]\r<br />Kopiert die Ordner Meshes und Textures aus dem Original in euren Skyrim-Data-Ordner (Standard: C:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;skyrim&#92;Data). Fügt dann die deutschen ESPs ein und aktiviert sie im Launcher.\r<br />\r<br />Die Rüstungen sind kompatibel mit allen Rassen (soweit von mir getestet). Für Feedback bin ich dankbar.\r<br />\r<br />LG und fröhliches Spielen,\r<br />Nitha",
  "categoryId": "106",
  "version": "3.0",
  "author": "Nitha",
  "createdUnix": "1488105671",
  "updatedUnix": "1488105667",
  "containsAdultContent": false,
  "uploadedBy": "Masterofdesaster",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000237423",
      "name": "Tribunal Robes and Masks DV",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Tribunal Robes and Masks DV-82418-.7z",
      "uploadedUnix": "1488105667",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/8bce9872b077f4123e2f7ae8b7957a958ed8d3659b42c8841ed828601d451d21/analysis/1488106022/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tribunal%20Robes%20and%20Masks%20DV-82418-.7z?fid=1000237423&ttl=1535871154&ri=8192&rs=8192&setec=dfc3ff859860dab206bf9a35e1fd03af"
    }
  ]
}