{
  "modId": 82441.0,
  "modName": "Sleep Spells",
  "summary": "Adds three new spells to the game that cause NPCs to lie down and fall asleep where they stand.",
  "descriptionHtml": "[size=4][u][color=#00ffff][size=4][b][color=#ff0000]Update:[/color][/b][/size][/color][color=#00ffff][size=4][u]\r<br />[/u][/size][/color][/u][/size]\r<br />[size=2]03/04/17: Version 1.1 is now available. This version adds a Mod Configuration Menu, so [url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url] is now required. On the menu is a toggle for whether or not to interrupt active scenes. So now you don&#39;t need to chose which version you want ahead of time. You can turn it off when you don&#39;t want to miss any important scenes and then turn it back on when you&#39;ve heard enough about Talos and just want Heimskr to shut his yap and go sleep it off. The menu also contains a reset function in case you have a problem with sleep slots not resetting (shouldn&#39;t happen now, but you never know) or if you just want to wake everyone up early.[/size]\r<br />\r<br />Old Updates: [spoiler]03/02/17: Version 1.03 is now available. This version fixes the issue of NPCs involved in active scenes not being affected by sleep spells. Any scenes currently playing will be stopped when a participant is put to sleep. This mod will attempt to restart the scene when they wake up, but this is not always possible to do. Please be careful when using these spells on people actively participating in quests. If anyone encounters a quest that is actually broken by this (something more than just missing out on a bit of flavor dialog) please let me know in the comments and I can put an exception in for it. I&#39;m leaving v1.02 up in the old versions section for those who just don&#39;t want to worry about it.\r<br />\r<br />03/01/17: Version 1.02 of this mod is now available on the files page. This version fixes some bugs, including an issue with the quests this mod uses not restarting properly after the spells are used on NPCs already in scripted scenes. As part of this fix, a one-time cleanup script will run shortly after loading any saved games which used a previous version of this mod. This cleanup will wake up any NPCs that you put to sleep previously. Please allow this cleanup to complete. It should only take a few seconds. Once you get a notification that the cleanup is complete, please save your game so you don&#39;t need to run the cleanup again. New games or saves that did not include this mod previously won&#39;t be affected.[/spoiler][size=4][u][color=#00ffff]Description:[/color]\r<br />[/u][/size]\r<br />Adds three sleep spells to the illusion school of magic. These are structured similarly to other spells of that school:\r<br />\r<br />[list]\r<br />[*][size=2][b]Sleep Ray[/b] - A novice-level, single-target ray spell affecting targets level 9 or below[/size]\r<br />[*][size=2][b]Cone of Slumber[/b] - An adept-level, multi-target cone in front of the caster affecting targets level 20 or below[/size]\r<br />[*][size=2][b]Mass Somnolence[/b] - A master-level, wide-area, player-centered spell affecting targets level 55 or below[/size]\r<br />[/list]\r<br />These spells will affect anyone that possess a sleep animation in the base game. That would be any of the playable races as well as (with the Master of the Mind perk) vampires, ghosts, and dremora. Affected NPCs will lay down and fall asleep a few seconds after being hit by one of these spells. They will remain asleep for up to 8 in-game hours (24 minutes real-time) or until disturbed by the player or another NPC. L[size=2]eaving a zone also seems to cause everyone there to wake up[/size].\r<br />\r<br />Note that enemies can still detect you while asleep and will wake up and attack if they do. Being asleep does reduce their ability to detect you, so it is somewhat easier to sneak up on them. It is also useful for keeping patrolling enemies or guards out of your way and for feeding if you are a vampire.\r<br />\r<br />The standard illusion perks work normally on these spells. Hypnotic Gaze affects them as if they were Calm spells. Mass Somnolence is a two-handed, ritual spell like Harmony or Hysteria and as such is not affected by Illusion Dual Casting, but its effective level has been set as if it were (affects level 55 instead of 25). Perks from other mods may work with these spells as well, depending on how they are implemented, but I haven&#39;t tested any yet. \r<br />\r<br />[u][size=4][color=#00ffff]How to find the spells:[/color]\r<br />[/size][/u]\r<br />The spellbooks for these spells can all be found scattered around Skyrim. Many innkeepers leave copies of Sleep Ray spellbooks in bedrooms for the benefit of guests suffering from insomnia. The Cone of Slumber and Mass Somnolence spellbooks are rarer, but shouldn&#39;t be too hard to find for those who&#39;ve got the aptitude.\r<br />\r<br />For the impatient who don&#39;t feel like looking for spellbooks, I recommend using [url=http://www.nexusmods.com/skyrim/mods/64905/?]Add Item Menu[/url].\r<br />\r<br />[color=#00ffff][size=4][u]Requirements:[/u][/size][/color]\r<br />\r<br />Version 1.1 and higher requires [size=2][url=http://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url][/size].\r<br />\r<br />Older versions require only the base game.\r<br />\r<br />[color=#00ffff][size=4][u]Compatibility:\r<br />[/u][/size][/color]\r<br />Items were added to some locations. This could cause those locations to reset if this mod is loaded after mods which alter them. It is recommended to place this mod early in your load order before any mods which alter vanilla locations.\r<br />\r<br /> While this mod does use scripts, none of them are very intensive and should not cause any performance issues. Please let me know in the comments if you find any compatibility issues.\r<br />\r<br />[u][size=4][color=#00ffff]Known Issues:[/color]\r<br />[/size][/u][size=4][size=3][size=2]\r<br />[/size][/size][/size][list]\r<br />[*][size=2]There is currently a limit of 50 NPCs that may be slept at one time. This should be enough to put everyone in most areas to sleep unless you have mods that add a lot of NPCs to the world. Each sleeper needs their own quest and I haven&#39;t found any way to generate new quests dynamically, so I tried to strike a balance between having enough and not over-inflating the mod.[/size]\r<br />[*][size=4][size=2]Sleep Ray and [/size][/size][size=2]Mass Somnolence are effectively silent, but Cone of Slumber will sometimes wake enemies near where it impacts walls or floors. As long as they are within the area of effect they should go back to sleep right away. I&#39;m still trying to find a way to remove these detection events but they seem to be baked into the cone projectile model.[/size]\r<br />[*][size=2]The animation for [size=2]Cone of Slumber[/size] doesn&#39;t line up with the area of effect, so distant targets can be affected even if outside the visual effect. This seems to be an issue with Skyrim itself, as vanilla shouts have the same issue. Scaling animations on projectile .nif files appear to be ignored by the game.[/size]\r<br />[/list]\r<br />[u][size=4][color=#00ffff]Version History:\r<br />[/color][/size][/u][size=2]\r<br />[size=2][size=2]1.1\r<br />[/size][list]\r<br />[*][size=2]Added [size=2]Mod Configuration Menu[/size][/size]\r<br />[*][size=2][size=2]Minor error handling improvements[/size][/size]\r<br />[/list][/size][size=2]1.03\r<br />[/size][list]\r<br />[*][size=2]Fixed issue with targets already involved in a scripted scene not being affected by sleep spells[/size]\r<br />[/list]1.02\r<br />[/size][list]\r<br />[*][size=2]NPCs already engaged in scripted scenes will no longer get stuck occupying quest slots[/size]\r<br />[*][size=2]A one-time cleanup routine will run to remove any stuck NPCs from quest slots[/size]\r<br />[*][size=2]Fixed the spell description for Sleep Ray[/size]\r<br />[*][size=2]Now [url=http://www.nexusmods.com/skyrim/mods/19/?]USKP[/url] and [url=http://www.nexusmods.com/skyrim/mods/71214/?]USLEEP[/url] compatible[/size]\r<br />[*][size=2]Got rid of some papyrus log errors[/size]\r<br />[/list][size=2]1.01\r<br />[/size][list]\r<br />[*][size=2]Fixed issue with mod assets not loading[/size]\r<br />[/list][size=2]1.00\r<br />[/size][list]\r<br />[*][size=2]Initial release[/size]\r<br />[/list]",
  "categoryId": "75",
  "version": "1.1",
  "author": "theecatt",
  "createdUnix": "1488251921",
  "updatedUnix": "1488607792",
  "containsAdultContent": false,
  "uploadedBy": "theecatt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000237699",
      "name": "Sleep Spells",
      "version": "1.02",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "44",
      "fileName": "Sleep Spells.7z-82441-1-02.7z",
      "uploadedUnix": "1488352063",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/71ae0310a96224c142131375e852f02cacb53be17b8001a7ab2edfcdfde41413/analysis/1488352262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sleep%20Spells.7z-82441-1-02.7z?fid=1000237699&ttl=1535871181&ri=8192&rs=8192&setec=718fbd47e7e4b11d6fe0c8533df4fbb3"
    },
    {
      "fileId": "1000237769",
      "name": "Sleep Spells",
      "version": "1.03",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "44",
      "fileName": "Sleep Spells-82441-1-03.7z",
      "uploadedUnix": "1488439853",
      "modVersion": "1.03",
      "virusScanUrl": "https://www.virustotal.com/file/79805e0903abeb344995b1c0397deae5a00d67bf8bf007aeea710101ad1f7288/analysis/1488440102/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sleep%20Spells-82441-1-03.7z?fid=1000237769&ttl=1535871181&ri=8192&rs=8192&setec=e4e0682003da3d2c24b24f6c2c20a3c8"
    },
    {
      "fileId": "1000237953",
      "name": "Sleep Spells",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "45",
      "fileName": "Sleep Spells-82441-1-1.7z",
      "uploadedUnix": "1488607792",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/2d60ded366cda341779b2b515bbb00d2f45a2718175fd6c6e691f4757b18d916/analysis/1488607982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sleep%20Spells-82441-1-1.7z?fid=1000237953&ttl=1535871182&ri=8192&rs=8192&setec=20a7e00b7d303eee84fa14a2039bcff9"
    }
  ]
}