{
  "modId": 82498.0,
  "modName": "EPHHall&#39;s Illusion Overhaul",
  "summary": "This mod changes the Illusion School of magic by adding and/or changing spells, perks, and magic effects. The intent of this mod was to alter Illusion in a way that makes it more useful, interesting, and powerful without necessarily changing how illusion magic is played.",
  "descriptionHtml": "[b]Requires: Dragonborn, SKSE[/b]\r<br />\r<br />[img=middle]https://staticdelivery.nexusmods.com/mods/110/images/82498-0-1498859241.jpg[/img]\r<br />\r<br />[u][b][size=4]Description:\r<br />\r<br />[/size][/b][/u]This mod changes the Illusion School of magic by adding and/or changing spells, perks, and magic effects. The intent of this mod was to alter Illusion in a way that makes it more useful, interesting, and powerful without necessarily changing how illusion magic is played. To accomplish this, many of the new effects have been added to existing spells. These new effects are unlocked with new/altered perks, and some of the new effects apply only to adept level spells and above. I designed this mod to work in this way because I personally see little need to keep a starting spell, like Fear, relevant throughout the life of the character, and I felt it would be a slightly unique way of doing things. In addition to changing existing spells, I have added several new ones, with most of them being expert Illusion spells. These spells are powerful and apply their own unique effects to targets, but are single target and fairly expensive. Finally, in order to keep Illusion magic as relevant as possible for as long as possible, many spells have been made to work on higher level opponents, and master Illusion spells now affect dragons.\r<br />\r<br />[u][b][size=4]Specific Changes (Spells):\r<br />[/size]\r<br />[/b][/u][size=3][u]Tranquility (expert)[/u][/size]: An expert calm spell that works on high level targets, but is single target. It prevents enemies from fighting back, even when they are attacked.\r<br />   \r<br />[u][size=3]Dangerous Hallucinations (expert)[/size][/u]: An expert fear spell that works on high level targets, but is single target. It damages targets by an amount dependent on how high the caster’s Illusion skill is. The target is damaged twice in an 8 second time frame and is also under the fear effect for 60 seconds.\r<br />\r<br />[size=3][u]Explosive Rage (expert)[/u]: [/size]An expert rage spell that works on high level targets, but is single target. Those under the influence of this spell will move and attack faster for a short amount of time, then move and attack slower for the remainder of the effect (they will also deal less damage when the initial effect wears off).\r<br />   \r<br />[size=3][u]Diversion (apprentice)[/u][/size]: Spell form of Throw Voice shout.\r<br />\r<br />[size=3][u]Silver Tongue (apprentice)[/u][/size]: Makes buying and selling prices 10% better.\r<br />\r<br />[u][size=3]Golden Tongue (expert)[/size][/u]: Makes buying and selling prices 20% better.\r<br />\r<br />[u][size=3]Enrage Self Spells (Fury Self, Frenzy Self, and Mayhem Self)[/size][/u] — These spells increase the physical damage the caster inflicts, and the latter two reduce damage taken slightly. These spells are added when you read the spell tomes for the original rage spells. For example, Fury Self is added when the player learns the Fury spell.\r<br />\r<br />[b][u][size=4]Specific Changes (Perks):\r<br />[/size][/u][/b]\r<br />[u][size=3]Chameleon (new, Lv. 80)[/size][/u]: Invisibility will not break when activating objects and casting spells.\r<br />\r<br />[u][size=3]Mind Control (new, Lv. 60)[/size][/u]: When using adept and expert level calm spells, targets will see you as a friend. When using master level calm spells, some targets will be willing to follow you. \r<br />\r<br />[size=3][u]Heart Attack (new, Lv. 60)[/u][/size]:  When using adept level fear spells or above, targets will lose a percentage of their health. The health lost depends upon the level of the spell.\r<br />\r<br />[size=3][u]Wrath (new, Lv. 60)[/u][/size]: When under the influence of adept level frenzy self spells or above, power attacks cost less stamina and are slightly more powerful.\r<br />\r<br />[u][size=3]Mental Link (new, Lv. 70)[/size][/u]: Those affected by illusion spells will transfer some of their magicka to the caster for as long as the spell effects are active.\r<br />\r<br />[u][size=3]Hypnotic Gaze (altered, Lv. 30)[/size][/u]: Calm spells now work on higher level opponents and last much longer. Cumulative with Kindred Mage and Animage.\r<br />\r<br />[u][size=3]Rage (altered, Lv. 30)[/size][/u]: Frenzy spells work on higher level opponents, and those affected by them will deal more damage. Cumulative with Kindred Mage and Animage.\r<br />\r<br />[u][size=3]Aspect of Terror (altered, Lv. 30)[/size][/u]: Fear spells work on higher level opponents and reduce their defense and magic resistance. Cumulative with Kindred Mage and Animage.\r<br />\r<br />[u][b][size=4]Miscellaneous Changes:\r<br />[/size]\r<br />[/b][/u][list]\r<br />[*][size=2]Confidence boosting spells, such as courage and rally, have been buffed by making them give more health and stamina to targets. They haven’t been majorly changed otherwise.[/size]\r<br />[*][size=2]Master spells affect dragons.[/size]\r<br />[*][size=2]Master spells cost much more magicka but, as mentioned above, affect dragons now. They also have much stronger secondary effects than the adept and expert spells.[/size]\r<br />[*][size=2]The new spells will be sold by Drevis Neloren at the appropriate levels.[/size]\r<br />[/list]\r<br />[u][b][size=4]Compatibility:\r<br />\r<br />[/size][/b][/u]I haven’t done any compatibility testing as of yet, but I think it’s safe to assume that this mod would conflict with other mods that alter the Illusion tree/perks.\r<br />\r<br />[u][size=4][b]Known Issues/Bugs:\r<br />[/b][/size][/u]\r<br />[list]\r<br />[*][size=2]Some of the spell effects may be overpowered. I’m pretty sure I’ll do some re-balancing in the future, especially if there’s a demand for it.[/size]\r<br />[*][size=2]Targets under the influence of Harmony will sometimes shout insults at you.[/size]\r<br />[/list]\r<br />[u][b][size=4]Change Log:\r<br />[/size]\r<br />[/b][/u]Version 1.1 - &#34;Calm&#34; and &#34;Fear&#34; are now Novice spells. I forgot to do this.\r<br />Version 1.2 - The download file now includes the scripts required for the mod to work and the .esp has been cleaned.\r<br />\r<br />[u][b][size=4]Credits:\r<br />[/size]\r<br />[/b][/u]I would like to thank the awesome people over at the [url=https://forums.nexusmods.com/index.php?/forum/3930-skyrim-creation-kit-and-modders/]Skyrim Creation Kit and Modders[/url] forum for helping me when I was stuck. Without them, I wouldn’t have been able to make a lot of the spells and effects included in this mod, and I can’t thank them enough. Specifically, I would like to thank the users IsharaMeridan, Masterofnet, and lofgren. They always had something useful and/or thought provoking to say, which I feel is invaluable to a new modder like myself. And, finally, I would like to thank Bethesda for Skyrim and the Creation Kit, as well as the Skyrim Nexus and Steam for allowing me to upload this mod.\r<br />\r<br />[u][b][size=4]Final Thoughts:\r<br />[/size]\r<br />[/b][/u]This is my first real mod (one that wasn’t the result of a few minutes goofing around with random game settings), and is also the first mod I’ll publish. It was a very large undertaking for someone of my meager skill and experience; as such, I’m sure it’s pretty rough around the edges. Please, if you have any feedback, let me hear it. Good, bad, somewhere in-between; it doesn’t matter. I would be very appreciative if you did.",
  "categoryId": "93",
  "version": "1.2",
  "author": "EPHHall",
  "createdUnix": "1488430569",
  "updatedUnix": "1488694332",
  "containsAdultContent": false,
  "uploadedBy": "EPHHall",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000237762",
      "name": "EPHHall&#39;s Illusion Overhaul File",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "EPHHall's Illusion Overhaul File-82498-1-0.7z",
      "uploadedUnix": "1488429851",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8f01ceba4c1acdb98359523009da67ebe8082640e5e2b8af9a4703f887c6fa9e/analysis/1488430142/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EPHHall%27s%20Illusion%20Overhaul%20File-82498-1-0.7z?fid=1000237762&ttl=1535871242&ri=8192&rs=8192&setec=c669a801618a362d8d1cad5a7455e299"
    },
    {
      "fileId": "1000237850",
      "name": "EPHHall&#39;s Illusion Overhaul File",
      "version": "1.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24",
      "fileName": "EPHHall's Illusion Overhaul File-82498-1-1.7z",
      "uploadedUnix": "1488507765",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/1b07d92f1b3af013c78789f4a33fdb2323253d554ad13d51990cff4de75df457/analysis/1488507962/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EPHHall%27s%20Illusion%20Overhaul%20File-82498-1-1.7z?fid=1000237850&ttl=1535871243&ri=8192&rs=8192&setec=65f8204955e23fd87db9d4cc71b4cb08"
    },
    {
      "fileId": "1000238101",
      "name": "EPHHall&#39;s Illusion Overhaul File V. 1.2",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "22",
      "fileName": "EPHHall's Illusion Overhaul File V. 1.2-82498-1-2.7z",
      "uploadedUnix": "1488694332",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/680c4d498b33dc3e4a1ac12e5de9ae5997df1cacef794e1d1498168f36128b25/analysis/1488694573/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EPHHall%27s%20Illusion%20Overhaul%20File%20V.%201.2-82498-1-2.7z?fid=1000238101&ttl=1535871243&ri=8192&rs=8192&setec=76ef73f590faff62b95d92fc19acec13"
    }
  ]
}