{
  "modId": 8254.0,
  "modName": "Rama_s Teleporter Recall Spell Instant Transportation 4 Warp",
  "summary": "Four unique spell books have been hidden by me, Rama, throughout Skyrim.\r\n\r\nVery lightweight mod of only 38 kb using Skyrim\\'s Creation Kit, and scripted for maximum efficiency of your hardware resources.\r\n\r\nThey each give you the power to create a teleporter recall system, so that you can tell the spell where you want to save your location as and ",
  "descriptionHtml": "Rama\\'s Teleporter Recall Spell Instant Transportation 4 Warp Books\r\n\r\n(install instructions below)\r\n\r\n********************************************************************************************************\r\nHint: One of the Rama Teleporter Spell Books is Hidden Somewhere within Whiterun Hold\r\n\r\nSee very end of this description if you need a further hint.\r\n********************************************************************************************************\r\n\r\nVersion 2.0\r\n\r\nUploaded correct files, including the .BSA file\r\n\r\nUpdated manual download instructions\r\n\r\nAdded spoiler that tells which Holds all 4 books are in\r\n\r\n~~~\r\n\r\nShort Summary\r\n\r\n-Teleporter Recall System, place a teleporter where you want and return to that location any time.\r\n\r\n-You can set your teleporter location to being inside your house, in a dungeon, in a merchant shop, at a gold mine, at a special location you find very pretty, at a water fall, on top of a mountain or anywhere else you want!\r\n\r\n-When your location is very different from where you teleport to, I autosave for you, just as would happen normally. This means that if you teleport into a merchant shop, my script will autosave for you! Very hand in case you make a mistake while purchasing/selling goods!\r\n\r\n-Four spells, four teleporters you can place anywhere in Skyrim and return to any time with the simple casting of a spell.\r\n\r\n-Teleport anywhere any time, so long as you are not in combat\r\n\r\n-Easy to use interface, crouch/sneak + cast to set location, non-crouch + cast to teleport to location\r\n\r\n-The 4 spell books are hidden around Skyrim and cannot be purchased, and there are only 4 books in all of Skyrim. More clues to the location of the books below!\r\n\r\n-A \\\"home\\\" safety-tether spell that returns you to a safe, very pretty location. This is a safety measure for if should you set your teleporter to a location that you are unable to fast-travel from and cannot leave physically because it is an unusual or scripted location. \r\n\r\nThis teleporter spell cannot be set to a new location, crouching + casting also teleports you to the pretty location, for safety reasons.\r\n\r\n\r\n\r\n-spells are novice level and cost very little magic, no prior magic use is necessary.\r\n\r\n-1 spell for each magic class\r\n\r\n~~~\r\n\r\n\r\nLonger Summary:\r\n\r\nThis mod of mine gives you access to four spells which each act as a Teleporter / Recall system.\r\n\r\nThis means that you can place a portal wherever you want, \r\n\r\n-in a house you own, \r\n-in a shop, or as many as 4 different shops to sell stuff faster \r\n-in a dungeon right before a boss fight, \r\n-in a dungeon after you are maxed with your weight capacity and need to sell stuff,\r\n-or on the very top of the Throat of the World, \r\n\r\nand then you can warp back to the location you have chosen at any time using the spell.\r\n\r\nSo with four of these spells (there are only 4 in total), you can save up to four locations and warp to them any time you want!\r\n\r\n~~~\r\n\r\nMy Script Programming Efficiency\r\n\r\nI did this entire mod _without_ ANY quest scripts or global variables, which take up large amounts of Skyrim and hardware/console system resources\r\n\r\n\r\nThe entire mod does only the following\r\n\r\n-put four book objects in the Skyrim world\r\n\r\n-put four actor objects in the world that act as teleporter locations. Skyrim keeps track of actors very well across save games and also future downloadable content additional areas.\r\n\r\n-create 5 spells and give them to the player based on which books they read in game\r\n\r\n-create 5 spell scripts, which only exist and run when the spell is started or is in use, this kind of script uses very minimal Skyrim and hardware resources. The spell itself has a very short duration, meaning the entire script runs for a very short period of time and then you are back to Skyrim processing power as our friends at Bethesda made it (so very well).\r\n\r\n\r\nBasically I am saying I did this mod in a very efficient way that minimizes the resources it is using.\r\n\r\nThis mod therefore will not affect your frames per second (fps) or any other aspect of your Skyrim Experience.\r\n\r\nI design all my scripts to use minimum game and hardware resources :)\r\n\r\n~~~\r\n\r\nUsefulness\r\n\r\nThink of the usefulness of having even two of the four spells!\r\n\r\nYou can:\r\n\r\n1. set one teleporter location to a shop, before entering a dungeon.\r\n\r\n2. while in dungeon, set the teleporter to your current location, as long as you are not in combat.\r\n\r\n3. warp to town using teleporter system 1\r\n\r\n4. warp back to the dungeon using teleporter system 2\r\n\r\nBecause this is such a powerful ability you have to earn it by finding the hidden spell book locations :) \r\n\r\n~~~\r\n\r\nUsage\r\n\r\n-crouch and cast spell to change teleporter location to your current location\r\n\r\n-cast spell in any state besides crouching and while in combat to teleport to your newly chosen location\r\n\r\n-works indoors, outdoors, in dungeons, anywhere, so long as you are not in combat.\r\n\r\n-can activate teleport while falling\r\n\r\n-teleport location can be set using crouch/sneak, even if in combat, but actual teleportation can only occur while not in combat.\r\n\r\n~~~\r\n\r\nSeek Ye the Wisdom to Travel Through Universe as a Sun Ray of Thought\r\n\r\nFour books containing the wisdom to use the time rifts to your advantage have been scattered around Skyrim and can be found in each of four towns / Holds. These books cannot be purchased anywhere, you must find them.\r\n\r\nUse these powerful teleporter recall spells to further aid your Cosmic Mission!\r\n\r\n~~~\r\n\r\nHow To Install Manually\r\n\r\nI assure you, utilizing this mod is very easy!\r\n\r\n1.  Download the files, contained in a folder called \\\"Data\\\" when you unpack the archive/zip file\r\n\r\n2. Move this Data folder to your Skyrim root folder, where TESV.exe is located which is most likley in this path:\r\n\r\nc:\\\\program files(x86)\\\\steam\\\\steamApps\\\\common\\\\skyrim\r\n\r\n3. If you are asked to confirm the copy, click yes, there is no way this can hurt your Skyrim install at all, since no core game files are modified and this will not affect other mods since the Data folder contains only my unique file names\r\n\r\n4. Launch the \\\"SkyrimLauncher.exe\\\", and go to \\\"Data Files\\\"\r\n\r\n5. Make sure my .esp file is checked as being included\r\n\r\n6. Have fun finding the books and using their powers!\r\n\r\n7. More details on finding the books below.\r\n\r\n~~~\r\n\r\nFurther Spell Book Location Details\r\n\r\nThe spell books are scattered in 4 of the 9 Holds.\r\n\r\n-Please note that in every case, the spell books are located WITHIN the actual Hold (the name for the large towns that are shown on your map from the start of game). \r\n\r\n-Please also note then when I say Hold, I mean the ENTIRE area, including the different palaces/main Jarl locations (like Understone Keep in Markarth for example)\r\n\r\n-The spell book might be in any actual town building, or just laying around outside.\r\n\r\n\r\nThere are only four, one for each teleporter, in all of Skyrim. For this reason, I counsel against shouting at any of the spell books in your effort to retrieve them, as this could send the book to a location you cannot obtain it from. Make sure to save if you choose this method of acquisition.\r\n\r\n\r\n-The spell book will _never_ be in a townperson\\'s inventory.\r\n\r\n-The spell books _cannot be purchased from anyone_\r\n\r\n-No spell book location requires you to use any shouts or special abilities that require main or side quest development to obtain the book.\r\n\r\n-You can obtain all of the books at level 1, straight out of Helgen, with sufficient ingenuity and perhaps a bit of fancy footwork.\r\n\r\n~~~\r\n\r\n\r\nWhat if You Warp to a Location You Cannot Leave?\r\n\r\nThere are times in Skyrim when you can set a teleporter and warp back to a location whose script has already expired and you cannot get back out of that location because it is an unusual location (I am avoiding giving away any spoilers).\r\n\r\nIn this instance, you should cast the spell “Rama\\'s Teleporter Home”, this spell gets added to your list whenever you learn any of the other spells in the four hidden books.\r\n\r\nThis spell returns to you to a nice, safe, and very pretty location :)\r\n\r\n~~~\r\n\r\nThis is the Text of the Books, Which You Don\\'t Actually See In-Game\r\n\r\n\r\nThe Way to Travel Through the Universe as a Sun Ray of Thought\r\n\r\nCrouch ye close to the earth to anchor the flows of time to thy current location, and summon forth thy will to bend the flow of Cosmic Currents to thine aid.\r\n\r\n\r\nTo traverse the vast Universe faster than a raging Dragon: \r\n\r\nEnvision thyself as a ray of the sun, shooting to thy destination. \r\n\r\n\r\nThink so strongly of thy destination that ye forget thine original location. \r\n\r\n\r\nThen ye shall travel as the Cosmic Rays of the Universe do, \r\n\r\nand reach thy chosen destination \r\n\r\nin the speed of a single thought\\'s journey across Infinity.\r\n\r\n~~~\r\n\r\nKnown Issues\r\n\r\nSometimes teleporting to a player house can be a bit finicky, but it does work. If you find yourself being teleported back to the safe pretty place (by Riverwood) instead of your house, just reset the teleport for your house again.\r\n\r\nIf that still doesn\\'t work, the try teleporting while within your house to go back to your exact teleport spot, then leave your house :)\r\n\r\n********************************************************************************************\r\nFurther Location Hint for Whiterun Rama Teleporter SpellBook (Spoiler Alert):\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe Whiterun Rama Teleporter Spell Book is somewhere in Dragonsreach\r\n\r\n*************************************************************************************\r\n\r\n\r\n\r\nAdditional clues as to location of books below\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nare you sure you want these spoilers ?\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n1.whiterun\r\n2.markarth\r\n3.winterhold (not the mage\\'s college, just winterhold)\r\n4.solitude\r\n",
  "categoryId": "93",
  "version": "2.0",
  "author": "Rama",
  "createdUnix": "1328716724",
  "updatedUnix": "1328870651",
  "containsAdultContent": false,
  "uploadedBy": "evernewjoy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28325",
      "name": "Rama Teleporter Working Version with BSA file included",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "38",
      "fileName": "Rama Teleporter Working Version with BSA file included-8254.rar",
      "uploadedUnix": "1328870651",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6bfc0ad3e2b10a53d30d3a04dd453236283c1d21303dea451757657fb17ceb50/analysis/1406666702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rama%20Teleporter%20Working%20Version%20with%20BSA%20file%20included-8254.rar?fid=28325&ttl=1535766823&ri=8192&rs=8192&setec=29e24bea7bef2c78d9719c27242251a8"
    }
  ]
}