{
  "modId": 82558.0,
  "modName": "THE FINAL TRIAL - ULTIMATE CHALLENGE FOR HIGH-LEVEL PLAYERS",
  "summary": "This mod is mostly dedicated to hardcore Skyrim players looking for a new challenge. It adds a small location and a very powerful (but beatable) enemy. Check the mod&#39;s long description for all needed informations.",
  "descriptionHtml": "[center][font=Verdana][color=#900000][size=6][b][img]http://i64.tinypic.com/2hg9qhf.jpg[/img]THE FINAL TRIAL - ULTIMATE CHALLENGE[/b][/size][/color][/font][/center][center][color=#000000][size=4][b]BY: ARGOTHEFURRY[/b][/size][/color][/center]\r<br />\r<br />\r<br />[color=#ff0000][b]INSTALLATION:[/b][/color]\r<br />\r<br />[b]- Copy the Data folder into your Skyrim folder (most likely C:&#92;Program Files (x86)&#92;Steam&#92;SteamApps&#92;common&#92;Skyrim)\r<br />\r<br />- Make sure you copied the folder as it contains custom scripts used by the mod.[/b]\r<br />\r<br />\r<br />\r<br />[color=#ff0000][b]WHAT IS THIS MOD:[/b][/color]\r<br />\r<br />[b]- This is a mod dedicated mostly to hardcore Skyrim players who have high-level, well-developed characters.\r<br />\r<br />- This mod adds one new location called The Final Trial. The entrance to the location is located near Riverwood. It is hidden but the map marker should help you find it.\r<br />\r<br />- Inside the small, forgotten dungeon you will fight the Ultimate Enemy. This is your Final Trial, Dragonborn.\r<br />\r<br />- Your opponent is Wulfgard the Old. He&#39;s not a Dragonborn but an old, loyal servant to the Daedric Prince of knowledge and memory, Hermaeus Mora. Unlike Miraak, Wulfgard always remained loyal to his powerful master. Once a great warrior and a seeker of knowledge, he started serving Hermaeus Mora faithfully. He was richly rewarded many times and obtained secrets knowable only to loyalest of Mora&#39;s servants.\r<br />\r<br />- Wulfgard the Old is not only a very powerful warrior but also able to make use of the knowledge shared by Hermaeus Mora. Some of his powers and effects are unique and will surely surprise the Dragonborn. Wulfgard&#39;s equipement is also fortified with his knowledge and allows him to be even more powerful.\r<br />[/b]\r<br />\r<br />\r<br />[b][color=#ff0000]WHAT IS SO SPECIAL ABOUT THIS ULTIMATE ENEMY:[/color][/b]\r<br />\r<br />[b]- I am a hardcore Skyrim lover. I have spent more than 2300 hours in this game, most of it playing on Legendary difficulty. While this is my first mod I know the game itself very well. After so many hours in Skyrim I&#39;ve pretty much seen everything. I&#39;ve completed every quest, discovered every area, killed every unique, more challenging enemy. I know about different classes/builds and their strengths and weaknesses.\r<br />\r<br />- we all know about things which are simply too powerful, especially when used by a high-level, well-developed character- sneaking, certain perks in skill trees, reaching the point when you reach the armor and magic resistance cap.\r<br />\r<br />- Even when playing on Legendary Difficulty there are basically only two &#34;real&#34;, more demanding challenges- Ebony Warrior and Karstaag.\r<br />\r<br />- This mod adds the Ultimate Challenge. This is The Final Trial. Wulfgard the Old is the most powerful, &#34;lore-friendly&#34; enemy.\r<br />\r<br />- He is capable of using effects and powers not available to the Player. He deals lots of damage and is very hard to deal with.\r<br />\r<br />- This mod and this NPC is different from most mods with &#34;ultimate boss enemies&#34;. I did not give him million HP, I did not give him weapons that kill you with one hit, I did not give him too many extra effects so he would simply be invincible.\r<br />\r<br />- I tried to be &#34;lore-friendly&#34;, not to create something &#34;cheesy&#34; and godlike. He is powerful, yes. More powerful than Ebony Warrior or Karstaag, that&#39;s for sure. But I have used my experience as a Skyrim player to balance him.\r<br />\r<br />- You can kill him. So far I&#39;ve managed to kill him with two of my characters. First one was a level 167 Archer and the other one was a level 93 Strong Restoration Warrior. Fighting him takes a long time, sometimes you make a mistake and die (or you are simply not strong enough), he is capable of killing you quickly if you are not careful.\r<br />\r<br />- HE PUNISHES THE PLAYER FOR USING CERTAIN &#34;OVER-POWERED&#34; MECHANICS/PERKS&#33; If you want to kill him your character has to be well-developed. While I&#39;m not going to explain here what I mean, you will quickly find out that certain &#34;tricks&#34; don&#39;t work with him.\r<br />\r<br />- If you beat him on Legendary Difficulty without using any glitches/ custom made godmode weapons or equipement / console commands- you can say your character is truly powerful and well-made.\r<br />\r<br />- There are, of course, rewards for killing him (apart from your own satisfaction).[/b]\r<br />\r<br />\r<br />\r<br />[color=#ff0000][b]TIPS ON HOW TO BEAT HIM:[/b][/color]\r<br />\r<br />[b]- Recommended minimal level ~100.\r<br />\r<br />- Armor and Magic Resist cap reached.\r<br />\r<br />- Strong weapon and/or strong spells.\r<br />\r<br />- Well-developed character: well-distributed perks, useful powers and effects obtained, equipement adjusted to your character&#39;s playstyle.\r<br />\r<br />- Potions and/or healing spells- you ALWAYS want to have full health second after you were wounded and you NEVER want to run out of magicka and/or stamina during this fight.\r<br />\r<br />- Lot of time and patience. You want to remain calm, not make any mistakes and NEVER take anything for granted.\r<br />\r<br />- Don&#39;t be a one trick pony&#33; In most cases it&#39;s not going to work against him.\r<br />\r<br />- Make sure you prepared yourself well before the fight. Lots of potions, arrows, all that stuff. He will punish you for any mistake you make.\r<br />[/b]\r<br />\r<br />[color=#ff0000][b]\r<br />KNOWN ISSUES/BUGS AND IMPORTANT INFORMATIONS:[/b][/color]\r<br />\r<br />[b]- SAVE YOUR GAME BEFORE YOU ENTER THE CELL &#34;THE FINAL TRIAL&#34; FOR THE FIRST TIME&#33;&#33;&#33; You can save inside as many times as you want but PLEASE have one save before you enter the location.\r<br />\r<br />- Very rarely he disappears from the cell (mostly when you enter and exit the cell multiple times and/or swap between many characters). To fix it YOU HAVE TO HAVE A SAVE RIGHT BEFORE YOU ENTERED THE CELL FOR THE FIRST TIME. If a simple reload doesn&#39;t fix it and he is still not there restart your game. This will fix it.\r<br />\r<br />- One of his items displays only one effect as for the enchantment effects. This item has another effect and when you obtain this item you can check the effects for your character.\r<br />\r<br />- Very, very rarely one of his weapons may get glitched after you defeat him and you are able to pick two copies of the same item. This is, however, really rare.\r<br />\r<br />- When you obtain the reward there are sometimes problems with something you obtain. Most of the time it works perfectly, sometimes it does not for some reason. Just give it another try. It will work.\r<br />\r<br />- Sometimes when you enter the cell The Final Trial your outdoor Skyrim music is still going to play, mixed with the interior music playing. Reloading fixes it and I don&#39;t think this issue is connected with the mod itself.[/b]\r<br />\r<br />\r<br />\r<br />[b][color=#ff0000]OTHER INFORMATIONS:[/color][/b]\r<br />\r<br />[b]- This is my first mod. I hope I uploaded everything you guys need to play it properly (.esp, Scripts, ScriptsSource). If I made any mistakes- let me know&#33;\r<br />\r<br />- Please share your thoughts about this mod&#33; I am willing to learn&#33;\r<br />\r<br />- I hope you guys will like it. It&#39;s certainly not a mod for everyone and it&#39;s not even a big project. I wanted to create a challenge for people like me and I&#39;ve spent a long time testing and balancing everything.\r<br />\r<br />- It would be awesome if you guys shared your experiences with my mod and, even better, record yourselves beating Wulfgard (or trying to)&#33;\r<br />\r<br />- If someone beats him on Legendary Difficulty (preferably in Vanilla Game)- you should be proud of yourself&#33;[/b]\r<br />\r<br />- [color=#ff0000][size=4]GOOD LUCK, DRAGONBORNS&#33; THIS IS THE FINAL TRIAL&#33;[/size][/color]",
  "categoryId": "33",
  "version": "1.0",
  "author": "ArgoTheFurry",
  "createdUnix": "1488683593",
  "updatedUnix": "1488683572",
  "containsAdultContent": false,
  "uploadedBy": "ArgoTheFurry",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000238084",
      "name": "TheFinalTrial",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "120",
      "fileName": "TheFinalTrial-82558-1-0.7z",
      "uploadedUnix": "1488683572",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/94608d111a389003f292d54e8f55db764aa22021191b72bbfcc4d1c2e5319c05/analysis/1488683866/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheFinalTrial-82558-1-0.7z?fid=1000238084&ttl=1535871315&ri=8192&rs=8192&setec=063e36ade561601d887bb0d88a5d7319"
    }
  ]
}