{
  "modId": 828.0,
  "modName": "Saranya Slisk Level 38 Argonian Thief Mage",
  "summary": "Level 38 Argonian Thief Mage; has a very powerful bow that can kill a Draugr Death Overlord in 2 shots with sneak attacks on Expert. ",
  "descriptionHtml": "This save file isn\\'t very far in the main storyline. Just killed the dragon that you see revived by Alduin. Completed Companions storyline (she is a werewolf), but Mage College, Thief Guild, and Imperial Legion are only partway completed, and the Dark Brotherhood has just been joined, so no quests have been done for that either. She is currently equipped with items that give a 104% damage boost to Archery, plus full Overdraw which adds another 100% damage. The bow is a Daedric Bow upgraded to Legendary status. Her arrow supply is nearly endless; over 2.5k arrows as a rough estimate.  Blacksmithing is at 100, and the perks go on the heavy armor side up to Dragon Armor. Level 56 Enchanting, with plenty of miscellaneous jewelry and filled soul gems to enchant. Has more potions than you know what to do with. 12 shouts, with 4 souls to spend on new shouts. Check Breezehome, next to the Blacksmith in Whiterun, for a chest on the second floor next to the bed. It is filled with various enchanted items, daedric artifacts, potions, and random stuff. 12k gold to spend on whatever you desire. \r\n\r\n(Screenshots will be uploaded, so don\\'t be impatient.)",
  "categoryId": "43",
  "version": "",
  "author": "Zero5211",
  "createdUnix": "1321821666",
  "updatedUnix": "1321821896",
  "containsAdultContent": false,
  "uploadedBy": "Zero5211",
  "primaryFile": null,
  "files": [
    {
      "fileId": "2093",
      "name": "Save File",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5062",
      "fileName": "Save File-828-1.zip",
      "uploadedUnix": "1321821896",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f9f5ffe3f6a3293a242b8657cf00a291103dc1b47fd022d94440b829cd6ce6e9/analysis/1406426465/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Save%20File-828-1.zip?fid=2093&ttl=1535754023&ri=8192&rs=8192&setec=5954cd21598b2760d6d44c7fc2226e0b"
    }
  ]
}