{
  "modId": 8283.0,
  "modName": "Education For Skyrim V02 -WIP-",
  "summary": "Increases the worth of books, add mores books, and modifies in some new skillbooks.",
  "descriptionHtml": "!UPDATING NOTICE!\r\nIf you\\'re updating your \\\"Education For Skyrim\\\" esp from 0.1, YOU MUST DELETE \\\"EFSv01.esp\\\" BEFORE RUNNING \\\"EFS.esp\\\". This was my fault, I apologize. Every future update will just be a drag-and-drop replacement V0.1 to any other version you need to delete the esp first.\r\n\r\nSORRY FOR THE CONFUSION.\r\n\r\n----------------WIP NOTICE----------------\r\nThis mod is only a WIP (Work in Progress). The full mod will fix a lot more books, and even add more. This current version is not yet complete. NOT ALL BOOKS ARE MODIFIED TO HAVE INCREASED PRICES. There are still ones I have yet to get to.\r\n----------------END NOTICE---------------\r\n\r\n----------------0.2 UPDATE NOTICE-----------------\r\nI had promised new books, and they will come, but something happened to my file that messed everything. Actually I almost had the file revert back to 0.1 from all the edits I had made. I had found my backup, but for some reason all the books I had added were gone. I had 3 books planned to be in this update, but I have to postpone it to the next. SORRY GUYS! D:\r\n----------------0.2 UPDATE NOTICE-----------------\r\n\r\nEver been angry at how low the price for books was in Skyrim? Feel like it\\'s unrealistic, and a waste of time? With this mod Skyrim\\'s books serve more of an economic purpose in the game. The old 1 - 30 gold per-book was pointless, and left you wondering why they even added books to the game. Well with this mod, books have increased extremely in price, making finding them more purposeful in your adventures.\r\n\r\nWhat this mod does is increase the value for books in Skyrim, and modifies some books to now be Skill books (Based on the name of the book).\r\n\r\nThis mod is later going to be adding new books to the world of Skyrim as well. Rare books will actually be worth a lot, and more common books will be worth less. New skill books will also be added.\r\n\r\n-VERSION HISTORY-\r\nVersion 0.2-\r\n*Edited book weight (Changed most books from 1 weight point to .1 weight point).\r\n*Evened some of the prices.\r\n\r\nVersion 0.1-\r\n*Release\r\n*Increased price for most books.\r\n*Modified existing books to level up skills.\r\n\r\nNOTE:\r\nIf you think this mod is silly, stupid, pointless, idiotic, whatever, don\\'t bother speaking. I made this mod for myself, and the one person who was worthy enough to have an article posted on Steam about the stupidity of the book market in the game. This mod is NOT meant for boosting, or is suppose to be used for farming money. All it does is increase the price of books so they are actually realistic which gives them a point to the game mechanics.",
  "categoryId": "85",
  "version": "0.2",
  "author": "Gleech",
  "createdUnix": "1328724303",
  "updatedUnix": "1329189679",
  "containsAdultContent": false,
  "uploadedBy": "Gleech",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27211",
      "name": "EFSv01-OLD",
      "version": "01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "277",
      "fileName": "EFSv01-OLD-8283.zip",
      "uploadedUnix": "1328724378",
      "modVersion": "01",
      "virusScanUrl": "https://www.virustotal.com/file/48627df8cbcf008dd258abf620131c705df1f0d67675507a36b2e3856dd503f0/analysis/1406661495/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EFSv01-OLD-8283.zip?fid=27211&ttl=1535766862&ri=8192&rs=8192&setec=0bfdc386cd109e0f8939464362e7a36d"
    },
    {
      "fileId": "30801",
      "name": "EFSv02-MAIN",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "295",
      "fileName": "EFSv02-MAIN-8283.zip",
      "uploadedUnix": "1329189679",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/2723836736cd7d0aa04b3e811e705d9baa3bcdeaf320401ed55f1f4f1a8fe399/analysis/1406680743/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/EFSv02-MAIN-8283.zip?fid=30801&ttl=1535766863&ri=8192&rs=8192&setec=c9ddae53321a34e0e56ba847e4ff2eac"
    }
  ]
}