{
  "modId": 82857.0,
  "modName": "Legend of the Dragoborn - The Legend of Zelda Soundpack",
  "summary": "An incredibly-immersive mod that turns the audible atmosphere of Skyrim to fit into a Legend of Zelda theme&#33;",
  "descriptionHtml": "[font=Times New Roman][size=3][center][img]http://i.imgur.com/J5b1t9U.png[/img]\r<br />\r<br />Presented by Argonic Games\r<br />\r<br />[i]The Legend of the Dragonborn[/i], official Version 2.0 trailer:\r<br />\r<br />[youtube]xNEKmpnlXN8[/youtube][/center]\r<br />[center][/center][img]http://i.imgur.com/9JNt1kL.png[/img]\r<br />\r<br />[center][img]http://i.imgur.com/KK98DHp.png[/img][/center]\r<br />\r<br />The Legend of Zelda Soundpack is a mod for TESV: Skyrim which adds many of the sounds heard throughout the Legend of Zelda series into the world of the Elder Scrolls. From footsteps to creature sounds, this mod will have Legend of Zelda players experiencing a new sort of immersion in the land of Skyrim. The mod also features a new race (the Hylian Race) based off of the Bosmer race, which is minimally customizable, but comes with two completely new voicesets for both the Male Hylian and Female Hylian, and a new power for the race as well. So, if you choose to be a male Hylian, you will hear all of Link&#39;s battle grunts, falls, jumps, cries and screams&#33; In the same way, you will hear the same behaviors from Zelda (Sheik) should you choose to be a female Hylian.\r<br />\r<br />I (Maladrum) started this mod way back in 2015 simply to learn how sound modification works in the CK (Creation Kit). However, after I began putting the sounds together and playing the game as I went along, I found myself enjoying the creation of this mod more than any other mod that I have worked on. And so, we end up with this&#33;\r<br />\r<br />[center][img]http://i.imgur.com/uPDeVdY.png[/img][/center]\r<br />\r<br />To put it to a list, this mod features:\r<br />\r<br />- Sound replacements for UI (Selections in menus, the map, etc.)\r<br />- Sound replacements for creatures and enemies\r<br />- Sound replacements for impact sound data\r<br />- Sound replacements for interaction (such as with forges, chests, doors, items, etc.)\r<br />- Sound replacements for footsteps\r<br />- Sound replacements for the environment (bodies of water, lava, fire, etc.)\r<br />- Sound replacements for weapons and magic\r<br />\r<br />- Music replacements for...\r<br />   - towns\r<br />   - forts\r<br />   - unqiue dungeons\r<br />   - differing climates in Skyrim\r<br />   - battles\r<br />   - other worlds (Soul Cairn, Solstheim, etc.)\r<br />   - also adds different tracks for unique bosses (notably unique dragons, karstaag, etc.)\r<br />\r<br />- A main menu replacer, featuring the same title music from Ocarina of Time\r<br />\r<br />- A new race derived from the Bosmer race, now fully customizable (with the exception of eye color; I&#39;d noticed most Hylians have blue eyes)\r<br />\r<br />[/size][/font][center][font=Times New Roman][size=3][img]http://i.imgur.com/zHEDDAM.png[/img]\r<br />[/size][/font][/center][font=Times New Roman][size=3]\r<br />\r<br />[b][u]- &#34;Does Link pronounce the shouts in the game?&#34;[/u][/b]\r<br />\r<br />I&#39;m sorry, no; and here&#39;s why. It took a while to decide what to do with this. The problem is that there were never any sounds produced by Nintendo which were similar to any of the shout sounds produced by Bethesda. Thus, it would have been impossible to add a new pronunciation of the shouts for the male Hylian voiceset (or the female Hylian voiceset, for that matter). Thankfully, we can excuse this inconvenience with the fact that Link doesn&#39;t exactly talk in the Legend of Zelda games anyway. We&#39;re sorry, but hopefully the new power that we created will be enough to satisfy you.\r<br />\r<br />[b][u]- &#34;Why is the mod file titled &#34;TwilightPrincessSoundpack?&#34;[/u][/b]\r<br />\r<br />When I began creating the mod, it started out as a &#34;Legend of Zelda: Twilight Princess&#34; Soundpack, hence the name. However, I decided to make this bigger and added more sounds and tracks from other games in the Legend of Zelda series. It grew to be a very enjoyable and huge project, taking over a year to get it to this full &#34;2.0&#34; version.\r<br />\r<br />[b][u]- &#34;Will there be a female version?&#34;[/u][/b]\r<br />\r<br />I put this question up for the lulz, the question doesn&#39;t apply here. I mean, it&#39;s just an FAQ overall. If I am to troll, I will say that the female Hylian preset featured from the start of a &#34;new game&#34; is none other than just as clothed as usual. Sorry to all you sick-minded. ;)\r<br />\r<br />[b][u]- &#34;Is this mod available on Steam for subscription?&#34;[/u][/b]\r<br />\r<br />Version 2.0 of this mod is not available on the Steam Workshop. However, you can find the mod&#39;s first release there under the same name (&#34;Maladrum&#34;).\r<br />\r<br />[b][u]- &#34;Does this mod require DLC?&#34;[/u][/b]\r<br />\r<br />All right, here&#39;s the deal. If you don&#39;t have the Skyrim DLC by now, you&#39;re eternally a noob. The only way to redeem yourself is through getting gud (beat Dark Souls). But to be clear, yes, this mod requires you to have the Dragonborn, Dawnguard, and Hearthfires DLC installed and loaded with it.\r<br />\r<br />[b][u]- &#34;How should the load order work with this mod?&#34;[/u][/b]\r<br />\r<br />I recommend not using this modification with any other sound or music replacing mods simply to avoid any issues, but if you want to try anyway, I recommend just making certain that this sound mod is loaded ABOVE any other such replacers.\r<br />\r<br />[b][u]- &#34;Will there ever be a version 3.0?&#34;[/u][/b]\r<br />\r<br />There will likely never be a version 3.0 for this mod. I&#39;ve worked with this one for over a year now, and while I&#39;m not sick of it, there are some other things that I would like to move on to. However, should I get enough feedback inquiring for certain bug fixes (if they are possible) or filling in (perhaps) missing areas with different music/sounds, I wouldn&#39;t mind considering uploading a patch for the mod (that would make this version 2.x).\r<br />\r<br />[b][u]- &#34;Are there any recommendations as to what mods might be good to play with this soundpack?&#34;[/u][/b]\r<br />\r<br />I highly encourage that you check out some of Quechus13&#39;s work. Credit where it&#39;s due; I used his mod to showcase mine in a trailer. He&#39;s created some awesome assets including Zelda-themed weapons, outfits, and other items all in a collection of mods that you can check out here on the Nexus or on the Steam Workshop (as of March 2017). Playing his mod with this one SERIOUSLY makes Skyrim feel like &#39;Hyrule on steroids.&#39;\r<br />\r<br />Additionally, I&#39;ve had some users tell me that they enjoy playing this mod with any &#34;Toon ENB.&#34; I&#39;ve never tried it out for myself, but that&#39;s another thought.\r<br />\r<br />[b][u]- &#34;This bug keeps--&#34;[/u][/b]\r<br />\r<br />Check out the &#34;Known Bugs&#34; section of this page, please.\r<br />\r<br />[b][u]- &#34;Will this mod ever be available for the Skyrim Special Edition?&#34;[/u][/b]\r<br />\r<br />I&#39;m sorry, but I have no intention of a Special Edition release.\r<br />\r<br />[u][b]- &#34;How do I install the mod?&#34;\r<br />\r<br />[/b][/u]I advise downloading the mod manually and dropping the &#34;.esp&#34; and &#34;.bsa&#34; files into your Skyrim&#92;Data folder.\r<br />\r<br />[center][img]http://i.imgur.com/dgfkVtp.png[/img][/center]\r<br />\r<br />I feel like mod authors are somewhat ignorant of the importance of adding information on the compatibility of their mod(s) with others. So I&#39;m making the difference and adding one to mine.\r<br />\r<br />As discussed earlier in the &#34;FAQ&#34; section, any other sound/music replacers, if used, should not be above this mod in your load order. It may cause some issues for you. That said, I advise using any other such replacers with this mod at all.\r<br />\r<br />Don&#39;t attempt to use this mod with any other main menu replacers, as it includes one in itself. I advise against it.\r<br />\r<br />Finally, there was an issue with a certain mod that I encountered prior to completing the development of Legend of the Dragonborn. For whatever reason, when I attempted to use my mod while I had any files related to the incredible mod that is &#34;MOONLIGHT TALES,&#34; I got some serious crashes whenever I would walk into a new location, cell, area, etc. I do not encourage any attempt to use this mod if you have any Moonlight Tales data in your Skyrim folder. The main issue seemed to be script clashing, although there is no scripting involved with this mod (save any voice files that are referenced for the Hylian Race). Don&#39;t worry; if you have this mod while you DO have any MT-data installed or chillin&#39; in your &#34;data/scripts&#34; folder, it isn&#39;t like your computer is going to go crazy. It&#39;s just that this mod may not work in-game.\r<br />\r<br />[/size][/font][center][font=Times New Roman][size=3][img]http://i.imgur.com/3RpxmF3.png[/img]\r<br />[/size][/font][/center][font=Times New Roman][size=3]\r<br />\r<br />[/size][/font][center][font=Times New Roman][size=3][url=https://steamcommunity.com/sharedfiles/filedetails/?id=649251493]Version 1.0 (Steam Workshop)[/url]\r<br />[url=https://twitter.com/maladrum]Social: My Twitter Page[/url]\r<br />[/size][/font][/center][font=Times New Roman][size=3][center][url=https://steamcommunity.com/id/maladrum/myworkshopfiles/]My TESV: Skyrim mods (Steam Workshop)[/url]\r<br />[url=https://www.youtube.com/watch?v=xNEKmpnlXN8]Official Trailer for Version 2.0[/url][/center]\r<br />[/size][/font][center][font=Times New Roman][size=3][img]http://i.imgur.com/gxJp7Ba.png[/img]\r<br />[/size][/font][/center][font=Times New Roman][size=3]\r<br />[/size][/font][center][font=Times New Roman][size=3]If you encounter a bug while playing this mod, please send me a message about it or post a note of it in the comments. Any bugs will be listed here as they are noted.\r<br />[/size][/font][/center][font=Times New Roman][size=3]\r<br />[/size][/font][center][font=Times New Roman][size=3]__________________________________________[/size][/font][/center][font=Times New Roman][size=3]\r<br />[b]- [s]Right now, there seems to be an issue with the .esp file of this mod being unable to properly access sound files in the .bsa package that comes with it. This could be due to the method I used to compile the .bsa package itself. I&#39;m looking into it, and I&#39;ll keep viewers posted as they come. If you try out the mod and it works perfectly with sounds, music, etc., please leave a comment. [/s][/b][s][3/21/17][/s][color=#00ff00] This bug has been fixed.[/color]\r<br />\r<br />- Some may experience issues with this mod during the opening scene when they select &#34;New Game.&#34; However, this is a typical problem with just about any mod out there, due to the way Bethesda handled the scene. I advise perhaps running through the opening scene, THEN loading Legend of the Dragonborn, and then using the &#39;showracemenu&#39; command within the game console to customize your character. I don&#39;t recommend using an &#39;alternate start&#39; mod with Legend of the Dragonborn, as some users have notified me that there&#39;ve been some compatibility issues there; unfortunately, there&#39;s just not a lot that I can do about this one. To be specific, the mod &#39;...Live Another Life&#39; is the particular mod which users have had some trouble with; if you&#39;d like, you can always try out some other alternate start mods and see if they work.\r<br />\r<br />[/size][/font][center][font=Times New Roman][size=3][img]http://i.imgur.com/OZOyb5y.png[/img]\r<br />[/size][/font][/center][font=Times New Roman][size=3]\r<br />Major credit(s) to Nintendo®, who produced the sound/music tracks used in this modification.\r<br />\r<br />Credit to Bethesda Softworks, obviously.\r<br />\r<br />Credit to HelpTheWretched, who re-recorded the sound(s) so as to provide them in their highest quality.\r<br />\r<br />Lastly, a big &#39;thank you&#39; to the supporters of this mod. Without knowing that I had such supporters eagerly waiting for the release of this update, I wouldn&#39;t have endured the traumatizing nature of Bethesda&#39;s constantly-crashing Creation Kit.[/size][/font]",
  "categoryId": "61",
  "version": "2.1",
  "author": "Maladrum",
  "createdUnix": "1490038896",
  "updatedUnix": "1490128745",
  "containsAdultContent": false,
  "uploadedBy": "Maladrum",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000239714",
      "name": "Legend Of The Dragonborn _ Version 2.1",
      "version": "2.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1924204",
      "fileName": "Legend Of The Dragonborn _ Version 2.1-82857-2-1.zip",
      "uploadedUnix": "1490128745",
      "modVersion": "2.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legend%20Of%20The%20Dragonborn%20_%20Version%202.1-82857-2-1.zip?fid=1000239714&ttl=1535871660&ri=8192&rs=8192&setec=a04fc0863a51e56372f8af91e98e7734"
    }
  ]
}