{
  "modId": 82892.0,
  "modName": "SkyBuild-Concept",
  "summary": "A Concept for a new utility, that allows the user to install pre-builds or large mod packs to skyrim without having to configure nearly as much. Its still in very early developments of now I&#39;m working on the GUI part of it",
  "descriptionHtml": "SkyBuilds (Sky-Builder) Your Skyrim&#39;s Best Friend&#33;\r<br />----------------------------------------------------------------------------------\r<br />Ever Wanted to have someone mod your skyrim for you? Set up your ENBs and even Configure you .ini files\r<br />Ever Wanted to Completely over haul skyrim but don&#39;t have hours to tinker and fiddle with settings and incomplete Youtube tuts?\r<br />The Sky-builds is for you&#33; Sky-builds is a utility that you directly install skyrim into and gain complete control&#33; wanna download Nexus mod manager or Loot?? Do it in just the click of a button&#33; wanna backup your skyrim so that its nice and safe? There are 3 available backup slots that you can use any time&#33;\r<br />You can configure skyrim to work anywhere form low-end Laptops to Heavy Gaming Monster PCs With the click of a button aswell as support the authors who build the mods&#33; and even better Sky-Builds has NO Over-head meaning its a Run&Done Deal. no Pesky Software Running in the background. Not to mention that when an update to your build comes out. This will update the game files automatically (Optional Feature) You can Even Browse Recommended mods&#33; and ofcourse its completely free for life&#33;\r<br />------------------------------------------------------------------------------------\r<br />What does it have/ What can it do?\r<br />Multiple Game Backup Slots (3, to be exact)\r<br />NOT a Mod Manager\r<br />Utility Downloader\r<br />Mod-Pack Download / Installer\r<br />Auto-Configs the .ini files\r<br />Installs Exclusive Patches so that mods play nice(r)\r<br />Notifies you when your Build is out of date&#33; \r<br />------------------------------------------------------------------------------------\r<br />How does it work?\r<br />You Select your base, which is basically the pre-curser to how powerful your pc is, i.e if you have a weak laptop pick Lite, powerful desktop Ultra\r<br />Then you select the build you want: example Lite&gt;Performance/GFX This is a pre-build that has many performance tweaks for low-end systems, Skybuild will fetch the needed mods, copy them over and update the skyrim.ini file as needed (please not it will delete the old .ini&#39;s)\r<br />The System will also fetch mods(patches) that are exclusive to the build, for example a mod that makes an armor purchasable where it wouldn&#39;t normaly be, or a mod that allows 2 mods to share resources. this however is only if those patches are available.",
  "categoryId": "39",
  "version": "0.0.0",
  "author": "Shadowforce62",
  "createdUnix": "1490178428",
  "updatedUnix": "1490183243",
  "containsAdultContent": false,
  "uploadedBy": "Shadowforce62",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000239762",
      "name": "Sneak Preview",
      "version": "0.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5679",
      "fileName": "Sneak Preview-82892-0-0-0.zip",
      "uploadedUnix": "1490183243",
      "modVersion": "0.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/954a6280479359f6e145d2ec7d5c976bc8d63603696ad04bda773c9201e48dc8/analysis/1490183602/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sneak%20Preview-82892-0-0-0.zip?fid=1000239762&ttl=1535871703&ri=8192&rs=8192&setec=4dca01def22c1626b7788d1933283c5d"
    }
  ]
}