{
  "modId": 82893.0,
  "modName": "Contenitore nel Contenitore",
  "summary": "",
  "descriptionHtml": "[b]ENGLISH VERSION\r<br />\r<br />[size=3]UPDATE 0.11[/size]\r<br />[size=3]I made a change to my project, now the objects contained in the container remain inside without moving in new LVLI.\r<br />The new idea insert the new LVLI with setting &#34;USEALL&#34; inside the container, along with the other objects already present.\r<br />The new LL is empty and can be effectively filled with objects of various mod of authors, you using the CK or the scripts. This new idea is easier to use to create the model, and there is less risk of bugs.\r<br />For now I only did the containers of all merchants, as a demonstration, in the next days i will complete the project with the other containers.[/size]\r<br />\r<br />Hello,\r<br />This mod is an idea / project that I have pondered for quite some time, one of the problems I have ever encountered in the game was the difficulty of inserting elements in the containers (eg., barrels, boxes or whatever). In fact if one inserted an object in any of the containers, he was then forced to create patches with mods that did the same. Unfortunately I found that even Wrye Bash not was able to solve the problem of compatibility between the various mod that touching containers, in fact this program affect the LVLI, creating a bash patch, but nothing could be done with the containers.\r<br />\r<br />Sure you could use scripts, but sometimes their difficulties made them daunting. I thought several times to insert new objects within other LVLI, but this would make it difficult if not rare generation of objects, especially if it had been placed inside LVLI full of other items. Many items that I wanted to enter had to always appear inside the container, every RESPAN, so that the player will always was, for example torches in LVLI merchants are inserted inside the container so that whenever respannasse torches would always find and have bought, then we know that the torches you not can buy or sell, this is because the torches do not have the KWD (VendorMisc ...) and so even if you are in the container of merchant, it does not appear among the items for sale.\r<br />So while I thought and tried in various ways to solve the problem, I discovered something, a long time ago, LVLI have three settings to be precise:\r<br />- Calculate from all levels &lt;= PC&#39;s Level\r<br />- Calculate for each item in count\r<br />- Use All\r<br />Of these settings is the last one that interested me, when activated, it obscures the other two, but the really interesting thing is the fact that the objects contained within this LVLI are taken and generated all, in practice this setting in the LVLI works as a container. Then I started thinking, but if one would create a LVLI with USE ALL and called it with the name of the container, adding a letter to distinguish it, then insert this LVLI custom in specific container, then it could put all the objects that are in the container within this LVLI, and these would be generated as if they were in the same container. Es. MerchantRiverwoodTraderChest currently is filled with various objects, using my idea it would within just a LVLI called _MerchantRiverwoodTraderChestLL (USE ALL) that contains the same objects that contained the container. I tested it and it works the objects are generated normally. The advantages of such a system would be enormous to begin scripts could still be used, but in this case Wrye Bash acquire greater utility, all mod that touch LVLI would still be compatible, the only mod that would require a patch are those that touch the containers, but in this case it would be enough to move the change from the container to LVLI-container. If a script of some current mod adds objects in the container, these items would still be generated normally, since the container would continue to function normally, so take all the objects added by the script, and those contained in LVLI-container. Now you think of making a mod like which then installed after Skyrim, Update and 3 DLC and Unofficial Patch, so take all the effects and the changes, in this case this mod would become the basis for all future mod, but also the according to the old model, if updated.\r<br />In the mod that I have published I have already touched on some containers to demonstrate how it works.\r<br />The only big problem to make such a mod is the great work to build it, requires a lot of patience and time, hoping not to make mistakes, which is why it makes me ask a question &#34;If this system seems to work because it was not used from the creators? &#34; and this is where I ask you in the community who have experience in modding, Do you think such a mod would work? or it could generate bug, which I because of my little experience, I can not predict. Do you think such a mod would be useful??\r<br />Sorry if my translation is very bad, but I&#39;m not good in English and I had to use a program auto-translation.\r<br />Thank you :)\r<br />\r<br />\r<br />ITALIAN VERSION\r<br />\r<br />[size=3]UPDATE 0.11\r<br />Ho fatto un cambiamento al mio progetto, adesso gli oggetti contenuti nel contenitore rimangono al suo interno e non vengono mossi al nuovo LVLI.\r<br />La nuova idea che ho avuto inserisce il nuovo LVLI, sempre con l&#39;impostazione &#34;USEALL&#34; dentro il contenitore, insieme agli altri oggetti.\r<br />Il nuovo LL è vuoto e può essere riempito con gli oggetti vostri, usando il CK o gli scripts. Oltre ad essere più facile da fare, c&#39;è meno rischio di generare bug.\r<br />Per adesso ho finito tutti i contenitori dei mercanti, come dimostrazione, nei prossimi giorni completerò il progetto con gli altri contenitori.\r<br />[/size][/b]\r<br />[b]Salve,\r<br />questo mod è un&#39;idea/progetto che riflettevo da un pò tempo, uno dei problemi che ho sempre riscontrato nel gioco era la difficoltà di inserire oggetti nuovi nei contenitori (es. Barili, Casse o quant&#39;altro). Infatti se uno inseriva un oggetto in uno qualunque dei contenitori, era poi costretto a dover creare delle patch con i mod che facevano lo stesso. Purtroppo ho scoperto che nemmeno Wrye Bash era in grado di risolvere il problema di compatibilità tra i vari mod che toccavano i contenitori, infatti questo programma gestiva le LVLI, creando una bash patch, ma non poteva fare niente con i contenitori.\r<br />Certo si potevano usare gli script, ma alcune volte la loro difficoltà li rendeva scoraggianti. Ho pensato più volte di inserire gli oggetti nuovi all&#39;interno di altre LVLI, ma questo avrebbe reso difficile se non rara la generazione di quell&#39;oggetto, specialmente se fosse stato inserito all&#39;interno di LVLI piene di altri oggetti. Molti oggetti che volevo inserire dovevano apparire sempre all&#39;interno del contenitore, ad ogni respan, in modo che il giocatore li trovasse sempre, per esempio le torce, nel LVLI dei mercanti sono inserite all&#39;interno del contenitore in modo che ogni volta che respannasse le torce le avrebbe sempre trovate e potute comprare, poi noi sappiamo tutti che le torce uno non le può comprare o vendere, questo perché le torce non hanno la KWD (VendorMisc...) e quindi anche se sono nel contenitore del mercante non appaiono tra gli oggetti in vendita.\r<br />Quindi mentre riflettevo e tentavo in vari modi di risolvere il problema, ho scoperto una cosa, tanto tempo fa, le LVLI hanno delle impostazioni tre per la precisione:\r<br />- Calculate from all levels &lt;= PC&#39;s Level\r<br />- Calculate for each item in count\r<br />- Use All\r<br />Di queste impostazioni è l&#39;ultima che mi ha interessato, quando viene attivata, essa oscura le altre due, ma la cosa veramente interessante è il fatto che gli oggetti contenuti all&#39;interno  di questa LVLI vengono presi e generati tutti, in pratica la LVLI con questa impostazione funziona come un contenitore. Allora ho cominciato a pensare ma se uno creasse una LVLI con USE ALL e la chiamasse con il nome del contenitore aggiungendo una lettera per distinguerla inserendola, poi, nello stesso contenitore, allora potrebbe inserire tutti gli oggetti che si trovano nel contenitore all&#39;interno di questa LVLI, e questi sarebbero generati come se si trovassero nel contenitore stesso. Es. MerchantRiverwoodTraderChest attualmente è piena di oggetti vari, utilizzando la mia idea esso avrebbe all&#39;interno solo una LVLI chiamata _MerchantRiverwoodTraderChestLL (USE ALL) che contiene gli stessi oggetti che conteneva il contenitore. L&#39;ho testato e funziona gli oggetti sono generati normalmente. I vantaggi di un sistema del genere sarebbero enormi, per cominciare gli script potrebbero ancora essere usati, ma in questo caso Wrye Bash acquisterebbe una maggiore utilità, tutti i mod che toccano le LVLI sarebbero ancora compatibili, gli unici mod che richiederebbero una patch sono quelli che toccano i contenitori, ma in questo caso basterebbe spostare la modifica dal contenitore al LVLI-contenitore. Se uno script di qualche mod attuale aggiunge oggetti nel contenitore, questi oggetti sarebbero comunque generati normalmente, siccome il contenitore continuerebbe a funzionare normalmente, quindi prenderebbe tutti gli oggetti aggiunti dallo script e quelli contenuti nella LVLI-Contenitore. Ora pensate di fare un mod del genere installarlo dopo Skyrim, Update e le 3 DLC e la Unofficial Patch, in modo da prendere tutti gli effetti e le modifiche, in questo caso questo mod diventerebbe la base per tutti i mod futuri, ma anche la base per i mod vecchi, se aggiornati. \r<br />Nel mod che ho pubblicato ho già toccato alcuni contenitori per dimostrare come funziona e per far vedere come funzionerebbe.\r<br />L&#39;unico grande problema di fare un mod del genere è il grande Lavoro per costruirlo, richiede molta pazienza e tempo, sperando di non fare errori, per questo motivo mi viene da formulare una domanda &#34;Se questo sistema sembra funzionare perché non è stato utilizzato dai creatori?&#34; ed è qui che chiedo a Voi della comunità, che avete esperienza nel modding, secondo Voi un Mod del genere funzionerebbe? oppure potrebbe generare dei bug, che io a causa della mia poca esperienza, non posso o non riesco a prevedere? Spero che mi potrete rispondere e farmi sapere se un lavoro del genere può essere utile e vale la pena lavorarci?\r<br />Scusate a tutte le persone che non conoscono l&#39;Italiano, ma io non conosco bene l&#39;inglese o altra lingua, per scrivere un testo cosi lungo, e anche utilizzare programmi di traduzione ho paura che potrebbe creare errori che renderebbero difficile la comprensione di quello che ho scritto. Se poi una persona più avvezza nelle traduzioni mi volesse tradurre il testo io lo pubblicherei.\r<br />Grazie a tutti :)\r<br />[/b]",
  "categoryId": "24",
  "version": "0.11",
  "author": "Avvoltoio",
  "createdUnix": "1490184417",
  "updatedUnix": "1490809407",
  "containsAdultContent": false,
  "uploadedBy": "Avvoltoio",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000239764",
      "name": "LVLI_Contenitore nel Contenitore",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2",
      "fileName": "LVLI_Contenitore nel Contenitore-82893-0-1.rar",
      "uploadedUnix": "1490184413",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/7bbdb3973c82cdd120966df097c49ba0d298c3d110cbbc75cb10d5ec5d2b4f87/analysis/1490184664/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LVLI_Contenitore%20nel%20Contenitore-82893-0-1.rar?fid=1000239764&ttl=1535871704&ri=8192&rs=8192&setec=f8ecdae6a0d7899cf206a3fee9584ca0"
    },
    {
      "fileId": "1000240266",
      "name": "LVLI_Contenitore nel Contenitore",
      "version": "0.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "LVLI_Contenitore nel Contenitore-82893-0-11.rar",
      "uploadedUnix": "1490809407",
      "modVersion": "0.11",
      "virusScanUrl": "https://www.virustotal.com/file/3da515303903d3875165dac65470a810b93070dae160177fd11dd8301596c535/analysis/1490809622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LVLI_Contenitore%20nel%20Contenitore-82893-0-11.rar?fid=1000240266&ttl=1535871705&ri=8192&rs=8192&setec=93cc91a95c2a9d838ee702fd569fe051"
    }
  ]
}