{
  "modId": 82891.0,
  "modName": "AKAVIR shores WIP PICS ONLY",
  "summary": "Just hoping to show what I&#39;ve worked on for the last few months, hoping people will track. These are only screenshots as it is not yet in a playable state, but so far I have 2 world spaces with about 5 dungeons and one large interior for the Temple. There is the main town and a small village on a plateau, as well as a few jungle areas and a sun",
  "descriptionHtml": "DOWNLOAD the playable File HERE: http://www.nexusmods.com/skyrim/mods/84010/?\r<br />\r<br />\r<br />Just hoping to show what I&#39;ve worked on for the last few months, hoping people will track. These are only screenshots as it is not yet in a playable state, but so far I have 2 world spaces with about 5 dungeons and one large interior for the Temple. There is the main town and a small village on a plateau, as well as a few jungle areas and a sunken tomb.\r<br />\r<br />I will come up with a full list of credits for assets used so far once I get a playable version up, but off the top of my head it uses assets by Mr.Siika, Phitts sheogorad rec, Strotis Rec, Tamira&#39;s plant rec. This will not be going on steam workshop only Nexus. I just wanted to see if people would be interested in playing something like this as i ran out of steam on it and have started thinking about getting it going again. I am not looking to form a team but If you would like your assets featured please feel free to contact me about permissions and credits. Thank you for taking an interest in Akavir&#33;\r<br />\r<br />To be done before BETA:\r<br />-finalize existing dungeons\r<br />-Add merchants and npc&#39;s to towns\r<br />-Navmeshing\r<br />-Finalize exterior to existing worldspaces\r<br />\r<br />\r<br />A few unique locales I hope to include after beta would be \r<br />1) a castle being fought over by the Tsaesci-Kapotun\r<br />2) a player home of some description\r<br />3) the ability to export unique goods to Skyrim (for all you merchants out there.)\r<br />\r<br />\r<br />Far, FAR futur plans:(AKA probably not till after ES6)\r<br />-one or more new worldspaces depicting a jungle and desert setting\r<br />-A battle with Tsaesci Navy",
  "categoryId": "30",
  "version": "0.01",
  "author": "Kyman3",
  "createdUnix": "1490166298",
  "updatedUnix": "1490166295",
  "containsAdultContent": false,
  "uploadedBy": "Kyman3",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000239757",
      "name": "AKAVIR shores WIP Pics",
      "version": "0.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2625",
      "fileName": "AKAVIR shores WIP Pics-82891-0-01.7z",
      "uploadedUnix": "1490166295",
      "modVersion": "0.01",
      "virusScanUrl": "https://www.virustotal.com/file/c08e9af216b21b8f72a2f7b40044c87a1e0dd7535f1f8722e2e301d334f56d35/analysis/1490166332/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AKAVIR%20shores%20WIP%20Pics-82891-0-01.7z?fid=1000239757&ttl=1535871701&ri=8192&rs=8192&setec=6c562710e36d905ad91874be3365317c"
    }
  ]
}