{
  "modId": 82916.0,
  "modName": "Chef of Death",
  "summary": "Adds a new boss, unique armor set, several potions/poisons and a mini quest.  Perfect for assassins who prefer to use alchemy to kill their victims.",
  "descriptionHtml": "Adds a new boss, unique armor set, several potions/poisons and a mini quest.  Perfect for assassins who prefer to use alchemy to kill their victims.  Also adds some not candid lore behind the White Phial.  This mod does not change the White Phial so it will be compatible with mods that do.  As a matter of fact, this mod should have no incompatibilities.\r<br />\r<br />\r<br />\r<br />The armor isn&#39;t custom, it&#39;s just a generic chef&#39;s outfit.  However it has been changed to light armor and mimics the stats of leather armor, and has unique (ish) enchantments.  Description as follows:\r<br />\r<br />\r<br />\r<br />[b]I. Chef&#39;s Hat[/b]\r<br />   A) Boosts alchemy skill by 100%\r<br />\r<br />[b]II. Chef&#39;s Tunic[/b]\r<br />   A) Opponents that get too close take 15 points of poison damage per second.\r<br />   B) Kind of like Boethiah&#39;s Ebony Mail, but the dragon born doesn&#39;t change black when in combat.\r<br />   C) Damages all enemies including undead and dragons [i](untested on dwarven automatons)\r<br />[/i]\r<br />[b]III. Chef&#39;s Shoes[/b]\r<br />   A) Health Regeneration is boosted by 100%\r<br />\r<br />[b]IV. Chef&#39;s Gloves[/b]\r<br />   A) Immunity to poisons\r<br />   B) Immunity to diseases\r<br />\r<br />\r<br />\r<br />I also added a jester outfit just for fun.  I thought that anyone wearing the Chef&#39;s of Death&#39;s outfit would be most at home in the Dark Brotherhood.  It has the same stats and enchantments as the chef&#39;s outfit.  You can only access the jester outfit via console command.\r<br />\r<br />\r<br />\r<br />The potions are weightless.  You can find 500 of each of them by looting the corpse of the Chef of Death.  Each has a base value of 10,000 septims.  Description as follows:\r<br />\r<br />\r<br />\r<br />[b]I. Chef&#39;s Boot Vitality[/b]\r<br />   A) Boots health, magicka and stamina stats by 1,000 for 10 minutes\r<br />\r<br />[b]II. Chef&#39;s Disease Cure[/b]\r<br />   A) Cures all diseases\r<br />\r<br />[b]III. Chef&#39;s Frenzy[/b]\r<br />   A) Everything will attack anything until they die. (Currently does not work on undead or dwarven automatons.)\r<br />   B) Restores targets health completely. [i](I always found it annoying when i poisoned my bow with a frenzy poison and the arrow did too much damage.  robbing my of my enjoyment of watching bandit turn on each other.)[/i]\r<br />   C) Laced with a toxin that deals 1 point of poison damage per second until death.\r<br />\r<br />[b]IV. Chef&#39;s Invisibility[/b]\r<br />   A) Permanent Invisibility until broken\r<br />\r<br />[b]V. Chef&#39;s Paralysis[/b]\r<br />   A) Target is paralyzed permanently [i](Works on dragons, but only when perched or landed.)\r<br />[/i]\r<br />[b]VI. Chef&#39;s Poison Cure[/b]\r<br />   A) Stops the effects of all poisons\r<br />\r<br />[b]VII. Chef&#39;s Restore Vitality[/b]\r<br />   A)(Completely restores health, magicka and stamina)\r<br />\r<br />[b]VIII. Chef&#39;s Toxin[/b]\r<br />   A) Deals 15 points of poison damage per second until target dies\r<br />\r<br />\r<br />\r<br />The mini quest to find the Chef of Death and his artifacts can be started by reading the &#34;Note to Farengar&#34; in Dragonsreach on Farengar&#39;s work table.  There are no quest markers.  I designed it to be the sort of quest you follow the clues to complete.  However, if you are the type that hates this kind of questing, I will provide a walk through at the bottom of the page.\r<br />\r<br />\r<br />\r<br />[b]Future plans:\r<br />\r<br />[/b]I. More potions and poisons\r<br />\r<br />II. Poisons work on the undead and dwarven automatons\r<br />\r<br />\r<br />\r<br />[b]Known bugs:[/b]\r<br />\r<br />I. Some placements are glitchy so some notes may be found on the floor instead of on tables and the like.\r<br />\r<br />II. Chef&#39;s Paralysis only works on dragons when they are perched or landed, and stay paralyzed even after soul absorption.\r<br />\r<br />III. The poisons do not work on undead or dwarven automatons, but I hope to change this.\r<br />\r<br />IV. There may be spelling mistakes in the journals.  I have corrected the errors I have caught, but I might have missed something.  If you see anything, feel free to comment and I&#39;ll get around to fixing it.\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[left][b][size=6]Spoiler&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;[/size][/b]\r<br />\r<br />Walk Through\r<br />\r<br />I. Go to Dragonsreach and to Farengar&#39;s work area.  You will find a note from Jarl Balgruuf the Greater describing problems with Olava the Feeble\r<br />\r<br />II. Search Olava&#39;s house until you find a letter from Gabriella asking for help locating the artifacts of the Chef of Death\r<br />\r<br />III. [i]You must have access to the Dark Brotherhood Sanctuary.  [/i]You will find Olava&#39;s reply on the table in the room with the Alchemy station and the Enchanting table where Gabriella works.  The reply describes a cave under a strange rock formation in the shadow of a tall mountain.  This refers to the Ritual stone and the Throat of the World.\r<br />\r<br />IV. Travel to Graywinter Watch.  Inside you will find a journal on an Alchemy station.  The journal belongs to the Chef of Death.  It gives you a hint of where to find the next journal, he is traveling to a swamp in the north-west.  This refers to Hjaalmarch.  \r<br />\r<br />V. There is only one good hideout in the swamps, and that is Movarth&#39;s Lair.  Inside in the Alchemy room and the boss chest, you will find the Chef of Death&#39;s second journal.  The journal tells of his unexpected friendship with a certain individual.  Once you learn who his new friend is, you will know where to find his ghost and his final journal.\r<br />\r<br />VI. You will not be able to reach the Chef of Death&#39;s ghost unless you go to Windhelm and talk to Nurelion to start the White Phial quest.\r<br />\r<br />\r<br />\r<br />[b]Other:\r<br />\r<br />[/b]After clearing the forsaken cave, eventually everything will reset, meaning the draugr will respawn.  I don&#39;t know if I want the Chef of Death to respawn, so for now that option is disabled.  If he did respawn, you could go back later and refill your supply of overpowered potions.  If he didn&#39;t, you might appreciate them more.  Still the average cheater (like me) could get more via console command.  If you want him to respawn, let me know in the comment section.[/left]",
  "categoryId": "54",
  "version": "1",
  "author": "KMB",
  "createdUnix": "1490317062",
  "updatedUnix": "1490317062",
  "containsAdultContent": false,
  "uploadedBy": "Phoenixfiregecko",
  "primaryFile": null,
  "files": []
}