{
  "modId": 82945.0,
  "modName": "Skyrim Ultimate Modding Guide - Mage",
  "summary": "Welcome! It's mage-dedicated list of mods that will greatly improve your mage gameplay and bring you interesting and bright expirience. I made it with maximum freedom of choice in mind. Guide is divided into sections, with personal comments, performance notes and more. Take a seat, and prepare to became a tremendous possessor of the Magnus",
  "descriptionHtml": "[center][size=5][color=#ff7700][/color][/size][/center][center][size=3]Tonns of my videos were demonetized on Youtube - the only source of income I now have. That raises a huge threat on my work as a part of Skyrim modding community. But there's a way to help me keep running. Watch this short video. Thank you.\n<br />[youtube]hJ9vEi4IqFU[/youtube][/size]\n<br />[size=4][color=#ff7700]Welcome![/color]\n<br />[color=#ff7700]Also check graphics guide [/color][url=http://www.nexusmods.com/skyrim/mods/76373][color=#6d9eeb]here[/color][/url][color=#ff7700] and gameplay guide [url=http://www.nexusmods.com/skyrim/mods/77928]here[/url].\n<br />Check my [url=https://www.nexusmods.com/oblivion/mods/48448]Oblivion gameplay guide[/url]﻿ as well.\n<br />[/color][/size][color=#ff7700][size=3][b]Join our [url=https://discord.gg/XjyJvxP]Discord server[/url] for modding chatting and advices.[/b][/size][/color][/center][color=#ff7700]\n<br />[/color][center]This guide in video:\n<br />[youtube]ciSdh4UmsoU[/youtube]\n<br />Example of gameplay with graphics and this guide combined:\n<br />[youtube]o705kwKT7aM[/youtube][/center][color=#ff7700]\n<br />[/color]\n<br />[font=Tahoma][color=#ff7700][size=4][b]About this guide:[/b][/size][/color]\n<br />[color=#a4c2f4][size=3]There are a lot of truly great mods as well as modding guides and tutorials. But they are mostly \"common\" (my guides are not exception) - focused on graphics, gameplay and/or stability in overall. Also, it's often a bit hard and even overhelming for \"newcomer\" player to create good mod setup, choosing from thousands of great mods. I tried to do my best, using all my expirience with mod setups to bring accurate, mage-dedicated list of mods (more than 150 in total) that will greatly improve your mage gameplay and bring you interesting and bright expirience. Like with my previous modding guides, I tried to make it with maximum freedom of choice in mind. It's not just \"mod pack\". It's detailed mod list, divided into sections, with personal comments (when it's needed), performance notes and more. Having no skills in scripting and modeling to create mods, but having an eternal love to Skyrim, all TES series and Nexus community, I'm trying to say my little \"thanks\" to authors for creating all these awesome mods and to players for helping this community grow - by creating a simple tutorials for players. Take a seat, and prepare to begin your path - from apprentice to tremendous possessor of the Magnus power! This list is my blood and sweat and cost me a lot of time, but be sure - it's only a beginning and I'll update and expand it each week. Also, similar guides for Warrior and Thief are also in progress. And, of course, if find it useful - spend a few moment to download .txt file to endorse the guide page :)[/size]\n<br />[size=3]P.S. If you're making a clean install, then for the best results, firstly go through my graphics and gameplay guides to create a \"base\" mod setup. Then turn back here.[/size][/color]\n<br />\n<br />[size=3]Ever wanted [/size][/font][font=Tahoma][size=3]to support me?\n<br />[/size]\n<br />[url=https://www.patreon.com/SinitarGaming][img]https://i.imgur.com/1n5DoL7.png[/img][/url]\n<br />\n<br />[b][color=#ff7700][size=4]Permissions:[/size][/color]\n<br />[/b][size=4][b]I do not give a permission to re-upload this to other sites by any other person, if you like this guide and want to share it please just add a link to this thread instead.\n<br />\n<br />[/b][/size][/font][font=Tahoma][size=4][color=#ff7700][b]Guide features:[/b][/color]\n<br />[list]\n<br />[*][size=4]Complete list of graphic, gameplay and accompanying mods. More than 150 in total. Textures, armors &amp; weapons, spells &amp; perks, combat and AI, immersion, player homes and fixes. Everything you need. Directly for your mage. [/size]\n<br />[*][size=4]Patches list for compatibility and my personal remarks for the best result.[/size]\n<br />[*][size=4]FPS-hungry mods marked.[/size]\n<br />[*][size=4]Personal notes about mods.[/size]\n<br />[*][size=4]List of all basic things/tools/tweaks you need to start modding and have stable game.[/size]\n<br />[*][size=4]Fresh added mod marked with [color=#ff0000]==[/color][color=#ff0000]NEW==[/color].[/size]\n<br />[/list][/size][/font]\n<br />[list]\n<br />[b][size=5][center]== FAQ ==[/center][/size]\n<br />[size=5][/size][/b][/list][color=#ff7700]Q:[/color] What are your PC specs?\n<br />[color=#1e84cc]A:[/color]Intel i5 6600k, GTX 980 4GB, 16GB RAM, 1920x1080 Full HD monitor, Windows 7.\n<br />\n<br />[color=#ff7700]Q:[/color] I got infinite loading screen/my game crashes\n<br />[color=#1e84cc]A:[/color] Please read \"How to start modding/stability section\" carefully. Read it and install all the things needed before start modding.\n<br />\n<br />[color=#ff7700]Q:[/color] That doesn't help!\n<br />[color=#1e84cc]A:[/color] Trust me, if you have read everything carefully and installed, it will solve all your problems in 99% of cases. If not, feel free to ask in comments, I'll do my best to help you :)\n<br />\n<br />[color=#ff7700]Q:[/color] Where are you from? A few words about you?\n<br />[color=#1e84cc]A:[/color] Ukraine. 27 years old. Gamer, gym addict. Web-developer in past, fitness trainer and nutritionist now.\n<br />\n<br />[color=#ff7700]Q:[/color] Would you expand this guide and add this/that?\n<br />[color=#1e84cc]A:[/color] Sure! I'll do my best to expand it as much as possible to save your time guys :)\n<br />\n<br />[color=#ff7700]Q:[/color] Guide page is updated often, but .txt file is only one time in a few days, how can I see the actual changelog?\n<br />[color=#1e84cc]A:[/color] I add mods and fix text errors few times per day, so it's obvious that it would be a bad idea to upload new file 10 times per day. Instead of this, I did 1 simple thing - all the mods added to the guide, but still not included in the guide .txt file will be marked with red-colored \"[color=#ff0000]==[color=#ff0000]NEW==[/color][/color]\" sign. Hope it helps :)\n<br />\n<br />[color=#ff7700]Q:[/color] Why not included this/that mod?\n<br />[color=#1e84cc]A:[/color] I care about your game stability guys :) If I didn't include some mods that means on of 2 reasons: 1) I'm just a human and I'm not able to know about absolutely all great mods, that's why I'll update the guide 2) These mods can cause instability/crashes/save bloats and so on. Sure, if you like some mods that are out of this list you're absolutely free to use them, just be sure to check [url=https://www.reddit.com/r/skyrimmods/wiki/dangerous_mods_masterlist#wiki_dangerous_-_game_breaking_and_highly_unstable_mods]this[/url] link. I just made this list in overall view that your mod list will be big, that's why usage of \"dangerous\" mods is pretty...dangerous :)\n<br />\n<br />[color=#ff7700]Q:[/color] Can you just upload your Skyrim folder with all your mods somewhere so I can just download it and not to choose and install mods one by one?\n<br />[color=#3d85c6]A:[/color] No. Just no, sorry. The reason:\n<br />I can't do this unfortunately as many mods from the list are Nexus-exslusive and mod authors didn't give a permission to re-upload their works somewhere. I respect their work.\n<br />And also trust me - when you're making your mod setup by yourself the result will be way better because most of mods are absolutely matter of taste.\n<br />[color=#ff7700][size=5][b][center]\n<br />== HOW TO START MODDING/STABILITY ==[/center][/b][/size][/color][color=#ff7700][size=4][b]\n<br />1) Download and install mod manager.[/b][/size][/color]\n<br />Choose between [url=http://www.nexusmods.com/skyrim/mods/modmanager]Nexus Mod Manager[/url] and [url=http://www.nexusmods.com/skyrim/mods/1334]Mod Organizer[/url]. Both of them are awesome. I personally use NMM. Almost all mods can (and should) be installed via mod manager. The guide contains notices when you'll need to install some mod/ part of mod manually.\n<br />\n<br />[size=4][color=#ff7700]2) Download and install [/color][url=http://skse.silverlock.org/]SKSE[/url][/size][color=#ff7700][size=4]. If you allready have it - great, if no - install it. It's obligatory.[/size]\n<br />[/color]SKSE (Skyrim Script Extender) is must-have for playing modded Skyrim. Most of all popular gameplay mods need it to be installed. Also, almost all memory/stability tweaks and fixes require it. Install it to your Skyrim root directory (not the data folder), where your TESV.exe is. [color=#ff7700]Important![/color] From this time, you should launch and play your Skyrim only using SKSE.exe. Skyrim launcher will be used only for disabling/enabling mods (but this also can be done via mod manager). Most gameplay mods require SKSE.\n<br />\n<br />[size=4][color=#ff7700]3) Download and install [url=http://www.nexusmods.com/skyrim/mods/3863]SkyUI[/url]. Most of gameplay mods require SKSE and SkyUI. Also install [url=http://www.nexusmods.com/skyrim/mods/3222]iHUD[/url].[/color][/size]\n<br />\n<br />[color=#ff7700][size=4]4) Go to [url=http://www.nexusmods.com/skyrim/mods/50214]Speed and Stability Guide[/url] page. Download and install SKSE.ini from it's optional files (this can be done by mod manager).\n<br />[/size][/color][color=#ff0000]Important![/color] Even if you don't use the ENB, you still need to install it.\n<br />\n<br />[color=#ff7700][size=4]5) Download and install [url=https://loot.github.io/]LOOT[/url].\n<br />[/size][/color]LOOT is a must-have tool if you planning to have many mods. It's very easy to install and use.\n<br />His most basic and important function is mod sorting. Many mods should be loaded in strict load order. This mod should be loaded before that mod, but after that, and so on. LOOT makes miracles! You can automatically sort all your mods properly by just clicking button 2 times. Sometimes (it happens rare, so mostly you won't to think about it) some mods have direct instructions about how they should be loaded, in this case it's also easy to sort them manually using it. Also, LOOT shows you all you need to know about your mods instlalled - errors, missing records, incompatibility etc. If something is not right - it will let you know and it will advise you. Actually, you'll not need to read and lean more than this to use it, but if something is unclear or you want to look at very in-depth guide, check this awesome [url=https://www.youtube.com/watch?v=SzoyWugzZAw]Gopher's video[/url]. Use LOOT sorting  each time after you've installed a few mods.\n<br />\n<br />[color=#ff7700][size=4]6) Download [url=http://www.nexusmods.com/skyrim/mods/25859]TES5edit[/url].\n<br />[/size][/color]It's an awesome tool for cleaning your mods. Mods may contain \"dirty\" records and some other issues. And when you will have hundreds of mods, that could be a problem and cause crashed. This step and tools usage are not obligatory, but strongly recommended. Don't be afraid of it, it's not so hard to use as it may look. Check this one awesome [url=https://www.youtube.com/watch?v=fw3g_N1jcZQ]video guide by Gopher[/url]. Also there are a lot of info and videos at it's Nexus page.\n<br />\n<br />[color=#ff7700][size=4]7) Install [url=http://www.nexusmods.com/skyrim/mods/72725]Crash Fixes[/url]. It's obligatory.\n<br />[/size][/color]It's new, constantly updated and just criminally underrated SKSE plugin! It's light-weight, one-click to install (using mod manager) and it really works great. You'll notice faster loading and zero or almost zero crashes. Also it replace SSMSE/SKSE memory patch and work much better and more easy to configure. After you installed it via mod manager, do the next:\n<br />1) [color=#ff0000]Go to /data/SKSE/plugins/CrashFixPlugin.ini and open it with any text redactor (notepad for example).\n<br />[/color]2) [color=#ff0000]Install[/color] [url=http://www.nexusmods.com/skyrim/mods/75795]THIS ONE[/url][color=#ff0000]. Download, unzip and place[/color] [url=http://www.nexusmods.com/skyrim/ajax/downloadfile?id=1000207412][color=#ffffff]D3DX9_42[/color][/url] [color=#ff0000]to your Skyrim folder (where your TESV.exe is, not in the /data folder).[/color]\n<br />3) [color=#ff0000]Find and set [/color][color=#ff0000]UseOSAllocators to 1 (UseOSAllocators=1)[/color]\n<br />4) [color=#ff0000]Find and set [/color][color=#ff0000]CustomMemoryBlock to 1 (CustomMemoryBlock=1)\n<br />[/color]5) [color=#ff0000]Find and set [/color][color=#ff0000]MemoryInfoConsole to 1 (MemoryInfoConsole=1)[/color]\n<br />6) [color=#ff0000]Launch Skyrim and open console \"~\" button.[/color]\n<br />7) [color=#ff0000]Look on maximum memory block load. If it's 90% or higher - exit game and find CustomMemoryBlockTotalSizeMb value. Set it a bit higher (for example, if it was 110, set it to 120), save .ini files, launch Skyrim and check memory block load again. Do this until maximum load won't be higher that 85-90% (check this in populated towns or combat).[/color]\n<br />\n<br />[color=#ff7700][size=4]8) Install [url=http://www.nexusmods.com/skyrim/mods/71214]USLEEP[/url] and [url=http://www.nexusmods.com/skyrim/mods/76747]Bug Fixes[/url].\n<br />\n<br />9) Install [url=http://www.nexusmods.com/skyrim/mods/58705]PapyrusUtil - Modders Scripting Utility Functions[/url].\n<br />[/size][/color]\n<br />[size=4][b][color=#ff7700]10) Install [/color][url=http://www.nexusmods.com/skyrim/mods/9557]Alternate Start - Live Another Life[/url] or [url=http://www.nexusmods.com/skyrim/mods/71465]Skyrim Unbound[/url][color=#ff7700].[/color][/b][/size]\n<br />Why you need this? These mods provide wide amount of alternative starts the game for those who do not wish to go through the lengthy intro sequence at Helgen. The thing is that vanilla start (scene in Helgen) is VERY heavy-scripted. And when you will install let's say, 200+ gameplay mods and start a new game, your Skyrim will be very heavy overloaded. And there's very high chance that your came will crash, even if it's absolutely stable. And now these mods save the day! You can just skip this heavy-scripted scene and start anywhere you like. Besides, it has a really wide amount of alternative start, great for roleplay. I personally advise to use first one, but it's absolutely up to you.\n<br />\n<br />[color=#ff7700][size=4]NEXT TWO STEPS ARE OPTIONAL. READ ATTENTIVELY.[/size][/color]\n<br />\n<br />[color=#ff7700][size=4][b]11) Read this [url=http://www.nexusmods.com/skyrim/mods/48387]article[/url]. This is not obligatory, but it works and it's very useful.\n<br />[/b][/size][/color][color=#ff0000]IMPORTANT! [/color]Use its settings only if you're 100% understand what you're doing. If you're very new to .ini files tweaking, don't use it. It's absolutely optional. Messing with these values is not a joke. Once again, If you think something is unclear for you, don't use it. And if you'll use it, don't use the .dll files describied in it, only \"play\" with Skyrim.ini settings preferably with Ugrids=5 (original value).\n<br />\n<br />[color=#ff7700][size=4][b]12) Download [url=http://www.nexusmods.com/skyrim/mods/52363]Save game script clea[/url][/b][/size][/color][color=#ff7700][size=4][b][url=http://www.nexusmods.com/skyrim/mods/52363]ner[/url]. YOU DON'T NEED TO USE IT UNTIL THE NEXT CONDITIONS:\n<br />[/b][/size][/color]This is not obligatory. If you will not uninstall scripted mods in the middle of playthrough, you don't need it. If you uninstall mods that contain scripts in the middle of playthrough and then save game, so called \"orphan scripts\" will be still in your save file even mods with that scripts are already gone. This can cause crashes. It's just a save cleaner if your save is really near to dead cause of orphan scripts.\n<br />\n<br />[color=#ff7700][size=4]13) Download and install [/size][/color][color=#6d9eeb][url=http://www.nexusmods.com/skyrim/mods/1840][size=4]Wrye Bash[/size][/url][/color][color=#ff7700][size=4]. [/size][/color]\n<br />It's a great tool that allows you to merge different .esp files, both mods and patches, into one .esp file. Doing this, you'll greatly reduce amount of .esp files in your load order, allowing to install more mods and never reach 255 plugins limit. Also, Wrye Bash helps with mergins so called \"leveled lists\". For example, if you have 10 mods that adds armors/weapons to the game, without mergin them in leveled lists, you'll probably never see all the items during usual gameplay (chests, enemies invetory etc). Bashed patch fixes that in most of cases.\n<br />\n<br />[b][color=#ff7700]Before you start, be sure to read these tips:[/color][/b]\n<br />\n<br />[color=#ff7700][b]Important tip #1:[/b][/color][size=4] [/size]Installing order for gameplay mods mostly doesn't matter, but the load order matters. Be sure to use LOOT sorting each time after installed a few gameplay mods and read mod description page carefully - many gameplay mods usually affect the same things in game so thye should be loaded in a strict order to work properly.\n<br />\n<br />[color=#ff7700][size=4][b]Important tip #2:[/b][/size][/color][size=4] [/size]This list doesn't mean you need to install absolutely all the mods. Choose mods you like the most,test them and then install in your playthrough. When you want to test a mod - do this. Just keep in mind that uninstalling scripted mods in the middle of playthrough is not recommended because scripts can still be in your savefile even after mod was deleted. This can cause save to be broken. Test the mod, just be sure to NOT overwrite your main save file. Make another save, test mod using it.\n<br />\n<br />[color=#ff7700][size=4][b]Important tip #3:[/b][/size][/color][color=#ff7700] [/color]Do not overload your game with new lands/quest mods. Always read mod description page attentively. Some of these mods can affect same location, add new items/perks/skills and so on, so you need to be aware of this. Mods amount is huge and mod authors are just not able to provide information about absolutely all mods compatibility. The best idea would be to pick mods you like the most, read their description pages carefully and then install them if you understand that there're no potential conflicts. P.S. \"conflict\" doesn't means crashes, but you may face some quest/cells bugs. Just always read the description carefully and you'll be fine :) Dungeons mods should be technically compatible with everything, but sometimes these mods can share same exterios that lead to mods cell. Usually compatibility patches for popular mods are available in this case.\n<br />\n<br />[color=#ff7700]Congrats, you're ready now. Let's begin!\n<br />\n<br />\n<br />[center][img]https://pp.userapi.com/c626119/v626119395/5cc91/qOvLA6zdhzU.jpg[/img][/center][font=Tahoma][color=#ff7700]\n<br />[size=5]Spells related retextures:[/size]\n<br />[size=3]Fire effects - choose one of these two:[/size][/color][/font][/color][url=http://www.nexusmods.com/skyrim/mods/28642]Ultimate HD Fire Effects[/url]\n<br />My personal favourite. Also check \"Ultimate HD Candle Flames\" from optionals section. Until you have very weak PC, feel free to use \"Ultimate\" resolution, it won't have any performance impact.\n<br />[url=http://www.nexusmods.com/skyrim/mods/2692]Cinematic Fire Effects 2 HD[/url]\n<br />[color=#ff0000]Special tip[/color] - for the best visual result for fire, other spells and also things like fogs etc, and if you don't have problems with low FPS, open your SkyrimPrefs.ini, find [color=#ff0000][Particles][/color] section there and set [color=#ff0000]iMaxDesired[/color] value at least to 3000. 6000 is great. If this will affect your performance, set any value that will give the best balance between visuals and FPS. But if until you're not running Skyrim on integrated graphics on Pentium II, you won't have problems :)\n<br />[color=#ff7700]\n<br />[/color][url=http://www.nexusmods.com/skyrim/mods/59714]OIL[/url]\n<br />As mage, you'll be oftenly kill enemies by burning them in oil. Get the proper retextures for this :)\n<br />[url=http://www.nexusmods.com/skyrim/mods/50316]Transparent and Refracting Icicle and Frost Atronach[/url]\n<br />This one will have a great visual effect on your spells like \"Ice Spike\" etc.\n<br />[url=http://www.nexusmods.com/skyrim/mods/58695]ELECTRIFY[/url]\n<br />Great retexture for electric spells.\n<br />[url=http://www.nexusmods.com/skyrim/mods/80367]Candlelight Redone[/url]\n<br />Beautiful retexture for candlelight! [color=#ff0000]==NEW==[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/41052]Magic Runes HD[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/2947]Deadly Spell Impacts[/url]\n<br />\n<br />[color=#ff7700][size=3]Other texture mods useful for mage:[/size][/color]\n<br />Be sure to install them, as they will give visual improvements to many aspects of mage gameplay - summoned creatures, shapeshifts, alchemy ingredients, ehcnanting, clothing etc:\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/3621]Bellyaches Animal and Creature Pack[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/24909]aMidianBorn Book of Silence[/url]\n<br />Install mod parts in this order and overwrite when asked:\n<br />1) ARMORS 2) CREATURES 3) DRAGONBORN DLC 4) UNIQUE ITEMS 5) WEAPONS. Also don't forget to install all the \"hotfixes\" files from MISC section to fix \"purple textures\" for some items.\n<br />\n<br />[color=#ff7700]Now choose between the next few mods. That will improve your dwemer summons textures (if you have such spells):[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/68650]Dwemer Automatons HD[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/51270]Better Dwemer Spider Textures[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/75610]Ancient Dwemer Metal[/url]\n<br />My personal favorite.\n<br />[color=#ff7700]Deal with it.\n<br />[/color]\n<br />[url=http://www.nexusmods.com/skyrim/users/6781714/?tb=mods&amp;pUp=1]Kajuan's profile[/url]\n<br />Be sure to check his awesome list of retexture mods. I prefer his separate mods over previous \"packs\". His Skeletons and Draugrs are just brilliant. Sabrecat is also good retexture for your possible shapeshift spells.\n<br />[url=http://www.nexusmods.com/skyrim/mods/51456]Rens HD Flame Atronach[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73321]Seeker and Lurker - Creature Retex\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/73385]Storm Atronach - Creature Retex[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/27643]Frost Atronach HD Retex[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/77415]RUSTIC DEATH HOUND[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/77778]RUSTIC GARGOYLE[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/69784]RUSTIC CLOTHING[/url]\n<br />Contains hundreds of retextures for clothing, including mage/necromancer clothing etc. Overwrite previous mod files during the installation.\n<br />[url=http://www.nexusmods.com/skyrim/mods/35117]Unique Dragon Priest Masks - HD textures[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/69289]Mage Outfit Texture Overhaul (HD 2K) - MOTO - With Schools of Magic[/url]\n<br />Awesome mod that is retexturing mage outfits, if you like it more than previous mods for mage outfits, install it and approve overwrite.\n<br />[url=http://www.nexusmods.com/skyrim/mods/75063]Frankly HD Miraak[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/54681]Dragonborn Clothing HD Retextures[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/49612]Elegant Circlets 2k[/url]\n<br />Good retexture for vanilla circlets.\n<br />[url=http://www.nexusmods.com/skyrim/mods/27038]Jewels of the Nord - HD rings and necklaces\n<br />[/url][url=http://www.nexusmods.com/skyrim/mods/35399]Book Covers Skyrim\n<br />[/url]A MUST-HAVE mod for every mage! Also be sure to check [url=http://www.nexusmods.com/skyrim/mods/50441]patches[/url].\n<br />[url=http://www.nexusmods.com/skyrim/mods/57120]Book Covers Skyrim - Lost Library[/url]\n<br />Adds more books the game, mostly from previous TES games.\n<br />[url=http://www.nexusmods.com/skyrim/mods/52266]Gemling Queen Jewelry[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53171]Animated Enchantments Overhaul - OVERFLOWING MAGIC[/url]\n<br />\n<br />[color=#ff7700]Next 2 mods will be useful for you, if you plan to levelup alchemy, as they add/retexture insects and butterflies in Skyrim.[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/4955]83Willows 101BugsHD Butterfly Dragonfly[/url] [color=#38761d]==F[/color][color=#f1c232]PS==[/color]\n<br />This mod is very optional. It adds tonns of different insects to Skyrim making it look much more alive. My personal opinion is that it boosts Alchemy too much as you can collect hundreds of ingredients per minutes and some of new potions from these ingredients are a bit overpowered. But there's a patch to fix this and bring some balance, you can get it here: [url=http://www.nexusmods.com/skyrim/mods/71499]FIX PATCH[/url].\n<br />[url=http://www.nexusmods.com/skyrim/mods/69543]Lepidoptera Of Skyrim[/url]\n<br />Beautiful butterfly mod.\n<br />[color=#ff0000]Note: Choose this one OR 83Willows 101Bugs HD\n<br />[/color]\n<br />[color=#ff7700]A few more plants/ingredients retexture mods:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/1546]Hybrids HD Plants and Herbs Retexture[/url]\n<br />Choose and install texture manully as many of them can be already retextured by other flora mods.\n<br />[url=http://www.nexusmods.com/skyrim/mods/74792]Falmer Ear and Hagraven Claw[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74336]Spider Egg Retexture[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74303]Taproot 1K[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74291]Skeever Tail 1K[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70360]Realistic Jazbay Grapes[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/36457]Better Nirnroot - Hi-Res 2K Textures[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70133]Deathbell HD - All-New Textures[/url]\n<br />[color=#3d85c6][url=http://www.nexusmods.com/skyrim/mods/78145]Mountain flower by Mari[/url][/color][color=#ff0000]\n<br />[/color][url=http://www.nexusmods.com/skyrim/mods/78197]Deathbell by Mari[/url]\n<br />\n<br />[color=#ff7700][size=3]Beautiful retexture mods for alchemy/enchanting researches:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/62328]RUSTIC ALCHEMY and ENCHANTING TABLES[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53638]LeanWolf's Improved Enchanter Candle Meshes\n<br />[/url][color=#ff7700]Now choose between the next few mods:\n<br />[/color][url=http://www.nexusmods.com/skyrim/mods/62701]RUSTIC POTIONS and POISONS[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/75492]Pretty Animated Potions and Poisons[/url]\n<br />This mod has an awesome feature: potions &amp; poisons are really animated! And also glow at night or in the dark.\n<br />[url=http://www.nexusmods.com/skyrim/mods/77541]RUSTIC ANIMATED POTIONS and POISONS[/url]\n<br />Combination of both previous mods.\n<br />[color=#ff7700]Deal with it.\n<br />[url=http://www.nexusmods.com/skyrim/mods/54078]White Phial Replacer[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/63766]RUSTIC SOULGEMS[/url]\n<br />[/color]\n<br />[color=#ff7700][size=4][b]LIGHTING MODS. INSTALL ONLY ONE:[/b][/size][/color]\n<br />As mage, you'll often launch different spells, that will make lighting effects, so to have a good lighting mod is also important. The only one problem with them is that many ENB presets are incompatible with them. FYI: when we talk about weather/lighting mods compatibility with ENB presets, if such mod is \"incompatible\" this doesn't mean it will cause crashes. But you can encounter weird weather/lighting visuals as ENB presets have their own weather/lighting settings usually. So you can absolutely try to use them with any ENB, but will need to be ready to face the issues and and tweak your ENB presets.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/27043]Enhanced Lights and FX (ELFX)[/url] [color=#38761d]==F[/color][color=#f1c232]PS==[/color]\n<br />My personal favorite. The most deep effects.\n<br />Pros: awesome lighting mod with the widest amount of options so the most configurable. Most fresh one.\n<br />Cons: the most FPS-hungry. Eats even more FPS in some locations, but there's a fix that can be downloaded here:\n<br />[url=http://www.nexusmods.com/skyrim/mods/60603]Unofficial Enhanced Lights and FX ELFX SMIM ENB fps performance patch[/url]\n<br />Some people also don't like \"orange\" light colors during night in some places.\n<br />[url=http://www.nexusmods.com/skyrim/mods/30450]Realistic Lighting Overhaul[/url][color=#38761d] ==FPS==[/color]\n<br />pros: more performance-friendly.\n<br />cons: outdated. Won't be updated.\n<br />But it's still a great mod and it's OK to use if you like it.\n<br />[url=http://www.nexusmods.com/skyrim/mods/17609]Relighting Skyrim[/url] + [url=http://www.nexusmods.com/skyrim/mods/59733]ELE - LITE[/url][color=#38761d] ==FPS==[/color]\n<br />If you don't like both ELFX and RLO you can try this. Also this combination of mods has the best compatibility with ENB presets.\n<br />[url=http://www.nexusmods.com/skyrim/mods/77438]Relighting Skyrim - USLEEP Patch[/url]\n<br />Be sure to use this awesome patch with Relighting Skyrim if you use it.\n<br />\n<br />[color=#ff7700][size=4]RECOMMENDED ENB PRESETS.[/size][/color]\n<br />This list is completely optional. It's just a short list of ENB presets, that, from my personal expirience and testing, are looking great for mage playthrogh for their colors/lighting balance or unique appearance.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/41482]Rudy ENB[/url][color=#f1c232] ==FP[/color][color=#38761d]S==[/color]\n<br />One of most unique presets on Nexus and one of my favourite. It pretty desaturated and has some really unique weathers and semi-realistic visuals. Also compatible with awesome DARKEND mod!\n<br />[color=#ff7700]Weather mods compatibility:[/color] URWL (do someone still use this? :D), NLA (different version have different weather mod compatibility), NLVA.\n<br />[color=#ff7700]Lighting mods compatibility:[/color] ELFX.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/79335]SNOWFALL ENB[/url] [color=#f1c232]==FPS==[/color]\n<br />Just an amazing preset based on Rudy ENB with REALTIME snow cover. Try it for sure!\n<br />\n<br />[url=https://github.com/FKPX3118/DAHAKA-s-ENB]DAHAKA's ENB[/url] [color=#f1c232]==FPS==[/color]\n<br />Awesome ENB preset for COT5/ELFX. Stunning and bright colors.\n<br />[color=#ff7700]Weather mods compatibility[/color][color=#ff7700] none.[/color] COT.\n<br />[color=#ff7700]Lighting mods compatibility:[/color] ELFX.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/61968]Elder Blood ENB Redux[/url] [color=#f1c232]==FPS==[/color]\n<br />[color=#ff7700]Weather mods compatibility[/color][color=#ff7700] none.[/color] Don't use any weather mods.\n<br />[color=#ff7700]Lighting mods compatibility:[/color] ELFX.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/73848]Tetrachromatic ENB[/url] [color=#f1c232]==FPS==\n<br />[/color]It looks great, realistic and fantasy-like at the same time. Original version has about 80 custom weathers. It's pretty saturated so some people can find it less lore-friendly for Skyrim. But my personal advise is to try it for sure!\n<br />[color=#ff7700]Weather mods compatibility:[/color] Vanilla weathers (original version), VW, NLVA (different version have different weather mod compatibility).\n<br />[color=#ff7700]Lighting mods compatibility:[/color] Relighting Skyrim + ELE Lite (compatible, but not necessary as mod author says).\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/83091]Antique Dragon ENB[/url] [color=#f1c232]==F[/color][color=#38761d]PS== [/color][color=#ff0000]==NEW==[/color]\n<br />New ana amazing fantasy ENB preset. Not so saturated as Tetrachromatic, and also with fully-working night eye as well as tweaked adaptation effect, that is great for mages - you'll not more blind yourself with your fire spells in dark dungeons.\n<br />[color=#ff7700]Weather mods compatibility:[/color] Vanilla weathers, but with Vivid Weathers textures (install it and delete it's .esp file).\n<br />[color=#ff7700]Lighting mods compatibility:[/color] ELFX (only interiors, without enhancer).\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/75537]Mure ENB[/url] [color=#f1c232]==FPS==[/color]\n<br />ENB preset with some original visuals, sharp and a bit desaturated. May be great for necromancer playthrough.\n<br />[color=#ff7700]Weather mods compatibility: [/color]none. Don't use any weather mods.\n<br />[color=#ff7700]Lighting mods compatibility:[/color] none. Don't use any lighting mods.\n<br />\n<br />\n<br />[color=#ff7700][center][img]https://pp.userapi.com/c626119/v626119395/5cc64/OoCtP9Tu_Ek.jpg[/img][/center][/color]\n<br />[color=#ff7700][size=4]Some armor mods:[/size]\n<br />[size=3]List of armor mods that could look good on different types of mage characters.[/size][/color]\n<br />[size=2][color=#6d9eeb][url=http://www.nexusmods.com/skyrim/mods/19733]Immersive Armors[/url]\n<br />[/color][/size]The biggest armor collection for you! Contains a lot of unique looking items for mages, such as Tribunal Robes, Dwarven Robes etc.\n<br />[url=http://www.nexusmods.com/skyrim/mods/20077]Tribunal Robes and Masks[/url]\n<br />If for some really strange reasons you don't want to install IA, get this for tribunal robes.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73040]Wayfarer's Coat[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/78567]Master of Beasts Armor[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/77171]SC - Witch of the Wilds[/url]\n<br />DA inspired clothing mod.\n<br />[url=http://www.nexusmods.com/skyrim/mods/82543]DCR - King Crusader Armor[/url]\n<br />Can be great for dark mage or necromancer.\n<br />[url=http://www.nexusmods.com/skyrim/mods/77978]Legendary Armory[/url]\n<br />Some of this mod armors can go great with battle mage or spellsword character.\n<br />[url=http://www.nexusmods.com/skyrim/mods/74242]Lind's Standalone Robes Pack[/url][color=#ff0000] ==NEW==[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/9645]Black Mage Armor[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/28147]zzjay and Grace Darklings Hoods with hairs[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/30466]Hunting Grounds Outfit[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/21572]Blood Witch Armor[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/25476]Evil MasterMind Armor[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/36497]Raven witch armor and Apex Werewolf[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/69138]Daedric Reaper Armor[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/61013]Emfy Cleric Robes[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/68653]Cassandra Frost Witch Outfit[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/38386]Contractor and Mavari Armors[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/59202]Sotteta Necromancer Outfit[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/42169]Demon Hunter Armor by Jojjo[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53442]zzjay's wardrobe[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/38053]Northgirl Armor[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/54793]Noble Dress[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/67601]Triss' Dress[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/59734]Lind's Court Wizard Robes[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74239]Black Viper's Will[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/49130]Velvet Robes and Cloaks[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/36738]The Witcher 2 - Eilhart Dress[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/39922]Elven Dresses by Naihaan[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/16438]Bandolier - Bags and Pouches[/url]\n<br />Mod with a lot of immersive-looking little items. The greatest thing is most of them will increase your carry weight, what is really useful as mage characters usually don't have a lot of Stamina.\n<br />[url=http://www.nexusmods.com/skyrim/mods/31191]Mage Backpack by Tumbajamba[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/65359]Big Leather Backpack[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/1040]The Art of Magicka[/url]\n<br />Hundreds of craftable clothes for mages.\n<br />[url=http://www.nexusmods.com/skyrim/mods/63918]Blue Telvanni Mage Robes[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/69681]Battlemage Armour (Female)[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/28580]Inquisitor Set[/url]\n<br />Amazing set of robe (light armor type) for paladin/witchhunter characters.\n<br />[url=http://www.nexusmods.com/skyrim/mods/52667]Hedge Mage Armor[/url]\n<br />\n<br />[color=#ff7700][size=3]Some Circlets Mods:[/size][/color]\n<br />[size=2][color=#6d9eeb][url=http://www.nexusmods.com/skyrim/mods/41603]JS Armored Circlets[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/27064]KDCirclets Redone[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/67309]KS Jewelry[/url]\n<br />\n<br />[/color][/size][color=#ff7700][size=3]Some staff/weapons mods:[/size][/color]\n<br />[color=#6d9eeb][size=2][url=http://www.nexusmods.com/skyrim/mods/22691]Staves of Skyrim[/url][/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74379]'The Elianora' Master Wizards Staff[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/67904]Battlemage Staves[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/42243]Ancient Staff[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/39762]Ibans Staff[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/36109]Fighting Mage Staff[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/81036]Zim's Immersive Artifacts[/url]\n<br />Amazing mod, a complete overhaul to the most of unique artifacts in Skyrim. Now artifacts like Gauldur's Amulet will have really tremendous power that you mage Dragonborn deserves.\n<br />[url=http://www.nexusmods.com/skyrim/mods/82152]Thane Weapons Reborn[/url]\n<br />Brilliant and lore-friendly mod from the \"Legacy of the Dragonborn\" author. It greatly improves Thanes weapons in all holds.\n<br />[url=http://www.nexusmods.com/skyrim/mods/81118]Royal Armory - New Artifacts\n<br />[/url]One more great weapon mod that adds unique named weapons to almost all key NPCs in Skyrim. Obtaining some of these weapons will give a huge combat advantage to your spellsword character or just give you a really strong weapon when you'll be out of mana.\n<br />[url=http://www.nexusmods.com/skyrim/mods/72910]Dawnguard Arsenal[/url]\n<br />Improved dawnguard items and spells. Mostly for paladin character, but also good for any mage if you're planning to use restoration school.\n<br />\n<br />[color=#ff7700][size=3]Some player homes/castles/estates, suitable for mages:[/size][/color]\n<br />[size=2][url=http://www.nexusmods.com/skyrim/mods/76231]Caranthir Tower Reborn[/url]\n<br />[/size]Brilliant, masterpiece creation! It's much more than a mage player home. Detective pre-questline, amazing story, dozens of amazing features and ability to re-build it step by step using your mage skills.\n<br />[color=#ff7700]Pack of Elianora's mods that will go great with mage caracters:[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/71194]Tirashan - Necromancer Home[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/63552]Halamshiral - Mage Tower[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/52057]Hassildor - Player home for Vampires[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53975]Vellamo - Mage home in Winterhold[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/65528]Ravenholm - Vampire House[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53124]House for witches and druids - Mielikki[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/59925]Serenity - player house ship[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/51980]Thornrock - A no-frills player house[/url]\n<br />[color=#ff7700]Deal with it.[/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/59231]Raven Castle[/url]\n<br />A huge castle with surrounding territory and some unique functions. Great for necromancer, warlock or any other kind of dark character.\n<br />[url=http://www.nexusmods.com/skyrim/mods/24234]Airship - Dev Aveza[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/13641]The Asteria[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/17863]Reapers The Dark Tower[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/37450]Aemer's Refuge\n<br />[/url]Huge player castle on top of the montain. But, while being huge, it's absolutely amazingly designed! Every little piece of cullter is exactly where it should be. Home itself has many unique features - like teleporting into all vanilla player homes, auto-sorting scrips, entrances to many key locations of the game and much, much more!\n<br />[url=http://www.nexusmods.com/skyrim/mods/59558]Tel Nalta II - Telvanni Home[/url]\n<br />Huge GROWABLE player house on your own island, with different cells and features. Build your own telvanni mage tower and enjoy the beautiful view on Skyrim from it.\n<br />\n<br />\n<br />\n<br />[center][img]https://pp.userapi.com/c626119/v626119395/5cc9a/bm1hkb-XbV8.jpg[/img][/center][center][/center][color=#ff7700][size=4][center]Before you start mod your mage gameplay:[/center]\n<br />[/size]\n<br />[size=3]I kindly advise you to read about this mod and install it:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/1175]Skyrim -Community- Uncapper[/url]\n<br />This mod allows you to tweak almost everything related with leveling. At basic level of usage, you can use it to slow down your leveling speed. Why, you may ask? The reason is when you have a lot of peks/spells mod, vanilla game leveling system is so fast, that you'll became high-level character too fast. It may happen that you'll be just overhelmed with perks, hundreds of spell, and you simply won't know what to do with them. With slow leveling (which you can configure how you like in .ini file), you'll receive all these things gradually and will have much more pleasure from the game.\n<br />\n<br />[color=#ff7700][size=3]Install [url=http://www.nexusmods.com/skyrim/mods/18436]ASIS[/url] and its [url=http://www.nexusmods.com/skyrim/mods/53047]improved .ini files[/url]. Then read carefully :)\n<br />[/size][/color]ASIS is a great mod, that is usualy used to make more spawns. But it's another great (if not the greatest) feature is that it allows you to give new perks and spells from mods to NPC. Why do you need this? Well, if you will have some perk mod let's say and 300 new powerful spells, without ASIS, all or most of these spells won't be distributed to NPC, so only you can use them. With this, you'll became a T-1000 Terminator and game became really boring pretty fast. With NPCs having new spells and perks game will be much more interesting, fun and challenging. After ASIS installation run its executable file (/data/SkyProc Patchers/ASIS/ASIS.jar), choose option [url=https://pp.userapi.com/c626119/v626119395/5cdf9/r7I_Y-7Uon8.jpg]as on this screenshot[/url] and click patch. Wait until it finish - profit!\n<br />\n<br />[color=#ff7700][size=3]Improve magic killmoves and give yourself full control on them:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/56980]VioLens - A Killmove Mod[/url]\n<br />\n<br />[color=#ff7700][size=3]Improve your sound:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/43773]Audio Overhaul for Skyrim 2[/url]\n<br />Must-have amazing mod for all Skyrim sounds! Spells sounds are also greatly improved - unique sounds for different spells, sounds are more clear, you can hear magic projectiles flying by your face no matter the distance it had to travel. And many other improvements. After you install this one, you'll never go back to vanilla sounds.\n<br />[url=http://www.nexusmods.com/skyrim/mods/54387]Immersive Sounds - Compendium\n<br />\n<br />[/url][color=#ff7700][size=3]Also, I suggest you to install these 2 mods - for better races and standing stones abilities.\n<br />[/size][/color]They both are pretty simple, light-weight and greatly improve gameplay and giving deeper roleplay feeling.\n<br />[url=http://www.nexusmods.com/skyrim/mods/61218]Imperious - Races of Skyrim[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/29311]Aurora - Standing Stones of Skyrim[/url]\n<br />\n<br />[color=#ff7700][size=3]And a few mods that will make you life easier when you have too much spells:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/43123]Smart Cast[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/59171]AH Hotkeys - Skyrim Hotkey Manager[/url]\n<br />\n<br />[color=#ff7700][size=3]And finally, check out some spellcasting animation mods and choose what you like the most:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/33914]YY Anim Replacer - Mystic Knight[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/71040]Magiska - Spell Casting Animations[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/58418]Magic Casting Animations Overhaul[/url]\n<br />\n<br />[color=#ff7700][size=3][center]Nice! Let's continue.[/center][/size][/color][color=#ff7700][size=4]\n<br />Perk/Spell Mods:[/size]\n<br />[size=2][url=http://www.nexusmods.com/skyrim/mods/68425]Ordinator - Perks of Skyrim[/url]\n<br />[/size][/color]Light-weight, roleplay-friendly and absolutely amazing! My personal favourite. It gives reall wide amount of new perks as well as reworked/improved vanilla perks. Mage trees are brilliant. You can be a real necromancer - summoning hordes or skeletons, taking your enemies by numbers, or elemental summoner - with tough elementals, improved by passive and active abilities. Like Illusion? Became a dream stealer, feeding by your victims dreams. And much, much more. The one more advantage of Ordinator is that it's compatible with almost everything just by default, and easily can be made compatible with the rest.  when you have a really heavy mod list, compatibility becames really important, that's why I recommend exactly Ordinator from this point. Also check some patches/helper mods for it:\n<br />[url=http://www.nexusmods.com/skyrim/mods/68720]Custom Uncapper for Ordinator[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/74485]Elemental Destruction Magic - Ordinator Patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70272]CACO-Ordinatored[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/70159]SPERG-Ordinator-Combined[/url]\n<br />Option for people who like Ordinator, but SPERG too. Use at your own risk - it's not updating oftenly, so not up-to-date with current Ordinator version, moreover SPERG itself was not updated for last 3 years and you can't get help with SPERG perks if you will face them.\n<br />[url=http://www.nexusmods.com/skyrim/mods/69872]Ordinator Undeath Immersive Lichdom Compatibility patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/79834]Coolius Perkus -- PerMa Perks for Ordinator[/url]\n<br />Some Perkus Maximusperks for Ordinator.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/59849]T3nd0's Perkus Maximus[/url]\n<br />Perkus Maximus (or just PerMa) is absolutely astonishing work! It has absolutely great perks overhaul system, but it's not jsut a perk mod - it overhauls skills and gameplay mechanics to make game much more interesting, logical and roleplay-friendly. The only disadvantage of this mod is that it has troubles with compatibility with many other mods - sometimes it's own patcher can solve this, sometimes not. So if you're running heavy mod setup, some of PerMa features may never work for your other mods. Also take a look on this work for it:\n<br />[url=http://www.nexusmods.com/skyrim/mods/59854]PerMa Defluffing Perks[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/68587]Path of Sorcery - Magic Perk Overhaul[/url]\n<br />Fresh and great perk overhaul! It focused only on 6 mage perk trees, so other trees (Warrioir and Thief) remain untouched. It has it's own truly unique features and charm. Try it for sure before starting an actual gameplay - it may steal your heart forever! Also check this patches list for it:\n<br />[url=http://www.nexusmods.com/skyrim/mods/74518]Path of Sorcery - Assorted Patches[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/73850]Path of Sorcery - Elemental Destruction Magic Patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/77583]Path of Sorcery - Undeath Immersive Lichdom Perktree patch[/url]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/11139]Empowered Magic[/url]\n<br />Magic perk overhaul, that got an update a few weeks ago. It's pretty old and simple, so it can't compete with huge overhauls like Ordinator or Perma, but if you like simplicity and just an upgrade to vanilla perks - try it.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/76918]Anti-Magic - A take on shadow magic[/url] [color=#ff0000]==NEW==\n<br />[/color]Criminally underrated mod! A great addition for spellsword or just anyone who want to try an \"anti-mage\" character. It offers both new perks and spells. Some spells are overpowered a bit (in my opinion), but it's still just an awesome mod. Also it has Ordinator-compatible version.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/69474]Elemental Destruction Magic[/url]\n<br />Great and pretty unique mod. It gives you new elemental spells as well as new perks to improve them. It's simply and unique at the same time. The only problem is compatibility, but it have patches for ordinator and POS. And also one more little patch goes [url=http://www.nexusmods.com/skyrim/mods/81092]here[/url].\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/69306]Complete Alchemy and Cooking Overhaul[/url]\n<br />Despite Alchemy is mean to be Thief skill in vanilla game logic, why not use it for mage? And here's where CACO saves the day! It's an ultimate overhaul to all alchemy and cooking skills and mechanics. Revised recipes, tonns of new recipes, rebalanced potions, food and drinks, perks to support this and even crafting of alchemical bombs! The only thing, as usual, is compatibility issues, mostly related to perks, but there's a bunch of compatibility patches. Also check the list of patches and addons for it:\n<br />[url=http://www.nexusmods.com/skyrim/mods/76457]CACO Add-On - The Crafty Alchemist[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/78420]CACO Patch for More Plants and Recipes for Hearthfires[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/79716]Skyrim Underground CACO Patch[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/71222]Radiant CACOSTEP - Patches[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/72849]More Patches for CACO[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/79405]Auto Harvest 2 - Complete Alchemy and Cooking Overhaul Patch[/url]\n<br />\n<br />[color=#ff7700][size=4][b]New Spells Mods:[/b][/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/16225]Apocalypse - Magic of Skyrim[/url]\n<br />Absolute champion in spell mods. 155 news spells, mostly great balanced (just don't use the spells you think are OP and you're fine), lore-friendly and seamlessly integrated in the world. Must-have spells mod! Also check this [url=http://www.nexusmods.com/skyrim/mods/65527]addon[/url] for it, but it's not so good balanced and not updated. Also check this list of spells mods from the same author (and also with interesting questlines):\n<br />[url=http://www.nexusmods.com/skyrim/mods/56037]Dwemertech - Magic of the Dwarves[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/53780]Spectraverse - Magic of the Magna-Ge[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/60796]Lost Grimoire of Skyrim[/url]\n<br />Another absolutely brilliant spells mod. You can (and I kindly advise you to) use it together with Apocalypse for the perfect combo! It's also compatible with Oridnator.\n<br />[url=http://www.nexusmods.com/skyrim/mods/79686]Bound Armory Extravaganza - the MCM version[/url] [color=#ff0000]==NEW==[/color]\n<br />Amasing addon for any bound-weapon lovers! 32 new bound weapons, compatible with Ordinator.\n<br />[url=http://www.nexusmods.com/skyrim/mods/76729]Blue Fire Magic[/url] [color=#ff0000]==NEW==[/color]\n<br />Simpe as that - new beautiful spells, compatible with Ordinator too.\n<br />[color=#ff7700]Some discontinued, but still great spell mods![/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/35506]Midas Magic Evolved[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/35339]Forgotten Magic Redone[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/16481]Deadly Dragons Spells[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/48776]Konahriks Privilege[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/69574]Coldharbour Resummoned[/url]\n<br />Mod adds some conjuration spells, as well as some unique items dedicated to daedra.\n<br />[url=http://www.nexusmods.com/skyrim/mods/77509]Shadow Spell Package[/url]\n<br />Amazing and must-have dark spell package for any lover of dark magic!\n<br />[url=http://www.nexusmods.com/skyrim/mods/83790]Spell Choice[/url] [color=#ff0000]==NEW==[/color]\n<br />Amazing light-weight mod that finally let you CHOOSE starting spells - not always have Flames and Healing. Moreover, it works with 2 most popular new spells mods - Apocalypse and Lost Grimoire.\n<br />\n<br />[color=#ff7700][size=4]Ehcnantments mods:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/80918]Summermyst - Enchantments of Skyrim[/url]\n<br />I kindly advise to use this one. It's the most new and balanced, as well as oftenly updated.\n<br />[url=http://www.nexusmods.com/skyrim/mods/58635]Wintermyst - Enchantments of Skyrim[/url]\n<br />Predecessor of Sumemrmyst, discontinued, but still great. It's desing differs from Summermyst, so jsut choose one you like more, as they are not compatible.\n<br />[url=http://www.nexusmods.com/skyrim/mods/73094]Worlds Dawn - Enchanted loot and RPG attributes in Skyrim[/url]\n<br />Great mod from Deadly Dragons author, but it's not so good compatible with other mods, as Summer/Wintermyst mods.\n<br />\n<br />[color=#ff7700][size=4]Vampire Overhauls:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/80159]Sacrosanct - Vampires of Skyrim[/url]\n<br />Great vampire overhaul mod from Ordinator/Apocalypse author. Choose between this and Better Vampires. It's just a matter of taste :)\n<br />[url=http://www.nexusmods.com/skyrim/mods/9717]Better Vampires\n<br />[/url]Huge and solid overhaul. Veteran mod, which is still updated!\n<br />[url=http://www.nexusmods.com/skyrim/mods/78737]Better Vampire Weapons[/url]\n<br />Addon to Better Vampire that adds new locations and items, that should greatly help you as vampire character. But it also can be used standalone.\n<br />\n<br />[color=#ff7700][size=4]Another magic gameplay mods and overhauls:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/31485]Wrath of Nature - The Path of the Druid[/url] and [url=http://www.nexusmods.com/skyrim/mods/39928]Wrath of Nature - The Champion of Kynareth[/url]\n<br />Series from 2 awesome mods that adds new transormation spells, short questline, followers and even unique radiant quests!\n<br />[url=http://www.nexusmods.com/skyrim/mods/34583]Magic Duel - Reborn[/url]\n<br />Simple, but fun mod that allows you to engage a magic duel (pretty much Harry-Pottter-Final-Duel-style) with anyone.\n<br />[url=http://www.nexusmods.com/skyrim/mods/60783]Undeath Immersive Lichdom[/url]\n<br />Great perk and spells overhaul for necromancer mod \"[url=http://www.nexusmods.com/skyrim/mods/40607]Undeath[/url]\".\n<br />[url=http://www.nexusmods.com/skyrim/mods/33598]Spell Crafting for Skyrim[/url]\n<br />Amazing mod that brings Oblivion-like system for spellcrafting. Choose between 40 different magic effect to craft amazing spell that fit your mage playstyle! It's also compatible with Perkus Maximus and Orditnator.\n<br />[url=http://www.nexusmods.com/skyrim/mods/81214]Spell Research[/url]\n<br />New, fast growing up mod. Brilliant idea and great implementation. In this mod, spells are not simple mixtures of cantrips or effects, but each spell is a completely unique piece of art. Instead of just instantly sutying spell, you will research and learn base magic Archetypes, then compose magical Theses and combining them, you can try to create a spell. This mod finally making PROCESS of spell learning a real thing, that is truly interesting.\n<br />[url=http://www.nexusmods.com/skyrim/mods/49498]Skyrim Scroll Crafting[/url] [color=#ff0000]==NEW==[/color]\n<br />Awesome mod for scroll crafting - and it also does more - adding new unique perks to improve the results and new custom magic scrolls.\n<br />[url=http://www.nexusmods.com/skyrim/mods/78816]Basic Scroll Crafting[/url] [color=#ff0000]==NEW==[/color]\n<br />If you don't want to mess with possible perks compatibilities and just want simple system to craft vanilla spells scrolls - here it is :)\n<br />[url=http://www.nexusmods.com/skyrim/mods/80405]Better Spell Learning[/url]\n<br />Ever felt that instantly learning a spell and destroing a book after it looks not very immersive? Try this! Spellbooks are no more destroyed after reading and you need to spend some time to understand and learn new spell.\n<br />[url=http://www.nexusmods.com/skyrim/mods/63246]Awakened Magicka[/url]\n<br />Small gameplay mod that add realism to spellcasting. Spell power now scales off base Magicka (which is pretty logical), Fortify Spell School effects for Alchemy and Enchanting have been swapped and also spell costs are reduced further with Mastery perks, particularly when not wearing armor.\n<br />[url=http://www.nexusmods.com/skyrim/mods/36849]Immersive College of Winterhold[/url]\n<br />A great visual beautification project for Winterhold College. But it also does much more - improves college NPCs AI, adds wide amount of new features. And you can also make Tolfdir archmage ;)\n<br />[url=http://www.nexusmods.com/skyrim/mods/64067]Immersive Horses[/url]\n<br />Besides of being a great immersion mod, it finally gives you working MOUNTED CASTING!\n<br />[url=http://www.nexusmods.com/skyrim/mods/81600]Spellsword[/url]\n<br />Simple mod that allows you to cast spells via weapons swings. Looks and feels great!\n<br />[url=http://www.nexusmods.com/skyrim/mods/14947]Teleportation Spell with Menu and Mark and Recall with Menu[/url]\n<br />Light-weight mod, that works simple, without bugs and gives you 2 ways of lore-friendly fast travel, if you don't want to use map fast travel. Dozens of game key locations and simple \"Mark and Recall\" spells.\n<br />[url=http://www.nexusmods.com/skyrim/mods/53641]Jaxonz Blink Teleport[/url]\n<br />NOT immersive, but extremely fun - I must drop it here :3\n<br />[url=http://www.nexusmods.com/skyrim/mods/83946]Macromancy 4 - Size Changing Magic[/url]\n<br />Just a fun mod to simply change sizes :)\n<br />[url=http://www.nexusmods.com/skyrim/mods/16127]Arcane Fist - Unarmed Spell Combat[/url]\n<br />Mod for those who like \"monk\" type of characters, adding new spell to make you bare hands your best weapon with deadly magic effects. Disadvantage is it's abandoned and some spell are reported to be not so good balanced, but it's definitely original and if you like monk builds, give it a shot!\n<br />[url=http://www.nexusmods.com/skyrim/mods/77170]Mysticism - The Lost Art[/url]\n<br />This light-weight mod is partially restoring  Mysticism, magic school that was not present in Skyrim, by giving new spells, spreading them between different existing shcools of magic.\n<br />[url=http://www.nexusmods.com/skyrim/mods/81656]Jarek - The Custom Voiced Skeleton Necromancer Follower[/url]\n<br />Criminally underrated follower mod! Absolutely amazing for necromancer or any other mage playthrough. He's unique, he's custom voiced, he's strong. Try this one for sure!\n<br />\n<br />\n<br />\n<br />[color=#ff7700][size=4]QUEST/NEW LAND MODS:[/size][/color]\n<br />[url=http://www.nexusmods.com/skyrim/mods/32458]Konahriks Accoutrements - Dragon Priest Armory[/url]\n<br />Great quest mod that should be especially interesting for mages, as you will be able to learn more about dragon priests and obtain new unique dragon priest robe sets.\n<br />[url=http://www.nexusmods.com/skyrim/mods/40607]Undeath[/url]\n<br />Dark, atmospheric mod that will give you a chance to became a real necromancer and even more...\n<br />[url=http://www.nexusmods.com/skyrim/mods/68406]Summerset Isle[/url]\n<br />Huge and great quest mod. After becoming an Arch-Mage, travel to land of magic, Summerset Isle, to to have from 30 to 60 hours of gameplay and obtain new spells and artifacts.\n<br />[url=http://www.nexusmods.com/skyrim/mods/81041]Phenderix Magic World DLC[/url]\n<br />This mod is still in developement process, but even now it's already huge! DLC-sized, mage-oriented mod with more 400 new spells, dozens of new locations, new weapons and armors and of course new enemies and boss encounters.\n<br />[url=http://www.nexusmods.com/skyrim/mods/67559]Darkend[/url]\n<br />Want to have a good test of your powers? Just travel to this forgotten dark island...you will not be bored :) Big, DLC-sized new land inspired by Dark Souls, creepy, dark and atmospheric, with new enemies and bosses that could give a tough challenge even to the high-level character.\n<br />\n<br />[color=#ff7700][size=4]COMBAT AND OTHER USEFUL MODS (optional)\n<br />[/size][/color]What? Why do I even need combat mods? I'm a mage! Yes, that's true. But combat mods improves combat mechanics in overall, so for magic too. Some of them are completely optional mods for more interesting and challenging gameplay and some of them would be really useful for you in battle. A list of other misc mods will be also constantly expanded here.\n<br />[url=http://www.nexusmods.com/skyrim/mods/20923]TK Dodge[/url]\n<br />Adds ability to dodge in all directions for you. Successfully doding an attack gives you a small (can be configured in MCM menu) invulnerability time. This mod is pretty essential for mages, as with lack or armor you should be fast and agile as much as possible. Dodge stamina cost and dodge hotkeys can be also configured in MCM.\n<br />[url=http://www.nexusmods.com/skyrim/mods/76529]Wildcat - Combat of Skyrim[/url]\n<br />This mod improves combat in many aspects, making it more realistic and challenging, but one of the good aspects for you as mage here is that mod gives injuries system. Whe nenemy HP level drops to  some level, he could be staggered and suffer from different penalties. This could be very useful for distant attacks to keep enemies far from you.\n<br />[url=http://www.nexusmods.com/skyrim/mods/31264]OBIS - Organized Bandits In Skyrim[/url]\n<br />Just an awesome (and best) bandits overhaul mod that add dozens of new bandit types, bandit raids, improves bandits AI and so on. Makes game much more intereseting (especiall knowing bandits are like 50% of all enemies amount in the game).\n<br />[url=http://www.nexusmods.com/skyrim/mods/40491]Revenge Of the Enemies 2016 [/url]or [url=http://www.nexusmods.com/skyrim/mods/64690]Advanced Adversary Encounters - Ultimate Edition[/url] - two great (but not compatible, choose one) gameplay mods that are complete overhauls to almost all enemy types in Skyrim, making them more strong and challenging opponents. ROTE is more hardcore and covers bigger amount of enemies, AAE covers less amount of enemies, but it's more lore-friendly (each enemy type has realistic and logical resistances). Also check patches [url=http://www.nexusmods.com/skyrim/mods/73369]here[/url] and [url=http://www.nexusmods.com/skyrim/mods/76757]here[/url].\n<br />[url=http://www.nexusmods.com/skyrim/mods/10175]SkyTEST - Realistic Animals and Predators[/url]\n<br />Best wildlife overhaul for Skyrim. Makes animal behaviour more realistic (for example, wolves will be afraid of fire now), but also make them more tough as enemies. Check [url=http://www.nexusmods.com/skyrim/mods/46495]patches page[/url] too if will use it.\n<br />[url=http://www.nexusmods.com/skyrim/mods/66105]MorrowLoot Ultimate[/url]\n<br />Amazing mod, that, in my opinion, should be in the game from the start. How (even at high level) each second bandit can have daedric armor? How orc blacksmith can craft and elven sword to sell you? Morrowloot make a deep overhaul to loot system and much more, making game much more balanced, artifacts and rare weapons - really rare, so, making game much more rewarding in overall. But, it its complete list of features is too much for you - try simplified version [url=http://www.nexusmods.com/skyrim/mods/76753]here[/url].\n<br />[url=http://www.nexusmods.com/skyrim/mods/34981]No More Glowing Edges Mod[/url]\n<br />Simple mod that remove glowing edges from your body when you're casting or under some spell effect.\n<br />[url=http://www.nexusmods.com/skyrim/mods/75511]Better Harvesting[/url]\n<br />Up-to-date and just better alternative to \"Harvest Overhaul\". This mod gives you realistic amount of ingredients from plants and dead animals.\n<br />\n<br />\n<br />[color=#ff7700][size=4][center]Wow! That's all for now guys. Thank you for reading! And wish you a great and challenging adventures during your path. Path of becoming the greatest mage in Skyrim history![/center][/size][/color][center][img]https://pp.userapi.com/c626119/v626119395/5cef0/-gVcjE_29q4.jpg[/img][/center]",
  "categoryId": "82",
  "version": "1.0",
  "author": "Sinitar Gaming",
  "createdUnix": "1490476638",
  "updatedUnix": "1490476631",
  "containsAdultContent": false,
  "uploadedBy": "DonProtein",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000239984",
      "name": "Skyrim Ultimate Modding Guide - Mage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15",
      "fileName": "Skyrim Ultimate Modding Guide - Mage-82945-1-0.zip",
      "uploadedUnix": "1490476631",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fc096bd21735e69f11f921973455ce81dba9955c45c37a7e6ce90299496fb8ff/analysis/1490476802/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Ultimate%20Modding%20Guide%20-%20Mage-82945-1-0.zip?fid=1000239984&ttl=1535871755&ri=8192&rs=8192&setec=f72e786e423f13a3efa3f9bcbc1766b6"
    }
  ]
}