{
  "modId": 8294.0,
  "modName": "Tarelduran - Male Wood Elf Druid",
  "summary": "RP Wood Elf Druid Tarelduran, saved at Riverwood after siding with Ralof.",
  "descriptionHtml": "You are Tarelduran, a Wood Elf Druid, a mage devoted to the task of protecting all wildlife in Tamriel.\r\n\r\nLate one evening you are out collecting herbs in the wilds south of Helgen. You have been at your task for a few hours, and the night is beginning to grow cold and dark. As you stand and look around, you see the warm light of a campfire through the dense foliage. Realising that it is getting too dark to set up your own, you stumble slowly towards it. You are blind in your right eye, the result of a tame spell gone wrong when studying the sabre cat in its natural environment. As you draw closer to the camp, you hear voices; The loud, rough talk and hearty laughter of soldiers. You recognise the uniform: Stormcloaks. You shrug and walk slowly and carefully into the camp. \r\n\r\nAs you enter the camp, the noise dies down, and the soldiers look at you curiously. One man stands and with drunken deliberation he shouts \\\"Ey! He\\'s an elf innee?! Wha\\' are yer doin\\' in our camp? Spyin\\' fer the Thalmor I bet!\\\". You hold your hands up in a vague surrender, and calmly assure them that you mean no harm, and simply want to share the fire and perhaps some food.\r\nThe soldiers eventually begin to trust you a little, and allow you to sit by their fire in peace.\r\n\r\nSuddenly, out of the trees burst a group of Imperial soldiers! You stand up in bewilderment, your eyes wide, as their captain shouts \\\"Stormcloak filth! By the eight you will all be dead by first light tomorrow!\\\" \r\n\\\"I knew you was a traitor!\\\" shouts the soldier from earlier. You shake your head and try to speak, but at that moment a blunt object hits you on the back of the head.\r\n\r\nYou wake up in a cart, opposite a Stormcloak soldier you vaguely recognise, and a horse thief you don\\'t. Next to you is Ulfric Stormcloak, Jarl of Windhelm, and at this point you realise what has happened: You have been captured by Imperials, and are on your way to be executed.\r\n\r\nThe rest, as they say, is history.\r\n\r\n-------------------------------------------------------------------\r\nYou start off in Riverwood, after the dragon attack at Helgen. The character has sided with Ralof in the escape from Helgen, but other than that no choices have been made.\r\n\r\nNo mods used, but I do have the official high res texture DLC.\r\n\r\n-------------------------------------------------------------------\r\nInstallation.\r\n\r\n1. Unzip the file and place in your \\\\Documents\\\\My Games\\\\Skyrim\\\\Saves.\r\n2. Start Skyrim and load the save.\r\n3. Play the game!\r\n\r\n-------------------------------------------------------------------\r\nUninstallation.\r\n\r\nJust delete any file associated with this character in the above location.\r\n\r\n\r\n",
  "categoryId": "43",
  "version": "1.0",
  "author": "JamDrum",
  "createdUnix": "1328727944",
  "updatedUnix": "1328728086",
  "containsAdultContent": false,
  "uploadedBy": "JamDrum",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27240",
      "name": "Tarelduran - Wood Elf Druid",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1179",
      "fileName": "Tarelduran - Wood Elf Druid-8294-1-0.rar",
      "uploadedUnix": "1328728086",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/27494b59bef0913d2bfb9853af4d5dae19c15ec2d3717db1d54a242cef4de2ea/analysis/1406661620/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tarelduran%20-%20Wood%20Elf%20Druid-8294-1-0.rar?fid=27240&ttl=1535766877&ri=8192&rs=8192&setec=bd3c526c8dd080b9a45162889b7562f9"
    }
  ]
}