{
  "modId": 82988.0,
  "modName": "Ansgvild&#39;s Riverwood House",
  "summary": "Small house to get you started",
  "descriptionHtml": "[left][b]Hi guys&#33;[/b]\r<br />\r<br />This is my first mod uploaded to Nexus.\r<br />I used to create mods for me in times when i wasn&#39;t\r<br />able to find mod that i needed here on Nexus.\r<br />[b]Ansgvild&#39;s Riverwood House[/b] is one of those mods.\r<br />\r<br />Primary intention of this mod was to add lore-friendly house to Riverwood\r<br />for player to use in early game until he/she are capable to afford bigger and better\r<br />lots that you can find in Skyrim. Idea behind this mod was to blend in with Riverwood\r<br />like it was there in the original game.\r<br />\r<br />\r<br />[img]https://s6.postimg.org/68lc6jr6p/Screen_Shot23.jpg[/img]\r<br />\r<br />\r<br />Since i wanted to tie this mod to the game best I could, I made new NPC named Ansgvild (Nord Female) who is in Bleak Falls Barrow in the time of players first arrival to Riverwood. &#34;Ansgvild&#39;s Note&#34; can be found near hers house entrance that will inform player of her absence. As Bleak Falls Barrow is first dungeon of Skyrim&#39;s main quest i figured that this location would be best for her. Once you&#39;re inside BFB, after some time wandering around you will find Ansgvild&#39;s body that contains Key to her house (second Draugr encounter, swinging axe trap). That&#39;s all. Once you have the key, house is your&#39;s and you can use it.\r<br />\r<br />House is made as player&#39;s house, so even tho it&#39;s named after Angsvild, you&#39;re the owner, once you have the key, that is. \r<br />\r<br />House is minimalistic, it is shaped like other houses in Riverwood, but with the addition of Enchanters, and Alchemy tables in basement. Player can also find Dagger enchanted with Soul Trap, and few Common and Petty soul gems, just to get you started.\r<br />\r<br />Hope you will enjoy this mod, as much as i did.\r<br />\r<br />I haven&#39;t tested this mod with other overhaul mods of Riverwood, but if theres nothing placed on this location, then it should be good.\r<br />\r<br />If you find bugs, report them, and i will try to fix them. Mod is cleaned with TES5edit. Cheers&#33;[/left]",
  "categoryId": "67",
  "version": "v1.0",
  "author": "Nixazzar",
  "createdUnix": "1490663498",
  "updatedUnix": "1490662595",
  "containsAdultContent": false,
  "uploadedBy": "Nixazzar2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000240158",
      "name": "Ansgvild&#39;s Riverwood House",
      "version": "v1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "129",
      "fileName": "Ansgvild's Riverwood House-82988-v1-0.7z",
      "uploadedUnix": "1490662595",
      "modVersion": "v1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7e8b0c0fec414b01e61817c2f3678f931a7a181e64d6e5517e329b47297e3652/analysis/1490662683/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ansgvild%27s%20Riverwood%20House-82988-v1-0.7z?fid=1000240158&ttl=1535871803&ri=8192&rs=8192&setec=433a05ef07a4c39cd35258400a637091"
    }
  ]
}