{
  "modId": 82991.0,
  "modName": "Legion (Skyrim)",
  "summary": "Leave Skyrim behind and travel to Legion. Play as a cowboy / cowgirl if you choose in this dusty ole western town with a violent history.",
  "descriptionHtml": "[center][img]https://staticdelivery.nexusmods.com/mods/110/images/82991-0-1490674024.jpg[/img]\r<br />[b][color=#a61c00][size=3]\r<br />[/size][/color][/b][font=Times New Roman][color=#a61c00][size=4]&#34;And Jesus asked him, What is thy name? And he answered, saying, My name is Legion: for we are many.&#34; - Mark 5:9[/size]\r<br />\r<br />[size=6][b][u]DESCRIPTION[/u][/b][/size]\r<br />[size=4][b]Ever want to leave Skyrim behind and travel to the ole wild west? Throw on your cowboy hat, grab a bottle of whiskey and some jerky, and discover Legion, a true, fully open-world, western town with a violent history. An outlaw, by the name of &#34;Junk&#34; was said to have robbed the town bank in Junction. He ain&#39;t been heard from since. Find out what happened to him, and what has become of the dusty, ole town of Legion. [/b][/size][/color][color=#a61c00][size=4][b]There ain&#39;t no naked chicks, fluffy bunny rabbits, or vendors that are so happy you&#39;re there. I&#39;m not gonna give spoilers here. Download it, play it, and keep yer britches on&#33;\r<br />You will receive a Wanted Poster upon first installing this mod. Read it and keep it.\r<br />Collectible cards now being added. I will add them as I create them. In the end, there will most likely be a quest to find &#39;em all.\r<br />I&#39;m not looking for &#34;critiques&#34;. Never asked for any. You don&#39;t like it, move on.\r<br />Otherwise, enjoy.\r<br />[/b][/size][/color][color=#a61c00]\r<br />[size=6][u][b]NOTES[/b][/u][/size]\r<br />[size=4][b]*Please do not post spoilers in the comments section. Thank you.*[/b]\r<br />[b]\r<br />*Read the ReadMe file in the Data/Music/LegionMusic folder.[/b]\r<br />[b]I have included a song file &#34;LegionSongSaloon.wav&#34; for you under Miscellaneous. I did this so I don&#39;t have to upload that song every time I do an update. You can download it manually or with Manager. Doesn&#39;t matter. The file path is already set up and it will be placed in the proper location for you. IF YOU DO NOT DOWNLOAD THAT FILE, THE FIRST SONG ON THE JUKEBOX WILL BE SILENT. However, it will not break anything.*\r<br />[/b]\r<br />[b]*The last 4 guns in my images, AR-15, AK-47, M-4 Carbine, and Rocket Launcher, are not in this MOD yet. They are built, tested, and done - WITHOUT Dawnguard being needed. They are not lore friendly so I may place them as a stand-alone MOD. Haven&#39;t decided yet.*[/b]\r<br />[/size][/color][/font][font=Times New Roman]\r<br />[color=#a61c00][size=6][u][b]REQUI[/b][/u][/size][/color][color=#a61c00][size=6][u][b]REMENTS[/b][/u][/size]\r<br />[size=4][b]Skyrim.\r<br />[/b][/size][/color][b][color=#a61c00][size=4]Dawnguard, Dragonborn, and Hearthfire are NOT needed and never will be.\r<br />The only other requirement besides Skyrim is to not be a complete idiot. I create MODs for the simple enjoyment of it all. Then, I SHARE them with all of you. You are getting something for FREE. Simply download it, play it, enjoy it for what it is. If you don&#39;t like it, think it sucks, someone crapped in your cereal, whatever, that&#39;s fine. Move on. The majority of you seem mature enough to do just that. However, the few of you that just cannot grasp that concept, you will ruin it for all the rest. (Maybe that&#39;s your plan all along.) This MOD has the potential of a [u]HUGE[/u] future expansion (thanks to the idea of Ray2NJ), but if it&#39;s not received well, and I have to waste my time answering ignorant comments and questions, then I can guarantee there will be no expansion. It&#39;s also only one click on my PC to pull a MOD. So grow up, and enjoy gaming for what it was intended for....... FUN&#33;\r<br />[/size][/color][/b][color=#a61c00]\r<br />[size=6][b][u]RECOMMENDATIONS[/u][/b][/size]\r<br />[/color][color=#a61c00][size=4][b]I run with my brightness at 10/20 (halfway) and uGridsToLoad=7 in my Skyrim.ini settings.\r<br />[/b][/size][/color][color=#a61c00]\r<br />[size=6][b][u]COMPATIBILITY\r<br />[/u][/b][/size][size=4][b]I didn&#39;t touch any Bethesda files. Everything is custom built and uniquely named, including 2 new races. Shouldn&#39;t conflict with anything.\r<br />[/b][/size]\r<br />[size=6][b][u]THANKS & CREDITS[/u][/b]\r<br />[/size][/color][color=#a61c00][size=4][b]Bethesda for the great game and Creation Kit.\r<br />NifSkope\r<br />Gimp\r<br />TesVSnip\r<br />Tes5Edit\r<br />[/b][/size][/color][/font][url=http://www.wave-editor.com/][size=4][b]Wave Editor[/b][/size][/url][font=Times New Roman][color=#a61c00][size=4][b]\r<br />My wife. Not only for putting up with me, but for actually giving me some good ideas for this mod.\r<br />Ray2NJ for being such a great &#34;Master-Beta Tester&#34; ... as well as a great friend.\r<br />MOEAW....... for just being you man&#33;\r<br />A sincere thank you to those who took a moment to come back and endorse.\r<br />[/b][/size][/color][color=#a61c00][size=4][b][url=http://www.nexusmods.com/skyrim/mods/20094/?]decrepithawk[/url] for the western attire. Fixed your cowboy hat and &#34;armor_1&#34; for ya (:\r<br />I created the rest of the cowboy hats.\r<br />And of course, Nexus for making a place where we can share our creations.[/b][/size]\r<br />\r<br />[size=5][b]Check out my other mods[/b][/size]\r<br />[size=6][url=http://www.nexusmods.com/skyrim/mods/73819/?][b][u]Middle Earth - Path of the Hobbit[/u][/b]\r<br />[/url][/size][/color][/font][b][u][size=6][url=http://www.nexusmods.com/skyrim/mods/83201/?][/url][url=http://www.nexusmods.com/skyrim/mods/83201/?][/url][url=http://www.nexusmods.com/skyrim/mods/83201/?]S.B.D[/url][url=http://www.nexusmods.com/skyrim/mods/83201/?] (Skyrim Body Deleter)[/url][url=http://www.nexusmods.com/skyrim/mods/83201/?][/url][/size][/u][/b][font=Times New Roman][color=#a61c00][size=6][url=http://www.nexusmods.com/skyrim/mods/73819/?]\r<br />\r<br />\r<br />\r<br />\r<br />[/url][/size][/color][/font][/center]",
  "categoryId": "30",
  "version": "1.11",
  "author": "Junk3737",
  "createdUnix": "1490723282",
  "updatedUnix": "1490723282",
  "containsAdultContent": false,
  "uploadedBy": "junk3737",
  "primaryFile": null,
  "files": []
}