{
  "modId": 83007.0,
  "modName": "Naruto Ultimate Overhaul(Russian)",
  "summary": "Данный мод добавляет Способности и Магию (31 вид различных, новых способностей и видов магии) , Одежду, Оружие, Глаза (105 новых видов глаз) из Аниме Наруто Шиппуден...\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&g",
  "descriptionHtml": "&lt;br /&gt;Наруто Дзюцу (Магия и Способности):\r<br />&lt;br /&gt;Аматерасу - Ниндзюцу (Крик) Работает как крик, поджигает вещи и существ, в поле \r<br />&lt;br /&gt;зрения, черным пламенем которое будет гореть пока цель не умрёт, либо \r<br />&lt;br /&gt;пока вы не подойдете к вещи достаточно близко.\r<br />&lt;br /&gt;1 часть - поджигает цель в поле зрения, 2 часть - более мощная 1 часть, 3 часть - АоЕ взрыв который поджигает все вокруг вас.\r<br />&lt;br /&gt;Тсукуёми - Гендзюцу (Способность) Парализует НПС, отправляя цель в мир гендзюцу...\r<br />&lt;br /&gt;Бьякуган - Додзюцу (Способность глаз) позволяющие видеть живых существ (даже через стены). Включается и отключается по желанию.\r<br />&lt;br /&gt;Шаринган - Додзюцу (Способность глаз) позволяющие замедлять время. Включается и выключается по желанию.\r<br />&lt;br /&gt;Шинра Тенсэй - Ниндзюцу (Магия) Отталкивает все в указанном радиусе назад и наносит урон.\r<br />&lt;br /&gt;Шинра Тенсэй Ареал - Ниндзюцу (Магия) Тоже самое что и обычный Шинра Тенсэй, но действует на 360 градусов вокруг игрока.\r<br />&lt;br /&gt;Чидори Нагаши - Ниндзюцу (Магия) Наносит урон молнией вокруг игрока.\r<br />&lt;br /&gt;Чидори Эйсоу - Ниндзюцу (Магия) Наносит урон лучом молнии по конкретной цели.\r<br />&lt;br /&gt;Чидори - Ниндзюцу (Магия) Наносит урон молнией на ближней дистанции по цели.\r<br />&lt;br /&gt;Рассэнган - Ниндзюцу (Магия) Наносит урон на ближней дистанции и отталкивает цель.\r<br />&lt;br /&gt;Кирин - Ниндзюцу (Магия) Наносит не целевой, большой урон молнией с небес (действует на открытой местности).\r<br />&lt;br /&gt;8 Врат - Киндзюцу (Спсобности) 8 врат начиная от 1 заканчивая 8. Каждые \r<br />&lt;br /&gt;врата усиливают игрока и дают ему все больше бонусов, но все быстрее и \r<br />&lt;br /&gt;больше отнимают здоровье каждую секунду.\r<br />&lt;br /&gt;Режим Отшельника - Сендзюцу (Магия) Увеличивает силу и характеристики игрока, но требует \r<br />&lt;br /&gt;предварительной подзарядки (удерживание кнопки мыши до соответствующего \r<br />&lt;br /&gt;звука).\r<br />&lt;br /&gt;Режим Къюби - Бидзюцу (Способность) Увеличивает скорость, сопротивление урону, регенерацию, характеристики, но постоянно \r<br />&lt;br /&gt;потребляет магию.\r<br />&lt;br /&gt;Драконье Пламя - Ниндзюцу (Магия) Наносит постоянный урон огнём по цели.\r<br />&lt;br /&gt;Огненный Шар - Ниндзюцу (Магия) Создает большой Огненный Шар и запускает его.\r<br />&lt;br /&gt;Цветок Феникса - Ниндзюцу (Магия) Постоянно запускает маленькие огненные шары.\r<br />&lt;br /&gt;Телепортация - Джикукан-Ниндзюцу (Магия) Телепортирует вас на короткое расстояние, \r<br />&lt;br /&gt;если направленно на цель то телепортирует позади нее.\r<br />&lt;br /&gt;Баншо Тэнин - Ниндзюцу (Магия) Универсальная тяга которая притягивает к себе живые цели, а после чего отбрасывает вокруг.\r<br />&lt;br /&gt;Медицинское Ниндзюцу - Ниндзюцу (Магия) Восстанавливает собственное здоровье.\r<br />&lt;br /&gt;Рассэнсюрикен - Ниндзюцу (Магия) Тоже что и Рассэнган, но запускается на дальние \r<br />&lt;br /&gt;дистанции, при столкновении отбрасывает всё вокруг, наносит большой \r<br />&lt;br /&gt;урон.\r<br />&lt;br /&gt;Скрытый Туман - Ниндзюцу (Магия) Создает туман в котором вы становитесь невидимыми пока не атакуете цель.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Оружие:\r<br />&lt;br /&gt;Кусанаги - катана, одноручный и двуручный вариант.\r<br />&lt;br /&gt;Кунай - на подобии кинжала\r<br />&lt;br /&gt;Кулак чакры - когда экипировано наносит увеличенный урон кулаками и отталкивает цели.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Одежда:\r<br />&lt;br /&gt;Различные протекторы (банданы) разных деревень, варианты отступнических бандан.\r<br />&lt;br /&gt;Одеяние Эдо Тенсэя\r<br />&lt;br /&gt;Кольца Акацуки\r<br />&lt;br /&gt;Маски Анбу\r<br />&lt;br /&gt;Маски Анбу с капюшоном\r<br />&lt;br /&gt;Маски Тоби\r<br />&lt;br /&gt;Маска Тоби с капюшоном\r<br />&lt;br /&gt;И многое другое.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Глаза:\r<br />&lt;br /&gt;Различные комбинации Шаринганов, Бьякугана, Мангекьё Шарингана, Риннэгана, Глаз \r<br />&lt;br /&gt;Эдо Тенсэй и многое другое. Доступно в Меню Расы в разделе цвета глаз.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Другое:\r<br />&lt;br /&gt;Мод добавляет Убежище Мастеров Дзюцу которое расположено возле Ривервуда, \r<br />&lt;br /&gt;оно скрыто за маленьким водопадом. Именно там вы сможете найти тех, у \r<br />&lt;br /&gt;кого можно купить все вышеупомянутое.\r<br />&lt;br /&gt;Мод добавляет Остров Наруто на который можно попасть если сесть на специальную лодку возле Рифтена \r<br />&lt;br /&gt;(Остров все равно пуст, так что смысла в этом особого нет)..\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[b]Требования:[/b]\r<br />&lt;br /&gt;Скайрим 1.8 или более новая версия.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[b]Установка:[/b]\r<br />&lt;br /&gt;Скопировать содержимое в папку Skyrim/Data и подключить esp файлы.              ",
  "categoryId": "75",
  "version": "2.2c",
  "author": "NotIAm",
  "createdUnix": "1490734775",
  "updatedUnix": "1490734775",
  "containsAdultContent": false,
  "uploadedBy": "andron10001",
  "primaryFile": null,
  "files": []
}