{
  "modId": 83016.0,
  "modName": "Wear Circlet&#39;s more often - Testmod",
  "summary": "This mod should allow you to wear circlets together with masks, hoods and helmets. This just enables you to wear them and not how they look. Also added Salmon Roe to Addvar and the chance of Human Flesh and Human Heart to Hogni Red-Arm.",
  "descriptionHtml": "Background\r<br />\r<br />Unfortunaly my computer hasn&#39;t enough power to actually play Skyrim. Voice and image aren&#39;t synchron and already the \r<br />first 15 minutes need at least 20 in reality. I normally play on PS4 and I \r<br />just got the Legendary Edition to start modding, but now I can&#39;t test\r<br /> my own mods myself. :(\r<br />So I hope for some brave tester and their feedback.\r<br />\r<br />What is this mod about?\r<br />\r<br />This mod should allow you to wear circlets together with masks, hoods and helmets. This just enables you to wear them and not how they look. Also added Salmon Roe to Addvar (Solitude) and the chance of Human Flesh and Human Heart to Hogni Red-Arm (Markarth). I know this things don&#39;t really have much to do with circlets, but I wanted to test this new goods sold by them yet I thougth that those changes alone would have been to little to create an extra mod for them.\r<br />Last but not least please tell me if the language isn&#39;t in english. I&#39;m trying to understand if the creation kit replaced just changes or objects. In the first case everything should be in the language you purchased skyrim and in the other case you will get the german names of the things.\r<br />\r<br />If you have any issues or problems please leave a post and I will try my best to fix it. Now I wish you fun trying out this mod.",
  "categoryId": "60",
  "version": "1.0",
  "author": "Diilsoszaam",
  "createdUnix": "1490807286",
  "updatedUnix": "1490807279",
  "containsAdultContent": false,
  "uploadedBy": "Diilsoszaam",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000240264",
      "name": "WearCirclets-Testmod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "13",
      "fileName": "WearCirclets-Testmod-83016-1-0.zip",
      "uploadedUnix": "1490807279",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d2f712adbf9e743c843ade3e6dba29be5e5889138a30402ee21dee58171c670e/analysis/1490807462/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WearCirclets-Testmod-83016-1-0.zip?fid=1000240264&ttl=1535871837&ri=8192&rs=8192&setec=17f287bc5853ae9c4d4e8ae995c5c038"
    }
  ]
}