{
  "modId": 83096.0,
  "modName": "Skyrim Improved",
  "summary": "Massive gameplay overhaul, installing higher difficulty, more realism and tons of unique features.",
  "descriptionHtml": "[center][img]http://static-3.nexusmods.com/15/images/110/4205982-1419333368.png[/img][/center][center][img]http://static-4.nexusmods.com/15/images/110/4205982-1419194010.png[/img][/center][b]\r<br />Skyrim Improved, formerly known as the artist formerly knowen as Survivalist Ingenuity is back&#33; This is my epic gameplay overhaul. It has a strong inclination for survival aspects and will certainly change how you play the game forever. All features are deeply interweaved with the renovated perk trees and it does a pretty good job in coexisting with other major Mods like Frostfall, Real Needs and Diseases and Elys Uncapper. It&#39;s also perfectly suited for my [url=http://www.nexusmods.com/skyrim/mods/manage/?]other Mods[/url]. This new version is much more preserved, convenient and bug free. A lot of fixes and efforts have gone into the overhaul the last copple of weeks, additionally to the content I&#39;ve created since 21.04.2012, and it&#39;s now perfectly suited for the unofficial patches as well. I promise no overhaul will bring you more close to the experience within Morrowind then this Mod. It doesn&#39;t focus on combat, optics and action orientated third person gameplay, but instead on tons of new gameplay elements and things that will simply let you enjoy the world of Skyrim for what it is, an immersive garden of relaxation.[/b]\r<br />\r<br />[center][img]http://static-2.nexusmods.com/15/images/110/4205982-1419365680.png[/img][/center]- completely rearranged and renamed skill perk trees with 229 new perks, spliting every perk tree into primary and secondary branches\r<br />- all perk trees suit a certain style of character class and emphasize right perk choices much more then in vanilla Skyrim\r<br />- more then 50 new perks introducing new gameplay mechanics, like throat slitting, sprint jump and universal follower recruiting\r<br />- a MCM menu with tons of configuration options to perfectly style the game you ever wanted, hardcore survival or actionist? You choose&#33;\r<br />- configure base attributes and skills from a limited pool of points like in older RPG&#39;s like Morrowind, AD&D Series and Dark Souls\r<br />- completely configurable regeneration rates for health, stamina and magicka...try playing with no auto health regen? Milkdrinker or Dragonborn?\r<br />- extended skilling framework: introducing a miriad of diverse functions to raise your skills under certain occasions\r<br />- athletics&acrobatics system like in Morrowind, with progressive speed, jump height and fall depth strongly interlaced with corresponding perks\r<br />- a &#39;real&#39; encumbrance and fatigue system, with progressional impact on your speed, combat behaviour and general difficulty\r<br />- freely adjustable settings, like timescale, stealth, lockpick and economical difficulty\r<br />- tons of enviromental and immersive features to improve your experience in Skyrim, some of them to be found in no other Mod\r<br />- 40+ new hotkeys to make the game more convenient and less of a micromanaging burden\r<br />- complete overhaul of the archery system, with diversified arrow stats and a miriad of adjustable game settings\r<br />- a hardcore restricted loot system second to no other on the Nexus combined with very high prices\r<br />- tons of newly introduced social interaction options with all actors and creatures in Skyrim\r<br />- extended magic with new spells, potions and scrolls and lifted enchanting restrictions\r<br />- no intereference with other combat, skill uncap, needs and magical Mods, to improve compatibility and give room for coexistence\r<br />- a set of patches for some of the most popular Mods on the Nexus, as well as .ini files to configure uncapper and favorits Mod\r<br />- completely absorbed minor Mods from my earlier efforts, like placing light sources, map markers and the infamous &#39;Taunting Mod&#39;\r<br />\r<br />[center][img]http://static-1.nexusmods.com/15/images/110/4205982-1419194764.png[/img][/center][color=#ffff00][size=5][center][b]1. Skyrim (1.9.32.8)\r<br />2. All DLC&#39;s\r<br />3. [url=http://skse.silverlock.org/]SKSE[/url]\r<br />4. [url=http://skyrim.nexusmods.com/mods/3863]SkyUI\r<br />[color=#ffff00]5.[/color] [/url][url=http://www.nexusmods.com/skyrim/mods/71214/?]USLEEP[/url][/b][/center][/size][/color]\r<br />[center][img]http://static-3.nexusmods.com/15/images/110/4205982-1419195370.png[/img][/center][b]Skyrim Improved waived complicated install procedures and instructions. Instead I recommend using the [url=http://www.nexusmods.com/skyrim/mods/modmanager/?]Nexus Mod Manager[/url] or [url=http://www.nexusmods.com/skyrim/mods/1334/?]Mod Organizer[/url] to install the files. After installation I recommend using [url=https://loot.github.io/]L.O.O.T[/url] to automatically get the correct load order, as well as [url=http://www.nexusmods.com/skyrim/mods/1840/?]Wrye Bash[/url] for any manual sorting and the creation of a bashed patch. Bashed patches are essential in order to minimze conflicts and unifie loot lists. If you don&#39;t trust in automatic load order tools, try to arrange your load order [url=http://static-4.nexusmods.com/15/images/110/4205982-1419197887.jpg]similar to this[/url] in order to make SI work correctly. Make sure to create a [color=#ffff00]SKSE.ini[/color] in the [color=#ffff00]Skyrim/Data/SKSE[/color] folder and import the settings below into the .ini for a major memory improvement. See [url=https://www.youtube.com/watch?v=37xAMUQc1oY]this video[/url] for a in detail description.\r<br />\r<br />[b][color=#ffff00][Memory]\r<br />DefaultHeapInitialAllocMB=768\r<br />ScrapHeapSizeMB=256[/color][/b]\r<br />\r<br />You might think the scripts are the bottleneck part in the Skyrim engine, but they are in fact not. Texture Mods will effectively lower your framerate and thus your script latency, which leads to inconvenient bugs and errors. Theoratically you can overload your game with as much script heavy Mods as you want, depending on your system, as long as you don&#39;t enforce to much texture Mods and non default papyrus settings. Me for example, I&#39;m running on a i5 @4x3.06 Ghz, 8 gig&#39;s of RAM and a Nvidia 670. I&#39;m running the official texture pack only, and I&#39;m getting 60 fps stable, using the Mods reviewable in the Mod recommendation section. And my game is literally crash and bug free.\r<br />\r<br />One more recommendation on enforcing new Mods on your savegames. In general it&#39;s a good idea to make up a Mod setup and not change it as long as you&#39;re seriously playing. Exchanging Mods mid-game will seriously lead to bugs and eventually completely mess up your games. And often users make the Mod developer responsible for this mess. So please don&#39;t do that. However, if you can&#39;t be helped using new Mods or versions on savegames, then I recommend the following procedure:[/b]\r<br />\r<br />[size=4]1.[/size] [color=#00ff00][size=3]Load your game and find a interior cell, save the game, optionally turning off the Mod you want removed[/size][/color]\r<br />[size=4]2.[/size] [color=#00ff00][size=3]Exit game, turn off the .esp and load the previously made save, save again[/size][/color]\r<br />[size=4]3.[/size] [color=#00ff00][size=3]Exit game, enable the new version, go into the game and save again[/size][/color]\r<br />[size=4]4.[/size] [color=#00ff00][size=3]Exit the game once more and then start playing with the clean save[/size][/color]\r<br />[size=4]5.[/size] [color=#00ff00][size=3]If you happen to have left over script artefacts in your savegames, I recommend using [url=http://www.nexusmods.com/skyrim/mods/52363/?]Script Cleaner[/url].[/size][/color]\r<br />\r<br />[center][img]http://static-4.nexusmods.com/15/images/110/4205982-1419199177.png[/img][/center][u][b][size=6][center][color=#00FF00]Skill & Perk Trees Overhaul[/color][/center][/size][/b][/u][b]The major element of Skyrim Improved is its skill and perk overhaul, and the changes to the skill perk trees coming with it. Skyrim Improved features 87 higher tier vanilla perks, and 142 custom build perks that are specifically tailored to the Mods gameplay enhancements. Every skill now has 2 associated perk branches that reflect a certain style of gameplay, respectively your character class. Skills, in addition to vanilla leveling structure, get additionally driven by various player behaviour, so for example the dynamics skill will now get fueled by one-handed combat, as well as player actions related to movement, like running, jumping and swimming. This is similar to how things worked in Morrowind. Please, additionally to the description have a look at the videos to see how the perk trees look in game. The perk overhaul was developed with the following six rules:\r<br />\r<br />1. [color=#FFFF00]Don&#39;t remove any of the vanilla perks inside the perk trees, but improve them. Addition+improvement &gt; removal&#33;[/color]\r<br />2. [color=#FFFF00]Make perks appear as expression and reflection of your characters style of gameplay.[/color]\r<br />3. [color=#FFFF00]Directly connect perk choice to the games difficulty. If you choose wisely, then the game will be more easy.[/color]\r<br />4. [color=#FFFF00]Modifie the perk tree with highest impact possible, without destroying the vanilla mechanics.[/color]\r<br />5. [color=#FFFF00]Add perks that add new gameplay mechanics and not only simple numerical improvement values.[/color]\r<br />6. [color=#FFFF00]Make vanilla perks appear in a broader context and thus not neglacting their initial notion.[/color][/b]\r<br />\r<br />[center][img]http://static-4.nexusmods.com/15/images/110/4205982-1419260646.png[/img][/center][center][size=5][color=#00FF00][b]Handwork Skill (formerly Smithing):[/b][/color][/size][/center]\r<br />Primary perk tree is about [b][color=#00FF00]Smithing[/color][/b]. It splits up all materials to its own perks and increases smithing difficulty, specially when starting a new game. You&#39;re not allowed to smelt ores without choosing appropriate perks. Light and heavy armor is split up into two seperate branches. All recipes at forges and tanning racks have their appropriate perks allocated. So at the start of the game all you can craft is some basic wooden items and nails.\r<br />\r<br />1. [color=#FFFF00]Basic Tanning[/color]: Able to tan leather at leather racks, craft more wooden items, create hide armor and improve it twice as much.\r<br />2. [color=#FFFF00]Advanced Tanning[/color]: Can create fur armor at forges, and improve it twice as much.\r<br />3. [color=#FFFF00]Superior Tanning[/color]: Can create leather and banded iron armor at forges, and improve it twice as much.\r<br />4. [color=#FFFF00]Basic Metallurgist[/color]: Can smelt iron, corundum, gold, silver and quicksilver ores to ingots and make steel ingots.\r<br />5. [color=#FFFF00]Advanced Metallurgist[/color]: Can smelt malachite, moonstone, orichalcum and ebony ore to ingots and make dwarven ingots.\r<br />6. [color=#FFFF00]Blacksmith[/color]: Can create iron, studded, stormcloak, falmer and draugr armor and weapons at forges, and improve it twice as much.\r<br />\r<br />The secondary tree handles [b][color=#00FF00]Unarmed Combat[/color][/b]. The tree is split up into unarmed combat during brawls, and martial art to allow roleplaying monks. There&#39;s a perk that allows you to sneak upon enemies and knock them over form behind if you stay unseen. In difference to &#39;ordinary&#39; paralyze, you will then be allowed to strip your targets inventory. Unarmed combat will increase the Handwork skill just as smithing did in vanilla Skyrim.\r<br />\r<br />1. [color=#FFFF00]Way of the Fist (5 ranks)[/color]: Unarmed attacks do +5 damage.\r<br />2. [color=#FFFF00]Powerfirst (3 ranks)[/color]: Unarmed powerattacks do double +5 damage.\r<br />3. [color=#FFFF00]Liver Chop[/color]: 25% chance to nullifie your targets stamina in unarmed combat and brawls.\r<br />4. [color=#FFFF00]Pine Hook[/color]: 25% chance to paralyze your target when power attacking with right hand and not sneaking. Not working during brawls.\r<br />5. [color=#FFFF00]Knockout[/color]: Knock your target unconscious when sneaking undetected and attacking with your right hand from behind.\r<br />6. [color=#FFFF00]Standing Fist[/color]: Reduce incoming damage by 50% during brawls.\r<br />7. [color=#FFFF00]Tenacious B[/color]: Swiftly regenerate Stamina during Brawls. \r<br />8. [color=#FFFF00]Brawl Master[/color]: 10% chance to beat your enemies with one hit during brawls when power attacking.\r<br />\r<br />[center][size=5][color=#00FF00][b]Chivalry Skill (formerly Heavy Armor):[/b][/color][/size][/center]\r<br />Primary perk tree is [b][color=#00FF00]Heavy Armor[/color][/b]. It features a miriad of higher rank perks for almost all of the vanilla perks plus two addtional perks better suiting the &#39;Paladin&#39; role a two handed character might choose.\r<br />\r<br />1. [color=#FFFF00]Bane of the Undead[/color]: 50% chance to nullifie incoming damage from undead creatures.\r<br />2. [color=#FFFF00]Rammbock[/color]: 50% chance incoming arrows will bounce off when using 4 parts of heavy armor and sprinting.\r<br />\r<br />Secondary perk tree is about [b][color=#00FF00]Combat Knowledge[/color][/b] and governs increasing combat related skills and faster learning combat skills via perks. All knowledge based skills will be driven by how many levels and skills you&#39;ve gained.\r<br />\r<br />1. [color=#FFFF00]Increase Handwork[/color]: Increase Handwork Skill by 3000 points.\r<br />2. [color=#FFFF00]Increase Shielding[/color]: Increase Shielding Skill by 5000 points.\r<br />3. [color=#FFFF00]Increase Dynamics[/color]: Increase Dynamics Skill by 7500 points.\r<br />4. [color=#FFFF00]Increase Marksman[/color]: Increase Marksman Skill by 10000 points.\r<br />5. [color=#FFFF00]Increase Chivalry[/color]: Increase Chivalry Skill by 12500 points.\r<br />6. [color=#FFFF00]Increase Vigour[/color]: Increase Vigour Skill by 15000 points.\r<br />7. [color=#FFFF00]Art of War[/color]: Learn twice as much from combat related skill books.\r<br />8. [color=#FFFF00]Quick Learner[/color]: Learn combat related skills 10% faster.\r<br />\r<br />[center][size=5][color=#00FF00][b]Shielding Skill (formerly Blocking):[/b][/color][/size][/center]\r<br />Primary perk tree is about[b][color=#00FF00] Blocking[/color][/b]. It features six higher rank perks for the shield wall perk.\r<br />\r<br />Secondary perk tree is about [b][color=#00FF00]Defensive Stance[/color][/b] in general and extends blocking without shield or when crouching. I had Greek Phalanx in mind when developing this perk tree. It will grant you some incredibly awesome defensive perks, which, when used correctly, will make you almost invulnerable, BUT, you will be very limited in your attacking capabilities.\r<br />\r<br />1. [color=#FFFF00]Iron Rock[/color]: Reduce incoming physical damage by 50 % when doing crouched unmoved block with shields.\r<br />2. [color=#FFFF00]Grab Weapon[/color]: 25% chance to disarm your target while blockbashing with a single one handed weapon equipped in crouch stance.\r<br />3. [color=#FFFF00]Interruptor[/color]: Bashing with a two handed weapon in crouch stance will have 25% chance of interrupting incoming attacks.\r<br />4. [color=#FFFF00]Seared[/color]: Bashing with torch in crouch stance gives 25% chance your target drops its weapon and burns in agony.\r<br />5. [color=#FFFF00]Flat Strike[/color]: Knock your target of their feet, by 25% chance, when performing a crouched  bash attack with shields without moving.\r<br />6. [color=#FFFF00]Human Tower[/color]: Minimize incoming physical damage when doing crouched unmoved block with shields, without having a weapon or magic equipped.\r<br />7. [color=#FFFF00]Human Fortress[/color]: Negates all incoming physical and magical damage while blocking with a shield and with active ward spell in unmoved crouch stance.\r<br />\r<br />[center][size=5][color=#00FF00][b]Vigour Skill (formerly Two Handed):[/b][/color][/size][/center]\r<br />Primary perk tree governs [b][color=#00FF00]Two Handed Combat[/color][/b] and has 2 higher rank perks for the Barbarian perk as well as 4 additional custom build perks. The perks primarly focus on playing as Barbarian or Scouts.\r<br />\r<br />1. [color=#FFFF00]Persistent Barbarian (has 5 ranks)[/color]: Increase stamina regeneration by 10% when fighting two handed.\r<br />2. [color=#FFFF00]Heavy Impedour (has 3 ranks)[/color]: Increase your two handed block rate by 5%.\r<br />3. [color=#FFFF00]Rapid Swing[/color]: Draw and swing two handed weapon 25% faster.\r<br />4. [color=#FFFF00]Pommel Strike[/color]: While bashing two handed, stagger your target and interrupt their attacks by 50% chance.\r<br />\r<br />Secondary perk tree is about [b][color=#00FF00]Vitality[/color][/b] and governs the traits of health and fitness. It will make you fitter and more resistant to natural influences like diseases and weather.\r<br />\r<br />1. [color=#FFFF00]Vitality (has 4 ranks)[/color]: Increase health by 20 points.\r<br />2. [color=#FFFF00]Healthy Metabolism (has 5 ranks)[/color]: Develop a natural 10% poison resistance.\r<br />3. [color=#FFFF00]Hardened (has 5 ranks)[/color]: Develop a natural 20 points damage resistance.\r<br />4. [color=#FFFF00]Natural Immunity (has 5 ranks)[/color]: Develop a natural 10% disease resistance.\r<br />5. [color=#FFFF00]*Auto Healer (has 3 ranks)[/color]: Automatically regenerate 0.1 points of health per second unless moving or in combat.\r<br />6. [color=#FFFF00]Natural Heater[/color]: Develop a natural 10% resistance to frost.\r<br />\r<br />[color=#FFFF00]*[/color] = [color=#ff0000]Auto health regeneration in Survivalist Ingenuity is turned off by default.[/color]\r<br />\r<br />[center][size=5][color=#00FF00][b]Dynamics Skill (formerly One Handed):[/b][/color][/size][/center]\r<br />Primary perk tree [b][color=#00FF00]One Handed Combat[/color][/b] not only has the most perfectly arranged look ingame, it also features the greatest additions to vanilla perks. It has 2 additional ranks for the Armsman perk, and 10 additional custom build perks. The tree splits perks into seven categories. One Handed combat with: sword, axe, mace, dagger, dual, duell (&#39;real&#39; one handed) and torch. So basically this perk tree will allow you to specialize in a certain type of weapon:\r<br />\r<br />1. [color=#FFFF00]Persistent Fencer (has 5 ranks)[/color]: Increase stamina regeneration by 15% when fighting one handed.\r<br />2. [color=#FFFF00]Swift Blade[/color]: Draw and swing daggers 10% faster.\r<br />3. [color=#FFFF00]Gifted Fencer[/color]: Fighting with a single oh-weapon and leaving the offhand free increases damage by 20 and blocking by 10 percent.\r<br />4. [color=#FFFF00]Sonic Swing[/color]: Draw and swing one handed weapons 25% faster.\r<br />5. [color=#FFFF00]Sudden Death[/color]: Instantly kill a human when sneaking undetected, and killing your target from behind using a dagger.\r<br />6. [color=#FFFF00]Fence Master[/color]: One handed swords do 50% increased damage against human and vampire actors.\r<br />7. [color=#FFFF00]Torch Bearer[/color]: Increase torch bashing damage by 150%.\r<br />8. [color=#FFFF00]Bone Crusher[/color]: Using a mace increases damage against skeletons by 50%.\r<br />9. [color=#FFFF00]Cutting Axe[/color]: 25% chance to completely ignore targets armor when doing power attack with a one handed axe.\r<br />10. [color=#FFFF00]Parry[/color]: 25% chance to interrupt incoming attacks and disarm target with a single one handed weapon equipped.\r<br />\r<br />Secondary perk tree, [b][color=#00FF00]Athletics[/color][/b], is one of my favorits and directly interweaves with the Athletics&Acrobatics feature introduced by this Mod. It&#39;s fueled by a script, that constantly checks various conditions, like level, perk count, attributes and skills, to determine how fast you run, high you jump and deep you can fall without getting injured. However, this perk tree also introduces various perks to ease up your very much harder life with Skyrim Improved.\r<br />\r<br />1. [color=#FFFF00]Dynamic Warrior (has 4 ranks)[/color]: Increase Stamina by 25 points.\r<br />2. [color=#FFFF00]Running Man (has 5 ranks)[/color]: Increase your basic speed by 5%.\r<br />3. [color=#FFFF00]Deep Breath (has 5 ranks)[/color]: Stamina decreases 10% slower when sprinting.\r<br />4. [color=#FFFF00]Packing Mule (has 5 ranks)[/color]: Increase Carry Weight by 20 points.\r<br />5. [color=#FFFF00]Bunny Hop[/color]: Jumping costs 50% less stamina.\r<br />6. [color=#FFFF00]Swim like a Fish[/color]: Swimming costs 50% less stamina.\r<br />\r<br />[center][size=5][color=#00FF00][b]Marksman Skill (formerly Archery):[/b][/color][/size][/center]\r<br />Primary perk tree governs [b][color=#00FF00]Archery[/color][/b]. It features 4 rank increase perks for Overdraw and Eagle Eye perks, plus 6 custom build perks.\r<br />\r<br />1. [color=#FFFF00]Piercing Arrows[/color]: 25% chance to completely ignore targets armor when attacking with ranged weapons.\r<br />2. [color=#FFFF00]Predator[/color]: Increase damage against animals by 50% when using ranged weapons.\r<br />3. [color=#FFFF00]Bleed me a River[/color]: Attacks with ranged weapons cause extra bleeding damage.\r<br />4. [color=#FFFF00]Trick Shot[/color]: 25% chance to disarm an opponent.\r<br />5. [color=#FFFF00]Sneak Eye[/color]: Sneaking allows you to slightly zoom in your target. (earlie in game)\r<br />6. [color=#FFFF00]Kneeled Aiming[/color]: Increase your Marksman skill by 15 points when in crouch stance.\r<br />7. [color=#FFFF00]Keen Eye[/color]: Allows for detection of arrows via hotkey.\r<br />\r<br />Secondary tree is probably the smallest of all trees with only three perks and handles [b][color=#00FF00]Fledging[/color][/b].\r<br />\r<br />1. [color=#FFFF00]Basic Fledger[/color]: Allowed to fledge basic arrows at any forge: Iron, Forsworn, Falmer and Ancient Nord Arrows. \r<br />2. [color=#FFFF00]Advanced Fledger[/color]: Allowed to fledge advanced arrows at any forge: Steel, Orcish, Dwarven, Elven, Nordic, Silver and Golden Arrows. \r<br />3. [color=#FFFF00]Superior Fledger[/color]: Allowed to fledge superior arrows at any forge: Glass, Ebony, Stahlrim, Daedric, Dragonbone, Quicksilver and Nord Hero Arrows.\r<br />\r<br />[center][img]http://static-3.nexusmods.com/15/images/110/4205982-1419268684.png[/img][/center][center][size=5][color=#00FF00][b]Dexterity (formerly Light Armor):[/b][/color][/size][/center]\r<br />Primary perk tree governs [b][color=#00FF00]Light Armor[/color][/b]. Two rank increases for Agile Defender and one exra perk. \r<br />\r<br />1. [color=#FFFF00]Animal Bane[/color]: 50% chance to nullifie incoming damage from animals.\r<br />\r<br />Secondary perk tree features the second &#39;submerged&#39; skill, [b][color=#00FF00]Acrobatics[/color][/b]. It&#39;s just as much interweaved with the previously mentioned Athletics&Acrobatics script, as the Athletics perk tree. Acrobatics skill fuels its mother skill by jumping around and falling deep. \r<br />\r<br />1. [color=#FFFF00]Vaulter (has 5 ranks)[/color]: Increase your basic jump height by 10%.\r<br />2. [color=#FFFF00]Descend (has 5 ranks)[/color]: Increase your basic fall depth by 10%.\r<br />3. [color=#FFFF00]Charged Jump[/color]: Jump 1.5x higher out of crouching stance. (You&#39;ll need to charge for a second)\r<br />4. [color=#FFFF00]*Sprint Jump[/color]: Allow jumping when sprinting.\r<br />\r<br />[color=#FFFF00]*[/color] [color=#ff0000]I should mention that this is the only &#39;real&#39; working sprint jump on the whole Nexus. It will actually allow you to jump further AND higher when sprinting, not just higher, like in all other sprint jump mods I saw.[/color]\r<br />\r<br />[center][size=5][color=#00FF00][b]Malevolence (formerly Sneak):[/b][/color][/size][/center]\r<br />Primary tree governs [b][color=#00FF00]Sneak[/color][/b]. I thought the snake symbol allowed for something more sinister in description, so I basically connected the whole skill to shady, malice and more or less &#39;evil&#39; characters. It stands in opposition to the Goodwill skill. This perk tree offers two additional ranks for vanilla perks, and three additional perks tailored to &#39;shady&#39; type persons.\r<br />\r<br />1. [color=#FFFF00]Night Prowler[/color]: You are 100% harder to detect when sneaking at nighttime (20-6).\r<br />2. [color=#FFFF00]The Fog[/color]: You are 50% harder to detect when sneaking during bad weather.\r<br />3. [color=#FFFF00]The Shade[/color]: You are 25% harder to detect when sneaking at daytime(6-20).\r<br />\r<br />Secondary tree governs the dark arts of [b][color=#00FF00]Assassination[/color][/b]. It introduces some nifty little perks which will hopefully bring you great joy. It also handles sneaky wizardry and the like. It has 5 new perks to offer. Skill gain is achieved the same way as sneak, so there&#39;s nothing to change here.\r<br />\r<br />1. [color=#FFFF00]*Unconscious[/color]: Knock your target unconscious with a mace equipped when sneaking undetected and attacking from behind.\r<br />2. [color=#FFFF00]Silent Mage (has 5 ranks)[/color]: Spells cause 20% less detection when sneaking.\r<br />3. [color=#FFFF00]Sneaky Wizard (has 3 ranks)[/color]: Destruction Spells have double impact force when sneaking.\r<br />4. [color=#FFFF00]Silent Kill[/color]: Using a dagger when sneaking undetected will instantly kill a sleeping target.\r<br />5. [color=#FFFF00]Razor&#39;s Edge[/color]: Slit your target&#39;s throat when sneaking undetected and attacking from behind with a dagger equipped.\r<br />\r<br />[color=#FFFF00]*[/color] [color=#ff0000]This is equivalent to the unarmed skill, which allowed you to knock over oponents and access their inventory.[/color]\r<br />\r<br />[center][size=5][color=#00FF00][b]Finesse (formerly Lockpick):[/b][/color][/size][/center]\r<br />Primary perks govern [b][color=#00FF00]Lockpicking[/color][/b]. Trap defusing is no longer handled by this skill tree, only locks can be picked safely with this. In addition to the vanilla perks it offers two perks to force locks, or melt them with acid. Forcing locks will alarm surrounding people if you&#39;re not hidden, metling locks is silent, but the ingredients to make acid are very rare. Melting locks with acid also has the advantage to open exceptionally every lock, without rank dependencie. Forcing locks is limited by the weapon you&#39;ve equipped.\r<br />\r<br />1. [color=#FFFF00]Force Locks[/color]: Force locks open with the correct weapon.\r<br />2. [color=#FFFF00]Melt Locks[/color]: Melt locks using refined acid.\r<br />\r<br />Secondary tree handels trap defusing and general [b][color=#00FF00]Wayfaring[/color][/b]. Since the loot in SI is stricted to almost nothing, you will want to pick two of this perk trees perks, in order to raise loot chance. Defusing locks fuels the mother skill the same way as lockpicking does.\r<br />\r<br />1. [color=#FFFF00]Novice Traps[/color]: Novice hinge traps are much easier to defuse.\r<br />2. [color=#FFFF00]Apprentice Traps[/color]: Apprentice hinge traps are much easier to defuse.\r<br />3. [color=#FFFF00]Adept Traps[/color]: Adept hinge traps are much easier to defuse.\r<br />4. [color=#FFFF00]Expert Traps[/color]: Expert hinge traps are much easier to defuse.\r<br />5. [color=#FFFF00]Master Traps[/color]: Master hinge traps are much easier to defuse.\r<br />6. [color=#FFFF00]Lucky Loot[/color]: Slightly increased chance of finding precious loot on human actors.\r<br />7. [color=#FFFF00]Adventurer[/color]: Greatly increased chance of finding useful and precious loot on almost all actors when having at least 25 dungeons cleared.\r<br />\r<br />[center][size=5][color=#00FF00][b]Redeem (formerly Pickpocket):[/b][/color][/size][/center]\r<br />Primary tree governs [b][color=#00FF00]Pickpocket[/color][/b]. It has two additional rank increases for the Light Fingers perk, as well as three new custom perks.\r<br />\r<br />1. [color=#FFFF00]Thief of Famine[/color]: Stealing food is 50% easier.\r<br />2. [color=#FFFF00]Sixth Sense[/color]: 15% chance detecting people having more then 25 gold when sneaking and not moving.\r<br />3. [color=#FFFF00]Pickpocket Master[/color]: Pickpocket targets at 100% chance when undetected.\r<br />\r<br />Secondary tree handels general [b][color=#00FF00]Thievery Knowledge[/color][/b] and is about increasing thievery related skills and faster learning via perks. Fuels mother skill by skilling and leveling.\r<br />\r<br />1. [color=#FFFF00]Increase Goodwill[/color]: Increase Goodwill Skill by 3000 points.\r<br />2. [color=#FFFF00]Increase Extraction[/color]: Increase Extraction Skill by 5000 points.\r<br />3. [color=#FFFF00]Increase Redeem[/color]: Increase Redeem Skill by 7500 points.\r<br />4. [color=#FFFF00]Increase Finesse[/color]: Increase Finesse Skill by 10000 points.\r<br />5. [color=#FFFF00]Increase Malevolence[/color]: Increase Malevolence Skill by 12500 points.\r<br />6. [color=#FFFF00]Increase Dexterity[/color]: Increase Dexterity Skill by 15000 points.\r<br />7. [color=#FFFF00]Thief of Virtue[/color]: Learn twice as much from thievery related skill books.\r<br />8. [color=#FFFF00]Quick Learner[/color]: Learn thievery related skills 10% faster.\r<br />\r<br />[center][size=5][color=#00FF00][b]Goodwill (formerly Speechcraft):[/b][/color][/size][/center]\r<br />Primary tree governs [b][color=#00FF00]Speechcraft[/color][/b] and apart from two rank increase and the tree rearrangement does not change much. The secondary however does&#33;\r<br />\r<br />Secondary tree governs [b][color=#00FF00]Social Intelligence[/color][/b] and just as deeply interlaced with core features of SI, as the Athletics&Acrobatics feature. SI disallows some social interaction when starting a new game, such as recruiting followers, bribing and intimidating. You will not have the chance to recruit any of the vanilla followers without proper skill increase and/or the correct perks. For compensation however, you will get additional dialogue and interaction options with every new perk. Fuels the mother skill by using the new dialogue based social interaction features.\r<br />\r<br />1. [color=#FFFF00]Communication[/color]: Interact with potential vanilla followers, neutral bandit children, and people in general. Also essentialize, intimidate or bribe anyone.\r<br />2. [color=#FFFF00]Present[/color]: Give gifts to people from your inventory via dialogue.\r<br />3. [color=#FFFF00]Befriend[/color]: Befriend people via dialogue. Befriending people is a prerequisite to make them a follower.\r<br />4. [color=#FFFF00]Redress[/color]: Ask people to redress if you previously gave them clothes to do so.\r<br />5. [color=#FFFF00]Supplicant[/color]: Ask people for gifts via dialogue.\r<br />6. [color=#FFFF00]Ringleader[/color]: Make anyone your follower via dialogue.\r<br />\r<br />[center][size=5][color=#00FF00][b]Extraction (formerly Alchemy):[/b][/color][/size][/center]\r<br />Primary tree handels [b][color=#00FF00]Alchemy[/color][/b]. Two additional ranks for the alchemist perk.\r<br />\r<br />Secondary tree handels [b][color=#00FF00]Cooking[/color][/b], which is divided from alchemy. Offers four new perks. Does not look like much, but has a huge impact on how SI is played when using any needs Mod. Since general loot is extremely rare and everything&#39;s so expensive in SI, you will have problems to get your mouth stuffed. A perk to allow you to grill basic food at campfires appears to be convenient then? Additionally cooking now improves the mother skill.\r<br />\r<br />1. [color=#FFFF00]Grill Meat[/color]: Grill meat, leeks, potatoes and fish at campfires.\r<br />2. [color=#FFFF00]Kitchen Aid[/color]: Learn to cook basic food recipes at cooking pots and make flour from wheat.\r<br />3. [color=#FFFF00]Chef[/color]: Learn to cook advanced food recipes at cooking pots.\r<br />4. [color=#FFFF00]Good Scent[/color]: Find corpse and carcass laying around via hotkey.\r<br />[center][img]http://static-1.nexusmods.com/15/images/110/4205982-1419278813.png[/img][/center][center][size=5][color=#00FF00][b]Delusion (formerly Illusion):[/b][/color][/size][/center]\r<br />\r<br />Primary tree handels [b][color=#00FF00]Illusion[/color][/b]. Has one additional perk only.\r<br />\r<br />1. [color=#FFFF00]Clearvoyance[/color]: Clairvoyance no longer costs any magicka.\r<br />\r<br />Secondary tree is about [b][color=#00FF00]Magical Staff[/color][/b] specialization. Fuels mother skill when using magical staffs.\r<br />\r<br />1. [color=#FFFF00]Power Staff[/color]: Staff based magic has 50% increased damage and duration.\r<br />2. [color=#FFFF00]Recharge Staff[/color]: Magical Staffs automatically recharge over time.\r<br />3. [color=#FFFF00]Twin Staffs[/color]: Using two magical staffs increases damage by 100%.\r<br />\r<br />[center][size=5][color=#00FF00][b]Mystic (formerly Conjuration):[/b][/color][/size][/center]\r<br />Primary tree handels [b][color=#00FF00]Conjuration[/color][/b]. Has one additional rank for the Summoner perk.\r<br />\r<br />Secondary tree governs [b][color=#00FF00]Daedra Magic[/color][/b] specialization. Fuels major skill when fighting against the Daedra.\r<br />\r<br />1. [color=#FFFF00]Daedric Defense[/color]: Reduce incoming damage from Daedra creatures by 50%.\r<br />2. [color=#FFFF00]Daedric Attack[/color]: Increase damage against the Daedra by 50%.\r<br />3. [color=#FFFF00]One with the Daedra[/color]: Daedra creatures will occasionally count you as friend.\r<br />\r<br />[center][size=5][color=#00FF00][b]Elementals (formerly Destruction):[/b][/color][/size][/center]\r<br />Primary tree handels [b][color=#00FF00]Destruction[/color][/b] and has no additions.\r<br />\r<br />Secondary tree handels [b][color=#00FF00]Spellsword[/color][/b] specialization. Fuels major skill when using one handed weapons and magic in conjunction.\r<br />\r<br />1. [color=#FFFF00]Spellsword[/color]: Increase damage by 50% when using a one handed weapon in one hand, and a spell in the other.\r<br />2. [color=#FFFF00]wordspell[/color]: Using a sword in combination with spells will increase critical damage chance by 10% and double the inflicted damage.\r<br />3. [color=#FFFF00]Tinman[/color]: Using a Cuirass only in combat, will decrease incoming stagger chance by 50%.\r<br />4. [color=#FFFF00]Helmet Ward[/color]: Using Helmet only in combat will cast a constant ward on yourself.\r<br />\r<br />[center][size=5][color=#00FF00][b]Renewal (formerly Restoration):[/b][/color][/size][/center]\r<br />Primary tree handles [b][color=#00FF00]Restoration[/color][/b] and has 2 additional rank perks for the Recovery perk plus one additional custom perk:\r<br />\r<br />1. [color=#FFFF00]Increase Magicka (has 5 ranks)[/color]: Increase your Magicka by 20 points.\r<br />\r<br />Secondary tree handles [b][color=#00FF00]Dragonborn[/color][/b] specialization. Fuels the major skill when shouting.\r<br />\r<br />1. [color=#FFFF00]Endurant Voice[/color]: Decrease shout recovery time by 50%.\r<br />2. [color=#FFFF00]Strong Voice[/color]: Shout power increases by 50%.\r<br />3. [color=#FFFF00]Force Immunity[/color]: Don&#39;t get thrown back by enemy force shouts.\r<br />4. [color=#FFFF00]Dragon Killer[/color]: Master the Art of hunting and killing Dragons. Increases physical and magical damage against Dragons by 100%.\r<br />\r<br />[center][size=5][color=#00FF00][b]Transformation (formerly Alteration):[/b][/color][/size][/center]\r<br />Primary tree handels [b][color=#00FF00]Alteration[/color][/b] and has two rank perks for the Magical Resistance perk plus one additional perk to allow transmuting perk points into attributes or Dragon souls:\r<br />\r<br />1. [color=#FFFF00]Transmute Perks[/color]: Use Perks to increase skills, health, stamina, magicka, carry weight or speed. Look in MCM menu&#33;\r<br />\r<br />Secondary tree governs [b][color=#00FF00]Unarmored combat[/color][/b] specialization. Fuels the mother skill when doing unarmored combat.\r<br />\r<br />1. [color=#FFFF00]Like a feather[/color]: Your general weapon speed increases by 50% when fighting completely unarmored.\r<br />2. [color=#FFFF00]Feather Pockets[/color]: You permanently increase your maximum carry weight by 100, when not using any armor.\r<br />3. [color=#FFFF00]Dodge[/color]: 10% chance to avoid any incoming damage without using any armor.\r<br />4. [color=#FFFF00]Balance[/color]: 10% chance to avoid any incoming stagger without using any armor.\r<br />\r<br />[center][size=5][color=#00FF00][b]Infusion (formerly Enchanting):[/b][/color][/size][/center]\r<br />Last but not least, the primary tree governs [b][color=#00FF00]Enchanting[/color][/b]. It has 2 additional rank perks for the Enchanter perk, plus four additional custom perks:\r<br />\r<br />1. [color=#FFFF00]Armor Enchanter[/color]: Enchantments on Armors are 25% stronger.\r<br />2. [color=#FFFF00]Weapon Enchanter[/color]: Enchantments on Weapons are 25% stronger.\r<br />3. [color=#FFFF00]Clothes Enchanter[/color]: Enchantments on Clothes and Jewelry are 25% stronger.\r<br />4. [color=#FFFF00]*Soul Renewal[/color]: Enchanted items automatically recharge over time.\r<br />\r<br />[color=#FFFF00]*[/color] [color=#ff0000]This is the real deal, no bugs, no not working functions. This perk will make all your enchanted items recharge over time 100%. I did not found a single working auto recharge Mod on the Nexus, so I had to do it myself.[/color]\r<br />\r<br />Secondary tree governs [b][color=#00FF00]Magical Knowledge[/color][/b] and governs increasing magic related skills and faster learning via perks. Fuels mother skill by skilling and leveling.\r<br />\r<br />1. [color=#FFFF00]Increase Elementals[/color]: Increase Elementals Skill by 3000 points.\r<br />2. [color=#FFFF00]Increase Infusion[/color]: Increase Infusion Skill by 5000 points.\r<br />3. [color=#FFFF00]Increase Mystic[/color]: Increase Mystic Skill by 7500 points.\r<br />4. [color=#FFFF00]Increase Renewal[/color]: Increase Renewal Skill by 10000 points.\r<br />5. [color=#FFFF00]Increase Transformation[/color]: Increase Transformation Skill by 12500 points.\r<br />6. [color=#FFFF00]Increase Delusion[/color]: Increase Delusion Skill by 15000 points.\r<br />7. [color=#FFFF00]Gifted Magician[/color]: Learn twice as much from magic related skill books.\r<br />8. [color=#FFFF00]Quick Learner[/color]: Learn magic related skills 10% faster.\r<br />\r<br />[center][size=6][color=#00FF00][b][u]Core Features[/u][/b][/color][/size][/center][center][center][img]http://static-4.nexusmods.com/15/images/110/4205982-1419314400.png[/img][/center][/center][center][size=5][color=#00FF00][b]Character Creation & Progression[/b][/color][/size][/center]\r<br />[color=#FFFF00]Attribute Choice: [/color]Another core element of Skyrim Improved is the character creation&progression system. It will allow you to reconfigure your attributes (from default health (50), stamina(50), magicka(50), carry weight(120)) and skills in a range of preset points (270 for attributes, 305 for skills), as long as you&#39;re level 1 (and not beyond). This is similar to most RPG games I&#39;ve played, where you had to make a good choice which skills and attributes to promote, and which to neglect when starting a new game. So in order to play a packing mule, you&#39;ll need to abandon valuable health, stamina or magicka points. If you want to roleplay a mage, you will need to abandon on carry weight capacity maybe? Let alone the choice you make here, will greatly increase difficulty when starting a new game. You will be barely able to carry enough equipment, learn spells from the beginning (unless going straight for the College of Winterhold), which you have to because you will start without any spells at all, and only your racial power. Even a single Wolf or Skeever will be a major threat to your life.\r<br />\r<br />[color=#FFFF00]Regeneration Options: [/color]Health, stamina and magicka regeneration is adjustable as well. I recommend playing without health regeneration and halved stamina and magicka regeneration, which will additionally increase game difficulty. For a little relief, there&#39;s a MCM option to raise all regeneration rates when crouching unmoved, this is supposed to simulate higher recovery when relaxing. \r<br />\r<br />[color=#FFFF00]Skill Progression: [/color]Vanilla Skill Progression has been expanded and introduces a lot of skilling functions available in Morrowind or Oblivion. For example, you will increase skills when running, swimming, jumping, cooking and doing unarmed combat. You will increase skills when under the influence of disease, bad weather or harmful magic. You will increase skills on all crafting and cooking stations. You will increase skills with diverse weapon configurations, when fighting the Daedra, when unarmored, when using your Thu&#39;um and even when simply talking to people. Of course, you might think it&#39;s already easy to level your character? This is why I tailored the whole aspect around [url=http://www.nexusmods.com/skyrim/mods/1175/?]the community uncapper Mod[/url] made by Elys, which I grant a .ini file for.\r<br />\r<br />[center][size=5][color=#00FF00][b]Athletics, Acrobatics, Encumbrance and Fatigue[/b][/color][/size][/center]\r<br />[color=#FFFF00]Athletics&Acrobatics: [/color] Another core feature is something I really missed from previous Elder Scrolls titles. Athletics&Acrobatics&#33; I don&#39;t use fast travel, to get the highest immersive impact from the world around me. The whole system works on a script that continously checks various conditions that have influence on the player, like skill, level, distance covered, inventory weight, perks, attributes and even your exposure to bad weather. The script will then evaluate your current speed, jump height/distance and fall depth. The initial speed, jump and fall multipliers are lowered by 25% and will increase level by level. The formula calculates like that:\r<br />\r<br />[color=#ff0000]((Base Speed(75) + PlayerLevel) + (DynamicsSkill/ 10) + Perks) + (DistanceCovered) - ((InventoryWeight / 5) - EnviromentalConditions) + (LowStaminaAttribute))[/color]\r<br />\r<br />So if you&#39;re a on level 3 with 26 Dynamics skill and maybe one &#39;Running&#39; Man perk, and carry 90 lbs in your inventory on sunny weather you will have ((75 + 3) + (2.6 + 3.75)) - (18 + 0) = 66.35 speed, which equals 66% of vanilla speed. The covered distance will carry its effect on the player via magic effect running in the background. The jump/fall formula are almost identical. Theoratically your speed at level 100 could be 210, if you do not carry anything in your inventory, but you certainly will never reach that point. Also, the speed, jump and fall progression is capped on level 100.\r<br />\r<br />[color=#FFFF00]Encumbrance&Fatigue: [/color]&#39;Real Encumbrance&#39; basically means a simulated way of inventory weight increase having a direct impact on your speed, jump and fall multipliers. This is directly interlaced with the Athletics&Acrobatics feature and can only be used in conjunction with it. Every pound added to your inventory will make you more sluggish. Movement will eventually come to a complete halt if you&#39;re overexceeding your maximum carry weight. However, there&#39;s various perks, magic and potions to increase speed, jump height and carry weight for short periods of time. This all gets complemented by progressive fall height/damage. Fall height does not only get influenced by level and perks, but by your inventory weight as well. So don&#39;t jump off the high cliff if you&#39;re a packing mule. Additionally, when highly overencumbered, or having low stamina, you will not be able to jump at all. All of those features are configurable within the MCM menu.\r<br />\r<br />The MCM menu also offers extended stamina consumption on various actions like running, swimming, jumping, attacking, blocking and drawing your bow. Simple walking or fast sneaking has an impact on your stamina as well, if you enable the fatigue features. Both features will increase difficulty just as much as the attribute and regeneration features. Combat will be much more difficult without stamina. Fleeing from battle is almost impossible and fast and swift movement will only be available if you choose the right perks and increase your skills.\r<br />\r<br />[center][size=6][color=#00FF00][b][u]Secondary Features[/u][/b][/color][/size][/center][center][img]http://static-1.nexusmods.com/15/images/110/4205982-1419192396.png[/img][/center]\r<br />[center][size=5][color=#00FF00][b]Enviromental & Immersion[/b][/color][/size][/center]\r<br />[color=#FFFF00]Enviromental Settings: [/color]This features adjustments to the world around you and your interaction with it. The main goal is to remove annoyances and improve gameplay mechanics through practical immersion. Timescale is freely adjustable. The MCM also offers an option to toggle month names with their earth like equivalent, and an option to turn off intrusive messages, like the infamous &#39;you carry to much to be able to move&#39; message. An option to slow you down in storms and blizzards also exists. The idea behind this is, to force the player to search for shelter as fast as possible, were being able to move &#39;fast&#39; is relative with this penalty. A feature that should not be embezzled is bees returning to their hives on bad weather. So practically this means, if you loot beehives when it&#39;s raining, you will get the whole state including the bee queen.\r<br />\r<br />[color=#FFFF00]Practical Immersion: [/color]Carryable lanterns have been introduced, as well as light radius and durability from torches changed. In general lanterns are a better source of light, while torches last much longer. You will also be able to place light sources everywhere you want  with the help of a hotkey and when having the correct prerequisites in your inventory. This includes lanterns, candles, bonfires, sconces, posts and even magical light. Want to light up your house like in Morrowind? Well, now you can. Mining operations are treated just the same way as ordinary harvesting. This is achieved by turning off the mining animation. This all rounds up well by adding lanterns and torches to actors around the world, so they will light up the dark days and nights just as you do. For the inexperienced layman a feature to grill diverse raw food at campfires and embers, has been introduced.\r<br />\r<br />[color=#FFFF00]Social Interaction: [/color]A feature I&#39;m particular proud of is the new scope of social interaction options. A whole secondary perk tree has been dedicated to this feature. It will allow you to enter communication with almost anyone, including bandit children, occasional Daedra, and persons you formerly weren&#39;t able to talk to. You&#39;ll be allowed to make anyone your friend, share inventory with them, make them wear the presents you gave to them, ask them for gifts and ultimatively have the chance to make every single unique actor in Skyrim your follower. Not only does it improve the level of entertainment you get from the game, it also has a high impact on previously unused gameplay elements and capacity of roleplay.\r<br />\r<br />[color=#FFFF00]Gameplay Immersion: [/color]There are two new gameplay elements that will increase the scope of interaction with the world around you. For example, you can activate pullchains and traps with weapons now. This includes ranged weapons. So essentially this means you can trigger traps or doors when using a bow to shoot the level or pullchain. This way you could lock up enemies, trigger traps from a far, or simply open doors you weren&#39;t able to open before. Another feature is the &#39;sensitive aiming&#39; which, when turned on in the MCM, will let you aim for targets much smoother. You can even toggle it on and off via hotkey.\r<br />\r<br />[color=#FFFF00]Miscellaneous Immersion: [/color] If you get into engagement with bandits or other foes, close guards that witness the crime scene will now enter the fight and try to kill the one that attacked you. The same is true if you attack foes close to guards. Guards want universal peace in their holds, so any form of combat is disallowed unless carried out by them. Another feature has been incorporated with the help of @Cheskos placement code. You can use a hotkey to place waymarkers in exterior cells to mark any location you want to see on the world map. In addition you&#39;re allowed to interact with those map markers on the world map and write any text you want when clicking the map markers. You can even rename those map markers. The first typed sentence in the text window will be used as name. Additionally to this feature you will now have colored map markers to make it more easy to distinguish between them. If you don&#39;t like the colored map markers, simply stay with the default option with white map markers. On a little side note, do you remember how you could wear two rings in Morrowind? I should mention you can do the same now in Skyrim...:D\r<br />\r<br />[center][size=5][color=#00FF00][b]Archery & Ammunition[/b][/color][/size][/center]\r<br />[color=#FFFF00]Archery: [/color]I&#39;m a passionate Archer. As such I was bound to greatly improve archery in Sykrim. First off, you probably want to add commonly knowen archery related .ini options in order to turn off auto aim and increase shooting distance. Look in the FAQ section to figure which settings I&#39;m refering to. You can then toggle on/off auto aim. Various other features related to archery can be toggled in the MCM menu. As bonus there&#39;s an option to introduce bow zoom without the eagle eye perk, and to raise your marksmann skill when crouching, to encourage crouch stance when using a bow. All zoom related perks will now have two variations, one when standing (low zoom) and one when couching (high zoom). Effectively this means, in crouch stance you will have a much higher chance to hit a target. The eagle eye perk has been edited in the same fashion. \r<br />\r<br />[color=#FFFF00]Ammunition: [/color]The pool of arrows has been complemented with golden, silver and quicksilver arrows. All three arrow types have unique features, such as the golden arrow being an exceptional close combat projectile with very high impact force and damage done. Silver arrows, as you can think, are very useful against undead and daedra enemies and, when used on them, has almost the same impact as golden arrows. The third variant, quicksilver, is suited for sniper style of gameplay and has a light source attached. It&#39;s among the fastest, most stable and most accurate of all arrows. The fletcher perk tree will allow you to fletch every arrow type with the correct source materials. So if you don&#39;t want to rely on loot, you&#39;ll need to level this perk tree. There&#39;s an option to turn on weight on arrows(including those from Immersive Weapons Mod if you have it installed), and diverse other options to adjust how many unbroken arrows to find on corpses, how much and how long arrows stay on bodies. NPC&#39;s will no longer have auto refilling arrows in their inventory. Their pool of ammunition is limited just as yours. Practically this means archers will more often enter melee combat with you, if they don&#39;t have arrows, or simply try to retreat from combat. It is also important to know that all arrows types now have diversified statstics. This includes all projectiles by all DLC&#39;s. In combat this means all arrows will act different. Arrows with high trajectory will fall back to the ground much faster then arrows with low trajectory. \r<br />\r<br />[center][img]http://static-4.nexusmods.com/15/images/110/4205982-1392451133.png[/img][/center]\r<br />[center][size=5][color=#00FF00][b]Magic & Alchemy[/b][/color][/size][/center]\r<br />[color=#FFFF00]Alchemy: [/color]Changes in this sector include health, stamina and magicka potions with duration to increase difficulty. This effectively represses attribute recovering potion spamming. You get the idea with zeroed auto health regeneration and lower starting attributes? Yes, it&#39;s all about difficulty&#33; Various new potion types have been introduced, such as increase carry weight, increase speed, slow time (bullet time), open lock, and regular night eye for no Khajit or Vampire players.\r<br />\r<br />[color=#FFFF00]Magic: [/color]The Khajit and Vampire night eye is now toggleable and no longer has any duration. Soulgems will now act far more intelligent then in vanilla Skyrim, so you will no longer waste precious soulgems on minor souls, plus smaller souls will stack inside big soulgems. Also, filled soulgems will now be glowing.\r<br />\r<br />[color=#FFFF00]Enchanting: [/color]Enchantment restrictions are completely lifted, so you&#39;re allowed to put almost every enchantment on every possible item, with minor exceptions.\r<br />\r<br />[color=#FFFF00]New Spells: [/color]Finally I have added 26 new magical effects, distributed on spells, scrolls and tomes. Those include: increase carry weight, increase speed, slow time (real bullet time), open lock and regular night eye magic for those that aren&#39;t Khajit or Vampire. Additionaly there are 5 new summons: a &#39;Large Familiar&#39; Bear Spirit, a Draugr &#39;Ghost Archer&#39;, a Whispmother &#39;Ghostspirit&#39;, a Hallow Dead named &#39;Hollow Death&#39;, which basically is Arnulf Warzenschlegger in ghost form and you&#39;re also capable of conjuring Alduins Ghost once you&#39;ve mastered the final stage of the main quest. Those new summons can be bought or be found in general loot.\r<br />\r<br />[center][size=5][color=#00FF00][b]Stealth & Thievery[/b][/color][/size][/center]\r<br />There&#39;s not much to say about this section. But I made sure that the changes to this section have an immense impact to your gameplay experience. Basically all it does is increasing the difficulty on sneaking and pockpicking, depending on how you set up in the MCM menu. All options are freely adjustable in the MCM menu. Sneaking and lockpicking in vanilla Skyrim was hilariously easy, and I was able to ghost through more then half of the game. The problem with the low difficulty on lockpicking also was, I got access to very precious loot earlie in the game, which rendered the whole idea of &#39;difficulty&#39; ad absurdum. There is a MCM option to enforce penalties on sneaking when using light sources, such as torches, lanterns or magic. It never made much sense to me why I was able to sneak past actors with my torch equipped. Also, the malevolence skill allows for choosing perks that will introduce melting and forcing locks. Melting locks is a silent and convenient way to melt almost every lock in Skyrim, but the ingredients you need to make the acid, are very rare. Forcing locks will not come silent and alarm actors around you. You will also need the correct weapon in order to force open locks. A dagger probably is not the right weapon for master locks I assume...:D\r<br />\r<br />[center][size=5][color=#00FF00][b]Economy, Loot, Crafting & Items[/b][/color][/size][/center]\r<br />[color=#FFFF00]Economical Difficulty: [/color]Let&#39;s be honest. Economy in vanilla Skyrim was hilarious. Combined with the abundant amount of loot you could get rich in no time. So the first and most important change is to the game settings dealing with merchant prices. I recommend using highest difficulty, which will in general make prices much higher for you and much lower for vendors. Additionally prices on almost everything has been raised. In exchange rewards for quests and pelt prices have been raised, to encourage actually working for your money, and merchants having more gold in their inventory, so they&#39;re actually able to reward your expenditure. As gimmick, Severio Pelagia and other farmers now pay gold for leek just as they do for various other crops.\r<br />\r<br />[color=#FFFF00]General Loot: [/color]In short, the chance to find loot, ANY loot, has been almost zeroed. Not only will you be finding precious loot very rarely, general loot will almost always be unworth compared to vanilla standards when combined with higher merchant prices. However, you&#39;ll have the option to increase your &#39;luck&#39; with the corret perks and leveling up your character. The loot settings in Skyrim Improved are second to nothing. On the contrary there&#39;s new loot, ingredients and food introduced on diverse plants and creatures, as well as some of the plants having fixed respawn values. This includes: Bee Queen, Spider Sap, Spider Eyes, Spider Teeth, Bread, Grilled Skeaver Meat, Honey Nut Treat, Grilled Leek, Baken Potatoes, Cabbage, Leek and Chicken Nests. Additionally the Namira&#39;s Root, Imp Stool, White Cap and Human Heart have their values fixed.\r<br />\r<br />[color=#FFFF00]Crafting Options: [/color]You can craft Gold coins from various ingot recipes. This encourages searching for precious ores and smelting ingots from those metals. Regular trees, like pines and birches can now be harvested (branches) to make arrow components and other wood based  items like torches and tools. Most of the recipes have been changed in order to use a broader variety of ingredients and prerequisites. You&#39;re now allowed to craft lockpicks, lanterns and diverse other things without the correct items. Crafting lockpicks needs you to have an increased lockpick skill, or you can&#39;t forge them. You can also craft bonemeal from human skulls, goat horns, troll skulls and turn firewood into charcoal, which acts as prerequisite for lanterns, torches and bonfires.\r<br />\r<br />[color=#FFFF00]Miscellaneous Changes to Items and Loot: [/color]Gold, keys, arrows and lockpicks now have weight. Their weight is low, but it will have a dramatic impact on your carrying capacity, as the player usually carry around a lot of them. Mining ores will randomly grant you salt or more jewels. Every town or village that didn&#39;t had a forge, smelter, tanning rack, grindstone, workbench, enchanter, cooking pot or alchemy station now has one. This might considerably be a cheat, but as previously mentioned, SI also stands for removal of annoyances. The final thing that will have an immense impact on your daily routine and money count is the greatly increased ownership of items. However, befriending owners and Jarls will still make things available to you.\r<br />\r<br />[center][size=5][color=#00FF00][b]Hotkey Features[/b][/color][/size][/center]\r<br />The main purpose of the new hotkeys is to reduce micromanaging and remove annoyances. There&#39;s a hotkey that lets you find corpses when choosing the Good Scent perk. Two hotkeys are used for the placement of light sources and waymarkers. Another hotkey is used for the &#39;find arrows on the ground &#39; feature. There&#39;s a hotkey to instantly kill anyone and anything, which also has options to make it less of a cheat by enforcing gold cost on you. It also comes with some optical gimmicks, like magic and sound effect on target. This is to be considered a cheat, but should be used as last effort in a hopeless situation. You can taunt people into attacking you with another hotkey., also comes with animations and graphical gimmicks if you choose so. More hotkeys are: torch hotkey that will also equip lanterns, toggle menus hotkey, instant quit hotkey, unequip hotkeys, toggle subtitles hotkey, recharge weapon hotkey, delete spell hotkey, and finally 20 new hotkeys for spells, powers and shouts. The newest addition to hotkeys is a general target information hotkey, that will give you information about current health, name and attack damage. \r<br />\r<br />[center][size=5][color=#00FF00][b]Miscellaneous Features[/b][/color][/size][/center]\r<br />[color=#FFFF00][b]Recruit followers only with speech 25 and higher:[/b][/color] You can make followers only follow you with at least speechcraft 25 and if there Speechcraft skill isn&#39;t higher then yours. You will also need to activate Perks inside the Goodwill skill to make interaction possible.\r<br />\r<br />[color=#FFFF00][b]Traps and diseases more lethal:[/b][/color] Contracting disease now actually does something negative to you, especially with hardcore settings enabled. Traps are 5-10x more lethal than in default game and most fo them are barely visual. Most traps mean instant death to you and your followers.\r<br />\r<br />[color=#FFFF00][b]Unique Barenziah quest book:[/b][/color] The Barenziah quest is a very good addition, but after playing two times through the default game, I no longer have the nerve to search for those stones. I&#39;ve created a unique book which tells you where to find those nasty gems, but only if you understand the riddles inside the book.\r<br />\r<br />[color=#FFFF00][b]Killable children:[/b][/color] Felt to much of a limitation to me. You don&#39;t need to kill them after all.\r<br />\r<br />[color=#FFFF00][b]Children Enemies:[/b][/color] This adds children to bandit and forsworn enemy lists. They tend to run away in battles, but some of them are just as aggressive as their adult counterparts. You can also interact with childrens that stay passive, and make them follow, attack or simply dislike you.\r<br />\r<br />[color=#FFFF00][b]Fixed Vanilla Iron Arrow CTD bug:[/b][/color] There&#39;s a vanilla bug that randomly crashes the game when giving iron arrows to followers, most noticeable when using follower overhauls like FM, AFT or EFF. I fixed it by completely removing the option to add iron arrow to your followers or containers (which also randomly crashes the game). You can now make Steel Arrows from Iron Arrows at a forge.\r<br />\r<br />[color=#FFFF00][b]Klimmek in Ivarstead and Sigurd in Whiterun are now Vendors:[/b][/color] I was underwhelmed by the fact there&#39;s no vendor in Ivarstead, that&#39;s why I changed Klimmek to be one. The same is true for the capital when returning form a long trip at night, hence Sigurd spends his spare time from 9-12 p.m. doing his masters job.\r<br />\r<br />[center][size=6][color=#00FF00][b]FAQ[/b][/color][/size][/center]\r<br />Please put this code into your Skyrim.ini if you want to use disabled auto aim.\r<br />\r<br />[color=#00ff00]Auto Aim:[/color]\r<br />\r<br />[Combat]\r<br />fMagnetismObjLookingMult=0.0000\r<br />fMagnetismObjHeadingMult=0.0000\r<br />fMagnetismObjStrafeHeadingMult=0.0000\r<br />fMagnetismLookingMult=0.0\r<br />fMagnetismHeadingMult=0.00\r<br />fMagnetismStrafeHeadingMult=0.0\r<br />fMagnetismStrafeBaseSpeed=350.0000\r<br />fMagnetismStrafeMaxDistance=750.0000\r<br />\r<br />[color=#00ff00]Arrows Distance:[/color]\r<br />\r<br />[Combat]\r<br />f1PArrowTiltUpAngle=0.7\r<br />f3PArrowTiltUpAngle=0.7\r<br />\r<br />[Actor]\r<br />fVisibleNavmeshMoveDist=12288.0000\r<br />\r<br />[center][color=#00FF00][size=4][b]Compatibilities & Mod Recommendations:[/b][/size][/color][/center]\r<br />\r<br />See [url=http://static-1.nexusmods.com/15/images/110/4205982-1419197887.jpg]this screenshot for compatible mods[/url]. There&#39;s various patches and extras in the download section to fix incompatiblities with certain Mods as well.\r<br />\r<br />[center][color=#00FF00][size=4][b]Incompatibilities:[/b][/size][/color][/center]\r<br />\r<br />Pretty much every Mod that deals with changing the perk trees in any way will not be compatible. Incompatbilities will be solved be rearranging the load orders, with minor losses. Creating bashed patches will help as well.\r<br />\r<br />[center][color=#00FF00][size=4][b]Knowen Bugs:[/b][/size][/color][/center]\r<br />- The athletics/speed feature might kick in only once you&#39;ve gone into sneak state, sheathed/unsheathed your weapon, entered a menu, or started to sprint when starting a new game. This actually is a default engine bug, and there&#39;s nothing I can do about it at the moment.\r<br />- The bug you might experience with your carry weight going crazy after you&#39;ve been released from jail is fixable with the supported spell. The spell will remove every instance of arrow weight dummy from your inventory. But beware, the spell will also remove any instance of arrows to prevent further bugs and exploits. After you used the spell to clean arrow weight dummys, the &#39;arrows have weight&#39; feature will continue to work like supposed to.\r<br />- There&#39;s a bug with arrows not showing any weight in inventory. This is because I&#39;m using weight dummys to mimic weight on arrows via script. Skyrim does not allow to show weight on arrows in inventory.",
  "categoryId": "79",
  "version": "1.0.2",
  "author": "CrEaToXx",
  "createdUnix": "1491161391",
  "updatedUnix": "1492195845",
  "containsAdultContent": false,
  "uploadedBy": "CrEaToXx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000240616",
      "name": "Skyrim Improved",
      "version": "1.0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4266",
      "fileName": "Skyrim Improved-83096-1-0-2.7z",
      "uploadedUnix": "1491161194",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/7f758c0a28827d12a7e03eafea3bf97447d137c771a679989d4c17a65fa9da06/analysis/1491161297/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 2.4.2017, Version 1.0.2:[/color][/size][/b]\r<br />\r<br />- fixed error log problem related to taunting a dead actor\r<br />- fixed getting enormous level increase when choosing the &#34;Increase Infusion&#34; perk\r<br />- fixed elder people couldn&#39;t be made essential via dialogue\r<br />- now something for the laughs...I was thinking about implementing a feature for the placeable light sources, to remove and replace them...that&#39;s when I figured I already did so, just forgot to give the corresponding activators a name, hence you couldn&#39;t activate them in game. This is now solved, ergo you can now replace and remove light sources\r<br />- upgraded Frostfall patch to Campfire patch, due to Frostfall no longer touching the wood chopping blocks\r<br />- forwarded fix for SI_TCPatch related to wrong keyword\r<br />- SI uses USLEEP as master now\r<br />- forwarded all changes from USLEEP to main plugin\r<br />- forwarded all changes from USLEEP to patches\r<br />- added missing fix to TC patch\r<br />\r<br />[size=4][b][color=#00FF00]Release 27.9.2015, Version 1.0.1:[/color][/size][/b]\r<br />\r<br />- fixed various child dialogue related bugs\r<br />- added voice support for child interaction\r<br />- fixed various child related bugs due to removal of vanilla keyword\r<br />- fixed bandit/forsworn children size bug\r<br />- updated CUYC patch to new changes\r<br />- added missing crafting stations in Winterhold\r<br />- entirely removed any changes to soulgem in favor to newer and more modern &#34;acquisitive soulgem&#34; Mods\r<br />- added various shared dialogue options to all quests\r<br />- fixed problems related to recruting anyone as follower via dialogue\r<br />- added tag to recruit anyone as follower dialogue, so you know that&#39;s the dialogue of SI\r<br />- added recipe to make gold from gold ingots only(750)\r<br />- added recipe to make gold from quicksilver and corundum(750)\r<br />- added notification when instant killing someone via hotkey\r<br />- fixed bug when following bandit children/children died not clearing alias and restting the global value\r<br />- you can craft forsworn arrowheads from human and troll skulls now\r<br />- added failsafe to recruiting children dialogue, if they are already recruited as follower\r<br />- added dialogue option for unique actors that weren&#39;t tagged as unqiue and thus couldn&#39;t be essentialized\r<br />- expanded the recruit children dialogue to children other then forsworn or bandits\r<br />- cleaned the plugin with TesVEdit\r<br />\r<br />[size=4][b][color=#00FF00]Release 24.12.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Improved-83096-1-0-2.7z?fid=1000240616&ttl=1535871919&ri=8192&rs=8192&setec=96809e91c766957b597b9fcfe02483aa"
    },
    {
      "fileId": "1000240618",
      "name": "Patches",
      "version": "1.0.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3",
      "fileName": "Patches-83096-1-0-2.7z",
      "uploadedUnix": "1491161263",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/d79a0c19290a7474c4bd3bc83a695887e974d53088da743c5dd45966f70bfb61/analysis/1491161463/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 2.4.2017, Version 1.0.2:[/color][/size][/b]\r<br />\r<br />- fixed error log problem related to taunting a dead actor\r<br />- fixed getting enormous level increase when choosing the &#34;Increase Infusion&#34; perk\r<br />- fixed elder people couldn&#39;t be made essential via dialogue\r<br />- now something for the laughs...I was thinking about implementing a feature for the placeable light sources, to remove and replace them...that&#39;s when I figured I already did so, just forgot to give the corresponding activators a name, hence you couldn&#39;t activate them in game. This is now solved, ergo you can now replace and remove light sources\r<br />- upgraded Frostfall patch to Campfire patch, due to Frostfall no longer touching the wood chopping blocks\r<br />- forwarded fix for SI_TCPatch related to wrong keyword\r<br />- SI uses USLEEP as master now\r<br />- forwarded all changes from USLEEP to main plugin\r<br />- forwarded all changes from USLEEP to patches\r<br />- added missing fix to TC patch\r<br />\r<br />[size=4][b][color=#00FF00]Release 27.9.2015, Version 1.0.1:[/color][/size][/b]\r<br />\r<br />- fixed various child dialogue related bugs\r<br />- added voice support for child interaction\r<br />- fixed various child related bugs due to removal of vanilla keyword\r<br />- fixed bandit/forsworn children size bug\r<br />- updated CUYC patch to new changes\r<br />- added missing crafting stations in Winterhold\r<br />- entirely removed any changes to soulgem in favor to newer and more modern &#34;acquisitive soulgem&#34; Mods\r<br />- added various shared dialogue options to all quests\r<br />- fixed problems related to recruting anyone as follower via dialogue\r<br />- added tag to recruit anyone as follower dialogue, so you know that&#39;s the dialogue of SI\r<br />- added recipe to make gold from gold ingots only(750)\r<br />- added recipe to make gold from quicksilver and corundum(750)\r<br />- added notification when instant killing someone via hotkey\r<br />- fixed bug when following bandit children/children died not clearing alias and restting the global value\r<br />- you can craft forsworn arrowheads from human and troll skulls now\r<br />- added failsafe to recruiting children dialogue, if they are already recruited as follower\r<br />- added dialogue option for unique actors that weren&#39;t tagged as unqiue and thus couldn&#39;t be essentialized\r<br />- expanded the recruit children dialogue to children other then forsworn or bandits\r<br />- cleaned the plugin with TesVEdit\r<br />\r<br />[size=4][b][color=#00FF00]Release 24.12.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Patches-83096-1-0-2.7z?fid=1000240618&ttl=1535871920&ri=8192&rs=8192&setec=379a8fcfba05293e52b17af76a59cc58"
    },
    {
      "fileId": "1000240619",
      "name": "Extras",
      "version": "1.0.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "77",
      "fileName": "Extras-83096-1-0-2.7z",
      "uploadedUnix": "1491161360",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/0827d59e05470de3f96127f0ab56ea245d42cba0697ee208a19eba1b5d04338e/analysis/1491161642/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 2.4.2017, Version 1.0.2:[/color][/size][/b]\r<br />\r<br />- fixed error log problem related to taunting a dead actor\r<br />- fixed getting enormous level increase when choosing the &#34;Increase Infusion&#34; perk\r<br />- fixed elder people couldn&#39;t be made essential via dialogue\r<br />- now something for the laughs...I was thinking about implementing a feature for the placeable light sources, to remove and replace them...that&#39;s when I figured I already did so, just forgot to give the corresponding activators a name, hence you couldn&#39;t activate them in game. This is now solved, ergo you can now replace and remove light sources\r<br />- upgraded Frostfall patch to Campfire patch, due to Frostfall no longer touching the wood chopping blocks\r<br />- forwarded fix for SI_TCPatch related to wrong keyword\r<br />- SI uses USLEEP as master now\r<br />- forwarded all changes from USLEEP to main plugin\r<br />- forwarded all changes from USLEEP to patches\r<br />- added missing fix to TC patch\r<br />\r<br />[size=4][b][color=#00FF00]Release 27.9.2015, Version 1.0.1:[/color][/size][/b]\r<br />\r<br />- fixed various child dialogue related bugs\r<br />- added voice support for child interaction\r<br />- fixed various child related bugs due to removal of vanilla keyword\r<br />- fixed bandit/forsworn children size bug\r<br />- updated CUYC patch to new changes\r<br />- added missing crafting stations in Winterhold\r<br />- entirely removed any changes to soulgem in favor to newer and more modern &#34;acquisitive soulgem&#34; Mods\r<br />- added various shared dialogue options to all quests\r<br />- fixed problems related to recruting anyone as follower via dialogue\r<br />- added tag to recruit anyone as follower dialogue, so you know that&#39;s the dialogue of SI\r<br />- added recipe to make gold from gold ingots only(750)\r<br />- added recipe to make gold from quicksilver and corundum(750)\r<br />- added notification when instant killing someone via hotkey\r<br />- fixed bug when following bandit children/children died not clearing alias and restting the global value\r<br />- you can craft forsworn arrowheads from human and troll skulls now\r<br />- added failsafe to recruiting children dialogue, if they are already recruited as follower\r<br />- added dialogue option for unique actors that weren&#39;t tagged as unqiue and thus couldn&#39;t be essentialized\r<br />- expanded the recruit children dialogue to children other then forsworn or bandits\r<br />- cleaned the plugin with TesVEdit\r<br />\r<br />[size=4][b][color=#00FF00]Release 24.12.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extras-83096-1-0-2.7z?fid=1000240619&ttl=1535871920&ri=8192&rs=8192&setec=584ef3c00e4f2ff32ca056facb04a577"
    },
    {
      "fileId": "1000240620",
      "name": "Source",
      "version": "1.0.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3673",
      "fileName": "Source-83096-1-0-2.7z",
      "uploadedUnix": "1491161385",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/a2720b48397816e2b968643559938d20bd7e3dddee607b5bcccbf9d8a4a1d9b0/analysis/1491161655/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 2.4.2017, Version 1.0.2:[/color][/size][/b]\r<br />\r<br />- fixed error log problem related to taunting a dead actor\r<br />- fixed getting enormous level increase when choosing the &#34;Increase Infusion&#34; perk\r<br />- fixed elder people couldn&#39;t be made essential via dialogue\r<br />- now something for the laughs...I was thinking about implementing a feature for the placeable light sources, to remove and replace them...that&#39;s when I figured I already did so, just forgot to give the corresponding activators a name, hence you couldn&#39;t activate them in game. This is now solved, ergo you can now replace and remove light sources\r<br />- upgraded Frostfall patch to Campfire patch, due to Frostfall no longer touching the wood chopping blocks\r<br />- forwarded fix for SI_TCPatch related to wrong keyword\r<br />- SI uses USLEEP as master now\r<br />- forwarded all changes from USLEEP to main plugin\r<br />- forwarded all changes from USLEEP to patches\r<br />- added missing fix to TC patch\r<br />\r<br />[size=4][b][color=#00FF00]Release 27.9.2015, Version 1.0.1:[/color][/size][/b]\r<br />\r<br />- fixed various child dialogue related bugs\r<br />- added voice support for child interaction\r<br />- fixed various child related bugs due to removal of vanilla keyword\r<br />- fixed bandit/forsworn children size bug\r<br />- updated CUYC patch to new changes\r<br />- added missing crafting stations in Winterhold\r<br />- entirely removed any changes to soulgem in favor to newer and more modern &#34;acquisitive soulgem&#34; Mods\r<br />- added various shared dialogue options to all quests\r<br />- fixed problems related to recruting anyone as follower via dialogue\r<br />- added tag to recruit anyone as follower dialogue, so you know that&#39;s the dialogue of SI\r<br />- added recipe to make gold from gold ingots only(750)\r<br />- added recipe to make gold from quicksilver and corundum(750)\r<br />- added notification when instant killing someone via hotkey\r<br />- fixed bug when following bandit children/children died not clearing alias and restting the global value\r<br />- you can craft forsworn arrowheads from human and troll skulls now\r<br />- added failsafe to recruiting children dialogue, if they are already recruited as follower\r<br />- added dialogue option for unique actors that weren&#39;t tagged as unqiue and thus couldn&#39;t be essentialized\r<br />- expanded the recruit children dialogue to children other then forsworn or bandits\r<br />- cleaned the plugin with TesVEdit\r<br />\r<br />[size=4][b][color=#00FF00]Release 24.12.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Source-83096-1-0-2.7z?fid=1000240620&ttl=1535871921&ri=8192&rs=8192&setec=df73a8823655eb533ec6affd6fd7e7cf"
    },
    {
      "fileId": "1000241780",
      "name": "RCRN Patch",
      "version": "1.0.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "77",
      "fileName": "RCRN Patch-83096-1-0-2.7z",
      "uploadedUnix": "1492195845",
      "modVersion": "1.0.2",
      "virusScanUrl": "https://www.virustotal.com/file/fa3bf84b734f74205e271fb10b7341beffd049b1aa51d47c25c5003f56eace95/analysis/1492196107/",
      "changelogHtml": " [size=4][b][color=#00FF00]Release 2.4.2017, Version 1.0.2:[/color][/size][/b]\r<br />\r<br />- fixed error log problem related to taunting a dead actor\r<br />- fixed getting enormous level increase when choosing the &#34;Increase Infusion&#34; perk\r<br />- fixed elder people couldn&#39;t be made essential via dialogue\r<br />- now something for the laughs...I was thinking about implementing a feature for the placeable light sources, to remove and replace them...that&#39;s when I figured I already did so, just forgot to give the corresponding activators a name, hence you couldn&#39;t activate them in game. This is now solved, ergo you can now replace and remove light sources\r<br />- upgraded Frostfall patch to Campfire patch, due to Frostfall no longer touching the wood chopping blocks\r<br />- forwarded fix for SI_TCPatch related to wrong keyword\r<br />- SI uses USLEEP as master now\r<br />- forwarded all changes from USLEEP to main plugin\r<br />- forwarded all changes from USLEEP to patches\r<br />- added missing fix to TC patch\r<br />\r<br />[size=4][b][color=#00FF00]Release 27.9.2015, Version 1.0.1:[/color][/size][/b]\r<br />\r<br />- fixed various child dialogue related bugs\r<br />- added voice support for child interaction\r<br />- fixed various child related bugs due to removal of vanilla keyword\r<br />- fixed bandit/forsworn children size bug\r<br />- updated CUYC patch to new changes\r<br />- added missing crafting stations in Winterhold\r<br />- entirely removed any changes to soulgem in favor to newer and more modern &#34;acquisitive soulgem&#34; Mods\r<br />- added various shared dialogue options to all quests\r<br />- fixed problems related to recruting anyone as follower via dialogue\r<br />- added tag to recruit anyone as follower dialogue, so you know that&#39;s the dialogue of SI\r<br />- added recipe to make gold from gold ingots only(750)\r<br />- added recipe to make gold from quicksilver and corundum(750)\r<br />- added notification when instant killing someone via hotkey\r<br />- fixed bug when following bandit children/children died not clearing alias and restting the global value\r<br />- you can craft forsworn arrowheads from human and troll skulls now\r<br />- added failsafe to recruiting children dialogue, if they are already recruited as follower\r<br />- added dialogue option for unique actors that weren&#39;t tagged as unqiue and thus couldn&#39;t be essentialized\r<br />- expanded the recruit children dialogue to children other then forsworn or bandits\r<br />- cleaned the plugin with TesVEdit\r<br />\r<br />[size=4][b][color=#00FF00]Release 24.12.2014, Version 1.0:[/color][/size][/b]\r<br />\r<br />- initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RCRN%20Patch-83096-1-0-2.7z?fid=1000241780&ttl=1535871921&ri=8192&rs=8192&setec=65ee6a38119e60dcdcfeeca40089b7ee"
    }
  ]
}