{
  "modId": 83091.0,
  "modName": "Antique Dragon ENB",
  "summary": "Antique Dragon is a semi-realistic fantasy preset that combines very atmospheric scenery with the latest cinematic effects. A vibrant and unique style based on the combination of the Somber Antique and Snapdragon ENBs. Full weather support with dynamic clouds from Vivid Weathers and interior lighting from ELFX.",
  "descriptionHtml": "[color=#f9cb9c][b]\n<br />[/b][/color][center][i]\"An ENB, to me, is the window through which we see Skyrim. I am honored that I can be part of that.\" - ZwabberdieBo[/i][/center]\n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-0-1491142148.jpg[/img][/center]\n<br />\n<br />Here are some of the responses from the posts section:\n<br />\n<br />User xsorab2:\n<br />[i][color=#9fc5e8]\"This enb doesn't mess with any game effects like night eye, House of horrors effect, or anything like that...\"[/color]\n<br />[/i]\n<br />User Hamthaak:\n<br />[i][color=#9fc5e8]\"I played with it for some hours now and absolutely love it. And it even runs fine on my olde computee!\"[/color]\n<br />[/i]\n<br />User joan54:\n<br />[i][color=#9fc5e8]\"...this really transforms Skyrim into something really new...\"[/color]\n<br />[/i]\n<br />User WidowPuppy:\n<br />[i][color=#9fc5e8]\"...one of the most unique styles I've ever laid my eyes on...\"[/color]\n<br />[/i]\n<br />User karoshi81:\n<br />[i][color=#9fc5e8]\"Really awesome! Good FPS on geforce960 (without the DoF and SSAO)...\"[/color]\n<br />[/i]\n<br />User Amevenastral9:\n<br />[i][color=#9fc5e8]\"...in game, it was even more than I expected. Such beautiful powerful skies, dreamy reflections as you walk along the water's edge and almost surreal lighting that captures the imagination. Interiors are heavy with atmospheres and true, black shadow..\"\n<br />\"...the preset has literally sparked my creativity...\"[/color]\n<br />[/i]\n<br />User EmSky96:\n<br />[color=#9fc5e8][i]\"This is by far my most favorite ENB. I wanna give you a HUGE thanks! Everything is super easy to adjust but so far I haven't had to adjust a thing. Easiest ENB install I've had to deal with, smooth and no problems. I don't know if it's just the weather or what but where I left off in game it was cloudy and had a darker tone which I freaking love! I love the interiors and caves and dungeons. I couldn't help but snap a million pics off the bat. You have officially made my Skyrim Experience 100x better. Been looking for an ENB like this for long time and by joe you did it. \n<br />VERY performance friendly so if your looking for an fps friendly ENB you just found it. I also wanna thank you for being so helpful! Keep up the amazing work!\"[/i][/color]\n<br />\n<br />[center]A very big thanks to [url=https://forums.nexusmods.com/index.php?/user/30658615-donprotein/]DonProtein[/url]﻿ (Sinitar Gaming) for this video:\n<br />(Antique Dragon starting at [b]13:57[/b])\n<br />[youtube]Jhrbi2tF2W0[/youtube][/center]\n<br />[center]A very very big thanks you to [url=http://www.nexusmods.com/skyrim/users/588817/?]marmotte[/url] for this video:[/center]\n<br />[center][youtube]gg0BPQbqLB0[/youtube][/center]\n<br />\n<br />[color=#9fc5e8][size=3]ANTIQUE DRAGON[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />This ENB preset was initially made for my personal enjoyment. After requests from other users, I decided to upload it to the Nexus. Like with my other mods and collaboration projects,  I always use the principal: share the knowledge.\n<br />\n<br />[color=#9fc5e8]Why another ENB?[/color] I have used the Somber Dreams ENB extensively in the past. An awe-inspiring preset that gives Skyrim a unique fantasy, almost fairy tale like, feeling. Wanting to experience Skyrim differently, I have played with Vividian and Rudy ENB for many months. Each, superb ENBs in their own right. These latter two ENBs are realistic ENBs. So much so, that it was hard sometimes to distinguish a screen shot from a real image. The only thing hinting to it was the obvious cameo of a dragon or troll. But, I wanted to be awe-ed again by burning sunsets, thus began my search...\n<br />\n<br />The past months I have been testing, modding and combining maybe hundreds of ENB presets and lighting/weather mods. No combination could give me what I wanted (see features section below). Except, for one specific combination: Somber Antique with Snapdragon and Vivid Weathers. The first image I made with this combo is the first one of the showcase (see below). It was a revelation. \n<br />\n<br />After that initial shot I got a lot of positive feedback. I wasn't able to release it just yet, as it was only good in some specific weathers/conditions. So, the past weeks I have been extensively modding and tweaking my preset to give you Antique Dragon. For me, personally, the best way I can experience Skyrim.\n<br />\n<br />Not convinced? Checkout my album on Flickr. No need to sign up. Although, if you create an account (with age verification), you be able to see lots more:\n<br />\n<br />  [url=https://www.flickr.com/photos/zwabberdiebo/albums/72157673956964386]Antique Dragon album on Flickr[/url]\n<br />\n<br />Enjoy :)\n<br />\n<br />[color=#9fc5e8]One final word in this introduction[/color]: ENBs are probably as personal as they get. Everything depends on taste. The 'beauty is in the eye of the beholder' comes to mind. Don't criticize how I setup some things in this preset as they all have a purpose and don't ask me to change them. In the past I have always tweaked ENBs to my own liking. If you love this preset, but don't like certain aspects of it.. tweak them. Google, experiment, learn, tweak, share :) \n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-0-1491490808.png[/img][/center]\n<br />[color=#9fc5e8][size=3]FEATURES[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />Antique Dragon has all the features I set out to achive:\n<br />\n<br />[list]\n<br />[*][size=2]A unique look with more vibrant colors in many different environments (soul cairn, black reach, solstheim, etc.)[/size]\n<br />[*][size=2]Fully working night vision[/size]\n<br />[*][size=2]No adaptation in dark areas, where using a bright spell would cause everything else to go black[/size]\n<br />[*][size=2]Very atmospheric interior fog, giving you that creepy feeling when exploring caves[/size]\n<br />[*][size=2]ELFX interior lighting for the best cinematics[/size]\n<br />[*][size=2]The incredible DoF from Snapdragon (disabled by default for smooth game play)[/size]\n<br />[*][size=2]The LUT palette switching ability from Snapdragon[/size]\n<br />[*][size=2]Stunning exterior weather, sunsets and alike where you just want to continue exploring[/size]\n<br />[*][size=2]High quality and life-like skin texture handling[/size]\n<br />[*][size=2]Multiple weather support to take full cinematic advantage of weathers/areas[/size]\n<br />[*][size=2]Wet skin during rainy weathers[/size]\n<br />[/list]\n<br />[color=#9fc5e8][size=3]SHOWCASE[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />Below are some panorama images taken with Antique Dragon. For more images see: [url=https://www.flickr.com/photos/zwabberdiebo/albums/72157673956964386]Album on Flickr[/url] The orignal panoramas are very high quality (3800x1080), the ones below have been shrunken for this showcase. \n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-0-1491137470.jpg[/img][/center]\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-1-1491142148.jpg[/img][/center]\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-2-1491142147.jpg[/img][/center]\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-3-1491142147.jpg[/img][/center]\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-4-1491142147.jpg[/img][/center]\n<br />[center]Many thanks to [url=https://forums.nexusmods.com/index.php?/user/30658615-donprotein/]DonProtein[/url] for these videos:[/center]\n<br />[center][youtube]uzbqsI4uHoc[/youtube][/center]\n<br />[center]Check out this video at [b][size=3]04:14[/size][/b]. The sound volume is a bit low, but great video:[/center]\n<br />[center][youtube]5GCZ4d61mVQ[/youtube][/center]\n<br />[color=#9fc5e8][size=3]REQUIREMENTS[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />Antique Dragon has been tweaked using the following mods, making them a requirement for this preset:\n<br />\n<br />[list]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/73937/?]Vivid Weathers[/url], no special options, [u]with the .esp disabled[/u] resulting in those beaufiful clouds and fogs[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/27043/?]Enhanced Lights and FX[/url], [u]interiors only, without enhancer[/u][/size]\n<br />[/list]\n<br />Keep in mind:\n<br />\n<br />- The exteriors are provided by Vivid Weathers, primarily the dynamic clouds\n<br />- The interiors are handled by ELFX\n<br />\n<br />So, please don't install exterior stuff for ELFX, like sun/weather. Also, as you need to disable (for MO users) or remove (NMM) the Vivid Weather.esp there is no need for other Vividian support esp's.\n<br />\n<br />When you run the installer of Vivid Weathers (probably v1-51), you get a window with several options. One is to select the texture quality, that one is up to you. There are also some check boxes below that, disabled by default. Just leave them as is. You can check alternative add-ons or patches if you want them, but I have not tried them myself. I don't know what kind of changes they will make. After installation, disable or remove the .esp file from Vivid Weathers. This preset doesn't use it, only the textures and scripts from that mod. Just \"untick\" the Vivid Weathers.esp in NMM or MO.\n<br />\n<br />The installer of ELFX gives you several options too. Leave everything on the first page at default values. That will install only the regular ELFX interior plugin, without enhancer/weather/etc. Select any patches you want or need on the Patches page. On the last Optionals page: definitely do not check the ELFX Weathers option, but you can check the candle smoke.\n<br />\n<br />[color=#9fc5e8][size=3]INSTALLATION[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />Installation steps:\n<br />\n<br />[i]Tip[/i]: By default, Windows does not show extensions for known file types. So it is pretty common that where I say \"enbhelper.dll\" or \"skyrimprefs.ini\", you will see \"enbhelper\" and \"skyrimprefs\". You can enable them if you want. How, depends a bit on your Windows version. Do a Google on: how to show file extensions windows\n<br />\n<br />1) Download and extract the Antique Dragon ENB from the files page. Extract everything in your Skyrim game folder:\n<br />\n<br />      Steam&#92;SteamApps&#92;common&#92;Skyrim\n<br />\n<br />2) Download the [url=http://enbdev.com/download_mod_tesskyrim.html]latest ENB[/url] and extract/copy the files [b]d3d9.dll[/b] and [b]enbhost.exe[/b] from the Wrapper directory to your Skyim game folder.\n<br />\n<br />3) Download the [url=http://www.dev-c.com/skyrim/enbhelper/]enbhelper[/url] and extract/copy the file [b]enbhelper.dll[/b] to the [b]enbseries[/b] folder in your Skyrim game folder:\n<br />\n<br />      Steam&#92;SteamApps&#92;common&#92;Skyrim&#92;enbseries\n<br />\n<br />4) Open the file enbbloom.fx.ini in the enbseries folder with Notepad and change the base resolution to reflect the one you are using. By default they have the resolution I use:\n<br />\n<br />[font=Courier New]Base ResolutionX=2560.0\n<br />Base ResolutionY=1440.0[/font][font=Courier New]\n<br />[/font]\n<br />You can also change these values in the in-game ENB menu (enbbloom section).\n<br />\n<br />[u]First time?[/u]\n<br />Make sure to download and install the DirectX 9 Runtimes. They are required by any ENB. For more info, [url=http://wiki.step-project.com/Guide:ENB]check the STEP page[/url]. Look for (find) the section \"CTD on game launch\".\n<br />\n<br />Installing an ENB can be difficult, especially If this is your first. If it is, watch some videos on youtube, so you have an idea what to expect. To make this ENB preset work correctly, you should edit your skyrimprefs.ini and incorporate these values:\n<br />\n<br />[font=Courier New][Display]\n<br />fGamma=1.0000\n<br />iMaxAnisotropy=0\n<br />iMultiSample=0\n<br />bFloatPointRenderTarget=1\n<br />bShadowsOnGrass=1\n<br />bTreesReceiveShadows=1\n<br />bDrawShadows=1[/font][font=Courier New]\n<br />[/font]\n<br />To complete the ENB package, I have included an optional file in the downloads section: my enblocal.ini. Use it for your reference. Of course, you should change the memory settings to your own hardware. See the [url=http://wiki.step-project.com/Guide:ENBlocal_INI/Memory]STEP guide[/url] for that (sections ReservedMemorySizeMb and VideoMemorySizeMb). If you decide to use this enblocal, for example if it is your first ENB, copy this file to your Skyrim game folder, like in step 1 above.\n<br />\n<br />Skyrim users should probably always have the SKSE (Skyrim Script Extender) installed. It is needed by many mods. If you do, make sure you have the [color=#9fc5e8]memory patch[/color] installed too. That greatly increases the stability of your Skyrim. [url=http://www.nexusmods.com/skyrim/mods/51038/?]Check this page[/url].\n<br />\n<br />[color=#9fc5e8][size=3]PERFORMANCE[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />This ENB is not very demanding. I am running this preset, with the normal settings, at 50+ FPS. I have the following hardware: NVIDIA GeForce GTX 980 Ti, Intel Core i7 4790K, 16GB RAM, Windows 10 64-bits. Keep in mind I run at a resolution of 2560x1440. But, as I like my game to be smooth, I have already tweaked the normal preset for optimal performance.\n<br />\n<br />Start by using the default (normal) settings of this ENB. It is my game play setup. If you want more FPS, you can find a performance enbseries.ini included in the main file. It is located in the folder Optional&#92;Performance. Just copy that file over the enbseries.ini in you Skyrim game folder.\n<br />\n<br />[color=#9fc5e8][size=3]RECOMMENDED MODS[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />The following mods are not mandatory, but [u]highly recommended[/u] as they have textures that further enhance this preset: \n<br />\n<br />[list][*][size=2][url=http://www.nexusmods.com/skyrim/mods/9930/?]Revamped Exterior Fog[/url], use it if you experience light distant mountains[/size]\n<br />[*][size=2][url=http://enbseries.enbdev.com/forum/viewtopic.php?f=6&amp;t=1499]Mindflux Particle Patch for ENB[/url][/size]\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/45807/?][size=2]Noble Skyrim[/size][/url]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/2146/?]Serious HD Retexture DARK MOUNTAINS 4096px[/url], from the optional files section[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/59721/?]DynDOLOD[/url], I recommend to use Advanced and set LOD darkness to -6 or -7[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/60220/?]Verdant Grass[/url], use the 1.6 version with the optional dark textures[/size]\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/55518/?][size=2]Real Roads for Skyrim[/size][/url]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/141/?]Skyrim Flora Overhaul v2.5b[/url], without trees (google it)[/size]\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/56877/?][size=2]Skysight - Simply Bigger Trees[/size][/url]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/3812/?]TreesHD Skyrim variation ULTRA NEW[/url], textures only[/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/mods/64267/?]4K Tree and Parallax for Pines by Pfuscher[/url] - clutter for TreesHD, textures only[/size]\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/41076/?][size=2]Realistic Water Two[/size][/url]\n<br />[*][url=http://www.nexusmods.com/skyrim/mods/28642/?][size=2]Ultimate HD Fire Effects[/size][/url]\n<br />[/list]\n<br />Antique Dragon is a [color=#9fc5e8]bit bright for some textures[/color]. If you happen to notice some, like the snow textures, try to find a mod that provides darker textures. Myself, I use some textures from the fantastic [url=http://www.nexusmods.com/skyrim/mods/61995/?]Tamriel Reloaded HD[/url] mod for things like dungeons, stonewalls, farmhouses, etc. If you look in the archive of these texture mods, you will find sub-directories with very descriptive names.\n<br />\n<br />For those interested in [color=#9fc5e8]my personal mod list[/color], check the [color=#9fc5e8]Articles[/color] tab. It is always useful to browse and see how others have setup their Skyrim.\n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/83091-0-1491493085.png[/img][/center]\n<br />[color=#9fc5e8][size=3]CHARACTER LIGHTING[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />I love to play with the mod [url=http://www.nexusmods.com/skyrim/mods/13457/?]Face Light[/url] by [url=http://www.nexusmods.com/skyrim/users/3841389/?]tktk1[/url]. Skyrim originally does a poor job of keeping your character's face lit and beautiful. I have never played a character without it in all the time I've played Skyrim. But, the visual style of Antique Dragon caused Face Light to be too bright. Hence, I have tweaked both the Face Light spell and Face Light Darker spell to match my preset. I was granted permission to provide this darker Face Light as an optional download on the Files page.\n<br />\n<br />Use the Face Light Darker spell for lighter skins, like Fair Skin or if your character has a lighter complexion. I use it for my character Jenna (see images).\n<br />If your character has a darker complexion, or you want your character more glamorous, use the normal Face Light spell.\n<br />\n<br />[color=#9fc5e8][size=3]FAQ[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />[u]Is this mod for Skyrim SE?[/u]\n<br />No, and I probably won't make it available for SE too since the whole concept is different.\n<br />\n<br />[u]How do I enable/disable the ENB?[/u]\n<br />Use the key combination: Shift+F12\n<br />\n<br />[u]How do I open the in-game ENB menus?[/u]\n<br />By default it is: Shift+Enter. With my enblocal.ini from the optional files use: Shift+Backspace (I remapped as the enter key could trigger value editing).\n<br />\n<br />[u]How do I make a screen shot?[/u]\n<br />Use the print screen button. If you use my enblocal, you can also use F11.\n<br />\n<br />[u]The skin of my characters looks bright/dark/red/white/etc.?[/u]\n<br />Every skin texture and ENB combination requires a good sub-surface setting. You can configure them in the in-game ENB menus in the [subsurfacescattering] section. This is usually one of the first things you tweak for your personal setup.\n<br />\n<br />[u]How do I enable the DoF, sunglare and/or lens effects?[/u]\n<br />These effects are present (from Snapdragon), but are [b]disabled[/b] by default for an immersive game play experience. To enable them, open the in-game ENB menus and enable each option in the [Effects] section.\n<br />\n<br />[u]How do I change palettes?[/u]\n<br />This preset is tuned using the [b]Snapdragon palette[/b]. If you want to change it, for example to black and white, open the in-game ENB menu. Go to the enbeffects window and select it from the dropdown list.\n<br />\n<br />[u]Who is that Jenna character in your images?[/u]\n<br />Jenna is my own private character. She is very custom. Almost everything that can be changed is. From her eyes and eyelashes to her skin and bodyslide preset. Of course I will not share this character, nor is she included in the ENB preset.\n<br />\n<br />[u]How do I change the Depth of Field (DoF)?[/u]\n<br />Myself, I always play without DoF and just enable/tweak it when I make screen shots. So the DoF of Antique Dragon is disabled by default. But everyone is different. The DoF especially is hard on your framerate. If you want a good DoF for playing, that doesn't have a lot of impact.. try this. Run the Installer from Vividian ENB.. select the most basic DoF. Specify that you want to install manually.. then the installer places everything in a separate folder. Copy the files enbeffectprepass.fx/enbeffectprepass.fx.ini from it to your own enbseries, overwriting those of Antique Dragon.\n<br />\n<br />To recap: the DoF is usually only made up of 2 files, so you can copy them from any ENB you like the DoF from.\n<br />\n<br />[u]Can I reduce the sharpness of this preset?[/u]\n<br />Yes, you can change almost anything of this preset. It is vey configurable. Remember, if you alter the sharpness some textures will have less details.\n<br />\n<br />Go to the in-game ENB menu. In the shaders window, go to the EFFECT.txt.\n<br />\n<br />[i]Try using a bit lower values for these two, like 0.025\n<br />[/i]- LumaSharpen Clamp - Exterior=0.04\n<br />- LumaSharpen Clamp - Interior=0.035\n<br />\n<br />[i]Try a bit lower range of 0.8 for this one:\n<br />[/i]- Sharp Sampling Range=0.99\n<br />\n<br />[i]And maybe a bit lower for these, like around 1.75:\n<br />[/i]- Sharpening Amount - Exterior=3.25\n<br />- Sharpening Amount - Interior=2.5\n<br />\n<br />Adjust to your liking. If you do, save the ENB profile.\n<br />\n<br />[u]I am looking for slightly more realistic weathers?[/u]\n<br />Check out this add-on mod by [url=http://www.nexusmods.com/skyrim/users/17883229/?]Hildigard[/url]:  [url=http://www.nexusmods.com/skyrim/mods/83288/?]Antique Dragon ENB Sky Tweaks[/url]\n<br />\n<br />[u]My interiors are too dark. How do I brighten them?[/u]\n<br />Keep in mind that this alters ALL interiors, even bright ones. The value in my preset was tweaked during an entire play through and is a good average. But, it also favors cinematic ambience above good visibility. There are many utility light sources: mage spells, torches, etc. Of course, if you want to brighten the interiors a bit.. no problem.\n<br />\n<br />First, make sure all the prerequisites are ok according to the above sections. Also, make sure you have not installed the ELFX Enchancer. This darkens interiors too and also removes all interior fog.\n<br />\n<br />Use the following steps to increase the brightness of interiors:\n<br />\n<br />- Open the in-game ENB menu\n<br />- Go to the [enbeffect] menu\n<br />- Change the value:   Interior CC: White Level\n<br />- Start by lowering (it works in reverse) it to around 0.700\n<br />- If you like it, save the ENB settings\n<br />\n<br />[color=#9fc5e8][size=3]KNOWN ISSUES[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />The lighting in the Ancestor Glade (Dawnguard DLC) and Giant's Grove is too bright. I cannot fix this by changing only the weather settings, it is related to the lighting mod.\n<br />I may not have tweaked all weathers, as there are many. If you come across such a weather, send me the weather ID (from within the in-game ENB menu) and a screen schot with description on what is wrong. Check back for any updates to this preset.\n<br />\n<br />[color=#9fc5e8][size=3]CREDITS AND PERMISSIONS[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />A lot of people in the Skyrim community have contributed their work in the past. Without them I would not have been able to make this preset, nor the wonderful images it renders. \n<br />\n<br />First, and foremost I would like to thank:\n<br />\n<br />[list]\n<br />[*][url=http://www.nexusmods.com/skyrim/users/6531235/?][size=2]Tansarville[/size][/url] as creator of the [url=http://www.nexusmods.com/skyrim/mods/54362/?]Somber series of ENBs[/url]. Without her permission and incredible work this would not have been possible.\n<br />[/list][list]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/users/981329/?]tetrodoxin[/url] for permission to use the DoF adaption and added LUT support from [url=http://www.nexusmods.com/skyrim/mods/70451/?]Snapdragon[/url][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/users/1632043/?]Mangaclub[/url] for permission to use the effect.txt from [url=http://www.nexusmods.com/skyrim/mods/36067/?]Vividian[/url][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/users/5721181/?]Maeldun0[/url] for helping me with the permission to use the enbseries.ini from [url=http://www.nexusmods.com/skyrim/mods/54362/?]Somber Anique[/url][/size]\n<br />[*][size=2][url=http://www.nexusmods.com/skyrim/users/3841389/?]tktk1[/url] for permission to provide a customized version of [url=http://www.nexusmods.com/skyrim/mods/13457/?]Face Light[/url]  [/size]\n<br />[/list]\n<br />A special thanks to:\n<br />\n<br />[list]\n<br />[*][size=2]prod80 for the enbeffect/enbbloom[/size]\n<br />[*][size=2]kingeric1992 for the DoF/lens/sun sprite[/size]\n<br />[*][size=2]Boris Vorontsov for making the ENB. Without you life would be a dull place![/size]\n<br />[/list]\n<br />And:\n<br />\n<br />[list]\n<br />[*][size=2]Amevenastral9 for beta testing the preset. Thanks miss A. and you rock!!! :)[/size]\n<br />[*][size=2]Marmotte for the constructive criticism on the mod page[/size]\n<br />[*][size=2]WidowPuppy for checking my mod page[/size]\n<br />[/list]\n<br />I cannot give permission to others on the files, shaders and code involved, as they are courtesy of the people above.\n<br />\n<br />My final words are to thank each and every modder for making Skyrim the best gaming environment ever. Without modders, experiencing Skyrim the 'Antique Dragon' way, would not have been possible.\n<br />\n<br />[color=#9fc5e8][size=3]OTHER MODS[/size][/color]\n<br />[s][color=#6d9eeb]                                                                                                                                      [s]          [/s]                  [/color][/s]\n<br />\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/81187/?][img]https://staticdelivery.nexusmods.com/mods/110/images/81187-0-1483316836.jpg[/img][/url][/center][center][url=http://www.nexusmods.com/skyrim/mods/81187/?]Daedric Princess Nox - Skin Texture for Custom Race[/url][/center]\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/81004/?][img]https://staticdelivery.nexusmods.com/mods/110/images/81004-0-1482318593.jpg[/img][/url][/center][center][url=http://www.nexusmods.com/skyrim/mods/81004/?]The Veteran Skin - 4K Nude Male Skin with SoS Support[/url][/center]\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/73017/?][img]https://staticdelivery.nexusmods.com/mods/110/images/81004-0-1482318937.jpg[/img][/url][/center][center][url=http://www.nexusmods.com/skyrim/mods/73017/?]Kaylin - Follower[/url][/center]\n<br />[center][url=http://www.nexusmods.com/skyrim/mods/63680/?][img]https://staticdelivery.nexusmods.com/mods/110/images/81004-0-1482318776.jpg[/img][/url][/center][center][url=http://www.nexusmods.com/skyrim/mods/63680/?]Born Dragon Skin[/url][/center]",
  "categoryId": "97",
  "version": "1.133",
  "author": "ZwabberdieBo",
  "createdUnix": "1491505284",
  "updatedUnix": "1492714231",
  "containsAdultContent": false,
  "uploadedBy": "ZwabberdieBo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000240613",
      "name": "My enblocal.ini for your reference",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "My enblocal.ini for your reference-83091-1-0.7z",
      "uploadedUnix": "1491160348",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/23024ac3d546a7678628fb42e66b3ac4dab4fe2057e72f02579a3e91b9f379b9/analysis/1491160623/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/My%20enblocal.ini%20for%20your%20reference-83091-1-0.7z?fid=1000240613&ttl=1535871911&ri=8192&rs=8192&setec=a163c86e1c891610156cd2e37863a95d"
    },
    {
      "fileId": "1000241018",
      "name": "Face Light v2.0 - Darker",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "10",
      "fileName": "Face Light v2.0 - Darker-83091-2-0.7z",
      "uploadedUnix": "1491469512",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/6a4d93c99d19ad5a1ecebff5e6f380c9bc5183577777a3c9a16341a976457d3e/analysis/1491469863/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Face%20Light%20v2.0%20-%20Darker-83091-2-0.7z?fid=1000241018&ttl=1535871912&ri=8192&rs=8192&setec=95d31af3c5d0965be63f15d38ec2a48c"
    },
    {
      "fileId": "1000241019",
      "name": "Antique Dragon ENB v1.133",
      "version": "1.133",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "12811",
      "fileName": "Antique Dragon ENB v1.133-83091-1-133.7z",
      "uploadedUnix": "1491470071",
      "modVersion": "1.133",
      "virusScanUrl": "https://www.virustotal.com/file/ffbbe5f63502ba7cf5a03766571532df68a1298356b9c629ee113b3291de4271/analysis/1491470446/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Antique%20Dragon%20ENB%20v1.133-83091-1-133.7z?fid=1000241019&ttl=1535871912&ri=8192&rs=8192&setec=9ddb115f74602a2a53cd482a5711f0e1"
    },
    {
      "fileId": "1000242290",
      "name": "Antique Dragon Poster",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1823",
      "fileName": "Antique Dragon Poster-83091-1-0.7z",
      "uploadedUnix": "1492714053",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a9c05ba2d028d975ee94d50e8380eeb4193043b128c2950206e50462b5885d5e/analysis/1492714209/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Antique%20Dragon%20Poster-83091-1-0.7z?fid=1000242290&ttl=1535871913&ri=8192&rs=8192&setec=dbf0e10c27d0ee2a27355e0359ef8db0"
    },
    {
      "fileId": "1000242291",
      "name": "Antique Dragon Wallpaper - Wide",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1814",
      "fileName": "Antique Dragon Wallpaper - Wide-83091-1-0.7z",
      "uploadedUnix": "1492714151",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f1334f492e7c3343ce2c6c6479e352d61e6f2f91f835d7ae10e79f709b98a84a/analysis/1492714388/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Antique%20Dragon%20Wallpaper%20-%20Wide-83091-1-0.7z?fid=1000242291&ttl=1535871914&ri=8192&rs=8192&setec=e983d4192321fcc3768debb573b145aa"
    },
    {
      "fileId": "1000242293",
      "name": "Antique Dragon Wallpaper",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1338",
      "fileName": "Antique Dragon Wallpaper-83091-1-0.7z",
      "uploadedUnix": "1492714231",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f453308b2f56c9d328ee69206b53ddf3cbad654f906f2a6e24fa56b82461c3ae/analysis/1492714575/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Antique%20Dragon%20Wallpaper-83091-1-0.7z?fid=1000242293&ttl=1535871914&ri=8192&rs=8192&setec=4a4d19975687a5f5d72207483a54bc3c"
    }
  ]
}