{
  "modId": 83259.0,
  "modName": "gifty gifting",
  "summary": "Give people things until they become your friends and love you and want to follow you around. Customisable&#33; Has support for Immersive Speechcraft&#33;",
  "descriptionHtml": "[center][size=3][b]Requires:[/b] Official DLC, SKSE\r<br />[b]Recommended:[/b] [url=http://www.nexusmods.com/skyrim/mods/63874/?]Immersive Speechcraft[/url], [url=http://www.nexusmods.com/skyrim/mods/74568/?]Relationship Dialogue Overhaul[/url][/size][url=http://www.nexusmods.com/skyrim/mods/74568/?]\r<br />[/url]\r<br />[youtube]iUTY8n-d6Rc[/youtube][/center]\r<br />\r<br />[size=3]A customisable system for giving NPCs gifts, designed as a personal replacement for the gift option in Immersive Speechcraft (patch included). Dialogue included for all non-unique voiced characters, including children and Solstheim residents. \r<br />\r<br />[b]Optional features:[/b]\r<br />[/size][list]\r<br />[*][size=3]Improve your Speech skill[/size]\r<br />[*][size=3]Gradually improve your relationships[/size]\r<br />[*][size=3]Find out the gifts people like the most[/size]\r<br />[*][size=3]Make people like you so much they either want to marry you or follow you to their deaths[/size]\r<br />[*][size=3]Gain the Gift of Charity[/size]\r<br />[*][size=3]Have people equip the things you give them[/size]\r<br />[*][size=3]Limit the total number of gifts you can give out over a certain time period[/size]\r<br />[/list]\r<br />[size=3][b]Caveats:[/b]   \r<br />[/size][list]\r<br />[*][size=3]Using the Immersive Speechcraft patch won&#39;t let you gift kids or people with the Dragonborn voices[/size]\r<br />[*][size=3]Giving money to beggars or drinks to drunks is unchanged, and will still result in a greater increase in relationship than gift giving might in this mod.[/size]\r<br />[*][size=3]A number of vanilla quests will set an NPC&#39;s relationship rank without checking what it already is. A character you&#39;ve raised to ally rank through gift giving may be  reduced to friend rank upon completing a quest for them.[/size]\r<br />[*][size=3]This mod is designed to accept one item as a gift. If you give away a stack or are able to give away multiple things due to script lag, etc., the extra things will be taken but have no additional effects.[/size]\r<br />[*][size=3]Randomisation of NPC gift preferences could probably better. Currently based on Skyrim&#39;s unused gift filters. Pretty much everyone will respond favourably to food.[/size]\r<br />[/list]",
  "categoryId": "24",
  "version": "1.0",
  "author": "hugs",
  "createdUnix": "1492002143",
  "updatedUnix": "1492002143",
  "containsAdultContent": false,
  "uploadedBy": "hhuuggss",
  "primaryFile": null,
  "files": []
}