{
  "modId": 8328.0,
  "modName": "More Snow",
  "summary": "This Mods adds more Snow to Skyrim especially Snow Storms are very Snowy :)",
  "descriptionHtml": "[center][URL=http://imageshack.us/photo/my-images/192/nexustemplate2.gif/][IMG]http://img192.imageshack.us/img192/1209/nexustemplate2.gif[/IMG][/URL]\r\n\r\nMore Rain now comes with a FOMOD scripted installer! A Big Thanks to \\\"KnIgh7 Krawl3r\\\" for working out the FOMOD installer - very nice work! So i could spend more time for updating the mods :)\r\n\r\nThis is no Retexture, this Mod was made with the creation kit and is comptible with every Snow Mod retexture too, so you can download any other Snow Mod retextures from the Nexus to make the Snowflakes even nicer. The Weather is various (as Vanilla), this mod affects the Medium Snow and the Heavy Snow Storm. The Mod comes with four different Versions:\r\n\r\n[b]MoreSnow - Just More Snow :)\r\nMoreSnowWindy - More Snow and WindFX at Snow Storms\r\nMoreSnowWindy75percentLessView - More Snow and WindFX at Snow Storms and decreases view Distance by 75 percent (only when it rains of course)\r\nMoreSnowWindy150percentLessView - More Snow and WindFX at Snow Storms and decreases view Distance by 150 percent (only when it rains of course)[/b]\r\nNote : Please use only one Version at the same time, you cant combine them! \r\n[b]If you used any Version before Version 1.0 delete the old File before adding a new Version.[/b]\r\n\r\nI also recommend [url=http://skyrim.nexusmods.com/downloads/file.php?id=8739]Enhanced Dynamic Weather System[/url] if you want more often Snow!\r\nIf you´re looking for more Snow enhancements you should also take a look at [url=http://skyrim.nexusmods.com/downloads/file.php?id=743]Snow HQ Texture[/url]!\r\n\r\n(Ingame you will see the Effect much better then at the Screenshots)\r\n\r\n[b]Note: [/b]\r\nIf you´re using a Realistic Lightning Mod you have to set the correct load Order. At first load your prefered Lightning Mod, then --> MoreSnow.esp or MoreRain.esp (doesn´t Matter). MoreSnow and MoreRain without extras are fully compatible to any Lightning mod, the Versions with extras such as Windy and WindywithLessView Versions wont work with all Lightning Mods, try out yourself :)\r\nIf you want to use EDWS it also doesn´t matter in wich Order you load the File. The important thing is to load every Lightning mod before MoreRain, MoreSnow or EDWS.\r\n\r\nKnown incompatible Lightning mods at this time :\r\n\r\nDARKER NIGHTS v0_97a ->onflicts with Extra Versions such as MoreSnowWindy/MoreRainWindy. Use only MoreSnow/MoreRain and load after DarkerNights. EDWS is also compatible. \r\n\r\nHow to Install :\r\n\r\nJust pick a Version, copy the File to your Skyrim Data Folder and activate it via the Launcher.\r\nTo Uninstall just untick the File in your Launcher and delete it. \r\n\r\nHave Fun! If you like this Mod, please Endorse so others can see/use it too. [/center]\r\n\r\nFAQ :\r\n\r\n[b]Q: \\\"What the Heck? Rain and Snow falls trough Solid Objects\\\" [/b]\r\nA: There is nothing i can do about it at this time. This \\\"Bug\\\" would also appear without the Mod, but you would not notice so intense, because Vanilla Rain and Snow is much softer! \r\n\r\n[b]Q: \\\"My Background turns to white at Rainstorms, what can i do to fix it?[/b]\r\nA: This is a conflict with another Mod like Realistic Lightning, Dynamic Shadows, or any other\r\nVisual enhancement Mod. Check your load order and load EDWS after any those kind of Mods.\r\nCould also appear when using an ENB Profile.  \r\n\r\n[b]Q: \\\"During Rain or Snowstorms NPC´s are walking around as if it is the sunniest of days, can you fix it please?\\\"[/b]\r\nA: Without a clearly new scripted Weather System this is not possible and sadly i do not have the time to do it. Maybe we will get an Update for the Weather System in the future from Bethesda, so we do not have to create a whole new scripted weather system. \r\n\r\n[b]Q: \\\"Sometimes it Rains or Snows for just a few seconds - Bug?\\\"[/b]\r\nA: This happend to me very very rare, but it has something to do in the way the Weather system works and in the next Updates i will try to fix it to best possible result. \r\n\r\n ",
  "categoryId": "62",
  "version": "1.1",
  "author": "zappoo",
  "createdUnix": "1328736237",
  "updatedUnix": "1330282895",
  "containsAdultContent": false,
  "uploadedBy": "Zappoo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27873",
      "name": "More Snow",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "More Snow-8328.rar",
      "uploadedUnix": "1328813042",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1484a0a277c863bee62ab6d807764c8212399b61185b867da9b1791dff4dff30/analysis/1406664603/",
      "changelogHtml": " Release 1.0 - Added 3 New Versions  and removed the old ones <br/> \n New (Final) WindFX at Snowstorms <br/> \n Fixed too Bright Snow - Now the Snow is white as Vanilla <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Snow-8328.rar?fid=27873&ttl=1535766952&ri=8192&rs=8192&setec=130b7b27592c19a298329c0356e9d4dc"
    },
    {
      "fileId": "28093",
      "name": "Vanilla Snow Version",
      "version": "1.0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "2",
      "fileName": "Vanilla Snow Version-8328.rar",
      "uploadedUnix": "1328835186",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/654d8fe16ace3e4ba7c543fca9645a5206c17a548d8c2f78c2e3777d70611b6c/analysis/1406665623/",
      "changelogHtml": " Release 1.0 - Added 3 New Versions  and removed the old ones <br/> \n New (Final) WindFX at Snowstorms <br/> \n Fixed too Bright Snow - Now the Snow is white as Vanilla <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vanilla%20Snow%20Version-8328.rar?fid=28093&ttl=1535766952&ri=8192&rs=8192&setec=590ba528d2e356898be5681118978f00"
    },
    {
      "fileId": "37213",
      "name": "More Snow 1dot1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "617",
      "fileName": "More Snow 1dot1-8328-1-1.rar",
      "uploadedUnix": "1330282895",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/ddcad12367a293cbec8801bdbe318c7b5a01060c1ccd4b09ef05a089c5c0a76b/analysis/1406715255/",
      "changelogHtml": " No Weather or Gameplay Changes here, just added a FOMOD scripted installer wich was made by KnIgh7 Krawl3r - Thank you very very much! <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/More%20Snow%201dot1-8328-1-1.rar?fid=37213&ttl=1535766953&ri=8192&rs=8192&setec=432aa33b43ee5bca13267b5c07006a52"
    }
  ]
}