{
  "modId": 83345.0,
  "modName": "Android Race - Install Chips",
  "summary": "Play like an android. Craft and install chips to power upgrade yourself.\r<br />Includes 2B Preset in Misc.",
  "descriptionHtml": "[size=5][center][b]Race:[/b] Android Race (YoRHa)[/center][/size][quote][size=3]\r<br />[b]Description: [/b]An Android who was warped into a parallel dimension and landed on Tamriel. YoRHa androids are combat specialists, possessing enhanced stamina, strength and durability, however they do not have health regeneration and no knowledge of magic.[/size][/quote]\r<br />\r<br />[b]Skill Bonus: [/b]15 Archery, Block, Heavy Armor, Light Armor, One-handed, and Two-handed. 10 Smithing.\r<br />[b]Attributes: [/b]250 Health, 50 CPU (Magicka), 250 Stamina, 300 Base Carry Weight, 0 Health and Magicka Regen, and 20 Stamina Regen.\r<br />\r<br />[b]Additional 1: [/b]200 Damage Resist, 50 Magic Resist, 10 Frost and Fire Resist, Immune to Poison and Disease, Immune to Drain Spells, and 50 Shock Weakness. 15 Unarmed Damage.\r<br />[b]Additional 1a:[/b] When CPU is below 10, 0 Magic Resist. 100 Shock Weakness. When CPU is below 5, randomly immobilized. \r<br />\r<br />[b]Additional 2:[/b] Not affected by various common potions and alchemy ingredients. Cannot use spells from all schools (Costs over 9999 to cast). Not affected by some magical enchantments (Mostly Fortify-type). 5% chance to ignore damage from bladed weapons. \r<br />\r<br />[b]Additional 3:[/b] Can craft &#34;Chips&#34; to augment themselves for special situations. Can craft specialized &#34;Potions&#34; to fix themselves.\r<br />\r<br />[b]Additional 4: [/b]Use Berserk to temporarily boost damage at the cost of health. Can Self-destruct.\r<br />-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\r<br />[size=4]Chips[/size]\r<br />[b]Chip Types(Slot): [/b]2 Armor(52), 7 Skin(53), 4 CPU(55), 3 Barrier, 6 Combat, 3 Reactive, 4 Special. Total 27.\r<br />[b]Chip Info 1:[/b] Each chip costs CPU to maintain. Some drains CPU when used.\r<br />[b]Chip Info 2:[/b] Each chip weights a ton but becomes only 1 lbs when installed/worn. (Balancing, until the installing makes a countdown instead)\r<br />",
  "categoryId": "34",
  "version": "0.5",
  "author": "igotnousername",
  "createdUnix": "1492381961",
  "updatedUnix": "1492381961",
  "containsAdultContent": false,
  "uploadedBy": "igotnousername",
  "primaryFile": null,
  "files": []
}