{
  "modId": 83344.0,
  "modName": "All Over Again by leotrote",
  "summary": "Some bat files to help you while replaying Skyrim.",
  "descriptionHtml": "   After 800 hours of Skyrim, we still have places to discover, new quests to be done, play with a new character build or simply test mods . Yeah, I really love replaying Skyrim, but nowdays I just don&#39;t have time or patiencie to do all the quests I want while having to craft hundreds of potions and daggers to level up. \r<br />\r<br />   With that in mind, I decided to search for some bat files that would allow me to reach level 81 quickly. The problem is, they were made for you to \r<br />reach level 81 (of course), but in order to do that, you would level up each skill 100 times, so you will end up with something like this:   \r<br />\r<br />[img]http://i.imgur.com/LtdFcBK.jpg[/img]\r<br />   \r<br />   Notice that you do have all skills at 100, but the experience bar is empty. Well, that really annoys me, since when you use conventional methods to \r<br />level up (without cheating), you get a filled experience bar. That&#39;s when I decided to creat my own bat file, that would allow my to level up each skill to level 99, and then I would normally level up to 100. Doing that, I would have the filled experience bar as it should be.\r<br />\r<br />   In order to do that, I created a file for each race. For example, a Dark Elf starts with 20 at Light Armor, so he/she should only level this skill up 79 times to reach level 99. In the other hand, the same character would only need to level Destruction 74 times, since it starts at 25. When playing as a Nord or an Argonian, the starting skills will be totally diferent and so will be the number of times you should level up each one of them. \r<br />\r<br />   Now, after using one of the files, you will have something like this:   \r<br />\r<br />[img]http://i.imgur.com/gDdyweX.jpg[/img]\r<br />   \r<br />   Notice that my character is at level 80, with each skill at level 99, 79 perks to use and all the Health/Magicka/Stamina points available(of course I \r<br />already used them to take the screenshot). Now you just have to play the game and level up as you would if you were not using any files. In this example, I can craft daggers and gain experience. Notice that the Smithing bar is getting filled.\r<br />\r<br />[img]http://i.imgur.com/q0vW5H6.jpg[/img]\r<br />\r<br />   You just need to download the files and extract the ones you want to your Skyrim folder. In game, you just need to type &#39; and then, &#34;bat [i]race[/i]&#34;.    \r<br />\r<br />   Well, just do like this:\r<br />\r<br />[img]http://i.imgur.com/SptZm9m.jpg[/img]\r<br />   *DO NOT USE &#34;showracemenu&#34;, THAT WAS JUST ME TESTING THE FILES*\r<br />\r<br />   YOUR RACE / WHAT YOU SHOULD TYPE\r<br />\r<br />   Argonian: bat argonian\r<br />   Breton: bat breton\r<br />   Dark Elf: bat darkelf\r<br />   High Elf: bat highelf\r<br />   Imperial: bat imperial\r<br />   Khajiit: bat khajiit\r<br />   Nord: bat nord      \r<br />   Orc: bat orc\r<br />   Redguard: bat redguard\r<br />   Wood Elf: bat woodelf\r<br />\r<br />   IMPORTANT: \r<br />   It will only work with starting skills, so I recommend using right after the binds are cut off.\r<br />   \r<br />   Please, be careful if you want to unlock these achievements:\r<br />\r<br />[img]http://i.imgur.com/qqbAbb8.png[/img]\r<br />   \r<br />   In order to do that. Follow these steps:   \r<br />   1. Load your save\r<br />   2. Type &#39; and bat [i]race[/i].\r<br />   3. Quicksave\r<br />   4. Exit the game.\r<br />   5. Load your save again.\r<br />   6. Choose the Level Up at character menu.\r<br />\r<br />   Well, that´s all you have to kwow about this files. Thanks for downloading :D\r<br />   Feel free to leave an endorsement or report any bugs.\r<br />   \r<br />         \r<br />      \r<br />\r<br />\r<br />\r<br />   ",
  "categoryId": "40",
  "version": "04.17.1",
  "author": "leotrote",
  "createdUnix": "1492372581",
  "updatedUnix": "1492372531",
  "containsAdultContent": false,
  "uploadedBy": "leotrote",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000241975",
      "name": "All Over Again - Bat File",
      "version": "04.17.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "All Over Again - Bat File-83344-04-17-1.rar",
      "uploadedUnix": "1492372531",
      "modVersion": "04.17.1",
      "virusScanUrl": "https://www.virustotal.com/file/685247accb68549609ad67a035315fcf56df44ab3f96a3c6bd7c9728d4d06117/analysis/1492372571/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20Over%20Again%20-%20Bat%20File-83344-04-17-1.rar?fid=1000241975&ttl=1535872185&ri=8192&rs=8192&setec=17ec91a707cff32133dffd640936a251"
    }
  ]
}