{
  "modId": 83377.0,
  "modName": "InigoMCM - Traducao pt_BR",
  "summary": "Tradução em Português Brasileiro para as opções disponíveis no menu MCM relacionadas à Inigo.",
  "descriptionHtml": "Este add-on cria uma página MCM com algumas opções úteis e fornece um atalho dedicado (e configurável) para o poderoso e extremamente útil assobio \r<br />do maravilhoso Inigo, criação de SmartBlueCat.\r<br />\r<br />Inigo também pode vestir Mr Dragonfly em um pote preso no seu cinto (em diferentes posições e tamanhos).\r<br />\r<br />\r<br />A versão 2.5 é uma pequena atualização que faz o pote de MrD visível por padrão (quando você inicia um novo jogo). Também deixa o mod mais fácil de traduzir.\r<br />\r<br />(Se você atualizou para a versão 2.4 ou você não é capaz de remapear o atalho de assobiar, me desculpe pois houve um erro de digitação no script.)\r<br />\r<br />\r<br />[size=3][b]*** NOTA ESPECIAL DE ATUALIZAÇÃO ***[/b][/size]\r<br />\r<br />Ao atualizar a partir da versão 1.0 de InigoMCM, certifique-se de remover o arquivo antigo em Skyrim&#92;Data&#92;Scripts&#92;InigoMCMScript.pex. Seu gerenciador de mods (NMM ou outros) deve cuidar disso para você, mas se o arquivo antigo do script não for removido, você não verá as novas opções na página MCM de Inigo.\r<br />\r<br />\r<br />[size=3][b]O atalho de Assobio[/b][/size]\r<br />\r<br />[list]\r<br />[*]O atalho de assobio (X por padrão) permite-lhe comunicar com Inigo e lhe permite continuar a usar seus gritos e outros poderes sem medo de se esquecer de trocar de volta e por acidente gritar em alguém quando você queria assobiar para Inigo.\r<br />[/list]\r<br />[list]\r<br />[*]Além dos recursos de assobio normais, se você usar o atalho enquanto você tem uma cadeira na mira, Inigo verá que você quer que ele sente sem que você precise ativar manualmente a cadeira. (Isso é uma conveniência muito menor porque você pode obter o mesmo efeito de poder de assobio, olhando  para baixo, assobiando e em seguida, clicando na cadeira.)\r<br />[/list]\r<br />[size=3][b]Pote de Mr Dragonfly[/b][/size]\r<br />\r<br />[list]\r<br />[*]A opção Mr Dragonfly permite que você decida se Inigo coloque ou não Mr Dragonfly no seu cinto. Você pode alternar entre as 4 opções  diferentes de posição, mas você precisa sair do MCM para ver a mudança.\r<br />[/list]\r<br />[b][size=3]Corcel Leal de Inigo[/size][/b]\r<br />\r<br />  * A opção Permitir Corcel aqui pode ser usada para deixar Inigo saber se a localização atual (não do seu cavalo) é um lugar que ele pode montar\r<br /> em seu cavalo. Quando você diz que a localização permite cavalos, seu corcel será teletransportado até ele. Se você disser que cavalos não são permitidos, seu cavalo será teletransportado para casa. (Observe que o mundo principal de Skyrim permite cavalos, mas usando a opção lá, irá trazer seu cavalo para ele, se ele não estiver por perto e enviá-lo para casa se ele estiver. Isso dá um bom jeito de mover seu cavalo se ele ficar preso ou estiver bloqueando seu caminho.)\r<br />\r<br />    Esses mesmos recursos estão disponíveis com os comandos do console:\r<br />    setpqv InigoStatus steed allow\r<br />    setpqv InigoStatus steed forbid\r<br />    setpqv InigoStatus steed summon\r<br />    setpqv InigoStatus steed stable\r<br />\r<br />  * Você pode ajustar a configuração Velocidade do Corcel Leal se Inigo estiver com dificuldade em acompanhar você enquanto estiver montado.\r<br />\r<br />\r<br />[b][size=3]Opções Avançadas:[/size][/b]\r<br />\r<br />  * Há quatro opções avançadas e todas devem ser usadas cautelosamente. Os valores atuais mostrados sempre incluem ajustes baseados em magias, encantamentos e armaduras desgastadas.\r<br />\r<br />  * Definir a velocidade de Inigo como uma porcentagem em relação a outros NPCs. Se ele estiver com dificuldade em manter-se com você no padrão de\r<br />    115%, então aumente o valor. Este é o mesmo que o comando de console &#34;ForceAV SpeedMult 115&#34;.\r<br />\r<br />  * As pessoas têm idéias muito diferentes sobre carga, então você pode mudar a Capacidade de Transporte de Inigo em uma faixa bastante ampla.\r<br />    Se os valores permitidos ainda não são suficientes, você sempre pode usar o comando equivalente do console &#34;ForceAV CarryWeight 300&#34;.\r<br />\r<br />  * Algumas pessoas acham que Inigo é muito poderoso e outros pensam que ele é muito fraco. Você pode ajustar o Dano de Ataque de Inigo e também a\r<br />    Resistência à Danos de Inigo. Se você for usar o comando correspondente no console, note que no console o valor equivalente à 120% de dano de ataque\r<br />    seria &#34;forceav AttackDamageMult 1.2&#34;. Como o valor da resistência ao dano inclui qualquer armadura usada, é melhor mudá-lo enquanto ele                       está relaxando (e não usando armadura). O comando correspondente no console é &#34;setav DamageResistance 0&#34;.\r<br />\r<br />\r<br />[size=3][b]Usar Apenas em Emergência:[/b][/size]\r<br />\r<br />  * Estas quatro opções não devem ser usadas a menos que você esteja tendo sérios problemas. Poderiam todas serem feitas no console, mas você teria que procurar os códigos FormId.\r<br />\r<br />  * Invocar Inigo agora move-o até você e tenta restaurá-lo para resolver quaisquer problemas (como voar pela sala ou andando sob o\r<br />    solo). Você terá que experimentar isso algumas vezes se as coisas estão realmente quebradas. Mas observe que isso pode\r<br />    invocá-lo mesmo quando você não seja capaz de invocá-lo. Não trate isso como um substituto para o feitiço Invocar Inigo.\r<br />\r<br />  * Algumas pessoas não perceberam o quanto é importante para Inigo esse pequeno inseto dentro do pote. Se você perdeu o MrD, tente a\r<br />    opção Invocar Mr Dragonfly.\r<br />\r<br />  * O arco favorito de Inigo e vários livros podem ser perdidos ou destruídos. Se você realmente os perdeu, escolhendo a opção Recuperar Arco de Inigo irá colocar uma cópia do seu arco de volta em seu inventário. Recuperar Livros de Inigo irá colocar uma cópia dos livros especiais que você perdeu no seu inventário. (Existem alguns livros que estão disponíveis apenas após uma certa etapa de sua missão. Eles não serão adicionados se você executar esse comando antes desse ponto.)\r<br />\r<br />\r<br />[size=3][b]MOD&#39;s POTENCIALMENTE CONFLITANTES[/b][/size]\r<br />\r<br />Nenhum mod SKSE além dos que possam usar o mesmo atalho, mas você pode remapear o Atalho de Assobio ou desativá-lo se quiser.\r<br />\r<br />Embora não seja um conflito real, Inigo não pode usar ao mesmo tempo o pote de Mr Dragonfly com um dos potes de vagalume de Chesko ao mesmo tempo. Como um Khajiit, Inigo já tem visão noturna, então por que você não usa a lanterna e deixa ele usar o Mr Dragonfly?\r<br />\r<br />\r<br />*********************************************************************\r<br />\r<br />[b][size=3]CRÉDITOS E PERMISSÃO[/size][/b]\r<br />\r<br />Este mod implementa as idéias de Eolhin e SmartBlueCat. A fonte do script incluído e você pode fazer mudanças pessoais, mas você não pode redistribuir\r<br />este mod ou quaisquer derivados disso sem a minha permissão ou a permissão de SmartBlueCat.\r<br />\r<br />Os potes de MrD&#39;s são adaptações dos potes de vagalume de Chesko e usados com permissão. Obrigado, Chesko.\r<br />\r<br />Agradeço à Mur4s4me pela maravilhosa captura de tela das opções de MrD.\r<br />\r<br />\r<br />\r<br />Charles Cooley\r<br />cdcooley@fastmail.us\r<br />cdcooley nos fóruns NexusMods e Bethesda",
  "categoryId": "66",
  "version": "2.5",
  "author": "Nuubi",
  "createdUnix": "1492574538",
  "updatedUnix": "1492602866",
  "containsAdultContent": false,
  "uploadedBy": "Nuubi",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000242212",
      "name": "InigoMCM_v2.5",
      "version": "2.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1768",
      "fileName": "InigoMCM_v2.5-83377-2-5.7z",
      "uploadedUnix": "1492602866",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/818dc07e3c0da2e1c9ab436f428b5ad5757f90db80c6db9cffcdf6ce28b93d4c/analysis/1492603088/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/InigoMCM_v2.5-83377-2-5.7z?fid=1000242212&ttl=1535872214&ri=8192&rs=8192&setec=dd331836cdd9a7afd6b3f8d2b4f2a3ff"
    }
  ]
}