{
  "modId": 83520.0,
  "modName": "Imperial Dragon Armour",
  "summary": "This mod adds the Champion of Cyrodiil armour that you get at the end of Oblivion, for completing the main quest line. Only you will be able to make this armour, so wild NPC&#39;s will be running around in it. ",
  "descriptionHtml": "[img]http://i.imgur.com/cmsvzHn.png[/img]\r<br />[size=3][font=Verdana][center][color=#ff0000]THIS DOES NOT REPLACE ANY ARMOUR&#33;[/color][/center]\r<br />\r<br />[color=#bf9000]The highly prestigious and decorative Imperial Dragon armour was once made for and worn by the Emperor&#39;s of the Tamrielic Empire. Tiber Septim was the first to wear the armour since then his heirs carried on the tradition, until Martin perished fighting during the Oblivion Crisis. Chancellor Ocato commissioned a piece of the prestigious armour to be made for the &#34;Hero of The Oblivion Crisis&#34; Bendu Olo and thus by doing so breaking the centuries old tradition. \r<br />\r<br />Imperial Dragon Armour only comes as heavy armour unfortunately. There is a light armour, but this can cause issues; so it is recommend that you do not craft or wear the light armour.   \r<br />[/color][/font][/size][color=#bf9000][img]https://i.imgur.com/8X1ykS6.png[/img][size=3][font=Verdana]\r<br />Skyforge is the only place you will be able to craft this piece of armour, but you will be able to upgrade it anywhere else. You will need Daedric smithing in order to craft it, this is apart of the lore so don&#39;t complain. For those who don&#39;t know where Skyforge is, you should be ashamed if you don&#39;t, it is next to the Jorrvasker. The Jorrvasker is the big boat house to the right of the Gildergreen.[/font][/size]\r<br />[img]https://i.imgur.com/jwBAd9H.png[/img]\r<br />[font=Verdana][size=3]If you already know how to install mods without NMM then enjoy the mod&#33; For those who don&#39;t follow this:\r<br />\r<br />[/size][list=1]\r<br />[*][size=3]Extract the files to SteamApps&#92;Common&#92;Skyrim&#92;Data[/size]\r<br />[*][size=3]Start your Skyrim through Steam (Don&#39;t start with SKSE) or NMM and make sure the mod is checked[/size]\r<br />[*][size=3]You should be good to go once it&#39;s checked [/size]\r<br />[/list][img]https://i.imgur.com/rb0e6oC.png[/img]\r<br />Massive thank you to [url=https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwjuwM3nyMXTAhXnCcAKHYxdBDAQuAIIKDAA&url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DC5xRkO93vqg&usg=AFQjCNGFD22uNLfsFJqn9sRyIFeNsN0Yeg&sig2=2k5oruRbx7R1s3PktaPNAg]Nightasy Tutorials[/url] in teaching me how to port armour from Oblivion to Skyrim.[/font][/color]",
  "categoryId": "54",
  "version": "",
  "author": "CosmicScorpion17",
  "createdUnix": "1493329948",
  "updatedUnix": "1493329948",
  "containsAdultContent": false,
  "uploadedBy": "Cosmicscorpion17",
  "primaryFile": null,
  "files": []
}