{
  "modId": 83557.0,
  "modName": "Lost Relics of the Divines ACT II",
  "summary": "Lost relics hidden in time.",
  "descriptionHtml": "[left][font=Lucida Sans Unicode][size=6][/size][/font][/left][center][font=Lucida Sans Unicode][size=6]Lost Relics of the Nine Divines[/size]\r<br />[size=4]By: C0N0R[/size]\r<br />\r<br />[/font][font=Lucida Sans Unicode][b][size=5]ACT I\r<br />Lost In Time[/size]\r<br />\r<br />[/b][size=4]The Elder Scrolls, Prophecies written by the unknown, fulfilled by heroes and men alike. Each scroll vastly different in its own way, one may tell of the return of a great beast; while another may tell of the destruction of Nirns greatest light. Some scrolls revealing the locations of various holy artifacts hidden around Nirn, said to be forged by the Divines themselves.[/size]\r<br />\r<br />[size=4]A set of holy armor said to be lost in time, forged by the ancient warrior Yngol; the brother of the infamous Ysgramor. The armor in question worn by very powerful being, used to protect the Atmorans from the Snow Elves during the Night of Tear&#39;s massacre. With the fall of these people, and the retreat of the three brothers, Yngol returned his armor to the flame; melting it down and using it to create a great sword of power. The Divines however did not wish this to unfold, reforging the armor and blessing it. The armor now rests in the Hall of Valor, a grand hall in the fabled Sovngarde resting place; the armor waiting to be reunited with its creator.[/size]\r<br />\r<br />[size=5]ACT II\r<br />[/size][/font][b][size=5]From the depths of Nirn\r<br />[/size][/b]\r<br />[size=4]The Dwemer, an old but not forgotten race. All across the lands, dwemer ruins lay idle; Animunculi inside awaiting their masters return. The second elderscroll in our story tells of an artifact hidden in a great underground city, constructed by an ancient race. The scroll tells us that &#34;Under the subterranean sun Lies the heart  of the bluest sky.&#34; Researchers understand this heart to be an item made from the very material the Dwemer began underground excavation for; Aetherium. This material, unable to be handled by even the strongest smith; Only the lost Aetherium Forge can be used to form this crystalline material. The scroll tells us that this artifact was to be handed to Kagrenac, the chief architect of the dwemer. \r<br />\r<br />Unfortunately, the artifact in question was unable to be delivered as the siege of black mountain began; just as the forging was concluded. Kagrenac&#39;s attempt to grant Immortality to his people did not unfold as planned; the method backfiring and wiping his people from the mortal plane of Nirn. Ghostly shells of the once vibrant cities now remain, teeming with priceless artifacts and rich history. No one is sure what form the artifact takes as all expeditions to the underground city have been fatal.[/size]\r<br />[font=Lucida Sans Unicode]\r<br />\r<br />\r<br />[size=4][u]MORE TO BE ADDED[/u][/size]\r<br />\r<br />[b]\r<br />What is this mod?:\r<br />[/b]\r<br />This mod is an ongoing story mod, each update bringing more lore and more unique items to the lands of skyrim. Currently only 5 items are in the mod, a unique sword that was forget out of Aetherium, and a full set of armor blessed by the divines.\r<br />[b][size=6]\r<br />\r<br />F.A.Q\r<br />[/size]\r<br />[size=5]How do I get this armor?:[/size]\r<br />[/b]\r<br />Prior to defeating alduin... perhaps explore the hall of valor a bit more. (unique enchanted variant)\r<br />Or....\r<br />Craft at any smithing station (Regular &#39;Frosty&#39; Variant)\r<br />\r<br />In blackreach, look to the grand light in the sky and unleash your voice. After the battle, collect your reward from your fallen foe.\r<br />\r<br />I do not condone cheating these items in, but if you wish to you can teleport to sovngarde to get the armor; and travel to blackreach and defeat the dragon to gain the sword.\r<br />\r<br />[size=5][b]What&#39;s with the story?:[/b]\r<br />[/size]\r<br />This is going to be a multi-part mod, each act will bring a new addition. Weapons, misc items, other artifacts.\r<br />\r<br />[size=5][b]Can you change the colors of the glow?:[/b]\r<br />\r<br />[/size]This is already planned for future versions\r<br />\r<br />[size=5]Are these items overpowered... or not lore friendly?:\r<br />[/size]\r<br />No, these items are not overpowered; nor are they not lore friendly.[/font]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[size=5][font=Trebuchet MS]SSE VERSION [url=http://www.nexusmods.com/skyrimspecialedition/mods/3275/?]HERE&#33;&#33;&#33;[/url][/font][/size][/center]",
  "categoryId": "54",
  "version": "1.0",
  "author": "C0N0R",
  "createdUnix": "1493511672",
  "updatedUnix": "1493511667",
  "containsAdultContent": false,
  "uploadedBy": "C0N0R",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000243036",
      "name": "PLACEHOLDER FILE",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "PLACEHOLDER FILE-83557-1.rar",
      "uploadedUnix": "1493511667",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/30cbdc8b7afd4e079e93f1666220080b31a9b177f4d94ddcc1e5555fb8821f41/analysis/1493511961/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/PLACEHOLDER%20FILE-83557-1.rar?fid=1000243036&ttl=1535872391&ri=8192&rs=8192&setec=e5426407b435acab429d6961bcb028ee"
    }
  ]
}