{
  "modId": 83588.0,
  "modName": "Vero Darke the Virtuous Vampire - Full Voiced",
  "summary": "A Standalone Follower MOD with custom voice\r<br />Vero Darke is an ancient vampire who feeds on the blood of the freshly deceased. Having bettered his ways, he refuses to feed on the living. \r<br />Bored out of his mind due to his self-imposed lifestyle, Vero is ready to head out for adventure, and will consider following anyone he would deem worth",
  "descriptionHtml": "[size=3][b]Strange things have been happening in Whiterun&#39;s Hall of the Dead. Fresh corpses have been drained of their blood. Bite marks in the throat seem to indicate the obvious. Andurs, the resident priest of Arkay that cares for these corpses hasn&#39;t reported these happenings to the Jarl, however. He is quite aware of the reason behind these drainings.An ancient vampire going by the name of Vero Darke has found refuge in these halls, feeding on the stale blood of corpses to keep him on his feet. \r<br />\r<br />Vero had been making Tamriel unsafe for centuries, and would have continued to do so if it weren&#39;t for the Dawnguard, who hunted him down and wounded him gravely. \r<br />He had been forced to retreat and hide in the catacombs of the Hall of the Dead in Whiterun, where he fed on low-grade blood to keep him from succumbing to his wounds.\r<br />Andurs found him one day, defiling the corpse of a young woman he had just given her last rites. \r<br />\r<br />Instead of reporting him, however, Andurs took him in and allowed Vero to continue his acts. He helped him as he understood that Vero was trying to better his ways. No longer did the vampire seek to feed from the living, and instead settled for older blood. \r<br />\r<br />As time passed, the vampire recovered, but the seclusion of his new way of life cared for it that his great skill in combat ended up in disuse.\r<br />More than that, Vero became bored. He is more than ready to head out for adventure once more to rekindle his spirits and his skills, and will consider following anyone that he would deem worthy of his presence. \r<br />Are you ready to find out if you are?\r<br />[/b][/size][img]http://i.imgur.com/Yng7iAp.jpg[/img]\r<br />\r<br />[size=4]+ Require Dawnguard[/size]\r<br />[size=5]\r<br />+Location : Read LORE[/size]\r<br />\r<br />[size=4]+ 2 Version:\r<br />\r<br />   -Custom Voiced [/size][size=2]( Incomplete + not compatible with EFF ; for UFO AFT i dont use so i dont know )[/size][size=4] ( NOT UPLOADED YET ) \r<br />   -Dark elf vanilla voice type [/size][size=2]( EFF compatible )\r<br />[/size]\r<br />[size=2]\r<br />\r<br />[/size][size=6][u][b]+He have another armor style in his inventory look it up+[/b][/u][/size]\r<br />[size=4]+ Stat info :\r<br />   [/size]-Level scale with player\r<br />   -Main skill : Destruction/illusion &gt; Onehand ( no dual wield ) &gt; alteration/restoration &gt; bla bla\r<br />   -Perk : pretty much like the player with spell and onehand sword build\r<br />   -Spell : Spark/Bolt/Chain ; Life Drain/harkon ; Ward ; Flesh ( Oak etc ) ; fear ; calm ; heal/fast/grand/other ; bats ; waterwalking (  some of them are     leveled so u dont have to give him higher tier spell )\r<br />   -He will get into adrenaline mode when HP hit 50% small HP / stamina buff and mana regen and he will emit black smoke.\r<br />\r<br />[size=4]Credits:[/size]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/58443/?]SkySight Skins[/url] - Fading Signal\r<br />[url=http://www.nexusmods.com/skyrim/mods/4141/?]High Res Face Maps for Men[/url][size=3] - Geonox[/size]\r<br />[url=http://www.nexusmods.com/skyrim/mods/30411/?]Brows[/url][size=3] / [/size][url=http://www.nexusmods.com/skyrim/mods/28363/?]Beards[/url][size=3] - [/size][b]Hvergelmir[/b]\r<br />[size=3]Armor Models/textures - From Software and Ubisoft :)))\r<br />Voice - Elias Toufexis\r<br />[/size]\r<br />[size=4]+ PERMISSION : NEIN but u can upload to other site[/size]",
  "categoryId": "66",
  "version": "1.0",
  "author": "Guilaster",
  "createdUnix": "1493603589",
  "updatedUnix": "1493603589",
  "containsAdultContent": false,
  "uploadedBy": "Guilaster",
  "primaryFile": null,
  "files": []
}