{
  "modId": 83613.0,
  "modName": "Remember The Old Ways III - Reclamations and House of Troubles",
  "summary": "Remember The Old Ways III is the third of the series that aims to add lore-friendly shrines and, consequently, new blessings to the game. It modifies the Reclamations blessings at Raven Rock Temple and also adds a new location, Attius Farm Basement, an underground sanctuary dedicated to the daedra of the House of Trobles. The basement comes with 4 ",
  "descriptionHtml": "[size=5][size=5][size=5][size=5][font=Comic Sans MS][color=#674ea7]INTRODUCTION[/color][/font][/size][/size][/size][/size]\r<br />[b]Remember The Old Ways[/b] aims to improve gameplay in a lore-friendly way. This time, the fellow dovah, as a dark elf (or not), can now worship the good daedra from the Reclamations as well as the bad ones from the Four Corners of the House of Troubles. The shrines can be found at Raven Rock temple and inside a new location, the Attius Farm Basement at the Old Attius Farm, where you first encounter Captain Veleth in Solstheim, so yes, it [u][b]requires the Dragonborn DLC[/b][/u].\r<br />\r<br />The blessings are well-balanced, so they&#39;re neither useless nor overpower. Because of its percentage values, these buffs are useful both in early and late game. This particulary version comes with a different blessing system that adds a blessing and a curse to the player. Explained with more detail below.\r<br />\r<br />[size=5][font=Comic Sans MS][color=#674ea7]DUNMERI PANTHEON[/color]\r<br />[/font][/size]The destruction of Vivec City and the fall of the Ministry of Truth, cut deeply into the ancient religious beliefs of the Dunmer, finishing off the [url=http://elderscrolls.wikia.com/wiki/Tribunal]Tribunals[/url] worship. Now, with the Tribunal out of the way, the [url=http://elderscrolls.wikia.com/wiki/Dissident_Priests]Dissident Priests[/url] reestablish the worship of the &#34;good daedra&#34; venerated by their ancestors as the true gods of the Temple; the &#34;true way&#34;. They&#39;re called [url=http://elderscrolls.wikia.com/wiki/The_Reclamations]Reclamations[/url] since they&#39;re reclaiming their status from the Tribunal.\r<br />\r<br />Like almost every other religion or religious tradition out there, there&#39;s a &#34;good side&#34; and a &#34;bad side&#34;. To the dunmer, the &#34;bad side&#34; is the [url=http://elderscrolls.wikia.com/wiki/The_House_of_Troubles]House of Troubles[/url]. A group of daedric princes that rebelled against the Tribunal, causing turmoil among the clans and Great Houses. Although their worship was forbidden by the Tribunal, the House of Troubles is a holy group of daedra, which serve the role of obstacles during &#34;the testing&#34;, that one can only assume is the mortal life of a dark elf.\r<br />\r<br />[font=Comic Sans MS][color=#674ea7][size=5]SO, WHAT&#39;S NEW?[/size][/color][/font]\r<br />Blessings of the Reclamations in the Temple of Raven Rock were tweaked - since they were quite weak and are limited to that location - and will also grant additional benefits from the dunmer racial power Ancestor&#39;s Wrath. Other than that, no changes to it; they will still be given by the shrines located inside the temple.\r<br />\r<br />What&#39;s really new are the blessings of the House of Troubles, that, since are supposed to test the dunmer, takes something in exchange for a benefit. It&#39;s a different system to a shrine, but I don&#39;t think there&#39;s a better way to worship a god considered harmuful by most. In this case, power does come with a price.\r<br />\r<br />[font=Comic Sans MS][color=#674ea7][size=5]THE SHRINES[/size]\r<br />[/color][color=#674ea7][size=4][u]The Reclamations:[/u][/size][/color]\r<br />[/font][b][color=#8e7cc3]Azura:[/color][/b] Goddess of Dusk and Dawn, one of &#34;the three&#34; of the &#34;true way&#34;. Azura was the god-ancestor that taught the Chimer the mysteries needed to be different than the Altmer. Some of her more conventional teachings are sometimes attributed to Boethiah. In the stories, Azura is often more a communal cosmic force for the race as a whole than an ancestor or a god. By Azura&#39;s Protection you will gain [u]+20% magic resistance and 10% spell absorption. And, if you are a dark elf, your Ancestor&#39;s Wrath power will increase your armor rating by 50%.[/u]\r<br />\r<br />[b][color=#8e7cc3]Boethiah:[/color][/b] Prince of Plots and the original god-ancestor of the Dark Elves. Through the illuminations of Boethiah, the Chimer (ancestors of the dunmer) renounced all ties to the Aldmer and founded a new nation. All manner of Dark Elven cultural advances are attributed to Boethiah, from philosophy to magic; everything. Those under the sign of the Dunmer&#39;s patron-god will [u]do +15% of both weapon and spell damage. Ancestor&#39;s Wrath is 20% more powerful.[/u] \r<br />\r<br />[b][color=#8e7cc3]Mephala:[/color][/b] The Webspinner, or the Spider God. Founder of the Morag Tong. Mephala was the ancestor that thaught the Chimer the skills they would need to evade their enemies or to kill them with secret murder. In those days, enemies were numerous since the Changed Folk were a small nation. Mephala, along with Boethiah, organized the clan systems that eventually became the basis for the Great Houses. Blessed by Mephala, your [u]speechcraft as well as your sneaking are 15% better. Ancestor&#39;s Wrath increases attributes regeneration.[/u]\r<br />[color=#674ea7]\r<br />[font=Comic Sans MS][size=4][u]The House of Troubles:[/u][/size][/font][/color]\r<br />[b][color=#8e7cc3]Malak:[/color][/b] The ex-aedra, the god-king of the orsimer. Malacath, or Malak, as the dunmer call him, is a weak but vengeful god. He tests the dunmer for physical weakness. Those greedy, reckless or mad whom serve him will have to [u]sacrifice 100 of armor rating for +20% of melee damage.[/u]\r<br />[b]\r<br />[color=#8e7cc3]Sheogorath:[/color][/b] King of madness. In many legends Sheogorath is called upon by one Dunmer faction against another; in some of these stories he does not betray those who called him, further confusing the issue of his place in the scheme of things (&#34;Can he help us?&#34; &#34;Is he not an obstacle?&#34;). He is often associated with the fear other races have of the dark elves. He tests the dunmer for mental weakness. Under the sign of madness, you will have to [u]sacrifice 50% of magic resistance for illusion spells 25% more powerful.[/u]\r<br />\r<br />[b][color=#8e7cc3]Molag Bal:[/color][/b] The King of Rape. To the dunmer, Molag Bal is the extreme opposite of Boethiah, his archenemy. He is the main source of the obstacles to first the Chimer and now the Dunmer people. In the legends, Molag Bal always tries to upset the bloodlines of the Great Houses or otherwise ruin dumeri &#34;purity&#34;. It is said that he seduced Vivec and generated a race of monsters that inhabit the Molag Amur region of Morrowind. The mad that serve Molag Bal will have to [u]sacrifice 20% of damage for a 15% faster improvement of skills.[/u]\r<br />\r<br />[b][color=#8e7cc3]Mehrunes Dagon:[/color][/b] God of Destruction. To the dunmer, he is associated with natural dangers like fires, earthquakes and floods. To some he represents Morrowind itself; harsh and inhospitable. He tests the dumer will to survive and persevere. By the will of Mehrunes Dagon you must [u]sacrifice 50 points of health, magicka and stamina for a raise of their regeneration by 100%.[/u]\r<br />\r<br />[size=5][font=Comic Sans MS][color=#674ea7]TEMPLE FEATURES[/color]\r<br />[/font][/size]\r<br />[list]\r<br />[*][size=4]Shrines with unique buffs[/size]\r<br />[*][size=4]Lightable braziers - just equip the flames spell and fire them up[/size]\r<br />[*][size=4]Safe storage - The temple is NOT a player home, but every container inside is safe[/size]\r<br />[/list]\r<br />[font=Comic Sans MS][color=#674ea7][size=5]POSSIBLE F.A.Q.[/size][/color][/font]\r<br />[b][color=#8e7cc3][size=2]1 - &#34;Why Molag Bal&#39;s blessing grants skill improvement?&#34;[/size][/color][/b]\r<br />Mainly, I have no idea. But it seemed fair to me, since you&#39;re sacrificing damage, to have a very good thing in exchange. Any better ideas are mostly appreciated. Besides, interpreting the possible daedric blessings could be very hard, since they just wanna watch the world burn.\r<br />\r<br />[b][color=#8e7cc3][size=2]2 - &#34;Why the benefitial effects from the House of Troubles display red on the magic effects tab?&#34;[/size][/color][/b]\r<br />That&#39;s just a glitch of the Creation Kit, don&#39;t worry, it&#39;s just visual, you will still receive the benefitial effects.\r<br />\r<br />[b][color=#8e7cc3][size=2]3 - &#34;Ok, I can now understand why there&#39;s a shrine to Alduin, but why is there one devoted to Orkey if he was an enemy god to the ancient nords?&#34;[/size][/color][/b]\r<br />Because there was no other god suitable to give thief-related buffs. Who&#39;s better to do so than the &#34;Trickster&#34;? And he is also part of the pantheon.\r<br />\r<br />[b][color=#8e7cc3][size=2]4 - &#34;Aren&#39;t the buffs a little overpower?&#34;[/size][/color][/b]\r<br />That will depend on the opinion of each player and his mod selection. But I personally think they&#39;re not, since a low level player wouldn&#39;t get access to them so easily...\r<br />\r<br />[font=Comic Sans MS][color=#674ea7][size=5]MOD VERSIONS[/size][/color][/font]\r<br />[font=Trebuchet MS]The mod comes in two different versions: one with a 8 hours blessing duration and another with a 12 hours blessing duration. Choose ONLY ONE.[/font]\r<br />\r<br />[size=5][font=Comic Sans MS][color=#674ea7]INSTALLATION AND COMPATIBILITY[/color][/font][/size]\r<br />[b][color=#8e7cc3][size=3]Installation:[/size][/color][/b] If installing with the nexus, download your preferred file and install it. If installing manually, download the preferred file, then place it in your data directory. \r<br />\r<br />[b][color=#8e7cc3][size=3]Uninstallation:[/size][/color][/b] Remove your loot from the containers and remove any blessing attached to your character and you&#39;re good to go. If using the nexus deactivate it or, if manually, remove the .esp from your data directory.\r<br />\r<br />[b][color=#8e7cc3][size=3]Compatibility:[/size][/color][/b] Compatible with every other mod that doesn&#39;t change the same area, until proven otherwise.\r<br />\r<br />[font=Comic Sans MS][size=5][color=#674ea7]AND FINALLY...[/color]\r<br />[/size][/font]Well, finally, if you like the mod, please endorse it and if you experience any issues, please report so it can be fixed right away. Also, I&#39;m opened for suggestions and requests.\r<br />\r<br />If there are any grammar errors in this mod page, and I&#39;m pretty sure there aren&#39;t cause I checked so many times, please forgive me, english is not my native language.\r<br />\r<br />Thanks for the support&#33;",
  "categoryId": "89",
  "version": "1.0.0",
  "author": "XutzBR",
  "createdUnix": "1493712915",
  "updatedUnix": "1493712915",
  "containsAdultContent": false,
  "uploadedBy": "XutzBR",
  "primaryFile": null,
  "files": []
}