{
  "modId": 8362.0,
  "modName": "Thieves Guild - Guild Masters Armour Reskin",
  "summary": "Changes the guild master\\'s armour to be darker and sharper.",
  "descriptionHtml": "Basically what I\\'ve done with this is open up the .dds files for the armour, desaturated it and added a sharpen filter to make it look a bit cleaner. It may seem a bit cheap but overall I like the effects so I figured I may share it with the rest of you.\r\n\r\nIf you like it, give a comment, rate it, or do nothing, up to you. If you don\\'t like it, constructive criticism is very welcome and I\\'d prefer this to just \\\"This is bad, I don\\'t like it.\\\" but of course I can\\'t stop you from doing anything.\r\n\r\n--\r\n\r\nInstallation\r\n\r\nWithout the Nexus Mod Manager\r\n\r\nOpen the file up with an file archiver like 7-Zip, extract the files to a folder you like and then cut or copy them over to your Skyrim/data folder. Usually this is located within your steam directory under steamapps/common/.\r\n\r\nWith the Nexus Mod Manager\r\n\r\nSimply click the download with manager button and the mod manager should do the rest, once it\\'s downloaded you should see it in the mods section, if it isn\\'t already ticked then click the activation button and you\\'re ready to go.\r\n\r\n--\r\n\r\nUninstallation\r\n\r\nWithout the Nexus Mod Manager\r\n\r\nYou\\'ll want to go back to the place where you installed the files, and delete the folders inside Skyrim/Data/textures/armour/thievesguild/.\r\n\r\nWith the Nexus Mod Manager\r\n\r\nJust highlight the file in the mods section and click deactivate. You may then wish to delete the mod using the big red X button, but it is not necessary.\r\n\r\n\r\n-----------------------------------------------------------------------------------------------------------------------------------------\r\nWhat I originally wanted to do with this mod was make it so NPCs wore the original version of the armour and the player would have the new version, as I felt as Guild Master my armour should be different to that of Brynjolf, Vex and Delvin. Unfortunately when I started fiddling with the CK and other tools I just couldn\\'t figure out how to change the texture used by items, and no amount of Google searching helped, so I stuck with just changing it for everyone. If anyone could help me with this it would be awesome, just leave a comment.",
  "categoryId": "29",
  "version": "1.0",
  "author": "Krevil",
  "createdUnix": "1328747093",
  "updatedUnix": "1328747246",
  "containsAdultContent": false,
  "uploadedBy": "Krevil",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27424",
      "name": "Guild Masters Armour Reskin",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1959",
      "fileName": "Guild Masters Armour Reskin-8362-1-0.7z",
      "uploadedUnix": "1328747246",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d8dc0da725dbda49f1424309b2e7be20b39933a3951091878c2c3e73657ede57/analysis/1406662689/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guild%20Masters%20Armour%20Reskin-8362-1-0.7z?fid=27424&ttl=1535767027&ri=8192&rs=8192&setec=4799f62bf5b92df11f327bbe578124f1"
    }
  ]
}