{
  "modId": 8364.0,
  "modName": "Mera Nightgale New NPC Wandering Hireling Alpha 1_0",
  "summary": "A new NPC hireling that randomly roams skyrim",
  "descriptionHtml": "Mera Nightgale v1 Wandering Mercenary Alpha\r\n----------------------\r\nA new and recruitable roaming NPC.\r\n\r\n-----------------------\r\nIntroduction\r\n\r\n\r\nThis is a demonstration mod featuring a brand new hireling introduced in the game.\r\nThere are still a couple of bugs such as wrongly edited spells that I may have overlooked but she is 100% working but still lacks features that I want included. This is a work in progress that largely depends on my learning curve using the CK and by reading/asking questions.\r\n\r\n\r\n-----------------------------------\r\nFeatures\r\n\r\n- A brand new NPC that you can hire or slay!\r\n- A Roaming Mercenary that you may encounter outdoors!\r\n- NPC Scales to your level\r\n- Custom Spells and Perks\r\n- Complete Follower dialogue with voice!\r\n\r\n\r\n----------------------------------------\r\nBACKGROUND\r\n\r\nWhile most citizens of Skyrim would cower at the first sight of a dragon, let alone brave the frontiers of their homeland with the threat of Civil War, there are still people brave enough to continue their ways of life regardless of the chaos that seem to loom over the horizon. One such individual is Mera, ranger of Skyrim. After a long exodus from her homeland, she acquainted herself to the woods of Skyrim, preferring the solitude and peace offered by the land rather than contest with the Nords of skyrim who had proven to be cold neighbors in their time of need. \r\n\r\nShe constantly patrols Skyrim with impunity, protecting the people of Skyrim and proving her might of steel and magic against all who\\'d oppose. She felt it was her responsibility and goal to make an example for her brethren to the Nords even more so with the threat of Civil War and the coming of the Dragon, Alduin, herading what the local bards are singing, \\\"The End Times\\\".\r\n\r\n--------------------------------------\r\nStats\r\n\r\nMin Level: 10\r\n\r\nBasehealth 50, Calculated 155\r\nBase Magicka 50, Calculated 50\r\nBase Stamina 50, calculated 80\r\n\r\n28 One handed\r\n35 Archery\r\n27 Light Armor\r\n39 Sneak\r\n38 Destruction\r\n\r\n\r\nMax Level: 50\r\n\r\nMaxhealth 621\r\nmaxmagicka 50\r\nmaxstamina 214\r\n\r\n100 one handed\r\n100 Archery\r\n68 light armor\r\n100 Sneak\r\n100 Destruction\r\n\r\n--------------------------\r\nWorking Skillset\r\n\r\n\r\nCustom Perks\r\n\r\nCruel Intentions\r\nSignature Perk\r\nMera adds 20% of her Destruction skills in Damage. Additionally, her attacks inflict Frost Damage to opponents.\r\n\r\n\r\nMarksman\\'s Insight\r\nInnate Perk\r\nMera\\'s prowess with the bow grants her increased knowledge of critical points in her opponents, granting her with 30% of her Marksman Skills as critical strike chance.\r\n\r\n\r\nFiller Abilities\r\n\r\nLevelled Wards\r\nActive Spell\r\nMera Casts a ward to protect herself from spells.\r\n\r\nLevelled Destruction Spells\r\nActive Spell\r\nMera Casts a spells at her enemies, dealing damage.\r\n\r\n\r\nHealing\r\nActive Spell (restoration)\r\nMera rapidly heals herself.\r\n\r\n\r\n------------------\r\nPerks list (will unlock as she levels)\r\n\r\nAgile Defender 4/5\r\nNovice Restoration\r\nNovice Destruction\r\nArmsman 5/5\r\nOverdraw 5/5\r\nLight Foot (always active)\r\n\r\n\r\n----------------------------------\r\nInstallation, Updating and Uninstallation\r\n\r\nInstallation\r\n\r\nUsing NMM\r\n\r\n1. Download with NMM\r\n\r\n2. Install with NMM\r\n\r\n3. Activate with NMM\r\n\r\n4. Look for her in Nightgale Inn using \\\"coc nightgateinn\\\" through the console and pray you\\'d catch up to her. If not, she\\'d be roaming in the rift between Riften and Whiterun.\r\n\r\n\r\nNon-NMM users\r\n\r\n\r\n1. Download the rar\r\n\r\n2. Extract contents to your skyrim/data folder\r\n\r\n3. in the launcher, check Mera.esp in data files.\r\n\r\n4. follow step 4 above.\r\n\r\n\r\nUpdating\r\n\r\n1. Uncheck the mod then launch skyrim.\r\n\r\n2. Save your game then exit.\r\n\r\n3. Delete mera.esp in your skyrim/data folder\r\n\r\n4. Repeat Installation steps above\r\n\r\n\r\n\r\nUninstallation\r\n\r\n1. Uncheck the mod then launch skyrim\r\n\r\n2. save your game then exit.\r\n\r\n3. Delete mera.esp in your skyrim/data folder\r\n\r\n\r\n-------------------------------------------\r\n\r\n\r\nWork in Progress and future updates\r\n\r\nGeneral\r\n\r\n- intelligent roaming Mera. As it is I have not yet explored the travelto packages in the CK. I plan on putting additional strings so my NPCs would visit shops, cities and possibly bandit camps.\r\n\r\n\r\n\r\n- Autoscaling Mera w/o console. Possible through setting her home to an Encounter Zone.\r\n\r\n\r\n- Make Nightgate Inn an encounter/home zone for all future extra mercenaries. I want them to stay here so that they would autoscale upon cell reset thus eliminating the need for the console reset.\r\n\r\n\r\n- Release a two mode setup: Classic and Unlimited. Classic retains the level 50 cap while unlimited removes the level cap. Doable but will be released on the next \r\nupdate as soon as I get back from IRL duties and finish my trial spell script.\r\n\r\n\r\nPerks\r\n\r\n- Improved Custom Perks seperate from PC perklist. I ran out of names.\r\n\r\n\r\nFuture Spells and Skillsets (needs scripting)\r\n\r\n\r\nFlashfire (Replaces levelled Lightning Spell)\r\n10 Magicka\r\nDestruction Spell\r\nMera casts a Lightning bolt on her target, dealing 40 Lightning Damage and an additonal 20 fire damage in 10 seconds. This spell has a chance to stagger her opponent.\r\n\r\nSliver Cloak (Replaces healing)\r\n5 Magicka\r\nAlteration Spell\r\nMera lifts a protective spell on her, granting 120% of her destruction\r\nskill as armor rating as well as 30% Light Armor skill to Health each second and 5 Magicka each second for 10 seconds.\r\n\r\nSwift Rebuttal\r\n15 Magicka\r\nSignature Spell (Restoration)\r\nMera heals herself for 100 + 200% Light Armor skill as well as concealing her, turning invisible. During this time her next attack deals an additional damage equal to her Sneak Skill. lasts for 5 seconds.\r\n\r\n-----------------------\r\n\r\nFAQ\r\n\r\n\r\n0.a WHERE IS MERA? THIS MOD IS A LIE!\r\n\r\nEven if you do a quick coc nightgateinn after load, she\\'d be doing her patrols regardless. The best way to acquire her is through the console, whether by moving yourself (move.to) or spawning a copy of mera (help mera 4). I recommend for the sake of immersion to leave her as it is, and just hope you\\'d encounter her in your travels from Riften Bee and Barb to Whiterun Bannered Mare. :)\r\n\r\n0.b OMG SHE\\'S SENSITIVE! SHE KEEPS DRAWING HER SCIMITARZ! O.O\r\n\r\nUhmm yes, apparently if she draws her sword at you it means that I haven\\'t cleaned up her packages yet. If so I am sorry. It was intended at first to be a roleplaying feature, but it kinda got awkward when she started attacking inanimate npcs. If this happens talk to her and recruit her would solve the problem until i release the next update over the weekend.\r\n\r\n1. What is your theme behind Mera?\r\n\r\nI was reserving the \\\"Nightgale\\\" for a teleporting archer, but with the release of the CK and toying with it, I realized there are so many possibilities to create more variety of NPCs that you can set to roam around in skyrim and help slay monsters/dragons with our without your help. I figure I should release Mera as a scaling Nightblade akin to Irileth that would demonstrate such mod capabilities and invite other people to create theirs so that we can have a more populated skyrim to play with!\r\n\r\n\r\n2. Why stop her at level 50?\r\n\r\nThere is little to increase in Mera\\'s stats beyond level 50, except for light armor 100. This is intended since she would be using custom perks and spells that scale with her skills to balance her level cap. As soon as I am able to learn the basics of scripting spells, I shall be able to release her true spells as I want her to use, but for now she is stuck with filler spells and half of her flavor done and working as intended.\r\n\r\n3. Wow there are spells/perks that you broke omg!\r\n\r\nYes. I think this is the .esp version with the trial spells. I have removed all the spells that I can remember modding, but if I forgotten one or two, please report it to me and move your mera.esp up to the loading list, preferabbly before your magic mods. If you don\\'t have a magic mod installed, remove my esp and wait for future updates/fixes. Thank you for your patronage.\r\n\r\n4. OMG YOU STOLE JENASSA\\'S LINES!\r\n\r\nYes. As it currently stands, the dialogue editor in the CK is confusing like a labyrinth. With my very limited but eager to learn modding skills I figure the best way to learn the ropes is to \\\"steal\\\" a script from an existing (and practically forgettable) NPC. I chose between Jenassa and Erik, but preferences wanted me to pick Jenassa hence the \\\"clone\\\" effect.\r\n\r\nShe will have more individuality than the original as soon as I get back from IRL duties and imagine first what she\\'d look like before tweaking her face.\r\n\r\n5. Will you continue your old follower mods using the CK?\r\n\r\nYes and No. Yes I will continue to update my old follower mods using the CK. No, because with the CK we now have the ability to make new NPCs rather than rescript existing ones so its more of a question of time investment and how much I could learn in that given time using the CK, especially with the scripts.\r\n\r\nBut Daighre, Teeba and Ysolda all have been upgraded on my savegame using the CK, i\\'m just in the process of evaluating on how to better utilize the customability of spells and perks for each individual. \r\n\r\n6. You mod/update slow LOL\r\n\r\nI am sorry. I am only modding and sharing my work to provide incentive for other people to likewise do the same. I am just a casual modder and barely knew the language behind modding up until the release of Foretrenty\\'s NPC editor and CK. In just two weeks I am able to learn basic concepts in the CK and I hope that people would be inspired to work on their own so that we can continue to provide to each other a better and more varied Skyrim Experience!\r\n\r\n-------------------------------------------\r\n\r\nThank You :)\r\n\r\n\r\n\r\n\r\n\r\n",
  "categoryId": "33",
  "version": "1.0",
  "author": "miniminionette",
  "createdUnix": "1328747263",
  "updatedUnix": "1328747314",
  "containsAdultContent": false,
  "uploadedBy": "miniminionette",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27427",
      "name": "Mera Nightgale",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Mera Nightgale-8364-1-0.rar",
      "uploadedUnix": "1328747314",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cfd68c45559aca5bda1b28f71e8e66b50a7f3d10a4e039543086f711b369157e/analysis/1406662690/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Mera%20Nightgale-8364-1-0.rar?fid=27427&ttl=1535767030&ri=8192&rs=8192&setec=80b456de4152c56db1bc98f131ef188a"
    }
  ]
}