{
  "modId": 83657.0,
  "modName": "Categorized Batch Files - No DLC",
  "summary": "A collection of batch files which will allow a player to quickly spawn items from various categories, as well as a couple extra files for leveling up and tweaking stats.",
  "descriptionHtml": "[center]Today, I&#39;ve made a large collection of batch files for base Skyrim without DLC for those times when I do not want to go farm for items. Rather than just lumping every item into one file, I&#39;ve separated them into multiple themed files. Even though I only added base game items, these files should work with DLC. DLC only items just won&#39;t be added. I&#39;ve limited most items to ten per console use so that inventories are not completely weighed down.\r<br />\r<br />For those of you who do not know what a batch file is, it is a simple text document containing multiple console commands, with one on each line. By running the bat command in Skyrim&#39;s console, you can execute multiple commands at once.\r<br />\r<br />\r<br />[color=#ffff00]A brief overview of the files (You can view the files once you&#39;ve downloaded them with a text editor to see exactly what is given):[/color]\r<br />\r<br />[color=#00ffff]AllAlchemyIngredients-[/color] This file gives you ten of every alchemy ingredient each time run it.\r<br />\r<br />[color=#00ffff]AllAnimalParts-[/color] This file gives you ten of every hide, pelt, leather, chitin, dragon bone/scale and troll skull.\r<br />\r<br />[color=#00ffff]AllAtronachForgeItems-[/color] This file gives you ten charcoal, brooms, centurion cores,empty wine bottles, rolls of paper and ruined books.\r<br />\r<br />[color=#00ffff]AllDivineAmulets-[/color] Give one of each Amulet of (Divine Name).\r<br />\r<br />[color=#00ffff]AllEnchantments-[/color] Gives you a bunch of enchanted items that can be used at an enchanting table to disenchant so that you learn it.\r<br />\r<br />[color=#00ffff]AllGems-[/color] Gives ten of each common and flawless gem.\r<br />\r<br />[color=#00ffff]AllIngots-[/color] Gives ten of each ingot crafted at a smelter.\r<br />\r<br />[color=#00ffff]AllSmeltingIngredients-[/color] Gives ten of each ore as well as ten of each Dwemer metal type.\r<br />\r<br />[color=#00ffff]AllSoulGemsEmpty-[/color] Gives ten empty soul gems of each tier, including Black, plus one each of Azura&#39;s Star and The Black Star.\r<br />\r<br />[color=#00ffff]AllSoulGemsFull-[/color] Gives ten full soul gems of each tier, including Black.\r<br />\r<br />[color=#00ffff]AllSpellTomes-[/color] This gives one of every spell tome that can be acquired in game.\r<br />\r<br />[color=#00ffff]AllTools-[/color] Gives one thousand septims, ten lockpicks, ten torches, one pickaxe and one woodcutter&#39;s axe.\r<br />\r<br />[color=#ff0000]ActualLevelUp-[/color] This file repeats the level up of every skill 81 times. It does not add perks or health/magicka/stamina. After running it, you&#39;ll have to manually apply points. I did it this way to avoid issues and bugs in regards to improper leveling.\r<br />\r<br />[color=#ff0000]AmazingStats-[/color] This is a very small and simple file that uses the player.forceav command to permanently set health, magicka, stamina and carry capacity to a high number. 1000 for Health, Magicka and Stamina. 100,000 for Carry Capacity. These can be changed to your preference easily.\r<br /> \r<br />\r<br />[color=#ffff00]-Installation-[/color]\r<br />Download InventoryBatch.rar\r<br />Unzip with WinZip, SevenZip, WinRar or whichever unzipping utility you use.\r<br />Place all or your choice of ,txt files into Skyrim&#39;s base installation directory, NOT the Data folder.\r<br />For 64 bit users, it should look something like Program Files (x86)&#92;Steam&#92;steamapps&#92;common&#92;skyrim.\r<br />Once in game, open the console with the tilde key (~) if you&#39;re using an American keyboard. I don&#39;t know what key it is for foreign keyboards.\r<br />Depending on which file you want to use, type the following- &#34;bat filename&#34;  without the quotation marks.\r<br />Press Enter then press the tilde key again to close the console.\r<br />\r<br />Check out my other mods:[/center][url=http://www.nexusmods.com/skyrim/mods/38216/?][center]Thieves Guild Rebuilder[/center][/url]",
  "categoryId": "40",
  "version": "1.0",
  "author": "FallUpFallInFallOut",
  "createdUnix": "1493944445",
  "updatedUnix": "1493944432",
  "containsAdultContent": false,
  "uploadedBy": "FallUpFallInFallOut",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000243435",
      "name": "CategorizedBatchFilesV1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "CategorizedBatchFilesV1-83657-1-0.rar",
      "uploadedUnix": "1493944432",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/19f634d8e6c25251e0d997a59d0c3429c7b04b454d2fbcd3fccdf4a4614a9d29/analysis/1493944442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CategorizedBatchFilesV1-83657-1-0.rar?fid=1000243435&ttl=1535872484&ri=8192&rs=8192&setec=9c23ebb37151165d28f5ee79a8ea1a0a"
    }
  ]
}