{
  "modId": 83711.0,
  "modName": "Imperial and Stormcloak Armor for Sale",
  "summary": "Tired of having to loot Imperial or Stormcloak armor and weapons to obtain a complete set?  Buy what you need where you would expect to find them&#33;",
  "descriptionHtml": "Have you ever noticed that Beirand almost never sells any Imperial armor or weapons, despite being the official Imperial blacksmith?  He gives you your initial set of armor if you join the Imperials, and tells you that if you lose or damage it, you&#39;ll have to pay for more like everyone else.  Really?  From where can you even buy them?  And where are you supposed to get an officer&#39;s helmet after you become a legate?  From looting it?  Disgusting&#33;  Although the Stormcloaks give you a set of armor if you join, and and another set if you become an officer, you cannot normally find the full Stormcloak helmet for sale anywhere.  This mod places one of each piece of Imperial equipment permanently in the inventory of Beirand&#39;s shop in Solitude, and one of each piece of Stormcloak armor for its soldiers in Oengul&#39;s inventory in Windhelm (including the version of the cuirass with sleeves).  Even after the civil war is over, they will still sell you what&#39;s left over as surplus&#33;  As a bonus, the sometimes illusive Amulet of Dibella is now permanently within the inventory of the Radiant Raiment in Solitude.",
  "categoryId": "69",
  "version": "1.0",
  "author": "oracus0",
  "createdUnix": "1494120851",
  "updatedUnix": "1494120776",
  "containsAdultContent": false,
  "uploadedBy": "Oracus0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000243622",
      "name": "Merchants",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Merchants-83711-1-0.7z",
      "uploadedUnix": "1494120776",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/abdc09029868b10ed53e3726ca91ac5fd4797f0ea6fda53d54a15868d7878849/analysis/1494120782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Merchants-83711-1-0.7z?fid=1000243622&ttl=1535872537&ri=8192&rs=8192&setec=5711325fddc7b660e4fc0023c1a49bc9"
    }
  ]
}