{
  "modId": 83725.0,
  "modName": "Skyrim LOW END PC mod (CURRENTLY IN DEVELOPMENT)",
  "summary": "I am attempting to make Elder Scrolls Skyrim for low end pcs, i will try to remove unnecessary textures etc. This mod is in progress and im doing this in my spare time, so dont expect much from me. I will keep on updating this page, and i hope to succeed. Thank you all for reading&#33;",
  "descriptionHtml": "[b]                                     SKYRIM LOW END PC mod\r<br />[/b]Hello there, everyone&#33; In the next weeks/months i will be attempting to make Skyrim a more low end pc game, less bugs, higher fps rates.\r<br />I am hoping to do this by simply removing or editing unnecessary textures, fixing bugs, removing unnecessary animations, removing water animations.\r<br /> This mod is in progress and im doing this in my spare time, so dont expect much from me. I will keep on updating this page, and i hope to succeed. Thank you all for reading&#33;\r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------&gt;\r<br />This mod is developed only by me, (Kristaps 112) and im not planning on taking any content from other mods and if i will \r<br />it will be with the authors acceptation.\r<br />Thank you all for reading, and i will try to work on this mod. More information in the next 7 days.\r<br />-----------------------------------------------------------------------------------------------------------------------------------------------------------&gt;\r<br /> \r<br />\r<br />\r<br />                                                                      [u]  [/u][b][u]CURRENT  FEATURES [/u]\r<br />[/b]                                                      \r<br />                                                             - slightly increased frame rate\r<br />                                                             - some minor bugs fixed\r<br />                                                             - i have fixed some minor bugs in which quest objectives can get stuck\r<br />    \r<br />\r<br />\r<br />------------------------------------------------------------------------------------------------------------------------------------------------------------&gt;\r<br />                                                   \r<br />     I have removed many unnecessary things starting from trees to places you cant even access. I want to get some things done, and make more progress, and i am planning on doing a showcase of what i have done so far and sharing more information in the next 7 days. Thank you for reading&#33; :)",
  "categoryId": "95",
  "version": "",
  "author": "Kristapz",
  "createdUnix": "1494173943",
  "updatedUnix": "1494173943",
  "containsAdultContent": false,
  "uploadedBy": "Kristaps112",
  "primaryFile": null,
  "files": []
}