{
  "modId": 83727.0,
  "modName": "DNEL Male Follower Pack",
  "summary": "As requested by oddzxc, here is a male follower pack containing a total of seven followers. They don&#39;t have any custom dialog or anything. The only thing &#34;unique&#34; about them are their appearances and names. You could use this as resource pack if you&#39;d like. Just give me a little credit in your mod description. ",
  "descriptionHtml": "As requested by oddzxc, here is a male follower pack containing a total of seven followers. They don&#39;t have any custom dialog or anything. The only thing &#34;unique&#34; about them are their appearances and names. You could use this as resource pack if you&#39;d like. Just give me a little credit in your mod description. \r<br />\r<br />All the followers can be killed by both the player and hostile NPCs. If they die when you&#39;d rather them live use the resurrect console command. Most of the followers are supposed to be marriable but I&#39;m sure I screwed that up some how. They will speak to you as if you are a friend because I haven&#39;t tried to learn the more intricate tools in the Creation Kit. Groc and Corg are both supposed to have war paint on their faces but I couldn&#39;t get it to show up inside the game. This mod is rather bare bones but I hope you can enjoy it none the less. \r<br />\r<br />And now, a special thanks to Darkfox 127 on YouTube for the wonderful video tutorials. \r<br />\r<br />To make up for a lack of custom dialog, here are some tiny descriptions to make these NPCs feel a little more unique.\r<br />\r<br />\r<br />[size=5][b][i]Greivis the Head-Crusher[/i][/b][/size]         Location: Markarth        Combat Style: Warrior\r<br />\r<br />&#34;Yeah, I crush a lot of heads. But I&#39;m no murderer.&#34;\r<br />\r<br />&#34;Come on, I&#39;m practically giving you money here&#33;&#34;\r<br />\r<br />&#34;How about I take the money and then not kill the pacifist monks? If you want them dead so badly, do it yourself.&#34;\r<br />\r<br />&#34;Why not? Surely someone like you isn&#39;t concerned with moral codes.&#34;\r<br />\r<br />&#34;If you and one of those monks were alone together, could you plunge a knife into his back and still be able to sleep at night?&#34;\r<br />\r<br />&#34;I&#39;d sleep like a newborn.&#34;\r<br />\r<br />&#34;Then why are you trying to hire me for this?&#34;\r<br />\r<br />&#34;Fine, I will do it myself. It&#39;s your loss anyway.&#34;\r<br />\r<br />Greivis later saved the lives of two monks who were about to be killed by the man who once tried to hire him.\r<br />\r<br />\r<br />[size=5][i][b]Groc and Corg           [/b][/i][/size]Location: The Frozen Hearth Inn, Winterhold     Combat Styles: Battle Mage\r<br />\r<br />Groc and Corg were raised rather harshly by their parents. Their father, Groccorg, trained them rigorously in the destruction school of magic. Groccorg&#39;s teaching methods could have be described as militaristic and cruel. Eventually, Groc and Corg grew tired of their father&#39;s teachings. They killed him together. \r<br />\r<br />\r<br />[size=5][i][b]Nedeer the Sneak[/b][/i][/size]           Location: The Ragged Flagon, Riften          Combat Style: Thief\r<br />\r<br />&#34;No, I got the nickname &#39;Sneak&#39; before I stole one thousand septims worth of jewelry. I actually got the nickname when I was caught stealing a sweet roll. I thought I&#39;d try to live up to the name by swiping the jewelry. It didn&#39;t take long after that for me to join the Thieves Guild.&#34;\r<br />\r<br />[size=5][i][b]\r<br />Keilgrad Iron-Jaw[/b][/i][/size]         Location: The Frostfruit Inn, Rorikstead    Combat Style: Defensive \r<br />\r<br />&#34;Keilgrad is the only person I know who would, if possible, come back from the dead just to have one more day&#39;s worth of adventuring.&#34; -Spoken by Fryger, Keilgrad&#39;s former treasure hunting companian.\r<br />[size=5][b][i]\r<br />\r<br />Raul Fear-Striker     [/i][/b][size=2]Location[/size][/size]: Haelga&#39;s Bunk House, Riften         Combat Style: Soldier\r<br />\r<br />After losing a battle with a Nord who was wielding an enchanted sword, Raul became dissatisfied with his fighting equipment. He eventually found a mage willing to enchant his mace. Convinced the enchantment would make him unbeatable, Raul used all the gold and loot he had saved to purchase the mage&#39;s services. Raul earned the name &#34;Fear-Striker&#34; after chasing a group of bandits out of their own camp.\r<br />\r<br />[size=5][i][b]Targo[/b][/i][/size]                                                Location: Brittleshin Pass, SW Riverwood       Combat Style: Werewolf\r<br />After the first two nights Targo spent as a werewolf, he left his village and went in search of a cure. One day, a mage named Pirius stumbled upon Targo in the wilderness while he was transforming back in to his human form. Pirius was fascinated by werewolves. He and Targo talked from morning until midday. After Pirius&#39; many questions, he told Targo about a cure, in the form of a ritual, he was crafting. Targo was, naturally, ecstatic he found somebody that could help him. One month after they met, Pirius attempted to preform the ritual he created. Needless to say, the ritual did not work as intended. Instead of loosing the ability to transform into a werewolf, Targo lost the ability to revert back to his human form. However, the ritual granted Targo his human consciousness while in wolf form. The ritual had strange effects on Pirius as well. Pirius went into an insane frenzy. He charged at Targo as if he was a starving wolf. Targo, not knowing his own strength, knocked Pirius across the room and into a wall with the swipe of his hand. Pirius, despite the incredibly low odds, broke his neck when he hit the wall, thereby, killing him. Fearing for a nearby village&#39;s safety, Targo fled into the wilderness. Once Targo realized he wasn&#39;t changing back to his human form, he was struck with despair. Targo was too afraid to try communicating with other people. He decided to try living as a wolf in the wild would. He eventually grew to accept his new appearance and lifestyle. But he will forever miss the old life he once had.    ",
  "categoryId": "96",
  "version": "",
  "author": "DoNotEatLegos",
  "createdUnix": "1494183568",
  "updatedUnix": "1494183451",
  "containsAdultContent": false,
  "uploadedBy": "DoNotEatLegos",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000243721",
      "name": "DNEL Male Follower Pack",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "795",
      "fileName": "DNEL Male Follower Pack-83727-.zip",
      "uploadedUnix": "1494183451",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/f038f3a060dd5cf3d68f54ca8775ffefc941e743c153d7cb953674bf97118591/analysis/1494183725/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DNEL%20Male%20Follower%20Pack-83727-.zip?fid=1000243721&ttl=1535872555&ri=8192&rs=8192&setec=8166efd9b29002d5cf6d79822cb1f4b8"
    }
  ]
}