{
  "modId": 83782.0,
  "modName": "Simple multiple followers (Advanced version) - German",
  "summary": "German Translation of Simple multiple followers\r<br />\r<br />Ermöglicht bis zu 10 &#34;Normale&#34; Gefolgsleute, bis zu 10 &#34;Spezielle&#34; Gefolgsleute und bis zu 10 Haustiere.",
  "descriptionHtml": "[color=yellow]Simple multiple followers (Advanced version) von Kuertee[/color]\r<br />\r<br />Ursprüngliche Übersetzung von WestSideKidd\r<br />\r<br />This is only a German translation&#33;\r<br />The original mod can be found here: [url=http://www.nexusmods.com/skyrim/mods/31581/?]Simple multiple followers (Advanced version)[/url]\r<br />\r<br />Ermöglicht bis zu 10 &#34;Normale&#34; Gefolgsleute, bis zu 10 &#34;Spezielle&#34; Gefolgsleute und bis zu 10 Haustiere.\r<br />[line]\r<br />[color=yellow]Kurzanleitung[/color] (genaueres in der Beschreibung):\r<br />Gefolgsleute-Anweisungsfenster (&#34;(9&#34; Taste) (Taste 9 oder Klammer) um Gefolgsleuten in der Nähe Anweisungen zu erteilen. Diese Taste schickt auch die 3. Person-Verfolgerkamera zu dir zurück.\r<br />\r<br />Gefolgsleute essen, trinken und schlafen: Halte ihre Nahrungsmittel- und Getränke-Vorräte immer gut gefüllt. Schlafe regelmäßig. Frage die Gefolgsleute &#34;Wie geht es Euch?&#34; um ihren Sättigungs-/Hungerlevel, Hydratations-/Durstlevel, Energie-/Erschöpfungslevel, Essensvorrat, Trinkvorrat, Trinkschlauch-Füllzustand zu sehen. Wenn sie hungrig, durstig oder müde sind, werden sie dich nach Essen, Trinken oder einer Rast fragen, bevor sie sich ein Gasthaus suchen.\r<br />\r<br />Fallen deaktivieren/blockieren: Um eine Falle zu deaktivieren, blockiere sie mit einem Gegenstand. Tu das, indem du einen &#34;gehaltenen&#34; Gegenstand in ihre Richtung hältst. Wenn du dich mit einem gehaltenen Gegenstand näherst, wird sie grün hervorgehoben. Nähere dich weiter, bis der gehaltene Gegenstand in der Falle eingeklemmt ist. Wenn das geschieht, wird sie rot hervorgehoben. Bei Druckplatten ist es erforderlich, dass du schleichst, aber andere Fallen können auch im Stehen blockiert werden. Denke daran, dass das eine gefährliche Aktion ist, da die Falle trotzdem ausgelöst werden könnte.\r<br />\r<br />Fallen Vermeidungs-KI: Gefolgsleute werden bei allen Fallen warten. Benutze das Anweisungsfenster, um ihnen zu befehlen, die Fallen zu durchqueren, wenn es sicher ist.\r<br />\r<br />Plünderungs-KI: Nach einem Kampf und nachdem du weitergehst, werden alle Behälter und Leichen vor dir geplündert. Jeder Behälter oder Leichnam wird blau hervorgehoben, um dir zu zeigen, dass sie geplündert werden können. Dann leuchten sie entweder grün, um dich zu benachrichtigen, dass ein Gefolgsmann zugewiesen wurde, sie zu plündern. Oder sie werden rot hervorgehoben, um dir mitzuteilen, dass sie aus irgendeinen Grund nicht geplündert werden können. Einige Gründe, die verhindern, dass Behälter oder Leichen geplündert werden sind: Feinde, eine Falle in der Nähe, Kampf begonnen, usw.\r<br />\r<br />Während des Plünderungsvorgangs kannst du Behälter &#34;markieren&#34;, die noch nicht für Plünderungen markiert sind, indem du sie in dein Fadenkreuz nimmst. Wenn der Behälter bereits geplündert wurde, wird er rot hervorgehoben. Markierte Behälter ermöglichen Gefolgsleuten, sie zu plündern, unabhängig davon, ob sie von ihnen erreichbar sind oder nicht (solange sie von dir erreichbar sind).\r<br />\r<br />Lagerungs-KI: Wenn sie zu Hause sind, oder wenn sie eine Horse Command-Satteltasche plündern, werden die Gefolgsleute Behälter plündern und dann nicht-ausgerüstete Rüstungen und Waffen wieder in den Behälter zurücklegen.\r<br />\r<br />Drücke Taste: &#34;O&#34; (für offen), während ein Behälter, in einem deiner Häuser, im Fadenkreuz ist, um deinen Gefolgsleuten zu erlauben oder zu verbieten, diesen Behälter zu benutzen.\r<br />\r<br />Drücke Taste: &#34;O&#34; (für offen), während ein NPC oder ein Gefolgsmann im Fadenkreuz ist, um das NPC Fehlersuch-Fenster zu öffnen, welches die Option &#34;Zwangsrekrutierung&#34; beinhaltet. Wenn ein Gefolgsmann im Fadenkreuz ist, öffnet es das Gefolgsmann Fehlersuch-Fenster, das die Option &#34;Zwangsentlassung&#34; enthält.\r<br />\r<br />Vampir Spieler: Du kannst dich jetzt von deinen Nicht-Vampir Gefolgsleuten ernähren. Diese Option ist im Gefolgsleute Aktivierungsmenü verfügbar. Beachte, dass der Bug des Basisspiels, durch den du manchmal nach dem Trinken an Ort und Stelle festhängst, nicht von dieser Mod repariert wird. Wenn das geschieht, befreit dich erneutes Trinken aus dem Bug.\r<br />[line]\r<br />[color=yellow]Benötigt:[/color]\r<br />Skyrim V 1.9 oder höher\r<br />[url=http://skse.silverlock.org/]SKSE[/url]\r<br />Original Mod [url=http://www.nexusmods.com/skyrim/mods/31581/?]kuerteeSimpleMultipleFollowers 0p843[/url]\r<br />[url=http://www.nexusmods.com/skyrim/mods/14884/?]Fuz Ro D-oh - Silent Voice[/url]\r<br />\r<br />[color=yellow]Empfohlen:[/color]\r<br />[url=http://www.nexusmods.com/skyrim/mods/13241/?]Battle fatigue and injuries[/url] von Kuertee\r<br />Wie alle Charaktere können Gefolgsleute verletzt werden. Sie brauchen Verbände, Ruhe oder einen Heiler, um sich von Verletzungen zu erholen.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/13246/?]Eat and sleep[/url] von Kuertee\r<br />Funktionen aus EAS werden verwendet, wenn Gefolgsleute essen, trinken und schlafen. Z.B. automatisches portionieren großer Nahrungsmittel, Trinkschläuche, Bettkomfort.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/15225/?]Horse commands[/url] von Kuertee\r<br />Die Gefolgsleute werden jedes deiner verfügbaren Pferde reiten. Hinweis: Es wurde berichtet, dass die aktuelle Version von SMF nicht mit Horse commands kompatibel ist.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/21828/?]Skills-based Damage and Magnitude Multipliers[/url] von Kuertee\r<br />Wie bei allen Charakteren ist der Kampfschaden der Gefolgsleute von ihren Fertigkeitsstufen abhängig.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/45654/?]Useful potions[/url] von Kuertee\r<br />Wie bei allen Charakteren werden die Gesundheits-, Magicka- und Ausdauer-Regenerationsraten der Gefolgsleute minimiert.\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/48265/?]FileAccess Interface for Skyrim Script - FISS[/url] von Lord Conti\r<br />Du kannst mit FISS deine Mod-Einstellungen in und aus einer externen XML-Datei importieren und exportieren.\r<br />[line]\r<br />[color=yellow]Installation:[/color]\r<br />Kopiere erst die Original-Mod und danach die ESP UND den Scripts-Ordner von meiner Übersetzung in deinen Skyrim/Data Ordner (Steam/SteamApps/Common/Skyrim/Data)\r<br />\r<br />Die Deinstallations- und Aktualisierungsanleitungen findest du in der Beschreibung\r<br />[line]\r<br />[color=yellow]Hinweise:[/color]\r<br />1. Es gibt einige Schönheitsfehler:\r<br />a. Manchmal werden in den Nachrichtenfenstern die Umlaute in lustigen Symbolen dargestellt. Um das zu vermeiden, habe ich in den entsprechenden Skripts Umlaute wie &#34;ä&#34; mit &#34;ae&#34; umschrieben.\r<br />b. Die Menüpunkte im MCM musste ich großteils in Englisch lassen, da es sonst zu Fehlern kommt.\r<br />c. Die Meldungen werden nach dem Baukastensystem zusammengesetzt. Dadurch lesen sich die Nachrichten manchmal etwas &#34;holprig&#34;.\r<br />\r<br />2. Bei einigen Skriptzeilen war mir leider nicht klar, ob es Meldungen für das Spiel oder Teil des Codes sind. Trotz der Hilfe von Kuertee und der Testspieler kann ich nicht garantieren, ob nicht noch die eine oder andere Nachricht im Spiel auf Englisch ist.\r<br />Solltest du eine solche Meldung sehen, würde ich mich freuen, wenn du sie mir mit möglichst genauen Wortlaut oder Screenshot zukommen lässt.\r<br />\r<br />3. Falls du keine Untertitel hast, schau nach, ob die Untertitel unter Einstellungen/Anzeige eingeschaltet sind.\r<br />\r<br />Bei Übersetzungsfehlern oder allgemeinen Fragen kannst du gern mit mir Kontakt aufnehmen.\r<br />Bei Bugs frage bitte auf der englischen Seite.\r<br />Und über Screenshots freue ich mich auch immer :)\r<br />\r<br />Wenn dir SMF gefällt, vergiss nicht, die Original-Mod zu bewerten&#33; (mich nur, wenn du mit der Übersetzung zufrieden bist)\r<br />[line]\r<br />[color=yellow]Credits:[/color]\r<br />Danke an Kuertee für die Erlaubnis, eine deutsche Version seiner Mod zum Download bereitzustellen und für seine Hilfe bei der Übersetzung.\r<br />\r<br />WestSideKidd für die Übersetzung der V 0.801\r<br />Doritis und TesterLein7 für das Testen\r<br />\r<br />Viel Spaß&#33;\r<br />Merkur\r<br />\r<br />\r<br />[url=http://www.nexusmods.com/skyrimspecialedition/users/1391109/?tb=mods&pUp=1]Übersetzungen für Skyrim Special Edition[/url]\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/users/1391109/?tb=mods&pUp=1]Übersetzungen für Skyrim[/url]\r<br />\r<br />[url=http://www.nexusmods.com/oblivion/users/1391109/?tb=mods&pUp=1]Übersetzungen für Oblivion[/url]\r<br />\r<br />[url=http://www.nexusmods.com/newvegas/users/1391109/?tb=mods&pUp=1]Übersetzungen für Fallout New Vegas[/url]\r<br />\r<br />[url=http://www.nexusmods.com/fallout3/users/1391109/?tb=mods&pUp=1]Übersetzungen für Fallout 3[/url]",
  "categoryId": "24",
  "version": "0.843",
  "author": "kuertee",
  "createdUnix": "1494405091",
  "updatedUnix": "1494400749",
  "containsAdultContent": false,
  "uploadedBy": "Merkur67",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000243948",
      "name": "Simple multiple followers V 0.843",
      "version": "0.843",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "167",
      "fileName": "Simple multiple followers V 0.843-83782-0-843.rar",
      "uploadedUnix": "1494400749",
      "modVersion": "0.843",
      "virusScanUrl": "https://www.virustotal.com/file/8e0e7641d3567f092000a0a2637ae73181248e465c3f2053908d38173b1ee802/analysis/1494400987/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20multiple%20followers%20V%200.843-83782-0-843.rar?fid=1000243948&ttl=1535872623&ri=8192&rs=8192&setec=b3ce2a241ca34cdb7083573e68a7c964"
    }
  ]
}