{
  "modId": 83784.0,
  "modName": "Tahlia - A Standalone Elf Follower",
  "summary": "Tahlia Is A Standalone Elf Follower If you can&#39;t already tell by the title. She is a follower I have been working on know for about for a week and have been really keen to upload her to the nexus. Any bugs please do tell me.w",
  "descriptionHtml": "[center][font=Courier New][size=6]\r<br />\r<br />{T.A.H.L.I.A}\r<br />\r<br />\r<br />[/size]\r<br />\r<br />[size=4]Tahlia is a STANDALONE FOLLOWER which means no other mods will be required if you want to use her. You can use this mod with whatever custom body you have or skin texture.\r<br />\r<br />She is a destruction mage and is my first official follower.\r<br />\r<br />[/size]\r<br />[size=3]~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~[/size]\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/0Fas6hX.jpg[/img]\r<br />\r<br />\r<br />[/font]~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />\r<br />[font=Courier New][size=6]{A.B.O.U.T  H.E.R}[/size]\r<br />\r<br />[size=4]\r<br />name : Tahlia\r<br />\r<br />sex : female\r<br />\r<br />race :nord&#92;elf\r<br />\r<br />age : 23\r<br />\r<br />height : 1.0000\r<br />\r<br />weight : 50.0000\r<br />\r<br />voice types : female young eager\r<br />\r<br />combat style : combat mage destruction\r<br />\r<br />location : the drunken huntsman\r<br />\r<br />body type : CBBE & UNP\r<br />\r<br />\r<br />spells : vampiric drain, firebolt, healing, grand healing, incinerate,\r<br />thunderbolt.\r<br />\r<br />\r<br />perks : impact, disintegrate, impact, augmented flames, regeneration\r<br />\r<br />levels with player : yes\r<br />\r<br />essential : yes\r<br />\r<br />marriageable : yes\r<br />\r<br />armor : apprentice destruction robes\r<br />\r<br />weapons : enchanted steel dagger of magicka \r<br />\r<br />[/size][/font]\r<br />[size=3]~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />\r<br />[img]http://i.imgur.com/nAVV8Oz.jpg[/img][/size]\r<br />\r<br />\r<br />[img]http://i.imgur.com/qBMcumg.jpg[/img]\r<br />\r<br />\r<br />\r<br />[size=6][font=Courier New]{B.A.C.K S.T.O.R.Y}[/font]\r<br />[/size]\r<br />\r<br />\r<br />[font=Courier New][size=4]\r<br />Before Tahlia was born, her mother was a young youthful Elf goddess named Cristitiana. Her mothers features were of a beautiful blossomed rose, her hair was like gorgeous white silk and flowed in winds as she blessed the land with her shamanistic powers. One day as her mother was running through a field of tulips she encountered a hansom cleanly shaved Nord named Destrian. Love was met at first sight as their eyes made contact. But rules say, a goddess can never love a pure blood or the male lover will face a horrible consequence. Destrian and Christitiana could only love each other secretly. The next day, Destrian went to the same spot were he went the other day to introduce himself to Christitiana. He introduced himself and Christitiana along with him. Christitiana never told Destrian that she was a goddess because she wanted to love him no matter what fate awaits ahead. He kept going to visit her for 4 years until they kissed for the first time by a beautiful sunset, Their love was official. They made love together in a patch of grass by a beautiful Tahlia tree. There love for each other was strong. Unaware, while Christitiana and Destrian were making love to each other, her father Xalvdor was watching upon the night sky. He was frustrated and full of rage as he swore to have Destrian executed the next following day. After Christitiana and Destrian had finished there love making, Destrian headed on back home and Christitiana went back to her home. Minutes after, Xalvdor came down barging to Christitianas home and threatened her in evil sadistic ways. Xalvdor sent his guards to kidnap Destrian and take him to his deathbed. Meanwhile for Christitiana was sent to a cell until she learned her lesson. Destian was taken to his execution room where he was tortured and left to starve for a month. On his execution day he was taken to an old cave where they then executed him by decapitating his head. Unfortunately, Christitiana was pregnant with a baby at the time. Her father then came down to her cell and informed her of her husbands execution. Christitianas life and heart was shattered. After a year in her cell she gave birth to Destrians baby alone, in the dark and scared. She new there would be no life for her child where she was so when she was released from her cell 2 months prior from her birth, she went to a Tahlia tree sneaking her baby in an old leather sack and broke some twigs from a Tahlia tree. Out of the twigs she made a babies cot, lay her child in it, and sent her baby down a stream of water which led to an old town known as Riften. A Guard found the child in the twig cot floating down a stream and brought her to a orphanage in the town, she grew up in the orphanage named Tahlia and was made fun of for her pointy elf ears. One day, Tahlia had enough of the teasing, she screamed in anger causing her magic powers to unleash and burnt the orphanage to the ground. She ran away and was never seen again. Mean while her mother suicided by jumping of a cliff, ending her long sadness and depression. 13 years after running away she stays in a city known as Whiterun still wanting to know who her mother and father was. \r<br />\r<br />\r<br />\r<br />*I AM NO AUTHOR OK, JUST WRIGHT WHAT CAME OF THE TOP OF MY HEAD.*\r<br />\r<br />\r<br />[/size][/font]\r<br />\r<br />\r<br />\r<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />\r<br />[font=Courier New][size=6]{C.R.E.D.I.T.S}[/size]\r<br />\r<br />\r<br />[size=4]HHaleyy : Fair Skin Complexion\r<br />\r<br />mrLenski : Covereyes\r<br />\r<br />Kalilies : KS Hairdos - Renewal\r<br />\r<br />Hvergelmir : Brows\r<br />\r<br />Empyrean42 : Empyrean Warpaints In HD\r<br />\r<br />tetrodoxin : frecklemania\r<br />\r<br />Dimon99 : DIMONIZED UNP\r<br />\r<br />Caliente : Caliente&#39;s Beautiful Bodies Edition\r<br />\r<br />\r<br />[/size][/font]~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r<br />\r<br />\r<br />[font=Courier New][size=4]\r<br />\r<br />\r<br />\r<br />[/size]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[/font][/center]",
  "categoryId": "66",
  "version": "1.2",
  "author": "WidowsKiss",
  "createdUnix": "1494418968",
  "updatedUnix": "1494419616",
  "containsAdultContent": true,
  "uploadedBy": "WidowsKiss",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000243954",
      "name": "Tahlia - A Standalone Elf Follower UNP",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "113355",
      "fileName": "Tahlia - A Standalone Elf Follower UNP-83784-1-2.rar",
      "uploadedUnix": "1494419616",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/d1346d3987f08eb1f4b0a78e5644e8506b1e82c321dcd664a6d5816bad3373a4/analysis/1494419895/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tahlia%20-%20A%20Standalone%20Elf%20Follower%20UNP-83784-1-2.rar?fid=1000243954&ttl=1535872625&ri=8192&rs=8192&setec=a58531c1b9a6e205e0fff3cdd84d97f3"
    }
  ]
}