{
  "modId": 83850.0,
  "modName": "Dragons Lair Tavern Redux v2.0",
  "summary": "An underground tavern which houses several followers and shops.",
  "descriptionHtml": "DRAGONS LAIR TAVERN: REDUX v2.0 (Final)\n<br />\n<br />By Zyris\n<br />\n<br />This mod is a redo of an earlier mod I created with the same name. That file has since been removed.\n<br />\n<br />Here I have implemented most of my prior ideas into one mod.\n<br />\n<br />- This is pretty much a “one-stop-shopping” mod that has just about everything I could conjure up. And after spending over four months creating, editing, refining and testing I figured it was time to release it. \n<br />\n<br />- In making this mod I decided to stay with the original Skyrim version but include both the Dawnguard and Dragonborn DLC. You will need both of  those to use this mod.\n<br />\n<br />- This mod starts off with a simple courier-given quest which leads you to the tavern. The tavern is located deep beneath the destroyed (but now rebuilt) farmhouse Southwest of Western Watchtower near Whiterun.\n<br />\n<br />- The new farm consist of a basic building with a field and plants to harvest. You can also collect wood from a dead tree and water from a well.\n<br />\n<br />- Inside the tavern you will find several shops which will sell you anything from rare books to companions.\n<br />\n<br />- Alchemy, enchanting, blacksmith, and cooking stations have all been added.\n<br />\n<br />- You will also find several followers which are always combat ready. Each follower has their own style of combat, armor and weapons. In creating these   followers I wanted to stay as neutral as possible and not focus on one race or gender. I tried to keep the group balanced. Each follower has their own     class and style of combat using either heavy, light, or both types of armor. They also have their own companion which they will summon. And they all     have the appropriate spells, abilities and perks that one would expect to match their class. All followers have at least one shout ability.\n<br />\n<br />- Further into the tavern you will find a cavern which you can mine all types of ore and some gems.\n<br />\n<br />- Just past the cavern you will encounter a chamber with a boss you can fight. If you survive you will have access to great treasure and a second chamber where you can reset your perks.\n<br />\n<br />- There is an \"in-game\" book which you can obtain and carry with you. It will help explain the mod and all it has to offer. \n<br />\n<br />- I have also included a room for rent. There you will find weapon racks, mannequins, and plenty of storage containers.\n<br />\n<br />- Some cloth armor has been modified to make better use of for combat purposes. Can be purchased from vendors.\n<br />\n<br />- A dragon companion has also been reintroduced. Dinokaar is an old friend of mine which is a carryover of a previous mod. The DINOKAAR V2 mod is still available here as is the video for that mod. \n<br />\n<br />- Just drop the .BSA and .ESM files into your DATA folder.\n<br />\n<br />\n<br />\n<br />Changes Made For \"Dragon’s Lair Tavern: Redux v2.0\"\n<br />\n<br />01) Repaired the navmesh on the road in front of the farmhouse.  \n<br />02) Renamed “The Ring of the Undead”.\n<br />03) Adjusted Vidar’s (a follower) safe inventory.\n<br />04) Adjusted Zohl’s (a follower) safe inventory.\n<br />05) Adjustments to Acolyte Dragon Priest.\n<br />06) Added lighting to the porch lanterns.\n<br />07) Reduced the AOE on exploding arrows.\n<br />08) Replaced Exploding Nordic Carved Arrows with Nordic Carved Arrows for Vidar, Spirit of Vidar, Hulking Draugr companions.    \n<br />     - The AOE was causing unwanted conflicts with allies.\n<br />09) Added playable Greybeard Armor and short sleeve Dark Brotherhood armor which can be purchased from the blacksmith. \n<br />10) Relocated and restructured “The Orb of Reanimation” to a new room.\n<br />11) Added a beehive to the structure with the hay and well.\n<br />12) Created a second blacksmith which sells light armor.\n<br />13) Main boss fight now drops a summons spell for you to learn. \n<br />14) Fixed issue with main boss corpse.\n<br />15) Follower spirits now need to be crafted.\n<br />16) Created a new merchant which sells Nordic items including a playable Hrothmund’s Axe (Axe lvl: 1-60)\n<br />17) Added new fights to the cavern area. A spider and a Draugr.\n<br />18) Adjusted the inventory of some tavern merchants.\n<br />19) Changed Atria’s (a follower) voice.\n<br />20) All modded bows and crossbows have been readjusted.\n<br />21) The Forgemaster and Dwarven Sphere companions can now be purchased from either blacksmiths.\n<br />\n<br />.",
  "categoryId": "69",
  "version": "v2.0",
  "author": "Zyris",
  "createdUnix": "1494719055",
  "updatedUnix": "1496509740",
  "containsAdultContent": false,
  "uploadedBy": "Zyris",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000245975",
      "name": "Dragons Lair Tavern Redux (v2)",
      "version": "v2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6921",
      "fileName": "Dragons Lair Tavern Redux (v2)-83850-v2.zip",
      "uploadedUnix": "1496509740",
      "modVersion": "v2",
      "virusScanUrl": "https://www.virustotal.com/file/c034f240c4c22eb129e5ca8e66680974ca72136289ec600ab84176a831c8b2fd/analysis/1496510126/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragons%20Lair%20Tavern%20Redux%20%28v2%29-83850-v2.zip?fid=1000245975&ttl=1535872676&ri=8192&rs=8192&setec=210364403aa9c4c29be9e932134444f4"
    }
  ]
}