{
  "modId": 8389.0,
  "modName": "Dwemer Artificer",
  "summary": "Poor social skills?  Awkward at social functions?  Trouble meeting new friends?  Not to worry!  Why bother /making/ friends, when you can /build/ them?  Spiders, Spheres, Centurions, and even Dwemer Androids are yours to create, customize and command!",
  "descriptionHtml": "NOTEWORTHY NEWS:\r\n\r\nOkay, so this nebulous \\\"future\\\" thing that people make so much about is really nothing like I imagined it.  I\\'ll keep this short and simple - I won\\'t be working on this mod any more.  I\\'ve got too much going on in meat-space to have much time for Skyrim, so I\\'m letting PDAM go.\r\n\r\nThe good news is that GuloGulo has prepared a fix for some of the problems that are currently holding this mod back, and he\\'ll be using his newly acquired editing rights to post that presently.  He\\' making no promises for future fixes/updates/whatever, so don\\'t get your hopes up.\r\n\r\nIf you are interested in taking over ownership of PDAM, feel free to message me and we\\'ll talk, but I can\\'t promise that I will get back to you quickly, as I won\\'t be checking for messages very frequently.\r\n\r\nThanks for all of the support and the endorsements.  I\\'ve had lots of fun working on PDAM this past year(!), and I probably wouldn\\'t have done as much as I have if it weren\\'t for the encouragement of both of my fans.  You now who you are.\r\n\r\n\r\n========\r\nName: Dwemer Artificer\r\nVersion: 0.60\r\nDate: 2/8/2013\r\nAuthor(s): Phayze81 and gulogulo (last update)\r\n\r\nNew In This Update\r\n========\r\n\r\n-fixed bug with activation/deactivation of automatons\r\n-Improved Compatibility with [url=http://skyrim.nexusmods.com/mods/20721]Nature of The Beast 2[/url] - which includes some very handy minion management features that you might consider looking into.\r\n\r\nDescription\r\n========\r\n\r\nWelcome to Phayze\\'s Dwemer Artificer Mod (PDAM for short)!  I know it\\'s not the only, nor is it likely to be the best, \\\"Build Dwemer Robots\\\" mod out there, but it\\'s mine and I\\'m proud of  it.  I hope you\\'ll enjoy my unique variation on the theme, and that you\\'ll take the time to endorse this file afer you\\'ve had a chance to fall in love with it.\r\n\r\nSo here\\'s how it works:\r\n\r\n1)Scavenge Parts - this is pretty self explanatory . . .\r\n2)Find, buy, steal or otherwise acquire and then read crafting manuals for some type or another of automaton (read them a second time to remove that type of automaton from the smithing menu)\r\n2)Build inert automata and a control rod at any forge (requires Dwarven Smithing Perk)\r\n3)Drop those automata onto the ground\r\n4)Shoot them with your control rod to power them up\r\n5)Wreak havok\r\n6)Shoot them again to power them down so you can pack them up and put them away . . . or use them as groovy statues to spruce up your rockin\\' hero-pad! (I don\\'t know why, but if you have trouble with this try aiming for the automaton\\'s \\\"feet\\\".)\r\n\r\nAlso, at no extra charge:\r\n\r\n-Upgrade your basic model automata with specialized modules.  These modules can  be found in dwemer loot, or built at a forge if you have read the correct instructions and possess the necessary parts.  Note that Spider Drones have unique support bonuses (extra carry weight and repair abilities) that they will lose when upgraded to a combat oriented model.\r\n\r\n-Build field repair kits that you can use on your mecha-minions to keep them in tip-top fighting shape! (Don\\'t tell anyone, but they\\'re secretly scrolls).  Go give FakePersonality some kudos for the way-cool custome model!\r\n\r\n-Leggy luggage!  Open up the storage compartment under your steam-powered friends\\' armor plating and store your gear there!  Once deactivated, whatever your little pal was carrying will be auto-magically transferred into your inventory - no muss, no fuss!\r\n\r\n-Build a training buddy!  Once activated, our special crash-test-spiders will become instantly hostile and start attacking you (and probably anything else  in sight).  Let them wail on you with low-power attacks to train your armor/restoration and/or wail back to train your weapon/destruction skills.  They\\'re  pretty durable, but as a safety feature they are built with highly conductive materials which make them quite weak to shock-based attacks.\r\n\r\n-BUILD A CENTURION!!!  By popular demand, I have enabled Centurions for crafting, though honestly I don\\'t understand the appeal.  They\\'re big, slow and don\\'t  fit through doors, but if you want one, you got one.  You\\'ll need a centurion dynamo (among other things) to build one, and most of those are currently in  use, so good luck with that.  However, there\\'s also a certain quest from which one acquires some \\\"ancient knowledge\\\" that may be useful...\r\n\r\n-Calcelmo has a new employee working at his museum in Markarth - what he doesn\\'t know, however, is that Arvail hasn\\'t got much in the way of employer lotalty, so if you\\'re in a bind and have more cash than time to blow you can always see him to pick up a few of the harder to reach items.\r\n\r\n-Having trouble finding that one special part needed for your newest mechanical pal?  No worries!  With the Advanced Armors perk, you can now craft your own cogs, gears, plate metal and what-have-you from dwemer ingots at the forge (under MISC).  If you have trouble finding control crystals and can\\'t afford Arvail\\'s prices, then you might be able to salvage one from a Centurion Dynamo (with Advanced Armors perk) or just create one yourself (with Arcane Smithing Perk).\r\n\r\n-Cock-a-doodle-BOOM!  Invented by an eccentric genius, these chicken-like automata patrol their surroundings just waiting for something stupid enough to get within arms-reach.  Be warned, once the fuse is lit on these little beasties, there\\'s no turning back!  Now available in fire (with big-time blow-back), ice (with an big-time slow down bonus), and shock (scrambles of IFF on ALL automata caught in the blast)\r\n\r\n-Dwemer Mechanthropes are an all-original automaton type available only with PDAM and nowhere else and available in two varieties; Type F (feminine) and Type M (masculine).  These Dwemer androids are as smart as any humanoid follower, and actually have the capacity for speech (though, admittedly, they aren\\'t exactly dazzling canversationalists . . .).  The base-line models are pretty handy on their own, but give them one or more of the upgrade modules that you\\'ve got laying around and unlock specialized abilities, allowing you to adapt your new best friend to whatever crazy situation you\\'ve gotten yourself into this time.  There are more details in \\\"Further Investigations into Dwemer Artifice\\\", so read up there before asking too many questions.  Also, please forgive the temporary model for the inert versions - I\\'m still trying to figure out how to add collisions.\r\n\r\nRECOMMENDED MODS:\r\n==========\r\n\r\nNature of the beast 2 - http://skyrim.nexusmods.com/mods/20721/ - to let you command the automaton in real time - You should definatelly try it for absolutely new gameplay. With this you dont have to fight at all. Let the automaton go forward instead and do the fighting fo you!\r\n\r\nMechanthropes will regard where ever they were activated as \\\"home\\\", so if you start one up someplace weird, [url=http://skyrim.nexusmods.com/mods/18045]My Home is Your Home[/url]\\\" might be handy.  Also, if you\\'re not using it already, [url=http://skyrim.nexusmods.com/mods/14037]UFO[/url] is really great, and will give your mechanthropes some useful options.\r\n\r\nAlso, \\\"[url=http://skyrim.nexusmods.com/mods/4020]Move it DAMNIT![/url]\\\" is exactly what I often to say to my favorite spider drone . . . \r\n\r\nIn my testing, I\\'ve been playing with [url=http://skyrim.nexusmods.com/mods/9286]SkyRe[/url], which is really awesome and you should totally be using it if you aren\\'t already.  Also, it has a major impact of difficulty, so if you feel that being a master artificer makes you too powerful SkyRe might help change your mind about that.\r\n\r\n\r\nFor asthetic considerations, it\\'s worth noting that I use [url=http://skyrim.nexusmods.com/mods/3227]\\\"Younger Females - Realistic\\\"[url] and [url=http://skyrim.nexusmods.com/mods/3800]Younger Male Facial Textures\\\"[/url], so it\\'s possible that your mechanthropes may look different than mine.  If they do, please please please post pictures of them and caption them with what face mods you\\'re using.\r\n\r\nFUTURE PLANS:\r\n==========\r\n\r\nMORE upgrade components - I\\'ve got two in mind right now that I think will be pretty awesome. \r\nUnique textures for variants (Which I can\\'t make myself because I have not artistic talent what-so-ever, so if you\\'re interested in contributing please PM me!)\r\nUnique models, schematics and textures for things like the control rod, upgrade modules, repair kits, and whatever else gets added (if you\\'re handy with those things, please PM me!)\r\nProper collision layers for all of the models that I\\'m actually using - please help! ;_;\r\nCraftable \\\"rebuild kits\\\" that wil allow reactivation of downed automata (this is close, but buggy)\r\nAdjust and re-balance smithing recipes and automata stats based on user feedback (hint hint)\r\nAdjust and re-balance recipes, values and rarity of modules, control crystals and crafting manuals\r\nNew and unique automata - steam-powered mounts, floating doomballs, that sort of thing (looking for a skilled modeller/animator for this - please help me!)\r\n\r\nCONTACT:\r\n==========\r\n\r\nThe NexusForums posting for this mod will always be a good place to put questions, comments, and suggestions regarding it, but if you prefer something more  personal then by all means feel free to PM me via the Nexus.  I’m easily distracted and might not reply quickly (or at all...), but I promise to read and  consider everything that users of the mod have to say about it.\r\n\r\nI welcome all comments and constructive criticism - without that, I\\'ll never be able to make this mod as awesome as it has the potential to be.\r\n\r\nRequirements\r\n==========\r\n\r\nNone.\r\n\r\nInstallation Instructions\r\n=================\r\n\r\nNow NMM-Ready!\r\n\r\nManual:\r\n1. Copy the archive\\'s contents to your Skyrim instalation folder and agree to whatever prompts you get.\r\n2. Launch Skyrim Launcher (or your mod manager of choice) and check the box next to \\\"Dwemer Artificer\\\"\r\n3. Play and Enjoy!\r\n4. Come back here and endorse. :D\r\n\r\nUninstallation Instructions\r\n===================\r\n1. Delete the esp from your data directory \r\n2. Delete anything that starts with \\\"PDAM\\\" from the \\\"data/scripts\\\" folder \r\n3. Forget the whole thing ever happened.\r\n\r\nIncompatability\r\n===========\r\n\r\nSome items have been added to Dwarven loot tables, meaning that any other mod that does the same will likely conflict with this one.  Those items can be purchased from Arvail at the Dwemer Museum, so all is not lost.\r\n\r\nBecause Mecanthropes equip upgrade modules as if they were armor, those items occupy an equipment slot.  In keeping with the conventions outlined [url=http://www.creationkit.com/Biped_Object]here[/url], I have chosen to use modules 60, 55, 48 and 44 in an effort to reduce potential conflict with other equipment mods.  It is possible (likely, even), that at some point you will have to choose between an upgrade module and some kind of shiney bauble or skimpy undies for your mechanthropes.  It\\'s hard, I know, but life is all about compromises.\r\n\r\nKnown Issues\r\n===========\r\n\r\nInert Spheres and Centurions have a weird habit of just hanging in midair. If you know anything about how to fix that, please let me know!\r\n\r\nThis mod should be considered BETA.  By downloading and installing it, you assume responsibility for any and all enjoyment, accidental or otherwise, that you  may receive from using it.\r\n\r\nAnd bad stuff, too.  You’re responsible for the bad stuff, not me.\r\n\r\nChange Log\r\n=========\r\n\r\n9/17/2012 v0.58 OMFG I\\'m tired of squashing bugs.  Enhanced compatibility with Nature of the Beast 2\r\n9/14/2012 v0.57 fixes for the last set of bug fixes\r\n8/27/2012 v0.56 Bug Fixes\r\n08/20/2012 v0.55 Minor tweaks to item names.  Added Mechanthropes, blast furnace, coolant tank (plus new sphere and spider types to use them) and acoustic dampener.  Added Fire and ice chicken bombs, tweaked damage/knockback on fire chicken bomb.  Adjusted Arvail\\'s inventory.  Added working repair ability for Spider Drones.  All automata are now leveled.  Control rod now calms hostile spheres and spiders.  Removed \\\"Advanced Armor\\\" requirement for upgrading automata.\r\n06/15/2012 v0.42 Added new craftable chicken bombs and custom repair kit model.  Tweaked shaders for upgraded automata.  Tweaked Drone stats to make them use thier tazer attack more often.\r\n06/5/2012 v0.4 Added crafting recipes for automaton components, specialized upgrade modules (and, in turn, specialized and upgraded automata types) and Centurions(!!).  Changed recipe for inert spheres.  Tweaks to automata levels.  Added books that add PDAM items to the crafting menu when read, and remove them when read again.  Spider Guardians became Spider Drones, and recieved a number of support-oriented abilities.\r\n02/15/2012 v0.2 Rewrote the whole system to rely on scripts rather than magic, Increased the friendly spider\\'s movement speed (tired of waiting for him), chose a more powerful version of the Sphere for crafting, \r\n02/09/2012 v0.1 Enabled crafting of companion Spider and Sphere Guardians\r\n\r\nCredits\r\n======\r\nThanks to Bethsoft, naturally\r\nThanks to PurpleLunchbox, SaidenStorm, Cipscis, cscottydont, and Amethyst Deceiver on the Bethsoft forums for helping resolve my scripting issues - the mod wouldn\\'t have happened without  them!\r\nThanks to Mujuro for helping me understand how to make the repair ability work.\r\nThanks to ArcaneSmith for the script that makes the crafting manuals work the way they do\r\nThanks to Venzar for the Readme generator\r\nThanks to you for playing and endorsing this mod (hint hint)\r\nThanks and thanks again to FakePersonality for creating the awesome chicken texture and repair kit model.  Seriously, go give him kudos, he deserves it.\r\nThanks to me for wasting waaaaay too much time trying to make this friggin thing actually work.\r\n\r\n\r\nLicensing\r\n=======\r\n\r\nBecause I’m too lazy to manage files on multiple sites, I will only be posting this mod to Skyrim Nexus, however I really don’t mind if someone else wants to  take the initiative that I lack to post it elsewhere.  In fact, I would consider it a personal favor and all I ask is that you do me the courtesy of letting  me know where you’ve put it - mostly so I can post links on the mirrors page.  I don\\'t even care that much about credit.\r\n\r\nTranslations are also welcome, and encouraged!  Please let me know if you translate this mod so that I can post a link to your translation on the mirrors  page.",
  "categoryId": "65",
  "version": "0.60",
  "author": "Phayze81",
  "createdUnix": "1328754409",
  "updatedUnix": "1360306943",
  "containsAdultContent": false,
  "uploadedBy": "phayze81",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27480",
      "name": "Phayzes Dwemer Artificer Mod",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "7",
      "fileName": "Phayzes Dwemer Artificer Mod-8389.rar",
      "uploadedUnix": "1328754537",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/caaca671977827549883ddf84f99851ee924dfc4450dd30054da0e0e736e8b84/analysis/1406662926/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phayzes%20Dwemer%20Artificer%20Mod-8389.rar?fid=27480&ttl=1535767067&ri=8192&rs=8192&setec=e6814b734c2b25120d8b8e0b1b9aa8e7"
    },
    {
      "fileId": "32775",
      "name": "Phayzes Dwemer Artificer Mod v02",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "8",
      "fileName": "Phayzes Dwemer Artificer Mod v02-8389-0-2.rar",
      "uploadedUnix": "1329512643",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/7aaed1dd12ca94ed65dab7393fdab14c53946519b8d5d3a9697b52d62a6f50c2/analysis/1406691004/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phayzes%20Dwemer%20Artificer%20Mod%20v02-8389-0-2.rar?fid=32775&ttl=1535767068&ri=8192&rs=8192&setec=d9e9b587e68ffa7c23f854389b73d9ab"
    },
    {
      "fileId": "66230",
      "name": "Phayzes Dwemer Artificer v04",
      "version": "0.4",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "33",
      "fileName": "Phayzes Dwemer Artificer v04-8389-0-4.rar",
      "uploadedUnix": "1338949656",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/7d219d054e7179e9ce72313b22e20e7734300b59357f6547c593e970cf3d8ef9/analysis/1406941563/",
      "changelogHtml": " Added crafting recipes for automaton components, specialized upgrade modules (and, in turn, specialized and upgraded automata types) and Centurions(!!) <br/> \n Changed recipe for inert spheres <br/> \n Tweaks to automata levels <br/> \n Added books that add PDAM items to the crafting menu when read, and remove them when read again <br/> \n Spider Guardians became Spider Drones, and recieved a number of support-oriented abilities <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phayzes%20Dwemer%20Artificer%20v04-8389-0-4.rar?fid=66230&ttl=1535767068&ri=8192&rs=8192&setec=ef55da0f1d41dae11ce33ae439398880"
    },
    {
      "fileId": "68261",
      "name": "Dwemer Artificer 042",
      "version": "0.42",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1214",
      "fileName": "Dwemer Artificer 042-8389-0-42.rar",
      "uploadedUnix": "1339804712",
      "modVersion": "0.42",
      "virusScanUrl": "https://www.virustotal.com/file/087372477ef90a3eadfb93be3ec3aa586deb3e9eaf40dddf4e6359b033392d2d/analysis/1406962090/",
      "changelogHtml": " Adjusted shaders for customized automata <br/> \n Adjusted spider drones so they&#39;ll use their ranged attack <br/> \n Exploding chickens <br/> \n Calmed overly aggressive automata <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Artificer%20042-8389-0-42.rar?fid=68261&ttl=1535767069&ri=8192&rs=8192&setec=767d6bd8c11acf92325ae3680cb78039"
    },
    {
      "fileId": "83130",
      "name": "Phayzes Dwemer Artificer Mod v055",
      "version": ".55",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1746",
      "fileName": "Phayzes Dwemer Artificer Mod v055-8389--55.rar",
      "uploadedUnix": "1345512107",
      "modVersion": ".55",
      "virusScanUrl": "https://www.virustotal.com/file/c186cb85cb4a28b0f9a007c71f98736a87c420295a1bf4bb39256bf23d4a987f/analysis/1407111245/",
      "changelogHtml": " Added new fire- and ice-based units and upgrade parts.  New chicken bomb flavors. spider drones now repair thier pals.  All automata are now leveled <br/> \n Renamed a bunch of dwemer clutter for easier sorting.  Removed \\\"Advanced Armors\\\" requirement for upgrading basic automata.  Modified Arvail\\'s inventory of supplies. <br/> \n NEW AUTOMATON TYPE!!  Added Dwemer Mechanthropes <br/> \n Added a calming effect to the Control Rod that works on all Dwemer Spiders and Spheres. Remade the upgrade modules from misc objects into armor objects for Mechanthrope special fearures. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phayzes%20Dwemer%20Artificer%20Mod%20v055-8389--55.rar?fid=83130&ttl=1535767069&ri=8192&rs=8192&setec=4acb11a313a443be51b7aa25117c8678"
    },
    {
      "fileId": "89077",
      "name": "Phayzes Dwemer Artificer Mod v058",
      "version": "0.58",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1810",
      "fileName": "Phayzes Dwemer Artificer Mod v058-8389-0-58.rar",
      "uploadedUnix": "1347926029",
      "modVersion": "0.58",
      "virusScanUrl": "https://www.virustotal.com/file/45283fa5eca633ace7f89e04089518db4fa948d6036ce780f9312abce21472cc/analysis/1407171854/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Phayzes%20Dwemer%20Artificer%20Mod%20v058-8389-0-58.rar?fid=89077&ttl=1535767070&ri=8192&rs=8192&setec=5b2e1d0954ca6b9a2db0bc3676f02cf3"
    },
    {
      "fileId": "1000007964",
      "name": "Dwemer Artificer",
      "version": "0.60",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "359",
      "fileName": "Dwemer Artificer-8389-0-60.7z",
      "uploadedUnix": "1360306943",
      "modVersion": "0.60",
      "virusScanUrl": "https://www.virustotal.com/file/f46ce8726687ffe1cbd3338c3b5a2152699195d2273af4e8231aa33920937777/analysis/1407404283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Artificer-8389-0-60.7z?fid=1000007964&ttl=1535767070&ri=8192&rs=8192&setec=c9e5a4223c5bf0f08cd83248452859ac"
    }
  ]
}