{
  "modId": 84078.0,
  "modName": "The Humble Riverwood House Mod",
  "summary": "A humble, lively detailed peaceful abode and a retreat in one of the most beautiful villages of southern Skyrim, Riverwood.",
  "descriptionHtml": "Ever felt like Riverwood is probably the most well built places in Skyrim? Do you also just love the serenity and peace the Riverwood offers you? \r<br />The lack of the option of placing a house at one of the gorgeous places Skyrim offers and waste of space together with riddiculus clutter in the house options offered to the dragonborn lead me into building my own. Now, as this little project which took a couple of days of work has turned into a very finely detailed house and readily avaible for anyone wishing to own their own house right there in the calm envoirement of Riverwood. \r<br />\r<br />House itself is built across the other side of Riverwood from the sawmill right on the edge of the river and in between the soothing stream coming down from top of the hill, together with a secluded backyard behind the house with variety of tools, a crude shack and a nice porch that one can easily spend their entire retirement in while staring at the gorgeous riverside view of Riverwood. Interior of the house has finely detailed two floors but more strikingly also presents a set of stairs going down below the lower floor to a small basement that is hosted by an underground cavern, which is nicely fed through the grates with the waters of the river flooding right next to the house. This striking feature makes a supply of fresh water (and a small pond to swim/wash in) always be avaible to the occupants of the house. \r<br />\r<br />[b][u]Prominent Features\r<br />[/u][/b]-Underground storage cave/basement mixture with it&#39;s cozy and calm ambiance. \r<br />-Grates that connects the river to your basement. Drink your thirst away from the pond if you have those mods.\r<br />-Friendly to NPCs and dogs. They will find many things to do in the house when they are free, such as dangling their feet down into the small pond, or sitting down at the edge of the river around the house and watching the great view.\r<br />-Clutter free but finely detailed and furnished. You won&#39;t have tons useless jugs flying all over the place just because the Dragonborn accidentaly sneezed a Fus, or furniture flying around just because you decided to simply walk around your own home.\r<br />-Hosts 2 single beds and a large double bed.\r<br />-Decent storage.\r<br />-Features smelter(lacking in Riverwood), forge, leather tanning rack, armor table, weapon sharpener, enchanter and alchemist workplaces.\r<br />-Fits in flawlessly with Riverwood ambiance.\r<br />-Built only with in game stuff, no extra meshes or textures required.\r<br />-Should be solid and stable, after all there&#39;s really not much that can go wrong.\r<br />\r<br />[b][u]What this mod does/ What this mod changes\r<br />[/u][/b]-Adds a player owned house across the sawmill in Riverwood.\r<br />-Adds a new cell that is the interior of the house.\r<br />-Gives the player access to all crafting stations and some storage.\r<br />-Slightly changes and adjusts the small patch of land on the said area.\r<br />-Changes and improves the navmesh in the said area.\r<br />-Adds a lot of markers around for making npcs act realistic and do stuff.\r<br />-Creates a small backyard behind the house.\r<br />-Relocates a few trees and rocks.\r<br />-Subtly adds some roads and walkways.\r<br />-Adds a couple of plants and flora.\r<br />-Adds tested navmeshes. NPCs will act like sane people. (hopefully)\r<br />-Adds tons of tested markers for NPCs to perform actions. (no animals were harmed in testing of this product)\r<br />\r<br />[b][u]Installation/Removal\r<br />[/u][/b]Either drag&drop the .esp into your Data folder inside your Skyrim folder, or use a mod management program such as MO or NMM.\r<br />For getting rid of it, either uncheck the esp, delete the .esp file from your Skyrim folder or use a mod managemet program to remove or delete the .esp file.\r<br />\r<br />\r<br />[b][u]Conflicts\r<br />[/u][/b]1-It would cause issues with a mod that adds something big or makes a big change to the said patch of land. Such as more RIVERWOOD mod.\r<br />2-You might get some minor clipping issues about mods that add clutter like wooden logs, extra trees, rocks, grass, flora or similar. One such mod is appearantly Immersive Fallen Trees, which adds a dead tree trunk in the middle of the backyard of this house. It&#39;s pretty simple and quicker to remove the said single object from Immersive Fallen Trees or similar mod in-game manually with &#39;disable&#39; or &#39;markfordelete&#39; commands if you wish. For that, you simply need to walk up to an object you want gone, drop down the console menu, carefully click and select the correct unimportant object and make sure it is the right object, type in either &#39;disable&#39; (makes the selected thing go invisible and uninterractable) or &#39;markfordelete&#39; (completely and cleanly removes that item from the game). And its gone. Make sure you [u]never disable or delete any important object[/u] but obviously it&#39;s no problem to delete/disable a tree, a bush or a dead tree trunk. Or, well, I could always make a patch mod that removes any unintended object lying around somewhere for reported mods that conflict. Though it feels like it&#39;s a bit of an overkill to do that and waste a mod space.",
  "categoryId": "67",
  "version": "1.0",
  "author": "Percivus Keenblade",
  "createdUnix": "1495571702",
  "updatedUnix": "1495580705",
  "containsAdultContent": false,
  "uploadedBy": "Elamire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000245102",
      "name": "The Humble Riverwood House Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "232",
      "fileName": "The Humble Riverwood House Mod-84078-1-0.rar",
      "uploadedUnix": "1495580705",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2b625638a1a6a69f429a9de5bc7baa06fdc56e9217245ed929740ca1589608e4/analysis/1495581062/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Humble%20Riverwood%20House%20Mod-84078-1-0.rar?fid=1000245102&ttl=1535872895&ri=8192&rs=8192&setec=fd0cd31c30a94f8a7f273bdaa2e9cedf"
    }
  ]
}