{
  "modId": 84083.0,
  "modName": "ANDALON- A Growing Story",
  "summary": "In the land of Andalon, any adventure awaits. In the first story, &#34;A Bard&#39;s Tale&#34;, take on the life of a bard in capture and build your legacy from there. This game is in early development and will have updates frequently.",
  "descriptionHtml": "[b][center]In the land of Andalon, any adventure awaits. In the first story, &#34;A Bard&#39;s Tale&#34;, take on the life of a bard in capture and build your legacy from there. This game is in early development and will have updates frequently.[/center][/b]\r<br />[center][size=5]With over 1000 hours of world building, quest and lore development, complete magic and weapon mechanic overhaul, Extreme NPC detail and MORE.[/size][/center]\r<br />With this mod, I have a vision of not just one country of a bigger kingdom but a literal world you can travel upon. It&#39;s a big task that I have undertaken but not with frailty&#33; The game will expand on itself through future patches (being lore friendly) adding at least 50 hours of content with each patch. Well...at least that is the goal. \r<br />\r<br />There will be tons of main story line quests: so far within the first mod there are 10 currently in mod and and 10 more in development. The premises are listed just below&#33;\r<br />\r<br />[size=5][center]Main Quest Prompts (always updated...)[/center][/size]\r<br />[center][size=4]World&#39;s Throne[/size][/center]\r<br />The Counsel in the High City are meeting under rare circumstances: The King has died with no heir to the throne. To try and prevent a World War for the High City Throne, the Counsel must meet to research and find the proper heir to the throne. Help the Counsel find the Heir or pick a kingdom and fight for their &#34;right&#34; to the World&#39;s Throne.\r<br />\r<br />\r<br />[size=4][center]For Blood and Honor[/center][/size]\r<br />There has been a underground faction that secretly rules half of Andalon, pushing addicting potions and flora, fixing local elections and other gangster related hijinx. Through talk through local taverns, you discover there are plans for global dominion by dark forces. Disband the faction and bring peace back to Andalon or join their ranks and corrupt the lands of Andalon.\r<br />\r<br />[size=4][center]A Bard&#39;s Tale[/center][/size]\r<br />Bard&#39;s have been revered in Andalon since the beginning of time. With their skills to put history into song and to entertain, bards have had a way to help Andalonians escape their every day lives toiling in the fields, smithing in the forge or bleeding for the crown in battle and conquests. Travel over Andalon and learn new tales, new songs, find new instruments, perform for royalty, perform at the local taverns and create a name for yourself&#33; Unlock your true Bard ability.\r<br />\r<br />[size=4][center]The Frozen Keep[/center][/size]\r<br />The Ancient kingdoms of Andalon are starting to become abandoned as if overnight. Homes left intact as if the owners are about to return from town with provisions with little signs of battle or resistance. The only signs of change are the atmospheres in which the airs have become thick and cold. The Counsel of The High City are searching for adventurers to search these places for an answer.\r<br />\r<br />\r<br />[size=4][center]Fahren[/center][/size]\r<br />The Gaiaons are the Earth elves of Andalon divided into 2 main races: Gaiaon and Under-Gaiaon. Gaiaons live mainly above ground within heavily wooded forest areas. Under Gaiaons live deep underground in caves and within mountains and mines. The Gaiaons are in a civil war over political issues dealing with human settlements in Gaiaon lands but something far more sacred is at stake: The Secret City of Fahren, the source of life of all of Andalon.\r<br />\r<br />\r<br />[size=4][center]The Black Horde[/center][/size]\r<br />Anton Falkwood is a gangster gone rogue and with a plan. After the Iron King exiled Anton for helping the poor against strict law, Anton vowed to destroy the Iron Kingdom and bring a new way of life to the tortured and suppressed people of the Iron City. After lawfully taking over an ancient civilization, Anton has started his quest for local conquest of the Iron Kingdom and it&#39;s neighboring lands. You can choose to stop or join the conquest. all you have to do is hear him out and make your decision.\r<br />\r<br />[size=4][center]VOID: An Adventure Series[/center][/size]\r<br />[size=2]VOID is a strange place conjured by a faction of Arcane masters deep within the Krastenbraag, a massive mountain range that stretches between three different extreme climates: Arid, Ice and Fire. These mages within the Arcane Collective of Andalon have spent hundreds of years developing new worlds within the universe called Voids. Voids are the Mage&#39;s attempt to try and connect different worlds and universes through arcane arts. \r<br />\r<br />[/size]Voids are a great way to unlock new spells, abilities, weapons and spells. \r<br />\r<br />VOID is meant to be a fun, adventure type of game within this mod. Think of Super Mario 64, there will be keys and soul gems that unlock special doors to small and medium worlds. There will be small story lines for each VOID to provide a cause whether you are saving something or defeating a boss. \r<br />\r<br />[center][size=5]We are currently, in tandem with this mod, are creating our showcase demo, Falkwillow Isle. \r<br />[/size]\r<br />We have been developing our demo to raise funds for further development of the main mod. I am looking to expand the dev team from 1 to more than one. Main needs are animation design, asset design and world building. Donate and download to help us with this game&#33; [/center]\r<br />",
  "categoryId": "28",
  "version": "Alpha0.0.1",
  "author": "Drew Marshall",
  "createdUnix": "1495589019",
  "updatedUnix": "1495589015",
  "containsAdultContent": false,
  "uploadedBy": "peenarscrotech118",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000245108",
      "name": "AndalonFile",
      "version": "0.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "297",
      "fileName": "AndalonFile-84083-0-0-1.zip",
      "uploadedUnix": "1495589015",
      "modVersion": "0.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/3c18a9e4aea06e88dd884bd347ddb7b09648fdd986cf7a7da218af1f8ecf4270/analysis/1495589343/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/AndalonFile-84083-0-0-1.zip?fid=1000245108&ttl=1535872899&ri=8192&rs=8192&setec=b1cb6233739905846aceb2e2b6de5587"
    }
  ]
}