{
  "modId": 84166.0,
  "modName": "Olaf and Gabriel",
  "summary": "A scaled boss fight with great rewards.",
  "descriptionHtml": "[size=3][u]ENGLISH DESCRIPTION[/u]\r<br />\r<br />[color=#ff7700]I stop modding so if there&#39;s a mistake not found until now, don&#39;t ask me...\r<br />I won&#39;t be able to modify anything myself now because I delete everything from my PC.\r<br />I&#39;ve really done my best to be sure my mods are flawless so I hope they&#39;re..\r<br />I allow everyone to use, modify, translate and improve my mods as long as you credit me.[/color]\r<br />\r<br />You don&#39;t need any DLC to use this mod.\r<br />Tested many times, my mod doesn&#39;t crash the game.\r<br />\r<br />[u]Content :[/u]\r<br />\r<br />First of all, you obtain a scroll.\r<br />With this scroll you can call two puppets but not in interiors.\r<br />If you try in an interior you&#39;ll have another scroll and nothing happens.\r<br />\r<br />If you kill the evil one, you obtain two spells, a weapon and an armor.\r<br />There is a spell which is a Storm Call with the music as release sound.\r<br />You need to keep the spell equipped if you want to hear the music until its end.\r<br />The other one will summon a magical being, they are six randomized magical beings.\r<br />\r<br />If you kill the kind one who can be a follower,\r<br />you obtain a weapon, a shield and an armor.\r<br />\r<br />You can take their souls and weapons by killing them. They are enchanted.\r<br />You&#39;ll only loot useless items BUT you can upgrade them at the forge with required perks.\r<br />You must CHOOSE between two upgrade paths, light (hide) and heavy (iron) armor.\r<br />You can&#39;t change of path after this first choice. Weapons don&#39;t have paths.\r<br />\r<br />Enchantments will upgrade with your skills.\r<br />If you find enchantments useless :\r<br />On Souls - up everything, there are bonuses for each skill tree if you reach 75 in it.\r<br />The Shield follows this kind of bonus enchantment too.\r<br />On Weapons - up enchanting, destruction, alteration and conjuration to have all effects.\r<br />\r<br />Have fun &#33; Don&#39;t forget to rate the mod &#33;\r<br />\r<br />[u]Credits[/u]\r<br />\r<br />I’ve done everything myself but the music of course.\r<br />The music is from a website providing free musics we can use but with conditions &#33;\r<br />The author (Symheris) must be credited and we can only provide the original music.\r<br />Here&#39;s the link to the music : [/size][url=http://www.auboutdufil.com/index.php?id=295][size=3]http://www.auboutdufil.com/index.php?id=295[/size][/url][size=3].\r<br />Here&#39;s the link to the license : [/size][url=http://creativecommons.org/licenses/by-nd/4.0/deed.en][size=3]http://creativecommons.org/licenses/by-nd/4.0/deed.en[/size][/url]\r<br />\r<br />\r<br />\r<br />[size=3][u]DESCRIPTION FRANÇAISE[/u]\r<br />\r<br />[color=#ff7700]J&#39;arrête de modder donc ne me demandez pas si vous trouvez une erreur..\r<br />Je ne serai plus dans la capacité de résoudre les problèmes puisque je supprime tout.\r<br />J&#39;ai vraiment tout vérifié pour qu&#39;il n&#39;y ait aucune erreur donc j&#39;espère que c&#39;est le cas..\r<br />J&#39;autorise tout le monde à utiliser, modifier, traduire et améliorer mes mods\r<br />avec pour seule condition de me mentionner dans les crédits pour le travail fourni.[/color]\r<br />\r<br />Vous n&#39;avez besoin d&#39;aucun DLC pour ce mod.\r<br />Testé maintes fois, mon mod ne fait pas crasher le jeu.\r<br />\r<br />[u]Contenu :[/u]\r<br />\r<br />Vous récupérez tout d&#39;abord un parchemin.\r<br />Avec celui-ci, vous pouvez appeler deux marionnettes mais uniquement à l&#39;extérieur.\r<br />Si vous essayez à l&#39;intérieur vous recevrez un autre parchemin, rien de plus.\r<br />\r<br />Si vous tuez le méchant, vous obtiendrez deux magies, une arme et une armure.\r<br />Une des magies est un Appel de la Tempête avec comme son une musique.\r<br />Gardez le sort équipé pour entendre la musique jusqu&#39;au bout.\r<br />L&#39;autre sort invoque une entité magique aléatoire entre six différentes entités.\r<br />\r<br />Si vous tuez le gentil qui peut vous accompagner,\r<br />vous obtiendrez une arme, un bouclier et une armure.\r<br />\r<br />Vous pouvez récupérer leurs âmes et armes enchantées en les tuant.\r<br />Les objets récupérés sont inutiles MAIS vous pourrez les améliorer à la forge avec les perks requis.\r<br />Vous devez CHOISIR entre deux chemins d&#39;amélioration, armure légère (peau) ou lourde (fer).\r<br />Vous ne pourrez pas changer de chemin après ce premier choix. Les armes n&#39;ont pas de chemin.\r<br />\r<br />Les sorts et enchantements évoluent selon vos compétences.\r<br />Si vous trouvez les enchantements inutiles :\r<br />Sur les Ames - montez toutes vos compétences, il y a des bonus pour chaque arbre\r<br />de compétence à partir du moment où vous atteignez 75 dans celui-ci.\r<br />Le Bouclier est aussi dans cette catégorie d&#39;enchantement bonus.\r<br />Sur les Armes - montez enchantement, destruction, altération et conjuration\r<br />pour profiter de tous les effets des armes.\r<br />\r<br />Amusez-vous bien &#33; N&#39;oubliez pas de noter le mod &#33;\r<br />\r<br />[u]Crédits[/u]\r<br />\r<br />J’ai tout fait moi-même sauf la musique bien entendu.\r<br />La musique provient d&#39;un site distribuant des musiques libres sous certaines conditions &#33;\r<br />L&#39;auteur (Symheris) doit être crédité et nous ne devons fournir que la musique originale.\r<br />Voici le lien vers la musique : [/size][url=http://www.auboutdufil.com/index.php?id=295][size=3]http://www.auboutdufil.com/index.php?id=295[/size][/url][size=3].\r<br />Voici le lien vers la license : [/size][url=http://creativecommons.org/licenses/by-nd/4.0/deed.fr][size=3]http://creativecommons.org/licenses/by-nd/4.0/deed.fr[/size][/url]",
  "categoryId": "28",
  "version": "1",
  "author": "Zaestryon - Music by Symheris",
  "createdUnix": "1495826013",
  "updatedUnix": "1495838682",
  "containsAdultContent": false,
  "uploadedBy": "Zaestryon",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000245370",
      "name": "Olaf and Gabriel EN",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37389",
      "fileName": "Olaf and Gabriel EN-84166-1-01.7z",
      "uploadedUnix": "1495838261",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/ad6a456dc40b756d1b0d8dc33464b92ccb98066f289b71d49d781b74dd744a1d/analysis/1495838467/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Olaf%20and%20Gabriel%20EN-84166-1-01.7z?fid=1000245370&ttl=1535872990&ri=8192&rs=8192&setec=4b7e364c117bd9f440a18bcd25bdfa1f"
    },
    {
      "fileId": "1000245371",
      "name": "Olaf et Gabriel FR",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "37389",
      "fileName": "Olaf et Gabriel FR-84166-1-01.7z",
      "uploadedUnix": "1495838682",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/df0184cda869569cb10ef9e61000e2dc7fc79ea99b15c42aae509bfed35499c9/analysis/1495839008/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Olaf%20et%20Gabriel%20FR-84166-1-01.7z?fid=1000245371&ttl=1535872991&ri=8192&rs=8192&setec=68ca4067e99fa2eff1a344fa1c96ad8a"
    }
  ]
}