{
  "modId": 8419.0,
  "modName": "Vampires sans sun debuff",
  "summary": "vampirism without the pesky sun debuffs!",
  "descriptionHtml": "---DESCRIPTION---\r\n\r\nSimply put, this mod removes the health, stamina, and magicka reductions normally incurred by skyrim vampires.  It also enables health, magicka and stamina regen.  \r\n\r\nI found the constant decrease in stats rather bothersome, and, while some may enjoy it in their play style, I do not.\r\n\r\nsurprisingly, this mod is, if you want to examine overall vampire lore, quite lore-friendly.  In the 1896 Bram Stoker Dracula novel, no vampires ever suffer damage or weakness in sunlight.  The only factor that can be considered a weakness is that whatever form the vampire is in when the sun rises is the form he is in until the sun sets.  (meaning if Dracula is in bat form when the sun rises, he\\'s stuck as a bat until the sun sets).  Considering the player is the Dragonborn, with the capacity to become almost a demi-god, I felt it could also fit that he/she can bypass the normal limitations of the vampires.\r\n\r\nI hope you folks will enjoy it :)\r\n\r\nif you like it, endorsements are always appreciated :)\r\n\r\n---CONFLICTS---\r\n\r\nthis mod will almost certainly conflict with other vampirism altering mods, primarily because the mods also alter the sun debuff, or have the vanilla debuff somehow saved into them.  so depending on your load order, or perhaps just in general, you will see my mod\\'s effect overridden by other mods.  You can try adjusting the load order, or you can edit the other vampire esp files yourself.  it\\'s very easy to change.\r\n\r\n\r\n---INSTALLATION---\r\n\r\nplace the .esp in your skyrim > data folder.  make sure it\\'s checked off in your load launcher menu.\r\n\r\n---UNINSTALLING---\r\n\r\nsimply remove the .esp\r\n\r\n",
  "categoryId": "93",
  "version": "1.00",
  "author": "Fewrfreyut",
  "createdUnix": "1328764708",
  "updatedUnix": "1328765377",
  "containsAdultContent": false,
  "uploadedBy": "Fewrfreyut",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27554",
      "name": "Vaimpires sans sun debuff",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Vaimpires sans sun debuff-8419-1.rar",
      "uploadedUnix": "1328765377",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/3fd5bf534c98e013c97e14b85665c020d553fbf898f062a89e4bcb1cc64d08bc/analysis/1406663283/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Vaimpires%20sans%20sun%20debuff-8419-1.rar?fid=27554&ttl=1535767122&ri=8192&rs=8192&setec=de75e67349afeebd622a712347998013"
    }
  ]
}