{
  "modId": 84253.0,
  "modName": "Red Wood- A Dark Souls Inspired Mod",
  "summary": "A small town mod that was inspired by Darksoul's Blighttown and can be used to role play as a bandit.",
  "descriptionHtml": "[b][u][font=Verdana][size=6]UPDATE AS OF JUNE 01 2018:[/size][/font][/u]\n<br />\n<br />[/b][font=Verdana][size=4]Hey all,\n<br />\n<br />[b]Now:[/b]\n<br />[/size][/font][font=Verdana][size=4]   ﻿I finished adding over 3450 armor pieces and about 1150 weapons to my mod.  I used about 350 armor and weapon mods for this.  I error checked them and almost all work except for 7.  To fix them it seems like using high heels mod does the trick.  The errors are invisible feet, feet through the floor, and wrong body type for the armor / clipping issue (UNP chosen instead of CBBE).  I also added the spells and enchantments associated with them.  Almost every item can be tempered but none can be made at the forge.  They will have to be purchased from vendors (this was my own personal tweak because it felt not lore friendly to know all these recipes in weapon and armor creation).  Every asset is custom named (zz_.NameOfTheOriginalAsset) so their will not be any problems when opening up another mod with this mod and there is not a thousand duplicate files.  I also included many modders' resources for future use following the custom name trend to help with any confusions.  I added in a new dungeon, interior cells for all buildings, new buildings, a path to the bottom of the waterfall, new bridges, new entrances, new exits, and new pathways.\n<br />\n<br />[b]Future:[/b]\n<br />   ﻿Plans for the future include the following:  [b]BOOST the frame rate of the player while in the city [/b](In order to do this I need to obscure the players view by adding more buildings to block long distances in some areas), edit the buildings to prevent them looking so vanilla, create a several quests (One:  Earning the bandits respect causing them to be friendly with you and not attack you on site.  Two:  simple raids on merchant carts and ships.  Three:  Some sort of fighting event.  Four:  Obtaining a house.  Five:  Being allowed in all areas.  Six:  Price decreases), create followers (normal bandits/anime characters/book characters/video game characters) depending on what file you want to use, fix shortcut to blackreach by creating some small dungeon to face, create trainers (I am still struggling with this but I think I might know the problem), add new armors and weapons to merchants, edit their prices to be expensive early game and be brought down through completion of quests, add more modders' custom resources, a bandit style player home, change the armor of npc's to include storm-troopers and imperials sets as to represent soldiers that turned to banditry, find a more lore friendly location for the mod (I want it to be in the blackreach area above ground and be near the ocean for lore purposes), have falmer and city guard spawned attacks, create mod specific spells and powers as rewards, and of course get permission for everything.\n<br />\n<br />[b]Boost Performance Issue Fixes:[/b]\n<br />   ﻿I plan to lessen the disk space this mod will use by deleting extra assets not used in the final product.  I will also use the TESV CleanEditTool to clean any errors that were not deleted by the creation kit.  I may look into creating a .BSA file to help with it too.  To minimize the amount of disk space or memory this mod takes up, I will also ask permission for the nexus release (Part A).  I imagine many of the more popular modders will say no so it should clear up space for the nexus release.  My own personal release (Part B) will be edited to my own preferences and will not be uploaded to the nexus (message me if you have questions).  A modder's release (Part C) will be available to download through google drive containing everything that was not deleted for future use.  \n<br />\n<br />[b]How Can This Be Lore-Friendly And Will It Be Available For The Special Edition:[/b]\n<br />   ﻿I do intend to make this mod for the special edition after I finish everything.  I feel like everyone is porting their mods to it and I intend to do the same.  My reason for making this mod is that I wanted a mod to get rid of random armor chests, weapons, armors, and etc. being placed about for convinced.  I was also annoyed when trying to smelt armor and weapons it was hard to find them in the list of gray out items.  This mod will provide a way for non-lore friendly weapons, armors, and followers to be implemented in the game.  Imagine you are bandit and you attack a merchant ship.  Upon that ship you and your crew come across some strange goods from a far off land.  You take the haul back to your camp where you can sell it, show off, keep to yourself, and split it up with the group.  Imagine if you take prisoners back, where would you hold them?  The jail probably, if you do not kill them first.  What do you do if shady strong characters visit?  Normally you would keep a close eye on them before attacking them.  What do you do if a weak character visit that could be consider easy prey?  You attack them and try to get their stuff.  What do you do if high moral character visits?  You kill them before they can rat you out.\n<br />\n<br />[b]Next Mods:[/b]\n<br />Plans for the future:\n<br />- Play the game\n<br />- Create a mod that adds more destroyed merchant carts\n<br />- Create a mod that adds more traps around settlements off the beaten paths (bear traps)\n<br />- Create a mod that adds the lost woods from the Legend of Zelda Ocerina of Time near Falkreath as well as Links village (Deku Tree)\n<br />- Create a mod that takes player to a desert and the goal is to escape\n<br />\n<br />\n<br />\n<br />[/size][/font][font=Times New Roman]UPDATE:[/font]\n<br />[size=3]\n<br />[/size][size=4]Hello all, I've working on my mod and I've finished Step 1 in Phase B.  There are a few errors with the armors and weapons from the other mods.  I fixed all the errors with the cross over from other modder's resources.  \n<br />\n<br />Next, I'm going to add onto the city to make more levels to the city.  This will include the creation of interior cells for most the buildings in the mod and more.  I will create a basement level that the players can access a dwarven lift to and from Redwood.  Also I will move the location for RedWood to a better and more lore friendly location along the coast.\n<br />\n<br />Following, I will create trainers, followers, and bards to fill in these locations.[/size]\n<br />\n<br />[b][size=6]This is my first mod that I published to the Nexus.  Please let me know what you think![/size][/b]\n<br />\n<br />[u]Background Information:[/u]\n<br />\n<br />I've spent much time trying to perfect this mod to my own happiness.  I successfully was able to create merchants to buy and sell as well as a player home.  I was not however able to create a trainer for skills.  I do not wish to spoil the surprise in how to access the house but think like a bandit.  The town also offers a shortcut to Blackreach as well.  The town has its own Dwarven Mine specialized in Dwarven metal and gold.  I do not wish to tell how to access the bandit tribe but follow the path along the lake shore after you leave bleak falls barrows to the west.  Only one character can be killed minus the guards (might change in the future so that every character can be killed).  It has a full working guard system as well.\n<br />\n<br />[u][b]Lore:[/b][/u]\n<br />\n<br />A bandit tribe called this little cave home, using it as their base of operations.  They were pillaged many east empire company trading ships and when they heard about what happened to Helgen they halted their large scale operations.  Since halting their large scale operations they focused their time discovering the dwarven ruins inside the cave and their mines.\n<br />\n<br />[u][b]Plans For the Future:[/b][/u]\n<br />\n<br />Phase A:  \n<br />1. I am planning on editing the mines so falmer attack once a week as well as other bandits attacking from outside the town.  \n<br />2. I want to create trainers but I am having a problem with doing so if you know how to please let me know.  \n<br />3. After that I want to create Dwemer cave system that is currently blocked off now.  \n<br />4. Use other modder's resources to incorpiate with my mod.\n<br />5. Create followers from the town.\n<br />6. Create an Inn.\n<br />7. Create a bard.\n<br />\n<br />Phase B: (For my own enjoyment) \n<br />1. Use other people's armor and outfit mods so my shop can sell it.  This way I can eliminate having 100 armor esps and random chests popping up across skyrim.\n<br />2. Use the place to create many different followers and marriage partners from different video-games, manga, and anime (darksouls, fairy-tail, berserk, Grimgar fantasy and ash, GATE, Legend of Zelda, Witcher, Naruto, One Piece, Rwby, Final Fantasy, Sword Art Online, Attack on Titan, ReZero, and etc.).\n<br />3. If interested in this update, message me because I will not post it because of copy right reasons and it will take time to get permissions from other authors.\n<br />\n<br />Phase C: (New Mods)\n<br />1. A camp of different races\n<br />2. A Legend of Zelda inspired Lost Woods mod \n<br />3. A player home using other modder's resources (given permission)\n<br />4. A new land/ island (kingdom)\n<br />5. A dungeon\n<br />6. Practice at creating Armor and Weopns\n<br />7. Spells\n<br />\n<br />[b][u]Known Problems:\n<br />\n<br />[/u][/b]1. Not all the mine veins work.\n<br />2. Problems with placing weapons on wall mounts.\n<br />3. Furniture activation height variations.\n<br />4. No way to escape if you jump off the bridge down the waterfall.\n<br />\n<br />[u][b]Solution to Problems:[/b][/u]\n<br />\n<br />1. Use the mine veins that do work.\n<br />2. Do not use the weapon wall mounts that are vertical\n<br />3. Will just make NPC's look a little bit funny when entering and existing the animation.\n<br />4. Don't be that guy who doesn't die when jumping from a cliff.\n<br />\n<br />Many thanks for checking out my Mod. Let me know if there is anything I missed and if you liked my first mod!",
  "categoryId": "69",
  "version": "1a",
  "author": "aippersbachj",
  "createdUnix": "1496110017",
  "updatedUnix": "1496110006",
  "containsAdultContent": false,
  "uploadedBy": "aippersbachj",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000245651",
      "name": "RedWood1A",
      "version": "1a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6988",
      "fileName": "RedWood1A-84253-1a.rar",
      "uploadedUnix": "1496110006",
      "modVersion": "1a",
      "virusScanUrl": "https://www.virustotal.com/file/21af6d6a62f8ae4db6b3da1afe6160fe8ef72e23e1b592eda15b77f8e23b9304/analysis/1496110227/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RedWood1A-84253-1a.rar?fid=1000245651&ttl=1535873083&ri=8192&rs=8192&setec=e402371c29d424d7f833840f992d6f5d"
    }
  ]
}