{
  "modId": 8432.0,
  "modName": "Grammatical Loading Screens",
  "summary": "This small mod edits the copious amounts of comma errors and other grammatical mistakes in the loading screen text. ",
  "descriptionHtml": "[b] [color=yellow] To (hopefully) avoid in-depth grammatical debates, I must clarify that my adjustments are based on modern American grammar (Standard Written English dialect). Other dialects and countries often adhere to different punctuation rules.  [/color] [/b]\r\n\r\nThis is a very simple mod which edits the text on loading screens. While the developers at Bethesda are quite talented in many areas, comma usage is not one of them. The biggest issue (which occurred on many of the screens) was placing a comma between verbs/verb phrases in a compound predicate. For example, \\\"Blocking with a shield or weapon will recoil an attack, and stagger the attacker.\\\" \r\n\r\nAnother example: \\\"The Sabre Cat of Skyrim is a giant, ferocious predator, and will often ambush travelers who stray too far from the roads, and into the wilds.\\\" This was edited to: \\\"The Sabre Cat of Skyrim is a giant, ferocious predator, and it will often ambush travelers who stray too far from the roads and into the wilds.\\\"\r\n\r\nI also noticed the writers were very inconsistent with the use of the Oxford comma. While it is optional, for the sake of consistency, I added it where applicable. There were also a few cases of that/who confusion, which I corrected.\r\n\r\nNotes: \r\nI am well aware that this mod is not relevant to everyone\\'s interests, but if you were as distracted and annoyed when reading the loading screens as I was, then hopefully you will appreciate this.  \r\n\r\nI do not know if this mod will conflict with other mods that edit the loading screens.\r\n\r\nFor now, I am not planning further grammatical revamps of Skyrim, but if you notice other issues in subtitles, descriptions, or in-game books, feel free to comment. I may consider a larger undertaking if people are interested, or more importantly, if the issues annoy me enough. \r\n\r\nHave a great day!",
  "categoryId": "28",
  "version": "1.0",
  "author": "Umaros",
  "createdUnix": "1328769648",
  "updatedUnix": "1328769778",
  "containsAdultContent": false,
  "uploadedBy": "umaros",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27584",
      "name": "Grammatical_Loading_Screens",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Grammatical_Loading_Screens-8432-1-0.7z",
      "uploadedUnix": "1328769778",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7191cc9ae1d63f3c2480c988818952b919c3c97dcb49e6ad0eccb6f70749cec5/analysis/1406663349/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Grammatical_Loading_Screens-8432-1-0.7z?fid=27584&ttl=1535767153&ri=8192&rs=8192&setec=566f607bb117152a4c040a295e4d7b0c"
    }
  ]
}