{
  "modId": 8435.0,
  "modName": "Unto The Waters - A story series for Skyrim",
  "summary": "A Mostly-erotic Ancient Egyptian fiction I wrote, ported and illustrated within 23 roughly 12 paged books, placed in an underground cellar near Whiterun.",
  "descriptionHtml": "Unto The Waters - an Ancient Egyptian fiction story in Skyrim.  \r\n\r\nHi!  This is my first** ever mod for any Bethesda game, and it\\'s just a simple addition of a book series I\\'ve been writing, with some images drawn by my friends.\r\n\r\n**This story series contains adult content!  If you\\'re below 18, or are offended by anthropomorphic content, (commonly referred to as furries), don\\'t download it.  Don\\'t post to troll or flame, because this isn\\'t *Essential.  If it isn\\'t your cup of tea, don\\'t drink of it.  Just move on.  \r\n\r\nHowever, for those of you who are interested the series ends up roughly 27,000 words long and there are a few pictures in some of the books.\r\n\r\nObviously, there is adult content contained within the books.  Sex, violence, murder, etcetera.   \r\nThe books average 1200 words, roughly 12 pages, making them easier to read at convenience, rather than one 27000 word book that you have to begrudgingly read all at once, or risk losing your place.  \r\n\r\nAs was customary in Ancient Egypt royalty, the story depicts Anubis, the well-known god of the Damned, married to his *Fictional* daughter, Amisi.  Several other divinities, such as Sobek appear later on in the story. \r\nAgain, if you don\\'t like the idea of it, don\\'t bother with it.  \r\nOtherwise, thanks for your interest!\r\n\r\nIf you find any conflicts or issues, please let me know.  Again, this is the first time I\\'ve ever made anything, so I probably need the instruction. Any help I can get is good.\r\n\r\nFINDING THE BOOKS\r\nWell, there\\'s two ways you can do that.  You can either go into console with Tilde (~) and type coc newhome\r\nOr you can go to the whiterun stables.  From there, assuming you are facing whiterun,  you will find a potato field on your left.  Just beyond the potato field, near the road, there is a trapdoor on the ground, leading to the cellar in which the books are kept.\r\n**It should be noted that this comes with another short story I wrote, contained within a single book known as \\\"Beauty Runs Deep\\\".  As of yet, this story does not have any custom imagery, and is just text in a book.\r\n\r\n\r\n",
  "categoryId": "92",
  "version": "1.0.1",
  "author": "SexyVortigaunt",
  "createdUnix": "1328770552",
  "updatedUnix": "1328812014",
  "containsAdultContent": true,
  "uploadedBy": "SexyVortigaunt",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27831",
      "name": "Unto The Waters - A Story Series in Skyrim",
      "version": "1.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9904",
      "fileName": "Unto The Waters - A Story Series in Skyrim-8435-1-0-0.zip",
      "uploadedUnix": "1328809073",
      "modVersion": "1.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/3485368d580a1a8c2f2bbb5c4d177868419cae41d9241f892c3b32295aaa4201/analysis/1406664496/",
      "changelogHtml": " Initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Unto%20The%20Waters%20-%20A%20Story%20Series%20in%20Skyrim-8435-1-0-0.zip?fid=27831&ttl=1535767157&ri=8192&rs=8192&setec=efc778999746a361d21a1cccafb5c888"
    },
    {
      "fileId": "27864",
      "name": "UTW - ASFS",
      "version": "1.0.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "129",
      "fileName": "UTW - ASFS-8435-1-0-1.zip",
      "uploadedUnix": "1328812014",
      "modVersion": "1.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/bdbc0d9d1f1aad4b62733d0a36cdb4879a10499327e6d3efe5d9a9f3870a26a0/analysis/1406664601/",
      "changelogHtml": " Fixed a [pagebreak] tag that could be seen in the 20th book <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/UTW%20-%20ASFS-8435-1-0-1.zip?fid=27864&ttl=1535767158&ri=8192&rs=8192&setec=3455ab87d79be1faa1d70db76c0710f5"
    }
  ]
}