{
  "modId": 84384.0,
  "modName": "Dwemer Goggles and Scouter spanish",
  "summary": "Traducción de Dwemer Goggles and Scouter MOD CREADO POR volvaga0 que añade unas Gafas y un Parche Dwemer ojo: (izquierdo) y (derecho).Las Gafas y el Parche no son solo visuales, traen consigo varios efectos muy guapos para verlos visita esta pagina del creador del mod ",
  "descriptionHtml": "Traducción de Dwemer Goggles and Scouter MOD CREADO POR volvaga0 que añade unas Gafas y un Parche Dwemer ojo: (izquierdo) y (derecho).Las Gafas y el Parche no son solo visuales, traen consigo varios efectos muy guapos para verlos visita la pagina del creador del mod que te enseña lo que hace cada efecto(e puesto el link abajo), con una tecla que asignes tu desde el menú SKSE (Traducido al español)harás uno de los siguientes efectos con las gafas o el parche puestos desde el menú SKSE puedes configurarlo todo.Para conseguir las gafas y el parche solo tienes que leer una nota caída (esta en el suelo) donde esta Calcelmo aun así subiré una foto justo donde esta la nota y te saldrá una mision complétala y crea las gafas y el parche en la forja necesitaras la habilidad de Herrería enana.\r<br />\r<br />(RECOMIENDO ENCARECIDAMENTE VER LOS EFECTOS)\r<br />http://www.nexusmods.com/skyrim/articles/888/? Aqui podras ver todos los efectos de abajo.\r<br />\r<br />Voy a poner aquí la traducción que e echo para cada efecto que puedes personalizar por el menú de SKSE(traducido) y también una breve descripción de lo que hace,\r<br />\r<br />\r<br />Night Eye: (Ojo nocturno)  sólo está disponible con las Gafas [b]Dwemer[/b](NO DEL PARCHE) permite ver más claramente en la oscuridad para una visión más clara cuando se viaja de noche.\r<br />\r<br />Detect Life: (Detectar vida) El efecto de detectar vida que está presente tanto en las Gafas [b]Dwemer[/b] y el Parche [b]Dwemer [/b]actúa de la misma forma en que el hechizo del mismo nombre hace Usted es capaz de ver las auras de CPN a su alrededor, incluso a través de paredes y otros objetos Otra buena característica de este efecto, es la capacidad de distinguir al amigo del enemigo.Los enemigos desprender un aura de color &#34;Rojo.\r<br />\r<br />Threat Assess: (Vista del nivel) Vista del nivel sólo está disponible con el Parche [b]Dwemer(NO LAS GAFAS)[/b].Este efecto coloreará a los NPC de un determinado color, dependiendo de sus niveles actuales(ver fotos del enlance de arriba para saber los niveles y colores).\r<br />\r<br />[b]Dwemer Sight: (Vision Dwemer) El efecto [b]Vision Dwemer[/b] sólo está disponible con el Parche [b]Dwemer(NO LAS GAFAS)[/b].Este efecto destaca a todos los NPC con un brillo dorado, lo que te permite verlos con mayor claridad.Esto puede ser muy útil por la noche ya que la visibilidad es mínima Además de esto, el efecto hará más evidente a las criaturas no-muertas de un color azulado-blanco.\r<br />\r<br />[b]Goggles Light: (Luz) [/b][/b]Esta esto hace luz, exclusivo de las Gafas Dwemer([b]NO DEL PARCHE[/b]) a partir de v2.1. Este efecto se basa en el hecho de que cuando  sacas un arco/ballesta por ejemplo, si a continuación, sacar una antorcha, el juego obliga a una animación que quita el arco/ballesta con esta característica de Luz, esto ya no es un problema.Las gafas se le han incorporado luz que iluminará tu camino con sólo pulsar una tecla, sin que la antorcha sea necesaria.\r<br />\r<br />[b]Dwemer Perception Filter: (Percepcion de Dwemer) Este efecto es exclusivo de las Gafas Dwemer(NO DEL PARCHE). Cuando se activa este efecto, el tiempo se ralentizará lo que te permite percibir tu alrededor con mayor claridad.Podrás hacer reacciones rápidas mucho más rápidas que nunca antes y reaccionar antes.[b]Estando usando este efecto, sin embargo, un efecto de, mostrando su carácter como un ser antiguo dwemer.Esto es completamente inofensivo y es sólo un efecto secundario de tiempo usando [b][b]antiguos [/b][/b]artefactos Dwemer.\r<br />\r<br />[b]Goggles Zoom; (Enfocar) Este efecto es exclusivo de las [b]Gafas Dwemer(NO DEL PARCHE)hace[/b], literalmente lo que dice amplia la vista.Este efecto le permite ver objetos lejanos, lo que permite ver con mayor claridad a partir de una distancia considerable.Esto también puede ser utilizado en combate por lo que este modo puede ser extremadamente útil para los arqueros, o para evaluar las áreas de los alrededores para los personajes orientados al sigilo.[/b]\r<br />\r<br />[b]Goggles Animation (Gafas en cabeza/sobre ojos) Esto no es un efecto sino mas bien una animacion que haces solo en tercera persona(ver fotos en el enlance del principio) que pone las gafas en la frente o las pone nada mas que tocando una tecla que puedes configurar para cambiarla desde el menu del SKSE traducido.\r<br />\r<br />PD: Las gafas y el Parche cuentan con un sistema de aceite que sirve para rellenar las gafas desde el menú SKSE con el &#39;(Aceite de enano) esto es para no abusar demasiado de las gafas pero si tu quieres puedes desactivar el sistema del aceite desde el menú SKSE para que no te moleste y mejorar el sistema gastando 1 punto de habilidad pera tener el doble x2 de capacidad de aceite.[/b][/b][/b][b]\r<br />\r<br />[/b]",
  "categoryId": "54",
  "version": "2.1.1",
  "author": "volvaga0",
  "createdUnix": "1496596129",
  "updatedUnix": "1496596127",
  "containsAdultContent": false,
  "uploadedBy": "zaxon007",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000246075",
      "name": "Dwemer Goggles and Scouter spanish",
      "version": "2.1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Dwemer Goggles and Scouter spanish-84384-2-1-1.rar",
      "uploadedUnix": "1496596127",
      "modVersion": "2.1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f4f82c1a69a9d279fb6a7d3bd0feb94f656658c33b52c881296bd72705ae8074/analysis/1496596272/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwemer%20Goggles%20and%20Scouter%20spanish-84384-2-1-1.rar?fid=1000246075&ttl=1535873227&ri=8192&rs=8192&setec=cc32363973bb32bfb128c32138e0d238"
    }
  ]
}