{
  "modId": 8439.0,
  "modName": "Morrowind - Oblivion Beverages And Player Home V7",
  "summary": "This Standalone adds Many Drinks from Morrowind and Oblivion and a few additional lore friendly ones aswell, also adds a few books from Morrowind and a few new misc items. In addition to all that this mod adds a new player home near Fort Greymoor. These items have been added to shop&#39;s leveled list and can be found in certain locations too.\r<br ",
  "descriptionHtml": "[size=4]\r<br />[color=#cfe2f3]Special Edition Version[/color]: [url=http://www.nexusmods.com/skyrimspecialedition/mods/11418/?]Tamrielic Culture[/url][/size]\r<br />\r<br />(Note that the SE version is significantly different than this version)\r<br />\r<br />\r<br />\r<br />\r<br />These items do Not replace any existing items.\r<br />Just Drinks Version Now Available: http://skyrim.nexusmods.com/downloads/file.php?id=10826\r<br />\r<br />Warning Remove Your Items From The House Before Updating Just to be Cautious.\r<br />\r<br />Version Seven Adds: Fixed a few typo&#39;s and effects errors, Added upgrades for weapons and nerfed a few overpowered items.\r<br />But on to the main additions V7 adds: All drinks as seen in &#34;The Fighter&#39;s Stronghold DLC for Oblivion&#34; Excluding Argonian Bloodwine due to Hearthfire adding it. These Include: Frostdew Blanc, Julianos Firebelly, Numbskin Mead, Stumble Foot&#39;s Reserve, Sparkling Honeydew, Colovian Battlecry.\r<br />Also added a large number of Lore Friendly Drinks, as well as Hist Sap and a cave filled with argonians and a Hist Tree. There is also a Tar Pit in the volcanic tundra See Images for locations, though the map markers are always visible from the start, you can&#39;t fast travel to the until you visit them. To find the Dwemer Ingot and Tuning Rod you&#39;ll need to pay a visit to Blackreach and find the Silent Ruins.\r<br />\r<br />Updated to V6: Adds many constructable weapons for some of the misc items to be utilized, as well as adding new drinks and poisons and a few ingredients such as : Chocolate wine, Bluemist Wine, Wolfsbane Extract, Jarrin Root Extract, Tar, Red Mountain Ash, Apple Juices (red and green), Crab Bait, Scarlet Rose Perfume, Fine Comberry Wine, Moonrush, Moonshadow, Moonburst, Glowshroom Mead, Greenmote, And Painted Troll Fat. And much more. Let me know If there are any issues so that I may fix them, feedback and suggestions appreciated.\r<br />Enjoy.\r<br />\r<br />Updated to V5: Adds Sload Soap Ingredient, Alinor Wine,Gin,Rum,Northpoint Wine,Goldbrand Champagne,Liquid Viper Poison\r<br />\r<br />Updated to V4: Fixes the Lightning in the Cellar, Adds 3 Mannequins,Adds 3 Weapon Display Cases. Adds a Dwemer Cooling Device which is a Respawning Source of Unmelting snow and Nevermelting ice in the cellar.\r<br />\r<br />Updated to V3.5: Fixes a few issues in the house, except for the lighting in the cellar, no idea on how to fix that, if you know let me know. Adds barrels to bars in major cities, adds blood barrels to vampire lairs. Just replace the old esp with the new one, still requires main file. Notify me of issues so I may fix them.\r<br />\r<br />Updated to V3: Adds Bernice&#39;s Roofwater Wine, Fellmoor Spore Wine, and Human Blood. Also Adds a new house and freeform quest, the Player can choose to live in this home, Not 100% of the containers are safe for storage. But the ones I&#39;ve named Storage Barrel,Chest etc. should be, as well the Sugar sacks and pepper ones should be also. Just be cautioned when using containers in the home not named Storage etc. Just drag and replace the old textures and esp. Enjoy\r<br />\r<br />\r<br />Updated to V2: Adds Greef,Flin,Mazte,Shein,Sujamma,And a few other additions. Just drag and replace the old textures and esp.\r<br />\r<br />This Standalone adds Many Drinks from Morrowind and Oblivion and a few additional lore friendly ones aswell, also adds a few books from Morrowind and a few new misc items. In addition to all that this mod adds a new player home near Fort Greymoor. These items have been added to shop&#39;s leveled list and can be found in certain locations too. also adds a small shack and interior space based off of Azura&#39;s Star. Check for updates and new additions.\r<br />\r<br />A few shops and inns have had them added to a leveled list at a set percentage, in addition they can also be found in select locations that I felt were lore appropriate. If you are lazy on the other hand, then visit coc QAsmoke in the console and they will be on a table. Enjoy",
  "categoryId": "94",
  "version": "V7",
  "author": "Watcherzero",
  "createdUnix": "1328773286",
  "updatedUnix": "1348620345",
  "containsAdultContent": false,
  "uploadedBy": "Watcherzero",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27604",
      "name": "New Beverages and Misc Items",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "14081",
      "fileName": "New Beverages and Misc Items-8439.rar",
      "uploadedUnix": "1328773556",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fbbed9231088510ffeba0445d7d7b8424fbdded3c405c4dbed5ba89716b87d8b/analysis/1406663416/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/New%20Beverages%20and%20Misc%20Items-8439.rar?fid=27604&ttl=1535767164&ri=8192&rs=8192&setec=7541e93e4ac7284089f9cf04d1198fbe"
    },
    {
      "fileId": "90466",
      "name": "Morrowind - Oblivion Beverages and Player Home V7",
      "version": "V7",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "66905",
      "fileName": "Morrowind - Oblivion Beverages and Player Home V7-8439-V7.rar",
      "uploadedUnix": "1348620345",
      "modVersion": "V7",
      "virusScanUrl": "https://www.virustotal.com/file/40fcb60cbee2338b9dd003d250ac8d23832b3d60f76eb9a07ea05d14fb9a0887/analysis/1407187292/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Morrowind%20-%20Oblivion%20Beverages%20and%20Player%20Home%20V7-8439-V7.rar?fid=90466&ttl=1535767164&ri=8192&rs=8192&setec=b208791c54b1dd3eefbfacddb5b0656e"
    }
  ]
}