{
  "modId": 84437.0,
  "modName": "Happier Endings - Closure in Skyrim (incomplete mod - modder&#39;s resource)",
  "summary": "A mod to add closure to some of the &#34;sad stories&#34; around Skyrim.",
  "descriptionHtml": "[b]Preamble:[/b]\r<br />\r<br />Many many moons ago, I got into skyrim modding, thanks entirely to this sub and the amazing people in the IRC. I then got distracted by school and the new expansion in my MMO, and I kept telling myself I&#39;d eventually come back to Skyrim modding, and finish the mod up.\r<br />\r<br />Well, it&#39;s been two years now, and I still haven&#39;t done it. And with the way life has been going, I just don&#39;t think it&#39;ll happen.\r<br />\r<br />Unfortunately, that&#39;s hardly fair to all the work that everyone else put in helping me to create this mod. Ren in particular (I hope I&#39;m remembering your name right) spent hours debugging my mistakes and giving me 1 on 1 tutelage. In addition, I&#39;ve worked with two voice actors who contributed their time and effort to this mod, and I don&#39;t like to think that they&#39;ll never get to see the fruits of their labour.\r<br />\r<br />[b]That&#39;s where you come in, hopefully.[/b]\r<br />\r<br />I&#39;d love it if someone would be willing to take up the mantle and finish this in whatever capacity they see fit. I&#39;ll be around to answer questions, but as it&#39;s been a while I can&#39;t guarantee I can help too much.\r<br />\r<br />The mod:\r<br />\r<br />Working title was &#34;Happy Endings: Closure in Skyrim.&#34; No, not [i]those[/i] happy endings. The idea was to take the numerous sad stories from Skyrim and give them some closure. The bulk of the work done was for Hadrir and Bern (this portion of the mod is actually complete), and Trius and Shelly, but there is also a document of ideas that I didn&#39;t end up getting to.[url=https://www.dropbox.com/s/q867v3aluiziild/Happy%20Endings.rar?dl=0]\r<br />[/url]\r<br />Thank you in advance, and especially thank you to the people who helped me get it as far as I did.\r<br />\r<br />[u]This mod is almost 100% playable, if you are so inclined, but lacks voice acting for some of the characters.[/u]",
  "categoryId": "82",
  "version": "1.0",
  "author": "misskatu",
  "createdUnix": "1496795272",
  "updatedUnix": "1496795105",
  "containsAdultContent": false,
  "uploadedBy": "Misskatu",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000246312",
      "name": "closureinskyrim",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31963",
      "fileName": "closureinskyrim-84437-1-0.rar",
      "uploadedUnix": "1496795105",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a1504e1ec67e9d24b7a79a98810b8d0615542775762cadeb00f4464cda1ebdca/analysis/1496795287/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/closureinskyrim-84437-1-0.rar?fid=1000246312&ttl=1535873292&ri=8192&rs=8192&setec=f4ef9012b6e3bc6183d89d1975349bd3"
    }
  ]
}