{
  "modId": 8452.0,
  "modName": "LSB BattleHammers",
  "summary": "New weapons added to the game.",
  "descriptionHtml": "2/13/12 Lord Banewrath Sunblade    Version 6 update 5/20/12\r\n\r\n\r\n   This mod adds over 50 new weapons to skyrim. Almost all of them are craftable and can be upgraded. I have added a number of them to the lvld lists, this means that anywhere in the game that a mace is referenced, the new weapons have a chance to show up as well. They can be on guards, enemies, chests, merchants, and even justlaying around for you to find and pick up. I have also created a number of unique weapons of great power for you to find. I have placed clue books labeled as lost journals outside some of the inns within the game. For a list of which inns to visit look further below. These clue books are just clues so you need to read them carefully. Each book will mention a location and that is where you need to go. There are no hand holding quest arrows or markers. If you have not found the location yet, you need to keep exploring. This I feel makes it alot more fun when stumbling across a location that you have been searching for and getting the prize within.\r\n\r\n\r\n  I have added several new Skyforge weapons to the vendor next to the forge. They are also craftable once you become the harbinger and fullfill the companions quest line. I have also added a skyforge warhammer to the list because the game was missing it from the start. If you have another mod that adds the missing skyforge weapons I recommend turning it off because it isn`t needed anymore. Also created three new silver weapons that can only be crafted at the skyforge. A greatblade, longsword, and battlehammer. these unlock when you finish the quest line for the companions as well.\r\n\r\n  I also decided to remove the disarm shout from the undead in the game. Since some of my weapons are uniques, having a draugr disarm you and have your weapon dissapear would suck. So that`s another problem gone. If you have any mods that remove the disarm shout from the undead, you don`t need it anymore. Remove it.\r\n\r\n\r\n  \r\n\r\n Installation is easy, drag and drop contents of the data folder to your own data folder and hit yes to overwrite. Don`t worry no other files will be disturbed because they have unique folders.\r\n\r\n\r\n  You can use these models however you want in your own personal game. You cannot include these in other mods without permission.You cannot upload a fix for anything contained thinking you are doing me a favor because you aren`t. If there are any problems I shall handle them directly. Now go grab a hammer and kill something!\r\n\r\n     \r\n    VERSION 4 UPDATE\r\n\r\n1.  Added missing texture and remapped the models for the missing texture for some of the weapons using parts of the steel mace.\r\n\r\n2. Fixed the Elven Windcutter and Skyforge Sledge inventory models so they now appear correctly when viewed in inventory.\r\n\r\n3. Added three new unique weapons. The clue books can be found outside the Riverwood Inn and outside the Hearth Inn in Windhelm and the inn in Winterhold.\r\n\r\n4. Began redoing the models of my oblivion skull weapons pack and will be inserting a weapon here and there every update.\r\n\r\n\r\n    Version 5 Update 3/7/12\r\n\r\nVersion 5 adds 4 new weapons. There was going to be 6 in V5 but one I was not happy with and the otherneeded more time to complete properly. That will be included in V6 in the future. With V5 you get two new Daedric weapons a spiked warclub mace type weapon and a new double bladed hand axe. An imperial greatsword was added just for shits because I wanted to try making one. One more skull weapon was created and added as another unique. I used the mace animation when creating it. I may switch to the axe animation in V6 because the inventory model will not point in the correct direction no matter what you do to it. The only downside to using the ax animation is that the weapon will be alot shorter but will show up correctly in the inventory.\r\nI have not decided yet to keep it a long handled mace or switch to a shorter version.\r\n\r\n   \r\n\r\n\r\n    Version 6 Update 5/20/12\r\n\r\n     Version 6 adds alot. Missing skyforge weapons that were not in the stock game have been added. Corrected the missing belt loops for the two maces that needed them. Went through each and every model making sure there were no more duplicate entries. Cleaned every single one as a matter of fact. Two more uniques added to hunt for the Kinslayer and the Skullcrusher! Added a new line of blunt weapons called War Mauls. There will be a War Maul for every weapon type. Six have been added so far. The update adds 16 new weapons! Also added some of the weapons to lvld lists. Not all of them but some. Some will be craft only and some you will be able to find. \r\nThe silver weapons are very shiny. I supplied modified textures to get the shine, but if you don`t like them having the polished look, you can discard the supplied textures.\r\n\r\n\r\n\r\n\r\n    The list                                         \r\n                                                     \r\n\r\n\r\nEbony Dragonslayer Axe- unique                                                    \r\nMace Of Aerevar Stonesinger- unique                        \r\nMace Of The elven Highlord- unique                         \r\nFine Steel Bladed Mace- unique                               \r\nElven Decapitator- unique                                        \r\nDaedric Battle hammer- craftable                            \r\nDwarven Battle Hammer- craftable                          \r\nEbony Battle hammer- craftable                              \r\nElven Battle Hammer- craftable                              \r\nGolden Eagle- craftable                                          \r\nElven Glaive- craftable                                           \r\nElven Eagle warhammer- craftable\r\nElven Halberd- craftable\r\nElven Windcutter- craftable\r\nElven Halberd- craftable\r\nElven Glaive- craftable\r\nGlass Crusher- craftable\r\nGlass Windcutter- craftable\r\nIron Battle hammer- craftable\r\nIron War Mace- craftable\r\nOrcish Battle Hammer- craftable\r\nSkyforge Steel Maul= craftable\r\nSkyforge Steel War Mace- craftable\r\nSkyforge Steel War Slaedge- craftable\r\nSteel Battle Hammer- craftable\r\nFine Steel Flanged Mace- craftable\r\nFine Steel War Club- craftable\r\n\r\n    Version 4 added weapons\r\n\r\nMace Of shards- unique\r\nGorgon Crusher- unique\r\nBlade Of the War Angels- unique\r\nSteel Break Hammer- craftable\r\nSkyforge Steel Crusher- craftable\r\nElven Scythe Sword- craftable\r\nElven Warblade- craftable\r\n\r\n\r\n   Version 5 Added weapons\r\n\r\nSilent Scream Mace- unique\r\nDaedric War Club- craftable\r\nDaedric Grim Axe- craftable\r\nImperial Greatsword- craftable\r\n\r\n   Version 6 Added weapons\r\n\r\nHoly Silver Greatblade- Loot,   upgraded at skyforge\r\nHoly Silver Longsword- Loot     upgraded at skyforge\r\nHoly Silver Battlehammer- Loot  upgraded at skyforge\r\nKinslayer- unique\r\nSkullcrusher- unique\r\nDwarven War Maul- craftable\r\nIron war Maul- craftable\r\nDaedric War Maul- craftable\r\nGlass War Maul- craftable\r\nSteel War Maul- craftable\r\nElven War Maul- craftable\r\nSkyforge Steel Warhammer- craftable\r\nSkyforge Steel Battlehammer- craftable\r\nSkyforge Steel Sledge- craftable\r\nSkyforge Steel Greatblade- craftable\r\nSteel Flanged Mace- craftable\r\nDwarven War Mace- craftable\r\nDwarven Greathammer- craftable\r\nIron Greatblade- craftable\r\nSteel Greatblade- craftable\r\n\r\n\r\nClue books can be found outside the inns listed\r\n\r\n\r\nWinterhold                 \r\n Riverwood\r\nDawnstar\r\n Dragon Dridge\r\n Ivarstead\r\nMarkarth\r\nWindhelme\r\n Morthal\r\n Kynesgrove\r\n Nightgate\r\n Rorikstead\r\n\r\n\r\n\r\n",
  "categoryId": "55",
  "version": "6",
  "author": "Lord Banewrath Sunblade",
  "createdUnix": "1328778032",
  "updatedUnix": "1337570026",
  "containsAdultContent": false,
  "uploadedBy": "hammerhorde",
  "primaryFile": null,
  "files": [
    {
      "fileId": "62698",
      "name": "LSB Battlehammers V6",
      "version": "6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4794",
      "fileName": "LSB Battlehammers V6-8452-6.7z",
      "uploadedUnix": "1337570026",
      "modVersion": "6",
      "virusScanUrl": "https://www.virustotal.com/file/2d170fbc1111fc36301ff67d4c8299b2616248fc4a1d5ee06678bc9b18ad4e3f/analysis/1406906541/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LSB%20Battlehammers%20V6-8452-6.7z?fid=62698&ttl=1535767182&ri=8192&rs=8192&setec=373b16ee89d1561cbaf39c922e742395"
    }
  ]
}