{
  "modId": 84534.0,
  "modName": "Akavir The Land of Dragons",
  "summary": "Akavir: The Land of Dragons is a wip mod that aims to bring Dovakhin to Akavir. <br /> The map contains Kamal, Tsaesci, Ka Po'Tun, and Tang Mo at the moment, but will eventually include the Pandomaic Isles of Esroniet, Ynelsia, and Cathonoquey.",
  "descriptionHtml": "Akavir: The Land of Dragons\n<br />\n<br />How to Install:\n<br />\n<br />Download all files. Place them into the data folder one by one in chronological order.  So do  0.1, 0.2, 0.3, 0.35, then 0.4.  As I update it just add the new one over the old. Once the mod is finished I'll try to make it just one file.\n<br />\n<br />\n<br />About the mod:\n<br />\n<br />This mod aims to bring Dovakhin to Akavir by means of a courier sent to find Dova. This courier will bring Dova via the Salty Bosmer, a trading vessel with a Bosmer Captain that has secretly been making trips to Akavir for years. \n<br />\n<br />And the main theme of this mod is that the Imperials at the time of the Imperial invasion of Akavir were bigoted and xenophobic. Thus, they embellished much of what they reported of Akavir and its inhabitants. \n<br />\n<br />To get there: cow akavirworld 22 -51\n<br />\n<br />This takes you to Tang Mo's port. Hopefully. :3\n<br />\n<br />EDIT/UPDATE 7/26/2017:\n<br />\n<br />I've added the Salty Bosmer to Dawnstar and made a pier that will be updated next. If you hop on to the SB and use the shack door on it, you'll end up in Tang Mo's capital port. Now there's no need to COW into Akavir. \n<br />\n<br />I've also added other locations and landscape details since the 0.2 version. \n<br />\n<br />I've decided that Tosh has a central palace carved from a mountain range between Tsaesci, Kamal, and Ka Po'Tun. Tosh had the palace built because he was impressed by the Imperial City's layout and descriptions brought back to Akavir when he was younger. (he's since seen much of Tamriel and Nirn once he became a dragon.) Only this is a vertical palace/city/temple. Dragon riders in the Tiger Dragon Empire's military are trained at this palace. \n<br />\n<br />EDIT/UPDATE 8/18/2017:\n<br />\n<br />To install, download these four files in chronological order, unzip them, and transfer them into your data folder. Allow the newer files to overwrite anything each time. \n<br />\n<br />I will eventually have it all as one file though. :D\n<br />\n<br />EDIT/UPDATE 5/12/2018:\n<br />\n<br />Well I finally tested the mod on another computer with a fresh install and noticed that the LOD wasn't showing up right and neither was the map. \n<br />\n<br />I need users to comment on the mod and tell me any issues they are having in those areas. \n<br />\n<br />The mod is still in progress and I am still working on the exterior worldspace at this point. \n<br />\n<br />That update, she's a comin'.  :l\n<br />\n<br />\n<br />Read all this if your interested in info on the mod:\n<br />\n<br />\n<br />\n<br />Once in Akavir, the main quest will have Dova meet with Tosh Raka, the Dragon Emperor of the Dragon Empire of Akavir. Tosh is tasking Dova with ferreting out a mole amidst Tosh's subordinates. Tosh is also interested in learning more about Dova's experiences as the Dragonborn, and sees Dova as sort of a kindred spirit.\n<br />\n<br />There will be tons of side quests throughout the continent of Akavir and the Pandomaic Isles as well as quests that involve Skyrim. The player's first stop on the way to Akavir will be the island of Esroniet in the Pandomaic Ocean. The player can then continue on to Akavir, or explore the isles completing side quests. \n<br />\n<br />I will implement the 4 main races of Kamal, Tsaesci, Ka Po'Tun, and Tang Mo as playable races/NPC's at some point. Only there will be key differences in my versions of these 4 races and the other playable/NPC races present in Akavir. \n<br />\n<br />- The Tsaesci will be bipedal like the default races. The Imperials branded them as \"snake men\" and in art depicted them as having a snake's tail as a lower body to emphasize their dislike for the Tsaesci. This is due to the Imperial's defeat at Septimia/Ionith and the death of Emperor Uriel Septim V. They've held a societal grudge against the Tsaesci of Akavir ever since. \n<br />\n<br />- The Tsaesci are NOT vampires/vampiric. Much of their cuisine uses blood as a spice/ingredient and they have long fangs like a poisonous snake. The bigoted Imperials began to describe them as \"vampires\" in legends. \n<br />\n<br />- The Kamal are related to the Orcs. They are a paler, blue/green eyed version of the Orsimer that most likely evolved from Falmer that worshipped Malacath. They're taller than their Tamrielic brothers though, and are weakened in warmer climates like Hammerfell's Alik'r Desert and being much more dangerous in colder climes like Skyrim and their homeland of Kamal.\n<br />\n<br />- The Ka Po'Tun are thought to be related to the Khajiit of Elsweyr. They will be taller than the average Khajiit and not have the morphs based on the moons. Their accent is much different as well. More Australian and New Zealand tones. \n<br />\n<br />- The Tang Mo are described fairly accurately in the lore, which is a surprise to Dova/Tamriel natives that visit Akavir. And it's suspected that the men of Tamriel are somehow related to the Tang Mo of Akavir...\n<br />\n<br />There will be other diversions from what little is established in the lore about Akavir. \n<br />\n<br />Tosh Raka has united Akavir under the Tiger-Dragon Empire. All 4 provinces are allies and Tosh is their leader. He has been heavily involved in the further development of the continent of Akavir. And several palaces throughout Akavir were modified to receive him in his dragon form. \n<br />\n<br />Tosh is able to change at will between his Dragon and Ka Po'Tun forms. And he believes that Dovakhin is capable of this transformation as well...\n<br />\n<br />About the worldspace:\n<br />\n<br />Akavir is split up into one mainland continent and several satellite islands that are mostly in the southernmost Tang Mo province. And there are many active and dormant volcanoes throughout Akavir. \n<br />\n<br />There is also going to be a second large worldspace between Tamriel and Akavir for the Pandomaic Isles. This will consist of three large islands and their satellite isles. \n<br />\n<br />Kamal is the northenmost province encompassing the entire northern chunk of Akavir. Almost all of Kamal is snowy, but there are several sections that are not in a constant snowfall. Their north coast is surrounded by icebergs and thick ice sheets from early fall to late spring every year. This causes their fleets to \"hibernate\" during the long Kamali winters. \n<br />\n<br />Tsaesci is the lower western half of the mainland and includes some western isles as well. Tsaesci is a more temperate and fertile land than Kamal. Comparable to Cyrodiil in terms of bountiful farmlands. There are a few high mountains with snowy areas, but most of Tsaesci is a subtropical jungle of bamboo, large trees, and large stones.\n<br />\n<br />Ka Po'Tun is the lower eastern half of the mainland. It's only difference from Tsaesci is it's northern and southern savannahs that are drier locals than the rest of Akavir. Ka Po'Tun has its share of jungles and snowy mountains though. And there are a few eastern isles under their provinces control. \n<br />\n<br />Tang Mo is a province made up of the southern most islands of Akavir. The \"thousand monkey isles\" is a popular nickname for Tang Mo. But there is not and never were a thousand islands in Tang Mo. Other than a few volcanic locations, Tang Mo is almost completely tropical. They have an overabundance of Banana trees and bamboo as well as larger trees. And they have rocky cliffs and many large stones dotting their province. Their province is mainly built up of fishermen and privateers, shipbuilders and divers. \n<br />\n<br />This mod will have a lot of underwater locations like shipwrecks and sea caves to explore, and quests to take the player to the more exotic locations.\n<br />\n<br />what's done so far? \n<br />\n<br />I have the first few passes of land texturing done. Same with trees/bushes. And I have many locations fleshed out, but not fully developed. Some interiors, mainly in Tang Mo are started. And some of the locations have had landscaping details done. \n<br />\n<br />Needed? I need several creatures made. Some are already made like the Akaviri bear/deer/troll resources and others. But I have several new creatures ideas in mind like \"shellbacks\". \n<br />\n<br />Shellbacks are going to be a Sabre Cat reskin to look like a vicious snapping turtle predator. It's essentially a reptilian Sabre Cat with a shelled body and a beak instead of fangs. I have other ideas for reskins like a Tapir reskin of the Boar from Dragonborn. And a Frost Spider reskinned to be a Spider Crab. \n<br />\n<br />And I'd like there to be new Akaviri dragon variants made. \n<br />\n<br />If you'd like to help me on this mod, PM me or leave a comment. I don't mind working alone on it, but my 3d modeling skills aren't high enough to handle the reskins or making new assets for this mod. And I don't need fully voiced NPC's, but wouldn't mind having voice actors record lines for this mod. And the cluttering of all the int/ext would be easier/faster with help. \n<br />\n<br />I'm just going to say that I have a plan for the story and in game history of Akavir that I don't want to stray from. I'd hope anyone wanting to help is okay with my version of Akavir. \n<br />\n<br />Bear with me people. Key word, wip. :D\n<br />\n<br />EDIT: \n<br />\n<br />I uploaded the maps of Akavir and the future Pandomaic Isles. Akavir's Tsaesci, Ka Po'Tun, and Kamal borders are different in the game, so I have to make a new province map at some point too. \n<br />\n<br />And I forgot to mention the modder's resources used:\n<br />\n<br />Markus Liberty's Orc Huts, Cyrodiil Farmhouses, and Imperial Ship snd boat:\n<br />\n<br />http://www.nexusmods.com/skyrim/mods/59426/?\n<br />http://www.nexusmods.com/skyrim/mods/52289/?\n<br />http://www.nexusmods.com/skyrim/mods/48582/?\n<br />\n<br />Some Ground Textures by Elinen:\n<br />http://www.nexusmods.com/skyrim/mods/19066/?\n<br />\n<br />Tamira's plants and also Elinen's Ztree plants:\n<br />\n<br />http://www.nexusmods.com/skyrim/mods/22018/?\n<br />http://www.nexusmods.com/skyrim/mods/38651/?\n<br />\n<br />AerynRevana's whale and narwhal(I don't have a link but was given permission to use them)\n<br />\n<br />I have to find out who did the Sheo houses...Tamira and Phitt. Cool! \n<br />\n<br />http://www.nexusmods.com/skyrim/mods/59632/?\n<br />http://www.nexusmods.com/skyrim/mods/60125/?\n<br />http://www.nexusmods.com/skyrim/mods/59977/?\n<br />\n<br />I used Mr Siika modder's resources...Also Tamira. So versatile! :D\n<br />\n<br />http://www.nexusmods.com/skyrim/mods/53461/?\n<br />\n<br />And just about all Stroti's modder's resources by Tamira. :D\n<br />\n<br />http://www.nexusmods.com/skyrim/mods/46785/?\n<br />http://www.nexusmods.com/skyrim/mods/37176/?\n<br />http://www.nexusmods.com/skyrim/mods/33948/?\n<br />http://www.nexusmods.com/skyrim/mods/36386/?\n<br />\n<br />You'll need those resources and you might as well download all those author's resources anyways just for you to use personally. They're all great and worth it. And if you have them in your data folder, you'll be able to see the non-vanilla meshes! \n<br />\n<br />I was also inspired to upload this after seeing Kyman3's mod of Akavir. Coincidentally we both used the Sheo assets. And I really like how he did the Akaviri houses and landscape. I'm like \"I better step up my game!\" :P\n<br />\n<br />And most important, I used the Akavir heightmap created by a user here but is no longer listed. I don't have a copy of the email/PM's that we did though. He said I could use this height map. I wish I could remember his name. \n<br />\n<br />And thanks to Nexus Mods in general for these sites. I only use the FO3/NV/4 and Elder Scrolls sections so far. But damn do I love this site and its community created content. :D",
  "categoryId": "30",
  "version": "0.4",
  "author": "tetsuoswrath",
  "createdUnix": "1497154010",
  "updatedUnix": "1531126596",
  "containsAdultContent": false,
  "uploadedBy": "tetsuoswrath",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000246712",
      "name": "BS Akavir The Land of Dragons",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26575",
      "fileName": "BS Akavir The Land of Dragons-84534-.7z",
      "uploadedUnix": "1497153942",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/d4da318b30a8e5995670ff0cdadcbcd08b6f33105ac31bd0afd7f224e59fe5d0/analysis/1497154355/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BS%20Akavir%20The%20Land%20of%20Dragons-84534-.7z?fid=1000246712&ttl=1535873379&ri=8192&rs=8192&setec=aa4c493683dd38737c013c14769dd797"
    },
    {
      "fileId": "1000248999",
      "name": "Updated BS Akavir The Land of Dragons",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "720381",
      "fileName": "Updated BS Akavir The Land of Dragons-84534-0-2.7z",
      "uploadedUnix": "1499665608",
      "modVersion": "0.2",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Updated%20BS%20Akavir%20The%20Land%20of%20Dragons-84534-0-2.7z?fid=1000248999&ttl=1535873379&ri=8192&rs=8192&setec=caf3de91665c7613fcf2baa986c3fcea"
    },
    {
      "fileId": "1000250331",
      "name": "BS Akavir The Land of Dragons 2nd Update",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "31961",
      "fileName": "BS Akavir The Land of Dragons 2nd Update-84534-0-3.7z",
      "uploadedUnix": "1501049097",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/3daee52fa5cd30ff112265fa48fda4f3483740c34abc0136ce6b846ba6f2a987/analysis/1501049286/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BS%20Akavir%20The%20Land%20of%20Dragons%202nd%20Update-84534-0-3.7z?fid=1000250331&ttl=1535873379&ri=8192&rs=8192&setec=c7dd2a4f8c3c7b186b864e7de7985b8d"
    },
    {
      "fileId": "1000251776",
      "name": "Akavir 3rd Update",
      "version": "0.35",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27128",
      "fileName": "Akavir 3rd Update-84534-0-35.7z",
      "uploadedUnix": "1502599964",
      "modVersion": "0.35",
      "virusScanUrl": "https://www.virustotal.com/file/4a5de12dcec49e26bb0abadc8083e9f2095d75aa642b939ca6313f357a3a13fb/analysis/1502600232/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Akavir%203rd%20Update-84534-0-35.7z?fid=1000251776&ttl=1535873380&ri=8192&rs=8192&setec=dd1f6138b6a1bfca983b97abf12710ee"
    },
    {
      "fileId": "1000277154",
      "name": "Akavir 4th Update",
      "version": "0.4",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "27299",
      "fileName": "Akavir 4th Update-84534-0-4.7z",
      "uploadedUnix": "1531126596",
      "modVersion": "0.4",
      "virusScanUrl": "https://www.virustotal.com/file/8355d2adf996d343390a6ce5e86b16e50faa9eaf8396696f0098ffb0a917a8be/analysis/1531126839/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Akavir%204th%20Update-84534-0-4.7z?fid=1000277154&ttl=1535873380&ri=8192&rs=8192&setec=7c85929f5dc91e80169b02acc2494a54"
    }
  ]
}