{
  "modId": 8459.0,
  "modName": "POP - Perk Overhaul Project",
  "summary": "Changes selected perks in an effort to both create more variation between skill trees and help increase late-game challenge.",
  "descriptionHtml": "FIRST, A NOTE: In order for the changes listed in this mod to take effect on an existing character, you will need to remove any perks from the affected trees before enabling this mod, then add them again after the mod is enabled.\r\n\r\nThis mod changes various perks in the One-Handed, Two-Handed, Marksman, Light Armour and Heavy Armour trees in an effort to make the choices available to the player more varied, as well as making the late game more challenging. Principally, this was done by replacing the first perk in each tree, which was a straight weapon damage/armour increase, with something else.\r\n\r\nOne-Handed:\r\nArmsman - Instead of increasing damage by 20/40/60/80/100%, now reduces power attack stamina cost by 20/25/30%.\r\nFighting Stance - Instead of reducing power attack stamina cost by 25%, now reduces player staggering by 25%.\r\nParalyzing Strike - Replaced with \\'Stunning Strike\\', now knocks down opponents without paralyzing, using the same effect as Warmaster.\r\n\r\nTwo Handed:\r\nBarbarian - Instead of increasing damage by 20/40/60/80/100%, now reduces power attack stamina cost by 20/25/30%.\r\nChampion\\'s Stance - Instead of reducing power attack stamina cost by 25%, now reduces player staggering by 25%.\r\nWarmaster - Corrected tooltip, it now accurately specifies the attack as using the knockdown effect it actually has, instead of paralysis.\r\n\r\nMarksman:\r\nOverdraw - Replaced with \\'Discipline\\'. Instead of increasing damage by 20/40/60/80/100%, now increases arrow recovery chance from 33% to 50/66/75%.\r\nHunter\\'s Discipline - Replaced with \\'Keen Eye\\'. Instead of increasing arrow recovery chance from 33% to 66%, now grants 25% damage threshold bypass to attacks.\r\n\r\nLight Armour:\r\nAgile Defender - Instead of increasing armour rating by 20/40/60/80/100%, now increases stamina regen by 15/30/45% when wearing all Light Armour.\r\nWindwalker - Replaced with \\'Seamless Plating\\'. Instead of increasing stamina regen by 50%, now reduces enemy critical hit chance by 50% when wearing all Light Armour.\r\n\r\nHeavy Armour:\r\nJuggernaut - Instead of increasing armour rating by 20/40/60/80/100%, now decreases weight of equipped Heavy Armour by 25/33/50%.\r\nConditioning - Replaced with \\'Spellward\\'. Instead of reducing weight of Heavy Armour to zero, now reduces the magnitude and duration of all enemy spells by 25% when wearing all Heavy Armour.\r\n\r\n\r\nSuggestions for additional changes would be appreciated, especially with regards to the three perks in the One/Two-Handed trees which give Axes bleeding damage, Maces armour bypass, and Swords critical hits.",
  "categoryId": "79",
  "version": "1",
  "author": "The_White_Crane",
  "createdUnix": "1328781285",
  "updatedUnix": "1328781391",
  "containsAdultContent": false,
  "uploadedBy": "The_White_Crane",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27657",
      "name": "Perk Overhaul Project v1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Perk Overhaul Project v1-8459-1.7z",
      "uploadedUnix": "1328781391",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/71164ca75750272a50cfc2e6de1c50a856122f57b7d76aad6adb6ee0c17f16ac/analysis/1406663649/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Perk%20Overhaul%20Project%20v1-8459-1.7z?fid=27657&ttl=1535767194&ri=8192&rs=8192&setec=63f08b70763bda902c76f404c3c91927"
    }
  ]
}