{
  "modId": 84626.0,
  "modName": "Privateer&#39;s Hold - Skygerfall Proof of Concept",
  "summary": "Play though the opening Dungeon of Daggerfall and re-live the beginning of the adventure within the Skyrim engine&#33;",
  "descriptionHtml": "Daggerfall re-made/re-imagined within the Skyrim engine?  It can&#39;t be done&#33;  True, if you wanted to recreate the huge, randomly-generated world and its dungeons, no, it cannot...  However, if you are willing to scale down the project to fit the size of Tamriel that has been adopted in later games, hand\r<br />craft a few dungeons and recreate the ones that were already set, it is quite feasible. \r<br />\r<br /> This mod is a first step to try to generate interest in the hopes of gathering a modding team, the way that Skywind and Skyblivion, as well as Beyond Skyrim, have been able to do so.  We are indeed late for party, but if we keep our goals moderate, it should be possible&#33; This mod allows you to play though the beginning dungeon from Daggerfall, Privateer&#39;s Hold, and if you get stuck you should be able to navigate your way following the\r<br />instructions from UESP: [url=http://en.uesp.net/wiki/Daggerfall:Privateer%27s_Hold]http://en.uesp.net/wiki/Daggerfall:Privateer%27s_Hold[/url].\r<br />\r<br />I hope you will be as pleased as I am with how well the Daggerfall music and effects mesh with Skyrim&#39;s, and have hopes of just how good the full mod could actually be when finished&#33; The mod begins with basic character creation, the opening request from the Emperor (I apologize for the poor quality of the video, but I am unaware of any other source that would be of higher quality), and then you are trapped in a cave with only one hope of escaping: a single passage leading to a dungeon filled with monsters&#33;  The mod ends when you reach what should be the door leading outside; the quest, “Privateer&#39;s Hold” completes, and a new quest, “Curse of Daggerfall” begins, but nothing else will happen.  \r<br />\r<br />The mod requires Dawnguard and Dragonborn, as well as the start of a new character, and as such will not be compatible with other alternate start mods, or any mod that restores the unused Windhelm Arena quest to Skyrim, as a vanilla quest was needed to be reassigned for character generation. If you are interested in helping out, please send me a pm.  The worldpace needs some tweaking, and then it needs to be landscaped.  Our goal will be the main quest first, which naturally involves creating several cities and towns and their surrounding landscapes, as well as dungeons and castles.  Fast-travel was always possible within Daggerfall.  Next, the worldspace can be finished, and the guild quests can be implemented as a sort of dlc in stages.  We hope to have all the quests fully voice acted.  However, there is no intention at this time of changing Skyrim gameplay.\r<br />\r<br />Here is a video of some gameplay:\r<br />[url=http://www.dailymotion.com/video/x5qvnbe]http://www.dailymotion.com/video/x5qvnbe[/url].\r<br />\r<br />[i]Why is Privateer&#39;s Hold a Nordic dungeon in your mod?[/i]\r<br />The tools which Skyrim provides allow easy assembling of both Nordic dungeons and Castle passages, which seem quite well suited for Daggerfall.  The blocky textures of the original game were not necessarily optimal.  Besides, since the Nords ruled Daggerfall for approximately 200 years in the First Era, it seems quite lore-friendly to include Nordic ruins and dungeons in Skygerfall.[i]\r<br />\r<br />Wasn&#39;t Privateer&#39;s Hold bigger in Daggerfall?\r<br />[/i]Indeed it was&#33;  If you notice a ladder which leads nowhere in the mod, my plan is to link it to a new interior space, Privateer&#39;s End, which will complete the dungeon as seen in Daggerfall.  This release is only intended to generate interest in the project.\r<br />\r<br />[i]Why do you have a Chaurus Hunter as a Giant Bat and a miniature Vampire Lord as an Imp?[/i]\r<br />I am not skilled with making custom textures and meshes.  We will need some help from people who know how to create and rig custom meshes to existing skeletons and make new .nifs and texture files that can be read by Skyrim&#39;s engine.  Many of Daggerfall&#39;s creatures are either already within Skyrim, are\r<br />available as a modder&#39;s resource from Skyrim Nexus, or have been modeled by another project, and we hope to gain permission for use in the mod.  I actually found a great 3D model of a bat we can use, but failed miserably at importing it into Skyrim.  Additionally, all human npcs will eventually be replaced with leveled actors based upon Daggerfall designations (Thief, Archer, Rogue, etc.).\r<br />\r<br />[i]What about magic?[/i]\r<br />Certain spells will need to be added to those already available in Skyrim.  In particular, levitate and mark and recall seem to be among the most important.  These have already been implemented.\r<br />\r<br />[i]Acknowledgements [/i]\r<br />Daggerfall has been free to download since the fifteenth anniversary of The Elder Scrolls series; however, Bethesda retains all ownership of these files.  No copyright infringement is intended in using the original sound and video files from Daggerfall.  Thanks to Bethesda, for making Skyrim and Daggerfall, and for making Daggerfall available for free to the public&#33;  ",
  "categoryId": "35",
  "version": "1.0",
  "author": "oracus0",
  "createdUnix": "1497479260",
  "updatedUnix": "1497478536",
  "containsAdultContent": false,
  "uploadedBy": "Oracus0",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000247024",
      "name": "Privateer&#39;s Hold",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25352",
      "fileName": "Privateer's Hold-84626-1-0.7z",
      "uploadedUnix": "1497478536",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1fa5a3db70d8b6487078493a7a5645d3d061567dbdd33492bc48a419531f1533/analysis/1497478830/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Privateer%27s%20Hold-84626-1-0.7z?fid=1000247024&ttl=1535873480&ri=8192&rs=8192&setec=9950e6903e0b6a2ac49aa842624591a8"
    }
  ]
}