{
  "modId": 8468.0,
  "modName": "Fair Khajiit - Companion of the Dragonborn",
  "summary": "This mod adds a Khajiit companion and aims to build him to become a very interactive, complete follower with several features and backstory to make him feel part of Skyrim as a loyal ally to the Dragonborn. Now version 0.40 beta!",
  "descriptionHtml": "[color=green][b]===========================================================\r\nINFORMATION: TL;DR - What is this mod?\r\n===========================================================[/b][/color]\r\nThis Mod Will:\r\n[list]\r\n[*] Add a Male Khajiit companion (Currently unvoiced) with unique, branching dialogue. He has a relationship system where dialogue and the actions of the players will affect his thoughts of the player, and as the mod progresses will expand on this. He is accessible after a short introductory quest.\r\n---\r\n[*]Follower that can change classes and combat styles according to the player\\'s needs. Starting with 4 classes, and expanding into a total of 10 combat classes and 1 class dedicated to crafting. Five different combat styles to choose from.\r\n---\r\n[*] Lore-Friendly: While the companion is a Khajiit, his upbringing is unlike most. His customs, norms and behaviour will bring about a stark contrast to the common Khajiit that one sees in the realm of Skyrim.\r\n---\r\n[*](Coming Soon) Follower will react to the Dragonborn\\'s decisions and actions throughout quests in the game.\r\n---\r\n[*] Mod Compatibility with UFO and should be compatible with just about every follower mod or mods that do not change the land next to Whiterun Stables.[/list]\r\n\r\n[color=green][b]============================================================\r\nINTRODUCTION: What is Fair Khajiit about?\r\n===========================================================[/b][/color]\r\nThis mod adds an intriguing Khajiit companion named Feres and aims to build him to become a very interactive, complete follower with several features and backstory to make him feel part of Skyrim as a loyal ally to the Dragonborn.\r\n\r\nMany followers in vanilla Skyrim are rather bland, one-dimensional, either wasted potential or simply too plain. There is too much copy-paste between them, and their relationship is very shallow or is limited to the quest that introduces you to them. The aim of this mod is to create a follower who would feel \\'complete\\' and living. He will have an opinion of everything the Dragonborn does and what is happening in Skyrim, and will level up alongside the Dragonborn in addition to being able to cast new spells as his Magicka/Perks allow. He will have 5 different fighting styles and 10 classes to choose from, and will be able to perform enchanting/smithing specific services on another, eleventh class. The goal is so that the follower complements the Dragonborn and behaves like a real companion would, growing stronger and learning new skills alongside his ally, friend/rival. \r\n\r\nWhat will divide Feres from other vanilla followers is a constant friendship/rivalry system that will rise and fall as the Dragonborn makes decisions throughout his quests and how he interacts with Feres. In addition, it allows the Dragonborn to have someone to speak to - instead of a blank character who\\'s treated neutrally every time with almost every NPC he comes across, the player can establish their personality and tendencies to Feres. Is the player an addict of Skooma? An ex-addict? An intellectual type? Did the player upset Feres once? Feres will pick up on these things and conversation will flow based on these variables. It\\'s not one-way, either - how the player interacts with Feres will impound the living personality of the Khajiit, influencing him. Sometimes, the best way to be a friend is to not always agree - after all, no person is perfect. This is one of many possible examples where friendship/rivalry variables will come into play.\r\n\r\nThe Khajiit can become your follower after following a short quest. He can be found in Riverwood. While he can be met at any point in time in a playthrough or through any alternative start mod, the best way to have the Fair Khajiit experience is to do so in a fresh playthrough - he was designed with growth and development in mind, early in the game and with the default starting scene in Helgen.\r\n\r\nAt the moment, the mod is still very much a beta and there are unique dialog lines using blank .wav files, completely apart from the default Khajiit Male voice. An alternative low-file size version is available for users of [url=http://skyrim.nexusmods.com/mods/14884]Fus Ro D\\'oh[/url]. \r\n\r\nThe character should behave like a normal follower for the time being and does not conflict with any other follower files - and in addition he will join you regardless of the number of followers you currently have (Other followers with default limitations however, may feel otherwise). \r\n\r\nAny feedback would be appreciated, along with any assistance in some of my goals and reporting any troublesome issues. I\\'m still new to the realm of modding, so I\\'m prone to quite a few mistakes. :)\r\n\r\n[color=green][b]=========================================================\r\nCLASSES AND COMBAT STYLES: What can my companion become?\r\n========================================================[/b][/color]\r\nFair Khajiit utilizes [url=http://skse.silverlock.org/]SKSE[/url].  to access a much demanded function of changing classes of NPCs. Feres has a default choice of 4 classes upon joining, with 7 more being unlockable. 6 of them are combat-related while 1 is purely for traveling/crafting. While Feres has, in my mind, a single class that he specializes in from a canon perspective, I decided to expand his skillsets through these choices both for users to be able to pick a style that best compliment their own playstyle, and also to replicate the Dragonborn\\'s growth and development. As the Dragonborn reaches the mid-level 50\\'s utilizing a set amount of skills which would eventually reach 100, to level up the player eventually has to swap weapons or try out a new style. Feres is no different in this regard, and this class system attempts to emulate that. \r\n\r\nNPCs in Skyrim have a few benefits as they level up alongside the player with Patch 1.6 - but one of the downsides is that under default settings they have a consistent amount of skillpoints to divide among their skills. While the player would have 100 in every skill by level 81, NPCs do not have that privelege, which only highlights the value in the ability for Feres to change classes to partially mimic the Dragonborn\\'s own growth. Some classes are specialized, others are mixtures of skills.\r\n\r\nWith spells (and in the future, perks), Feres will update his spell list via a dialogue command. The spells he gains are dependant on his current skill level in that particular school of magic. Once he learns a spell, it will permanently remain with him even if he changes his class to one that has a lower skill in that school. Some higher level spells will overwrite weaker counterparts (e.g. Oakflesh is overwriten by Ironflesh). If there is enough demand I can adjust this to make it a choice for Feres to either keep all his spells together or readjust all his spells appropriate to his skill level.\r\n\r\nFeres can change classes as soon as he joins you, and unlocks classes at specific levels along with a friendship or rivalry amount requirement through a dialogue command.In addition to classes, Feres has 5 different Combat Styles to choose from. Each class is aimed at different distinct roles that the character would realistically adapt. This provides even further player choice to assist in what kind of strategy the player wants to use. Unlike classes, combat styles are all unlocked from the start. \r\n\r\n[color=yellow][b]NOTE: At the time being, class changing will not immediately update Feres\\' stats, and he will only update his stats according to his new class as soon as the player levels up (divides his HMS points, to be exact). This means that the only way I know of to forcibly adjust Feres\\' stats after changing classes is via a console command to set the player\\'s level to something before going back to the new level the player just attained, as CK/SKSE has not provided the ability to use the set level function. If anyone with experience can note me about this, please do let me know, thanks!\r\n\r\nTo instantly update Feres\\' stats without having to level first, open the console via the Tilde (~) key, then type the following:\r\nplayer.setlevel (X-1)\r\nplayer.setlevel X\r\n\r\nWhere X is your current level.[/b]\r\n\r\n[b]NOTE 2: As the AddPerk command currently does not work on NPCS (If it works now, please tell me/let me know how), Feres currently begins with a good slew of perks from every relevant tree, and thus is a solid character from the very beginning of the game. Once the command works/someone informs me on how to add perks to an NPC, I will adjust it so that Feres learns perks along with his skills.[/b]\r\n\r\n[b]NOTE 3: There is a known bug where upon using the rest command, despite meeting requirements to obtain new classes, Feres may not unlock them. In such a case, use the following console command for the time being, to unlock all his classes:\r\n\r\n[i]set fkclassesunlocked to 3[/i][/b][/color]\r\n\r\n\r\n\r\n[b]Class List[/b]: All classes except for Jack have 5 main skills, 2 of which are major. Some other skills outside these 5 will raise slightly as Feres levels.\r\n[list]\r\n[*]Fencer: The default canon class of Feres. Players who want to experience the original version need not use the change class command at all. Fencer utilizes One-Handed and Alteration as their major skills, alongside Block, Restoration and Light Armor. A very survivable and versatile class.\r\n-\r\n[*]Jack: The master of none; Jack causes Feres to divide his skill points equally in all skills. He might prefer a few skills over the rest. For the players that like the idea of a character that has a tool for every occasion.\r\n-\r\n[*]Spellblade: The offense heavy counterpart of Fencer, Spellblade utilizes One-Handed and Block as their major skills, and Light Armor, Conjuration and Destruction on the side.\r\n-\r\n[*]Hunter: Hunter sees Feres dipping into a territory he\\'s unfamiliar - using a bow. As a Hunter, Feres sets One-Handed and Light Armor as the major skill, but uses Illusion, Archery and Sneak to weaken enemies from afar. \r\n-\r\n[*]Craftsman: The first class to be unlocked is a non-combat class. Feres is a decent enchanter and smith. Currently a WIP, Feres will be able to put these skills to good use to the player down the line - at the moment, it is simply a class with a spread of most skills but slight focus on Enchanting, Smithing, Sneak, Lockpicking and Restoration.\r\n-\r\n[*]Brigand: The second class to be unlocked becomes available alongside Mage and Guardian. Brigand brings Feres to new horizons as he wields a Two-handed weapon in addition to Destruction magic and a bow. His major skills lie in Block and Light Armor.\r\n-\r\n[*]Mage: Unlocked along with Brigand and Guardian, Mage is the standard bread and butter - all about magic. All five schools of Skyrim are represented here - Destruction, Conjuration and Illusion, with Restoration and Alteration being his major.\r\n-\r\n[*]Guardian: Taking his skillset to the heavyweights Feres dons heavy armor in this class. He uses One-Handed and Block as his major skill, along with Heavy Armor, Restoration and Alteration.\r\n-\r\n[*]Myrmidon: The seventh class unlocked alongside Mystic and Slayer. Myrmidon is a class where Feres mainly uses One-handed and Restoration magic, in addition to Conjuration, Destruction and Sneaking. Unlike other previous classes, Myrmidon also sees Feres utilizing other skills to an extent.\r\n-\r\n[*]Mystic: A class aimed to strike from afar, Mystic sees Feres using Archery, Illusion and Conjuration to compliment his major skills Alteration and Light Armor. Other skills are slightly represented in this class as well.\r\n-\r\n[*]Slayer: This class focuses on bringing weight, and Feres will utilize Alteration and Block as his major skills, supporting his Two-Handed, Heavy Armor and Conjuration skills in addition to other skills to provide extra versatility.[/list]\r\n-\r\n[b]Combat Style List[/b]:\r\n[list]\r\n[*]Ace: Ace is a balanced combat style, tailored to Feres\\' preference of delicately entering and exiting offense and defense. He seeks to maximise his efficiency by staggering enemies while they are power attacking, and striking enemies when they are staggered.\r\n-\r\n[*]Breaker: Breaker is a combat style aimed at heavily using stamina to stagger enemies, cancelling their attacks or breaking their guard. Moving in close and breaking the enemy\\'s balance makes this combat style very ideal for players who want to hit enemies hard when their guard\\'s down.\r\n-\r\n[*]Defender: Defender is self-explanatory; it focuses heavily on defense, holding the enemy\\'s attention and keeping one\\'s energy reserved for blocking their attacks as much as possible. This is useful for players who want Feres to tank while they pick off the enemy one at a time.\r\n-\r\n[*]Striker: Striker focuses heavily on offense, hitting the enemies hard and attempting to flank them where possible. Feres will be less likely to use ranged attacks with this combat style, preferring to go in for the kill in melee range.\r\n-\r\n[*]Sweeper: Sweeper is a style that focuses on range and playing it safe. Striking the enemies from afar or carefully attacking them up close. Feres is more likely to use ranged attacks with this style.[/list]\r\n\r\n[color=green][b]===================================================\r\nINSTRUCTIONS: How to Install? What\\'s compatible?\r\n==================================================[/b][/color]\r\n[b]===Installation===[/b]\r\n[list]\r\n[*]Ensure that your Skyrim is of the latest version.\r\n[*]Download and Install [url=http://skse.silverlock.org/]SKSE[/url].\r\n[*]If you wish to install the light file size version, download and install [url=http://skyrim.nexusmods.com/mods/14884]Fus Ro D\\'oh[/url]. \r\n-\r\n{*}[b]Installing via Nexus Mod Manager:[/b]\r\n[*]Download the latest version file with the manager, and install the mod.\r\n[*]Choose the Light version if you wish to use Fus Ro D\\'oh.\r\n[*]Activate FairKhajiit.esp.\r\n-\r\n{*}[b]Manual Install:[/b]\r\n[*]Download the .rar file.\r\n[*]Choose the Light version if you wish to use Fus Ro D\\'oh.\r\n[*]Extract the .rar file in the (SkyrimRoot)/Data folder.\r\n[*]Use the Skyrim Launcher.exe to start the game, be sure to go to Data Files and ticking FairKhajiit.Esp on.\r\n-\r\n{*}[b]Updating via Nexus Mod Manager:[/b]\r\n[*]Download the latest version file with the manager. Upon attempting to install, NMM will detect that it\\'s the same mod and will ask if you wish to overwrite the mod.\r\n[*]If the file you\\'ve downloaded is a partial patch update and not a full update, then click No.\r\n[*]If the file you\\'ve downloaded is a full update, then click Yes.\r\n-\r\n{*}[b]Updating Manually:[/b]\r\n[*]Download the .rar file and extract to the Data folder, overwrite all the files.\r\n[/list]\r\n\r\n[b]===Uninstallation===[/b]\r\n[list]\r\n[*]Dismiss Feres and remove what you want from him before uninstalling as they will be lost forever.\r\n-\r\n{*}[b]NMM:[/b]\r\n[*]Uninstall as normal via clicking the mod in the mod list and delete it from there.\r\n[*]Lastly, delete the FairKhajiit.esp folder in Skyrim/Data/Voice/ if it\\'s still there.\r\n-\r\n{*}[b]Manual:[/b]\r\n[*]Delete FairKhajit.ESP from Skyrim/Data folder\r\n[*]Delete Scripts in Skyrim/Data/Script to be deleted are all prefixed with FK. \r\n[*]Lastly, delete the FairKhajiit.esp folder in Skyrim/Data/Voice/.\r\n[/list]\r\n\r\n[b]===Compatibility===[/b]\r\n[list]\r\n[*]FairKhajiit is compatible with UFO (place above UFO in mod order). He will use UFO functions upon joining.\r\n[*]FairKhajiit should be compatible with other companion mods.\r\n[*]FairKhajiit\\'s functions mostly should remain intact or even work with just about any mod that adds additional features to all NPC\\'s/followers indiscriminately (e.g., teaching spells to followers usually allows Feres to cast it - not always in some cases.) but be aware that using additional commands from these mods to break or overcome some of the mods\\' default commands and requirements (such as joining, doing favours, etc). Amazing Followers has been known to cause some issues if you force Feres to join before he naturally allows you and locks you out of some commands until you meet those requirements and have him join normally.\r\n-\r\n[*]FairKhajiit will not be/have reduced compatibility with mods that change the area next to Whiterun Stables.\r\n[/list]\r\n[b]===Current Bugs list===[/b]\r\n[list]\r\n[*]If for some reason, you cannot \\'search the bandit\\' after getting the quest item off him, type on the console the following command without quotes: \\\"setstage fkquest01 30\\\". This often occurs in instances of players saving at the bridge across Riverwood in spawn range of the bandit. I\\'m not certain why this happens, but it does occur sometimes.\r\n\r\n[*]Sometimes using the \\'Let\\'s go over what we learned\\' will display the \\'Feres has learned (Insert Destruction/Illusion/Conjuration spell here)\\' message upon meeting the requirements, but he actually does not learn the spells, hence he cannot learn anything from those 3 schools. This is also applicable in some cases to learning new classes, despite meeting the requirements. He may not end up unlocking the classes at all.\r\n\r\n[*]Depending on the time of day, Feres may not speak to the player in Riverwood. The easiest solution for the time being is to wait till he enters the tavern (noon or evening).\r\n\r\n[/list]\r\n\r\n[color=green][b]====================================================\r\nGOALS: What\\'s next for Fair Khajiit?\r\n===================================================[/b][/color]\r\n[list]\r\n[*]Next update: Sort out kinks in current scripts and squash bugs.\r\n[*]Next update: Clean up past dialogue for consistency.\r\n[*]Next update: Add dialogue throughout the Dragonborn\\'s progress in MQ.\r\n-\r\n[*]Coming soon: Add dialogue throughout Dragonborn\\'s progress in Civil War for either side.\r\n[*]Coming soon:  Find a voice actor for Feres\\' lines.\r\n-\r\n[*]Down the line: Add more branching, personal talks with Feres to be triggered by Friendship/Rivalry.\r\n[*]Down the line: Continue developing Feres\\' personal story.\r\n\r\n[/list]\r\n\r\n[color=green][b]====================================================\r\nHELP: Want to assist with the project?\r\n===================================================[/b][/color]\r\n[list]\r\n[*]I\\'d really like to have someone come along and maybe look at my script coding/esp in general to figure out why some bugs happen, in particular with the bandit and amulet bug, along with the learn spells script. I\\'m not sure why they happen even though everything seems to be sound, script and all.\r\n-\r\n[*]I need comments! I won\\'t know of any issues unless someone who uses the mod makes a comment on how the mod is treating them, especially reporting issues that I\\'ve missed. \r\n\r\n[/list]\r\n\r\nThanks!",
  "categoryId": "66",
  "version": "0.40b",
  "author": "Rainwhisker",
  "createdUnix": "1328785868",
  "updatedUnix": "1365859590",
  "containsAdultContent": false,
  "uploadedBy": "Darkvalkyr",
  "primaryFile": null,
  "files": [
    {
      "fileId": "81525",
      "name": "Fair Khajiit 038 QuickFix",
      "version": "0.38",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Fair Khajiit 038 QuickFix-8468-0-38.rar",
      "uploadedUnix": "1344952301",
      "modVersion": "0.38",
      "virusScanUrl": "https://www.virustotal.com/file/0049a1815f659f95a326a4118dd61c0a3a2e4f986223db77cbd86fd81708ada8/analysis/1407096063/",
      "changelogHtml": " Added Change Class scripts and combat style packages <br/> \n Added some new dialogue <br/> \n Fixed up old dialogue for consistency and updated to use Rivalry <br/> \n Added new scripts to handle Friendship/Rivalry <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fair%20Khajiit%20038%20QuickFix-8468-0-38.rar?fid=81525&ttl=1535767216&ri=8192&rs=8192&setec=da12b2847aa4f37218c8a66ce7d2886d"
    },
    {
      "fileId": "81526",
      "name": "Fair Khajiit 038 Light",
      "version": "0.38L",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "164",
      "fileName": "Fair Khajiit 038 Light-8468-0-38L.rar",
      "uploadedUnix": "1344952466",
      "modVersion": "0.38L",
      "virusScanUrl": "https://www.virustotal.com/file/aec74f90fb53d13d7c10dff13b8a82793595ee9a1f98a02048c6a2580021519d/analysis/1407096064/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fair%20Khajiit%20038%20Light-8468-0-38L.rar?fid=81526&ttl=1535767216&ri=8192&rs=8192&setec=252abb0633c142bd9b1ac221a66cd820"
    },
    {
      "fileId": "81532",
      "name": "Fair Khajiit 038 Full",
      "version": "0.38",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "80896",
      "fileName": "Fair Khajiit 038 Full-8468-0-38.rar",
      "uploadedUnix": "1344954424",
      "modVersion": "0.38",
      "virusScanUrl": "https://www.virustotal.com/file/57727e4a832c788349b7fea97d178cbb45404350fe3d12d75c624be80ff12037/analysis/1407096154/",
      "changelogHtml": " Added Change Class scripts and combat style packages <br/> \n Added some new dialogue <br/> \n Fixed up old dialogue for consistency and updated to use Rivalry <br/> \n Added new scripts to handle Friendship/Rivalry <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fair%20Khajiit%20038%20Full-8468-0-38.rar?fid=81532&ttl=1535767217&ri=8192&rs=8192&setec=280b11e8c521f20c4054473d835ae39e"
    },
    {
      "fileId": "1000014377",
      "name": "Fair Khajiit 039 Full",
      "version": "0.39",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "80899",
      "fileName": "Fair Khajiit 039 Full-8468-0-39.rar",
      "uploadedUnix": "1362225344",
      "modVersion": "0.39",
      "virusScanUrl": "https://www.virustotal.com/file/c035bdb797f779977a140c183188051237d9d5d58c2061535972fce01fb3d4f9/analysis/1407447687/",
      "changelogHtml": " Updated Feres&#39; old dialogue to better suit his intended character <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fair%20Khajiit%20039%20Full-8468-0-39.rar?fid=1000014377&ttl=1535767217&ri=8192&rs=8192&setec=b1d48695711036e1f296a7a571a04fab"
    },
    {
      "fileId": "1000014379",
      "name": "Fair Khajiit 039 Light",
      "version": "0.39L",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "163",
      "fileName": "Fair Khajiit 039 Light-8468-0-39L.rar",
      "uploadedUnix": "1362225604",
      "modVersion": "0.39L",
      "virusScanUrl": "https://www.virustotal.com/file/2dc61cb004c5c203ba6ab013aa57b2ea45e6327526cd2d6a3a970b3f7673e3d7/analysis/1407447697/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fair%20Khajiit%20039%20Light-8468-0-39L.rar?fid=1000014379&ttl=1535767218&ri=8192&rs=8192&setec=5ac62c354f620e82f4834ead8e85402f"
    },
    {
      "fileId": "1000024144",
      "name": "Fair Khajiit 040beta light",
      "version": "0.40LB",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "169",
      "fileName": "Fair Khajiit 040beta light-8468-0-40LB.rar",
      "uploadedUnix": "1365859590",
      "modVersion": "0.40LB",
      "virusScanUrl": "https://www.virustotal.com/file/2515d21026157cdeb187349f7a1f44f7b9975fb3583ecc6805cdd9cea43fe24a/analysis/1407520083/",
      "changelogHtml": " Added dialogue up to returning the Dragonstone to Farengar <br/> \n Added a new way to obtain Friendship/Rivalry points daily <br/> \n Cleaned up dialogue and trimmed file from no longer relevant changes to vanilla <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Fair%20Khajiit%20040beta%20light-8468-0-40LB.rar?fid=1000024144&ttl=1535767218&ri=8192&rs=8192&setec=f063558d1b81ea8b942bdc26e8dcfed4"
    }
  ]
}