{
  "modId": 84777.0,
  "modName": "Witches Of The Vale",
  "summary": "Witches of the Vale is a W.I.P. Quest and Follower mod.\r<br />UNDER HEAVY CONSTRUCTION HELP WANTED\r<br />You encounter a female Argonian named Tabena who is in need of help.\r<br />You must find her armor and weapons that were stolen from her and you then have her as a follower. ((More coming soon))",
  "descriptionHtml": "Witches of the Vale is a W.I.P. Quest and Follower mod. \r<br />I have recently learned that this mod I made for XBOX ONE SE was um bricking the system I fixed it so that my infinite load screen went away on PC but my PC is WAAAAYYYYY too dated to run SkyrimSE so I have to upload this mod here to get critics and feedback and even help if it is offered.\r<br /> You encounter a female Argonian named Tabena who is in need of help.You must find her armor and weapons that were stolen from her and you then have her as a follower. ((More coming soon))\r<br />The armor is Vale Witch Armor...a retexture of the forsworn armor.\r<br />Baby steps guys baby steps, this is my first seemingly successful mod and I intend to continue actively updating it.\r<br />If anyone has any suggestions or is willing to collab please feel free to contact me via nexus or bethesda  or even on Discord.\r<br />Bethesda = Lor1012  **I am sharing this Bethesda acct with my S/O who will also be helping me with modding.\r<br />Nexus = HellsBaby99\r<br />Discord= ResistingArest#6834\r<br />\r<br />[UPDATE -02/12/2017-]\r<br />There were a few discrepencies I&#39;ve gone back to try and quickly fix.\r<br />I also tried to add in some misc dialogue.\r<br />Please contact me if there are any bugs you see and I&#39;ll quickly \r<br />try my best to look thoroughly through this mod to see what I can do to fix it.\r<br />\r<br />Plugin [ValeWitches.esp]\r<br />Need to know IDs for creation kit\r<br />00_TabenaArgonian (01001828)\r<br />00_OutOnALimbQuestQuest (0100182b)\r<br />ValeWitchCuirass (01000d63)\r<br />(will update overtime)\r<br />\r<br />Disclaimer I do not own Skyrim or the Creation Kit although I due wish to reserve the creative control over this mod so [TimeStamp: 2/12/2017-1:10AM] please do not take this mod and port it over to any other platforms without my permission nor alter any of the mods contents without permission. \r<br />\r<br />Credit\r<br />Bethesda\r<br />Skyrim\r<br />CreationKit\r<br />CreationKitWiki\r<br />Nexus Forums\r<br />DarkFox127@YouTube for his Tutorials\r<br />BestInSlot@YouTube for his Tutorials\r<br />GIMP 2.0\r<br />And most importantly the constant support I recieved from my S/O and my Grandfather to even pursue this passion. \r<br />You guys are on point.",
  "categoryId": "66",
  "version": "",
  "author": "HellsBaby99",
  "createdUnix": "1498024602",
  "updatedUnix": "1498024602",
  "containsAdultContent": false,
  "uploadedBy": "HellsBaby99",
  "primaryFile": null,
  "files": []
}