{
  "modId": 84799.0,
  "modName": "Sandwiches of Skyrim",
  "summary": "A mod that lets you make sandwiches, kick some butt, and save the world. (Well maybe not the last two but you can make sandwiches now.)",
  "descriptionHtml": "~Name~\r<br />Sandwiches Of Skyrim\r<br />\r<br />~Version~\r<br />1.0\r<br />\r<br />~Change Log~\r<br />1.0 - Initial Release\r<br />\r<br />~Description~\r<br />\r<br />Feeling hungry?  Have way too much Venison from murdering every deer you see?  Stolen every piece of bread from Solitude to Windhelm?  Picked up every salt pile from every barrel around because it isn&#39;t valued high so you can take it without it being considered stealing?  Well this mod is here to help.\r<br />You can now craft Sandwiches from the cooking menu.  \r<br />\r<br />there are three sandwiches you can make. \r<br />\r<br />*Sandwich\r<br />\r<br />Requires: x1 Bread, x1 Venison Chop, x1 Salt Pile\r<br />Restores 100 Health\r<br />\r<br />*Garlic Sandwich \r<br />\r<br />Requires: x1 Sandwich, x1 garlic\r<br />Restores 100 Stamina and 50 Health\r<br />\r<br />*&#34;Special&#34; Sandwich\r<br />\r<br />Requires: x1 Bread, x1 Venison Chop, x1 Salt Pile, x1 Garlic, x1 Moon Sugar, x1 Sleeping Tree Sap \r<br />\r<br />There is also recipes to cut the sandwiches into halves in case you need a healing item that heals slightly less, or maybe you just wanna help that poor Thalmor prisoner you just rescued by giving him a half of your sandwich to eat on his long trek home. \r<br />Sandwiches are great for the beginning of the game because their a healing item you can craft at the beginning without having to put time into Alchemy.\r<br />Or if your a higher level player who is carrying around 20 sandwiches you have two options. A: Reconsider your life choices from stealing enough bread to make that many sandwiches and learn to make potions. Or B: Make a &#34;Special&#34;  Sandwich.  Using a little more rare ingredients the Special Sandwich can help out higher level players in a pinch. It may or may not have a little extra side effect... You can also cut the special sandwiches in half for those times at the end of a hard days work of adventuring where you just wanna sit down, relax, and wind down with a Sandwich made by Dr. Feelgood. \r<br />\r<br />On a serious note, the ingredients to make sandwiches are pretty common but hard to get at the beginning. (As we all know Deer for some of reason can tank many of your arrows.) The numbers may be a little high for the beginning of the game but Sandwiches slowly lose their usefulness the higher you get in level. In all honesty I made this mod purely for the Roleplay aspect.  I always thought it never made sense that the people of skyrim don&#39;t know what a sandwich is. that and after making a hundred potions and using them all after one bandit hideout I needed a healing item that&#39;s a little more potent on Legendary Difficulty. \r<br />Also I had difficulty finding bread after I stole it all so I made two small recipes that lets you make your own bread.  You can get Moon Sugar from Khajiit Caravans and Sleeping Tree Sap at the Sleeping Tree camp. (Bring A LOT of Sandwiches if your going there...)\r<br />\r<br />~Author Notes~\r<br />This mod would not be possible without Hoamaii and their Sandwich texture. Please go check out her original mod and any other mod of theirs that strikes your fancy.\r<br />\r<br />Hoamaii: http://www.nexusmods.com/skyrim/users/4324947/?tb=mods&pUp=1\r<br />Original Mod: http://www.nexusmods.com/skyrim/mods/57435/?\r<br /> \r<br />~Compatibility~\r<br />Should work with any other mod.\r<br />\r<br />~Bugs~\r<br />May make you feel the guilt of killing all those deer or stealing all that bread.\r<br />\r<br />~Future Plans~\r<br />*May make a sandwich that restores Magicka for all you squishy mages out there.\r<br />*Thinking about making multiple sandwich recipes so you can make a sandwich out of more meats.\r<br />*Might Possibly make new sandwiches if Hoamaii would be willing to make new sandwich textures for me.\r<br />\r<br />~Credits~\r<br />Bethesda for making Skyrim\r<br />Hoamaii for making the sandwich texture.\r<br />\r<br />~Recommended Mods~\r<br />Ultimate Hunter&#39;s Overhaul \r<br />http://www.nexusmods.com/skyrim/mods/53056/?\r<br />\r<br />More Arrows by Cupressi\r<br />http://www.nexusmods.com/skyrim/mods/11613/?\r<br />\r<br />~Disclaimer~\r<br />I do not own Skyrim (Aside from buying it off of Steam)\r<br />Skyrim and its respected DLC&#39;s are owned by Bethesda\r<br />You may NOT re-upload this mod anywhere else\r<br />You may NOT re-upload this mod to nexus for bug fixes\r<br />\r<br />From: The Lone Wolfe",
  "categoryId": "100",
  "version": "1.0",
  "author": "xXLoneLoboXx",
  "createdUnix": "1498138519",
  "updatedUnix": "1498138507",
  "containsAdultContent": false,
  "uploadedBy": "xXLoboSolitarioXx",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000247663",
      "name": "Sandwiches Of Skyrim",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "272",
      "fileName": "Sandwiches Of Skyrim-84799-.7z",
      "uploadedUnix": "1498138507",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/ba98bfea8235fee10b868c3e879f5bd6ad2d8cf5eb79e3e2e9ed5159a472395d/analysis/1498138563/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sandwiches%20Of%20Skyrim-84799-.7z?fid=1000247663&ttl=1535873652&ri=8192&rs=8192&setec=97ec118a5334d678e393253c73b8db92"
    }
  ]
}