{
  "modId": 84891.0,
  "modName": "Jon Frost",
  "summary": "A couple of followers plus a wolf as a homage to Jon Snow and Ygritte",
  "descriptionHtml": "This is just a small mod that I did during the pauses of my main WIP mod, got the idea after watching the new GoT trailer where we saw Jon going beyond the wall again.\r<br />\r<br />This mod consists on a couple obvisouly based on Jon Snow and Ygritte plus Ghost but without being a complete copy, so that they can be their own characters. They will level with the player, are essential and possess unique gear that I made non-available to the player to get from them.\r<br />\r<br />Requirements:\r<br />Skryim up to date and Dragonborn DLC\r<br />\r<br />Location:\r<br />They have a small camp north of Solitude, there will be a map marker on your map to make it easier to find them.\r<br />\r<br />Characters:\r<br />\r<br />Jonathan Frost - He is a Nord who uses a Silver Sword (because like Jon Snow&#39;s sword this one is also more effective against undead plus the basic shape is almost the same unlike the Steel or Iron swords) with a frost enchantment, sometimes might use a regular long bow. Wears the Skaal armor with the following enchantments (Fortify One Handed, Resist Frost, Fortify Health Regen).\r<br />\r<br />Igrid Frost - She is also a Nord that uses a Hunting Bow to fight with also a frost enchantment, might sometimes engage in melee combat with a dagger. Just like Jonathan she wears the same clothing with the same echantments except she has Fortify Archery instead of Fortify One Handed.\r<br />\r<br />Phantom - He is an Ice Wolf loyal to Jonathan, will always follow him and will help in combat. He can not be a follower to the player, but if you have Jonathan as a follower, Phantom will go with both of you and aid in battle. \r<br />\r<br />\r<br />I might revisit this mod to give it some tweaks, considering it was a quick mod done while I was &#34;resting&#34; from the other one I am making I suppose there might be some things to correct. Please give me your feedback on what you think should be changed/improved and why. Hope you enjoy it.",
  "categoryId": "66",
  "version": "1",
  "author": "Wintermoon137",
  "createdUnix": "1498445110",
  "updatedUnix": "1498445105",
  "containsAdultContent": false,
  "uploadedBy": "Wintermoon137",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000247932",
      "name": "Jon Frost and Phantom",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "319",
      "fileName": "Jon Frost and Phantom-84891-1.rar",
      "uploadedUnix": "1498445105",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/571cea4778a02b8842e8f6eaceebf67f468e8c16b1fca97070b137afaa11c2c7/analysis/1498445403/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Jon%20Frost%20and%20Phantom-84891-1.rar?fid=1000247932&ttl=1535873733&ri=8192&rs=8192&setec=29b826c6d2f92c33be4676b20625a6c9"
    }
  ]
}