{
  "modId": 84902.0,
  "modName": "Dovahh Spells",
  "summary": "Guys a updated version is done from scratch and link is below in description.  A mod with some changes to spells especially for the Dragonborn. Please share your opinion on the mod to improve it.Also place you requests and changes needed.\r<br />\r<br />Video now attached on spells working in action.",
  "descriptionHtml": "[youtube]FSyzccsC5Kc[/youtube]\r<br />\r<br />\r<br />\r<br />[b][size=4][color=#ff0000]Hey guys mod is updated and now requires DLC. New spells are added too. You can download it from here    [/color]\r<br />[color=#ff7700]http://www.nexusmods.com/skyrim/mods/84987/?[/color]\r<br />[/size][/b]\r<br />\r<br />\r<br />\r<br />Hello all,\r<br />\r<br />I am a new to creating mods in Skyrim and this is my first upload. Ive been playing with these for my own game play but now decided to share with others too. So this is my first step so forgive if its not much.\r<br />\r<br />About the mods : these mods contain a set of spells which are especially edited with small changes which i always wanted and especially for the Dragonborn Roleplay. Also these are only obtainable through consoles and i named all with &#34; Dovahh&#34; so it will be easy to search in consoles and not cluttering with the list of all spells in the game. I am working on adding them as tomes through vendors which will be in future release.\r<br />\r<br />Now the spells :\r<br />\r<br />1. Dovahh Spike - Bound arrows which can be cast by any or both hands but can be fired in rapid sessions. (I used a mod with crossbows which rapid fires but wanted in a single hand spell and hence Dovahh spike )\r<br />\r<br />2. Dovahh Frost spike - Same as Dovahh spike but with ice projectiles\r<br />\r<br />3. Dovahh Lightning Fury - Casts chain lightning which can be constantly projected like sparks spell and the spell jumps between targets but with disintegration effect removed ( i always liked chain lightning but hated to cast each time so made this change so i can cast it continusly. Also i play a half necromancer type and hated ash pile which is useless to raise dead and hence removed disintegration )\r<br />\r<br />4. Dovahh Servant - Able to rise any dead creature except dead dragons and darven automations. Also level limit removed so enjoy raising Giants too. ( I hated when my character cant raise dead saying it resisted. Felt like all thos conjuration training at college wasted so hence this change.)\r<br />\r<br />5. Dovahh Draugr overlord- Can summon a dragur which has one handed ebony sword , fire breath and unrelenting force shout. Uses frost cloak too .Also affected by twin perk\r<br />\r<br />6. Dovahh Wrath- Cloaks the dragonborn with fire damage spell which affects enemies. This is a lesser power which lasts three minutes. ( i love flame cloak spells and use em when lazy or roaming through wilds but also the flame effect annoys. So a power changed from ancestor&#39;s wrath)\r<br />\r<br />\r<br />So thats it guys. Also please note it may be unbalanced but ill try to modify it in future. I am open to ideas and suggestions .So players and fellow please speak your mind. \r<br />\r<br />Added a small video on working of mo",
  "categoryId": "75",
  "version": "1.9.3.82",
  "author": "PradeepToretto",
  "createdUnix": "1498490802",
  "updatedUnix": "1498490719",
  "containsAdultContent": false,
  "uploadedBy": "PradeepToretto",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000247975",
      "name": "Dovahh",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Dovahh-84902-1-0.rar",
      "uploadedUnix": "1498490719",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8b255a8831e04cf7c8fc32dbf645c5050f934d2a92ea4c3299d525262c319f2d/analysis/1498490883/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dovahh-84902-1-0.rar?fid=1000247975&ttl=1535873743&ri=8192&rs=8192&setec=7a59c266a06bd6792cc24e296cbc062b"
    }
  ]
}