{
  "modId": 84933.0,
  "modName": "Dunmer Wear Dunmer Clothes",
  "summary": "Dunmer around Skyrim will now wear clothes added in the Dragonborn DLC.",
  "descriptionHtml": "[center][b]{This is the first mod I have uploaded here. Your feedback would be appreciated.}[/b][/center]\r<br />[b] [/b]\r<br />This mod was made by me when I realized that the Dark Elves in Skyrim were lacking something. I was just\r<br />recently playing Morrowind ([i]again[/i])when I had an idea. Why not make people just a little bit nostalgic by making\r<br />the Dunmer in Skyrim wear clothes added by the Dragonborn DLC. It isn’t\r<br />perfectly like Morrowind, but it manages to make me a bit nostalgic, so I decided\r<br />to upload it here for everybody to download.\r<br />\r<br />[center][b]FEATURES:[/b][/center]\r<br />\r<br />-Most named Dunmer commoners on mainland Skyrim will now be wearing clothes\r<br />added by the Dragonborn DLC. I tried not to edit any mages or whatnot, so you\r<br />will not find Temple Robes on random Necromancers and such.\r<br />\r<br />-One Dunmer Ghost will now be wearing Bonemold Armor [i](hint: do the quest No Stone Unturned)[/i]. I read the wiki page and itsaid she was an ambushed caravan refugee from Morrowind. I thought it would be\r<br />fitting for her to have Boenmold Armor.  \r<br />[b]\r<br />[/b][center][b]INSTALLATION:[/b]\r<br />Use the NMM, or extract the ESP into your Skyrim/Data folder and\r<br />check it in the Data Files section of the launcher.[/center]\r<br />\r<br />[center][b]COMPATIBILITY:[/b][/center]\r<br />\r<br />This mod is fully compatible with most other mods. It only edits the clothing\r<br />of the NPCs. I have tried it with [i]DLC Integration[/i][i] by [b]Dillonn241[/b][/i][b] and [/b][i]Dunmerized Gray Quarter[/i][i] by [b]MCR[/b][/i]. These mods seemed to work as intended. The merchants willstill sell items from the respective DLCs. I loaded it after both of these mods\r<br />just to be safe and I would suggest you load it after these as well. You don’t\r<br />have to download these mods, but it certainly helps make the Dark Elves seem\r<br />more like they were from Morrowind.\r<br />\r<br />[center][b]CHANGELOG:\r<br />[/b][/center][center]Version 1.0:\r<br />-Initial Release.[/center]\r<br />\r<br />[b]CREDITS:[/b]\r<br />[b]-[/b][b]Dillonn241for making the mod DLC Integration[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/82106/]http://www.nexusmods.com/skyrim/mods/82106/[/url]?\r<br />-MCR formaking the mod Dunmerized Gray Quarter\r<br /> [url=http://www.nexusmods.com/skyrim/mods/33119/]http://www.nexusmods.com/skyrim/mods/33119/[/url]?\r<br />- Bethesda Game Studios, for making a great game and DLC. They made the tools necessary to make this mod.\r<br />\r<br />",
  "categoryId": "78",
  "version": "1.0",
  "author": "Skeleton212",
  "createdUnix": "1498622558",
  "updatedUnix": "1498622558",
  "containsAdultContent": false,
  "uploadedBy": "skeleton212",
  "primaryFile": null,
  "files": []
}