{
  "modId": 84930.0,
  "modName": "Solstheim for the Dunmer",
  "summary": "Changes that (I hope) help Dunmer-ize the island of Solstheim.",
  "descriptionHtml": "This mod attempts to more thoroughly Dunmer-ize the island of Solstheim. I&#39;ve tried to stay within lore and to maintain the character of the region as set forth by Bethesda. SftD relies heavily on the work of other modders for many meshes and textures. SftD can be considered more of a stylistic change than anything. Alteration of the function of original elements wasn&#39;t my goal and I&#39;ve tried to keep them intact.\r<br />\r<br />I&#39;ve never liked Bethesda&#39;s Raven Rock or for that matter much of Solstheim, all the way back to Morrowind&#39;s Bloodmoon DLC. In the vanilla version, Severin Manor is the only place I want to spend any time. Since I usually play the game with Skyrim Unbound and never start the main quest, I can rarely even enjoy the Manor (can&#39;t sleep because of Miraak). Numerous other things drive me nuts. Here&#39;s a few examples.\r<br />* The Morvayn family has been prominent for centuries. Lleril Morvayn is a Redoran Councilor, the ruler of civilized Dunmer on Solstheim, effectively the leader of the Redoran Guard and a reknowned warrior. His personal living space, however, amounts to one dinky little bedroom in an interior cell consisting of two rooms. The other room is inhabited by a married couple, who he has to walk by to get downstairs. Meanwhile, two drunken beggars down the street have three times as much living area, even if it isn&#39;t as pretty. The Ienth and Alor houses are both extremely spacious in comparison, yet both of those families are supposedly in dire straits. Bulwark jail residents have as much room as Lleril Morvayn and it&#39;s nicer, and *catered*.\r<br />* Too many paper lamps, all flickering on the same frequency. Makes it look like someone is diddling around with a light switch. Most of them aren&#39;t light sources. The light sources are usually the open log fires, on an island that has a scarcity of unburnt wood.\r<br />* If a bunch of dirty Reavers (too many) can eke out a living in the ash of Solstheim, it ought to be a picnic for ashlanders. But there aren&#39;t any ashlanders; not even displaced ones from Vvardenfell that you&#39;d expect.\r<br />* If I recall correctly, Vvardenfell&#39;s population was only about half Dunmer, the rest being a mix of races. I remember Vvardenfell (of Morrowind, the game) being very cosmopolitan. However, the only Red Year refugees represented in Skyrim are Dunmer.\r<br />* If the quests involving Raven Rock are completed, the Severins, Mogrul, Mogrul&#39;s thug and Drovas are removed from town. Come to think of it, I&#39;m not even sure about the Redoran Guards that hammer on the Earth Stone all day long. They might disappear as well. Replacements are unzombified Bralsa and Rirns, and four miners that never leave the mines. So even though things in Raven Rock are supposedly improved by: opening up the mines; removing a vicious loan shark and his henchman; rooting out threats to House Redoran; and ending the mind control emanating from the Earth Stone; the population only increases by one.\r<br />\r<br />In the end, I feel like I have failed in making Raven Rock more visually interesting. I made a dent, of course, and it&#39;s all functional. But it didn&#39;t turn out like I&#39;d hoped. I wanted to achieve more of an Ald-ruhn look, but I don&#39;t have the 3D skills to make that happen. There&#39;s an unused mesh that ships with Dragonborn that is reminiscent of what was done with Morrowind. It doesn&#39;t come with a matching interior, and I finally gave up on making one. I settled for meshes from other modders that were based on Morrowind&#39;s Dagon Fel, as well as Velothi-style resources in other locations. I have attempted to tweak some of these resources to help them fit in, learned much in the process.\r<br />\r<br />I did manage to add a little more civilization. There&#39;s so much working against it. Solstheim is very small, especially considering all the stuff crowded onto it. The coastline is one of the few regions you can modify that will still fit into lore, won&#39;t look totally out of place and won&#39;t break anything. I&#39;d like to have created more communities on the west coast, but there are too many in-game references to how bad the fishing is, how unsafe the island interior remains and how little settlement exists outside Raven Rock.\r<br />\r<br />Goals\r<br />-----\r<br />Add architectural variety to Raven Rock and Tel Mithryn.\r<br />Add Morrowind elements to areas inhabited by Dunmer.\r<br />Expand civilized Dunmer presence on Solstheim.\r<br />Maintain integrity of original game (no broken quests, NPCs, etc)\r<br />\r<br />\r<br />Features\r<br />--------\r<br />Seventeen new NPCs, most with dialogue (but not voiced). Includes a small clan of ashlanders, and two merchants.\r<br />Eight new interior cells, not including the ashlander yurts.\r<br />Courtesy of other modders, Morrowind architecture&#33;\r<br />\r<br />Installation\r<br />-------------\r<br />Download the compressed file and extract to your Skyrim data directory. Make sure you&#39;ve fulfilled the other requirements (listed below). Enable as_SftD.esp file.\r<br />\r<br />\r<br />Changes\r<br />-------\r<br />Raven Rock\r<br />- Removed many lamps, replaced with versions that have different flicker rates.\r<br />- Fireplace chimney stacks added to several structures.\r<br />- Altered well and surrounding area.\r<br />- Retching Netch exterior mesh changed, interior cell modified (fewer lights). Added covered bench outside Netch entrance.\r<br />- Mallory house exterior mesh changed. Exterior work area recreated. Removed redundant smelter.\r<br />- Ienth house location changed, interior cell modified (reduced area). Yam farm expanded. Vegetable stand created for vending. Tower mesh and interior cell created for Milore&#39;s shop.\r<br />- Alor house extensively modified, inside and out.\r<br />- Morvayn manor exterior door relocated near temple entrance, interior completely redone. Old Morvayn Manor location now Arano house.\r<br />- Temple interior modified. Covered bench added to temple exterior area.\r<br />- All tomb interiors modified. Now, main tomb only connects with temple; Ulen and Morvayn tombs only connect to outside. Exterior door meshes for Ulen and Morvayn tombs modified.\r<br />- Abandoned building (Bralsa&#92;Rirns house) moved across street and rebuilt.\r<br />- Two new houses added near docks. Entrances to respective interior cells enabled when mine is opened.\r<br />- Two ruined houses added between town and Earth Stone; one house has cellar.\r<br />- Tower added on beach near Earth Stone, corresponding interior cell created.\r<br />- Lighthouse fire added on the Bulwark.\r<br />- Idles for Gjalund changed.\r<br />- Several AI packages altered and new packages created to keep existing NPCs from falling all over each other, mindlessly repeating dialogue. Idle marker locations changed and new ones added.\r<br />- Existing Dunmer miner NPCs (enabled after Final Descent quest completion) were given packages to allow them to do something other than dig. Dunmer female added as wife of one of the miners.\r<br />- Lleril Morvayn provided with servants: one Dunmer male and one Nord female.\r<br />- Beach tower given Dunmer male resident.\r<br />- Ruined house cellar given Khajit female resident; Khajit takes over Drovas&#39; role if he leaves Raven Rock.\r<br />\r<br />Tel Mithryn\r<br />- Added two exterior structures and corresponding interior cells: mushroom farm, and house for farm laborer. Added Dunmer male for each. Farm owner is also merchant for mushrooms.\r<br />- Modified lamps over walkway to Neloth&#39;s house.\r<br />- Near Tel Mithryn, silt strider merchant is given a larger tent.\r<br />\r<br />Northshore Landing\r<br />- Mudcrabs removed.\r<br />- Recreated shack as a raised smokehouse, added crafting stations.\r<br />- Added bridge connecting smokehouse and temple.\r<br />- Temple exterior and corresponding interior created. Public area with shrines, beds and a couple of crafting stations.\r<br />- One female and two male Dunmer added as temple staff.\r<br />- Ancarion altered to allow him to function effectively as a merchant that buys only stalhrim stuff. Apparently intended by Bethesda developers but didn&#39;t work even after last official patch.\r<br />\r<br />Brodir Grove\r<br />- Reavers and their stuff removed (some was repurposed; Stormfang, for instance, is retained).\r<br />- Added five ashlander yurts and leather awning, two crafting stations.\r<br />- Added three male and two female Dunmer as ashlanders. One of the Dunmer males, a trader, spends part of the day near the Bulwark jail entrance.\r<br />\r<br />Near Ashfallow Citadel\r<br />- Reaver camp removed.\r<br />- Ashlander yurt and one interior cell added.\r<br />- One male and one female Dunmer added.\r<br />\r<br />Requirements\r<br />------------\r<br />Skyrim, of course\r<br />Dragonborn\r<br />Fuz Ro D-oh Silent Voice. Without Fuz Ro D-oh, the new NPCs will still run around and do stuff, and the merchant interactions will work, but other dialogue will not function correctly.\r<br />This mod *must* be run either with a new save, or an existing save where the PC has *never* been to Solstheim. You can load it on an existing Solstheim save to take a look, but it won&#39;t be long before things get wonky.\r<br />\r<br />\r<br />(In)Compatibility\r<br />-------------\r<br />USLEEP-compatible.\r<br />Any mod that changes the same cells as SftD has the potential to be incompatible.\r<br />This mod does not change the Severin Manor interior cell, but does alter the AI packages of Mirri and Tilisu. End result: you should still be able to get Severin Manor as a player house with no problems. I&#39;ve tested this numerous times. Let me know if it isn&#39;t working.\r<br />This mod will *not* work with the &#34;Immersive Solstheim&#34; portion of ETaC, or &#34;Raven Rock Expanded&#34; (RRE). I know that will be an instant write-off for many. SftD has a markedly different design philosophy from ETaC and there&#39;s too much overlap. ETaC *without* Immersive Solstheim should be OK. SftD and RRE are alike in spirit, but it would have required starting with RRE and building up from there. I wasn&#39;t interested in building an RRE patch.\r<br />&#34;Alternate Start - Live Another Life&#34; (AS-LaL v3.16): version 0.400 and later of SftD should work with the Dunmer/Solstheim start for AS-LaL\r<br />Populated Solstheim does not conflict. However, using the two of them together is redundant and it might lead to some silly-looking behavior.\r<br />General mesh or texture changes should not conflict. Examples tested include SMIM, Roads of Solstheim, Skyrim Flora Overhaul, Skyrim HD and aMidianBorn.\r<br />&#34;Enhanced Lights and FX&#34; (ELFX) won&#39;t break anything but I haven&#39;t patched SftD to match it. Using them in conjunction will lead to weird lights in inexplicable places. There are some wonderful things in ELFX and I&#39;d like for it to work with SftD, but I can&#39;t promise I&#39;ll make that happen. I haven&#39;t tested SftD with &#34;Realistic Lighting Overhaul&#34; (RLO) as of 06/24/2017. Last I checked, RLO didn&#39;t cover the Dragonborn DLC.\r<br />Morrowloot and its variations: I don&#39;t know, but I will try to find out. I almost always try to incorporate that mod on playthrough.\r<br />06/28/2017: Undriel&#39;s Teldryn Sero mods: I get mesh overlap as a problem, at the least. Still researching to see if I can get these working with SftD.\r<br />\r<br />\r<br />I have tried to limit my edits to Solstheim and its interiors. There may be other cell edits indicated in the CK. I swear that sometimes even clicking on the name of a cell is enough for the CK to consider it modified. I don&#39;t *think* I&#39;ve edited any vanilla meshes or textures, one of the reasons this took so long to complete. Anything changed should be in the form of a new mesh or texture and included in the compressed file. [b]If this is your [u]1st install[/u] of SftD and you&#39;re prompted to overwrite a *file* (you&#39;ll probably get a warning about the texture and/or mesh directory), then don&#39;t let SftD overwrite and *let me know*.[/b]\r<br />\r<br />My computer&#39;s graphical display ability is slightly less than an Atari 2600. I can play with or without this mod at slightly over 30fps. It adds new AI packages but no other scripting. It shouldn&#39;t cause a noticeable performance hit.\r<br />\r<br />Cleaned with TESVEdit. I spent many hours trying to make sure navmeshing was both working and unharmed, and I think I&#39;ve succeeded.\r<br />\r<br />Why didn&#39;t you ...\r<br />------------------\r<br />... create some quests? Because most interesting quests have at least some degree of scripting, and I haven&#39;t mastered scripting yet. However, I left open the option to add quests to SftD and I may come back to it.\r<br />... record voices for the NPCs? I don&#39;t have the equipment or talent to provide that. I might have been able to pull it off for one NPC, but not seventeen, and definitely not the females.\r<br />\r<br />Credits:\r<br />Very little of SftD could have been completed without the following resources from other modders.\r<br />http://www.nexusmods.com/skyrim/mods/59632/?\r<br />http://www.nexusmods.com/skyrim/mods/60125/?\r<br />http://www.nexusmods.com/skyrim/mods/59977/?\r<br />These three are Tamira&#39;s conversions of Phitt&#39;s work for Oblivion (http://www.nexusmods.com/oblivion/mods/37329/?) I have included the documentation for those resources in SftD.\r<br />\r<br />http://www.nexusmods.com/skyrim/mods/81079/?\r<br />Another conversion of Phitt&#39;s stuff, by minermanb\r<br />\r<br />I have tweaked a number of their files to help them fit into TES V&#39;s Solstheim. It&#39;s quite possible I missed adding some material data. If so let me know, about those or other errors, and I&#39;ll correct it. ",
  "categoryId": "78",
  "version": "0.403",
  "author": "anothersunday",
  "createdUnix": "1498599684",
  "updatedUnix": "1498881026",
  "containsAdultContent": false,
  "uploadedBy": "grimjaw5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000248062",
      "name": "as_sftd.zip",
      "version": "0.326",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "89008",
      "fileName": "as_sftd.zip-84930-0-326.zip",
      "uploadedUnix": "1498598912",
      "modVersion": "0.326",
      "virusScanUrl": "https://www.virustotal.com/file/0ddc6709c309ff05d52f99cd199639996922693794408db4f104d28e062e63a9/analysis/1498599132/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/as_sftd.zip-84930-0-326.zip?fid=1000248062&ttl=1535873765&ri=8192&rs=8192&setec=87d6ff19e6cb05bf544c9db3a20b7b35"
    },
    {
      "fileId": "1000248237",
      "name": "as_sftd.zip",
      "version": "0.403",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "89016",
      "fileName": "as_sftd.zip-84930-0-400.zip",
      "uploadedUnix": "1498874649",
      "modVersion": "0.403",
      "virusScanUrl": "https://www.virustotal.com/file/a1b29f078c9ec3f4a8d833b4af4311bb92ef5e4998aa367369b8da229cb96cab/analysis/1498874897/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/as_sftd.zip-84930-0-400.zip?fid=1000248237&ttl=1535873765&ri=8192&rs=8192&setec=de9d3e52788ee4c2be04b8a310dfd7f1"
    },
    {
      "fileId": "1000248244",
      "name": "as_SftD_esp0404.zip",
      "version": "0.404",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "1059",
      "fileName": "as_SftD_esp0404.zip-84930-0-404.zip",
      "uploadedUnix": "1498881026",
      "modVersion": "0.404",
      "virusScanUrl": "https://www.virustotal.com/file/cdc0a22c6fd8a930ae65a0466df559a9a309c697157b28011063d8cb224972cb/analysis/1498881125/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/as_SftD_esp0404.zip-84930-0-404.zip?fid=1000248244&ttl=1535873766&ri=8192&rs=8192&setec=9c3e6f9bd22665df3340181f2296beec"
    }
  ]
}