{
  "modId": 8495.0,
  "modName": "Smithing Reworked",
  "summary": "Reworks the smithing tree to include iron, hide, fur and leather perks.  Makes arcane blacksmith and advanced armous easier to access. Adds fletching for arrows.",
  "descriptionHtml": "If there&#39;s anything smithing related you&#39;d like to see added to this mod then please let me know, i&#39;m always looking out for new ideas&#33;\r<br />\r<br />[size=4][color=#6060c0][u]Description[/u][/color][/size]\r<br />\r<br />I made perks for hide, iron, fur and leather smithing, making them available or just easier to improve.  I moved arcane blacksmith to be accessed by hide or iron and advanced armours is now accessed by elven or orcish perks.\r<br />\r<br />This is just me messing about with the creation kit, expect more from this including fletching when i get time.\r<br />\r<br />Hide Smithing - Start of the tree\r<br />Iron Smithing - Alternate start of the tree\r<br />Fur Smithing - Needs Hide Smithing and smithing of 20\r<br />Leather Smithing - Needs Fur smithing and Smithing of 30\r<br />Elven Smithing - Changed to need Leather Smithng and Smithing of 40\r<br />Steel Smithing - Now needs Iron Smithing\r<br />Arcane Smithing - Needs Iron or Hide Smithing and Smithing of 50\r<br />Advanced Armours - Can be accessed from either Elven or Orcish Smithing.\r<br />Silver Tempering - Just get the Arcane Blacksmith perk to be able to temper silver weapons (All silver weapons are enchanted by default, so it not arcane blacksmith letting you temper silver, it just that they are enchanted)\r<br />\r<br />Fletching - Make arrows at forges if you have the perk for the material, i.e if you have steel smithing you can make steel arrows.  You only get 5 arrows but it only costs 1 ingot and 2 leather strips to make.\r<br />\r<br />Bug fixes - I&#39;ve fixed a few bugs from the game, the nordic hero bow is now smithable when you can smith nordic hero weapons and the skyforge steel dagger is now temperable.   Also the skill increase shouldn&#39;t jump 15 level for 1 iron dagger now ;)\r<br />\r<br />\r<br />\r<br />[line]\r<br />[size=4][color=#6060c0][u]Contact[/u][/color][/size]\r<br />\r<br />\r<br />You can find me on NexusMods.com as &#39;Stewb&#39;, Bethesda Forums as Acwaz-Mare or alternatively you can email me at: stew1409@yahoo.co.uk",
  "categoryId": "24",
  "version": "1.04",
  "author": "Stewb",
  "createdUnix": "1328800538",
  "updatedUnix": "1339095503",
  "containsAdultContent": false,
  "uploadedBy": "Stewb",
  "primaryFile": null,
  "files": [
    {
      "fileId": "66558",
      "name": "Smithing Reworked",
      "version": "1.04",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10",
      "fileName": "Smithing Reworked-8495-1-04.zip",
      "uploadedUnix": "1339095503",
      "modVersion": "1.04",
      "virusScanUrl": "https://www.virustotal.com/file/eebc4d89da76944ba28c43baead5480612a8a6469998c6aab381467201c517c1/analysis/1406945116/",
      "changelogHtml": " optional no Fletching file <br/> \n saved under 1.5 <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Smithing%20Reworked-8495-1-04.zip?fid=66558&ttl=1535767267&ri=8192&rs=8192&setec=830f9fb3084c340233f245dd94312b04"
    }
  ]
}