{
  "modId": 8502.0,
  "modName": "Dynamic Merchants",
  "summary": "Merchants from all across Skyrim can now profit from the Dovahkiin\\'s adventures. With this mod the amount of gold that a merchant has depends on how much you trade with them. Buy or sell expensive items and the merchant may have extra gold when you next visit.",
  "descriptionHtml": "Merchants from all across Skyrim can now profit from the Dovahkiin\\'s adventures. With this mod the amount of gold that a merchant has depends on how much you trade with them. Buy or sell expensive items and the merchant may have extra gold when you next visit.\r\n\r\nMost shops will just recieve extra gold when they are profitable, but blacksmiths will sometimes receive extra ingots and alchemy stores can receive extra potions. Some merchants also receive rare items after their store has received high trade volume.\r\n\r\nThis currently works for all merchants in Solitude, Whiterun, Windhelm, Riften, Markarth, Falkreath, Morthal, Dawnstar and Winterhold as well as all Fences, Dark Brotherhood and Trade Caravans.\r\n\r\nLet me know if you have any suggestions or problems.\r\n\r\nUpdate 1.9:\r\n-Implemented for all merchants in orc strongholds.\r\n-Moth gro-Bagol may now stock a rare set of enchanted dwarven armor when profitable.\r\n-Phinis Gestor may now stock 4 new conjuration spells when profitable.\r\n\r\nUpdate 1.87:\r\n-Merchants now remember their profit after you exit and load the game. (In all cases now (I think))\r\n-Profit now decays gradually over multiple merchant respawns.\r\n\r\nUpdate 1.85:\r\n-Implemented for all merchants in Markarth and Riverwood\r\n-Added the possiblity of stocking daedric armor to two blacksmiths (in rare cases when very profitable)\r\n\r\nUpdate 1.8:\r\n-Implemented for all merchants in Winterhold College\r\n-Colette Marence can now invest her profits in 4 new restoration spells (the master lvl spell requires completion of the \\\"Restoration Ritual Spell\\\" quest before it can be potentially stocked).\r\n\r\n\r\n=== Future Plans ===\r\n\r\n- Expand to all merchants [in progress]\r\n- Make stock dependant on trade volume in addition to gold [in progress]\r\n- Make Quests and other events effect shop stock\r\n- Add unique rare items that are only sold by shops with high trade volume [in progress]",
  "categoryId": "69",
  "version": "1.9",
  "author": "Atomatic",
  "createdUnix": "1328802842",
  "updatedUnix": "1329669050",
  "containsAdultContent": false,
  "uploadedBy": "Atomatic",
  "primaryFile": null,
  "files": [
    {
      "fileId": "33709",
      "name": "Dynamic Merchants",
      "version": "1.9",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "99",
      "fileName": "Dynamic Merchants-8502-1-9.7z",
      "uploadedUnix": "1329669050",
      "modVersion": "1.9",
      "virusScanUrl": "https://www.virustotal.com/file/c73a347336185f92eb5ce3141fa9241712f3be3568d490a34c370d397bb914db/analysis/1406695733/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dynamic%20Merchants-8502-1-9.7z?fid=33709&ttl=1535767282&ri=8192&rs=8192&setec=a3fa8fc6fbd87b635a4b3badb66b8786"
    }
  ]
}