{
  "modId": 85040.0,
  "modName": "Requiem - A Good Trade",
  "summary": "My personal take on some of the outstanding issues and annoyances in Requiem - The Roleplaying Overhaul. Includes changes to artifacts, shouts, standing stones, upkeep cost and more.",
  "descriptionHtml": "This is my personal take on some of the outstanding issues and annoyances in Requiem.\n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/85040/85040-1517084548-451432752.png[/img][/center]\n<br />\n<br />One of the most frequent complaints about Requiem is the broken endgame balance. Personally I consider this one of Requiem's best features: A real sense of character progress. You start out as a whelp and slowly work your way up until you become a demi-god. This is completely justified considering Skyrim's lore and questlines. A seasoned warrior like Ulfric Stormcloak may win a rebellion, a master thief like Mercer Frey may deveive and rob the Thieves Guild and a highly talented mage like Ancano may kill the Arch-Mage but defeating Alduin, Miraak and Lord Harkon takes a lot more. But there is a but: You can become said demi-god at level 20 because there are just too many ridiculously overpowered artifacts that you can aquire very easily (and ridiculously overpowered Adept spells but that's a different issue). On the other hand there are supposedly powerful artifacts locked behind high level quests that are completely useless. This module fixes both of these issues.\n<br />\n<br />Every artifact has been reworked to have an unique, lore-friendly and useful enchantment that's appropriate for the level you usually aquire it. I won't spoil every single change (you can check the readme tab if you want to) but I'll give you a few examples:\n<br />\n<br />The bummer first: The Aetherium armor has been removed. Firstly, it conflicts with ingame dialogue and lore, something Requiem puts a huge emphasis on. Katria flips out when she sees an Aetherium Shard yet she completely ignores an Aetherium Helmet a few meter away? Same story for the other three pieces. At the Aetherium forge she says: [i]\"There isn't any Aetherium here, is there? Damn it! Wait! ...Yes, yes there is. The shards we collected... they're pure Aetherium, remember? It's not much, but it'll do.\"[/i]  [b]Except that I have a whole Aetherium armor in my backpack that I don't need because I'm not trained in heavy armor![/b]\n<br />Secondly, it's overpowered and anti-climatic because the item crafted at the Aetherium forge is supposed to be the ultimate reward for this long and hard quest. Adding the Atherium armor made only ever sense because the items crafted at the Aetherium forge were so irrelevant. The Aetherial Shield is the most useless artifact in all of Skyrim, the Aetherium staff is superseed by pretty much every other staff and the Aetherium Crown is just broken non-sense (both bugged and highly exploitable). These three artifacts have been changed into something truly powerful. The Aetherial Shield is now a warrior's best friend against mages and dragons, the Aetherial Crown is a powerful artifact for mages and the Aetherial Staff summons one of Requiem's most fearsome opponents...\n<br />\n<br />The quest to obtain Sanguine's Rose is beautifully made, with different approaches (speechcraft, bribe, fight) and you have to fight multiple high-level mages in the final act. Yet the award is an utterly useless staff. It requires you to be naked and drunk (or over-encumbered), which is a death sentence in Requiem, just to summon a dremora for pathetic 20 seconds. On top of that it's incompatible with certain needs mods like RND. This has been fixed by\n<br />[list]\n<br />[*]Increasing the duration of the summoned dremora.\n<br />[*]Allowing to summon the dremora without being naked and drunk or carrying 100 bottles of mead. Instead Sanguine's Rose will make you drunk over time. Thus Sanguine can now enjoy watching the Dragonborn slowly getting drunk (on power).\n<br />[*]Giving the staff unlimited charges. This makes pushing your limits all the more tempting.\n<br />[/list]\n<br />The worst (as in worst idea) artifact in Requiem is the Necromancer's Amulet. It can be obtained at level 1 without engaging combat but it has one of the best enchantments in the entire game. Let's not get me started on all the exploits it enables... To be able to wear it you need at least 150 base magicka. Depending on your race this requirement is either trivial or impossible to overcome for at least 18 levels. The lowered stamina and health regeneration is so irrelevant it isn't even worth mentioning. The Necromancer's Amulet's enchantment has been completely changed and now allows raising one more undead without any additional up- or downsides. This is an effect that's useful at level 1 and at level 80 alike.\n<br />\n<br />The Ghostblade is a unique and beautiful weapon that is rewarded for clearing a dungeon filled with necromancers. However its enchantment, 3 additional damage, is a complete joke and having the base damage of a steel sword doesn't make the weapon any better. I rectified this by increasing its base damage and, inspired by its spectral appearance, I allowed it to ignore all armor. This makes the Ghostblade an interesting choice against heavily armored foes like dragons and Dwarven constructs.\n<br />\n<br />The Arch-Mage's Robes are the ultimate reward for completing the College of Winterhold questline including Labyrinthian, which is one of the hardest dungeons in Requiem. Such artifacts should be extremly powerful and haven't been nerfed.\n<br />\n<br />Again these are just some of the most prominent examples. I changed many more artifacts and didn't neglect lesser ones like e.g. Kyne's Token either. Overall there are a lot more buffs than nerfs. After all this is A Good Trade.\n<br />\n<br />\n<br />A controversial topic regarding artifacts is the armor type of the dragonpriest masks. Information only visible in the CK indicates that each mask is of a different material but some may say with good reason Bethesda has no clue what they actually want, some believe they are just ceremonial masks and should provide no protection, some believe the armor type must match the enchantment, others argue such a distinction isn't possible because there are just too many possible builds. I fixed all of these points by giving the player full control over the armor type in a more or less immersive way. By default dragonpriest masks are clothing. Once you've aquired one you can visit Bromjunaar Sanctuary and use the ancient workbench to change the armor type to light or heavy armor. You can repeat this for each mask as often as you'd like to. Dragonpriest masks benefit from Arcane Craftsmanship if KFR is installed.\n<br />[size=6]\n<br />Conjuration[/size]\n<br />\n<br />Currently this modules only changes the necromancy branch but I might extend this to the whole school because the issues with Conjuration are quite severe: Bound weapons are nothing but decoration and starting from Adept spells you unlocked Requiem's easy mode.\n<br />\n<br />Raise Dead\n<br />\n<br />\n<br />\n<br />[list]\n<br />[*]Skeletal Soldier and Skeletal Archer are Novice spells. They are \n<br />\n<br />[*]Skeletal Hero and Skeletal Warlock are Apprentice spells. They're true glass cannons. They hit as hard as they\n<br />\n<br />[*]Spectral Warhound and Spectral Warrior are Adept spells. They're as strong as their counterpart in Labyrinthian which means they're on par with the Spirit Troll and Flame Atronach.\n<br />[*]Spectral Berserker and Archer are Expert spells. They're as strong as their counterpart in Labyrinthian which means they can kill just about anything.\n<br />[*]Ghostly Dragonpriest is the Master spell. He's as strong as his counterpart in Nordic ruins. He randomly spawns as a fire, frost or shock magic user to provide some more flexibility.\n<br />\n<br />[/list]\n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/85040/85040-1517084572-486163565.png[/img][/center]\n<br />\n<br />Prior to Requiem 2.0 shouts were simple and incredibly boring: Whatever shout you were going to use for whatever purpose, Slow Time did the job better. The third word of Slow Time is equivalent to typing \"tgm\" into the console and lasts for half a minute which can be less than the cooldown by the time you get it. If you get bored of Slow Time, there is Marked for Death, perhaps Fire Breath and well ... nothing else. In Requiem 2.0 Slow Time was finally nerfed but there is still no reason to use 80% of the shouts. This module attempts to fix that by rebalancing all shouts, while taking into account at what point during the game you'll get the words of power. You can check the readme tab for a full changelog but here's a short summary:\n<br />[list]\n<br />[*]Fire-and-forget shouts like Frost Breath have a reduced cooldown.\n<br />[*]Lesser shouts with little power like Disarm have increased strength or reduced cooldown.\n<br />[*]Dragonrend now actually matches its role in the lore and forces dragons to experience the concept of mortality and doesn't just make them land a little more often.\n<br />[*]The final word of supposedly powerful shouts like Storm Call, that are absolute endgame content, are much more powerful and completely anihilate your enemies.\n<br />[*]Summons from shouts (e.g. Durnehviir) don't count towards your summon limit.\n<br />[/list]\n<br />In conjunction with the other modules, that add more sources of shout cooldown, this should make shout focused characters more viable.\n<br />\n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/85040/85040-1517084584-1848674640.png[/img][/center]\n<br />\n<br />Why another standing stones overhaul? Because Requiem and all currently available standing stones overhauls have an inherent flaw: They reshape the standing stones into kind of pseudo-birthsigns, but don't give you straight access to all of them. They're an integral part of the character build, yet you must first find them in the world, where some of them are even guarded. Having to come up with a roleplay reason to visit a standing stone on a remote island just to get your birthsign is ridiculous.\n<br />\n<br />I attempt to fix this by having both static birthsigns, that strictly follow the [url=http://en.uesp.net/wiki/Skyrim:The_Firmament]Firmament[/url], and standing stones, that are discovered while exploring Skyrim and grant power to the worthy.\n<br />\n<br />Birthsigns are meant to refine your character build and grant a substantial but balanced bonus. The effects are listed [url=https://staticdelivery.nexusmods.com/mods/110/images/85040/85040-1516920136-1717509806.png]here[/url]. Note that the Atronach doesn't penalizes magicka potions or long-term buffs of food. The birthsign is selected in the MCM menu. It won't be displayed in the active magic effects menu because it's a metagaming choice and not something you've aquired while playing. If you have forgotten your choice or its effects you can always look it up in the MCM. Chose your birthsign wisely as you cannot undo your choice!\n<br />\n<br />Standing stones grant small abilities that sometimes have a downside. The strength of the abilities takes the location of the stone into account. They aren't powerful enough to be considered in your character build. I recommend you don't look them up  but discover them in the game.\n<br />\n<br />[color=#ff0000][size=3][b]Important:[/b][/size][/color] The Upkeep Cost module is required for the Shadow to work.\n<br />\n<br />\n<br />[center][img]https://staticdelivery.nexusmods.com/mods/110/images/85040/85040-1517084600-626352681.png[/img]﻿[/center]\n<br />This module removes the skill based scaling of upkeep cost from illusion spells. This was in my opinion one of the most obscure design choices in Requiem. There is no reason why a spell should become harder to maintain as your skill improves. This could lead to the absurd scenario that not taking an illusion perk is actually beneficial. The scaling of upkeep cost also came with a number of drawbacks that are now fixed:\n<br />[list]\n<br />[*]Perks, that decrease upkeep cost, decrease the magnitude of the whole spell.\n<br />[*]The upkeep cost isn't displayed as a detrimential effect in the active magic effect menu.\n<br />[*]Active illusion effects display the upkeep cost instead of their actual effects.\n<br />[/list]\n<br />All Illusion spells now have a fixed upkeep cost. As a result several spells have a lower upkeep cost than before which makes illusion a bit more viable.\n<br />\n<br />[size=5]Fixes\n<br />[/size]\n<br />This is a collection of several small bug fixes and tweaks. I see no good reason to skip any of these so I packed them into a single module. There is no spoiler here, I just don't want to clutter the description with a full changelog.\n<br />\n<br />[spoiler]\n<br />\n<br />Bug: Khajiit caravans, Enthir and Mallus stop selling most of their wares when they become fences.\n<br />Solution: Khajiit caravans, Enthir and Mallus now sell their usual wares alongside the additional goodies for thieves.\n<br />\n<br />Bug: Bosmer can eat corpses without triggering a crime alarm.\n<br />Solution: The only proper way of fixing this is using the vanilla feeding system. Bosmer now actually eat their slain enemies and don't just loot strange meat. Because it's no longer possible to carry the flesh of your slain enemies with you and eat at any time, the duration the Greenpact Feast has been doubled.\n<br />\n<br />Problem: All Bosmer are treated as cannibals by the game and will be offered strange meat (human flesh). This becomes even more severe with the above fix because now they will see an message box each time!\n<br />Soultion: Those who chose not to follow the Green Pact can disable it in the MCM and won't be treated as cannibalis by the game.\n<br />\n<br />Problem: Potions of Ably Blacksmithing are useless.\n<br />Soultion: Their magnitude and duration has been doubled.\n<br />\n<br />Problem: The prices of spell tomes differ greatly with no apparent pattern. This encourages meta-gaming choices when selecting the free spells from the magic perks because you can save hundreds of gold at a stage in the game where gold still matters.\n<br />Solution: All spell tomes of the same tier have the same price. Novice costs 250, Apprentice 500, Adept 750, Expert 1000 and Master 2500.\n<br />[/spoiler]",
  "categoryId": "79",
  "version": "1.0.0",
  "author": "thetrader",
  "createdUnix": "1499108287",
  "updatedUnix": "1499108287",
  "containsAdultContent": false,
  "uploadedBy": "thetrader",
  "primaryFile": null,
  "files": []
}