{
  "modId": 85087.0,
  "modName": "CWRS -Civil War Recurring Sieges - SMHK - Hungarian translation",
  "summary": "A Polgárháború túlnyúlik a küldetésen és még azután is ostrom alá kerülnek az erődök. Kompatibilis a CWO-val.",
  "descriptionHtml": "Eredeti: [url=http://www.nexusmods.com/skyrim/mods/53318/?]CWRS -Civil War Recurring Sieges[/url] by [b]Edoserax[/b] \n<br />Polgárháború - Ismétlődő ostromok; Fordította: ignussen\n<br />\n<br />Leírás: A Polgárháború túlnyúlik a küldetésen és még azután is ostrom alá kerülnek az erődök.\n<br />Szükséges kiegészítők: nincs\n<br />Eredeti letöltése: nem szükséges\n<br />Kompatibilitási problémák: nincs\n<br />Megjegyzés: lásd alant\n<br />\n<br />----------\n<br />- Leírás -\n<br />----------\n<br />\n<br />A Polgárháború túlnyúlik a küldetésen és még azután is ostrom alá kerülnek az erődök.\n<br />\n<br />A Zsoldosok élete...\n<br />Íme, egy kis izgalom a polgárháborúhoz, mely a játszhatóságra fókuszál, bármiféle követelmény, ill. az alapjáték módosítása nélkül. Ahogy egyre feljebb lépdelsz a ranglétrán, egyre több feladatod lesz, zsoldosokat sorozhatsz be és egyre nehezebbé válnak a csaták. Miután véget ér a polgárháború küldetéssorozata, észrevehető, hogy számos további góca maradt fent az ellenséges erőknek, kik továbbra is megpróbálják megvívni harcukat Égkoszorúért.\n<br />\n<br />Igyekeztem olyan modul készíteni, mely valami pluszt ad, se nem befolyásolja a többi Polgárháborús javítást. Nem akartam, hogy csak annyit mondjanak, á megint egy újabb CWO. Célom tehát a plusz volt, és lehetőleg ne befolyásoljam a Polgárháború küldetéseit.\n<br />\n<br />Egy olyan háborút ajánlok, mely sohasem ér véget, egy olyan háborút, melyre már a legelső nap óta vártunk, mely köré az egész játéknak épülnie kellett volna. Az első két évben csak magamnak készítettem, el, de valaki javaslatára nyilvánosságra hoztam. Remélem, így mindenkinek meghozza a Polgárháború azt, amire számolt.\n<br />\n<br />\n<br />Dinamikus szkriptek és véletlen feladatok\n<br />\n<br />-ISMÉTLŐDŐ OSTROMOK: A játék minden 48 órájában lefrissül, így generálva eseményeket, melyek az elfoglalt erődökben véletlenszerűen lépnek fel Égkoszorú egészén. Üld meg az ellenség parancsnokát, s jutalmad egy trófea és egy kevés arany lesz.\n<br />\n<br />-HADI FELADATOK, mely a v2.0.1-be jelent meg. Ugyancsak ismétlődő esemény, melynek feladata, hogy megvizsgálja a polgárháborús erődöket, van-e ott tiszt, ki az ellenséges tervek megszerzésére indult.\n<br />\n<br />-SOROZÁSI RENDSZER: Ha eléred a Hópöröly vagy Tribunus rangot, további feladataid lesznek. újoncokat kel  felkutatnod, ill. Csatamágusokat, kikből egy saját egységet kell kialakítanod, természetesen, mintha csak a követőid lennének. \n<br />\n<br />**Problémák, melyek felléphetnek az Örökös viszály és a Fogazott Korona küldetések során **\n<br />\n<br />Ha ezt a modul az Örökös viszály vagy a kialkudott fegyverszünet során telepíted, akkor számos bugos esemény generálódhat. Ha eme küldetés előtt telepíted, nem lép fel semmiféle hiba.\n<br />\n<br />Minden tökéletes lesz, ha a CWRS-t telepítése után új játékot kezdesz, vagy azelőtt teszed meg, hogy elkezdted volna a polgárháborús küldetéseket. Ha viszont már letudtad a Fogazott korona küldetést, akkor számos hibás esemény generálódhat. Ilyenkor távolítsd el, majd telepítsd újra, s minden rendbe jön.\n<br />\n<br />\n<br />\n<br />-------------\n<br />- Telepítés -\n<br />-------------\n<br />\n<br />Mod managerrel (pl: NMM): csak kövesd végig az utasításokat.\n<br />\n<br />Manuálisan:\n<br />1) Másold be a letöltött fájl tartalmát a '..&#92;Skyrim&#92;Data' mappápa\n<br />2) Data Files-ban pipáld be a 'CWRS.esp'-t\n<br />\n<br />---------------\n<br />- Eltávolítás -\n<br />---------------\n<br />\n<br />1) Dobj el minden olyan tárgyat, mely a kiegészítőhöz kapcsolódik.\n<br />2) Menj be egy olyan helyre, mely NEM a kiegészítőhöz tartozik.\n<br />3) Mentsd el a játékot (Normál mentés legyen nem gyorsmentés!!!)\n<br />4) Lépj ki, majd töröld a modult!\n<br />5) Tölts be a legutolsó mentésedet (Felugró ablakban: igen)\n<br />6) Mentsd el újra a játékot.\n<br />7) Ajánlott egy mentett állás tisztító program futtatása is (pl.: Skyrim SaveGame Cleaner)\n<br />\n<br />------------------\n<br />- Kompatibilitás -\n<br />------------------\n<br />\n<br />Teljesen kompatibilis a CWO (VCivil War Overhaul), sőt a mégjobb játékélmény érdekében ajánlott mindkettő használata!\n<br />\n<br />--------------------------------\n<br />\n<br />További fordítások: [url=http://smhk.gportal.hu/gindex.php?pg=37023934]SMHK oldalán[/url]\n<br />NEXUS-n (A keresőbe írd be: Hungarian)  \n<br />\n<br />Kapcsolattartás: Discordon (link a fenti SMHK oldalon)\n<br />\n<br />Special thanks to...\n<br />- Bethesda for Skyrim;\n<br />- Creator(s) of this mod;\n<br />- Epervier 666 for ESP/ESM Translator;\n<br />- tesvTranslator by McGuffin;\n<br />- and everyone who helps and supports in our work.",
  "categoryId": "35",
  "version": "v2.0.1",
  "author": "ignussen",
  "createdUnix": "1499255517",
  "updatedUnix": "1499255514",
  "containsAdultContent": false,
  "uploadedBy": "ignussen",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000248585",
      "name": "CWRS -Civil War Recurring Sieges-hun",
      "version": "v2.0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15239",
      "fileName": "CWRS -Civil War Recurring Sieges-hun-85087-v2-0-1.7z",
      "uploadedUnix": "1499255514",
      "modVersion": "v2.0.1",
      "virusScanUrl": "https://www.virustotal.com/file/587a5406bc78270ea90222fa16f5c400da865b1695eb3e9a3b322f4ef34f112e/analysis/1499255816/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/CWRS%20-Civil%20War%20Recurring%20Sieges-hun-85087-v2-0-1.7z?fid=1000248585&ttl=1535873925&ri=8192&rs=8192&setec=e777eb99318d75c38626d2b8d0aeb8a7"
    }
  ]
}