{
  "modId": 8512.0,
  "modName": "Skyrim Scary Monster Makeover v2",
  "summary": "Fight undead, daedric and generally more evil looking non-human enemies.  A retexture overhaul WIP",
  "descriptionHtml": "Ironman5000\\'s Skyrim Scary Monster Makeover - Creature Retexture Overhaul\r\n=========================================================================\r\n\r\n[img]http://skyrim.nexusmods.com/imageshare/images/2570251-1328807319.jpg[/img]\r\n\r\n!THIS MOD CONTAINS IMAGERY OF GORE, USE AT YOUR OWN DISCRETION!\r\n\r\n\r\nChanges v2 12/02/12: Added new textures for the Horker, Frost Dragon, Bear, Polar Bear, Wisp Mother, Skeleton, and Snow Sabre Cat.  See the latest screenshots.\r\n\r\nChanges 12/04/12: Added NMM version compiled by ShopsD.\r\n\r\nThe skeleton is a hi-res retexture which also changes the bones and skulls that clutter the world.\r\n\r\n\r\nDescription:\r\n\r\nThis mod, as the title suggests, is a work-in-progress to retexture every creature in the game to build a more diverse gaming experience.  You will see undead, daedric, gorier, or just more evil looking monsters to replace the original.\r\nThis mod will be updated regularly with added retextures and might even add new creature types in the process with possible unique boss monsters. \r\nIncluded are my previous relpacers, some updated and improved.  Check my Daedric Chaurus and Fiendish Falmer mods for alternative versions of those creatures with a red colour scheme.\r\n\r\nIf you enjoy this mod you will love Skyrim Monster Mod, http://skyrim.nexusmods.com/downloads/file.php?id=9694 which uses several textures from this mod.\r\n\r\nHere is a taste of what to expect when using both of these mods\r\n[youtube]36uYeeKMAVU[/youtube]\r\n\r\n\r\nCompatibility:\r\n\r\nThere will be conflicts with existing creature replacers, all I can suggest is that you choose your preferred mod.\r\nI may decide to work on compatibilty for the more popular replacers at a later date.\r\n\r\n\r\nInstallation:\r\n\r\nExtract the folder into the Skyrim data folder, default folder directory should be C:\\\\Program Files(x86)\\\\Steam\\\\SteamApps\\\\common\\\\skyrim\\\\data.  If you have a mod that already has new creature meshes or textures then you will be prompted to overwrite files, say yes to all for this mod to take effect fully.\r\n\r\nIF you have any possible conflictions and you do not want to replace already installed creature replacers, check the file when the overwrite window pops up and select \\\"no\\\".\r\n\r\nAlternatively you may prefer to extract the data to a temporary destination, for example your Documents\\\\MyMods folder and transfer the creatures seperately depending on preference.  The seperate folder is recommended for mod extraction so that you can keep track of installed data when you decide to transfer it.\r\n\r\nIf you choose to use the Daedric Chaurus and Fiendish Falmer alternative textures install this mod first, then overwrite the required files when installing the others.\r\n\r\n\r\nUninstallation:\r\n\r\nCheck the folders included in this mod and delete the appropriate files, it would be helpful to use the recommended extraction method to make the process easier.\r\nIf you have more mods active it might be a good idea to check these folders before deleting them in case there are additional files such as custom skeleton nif or normal map dds files, for example.\r\n\r\n\r\nTools used:\r\n\r\nBSAopt, the ideal Skyrim BSA extraction program\r\nGimp 2.0, a really useful and free image editing program\r\nNifskope 1.1.0-RC5 - Latest version compatible with Skyrim meshes\r\n\r\n\r\nPermissions:\r\n\r\nIf you would like to use any of my files for your own mods please send me a PM and I will give you the OK.  I would like to know what projects you are working on too so I can check them out when they are done.\r\nI don\\'t want this mod published on other sites without my expressed permission, I will likely be fine with it as long as I know about it just PM me through the contact link.  Thanks!\r\n\r\nCredits: ShopsD for compiling the NMM version. (I\\'ll reupload ASAP, it was incomplete)\r\n\r\n\r\nFeedback:\r\n\r\nFeel free to get beck to me about conflict issues, installation problems, requests or any other feedback you wish.  \r\n",
  "categoryId": "79",
  "version": "2",
  "author": "Ironman5000",
  "createdUnix": "1328806425",
  "updatedUnix": "1334254419",
  "containsAdultContent": true,
  "uploadedBy": "Ironman5000",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27810",
      "name": "SSMM v1",
      "version": "1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "40187",
      "fileName": "SSMM v1-8512.7z",
      "uploadedUnix": "1328807147",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/1ebfaa5cabc7751893d9e52f186a30e5c65731713550fe60173c2224e2113ab0/analysis/1406664401/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSMM%20v1-8512.7z?fid=27810&ttl=1535767297&ri=8192&rs=8192&setec=e25b6be750a36d5b309e124c0f09d4f6"
    },
    {
      "fileId": "29864",
      "name": "SSMM v2",
      "version": "2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "64216",
      "fileName": "SSMM v2-8512-2.7z",
      "uploadedUnix": "1329077628",
      "modVersion": "2",
      "virusScanUrl": "https://www.virustotal.com/file/6e297ec2adfd39e17807ea04a9f807e41a8c4c98653fe34f5baf5cc8af0c3f54/analysis/1406674678/",
      "changelogHtml": " Added more creature textures, see the latest screenshots <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SSMM%20v2-8512-2.7z?fid=29864&ttl=1535767298&ri=8192&rs=8192&setec=157af0a6e99c3b42d279aee8f5d12e21"
    },
    {
      "fileId": "52631",
      "name": "NMM version",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "100105",
      "fileName": "NMM version-8512-1.rar",
      "uploadedUnix": "1334254419",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/0306daab0cde15571ec946df53462bc3e1d12330d38e5a9457ccc45fb8a789f2/analysis/1406812018/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NMM%20version-8512-1.rar?fid=52631&ttl=1535767298&ri=8192&rs=8192&setec=7d8c177e9194c7dc21b4e01ff6e52347"
    }
  ]
}