{
  "modId": 85193.0,
  "modName": "FIXED  StojaMakeupPack.esp NO MORE LOOT CRASH",
  "summary": "No more LOOT / TES5Edit / Wyre Crashes. ",
  "descriptionHtml": "I am a total noob at mods , but 6 hours of being hard headed and stubborn and not quitting. I learned the basics of CK. I fixed the ESP. I\r<br /> will upload the ESP only as its my first ever attempt to do anything on\r<br /> here other than download stuff. I take NO CREDIT for this , I am just fixing the ESP file for you to use. All I had to do was load it in ck and set it as active and then save. It took out some null code.  It is a very good mod and I love it. It just needed the esp fixed.  I am not sure what caused it to break. I used it for a week , but i saw multiple threads on it being broke after my loot crashed. I  hope the mod author does not mind. I am sure he would much rather me share his fixed esp than people uninstall it. If he contacts me , i will send to him and take mine down. I Take no credit. I had to read for about 2 or 3 hours of google to learn how to do this. I think I will brave up and start modding by making a follower.   I just assume he want share a fix till he can see his esp broke.   All CREDIT goes to the ORIGINAL Mod creator  [url=http://www.nexusmods.com/skyrim/users/4341236]Veeblix Stoja&#39;s Warpaints - A High Resolution Makeup Kit for Skyrimby [b]Veeblix. \r<br />\r<br />[/b][/url]TO FIX =  Modmanager .. i dont know any other tools.  Just find the main file with all the files from his download in it. Then right click on it and open in explore. Delete old esp. copy/paste this one. and Close window. Check to see the esp is activated. run loot and get that bad little ESP back in line. OR \r<br /> &#34;Forget the list , it goes to the block &#34; \r<br />\r<br />I may learn how to make a follower.   I decided to share this , because I have got many good MODS here for 2 years and I feel i owe it to do my part , a bit small part. ",
  "categoryId": "95",
  "version": "1.1",
  "author": "Veeblix",
  "createdUnix": "1499629134",
  "updatedUnix": "1499628043",
  "containsAdultContent": false,
  "uploadedBy": "Memphisblue999",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000248950",
      "name": "StojaMakeupPack.rar",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "StojaMakeupPack.rar-85193-1-1.rar",
      "uploadedUnix": "1499628043",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/e8e844acd0ea5b455523c0844a6f711e9cfa3134dab49a56fa0bc5f41b6dfbc8/analysis/1499628482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/StojaMakeupPack.rar-85193-1-1.rar?fid=1000248950&ttl=1535874039&ri=8192&rs=8192&setec=4755293402a432fd05f60538a3ae43ef"
    }
  ]
}