{
  "modId": 85229.0,
  "modName": "Extra NPCs",
  "summary": "Adds over 2,000 NPCs to various enemy factions",
  "descriptionHtml": "[center]You enter a bandit-held fort and as they fall and die before your unstoppable onslaught, you think to yourself: &#34;Boy I wish this were more of a challenge.&#34;\r<br />Well, that wish has been granted&#33;\r<br />\r<br />[color=#ff0000]So what does this mod do?[/color]\r<br />\r<br />This mod aims to make encounters with various enemies a more challenging and fun experience. You&#39;ll be more likely to encounter bandits/reavers/forsworn/vampires that are at, near or above your level. Enemy dungeons will also be more a bit more populated. That bandit dungeon you easily cleansed of the 4 or 5 bandits inside? It&#39;s now occupied by a small army of bandits. Many of these enemies will now be wearing different equipment (but also their vanilla gear too).\r<br />\r<br />[color=#ff0000]Specific changes[/color]\r<br />\r<br />[color=#ffff00]Bandits and Reavers[/color]\r<br />\r<br />\r<br />More unique faces. Eg. EncBandit01Melee2HNordM won&#39;t have the same face as EncBandit01Melee1HNordM like in vanilla.\r<br />Spellswords (magic in one hand, weapon in the other) added to melee bandit lists. They will wear either light or heavy armour (but never a combo of both such as a heavy cuirass and light boots)\r<br />Regular bandit and Reaver enemies cap at level 60 instead of 25.\r<br />Bandit Chiefs and Reaver Lords cap at level 72.\r<br />Male and female High Elf mages, warriors (light armour only) and spellswords. \r<br />Female Argonian mages. Male and female Argonian archers.\r<br />Female Khajiit archers and warriors (light armour only).\r<br />Male and female Wood Elf warriors (light armour only).\r<br />Male and female Breton archers, warriors (light and heavy armour), spellswords and Chiefs. \r<br />Male and female Dark Elf archers, warriors (two-handed and one-handed, light armour and heavy armour), spellswords and Chiefs. \r<br />Female Orc warriors (two-handed and one-handed, light armour and heavy armour) and Chiefs.\r<br />Male and female Imperial mages and spellswords and female two-handed Chiefs.\r<br />Male and female Nord spellswords and female two-handed Chiefs. \r<br />Male and female Redguard archers and mages. Female two-handed Chiefs. \r<br />Various named Bandits, such as Hajvaar Iron-Hand, now have unique faces.\r<br />Human and dark elf bandits now have &#34;alternate&#34; versions with different voices. Two female, three male. Nords have two extra females and four extra males.\r<br />\r<br />Bandits will now have a small chance to wear Fur Helmets, Hide Helmets, Iron Helmets, Leather Helmets both variations of Steel Helmets and Scaled Helmets.\r<br />Bandits may also equip themselves with Iron Gauntlets, both variations of Steel Gauntlets, Steel Plate Gauntlets and Nordic Carved Gauntlets.\r<br />Like Reavers, Bandits have a higher chance of wearing a full matching suit of armour. \r<br />\r<br />As I said before, Bandits and Reavers now have higher level NPCs in their lists. Vanilla Reavers have also had their names changed to set them apart from Bandits.\r<br />\r<br />Reaver Freebooter: Level 5\r<br />Reaver Corsair: Level 9\r<br />Reaver Hijacker: Level 16\r<br />Reaver Picaroon: Level 21\r<br />Reaver Buccaneer: Level 25\r<br />Bandit Raider and Reaver Rover: Level 31\r<br />Bandit Despoiler and Reaver Harrier: Level 37\r<br />Bandit Vagabond and Reaver Privateer: Level 46\r<br />Bandit Ravager and Reaver Scourge: Level 60\r<br />\r<br />[color=#ffff00]Forsworn[/color]\r<br />\r<br />The Forsworn didn&#39;t get as much changes as the bandits and reavers did, but I added a few things that are worth mentioning.\r<br />One extra female added to all Forsworn types (melee, archer, mage).\r<br />Forsworn Necromancers.\r<br />In keeping with Broken Tower Redoubt&#39;s all-female theme, the Briarheart of that dungeon has been replaced with a Forsworn mage named &#34;Forsworn Matriarch.&#34;\r<br />Forsworn mages have had their names changed. I get the feeling Bethesda wanted to do this (since they named the level 1 mages &#34;Shaman&#34;).\r<br />Forsworn mages also have a small chance to wield Forsworn Staves instead of the generic ones Warlocks use.\r<br />Forsworn Warlords have been re-implented and had their name changed to &#34;Forsworn Devastator.&#34;\r<br />\r<br />Forsworn mage names:\r<br />\r<br />Forsworn Shaman (both regular and necromancer): Level 1\r<br />Forsworn Augurer (regular), Forsworn Bloodcaller (necromancer): Level 6\r<br />Forsworn Seer, Forsworn Defiler: Level 14\r<br />Forsworn Warlock, Forsworn Gravesinger: Level 24\r<br />Forsworn Soothsayer, Forsworn Soul Eater: Level 34\r<br />Forsworn Sybil, Forsworn Deathstrider: Level 46\r<br />\r<br />[color=#ffff00]Vampires[/color]\r<br />\r<br />Like Forsworn, there wasn&#39;t much to add to the vampire faction.\r<br />\r<br />Redguard and Wood Elf vampires. (Regular and Master Vampires).\r<br />Vampires will now have a small chance to wear Vampire Gauntlets.\r<br />Vampires will either wear a full suit of Vampire Armour or  Vampire Robes (but never a mixture).\r<br />Vampires can now wield maces.\r<br />\r<br />[color=#ffff00]Warlocks[/color]\r<br />\r<br />Warlock is the catchall term for the various types of magic-wielding enemies that wear robes you encounter across Skyrim.\r<br />This was the first faction I started working on. I know I added more NPCs to their lists but I can&#39;t remember exactly what races they were.\r<br />Warlocks will now no longer be restricted to Black Robes and Black Boots. They will now also wear Blue, Red, Brown, Grey and Green Robes (and their hooded varieties).\r<br />Conjurers and Necromancers will now use a random destruction element, like in Oblivion. Eg. Necromancers will now no longer be limited to only ice spells. I didn&#39;t add any new Warlocks to their dungeons as I felt that having a horde of them would be too much for the player to handle.\r<br />\r<br />[color=#ffff00]Blackblood Marauders[/color]\r<br />\r<br />Blackbloods now no longer look identical to one another. I didn&#39;t add a gazillion faces, but hopefully you won&#39;t see the same face coming at you again and again.\r<br />Female Blackbloods.\r<br />Captain Hargar has a unique face.\r<br />\r<br />[color=#ff0000]In Conclusion[/color]\r<br />\r<br />Is this mod lore friendly? Yes, I believe it is. I made an effort to keep it lore friendly, right down to the weight scale of elves - none are above 50 weight, like in vanilla (except Orcs), hair colours (Orcs have mostly black or grey hair with a small number of brown haired individuals) and demographics (bandits will slightly be more likely to be human - specifically Nords).\r<br />\r<br />I did my best to make sure there are no grey-faced NPCs (as a result of not having their faces exported from the CK) but I [i]may [/i]have missed one or two. Sorry.\r<br />\r<br />Why did I make this? Why not? I had fun making it, even if it did take the better part of a year and a half. Yes, a year and a half. o_o\r<br />\r<br />Why a big ol&#39; wall of text in the description? I like writing, lol.\r<br />\r<br />What does this mod require? All three official DLCs.[/center]",
  "categoryId": "33",
  "version": "1.0",
  "author": "NitroGoose",
  "createdUnix": "1499767633",
  "updatedUnix": "1499767075",
  "containsAdultContent": false,
  "uploadedBy": "NitroGoose",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000249070",
      "name": "Extra NPCs",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "476938",
      "fileName": "Extra NPCs-85229-1-0.zip",
      "uploadedUnix": "1499767075",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Extra%20NPCs-85229-1-0.zip?fid=1000249070&ttl=1535874071&ri=8192&rs=8192&setec=54f89397c6afd2a1cb7343bb56183db3"
    }
  ]
}