{
  "modId": 8522.0,
  "modName": "Automatons and Shurikens - Dwemer Schematics",
  "summary": "This mod adds hidden Dwemer Schematics in Dwemer ruins, you can make the automaton robots to be summoned! ALSO Shurikens!!",
  "descriptionHtml": "Cao\\'s Automatons and Shurikens, Dwemer Schematics.\r\n\r\nChoose Search, Buy, or Cheat version, choose only one.\r\n\r\nThis mod adds hidden Dwemer Schematics in Dwemer ruins, Morrowind had schematic drawings but they served no purpose other than for looks. Well now in Skyrim you can make the automaton robots to be summoned!\r\n\r\nWalk a little way up the road south of Honningbrew Meadery (near Whiterun) and you will find a camp of the merchant/smithy Clagius Caro, he specializes in Dwemer artifacts and scrap parts... if you don\\'t feel like scavenging for Dwemer parts, you can buy them from him. And he has a Smelter and Anvil you can use to make all the automatons and shurikens you can.\r\n________________\r\n\r\nIf you could donate, it would be great, I spent many hours before the creation kit was released to create this mod, my paypal email is xfriedcod@gmail.com, thank you.\r\n________________\r\n\r\nYou need to keep the Schematic drawings in your inventory to make the items at a forge anvil, you also need the Dwarven Smithing perk.\r\nTo build Dwemer Automatons;\r\n\r\nSpider bots, Sphere bots, and Centurions, you have to collect various dwemer parts;\r\n\r\n    * 2 gears, 2 cogs, 2 gyros, a lever, and a small lever make a \\\"Automaton Mechanism\\\" \r\n\r\n    * Spider Automatons take 8 Dwarven ingots, 3 Dwarven Oil, and 1 Automaton Mechanism to make, you get 2 \\\"scrolls\\\" (metal cube) that last 10 minutes. \r\n\r\n    * Sphere Automatons take 14 ingots, 5 Oil, and 2 Mechanisms, and you get the same yield. \r\n\r\n    * Centurions take 24 ingots, 1 Centurion Dynamo Core, 10 Oil, and 3 Mechanisms for the same yield of 2 \\\"scrolls\\\" that last 10 minutes each. \r\n\r\nThe \\\"Activators\\\" are listed in your inventory under \\'scrolls\\' .. as they are a mod of the summon atronach scrolls, but lets imagine we are building the robots and they have a limited battery life or something like that :D .... (im actually looking into a different method... but i wanted to get this out there for people to enjoy... so ill likely make a new version soon)\r\nDwemer Shurikens aka Throwing Stars\r\n\r\n... normal ones, Fire, Frost, and Shock enchanted varieties. The shurikens are listed in your inventory under \\\"scrolls\\\" as I used the magic system to create them, but your magic skills do not effect their power, instead at level 17, 34, and 49 new ones you make will be more powerful.\r\n\r\n    * Takes 3 Dwarven metal ingots to make 10 Shurikens, and plus 1 fire salts, frost salts, or void salts for the enchanted varieties. \r\n\r\n3 versions of the mod to choose from,\r\n\r\nto fit your tastes. Load only ONE .esp / only put ONE .esp in your Data folder.\r\n\r\n    * There is the more hardcore \\\"cao_DweSchematicsSearch.esp\\\" (The way i intended the mod to be) Clagius Caro sells a few basic shurikens, and a couple spider bot activators, (so u can enjoy them) as he has dedicated his life to studying the Dwemer, and smithing. Otherwise you must search Dwemer ruins to find the schematics... as true to \\'reality\\' these are long lost documents no one even really knows they exist, so there is no clues as to where they are located. \r\n\r\n    * More reasonable I suppose is \\\"cao_DweSchematicsBuy.esp\\\" Clagius Caro sells all the Shurikens, and Schematics and some Automaton Mechanisms. The Schematics are still hidden in their normal places, so when you are adventuring and happen upon one, you can say \\\"oh hey thats cool\\\" :D \r\n\r\n    * Then there is cheat version \\\"cao_DweSchematicsCheat.esp\\\" Clagius Caro sells all the Shurikens, and some Automaton Mechanisms. theres a \\\"cheat\\\" barrel near a tree between the forge and his dwemer table filled with all the Schematics and plenty of materials to get you a nice amount of the new goodies. Also, you do not need the Dwarven Smithing perk to create any of the items. And heck, why not... The Schematics are still hidden in their normal places too. \r\n\r\nHOW TO INSTALL\r\n\r\nuse Curse Client http://www.curse.com/client\r\n\r\nor\r\n\r\nchoose either \\\"cao_DweSchematicsSearch.esp\\\" , \\\"cao_DweSchematicsBuy.esp\\\" , or \\\"cao_DweSchematicsCheat.esp\\\" USE ONLY ONE! put it into Skyrim DATA folder also place the meshes and textures folders in Skyrim Data folder.\r\n\r\nin the launcher tick the checkbox.\r\n\r\n    * Data Files grayed out? \r\n\r\nGo to: Drive Letter:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Skyrim\\\\SkyrimPrefs.ini\r\n\r\nFor those who don\\'t have bought the game on steam, the SkyrimPrefs.ini file is located in Drive Letter:\\\\Users\\\\<USERNAME>\\\\Documents\\\\My Games\\\\Skyrim\r\n\r\nAdd these lines, or change them if they already exist so they match the below: [Launcher] bEnableFileSelection=1\r\n\r\nIf that fails: Go to: Drive Letter:\\\\Users\\\\[USERNAME]\\\\AppData\\\\Local\\\\Skyrim Make the Skyrim folder un-read only.",
  "categoryId": "27",
  "version": "1",
  "author": "CaoMengde777",
  "createdUnix": "1328810096",
  "updatedUnix": "1328810512",
  "containsAdultContent": false,
  "uploadedBy": "CaoMengde777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27852",
      "name": "Caos Automatons and Shurikens",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8043",
      "fileName": "Caos Automatons and Shurikens-8522-1.zip",
      "uploadedUnix": "1328810512",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/885eaabb843416c9b66be2a67154be7c22de7461f431c7665210382444615dbc/analysis/1406664550/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Caos%20Automatons%20and%20Shurikens-8522-1.zip?fid=27852&ttl=1535767310&ri=8192&rs=8192&setec=228ea4618ad0cd3a8ee770f46bd9d08b"
    }
  ]
}