{
  "modId": 8523.0,
  "modName": "Caos Inventory Packs aka Bags of Holding",
  "summary": "This mod adds 2 Satchels and 2 Knapsacks that increase your carry capacity.\r\n\r\n2 are to be purchased (or stolen) from Emelia Valerius a female merchant in Riften, she hangs out by two benches between the marketplace and the castle of Riften.\r\n\r\n2 black leather variants are hidden, to be found with hidden treasure maps.",
  "descriptionHtml": "WTF?? why cant i let people comment on this mod? this is skyrimnexus glitch??, sorry people.\r\n\r\nCao\\'s Inventory Packs aka Bags of Holding\r\n\r\nNEW Version fixes map images not showing... the \\\"interface\\\" folder from this mod should be placed inside \\\"textures\\\" folder. not by itself outside of the folder. .... sorry for inconvenience those that already downloaded this.\r\n\r\nThis mod adds 2 Satchels and 2 Knapsacks that increase your carry capacity.\r\n\r\n2 are to be purchased (or stolen) from Emelia Valerius a female merchant in Riften, she hangs out by two benches between the marketplace and the castle of Riften.\r\n\r\n2 black leather variants are hidden, to be found with hidden treasure maps.\r\n\r\nHint,\r\n\r\nif you cannot afford the packs from Emelia Valerius, see what items she gives away for free! ... (well, 1 gold)\r\n_________________\r\n\r\nIf you could donate, it would be great, I spent many hours before the creation kit was released to create this mod, my paypal email is xfriedcod@gmail.com thank you.\r\n_________________\r\n\r\nIt seems Iam unable to set the price of the packs, they are incredibly expensive, the game sets the price according to the powerfulness of the items enchantments... ...\r\n\r\nthe 2 black leather packs can be found for free, but takes some effort... I hope the maps are pretty easy to follow. :D\r\n\r\nThe packs do NOT show up on your character, you equip them in your apparel tab of your inventory. As long as they are equipped, they give you the bonus, you can equip all 4 at the same time for a total bonus of 440 extra carry capacity. The packs don\\'t take up any equipment slot.\r\nHOW TO INSTALL\r\n\r\nuse Curse Client http://www.curse.com/client\r\n\r\nor\r\n\r\nPlace \\\"cao_InventoryPacks.esp\\\" into Skyrim DATA folder also place the folders \\\"interface\\\" \\\"meshes\\\" and \\\"textures\\\" into DATA folder aswell.\r\n\r\nin the launcher tick the checkbox.\r\n\r\n    * Data Files grayed out? \r\n\r\nGo to: Drive Letter:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Skyrim\\\\SkyrimPrefs.ini\r\n\r\nFor those who don\\'t have bought the game on steam, the SkyrimPrefs.ini file is located in Drive Letter:\\\\Users\\\\<USERNAME>\\\\Documents\\\\My Games\\\\Skyrim\r\n\r\nAdd these lines, or change them if they already exist so they match the below: [Launcher] bEnableFileSelection=1\r\n\r\nIf that fails: Go to: Drive Letter:\\\\Users\\\\[USERNAME]\\\\AppData\\\\Local\\\\Skyrim Make the Skyrim folder un-read only.",
  "categoryId": "27",
  "version": "1.1",
  "author": "CaoMengde777",
  "createdUnix": "1328811002",
  "updatedUnix": "1328826474",
  "containsAdultContent": false,
  "uploadedBy": "CaoMengde777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27996",
      "name": "Cao Inventory Packs",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1732",
      "fileName": "Cao Inventory Packs-8523-1-1.zip",
      "uploadedUnix": "1328826474",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b95ad347179ed3c2f0a405f542274b03f08b010f09e06d7d17e44acaae784f28/analysis/1406665270/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cao%20Inventory%20Packs-8523-1-1.zip?fid=27996&ttl=1535767311&ri=8192&rs=8192&setec=9e704a3a917feffb6957f5a64c659572"
    }
  ]
}