{
  "modId": 8527.0,
  "modName": "Caos Tools -ninjaWeps -spells -DweRocketLauncher",
  "summary": "This mod adds 3 merchants, one in the companion\\'s Jorrvaskr, one in the thieves guild tavern The Ragged Flagon and one in the College of Winterhold Arcanaeum.\r\nthey sell Tools of the Trade, and new spells, new assassin weapons, dwemer rocket launcher",
  "descriptionHtml": "Cao\\'s Tools of the Trade + new spells v0.8\r\nFeaturing: Dwemer Rocket Launcher\r\n\r\nPre-Quest BUY VERSION\r\n\r\nI have yet to fix some things with the quest, but I wanted to release this as it is, as it is cool stuff :D quest coming very soon. \r\n\r\n____\r\n\r\nThis mod adds 3 merchants, one in the companion\\'s Jorrvaskr, one in the thieves guild tavern The Ragged Flagon and one in the College of Winterhold Arcanaeum.\r\n\r\nthe merchants sell items that you equip in the aparrel tab, the items do not take up an equipment slot, and you can equip all of them at once. Each item gives a 5% bonus to the skill they are associated with.\r\n\r\nthey are all pretty expensive items (1500 -3500 gold) the purpose being to balance the fact that all the bonuses are cumulative, also, to add the fun of having something you are saving gold for... Collect them all!\r\n________________\r\n\r\nIf you could donate, it would be great, I spent many hours before the creation kit was released to create this mod, my paypal email is xfriedcod@gmail.com , thank you\r\n________________\r\nThrowing weapons are found in the \\\"Scrolls\\\" tab in the inventory.\r\n\r\nThe Thieves guild merchant \\\"Dar\\'Vassa\\\" sells these new throwing items, also tools related to thieves skills.\r\n\r\n    * Assassin\\'s Needle - throwing dart, so small people won\\'t notice they\\'ve been hit with it (doesn\\'t make them hostile towards you or give bounty), 1 damage for 300 secs, almost guaranteed to kill, but you have to wait for it, a fun assassin\\'s tool. \r\n\r\n    * Stalker\\'s Needle - throwing dart, just like the other one people won\\'t notice they\\'ve been hit, paralyzes people for a little while. \r\n\r\n    * Incendiary Bomb - like a molotov, a ceramic jar full of flammable liquid that ignites when the jar breaks. \r\n\r\n    * Knock-out Bomb - throw it and it makes a cloud of gas that paralyzes targets. \r\n\r\nThe Mages College merchant \\\"Barnand\\\" sells these new spells, and mage skill tools.\r\n\r\n    * Fling Dagger - conjuration attack spell, conjures a daedric dagger that flys at the target. \r\n\r\n    * Fling Sword - conjures a daedric sword that flys at the target. \r\n\r\n    * Fling Greatsword - conjures a daedric greatsword that flys at the target \r\n\r\n    * Inflict Wounds (also Greater, and Major) - a destruction touch spell, you need to touch the enemy, but it does a decent amount of damage constantly, also slows the enemy down so they dont move too much away from you, so you can keep touching them. \r\n\r\n    * Razor Assault - conjuration attack spell, conjures darts to fly at the target. \r\n\r\n    * Fling Rocket - conjures a dwemer rocket to fly at target. \r\n\r\n    * Wizard Light - an upgrade of the magelight spell, 1 more light intensity, lasts for 3 minutes, instead of 1 \r\n\r\n    * Inflame - destruction spell, lights a area of ground on fire, has a limited range. \r\n\r\n    * Engulf - destruction spell, just like inflame, but not limited range, but has slightly less area of effect \r\n\r\nThe Companions guild merchant \\\"Hagard\\\" sells tools associated with fighter skills. in the cheat version he also sells the\r\n\r\n    * Dwemer Rocket Launcher - fires rockets.\r\n    * Dwemer Rockets - soulgems that look like a rocket, recharge the rocket launcher, you could use normal soulgems too. \r\n\r\n+ HOW TO INSTALL +\r\n\r\nuse Curse Client http://www.curse.com/client\r\n\r\nor\r\n\r\nPlace \\\"cao_ToolsMerchantsBuyRL.esp\\\" into Skyrim DATA folder also place the folders \\\"meshes\\\" and \\\"textures\\\" into DATA folder aswell.\r\n\r\nin the launcher tick the checkbox.\r\n\r\n    * Data Files grayed out? \r\n\r\nGo to: Drive Letter:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Skyrim\\\\SkyrimPrefs.ini\r\n\r\nFor those who don\\'t have bought the game on steam, the SkyrimPrefs.ini file is located in Drive Letter:\\\\Users\\\\<USERNAME>\\\\Documents\\\\My Games\\\\Skyrim\r\n\r\nAdd these lines, or change them if they already exist so they match the below: [Launcher] bEnableFileSelection=1\r\n\r\nIf that fails: Go to: Drive Letter:\\\\Users\\\\[USERNAME]\\\\AppData\\\\Local\\\\Skyrim Make the Skyrim folder un-read only.",
  "categoryId": "27",
  "version": "1",
  "author": "CaoMengde777",
  "createdUnix": "1328812819",
  "updatedUnix": "1328812929",
  "containsAdultContent": false,
  "uploadedBy": "CaoMengde777",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27871",
      "name": "Caos Tools -ninjaWeps -spells -RocketLauncher",
      "version": "0.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2501",
      "fileName": "Caos Tools -ninjaWeps -spells -RocketLauncher-8527-0-8.zip",
      "uploadedUnix": "1328812929",
      "modVersion": "0.8",
      "virusScanUrl": "https://www.virustotal.com/file/85ab083cec89de27edcc3c80c612a4322745aae5b00e2b240d6a2c64c63bb95a/analysis/1406664604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Caos%20Tools%20-ninjaWeps%20-spells%20-RocketLauncher-8527-0-8.zip?fid=27871&ttl=1535767316&ri=8192&rs=8192&setec=c6d05af87d2bbc2ce7ce762f1112e673"
    }
  ]
}