{
  "modId": 85309.0,
  "modName": "Rapid Fire Vampiric Drain For Vampire Lord",
  "summary": "",
  "descriptionHtml": "This mod removes the charge time for the Vampire Lord version of the Vampiric Drain spell, the red ball of doom they shoot from their right hand. \r<br />\r<br />To maximize fire rate of said ball of doom, press the fire button as soon as the spell leaves your hand...err...claw...thing. This is because the animation of the Vampire Lord still has to go through the animation of holding up their hand and moving it forward. This mod simply makes it so you skip the charging portion of the animation. The Spell can still be held as long as possible if you want to line up a shot. IMPORTANT mashing the fire button will constantly reset the animation back to the hand raising part instead of firing the spell. I was not kidding when I said wait for the projectile to be fired before pressing the fire button. \r<br />\r<br />This is my first ever mod so let me know if you run into any problems using it. Anyone is free to use this mod as they see fit. I made it for my personal use and only uploaded because I wanted to  contribute. \r<br />\r<br />[u]Installation and uninstallation\r<br />[/u]Copy the data folder to your Skyrim folder (the one with the launcher in it) usually found at C:&#92;Program Files (x86)&#92;Steam&#92;steamapps&#92;common&#92;Skyrim or use the Nexus Mod Manager or Mod Organizer. Remove the RapidFireVampiricDrain.esp file from your data folder to uninstall the mod or use the Nexus Mod Manager&#39;s or Mod Organizer&#39;s uninstall function. This is a small mod and is safe to install/remove in the middle of a playthrough.\r<br />[u]\r<br />Compatibility[/u]\r<br />This mod edits only the Vampire Lord&#39;s version of the Vampiric Drain spell so any mod editing this spell will not be compatible. Placing this mod last in the load order will overwrite any changes other mods make to the Vampiric Drain spell e.g The Vampiric Drain in [url=http://www.nexusmods.com/skyrim/mods/29731/?]BtyoP&#39;s Vampire Overlord[/url] will not be stronger or have faster projectiles, only the faster casting of my mod. All changes to the other Vampire Lord spells will work as normal.",
  "categoryId": "75",
  "version": "1.0",
  "author": "noforksgiven",
  "createdUnix": "1500000533",
  "updatedUnix": "1500000516",
  "containsAdultContent": false,
  "uploadedBy": "noforksgiven",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000249354",
      "name": "Rapid Fire Vampiric Drain For Vampire Lords",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Rapid Fire Vampiric Drain For Vampire Lords-85309-1-0.zip",
      "uploadedUnix": "1500000516",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/7385a41caf28247314105319b6c6b13369b9d20115e37a26e3b587b0338d3eac/analysis/1500000782/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rapid%20Fire%20Vampiric%20Drain%20For%20Vampire%20Lords-85309-1-0.zip?fid=1000249354&ttl=1535874137&ri=8192&rs=8192&setec=921256dbb5661580b35a9d7a41c0f44c"
    }
  ]
}