{
  "modId": 85363.0,
  "modName": "Requiem - Bestial Stew for Night Crawlers",
  "summary": "A simple tweak that allows werewolves, vampires and those in possession of the Ring of Namira to consume the Requiem food item Bestial Stew and receive its buffs.",
  "descriptionHtml": "                                                 [img]http://i.imgur.com/VVIbSTJ.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />[img]http://i.imgur.com/pC1WHCj.png[/img]\r<br />[size=2][font=Verdana] Have you ever wondered why creatures that are supposed to be feral and intimidating can&#39;t handle a little salmon, wolf heart, and some meat bathed with some lovely boiled milk blissfully cooked over a fire?\r<br />   Well, you&#39;ve come to the right place&#33; Bestial Stew for Night Crawlers is the mod for you&#33; With this simple tweak, all creatures of the  night can indulge themselves in the act of consuming one of the best food buffs in Requiem, just like they should have been able to from  the start&#33; \r<br />   But wait... there&#39;s more&#33; Are you familiar with the taste of human flesh yet lack any fangs, claws, glowing eyes and/or a thick layer of  fur from head to toe? Well BS4NC is for you as well&#33; If you are part of a cannibalistic cult and possess the Ring of Namira, then you can  also be given the chance to vary your meal plan once in a while, you sick bastard&#33;[/font][/size]\r<br />\r<br />\r<br />[img]http://i.imgur.com/Kn7p0x9.png[/img]\r<br />[font=Verdana] It adds an exception in the Bestial Stew conditions tab to also include the keyword ActorTypeUndead, being in possession of the Beast  Form power and/or having the Ring of Namira in the inventory in addition to the typical Strong Stomach keyword. This means that if your  PC meets any one of these conditions he should be able to consume the Stew without receiving the penalties and obviously gain its buffs.     It will also give the Strong Stomach keyword to the Vampire Race.[/font]\r<br />\r<br />\r<br />[img]http://i.imgur.com/D8Rl0hM.png[/img]\r<br /> [font=Verdana]Simply put the [i]Requiem - Bestial Stew for Night Crawlers.esp [/i]in the Data folder as you would any other mod, placing it under Requiem in the load order.\r<br />[/font]\r<br />\r<br />\r<br />\r<br />\r<br />[size=1]This mod is a light weight tweak to fulfill my immersion needs, therefore it has a very slim chance of causing bugs, in any case, if you come across any make sure to let me know so I can fix them asap.[/size]",
  "categoryId": "78",
  "version": "1.0",
  "author": "Krytsuz",
  "createdUnix": "1500224177",
  "updatedUnix": "1500223683",
  "containsAdultContent": false,
  "uploadedBy": "Krytsuz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000249592",
      "name": "Requiem - Bestial Stew for Night Crawlers",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "Requiem - Bestial Stew Tweak-85363-1-0.7z",
      "uploadedUnix": "1500223683",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/70867bfc6e77696f3962e2a009c016bcd079a9de034e1d1077515fcd42449e3f/analysis/1500223924/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Bestial%20Stew%20Tweak-85363-1-0.7z?fid=1000249592&ttl=1535874190&ri=8192&rs=8192&setec=beaa3d5bfdbe2b3a5d840804039028d1"
    }
  ]
}