{
  "modId": 85367.0,
  "modName": "A Place to Rest Their Heads",
  "summary": "small sleeping arrangements for homeless orfans",
  "descriptionHtml": "Something that saddened me to no end about the Hearthfire kids is that, at the end of the day, they&#39;re all sleeping on the dirty earth or the dirty floor. Three of them are completely exposed to the elements, and they don&#39;t really have any posessions. And I can&#39;t always immediately adopt them all, because sometimes I&#39;m off doing other quest related things and can&#39;t afford the proper house upgrades or run a decent housemod.\r<br />\r<br />So, this mod just does something simple - gives the four orphans added by Hearthfire semi-safe places to sleep and a few wee things. With the exception of Alesan (who sleeps inside of a building, and likely has a couple of adults around at all times) the children have all been given a dagger for &#39;protection&#39;. The items are marked as owned by them, and taking them will mean stealing (but really, what kind of person steals from an orphaned child? ;-; )\r<br />\r<br />[center][size=3]Changes are as follows:[/size][/center]\r<br />\r<br />[list=1]\r<br />[*][size=2]Lucia now sleeps near the front gate of Whiterun, in the little alcove on the left side. She has a bedroll, a lantern, a dolly, a book, a basket with some food and a pretty plant to keep her company.[/size]\r<br />\r<br />[*][size=2]Sofie still sleeps in front of Niranye&#39;s house, but now she has a tent to cover her and a wooden plank to keep her bedroll off the ground. She has a plate with food on it, a cup, a dolly and a candle. [/size]\r<br />\r<br />[*][size=2]Blaise still sleeps in the same area, but now has some planks to support him from the cold hard ground. He also has a lantern, and a little more food than the two girls due to being on a farm; barrels have been rearranged for his privacy. Additionally, his dagger is a scaled down Imperial sword, since both his parents were Imperial soldiers.[/size]\r<br />\r<br />[*][size=2]Alesan still sleeps inside of the inn, but he now has a bedroll to sleep on. He has more physical possessions than the other three do since he also likely has the safest place to sleep, and like Blaise has some barrels set up for privacy. He has a toy wooden sword instead of a dagger.[/size]\r<br />\r<br />[/list]\r<br />\r<br />Note there are some minor oddities; namely, Blaise doesn&#39;t look like he&#39;s properly lying on his bedroll and food might spill out of containers or load under them (such as Lucia&#39;s cheese and such loading under her basket - this didn&#39;t happen to me the first time checking, but it did the second time, so /shrugs). I&#39;m sorry about that. I don&#39;t think it&#39;s too much, though.\r<br />\r<br />To install, use your favorite mod manager of choice to load it up. I&#39;m guessing load order doesn&#39;t matter, but feel free to correct me if I&#39;m wrong.\r<br />\r<br />I would suggest using this with [url=http://www.nexusmods.com/skyrim/mods/52612/?]Real Shelter[/url] for a better sheltered experience. It is massively easy to set up and makes the covered/sheltered sleeping arrangements actually work, dangit. I would also suggest the mod [url=http://www.nexusmods.com/skyrim/mods/85282/?]Toymania[/url] once you have adopted [url=http://www.nexusmods.com/skyrim/mods/29249/?]all four of them[/url] so they can be spoiled with nice cool new toys (like [i]stuffed bunnies[/i]&#33;)\r<br />\r<br />And because I forgot when I first uploaded this - lots of hugs + kisses + thanks to my ever beautiful friends [b][url=http://www.nexusmods.com/games/users/22747194/?]Femshepping[/url][/b] and [url=http://www.nexusmods.com/games/users/25192814/?][b]Magpiedragon[/b][/url]. Both encouraged me to make this, both encouraged me to post this and femshepping offered a lot of comforting words wrt my anxiety about using the Creation Kit.\r<br />\r<br />[center][size=3]Permissions/etc[/size][/center]\r<br />\r<br />I don&#39;t use any major worldspace altering mods, so I&#39;m not sure how compatible this is with anything that edits Whiterun, the Dawnstar Inn, Windhelm or Katla&#39;s Farm. This mod also contains completely vanilla assets, so your things might look different from the screencaps. At any rate, you&#39;re free to take this mod and republish it on other Skyrim mod sites, translate it if need be? I don&#39;t think it would need it but w/e; you&#39;re free to include it in any overhaul mods that you like (if anyone is even still doing those for this version of Skyrim). I don&#39;t have SE installed but if you really want it there, anyone is free to port it and publish it however they like. All I ask is a lil credit; I really don&#39;t mind what you do with this mod.\r<br />\r<br />[size=1]geez i can&#39;t believe it. this is my first creation kit mod. pls be gentle. [i]why doesn&#39;t this font go tinier.[/i][/size]",
  "categoryId": "99",
  "version": "1",
  "author": "Atlas",
  "createdUnix": "1500230292",
  "updatedUnix": "1500300595",
  "containsAdultContent": false,
  "uploadedBy": "vaelsmod",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000249599",
      "name": "A Place To Rest Their Heads",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54",
      "fileName": "A Place To Rest Their Heads-85367-1.zip",
      "uploadedUnix": "1500230234",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/fd346f1d83f7812d35d719b59df366bd179a3f37d9c1e109b0434b59f1887564/analysis/1500230313/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Place%20To%20Rest%20Their%20Heads-85367-1.zip?fid=1000249599&ttl=1535874198&ri=8192&rs=8192&setec=d93d0529055b3b11a7938b01c0e08eae"
    },
    {
      "fileId": "1000249657",
      "name": "APTRTH - Adjusted Lucia",
      "version": "0.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "48",
      "fileName": "APTRTH - Adjusted Lucia-85367-0-2.zip",
      "uploadedUnix": "1500300595",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/4ab92ef25f6c0a13fac7d5cb7e40e20dc6b568562d987019633f0856c7b73b26/analysis/1500300842/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/APTRTH%20-%20Adjusted%20Lucia-85367-0-2.zip?fid=1000249657&ttl=1535874198&ri=8192&rs=8192&setec=62208694cd2c42ddca3288f75bbc67fd"
    }
  ]
}