{
  "modId": 85374.0,
  "modName": "Hrothgar Sanctum - A Lore Friendly Player Home for High Hrothgar",
  "summary": "A mod that finally adds a proper private area for the Dragonborn in High Hrothgar, giving the player a modest but visually dazzling and immersive lore-significant home.",
  "descriptionHtml": "I&#39;m amazed I managed to hammer this thing out this quickly.\r<br />\r<br />Hrothgar Sanctum consists of a brand new player home designed to fill some major voids in the existing slew of homes available for download. While there are lots of stunning locations here on the Nexus for your character to call home, even the best fall into some common sticking points:\r<br />\r<br />[list]\r<br />[*]Ridiculously grandiose or lavish to the point of probably exceeding Skyrim&#39;s GDP if someone just tried to build the exterior\r<br />[/list][list]\r<br />[*]Inappropriately or excessively decorated with bells and whistles, to the point of feeling like it&#39;s not even part of the rest of Skyrim\r<br />[*]Basically a glorified photo set for barbie doll-esque characters to take screencaps in\r<br />[/list]\r<br />This mod represents an attempt to escape from these pitfalls and attempt to create a lore-friendly place for the Dragonborn to call home that not only feels like an organic extension of its environment, but also contains the creature comforts one would expect and want out of such a location. It also represents an incredibly frustrating attempt to use the High Hrothgar static pieces to build a new environment, which was pure hell since it&#39;s basically just one big set piece chopped up into bits. (Seriously, how was anybody supposed to use it to build [i]anything [/i]that wasn&#39;t a direct copy of the existing architecture with no loose ceiling or floor tiles??) \r<br />\r<br />Besides being practically designed with utility in mind, I also wanted to make it visually alluring and a location you look forward to visiting. I focused heavily on creating atmospheric lighting that makes the entire area comforting to simply be in and relax you. Similarly, the shrine in the middle of the room is a huge and attractive centerpiece that greets you every time you enter with its impressive size and character. For immersion, the rug in front of the shrine really lets you meditate&#33; Simultaneously, the space is meant to seem like something you&#39;d easily find in the vanilla game set aside for the player character.\r<br />\r<br />Hrothgar Sanctum was designed for characters who focus on their role as the Last Dragonborn: the Sanctum is an inner chamber of High Hrothgar where the greatest tongues and Dragonborn before them have meditated within the very heart of Snow Throat upon the mysteries of Kyne, Akatosh, and Talos. It has also become a refuge for such titanic individuals, and has been dormant for centuries. Now, the Dragonborn may take residence within the mountain and contemplate the Voice in its hallowed hall. Whispers speak that the Greybeards protect the very Cave of Shor himself, rebuilt as a Shrine to the winds and a private chamber of the Dragonblooded - but who can say for certain?\r<br />\r<br />If you&#39;re looking for an immersive retreat for your character that appeals to their nature as a Dragonborn and the solitary comfort of High Hrothgar&#39;s aesthetic, give this mod a try. This is my first endeavor into Skyrim modding, so any feedback is appreciated. If there are any major issues expect infrequent updates, but I don&#39;t expect there to be any real problems with something so simple.",
  "categoryId": "67",
  "version": "1.0",
  "author": "ElAhrairaha",
  "createdUnix": "1500252827",
  "updatedUnix": "1500251543",
  "containsAdultContent": false,
  "uploadedBy": "ElAhrairaha",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000249631",
      "name": "Hrothgar Sanctum",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "70",
      "fileName": "Hrothgar Sanctum-85374-1-0.zip",
      "uploadedUnix": "1500251543",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9538b10edba07e957d2f7a0fe4fcea2e4799f915a986da58e778ac7f3b711742/analysis/1500251882/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hrothgar%20Sanctum-85374-1-0.zip?fid=1000249631&ttl=1535874204&ri=8192&rs=8192&setec=84f422c8698c424730c8b324aa9c7110"
    }
  ]
}