{
  "modId": 85381.0,
  "modName": "Tasheni Followers - one for all and all for one - fully custom voiced and standalone",
  "summary": "This is a WIP.  Six individual fully custom voiced standalone followers and their horses. Individual behavior in different locations, looting, healing, training, singing. Including Player horse that carries your stuff and cares about your orders,  and a Farm that will become playerhome through quest in future releases.",
  "descriptionHtml": "[color=#ff7700]\n<br />[size=3]\n<br />[/size][/color][font=Verdana][color=#ff7700][size=3]This is a WIP in [color=#ffffff][b]beta[/b][/color] state. Please read the description carefully and the [color=#ffffff]manual in the article section. It explains how they work and troubleshooting - they are very different from vanilla followers[/color].[/size][/color][/font][size=3]\n<br />\n<br />[center][youtube]ippkknwMwNo[/youtube][url=https://www.youtube.com/watch?v=ippkknwMwNo]\n<br />[/url][/center]               Trailer made by Tasheni. Music: The Giant's Song written by Tasheni, reworked, arranged, composed \n<br />               and programmed by the great talented SunSpire from [url=https://sunspire.audio/]SunSpire Records\n<br />[/url][/size][font=Arial, sans-serif][color=#efefef][size=2]   ﻿   ﻿   ﻿   ﻿   ﻿The banner shows how the followers now look like. In the trailer you see the old version.[/size][/color][/font][color=#efefef]\n<br />\n<br />[color=#ff7700]Version 0-4-1 is a minor update.[/color] Script for monitoring player mounting is included now, added some missing soundfiles and a missing texture. Reworked combat dialogue again. Now followers DO act as a team. Make a save before updating, uninstall previous version and install new version.\n<br />\n<br />[color=#ff7700]Please notice:[/color] I found an issue that is not a bug but pretty annoying: If you accidental mount a follower horse, the follower will immediately leave you and you can't talk to them or do anything. I will fix that with the next update. Please do save frequently.\n<br />\n<br />[font=Arial, sans-serif][size=3][color=#ff7700]Version 0-4-0 beta is a big update![/color] Best is you have not started the mainquest and mages questline. If you did already, it will work, but you will miss some dialogue or maybe some lines will sound weird.[/size][/font][font=Arial, sans-serif][size=3] Before updating: Take out all the things of the inventories you want to keep. Let the followers and horses wait. Leave the cell. Save. Uninstall previous version and install the new. Don't install loose files in your Skyrim Data folder![/size][/font]\n<br />\n<br />[font=Arial, sans-serif][color=#ff7700][size=3]Important: Read this description! [/size][/color][/font][size=3]\n<br />[font=Arial, sans-serif]This mod is not a lightweight anymore but uses mostly short running script fragments. I tried to avoid scripts as much as possible. On a weak machine you will have problems. I have a weak processor, 1GB VRAM and 16GB RAM. It works, but with heavy modded Skyrim I have issues.\n<br />Before installing this mod make a save so you can rollback to in case you want to uninstall. Otherwise you will get problems. [/font][b][font=Arial, sans-serif]Install with MO or NMM . I don't recommend to uninstall midgame. Go back to a save before you have installed the mod.[/font][/b][font=Arial, sans-serif]\n<br />Put the esp as near as the bottom of your load order as possible.\n<br />\n<br />[color=#ff7700]Please report bugs – I have not the ability to test much and can't do anything if I don't know what bugs occured. Mod works for me but perhaps not for you.[/color][/font]\n<br />[font=Arial, sans-serif]\n<br />This is a standalone mod dependent only on \n<br />Skyrim.esm\n<br />Not needed but highly recommended:[/font]\n<br /> [url=http://www.nexusmods.com/skyrim/mods/75951/?][font=Arial, sans-serif][u]FixLipSync[/u][/font][/url][font=Arial, sans-serif]\n<br />An alternate start mod of your choice.[/font]\n<br />[font=Arial, sans-serif]\n<br />May I introduce to you[/font]\n<br />[/size][/color][list]\n<br />[*][font=Arial, sans-serif][color=#efefef][size=3]Sherda Akkadim, chronist, the Breton from Cyrodiil [/size][/color][/font][color=#efefef][size=3]   [/size][/color]\n<br />[color=#efefef][size=3]   \n<br />[/size][/color][*][font=Arial, sans-serif][color=#efefef][size=3]Tomalik'r Torquesson, the farmer Redguard from Hammerfell [/size][/color][/font][color=#efefef][size=3]   [/size][/color]\n<br />[color=#efefef][size=3]   \n<br />[/size][/color][*][font=Arial, sans-serif][color=#efefef][size=3]Chiomara Northwind, smithing witch and pure Nord [/size][/color][/font][color=#efefef][size=3]   [/size][/color]\n<br />[color=#efefef][size=3]   \n<br />[/size][/color][*][font=Arial, sans-serif][color=#efefef][size=3]Ramgar of Stony Creek, true Nord, scout and hunter [/size][/color][/font][color=#efefef][size=3]   [/size][/color]\n<br />[color=#efefef][size=3]   \n<br />[/size][/color][*][font=Arial, sans-serif][color=#efefef][size=3]Ruby Trevelyen, Imperial of Cyrodiil and agent [/size][/color][/font][color=#efefef][size=3]   [/size][/color]\n<br />[color=#efefef][size=3]   \n<br />[/size][/color][*][font=Arial, sans-serif][color=#efefef][size=3]Eldrid Firerider, Barmaiden in Whiterun, Breton witch.[/size][/color][/font]\n<br />[color=#efefef][size=3]   \n<br />[/size][/color][*][font=Arial, sans-serif][color=#efefef][size=3]Playerhorse Vala. If you play alternate start mods you have to search for her a[/size][/color][/font][font=Arial, sans-serif][color=#efefef][size=3]nd do a little fight if you want to achieve her. If you play Helgen[/size][/color][/font][font=Arial, sans-serif][color=#efefef][size=3] Intro she's available after you are out of the dungeon.[/size][/color][/font]\n<br />[font=Arial, sans-serif][color=#ff7700][size=3]\n<br />They are designed to play together. You will get most out of them if you take all six with you! [/size][/color][/font][color=#efefef][size=3]   [/size][/color][/list]\n<br />[font=Arial, sans-serif][color=#ff7700][size=3]Followers features: \n<br />N[/size][/color][/font][color=#ff7700][font=Arial, sans-serif][size=3]ew[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3]: altogether 2000 lines of dialogue excluding player dialogue. Most [/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3]dialogue runs at inns or player home. It will also fire in new worldspaces but then you will possibly have the lines all at once :)[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3][color=#ff7700]New: [/color]Followers act together in combat, experienced through dialogue. You will have the impression that they care for another and, of course, the player (experimental)[/size][/font][/color]\n<br />\n<br />[color=#ff7700][font=Arial, sans-serif][size=3]New:[/size][/font][/color][color=#f4f4f4][font=Arial, sans-serif][size=3] al[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3]together 42 banter scenes. Some are between Eldrid and the inhabitants of Whiterun before you recruit Eldrid. Many scenes will reveal their stories and future questlines[/size][/font][/color]\n<br />\n<br />[color=#ff7700][font=Arial, sans-serif][size=3]New:[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3] You can trigger banter scenes if you unequip all weapons and spells[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3](experimental). Great if you play in new world spaces\n<br />[/size][/font][/color]\n<br />[color=#ff7700][font=Arial, sans-serif][size=3]New:[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3] Two short quests with Rikja the Huntress and given from Raganhar of Stony Creek[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3][color=#ff7700]New: [/color]Ramgar's parents are now fully voiced.[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3][color=#ff7700]New: [/color]Individual armor and rings, some wearable on the left hand.[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Change clothes in player home and back to armor when outside. Different clothes in a week, split in two days, three days and weekends\n<br />[/size][/font][/color]\n<br />[color=#efefef][font=Arial, sans-serif][size=3][color=#ff7700]New:[/color] Horses have now winter fur and individual saddles[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Different sandbox packages for different locations like inn, playerhome, shop, if player is in furniture state[/size][/font][/color]\n<br />\n<br />[color=#ff7700][font=Arial, sans-serif][size=3]New:[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3] They start sandboxing if you unequip weapons and spells. Now you can let them sandbox everywhere! Cool for new worldspaces that have not the appropriate keywords set.[/size][/font][/color]\n<br />\n<br />[color=#ff7700][font=Arial, sans-serif][size=3]New:[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3] An option through dialogue with Chiomara that let all followers loot at clearable locations (experimental). Talk to her again to stop looting[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3][color=#ff7700]New:[/color] Eldrid and Chiomara can cast a light on the player that lasts for a whole day. It turns off if player starts sneaking or through\n<br />dialogue.[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Chiomara and Eldrid can heal the player or the whole party during combat[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Chiomara can collect things for you[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Chiomara and Eldrid will train magic if player sits outside in a camp or other clearable location. They train for an hour each themselves before midday and together in the afternoon. Only once per day[/size][/font][/color][color=#efefef][font=Arial, sans-serif][size=3]\n<br />\n<br />Tom and Ruby train melee if player sits outside in a clearable location, at afternoon for an hour. Only once per day.[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Ramgar can lead the player to 22 different locations[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Sherda sings or plays for you at home or in some other locations if you wish – just unequip the weapons and spells, than the dialogue is available.[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3][color=#ff7700]New: [/color]Sherda plays instrumental alone or together with Eldrid[/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]Fast mount and dismount through a script – that doesn't work if you play vanilla intro without an alternate start mod! [color=#ff7700]A fix is available under files.[/color][/size][/font][/color]\n<br />\n<br />[color=#efefef][font=Arial, sans-serif][size=3]They have the  lightfoot perk and will not activate traps – mostly :)\n<br />\n<br />Vala horse acts intelligent. She has own inventory, will follow or wait for you. If you use Vala's ring you can either talk to her or ride her. You can remove the gear and ride without saddle. Follower horses will follow Vala, if you choose her as your default horse. If Vala is in talking state, she will fight with you, if she's a horse, she runs out of the way and takes the follower horses with her.[/size][/font][/color]\n<br />\n<br />\n<br />[color=#efefef][size=3][b][font=Arial, sans-serif][color=#ff7700]Where are they: [/color][/font][/b][/size][/color]\n<br />[list]\n<br />[color=#efefef][size=3][b][font=Arial, sans-serif][color=#ff7700]S[/color][/font][/b][font=Arial, sans-serif]herda, Eldrid, Chiomara and Tom have their daily schedule in Whiterun. If you arrive on a sunday, you have to search for them. They could be on a ride or in the Bannered Mare or wander somewhere around. You will find them at late evenings together in the Bannered Mare. Weekdays they are working (Tom outside Whiterun). Look around to find them.\n<br />Ramgar lives at Hunter's Rest and Ruby is in Helgen Keep. You can recruit her while playing Helgen Intro, than she has different dialogue as if you play alternate start mods. R[/font][font=Arial, sans-serif]ikja the Huntress will  find you. She has a map marker from the beginning, so you can find her if the force greet doesn't trigger. She's a questgiver.\n<br />[/font]\n<br />[color=#ff7700]D[/color][font=Arial, sans-serif][color=#ff7700]ialogue menue: [/color]\n<br />The basic dialogue lines like follow, wait, etc. are hidden behind the dialogue: „can we have a word“ or „I've orders for you“. [color=#ff7700]Please notice:[/color] Two of Ramgar's menu entries refuse to show up if you use the scroll wheel of your mouse. Use arrow keys instead.\n<br />Individual dialogue shows up always at the first tier so you don't need to scroll through the lines, if new dialogue is available. I've changed most of the blocking topics into top level topics because blocking topics are often cut off and this is quite annoying. So player dialogue will only appear if you click on them in different locations. These lines are only said once.\n<br />[color=#ff7700]I focused on combat dialogue.[/color]\n<br />[/font]\n<br />[/size][/color][/list][font=Arial, sans-serif][color=#efefef][size=3][color=#ff7700]If you draw your weapon or spell or start sneaking, sandbox or loot packages end and they will catch up to you. This helps mostly all of the time if they don't follow you![/color] This affects only the sandbox packages that run if player sits or unequip weapons. In inns, playerhomes, temples, farms, stores they will stay sandboxing.\n<br />\n<br />[/size][/color][/font][font=Arial, sans-serif][color=#ff7700][size=3][b]Dismiss follower or playerhorse: They go back to their daily schedule and you can't recruit them again. This will be changed in the future but is not on top of my todo list.[/b][/size][/color][/font][font=Arial, sans-serif][color=#efefef][size=3]\n<br />You can let them wait somewhere if you will go with other followers.They will wait forever, if you forget them :) Same is with Vala. Choose another horse, she will then follow you. Let her wait - she will wait for you until the end of time. Follower horses follow their owner, if you don't choose Vala.\n<br />\n<br />Included is the [/size][/color][/font][color=#efefef][size=3][b][font=Arial, sans-serif]Stony Creek Farm[/font][/b][font=Arial, sans-serif],[/font][font=Arial, sans-serif] where Ramgar's parents live. [color=#ff7700]Don't use the mod Stony Creek Farm together with Tasheni Followers mod.[/color] The farm lies besides the Imperial Camp Eastmarch at the lake near Stony Creek Cave. Father Raganhar has a short quest for you.\n<br />Included is also Shepherd Erk Thrymsson and his flock of sheep. He's at sundays in Whiterun but wanders over the week to different locations. It's pretty relaxing to accompany him and safe also. He will fight against everything that smells like an enemy.[/font]\n<br />\n<br />[font=Arial, sans-serif]Ruby's dialogue includes the starting of her questline with the priestess Mor Murana – this is not finished yet, but you will get a glimpse of where it goes.[/font]\n<br />[font=Arial, sans-serif]Tom's dialogue includes the hint of his questline. After a certain dialogue you will find a diary in his inventory that tells what happened - this is not finished yet, but you will get a glimpse of where it goes.[/font][/size][/color]\n<br />[color=#efefef][size=3]\n<br />[font=Arial, sans-serif][color=#ff7700]Mod is incompatible with mods that change[/color]\n<br />- the area of Whiterun in front of the stables, where the cabbage field is \n<br />- besides Old Hroldan, the area under the great trees. I also added some clutter in front of Pelagia farm and some flowers in front of Drunken Huntsmen.\n<br />- The area of Imperial Camp Eastmarch.\n<br />- Stony Creek Cave[/font]\n<br />\n<br />[font=Arial, sans-serif][color=#ff7700]Don't use dialogue options from mods like AFT, UFO or Campfire on my followers. I have not tested these mods but know from other custom followers that it will break the followers AI.[/color][/font]\n<br />[font=Arial, sans-serif]\n<br />Mod is compatible with Convenient horses, but it overwrites the settings for Vala, so you have to set them in CH. Storage of CH is not the storage that Vala owns. [color=#ff7700]Don't teleport with horses![/color]\n<br />[/font]\n<br />[font=Arial, sans-serif]Please notice that teleporting or waiting for a lot of hours destroys the timetable of the AI. Avoid it, if you can.\n<br />\n<br />[color=#ff7700]Songs included (Sherda):\n<br />singing without instruments:[/color]\n<br />Chim-El-Adabal: music by Tasheni, lyrics from Imperial Library - this is my own interpretation and not the ESO version.\n<br />The Giant's Song: music and lyrics byTasheni\n<br />Anvil's Golden Shore: music Irish traditional, lyrics adapted from Paddy's Green Shamrock Shore[/font]\n<br />R[/size][/color][color=#efefef][size=3][font=Arial, sans-serif]ide On: Irish traditional\n<br />Eldrids short songs written byTasheni except one part that was taken out of Flaming  Bess          \n<br />[color=#ff7700]N[/color][/font][font=Arial, sans-serif][color=#ff7700]ew: vocals and lute:[/color] Mist Over Glenumbria Moors written and performed by Tasheni – sorry lipsync is not correct here because ck recognizes the guitar as voice.[/font]\n<br />[font=Arial, sans-serif][color=#ff7700]New: just instrumental:[/color]\n<br />The Giant's Song variation played byTasheni \n<br />[/font][font=Arial, sans-serif]SongTo Atmora instrumental played by Sherda and Eldrid, written and performed by Tasheni[/font]\n<br />[font=Arial, sans-serif]Short Practicing Piece written and performed by Tasheni[/font]\n<br />\n<br />[/size][/color][size=3][font=Arial, sans-serif][color=#ff7700]Credits:[/color]\n<br />This mod would not be possible without some people who helped me a lot with different things:\n<br />Very warm thanks to my boyfriend who got my back and gave me the time to work everyday on this mod.\n<br />\n<br />Thank you [color=#ff3300]Dark Creations[/color] and nexus for hosting my project and files.\n<br />\n<br />Thank you vastaril on Reddit for testing and reporting bugs. You are very, very helpful!\n<br />\n<br />Thank you for my very special [color=#ff7700]voiceactors[/color], you've done a fine job:\n<br />[color=#ff3300]kaomau [/color]for the voice of Ruby Trevelyen\n<br />[color=#ff3300]Joachim'dojoe' Fenkes[/color] for the voice of Ramgar of Stony Creek\n<br />[color=#ff3300]Roarbee [/color]for the voice of Tomalik'r Torquesson [url=https://www.youtube.com/channel/UCAil_NT6MMsxICxo_cIFcTQ]RoarBee on youtube\n<br />[/url][color=#ff3300]Mona Bruemmer[/color] for thevoice of Chiomara Northwind[/font]\n<br />[font=Arial, sans-serif][color=#ff3300]Lyrelaen [/color]for the voice of Scyld of Merryfair[/font]\n<br />[font=Arial, sans-serif][color=#ff3300]agerweb [/color]for the voice of Raganhar of Stony Creek\n<br />Eldrid Firerider, Sherda Akkadim, Rikja the Huntress, Mor Murana and Rendel Dorcas are voiced by [color=#ff3300]Tasheni[/color]\n<br />Thank you so much,[color=#ff3300] TheSunSpire[/color], for your awesome music!\n<br />I'm also very thankful for the help of [color=#ff3300]IsharaMeradin [/color]and [color=#ff3300]ReDragon2013[/color] on nexus for helping me with scripting and advice.[/font]\n<br />\n<br />[font=Arial, sans-serif][size=4][color=#ff7700]Please notice the credits list! Thank you to all the great modders who provide me with their awesome stuff![/color][/size][/font]\n<br />[/size][size=3][url=https://www.nexusmods.com/skyrim/mods/90429/]\n<br />[/url]Have fun! Tasheni\n<br />\n<br />Look at my other mods:\n<br />[url=https://www.nexusmods.com/skyrim/mods/90429?tab=description]Winterhorses - Tasheni Mod Project\n<br />[/url][url=https://www.nexusmods.com/skyrim/mods/92433]Tasheni Saddles[/url][url=https://www.nexusmods.com/skyrim/mods/87775]\n<br />Stony Creek Farm\n<br />[/url][url=https://www.nexusmods.com/skyrim/mods/86538]Tutorial Making Custom Dialogue with High Quality Sound\n<br />[/url][url=https://www.nexusmods.com/skyrim/mods/92881/?tab=description&amp;jump_to_comment=62472927]Tasheni Saddles Redguard Collection\n<br />[/url]\n<br />\n<br />\n<br />\n<br />[/size]",
  "categoryId": "66",
  "version": "0-4-1",
  "author": "Tasheni",
  "createdUnix": "1500317298",
  "updatedUnix": "1530305845",
  "containsAdultContent": false,
  "uploadedBy": "Tasheni",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000253598",
      "name": "Tasheni Followers-0-2-0 BSA archive",
      "version": "0.2.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "195089",
      "fileName": "Tasheni Followers BSA archive-85381-0-2-0.rar",
      "uploadedUnix": "1504377300",
      "modVersion": "0.2.0",
      "virusScanUrl": "https://www.virustotal.com/file/fde1d3960f81052476ad0fd16fca9800f7700497c1fb79682edb61e0b3d3f590/analysis/1504377565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers%20BSA%20archive-85381-0-2-0.rar?fid=1000253598&ttl=1535874210&ri=8192&rs=8192&setec=f569e04c8c6977ab688ca2e2e76730ea"
    },
    {
      "fileId": "1000253599",
      "name": "Tasheni Followers-0-2-0 LooseFiles",
      "version": "0.2.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "207436",
      "fileName": "Tasheni Followers-0-2-0 LooseFiles-85381-0-2-0.rar",
      "uploadedUnix": "1504377836",
      "modVersion": "0.2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers-0-2-0%20LooseFiles-85381-0-2-0.rar?fid=1000253599&ttl=1535874210&ri=8192&rs=8192&setec=8fcf02b688f2917634fc3f6af445431a"
    },
    {
      "fileId": "1000254611",
      "name": "Tasheni Followers-0-2-1 BSA archive",
      "version": "0.2.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "223721",
      "fileName": "Tasheni Followers-0-2-1 BSA archive-85381-0-2-1.rar",
      "uploadedUnix": "1505331992",
      "modVersion": "0.2.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers-0-2-1%20BSA%20archive-85381-0-2-1.rar?fid=1000254611&ttl=1535874210&ri=8192&rs=8192&setec=829c1d936d5bfe764cf0dbe8bf7af7c5"
    },
    {
      "fileId": "1000254613",
      "name": "Tasheni Followers-0-2-1 LooseFiles",
      "version": "0.2.1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "258251",
      "fileName": "Tasheni Followers-0-2-1 LooseFiles-85381-0-2-1.rar",
      "uploadedUnix": "1505332560",
      "modVersion": "0.2.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers-0-2-1%20LooseFiles-85381-0-2-1.rar?fid=1000254613&ttl=1535874211&ri=8192&rs=8192&setec=3ad378730f28b2b6721be18290fff929"
    },
    {
      "fileId": "1000261946",
      "name": "Tasheni Followers-0-3-0 LooseFiles",
      "version": "0-3-0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "386711",
      "fileName": "Tasheni Followers-0-3-0 LooseFiles-85381-0-3-0.rar",
      "uploadedUnix": "1513222171",
      "modVersion": "0-3-0",
      "virusScanUrl": null,
      "changelogHtml": " Changelog version 0-3-0\n<br /><br />- reworked the scripts structure. Deleted orphan scripts and implemented invisible continue dialogue. No more needed multiple same scripts for i.e. trade or wait. That reduces the number of the scriptfragments a lot.\n<br /><br />- optimized texture size with the exception of normal face maps, because faces get blocky if you do so.\n<br /><br />- implemented the great wolves from Mihail Monsters and Animals and reworked their textures because they were to blocky. To achieve the player horse you will have to fight for her first. Horse is not running after you anymore. It's only a little task but fits much better as to have her simply as a gift.\n<br /><br />- player can now decide if the horses of the followers should follow or not. Follower have a dialogue option to send the horses away if you don't want to have them with you. If the player mounts, the horses will teleport to their owner, if he dismounts, they run home. By default they follow their owner and wait when npc is waiting, if player is riding a horse that is not Vala. If player uses Vala, they follow Vala. If you let Vala wait, all horses wait with her.\n<br /><br />- implemented a script to fast mount and dismount followers. This was pretty annoying to wait for them all to get mounted. It's not needed anymore, just mount and ride away, they follow you immediately on their horses and dismount all together like one. On weak machines (like mine) sometimes one or two of them don't mount, but they do in the moment you ride away. Thousand times tested, it works pretty nice. Thank you IsharaMeradin for helping me.\n<br /><br />- checked missing dialogue and recreated lip-files.\n<br /><br />- tested the complete functionality of the followers. There should be no problems anymore with missing topics and scripts that not work. All spells work as intended.\n<br /><br />- created the Stony Creek Farm and the parents of Ramgar. They are part of a quest that is not ready yet. But you can use the farm as a resting point for your undertakings in that region. It's a nice place to stay. It will become a player home after the quest is done. From the inside you can look through the windows and see the lake and sheep and birds circling around. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers-0-3-0%20LooseFiles-85381-0-3-0.rar?fid=1000261946&ttl=1535874211&ri=8192&rs=8192&setec=5eae8afde34f3c64b362aa2cc89a520b"
    },
    {
      "fileId": "1000261947",
      "name": "Tasheni Followers-0-3-0 BSA archive",
      "version": "0-3-0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "386711",
      "fileName": "Tasheni Followers-0-3-0 BSA archive-85381-0-3-0.rar",
      "uploadedUnix": "1513223141",
      "modVersion": "0-3-0",
      "virusScanUrl": null,
      "changelogHtml": " Changelog version 0-3-0\n<br /><br />- reworked the scripts structure. Deleted orphan scripts and implemented invisible continue dialogue. No more needed multiple same scripts for i.e. trade or wait. That reduces the number of the scriptfragments a lot.\n<br /><br />- optimized texture size with the exception of normal face maps, because faces get blocky if you do so.\n<br /><br />- implemented the great wolves from Mihail Monsters and Animals and reworked their textures because they were to blocky. To achieve the player horse you will have to fight for her first. Horse is not running after you anymore. It's only a little task but fits much better as to have her simply as a gift.\n<br /><br />- player can now decide if the horses of the followers should follow or not. Follower have a dialogue option to send the horses away if you don't want to have them with you. If the player mounts, the horses will teleport to their owner, if he dismounts, they run home. By default they follow their owner and wait when npc is waiting, if player is riding a horse that is not Vala. If player uses Vala, they follow Vala. If you let Vala wait, all horses wait with her.\n<br /><br />- implemented a script to fast mount and dismount followers. This was pretty annoying to wait for them all to get mounted. It's not needed anymore, just mount and ride away, they follow you immediately on their horses and dismount all together like one. On weak machines (like mine) sometimes one or two of them don't mount, but they do in the moment you ride away. Thousand times tested, it works pretty nice. Thank you IsharaMeradin for helping me.\n<br /><br />- checked missing dialogue and recreated lip-files.\n<br /><br />- tested the complete functionality of the followers. There should be no problems anymore with missing topics and scripts that not work. All spells work as intended.\n<br /><br />- created the Stony Creek Farm and the parents of Ramgar. They are part of a quest that is not ready yet. But you can use the farm as a resting point for your undertakings in that region. It's a nice place to stay. It will become a player home after the quest is done. From the inside you can look through the windows and see the lake and sheep and birds circling around. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers-0-3-0%20BSA%20archive-85381-0-3-0.rar?fid=1000261947&ttl=1535874212&ri=8192&rs=8192&setec=d2b4a33e041ed013cbcf1a5d72755532"
    },
    {
      "fileId": "1000275700",
      "name": "Tasheni Followers 0-4-0 Loose Files",
      "version": "0-4-0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "576610",
      "fileName": "Tasheni Followers 0-4-0 Loose Files-85381-0-4-0.rar",
      "uploadedUnix": "1529535578",
      "modVersion": "0-4-0",
      "virusScanUrl": null,
      "changelogHtml": " - dialogue focus was on combat. Followers act together\n<br />- added new dialogue for all followers, Rikja the Huntress, Raganhar of Stony Creek, Scyld of Merryfair and Rendel Dorcas\n<br />- retextured armors and made them unique\n<br />- added unique rings, enchanted and partially left hand\n<br />- retextured wolves and dogs.\n<br />- implemented two short quests with Rikja - lead to Ramgar and go hunting\n<br />- implemented a short quest with unique creatures given by Raganhar\n<br />- implemented sandbox behavior that can be controlled by player\n<br />- recorded new songs and instrumentals\n<br />- reworked some script fragments and packages\n<br />- added dialogue to let the witches cast a light on the player\n<br />- retextured saddles and horses with unique winter fur\n<br />- added Hammerfell bow and arrows to Tom\n<br />- cleared followers inventory\n<br />- retextured and added a journal - Malika's diary\n<br />- added notes that points to questline\n<br />- implemented a scene between Ruby and Rendel\n<br />- did a LOT debugging and reworked most of the conditions. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers%200-4-0%20Loose%20Files-85381-0-4-0.rar?fid=1000275700&ttl=1535874212&ri=8192&rs=8192&setec=381444ac8afa94ad164a66fa953be823"
    },
    {
      "fileId": "1000275704",
      "name": "Tasheni Followers 0-4-0 BSA",
      "version": "0-4-0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "545873",
      "fileName": "Tasheni Followers 0-4-0 BSA-85381-0-4-0.rar",
      "uploadedUnix": "1529537072",
      "modVersion": "0-4-0",
      "virusScanUrl": null,
      "changelogHtml": " - dialogue focus was on combat. Followers act together\n<br />- added new dialogue for all followers, Rikja the Huntress, Raganhar of Stony Creek, Scyld of Merryfair and Rendel Dorcas\n<br />- retextured armors and made them unique\n<br />- added unique rings, enchanted and partially left hand\n<br />- retextured wolves and dogs.\n<br />- implemented two short quests with Rikja - lead to Ramgar and go hunting\n<br />- implemented a short quest with unique creatures given by Raganhar\n<br />- implemented sandbox behavior that can be controlled by player\n<br />- recorded new songs and instrumentals\n<br />- reworked some script fragments and packages\n<br />- added dialogue to let the witches cast a light on the player\n<br />- retextured saddles and horses with unique winter fur\n<br />- added Hammerfell bow and arrows to Tom\n<br />- cleared followers inventory\n<br />- retextured and added a journal - Malika's diary\n<br />- added notes that points to questline\n<br />- implemented a scene between Ruby and Rendel\n<br />- did a LOT debugging and reworked most of the conditions. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers%200-4-0%20BSA-85381-0-4-0.rar?fid=1000275704&ttl=1535874213&ri=8192&rs=8192&setec=fffacfef7fe05f2c63fb3bf93b0b581b"
    },
    {
      "fileId": "1000275926",
      "name": "Horse fast mount script fix",
      "version": "1",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Horse fast mount script fix-85381-1.rar",
      "uploadedUnix": "1529773025",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/ff0976b4f3c64a08bc9cc82d691d7a124748606d9b90121fc8ff8995c2ba0b43/analysis/1529773203/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Horse%20fast%20mount%20script%20fix-85381-1.rar?fid=1000275926&ttl=1535874213&ri=8192&rs=8192&setec=628d794c7341063eaf6fdccb07614918"
    },
    {
      "fileId": "1000276431",
      "name": "Tasheni Followers 0-4-1 BSA Files",
      "version": "0-4-1",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "578391",
      "fileName": "Tasheni Followers 0-4-1 BSA Files-85381-0-4-1.rar",
      "uploadedUnix": "1530283203",
      "modVersion": "0-4-1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers%200-4-1%20BSA%20Files-85381-0-4-1.rar?fid=1000276431&ttl=1535874214&ri=8192&rs=8192&setec=69cc562f4b21a9b995ff97ccf21fde28"
    },
    {
      "fileId": "1000276438",
      "name": "Tasheni Followers Loose files 0-4-1",
      "version": "0-4-1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "578391",
      "fileName": "Tasheni Followers Loose files 0-4-1-85381-0-4-1.rar",
      "uploadedUnix": "1530284581",
      "modVersion": "0-4-1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers%20Loose%20files%200-4-1-85381-0-4-1.rar?fid=1000276438&ttl=1535874214&ri=8192&rs=8192&setec=ebcaba4c35a93e7cc4ac69f62d8ea3f6"
    },
    {
      "fileId": "1000276452",
      "name": "Tasheni Followers BSA version 0-4-1",
      "version": "0-4-1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "543014",
      "fileName": "Tasheni Followers BSA version 0-4-1-85381-0-4-1.rar",
      "uploadedUnix": "1530305845",
      "modVersion": "0-4-1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tasheni%20Followers%20BSA%20version%200-4-1-85381-0-4-1.rar?fid=1000276452&ttl=1535874215&ri=8192&rs=8192&setec=f30dc8d2d58cfc5fdfb9ca34b6219957"
    }
  ]
}