{
  "modId": 8540.0,
  "modName": "Rags to Riches - Thieves Guild Edition",
  "summary": "Disappointed in the Thieves Guild \\\"improvements\\\" after you\\'ve finished the quest? Download this mod to soothe your interior decorating woes!",
  "descriptionHtml": "PLEASE READ: If you have not finished the Thieves Guild questline, I STRONGLY recommend you do so before downloading this mod. Rags to Riches - Thieves Guild Edition will immediately make changes and additions to The Ragged Flagon that you would not see if you had just started the quest. If you want all the goodies right away, though, then more power to you!\r\n\r\n============================================\r\n\r\nHi there! I\\'m abigailmh, and this is My First Mod Ever.\r\n\r\nI was disappointed in the vanilla guild HQ \\\"upgrades\\\" that occur in the Thieves Guild questline, so I decided apply Pimp My Ride tactics to Skyrim and give The Ragged Flaggon a real(ly expensive) upgrade myself.\r\n\r\nMOD CONTENT\r\nVersion 1.1:\r\n- Fixed issues with certain objects in the merchant areas not showing up.\r\n\r\nVersion 1.0:\r\n- Rugs have been replaced by much nicer versions with better placement\r\n- Dishware now reflects a guild overflowing with gold and, as such, is now made of gold\r\n- Noble furniture upgrades\r\n- Various banners have been placed in the Flagon to add a little pizazz\r\n- Animals! There are now fish in the water outside the bar, including a particularly old Slaughterfish by the name of Gramps (don\\'t worry, he won\\'t bite your ankles). There is also a dog to give the place that nice, home-y feeling.\r\n- Diversified merchants: the Thieves Guild has decided to open its doors to argonians and khajiit\r\n- The merchants now have nicer shops with unique settings\r\n- Improved and more visually pleasing lighting\r\n- Last but not least, the guild vault now reflects the spoils of your toils. Step inside and you\\'ll feel like you\\'ve entered a dragon\\'s hoard, complete with thrones for the guild leaders to sit in during discussions!\r\n\r\nKNOWN ISSUES:\r\n- Merchants may or may not sell items to you. I am investigating this issue myself to see what is causing the problem.\r\n- I\\'m very new to modding, as said, and I do not know how to script the improvements so that they coincide with your upgrades via the quests. If anyone has a tutorial or would like to do this themselves, let me know in the comments section.\r\n\r\n\r\n\r\n\r\n\r\nIf you download the mod and encounter any problems, please let me know right away in the comment section. I am unsure as to whether or not the merchants are working right now, but this is a problem I\\'m actively working on. Any suggestions or constructive criticisms would be very well appreciated! :)\r\n\r\nIf this mod goes over well, I will be doing other locations as well based upon my interest and request. I have already done Whiterun\\'s Breezhome (compatible with Dovakhiin Hideout) and will upload it if there is a desire for it (and if I get approval from its creator, of course!).\r\n\r\nThank you for downloading!",
  "categoryId": "90",
  "version": "1.1",
  "author": "abigailmh",
  "createdUnix": "1328817186",
  "updatedUnix": "1328820076",
  "containsAdultContent": false,
  "uploadedBy": "abigailmh",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27916",
      "name": "Rags to Riches - Thieves Guild Edition V1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "24",
      "fileName": "Rags to Riches - Thieves Guild Edition V1-8540-1-0.rar",
      "uploadedUnix": "1328817360",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/2701c5bb5ac4db43879af17a7a2bb10009330cc7d3f2adb1b615a6c7242cdb93/analysis/1406664845/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rags%20to%20Riches%20-%20Thieves%20Guild%20Edition%20V1-8540-1-0.rar?fid=27916&ttl=1535767349&ri=8192&rs=8192&setec=e0285ce1cb0cbd7146341758302fd532"
    },
    {
      "fileId": "27935",
      "name": "Rags to Riches - Thieves Guild Edition V1 1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Rags to Riches - Thieves Guild Edition V1 1-8540-1-1.rar",
      "uploadedUnix": "1328820076",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/f6386b068e7c3461d9542b1bb68be3d466bb97eb1f53d9742de602236f7483dc/analysis/1406664910/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rags%20to%20Riches%20-%20Thieves%20Guild%20Edition%20V1%201-8540-1-1.rar?fid=27935&ttl=1535767349&ri=8192&rs=8192&setec=c19b7b54f6a976c5230a2863187634a4"
    }
  ]
}