{
  "modId": 85416.0,
  "modName": "Sword of the Seeker (v1.1) - Main File-59331-1-1",
  "summary": "This should be a complete version of FavoredSoul&#39;s mod &#34;Sword of the Seeker&#34;. I noticed some other versions of this have been posted but have noticed some do not have the custom scabbard found in the original mod. By no means do I take credit for this magnificent work.",
  "descriptionHtml": "   Again this is the Sword of the Seeker by FavoredSoul for the original Skyrim. I got back into playing this game on a new computer and was confused when I couldn&#39;t find my favorite sword mod. After some research I discovered that all of FavoredSoul&#39;s mods seem to have been taken down or vanished or something. Never the less I had only upgraded from Laptop to Desktop so I was able to harvest the old main file of the sword that existed on it. For my game it held the base of 16 damage and still had the custom scabbard unlike some of the other versions that have been posted. So if this is what you are looking for I hope this helps. I&#39;m uncertain if this was actually added into the game to be found, or if it was added into the crafting list though I do believe it has been. The sword itself is actually called the Sword of Truth. So if you need to get it using console commands, type somethings along the lines of (minus the quotation of course) &#34;help truth&#34; and it should be the first and perhaps only weapon to appear.\r<br />&lt;br/&gt;\r<br />&lt;br/&gt;   I have no modding experience or talent what so ever, it took me a good 5 hours in fallout 3 to learn how to edit a weapon mod to my liking and have never done anything of the sort for Skyrim. So in other words I won&#39;t be supporting this file or anything, I simply just want to share what should be a complete version of FavoredSoul&#39;s mod for those who are having trouble finding it.",
  "categoryId": "55",
  "version": "1.1",
  "author": "FavoredSoul",
  "createdUnix": "1500419978",
  "updatedUnix": "1500419951",
  "containsAdultContent": false,
  "uploadedBy": "Chauncy87",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000249779",
      "name": "Sword of the Seeker (v1.1) - Main File-59331-1-1",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10768",
      "fileName": "Sword of the Seeker (v1.1) - Main File-59331-1-1-85416-1-1.rar",
      "uploadedUnix": "1500419951",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c5889af9592cab6a545e304b62f7131c37c57e74f5b46566e9f2bf521c73b521/analysis/1500420219/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sword%20of%20the%20Seeker%20%28v1.1%29%20-%20Main%20File-59331-1-1-85416-1-1.rar?fid=1000249779&ttl=1535874251&ri=8192&rs=8192&setec=d8f7dd6b8c1832b53a20c7499d323838"
    }
  ]
}