{
  "modId": 8543.0,
  "modName": "Skyrim Cremation Mod",
  "summary": "Ever get sick of trying to roleplay disposing of a body by dragging it somewhere? Get sick of nosey individuals stumbling upon the corpses of you victims and raising an alarm? If so, then this mod is for you! This mod adds a lesser power to the game called \\\"Cremate Dead\\\" which allows you to cast a fiery orb at corpses and reduce them to ashes. Go",
  "descriptionHtml": "15 Feb - It\\'s currently my day off. Working on redoing this mod, implementing the quest, and changing the lesser power name to \\\"Last Rites\\\"\r\n\r\n\r\nEver get sick of trying to roleplay disposing of a body by dragging it somewhere? Get sick of nosey individuals stumbling upon the corpses of you victims and raising an alarm? If so, then this mod is for you! This mod adds a lesser power to the game called \\\"Cremate Dead\\\" which allows you to cast a fiery orb at corpses and reduce them to ashes. Good for roleplayers wanting to grant last rights to bodies they encounter, this mod is also useful for it\\'s ability to quickly remove potential enemies from the field when fighting necromancers.\r\n\r\nThe spell tome can be found just outside the walls of Riverwood, next to the campfire.\r\n\r\nFact:  The Cremate Dead lesser power can be spammed at a guards face without being a crime.  At it\\'s heart, the spell is a ultrashort duration raise dead spell.\r\n\r\nP.S. The ashes in the screenshot are from the chicken in riverwood. He\\'s been the death of many a new player, and got what was coming to him.",
  "categoryId": "75",
  "version": "1.0",
  "author": "Koor",
  "createdUnix": "1328818416",
  "updatedUnix": "1328818883",
  "containsAdultContent": false,
  "uploadedBy": "koor",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27926",
      "name": "Skyrim Cremation Mod",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Skyrim Cremation Mod-8543-1-0.zip",
      "uploadedUnix": "1328818883",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/5db08b48d3022e0dbd362f36a70cd194a49ef317ed9d191192c8b9e0d3d04884/analysis/1406664904/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Cremation%20Mod-8543-1-0.zip?fid=27926&ttl=1535767354&ri=8192&rs=8192&setec=12df4e935d827005ef1b8cf2ab9ced4a"
    }
  ]
}