{
  "modId": 8545.0,
  "modName": "Enhanced Soul Gems",
  "summary": "Now you can craft soul gems at special crafting stations!",
  "descriptionHtml": "This is the first in a series of updates aimed at making soul gems more fun and (possibly) more realistic.\r\n\r\nThe first part is based on my other two mods - Craftable Black Soul Gems and Craftable Soul Gems - allowing the player to use Soul Gem Fragments and even other soul gems to craft and \\\"upgrade\\\" soul gems. You need to have the Enchantment perk, level 1 (level 2 for Greater gems, level 3 for Grand gems, level 4 for Black gems).\r\n\r\n3 Soul Gem Fragments = 1 Petty Soul Gem\r\n2 Petty Soul Gems = 1 Lesser Soul Gem\r\n10 Petty Soul Gems = 5 Lesser Soul Gems (batch operation)\r\n2 Lesser Soul Gems = 1 Common Soul Gem\r\n2 Common Soul Gems = 1 Greater Soul Gem\r\n2 Greater Soul Gems = 1 Grand Soul Gem\r\n1 Grand FILLED Soul Gem = 1 Black Soul Gem\r\n\r\nIn addition, I\\'ve replaced the five different types of Soul Gem Fragments with one universal type; this makes it much easier when crafting because before you needed three of each kind of fragment (they were indistinguishable in the menu). They still exist in the game files, however, just in case they need to be reverted.\r\n\r\nThere is also a new kind of crafting station: the Soul Gem Enchanter. This is the only place where soul gems can be crafted/upgraded. There are currently two of these, one in Farengar\\'s chamber in Whiterun and the other in the College of Winterhold (more to come later). Right now they have the appearance of a regular Arcane Enchanter; I would like to make a new model, but since I have absolutely no modelling skills this could be awhile. (If anyone would like to provide a model, I\\'d be extremely appreciative!)\r\n\r\nKnown Bugs:\r\nNone. But when crafting black soul gems, it MAY be the case that grand soul gems filled with a lesser soul than the grand-level will work when it really shouldn\\'t. Any feedback is welcome.\r\n\r\nFuture Plans:\r\n-Probably the next step is expanding on the new Soul Gem Enchanter station, adding more to the world. \r\n\r\n-I\\'d also like to incorporate soul gem mining - new mines (or old) which have a preponderance of soul gems which can be harvested from the rock.\r\n\r\n-It doesn\\'t seem possible yet (I\\'ve tried), but what would be even better than having a new station would be using the original Arcane Enchanter for soul gem crafting/upgrading. Since I\\'m no scripter, though, I can\\'t do this yet. Help, anyone?\r\n\r\n-I would like to make creating black soul gems more like in Oblivion. Perhaps a daedric artifact or some kind of evil altar could \\\"corrupt\\\" a grand soul gem, something like that.\r\n\r\nv.1.0:\r\nFirst release.\r\n",
  "categoryId": "85",
  "version": "1.0",
  "author": "Tasciovanus",
  "createdUnix": "1328819290",
  "updatedUnix": "1328819602",
  "containsAdultContent": false,
  "uploadedBy": "Drennin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "27931",
      "name": "Enhanced Soul Gems",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "142",
      "fileName": "Enhanced Soul Gems-8545-1-0.rar",
      "uploadedUnix": "1328819602",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d5c6b86abdeaa438fa3faad3bfedc45c0e6a228035656b897814de8766676cb5/analysis/1406664906/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Enhanced%20Soul%20Gems-8545-1-0.rar?fid=27931&ttl=1535767357&ri=8192&rs=8192&setec=4a7a435c03fcee8f7e73b9d68511ed77"
    }
  ]
}