{
  "modId": 85506.0,
  "modName": "Antique Art of the Aldmeri - Teleportation",
  "summary": "Learn the Aldmeri art of teleportation and a piece of the broken history of the ancient Aldmeri Empire. Wield the power of teleportation, manipulate time, space, and all that live within their boundary. Teleport yourself and other living or dead beings.",
  "descriptionHtml": "[i]Teleportation has always been a part of the society of Alinor. Being one of the most widely used magic within the Dominion, it generates great value to our state and drives our society forward, but most of all, it tremendously benefits our people.[/i]\r<br />\r<br />-Archmage Thindrel of Lillandril, Archon of Wisdom\r<br />\r<br />\r<br />\r<br />First of all, a bonus for you guys.\r<br />[youtube]dwNonRl_494[/youtube]\r<br />\r<br />\r<br />Learn the Aldmeri art of teleportation and a piece of the broken history of the ancient Aldmeri Empire. Wield the power of teleportation, manipulate time, space, and all that live within their boundary.\r<br />\r<br />\r<br />Lore Background:\r<br />\r<br />There are many reasons that led to the rise of the Aldmeri Dominion, one among which is their extensive use and development of magic, particularly teleportation; with which, distance is no longer an obstacle for communication, transportation and logistic - despite the fact that the Thalmor are one of the most advanced magic users in modern day Nirn, what they possess pales against the wonders created by the ancient Aldmeri civilization; even the teleportation technique that the Altmeri takes pride in, is but a shadow of what their ancestors had.\r<br />\r<br />No one knows for certain who invented the art of teleportation. Though various sources suggest that it can be traced back to the Aldmeri Age of the Merethic Era, whether it is its origin may remain a mystery for eternity.\r<br />\r<br />\r<br />[youtube]61DMbYeMGkg[/youtube]\r<br />\r<br />\r<br />Adds three spells: Marks of Teleportation, Teleportation, Teleport Others\r<br />\r<br />Marks of Teleportation allows you to mark where you stand, with a magical mark. There are totally 6 magical markers that you can make use with.\r<br />\r<br />Teleportation teleports yourself to a specified magical mark.\r<br />\r<br />Teleport Others teleports your target to a specified magical mark. [b]You can even cast it on allies or foes during battle[/b] - use at your advantage.\r<br />\r<br />\r<br />You can track the magical marks from the World Map.\r<br />[img]https://images.discordapp.net/attachments/212851475792134144/338501555173064715/20170723093814_1.jpg?width=1099&height=619[/img]\r<br />\r<br />\r<br />Q&A\r<br />\r<br />Q0. Your lore background isn&#39;t lore-friendly&#33;&#33;&#33;11&#33;&#33;&#33;&#33;&#33;1&#33;&#33;&#33;&#33;&#33;1&#33;&#33;\r<br />A0. Last I checked, there&#39;s no hard facts in the lore that denies anything it states. Unless you count the subjective in-game references which are technically written by in-game characters who express their subjective view and knowledge.\r<br />\r<br />Q1. How does your mod differ with other teleportation mods?\r<br />A1. I don&#39;t use other teleportation mods. But my mod allows you to mark specific spot for location, and to teleport other characters, as well as tracking teleportation marks.\r<br />\r<br />Q2. Where do I learn the spell?\r<br />A2. College of Winterhold - Arcanaeum. For specific location, check the video.\r<br />\r<br />Q3. How do I track the magical marks?\r<br />A3. As soon as you use Marks of Teleportation, the tracking will be initiated. You need to activate the misc objective in the quest tab and activate the mark tracking objectives.\r<br />\r<br />Q4. Can I teleport my enemy to a city? Can I teleport a dragon to the ground? Can I teleport to a far-away location? Can I-\r<br />A4. Yes.\r<br />\r<br />Q5. Will this mod break quests?\r<br />A5. If you don&#39;t know what you are doing, virtually everything can break your game. Short answer: if you teleport Alduin to qasmoke during Dragonslayer, it&#39;s obvious that your quest will be broken.\r<br />\r<br />\r<br />\r<br />[url=https://forums.nexusmods.com/index.php?/topic/4646295-wip-shezzarine-the-fate-of-tamriel/]My team is making a large-scaled quest mod that involves ancient Aldmer and the Thalmor. If you are a modeler/texture artist, scripter or a level designer, please lend us your hand.[/url]\r<br />\r<br />\r<br />My other mods:\r<br />Skyrim: [url=http://www.nexusmods.com/skyrim/mods/80828/?]Caesia Follower[/url]\r<br />Fallout 4: [url=http://www.nexusmods.com/fallout4/mods/14108/?]Immersive Generic Dialogues[/url]",
  "categoryId": "93",
  "version": "1",
  "author": "Miroslav Yegorov",
  "createdUnix": "1500776979",
  "updatedUnix": "1500776975",
  "containsAdultContent": false,
  "uploadedBy": "anbeegod",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000250067",
      "name": "Teleportation",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Teleportation-85506-1.rar",
      "uploadedUnix": "1500776975",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/00f5e120ac0f5e7687f7a778643603b780c0df6e5226895b9e0e768f5149713c/analysis/1500777243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Teleportation-85506-1.rar?fid=1000250067&ttl=1535874328&ri=8192&rs=8192&setec=e5e331d3b07d73ceef0c0b890897bc65"
    }
  ]
}