{
  "modId": 85512.0,
  "modName": "Bathing in Skyrim - Spanish Translation",
  "summary": "Gran mod de inmersión el cual te permite bañarte y ducharte, asi como ensuciarte con el paso del tiempo, totalmente personalizable, incluye jabónes y efectos por aroma que reforzaran tus habilidades.",
  "descriptionHtml": "[img]http://i.imgur.com/XQLtjy4.png[/img]\r<br />\r<br />[color=#ffff00][size=5]Bathing in Skyrim versión al español[/size][/color]\r<br />\r<br />Bienvenidos amigos, esta vez les traigo una traducción de un gran mod. Se trata de [color=#B6FF00]Bathing in Skirim[/color]. De acuerdo al autor el mod hace lo siguiente:\r<br />\r<br />[color=#b6b6b6][i]Bathing in Skirim añade la función de baños y duchas  a Skyrim. Con el tiempo, su personaje se irá viendo más sucio y recibirá una penalización al poder de la voz (Gritos) y la resistencia a enfermedades. Si te vuelves excepcionalmente sucio, también recibirás un castigo a el sigilo ya que tus enemigos te olerán. Para evitar estas sanciones, tendrá que bañarse regularmente. Mantenerse limpio también concede pequeñas bonificaciones dependiendo del tipo de jabón que utilice.\r<br />\r<br />Para bañarse, simplemente póngase en el agua y use jabón o un trapo de lavado de su inventario. El jabón se puede elaborar con las recetas descritas  en la sección de elaboración. Casi todo el agua en Skyrim funcionará, aunque sólo cubra tus tobillos\r<br />\r<br />[/i][/color]Complementando lo anterior añade un menú que puedes personalizar y que te permitirá definir los parametros de suciedad y de limpieza, así como decidir en que lugares te ensucias más, si en la ciudad, el yermo o los campamentos. También permite decidir si tu personaje se quitara toda la ropa automáticamente o por partes. En el siguiente vídeo podrás ver el mod en acción. Disfruta.\r<br />\r<br />[img]http://i.imgur.com/Qxpd6dX.png[/img][youtube]5q78rIvH1mk[/youtube]\r<br />\r<br />[img]http://i.imgur.com/7umbGDt.png[/img]\r<br />\r<br />La traducción que he subido es totalmente inmersiva, me esforcé totalmente en utilizar el lenguaje mas neutro y real posible, por lo cual españoles y latinos pueden sentir total confianza en mis traducciones, prometo que no serán defraudados.\r<br />\r<br />Realicé la traducción totalmente desde cero, realicé numerosas pruebas in game para garantizar la traducción y su funcionamiento.\r<br />\r<br />Tal es mi compromiso que al ir traduciendo palabras como [color=#ffff00]Clean[/color] y [color=#ffff00]Dirty[/color] sabia que no podía ser inmersivo para hombres y mujeres por igual, por lo tanto he subido 2 versiones del mod. Versión femenina y masculina respectivamente las cuales alteran algunas palabras para que se adapte a tu personaje. Es decir que si en la versión masculina ves la frase [color=#ffff00]Te sientes limpio[/color] en la femenina dirá [color=#ffff00]Te sientes limpia[/color], y así con el resto de la traducción.\r<br />\r<br />Si hay un error en la traducción, sientase en libertad de vaciar el cargador de su AK-47 sobre mi, lo corregire de inmediato.\r<br />\r<br />\r<br />[img]http://i.imgur.com/1RZ7p9E.png[/img]\r<br />\r<br />[size=5]Requisitos[/size]\r<br />\r<br />1.- Por supuesto, requiere el MOD original [url=http://www.nexusmods.com/skyrim/mods/60421/?]Bathing in Skyrim[/url]\r<br />[color=#b6b6b6]Te recomiendo que examines minuciosamente, ya que el autor precisa de otros requisitos. [/color]\r<br />\r<br />2.- Instala mi traducción sobre el MOD original\r<br />\r<br />3.- [Opcional] Si usas USLEEP recomiendo instalar [url=http://www.nexusmods.com/skyrim/mods/55496/?]Correcciones y mejoras de textos y voces[/url]\r<br />[color=#b6b6b6]En lo personal la considero la mejor traducción del USLEEP, no puede faltar en tu juego si quieres inmersión verdadera.[/color]\r<br />\r<br />4.- [Opcional] Mods de compatibilidad\r<br />[color=#b6b6b6]El autor original incluye varios mods de compatibilidad, no necesitan traducción, por ello no se incluyen aquí.[/color]\r<br />\r<br />[size=5]Instalación[/size]\r<br />\r<br />Simplemente copia los archivos a los directorios respectivos, puedes instalarlo con NMM o MO sin problemas.\r<br />\r<br />[size=5]Desinstalar[/size]\r<br />\r<br />Simplemente elimina los archivos descargados o instala el mod original nuevamente, eso eliminara la traducción.\r<br />\r<br />\r<br />[img]http://i.imgur.com/VvK8iWz.png[/img]\r<br />\r<br />[color=#ffff00]1.- Podría dañar mi juego?[/color]\r<br />Esta es una pregunta complicada puesto que esta traducción esta sobre el mod original, por lo cual si el original tiene bugs este también. Si te va de perlas con el original, pues con este también, así de simple. De cualquier forma todo reclamo debe ser dirigido contra el autor, yo solo respondo por la traducción.\r<br />\r<br />[color=#ffff00]2.- Podría afectar mi partida?[/color]\r<br />Si tienes un save con el mod original y le instalas esta traducción, no tendrás problemas. Si lo instalas por primera vez, pruébalo unos 30 minutos y verifica por ti mismo, una vez seguro de ello, guardar o utilizar otro slot.\r<br />\r<br />[color=#ffff00]3.- Hay un mod que me encanta ¿puedo solicitar una traducción?[/color]\r<br />Por supuesto, envíame un cómodo mensaje y te aseguro no olvidarme de ello.\r<br />\r<br />[color=#ffff00]4.- Tu traducción me pone ¿te harás responsable?[/color]\r<br />Tal vez, espero no vivas lejos ;)\r<br />\r<br />[img]http://i.imgur.com/dVcSedW.png[/img]\r<br />\r<br />[color=#b6b6b6]Por supuesto los créditos se en listan a continuación.[/color]\r<br />\r<br />&bull; Bathing in Skyrim: Mzin\r<br />&bull; Video de muestra: Skytts TV\r<br /> \r<br />\r<br />[img]http://i.imgur.com/kGA7pfm.png[/img]",
  "categoryId": "78",
  "version": "1.11",
  "author": "dantephoenix",
  "createdUnix": "1500799209",
  "updatedUnix": "1500799206",
  "containsAdultContent": false,
  "uploadedBy": "dantephoenix",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000250086",
      "name": "Bathing in Skyrim (Males) - Spanish",
      "version": "1.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "87",
      "fileName": "Bathing in Skyrim (Males) - Spanish-85512-1-11.7z",
      "uploadedUnix": "1500799175",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/54f30fe2ffb6aac8d840b1a79ee1597fe3cbe8c4b9a00bfeecc9c2c40bee83ae/analysis/1500799442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bathing%20in%20Skyrim%20%28Males%29%20-%20Spanish-85512-1-11.7z?fid=1000250086&ttl=1535874340&ri=8192&rs=8192&setec=a9fd2e5c337ce7c3dfc7a8598e2d8aac"
    },
    {
      "fileId": "1000250087",
      "name": "Bathing in Skyrim (females) - Spanish",
      "version": "1.11",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "87",
      "fileName": "Bathing in Skyrim (females) - Spanish-85512-1-11.7z",
      "uploadedUnix": "1500799206",
      "modVersion": "1.11",
      "virusScanUrl": "https://www.virustotal.com/file/c98d99becfb8115e3cf1385b5e43678872b79ec7e851e5d80a3185b523a4feb7/analysis/1500799444/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bathing%20in%20Skyrim%20%28females%29%20-%20Spanish-85512-1-11.7z?fid=1000250087&ttl=1535874340&ri=8192&rs=8192&setec=fbf581f3251c65b95da1d861ab36beae"
    }
  ]
}