{
  "modId": 85524.0,
  "modName": "WheetThooder",
  "summary": "",
  "descriptionHtml": "[b]Warning: A follower that my friend WhiteThunder made. It&#39;s OP as shit. Don&#39;t DL unless you wanna fuck everything and everyone up.\r<br />\r<br />Requirements:[/b] Dawnguard DLC \r<br />\r<br />[b]Summary:[/b] Really strong follower designed for high difficulties that heals the player, does extra damage to undead, and doesn&#39;t need to be geared.Target Difficulty Master / Legendary\r<br />[b]About WhiteThunder: \r<br />[/b]Marriagable\r<br />Essential - cannot be killed\r<br />Will commit any crime \r<br />Doesn&#39;t affect stealth meter when sneaking\r<br />Does not look anything like me IRL\r<br />Found at Riverwood Inn\r<br />\r<br />[b]Equipment: [/b]WhiteThunder has a special ring that gives him huge defensive buffs, including armor, magic resistance, block bonus, and significant regeneration. This results in him rarely being incapacitated during combat from taking too much damage. This means you don&#39;t have to give him armor or upgrade it early on, but doing so may help him late game if you see him getting beat up a lot.He has two custom swords, a shield and a bow. They are specially synergized with custom skill perks he has been given so that his damage will scale as he levels without player intervention. I highly recommend you do not change or upgrade his weapons/shield. If you want to anyway, keep in mind his preferred combat style may change.He also hates spooks so his weapons have special anti-undead modifiers that will increase damage against undead and sometimes cause explosions similar to the original Dawnbreaker sword.\r<br />\r<br />[b]Magic Perks: [/b]Magic is naturally very imbalanced in the game. It is super strong at low levels and very weak at high levels. This is because the main way to increase magic damage is to get better skills, which tend to cap out at around 100 damage, whereas a sword can be upgraded to do over 1000 damage.To make magic more viable at high levels with high difficulty, I have added a few leveled perks to scale the magnitude of elemental/sun/healing spells based on your levels of the Destruction/Restoration skills. It turns out this also buffs magic damage on enchantments, so using these perks is how WhiteThunder&#39;s melee damage scales.These perks should be available to your character as well. Each perk can be leveled 5 times to further increase its effect. You may want to restrain yourself from leveling them all the way if you still want enemies to be challenging depending on your chosen difficulty.Note: If you are using magic overhaul mods, I&#39;m not sure what will happen.\r<br />\r<br />[b]Magic: [/b]WhiteThunder has a few healing spells, but getting the AI to cast them on the player is pretty difficult, so I added a version of Stendarr&#39;s Aura (Sun Cloak) from the Dawnguard DLC. Originally, the aura damages undead, but I have modified this version to damage enemies in range (undead take x3), and heal allies in range. If you pass through the aura, you will have sustained healing over time for a few seconds, but it is weaker than if you stayed in range.He also has a few offensive lightning spells that have lower level requirements than their original versions. The earliest should become available at level 11, with the most powerful at level 46. He is likely to use spells if he is some distance from the enemy.He used to have shouts but due to initial feedback, I ended up removing them because they would keep hitting the player by accident.\r<br />\r<br />[b]Combat: [/b]WhiteThunder has a custom combat style designed to balance melee, archery and magic. This is difficult to balance because different types of combat become stronger than others as he levels. What you will probably observe is that he will prefer magic at high levels unless an enemy is right next to him. Unlike some of the pansy followers in the game, he will rarely run away from combat.",
  "categoryId": "96",
  "version": "",
  "author": "BlackLightning",
  "createdUnix": "1500860177",
  "updatedUnix": "1500860409",
  "containsAdultContent": false,
  "uploadedBy": "storm31337",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000250140",
      "name": "WhiteThunder Follower",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "WhiteThunder Follower-85524-.rar",
      "uploadedUnix": "1500860409",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/bb309bc5de3051824230217e13e283b7805bffe4983179a685a7f8ebd155550c/analysis/1500860642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/WhiteThunder%20Follower-85524-.rar?fid=1000250140&ttl=1535874352&ri=8192&rs=8192&setec=ca20523e76e8f2f630508e1d58a7af95"
    }
  ]
}