{
  "modId": 85538.0,
  "modName": "Save 881990 - Cracked Tusk Keep 2017 Starter Save Game",
  "summary": "Skyrim Xbox 360 Game Save. Uses Cracked Tusk Keep as a starter home, storage and crafting. Complete with Change Race Menu at beginning and heaps of hidden gold and better and better items as you search in and around the Keep. Special Wall Map inside of the Keep with working Doors to major areas. There is also a hidden door to a room full of just ab",
  "descriptionHtml": "[color=#ffffff][font=Calibri]I&#39;m ShamanReaper57 and this is my latest SkyrimGameSave, Cracked Tusk Keep Starter 2017. \r<br />I created this GameSave using the PC version of Skyrim only using Keyboard Commands and \r<br />using only whats available in Vanilla Skyrim so this is not a Modded Save using the Creation Kit. \r<br />So in theory as you progress through the game you will get all of the normal\r<br />Achievements and gameplay stats and not have any restrictions. I created this Save using \r<br />Cracked Tusk Keep because it had alot of stuff going for it from the beginning. Smithing area,  \r<br />Alchemy Station, Walls, Towers, Mutiplelevels, Storage Containers and just a great place and \r<br />location to hang out in the beginning of the Game. My vision for the Save was to create a place \r<br />for a new Character to use as a Home, have plenty of Safe Storage, have plenty of\r<br />supplies and materials available to encourage Crafting and Smithing straight\r<br />away, have gold stocks available, provide plenty of areas to explore and\r<br />discover useful items, and make it fun to get straight into the Game.[/font][font=Calibri]From previous experience \r<br />and personal preferenceI restrained myself from supplying high value items because I feel that having\r<br />every item in the game and playing in God mode all of the time gets boring. I\r<br />love the adventuring, exploration and fighting for what you want which makes\r<br />the game more interesting. At the same time I also wanted to cut down on the\r<br />hard slog of gathering ingredients, fast travelling hundreds of times and\r<br />swinging  tools  for hours to get materials. So I havesupplied alot of these items to get the show on the road. \r<br />\r<br />You choose and create your own Character as soon as you enter Cracked Tusk Keep. Your starter\r<br />character will start at level 3, basic stats, blank inventory wearing, well not\r<br />much. I have given the character 1000 Carry Weight to start with and some extra\r<br />perk points. Once you get inside Cracked Tusk Keep, everything else will be\r<br />yours to find and keep. This Save is about the Power of Choice so it&#39;s up to\r<br />you to have fun choosing what you want to do.[/font][font=Calibri]My Save starts at the front door of Cracked Tusk Keep. \r<br />You have already escaped Helgen and your new starting point will be at\r<br />Cracked Tusk Keep after you have sorted your Character, armoured up, grabbed\r<br />weapons and supplies, explored the Keep and are ready to go. The rest of the\r<br />game remains the same, go to Riverwood then make your way to Whiterun. Or you\r<br />may just want to hang around the Keep and do some Crafting or Smithing and\r<br />create a better equipped &#34;Super Character&#34;, which is quite possible.\r<br />No limitations&#33; Once you enter Cracked Tusk Keep you will get the Character\r<br />Race Menu. Choose, create and name your Character and you are ready to check\r<br />out the Keep.\r<br />\r<br />\r<br />Character Stats: Health - Magicka - Stamina (just above basic)\r<br />                              Skill Trees (All Basic starter 15/20)\r<br />                              Added 52 extra Perks\r<br />                              All normal Starter Spells\r<br />                              Started Carry Weight at 1000\r<br />\r<br />Although your Character will be starting with Basic stats, the amount of items that  I have stocked \r<br />( gold, materials, books, armour, weapons and other special equipment) will ensure that you have plenty of opportunity \r<br />to get a really good start. All you have to do is find everything and use your creativity and wits. Please read the text file\r<br /> included in the game files for detailed information.\r<br />\r<br />Please enjoy\r<br />ShamanReaper57\r<br />[/font][/color]",
  "categoryId": "70",
  "version": "v1",
  "author": "ShamanReaper57",
  "createdUnix": "1500889819",
  "updatedUnix": "1500816690",
  "containsAdultContent": false,
  "uploadedBy": "ShamanReaper57",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000250167",
      "name": "Save 881990 - Reggy57 Skyrim 173.41",
      "version": "v1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2908",
      "fileName": "Save 881990 - Reggy57 Skyrim 173.41-1-v1.zip",
      "uploadedUnix": "1500816690",
      "modVersion": "v1",
      "virusScanUrl": "https://www.virustotal.com/file/0275a757e3aa653e29aef4612f55e6566fd461d4f716a60ef8e8a7474e9ab165/analysis/1500816768/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Save%20881990%20-%20Reggy57%20Skyrim%20173.41-1-v1.zip?fid=1000250167&ttl=1535874369&ri=8192&rs=8192&setec=4b2c5fe034c6580e1de214671684f96d"
    }
  ]
}