{
  "modId": 85539.0,
  "modName": "Nilzaar",
  "summary": "Nilzaar, Dovahzul for Purgatory. You must seek out a Dremora Lord located in Nightgate Inn. He will activate a series of 7 quests that are part of the Questline &#34;Nilzaar.&#34;",
  "descriptionHtml": "[b]Warning&#33; ::[/b] If you have not completed the main questline, [b]DO NOT [/b]start this questline&#33;\r<br />To activate the questline, you must visit [i]Rut[/i], a Dremora Lord located in[i] Nightgate Inn[/i], west of[i] Windhelm[/i]. This questline will contain multiple types of foes such as Corrupted Souls and Dragon Priests. The main boss in this action packed, 7 quest questline is a dragon named [i]Pentaarik[/i], or Punisher. There are two new shouts in this mod, &#34;[i]Bel Olqienus Pentaarik[/i]&#34;. This shout allows you to summon the Skeletal form of Pentaarik. Once you summon him, he will fight for you, and if you ride him, he will take you to [i]Sovngarde[/i]. The second shout is &#34;[i]Viir Joor Ahkos[/i]&#34;. This shout will cause your enemies to disintegrate if they are non-human, such as trolls, draugr, and giants. Vampires and werewolves are considered human.\r<br />[u][b]Words of Power[/b][/u]\r<br />Ahkos - Existence: Found in &#34;[i]Nilzaar[/i]&#34; during the quest &#34;[i]To Betray The Voice[/i]&#34;\r<br />Bel - Summon: Found in &#34;[i]Sizaan Bodein[/i]&#34;, during the quest &#34;[i]Released From Punishment[/i]&#34;\r<br />Joor - Mortal: Found in &#34;[i]Deytaan Vost&#34; during the quest &#34;Bound by chains&#34;[/i]\r<br />Olqienus - Skeletal: Found in &#34;[i]Sizaan Bodein[/i]&#34;, during the quest &#34;[i]Released From Punishment[/i]&#34;\r<br />Pentaarik - Punisher: Found in &#34;[i]Sizaan Bodein[/i]&#34;, during the quest &#34;[i]Released From Punishment[/i]&#34;\r<br />Viir - Cease: Found in &#34;[i]Vahlut haal do Pentaarik[/i]&#34; during the quest &#34;[i]Mindah[/i]&#34; (Knowledge)\r<br />\r<br />[u]Defeating Pentaarik\r<br />[/u]During &#34;Released From Punishment&#34;, you will use the shout &#34;[i]Viir Joor Ahkos[/i]&#34;, or &#34;[i]Incinerate[/i]&#34; to destroy the &#34;Black Door&#34; blocking your path. you will enter the large, open mountainous area in the southwest region on Skyrim (only accessible during quest). This area is &#34;[i]Sizaan Bodein[/i]&#34;, or &#34;[i]Lost Vigil[/i]&#34;. There you will see Pentaarik flying around a portal, similar to the one that teleports to to Sovngarde in the main questline. You will fight 3 named dragon priests at once before you may confront Pentaarik. Once you confront him you will fight him like you would a normal dragon. Once you defeated him, he will say \r<br />&#34;You fool, no one can defeat me but another of the true dragon blood.&#34; At this point, use the disintegrate shout on him. He will yell &#34;No, Dovahkiin&#33;&#34; and disintegrate like any dragon would. Then simply walk to the Word Wall and learn the shout to summon him. After that, you may leave by accessing the portal that will lead you back in time to where you are about to be executed in Helgen. When Alduin attacks, you will escape Helgen and summon Pentaarik to travel to Skuldafn again to defeat Alduin again during the quest called &#34;Time Repeating&#34;. Instead of teleporting you back to Tamriel (Skyrim), it will teleport you back into the future to the Nightgate Inn. Talk to Rut and he will give you a full set of  Dragonbone armor and a dragonbone sword named &#34;Duaan&#34;, or &#34;Devourer&#34;. You will also be recognized by the Greybeards, the Blades, and the Jarls of Whiterun, Solitude, and Windhelm for your service. You are also recognized by all members of the &#34;Hall of Valor&#34; and the Greybeards for killing Alduin twice.",
  "categoryId": "2",
  "version": "V1.0",
  "author": "Felix Jace Benjamin",
  "createdUnix": "1500628020",
  "updatedUnix": "1500628020",
  "containsAdultContent": false,
  "uploadedBy": "Vokun22",
  "primaryFile": null,
  "files": []
}