{
  "modId": 85658.0,
  "modName": "HiveMaster",
  "summary": "Craft and summon insect minions to attack your foes. Includes themed weapons, spells, and more&#33;",
  "descriptionHtml": "Have you ever wanted to command a zerglike army of minions in Skyrim?\r<br />No? That&#39;s just me? Oh...\r<br />Well...\r<br />\r<br />Now you can anyway&#33;\r<br />\r<br />This mod was inspired by the craftable albino spiders added by the Dragonborn expansion, but takes things in a completely different direction. It adds several &#39;scrolls&#39; craftable at special workbenches that can be used to summon a variety of specialized insectoid minions. The number of minions you can summon is based on your level, and they grow more powerful as your crafting skills improve.\r<br />\r<br />This mod also adds:\r<br />Swarm themed spells and abilities\r<br />Several thematic craftable weapons with unique capabilities\r<br />Craftable pieces of armor that use extra slots and can be used along side vanilla armor\r<br />New mod related alchemy ingredients\r<br />New mod related enchantments\r<br />A &#39;nest&#39; where the custom workbenches are located (a permanent door is located in Whiterun)\r<br />Summonable doors that give access to the nest from anywhere.\r<br />And more&#33; (Details in the FAQ)\r<br />\r<br />Requirements:\r<br />Skyrim (obviously)\r<br />Dawnguard\r<br />Dragonborn\r<br />(I kept the requirements to a minimum on purpose.)\r<br />\r<br />Things Still To do: I&#39;d really like to animate the claw grafts. I&#39;d also like to switch the &#39;chrysalis&#39; models I used for the minion inventory and in hand graphics  for a model that looks like the actual minion. Animated wings on the mystics would also be nice. Unfortunately, I have yet to successfully animate a custom model or even edit an animated model. If anyone can help me with that I&#39;d appreciate it. The only 3d modeling program I have is Blender.\r<br />The outer nest could use a little more decorating.\r<br />\r<br />Optional: There is an optional file that adds a &#39;cheat&#39; merchant who sells all the vanilla items you need for this mod. You can find her hanging out in the Bannered Mare in Whiterun.\r<br />\r<br />Incompatibilities:\r<br />This mod does not touch any of the vanilla resources, and thus should be compatible with almost anything.\r<br />It does add a door under the bridge in Whiterun, and might be incompetible with anything that changes that location. &#39;Open city&#39; mods may make the nest inaccessible.\r<br />\r<br />Changelog: \r<br />v1.01\r<br />Fixed a bug that caused the emerald mystic&#39;s aoe attacks to one shot kill enemies\r<br />Player attacks and damaging spells should no long harm minions both in and out of combat.\r<br />\r<br />\r<br />Usage stuff:\r<br />You can use any of the resources I created for this mod without permission as long as you give me credit for creating them.\r<br />You are welcome to create and post alternate resources (such as alternate textures, meshes, or the like). You are also welcome to make &#39;addons&#39; for this mod. If you let me know about it, I&#39;ll add a link to it in this description.\r<br />Please do not change or upload this mod itself without asking first.\r<br />\r<br />Credits and thanks:\r<br />Bethesda for making Skyrim\r<br />ReDragon2013 for fixing the portal summoning script\r<br />lofgren an IsharaMeradin for help with quest scripting\r<br />The nifskope people\r<br />http://spiralgraphics.biz for some of the textures\r<br />fore of new idles fame. I didn&#39;t use what he helped me with in the end, but it helped me figure out some things I used latter.\r<br />The makers of more tutorials, guides, utilities, tools, and wiki pages than I can remember.\r<br />The modding community in general. You guys are all awesome&#33;",
  "categoryId": "65",
  "version": "1.01",
  "author": "Khulse",
  "createdUnix": "1501222548",
  "updatedUnix": "1502540931",
  "containsAdultContent": false,
  "uploadedBy": "khulse",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000250498",
      "name": "HiveCheatMerchent",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "HiveCheatMerchent-85658-1-0.zip",
      "uploadedUnix": "1501222514",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/55c78e413fb3a8b550a38d65fa92a978f0d9b0823e606687520bb5c76079bda0/analysis/1501222742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HiveCheatMerchent-85658-1-0.zip?fid=1000250498&ttl=1535874504&ri=8192&rs=8192&setec=a7376eeb71067c7cc669e75b4a0c811e"
    },
    {
      "fileId": "1000251688",
      "name": "HiveMaster",
      "version": "1.01",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "71514",
      "fileName": "HiveMaster-85658-1-01.zip",
      "uploadedUnix": "1502540931",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/b0a0af11b860f0a080b79f14ed832583ec860a1a5146f155024761d29f602b2f/analysis/1502541132/",
      "changelogHtml": " Fixed a bug that caused the emerald mystic&#39;s aoe attacks to one shot kill enemies <br/> \n Player attacks and damaging spells should no long harm minions both in and out of combat. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/HiveMaster-85658-1-01.zip?fid=1000251688&ttl=1535874504&ri=8192&rs=8192&setec=6c984db2ba938f6d2865ff9df85033a6"
    }
  ]
}