{
  "modId": 8583.0,
  "modName": "The Ashen Race - HD",
  "summary": "Adds a new custom race based on RadioRagae\\'s \\\"Oriental Beauty Women And Men Mod\\\" with many new face options such as a whole new face texture, more eyebrows, eyes and new makeup styles. Ideal for every type of player class. Now in HD!",
  "descriptionHtml": "[center][img]http://i.imgur.com/kcf3y.png[/img][/center]\r\n\r\n[b][i]The Ashen - Standalone Custom Race for TES V: Skyrim by Seren4XX and RadioRagae\r\nVersion 2.6 based on the \\\"Oriental Beauty Mod Women and Man Mod\\\" v4.1 by RadioRagae. Female and Male version.[/i]\r\n\r\nTry to check the Announcements down below every now and then for up-to-date news about aspects of the mod. [color=red]4-12-2012: To keep the race\\'s Vampire and Werewolf abilities working download the latest RaceCompatibility updates at [url=http://skyrim.nexusmods.com/mods/24168]RaceCompatibility for Dawnguard plus vanilla version upgrades[/url] for full Dawnguard, Vampire and Werewolf support.[/color][/b]\r\n\r\n[center][img]http://i.imgur.com/FmTlk.png[/img][/center]\r\n\r\n[center][size=3][color=teal]\r\n[b][i]* Well-tested Custom Race with lots of custom assets and its own unique style. You can either make a realistic yet beautiful character or a more unrealistic one.\r\n\r\n* Includes custom-made CharGen morphs by RadioRagae for more smooth faces\r\n\r\n* The race includes its own separate body and all included textures are [u]HD[/u]. Have a body type that is separated from the other NPCs and switch to another whenever you want!\r\n\r\n* More than [u]46[/u] eyes to choose from! A lot of them have also been mixed-and-matched  so you can have two different eye colors! \r\n\r\n* 38 New eyebrows to choose from.\r\n\r\n* Besides the original vanilla warpaint you can also choose from 15 beautiful new custom warpaint types.\r\n\r\n* 8 Revamped new presets that function as good base to make your own character from.\r\n\r\n* Working Vampires (also Dawnguard!), Werewolves and Mounted Horse Combat![/i][/b]\r\n[img]http://img801.imageshack.us/img801/2184/modpageashenv25dgv3nuva.png[/img]\r\n[/size][/color][/center]\r\n\r\n[center][size=3][color=teal][b][i]Unique Ashen follower by Zzjay available!\r\n[url=http://skyrim.nexusmods.com/mods/22346][img]http://img69.imageshack.us/img69/5117/zzjayfollower.jpg[/img][/url][/i][/b][/color][/size]\r\n[url=http://skyrim.nexusmods.com/mods/22346]Click for follower mod page[/url]\r\n\r\n[size=3][color=teal][b][i]Also available for The Ashen:[/i][/b][/color][/size][/center]\r\n\r\n[center][url=http://skyrim.nexusmods.com/mods/24154][img]http://imageshack.us/a/img819/6808/ashencutedesignsbanner1.png[/img][/url]\r\n[url=http://skyrim.nexusmods.com/mods/24154]Click for Cute Designs mod page[/url]\r\n[/center]\r\n\r\n[center][img]http://i.imgur.com/AFYST.png[/img][/center]\r\n\r\n[center][size=4][color=blue][b][i]Thanks for all the downloads, comments and images everybody! You\\'re the best.[/i][/b][/color][/size][/center]\r\n\r\n[center][b][i]My thanks go out to Narphous for being so generous as to gift me the Dawnguard expansion over Steam!!! Thanks to him I was able to update the mod for Dawnguard.[/i][/b][/center]\r\n\r\n[color=red][b][i]Added a Vampire section to the Recommended Mods part of the mod page. Includes a mod that removes sunken cheeks on vampire characters![/i][/b][/color]\r\n\r\n[b][u]Upgrading from The Ashen V2.0?[/u] Read this![/b]: If you\\'ve already installed the new version, you have probably noticed your character\\'s face doesn\\'t look like it did before. Better or worse. This is because I have used new CharGen morphs and are meant to make your character look better. If your character does not have his/her desired look, then go to the Recommended section and download \\\"Show Race Menu Options\\\". With this mod you can safely and quickly edit your character to look in top shape again!\r\n\r\nOn request I have uploaded a version that uses V2.0\\'s old head mesh for those who are with their Ashen character\\'s appearance as it is. Has all the benefits of 2.6, except for the new appearance of the head.\r\n\r\n[b][i][color=red][u]Dawnguard-only Notice:[/u][/color][/i][/b]\r\nThe Ashen HD 2.6 offers 100% integration with Dawnguard vampires! If you wish to use Better Vampires or continue using it then you are required to re-install Better Vampires after updating The Ashen to 2.6 and THEN applying the latest RaceCompatibility version for Better Vampires (Link is at the top of this page!).\r\n\r\n[b][size=3]Tips that will increase the chance the race loads 100% as it should down below!\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^[/size][/b]\r\n\r\nI also know of a way to ensure you can start a new game with this race and even later on edit your character without experiencing nasty crashes:\r\n1) Download [url=http://skyrim.nexusmods.com/mods/17071]\\\"Sex change crash Workaround\\\"[/url] to ensure your game won\\'t crash when switching from male to female. Use ONLY for female characters.\r\n2)Use [url=http://skyrim.nexusmods.com/mods/20092]\\\"Show Race Menu Options\\\"[/url] if you want to be able to edit your character later on with a lower risk of crashing and messing up your character\\'s stats. =)\r\n\r\nI also discovered that it\\'s best to wait 30 seconds before switching the race to Ashen or you could have missing body parts such as hair or eyes. What I usually do is that I go to the hair section of the default starting character and move around some sliders to ensure the game will load it for The Ashen as well. Take your time and the race will load entirely! ;)\r\n[size=3][b]^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^[/b][/size]\r\n\r\n[u]A tip provided by Naltaz if you want to edit your character later on[/u]:\r\n[quote]\r\n1. Load your save\r\n2. Go to an Interior. (Preferably player\\'s house without followers)\r\n3. Quicksave\r\n4. Quickload\r\n5. Zoom Out in 3rd person and face your character.\r\n6. Use Showracemenu Alternative mod/Show Race Menu Options mod/showracemenu command.[/quote]\r\n\r\n[u]Vanilla body notice:[/u] The vanilla version doesn\\'t exist anymore. If you\\'re using a prior vanilla version of the race you have to rename the plugin (OrientalRace.esp) to OrientalRace - Vanilla.esp to ensure your character won\\'t be missing his/her head.\r\n\r\n[center][img]http://i.imgur.com/ZanM8.png[/img][/center]\r\n\r\n\tThe Ashen are a small race of people who live scattered throughout Tamriel. It is said that The Ashen originate from the Akaviri homeland from which they fled, fearing Tsaesci enslavement. \r\n\tMost of them live in secluded areas of the land in relative peace away from the troubles of the world. It is unsure how many of them live in modern society due to the fact that they look a lot like other humanoid races. Most of them prefer to keep their identity a secret to prevent any unwanted attention.\r\n\tLegend has it that the Ashen have regenerative capabilities that surpass that of all other races which enables them to recover from most wounds with decreased scar tissue and gives them their youthful appearance. Having their body in top shape at all times make The Ashen very capable fighters and are known to have reflexes that surpass that of most other races.\r\n\r\n\t\r\n\tThis is RadioRagae\\'s beautiful race replacer made into a separate custom race so you can enjoy it\\'s aesthetically pleasing looks without changing the look of every NPC in Skyrim.\r\n\tIn this release you will find one race named \\\"Ashen\\\" which has a unique variant for both the female and male variant.\r\n\tAvailable to you are a set of presets so you can easily make a beautiful character; male or female.\r\n\tFor your character\\'s face you can choose the regular vanilla options plus new custom HD material consisting of 46+ of RadioRagae\\'s new eyes, 38 eyebrows, 8 types of warpaint and revamped makeup added on top of those.\r\n\r\n\tBase Stats:\r\n\r\n\tOne-handed +10\r\n\tConjuration +5\r\n\tBlock +5\r\n\tDestruction +5\r\n\tLight Armor +5\r\n\tRestoration +5\r\n\r\n\tTotal Skill Bonus = 35 (Just like vanilla races)\r\n\r\n\tRace perks:\r\n\r\n\tHealth Regeneration: Outside of combat you regenerate your health more than twice as fast than other Tamrielic races. Despite this, health is not recovered faster than Stamina in this state.\r\n\r\n\tReflex - Daily power: Time slows around you for 12 seconds and regenerates stamina for 7 seconds (nearly a full bar) thanks to your heightened reflexes.\r\n\r\n[center][img]http://i.imgur.com/TAuYW.png[/img][/center]\r\n[center][size= 3][b][color=teal]Ashen-related Mods and/or Saves[/color][/b][/size]\r\n-------------------[/center]\r\n [url=http://skyrim.nexusmods.com/mods/16906][img]http://img341.imageshack.us/img341/6861/aelisbwheader2.jpg[/img][/url]\r\n-  [url=http://skyrim.nexusmods.com/mods/16906]Ashen V2 Follower - Aelis Blackwatch by thekineticeffect[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/14281]Oriental Housecarl Replacer by MC[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/24581]Falada Firefly Ashen V2.6 characters[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/18626]Aya - Nord or Ashen female Level 2 Save File by Alstar80[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/18133]Freyja Ashen Race by NuclearFuzion (Save file)[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/12946]The Ashen Beauty - Valkyria Dragonborne -Tifa like char by xp32[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/10485]Miyuki - Ashen Assassin by Lestatt Gaara (Save File)[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/9837] Hiroku Level 1 Ashen Race Female with Perks by FalmerBane[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/18629] Ashen Race - Raven by jc1977 (Save File)[/url]\r\n\r\nSome save files show an older version, before the HD version for instance so a character can actually look better with this version.\r\n\r\n[center][size= 3][b][color=teal]Recommended Vampire Mods[/color][/b][/size]\r\n-------------------[/center]\r\n- [url=http://skyrim.nexusmods.com/mods/9717/]Better Vampires[/url] (Offers great gameplay additions and makes Dawnguard vampire work)\r\n- [url=http://skyrim.nexusmods.com/mods/22522]Female Vampires have fangs[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/22477]No Sunken Vampire Faces for The Ashen V2.5[/url] by Azarathkhan for the regular version (BFG)\r\n- [url=http://skyrim.nexusmods.com/mods/22477]No Vampire Sunken Face for ECE and vanilla males[/url] (Great if you are using ECE with the Vanilla Head version of the race)\r\n- [url=http://skyrim.nexusmods.com/mods/16506]Vampire No Sunken Cheeks[/url] (For if you\\'re using the Vanilla Head version with no other head chargen mods)\r\n\r\n[center][size= 3][b][color=teal]Recommended Additional Mods[/color][/b][/size]\r\n-------------------[/center]\r\n- [url=http://skyrim.nexusmods.com/mods/17071]Sex Change Crash Workaround[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/20092]Show Race Menu Options[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/20394]Showracemenu Alternative[/url] (For switching from another race to this one, else I recommend Show Race Menu Options)\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=10168]ApachiiSkyHair[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/18110]Hair packs of TES IV: Oblivion[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/17993]Hair packs of Fallout 3[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/19623]Cazy hairs and demoness hairs conversion by zzjay[/url]\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=7403]Lovely Hairs by zn00p[/url]\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=2356]Xenius\\' Character Enhancement (to make the vanilla parts HD)[/url]\r\n- [url=http://skyrim.nexusmods.com/mods/21082]XCE - Brows[/url](To make the vanilla brows beautiful HD)\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=6923]Extended Color Slider Patcher (For more color variations!)[/url]\r\n- [url=http://skyrim.nexusmods.com/downloads/file.php?id=11064]The Skeleton of Female Models (Better proportions for female bodies and fixes sheathed weapons clipping)[/url]\r\n\r\n[center][img]http://i.imgur.com/0UQUA.png[/img][/center]\r\n\r\n- A legal copy of The Elder Scrolls V: Skyrim (Patch 1.6 or up recommended)\r\n \r\n[center][img]http://i.imgur.com/xsNRD.png[/img][/center]\r\n\r\n\t- \tFor installation using the Nexus Mod Manager (NMM) begin by choosing your preferred female body type in the main files list.\r\n\t\tYou can download the archive for use with the NMM using the \\\"Download with manager\\\" button in the files section below the file you require.\r\n\t\tOnce it is downloaded you can install the mod by using the button that says \\\"Activate selected mod\\\" under the \\\"Mods\\\" tab in the NMM. \r\n\t\t\r\n\t-\tDo a manual install by following these steps:\r\n\t\tOpen the archive and drag the included folder named \\\"data\\\" to your skyrim folder which is normally found in C:\\\\Program Files (x86)\\\\Steam\\\\steamapps\\\\common\\\\skyrim. Choose \\\"Yes\\\" when asked to merge the folders.\r\n\t\tActivate the OrientalRace.esp and RaceCompatibility.esm files through either the Skyrim launcher under \\\"Data Files\\\" or activate the mod with the Nexus Mod Manager (NMM).\r\n\r\n[center][img]http://i.imgur.com/Tt0jk.png[/img][/center]\r\n\r\n- For some installations the script does not get activated properly. This can cause a multitude of bugs such as:\r\n  * Vampire and/or Werewolf transformation not functioning correctly\r\n  * No additional hair showing up\r\n  * Missing parts of the head or the head itself\r\n  * The fixed DB quest not working\r\n  \r\nYou can usually fix these problems by opening your console in-game (tilde-button: ` ) and typing these two separate commands:\r\nstopquest OrientalRaceController\r\nstartquest OrientalRaceController\r\n\r\nThis is preferably done in an interior that has nothing to do with the DB quest that was fixed.\r\n[center]-------------------[/center]\r\n\r\nFor anyone experiencing problems regarding dialogue that is race restricted or mentions this race I would like to redirect you to [url=http://skyrim.nexusmods.com/downloads/file.php?id=10165]expired6978\\'s Race Compatibility page[/url] and submit the error in the following format:\r\n\r\nRacial Dialogue\r\nThe NPC who spoke the dialogue\r\nThe line spoken \r\n\r\n[i][url=http://skyrim.nexusmods.com/downloads/file.php?id=10165]Expired6978\\'s Race Compatibility plugin[/url] is the most extensive and best way to make sure custom races are compatible with eachother. To any modders who are reading this, I strongly suggest to use it for your custom race as well for a better user experience through one unified system. It\\'s simply the best option.[/i]\r\n\r\n[center][img]http://i.imgur.com/BRTZ9.png[/img][/center]\r\n\r\nQ: \t[b]Can I use this custom race along with the Better Vampires mod?[/b]\r\nA: \tYes, but make sure to install Better Vampires after this race and use the \\\"Use Custom Race\\\" option in Better Vampires. \r\n\tIt can be accessed with the {Customize or Reset Better Vampires Mod} at the bottom of your Powers to set variables and reinfect your customized race with vampirism. \r\n\tYou will be able to play my mod as a customized race and enjoy all of the abilities and powers! Use the \\\"Reset Better Vampires\\\" menu option to remove this change.\r\n\r\nQ: \t[b]I decided to switch from vanilla to ADEC/CBBE/CHSBHC/UNP/UNPB and now my character doesn\\'t show up in-game. What do I do?[/b]\r\nA: \tAfter having installed the correct version for your new body-type go and rename the OrientalRace.esp to OrientalRace - Vanilla.esp. Your character should show up again.\r\n\r\nQ: \t[b]How can I switch my current character\\'s race to Ashen without resetting skills, or stats:[/b]\r\nA: \tUse the [url=http://skyrim.nexusmods.com/mods/20394]\\\"Showracemenu Alternative\\\"[/url] mod.\r\n\r\nQ: \t[b]Why won\\'t the extended color slider mod work with this race?[/b]\r\nA: \tYou will need to download the Extended Color Slider Patcher and patch this race.\r\nDownload it here: http://skyrim.nexusmods.com/downloads/file.php?id=6923\r\n\r\nQ: \t[b]I\\'m missing parts that should work for the race. OR A race-specific portion of a quest is bugged, while you said that was fixed.[/b]\r\nA: \tThe script that adds/fixes it must have gotten bugged somehow. Use the following console commands to stop and start it to fix it.\r\nstopquest OrientalRaceController\r\nstartquest OrientalRaceController \r\n\r\nQ: \t[b]My game will freeze or even crash when I try to load the race in the character menu.[/b]\r\nA: \tYour game freezing when loading the race is normal. The game must load new assets and a couple of scripts that prevent conflicts will start to apply. However, if your game crashes it may mean that you don\\'t have enough RAM memory left, either because your computer doesn\\'t have a lot of it or because Skyrim has a lot of mods loaded (especially HD ones will contribute to the problem). Try switching off some heavy mods temporarily (ENB included), make your character and save it before turning the mods back on.\r\n\r\nTIP!: Use showracemenu in-doors. It will load way faster because there isn\\'t so much scenery.\r\n\r\nQ: \t[b]What hair mods are used in some of the screenshots?[/b]\r\nA: \tThe only ones I know so far are:\r\n        - Apachii Skyhair\r\n\t- Lovely Hair Styles\r\n\t- My Type Of Hair\r\n        - Numenume Hair\r\n\r\nQ: \t[b]I just checked the CK and your race isn\\'t added to all the necessary FormLists to get hair working![/b]\r\nA: \tWrong! The scripts add the race to those Forms dynamically to prevent conflicts with other mods.\r\n[color=red][u]Don\\'t[/u][/color] manually add the race to those FormLists to prevent conflicting mods!!!\r\n\r\nQ: \t[b]I\\'m getting texture seams. What should I do?[/b]\r\nA: \tCheck whether you\\'ve downloaded and installed the right variant of this mod. Also check whether you are indeed using the right body mod (feet and body mesh).\r\n\r\nQ: \t[b]I used the \\\"showracemenu\\\" command in the console to change my character to your race and I\\'m experiencing problems.[/b]\r\nA: \tDon\\'t use showracemenu and just make a new character. For example it messes up your stats and it also makes the werewolf transition not work properly. \r\n\r\nQ: \t[b]I\\'m using a mod that adds armor/clothing/necklaces/rings and some of them don\\'t show up![/b]\r\nA: \tThat mod\\'s author probably did not include the Default Race to the list of races that can use his/her mod. Contact the author for a fix or do it yourself in the CK by going to\r\nItems->ArmorAddons and look for pieces that belong to the mod. Open such an item and on the right-hand you\\'ll have a list of valid races. Click the race called \\\"DefaultRace\\\", press OK and save.\r\nNow it should work.\r\n\r\n[center][img]http://i.imgur.com/MoIXZ.png[/img][/center]\r\n\r\nTo uninstall the mod with the Nexus Mod Manager go to the \\\"Mods\\\" tab and select this mod. Choose \\\"Deactivate Selected Mod\\\".\r\n\r\nTo uninstall the mod manually disable the OrientalRace.esp and RaceCompatiblity.esm and remove the following folders from your skyrim/data folder:\r\n- skyrim/meshes/actors/character/Oriental\r\n- skyrim/textures/actors/character/Oriental\r\n\r\n- Also delete the OrientalRace.esp and RaceCompatibility.esm files in skyrim/data.\r\n\r\n[center][img]http://i.imgur.com/KpKPe.png[/img][/center]\r\n\r\nV2.6\t- Dawnguard Versions have updated scripts for the RaceCompatibility part of the mod. Should offer 100% integration with Dawnguard!\r\n\t- Fixed CBP and Vanilla Head version to use correct specular map textures.\r\n\r\nV2.5 (Before: 2.1)- Mounted Horse Combat has been fixed \r\n\t- 15 custom warpaint added on top of vanilla ones \r\n\t- better texture for the female lips\r\n\t- Dawnguard fix provided, remaining as optional download for now\r\n\t- BFG implemented for better-looking characters and easier character generation\r\n\t- Presets revamped to give a much better base look\r\n\t- Contains own custom body and skeleton now\r\n\r\nV2.0 - Race is now mostly [u]HD[/u]. A lot of parts have been replaced with better versions. 32 New eye textures which are also mixed to get combo\\'s of them. 7 New Eyebrows added. Included ADEC version. Fixed a skin reference that got reset. Updated males slightly. Better CK IDs in some cases.\r\n\r\nHotfix #2 for V1.1c - Same as Hotfix #1, but better and the Dark Brotherhood quest that requires your character to be a vanilla race has been fixed. You\\'ll be called a Breton at that point.\r\n\r\nHotfix #1 for V1.1c - Removed custom warpaint to ensure all chosen make-up remains after saving.\r\n\r\nV1.1c - Included a better fix for the vampire/werewolf/hair problem thanks to expired6978 of the \\\"Extended Color Slider Mod\\\". CHSBHC support added. French translation available \r\n\r\nHotfix #2 for V1.1b - Makes Reflex last 10 seconds instead of 3. Adds more compatibility with hair mods such as MTOH.\r\n\r\nHotfix #1 for V1.1b - Corrects some issues with the face textures.\r\n\r\nV1.1 - \tThe female variant of the race has received an additional 9 eyebrow textures, making a total of 18 new eyebrows. The first 12 eyebrows in your character generation, the last making your character have no brows, are vanilla eyebrows and the next 18 are the new ones.\r\n\t\tThere are also 6 new eyebrows added for the male variant.\r\n\t\r\n\t\tBase race perks changed:\r\n\t\t\t- Adrenaline rush is now Reflex: a daily power that enables slows time around you for 3 seconds and regenerates stamina for 7 seconds (nearly a full bar) for those tight situations.\r\n\t\t\t- The magic resistance of 25% has been changed to a health regeneration that is more than twice as fast, but still not faster than your stamina bar regenerates.\r\n\r\n\t\tElven eye and nose forms have been removed from the race as they looked very awkward.\r\n\r\n\t\tContrary to what I believed, the texture paths in the femalehead.nif did need a change to work properly. It would sometimes mix up textures causing neck seams. This is now fixed.\r\n\t\t\r\n\t\tSeveral new presets.\r\n\r\n\t\tThe head texture now fits seamlessly on the body texture! :)\r\n\r\n\t\tNecklaces and rings can now be equipped normally again! They don\\'t stack anymore and they DO show up.\r\n\r\n\t\tWerewolf and Vampire transformations are fixed.\r\n\r\nV1.0 - \tAdded a new custom race called \\\"Oriental\\\" that adds a race that uses textures and a mesh from RadioRagae\\'s \\\"Oriental Beauty Women and Man Mod\\\".\r\n\tFirst version features the addition of new cheek tintmasks, eyebrows, eyeliner styles, eyesocket textures, eyes and lips. Later version will probably include RadioRagae\\'s new warpaint as well.\r\n\r\n[center][img]http://i.imgur.com/Tbb5H.png[/img][/center]\r\n\r\nMany thanks to:\r\n- Bethesda Softworks for Skyrim and the Creation Kit\r\n- RadioRagae for the face textures and everything concerning the head of your character including BFG\r\n- Won-bin for his male textures\r\n- RAN46 for his head mesh\r\n- Caliente for his CBBEv3 body, its textures and TexBlend (Original link: http://skyrim.nexusmods.com/downloads/file.php?id=2666)\r\n- Dimon99 for his DIMONIZED UNP(B) body and textures textures (Original link: http://skyrim.nexusmods.com/downloads/file.php?id=6709)\r\n- Calyps for his UNPB variant of the UNP body (Original link: http://skyrim.nexusmods.com/mods/14899)\r\n- Acdale for the ADEC body and its textures (Original link: http://skyrim.nexusmods.com/mods/5390)\r\n- Cherry Hotaling for the CHSBHC body (Original link: http://skyrim.nexusmods.com/mods/4888)\r\n- XP32 for BBP\r\n- Expired6978 for providing me a better fix for the vampire/werewolf transformation and the problem with hair not showing up\r\n- TMPhoenix for his update for Race Compatibility to fully support Dawnguard\r\n- Everybody who has pointed out bugs and suggestions for improvement\r\n- Anyone else I might have not credited accidentally ",
  "categoryId": "34",
  "version": "2.6DG",
  "author": "Seren4XX and RadioRagae",
  "createdUnix": "1328828476",
  "updatedUnix": "1349374568",
  "containsAdultContent": false,
  "uploadedBy": "Seren4XX",
  "primaryFile": null,
  "files": [
    {
      "fileId": "79832",
      "name": "The Ashen HD V2_5- ADEC",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "49675",
      "fileName": "The Ashen HD V2_5- ADEC-8583-2-5.rar",
      "uploadedUnix": "1344457121",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/a91d86af84efaf99706d75e9e3fb64be1b01f1c303e70b2785b6fdfae334d3e4/analysis/1407080474/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_5-%20ADEC-8583-2-5.rar?fid=79832&ttl=1535767438&ri=8192&rs=8192&setec=6f6f310402b26ef3db26eb1c9ab13ba0"
    },
    {
      "fileId": "79833",
      "name": "The Ashen HD V2_5- CBBEv3 Slim",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "54488",
      "fileName": "The Ashen HD V2_5- CBBEv3 Slim-8583-2-5.rar",
      "uploadedUnix": "1344457660",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/dca99bb59133cf85fcfd243f7ad664d5ff7fd007d16a7e2b8d7e63d68f5667f7/analysis/1407080533/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_5-%20CBBEv3%20Slim-8583-2-5.rar?fid=79833&ttl=1535767438&ri=8192&rs=8192&setec=0e9b190a2015ace2ff5836f58d5ff6d8"
    },
    {
      "fileId": "79835",
      "name": "The Ashen HD V2_5- CHSBHC",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "55790",
      "fileName": "The Ashen HD V2_5- CHSBHC-8583-2-5.rar",
      "uploadedUnix": "1344457947",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/daa9040465135e7157ae89e66dc45c782f05968ea1f31df4ff65a6b8391cb995/analysis/1407080543/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_5-%20CHSBHC-8583-2-5.rar?fid=79835&ttl=1535767438&ri=8192&rs=8192&setec=4012f207fccb77f4b4ab6a8dcb219b26"
    },
    {
      "fileId": "79836",
      "name": "The Ashen HD V2_5- UNPB",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63964",
      "fileName": "The Ashen HD V2_5- UNPB-8583-2-5.rar",
      "uploadedUnix": "1344458174",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/5819e399ffaa6f7b8a4f57a6ed3b0ccfbf11aa52191bfbdfea7eb854b25388d7/analysis/1407080558/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_5-%20UNPB-8583-2-5.rar?fid=79836&ttl=1535767439&ri=8192&rs=8192&setec=a26049563b53d9f4c033700e58918917"
    },
    {
      "fileId": "79838",
      "name": "The Ashen HD V2_5- CBBEv3",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "54602",
      "fileName": "The Ashen HD V2_5- CBBEv3-8583-2-5.rar",
      "uploadedUnix": "1344458521",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/5159e826f8d28d01d4889eb91b4493fabfba034390cead4910f13010f95a39f8/analysis/1407080596/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_5-%20CBBEv3-8583-2-5.rar?fid=79838&ttl=1535767439&ri=8192&rs=8192&setec=c1c0f9f55f530e336bcf77b1b2481afa"
    },
    {
      "fileId": "79839",
      "name": "The Ashen HD V2_5- UNP",
      "version": "2.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "63592",
      "fileName": "The Ashen HD V2_5- UNP-8583-2-5.rar",
      "uploadedUnix": "1344458825",
      "modVersion": "2.5",
      "virusScanUrl": "https://www.virustotal.com/file/9e00ba03644766ae1ae03713e434edf0e095c5ebd88b952ec043af461e342835/analysis/1407080609/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_5-%20UNP-8583-2-5.rar?fid=79839&ttl=1535767440&ri=8192&rs=8192&setec=d2acbfc5ca7ddae1315c200129fd4d93"
    },
    {
      "fileId": "91989",
      "name": "The Ashen HD V2_6 - ADEC",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "54711",
      "fileName": "The Ashen HD V2_6 - ADEC-8583-2-6.rar",
      "uploadedUnix": "1349370110",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/3406d67a64f9279f64c61e580c057821f4b5ba5bd87780080565dbc1a5e63ddb/analysis/1407203477/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20ADEC-8583-2-6.rar?fid=91989&ttl=1535767440&ri=8192&rs=8192&setec=45d5236f1d2ce3fa00e6bca8f286c5f7"
    },
    {
      "fileId": "91990",
      "name": "The Ashen HD V2_6 - CBBEv3",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57575",
      "fileName": "The Ashen HD V2_6 - CBBEv3-8583-2-6.rar",
      "uploadedUnix": "1349370343",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/8110239625bb27c3e20b8a8fa7965f0fadde2cab659cf062c43839dd5184ff02/analysis/1407203499/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20CBBEv3-8583-2-6.rar?fid=91990&ttl=1535767441&ri=8192&rs=8192&setec=6250146b3ab55154821f9a01b73c9bc7"
    },
    {
      "fileId": "91991",
      "name": "The Ashen HD V2_6 - CBBEv3 Slim",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "57458",
      "fileName": "The Ashen HD V2_6 - CBBEv3 Slim-8583-2-6.rar",
      "uploadedUnix": "1349370561",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/5c2b913e92274fc2548e8eba075f65a9550808ccaef34f630c55930d0d3a2423/analysis/1407203507/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20CBBEv3%20Slim-8583-2-6.rar?fid=91991&ttl=1535767442&ri=8192&rs=8192&setec=bd289180fafd79cc9c9caf6a8511c6d7"
    },
    {
      "fileId": "91992",
      "name": "The Ashen HD V2_6 - CHSBHC",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "58769",
      "fileName": "The Ashen HD V2_6 - CHSBHC-8583-2-6.rar",
      "uploadedUnix": "1349370733",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/d6e72ed019bf39f76cb9bfc83ea5c0e8b70b87deb5f4c3c4e6f01bf4a036859b/analysis/1407203544/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20CHSBHC-8583-2-6.rar?fid=91992&ttl=1535767442&ri=8192&rs=8192&setec=99284147c938db5977b03e41f41ea0aa"
    },
    {
      "fileId": "91996",
      "name": "The Ashen HD V2_6 - UNPB",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "66208",
      "fileName": "The Ashen HD V2_6 - UNPB-8583-2-6.rar",
      "uploadedUnix": "1349370898",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/048b329f4900a4e082ef9056ac7e056769baf5e71d304eb64dcff6b38c8f55dd/analysis/1407203565/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20UNPB-8583-2-6.rar?fid=91996&ttl=1535767442&ri=8192&rs=8192&setec=ea632d26dd0c7a35ccf432ebae3452e6"
    },
    {
      "fileId": "91998",
      "name": "The Ashen HD V2_6 - DIMONIZED UNP",
      "version": "2.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "65792",
      "fileName": "The Ashen HD V2_6 - DIMONIZED UNP-8583-2-6.rar",
      "uploadedUnix": "1349371051",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/29d27e52774f403a50e7d7198d1c65bd1f70e0e04e62fd8305a3d7579418665a/analysis/1407203580/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20DIMONIZED%20UNP-8583-2-6.rar?fid=91998&ttl=1535767443&ri=8192&rs=8192&setec=c6f4083e9d8069ac10262f46a285c12a"
    },
    {
      "fileId": "91999",
      "name": "The Ashen HD V2_6 - Dawnguard Edition",
      "version": "2.6DG",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "70",
      "fileName": "The Ashen HD V2_6 - Dawnguard Edition-8583-2-6DG.rar",
      "uploadedUnix": "1349371185",
      "modVersion": "2.6DG",
      "virusScanUrl": "https://www.virustotal.com/file/b82afd743734bbd71bd484d5c81c41f5e43f28a9c5d0465d707caa0df4d07ba8/analysis/1407203566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20Dawnguard%20Edition-8583-2-6DG.rar?fid=91999&ttl=1535767443&ri=8192&rs=8192&setec=005bbc40029ff4ef3f0f4659413de568"
    },
    {
      "fileId": "92000",
      "name": "The Ashen HD V2_6 - Original Ashen Custom Head",
      "version": "2.6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "54",
      "fileName": "The Ashen HD V2_6 - Original Ashen Custom Head-8583-2-6.rar",
      "uploadedUnix": "1349371314",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/7a338deac5b3a8afbb01104287dbec3630951e043043ff3fee462c0cf5741e32/analysis/1407203567/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20Original%20Ashen%20Custom%20Head-8583-2-6.rar?fid=92000&ttl=1535767444&ri=8192&rs=8192&setec=258fe9f269f442a2250b9911d73e304f"
    },
    {
      "fileId": "92008",
      "name": "The Ashen HD V2_6 - Original Ashen Custom Head Dawnguard Edition",
      "version": "2.6DG",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "71",
      "fileName": "The Ashen HD V2_6 - Original Ashen Custom Head Dawnguard Edition-8583-2-6DG.rar",
      "uploadedUnix": "1349374439",
      "modVersion": "2.6DG",
      "virusScanUrl": "https://www.virustotal.com/file/16f8803f7c0634fe95105a95a82c7072d6c836165a39a655c118eb5c6c453899/analysis/1407203642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20Original%20Ashen%20Custom%20Head%20Dawnguard%20Edition-8583-2-6DG.rar?fid=92008&ttl=1535767445&ri=8192&rs=8192&setec=1c1adf3a9757efe1455ce97459067848"
    },
    {
      "fileId": "92009",
      "name": "The Ashen HD V2_6 - Vanilla Head",
      "version": "2.6",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "52",
      "fileName": "The Ashen HD V2_6 - Vanilla Head-8583-2-6.rar",
      "uploadedUnix": "1349374488",
      "modVersion": "2.6",
      "virusScanUrl": "https://www.virustotal.com/file/cefc57c8905485ab47d188329def1f4ff4dd3098ea713e41897a73cc1a9a31ca/analysis/1407203642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20Vanilla%20Head-8583-2-6.rar?fid=92009&ttl=1535767445&ri=8192&rs=8192&setec=77265e61b9913cd3193bc478b8e73862"
    },
    {
      "fileId": "92010",
      "name": "The Ashen HD V2_6 - Vanilla Head Dawnguard Edition",
      "version": "2.6DG",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "70",
      "fileName": "The Ashen HD V2_6 - Vanilla Head Dawnguard Edition-8583-2-6DG.rar",
      "uploadedUnix": "1349374568",
      "modVersion": "2.6DG",
      "virusScanUrl": "https://www.virustotal.com/file/bfc415b606cc2836844711965ef7d9d92c1e096f14bd25d6b4a599663504ecfe/analysis/1407203643/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/The%20Ashen%20HD%20V2_6%20-%20Vanilla%20Head%20Dawnguard%20Edition-8583-2-6DG.rar?fid=92010&ttl=1535767446&ri=8192&rs=8192&setec=c8d03d387fc49331fd41889b64695972"
    }
  ]
}