{
  "modId": 85835.0,
  "modName": "Halls Of Dovahndor Turkish Translation",
  "summary": "Ulu Hrothgar&#39;ın zirvesindeki portaldan Sovgarde&#39;a geçebilirsiniz.\r<br />&lt;br /&gt;&lt;br /&gt;Dovahndor İsimli Saraya Girebilirsiniz.",
  "descriptionHtml": "Gate To Sovngarde: Dünyanın boğazında yeni bir harita konumu olan &#34;Monahven Miraad&#34; ya da Ana Rüzgar Kapısı ve Sovngarde&#39;deki Dovahndor Salonlarına giriş.\r<br />\r<br />The Halls Of Dovahndor:Evde bir kütüphane, ofis, zırh, müze, ateşleme menzili, laboratuar, ana yatak odası, simya bahçesi, eğitim odası, yemek odası, mutfak bahçesi, taht odası, zırh galerisi bulunmaktadır.\r<br />\r<br />The Underdepths: Gizli girişi olan ve gölge sandığının bulunduğu bir mekan.\r<br />\r<br />Crafting: Oyundaki tüm tezgahlara sahiptir.Ayrıca bir çok craft materyali var.\r<br />\r<br />Shrines Of The Gods: Dokuz tanrı tapınaklarının hepsi mevcut.Hepsinin özel bir yeri var.\r<br />\r<br />Teleportation Spell: Sizi Dovahndor&#39;a teleport edebilecek bir tomar var. Hall Of Magic isimli mekanda bulunuyor.\r<br />\r<br />Unique Items: Dovahndor&#39;a yayılmış birkaç eşsiz ürün mevcut.\r<br />\r<br />Display And Storage: Mankenler, silah plakaları, silah rafları, sandıklar, vitrinler vs. Bunların çoğu Koleksiyoner Salonu&#39;nda bulunabilir. Ayrıca, Dovahndor, 500&#39;den fazla kitabı bir araya getiren, eksiksiz çalışan kitap raflarına sahiptir.\r<br />\r<br />Collector&#39;s Edition: Özel Mahalleler&#39;de &#34;Skyrim: Collector&#39;s Edition&#34; ın oyun içi temsilciliğini Odahviing&#39;in küçük bir modeliyle birlikte bulabilirsiniz.\r<br />\r<br />Follower Compatibility: Takipçiler bizimle birlikte Dovahndor&#39;a gelebilir.\r<br />\r<br />Portal Chamber: Dovahndor&#39;a yapılan bu yeni ek, Winterhold&#39;un Üniversitesi dahil olmak üzere Skyrim&#39;deki en büyük şehirlere yönelik altı tek yönlü portal içermektedir.\r<br />\r<br />Heroes Of Sovngarde: Sovngarde&#39;ın dört bir yanından gelen kahramanlar Ejderdoğanı selamlamaya Dovahndor Salonu&#39;na gelir.\r<br />\r<br />Traders And Crafters: Tüccarlar Dovahndor&#39;a da malzeme tedarik etmeye istekli oluyorlar.Bu tüccarlar neredeyse sınırsız altına sahip ve onlara ne teklif edersen satın almayı kabul ediyorlar.\r<br />\r<br />Expanded Living Quarters: Özel Mahalleler iki yeni yatak odası ve toplam 10 yatak ile genişletildi.\r<br />\r<br />Masks of the Dragon Priests: Ejder Rahibi maskeleri Koleksiyoner Salonunda sergilenebilecek.\r<br />\r<br />The Dragonguard: Ejder Muhafızları.Tek amaçları Dovahndor&#39;u korumak.Salonu ne pahasına olursa olsun korurlar.\r<br />----------------------------------------------------------------------------------------------------------------------------------------------\r<br />Dovahndor Salonu genellikle Yedi Büyük Salon olarak anılır.\r<br />\r<br />Müze olarak da bilinen bu salonun merkezi, Kar Elf&#39;in bilinen tek temsilcisi olan Irkngthand Kar Elf heykelinin tam boyutlu bir kopyası.\r<br />\r<br />Bodrumda korkunç Canavar Odası&#39;nı, bazı Skyrim&#39;lerin en tehlikeli ve dehşet verici yaratıklarından oluşan bir koleksiyon bulabilirsiniz.\r<br />\r<br />Taht Odasında (Yedinci Salon) Ejderdoğan için Altın bir Taht var. Ve Alduin&#39;in tam boyutlu bir heykeli.\r<br />\r<br />Yedi Bölgeye ilaveten efsaneler, gizlilik içinde gizlenmiş, yanıltıcı sekizinci bir salondan bahsediyorlar. Bu salonun Underdepths&#39;in derinliklerinde bulunduğu söylenir ve sadece Gölgeler Salonu olarak atıfta bulunulur.\r<br />\r<br />Bu salonun varlığı bir gizem.",
  "categoryId": "28",
  "version": "1",
  "author": "WrsRadiant",
  "createdUnix": "1501981051",
  "updatedUnix": "1501981047",
  "containsAdultContent": false,
  "uploadedBy": "WrsRadiant",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000251132",
      "name": "Halls Of Dovahndor Turkish",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "313",
      "fileName": "Halls Of Dovahndor Turkish-85835-1.rar",
      "uploadedUnix": "1501981047",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/9fe2b01c8b7fca374778308380b4311229a0179ae8c1ad2459ef3562a68f3434/analysis/1501981322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Halls%20Of%20Dovahndor%20Turkish-85835-1.rar?fid=1000251132&ttl=1535874657&ri=8192&rs=8192&setec=0517d8cbb8636b79e5f859e1d45ebdd1"
    }
  ]
}