{
  "modId": 85874.0,
  "modName": "Alcester Village",
  "summary": "",
  "descriptionHtml": "[img]http://i.imgur.com/LDEKYm1.png[/img]\r<br />\r<br />[center][font=Georgia][color=#ffff00]Alcester Village located on a small island just northeast of main land Skyrim. Home to the Alcester Goods company which until\r<br />recently produced and sold its goods all across Skyrim but has recently been taken over by Empire due to the civil war.[/color][/font][/center]\r<br />                                                                                             [center][/center][left] - Features –\r<br />\r<br />[/left][list]\r<br />[*]Complete sizable village with some custom models and textures (modeled after an old Medieval English village).-\r<br />[*]Fully Voiced NPCs\r<br />[*]A mysterious disappearance to solve. \r<br />[*]Easter egg hunt.\r<br />[*]Player House with a quest to obtain.\r<br />[*]Detailed lore and backstory to the village. \r<br />[/list]\r<br />[left]\r<br />\r<br />- Brief History -\r<br />\r<br />Alcester started life as a small farming village but began to expand into what it is today once Edward Sarvet took control and named himself Jarl. \r<br />Edward then proceeded to forcibly take land from the farming families to sell on to the new wealthy settlers who wanted to take advantage of the cheap workforce and make a profit from newly emerging trade deals. \r<br />\r<br />During the Great War, two Alcester delivery ships on route to Solitude was mistaken for Imperial ships was destroyed by the thelmor\r<br />as a result, the economy in Alcester was shattered and plummeted the village into a deep recession, The new appointed Jarl Drayton Sarvet reached out to the empire for help which in turn sent Benyard Stannis a wealthy ranking officer from the east empire company who bought out the village and created the Alcester goods company which acted as a sub company for the East Empire.\r<br />\r<br />While the takeover made the nobles wealthier it was the poorer citizens of the village who felt the … having their land sold\r<br />from underneath them and being forced to work for very little money whilst being heavily taxed. Now there is a clear divided between rich and poor. \r<br />\r<br />Not long after the civil war began in Skyrim the Imperial legion took direct control of the village and the goods company knowing it\r<br />would be a great loss if it was to fall into the hands of the Stormcloaks [/left][center][/center]\r<br />[youtube]IwC5wpBFypI[/youtube]",
  "categoryId": "30",
  "version": "",
  "author": "Nathan Frreman",
  "createdUnix": "1502139168",
  "updatedUnix": "1502139168",
  "containsAdultContent": false,
  "uploadedBy": "nzey20155",
  "primaryFile": null,
  "files": []
}