{
  "modId": 85964.0,
  "modName": "Dark Steel Armor",
  "summary": "Made using retextured steelplate armor at the request of Pavan999.",
  "descriptionHtml": "[url=http://www.nexusmods.com/skyrimspecialedition/mods/11512/?][b][u][size=3]SSE Version[/size][/u][/b]\n<br />[/url]\n<br />So the other day, I was asked by Nexus user Pavan999 to make dark steelplate armor based on the armor that [url=https://s-media-cache-ak0.pinimg.com/736x/ce/55/d6/ce55d6c4a906208fbe9456257175a0e1--lady-brienne-brienne-of-tarth.jpg]this lady[/url] from Game of Thrones wears. Now, I don't watch Game of Thrones myself, since I already have plenty of stuff to get off to (Everyone who watches GoT has jerked off to it at least once. True Fact. No, I don't think any less of them for doing so), but I like fulfilling requests every now and then, so here we are.\n<br />\n<br />[u]Dark Steel Armor[/u] has the same stats as ebony armor, and requires the same perk to be crafted. Unlike ebony or steelplate armor, however, it requires a large mixture of metals to craft. A steel-ebony alloy makes up the plates, while the chainmail is made of steel, and the scales are iron. It also looks cool because its black.\n<br />\n<br />[b]FAQ[/b]\n<br />[size=2]Q: That doesn't look like a decent replica of the armor in the picture...\n<br />[/size]A: I work with textures, not meshes.\n<br />\n<br />Q: So you suck at modding?\n<br />A: I'm slowly getting better. For a long time I didn't know how to do retextures.\n<br />\n<br />Q: Hey! I watch Game of Thrones but have never blew a load to it!\n<br />A: Bullshit.\n<br />\n<br />Q: So you just take requests now? Can I request a mod?\n<br />A: Usually, this involves us exchanging sexual favors.\n<br />\n<br />Q: Stop being a child, you know that I'm not doing that.\n<br />A: Actually, the requester's usually on the receiving end so that the modder feels appreciated.\n<br />\n<br />Q: Will you give me sexual favors if I request a mod?\n<br />A: You can get something of the erotic sort ANYWHERE on the Nexus. Moreover, do you actually believe that modders get it on with people who request mods?\n<br />\n<br />Q: Well, you say they do...\n<br />A: I've also said a [url=http://www.nexusmods.com/fallout4/mods/24560/?]a grenade launcher mod was a ridiculous lingerie mod.[/url] Never trust anything I say. Ever.\n<br />\n<br />Q: Don't you think you're going to regret saying all that?\n<br />A: Probably.\n<br />\n<br />Q: Your descriptions just get worse and worse. They scare people away from downloading the mod.\n<br />A: No, me attaching a [url=https://steamuserimages-a.akamaihd.net/ugc/866234140303180606/1BB85BB77EA08AE2E7A330501711521E47BBF076/]screenshot[/url] of a potion with witcher semen and nord pubic hairs in it scares people away from downloading mods.\n<br />\n<br />Q: WHERE CAN I GET SOME OF THIS?!\n<br />A: [url=http://www.nexusmods.com/skyrim/mods/85880/?]Right here.[/url]\n<br />\n<br />Q: Are you serious? You advertised two other mods in one FAQ?\n<br />A: Be sure to try out my [url=http://www.nexusmods.com/skyrim/mods/85923?]chainmail and scale armors, too[/url]!\n<br />\n<br />Q: Honestly, your descriptions used to be pretty funny, but now they're just a half-assed attempt at trying to get more people to download the mod.\n<br />A: They USED to be funny? I wrote an [url=http://www.nexusmods.com/fallout4/mods/19031/?]entire paragraph about not being able to bang Veronica in New Vegas [/url]back in October 2016, then a [url=http://www.nexusmods.com/fallout4/mods/20483/?]paragraph-long Terminal Lance reference[/url] in December. I think I've gotten a little bit better.\n<br />\n<br />Q: WHAT THE FUCK?! Two more advertisements?\n<br />A: I'm trying to see how many I can cram into this. You're just giving me opportunities now by bringing it up. So try out [url=http://www.nexusmods.com/fallout4/mods/19232/?]the best Fallout 4 mod ever[/url].\n<br />\n<br />Q: Why are you such a fucking pervert? What happened to you? This has to stem from a single, traumatic event.\n<br />A: I've used New Vegas GECK a few times. That's a traumatic event.\n<br />\n<br />Q: Will you ever release a mod with a more professional description?\n<br />A: I mean, [url=http://www.nexusmods.com/fallout4/mods/17095/?]Immersive Boomstick[/url] doesn't have an FAQ, and I didn't start ending FAQs with memes until the Diamond City Guards mod.\n<br />\n<br />Q: Speaking of which, that ending FAQs with memes thing? It's fucking stupid. You're just taking other people's jokes.\n<br />A: [url=https://www.youtube.com/watch?v=t7JKsQlqxSI&amp;t=3675s]You think I care?[/url] Yes, I know I used GamerPoop twice in a row, but then again, more views for Mans1ay3r.\n<br />\n<br />[url=http://www.nexusmods.com/fallout4/users/19313784/?tb=mods&amp;pUp=1]My other mods which you should totally get because your Bethesda experience won't be as good without them.\n<br />\n<br />[/url][u]DISCLAIMER:[/u]\n<br />If it's not apparent, all my FAQs and mod descriptions are written for the sake of humor.\n<br />If one of them offends you, I'm sorry.\n<br />I'm also sorry to say that you, and you alone taking offense from it will not give me cause to change the description.",
  "categoryId": "54",
  "version": "1",
  "author": "Roadhouse699",
  "createdUnix": "1502475455",
  "updatedUnix": "1502475447",
  "containsAdultContent": false,
  "uploadedBy": "Roadhouse699",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000251628",
      "name": "Dark Steel Armor",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5254",
      "fileName": "Dark Steel Armor-85964-1.rar",
      "uploadedUnix": "1502475447",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/6e31c69e3aed62d9a7e9aec51ab43a6422c39044589519e431a5923da2ad0d3b/analysis/1502475561/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dark%20Steel%20Armor-85964-1.rar?fid=1000251628&ttl=1535874788&ri=8192&rs=8192&setec=048949dad41f58ec6fc1efb287eea080"
    }
  ]
}