{
  "modId": 85998.0,
  "modName": "The Art of Armor Animation",
  "summary": "Adds new conjurable suits of armor, animated by magic to fight for whoever conjured them.",
  "descriptionHtml": "[size=6]Requires Dawnguard DLC[/size]\n<br />\n<br />Conjuration lets you summon just about anything, from ethereal weapons you can use to fight, to daedra, to atronachs, to even raised undead!\n<br />\n<br />Yet why haven't mages tried taking suits of armor and animating them?\n<br />\n<br />Thats why I made this mod, it adds summonable suits of armor, animated by magic to fight for you(or whoever summoned them).\n<br />\n<br />The spell tomes can only be crafted at a tanning rack, and only if you meet the requirements, they also take various materials to craft.\n<br />\n<br />Animated Armors have 3x the duration of other summons, but cannot be thralled, they also use a random weapon of their armor's type.(Like Animated Steel Armor will use Steel Weapons.)\n<br />\n<br />Animated Daedric Armor has a powerful fire cloak.\n<br />Animated Dragonbone and Dragonscale armors have a few shouts at their disposal.(Animating armor made from dragons will give the armor some of the dragon's knowledge, causing the armor to be able to use a select few dragon shouts.)\n<br />Shouts that animated dragon armors can use include Unrelenting Force, Ice Form, Fire Breath, Disarm and Marked for Death.\n<br />\n<br />Material Requirements\n<br />--------------------------\n<br />In order to make a spell tome to summon an animated suit of armor, you must have the following.\n<br />-A filled soul gem(soul gem depends on what animated armor tome you are trying to make, for example animated steel armor only needs a petty soul gem, but animated daedric armor needs a black soul gem.)\n<br />-A full suit of armor of the type you wish to make an animated armor tome of.\n<br />---Note: Animated Steel Armor will only accept the horned helmet, pauldron steel armor, and nordic gauntlets and boots.\n<br />-A Tome of Conjure Familiar (Think of it as modifying the tome to the new summon)\n<br />-10 of the armor's material.(i.e. Steel Ingots for Animated Steel Armor)\n<br />---Note:Animated Daedric Armor requires 10 Daedra Hearts as an extra requirement.\n<br />\n<br />Perk Requirements\n<br />----------------------\n<br />Spell Tome recipes also will not appear unless you have certain perks, the following perks are required to unlock the recipes.\n<br />\n<br />Animated Steel Armor - Novice Conjuration + Steel Smithing\n<br />Animated Dwarven Armor - Apprentice Conjuration + Dwarven Smithing\n<br />Animated Elven Armor - Apprentice Conjuration + Elven Smithing\n<br />Animated Steel Plate Armor - Adept Conjuration + Advanced Armors\n<br />Animated Orcish Armor - Adept Conjuration + Orcish Smithing\n<br />Animated Glass Armor - Expert Conjuration + Glass Smithing\n<br />Animated Ebony Armor - Expert Conjuration + Ebony Smithing\n<br />Animated Daedric Armor - Master Conjuration + Daedric Smithing\n<br />Animated Dragonplate Armor - Master Conjuration + Dragon Smithing\n<br />Animated Dragonscale Armor - Master Conjuration + Dragon Smithing\n<br />\n<br />\n<br />There is also Animated Dawnguard Armor, an adept tier animated armor summon, the spell tome can be bough from Ronthil if sided with the vampires, or looted from his corpse during the kindred judgement quest if sided with the dawnguard.\n<br />\n<br />Why do the vampires have the animated dawnguard armor summon you ask? Well I do have a story as to why.\n<br />Some vampires like to steal the armor off of slain dawnguard members and then animate it in order to mess with the minds of the dawnguard a bit(these vampires thought that lowering the morale of the dawnguard members would increase their odds of wiping them out.), as such, the vampires learned how to animate suits of dawnguard armor in a similar matter to standard armor animation spells.\n<br />\n<br />There is an optional patch for anyone using [url=http://www.nexusmods.com/skyrim/mods/72910/?]Madcat221's Amazing Dawnguard Arsenal Mod[/url], the optional patch allows animated dawnguard armor summons to sometimes have the weapons from Madcat221's mod. The patch requires Dawnguard Arsenal as a master and as such won't work without it.\n<br />If not using the optional patch then Animated Dawnguard Armor summons will only have either war axes or warhammers(from the vanilla dawnguard DLC).\n<br />\n<br />This mod also adds a couple new enemy NPCs.\n<br />\n<br />First there are a new vampire type, Armor Animator Vampires, basically the vampires who decided to start animating dawnguard armor, you may find them in the vampire leveled lists.\n<br />\n<br />Second there's an alternate to the conjurer, the armor animator, who conjures animated armors rather then atronachs, they are found in conjurer leveled lists.",
  "categoryId": "75",
  "version": "1.0",
  "author": "TerraMcCloud",
  "createdUnix": "1502630776",
  "updatedUnix": "1502630770",
  "containsAdultContent": false,
  "uploadedBy": "TerraMcCloud",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000251808",
      "name": "Art of Armor Animation",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "67",
      "fileName": "Art of Armor Animation-85998-1-0.zip",
      "uploadedUnix": "1502630667",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/66c96fe4be9581e9c8765d08c1db8e14c03b281cb40750c95f4b94b7dab5701c/analysis/1502630703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Art%20of%20Armor%20Animation-85998-1-0.zip?fid=1000251808&ttl=1535874833&ri=8192&rs=8192&setec=a5bdcac1ecdcb7a68534eb1c516da0e6"
    },
    {
      "fileId": "1000251809",
      "name": "Art of Armor Animation - Dawnguard Arsenal Addon",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Art of Armor Animation - Dawnguard Arsenal Addon-85998-1-0.zip",
      "uploadedUnix": "1502630770",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e758a5b978c7e40f32504f88c139f4ca4c8e2575eb9a467e5e4fd40395781034/analysis/1502630822/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Art%20of%20Armor%20Animation%20-%20Dawnguard%20Arsenal%20Addon-85998-1-0.zip?fid=1000251809&ttl=1535874833&ri=8192&rs=8192&setec=5a17b2fd2a65e9e27e58ee49cf497d7f"
    }
  ]
}