{
  "modId": 86092.0,
  "modName": "Little Farm",
  "summary": "A new house for the player.\r<br />",
  "descriptionHtml": "[b][size=4]This mod adds a small farm with a garden, an animal enclosure, an apiary, a well, a distillery, a greenhouse and a mushroom cellar. Here you can milk cows, shear goats, plant plants, make wine, create furniture, fish, hunt with a dog, collect various rare items and so on.\r<br />A small farm will help you to diversify the gameplay, add new game mechanics and set new goals for you.[/size]\r<br />\r<br />\r<br />Описание:[/b]\r<br />\r<br />Мод добавляет маленькую ферму с огородом, загоном для животных, пасекой, колодцем, винокурней, оранжереей и грибным погребом. Здесь вы сможете доить коров, стричь коз, сажать растения, делать вино, создавать мебель, ловить рыбу, охотиться с собакой, коллекционировать различные редкие предметы, получать достижения и даже рисовать, играть на музыкальных инструментах и танцевать. Маленькая ферма придется по вкусу тем, кому наскучили суровые скайримские будни, постоянные битвы и блуждания в поисках наживы. Теперь у вас есть возможность отдохнуть от сражений в тихой обстановке на берегу Илиналты и внести разнообразие в свой игровой процесс.\r<br />\r<br />Ферма. \r<br /> Ферма находится к северу от Фолкрита на южном побережье Илиналты и имеет маркер быстрого перемещения. Изначально дом для вас закрыт, а участок имеет запущенный вид. Вам нужно будет поговорить с каджитом-смотрителем и выполнить несколько простых поручений по наведению порядка, выдаваемых в виде записок. После этого вы получите ключ и сможете заказать у смотрителя домашний скот, собаку, дополнительные удобства, а также купить различные полезные предметы (подробнее читайте в разделе «Смотритель»). \r<br />\r<br />Задания.\r<br />Вступительные задания выдаются смотрителем в виде записок и требующихся для выполнения инструментов. После каждого задания вы сдаете собранные предметы смотрителю и получаете следующее поручение. В первом задании вам выдается метла, которой нужно подмести пять паутин вокруг дома. Во втором получаете мотыгу, которой нужно прополоть семь сорняков. В третьем вам дается кирка, которой нужно разбить каменные завалы над колодцем и над люком позади дома, в процессе чего вы получите шесть камней, и еще четыре камня вам нужно собрать на берегу перед фермой. В четвертом задании вам нужно нырнуть с причала в озеро и отыскать под водой три мешка с вином, которые расположены неподалеку в виде треугольника. Найденные двенадцать бутылок вина вы отдаете каджиту и получаете ключ от фермы. Все участвующие в заданиях объекты хорошо видны и легко узнаваемы. Если у вас возникли проблемы со вступительными заданиями – читайте F.A.Q. Полностью сбросить вступительные задания и сразу получить контроль над фермой вы сможете, использовав &#34;Ленивое зелье&#34;, которое можно украсть у каджита.\r<br />\r<br />Дом. \r<br /> Домик максимально прост и удобен, имеет множество контейнеров для хранения вещей, а в подвальном помещении есть даже небольшой кабинет с минибиблиотекой и несколькими стендами для оружия. Также в подвале имеется все необходимое для крафта и улучшения. Сетку путей прокладывал вручную, добавил много маркеров, так что жена и компаньоны будут чувствовать себя уверенно. Также дом имеет свое музыкальное оформление, в котором использованы этнические скандинавские мотивы. В виде небольшого бонуса вы можете подметать коврики, получая пыль - ингредиент для приготовления зелий. Еще в доме есть скрытый контейнер - тайник фермера, в котором находится амулет хозяина фермы. Он необходим для того, чтобы начать разговор с утонувшей дочкой фермера. Тайником можете пользоваться, а амулет рекомендую вернуть девушке (подробнее читайте в разделе «Хозяйка»). \r<br />\r<br />Чердак.\r<br />У смотрителя вы сможете заказать постройку чердака, попасть на который можно с помощью веревочной лестницы, которая находится возле входной двери. Изначально чердак пуст и я предлагаю вам самостоятельно обустроить его на свой вкус при помощи создаваемых в кузнице предметов. С чердака имеется выход на внешний балкон.\r<br />\r<br />Мастерская.\r<br />Это подвальное помещение, предназначенное для личного творчества игрока. Его тоже можно обставить самостоятельно, а также можно заказать у смотрителя в отдельном пункте диалога дополнительные удобства. В мастерской пусто и нет музыкального оформления, чтобы вы могли спокойно играть там на музыкальных инструментах, исполнять выученные танцы, устанавливать мольберт, ксилофон и прочие конструкции. При заказе рамок для картин вы получите девять пустых стендов на стенах, активировав которые вы сможете поместить внутрь (как в контейнер) любые рисунки, нарисованные вами на мольберте. Также вы сможете заказать стойки для драконьих когтей и крепежи для масок драконьих жрецов, которые работают по такому же принципу. \r<br />\r<br />Фурнитура. \r<br /> Все станки на ферме уникальны. Только на них вы сможете создать предметы, добавляемые плагином. Для работы со станками необходим инструментарий. Активация наковальни и верстака будет невозможна без наличия фермерского молота, винокурня и котелок потребуют фермерский черпак, дубильный станок - фермерский нож-скобель, столярный – фермерскую пилу, а плавильня – фермерскую лопату. Считаю, что это справедливо, т.к. указанные предметы участвуют в анимации и не могут возникать ниоткуда. Для сбора ржи в огороде вам понадобится фермерский серп. Для активации рубочной колоды вы не сможете использовать обычный игровой колун, необходим фермерский.  Эти нововведения касаются только фурнитуры на ферме, ванильные станки абсолютно не затронуты. Весь необходимый фермерский инструментарий вы сможете купить у смотрителя. Здесь же приведу полный список создаваемых предметов по каждому станку. Письменный стол – свитки возврата и перемещения, рецепты, формулы, чертежи, руководства. Дубильный станок – шерстяная ткань, веревка, комплекты одежды (повара, фермера, кузнеца, столяра), седла для коня и починка одежды для Кеньи. Винокурня – уникальные вина и ржаная водка. Котелок  – базовые блюда, составные блюда, праздничные блюда и закуска при наличии рецепта. Заготовочный стол  – семена и рассада, декоративные букеты, некоторые продукты и ингредиенты. Кузница – капканы, знамена, банки, переносной инвентарь (вертел, шатер, спальник, сундук, тренировочный манекен и мишень), блоки для сложных конструкций при наличии чертежа. Столярный станок – мебель (стол, стул, тумбочка, койка, бочка), плетеный забор, дрова для костра. Плавильня  - знаки девяти богов при наличии соответствующего амулета и благословения, стеклянные банки, а также особое стекло, особый сплав и особые краски при наличии формулы. Гончарный круг – глиняная посуда (блюда, бутылки, миски) и горшки для букетов.\r<br />\r<br />Инструментарий.\r<br />Используемый в плагине инструментарий озаглавлен как &#34;фермерский&#34; и периодически в небольших количествах появляется в продаже у смотрителя. На данный момент набор включает в себя метлу, мотыгу, кирку, колун, пилу, молот, лопату, скобель, черпак, ножницы, серп, ведро и удочку. Метлу, мотыгу и кирку вы получаете при выполнении вступительных заданий.\r<br />\r<br />Письменный стол.\r<br />Станок, предназначенный для работы с бумагой. На нем можно создавать свитки возврата на ферму (по просьбам тех, кто не использует фаст-тревел) и свитки перемещения в те города, где у вас куплен дом. Если же у вас куплены все пять ванильных домов, то вы сможете создавать свитки для путешествия в столицы всех девяти холдов Скайрима. Также доступен крафт рецептов для приготовления домашней консервации и сложных праздничных блюд, эффект от которых помимо самого ГГ распространяется и на компаньонов. Добавлен крафт чертежей для создания ветряков, мольберта, ксилофона, алтаря девяти богов, а также формулы для изготовления в плавильне особого сплава, особого стекла и особых красок. \r<br />\r<br />Полка для бабочек.\r<br />Расположена на стене справа от очага. Предназначена для установки на нее банок (5 шт), которые крафтятся в плавильне. Для создания банок необходимо особое стекло, которое можно выплавить при наличии формулы в плавильне. В банки вы сможете помещать редких бабочек, купленных у каджита. Бабочек пять видов и находясь в банке каждая из них дает свой положительный эффект при активации (одновременно можно получить только один эффект). Все эффекты имеют уникальную анимацию. Бабочек можно вынимать из банок путем активации в режиме скрытности. Также ими можно украшать дом или участок, просто выбросив бабочку из инвентаря. Потом ее можно снова поймать.\r<br />\r<br />Смотритель. \r<br /> Возле дома обитает смотритель фермы, а по совместительству и домашний торговец. Это каджит Ти&#39;шах, который, после выполнения вступительных заданий, будет присматривать за хозяйством в ваше отсутствие и сможет продавать вам небольшое количество шерсти, семян и базовых домашних продуктов, а также канцелярские товары, инструментарий для работы с фурнитурой, мешки с песком, рыболовные снасти, корм для животных и наживку. У него при себе есть золото и вы сможете сбыть ему ненужный хлам. Угостив его соленой рыбой, вы сможете подружиться, после чего каджит будет продавать вам контрабандный товар и покупать у вас краденое (для этого ему нужно зайти в дом). Еще вы сможете обменивать ему соленую рыбу на информацию о прежних хозяевах, которая является подсказками в обнаружении секретов. В итоге вы получите дневник фермера, откуда сможете узнать полную историю дома и прежних хозяев. А еще смотритель может вас обучить некоторым танцам (подробнее смотрите в разделе &#34;Музыка и танцы&#34;).\r<br />\r<br />Загон для животных. \r<br /> Тут вы найдете заказанный у смотрителя домашний скот: коров и коз, которых можно доить раз в сутки (коз можно еще и стричь), куриц, с которых можно получить яйца (тоже раз в сутки) и кроликов в клетках (их тоже можно стричь раз в сутки). Все взаимодействия с животными осуществляются посредством диалога и озвучены. Анимаций нет. Для доения животных необходимо ведро, а для стрижки - ножницы. Все необходимое есть в продаже у каджита. Также для взаимодействия с животными вам нужно их кормить и поить.  Для этого вам нужно наполнить водой из колодца поилку и купленным у смотрителя сеном наполнить кормушку. Одной порции воды и сена животным хватает на пять дней.\r<br />\r<br />Конюшня.\r<br />Вы можете заказать у смотрителя стойло для коня, а также различные улучшения для него (дополнительные контейнеры, стойки для седел и фонарик для освещения). После установки стойла вы сможете купить уникального коня по кличке Каштан, создавать для него различные седла и научиться управлять им при помощи свиста. Если же у вас уже есть конь, который вас вполне устраивает – используйте конюшню для него.\r<br />\r<br />Конь.\r<br />После покупки у смотрителя конь появится в стойле. Активировав его в режиме скрытности вы сможете задать ему один из четырех стилей поведения (следовать за вами, держаться на расстоянии, оставаться на месте или возвращаться на ферму). Также сможете одеть ему седло (фермерское имеет встроенную сумку и даст вам дополнительное хранилище для вещей, а имперское и братьев бури увеличивает в полтора раза запас сил Каштана, что позволит вам дольше использовать спринт). Седла создаются на дубильном станке. Также после покупки коня смотритель может научить вас специальному свисту, с помощью которого вы сможете управлять конем на расстоянии (четыре разных свиста добавляются вам в виде талантов).  Избавиться от навыков свиста вы можете при помощи книги управителя.\r<br />\r<br />Собака.\r<br />После покупки у смотрителя собаки она появится у вас во дворе. Это симпатичный хаски по кличке Шершень. В ваше отсутствие он будет охранять участок. Также он заядлый охотник. Если дать ему вяленую ножку – он последует за вами и будет сопровождать вас в течение восьми часов, после чего вернется домой, если вы снова его не покормите. Когда собака идет за вами – следите за ее поведением. В любой момент пес может почуять дичь и броситься за ней или сделать стойку и залаять в направлении потенциальной добычи. Реагирует он только на диких животных – коза, олень, кролик, лиса или хоркер. Если у вас активирован режим взаймодействия с животными через диалоги, то вы можете дать псу вяленый окорок и он призовет вам двух собак-защитников на пять минут, которые будут следовать за вами и охранять. Также вы можете раз в сутки забрать у него добычу. Если же вы активировали оконную систему взаимодействия, то подкармливая собаку вяленым окороком вы со временем сможете повышать его характеристики. Все собаки из плагина не занимают слот компаньона, животного или призванного существа, поэтому никоим образом вам не помешают. Возможно, вам придется подождать 5-10 секунд перед тем как Шершень пойдет за вами или отправится обратно домой.\r<br />\r<br />Уборная.\r<br />Уборная включает в себя туалет и душевую кабинку. Изначально она в нерабочем состоянии и вам нужно заплатить смотрителю за ее починку. Душ активируется цепью на стене, после чего камера переходит в вид от третьего лица, ваш ГГ раздевается и стоит под струями воды. В конце добавляется эффект «Чистота» (50% сопротивляемость болезням в течение одного дня). Чтобы вода не лилась мимо, рекомендую перед активацией стать в центр специального коврика. Для активации туалета вам нужно просто на него присесть, а когда подниметесь – вам добавится эффект «Облегчение» (повышение переносимого веса на 50 ед. в течение одного дня). И не забудьте смыть за собой.\r<br />\r<br />Огород. \r<br /> Тут вы можете раз в десять дней собирать рожь (независимо от ваших настроек респауна). На заготовочном столе можно обмолотить зерно с собранного урожая, перемолоть его в муку, а также есть возможность перемалывать ненужные предметы в полезные ингредиенты. При наличии полного комплекта фермера эффективность работы за столом повышается или удешевляется производство. Рядом будут размещены купленные у смотрителя пчелиные ульи, с которых раз в десять дней можно собирать домашний мед (независимо от ваших настроек респауна). Есть колодец, в котором при наличии ведра можно пополнить запасы воды. \r<br />\r<br />Кухня.\r<br />Из полученных в своем хозяйстве продуктов вы можете приготовить домашние блюда. Изначально вам доступны для приготовления базовые продукты (тесто, творог, фарш, повидло) и простые блюда – домашний сыр, домашняя брынза, вареное яйцо, ржаной хлеб, ржаной пряник, пирожки с мясом, повидлом или творогом, луковый суп, грибной суп, грибная запеканка, яблочная пастила. Некоторые продукты готовятся в два этапа (например, сначала вы готовите фарш и тесто, а потом пирожки с мясом). При наличии полного комплекта повара стоимость создания блюд уменьшается или повышается производительность. Кроме того вы можете приготовить по рецептам праздничные блюда (торт и пудинг) и закуску для алкоголя (пряные томаты и пряные яблоки). Рецепты создаются на письменном столе и при создании продуктов изымаются. Праздничные блюда дороги в приготовлении, но обладают довольно сильными эффектами, которые распространяются помимо самого ГГ и на компаньонов (только на тех, что используют фракцию Current Follower Faction). О закуске подробнее читайте в разделе «Выпивка и закуска».\r<br />\r<br />Шерстяные изделия. \r<br /> Из козьей шерсти и кроличьего меха на дубильном станке можно создавать шерстяную ткань, а из нее можно изготовить комплекты одежды. Модели для них взяты ванильные, но зачарования уникальные. Все они удешевляют производство предметов или повышают производительность на определенных станках. Комплект Кузнеца - кузница и плавильня, Комплект Повара - котелок, Комплект Фермера - заготовочный стол, Комплект Столяра - столярный станок и рубочная колода (повышает количество получаемых дров в два раза). Еще на дубильном станке можно создавать веревку, необходимую для сушки мяса и починки веревочных лестниц.\r<br />\r<br />Посадка растений. \r<br /> Для посадки необходимы семена, которые можно создать на заготовочном столе из готовых продуктов 1:10 (например, 1 мешочек с семенами капусты требует 10 качанов капусты). Если вы одеты в полный комплект фермера - цена на изготовление снижается вдвое. Далее выберите подходящее место без лишних элементов в виде камней или высокой травы, желательно с более-менее горизонтальной поверхностью, дабы модель растения корректно расположилась. Теоретически вы можете посадить овощи в любом месте, будь то каменный пол в подвале или дно реки, но для реалистичности предлагаю все же использовать нормальный грунт на свежем воздухе. Выбрав место, выбросите мешочек из инвентаря и растение появится прямо перед вами. После этого удалить его можно в режиме скрытности, имея при себе фермерскую лопату. Удалять растения можно до того, как вы собрали с него урожай, или после созревания следующего, т.к. после сбора они неактивны для игрока. Период респауна – 10 игровых дней (независимо от ваших настроек респауна). Так же не рекомендую засаживать слишком обширные плантации. Это может дать дополнительную нагрузку на ваш компьютер и солидно увеличить размер файлов сохранения. А вот небольшой огородик возле дома можете смело создавать. \r<br />\r<br />Винокурня. \r<br /> С ее помощью вы сможете создавать различные вина из глиняных бутылок, винограда и прочих ингредиентов. Эти напитки имеют двоякий эффект - одни параметры повышают, а другие понижают. Для винных бутылок сделаны оригинальные этикетки. Создавать вино можно из домашнего винограда - белого и темного. Лозу для посадки вы найдете в контейнере для рассады, там по 3 шт каждого вида. В дальнейшем сможете создавать семена из собранного урожая на заготовочном столе, как и для прочих огородных растений. Также можно готовить водку из ржаного зерна (подробнее читайте в разделе «Выпивка и закуска»).\r<br />\r<br />Деревья. \r<br /> Также в контейнере с рассадой вы найдете три деревца для посадки. Они отличаются друг от друга только цветом, потому и назвал их желтоцвет, красноцвет и синецвет (сорри за банальность, но ничего лучше не придумал). Деревья растут гораздо дольше, чем огородные растения, и периодически требуют поливки. Механизм следующий - сажаете дерево в понравившемся месте и поливаете один разочек (для этого потребуется вода). Через пять дней с момента поливки оно подрастает и тогда можно снова поливать. Если вы повторно польете дерево до того, как оно подросло, то фаза роста снова сдвинется на пять дней, поэтому рекомендую поливать деревья один раз. Этот процесс долгий, состоящий из девяти стадий, и потому вы можете просто вырастить деревце до подходящего вам размера и больше не поливать. Если же вам трех экземпляров маловато и вы хотите целый сад, или может вы решили разжиться саженцами для продажи - тогда выращивайте дерево до финальной стадии, после чего его можно срубить и получить рандомно от одного до трех новых побегов того же вида для посадки и бревно, которое используется в столярном деле. \r<br />\r<br />Грибной погреб. \r<br /> Возле винокурни вы найдете люк, ведущий в грибной погреб. Там несколько тесновато, поэтому сетку путей не прокладывал, чтобы компаньоны дожидались вас снаружи. В погребе есть сундук с рассадой грибов трех видов - белые, моховики и рыжики (по 3 каждого вида). В дальнейшем сможете создавать новую рассаду из собранного урожая на заготовочном столе. Из грибов можно готовить новые блюда. Садить их предлагаю прямо в погребе на земляном полу, условия там вполне подходящие. Механизм посадки как и у огородных растений, период респауна 10 дней независимо от ваших настроек. Также в погребе находятся бочки для засола рыбы. Рыба в них солится пять дней. Для этого процесса необходим собственно свежий лосось и несколько порций обычной соли.\r<br />\r<br />Рыбалка. \r<br /> На причале вы найдете два упора для удочек. Процесс предельно прост. После активации упора удило в него установится, а вы можете посидеть на краю причала и поболтать ножками (для этого добавлен специальный маркер между упорами). В любой момент вытягиваете удочку обратно и проверяете улов. Для рыбалки обязательно наличие наживки (она расходуется) и, конечно же, непосредственно самой удочки. Если у вас их две - можете использовать сразу два упора. Каджит с радостью будет продавать вам лучшие снасти и самую высококачественную наживку, правда в небольших количествах, чтобы избежать читерности. Поймать вы сможете свежего лосося, а также всю ванильную рыбку из игры и несколько неожиданных предметов. А можете и ничего не поймать, это ведь рыбалка. Пойманный лосось может быть вами засолен в бочках, которые находятся в грибном погребе, и после этого может быть использован в уже засоленном виде для обмена с каджитом на разные услуги.\r<br />\r<br />Капканы. \r<br /> Они созданы для любителей охоты. Против полноценных противников малоэффективны, т.к. урона маловато, но для мелкой живности - коза, кролик, волк - весьма хороши. Для использования просто выбрасываете капкан из инвентаря и активируете. После этого подобрать его уже нельзя, но можно двигать и снова активировать бесконечное количество раз. Самое сложное - заманить в капкан добычу или предугадать ее маршрут. Надеюсь, вам будет интересно. \r<br />\r<br />Деревянные изделия. \r<br /> В плагине реализован крафт мебели и переносного инвентаря. Пока доступны столик и стул, койка, тумбочка и бочка, дрова для костра, вертел, шатер, спальник, сундук, знамена с логотипом фермы, империи или братьев бури, а также тренировочный манекен и мишень для стрельбы. Также есть уникальные знамена, рецепты на создание которых появятся в кузнице при наличии эскиза. Сможете немного украсить свой приусадебный участок. Устанавливаются все созданные предметы простым выбрасыванием из инвентаря. Чтобы забрать предмет обратно, нужно активировать его в режиме скрытности. Переносной сундук дает вам возможность удаленного доступа к основным контейнерам в доме. Также вы можете создавать секции плетеного забора в кузнице. После выбрасывания такой секции из инвентаря она установится прямо перед вами. Если вам не понравилось, как она расположилась, вы можете забрать ее обратно простой активацией. Когда вы подобрали для нее оптимальное положение, можете ее установить активацией из режима скрытности, после чего она станет для вас неактивна и превратится в статический объект. Материал для создания всех объектов преимущественно древесина. \r<br />\r<br />Сложные конструкции.\r<br />Сложные конструкции требуют наличия чертежа, состоят из нескольких блоков и сооружаются в несколько этапов. Сначала устанавливается первый блок путем простого выбрасывания из инвентаря. На этом этапе вы можете забрать его обратно в режиме скрытности, если вам не понравилось расположение. Далее, путем обычной активации, вы добавляете следующие блоки до финальной стадии и в конце чертеж у вас изымается. Пока доступен крафт ветряков (необходимы для запуска водяного колеса, получения доступа к оранжерее и запуска гончарного круга), алтаря девяти богов (дает на выбор любое благословение аэдра), мольберта (позволяет рисовать), ксилофона (позволяет играть музыку) и, возможно, умывальника (при использовании дает эффект «Свежесть»). Подробности их создания в самом чертеже. После полной установки конструкции вы можете разобрать ее на составляющие, активировав в режиме скрытности, но для повторной установки вам вновь потребуется чертеж. Ветряки, в отличие от остальных конструкций, устанавливаются в строго отведенных местах на крыше и после установки уже не разбираются.\r<br />\r<br />Хозяйка.\r<br />На маленьком островке напротив фермы пытается согреться у костра девушка-утопленница. Ее историю вы сможете узнать из записки, найденной в пенале. Девушку зовут Кенья, она дочь прежнего владельца дома. С ней можно взаимодействовать. После того, как вы принесете ей амулет отца («Амулет хозяина фермы») она отдаст вам единственное, что у нее есть – свою рваную одежду. Впоследствии вы сможете возвращать и снова забирать ее лохмотья. Также вы сможете позвать девушку жить в дом и снова прогнать на остров.  Кенья полностью автономна и не зависит от ваших реплейсеров. Имея при себе лохмотья Кеньи, вы сможете починить их на дубильном станке до состояния нормальной одежды и вернуть хозяйке. После этого одеть или раздеть девушку вы больше не сможете. Если вы пригласили ее жить в дом – она, возможно, сможет обучить вас игре на музыкальных инструментах.\r<br />\r<br />Музыка и танцы.\r<br />После того, как вы угостили каджита соленой рыбкой, он, при получении соответствующего достижения, может обучить вас двум простеньким танцам, анимации для которых взяты от Цицерона. Каждый танец стоит 25 соленых рыбок. Аналогичным образом Кенья, при получении соответствующего достижения, может обучить вас игре на музыкальных инструментах, при условии, что вы пригласили ее жить в дом. У девушки умения покупаются за драгоценные камни. После обучения вы сможете сыграть по одной мелодии на барабане, флейте и лютне. Конечно же, для этого вам потребуются сами инструменты. Все эти навыки добавляются вам в виде талантов и могут быть использованы только в небоевом режиме (т.е., со сложенным оружием). Избавиться от этих навыков вы можете с помощью книги управителя.\r<br />\r<br />Рисование.\r<br />Для тех, кому некуда девать канцелярские принадлежности, добавлен мольберт, с помощью которого вы сможете тратить бумагу, перья и чернила, создавая при этом рисунки (подробнее об изготовлении мольберта читайте в разделе «Сложные конструкции»). Рисунки получаются случайные (считайте, что это зависит от настроения вашего довакина). Вы можете разместить их в мастерской, используя рамки для картин (подробнее читайте в разделе «Мастерская»). \r<br />\r<br />Ксилофон.\r<br />Новая сложна конструкция, с помощью которой ваш герой может наигрывать различные мелодии. Для музицирования вам понадобятся ноты, которые можно получить по почте. Для этого вам нужно заказать у смотрителя почтовый ящик, который появится на столбе перед входом под навес. Новое письмо приходит каждые пять дней с момента получения предыдущего. О получении письма вы будете извещены сообщением в верхнем левом углу экрана и характерным звуком. Вскрыть конверт можно с помощью канцелярского ножа, который находится в доме на уголке стола под лестницей. После вскрытия вы получите случайный листик с нотами для одной из девяти мелодий.\r<br />\r<br />Выпивка и закуска.\r<br />На винокурне вы сможете изготовить ржаную водку. Она проста в приготовлении и потребует лишь наличия ржаного зерна. Водка дает один или несколько случайных положительных эффектов, но при этом накладывает негативный эффект – опьянение. Чтобы нейтрализовать опьянение вам понадобится закуска, которая создается в котелке при наличии полного комплекта повара, рецепта и стеклянной банки – это пряные яблоки и помидоры. Каждая банка с консервацией содержит три порции. Закусывайте после каждой бутылки и никакие побочные эффекты вам не страшны.\r<br />\r<br />Заготовка мяса.\r<br />На пляже перед домом вы найдете завалившуюся каменную колонну, происхождение которой мне неизвестно (это ванильный элемент окружения). При тщательном осмотре вы обнаружите, что ее можно расколоть киркой на два аккуратных каменных блока. Для этого вам понадобится именно фермерская кирка, которую вы получили от каджита и, я надеюсь, не выбросили. После расправы с колонной вы сможете заказать у смотрителя две сушилки для мяса, которые будут установлены на тех самых блоках. Одна из сушилок предназначена для вяления мяса крупных животных (коза, корова, олень или лошадь), а другая – для мелких (кроль, курица или фазан). Обе вмещают по пять кусков мяса. Необходимую для процесса веревку вы можете создать на дубильном станке из шерсти. Спустя три дня после помещения мяса на сушилки вы сможете получить вяленый окорок за каждый большой кусок мяса и вяленую ножку за каждый мелкий кусок. Вяленое мясо вы можете употребить самостоятельно, отдать собаке или изготовить из него наживку для удочки в котелке. Лично я рекомендую дружить с собакой.\r<br />\r<br />Ветряки.\r<br />Ветряки – это новые сложные конструкции, которые тоже состоят из двух блоков, но в отличие от остальных конструкций, устанавливаются в специально отведенных местах на крыше. Они необходимы для получения доступа к оранжерее. Верхний ветряк приводит в движение подъемник, а нижний – запускает водяное колесо, которое откачает воду из затопленной оранжереи и будет приводить в действие систему полива растений, а также гончарный круг. Доступ на крышу для установки ветряков вы можете получить, починив предварительно одну из лестниц с помощью веревки, которая создается на дубильном станке из шерсти животных.\r<br />\r<br />Оранжерея.\r<br />Позади дома, за винокурней, вы найдете заколоченный подъемник для спуска в оранжерею. Его можно починить, имея при себе 10 поленьев и установив на крыше верхний ветряк. С торцевой стороны дома, которая прилегает к озеру, есть бездействующее водяное колесо, которое должно нагнетать воду в оранжерею для полива растений и откачивать лишнюю. Колесо можно запустить после того, как вы установили нижний ветряк. Когда вы починили подъемник и запустили колесо, у вас появится возможность сажать эльсвейрские растения в оранжерее. Всего их четыре вида, как и мест для их посадки. Корешки для посадки растений можно купить у каджита в контрабандном товаре, который он показывает, если вы пригласили его в дом. Шанс появления корешков в продаже 50%. Когда накупите корешков, активируйте грунт в оранжерее и выберите, какое растение и в каком месте хотите посадить. После посадки каждое растение позволит вам вдохнуть свой аромат, который даст положительный эффект на 8 часов. В режиме скрытности вы можете вернуть растение в инвентарь, чтобы пересадить в другое место. Также в оранжерее присутствуют стойки для фермерских инструментов (их подробный перечень смотрите в разделе «Инструментарий»). Вам нужно активировать стойку, как обычный контейнер, и поместить внутрь один выбранный инструмент, после чего он установится и вы в любой момент сможете забрать его снова. Еще в оранжере есть месторождение глины, с помощью которого вы сможете добывать этот материал в неограниченых количествах (нужна фермерская кирка).\r<br />\r<br />Гончарный круг.\r<br />Этот станок станет доступен при запуске водяного колеса, которое будет придавать ему вращательный момент. Среди предметов для изготовления вы найдете горшки (их можно устанавливать на землю простым выбрасыванием из инвентаря и помещать в них как в рамку для картин декоративные букеты, создаваемые на заготовочном столе), бутылки (нужны для создания вина на винокурне), миски (нужны для приготовления некоторых домашних блюд), блюда (нужны для приготовления праздничных блюд) и лампу для освещения. Основным материалом для крафта является глина, которую можно покупать у смотрителя или добывать в оранжерее. Рядом расположен контейнер для хранения глины и глиняных изделий, а на нем полочки для установки бутылок с домашним вином (работают так же, как и рамки для картин).\r<br />\r<br />Освещение.\r<br />С торцевых сторон дома (возле винокурни и возле рубочной колоды) вы найдете шнуры для крепления фонарей. Всего фонарей три вида и каждый изготавливается на своем станке: глиняный на гончарном круге, стеклянный в плавильне и железный в кузнице. Устанавливая фонари на шнуры вы сможете освещать свой дом в темное время суток.\r<br />\r<br />Книга управителя.\r<br />В личном кабинете вы найдете на столе книгу управителя, активировав которую, сможете получить доступ к дополнительным функциям. Вы сможете изменить систему взаимодействия с животными (новая оконная система или старая система диалогов), вы сможете изменить звук и циферблат часов, вы сможете удалить ненужные вам навыки (свиста, танцев или игры на музыкальныз инструментах) и еще сможете получать подарки от автора плагина (даты, в которые можно получить подарок, указаны в самой книге).\r<br />\r<br />Система достижений.\r<br />За определенное количество некоторых действий в своем хозяйстве вы будете получать достижения, которые дадут вам бонусы в виде новых возможностей. Эти достижения отображаются на стенде в вашем кабинете. Активировав уже полученные вы увидите полную информацию по ним. Всего достижений 12 (или 13). Первое из них вы получите выполнив вступительные задания. Если вы хотите, чтобы их получение являлось для вас приятным сюрпризом – просто играйте в свое удовольствие, а если вам не терпится поскорее их получить – прочтите полный перечень достижений с условиями их получения и предоставляемыми бонусами в конце файла РидМи.\r<br />\r<br />\r<br />\r<br />Еще хочу попросить вас отписывать в комментариях по поводу наличия или отсутствия багов, недоработок и т.д. Если все работает хорошо, то я буду рад увидеть комментарий, подтверждающий это. И отпишите по поводу совместимостей. Если кто-то использует плагины RND, FrostFall, iNeed, сообщите пожалуйста корректно ли работает с ними ферма.\r<br />\r<br />[b]Требования:[/b]\r<br />\r<br />Версия игры Skyrim 1,8 и выше;\r<br />SKSE соответствующей версии;\r<br />DLC Dawnguard.\r<br />\r<br />[b]Конфликты:[/b]\r<br />\r<br />Возможны конфликты с любыми модами, изменяющими локацию, в которой расположена ферма, и близлежащие территории, а также изменяющими поведение ванильных лошадей и систему крафта.\r<br />\r<br />[b]Установка:[/b]\r<br />\r<br />Скопируйте папку Data из архива в каталог с игрой, подключите MilkEgg.esp в лаунчере, играйте. При обновлении копируйте все остальные папки плагина с заменой файлов.\r<br />\r<br />Если вы используете плагин Realistic Needs and Diseases, тогда скопируйте в папку Data и подключите в лаунчере файл MilkEggPatchRND.esp из папки Fixes.\r<br />\r<br />[b]Удаление:[/b]\r<br />\r<br />Отключите мод в лаунчере и удалите все его файлы.\r<br />\r<br />[b]Видеообзор последней версии:\r<br />\r<br />[youtube]QzepiPBtFAc[/youtube][/b]",
  "categoryId": "53",
  "version": "1.0",
  "author": "slastik",
  "createdUnix": "1503006692",
  "updatedUnix": "1503006465",
  "containsAdultContent": false,
  "uploadedBy": "slastik",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000252200",
      "name": "Little Farm (rus)",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "124755",
      "fileName": "Little Farm (rus)-86092-1-0.7z",
      "uploadedUnix": "1503006465",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d98ea2c411a87b959097334f0df6dc31d3f94d80029c371cb1587d309f56236a/analysis/1503006555/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Little%20Farm%20%28rus%29-86092-1-0.7z?fid=1000252200&ttl=1535874935&ri=8192&rs=8192&setec=c4144c182284a1b93bea191c9af39022"
    }
  ]
}