{
  "modId": 8612.0,
  "modName": "Riverside Cabin for new Adventurers",
  "summary": "A simple, rustic cabin near Riverwood, with a wraparound deck and a nice view of the water.",
  "descriptionHtml": "This is a small, simple, rough-hewn cabin, well-suited to beginning characters, or experienced ones. My goal was to make something that looked good, fit the surroundings, and didn\\'t give any major advantages. No god items or chests o\\' gold here. \r\n\r\nThe cabin has a bed, table, usable cooking pot, table, some ingredients, and a small chest for storage. And a perfect deck for barbeques ... err... tanning leather on the rack. \r\n\r\nThere\\'s also a small footbridge connecting it to Riverwood, near the mill.\r\n\r\nThis is my first mod ever, so if you see something that doesn\\'t work, or looks bad, please let me know, and I\\'ll do my best to fix it. \r\n\r\nKnown \\\"issues\\\":\r\n\r\n- I haven\\'t navmeshed the exterior yet, so I\\'m unsure how companions and other NPCs will react. I\\'m working on completing the navmesh, but it\\'s a lot to get a handle on. If anyone feels like helping, that would be appreciated. :)\r\n\r\nFuture plans:\r\n\r\nInstead of having it available to players from the get-go, I\\'d like to have the cabin purchasable for somewhere between 750 and 2000 gold, or winnable - via quest - from one of the folks in Riverwood. I just need more time with the CK to sort that out. \r\n\r\nYou\\'re welcome to use this as you see fit, just give credit where credit is due. \r\n\r\nThanks Bethesda, for the amazing game, and mod tools.\r\n",
  "categoryId": "67",
  "version": "1.0",
  "author": "MalleusNoctum",
  "createdUnix": "1328837355",
  "updatedUnix": "1328837879",
  "containsAdultContent": false,
  "uploadedBy": "malleusnoctum",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28132",
      "name": "thecabin",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "11",
      "fileName": "thecabin-8612-1-0.zip",
      "uploadedUnix": "1328837879",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b15a02e2e15924c0399da47f5ef600785877f109e377b362ebe578e0994e203c/analysis/1406665761/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/thecabin-8612-1-0.zip?fid=28132&ttl=1535767494&ri=8192&rs=8192&setec=5d3047f7074b97ac4d4f7593601c13e6"
    }
  ]
}