{
  "modId": 86191.0,
  "modName": "Better Khajiit- Subspecies",
  "summary": "A small lore friendly mod that I think adds to the overall immersion of Skyrim.",
  "descriptionHtml": "Hey guys, this is my first mod so don&#39;t judge too harshly. \r<br />When I had the Idea for this mod, I was looking through some of The Elder Scrolls lore, and what I found changed my view of the badass Khajiit. I Always thought that there was only one type of Khajiit, and that there were just different colors. But what I found was that there were a ton of unmentioned subspecies of Khajiit&#33; I thought it sucked that Bethesda or any other modder hasn&#39;t done this, (save for the Cathay-Raht in Moonpath to Elsweyr, along with the Pahmar) so I decided to start up the Creation Kit, and try my hand at modding&#33; I couldn&#39;t add all of the subspecies, but I have added quite a few. Once I know more about modding, I&#39;ll add the other ones to it. My main problem was with the Ohmes and the Pahmar. Thanks so much for your support&#33;\r<br />The races I added:\r<br />First off, I changed the original Khajiit to the Suthay. So the races other than the Suthay are:\r<br />\r<br />Suthay-Raht\r<br />\r<br />Cathay\r<br />\r<br />Cathay-Raht\r<br />\r<br />Dagi\r<br />\r<br />Dagi-Raht\r<br />\r<br />Tojay\r<br />\r<br />Mane\r<br />\r<br />Senche\r<br />\r<br />Warning, there is a bit of a problem with the Senche. For some reason you can only use the default options. I&#39;ll fix it eventually, don&#39;t worry.\r<br />Thanks again for supporting my mod&#33; And for those coming from my Sans and Chara NPC from Gmod, thanks for waiting for this mod. I had to learn a ton of stuff to be able to do this. I had absolutely NO experience making my own mod for Skyrim. Pls leik & Subscrib.\r<br />\r<br />The mod is also available on the Steam Workshop.",
  "categoryId": "27",
  "version": "v1.0",
  "author": "Omocron",
  "createdUnix": "1503338657",
  "updatedUnix": "1503338657",
  "containsAdultContent": false,
  "uploadedBy": "Omocron",
  "primaryFile": null,
  "files": []
}