{
  "modId": 86339.0,
  "modName": "Armoured Robes",
  "summary": "This is a rework (or call it a “lite” version) of the “Armored Mage Robes” mod.",
  "descriptionHtml": "This is a rework (or call it a “lite” version) of the “Armored Mage Robes” mod...\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/16722]http://www.nexusmods.com/skyrim/mods/16722[/url]\r<br />\r<br />It is not an add-on, it is a replacement. Not that anything would break if you run them both together but it’d be pointless.\r<br />\r<br />You will find a better description and relevant images of the mod over there. What I’ve done with it is...\r<br />\r<br />All enchanted variants have been deleted, except for destruction and magicka. This basically means that if an NPC has one of these robes then (based on their own level as to which class they receive), they will have either an non-enchanted one, a fortify destruction or magicka regen version. Or you might find them in a box.\r<br />\r<br />Base armour starts at 20/25 (light/heavy) and goes up by 5 for each class. In other words, the armour has been decreased a fair amount because I personally felt they were way too protective - there was simply no incentive to use proper armour at all, let alone for mages, except for the aesthetic values of course. At least I can say that about my own style, and hence why I changed it all in the first place.\r<br />\r<br />The ingot requirements have been decreased because the mythic smithing perks take a very long time to acquire. For this reason, the loot levelling has also been reduced slightly so that NPCs under level 30 might be wearing an expert robe.\r<br />\r<br />Crafting the non-enchanted items is simpler and requires the following...\r<br />\r<br />Light : 1x Ingot, 1x Linen Wrap, 2x Leather, 2x Leather Strips\r<br />Heavy : 2x Ingot, 2x Linen Wrap, 3x Leather, 3x Leather Strips\r<br />\r<br />Ingot requirements (light/heavy)...\r<br />\r<br />Novice : Iron / Iron\r<br />Apprentice : Steel / Steel\r<br />Adept : Corundum / Orichalcum \r<br />Expert : Moonstone / Quicksilver\r<br />Master : Glass / Ebony\r<br />\r<br />The above applies to tempering as well.\r<br />\r<br />Smithing skill prerequisites...\r<br />\r<br />Novice : No skill requirements\r<br />Apprentice : Steel (or “Basic”, unlocks both light and heavy)\r<br />Adept : Elven or Dwarven (either unlocks both light and heavy)\r<br />Expert : Advanced (required for light) or Orcish (either for heavy)\r<br />Master : Glass (required for light) or Ebony (required for heavy)\r<br />\r<br />Note that some perk mods might combine several skills into one. A good example is the Smithing Perks Overhaul which combines Elven/Dwarven and Glass/Ebony, so I’ve worked this system to hopefully suit both the vanilla tree and that particular mod. Problems might arise with other such mods but I couldn’t do anything about that. Either way, it seems to be working just fine with the crafting overhaul which is good. Also note that all of the robes are now situated under the “Clothing” section of the crafting menu rather than being in separate ones for each material type. Also bear in mind that the robes cannot be broken down.\r<br />\r<br />So far as compatibility is concerned, this should be free of conflicts so long as there are no other mods which change the loot system in respect of robes, so that consideration is only where load-order is relevant (otherwise it should be able to go anywhere). It has not been tested on any DLC but I don’t see why it wouldn’t work on any of them. It does not run any scripts whatsoever and has no interaction with the SKSE, so it is lightweight and should thus be problem-free.\r<br />\r<br />And finally... if you have been so kind as to endorse this file then please pop along to the original mod and endorse that one as well.",
  "categoryId": "54",
  "version": "1.00",
  "author": "Kapteyn",
  "createdUnix": "1503960207",
  "updatedUnix": "1503960204",
  "containsAdultContent": false,
  "uploadedBy": "Kapteyn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000253128",
      "name": "Armoured Robes",
      "version": "1.00",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Armoured Robes-86339-1-00.7z",
      "uploadedUnix": "1503960204",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/3aab606fe2db9e312b65eaa8d36c6fb4237ed16585721689bf518167a704de08/analysis/1503960251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Armoured%20Robes-86339-1-00.7z?fid=1000253128&ttl=1535875208&ri=8192&rs=8192&setec=0090065f2ce1a76ba3612ad21346c513"
    }
  ]
}