{
  "modId": 8634.0,
  "modName": "Legendary Artifacts",
  "summary": "Modifies the Artifacts of Skyrim so that they are truly Legendary.",
  "descriptionHtml": "[img]http://skyrim.nexusmods.com/downloads/images/8634-1-1328973511.jpg[/img]\r\n\r\nThis mod alters the Artifacts of Skyrim so that they are truly Legendary. So it\\'s time to dust off your collection of artifacts and perhaps put them to use in place of some of your incredible self-crafted daedric and dragon weapons and armor.\r\n\r\nThe weapons and armor have had their base values increased slightly higher than Daedric. All weapons and armor can now be fully tempered and have crafting associated perks. Enchantments have been increased in strength or in some cases had new ones added to reflect the ones they have had in Oblivion or Morrowind. \r\n\r\nArtifact Changes Include:\r\n\r\nNote: This is a list of the enchantments changed or added and the artifacts still include some of their other original untouched enchantments. Eg. Mace of Molag Bal still has Soul trap 3 seconds.\r\n\r\nDawnbreaker - Fire damage increased to 30 points.\r\n\r\nEbony Blade - Weapon damage/range now reflect a two-handed weapon\r\n\r\nKeening - Enchantment now functions and Health, Stamina, and Magicka absorb increased to 25 points.\r\n\r\nMace of Molag Bal - Enchantments changed to Absorb Health, Stamina, and Magicka 25 points to match the vampiric qualities from lore, and previous elderscroll games. \r\n\r\nMehrunes Razor - 25 Poison damage over 5 seconds added.\r\n\r\nStaff of Magnus - Magicka and Health drain increased to 75 points.\r\n\r\nVolendrung - Added 10 points of Health Absorb over 10 seconds, and paralysis 3 seconds.\r\n\r\nWuuthrad - No new enchantments added, but fully craftable now so has the potential to do much more damage.\r\n\r\nArchmage\\'s Robes - Spell Cost Reduction increased to 25% for each school, Magicka Regen increased to 150%, and Fortify Magicka increased to 80 points on the hooded version.\r\n\r\nEbony Mail - Poison damage increased from 5 to 15 points.\r\n\r\nThe Gauldur Amulet - Fortify Health, Stamina, and Magicka increased to 80 points, Magicka Regen added at 100%.\r\n\r\nMasque of Clavicus Vile - Fortify Barter increased to 30 points.\r\n\r\nNecromancer Amulet - Fortify Magicka increased to 130 points, Conjuration spell cost reduction increased to 75%.\r\n\r\nSavior\\'s Hide - Resist Magic increased to 25%, Resist Poison increased to 100%\r\n\r\nShield of Ysgramor - Resist Magic increased to 25%, Fortify Health increased to 100 points.\r\n\r\nSpellbreaker - Magic Ward increased to 150 points, and passive Resist Magic added at 25%.\r\n\r\nNote: All base weapon damages have been increased to 2 and 4 points higher than daedric, for one-handed and two-handed weapons respectively, and similar increases for the armors. \r\n\r\nIf you enjoy this mod feel free to endorse it.\r\n\r\nCredits:\r\nThanks to all modders who make my Elderscrolls experiences better all the time.\r\nTo Bethesda for creating incredible games.\r\n",
  "categoryId": "28",
  "version": "1.0",
  "author": "Goth79",
  "createdUnix": "1328845062",
  "updatedUnix": "1328845442",
  "containsAdultContent": false,
  "uploadedBy": "Goth79",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28188",
      "name": "Legendary Artifacts",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Legendary Artifacts-8634-1-0.rar",
      "uploadedUnix": "1328845442",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c7aa2bf97c98bb04b85c27486762c5e5534a3337b7cdc13b04cc8760f29eb5f8/analysis/1406666104/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Legendary%20Artifacts-8634-1-0.rar?fid=28188&ttl=1535767548&ri=8192&rs=8192&setec=1791a04bee866d64a7623bd583a3c839"
    }
  ]
}