{
  "modId": 86348.0,
  "modName": "Skyrim New Master Spells",
  "summary": "Adds awesome new Master Level Spells to the game. New Destructive spells will not harm followers friendlies (town&#39;s folk or civil war comrades). Provides fantastic new utility spells to enhance your gameplay experience. Usable as mage, warrior or stealthy characters.",
  "descriptionHtml": "[b][b][b][b][color=#00ffff][b]This mod is also available for [u]Skyrim Special Edition[/u], which can be found [url=http://www.nexusmods.com/skyrimspecialedition/mods/11869?][u]here[/u][/url].[/b][/color][b]\r<br />[/b][/b][/b][/b][/b]\r<br />\r<br />\r<br />Were you also disappointed when you finally got to level 100 with a school of magic only to find the Master Level spells were rubbish?  Especially Destruction and Restoration Magic’s Master spells? Did you also find that although it looked cool, the Master Destruction spells were practically useless with the long charge up animation and 4.5 second casting time duration that was easily interruptible with any hit you received?\r<br />\r<br />Thinking back on it, the Destruction spells I enjoyed using most were the first three spells you learned, namely [url=http://elderscrolls.wikia.com/wiki/Flames]Flames[/url], [url=http://elderscrolls.wikia.com/wiki/Frostbite_(Skyrim)]Frostbite[/url] and [url=http://elderscrolls.wikia.com/wiki/Sparks_(Skyrim)]Sparks[/url]. When used these spells were cast instantly and issued a continuous stream of destruction magic that was not interruptible. \r<br />\r<br />Too bad that you out-leveled them, in that they did too little damage for practical use at higher levels. Another aspect that disappointed me about  destruction magic is that you could not use it amongst friendlies without also harming them (thinking about the civil war and town&#39;s folk battling vampires and such). \r<br />\r<br />Until Now.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][b]What this mod does?[/b][/color]\r<br />\r<br />This mod adds new Master Level Spells to the game. Destruction, Restoration, Illusion and Alteration spells.\r<br />\r<br />\r<br />[color=#ffff00]\r<br />[b]1. New Master Destruction Spells[/b][/color]\r<br />\r<br />This mod adds three new Destruction spells to the game:\r<br />\r<br />[u][color=#ff7700][b]Master Flames[/b][/color][/u]\r<br />\r<br />Issues a torrent of instant fire that is not interruptible and which that does high fire damage per second to the target. The flame can pass through targets and damage multiple enemies simultaneously, in you frontal arc.\r<br />\r<br />Targets are also set on fire, which does extra fire damage. There is a 50% chance to incinerate the target. Additionally it harms hostile targets only. Cannot affect companions or friendlies, so feel free to use it to roast vampires, and such, right amongst the town people, without the flames harming friendlies.\r<br />\r<br />[u][color=#6d9eeb][b]Master Frost[/b][/color][/u]\r<br />\r<br />Issues an instant blast of frost that is not interruptible and which that does high frost damage per second to the target. It slows enemies down and will damage multiple front-facing enemies at once. It has a chance to paralyse-freeze targets. Also it harms hostile targets only. Cannot affect companions or friendlies, so feel free to use it to use it amongst friendlies.\r<br />[u]\r<br />[color=#a4c2f4][b]Master Lightning[/b][/color][/u]\r<br />\r<br />Issues a torrent of instant fire that is not interruptible and which that does high shock damage per second to the target. Lightning damages Health and Magicka. The spell has a 50% chance to disintegrate the target. Additionally the spell harms hostile targets only. Cannot affect companions or friendlies, so feel free to use it to electrocute enemies, whilst amongst companions, civil war comrades and town’s people - without the lightning harming friendlies.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][b]2. New Master Restoration Spell[/b][/color]\r<br />\r<br />This adds a new boosted healing spell to the game:\r<br />[u][color=#e69138]\r<br />[b]Master Healing[/b][/color][/u]\r<br />\r<br />It is a powerful area of effect healing spell that will heal yourself and all friendlies close to you - in a radius of 20 meters around you - for 300 health points per second. If you have the regeneration perk it will heal 450 points of health. This is aimed at the end level game and the advanced healing will make keeping yourself and companions / friendlies alive at high levels much easier.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][b]3. New Master Alteration Spells[/b][/color]\r<br />\r<br />This adds a new boosted mage armor spell and illumination spell to the game:\r<br />[u]\r<br />[color=#00ffff][b]Stalhrimskin[/b][/color][/u]\r<br />\r<br />It is a powerful spell that will grant 80% physical damage reduction to you for a period of 300 seconds. \r<br />\r<br />This is the equivalent of achieving a displayed armor rating of 567, which is the maximum possible reduction that can be achieved with regular armor.\r<br />The damage reduction will also stack with regular armor, if the armor was first equipped before casting the spell. It lasts for five minutes.\r<br />\r<br />[u][color=#00ffff][b]Master Candlelight[/b][/color][/u]\r<br />\r<br />It is a utility spell that creates a hovering orb of light above you that follows you for 300 seconds. \r<br />\r<br />If dual cast, the spell will last 600 seconds (10 minutes). It illuminates dark areas such as crypts and tunnels to help making navigating them and avoiding traps easier. This alters the original candlelight spell to make it more useful by lasting longer and not needing to be recast every minute.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][b]4. New Master Illusion Spell[/b][/color]\r<br />\r<br />This adds a new boosted illusion spell to the game:\r<br />\r<br />[u][color=#ff00ff][b]Master Invisibility[/b][/color][/u]\r<br />\r<br />Master Invisibility is very useful for stealth players. This boosted spell is extremely useful for sneaking, as it is an instant cast spell that will last for 300 seconds, or until you kill an enemy. It can be cast instantly again allowing another sneak attack, allowing you to clear rooms of enemies very fast. The spell will break when looting or picking a lock, but can be cast instantly again afterwards, which allows you to go into sneak instantly and perform another sneak attack, even if already detected. \r<br />\r<br />This spell adds the [url=http://elderscrolls.wikia.com/wiki/Quiet_Casting#Quiet_Casting]quietcasting[/url] perk to you, which means you can remain undetected when recasting the spell, whilst invisible, without the sound of recasting the spell alerting enemies to you.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][b]How to get the new spells?[/b][/color]\r<br />\r<br />The following vendors will sell them when you are at the Master Level (100) of the school of magic: \r<br />\r<br />All Court Wizards: Madena (Dawnstar), Calcelmo (Markarth), Wylandriah (Riften), Sybille Stentor (Solitude), Farengar (Whiterun) and Wuunferth (Windhelm) will sell them, provided you are level 100 in the respective school of magic.\r<br />\r<br />And most of the General goods stores (such as Belethor in Whiterun) and the Khajiit caravans will sell some of them.\r<br />[b]\r<br />[/b]However, if you do not want to wait to level up to level 100 in the magic schools before obtaining the spells,[b] [u]you can get them earlier by taking the spell-books from the strongbox[/u] [/b]on the table in Farengar’s library in Dragonsreach, Whiterun. [b]\r<br />[/b]\r<br />For those who don&#39;t want to wait, taking the spells from Farengar&#39;s library will bypass the need for you to be level 100 in the school of magic to cast them. You can technically cast them on any level provided you have enough magicka. (Tip Fortify Magicka potions and gear will help.)\r<br />\r<br />Ps. It wont be stealing as the box and items have been flagged as Dragonborn&#39;s property :)\r<br />\r<br />\r<br />\r<br />[color=#ffff00][b]Compatibility[/b][/color]\r<br />\r<br />This standalone mod just adds a new spells to the game should be compatible with just about any other mod out there.\r<br />\r<br />\r<br />\r<br />[color=#ffff00][b]Credits[/b][/color]\r<br />\r<br />This mod was created using TES5Edit.\r<br />\r<br />\r<br />\r<br />[b][color=#ffff00]Please also check out my other mods[/color]\r<br />[/b][b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/86351/?]Enhanced Skyrim Enchanting[/url] [/b] by Avengarth[b][b]\r<br />[/b]\r<br />[url=http://www.nexusmods.com/skyrim/mods/86389?][b]Dragonborn’s Razor[/b][/url][/b] by Avengarth[b]\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/86802/?][b]Celestial Bow[/b][/url] by Avengarth\r<br />\r<br />\r<br />\r<br />[color=#ffff00]Installation[/color][/b]\r<br />\r<br />Extract the contents of the zip file to your Skyrim&#92;Data&#92; folder. Launch the game with a mod manager such as the NMM.\r<br />\r<br />If you have any suggestions or requests on how to improve this mod, please feel free to contact me.\r<br />\r<br />PS: If you liked this mod please be so kind as to endorse it :) ",
  "categoryId": "75",
  "version": "1.0",
  "author": "Avengarth",
  "createdUnix": "1503998579",
  "updatedUnix": "1504046450",
  "containsAdultContent": false,
  "uploadedBy": "Avengarth",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000253204",
      "name": "Skyrim New Master Spells",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "4",
      "fileName": "Skyrim New Master Spells-86348-1-0.7z",
      "uploadedUnix": "1503997734",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/02ca8a6af9d584c24d6716b849896010a744d6a805757cb3d10c7565b3d08fce/analysis/1503998041/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20New%20Master%20Spells-86348-1-0.7z?fid=1000253204&ttl=1535875249&ri=8192&rs=8192&setec=8a2e8a07a31897ad88e10b726e29bca9"
    },
    {
      "fileId": "1000253274",
      "name": "Skyrim New Master Spells",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Skyrim New Master Spells-86348-1-1.7z",
      "uploadedUnix": "1504046450",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/d07c322932441607ed23eed522b636e7bb98250f569f81a49ce4d798651e946d/analysis/1504046647/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20New%20Master%20Spells-86348-1-1.7z?fid=1000253274&ttl=1535875250&ri=8192&rs=8192&setec=8fd5613c5b6468879913b627103c4eb7"
    }
  ]
}