{
  "modId": 86399.0,
  "modName": "TES.V Resurrection of the Deep Elves",
  "summary": "This mod is a WIP Overhaul of all Dwarven ruins, which adds a new race of Dwemer that dwell within. Eventually, it will overhaul all ruins, after a major quest line, to look pristine and new, and reestablish the Deep Elf Empire upon Nirn.",
  "descriptionHtml": "Ladies and Gentlemen, I present to you my first major modification to the Elder Scrolls Skyrim: Resurrection of the Deep Elves&#33;\r<br />\r<br />[size=5][b][u][i][color=#ffff00]Purpose[/color][/i][/u][/b]\r<br />[/size]\r<br />This mod will add the Deep Elves back to their ruins across Skyrim. It adds a couple of Named NPCS, like King Dumac, Kagrenac, and two followers. Eventually, I want to add a questline to provide a lore-friendly explanation for their disappearance and reappearance back on Nirn. This would revolve around taking back Dwemer City States in giant siege-styled battles, performing science-related quests for Kagrenac, and the destruction of the Falmer. There will also be a reconciliation with the last isolated Sanctuary of Snow Elves in existence, with a formal alliance being declared between the two fledgeling powers. Stay tuned. \r<br />\r<br />[color=#ffff00][size=5][u][i][b]Plot[/b][/i]\r<br />\r<br />[/u][/size][/color]When the Hero of Daggerfall destroyed the Numidium, an unfortunate (or fortunate) side effect from the activation, the Dwemer Spirits which formed the skin were subsequently released from their prison, after the Brass Tower fell. They wandered throughout Tamriel, for years after the destruction, as restless spirits, invisible to the naked eye and the common magical senses of mages. As time passed, the disembodied Deep Elved grew tired of their formless state and beseeched their King, Dumac, to pray to the Divines they scorned for redemption. The King chose to pray to Auriel, the god of the Snow Elves, their former adversaries, and asked him to return them to their mortal states. Auriel took pity on his enemy, and returned them to Nirn with a quest to right their wrongs and reclaim their empire in his name.\r<br />\r<br />[color=#ffff00][size=5][b][i][u]Features[/u][/i][/b][/size][/color]\r<br />\r<br />[list]\r<br />[*]Male and Female Dwemer NPCs, currently in Blackreach and Alftand\r<br />[*]Four Named NPCS, including Kagrenac and Dumac. \r<br />[*]Two Dwarven followers in the Debate Room, within Blackreach\r<br />[*]Male and Female Guards, as well as a crime system within the City states. Your shenanigans in Blackreach are over ;)\r<br />[*]New Cell: Royal Throne Room. This serves as the home of King Dumac, Kagrenac, and the War Council. There is an Armory, Audience Chamber, War Council room, and that is really all that works now.\r<br />[/list]\r<br />[color=#ffff00]Credits[/color]\r<br />\r<br />[size=2]I would like to extend my thanks to a few authors, of whom, I borrowed assets.\r<br />[list]\r<br />[*][size=2]Hallgarth: For allowing me to use your True Dwemer Race Mod and Assets. This is the literal backbone of my work, so thank you&#33;[/size]\r<br />[*][size=2]Anuiel: This mod wouldn&#39;t be complete without your Dwemer Beards mod. I thank you&#33;[/size]\r<br />[*][size=2]Zaph72: For allowing me to use your Steel Dwarven Armor to equip the City State Guards. Thanks&#33;[/size]\r<br />[/list][/size]\r<br />\r<br />[color=#ffff00]Editor&#39;s Note[/color]\r<br />\r<br />This mod is very WIP. My intention for publishing it in Alpha is to figure out how such an idea for a mod will be received, as well as figure out any bugs ahead of time. If you see any non-obvious bugs, please let me and your fellow gamers know in the comments. I am open to suggestions, and if anyone has any assets they wish to share, please let me know. I&#39;d be happy to include them&#33;\r<br />\r<br />That is all for now, don&#39;t worry. Mod development is not done here. Please stay tuned for more&#33;\r<br />~Matamelcan",
  "categoryId": "79",
  "version": "0.1",
  "author": "MatamelcanOfficial",
  "createdUnix": "1504238807",
  "updatedUnix": "1504238802",
  "containsAdultContent": false,
  "uploadedBy": "MatamelcanOfficial",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000253458",
      "name": "DwemerRotDEV.A0.1",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10107",
      "fileName": "DwemerRotDEV.A0.1-86399-0-1.rar",
      "uploadedUnix": "1504238802",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/da8e73bcf0ca860393633a9b67c5422a0c5eb47bb46acc373c402a9fd935b843/analysis/1504239097/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DwemerRotDEV.A0.1-86399-0-1.rar?fid=1000253458&ttl=1535875304&ri=8192&rs=8192&setec=2077fc98c54e4eda59d6d16129837835"
    }
  ]
}