{
  "modId": 86439.0,
  "modName": "Power of the Blood Mage",
  "summary": "Gain the power of the Blood Mage, a unique playstyle for vampires.",
  "descriptionHtml": "Gain the power of the Blood Mage, a unique playstyle for vampires.\r<br />\r<br />Once you gain the power of the Blood Mage, you will regenerate health twice as fast and gain 150 extra health. However, you will no longer naturally regenerate magicka. In order to cast spells, you will need to sacrifice your life into magicka via the spell Equilibrium. You will need to maintain a careful balance of health and magicka, luckily as a vampire you are skilled in means of obtaining life from others.\r<br />\r<br />At this time the effect is in a bottle. The potion that can be found in an urn outside of Broken Fang Cave, a known hideout for vampires. Next to it you will locate the spell Equilibrium, and a dagger enchanted to drain health. The potion lasts for quite a long time but several are included, and it respawns now and then. Included in the urn are Red Mountain Flowers, which regenerate a small amount of magicka. If you happen to completely be drained of magicka, you may not be able to use the Equilibrium spell. If so, just consume a Red Mountain Flower and continue on.",
  "categoryId": "93",
  "version": "1.0",
  "author": "Venvin",
  "createdUnix": "1504423750",
  "updatedUnix": "1504423745",
  "containsAdultContent": false,
  "uploadedBy": "Venvin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000253653",
      "name": "Bloodmage",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Bloodmage-86439-1-0.zip",
      "uploadedUnix": "1504423745",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/1c6682fa079dd0a8c0bb74dec32272d92b27a551d9b5c3740e0b0c2f573dcdc6/analysis/1504429281/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Bloodmage-86439-1-0.zip?fid=1000253653&ttl=1535875349&ri=8192&rs=8192&setec=461a39431d9a043a39ea69abca778ed2"
    }
  ]
}