{
  "modId": 86457.0,
  "modName": "Christina Grimmie- A Simple Follower Mod. In honour of a bard.",
  "summary": "A follower that can be married and wishes to go on adventures with the Dragonborn. Will you accept the task?",
  "descriptionHtml": "Hello all, first mod here and it&#39;s a rather simple one. I have had the Dragonborn Comes song stuck in my head for a week now, and listening to Youtubers sing their version of it. I came across a Youtuber, Christina Grimmie and personally I liked hers (Next to Malukah of course, I think they are both talented singers).\r<br />\r<br />But I found out Christina was killed a year previously and it made me sad to think someone murdered such a talented girl who had a lot ahead of her. So I created a Skyrim version of Christina, my modding and art skill is basic so she won&#39;t look exactly like her. If someone wanted to expand on her, even give her a questline where the Dragonborn gets to save her and kills the person trying to hurt her, or can make her look exactly like the singer, then feel free to go right ahead.\r<br />\r<br />[size=4][b]About Christina:[/b][/size]\r<br />Race: Breton. (I was going to make her into a Nord, but the Breton felt like they could look slightly more like her).\r<br />\r<br />[b]Class[/b]: Bard\r<br />[b]\r<br />Level[/b]: Starts at about 1 and scales with you, up to lv80. She is essential.\r<br />\r<br />[b]Where[/b]?&#34; In Solitude, the Bards Collage, now you may have to look for her as she does have the default wander package, she will still be in the collage. She will marry you, and will be back at the Collage if you do not have a place to live.\r<br />\r<br />[size=4][b]The road so far[/b][/size]: Christina lived in Solitude for long as she remembers, she did live in another city once upon a time, but someone with terrible darkness had stalked her, so she fled and found the Bards Collage. She sings for the people and loves to do Dragonborn Comes. However, she has been yearning for a new adventure, she needs a hero that she can feel safe with. She needs the Dragonborn, and hopes he will come to her, take her onto a grand adventure defeating wolves to dragons, to Daedra Gods. If the Dragonborn doesn&#39;t come, she swears she will go on an adventure herself, she&#39;s halfway there, knowing a few friends due to her father being a wizard, she was able to get a few items enchanted, and wields a small dagger with fire.\r<br />\r<br />Christina primary focuses on elemental powers, and will use them from afar, if anything gets into her melee range she will with a sword, and never yield. The adventurer or Dragonborn, will find a short journal in her inventory titled &#34;The Lost Melody.&#34; It may seem a bit sad, but you can bring her to smiles again. She starts out in normal clothing, but will wear armor when given to her, consider it her learning and getting better. Christina also prepares herself for getting a few things sorted, potions specifically when she or her companion needs them.\r<br />Some may think Christina is weak, but she can take care of herself (I have pitted her against five bandits, she took them out and only fell on her knees once.) So she can be a worthy hero to take on the journey.\r<br />\r<br />[size=4][b]For Immersion[/b][/size]: She should sneak and never report crimes, it&#39;s up to you, but if you want immersion, I suggest having her as a follower when you are the Dragonborn or going on adventures as the good guy. (She doesn&#39;t need to know that you are a member of the Dark Brotherhood if you just marry her, ;)). \r<br />\r<br />I suggest also doing the Helgen quest first, and recruiting her after Whiterun so that way she is following who she believes is the Dragonborn, the hero that will make bards sing her legacy forever, and her memory will live on. Give her upgraded items as well, make her grow in her character. Or do whatever you want haha.\r<br />\r<br />[size=4][b]Requirements?:[/b][/size]\r<br />Basically none. I did have the Update.esm along with it, but I assume everyone has that.\r<br />Caliente&#39;s CBBE bodies (Curvy) was used in this, along with her facemask folder. So she may look slightly different if you do not have that mod, I assume that the body will just revert to whatever replacer you are using. All her clothing is vanilla. For best result, I do say download that body replacer.\r<br />\r<br />[size=4][b]Disclaimer:[/b][/size]\r<br />I do not own Christina Grimmie, any of her songs, Youtube videos or anything relating to her, I also do not own anything from Skyrim. This mod is a tribute to a girl who life got cut short, and I felt the need to make a mod of her character, so she can really go on adventures with the Dragonborn and defeat the darkness.\r<br />Please keep all comments respectful and nothing that would disrespect the dead. I will ask mods to delete any of those posts, and fellow members to report those type of comments. \r<br />\r<br />[size=4][b]Installation:[/b][/size]\r<br />Unzip the rar file into your Skyrim/Data file. Copy and paste the folder named Facetint into your texture folder. \r<br />The FaceGenData folder goes into your Mesh folder. I think they will add a little more to what you see in the photo, but aren&#39;t too necessary. I labelled them easily so you can tell where they would go.",
  "categoryId": "96",
  "version": "",
  "author": "Umbren91",
  "createdUnix": "1504483487",
  "updatedUnix": "1504483226",
  "containsAdultContent": false,
  "uploadedBy": "Umbren91",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000253747",
      "name": "Christina Grimme",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "112",
      "fileName": "Christina Grimme-86457-.rar",
      "uploadedUnix": "1504483226",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/814873eab72ac32379dbbbedb2114f8e647c881aa7520acac4c8a2792b0db787/analysis/1504483502/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Christina%20Grimme-86457-.rar?fid=1000253747&ttl=1535875374&ri=8192&rs=8192&setec=7a3de2b77dc79f8e41958cbfd421db84"
    }
  ]
}