{
  "modId": 86538.0,
  "modName": "Making Custom Dialogue with High Quality Sound - Short Tutorial",
  "summary": "My own experience of recording and handling soundfiles",
  "descriptionHtml": "[color=#ff7700]Tutorial - you can download as pdf.[/color]\r<br />\r<br />[font=Arial, sans-serif][size=2]This is a short tutorial about best practise how to achieve high quality dialoguesound, organize and handle custom voice files when working\r<br />with creation kit. It&#39;s based on my personal experience as a former singer and today with the ck and covers some issues that are not\r<br />handled elsewhere – or I have not found that stuff. \r<br />[/size][/font]\r<br />[font=Arial, sans-serif][size=2]Please be aware that I&#39;m no sound engineer and this is only my way to do things, for you other ways may work. I try to explain it with my\r<br />words in english but don&#39;t be surprised if it sounds weird – I&#39;m german :)[/size][/font]\r<br />[font=Arial, sans-serif][size=2]I will not describe in detail how to use a special recording software because I use the old good Samplitude or today Magix Sequoia that is\r<br />different from Audacity, but I will explain what the single steps do so you can track it down in your own software.\r<br />[/size][/font]\r<br />[list]\r<br />[*][font=Arial, sans-serif][size=2]Yo need good headphones and a microphone good enough to catch a lot of f[/size][/font][font=Arial, sans-serif][size=2]requences. I have no idea about microphones that are mostly used[/size][/font]\r<br />[font=Arial, sans-serif][size=2]   for voice acting. I have the luck to own the legendary SureSM58 singer mic, but I use also a very cheap variant from Behringer that is brilliant in the high tones and pretty sensitive. [/size][/font]      [*][font=Arial, sans-serif][size=2]If your recordings are too quiet you need to send the input signal from[/size][/font][font=Arial, sans-serif][size=2] the mic through an amplifier to improve it.[/size][/font]\r<br />   [*][font=Arial, sans-serif][size=2]You need a plop filter[/size][/font]\r<br />   [*][font=Arial, sans-serif][size=2]you need to make sure that you have not too much reverb in your room. I[/size][/font][font=Arial, sans-serif][size=2]&#39;m in a normal chamber but directly before the window so there i[/size][/font][font=Arial, sans-serif][size=2]sn&#39;t much reverb as long I&#39;m close enough to the mic. Record as dry as it is possible, without any filters.[/size][/font]\r<br />[/list][font=Arial, sans-serif][size=2]\r<br />I assume you know how to record your voice files with an external program like Audacity or what ever. You should also be able to get\r<br />dialogue to work in the ck. There are enough tutorials outside that cover these things.[/size][/font]\r<br />\r<br />[font=Arial, sans-serif][color=#ff7700][size=2]First step: Prepare your recordings.[/size][/color][/font]\r<br />\r<br />[font=Arial, sans-serif][size=2]Record a silent voicefile, save it and name it NoiseReduction.wav. This file records all noises in your environment, from you computer, from a\r<br />heating, from everything you are not hearing anymore because it&#39;s so normal. Your mic will. These noises make bad quality when you record\r<br />your voice. We will use this file to clean out these noises with the noise filter after you have recorded your files.[/size][/font]\r<br />\r<br />[font=Arial, sans-serif][size=2][color=#ff7700]Second step, a golden rule:[/color] Record your voice as loud as possible but never let it clip&#33; If clipping occurs, delete the file and do it again. You\r<br />can&#39;t get good quality with clipping files. Always watch your peak level.[/size][/font]\r<br />\r<br />[list]\r<br />[*][font=Arial, sans-serif][size=2]Speak or sing directly into the microphone, not from the side. If you do[/size][/font][font=Arial, sans-serif][size=2] not you will lost frequences from your voice. An exception is a very[/size][/font]\r<br />[font=Arial, sans-serif][size=2]   sensitive singer microphone. This is sometimes better if you put it from the side very close to the mouth and so that you are not\r<br />   breathing into it. This method will have a slightly loss of deep frequences but will have brilliant high frequences.[/size][/font]   [*][font=Arial, sans-serif][size=2]Always have the same distance to your mic except you must shout very loud.[/size][/font]\r<br />   [*][font=Arial, sans-serif][size=2]Take a soundfile out of  Skyrim as a reference that sounds good enough f[/size][/font][font=Arial, sans-serif][size=2]or you and compare it with your recording. Your sound later in game[/size][/font]\r<br />[font=Arial, sans-serif][size=2]   should not stick out over the other dialogues or vanish behind them. It should sound as natural as possible. [/size][/font]      [*][font=Arial, sans-serif][size=2]Always take care of special consonants like b,p,k and your breathe. The p[/size][/font][font=Arial, sans-serif][size=2]lop prevention will not always be enough and cutting out plops is a[/size][/font]\r<br />[font=Arial, sans-serif][size=2]   real time consuming thing and it is much faster to do such lines again.[/size][/font]   [*][font=Arial, sans-serif][size=2]Spit is another issue. If your mouth gets dry the spit will start k[/size][/font][font=Arial, sans-serif][size=2]licking and the noisefilter is not able to reduce it, nor is it[/size][/font][font=Arial, sans-serif][size=2] possible to cut it out  because the curves are not showing these[/size][/font][font=Arial, sans-serif][size=2] klicks correctly. Drink water after every line if you have a lot to r[/size][/font][font=Arial, sans-serif][size=2]ecord in small units.[/size][/font]\r<br />[/list][font=Arial, sans-serif][size=2]If you hear through the Skyrim voices you will be surprised how bad some soundfiles are and I will try to explain why that is and how to\r<br />prevent this distortion after these steps.[/size][/font]\r<br />\r<br />[font=Arial, sans-serif][size=2][color=#ff7700]Step three:[/color] Use the noisefilter to clean your just recorded file. For that you need to tell your software to use your recorded NoiseReduction.wav. Normally the default settings are good enough.\r<br />What it does is to compare your dialogue file with the NoiseReduction file and delete those noises from your file. Read the manual of your\r<br />software if you can&#39;t find how to do this. I have only to click on the noise filter and load the reference file but in different programs it may be another way to achieve this. Do this before&#33; you normalize your file because the noise will be normalized, too and you can&#39;t get it out afterwards correctly.[/size][/font]\r<br />[font=Arial, sans-serif][size=2]Save your files separately after every step – some software is not able to go back to a previous version if you have distorted your file&#33;[/size][/font]\r<br />[font=Arial, sans-serif][size=2]- Filenames: Ck filenames are a cruelty. I always name my files after the first words of the dialogue so I can easily find them. For the ck they will be copied and pasted and then renamed for game. Always save a copy of your original files, you will need them again if you have a hundred or thousand lines and must debug them.[/size][/font]\r<br />\r<br />[font=Arial, sans-serif][size=2][color=#ff7700]Step four:[/color] Normalize your files. Yes, I know there are people outside that are telling you shouldn&#39;t do that, but I will explain why it&#39;s\r<br />necessary and you will hear the difference in game.[/size][/font]\r<br />[font=Arial, sans-serif][size=2]For singing and music it is important to have a dynamic in the sound to get a deep into it, but for voice it is better to have one level of loudness. So musicians are not amused about the compressors in the radio stations because music is always the same loudness with no peaks and will become flat through radio. But for the moderators this is very important for their voice because people understand their words much better if the peaklevel is the same. So this is similar in game. It doesn&#39;t mean that you have no quieter or louder voice in the dialogue but the normalization adapt it as much as possible.[/size][/font]\r<br />\r<br />[list]\r<br />[*][font=Arial, sans-serif][size=2]Normalize your file only 95 percent or lower. If you do higher values clipping[/size][/font][font=Arial, sans-serif][size=2] will occur and you can delete the file :([/size][/font]\r<br />   [*][font=Arial, sans-serif][size=2]If you use a mixer to increase frequences you need to normalize your f[/size][/font][font=Arial, sans-serif][size=2]ile again because raising frequences mean to raise the loudness of[/size][/font]\r<br />[font=Arial, sans-serif][size=2]   this frequence and clipping will occur. Lower the percentage in the normalization options until the peak is below clipping. [/size][/font]      [*][font=Arial, sans-serif][size=2]Always try different values and hear exactly how it sounds. Your ears will l[/size][/font][font=Arial, sans-serif][size=2]earn. But do take a break, your ears will become tired and you will n[/size][/font][font=Arial, sans-serif][size=2]ot hear what you should after a while.[/size][/font]\r<br />[/list][font=Arial, sans-serif][size=2]Now is the time to put the files into ck and hear them in game. Simply record all lines as empty files with the ck – only needed if you have no ck filenames yet. Don&#39;t care about lipfiles at the moment.[/size][/font]\r<br />\r<br />[font=Arial, sans-serif][size=2]Rename a copy of your extern recorded files to the ck names and copy them in your voice folder in Skyrim and overwrite the files you&#39;ve recorded with ck.[/size][/font]\r<br />[font=Arial, sans-serif][size=2]Go into the ck and load your esp, in the menu select gameplay and select recreate facial animations. This will make all the lipfiles that are missing. It takes some time.[/size][/font]\r<br />[font=Arial, sans-serif][size=2]Save your work, make a new seq file with TESVEdit and then go in game and test it. Skyrim has it&#39;s own filters that overlay your sound, so you\r<br />have much of reverb in taverns or dungeons but this is game specific.[/size][/font]\r<br />[font=Arial, sans-serif][size=2]If all works fine, we will do the last step before distribution of the mod. If not, go back and rework your files or record again. [/size][/font]\r<br />\r<br />[font=Arial, sans-serif][color=#ff7700][size=2]Step five: Fuze the files.[/size][/color][/font]\r<br />[font=Arial, sans-serif][size=2]Use the software Unfuzer and fuze the files but before you do this[/size][/font]\r<br />[list]\r<br />[*][font=Arial, sans-serif][size=2]make a copy of your Skyrim voice folder&#33; Because you can&#39;t unfuze the f[/size][/font][font=Arial, sans-serif][size=2]iles again. And renaming them all again is pain&#33;[/size][/font]\r<br />[/list][font=Arial, sans-serif][size=2]Unfuzer can do this pretty nicely, so what? [/size][/font]\r<br />\r<br />[font=Arial, sans-serif][size=2][color=#ff7700]Never unfuze and fuze the files again.[/color] \r<br />[/size][/font]\r<br />[font=Arial, sans-serif][size=2]If you fuze files, they will be compressed to make them smaller and save space what&#39;s important for heavy modded games as we all have. But that compression means loss of quality. If you have done your work in the right way, this doesn&#39;t matter in game, so to fuze the files once is fine. But if you unfuze the files for altering and fuze them again, they will be compressed again and you will experience a significant loss of quality. You will hear strange echos or distortion in game.\r<br />That&#39;s why some of the original soundfiles of Skyrim are of very bad quality. They were reworked after fuzing. Very bad idea.[/size][/font]\r<br />\r<br />\r<br />[font=Arial, sans-serif][size=2]So I hope you get something out of this little tutorial and if you like, endorse it. \r<br />\r<br />\r<br />Take a look at my mod and enjoy good quality voices:\r<br />\r<br />[url=http://www.nexusmods.com/skyrim/mods/85381/?]Tasheni Followers\r<br />[/url]\r<br />\r<br />Greetings from Tasheni.[/size][/font]",
  "categoryId": "61",
  "version": "1",
  "author": "Tasheni",
  "createdUnix": "1504815178",
  "updatedUnix": "1504814079",
  "containsAdultContent": false,
  "uploadedBy": "Tasheni",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000254106",
      "name": "Making Custom Dialogue With High Quality Sound Tutorial PDF",
      "version": "",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "21",
      "fileName": "Making Custom Dialogue With High Quality Sound Tutorial PDF-86538-.rar",
      "uploadedUnix": "1504814079",
      "modVersion": null,
      "virusScanUrl": "https://www.virustotal.com/file/71f482ccb8f8a0604cae9bdf193c52bb538828161590993ac6f79e50daf5f011/analysis/1504814282/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Making%20Custom%20Dialogue%20With%20High%20Quality%20Sound%20Tutorial%20PDF-86538-.rar?fid=1000254106&ttl=1535875457&ri=8192&rs=8192&setec=c89e230e44a8b5d4ee4847c6d56645ed"
    }
  ]
}