{
  "modId": 86548.0,
  "modName": "Ahriman&#39;s Grimoire",
  "summary": "Animate armor sets; tame animals; hack, capture or assembly automatons; farm elemental salts; summon skeleton army; became Wraith; and much, much more.",
  "descriptionHtml": "Lore:\r<br />Not so long ago in a place not so far away... There lived a mage called Ahriman. Being powerful necromancer and master of all schools of magic (and also Alchemy and Enchanting) he was quite dissapointed of magic assortment, and so, he decided to expand it by creating his own spells and magic items. He created a lot of powerful artifacts and spells, and wrote all his knowledge into his grimoire. He send it somewhere in pocket dimension in Oblivion, and selaed it with sigils of five schools of magic, so only worthwhile will be able to discover all it&#39;s secrets. So, now grimoire is nowhere to be found, and only link to it is Daedric artifact Oghma Infinium...\r<br />\r<br />Description:\r<br />This mod alters some of game items/spells/parameters, and adds alot of new ones. Check readme page, it&#39;s called so for exact reasons.\r<br />\r<br />Disclaimer:\r<br />I developed this mod slowly over almost three years, mostly for my own roleplay, in many different directions, but, finally, this mod contains enough of... stuff, to be published.\r<br />\r<br />Requirements:\r<br />Legendary Edition\r<br />SKSE\r<br />\r<br />Warnings:\r<br />This mod contains many unsafe scripts that can break your game if used without care: they can alter factions of your enemies, teleport you from somewhere you can&#39;t get to again or to somewhere from where you can&#39;t get out, there are some heavy scripts, and some things that can even crash your game instantly.\r<br />Also, this mod is incompatible with mods that alters player&#39;s dying behavior or player&#39;s Variable01, Variable02, Variable03 and Variable04(not sure if they used by vanilla game).\r<br />Use with caution.\r<br />\r<br />Permissions:\r<br />You are free to translate, redistribute, modificate and do any other stuff with this mod or any part of it.\r<br />Just mention me as autor, but it&#39;s on you anyway.",
  "categoryId": "93",
  "version": "1.0.0.0",
  "author": "AhrimanTheWhite",
  "createdUnix": "1504878682",
  "updatedUnix": "1504878663",
  "containsAdultContent": false,
  "uploadedBy": "AhrimanTheWhite",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000254153",
      "name": "Arriman&#39;s Grimoire",
      "version": "1.0.0.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1214",
      "fileName": "Arriman's Grimoire-86548-1-0-0-0.rar",
      "uploadedUnix": "1504878663",
      "modVersion": "1.0.0.0",
      "virusScanUrl": "https://www.virustotal.com/file/03b51c2ef12c7319d9131402ae3a92f001cb56479ec7a3629d4d996a0cc1b4be/analysis/1504879026/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Arriman%27s%20Grimoire-86548-1-0-0-0.rar?fid=1000254153&ttl=1535875467&ri=8192&rs=8192&setec=48a0ecdd23b3bab32230db0d263fd4dd"
    }
  ]
}