{
  "modId": 8656.0,
  "modName": "A Better Familiar",
  "summary": "Better familiars that level up with you! New familiars that increase your power while summoned! Familiars aren\\'t just for Mages anymore!",
  "descriptionHtml": "------------------*NOTICE 2-11-12*--------------------------------------------\r\n\r\nAlright. A bunch of people have been asking;\r\n\r\nWhen is this mod going to be done?,\r\nWhy don\\'t you have 60 second Familiar summons?\r\nWhat are you planing on doing with this mod?\r\n\r\nSo im answering these three very important questions now, here on the front page, for all to see:\r\n\r\n1. Going to be done? Honestly? no idea. I have so many ideas for this thing I don\\'t know were to begin let alone end.\r\n\r\n2. 60 second familiars. Maybe its the D&D or all the many, many, fantasy novels I\\'ve read but, to me, familiars were never meant to be summoned for 60-seconds, deal some damage, then die. A familiar is a creature you\\'ve bound from the Atral/void/dimensional/whatever zone to serve as a companion and guardian on your journeys. Not a cast and forget damage spell. There not spells. There Familiars.\r\n\r\n3.What am I going to do with this mod? This one is a bit hard. I guess I will just start with the features coming in the next update(which probably wont be for a few days as you\\'ll see) and go from there.\r\n\r\nOnly a few familiars will be available at shops. A beginners set if you will. Small bonuses, no major abilities, standard effects, that sort of stuff.\r\n\r\nThe rest of the familiars, the unique and powerful ones, will be drops from the various creatures around skyrim giving you the option of hunting down powerful, useful, unique, familiars and providing an actual reason to kill that bear or take down those wolves, apart from the-\\\"well it attacked me first\\\". and really just keeping things interesting.\r\n\r\nSome quests will also give you a unique familiar on completion of (or to be used to help you complete) a quest. For instance: You joined the Dark Brotherhood and, as a token of appreciation for a quest well done, Astrid rewards you with a unique Shadow Spider familiar to aid you on your dark path.\r\n\r\nAlready did some of the Dark Brotherhood quests? Well maybe if you kill there pet spider you can claim its soul as unique familiar.\r\n\r\nJust an example.\r\n\r\nEventually I would like to make a whole new College focusing on the different paths of the familiar with unique story lines and quest chains for each \\\"class\\\"(and yes, new perk trees) but that\\'s out of my skill level and time allowance for now. I might even have to release that as another mod altogether. will see.\r\n\r\n\r\nSo there you have it. mostly. This will eventually be a very large mod that will add a whole new path to choose. Consider this mod in public Beta testing for the time being. Expect a big update in a few days with a lot more variety.\r\n\r\nThan you all (and especially those of you who actually read all that text up there) for you continued support and comments.\r\n\r\n------------------------------------------------------------------------------------------------------\r\n\r\n \r\n\r\n \r\n\r\nFamiliars are not just for Mage\\'s anymore!\r\n\r\n- Big two-handed, heavy armor wearing brute? Summon the mighty Bear!\r\n\r\n- Stealthy Rogue? Summon the sneaky Skeever!\r\n\r\n- One-handed and Magic?? No problem! Summon the Wolf of the Flame!\r\n\r\n- or *gasp* an actual Mage?! Summon a Magical Anomaly and show them a true mages Familiar!\r\n\r\nA Familiar for every occasion(well...almost), available now at your local Riverwood Trader Co.!\r\n\r\n\r\nAll new Familiar spells are available at the Riverwood Trader and from Phinis Gestor at the college. for now. Big plans are in the works for this mod so stay tuned!\r\n\r\nFeatures:\r\n-Stronger familiars that level up with you!\r\n-New familiars to choose from (more coming soon!)\r\n-Duration options in 24hr, 6min, and 60sec (for Wolf and Wolf of the Flame only)\r\n-Gain bonuses depending on the Familiar you use!\r\n-and yes they can follow you everywhere! even through doors!\r\n\r\nto many exclamation points?! NEVER!!! ok maybe...its been a long day....\r\n\r\n \r\n\r\nUpcoming/In-development:\r\n-more familiars\r\n-familiars that can use spells (passive spells do work and the Wolf of the Flame has a fire resistance bonus)\r\n-new sound effects\r\n-temporary perk boosts\r\n-and whatever else you guys can think of let me know!\r\n\r\n----------------------------------------------------------------------------\r\n\r\nUPDATE 2-8-12\r\n----------------------------------------------------------------------------\r\na quick fix that will hopefully balance things a little better.\r\n-reduced damage output and level scaling issues\r\n\r\nUPDATE 2-8-12\r\n----------------------------------------------------------------------------\r\nrenamed Conjure Familiar to Conjure Familiar - Wolf\r\nadd duration variations to Riverwood shop and Phinis Gestor\r\nadded new Wolf of the Flame familiar. a stronger flaming version of the standard familiar.\r\nadded Conjure Familiar - Skeever\r\ntweaked some stats on all familiars\r\n\r\n\r\nUPDATE 2-9-12\r\n-----------------------------------------------------------------------------\r\n\r\n-more rebalancing \r\n-added player bonuses for using specific familiars\r\n-added Familiar - Anomaly\r\n-added Familiar - Bear\r\n-added all spells to both Phinis Gestor in the college and the Riverwood Trader\r\n-laid the ground work for temporary perks while familiar is summoned\r\n-Familiars can now follow you through doors!\r\n\r\n\r\nUPDATE 2-10-12\r\n------------------------------------------------------------------------------\r\n\r\n-added Conjure familiar - Spider\r\n\r\n \r\n\r\n\r\nUPDATE 2-11-12\r\n------------------------------------------------------------------------------\r\n\r\n-added a bunch of text to the top of this description.\r\n\r\n-----------------------------------------------------------------------------\r\nand yes I am the author of this mod. My name is different on steam.\r\n\r\nAnd as always I love feedback good or bad and its how this mod will improve so shout out in the comments!",
  "categoryId": "75",
  "version": "0.7",
  "author": "TheFamiliarFamiliar",
  "createdUnix": "1328856322",
  "updatedUnix": "1328927599",
  "containsAdultContent": false,
  "uploadedBy": "bdovpro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28280",
      "name": "A Better Familiar",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "A Better Familiar-8656-0-6.zip",
      "uploadedUnix": "1328861810",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/6b2ffda99579b8cd08d2aeea195588b8930a657b9146e366b3c37bf2566b4161/analysis/1406666465/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Better%20Familiar-8656-0-6.zip?fid=28280&ttl=1535767590&ri=8192&rs=8192&setec=4827867bd3bde07a774dfb00fc7d4a7f"
    },
    {
      "fileId": "28714",
      "name": "A Better Familiar Rev 0-7",
      "version": "0.7",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "9",
      "fileName": "A Better Familiar Rev 0-7-8656-0-7.zip",
      "uploadedUnix": "1328927599",
      "modVersion": "0.7",
      "virusScanUrl": "https://www.virustotal.com/file/3dffec08e6cacf6cca361a977bed7022ba10b1aa9db805fb04f4dc9ddf4e9bb2/analysis/1406668704/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/A%20Better%20Familiar%20Rev%200-7-8656-0-7.zip?fid=28714&ttl=1535767591&ri=8192&rs=8192&setec=6868a9f166031c4c270edbe7dd550965"
    }
  ]
}