{
  "modId": 86694.0,
  "modName": "Requiem Extended Heavy armor",
  "summary": "Complete overhaul of the Heavy armor tree in skyrim requiem. integrates a new progressive perk style and a completely revamped battlemage style. perks are for the player only at the moment, no original requiem perk are edited thus npc&#39;s will have no changes. heavy armor has all new perks and the magic mastery perks have new player only effects.",
  "descriptionHtml": "When I first played with requiem I felt like I was on an alien planet. The people were the same but somehow it all was different. I had to explore and die, and die again in order to familiarize myself with this new  world. Just when I thought that I knew it all requiem would surprise me. This happened less and less over time until eventually I actually almost know everything. After diving into the ck and finishing the perk analysis (a list of every perks effects that is posted on the r/skyrimrequiem subreddit), I could say that I know every perk and all it’s effects. I fully lost that sense of wonder, of unknown and that’s where this project comes along. I want to turn the perks into unknown territory. To open doors that weren’t open before. I want you to play how you want not a predetermined class. For veterans of requiem who have surmounted the toughest odds, there&#39;s more to come. Assassin poison your blades, mages collect your scrolls and warriors throw on that steel plate, for this is requiem second wind.\r<br />\r<br />The goal of this project is to completely revitalize requiems perk system. Through new branches/perks, new mechanics and updated perks hoepfully i hope to create a perk system that encompasses more playstyles and really sheds uniqueness in each one.\r<br />\r<br />Heavy Armor-\r<br />\r<br />\r<br />",
  "categoryId": "79",
  "version": "V1",
  "author": "MrCooney",
  "createdUnix": "1505411581",
  "updatedUnix": "1505411581",
  "containsAdultContent": false,
  "uploadedBy": "MrCooney",
  "primaryFile": null,
  "files": []
}