{
  "modId": 86751.0,
  "modName": "Epic Hacks SSE",
  "summary": "Epic Hacks by Crysthala ported to SSE by Luis Guerreiro\r<br />No more grinding or console commands to change your character.\r<br />\r<br />Instead use a powerful tool to change whatever you need.\r<br />Stats, Spells, Shouts,\r<br />Components and Tools for Crafting (at no cost)",
  "descriptionHtml": "[size=4]Epic Hacks[/size]Skyrim is a wonderful game but you may spend to many hours just grinding, crafting or learning skills. With this mod you have the power to decide what you want to do in a portable way.Some may call it cheats but if you are like me, your time is precious and you want to use for playing, have a bit of fun or just testing out mods, without wasting your time with mining, picking ingredients and so on (I have health issues and can not stay very long periods siting in front of a computer so this tool is perfect).With permission by Crysthala I converted Epic Hacks to SSE.Instalation:You have 2 options:- 1 You will get the spells (books) and tools as you start the game- 2 (For advanced users) Now that SKS64 is out for testing, if you know what you doing and have SkyUI installed and working with SKS64, you can use the same functionalities as in Oldrim.____________________________________________________________________________________________________[size=4]About support[/size]Sorry but I have no time due to my health conditions, so support will be off.____________________________________________________________________________________________________Don´t forget to thank Crysthala as the creator of this mod.____________________________________________________________________________________________________DESCRIPTION AS IN OLDRIM by Crysthala(some parts edited to avoid confusion)Epic HacksRequirementsSkyrim SSE, SKS64, SkyUI[size=4]Okay, I&#39;m short on time. What exactly does this do?[/size]Nothing until you tell it to, and lots of things if you want. You can instantly max your stats, set your stats to crazy levels, unlock EVERY perk on the skill trees even if they&#39;ve been changed or added by mods, remotely access five different storage spaces from anywhere, give yourself individual perk points for the skills / Vampire Lord / werewolf trees, spawn crafting components, tools, and alchemy ingredients, and, because I was tired of having to manually disenchant huge stacks of items, you can literally click twice and learn all the vanilla enchants without even having to look at an enchanting table. Though there is actually crafting-anywhere through the Toolbox, as well, so you can totally use an enchanting table if you want to. And none of this will break quests or take more effort than casting a power and clicking a few times.[size=4]Interested? Read on&#33;[/size][size=4]Playing with Epic Hacks[/size]Important NoteEpic Hacks will do absolutely nothing to your game until you tell it to. Once you make a change to your stats and save, however, it cannot be reverted to the way it was before, even if you uninstall the mod. Save on your own recognizance&#33;First, you’ll need to add the powers. This is done via the SkyUI Mod Configuration Menu. There are two types of powers in EH: the cheat menus, and the Superchests.[size=4]Cheat Menus[/size]StatsThe big ‘un. This is the most powerful part of the mod. This is where you want to go if you fancy the thought of, say, maxing your stats instantly, learning all four effects of every vanilla ingredient, and/or giving yourself vampire lord/werewolf tree perk points, among other crazy awesome things. There’s a list of all the hacks a bit further down, and you can also spawn the [EH] Guidebook for an in-game explanation of what the options do.Alchemy IngredientsSpawn any non-quest alchemy ingredient from Skyrim, Dawnguard, Hearthfire, and Dragonborn in batches of 25.Crafting ComponentsSpawn crafting components, including vanilla items commonly used for crafting by mods (like linen wraps). The number of items spawned varies based on type.FoodMmmmmm, food. Single-serving portions of the foods from vanilla and DLC.ToolsPotions, arrows and bolts, pickaxes, gold, soul gems… Oh, and the Toolbox, an item you can carry around that allows you to use any vanilla crafting type anywhere you damn well please. More on that below.SuperchestsThese are fun. There are five powers, which you can assign to either hand or your Shouts key, and each one opens a separate chest when cast, allowing you to keep your stuff handy wherever you may find yourself.Stats HacksYou can find these in the Stats cheat menu.Crazy StatsJust goes nuts. Crafting skills will be set--not leveled, just set--to 500, and all others will be set to 200. Health, magicka, stamina, and carry weight will be set to 1000. You will no longer have a shout cooldown. This happens instantaneously. Note that your current level will remain the same and you will no longer be able to level up, so I suggest using the &#34;player.setlevel #&#34; console command or picking up the excellent Timing is Everything mod by the inimitable kryptopyr if you&#39;re planning on doing any level-dependent quests. You&#39;re probably also going to want to use the Perks hack below. (In for a penny, in for a Septim.)Max StatsWill pour insane amounts of XP into every skill, pushing them all to 100 just as if you had leveled them up the old-fashioned way. With vanilla XP and leveling settings, you’ll end up level 81. These behave exactly as level-ups usually do, with the perk points, max carry weight increase, and the choice to put points into health/magicka/stamina. All that leveling up takes a bit of time, but the result is natural. It&#39;s what can be achieved though normal gameplay. If you wish, you can do the whole Legendary thing on all your skills, then use the MCM to reset this hack and get ANOTHER full set of level-ups. Because, you know, why not.PerksAdds every perk attached to every skill. Totally independent of level; the perks will be added whether your skill is high enough or not. (Doesn&#39;t include Vampire Lord or Werewolf perks, but you can give yourself points below.)EnchantsUses a very cool SKSE function to teach you a host of enchanting effects. It does this without you having to disenchant a mountain of items manually. I know. I love SKSE, too.Ingredient EffectsOne click teaches you all four effects of all the ingredients. No more poisoning yourself just to find out what things do&#33; Hooray&#33;Teach SpellsAdds a bunch of spells to your magic menu. Be aware that the fact they&#39;re in there does not mean your character will instantly be able to cast them; you&#39;ll still need the skill and magicka to back them up. Note that this does add the super-powerful Master spells normally attainable only from the Mages Guild questline; it does not, however, affect how these quests function.ShoutsInstantly learn and unlock all the words of every vanilla shout. Won&#39;t break the main quests--the scripted &#34;learn a new word&#34; events will function as normal.Shout CooldownSet your shout cooldown to full duration, half duration, or disable it entirely and yell all you like.Vampire Perk PointA perk point for your Vampire Lord perk tree.Werewolf Perk PointA perk point for your Werewolf perk tree.Health +1000 / Magicka +1000 / Stamina +1000 / Carry Weight +1000Adds 1000 to base value of the corresponding stat.Dragon Souls +100Adds a hundred dragon souls to your pool.Single Dragon SoulAdds a single dragon soul to your pool.Single Perk PointAs its name suggests, simply adds a single perk point you can allocate to your skill trees.Epic Hacks GuideSpawns a book you can read ingame with descriptions of these hacks.The ToolboxYou can grab the Toolbox from the Tools cheat menu. To use the Toolbox, just activate it from within yourinventory and choose a crafting type. The menus will exit and you will begin crafting without any furnitureobjects being spawned around you. The “Smithing” option gives you access to regular smithing, as well asSkyforge and Dawnguard smithing. The “Cook/Bake” option has both cooking pot and Hearthfire ovenrecipes.CompatibilityEH does not make any changes to anything in vanilla, so it doesn’t conflict with anything. Of course, it is always possible that changing certain things could cause the hacks to behave in unexpected ways. Your mileage may vary.The Perks hack now automatically detects and enables perks on every skill tree regardless of whether they have been changed or added by mods, and the Ingredients hack will teach the effects of the vanilla ingredients even if mods have changed what these effects are. Most changes to vanilla forms are completely harmless, and everything will work as it should.New items, spells, enchantments, and ingredients that have been added by a mod can’t be made available as EH cheats without a patch. They won’t be broken or anything, you just can’t get to them from the EH menus. Total game overhauls like Requiem, SkyRe, PerMa, and similar are theoretically compatible, but I’ve never tested them. If you use one of these and can enlighten us on this subject, please leave a comment.Known bugs and quirksThe only real &#34;bug&#34; with my mod I’ve found: the enchantments, very occasionally, might get “forgotten” after saving and reloading. I have no idea why this happens, unfortunately. It’s using a brand-new SKSE function, so I can’t find any documentation on what might be causing it. You can use the “Re-enable Hacks” button in the MCM and use the Enchantments hack again to get them all back.After using the Perks hack, you need to check your skill tree for it to apply. It may appear at first glance that some of the perks, and even entire skills, have been neglected. They haven’t; all the perks have been added as they should have been, but the game sometimes takes a bit to update the appearance of the trees. Leaving the skills menu, waiting a couple of seconds, and reopening it should do the trick.If you have an old monitor without a widescreen aspect ratio, you might not be able to see all the Toolbox options. There is unfortunately nothing I can do about this, as Skyrim doesn’t allow you to resize messagebox menus.Some of the art objects look funny in the menus because they aren’t rotated properly. I have attempted (repeatedly) to fix this in NifSkope, but Skyrim does not appear to render these with logic comprehensible to humans. I’ll work on it.And, finally, there’s a bug that can make it look like all the armor in the game has a rating of 0. It doesn’t. The armor rating is exactly what it should be, and will behave as it ought to, but the game isn’t displaying it correctly. This is a bug with Skyrim’s engine, so there’s nothing I can do about it.FAQQ: I don’t see anything… where are the spells?A: You have to enable them through the MCM menu provided by SkyUI.Q: Will this mod break quests?A: Nope. No vanilla quests, anyway. Mods may or may not experience issues if they’re poorly coded.Q: I hacked my stats and then saved my game, and now I want to put my stats back the way they were.A: Epic Hacks doesn’t support this, sorry, hence the repeated warnings.Q: Will you make a version that doesn’t require SKSE?A: Nah. SKSE is sweet. It’s what allows you to, for instance, learn all those enchantments without having to manually destroy a stack of items, among other things. Love me some SKSE.Q: Will you make a version that doesn’t require SkyUI? I don’t like the changes SkyUI makes to the menus.A: Nope. It stays. The good news is that you can get a thing called SkyUI Away to let you use the Mod Configuration Menu from SkyUI (which is the only part of that mod EH requires) without changing any of the vanilla menus. It’s available on the Nexus.Q: Can you make a version that doesn’t require [insert DLC here]?A: It would be WAY too much of a pain to keep all the different versions updated, and I’m definitely not going to make it modular again. That was just a mess.Q: Can you release a patch adding stuff for mod X?A: Probably not. I make patches for my own personal use, but I don’t release them for download by the public because I don’t have permission from the authors of the other mods to do so. You are free to make your own patches, as well, but DO NOT release them without permission. It’s unutterably rude. You can also, VERY VERY POLITELY, ask mod authors to release a patch for it themselves, but I wouldn’t hold your breath for their support. Modders put a lot of work into making things balanced.Q: Can I release an addon for EH adding new items or functions that have absolutely nothing whatsoever to do with any other mod?A: Yep&#33; You don’t need to get permission, but if you PM me about it, I might put a link to your addon from the EH page.Installation/RemovalFresh installationNo special steps are required if you’ve never used Epic Hacks before. Make sure you meet the requirements, and then you can install it just like any other mod.Upgrading EH for use on a completely new gameIf you’re starting a completely new character, you don’t need the procedure below. Just uninstall the old version of the mod as you would any other. When removing the old files, make sure you remove the modular addons for DLC and food. These files are now included in the new version, and leaving them active will break the mod. When installing the new version, say yes to everything if it asks you to overwrite.Upgrading EH for use with an existing saveThis is what’s called a “clean save” procedure. Even if you haven’t actually used any EH features on a particular save, you need to do this. Not following these steps can cause things to work incorrectly. If you’d like to know why this is, there’s an explanation at the end.1. If you have any items in your Superchest: Load your save exactly as it is, and remove any items you had in your Superchest. They will disappear upon upgrading if you don’t, and you will not be able to recover them. If you are positive you haven’t used the Superchest, you can skip this step.2. Uninstall the old version of Epic Hacks, just as you would remove any other mod.3. Double check that all of the old addon .esps have been removed: EpicHacksDG.esp, EpicHacksDB.esp, EpicHacksHF.esp, and Epic Hacks – Food.esp. Leaving one of these active WILL break the mod.4. Now it’s time to make a clean save. Start Skyrim and load your character. The game will complain that things are missing and some stuff might be lost. Go ahead and load up your game. (All of your hacked stats, perks, items, etc. will remain, don’t worry.) Once it’s all loaded up, save to a new slot—don’t just use quicksave or save over an existing game, you HAVE to save to a new file.5. Install the new version of the mod. If asked whether you want to overwrite anything, say yes to all of it. Make sure EpicHacks.esp is activated, load your clean save, and enjoy the new era of cheating. Uh. I mean advanced ingame debugging implementation interfaces.If you’ve already upgraded without following these instructions and saved over your game, you’ve lost everything in your Superchest, but you can still rescue your save. Completely uninstall both the new and old files and start at step 3. Make sure you follow the instructions carefully.This “clean save” thing is a pain in the hole. Why do I have to do this?Yeah, sorry about that. Skyim has issues with change, so it makes copies of scripts that run during a game and keeps them in the save file. It then uses that copy in all future loads, regardless of what’s happened to the original scripts. Skyrim also has issues with hoarding, so that copy stays in the file even if you save over the file without the script’s attendant mod loaded. The script will be ignored and won’t run, but it’s still lurking in your savegame like a sneaky lurky thing, and that’s still the copy that will be used once again when you activate the new version of the mod. When you make a clean save to a fresh file, though, the mod’s not loaded, so Skyrim ignores the script and doesn’t copy it to the new file. It will then retrieve the updated version of that script when the new file is loaded, because there isn’t a saved copy for it to cling to instead. Oh, Skyrim. Sometimes I think you need therapy.UninstallationLoad up your game and use the “Dump Superchest inventories” and “Reset Spells” options in the MCM. Save, exit, and you can remove EH like any other mod. I mean, I don&#39;t know why you&#39;d want to do that, but you can if you want.Recommended Mods (Oldrim - most not not yet working in SSE)These are mods I use that work very well with EH.SkyTweak by GrimyBunyip is great. Use an MCM menu to configure game settings for individual characters. Has difficulty and realism options in addition to things that can be abused for cheaty purposes, too.http://www.nexusmods.com/skyrim/mods/33395/?Grimy Utilities, also by GrimyBunyip. A host of useful options, from hotkey-casting any spell you damn well please to manipulating items and NPCs.http://www.nexusmods.com/skyrim/mods/36328/?Timing is Everything by Kryptopyr is another good one, and it’s great for any game, regardless of whether you’re cheating. It lets you configure the level requirements and so on for a whole host of quests and scripted encounters.http://www.nexusmods.com/skyrim/mods/38151/?Jaxonz Renamer. Jaxonz tools in general are really, really awesome, but you can use this one to rename the Superchest spells until I find a way of integrating that function into my mod. I recommend checking out all of Jaxonz mods, because they’re absurdly handy.http://www.nexusmods.com/skyrim/mods/57335/?Trash Bucket, one of my other mods. Yeah, I know, gratuitous self-promotion. It’s what it sounds like—activate the bucket in your inventory, put stuff in the bucket, stuff goes away. Excellent for keeping your inventory tidy (and reducing save bloat, incidentally).http://www.nexusmods.com/skyrim/mods/41776/?The Bag of Holding mods by JustinOther and Vidani. Love me a Bag of Holding. Love me two Bags of Holding twice as much.http://www.nexusmods.com/skyrim/mods/8066/?http://www.nexusmods.com/skyrim/mods/9085/?FeedbackIf you object to the existence of cheats for single-player games despite the fact that their availability has literally no effect on your game, kindly keep it to yourself. If you discover a bug, need a question answered, or have a cool suggestion to make, though, feel free to leave a comment here at the Nexus.Future PlansMy current plans for features to introduce in future versions. Please note that these are things I’m looking into doing, but they might not actually happen if practical concerns get in the way.General ideas:A catalog cell. Like QASmoke, but pretty, and without all the potentially game-breaking stuff.Be cool to have a “custom menu” that can be configured per-character and shows only selected types of items from other menus. Really not sure how feasible that would be, though, so don’t hold your breath on this one.Configure how many items are spawned by category. (potions, ingredients, ingots, pelts, etc.)Maybe have the option to use a single cheat spell, then select a cheat menu from a pop-up list of options instead of having all these powers.Tidiness: MCM options to add/remove entries in the cheat menus to further cut down on time spent scrolling instead of kicking ass.Stats cheat menu ideas:Perk respec options to remove perks from a skill or all skills and refund you the points, allowing you to redistribute them without affecting your skill levels. This isn’t something I’m personally all that interested in, but it occurred to me that it might be possible. If you guys love this idea, though, I’m willing to look into it.Quickstarts: click once for a set of multiple hacks. Because we’re not impatient enough already.Skillset cheats. Something like being able to click a thing that says “Alchemist” and all perks on the Alchemy tree are unlocked, your skill is set to a ridiculous level, and you learn all the vanilla ingredient effects. Or selecting “Destructive” and having the same happen with the Destructive skill and tree, and you learn a bunch of Destruction spells. Would be fun for roleplayers.Superchest stuff:Figure out if there’s a way to allow the player to rename the Superchest spells in a user-friendly way.Some kind of auto-sorting thing would be cool. It’s a little tiresome sorting and moving large numbers of items at the moment.CreditsThis mod is much prettier than it would be otherwise thanks to art resources made available to the community by the following modders:InsanitySorrow, Runspect, Blary, Oaristys, Tony67, and Stroti",
  "categoryId": "24",
  "version": "1.0",
  "author": "Crysthala and Luis Guerreiro",
  "createdUnix": "1505558354",
  "updatedUnix": "1505558354",
  "containsAdultContent": false,
  "uploadedBy": "skyrimlu",
  "primaryFile": null,
  "files": []
}