{
  "modId": 86820.0,
  "modName": "Here There Be Monsters - in Russian",
  "summary": "Они зовут его Морем Призраков. Бесконечность льдов и туманов, безжизненная и необитаемая. Но ледяные глубины скрывают такие ужасы, с какими не сталкивались даже Драконорождённые...",
  "descriptionHtml": "[font=Times New Roman][i]\r<br />[right][color=#b6d7a8][size=4][i]«Монстры — очень трагичные создания. Они рождены слишком высокими, слишком сильными, слишком тяжелыми. Они злые не по своему выбору. В этом их трагедия.»\r<br />[/i][/size][size=4][i]— Иширо Хонда.[/i]\r<br />[/size][/color][/right][/i][/font][center][font=Courier New][color=#b6d7a8]_________________________________________________________________________________________[/color][/font][/center]\r<br />\r<br />Они зовут его Морем Призраков. Бесконечность льдов и туманов, безжизненная и необитаемая. Но ледяные глубины скрывают такие ужасы, с какими не сталкивались даже Драконорождённые. Легенды рассказывают о тварях, обитающих в глубине. Созданиях, спавших подо льдами в течение веков. Монстры такой необъятности, что даже драконы их опасаются. И теперь, как и драконы, эти монстры пробуждаются...\r<br />\r<br />Этот мод добавляет небольшой сюжет, в течение которого вам придётся повстречаться с девятью массивными боссами, обитающими в Море Призраков. Все монстры, которых вам придётся сразить, имеют прототипы в мифологиях различных культур, но в рамках мода довольно грамотно и органично вписаны в игровой мир. \r<br />\r<br />[font=Trebuchet MS][color=#93c47d][size=4]Как начать квест:[/size]\r<br />[/color][/font]Наведайтесь в таверну любого из прибрежных городов - Данстара, Солитьюда или Виндхельма. После чего стоит сходить в доки - там будет персонаж, пострадавший от какой-то неведомой твари. \r<br />\r<br />[color=#93c47d][font=Trebuchet MS][size=4]Особенности:[/size][/font]\r<br />[/color]- Полностью озвученный на английском языке квест по избавлению Моря Призраков от гигантских монстров;\r<br />- Девять тварей с уникальными логовами;\r<br />- Три капитана кораблей и один профессиональный охотник на монстров, которые могут стать вашими спутниками;\r<br />- Новые уникальные заклинания призыва существ;\r<br />- Судно охотника на монстров, в котором вы сможете жить по большой дружбе;\r<br />- Глаз Одина - уникальная глазная повязка, позволяющая обнаруживать живых существ вокруг;\r<br />- Уникальные оружие и доспехи, которые вы сможете создать из того, что останется от убитых монстров;\r<br />\r<br />Монстры и их места обитания:[spoiler]- Каркинос (грязекраб). Обитает у грота Сломанное Весло. Прототип - существо из греческой мифологии - гигантский краб, посланный Герой отвлечь Геракла во время сражения с Гидрой. Геракл быстро избавился от краба, пнув его с такой силой, что тот улетел в небо.\r<br />- Левиафан (рыба-убийца). Обитает в глубине у Плаща Пилигрима. Прототип - самое большое морское создание в Ветхом Завете, тварь, которую мог приручить только бог. \r<br />- Ику-Турсо (хоркер). Обитает к северу от Камня Змея. Прототип - древний бог моря из финно-карельской мифологии. Описывается как гигантский морж, также иногда считается богом войны.\r<br />- Йормунганд (ледяное привидение). Обитает к северу от Слезы Сироты. Прототип - Змей Мидгарда из скандинавской мифологии, сын бога-обманщика Локи. Один взял Йормунганда и забросил в море, где тот вырос таким большим, что смог обогнуть землю и ухватиться за свой хвост. \r<br />- Корруид (корус). Обитает на северо-запад от поста Септимия Сегония. Прототип - кельтский морской монстр без особого описания. В мифе о Гаэ Болг упоминается битва двух монстров - Корруида и Коинченна.\r<br />- Кракен (двемерский паук). Обитает к востоку от пещеры Холодный Берег. Прототип - знаменитое существо, нападающее на корабли во всех частях света. Часто описывается как гигантский моллюск, но в более ранних описаниях он больше крабоподобен.\r<br />- Имир (ледяной атронах). Обитает далеко к северу от грота Солёная Вода. Прототип - в скандинавской мифологии отец всех Йотунов. Древнее существо, родившееся от яда ледяных рек Эливагар. Был убит Одином во время сотворения мира. \r<br />- Тиамат (грозовой атронах). Прототип - шумерская богиня хаоса, древняя богиня океана, мать младших богов и монстров. Описывается как воплощение первобытного хаоса.\r<br />- Форкис (луркер). Обитает к северу от Данстара. Прототип - исконно греческий бог моря и названный отец всех его монстров. [/spoiler]\r<br />Известные проблемы:[spoiler]- Гигантские монстры могут иногда заглючить из-за своего размера. Автор старательно подбирал их размер, но всё может быть.\r<br />- Во время схватки с Корруидом может происходить падение FPS. Возможно, это из-за самой анимации корусов. \r<br />- Йормунганд летает в воздухе на высоте около 60 футов, поэтому достать его может быть трудно. Автор сделал так, чтобы он мог спускаться к воде, где достать его может быть легче. \r<br />- Левиафан имеет тенденцию сидеть под водой и не всплывать за вами. В таком случае нужно выманить его на поверхность, например, выстрелом. Рекомендуемая стратегия - подплыть к нему под водой и крикнуть Безжалостную Силу. \r<br />- Есть предмет под названием Щит Хаоса, из-за которого могут случаться вылеты. Просто он использует эффект молний, как у грозового атронаха, а игре это почему-то не нравится.\r<br />- Если вы убьёте какого-то монстра, не брав на это задания, то по идее квест просто должен продвинуться на соответствующую стадию. Но что-то может пойти не так, как это иногда бывает с квестами, поэтому придётся пользоваться консольной командой &#34;setstage [id квеста] [XXX]&#34;, где ID квестов HTBM01 - &#34;Здесь могут водиться монстры&#34;, и HTBM02 - &#34;Охотник на монстров&#34;, а XXX - стадии квеста с шагом в 5 или 10. Просто прибавляйте к стадии по 5, пока не получите удовлетворительный результат.[/spoiler]\r<br />\r<br />Художественный перевод стихотворения &#34;Охотник&#34;, которое может быть найдено на судне Охотника на монстров, сделал [url=http://tesall.ru/user/141486-richard-zeidler/]Richard Zeidler[/url], за что ему большая благодарность.\r<br />\r<br />\r<br />[center][color=#fff2cc][size=4][b]Данная публикация содержит только переведённый ESP-файл и несколько скриптов с уведомлениями, поэтому необходимо [/b][b]предварительно [/b][b]скачать и установить [url=https://www.nexusmods.com/skyrim/mods/32411/?]оригинал[/url].[/b][/size][/color][/center]\r<br />\r<br />[font=Trebuchet MS][size=4]Требования: \r<br />[/size][/font]Skyrim с последним обновлением.\r<br />\r<br />[size=4]Установка:\r<br />[/size]1. Скачать и установить оригинал, поместив файлы из архива в папку Data игры или воспользовавшись мод-менеджером.\r<br />2. Скачать перевод, отправить файлы из папки Data архива туда же, где установлен оригинал, подтвердить замену файлов.\r<br /> ",
  "categoryId": "35",
  "version": "8.0",
  "author": "Vitalyudin",
  "createdUnix": "1505837860",
  "updatedUnix": "1524003390",
  "containsAdultContent": false,
  "uploadedBy": "Vitalyudin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000255191",
      "name": "Here There Be Monsters V7.5",
      "version": "7.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "509",
      "fileName": "Here There Be Monsters V7.5 RUS-86820-7-5.7z",
      "uploadedUnix": "1505837424",
      "modVersion": "7.5",
      "virusScanUrl": "https://www.virustotal.com/file/fea6ffd374273dc484f7364bdc59341875570c0e2d395d649efd88ee4e41dfe6/analysis/1505837652/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Here%20There%20Be%20Monsters%20V7.5%20RUS-86820-7-5.7z?fid=1000255191&ttl=1535875745&ri=8192&rs=8192&setec=1f65e14ff95a1a3baf783bab8d0ea6e8"
    },
    {
      "fileId": "1000270945",
      "name": "Here There Be Monsters v8.0",
      "version": "8.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "512",
      "fileName": "Here There Be Monsters v8.0-86820-8-0.7z",
      "uploadedUnix": "1524003390",
      "modVersion": "8.0",
      "virusScanUrl": "https://www.virustotal.com/file/cbb0ae89c895bab06e5198784f68ee62e5405983171c08889e8d36b7a7368142/analysis/1524003435/",
      "changelogHtml": " переделан Йормунганд - теперь он использует скелет и анимации дракона, а не летает где-то в 60 футах над вами; <br/> \n переделан Кракен - теперь он движется как гигантский паук, т.е. медленнее того быстро перебирающего лапами двемерского создания, каким он был ранее; <br/> \n фикс нескольких мелких ошибок; <br/> \n правка некоторых текстур; <br/> \n исправление нескольких опечаток в переводе. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Here%20There%20Be%20Monsters%20v8.0-86820-8-0.7z?fid=1000270945&ttl=1535875745&ri=8192&rs=8192&setec=2cb20b4fd0a6018e7bb66bf96768818a"
    }
  ]
}