{
  "modId": 86834.0,
  "modName": "Chathold - Town building base",
  "summary": "Ever been annoyed by not having a good place to build your own town? Here is your fix&#33;",
  "descriptionHtml": "I am a fan of building tundra defense like towns in skyrim. The only problem is that there is not any good places to put any of the buildings. It takes 10 minuets to set up a building, and it might not even be level, parts might be floating&#33; So, i created an area on lake illinalta right by the half-moon mill to act as a template. just place your building on one of the stairs provided and your good to go&#33; It has an orc longhouse player home as well as a prison(for you weird people out there) with a bridge joining it to land. I also added a Norse long ship slightly off the shore with row boats landed on the shore a small ways away. Expect more from this in the future, I am certainty not done yet. I may make more of these places in various spots in the future.\r<br />\r<br />\r<br />[b]CURRENT WORK\r<br />As of right now, the terrain is not perfectly flat, and some buildings in town mods do not have a foundation that extends far, so lots of gaps. I am smoothing that out and adding a couple of platforms for buildings with no foundation (Whiterun buildings).[/b]",
  "categoryId": "89",
  "version": "0.2",
  "author": "Chatom",
  "createdUnix": "1505888750",
  "updatedUnix": "1505928028",
  "containsAdultContent": false,
  "uploadedBy": "Chatom",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000255301",
      "name": "Chathold - town base",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "113",
      "fileName": "Chathold - town base-86834-0-2.rar",
      "uploadedUnix": "1505928028",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/6220fee2282313a60c7b8645d31f71c46e34a65fc47c1648a1732014e5eb7589/analysis/1505928189/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chathold%20-%20town%20base-86834-0-2.rar?fid=1000255301&ttl=1535875762&ri=8192&rs=8192&setec=d5429263b7879648b8032d74efa08caa"
    }
  ]
}