{
  "modId": 8687.0,
  "modName": "Manlizard the Wizards Balancing and Tweak Bonanza",
  "summary": "The goal of this mod is to change things that I felt were lacking, or just plain broken. \r\n(Like the dragon priest masks having incorrect enchantments or wrongly applied armour tags)\r\nAlso, a lot of unique weapons have had their damage values increased to encourage using weapons based on what you LIKE, and not just which stick hits harder.",
  "descriptionHtml": "Tired of your Storm Atronach blasting you with its chain lightning?\r\n\r\nMaybe you long for a more permanent ghostly animal friend?\r\n\r\nOr perhaps you want to just transform into a werewolf and ruin somebodies day without having to worry about waiting to use it again?\r\n\r\nIf you answered yes (or no) to any of the above, then Manlizard the Wizards Balancing and Tweak Bonanza is for you! \r\n\r\nThe main aim of this mod was to fix and balance various things for a more enjoyable experience.\r\nA lot of the changes in this mod may still need tweaking and changing, and feel free to bring constructive criticism to the mod. Trolls will not be tolerated, if you don\\'t like this mod, leave.\r\n_________________________________________________________________________________________\r\n\r\nA List of the changes so far:\r\n\r\nDawnbreaker - Damage - Enchantment \r\n-Increased damage of both weapon and enchant so it\\'s not weaker than chillrend\r\n\r\nChillrend - Damage - Enchantment \r\n-Static damage and weight for all variations of the sword, Enchant *STILL* scales for balance reasons, removed paralyze\r\n\r\nArchmage robes (Both hooded and not) - Enchantment \r\n-Now reduces all magic costs by 35%, increases magicka by 50 point and boosts magicka regen by 125%\r\n-these changes are applied to both the hooded and non hooded versions of the robe\r\n-this should have also fixed the invisible head glitch with the regular Archmage robes\r\n\r\nEbony Mail - Stats \r\n-now a light armour piece, with reduced weight and defence\r\n\r\nEbony Blade - Damage \r\n-increased base damage, this sword was pretty disappointing to say the least\r\n\r\nDragonbane - Damage \r\n-Static damage and weight for all variations of the sword, Enchant *STILL* scales for balance\r\n\r\nConjuration - Atronachs - Spells \r\n-Boosted their damage and replaced the Storm Atronachs chain lightning with lightning bolt, because getting killed by your own minion blows\r\n-Also fixed the \\\"potent\\\" prefix not showing up on thralls when you have the perk\r\n\r\nConjure familiar - Reworked \r\n-Now a weak but permanent low level summon for those who desire a companion animal\r\n\r\nDragonpriest Masks - Stats - Enchantment \r\n-Removed all armour tags from the mage masks and fixed some incorrect enchantments\r\n-Morokei now increases magicka regeneration by 100% and reduces the time between shouts by 25%\r\n\r\nDark Brotherhood Robes - Stats - Enchantment \r\n-now has the same enchantment as an apprentice destruction robe, 15% reduced cost and 75% increased magicka regen\r\n-Removed all defence ratings from the robe peices\r\n\r\nMace of Molag Bal - Damage \r\n-increased damage\r\n\r\nStaff of Magnus - Enchantment \r\n-now drains 50 points of magicka/health instead of 20, greatly increased charge\r\n\r\nWerewolf - Abilites - Feeding - Reworked \r\n-Now able to be cast unlimited times. Boosted health from feeding and removed health regen penalty\r\n\r\nGiant Club - Damage \r\n-Lowered its damage, giants should no longer be as powerful as Odin *Still testing this*\r\n\r\nWindshear - Damage - Enchantment \r\n-Boosted damage and increased charge\r\n\r\nMehrunes Razor - Damage \r\n-slightly boosted damage because Dagon needs some love too\r\n\r\nSilver Sword and Greatsword - Damage \r\n-slight increase in damage, now worth using over steel\r\n\r\nLunar Weapons - Enchantment\r\n-The enchantment on these weapons was set to damage attack speed and not enemy health, Now they do shock damage when the moons are out\r\n\r\nDragon bones/Scales - Stats\r\n-Reduced the weight of these slightly since it made no sense that the dragon equipment was relatively light but the bones weigh so damn much\r\n\r\nA readme file with the changes is included with the mod.\r\n_________________________________________________________________________________________\r\n\r\nInstallation:\r\n\r\nJust unpack the .rar and drop it in you Data folder.\r\n\r\nTo uninstall just delete the ESP for this mod and cut off your left pinky finger.\r\n_________________________________________________________________________________________\r\n\r\nThis mod is my own work and if you choose to use it in yours, you must first ask my permission and give credit where credit is due.\r\n",
  "categoryId": "24",
  "version": "1.2",
  "author": "Fighterblaze1",
  "createdUnix": "1328872251",
  "updatedUnix": "1328903507",
  "containsAdultContent": false,
  "uploadedBy": "fighterblaze1",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28516",
      "name": "Balance and Tweak Bonanza ",
      "version": "1.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Balance and Tweak Bonanza -8687-1-2.rar",
      "uploadedUnix": "1328903507",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/558650630327572bc55e8729c221d7d45c1f7c0c6831397ea1987ad9c89d77e0/analysis/1406671262/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Balance%20and%20Tweak%20Bonanza%20-8687-1-2.rar?fid=28516&ttl=1535767650&ri=8192&rs=8192&setec=7fa8d58711967c5c81ae3077601d21bd"
    }
  ]
}