{
  "modId": 86899.0,
  "modName": "Solitude Business Broker Reload (Russian)",
  "summary": "",
  "descriptionHtml": "[font=Comic Sans MS][center][size=4][url=https://www.nexusmods.com/skyrim/mods/86899/]Solitude Business Broker Reload[/url][/size][/center]\r<br />\r<br />Данный мод представляет собой измененную русскоязычную версию одноименного англоязычного мода. Модификации преимущественно проводились с целью приблизить контент мода к ЛОРу игры.  \r<br />\r<br />Ссылка на оригинал:[size=2] [/size][url=https://www.nexusmods.com/skyrim/mods/65990/][size=2]Solitude Business Broker by [b]CouriersGambit[/b][/size] [/url]\r<br />\r<br />[center][size=3]Описание[/size][/center]\r<br />   Этот мод представляет собой простую инвестиционную систему, которая позволяет игрокам получать стабильный доход, делая инвестиции у бизнес-брокера. В моде представлены 15 видов бизнеса, доступные для покупки. Идеальное решение как для любителей ролевой игры, так и для игроков, которым некуда тратить свои септимы. \r<br />\r<br />   Отправляйтесь в Солитьюд, там вы найдете новое здание (рядом с выходом из Мрачной башни на мосту, где вы оказываетесь по квесту ТБ, путь показан в картинках) и поговорите с NPC внутри. Он расскажет о том, как все работает, и почему он здесь. Чтобы приобрести бизнес, вам необходимо активировать любой из трех гроссбухов, находящихся в офисе. Каждый гроссбух представляет определенную сферу (сельское хозяйство, горное дело и городское предпринимательство). После активации одного из гроссбухов вы увидите меню, в котором перечислены бизнес и его цена. Далее необходимо сделать выбор и, при наличии достаточной суммы, сделка будет заключена. Вам выдадут свидетельство о собственности, которая нужна лишь для того, чтобы отслеживать уже приобретенные бизнесы. Прибыль от бизнеса будет копиться в офисе брокера. Каждое предприятие имеет свой уровень доходности, также присутствует фактор случайности (прибыль может меняться день ото дня, может дойти до того, что с дорогущего предприятия вы получите около 5 септимов, так что не пугайтесь, это не баг), однако по общему правилу доходность бизнеса определяется его ценой. Также не имеет значение, в какую сферу вы вкладываетесь, делайте этот выбор исходя из ваших личных предпочтений.\r<br />\r<br />Рекомендация от [url=https://www.nexusmods.com/skyrim/users/3076366]CouriersGambit[/url]:\r<br />Имейте в виду, что этот мод использует скрипты, рекомендуется сделать резервное копирование.\r<br />\r<br />\r<br />[color=#666666]Оригинальное описание:\r<br />\r<br />Purpose:\r<br />This mod is a simple out of the box investment system that allows players to build up a stable income by purchasing businesses from a business broker based out of solitude. This is a small mod that adds 50 different types of businesses for the player to purchase. If you ever thought that you had too much money and nothing to spend it on, then here is your short term solution. You can purchase as many of these businesses as you see fit. \r<br />\r<br />How it Works:\r<br />Simply head to Solitude, enter the new building and talk to the NPC inside. He&#39;ll provide some background on how things work and why he&#39;s here. To purchase a business you need to activate any one of the ten ledgers on display around the office. Once activated you should see a menu that lists a business and its price. If you make a selection you will pay the stated price and receive a record of your purchase. The record is just a simple means to keep track of what you own and has no other purpose. You can store it in the cabinet in the office or do what ever you see fit with it. The profit from the businesses you purchase will be deposited in a large chest located in the broker&#39;s office. All businesses have a one percent daily return on their investment so don&#39;t expect to get rich over night. \r<br />\r<br />Caution:\r<br />Keep in mind that this mod does use scripts so backup your saves if you decide to give this mod the boot.[/color]\r<br />\r<br />Отправляйте свои отчеты о возможных багах, возникшие пожелания и предложения. Буду очень благодарен&#33;\r<br />\r<br />Спасибо [url=https://www.nexusmods.com/skyrim/users/3076366]CouriersGambit[/url] за создание первоначальной версии данного мода.[/font]",
  "categoryId": "69",
  "version": "1.0",
  "author": "serafim6",
  "createdUnix": "1506121540",
  "updatedUnix": "1506121536",
  "containsAdultContent": false,
  "uploadedBy": "serafim6",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000255541",
      "name": "Solitude Business Broker Reload (Russian)",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "25",
      "fileName": "Solitude Business Broker Reload (Russian)-86899-1-0.rar",
      "uploadedUnix": "1506121536",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d48ae0470c93ad4251e090484f723f25f1684d32334dcc1eaeed17193d3ad3d6/analysis/1506121682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Solitude%20Business%20Broker%20Reload%20%28Russian%29-86899-1-0.rar?fid=1000255541&ttl=1535875833&ri=8192&rs=8192&setec=9da5161337eeed83fae8422ba8847ce4"
    }
  ]
}