{
  "modId": 8691.0,
  "modName": "Riverhearth QUEST and Player Home",
  "summary": "Relax by the hearth, knowing that if you catch fire the river is close by. QUEST+ Player HOME reward. ",
  "descriptionHtml": "[color=green][size=15][b]Riverhearth[/b][/size] PLAYER HOME +QUEST[/color]\r\n[i]Relax by the hearth, knowing that if you catch fire the river is close by...[/i]\r\n\r\nRiverhearth is a cosy house nestled in Riverwood. Located behind the Inn, just before a mountain path\r\n\r\nThere is a simple quest to win the house. Start by heading to the Sleeping Giant Inn in Riverwood and talking to a certain \\\"Mary\\\"\r\nAlternatively you could kill/pickpocket her for the key\r\n\r\nIt consists of two rooms. A groundfloor living area and a basement/storage. There is also a mysterious locked door, currently inaccessible but a part of a bigger (WIP) questline. The basement is a hideaway - thus the door is hidden, just look a little more carefully inside your house.\r\n\r\nFacilities include: Permanent chests, Cooking pot, Smithing anvil, Workbench, Grindstone, Alchemy bench and enchanting bench.\r\n\r\n\r\n[color=green][size=13]Installation[/size][/color]\r\nDrag the .esp file Riverhearth Home to the Data folder of your Skyrim directory = C:\\\\Program Files\\\\Steam\\\\steamapps\\\\common\\\\skyrim\\\\Data\r\nthen when openning skyrim in the splash click [Data Files] and ensure \\\"Riverhearth Home\\\" has a ticked box.\r\nAlternatively use NMM and let it do it for you =)\r\n\r\n\r\n[color=green][size=13]Known Issues[/size][/color]\r\nThe dialogue text with Mary sometimes runs too fast. However this does not detract from the quest. Working on a fix\r\n\r\nThis mod will conflict with any other that places objects which exist in the same spot as Riverhearth\r\n\r\n\r\n[color=green][size=13]Permission[/size][/color]\r\nPlease do not redistribute without my permission.\r\n\r\nSPOILER: Wonder why Mary was so quick to give you the house? Keep track of this file to see what that mysterious door leads to [i]hint:[/i]more quests?",
  "categoryId": "67",
  "version": "1.0",
  "author": "Noobo",
  "createdUnix": "1328874195",
  "updatedUnix": "1328876630",
  "containsAdultContent": false,
  "uploadedBy": "Noobo",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28363",
      "name": "Riverhearth home v1",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "26",
      "fileName": "Riverhearth home v1-8691-1-0.zip",
      "uploadedUnix": "1328876630",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3136e66926214627cc83b182c9d2390a8bed220b59f89f01c1a16a2c9115907b/analysis/1406666825/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Riverhearth%20home%20v1-8691-1-0.zip?fid=28363&ttl=1535767655&ri=8192&rs=8192&setec=748ce2290fd7f1259024a9d548d63c49"
    }
  ]
}