{
  "modId": 86927.0,
  "modName": "The Uchiha Clan - Kakashi Path",
  "summary": "Small plugin I made for Uchiha Clan mod and Naruto Overhaul mod",
  "descriptionHtml": "Simple Adds Kakashi Path in Kakashi eye you get from same vendor as non-uchiha path uchiha eye. These mod adds new and modified spells so it shouldn&#39;t effect any spells in uchiha clan or naruto overhaul mods. I removed all uchiha path spells from the vendors to make it so you can&#39;t use spells from different paths (more immersive). All the spells are balanced and adjusted to my liking, I thought the spells were to powerful so I modified most of them to use % of your health stamina and magicka. You probably shouldn&#39;t consume both Kakashi and Uchiha eye at the same time haven&#39;t tested it, maybe it works but it&#39;s probably not a good idea.\r<br />\r<br />Kakashi&#39;s Abilities:\r<br />\r<br />-Promise to Protect Rin (You made a promise to Obito to protect Rin and you failed, never break a promise again. Your Resolve increases your Magicka pool by &lt;100&gt; points and allows you to regenerate Magicka while Susano&#39;o is active.)\r<br />\r<br />-Perfect Susano&#39;o: Stage 1 (Summons a Perfect Version of Susano&#39;o&#39;s ribcage.  It costs &lt;50&gt;% of your current health, reduces damage from all sources of damage by &lt;90&gt;%, and physical damage suffered hits magicka instead of health until depletion.)\r<br />\r<br />-Kamui: Gift from Obito (Use Obito&#39;s eye to teleport the target to the Kamui Dimension forever. This comes at a great cost of 95% of your current health and all of your magicka and stamina as dimensional jutsu are very taxing on the body.)\r<br />\r<br />-Kotoamatsukami: Will of Fire (Through the Will of Fire you learned to turn foe to friend, Kotomatsukami&#33; Target becomes follower forever at the expense of 50% current health plus all of magicka and stamina, until you dismiss him (by hitting again with spell) or using on other target.)\r<br />\r<br />-Amaterasu (Ignites a NPC you focus on and reduce your health by 50% while depleting your magicka and stamina.)\r<br />-Tsukuyomi (Target is slowed for &lt;15&gt; seconds, and suffers &lt;23&gt; damage points on its health per second. Your health, magicka, and stamina decrease by 20%)\r<br />\r<br />-Might Guy: My Eternal Rival (Speed) (Tap into the memories of your rival races with Might Guy, surpassing your limits to move short distances (about 45 meters) at an almost untraceable speed. It costs &lt;20pts&gt; of magicka and stamina.)\r<br />\r<br />-Might Guy: My Eternal Rival (Youth) (Tap into your youth to surpass your rival Might Guy. Become stronger and counterattack 50% of incoming damage by increasing physical abilities at the cost of health overtime due to great stress on the body.)\r<br />\r<br />-True Chidori: Cloak (Unleash the power of the Chidori&#33; True Chidori: Cloak increases your defences, magicka, stamina, speed and attack power but slowly drains your stats as well.)\r<br />\r<br />-True Chidori (Rank #1-4) (Close range lightning attack that does shock damage to Health and Magicka per second.)\r<br />\r<br />All Credits to\r<br />[url=https://www.nexusmods.com/skyrim/mods/51136/?]\r<br />The Uchiha Clan\r<br />[/url]\r<br />[url=https://steamcommunity.com/sharedfiles/filedetails/?id=786476615]Naruto Ultimate Overhaul\r<br />[/url]\r<br />Both are required",
  "categoryId": "75",
  "version": "0.1",
  "author": "jamal13",
  "createdUnix": "1506196697",
  "updatedUnix": "1506196683",
  "containsAdultContent": false,
  "uploadedBy": "jamal13",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000255642",
      "name": "Uchiha Clan Kakashi Path",
      "version": "0.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "20",
      "fileName": "Uchiha Clan Kakashi Path-86927-0-1.rar",
      "uploadedUnix": "1506196683",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/cda7e9ad7bc38289d9599e363136d91334d0868b26953d3227c202af78747e7b/analysis/1506196925/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Uchiha%20Clan%20Kakashi%20Path-86927-0-1.rar?fid=1000255642&ttl=1535875865&ri=8192&rs=8192&setec=e0659f2f341eeeb8dc929f1384a6cb71"
    }
  ]
}