{
  "modId": 86953.0,
  "modName": "Skyrim for the Giants",
  "summary": "This mod strengthens giants in Skyrim. Now they will receive new levels and an increase in the characteristics along with the player. Combat with giants will become more interesting and a reward for winning will be greater.",
  "descriptionHtml": "This mod strengthens giants in Skyrim. Now they will receive new levels and an increase in the characteristics along with the player. Combat with giants will become more interesting and a reward for winning will be greater. New potions, ingredients, materials for crafting, from which you can create totems. To do this, you need to find the Cannibal Camp, it is located near Fort Sunguard and the Gjukar&#39;s Monument. There is the Cannibal Chest, in which lies the Amulet of the Darkpower. If you take it, the Lord of Shadows will appear in Skyrim with his minions. They will wander around Skyrim and attack small settlements. Cannibals are very aggressive and powerful giants, but a reward for winning over them more. You can get materials for creating bloody totems and different collectibles. The Lord of the Shadows is a very strong boss. You will need help to overcome him. After defeating him you will receive a symbol that can raise the level of your amulet. Limit for the amulet is level 10.\r<br />All items from the mod are created and improved on the altar of sacrifices.\r<br />\r<br />If this mod will have a lot of downloads and positive comments - I will translate for you the remaining my war-mods &#34;Skyrim for Spriggans&#34;, &#34;Skyrim for Dwemers&#34; and &#34;Skyrim Defenders&#34; :)\r<br />\r<br />[u][b]Attention&#33;[/b][/u] Install this mod only if you have a high level and there is a good equip&#33;\r<br />[u][b]Attention&#33;[/b][/u] From this mod can perish civilians or quest NPCs.\r<br />I recommend for this mod to install modifications that protect civilians, or do not touch the Amulet of the Darkpower&#33;\r<br />\r<br />For playing in this mod you need Skyrim 1.9 and DLC &#34;Dawnguard&#34;.",
  "categoryId": "83",
  "version": "1.0",
  "author": "slastik",
  "createdUnix": "1506333444",
  "updatedUnix": "1506333384",
  "containsAdultContent": false,
  "uploadedBy": "slastik",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000255759",
      "name": "SFTG_eng",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5245",
      "fileName": "SFTG_eng-86953-1-0.7z",
      "uploadedUnix": "1506333384",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/efcad78ad00e412310f5f9f3812bf4a556ceaa527213fa3a5565241d1441273d/analysis/1506333740/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SFTG_eng-86953-1-0.7z?fid=1000255759&ttl=1535875889&ri=8192&rs=8192&setec=3b90af175cc9ff990fd034ce0574473c"
    }
  ]
}