{
  "modId": 870.0,
  "modName": "Dynamic Magicka",
  "summary": "A tweak for magic - specifically focused on re-balancing Destruction.",
  "descriptionHtml": "If you like it, Comment or Endorse!\r\n\r\nInstructions:\r\n\r\n1) Use ONE of the following:\r\n*DynamicMagicka.esp - The basic, (hopefully) balanced version\r\n\r\n*DynamicMagicka(NoEnchant).esp removes the limitation on Enchanting, so that you can stack yourself up with potions to the ridiculous vanilla levels. Even though I consider it cheating, sometimes cheating can be a LOT of fun!\r\n\r\n*DynamicMagicka(WeakerDualCast).esp lowers Dual Casting mana to 4 (from 5) and damage to 4.5 (from 6). This can be used for more challenge or if you feel the default values are too high.\r\n\r\n*DynamicMagicka(NoEnchant+WeakerDualCast).esp combines NoEnchant and WeakerDualCast.\r\n\r\n2) Use ONE of the  DynamicMagickaRegen files - 1.5, 2, 2.5 or 3. My recommended setting is 2.5 for fun or 2 for challenge.\r\n\r\n3) Place your chosen .esps in your Data folder.\r\n\r\n4) Enable both esps in the Skyrim launcher OR add the name of the esp to your Plugins file\r\n\r\n\r\nRecommend you combine with Better Wards from Magicka Empowered: http://www.skyrimnexus.com/downloads/file.php?id=382\r\n\r\nEnjoy, and please leave feedback!\r\n\r\nTo be clear: this mod is meant for Destruction mages, spellblades and battlemages of all levels. At high levels you are meant to feel godlike on par with 2h or 1h warriors, and at low-medium it is meant to be challenging but fun. Those are the goals, and I\\'d appreciate any help balancing it more betterer =0)\r\n\r\nVersion 0.3 Changes:\r\nFixed a graphical bug with perks\r\nAdded a version with vanilla enchanting levels, a version with weaker Dual Casting and a version combining both\r\n\r\nVersion 0.2 Changes:\r\nMagicka reduction from skill increased to .005 from .0035\r\nDual Casting time down to 3 from 5 (should line up with animations now)\r\nLightning Storm and Blizzard damage boosted\r\nDestruction Apprentice, Adept and Expert and Master Perks each give a 10/15/20/25% damage bonus to all Destruction spells\r\nMaster Perk reduces cost to 25% instead of 50%\r\nNovice Perk reduces cost to 25% instead of 0 (to balance Dual Casting)\r\nIncreased Enchanting power to 1 from 0.9\r\nAugmented perks reduced to 40/80 from 40/100 (total from mastering destruction perk tree is +150% damage now, up from +100%)\r\nFour separate Magicka Regen rates to choose from\r\n\r\nDescription:\r\nI got sick with the impotence of Destruction Magic in the game. Searching here I came across Magicka Empowered, a mod that makes some changes to the magicka system. It was a definite improvement to magic, especially Destruction. But it wasn\\'t quite what I was looking for.\r\n\r\nSo I decided to make my own mod based on the ideas from that one. My goal is to make playing a mage or spellblade highly dynamic and action packed. Having slow mana regen and having to rely on potions etc would be fine if damage in Destruction simply SCALED. This is the core of the problem in my eyes. Unfortunately I can\\'t see a way to change that. So instead I came up with a different way to make Destruction actually do damage.\r\n\r\nThe key is Dual Casting. As it is now, Impact is stupid - you can stun-lock and slowly whittle away an enemy. BORING. Instead, I\\'ve made Dual Casting a HUGE damage boost. Currently I have it set to do 6x the normal spell damage. However, it will use 5x the mana and take 5x as long to cast. You simply can\\'t spam it on big spells, so you either use it for damage or for stun-lock. You kind of have to listen for the cue that dual cast is ready, in 3rd person the animation won\\'t tell you.\r\n\r\nIn addition, base spell cost is double normal. To compensate for this, I\\'ve increased mana regen in combat by a LOT. Mana pool is also very important, simply to be able to cast the big spells at all.\r\n\r\nA lot of the changes from Magicka Empowered are still in: Skilling up in magic reduces mana cost by more, Destruction perks increase damage by way more (I\\'ve bumped it up to 40% and then 100% damage bonus). I kept the changes to Novice Destruction spells, so that the perk makes them cast for free. You can choose to use them instead of letting your mana regen for big spells, though they do paltry damage.\r\n\r\nI also slightly lowered the power of Enchanting. This spell system only works if you can\\'t enchant stack to get massive bonus mana regen or reduce spell cost to 0. (I\\'m pretty sure you can only get to about 79% cost reduction now). Frankly I find Enchanting to be stupidly overpowered.\r\n\r\nThis mod should probably only be used if you are planning on playing a Destruction mage or Destruction spellblade. It is a series of my own personal temporary fixes to stop the sinking ship that is Destruction magic, at least until we can get a real fix like scaling damage. *** It would appear that this change has made it so that Enchantment enhancing potions REDUCE your enchanting power. I see no way around this for now. ***\r\n\r\nThis is a VERY beta mod, I don\\'t know if the numbers are sound and will be playing around with it. PLEASE give me feedback.\r\n\r\nIf you don\\'t like my changes go check out Empowered Magicka: http://www.skyrimnexus.com/downloads/file.php?id=382 by Phoynix.",
  "categoryId": "24",
  "version": "0.3",
  "author": "Thrakkemarn",
  "createdUnix": "1321845996",
  "updatedUnix": "1322095689",
  "containsAdultContent": false,
  "uploadedBy": "thrakkemarn",
  "primaryFile": null,
  "files": [
    {
      "fileId": "2611",
      "name": "DynamicMagicka02",
      "version": "0.2",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3",
      "fileName": "DynamicMagicka02-870.rar",
      "uploadedUnix": "1321934648",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/ea9c67cadf25ecf4b6b7352846b690eed6082df64e353d5a2c6f440a6e6f0bff/analysis/1406432523/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicMagicka02-870.rar?fid=2611&ttl=1535754090&ri=8192&rs=8192&setec=2c9f758003ba46a21b2f267787836797"
    },
    {
      "fileId": "2614",
      "name": "DynamicMagicka01",
      "version": "0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "1",
      "fileName": "DynamicMagicka01-870.rar",
      "uploadedUnix": "1321934891",
      "modVersion": "0.1",
      "virusScanUrl": "https://www.virustotal.com/file/9f99fd044dc2a93b6c1800257dcfe2375215b72bf19ff852c47a6a9ca79669e5/analysis/1406432583/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicMagicka01-870.rar?fid=2614&ttl=1535754090&ri=8192&rs=8192&setec=92f583cf39baadbea01d698d3dc742aa"
    },
    {
      "fileId": "3311",
      "name": "DynamicMagicka",
      "version": "0.3",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "DynamicMagicka-870-0-3.rar",
      "uploadedUnix": "1322095689",
      "modVersion": "0.3",
      "virusScanUrl": "https://www.virustotal.com/file/bfddd5af6f898dd2a7e04ff992dacc51df343bc4ce4b364ff85397bb8d62008c/analysis/1406440265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/DynamicMagicka-870-0-3.rar?fid=3311&ttl=1535754091&ri=8192&rs=8192&setec=002b5c25e6e976dcbbfc148e1d18da4a"
    }
  ]
}