{
  "modId": 87062.0,
  "modName": "LessBlindingFire",
  "summary": "As the name sais: I was annoyed by nor seeing anything in first person when on fire. So I changed.\r<br />Wie der Name sagt: Ich hatte es satt, nichts zu sehen, wenn man in der ersten Person brennt. Also hab ich es geändert.",
  "descriptionHtml": "First I have to say, that english isn&#39;t my mother language, so I beg pardon for any mistakes. If you are German, you can now scroll down, I also wrote this in German.\r<br />\r<br />Your here, so that should mean, that you have the same problem, I had. Fight aganst a fire dragon or a fire mage and you&#39;re completely blind. In third person it&#39;s not that annoying, but if you are an archer or mage in first person you might be very pissed of. I&#39;ve searched the whole nexus for a mod, but I didn&#39;t find anything. So I invested a few houres to help myself.\r<br />If there is a mod like this, I didn&#39;t knew. This mod is not meant to &#34;copy&#34; an idea of another person.\r<br />\r<br />\r<br />[u]So what this mod does:[/u]\r<br />\r<br />In fact, not very much.\r<br />It reduces the flame effect, when sobebody is burning.\r<br />This mod JUST reduces the flames on the Body - the afterburn, if that word exists ;)\r<br />So you will still be blinded for a moment, when you get hit.\r<br />\r<br />YES, also NPCs are affected.\r<br />In third person, you may notice, that the burning effect isn&#39;t that impressive anymore, this have to be like that. It&#39;s one and the same effect and I reduced this effect, so... live with it.\r<br />\r<br />This mod DOES NOT change anything about blooming or something like that, I hardly know what that is. I just found out, how to reduce the particles.\r<br />\r<br />\r<br />[u]There are (for now) two versions: Pleas choose one[/u]\r<br />\r<br />One: I set the Particle count to the halth. --&gt; You see something, but it&#39;s hard. (For &#34;realistic&#34; gamers)\r<br />Two: I set the Particle count to around 1/4. --&gt; You see something, for me personally it&#39;s just fine.\r<br />I will try to make some screenshots, so you can decide for your own.\r<br />\r<br />\r<br />[u]Installation:\r<br />\r<br />[/u]With NMM or manual.\r<br />If you install manual, just drop the .esp in your Skyrim/Data folder.\r<br />For deinstallation just delete the .esp or delete the mod with the NMM.\r<br />\r<br />\r<br />[u]Compatibility:\r<br />[/u]\r<br />This mod should be compatible with every other mod, I have about 100 and there wasn&#39;t any issue.\r<br />If you use a magic mod (new spells or something) LessBlindingFire could effect this new spells as well.\r<br />That means, if you are hit with a modded spell, LessBlindingFire will affect the &#34;afterburn effect&#34; just like the vanilla spells.\r<br />Thats because the new spells use the original burning effect of the game. If you load LessBlindingFire after the magic mod, you will see the effect.\r<br />If the magic mod comes with a complete new animation, I&#39;m not sure. But It shouldn&#39;t crash your game. It&#39;s just possible, that LessBlindingFire won&#39;t work for that special spells.\r<br />[u]\r<br />For the DLCs:[/u]\r<br />I have all DLCs, there shouldn&#39;t be any problem, but it&#39;s not necessary to have them.\r<br />\r<br />I&#39;m not a great modder, just playing around with the CK, nevertheless please don&#39;t reupload this files to any other webside. If you want to use this mod (I can&#39;t imagine, why you should, but just in case) for integrate it in your own, then please send me a message and ask for permission.\r<br />\r<br />If there are any problems with this mod, I can&#39;t promise, that I will be able to help you. But I&#39;ll try my very best.\r<br />\r<br />--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\r<br />\r<br />So, hallo an alle Deutsch-Sprechenden. Ich entschuldige mich auch hier im Voraus für mögliche Schreibfehler :)\r<br />\r<br />Wer hier gelandet ist, hat wahrscheinlich das gleiche Problem, dass ich lange hatte. Man kämpft gegen enen Feuerdrachen oder Feuermagier und sieht nichts mehr ausser Feuer. Nicht mal den/die Gegner. In der dritten Person ist es nicht ganz so schlimm, aber gerade als Bogenschütze oder Magier spielt man oft in der ersten Person und ist einfach nur noch genervt. Ich habe das Internet und Nexus mods durchsucht, aber keinen mod gefunden, der dieses Problem löst. Also habe ich ein paar Stunden meines Wochenendes investiert und versucht mir selbst zu helfen.\r<br />Falls es doch schon einen mod gibt, den ich nur übersehen habe: Es war nie meine Absicht, eine &#34;Idee&#34; zu klauen.\r<br />\r<br />\r<br />[u]Was dieser mod macht:[/u]\r<br />\r<br />Eigentlich nicht viel.\r<br />Er reduziert den Flammeneffekt, wenn jemand brennt.\r<br />Dieser Mod betrifft nur die Flammen am Körper, (das &#34;Nachbrennen&#34;) andere Feuereffekte sollten nicht betroffen sein.\r<br />Man wird also immernoch kurz geblendet, wenn man gerade von einem Feuerball getroffen wird.\r<br />\r<br />Und ja, NPCs sind auch betroffen.\r<br />In der dritten Person wird man evt. bemerken, dass der &#34;in Flammen&#34; Effekt nicht mehr ganz so eindrucksvoll sein wird, daran kann ich nichts ändern. Der Effekt, den man an NPCs sieht und der, der einem die Sicht raubt ist nämlich der selbe. Und da ich den runtergeschraubt habe... muss man eben damit leben.\r<br />\r<br />Dieser Mod ändert nichts am Blooming (gibt es dafür ein deutsches Wort?) oder ähnliches, ganz einfach, weil ich nicht mal genau weiß, was das ist. Ich habe nur herausgefunden, wie man die angezeigten Partikel reduziert.\r<br />\r<br />\r<br />[u]Im Moment gibt es zwei Versionen: Bitte nur eine wählen[/u]\r<br />\r<br />Erstens: Die angezeigten Partikel wurden halbiert. --&gt; Man sieht etwas, aber es ist nicht ganz einfach. (Für die &#34;Realisten&#34; unter den Spielern)\r<br />Zweitens: Die angezeigten Partikel wurden auf etwa 1/4 des Originalwertes gesetzt. --&gt; Man sieht etwas, für mich persönlich taugt es so.\r<br />Ich werde versuchen ein paar gute Screenshots zu machen, damit jeder für sich selbst entscheiden kann.\r<br />\r<br />\r<br />[u]Installation:[/u]\r<br />\r<br />Einfach mit NMM oder manuell.\r<br />Bei manueller Installation einfach die .esp in den Skyrim/Data Ordner kopieren.\r<br />Zum Deinstallieren, die .esp einfach löschen oder NMM benutzen.\r<br />\r<br />\r<br />[u]Kompatibilität:[/u]\r<br />\r<br />Dieser Mod sollte mit jedem anderen Mod funktionieren, ich habe etwa 100 Mods installiert und habe keine Probleme.\r<br />Wer einen Magie Mod benutzt (für neue Zauber oder so), kann es sein, dass LessBlindingFire diese neuen Zauber genauso beeinflusst, wie einen Vanilla Zauber. Das ist so, weil viele dieser neuen Zauber, auf die Effekte vom originalen Spiel zurückgreifen. Wenn LessBlindingFire nach diesen Mods geladen wird, wird man also auch von gemoddeten Zaubern nicht (so sehr) geblendet. Benutzen die neuen Zauber allerdings einen neuen, ebenfalls gemoddeten Effekt, wird LessBlindingFire wahrscheinlich nicht wirken. Auch wenn ich nicht glaube, dass es zu großen Komplikationen führen wird. Man ist halt evt. wieder blind.\r<br />\r<br />[u]Zu den DLCs:[/u]\r<br />\r<br />Ich habe alle DLCs und es gab keine Probleme. Dieser Mod sollte aber genausogut ohne DLCs funktionieren.\r<br />\r<br />Wie man vielleicht herausgehöhrt hat, bin ich kein großen Modder. Ich setzt mich nur immer mal wieder mit dem CK auseinander und erschaffe kleinere Spielereien. Trotzdem möchte ich nicht, dass dieser Mod auf anderen Websites auftaucht. Wenn jemand, aus welchen Gründen auch immer, diesen Mod für seine eigene Arbeit benutzen möchte, schickt mir eine Nachricht und fragt vorher.\r<br />\r<br />Wenn jemand Probleme mit diesem Mod hat, kann er gerne davon berichten. Ich kann nur keine Hilfe garantieren, aber ich werde mein möglichstes versuchen.",
  "categoryId": "62",
  "version": "1.0",
  "author": "xxxsdxxx5",
  "createdUnix": "1506817273",
  "updatedUnix": "1506817219",
  "containsAdultContent": false,
  "uploadedBy": "xxxsdxxx5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000256220",
      "name": "LessBlindingFire 50 Percent",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "LessBlindingFire 50 Percent-87062-1-0.7z",
      "uploadedUnix": "1506816695",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/9e61195aeef5f0ec6f247d9a2bf7e0d6da91cb41166586179d4b95fc62101d01/analysis/1506816848/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LessBlindingFire%2050%20Percent-87062-1-0.7z?fid=1000256220&ttl=1535875992&ri=8192&rs=8192&setec=b24be7d223a86cad99ebd07275b62c1d"
    },
    {
      "fileId": "1000256224",
      "name": "LessBlindingFire 25 Percent",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "LessBlindingFire 25 Percent-87062-1-0.7z",
      "uploadedUnix": "1506817219",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/edbdae66b745905e00500171a556e4c18c627c707fcf4c70ec7839cac019eccc/analysis/1506817442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/LessBlindingFire%2025%20Percent-87062-1-0.7z?fid=1000256224&ttl=1535875992&ri=8192&rs=8192&setec=775c272bd3a7e1dab3e74f47875bbc49"
    }
  ]
}