{
  "modId": 87218.0,
  "modName": "UnImmersive Creation Club Fr",
  "summary": "Le Création Club est un gourdin de géant jouable avec une nouvelle texture... Bien sûr, je suis sûr qu&#39;il y a de meilleurs gourdins qui sont plus créatifs que celui-ci sur le Nexus si vous regardez autour.",
  "descriptionHtml": "[center]\r<br />Comme demandé, l&#39;UnImmersive Creation Club est maintenant disponible pour Skyrim Special Edition\r<br />et ce n&#39;est [color=#1e84cc]pas si spécial[/color] - non traduit\r<br />\r<br />[b][size=3]Description\r<br />[/size][/b]Le Création Club est un gourdin de géant jouable avec une nouvelle texture... Bien sûr, je suis sûr qu&#39;il y a de meilleurs gourdins qui sont plus créatifs que celui-ci sur le Nexus si vous regardez autour.\r<br />\r<br />Il est possible de tremper le Création Club - la traduction fr choisit ici - et il est proposé en trois couleurs différentes: le Camouflage de Morthal, le Noir chien de la mort et le Chêne rouge. Toutes les versions du gourdin ont des vues de 1 ère personne et 3 ème personne.\r<br />\r<br />J&#39;avais l&#39;intention de faire une quête profonde sur comment obtenir le Création Club, mais je ne l&#39;ai pas fait, cela a semblé être beaucoup de travail pour une re-texture. Ensuite, je pensais que je pourrais simplement faire une quête ou le looter d&#39;un monstre dans un champ quelque part, ou peut-être que cela apparaisse magiquement dans votre inventaire, mais ces idées ont été un peu moins nombreuses dirais-je.\r<br />\r<br />Je me suis arrangé pour le fabriquer.\r<br />\r<br />Crafter le Création Club en utilisant une casserole pour transformer vos Septims en âmes brisées.\r<br />Ensuite, vous pouvez utiliser 3 âmes brisées à n&#39;importe quelle forge pour créer le Création Club.\r<br />\r<br />[b][size=3]Recette d&#39;artisanat\r<br />[/size][/b]Vous pouvez faire un lot de 2 âmes brisées pour 799 Septims dans une casserole.\r<br />Vous aurez besoin de 3 Âmes brisées pour forger le Création Club, cela signifie que vous devrez créer l&#39;élément âmes brisée deux fois.\r<br />Donc, le Création Club vous coûtera un total de 1598 Septims et vous aurez un surplus d&#39;âme brisée pour une utilisation ultérieure.\r<br />\r<br />[b][size=3]Installation\r<br />[/size][/b]Installez ce mod dans votre dossier de données Data à l&#39;aide d&#39;un mod manager ou manuellement.\r<br />\r<br />[b][size=3]Compatibilité\r<br />[/size][/b]Il ne devrait pas entrer en conflit mais je m&#39;appuis sur d&#39;autres créateurs de contenu pour créer des correctifs non officiels pour corriger les bogues dans tous les mods mini dlc que je sors.\r<br />\r<br />[b][size=3]Plans futurs\r<br />[/size][/b]J&#39;ai l&#39;intention de publier plus d&#39;éléments qui utilisent le &#34;concept&#34; d&#39;âmes brisées et je continuerai probablement à re-manager et à recycler le contenu qui a déjà été vu dans ce jeu ou plus, surtout si je peux demander à quelqu&#39;un d&#39;autre de faire tout ce travail.\r<br />\r<br />[b][size=3]Changelog[/size][/b]\r<br />Ajout d&#39;un seul pack de tous les gourdins comme demandé - Note du traducteur: Merci&#33; - , maintenant vous pouvez en avoir autant que vous le souhaitez dans le jeu - mais vous devez télécharger TOUS les fichiers sur votre disque dur, que vous le vouliez ou non.[/center]",
  "categoryId": "55",
  "version": "1.1",
  "author": "EizabethEzda and Setvi",
  "createdUnix": "1507461945",
  "updatedUnix": "1507460556",
  "containsAdultContent": false,
  "uploadedBy": "SETVI",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000256838",
      "name": "All UnImmersive Creation Clubs French",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2921",
      "fileName": "All UnImmersive Creation Clubs French-87218-1-1.rar",
      "uploadedUnix": "1507460556",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/96c7831f5361467f921f839e702f028f9ffd51cb28c29a5c733f35f2d051d8f0/analysis/1507460892/",
      "changelogHtml": " Version 1.1 - initial release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/All%20UnImmersive%20Creation%20Clubs%20French-87218-1-1.rar?fid=1000256838&ttl=1535876150&ri=8192&rs=8192&setec=c760e15b07cf0b883966b042d43927b7"
    }
  ]
}