{
  "modId": 87227.0,
  "modName": "StoneLodge Player Home - DELETED",
  "summary": "A small Player House Near Whiterun.",
  "descriptionHtml": "[b][u]Long Description\r<br />[/u][/b]Located just south of Whiterun on the creek StoneLodge is a small Dwemer themed home complete with all almost all the crafting and storage an inspiring DragonBorn could need.\r<br />\r<br />[b][u]Features\r<br />[/u][/b]The house is located just East of the Whiterun stables and South Whiterun hold proper, it has a map marker near the front door and will deposit you directly in front of it upon fast travel. There&#39;s no lock on the door but the marker must be discovered first before you can fast travel to it. \r<br />\r<br />Fully nav-meshed and Tes5edit cleaned it has no scripts so it&#39;s safe to install/un-install at any time.\r<br />\r<br />The house has a smelter just outside on the side of the house complete with its own named storage container.\r<br />The inside has just about every base crafting station including a wood chopping block (axe included), cooking pot, sharpening wheel, tanning rack, enchanting table, alchemy lab, armor tempering table, and a smithing anvil. In addition each station has it&#39;s own named storage. There is also a twin bed which grants a rested bonus.\r<br />There are also 6 more named storage containers on the wall along side the bed for everything from armor and weapons to all those quest items you don&#39;t really know what to do with once you&#39;ve completed their perspective quest lines.\r<br />\r<br />There is some clutter inside to give it a lived in feel but it is all static and shout proof, i kept everything to a minimum to make sure there was as little loading lag as possible. Everything is vanilla pathed so it will automatically match whatever texture overhauls your using. \r<br />\r<br />[b][u]Known Bugs\r<br />[/u][/b]I used the base games books and armor to create some of the static clutter which will throw a warning upon loading in CK (Creation Kit), it has no effect ingame, it&#39;s just CK gets annoyed when you convert some non-static items to static.\r<br />\r<br />[b][u]Installation and un-installation\r<br />[/u][/b]There&#39;s no scripts so it&#39;s safe to uninstall at any time, just remember to remove any items you want to keep or they&#39;ll be lost forever if you leave them behind.  ",
  "categoryId": "67",
  "version": "1.0",
  "author": "Tarskar",
  "createdUnix": "1507477265",
  "updatedUnix": "1507477260",
  "containsAdultContent": false,
  "uploadedBy": "tarskar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000256857",
      "name": "StoneLodge Player Home",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "65",
      "fileName": "StoneLodge Player Home-87227-1-0.7z",
      "uploadedUnix": "1507477260",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8d304d581abb4b72cacff7187b217e6a6839968cf2ea7256c7d754bf4ac0e6fc/analysis/1507477299/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/StoneLodge%20Player%20Home-87227-1-0.7z?fid=1000256857&ttl=1535876158&ri=8192&rs=8192&setec=9cfa5d67f9873252257bcb1bbfcbbcb4"
    }
  ]
}