{
  "modId": 87235.0,
  "modName": "Simple Perk Points",
  "summary": "Adds a small number of perk points to your character upon starting the game, configurable via script.",
  "descriptionHtml": "A simple script that adds a small number of perk points to the player the first time you load the game after installation. Several options are available in the archive, but I have provided the source code for people who want to configure the amount themselves. \r<br />\r<br />It may be installed at any time, but I recommend using it with a new character for balance purposes. I find that the the result is akin to choosing major and minor skills for your character, particularly when used along with various difficulty mods. I hope others find this useful&#33;\r<br />\r<br />[b]Recommended:[/b]\r<br />[url=https://www.nexusmods.com/skyrim/mods/1175/?]Skyrim Community Uncapper[/url] allows you to easily adjust the rate at which you gain experience, level up, and acquire perk points. Reducing the number of perk points received upon levelling up will make the perk points obtained through my mod seem all the more valuable. Perhaps you start the game with half a dozen perk points, but don&#39;t receive any more for some time? It&#39;s up to you&#33;\r<br />[url=https://www.nexusmods.com/skyrim/mods/58987/?]Spell Perk Restrictions[/url] prevents the player from using spells without first acquiring the requisite perk. Using this with the single perk point option from my mod means you have to be very certain about which school of magic you want to specialise in&#33;\r<br />\r<br />[b]Compatibility:[/b]\r<br />[url=https://www.nexusmods.com/skyrim/mods/33395/?]SkyTweak[/url] also provides options for adding perk points to your character at any point in the game, among many other infinitely useful features. If you&#39;re using this, then my mod isn&#39;t really necessary, but remains as an alternative for those who want to maintain a more minimalist load order (or simply prefer my implementation).",
  "categoryId": "73",
  "version": "v1.1",
  "author": "hagbaby",
  "createdUnix": "1507523959",
  "updatedUnix": "1507800448",
  "containsAdultContent": false,
  "uploadedBy": "bloodofourblood",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000257157",
      "name": "Simple Perk Points v1.1",
      "version": "v1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Simple Perk Points v1.1-87235-v1-1.zip",
      "uploadedUnix": "1507800448",
      "modVersion": "v1.1",
      "virusScanUrl": "https://www.virustotal.com/file/42e1bbbd76293d47f9a74841a814f50495ab5aec77e28238e846b8c30ccb0352/analysis/1507800722/",
      "changelogHtml": " Added options for additional perk points. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simple%20Perk%20Points%20v1.1-87235-v1-1.zip?fid=1000257157&ttl=1535876168&ri=8192&rs=8192&setec=542b2cd086df150420b6d404c3e73b50"
    }
  ]
}