{
  "modId": 87329.0,
  "modName": "The Mystics Gift",
  "summary": "Unfurnished large player home for anyone wanting to try there hand decorating. The home is a single cell with no load doors.",
  "descriptionHtml": "The Mystics Gift is an unfurnished large player home for anyone wanting to try there hand decorating. I am still fairly new to the creation kit but am fairly happy with what I have created. The home is a single cell with no load doors. Your welcome to use it in any of your own mods or re-upload as your own decorated house.\r<br />\r<br />Two versions available for download. \r<br />\r<br />Version 1: No crafting stations and no nav mesh in the home. It is intended more as a resource. \r<br />Version 2: Added all essential crafting stations. Only craft area is nav meshed allowing a follower to enter the home and hang around craft area. Can be used as a player starter home.\r<br />\r<br />My tips on how to decorate the home with creation kit.\r<br />\r<br />Watch a creation kit simple player home video, Learn how to drag and drop furniture into the cell. \r<br />From 3:32 mins [url=https://www.youtube.com/watch?v=AuaaJfN5jac]https://www.youtube.com/watch?v=AuaaJfN5jac [/url]\r<br />\r<br />Watch a nav mesh video make sure you finalize nav mesh in your cell. You don&#39;t need to nav mesh the whole house at once. You can just extend what&#39;s there or do a room at a time as you decorate the home. [url=https://www.youtube.com/watch?v=5JGpfOLiLic]https://www.youtube.com/watch?v=5JGpfOLiLic\r<br />[/url]\r<br />Watch an Idle marker video. [url=https://www.youtube.com/watch?v=TO2N9ZuuGMA]https://www.youtube.com/watch?v=TO2N9ZuuGMA[/url]\r<br />To me NPC&#39;s seem to hunt out the idle marker&#39;s when there on the nav mesh. No idle markers NPC&#39;s just seem to stand around and not walk along the nav mesh paths. This effect seems dependant on the size of the area.\r<br />\r<br />\r<br />[size=3][u]Back Story\r<br />[/u][/size]\r<br />Note: There is no courier in the mod I don&#39;t know how to do the courier system in Creation Kit.\r<br />\r<br />A courier hands you a note which reads.\r<br />\r<br />You have us to thank for your escape from the chopping block and Helgen. For it was us who caused the dragon to attack. We are an ancient race long before warlocks, witches and mages. Our mystery has in fact, caused us to be know in times past as mystics. We are those who practiced the art and there magic in the shadows. What people might know as dragons rising. We know as there hidden rebellion that they inflict upon us ever few hundreds years when they think they can. Fools like the Grey Beards think they know what knowledge is. What they seek in knowledge, we seek gain and have always secretly aided those who we see potential in and who might be of benefit to us. We offer you a gift to help you on your way, as we see what others do not yet see. \r<br />\r<br />The Mystics.  \r<br />[size=3][u]\r<br />[/u][size=2]Later as you leave Whiterun to seek out the Grey Beards a courier hands you a note which reads.\r<br />\r<br />So finally the blind are starting to see that you might be a Dragon Born. We have always know such things but why should you believe us. Did you like our gift? Yet there are others who will tell you how wonderful you are. Give you titles with there words and then grant you permission to buy property with your own money, how kind of them. Tell me do you know what price those houses really sell for? Maybe you should choose a side, it&#39;s a simple choice - thous that will give you a gift or thous that will take your money. Maybe you think your housecarl is there because of all your good deeds. She is a spy ready to stab you in the back at a moments notice, all the while she will play the servant to you. There is but one thought in the back of her mind. If does not learn how to control you, she must try to kill you.\r<br />\r<br />The Mystics.   [/size][u]\r<br />\r<br />\r<br />Location\r<br />\r<br />[/u][size=2]Down[/size] [size=2]stream from Riverwood along the river bank just after first water fall.[/size][u]\r<br />[/u][/size]\r<br />[b][u]Compatibility\r<br />\r<br />[/u][/b]This should be compatible with all mods.\r<br />\r<br />[size=4][b][u][size=3]Installation[/size]\r<br />[/u][/b][/size]\r<br />Just drop the files in your data folder and enable the esp.\r<br />\r<br />[size=3][u][b]Requirements[/b][/u][/size]\r<br />\r<br />None - No DLC needed.\r<br />[b][u][size=3]\r<br />Version Changes\r<br />[/size][/u][/b][size=2]\r<br />v1.02\r<br />- moved door in outside world to make it more follower friendly.\r<br />- added second version for download.\r<br />- update back story.\r<br />\r<br />[/size][size=2][size=2]v1.01\r<br />- minor spelling correction.\r<br />[/size]         [/size][b][u][size=3]\r<br />Highly Recommend\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/49523/][size=2]Dynamic Auto Sorting System by [b]Sjogga[/b][/size][/url]\r<br />[/size][/u][/b][size=3][size=2]What is Auto Sorting?\r<br />You place all your loot in one container and it magically sorts them into designated containers.\r<br />\r<br />What is crafting Auto Retrieve:\r<br />When you activate a crafting station assigned to the system, you \r<br />automatically loot its corresponding chest. For example, activating an \r<br />Enchanting Table adds all soul gems to your inventory.[/size][/size][b][u][size=3]\r<br />[/size][/u][/b]",
  "categoryId": "67",
  "version": "1.01",
  "author": "Rendazz",
  "createdUnix": "1508022676",
  "updatedUnix": "1508544125",
  "containsAdultContent": false,
  "uploadedBy": "rendazz",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000257805",
      "name": "MysticsGiftv1.02.zip",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "MysticsGiftv1.02.zip-87329-1-02.zip",
      "uploadedUnix": "1508543748",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/980b71ae1cf33c688fe8a88d9fe236b592014e2b054c2def4d32a9e40b5b5e7f/analysis/1508543799/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MysticsGiftv1.02.zip-87329-1-02.zip?fid=1000257805&ttl=1535876269&ri=8192&rs=8192&setec=b44da0a32913ed6772f0865174201561"
    },
    {
      "fileId": "1000257809",
      "name": "MysticsGift_with_craft_area-v1.02.zip",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "MysticsGift_with_craft_area-v1.02.zip-87329-1-02.zip",
      "uploadedUnix": "1508544125",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/8aa1c0c3f6fbdde1a12a4b9dc176713aa4fcdd467475d663bbe94cc58e4af2f1/analysis/1508544482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/MysticsGift_with_craft_area-v1.02.zip-87329-1-02.zip?fid=1000257809&ttl=1535876269&ri=8192&rs=8192&setec=377546495d397026b9573342e3e61ce4"
    }
  ]
}