{
  "modId": 8733.0,
  "modName": "Sheogoraths Rabbit Hole - Cheat Room",
  "summary": "Creates a room where you can get all the items within the game and use crafting equipment.",
  "descriptionHtml": "[b][size=4]THIS MOD IS FOR THE BASE GAME ONLY, ANY DLCS WILL CRASH THE GAME&#33;[/size]\r<br />\r<br />This mod simply allows you to enter and exit &#39;cocsmoke&#39; through a door within Skyrim instead of having to use console commands.[/b]\r<br />\r<br />For those of you not familiar with &#39;cocsmoke&#39; its basically a testing area not accessible in the game but only by using console commands to get both in and out of the room, it holds every item available in the game as well as some test items which weren&#39;t, you can also use all of the crafting equipment in the game. This mod makes the room more friendly by adding a trapdoor to it right outside the cave where you exit from the tutorial and a ladder back into Skyrim. I added much more light to make it easier to navigate, made it companion friendly and added a throne so you can sit around in your underground cheat fortress&#33; There is also a map marker clearly marking the area if you are mid-game and don&#39;t remember where it is&#33;\r<br />\r<br />Please note: I am not responsible for the items found in the chests, some were taken out of the game so some may not be stable for use.\r<br />\r<br />[b]Version 1.1[/b]\r<br />The mod is now known as &#39;Sheogoraths Rabbit Hole&#39; i have added a clone of Shegorath with somebody elses voice because i couldn&#39;t get his to work, i added some of his bunnies around his throne which i can&#39;t seem to place where i want and some carpet for decoration&#33;",
  "categoryId": "40",
  "version": "1.1",
  "author": "GoodfellowGoodspring",
  "createdUnix": "1328894821",
  "updatedUnix": "1329105631",
  "containsAdultContent": false,
  "uploadedBy": "GoodfellowGoodspring",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30147",
      "name": "Sheogoraths Rabbit Hole",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "28",
      "fileName": "Sheogoraths Rabbit Hole-8733-1-1.zip",
      "uploadedUnix": "1329105631",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/02481a3ae76f3683762b045db55c28fdb6395d77ab4e6d4246929f708ef4ed7e/analysis/1406676014/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Sheogoraths%20Rabbit%20Hole-8733-1-1.zip?fid=30147&ttl=1535767738&ri=8192&rs=8192&setec=871821735036db6b22b17d2b0bed3f81"
    }
  ]
}