{
  "modId": 87396.0,
  "modName": "Bentchill - The Ultimate Boss",
  "summary": "Bentchill is a high-leveled boss which can be found in Blackreach.",
  "descriptionHtml": "Bentchill is a boss at level 1000 that can be found in Blackreach. As of currently Bentchill doesn&#39;t have any backstory, quests, or voice acting however I have a rough idea of his backstory and some quests which should be in the next version of this mod. If you&#39;d like to voice act Bentchill then feel free to send me a PM however be quick before the position gets taken. However even with my rough idea of Bentchill he is only 1 in 5 bosses that will be in a quest mod.\r<br />\r<br />If you want to help me create mods quicker, go check out my [url=https://www.youtube.com/channel/UCKRSTAVemC9Kwt-6QeGZw2g]YouTube Channel\r<br />\r<br />[/url]Edit: To be honest Bentchill and the other 4 bosses (names unknown as of now) are meant to be based off of Dark Souls bosses, with a twist. They have really high levels, high stats, good gear, and (in the future) scary models. However the twist is they all have voice acting relevant to quests around them and they have a really/ridiculously high speed stat. And I mainly created this mod because of one of my characters which can deal over 2 million damage in a single hit, and I wanted that character to have a challenge.",
  "categoryId": "33",
  "version": ".2",
  "author": "AUDelusional",
  "createdUnix": "1508391737",
  "updatedUnix": "1508391737",
  "containsAdultContent": false,
  "uploadedBy": "AUDelusional",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000257677",
      "name": "TheUltimateBoss",
      "version": ".2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "TheUltimateBoss-87396--2.rar",
      "uploadedUnix": "1508391712",
      "modVersion": ".2",
      "virusScanUrl": "https://www.virustotal.com/file/2420398000218a23f43311fe5090719a032ef5e887ffd11d83b96d6fc8a72004/analysis/1508391841/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TheUltimateBoss-87396--2.rar?fid=1000257677&ttl=1535876351&ri=8192&rs=8192&setec=0f3c6934ff199c4fb7f190fefa213f1f"
    }
  ]
}