{
  "modId": 8744.0,
  "modName": "Educated Horses",
  "summary": "Horses return to you after fleeing combat, stay put when told, carry your burdens and run longer.",
  "descriptionHtml": "I will try to keep this updated on the Nexus site but the most recent version will always be guaranteed available (as long as their servers are up) from the Steam Workshop at http://steamcommunity.com/sharedfiles/filedetails/?id=7862\r\n\r\n==========\r\n\r\nEducated Horses v1.1: Saddlebag Fix(?) and Repacked Files\r\n\r\nAuf Deutsch: http://skyrim.nexusmods.com/downloads/file.php?id=9908\r\n\r\nA growing overall horse improvement mod (formerly known as Horse Come Here).\r\n\r\nSpell Tomes for Horse Stay and Horse, Come are laying on a hay bale in the Whiterun stables. Ironically, the only horse that the saddlebag functionality seems to never work on is also the Whiterun horse.\r\n\r\nYou can access your horse\\'s saddlebags (inventory) by approaching the side of the horse, just like you\\'re actually walking up to the saddlebags on the horse, and pressing the Activate key. At any regular distance from your horse, you will mount up as usual when activating it. You can\\'t access real saddlebags from 20 feet away, you have to walk up to them. Same concept applies here. :)\r\n\r\nFEATURES:\r\n- Horses follow you.\r\n- Casting Horse Stay tells your horse to stay put. (Spell Tome found on a hay bale in Whiterun stables.)\r\n- Casting Horse, Come calls your horse back to your side. (Spell Tome found on a hay bale in Whiterun stables.)\r\n- Saddlebag functionality.\r\n- Horses do not affect stealth meter.\r\n- Horse HP is greatly increased (less chance of getting killed while fleeing)\r\n- Shadowmere is tagged essential.\r\n- Frost is tagged essential.\r\n- Horse stamina is greatly increased.\r\n- Horse speed is slightly increased.\r\n\r\nPLANNED FEATURES:\r\n- Instead of having to sneak while activating your horse to access the saddlebags, make it so that holding E (rather than a quick press) does this.\r\n\r\n==========\r\n\r\nChanges\r\n\r\nEducated Horses\r\nv1.1\r\n- Saddlebags SHOULD be functioning properly now and without the sneak requirement.\r\n-- This seems to not affect the horse bought from the Whiterun stables. Please let me know if you experience this from any other horses after this update.\r\n-- HUGE thanks to Princess Bridget for helping me figure out what was borked here.\r\n\r\nv1.0.3\r\n- Tweaked saddlebag functionality.\r\n-- Distance-dependent saddlebag access.\r\n-- Activating the horse at a distance roughly equal to where you stand when you dismount will get you to mount up.\r\n-- Activating your horse closer than this will open your saddlebags.\r\n\r\nv1.0.2\r\n- Tweaked an issue with delay between combat initiation and horses fleeing.\r\n\r\nv1.0.1\r\n- Horses should no longer affect your stealth meter.\r\n- Horse speed has been increased 15%\r\n- Horse stamina has been reduced to ~25% of what I had changed it to before, for balance purposes.\r\n\r\n1.0a\r\n- Fixed a small issue with the Horse Stay and Horse, Come spell tomes.\r\n\r\n1.0 - Complete Feature List\r\n- Your last active horse will follow you.*\r\n- Casting Horse Stay pauses the follow routine.**\r\n- Casting Horse, Come resumes the follow routine.**\r\n- Activate your horse while sneaking for \\\"saddlebag\\\" mode. (Inventory share.)***\r\n- Most horses will now flee from combat ASAP.\r\n- Most horses have received a large increase in HP to reduce their chances of being killed when first fleeing from combat.\r\n- Shadowmere has been tagged essential.\r\n- Frost has been tagged essential.\r\n- Most horses have greatly increased stamina. (Longer sprint times.)\r\n\r\n* = You must mount the horse at least once before follow mode will trigger.\r\n** = You can acquire the Spell Tomes to teach you these spells from the hay bale in the Whiterun Stables.\r\n*** = You may have to fast travel somewhere to enable the \\\"saddlebag\\\" functionality on your currently-active, currently-present horse. This SHOULD only be required once, if at all.\r\n\r\n----------\r\n\r\nHorse Come Here (previous mod title)\r\n1.2b\r\nTweaked with the Horse Stay effect to battle your horse showing up unexpectedly.\r\n\r\n1.2a\r\nPlaced horse spell tomes on the ground in the Whiterun stables.\r\nTweaked AI Packages to increase the horse\\'s likelihood to flee asap rather than after the next package evaluation.\r\n\r\n1.2\r\nAt last, \\\"Horse Stay\\\" and \\\"Horse, Come\\\" spell tomes are now available for purchase from Belethor\\'s General Goods. (Thanks to TheFadedMist for pointing out this obviously simple solution.)\r\n\r\n1.1a\r\nAll horses should now always flee from all combat and return to you afterward.\r\n\r\n1.1\r\nAdded Lesser Power \\\"Horse Stay\\\"\r\n-- Applies a 5-day game time magic effect that tells the horse not to follow you.\r\nAdded Lesser Power \\\"Horse, Come\\\"\r\n-- Applies a 1-second magic effect to cancel the remainder of the duration of Horse Stay\r\n\r\n1.0\r\nHorses will follow the player after an initial mount-up.",
  "categoryId": "83",
  "version": "1.1",
  "author": "Daddy Kro",
  "createdUnix": "1328899072",
  "updatedUnix": "1329132740",
  "containsAdultContent": false,
  "uploadedBy": "daddykro",
  "primaryFile": null,
  "files": [
    {
      "fileId": "30291",
      "name": "Educated Horses vOneOne",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14",
      "fileName": "Educated Horses vOneOne-8744-1-1.zip",
      "uploadedUnix": "1329132740",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c9862786122801fadb8262ea985af5ff208f71bc2c2c7f028378d8476cc50911/analysis/1406676618/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Educated%20Horses%20vOneOne-8744-1-1.zip?fid=30291&ttl=1535767756&ri=8192&rs=8192&setec=d5799ed4986522e0477b66681efc93f0"
    }
  ]
}