{
  "modId": 87466.0,
  "modName": "Hammet's Dungeon Packs for LE - Russian translation",
  "summary": "Мод добавляет на территорию Скайрима и Солстхейма 24 новых мрачных и атмосферных подземелья для исследования, населенных различными разноуровневыми противниками.",
  "descriptionHtml": "[size=2][b]Автор: venjhammet[/b]\n<br />[b]Версия: 1.85[/b]\n<br />[b]Язык: русский\n<br />Перевод: crafty77[/b]\n<br />\n<br />[b]От автора:[/b]\n<br />Мой мод не является идеальным, в нем встречаются небольшие ошибки, но я делаю все возможное для их устранения. Если у вас есть какие-либо предложения или вопросы, пожалуйста, дайте мне знать, и давайте будем более уважительными друг к другу в вопросах критики.\n<br />Я надеюсь, что вы и будете наслаждаться, исследуя эти подземелья, как я наслаждался, когда создавал их, черпая вдохновение из других игр на протяжении многих часов работы.\n<br />\n<br />[b]Описание:[/b]\n<br />Мод добавляет на территорию Скайрима и Солстхейма 24 новых мрачных и атмосферных подземелья для исследования, населенных различными разноуровневыми противниками.\n<br /> \n<br />[b]Подробнее:[/b]\n<br />Вас ждут 24 радиант квеста по исследованию новых подземелий на территории Скайрима и Солстхейма. Вам предстоит погрузиться в мрачную атмосферу и увидеть величественные подземные залы и полузатопленные катакомбы, посетить древние двемерские руины и нордские захоронения, воспользовавшись магическим порталом, отправиться в отдаленную локацию Воминдок и узреть величественный храм Вулдура - единственного, оставшегося в живых драконьего жреца. На вашем пути вы повстречаете многочисленных и разно уровневых врагов, многие из которых имеют собственные имена, небольшие истории их прежней жизни и владеют мощными артефактами. Заклиная Новые, зачарования для брони и оружия, скомпилированные автором из ванильных активов. Различные записки, дневники и книги, проливающие свет на цель исследований и дающие подсказки по поиску артефактов, прохождению локаций, прочитав которые вы сможете узнать сильные и слабые стороны ваших врагов. \n<br />\n<br />[b]Подробнее о локациях:\n<br />[/b]\n<br />[b]Анчазгар[/b] \n<br />Древние двемерские развалины к северо - востоку от Верховьев Хастарда на Солстхейме. \n<br />Враги: разбойники - мародеры и их предводитель Угольф Крушитель черепов, различные двемерские механизмы.\n<br />Наградой вам будет Реликвия Анчазгара и новое заклинание.\n<br />\n<br />[b]Крипта Ужаса [/b]\n<br />Расположена на Солстхейме, юго - западнее Кургана Белого Хребта. Вы столкнетесь с опасностями, поджидающими кладоискателей и искателей приключений в нордских руинах, и древним злом, дремлющим в глубоких подземельях.\n<br />Враги: вампиры и их трэллы, клыкастые пауки и горгульи, Линкгра и Жнецы душ.\n<br />В награду вы получите меч \"Пожиратель\" Лорда Бэхлиэля.\n<br />\n<br />[b]Башня Реогура[/b] \n<br />Локация на восточном берегу Солстхейма, северо - восточней Пепельной крепости, в которой покоится Лорд Реогур - законный сын и наследник Лорда Хэммета, (рекомендую начать исследование подземелий именно с этой локации). Именно тут покоится древняя тайна о реликвиях Лорда Хэммета. Тут вы можете встретить темного эльфа - ассасина по имени Вендж, который может стать незаменимым помощником в поиске утраченных реликвий, или найти его в Вороньей Скале. \n<br />Враги: драугры, Лорд Реогур.\n<br />Наградой вам станут подсказка по поиску реликвий Лорда Хэммета, лук \"Иней\" меч и \"Парализатор\" Лорда Реогура.\n<br />\n<br />[b]Заброшенная крипта[/b]\n<br />Расположена восточнее Сумеречной гробницы. Достаточно ли вы храбры, чтобы исследовать это подземелье? Не надейтесь на помощь Богов, лишь свет поможет вам разогнать кромешную тьму и пройти этот путь. \n<br />Враги: драугры, скелеты, пауки, Кригонукс, Иванея Осквернитель.\n<br />Расстаться с жизнью можно на любом уровне.\n<br />\n<br />[b]Крипта Серебряный огонь[/b]\n<br />Расположена северо - восточнее Айварстеда. Завладейте оружием, покоящимся в нордских захоронениях!\n<br />Враги: драугры, Стражи гробницы, Норок и Драконий жрец Краднок.\n<br />Награда - Серебряный меч огня и Посох Краднока.\n<br />\n<br />[b]Гробница Вэйсика Иссушителя[/b]\n<br />Находится юго-западнее Причала Ледяных Вод. Противопоставьте свой ум и хитрость силе Драконьего Жреца.\n<br />Враги: драугры, Порченые тени, павшие соратники Лорда Хэммета и др.\n<br />Наградой вам будет одна из утраченных реликвий.\n<br />\n<br />[b]Сонаак - Храм Жрецов близнецов[/b]\n<br />Расположен северо - западнее Хребта Острие Ножа. Сонаак в переводе с драконьего означает жрец. Победите Драконьих жрецов близнецов и получите их силу.\n<br />Враги: драугры, пауки, Драконьи жрецы.\n<br />\n<br />[b]Лощина Морозного мрака[/b]\n<br />Расположена южнее Сигнальной башни Стендарра. В ней находится тайный проход к гробнице могучего воина. Приготовьтесь к смерти, решив нарушить его покой.\n<br />Враги: тролли, некромаги, драугры, колдуны, гигантские рыбы - убийцы, хранители гробницы.\n<br />Награда - Кливер Авулдмира.\n<br />\n<br />[b]Крипта Ингульфрид[/b]\n<br />Расположена восточнее форта Кровавый трон. Темная и таинственная пещера в недрах которой, в своем склепе, на протяжении веков, заперта древняя могущественная королева, поклявшаяся уничтожить весь Тамриэль. Только очень смелый и сильный воин способен узнать тайны этой крипты и остаться в живых.\n<br />Враги: драугры, Лорды Хаоса.\n<br />\n<br />[b]Пещера Ужаса[/b]\n<br />Расположена к западу от Валтума. Могущественные артефакты сокрыты в глубинах этой пещеры. Приготовьтесь столкнуться с ужасом, царящим в ней.\n<br />Враги: вампиры, некроманты, драугры, проклятые костяные и др.\n<br />В награду вы можете получить Клинок \"Ужасный\" и одну из утраченных реликвий.\n<br />\n<br />[b]Белая холодная пещера[/b]\n<br />Расположена северо - восточнее от Пещеры Толвальда. Шайка мародеров пытается найти проход к древней гробнице и завладеть древним артефактом. Опередите их и станьте его обладателем.\n<br />Враги: мародеры, бандиты, головорезы, драугры.\n<br />Награда: Клемор Хокмира.\n<br />\n<br />[b]Мерзкий Зеленый грот[/b]\n<br />Таинственная пещера, расположенная к югу от Фолкрита - владение Призрачного короля Мелхоса. Одолейте его верных слуг и добудьте артефакт древней.\n<br />Враги: блеклые призраки, темные призраки, Призрачный король Мелхос.\n<br />Наградой вам будет древний артефакт Мелхоса.\n<br />\n<br />[b]Тихая завеса[/b]\n<br />Это нордские руины, расположенные к юго-востоку от Форта Нойград, поговаривают, что внутри них находится древняя гробница, хранящая в себе артефакт великой силы, некогда принадлежавший Лорду Вальдгару. \n<br />Враги: драугры, пауки, хранители Тихой завесы.\n<br />Награда: артефакт Лорда Вальдгара, одна из утраченных реликвий.\n<br />\n<br />[b]Убежище Падающей Тьмы[/b]\n<br />Под полуразрушенной башней, расположенной западнее Желчной шахты, члены Культа Червя обнаружили древнее захоронение могущественного некроманта и пытаются найти способ проникнуть внутрь, чтобы завладеть посохом неимоверной силы... и это лишь вопрос времени... Остановите их пока не поздно...\n<br />Враги: нежить, члены Культа Червя.\n<br />Награда: Наузул Посох.\n<br />\n<br />[b]Пещера Холодного страха[/b]\n<br />По рассказам, глубоко в лабиринтах этой пещеры, расположенной южнее Аванчензел находится магический портал, способный перенести Вас в Воминдок - последнее убежище членов Культа Драконов. Вас ждет длительное и опасное приключение. Возьмите с собой Излу Титанорождённую, она может быть весьма полезна в этом путешествии. Вы сможете ее отыскать в Таверне \"Верески\", в Морфале.\n<br />Враги: тролли, драугры, колдуны и некромаги, павшие хранители, пауки, порченые тени, драконы, ведьмы и пр.\n<br />\n<br />[b]Холодный рудник[/b]\n<br />Небольшая пещера, расположенная в горах севернее Маркарта.\n<br />Враги: различные.\n<br />\n<br />[b]Приют Сикгара \n<br />[/b]В небольшой крипте, расположенной западнее Деревни Скаалов , бандиты ищут древний меч, обладающий большой силой. Опередите их мечем этим и завладейте.\n<br />\n<br />[b]Руины Мрачная тень[/b]\n<br />Группа охотников за сокровищами отправилась на раскопки в руины на северо-востоке от Хижины Фроки, с тех пор о их судьбе ничего не известно. Вам предстоит выяснить \n<br />судьбу искателей приключений и узнать, какое они разбудили древнее зло.\n<br />Враги: мрачные тени, спригганы.\n<br />Награда: комплект Даэдрической брони Мрачной тени и Даэдрический двуручный меч мрачной тени.\n<br />\n<br />[b]Крипта Костяной мглы[/b]\n<br />Древние руины, расположенные севернее Вороньей Скалы.\n<br />Награда: Подвеска Джутнара.\n<br />\n<br />[b]Фахл Мзунд[/b]\n<br />Двемерские руины, расположенные к юго-востоку от Данстара.\n<br />Враги: Двемерские механизмы.\n<br />Награда: довольно мощное оружие.\n<br />\n<br />[b]Курган Гирхолл[/b]\n<br />Гробница древнего нордского воина, расположенная южнее Морфалла.\n<br />Награда: Боевой молот древнего нордского воина.\n<br />\n<br />[b]Темная пещера[/b]\n<br />Древние, темные руины, расположенные юго-западнее Хелгена, хранящие в своих недрах реликвию великой силы.\n<br />Многие искатели приключений рискнули пробраться внутрь... но живым, никто из них не вернулся. \n<br />\n<br />[b]Убежище Проломленный череп[/b]\n<br />Небольшая пещера к северо - востоку от Рифтена, в которой обосновалась шайка бандитов.  \n<br />\n<br />[b]Туманный клык[/b]\n<br />Пещера, расположенная северо-восточнее Маркарта, хранящая в своих недрах сокровища, которые доступны лишь отчаянным \n<br />искателям приключений.   \n<br />[b]\n<br />Требования:[/b] \n<br />Skyrim LE - 1.9.32.08\n<br />Оригинал мода Hammet's Dungeon Packs for LE\n<br />\n<br />[b]Совместимость:[/b]\n<br />При создании мода, автор использовал только ванильные активы игры, поэтому он совместим с большинством модов и будет использовать все реплейсеры и текстуры, установленные в Вашей игре.\n<br />   \n<br />[b]Благодарности:[/b]\n<br />[url=https://forums.nexusmods.com/index.php?showuser=3591326]venjhammet[/url] за создание этого замечательного и интересного мода.\n<br />\n<br />[b]Установка:[/b]\n<br />Можно через нмм по по / МО менеджеры или вручную. Для этого нужно:\n<br />1. Скачать основные файлы на странице мода, в разделе \"[url=https://www.nexusmods.com/skyrim/mods/86630/?tab=2&amp;navtag=https%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D86630&amp;pUp=1]Основные файлы[/url]\", \n<br />и установить с помощью мод менеджеров или вручную;\n<br />\n<br />2. Скачать переведённый .ЕСП файл мода на странице перевода, в разделе \n<br />\"Основные файлы\", и поместить в папку с данными вашей игры, согласиться \n<br />на замену файла. Активировать файл в лаунчере игры.\n<br />\n<br />[b]Удаление:[/b]\n<br />1. Удалите установленные файлы из папки данных.\n<br />\n<br />[b]Разрешения:[/b]\n<br />Как и оригинал мода, данный перевод эксклюзивен для сайта nexusmods и его распространение на других ресурсах запрещено.\n<br />\n<br />[b]Изменения:[/b]\n<br />[b]Обновление 1.85[/b]\n<br />- исправлены цепные активаторы двери в святилище Заброшенной крипты.\n<br />\n<br />Обновление 1.84\n<br />- перемещен вход в Крипту Ингульфрид (восточнее форта Кровавый трон) из-за конфликта с модом Forfeoranna Heim.\n<br />\n<br />Обновление 1.83\n<br />- перемещен вход в Холодный рудник из-за конфликта с модом Jurgholm;\n<br />- добавлена новая локация Туманный клык.\n<br />\n<br />Обновление 1.82\n<br />- перемещен вход в Заброшенную крипту, ввиду конфликта с модом Interesting NPC;\n<br />- исправлена ловушка в локации Темная пещера;\n<br />- незначительные дополнения и улучшения по некоторым локациям;\n<br />- отредактированы navmesh перед входом во все подземелья.\n<br />\n<br />Обновление 1.81\n<br />- добавлена новая локация Убежище Проломленный череп;\n<br />- уровневые списки и статы вражин кроме нескольких боссов приведены к ванили, для совместимости с модами, изменяющими их;\n<br />- в Крипте Серебрянный огонь, Гробнице Вэйсика и в Храме Жрецов близнецов исправлены ловушки (при обновлении с предыдущей версии, не забудьте покинуть данную локацию.);\n<br />- в Гробнице Вэйсика отредактирован проход к драконьему когтю;\n<br />- немного увеличены статы \"наград\" за прохождение Темной пещеры и Холодного рудника.\n<br />\n<br />Обновление 1.80\n<br />- добавлена новая локация Темная пещера;\n<br />- автор удалил в названиях локаций \"звездочки\", посчитав, что они портят впечатление погружения в игру;\n<br />- произведена реконструкция локации Холодный рудник (при обновлении с предыдущей версии, не забудьте покинуть данную локацию.)\n<br />\n<br />Обновление 1.70\n<br />- добавлена новая локация Курган Гирхолл;\n<br />- в названия локаций мода, префиксом добавлена \"звездочка\", дабы сделать их отличными от других;\n<br />- теперь все подземелья требуют уровень для оптимального прохождения 40 и выше.\n<br />\n<br />Обновление 1.60\n<br />Добавлены две новых локации: Фахл Мзунд и Крипта Костяной мглы.\n<br />\n<br />Обновление 1.50\n<br />Исправления в Лощине Морозного мрака:\n<br />- исправлена ловушка с отравленным дротиком, который стрелял бесконечно;\n<br />- исправлен активатор ворот на пьедестале с книгой, добавлен активатор с обратной стороны ворот;\n<br />- добавлена лестница-проход с правой стороны;\n<br />- на 75% уменьшено здоровье гигантских рыб-убийц;\n<br />- добавлены противники и оружие. \n<br />Анчазгар, Руины Мрачная тень и Крипта - уменьшены статы противников, оружия и брони.\n<br />При обновлении с предыдущей версии, не забудьте покинуть данные локации.\n<br />\n<br />Обновление 1.40\n<br />Исправлен активатор в Лощине Морозного мрака (было трудно активировать);\n<br />Исправлены некоторые угли и свечи в Лощине Морозного мрака;\n<br />Небольшие дополнения в локации Приют Сикгара;\n<br />Небольшие дополнения в локации Анчазгар; \n<br />Откорректированы зачарования наложенные на Даэдрической броне Мрачной тени;\n<br />При обновлении с предыдущей версии, не забудьте покинуть данные локации.\n<br />\n<br />Обновление 1.30\n<br />Добавлена новая локация Руины Мрачная тень.\n<br />Обновление 1.20\n<br />Расширена локация Приют Сикгара (добавлены новые ячейки). При обновлении с предыдущей версии, не забудьте покинуть данную локацию.\n<br />\n<br />[b]Если Вам понравился мод, поблагодарите автора, нажав клавишу \"одобрить\" через 15 минут после скачивания с Нексуса.\n<br />Приятной Вам игры![/b][/size]",
  "categoryId": "88",
  "version": "1.85",
  "author": "crafty77",
  "createdUnix": "1508715727",
  "updatedUnix": "1533033102",
  "containsAdultContent": false,
  "uploadedBy": "crafty77",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000260080",
      "name": "Hammet&#39;s Dungeon Packs for LE - Russian translation corrected",
      "version": "1.30",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2756",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation corrected-87466-1-30.7z",
      "uploadedUnix": "1511125777",
      "modVersion": "1.30",
      "virusScanUrl": "https://www.virustotal.com/file/0624bfc05b0f623019896432193329dc70340d8c5d82bf0784be649ebf1c2925/analysis/1511126051/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation%20corrected-87466-1-30.7z?fid=1000260080&ttl=1535876410&ri=8192&rs=8192&setec=4a8f45bac7d7d77d74c927245caa941f"
    },
    {
      "fileId": "1000262111",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-40",
      "version": "1.40",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2775",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-40-87466-1-40.7z",
      "uploadedUnix": "1513462775",
      "modVersion": "1.40",
      "virusScanUrl": "https://www.virustotal.com/file/de51f3d9de7a39329842dd95e42d508f44b1b45098e4a43dc9b4ef4cd6b1a8e7/analysis/1513462811/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-40-87466-1-40.7z?fid=1000262111&ttl=1535876410&ri=8192&rs=8192&setec=7af8eab3c0f77e8550b2124788de765b"
    },
    {
      "fileId": "1000262570",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-50",
      "version": "1.50",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2795",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-50-87466-1-50.7z",
      "uploadedUnix": "1514101624",
      "modVersion": "1.50",
      "virusScanUrl": "https://www.virustotal.com/file/6d51afd7a25e1912914dc4baf64138896e8bc490ea006e39636abd07f8e91bf6/analysis/1514101691/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-50-87466-1-50.7z?fid=1000262570&ttl=1535876410&ri=8192&rs=8192&setec=543b679ba53ae5a036530066cdb6d9ea"
    },
    {
      "fileId": "1000268457",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-60",
      "version": "1.60",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3072",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-60-87466-1-60.7z",
      "uploadedUnix": "1521018040",
      "modVersion": "1.60",
      "virusScanUrl": "https://www.virustotal.com/file/1fed43be45b6741a3feba9523baf40d9a67cf6be7e68e3469bb134c78b83e5bc/analysis/1521018314/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-60-87466-1-60.7z?fid=1000268457&ttl=1535876411&ri=8192&rs=8192&setec=5811058cdbfbbdc7a1a2eecbd4a9666a"
    },
    {
      "fileId": "1000269710",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-70",
      "version": "1.70",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3180",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-70-87466-1-70.7z",
      "uploadedUnix": "1522511595",
      "modVersion": "1.70",
      "virusScanUrl": "https://www.virustotal.com/file/30f7eead703bb4ea18bc1674d181c8578290839d1c3201966c69afffb1c48843/analysis/1522511714/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-70-87466-1-70.7z?fid=1000269710&ttl=1535876411&ri=8192&rs=8192&setec=3a2605a10ec3d0b1f9a1a2fbf85acdce"
    },
    {
      "fileId": "1000270106",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-80",
      "version": "1.80",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3235",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-80-87466-1-80.7z",
      "uploadedUnix": "1523015435",
      "modVersion": "1.80",
      "virusScanUrl": "https://www.virustotal.com/file/ecd042fb7959671248850c74014d2b703002ed9c0e032fa77cd30704f55e906a/analysis/1523015595/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-80-87466-1-80.7z?fid=1000270106&ttl=1535876412&ri=8192&rs=8192&setec=900d1ce79c4557fff8d406d4553e8afa"
    },
    {
      "fileId": "1000270383",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-81",
      "version": "1.81",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3288",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-81-87466-1-81.7z",
      "uploadedUnix": "1523301246",
      "modVersion": "1.81",
      "virusScanUrl": "https://www.virustotal.com/file/1ca288a6e24127317422ed068b91c5f7de9a4f671ef405979815e288e42f0f96/analysis/1523301435/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-81-87466-1-81.7z?fid=1000270383&ttl=1535876412&ri=8192&rs=8192&setec=21281bb3c1dcda6ad8b053c22aa8f929"
    },
    {
      "fileId": "1000270384",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-70",
      "version": "1.70",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3180",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-70-87466-1-70.7z",
      "uploadedUnix": "1523301825",
      "modVersion": "1.70",
      "virusScanUrl": "https://www.virustotal.com/file/30f7eead703bb4ea18bc1674d181c8578290839d1c3201966c69afffb1c48843/analysis/1523301853/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-70-87466-1-70.7z?fid=1000270384&ttl=1535876412&ri=8192&rs=8192&setec=2501a29aa321a6ea303facc4ca532959"
    },
    {
      "fileId": "1000270385",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-60",
      "version": "1.60",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "3072",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-60-87466-1-60.7z",
      "uploadedUnix": "1523302224",
      "modVersion": "1.60",
      "virusScanUrl": "https://www.virustotal.com/file/1fed43be45b6741a3feba9523baf40d9a67cf6be7e68e3469bb134c78b83e5bc/analysis/1523302273/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-60-87466-1-60.7z?fid=1000270385&ttl=1535876413&ri=8192&rs=8192&setec=8f9d969838bb2676208d73091bb269f9"
    },
    {
      "fileId": "1000270564",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-82",
      "version": "1.82",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "2981",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-82-87466-1-82.7z",
      "uploadedUnix": "1523552556",
      "modVersion": "1.82",
      "virusScanUrl": "https://www.virustotal.com/file/5e5accbb78251b767fa1460b09392e0753205bcc0d6b5a5288e0b4266f103d11/analysis/1523552659/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-82-87466-1-82.7z?fid=1000270564&ttl=1535876413&ri=8192&rs=8192&setec=acabfef8a80d78d24f4c04b8d98362cb"
    },
    {
      "fileId": "1000271340",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-83",
      "version": "1.83",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3042",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-83-87466-1-83.7z",
      "uploadedUnix": "1524480867",
      "modVersion": "1.83",
      "virusScanUrl": "https://www.virustotal.com/file/8150ea880c81e1dd8452cb721832b242827e3a8ca1fcdfbdc33acf9c5cdb544b/analysis/1524480973/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-83-87466-1-83.7z?fid=1000271340&ttl=1535876414&ri=8192&rs=8192&setec=09e35e334840027a08485c2e1c8e0094"
    },
    {
      "fileId": "1000274614",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-84",
      "version": "1.84",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "3036",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-84-87466-1-84.7z",
      "uploadedUnix": "1528261914",
      "modVersion": "1.84",
      "virusScanUrl": "https://www.virustotal.com/file/977a42532fe036cd55d2fa95d1440b523e9b2ea41f3e5338945ffe498b574741/analysis/1528262052/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-84-87466-1-84.7z?fid=1000274614&ttl=1535876414&ri=8192&rs=8192&setec=a7b4aeae40a8f2f61ae2b96db16fbc87"
    },
    {
      "fileId": "1000278578",
      "name": "Hammet's Dungeon Packs for LE - Russian translation-1-85",
      "version": "1.85",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3036",
      "fileName": "Hammet's Dungeon Packs for LE - Russian translation-1-85-87466-1-85.7z",
      "uploadedUnix": "1533033102",
      "modVersion": "1.85",
      "virusScanUrl": "https://www.virustotal.com/file/b061339fa4b419982b66e7aa833086af15f32af32b98ea50bd9d544dceb996d4/analysis/1533033253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hammet%27s%20Dungeon%20Packs%20for%20LE%20-%20Russian%20translation-1-85-87466-1-85.7z?fid=1000278578&ttl=1535876415&ri=8192&rs=8192&setec=04a64682887c409bde0f66376ff99d5a"
    }
  ]
}