{
  "modId": 87461.0,
  "modName": "Ava - The Altmer Nord Preset",
  "summary": "This Beauty is a Mix of High Elven and Nordic blood.",
  "descriptionHtml": "[size=6][b]|Creation|[/b]\r<br />[/size]This Beauty is a Mix of High Elven and Nordic blood. Originally, She was mixed between Altmer and Imperial, but I started getting attacked by Guards every time I entered Windhelm, because her race was set to Imperial even though there was no progress on the Civil War Questline.|Description|\r<br />\r<br />There are may attributes which qualify her as an Alter mix, however, to obtain the proper skin tone and abilities, her base race is human with RaceMenu tweaks. Originally, I wanted her to be an Imperial due to the &#39;Imperial Luck&#39; boon, but that gave problems with Stormcloak compatibility. So, I switched to Nord.Her eye shape is slightly Elven, and her eyes are tilted inwards. Her facial structure has a strong V-shape and strong high cheekbones like the Altmer, as well well as half way pointed ears though not as long as an elf&#39;s.\r<br />\r<br />[size=6][b]|Installation|[/b]\r<br />[/size]This is a preset created and saved within RaceMenu. So you will need RaceMenu as well as a few other mods like SKSE to get the exact appearance shown in the pictures. You are free to change the features to your liking, but please don&#39;t take credit for my work. As many of you no doubt know, it is very hard and takes a long time to edit extensively in RaceMenu, as well to sculpt out the imperfections. Thank you.To begin installation, make sure you extract the archive to the Presets folder.Then, in-game, type &#34;showracemenu&#34; in console, without quotes of course. and click the presets tab in RaceMenu, and click the option at the bottom of the screen called &#39;Load Preset&#39; and select the preset. Make sure you have the race you want chosen before you select the preset, as the race change resets all physical features back to that race&#39;s vanilla preset #1. Also, I have only tested it on a few races thus far. You are welcome to change it to any race you want, but it&#39;s up to you to fix anything you don&#39;t like with how the RaceMenu applies the preset to that race. It is also more than likely that is won&#39;t work for the beast races, although it may work for Orcs, and some Custom Races. Although, again I stress the point that you are welcome to try any race but do not ask for help if it is not one of the supported races. Also, it is up to you to tweak the Elven and Beast races to your liking should you choose to use this preset with one of those races.\r<br />[b]This may also work in SSE and other games that use RaceMenu but it hasn&#39;t been tested. [/b]\r<br />\r<br />[size=6][b]|Supported Races|[/b]\r<br />[/size][size=4]Nord\r<br />Imperial\r<br />Breton\r<br />Redguard\r<br />High Elf [/size]( Although it makes the face shape a sharper V and some facial markings with longer, more pointed ears)\r<br />[size=4]Dark Elf [/size]( Although it makes the face shape a sharper V and some facial markings with longer, more pointed ears)\r<br />[size=4]Wood Elf [/size]( Although it makes the face shape a sharper V and some facial markings with longer, more pointed ears)\r<br />[size=4]Orc [/size][size=2](The Orc teeth are very visible, the eyes are green and the ears are longer and more pointed)[/size]",
  "categoryId": "114",
  "version": "1.0",
  "author": "Landon783",
  "createdUnix": "1508692752",
  "updatedUnix": "1508692752",
  "containsAdultContent": false,
  "uploadedBy": "Landon783",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000257943",
      "name": "RaceMenu Preset",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "RaceMenu Preset-87461-1-0.rar",
      "uploadedUnix": "1508691258",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a44d06e594838544ec62a44b9ce0163ec3acde64c330543e2a9e74eb246b4b33/analysis/1508691483/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/RaceMenu%20Preset-87461-1-0.rar?fid=1000257943&ttl=1535876403&ri=8192&rs=8192&setec=ea201fce3470194e4ae213ce8f482f83"
    },
    {
      "fileId": "1000257944",
      "name": "Load Order text file",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Load Order text file-87461-1-0.rar",
      "uploadedUnix": "1508691527",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/6259d12b3bae03ca44b1752b2d0b0cccec57a2736208df5046e66100ef4aedb2/analysis/1508691721/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Load%20Order%20text%20file-87461-1-0.rar?fid=1000257944&ttl=1535876404&ri=8192&rs=8192&setec=08b2607c5dda3f48a3197121a84fa516"
    }
  ]
}