{
  "modId": 87472.0,
  "modName": "Kotor save games (Android) pack",
  "summary": "Save files for Android users or PC(should work) \r<br />Helps you pass crashes, Taris or just to cheat. \r<br />Play as a Selkath in one file (save editor product) \r<br />May be glitchy or missing certain textures(due to mods)",
  "descriptionHtml": "Was looking for Kotor save files but could not find any for PC nor Android. I&#39;ve decided to upload some since no one else is capable of it for whatever reason. Be advised this does contain mods. Mods were downloaded here and so I recommend making sure you check if you have these mods or understand that certain items may appear as black squares or certain characters will be missing heads.(unless you make sure you have most mods that I have) -Canon Revan face with scars , it&#39;s one of the top mods here at Nexus and I have this installed, in no ways do I claim ownership but letting you know that &#34;Evan&#34; Save file has this face and of the mod is missing Evan will not have a head. -movie style Jedi robes (not exactly necessary ) -female Jedi robes revamped(not exactly necessary) -kotor restored content mod-all new malak (black and silver)-save mission mod -many other texture mods that shouldn&#39;t effect the game. \r<br />With these save files I believe most people can use them without mods but please be advised that some characters may be missing a head (it should only be Evan ) On one game you will be a Selkath , this was done with the Kotor save game editor and so should not require mods to work. Republic Uniforms mod may leave a black item in inventory that is unusable but sellable. If you can&#39;t get past the endar spire or somewhere else or don&#39;t have access to a PC you can try to download these. My main purpose is that there is simply no Android saves yet, and I&#39;m thinking these work on the PC as well but not 100% sure. If there is more issues I can always upload my specific Appearance.2da file and whatever files involve the issue you are having. In no way do I take credit for the mods used , they are simply in my game and may effect the save file slightly (containers with nothing in them) I did use these on a clean copy of Kotor to see what changed, and they do work. (Evan missing head)\r<br />Still learning to mod but hope to soon make large projects. (This is not a mod) this is to help people that have crashes or want to skip Taris or whatever but are unable to use a PC.",
  "categoryId": "43",
  "version": "1.0",
  "author": "DarthNorah",
  "createdUnix": "1508739657",
  "updatedUnix": "1508739657",
  "containsAdultContent": false,
  "uploadedBy": "DarthNorah",
  "primaryFile": null,
  "files": []
}