{
  "modId": 8751.0,
  "modName": "Northern Frost Brewery",
  "summary": "Start your own brewery!",
  "descriptionHtml": "Star-NorthernFrostBrewery\r\nBy: Star-Demon\r\n==============================\r\nCurrent Version: 0.5 \r\n==============================\r\n\r\n///Installation:///\r\nUnpack to /Data\r\n\r\n///Basic:///\r\n\r\nStart up your own brewery! Once you discover the abandoned Brewery, Look for an enterprising Dark Elf in Riften to help you get started.\r\n\r\nIn the northeast part of Skyrim there\\'s an abandoned brewery! Fix it up, get it running, and enjoy! Be careful, there\\'s lot of work to do, and plenty of competition!\r\n\r\nDEBUG: \r\nJust head up the stairs of the abandoned brewhouse to skip the entire quest and enjoy the brewery. \r\n\r\nPlanned: \r\n- Full questline, including gathering, hiring, and creating and running your own brewery.\r\n- 4 NPCs to interact with and get to know.\r\n- Some books and interesting items. (Dagger that explodes money!)\r\n\r\nWhat is currently done: \r\n- Quest beginning is coming together!\r\n- ALL Main NPCs have schedules and general AI.\r\n- Most items I\\'ll need are finished - I would LOVE new meshes of the drinks so the mod stands out. \r\n- Debug items and Messages exist in some places. Sorry if they intrude.\r\n- Dialogue!\r\n\r\n\r\nCurrent Problems: \r\n- I\\'m having trouble with the NavMesh in the Exterior Cell (31,18). \r\n- NPCs need testing. Skyrim is a chaotic place - anything can happen! Tell me stories!\r\n\r\n\r\nRequires:\r\nNothing!\r\n\r\nCompatibility:\r\nYes: Vanilla\r\nNo: This mod modifies terrain in (31,18) so the Brewery and Shack can be there.\r\n\r\n\r\n//Version History///\r\n\r\n0.5: \r\n\t- Added more possible patron NPCs and tweaked each one.\r\n\t- Added some more things into the main building and shack.\r\n\t- Made exterior changes so the basement made sense.\r\n\t- The Brewery now owns more things.\r\n\t- Main characters will now (hopefully) get some sleep and eat regularly.\r\n\t- The weapon plaques should now work.\r\n\t- I learned how to clean the file! Better for everyone!\r\n\r\n\r\n0.4: \t- Many AI Improvements - still more needed but I\\'ve made a lot of progress.\r\n\t- Golva and Hlar, being Nords, might now show up to War battles - I changed thier leveling to give them a chance.\r\n\t- Started adding dialogue to everyone. They will talk about themselves and each other after stage 50.\r\n\t- I\\'ve gotten some of the quest\\'s beginning running. Mostly works up to Balura taking money from you.\r\n\r\n\r\n0.3: \r\nQuest start is up and running, I cleaned up the place, trying to get NPCs working like proper characters. This version was mostly about cleaning up the quest start. I also added some items, including a nice Toy and some skill books while you wait for me to continue working on the mod.\r\n\r\n0.2:\r\nMain NPCs have been relocated and now have some AI for different stages of the quest. The employee schedule works after the correct quest stage is reached. Small object placement changes, Quest is taking shape. Map Marker now has to be discovered.\r\n\r\n0.1:\r\nInital version. Brewery placed, correctly linked and items placed. Basic items created. Quests and other things to come. Test and Debug stuff is in place.\r\n\r\n\r\n///Next Version:///\r\n- I\\'d like to get the quest working up to the point where you must gather and deliver gold to Balura.\r\n- I want to continue making the NPCs and items fit into the world. Should I start adding lists to vanilla NPCs?\r\n\r\n///Credits:///\r\n\r\nBethsoft for the game and makers for thier stuff and contributions to the community.",
  "categoryId": "35",
  "version": "0.5",
  "author": "Star-Demon",
  "createdUnix": "1328902268",
  "updatedUnix": "1352560787",
  "containsAdultContent": false,
  "uploadedBy": "blast0r",
  "primaryFile": null,
  "files": [
    {
      "fileId": "98526",
      "name": "NorthernFrostBrewery_v05",
      "version": "0.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "295",
      "fileName": "NorthernFrostBrewery_v05-8751-0-5.rar",
      "uploadedUnix": "1352560787",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/090d2626ae3d68011031d0a2a67615489971c4ea938046bdfc9e0da025ed4dd1/analysis/1407256869/",
      "changelogHtml": " Added more possible patron NPCs and tweaked each one. <br/> \n Added some more things into the main building and shack. <br/> \n Main characters will now (hopefully) get some sleep and eat regularly. <br/> \n The weapon plaques should now work. <br/> \n Made exterior changes so the basement made sense. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NorthernFrostBrewery_v05-8751-0-5.rar?fid=98526&ttl=1535767773&ri=8192&rs=8192&setec=0dde4ee7e79364c7134f44a6073b4a8e"
    }
  ]
}