{
  "modId": 87521.0,
  "modName": "Skyrim Effect - DELETED",
  "summary": "A mod for Skyrim which takes the player into the world of Mass Effect",
  "descriptionHtml": "[size=3]I&#39;m a huge fan of Mass Effect and Skyrim so I thought.. why not make a crossover mod with both fandoms? And thus the idea came to be.\r<br />[b]STORY\r<br />[/b][/size]You grow tired of your adventures so you decide to head to your home (anywhere) to sleep. Only when you wake up you find out that you&#39;re not in Skyrim anymore. In fact, you&#39;re not in Tamriel anymore&#33; You wake up on the medbay of the Normandy SR-2 and Commander Shepard walks in, asks you how you&#39;re feeling but unfortunately you suffer from some amnesia and have no recollection of who you are. From there you can choose your preservice history, class and psychological background.  You can be a ruthless spacer adept, a war hero colonist vanguard or a sole survivor earthborn soldier. The choices are yours&#33;  You can also be paragon, renegade or both&#33;  Your character will help Shepard save the galaxy from any threat. \r<br />\r<br />[size=3]PLACES\r<br />[/size]You get to explore many new worlds. The citadel, Omega, Illium and more&#33; Travel to these worlds and interact with the NPCs. Do some side quests. You can do what you like.\r<br />\r<br />[size=3]ABOARD THE NORMANDY\r<br />[/size]While on the Normandy, you can explore various areas of the ship: CIC, crew deck, port cargo, engineering, and even the captain&#39;s quarters. Talk to Commander Shepard (who can be found at the galaxy map in the CIC) to get quests and status updates.  You can also talk to the Normandy crew and pursue some romance. (Like Garrus, Tali, Miranda ect..)  \r<br />\r<br />[size=3][b]THE CITADEL \r<br />[/b][/size]On the Citadel you can explore various locations such as the presidium and silversun strip. Head to Shepard&#39;s apartment to throw a party why don&#39;t ya?  Talk to various NPCs to see if they have a side quest for you or to get enjoy some small talk. All races included. (Asari, Turian, Krogan, Hanar ect...) Bet your credits at the casino&#33; Visit the hospital for med supplies and more&#33; \r<br />\r<br />[size=3]ENEMIES\r<br />[/size]Throughout some quests you will come across new enemies. Mercenaries, geth and even REAPERS. Take a team with you to ensure the best results. i.e Garrus and Thane.  Shepard will often send you on some quests such as rescue missions and missions to kill various enemies that threaten the peace. When fighting Reapers, make sure you&#39;re a high level and have plenty of medigel with you&#33; \r<br />\r<br />[size=3]WEAPONS AND ARMOR\r<br />[/size]This mod gives the player new weapons and armor from all three Mass Effect games&#33; You can of course use biotic spells as well. You can also have casual clothing options for those lazy days on shore leave.  \r<br />[size=3]\r<br />FOLLOWERS\r<br />[/size]You can take any crewmate with you on a mission, be it sidequest or main mission. These followers can also be romance options and you can take your love interests with you basically anywhere&#33; Feel like heading to the Citadel to go shopping? Take someone with you&#33; ( i.e EDI, Liara, Kaiden ect... )\r<br />&lt;br /&gt;Followers may also have a personal quest for you to earn their affections. You can have any squadmate from all three games in your party. (Wrex, Ashley, Mordin, Samara, Legion and more.)\r<br />\r<br />[size=3]END GAME\r<br />[/size]At the end of the main quest, meaning all the Reapers and geth have been defeated and you helped Shepard save the galaxy.. you can return to Tamriel anytime by simply laying back down in the medbay bed.  \r<br />\r<br />[size=5][b]WE NEED A TEAM OF TALENTED MODDERS AND DEVELOPERS FOR THIS MOD TO HAPPEN&#33; IF YOU ARE INTERESTED IN HELPING, PLEASE SEND ME A MESSAGE. I don&#39;t have any modding experience myself but I think this would make a great mod. Of course I expect it to take a few years to be finished with all the navmeshing, interiors, exteriors and whatnot. I will post updates when the mod finally gets somewhere. Thank you and I hope you enjoy&#33; [/b][/size]",
  "categoryId": "30",
  "version": "0",
  "author": "KuroVampire",
  "createdUnix": "1508941297",
  "updatedUnix": "1508941297",
  "containsAdultContent": false,
  "uploadedBy": "KuroVampire",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000258151",
      "name": "readme or not",
      "version": "0",
      "categoryId": "5",
      "categoryName": "MISCELLANEOUS",
      "isPrimary": false,
      "size": "0",
      "fileName": "readme or not-87521-0.7z",
      "uploadedUnix": "1508941277",
      "modVersion": "0",
      "virusScanUrl": "https://www.virustotal.com/file/fdb97e65a5fa1910741182e81ce6f0ddfb69fa6820b36018203e95cf1644a7b2/analysis/1508941501/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/readme%20or%20not-87521-0.7z?fid=1000258151&ttl=1535876471&ri=8192&rs=8192&setec=2094a45bab4ca5dc0a51ad9c75c379a6"
    }
  ]
}