{
  "modId": 87526.0,
  "modName": "Rank and File",
  "summary": "The CW was always boring and its troops are clones of each other.... but not anymore.",
  "descriptionHtml": "[quote][size=4]“[/size][i][b]The soldier is the Army. No army is better than its soldiers. The Soldier is also a citizen. In fact, the highest obligation and privilege of citizenship is that of bearing arms for one’s country” [/b][/i][i][b]\n<br />[size=4]― George S. Patton Jr.[/size][/b][/i][/quote][i][b]\n<br />\n<br />[size=5]What is the point of the mod?[/size][/b][/i]\n<br />Like my now unsupported and abandoned CWExtra Soldiers, which was a mod that did almost the same thing, this mod adds in new types of soldiers with over 200 variants total and new dangers to face on the battlefield. From the danger of having your head cleaved off by an Imperial Headtaker to getting dismembered in a blind rage by the Stormcloak Berserker, from being gutting by an Imperial Praeturion to being shot in the knee by a Stormcloak Ranger, one must now fear the field for if they don't, they risk underestimating the enemy.\n<br />\n<br />The mod adds in thousands of new soldiers to meet on the field, and the troops are all diverse; unlike my defunct CWExtra Soldiers.\n<br />\n<br />\n<br />I also recommend that you install Diverse Skyrim and create a bashed patch between this mod and Diverse Skyrim. Diverse Skyrim adds in diversity for the civil wars sides as well by creating new variants of those in vanilla. \n<br />\n<br />Dawnguard is a requirement for installing. There is no way around this.\n<br />\n<br />\n<br />[b][i][size=5]The Troops[/size][/i][/b]\n<br /> Special thanks to BeauMath for helping me figure out something in the mod. Without him, this mod wouldn't have been possible.\n<br />\n<br />With that out of the way, the troops are varied and plentiful, from Praeturions to Beserkers, Thalmor to Rangers. Plenty to see, and plenty to kill -- or be killed by. Each troop has their own unique variants and diversity, such as ranged units within the Imperials getting Bosmer variants, whilst the magical troops getting Altmer. Stormcloaks, however, will almost be exclusively Nord. Some Imperials and Redguards may be found within their ranks, but it will mostly be Nord. No elves. So, lore will be kept with them.\n<br />\n<br />But be warned... these troops are no pushovers. Some wield mighty battle axes and are constantly covered in their foes blood. Some wield magic with impunity, roasting all that dare oppose them. And some have eyes of eagles, scoring bulls eyes from long distances. And you would do well to watch yourself, for some of these soldiers may have a penchant for the night... You may die. Over and over. But, every victory will leave you wanting more....\n<br />\n<br />If you want to know what troops you might be fighting alongside or facing off against in battle, then here is a complete list of what you will face off against, or alongside:\n<br />\n<br />[u][size=4]Stormcloaks get:[/size][/u]\n<br />[size=2]Cubs - Local recruits fresh from Basic. Don't expect them to hold up much in a fight.\n<br />[/size]\n<br />[size=2]Radningars - Skillful troops whose combat skills are up to par with a Praetorian. Some of these soldiers served in The Great War, so watch yourself.\n<br />[/size]\n<br />[size=2]Shield-Maidens - Women who distinguished themselves on the battlefield with bravery equal to their skill and bravado.\n<br />[/size]\n<br />[size=2]Thanes - Stormcloak Nobles who wish to lead from the front rather than behind a map or a desk.\n<br />[/size]\n<br />[size=2]Chieftains - Stormcloak Captains who inspire their men in the heat of battle. But be warned, they are in the know when in it comes to swordplay.\n<br />[/size]\n<br />[size=2]Rangers - Skilled woodsmen who lend their skills to the Stormcloaks as scouts and archers.\n<br />[/size]\n<br />[size=2]Generals - Brave commanders and warriors of the Stormcloaks who lead the armies personally with their swords in their hands.\n<br />[/size]\n<br />[size=2]Elemental Mages and Conjurers - Even though Nords abhor magic, some see its value in war and use it to their advantage.\n<br />[/size]\n<br />[size=2]Archers - Men trained in the use of the bow and arrow.\n<br />[/size]\n<br />[size=2]Wizards - Even though Nords abhor magic, some see its value in war and use it to their advantage.\n<br />[/size]\n<br />[size=2]Vanguards - Heavily armored warriors who lead the charge, pushing through shield walls and even entire Legions to make way for the main force.\n<br />[/size]\n<br />[size=2]Redguard Mercenaries - Redguards contracted from Hammerfell to continue to fight the Legion, who betrayed the honorable desert dwellers.\n<br />[/size]\n<br />[size=2]Berserkers - Blood crazed Nords who know nothing but war and death and use their savagery to tear apart enemies in battle.\n<br />[/size]\n<br />[size=2]War Priests - Battle-ready priests who rally and heal their comrades in the heat of battle as their songs and chants frighten the weakest of those they fight.\n<br />[/size]\n<br />[size=2]Crossbowmen - Men and women trained in the use of the heavy hitting crossbow.[/size]\n<br />\n<br />[u][size=4]Imperials Get[/size][/u][size=2]:[/size]\n<br />[size=2]Munifexs - Local recruits fresh from Basic. Don't expect them to hold up much in a fight.[/size]\n<br />\n<br />[size=2]Champions - Veteran Soldiers, mostly from The Great War. They know combat, and are not afraid to show it.[/size]\n<br />\n<br />[size=2]Centurions - Captains given the task to command the troops and lead them into battle.[/size]\n<br />\n<br />[size=2]Beneficiariis - Orderlies working under the Centurions to perform various tasks, in this case, its keeping order amongst the troops in the field and at the front.[/size]\n<br />\n<br />[size=2]Praetorians - Elite soldiers who charge through the enemy lines, slashing and killing all who oppose the Legion. In rare cases, they also work as assassins.[/size]\n<br />\n<br />[size=2]Thalmor Archers (with the Thalmor Allies download) - Elven Archers within the Thalmor tasked with rooting out the Talos worshipers within the Legion.\n<br />[/size]\n<br />[size=2]Thalmor Battlemages (with the Thalmor Allies download) - Officers within the Thalmor tasked with rooting out the Talos worshipers within the Legion.[/size]\n<br />\n<br />[size=2]Thalmor Footsoldiers (with the Thalmor Allies download)- Elven Footsoldiers within the Thalmor tasked with rooting out the Talos worshipers within the Legion.[/size]\n<br />\n<br />[size=2]Thalmor Knights (with the Thalmor Allies download)- Elven nobles within the the Thalmor tasked with rooting out the Talos worshipers within the Legion.[/size]\n<br />\n<br />[size=2]Headtakers - Terrifying, brutish men dressed as headsmen to scare and demoralize the enemy.[/size]\n<br />\n<br />[size=2]Orcish Legionnaires - Orcs who serve the Legion both as smiths and shock troopers. Due to their proficiency in heavy armor, expect to find these guys clad in it at all times.[/size]\n<br />\n<br />[size=2]Duelists - Skilled individuals who wield dagger and sword fluidly. Each flurry is a dance of death.[/size]\n<br />\n<br />[size=2]Honorguards - Heavy hitting soldiers tasked with protecting the high ranked individuals in the field.[/size]\n<br />\n<br />[size=2]Generals - Imperial Generals who wish to lead the battles personally rather than from behind a map.[/size]\n<br />\n<br />[size=2]Officers - NCOs and COs tasked with keeping the troops informed and moving.[/size]\n<br />\n<br />[size=2]Archers - Trained men who are experts with the bow.[/size]\n<br />\n<br />[size=2]Wizards - Knowledgeable men who roasts enemies from afar.[/size]\n<br />\n<br />[size=2]Shadow Legionnaires - Formidable mages from the Shadow Legion, an elite legion within the Imperial Legion composed only of battlemages.[/size]\n<br />\n<br />[size=2]Scorpionarius - Individuals trained in the use of the heavy hitting crossbow.[/size]\n<br />\n<br />\n<br />[size=5][i][b]Troop Locations\n<br />[/b][/i][/size]These troops can be found in any location where a Civil War battle takes place, and also in Civil War random encounters.\n<br />\n<br />[u][i][size=4] Also, if you have a question, please refer to the FAQ before asking in comments. If you do not read the FAQ, and you ask a question that IS on the FAQ, then I will ignore you. Your ignorance is not my problem so make sure your question hasn't already been answered.[/size][/i]\n<br />[/u]\n<br />\n<br />\n<br />[size=5][b]Known Bugs[/b][/size]\n<br />OK, so. This mod project was worked on for a year and a half by one modder. No one else. There will be a possibility of bugs, and it will be your job to fix these by letting me know whenever you encounter one!\n<br />\n<br />[u]Problem[/u] - Beast race NPCs attack me even though I'm on their side in the Civil War\n<br />   ﻿[u]Cause[/u] - The cause is unknown as of this moment.\n<br />   ﻿   [u]﻿Solution[/u] - No known solution.\n<br />\n<br />[u]Problem[/u] - NPCs faces look fucked up.\n<br />   ﻿[u]Cause[/u] - I used an NPC transmogrifier to change faces en-mass and its not inconceivable to think that it glitched every now and again.\n<br />   ﻿   [u]﻿Solution[/u] - Ill get to fixing them all eventually. Just bear with it. Be sure to let me know the type of soldier with the fucked up face and Ill get on it ASAP.\n<br />\n<br />[u]Problem[/u] - NPCs skin tone does not match their face. (Fruity Pebbles Glitch?)\n<br />   ﻿[u]Cause[/u] - I used a NPC Transmogrifier that wasn't properly scripted.\n<br />   ﻿   [u]﻿Solution[/u] - I contacted the owner and he graciously fixed the error. Just download any file past 1.0 and you will be good.\n<br />\n<br />\n<br />[b][size=5]Compatibility[/size][/b]\n<br />Civil War Overhaul - Not compatible.\n<br />                     [u] Reason[/u] - The Author created his own leveled lists for the fights.\n<br />\n<br />Open Civil War - Compatible as long as one creates a bashed patch.\n<br />\n<br />Diverse Skyrim - Compatible as long as one creates a bashed patch.\n<br />\n<br />CWExtra Soldiers - Compatible as long as one creates a bashed patch.... but really? Rank and File is its child, so there is no need to use CWExtra Soldiers anymore.\n<br />\n<br />Cutting Room Floor - Fully compatible.\n<br />\n<br />Warzones - Not known as of this moment. If there are any conflicts, report them to me ASAP.\n<br />\n<br />The Second Great War - Not known as of this moment. If there are any conflicts, report them to me ASAP.\n<br />\n<br />\n<br />[b][i][size=5]\n<br />The Future\n<br />[/size][/i][/b]Imperial Pugilists - Men and women skilled in the martial arts. They prefer to fight hand to hand, instead of sword and shield. They are mostly Dunmer, for their skills at the art are nearly unmatched.\n<br />\n<br />Imperial Templars - Men and women of the Imperial Cult who wield sword and shield in their pursuit of holy justice.\n<br />\n<br />Stormcloak Housecarl - Ulfric's personal household troops, ordered to reinforce the holes in the army.\n<br />\n<br />Imperial Field Legates - High ranking Imperial officials in the Imperial Legion. Their mere presence aids the morale of the troops.\n<br />\n<br />Stormcloak Field Commanders - High ranking rebels in the Stormcloaks. Their mere presence aids the morale of the troops.\n<br />\n<br />Stormcloak Chargers - Spellswords specializing in shock magic and wielding mighty enchanted warhammers.\n<br />\n<br />Imperial Chargers - Spellswords specializing in shock magic and wielding mighty enchanted warhammers.\n<br />\n<br />Add mage and archer variants to the Imperial Champions and Stormcloak Radningars\n<br />\n<br />Add diversity to the Stormcloak Chieftains arsenal\n<br />\n<br />Remove full blind eyes from all soldiers\n<br />\n<br />Fix male NPCs with female assets\n<br />\n<br />Fix Humans and Mer with Beast assets.\n<br />\n<br />Add Khajiits who share the penchant for the night\n<br />\n<br />Change skin tones\n<br />\n<br />Change the lipstick tones on the females\n<br />\n<br />Add Thalmor units to the Thalmor faction\n<br />\n<br />Change Male Argonian voices.\n<br />\n<br />\n<br />\n<br />[b][i][size=5][u]FAQ\n<br />[/u]\n<br />[/size][/i][/b][u][b]Question[/b][/u]: Is this mod compatible with CWExtra Soldiers\n<br />[u][b]   ﻿Answer[/b][/u]:  I hid that mod a while back, and I might uninstall it since it only affects two level lists in the vanilla, but I'd keep it installed if I was unsure. Just do a bashed patch and everything will be fine. Worst    ﻿case with both installed is that you will have double the chance to encounter certain soldiers. I do not encourage you to uninstall it, so remember that.\n<br />\n<br />[b][u]Question[/u][/b]: Which file do I need to download?\n<br />[b][u]   ﻿Answer[/u][/b]: Do I need to bust out some finger puppets and explain this through interpretative dance?\n<br />\n<br />[b][u]Question[/u][/b]: Can you make a version that doesn't require Dawnguard?\n<br />[b][u]Answer[/u][/b]: No. Don't be cheap. Buy Dawnguard.\n<br />\n<br />[b][u]Question[/u][/b]: Is it safe to uninstall CWExtra Soldiers mid-game?\n<br />[b][u]   ﻿Answer[/u][/b]: I don't know. I mean, its never safe to uninstall a mod mid-game, no matter how small it is. But since CWExtra Soldiers uses no scripts, it should be somewhat safe to uninstall. Be sure to rebuild your    ﻿bashed patch. If you're unsure, then don't uninstall. But, still build a bashed patch.\n<br />\n<br />[b][u]Question[/u][/b]: Is this mod compatible with (put mod name here)?\n<br />[b][u]   ﻿Answer[/u][/b]: Short answer, most likely. If you feel as though it might not, then ask, if you feel it might, then create a bashed patch to be sure.\n<br />\n<br />[b][u]Question[/u][/b]: Why are generals in the lists? It makes no sense for an army to risk its generals in a war.\n<br />[b][u]   ﻿Answer[/u][/b]: The Imperial Generals are rare, just like Bosmer soldiers for the Imperials. But, historically,  generals and kings often led their troops into battle personally, such as George Washington, William the    ﻿Conqueror, King Leonidas, and even Julius Caesar himself, and in more recent times (AKA 1800 to present), Theodore Roosevelt, Dwight D. Eisenhower, and Thomas Jonathan \"Stonewall\" Jackson.\n<br />\n<br />[b][u]Question[/u][/b]: Why do the Stormcloaks have mages? That is totes lore-unfriendly!\n<br />[b][u]   ﻿Answer[/u][/b]: No.... no not really. Firstly, in the Creation Kit, there was an unused mage for the Stormcloak faction (two actually, but for now we are just talking about only one of them). He was mostly skilled in    ﻿some fire magic, so I renamed him Fire Mage, and then created other types, such as Storm Mage, Conjurer, and Frost Mage. Secondly, lore wise, yes, most Nords do not condone magic, but there are plenty    ﻿of Nords who use it throughout the series. Onmund in Skyrim is a notable one, Farengar another. In Oblivion, Else God-Hater, Kalthar another. Going back into Morrowind, we also have Hrordis the bitchy   ﻿Daedra worshipper..... but, be all that as it may, Stormcloak mages will be a rarity compared to others of its ilk.\n<br />\n<br />[b][u]Question[/u][/b]: This mod doesn't compare to Diverse Skyrim!!! Don't use this heap of garbage people!\n<br />[b][u]   ﻿Answer[/u][/b]: I use Diverse Skyrim. Just create a bashed patch and stop hating.... also, i'm adding you to my block list.\n<br />\n<br />[b][u]Question[/u][/b]: Shut up, I don't care about your block!\n<br />[b][u]   ﻿Answer[/u][/b]: I don't give a shit. If it means trolls and haters don't get access to my mods then i'm fine with it and and i'm content.\n<br />\n<br />[b][u]Question[/u][/b]: So, how rare are these troops?\n<br />[b][u]   ﻿Answer[/u][/b]: Depends. Generals and its variants are super rare whilst Beneficiarri's are comparably more common. It all really depends, as this mod is meant to be challenging, but not enough to make it    ﻿impossible, as to make it easier for first time, returning, and whatever whatever users. That being said, hard enemies will be common, easy ones will be very common, and challenging ones will be    ﻿uncommon. Generals will be rare, though, regardless of their strength. I tried, however, to make sure the vanilla soldiers are extremely common.\n<br />\n<br />[b][u]Question[/u][/b]: OK, so, follow up question. Races. Can we expect the Stormcloaks to be Nord only? What about the Imperials?\n<br />[b][u]   ﻿Answer[/u][/b]: Good question. These races have been distributed as one would expect in order to maintain the sense of immersion and the aspect of the lore. Like the Stormcloaks will be [i]mostly [/i]Nord, but some    ﻿Imperials and Redguards can be found within the ranks. The Imperial Legion itself, however, is a bastion of diversity. Whilst most of the men and women (yes, there are women in the Legion, per the Lore.)    ﻿are Imperial, Breton, Dunmer, and Nord. Other races from Tamriel can be found as well, but their roles suit their racial proficiencies. Such as the Altmer can be found mainly in magi positions, Bosmer can be    ﻿found in ranged vocations, and Dunmer can be found in all sorts of areas due to their versatility. But, to keep true to the lore, some races wont have a huge presence in Skyrim. Like Khajiit and Argonians, due    ﻿to Skyrims high xenophobia.\n<br />\n<br />[b][u]Question[/u][/b]: Are any of the soldiers lore friendly?\n<br />[b][u]   ﻿Answer[/u][/b]: Most are, if that answers your question. Some I may have invented myself using both the Roman rank structure and the Viking titles. Plus, some ranks are taken straight from ESO's PVP ranks. Such    ﻿as Centurion and Praetorion. Plus, Centurions exist in the lore, and in the files of Oblivion.\n<br />\n<br />[u][b]Question[/b][/u]: But, everyone knows that ESO is not canon. So wouldn't that mean that Centurions and/or Praetorions aren't lore friendly?\n<br />[b][u]   ﻿Answer[/u][/b]: ESO is canon, Bethesda has even stated so. To claim differently would be a show of your ignorance and stupidity. Anyways, Centurions are lore friendly as I've previously stated. Same can be said    ﻿for Praetorions, as it is a rank within ESO.\n<br />\n<br />[b][u]Question[/u][/b]: Most humans look the same in Skyrim, unlike in Oblivion, where I could tell a Breton from an Imperial. How can I differentiate the human races?\n<br />[b][u]   ﻿Answer[/u][/b]: Generally speaking, according to the lore, Redguards and Nords are bulkier than the Imperials, and Bosmer and Bretons are less bulkier than the Imperials. Races were also given either beneficial or    ﻿detrimental stat bonuses, based on their race. Bretons have less health than Imperials, while Nords have more than all the races. You can also more easily check with the MFg console by kapaer. It allows    ﻿you to see all the stats, (race, health, stamina, blahbediblublah) of an NPC that you click on with the console. MFg console is also included in files inside the mod Sexlab Framework, which can be found on    ﻿Loverslab. But, for your own sanity, I recommend staying off that site. The only reason I mention it here is because a majority of you may use sex/anime porn mods and according to most people those    ﻿mods require Sexlab Framework, so i'm just letting you know you don't need to install MFg console if you already have Sexlab Framework installed. :P\n<br />\n<br />[b][u]Question[/u][/b]: I currently use CWExtra Soldiers, but am afraid to uninstall it because I want a clean save, but I really want to use this mod as well! What do I do?\n<br />[b][u]   ﻿Answer[/u][/b]: Well, just create a bashed patch then. Worst case scenario, you have a higher chance of encountering the troops add by both mods instead of the ones added just by this one. But uninstalling it    ﻿should not damage your save, as it affects really nothing due to its nature of being script free. But I understand your concerns and honestly do not encourage you to uninstall it, especially if you're unsure.\n<br />\n<br />[u][b]Question[/b][/u]: Is any of this unused content?\n<br />[u][b]   ﻿Answer[/b][/u]: Some, but not most. Some things were left unused, such as archers, mages, and officers. I just added them all back in, except for some for fear of breaking certain scripts. Those same NPCs were    ﻿instead duplicated and placed within the leveled lists, such as generals and officers.\n<br />\n<br />[u][b]Question[/b][/u]: Thank you for the mod, can I translate it?\n<br />[u][b]   ﻿Answer[/b][/u]: No, sorry. Its a general rule from me not to let anyone touch my mods and upload them under their names. I allowed only one exception to this rule in the past, and even then it was with a shaky    ﻿hand.\n<br />\n<br />[u][b]Question[/b][/u]: Can I upload my own version?\n<br />[u][b]   ﻿Answer[/b][/u]: If your asking this, your obviously not reading the Q&amp;A. Read it.\n<br />\n<br />[b][u]Question[/u][/b]: I don't like the fact the Imperials have Bosmer units, after all, didn't the Bosmer serve the Aldmeri Dominion?\n<br />[b][u]   ﻿Answer[/u][/b]: Well, yes and no. The Bosmer served unwillingly, as they were more-or-less annexed by the Dominion. Plus with their skill in archery, it would make sense that the Empire would make use of the ﻿Bosmers skills and the dislike of the Dominion. And before you ask, the Empire is a bastion of diversity, its Legions composed of all the different races. Some Khajiit can also be found within the ranks.\n<br />\n<br />[b][u]Question[/u][/b]: DURRR, I'M A DUMB CRITIC, I WANT TO CRITICIZE EVERY ASPECT OF DIS MOD.!!!!11121`13\n<br />[b][u]   ﻿Answer[/u][/b]: I do not have time for this.",
  "categoryId": "33",
  "version": "1.1",
  "author": "kvatchcount",
  "createdUnix": "1521071395",
  "updatedUnix": "1521653891",
  "containsAdultContent": false,
  "uploadedBy": "kvatchcount",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000268435",
      "name": "Rank and File Vanilla V.1.0 - The Release",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "754194",
      "fileName": "Rank and File Vanilla V.1.0 - The Release-87526-1-0.zip",
      "uploadedUnix": "1520988028",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rank%20and%20File%20Vanilla%20V.1.0%20-%20The%20Release-87526-1-0.zip?fid=1000268435&ttl=1535876476&ri=8192&rs=8192&setec=34fb5e621bf98c62fdafec97d2dd248c"
    },
    {
      "fileId": "1000268443",
      "name": "Rank and File with Thalmor Allies V1.0 - The Release",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "765144",
      "fileName": "Rank and File with Thalmor Allies V1.0 - The Release-87526-1-0.zip",
      "uploadedUnix": "1520995212",
      "modVersion": "1.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rank%20and%20File%20with%20Thalmor%20Allies%20V1.0%20-%20The%20Release-87526-1-0.zip?fid=1000268443&ttl=1535876476&ri=8192&rs=8192&setec=8dc9458029f863afc12778de3bc71e20"
    },
    {
      "fileId": "1000268940",
      "name": "Rank and File Vanilla V.1.0.1 - The Hotfix",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "754181",
      "fileName": "Rank and File Vanilla V.1.0.1 - The Hotfix-87526-1-0-1.zip",
      "uploadedUnix": "1521569866",
      "modVersion": "1.0.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rank%20and%20File%20Vanilla%20V.1.0.1%20-%20The%20Hotfix-87526-1-0-1.zip?fid=1000268940&ttl=1535876477&ri=8192&rs=8192&setec=8ffda61e5653489cfdb0e3d862baea90"
    },
    {
      "fileId": "1000268963",
      "name": "Rank and File with Thalmor Allies V1.0.1 - The Hotfix",
      "version": "1.0.1",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "765040",
      "fileName": "Rank and File with Thalmor Allies V1.0.1 - The Hotfix-87526-1-0-1.zip",
      "uploadedUnix": "1521598163",
      "modVersion": "1.0.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rank%20and%20File%20with%20Thalmor%20Allies%20V1.0.1%20-%20The%20Hotfix-87526-1-0-1.zip?fid=1000268963&ttl=1535876477&ri=8192&rs=8192&setec=3f0a8dbb69cc1108b9cf1d1099bbbc46"
    },
    {
      "fileId": "1000268972",
      "name": "Rank and File Vanilla V.1.1 - The Uniformed Update",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "754187",
      "fileName": "Rank and File Vanilla V.1.1 - The Uniformed Update-87526-1-1.zip",
      "uploadedUnix": "1521610212",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rank%20and%20File%20Vanilla%20V.1.1%20-%20The%20Uniformed%20Update-87526-1-1.zip?fid=1000268972&ttl=1535876478&ri=8192&rs=8192&setec=2ece089383ee2a96b9dfce7839020bfb"
    },
    {
      "fileId": "1000268997",
      "name": "Rank and File with Thalmor Allies V1.1 - The Uniformed Update",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "765039",
      "fileName": "Rank and File with Thalmor Allies V1.1 - The Uniformed Update-87526-1-1.zip",
      "uploadedUnix": "1521653891",
      "modVersion": "1.1",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Rank%20and%20File%20with%20Thalmor%20Allies%20V1.1%20-%20The%20Uniformed%20Update-87526-1-1.zip?fid=1000268997&ttl=1535876478&ri=8192&rs=8192&setec=6d0bb004c56a3d3f1fe56577d95a4795"
    }
  ]
}