{
  "modId": 87541.0,
  "modName": "Blackthorn - A Buildable Town in The Rift - Polskie tlumaczenie",
  "summary": "Polish translation of Blackthorn - A Buildable Town in The Rift by Ld50365.<br /><br />Polskie tłumaczenie modyfikacji Blackthorn - A Buildable Town in The Rift autorstwa Ld50365.",
  "descriptionHtml": "For English-speaking users: this is only a Polish translation of [b][i][url=https://www.nexusmods.com/skyrim/mods/65839/?]Blackthorn - A Buildable Town in The Rift [/url][/i][/b]by [b][url=https://www.nexusmods.com/skyrim/users/6942439]Ld50365[/url][/b].\n<br /> \n<br />[color=#ff7700][b]Krótki opis oryginalnej modyfikacji[/b][/color]\n<br />[size=3]Modyfikacja wprowadza miasteczko Czarnocierń, położone na zachód od Pękniny. Po odkryciu lokacji udaj się do miejscowego sklepu wielobranżowego i użyj znajdującego się tam warsztatu, żeby zbudować własną rezydencję i inne budynki.[/size]\n<br />[size=3] [/size]\n<br />[color=#ff7700][b]Najważniejsze cechy oryginalnej modyfikacji[/b][/color]\n<br />[size=3]Modyfikacja pozwala zbudować: gospodę, księgarnię,garbarnię, kuźnię, kopalnię, gospodarstwo rolne, młyn, sklep alchemika, dom dla gości przy rezydencji, kwatery dla towarzyszy, koszary straży miejskiej oraz nabrzeże, jak również ogrodzić miasteczko murami i zbudować pod nim niewielką sieć korytarzy, a na środku postawić stragany dla handlarzy. Księga [/size][i]Witaj![/i][size=3] znajdująca się przy warsztacie w sklepie zawiera listę materiałów niezbędnych do rozbudowania miasteczka.[/size]\n<br />[size=3] [/size]\n<br />[size=3]Materiały kupić można u Winstona lub Grace w sklepie wielobranżowym lub zamówić za pośrednictwem księgi głównej leżącej na ladzie w sklepie.[/size]\n<br />[size=3] [/size]\n<br />[size=3]Do poszczególnych budynków zatrudnić można pracowników. Im więcej budynków wzniesiesz i im więcej mieszkańców zgromadzisz, tym większe będą dochody generowane przez miasteczko. Pieniądze zbierać możesz albo z poszczególnych budynków, albo z gabinetu w swojej rezydencji.[/size]\n<br />[size=3] [/size]\n<br />[size=3]Rezydencję rozbudować można o kuźnię, laboratorium alchemiczne czy kącik zaklinacza. Posiada ona wiele przydatnych pojemników, schowków i udogodnień, takich jak np. komplet kapliczek bóstw i Kamieni Mocy. Po wybudowaniu głównej sypialni, w szafie w rogu pojawią się dwa przyciski. Jeden przywołuje skrzynię z materiałami budowlanymi niezbędnymi do ukończenia wszystkich budynków, a drugi usuwa warsztaty. Szafa w sypialni zawiera ukryte przejście, za którym znajduje się tajemny pokój pozwalający przechowywać trofea. W łazience znajduje się specjalne zwierciadło, pozwalające za darmo zmienić wygląd Smoczego Dziecięcia.[/size]\n<br />[size=3] [/size]\n<br />[size=3]Po wzniesieniu i urządzeniu budynku, pojawiają się w nim liczne pojemniki i szafy, których zawartość, podobnie jak towary kupców, można swobodnie zabrać, ponieważ nie liczy się to jako kradzież. Pozwala to zyskać sporo wartościowych i przydatnych przedmiotów.[/size]\n<br />[size=3] [/size]\n<br />[size=3]Modyfikacja działa z modyfikacją [/size][i][url=http://www.nexusmods.com/skyrim/mods/29249/?]Hearthfire Multiple Adoptions[/url][/i][size=3] autorstwa użytkownika [/size][url=https://www.nexusmods.com/skyrimspecialedition/users/5363]TMPhoenix[/url][size=3], pozwalającą adoptować do sześciu dzieci.[/size]\n<br />[size=3] [/size]\n<br />[color=#ff7700][b]Tłumaczenie[/b][/color]\n<br />[size=3]Wiem, że „blackthorn” oznacza tarninę, a konkretniej śliwę tarninę, uznałem jednak, że bardziej dosłowne tłumaczenie – „Czarnocierń” – lepiej pasuje do [/size][i]Skyrim[/i][size=3].[/size]\n<br />[size=3] [/size]\n<br />[size=3]Tłumaczenie było dość intensywnie testowane i powinno być wolne od najbardziej rażących błędów, takich jak np. kwadraciki zamiast polskich znaków. Jeżeli pozostały jakieś literówki albo niewłaściwie przetłumaczone nazwy – daj znać, a na pewno poprawię.[/size]\n<br />[size=3] [/size]\n<br />[size=3]Modyfikacja wykorzystuje oryginalne [/size][i]assety[/i][size=3] z gry, tak więc jeżeli grasz z polskim dubbingiem, postacie przemawiają po polsku.\n<br />\n<br />[/size][center][i]Pro forma[/i] informuję, że zrzuty ekranu pochodzą z wersji spolszczenia dla [i]SE[/i].[/center][size=3]\n<br />[/size][size=3] [/size]\n<br />[color=#ff7700][b]Instalacja[/b][/color]\n<br />[size=3]1. Pobierz modyfikację [/size][b][url=https://www.nexusmods.com/skyrim/mods/65839/?][i]Blackthorn - A Buildable Town in The Rift[/i][/url][/b][size=3] autorstwa [/size][b][url=https://www.nexusmods.com/skyrim/users/6942439]Ld50365[/url][/b][size=3].[/size]\n<br />[size=3]2. Pobierz spolszczenie.[/size]\n<br />[size=3]3. Zainstaluj modyfikację za pomocą NMM lub ręcznie.[/size]\n<br />[size=3]4. Wypakuj zawartość archiwum ze spolszczeniem do folderu„Data”  w katalogu ze [/size][i]Skyrim[/i][size=3]. Możliwe jest również zainstalowanie spolszczenia za pośrednictwem NMM. W obu przypadkach naciśnij „Tak”, kiedy pojawi się pytanie o nadpisanie istniejących plików.[/size]",
  "categoryId": "67",
  "version": "1.6",
  "author": "nazg2001",
  "createdUnix": "1509044142",
  "updatedUnix": "1509044142",
  "containsAdultContent": false,
  "uploadedBy": "nazg2001",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000258232",
      "name": "Blackthorn V1.6 PL",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6036",
      "fileName": "Blackthorn V1.6 PL-87541-1-6.rar",
      "uploadedUnix": "1509044067",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/2b71f33c7dd3348906f2ca7e55c5174ec4a443dea899dec7a1d63d8241a05863/analysis/1509044363/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Blackthorn%20V1.6%20PL-87541-1-6.rar?fid=1000258232&ttl=1535876498&ri=8192&rs=8192&setec=6c742db7718d5a3a2e3463dcee2ce41c"
    }
  ]
}