{
  "modId": 8765.0,
  "modName": "Falkreath Farmhouse",
  "summary": "A new player home near Falkreath.",
  "descriptionHtml": "Another UPDATE! See update log at bottom to see what was added/changed.  \r\n\r\n   Another update after a long away from Creation Kit time.\r\n\r\n   My second mod and first player home, I decided to make it after searching Falkreath on the nexus and being surprised to find nothing. Not just no player homes, but nothing. As I love the scenery and feel of the hold, I decided to make a player home so I can spend my time there.\r\n\r\n   Other than being in Falkreath, the other thing I wanted to do differently with this house is the crafting facilities. Rather than placing everything on one floor, or even worse, in one room, I decided to spread then throughout the inside and outside of the house. Things that should be outside, like the smelter, anvil, and tanning rack (how exactly do you tan a hide indoors?) are outside, along with things I feel should be, such as the alchemy table. Being that you are working with plants and other products of nature, it only makes sense you would want to be outside. The enchanting table and cooking spit are inside.\r\n\r\n   All the storage is safe, as none of it re-spawns. Also there is a wood pile out near the wood chopping block which you can use to store wood in, for that day when we can actually use it to fuel our fireplace (someone make that mod please :P).\r\n\r\n  Also as of update 1.1 there are idle markers inside, so your npc friend can read, sit down, or sweep as they want. As of the time being I have shelved adding spouse support, as I spent about 4 hours on it and made no progress. This means if you want your spouse there you need a mod like \\\"Spouse can Live Anywhere\\\" and if you want companion to you need \\\"UFO\\\" or one of the other companion mods. Adding built in spouse options is something I want to add but as of this time I lack the patience. Someone needs to make a vid tutorial :P\r\n\r\n   That\\'s about it. It\\'s not fully done, and things I\\'m planning to add include;\r\n\r\nA pile of wood inside that is linked to the outside one, so what you store outside you can access from inside.\r\n\r\nSpouse support.\r\n\r\nAnd maybe a tunnel to the dark brotherhood sanctuary, still thinking about that. (input pls)\r\n\r\n\r\nWell that\\'s it. Hope you all enjoy it. Please leave constructive criticism in comments on what you want and how to make it better.\r\n \r\nUPDATES!\r\n\r\nUpdate version 0.81 hotfix;\r\n\r\nAdded Cooking pot,\r\nAdded Map marker,\r\n\r\nUpdate version 0.9;\r\n\r\nNavmesh inside and outside for companions,\r\n5 Weapon Plaques,\r\n3 Mannikins,\r\n2 bookshelves (not working yet),\r\nForge replaced by anvil outside near smelter,\r\nWorkbench moved down near anvil and smelter,\r\nTanning rack moved over near wood cutting block,\r\nSeveral items which feel on the floor off their proper spots deleted.\r\nSome lighting changes.\r\n\r\nUpdate version 1.0\r\n\r\nAnother lighting change, for better mooding.\r\nBOOKSHELVES! You may need to leave and come back for them to work.\r\nA basement with tons of weapon racks and other displays.\r\nSome new storage scattered about.\r\n\r\nUpdate version 1.1\r\n\r\nIncreased ledge size by request.\r\nAdded idle markers so companions/spouses can sweep, sit down, ect. (Requires Ext Mods atm.)\r\nMore storage.\r\nLighting tweaks.\r\nExterior Lighting,\r\nNew storage area for food/ingredients.\r\nMore I can\\'t remember.",
  "categoryId": "67",
  "version": "1.1",
  "author": "vfreak",
  "createdUnix": "1328907028",
  "updatedUnix": "1336735570",
  "containsAdultContent": false,
  "uploadedBy": "vfreak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "50725",
      "name": "Falkreath Farmhouse OLD VERSION",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "141",
      "fileName": "Falkreath Farmhouse OLD VERSION-8765.rar",
      "uploadedUnix": "1333745704",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3fb93e1b1927d5f918669e81c2973bbb55ef6c5578969df2336b6bb725393324/analysis/1406801164/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Falkreath%20Farmhouse%20OLD%20VERSION-8765.rar?fid=50725&ttl=1535767801&ri=8192&rs=8192&setec=ac08a1a8b06423051575f9b5f860cf02"
    },
    {
      "fileId": "60456",
      "name": "Falkreath Farmhouse",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "176",
      "fileName": "Falkreath Farmhouse-8765-1-1.rar",
      "uploadedUnix": "1336735570",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/52bb3b6e996616036d36df1e47fb25ab4dcb7b56bd232797f7c0f4d18292273c/analysis/1406884625/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Falkreath%20Farmhouse-8765-1-1.rar?fid=60456&ttl=1535767801&ri=8192&rs=8192&setec=3db7f98d9026944147537819c59a64cd"
    }
  ]
}