{
  "modId": 87672.0,
  "modName": "Mesh Rigger",
  "summary": " For Skyrim Fallout and Oblivion\r<br />Rig and Weightpaint nifs without a 3D program&#33;\r<br />\r<br />",
  "descriptionHtml": "    I&#39;ve used nifscope, gimp, blinder and other complicated programs in an attempt to apply HDT nodes with no avail ... I thought there has to be an easier way  to apply these weights and nods to armors and clothing for both male and female characters so that they scale as body shape changes during gameplay.   \r<br />     \r<br />     This program is the best way I could find. It&#39;s deceptively simple and all of it&#39;s changes are easily correctable by reinstalling your armor mod again through the NMM. \r<br />\r<br />\r<br />  What led to the search was I use a now extinct mod for S.A.M called Player Look Evolution that causes changes to body nodes in a realistic way like pumping iron but it&#39;s more related to what the character does and  less dependent on to skill leveling. For example I use RND and I might force one of my characters eat so I don&#39;t have to worry about it later ... he eats too much he starts to gain weight and his waist to expands and his belly becomes distended..Cool right? Super immersive for sure&#33; But without TBBP/ HDT enabled armor and clothing this wasn&#39;t visible unless I removed the armor or clothing he was wearing (WTF&#33;*&#33;*&#33;*&#33;). Think about how pregnancy mods that work, they cause the npc&#39;s or pc&#39;s belly node to increase as she comes closer to term if you don&#39;t have TBBP armor then you couldn&#39;t tell unless you removed her armor in the middle of a field and then die from a random enemy npc encounter.....\r<br />\r<br /> \r<br />   This is a Nexus Mods port of a beta program found on the adult modding site Lover&#39;s Lab it&#39;s incredibly simple to use and I&#39;m sure it will work for SSE because it uses python to execute the functions of just nif- bone swapping. So that means the cool HDT armor you got, you can apply those same nif-bones and weights to a completely different armor by using the cool HDT one&#33; \r<br />\r<br />           I am not the file author/ program creator... Nor do I intend to provide support for this program...I can, however, share my personal experiences using it. If your not familiar with the requirements for HDT/TBBP then head over to You&#39;ll also need to grab\r<br />[b] \r<br />\r<br />Grab Python From here: https://www.python.org/downloads/windows/\r<br />\r<br /> Grab PyFFI from here :https://pypi.python.org/pypi/PyFFI\r<br />[/b]\r<br />Make sure that with any kind of program file you download outside of the nexus make sure it&#39;s safe you run it across :[url=https://www.virustotal.com/#/home/upload] Virus Total     \r<br />[/url]\r<br />\r<br />                                                     \r<br />                                                                                                       [url=https://www.nexusmods.com/skyrim/mods/26800/?]XP32 Maximum Skeleton - XPMS[/url][center]                     \r<br />         [url=https://www.nexusmods.com/skyrim/mods/53996/?]HDT Physics Extensions[/url]\r<br />\r<br />             \r<br />            Women have a number of HDT body mods on the nexus I personally use CBBE, there is also UNP\r<br />\r<br />\r<br />\r<br />                              \r<br />                           [url=http://www.loverslab.com/topic/64613-sos-body-hdt/]SOS HDT Body[/url]      [url=https://www.vectorplexus.com/index.php?/topic/96-sam-installation-guide/]VectorPlexus&#39; Shape Atlas For Men[/url]                                                                                           \r<br />[url=https://www.vectorplexus.com/index.php?/files/file/19-hdt-bbb-bounce-for-sam/]\r<br />HDT BBB Bounce for SAM 1.2 by KouLeifoh[/url]\r<br />            \r<br />                     Racemenu users get a little extra with being able to edit these bouncy sliders in game :\r<br />                                 \r<br />[url=https://www.nexusmods.com/skyrim/mods/45235/?]                         RaceMenu Skeleton Sliders for XPMS[/url][/center][center]\r<br />[left][/left][/center][left][center]\r<br />[b][u]Kormgar has created other fantastic programs these are included in your download:\r<br />[/u][/b][url=https://kgtools.wordpress.com/clothing-converter/]Clothing Converter  (A simpler Body Slide Alternative: For Men and Women)\r<br />[/url][url=https://kgtools.wordpress.com/seam-mender/]Seam Mender[/url]\r<br />\r<br />For detailed instructions and a change log see the support website :\r<br />[url=https://kgtools.wordpress.com/mesh-rigger/][u][color=#0066cc]Support website[/color][/u][/url]    (https://kgtools.wordpress.com/mesh-rigger/)[/center][url=https://kgtools.wordpress.com/seam-mender/][/url]\r<br />\r<br />\r<br />                 [i]  The KGtools files you need to get the program running have been provided for you in the downloads section, the links to python are given  in the requirements page and in the quote below. The quote also has detailed instructions and so does Kormgar&#39;s website. You can add TBBP nodes and weights to everything&#33;  This file is intended as a modder&#39;s resource file however it has an easy enduser UI through the use of .BAT files :) [/i][/left]\r<br />[quote]This tool automatically copies Bones, Weightpainting, Dismemberment Partitions, and much more for Skyrim, Fallout and Oblivion meshes.\r<br />  \r<br /> The tool can process a single nif, multiple nifs, or even an entire directory structure at once.\r<br />  \r<br /> You can now add one or more bones to an entire clothing collection with a couple of quick clicks.\r<br />  \r<br /> And rigging a raw mesh or stripping and re-rigging an existing mesh is a simple as running the tool.\r<br />  \r<br />Core Functions\r<br />  \r<br /> 1. Copy skeleton root, bones, and weightpainting from a fully rigged mesh to an unrigged mesh\r<br /> 2. Accurately replicate skin partitions and dismemberment partitions\r<br /> 3. Selectively copy individual bones, multiple bones, or entire skeletons from a rigged nif to any other mesh.\r<br /> 4. Selectively rig individual meshes within a nif for Rigid or Soft weightpainting\r<br /> 5. Automatically copy Havok HDT nodes and bones\r<br /> 6. Automatically compensate for differences in skinning, bone transforms, skinned bone transforms, etc\r<br /> 7. Automatically generate perfectly matching _0 and _1 morph meshes, if _0 and _1 morph meshes already exist\r<br />\r<br />[b]Using Mesh Rigger[/b]\r<br />\r<br />Spoiler  \r<br />\r<br /> Mesh Rigger works by accurately copying information from a template nif to as many target nifs that you desire. Because of this, the quality of final results depends on the quality of the selected template nif.\r<br />\r<br /> For best results, your template nif should be a full body nif (hands, feet, upper body, lower body, head) that shares the same base body type as any nifs that you wish to rig using Mesh Rigger.\r<br />\r<br />1. Run &#39;Mesh Rigger.bat&#39; or &#39;mesh_rigger.py&#39;. This will open the main Mesh Rigger options Window.\r<br />\r<br />[b]File Settings[/b]\r<br />\r<br />2. Click &#39;Load Defaults&#39; (Optional)\r<br />3. Click File -&gt; Template Options -&gt; Select Template Mesh\r<br />3.a. Select the template nif that you will be using.\r<br />3.b. Warning for Skyrim users. If you are rigging morph nifs (name_0.nif, name_1.nif), please ensure that your template nif has an appropriate name. So if your template matches the _0 body style, ensure that the template name ends with _0.nif. If instead the template matches the _1 body style, ensure that the template name ends with _1.nif.\r<br />4. (Optional) If you would like to rig the mesh with a different skeleton than the one included in your Template Mesh: Click File -&gt; Template Options -&gt; Select Template Skeleton.\r<br />4.a. Optional) Select the skeleton template nif that you will be using.\r<br />5. Click File -&gt; Target Options\r<br />5.a. Select either the nifs or the folder containing the nifs that you want to rig\r<br />5.b. (Optional) If you want the tool to process subfolders, enable &#39;Include Subfolders&#39;\r<br />6. Click File -&gt; Select Destination Folder\r<br />6.a. Select the location where you would like the rigged meshes to be saved. The tool will automatically overwrite any nifs in this folder with newly rigged versions.\r<br />\r<br />[b]Search Settings[/b]\r<br />\r<br /> Override Distance, Search Distance, and Vertex Targets determine how the tool finds matching weights between the meshes.\r<br />\r<br />7. Override Distance should be enabled *only* if you want to force every vertex on the target meshes to receive new weightpainting.\r<br />\r<br />8. Search Distance should be increased if you are working with skirts or capes or other materials that may need to search a significant distance for an appropriate target on the template mesh.\r<br />\r<br />9. Vertex Targets determines how many targets on the template mesh each vertex should attempt to find. The weight applied to a given vertex will be a distance weighted average of the found targets on the template mesh. In general, 3 is a safe starting point. Increase this number to generate smoother weightpainting, decrease it to generate a more precise copy from the template.\r<br />\r<br />[b]Rigging Settings[/b]\r<br />\r<br />10. Select Bones to Copy: Enable if you want to select only certain bones to be copied\r<br />\r<br />11. Copy Havok Node: Enable if you want to copy Havok nodes and skeletons for HDT enabled Skyrim meshes\r<br />\r<br />13. Select Rigid Meshes: This option allows you to specify two options for every geometry block (mesh) in every nif that you rig. When enabled, every time a nif is loaded to be rigged, the tool will open a menu listing all meshes found in the nif. Each mesh has two options, Weight, and Rigid.\r<br /> 13.a &#39;Weight&#39; determines whether or not a given mesh received updated weighting. If a mesh does not have Weight enabled, its weightpainting will not be modified by the tool.\r<br /> 13.b. &#39;Rigid&#39; determines whether or not a given mesh receives rigid weightpating. Enable this for hard object like a shell or a breastplate that should not be deformed. Disable this for soft objects, like leather or clothing that should match the deformation of the body mesh.\r<br />\r<br />14. &#39;Replace Weights&#39;: This option causes the tool to erase existing weighting for any bones that the tool paints\r<br />\r<br />15. &#39;Replace Rigging&#39;: This option causes the tool to erase any existing bones and replace them with the bones from the template mesh (or template skeleton, if one was selected). Note: Enabling this option will automatically delete any unused bones\r<br />\r<br />[b]16. &#39;Replace Partitions&#39;: This option is used for Skyrim and Fallout nifs. When enabled, it will delete existing dismemberment partitions and copy the appropriate partitions from the template nif. If disabled, any existing dismemberment partition assignments will be preserved when the partition is rebuilt.\r<br />[/b]\r<br />17. &#39;Allowed Genders&#39;: This option is useful when walking a directory tree. It attempts to detect the gender of a given nif and rig only nifs with matching genders. Note: The tool uses file path and texture path to determine gender, so it is unable to accurately categorize all nifs by gender.\r<br />\r<br />18. Click &#39;OK&#39; to run Mesh Rigger\r<br />\r<br />[b]Saving and Restoring Settings[/b]\r<br />\r<br />Cancel: Close the tool and don&#39;t do anything (same as closing the window)\r<br />Load Defaults: Reset settings to factory default\r<br />OK: Accept the settings and begin processing meshes\r<br />  \r<br />Save Current Settings: Save your current configuration to a customizeable ini file\r<br />Load Current Settings: Load a saved configuration from a customizeable ini file\r<br />\r<br />\r<br />Download: FROM DOWNLOADS TAB&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;&#33;\r<br />\r<br />  Tools RC 89.e.7z  [b]14.42MB[/b]   1461 downloads\r<br /> Tools Rc 89_K_Upgrade.7z [b]131.78KB[/b]   780 downloads\r<br />\r<br />[b]Download RC 89e then extract then download and extract Tools Rc Upgrade and extract to the same directory[/b]\r<br /> \r<br /> \r<br />Website for more Information:\r<br />[url=http://kgtools.org/][u][size=4]KGTools Development Website Site[/size][/u][/url]\r<br />  \r<br />[size=4]Installation:[/size]\r<br />  Spoiler  \r<br />  \r<br />  \r<br />Portable Package:\r<br />  \r<br /> 1. Extract downloaded .7z file to the folder of your choice.\r<br />  \r<br />To run the tool: \r<br /> 1. Double-Click on Mesh_Rigger.bat in your Mesh Rigger folder\r<br />  \r<br />Light Download:\r<br />  \r<br /> 1. Install Python 3.4 [url=https://www.python.org/download/releases/3.4.0/][u][color=#0066cc]https://www.python.o...releases/3.4.0/[/color][/u][/url] (64 bit recommended if you are working with very large nifs)\r<br /> 2. Install Pyffi 3K [url=http://sourceforge.net/projects/pyffi/files/pyffi-py3k/][u][color=#0066cc]http://sourceforge.n...les/pyffi-py3k/[/color][/u][/url]\r<br /> 3. Extract Mesh Rigger to your preferred location in your computer.\r<br />  \r<br />To run the tool:\r<br /> 1. Double Click on mesh_rigger.py located in your Mesh Rigger folder.\r<br />  \r<br /> This should open the bone weight copy menu.  If this does not happen, download and use the Portable Package instead[/quote] Simple instructions : \r<br />   \r<br />\r<br /> File &gt; Select template (this is the mesh that has tbbp/HDT weighting) (This can be a body mesh but may cause undesired effects)\r<br />\r<br />File &gt; Target Mesh Options &gt; Process selected meshes only... (this is the armor you want tbbp weights on) \r<br />\r<br />(make sure it matches the correct xxxx0_.nif and the xxxx1_.nif mesh file type. D[b]o not use XXXXbody_0.nif as a template  and then target a Clothing/Armor item with a XXXXX_1.nif ending it will cause serious graphical oddities when used in game... you have been warned)[/b]\r<br /> \r<br />File &gt; select destination folder... this is where the program will put you newly weighted meshes)\r<br /> \r<br />Once that is set, pick the &#34;select bone to copy&#34; and &#34;overwrite existing bones&#34; buttons and click OK.\r<br /> \r<br />\r<br />Once again all props and kudos to the creator of the program and Xp32 ... It seriously has made my life easier ... \r<br />\r<br />If you use a TBBP/HDT body it&#39;s best to use an armor that covers all visible slots.. or things may not fit together as they should.\r<br />  \r<br /> [url=https://www.nexusmods.com/skyrim/mods/26800/?]\r<br />[/url]",
  "categoryId": "39",
  "version": "Base",
  "author": "Gerra6 ",
  "createdUnix": "1509616295",
  "updatedUnix": "1509616295",
  "containsAdultContent": false,
  "uploadedBy": "VValentour",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000258728",
      "name": "KGTOOL RC_89e Mesh Rigger",
      "version": "Base",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "14765",
      "fileName": "KGTOOL RC_89e Mesh Rigger-87672-Base.7z",
      "uploadedUnix": "1509616175",
      "modVersion": "Base",
      "virusScanUrl": "https://www.virustotal.com/file/d8a840b8dd324cfc45fce8bb7209f074ed7247d6964d12c48d6e643a95d5a6b0/analysis/1509616296/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KGTOOL%20RC_89e%20Mesh%20Rigger-87672-Base.7z?fid=1000258728&ttl=1535876633&ri=8192&rs=8192&setec=18794ef31addefe360e4493d193176ba"
    },
    {
      "fileId": "1000258729",
      "name": "KGTOOL RC_89_k Mesh Rigger Update",
      "version": "Update",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "132",
      "fileName": "KGTOOL RC_89_k Mesh Rigger Update-87672-Update.7z",
      "uploadedUnix": "1509616290",
      "modVersion": "Update",
      "virusScanUrl": "https://www.virustotal.com/file/60dd44414bf7b1f620ef2268118ff50e3209751804b4dccb6d16b49d86d3dda0/analysis/1509616562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KGTOOL%20RC_89_k%20Mesh%20Rigger%20Update-87672-Update.7z?fid=1000258729&ttl=1535876633&ri=8192&rs=8192&setec=6212f2f9900e106ba4a1ca7ec66a9912"
    }
  ]
}