{
  "modId": 87673.0,
  "modName": "Wellwatch Manor",
  "summary": "A new home with several wardens to guard the Goldenforst.",
  "descriptionHtml": "[center][b][font=Georgia][color=#ff7700][size=6]Wellwatch Manor[/size][/color][/font][/b]\r<br />\r<br />&#34;The Wellwatch Valley is not a recommended place for travelers, and neither is the whole of Goldenforst anyway. It is a wonder that you can \r<br />find a little Myrad tower. The brave Myrads guard with Malphas&#39; gratitude.&#34;\r<br />\r<br />[size=3]Here my friends is one more player home for Enderal in anticipation of the Forgotten Stories. \r<br />(Now updated with Enderal&#39;s new map&#33;)\r<br />The Goldenforst is a beautiful place, and very dangerous. Some have likened the region as a new &#39;kingdom of banditry&#39; far away from the Order&#39;s patrols and resources. However, a new manor has taken root; that of the Wellwatch Wardens. \r<br />\r<br />The Wellwatch Wardens are few in number, and work with the solitary Myrad keeper at this lovely but perilous waystation. Here, this manor provides the player with a Free player home, with few amenities but remarkable atmosphere:\r<br />[color=#ffff00]- A secure player chest, bed and bookshelf in the Attic Room for the player (with accompanying note and sword).\r<br />- A large, spacious manor with alchemy and enchanting tables, along with a cooking spit. \r<br />- 2 wardens in the home, 1 of which is a wandering merchant.\r<br />- An Aeterna wandering minstrel, rescued by the Wardens. She doesn&#39;t speak much after the event.\r<br />- The Myrad keeper retains a new outfit.\r<br />- Navmeshed, with a proper no-respawn encounter zone.[/color]\r<br />[size=1](The interior is very similar to the merchant home in the Farmers Coast, loved the layout, shameless inspiration there.)[/size]\r<br />\r<br />Its position is a remarkable one; standing between the Farmers Coast, the Powder Desert and Thalgaard, the manor rests in this beautiful valley with (relatively high level) adventure all around. \r<br />This home is certainly for you if you want a home away from the cities, but still secure enough to feel safe in that wilderness of Enderal. No additional resources next to the Enderal stock, just one .esp for your Data folder. \r<br />I hope you enjoy&#33; \r<br />\r<br />[/size][img width=616,height=378]https://i.imgur.com/SyYGpjG.png[/img][/center]",
  "categoryId": "107",
  "version": "1.0",
  "author": "ClefJ",
  "createdUnix": "1509621289",
  "updatedUnix": "1510884249",
  "containsAdultContent": false,
  "uploadedBy": "ClefJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000259881",
      "name": "ClefJ&#39;s Wellwatch Manor - Updated Map",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "82",
      "fileName": "ClefJ's Wellwatch Manor - Updated Map-87673-1-0.rar",
      "uploadedUnix": "1510884249",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/608390fa4c92c026d6741896f57f2bc8586df4f297cc2dedc4d5e904819b9305/analysis/1510884423/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ClefJ%27s%20Wellwatch%20Manor%20-%20Updated%20Map-87673-1-0.rar?fid=1000259881&ttl=1535876635&ri=8192&rs=8192&setec=ff71b4382e6074ff2d0dcfe0fdcc3960"
    }
  ]
}