{
  "modId": 8770.0,
  "modName": "Defender",
  "summary": "This mod makes for more varied/powerful armor-focused players.\r\nThe heavy armor \\\"Conditioning\\\" perk makes heavy armor able to benefit from light and mage armor perks.\r\nThe light armor \\\"Unhindered\\\" perk makes light armor able to benefit from mage armor perk",
  "descriptionHtml": "Skyrim\\'s gameplay mantra is to allow players to choose their character class through playstyle.  This mod patches up an area that I feel doesn\\'t follow this ideal;  In vanilla skyrim, you are shoehorned into using exclusively mage armor, light armor, or heavy armor, to receive benefits.\r\n\r\nThis mod allows a character focusing on armor to really become a master of defense.  Once they are conditioned in heavy armor (at which point, it would feel like light armor to them), they can recieve the additional light armor perks.  The same goes with receiving the mage armor perks while wearing light armor, if they have unhindered.\r\n\r\nThis rewards players who decide to wear different types of armor and defenses at once, and also rewards them for leveling up these categories and perks.  The benefits can be huge once all three are maxed out - but that\\'s what is supposed to happen in Skyrim.",
  "categoryId": "24",
  "version": "1.0",
  "author": "Yarharhar",
  "createdUnix": "1328908103",
  "updatedUnix": "1328908184",
  "containsAdultContent": false,
  "uploadedBy": "yarharhar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28551",
      "name": "Defender",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Defender-8770-1-0.zip",
      "uploadedUnix": "1328908184",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/f86e8c430f5a94e810b72a5043662447a4ee47825bae20988044f358dda7aef1/analysis/1406667746/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Defender-8770-1-0.zip?fid=28551&ttl=1535767807&ri=8192&rs=8192&setec=ff8cc1ce5f98659c196591229928064a"
    }
  ]
}