{
  "modId": 87742.0,
  "modName": "GPD Win - Skyrim LE install guide for high texture detail",
  "summary": "An install guide that balances visual quality with performance for people playing on the GPD Win.",
  "descriptionHtml": "[color=#ffd966][size=3][i]Update 11/7/17 - I&#39;ve added a new mod to the list. Check under my notes about the mod series &#39;Remove Distracting Things&#39;.[/i][/size][/color]\r<br />\r<br />[color=#8e7cc3][size=4][b][u]Introduction[/u][/b][/size][/color]\r<br />\r<br />[size=3]This guide is intended to be used by [/size][url=https://en.wikipedia.org/wiki/GPD_Win][size=3]GPD Win game console[/size][/url][size=3] owners who are not satisfied to run Skyrim Legendary Edition at lowest preset and instead want a game install that balances visual quality with performance. I suppose it could also be useful to others who have devices with similar specs. I&#39;ve attached to this guide custom ini files that were created using knowledge widely available on the internet. I&#39;ve also pulled together links to the best performance enhancing mods and resources and put them here in one place for your[/size] [size=3]ease. [/size]\r<br />\r<br />[size=3]I love my GPD Win. But it is what it is. Skyrim will push this device to the edge. If you want Skyrim to do well in one area, it will come at the expense doing another thing not as well. This guide will direct you to install optimized textures for that high texture detail while downgrading or removing performance killing particle effects. Luckily, the end result is that Skyrim will look fantastic on the GPD Win and the trade offs are barely noticeable. [/size]\r<br />\r<br />[size=3]I hope this guide helps you create a better mobile Skyrim experience. This is my first attempt at such a guide and I may update it in the future. [/size]\r<br />\r<br />[size=3]Here is some additional information onwhat you can expect -[/size]\r<br />\r<br />[size=3]Resolution: 960 x 544 (Custom. PSVita resolution.)[/size]\r<br />[size=3]Textures: High[/size]\r<br />[size=3]Shadows: Enabled (Low)[/size]\r<br />[size=3]Max FPS: 30 (Majority of the map and interiors. Capped for 30fps)[/size]\r<br />[size=3]Med. FPS: 25-30 (Some areas of the map and interiors. Towns. Large battles)[/size]\r<br />[size=3]Min FPS: 20-25(Where you&#39;d probably expect. Riften Market place for example.)[/size]\r<br />\r<br />\r<br />[u][b][color=#ff7700][size=4]GPD Win optimization[/size][/color][/b][/u]\r<br />\r<br />\r<br />[size=3]I own the June update version and have done no other optimizations besides running [/size][url=https://www.oo-software.com/en/shutup10][size=3]O&O Shut Up 10[/size][/url][size=3]. If you haven&#39;t done that then download the programand follow these steps.[/size]\r<br />[list=1]\r<br />[size=3]   [/size][*][size=3]Extract the contents of the   downloaded folder a separate folder.[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]Run O&O Shut Up 10.    [/size]\r<br />[size=3]   \r<br />[/size][*][size=3]Select Actions.[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]Select apply all recommended   settings.[/size]\r<br />[/list]\r<br />[size=3]Note: I had Cortana disabled beforerunning this program so I don&#39;t remember if it is turned off by default in OOSU10 recommended settings but it can disable it, might want to do that.\r<br />[/size]\r<br />\r<br />[u][b][color=#6aa84f][size=4]Adding a Custom Resolution[/size][/color][/b][/u]\r<br />[list=1]\r<br />[size=3]   [/size][*][size=3]   Right-click on the desktop.[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]   Select Graphics Properties.[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]   Select Display.[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]   Select Custom Resolutions[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]   Enter in the fields – Width = 544, Height = 960, Refresh Rate = 60[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]   Select Add.[/size]\r<br />[size=3]   \r<br />[/size][*][size=3]   Restart Machine.[/size]\r<br />[/list]\r<br />\r<br />[u][b][color=#f1c232][size=4]Installing Tweaked INI[/size][/color][/b][/u]\r<br />\r<br />[size=3]Download the [url=https://www.nexusmods.com/skyrim/mods/87742/?tab=2&navtag=https%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fmodfiles%2F%3Fid%3D87742&pUp=1]file[/url] attached to this guide in the files section. It contains my tweaked Skyrim.ini and SkyrimPrefs.ini files. Navigate to [/size][size=3]this directory C:&#92;Users&#92;*USERNAME*&#92;Documents&#92;My Games&#92;Skyrim&#92; . Open the zipped file and drag the files into the directory I just mentioned. Overwrite the files there. Keep in mind that changing settings in the Skyrim launcher can overwrite this file.[/size]\r<br />\r<br />[size=3]To learn more about ini edits and general game tweaks there is an excellent resource [/size][url=https://www.geforce.com/whats-new/guides/the-elder-scrolls-v-skyrim-tweak-guide#1][size=3]here[/size][/url][size=3]. [/size]\r<br />\r<br />[size=3]I do want to extend some credit to an author, [/size][url=https://www.nexusmods.com/skyrim/mods/59533/?][size=3]JackHerer93[/size][/url][size=3]. His lighting tweak was a great find. In some cases I see a 3 fps increase, which is significant for the GPD Win. Please consider clicking the link in his name and endorsing his work. I will warn you though, this tweak has the odd effect of making all mining nodes appear empty. There&#39;s nothing wrong with them other than that, you can mine them. Minor issue but the tweak is too good to pass up.[/size]\r<br />\r<br />[color=#e06666][size=3][i]Now lets patch and mod our game. Below are links to utilities, patches and mods needed for this install and also some optional ones as well as a short description of what they&#39;ll do. Each link below will lead you to where you can download the files and read their install instructions so I won&#39;t describe here how to install each one since that would take forever and the instructions are already written by the authors of the mods via description on the page or readmes contained in the files. If you do not own the legendary edition, take care to check and download the correct versions of these mods. They all have non-legendary support. Most links will lead you to pages on Nexus so while you&#39;re there, please consider endorsing their work.[/i][/size][/color]\r<br />\r<br />\r<br />[color=#76a5af][u][b][size=4]Utilities[/size][/b][/u]\r<br />[/color]\r<br />[url=http://skse.silverlock.org/][size=3]SKSE[/size][/url][size=3]- This is required to run some mods on this list. You can try downloading and using the installer but I personally never have. To install manually, select the 7z archive download link and follow the instructions provided in the readme.[/size]\r<br />\r<br />[size=3][url=https://www.nexusmods.com/skyrim/mods/34/?]FPSLimiter[/url] - A handy utility for Skyrim. It limits the frame ratefor a smother gameplay experience. Should default to 30 so there isn&#39;t anything you&#39;ll need to do except download and install it.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/12801/?]Ordenador[/url]- Ordenador is a tool used to compress texture files. Do NOT use it to compress any of the texture mods listed in this guide. If there is a mod out there that you want to install such as a new piece of armor but it&#39;s textures are really large, you can use this tool to compress it. Otherwise it&#39;s not needed. Here is a [/size][url=https://www.nexusmods.com/skyrim/mods/71294/?][size=3]guide[/size][/url][size=3] that describes how to use it. [/size]\r<br />\r<br />\r<br />[u][b][color=#93c47d][size=3]Patching[/size][/color][/b][/u]\r<br />\r<br />[size=3][url=https://www.nexusmods.com/skyrim/mods/71214/?]Unofficial Skyrim Legendary Edition Patch[/url] – This patch fixes many of the issues Bethesda did not fix in their game including bugs that can cause performance issues. A must have. \r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/50305/?]SSME - Skyrim Startup Memory Editor[/url] – Helps with stability. [/size]\r<br />\r<br />\r<br />[u][b][color=#e69138][size=4]Mods[/size][/color][/b][/u]\r<br />[size=3]\r<br />[url=https://www.nexusmods.com/skyrim/mods/3863/?]SkyUI[/url] -Fixes the messy UI in Skyrim and adds some nice hot key functionality. Also it will enable us to use the next mod in this list. \r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/78936/?]SkyUI XL Font and Icons (with new default columns)[/url] - This mod for SkyUI will make the font larger and easier to read on the GPD Win&#39;s screen. \r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/32505/?]Skyrim Project Optimization[/url] – This amazing mod works by unrendering lighting effects that are not currently being viewed by the player. Big increase in performance. While reading the install instructions pay close attention to it&#39;s load order. It&#39;s important because it won&#39;t work otherwise.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/14504/?tab=1&navtag=https://www.nexusmods.com/skyrim/ajax/moddescription/?id=14504&preview=&pUp=1]Vanilla Reduced Textures[/url] – Don&#39;t let the name fool you. With the 512 version of this mod your Skyrim experience will not be reduced. This isn&#39;t a typical half size texture mod, the textures are reduced while maintaining as much detail as possible and they look stunning on the GPD Win. You&#39;ll be hard pressed to notice any difference between this and Bethesda&#39;s high detail textures other than that you&#39;ll have better performance. Just make sure to grab the 512 version or else this isn&#39;t really a high texture detail install as the 256 version is a clear visual downgrade.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/43921/?]Bethesda Performance Textures - Animals and Creatures[/url] – Works the same way as Vanilla Reduced Textures but as the name suggests, for animals and creatures.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/42360/?]Bethesda Performance Textures - Armor - Clothes – Weapons[/url] – Same as above but for armor, clothes and weapons.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/53692/?tab=2&navtag=https://www.nexusmods.com/skyrim/ajax/modfiles/?id=53692&pUp=1]LowRes Particles and Flora – LRPF[/url] – This is a series of mods that reduce some particle effects, decals and flora. It&#39;s easiest to just install the full version. The reduction to decals and flora are not noticeable and magic still looks good but will appear less bright than before. This mod is necessary to prevent frame drops when being attacked by magic. Helps in fights with dragons and mages. \r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/6387/?tab=1&navtag=https://www.nexusmods.com/skyrim/ajax/moddescription/?id=6387&preview=&pUp=1]Skyrim Performance PLUS[/url] – This mod works like the other performance texture mods above but for camera effects such as Rainfall. They are necessary to prevent frame drops in heavy weather conditions. You will need to download and install the files: Pine Needles FX, Rainfall FX and The Rift – Aspen Leaves FX. \r<br />\r<br />You can optionally download Snowfall FX as well but it&#39;s already covered in Low Res Particles mod above so it would overwrite some files. I prefer Snowfall FX so I have installed.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/73181/?tab=1&navtag=https://www.nexusmods.com/skyrim/ajax/moddescription/?id=73181&preview=&pUp=1]Remove Distracting Things[/url] – This is a series of mods that can change,reduce or outright remove certain effects. The file you&#39;ll want to download here is &#39;Timed City Lights&#39;. This turns off lights in cities in the daytime thus giving a performance boast. Doesn&#39;t work in Whiterun for some reason. Maybe I can find a way to fix it in the future. \r<br />\r<br />Also get &#39;Remove problem smoke lite&#39;. This mod keeps all the best such as smoke from fire, chimneys, and campfires but removes some problematic mist effects such water wheel mists. This made the difference of 3-5 frames in some cases. PLEASE NOTE: I initially experienced crashing when using this mod. I think it conflicts with the other fog removers on this list so make sure it&#39;s load order is higher than the other fog remover mods. After moving up it&#39;s load order the crashes stopped for me. It may invalidate &#39;Interior and Dungeon Fog Remover&#39; but since the mod author is vague in his description of what all it removes I&#39;m not sure about it. \r<br />\r<br />Optionally, I prefer Brazier and Chimney smoke more transparent K747 mod over the smoke particle reduction in Low Res Particles and Flora Mod. Downloading and installing will replace the smoke effects from that mod. Up to you. Keep these mods in mind for the future. You can probably increase your performance even more if you are not too attached to the effects some of these mods can remove.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/64611/?]Insignificant Object Remover[/url] – One of the best performance mods around. It removes a great deal of junk and will indeed increase performance. As the mod author states, you likely will not even notice what it removes. For example, apparently one of the reasons the game can run like crap in the Rift area is because there&#39;s ton of seaweed on the floor of the lake where the player can&#39;t even see it (unless you like to swim for some reason). See the description and photos for more information. I know I didn&#39;t miss anything it removed.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/58212/?]Remove Exterior Fog[/url] – Before I got a GPD Win I didn&#39;t even realize that Bethesda covered their games in foggy gunk. I just thought that&#39;s how it looked. I now have fog removing mods installed on my desktop because doing so gives the graphics a nice crisp and clean look. There&#39;s fresh air in Skyrim now. Regarding the GPD Win, removing fog is necessary for good performance and you likely won&#39;t miss it.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/29253/?]Remove Interior Fog V2[/url] – Like the mod above but for interiors. \r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/736/?]Interior and Dungeon Fog Remover[/url] – This is not a duplicate of the mod above.This does something different. It removes performance killing floating mist particles. \r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/34981/?]No More Glowing Edges Mod[/url] – This mod removes the glowing aura around bodies when using healing spells, Armor spells etc. Does not remove any other glowing effects. Helps maintain FPS in combat.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/77791/?]No more Radial Blur[/url] – Personally, I hate blur. I remove it, if I can,in every game I play. It&#39;s a personal taste but in any case it&#39;s necessary to maintain frame rate in combat on the GPD Win.\r<br />\r<br />[url=https://www.nexusmods.com/skyrim/mods/60/?tab=1&navtag=https://www.nexusmods.com/skyrim/ajax/moddescription/?id=60&preview=&pUp=1]Enhanced Blood Textures[/url] – The file you will want here is &#39;No Screen Blood&#39;. It removes the occasional blood splatter on the screen. Needed to help maintain frame rate in combat. [/size]",
  "categoryId": "62",
  "version": "1",
  "author": "Satanu Reeves",
  "createdUnix": "1509964535",
  "updatedUnix": "1509964535",
  "containsAdultContent": false,
  "uploadedBy": "SatanuReeves",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000259096",
      "name": "GpdWinSkyrimINI",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "GpdWinSkyrimINI-87742-1.zip",
      "uploadedUnix": "1509962505",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/be8004ed8f1dc42cfcad1ef91df8fa6fb546932c3b620f33850dfc987055623c/analysis/1509962702/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/GpdWinSkyrimINI-87742-1.zip?fid=1000259096&ttl=1535876747&ri=8192&rs=8192&setec=653b9f870b53d53a34427c2d6659be42"
    }
  ]
}