{
  "modId": 87746.0,
  "modName": "Dark Magic Arsenal",
  "summary": "A collection of spells for assassins and vampire lords, inspired by Oblivion. Requires Dawnguard, Dragonborn and SKSE.",
  "descriptionHtml": "[center][size=4][b]The Unwelcome Guest[/b]\r<br />[/size][size=1]Apprentice Alteration Spell[/size]\r<br />\r<br />[size=3]Magically unlocks an Apprentice or lower level lock. [/size][/center][center][i][size=2]&#34;Oh, but I was invited. By Sithis.&#34;[/size]\r<br />[/i][/center][center][size=2]It&#39;s identical to the Oblivion open effects: point, fire a magic missile, and the chest/door glows for a moment before unlocking.[/size]\r<br />Because it&#39;s a scripted effect, it&#39;s only going to work for locks in the base game + DLCs. I might make compatibility patches in future.\r<br />Tonillia will also sell scrolls that open Expert locks. I didn&#39;t make a full-on spell for them because I thought it&#39;d be too overpowered.\r<br />\r<br />[/center][center][size=4][b][/b][/size][size=4][b]Detect Pulse\r<br />[/b][/size][size=1]Adept Alteration Spell\r<br />\r<br />[/size][size=3]Detects nearby living creatures for 30 seconds.[/size]\r<br />\r<br />It works like the werewolf howl. You don&#39;t have to concentrate for it, just cast the spell once and reap the benefits for 30 sec.\r<br />It&#39;s weaker than the concentration version, but also costs a lot less magicka.\r<br />\r<br />\r<br />\r<br />[size=4][b]Black Winter\r<br />[/b][/size][size=1]Adept Alteration Spell\r<br />\r<br />[/size][size=3]Paralyzes the target for 2 seconds and deals 20 frost damage per second.\r<br />\r<br />[/size]It&#39;s a mini-paralysis for less skilled Alteration users, with a different animation. Another little tribute to M&#39;raaj-Dar :)[/center]\r<br />\r<br />\r<br />[center][size=4][b][/b][/size][size=4][b]Void Gazer\r<br />[/b][/size][size=1]Apprentice Illusion Spell\r<br />\r<br />[/size][size=3]Grants toggleable night vision for 150 seconds.[/size]\r<br />[i][size=2]&#34;What is the colour of night?&#34;[/size][/i]\r<br />\r<br />This is super useful for stealth characters who aren&#39;t vampires or Khajiit, especially along with mods that enhance dark areas.\r<br />It&#39;s completely silent and doesn&#39;t allert enemies to your position. No more lugging torches around&#33;\r<br />I didn&#39;t edit the shaders so the vision appears desaturated and blurry on the edges. On purpose. If it&#39;s just better darkvision\r<br />with no drawbacks, it would totally defeat the point of using darkness mods for immersion in the first place.\r<br />\r<br />\r<br />\r<br />[size=4][b]Deathly Visage\r<br />[/b][/size][size=1]Adept Illusion Spell\r<br />\r<br />[/size][size=3]Makes the caster invisible and silent for 10 seconds.\r<br />\r<br />[/size]A mini invisibility + muffle spell for a quick backstab. Available sooner, but lasts a lot shorter and doesn&#39;t raise Illusion skill much.\r<br />\r<br />\r<br />\r<br />[size=4][b]Will of Sithis\r<br />[/b][/size][size=1]Expert Illusion Spell\r<br />\r<br />[/size][size=3]Command Humanoid up to level 18 for 25 seconds.[/size]\r<br />\r<br />It&#39;s a better version of calm + frenzy and benefits from perks that enhance the calm tree. \r<br />The catch is that it only ever works on non-undead humanoids.\r<br />\r<br />\r<br />\r<br />[size=4][b]Night Mother&#39;s Caress\r<br />[/b][/size][size=1]Apprentice Restoration Spell\r<br />\r<br />[/size][size=3]Restores 10 health per second for 5 seconds.\r<br />\r<br />[/size]Cheaper than Fast Healing and is cast instantly. Doesn&#39;t stack with itself.\r<br />\r<br />\r<br />\r<br />[size=4][b]Phantom Shroud\r<br />[/b][/size][size=1]Adept Restoration Spell\r<br />\r<br />[/size][size=3]Grants 30% spell absorption for 60 seconds.\r<br />\r<br />[/size]Finally some magical defence that isn&#39;t a ward. I&#39;ve always thought wards cost too much magicka for what they do.\r<br />\r<br />\r<br />\r<br />[size=4][b]Void Surge\r<br />[/b][/size][size=1]Expert Destruction Spell\r<br />\r<br />[/size][size=3]Deals 115 magical damage to a single target, but drains a portion of the caster&#39;s health.[/size]\r<br />[i][size=2]&#34;Too simple. Too safe. None of them truly understood the glory of the Destruction school...&#34;[/size][/i]\r<br />\r<br />Sinister red Sith lightning&#33; We all know how badly Skyrim needed that.\r<br />It&#39;s not shock damage and doesn&#39;t scale with the shock perks. To make up for it, it deals slightly more damage than fully\r<br />augmented Thunderbolt, but doesn&#39;t damage magicka and costs 15% of your current health every time it connects.\r<br />\r<br />\r<br />\r<br />[size=4][b]Soul Prison\r<br />[/b][/size][size=1]Master Conjuration Spell\r<br />\r<br />[/size][size=3]Sends a humanoid into the Soul Cairn for 10 seconds, causing its soul to evaporate and lose 250 health.\r<br />\r<br />[/size]This is a ritual spell so it doesn&#39;t benefit from dual-casting, but the damage is huge, comparable to the Soul Tear shout.\r<br />It works on black souls (living humanoids) and erases them from the world for 10 seconds. If they die in the Soul Cairn, \r<br />they will reappear as black skeletons, to reflect that they&#39;re now soulless husks.\r<br />This spell is only available to Vampire Ladies/Lords who purchase it from Ronthil.[/center]",
  "categoryId": "75",
  "version": "0.1",
  "author": "Winter Flower",
  "createdUnix": "1509985721",
  "updatedUnix": "1509985721",
  "containsAdultContent": false,
  "uploadedBy": "WinterFlower",
  "primaryFile": null,
  "files": []
}