{
  "modId": 87769.0,
  "modName": "OPERATION ROCKSHAVE - DELETED",
  "summary": "Removes many rocks, trees, driftwood, plants, shrubs, clutter, and many similar objects amounting by the thousands while still leaving the impression that nothing of value was lost.",
  "descriptionHtml": "[b]OPERATION ROCKSHAVE - WIP[/b]\r<br />\r<br />This mod is specially intended for people who insist to use their office laptops built with weaker integrated video cards for gaming.\r<br />Because this mod will remove thousands of unnoticeable objects in the exteriors of Skyrim, less objects will be rendered, less VRAM\r<br />will be used, and performance will improve -- by how much depends on the user&#39;s mods setup and computer.\r<br />\r<br />[b]v1.0: Covers the entire Whiterun Hold and extends to the following boundaries at the mods current progress:[/b]\r<br />\r<br />Hillgrund&#39;s Tomb to the East:\r<br />North: Eldersblood Peak\r<br />West: Robber&#39;s Gorge, Fort Sungard\r<br />East: Hillgrund&#39;s Tomb, Whitewatch Tower\r<br />South: Moss Mother Cavern\r<br />Towns, Cities, and other Settlements: These were left untouched.\r<br />\r<br />Operation Rockshave works using two methods:\r<br />\r<br />1. Individually removes a number of rocks, trees, plants, shrubs, wood, and other similar objects that clutter the landscape of Skyrim\r<br />which when combined amounts to more than 1k edits and counting. While this may seem like the mod is taking away more from the already desolate\r<br />land of Skyrim, in fact, it is still hardly noticeable even to the eagle-eyed player. Good land textures and dense grasses will cover up\r<br />what is removed anyway. Even more attention was put on which trees to remove so that they just don&#39;t pop up as you approach an area and users do not have to reconfigure their LOD anymore.\r<br />\r<br />2. For objects that I am sure I would not want to see in my game anymore because they look undesirable and only the highest quality mesh and\r<br />textures mod can save them, they were removed from the game by redirecting their base ID to a blank mesh. These objects are the following:\r<br /> \r<br /> A. TreeDeadShrub\r<br /> B. TreeDeadShrubSnow\r<br /> C. TreeThicket01\r<br /> D. TreeThicket01Snow\r<br /> E. TreeReachFern03\r<br /> F. TreeReachMntMossCover01\r<br /> G. TreeReachMntMossCover02\r<br /> H. TreeReachMntMossCover03\r<br /> I. TreeReachMntMossCover04\r<br /> J. TreeReachMntMossCover05\r<br /> K. TundraScrub01\r<br /> L. TundraScrub02\r<br /> M. TundraScrub03\r<br /> N. TreeReachBranchPile02\r<br /> \r<br />Underwater grasses, kelps, and other such flora were not editted as it is assumed the user&#39;s grass mod already takes care of this.\r<br />\r<br />Because several thousand objects are not rendered by the game anymore, this would in theory, save you some VRAMThese measures may look extreme and some may call it desperate but I am of the belief that less is always more and one of the keys to make Skyrim look nice is proper placement of these objects which unfortunately has turned to a scattered mess in the landscape of Skyrim -- as if a devastating tropical storm of the century has wrecked havoc and no one has lived in the province since. I had a lot of fun working on this mod as I have discovered chests and strongboxes I have never seen before in all my years of playing Skyrim intermittently. I could have had an easier time if all the weather mods out there didn&#39;t have unrealistic rains and thunderstorms so unreal and too long not even tropical countries at their worst rainy season get to have them. I shake my head&#33; I also found some USLEEP-placed objects but I left those alone as they were placed to conceal badly placed objects.\r<br />\r<br />I intend to cover all of Skyrim eventually as fast as humanely possible. If you find any seams or bad edits please inform me on the comments section, thank you.\r<br />\r<br />MOD COMPATIBILITY:\r<br />This mod works by going through each individual object&#39;s form ID and redirecting its base ID to one that is a blank nif file. It should be\r<br />100% compatible with any mod that edits the worldspace. Even if, by off-chance, the same objects are being handled by a different mod, the load\r<br />order will decide which to ultimately load in the game so it is up to the player where he/she wants to place this esp on his load order.\r<br />\r<br />SSE COMPATIBILITY:\r<br />I&#39;ll be honest I haven&#39;t touched SSE at all so I don&#39;t really know for sure, but since I am editting base IDs, a simple conversion of this mod\r<br />using some tool [I don&#39;t know any SSE tool] out there should do it.",
  "categoryId": "39",
  "version": "v1.0",
  "author": "Politsieli",
  "createdUnix": "1510127837",
  "updatedUnix": "1510127837",
  "containsAdultContent": false,
  "uploadedBy": "ruggedcarlos",
  "primaryFile": null,
  "files": []
}