{
  "modId": 87819.0,
  "modName": "Conina the Hairdresser",
  "summary": "A companion inspired by Sir Terry Pratchett's character, and the ability to construct her a Salon at Lakeview.",
  "descriptionHtml": "[b]IMPORTANT - the full version of this mod can only be used with a new game. The Hearthfires quest that it overrides is already running at the beginning, and can't be changed later. The Light version will provide the companion, and the Salon, but you won't be able to make the furnishings yourself.\n<br />\n<br />[/b][size=5][b]Conina the Hairdresser\n<br />[/b][/size][size=2]In the Discworld novel \"Sourcery\", Conina, Nijel the Destroyer and Rincewind were caught up in the destiny of Coin the Sourcerer. At the end of their adventure, Conina and Nijel were \"sent away\" by Coin, and Rincewind ended up in the Dungeon Dimensions (not the first or last time he'd been off-disc). It's not unreasonable to think they might all have found their way to Nirn, and Skyrim. With its magic and barbarians, they'd all feel at home here. Most, if not all, of the other characters belong on Discworld, and so I'm leaving them there. \n<br />\n<br />Conina is the daughter of Ghenghiz Cohen the Barbarian, from whom she's inherited a lot of weapon skill. Her looks come from her mother's side - she was an unnamed temple dancer. She's also a master thief, but since that doesn't really do anything for a follower, I've ignored that part. \n<br />\n<br />Neither Nijel nor Rincewind are what you'd call experienced, but that just makes them perfect as the player character, who starts at their level. Since you need to start a new game for the full experience, why not play as one of them? I've provided a hat and robes for a Rincewind, but Nijel just needs Hide with an iron helmet, which are already in the game. I originally considered including my idea of their faces as presets, but decided against it, as everyone will have their own opinions (and complain).\n<br />[/size]\n<br />\n<br />[size=4]Full Version - ConinaCompanion.esp\n<br />[size=2]You'll find Conina in the Sleeping Giant Inn, and she'll join you without any payment. She has high initial skills in Two-Handed, including the Devastating Blow Perk, and five levels of Barbarian. She'd also rather be a hairdresser, and dresses accordingly. \n<br />\n<br />You can buy Rincewind's Robes and Hat next door at the Riverwood Trader, if you want to go that way, or just build your own Nijel The Destroyer. \n<br />When you contruct Lakeview Manor, the option to remodel the small house will provide you a workbench that furnishes a Salon, rather than an Entryway, including a sign outside the door. This option is not available at Windstad or Heljarchen. \n<br />\n<br />[/size][/size][size=4]Light Version - Conina.esp\n<br />[size=2]If you want to add Conina to an existing game, install the light version and use the console command \"SetStage Conina 100\" to enable her in the Inn. Then when you've made an empty Small House at Lakeview, \"SetStage Conina 200\" will add the Salon content.\n<br />\n<br />If you'd prefer to play [u]as[/u] Conina, use \"help Conina\" to get the ID's of her dress etc. You can still \"build\" the Salon for your character, even without the follower.\n<br />[/size]\n<br />Notes\n<br />[size=2]The Salon option is only added to Lakeview, not Windstad or Heljarchen. \n<br />Conina's armour gets Steel Plate gauntlets and boots at level 10+, but then you need to start making something better. All that house-building improves your Smithing skill, so you can do it!\n<br />Install one or the other, not both. Since the light version does nothing until you use the console commands, it should be harmless, but it wasn't tested that way.[/size]\n<br />[size=2]There are a couple of mods that provide versions of The Luggage, so I didn't include one here. I have no reason to believe either is incompatible. [/size]\n<br />\n<br />[/size]",
  "categoryId": "66",
  "version": "0.5",
  "author": "ghastley",
  "createdUnix": "1510356306",
  "updatedUnix": "1510356592",
  "containsAdultContent": false,
  "uploadedBy": "ghastley",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000259424",
      "name": "Conina_02",
      "version": "0.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8935",
      "fileName": "Conina_02-87819-0-2.7z",
      "uploadedUnix": "1510356592",
      "modVersion": "0.2",
      "virusScanUrl": "https://www.virustotal.com/file/079431e1d80df5b110e6c01a485657add44da7fc8336b0843560dd796d157a7e/analysis/1510356873/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Conina_02-87819-0-2.7z?fid=1000259424&ttl=1535876855&ri=8192&rs=8192&setec=fafcd356db1fbced7513db93d3f0ffad"
    }
  ]
}