{
  "modId": 8781.0,
  "modName": "SBO - Skyrim Blade Overhaul - Thinner and Longer Swords",
  "summary": "Ongoing project to provide mesh replacers for some of the swords and daggers in Skyrim to improve aesthetics and immersion. ",
  "descriptionHtml": "[img=center]http://i.imgur.com/V0ICmGW.png[/img]\r<br />[img=center]http://skyrim.nexusmods.com/mods/images/8781-1-1364933541.png [/img]\r<br />\r<br />\r<br />[img=left]http://i.imgur.com/gWBdfhJ.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />This mod is an ongoing project to provide new meshes with narrowed and where appropriate, lengthened blades for the daggers, swords and greatswords of TESV: Skyrim.\r<br />The meshes are replacers, and as such, do not affect the game in any way other than visually. All game assets that directly utilise these meshes will be automatically updated. This mod does not use esps, and therefore will not affect your mod load order. It is completely stable by both design and nature.\r<br />\r<br />[list]\r<br />Key objectives:* customisability* retexture compatibility* stability[/list]\r<br />\r<br />The mod is intended to provide maximum customisability, offering the end user the option of installing a mesh replacer for a specific weapon type, to replacing all currently edited weapons, and all options in between. So if you only want the steel sword, you&#39;re able to install only the meshes for the steelsword, or if you just want the steel family, you can install the whole steel family, or if you want all families, you can just copy across any meshes you like. \r<br />\r<br />I found several of Skyrim&#39;s blades to be far to big and unwieldy. Swords are speed-dependent, not momentum-dependent weapons, and as such, typically have long and thin blades to save on mass. Too much mass in a blade can cause the weapon to be unbalanced and cumbersome to use. Essentially, this project aims to make the targeted weapons more aesthetically pleasing, and also more accurate in terms of their &#34;visual physics&#34;of the game.\r<br />\r<br />[img=left]http://i.imgur.com/KZ06rXo.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Click on the &#34;changes&#34; tab on the mod page to see a complete changelog.\r<br />\r<br />[img=left]http://i.imgur.com/vRcmvOh.png[/img]\r<br />\r<br />[img=left]http://i.imgur.com/XUMdj5Z.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />The weapons in the following list are available for download:\r<br />\r<br />[list]\r<br />* Iron Dagger* Iron Sword* Iron Greatsword* Steel Dagger* Steel Sword* Steel Greatsword* Imperial Sword* Silver Sword* Silver Greatsword* Dwarven Dagger* Dwarven Sword* Dwarven Greatsword* Elven Dagger* Elven Sword* Elven Greatsword* Glass Dagger* Glass Sword* Chillrend* Glass Greatsword[/list]\r<br />\r<br />[img=left]http://i.imgur.com/AmuhD99.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />The weapons in the following list are planned for re-edit (not-exhaustive, more will be added on as I think of them or as they are suggested):\r<br />\r<br />* None currently.\r<br />[img=left]http://i.imgur.com/Xs8YRIY.png[/img]\r<br />\r<br />[img=left]http://i.imgur.com/GN7Pl7t.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Currently, automatic installation does not support individual choices on which weapons to install. If you use the automatic installation method, NMM will automatically install ALL the weapon meshes in the mod. However, there are plans to create an installer package to allow automatic customisable installation in the future.\r<br />\r<br />1. Download the mod with NMM, or download the mod separately and add to NMM manually.\r<br />2. Install the mod with NMM.\r<br />\r<br />[img=left]http://i.imgur.com/42OEjir.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />This will overwrite any old mesh files that are in your data folder. They will not delete the old vanilla weapon meshes, you just won&#39;t see the old vanilla meshes in game - you&#39;ll see the SBO meshes instead.\r<br />\r<br />[img=left]http://i.imgur.com/peJEvV5.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />1. Extract the &#34;data&#34; folder in the archive to your Skyrim installation directory. If prompted to overwrite, select &#34;yes&#34;.\r<br />\r<br />[img=left]http://i.imgur.com/7mIU6t3.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />1. Open the archive. Navigate to your skyrim directory.\r<br />2. Go to Skyrim&gt;&gt;Data&gt;&gt;meshes&gt;&gt;weapons. If any folders do not exist, create them. You can use the directory structure in the archive as a guide.\r<br />3. Either create folders or navigate into the folders for each weapon set - e.g. iron, steel, etc.\r<br />4. Find the same location inside the archive. For each weapon, there will be two meshes - typically &#34;weaponname.nif&#34; and &#34;1stpersonweaponname.nif&#34;. For each weapon that you want to install, copy BOTH to the appropriate directory. Once again - verify that the folder pathways in your installation directory are IDENTICAL to those in the archive. Use it as a guide. Of course, if you&#39;re installing an entire family, you can copy all the items in the particular folder at the same time.If prompted to overwrite, select &#34;yes&#34;.\r<br />\r<br />Example installation -  Iron dagger and Glass family (dagger, sword, greatsword and chillrend)\r<br />\r<br />In this example, I only want to install the iron dagger and the glass weapon set - I don&#39;t want any other weapons affected. First, I navigate to my skyrim directory, then to the data directory. I create a folder called &#34;meshes&#34;, then another one inside the meshes folder called &#34;weapons&#34;. In this, I create two folders: &#34;Iron&#34; and &#34;Glass&#34;. I open the archive, navigate to Data&gt;meshes&gt;weapons&gt;iron, and I copy the files &#34;irondagger.nif&#34; and &#34;1stpersonirondagger.nif&#34; to the iron directory I created. I then go to the glass folder within the archive, and copy the entire contents to the &#34;glass&#34; folder I created earlier.\r<br />\r<br />[img=left]http://i.imgur.com/yKIW8K0.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />Either uninstall the mod using NMM if installed manually, or delete any meshes that you placed using the manual installation methods described.\r<br />\r<br />[img=left]http://i.imgur.com/7XaAQQF.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />These are mesh replacers. If you install this mod, they overwrite any NIF files that YOU may have added or extracted. They won&#39;t permanently interfere with the vanilla game, but if you have assets that you yourself have downloaded and installed which these files will overwrite, then you should make a backup.\r<br />\r<br />I STRONGLY recommend that you use Nexus Mod Manager to install the files - the reason for this is that even overwrites are reversible if you install with this software, and you can activate or deactivate them as much as you please.\r<br />\r<br />Retextures are COMPLETELY supported, provided they do not use their own meshes. If they do, I can&#39;t guarantee that the new textures won&#39;t be screwed up if they&#39;ve significantly changed the UV co-ordinates (if you don&#39;t know what that means, ignore it.)\r<br />\r<br />[img=left]http://i.imgur.com/oP6ixvE.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />This mod will only be hosted on Skyrim Nexus. If you see it elsewhere, please report it to the moderators of that site, or to me - because I didn&#39;t put it there. \r<br />The meshes within this mod are able to be used freely and without permission in other mods provided I am credited as the original author of the meshes. However, if you intend to use these meshes, please send me a message stating your intent, just to pre-empt and prevent potential misunderstandings or conflicts.\r<br />\r<br />[img=left]http://i.imgur.com/CNcjbaI.png[/img]\r<br />\r<br />\r<br />\r<br />\r<br />\r<br />All meshes originally created by Bethesda.\r<br />All edits to the meshes performed only by myself.\r<br />\r<br />\r<br />Thanks:\r<br />Hammerhorde - for ideas on the the elven meshes, and for being the main inspiration behind this mod.",
  "categoryId": "55",
  "version": "1.5",
  "author": "SleeperService",
  "createdUnix": "1328912387",
  "updatedUnix": "1452484582",
  "containsAdultContent": false,
  "uploadedBy": "LordBishek",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000021969",
      "name": "Skyrim Blade Overhaul - All-in-One Package",
      "version": "1.5",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1065",
      "fileName": "Skyrim Blade Overhaul - All-in-One Package-8781-1-5.7z",
      "uploadedUnix": "1364936999",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/3bb5a52b12e64cc4a3ec88aebc0d1395c05d14e5e50836143792884e7b1ff1dc/analysis/1407502439/",
      "changelogHtml": " Reissued release - elven sword- V 2.0 <br/> \n Reissued release - elven greatsword- V 2.0 <br/> \n Initial release - silver weapon set <br/> \n Initial release - glass weapon set <br/> \n page graphics previews updated, optional files removed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Blade%20Overhaul%20-%20All-in-One%20Package-8781-1-5.7z?fid=1000021969&ttl=1535767831&ri=8192&rs=8192&setec=43207e2a946a4de21bd825f101229fc5"
    },
    {
      "fileId": "1000190916",
      "name": "Dual Sheath Redux Meshes",
      "version": "1.5",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1765",
      "fileName": "Dual Sheath Redux Meshes-8781-1-5.rar",
      "uploadedUnix": "1452484582",
      "modVersion": "1.5",
      "virusScanUrl": "https://www.virustotal.com/file/337b24b7b9731b11384dd49d41717d9ea0f498c3177118107076c58bb33d3951/analysis/1452484645/",
      "changelogHtml": " Reissued release - elven sword- V 2.0 <br/> \n Reissued release - elven greatsword- V 2.0 <br/> \n Initial release - silver weapon set <br/> \n Initial release - glass weapon set <br/> \n page graphics previews updated, optional files removed <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dual%20Sheath%20Redux%20Meshes-8781-1-5.rar?fid=1000190916&ttl=1535767832&ri=8192&rs=8192&setec=ab62aed568a09d21668f1f0e5acac282"
    }
  ]
}