{
  "modId": 87885.0,
  "modName": "FairyWingRings",
  "summary": "Makes Anton/Sunspot2&#39;s Fairy Wings available as a learnable enchantment on a ring crafted at the Tanning Rack.",
  "descriptionHtml": "This mod is a patch for Anton and Sunspot2&#39;s Animated Fairy Wings. Its based off my original work on [url=https://www.nexusmods.com/skyrim/mods/87884/?]DragonWingRings [/url]but adapted to work with the Fairy Wing mod instead. I know there is already a way to enchant a ring with the magic effect via console, but I wanted something a little more immersive and permanent. I created this patch which allows the player to make a ring with an enchantment version of Anton&#39;s fairy wings spell effect. The ring can be crafted at the Tanning Rack and the effect can be used simply by equipping/unequippng the ring. This also works on followers and the effect can be dis-enchanted and put on any other piece of armor/jewelry. Furthermore, if the wings ever disappear off of a follower, you can simple take and give back the object to get the wings to reappear.\r<br />\r<br />----Requirements----\r<br />Anton and Sunspot2&#39;s Animated Fairy Wings found [url=https://www.nexusmods.com/skyrim/mods/62612/?]here[/url].\r<br />\r<br />----Reccomendations----\r<br />[url=https://www.nexusmods.com/skyrim/mods/85366/?]Alternate Colors for Animated Fairy Wings[/url] by halanich.\r<br />\r<br />----Installation----\r<br />Simply copy the FairyWingRings.esp to your Data directory and enable it in your favorite Mod Manager (I use WryeBash);\r<br />\r<br />----Load Order----\r<br />Make sure this mod is loaded AFTER Animated Fairy Wings.\r<br />\r<br />----Uninstall----\r<br />This *Should* uninstall cleanly by simply deleting the esp. However, this has not been thoroughly tested.\r<br />\r<br />----Note----\r<br />Please note that I used the message given on the &#34;Credits and Permissions&#34; tab on the Animated Fairy Wings Nexus Page as the basis for my assumption that publishing this mod was allowed. If that is not good enough please let me know immediately and I will remove the mod until more explicit permission is attained. I have uploaded a screenshot of the permissions tab to which I refer in the images section of this mod page.",
  "categoryId": "51",
  "version": "1",
  "author": "Skyrimfan5",
  "createdUnix": "1510693800",
  "updatedUnix": "1510693800",
  "containsAdultContent": false,
  "uploadedBy": "Skyrimfan5",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000259714",
      "name": "FairyWingRings",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "FairyWingRings-87885-1.zip",
      "uploadedUnix": "1510693791",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/90217fc59222fb8cef0938d9a29837c5f14bd52c7d32492a225465e77f85bf49/analysis/1510693982/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/FairyWingRings-87885-1.zip?fid=1000259714&ttl=1535876929&ri=8192&rs=8192&setec=ee22c6b5a308755d37c94aebf24211d1"
    }
  ]
}