{
  "modId": 87923.0,
  "modName": "gatti Bondage Type 1 Reinare CBBE (AND UUNP) HDT Bodyslide Conversion",
  "summary": "a CBBE HDT Bodyslide conversion of the Reinare light armour originally published by gatti2012, with the NEWLY ADDED pleasure of UUNP",
  "descriptionHtml": "This mod was originally released by gatti2012 and though it didn't include HDT or Bodyslide support was quite popular and sports just over 27 000 downloads.\n<br />\n<br />I'm still learning the ropes as a noob modder, I hope that the practice i get with these conversions (this is my second one), so graciously allowed by the original authors, I will one-day release big and popular mods of my own.\n<br />\n<br />Hopefully soon.\n<br />\n<br /> ( Funny enough, this was gatti's second mod as well)\n<br />\n<br />For now, I hope that this small mod gives u hours of bug free enjoyment.\n<br />\n<br />********* Especially now that i've added a UUNP conversion as well. Full weight slider and bodyslide support.\n<br />\n<br />* Be WARNED contains nudity and is for adults only\n<br />\n<br />* Does not support beast races, however my character( Valiin Stormbolt) is an Altmer, and I experienced no problems. If it also works with Bosmer/ Orsimer, pls let me know. My UUNP character however is a Nord, but same applies.\n<br />\n<br />* Craft-able in \"LEATHER\" Category ( Due to my mods mine shows up in the \"Draugr category\"  just look around or hit the console. \n<br />\n<br />* Can be improved at the work bench\n<br />\n<br />* Can be enchanted\n<br />\n<br />GIMME SOME SCREENIES, I WANNA SEE YOUR GIRLS USIN IT\n<br />\n<br />** Currently learning more about blender and so on, want to turn this into a modular armour with at least 7 parts. ( might take a while, but i'll get there) not there yet  :(\n<br />\n<br />*** PS Remember to endorse if u like the mod\n<br />\n<br />**** I'm going to step away from CBBE for a while back to UUNP so you might see UUNP conversions soon, now working on my jewelry conversion \n<br />\n<br />* A LITTLE OFF TOPIC: I RECENTLY INSTALLED A RATHER SYSTEM TAXING MOD THAT MADE IT ALMOST IMPOSSIBLE FOR ME TO PLAY MY GAME. EVEN WHEN I ONLY THOUGHT OF TOUCHING MY KEYBOARD CTD, UPON CTD UPON CTD. I HAD MY GAME BY THE SHORT HAIR READY TO SHOOT IT IN THE FACE WHEN I FOUND THIS ( https://youtu.be/kdar8cIGd24 ) I HOPE YOU WILL FIND IT AS USEFUL AS I DO. NOW I RUN AT ULTRA SETTINGS WITH ENB AND VIVID WEATHER ISTALLED WITH HARDLY A STUTTER. NO CTD AT ALL FOR ALMOST 11 HOURS OF PLAY TIME. GAME ON!\n<br />\n<br />PPS I have identified a little clipping behind the knee at times, and will fix and update as soon as i have time. Real life u know. Still pending ........",
  "categoryId": "54",
  "version": "1.1",
  "author": "vossie69",
  "createdUnix": "1510869560",
  "updatedUnix": "1512686455",
  "containsAdultContent": true,
  "uploadedBy": "vossie69",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000259867",
      "name": "Gatti Bondage 1 Reinare Conversion",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3176",
      "fileName": "Gatti Bondage 1 Reinare Conversion.zip-87923-1-0.zip",
      "uploadedUnix": "1510869322",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/32ccf24393d1cbecaf965fdc0f6c600da708c42ca31e50b6f5d209702bf72ba8/analysis/1510869374/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gatti%20Bondage%201%20Reinare%20Conversion.zip-87923-1-0.zip?fid=1000259867&ttl=1535876972&ri=8192&rs=8192&setec=bc09b1ac67a6c289d9faba2eba4acc20"
    },
    {
      "fileId": "1000261447",
      "name": "Gatti Bondage 1 Reinare UUNP Conversion",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8803",
      "fileName": "Gatti Bondage 1 Reinare UUNP Conversion-87923-1-1.zip",
      "uploadedUnix": "1512686455",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/c1063173b77beb2ca28d4a2b40734ef61c119e01317894b4b9253f9aacf3df7d/analysis/1512686493/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Gatti%20Bondage%201%20Reinare%20UUNP%20Conversion-87923-1-1.zip?fid=1000261447&ttl=1535876973&ri=8192&rs=8192&setec=0b41e37eb94bdb3d5a5ffa9bdd48a6fd"
    }
  ]
}