{
  "modId": 87935.0,
  "modName": "Fake Weapon",
  "summary": "This mod is add three spells, and change the part of the attack of Draugr.\r<br />Since we modified the setting of Draugr, it conflicts with the same setting change.\r<br />DLC Hearthfire is required&#33;",
  "descriptionHtml": "[size=3][b]※ Additional notes 追記: \r<br />Spell Tomes is in The Midden Dark.\r<br />[/b][b]呪文書はミッデンダークにあります。[/b]\r<br />[/size]\r<br />※日本語版は日本語版espフォルダからespを差し替えてくださいm(_ _)m\r<br />\r<br />※DLC Hearthfire is required&#33;　DLC Hearthfireが必要です！\r<br />\r<br />This mod is add three spells, and change the part of the attack of Draugr.\r<br />Since we modified the setting of Draugr, it conflicts with the same setting change.\r<br />このmodは3つの呪文追加と、ドラウグルの一部の攻撃を変更します。\r<br />ドラウグルの設定に手を加えているため、同様の設定変更と競合します。\r<br />\r<br />Fake Weapon (Illusion)　フェイクウェポン(幻惑魔法)\r<br />Replace the wooden sword (fake sword) with the enemy target weapon and reduce attack power. Involving multiple targets in Dual Casting.\r<br />It does not work for non-human NPCs (creatures, Automatons, dragons etc). Please note that Illusion skills are not applicable to high enemies.\r<br />木製の剣フェイクソードを敵対象の武器と差し替え攻撃力を低下させる。二連の唱えで複数の対象を巻き込む。\r<br />人間以外のNPC(クリーチャー、オートマトン、ドラゴン等)には効かない。幻惑のスキルが高い敵には通用しないので注意。\r<br />\r<br />Bound Sword Other・Bound Battleaxe Other(Conjuration)　他者魔力の剣・他者魔力の両手斧(召喚魔法)\r<br />Give Bound Sword and Bound Battleaxe to friendly NPC. If the player has learned Mystic Binding Perk it turns into a purple weapon.\r<br />The attack power of Bound Battleaxe by Mystic Binding is 25, which is stronger than the conventional one.\r<br />In addition, if you master Daedric Smithing Perk of Smithing skill together, it becomes legendary class of attack power. (25 for sword, 40 for Battleaxe)\r<br />In addition, Bound Sword can be dual wielding by giving it separately to the left and right.\r<br />魔力の剣、魔力の両手斧を友好NPCに付与する。プレイヤーが魔力の収束Perkを習得していれば紫色の武器に変わる。\r<br />魔力の収束による魔力の両手斧の攻撃力は25と、従来ものより強くなっている。\r<br />更に鍛冶スキルのデイドラの鍛造術Perkを一緒に習得していれば、伝説級の攻撃力になる。(剣は25、両手斧は40)\r<br />尚、魔力の剣は左右別々に付与することで二刀流に出来る。\r<br />\r<br />Replace Draugr&#39;s Disarm Shout with Fake Weapon\r<br />When this shout is received, it is replaced with translucent Ancient Nord BattleAxe. The attack power is the same as Ancient Nord BattleAxe.\r<br />Weight 300 is very heavy, it will become blunt until the player switches to switch weapons or time out.\r<br />If an ally is received, if you overwrite it with Illusion, the weapon may return to its original state.\r<br />If Illusion skill is high, it will not be affected.\r<br />ドラウグルの武装解除シャウトをフェイクウェポンに差し替え\r<br />このシャウトを受けると半透明の古代ノルドの両手斧に差し替えられる。攻撃力は古代ノルドの両手斧と同じ。\r<br />重量300でとても重く、プレイヤーが受けると武器を切り替えるか時間切れになるまで鈍足になる。\r<br />味方が受けた場合、幻惑術で上書きすれば武器が元に戻る場合がある。\r<br />幻惑スキルが高ければ影響を受けない。\r<br />\r<br />Weapon color change was made with reference to some blogs.\r<br />Although it is not unique mod using the specification of the game, thanking you in advance.\r<br />武器の色変更はいくつかのブログを参考に作成しました。\r<br />ゲームの仕様を利用したユニークでないmodですが、宜しくお願いします。",
  "categoryId": "75",
  "version": "1.0",
  "author": "Ochiyusha",
  "createdUnix": "1510926732",
  "updatedUnix": "1510926732",
  "containsAdultContent": false,
  "uploadedBy": "ochiyusha",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000259910",
      "name": "Ochi02_FakeWeapon_1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "161",
      "fileName": "Ochi02_FakeWeapon_1.0-87935-1-0.7z",
      "uploadedUnix": "1510926046",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b83600ff162006140ce0f6750d5c8f6f6a6ebce5e13a7ba49e7a68e5cd4db1ee/analysis/1510926302/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Ochi02_FakeWeapon_1.0-87935-1-0.7z?fid=1000259910&ttl=1535876986&ri=8192&rs=8192&setec=f60cd7549f101dcfb10105951cb548b7"
    }
  ]
}