{
  "modId": 88001.0,
  "modName": "Male HouseCarls - Enhanced - DELETED",
  "summary": "A small mod that addresses male Housecarls having exact same stats as females. Improves starting stats of the two male housecarls and adds well-fitted perk. This gives much needed variety and realism to housecarls, which in vanilla, all have identical starting stats.",
  "descriptionHtml": "[center][size=4][b]Male Housecarls - Enhanced [/b][/size]\r<br />\r<br />\r<br />Purpose: Most may not realize it, but the male Housecarls in Skyrim have the exact same stats and profiles as all the female ones. Argis the bulwark for example, is a sword and shield &#39;bulwark&#39; and his in-game appearance matches his description. Problem is, his stats and specs, don&#39;t. He has no more sta and HP than say, Rayya, or Lydia. Likewise Gregor  and Calder. Identical stats to all female housecarls. Interestingly,  only Valdimar alone, has any kind of scaling to set him apart, and does have lower HP and stam to reflect the fact he is a sorcerer.\r<br /> Outside of that one case, ALL the other housecarls use the same template. \r<br />\r<br />\r<br />This mod simply gives the male housecarls, Argis (Markarth) and varied, increases in hp and sta and a perk to more accurately reflect the differences between males and females.\r<br /> \r<br />Their boosted stats, and increased defence will give players some incentive to give them a try now that there is an actual reason to want to pick them. That is the idea anyhow. In reality, ALL the housecarls could have been made a lot more &#39;distinct&#39; with very little effort on bethesda&#39;s part. But as we all know, Bethesda is just a small indie studio, operating out of a drafty studio in the warehouse district, and couldn&#39;t afford refinements like semi-differentiated npcs. \r<br />\r<br />[size=3]Changes[/size]\r<br />\r<br /> Argis &gt;   Hit Points to 265 Stam to 125\r<br />Calder &gt; Hit Points to 245 Stam to 105\r<br />Gregor &gt; Hit Points to 225 Stam to 100\r<br />\r<br />Vanilla: 205/80\r<br />\r<br />All warriors also been given the Well Fitted Perk.\r<br />\r<br />\r<br />So in terms of stats, Argis, will be the &#39;best&#39; tank of all the Housecarls.  \r<br />\r<br />Installation\r<br />\r<br />Requirements: USLEEP - Hearthfire\r<br />\r<br />Just install and activate. That is all. Recommend new game. Best to install this before you met, or acquire these followers.[/center]",
  "categoryId": "33",
  "version": "1.0",
  "author": "Mebantiza",
  "createdUnix": "1511305182",
  "updatedUnix": "1511305182",
  "containsAdultContent": false,
  "uploadedBy": "Mebantiza",
  "primaryFile": null,
  "files": []
}