{
  "modId": 8804.0,
  "modName": "The last Dwemer - an alternative beginning",
  "summary": "A mad mage sent you into the future. A future without your people. What will you do?  \r\n",
  "descriptionHtml": "Contents: \r\n\r\nI. Warnings / Requirements\r\n\r\nII. Backstory\r\n\r\nIII. Game Conditions \r\n\r\nIV. Installation\r\n\r\nV. Deinstalation\r\n\r\nVI. Thanks\r\n\r\n\r\n\r\nIa. Warnings\r\n\r\n[color=\\\"red\\\"]Crappy english warning:\r\nMany apologies for my bad english and the ramshackly story that follows, but I am not a native speaker. I hope you get the idea anyway.[/color]\r\n\r\n[color=\\\"Green\\\"]Lore Alert: \r\nThe premise of this save and the backstory contradict official TES-canon. Of course they do. It\\'s about a dwemer in modern skyrim times, and the dwemer are long extict. If you can\\'t live with that, this mod is not for you. To make it easier I added the explanation how Chenzel got here in form of a backstory. It may be not high literature, but if you don\\'t like it, you are free to make up your own.\r\nFor the sake of keeping this a simple savegame, and not a total conversion mod with lots of custom sound files and scripting, you can magically understand the language of the local people.[/color]\r\n\r\nTechnical Alert:\r\nThere are some reports of game crashes when loading the save. I have no idea why this happens for some people. I\\'ll try using alternative methods to produce other save files, maybe that helps.\r\nIf none of the savegames work for you, try downloading the \\\"Do it yourself guide\\\" in the file section. With it\\'s help you can reproduce the game yourself. \r\n\r\n\r\n\r\nIb. Requirements and Recommendations:\r\n\r\n[color=\\\"red\\\"]Requirements:\r\nDwemer race - without this the save wont work. I used v09. Higher versions not supported.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=8341[/color]\r\n\r\nRecommended\r\nLore Friendly Armors - if you want to make a thief or mage out of your last dwemer, the \\\"dwarven mage armor\\\" is a light armor that fits the dwemer like a glove.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=6684\r\n\r\nWeapons of the third era - Weapons the dwemer are familiar with.\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=3871\r\n\r\n\r\nII. The Backstory\r\n\r\nPrologue:\r\nYou were born and raised in acient times, when dwemer and falmer lived somehow still in peace, but the falmer already began to realize the dwemer oppression. You lived long before the dwemer even planned to set in motion what later led to their demise and almost complete extinction.\r\n\r\nOn the first day of your aduld live - you just gained your ceremonial dwemer plate and sword - your father sent you south to a tower where a strange and excentric falmer mage named Aspurgir lived. The falmer are faithful servants of your people, the dwemer lords, or so you thought. You father sent you to get a potion that helps with his nasty skin disease.\r\n\r\nBut short after you get into the unguarded tower - Falmer are a bit naive - Aspurgir bombarded you with insults and strange accusations, that the falmer are slaves of the dwemer. The mage even babbled something about a revolution. You wanted to calm him, after all he was a great asset to the people of your kind and especially your family.\r\nBut he suddenly lay a spell upon you, and vanished into the thin air.\r\n\r\nFor a moment you stood irritated in his study, until you noticed that not only the mad Aspurgir was gone, but the study looked quite different now. There was scrap metal lying all about, and on the desk of the mad mage lay a book with strange letters. This is not the falmer alphabeth. You went to the nearby balcony door, and took a look at the area. This was not where you were just moments ago. Where are the patrols? Where is your horse? And where by oblivion are you?\r\n\r\nAlternative Version: \r\nFor those who have problems loading the save I produced two \\\"hopefully fail safe saves\\\". Other than the main file they start in helgen, right after you got your hands unbound. \r\nThe imperials caught you walking aimlessly near Rechwind Eyrie when they just fought with some of those stormcloak guys. They mistook you for a dunmer mercenary hired by the stormcloaks, and took you to helgen. Just when you were to be executed, a dragon attacked. Those strange people had no idea what to do against dragon attacks, it was disgracefull, but you managed to get to the keep. \r\nLuckily you got your dwarven gear back, the only helpful person here, a guy named Hadvar gave it to you, but you have to fight your way out of the keep with him. \r\n\r\nIt\\'s your choice: \r\nWhere do you go? How will you interact with those strange people that now live in your land? Will you seek out the near dwemer city markarth? Surely there must be some of your people? Or do you visit the excavation camp around the ancient skyforge, that archeologists shortly dug from the ground?\r\n\r\nCharacter description:\r\nYou are relatively young for a dwemer, but lived in a time when your people had vivid contact with other races. You know of the dunmer, the falmer, even the altmer and you have heard about that nord people, that lately cause so much trouble for your people. You wont know about any imperials, stormcloaks and you never saw an argonian or khajiit.\r\n\r\n\r\nIII. Game Conditions: \r\n\r\n- main quest is disabled\r\n- Helgen is malfunctioning, you can go there but it\\'s closed off. I don\\'t recommend going there.\r\n- You don\\'t have any money nor valuables. That\\'s partly because you start with armor and weapon wich are way better than first level stuff.\r\n\r\nIV. Installation: \r\nDownload the DWEMER RACE MOD and install it, then extract the save file and put it in your save folder. It\\'s not in Steam but in \\\"My Documents/My Games/Skyrim\\\".\r\n\r\nAgain: Dwemer race can be found here ---> Use v09. http://skyrim.nexusmods.com/downloads/file.php?id=8341\r\n\r\nV. Deinstallation:\r\nIt\\'s just a save, just delete it in game, or put the save file into your trashcan.\r\n\r\n\r\n\r\nVI. Thanks: \r\nThe idea for this save gave me \\\"A humble start\\\". You can find it here: http://skyrim.nexusmods.com/downloads/file.php?id=6089 Check it out!\r\n\r\nIf you want to create your own alternative start, look here:\r\nhttp://skyrim.nexusmods.com/downloads/file.php?id=5720\r\nThere is an alternative save and a description on how to do it.\r\n\r\n\r\nMany thanks for the initial ideas and resources to:\r\n\r\nMshai,\r\nrahman530,\r\nSuperJesusV\r\n\r\nand\r\n\r\n747823\r\n",
  "categoryId": "43",
  "version": "1.1",
  "author": "Druesling ",
  "createdUnix": "1328922205",
  "updatedUnix": "1329011575",
  "containsAdultContent": false,
  "uploadedBy": "Druesling",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28673",
      "name": "Chenzel the Dwemer",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "825",
      "fileName": "Chenzel the Dwemer-8804.7z",
      "uploadedUnix": "1328922387",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8016be7ee88bf527d146c68808e5739b9bce810aa88b681acaac411b4fa3ef45/analysis/1406668443/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Chenzel%20the%20Dwemer-8804.7z?fid=28673&ttl=1535767874&ri=8192&rs=8192&setec=f243848e0d4507edd27ec89a4ff65fc6"
    },
    {
      "fileId": "28786",
      "name": "Two alternative Saves - Chenzel and Chenzella",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1936",
      "fileName": "Two alternative Saves - Chenzel and Chenzella-8804.7z",
      "uploadedUnix": "1328937154",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6704e0994dd468b7aa6b859ce18073ee95d51bee6ce2eb842babb3f15db2faba/analysis/1406668983/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Two%20alternative%20Saves%20-%20Chenzel%20and%20Chenzella-8804.7z?fid=28786&ttl=1535767874&ri=8192&rs=8192&setec=909f8703441ac1e54cea430bd3b0778b"
    },
    {
      "fileId": "28907",
      "name": "Hopefully fail safe save with active main quest",
      "version": "1.2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2438",
      "fileName": "Hopefully fail safe save with active main quest-8804-1-2.zip",
      "uploadedUnix": "1328967267",
      "modVersion": "1.2",
      "virusScanUrl": "https://www.virustotal.com/file/6c5b19092364796a3fa87c860b000a41c21fea29b55a6f8fee53bd0732093bea/analysis/1406669588/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hopefully%20fail%20safe%20save%20with%20active%20main%20quest-8804-1-2.zip?fid=28907&ttl=1535767874&ri=8192&rs=8192&setec=2a12d91c670253e245757993b9bffb95"
    },
    {
      "fileId": "29025",
      "name": "Compatibility Save with Dunmer posing as Dwemer",
      "version": "0.87b",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1222",
      "fileName": "Compatibility Save with Dunmer posing as Dwemer-8804.7z",
      "uploadedUnix": "1328981912",
      "modVersion": "0.87b",
      "virusScanUrl": "https://www.virustotal.com/file/2a27828932303cff9e30edb77bcb5a8eab6b3bd459ff2f49ff444b98ad47e7af/analysis/1406670251/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Compatibility%20Save%20with%20Dunmer%20posing%20as%20Dwemer-8804.7z?fid=29025&ttl=1535767875&ri=8192&rs=8192&setec=931da6d5b65ae0a80609bde246eb51e6"
    },
    {
      "fileId": "29285",
      "name": "Guide to produce your own Dwemer Save",
      "version": "2.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Guide to produce your own Dwemer Save-8804-2-0.7z",
      "uploadedUnix": "1329011575",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/cbfc940fd4e7a6d62320613f22d9d4e9ee5bff4bb4439b1b3ea7b209309df3b6/analysis/1406671752/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Guide%20to%20produce%20your%20own%20Dwemer%20Save-8804-2-0.7z?fid=29285&ttl=1535767876&ri=8192&rs=8192&setec=d3aca3aa04561f7cd99e5b969d6cda29"
    }
  ]
}