{
  "modId": 8806.0,
  "modName": "Anceril",
  "summary": "Adding a dungeon for your beautiful home in Soltitude.",
  "descriptionHtml": "--------------------------------------------------------------------------------------------------------------------------\r\nthis mod has a LOOOOOOOOOONNNNNNGGGGGG way to go. But I have many ideas for this mod.\r\nSo far heres my list\r\n-Dungeon (mabye 8%)\r\n-New world (0%)\r\n-new towns (0%)\r\n-new weapons (0%)\r\n-new armour (0%)\r\n-new enemies (0%)\r\n-A HUGE dungeon (0%)\r\n-some Lore for my world (1%)\r\n-lots of new books (0%)\r\n-new large quest (0%)\r\n-a team to help me (0%)\r\n-good knowledge of skyrims Lore (80%)\r\n\r\n--------------------------------------------------------------------------------------------------------------------------\r\n                                                            Lore Of Anceril\r\n     Anceril is a secret world of The falmer\\'s (Blackreach, but more like a homeworld) A group of Nomads had gone and looked for it long ago but never returned. The world of anceril was said to be a Giagantic battleground between the falmer tribes that inhabited it. When one tribe of falmers finally came out on top and made a big civilization. They did this by using the legendary sword Turantil. This sword was suposed to be the most powerful thing ever created. Forged by the gods in the sky imbued with the power of hell, the sword is meant to be legendary. The world was never found within human records, Nor were the humans who went looking for it.\r\n--------------------------------------------------------------------------------------------------------------------------\r\n                                                           What This Mod Is\r\n     The entrance of the world of anceril has been found. You can decide wether or not to go into this magical world of the falmers. Will you find magical powers beyond your imagination, Or a slow painful death making life not worth living. This is your destiny to create.\r\n--------------------------------------------------------------------------------------------------------------------------\r\n     I would love any help i can get. Dont say anything in comments, I might not see it, But instead send me a message.\r\nSo far i need\r\n-Coder (I am not very good with code but can work my way around the site, I am learning... proabably as your reading this)\r\n-Modeler (spell fail... i think.)\r\n-Texture master\r\n-level designer (can do without im pretty much doing this)\r\n\r\nthats i can think of at the moment.\r\nI cant promise you money. I cant promise you rewards (unless we happen to win a contest). I AM under 18. But what i can promise you is that i plan on making this BIG. I do happen to want to be a lead designer for bethesda (Mabye one day.) i want to be noticed in the modding comunity so i can promise you a chance at fame, or a good chance at a job somewhere.\r\n--------------------------------------------------------------------------------------------------------------------------\r\n                                             What I Have Done So Far\r\n-creating first floor of dungeon (75%)",
  "categoryId": "88",
  "version": "0.001",
  "author": "Ningauble",
  "createdUnix": "1328922695",
  "updatedUnix": "1328922695",
  "containsAdultContent": false,
  "uploadedBy": "Ningauble",
  "primaryFile": null,
  "files": []
}