{
  "modId": 88096.0,
  "modName": "Natural Children - RS Children and Vanilla",
  "summary": "Originally packed with Real Women of Skyrim, now released as it's own mod. This makes the children look more realistic and natural. NOT FOR EVERYONE.",
  "descriptionHtml": "Kids are supposed to be cute and soft and squishy and edible!\n<br />\n<br />[b]Not anymore![/b]\n<br />\n<br />This makes children look more realistic. Immersive. And like they're living in an extremely cold environment with less to eat due to strife and civil war. Considering most are orphaned, I felt this was much more immersive.\n<br />\n<br />[b][size=4]Compatible with all child replacers (RS Children, TK Children, Xvision Children, Dolls - Children Overhaul) as well as vanilla children, and 'new children'. Just pick the one you use in the downloads.\n<br />\n<br />Dirty version also available in downloads.\n<br />(vanilla version does not replace body. Download 'new children' and let my files overwrite)\n<br />\n<br />[/size][/b]I use RS Children, personally. And I absolutely love it! However, the skin just didn't match my skin overhaul at all. So, I fixed that!\n<br />There was an alpha version released with Real Women of Skyrim. This one is different, however shares the same concept. I realized that maybe MxR was right, and the children did look a little 'dead'. So I gave them a bit more color... But not enough to stray from what my mods are about: REALISM. \n<br />\n<br />Blah blah. I'm too tired to give an in depth description.\n<br />\n<br />[size=4][b]This will make your children lore-friendly, and probably sick looking. But hey, it's realistic.[/b][/size]\n<br />\n<br />[color=#ff7700][b]Don't think so?[/b][/color]\n<br />No one is forcing you to download this.\n<br />\n<br />[b][color=#ff7700]Why do they have underwear on?[/color][/b]\n<br />So pedophiles like you don't wank it to 8 year olds.\n<br />\n<br />[color=#ff7700][b]They're not cute and squishy anymore![/b][/color]\n<br />They haven't eaten anything in weeks because their parents were killed by imperials.\n<br />\n<br />[color=#ff7700][b]Why do they look like skooma heads?[/b][/color]\n<br />They probably are.\n<br />[b][color=#ff7700]\n<br />This isn't realistic! No one looks like that![/color][/b]\n<br />I took pictures of [b]MYSELF[/b] and used them as stock in creating [b]ALL[/b] of my textures. [b]IT'S LITERALLY MY OWN FACE WITHOUT MAKEUP, TWEAKED TO FIT THE TEXTURES.[/b]\n<br />\n<br />I don't feel like explaining myself anymore. Don't like it? Don't download it. Simple as that. People like different things. You like your barbie mods? Some people don't. This is a FREE mod. No one is forcing you to download anything. I spent YEARS creating these to release FOR FREE. I could just as easily charge for it somewhere else, but I choose not to. I work a full time job, a full time apprenticeship, and go to school full time. Yet I spend [b][i]every bit[/i][/b] of my free time doing this for people who actually want to use it. The hate I've received for creating these textures is exhausting.\n<br />There's also a function to only show 'not lore-friendly' mods. I suggest you use it.\n<br />\n<br />However, the love I've received has made it all worth-while... So thank you. Those of you who enjoy using my textures make everything I do have meaning. You encourage me to never give up doing what I love.\n<br />\n<br />[b][u]Have actual constructive feedback? Suggestions? Requests? Want to offer help? Leave a comment in the corresponding forum topic (up top, click \"Forum\")\n<br />\n<br />\n<br />\n<br />\n<br />[/u][/b]By the way... I'm female. Not that it matters, but being called a dude is weird.",
  "categoryId": "94",
  "version": "1.0",
  "author": "Gearhog",
  "createdUnix": "1511733357",
  "updatedUnix": "1511733357",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": []
}