{
  "modId": 88103.0,
  "modName": "Cooking Matters",
  "summary": "If you’re like me, you were disappointed with the functionality of cooking in Skyrim. This mod makes you WANT to use the cooking mechanisms in the game and eat the food you produce. After all, real food doesn’t stop working as you age, so why should it stop helping your character as you level? ",
  "descriptionHtml": "[size=4]=-=-=-=-=-=-=[b][u]COOKING MATTERS[/u][/b]=-=-=-=-=-=-=[/size]\r<br />\r<br />\r<br />If you’re like me, you were disappointed with the functionality of cooking in Skyrim’s vanilla release. Food became obsolete before level five, and you spent the rest of your levels wandering around the world, ignoring food and drinks as part of the clutter even as you lamented their potential usefulness. If you chose not to play as an alchemist, you were even worse off, limited to the potions you could find in dungeons and on shopkeepers. Then came the realism mods – slew after slew of plugins designed to make food relevant again by making you “need” to eat and drink. \r<br />\r<br />This mod has a different approach. It aims to make you WANT to use the cooking mechanisms in the game and eat the food you produce. Cooking Matters also incorporates the many alchemical ingredients that make sense in a cooking context, and allows the effects of those ingredients to play a role in your food as well as your potions. All existing recipes have been reworked to suit the level 1-15 experience, and many new recipes have been added, designed to provide a balanced experience from level 1 through level 50 and beyond. After all, real food doesn’t stop working as you age, so why should it stop helping your character as you level? \r<br />\r<br />\r<br />Notes:\r<br />This mod does not replace or diminish the role of Alchemy in the game. It is simply intended as another option for those who prefer to play non-Alchemists but still wish to make use of the bounty of ingredients Skyrim has to offer. \r<br />\r<br />There is no effective way to make health/stamina/magicka restoration scale with player level. I have worked around this by making food increase your character’s base regeneration rate for one second, calculated to return approximately 20% of the maximum amount. This produces an experience somewhat less powerful than the built-in potions and their level approximations; however, it causes some pretty funny-looking item descriptions. Please don’t be skeptical about the big numbers&#33;\r<br />\r<br />A big round of thanks goes to CaptainRC and his “Be A Milk Drinker” mod for the idea of juices. I do have designs on updating this mod in the future to incorporate milk with some of his ideas, but not until I figure out how to make it harvestable from cows&#33;\r<br />\r<br />\r<br />\r<br />[size=3]=-=[b][u]11/27/2017 Publish Update - Ported to Nexus from Workshop[/u][/b]=-=[/size]\r<br />\r<br />[list]\r<br />[*]Finished fleshing out base game food item overhaul. \r<br />\r<br />[*]Reworked some existing food items and recipes to more closely align with underlying design philosophy. \r<br />\r<br />[*]Still to come: Quality-of-life fixes, further recipes for default-uncraftable food and drink items like Long Taffy Treat, White-Gold Tower, etc. \r<br />\r<br />[/list]\r<br />KNOWN ISSUES:\r<br />[list]\r<br />[*]Yes, the 4000%-for-one-second thing still looks dumb and makes the text on some items really small. There is unfortunately no way around this if your goal is a piece of food that scales with level. \r<br />\r<br />[*]The model for Fiery Clams is incorrectly a fish steak. I will probably not fix this unless I&#39;m really bored. \r<br />\r<br />[*]No recipes introduced in Hearthfire, Dawnguard, or Dragonborn have been altered. This may change in possible future updates.\r<br />[/list]",
  "categoryId": "100",
  "version": "1",
  "author": "Lass Giselle",
  "createdUnix": "1511772191",
  "updatedUnix": "1511772191",
  "containsAdultContent": false,
  "uploadedBy": "laloria",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000260669",
      "name": "Cooking Matters",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9",
      "fileName": "Cooking Matters-88103-1.zip",
      "uploadedUnix": "1511772157",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/55173c631a30eca1ec91e148c1f18571a641ce1ebb019e975236b3879eabc26c/analysis/1511772182/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cooking%20Matters-88103-1.zip?fid=1000260669&ttl=1535877179&ri=8192&rs=8192&setec=6021bb203297929e8617521145cf2de3"
    }
  ]
}