{
  "modId": 8812.0,
  "modName": "Vampire Daywalker and Armor",
  "summary": "Adds a Vampire Daywalker & Armor set to the game.",
  "descriptionHtml": "Version 2.0 Now Released. With refined values, upgradable and addition of an amulet\r\nPlease Endorse if you like the mod.\r\n\r\n===Lore===\r\nAn ancient vampire who once stalked the lands outside of Whiterun over 100 years ago is back.\r\nShe was driven from her home in Fort Greymoor by a large group of bandits over a decade ago.\r\nSince then she has perfected her undead lifes work and created the first and only piece of Daywalker Armor. This armor allows her to walk in the sun without the reduction to her health, magicka and stamina. It also protects her from the weakness to fire that all vampires suffer from inherently. Now she sets out to reclaim her ancient home from the bandits.\r\n\r\n===Information===\r\nThis is NOT an easy encounter and not advised for anyone at a low level. It is this way by design and it is rare to find many people at low level who have encountered vampires and contracted and advanced through the stages of Vampirism. And while I dont discourage you from trying to fight her I will advise that you wait a little while.\r\nShe also carries a unique daedric sword which drains stamina. Coupled with her vampiric abilities it makes her one tough customer.\r\nThe light version of the armor will spawn in Fort Greymoor to now instead of Cracked Tusk. \r\nShe now carries a Desecrated Amulet of Stendarr taken from a Vigilant of Stendarr who attempted to hunt her down. It comes with a lesser version of the Blessing of Namira and an improved block.\r\n\r\nShe will not respawn if killed, making the armor a once off for any player who wants a unique looking set of armor to enhance the vampire experience in Skyrim.\r\n\r\n===Weight and Armor Value===\r\nLight = Just below Glass Values\r\nHeavy = Just below Daedric Values\r\n\r\n\r\n---Enchants---\r\nEach piece has an individual enchant to increase resistance and boost sunlight stats. No daytime stats should be reduced.\r\nStage 4 Vampirism Negative Effects are :\r\nWeakness to Fire - Your vampiric blood makes you 100% weaker to fire.\r\nWeakness to Sunlight - Health, Magicka, and Stamina do not recover while in sunlight and are reduced by 60 points.\r\nWith fullset of armor your weakness to fire is reduced to 10% (I hope) and your Weakness to Sunlight should balance out so no negative 60.\r\n\r\nA great looking addition to the armor is a nice retexture by Sabroo and can be round here\r\nhttp://skyrim.nexusmods.com/mods/18435\r\n\r\n===Nexus Mod Manager===\r\nIssue is fixed (i hope!)\r\n\r\nIf you find any glitches or errors please let me know.\r\n\r\n(Im aware the boots are invisible with these robes, thats a vanilla problem, I\\'ll fix this asap with some different style boots.\r\n\r\n===Versions===\r\n1.0 - initial release\r\n1.2 - addition of light version & armor rating fix\r\n2.0a - addition of new weapon stats & amulet",
  "categoryId": "78",
  "version": "2.0b",
  "author": "Edg3",
  "createdUnix": "1328924066",
  "updatedUnix": "1329054034",
  "containsAdultContent": false,
  "uploadedBy": "Edg3k",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29585",
      "name": "Update for Heavy Version",
      "version": "2.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Update for Heavy Version-8812.rar",
      "uploadedUnix": "1329053999",
      "modVersion": "2.0b",
      "virusScanUrl": "https://www.virustotal.com/file/2cd1aca4e3023948306cce867be4e26b565fb0bd29b490f8aff7574af7786e52/analysis/1406673160/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20for%20Heavy%20Version-8812.rar?fid=29585&ttl=1535767891&ri=8192&rs=8192&setec=a758147fb2a492a2cc1a5d73cb41a7e0"
    },
    {
      "fileId": "29586",
      "name": "Update for Light Version",
      "version": "2.0b",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5",
      "fileName": "Update for Light Version-8812.rar",
      "uploadedUnix": "1329054034",
      "modVersion": "2.0b",
      "virusScanUrl": "https://www.virustotal.com/file/32b224e0d5b4541231b97bc08664de0eb6f30c72780b457cca42b3e09f66e7a1/analysis/1406673160/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Update%20for%20Light%20Version-8812.rar?fid=29586&ttl=1535767892&ri=8192&rs=8192&setec=3974e379e63e89221209a4ea7665c3bc"
    }
  ]
}