{
  "modId": 88125.0,
  "modName": "How to Fix Ugly Vanilla Hair in Racemenu",
  "summary": "A simple guide on fixing the jagged edges of vanilla hair without any modding experience needed!",
  "descriptionHtml": "[color=#ffff00]I was just diagnosed with a life threatening &amp; chronic condition that may prevent or slow down future updates (possibly stop depending how advanced it is, and how treatment goes). I apologize in advance. If you have any questions or concerns, please feel free to direct message me.[/color]\n<br />[color=#ffff00]For now, I am going to try my best to do as much as I can... But please be patient and gentle with me in my fragile state.[/color]\n<br />\n<br />[b][color=#ffffff](I am posting this on all my mod descriptions)[/color][/b]\n<br />\n<br />[center][color=#ffe599][size=3][b][color=#ffffff][i][color=#ead1dc][url=https://www.patreon.com/gearhog][img]http://i68.tinypic.com/2lmbaqr.png[/img]\n<br />[/url][/color][/i][/color][/b][/size][/color]Become a Patron to receive updates before they're released!\n<br />You can also get things that will never be released![/center]\n<br />\n<br />I absolutely love the look of vanilla hair for some reason... but those jaggies drive me crazy. One day I noticed while in the sculpt menu that I could toggle the editability of a vanilla hair mesh... and BAM! Smooth hair. I've been using RaceMenu by expired since release, and I absolutely love the sculpting function. I thought I'd point something out to those who like the overall idea of vanilla hair, but can't stand the low poly jagged mess.\n<br />\n<br />This guide is super simple. I've included pictures to make understanding it easier. \n<br />\n<br />Honestly, I'm amazed I haven't seen something like this before.\n<br />\n<br />[color=#00ffff]Racemenu by Expired6978 is required and can be downloaded [url=https://www.nexusmods.com/skyrim/mods/29624/?]here[/url].[/color]\n<br />[color=#00ff00]No other mods are required![/color]\n<br />\n<br />Keep in mind I'm using vanilla hair textures in the guide, so it isn't quite as pretty as it'd be while using [url=https://rd.nexusmods.com/skyrim/mods/36510]Superior Lore-Friendly Hair[/url]. I recommend downloading it, or one of the other mods that make the hair less.... whatever it is. I simply forgot to activate it while changing up my mod list.\n<br />I also recomment [url=https://rd.nexusmods.com/skyrim/mods/78669/?]Hallgarth's Hair[/url], which adds vanilla style hair to the game for the player character. Sorry I forgot to add this before! Completely slipped my mind. Go give it a download, and don't forget to endorse.\n<br />\n<br />[color=#ff7700][size=3][b]Things you need to know:[/b][/size][/color]\n<br />[list]\n<br />[*]This [color=#ffff00]will not[/color] work on KS Hairdos for some reason. No idea why.\n<br />[*]This [color=#00ff00]will[/color] work on most, if not all, ApachiiSkyHair (haven't tested this extensively, however the ones I have tested it on did work)\n<br />[*]This [color=#ffff00]will not[/color] affect NPCs. Sorry, guys... I wish it did, but just like sculpting the face and using sliders in Racemenu, it only affects that character, and that character alone. This also means that if you want other characters to have these changes, you have to do the same thing for each one. Tedious, I know... but worth it.\n<br />[*]This is just for editing the hair in RaceMenu. Sculpting a face is the same general idea, however more in depth (I don't recommend using such a large radius brush, for example).\n<br />[/list]This is my first tutorial, so be gentle. If something confuses you, feel free to send me a direct message and I will help as best I can.\n<br />\n<br />\n<br />\n<br />\n<br />All mods used in pictures (outside of RaceMenu) are from an unreleased mod (an 'upgraded' Real Women of Skyrim, if you will). It will be uploaded sometime this month. Currently have an impacted wisdom tooth that has become infected, so dealing with all that.\n<br />\n<br />All credits go to Expired6978 for the creation of RaceMenu.",
  "categoryId": "82",
  "version": "1.0",
  "author": "Gearhog",
  "createdUnix": "1511844280",
  "updatedUnix": "1511844280",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000260742",
      "name": "Tutorial - Main File",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "15884",
      "fileName": "How-To-Fix-Ugly-Vanilla-Hair-Tutorial_v1-0.7z-88125-1-0.7z",
      "uploadedUnix": "1511841599",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/15990af62ea9d4cac2fdf22f58fc5ae104e516ad2d969fd428652c6e510a3cbe/analysis/1511841719/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/How-To-Fix-Ugly-Vanilla-Hair-Tutorial_v1-0.7z-88125-1-0.7z?fid=1000260742&ttl=1535877201&ri=8192&rs=8192&setec=bc7b23d1d6f888716e3e3b95cf27c45b"
    }
  ]
}