{
  "modId": 88165.0,
  "modName": "Yeoman Archer Package",
  "summary": "\"Leave that fancy elven stuff to the elves.  What you need is home-tanned leather, straight-grained wood, and good Nord steel.\"<br /><br />This package is designed for a Yeoman Archer character concentrating on archery and stealth.  You can craft new arrows and wooden bows, as well as Lincoln Green clothing for stealthy movement in the woods.",
  "descriptionHtml": "\"Leave that fancy elven stuff to the elves.  What you need is home-tanned leather, straight-grained wood, and good Nord steel.\"\n<br />This package is designed for a Yeoman Archer character concentrating on archery and stealth.  You can craft new arrows and wooden bows, as well as Lincoln Green clothing for stealthy movement in the woods.  The package includes an archer's cabin player home west of Riften, and a camp south of Riverwood.  At the cabin you'll find new crafting equipment (a bowyer's bench for crafting archery equipment, and a loom for weaving clothing, cowls, and cloaks) as well as a familiar tanning rack, grindstone, and wood chopping block.  The cabin also includes a bed, a fire, cooking gear, and safe storage.\n<br />Most new equipment is keyed to the Archery skill tree.  Some new equipment is available at the tanning rack and forge, and much more can be made at the loom and bowyer's bench.  You will need at least Steel Smithing skill -- much of the new equipment is keyed to that perk so that it will be fully temperable.  Advanced Armors will let you make chain mail at any forge, and Arcane Smithing will give you silver weapons, but no other smithing perks are essential to this package.  Two-handed skill is useful, since you can craft a quarterstaff.  Perks in the Archery skill tree will make new bows and arrows available at the bowyer's bench (not at the forge), and additional arrows become available after some quests.  Necklaces of Sneaking and Circlets of Archery can be converted into suitable clothing, so that enchanting skills aren't necessary to use this mod effectively.  (Smithing and herbcraft are always useful, but I've tried to make this mod workable without skills which would be unusual in a backwoods archer.)\n<br />Most of the bows are faster than standard non-wooden bows.  Other than that, I haven't found that this package unbalances the game.\n<br />Installation:  use the Nexus Mod Manager, or copy the two YeomanArcherPackage esp and bsa files into your Skyrim Data folder and enable the esp file.\n<br />Required:  Skyrim, Hearthfire, and Dawnguard\n<br />Known issues:  There are some issues with clipping in third person view.  Khajiit and Argonian characters will have trouble with the cowls; their foreheads clip through the headgear badly.  Female characters will have some clipping at the shoulders with cloaks.\n<br />This package replaces my earlier \"Archer\" mod, though I'm leaving that up for anyone who prefers it.\n<br />Credits:\n<br />Most of the bows are based on Sessine's \"Better Shaped Longbows,\" posted by Lord Bishek at https://www.nexusmods.com/skyrim/mods/72456/?\n<br />The cloaks are adapted from Noodles' \"Cloaks of Skyrim,\" http://www.nexusmods.com/skyrim/mods/12092/?\n<br />The quarterstaffs are adapted from JZBai's \"Quarterstaff,\" https://www.nexusmods.com/skyrim/mods/25431/?\n<br />The loom marker is adapted from Jokerine's \"Misc Resources,\" https://www.nexusmods.com/skyrim/mods/53022/?\n<br />All are used by permission.\n<br />Other mods you might want to consider:\n<br />Chesko's \"Frostfall,\" https://www.nexusmods.com/skyrim/mods/11163/?  This excellent mod makes wilderness adventure more interesting.\n<br />Arthmoor's \"Alternate Start - Live Another Life,\" https://www.nexusmods.com/skyrim/mods/9557/?\n<br />and flo27's extension pack \"New Beginnings,\" https://www.nexusmods.com/skyrim/mods/70959/?\n<br />If you've already played through the main quest several times, these mods allow you to skip the opening scene in Helgen and begin with a different back story.  You can postpone the main quest as long as you'd like, or begin it at any time by exploring Helgen.",
  "categoryId": "78",
  "version": "1.0",
  "author": "blueboar",
  "createdUnix": "1512048204",
  "updatedUnix": "1512048204",
  "containsAdultContent": false,
  "uploadedBy": "blueboar",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000260938",
      "name": "Yeoman Archer Package",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "9837",
      "fileName": "Yeoman Archer Package.7z-88165-1-0.7z",
      "uploadedUnix": "1512048114",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a39ea3f9e4defb66f75816c484faa6fed72cd8f44738f87232136e89e9299d35/analysis/1512048158/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Yeoman%20Archer%20Package.7z-88165-1-0.7z?fid=1000260938&ttl=1535877259&ri=8192&rs=8192&setec=0f20a4fa6a07856024d0ec8ce8cfb242"
    }
  ]
}