{
  "modId": 88175.0,
  "modName": "Scottish Basket Hilt Broadswords II - DELETED",
  "summary": "A complete overhaul of our Scottish Basket Hilts Broadswords mod.  The mod adds 14 different metal variants of a traditional Scottish broadsword to the game.  All rendered in high def 2K textures.  Weapons are relatively balanced, and are slightly superior to vanilla swords of the same metal.  See desc for pics and types.",
  "descriptionHtml": "[color=#ffffff][size=3]Version 2 of the World-Renowned Scottish Basket Hilt Broadswords!  Now available in almost every metal in the game.  All swords are done \n<br />in 2K textures with remarkable depth. See for yourself in the \n<br />pictures. The ones with the gray background are from 3DS Max where they \n<br />were created.  The game shots are lower screen resolution.\n<br />\n<br />[/size][/color][color=#ffffff][size=3]As with the previous version, the blades’ design was inspired by the Cold Steel Scottish Broadsword:[/size][/color]\n<br />\n<br />\n<br />\n<br />[youtube]CfQ0tzYxIG8[/youtube]\n<br />\n<br />\n<br />  \n<br />[size=3]So, what is the story of these swords and their history in Tamriel you ask?\n<br />\n<br />[color=#ffd966][i]In Tamriel, Basket Hilt Broadswords originated in the Colovian Highlands.  The Nord smiths there used their incredible skills to combine metals and techniques from other cultures with traditional Nord crafting practices to create a sword almost on par with Akavari katanas.\n<br />\n<br />While Nords typically favor heavy two-handed weapons, the steep terrain of the Colovian Highlands creates the need for a quality one-handed weapon.  This enables the user to better keep their footing and not have to over-commit on a swing of their weapon.  The Basket Hilt Broadsword is lighter weight and stronger than a traditional sword of the same material and is so well balanced that the wielder is faster and lighter on their feet as well.\n<br />\n<br />As word of the revolt against the Empire and the Thalmor in Skyrim spread, Nord smiths began manufacturing and selling more of the swords to their brothers in Skyrim.  Sometimes even smuggling them in with Khajitt caravans. Rumor has it they’ve even trained some of the smiths in Skyrim in the art of crafting their remarkable blades. [/i][/color]\n<br /> \n<br />\n<br />My attempt at adding a bit of lore to the blades done, lets get to the details.  First, the mod was rebuilt from the ground up.  Swords include the following metals; Rusty Iron, Iron, Steel, Silver, Orcish, Dwarven, Nordic, Skyforge\n<br />Steel, Glass, Stalhrim, Ebony, Daedric, and Dragon Bone. \n<br />\n<br />The Skyforge Steel sword in particular is a masterpiece.  It has a Damascus steel finish and looks like dark steel at first, but at some angles you get a sort of deep purple reflection.  The whole sword slightly changes at different angles from slight hints of color to the way the pattern looks.  The scabbard is dragonscale as well.  Vioxsis did some truly amazing work there.\n<br />\n<br />All swords are fully craftable, temperable, and enchantable.  They have also had [u][b]ALL[/b][/u] vanilla magic variants created for them (even the silent moons option for iron and steel variants) and added to leveled lists for merchants, townsfolk, encounters, and treasure chests.  Anywhere there’s a chance of avanilla sword, there’s a chance of these swords.  They will appear a bit less often than vanilla swords however, as they’re supposed to be a little on the rare side.\n<br />\n<br />Stats-wise,the swords are typically one point lighter, and do one point more damage than their vanilla counterparts.  They also have a speed rating of 1.15, which puts them dead in the middle of swords and daggers.  Lastly they have a 5% higherchance than normal to critical hit as well. The aim here was to add weapons that were of exceptional quality to thegame but still remain relatively balanced.\n<br />\n<br />Cost vs a vanilla sword is about 30% higher (give or take).  Unlike the vanilla weapons, I also adjusted the value of magical ones up a little over the mundane versions.  If it’s enchanted, it has to be worth more right?\n<br />\n<br />Lastly, as an added bonus that came about creating the Silver variant, the vanilla silver swords are now craftable and temperable. They’ll be under the Misc category at the forge.  I also tried to get them to occasionally pop in vendor and loot lists.  It always bothered me that they only showed in the hands of Werewolf hunters.\n<br />\n<br />If you have a mod that does more extensive stuff with Silver Weapons, just put it below this one in your load order and it should take priority.[/size]",
  "categoryId": "55",
  "version": "1.0",
  "author": "rms827 and Vioxsis",
  "createdUnix": "1512094296",
  "updatedUnix": "1512094296",
  "containsAdultContent": false,
  "uploadedBy": "rms827",
  "primaryFile": null,
  "files": []
}