{
  "modId": 88189.0,
  "modName": "Konahrik The Priest - A Quest Mod",
  "summary": "This mod adds a quest to the game that fleshes out the lore behind the Konahrik mask and its eponymous dragon priest, as well as allowing you to upgrade the mask with a better enchantment. That's right, you get to take on the mighty Konahrik himself.",
  "descriptionHtml": "SE Version available here: [url=https://www.nexusmods.com/skyrimspecialedition/mods/13967]https://www.nexusmods.com/skyrimspecialedition/mods/13967[/url][i]\n<br />\n<br />Konahrik, the champion of the dragon priests, was never dead. Though he was felled in battle during the dragon war, his soul was preserved in a soul gem and divided amongst powerful dragons for safekeeping. Now that the Dragons have risen up again, Konahrik's return may soon be at hand. It's up to you to stop this great evil from rearing its ugly head once more.\n<br />\n<br />[/i][youtube]F6R_teusQ2Q[/youtube]\n<br />\n<br />[b]INTRODUCTION[/b]\n<br />The Konahrik mask to me was disappointing in two ways. The first is that the enchantment it has isn't all that interesting, especially considering the amount of work you have to put in to actually get the mask. The second is that there's no story to it, except some dead guy who was trying to get it for himself. No sign of any Konahrik dragon priest, no explanation as to why it's locked away, it's just kinda there. This mod attempts to address both these grievances.\n<br />\n<br />[b]OVERVIEW[/b]\n<br />This is a quest mod that aims to add some lore behind the unique mask, Konahrik, as well as to improve it's enchantment somewhat. To begin the quest, go to Bromjunaar sanctuary in Labyrinthian and read the new bloody note under the skeleton lying there ([b]not[/b] the hired thug's missive; this is an entirely new note). From there, you'll be directed to the dead man's colleague, who will ask you to bring him the Konahrik mask from within Bromjunaar. Then, with his guidance, you'll take on the mighty Keeper Dragons to re-assemble Konahrik's soul gem and take him out for good. Once you defeat the eponymous priest, you'll get an improved version of the Konahrik mask with an even more powerful enchantment than the original.\n<br />\n<br />[b]THE MASK[/b]\n<br />The upgraded mask has a few key differences to the original. The flame cloak and healing ability now has a firestorm on top of it to better dispense of any immediate threats. The rare dragon priest summon effect has been replaced with a devastating Meteor Shower Storm Call. Since Storm Call only works outdoors, the rare effect's chance has been doubled to make up for this. On top of that, the mask also has a passive enchantment effect now; the lower your health drops, the more damage your weapons do. You gain 10% extra damage for every 10% of health that you're missing, up to an extra 50% when you drop below half health.\n<br />\n<br />[b]REQUIREMENTS[/b]\n<br />Just Skyrim. I was very particular about not including any DLC assets so that anyone who has the game can enjoy this mod.\n<br />\n<br />[b]BUGS[/b]\n<br />I've only noticed one so far during my several test-runs, and that's that the quest might not advance when you pick up the new version of the mask from Konahrik's corpse. It only happened once to me, but if it happens again just reload an earlier save from before you defeated him.\n<br />If you notice any other bugs, please report them to me in the comments and I'll try to fix them ASAP.\n<br />\n<br />Oh and there's also the fairly common Creation Kit bug of custom NPCs not initiating any dialogue when you try to talk to them for the first time. If you try to talk to Sirus and he refuses to say anything to you, save the game while standing in front of him and then re-load the save, that will get the dialogue lines to show up.\n<br />\n<br />\n<br />[b](NOT SO) FREQUENTLY ASKED QUESTIONS[/b]\n<br />[i]\n<br />[b]Is the quest fully voiced?[/b][/i]\n<br />Yes, by none other than me. Thankfully there's only one NPC to talk to.\n<br />[i]\n<br />[b]What if I want the original version of the mask back?[/b][/i]\n<br />Once you complete the quest, you can switch back and forth between the new and old Konahrik mask at a tanning rack. Do note that this will reset any smithing bonuses you've given it, but the option is still there if you want it. \n<br />If you're not sure which version of the mask you have, look at the value; the new one is worth slightly more.\n<br />[i][b]\n<br />You took away the dragon priest summon? How could you!? You monster![/b][/i]\n<br />Once you complete the quest, you'll be given a spell tome as a reward that will allow you to summon the dragon priest at will, just like any other conjuration spell.\n<br />[i]\n<br />[b]Is this compatible with retextures and remodels?[/b][/i]\n<br />Fully compatible with retextures, 95% chance it's compatible with remodels of the mask as well. Any other mod unrelated to the mask should be fully compatible.\n<br />As for Konahrik's Accoutrements and Konahrik's Privilege, this mod is fully compatible with them but they'll only affect the original version of the mask and not the new one (hence why I added the ability to swap between the original and the new one at a tanning rack).\n<br />\n<br />Speaking of which, I'm using a great re-texture of the Konahrik mask myself that you can see in the screenshots of this mod. You can download it here:\n<br />[url=https://www.nexusmods.com/skyrim/mods/4420/]https://www.nexusmods.com/skyrim/mods/4420/[/url]\n<br />\n<br />Enjoy! this has been a labor of love for me with plenty of frustration along the way, but I'm happy to have it finished and to finally be able to share it with the world.",
  "categoryId": "35",
  "version": "1.1",
  "author": "grasscid",
  "createdUnix": "1512161191",
  "updatedUnix": "1517374020",
  "containsAdultContent": false,
  "uploadedBy": "grasscid",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000261021",
      "name": "Konahrik The Priest",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "22840",
      "fileName": "Konahrik The Priest.rar-88189-1-0.rar",
      "uploadedUnix": "1512161127",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/34e32e71368f7e5f154fe8f31b5949b02db5a81f485761e1e80543c3c37f51ed/analysis/1512161253/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Konahrik%20The%20Priest.rar-88189-1-0.rar?fid=1000261021&ttl=1535877287&ri=8192&rs=8192&setec=d4597cce75d9432243705306eafa46f4"
    },
    {
      "fileId": "1000265191",
      "name": "Konahrik The Priest",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "40949",
      "fileName": "Konahrik The Priest-88189-1-1.rar",
      "uploadedUnix": "1517374020",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/425125c781825e83a2e2ad1194580cbe66bfe9d38ae39cbcfe1ae70bcb2df322/analysis/1517374086/",
      "changelogHtml": " Gave every Keeper Dragon a unique name and appearance <br/> \n Updated the quest markers on the second stage to more accurately reflect what you have to do <br/> \n Updated Konahrik's perk and spell list, as well as increasing his level and health slightly <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Konahrik%20The%20Priest-88189-1-1.rar?fid=1000265191&ttl=1535877287&ri=8192&rs=8192&setec=97e7846ce997bd0c76f800b3a1cfc180"
    }
  ]
}