{
  "modId": 88289.0,
  "modName": "Simply Climb",
  "summary": "Simply Climb (a.k.a. I shouldn't be here) adds the very simple mechanic of climbing! You press a button, and your character moves up some, and forward a little, at the cost of some Stamina. If the button is held down, your character goes up a little more, at the cost of a little more Stamina. Best played in First Person.",
  "descriptionHtml": "[size=4][u][b]Description\n<br />[/b][/u][/size][size=2]Simply Climb (a.k.a. I shouldn't be here), is a very simple mod. How it works is, you push a button (Right Control by default), and your character moves up some, and forward a little bit, at the cost of some Stamina. If there isn't anything to hold them up, your character falls back down to the ground. Holding down and releasing the button moves your character up further, at the cost of more Stamina. The Light Armor skill reduces the Stamina required for climbing. Climbing also grants a small amount of experience in Light Armor. There isn't any animation, your character simply floats there...it's recommended that you play with this while in first person. The climbing key used can be configured in the Mod Configuration Menu.\n<br />\n<br />In all seriousness, this was something that was just needed, and has never been done before at any capacity, except by some Russian guy, I think. They really like parkour for some reason. So anyway, I just decided to make this in 3 hours, with about 50 lines of code. You can't scale entire city walls with this, unless you're really good in Light Armor, and have a lot of Stamina, and have the patience to hold that button down a long time. However, you can use this to get over that troublesome log, or house, or mountain. If you're clever, and persistent, you can also do things like get into Jarl Balgruuf's quarters without using the front door.\n<br />\n<br />You [i]shouldn't[/i] be able to glitch through walls or ceilings, unless you're really determined. I say [i]shouldn't[/i], because Skyrim simply wasn't designed with roof-running parkour in mind. For example, while testing I discovered you can phase through a part of the Dragon's Reach roof, simply because there wasn't any collision there, because the developers didn't expect someone to be climbing on the Jarl's palace like some vodka-drinking mad-man. You will also find that some walls can't be scaled even with this wall, because their collision boxes go way above what's rendered...just...because.\n<br />\n<br />[/size]At any rate, have fun with this. I'll see you at High Hrothgar.",
  "categoryId": "24",
  "version": "1.0",
  "author": "IronDusk33",
  "createdUnix": "1512708743",
  "updatedUnix": "1512708743",
  "containsAdultContent": false,
  "uploadedBy": "IronDusk33",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000261470",
      "name": "Simply Climb 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "4",
      "fileName": "Simply Climb 1.0-88289-1-0.rar",
      "uploadedUnix": "1512708535",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/d208b512227cb1b7987beffafbc7b53ccffe8ac071b07d673dbc7a288d07a536/analysis/1512708542/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Simply%20Climb%201.0-88289-1-0.rar?fid=1000261470&ttl=1535877431&ri=8192&rs=8192&setec=43042118fe721be4966ac67f36cde715"
    }
  ]
}