{
  "modId": 88337.0,
  "modName": "Super sleeves of Skyrim - aMidianBorn content addon patch",
  "summary": "This patch makes sure that aMidianborn content addon works as it should along with Super Sleeves of Skyrim.",
  "descriptionHtml": "Super sleeves of Skyrim works with Amidianborn textures. However, not so well with the extra armor versions provided by its content addon. Such as displaying \"Steel armor - White fur\" version with brown fur and weird textures down the arms. This patch aims to correct this. It also reverses the steel pauldron changes from Super Sleeves to vanilla, removing the gold/bronze and leather look that came packaged with it. \n<br />\n<br />This mod was not created by me, I am merely sharing it with the community as I got permission to release it from the mod author, a kind stranger who wanted to help me combine two mods I love dearly. Thus, I will not be able to provide much support for the mod, but I still wanted to share it in case anyone has a use for it.",
  "categoryId": "84",
  "version": "1.0",
  "author": "A kind stranger",
  "createdUnix": "1512954984",
  "updatedUnix": "1512954984",
  "containsAdultContent": false,
  "uploadedBy": "alexan1308",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000261738",
      "name": "Super Sleeves of Skyrim - aMidianborn content addon patch",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2962",
      "fileName": "Super Sleeves of Skyrim - aMidianborn content addon patch-88337-1-0.zip",
      "uploadedUnix": "1512950529",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/da45653a326c8ba3a8275539b1a68ba7297145bebc0847a1673edb8a2501c763/analysis/1512950593/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Super%20Sleeves%20of%20Skyrim%20-%20aMidianborn%20content%20addon%20patch-88337-1-0.zip?fid=1000261738&ttl=1535877495&ri=8192&rs=8192&setec=98fa8a6dc42d7402ffe2b3cf90af04a5"
    }
  ]
}