{
  "modId": 88332.0,
  "modName": "Oldrym Port of Reiko Samurai Armor Retexture - DELETED",
  "summary": "I have had some requests to port my Reiko Samurai armor texture mod to Oldrym.",
  "descriptionHtml": "UPDATE:  I am happy to see that the armor has been receiving positive comments and I wanted to let everyone know that the next armor I will have complete is a modified version of the Nightingale armor made to resemble a set of historical ninja armor.\r<br />\r<br />\r<br />After some research showing that porting a mod back to Oldrim is impossible for me; I have decided to enlist the help of a fellow modder to finish the port.  In the file you will find all the meshes and textures needed to make a full suit of samurai armor in the 32-bit CreationKit.  \r<br />\r<br /> In the ReadMe located within the file is a step by step to fully add the entire set of Leito86&#39;s ReikoRedux armor with my retextures.\r<br />\r<br />If someone finishes the entire set of armor and it works fine send me a private message and I will give you my email.  You can send the .ESP file associated with the new armor set and I can upload it with the meshes and textures and give you your due credit for helping me get this armor ported to Oldrym.  I am hoping more people will enjoy the new textures.  I have other retextures planned and I will do different color armors for this set if enough people download.  I was also planning on doing different materials (i.e. dragon bone).  The material currently is steel wrapped in boiled leather.  The meshes appeared to be modeled after the armor from The Last Samurai.  I based my color scheme on the same armor but took some artistic freedom on some of the other parts.  I tried to make the armor look as realistic as I could without spending to much time on it.\r<br />\r<br />My original retexture mod of the ReikoRedux male armor:[url=https://www.nexusmods.com/skyrimspecialedition/mods/13994]https://www.nexusmods.com/skyrimspecialedition/mods/13994[/url]?\r<br />\r<br />\r<br />\r<br />I hope everyone enjoys the armor and a big thanks to Leito86 for making the original meshes and textures that I have modified ",
  "categoryId": "54",
  "version": "1.00",
  "author": "Cain9580",
  "createdUnix": "1512927845",
  "updatedUnix": "1512927845",
  "containsAdultContent": false,
  "uploadedBy": "cain9580",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000261714",
      "name": "Oldrym Port of Reiko Samurai Armor Retexture",
      "version": "1.00",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "25131",
      "fileName": "Oldrym Port of Reiko Samurai Armor Retexture-88332-1-00.rar",
      "uploadedUnix": "1512927838",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/b685da39aa4c29814e6d9074854eca53739ceaf361981d10b9f9464f58ec577f/analysis/1512928107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oldrym%20Port%20of%20Reiko%20Samurai%20Armor%20Retexture-88332-1-00.rar?fid=1000261714&ttl=1535877490&ri=8192&rs=8192&setec=b50bf52a290509f09ad4b84fe75fec0c"
    }
  ]
}