{
  "modId": 88340.0,
  "modName": "Nexus Skyrim Overhaul - Magic Edition - SSE - DELETED",
  "summary": "A massive overhaul adding hundreds of new spells, over 100 new enchantments and 10,000 plus new weapons and armors.",
  "descriptionHtml": "[b][u][color=#e69138][size=6][img]https://staticdelivery.nexusmods.com/mods/1704/images/9742-0-1493961195.png[/img]\n<br />[/size][/color][/u][/b][b][size=3][color=#00ff00]Nexus Skyirm Overhaul Magic Edition:[/color]\n<br />[/size][/b][b][size=3][color=#efefef]\n<br />[/color][/size][/b][color=#e69138]Apocalypse - Magic of Skyrim[/color] - Apocalypse adds 155 new spells to Skyrim. The spells are unique, balanced, lore friendly, use high quality custom visuals and blend seamlessly into the vanilla magic system. Also includes scrolls and staves.\n<br />[color=#e69138]\n<br />Summermyst - Enchantments of Skyrim [/color]- Summermyst adds 119 brand new enchantments to the game. The new enchantments are balanced and integrated seamlessly into the item system. It also makes many improvements to vanilla enchantments.\n<br />[color=#e69138]\n<br />Elemental Destruction Magic [/color]- Adds earth, water, and wind as new types of destruction magic. Besides dealing the same amount of health damage as their vanilla counterparts, each new type of destruction magic has a unique secondary effect as well. Water spells stop enemy Magicka and Stamina regeneration for several seconds, earth spells stop Health regeneration and have a chance to stagger targets, and wind spells have a chance to blow targets away. This mod contains 30 new spells, including 24 destruction spells, 6 conjuration spells, 9perks, 3 weapon enchantments, and 3 armor enchantments. New spell casting enemies that use these new spells have also been added. The Dragonborn version includes the spell Ash Cloak to replace the vanilla Whirlwind Cloak spell and adds a new Dragon Priest masks for each element.\n<br />\n<br />[color=#e69138]The Elder Scrolls Tomes - Skyrim Magic Addon [/color]- This spell package offers a wide variety of magical tools to either aid you in exploration or to help you defeat your powerful opponents. \n<br />\n<br />[color=#e69138]Calling of the Conjurer[/color] - The Calling of the Conjurer focusses on expanding conjurating making it more fun, and exciting. With over 200 new summoning spells that scale with your level. You will never run out of things to summon.\n<br />\n<br />[color=#e69138]Paladin Spell Pack [/color]- There are many different spells to Fortify Spellpower, Melee Damage, Attack Speed, Critical Chance, Stagger Chance, Armor, Resistance, and the three base stats, Health, Stamina, and Magicka. As well as new healing spells and new damaging spells in the style of the Restoration school. \n<br />[color=#e69138]\n<br />Skyrim New Master Spells [/color]- This mod adds new Master Level Spells to the game. Destruction, Restoration, Illusion and Alteration spells.\n<br />\n<br />[color=#e69138]See Enchantments[/color][color=#f4f4f4] -  [/color][color=#f4f4f4]Vanilla Enchs just glow... [/color] Enchs now have animations and particles.\n<br />\n<br />[color=#e69138]Ordinator - Perks of Skyrim [/color]-  Ordinator overhauls the perk trees of Skyrim, replacing them with ~400 new perks to improve the depth and fun of building and playing your character. It accomplishes this in a lightweight, compatible and clean fashion.\n<br />\n<br />[color=#e69138]Immersive Performance for Ordinator[/color] -  This mod makes the 'Perform' power you get from Ordinator Speechcraft tree more immersive by adding an equippable lute utilized in your performance.\n<br />\n<br />[color=#ff00ff][size=4][b]Mod Highlights:[/b]\n<br />[/size][/color][list]\n<br />[*]654 New, non-repeated spells.\n<br />[*]10 New, magical arrows\n<br />[*]2894 New pieces of armor, jewelry and clothing\n<br />[*]318 New scrolls\n<br />[*]9895 New weapons\n<br />[*]119 new enchantments (70 armor enchantments, 49 weapon enchantments)\n<br />[/list]\n<br />[color=#ff0000][size=4][b]Facts:[/b][/size][/color]\n<br />New game is highly suggested!\n<br />This can be used without the NSO main mod!\n<br />NSO users - Still suggest a new game as upgrading your current NSO plugin with this in a existing game may cause weird behavior.\n<br />NSO - Main users = This is an expansion to NSO and should be loaded lower in your load order and a bash patch is mandatory!\n<br />[url=http://www.nexusmods.com/skyrimspecialedition/users/8128936/?tb=mods&amp;pUp=1]Kelsenellenelvians' Mods[/url] &lt;---- Check my mods list!\n<br />[img]https://staticdelivery.nexusmods.com/mods/1704/images/5993-0-1483499732.png[/img]",
  "categoryId": "75",
  "version": "1",
  "author": "Kelsenellenelvian",
  "createdUnix": "1512964613",
  "updatedUnix": "1512964613",
  "containsAdultContent": false,
  "uploadedBy": "Kelsenellenelvian",
  "primaryFile": null,
  "files": []
}