{
  "modId": 88353.0,
  "modName": "Dragonborn DLC Spamming FIX for DLC2PillarBuilderActorScript",
  "summary": "Fixes an issue in the Dragonborn DLC where an essential actor is referenced by a faction and not being able to do what that faction wants causing script spam and eventually crashes.",
  "descriptionHtml": "[center][size=6][color=#ff0000]Dragonborn DLC Script Spam FIX\r<br />[size=5]This is a vanilla bug and this mod should be installed before you reach Solstheim, or you will have to go through the process of finding and deleting the script.[/size][/color]   [/size][/center][center][size=4]Fixes a serious issue in Dragonborn where the script adds Talvas to faction DLC2PillarBuilderFaction but he is not able to work on the pillar for either being essential or doing an active scene. This causes script spam when the second script tries to gather all in the faction constantly referencing him because he did not actively come the first time.\r<br />\r<br />This is only a fix to stop it from re-occurring you MUST first open your save in some save cleaner such as\r<br /> [url=https://www.nexusmods.com/skyrim/mods/52363/?]Save Game Script Cleaner (SaveTool.exe)[/url] or [url=https://www.nexusmods.com/skyrim/mods/76776/?]FallrimTools - Script Cleaner and More[/url] for people who use the mod [url=https://www.nexusmods.com/skyrim/mods/72725/?]Crash Fixes[/url] new save format.\r<br />\r<br />First search for DLC2PillarBuilderActorScript in Scripts and delete it. This will get the bloating to fix itself. The script adds itself back but doesn&#39;t try to reference Talvas anymore since he isn&#39;t a part of the faction, thus fixing the script bloat issue. It might not add the script back if you have already freed the people from the stones or if you have beaten Miraak. (Not important since they won&#39;t be working on them anymore regardless)\r<br />\r<br />Forum Post Reference: [url=https://forums.nexusmods.com/index.php?/topic/919240-dlc2pillarbuilderactorscript-060177dbonpackagestart-making-dragonborn-unplayable/page-3]https://forums.nexusmods.com/index.php?/topic/919240-dlc2pillarbuilderactorscript-060177dbonpackagestart-making-dragonborn-unplayable/[/url]\r<br />\r<br />Quote from the guy who said how to fix it, helped me get in the right direction to fix it, although he was wrong in the sense that the script did not directly reference Talvas. This mod might not be here without him so be sure to go to his profile and give him Kudos: [url=https://www.nexusmods.com/games/users/15973084/?][size=4]ZeusDX1118[/size][/url]\r<br />\r<br />[quote name=&#34;ZeusDX1118&#34; post=&#34;45028500&#34; timestamp=&#34;1480236659&#34;]\r<br />I did some digging in TS5 Edit.\r<br /> \r<br />The problem is seems to be caused by Talvas Fathryon (Neloth&#39;s apprentice) being tied into the script that recruits mind-controlled workers for Miraak&#39;s stone building. Talvas is essential for other quest though, so there&#39;s probably also a conflict somewhere preventing that from actually happening.\r<br /> \r<br />I have this exact problem with over 185 mods installed and not a single one of them interferes with anything to do with the ref 040177db (Which is actually a &#34;placed npc&#34; id for Talvas&#39;s placement in the game), according to TS5Edit. Which is pretty amazing... I figured it was gonna have to be something I had to remove when I started looking.\r<br /> \r<br />You can see this yourself if you open TS5Edit with any/all of your mods, make sure all of them are selected at once during that opening window, and once it&#39;s finished doing its thing with bringing them all up and building reference info, use the &#34;FormID&#34; search bar to look for 040177db, which should bring you right to Talvas&#39;s placement id, and then right click and &#34;Apply filter for cleaning&#34; which will show you any conflicts once that process is done. If you don&#39;t understand how to read the highlights, select &#34;Information&#34; bellow the box on the right side, and it will tell you what the highlights mean.\r<br /> \r<br />Also, It should be noted as you do this that dragonborn.esm needs to be in the correct placement of the load order. For example if you type in &#34;000177db&#34; it will take you to a placed object ref id for some banner in skyrim, in the skyrim.esm, because skyrim.esm being first in the load order makes any items, actors, and other such ref ids start with &#34;00&#34;. &#34;01&#34; for update.esm, &#34;02&#34; for dawnguard.esm, &#34;03&#34; for hearthfires.esm, and thus &#34;03&#34; for dragonborn.esm, if you are using the standard and arguably correct load order. Just a heads up... In other words, if dragonborn.esm is not 5th in the load order, and is say, 7th, then the ref id for the &#34;040177db&#34; would be changed to &#34;060177db&#34;. Doesn&#39;t have a huge impact on other things, yet it&#39;s a *censored* to find something in TS5Edit if you have a different load order than someone else, and you don&#39;t know that... Also, when finding issues in the papyrus log, always look at the ref ID attatched to the script entry. It tells you what mod it&#39;s from if you know this... And on another side note &#34;VM is thawing&#34; and such are references to something you did to pause the game. &#34;VM is freezing&#34; because it takes a second, &#34;VM is frozen&#34; when it&#39;s paused, and &#34;VM is thawing&#34; because it takes a second to unpause...\r<br /> \r<br />This is simply a bug the game has by default apparently though.\r<br /> \r<br />To repair this problem, perhaps someone needs to make a mod /patch so that DLC2PillarBuilderActorScript no longer tries to mess with Talvas, because when this happens, for whatever reason (Because he&#39;s essential to other quests or not), the game crashes.\r<br /> \r<br />Spread the word to mod makers if you want a repair on this.\r<br /> \r<br />Link them to this post of mine if you need help explaining the situation (Even though this post is like a billion years old). I haven&#39;t found a repair for this anywhere personally. The Unofficial patches mess with a lot of other things that cause other bugs to my game personally so I don&#39;t use them, which is why some players need a simpler little fix for this (I also have no clue is the Unofficial patch repairs this or not, so maybe ask them, or better, ask someone else to make a separate one, so everyone can enjoy a bugless game).\r<br /> \r<br />If a mod for this is ever made, you wouldn&#39;t need to start a whole knew save assuming it only modified this script to correct the bug.\r<br /> \r<br />You just use Save Game Script Cleaner (Not Save Game Script Scalpal, the other one) and you type DLC2PillarBuilderActorScript into the search bar and select &#34;Inc. Forms&#34; next to the &#34;Delete Selected&#34; box in the upper left, and then select the script &#34;DLC2PillarBuilderActorScript&#34; (not the script instances, just the script), and then hit the &#34;Delete Selected&#34; box to remove it, and that should remove everything. This also works if the save isn&#39;t starting because of the script crashing the game. You just manually remove it like this. It comes back though immediately after because it&#39;s still in the dragonborn.esm. It will work for starting the game, and you can still play the save (It will likely crash again eventually until you insert a repair for that).\r<br />[/quote]\r<br />\r<br />How I fixed it:\r<br />Looked for faction DLC2PillarBuilderFaction in Dragonborn.esm,\r<br />Went to Referenced by(###) and double clicked on Talvas&#39; name,\r<br />Copied Talvas NPC form as an override into new mod TalvasScriptSpamFix.esp,\r<br />Removed Attached Script DLC2PillarBuilderActorScript from Talvas and saved the new plugin,\r<br />Opened up SaveTool.exe and opened recent save,\r<br />Searched for DLC2PillarBuilderActorScript and pressed &#34;delete selected&#34;,\r<br />Re-saved and loaded save,\r<br />(This next part isn&#39;t necessary)\r<br />Went to &#34;coc qasmoke&#34; and &#34;Set timescale to 200000&#34; and waited a few seconds,\r<br />&#34;Set timescale to 20&#34; (Original timescale) and saved game,\r<br />Opened up the save in SaveTool.exe and noticed ActiveScripts went down to 12 (Normal).\r<br />\r<br />Anything over 50 is probably bloat unless you have lots of script heavy mods such as Frostfall, Requiem, or those survival/combat mods. The best way to check is to open your save in some save editor and check ActiveScripts. If there are a lot of repeating references and your active script count is &#34;quite high&#34; then you have save bloat.\r<br />\r<br />[/size][/center]",
  "categoryId": "95",
  "version": "Final",
  "author": "Xerperious",
  "createdUnix": "1513016384",
  "updatedUnix": "1513016384",
  "containsAdultContent": false,
  "uploadedBy": "Xerperious",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000261774",
      "name": "Dragonborn DLC Script Spam Fix",
      "version": "Final",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Dragonborn DLC Script Spam Fix-88353-Final.rar",
      "uploadedUnix": "1513016377",
      "modVersion": "Final",
      "virusScanUrl": "https://www.virustotal.com/file/1ffaf6084db3a014ec93615ed9683b5dbb67d211e8d5aee32a695c4aff067121/analysis/1513016596/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonborn%20DLC%20Script%20Spam%20Fix-88353-Final.rar?fid=1000261774&ttl=1535877509&ri=8192&rs=8192&setec=5f809cf7795063f76cfc088eec30800a"
    }
  ]
}