{
  "modId": 88352.0,
  "modName": "Dragonlands",
  "summary": "Dragonlands is a modern standalone ENB based on NLA 2 weathers, focusing on the aesthetics featured in recent titles like Horizon Zero Dawn and Shadow of War. Incorporates the technical advancements made by ENB and the compiled knowledge of some of the most talented Skyrim modders, including a whole lot of fixes, patches and visual improvements.",
  "descriptionHtml": "[i][color=#b6b6b6][right]Disclaimer: my english is bad and I should feel bad. Sorry.[/right][/color][/i]\n<br />\n<br />\n<br />\n<br />[center][img]https://codino.me/dragonlands/nexustop.png[/img][/center]\n<br />\n<br />[b]Dragonlands is a standalone modern ENB based on NLA 2 weathers plus a whole lot of fixes, patches and visual improvements.[/b]\n<br />\n<br />[center]﻿[youtube]DxMNhRBpkx0[/youtube][/center]\n<br />\n<br />The last few years brought advancements in game lighting thanks to new game engines and the work of very talented individuals. Visual masterpieces like Horizon Zero Dawn, Star Wars Battlefront and Shadow of War all use dramatic lighting and precise tonemapping to achieve their unique style, and that’s what Dragonlands aims to bring to Skyrim now.\n<br />\n<br />An enjoyable experience does not need to be photorealistic, it needs to be believable. Aesthetic choices need to push colors and effects to the boundaries of realism, and not the opposite. Bright cloudy days, creepy foggy nights, dull overcast mornings. To you, the player, every moment needs to look like the perfect combination of factors, all contributing to the overall atmosphere. Everything needs to be epic and fantastic.\n<br />With these principles laid, let's talk about…\n<br />\n<br />\n<br />[size=5][b][font=Courier New][color=#a5ff00]FEATURES[/color][/font][/b][/size]\n<br />[b][size=3]Improved lighting[/size][/b]\n<br />Dramatic lighting improvements in the province of Skyrim and neighboring lands. Outer realms and special places with glowing mushrooms keep the original aesthetic choices made by Bethesda, while carrying all other technical improvements;\n<br />\n<br />[b][size=3]Fully featured[/size][/b]\n<br />Updated from NLA 2 with the addition of almost every feature included in the newer versions of ENB (0.319) since;\n<br />\n<br />[b][size=3]Truly standalone[/size][/b]\n<br />Designed to look good without anything else. No need for water, LOD, sky, clouds or rain replacers. Made with vanilla textures, trees and vegetation in mind. The combination of interior lighting from particles, light sprites, windows and point lights make lighting overhauls mostly unnecessary. They remain useful for bulb positioning and light color replacements, however;\n<br />\n<br />[b][size=3]Lightweight[/size][/b]\n<br />Every effect is dialed down on quality to low, very low or in extreme cases, medium. Every aspect of Dragonlands is made with these settings in mind, aiming for maximum performance;\n<br />\n<br />[b][size=3]Patched &amp; Fixed[/size][/b]\n<br />Includes Mindflux's particle patch, subsurface scattering patch and ice shader fix, so they're not needed as separate mods. Smoke on the main menu and loading screens is removed. Gigantic snow floating millimeters from the screen in snowy weathers is also removed. The common bug of dynamic light sources illuminating far fog is fixed. Includes fix for the annoying thunder loop bug without the need of extra thunder sounds, thanks to FadingSignal's amazing work on True Storms;\n<br />\n<br />[b][size=3]Visible nights[/size][/b]\n<br />Clear nights brighten the scenery like they should. Masser and Secunda are the big responsibles for this. If our measly Moon can do it, the two gigantic Lorkhan parts should do better. Overcast nights are less bright since clouds diffuse the light from the moons and stars, resulting in less direct lighting. They're navigable without the need of additional sources of light most of the time. By consequence, this feature alleviates the engine limitation that causes the vegetation shader to not interact with torches, magic and other lights;\n<br />\n<br />[b][size=3]Cozy interiors[/size][/b]\n<br />Not too bright nor too dark. Most of the times. Ragged Flagon is not a good example of well lit place anyway;\n<br />\n<br />[b][size=3]Dark dungeons[/size][/b]\n<br />Reasonably dark dungeons and caves. If nights do not require torches anymore, dungeons will make good use of them;\n<br />\n<br />[b][size=3]Night vision[/size][/b]\n<br />Night vision is also tweaked with special care to be useful and emulate the vision from nocturnal fauna. It should fit lore-wise and not be vomit-inducing;\n<br />\n<br />[b][size=3]Beautiful sunny days[/size][/b]\n<br />When the weather allows for it, days come and go with beautiful sunrises and sunsets, plenty of god rays and sun haze;\n<br />\n<br />[b][size=3]Wet rainy days[/size][/b]\n<br />If there’s rain coming, prepare to get visibly wet. You get wet, roads get wet, Inigo gets wet. Wetness is real people;\n<br />\n<br />[b][size=3]Better scaling[/size][/b]\n<br />Mountains and distant landscape are always under a combination of fog, mist and a very faint distortion, all of that to show the true scale of Skyrim. This has the bonus of covering engine problems like z-fighting and the occasional ugly LOD texture. See that mountain? You can go there, but it’s so so far away;\n<br />\n<br />[b][size=3]Subtle lens effects[/size][/b]\n<br />Getting wet, frozen or close to volcanoes show very subtle effects on the screen. They can be turned off, of course, but they’re made with people who don’t like lens effects in mind;\n<br />\n<br />[b][size=3]Realistic skin[/size][/b]\n<br />Skin reacts with light while keeping its natural colors and characteristics fully visible, be them your bad-ass orc face, cute elf freckles or… some other assets;\n<br />\n<br />[b][size=3]Cold water[/size][/b]\n<br />Water is rendered in deep dark tones of green, with visible caustics and with matching underwater;\n<br />\n<br />[b][size=3]Blended terrain[/size][/b]\n<br />Reworked distant terrain that completely removes the sometimes visible transition from full featured to distant terrain present in the vanilla game; This is achieved through the use of a vanilla noise texture, and is compatible with any LOD replacers and texture packs;\n<br />\n<br />[b][size=3]Clear world map[/size][/b]\n<br />Less cluttered, cloudless and more visible world map;\n<br />\n<br />[b][size=3]Dense Glaciers[/size][/b]\n<br />New ice and glacier textures, thanks to Kakasi's work;\n<br />\n<br />[b][size=3]Rain occlusion[/size][/b]\n<br />Optional rain with occlusion. It comes disabled by default but it’s tweaked to integrate well if enabled;\n<br />\n<br />[b][size=3]Easily customizable[/size][/b]\n<br />Only sky, environment and volumetric fog sections are weather dependent. Heavily simplified weatherlist, prioritizing defining characteristics over location or minute differences while also eliminating harsh weather transitions. Minimalistic and organized file structure. Everything except enbseries.ini stays inside the enbseries folder. Every parameter in every shader is categorized, sorted and understandable from the GUI in-game. Effect.txt shader addon comes with global modifiers for vibrance, black &amp; white levels, sharpening and more;\n<br />\n<br />\n<br />\n<br />[b][color=#a5ff00][font=Courier New][size=5]INSTALLATION[/size][/font][/color][/b]\n<br />[list=1]\n<br />[*]Download [url=http://enbdev.com/download_mod_tesskyrim.html]ENB 0.319[/url]﻿ or the closest one after that. Extract [b]d3d9.dll[/b] and [b]enbhost.exe[/b] from the [i]WrapperVersion[/i] [i]folder[/i] into [i]Skyrim main folder[/i];\n<br />[*]Download and install [b]Dragonlands - MOD.zip[/b] with your mod manager;\n<br />[*]Download and extract the contents of [b]Dragonlands - ENB.zip[/b] into [i]Skyrim main folder[/i];\n<br />[*]If you do not have an [b]enblocal.ini[/b] file already configured in the [i]Skyrim main folder,[/i] open [b]enblocal_example.ini[/b], make the documented adjustments located inside the file, save and rename it to [b]enblocal.ini[/b];\n<br />[*]Download [url=http://www.dev-c.com/skyrim/enbhelper/]ENBHelper[/url]﻿. Only the [b]enbhelper.dll [/b]file is necessary. Extract it inside the [i]enbseries folder[/i] inside [i]Skyrim main folder[/i].\n<br />[/list] \n<br />\n<br />\n<br />[size=5][b][font=Courier New][color=#a5ff00]RECOMMENDED[/color][/font][/b][/size]\n<br />[list]\n<br />[*][b][size=1]FIXES[/size]:[/b] [url=https://www.nexusmods.com/skyrim/mods/76747]Bug fixes[/url]﻿ &amp; [url=https://www.nexusmods.com/skyrim/mods/72725/]Crash fixes[/url]﻿, [url=https://www.nexusmods.com/skyrim/mods/71214/]USLEEP[/url]﻿, [url=https://www.nexusmods.com/skyrim/mods/85443/]Load Game CTD Fix[/url]﻿, [url=https://www.nexusmods.com/skyrim/mods/52717/]Enchantment Reload fix[/url]﻿, [url=https://www.nexusmods.com/skyrim/mods/34093/]WAFR [/url]﻿&amp; [url=https://www.nexusmods.com/skyrim/mods/43053/]Clothing and Clutter fixes[/url]﻿. \n<br />[*][b][size=1]TEXTURES[/size]:[/b] [url=https://www.nexusmods.com/skyrim/mods/57353/]Optimized Vanilla Textures[/url] &amp; [url=https://www.nexusmods.com/skyrim/mods/24909/]aMidianBorn Book of Silence[/url]﻿;\n<br />[*][b][size=1]CHARACTERS[/size]:[/b] [url=https://www.nexusmods.com/skyrim/mods/84898/]Windsong Immesrive Character Overhaul[/url]﻿﻿;\n<br />[*][b][size=1]AUDIO[/size]:[/b] [url=https://www.nexusmods.com/skyrim/mods/43773/]Audio Overhaul for Skyrim 2[/url];\n<br />[*][b][size=1]LIGHTING[/size]:[/b] [url=https://www.nexusmods.com/skyrim/mods/59733/]ELE Lite[/url]﻿ &amp; [url=https://www.nexusmods.com/skyrim/mods/17609/]Relighting Skyrim[/url]﻿ or[b] [/b][url=https://www.nexusmods.com/skyrim/mods/27043/]ELFX[/url]﻿. [i]For ELFX, just the base plugin, no weathers, exteriors or enhancer[/i];\n<br />[*][b][size=1]LANDSCAPE[/size]:[/b] [url=https://www.nexusmods.com/skyrim/mods/59721/]DynDOLOD[/url]﻿. [i]Uncheck GlowFX and candles in the generator. If used with vanilla 3D trees, lower their brightness to -6.[/i]\n<br />[/list]\n<br />\n<br />\n<br />[color=#a5ff00][font=Courier New][size=5][b]COMPATIBILITY[/b][/size][/font][/color]\n<br />Weather overhaul mods are incompatible, but anything else should not cause problems, aside from visual differences. There's also no need to use NLA patches if a mod offers it. Technically speaking, Dragonlands adds some imagespaces and edits vanilla weathers. It doesn't add new weather FormIDs and doesn't override region weather chance, so it's more compatible than NLA.\n<br />\n<br />\n<br />[color=#a5ff00][size=5][b][font=Courier New]F.A.Q.[/font]\n<br />[/b][/size][/color][b][size=3]Where is the color?[/size][/b]\n<br />Even if you can't see it, the colors are there. Dragonlands was developed using a pretty good display and if you have one too, the colors will show up. If not, don't worry. You can put color in the world by changing a single setting group. Once inside the game, open the ENB GUI with [font=Courier New]shift+enter[/font]. Under the [i]effect.txt [/i]shader ➊, tweak the [i]vibrance [/i]settings ➋ until satisfied. Then save the changes ➌ and close the GUI with [font=Courier New]shift+enter[/font] again. That's it, no need to change anything else. Otherwise, feel free to tweak the other settings in this shader, as they're meant for user calibration.\n<br />\n<br />[img]https://codino.me/dragonlands/enb-gradient.png[/img]\n<br />\n<br />[b][size=3]Why this doesn't require NLA?[/size][/b]\n<br />Dragonlands can be seen as a middle ground between NLA and vanilla Skyrim. It changes the existent weathers without adding new ones. These changes use NLA excellent lighting as a foundation and build from it. Dragonlands also doesn't touch the weather variation by region to keep the original atmosphere the game was designed to pass. All of these combined turn Dragonlands into a beast too different from NLA to use it as a requirement.\n<br />\n<br />[b][size=3]How many weathers are included?[/size][/b]\n<br />Same as vanilla. By not trying to include literal hundreds of weathers, every single one could be extensively tested and tweaked to give the best possible results. There's still more diversity than most of the recent open world games though.\n<br />\n<br />[b][size=3]How about performance?[/size][/b]\n<br />ENB itself always causes a constant performance impact, independent of a preset particular shaders or combination of effects. It's not possible to use ENB without some FPS drop. The trick is to optimize the game earlier, being careful with mods that add objects to the world like more vegetation, new structures, and city and settlement overhauls. That said, Dragonlands performs better than NLA by a wide margin and should run faster than almost any modern preset. \n<br />\n<br />\n<br />[size=5][b][font=Courier New][color=#a5ff00]ARE YOU STILL THERE?[/color][/font][/b][/size]\n<br />I hope you enjoy the results of my work as much as I do. Be aware that the preset is still in development, so bugs will be dealt with and changes will be made if something looks off. ENBs are works of patience after all.\n<br />Also [b]please[/b] help me fill the images section with more pictures. I suck at getting cool screenshots as I’m usually dying or trying not to [size=1](I blame Requiem)[/size]. Feedback is welcome, be it constructive or not.\n<br />\n<br />\n<br />[color=#a5ff00][font=Courier New][size=5][b]CREDITS AND THANKS[/b][/size][/font][/color]\n<br />Dragonlands uses the collective work of the best modders around, with direct and derivative permissions. Most of them are below. If I forgot you, please scold me.\n<br />\n<br />[list]\n<br />[*]Boris Vorontsov for ENB Series and Bethesda for Skyrim/CK [i](obvious ones here)[/i]\n<br />[*]Confidence Man for Natural Lighting and Atmospherics 2\n<br />[*]Alexander Blade for EnbHelper\n<br />[*]rudy102 for rain droplets\n<br />[*]FKPX3118 for the extended mist anchors\n<br />[*]kingeric1992 for the lens shader\n<br />[*]gp65cj04 for the depth of field shader \n<br />[*]ZeroKing and FKPX3118 for the shader addon effect.txt\n<br />[*]Kakasi for ice textures\n<br />[*]JawZ for parts of ELE/RS\n<br />[*]FadingSignal for the help understanding the thunder loop bug\n<br />[*]Mindflux for particle patch, subsurface scattering patch and ice shader fix\n<br />[*]Everyone from [url=https://www.reddit.com/r/skyrimmods/comments/7ejup1/nla_redefined_dragonlands_enb_testing_phase/]this thread on Reddit[/url]﻿ for helping test the preset\n<br />[/list]",
  "categoryId": "97",
  "version": "1.0",
  "author": "Tyktak",
  "createdUnix": "1513897226",
  "updatedUnix": "1513897226",
  "containsAdultContent": false,
  "uploadedBy": "Tyktak",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000262419",
      "name": "Dragonlands - MOD",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "33662",
      "fileName": "Dragonlands - MOD-88352-1-0.zip",
      "uploadedUnix": "1513896564",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4fc9cde9c2c5dbc4ba83f0cbfb5e06989a7342e4e5cebeec9dc0c726c841f48d/analysis/1513896606/",
      "changelogHtml": " Fixed thunder pooling bug on storm and rain weathers <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonlands%20-%20MOD-88352-1-0.zip?fid=1000262419&ttl=1535877506&ri=8192&rs=8192&setec=f1fe541ad516e97d000261d09f79cf79"
    },
    {
      "fileId": "1000262420",
      "name": "Dragonlands - ENB",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "5916",
      "fileName": "Dragonlands - ENB-88352-1-0.zip",
      "uploadedUnix": "1513896641",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/758a03d1a75468b5cea213fb17d1c67f64c9224bc0ed987088b2c31fd6b80565/analysis/1513896683/",
      "changelogHtml": " Fixed thunder pooling bug on storm and rain weathers <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dragonlands%20-%20ENB-88352-1-0.zip?fid=1000262420&ttl=1535877507&ri=8192&rs=8192&setec=34c050089ca9a2f3e9e6d63ffbca3af0"
    }
  ]
}