{
  "modId": 88378.0,
  "modName": "Cain9580 - Reiko Samurai Armor Full Retexture",
  "summary": "A full retexture of the Reiko armor created by Leito86.  Files are 2048x2048 for full effect.",
  "descriptionHtml": "[b][color=#00ff00]It has been a while since my last update but I have been working on something special. I did not like the way the new armor textures were going because I felt like I was just reusing old Skyrim stuff and not putting my own personal touch into it. I have an older armor mod from OG Skyrim that was in abysmal shape and after getting all the pieces able to work with the game I ran into a new problem. The UV maps that wrap the texture on the mesh were a complete mess and made retexturing impossible. After much frustration I have learned how to edit and fix the UV maps and I am working on a special texture that will be a standalone mod[/color][/b]\n<br />\n<br />\n<br />UPDATE: \n<br />I also have an SE version of the mod: [url=https://www.nexusmods.com/skyrimspecialedition/mods/13994]https://www.nexusmods.com/skyrimspecialedition/mods/13994[/url]?\n<br />\n<br />This is also a conversion of the original Reiko armor mod that is on the original version of Skyrim.\n<br />\n<br />The armor can be crafted from the Ebony tab of the crafting menu.  They can also be upgraded to the same stats.  The original mod had no ground model so you may not see anything until you actually wear the armor.\n<br />\n<br />Also, credit goes to Leito86 for the original models and textures that I used to make this. I tried to track down a way to contact him but failed to find anything. I had nothing to do with the original mod design I just found the mod and retextured the models. \n<br />\n<br />\n<br />This is my first attempt at a texture mod but I have been editing textures for my own game for a while.  If enough people download this I have considered making alternate colors and material textures.  This is only the male version of the armor.  I can retexture the female version if enough people want me to.\n<br />\n<br />Cheers! \n<br />\n<br />Future Versions:  Planned textures unique to each crafting material.  They will not be simple recolor versions of the same armor so they will be added one at a time. \n<br />\n<br />If you see a bug or problem and you know how to fix it post it in the comments and that will help me get everything working correctly so I can concentrate on textures only.  A special thank you to JobVanDam for helping me get this mod ported back to 32 bit Skyrim.  Check out his mods if you haven't already.\n<br />\n<br />[url=https://www.nexusmods.com/skyrim/mods/52067/]https://www.nexusmods.com/skyrim/mods/52067/[/url]?\n<br />[url=https://www.nexusmods.com/skyrim/mods/50389/]https://www.nexusmods.com/skyrim/mods/50389/[/url]?\n<br />[url=https://www.nexusmods.com/skyrim/mods/44081/]https://www.nexusmods.com/skyrim/mods/44081/[/url]?\n<br />[url=https://www.nexusmods.com/skyrim/mods/37635/]https://www.nexusmods.com/skyrim/mods/37635/[/url]?\n<br />\n<br />Installation:  It is recommended the mod be installed with the Nexus Mod Manager button in the files tab.If the armor is not visible in game try doing a manual installation:  \n<br />\n<br />1. Uninstall and delete from NMM. \n<br />\n<br />2. Manually download the file and open when the download completes. \n<br />\n<br />3. Navigate to your Skyrim  main directory.  Once there locate the Data folder. \n<br />\n<br />4. Drag and drop both the Data folder and the Samurai_Gear.esp file onto the Data folder in your directory. \n<br />\n<br />5. Verify installation. \n<br />\n<br />To verify installation double click on the Data folder in your main directory and verify that the Samurai_Gear.esp file is installed.  After that ensure both the texture and mesh files are installed in the right location.  Inside the Data folder in your main directory is a folder for meshes and textures. \n<br />\n<br />The mesh is located at  Data/meshes/armor/Reiko Redux/remnant_armor/male. \n<br />\n<br />The textures are located at Data/textures/armor/Reiko Redux/Remnant_armor. \n<br />\n<br />If any of those folders and not in the right place create them and then drag and drop the mesh and texture files from the downloaded file into the correct directory. I have seen this problem before when the mod is not installed using NMM.  If you choose not to install with NMM just create the folders where needed and drop in the files and the armor will be located in the appropriate crafting tab.",
  "categoryId": "54",
  "version": "1.12",
  "author": "Cain9580",
  "createdUnix": "1513128002",
  "updatedUnix": "1513902966",
  "containsAdultContent": false,
  "uploadedBy": "cain9580",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000261877",
      "name": "Reiko Samurai Armor Full Retexture",
      "version": "1.17",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "25132",
      "fileName": "Reiko Samurai Armor Full Retexture-88378-1-00.rar",
      "uploadedUnix": "1513127995",
      "modVersion": "1.17",
      "virusScanUrl": "https://www.virustotal.com/file/3504bad0c41b67261ed072aefcaed6358797e29fe0fdac1124e49ff95125553d/analysis/1513128210/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Reiko%20Samurai%20Armor%20Full%20Retexture-88378-1-00.rar?fid=1000261877&ttl=1535877539&ri=8192&rs=8192&setec=669d749f779f9f8693cf14fd4f2c178a"
    },
    {
      "fileId": "1000262422",
      "name": "Oldrym Port of Reiko Samurai Armor Retexture",
      "version": "1.12",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "35526",
      "fileName": "Oldrym Port of Reiko Samurai Armor Retexture-88378-1-12.rar",
      "uploadedUnix": "1513902966",
      "modVersion": "1.12",
      "virusScanUrl": "https://www.virustotal.com/file/8d6ef1c2e34253674ef0a856ccfd504750d8956a3f345020bbe6a5fbe569d08d/analysis/1513903026/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Oldrym%20Port%20of%20Reiko%20Samurai%20Armor%20Retexture-88378-1-12.rar?fid=1000262422&ttl=1535877540&ri=8192&rs=8192&setec=71d50a62146ab39209a3bb207be470d5"
    }
  ]
}