{
  "modId": 88382.0,
  "modName": "Embershard Mine - Enhanced",
  "summary": "Adds a couple crafting items to Embershard Mine - Tanning Rack and Smelter<br />Edits the original Transmutation and adds Tranmutation II Spell Book<br />Adds a single bed in place of a broken floor with a bucket",
  "descriptionHtml": "It never made sense to me that there would be a forge in the middle of the mine, without a smelter, So I added a smelter, and in order to craft items, most times leather and leather strips are used, so I added a tanning rack as well. To brighten the corner of the room with the chopping block, I added another torch in that corner, but attached it to the side of the tanning rack closest to the chopping block.\n<br />\n<br />The location of the bucket in the gap along side the \"sleeping\" room bugged me, so I turned it into another bedroom, by extending it's length slightly, filling in the gap and dropping a single bed into place.\n<br />\n<br />The spell books - Found in Embershard Mine, on the table near the forge.\n<br />Transmute : Vanilla Spell, Changes iron ore into silver ore... then silver ore into gold ore. IF you are trying to make silver items, this is a real pain, cast spell, drop the silver ore, cast spell drop ore... until you have enough silver ore, that you then have to pick up off the floor, or open a container to gather... all in all, a real pain to use...\n<br />This mod\n<br />Transmute I : Changes Iron Ore into Silver Ore.\n<br />Transmute II : Changes Silver Ore into Gold Ore.\n<br />\n<br />I also made the water in the forge room a little deeper, to allow swimming in a few spots. Depending on what mods are used, this can come in handy.\n<br />And on a final note, I made the misty fog over the water in the forge room a little thicker.",
  "categoryId": "91",
  "version": "1",
  "author": "Airianna",
  "createdUnix": "1513141620",
  "updatedUnix": "1513141620",
  "containsAdultContent": false,
  "uploadedBy": "AiriannaWW",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000261893",
      "name": "Embershard Mine Enhancement",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3",
      "fileName": "Embershard Mine Enhancement-88382-1.7z",
      "uploadedUnix": "1513141592",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/c6ae99af8ea4ad2004fe57864128d2a27bcc799303c17a60e2347ea2c4a16a55/analysis/1513141622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Embershard%20Mine%20Enhancement-88382-1.7z?fid=1000261893&ttl=1535877544&ri=8192&rs=8192&setec=546dd23cbe1ab5cbf5ad600173d13c51"
    }
  ]
}