{
  "modId": 88492.0,
  "modName": "Requiem - Watered Down Skooma",
  "summary": "Edit's Requiem's Skooma drastically, causing it to be much more debilitating narcotic, and adds the ability to craft it.",
  "descriptionHtml": "Previously in Requiem, Skooma is a very chaotic drug that turns you into what feels like a chaotic berserker of Sanguine. Your melee damage and stamina are significantly increased, with a brief down period of lethargy.  Now the drug is much more potent in keeping your stamina high, but causes a significantly longer period of lethargy. This encourages you to only use this in emergencies, where you know you can rest off the after effects of it. If you don't, then you're stamina and magicka will stay at 0, making you slow and inert in combat entirely! Use wisely and responsibly, and be ready to take a good nap after.\n<br />\n<br />Skooma now also has an increased value to it to make up for it's more punishing side effects. Balmora Blue now has most of Requiem's original skooma effects alongside mine, as well as a dramatically increased value. I did this because the game claims that this brew is a very rare and \"beyond priceless\" Skooma.\n<br />\n<br />You can now also craft Skooma for yourself! Just go to a cooking pot and mix some Nightshade with some Moon Sugar. You can also add double the amount for double the duration!\n<br />\n<br />I also removed the instant stamina effect of Redwater Skooma, and added a fluff text letting you know that the Skooma is not your typical variant.\n<br />\n<br />One final note is that you will no longer spontaneously die if you're unlucky. You will still take chips of damage randomly, while Balmora Blue has a much more toxic effect. Nothing a few healing potions can't fix.\n<br />\n<br />Requires Requiem. Load after any mod that would edit Skooma, including Requiem - Breaking Bad. Load before Requiem of the Indifferent.\n<br />\n<br />As of Requiem 2.0, this should still work, while of course overriding Requiem's new effects.",
  "categoryId": "24",
  "version": "1",
  "author": "Segolia94",
  "createdUnix": "1513808985",
  "updatedUnix": "1513808985",
  "containsAdultContent": false,
  "uploadedBy": "Segolia94",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000262362",
      "name": "Requiem - Watered Down Skooma",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Requiem - Watered Down Skooma-88492-1.zip",
      "uploadedUnix": "1513808733",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/dce4c6149549bede63c4f3ecd16642358fce4999e005f72d6111874ed22fffaa/analysis/1513808762/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Watered%20Down%20Skooma-88492-1.zip?fid=1000262362&ttl=1535877717&ri=8192&rs=8192&setec=116dad765303b457e8fc1daa6e371986"
    }
  ]
}