{
  "modId": 88502.0,
  "modName": "TERA Armors Enhanced Textures - DELETED",
  "summary": "2K and 4K Textures for asianboy345 TERA Armors Collection.",
  "descriptionHtml": "[size=3]This mod is dedicated to [url=https://www.nexusmods.com/users/588817]marmotte[/url]. Without him, his enthusiasm from the very beginning, his words and his demonstration of how much he liked my work, by using it in his mods and images, I would have never completed this hard task. He has also been a non-pushing enthusiast and that was important too. I hate to be pushed.\n<br />The fact that he is one of the best screenarchers of Skyrim sure gave his words and actions more weight. Check out his [url=https://skyrimscandal.blogspot.com]blog[/url], you'll see awesome images.[/size]\n<br />\n<br />\n<br />[center][color=#1e84cc][b][size=6]WHAT YOU NEED TO READ[/size][/b][/color][/center]\n<br />\n<br />[color=#674ea7][b][size=5]What's this mod about[/size][/b][/color][size=3]\n<br />This mod will change the aspect of almost all armors from Asianboy345 TERA armor pack. Look at the images to have an idea of the final result and, if you like what you see, download the file.[/size]\n<br />\n<br />[b][color=#ff0000][size=5]Requirements[/size][/color][/b]\n<br />[size=3]This mod will not work without [url=https://www.nexusmods.com/skyrim/mods/25846]Asiaboy345 Tera Armor Pack[/url] mod. \n<br />You can use it also with [url=https://www.nexusmods.com/skyrim/mods/74077]Robjunk BBP HDT UNP[/url] version or his [url=https://www.nexusmods.com/skyrim/mods/74077]UUNP[/url] version. The first one is actually not required, because all the meshes are in this mod (you'll still need HDT Physic Extension) but the second one is necessary and you have to keep it enabled in MO while (and only while) building the armors in Bodyslide, because not all UUNP file are in this mod. Of course my mod must be the last in your left panel mod list.\n<br />\n<br />I won't repeat the requirements for using any of these 3 mods. Refer to the appropriate mod page.[/size]\n<br />\n<br />[color=#e69138][b][size=5]Installation[/size][/b][/color]\n<br />[size=3]Since there are 3 mods you could start with and there are 2 or more versions of most of the female armors, I've made a very complex FOMOD. I've no idea how NMM will handle it; I strongly suggest you use Mod Organizer. \n<br />\n<br />With MO I don't even need to tell you how to install, just follow the instructions.  You can also remove the mod without any problem and you can change and merge this mod with any new installation.\n<br />Renaming the mod, you can also install more than one version of each armor, if you want, and switch from one to the other as you please, by just enabling and disabling the second installation folder. For UUNP users to do the latter, you'll need to move the meshes files, after building them with Bodyslide, from the overwrite folder, to this mod folder and then do the same with the second installation, moving it to the second mod folder (otherwise, if left in overwrite, the second one will always be used).\n<br />I hope I've been clear enough without writing an actual tutorial. Let me know if you need further explanations.[/size]\n<br />\n<br />[size=3]If you don't know how UUNP works, take a look at [url=https://www.nexusmods.com/skyrim/mods/49015]Bodyslide [/url]mod page. It's not difficult to use and it gives you lots of sliders to further customize your female characters' body.[/size]\n<br />\n<br />\n<br />[center][color=#f1c232][b][size=6]WHAT YOU DON'T NEED TO READ[/size][/b][/color][/center]\n<br />\n<br />[color=#3d85c6][b][size=4]Why[/size][/b][/color]\n<br />[size=3]Why did I started this project? \n<br />Because I love TERA armors, but they come from an old game and the textures were too old and ugly to be used with all the wonderful textures other modders have created for us. So, even if I had never done any real work on photoshop, I decided to give it a try. \n<br />I'm still a newbie with photoshop and I can hardly paint anything with brushes, but I've learned a lot in the meanwhile. That's one reason why there is not much consistency in my armors and some of them are very beautiful while others are not so much better than the original ones.[/size]\n<br />\n<br />[color=#6aa84f][b][size=4]How[/size][/b][/color]\n<br />[size=3]I need a texture to begin with; I can't paint, I'm not an artist! I made all my work applying a set of filters I created myself in the course of time by trial and error. They are really complex and the few people that have dismissed my work as just resizing the image and reducing the brightness don't know what they are talking about and forgot to keep in mind one simple fact: if it's so simple, why don't anyone else do it? ;)\n<br />Anyhow, that's why I call them Enhanced Textures and not Retextures. I'm very honest, don't you think?[/size]\n<br />\n<br />[color=#cc0000][b][size=4]Issues[/size][/b][/color]\n<br />[size=3]All issues depends on the meshes, and I can't do anything about them. Unfortunately many meshes, both male and female have been badly created. \n<br />Many male meshes have no weight sliders; many female armors have clippings, bend in wrong, weird ways and if you widen the arms or the legs, some of them present you with an horrible view. Unfortunately, the few skills I have are with photoshop. I can't work with 3D programs, so I can do anything about this problems.\n<br />Even so, they are still enjoyable. You just need to avoid some poses with some of the armors.\n<br />\n<br />There actually is one issue I created and it's so important I explained it in the FOMOD too. The transparency in Skyrim works in a way that is incompatible with Deep of Fields effects. This mean that some of the armors can't be used with DoF. So you either don't use DoF with some armors or you renounce to use some skimpy version, even if you like them and choose a Standard or a non-transparent Skimpy version, if there's one. This problem too could be resolved by making new meshes, separating the non-transparent parts, for example and most importantly the pauldrons, from the parts that need transparency and that are actually not a problem because they adhere to the character body. Still can't work with meshes. :)\n<br />I've noticed that transparency also make the armor invisible underwater. I guess that's another limit of Skyrim engine.[/size]\n<br />[color=#674ea7][b][size=4]\n<br />Images[/size][/b][/color]\n<br />[size=3]All my images have been made with the UUNP version and with a little tweaked version of[url=https://www.nexusmods.com/skyrim/mods/54362] Somber Dreams ENB[/url]. \n<br />Besides the almost-manikin-style images that make the showcase in the FOMOD, I wanted to made other more \"natural\" and pleasing-to-see images to advertise better the mod and make it more alluring, but I don't have time to do that. I'd like you to fill the gaps and upload your images to make this modpage colourful.[/size]\n<br />[center][color=#ff00ff][size=5]\n<br />[b]Feedback and satisfaction[/b][/size][/color][/center]\n<br />[size=3]There are 4 types of feedback you can give me, in order of importance they are:\n<br />\n<br />[/size][list=1]\n<br />[*][size=3][b]Problems[/b]: if there's a problem, please notify me so I can take care of it. I made some test, but I can't be sure everything works as intended. [/size]\n<br />[*][size=3][b]Endorsements[/b]: if you know me, you know that I don't care about Endorsement, but, for mods, they still are the only way a mod can became more visible among the others. So if you liked it, please come back to endorse, so that other people can find it more easily and enjoy it too.[/size]\n<br />[*][size=3][b]Words, Images, Videos[/b]: if you want to express your gratitude with words, or even better by using my work for creating images or videos, I'll be very pleased.[/size]\n<br />[*][size=3][b]Donations[/b]: I'll talk about that in the following section.[/size]\n<br />[/list][color=#38761D]\n<br />[/color][center][color=#38761D][size=5][b]Donations [/b][/size][/color][/center]\n<br />[size=3]I can't possibly ask for money for this mod even if I wanted to. I worked on \"En Masse Entertainment\" assets ported on Skyrim by Asianboy345 and other guys and I used textures and cubemaps made by many other people.\n<br />Yet...\n<br />since I worked so hard for so long (more than one year),\n<br />since the final result is good, sometimes very good,\n<br />since I've been unoccupied for almost 8 years\n<br />if...\n<br />you really like the mod,\n<br />you're living in a rich country,\n<br />you're yourself living a comfortable life and giving away 1 to 10 dollars have no weight on your monthly budget,\n<br />I could accept some donation, not for the product itself, but for the effort I made.\n<br />\n<br />(Donation are available only while you endorse and on my profile).[/size]\n<br />\n<br />[center][color=#ffe599][b][size=5]Further Modding[/size][/b][/color][/center]\n<br />[size=3]I'll very impudently say that some money cold make me mod a little longer a little harder in the next months, but, to make it clear that I'm not making a threat: \"give me money or I won't work for you\", I'll tell you that:\n<br />[/size][list=1]\n<br />[*][size=3]I'm perfectly aware of my very limited skills, and that not so many people will even care if I'd stop modding altogether.[/size]\n<br />[*][size=3]Even if I'll get zero money from this mod, I'll still mod a little bit, once in a while, for the same reason I did it so far. I do it for myself, to improve the visual aspect of my game and, with a little more effort, I'm glad to share it with you. In fact I actually worked on a lot of textures while taking shots for this very mod and I'll do it again in the future.[/size]\n<br />[*][size=3]Even if I'll get a LOT of money, let's say, for the argument sake, even 1000 dollars, I won't work in the future as hard as I did this year. That's because I'm 41, without a job, without a family, without a life. I need to get my priority straight and look after myself. Even an absurd sum as 1000 dollars (absurd as coming from donations), you know too, wouldn't allow me to do that. What I need is a real job, maybe less intellectually satisfactory, but economically more rewarding.[/size]\n<br />[/list][size=3]\n<br />[center][color=#ffff00][size=6][b]Q&amp;A[/b][/size][/color][/center]\n<br />[b]Why did it take so fucking long to make this mod and yet you say you worked so hard on it?[/b]\n<br />Many reasons:\n<br />[/size][list=1]\n<br />[*][size=3]When I started, I had never done anything like this before nor did I even made other than the simplest things with photoshop, like image collages for example.[/size]\n<br />[*][size=3]My PC broke down. I've been 2 months with a PC that turned itself off after 5 to 10 minutes in Skyrim (you can't imagine the frustration in working in such conditions) and I've been 3 months without any PC at all.[/size]\n<br />[*][size=3]There are 128 armours!!!! You know that, don't you? I only worked on 124, but they are still a LOT![/size]\n<br />[*][size=3]I spent a lot of time creating the Skimpy versions. I know that only a small percentage of you will use them, but I love to create (and use) them.[/size]\n<br />[*][size=3]I'm a perfectionist. With this I don't mean to say that my textures are perfect, but that in every situation I always try to do my best, so I worked on each armor at the best of the skill I had when doing it (I've actually redone a few armors more than once).[/size]\n<br />[/list][size=3][b]\n<br />Will you make a CBBE version?[/b]\n<br />No, unless somebody explain me why they look so bad. Differently than in my old mod (someone maybe remember it), I checked the CBBE version this time, and I saw that they look like shit! Most of them look like if made of glass and I mean non-transparent, smooth, hard, shadowless glass. The problem must be in the meshes but I can't understand where. If somebody manage to find what's the problem and gives me a solution, I'll be glad to make a CBBE version.\n<br />\n<br />[b]Why there are 4 missing Male armors?[/b]\n<br />You must know that there are 2 kind of weightless armors in this pack, one that I call the \"Slim man\" where the aspect of the character wearing the armor is fixed to a slim, athletic physique; with some work on Body Slides the \"Slim man\" can even be made to look almost as if at 100 Weight (and I did that in my screenshots). The second kind is what I call the \"Sick man\" and here the character look like sickly thin. Those 4 armors I didn't released are of this second kind. They are not the only ones, but after working so long and so hard, I decided not to waste any more of my time on something that will look like shit anyway.\n<br />\n<br />[b]Why some armors are marvelous while other looks not so cool?[/b]\n<br />Not cool? You're telling me you don't like my work? I'll strike you with a fireball from my arse!!! :D\n<br />Jokes apart, there are mainly 2 reasons:\n<br />[/size][list=1]\n<br />[*][size=3]My method of working have its limits. Some textures are simply too hard to enhance, for example completely white or black textures are the worse to work with.[/size]\n<br />[*][size=3]I started this project more than a year ago. In the meanwhile I improved a little bit, so the first armors I worked with look worse than the last.[/size]\n<br />[/list][size=3]\n<br />[b]Why don't you start over with the first armors now that you have more skills with photoshop? [/b]\n<br />Are you kidding?! I want a life!!!! [/size]\n<br />\n<br />[center][b][color=#ff0000][size=6]Credits[/size][/color][/b][/center][size=3]\n<br />[b]Bethesda                                                                   [/b]for creating the game, of course.\n<br />[b]En Masse Entertainment/Bluehole Studios[/b]        for creating these awesome armors.\n<br />[b][url=https://www.nexusmods.com/skyrim/users/3305664]Silver0236[/url][/b]                                                                  for acquiring the permission to use En Masse  Entertainment assets and for starting the porting\n<br />[b]Many other modders for individual armors       [/b]see Asianboy345 modpage for details.\n<br />[b][url=https://www.nexusmods.com/skyrim/users/2113195]Asianboy345[/url][/b]                                                            for completing this armor pack.\n<br />[url=https://www.nexusmods.com/skyrim/users/4119793][b]Robjunk[/b][/url]                                                                     for the UNP BBP HDT and the UUNP meshes  (without which I would have discarded the entire pack months ago).\n<br />[url=https://www.nexusmods.com/skyrim/users/4119793][b]Robjunk                                                                   [/b][/url]for a few textures I've used.\n<br />[url=https://www.nexusmods.com/skyrim/users/4119793][b]Robjunk                                                                   [/b][/url]for some ideas on skimpiness.\n<br />[url=https://www.nexusmods.com/skyrim/users/6364795]Toastbre4d                                                             [/url]for the excellent Blade Dancer retexture.\n<br />[url=https://www.nexusmods.com/skyrim/users/4717166]JohnAzerty                                                             [/url]for the excellent Val Tirkai Gold retexture.\n<br />[url=https://www.loverslab.com/topic/51192-luxury-collection-for-cbbe-hdt-bodyslide/]Rayne1023 and [/url][url=https://www.loverslab.com/user/527611-apokrytia/]ApoKrytia[/url]                                    for a few textures I've used from their Luxury Collection Pack.\n<br />[url=https://www.nexusmods.com/skyrim/users/979887/]Halofarm                                                                 [/url]for paladindark cubemap, the most awesome cubemap of all Skyrim. I've used it a LOT.\n<br />[url=http://www.humus.name/]Humus                                                                     [/url]for creating tantoluden cubemap\n<br />[url=https://www.nexusmods.com/skyrim/users/1734939/]billyro                                                                       [/url]for porting tantoluden cubemap into Skyrim\n<br />[url=https://www.nexusmods.com/skyrim/users/2509011?]jmenaru[/url]                                                                    for bloodfree_y cubemap\n<br />[b]Every modder in this community[/b]                       for making this game so awesome!\n<br />                                \n<br />I have moved all the cubemap I use to a separate folder and put them at the end of my mod list to avoid overwriting them and I have even renamed some of them, so now I don't know which mod they came from and the author who made it: \n<br />chitin_e cubemap (Cabal120?); \n<br />chitin_e_ebony cubemap (Cabal120?); \n<br />chitin_e_ebony2 cubemap (I most likely renamed it); \n<br />steel_e cubemap (I most likely renamed it)\n<br />ore_moonstone_e, ore_silver_e, quicksky_e, shinybright_e cubemaps (haven't the slightest idea, some of them could even come from the vanilla High Resolution DLC)\n<br />[color=#ff0000][b][size=4]If you can, help me give each author his well deserved credit.[/size][/b][/color][/size]",
  "categoryId": "29",
  "version": "4.0",
  "author": "Arjuna76",
  "createdUnix": "1513978744",
  "updatedUnix": "1516025301",
  "containsAdultContent": false,
  "uploadedBy": "Arjuna76",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000262402",
      "name": "Cubemaps that Still need to be credited",
      "version": "2.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2238",
      "fileName": "Cubemaps that Still need to be credited-88502-2-0.7z",
      "uploadedUnix": "1513874691",
      "modVersion": "2.0",
      "virusScanUrl": "https://www.virustotal.com/file/0945840bfe60b129fac3618f2863fcf582d08af0cb0598c56865eb8f7ee42407/analysis/1513874710/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cubemaps%20that%20Still%20need%20to%20be%20credited-88502-2-0.7z?fid=1000262402&ttl=1535877733&ri=8192&rs=8192&setec=edc6f487cedbf1f501a616f4f15b930a"
    },
    {
      "fileId": "1000262464",
      "name": "Tera Armors Enhanced Textures 2K",
      "version": "2.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "1042443",
      "fileName": "Tera Armors Enhanced Textures 2K-88502-2-0.7z",
      "uploadedUnix": "1513967733",
      "modVersion": "2.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tera%20Armors%20Enhanced%20Textures%202K-88502-2-0.7z?fid=1000262464&ttl=1535877734&ri=8192&rs=8192&setec=9b1342709417386c1c1830b27135135c"
    },
    {
      "fileId": "1000262721",
      "name": "ModuleConfig",
      "version": "2.0a",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "33",
      "fileName": "ModuleConfig-88502-2-0a.7z",
      "uploadedUnix": "1514323675",
      "modVersion": "2.0a",
      "virusScanUrl": "https://www.virustotal.com/file/cd604d3ea65c813fa956bf1e23b0343ab215d797af7c12ffb2d746f576e2793f/analysis/1514323742/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModuleConfig-88502-2-0a.7z?fid=1000262721&ttl=1535877734&ri=8192&rs=8192&setec=b3f70cfad68c0d8f8c40bcf6b53e8e16"
    },
    {
      "fileId": "1000262761",
      "name": "ModuleConfig",
      "version": "2.0b",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "33",
      "fileName": "ModuleConfig-88502-2-0b.7z",
      "uploadedUnix": "1514369487",
      "modVersion": "2.0b",
      "virusScanUrl": "https://www.virustotal.com/file/dbfc7c4174016d241e94e2d365c3958800d28c36490fc219145adc365c761b97/analysis/1514369522/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModuleConfig-88502-2-0b.7z?fid=1000262761&ttl=1535877735&ri=8192&rs=8192&setec=a5b34eb1a83cba5547836b7b51bada9c"
    },
    {
      "fileId": "1000263526",
      "name": "TERA Armors Enhanced Textures 4K",
      "version": "4.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "2450214",
      "fileName": "TERA Armors Enhanced Textures 4K-88502-4-0.7z",
      "uploadedUnix": "1515349594",
      "modVersion": "4.0",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/TERA%20Armors%20Enhanced%20Textures%204K-88502-4-0.7z?fid=1000263526&ttl=1535877735&ri=8192&rs=8192&setec=40f68ddbaffd11058670d6127f01b7fa"
    },
    {
      "fileId": "1000264032",
      "name": "ModuleConfig",
      "version": "2.0a",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "33",
      "fileName": "ModuleConfig-88502-4-0a.7z",
      "uploadedUnix": "1516025301",
      "modVersion": "2.0a",
      "virusScanUrl": "https://www.virustotal.com/file/2628a6fbe597333eb1839f419854802c9d1c639c41b91242d9160ebbdece5d4e/analysis/1516025642/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/ModuleConfig-88502-4-0a.7z?fid=1000264032&ttl=1535877736&ri=8192&rs=8192&setec=bb4f4e2d9f93c1086d9d6daef2785688"
    }
  ]
}