{
  "modId": 88613.0,
  "modName": "Forgeable Circlets",
  "summary": "With this mod circlets can now be forged, corundum now takes the proper name of &#34;copper&#34;, jade circlets (a non-metal) have now become glass (crafted using malachite, which is a metal), (blue) moonstone is now simply just moonstone and onyx circlets can be crafted by orichalcum (placeholder). This is my first ever mod. :)",
  "descriptionHtml": "[b][color=#ff0000]Just discovered (before uploading) that there is another mod titled &#34;[url=https://www.nexusmods.com/skyrim/mods/80680/?]Improved Craftable Circlets[/url]&#34; which shares the core principal of this mod.[/color] My version does vary from the other mods and comes with a couple new features.\r<br />[color=#ff0000]\r<br />Also, this mod does not use nor modify any of the files from Improved Craftable Circlets, Craftable Circlets or JewelCraft. [/color][/b]\r<br />\r<br />I initially wanted to use JewelCraft myself but was disappointed by its Steel Ingot recipe, and the further bloat that came with the mod. I even had a couple ideas of my own. This mod aims to keep the Steel&#39;s Iron and Copper (Corundum) crafting recipe intact while still offering to rename Corundum into Copper and allow the player to forge Circlets.\r<br />\r<br />[b]Features:[/b][list]\r<br />[*]Corundum ores, ore veins and ingots are now Copper (now the Steel smelting recipe makes sense). (Fix-sorta)\r<br />[*]Jade circlets are now Glass circlets and hence are crafted using Malachite.\r<br />[*]Blue Moonstone (texture) is now normal Moonstone. (Fix)\r<br />[*]Sapphire gemstones are no longer grey. (Fix)\r<br />[*]Onyx circlets have been renamed to Orichalcum and thus are crafted using Orichalcum.\r<br />[*]Circlet prices have been altered to match (or marginally improve on) the value of the items used in the recipes.\r<br />[*]Gems necessary for crafting need to be Flawless.\r<br />[*]Circlets have been renamed to fit the naming structure of necklaces and rings, e.g. &#34;Gold Ruby Circlet&#34; instead of &#34;Gold and Ruby Circlet&#34;. (Fix)\r<br />[/list]\r<br />[b]Justification:[/b]\r<br />As Jade Circlets were green and metallic, unlike jade itself, I chose a similarly green-tinted metal to be used in its crafting recipes: Malachite. To make up for the blue tint I&#39;ve retextured Jade Circlets to look like malachite and even renamed them to Glass Circlets, like Glass Armor.\r<br />\r<br />I&#39;m not going to add Onyx to the game, as this is my first mod (with no real mod developing experience prior), so as a placeholder I will be using Orichalcum instead of using Ebony. Ebony isn&#39;t very attainable early in the game and the only onyx circlet available originally had a value of 50, so I thought Orichalcum would be a valid substitute as a cheap green-ish gemstone, even if it&#39;s [i]actually [/i]a metal.\r<br />\r<br />The usage of Flawless tier gemstones is to prevent the player from mass producing the more expensive circlets for profit. It also wouldn&#39;t make sense for Jarls to wear such easily craftable jewelry.\r<br />\r<br />[b]Changelog[/b]\r<br />[b]1.1:[/b][list]\r<br />[*]Sapphires aren&#39;t as bright anymore. Looks more fitting when compared to ruby and emeralds in circlets.\r<br />[*]Moonstone looks more like moonstone than a light-brown stone\r<br />[/list][b]1.0:[/b][list][*]Initial release.\r<br />[/list]",
  "categoryId": "102",
  "version": "1.1",
  "author": "Muizz",
  "createdUnix": "1514436830",
  "updatedUnix": "1514475329",
  "containsAdultContent": false,
  "uploadedBy": "muizzsiddique",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000262806",
      "name": "Forgeable Circlets",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "201",
      "fileName": "Forgeable Circlets-88613-1-0.zip",
      "uploadedUnix": "1514435965",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/8c57db516fbe6862fa05f4d29808bfaf7a0ae2c4d3dfbcdee7349e8c9d5fb64d/analysis/1514436243/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forgeable%20Circlets-88613-1-0.zip?fid=1000262806&ttl=1535877872&ri=8192&rs=8192&setec=0db9354e40cc9fdc50f57ef0eaf14d68"
    },
    {
      "fileId": "1000262833",
      "name": "Forgeable Circlets",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "190",
      "fileName": "Forgeable Circlets-88613-1-1.zip",
      "uploadedUnix": "1514475329",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/b82e38752cc634f0038d37ea14bf3573497f1d22c071e5ddc6a4004ed51f55d8/analysis/1514475662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Forgeable%20Circlets-88613-1-1.zip?fid=1000262833&ttl=1535877872&ri=8192&rs=8192&setec=c7095983215b3863c0e5ce3d12c23b98"
    }
  ]
}