{
  "modId": 88669.0,
  "modName": "reduce z-fighting and ocean water holes - additional system suggestions",
  "summary": "additional hints to cure z-fighting problem (flickering distant objects), distant water hole problems, some hardware problems and recommendations for a reasonable skyrim related system and hardware setup",
  "descriptionHtml": "z-fighting and distant ocean water holes expecially around the winterhold college are common and annoying problems in many setups, mostly if you use higher res ini settings or customized near distance camera view settings. the z-fighting problem (flickering distant objects , mostly snowy montains) bugged me  and so I played around with different ini settings. it seems to me obvious that there is a direct relation between camera view settings and the amount of z-fighting. i tested both, first and third person view. by the way if you don't follow the step guide to fix the z-fighting problem you may even prevent another problem mentioned under ocean water fix.\n<br />\n<br />in s.t.e.p guide the value fNearDistance=20.0000 is offered as part of an ini fix.  for me this value was not sufficient and i don't know if it manipulates both values for first and third person view. \n<br />it even includes a recommendation i tested with the value fSplitDistanceMult=4.0 in prefs ini. [u]\n<br />i recommend to install skyrim reloaded mod and to finetune with the skyrim reloaded camera mode values[/u] as i did. seperated for first and third person view from 7 to 100.  as skyrim reloaded is for me\n<br /> an essential mod (offering superior performancefriendly features and settings for water and some other features like better shadows) you may think about using it.  other camera view mod may also offer first and third person view ini settings or you may do it by using the console.\n<br />\n<br />the higer the value the lower the z-fighting is. using a value of about 80 seems to be enough to reduce z-fighting to a minimum almost not visible any more.\n<br />for me this works regradless of any other ini setting. the downside of this setting is that clipping in very close distance views will occur, even more the higher the value is. so i suggest to use a compromise setting. a value of about 40 to 80 for third person view to avoid z-fighting and a lower setting about 10 to 20 for first person view to avoid clipping issues with character body parts. you may finetune it for the best compromize and compare the result of the different settings while switching from 1st to 3rd view and move your character slightly.\n<br />you may alternatively also try to optimize the z-fighting with the  ini parameter fNearDistance= located in the [Display] section \n<br />\n<br />[u]ocean water fix\n<br />[/u]this problem seems to have different reasons, not only one. [u]\n<br />important[/u] and to prevent any misunderstanding:my contribution does not cover all engine or culling related errors but the one introduced by wrong ini-settings.\n<br />[url=http://wiki.step-project.com/Guide:Z-Fighting]a setting recommended by s.te.p.[/url] or often manually set values seem to be responsible for disappearing distant ocean water textures: fSplitDistanceMult=4.0 or at least more than 0.5 are responsible (located in prefs ini)! [b]in this special case do not follow the s.t.e.p. recommendation[/b]!\n<br /> [u][b]do not use a value higher than about 0.5[/b] if you don't like these big holes in the distant water. \n<br />[/u]correct setting should prevent most of the distsant waterholes. it does not prevent some additional single holes related to wrong culling or some engine related lod errors! \n<br />\n<br />you may also check the mod \"Culling data glitch fix\"\n<br />\n<br />\n<br />[u]additional guide for a smooth and ctd free skyrim le (oldrim) setup[/u]\n<br />with some skyrim gaming and it related experience i can provide you with some additional infos which may lead to a stable, performant, stutter and ctd free skyrim le experience.\n<br />if you encounter problems you may compare your hardware and setup with my recommendations and it may be easier for to find some weaknessses or reasons for suboptimal gaming experience. some hints may work also with sse but beware this guide is for oldrim (32bit) and mo v1.311as the most comprehensive mod organizer for skyrim le.\n<br />\n<br />[u]recommendations for hardware &amp; system specs\n<br />[/u]skyrim is hardware hungry even if you want to have fun and to apply some or probably many nexus mods, high res textures, skse, enb, dof, hdr and...\n<br />for a stutter free experience i recommend at least a quad core cpu, haswell or later with 3 Ghz,  ryzen with 3,5 Ghz, raphics card gtx 980m 8GB or gtx1060 laptop 6GB or b etter, 16 GB 1600 DDR 3 ram and a 250GB ssd (evo 850 class).  more is always better. \n<br />upgrading cpu (at least i5-8600K or i7-7700 or comparable amd, slightly overclocked) with strong single core performance and gpu with fast 6 or even 8 GB VRAM seems to be very helpful for good performance. fast cpu with at least 6 cores or 4core 8threads config with 4Ghz or more seems to be the sweetspot for a smooth running modded skyrim le.\n<br />for a stable hardware be aware to place external usb wlan and bluetooth devices at least 50cm/20inches away from your ports and other devices! i recommend to use an extension cable otherwise you may encounter instabilities or bad bandwidth with hdmi, usb 3.0 and other devices and check the specifications of your hdmi cables if used. older cables may also lead to instabilities due to insufficient bandwidth.  if you use hdmi be shure to pick a good cable (certified 2.0 standard)! \n<br />for le win 7 64 bit is still a very good operating system for skyrim/DX9 games. no vram cap like in win 10 and lesser unnecessary or aggressive tasks in the background, but win 10 dx11 also works fine. system settings for both versions could be about the same. be aware of some restrictions using the program folder in win 10. i do not recommend to intsall games in the default program path.\n<br />to utilize the available hardware you first enable your tesv.exe to be 4GB aware (just google for 4GB awareness and the available tools to pimp your file).\n<br />download the latest available skyrim enb with memory hack (enboost) availability. the enb will enable skyrim to overcome the 32bit/4GB memory limitation while loading high res textures to be used to display the graphics. and  this is the reason why 16GB system memory and at least 6GB of fast vram is part of my recommendation. you have to configure enblocal.ini vram setting to a value of [b]VideoMemorySizeMb=10240[/b] (6GB vram + part of system memory) or even more to enable skyrim to use the available memory.  additionally you set [b]ReservedMemorySizeMb=256[/b] which is in almost all cases the best setting but you may try 128 and 512 if you like to experiment.\n<br />tes5.exe configured with enb mem hack and 4GB awareness patch will never reach the 32 bit related memory limit if enb is correctly configured and by the way you have killed the most common reason for an unexpected ingame crash to desktop (ctd).\n<br />the ssd is recommended to reduce file loading related microstutter to a not recognizable minimum. another reason for microstutter can be the unpacking process of a bigger or badly packed bsa file. i recommend to unpack all bsa files including the vanilla ones and install them all like a common mod in modorganizer. the big advantage is, that archive invalidation and related problems are history and not needed anymore and you can use the left pane in modorganizer(mo) to fully control which mod wins over another mod. so the next recommendation is to use mo as the superior tool to organize your mods at least until vortex is not fully operational and safe for use.  another reason for microstutter can be bad driver, bad energy management, or a graphics card with bad hardware configuration like a gtx 970 with 4GB but divided memory bandwith (256 bit to 224 bit and a very slow 32bit part) configuration including the potential to produce stutter. \n<br />\n<br />to make gameplay even more smooth you may try the sysinternals windows system tool \"process explorer\" which offers the option to manipulate the priority level of a system task. i recommend to set tesv.exe to high and to check if there is another task running with real time or high prority. if so try to lower it by one step. you may also suspend all tasks you do not need for playing session while omitting essential tasks. be aware: suspending an essential task may freeze your windows session.\n<br />absolutely disable or suspend any kind of anti virus if possible (they may resist due to safety reasons). tasks like anti virus and some other agressive background tasks may interfere with the game task while sometimes leading to unwanted stuttering or ctd. this is the reason i personally do not use online or background dependent antivirus programs. intstead i recommend to perform periodically a manually initiated virus check.  \n<br />\n<br />more information and hints depending on questions or suggestions may follow later on here or in a seperated thread...\n<br />i hope this information is helpful for you and it helps to reduce your z-fighting and/or water hole problems! if the harware/system info is helpful your feedback is also much appreciated!\n<br />\n<br />you may download my info file including a screenshot of my skyrim reloaded camera view settings for an endorsement if you find this info useful and i also invite you to leave a feedback or constructive comment.\n<br />\n<br />before posting other z-fighting-solutions based on esp or other files: [u]read the whole description[/u] and try my ini related method with skyrim reloaded. ask if you encounter problems. in the best case you do not need any esp or other files anymore in worst case your porblems still exist and are related to other reasons.\n<br />please let me know (including your hardware) if the fix does not work as described. thank you!\n<br />\n<br />[b]you may watch [url=https://www.nexusmods.com/skyrim/search/?gsearch=xrayy&amp;gsearchtype=authors&amp;tab=mods]my other skyrim mods here.[/url][/b]\n<br />\n<br />have fun playing skyrim!",
  "categoryId": "62",
  "version": "1.0",
  "author": "xrayy",
  "createdUnix": "1514720369",
  "updatedUnix": "1514720369",
  "containsAdultContent": false,
  "uploadedBy": "xrayy",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263051",
      "name": "camera view z-fighting settings",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "543",
      "fileName": "camera view z-fighting settings-88669-1-0.7z",
      "uploadedUnix": "1514719484",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/92eed057c76f4b4a54c379e9bb3d25004ee0f613ccfb2a5e5238ce8762aa32dd/analysis/1514719504/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/camera%20view%20z-fighting%20settings-88669-1-0.7z?fid=1000263051&ttl=1535877971&ri=8192&rs=8192&setec=7e1f810f780ea76711789f78b925fbe8"
    }
  ]
}