{
  "modId": 88688.0,
  "modName": "Binary Diff Wrapper - tool for esm patching",
  "summary": "It's a utility for file patching that allows (but is not restricted to) automatically clean DLCs at the click of the button, without breaking Bethesdas copyrights",
  "descriptionHtml": "[size=4][url=https://www.nexusmods.com/skyrimspecialedition/mods/14366][size=2]Go to SSE version[/size][/url]\n<br />\n<br />WHAT IS IT[/size]\n<br />\n<br />[size=2]It's an open source program written in Java ([url=https://github.com/Deltharis/binarydiffwrapper]source code[/url]) that's a wrapper around another open source tool (bsdiff) for binary diffing. What's that? Well, there are basically two ways in which you can change a file. Either you do that with a program that knows what it's doing, opens it correctly, knows it's structure and is capable of making changes that don't break that... Or you look at the file as a long string of ones and zeroes, and try to find out where to delete and where to add more ones and zeroes so that you get the expected result. Binary diff is the second approach, and is widely used in, for example, patching .exe files when releasing new version of software (to avoid sending the entire file again).[/size]\n<br />\n<br />[size=4]HOW DOES IT WORK[/size]\n<br />\n<br />[size=2]The program itself is the .jar file. To run it you need to have [url=https://java.com/download]Java Runtime Environment[/url] installed on your system. When you do you can use it by double-clicking it. Once run it will find every .diff file in the current directory and try to run the changes contained within.\n<br />Each .diff file is actually a .zip file containing exactly two files - configuration .json file, and actual patch. Json file contains information what file is the patch for and hashes that make sure you run the diff on exactly the same file it was created for. If the hashes match it does the actual patching (saving the original file in the backup folder), and confirms it succeeded by comparing resulting file hash with the expected one from config. If it worked - voila, your file is changed exactly as the person who gave you the .diff file wanted it to be. It is safe to run multiple times (it won't do anything to a file that does not match the hash saved in it's configuration), and unless creator of the .diff file itself was malicious it has no chance of breaking anything on your computer.[/size]\n<br />\n<br />[size=4]DLC CLEANING[/size]\n<br />\n<br />[size=2]Along with the program I include a pack of 4 .diff files that change stock up to date Skyrim DLCs esms and Update.esm into their cleaned versions. Cleaning was done by me using TES5Edit/SSEEdit (as appropriate for the game) 3.2 following [url=https://afkmods.iguanadons.net/index.php?/topic/4110-manual-cleaning-skyrim-and-skyrim-se-master-files/]this guide[/url] to the letter.﻿ For Oldrim CRC checksums of resulting files will be exactly as shown in that guide, for SSE they will differ (because .esm files seem to have changed slightly with game updates).\n<br />\n<br />To use them simply place the program itself (the .jar file), and four diff files in your Skyrim Data folder, than run it. Allow the bspatch.exe to do it's work when Windows prompts you to do so (on Windows 10 for me it asks for each file that gets patched). You can see the log of what happned in BinaryDiffLog.txt file that gets created. [/size]\n<br />\n<br />[size=4]CREATING YOUR OWN DIFF FILES[/size]\n<br />\n<br />[size=2]As will be made clear in the next section there are important things to consider when creating .diff files, therefore I did not include any functionality easing up the process of creating more - but it is entirely possible and not very hard anyway. For instructions for this see [url=https://github.com/Deltharis/binarydiffwrapper]project page on Github[/url]. Everyone is free to post their diff files anywhere they deem appropriate.[/size]\n<br />\n<br />[size=4]SAFETY WARNINGS[/size]\n<br />\n<br />[size=2]Binary diffing is an inflexible but powerful tool. In principle there is nothing stopping anyone from sending out a .diff file that would change your Skyrim.esm into 10 hour Rickroll video. Or infected files. That's why every user is encouraged to treat them cautiousness.\n<br />\n<br />Also, while this format makes it easy to distribute small changes without fear of breaking copyright - it is entirely possible to break copyright laws with it. As mentioned above, diff can change a file into entirely different file. In the extreme, a diff between an empty file and some copyrighted file is the whole copyrighted file. Compressed files are known to change their entire structure with the smallest change to it's insides, which could make the diff file contain more information than copyright holders are comfortable with. Be very cautious of anyone distributing .diff files bigger than, say, 10% of the file they're changing.[/size]",
  "categoryId": "39",
  "version": "1.0",
  "author": "Michalius",
  "createdUnix": "1514823700",
  "updatedUnix": "1514823700",
  "containsAdultContent": false,
  "uploadedBy": "Michalius",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263127",
      "name": "BinaryDiffTool.jar",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "739",
      "fileName": "BinaryDiffTool.jar-88688-1-0.7z",
      "uploadedUnix": "1514817126",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/088a7880fec75794b7a9846a8ceff327a7d16e606e65da4eebf0035ba8545a28/analysis/1514817184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BinaryDiffTool.jar-88688-1-0.7z?fid=1000263127&ttl=1535878003&ri=8192&rs=8192&setec=4252b33578f9533d71243073348a18fb"
    },
    {
      "fileId": "1000263128",
      "name": "Clean DLC .diff files - Oldrim",
      "version": "1.0",
      "categoryId": "6",
      "categoryName": null,
      "isPrimary": false,
      "size": "72",
      "fileName": "Clean DLC .diff files - Oldrim-88688-1-0.zip",
      "uploadedUnix": "1514817262",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/a3392c536b20b25b86ccc3bcd4b7721fa4cc9165b487a07a1e0f171257e27326/analysis/1514817303/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clean%20DLC%20.diff%20files%20-%20Oldrim-88688-1-0.zip?fid=1000263128&ttl=1535878004&ri=8192&rs=8192&setec=e52b60ba48d2f08705f06fee00483d07"
    },
    {
      "fileId": "1000263132",
      "name": "Clean DLC diffs",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "72",
      "fileName": "Clean DLC diffs-88688-1-0.7z",
      "uploadedUnix": "1514821655",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/03ae0ea762d6a04e67db79abe4ca133b6695a009143c92feea2504e6bd400bff/analysis/1514821682/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Clean%20DLC%20diffs-88688-1-0.7z?fid=1000263132&ttl=1535878004&ri=8192&rs=8192&setec=27f5910b3bf0c9fc5be7cf68760f045a"
    }
  ]
}