{
  "modId": 887.0,
  "modName": "Skyrim Archetypes",
  "summary": "Adds 8 bat files that augments your character to a predefined archetype.",
  "descriptionHtml": "--INCOMING SAPPY AND OVER ANALYTIC DESCRIPTION OF SOMETHING REEEEALLY SIMPLE!-- \r\n\r\nIn Rpgs since the dawn of man (well not since then...but anyway.) there have been classes, jobs, typed or whatever you wish to call them. I am a big fan of the open world sandbox of this game but it always struck me as odd that your character had no background before the events leading up to the ill fated carriage ride to the headsman\\'s block.\r\n\r\nWhat I have tried to create is an OPTIONAL means of giving your character that extra special feel from the start of the game. \r\n\r\nIn this version there are 8 classes to choose from:\r\nMage\r\nNecromancer\r\nPriest\r\nrogue\r\nArcher\r\nPaladin\r\nCleric\r\nBerserker \r\n\r\nEach class has their own set of armors, spells, weapons, skills, perks and abilities. (all from ingame sources of course.) And before you ask, I have set the files up so that one cannot enter one Bat file then load another to get both the benefits (as far as I can tell.)  \r\n\r\nAs of now some issues are: \r\n1. I could not get rid of the starter healing spell and flames spell, I may fix this later when the creation kit comes out. \r\n2. lack of spells or spell creator tool has forced me to give some perks and spells to classes that may not necessarily make sense, one such case would be giving a flames spell to the priest class. Eventually I want to make restoration based spells that do damage to the undead and unjust.\r\n3. May seem overpowered at points, one example is the paladin starts off with a full set of steel plate and a silver sword. i did this because as of now it is the only armor that looks like a paladin and is not extremely OP.\r\n4. These files are designed to be used at the beginning of the game, between the time you create your character and start swinging your sword...or whatever it is you choose to do. IF YOU USE THIS IN MID GAME THEN YOU WILL BE SET BACK TO LEVEL 3 WITH ALL YOUR SKILLS MESSED UP AND YOU MAY OR MAY NOT LOSE SOME PERKS! YOU HAVE BEEN WARNED.\r\n\r\nIn case you do not know how to install/uninstall or activate this type of file (though if that were the case then you would not be reading this anyways.)\r\n___________\r\nInstallation \r\n----------------\r\nextract the data folder to wherever you put skyrim. (yay! you did it!)\r\n____________\r\nuninstillation\r\n------------------\r\nDelete the 8 bat files...(whoo that was tough.)\r\n\r\n___________\r\nActivation\r\n-----------------\r\nin game press the tilde ( ` ) key\r\ntype in \\\"bat <insert class name here>\\\" (no need for quotation marks.\r\n\r\nAnd that is it.\r\nThank you for reading this looong drawn out explanation that very well could have taken 3 sentences to sum up...but I like to ramble.\r\nAnd if you download thank you, this is my first post to this site and I hope that in the future the ideas that I have for this game may come to fruition.\r\n\r\nhmm my credits got cut off...oh well,\r\nAll thanks goes to Bethesda, I only organized, er, threw them together.\r\n\r\n\r\n   ",
  "categoryId": "73",
  "version": "1.0",
  "author": "Otakufiend",
  "createdUnix": "1321854749",
  "updatedUnix": "1321855005",
  "containsAdultContent": false,
  "uploadedBy": "Otakufiend",
  "primaryFile": null,
  "files": [
    {
      "fileId": "2261",
      "name": "Skyrim Archetypes",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "17",
      "fileName": "Skyrim Archetypes-887-1-0.rar",
      "uploadedUnix": "1321855005",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/71c015ef480312b86512a1589f45ffa3db41920fb1491b7be2c9f185118125ba/analysis/1406428205/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Archetypes-887-1-0.rar?fid=2261&ttl=1535754122&ri=8192&rs=8192&setec=c548a188238ae14f4e288d8d98324325"
    }
  ]
}