{
  "modId": 88734.0,
  "modName": "Vanya and Nenya - Adoptable Snow Elf Twin Girls",
  "summary": "Twin Snow Elf girls, lost and alone in the Dwarven ruin of Kagrenzel. Can you give them a nice warm home? (Hearthfire DLC and RS Children required!)",
  "descriptionHtml": "Basically: I play a Snow Elf, I wanted Snow Elf kids, I learned me a thing or two and, after many CK crashes and Nifmerge errors, I created this.\n<br />\n<br />Vanya (ponytail) and Nenya (shorter hair) are identical except for their hairstyles and eye color. They should be slightly taller than human children, they are Snow Elves after all. I considered adding custom outfits for them but put them in regular child clothes for simplicity's sake. Their skin textures, hairs and eyes are standalone, meaning you don't need anything but RS Children and the Hearthfire DLC with this mod to use them.\n<br />\n<br />I put them in the entrance area of Kagrenzel, because I couldn't think of a \"lore friendly\" way to put them in the game. Once you enter the ruin they'll be right in front of you, and you can talk with them to adopt them right away as long as you own a home with beds they can sleep in.\n<br />\n<br />There really isn't much more I can think of to say... this is a proof of concept for me, my first real exercise in making custom NPCs without it turning into a waste of time. So I'm uploading it to celebrate this victory, and because I think some of you might like to adopt them. So please, feel free to test this out and tell me if I made any major mistakes, because the fact that it runs fine in my game doesn't mean it will in everyone's.\n<br />\n<br />Things to come: Snow Elf boys, more Snow Elf children for the Multiple Adoptions crowd, maybe some Ayleid and/or Dwemer kids, etc etc...\n<br />\n<br />Oh, and as for why they're not as pale as the vanilla Dawnguard Snow Elf race: that atrocious white texture glows something awful with my ENB, and even without ENB I don't like it. So I opted for a more realistic \"albino\" look.",
  "categoryId": "99",
  "version": "1.0",
  "author": "Miriam",
  "createdUnix": "1515022024",
  "updatedUnix": "1515108945",
  "containsAdultContent": false,
  "uploadedBy": "evgirunslaad",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263288",
      "name": "SnowElfKids",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8486",
      "fileName": "SnowElfKids-88734-1-0.zip",
      "uploadedUnix": "1515021997",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/e7ab0869132122e934fcdc8f0f50bc67103701e8f8441a00062f315f9fb2af4a/analysis/1515022351/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/SnowElfKids-88734-1-0.zip?fid=1000263288&ttl=1535878081&ri=8192&rs=8192&setec=3d9678369f2dd736691a1c416c250dce"
    },
    {
      "fileId": "1000263324",
      "name": "Purple Hair Hotfix",
      "version": "1.1",
      "categoryId": "2",
      "categoryName": "UPDATE",
      "isPrimary": false,
      "size": "898",
      "fileName": "Purple Hair Hotfix-88734-1-1.zip",
      "uploadedUnix": "1515108945",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/36de8776e91cea1892ef4e738e664ea452902aa1f92e87faf8754ce1210cf468/analysis/1515109265/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Purple%20Hair%20Hotfix-88734-1-1.zip?fid=1000263324&ttl=1535878081&ri=8192&rs=8192&setec=4dab4936fbf0440734f8d60511dc77a6"
    }
  ]
}