{
  "modId": 88758.0,
  "modName": "Gearhog's Proudspire Manor",
  "summary": "",
  "descriptionHtml": "Why is the most expensive house in Skyrim so horrible? Every time I step into Proudspire Manor, I get a headache, mostly from all the intense lighting, but also from the overwhelming emptiness, WAY too much stone, and just... ugh. There are a few Proudspire overhauls on the Nexus. All of which are well done, but for me they just made it bearable.\n<br />\n<br />I finally decided to completely remake Proudspire's interior in a sort of Witcher theme (unintentional, however A LOT of Witcher assets were used in the making of this mod, and seeing as TW3 is my favorite game... well.)\n<br />Bare in mind that this is my first house mod... So there will, more than likely, be issues. It IS fully navmeshed.... but there's really nothing fancy about it outside of aesthetics. I'm not a scripter, so I didn't add any fancy activators and whatnot.\n<br />\n<br />I've included a few hidden treasures, however. Some for the kids, some for the adults. Just look around and see what you find ;3\n<br />\n<br />There's also A LOT of storage. Whatever I saw that, in reality, could be used for storage can be used as such. Urns, jars, boxes, cabinets, crates, bottles, baskets, etc. I wanted my version of Proudspire to be as immersive as possible.\n<br />\n<br />This is a HUGE file. There are over 100 custom assets used in the making of this. Each piece has been carefully added and places within the Creation Kit, and then the home.\n<br />All lighting and effects/particles have been carefully placed for the best, and most diverse, lighting. Made specifically for screenshots.\n<br />I highly doubt this will work with the BYOH or Hearthfire expansions. I deleted basically everything. Maybe in the future, once I figure out how the BYOH function works, I will add it in. For now, what you see is what you get.\n<br />This WILL NOT work with other Proudspire overhauls. And I doubt it will work with ANY other mods that edit the same cell. Like I said, I completely remade the home. Which means some new floors, walls, ceilings. I kept a few intact to try and retain a bit of the overall feel, and to keep it fitting in with the Solitude environment.\n<br />There are a few little things added throughout the house. If you don't like the element of surprise, I've listed these items at the bottom of the description, in tiny tiny letters.\n<br />\n<br />[list]\n<br />[*]The 'lounge' area was turned into a sort of tea room. \n<br />[*]I added a sauna/bath type room in the basement. \n<br />[*]The entrance to this sauna/bath area is a small wine cellar. \n<br />[*]The follower room is a little nicer, but not too much. \n<br />[*]The child's room has some special treats for the kids! Dolls and toys they can actually play with!\n<br />[*]I added a forge area in the basement, with more storage and such. Nothing else was really changed.\n<br />[*]The kitchen now has a bigger fireplace, cabinets, counters, etc. \n<br />[*]The entrance by the outdoor patio is rather simple, but I added a chair and key storage.\n<br />[*]The outdoor patio now has furniture and plants.\n<br />[*]The loft area (next to the master bedroom) is now a studio with a desk, painting area, and game room.\n<br />[*]So many custom assets it's ridiculous. This file is HUGE. I'm working on condensing it down. (I created a plugin with all resources imported into the CK so I wouldn't have to keep doing it over and over) But since I didn't plan on releasing this, I didn't consider the size.\n<br />[*]This also comes with a new follower. A German Shepard pup named Gent.\n<br />[*]Tons of rugs, paintings, and tapestries.\n<br />[*]There are soooo many containers, it's silly. Almost everything that could hold something in real life now does just that. Most are named after things you may put in there.\n<br />[/list]\n<br />I love The Witcher series. The clutter and attention to detail is incredible. I used a lot of TW3 assets in the making of this, because it fit perfectly with what I was going for. I wanted a place big enough to move around in, but also cluttered up and comfortable. A place to take screenshots, with many different types of lighting... But also lore-friendly.\n<br />\n<br />I plan to add more to this later, and improve upon it. I'm just not that skilled with scripts and everything else. I don't have time right now with school, work, and working on my new character overhaul. I made this as a means to take screenshots for my new overhaul, but I figured I should release it since there aren't many Proudspire overhauls... Yet there's so much potential!\n<br />\n<br />If you like this, please endorse. If you don't like this, please do not attack me. I have spent well over 100 hours on this house.\n<br />\n<br />\n<br />[b]Credits: [/b](If I miss someone, PLEASE let me know. I used a LOT of assets, and DO NOT want to leave anyone out! but before creating this mod, I hadn't written down all the authors, which screwed me up)\n<br />\n<br />\n<br />[b]Recommendations:[/b]\n<br />Enhanced Lights and FX\n<br />My custom ENB (will be released soon)\n<br />\n<br />\n<br />Little things you'll find around the house:\n<br />[size=1]2 dolls, toy knight, teddy bear, 3 wind spinners, and a toy boat for the kids. Coffee ingredients and recipe for the adults, as well as a few items of food that can [b]not[/b] be recreated.[/size]",
  "categoryId": "67",
  "version": "1.0",
  "author": "Gearhog",
  "createdUnix": "1515132972",
  "updatedUnix": "1515132972",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": []
}