{
  "modId": 88800.0,
  "modName": "Witchhunter Spells and Prayers Requiem Patch",
  "summary": "A Requiem patch for Robbie922004's \"Witchhunter Spells and Prayers Pack.\" Adds Witchhunter spells to Requiem's FormID lists and rebalances the spells for Requiem.",
  "descriptionHtml": "[size=4]A patch to integrate Witchhunter Spells and Prayers into Requiem.  \n<br />\n<br />[b]Features:[/b]\n<br />[/size][list]\n<br />[*][size=4]Rebalances spell costs for Requiem[/size]\n<br />[*][size=4]Alters some spell magnitudes and durations for balance with Requiem[/size]\n<br />[*][size=4]Reqtifies summoned arrows and their corresponding projectiles[/size]\n<br />[*][size=4]Balances spell tome values around Requiem's conventions[/size]\n<br />[*][size=4]Renames some spells to fit into Requiem a bit better[/size]\n<br />[*][size=4]Moves draining magic from Destruction to Alteration to follow Requiem's conventions[/size]\n<br />[*][size=4]Integrates spells into Requiem's FormID lists allowing them to be \"studied\" and learned without a tome when taking their cost-reduction perk[/size]\n<br />[*][size=4]Adds conditions of appropriate Aedric or Daedric favor to prayers[/size]\n<br />[/list][size=4]\n<br />[b]Requirements:[/b] Requiem and [url=https://www.nexusmods.com/skyrim/mods/53751/?]Witchhunter Spells and Prayers by Robbie922004. [/url]\n<br />\n<br />[b]Optional patches[/b] for [url=https://www.nexusmods.com/skyrim/mods/53751/?]BtC [/url](adds draining spells to BtC's draining perks) and [url=https://www.nexusmods.com/skyrim/mods/16225/?]Apocalypse [/url](merges FormID lists to allow both Witchhunter and Apocalypse spells to be \"studied\" when taking cost-reduction perks) are available.[b]  Both of these still require the main file![/b][/size]\n<br />[size=4]\n<br />[b]Known issues:[/b] \n<br />[/size][list]\n<br />[*][size=4]The experience for the absorb weapon augmentations is slightly off, since I just reused the existing alteration exp script from Sea Stride. You probably wouldn’t have noticed this if I hadn’t told you. [/size]\n<br />[*][size=4]Requiem’s script for spell choices on taking perks can only handle 9 options, so some spells will inevitably be unavailable when taking perks. This is a limitation which affects all Requiem spellpack patches, and will do so until someone with serious scripting knowledge rewrites and extends the spell choice script and its corresponding quest to include more than 9 dummy references. [/size]\n<br />[/list][size=4]\n<br />[b]Unknown issues:[/b] Probably lots because I'm bad.  Let me know![/size]\n<br />\n<br />[b][size=4]\n<br />Full changelog (textwall inc):\n<br />[/size][/b][size=4][size=3]\n<br />[/size][/size][list]\n<br />[*][size=4][size=3]All spell tome values increased, based on Requiem’s values.[/size][/size]\n<br />[*][size=4][size=3]All prayer tome values greatly increased, Deadric tomes moreso than Aedric tomes to reflect the taboo nature of Daedra worship.  [/size][/size]\n<br />[*][size=4][size=3][b]Aedric prayers only work if under the blessing of that Aedra[/b]. This both prevents the prayers from stacking (the major balance issue of this mod) and automatically forwards whatever blessing conditions you have in your game, be they [url=https://www.nexusmods.com/skyrim/mods/50251/?]Blessings Ignore Crimes[/url]﻿’ total lack of conditions, [url=https://www.nexusmods.com/skyrim/mods/81785]AZT[/url]﻿’s strict and individualized conditions, or [url=https://www.nexusmods.com/skyrim/mods/92349]anything [/url]﻿﻿in [url=https://www.nexusmods.com/skyrim/mods/85532/?]between[/url]﻿, to the corresponding prayer.[/size][/size]\n<br />[*][size=4][size=3]Daedric prayers only work if favor has been gained with that Daedric Prince. Favor is gained with a Daedric Prince by completing their relevant quest (one will do if they have multiple) in such a way that they are pleased with you, being under their blessing if they have one, or in some cases by engaging in activities of which they approve.  Daedric prayers DO still stack if each individual prayer’s conditions are met.[/size][/size]\n<br />[*][b][size=4][size=3]Requirements for each Daedric prayer to be granted:[/size][/size][/b]\n<br />[size=4][size=3]   ﻿[b]   ﻿Hircine[/b]: You are a werewolf, or you have completed Ill Met by Moonlight in either way.\n<br />   [b]﻿   ﻿Molag Bal[/b]: You are a vampire, or you have completed The House of Horrors.\n<br />   ﻿[b]   ﻿Vaermina[/b]: You have completed Waking Nightmare by killing Erandur for her.\n<br />   ﻿[b]   ﻿Malacath[/b]: You are an Orc, or you have completed The Cursed Tribe.\n<br />   ﻿[b]   ﻿Namira[/b]: You have completed The Taste of Death by joining her coven and ritually eating the priest.\n<br />   ﻿   ﻿[b]Mehrunes Dagon:[/b] You have completed Pieces of the Past by killing Silus for him.\n<br />   ﻿[b]   ﻿Peryite[/b]: You have completed The Only Cure.\n<br />   ﻿[b]   ﻿Hermaeus Mora[/b]: You have completed the Gardener of Men, or you have completed Discerning the Transmundane.\n<br />   ﻿[b]   ﻿Meridia[/b]: You have completed The Break of Dawn, or you have killed 1000 undead.\n<br />   ﻿[b]   ﻿Nocturnal[/b]: You have completed Trinity Restored, or you are under her blessing.\n<br />   ﻿[b]   ﻿Boethia[/b]: You have completed Boethia's Calling, or you are under her blessing.\n<br />   ﻿[b]   ﻿Azura[/b]: You have completed The Black Star by cleansing the Star rather than giving it to Nalacar, or you are under her blessing.\n<br />   ﻿[b]   ﻿Mephala[/b]: You have completed The Whispering Door by fully recharging the Ebony Blade, or you are under her blessing.\n<br />   ﻿[b]   ﻿Sanguine[/b]: You have completed A Night to Remember, or you are under the influence of alcohol.\n<br />   ﻿[b]   ﻿Clavicus Vile[/b]: You have completed A Daedra’s Best Friend in either way.\n<br />   ﻿[b]   ﻿Jyggalag[/b]: You have completed The Mind of Madness, or you are carrying exactly your maximum carry weight.\n<br />   ﻿[b]   ﻿Sheogorath[/b]: You have completed The Mind of Madness, or you are carrying exactly 69 intact cheese wheels of the same    ﻿   ﻿   ﻿type, or he feels like it. [/size][/size][*][size=4][size=3]Spell casting costs have generally been multiplied by between two and three, with most spells being about twice as expensive after the patch.  This is mostly due to the fact that Requiem generally expects that a player will have the cost-reduction perk for a spell before making use of it, and draws a slightly sharper line between mages and non-mages through its starting magicka costs. Explanations are provided in some cases where a different multiplier is used.[/size][/size]\n<br />[*][size=4][size=3]All spells (not prayers) added to Requiem’s spell FormIDlists, allowing them to be “studied” and learned without a spell tome when taking a perk of their school and level. [b]NOTE: This will overwrite the Apocalypse Requiem patch’s additions to these FormID lists (and those of any other mod which adds spells to Requiem’s FormID lists in this way). A patch which merges the changes and allows both Apocalypse and Witchhunter spells to be “studied” when taking perks is available as an optional file.[/b][/size][/size]\n<br />[*][size=4][size=3]“Tiericide” on elemental weapon augmentation spells.  Novice, Apprentice, Journeyman and Expert elemental weapon augmentation spells previously had costs to 60/80/100/120, magnitudes of 5/10/15/25, and a universal duration of 30. They have been reworked into Simple, Enduring, Concentrated, and Advanced elemental weapon augmentation spells, which have costs of 100/180/160/300, magnitudes of 10/10/25/30, and durations of 20/60/10/45. This provides a range of options for different situations and magicka investments. [/size][/size]\n<br />[*][size=4][size=3]Fire augmentations: Renamed to Flame augmentations.[/size][/size]\n<br />[*][size=4][size=3]Frost augmentations: Slow effects on Simple, Enduring, and Concentrated Frost Augmentation reduced from 50% to 25% to match Requiem’s conventions. Advanced is still 50%.[/size][/size]\n<br />[*][size=4][size=3]Silence Augmentation: Cost increased from 80 to 220. Spellcasters are deadly in Requiem and this is a very powerful tool against them, since each silence hit lasts for ten seconds.[/size][/size]\n<br />[*][size=4][size=3]Paralysis Augmentation: Cost increased from 100 to 375.Paralysis is a lategame ability that can allow a player to take down powerful enemies like Giants well before they would be able to do so by normal means, so a steep cost increase is necessary.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Arkay: Duration increased from 60 to 600. This was a very weak prayer compared to the others. It will now be an invaluable asset to anyone hunting the undead, especially at a low level with a specialized build, allowing one to clear most of a tomb while under the effects.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Dibella: Magnitude increased from 15 to 25.Duration increased from 30 to 60. This was another weak prayer.  It should now allow a player to pass persuasion checks well before they would otherwise be able to, and have time to save some money afterwards.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Kynareth: Magnitude reduced from 70% to 50%. This was an extremely powerful reduction effect with Requiem’s more powerful, longer-cooldown shouts. It is now a bit more reasonable, but still quite potent.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Jyggalag: Duration reduced from 15 to 8. This was an absurd prayer that could allow only moderately-prepared players to tangle with endgame enemies. It now cannot be used to sneak in quite as much damage.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Malacath: Duration reduced from 15 to 8. Another absurdly broken prayer that took away one of the only reasons to play as an Orc, in addition to allowing players to tangle with endgame enemies.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Namira: Duration increased from 60 to 300.  Very weak compared to other prayers,functioning simply as another cost-reduction piece of gear. It can now potentially be used for multiple summons, or a summon and a series of non-summoning conjuration spells.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Nocturnal: Duration increased from 60 to 300. Very weak compared to the Mephala and Boethia prayers, it now at least lasts long enough to get in, out, and well away.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Sheogorath: Duration reduced from 20 to 10. This was a very powerful AOE effect that gave dungeons plenty of time to clear themselves. It should now require something to back it up, and function more as a combat reset or opening shot.[/size][/size]\n<br />[*][size=4][size=3]Prayer to Vaermina: Duration reduced from 20 to 10.  This was a very long period of respite, and should now be more of a restrained combat reset.[/size][/size]\n<br />[*][size=4][size=3]Soul Trap Augmentation: Cost increased from 80 to 200.[/size][/size]\n<br />[*][size=4][size=3]Sea Stride: Cost increased from 80 to 200.[/size][/size]\n<br />[*][size=4][size=3]Fear Augmentation: Cost increased from 100 to 250. This is a powerful fear effect that should be difficult to use, since many midgame[/size][/size]\n<br />[*][size=4][size=3]enemies are vulnerable to it.[/size][/size]\n<br />[*][size=4][size=3]Weapon Focus spells: Costs increased from 80 to 230.[/size][/size]\n<br />[*][size=4][size=3]Weapon Focus: Archery: Renamed Weapon Focus: Marksmanship.[/size][/size]\n<br />[*][size=4][size=3]“Tiericide” on the resist magic spells.  Magicka Shroud/Armor/Field previously cost60/80/100 and gave 15/30/50 magic resist for 30 seconds. Not only was this far too powerful for Requiem, it was boring, with little reason to use the weaker spells once the stronger spells had been unlocked. They now cost 130/180/300, give 10/30/30 magic resist, and last for 60/15/60 seconds, providing weak and cheap, powerful and moderately-costed but short duration, and powerful and long-lasting but very expensive options.[/size][/size]\n<br />[*][size=4][size=3]Conjure Arrow spells: All conjured arrows, and their corresponding projectiles, have been reqtified according to their vanilla counterparts. Their cost increases are towards the high end of the standard Requiem cost increase because of Requiem’s economy and carry weight changes making it an even better choice than in vanilla to conjure arrows if possible.[/size][/size]\n<br />[*][size=4][size=3]Conjure Steel Arrows: Cost increased from 60 to 180.[/size][/size]\n<br />[*][size=4][size=3]Conjure Elven Arrows: Cost increased from 80 to 240.[/size][/size]\n<br />[*][size=4][size=3]Conjure Fire Arrows: Cost increased from 100 to 300.[/size][/size]\n<br />[*][size=4][size=3]Conjure Frost Arrows: Cost increased from 100 to 300.[/size][/size]\n<br />[*][size=4][size=3]Conjure Shock Arrows: Cost increased from 100 to 300.[/size][/size]\n<br />[*][size=4][size=3]Conjure Ebony Arrows: Cost increased from 100 to 300.[/size][/size]\n<br />[*][size=4][size=3]Conjure Freezing Arrows: Cost increased from 100 to 300.[/size][/size]\n<br />[*][size=4][size=3]Conjure Light Arrows: Cost increased from 80 to 200. Cheaper than Elven arrows since Elven arrows have additional armor piercing properties in Requiem.[/size][/size]\n<br />[*][size=4][size=3]Conjure Daedric Arrows: Cost increased from 120 to 500. An extra-steep cost increase to reflect the great power of Daedric items in Requiem.[/size][/size]\n<br />[*][size=4][size=3]Absorb Magicka Augmentations:  School changed from Destruction to Alteration to match Requiem’s conventions. Renamed to Absorb Magicka Augmentation I and II. Costs increased only from 80/100 to 100/150. Magnitudes increased from 5/10 to 15/30. Durations increased from 30 to 40.  I’m not sure how it was ever supposed to be worth it to cast these in vanilla. Now you can potentially get your magicka back if you have the cost-reduction perk, as well as doing some magicka damage to your enemies.  These might still be too weak without the optional patch though. [b]OPTIONAL BTC PATCH:[/b] Integrated into the Alteration perks that boost draining spells.[/size][/size]\n<br />[*][size=4][size=3]Absorb Health Augmentations: School changed from Destruction to Alteration to match Requiem’s conventions. Renamed to Absorb Health Augmentation I and II. Costs increased from 100/120 to 200/240. These were already expensive compared to the vanilla elemental augmentations, and now they’re weak as well. I decided to just leave them weak since healing is more valuable in Requiem, and they provide it. The optional patch should allow them to become quite powerful even from these low starting points. [b]OPTIONAL BTC PATCH[/b]: Integrated into the Alteration perks that boost draining spells.[/size][/size]\n<br />[*][size=4][size=3]Channel Health: Cost increased from 80 to 175.[/size][/size]\n<br />[*][size=4][size=3]Channel Regeneration: Cost increased from 100 to 220.[/size][/size]\n<br />[*][size=4][size=3]Regenerating Burst: Cost increased from 120 to 340. Theknockback effect is something that could potentially allow a low-level player to defeat midgame or even some endgame enemies if cast repeatedly, necessitating a steep cost increase.[/size][/size]\n<br />[*][size=4][size=3]Enhanced Reflexes/BlindingSpeed: Renamed Enhanced Reflexes I and II. Cost increased from 50/70 to 150/210. Even with the attack restriction these spells had a high potential for abuse if they could be cast in succession, so a steep cost increase seemed prudent.[/size][/size]\n<br />[*][size=4][size=3]Defensive Elemental Cloak spells: Costs increased from 80 to170.[/size][/size]\n<br />[*][size=4][size=3]Elemental Focus spells: Costs increased from 100 to 250.[/size][/size]\n<br />[*][size=4][size=3]Shout Focus spells: Renamed Focus Breath I, II, and III. Costs increased from 60/80/100 to 130/190/280.  Magnitudes decreased from 20/35/50 to 10/20/30.[/size][/size]\n<br />[/list]",
  "categoryId": "75",
  "version": "1.1",
  "author": "LSofACO",
  "createdUnix": "1515274413",
  "updatedUnix": "1531378576",
  "containsAdultContent": false,
  "uploadedBy": "LSofACO",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263456",
      "name": "Witchhunter Spells and Prayers Requiem Patch",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "9",
      "fileName": "Witchhunter Spells and Prayers Requiem Patch-88800-1-0.zip",
      "uploadedUnix": "1515272988",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/434ea05a3d1a07d140097a0f75433cd11aa0c339b09c751420a9bfee87217069/analysis/1515273266/",
      "changelogHtml": " Initial release. Includes optional BtC and Apocalypse patches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witchhunter%20Spells%20and%20Prayers%20Requiem%20Patch-88800-1-0.zip?fid=1000263456&ttl=1535878172&ri=8192&rs=8192&setec=55feb40a6e5945800b139832b5c0876d"
    },
    {
      "fileId": "1000263457",
      "name": "Behind the Curtain Patch",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "1",
      "fileName": "Behind the Curtain Patch-88800-1-0.zip",
      "uploadedUnix": "1515273130",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/021bf7b0331699534471ac8df338efdf095322fe3cd93f951dba548481eb812d/analysis/1515273185/",
      "changelogHtml": " Initial release. Includes optional BtC and Apocalypse patches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Behind%20the%20Curtain%20Patch-88800-1-0.zip?fid=1000263457&ttl=1535878172&ri=8192&rs=8192&setec=70fe0b448c295184fb07829610610132"
    },
    {
      "fileId": "1000263458",
      "name": "Apocalypse Patch",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "2",
      "fileName": "Apocalypse Patch-88800-1-0.zip",
      "uploadedUnix": "1515273252",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4407d88daa2f03b67f3235a747fa6ad558dd3042fb76fc547734189288735940/analysis/1515273542/",
      "changelogHtml": " Initial release. Includes optional BtC and Apocalypse patches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Apocalypse%20Patch-88800-1-0.zip?fid=1000263458&ttl=1535878173&ri=8192&rs=8192&setec=3366c66f7c54c66f7f8b73d0f70fa61b"
    },
    {
      "fileId": "1000276187",
      "name": "No Prayers patch",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "0",
      "fileName": "No Prayers patch-88800-1-0.zip",
      "uploadedUnix": "1530024368",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4160a06c9f41668edece50215e2745886905b247462d0bd922f03e2a432f0918/analysis/1530024482/",
      "changelogHtml": " Initial release. Includes optional BtC and Apocalypse patches. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/No%20Prayers%20patch-88800-1-0.zip?fid=1000276187&ttl=1535878173&ri=8192&rs=8192&setec=5e7a0c25c49e5b4c6418f03f698cef56"
    },
    {
      "fileId": "1000277340",
      "name": "Witchhunter Spells and Prayers Requiem Patch",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "8",
      "fileName": "Witchhunter Spells and Prayers Requiem Patch-88800-1-1.7z",
      "uploadedUnix": "1531378576",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/6b495753003fc022ec2684255819b42d85aa56125ec36dfe301a0bc90d1d1ab1/analysis/1531379102/",
      "changelogHtml": " Dragonborn is now required due to FormID list and prayer mechanics changes.\n<br /><br />Updated FormID lists to Requiem 2.0.2 as follows:\n<br /><br />Bound Dagger from Dragonborn added to the Novice Conjuration list.\n<br /><br />Mark and Recall from Requiem removed from the Adept Conjuration list.\n<br /><br />Healing Aura on Target added to the Novice Restoration list.\n<br /><br />Healing Aura on Target removed from the Adpet Restoration list.\n<br /><br />Knock added to the Adept Alteration list.\n<br /><br /><br />Balance changes: \n<br /><br />Prayer to Stendarr: Removed lifedrain protection due to prayer mechanics changes discussed below.\n<br /><br />Sea Stride: Cost increased to 200, up from 160 in the previous version and 80 in base. \n<br /><br />Focus Weapon spells: Cost increased to 230, up from 200 in the previous version and 80 in base.\n<br /><br />Absorb Magicka Augmentations I and II: Duration increased to 40, up from 30 in base.\n<br /><br />Focus Breath spells: Magnitudes decreased to 10/20/30, down from 20/35/50 in base.\n<br /><br />Prayers: All prayer prices have been lowered from the previous version, although they’re still quite high.  Added conditions for all prayers to work.\n<br /><br />Aedric prayers only work if under the blessing of that Aedra.  This both prevents the prayers from stacking (the major balance issue of this mod) and automatically forwards whatever blessing conditions you have in your game, be they Blessings Ignore Crimes’ total lack of conditions, AZT’s strict and individualized conditions, or anything in between, to the corresponding prayer.\n<br /><br />Daedric prayers only work if favor has been gained with that Daedric Prince. Favor is gained with a Daedric Prince by completing their relevant quest (one will do if they have multiple) in such a way that they are pleased with you, being under their blessing if they have one, or in some cases by engaging in activities of which they approve.  Daedric prayers DO still stack if each individual prayer’s conditions are met.\n<br /><br />Requirements for each Daedric prayer to be granted:\n<br /><br />Hircine: You are a werewolf, or you have completed Ill Met by Moonlight in either way.\n<br /><br />Molag Bal: You are a vampire, or you have completed The House of Horrors.\n<br /><br />Vaermina: You have completed Waking Nightmare by killing Erandur for her.\n<br /><br />Malacath: You are an Orc, or you have completed The Cursed Tribe.\n<br /><br />Namira: You have completed The Taste of Death by joining her coven and ritually eating the priest.\n<br /><br />Mehrunes Dagon: You have completed Pieces of the Past by killing Silus for him.\n<br /><br />Peryite: You have completed The Only Cure.\n<br /><br />Hermaeus Mora: You have completed the Gardener of Men, or you have completed Discerning the Transmundane.\n<br /><br />Meridia: You have completed The Break of Dawn, or you have killed 1000 undead.\n<br /><br />Nocturnal: You have completed Trinity Restored, or you are under her blessing.\n<br /><br />Boethia: You have completed Boethia's Calling, or you are under her blessing.\n<br /><br />Azura: You have completed The Black Star by cleansing the Star rather than giving it to Nalacar, or you are under her blessing.\n<br /><br />Mephala: You have completed The Whispering Door by fully recharging the Ebony Blade, or you are under her blessing.\n<br /><br />Sanguine: You have completed A Night to Remember, or you are under the influence of alcohol.\n<br /><br />Clavicus Vile: You have completed A Daedra’s Best Friend in either way.\n<br /><br />Jyggalag: You have complete The Mind of Madness, or you are carrying exactly your maximum carry weight.\n<br /><br />Sheogorath: You have completed The Mind of Madness, or you are carrying exactly 69 intact cheese wheels of the same type, or he feels like it. \n<br /><br />Known issues: Requiem’s script for spell choices on taking perks can only handle 9 options, so some spells will inevitably be unavailable when taking perks. This is a limitation which affects all Requiem spellpack patches, and will do so until someone with serious scripting knowledge rewrites and extends the spell choice script and its corresponding quest to include more than 9 dummy references. \n<br /> <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Witchhunter%20Spells%20and%20Prayers%20Requiem%20Patch-88800-1-1.7z?fid=1000277340&ttl=1535878173&ri=8192&rs=8192&setec=dcde49dce99a9017ed26166e7fe9a4fc"
    }
  ]
}