{
  "modId": 88816.0,
  "modName": "Skyrim Cracked Tusk Keep Gamesave V2",
  "summary": "Skyrim Cracked Tusk Keep Gamesave V2 -Version 2 of my Skyrim Gamesave Cracked Tusk Keep. Fixed Thieves Guild Bug (the door into Mercer Freys was missing, Riften) - connected up with Red Water Den which gives you access to more items - you now have access to shouts with no wait shout recharge - you now starts after killing your first dragon.",
  "descriptionHtml": "Skyrim Cracked Tusk Keep Gamesave V2 (Version 2) \n<br />\n<br />This is version 2 of my Gamesave Cracked Tusk Keep. I have corrected a problem with the Theives Guild where you go to Mercer Freys to gain access into Riftweald Manor. In the original gamesave the door is missing, so I have fixed this in version 2. My apologise about having to start the save all over. I have advanced the save forward so that your character has finished the begining Quests -up to- Looking for the Horn of Jorgen Windcaler. You now have shouts activated and you have plenty of shouts available. Your character still starts at Cracked Tusk Keep and you get the Change Race Menu when entering the Keep. \n<br />\n<br />You have 2 items of jewelry Max Ring V3 and Max Necklace V3 which increase your stats, weapons and armor and you also get no wait shout recharge.I have provided access to Red Water Den (one of my other Gamesaves) with all of the containers unlocked which gives you access to more items of higher value. Search Red Water Den for my other jewelry V4 - V8 which give you ever increasing abilities. You have access to QA smoke cell which contains more items to search through and I have included some Dragon Souls when you enter 3 special areas after you enter the Double Dragon passage in the old Pelagius Wing area. Enjoy, hope that there are no more big Bugs.\n<br /> \n<br />NOTE: I have removed the room that was marked as Dreamworld as these were the doors used for Riftweald Manor. I stored all of the items from that room around the Keep.\n<br />\n<br />ShamanReaper57",
  "categoryId": "43",
  "version": "V2",
  "author": "ShamanReaper57",
  "createdUnix": "1515311825",
  "updatedUnix": "1515315305",
  "containsAdultContent": false,
  "uploadedBy": "ShamanReaper57",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263492",
      "name": "Skyrim Cracked Tusk Keep Gamesave V2",
      "version": "V2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "3274",
      "fileName": "Skyrim Cracked Tusk Keep Gamesave V2-88816-V2.zip",
      "uploadedUnix": "1515311249",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/e651ea266267570344d5349ac855e7cadba32fd0ea36acf416fc61018a0df1fb/analysis/1515311592/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Cracked%20Tusk%20Keep%20Gamesave%20V2-88816-V2.zip?fid=1000263492&ttl=1535878191&ri=8192&rs=8192&setec=56bca376bd4bf8a45a29b1883d816e71"
    },
    {
      "fileId": "1000263497",
      "name": "Skyrim Cracked Tusk Keep Gamesave V2 PC File",
      "version": "V2",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "3097",
      "fileName": "Skyrim Cracked Tusk Keep Gamesave V2 PC File-88816-V2.zip",
      "uploadedUnix": "1515315305",
      "modVersion": "V2",
      "virusScanUrl": "https://www.virustotal.com/file/b44fc9c36018a28ac49b106eebb4643d3fca7d8ad9367f7f5dc1f852e5f059f1/analysis/1515315552/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20Cracked%20Tusk%20Keep%20Gamesave%20V2%20PC%20File-88816-V2.zip?fid=1000263497&ttl=1535878191&ri=8192&rs=8192&setec=997790945c3f2bd043433ab9913fb627"
    }
  ]
}