{
  "modId": 88827.0,
  "modName": "Beggar Prince (A Mini Quest Series)",
  "summary": "This is a small - medium quest(like) mod. There are no active quests in the mod so no notes on what to do next, no quest markers and you are free to do whatever you feel fit in the moment. Everything is dialogue based so you will have to listen to the (mostly) voice acted characters.",
  "descriptionHtml": "This is a small - medium quest(like) mod. There are no active quests in the mod so no notes on what to do next, no quest markers and you are free to do whatever you feel fit in the moment. Everything is dialogue based so you will have to listen to the (mostly) voice acted characters. Contained in the mod is new locations and new unique characters. The quests within the mod can take you across the map to solve a dwemer dungeon filled with difficult enemies and a puzzle to free new friends or possible foes... or finding out just who the Beggar Prince is and why is he down on his luck in the Underground? The Underground is the hub of a slightly shady world filled with unique characters to interact with. (Think Shivering Isles for example.)\n<br />\n<br />This is a collection of smaller quests combined into one entity. Often quest lines can interact with each other providing you also know the previous threads leading to this point. The end goal of this mod is to build up to a much bigger one later this year so feedback would be really useful at this stage so I can rectify any mistakes for the bigger mod. As this is still a beta(ish) mod all the map locations are already discovered so feel free to go anywhere and report back if there's any bugs along the way!\n<br />\n<br />This mod is pretty much complete just need some voice actors male or female to record some dialogue to fully finish this mod. As I currently have no female voices. If you are interested in voicing some of the characters please message me! \n<br />\n<br />No DLC required.\n<br />\n<br />Please note if you come across any problems please let me know! And feedback is always appreciated.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />SPOILERS FOR EVENTS:\n<br />1. Go to the Underground and talk to everyone and get a feel for what you want to do.\n<br />2. The Beggar Prince will send you to his house which will have a character waiting there for you. Then head to the nearest cave and explore that area. Finally head to the final cave just north of the original cave to discover that part. I would say do this first to ease in.\n<br />3. Bruiser will send you to a Dwemer cave to kill the guys who swindled him out of coin. If you speak to them they will tell you to visit Raven and to spare them. I would say to do this second.\n<br />4. The house with the mudcrabs and the skooma addict is very self contained so you can do that at any time.\n<br />5. You can visit the Coven at any time but I would do it following on from the events of the bruiser thread as that leads you to Raven anyway.\n<br />6. There's a small quest involving going to a house near whiterun. It sticks out like a sore thumb, I would do this one after meeting Raven as it wouldn't make sense otherwise. \n<br />6. All the locations are marked so you can just fast travel to any of them. I want to change this in the final version once there's more voice actors to complete the cast of characters.",
  "categoryId": "35",
  "version": "1",
  "author": "itsfly",
  "createdUnix": "1515443325",
  "updatedUnix": "1515443325",
  "containsAdultContent": false,
  "uploadedBy": "FlyOfIts",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263542",
      "name": "BeggarPrinceData_1",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "49763",
      "fileName": "BeggarPrinceData_1-88827-1.rar",
      "uploadedUnix": "1515371438",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/54773ff4568b4724cca369f1b02e20cacb35aa7bfa7b85a6a24e520befbb8f31/analysis/1515371647/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/BeggarPrinceData_1-88827-1.rar?fid=1000263542&ttl=1535878206&ri=8192&rs=8192&setec=97aa62e22d42b39c965bd0a76772fe2c"
    }
  ]
}