{
  "modId": 88831.0,
  "modName": "Battlecrabs (April Fools 2018)",
  "summary": "A mod you've all be waiting for..... prepare for the BATTLECRABS!",
  "descriptionHtml": "Prepare for something amazing.... a mod you always wanted, and one you yourself knew you must have.... prepare for....\n<br />\n<br />[size=5]Battlecrabs!\n<br />\n<br />[/size]To celebrate the release of Rank and File, I have decided to give the people something they always wanted. Something so awesome and tasty that no one, no mere mortal, nor aedra, nor daedra, could live without. No mer, human, or beast could resist... Hence, Battlecrabs.\n<br />\n<br />What this mod does, well its simple, it adds mudcrabs into the civil war. Mudcrabs will now aid both sides in the Civil War. These crabs, fearsome as they are, are dubbed by their masters, Battlecrabs! These crabs will be present in both random encounters and in Civil War battles. Oh, and this mod is compatible with everything, including Rank and File and Diverse Skyrim! Just create a bashed patch and you'll be good!\n<br />\n<br />\n<br />A fair warning though, they are placed in the level list where all soldiers for both sides can be found. That being said, that leveled list is being depended on by other scripts and leveled lists. Which means, for those who don't understand, these crabs may be placed in situations that may make it hilarious, or annoying depending on your stance. You may find a battlecrab in a wounded tent in a weird pose because its trying to mimic the wounded animation, or you may find one trying to cook food over a fire. Who knows....",
  "categoryId": "83",
  "version": "1.0",
  "author": "kvatchcount",
  "createdUnix": "1522607692",
  "updatedUnix": "1522607692",
  "containsAdultContent": false,
  "uploadedBy": "kvatchcount",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000269768",
      "name": "Battlecrabs",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Battlecrabs-88831-1-0.zip",
      "uploadedUnix": "1522564451",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/ff3a8abe11ec836b95dfdd90cd6afdb3646eec8fffd903f5751d171911f1ea00/analysis/1522564622/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battlecrabs-88831-1-0.zip?fid=1000269768&ttl=1535878211&ri=8192&rs=8192&setec=5b5f2ff193cdf66aed829f4da4462ec9"
    }
  ]
}