{
  "modId": 88851.0,
  "modName": "Immersive Jewelry - Abridged",
  "summary": "A trimmed down version of Immersive Jewelry: no weapons, most enchanted items are gone, and many jewelry pieces were removed.",
  "descriptionHtml": "[center][font=Georgia][size=5]Can't handle the[i] [/i]sheer[i] IMMERSIVENESS[/i] of Immersive Jewelry?\n<br />[/size][size=2]Here ya go, then.\n<br />\n<br />[/size][/font][/center][u][size=4]Description\n<br />\n<br />[/size][/u][size=3]Immersive Jewelry is a [/size][b]BIG [/b][size=3]mod. And like many mods that combine several smaller mods, it can have plenty of content you don't like. Thus, my TES5Edit-illiterate self used TES5Edit to simply remove the bits of jewelry that I didn't like from the mod, as well as some other items so as to not flood my game with more stuff than I was comfortable with. Keep in mind that my edits of Immersive Jewelry are purely made out of subjective taste, and I'm not making these edits for anyone other than myself. That said, there's no reason not to publish this and see if you might want it, too. The more options, the better, after all.[/size]\n<br />\n<br />[size=3]While I'm absolutely terrible at keeping proper track of things, here are some things I (may) have removed from Immersive Jewelry:[/size]\n<br />\n<br />[list]\n<br />[*][size=3]Gold weight (IJ already has a 'twinked' version that does this too; I forgot about it as I was editing)[/size]\n<br />[*][size=3]Weapons included in the original mod[/size]\n<br />[*][size=3]All but one vampire chain bodice (ruby rose gold briolette? Something like that.)[/size]\n<br />[*][size=3]Items whose EditorID starts with BretonEnch or DwarvenEnch[/size]\n<br />[/list]   [size=3]﻿Items with the below keywords in their names were also removed:\n<br />[/size][list]\n<br />[*][size=3]Fillet[/size]\n<br />[*][size=3]Coronet[/size]\n<br />[*][size=3]Nethichutti[/size]\n<br />[*][size=3]Jhoomar[/size]\n<br />[*][size=3]Wings[/size]\n<br />[*][size=3]Diadem (and diadem ensemble)[/size]\n<br />[*][size=3]Tiara (but not tiara ensemble)[/size]\n<br />[*][size=3]Bracelet[/size]\n<br />[*][size=3]Earring[/size]\n<br />[*][size=3]Headdress[/size]\n<br />[*][size=3]Clothing (boots, gloves, robes, hoods)[/size]\n<br />[*][size=3]Choker[/size]\n<br />[*][size=3]Head plate[/size]\n<br />[*][size=3]Head band[/size]\n<br />[*][size=3]Heart necklace[/size]\n<br />[*][size=3]Chain necklace[/size]\n<br />[*][size=3]Torc[/size]\n<br />[*][size=3]Fleur-de-lis necklace[/size]\n<br />[*][size=3]Fleur-de-lis circlet[/size]\n<br />[*][size=3]Festoon[/size]\n<br />[*][size=3]Collar[/size]\n<br />[/list][size=3]\n<br />Looking through TES5Edit without the ability to just CTRL+F everything makes it easy for me to miss things, so plenty of these items might still be in there somewhere, especially if they're marked as (L) for left-hand use. The list will grow as I find more items I dislike/don't care for in IJ. I've generally only deleted jewelry from the Armor tab, but have not yet touched the Constructible Objects tab in TES5Edit, so if that means that the equipment recipes still show up I'll get to that eventually, as I currently lack the time to do any more than look at the jewelry itself using AddItemMenu.[/size]\n<br />\n<br />[size=4][u]Bugs/Incompatiblities/Issues\n<br />[/u][/size][size=3]None that I know of. Not a modder myself so you'll have better luck asking Forteverum over on the Immersie Jewelry page.[/size]\n<br />\n<br />[u]Permissions[/u]\n<br />[size=3]Immersive Jewelry isn't mine, so go see Forteverum's permissions over on the Immersive Jewelry page.\n<br />\n<br />\n<br />\n<br />Hope you like it! Or not, whatever floats your goat.[/size]",
  "categoryId": "102",
  "version": "1.0",
  "author": "mildoranges",
  "createdUnix": "1515456159",
  "updatedUnix": "1515456159",
  "containsAdultContent": false,
  "uploadedBy": "jvjv4528",
  "primaryFile": null,
  "files": []
}