{
  "modId": 88862.0,
  "modName": "The Hogs - Custom Race - Presets",
  "summary": "This is a promo for my upcoming overhaul - which has been delayed due to school, work, and illness.",
  "descriptionHtml": "I know. I said I would have the new overhaul released by Christmas. And I tried so hard... but I have too much going on in my life at the moment to put the effort I want into the project. If I released it now, it would be rushed, and not something I can be proud of.\n<br />\n<br />So, until I am able to release the entire overhaul, here is a taste. I have never seen a mod packed like this, so I guess it's a bit unique. I couldn't think of a better way to do a promo, so here it is.\n<br />I first tried to make Lena into a follower, as you may have seen images for. But I wanted to give her dialogue, custom quests, etc... And that, again, takes more time than I currently have. But she'll be coming soon, I promise!\n<br />\n<br />This is a series of \"presets\", but in the form of a custom race. This allows for unique appearances, and each preset has taken hours, or days, to create. Each preset has it's own unique attributes, using the Creation Kit to assign individual textures (which, again, I have never seen anyone do). And each preset has it's own unique sculpted appearance using the Racemenu's sculpt feature. I've used the new version of KS Hair to assign each one a hairstyle that fits their personality, but this can obviously be changed to your liking. I'll eventually get around to finishing my custom hairstyles, but today isn't that day. And the amazing Kallies has given permission to use her's!\n<br />\n<br />Included are custom skin, eyes, eyebrows, teeth, dirt maps, scars, moles, complexions, makeup, etc. Each texture has been edits, including environment, reflection, cubemap, diffuse, normal, specular, subsurface, etc. Nothing is vanilla.\n<br />All meshes were hand picked, including body, head, teeth, eyes, feet, and hands. The body type is UNP, and I do not recommend replacing this. I will not be releasing a CBBE version of the skin at this time. I used my own bodyslide preset to create the body, which I released as a separate file. \n<br />\n<br />Each item within this package has taken me [b]a lot[/b] of time to create, even the smallest of details.\n<br />\n<br />Racial attributes include:\n<br />Basically anything that will help someone living in a harsher world.\n<br />\n<br />There are several complexions, scars, and eyes for you to choose from if you are not happy with the presets, however excessive tweaking of the character's face may prove a bit more difficult than your average racemenu preset. This is due to the amount of sculpting put into them. If you have a character appearance in mind, please let me know and I will add it in! The race is based off of the vanilla NORD race.\n<br />\n<br />I've added some back stories to each character, but you can obviously create your own!\n<br />\n<br />[img]http://i65.tinypic.com/8zfwgk.png[/img]\n<br />[b][size=4]Lena -[/size][/b]\n<br />Born to poverty, from a young age Lena mastered the arts of thievery and speechcraft. In her teens, she met a Dunmer who taught her the arts of destruction magic, and soon after she joined a band of misfits, robbing and pillaging villages across Cyrodiil. As an adult, the guilt became overwhelming, and she set off to start a new life in Skyrim.\n<br />\n<br />[b][size=4]Zeta -[/size][/b]\n<br />Zeta was born in Skaal Village, in luxury (or as luxurious as a Skaal can get). As a warchief's daughter, she was allowed to do whatever she pleased. However, one day her father perished in the cold, while out hunting. This devastated Zeta, and instead of cowered in a corner, she decided to set off on an adventure.\n<br />\n<br />[b][size=4]Seri -[/size][/b]\n<br />In a small unmapped village just outside of Skyrim, a very sick child was born. Her father wanted to put her out of her misery, but her mother thought that if the child was weak physically, she would learn mental attributes much more quickly. Her mother was right, and over time Seri began to become a master of the magical arts, specializing in Illusion, Conjuration, Destruction, and all others. As a child, her mother would tell her that she was born so weak, because a Dragon came and borrowed her strength while in the womb, and will one day return to show thanks and respect. Seri lived for this story. It was her motivation, inspiration, and will to live.\n<br />\n<br />[size=4][b]Zivari -[/b][/size]\n<br />Zivari was raised by a group of bandits, and made to sneak into small spaces to obtain gold and treasures. However, she was not rewards for these actions, and over time she began to keep little pieces of gold for herself, stashed away somewhere safe. Once she obtained enough gold to feed and clothe herself for one year, she snuck into each bandit's quarters and killed them in their sleep. She was free. You would think Zivari would choose the life of an assassin, thief, or any other profession where her skills would benefit... But no, Zivari prefers heavy armor, a big axe, and confronting her enemy head on.\n<br />\n<br />More to come soon! Track this file for updates!",
  "categoryId": "34",
  "version": "1.0",
  "author": "Gearhog",
  "createdUnix": "1515523294",
  "updatedUnix": "1515523294",
  "containsAdultContent": false,
  "uploadedBy": "Gearhog",
  "primaryFile": null,
  "files": []
}