{
  "modId": 88887.0,
  "modName": "Kamira - A Fully Voiced Companion - Spanish Translation",
  "summary": "Full Spanish Translation for Kamira - A Fully Voiced Follower by aletss<br />Traducción completa al español de Kamira  - A Fully Voiced Follower de aletss",
  "descriptionHtml": "[size=5]\n<br />Descripción\n<br />[/size]\n<br />[size=4]¿No tienes idea de lo que está diciendo Kamira o simplemente no quieres leerla en inglés? Ésta es una traducción total de todos los textos del mod de aletts al español.\n<br />\n<br />Recientemente estuve probando esta seguidora. Además de tener una personalidad poco común entre los seguidores de Nexus, y una gran actuación de voz, posee una misión/quest y un montón de diálogo que hace referencia a mucho de la historia de la saga de Elder Scrolls. Desde la Crisis de Oblivion hasta los heróicos actos de Talos. Todo esto es bastante interesante de oír, y considero que es más cómodo para los jugadores hispanohablantes que este mod sea traducido en su totalidad a nuestro idioma con la calidad que merece.\n<br />\n<br />\n<br />[size=5][b]Requisitos[/b]\n<br />[/size]\n<br />\n<br />[size=3]Mod Original (Requerido): [url=https://www.nexusmods.com/skyrim/mods/87644]Kamira - A Fully Voiced Follower[/url]﻿\n<br />Verifica que la versión del mod original sea la misma de la traducción.\n<br />\n<br />\n<br />[size=5][b]Características[/b]\n<br />[/size]\n<br />\n<br />[size=4]- Traducción completa del mod al español.\n<br />- Neutralidad para jugadores de Latinoamérica y España.\n<br />- Ortografía perfecta (si hay algún error, avísenme).\n<br />- Traducción exacta conservando las traducciones oficiales de los elementos que ya están en el juego.\n<br />[center]- Corrección de errores de contexto que había en el mod original.\n<br />- Actualización de la traducción conforme nuevas versiones del mod original sean liberadas.[/center]\n<br />\n<br />[/size][b]También puede te pueden interesar mis otras traducciones:\n<br />[/b]\n<br />[url=https://www.nexusmods.com/skyrim/mods/88869]Skyrim Healer Onean - Traducción al Español[/url]﻿\n<br />[/size][/size][size=5]\n<br />[/size]",
  "categoryId": "94",
  "version": "B1.1",
  "author": "Zichfried",
  "createdUnix": "1515641645",
  "updatedUnix": "1515641645",
  "containsAdultContent": false,
  "uploadedBy": "Zichfried",
  "primaryFile": null,
  "files": []
}