{
  "modId": 88903.0,
  "modName": "Braith's Diary",
  "summary": "This teensy little plugin adds a diary belonging to everyone's least favorite Redguard, Braith.",
  "descriptionHtml": "My characters, like many others, have never had a good encounter with Braith. Ashlyn has brought up her fists and Lizzy came within milliseconds of casting Tharn's Prison on the little brat. I mean, who doesn't wish they had a chance to teach her a lesson?\n<br />\n<br />Well... I recently overheard Braith's feeble attempts to engage her parents in dialogue inside their home and this had an effect on me. In my 2400+ hours of Skyrim I have never heard this dialogue before, and it left a bit of a burn in my heart. See, I work with children IRL, and when dealing with a child who has serious anger issues, bullies other children and shows disrespect to elders, I always find out what it is, deep down in their little hearts what is causing such feelings. And the solution is NOT to make them killable or transform them into a spider. Usually a child can write their feelings to get them out of their system. In some cases, I allow them access to a punching bag. Since Braith has no punching bag, I've added a diary where she has written a couple of pages about her feelings.\n<br />\n<br />Now, I'm not the best writer, and certainly not a respectable modder, so take it easy on me, lol If anything this is just something I wanted to share and hopefully it will spark some empathy for Braith.\n<br />\n<br />Requirements: Skyrim\n<br />\n<br />Install: Move plugin to Data folder, activate in your favorite modding utility or Skyrim's launcher\n<br />\n<br />Uninstall: This plugin should be safe to deactivate and uninstall at any time as long as you are outside of Amren's house\n<br />\n<br />Compatibility: Since all this mod does is add an end table container and Braith's diary, it [u]shoudn't[/u] conflict with anything other than another mod that alters the interior of Amren's house.",
  "categoryId": "98",
  "version": "1.0",
  "author": "Kanori24",
  "createdUnix": "1515726508",
  "updatedUnix": "1515726508",
  "containsAdultContent": false,
  "uploadedBy": "Kanori24",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000263780",
      "name": "Braith's Diary",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "2",
      "fileName": "Braith's Diary-88903-1-0.zip",
      "uploadedUnix": "1515726362",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/c49cdd93bf7010abd1cc626b462164b11b9488fa90eb3a96ab75195c6138834b/analysis/1515726662/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Braith%27s%20Diary-88903-1-0.zip?fid=1000263780&ttl=1535878295&ri=8192&rs=8192&setec=cda35fae78b34ce6b7b25a16e8aa4f26"
    }
  ]
}