{
  "modId": 88929.0,
  "modName": "Shalidor's Migrant Portals",
  "summary": "Shalidor's Migrant Portals adds a new dungeon to the Labyrinth which becomes available to explore once you've completed Shalidor's Maze. Inside is a small chamber with a new boss battle and a reward of a collection of portal stones allowing for instantaneous travel across large distances. Experience new enemies and battles then claim your reward!",
  "descriptionHtml": "[center][font=verdana][size=4][img]https://static.wixstatic.com/media/5813d4_d996851751994662971aa4794cfb6945~mv2.png/v1/fill/w_800,h_150,al_c/5813d4_d996851751994662971aa4794cfb6945~mv2.png[/img]\n<br />\n<br />\n<br />\n<br />[img]https://static.wixstatic.com/media/5813d4_d54e678923fa4db7a5d754c66eb92099~mv2.png/v1/fill/w_600,h_63,al_c/5813d4_d54e678923fa4db7a5d754c66eb92099~mv2.png[/img]\n<br />\n<br />\n<br />This mod attempts to add to the Labyrinth's rewards and include some additional lore for Shalidor.\n<br />​\n<br />A new section of the Labyrinth becomes available to the player for exploration along with new puzzles and enemies to face.\n<br />​\n<br />Upon completion of the short dungeon addon, the player receives 5 portal stones which conjure interconnecting portals which can be placed anywhere in the world for instant teleportation.\n<br />\n<br />\n<br />[youtube]wgWBFpx1vMU[/youtube]\n<br />\n<br />\n<br />[img]https://static.wixstatic.com/media/5813d4_28921d34aa5d4adc8d15ba9a8c0cba15~mv2.png/v1/crop/x_0,y_1,w_800,h_84/fill/w_600,h_63,al_c/5813d4_28921d34aa5d4adc8d15ba9a8c0cba15~mv2.png[/img]\n<br />\n<br />\n<br />If you've already completed Shalidor's Maze by activating all of the magic tablets and killed the Dremora you will simply need to re-enter the area and the hidden doorway will simply reveal itself when you get close enough. If you've not yet completed the maze, you'll be required to do so for the entrance to be accessible. Once you gain entry, you'll need to progress through a short collection of hallways until you reach the main chamber. There's also a small puzzle and hidden items which are required to complete the small dungeon, so be sure to look around. Once you reach the main chamber, you'll be locked in and will need to defeat the boss.\n<br />\n<br />Once the battle is over and you've been victorious, you'll have access to Shalidor's portal stones. Be sure to read the tutorial messages which show up on screen as they will notify you on how the mod works. You can also check below just in case you miss the messages or wish to know in advance.\n<br />\n<br />\n<br />\n<br />[img]https://static.wixstatic.com/media/5813d4_7f8b6e73316b49f2a09ff53abb8aeba4~mv2.png/v1/fill/w_600,h_63,al_c/5813d4_7f8b6e73316b49f2a09ff53abb8aeba4~mv2.png[/img]\n<br />\n<br />\n<br />To place a portal on the ground, simple drop the portal stone from your inventory and it will conjure a portal for you where you stand. Be sure to stand on even ground or it may clip with terrain or surroundings. I recommend using [url=https://www.nexusmods.com/skyrim/mods/52583/]Jaxon's Positioner[/url] if you want more control over the portal's placement. If you wish to pick a portal back up, simple crouch and then activate the existing portal. There will be a cool magic effect for a couple of seconds where the portal gets sucked back into the portal stone and your character will then perform a short animation to pick the stone back up. The portal stone is then returned to your inventory for it to be re-used in a different location.\n<br />\n<br />For a portal to work, you may have at least two placed down for them to connect. Activating a portal while standing will display a small message box allowing you to choose which portal to teleport to. There are no restrictions to the use of portals and you can place them anywhere you wish.\n<br />\n<br />\n<br />\n<br />[img]https://static.wixstatic.com/media/5813d4_4ee33ced520d4bc9a84d1699eff39752~mv2.png/v1/fill/w_600,h_63,al_c/5813d4_4ee33ced520d4bc9a84d1699eff39752~mv2.png[/img]\n<br />\n<br />\n<br />The dungeon is located within Shalidor's Maze inside of the Labyrinth. The dungeon's entrance is not within the maze itself but on the outskirts near the entrance to the maze area. Refer to the screenshots on this mod page for a specific location. You must complete the Labyrinth Maze for the entranceway to reveal itself.\n<br />\n<br />\n<br />\n<br />[img]https://static.wixstatic.com/media/5813d4_374922255e754947be515ffdde9f4f6c~mv2.png/v1/fill/w_600,h_63,al_c/5813d4_374922255e754947be515ffdde9f4f6c~mv2.png[/img]\n<br />\n<br />\n<br />Although there is no specific level requirement for this mod, you're unlikely to access the Labyrinth until you hit a certain level. You're probably going to want to make sure you're around level 15 - 20 before you enter the maze area. The boss is leveled to the player but has a minimum level of 15 and should be a reasonable challenge. Other enemies are of varying difficulty. The game will autosave prior to you entering the main chamber in case you decide you want to turn back and return when you're a higher level in order to stand a chance of surviving.\n<br />\n<br />\n<br />\n<br />[img]https://static.wixstatic.com/media/5813d4_38dc4a25daa548bb89a67cf8bd067934~mv2.png/v1/fill/w_600,h_63,al_c/5813d4_38dc4a25daa548bb89a67cf8bd067934~mv2.png[/img]\n<br />\n<br />Vicn - Creature Resource\n<br />Bellyache - Animal Textures[/size][/font][/center]",
  "categoryId": "93",
  "version": "1.0",
  "author": "Darkfox127",
  "createdUnix": "1525179812",
  "updatedUnix": "1525179812",
  "containsAdultContent": false,
  "uploadedBy": "DarkFox127",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000271081",
      "name": "Shalidor's Migrant Portals 1.0",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10756",
      "fileName": "Shalidor's Migrant Portals 1.0-88929-1-0.7z",
      "uploadedUnix": "1524223102",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/4cce3d46043db602552e8625d7ecc0678c0cb88a215dd1ca3e0d7d60623ec2d0/analysis/1524223241/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Shalidor%27s%20Migrant%20Portals%201.0-88929-1-0.7z?fid=1000271081&ttl=1535878336&ri=8192&rs=8192&setec=354ecb3885cfd1650db4b73dd9443e45"
    }
  ]
}