{
  "modId": 88953.0,
  "modName": "Kanori&#39;s Shacks of Skyrim - DELETED",
  "summary": "Makes the numerous shacks scattering throughout Skyrim into cozy little camp outs. ",
  "descriptionHtml": "This is nothing too awfully special. Just something I did like a year ago. Ashlyn walked into Riverside shack and killed the bear, threw it into the river and slept there for the night. Then I was like, &#34;You know... what if there weren&#39;t pools of blood and human gore strewn about? This place would be so much more bear-able (ba-dum-tch) to stay in.&#34; I mean, sure my dovahkiin is as tough as they come, but... she&#39;s not THAT freaky to sleep in such a mess.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;So anyway... many hours with the CK and searching for resources later, I converted Riverside Shack into a cozy little home-away-from-home. But I didn&#39;t stop there. Every exterior shack in Skyrim, except for Crabber&#39;s Shanty, got the makeover. I tried to give each one an individual theme, but somehow a lot of them turned out to be a sort of a forest-y alchemist&#39;s shack, especially the properly named Alchemist&#39;s Shack near Ivarstead. It&#39;s all taken awhile, and I never really intended to publish this mod, but here it is.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;So why should you use this mod? Well... because you saw it and thought it might be neat. It&#39;s not a game-changer or anything that you couldn&#39;t live without. All this does is pretty up the shacks and make them more livable. I say livable because I put a small fire in each one to accommodate Frostfall users. A few of them have campfires and cooking spits placed outside as well. One of them requires you to find a key to unlock the door, which is cleverly (haha) hidden nearby. I plan to do this for all shacks in a future update. All in all, the shacks have been modified to be more nice and cozy, to a degree.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]COMPATIBILITY\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]Okay so there are compatibility issues with a few rather popular mods. None of them are game breaking however.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]Verdant\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]In order for some of my changes to work, I had to slightly alter the terrain around a few of the shacks. Well... verdant comes through and removes those changes, even if it is loaded before ShacksOfSkyrim.esp. I really don&#39;t know how to explain this, and I corrected it on my end by editing the terrain in verdant.esp myself. Unfortunately I do not think it would be safe for me to try to make a universal fix for verdant to accommodate this one mod of mine. Really the worst that happens was the ground would be above or below certain objects, and grass may be coming through the floors.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]Interesting NPCs\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]I forget his name, but INPC adds a character and a chair to Alchemist&#39;s Shack. The chair takes the same place as some objects I put out back, and the character will get confused trying to navigate around the changes I made to the shack. \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]Alchemist&#39;s Compendium\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]Such a nice book mod for an alchemist character. Unfortunately its placement by RGM conflicts with the placement of some decorative clutter I put in the Alchemist&#39;s Shack. All it really does is causes the physics of the book to freak out, and it may go flinging off into oblivion. B-but you can still obtain via console command, ya?\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;KNOWN [/u][u]ISSUES\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]Again, none are game-breaking. Just minor nuisances I will point out so hopefully the comments won&#39;t be lit up with &#34;HEY&#33;&#33; The door clips through the ceiling&#33;&#33;&#34;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Yes, the doors do clip a lot. This is because while using the vanilla shack frame pieces, no door I could find in the CK fit them exactly. So I had to compromise by scaling and carefully placing them. Yes the tops and bottoms of the doors will run through the upper frames and floors of the doorways, but the doors work.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;I haven&#39;t reworked any of the navmeshes around the shacks, so followers and other NPCs will most likely get stuck around the doorways. Future update plan.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Inconsistencies with containers. For example, Hunter&#39;s Rest has a container that looks like a mead crate that contains 20 Nord Meads. Riverside Shacks also has the same crate, but it is only decorative. Another future plan.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Even though I swear I&#39;ve deleted them time and time again, there are a couple of books in the Alchemist&#39;s Shack that just wont go away and compete for space with some of the decorative clutter I placed inside. They will likely experience a physics seizure when you enter the shack, or when they are loaded into the cell.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;TEXTURES IN MY SCREENSHOTS\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]Anyone who has been modding will understand this one. To those of you who are new, screenshots on mod pages can sometimes be deceiving. My screenshots absolutely do not reflect EXACTLY how things will appear for you. This is because my set up is very special, carefully tailored to my tastes in visuals and to work with my own ENB. I have many, many texture mods that I have altered, cropped, recolored, etc all for my own personal use so I am 100% certain that TEXTURES WILL VARY&#33; For the record, the vast majority of resources in this mod use vanilla textures, or go by whatever textures you have installed. To my knowledge the only meshes in this mod that call up their own textures are the wooden fences and the alchemy wall art.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]FUTURE PLANS\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]And these are only for if this mod does well. If it fizzles out or doesn&#39;t garnish much interest, all bets are off. I&#39;m sure you understand.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;More named containers, hidden keys to unlock doors, journals of previous inhabitants, and hopefully to clear up why this mod and verdant don&#39;t seem to agree on terrain sculpting.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]LASTLY\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]This is my first rather complex mod that isn&#39;t a simple weight-changer or addition of a girl&#39;s diary into an interior cell. To me, as a novice modder, Shacks of Skyrim is HUGE. Myself and two others did a lot of testing and fixing until the mod was stable and standalone. I really do hope it works out okay for all who decide to try it out. If more than a couple of people have problems that can be related to anything I&#39;ve missed, I will just take it down.\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;BUT AS ALWAYS, MOD CAREFULLY AND BACK UP YOUR STUFF\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[u]CREDITS\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;[/u]A couple of fellow members of Nexus who wish not to be named for testing\r<br />&lt;br /&gt;[u]\r<br />&lt;br /&gt;[/u]Renthall311 for his wonderful fence meshes and textures \r<br />&lt;br /&gt;\r<br />&lt;br /&gt;lolikyonyu for Lolicept Resources\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Oaristys for Modder&#39;s Resource Pack\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Blary for multiple resources including open books and alchemy wall art\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;Bethesda for... well... being awesome and allowing such modding&#33;\r<br />&lt;br /&gt;\r<br />&lt;br /&gt;",
  "categoryId": "74",
  "version": "1.0",
  "author": "Kanori24",
  "createdUnix": "1515904051",
  "updatedUnix": "1515904051",
  "containsAdultContent": false,
  "uploadedBy": "Kanori24",
  "primaryFile": null,
  "files": []
}