{
  "modId": 8896.0,
  "modName": "Accessible Vendor Chests",
  "summary": "A small mod that makes the Inventory chests of Merchants accessible",
  "descriptionHtml": "Name: Accessible Vendor Chests\r\nVersion: 1.1\r\nDate: 2/11/2012\r\nCategory: Items, Objects and Clothes\r\nAuthor(s): VincentIcarus\r\nSource: http://skyrim.nexusmods.com/downloads/file.php?id=8896\r\n\r\nDescription\r\n===========\r\n\\\"Are you a thief that\\'s tired of breaking into stores only to find a few measly items on the counter-tops?\\\"\r\n\\\"Are you a cutthroat merchant who wants to bankrupt your competitors without hurting or intimidating them?\\\"\r\n\\\"Did a shop owner upset you and now that you\\'ve killed them you want to be able to take all their loot for yourself?\\\"\r\n\r\nIf you have answered yes to one or any of these questions then you need to get:\r\n\r\nACCESSIBLE VENDOR CHESTS!\r\n\r\nAccessible Vendor Chests is exactly what it sounds like! It\\'s a mod that moves all of the previously inaccessible vendor chests into an area where you can get your sneak thief hands all over it.\r\n\r\nLocation\r\n========\r\nSearch behind the counter of your favorite store and voila! Their entire inventory will be there in a single chest.\r\n\r\nDetails\r\n=======\r\n-This mod moves the previously inaccessible vendor chests to an area where you can now steal from it. Currently, this mod only changes Vendor chests for interior cells.\r\n-Version 1.1 adds one to two City Guards per shop (usually facing the area where the Inventory Chest is) and all accessible vendor chests are locked at master level. Some can be opened with a key. All will re-lock once you\\'ve exited the inventory screen.\r\n\r\nInstall\r\n=======\r\n1. Extract the files to your Skyrim/Data folder.\r\n2. Activate the .esp file with the Mod Manager of your choice.\r\n3. Loot, Steal and Profit.\r\n\r\nUninstall\r\n=========\r\n1. Delete/Remove the Accessible Vendor Chests .esp.\r\n\r\n\r\nIncompatibility\r\n===============\r\nThis mod will most more than likely be incompatible with any other mods that edit certain interior cells. Other than that, I have had no problems with this mod so far.\r\n\r\nKnown Issues or Bugs\r\n====================\r\n-The Vendors Inventory re-stocks every 3 game days, however, sometimes when you go inside the store and look at the Inventory chest it will still say empty. Simply talk to the Shop Owner (If they\\'re still alive) and open the barter menu with them and the Inventory chests will immediately restock. You can now close the Barter menu and go steal their stuff instead.\r\n\r\nHistory\r\n=======\r\n1.0 - Initial Release\r\n1.1 - Added City Guards to Shops for extra security. Changed Vendor chests to be locked at Master level.\r\n\r\nContact\r\n=======\r\nGo to: http://skyrim.nexusmods.com/modules/members/index.php?id=2253779 and leave me a PM.\r\n\r\nCredits\r\n=======\r\nBethesda - for Skyrim and the Creation Kit without either this probably wouldn\\'t have been possible.\r\nLFox - for his Expert scripting skills. Without which this would be a pretty dull mod.\r\nLHammonds - for the Readme Generator\r\nmalufenix - for her beautiful Bard Covers. Without which I probably would\\'ve smashed my computer into a thousand peices by now.\r\nMe - because I\\'m awesome like that.\r\n\r\nTools Used\r\n==========\r\nSkyrim Creation Kit\r\nReadme Generator - http://HammondsLegacy.com/obmm/tools_readme_generator1.asp\r\n\r\nLicensing/Legal\r\n===============\r\nThis mod contains assets from other mods. I obtained the proper permission before posting this mod. You must contact me and LFox (HornedReaperMJL) and obtain his permission before re-packaging any part of this mod.",
  "categoryId": "85",
  "version": "1.1",
  "author": "VincentIcarus",
  "createdUnix": "1328968877",
  "updatedUnix": "1329013530",
  "containsAdultContent": false,
  "uploadedBy": "VincentIcarus",
  "primaryFile": null,
  "files": [
    {
      "fileId": "29314",
      "name": "Accessible Vendor Chests",
      "version": "1.1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16",
      "fileName": "Accessible Vendor Chests-8896-1-1.rar",
      "uploadedUnix": "1329013530",
      "modVersion": "1.1",
      "virusScanUrl": "https://www.virustotal.com/file/82a4c8c0b6351acdb589992b6a49c878553853e25a6d4356e14fcf651cff9488/analysis/1406671923/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Accessible%20Vendor%20Chests-8896-1-1.rar?fid=29314&ttl=1535768017&ri=8192&rs=8192&setec=799f4b4271f8cbf2cef20761c6cc7c7e"
    }
  ]
}