{
  "modId": 88975.0,
  "modName": "Serana's Folly",
  "summary": "Serana's constant complaints about Skyrim's weather have not gone unnoticed. Some of the Daedric Princes have grown annoyed with her and have decided to punish her, with your help of course.",
  "descriptionHtml": "[size=3]       It has been another long day for you in Skyrim, and you are trying to relax at the local tavern with a mug of your favorite mead. This is not an easy task, as some of the locals seem intent on fighting inside, and the bard is singing off key. The days troubles are starting to fade, and you are thinking it might be worth renting a room for the night instead of traveling, not to mention that the Stew is starting to smell really good, and it'll be ready soon.  A sense of contentment and peace starts to fill your being as the evening turns into night. \n<br />     Unfortunately, that peace isn't long lasting, as soon there is a commotion and loud voices from the road outside. \"Let the guards deal with it.\" you think to yourself, after all, that is their job. The commotion grows louder and closer, and you wonder why the guards haven't done anything yet. It sounds like three people having a massive argument. The door to the tavern bursts open, and three figures step into the tavern. A familiar if unwelcome voice Booms \"[size=4]DOVAHKIIN! We Demand Your [/size]Assistance!\"   With a sigh, you put your mug down and think to yourself \"[i]What do they want now...This is not going to be pleasant.[/i]\", as you recognize the three figure as the Daedric Princes Sanguine, Meridia, and Sheogorath. \n<br />           \"We have agreed that the vile creature known as 'Serana' must be punished for constantly complaining about the weather,\" Booms Meridia, \"But cannot decide on which one of us will do so, it is up to you to choose which of us gets to punish her. I would burn her in a righteous fire!\" Sanguine interrupts with \"And I will strike her down with a bolt of Lightning!\" To which Sheogoroth adds \"And I will do... Something...\" \n<br />\n<br />\"Fine, I'll choose which one of you gets to punish her, just don't kill her, I still need her.\"  You hope you don't come to regret this. \n<br />\n<br />\n<br />\n<br />~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n<br />\n<br />\n<br />Basically a simple mod to punish Serana for complaining so much. You can pick one of the three Deadra to \"punish\" her from the MCM or you can choose no Punishment for each of five different weather related complaints. Defaults are Lighting Strikes for Cold weather complaints, Bursting into Flames for sun related complaints. V2.1  Sheogorath can get a bit... messy... but now he  cleans up after himself... so use as you wish.  All items spawned by Sheogorath from this mod are removed when you leave the cell. \n<br />\n<br />\n<br />\n<br />[size=3]This is my first start to finish mod, so I hope I got everything put where it needs to go. [/size]Please keep an eye out for any bugs that may appear, and let me know so I can squash them. Should be compatible with most anything except other Serana Dialogue mods or mods that change the DLC1RNPC quest. \n<br />\n<br />I hope you Enjoy.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />Just to make sure, in case I put this mod in the wrong spot, this is for Classic Skyrim.\n<br />\n<br />\n<br />This mod was inspired by [url=http://skyrim.nexusmods.com/mods/15428]Divine Punishment for Mention of Arrows in the Knee[/url] and [/size][size=3][url=http://skyrim.nexusmods.com/mods/28001]Daedric Punishment for Insults Related to Sweetrolls[/url] by toaDime.\n<br />\n<br />\n<br />\n<br />\n<br />[/size]",
  "categoryId": "28",
  "version": "2.1-Beta",
  "author": "NHguy03276",
  "createdUnix": "1515988345",
  "updatedUnix": "1516255104",
  "containsAdultContent": false,
  "uploadedBy": "nhguy03276",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264009",
      "name": "Serana's Folly",
      "version": "2.0-Beta",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "24880",
      "fileName": "Serana's Folly-88975-2-0-Beta.zip",
      "uploadedUnix": "1515987893",
      "modVersion": "2.0-Beta",
      "virusScanUrl": "https://www.virustotal.com/file/98b9ce00d68ea60514a5f06b2764a4273a046218462a2a5b21225960f0c87558/analysis/1515988289/",
      "changelogHtml": " Initial Release <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Serana%27s%20Folly-88975-2-0-Beta.zip?fid=1000264009&ttl=1535878388&ri=8192&rs=8192&setec=a4afceee9d224335e3614210bc88dcaa"
    },
    {
      "fileId": "1000264209",
      "name": "Serana's Folly",
      "version": "V2.1-Beta",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "79",
      "fileName": "Serana's Folly-88975-V2-1-Beta.zip",
      "uploadedUnix": "1516255104",
      "modVersion": "V2.1-Beta",
      "virusScanUrl": "https://www.virustotal.com/file/34afeac8055d040aca0152875b4e9bb1d4327cdaf9105a7f111bfdb0b2047fd9/analysis/1516255382/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Serana%27s%20Folly-88975-V2-1-Beta.zip?fid=1000264209&ttl=1535878389&ri=8192&rs=8192&setec=5567a309b899379a8146e4547c3a20b1"
    }
  ]
}