{
  "modId": 8900.0,
  "modName": "KatuMod - A facelift for Skyrim",
  "summary": "A visual overhaul enhancement tweaks for realism and best possible performance with a medium range PC.",
  "descriptionHtml": "A lot more images at: \r\nhttp://ruderalis.imgur.com/\r\n\r\n[youtube]11ut36uCn0Y&feature=youtu.be[/youtube]\r\n\r\nThis is a mod I really never intended to be released. I wanted better visuals but all ENB mods I tried destroyed my framerate. So I started to tweak....a lot....and then tweaked some more. When finally I came to a result that I really liked, it was running absolutely perfect and looked absolutely amazing. This should run perfectly smooth and at around 40-70 fps on a single GTX560 Ti, as it does with mine. Any performance increasing ideas that doesn\\'t change the visuals are welcome. EDIT: Some people have said that pressing HOME key have improved their fps by a lot for some reason. Tell me if that is the case with you too?\r\n\r\nNote, this isn\\'t the best looking thing on the planet, but it should increase your visuals and not leave you with a slideshow. Nights can be really dark or bright enough to see a little depending on cloud coverage, you will want to have at least one torch or a light spell at hand. Places where there are no lights, there is none or very little of it. This mod will act as a Realistic Lighting mod on it\\'s own. Having another mod that alters the lighting environment will either make everything pitch black or change the color settings to something I had not balanced it for.\r\n-----------------------------------------------\r\nOther mods recommended with this mod:\r\n\r\n*Dramatic Clouds - A MUST HAVE! Go install it, I\\'ll wait :)\r\n*Deadly Spell Impacts - be sure not to replace my fixed textures, or the frost/snow textures will outshine the sun.\r\n\r\n-----------------------------------------------\r\n\r\nRemember to read the instructions in the .rar file AND BACKUP EVERYTHING that this mod replaces in case you want to uninstall this later :) \r\nIt is important that you use the SkyrimPrefs.ini and Skyrim.ini that come with the mod, if you want to personalize them to your liking (like FOV and other personalized things) try to do it without touching the graphics settings directly. I noticed that if I used default configs on the mod, lights, shadows and the overall quality suffers greatly and it is extremely hard to track what are the causes.\r\n\r\n-----------------------------------------------\r\n\r\nBugs: IF YOU ARE USING A CUSTOM uGridsToLoad setting, make sure to edit it in the provided SkyrimPrefs.ini too or your save games might get corrupted...if you don\\'t know what a uGridsToLoad is then you don\\'t need to worry. In towns if a lot of guards are carrying torches, the Skyrim lighting engine shuts off some light sources if there are too many shadow casting lights nearby. Only Bethesda can fix that. I\\'ve included an .esp that has shadows turned off for the torches, if it is really bothering you.\r\n\r\n------------------------------------------------\r\n\r\nChange history: \r\n\r\n* Reduced torch light radius by half from my original .esp, a torch shouldn\\'t really light up half a town ;D\r\n* Made Magelight act as a slow moving flare that is ideal to have shot straight up, it will light up the entire immediate environment for a long period of time. Removed it from casting a shadow due to Skyrim\\'s poor lighting engine and its bugs.\r\n \r\n* Fixed glow_mushroom texture to not outshine the sun.\r\n* Managed to finally reduce the blinding effect of holding a torch in front of your face, who does that anyway? Silly Bethesda animations.\r\n* Managed to remove A LOT OF bloom from outdoor and indoor settings without breaking anything.\r\n* Added very subtle sharpening to the image to further reduce blooming effect of the ENB, optional no_sharpening file included in the .rar.\r\n\r\n-----------------------------------------------\r\n\r\nCALL TO ARMS: If you think you know how to do a little Creation Kit magic and add a few functionalities to the current light spells. Contact me. I\\'d want the Magelight to shoot up in the air, stop at a certain distance and hover in place lighting the area. I\\'d like the candlelight to have a different position than what it currently has and I\\'d like it to be toggle-able. How to make guard torches NOT cast a shadow, but the player torch to cast one. etc...\r\n\r\nMythFreeze",
  "categoryId": "62",
  "version": "v1.01",
  "author": "Katulobotomia",
  "createdUnix": "1328969569",
  "updatedUnix": "1329698760",
  "containsAdultContent": false,
  "uploadedBy": "katulobotomia",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28920",
      "name": "KatuMod - does not install automatically through NMM yet",
      "version": "1.0",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16602",
      "fileName": "KatuMod - does not install automatically through NMM yet-8900.rar",
      "uploadedUnix": "1328969797",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/cd485b5962fc08638c4ee8b46866aa9c33052a6cfb3abfac7ee6f19bc834ef62/analysis/1406669734/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KatuMod%20-%20does%20not%20install%20automatically%20through%20NMM%20yet-8900.rar?fid=28920&ttl=1535768026&ri=8192&rs=8192&setec=67a865dfe398533ed928cb54cfd335d6"
    },
    {
      "fileId": "30465",
      "name": "KatuMod - does not install automatically through NMM---- v1-01",
      "version": "1.01",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "16602",
      "fileName": "KatuMod - does not install automatically through NMM---- v1-01-8900.rar",
      "uploadedUnix": "1329157072",
      "modVersion": "1.01",
      "virusScanUrl": "https://www.virustotal.com/file/8655171448e77b031f6c0694170ae548d4862591e3b8eb3fbfe3042b9376c658/analysis/1406678907/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KatuMod%20-%20does%20not%20install%20automatically%20through%20NMM----%20v1-01-8900.rar?fid=30465&ttl=1535768026&ri=8192&rs=8192&setec=30901e5711432d73b8a11019b7dfa5b6"
    },
    {
      "fileId": "33961",
      "name": "KatuMod - does not install automatically through NMM---- v1-02",
      "version": "1.02",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "16602",
      "fileName": "KatuMod - does not install automatically through NMM---- v1-02-8900.rar",
      "uploadedUnix": "1329698760",
      "modVersion": "1.02",
      "virusScanUrl": "https://www.virustotal.com/file/46c9e9475b7043a7e06830529b184a95ac232c8b0251d24491fdbc4de8691789/analysis/1406697184/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/KatuMod%20-%20does%20not%20install%20automatically%20through%20NMM----%20v1-02-8900.rar?fid=33961&ttl=1535768027&ri=8192&rs=8192&setec=0f2b8b41c3a0b30bdfe5c5b297bb79b2"
    }
  ]
}