{
  "modId": 89060.0,
  "modName": "Immersive Amazing Follower Tweaks by chinagreenelvis - DELETED",
  "summary": "A modified version of AFT 1.66 which adds new functionality and makes changes to the dialogue menu system.",
  "descriptionHtml": "[size=2]This is a version of [/size][url=http://www.nexusmods.com/skyrim/mods/15524/]Amazing Follower Tweaks[/url][size=2] 1.66 by Dheuster, modified by chinagreenelvis, and ported to SSE by Velgus. Dheuster has provided open permissions to his mod as long as he is credited. chinagreenelvis has granted his additional content to the Public Domain.\n<br />\n<br />[/size]This will replace AmazingFollowerTweaks.esp in your load order. The original is not needed. \n<br />\n<br />Switching from AFT 1.66 and/or updating iAFT mid-game may or may not work and is not recommended. \n<br />\n<br />If you do plan to switch or update mid-game, first use the AFT Reset \n<br />option to dismiss your followers and follow the instructions that pop up\n<br /> when you use it. Be sure you give the reset function time to complete \n<br />the process! Then create a clean save by deactivating the mod before \n<br />making the switch. You can then attempt to make the change, provided the\n<br /> AFT Reset option works properly for you. If it doesn't, [b]begin a new game.\n<br />\n<br />[size=2]Notice: I will not troubleshoot issues with custom followers.[/size][/b]\n<br />\n<br />[u][b]CHANGES[/b][/u]\n<br />\n<br />[size=2]This version of AFT adds new functionality and makes several important changes:[/size]\n<br />\n<br />[list]\n<br />[*]\"Tweak Options\" is substituted with a much smaller and more immersive \"Let's talk about your abilities\" menu. \n<br />[*]Followers will now relax when waiting. \n<br />[*]A waiting option for the entire party will appear in the main dialogue menu when there is more than one follower. \n<br />[*]The mod is now fully compatible with [url=https://steamcommunity.com/linkfilter/?url=http://www.nexusmods.com/skyrim/mods/8429/][/url][url=http://3dnpc.com/2017/11/20/3dnpc-v3-4-for-oldrim-and-sse/][/url][url=https://steamcommunity.com/linkfilter/?url=http://www.nexusmods.com/skyrim/mods/8429/]Interesting NPCs[/url]﻿ (via a compatibility patch)\n<br />[*]The mod is compatible with the Cicero dances and friendly-fire spell patches on the original AFT download page.\n<br />[*]Followers who have been dismissed will re-equip their best gear automatically when re-hired. \n<br />[*]If either Frostfall or Sabre Gear Backpack are installed, new followers will be given a backpack. \n<br />[*]Follower carry weights have been reduced. (Adjustable)\n<br />[*]Followers can be killed by default, but that option now involves a chance of death on bleedout. (Adjustable) \n<br />[*]Most messagebox pop-ups have been disabled. \n<br />[*]A new power, called \"Leadership\", has been added. Using it will toggle \n<br />the ability to recruit non-essential characters as followers through the standard dialogue menu. By default, essential and certain other NPCs cannot be recruited as a \"safe\" option. Another targeted spell, called \"Leadership (Advanced)\" will work on any NPC.[*]Default options have been changed throughout the mod to recommended settings for immersion. \n<br />[*]SkyUI users will have access to a limited MCM.\n<br />[*]Helmet options take immediate effect.\n<br />[*]The active follower limit has been increased to 30. The number of total slots available is now 90.\n<br />[*]Werewolf and werebear followers will now change into beast form along with the player (optional DLC patch required).\n<br />[*]Optional throw-voice bugfix in MCM: Followers are no longer added to the player \n<br />faction in order to avoid the \"Hey!\" shout voice issue that arises when using USSEP and certain custom NPCs. AFT's horse riding feature will be disabled if the fix is active. I suggest a mod like [url=http://www.nexusmods.com/skyrim/mods/14950/?][/url][url=https://www.nexusmods.com/skyrimspecialedition/mods/9519/][/url][url=http://www.nexusmods.com/skyrim/mods/14950/?]Convenient Horses[/url]﻿ instead.[*]Problems with the Boethiah questline have been fixed.\n<br />[/list]\n<br />\n<br />[u][b]UPDATING\n<br />[/b][/u]\n<br />Unless specifically mentioned in the changelog, no further updates should \n<br />require the start of a new game, but it may be good practice to use the \n<br />AFT Reset option after updating. If all else fails, test by starting a \n<br />new game with all other mods disabled and your scripts folder \n<br />temporarily renamed.\n<br />\n<br />\n<br />[b][u]MOD COMPATIBILITY[/u][/b][size=2]\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/8429/?]3DNPC (Interesting NPCs)[/url] is compatible, but you may need to use the Creation Kit or \n<br />TES5Edit to remove the hard-coded \"essential\" status of some NPCs before they can be \n<br />chance-killed in iAFT.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/11609/?]Follower Trap Safety[/url] will be redundant. AFT has a built-in follower trap trigger setting.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/31799/?]Lethal Traps[/url] is compatible with everything except bear traps and will override AFT's\n<br /> follower safety feature on those. You can use it with Follower Trap \n<br />Safety and place both below AFT.\n<br />\n<br />[url=http://www.nexusmods.com/skyrim/mods/14950/?]Convenient Horses[/url]﻿ is partially compatible. Ensure it is loaded after iAFT, and disable\n<br />iAFT's follower horse features.\n<br />\n<br />[size=2][url=http://www.nexusmods.com/skyrim/mods/14950/?]Inigo[/url]﻿[/size] runs on his own custom follower system. DO NOT try to get him to work  run on\n<br />iAFT's system. The same applies for any other custom followers that use their own system.\n<br />\n<br />\n<br />[u][b]COMBINING PATCHES[/b][/u]\n<br />\n<br />If you want to use the 3DNPC patch but don't want extra \n<br />.esp files in your load order, open them up in TESVEdit and copy their \n<br />contents as overrides into AmazingFollowerTweaks.esp. You can then \n<br />delete the patch .esp file (but keep the loose files included \n<br />in the downloads).\n<br />\n<br />[u][b]CREDITS[/b][/u] \n<br />\n<br />Dheuster: For [url=http://www.nexusmods.com/skyrim/mods/15524/]Amazing Follower Tweaks[/url], which comprises the majority of this mod's assets. Please endorse the original!\n<br />[/size]chinagreenelvis: For [size=2][url=https://www.nexusmods.com/skyrim/mods/71689/?]Immersive Amazing Follower Tweaks[/url][/size], [size=2]which this is a direct port of. Please endorse the original![/size]",
  "categoryId": "33",
  "version": "3.09SE",
  "author": "Velgus",
  "createdUnix": "1516354866",
  "updatedUnix": "1516354866",
  "containsAdultContent": false,
  "uploadedBy": "Velgath",
  "primaryFile": null,
  "files": []
}