{
  "modId": 89062.0,
  "modName": "Alleyria Bosmer Racemenu Preset",
  "summary": "A Wood Elf (Bosmer) Preset I created that I believe looks semi-natural.",
  "descriptionHtml": "[center][size=3]If you're not a Nord then it's most likely you don't get much love on the Nexus when it comes to facial presets. I came to realize this once I started to look for presets for elves, orcs, beasts, redguards, and even Imperials and Bretons to a lesser extent. \n<br />One thing you may often see is a decent looking elf in an armor screenshot or something similar but the author is unwilling to give it up or doesn't even have a copy of it, so I decided that I wasn't going to get lucky and I would be better off trying to make my own face instead of having one handed to me. \n<br />Alleyria is the name of the first Skyrim character I ever made and even back then she was a wood elf so it seemed fitting that if I invested heavily into a face that she be the one to go with.\n<br />Is she perfect? Not even close, but (in my opinion) she looks better than the rest of the elven presets available. \n<br />Now I actually like what Skyrim did with elves in making them look less human and more exotic. The original idea of an elf is to be something similar to human but with characteristics we often associate with beauty blown way out of proportion to the point it seems almost Alien, they may have hit that a little too on the nose. I'm well and good with the race as a whole but as a character I want my PC to be associated closer to my own standards.\n<br />As a result Alleyria looks more Human than Elf, but her race is indeed Bosmer and she also has the cruddy low resolution Racemenu elf ears (I couldn't find a better, non-equipment alternative.)\n<br />Now I'm no modder and I don't know jack about the creation kit or creating texture files. On top of that my own mod list is quite a mess, but on here I include both the Face Preset as well as the Head Mesh Preset\n<br />I will also do my best to figure out what mods are affecting it and their load order. \n<br />[/size][/center]",
  "categoryId": "114",
  "version": "1.0",
  "author": "Awoken_Leviathan",
  "createdUnix": "1516365247",
  "updatedUnix": "1516365247",
  "containsAdultContent": false,
  "uploadedBy": "AwokenLeviathan",
  "primaryFile": null,
  "files": []
}