{
  "modId": 89097.0,
  "modName": "New Gnisis Cornerclub Bedrolls",
  "summary": "Adds a quick n' dirty place to sleep in the New Gnisis Cornerclub.",
  "descriptionHtml": "The New Gnisis Cornerclub is one of my favorite locations in the entire game, so I've always mourned its glaring lack of rentable space. There are other mods that allow you to rent a proper bed inside the cornerclub (notably Jokerine's, available [url=https://www.nexusmods.com/skyrim/mods/38640]here[/url]), but I had something even simpler in mind. \n<br />\n<br />This tiny plugin adds a pair of bedrolls (complete with well-rested bonus), a couple of furs, some straw, and a strongbox to the area behind the upper staircase. Inside the strongbox is a note from Ambarys Rendar, who explains that he is trying to help out his fellow Dunmer a bit by giving them a place to bed down in this unforgiving city. Morrowind fans will recognize some of his turns of phrase. \n<br />\n<br />In his note, Ambarys also explains the honor system behind the bedroll \"rental\". Pay what a good night's sleep on those nice hard wooden planks was worth to you...or don't. You can also take back all the gold you paid later on, but why would you do such an awful thing?\n<br />\n<br />If you run into any incompatibilities, please let me know in the comments. This is my first ever mod so be gentle. o_o",
  "categoryId": "69",
  "version": "1.0",
  "author": "Erikovna",
  "createdUnix": "1516486681",
  "updatedUnix": "1516486681",
  "containsAdultContent": false,
  "uploadedBy": "Erikovna",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264420",
      "name": "NGC Honor System Bedrolls",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "NGC Honor System Bedrolls-89097-1-0.zip",
      "uploadedUnix": "1516486393",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/fe1ebb9559225ef4a591de07aac67d6cf0514c2110047b61f563ef798651a6ae/analysis/1516486471/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/NGC%20Honor%20System%20Bedrolls-89097-1-0.zip?fid=1000264420&ttl=1535878582&ri=8192&rs=8192&setec=d3952a841f84e73a498a50f017c66c39"
    }
  ]
}