{
  "modId": 8910.0,
  "modName": "Craftable",
  "summary": "Learn new crafting techniques. Make your own arrows, lockpicks, clothes and more.",
  "descriptionHtml": "My aim in this mod is to unlock existing in-game items as craftable. I\\'m not going to just add everything for everythings sake though - only things which I feel make sense (No artifact crafting here!). I also don\\'t want to just give these recipes away at the start of the game, so I have created books which unlock the new recipes, in what I feel is a nice lore-friendly way.\r\n\r\nTo be able to craft new items, you must first find and read the relevant book. This will grant you a hidden perk which will unlock new recipes for you. The books are hidden across Skyrim for you to find. Each book is in a location relevant to the knowledge it provides (For example, \\'The Locksmith\\', which allows you to craft lockpicks can be found in the thieves guild headquarters) so bear this in mind when searching.\r\n\r\nThis is still a work in progress, and if you can\\'t find any of the books let me know with a comment and I\\'ll rethink where to put it. Whilst this is still in development, the books are also all for sale from the blacksmith in Markarth.\r\n\r\nCurrent books:\r\n-The Draugr of Skyrim (Learn the techniques of the Ancient Nords.)\r\n-Balimund\\'s Journal (Discover a new technique which allows even Soul Gems to be melted down.)\r\n-Note\\'s on the Skyforge (Craft your own Skyforge Steel.)\r\n-Silver Smithing (The Silver-Hand have re-discovered how to forge silver.)\r\n-Imperial Equipment Regulations (Details the armor and weapons of the Imperial Legion in Skyrim.)\r\n-Fletching for Dummies (Learn to craft arrows.)\r\n-Akaviri Forgemasters (Rediscover the techniques once used by the smiths of the Blades.)\r\n-The Locksmith (Craft your own lockpicks.)\r\n\r\nOther Changes:\r\n-Craftable clothing.\r\n-Smeltable Soul Gems.\r\n-Craftable and temperable Woodcutters axe and Pickaxe.\r\n-Several crafting and tempering fixes (Scaled Horn Armor, Ancient Nord Bow etc).\r\n-Leather armor requires first smithing perk to craft it (Perk has been renamed \\'Basic Smithing\\').\r\n-New set of Nord Hero armor for the end of the Companions questline, instead of standard Ancient Nord set.\r\n\r\nFor a detailed list of changes, see the readme below.\r\n\r\nAny bugs, conflicts, questions or suggestions just leave a comment and I\\'ll get right on it.",
  "categoryId": "28",
  "version": "v0.6",
  "author": "A__Gun",
  "createdUnix": "1328972367",
  "updatedUnix": "1328972367",
  "containsAdultContent": false,
  "uploadedBy": "DuhDuh",
  "primaryFile": null,
  "files": []
}