{
  "modId": 89109.0,
  "modName": "Remove Random Riften Thief",
  "summary": "Removes the Thief that randomly spawns in Riften and aggros everything.",
  "descriptionHtml": "Okay, so first off, this mod deals with scripts, which I'm NOT educated on and was more a trial-and-error based solution than anything.\n<br />\n<br />Keeping this in mind, I was hesitant to upload it until I \"knew for sure\" that it actually stopped Thieves from spawning. Which meant that I played Skyrim for a long time with this mod installed. A long long time. A long enough time that I've literally completely forgotten what the hell I did when creating it. I was using the Creation Kit and I was using scripts somehow, that's all I know. Feel free to enlighten me on the details of it in the comments.\n<br />\n<br />(Image is of the mod in TESV Edit, but I'm nowhere near proficient enough to guess at the details of it all.)\n<br />\n<br />Regardless, it seems to have worked, and no random Thieves spawn in Riften any longer. So that's nice. (Random Thieves threatening you for gold by the roadside have still been encountered so shouldn't be affected. Dunno about Random Riften Thieves in non-Riften locations though, I haven't seen them, but YMMV.)\n<br />\n<br />It seems to work fine, and I haven't really encountered any problems that seemed to originate from this mod, so here. I fixed the stupid Random Riften Thief from spawning.\n<br />\n<br />NOTE:\n<br />I will point out that one of my Thieves Guild playthroughs got... messy about scripts a great many hours into it (endlessly multiplying scripts, we're talking a couple of thousands of them, where before there were like 20). I don't THINK this mod was the cause (I'd installed a number of other Thieves Guild-related mods, and the problem showed up in Whiterun during the \"Whiterun special quest\" rather than in Riften, and was as a result fairly easy to work around in that I just didn't do that quest), but since I was way out of my depth when creating this mod and I literally can't remember what I did, this is my disclaimer.",
  "categoryId": "28",
  "version": "1.0",
  "author": "Racke7",
  "createdUnix": "1516549267",
  "updatedUnix": "1516549267",
  "containsAdultContent": false,
  "uploadedBy": "Racke7",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264468",
      "name": "Remove Random Riften Thief",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Remove Random Riften Thief-89109-1-0.rar",
      "uploadedUnix": "1516549110",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/b195398e12526acb77456bf728f41bdf99c65b58c57d484eeef553043d2a918b/analysis/1516549442/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Remove%20Random%20Riften%20Thief-89109-1-0.rar?fid=1000264468&ttl=1535878600&ri=8192&rs=8192&setec=0bbc685b53a74a36445afe15250b6989"
    }
  ]
}