{
  "modId": 89112.0,
  "modName": "Beautes ou Bogosses aux Bains - Suite de luxe",
  "summary": "Traduction en français du mod BBLS de Migal. La Suite de luxe est une maison de bain et de libertinage. Elle pourrait également être considérée comme un mod de harem, de dénudage, de gestion d'équipement, un mod de PNJs (compagnons, partenaires), un mod de lecture des compétences des compagnons ou un mod de gestion d'entreprise.",
  "descriptionHtml": "[center][color=#ffff00][size=6][u]\n<br />[b]Beautés (ou bogosses) aux bains – Suite de luxe[/b][/u][/size][/color][size=6]\n<br />[/size][/center]\n<br />[center][color=#ffff00][size=4]Traduction en français de [url=https://www.nexusmods.com/skyrim/mods/11427]Bathing Beauties or Beefcake - Luxury Suite[/url]﻿\n<br />avec l'aimable autorisation de Migal ![/size][/color][/center]\n<br />\n<br />[u][b]\n<br />[/b][/u][size=3][size=4][u][b]Description[/b][/u][/size]\n<br />\n<br />La Suite de luxe est une maison de bain et une maison de libertinage. Elle pourrait également être considérée comme un mod de harem, un mod de dénudage, un mod de gestion d'équipement, un mod de PNJs (compagnons, partenaires), un mod de lecture des compétences des compagnons ou un mod de gestion d'entreprise. \n<br />\n<br />La Suite deluxe est située en face de la ferme des Guerriers-Nés, en dehors de Blancherive.\n<br />\n<br />[b]Version :[/b] 6.21 de la version originale. Le \"a\" est un ajout personnel si je dois effectuer des corrections sur cette même version.\n<br />\n<br />\n<br />[size=4][u][b]Caractéristiques principales[/b][/u][/size]\n<br />[/size][size=3]\n<br />[/size][size=3]-Création de tenues personnalisées pourPNJs, comme si elles étaient réaliséesdans le CK. Permet de personnaliser latenue de tout PNJ qui vousapprécie.[/size][size=3]- Les tenues personnalisées peuvent être enregistrées dans un fichier externe et rechargées lors du lancement d'une nouvelle partie.\n<br />- Livré avec 7 PNJsvivant dans la suite et un gardien. Les 7 PNJs peuvent être des hommes ou des femmes. A choisir via le MCM.\n<br />- Contrôle de tenue (le premier mod pour Skyrim à le faire), avec la possibilité de permettre aux PNJs de changer de tenue, de leur plein gré.\n<br />- Ce mod est l'endroit où vous trouverez le NPC Apachii, le modèle féminin de toutes les captures d'écran pour les cheveux d'Apachii. Elle est une cliente de la Suite de luxe !\n<br />- Les PNJs de ce mod viennent avec des cheveux Apachii et une IA avancée, des atouts et des sorts.\n<br />- Possibilité de demander aux PNJs de partager votre lit sur base d'une rotation, sans être votre partenaire.\n<br />- Marchands-aubergistes et un barde.\n<br />- Tous les PNJs sont des compagnons potentiels et peuvent être mariés.\n<br />- Bain intérieur, piscine extérieure et baignoire.\n<br />- Dépendances.\n<br />- Poste de garde.\n<br />- Dénudage et ré-habillage lors de l'utilisation des piscines et des lits. Fonctionne également sur le joueur !\n<br />- Possibilité de demander un câlin.\n<br />- Possibilité d'envoyer quelqu'un se baigner.\n<br />- Possibilité de demander à un PNJ de réchauffer votre lit.\n<br />- Possibilité de demander un baiser (nécessite Osex).\n<br />- Possibilité de fesser (nécessite Osex).\n<br />- Possibilité de faire \"WooHoo\" au lit (nécessite Osex).\n<br />- Buff de sommeil exclusif à ce mod. Vous obtenez le buff de Libertinage quand vous dormez avec quelqu'un d'autre que votre partenaire dans un lit de maître de la Suite de luxe.\n<br />- Les compagnons, les mercenaires et les partenaires potentiels peuvent être invités à vivre dans la Suite de luxe (25 emplacements).\n<br />- Possibilité de proposer un emploi comme gardien ou gardes de la Résidence à des compagnons, vanilla ou personnalisés. \n<br />- Trois nouveaux sorts : Harponnage (tire un PNJ à vous), Résurrection et Téléportation à la Suite de luxe.\n<br />- Système de génération de revenus fonctionnel, impliquant environ une centaine de PNJs vanilla de tout Bordeciel.\n<br />- Une énergie éthérée vit dans le sous-sol avec une trame de fond conviviale (système de téléportation).\n<br />- Les mannequins d'entraînement sont sensibles aux atouts et donnent de l'XP pour les compétences que vous utilisez sur eux. Ce n'est pas un système de triche, vous devez travailler pour progresser de niveau sur ces mannequins.\n<br />- Coffres de triche dans le sous-sol (un avec tous les livres de sorts vanilla, l'autre avec tous les livres de compétences vanilla). Peuvent être désactivés dans le MCM.\n<br />- Boutons de triche dans le sous-sol (lingots, gemmes spirituelles, cuir, potions).\n<br />- Affichage des statistiques des PNJs (affiche également le nombre d'emplacements d'invitations restantes).\n<br />- Affichage des atouts des PNJs.\n<br />- Affichage des sorts desPNJs.\n<br />- Tous les objets standards d'un mod de maison (râteliers, coffres, plus de 30 lits, stations d'artisanat, etc.).\n<br />- Ce mod ne modifie pas le contenu du jeu vanilla. Il est propre et essayer de le nettoyer plus loin serait une erreur ![/size]\n<br />\n<br />[size=3][size=3][size=4][u][b]Bugs et compatibilités[/b][/u][/size]\n<br />\n<br />Je vous renvoie à la page originale du mod. Je compléterai cette partie si nécessaire.[/size]\n<br />\n<br />[size=4][u][b]Note sur la traduction[/b][/u][/size]\n<br />\n<br />Si vous trouvez encore des fautes ou des maladresses, merci de les signaler, si possible avec une capture d'écran. \n<br />J'ai essayé de faire en sorte que le texte convienne que vous jouiez un personnage mâle ou femelle, que vous soyez vous-même mâle ou femelle, s'il y a des erreurs, merci de les signaler également.\n<br />\n<br />\n<br />[/size][url=http://www.confrerie-des-traducteurs.fr/skyrim][/url][center][url=http://www.confrerie-des-traducteurs.fr/skyrim][size=3][b][color=#ffff00][size=6]Pour d'autres mods en français avec des traductions de qualité : [/size][/color][/b][size=4][u][b]\n<br />[/b][/u][/size][/size]\n<br />\n<br />[/url][url=http://www.confrerie-des-traducteurs.fr/skyrim][img]http://www.confrerie-des-traducteurs.fr/forum/styles/conf/theme/images/logo2.png[/img][/url]\n<br />\n<br />[size=3][b][color=#ffff00][size=6]\n<br />N'hésitez pas à consulter notre guide pour SSE :\n<br />\n<br />[url=https://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=349&amp;t=26126][img]https://www.confrerie-des-traducteurs.fr/forum/upload/Yoplala/Yoplala_1518922767_Guide_Logo.png[/img][/url][/size][/color][/b][/size][/center]",
  "categoryId": "67",
  "version": "6.21a",
  "author": "Migal et OldMansBeard",
  "createdUnix": "1516555937",
  "updatedUnix": "1516555937",
  "containsAdultContent": false,
  "uploadedBy": "Yoplala2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264474",
      "name": "Suite de luxe 6.21a",
      "version": "6.21a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "314496",
      "fileName": "Suite de luxe-89112-6-21a.zip",
      "uploadedUnix": "1516555182",
      "modVersion": "6.21a",
      "virusScanUrl": null,
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Suite%20de%20luxe-89112-6-21a.zip?fid=1000264474&ttl=1535878603&ri=8192&rs=8192&setec=13aff81e3dade9ab4bcd6cbb63c83a37"
    }
  ]
}