{
  "modId": 89123.0,
  "modName": "JE's Guildhome And Tavern",
  "summary": "A simple player home and/or tavern.<br />Plenty of room to start a guild or family!<br /><br />Off the road far enough to be comfortably secluded, but still easy to get to. Just head towards Gjukar's Monument and slightly to the right.",
  "descriptionHtml": "[b][u][size=5]-Two Sword Guild and Tavern-\n<br />[/size][/u][/b][size=3]\n<br />[i]Cities rise and fall; people are born and die. Time flows ever forward.[/i]\n<br />[i]In the plains West of Whiterun sits a grand hall, now abandoned. [/i][/size]\n<br />\n<br />The Two Sword Guild &amp; Tavern is a building just large enough for a small guild or large family. Easy to get to on foot or by horse, but private enough that you shouldn't have any unwanted guests (besides wildlife). It's designed after my D&amp;D guild's home base, but has all the amenities you'd expect from a medium Skyrim player home. Not quite a mansion, but really too big for single person. \n<br />\n<br />Inside you'll find crafting tables, a kitchen &amp; eating area, 2 \"bathrooms\", beds for your housecarl, spouse, steward and children, plus 4 spare beds upstairs.\n<br />\n<br />Outside is a stable, forge &amp; crafting area, practice dummies, an archery mound, a garden, 2 seating areas, and a waterfall where you can shower more or less discretely. Nature and neglect have partially buried these, however. \n<br />\n<br />The only things missing are useable weapon or armor displays. It [i]was[/i] home to a D&amp;D guild, so if it wasn't worth wearing, it was [i]definitely[/i] worth selling. Gotta pay for all the booze &amp; spellbooks somehow!\n<br />\n<br />*All containers are safe, non-respawning storage, EXCEPT: All containers in the cart outside, Korrin's Ingredients Cabinet, and everything in the hidden tunnel.*\n<br />\n<br />[b]100% Vanilla* Oldrim; ZERO Requirements![/b]\n<br />[size=3]To Install/Uninstall, just download/delete and enable/disable JEsGuildhomeAndTavern.esp\n<br />[/size]*Without Hearthfire being a requirement, you will need another mod to move your people in. \n<br />\n<br />[i]My screenshots are pretty hideous... on purpose! [/i][size=2]\n<br />Any vanilla mesh or texture replacements will effect every relevant part of this mod. Whiterun &amp; Riften retextures, especially.\n<br />I took all screenshots in a near-vanilla state, no ENB, as I have many, many replacers and your version would likely look MUCH different.[/size]\n<br />[i]Just about any texture overhaul or ENB will make it look 1000% better, automatically.[/i]\n<br />\n<br />[b][size=3]-Where is it?-[/size][/b]\n<br />About halfway between Rorikstead &amp; Gjukar's Monument.\n<br />Take the road from Whiterun towards Markarth, and just as the monument comes into view, you should spot a lamp post and barrel. Skirt around to right of the monument and just up the hill you'll find another sign post. Keep heading up the hill and the building should be visible.\n<br />\n<br />[b][size=3]-How do I get in?-[/size][/b]\n<br />There's no quest to purchase it, seeing as its owners technically still own it, but no one is coming back any time soon. \n<br />Just find a key and make yourself at home!\n<br />\n<br />[b][size=3]-About that key...-[/size][/b]\n<br />Assuming you're standing at the doorstep, look around carefully. \n<br />It's hidden Right under your feet. \n<br />\n<br />[b][size=2]Still can't find it? [/size][/b]\n<br />[SPOILER] The main key is in a Fake Rock, to the right of the porch, behind the torch.[/SPOILER]\n<br />\n<br />[b][size=3]-BONUS? BONUS!-[/size][/b]\n<br />[SPOILER]My main character has a house behind Halldir's Cairn. \n<br />\n<br />All the keys are in her bedside table, downstairs.\n<br />\n<br />(This house's key is on the roof, in the bird's nest against the chimney. You can get on the roof easily by going around back and jumping from the hill onto the leftmost corner. )[/SPOILER]\n<br />\n<br />[b][size=3]-About that Follower...-[/size][/b]\n<br />Just a very basic follower at the moment, only meant to add a little background to the Guild (and provide another way of getting keys to this place).\n<br />She mostly just wanders about these days, but will sell you junk she's collected along the way.\n<br />\n<br />I've locked her at level 20, just so she isn't one-shotted by people straight outta Helgen, but leaving her still very killable if you just want to loot her and move on. \n<br />\n<br />[b]Stats &amp; Details:[/b]\n<br />[SPOILER][b]Name[/b] (current alias): Korrin Ashmeade\n<br />[b]Race:[/b] Bosmer\n<br />[b]Gender: [/b]Female\n<br />[b]Level:[/b] 20 (set; does not level)\n<br />[b]Preferred Armor: [/b]Light\n<br />[b]Preferred Weapon:[/b] One Handed\n<br />[b]Class:[/b] Vampire (custom)\n<br />[b]Combat Style: [/b]Spellsword (custom)\n<br />[b]Known Spells ([/b][u]ver 0.6 only[/u][b]):[/b] Healing, Fast Healing, Close Wounds, Flames, Ice Spike, Invisibility &amp; Reanimate Corpse\n<br />[b]Perks:[/b] Agile Defender (2 ranks), Armsman (2 ranks), Stealth (3 ranks), Muffled Movement, Light Foot, Quick Hands, Expert Locks (and lower), Quiet Casting, Necromage, Regeneration &amp; Hypnotic Gaze\n<br />[b]Voice Type: [/b]FemaleEvenToned (or whatever your Wylandriah is)\n<br />[b]Height: [/b]1.00 (also Wylandriah's)\n<br />[b]Weight:[/b] 50 (also Wylandriah's)\n<br />[b]Protected, does not affect Stealth, is marriageable.\n<br />\n<br />Wandering Schedule:\n<br />[/b][SPOILER]Morndas - Hangs around Falkreath. Bugs the Jarl for work and visits a secluded, nearby pond.\n<br />Tirdas - Heads to Riften for work. Shops in the Market and relaxes at the Ragged Flagon.\n<br />Middas - ???\n<br />Turdas - Lazing around Windhelm. If she's not drinking in the Cornerclub, she's bugging Argonians out at the Docks.\n<br />Fredas - Probably drunk and still sleeping it off at the Cornerclub.\n<br />Loredas - ???\n<br />Sundas - Heads home. [/SPOILER]\n<br />\n<br />Korrin Ashmeade is my first TES character, from way back in Morrowind. She's like... super old. Being an elf helps. So does occasionally being a vampire. She's way less bitey at the moment, though.[/SPOILER]\n<br />- - -\n<br />\n<br />As the years have gone by, in reality and in game, all the guild members have moved on. The guild hall has become empty and all my old friends have long grown apart, but that only makes room for opportunity! \n<br />With every new house or job, new people and experiences await us, just as this building waits patiently for whatever the future holds.\n<br />[i][size=3]\n<br />Will a new family grow and flourish on the open plains? \n<br />Will bandits move in and hatch new, dastardly operations?\n<br />Perhaps a new guild will form, rekindling the former's lust for adventure?\n<br />Or will time take its toll, washing away the memories already forgotten...\n<br />[/size][/i]\n<br />- - -\n<br />This is my first, and probably only, publicly released mod. \n<br />Because of that, I do plan on supporting it forever. I'll never delete it or my account one day on a whim. As far as finishing it... only time will tell.\n<br />\n<br />I've done my best to keep everything clean &amp; tidy, but do let me know if you find any glaring bugs. Cleaned manually and with TES5Edit, but slipups do happen. \n<br />\n<br />I tried to put it in an open spot, but by now there are likely 6 different house mods sitting in the same spot. Let me know if you find any and I'll list them in the description here. I've already relocated it twice, thanks to settlements being too close for comfort, though not actually conflicting. Rorikstead is far enough away that ETaC and similar expansions shouldn't reach anywhere near, but the Whiterun Imperial camp is just a stone's throw away. Any large civil war mods that may add on to that will likely conflict.\n<br />\n<br />Also, feel free to make whatever tweaks and edits to it you like, no need to ask ahead of time. If you feel like doing something really crazy with it, and would like to upload it, go right ahead! \n<br />\n<br />[b][size=3]SSE Port?[/size] If somebody else does it, sure.[/b]\n<br />I do not have SSE, but all you have to do (as far as I know) is open it in the new Creation Kit and resave it. There are no new meshes or textures, so nothing else should need updating.\n<br />\n<br />[b][size=5]!!! KNOWN BUGS, ISSUES and CONFLICTS: !!![/size][/b]\n<br />-Needs to be reNavMeshed. NPCs can walk around and interact with things, but may run into chairs, walls, etc. \n<br />[i]I plan on doing this once everything else is finished, but if a navmesh pro wants to take a swing at it, I'd absolutely love you for it.[/i]\n<br />\n<br />-The toilet paper in the bathrooms will launch itself everywhere if you try to take one. Can't be helped (without external assets).\n<br />\n<br />-There's a fork at the end of a tunnel in this that ends in a door to the left and an autoloading, no-door tunnel to the right. The name of the right tunnel will pop up too soon as you near the fork. I haven't figured out how to shorten the distance yet, but it works as intended otherwise.\n<br />\n<br />-Needs more cluttering to feel more natural. Currently in progress!\n<br />\n<br />-I've been debating adding my main as a follower in this, mostly to add flavor. At the moment, she's been removed, but may return in the future.\n<br />\n<br />-Thanks to the follower's removal, all of her things are no longer marked as owned. I'd removed the flag for personal use and forgot to replace it before uploading. [i]This will be fixed in the next update[/i], so get your legal thievery done while you can!\n<br />\n<br />[b][size=5]IMPORTANT NOTE - AS OF FEB 28th:[/size][/b]\n<br />[b]Moving Update:[/b] FINALLY in our new home! \n<br />Currently too busy filling in my irl home base to decorate this one, and I don't think the tiny tweaks I did so far warrant an upload yet.\n<br />Will keep you guys updated and get back to this asap!\n<br />\n<br />[b][size=3][u]Progress Report (will be moved to changelog after releases):[/u][/size][/b]\n<br />Update posted. \n<br />\n<br />[b][size=3][u]Current Game Plan:[/u][/size][/b]\n<br />-Beef up the clutter level further\n<br />\n<br />-[ Moving Hiatus ]-\n<br />\n<br />-NavMeshing &amp; Bug fixing ([b]please post anything wonky you find[/b], whether I'm available or not)\n<br />-Add Legendary version, for Hearthfire support and addition decorating options\n<br />-Add optional, custom follower versions (because my elfu is [i]at least[/i] half a step above vanilla, [i]I swear[/i])\n<br />-[s]Custom voicing for follower[/s] [i]lol nobody wants this, my voice is actually sub-vanilla istg[/i]",
  "categoryId": "67",
  "version": "0.6",
  "author": "JerisEnigma",
  "createdUnix": "1516597228",
  "updatedUnix": "1517017296",
  "containsAdultContent": false,
  "uploadedBy": "JerisEnigma",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264515",
      "name": "JEsGuildhomeAndTavern",
      "version": "0.5",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "174",
      "fileName": "JEsGuildhomeAndTavern-89123-0-5.zip",
      "uploadedUnix": "1516595454",
      "modVersion": "0.5",
      "virusScanUrl": "https://www.virustotal.com/file/173c51473ba63eeed5f50b733b9667c91fa8f0ce9e161626dd8fb98177e8e1a4/analysis/1516595703/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/JEsGuildhomeAndTavern-89123-0-5.zip?fid=1000264515&ttl=1535878618&ri=8192&rs=8192&setec=afe551eae9dc0c2d7e446ced4838edb4"
    },
    {
      "fileId": "1000264868",
      "name": "JEs Guildhome And Tavern",
      "version": "0.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "175",
      "fileName": "JEs Guildhome And Tavern-89123-0-6.zip",
      "uploadedUnix": "1517017296",
      "modVersion": "0.6",
      "virusScanUrl": "https://www.virustotal.com/file/9c7d335c2c049aa9d067b62e40ccac1477fa71988a78514bd9f7e3e4a48bc779/analysis/1517017383/",
      "changelogHtml": " More clutter added. Decorations in the main bedrooms, mostly books in the upper spares. <br/> \n Interior windows, with natural lighting added. <br/> \n Basic follower reimplemented. Protected, marriageable and a merchant. (Carries most guild &amp; house keys) <br/> \n [Known bug] Location data edited and markers nudged. NPCs still don't like entering on their own. Still being looked at. <br/> \n [Possible bug] Follower's packages take forever to start, but do eventually process. Also being looked at. <br/> \n",
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/JEs%20Guildhome%20And%20Tavern-89123-0-6.zip?fid=1000264868&ttl=1535878619&ri=8192&rs=8192&setec=92ecd57f9f1ca926abc7169ecab66ba8"
    }
  ]
}