{
  "modId": 89134.0,
  "modName": "Leybru Market",
  "summary": "\"Leybru Market\" mod adds a new very small world where you can buy stuff from other mods but that is up to you to make the change using SkyrimEdit or the Creation Kit, otherwise, it can be used as a simple location to buy vanilla/dlcs stuff and of course sell your stuff.",
  "descriptionHtml": "[u][color=#ff0000][size=6][i][b]IMPORTANT[/b][/i]: The mod is in very early state, it's not even a beta yet, it's an Alpha, an uncompleted alpha, uncompleted mod, early access, call it whatever you want it, it is NOT completed, I am just sharing it here for people who wants to try it and have an idea of what's to come, there's just so many things to take care of, misplaced items, items and npcs to add, only 2 vendors are there, the rest have yet to be created, optimization is missing, etc...[/size]  [size=6]I'll finish this soon in the future, I just don't know when, I have lot of things to do, lot of mods to take care of, lot of videogames to play plus I love the outside World, you know, forests and that kind of thing? I love biking and doing stuff other than gaming and modding so that's why nothing is sure, but I'll try to finish it soon, I won't be playing Skyrim anymore as long as this mod isn't done, I'll make the same mod for Fallout: New Vegas and that's for sure, especially since it will be way more of use to me and probably many more players considering the unbelievable quantity of weapons/mods found around the internet which doesn't even have formlist or anything of the sort, this mod will remedy it.[/size]\n<br />[color=#ff7700][size=4]\n<br />How did it started?[/size][/color][/color][/u]\n<br />[color=#ff7700]Leybru is a location that I have create all by myself, it does not actually exist in the world of Tamriel but it is actually very lore-friendly, it's an island located not far away from Cyrodiil, called Leybru, unlike Cyrodiil, it is neutral, it does not belong to the Imperials or any factions of Tamriel.[/color]\n<br />[color=#ff7700]It's a small island, so what can we do we that? They asked. [/color]\n<br />[color=#ff7700]They had the idea to make it a place for vacations so an Inn was build there a few months later.[/color]\n<br />[color=#ff7700]Merchants came and left until some merchants decided to stay there, that's when the place became a global market.[/color]\n<br />[color=#ff7700]Now there are merchants each with their speciality (one handed weapons, marksman, alchemy, books, clothing, etc) who are always there to welcome you (of course, they do sleep, let them sleep, don't bother them or else you'll  be fighting a giant who'll crush the whole island... Nah, it's just a joke, that's not really in the mod, I'll take it in note for future releases though..)[/color]\n<br />\n<br />[color=#1e84cc][size=4]How to get to the island? \n<br />[/size][/color][color=#1e84cc]For now, you can only go there using console commands.\n<br />No worries, once the mod will be entirely finished, you'll be able to get there using someone's boat/talking to the person and he'll invite you to his ship. will it be free or will it cost gold? It will probably cost gold, I don't know how much but it will probably be about 500 gold and you won't be forced to pay after that one time since you'll be able to travel directly from Leybru to Skyrim and vice versa.\n<br />For now, use one of these commands:  \n<br />[/color][color=#9900ff]coc leybrubeach[/color]\n<br />[color=#9900ff]coc leybrumarket01\n<br />[/color][u][color=#9900ff]coc leybrumarket02\n<br />[/color][u][color=#9900ff]coc leybrumarket03[/color][/u]\n<br />[u][color=#9900ff]coc leybrumarket04[/color][/u]\n<br />\n<br />[color=#00ff00]The Music:[/color][/u]\n<br />[color=#00ff00]It even has custom music! Which will makes you remember about the Runescape music or The Elder Scrolls II: Daggerfall since it is technically music coming straight from that game which I have also modified.\n<br />Should be good since the game is free, Bethesda had nothing to say about that to me, they probably don't care since they do not make money off that game anymore (since it is free), I am not gonna make any money off it either, it's just there to gives you another feel.\n<br />I may or may not enhance it later with instruments and other stuff.[/color]\n<br />[size=4]\n<br />[color=#00ffff][u]What can I do with the mod?[/u][/color][/size]\n<br />\n<br />[color=#00ffff]#1 - The primary aim of this mod is for people like me who has lot of content mods, you don't want to have all those custom items in a chest or in one guy easy to kill, or even directly spawning in your inventory right when you get in the game, do you? One thing's for sure, I don't, so with this, you may add formlist of items you want to have in your game, let's say that you have  3 - 4 mods, you want them to be sold, there are lot of vendors in this game, you got a mod that has 50 one handed weapons and one that has 65 two handed weapons? That's great! You'll be able to sell them separately in a World where it will not affect the other mods.\n<br />Of course, you'll have to learn how to use the Creation Kit or SkyrimEdit but let me tell you this, it's simple and easy, really.\n<br />\n<br />#2 - Just use it for vanilla stuff, if I ever complete the mod, you won't have to do anything but to use it and enjoy it as it will be .\n<br />\n<br />[/color]\n<br />[color=#f4f4f4]That's pretty much it, I started working on this mod back in 2016 but never really had the time to take care of it but no worries, I'll be finishing it soon.\n<br />\n<br />\n<br />\n<br />If you want to report me for using music from another game, why don't you contact me first? If an admin from the Nexus wants me to remove the music, I'll do it, but if they can read the \"[color=#00ff00]The Music[/color][/color][color=#00ff00][color=#ffffff]\", they'll probably understand that there is nothing wrong to it for those reasons:.\n<br />1. Comes from a Bethesda game.\n<br />2. Comes from a game that is free on Bethesda website (plus I paid for the game on GoG).\n<br />3. Not making any profit off it.\n<br />4. I just want people to enjoy it.[/color]\n<br />[/color]",
  "categoryId": "89",
  "version": "0.21",
  "author": "Francis Lahaie aka FrankSalvatore",
  "createdUnix": "1516645901",
  "updatedUnix": "1516645901",
  "containsAdultContent": false,
  "uploadedBy": "FrankSalvatore",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264547",
      "name": "Leybru Market ALPHA 0.21",
      "version": "0.21-Alpha",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "42125",
      "fileName": "Leybru Market ALPHA 0.21-89134-0-21-Alpha.rar",
      "uploadedUnix": "1516645883",
      "modVersion": "0.21-Alpha",
      "virusScanUrl": "https://www.virustotal.com/file/1a7252101f619e40e69fec655e8c737652315c2357b9929f321cc1dc92e43b0b/analysis/1516646107/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Leybru%20Market%20ALPHA%200.21-89134-0-21-Alpha.rar?fid=1000264547&ttl=1535878631&ri=8192&rs=8192&setec=2827e3c77e1ffc4d6559fe8794bd3f85"
    }
  ]
}