{
  "modId": 89148.0,
  "modName": "A Follower's Camp - DELETED",
  "summary": "",
  "descriptionHtml": "[center][color=#e69138][size=6]A Follower's Camp\n<br />[/size][size=5]IT'S BACK, MY FRIENDS\n<br />[/size][/color][size=4][color=#e69138](Special Edition Compatible)[/color]\n<br />[/size]\n<br />\n<br />[size=5]This is a mod that adds a camp south of The Half-Moon Mill by lake Ilinalta for you and your followers to inhabit.[/size]\n<br />\n<br />\n<br />\n<br />[size=5]A little backstory...\n<br />[/size][size=4]A Follower's Camp is a mod that I published once upon a time, in June of 2016. It raised a decent amount of attention and had many downloads from many wonderful people. I worked tirelessly on updating and patching the mod, until my motivation for it declined rapidly. I finally got my mojo back and decided to re-upload A Follower's Camp to the Skyrim Nexus. It's here, guys![/size]\n<br />\n<br />[size=4]Also, I would like to give a huge shoutout and thanks my friend Aba42 for making all of this possible. I accidentally deleted my mod after I unpublished it and he mailed every bit of it back to me.\n<br />[/size]\n<br />\n<br />[size=5]The camp contains:\n<br />[/size][size=4]guard towers\n<br />a player home\n<br />very safe walls[/size]\n<br />[size=4]a few small farms\n<br />a blacksmith merchant\n<br />a silver mine (incomplete)\n<br />also, an apothecary merchant\n<br />and every possible crafting station I could think of[/size]\n<br />\n<br />\n<br />[size=5]A few notes:\n<br />[/size][size=4]1.) I am currently working on a completely new, custom-made silver mine to replace the placeholder. Yay! \n<br />2.) The camp is still in great development. There can be lots of bugs so bare with me, guys. \n<br />3.) I will leave older versions up for download if you do not want a larger campsite. \n<br />4.) This mod has been cleaned with TES5Edit, I hope you guys don't encounter crashing issues in the future. [/size]\n<br />[size=4]    \n<br />\n<br />\n<br />[/size][size=5]Known Incompatibilities[/size]\n<br />[size=4](mods that do not work with this mod)\n<br />[/size][url=http://www.nexusmods.com/skyrim/mods/41852/?][size=4][/size][/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/41852/?][size=4]Aurora Village[/size][/url]\n<br />[size=4][url=http://www.nexusmods.com/skyrim/mods/79307/?tab=4&amp;&amp;navtag=http%3A%2F%2Fwww.nexusmods.com%2Fskyrim%2Fajax%2Fcomments%2F%3Fmod_id%3D79307%26page%3D1%26sort%3DDESC%26pid%3D0%26thread_id%3D4932020&amp;pUp=1]Immersive Bandit Camps[/url]\n<br />[url=http://www.nexusmods.com/skyrim/mods/9557/?]Alternate Start - Live Another Life[/url] (It will work, but place Alternate Start at the bottom of your load order)\n<br />Grass mods can interfere with the camp grounds. There is no way for me to fix this. Sorry!\n<br />[/size][size=4]\n<br />\n<br />[/size]\n<br />\n<br />\n<br />\n<br />[size=5]Patch &amp; Update Notes\n<br />[/size]\n<br />[size=4]Version 0.1 - Added the camp Version 0.5 - Added a second partition to the camp; three farms, a second dock, a witch hut, third camp gate, grindstone, smelter, cart, and fixed some floating objects.\n<br />[/size]\n<br />[size=4]Version 0.6 - Finished and fine-tuned Navmeshes, added a lot more clutter, removed leek farm, added large adventurer's tent, added light to the campfires, and added light posts.\n<br />[/size]\n<br />[size=4]Patch 0.69 - Finalized Navmesh (Followers can now move between cells without getting stuck, less problems for you guys), added a little bit more Navmesh where it was needed, and fixed object positions.\n<br />[/size]\n<br />[size=4]Version 0.7 - Added more clutter, moved the teleport marker so when you fast travel to the camp, you spawn outside of it, added Silver Mine (Broken-Wrist Mine), readjusted Navmesh, and fixed a few things.\n<br />[/size]\n<br />[size=4]Version 0.8 - Added more clutter and small, bridged island with a player home &amp; dock on it. Added a lot of idle positions to the camp (like leaning on a wall or sitting on a rock).\n<br />\n<br />Version 0.81 - Added 2 new merchant NPCs. Fixed some object positions and moved a few things around. Added more clutter and stuff.\n<br />\n<br />[/size]\n<br />\n<br />[size=4]WARNING: The silver mine in Version 0.7 is only a placeholder and may have some visual errors, such as disappearing walls and floors. WARNING: If you are updating this mod, remove all of your personal items from the camp's containers before you update. Otherwise, you will lose them.\n<br />[/size]\n<br />\n<br />[size=5]Version Expansions\n<br />[/size]\n<br />[size=4]Version 0.1 - Base Camp, smallest version Version 0.5 - Added an expansion, camp is twice as big as version 0.1\n<br />\n<br />Version 0.6 - No expansion added, same size as version 0.5\n<br />\n<br />Version 0.69 - No content added (Just a patch update)\n<br />\n<br />Version 0.7 - Added Silver Mine (Broken-Wrist Mine), no camp expansion added, camp is the same size as version 0.5\n<br />\n<br />[/size][size=4]Version 0.8 - Added a small island with a player home on it, camp is slightly larger than version 0.7 \n<br />\n<br />Version 0.81 - No expansion added, version is the same size as version 0.8\n<br />\n<br />\n<br />\n<br />[/size][size=6]Thank you all for downloading and endorsing. It means a lot! &lt;3[/size][/center]",
  "categoryId": "67",
  "version": "0.81",
  "author": "Spectrosity",
  "createdUnix": "1516712076",
  "updatedUnix": "1516712076",
  "containsAdultContent": false,
  "uploadedBy": "JinxedThief",
  "primaryFile": null,
  "files": []
}