{
  "modId": 8916.0,
  "modName": "Battlemages Arcane - Tactical Spellcasting",
  "summary": "New spells : stricly balanced, polyvalent, easily accessible and tactical. No overpowered balance-breaking uberspell. But fun. Try it &#33;\r<br />\r<br />New spells every week &#33;\r<br />\r<br />From the guy who brought you &#34;Tactical Crafting&#34; for Fallout New Vegas",
  "descriptionHtml": "[b][color=peru][size=4]Hi, ladies & gents, if you fancy looking at my next mod, please visit my [url=http://baronvonchateau.tumblr.com/tagged/autumnleaves/chrono]Autumn Leaves page.[/url]Your support, interest and endorsement are much appreciated. ;)[/size][/b][/color]\r<br />\r<br />As a sidenote, this bastard project of mine is the reason why I haven&#39;t been updating Tactical Spellcasting for a while. Sorry for this&#33;\r<br />\r<br />[b][color=skyblue][size=6]Description[/size][/b][/color]\r<br />\r<br />The Battlemage&#39;s Arcanes is a mod intending to add a new layer of planification and reactivity to spellcasters who don&#39;t want to entirely rely on Conjuration and Illusion while playing In Expert or Master difficulty. It extends the magic gameplay by giving the player new options and allowing him/her to devise new strategies to overcome those diffcult odds. It is not a rebalancing of existing spells : there are other mods that seems to be covering that issue fairly well - and I also have a hunch that Bethesda may address that in a upcoming patch or DLC.\t\r<br />\r<br />Update 03/10/2012 :\r<br />New spells : Reflecting Ward & Conjure Murderous Spirit\r<br />\r<br />Update 02/29/2012 :\r<br />Resolution of minor issues (Time spells) and addition of the Great Feather spell\r<br />\r<br />Update 02/17/2012 :\r<br />New spells : Overheat and Elemental Gambit.\r<br />Correction of many minor issue :\r<br />Endurance spell modified to be non-cumulative with itself, magnitude of aerial form spell modified to be non-abusable. Little change to some radius and durations.\r<br />Compatibilty issue : normally, things should work fine with (most) magic rebalancing mods.\r<br />\r<br />\r<br />This mod is intended to be :\t\r<br />\r<br />\r<br />- [b][color=skyblue]Fun[/b][/color]: a good chunk of those new spells are rather low level and are supposed to last all your spellcasting career. Most of them are multi-purpose and may be used for various reasons.\t\r<br />- [b][color=skyblue]Balanced[/b][/color] : no spells are overpowered. If any of them is OP, you&#39;re free to shout &#34;OP&#33;&#33;&#33;&#33;&#34; and point your finger at me.\t\r<br />- [b][color=skyblue]Perfectly integrated into the game&#39;s world[/b][/color] : merchants, general stores and teachers sell spell tomes accordingly. \r<br />- [b][color=skyblue]Non-conflicting[/b][/color] with other existing magic mod\t\r<br />- [b][color=skyblue]Limited in number[/b][/color] : since you crazy kids are surely playing with other awesome spell mods, I intend to keep the spell additions to a minimum and avoid cluttering.\t\r<br />\r<br />Feel free to criticize this mod any way you want, especially If it fails to deliver any of the points above. If I&#39;m not too lazy, I&#39;ll address the issues you&#39;ll raise, you silly community you.\t\r<br />\r<br />[b][color=skyblue][size=6]Testimony[/size] (from Draren Andrethi, Dunmer Battlemage)[/b][/color]\r<br />\r<br />&#34;So I&#39;m lost in that FORSAKEN labyrinth-tomb you Nords like to build every time a member of your family dies, and I&#39;ve got no potions of any kind and I just burned my last scrolls battling a MAJESTIC dragon outside. There&#39;s a room ahead of me, and I&#39;m like crouching into the shadow, like, INVISIBLE. And inside, there are five Draugr on the prowl for some sweet Dark Elf HAPPY MEAL, if you know what I&#39;m saying. And I&#39;m a mage, see, and there is an UberDraugr in the middle of the room and if he does anything such as SNEEZE on me, I&#39;m MINCEMEAT CONFETTIS.\r<br />\r<br />So I THINK, because that&#39;s what we mages DO with our BRAINS, because that&#39;s the best weapon we have, and I devise a PLAN, see? With my left hand I prepare the &#34;CURSE OF ETHER&#34; spell, and in the other &#34;TIME SKIP&#34;, because those spells take their SWEET TIME before we can cast them.\r<br />\r<br />And as I&#39;m getting ready, the OverWhateverDraugr suddenly sees me but it&#39;s already too late, because I ZAP the mongrel OUT of EXISTENCE for 10 seconds or so with my &#34;Curse of Ether&#34; spell, and he can&#39;t WHACKAMOLE me anymore with that gigantic hammer of his. Then the four others begins to run at me like I&#39;m some kind of TASTY sweetroll and I&#39;m like &#34;TIME-AKHAZAM&#34; with my other hand and they are now like slo-moing like asmathic mudcrabs. But it doesn&#39;t matter anymore because I now FRY &#39;em with some sweet-butt-jumping thunderbolts, and to make sure they don&#39;t come drooling on my classy glass boots I &#34;SHOCKWAVE&#34; em so they stay in place like obedient little puppies - until I SHOUT them to FLAMES with my awesome Dovakhiin powers.\r<br />\r<br />So I&#39;m like the king of the hill but then I remember the Draugr boss will soon get up from his stasis to whack me real good, so I prepare a little SURPRISE for when he gets back into this reality and I lay down some cool &#34;DISARM RUNE&#34; on the floor while replenishing my Magicka by transmuting my BLOOD, because we, mages, are AWESOME like that. Then the guy pops up back and just WALKS into my rune and WHOOOPADAFFODIL goes his two handed-hammer. The rest of the story involves me tenderizing his hide with successive THERMAL COMPRESSIONS and EXPANSIONS until he goes back sleeping and dreaming about his own personal harem of nice little decomposed ladies.\r<br />\r<br />-Whoa&#34; says one of the Nords in the assistance &#34;But how did you do that ?&#34;\r<br />-Simple&#34; answer the Dunmer, while raising his mead with AWESOME juniper berries mixed in &#34;I downloaded the Battlemage Arcanes Mod.&#34;\r<br />\r<br />\r<br />[b][color=skyblue][size=6]Spell Descriptions :[/size][/b][/color]\t\r<br />\r<br />- Aerial Form (Restoration) : polyvalent and useful spell allowing you to run faster for a prolonged time. Use it to dodge attacks, space your opponents or otherwise flee that argument with your spouse &#34;Dragon bones, again ? Where do you expect me to put all those ?&#34;.\t\r<br />\r<br />- Shock Wave (Alteration) : by sending a concentrated amount of magicka to a specific point on the ground, you are able to briefly stagger all opponents caught in its radius.\t\r<br />\r<br />- Curse of Ether (Alteration) : the single target of your choosing is stuck in an ethereal stasis, allowing you to clear up in the meantime whatever minions stands in your way. Careful, though, the spell takes some seconds of casting before being ready.\t\r<br />\r<br />- Disarming Rune (Alteration) : for the pacifist or otherwise unchivalrous spellcaster. The poor sod happening to lost his trail into this Rune will instantly lose his weapon. Who&#39;s feeling lucky now ?\t\r<br />\r<br />- Ethereal Snap (Destruction) : scorched earth, scorched magicka. The mage on the wrong end of this spell lose a cutting amount of Magicka. Cutting? Yes, cutting. Like that blade you got in your other hand.\t\r<br />\r<br />- Time Skip (Alteration) : Allow you to fiddle with time&#39;s flow. Due to the long casting time, some prefer to use it just before a swooping suprise attack in a room full of unsuspecting foes. That&#39;ll teach &#39;em not to pick their nose when they&#39;re alone.\t\r<br />\r<br />- Thermal Compression and Thermal Expansion (Destruction) : Two sides of the same coin. A fire attack that weakens the opponent to ice magic, and an Ice attack that weakens the opponent to fire magic. Use them in combinaison or...\r<br />\r<br />- Ethereal Catastrophe (Destruction) : send a wave of self-destructing magicka to a large area, destroying all trace of organic magic in its wake. Let&#39;s see who can handle those melee weapons better.\t\r<br />\r<br />- Destruction Magnifier (and Amplifier) (Alteration) : some scholars views Alteration as Destruction&#39;s bigger brother. Under this spell&#39;s influence, your destruction attacks will deal additional damage. Costly and short, but potentially devastating.\r<br />\r<br />- Crippling Grip (Destruction) : In a rather paradoxal attempt at distancing yourself from a mortal foe, this spell allows you - through a firm grip - to discharge a powerful magic wave through your opponents body, crippling his leg and greatly slowing him down for some precious seconds.\t\r<br />\r<br />- Endurance (Restoration) : a precious little helper for all those *situations* were you feel a little…breathless. Know what I mean ? *nudge-nudge* You don&#39;t ? Well, then : your stamina regenerates for 2 points per seconds for five minutes.\t\r<br />\r<br />New Spells (02/17/2011)\r<br />\r<br />-Overheat (Destruction) : low cost, low damaging but very fast firing and traveling spell that chips away the target&#39;s fire resistance with each blow. Fire continuous streams of rapid-firing firebolts to weaken your enemy, and keep just the right amount of Magicka to inflict the finishing blow with your strongest fire spell. \r<br />\r<br />In numbers : each time you hit an opponent with this spell, he loses 2% (3 with corresponding perk) of fire resistance for 40 seconds.\r<br />\r<br />-Elemental Gambit (Alteration) : highly potent spell for the tactician which progressively lowers the target&#39;s resistance to all elements for half a minute.\r<br />\r<br />In numbers : when struck by this spell, the target&#39;s resistance (Fire, Shock, Frost) are lowered by 20%, then by another 20% every 6 seconds. The spell total duration is 30 seconds, wich means that all elemental damage done the target will be majored by :\r<br />20 % during the first six seconds\r<br />40 % betweent the 6th and 12th second\r<br />60 % between the 12th and 18th second\r<br />80 % between the 18th and 24th second\r<br />100% between the 24th and 30th second\r<br />0% after the 30th second. \r<br />\r<br />- Great Feather : Fiddling with gravity, this spell allows you to jump into the deepest ravines without fear of (too much) falling damages. On top of that, it lightens your burden and allow you to carry even more heavy loot &#33;\r<br />\r<br />- Reflecting Ward (Restoration) : As long as this ward is up, all melee damage done to you is also reflected to your aggressor. Try to synchronize your ward with the precise timing of your opponent’s attack to optimize your Magicka pool.\r<br />\r<br />- Conjure Murderous Spirit (Conjuration) : By sacrificing a good amount of your lifeforce, you are able to lure and trap a murderous and vengeful Daedra Spirit into your blade, allowing you to double the total amount of your backstab damage. Works well alone, but even better with Conjuration Dual Casting, And Illusion Quiet Casting.\r<br />\r<br />\r<br />I sincerely hope you will take as much pleasure playing and discovering this mod as I had designing it.\r<br />\r<br />If you like my work, please visit my New Vegas Mod, Tactical Crafting : http://newvegas.nexusmods.com/downloads/file.php?id=38533\r<br />\r<br />(Also, feel free to follow my cranky ramblings on video games on Twitter : http://twitter.com/baronvonchateau )",
  "categoryId": "93",
  "version": "1.20",
  "author": "BaronVonChateau",
  "createdUnix": "1328973806",
  "updatedUnix": "1331349292",
  "containsAdultContent": false,
  "uploadedBy": "BaronVonChateau",
  "primaryFile": null,
  "files": [
    {
      "fileId": "28964",
      "name": "Battlemages Arcane",
      "version": "1.00",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Battlemages Arcane-8916.rar",
      "uploadedUnix": "1328974591",
      "modVersion": "1.00",
      "virusScanUrl": "https://www.virustotal.com/file/d1ff4f25e56c4abbe3ff8d4b5006cde86f4b6b7c8f5721a52ed54e67752e90e5/analysis/1406669884/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battlemages%20Arcane-8916.rar?fid=28964&ttl=1535768049&ri=8192&rs=8192&setec=13500ea33a17b23e8813874feebf33a9"
    },
    {
      "fileId": "32534",
      "name": "Tactical Spellcasting - Battlemages Arcane",
      "version": "1.10",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "5",
      "fileName": "Tactical Spellcasting - Battlemages Arcane-8916.rar",
      "uploadedUnix": "1329477221",
      "modVersion": "1.10",
      "virusScanUrl": "https://www.virustotal.com/file/edb20c39a58b8ae07eab655488b1f7fa6ca436864debbbf7d1027c7ee7275beb/analysis/1406689566/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tactical%20Spellcasting%20-%20Battlemages%20Arcane-8916.rar?fid=32534&ttl=1535768050&ri=8192&rs=8192&setec=b8d201868278e5f1b748c81cc7084d2b"
    },
    {
      "fileId": "38542",
      "name": "Tactical Spellcasting - Battlemages Arcane 115",
      "version": "1.15",
      "categoryId": "4",
      "categoryName": "OLD_VERSION",
      "isPrimary": false,
      "size": "6",
      "fileName": "Tactical Spellcasting - Battlemages Arcane 115-8916.rar",
      "uploadedUnix": "1330545110",
      "modVersion": "1.15",
      "virusScanUrl": "https://www.virustotal.com/file/d95b97ad16b7008a1105f82d35891e8557032deee2252308363adfbaf4998854/analysis/1406721843/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Tactical%20Spellcasting%20-%20Battlemages%20Arcane%20115-8916.rar?fid=38542&ttl=1535768050&ri=8192&rs=8192&setec=47bbf3b045076c65a4f13c0b2f81f52a"
    },
    {
      "fileId": "41871",
      "name": "Battlemages Arcane Tactical Spellcasting 120",
      "version": "1.20",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7",
      "fileName": "Battlemages Arcane Tactical Spellcasting 120-8916-1-20.rar",
      "uploadedUnix": "1331349292",
      "modVersion": "1.20",
      "virusScanUrl": "https://www.virustotal.com/file/276a6c4e0a2ee3e01f92dde87111be3966b00b82fac53abb259072dd8c6f186f/analysis/1406741036/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Battlemages%20Arcane%20Tactical%20Spellcasting%20120-8916-1-20.rar?fid=41871&ttl=1535768051&ri=8192&rs=8192&setec=57607848272646c731f050c9d76dbbc5"
    }
  ]
}