{
  "modId": 89162.0,
  "modName": "Better Skyrim Overhaul",
  "summary": "Better Skyrim aims to provide a, lore-friendly overhaul to almost every aspect of Skyrim including spells, perks, races, racial abilities, the open world, transformations, armor, ect.  This is modular so you can pick and choose which part's of the overhaul you want. Parts of the mod will be uploaded as they are finished.",
  "descriptionHtml": "Each chapter of the mod overhauls a different part of Skyrim, allowing you to choose what you want in your game and whether it's set up to work with vanilla or other parts of this mod. Some chapters may be small, while others will be larger and more impactfull.\n<br />\n<br />   ﻿Chapters will be added as they are completed, please be patient as I have things in real life to deal with and I can't work all the time, there are several mods I would suggest you use along side this to make up for my lack of skill in certain areas, they will really enhance you experience and work well alongside this overhaul.\n<br />https://www.nexusmods.com/skyrim/mods/56147?tab=posts\n<br />https://www.nexusmods.com/skyrim/mods/74355?tab=posts\n<br />https://www.nexusmods.com/skyrim/mods/11163\n<br />https://www.nexusmods.com/skyrim/mods/64798   \n<br />\n<br />\n<br />Chapters:\n<br />[u]\n<br />Circlets with hats/helmets/hoods(1.0)[/u]________________________________________________________________\n<br />   ﻿Allows the player and NPCs to use circlets with their headgear, figured I'd make this separate from the armor part because some people might not wan't it. Some armor might have some slight clipping issues, but I looked through everything, it mostly looks fine. Closed face helmets cannot have circlets.\n<br />\n<br />[u]Armor[/u](Not ready yet)_________________________________________________________________________________\n<br />   ﻿The armor overhaul splits the main armor peace into three; curiass, greaves, and pauldrons. The armor rating will be split among the three as well. This allows for more variation and customization in what you wear. Copies of each armor with slightly altered stats will randomly appear adding more unpredictability to what you find, meaning you could find a more poorly crafted steel curiass that's weaker than a more well crafted Iron curiass, however, the rules will still generally apply, steel is better than iron, exceptions, like the example I gave, are rare.\n<br />\n<br />   ﻿Heavy and Light armor has been changed, in real life, historiclly, if armor was of proper quality, and fitted to you properly, it would barely hamper your agility or speed. Also, swords were piss poor at getting through armor, that's why maces exist, they crush armor, to reflect these facts, heavy armor has a higher resistance to swords, and only slows you down in harsh weather and in the water, however, it's damn near useless at stealth, light armor is no longer for combat, and some light armors have been changed to heavy, not because of their weight, but because they wouldn't make good armor for stealth. The armor, weight, and value has also been tweaked, heavy armor weighs a realistic amount and is more expensive, making it harder to get, but it's more protective in general.\n<br />\n<br />Heavy Armor:\n<br />40% resistant to swords\n<br />40% weakness to maces\n<br />Light Armor:\n<br />40% resistance to maces\n<br />40% weakness to swords\n<br />Axes act as an in-between as in vanilla.\n<br />\n<br />The Standalone version of this chapter has the armor stats balanced for Vanilla, the normal version is balanced for the overhaul and is meant to work with my new perk trees.\n<br />\n<br />If you really don't believe me on that armor thing, the first link is to proof, the other three are to educational Youtube channels on the subject.\n<br />https://www.youtube.com/watch?v=q-bnM5SuQkI\n<br />https://www.youtube.com/channel/UCIjGKyrdT4Gja0VLO40RlOw\n<br />https://www.youtube.com/user/shadmbrooks\n<br />https://www.youtube.com/user/SkallagrimNilsson\n<br />\n<br />   I'm not the best add modeling, but if I can, I would like to give minor cosmetic changes to the vanilla armors to make them look more realistic, and no that doesn't mean I'm removing the helmet horns, those are badass, I'm talking sleeves, pants, gambesons under curiasses, ect. Until I'm sure I can do this without making it look horrible, I'm not going to.\n<br />\n<br />\n<br />[u]Weapons(Not ready yet)[/u]_______________________________________________________________________________\n<br />   ﻿Weapons have been tweaked to be more dynamic. No weapon type is faster than another with the exception of daggers.\n<br />\n<br />Swords do additional damage to light armor, but less against heavy, blocking with a sword is more effective than with other weapons.\n<br />Axes do an even amount of damage to light and heavy, animals take 20% extra damage from axes.\n<br />Maces do additional damage to heavy armor, but less against light, constructs and skeletons take 20% extra damage from maces.\n<br />Daggers have a low reach and little damage, but are lightweight and do extra damage to enemies who are unaware, they are also faster than other weapons.\n<br />Bows haven't been changed much, they act as the fast ranged weapons, while crossbows are the slower, but more powerful weapons.\n<br />\n<br />For added realism try this mod out, it alters the mesh of bladed weapons to be thinner, realistically, it works with any re-textures you may have.\n<br />https://www.nexusmods.com/skyrim/mods/16072\n<br />\n<br />[u]Perks/Skills(Not ready yet)___________________________________________________________________________\n<br />[/u]   ﻿I can't go into detail on every perk change, removal, or addition, however I will go over the skills, and the changes I intend for their trees.[u]\n<br />\n<br />Warrior\n<br />[/u]Crafting\n<br />Heavy Armor\n<br />Blocking\n<br />Two-Handed\n<br />One-Handed\n<br />Marksman\n<br />[u]Mage\n<br />[/u]Illusion\n<br />Conjuration\n<br />Destruction\n<br />Restoration\n<br />Alteration\n<br />Enchanting\n<br />[u]Thief\n<br />[/u]Light Armor\n<br />Athletics\n<br />Lockpicking\n<br />Stealth\n<br />Speechcraft\n<br />Alchemy",
  "categoryId": "79",
  "version": "1.0",
  "author": "McDoobles",
  "createdUnix": "1516770162",
  "updatedUnix": "1517636673",
  "containsAdultContent": false,
  "uploadedBy": "McDoobles",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264653",
      "name": "Circlets With Headgear",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "5",
      "fileName": "Circlets With Headgear-89162-1-0.zip",
      "uploadedUnix": "1516773280",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/42c9f18f3d3b0b8c70d5a4a47058b00c24fb1fa6620856eefe22c4a2cf275315/analysis/1516773482/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Circlets%20With%20Headgear-89162-1-0.zip?fid=1000264653&ttl=1535878664&ri=8192&rs=8192&setec=32004053c56f336de8313c6a900c7b3a"
    },
    {
      "fileId": "1000265418",
      "name": "Khajiit Lore Races Standalone",
      "version": "1.0",
      "categoryId": "3",
      "categoryName": "OPTIONAL",
      "isPrimary": false,
      "size": "17",
      "fileName": "Khajiit Lore Races Standalone-89162-1-0.zip",
      "uploadedUnix": "1517636673",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/3db15a1cbd214dcf3260fdab61a4bfab97626215f80d79152726796c4ba0213c/analysis/1517637002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Khajiit%20Lore%20Races%20Standalone-89162-1-0.zip?fid=1000265418&ttl=1535878665&ri=8192&rs=8192&setec=06d1e897cde1cd52866776d2a1af903e"
    }
  ]
}