{
  "modId": 89210.0,
  "modName": "Khajiit Night Eye Detect Life - DELETED",
  "summary": "Just a small gameplay addition that adds Detect Life to Khajiit's power Night Eye, also increases duration from 60 seconds to 90 seconds.",
  "descriptionHtml": "[size=2][center][size=6]Khajiit Night eye enhancement[/size]\n<br />\n<br />[size=3]Recommended for those that use the mod [url=https://www.nexusmods.com/skyrimspecialedition/mods/694/] Darker Nights by unforbidable [/url] and play a Khajiit[/size]\n<br />\n<br />Basically a simple mod to add detect life to a Khajiit's power Night Eye.\n<br />[size=2]Also increases power duration from 60 seconds to 90 seconds.\n<br />Does not add detect undead, nor do I plan to unless it get really requested.\n<br />\n<br />FAQ time:\n<br />Q: This mod is to OP, I don't like it\n<br />A: First of all that's not a question, and If you think its too OP, don't download it or use it, simple as that.\n<br />\n<br />Q: This mod doesn't really work.\n<br />A: That's a possibility, I haven't fully tested it yet but so far its been working with no issues for me.\n<br />\n<br />Q: This mod broke Night Eye's ability to function, what do I do?\n<br />A: Uninstall the mod that conflicting with this one, or uninstall this one. This mod will not work with ones that affect Detect Life spell, or that changes Khajiit's racial power ability in any way, shape or form, simple as that there is nothing I can do about it.\n<br />\n<br />Q: I have this (insert issue here) with this, can you fix it?\n<br />A: If I see your comment in the comment section I will try my best to see that the issue gets resolved in a timely manner.\n<br />\n<br />Q: I demand that you add (insert feature here)\n<br />A: No, try asking nicely next time.\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[/size]\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />\n<br />[/center][/size]\n<br />[center][/center]",
  "categoryId": "24",
  "version": "1.0",
  "author": "ARandomElf",
  "createdUnix": "1517022033",
  "updatedUnix": "1517022033",
  "containsAdultContent": false,
  "uploadedBy": "ARandomElf",
  "primaryFile": null,
  "files": []
}