{
  "modId": 89225.0,
  "modName": "Low Hrothgar",
  "summary": "A reclusive reject Greybeard has taken over the Low Hrothgar castle on the southern slope of High Hrothgar, halfway up the 7,000 steps, near the frost troll and the fifth shrine.<br /><br />This small dungeon contains:<br />1. A new shout: Phantom Form<br />2. A playable set of enchanted Greybeard robes<br />3. An aggressive Greybeard and draugr to",
  "descriptionHtml": "A reclusive reject Greybeard has taken over the Low Hrothgar castle on the southern slope of High Hrothgar, halfway up the 7,000 steps, near the frost troll and the fifth shrine.\n<br />\n<br />This small dungeon contains:\n<br />1. A new shout: Phantom Form\n<br />2. A playable set of enchanted Greybeard robes\n<br />3. An aggressive Greybeard to fight\n<br />4. A bunch of draugr\n<br />5. Loot, hopefully it's worth it?\n<br />\n<br />The Phantom Form Shout (Fiik Lo Sah) is a modified version of the shout the greybeards use to create targets for you to Fus Ro Dah during the main quest. It was originally going to be implemented into the vinilla game, and even is fully voiced for all races. The shout summons a copy of yourself in greybeard robes, which is invulnerable to damage, has a random enchanted weapon, and knows several shouts and spells. Each rank increases the duration and powers of the phantom.\n<br />\n<br />All pieces of the Greybeard outfit are clothing, but do provide a small armor value. Boots, Robes, and Hood all decrease the shout timer by 20%. Paired with an amulet of Talos and the Blessing of Talos from a shrine, this can reduce the shout timer by 100%. The boots also boost Sneak by 20% and 10% to Stamina regen. The Robes increase Illusion by 20% and 10% to Magicka regen. The hood gives 20% bonuses to Speech and 10% to Health Regen. NOTE that the enchantment descriptions may not accurately describe these effects.\n<br />\n<br />Bugs:\n<br />For some users all three words of the new shout are not learned properly.  If this happens to you use to console command [font=Courier New]player.teachword xx002a93[/font].\n<br />Replace the xx in the command with the order of this mod in the load order.",
  "categoryId": "88",
  "version": "1",
  "author": "mattsour451",
  "createdUnix": "1517097450",
  "updatedUnix": "1517097450",
  "containsAdultContent": false,
  "uploadedBy": "mattsour451",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000264973",
      "name": "Low Hrothgar",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "431",
      "fileName": "Low Hrothgar-89225-1.7z",
      "uploadedUnix": "1517097372",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/f040d7049758cc1071f98fe3705755130a487e53bbe9cc58b5450989a069e4e6/analysis/1517097604/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Low%20Hrothgar-89225-1.7z?fid=1000264973&ttl=1535878774&ri=8192&rs=8192&setec=299c67b274d53f61227aaf4b9283c11d"
    }
  ]
}