{
  "modId": 89247.0,
  "modName": "Flower Girls - Scenes bucoliques en Bordeciel",
  "summary": "Fournit un contenu pour adultes à l'Enfant de dragon. Dans un monde en proie à la violence, Flower Girls veut partager l'amour. Il peut être considéré comme une solution tout-en-un pour ceux qui recherchent à la fois un divertissement léger et la possibilité de donner à leur personnage une vie amoureuse active plus immersive.",
  "descriptionHtml": "[center][size=6][color=#ffff00][b][u]\n<br />Flower Girls - Scènes bucoliques en Bordeciel[/u][/b]\n<br />[/color][size=4][color=#ffff00]Traduction en français de [/color][color=#ffff00][url=https://www.nexusmods.com/skyrim/mods/81241]Flower Girls[/url]﻿ de Xider ![/color]﻿﻿﻿[/size][/size]\n<br />\n<br />\n<br />[b][color=#ff0000][size=4]Avertissement : ceci est un mod pour adulte qui contient des scènes pornographiques ! Youpie ! :-)[/size][/color][/b][/center]\n<br />\n<br />[size=3][size=4][u][b]Description[/b][/u][/size]\n<br />\n<br />Ce mod fournit un contenu pour adultes à l'Enfant de dragon. Dans un monde en proie à la violence, Flower Girls veut partager l'amour. Il peut être considéré comme une solution tout-en-un pour ceux qui recherchent à la fois un divertissement léger et la possibilité de donner à leur personnage une vie amoureuse active plus immersive.\n<br />\n<br />[size=3][b]Version :[/b] 1.6.4 de la version originale. Le \"a\" est un ajout personnel si je dois effectuer des corrections sur cette même version.\n<br />Fonctionne sans SKSE[/size].\n<br />[u][b]\n<br />[size=4]Caractéristiques principales[/size]\n<br />[/b][/u]\n<br />- Mod super léger, pas de scripts en cours sauf pendant les animations.\n<br />- Voix personnalisées pour les types de voix les plus courants (englobant la plupart des PNJs féminins de base).\n<br />- Dialogues sur des thèmes adultes, avec humour.\n<br />- Grande variété d'animations par les talentueux Leito et M2M.\n<br />- Sort d'envoûtement pour permettre à la plupart des PNJs adultes de gagner un peu d'or.\n<br />- Sort de fornication pour vous sentir comme Cupidon.\n<br />- Encourage les compagnons à être plus démonstratifs dans leur affection. \n<br />- Transforme son partenaire en nymphomane insatiable.\n<br />- Ajoute 6 PNJs avec une IA personnalisée, 2 à Faillaises, 1 à Blancherive, 1 à Markarth, 1 à Solitude et 1 à Vendeaume.\n<br />- Les niveaux de désespoir des mendiants ont été augmentés.\n<br />- Le réconfort est maintenant animé.\n<br />[/size]\n<br />\n<br />[size=4][u][b]Prérequis, installation et compatibilités[/b][/u][/size]\n<br />[b]\n<br />[/b][size=3][b]Prérequis :[/b]\n<br />- FNIS  [color=#ff0000]Assurez-vous de lancer le logiciel FNIS après avoir installé Flower Girls.[/color]\n<br />[b]\n<br />Mods recommandés :[/b]\n<br />- Mod de corps féminins nus\n<br />- Mod de corps masculins nus\n<br />- [url=https://www.nexusmods.com/skyrim/mods/35303][size=3]Female Facial Animation[/size][/url] \n<br />\n<br />[b]Compatibilités :[/b]\n<br />- AP, SL &amp; Osex : peuvent coexister avec Flower Girls.\n<br />- Relationship Dialogue Overhaul (RDO) : FG modifient certaines lignes similaires, placez FG après RDO dans votre load order.\n<br />- Killable Children : moralement et légalement incompatible.\n<br />- Birds of Skyrim : incompatible en raison des exigences différentes de Papyrus. Résultats imprévisibles.\n<br />\n<br />[b]Installation :[/b]\n<br />1.Utilisez Mod Organizer et Loot !\n<br />2. Exécutez FNIS !\n<br />\n<br />Si vous installez Flower Girls sur une partie en cours, il faut parfois du temps pour que les options de dialogue apparaissent. Si au bout d'un moment elles ne sont toujours pas présentes, sauvegardez et rechargez. [/size]\n<br />[size=4]\n<br />[u][b]Description détaillée[/b][/u][/size]\n<br />\n<br />[size=3][b]Cinq nouveaux sorts :[/b]\n<br />- [color=#00ffff]Envoûtement [/color](sort d'illusion) : Tout PNJ adulte issu d'une race jouable se prostitue pendant 6 heures dans le jeu. Ils offrent leurs services contre quelques septims.\n<br />- [color=#00ffff]Fornication[/color] (sort d'illusion) : Deux PNJs sélectionnés apprendront à mieux se connaître. La scène se jouera à l'emplacement exacte du joueur.\n<br />- [color=#00ffff]Options [/color]: Personnalisation de Flower Girls. Une option permet de nettoyer les traces du mod dans votre sauvegarde si vous voulez le désinstaller proprement.\n<br />\n<br />[b]Notes sur les compagnons et le conjoint :[/b]\n<br />Flower Girls ajoute une option de dialogue à tout compagnon ainsi qu'à votre conjoint, indépendamment des lignes de dialogues des mods eux-mêmes. \n<br />Cependant, l'ordre de chargement peut affecter l'apparition de cette option, vous devrez peut-être régler manuellement votre ordre de chargement pour régler cela.\n<br />\n<br />Inutile de préciser que les compagnons et votre conjoint ne vous feront pas payer pour passer du bon temps. \n<br />\n<br />[b]Notes sur les animations :[/b]\n<br />- Le mod gère au mieux la mise à l'échelle des acteurs, mais celle-ci est influencée par de nombreux facteurs.\n<br />- Les animations ont été conçues pour des relations basiquement hétérosexuelles. Elles devraient fonctionner pour des relations homo malgré quelques problèmes d’alignement.\n<br />- Positionnement : les scènes commencent à la position exacte du joueur. Pour obtenir les meilleurs résultats possibles, ne commencez pas une scène à mi-hauteur \n<br />des escaliers, dans des couloirs étroits ou juste à côté des meubles. La séparation des acteurs peut se produire en raison de la collision avec ces objets. Essayez de vous positionner dans une zone avec une quantité décente d'espace libre.\n<br />\n<br />[b]Notes sur la performance :[/b]\n<br />Blabla technique... Par conséquent, l'exécution permanente de Flower Girls pendant les sessions de jeu aura un impact négligeable sur votre sauvegarde et votre utilisation de la mémoire. Si vous rencontrez des ralentissements ou des problèmes de performances, je peux vous assurer que ce n'est pas Flower Girls qui le provoque. \n<br />\n<br />[b]Notes sur le rhabillage :[/b]\n<br />Sans SKSE64, il est difficile de mettre en place un système sophistiqué de rhabillage pour le personnage du joueur. À l'heure actuelle, Flower Girls utilise une méthode inspirée du travail de Chesko sur Campfire. Il fonctionnera avec les armure ou les vêtements par défaut et avec des personnalisés, mais pas avec tous. Amélioration en \n<br />cours.[/size][size=3]\n<br />[/size][size=3]\n<br />[b]Note sur la traduction :[/b]\n<br />Si vous trouvez encore des fautes ou des maladresses, merci de les signaler, si possible avec une capture d'écran. \n<br />J'ai essayé de faire en sorte que le texte convienne que vous jouiez un personnage mâle ou femelle, que vous soyez vous-même mâle ou femelle, s'il y a des erreurs, merci de les signaler également.[/size][size=3]\n<br />\n<br />\n<br />[size=3][b][color=#ffff00][size=6][center][/center][/size][/color][/b][/size][/size][center][size=3][b][color=#ffff00][size=6]Pour d'autres mods en français avec des traductions de qualité : [/size][/color][/b][size=4][u][b]\n<br />[/b][/u][/size][/size]\n<br />\n<br />[url=http://www.confrerie-des-traducteurs.fr/skyrim][img]http://www.confrerie-des-traducteurs.fr/forum/styles/conf/theme/images/logo2.png[/img][/url]\n<br />\n<br />[size=3][b][color=#ffff00][size=6]\n<br />N'hésitez pas à consulter notre guide pour SSE :\n<br />\n<br />[url=https://www.confrerie-des-traducteurs.fr/forum/viewtopic.php?f=349&amp;t=26126][img]https://www.confrerie-des-traducteurs.fr/forum/upload/Yoplala/Yoplala_1518922767_Guide_Logo.png[/img][/url][/size][/color][/b][/size][/center][url=http://www.confrerie-des-traducteurs.fr/skyrim][center][/center][/url]",
  "categoryId": "51",
  "version": "1.6.4a",
  "author": "Xider",
  "createdUnix": "1517228002",
  "updatedUnix": "1517228002",
  "containsAdultContent": true,
  "uploadedBy": "Yoplala2",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265096",
      "name": "Flower Girls - Scenes bucoliques en Bordeciel",
      "version": "1.6.4a",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "32513",
      "fileName": "Flower Girls - Scenes bucoliques en Bordeciel-89247-1-6-4a.zip",
      "uploadedUnix": "1517227942",
      "modVersion": "1.6.4a",
      "virusScanUrl": "https://www.virustotal.com/file/e0f76fc8ff8cf93d483b93154c1785a6150f70c28151c42cc59c1566101f863f/analysis/1517228226/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Flower%20Girls%20-%20Scenes%20bucoliques%20en%20Bordeciel-89247-1-6-4a.zip?fid=1000265096&ttl=1535878797&ri=8192&rs=8192&setec=47818de4b7b4a4ba058103dc123ffacd"
    }
  ]
}