{
  "modId": 89256.0,
  "modName": "Cobb Encumbrance - in Russian",
  "summary": "Модификация, позволяющая вашим главгероям ощутить весь вес содержимого их инвентаря, или его отсутствие.",
  "descriptionHtml": "[size=3][color=#fce5cd]Модификация, позволяющая вашим главгероям ощутить весь вес содержимого их инвентаря, или его отсутствие.\n<br />Этот мод изменяет скорость передвижения и применяет бонусы или штрафы на основе того, насколько тяжела ноша за плечами героя или героини.\n<br />[/color]\n<br />От автора:\n<br />[i]«Я был пользователем Skyrim Encumbrance Mod — отличного мода, который реализует действительно классную идею. К сожалению, этот мод не обновлялся очень давно, и имел проблемы, которые могли привести к перегрузке скриптового движка Скайрима (вызвать „дамп стеков“), когда вы подбирали или теряли большое количество предметов за короткий промежуток времени. После полного изучения этого вопроса стало очевидно, что решение имеющихся проблем потребует разработки нового мода с нуля.[/i]\n<br />[i]Соответственно, Cobb Encumbrance строился с нуля со стабильностью в качестве приоритета номер один. Я подверг мой код широкому спектру стресс-тестов, и он успешно их выдержал, когда многие другие моды на нагрузку — нет. Я могу переместиться в тестовую локацию „QASmoke“, пройтись по нескольким контейнерам, и добавить сотни видов предметов в инвентарь за считанные секунды. Этого достаточно, чтобы другие моды вызвали дамп стеков, но с данным модом такого не случится. Я также протестировал его с „Дипломатической неприкосновенностью“ — одним из основных квестов игры, в ходе которого изымается весь инвентарь игрока сразу (потенциально — сотня и более предметов); мой мод благополучно функционировал.»[/i]\n<br />\n<br />\n<br />[color=#fce5cd]Особенности:\n<br />[/color]Cobb Encumbrance полностью настраивается через МКМ:\n<br />— пороги переносимого веса - стадии загруженности, при которых на героя будут накладываться положительные или отрицательные эффекты;\n<br />— бонусы и штрафы, применяемые в зависимости от загруженности героя;\n<br />— также вы можете включить/отключить переломную стадию загруженности, добавляющую элемент опасности быть попросту раздавленным своей ношей при попытке унести вдвое больше возможного;\n<br />— «атмосферные сообщения» — если активны уведомления, то вместо технического уведомления об изменениях скорости передвижения и заполненности инвентаря, будут выводиться сообщения от лица вашего персонажа.\n<br />\n<br />\n<br />[color=#fce5cd]Стадии загруженности:\n<br />[/color]Всего имеется 10 стадий загруженности: от почти полного отсутствия вещей в инвентаре до смертельно опасной нагрузки, которая по умолчанию отключена.\n<br />Первые две стадии являются положительными, и при них могут быть либо нулевые (нет бонусов к скорости, запасу сил и его восстановлению), либо положительные эффекты (есть бонусы) (по умолчанию - к скорости передвижения).\n<br />Все последующие стадии являются отрицательными и применяют нарастающие с каждой стадией эффекты истощения запаса сил (по умолчанию - нет), штрафы к скорости и/или запасу сил и/или восстановлению запаса сил (по умолчанию только к скорости).\n<br />Последняя стадия - критическая, её порог по умолчанию - 200% от максимального переносимого веса, и она отличается от всех предыдущих добавлением эффекта истощения здоровья.\n<br />\n<br />В МКМ вы можете разрешить или запретить использование любых стадий загруженности, кроме первой (основной), а также для каждой отдельно установить:\n<br />- процент веса - порог заполненности инвентаря, по достижении которого стадия становится текущей;\n<br />- модификатор скорости - тоже процентное значение, на которое будет изменяться скорость передвижения, положительное или отрицательное значение в зависимости от конкретной стадии;\n<br />- модификатор запаса сил - то, насколько изменится ваш запас сил на определённой стадии, также положительное или отрицательное значение;\n<br />- скорость истощения запаса сил - может быть задана только на отрицательных стадиях загруженности, измеряется в единицах в секунду;\n<br />- скорость истощения здоровья - задаётся только для переломной стадии, измеряется также в единицах в секунду, перетаскивание огромных масс положительно на здоровье сказываться не может.\n<br />\n<br />\n<br />[color=#fce5cd]Пресеты:\n<br />[/color]Если у вас установлен [url=https://www.nexusmods.com/skyrim/mods/48265/]FISS[/url], вы можете сохранить свой сет настроек, чтобы при начале новой игры или переустановке мода не пришлось настраивать всё заново.\n<br />Мод предлагает несколько встроенных пресетов, среди которых и имитирующий установки Skyrim Encumbrance Mod.\n<br />\n<br />\n<br />[color=#fce5cd]Требования:\n<br />[/color]- [url=http://skse.silverlock.org/]SKSE[/url];\n<br />- [url=https://www.nexusmods.com/skyrim/mods/3863]SkyUI[/url].\n<br />\n<br />[color=#fce5cd]Установка:\n<br />[/color]Файлы из папки Data архива поместить в папку Data игры, подключить плагин; или использовать MO.[/size]",
  "categoryId": "24",
  "version": "1.6",
  "author": "DavidJCobb",
  "createdUnix": "1517272023",
  "updatedUnix": "1517272023",
  "containsAdultContent": false,
  "uploadedBy": "Vitalyudin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265115",
      "name": "Cobb Encumbrance",
      "version": "1.6",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "23",
      "fileName": "Cobb Encumbrance-89256-1-6.7z",
      "uploadedUnix": "1517271972",
      "modVersion": "1.6",
      "virusScanUrl": "https://www.virustotal.com/file/270f6a9ce60981470262c52a063d772d31c6f197ca70af0c23e91a07dd4c1f76/analysis/1517272322/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Cobb%20Encumbrance-89256-1-6.7z?fid=1000265115&ttl=1535878807&ri=8192&rs=8192&setec=518daaa1790bef398746d1645ba52cd6"
    }
  ]
}