{
  "modId": 89254.0,
  "modName": "Dwarven Automatons Weapons - in Russian",
  "summary": "Мод пополняет перечень двемерского снаряжения в игре восемнадцатью новыми орудиями, двумя типами боеприпасов, одним элементом брони и щитом.",
  "descriptionHtml": "[size=3][font=Arial]Мод пополняет перечень двемерского снаряжения в игре восемнадцатью новыми орудиями, двумя типами боеприпасов, одним элементом брони и щитом. Всё новое вооружение состоит в основном из древних двемерских приспособлений и частей двемерских автоматонов.[/font]\n<br />[font=Arial]Теперь вы сможете бить врага его же оружием в самом что ни на есть прямом смысле этих слов![/font]\n<br />\n<br />[font=Arial]Большинство новых предметов для создания требуют прочтения специального учебника, который можно приобрести у Колсельмо в Подкаменной крепости Маркарта, но абсолютно все предметы требуют навыка ковки двемерского металла.[/font]\n<br />\n<br />[u]Орудия, добавляемые модом:\n<br />[/u][b]Инструменты[/b][font=Arial]:[/font]\n<br />[font=Arial]Демонтирующий молот - одноручный и двуручный варианты[/font]\n<br />[i]Двемеры использовали эти инструменты в процессе создания своих автоматонов. Или в процессе утилизации.[/i]\n<br />[font=Arial]- Игнорируют соответственно 25% и 35% рейтинга брони автоманонов;[/font]\n<br />[font=Arial]- Имеют базовый шанс критического удара в 35% в битве против автоманонов;[/font]\n<br />[font=Arial]- Наносят соответственно по 6 и 8 ед. затяжного электрического урона в течение 5 секунд при критическом ударе;[/font]\n<br />[font=Arial]- При критическом ударе на 10 секунд замедляют автоматонов на 10% и снижают рейтинг их брони на 100 ед.[/font]\n<br />\n<br />[font=Arial]Аварийный ключ[/font]\n<br />[i]На случай, если что-то пошло не так. Один хороший и точный удар может вывести из строя механического слугу.[/i]\n<br />[font=Arial]- 30-кратный множитель урона из скрытности при ударе по автоматонам;[/font]\n<br />[font=Arial]- 75% игнорирование рейтинга брони автоматона, если вам удалось подкрасться незамеченным;[/font]\n<br />[font=Arial]- Базовый шанс критического удара в 40% против автоманонов;[/font]\n<br />[font=Arial]- При критическом ударе на 10 секунд замедляют автоматонов на 15% и снижают рейтинг их брони на 150 ед.[/font]\n<br />\n<br />[font=Arial]Проводниковые стрелы и болты[/font]\n<br />[font=Arial]Эти снаряды взрываются большим и сильным электрическим разрядом, который наносит повышенный урон автоматонам.[/font]\n<br />[font=Arial]- 20 ед. электрического урона любому в радиусе взрыва;[/font]\n<br />[font=Arial]- Затяжной электрический урон автоматонам, попавшим под разряд, по 5 ед. в секунду в течение 10 секунд;[/font]\n<br />[font=Arial]- Автоматоны, попавшие под разряд, замедляются на 20% и теряют 200 ед. рейтинга брони на 10 секунд.[/font]\n<br />\n<br />[b]Оружие из частей автоматонов[/b]\n<br />[font=Arial]Оружие, сделанное из частей двемерских сфер или конечностей центурионов, может быть пристыковано к специальным двемерским силовым перчаткам. Это оружие имеет базовый 25% шанс критического удара и применяет специальные эффекты при критах, наносит 25% дополнительного урона при силовых атаках, но и стоят такие силовые атаки на 50% больших усилий. Оружие центурионов также может использоваться в качестве двуручного оружия (тип хвата может быть изменён в любой кузнице) и не требует двемерских силовых перчаток для корректного использования.[/font]\n<br />\n<br />[font=Arial]Меч двемерской сферы[/font]\n<br />[font=Arial]- При критических ударах вызывает у живых существ 5-секундное кровотечение, наносящее по 10 ед. урона в секунду.[/font]\n<br />\n<br />[font=Arial]Топор и молот центуриона[/font]\n<br />[font=Arial]- При критических ударах вызывают ожог паром - 10 ед./с на 10 секунд.[/font]\n<br />\n<br />[font=Arial]Топор и молот Мастера-Кузнеца[/font]\n<br />[font=Arial]- При критических ударах наносят урон огнём силой 15 единиц/с на 10 секунд.[/font]\n<br />\n<br />[font=Arial]Лук и арбалет двемерской баллисты[/font]\n<br />[font=Arial]После победы над двемерской баллистой вы можете обнаружить в груде обломков её главную смертоносную часть - арбалет, который может быть использован для создания лука двемерской баллисты или большого двемерского арбалета. Это оружие тяжелее прочего оружия тех же категорий, и стрельба из них выходит медленнее, но в то же время наносят больше урона и игнорируют 50% (лук) и 75% (арбалет) рейтинга брони цели. Также эти орудия имеют базовый шанс критического урона по 30 и 50% соответственно и могут лишить цели равновесия при критическом ударе.[/font]\n<br />\n<br />[font=Arial]Щит из двемерской сферы[/font]\n<br />[font=Arial]Из поверженных двемерских сфер вы можете выдрать пластины, из которых может получиться легковесный тяжёлый щит. Также этим щитом может быть снабжён любой двемерский арбалет. При ударе плашмя таким щитом (даже если он на арбалете) есть шанс нанести 30 ед. урона электричеством.[/font]\n<br />\n<br />\n<br />[font=Arial]Кроме добавления перечисленных предметов, мод усиливает двемерских механизмов (включая Мастера-Кузнеца) - они наносят больше урона, имеют более высокий рейтинг брони и менее уязвимы для атак недробящим оружием. Их сопротивляемости также повышены, но они всё равно восприимчивы к урону электричеством.[/font]\n<br />[font=Arial]Этот мод предлагает оружие, с помощью которого будет легче справиться с усиленными автоматонами, и хотя его использование не является обязательным, ожидайте более сильного сопротивления, когда наведаетесь в двемерские руины.[/font]\n<br />\n<br />[font=Arial]Мод несовместим с любыми другими модами, изменяющими записи рас двемерских механизмов. Решается порядком загрузки в пользу последнего грузящегося мода.[/font]\n<br />\n<br />[/size]\n<br />[font=Georgia][color=#fff2cc][size=4]Требования:\n<br />[/size][/color][/font][size=3][font=Arial]Skyrim, DLC Dawnguard и Dragonborn.[/font]\n<br />[font=Arial]Для пользователей ASIS в мод включен ini-файл NPCEnchantFix.[/font]\n<br />[/size]\n<br />[font=Georgia][color=#fff2cc][size=4]Установка:\n<br />[/size][/color][/font][size=3][font=Arial]Воспользуйтесь мод-менеджером или вручную поместите содержимое папки Data архива в одноимённую папку игры.[/font]\n<br />\n<br />\n<br />[color=#fff2cc][font=Arial][u]Рекомендации:[/u] [/font][url=https://www.nexusmods.com/skyrim/mods/18436/]ASIS[/url][font=Arial].[/font]\n<br />[/color][/size]",
  "categoryId": "55",
  "version": "2.2",
  "author": "Alex9ndre",
  "createdUnix": "1517270517",
  "updatedUnix": "1517270517",
  "containsAdultContent": false,
  "uploadedBy": "Vitalyudin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265114",
      "name": "Dwarven Automatons Weapons",
      "version": "2.2",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "7989",
      "fileName": "Dwarven Automatons Weapons-89254-2-2.7z",
      "uploadedUnix": "1517270479",
      "modVersion": "2.2",
      "virusScanUrl": "https://www.virustotal.com/file/184a4f41b5f0ba1f2e76b60ea49901a4105c37a4f8ab706e3831c2534a38e26a/analysis/1517270670/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Dwarven%20Automatons%20Weapons-89254-2-2.7z?fid=1000265114&ttl=1535878804&ri=8192&rs=8192&setec=f3980e81cfd1dc95f344061e1ed712aa"
    }
  ]
}