{
  "modId": 89283.0,
  "modName": "Hardcore Vampiris Sanguinare - Struggle to Survive",
  "summary": "Ever find it too easy to become a Vampire? Very simple mod that adds a poison damage (6, 8, 10, 20) per second and 30% slow during the 3 days before transformation. Choose the damage you desire and only install one.",
  "descriptionHtml": "Becoming a vampire in Skyrim is way too easy! With mods that overhaul vampires like BV/Sacro/Thirst etc. It is pretty shocking how easily you can unlock these powers on a new character. What I have done is introduced 2 negative effects to the Vampiris Sanguinaire disease. Movement speed will be slowed by 30%, and you will take damage per second, few different options for damage to suit your difficulty/desire in the file, only install one. Now you will struggle to survive the 3 day journey to becoming a Vampire. Recommend a whole lot of healing potions and anything that can help you stave off the damage, it's gonna be a rough few nights, and if you fast travel, you probably won't make it to destination unless you are high level and fairly strong.\n<br />\n<br />To install just slap ONE of these into data folder. Requires Dawnguard (Because of the trap effect).\n<br />\n<br />Hardcore Vampiris - Easy.esp - 6 damage per second + 30% slow\n<br />Hardcore Vampiris - Normal.esp - 8 damage per second + 30% slow\n<br />Hardcore Vampiris - Hard.esp - 12 damage per second + 30% slow\n<br />Hardcore Vampiris - Insane.esp - 20 damage per second + 30%slow (Only for OP characters, this will kick your butt!)\n<br />\n<br />\n<br />Compatability\n<br />\n<br />Works with anything that does not alter the Vampiris Sanguinaire disease effects. Better Vampires is compatible, as I actually use it. Should be compatible with the others too. Just adds 2 effects to Vampiris Sanguinaire and does not at all interfere with the actual transformation/quest or Vampirism itself.\n<br />\n<br />Uninstall\n<br />\n<br />Just remove the esp, no scripts or anything fancy, very easy to remove if you dislike it.",
  "categoryId": "78",
  "version": "1",
  "author": "TheDoomspell",
  "createdUnix": "1517375162",
  "updatedUnix": "1517375162",
  "containsAdultContent": false,
  "uploadedBy": "ManslayerJ",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265193",
      "name": "Hardcore Vampiris",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "1",
      "fileName": "Hardcore Vampiris-89283-1.rar",
      "uploadedUnix": "1517375136",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/d73f2f683460b1548cbfeab63f55414d2a8c77ac89102e269a19c08c18ade1f4/analysis/1517375342/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Hardcore%20Vampiris-89283-1.rar?fid=1000265193&ttl=1535878844&ri=8192&rs=8192&setec=33123f9a5623dcc2771a978859e5d1b9"
    }
  ]
}