{
  "modId": 89289.0,
  "modName": "Magicka Regen Improvement",
  "summary": "Improves magicka regen obtained from disenchanting robes.",
  "descriptionHtml": "Were you ever disappointed that the magicka regen enchantments you obtained from robes, was stuck at a measly 10%, no matter how strong your enchanting skill is? Well this mod might be for you then as it takes that 10% and ups it to 50%. Meaning with no skill in enchanting, no perks and just a petty gem. Your nnew robes can have 1% decrease in costs of the magic school of choice, and 50% regen. With 100 enchanting, all perks and a grand soul it would be 25% cost reduction and 50% magicka regen. Use of extra effect would add the 50% twice bringing regen on par with adept robes, instead of stuck at 20%. If you have other mods that allow you to add even more enchantments per armor piece  3 or more. It can go from 50% to 250% total with all 5 of the schools. \n<br />\n<br />I didn't know how to make it actually scale with enchanting level and perks so I opted to just change the base value used. I have a mod for an extra effect second perk to add 3  enchantments per item. So that seemed a good balance for me. Less schools affected than the archmage robes, but the regen would still be on par with it at 150%.\n<br />\n<br />Let me know of any bugs encountered for this and I might rebalance based on suggestions, as alternate files",
  "categoryId": "75",
  "version": "1.0",
  "author": "Stalfos81",
  "createdUnix": "1517412161",
  "updatedUnix": "1517412161",
  "containsAdultContent": false,
  "uploadedBy": "Stalfos81",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265212",
      "name": "Magicka Regen Improved",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "0",
      "fileName": "Magicka Regen Improved-89289-1-0.7z",
      "uploadedUnix": "1517411696",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/91f5000f0ea7762d5cd30d7ee9051dd259a88b677415d33ab1a83105e8163d08/analysis/1517412002/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Magicka%20Regen%20Improved-89289-1-0.7z?fid=1000265212&ttl=1535878853&ri=8192&rs=8192&setec=1748d063d641a9c6a0a4280cc9d04c4d"
    }
  ]
}