{
  "modId": 89306.0,
  "modName": "Skyrim More immersive encounters",
  "summary": "This mod changes certain types of dungeons such as draugr dungeons, basic wildlife caves, dwemer/falmer, vampire dungeons, bandit hideouts to a more befitting starting level.",
  "descriptionHtml": "[i]Another encounter zones mod? Well sry i didnt find one to my liking.[/i]\n<br />\n<br />\n<br />[size=4][b]REQUIREMENTS:\n<br />[/b]Dawnguard and Dragonborn\n<br />[/size]\n<br />[size=2]Thats pretty much it but the mod is designed to be played with other mods which add new enemies and overhaul perk trees and make your character stronger than in vanilla\n<br />Neither of them is necessary but you might have really hard time if you play vanilla Skyrim on Legendary. Also you might have some issues if you use mods which make you\n<br />[/size]progress really slowly.\n<br />\n<br />\n<br />[b][size=4]Whats an Encounter Zone:[/size][/b]\n<br />\n<br />Skyrim's dungeons are basically split in different encounter zones. For example a zone starting at lvl 20 will threat you as lvl 20 even if you are lvl 1. Sounds good right? Well except that all the vanilla zones start at lvl 2-6 except for a few such as dragon priest dungeons starting at 15-20. That means that even if you are lvl 1 and no matter where you go enemies will be on your level. Going into a cave/fort infested with immortal vampires at lvl 1? Well it doesnt matter cuz it will just so happen that all of the vampires there are Fleglings and you will melt them all with a simple Flames spell. On the other hand almost none of the zones have a set MAX Level which means enemies will scale really high. That makes no sense for an RPG game.\n<br />[size=3]\n<br />[b][u]Does it make the game more difficult? Yeah certainly it does but thats not the main point of the mod.[/u][/b][/size]\n<br />\n<br />\n<br />\n<br />[i][size=4]How it works now:[/size][/i]\n<br />\n<br />[u][b][size=3]Bandit Caves/Hideouts[/size][/b][/u] - 8 - 35  ([color=#00ff00]min[/color][color=#ff0000]/max[/color][color=#f4f4f4] level)[/color]\n<br />Bandits are now the enemies for beginners. [color=#ffff00]Mostly ranging from level 10 to 25[/color]. Still they wont start really weak\n<br /> and you will need some preparations.Still there are a few exceptions. Bandit places near the snowy regions of Skyrim \n<br />will be a bit higher (15-35). Also bigger hideouts such as Pinewatch will be much higher(20-38 for example). You should \n<br />be able to guess the dungeon level by how big it is. For example a small cave around riverwood will be much lower\n<br /> than a huge fort at the snowy regions of Skyrim.\n<br />\n<br />[b][u][size=3]Draugr Dungeons[/size][/u][/b] - 25 - 100 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color][color=#f4f4f4] level)[/color]\n<br />WTF? Well 100 is obviously the max level of high end places such as Skuldafn/ Dragon Priest places. The point is that\n<br />Draugr Crypths will no longer be beginner dungeons. Bleak Falls Barrow will be hard for a new character.\n<br />That means that you will need to grind a few levels until you can actually clear a huge dungeon and then\n<br />slay a Dragon.[color=#ffff00] Smaller Draugr Dungeons will be at level 25-45[/color] and legendary places like [color=#ffff00]Labyrinthian/Dragon\n<br />Priest Dungeons/Skuldafn will be around level 45 - 100[/color].\n<br />\n<br />[b][u][size=3]Vampire Places[/size][/u][/b] - 32 - 50 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color][color=#f4f4f4] level)[/color]\n<br />Sorry but Vampires are stronger than bandits. You will get owned if you try to do a bandit infested fort at lvl 5.\n<br />That also means that places such as Dymhollow Crypt will be for higher level. [color=#ffff00]Most vampire dungeons range\n<br />from lvl 32 to 45[/color] but there are a few exceptions for dungeons which I think are supposed to be harder . Also\n<br />if you notice the gap between min and max is much smaller in comparison to to the draugr dungeons. Well it\n<br />makes sense that a vampire is stronger than a normal draugr but is no match for a legendary nordic hero.\n<br />Also there arent any high end vampire dungeons like there are draugr dungeons.\n<br />\n<br />[u][size=3][b]Wildlife caves[/b][/size][/u] - 15 - 28 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />Bear caves, spider infested caves, troll places, spriggan territories etc. They will be a bit harder than a basic\n<br />bandit cave but a bit easier than a huge bandit fortress. The areas around the south are obviously easier\n<br />than the caves at north infested with frost trolls and snow bears.\n<br />\n<br />[b][u][size=3]Necromancer/Mage caves and forts[/size][/u][/b] - 25 -45 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />They are placed a little bit below Vampires.\n<br />\n<br />[b][u][size=3]Forsworn[/size][/u][/b] - 20 - 45 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />I've decided that they are a bit stronger than casual bandits. I mean, they have hagravens and use magic. What do you\n<br />expect? There aren't really many forsworn places in Skyrim tho. Only 3 of them are placed really high. The huge\n<br />forsworn hold where you get the ancient dark brotherhood gear, rebel's cairn where the legendary Red Eagle rests and\n<br />Karthspire - the place right infront of Sky Haven Temple. They will start from level 30 - 35 if i remember correctly.\n<br />\n<br />[size=3][b][u]Dwemer and Falmer Dungeons[/u][/b] [/size]- 40 - 70 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />Thoose 2 will now be REALLY hard depending on what other mods you have. Two ancient powerful races and their\n<br />creations. Casual reminder that falmer also have really strong poison(or atleast with the mods I use).\n<br />\n<br />[b][u][size=3]Giant camps[/size][/u][/b] - 40 - 60 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />There aren't really many types of giants in the vanilla game so you probably need Skyrim Immersive Creatures to\n<br />see any difference.\n<br />\n<br />\n<br />\n<br />[font=Verdana][color=#ff0000][size=4]SOLSTHEIM IS REALLY HARD NOW[/size][/color][/font][font=Verdana] - [/font][font=Arial][color=#f4f4f4]35 - 100([/color][color=#00ff00]min[/color][color=#f4f4f4]/[/color][color=#ff0000]max[/color][color=#f4f4f4] level of the dungeons)[/color][/font]\n<br />\n<br />[size=3]This is more for the RPG aspect than for immersion but the new land will be for high end users. The easiest of all places\n<br />here now start from lvl 35 with most of them starting at 45-50.[/size]\n<br />\n<br />[b][u][size=3]Draugr Dungeons in Solstheim[/size][/u][/b] - 45 - 100 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />Especially dungeons with Dragon Priests or Miraak's temple are really hard starting from lvl 60.\n<br />\n<br />[b][u][size=3]Dwemer Dungeons in Solstheim[/size] [/u][/b]- 50 - 75 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />A bit higher than thoose in Skyrim.\n<br />\n<br />[b][u][size=3]Black Books[/size][/u][/b] - 60 - 90 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />It's the realm of forbidden knowledge you know.\n<br />Same with the giant camps tho. You probably wont notice any difference unless you have mods which add new types\n<br />of enemies there.\n<br />\n<br />[b][u][size=3]Riekling Places[/size][/u][/b] - 35 - 50 (min[color=#f4f4f4]/[/color][color=#ff0000]max [/color]level)\n<br />The weakest enemy on Soltheim pretty much.\n<br />\n<br />[b][u][size=3]Solstheim Bandits/Reavers + Ash Spawn places[/size][/u][/b] - 40 - 60 ([color=#00ff00]min[/color]/[color=#ff0000]max[/color] level)\n<br />They are the basic enemies of Solstheim and are a bit harder than Rieklings.\n<br />\n<br />\n<br />[color=#ff7700]The 3 legendary places of Skyrim - Blackreach, Forgotten Vale, Soul Cairn are MEGA HARD now (level 50+)\n<br />[/color][size=3]Especially if you have mods which add a ton of falmer + new enemies in the soul cairn like Revenge of the Enemies\n<br />thoose places will be much different now.[/size]\n<br />\n<br />\n<br />\n<br />\n<br />[b][color=#00ffff][size=4]IMPORTANT!!!\n<br />[/size][/color][/b]\n<br />[size=3]Another thing this mod changes is enemy difficulty. There are 4 settings which define an enemy's power: Easy, Medium, Hard, Very Hard.\n<br />Very Hard are probably Bandit Chiefs and Draugr bosses.\n<br />\n<br />They are now changed like this:\n<br />Easy: 0.33 --&gt; 0.8\n<br />Medium: 0.67 --&gt; 1\n<br />Hard: 1 --&gt; 1.4\n<br />Very Hard: 1.2 --&gt; 1.9\n<br />\n<br />That means that enemies will be a lot stronger...\n<br />\n<br />[b][u][color=#00ffff]Final notes:[/color][/u][/b]\n<br />Although thoose Encounter Zones are much higher than vanilla I still tried to keep the dungeons you do at the beginning of guilds and questlines to be a bit lower. Dungeons like Saarthal, Dymhollow Crypt, Bleak Falls Barrow etc shouldn't be really high. Also as I said earlier [color=#ffff00]the mod is intented to be played with\n<br />other mods such as perk overhauls, new weapons etc[/color] which make your character's lategame stronger than in vanilla.\n<br />\n<br />The main intent is to provide players with *ahem*. It's to make certain enemies and dungeons be really hard for beginner characters(cuz vanilla\n<br />will just delevel them to your level) but also to make them scale high as well so they arent completely static and will still prove a bit of challenge at higher\n<br />levels. The bandit camp at lvl 10 will be quite tough for a lvl 1 character but wont be a complete joke for a lvl 30. Maybe for lvl 50.\n<br />\n<br />[/size]\n<br />[size=4][b]COMPATIBILITY:\n<br />[/b][/size][size=3]Well anything which edits encounter zones and fLeveledActorMult (easy, medium, hard, very hard enemies) will be incompatible.\n<br />That means whichever mod loads second will overwrite all the values of the previous mod on the load order.\n<br />\n<br />Perk Overhauls - [color=#00ff00]compatible[/color] with the exception of Requiem probably. Having a perk overhaul is highly recommended. \n<br />New enemies mods (RotE, SIC) - [color=#00ff00]compatible[/color] and recommended aswell.\n<br />\n<br />\n<br />Future plans:\n<br />- Adding new static level enemies to all dungeons which befit the level range I've set in this mod.\n<br />- Add a new version of this mod which shortens the gap between min/max level of dungeons making\n<br />them really static.\n<br />\n<br />\n<br />[/size]",
  "categoryId": "78",
  "version": "1",
  "author": "Hadjidinev",
  "createdUnix": "1517486184",
  "updatedUnix": "1517486184",
  "containsAdultContent": false,
  "uploadedBy": "Hasanch0o",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265251",
      "name": "Skyrim More Immersive Zones",
      "version": "1",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "6",
      "fileName": "Skyrim More Immersive Zones-89306-1.7z",
      "uploadedUnix": "1517485286",
      "modVersion": "1",
      "virusScanUrl": "https://www.virustotal.com/file/38a0671209a25af5a81f0be3a1c0e545874f396cfb63824472c7561471597c43/analysis/1517485562/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Skyrim%20More%20Immersive%20Zones-89306-1.7z?fid=1000265251&ttl=1535878888&ri=8192&rs=8192&setec=38fc3eabea92921e0cee768f33baff62"
    }
  ]
}