{
  "modId": 89341.0,
  "modName": "Locked up  valuables - Safes and Strongboxes of Skyrim",
  "summary": "A simple mod that puts NPCs vaulables inside a locked safe or lock box.",
  "descriptionHtml": "[font=Verdana][size=3][img]https://staticdelivery.nexusmods.com/mods/110/images/89341/89341-1518610905-1837432231.jpeg[/img][/size]\n<br />\n<br />[size=3]This mod addresses the problem I had while playing as a thief: [u]People keep their valuables out on the open[/u] and assume everyone who walks into their place is an honest person. So This mod assumes NPCs are not totally idiots and wouldn't leave their valuables in plain sight for anyone to steal. \n<br />\n<br />This mod makes that a little tougher. [u]Most valuables (gold, jewelry, gems, ingots) are now locked away[/u]. At least for those who can afford a safe or lock box. Pick the lock or find the key and get the goods.[/size]\n<br />\n<br />[size=4][b]| Detailed outline |\n<br />[/b][/size][/font][font=Verdana]\n<br />[list]\n<br />[*][size=3]Adds new safes and lock boxes for NPCs valuables. Most valuables have been places in either safes or lock boxes.[/size]\n<br />[*][size=3]Lockboxes are for gold, gems and jewelry.[/size]\n<br />[*][size=3]Safes are for larger items like silver ingots but can also contain smaller items. [/size]\n<br />[*][size=3]Most Safes have keys that you can find either on the owner or in a good hiding place around where they might hide it. Most lock boxes do not have keys, so you'll need to pick them. [/size]\n<br />[*][size=3]All locks are static leveled. The wealthier the owner, the more higher quality the lock and thus the harder it is to pick. (lock difficulty does not reflect value of contents)[/size]\n<br />[*][size=3]Not all valuables have been hidden, safes are expensive, only those citizens of Skyrim with means will own one. Poorer cities most likely don't have safes or lock boxes. However people are flawed, they may not put all of their valuables inside locked containers. [/size]\n<br />[*][size=3]Bandits, Forsworn or Orcs are not included. They just aren't sophisticated enough to take advantage of such technology. [/size]\n<br />[*][size=3]All new objects have been placed in a way that isn't intrusive and does not affect navmeshing.  [/size]\n<br />[*][size=3]Individual coins are not placed inside safes or lockboxes because it adds to visual story telling. (At least I think so)[/size]\n<br />[*][size=3]Coin Purses that are intentionally hidden or put out of the way, don't go inside safes or lockboxes because the owner made an attempt to hide them.[/size]\n<br />[/list]\n<br />[size=4][b]| Install &amp; Compatibility |[/b][/size]\n<br />\n<br />[size=3]To install use your mod manager of choice. Make sure the plugin is active. Load order will determine if things are overwritten by any other mods. Use Ted5Edit to check for conflicts. \n<br />\n<br />Compatible with nearly everything except mods that affect the placement of loot. Mods that modify leveled lists are totally fine. Mods that change the value of items are also compatible. \n<br />\n<br />All new objects have been placed in a way that isn't intrusive and does not affect navmeshing. (new items are placed in corners or on tables, so NPCs will never get stuck on a new object)\n<br />\n<br />When in doubt about compatibility, use Tes5Edit.\n<br />\n<br />This mod was build around Requiem, meaning It fits into the type of gameplay you would expect from Requiem (i.e. 'hardcore RPG'), but It would fit nicely into any load order.[/size]\n<br />\n<br />\n<br />[b][size=4]| Future Plans |[/size][/b]\n<br />\n<br />[/font][list]\n<br />[*][font=Verdana][size=3]Personalize contents of safes and lockboxes. Make picking the harder locks 'worth it'. Some lore related notes, letters, books, spells, items and of course more valuables.  [/size][/font]\n<br />[*][font=Verdana][size=3]Add other objects to safes, like higher end potions.[/size][/font]\n<br />[*][font=Verdana][size=3]New meshes for safes and lock boxes to give variety[/size][/font]\n<br />[/list][font=Verdana]\n<br />[size=4][b]| FAQs |[/b][/size]\n<br />\n<br />[size=3][b]Q:[/b] You claim there are keys for safes but I cannot find any. \n<br />[b]A:[/b] They are very well hidden, make sure to look both high and low. \n<br />\n<br />[b]Q:[/b] Okay, I found a key, but how am I suppose to get it. \n<br />[b]A:[/b] Without reveling too much, the keys are movable static objects, meaning they will interact with Skyrim's physics engine. \n<br />[/size][/font]",
  "categoryId": "24",
  "version": "1.0",
  "author": "Spooknik",
  "createdUnix": "1517570522",
  "updatedUnix": "1517570522",
  "containsAdultContent": false,
  "uploadedBy": "Spooknik",
  "primaryFile": null,
  "files": []
}