{
  "modId": 89350.0,
  "modName": "Requiem - Destiny in Russian",
  "summary": "Дополнение для Requiem, целью которого является расширение путей развития персонажа с большим разнообразием выбора способностей, а также правки баланса.",
  "descriptionHtml": "[size=3]Мод добавляет 62 новых перка для 10 навыков, с помощью которых вы сможете как расширить уже полюбившийся вам билд, так и попробовать что-то новое. [/size]\n<br />[size=3]Структура исходных перков Requiem оставлена совершенно нетронутой - все новые перки являются продолжением имеющихся ветвей в деревьях навыков, новыми ответвлениями или вовсе не связанными с имеющимися ветвями линиями.[/size]\n<br />\n<br />\n<br />[font=Times New Roman][color=#fff2cc][size=4][u]ПЕРЕЧЕНЬ НОВЫХ ПЕРКОВ\n<br />[/u][/size][/color][/font][size=2]* Число перед названием - необходимый уровень навыка. Сноска после описания - механические пояснения.\n<br />[/size]\n<br />[b][u][size=3]Стрельба[/size][/u][/b]\n<br />[size=3][b]00 [/b]- Любимый враг: Вы специализируетесь на сражениях с конкретным типом противников, и теперь способны наносить таким врагам увеличенный урон и лучше защищаться от их атак.[/size]\n<br />[size=3]- Выберите предпочитаемый тип противников (животные / нежить / драконы / даэдра / двемерские механизмы), которым вы будете наносить на 15% больше и получать от них на 15% меньше урона.[/size]\n<br />\n<br />[size=3][b]30 [/b]- Разведчик: Хороший разведчик знает, как лучше всего переключиться при необходимости с дальнего на ближний бой.[/size]\n<br />[size=3]- После выстрела из лука атаки в ближнем бою наносят на 20% больше урона в течение 10 секунд.[/size]\n<br />\n<br />[size=3][b]55 [/b]- Ловкий выстрел: Когда вы видите открытые места в обороне противника, вы всегда стараетесь не упустить шанс.[/size]\n<br />[size=3]- Стрела с 50% шансом может нанести 100% критического урона, если враг замахивается для обычной атаки, и 200% критического урона, если враг замахивается для силовой атаки.[/size]\n<br />\n<br />[size=3][b]60 [/b]- Возмездие: Вы получаете больше знаний о своих врагах и способны лучше справляться с такими противниками.[/size]\n<br />[size=3]- Бонусы против избранного типа противников удваиваются.[/size]\n<br />\n<br />\n<br />[size=3][b][u]Блокирование[/u][/b][/size]\n<br />[size=3][b]40 [/b]- Стена из стали: Сила, с которой Вы держите свой щит, просто поражает, поскольку вы можете устоять на ногах даже против сильнейших атак.[/size]\n<br />[size=3]- Иммунитет к ошеломлению и сбиванию с ног во время блока щитом.[/size]\n<br />\n<br />[size=3][b]60 [/b]- Финт: Вы научились обманывать свою цель, начиная блок и проводя сразу же после этого атаку, наносящую увеличенный урон.[/size]\n<br />[size=3]- 50% шанс нанести критический удар, несущий 100% урона, в течение 3 секунд после вхождения в блокирующую позицию не чаще раза в 6 секунд.[/size]\n<br />\n<br />[size=3][b]70 [/b]- Стойкий защитник: Вы хорошо поработали над своей позицией блокирования, так что теперь во время блокирования ваша восприимчивость к физическим атакам из любых источников или направлений значительно снижается.[/size]\n<br />[size=3]- Рейтинг брони повышается на 100 во время блока и на 300 во время блока в присяди (скрытности).[/size]\n<br />\n<br />\n<br />[b][u][size=3]Тяжёлая броня[/size]\n<br />[/u][/b][size=3][b]25 [/b]- Рыцарь: Одно лишь ваше присутствие способно напугать обычных бандитов; а также вы становитесь более умелым всадником.[/size]\n<br />[size=3]- Урон, наносимый бандитами, ниже на 20%. Верхом на коне наносимый урон повышается на 20%, а получаемый снижается на ту же цифру при ношении 3 элементов комплекта тяжёлой брони.[/size]\n<br />\n<br />[size=3][b]30 [/b]- Наковальня: Ваша выучка ношению тяжелой брони позволяет вам частично отклонять урон, наносимый оружием.[/size]\n<br />[size=3]- Получаемый урон от оружия снижается на 10% при ношении 3 элементов комплекта тяжёлой брони.[/size]\n<br />\n<br />[size=3][b]45 [/b]- Гибельная прогулка: Подвижности вы предпочитаете защищенность, поэтому, идя шагом или стоя на месте, вы менее восприимчивы к физическому и стихийному урону.[/size]\n<br />[size=3]- Урон от физических атак или стихийных заклинаний ниже на 20%, если идётё шагом или стоите на месте.[/size]\n<br />\n<br />[size=3][b]50 [/b]- Авангард: Во время нахождения на передовой вы научились отражать первый удар противника, снижая получаемый урон, если до этого были невредимы.[/size]\n<br />[size=3]- При полном здоровье вы получаете только 33% всего урона, с условием ношения 3 элементов комплекта тяжёлой брони.[/size]\n<br />\n<br />[size=3][b]55 [/b]- Боевая готовность: Вы всегда готовы к следующей битве, и как только вы оказываетесь в бою, прилив адреналина дает вам повышенную энергию на короткое время.[/size]\n<br />[size=3]- При начале боя вы получаете прибавки 25% к здоровью и 50% к запасу сил на 30 секунд.[/size]\n<br />\n<br />[size=3][b]70 [/b]- Стальной лязг: Вы научились использовать силу противника против него же и способны отразить его урон при атаке.[/size]\n<br />[size=3]- Когда вы атакуете, 50% получаемого урона отражается. (при ношении 3 элементов комплекта тяжёлой брони)[/size]\n<br />\n<br />[size=3][b]80 [/b]- Стойкость: Ваши отвага и навыки обращения с тяжелыми доспехами позволяют вам противостоять самим стихиям.[/size]\n<br />[size=3]- Получаемый стихийный урон снижен на 25% при ношении 3 элементов комплекта тяжёлой брони.[/size]\n<br />\n<br />\n<br />[b][u][size=3]Уклонение (Лёгкая броня)[/size]\n<br />[/u][/b][size=3][b]00 [/b]- Странник: Вы знаете дикую местность как никто другой, поэтому в состоянии дать более сильный отпор ее хищным обитателям, и можете передвигаться быстрее на открытом воздухе.[/size]\n<br />[size=3]- Под открытым небом вы передвигаетесь на 5% быстрее, а также получаете на 20% меньше урона от животных.[/size]\n<br />\n<br />[size=3][b]00 [/b]- Подвижность: Защите вы предпочитаете маневренность и быстрые удары, поэтому, если вы не носите броню, то атакуете более точно.[/size]\n<br />[size=3]- Когда вы не одеты в доспехи, то имеете 10% шанс нанести критический удрар, а к критическому урону прибавляется по 1% за каждый уровень навыка Уклонения. Кроме того, одежда ничего не весит, и вы получаете на 15% меньше урона во время движения.[/size]\n<br />\n<br />[size=3][b]40 [/b]- Разгон: Вы можете разогнаться прямо навстречу противнику, и, пробежав спринтом достаточно долго, получить всплеск адреналина, который усилит ваши атаки.[/size]\n<br />[size=3]- После спринта минимум 5 секунд атаки в ближнем бою следующие 10 секунд наносят повышенный урон, зависящий от вашего текущего запаса сил - 0.25% урона за единицу стамины.[/size]\n<br />\n<br />[size=3][b]45 [/b]- Преодоление: В сражении с более чем одним противником ваши чувства обостряются, тем самым увеличивая защитные силы.[/size]\n<br />[size=3]- Если врагов в бою с вами больше одного, то при движении вы получаете на 20% меньше физического урона. (если на вас нет ни одного элемента тяжёлой брони)[/size]\n<br />\n<br />[size=3][b]50 [/b]- Зеркало: Вы научились зеркально отражать движения противника, поэтому в тесной схватке с врагом, использующим тот же, что и вы, тип оружия, вы способны нанести больший урон.[/size]\n<br />[size=3]- В бою с врагом, использующим тот же, что и вы, тип оружия, наносимый урон выше на 25%. (если на вас нет ни одного элемента тяжёлой брони)[/size]\n<br />\n<br />[size=3][b]55 [/b]- Адаптация: Вы научились приспосабливаться к стихиям, поэтому, когда вас атакуют огнем, холодом, электричеством или ядом, последующие подобные атаки против вас могут быть менее эффективными.[/size]\n<br />[size=3]- Сопротивление стихиям повышается на 30%, если враг атакует стихийным заклинанием, эффект длится 10 сек.[/size]\n<br />\n<br />[size=3][b]65 [/b]- Подъём: Вы не сдадитесь, пока не умрете. При тяжелых ранах в бою вы чувствуете усиленную жажду к жизни и получаете прилив сил.[/size]\n<br />[size=3]- Когда уровень здоровья падает ниже 50%, запас сил пополняется на 150 единиц, а силовые атаки в следующие 5 секунд наносят на 100% больше урона.[/size]\n<br />\n<br />[size=3][b]70 [/b]- Обтекаемость: Ваши развитые рефлексы и отточенная реакция вознаграждают вас еще больше. Во время спринта прямо на врага у вас есть шанс увернуться от заклинаний и стрел.[/size]\n<br />[size=3]- При спринте в бою 50% шанс избежать урона от стрел и заклинаний. (если на вас нет ни одного элемента тяжёлой брони)[/size]\n<br />\n<br />\n<br />[u][b][size=3]Диггерство (бывший Взлом)[/size]\n<br />[/b][/u][size=3][b]00 [/b]- Искатель приключений: В настоящем приключении факел - надежный товарищ, не только как источник освещения, но и как оружие, если в том возникнет нужда.[/size]\n<br />[size=3]- Удары факелом наносят удвоенный урон, а блокирование с помощью факела снижает получаемый урон холодом на 33%. А также, использование факела в бою повышает навык Диггерства.[/size]\n<br />\n<br />[size=3][b]00 [/b]- Знание места: У любого живущего жизнью авантюриста есть свои любимые места. А какое ваше? (Вы можете выбрать тип подземелий/локаций, с окружением которых вы ознакомились гораздо лучше, и получить повышенную защиту при исследовании таких локаций)[/size]\n<br />[size=3]- Выберите тип локаций (Двемерские руины / Бандитский лагерь / Нордские руины / Фалмерское логово / Лагерь Изгоев), в которых вы будете получать прибавку в 100 к рейтингу брони и в 10% к сопротивлению магии. Также вы будете повышать навык Диггерства при вхождении в бой в такой локации)[/size]\n<br />\n<br />[size=3][b]30 [/b]- Поджог: Ваши боевые способности с факелом в руках достигли того момента, когда вы можете использовать факел для ослабления противников.[/size]\n<br />[size=3]- Удар факелом на 3 секунды снижает рейтинг брони цели на 100 ед. и наносимый ею урон на 20%.[/size]\n<br />\n<br />[size=3][b]50 [/b]- Обитатель подземелий: При исследовании локаций избранного типа вы все лучше и лучше изучаете их обитателей, что позволяет вам наносить им больше урона.[/size]\n<br />[size=3]- В избранном типе локаций наносимый урон повышается на 25%.[/size]\n<br />\n<br />[size=3][b]60 [/b]- Свет во тьме: Вы можете использовать свой факел, чтобы сбить врагов с толку, часто открывая их для смертельных атак.[/size]\n<br />[size=3]- Наличие факела в руке повышает шанс критического удара на 20% и критический урон на 25%. Урон удваивается, если цель горит.[/size]\n<br />\n<br />\n<br />[b][u][size=3]Одноручное оружие[/size]\n<br />[/u][/b][size=3][b]00 [/b]- Прозапас: Вы предпочитаете держать свое одноручное оружие прозапас или для того, чтобы добить своего противника, таким образом, используете его более эффективно, когда уровень здоровья врага низок.[/size]\n<br />[size=3]- Когда уровень здоровья цели ниже 50%, наносимый ей урон повышается на 20%.[/size]\n<br />\n<br />[size=3][b]00 [/b]- Фехтовальщик: Когда вы держите левую руку пустой, то гораздо лучше балансируете и можете более точно поражать цели.[/size]\n<br />[size=3]- Если в вашей левой руке нет ничего (или есть факел), шанс критического удара одноручным оружием выше на 20% и критический урон выше на 50%, а блокирование этим оружием лучше на 30%.[/size]\n<br />\n<br />[size=3][b]25 [/b]/ [b]50 [/b]/ [b]75 [/b]- Предпочтение кинжалам: Хорошо выучившись обращению с кинжалами, вы можете отыскивать и поражать открытые места в обороне противника.[/size]\n<br />[size=3]- Трёхранговый перк. Критические удары кинжалами наносят на 50% / 75% / 100% больше урона, 10% / 20% / 30% шанс игнорировать 75% рейтинга брони противника.[/size]\n<br />\n<br />[size=3][b]30 [/b]- Знание легкого оружия: Ваши познания о легком вооружении позволяют вам более умело защищать себя от такого оружия.[/size]\n<br />[size=3]- Получаемый от одноручного оружия урон ниже на 10%. Удары одноручным оружием имеют на 5% больший шанс критического удара, наносящего на 15% больше урона.[/size]\n<br />\n<br />[size=3][b]35 [/b]- Прямиком из ножен: При извлечении оружия из ножен вы можете застать врага врасплох, нанеся ему огромный урон за короткое время.[/size]\n<br />[size=3]- В течение 3 секунд после извлечения оружия из ножен есть 50% шанс критического удара, наносящего на 50% больше урона. (Не чаще раза в 10 секунд)[/size]\n<br />\n<br />[size=3][b]45 [/b]- Контратака: Быстрота ваших рефлексов с одноручным оружием позволяют вам нещадно наказывать тех врагов, кто осмелился выступить против вас в полную силу.[/size]\n<br />[size=3]- Когда цель замахивается для силовой атаки, есть 50% шанс нанести критический удар, наносящий на 100% больше урона.[/size]\n<br />\n<br />[size=3][b]50 [/b]- Дуэлянт: Вы стали хорошим дуэлянтом, и пока ваша левая рука пуста и вы концентрируетесь на одной цели, вы можете выявить ее слабые места, часто игнорируя сопротивления ее брони.[/size]\n<br />[size=3]- Пока правая рука держит оружие, а левая ничего (или факел), есть 20% шанс игнорировать рейтинг брони противника.[/size]\n<br />\n<br />[size=3][b]55 [/b]- Обход: Вы научились обходить блокирующую позицию противника при выполнении силовых атак с движением в сторону.[/size]\n<br />[size=3]- Силовые атаки с движением в сторону наносят на 200% больше урона блокирующим противникам.[/size]\n<br />\n<br />[size=3][b]65 [/b]- Защитная стойка: Никогда не сводя глаз с движений противника, вы можете предпринимать защитные силовые атаки с движением назад.[/size]\n<br />[size=3]- При проведении силовых атак с движением назад получаемый урон снижается на 80%.[/size]\n<br />\n<br />[size=3][b]75 [/b]- Отбивание стрел: Ваши впечатляющие молниеносные рефлексы позволяют вам отразить стрелу в полете с помощью одноручного оружия.[/size]\n<br />[size=3]- Своевременным взмахом одноручного оружия вы можете отразить стрелу в полёте.[/size]\n<br />\n<br />\n<br />[b][u][size=3]Карманные кражи[/size]\n<br />[/u][/b][size=3][b]00 [/b]- Собиратель: До вас дошли слухи о магах, зачаровавших ныне утерянные монеты. Большинство бы восприняло их за обычные монеты, но теперь вы можете их распознать и собрать, чтобы раскрыть их секретные чары.[/size]\n<br />[size=3]- Вы можете найти 7 типов редких зачарованных монет: сиродильские, морровиндские, нордские, валенвудские, саммерсетские, двемерские, монеты снежных эльфов (шанс нахождение зависит от локации и расы противника). Собрав все 7 и держа их в инвентаре, вы получите прибавку в 40 единиц к здоровью, запасу сил и запасу магии.[/size]\n<br />\n<br />[size=3][b]00 [/b]- Специальное издание: Когда вы не в путешествии, вы не прочь почитать хорошую книгу, и вам как раз не хватает трех в вашей коллекции. Но книги эти очень редки, и вам понадобится хорошо постараться, чтобы найти их, возможно, в руках сильных противников. Ведь они того стоят.[/size]\n<br />[size=3]- У высокоуровневых врагов (уровня 20+) вы можете отыскать 3 редких книги, каждая наделит вас постоянным бонусом.[/size]\n<br />[size=3](Воин: +10% к урону и +5% к рейтингу брони; Вор: более тихое передвижение и 1.5-кратный множитель скрытных атак; Маг: -10% стоимости сотворения заклинаний и +10% к силе зачарований)[/size]\n<br />\n<br />[size=3][b]50 [/b]- Скопидом: Вы держите свои сокровища при себе, чтобы помнить свои прошлые победы и вдохновляться на будущие.[/size]\n<br />[size=3]- Когда ваш инвентарь отягощают более 5000 монет, навыки растут на 20% быстрее.[/size]\n<br />\n<br />\n<br />[size=3][u][b]Скрытность[/b][/u][/size]\n<br />[size=3][b]25 [/b]- Укрытие стихии: Вы научились использовать неблагоприятные погодные условия в своих целях так, что в ненастную погоду вашим врагам становится труднее вас обнаружить.[/size]\n<br />[size=3]- Во снежную или дождливую погоду врагам труднее вас обнаружить.[/size]\n<br />\n<br />[size=3][b]30 [/b]- Теневой кинжал: Тень - ваш союзник, и вы используете ее, чтобы застать врага врасплох, нанося увеличенный урон во тьме.[/size]\n<br />[size=3]- Скрытные атаки смертельнее, если происходят из тени - 10% / 20% / 30% шанс критического удара, наносящего на 50% больше урона. Бонус тем больше, чем меньше освещённость.[/size]\n<br />\n<br />[size=3][b]55 [/b]- Крадущийся в подземелье: Вы хорошо изучили звуки подземелий и теперь используете их в своих целях при исследовании пещер и руин.[/size]\n<br />[size=3]- В пещерах и руинах вас намного сложнее обнаружить.[/size]\n<br />\n<br />[size=3][b]60 [/b]- Плащ теней: Вы растворяетесь в объятиях теней и затем используете их для уклонения от поступающих атак противников.[/size]\n<br />[size=3]- 10% / 20% / 30% шанс получить на 75% меньше урона при сражении в тени. Бонус тем больше, чем меньше освещённость.[/size]\n<br />\n<br />\n<br />[b][u][size=3]Двуручное оружие[/size]\n<br />[/u][/b][size=3][b]00 [/b]- Варвар: Броня служит для вас только отягощающим грузом, поскольку вы доверяете лишь силе собственного тела.[/size]\n<br />[size=3]- Носимая броня весит на 100-300% больше (высококачественные доспехи весят больше низкокачественных) и на 20% менее эффективна, однако вы передвигаетесь на 10% быстрее, получаете прибавку 100 ед. к рейтингу брони и наносите на 20% больше урона, если ваш уровень здоровья ниже 75%.[/size]\n<br />\n<br />[size=3][b]00 [/b]- Чистый воин: Оставьте магию для этих волшебников в причудливых мантиях, все, что вам нужно - сила и энергия в бою.[/size]\n<br />[size=3]- Вы лишаетесь запаса магии, но получаете прибавки по 50 ед. к здоровью и запасу сил.[/size]\n<br />\n<br />[size=3][b]25 [/b]- Магоубийца: Некоторые считают сталь сильнее магии, в том числе и вы. Ваша восприимчивость к магии снижается, а ваша ненависть к ней делает вас смертоноснее в сражениях против заклинателей.[/size]\n<br />[size=3]- Творящим заклинание врагам вы наносите на 25% больше урона и получаете 15% сопротивления их заклинаниям.[/size]\n<br />\n<br />[size=3][b]30 [/b]- Знание тяжелого оружия: Ваши познания о тяжелом оружии позволяют вам лучше от него защищаться.[/size]\n<br />[size=3]- Получаемый двуручным оружием урон снижается на 15%. А ваши удары двуручниками имеют на 10% увеличенный шанс критического удара, наносящего на 15% больше урона.[/size]\n<br />\n<br />[size=3][b]40 [/b]- Тяжелая рука: Вы вкладываете больше усилий в свои атаки, делая их более смертоносными, но также сильнее устаете.[/size]\n<br />[size=3]- Силовые атаки двуручниками наносят на 0.25% больше урона за единицу текущего запаса сил, но затраты сил на такие атаки возрастают на те же цифры.[/size]\n<br />\n<br />[size=3][b]50 [/b]- Берсерк: Радость битвы и запах крови позволяют вам выдержать долгий бой.[/size]\n<br />[size=3]- В бою, если ваш запас сил выше 50%, то восстановление его происходит с постоянной скоростью (2 ед./сек) и вы атакуете на 10% быстрее.[/size]\n<br />\n<br />[size=3][b]50 [/b]- Охота на ведьм: Ваша нелюбовь к магии делает вас гораздо невосприимчивее к ней. Кроме того, вы становитесь смертоноснее в схватках с ворожеями, Изгоями и некромантами.[/size]\n<br />[size=3]- В сражении с ворожеями, Изгоями и некромантами ваше сопротивление магии возрастает на 30%, а наносимый им урон на 25%.[/size]\n<br />\n<br />[size=3][b]50 [/b]- Неистовство: При серьезных ранениях вы получаете прилив адреналина, который позволяет атаковать с большей скоростью.[/size]\n<br />[size=3]- Скорость атаки возрастает на 15% при уровне здоровья ниже 50%, и на 30% при здоровье ниже 25%.[/size]\n<br />\n<br />[size=3][b]60 [/b]- Превосходство: Вы уже показали боевое превосходство над своими врагами, и теперь можете прикончить их быстрее, если у них осталось мало здоровья.[/size]\n<br />[size=3]- Шанс критического удара выше на 20% против врагов с уровнем здоровья ниже 50%, а критический урон выше на 100% против врагов с уровнем здоровья ниже 50%, и на 200% выше против врагов с уровнем здоровья ниже 25%.[/size]\n<br />\n<br />[b]70 [/b][size=3]- Медвежья стойка: Вы научились лучше защищать себя во время проведения силовых атак двуручным оружием.[/size]\n<br />[size=3]- При проведении силовых атак стоя на месте получаемый урон ниже на 50%.[/size]\n<br />\n<br />[size=3][b]80 [/b]- Раскол: В ходе интенсивных тренировок вы научились всегда искать слабые места своих противников, и поэтому у вас есть шанс игнорировать рейтинг брони вашей цели при силовом ударе с движением вперед.[/size]\n<br />[size=3]- При силовой атаке с движением вперёд есть 50% шанс игнорировать рейтинг брони противника.[/size]\n<br />\n<br />\n<br />[b][u][size=3]Кузнечное дело[/size]\n<br />[/u][/b][size=3][b]30 [/b]- Лунная кузница: Вы познали секреты Лунной кузницы и с этими знаниями теперь можете создавать улучшенное стальное оружие с вампирическими особенностями. Также вы можете создавать в этой кузнице древнее нордское снаряжение и сильнее его улучшать.[/size]\n<br />[size=3]- Можете создавать Лунное стальное и древнее нордское снаряжение в Лунной кузнице. Эффект лунного оружия был изменён для лучшего соответствия их описанию - теперь они вытягивают здоровье в ночное время и имеют бесконечный заряд.[/size]\n<br />\n<br />[size=3][b]60 [/b]- Кровная родня: Вы проводите с орками достаточно времени, чтобы они могли теперь назвать вас другом и поведать вам о секретах своего легендарного кузнечного мастерства, а также продавать вам свои товары со скидкой.[/size]\n<br />[size=3]- Орки продают вам товары по сниженным на 30% ценам, улучшение снаряжения в орочьих крепостях эффективнее на 20% (а орочьего снаряжения - на 30%).[/size]\n<br />\n<br />[size=3][b]60 [/b]- Двемерское ремесло: Древнее искусство двемерского кузнечного дела больше не тайна для вас и теперь вы можете делать собственные наработки, нужно только хорошее руководство и правильные материалы.[/size]\n<br />[size=3]- Вы сможете создать в кузнице: [/size]\n<br />[size=3]   - Топор центуриона - повышенный на 20% шанс критического удара, при критических ударах 15 ед. урона огнём в секунду на 5 секунд.[/size]\n<br />[size=3]   - Молот центуриона - повышенный на 20% шанс критического удара, при критических ударах 20 ед. урона паром в секунду на 5 секунд.[/size]\n<br />[size=3]   - Меч двемерской сферы - повышенный на 20% шанс критического удара, при критических ударах вызывает у живых существ 5-секундное кровотечение.[/size]\n<br />[size=3]   - Лук двемерской баллисты - 25% пробивание брони.[/size]\n<br />[size=3]   - Большой двемерский арбалет - 50% пробивание брони.[/size]\n<br />[size=3]   - Щит из двемерской сферы - при ударе плашмя 50% шанс нанести 30 ед. урона электричеством.[/size]\n<br />[size=3]   - Орнаментированный двемерский двуручник - очень ценный и считается серебряным.[/size]\n<br />\n<br />[size=3][b]90 [/b]- Сталь Небесной кузницы: Вы научились многому с тех пор, как выковали свой первый кинжал. Теперь даже Йорлунду Серой Гриве нечему вас учить, потому как вы нашли способ улучшать стальное небесное оружие самостоятельно.[/size]\n<br />[size=3]- Вы сможете создавать хорошее стальное небесное оружие (всех типов), отличающееся от просто стального небесного немного более высоким уроном и 25-процентным пробиванием брони. Для создания каждой единицы оружия потребуется безупречный бриллиант. Кроме того, в Небесной кузнице вы можете улучшать любое снаряжение на 20% эффективнее (а хорошее стальное небесное оружие на 55%).[/size]\n<br />\n<br />\n<br />\n<br />[u][font=Times New Roman][color=#fff2cc][size=4]ПРАВКИ БАЛАНСА\n<br />[/size][/color][/font][/u][size=3]Наряду с новым перками, мод вносит множество правок в попытке сохранения игрового баланса.[/size]\n<br />\n<br />[u][size=3]Условия перков тяжёлой и лёгкой брони[/size]\n<br />[/u][size=3]Многие условия перков этих двух навыков изменены таким образом, что для получения действия перков лёгкой брони вам придётся не носить вообще никаких элементов тяжёлой брони, а для действия перков тяжёлой брони потребуется носить как минимум 3 элемента тяжёлой брони.[/size]\n<br />\n<br />[u][size=3]Прогрессия магии[/size]\n<br />[/u][size=3]Потерпела радикальные изменения; новичкам в магии будет легче творить заклинания примерно с той же силой, но прогрессия в магических школах имеет более низкую кривую по сравнению с Requiem, где мастерские заклинания могли наносить до 200% урона (в оригинальном Skyrim - 500%). Чтобы компенсировать это, каждый основной перк магических навыков снижает затраты энергии на заклинания соответствующего уровня на 70% (было 55%).[/size]\n<br />\n<br />[u][size=3]Прогрессия навыков[/size]\n<br />[/u][size=3]Requiem убирает большинство источников скалирования многих навыков, но добавляет их магическим навыкам. Это теперь частично исправлено. Основные перки многих навыков применяют небольшой бонус к эффективности навыка, вместо добавления фиксированного бонуса.[/size]\n<br />\n<br />[u][size=3]Нет крафтовому гринду[/size]\n<br />[/u][size=3]Зелья и зачарования повышения навыков зачарования, кузнечного дела и алхимии в Destiny ускоряют рост соответствующих навыков вместо усиления создаваемых предметов.[/size]\n<br />\n<br />[u][size=3]Более полезные зачарования и зелья[/size]\n<br />[/u][size=3]Эффект повышения навыка одноручного оружия, повышающий урон от одноручного оружия, заменён на эффект повышения скорости атаки оружием, повышающий скорость атаки любым оружием. Также, эффекты повышения навыков взлома, карманных краж и скрытности получили вторичные бонусы, делающие эти эффекты более полезными в бою.[/size]\n<br />\n<br />[u][size=3]Менее раздражающие вражеские яды[/size]\n<br />[/u][size=3]Увеличение сопротивления ядам для того, чтобы не драться вслепую с фалмерами и пауками, но теперь они имеют 25% шанс применения.[/size]\n<br />\n<br />[u][size=3]Критический урон[/size]\n<br />[/u][size=3]Это то, что обязательно нужно учитывать. Основные перки одноручного, двуручного оружия и стрельбы прибавляют по 5% шанса критического удара, а сам критический урон был поднят для соответствия повышенному урону от оружия в Requiem. Обратите внимание, что многие из новых перков используют систему критического урона вместо обычного, что хорошо, поскольку привносит больше непредсказуемости.[/size]\n<br />\n<br />[u][size=3]Вражеские сопротивления[/size]\n<br />[/u][size=3]Были частично переделаны. Новая реализация предлагает повышенную совместимость, т.к. многие механические перки Requiem оставлены пустыми, и всё перемещено в перк урона серебром. В этом и есть большое преимущество, т.к. этот перк раздаётся всем актёрам - как оригинальным, так и добавляемым модами.[/size]\n<br />\n<br />\n<br />\n<br />[u][b][size=3]Рекомендуемый порядок загрузки:[/size]\n<br />[/b][/u][size=3]- Requiem[/size]\n<br />[size=3]- некий набор патчей Requiem[/size]\n<br />[size=3]- Requiem - Destiny[/size]\n<br />\n<br />\n<br />[b][u][size=3]Помимо основного мода в архиве присутствуют патчи:[/size]\n<br />[/u][/b][size=3]- Для DLC Dragonborn;[/size]\n<br />[size=3]- Armor Patch - модуль, ребалансирующий параметры многих доспехов для улучшения кривой линии прогрессии защиты[/size]\n<br />[size=3]- Для aMidianBorn ContentAddon;[/size]\n<br />[size=3]- Armor Patch для aMidianBorn ContentAddon. Если ставите \"Armor Patch\", то крайне рекомендуется установить и этот плагин;[/size]\n<br />[size=3]- Для Enchanting Awakened;[/size]\n<br />[size=3]- Для Requiem Plus.[/size]\n<br />\n<br />\n<br />[b][u][size=3]Установка[/size]\n<br />[/u][/b][size=3]Крайне рекомендуется с помощью NMM или MO - не зря же я делал FOMOD-установщик, который распознает установленные моды, для которых в архиве имеется патч, и предложит этот патч установить.[/size]\n<br />[size=3]Вручную: из папки \"- destiny\" установить основной мод. Опционально установить патч(и) из подпапки(ок) папки \"-patches\".[/size]\n<br />\n<br />\n<br />[b][font=Times New Roman][size=5]! [/size][/font][/b][size=3]Внимание - после установки мода необходимо начать новую игру.[/size]\n<br />\n<br />\n<br />\n<br />[size=3][u]Благодарности[/u]:[/size]\n<br />[url=http://tesall.ru/user/141486-richard-zeidler/]Richard Zeidler[/url][size=3] за помощь с нахождением подходящей адаптации названия переименованного навыка,[/size]\n<br />[url=http://tesall.ru/user/1072-darkghost/]DarkGhost[/url][size=3] за тестирование перевода (кое-что благодаря ему стало лучше),[/size]\n<br />[size=3]Wenderer за [/size][url=https://www.nexusmods.com/fallout4/mods/6821/]FOMOD Creation Tool[/url][size=3].[/size]",
  "categoryId": "24",
  "version": "3.8",
  "author": "Alex9ndre",
  "createdUnix": "1517615115",
  "updatedUnix": "1517615115",
  "containsAdultContent": false,
  "uploadedBy": "Vitalyudin",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265388",
      "name": "Requiem - Destiny",
      "version": "3.8",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "10414",
      "fileName": "Requiem - Destiny-89350-3-8.7z",
      "uploadedUnix": "1517615101",
      "modVersion": "3.8",
      "virusScanUrl": "https://www.virustotal.com/file/a3abb4a038841914b1799b5027658abc8ebc0c21784beecc748e03c6068a8355/analysis/1517615198/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Requiem%20-%20Destiny-89350-3-8.7z?fid=1000265388&ttl=1535878963&ri=8192&rs=8192&setec=060c7555804dec2fae178349db864407"
    }
  ]
}