{
  "modId": 89390.0,
  "modName": "Border Guards - Rebranded",
  "summary": "A re-brand of an old mod, prepare for Border Guards!",
  "descriptionHtml": "[size=2]This mod is a re-brand of my old mod, Cyrodiil Border Guards. It does almost the same thing, but instead replaces the two Imperial Guards at the Morrowind Border with Redoran Guards. It also adds two Crown-aligned Redguards to protect the Hammerfell border. The Imperial Guards at the Pale Pass Border Gate remain, though.\n<br />\n<br />So, in Skyrim, you can find three gates to other provinces. Hammerfell, Morrowind, and Cyrodiil. I wondered \"Why aren't these guarded? I mean, the player WAS arrested trying to cross the border. Well who by Shor detained you? Tullius and his men? Oh, wait. They did? Well, be that as it may, it is too easy to cross the border. Stormcloak Spies could easily cross. Hell, isn't Skyrim embroiled in Civil War? Don't the generals believe vigilance is key to victory? Time to fix this unimmersive mess.\".\n<br />\n<br />[/size][size=2]This mod adds two guards to the Pale Pass Gate, to the Rift Gate, and to the Hammerfell Gate. This mod is small and doesn't over embellish the borders, so it should be pretty compatible with any other mod that does the same as this mod. Please, by all means, use this mod in combination with other Border Mods.[/size]\n<br />\n<br />[size=2]The Imperial Border Guards are hostile to Stormcloaks.[/size]",
  "categoryId": "33",
  "version": "1.0",
  "author": "kvatchcount",
  "createdUnix": "1517773457",
  "updatedUnix": "1517773457",
  "containsAdultContent": false,
  "uploadedBy": "kvatchcount",
  "primaryFile": null,
  "files": [
    {
      "fileId": "1000265572",
      "name": "Border Guards - Rebranded",
      "version": "1.0",
      "categoryId": "1",
      "categoryName": "MAIN",
      "isPrimary": false,
      "size": "837",
      "fileName": "Border Guards - Rebranded-89390-1-0.zip",
      "uploadedUnix": "1517773308",
      "modVersion": "1.0",
      "virusScanUrl": "https://www.virustotal.com/file/47fa4ba0851526e828b97aada899197dc20464fd969a15fcb402490a1ff59af1/analysis/1517773385/",
      "changelogHtml": null,
      "cdnName": "Nexus Global Content Delivery Network",
      "downloadUrl": "https://filedelivery.nexusmods.com/110/Border%20Guards%20-%20Rebranded-89390-1-0.zip?fid=1000265572&ttl=1535879028&ri=8192&rs=8192&setec=b3a9106fa3145afdf36ad9fc413d9f06"
    }
  ]
}